{"id": 2, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14009478.html", "title": "Chapter 2 - 2: Doomsday Hotel", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 2 - 2: Doomsday Hotel</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 2: Chapter 2: Doomsday Hotel <br/><br/>Doomsday Hotel is an extremely luxurious hotel, with only two branches nationwide, one in the Imperial Capital and the other in Truro City. <br/><br/>It has a hundred-year history and has undergone several renovations, with almost all of its decoration made of real gold and jade. <br/><br/>The people who can enter here are either rich or powerful. <br/><br/>When Robinson Scott came out, Daisy Zane was looking at a vase worth at least seven figures in a corner spot. <br/><br/>\"Superstar, what are you looking at?\" Robinson Scott called her from a distance. <br/><br/>Hearing the voice, Daisy Zane turned around, and a hint of a faint smile appeared in her eyes. <br/><br/>\"It's for you.\" Robinson Scott took a wooden box from his bag and handed it to her, \"It's not as good as the last auction, but it's also a high-quality item, from a collector's hand.\" <br/><br/>Daisy Zane took it and opened the box to take a look. <br/><br/>Inside was a white jade hairpin, the head of which was an openwork carving, looking quite old but well preserved. <br/><br/>The last time at the auction, there was a dispute over a red jade hairpin, and the final raised price far exceeded the value of the hairpin. Daisy Zane didn't bid any further, allowing the other party to get it. <br/><br/>\"Thank you, you've gone to a lot of trouble.\" <br/><br/>\"It's nothing.\" Robinson Scott's appearance had a bit of an exotic flavor, but when he smiled, it was very cute, \"Just treat me to a drink.\" <br/><br/>\"Alright, let's go, I'll treat you to a drink.\" <br/><br/>\"Next time.\" Robinson Scott laughed, \"I still have a task later.\" <br/><br/>\"You seem to be quite busy.\" Daisy Zane's facial expression didn't change, still maintaining a cold and distant look, but the words carried a teasing tone. <br/><br/>Robinson Scott narrowed his deep eyes and complained in a low voice with some grinding his teeth, \"That's because someone said they wouldn't take any tasks this year, so they all got pushed onto me. I don't even have time for a relationship!\" <br/><br/>\"How miserable.\" <br/><br/>Robinson Scott looked at her with a resentful expression. <br/><br/>Seeing his look, Daisy Zane couldn't help but lower her head and laugh softly. <br/><br/>The cold beauty's face had a touch of a smile, like sunshine falling on snow, making the cold snow even more beautiful. <br/><br/>\"Seeing how pretty you are, I won't hold it against you.\" Robinson Scott was conquered by her smile, \"By the way, how's your matter going? Did you find anything?\" <br/><br/>\"I haven't got any useful information.\" When it came to this matter, Daisy Zane seemed a bit annoyed. <br/><br/>\"The item has passed through so many hands by the time it reaches him. And they are very careful, all transactions are done offline, just being able to trace this one thread is already not easy.\" Robinson Scott said, \"Just take your time.\" <br/><br/>\"Let's go, I'll walk you.\" Daisy Zane gave the hairpin back to her, \"Ask someone to bring it back to the Imperial Capital and put it with the previous ones.\" <br/><br/>Robinson Scott took it and put it back in his bag. He just showed it to her to see if she liked it, not expecting her to keep it: \"What kind of a habit is collecting so many and not using them, using some crappy wood, and plastic every day.\" <br/><br/>\"Too poor to use something that expensive.\" <br/><br/>But what she saw was Daisy Zane entering the grand hall of the hotel. <br/><br/>The waiter inside immediately greeted her, and Daisy Zane showed him her room card. With a respectful gesture, the waiter led Daisy Zane into the hotel. <br/><br/>Amelia Miles' fingers hanging at her side tightened involuntarily. How could a countryside girl like her have the money or qualifications to stay in the Doomsday Hotel? <br/><br/>\"She... really went in.\" <br/><br/>Suddenly someone spoke, and Amelia Miles' sweet expression returned somewhat hurriedly. <br/><br/>The people she had sent out were in the entertainment industry and had a small reputation, but they were not top-tier. <br/><br/>They couldn't afford to stay in the Doomsday Hotel. <br/><br/>Clarissa Mason and Daisy Zane were in the same entertainment company. As soon as Daisy Zane signed with the company, she got a cameo role in a big director's movie. That role had belonged to Clarissa Mason before Daisy Zane joined the company. <br/><br/>\"Sister, she is really good.\" Amelia Miles whispered softly. <br/><br/>\"Good at seducing people, maybe.\" Clarissa Mason's jealousy was intense, as if she wanted to grind her teeth. <br/><br/>\"Long Joy, don't talk nonsense.\" <br/><br/>\"I'm not talking nonsense.\" Clarissa Mason wrapped Amelia Miles's arm, \"Amelia, you're too naive. How could she snatch my role without any tactics? I had already auditioned and secured the role before she came. And then she stole it.\" <br/><br/>\"Yes, she's just a poor girl, wearing fake goods all over. How could she possibly stay at the Doomsday Hotel? Maybe she's with someone.\" The person next to them chimed in. <br/><br/>\"You guys, don't talk about my sister like that.\" Amelia Miles said, but in her heart, she felt much more comfortable. <br/><br/>\"Amelia, don't be stupid and think about others all the time.\" Clarissa Mason said, \"You treat her as a sister, but does she treat you as a sister? You should be smart and not let the whole Miles family fall into her hands. She hasn't even gone to school, just a bumpkin with nothing but dirty tricks in her head.\" <br/><br/>Amelia Miles slowly lowered her head, her expression tense, and said no more. <br/><br/>... <br/><br/>\"Arthur, shall we go next door and have a look?\" <br/><br/>Allonzo Hobson and Kevin Clark were standing on the balcony of room 3603, looking next door. <br/><br/>After the fat man had finished speaking, Kevin Clark had him taken away. <br/><br/>\"No need.\" Kevin Clark took his gaze back, \"Since he's not the man's accomplice and has the same information as us, there's no need to meet.\" <br/><br/>\"That's true.\" Allonzo Hobson sighed, \"The news has been cut off again.\" <br/><br/>\"Place another order with Celestial Pivot Detective Agency.\" Kevin Clark said. <br/><br/>Allonzo Hobson nodded, \"Celestial Pivot is running into hard orders indeed.\" <br/><br/>Kevin Clark did not speak, his narrow eyes radiating cold. After standing on the balcony for a while, he turned and left the room. <br/><br/>As he opened the door, Kevin Clark couldn't help but glance at the door of the room next door, just in time to see Daisy Zane opening the door. <br/><br/>Daisy Zane also heard the movement and turned her head to take a look. <br/><br/>...You'll discover the inception of this content at n0v@lbin★\t\t\t\t\t\t</div>", "images": {}, "success": true}