{"id": 5, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14009481.html", "title": "Chapter 5 - 5: Not Just A Little Cold...", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 5 - 5: Not Just A Little Cold...</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 5: Chapter 5: Not Just A Little Cold... <br/><br/>Robinson Scott slept until around four in the afternoon. <br/><br/>Daisy Zane waited for him to wake up before she left. <br/><br/>She had visited the chemistry laboratory at Truro University and didn't leave until past eleven o'clock at night, she then took a cab back to the Everlasting Palace. <br/><br/>In September, Truro City was still very hot, but there was a slight breeze at night. <br/><br/>Daisy Zane looked outside the car; her face was reflected on the car window. Even without any makeup, her beauty was stunning. Her lips were slightly pursed, and her eyes half-lowered. <br/><br/>The car window was lowered somewhat, and a slight breeze came in, cooling and soothing. <br/><br/>Only then did Daisy Zane take a good look at the street scene outside; she was almost at the Everlasting Palace. <br/><br/>She asked Mr. Driver to stop the car, planning to walk the rest of the way. <br/><br/>Mr. Driver, an uncle-like figure, gave her several warnings, but seeing her insistence on walking back by herself, he finally drove away. <br/><br/>The place was a newly constructed commercial district, ready for leasing. <br/><br/>Thus, the entire area was a bit dark, aside from the street lamps lining the road, and there wasn't a single person. <br/><br/>Daisy Zane was still wearing the casual clothes from the morning, but due to her lab work, her high ponytail had been transformed into a loose bun with some stray strands falling against her forehead, floating casually with the breeze. <br/><br/>She strolled leisurely down the street when she suddenly heard yelling and footsteps approaching from afar. <br/><br/>\"Stop! Or I'll shoot!\" <br/><br/>The sound came from the alley ahead; Daisy Zane continued to walk forward as if she didn't hear it at all, stopping at the entrance of the alley. <br/><br/>The man in the alley who was desperately escaping saw a woman standing at the entrance and instantly thought of taking her hostage, flicking open the spring knife in his hand. <br/><br/>The policeman who was chasing after also spotted Daisy Zane and yelled out, \"Get out of the way!\" <br/><br/>Almost simultaneously, a man from the copilot seat of a Maybach on the opposite side of the road got out before the car had fully stopped. <br/><br/>However, Daisy Zane stood in place without moving, even lowering her head to send a text message. <br/><br/>She put her cellphone back in her pocket as the man from the alley came up to her side, reaching for her shoulder. <br/><br/>Just as he was about to touch her, Daisy Zane raised her hand to grab his wrist and twisted it. <br/><br/>It seemed like a straightforward action, but the man bent over in pain and from the inertia of his body. <br/><br/>However, the fugitive, who evidently had extensive escaping experience, immediately stood up straight, enduring the pain. His wrist made a crisp snapping sound, and his other hand lunged at her with the knife. <br/><br/>\"Let's go, I'll walk you home.\" Kevin said. <br/><br/>Daisy Zane glanced at the car parked opposite him, which was in the opposite direction to her, and said, \"No need, I'm just a few steps away.\" <br/><br/>\"Then let me walk those few steps with you.\" <br/><br/>Daisy Zane's eyebrows quivered slightly and she then said, \"Alright.\" <br/><br/>The two walked side by side, maintaining an appropriate distance, neither of them speeding up. <br/><br/>With a height close to 1.9 meters, Kevin Clark has a wickedly attractive appearance, his long, narrow eyes exuding a compelling aggressiveness. Yet, his demeanor was surprisingly elegant. <br/><br/>His gait and manners were reminiscent of the young masters from England's period. <br/><br/>Up close, a faint scent of eaglewood lingered on him, smelling quite pleasant. <br/><br/>\"Miss Zane, are you a local resident of Truro City?\" <br/><br/>His voice was clear and deep, carrying a pleasant archaic accent. <br/><br/>\"I grew up in Cold Green Village.\" <br/><br/>Kevin Clark glanced at her. With her fair and delicate skin, it was hard to picture her growing up in Cold Green Village. <br/><br/>It wasn't that he looked down upon the countryside; it was just that Cold Green Village was so remote and inaccessible. <br/><br/>Surrounded by mountains and cliffs, the village was extremely difficult to reach. If he remembered correctly, even now there was no internet and cell phones had no signal there. <br/><br/>It had always been a key poverty alleviation target, but progress was challenging due to the harsh conditions. <br/><br/>\"What? Do you despise people from the countryside?\" Daisy Zane turned her head and looked at him with a cold tone in her voice. <br/><br/>\"No.\" Kevin Clark looked back at her, with a slight smile at the corner of his mouth. \"I'm more afraid that Miss Zane despises us dissipated sons.\" <br/><br/>Daisy Zane withdrew her gaze and looked forward, a trace of a smile hovering at the corner of her mouth. <br/><br/>Seeing her smile, Kevin Clark also followed suit with a soft chuckle. <br/><br/>The little girl looked even more beautiful when she smiled; she ought to smile more often. <br/><br/>Though their conversation wasn't heavy, their walk together felt remarkably harmonious. <br/><br/>Kevin Clark walked Daisy Zane to the entrance of her residential complex and watched as she entered. He then phoned Allonzo Hobson, \"Pick me up.\" <br/><br/>On the other side of the call, Allonzo Hobson was speechless to the point that his mouth twitched, while he started the car, he quipped, \"Just a while ago when I offered to drop you guys, you insisted on walking. Now that you've escorted her you can't be bothered to walk these remaining few steps? So the whole point was that you found me a nuisance, right?\" <br/><br/>Kevin Clark: \"Now you get it.\" <br/><br/>Allonzo Hobson: \"......\"This material is rooted in n0velbin★\t\t\t\t\t\t</div>", "images": {}, "success": true}