{"id": 3, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14009479.html", "title": "Chapter 3 - 3 Agent", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3 - 3 Agent</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3: Chapter 3 Agent <br/><br/>Their gazes met, and Daisy Zane's eyelashes trembled slightly, amplifying the cold aura around her. You'll discover the inception of this content at n0v@lbin★<br/><br/>Kevin Clark smiled, saying, \"We meet again.\" <br/><br/>Daisy Zane looked at him without uttering a word. <br/><br/>Allonzo Hobson came out a little later, arrived at the entrance to see both of them staring at each other. <br/><br/>The girl seemed entirely different from the one he had seen by the elevator. She appeared more hostile now, more difficult to provoke. <br/><br/>Were they viewed as ill-intentioned strangers by her? <br/><br/>Allonzo Hobson did not connect her to the person who had jumped across the balcony. <br/><br/>\"What a coincidence, we meet again.\" Allonzo Hobson laughed lightly, his eyes curving into crescents, \"We must be fated. Shall we get acquainted? I'm Allonzo Hobson.\" <br/><br/>Daisy Zane remained silent, her gaze shifting from Allonzo Hobson to Kevin Clark. <br/><br/>The implication was clear — he had introduced himself, it was now his turn to do the same. <br/><br/>First time on the receiving end of such treatment, Kevin Clark seemed unfazed. If anything, his smile broadened. With a somewhat bewitching charm, he stated, \"Kevin Clark.\" <br/><br/>Allonzo Hobson glanced at the man who had just announced his name. <br/><br/>The gentle tone was one that he didn't deserve to possess. <br/><br/>Upon hearing this name, the icy aura around Daisy Zane seemed to diminish a little. She slowly opened her mouth, \"Daisy Zane.\" <br/><br/>\"Does Miss Zane live alone?\" Kevin Clark inquired. <br/><br/>Daisy Zane's gaze wandered off his face, she nodded, the look in her eyes was obscure and indistinct. <br/><br/>Kevin Clark assessed her slender and fair wrist and remarked, \"This room just had an occupant escorted away by the police. It would be safer for Miss Zane to switch rooms.\" <br/><br/>Remembering the person who had jumped across from the balcony, Allonzo Hobson glanced at the thin and frail looking girl in front of him. She appeared to be defenseless. He hastily added, \"Yes, yes, I'll get in touch with someone right away and arrange for Miss Zane to be transferred to another room for free.\" <br/><br/>His tone... it was as if the Doomsday Hotel was his property. <br/><br/>After a phone call from Allonzo Hobson, the hotel's efficiency and service also seemed to be under his command. <br/><br/>They promptly switched her room from the 36th floor to the 39th floor. <br/><br/>A floor that can't be reached without the Doomsday Hotel's gold card. <br/><br/>The bellboy put the luggage in the room, Daisy Zane thanked both men outside the door before entering her room. <br/><br/>The two men outside walked a few steps forward and entered the room next door. <br/><br/>... <br/><br/>\"No thanks,\" Daisy Zane stood in front of the office desk with her hands in her coat pockets, her voice frosty, \"You don't have to assign me to a powerful agent, anyone will do.\" <br/><br/>\"You are the one signed by my father personally,\" John Anderson said, \"I dare not neglect.\" <br/><br/>All his life, his father had given him instructions and lectures, but hardly ever engaged in superfluous conversation with him. As a child, he even attempted to steal his father's hair for DNA testing. And then...that afternoon when he was discovered, their clothesline got bent. <br/><br/>So when his father asked him to help sign someone, he was so excited that he stayed awake all night. <br/><br/>\"Or maybe you pick one?\" John Anderson placed a stack of files in front of her and said seriously. <br/><br/>Daisy Zane gave him a glance, casually took one from the top and handed it to him, saying, \"I saved Mayor John by chance. He signed me to Maple Elite as a payback. So there's no need for any special treatment.\" <br/><br/>John Anderson didn't respond to her words. He felt that it was not that simple. His father, a person of integrity and impartiality who was fearless of power, was always extremely careful when mentioning Daisy Zane. <br/><br/>Just like, he was afraid that even a name might get bumped. <br/><br/>He looked at the resume in his hand and frowned, \"You may want to choose another one. This person has been at home for two years since giving birth and just came back. She has been out of touch with the entertainment business for two years, and all her artists have been assigned elsewhere. I recently thought about switching her to a different position.\" <br/><br/>\"Just pick her,\" Daisy Zane said. <br/><br/>\"Huh?\" John Anderson looked at her, \"Are you serious?\" <br/><br/>Daisy Zane nodded. <br/><br/>... <br/><br/>The new agent was taking care of her child at home as there was nothing going on in the company. <br/><br/>Daisy Zane didn't rush to meet her, they left contact information for each other, and then left the company. <br/><br/>She stood by the road thinking of calling a car, and as she opened her phone, she received a message. She opened the message first. <br/><br/>Assistant: [The professor said your report format was too chaotic. Redraft one and send it to his email before twelve noon.] <br/><br/>Reading this message, Daisy Zane's eyebrows moved slightly. Her pink lips were pressed together, she felt a little upset. <br/><br/>At this moment, a Maybach stopped in front of her. <br/><br/>The car window was rolled down to reveal Harton Clark's extraordinarily handsome face. His narrowly elongated eyes were filled with laughter, extremely good-looking, \"Lady Zane, where are you going? Let me give you a ride.\" <br/><br/>Daisy Zane looked at his face, and her slightly agitated mood eased a bit. She hesitated for a moment and asked, \"Is it on your way to the Everlasting Palace?\" <br/><br/>\"On the way.\" <br/><br/>Xavier Dominic, sitting in the driver's seat, glanced at him and thought to himself, you're not going back to your place now, how is it on the way? <br/><br/>Daisy Zane opened the rear door and got in, greeted Xavier Dominic, and thanked both of them. <br/><br/>Harton Clark was in the passenger seat, with a laptop on his lap. He responded to Daisy Zane's words and closed the chat page he had open. <br/><br/>On the chat page that was just closed, there was a file he sent out, followed by a line: [Next time, if the format is this messed up, don't hand it to me.] <br/><br/>Then, a person marked as an assistant replied: [Understood, professor. I'll have her revise it right away and send it to you before twelve.]\t\t\t\t\t\t</div>", "images": {}, "success": true}