{"id": 9, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14009485.html", "title": "Chapter 9 - 9: Harry Anderson Provides Support", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 9 - 9: Harry Anderson Provides Support</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 9: Chapter 9: Harry Anderson Provides Support <br/><br/>This material is rooted in n0velbin★<br/><br/>Daisy Zane, who rarely drove, took her car out for a spin today. She received a call while she was in the parking lot, so she answered it then and there. <br/><br/>Unexpectedly, she bumped into them. <br/><br/>Having said just a few words to the person on the line, Daisy hung up and they showed up. <br/><br/>Daisy took a quick glance; the Hobson couple, a family of three from the Miles family and Old Master Miles along with a nanny and housekeeper. <br/><br/>\"Olivia, what are you doing here?\" Old Master Miles supported himself with a cane and smiled kindly after seeing her. <br/><br/>\"I'm meeting a friend.\" <br/><br/>\"Let me introduce you to some people.\" The Old Master turned to the Hobson couple. <br/><br/>Johanes Miles pulled at his father's clothes from behind, but the Old Master ignored it silently. <br/><br/>\"These are your Auntie Horton's brother and sister-in-law. This is Olivia, Sophie Johnson's elder sister.\" <br/><br/>The Hobson couple smiled faintly at Old Master Miles, but when they turned their eyes to Daisy, they showed disdain and dislike. They didn't say anything. <br/><br/>Daisy didn't want to know them either, and didn't even look at them while the Old Master introduced them. <br/><br/>Seeing her like this, Johanes frowned in discontent, \"Don't you know how to greet your elders?\" <br/><br/>\"Dad, I guess my elder sister is just not used to talking to strangers.\" Amelia Miles explained. <br/><br/>Johanes snorted coldly. <br/><br/>Old Master Miles didn't care what they thought, he spoke to Daisy alone, \"Are you leaving already? Let the driver give you a ride.\" <br/><br/>\"No need.\" Today, Daisy wore a light purple dress that tightly wrapped her waist. There was an air of dominance in her aloof demeanor, \"I'll be going first.\" <br/><br/>After speaking, she nodded slightly towards Old Master Miles, walked two steps towards her car, and pressed the car key. <br/><br/>The Crystal Purple Ferrari in the parking space lit up. <br/><br/>Everyone was surprised, especially Amelia Miles, whose pupils trembled. <br/><br/>Just as Daisy was about to reach for the car door, Amelia suddenly spoke up, \"What a beautiful car sister has! Was it given to you by a friend?\" <br/><br/>Her voice sounded sweet but it was uncomfortable to listen to. <br/><br/>Daisy paused and looked at her. <br/><br/>Amelia tilted her head and said with a smile, \"Your friend is very generous, gifting you such a nice car and letting you live in the Doomsday Hotel. I'm so envious.\" <br/><br/>As soon as Amelia's words fell, her Aunt mockingly said, \"What kind of friend is this, showering you with both a luxury hotel and car, something I've never encountered in all my years.\" <br/><br/>Some things Amelia's mother shouldn't say, as it would damage family harmony. But the Hobsons, supporting their sister, had no qualms about speaking up. <br/><br/>After the aunt finished speaking, she immediately exchanged a glance with her mother. <br/><br/>Johanes couldn't keep his face straight. He walked forward and interrogated, \"Where did you get the car?\" <br/><br/>In Johanes' eyes, Daisy had spent over twenty years in the countryside before moving to Truro City less than three months ago. <br/><br/>A poor girl like her could only obtain a fancy car like this and live in the Doomsday Hotel through illegitimate means. They, on the other hand, would not even normally indulge in such luxuries. <br/><br/>With so many people around, he couldn't vent his anger and had never felt so suffocated before. <br/><br/>Harry waited for Daisy's car to disappear from view before addressing the group, \"I have to catch a flight soon, so I'll be going.\" <br/><br/>\"Mayor John, you're busy, carry on,\" Johanes Miles said. <br/><br/>Harry nodded to him and walked towards his car. <br/><br/>The Hobson and Miles families were both silent. Old Master Miles, not wanting to deal with them, had the housekeeper accompany him as he walked away with his cane. <br/><br/>Amelia Miles stared in the direction Daisy had left. Harry had never been so cautious when talking to her. So, why did an illegitimate daughter deserve such treatment? After a while, she suppressed the anger in her heart, took John's arm, and asked with a smile, \"Uncle John knows my sister?\" <br/><br/>At this question, John suddenly remembered something his father had said to him once. <br/><br/>\"Don't tell anyone that I know Daisy Zane, or I'll kill you.\" <br/><br/>\"I don't know,\" John laughed. \"My father never talks to me about his affairs.\" <br/><br/>Amelia smiled and lowered her head, saying nothing more. <br/><br/>** <br/><br/>Daisy Zane returned to Everlasting Palace. In the elevator, she felt a little uncomfortable and her waist ached. <br/><br/>She calculated the days and figured her period was about to start. <br/><br/>She was a bit annoyed. <br/><br/>The elevator stopped on the twenty-seventh floor. The door opened, and Kevin Clark stepped in. <br/><br/>Seeing him, Daisy checked the elevator floor number again. <br/><br/>Kevin also hadn't expected to run into her. After a moment of surprise, he smiled and said, \"I've also bought this floor.\" <br/><br/>\"...Oh,\" Daisy thought, you're rich. \"Just one floor, by the time the elevator comes, you could have walked up the stairs.\" <br/><br/>The elevator opened again on the twenty-eighth floor, and they walked out together. Kevin admitted, \"I'm lazy.\" <br/><br/>\"It seems like it,\" Daisy noticed that whenever she saw him, her mood would improve significantly. <br/><br/>Indeed... being good-looking had its uses. <br/><br/>\"What's wrong? Are you not feeling well?\" Kevin asked. <br/><br/>\"Huh?\" Daisy looked at him. <br/><br/>\"You don't look well.\" <br/><br/>\"Oh.\" Daisy touched her face and said, somewhat unconcerned, \"Maybe I'm just a little tired.\" <br/><br/>\"Then, get some rest early, and don't stay up too late.\" <br/><br/>Daisy nodded unenthusiastically. <br/><br/>Seeing her evasive response, Kevin's tone became even gentler, \"Listen.\" <br/><br/>His gentle tone was a little intoxicating. <br/><br/>Daisy looked at him, and saw that his usually imposing eyes were now filled with a gentle smile as he regarded her. <br/><br/>This made her, usually immune to compliments or criticism, a little unable to resist, \"Okay.\"\t\t\t\t\t\t</div>", "images": {}, "success": true}