{"id": 6, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14009482.html", "title": "Chapter 6 - 6: Celestial Pivot", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 6 - 6: Celestial Pivot</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 6: Chapter 6: Celestial Pivot <br/><br/>The next morning, when Daisy Zane woke up, Robinson Scott had already left, but he left her breakfast. <br/><br/>Daisy Zane, wearing a red silk robe, washed and rinsed, and used a disposable chopstick to tie up her hair before sitting down to eat breakfast at the dining table. <br/><br/>She was eating and checking messages on her cell phone at the same time. <br/><br/>Holt Lawrence: [The number of people issuing challenges recently is growing rapidly.] <br/><br/>After saying that, Holt Lawrence also sent a file. This content has its origins in n0v£lbin★<br/><br/>Daisy Zane opened it casually and saw all kinds of names in various languages. She scrolled down a few times and found no end to the list, so she closed it. <br/><br/>She replied to Holt Lawrence: [Oh.] <br/><br/>Holt Lawrence responded quickly: [Please do us a favor, come out of retirement. Ease the workload of Celestial Pivot Detective Agency and let me keep my hair for a few more years.] <br/><br/>Daisy Zane: [Issue an announcement, tell them. Celestial Pivot Detective Agency's security system can't be hacked. They are not qualified to challenge me.] <br/><br/>After sending that message, there was no sound from Holt Lawrence's side. <br/><br/>Daisy Zane finished her breakfast, put the dishes in the dishwasher, and returned to her bedroom to change her clothes. <br/><br/>She took off the sleeping robe and wore a silk camisole dress underneath. <br/><br/>The thin straps on her shoulders made her beautiful collarbones and fair right-angle shoulders completely exposed. <br/><br/>Around her neck was a red rope that didn't go into her clothes, creating a strong contrast with her cold white skin. <br/><br/>What was even more striking was the red tattoo on the back of her left shoulder. It was as big as a palm, and the shape of a crown. <br/><br/>There were unique totems on it, solemn and noble. <br/><br/>On her right shoulder, from the shoulder to her collarbone were three long scars that looked like the marks of a large animal's scratch, which had healed long ago, and the scars were extremely enchanting. <br/><br/>In Daisy Zane's wardrobe, besides a few casual wear, almost all were skirts of various styles and colors, too many to wear out. <br/><br/>She casually picked one, put on a mask, and went out. <br/><br/>As she was approaching the entrance to the residential estate, Holt Lawrence called her. <br/><br/>Daisy Zane answered, saying: \"Aren't you also quite idle, you still have time to call me.\" <br/><br/>\"...\" Holt Lawrence said annoyedly, \"If I didn't even have time to make a phone call, do you want to kill me with exhaustion, and then inherit Celestial Pivot?\" <br/><br/>When she left, it was past 9 PM. <br/><br/>There were many students, couples, friends, and confidants in the campus... Occasionally, there would be laughter. <br/><br/>They all belong to their unique happiness and joy. <br/><br/>Daisy Zane wore a mask, covering half of her face. Walking in the campus, it seemed like she was blocking everything around her, being calm, cold, and indifferent. <br/><br/>As she was about to reach the entrance, someone suddenly called out to her. <br/><br/>The somewhat familiar voice was filled with doubt and exploration. <br/><br/>Daisy Zane turned around and looked at the person behind her. <br/><br/>It was the woman beside Amelia Miles that day at the Doomsday Hotel. <br/><br/>\"Is it really you?\" Clarissa Mason walked over in her high heels and stood in front of Daisy Zane, \"What are you doing here?\" <br/><br/>Perceiving malicious intent, Daisy Zane didn't want to waste time with her. She glanced at her and was about to leave. <br/><br/>But when Clarissa saw her leaving, she quickly stepped forward and reached out to stop her: \"What are you doing? Can't you hear me talking to you?\" <br/><br/>Daisy Zane stopped and looked at her. <br/><br/>Clarissa Mason crossed her arms and looked Daisy Zane up and down. After a while, she scoffed, \"What? Dressed like this to pretend to be a college student in the university? What a pity, you are uneducated and can never fit in. Do you think the wealthy kids outside are fools? Would they believe you?\" <br/><br/>\"What's your name?\" Daisy Zane asked. <br/><br/>\"You don't recognize me?!\" Clarissa Mason suddenly stood up straight and raised her voice. <br/><br/>Daisy Zane's tone remained the same: \"Should I know you?\" <br/><br/>\"You, you...\" Clarissa Mason had been in quite a few shows and was quite well-known. Arrogant as she was, she suddenly stuttered when someone didn't recognize her, \"So ignorant!\" <br/><br/>\"Are you studying here?\" <br/><br/>At this point, Clarissa Mason raised her chin boastfully, \"Yes. A genuine Truro University student in the Department of Performing Arts. Something someone like you who never went to school can't compare to.\" <br/><br/>Daisy Zane lifted her mask a little, and gently said, \"As a girl, it's better to keep your thoughts clean.\" <br/><br/>\"What do you mean?!\" <br/><br/>\"Read more books.\" <br/><br/>Clarissa Mason suddenly laughed: \"You're telling me to read more books? Can you even recognize all the words? Who do you think you are? Daisy Zane, you're just a bastard daughter of the Miles family. Do you think you're a young lady of the Miles family? Give up on that idea, the Miles family will never acknowledge you, and you and your mother are stains on the Miles family.\" <br/><br/>Daisy Zane, who had been listening to her nonsense casually, suddenly had cold eyes, her beautiful phoenix eyes exuding a chilly aura.\t\t\t\t\t\t</div>", "images": {}, "success": true}