{"id": 18, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14014635.html", "title": "Chapter 18 - 18: No Small Strength", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 18 - 18: No Small Strength</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 18: Chapter 18: No Small Strength <br/><br/>Translator: Atlas Studios Editor: Atlas Studios <br/><br/>Daisy Zane had mostly dried off from her sweat, and the two left the practice room. The creation of this content can be connected to n0ve1bin★<br/><br/>The elevator opened up in the parking lot, with Michael Jackson waiting outside for them, holding a suit jacket in his hand. <br/><br/>“Third Master, Lady Zane.” <br/><br/>Daisy Zane nodded in response, and Kevin Clark took the jacket from his hand, draping it over her: “You just sweated, it can be a bit chilly in the evening.” <br/><br/>Her shoulder weighed down a bit, the scent of Eaglewood became even stronger, cool and sweet, very comforting and reassuring. <br/><br/>Daisy Zane actually didn’t feel cold, but as he mentioned it, the post-sweat coolness felt a bit penetrating: “Thank you.” <br/><br/>Once they were in the car, Daisy Zane took out her cell phone, checking the messages she hadn’t seen today, selecting two important ones to reply to. <br/><br/>“Do you have practice tomorrow morning?” Kevin Clark asked. <br/><br/>“Yes.” <br/><br/>“At the practice room or at home?” <br/><br/>Her home was actually spacious enough to practice in, but Robinson Scott would definitely be catching up on sleep during the day. <br/><br/>“At the practice room.” <br/><br/>“Okay,” replied Kevin Clark, “Get ready tomorrow and let me know on your phone, we’ll go together.” <br/><br/>“Sure.” <br/><br/>The car drove smoothly on the road, and Daisy Zane gradually warmed up. She didn’t know if it was the fragrance of eaglewood that reassured her, or if it was just the fatigue from sweating all afternoon. <br/><br/>It didn’t take long for Daisy Zane to fall asleep, leaning against the seat. <br/><br/>Her head tilted towards the window, her neck revealing a beautiful curve, an utterly defenseless posture. <br/><br/>Seeing her fall asleep, Kevin Clark glanced at her for a moment. <br/><br/>Her porcelain-white skin, long eyelashes, not very dense, her pink lips lightly pursed, even with her eyes closed, one could still sense the subtle coldness emanating from her. <br/><br/>Kevin Clark felt a bit puzzled, not knowing why this little girl was so attractive to him. She didn’t have to do anything; just being there made him want to get close to her involuntarily. <br/><br/>He even wanted to possess her completely. <br/><br/>Before meeting Daisy Zane, he had never thought about romance in his twenty-eight years of life nor made any plans in that regard for the rest of his life. <br/><br/>On his pale skin, one could faintly see four fingerprints. He flexed his wrist, laughed softly with his enchanting gaze: “She still has quite some strength.” <br/><br/>The next day, before seven o’clock, Daisy Zane woke up. <br/><br/>She checked her phone while washing up. <br/><br/>After replying to several important messages, she marked the rest as read but didn’t respond. <br/><br/>After checking her messages, several hot search topics popped up on her phone. She casually clicked on them while brushing her teeth. <br/><br/>Among Truro City’s top ten hot searches, three were related to the Miles Group. <br/><br/>[Miles Group’s project faces pressure overnight.] <br/><br/>[Miles Group’s stock plummets.] <br/><br/>[Miles Group suffers losses.] <br/><br/>What could cause the Miles Group’s stock to fall like this overnight... Daisy Zane raised her eyebrows, turned off her phone, and washed her face. <br/><br/>Suddenly she heard Kevin Clark’s words echo in her mind: “Where is he, I’ll beat him up.” <br/><br/>After freshening up, Daisy Zane returned to her bedroom and changed her clothes. Coming out, she saw a suit jacket on the living room sofa. Her eyes lingered on it for a moment, then she called Holt Lawrence. <br/><br/>“Nana, what’s up? Is something wrong?” Holt’s voice was drowsy and muffled, clearly not fully awake. <br/><br/>Daisy Zane went out to the balcony and glanced at the adjacent road: “The 300 million deal you received yesterday, return the money.” <br/><br/>“Huh? What?” Holt cleared his throat, “You woke me up this early just to make me lose money.” <br/><br/>“Return it.’ <br/><br/>“Why?” Holt was annoyed, he knew he shouldn’t have bragged about it yesterday. <br/><br/>Knowing his reluctance, Daisy Zane paused before saying, “Return half. The next time we meet, I’ll write you a hacker book.” “Really?!” Holt immediately became fully awake. <br/><br/>“Mhm.” <br/><br/>“Alright, it’s a deal.” <br/><br/>Holt Lawrence didn’t know at that time that because of this book, his next meeting with Daisy Zane would be indefinitely postponed. <br/><br/>After hanging up the phone, Daisy Zane stood on the balcony for a while, then sent a message to Kevin Clark: [Are you awake?] Kevin replied quickly: [Mhm, have you eaten?] <br/><br/>Daisy Zane: [No.] <br/><br/>Kevin Clark: [Michael Jackson bought breakfast, do you want to come over here or should I go to your place?] <br/><br/>The morning breeze brushed against her face, causing her fragmented hair to flutter. She looked at the message, smiled slightly, and slowly typed with one hand: [Come over here..]\t\t\t\t\t\t</div>", "images": {}, "success": true}