{"id": 15, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14010201.html", "title": "Chapter 15 - 15: So Fierce", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 15 - 15: So Fierce</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 15: Chapter 15: So Fierce <br/><br/>After another glass of wine, Kevin Clark left, and he took Daisy Zane's script with him as he wanted to see what kind of scenes they needed. <br/><br/>He returned to his room and called Michael Jackson to arrange a practice room, and then began to read the script. <br/><br/>The notes on the script were written in an immature handwriting that resembled that of an elementary school student, but nonetheless neat. Apart from comments, there were also a few suggestions for changes. <br/><br/>Very serious. <br/><br/>As Kevin Clark looked at the words on the script, an image of Daisy Zane using a pen, looking cool and indifferent while writing the notes, crossed his mind. <br/><br/>Suddenly, a character on the script caught his attention. <br/><br/>The word \"今\" in \"今后\" written by Daisy Zane was followed by an upward hook in the character. The hook was very obvious, seemingly a habit. <br/><br/>Kevin Clark's gaze lingered on this character. <br/><br/>The message on the batch of goods from Birch Manor: \"Today's shipment is for you to offset the medical expenses.\" <br/><br/>The words were most likely carved into the box with a dagger. And the character \"今\" in \"今晚\" also had a noticeable hook. <br/><br/>However, the two styles of writing were quite different. <br/><br/>One was like that of an elementary school student, whereas the other had a majestic and grand aura, as if written by a man. <br/><br/>It must be a coincidence. <br/><br/>Kevin Clark didn't pay much more attention and continued reading the script. <br/><br/>** You'll discover the inception of this content at n0v@lbin★<br/><br/>The next day at noon, Daisy Zane went to Sky Rights Hotel to meet Johanes Miles. <br/><br/>She arrived at the private room punctually, and Johanes Miles was already waiting inside. <br/><br/>As they sat face-to-face, Johanes Miles tried to maintain a natural expression: \"I ordered a few dishes just now, take a look and see if there's anything else you want to eat.\" <br/><br/>His tone was quite awkward, as if he had a knife at his neck, forcing him to sit there and talk. <br/><br/>\"No need.\" Daisy Zane sat in her seat with her legs crossed and her hands in the pockets of her skirt. \"Just tell me what you have to say. I have other things to do later.\" <br/><br/>Johanes Miles, already over 50 years old, had traces of age on his face but maintained a good figure and handsome appearance. Hearing Daisy Zane's cold words, he frowned slightly. <br/><br/>After saying that, Daisy Zane got up and walked out. <br/><br/>Accustomed to people flattering him, Johanes Miles rarely experienced such humiliation. The veins on his forehead tightened as he looked at the entrance and said, \"Daisy Zane, don't be ungrateful. I'll tell you, without my permission, you won't be able to stand your ground in Truro City.\" <br/><br/>Daisy Zane opened the door and didn't look back, just laughing, \"You can try!\" <br/><br/>Johanes Miles watched the closed door and picked up a glass from the table, slamming it down hard, \"I'd like to see what a little girl like her can do.\" <br/><br/>** <br/><br/>Standing at the entrance of Sky Rights Hotel, Daisy Zane touched the red rope hanging around her neck, feeling that she hadn't performed well just now and hadn't angered Johanes Miles enough. <br/><br/>\"Tsk.\" She clicked her tongue impatiently. At the same time, her cell phone rang, and she picked it up. <br/><br/>\"Have you eaten?\" Kevin Clark's voice came through the phone. <br/><br/>Daisy Zane's irritated mood was calmed by half, \"Not yet.\" <br/><br/>\"Together?\" <br/><br/>\"I'm not at home.\" <br/><br/>\"Mm, neither am I,\" Kevin Clark said with a smile in his voice. \"Look right.\" <br/><br/>Daisy Zane turned her head, and Kevin Clark was walking towards her. <br/><br/>He was wearing a white shirt today, with the top button undone. Broad-shouldered, narrow-waisted, and long-legged, he stood tall, his eyebrows and eyes like a painting, and his lips like cinnabar. <br/><br/>Compared to the black shirt, he was a bit less mysterious and oppressive, and a bit more elegant. <br/><br/>Daisy Zane hung up the phone and waited for him to approach, asking, \"Are you doing something here?\" <br/><br/>\"Mm, I met someone.\" Kevin Clark looked at her, \"Who upset you?\" <br/><br/>When he had come over, he had sensed an icy and violent aura from afar. <br/><br/>\"Met an idiot.\" <br/><br/>For the first time, Kevin Clark heard Daisy Zane's slightly sulky tone, and he was a bit surprised, \"Did you lose an argument?\" <br/><br/>Daisy Zane looked up at him, a faint murderous intent in her eyes. <br/><br/>\"So fierce,\" Kevin Clark's hand hanging by his side clenched a little, afraid he couldn't resist pinching her face. Looking away, he said, \"Where's the person? I'll go beat him up.\" <br/><br/>Seeing his suddenly serious expression, Daisy Zane laughed and turned to walk to the hotel, \"I'll treat you to dinner.\" <br/><br/>Seeing her laugh, Kevin Clark also curved his lips and followed her, saying, \"Okay.\"\t\t\t\t\t\t</div>", "images": {}, "success": true}