{"id": 16, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14011015.html", "title": "Chapter 16 - 16: Foolish People, Lots Of Money", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 16 - 16: Foolish People, Lots Of Money</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 16: Chapter 16: Foolish People, Lots of Money <br/><br/>Translator: Atlas Studios Editor: Atlas Studios <br/><br/>As the two ate, Harton Clark asked Michael Jackson to check the surveillance at Sky Rights Hotel to see who Daisy Zane had just met. <br/><br/>Watching the surveillance footage sent by Michael Jackson, Daisy Zane looked furious when she left the private room. Harton Clark sent Michael Jackson a message. <br/><br/>[Press all the important projects held by Miles Family and snatch all the ongoing deals.] <br/><br/>“Do you have time later?” Daisy Zane asked, “I have an audition tomorrow afternoon.’ <br/><br/>“So soon?” Harton Clark put away his cell phone, used the public chopsticks to pick a piece of fish and debone it, “I asked Michael Jackson to find a practice room, let’s go there after we finish eating?” <br/><br/>“Where is it?” <br/><br/>“Just nearby.” Harton Clark put the deboned fish in front of her. Seeing her hesitating, he asked, “What’s wrong?” The source of this content can be connected to n0v3lb!n★<br/><br/>“My skirt is too long.” Daisy Zane frowned, “I’ll buy some clothes at the mall next door later.” <br/><br/>Her skirt was too long, making it difficult for her to learn various steps, walking posture, and bending. She couldn’t just lift her skirt up. <br/><br/>Seeing her suddenly a little annoyed, Harton Clark asked, “Don’t you like shopping?” <br/><br/>“It’s troublesome.” <br/><br/>So many clothes, yet she found shopping troublesome. Harton Clark smiled and said: “Why don’t we go home first, the practice room key won’t be ready until two.” <br/><br/>Daisy Zane looked at him, and the annoyance between her brows disappeared: <br/><br/>“Okay.” <br/><br/>They returned to the Everlasting Palace, Daisy Zane went home to change clothes, while Harton Clark waited outside without going in or returning to his own home. <br/><br/>Two minutes later, Daisy Zane came out wearing a casual outfit, black pants, a white shirt, and her hair down. <br/><br/>A simple combination, yet she looked both clean and stunning in it. <br/><br/>“Let’s go.” Daisy Zane said. <br/><br/>“Okay.” <br/><br/>They went down together, and as they reached the parking lot, Michael Jackson was on the phone. Seeing them coming, he said, “Okay, I know, I’ll tell Third Master, gotta hang up first.” <br/><br/>As they got into the car, Harton Clark looked at Michael Jackson, “What happened?” <br/><br/>Michael Jackson glanced at Daisy Zane through the rearview mirror, clearly a bit guarded, and then looked back at Harton Clark without speaking. <br/><br/>Harton Clark said: “Just say it.” <br/><br/>“Celestial Pivot has taken the order.” Michael Jackson said, “They also responded immediately.” <br/><br/>Meeting her slightly cold gaze, Kevin Clark coughed: “My level is really limited. I searched for a professional one.” <br/><br/>The senior sister saw Kevin Clark like this and suddenly laughed, explaining for him: “Arthur North’s throat is very good. If he teaches you to sing, there’s no problem. But when it comes to movement and bodywork... he can only watch, and he’s very picky about it.” <br/><br/>Daisy Zane shifted her gaze to the senior sister and bowed slightly in politeness. <br/><br/>“Because of his throat, my Teacher always wanted to cultivate him as a successor. But Arthur North has had his own opinions since he was a child and really dislikes practicing. He’s always coming up with ways to deceive my Teacher.” The senior sister laughed, “My Teacher often says that he was born with a good throat, but he doesn’t have the fate for it.” <br/><br/>“Senior sister, two hours.” Kevin Clark reminded her. <br/><br/>This Senior sister had been studying with Kevin Clark’s mother since she was very young. When Kevin Clark was young, the senior sister often took care of him, so he respected her very much. <br/><br/>“OK, I know, I won’t expose your shortcomings.” The senior sister said, “I had originally agreed to come here for a few days. But as soon as I arrived in the morning, I was notified at noon that there is a temporary performance in the Imperial Capital. I’ll teach you first, then let Arthur North watch you practice. He can’t teach, but he’s the best at picking out mistakes. I’ll come back tomorrow.” <br/><br/>Kevin Clark: <br/><br/>“Thank you.” <br/><br/>The senior sister laughed warmly, keeping the words “We are all family” in her heart. <br/><br/>As Daisy Zane walked with the senior sister towards the center of the practice room, she reached into her pocket and saw that she hadn’t worn a hair tie on her wrist. <br/><br/>She had used a hairpin to tie her hair up in the morning and had thrown it on the bed when she went back to change her clothes. <br/><br/>“Here.” <br/><br/>Before the annoyed feeling could arise, Kevin Clark handed her a hair tie. A black one. <br/><br/>“Black is versatile.” Kevin Clark said. <br/><br/>Daisy Zane looked at the hair tie and smiled, accepting it and tying a casual bun. <br/><br/>And the senior sister looked at the two of them with a bigger and bigger smile on her face. <br/><br/>In two hours, Daisy Zane studied very seriously, and she learned very quickly. <br/><br/>Kevin Clark watched her quietly from the side of the practice room, not saying a word, just keeping his eyes on Daisy Zane. <br/><br/>Almost eight minutes of footage, footwork, positioning, movements, expressions – in two hours, Daisy Zane had almost learned everything. <br/><br/>The senior sister kept praising her constantly. <br/><br/>When leaving, Kevin Clark sent her off, leaving Daisy Zane to rest in the practice room. <br/><br/>As the senior sister went downstairs, the corners of her mouth were still raised: “Arthur North, today I saw what it means that one thing overcomes another. I have never seen you lower your head to anyone before.” Kevin Clark also smiled: “Help me keep it a secret from my mom first.’ <br/><br/>“I know.” The senior sister said gently, “The girl is very good, beautiful, and smart. She learns everything quickly. And I think she should have a very deep foundation in dance. <br/><br/>Kevin Clark nodded. <br/><br/>“I’ll leave the details to you. I won’t come tomorrow.” <br/><br/>“Alright, be safe on the road.”\t\t\t\t\t\t</div>", "images": {}, "success": true}