{"id": 14, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14010196.html", "title": "Chapter 14 - 14: Exchange Contact Information", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 14 - 14: Exchange Contact Information</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 14: Chapter 14: Exchange Contact Information <br/><br/>There was a significant discrepancy between Daisy Zane's demeanor, upbringing, and conversation and her experiences as shown on her record. <br/><br/>In particular, Kevin Clark could sense a story behind her, unlike someone who had never experienced anything in a poor village all day long. <br/><br/>\"What's her grandmother's background?\" <br/><br/>Flipping through the files in his hands, Michael Jackson said, \"Her grandmother's name is Victoria Zane, a mixed-race woman with unknown parents. She was sold to Cold Green Village. But at that time, the village was closed and feudal. Because she had half foreign blood and looked more Western, the family who bought her didn't want her. She settled down outside the village and later found Claudia Zane and adopted her.\" <br/><br/>\"So her grandmother and she have no blood ties.\" Trace back the roots of this material to n0v$lbin<br/><br/>\"Yes,\" said Michael Jackson, \"Her grandmother was quite visionary and always encouraged Claudia Zane to study. At that time, Claudia was the only college student who made it out of Cold Green Village, which was quite sensational. Claudia met Johanes Miles while studying in college, and they got their marriage certificate after graduation.\" <br/><br/>So when Michael Jackson contacted someone for information on Cold Green Village, the local officials had a deep impression of them and knew a lot about them, so they found the information quickly. <br/><br/>\"Why didn't they send Daisy Zane to school?\" <br/><br/>\"It might be because her age was too high, and later on, she had some health issues. When Lady Zane was younger, the government subsidized their lives,\" said Michael Jackson, \"Later on, when Lady Zane grew older, she supported the two of them.\" <br/><br/>Upon hearing this, Kevin Clark retracted the finger tapping on the table and slowly clenched his hand. <br/><br/>In the quiet study, a thin smoke floated from the incense burner on the table, rising and eventually dissolving in the air. The scent of eaglewood filled the room. <br/><br/>After a while, Kevin Clark asked, \"Why did they say she disappeared for a year?\" <br/><br/>Even if her grandmother passed away and left Cold Green Village without news, it shouldn't be called disappearing for a year. <br/><br/>Michael Jackson said, \"The Miles Family had been looking for her since last year because a grand master on Five Peaks Mountain calculated a fortune for Old Master Miles. It said that the family had a daughter outside with the star of the Emperor, and bringing her home and treating her well would guarantee the Miles family's prosperity for a hundred years. It's their most significant turning point. Johanes Miles didn't care, but Old Master Miles kept searching for her until three months ago when Lady Zane came to Truro City. The Miles family contacted her and conducted DNA identification.\" <br/><br/>\"Did she come to Truro City by herself?\" <br/><br/>\"Yes, during that year, Lady Zane seemed to disappear without a trace.\" <br/><br/>Kevin Clark remained silent with furrowed brows. <br/><br/>Michael Jackson stood quietly for a while, then said cautiously, \"Though Lady Zane had a bit of a tough life and never went to school, she appears to be well-educated.\" <br/><br/>Many villages in the countryside now have good living conditions, but Cold Green Village is different. It's too poor. <br/><br/>He didn't touch it, just glanced at the page she had opened. <br/><br/>Daisy Zane placed the wine on the tea table and fetched a corkscrew from below: \"Feel free to look.\" <br/><br/>\"I'll do it,\" Kevin offered. <br/><br/>Daisy Zane didn't hesitate to hand him the corkscrew and the wine. <br/><br/>\"The script seems pretty good,\" Kevin commented as he opened the wine. <br/><br/>Daisy Zane looked at his slender, fair fingers as he applied a little force, and his knuckles bulged, showcasing strength yet still being elegant. Her gaze was direct: \"It's decent, quite accurate.\" <br/><br/>After opening the wine, Kevin poured a glass for her, \"Is the role you're playing a Peking Opera female character?\" <br/><br/>Daisy Zane glanced at the script, which only contained one line of opera lyrics – an uncommon one at that. Someone unfamiliar with it would have assumed it was just dialogue. \"Do you know much about opera?\" <br/><br/>Kevin swirled the wine in his glass, clinked it lightly against Daisy's, and took a sip: \"My mother used to be a famous Peking Opera actress in the Imperial Capital. It was hard to get a ticket in her heyday. I grew up listening to her.\" <br/><br/>Daisy Zane was only familiar with the power distribution in the Imperial Capital and not with every detail. <br/><br/>She knew that the Clark Family held a high status there, but she didn't know much about Kevin's mother. <br/><br/>However, after hearing him say this, she seemed to have some impression, for some reason. <br/><br/>\"What is it?\" Kevin noticed her furrowing her brow. <br/><br/>Daisy Zane took a swig of her wine, got up from the sofa and sat down on the carpet casually: \"Nothing. I didn't realize Mrs. Clark was so talented.\" <br/><br/>\"So, do you need advice from the son of a famous actress?\" <br/><br/>Daisy Zane looked at him. Her understanding of Peking Opera was superficial, and she needed a teacher. But... <br/><br/>\"Do you charge?\" <br/><br/>\"........\" Money seemed to be unavoidable in their conversations. Kevin saw that she was sincere in asking, \"Tonight's wine will cover it.\" <br/><br/>Daisy Zane raised her eyebrows, a fleeting joy of gaining an advantage flashed in her eyes before she quickly resumed her indifferent demeanor: \"When are you free?\" <br/><br/>\"Whenever you are,\" Kevin said. \"Let's exchange contact information so we can arrange the time more easily.\" <br/><br/>\"Sure.\" Daisy Zane grabbed her cell phone and gave him her mobile number.\t\t\t\t\t\t</div>", "images": {}, "success": true}