{"id": 10, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14009486.html", "title": "Chapter 10 - 10: This Beam Has Been Set", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 10 - 10: This Beam Has Been Set</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 10: Chapter 10: This Beam Has Been Set <br/><br/>After taking a bath at home, Daisy Zane went straight to sleep. <br/><br/>It was past two o'clock in the morning, and she woke up with a stomachache. Sitting on the bed for a while, she got up and went out of her bedroom to find some medicine. <br/><br/>As soon as she stood in the living room, she heard the sound of the door opening. <br/><br/>She looked towards the entrance of the living room and soon saw Robinson Scott appear in the doorway, dressed in black. <br/><br/>Wearing a mask and a high ponytail, a hint of murderous intent lingered in her deep eyes. <br/><br/>\"What happened?\" Daisy asked, looking at her. <br/><br/>\"Haven't you gone to bed yet? Just saw from outside, the lights in the room were all off.\" Robinson also didn't change her shoes, sat on the sofa, took off her mask, and started taking off her coat. <br/><br/>When her left hand came out of the sleeve, she frowned and winced. <br/><br/>\"Are you hurt?\" You'll discover the inception of this content at n0v@lbin★<br/><br/>\"Just a minor injury.\" Robinson untied the makeshift bandage of a hair tie on her arm, and blood instantly dripped onto the carpet, \"It hurts quite a bit.\" <br/><br/>Daisy furrowed her brows, fetched a medical kit, and sat next to her, \"Give me your hand.\" <br/><br/>Robinson stretched out her arm: \"I was set up by someone from Dark Radiance, not only did I not get the goods, but I also got injured. Ah! Daisy, be gentle.\" <br/><br/>The color of Daisy's lips turned a bit pale, her expression several times colder than usual: \"Why did people from Dark Radiance also come?\" <br/><br/>\"I don't know. Dark Radiance has always been doing their own thing, hard to figure out their moves. Their big boss is even more mysterious than you, so well-hidden that we still don't know if they're human or ghost.\" Robinson said, \"But well, we've made enemies today.\" <br/><br/>\"Take care of your injuries first.\" <br/><br/>\"Alright, I'll stay here and play with you for a couple of days.\" <br/><br/>The wound wasn't very deep, but it was somewhat long. Daisy quickly treated it for her, put the medical kit back, and went back to her room to change her clothes, then came out with a backpack. <br/><br/>Martin boots, black pants, white tracksuit. <br/><br/>These clothes didn't quite match. <br/><br/>Seeing her outfit, Robinson straightened her body: \"Daisy, what are you going to do?\" <br/><br/>Daisy put on a mask, picked up the car key that Robinson had thrown on the tea table, held the backpack in her hand, and said: \"Teaching them a lesson.\" <br/><br/>\"Ah.\" Robinson had her mouth half-opened, watching Daisy leave, took a while to come to her senses and said to the empty house, \"Ah, then... be gentle.\" <br/><br/>... <br/><br/>Parking lot. <br/><br/>Daisy got into the car that Robinson had driven, wiped off the blood on the steering wheel. <br/><br/>Then she took a black coat from her backpack, put it on, and called Holt Lawrence while starting the car. <br/><br/>\"How's your arm?\" Daisy Zane filled a bowl of soup and started drinking without even lifting her head. <br/><br/>\"Not a big problem.\" <br/><br/>Robinson Scott quickly brought out a few dishes he prepared in the kitchen, along with two bowls of rice. <br/><br/>Sitting down, he said, \"Daisy, I have to tell you something important first.\" <br/><br/>\"Hmm?\" Daisy Zane ate her food leisurely, every move was pleasing to the eye. <br/><br/>\"You know who the fairy next door is!\" Without waiting for her to answer, Robinson Scott blurted out the answer, \"It's Kevin Clark!\" <br/><br/>\"How did you find out?\" Daisy Zane looked up at him. <br/><br/>\"I went downstairs to pick up takeout and happened to see them coming out of their room,\" Robinson Scott said, \"I've never seen Kevin Clark, but I've seen his assistant, Michael Jackson several times.\" <br/><br/>\"Oh.\" Daisy Zane finished her soup and began eating the rice. <br/><br/>Seeing her reaction, Robinson Scott said, \"You knew all along?\" <br/><br/>\"I wouldn't drink with a man without even knowing his name.\" <br/><br/>\"But you still played with him!\" Robinson Scott said seriously, \"That's Kevin Clark! Let's not even talk about his romantic history. With his ruthless and devilish methods, Daisy, you need to stay away from him. When he's cruel, he doesn't recognize family and has no heart.\" <br/><br/>After taking a bite of rice, Daisy Zane paused and said, \"I know.\" <br/><br/>\"What do you know?\" <br/><br/>\"His reputation is particularly bad.\" <br/><br/>\"......\" Robinson Scott was speechless, her lips even quivered for a moment, \"Daisy, have you been bewitched by his beauty? I'm telling you the truth.\" <br/><br/>\"He is quite good-looking,\" Daisy Zane complimented in her cold tone. <br/><br/>\"You!\" Robinson Scott stood up, with her hands on her hips, \"Don't you think I'm good-looking?\" <br/><br/>\"You're good-looking.\" <br/><br/>\"Who's better looking, me or him!\" For some reason, Robinson Scott suddenly felt competitive. <br/><br/>Daisy Zane looked up at her and then lowered her head again, picked up a piece of meat, and said, \"Let's eat.\" <br/><br/>\"You...\" Robinson Scott stood there for a while, thinking that the fairy might be a bit more good-looking and sat down, \"I'm serious, be careful of him.\" <br/><br/>\"Hmm,\" Daisy Zane responded casually, \"Who knows who should be careful of whom.\" <br/><br/>Robinson Scott was taken aback. <br/><br/>She knew very well about Daisy Zane's methods, but Kevin Clark was too frightening, evil and sinister. Instinctively, she worried about Daisy Zane and wanted her to stay away from him. <br/><br/>But if she looked at the situation objectively... <br/><br/>She was kind of looking forward to the two of them clashing. <br/><br/>Oh, it should be quite exciting.\t\t\t\t\t\t</div>", "images": {}, "success": true}