{"id": 17, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14011016.html", "title": "Chapter 17 - 17: The One Who Should Smile More", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 17 - 17: The One Who Should Smile More</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 17: Chapter 17: The One Who Should Smile More <br/><br/>Translator: Atlas Studios Editor: Atlas Studios <br/><br/>Kevin Clark has grown up amidst the Theatre Garden, absorbing its influence. Even though he is not that great himself, his eye for detail is sharp and picky. <br/><br/>However fast Daisy learns, she still lacks the foundation of opera. Moreover, the teachings from her senior were limited to two hours only. <br/><br/>So the only option left was to repeatedly practice this section. <br/><br/>After seeing his senior out, Kevin saw Daisy continuously practicing without resting. He gave her a bottle of water, “Take a break.” <br/><br/>“It’s not necessary.” Daisy replied, taking a sip of water, “I’ll give my performance now, you watch.” <br/><br/>Kevin took the bottle from her smoothly, saying, “Ok.” <br/><br/>In the next hour, Daisy didn’t manage to complete her eight-minute performance. Kevin was very meticulous, going over every movement and every detail. <br/><br/>Every time he corrected an error, they had to start all over again. The source of this content can be connected to n0v3lb!n★<br/><br/>“The typical female sword posture requires the little finger to be curled up,” <br/><br/>Kevin said as he stood not far behind her, using his phone to control the music. <br/><br/>“Like this?” Daisy followed his instructions. <br/><br/>“Bend it a bit more.” <br/><br/>“Like this?” <br/><br/>“Hmm.” Kevin stood close, noticed a mole on the inner side of her right ring finger and gave it an extended look, then gently explained, “Soften it a bit, don’t be too rigid. This section is about persuading the king to drink wine, listen to music, watch a dance, to reduce his worries and sorrows. It’s not about fighting.” <br/><br/>Daisy: <br/><br/>“Bend your right leg a little more. Draw in your waist a bit.” <br/><br/>Daisy moved according to his indications, then she looked at his reflection in the mirror and said, “I can’t draw it in any more.” <br/><br/>The tone of her voice sounded like she wanted to fight with Kevin. He gave a small laugh, moved closer and gently touched her waist with his cell phone: <br/><br/>“Like this.” <br/><br/>Daisy’s eyelashes moved slightly, she looked down at her waist. Kevin had courteously touched her with his phone and then moved away. <br/><br/>“Look in the mirror,” Kevin instructed while looking at their reflection: “Hold this posture for a minute. Muscle memory.” <br/><br/>She raised her eyes to look at Kevin whose tender lips are slightly curved and eyes sparkling with laughter. <br/><br/>Without any warning, Daisy found herself staring deep into his eyes, freezing in her posture. <br/><br/>Kevin didn’t move his gaze, watching her eyes gradually darken. He watched the sparkling sweat bead roll down her face, slide along her jawline to her neck, then disappeared into her clothes. <br/><br/>Two seconds later, he lowered his gaze, dispelling the impulse from his heart. Daisy also snapped back and straightened her body: “What’s wrong?” <br/><br/>“Eye contact.” Kevin’s cheery voice turned a bit husky, “The Overlord sits behind you. Remember to have eye contact at this point.” “Got it.” “Practice a couple more times and then we can head back.” <br/><br/>“Mm.” <br/><br/>Daisy didn’t finish until almost ten o’clock. <br/><br/>Kevin told her to dry her sweat before leaving. <br/><br/>“Whoever heard of being so delicate.” Daisy mumbled. <br/><br/>Kevin handed her the tissue. Hearing this, he smiled, “Girls can be delicate.” <br/><br/>Daisy laughed lightly, wiping off her sweat, and then tied her hair back up again. After that, she stood in front of the practice room’s French window and looked at the night view outside. <br/><br/>Kevin quietly stood by her side, not saying a word to interrupt her. <br/><br/>After a while, Daisy spoke, “Why didn’t you study opera?” <br/><br/>“I was playful when I was young, felt it was too burdensome,” Kevin said, looking outside, “Later... I realized I really couldn’t learn it. My mom played female characters, she thought my throat was good and always wanted to train me in that direction. But I didn’t have the posture or the talent for it, anything I learned was simply awkward. To quote my mom, it was nauseating.” <br/><br/>Daisy turned to him, smiling, her gaze lingered at his waist as she said, “It’s pretty good.” “What?” <br/><br/>“Nothing. ” <br/><br/>Kevin didn’t bother to dig deeper into what she was implying. Seeing her in a good mood, he said more, “Despite all this, while suppressing her own disgust, my mom forced me to learn and grew more and more disgusted in the process.” A deeper smile formed at the corners of Daisy’s lips. <br/><br/>“During that period, I had to constantly outsmart my mom. If she happened to get impatient, my dad would chase me all over the yard to hit me.” Kevin smiled softly, “It was only when my mom discovered that my niece was gifted that she let me off. She conned my niece from my older brother’s home.” <br/><br/>“You’d also get beaten up?” <br/><br/>“No, my dad’s too old, he couldn’t catch up to me.” <br/><br/>Daisy laughed quietly, leaning against the rod. <br/><br/>It was the first time Kevin saw her laugh like this, which lessened her aloofness and made her even more stunning. Kevin watched her from the corner of his eye and thought to himself: <br/><br/>She should laugh more..\t\t\t\t\t\t</div>", "images": {}, "success": true}