{"id": 19, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14014636.html", "title": "Chapter 19 - 19: Don’T Be Bullied", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 19 - 19: Don’T Be Bullied</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 19: Chapter 19: Don’t Be Bullied <br/><br/>Translator: Atlas Studios Editor: Atlas Studios <br/><br/>Daisy Zane opened the door, to be greeted by the sight of Kevin Clark already standing there waiting for her. <br/><br/>As their eyes met, Kevin Clark smiled. <br/><br/>Daisy Zane raised an eyebrow and looked at his face, the phrase “male seductor” suddenly sprang to her mind. <br/><br/>She suddenly felt that the direction she was heading in might be a little dangerous. <br/><br/>Upon entering, Daisy Zane bent to take off her shoes, but Kevin Clark said, “There are no new slippers at home, I didn’t get the chance to buy any, don’t bother changing.” <br/><br/>Daisy Zane paused momentarily, looking at the shoe cabinet. There were many slippers, all for men. <br/><br/>“They’ve all been worn.” Said Kevin Clark. <br/><br/>“I don’t mind.” <br/><br/>Hearing her say that, Kevin Clark picked a pair and tossed them onto the floor for himself. He then placed his own slippers by Daisy Zane’s feet, saying, “Wear mine.” <br/><br/>Looking at the slippers next to her feet, Daisy Zane suddenly laughed, and then wore them. <br/><br/>Kevin Clark, on the other hand, took a glance at her pale ankle and quickly looked away. <br/><br/>The two of them walked towards the living room together. Suddenly, Michael Jackson came out, looking somewhat flustered. He gave a quick glance at Daisy <br/><br/>Zane, steadied his emotions, and said, “Lady Zane.” <br/><br/>Daisy Zane nodded, and Kevin Clark asked, “What happened?” <br/><br/>“Third Master...’ , said Michael Jackson again while glancing at Daisy Zane. <br/><br/>Kevin Clark indicated for him to continue. Michael Jackson said: “Celestial Pivot returned half of our money.” <br/><br/>“Hmm?” Kevin Clark also seemed surprised. <br/><br/>“Holt Lawrence sent a message saying that after watching the stars last night, he felt it wasn’t right to accept so much money, so he returned half.” <br/><br/>Kevin Clark: <br/><br/>Daisy Zane: . What fool would she not know? Chart your course back to the origins of this substance at n0v^lbin<br/><br/>After breakfast, Kevin Clark accompanied Daisy Zane to the practice room. <br/><br/>Another morning of non-stop practice. <br/><br/>Kevin Clark noticed that she was quite resilient, very enduring, never complaining of fatigue, and never showing a state of exhaustion. <br/><br/>“Daisy Zane?” Clarissa Mason also looked with everyone, and when she recognized her, a hint of sarcasm flashed in her eyes, “What are you doing here?” <br/><br/>As soon as she spoke, everyone else also recovered from their daze. After a few seconds of shock, they all put on a curious expression. <br/><br/>Daisy Zane stopped, and looking at her, asked, “Who are you? Do we know each other?” <br/><br/>“You!” Clarissa Mason turned pale, “You don’t recognize me?” <br/><br/>“When did I ever know you.” Daisy’s voice was cold and dismissive. <br/><br/>Harton Clark said she was good at pissing people off, he was right. She liked to annoy people about what they were sensitive about. <br/><br/>After she finished speaking, someone in the crowd laughed. Clarissa Mason, who cared a lot about her reputation, turned from pale to red quickly. <br/><br/>“What are you doing?” <br/><br/>A commanding voice sounded from behind Daisy Zane. Clarissa Mason turned around to see Olivia Chester coming over. <br/><br/>Olivia Chester came over, the crowd parted way for her. Their eyes were full of admiration and respect as she stood next to Clarissa Mason. She then turned to look at Daisy Zane, giving her a once-over and scoffed, “When did an extra become so arrogant, bothering my artist?” <br/><br/>Once Olivia Chester spoke, everyone understood. No matter how beautiful and eye-catching, it’s all for naught. <br/><br/>In this circle, if Olivia Chester did not like someone, without a strong background, it was impossible to develop here. <br/><br/>And those with a strong background were mostly familiar to Olivia Chester. <br/><br/>Clarissa Mason immediately smirked in triumph, looking at Daisy Zane. <br/><br/>But Daisy Zane didn’t look at her, only at Olivia Chester. She stared into her calculating eyes, chuckled lightly, and said, “Then keep your artist in check, don’t let her go around biting others. You wouldn’t want to gain the reputation of being unable to control your own artist.” <br/><br/>The crowd was stunned silent, looking at Daisy Zane, shocked. <br/><br/>She was the first to dare to talk back to Olivia Chester. <br/><br/>“Daisy Zane, you...” <br/><br/>Clarissa Mason was interrupted by a glare from Olivia Chester before she could finish her words and hung her head low. <br/><br/>Olivia Chester laughed, took a step forward, and lowered her voice, “Daisy <br/><br/>Zane, you are the first person who dared to speak to me like this in this circle. Let me tell you, no matter if you have Old Master Miles or John Anderson behind you, if I don’t want to see you here, you won’t get anywhere.” <br/><br/>“Let me tell you as well.” Daisy Zane looked at her nonchalantly but with a hint of coldness in her eyes, “I have always liked to go against people. Especially those who I don’t like.” <br/><br/>“Is that so?” Olivia Chester scoffed, “I will be waiting.” <br/><br/>Daisy Zane just slightly raised her eyebrows, casually took her eyes off her, turned around and left without giving her a second glance. <br/><br/>Her aura was so powerful that the onlookers immediately made way for her, watching her silently as she left..\t\t\t\t\t\t</div>", "images": {}, "success": true}