{"id": 11, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14009487.html", "title": "Chapter 11 - 11: Red Cliff Village", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 11 - 11: Red Cliff Village</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 11: Chapter 11: Red Cliff Village <br/><br/>Daisy Zane stayed at home for two days without going out, but she was not idle. She spent her entire days with her computer. <br/><br/>Robinson Scott, on the other hand, couldn't stay still. He had visited almost every bar and nightclub in Truro City in two days. They both agreed to hang out together, but their schedules were entirely opposite, hardly bothering or seeing each other. <br/><br/>On the third day, Daisy Zane was called away by a phone call from her agent. Her agent informed her that there were a couple of good scripts at the company, and he wanted her to take a look and consider auditioning. <br/><br/>As it happened, Daisy Zane saw Kevin Clark heading out as she was leaving her home. There was also another person with him. It appeared to be Michael Jackson who Robinson Scott had referred to as the special assistant. <br/><br/>He was good-looking with elegant eyebrows and bright eyes. He was a very gentle and refined person. <br/><br/>Kevin Clark wore a black shirt, his figure slender and his waist a bit slim. His expression was serious one moment ago, but when he saw Daisy Zane, he immediately put on a smile: \"Are you going out?\" <br/><br/>Michael Jackson followed behind him. He was initially surprised by Daisy Zane's appearance but was suddenly startled by Kevin Clark's voice. He quickly looked at Kevin Clark. <br/><br/>\"Yeah, going to the company.\" <br/><br/>\"On my way, I could give you a ride,\" offered Kevin Clark. <br/><br/>Daisy Zane's eyebrow raised slightly as she tucked her cell phone into her skirt pocket before giving a nod. <br/><br/>As the two headed out, Michael Jackson went to press the elevator button. <br/><br/>Kevin Clark couldn't help but smile as he recalled her just now putting the cell phone in her skirt pocket. <br/><br/>The young lady was unlike any other girl he had ever met. <br/><br/>Cool and aloof yet fond of wearing skirts, with an exclusive kind of handsomeness radiating from her attire. She didn't like wearing makeup but was still very fashionable. She always wore distinctive, meticulously designed, high-end skirts. <br/><br/>Every skirt had a seamless pocket tailored to her height and proportions. Regardless of the style, the pocket would always be in the same position. <br/><br/>Perhaps this was according to her preferences, as she never carried a bag. <br/><br/>When they reached the parking lot, Kevin Clark opened the car door for Daisy Zane to get in before circling around to the other side to enter the car himself. <br/><br/>Michael Jackson, who had never had to open the car door for his master before, was evidently a little unaccustomed. He rubbed his sweaty hands on his clothes before getting in the car and starting the engine. This content has its origins in n0v£lbin★<br/><br/>\"Head to Maple Elite Entertainment,\" ordered Kevin Clark. <br/><br/>\"Yes, Third Master,\" replied Michael. <br/><br/>\"Do you have a job?\" Kevin asked Daisy. <br/><br/>\"Hmm,\" Daisy answered softly. \"There is a script. My agent asked me to take a look.\" <br/><br/>\"Tell me if you decide to take the job; I will secure an investment position.\" <br/><br/>Daisy Zane looked at him. <br/><br/>Kevin Clark looked back with a smile, \"Lady Zane's show is sure to be popular. I plan to make a fortune.\" <br/><br/>Their eyes met, and after a little while, Daisy Zane said: \"Give me half of the money, and I'll tell you.\" <br/><br/>The director group, screenwriter group, costume and makeup group, and even the shooting locations were listed. <br/><br/>Initially, Daisy Zane wanted to follow Hill Dawson's arrangement. However, when she saw the words \"Red Cliff Village\" written in the shooting location column behind the England-themed script, she immediately changed her mind. <br/><br/>\"Actually, we can audition for both. You never know, just in case...\" <br/><br/>\"No.\" Daisy Zane pushed the script to Hill Dawson, \"I'll go with this one.\" <br/><br/>Hill Dawson frowned, \"Are you sure? Why?\" <br/><br/>\"I have a preference for this one.\" <br/><br/>\"But it's risky.\" Hill Dawson's frown deepened. \"We can try both.\" <br/><br/>\"Just this one.\" Daisy Zane's decisive tone carried a cold persuasiveness that made it hard to refute, \"I'll audition for the role of the supporting female.\" <br/><br/>\"Supporting female?\" Hill Dawson flipped through the script. <br/><br/>The supporting female was the female lead's sister. On the surface, she was an actress, but secretly she was an undercover agent who eventually sacrificed herself. The role had a heavy presence, but all her scenes were in the male and female lead's memories, running throughout the entire plot. <br/><br/>The character was not much different from the female lead. <br/><br/>It was a good role. <br/><br/>But why not take the female lead role instead of the supporting female? <br/><br/>Hill Dawson didn't understand, \"Are you serious?\" <br/><br/>\"Yeah.\" <br/><br/>\"Well...okay.\" Hill Dawson looked at the script for a while before giving it to her, \"I'll let you know when I have audition news. You can go back first if there's nothing else.\" <br/><br/>\"Hmm.\" <br/><br/>\"Hey? Wait a minute. This role has a lot of action and opera scenes. You...\" Hill Dawson looked her up and down, \"If you don't have a dance foundation, the audition might be eliminated.\" <br/><br/>Hill Dawson had seen her resume, where she had hardly learned anything. <br/><br/>It was true. Every year film and dance schools produce a large number of beautiful young girls. Graduates or not, they were all professionally trained. <br/><br/>Daisy Zane had no advantage in this role whatsoever. <br/><br/>As Daisy Zane stood in front of her, Hill Dawson couldn't imagine her moves and actions under the opera costume. <br/><br/>If she were the director, she would never use someone who needed a substitute everywhere except for her face. <br/><br/>\"Ah, it's fine, I have a lot of experience fighting.\" <br/><br/>After saying this, Daisy Zane left, leaving Hill Dawson pondering over her words. <br/><br/>What's the use of having fighting experience? <br/><br/>Would she fight the director into using her if they didn't want to? <br/><br/>Hill Dawson felt a headache coming on. It was hard to get work finally, and it turned out to be such a strong-willed person. She wanted to refute just now, but when she met those cold eyes, she swallowed her words back.\t\t\t\t\t\t</div>", "images": {}, "success": true}