{"id": 13, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14010191.html", "title": "Chapter 13 - 13: Identity Material", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 13 - 13: Identity Material</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 13: Chapter 13: Identity Material <br/><br/>This content has its origins in n0v£lbin★<br/><br/>Regarding food, Daisy Zane's requirements had always been low; she could eat just about anything. <br/><br/>If she thought it tasted good, she would eat more; if not, she'd eat enough to be full. <br/><br/>However, Kevin Clark had a very high standard of living, with even the cheapest food being worth thousands. <br/><br/>As Daisy Zane sat in the Doomsday Hotel's private room on a chair worth seven figures, she perused the gold-edged menu. <br/><br/>In her heart, she rebuked the extravagant Doomsday Hotel for the ten thousandth time. <br/><br/>The soup they ordered was served first. <br/><br/>Kevin Clark unbuttoned his cuffs and folded them twice, revealing a slim and strong forearm. He ladled a bowl for Daisy Zane first: \"Give it a try; the taste should be decent.\" <br/><br/>\"Thank you.\" <br/><br/>Daisy Zane had a taste, and it was indeed delicious; thus, she drank a few more mouthfuls. <br/><br/>Today, her hair wasn't tied up. As she drank more soup, her hair kept falling down. She subconsciously felt her pocket and realized there was no hair tie. She started thinking about using chopsticks instead. <br/><br/>But after glancing at the expensive chopsticks, she abandoned the idea. <br/><br/>Too expensive. <br/><br/>Noticing her series of small actions, Kevin Clark sent a text message to Michael Jackson. <br/><br/>Five minutes later, a knock sounded on the private room door. Michael Jackson entered and stood beside Kevin Clark: \"Third Master, here's what you asked for.\" <br/><br/>In his hand was a small stash of purple hairbands, some deeper in color and some lighter. <br/><br/>Kevin Clark picked one that was closest to Daisy Zane's skirt color and handed it to her: \"Here.\" <br/><br/>When Michael Jackson brought the hairbands for Kevin Clark, Daisy Zane was looking out the window. She didn't expect that they would actually be hair ties. <br/><br/>She subconsciously looked at the stash in Michael Jackson's hand. <br/><br/>\"... ... ...\" <br/><br/>Michael Jackson placed the hairbands in his pocket, nodded to the couple, and left the private room. <br/><br/>Daisy Zane took the hairband from Kevin Clark's hand and tied her hair up without saying anything. <br/><br/>Throughout the meal, Kevin Clark took care of Daisy Zane attentively. <br/><br/>Daisy Zane seemed to be accustomed to such care; she politely resisted at first, but later allowed it. <br/><br/>Initially, Kevin Clark wanted to use this meal to understand her dietary preferences and see if there were any particular foods she avoided or favored. <br/><br/>Without any hesitation, she pressed the hang up button. <br/><br/>However, after about five minutes, he called again. <br/><br/>Daisy Zane's eyebrows flickered slightly as she looked at the name on the incoming call display and answered, \"What do you want?\" <br/><br/>Her voice was very light, seemingly indifferent. <br/><br/>Johanes Miles was on the other side trying hard to restrain something, taking a good while to finally speak, \"Let's meet at Sky Rights Hotel tomorrow.\" <br/><br/>\"Alright, what time?\" <br/><br/>Johanes Miles's tone was cold, \"At noon, twelve o'clock.\" <br/><br/>As soon as the word \"noon\" was uttered, Daisy Zane hung up the phone and continued reading her script. <br/><br/>Johanes Miles, on the other hand, was at his company, looking at his disconnected cell phone and threw it away in frustration. <br/><br/>** <br/><br/>In the evening, at the Everlasting Palace. <br/><br/>Kevin Clark was in the study room processing files, with an incense burner filled with eaglewood on his desk, surrounded by a gentle smoke. <br/><br/>It was peaceful and elegant, occasionally punctuated by the sound of a pen scratching against paper. <br/><br/>The room door was gently tapped open from the outside, and Michael Jackson entered, standing by the desk and said, \"Third Master, I have found information about Lady Zane.\" <br/><br/>Kevin Clark's pen paused, and then he twisted the pen closed, set it aside, and looked up at Michael, \"Tell me.\" <br/><br/>\"Miss Zane's mother's name is Claudia Zane, and she committed suicide when her daughter was less than a month old,\" Michael said. \"Since then, Miss Zane was raised by her grandmother in the Cold Green Village where she lived for more than twenty years. According to the investigation material, Miss Zane never left Cold Green Village and has no record of attending school. Her information is very simple. She didn't even have her ID card until last year. The year before last, Miss Zane's grandmother passed away. Miss Zane disappeared for a year and arrived in Truro City three months ago.\" <br/><br/>\"Suicide? Why?\" Kevin Clark asked. <br/><br/>\"According to the information I found, the forensic doctor's conclusion is suicide due to severe depression,\" Michael flipped through the material in his hand and said, \"I don't know the reason, but there is one strange thing. Claudia Zane was married to Johanes Miles before his current wife, Charles Hobson. However, Johanes Miles's son is three months older than Miss Zane.\" <br/><br/>Johanes Miles had a son and a daughter with Charles Hobson. <br/><br/>The son was three months older than Daisy Zane. <br/><br/>In other words, while Johanes Miles was married to Claudia Zane, he fathered a child with Charles Hobson first, and later on with Claudia Zane. <br/><br/>And later, Charles Hobson became his official wife, while Claudia Zane was designated as the third party. <br/><br/>Kevin Clark's right index finger tapped on the table repeatedly, a mocking smile on the corner of his mouth, \"He really didn't miss either side, not neglecting anyone.\" <br/><br/>Michael stood quietly, not making a sound. <br/><br/>After a moment, Kevin Clark asked, \"Is there any trace of her information being altered?\" <br/><br/>\"No, it's completely true, with no traces of alteration,\" Michael confirmed.\t\t\t\t\t\t</div>", "images": {}, "success": true}