{"id": 12, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14009488.html", "title": "Chapter 12 - 12: Quite Annoying", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 12 - 12: Quite Annoying</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 12: Chapter 12: Quite Annoying <br/><br/>Upon leaving Maple Elite Entertainment, Daisy Zane just descended the steps when a red Bentley stopped in front of her, causing her skirt hem to billow. <br/><br/>\"Sister. So you came to the company?\" Amelia Miles stepped out of the car. <br/><br/>Daisy Zane glanced at her then looked away, focusing on the messages on her phone, making it clear that she didn't even want to spare her another look. Yet, Amelia Miles insisted on coming closer. <br/><br/>\"Sister, find some time to go home,\" Amelia Miles said. \"Ever since we met last time, our grandfather has been angry at our father and hasn't spoken to him. The atmosphere at home has been tense these past few days. You should go and appease grandfather.\" <br/><br/>After reading the messages on her phone, Daisy Zane walked away, bypassing Amelia's car. You'll discover the inception of this content at n0v@lbin★<br/><br/>Amelia Miles couldn't believe that she was being ignored. A fleeting shadow of resentment crossed her eyes and she followed after Daisy, agitatedly. <br/><br/>\"Sister, wait for me. I haven't finished speaking.\" <br/><br/>Despite wearing five or six centimeters' high heels, Daisy Zane walked briskly. She was almost at the roadside when Amelia Miles finally caught up, \"Daisy Zane, I'm calling you, can't you hear?\" <br/><br/>\"Is the act over?\" Daisy Zane asked, turning to her. <br/><br/>\"You...\" Amelia Miles was slightly out of breath, her face grim and haughty. <br/><br/>\"Why bother? Even if you don't hate me, you certainly don't like me. What's with the fake affectionate sister act?\" Daisy Zane said, \"Do you think I, a poor innocent girl who hasn't seen the world, will be grateful for a few 'Sister' from you, letting you manipulate me at will?\" <br/><br/>Amelia Miles was provoked by her words, and her animosity was immediately exposed, \"Daisy Zane, what are you so proud of? Do you think grandpa inviting you home makes you the pearl of the Miles family? Let me tell you this. Even if Dad agrees, as long as my mother does not approve, you can forget about stepping foot in the Miles' house.\" <br/><br/>\"Who treasures the Miles family that much?\" Daisy Zane scoffed, \"A family like that, even one step is too filthy for me.\" <br/><br/>\"Then what are you doing in Truro City! Your words don't match your thoughts!\" Amelia Miles retorted, \"Daisy Zane, you're just an illegitimate daughter. No matter who you latch onto, you can't escape your status as an illegitimate daughter, you and your mother, will forever be the home wreckers, despised by all!\" <br/><br/>\"Is that so?\" Daisy Zane calmly contrasted Amelia Miles' agitation, \"You better remember what you just said.\" <br/><br/>\"What's the meaning of...\" <br/><br/>\"Daisy.\" A familiar gentle voice interrupted Amelia Miles. <br/><br/>Both women looked over. <br/><br/>A Maybach was parked not far down the road. Kevin Clark was standing next to the car, and not far behind him was Michael Jackson. <br/><br/>Tall, slender and enchanting, he was indescribably beautiful. <br/><br/>\"Daisy\" was watching, unavoidably clicking her tongue in her heart. <br/><br/>She had noticed the familiar car earlier, but from her position, the license plate at the back was blocked by a stone bench. She was too preoccupied with arguing and didn't give it a second thought. <br/><br/>Daisy Zane noticed a beam of light on her body and slowly moved her hand into it. As her fingers curled up slightly, trying to grab it, the light suddenly disappeared. <br/><br/>She took her gaze away and looked at the passing vehicles outside, asking, \"Did you hear our conversation just now?\" <br/><br/>Kevin Clark had been watching her actions from the corner of his eyes. Hearing her speak, he turned his head and replied, \"Mm, I did. You sure know how to annoy others.\" <br/><br/>Daisy Zane: \"......\" <br/><br/>\"Do I need to pay for this too?\" <br/><br/>\".....\" Daisy Zane gave him a look, the corner of her mouth slightly uplifted, \"I'll give you this one for free.\" <br/><br/>Kevin Clark laughed, warmly saying, \"Okay.\" <br/><br/>** <br/><br/>Over at the Miles family household, Johanes Miles was only allowed in after visiting Old Master Miles's residence for two consecutive days. <br/><br/>Even after he was allowed in, he was met with cold glances that were hard to digest. <br/><br/>Old Master Miles sat on the sofa in the living room with a long face, refusing to look at Johanes Miles. <br/><br/>Johanes Miles sat opposite him, pleading, \"Dad, please calm down. Take care of your health.\" <br/><br/>\"Huh, not like you're any better.\" <br/><br/>\"Dad, I admit, I was a bit impulsive that day,\" admitted Johanes Miles, \"But think about it. She lived in the Cold Green Village for over twenty years, never leaving once. How could she possibly drive such a nice car and stay at the Doomsday Hotel?\" <br/><br/>\"So, based on a car, without any substantial evidence, you directly concluded that she's been up to no good?\" Old Master Miles reproached, \"Would you have thought this way if it were Amelia?\" <br/><br/>\"How can she be compared with Amelia?\" In Johanes Miles' heart, Amelia Miles was a good and understanding child. <br/><br/>\"I'm not diving into that with you.\" Although Old Master Miles was furious, at the end of the day, Johanes was his son. He hoped for nothing but the best for him, \"What's more important is Harry's attitude towards her, you must have seen it. When in all these years has Harry ever seen anyone with the same air?\" <br/><br/>Johanes Miles stayed quiet, he couldn't make sense of it either. <br/><br/>Old Master Miles took a sip of tea and said, \"She vanished from the Cold Green Village for a year after her grandma passed away. We have no clue where she was during that time. No matter the relationship between her and the party backing her, regardless, this is someone who can even make Harry bow his head. This proves that she's not ordinary, which confirms that the Grand Master on Five Peaks Mountain was correct.\" <br/><br/>Johanes Miles frowned and after a period of silence, he finally said, \"Charles won't let her into the family home. There will definitely be a fuss.\" <br/><br/>Charles Hobson happened to be his current wife. <br/><br/>\"Johanes, you should broaden your horizons a bit. You should know better than anyone that for the Miles family to climb further, it has become quite a challenge for us.\" Old Master Miles spoke in a deep, serious tone, \"The Hobson family has done everything they could to help us. You should consider other avenues. Someone whom even Harry holds in esteem is definitely much more useful than the Hobson family.\" <br/><br/>Johanes Miles stayed silent. <br/><br/>\"You should think about it carefully,\" Old Master Miles got up as he spoke, \"I told you a long time ago not to let a woman destroy your promising future and thriving career.\"\t\t\t\t\t\t</div>", "images": {}, "success": true}