{"id": 29, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14017088.html", "title": "Chapter 29 - 29: Reunion At Sky Rights Bar", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 29 - 29: Reunion At Sky Rights Bar</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 29: Chapter 29: Reunion at Sky Rights Bar <br/><br/>Translator: Atlas Studios Editor: Atlas Studios <br/><br/>Having packed everything up, Hill Dawson left. <br/><br/>Daisy Zane hung the remaining clothes back up, and was about to go wash and rinse when her phone rang. <br/><br/>It was Holt Lawrence calling. Witn€$$ th€ origin of thïš c0ntent, flowing fr0m n0v!lbin★<br/><br/>Daisy Zane answered: “What’s up?” <br/><br/>“Sky Rights Bar, two transaction groups in room 319, Samuel Gray can’t watch them all by himself.” <br/><br/>Daisy Zane’s expression instantly turned cold: “I’ll be right there.” <br/><br/>“Samuel Gray contacted me during a gap, told me all the specific information, <br/><br/>I’ll send it to you.” <br/><br/>“Alright.” <br/><br/>As Daisy Zane was responding, she opened the wardrobe and took out a black backpack from inside, picked up the car keys from the cabinet near the entrance, and headed to the parking lot. <br/><br/>Sky Rights Bar is part of Sky Rights Hotel, right next to it. The fifth floor is directly accessible to the Sky Rights Hotel. <br/><br/>The two transaction private rooms are on the fourth floor, so it’s very convenient to escape by going up a floor and then leaving through the hotel. <br/><br/>Wearing a mask, Daisy Zane arrived and booked a private booth on the fifth floor and ordered some bottles of wine. <br/><br/>The waiter brought the wine and led her to the private room’s entrance. <br/><br/>Daisy Zane took a few hundred bills from her pocket, handed them to the waiter, and said, “My friends will be here later, so no need to call anyone.” <br/><br/>The waiter immediately understood the situation, took the money, thanked her, and left. <br/><br/>Daisy Zane locked the door of the room and changed her clothes in the restroom. <br/><br/>She hadn’t changed her clothes since coming back from the drama crew today. <br/><br/>She was suspended by a wire and practiced martial arts moves at the crew, so she wore casual pants and a white T-shirt. <br/><br/>She put on the coat and pants directly over her clothes and changed into Martin boots. <br/><br/>Then, she touched the gun in her bag, decided against using it, and left it there. <br/><br/>Dressed and back in the room, she opened two bottles of wine, poured both glasses, and waited for the time to come. <br/><br/>Samuel Gray’s message to Holt Lawrence specified which private room she should go to, as well as the timing of her move. <br/><br/>Holt Lawrence would also have to disable the surveillance on his end. <br/><br/>After fifteen minutes, Holt Lawrence sent her an “ok” hand gesture. <br/><br/>Daisy Zane put down the wine glass, put back on her mask and the hat on her coat. The hat covered half her face, but she could still see through the coarse fabric to see what was outside. <br/><br/>“Mmm, you’ve grown up.” Daisy Zane was texting Holt Lawrence, asking him to restore the surveillance. <br/><br/>Samuel Gray put his hat in Daisy’s backpack and took a sip of wine. He had a pair of peach blossom eyes, which looked particularly beautiful when he laughed. <br/><br/>His skin was white and tender, and he was about 6ft lin tall. <br/><br/>A very likable appearance. <br/><br/>But every time Daisy Zane saw him, the words “rebellious child” appeared in her mind because Robinson Scott often muttered them in her ear. <br/><br/>Samuel Gray looked exactly like a rebellious child. <br/><br/>“Brother Nine...” <br/><br/>“Call me sister,” Daisy Zane interrupted him. <br/><br/>Samuel Gray closed his mouth, then immediately smiled and said, “Sister, I heard from Big Boss Lawrence that you’re going to be filming. Can I be your assistant, or even your driver? I haven’t been with you for a long time...” <br/><br/>As soon as he finished speaking, there was a knock on the door. <br/><br/>Samuel Gray immediately looked at the entrance, his peach blossom eyes filled with anger. <br/><br/>Daisy Zane lowered her eyes, took a sip of wine and said, “It’s okay.” <br/><br/>The door was knocked on three more times before it was pushed open. <br/><br/>Daisy Zane looked up. She thought she would see the bar’s bodyguards, but she didn’t expect to see Michael Jackson. <br/><br/>Daisy Zane raised her eyebrows in surprise, but Michael Jackson just looked back and forth between her and Samuel Gray and turned to leave. <br/><br/>“What’s going on? What expression is that? Was he stunned by my handsomeness?” Samuel Gray blurted out three questions in a row. <br/><br/>Just as he finished speaking, the door was pushed open again. <br/><br/>The door was opened by Michael Jackson, and Kevin Clark was standing at the entrance. <br/><br/>At first glance, he saw Daisy Zane, and at the second glance, he saw Samuel Gray. <br/><br/>Samuel Gray immediately sensed hostility, and his eyes instantly hardened. <br/><br/>However, Kevin Clark only looked at him once and then shifted his gaze away, sitting down next to Daisy Zane and saying, “Came to see friends?” <br/><br/>“Mmm,” Daisy Zane replied, glancing at the entrance, “Why is Third Master <br/><br/>Knowing that the man was just a friend, Kevin slightly relaxed, but still didn’t want to look at him any more than necessary. He said, “Someone reported that the bar had illegal transactions. When we arrived, the gang had been beaten down, but the attacker had fled. The bar’s surveillance was hacked, and the bodyguards saw a man in black, so our people and the bodyguards were searching the private rooms.” <br/><br/>Holt Lawrence sold the Red Cliff Village’s news to Kevin. The news of the bar tonight was kept secret since they were going to take action. <br/><br/>It was a real coincidence, as they bumped into Kevin Clark. They were just a step behind, though. <br/><br/>Daisy Zane didn’t expect him to tell her so much. She wasn’t sure if those words were deliberately said to test her and Samuel Gray’s intention. <br/><br/>She slowly took a sip of wine and asked, “Why didn’t you call the police?” “The police came, the bar and hotel area has been sealed,” Kevin replied. “So, we can’t leave for a while?” Samuel Gray appeared very anxious, “I really want to leave early.” <br/><br/>Kevin Walker looked at the backpack between Samuel Gray and Daisy Zane and said, “The man in black took something very important away. To leave, you need to be searched..”\t\t\t\t\t\t</div>", "images": {}, "success": true}