{"id": 28, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14017087.html", "title": "Chapter 28 - 28: I Actually Like Seeing Him", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 28 - 28: I Actually Like Seeing Him</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 28: Chapter 28: I Actually Like Seeing Him <br/><br/>Translator: Atlas Studios Editor: Atlas Studios <br/><br/>Daisy Zane saw Michael Jackson with his head down, feeling that if Kevin Clark didn’t shift his gaze, in the next second, he would commit seppuku. <br/><br/>So, she came to his rescue: “Are you back?” <br/><br/>“Mm.” Kevin Clark’s gaze immediately shifted over, looking at her gently and softly, “Did you lose weight?” <br/><br/>“I don’t feel it. <br/><br/>Kevin Clark took another look at her scattered hair, “Did you cut your hair?” Daisy’s hair used to reach her waist, and a finger’s length had been cut off. <br/><br/>“Mm. Needed for makeup setting.” After Daisy finished speaking, she looked up at the person behind Kevin Clark. <br/><br/>From the moment Kevin Clark spoke to her, this man had been staring at her. His gaze was a mixture of contempt, disdain, and hostility, completely undisguised. Delve into the §ource of thïš dat@, deepl¥ r00ted in n0v(lb¡n★<br/><br/>As their eyes met, Daisy calmly looked at him. <br/><br/>Seeing this, Kevin Clark turned his head to look behind him, and Thomas <br/><br/>Firway immediately lowered his head, displaying an attitude of submission. This was Thomas Firway, who had broken two ribs not long ago and had just recovered. <br/><br/>Daisy also withdrew her gaze, glanced at the sweet potato in her hand, and asked, “Want some? It’s pretty sweet.” <br/><br/>Looking at the artistically eaten sweet potato in her hand, Kevin Clark raised an eyebrow. <br/><br/>Noticing his gaze, Daisy retracted the hand holding the sweet potato, as if afraid that Kevin Clark would suddenly take a bite, “It’s not something you haven’t eaten before. <br/><br/>The meaning of this action was too obvious. Kevin Clark couldn’t help but laugh, “Alright, we’ll eat it when we get back.” <br/><br/>Hearing his laughter, Thomas Firway glanced at Kevin Clark, then at Daisy Zane again, his hostility even more intense than before. <br/><br/>Of course, Daisy felt it too. She raised her eyebrows quite brazenly and provocatively, then lowered her head and casually took another bite of the sweet potato. <br/><br/>Since everyone hadn’t finished eating, the five of them went to Daisy’s living quarters. <br/><br/>Michael Jackson and Thomas Firway were responsible for buying the food. Kevin Clark, Daisy Zane, and Hill Dawson were waiting for them to return. <br/><br/>In the meantime, Kevin Clark ate that roasted sweet potato. <br/><br/>Daisy Zane sat on another sofa, and while responding to his conversation, she watched his slender, fair fingers peel the sweet potato skin. It was clearly just a 30 USD sweet potato, but it seemed like a valuable item in his hands. <br/><br/>Daisy Zane suddenly felt like she had wronged him a bit. This man probably had never eaten any street food before, right? <br/><br/>“Which location are you shooting at first?” Kevin Clark had read the script and naturally knew the predetermined filming locations. <br/><br/>“Red Cliff Village,” Daisy Zane said. “We’ll be going there tomorrow afternoon.” <br/><br/>“Staying there?” <br/><br/>“Mm, there’s a hotel not far from Red Cliff Village.” <br/><br/>Red Cliff Village is a famous shooting location with mountains, rivers, and villages. Gradually, the local area developed around this advantage, with accommodations, food, and tourist attractions. <br/><br/>Actually, the people gathered there were quite diverse. <br/><br/>“Thomas Firway?” Daisy Zane glanced at the wine cabinet and said casually, <br/><br/>“Are there any others named Alfie Ward, Juan Wright or something like that?” <br/><br/>“I’ll introduce you to them when there’s a chance.” <br/><br/>“Really? Not bad, quite gossipy.” Daisy Zane commented. <br/><br/>Kevin Clark smiled, reached for a bottle of wine and said, “No need to worry about them. I want to drink this one.” <br/><br/>Daisy Zane glanced at him and then smiled, saying, “As you wish.” <br/><br/>The two of them were standing in a backlit position, and the shadows softened Daisy Zane’s powder-pink lips when she smiled. She looked like the clear snow under the sunlight. <br/><br/>Clean, cold and dazzlingly stunning. <br/><br/>Kevin Clark looked at her, eyes deepening. <br/><br/>Daisy Zane felt a subtle sense of danger and looked at him, squinting her eyes. <br/><br/>Kevin Clark sensed her scrutinizing gaze, took a silent breath and returned to his usual demeanor, saying, “Let’s go.” <br/><br/>After dinner, Michael Jackson and Thomas Firway tidied up, cleaned, and left. <br/><br/>Hill Dawson helped Daisy Zane pack. <br/><br/>Upon entering the bedroom and the opening of the wardrobe, Hill Dawson was surprised once again by the sight of the clothes inside, but she quickly regained her composure. <br/><br/>Compared to those three men before, this was already a small scene. <br/><br/>“Take a few more casual clothes, they’ll be comfortable and convenient when you need to switch outfits.” Hill Dawson said. <br/><br/>Daisy Zane followed her instructions and took out the clothes. <br/><br/>“Zane, is that Third Master called Kevin Clark... part of the Imperial City Leafield Family?” Earlier, Kevin Clark had introduced himself. <br/><br/>“Yes.” <br/><br/>Hill Dawson couldn’t help but gasp, the Imperial City Leafield Family was not something ordinary people like them could easily come across. After a while, she asked, “Do you two...” <br/><br/>“He lives opposite me.” Daisy Zane said while folding clothes, “We know each other and occasionally have dinner together.” <br/><br/>Had it not been for the sudden reminder of Michael Jackson, Hill Dawson almost believed her words, “He obviously likes you, even having his assistant serve as our driver.” <br/><br/>With the folded clothes in the suitcase, Daisy Zane gave a light smile, her emotions ambiguous, “There are quite a few people who like me.” <br/><br/>Hill Dawson found it hard to respond, but she had to admit it was because of her face, “What about your feelings for Kevin Clark?” <br/><br/>Daisy Zane’s expression faltered for a moment and she said after a short pause, “I quite like seeing him.” <br/><br/>Because seeing him made her happy. <br/><br/>For Daisy Zane, Kevin Clark was like a sedative. <br/><br/>Hill Dawson really couldn’t tell what Daisy Zane was thinking. Her words sounded devoid of emotions like reciting a textbook. It was truly worrisome. <br/><br/>“Don’t worry, I’ll try not to cause you any trouble,” Daisy Zane saw her concern and reassured her. <br/><br/>However, Hill Dawson wasn’t reassured at all. In fact, she felt even more worried about her future hair turning white when listening to those words..\t\t\t\t\t\t</div>", "images": {}, "success": true}