{"id": 22, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14014641.html", "title": "Chapter 22 - 22: Running A Fever", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 22 - 22: Running A Fever</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 22: Chapter 22: Running a Fever <br/><br/>Translator: Atlas Studios Editor: Atlas Studios <br/><br/>“Clarissa Mason! You said the role of Riley Maxwell was already settled for you! Then why was Hill Dawson notified today! The company has prepared a contract for Daisy Zane! ” <br/><br/>Upon receiving the news early in the morning, Olivia Chester called Clarissa Mason into the company and scolded her. The creation of this content can be connected to n0ve1bin★<br/><br/>Olivia Chester hadn’t been this angry in a long time. Everyone who was originally listening outside the office was frightened away. <br/><br/>“I, I didn’t know. Yesterday, yesterday the director was very satisfied with my performance, he always praised me, and Daisy Zane went in for a short while and came out, and then the role was settled. I thought, I thought it was me.” Clarissa Mason’s tearful eyes, her voice getting smaller and smaller. <br/><br/>“Useless! Can’t even get the supporting female role. You mingle with that producer all day, isn’t he an investor too? Apart from letting him sleep with you, what else have you gained?” Olivia would not be so angry if anyone else got the role, but it definitely cannot be Daisy Zane, and also not Hill Dawson’s artist, “You’re always so close together, being photographed without even knowing it. The company has to spend money on public relations to suppress the news.” <br/><br/>“He, he was on a business trip yesterday, wasn’t here.” Clarissa Mason choked. <br/><br/>“For a producer like him, is it essential for him to be there to decide a role!” Olivia Chester rubbed her temples, wanting to give her a beating, “Useless! You don’t even know how to rely on your connections. Now call him and get him to give you that role!” <br/><br/>“Okay.” <br/><br/>“With a brain like yours, you still want to be popular, you’re dreaming! It’s clear you could have used more covert tactics, but now the company has even prepared a contract...” <br/><br/>Olivia had to consider John Anderson’s feelings. Daisy Zane was the person John Anderson wanted to promote. If she had made arrangements secretly, everyone would have turned a blind eye. But now, everything’s out in the open, and it’s challenging to explain to John Anderson. <br/><br/>But relying solely on Clarissa Mason wouldn’t be enough to change the casting decision. The producer clearly didn’t take her seriously and wouldn’t cause conflict with the director and screenwriter for her sake. <br/><br/>“What are you still standing here for! Go and make the call!” Olivia Chester got angrier looking at Clarissa Mason. <br/><br/>“I’m going now.” Clarissa Mason ran out of the office crying. <br/><br/>Olivia pressed her temples, took a moment to calm down before picking up her phone and making a call... <br/><br/>After returning home, Daisy Zane didn’t rest and held her computer on the sofa for half of the day without moving. <br/><br/>Past eight o’clock, she received a call from Hill Dawson, informing her that she had passed the audition and asking her to sign the contract the day after tomorrow. <br/><br/>Hill Dawson was quite excited and instructed her to read the script carefully and take good care of herself and her skin recently. <br/><br/>Although Daisy Zane’s voice was a bit cold, she responded patiently to each request. <br/><br/>After hanging up the phone, she continued to type on her computer. <br/><br/>It wasn’t until around 3 in the afternoon that she closed her computer, went to the kitchen, poured a glass of wine, drank it, then returned to her bedroom to take a shower and catch up on sleep. <br/><br/>“No.” Daisy Zane said, “It’s okay, I’ll be fine after a night’s sleep. I’ll change clothes, and then we can go out to eat.” <br/><br/>This nonchalant attitude. <br/><br/>Kevin Clark looked at her reddened eyes and could feel how uncomfortable she was. He suddenly gathered some energy: “Daisy Zane.” <br/><br/>For the first time called by her full name gently, Daisy Zane looked up at him, her eyes a little surprised and somewhat... confused. <br/><br/>Seeing her like this, Kevin Clark swallowed what he was about to say, and when he spoke again, his voice was much softer: “Let’s talk about dinner later, come and sit down first. <br/><br/>Daisy Zane hesitated for two seconds and then slowly walked over to sit next to the sofa. <br/><br/>Kevin Clark sat down next to her, leaving a little distance between them: “Give me your hand.” <br/><br/>Daisy Zane looked at him, not understanding but still stretched out her hand. <br/><br/>She’s quite obedient. Kevin Clark thought to himself, while grabbing her wrist and gently pulled it towards him. Then, he used the back of his hand to hold her hand on his leg. His other hand felt her pulse. <br/><br/>He can take a pulse. <br/><br/>Daisy Zane looked at his hand, staring at his fingertips. His fingers were very long, slightly thinner than a regular male’s fingers, but not feminine, very delicately attractive. <br/><br/>Her gaze was so blatant that Kevin Clark couldn’t help but hook up the corner of his lips. He knew that when this little girl liked what she saw, she would stare nakedly. <br/><br/>“Tell me the truth, where do you feel unwell.” Kevin Clark asked in a cold tone, quite oppressive. <br/><br/>But Daisy Zane was not affected as her gaze remained on his hand, saying, “I’m not uncomfortable, just sleepy. I didn’t sleep well.” <br/><br/>“You’ve caught a cold.” <br/><br/>“Oh.” Daisy Zane paused for a moment, then said: “Can you take a pulse?” <br/><br/>“I know a lot of things.” Kevin Clark finished speaking, and let go of her pulse. His index and middle finger slid gently across her wrist, “You can discover them slowly.” <br/><br/>He called Michael Jackson to bring some medicine, then went to the kitchen to boil water. Worried that Daisy Zane would continue to drink cold water, he also took the pot from the tea table. <br/><br/>Daisy Zane watched his back and touched her wrist. After a while, she chuckled briefly, then curled up on the sofa and closed her eyes. <br/><br/>When Kevin Clark finished boiling the water and came out, Daisy Zane had already fallen asleep, and deeply so. <br/><br/>A person who’s usually so alert, he walked around her and even covered her with a blanket without waking her up. <br/><br/>Kevin Clark didn’t call her, just kept watching over her and staring at her.\t\t\t\t\t\t</div>", "images": {}, "success": true}