{"id": 20, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14014637.html", "title": "Chapter 20 - 20: Audition", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 20 - 20: Audition</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 20: Chapter 20: Audition <br/><br/>Translator: Atlas Studios Editor: Atlas Studios <br/><br/>Hill Dawson went to the restroom, and by the time he returned to the rest area, Daisy Zane was already standing in a quiet corner, messaging someone. <br/><br/>He walked over quickly, worried, “Daisy, did you run into Olivia Chester just now?” <br/><br/>When he was in the restroom, the others had chatted about a girl named Daisy Zane who’d retorted Olivia Chester. <br/><br/>Daisy Zane switched off her cellphone and placed it in her pocket, nodding. “Are you alright?” Hill’s anxiety increased, “Have you been bullied? I’ll find her.” <br/><br/>As Hill was about to leave, Daisy grabbed his wrist and pulled him back, “I’m fine, I wasn’t bullied.’ <br/><br/>“Really?” <br/><br/>“Yes.” <br/><br/>Relieved she hadn’t been bullied, Hill was soon worried about the audition. The competition today was fierce, and with the unpleasant interactions with Olivia Chester, they might lose the role to others. <br/><br/>“This is for me?” Daisy Zane saw Hill holding an audition number card, clenching it in his hand more tightly, causing it to crease. <br/><br/>“Oh, I almost forgot.” Hill smoothed the number card, tore open the seal, and pasted it on Daisy, his trembling fingertips touching her, “The director wants George Dunn for the lead male role. If he doesn’t come, there are alternatives. Most likely, the lead female role belongs to someone Olivia supports. Most people today are probably here for the supporting female role. You’re number nineteen, so you might have to wait awhile.” <br/><br/>“Alright.” Daisy lowered her eyes, watching him paste the number on her before adjusting her clothes. <br/><br/>“Don’t be nervous, treat this audition as a learning experience and don’t worry about the results,” Hill advised. “There are many professional performers here. Just do your best, and if it’s not meant to be, we’ll look for another show.” Daisy looked at his whitened knuckles, “You shouldn’t be nervous.” <br/><br/>“I’m not nervous, I’m not nervous at all,” Hill said, releasing his grip and forcing an awkward smile. <br/><br/>Nearly three hours after the audition started, it was Daisy Zane’s turn. <br/><br/>As she entered, Clarissa Mason was leaving. Witness the birth of this content, streaming forth from n0v!lbin★<br/><br/>Daisy didn’t want to pay her any attention, but Clarissa stopped her, “You might as well not go in. The director just said he’s going to choose me. It’s pointless for you to go in.” <br/><br/>“Get out of my way,” Daisy glared at her arm. <br/><br/>“I’m trying to help you. Do you know how important the physical requirements are for this role?” Clarissa Mason looked Daisy up and down as if she were blind, “You’ve never learned dance or acting. Isn’t going in just asking for humiliation <br/><br/>Daisy glanced at her, her cold eyes filled with ice. <br/><br/>Clarissa met her gaze, subconsciously stepped back, and withdrew her hand. Only after Daisy entered the audition did she come back to herself. <br/><br/>“You...” the director picked up the script and flipped through a couple of pages, “You can try this scene. Come here, and the rest of you come over to play your parts.” <br/><br/>Daisy Zane walked over and looked at the scene he was talking about. <br/><br/>It was a scene where Riley Maxwell’s cover had been blown. Before being captured, Riley went to the theater and performed “Overlord” for the last time. However, before she could finish, the people who were after her arrived. <br/><br/>In order to prevent her from being tortured. <br/><br/>The male lead, who had been secretly keeping in touch with her, shot and killed her from a distance using a sniper rifle. <br/><br/>That had also been agreed upon between the two characters. <br/><br/>If their cover was blown and they couldn’t salvage it, they would kill each other, so as not to give the enemy a chance to humiliate and torture them. <br/><br/>Daisy Zane remembered every line of the script, but this scene had no dialogue. She glanced at it, picked up two prop swords from the side, stood in the middle, and said, “I’m ready.” <br/><br/>The director’s assistant clapped the slate. <br/><br/>To set the atmosphere, they played the accompanying opera music. <br/><br/>With just two gestures from Daisy Zane, the director and screenwriter’s eyes lit up. They exchanged a glance, looking as if they’d found a treasure. <br/><br/>Halfway through the opera, the people playing the attackers burst in to arrest her. The leading person looked smug and vengeful, saying several unpleasant and provocative words. <br/><br/>However, Daisy Zane just looked at them, her demeanor suggesting she would finish the performance that day no matter what. <br/><br/>The people who were supposed to capture her closed in, already standing next to her with their guns pointed at her. <br/><br/>Daisy Zane made a quick move, her eyelashes quivering slightly. The next moment, a loud “bang” rang out from one of the other actors playing his part. <br/><br/>Daisy Zane shifted her left shoulder back, causing her entire body to stumble backward. The sword held by her left hand also fell to the ground with a clang. <br/><br/>Surprisingly, the hairpin that usually remained in place during fights fell out with her movement, her dark hair cascading down her back... <br/><br/>At the same time, a tear slid down her left cheek. She fell to the ground slowly and gracefully as if a beauty taking her final bow, even her fall was gentle and beautiful. <br/><br/>A few strands of hair crossed her face, adding a sense of brokenness. A faint smile appeared on her face as she finally closed her eyes. <br/><br/>The indescribable feeling of that smile seemed to carry a sense of relief, as well as reluctance, longing, and aspiration... <br/><br/>It was incredibly moving. <br/><br/>However, while everyone else was still immersed in this short scene, Daisy Zane had already stood up, picked up the hairpin and put it in her pocket, tucked her hair back, and resumed her usual detached demeanor. <br/><br/>It was as if the person who had just performed the scene was not her at all..\t\t\t\t\t\t</div>", "images": {}, "success": true}