{"id": 27, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14017086.html", "title": "Chapter 27 - 27 Spreading Rumors", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 27 - 27 Spreading Rumors</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 27: Chapter 27 Spreading Rumors <br/><br/>Translator: Atlas Studios Editor: Atlas Studios <br/><br/>The smoke curled upwards as Daisy Zane looked down, exhaling a puff gently. <br/><br/>Kevin Clark turned to look at her, feeling a sense of abandonment amidst the chill, killing intent, hatred, and anger radiating from her. <br/><br/>Her state deeply pained him, and he wished he could hold her. <br/><br/>Halfway through the cigarette, Kevin Clark coughed at the dispersed smoke. <br/><br/>Daisy Zane only looked up at him after hearing his series of coughs. <br/><br/>Kevin Clark covered his mouth with a clenched right hand, his eyes watering from coughing. <br/><br/>“Choking?” Daisy Zane asked after observing him for a while. <br/><br/>Her words left Kevin Clark coughing inability to speak. He shook his head, waved his hand, gesturing for her to go on. <br/><br/>With a slight flutter of her eyelashes, Daisy Zane studied him closely. If smoke was an issue for him, considering Michael Jackson’s respect for him, he would have quit smoking, never to carry cigarettes, especially not let Kevin Clark knows about it. <br/><br/>But... he didn’t seem to be pretending. <br/><br/>Daisy Zane stubbed out her cigarette and leaned against the car: “Want some water?” <br/><br/>“No need... it’ll pass,” Kevin Clark coughed few more times and then stopped. <br/><br/>Michael Jackson sat in the car, holding his breath while watching Kevin Clark’s Oscar-worthy acting skills. Delve into the §ource of thïš dat@, deepl¥ r00ted in n0v(lb¡n★<br/><br/>Kevin Clark took the cigarette and lighter from Daisy Zane’s hand and stood outside with her, not disturbing her in any way. <br/><br/>It was noon, and the temperature was rising, causing the ground to radiate heat. <br/><br/>Kevin Clark was wearing a black shirt. <br/><br/>Despite the heat, he stood outside with Daisy Zane for almost an hour, using his height advantage to block the sun for her. <br/><br/>Not until he saw Daisy Zane’s mood stabilizing did he say, “Let’s go home.” <br/><br/>When Daisy Zane turned her head and saw the beads of sweat on his forehead, her eyes flickered, and then she nodded softly. <br/><br/>Once they returned to the Everlasting Palace, Kevin Clark told Daisy Zane at the entrance, “Lucia, if there’s anything I can assist with, don’t hesitate to let me know, okay?” <br/><br/>Daisy Zane, who had fallen asleep in the car, looked up at him with slightly foggy eyes and nodded slightly: “Okay.” <br/><br/>Presenting Michael’s mobile number, he asked, “You still have it?” <br/><br/>“Yeah.” <br/><br/>“He’ll stay in Truro City,” said Kevin Clark. “My schedule might be unstable for some time. Contact him directly if there’s anything. If it’s convenient for you, you can keep him with you on the set.” <br/><br/>Some shops in the commercial area near the Everlasting Palace had already begun operating. <br/><br/>Hill Dawson saw a store selling roasted sweet potatoes while driving by. She pulled Daisy out of the car to go inside. <br/><br/>So... when Kevin Clark saw them in the parking lot, what he saw was the three of them each holding a steaming hot roasted sweet potato and eating deliciously. <br/><br/>They were also standing in a circle beside the car. <br/><br/>And the conversation he heard went like this. <br/><br/>Hill Dawson: “Is it sweet? When I was young, my mother wouldn’t let me eat this. I used to buy it and finish it in the parking lot, so I always felt that the roasted sweet potatoes in the parking lot are the most delicious.” Daisy Zane didn’t speak, she was peeling the sweet potato skin. <br/><br/>Michael Jackson responded politely and somewhat formally. <br/><br/>“Michael, we’ve known each other for quite a while now, but I don’t know what your job is. How old are you? Where are you from?” <br/><br/>This question...lt felt a bit off to Michael, but he still answered: “I work as an assistant, I am 25 this year and I’m from the Imperial Capital.” <br/><br/>“From the Imperial Capital?” Hill Dawson asked while biting into the sweet potato, “Do you have a house in Imperial Capital? Which district? How big is <br/><br/>Michael laughed awkwardly, glanced at Daisy, but before he could speak, Hill Dawson added: “Even though our Daisy doesn’t care about these things, you surely must have a house. That will be your life’s security in the future. And Daisy’s job is rather peculiar. Now that she is with you, she is under immense pressure.” <br/><br/>After Hill finished speaking, Michael was so shocked he broke out in a sweat instantly: “No, no, Sister Emily, you’ve made a mistake, we are not together, I am just a driver.” <br/><br/>“Don’t bluff me. You two figured everything out, didn’t you? Pretending to be only a driver, I won’t stop her from dating. In front of me, you don’t need to maintain such a big distance.” <br/><br/>“No, I am not, I am not. Lady Zane...” <br/><br/>Daisy Zane completely calmly took another bite of the sweet potato without even looking up, and calmly responded: “I’ve already explained three times, but she doesn’t believe me.” <br/><br/>“Daisy.” <br/><br/>Just as she finished speaking, a familiar voice sounded. <br/><br/>Daisy Zane looked up towards the source of the sound upon hearing the voice. <br/><br/>Kevin Clark was in a suit today, his long legs making him appear all the more desirable and attractive, as if he had stepped out of a drawing. Beside him was a man, slightly shorter than him, with very distinctive features. From far away you could feel a sense of malevolence. <br/><br/>Seemingly inherently within him. <br/><br/>Daisy Zane watched him approach. <br/><br/>Hill Dawson stared at him, her eyes wide and in shock, her mouth hanging open. <br/><br/>“Third Master.” Michael Jackson immediately put away the roasted sweet potato in his hand and went up to welcome the guest. <br/><br/>Kevin Clark glanced at him, his gaze sharp as a knife, piercing right into Michael’s heart. His expression seemed to say: Look at you, I asked you to just transport people, not to create a scandal. <br/><br/>Michael Jackson suddenly felt as if he were frozen, and his head dropped even <br/><br/>lower..\t\t\t\t\t\t</div>", "images": {}, "success": true}