{"id": 21, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14014639.html", "title": "Chapter 21 - 21: Nicholson Amos", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 21 - 21: Nicholson Amos</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 21: Chapter 21: Nicholson Amos <br/><br/>Translator: Atlas Studios Editor: Atlas Studios Undertake a voyage to the genesis at n0v*lbin#★<br/><br/>Daisy Zane’s impression on people was first, her beauty, which was stunning and eye-catching. Second, her coldness, making her difficult to approach. <br/><br/>She seldom showed emotions. <br/><br/>So with this kind of image, it was hard to imagine her interpreting a character’s emotions in a show. <br/><br/>But she handled the emotions of Riley Maxwell delicately. <br/><br/>Riley Maxwell was already a person who doesn’t show her emotions, very similar to Daisy Zane’s image. <br/><br/>Her heart only held the mission, and beyond that, at most, she hid her fondness for the male lead. This kind of character setup was not easy to handle when it came to expressing emotions. <br/><br/>That’s why the director and screenwriter were not satisfied after watching so many people. <br/><br/>But Daisy Zane handled it very well. With just a glance, a smile, she expressed everything. <br/><br/>There was no trace of acting. <br/><br/>It could be said that she immersed herself in the emotions of Riley Maxwell, fully experiencing Riley’s inner world. <br/><br/>She wasn’t acting, but instead brought the character from the script and text to the audience to the fullest extent. <br/><br/>“Ah, um...” It took the director a while to regain his senses, looked at her material again, and made sure there was nothing on it. Then he asked, “Did you study drama before?” <br/><br/>“No.” Daisy Zane told the truth, “I specifically learned for the audition.” <br/><br/>“Then you have a talent to learn to this extent.” The director praised her. <br/><br/>“It might be because of her dance foundation.” The screenwriter commented on the side. <br/><br/>Daisy Zane didn’t respond to this, but the screenwriter seemed to be just talking to himself, not caring about whether she responded or not. <br/><br/>The director was extremely satisfied with her, his eyes filled with a smile, rubbing his hands, and exchanged several glances with the screenwriter, both of them grinning. <br/><br/>“You can go back and memorize the script first.” said the director, “We will have a script reading one week before shooting, and there will be some fight training. It will only take a few days, and we will notify you then.” <br/><br/>Daisy Zane’s eyebrows moved slightly, she nodded politely, and left the room. <br/><br/>“Is she too calm?” The director saw her leaving and laughed. <br/><br/>The screenwriter’s eyes were almost invisible due to laughter, “When I wrote <br/><br/>Riley Maxwell, I also imagined her like this.” <br/><br/>When Daisy Zane came out, the agent’s anxious forehead was dripping with sweat. <br/><br/>“How was it?” After asking, Hill Dawson saw that her clothes were dirty and helped her wipe the dirt, “How did you get it? I can’t get it clean, this white dress is so conspicuous.” <br/><br/>The experiment was supposed to be quite simple, but the Third Master had specifically assigned Daisy Zane to it. <br/><br/>Since she was absent at the beginning of the last year’s two seminars, and after taking a half-year leave without permission, the Third Master seemed to have become fixated on her and had been overly strict with her. <br/><br/>On the other hand, it wasn’t a bad thing for a young and aggressive person to be humbled and become more stable. <br/><br/>“Tell the assistant to hurry up, I want to see the report before eight o’clock tomorrow morning. ” <br/><br/>“Yes.” <br/><br/>Kevin Clark returned to the laboratory, and Michael Jackson sent a message to the assistant. Upon completing the message, he chuckled. <br/><br/>His Third Master seemed to be eager to finish the work early and go back to accompany Lady Zane. <br/><br/>About ten minutes later, Daisy Zane in the Truro University Laboratory heard her phone ring, which she had thrown nearby. <br/><br/>It was a specific ringtone set for the assistant. <br/><br/>She glanced at it and immediately felt a wave of irritation surge through her. <br/><br/>The experiments weren’t difficult, only requiring tedious and time-consuming work. Any student from the Imperial Capital University Laboratory could do them, but there was no need for them to be this urgent. <br/><br/>She was being purposefully harassed. <br/><br/>Daisy Zane heard that the professor was employed by the Research Institute and was somewhat mysterious, only having three students. To this day, she didn’t know whether the professor was male or female, or their last name. <br/><br/>The assistant was responsible for their communication but wasn’t one of the three students. There was no information available at all. <br/><br/>She could have met them at the beginning of last year, but at that time... Daisy Zane furrowed her brow and muttered, “Old people hold a grudge.” <br/><br/>?? <br/><br/>After staying up all night, Daisy Zane finished her report around six o’clock in the morning and sent it to the assistant. <br/><br/>When she returned to the Everlasting Palace, she met Robinson Scott who had just come back as well. <br/><br/>“Daisy, where have you been? Why are you just getting back too?” Robinson Scott noticed her low energy and spoke softly. <br/><br/>Daisy Zane entered the elevator with her, her hands in her pockets, leaning against the elevator wall. She didn’t look tired, but the bloodshot eyes made her appear colder than usual: “I was in the lab.” <br/><br/>“All night?” <br/><br/>“Yes.” <br/><br/>“Was it that crazy professor again?” Robinson Scott said angrily, “He’s still targeting you! Such a small, petty person! This kind of person must be balding, with only a few strands of hair left that they cover their bald spot with, a potbelly, short legs, less than five feet tall, wearing super thick glasses, and an oily face... ‘ <br/><br/>“Show some respect for researchers,” Daisy Zane interrupted her nonchalantly. She rubbed her swollen eyes, stood straight, and waited for the elevator doors to open. <br/><br/>Robinson Scott followed her out of the elevator and was silent until they reached their front door. She couldn’t hold back any longer, “He’s so small-minded and vindictive. It’s so frustrating!” <br/><br/>“Yeah.” Daisy Zane opened the door with her fingerprint and stepped into the room. With her bloodshot eyes and a soft voice, she said, “So I work hard to become his boss one day and give him orders..”\t\t\t\t\t\t</div>", "images": {}, "success": true}