{"id": 37, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14078496.html", "title": "Chapter 37 - 37: Ruining Her Face", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 37 - 37: Ruining Her Face</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 37: Chapter 37: Ruining Her Face <br/><br/>Translator: Atlas Studios Editor: Atlas Studios <br/><br/>Arthur North and Lilian Lopez had very few scenes together. Other than one scene on the first day of filming, they didn’t have any shared scenes after a week passed. <br/><br/>Occasionally, when they ran into each other on the film set, Lilian would roll her eyes from afar, but Arthur would completely ignore her. <br/><br/>Lilian was very popular, and the actors in the drama crew, sensing her dislike for Arthur, followed suit by isolating him. <br/><br/>Fortunately, Arthur enjoyed solitude; their isolation actually made his time on set more enjoyable, as it saved him from having to interact with others. <br/><br/>Today, Arthur had several fight scenes, and all were with the martial arts instructor and extras. <br/><br/>It had a sense of a one-man-against-all fight to break through enemy lines. <br/><br/>While Lilian and George Dunn were filming, Arthur practiced routines with the martial arts instructor. <br/><br/>“Is it because you have a dance background, or have you studied martial arts before? Your routines are quite impressive,” the martial arts instructor praised. <br/><br/>Arthur only responded with a grunt and didn’t say much. <br/><br/>The martial arts instructor was a burly man, with biceps that would bulge under his clothes with even slight movement. <br/><br/>After practicing for a while, the instructor suddenly grasped Arthur’s hand and stepped forward, standing behind him. The other hand was placed on Arthur’s waist. <br/><br/>“Use force in your hand upward, ” he said while forcing downward on Arthur’s waist, “and use strength here.” <br/><br/>Arthur lowered his eyes and looked at the instructor’s hand on his waist. In the next second, he grabbed the instructor’s wrist, spun around, and twisted it fiercely. The initial posting of this chapter occurred via noovelllbbin<br/><br/>The martial arts instructor groaned and instinctively tried to break free, but he couldn’t: “Let go!” <br/><br/>Arthur stared at him, his eyes cold: “If this hand touches me again, I’ll disable it.” <br/><br/>“Let go of me!” <br/><br/>“Did you hear me?” Arthur applied more force. <br/><br/>In fact, as soon as the man reached out, Arthur instinctively wanted to take action but stopped himself from hurting others. It was only then that the instructor had the opportunity to touch him. <br/><br/>Arthur never took the fight scenes seriously, as they were too simple for him. <br/><br/>The only thing he worried about was that he might instinctively hurt his opponents, so he practiced routines on set. <br/><br/>“I heard you, I heard you.” The martial arts instructor was sweating profusely. <br/><br/>The sniper rifle was very realistic, with the features of a real firearm like ejecting shells, firing, vibration, and recoil, except it was not lethal. <br/><br/>The prop teacher taught Daisy Zane on the scene, but the teaching was very rough, at a fast pace, and incorrect. <br/><br/>Daisy Zane listened quietly, suspecting that the teacher had been secretly coerced by someone behind the scenes. <br/><br/>The director’s side was all ready and about to start shooting when suddenly an assistant ran over and said something to him, and he quickly ran out. <br/><br/>In no time, he brought two people back with him. <br/><br/>It was Allonzo Hobson and Kevin Clark. <br/><br/>“How come Young Master Hobson has time to come over here.” The director was very respectful on the side. <br/><br/>“Ah, my mother took a movie, she’s in the crew next door. My friend and I came over to visit.” Allonzo Hobson said. <br/><br/>The Hobson Entertainment is the pinnacle of the entertainment industry pyramid. Moreover, Allonzo Hobson had a good relationship with Third Master from the Clark Family, climbing their connections, and anyone would give him respect. <br/><br/>The director glanced at Kevin Clark, seeing his luxurious appearance and how Allonzo Hobson was respectful to him, he didn’t dare to ask who he was: “You are welcome to visit anytime.” <br/><br/>“Whose scene is it today?” Allonzo Hobson asked knowingly. <br/><br/>“It’s a newcomer named Daisy Zane, she has excellent acting skills. Young Master Hobson, you can take a look.” <br/><br/>Allonzo Hobson looked at Kevin Clark and smiled: “I have to see that, newcomers are all potential stocks.” <br/><br/>Kevin Clark also glanced at him, trying to slow down his steps, making himself look less anxious. <br/><br/>When they reached the equipment, the director found seats for both of them and let them sit down. <br/><br/>George Dunn and Lilian Lopez did not leave today. When new people arrived, they both looked over. <br/><br/>Lilian Lopez’s eyes lit up when she saw Allonzo Hobson, while George Dunn frowned. <br/><br/>On Daisy Zane’s side, the prop teacher hastily taught her and said: “Are you ready? I’m leaving if you are, you guys shoot.” <br/><br/>Without waiting for Daisy Zane’s response, he left. <br/><br/>Even the videographer couldn’t stand it and asked: “Can you do it? If not, I’ll call him back.” <br/><br/>Daisy Zane skillfully disassembled the assembled gun and put it back in the <br/><br/>box: “Let’s shoot.” <br/><br/>The videographer brother: “...Alright..”\t\t\t\t\t\t</div>", "images": {}, "success": true}