{"id": 31, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14078490.html", "title": "Chapter 31 - 31: Scheming Third Master", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 31 - 31: Scheming Third Master</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 31: Chapter 31: Scheming Third Master <br/><br/>Translator: Atlas Studios Editor: Atlas Studios <br/><br/>“Arthur, what’s the matter? It’s early in the morning.” Allonzo Hobson received a call from Kevin Clark just past seven o’clock, and he still sounded groggy. <br/><br/>“Her hot topic is having its heat reduced, let’s notify them about it.” Kevin Clark was sitting on the Sofa, brewing tea. <br/><br/>Allonzo Hobson was stunned for a moment before he realized who this “her” was referring to. He opened his Facebook to check and instantly became clear-headed: “Holy shit? This is really blowing up.” <br/><br/>Kevin Clark did not respond. <br/><br/>Allonzo Hobson scrolled further down and said, “I just went to bed early last night, did I miss something? Otherwise, this hot topic could not fall out of the top five.” <br/><br/>“Just notify them not to reduce the heat, that’s all that’s needed.” Kevin Clark said, taking a sip of his tea. The initial posting of this chapter occurred via noovelllbbin<br/><br/>“Understood.” Allonzo Hobson knew that a newcomer just started gaining attention, too much heat is not necessarily a good thing, “I’ll make the call.” <br/><br/>“Ok.” <br/><br/>After hanging up the call, Kevin Clark had someone brought the movie over. He first watched the movie at double speed, then repeatedly watched Daisy Zane’s scenes. <br/><br/>It was past nine o’clock, James Collins came out of the guest room in home clothes that belonged to Kevin Clark, and his hair was a mess. He went outside without even washing up. <br/><br/>Harry Clark stopped him: “Where are you going?” <br/><br/>“Looking for my sister.” James Collins ruffled his own hair and opened the door. <br/><br/>“She hasn’t woken up yet, don’t disturb her.” Kevin Clark was quite bothered by his habit of looking for people without even washing up. <br/><br/>“How do you know my sister hasn’t woken up?” asked James Collins. <br/><br/>She turned off her light past three o’clock last night, and she needs to go to the drama crew in the afternoon.” Kevin Clark didn’t answer him. <br/><br/>James Collins scratched his head again and came back, saying, “How do you know everything?” <br/><br/>Kevin Clark didn’t pay him attention and continued to watch the movie on his cell phone. <br/><br/>James Collins plopped himself down opposite him, with his legs crossed, his arms folded, and staring at Kevin Clark. <br/><br/>Last night, this man just gave him a set of clothes, pointed him to the guest room, and then didn’t say a word to him. <br/><br/>He was so gentle in front of his sister, but once he turned his head, he was like a changed person, his whole body radiating a ‘do not approach’ and ‘untouchable’ aura. <br/><br/>Particularly that aura of a high-ranking person, mysterious and eerie. Luckily he was a materialist, otherwise he might have thought there were fairies. <br/><br/>“Alright.” James Collins didn’t mind. He took a pair of disposables, put them on, and went in. <br/><br/>After that, he observed everything along the way, chattering non-stop. His mouth seemed like it couldn’t be closed. Plus, he would continuously call out “sister” if Daisy Zane didn’t respond every few sentences. <br/><br/>Kevin Clark arranged the dishes he had bought onto plates while listening to James Collins’s voice, and suddenly felt that Daisy Zane was sometimes very patient, possibly from being ground down by this kid. <br/><br/>“James Collins, come eat.” Daisy Zane’s voice was colder than usual. <br/><br/>“Got it.” James Collins responded. <br/><br/>But when Kevin Clark served her the rice and the soup, he still hadn’t arrived. Daisy Zane stirred the soup with her spoon and whispered, “One, two...” <br/><br/>“Sister, here I am! Here I am!” James Collins immediately ran into the dining room, sat next to Daisy Zane, and giggled, “Don’t be mad, I’m here.” <br/><br/>Kevin Clark served him a bowl of rice too, feeling that their way of getting along implied that James Collins must have known Daisy Zane since he was in his teens. <br/><br/>And that he was indeed raised by Daisy Zane. <br/><br/>“Did he disturb you last night?” Daisy Zane asked Kevin Clark. <br/><br/>“Sister, how could I? I’m super-behaved.” James Collins’s peach blossom eyes curved up into a smile. <br/><br/>Daisy Zane glanced at him, then waited for Kevin Clark to speak. Kevin Clark served her food and said, “He was quite good last night.” <br/><br/>“Sister, see? I’ve grown up, I am sensible now.” <br/><br/>“But this morning, he told me that many people are pursuing you, and they’re all very excellent. Told me to be careful and to know my own limitations, ” Kevin Clark served Daisy Zane a piece of fish that he’d picked out the bones from, then sighed softly, “and he threatened me. He said if I have any delusional ideas, I’d get beaten until I can’t even recognize my father.” <br/><br/>James Collins choked, looking up at Kevin Clark in disbelief. When had he ever said something like that? <br/><br/>Daisy Zane looked over at James Collins, who quickly shrank back, “Sister, listen to me. I didn’t say that. I didn’t, really. He’s lying to you.” <br/><br/>Daisy Zane kept her gaze on him. <br/><br/>James Collins got nervous, “I, I didn’t say so much.” <br/><br/>Of course, Daisy Zane knew that the latter part about beating him up wasn’t what he’d said. But that one sentence he did say exposed Kevin Clark’s intention, laying it out on the surface. <br/><br/>Even though it’s obvious to anyone with eyes, seeing it and saying it are two different things. <br/><br/>Kevin Clark’s sentence threw both of them into the mix. <br/><br/>Daisy Zane looked leisurely towards Kevin Clark, coldness filled her eyes. <br/><br/>Kevin Clark met her gaze with a gentle and candid smile in his eyes. He withstood her icy glance and after a few seconds, said, “Don’t be mad.” Daisy Zane didn’t respond, but the chill in her eyes did die down slightly..\t\t\t\t\t\t</div>", "images": {}, "success": true}