{"id": 38, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14078497.html", "title": "Chapter 38 - 38: Don’T Drink Water From Strangers", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 38 - 38: Don’T Drink Water From Strangers</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 38: Chapter 38: Don’t Drink Water from Strangers <br/><br/>Translator: Atlas Studios Editor: Atlas Studios <br/><br/>Daisy Zane carried a box containing a sniper rifle and quickly came out of an alley, then ran up a building. <br/><br/>She ran up and down the stairs four or five times. <br/><br/>Kevin Clark watched her cold, stern face which had a hint of fierceness from behind the equipment. For a moment, he couldn’t tell if she was acting or if she was really like that. <br/><br/>After the scene where she ran up the stairs was shot, her next task was to assemble the sniper rifle on the upper floor. <br/><br/>As the director called “Action!” , Daisy Zane quickly opened the box and assembled the sniper rifle. <br/><br/>She carried out the task systematically, quickly, and placed it in the right position with utmost professionalism. She was countless times more professional than the Prop Master. <br/><br/>She looked both cool and dashing. <br/><br/>Allonzo Hobson and Kevin Clark watched her closely from behind the equipment. The two exchanged glances. <br/><br/>Kevin Clark clearly saw a small action when she was loading the bullet. Her right thumb touched the inside of her ring finger. <br/><br/>Kevin Clark remembered that she had a mole on the inside of her ring finger. <br/><br/>It didn’t seem like an action for the character, but more like a habitual action. <br/><br/>But she usually didn’t have this habit. <br/><br/>It is like some people have certain quirky habits in certain scenarios. <br/><br/>Kevin Clark frowned. <br/><br/>“Cut.” <br/><br/>At the director’s shout, Kevin Clark came back to his senses. <br/><br/>“Lucia, that... our guns have recoil. How did you eliminate the recoil? The shots taken just now were very good, very handsome. Let’s reshoot these shots to show the power of the recoil.” <br/><br/>Daisy Zane nodded in response. <br/><br/>The gun, although authentic looking, was only a prop, the recoil was much less than a real gun’s. <br/><br/>Kevin Clark chuckled to himself. <br/><br/>Meanwhile, Lilian Lopez glared at the Prop Master, who wore a wronged expression. <br/><br/>He didn’t teach her, but she knew how to do it herself. <br/><br/>After shooting the sniper scene, the director asked Daisy Zane to come and see the shots she had filmed. <br/><br/>Kevin’s eyebrows twitched with amusement in the corner of his eyes, “Consider hiring an assistant.” <br/><br/>“We’ll see, I can manage for now,” Daisy replied. <br/><br/>Kevin took the water from her hand, “Once the weather turns chilly, remember to drink more hot water.” <br/><br/>“Mhm.” Daisy complied. <br/><br/>“Don’t drink water offered by strangers.” <br/><br/>Allonzo Hobson, back turned to the pair, chuckled so hard that his shoulders shook. Daisy also gave a laugh and coolly responded, “Mhm.” <br/><br/>Kevin clenched his fingertips, restraining the urge to caress her face, then landed a kick on Allonzo Hobson, causing him to stumble. <br/><br/>“Mr. Hobson, Third Master.” George Dunn called out to them. <br/><br/>Kevin squinted, Allonzo Hobson grinned, “Well, George, where’s your big-shot boss? How come you’ve started working on someone else’s script instead?” <br/><br/>“Even big-shots need a break. I was bored, so I took on a script,” George finished, then turned to Daisy, “Riley, they’re preparing the next scene. You should get ready.” <br/><br/>George was acquainted with them since childhood and was a bit older than them too. His impression of this crew of young masters wasn’t exactly favorable, and the reputations of Kevin and Allonzo Hobson weren’t either. So, he steered Daisy away from them. <br/><br/>Daisy glanced at the three of them, then at Kevin once more before turning to leave. <br/><br/>Now, only the three men remained, George and Allonzo Hobson were engaged in a casual chatter, while Kevin paid no attention to them, displaying clear hostility toward George. <br/><br/>Once the scene and props were ready, a make-up artist touched up Daisy’s make-up—no wardrobe change was necessary. Filming resumed. <br/><br/>Initially, she was working with extras, and everything went smoothly—several shots were retaken. The director continuously complimented Daisy’s action scenes in front of Hobson and friends. <br/><br/>Soon after, she began rehearsing with the Martial Arts Instructor. <br/><br/>At first, everything was going well; all of their movements were captured in a single shot. <br/><br/>Impressed, Daisy felt that the Instructor was truly professional, given that he didn’t cause any troubles for her. <br/><br/>However, just when they were nearing the end, the Martial Arts Instructor, holding a dagger in his hand, changed course and targeted her face. <br/><br/>Though the dagger was blunt, the kind of force he was using would definitely scar her pretty face upon contact. <br/><br/>The director, watching from his equipment, didn’t catch anything amiss. <br/><br/>However, the three of them noticed it. <br/><br/>Allonzo Hobson cursed, “Damn.” <br/><br/>Kevin stood and started walking toward them. <br/><br/>But Daisy was quick to react to the instructor’s intentions. She dodged, entirely on her waist strength, while gripping the wrist of his dagger-holding hand, twisting it with force....\t\t\t\t\t\t</div>", "images": {}, "success": true}