{"id": 35, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14078494.html", "title": "Chapter 35 - 35: I Won’T Let A Fool Act In My Script", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 35 - 35: I Won’T Let A Fool Act In My Script</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 35: Chapter 35: I Won’t Let a Fool Act in My Script <br/><br/>Translator: Atlas Studios Editor: Atlas Studios <br/><br/>“Brother Michael, didn’t you find that Daisy Zane’s voice just now was very familiar?” George Dunn’s assistant, Josh, said. <br/><br/>After the initiation ceremony, they all went to the makeup room. After their makeup was done, filming began right away. <br/><br/>George Dunn had his own makeup room, and his makeup team was also in-house. <br/><br/>“You also noticed it, didn’t you? Doesn’t it sound just like Brook God? I thought I heard it wrong.” George Dunn suddenly opened his eyes. <br/><br/>“Brook God?” the makeup artist said, “There’s no one else with such a cold, yet pleasant voice.” <br/><br/>“You didn’t hear it, but it was so similar,” Josh said, “Especially the sentence she said to Lilian Lopez, it was almost the exact same tone as when Brook God scolded Brother Michael.” <br/><br/>“Get out, that was clearly her loving greeting to me. When did she ever scold me?” George Dunn glared at his assistant, “Hand me my cell phone, I have to tell Brook God about this.” <br/><br/>Josh handed over the phone with a smile: “Besides, she’s very pretty, so pretty that it’s almost against nature. I wonder what Brook God looks like. I wonder if she’s also that pretty.” <br/><br/>“Our Brook God relies on her talent.” <br/><br/>It wasn’t that George Dunn thought Brook God was not pretty, he just had to admit that Daisy Zane was extremely beautiful. After seeing all kinds of beauties in the entertainment industry over the years, she still managed to dazzle him with her stunning looks. <br/><br/>George Dunn sent a message to “Did Brook God reply today?”: [Brook God, I met someone on the film set today whose speaking voice is exactly like yours.] <br/><br/>When Daisy Zane received the message, she was waiting in the makeup room because the makeup artist hadn’t reached her yet. <br/><br/>As she looked at her phone, she replied with a message: [Hmm, it’s me.] George Dunn quickly replied back. <br/><br/>NIAN: [Hahahaha, Brook God, you’re such a joker. Even though we’ve never met, I’m sure I could recognize you in an instant if you stood in front of me. How about we try a comedy for the next script? I can handle anything.] <br/><br/>Daisy Zane: . <br/><br/>[There won’t be a next script, I won’t let an idiot film my script.] <br/><br/>After sending this message, Daisy Zane went to get her makeup done and didn’t pay any more attention to him. <br/><br/>Today, Daisy Zane had two scenes, one each with the male and female leads. <br/><br/>The scene with the male lead was in the evening, while the one with the female lead was close to noon. <br/><br/>She played the female lead’s older sister, three years older than her, and the two had relied on each other since they were little. <br/><br/>The scene at noon today was a flashback in which the two sisters were in their teens. The older sister took the younger sister to work and on their way back home, they encountered chaos in the streets. <br/><br/>Both girls were beautiful and, when discovered by the enemy, they were chased. <br/><br/>Her hands were fast, and so was the computer’s response time. <br/><br/>By the time Hill looked, the script-writing screen had already been replaced by another document. Daisy continued typing without skipping a beat. <br/><br/>Hill glanced twice and realized it was the script she was currently shooting. She exclaimed, “Are you memorizing the script?!” <br/><br/>“Yeah, I’m a bit bored.” <br/><br/>“Whose lines are these? This... this character doesn’t have any scenes with you. <br/><br/>Why are you memorizing their lines?” <br/><br/>Daisy didn’t pause in her typing: “I didn’t mean to memorize them. I just happened to remember them while reading the script.” <br/><br/>Hill looked at Daisy with a mix of bewilderment and awe. “Is your memory really that good?” <br/><br/>“It’s passable.” <br/><br/>Michael twitched at the corner of his mouth when he heard this conversation. <br/><br/>Unassuaged by Daisy’s modesty, Hill returned to her seat, tilting her head and closing her eyes again. After a while, she said, “You should take a break too. You still have scenes to shoot tonight.” <br/><br/>“Okay.” <br/><br/>Daisy switched back to the previous screen. <br/><br/>She suddenly had a burst of inspiration after finishing the scene at noon, so she wrote an outline for a script. <br/><br/>Looking at the one-and-a-half line spacing in the document, Daisy resisted the urge to change it countless times. No matter how she looked at it, it seemed off. Finally, she couldn’t help but change it to eighteen-point font. <br/><br/>She suddenly thought that perhaps Robinson Scott was right – the professor might be getting old, and the smaller line spacing made it difficult for him to read the report without getting the lines mixed up. <br/><br/>At dinner time, Kevin Clark sent Daisy a few photos. <br/><br/>While eating, Daisy opened those pictures. <br/><br/>They were all lotus flowers. There were close-up shots of single lotuses with water droplets on them, as well as vast lotus ponds, lotus leaves, and lotus pods, stretching out endlessly in the misty rain. <br/><br/>The pictures were both beautiful and breathtaking. <br/><br/>Soon, Kevin sent another message: [It rained in Imperial Capital today.] <br/><br/>Daisy complimented the lotus flowers: [Very beautiful.] <br/><br/>Kevin: [When the drama crew has some free time, I’ll take you to see them.] Daisy read his message, then looked at the photo of the vast lotus pond. She focused on the character “Leaf” on the lanterns hanging by the pond. <br/><br/>After hesitating for a while, she finally didn’t refuse and replied: [Okay..]\t\t\t\t\t\t</div>", "images": {}, "success": true}