{"id": 34, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14078493.html", "title": "Chapter 34 - 34: No Need To Show Me Such Great Courtesy", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 34 - 34: No Need To Show Me Such Great Courtesy</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 34: Chapter 34: No Need to Show Me Such Great Courtesy <br/><br/>Translator: Atlas Studios Editor: Atlas Studios <br/><br/>“Arthur, what’s going on, what happened?” <br/><br/>After leaving the parking lot of Doomsday Hotel, Johanes Miles couldn’t even walk a step. His legs were weak and his back was hurting, so the driver took him to the hospital first. <br/><br/>After the examination, it turned out that his bones were not injured, but there was a large swelling on his back. Johanes Miles couldn’t even walk straight; he could only be supported by others, bending and grimacing, having to stop every few steps. <br/><br/>He had to lie down on the back seat on the way back. <br/><br/>Apart from the pain, his face was flushed with shame. He had never felt so humiliated before. <br/><br/>“What happened? Did you have a car accident?” Charles Hobson hurried over to help him, but ended up touching the painful area, causing Johanes Miles to gasp in pain. <br/><br/>“Dad, what’s wrong with you? You should go to the hospital right away.” Amelia Miles hurried over as well. <br/><br/>The driver slowly supported him and said, “Madam, young lady, Sir’s back is injured and swollen. We’ve already been to the hospital; the doctor said he’ll be fine after resting for a while.” <br/><br/>They helped him walk to the sofa. After adjusting his position several times, he finally sat down with difficulty. <br/><br/>After the driver left, the maid poured a glass of water. Charles Hobson handed him the cup and asked, “What happened?” <br/><br/>“All thanks to that damn girl.” Johanes Miles said angrily. <br/><br/>“Who?” Charles Hobson and his daughter exchanged glances, “Daisy Zane?” <br/><br/>“Who else could it be?” <br/><br/>Old Master Miles, who had been staying at the Miles Family’s residence recently, heard the commotion and came out, “What’s going on? What happened to Daisy?” <br/><br/>“What happened?” Johanes Miles, who had always been filial and never raised his voice to Old Master, spoke with a heavy tone today, “She tried to kill your son!” <br/><br/>Old Master Miles leaned on his cane and walked to the sofa. He was taken aback by Johanes Miles’ tone and noticed his pale face and awkward sitting posture, so he asked, “What happened? Are you injured?” <br/><br/>“I almost died!” Johanes Miles picked up the glass of water from the tea table and threw it across the room. <br/><br/>The sound of the glass shattering startled everyone, and Johanes Miles winced in pain as he grabbed his back, his face contorted in agony. “She hired a bunch of thugs to surround me in Doomsday Hotel’s parking lot. They beat me and warned me that if I hinder her development in the entertainment industry, they’ll kill me and make Miles Group go bankrupt! What a big mouth she has! What incredible skills! To have someone beat up her own father!” <br/><br/>“Don’t get too angry and hurt yourself further.” Instead of saying anything else, Charles Hobson comforted Johanes Miles, rubbing his chest to help him calm down. “You’re injured, don’t get so worked up.” <br/><br/>“Yeah, Dad, is there some misunderstanding here? Sister, how could she know such people?” Amelia Miles said. <br/><br/>“What misunderstanding?! They even mentioned her name!” Johanes Miles brushed Charles Hobson’s hand away, “Don’t call her ‘sister,’ she’s not your sister! I, Johanes Miles, don’t have such a daughter! I’m saying this today; as long as I’m alive, she’ll never set foot in the Miles Family’s door again.” <br/><br/>Old Master Miles knew that the words were directed at him. He walked over and sat on the opposite sofa, touching his cane as he asked, “How is the injury? <br/><br/>Did you go to the hospital?” <br/><br/>Johanes Miles didn’t answer. <br/><br/>“Thomas, I’ll send you to the military district.” Kevin Clark said softly. <br/><br/>His voice sent chills down Thomas’s spine, and he swallowed, “Third Master, I was wrong.” <br/><br/>Kevin glanced at him, and after cautioning him with his eyes, said nothing, and turned his attention to his phone contacts. <br/><br/>He sent a message to someone named William Lane: [I borrowed your hotel tonight. When are you coming back to Imperial Capital? I’ll have someone send you a few rare lotus plants.] <br/><br/>A few minutes later, William Lane replied: [Don’t bother, I don’t want them. They’ll just die and I’ll have to pay for them!] <br/><br/>The next day at seven o’clock in the morning, the drama crew held the opening ceremony. <br/><br/>Important actors had arrived at the scene. <br/><br/>The director and producer spoke first, briefly introducing the actors present. Then came the ritual of burning incense and praying. <br/><br/>The director, producer, and screenwriter went first, followed by the male and female leads. <br/><br/>Daisy Zane waited in the back. After the two leads finished their prayers and stood aside... <br/><br/>She stepped forward with the incense stick... <br/><br/>When she was two or three steps away from the incense burner, the female lead suddenly stretched her leg towards Daisy’s feet. <br/><br/>If she tripped, not only would it be a bad omen at this time, but if she stumbled forward, it would also be easy for her to hit the incense burner and ruin her face. <br/><br/>Then the show would be over. <br/><br/>Many people saw the female lead’s move, some of them watching for fun, others feeling concerned. <br/><br/>Hill Dawson even called out to Daisy. <br/><br/>However, it was too late, as Daisy had already stepped forward. <br/><br/>But just as the female lead was feeling triumphant, she herself fell to the ground, right next to Daisy’s feet. <br/><br/>The sudden turn of events transformed her smug expression instantly into one of panic, and it was hilarious. <br/><br/>She really underestimated Daisy Zane’s observational skills, reaction speed, agility, and the fact that she could have easily broken her leg if she used a little more force. <br/><br/>Everyone looked over. <br/><br/>Daisy Zane looked down at her, quietly saying, “I’ll play the role well, there’s no need to kowtow to me, or go out of your way to show me such respect.” <br/><br/>As Hill Dawson ran over, she heard this sentence. While holding in her laughter, she and the female lead’s assistant, as well as the male lead, quickly helped her up and exchanged pleasantries. <br/><br/>The female lead was called Lilian Lopez. She glared at Daisy Zane, but due to the crowd, she couldn’t come up with a suitable retort for a long time. <br/><br/>Daisy didn’t pay her any more attention, went to the middle, and prayed. Then she inserted the incense in the incense burner. <br/><br/>She looked up at the wisps of smoke rising above the incense burner, drifting towards the sky, and touched the pendant inside her clothes....\t\t\t\t\t\t</div>", "images": {}, "success": true}