{"id": 36, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14078495.html", "title": "Chapter 36 - 36: Investigating An Individual", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 36 - 36: Investigating An Individual</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 36: Chapter 36: Investigating an Individual <br/><br/>Translator: Atlas Studios Editor: Atlas Studios <br/><br/>Imperial Capital <br/><br/>Kevin Clark stood with his hands behind his back under the corridor, looking at the lotus flower in the night. <br/><br/>As the rain fell, it dripped on the lotus flower, causing it to sway gently. <br/><br/>In a moment, Kevin raised the corner of his mouth, his vermilion thin lips appearing exceptionally enchanting in the night. <br/><br/>“Why so happy? <br/><br/>A very pleasant voice sounded from behind him. Kevin turned around and said warmly, “Mom, why did you come out on your own?” <br/><br/>The woman in front of him was dressed in an apricot cheongsam with a shawl draped over her shoulders and her hair pulled up. Her skin was very white, and she looked to be only in her early fifties, resembling Kevin’s appearance with a 70% likeness. <br/><br/>However, Kevin’s eyes were deep, double-lidded, always giving people a strong and seductive feeling. <br/><br/>This woman’s eyes were somewhat like phoenix eyes, with delicate brows and eyes, full of charm and beauty in every frown and smile. <br/><br/>But her every gesture also had a gentle and elegant demeanor. <br/><br/>Tom Wayne adjusted her shawl and stood beside him, also looking at the lotus pond. “Your father is talking business with your elder brother. I slipped out without him noticing.” <br/><br/>Her voice was extremely beautiful, with a unique Beijing accent and a pleasant tone. <br/><br/>Kevin smiled and said, “The corridor is slippery on rainy days. In the future, let <br/><br/>Auntie accompany you when you come out.” <br/><br/>“You guys are too much. I’m not that old. I’m only sixty-nine. Do you think I would fall?” Tom Wayne said arrogantly. <br/><br/>“No, I’m afraid you’ll feel bored by yourself.” <br/><br/>“How could I be bored? Your father has been practically glued to my side. It’s not easy for me to catch a break.” <br/><br/>Kevin raised his eyebrows, sensing that this might be bait she was throwing out for him to catch, but he didn’t dare to respond. <br/><br/>As expected, Tom Wayne glanced at him when he didn’t say anything and then got directly to the point, “Kevin, you’re already twenty-eight this year, and your father is eighty. When do you plan to let him hold his grandchild?” <br/><br/>“Mom, I wasn’t even born when my father held his grandchild,” Kevin said warmly. “You guys should be pushing Enamel Cannon more. He’s thirty now and at the right age to get married. Your great-grandchildren would be several years old by now.” <br/><br/>“As soon as I bring it up, you mention Enamel. Your big brother and sister-in-law are already taking care of his affairs.” Tom Wayne paused and continued, “I played cards at the Lane Family’s house a few days ago, and I saw their youngest daughter. She’s incredibly beautiful.” <br/><br/>“Mom, how old is she?” <br/><br/>“I asked, she’s eighteen. She’s an adult, and she’s in Senior Three. There’s just a ten-year age difference between you two. There’s an eleven-year age difference between your father and me, and we’re still doing fine.” Tom Wayne smiled and said, “Moreover, the Lane Family is a proper match for our family. Looking around, who else can compare to our family?” <br/><br/>Kevin couldn’t help but laugh. “Mom, our two families can be considered old acquaintances. Counting from our ancestors, that girl would have to call me <br/><br/>To the point where they had argued over opinions through the cell phone. <br/><br/>So their cooperation was quite good. <br/><br/>George Dunn intentionally gave the newcomer a chance, and Daisy Zane also cooperated with him subconsciously. <br/><br/>When it was over, and Daisy Zane was about to leave, George Dunn even chased after her to compliment her, “Great acting, very talented.” <br/><br/>As Daisy Zane put on her coat, she said, “Thank you for the compliment, Best Actor Dunn.” <br/><br/>Listening to her cold voice, George Dunn felt very refreshed, “Go back and rest early. ” <br/><br/>“Mhm.” Daisy Zane replied, seeing him still looking at her, she paused and said, <br/><br/>“You should also rest early, Best Actor.” <br/><br/>“See you tomorrow.” <br/><br/>Daisy Zane nodded and went straight away. Seeing her go first, Hill Dawson stayed and exchanged a few words with George Dunn before leaving. <br/><br/>Josh had been following George Dunn, and when he saw them walk away, he said, “Brother, her voice really sounds like Brook God’s. I feel like I’m talking to Brook God himself.’ <br/><br/>George Dunn exhaled lightly, fixing his hair that had been set with hair gel, “Listening to her made me feel better.” <br/><br/>As soon as Daisy Zane got into the nanny car, she felt the cold from Michael Jackson’s body, obviously, he had gone out and just returned not long ago. <br/><br/>She didn’t ask but closed her eyes when she sat in the seat. <br/><br/>Daisy Zane and Hill Dawson stayed in a suite at the hotel. When they returned to the hotel and finished washing up, Hill Dawson saw that Daisy Zane’s face was not looking well and asked, “What’s wrong? Are you feeling unwell?” <br/><br/>“It’s nothing, my period just started.” Daisy Zane walked around the room, “Where’s that smaller piece of luggage?” <br/><br/>Hill Dawson knew it contained medicine and quickly found it and opened it. <br/><br/>Daisy Zane squatted beside the opened luggage, searching through it and found a box of painkillers. When she opened the box, a note fell out. <br/><br/>She unfolded it, and the handwritten thin gold lettering inside. <br/><br/>‘If your stomach hurts, take half a pill, and then take another half after twelve hours. It should be very effective, take it with ease, there are no side effects. The heat pads under the small medicine box are attached to the abdomen, which contain herbal medicine prepared by my mother and are very effective. Also, the medicine packet under the heat pads can be used when soaking your feet to help ease the pain. Normally, avoid cold drinks and touching cold things. With proper care, the pain will go away over time.’ <br/><br/>Hill Dawson also leaned over to see, “Written by Third Master Clark?” <br/><br/>Daisy Zane folded the note properly and put it back in the medicine box, picked a pill, and broke it in half, “Yes.” <br/><br/>“Third Master is so thoughtful.” Hill Dawson took out the heat pads and the medicine packet, “He even remembered that you get stomach aches and prepared medicine for you.” <br/><br/>Daisy Zane put the pill in her mouth and swallowed it directly. <br/><br/>She remembered the last time she had a fever when Harton Clark took her pulse... <br/><br/>He not only diagnosed her illness but also checked her body while doing so..\t\t\t\t\t\t</div>", "images": {}, "success": true}