{"id": 39, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14078498.html", "title": "Chapter 39 - 39: Sister Xi, Kind Of Handsome", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 39 - 39: Sister Xi, Kind Of Handsome</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 39: Chapter 39: Sister Xi, Kind of Handsome <br/><br/>Translator: Atlas Studios Editor: Atlas Studios <br/><br/>The dagger swiped past Daisy Zane’s face, and she clearly felt a chill on her skin. <br/><br/>Daisy cast her eyes down, watching the dagger leaving. She steadied herself and then grabbed hold of his wrist, twisting it in the opposite direction, bending his arm behind him and forcing him to bend over. <br/><br/>The martial arts instructor didn’t expect her to react so quickly. Not only had she reacted, she struck back at him. <br/><br/>He tried to resist, but Daisy Zane’s strength was overwhelming, leaving him no room to retaliate. <br/><br/>Seeing her unharmed, Kevin Clark stopped just before entering the shooting area and watched from afar. <br/><br/>Allonzo Hobson and George Dunn also breathed a sigh of relief. <br/><br/>Daisy felt he wanted to break free and deliberately loosened her grip. An instant later, the martial arts instructor turned, swinging his other hand. <br/><br/>Daisy, taking advantage of his move, held the wrist and dislocated it with a light pull. Unearth this data, retracing it to the very heart of Nøv€lß¡n★<br/><br/>The martial arts instructor’s face turned pale in pain, and beads of sweat formed on his forehead, while he let out a sigh. At that instant, he could only think of one thing: “If this hand touches me again, I’ll disable it.” <br/><br/>But there are cameras and so many people around. She wouldn’t dare. <br/><br/>Yet, just as the thought crossed his mind, his wrist was reattached, and the pain vanished. <br/><br/>Daisy’s speed in pulling and pushing was so fast that no one noticed. Neither Allonzo Hobson nor George Dunn at the machine end noticed. Even the director was so absorbed that he thought the fight was rather impressive. <br/><br/>Only Kevin Clark saw Daisy’s hand from afar and lifted the corner of his mouth slightly. <br/><br/>The shooting site was set up with some cloth sacks filled with soft cotton. <br/><br/>Daisy raised her leg and kicked the martial arts instructor onto the sacks, knocking him down and burying him in cotton. <br/><br/>“Cut. Great! This take is perfect!” <br/><br/>After the director stopped, Daisy didn’t even glance at the martial arts instructor, walking away. <br/><br/>It took a while for the martial arts instructor to be helped up, and then he caught a distant glance of Lilian Lopez. <br/><br/>When Daisy left the shooting site, she saw Kevin standing next to her and raised her eyebrows at him. <br/><br/>Kevin’s gaze landed on her nearly cut cheek, only relaxing when he saw that it was completely unharmed. <br/><br/>“Daisy, you looked pretty cool,” Kevin smiled and said. <br/><br/>Daisy was quite receptive to the nickname “Daisy,” visibly changing her mood. <br/><br/>“Only a bit cool?” <br/><br/>Kevin laughed a bit. “Very cool.” <br/><br/>“Have you heard of the Imperial City Clark Family?” Firway asked. <br/><br/>“Yeah.” Daisy Zane closed her phone, leaned back in her seat, and looked at him through the rearview mirror. <br/><br/>“Then you should know how noble and distinguished our Third Master is. Not everyone can reach his level.” Firway said coldly, with a hint of pride. <br/><br/>“Really? I’m not so sure.” Daisy Zane looked at him and said, “All I heard is that your family’s Third Master has a bad reputation, idle and extravagant, promiscuous by nature, and very manipulative.” <br/><br/>“You! You’re talking nonsense!” <br/><br/>Seeing the frustrated look on Firway’s face, Daisy Zane felt great: “That’s not all, I also heard that after inheriting the Clark family, his nephew didn’t give Third Uncle a single cent of his shares.” <br/><br/>Firway could only stare at Daisy Zane angrily with nothing to say, looking at the road in front of him and Daisy Zane from time to time. <br/><br/>Seeing him like this, Daisy Zane continued, “So, your family’s Third Master actually has no real power in the Clark family.” <br/><br/>Firway slammed on the car horn angrily. <br/><br/>“BEEP-” A loud beep startled a nearby car with a learner’s label, causing them to apply the brakes. <br/><br/>Daisy Zane laughed at Firway’s reaction and closed her eyes, ignoring him. <br/><br/>Firway could only stare at her angrily, his face getting red. <br/><br/>Daisy Zane returned to the hotel, changed her clothes, washed her face, and then wrote for a while on her script. <br/><br/>At around seven o’clock, the director sent the location for dinner and asked her to inform Hobson. <br/><br/>Daisy Zane forwarded the location information directly to Arthur North. <br/><br/>Arthur North replied quickly: [In twenty minutes, let Thomas Firway take you there.] <br/><br/>Seventeen minutes later, Daisy Zane went downstairs. <br/><br/>She bumped into a drama crew actor at the hotel entrance. <br/><br/>They didn’t have any interaction or shared scenes, they only met briefly on the first day of filming. She heard Hill Dawson mention that the actor had been Lilian Lopez’s body double before, her name was...Serena Buster. <br/><br/>Hill Dawson loved gossip and would tell Daisy all kinds of things. Some Daisy never cared to remember. But Serena Buster was very beautiful. <br/><br/>She was more beautiful than Lilian Lopez, which left quite an impression on Daisy. <br/><br/>“Daisy Zane.” Serena Buster suddenly called out to her. <br/><br/>Daisy Zane stopped and looked at her. <br/><br/>Standing two steps away from Daisy, Serena Buster seemed to be hesitating, a bit scared of Daisy Zane. In the end, she stammered, “Nevermind.” <br/><br/>Then she quickly entered the hotel. <br/><br/>Daisy Zane looked at her retreating figure inside the hotel and just at that moment, Thomas Firway honked the horn, urging her to hurry up. <br/><br/>She took her eyes off Serena and deliberately slowed down her pace, even standing by the car for a while before getting in.\t\t\t\t\t\t</div>", "images": {}, "success": true}