{"id": 33, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14078492.html", "title": "Chapter 33 - 33: Third Master Comes To The Door", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 33 - 33: Third Master Comes To The Door</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 33: Chapter 33: Third Master Comes to the Door <br/><br/>Translator: Atlas Studios Editor: Atlas Studios <br/><br/>Johanes Miles’ voice wasn’t loud, but James Collins heard every word clearly. <br/><br/>Fury was about to burst from his peach blossom eyes. He raised his foot, ready to step forward and hit someone: “Damn it, this b*stard!” <br/><br/>But Kevin Clark held him back. <br/><br/>Swiveling his wrist, James tried but failed to break free. He glared at Kevin. <br/><br/>Kevin’s expression was calm, except for an eerie glint in his eyes, “Don’t distract her performance.” <br/><br/>“Huh?” James was genuinely confused and his annoyed expression appeared rather comical. <br/><br/>Kevin pulled him back and paid no more attention to him, instead focusing on Daisy Zane. <br/><br/>After hearing Johanes Miles’ words, Daisy chuckled, “Is there something wrong with your brain? Why are you laughing at me? You’re the one who cheated.” <br/><br/>“You! You...” Rage colored Johanes Miles’ face, and in a low voice, he snapped, “Even if no one laughs at you, what about your mother? Where do you place her?” <br/><br/>“What does my mother have to do with this? You’re the one who cheated,” Daisy replied slowly, “The illegitimate child isn’t mine. Do you think no one will ever find out about your affairs just because you’ve erased all traces?” Hearing her words, Kevin’s left eyebrow twitched. So, she knew everything. <br/><br/>“What do you mean?” <br/><br/>“Stop pretending. We both know what’s going on.” Daisy looked into his eyes, a tremor running through her eyelashes before she lowered her gaze and continued, “You’re afraid of losing face, being laughed at or having some secrets exposed. So, don’t bother me and take care of your own affairs.” <br/><br/>“Daisy Zane, let me tell you, if you dare to spread lies by taking advantage of your fame, I have methods to make you disappear,” Johanes Miles warned in a low voice. <br/><br/>“Didn’t you also say last time that you’d make me lose my place in the entertainment industry? Well, you should’ve carried out your threat.” <br/><br/>The tone of her voice was a little provocative, and Kevin couldn’t help but lower his head and chuckle. <br/><br/>From the time he saw her confront Amelia Miles at the entrance of Maple Elite Entertainment, Kevin knew that despite her seemingly aloof demeanor, Daisy was actually quite bold and outspoken. When angry, she could be very sarcastic, gently provoking her target. <br/><br/>“Don’t be too smug.” Johanes Miles shook the file bag in his hand, “Take this stuff and be obedient. Don’t cause trouble, and I’ll treat you well. But if you insist on going down this path, don’t blame me for being ruthless.” <br/><br/>“Do whatever you want, Johanes Miles. Did you think I came to Truro City just to live a peaceful life?” Daisy’s expression was cold as she stared into his eyes, “Some people haven’t even been laid to rest yet, and you’re already celebrating your new marriage and enjoying a comfortable life. The debt you owe needs to be repaid, and the punishment you deserve must be endured.” <br/><br/>Having said that, Daisy turned away without looking back and walked towards the nanny car. <br/><br/>Johanes Miles was momentarily stunned by her gaze. When he recovered and saw that she was leaving, he instinctively wanted to chase after her. But then he caught Kevin’s gaze. <br/><br/>A powerful oppressive force suddenly enveloped him, and Johanes Miles abruptly stopped, shivering in fear. <br/><br/>Even with his mask on, Johanes Miles could feel the aura of someone who viewed others as mere ants, capable of crushing him with ease. <br/><br/>Daisy walked to Kevin’s side and looked up at him, “Don’t scare people.” <br/><br/>Kevin slowly withdrew his gaze, lowering his eyes to look at her. Seeing that her mood wasn’t affected, he figured she was probably satisfied with her performance. In a gentle voice, he said, “Alright.” <br/><br/>Daisy smiled, opened the door to the nanny car, and said, “I’m leaving.” <br/><br/>“Mmm, good luck.” <br/><br/>Daisy Zane: . What if Catherine is a man?” <br/><br/>“Does it matter if it’s a man or a woman? Does it hinder netizens’ enjoyment of their relationship? Don’t be so hung up on gender.” <br/><br/>Daisy Zane’s face remained expressionless, but inwardly she was completely speechless. What a mess all this was. <br/><br/>“Lucia, maybe one day we’ll be chosen by Catherine God. And then we’ll have made it.” <br/><br/>Daisy Zane didn’t say anything, turned her head to look out the window, and closed her eyes. <br/><br/>It was past eight o’clock in the evening. <br/><br/>Johanes Miles finished his socializing at the Doomsday Hotel and was ready to go home. He had had some drinks, but not too much. His mind was clear, though his face was a little flushed. <br/><br/>The driver followed behind him, carefully, reminding him of the steps beneath his feet from time to time. <br/><br/>Upon reaching the parking lot, Johanes Miles walked a few steps, looked at the empty lot, feeling a little creepy. He hesitated and quickened his pace. <br/><br/>The driver also sensed something was wrong and said, “Director Miles, something feels off about this parking lot.” <br/><br/>Just as he finished speaking, a large number of people dressed in black suddenly appeared from all directions, surrounding them. <br/><br/>Johanes Miles immediately became alert and stood behind the driver, looking at them angrily, “Who are you!?” <br/><br/>No one said anything; the group of people stood upright, looking fierce and menacing. <br/><br/>It took almost a minute before the sound of footsteps came again, and the people in black parted to make way in front of them. <br/><br/>Arthur North slowly walked over, followed by Thomas Firway. <br/><br/>The parking lot was large, somewhat gloomy, and the light was dim, with a group of people wearing black emanating an intimidating aura. <br/><br/>As Arthur North walked slowly over, his enchanting face emerged from the darkness. Johanes Miles seemed to see the king of hell from the underworld coming for him. <br/><br/>His originally flushed face instantly turned deathly pale, and his lips trembled involuntarily. <br/><br/>“Mr. Miles, we meet again.” Arthur North’s face was adorned with a light smile, yet it was terrifying, and even his voice was frightening. <br/><br/>The pupils of Johanes Miles trembled, and he recognized Arthur instantly. Not only because of his aura but also because of those distinctive eyes. Even though Arthur had been wearing a mask at noon, he could still recognize him now: “What... what do you want! This is the Doomsday Hotel, there are CCTV cameras everywhere. If you dare to hurt me or make trouble at the Doomsday <br/><br/>Hotel...” <br/><br/>Before he could finish speaking, Thomas Firway emerged from behind Arthur North and grabbed Johanes Miles’ collar, slamming him against a nearby car. <br/><br/>A loud bang accompanied by a muffled groan from Johanes Miles. <br/><br/>The back of the car was dented, leaving Johanes Miles’ rear feeling fuzzed for a moment. <br/><br/>Arthur North approached, and when Johanes Miles had somewhat recovered, he said quietly, “Do you think the cameras in this parking lot are turned on?” <br/><br/>“You, you... what... what do you want to do...” <br/><br/>“Nothing.” Arthur North stared directly at him, his face smiling, his voice like that of a devil in Johanes Miles’ ears, “Just a warning. If you dare to mess with Daisy Zane or cause her trouble again, I will make sure that both you and the <br/><br/>Miles Group vanish completely..”\t\t\t\t\t\t</div>", "images": {}, "success": true}