{"id": 32, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14078491.html", "title": "Chapter 32 - 32: Johanes Miles Follows The Trail", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 32 - 32: Johanes Miles Follows The Trail</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 32: Chapter 32: Johanes Miles follows the trail <br/><br/>Translator: Atlas Studios Editor: Atlas Studios <br/><br/>Daisy Zane was the type that, if things didn’t go her way or if she was provoked, she wouldn’t budge once she made up her mind. <br/><br/>However, she was very receptive to Kevin Clark showing her his submissive side. <br/><br/>Perhaps it was because Kevin’s usual aura was too strong, or maybe it was because he met all of her aesthetic preferences. When he showed his vulnerability, she would lower her boundaries. <br/><br/>Daisy stared at him for a while, then lowered her eyes and continued eating. <br/><br/>Kevin smiled and helped her with the food. <br/><br/>James Collins blinked, unable to understand why his sister let it go so easily. Wasn’t she supposed to stand up and punch him to the ground? Why did she just start eating? <br/><br/>He didn’t understand, not at all. <br/><br/>After a while, Kevin went to wash his hands and came back to help Daisy with peeling the shrimp: “Be careful after you join the drama crew, and don’t be overly aggressive. In the future, when it gets cold, wear warm clothes and don’t drink cold water. I’ve prepared some medicine for you, with clear instructions on how to use it. Take it with you this afternoon.” <br/><br/>“Mm.” Daisy tasted a shrimp, and it was tasty, so she ate another. Then she gave a few unpeeled ones to James. <br/><br/>“I’ll ask Michael Jackson to come with you this afternoon, and I’ll visit you on set in a few days.” <br/><br/>Daisy placed two peeled ones in Kevin’s bowl. <br/><br/>Kevin smiled and continued, “Don’t let anyone bully you. If someone has bad intentions or an ill heart, beat them up. If anything happens, I’ll handle it. If there’s someone you can’t beat, tell me and I’ll beat them up for you.” <br/><br/>Daisy glanced at his thin wrist and slender fingers, thinking that she might actually be more capable than him. <br/><br/>Watching the two interact, James noticed something off about his sister and felt somewhat redundant in retrospect. <br/><br/>After finishing the meal, Daisy packed a few more things and waited for Hill Dawson to join her in heading to the drama crew. <br/><br/>Kevin directly handed her a small suitcase full of medicine for internal and external use, as well as items for dealing with injuries, headaches, colds, and even some health-promoting and warming items. <br/><br/>“Actually... it’s not that cold right now.” Daisy thought Kevin either had health issues or misunderstood the weather, so she kindly reminded him. <br/><br/>“Use them when needed.” Kevin smiled and didn’t say much else. <br/><br/>Daisy felt like there might be another meaning to his words, but before she could think about it, her cell phone rang. <br/><br/>Seeing the call was from Hill, she answered, “Are you here?” <br/><br/>“Let the uncles, aunts, grandpas, and grandmas have a good look at you and introduce girlfriends to you too. You’re not that young anymore and should be getting married.” Daisy Zane only showed her phoenix eyes, giving off an even more aloof feeling. <br/><br/>“Sister! I’m only twenty!” <br/><br/>“Hmm. You’ll be eligible to get a certificate in two years – just perfect.” Daisy Zane said. <br/><br/>“I don’t want to.” James Collins muttered softly, then turned his face away from everyone. <br/><br/>After a few more minutes, the nanny car came over. <br/><br/>As soon as the car stopped, Hill Dawson came over, greeted Kevin Clark first, then greeted Michael Jackson, saw another boy, nodded to him, and pulled Daisy Zane to chat. <br/><br/>“That car followed us.’ <br/><br/>Daisy Zane took a glance at the nanny car behind them: “James Collins, move the luggage to the car.” <br/><br/>“Okay.” <br/><br/>James Collins and Michael Jackson moved the luggage, while Daisy went straight to the back. <br/><br/>As soon as she walked over there, Johanes Miles got out of the car. He was wearing a perfectly fitting suit, a watch worth millions on his wrist, even each hair exuding elegance. <br/><br/>Looking at him like this, Daisy felt like throwing him into Cold Green Village, letting him experience working outside in the heavy rain and have a taste of not having enough to eat. <br/><br/>“I really underestimated you, managing to live in a place like this.” Johanes Miles said condescendingly and sarcastically. <br/><br/>“And I overestimated you, to the point you stoop so low as stalking.” Daisy Zane said, hands in pockets, “What, is the Miles family stable now? Got time to come and deal with me?” <br/><br/>“Daisy Zane, is this how your grandmother taught you? Have you no respect for your elders?” <br/><br/>“Are you considered elder or worthy? What about you is worth my respect? Is it the infidelity during your marriage? Or abandoning your wife and daughter?” Daisy said softly. <br/><br/>“You! What do you mean?” Johanes Miles’ face showed a sudden panic, but then immediately regained composure. That matter had already been cleaned up, everything that needed to be destroyed was destroyed, and all the connections needed were established. <br/><br/>There’s no proof. No one would believe it. <br/><br/>“I have a meeting later, I don’t want to waste time talking to you.” His driver handed Johanes Miles a file bag, and he stretched his hand out to take it. “Here are two sets of property, both in Imperial Capital, in good locations. There are also two land parcels, one in Imperial Capital and one in Truro City. Additionally, there’s a card with 5 million in it. As I said before, I will be depositing money in it every month. These things are enough for you to spend in a lifetime, even if you don’t do anything every day.” <br/><br/>Johanes Miles: “All these are yours. I only have one request. Leave Maple Elite <br/><br/>Entertainment and stay away from the entertainment and performance circles. ” <br/><br/>Daisy Zane looked at the file bag in his hand and didn’t show any intention of taking it, her hands still in her pockets. <br/><br/>Seeing this, Johanes Miles said, “Daisy Zane, think carefully about your own identity.. An illegitimate daughter is flaunting herself around – are you inviting people to laugh at you?”\t\t\t\t\t\t</div>", "images": {}, "success": true}