{"id": 40, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14078499.html", "title": "Chapter 40 - 40: Rumors Cannot Be Trusted", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 40 - 40: Rumors Cannot Be Trusted</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 40: Chapter 40: Rumors Cannot Be Trusted <br/><br/>Translator: Atlas Studios Editor: Atlas Studios <br/><br/>At the dinner venue, Harton Clark, Michael Jackson, and Allonzo Hobson were waiting for her at the entrance. <br/><br/>As soon as she got out of the car, it was hard to ignore Thomas Firway’s face and the hostility emanating from him. Plunge into the depths of Nøv€lß¡n, where information dwells.<br/><br/>“Wow, what’s the matter with Thomas? Who pissed off our dear Thomas?” Allonzo Hobson laughed. <br/><br/>Thomas Firway stood beside Harton Clark and glanced at Michael Jackson without saying a word. <br/><br/>Daisy Zane looked at him, slowly walked up to Harton Clark, and said, “I talked bad about you, and it made him angry.” <br/><br/>“What bad things did you say about me?” Harton Clark asked with a smile. <br/><br/>“Lazy, flirtatious, indulgent, and exist only in name,” Daisy Zane said casually. <br/><br/>“You...” Thomas Firway was so angry he almost smoked, but he was held back by Michael Jackson as soon as he tried to speak. <br/><br/>He looked back at Michael, and upon seeing his serious expression, Thomas Firway immediately wilted. <br/><br/>“Lady Zane, how could you summarize so accurately? These words are exactly the labels for our Third Master,” Allonzo Hobson said beside them. <br/><br/>Harton Clark gave Allonzo Hobson a dagger-like glare, and Allonzo Hobson immediately made a gesture to shut his mouth. <br/><br/>“Daisy, don’t believe rumors,” Harton Clark said warmly, looking at her. <br/><br/>Daisy Zane raised her eyebrows slightly, looking at him with a somewhat scrutinizing gaze. <br/><br/>Seeing her obviously somewhat incredulous expression, Harton Clark sighed helplessly and said, “Let’s go eat.” <br/><br/>Daisy Zane laughed and followed him inside. <br/><br/>Allonzo Hobson caught up and asked, “Lady Zane, we agreed that you would send me a message. Why did you send it to Harton and ignore me?” <br/><br/>Daisy Zane listened to his aggrieved tone and paused for a moment before saying, “I did it out of habit.” <br/><br/>“Next time don’t do it out of habit, send it to me.’ <br/><br/>Harton Clark grabbed the back of his collar and pulled him back a little, “Stay away.” <br/><br/>Allonzo Hobson: <br/><br/>As they arrived at the private booth, the director, screenwriter, and George <br/><br/>Dunn had already arrived. <br/><br/>The three stood up, and the director laughed, “Young Master Hobson, Daisy came with you?” <br/><br/>But if Allonzo Hobson has really set his sights on her, he has no control over it. However, it seems they are quite familiar with each other already. <br/><br/>It’s possible that the two of them sat here specifically for Daisy. However... the director and the screenwriter didn’t seem to realize this yet. <br/><br/>“Come on, Lucia, let’s toast to Young Master Hobson,” the director said as he raised his wine glass. <br/><br/>Kevin Clark immediately turned his head and looked at Allonzo Hobson. <br/><br/>Allonzo Hobson suddenly stood up with his wine glass: “No, no, no, no... I’ll toast to Lady Zane. Please take care of me more in the future.” <br/><br/>Both the director and the screenwriter were stunned for a moment. Only then did they realize something was going on, and hurriedly stood up. <br/><br/>Daisy also stood up, clinked glasses with Allonzo Hobson across Kevin Clark, didn’t say anything, and directly emptied her wine glass with a tip of her head. <br/><br/>Allonzo Hobson was taken aback and glanced at Kevin Clark, who looked indifferent, before drinking his wine as well. <br/><br/>When the dishes were served, Kevin Clark was in charge of picking up food for Daisy, who focused on eating. <br/><br/>The remaining four people chatted without bothering Daisy again. <br/><br/>Halfway through the meal, Allonzo Hobson picked up a phone call. He didn’t say anything but just listened to the other person’s words, didn’t respond, and hung up. <br/><br/>Then, he glanced at Kevin Clark and turned around to toast with the director and screenwriter, asking, “Is the lead actress in your show called Lilian Lopez?” Once he mentioned this, Kevin Clark knew what the phone call was all about. The martial arts instructor had exposed the person behind the scenes. <br/><br/>“Yes, does Young Master Hobson know her?” the director asked. <br/><br/>Allonzo Hobson didn’t answer him and asked, “How is her acting? Is it okay?” “It’s quite good,” the director said, then silently complained in his heart: her acting is good when she’s in a good mood. However, once she has more scenes, she throws tantrums, complaints about being tired, and acts high and mighty. It’s too much to handle. <br/><br/>Allonzo Hobson asked, “It’s been just over a week since your filming started, right?” <br/><br/>“Yes,” the director answered. <br/><br/>“Change the actress. I will compensate for all the losses,” Allonzo Hobson said, then looked at George Dunn, “A week delay shouldn’t be a problem for Best Actor Dunn, right? I heard that Catherine God hasn’t released any new books recently, so the Best Actor shouldn’t be in a hurry.” <br/><br/>George Dunn sensed something and looked back at him for a while before saying, “I’m fine with it.” <br/><br/>The director and the screenwriter became a little anxious, “Young Master Hobson, can I ask what’s going on? As you know, in our business, it’s taboo to change actors midway through, and...” And it’s not easy to explain to Lilian Lopez’s fans. <br/><br/>Not to mention Olivia Chester, but Lilian Lopez’s fans were numerous, and if the news got out, it would be a big trouble. <br/><br/>“You know, I usually take a long time to choose actors for my films, so... who should we replace her with?” the director worried. <br/><br/>He had been in the industry for many years, without any capital or connections behind him. He only relied on dedication, sincerity, and a commitment to doing his best on every aspect of each of his projects, from selecting actors, to the set, props, costumes, and special effects. <br/><br/>That’s why he had a good production team, but he was also the easiest target for bullying. So, he tried his best to please people like them and to smooth out any problems. <br/><br/>Daisy ate the shrimp that Kevin Clark had peeled for her and looked up at them for a moment, then continued eating. <br/><br/>“Director Nash, I’m not discussing this with you. I’m informing you, ” Allonzo Hobson still had a smile on his face, but it was colder than ice, “You should know, if I don’t allow, your drama crew can’t start work..”\t\t\t\t\t\t</div>", "images": {}, "success": true}