{"id": 43, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14078502.html", "title": "Chapter 43 - 43: Third Master Worries", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 43 - 43: Third Master Worries</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 43: Chapter 43: Third Master Worries <br/><br/>Translator: 549690339 <br/><br/>The online bashing was raging, while Daisy Zane counted money in her dreams all night. <br/><br/>When she woke up the next day, the first thing she saw on her phone was a production notice stating that the director was sick and had halted shooting for a day. <br/><br/>Then she saw the message Kevin Clark had sent twenty minutes earlier: [Tell me when you’re awake.] <br/><br/>Daisy replied to him first, then checked the hot searches while heading to the washroom. <br/><br/>Two hours earlier, the Truro Police Department had released a post on their official Facebook. <br/><br/>The text read: The truth is unknown, please do not make rash comments. The initial posting of this chapter occurred via noovelllbbin<br/><br/>A video was attached below. <br/><br/>It was from the martial arts instructor; the background seemed to have been filmed in an interrogation chamber. <br/><br/>The martial arts instructor had confessed everything clearly, not mentioning Lilian Lopez’s name directly, but using “Lilian Someone” instead. <br/><br/>He explained that Daisy Zane’s actions were also acts of self-defense. <br/><br/>He then apologized to Lady Zane, expressing his repentance and determination to change for the better. <br/><br/>Daisy browsed the comments. Under the Facebook post, the comments were mostly in support of justice. <br/><br/>However, the comments in the hot search about “Lilian Someone” were not friendly. <br/><br/>It was no secret which drama crew Daisy Zane was in and who was involved: <br/><br/>Although “Lilian Someone” didn’t explicitly mention Lilian Lopez, it pointed directly at her. <br/><br/>She had high traffic and popularity, and the more famous one is, the more controversies they face. She couldn’t escape involvement, whether she was involved or not. <br/><br/>The top five hot searches included two related topics, and Daisy casually clicked on one. <br/><br/>The discussions were heated. <br/><br/>[There are so many people with the surname Lilian in the world. How come you know it’s our Lilian? Did the martial arts instructor tell you?] <br/><br/>[If it’s Lilian Lopez, and the incident has grown this big, she would have been taken away by now. How could she still be in the hotel?] <br/><br/>[Daisy Zane’s a newcomer. What would Lilian, with her current status, gain from going after a newcomer? Do you think everyone is as idle as you?] <br/><br/>[What’s wrong with being a newcomer? Daisy Zane is so beautiful, she doesn’t have to do anything, just standing there is a threat. You ask what’d she do to a newcomer, she’s just jealous.] <br/><br/>[Besides, are the words of that martial arts instructor necessarily true? What if he is being instructed by someone to say so intentionally?] <br/><br/>[Perhaps the 2.5 million in the bank card was given by the Tangs, who asked to slander others.] <br/><br/>“Where do you guys stay?” <br/><br/>“There’s a guest house at the other end of town that we’ve booked.” Arthur North said, “Would you like to go check it out? There’s a small lake nearby, and the view is nice.” <br/><br/>“Sure.” <br/><br/>“Alright, we’ll head there after breakfast.” <br/><br/>But after breakfast, they could not leave immediately. <br/><br/>The doorbell suddenly rang urgently. <br/><br/>The three exchanged glances, and Daisy Zane said, “Go to the bedchamber.” <br/><br/>Arthur North didn’t think it was very convenient, but after looking around, there was really nowhere else to go, so he nodded and went to the bedchamber. <br/><br/>Daisy Zane opened the door, and Serena Buster, looking anxious, was standing outside, getting startled by the sound of the door opening. <br/><br/>“Something’s up?” Daisy Zane asked. <br/><br/>“Yes.” Serena Buster’s eyes were slightly green, and she seemed overly tense, <br/><br/>“Can I come in and talk? It’s something very important.” <br/><br/>Daisy Zane hesitated for a moment, then stepped aside to let her in. <br/><br/>Once inside, Serena Buster immediately sat on the sofa. She seemed to be so nervous that she needed to take a break right away. <br/><br/>Daisy Zane poured her a glass of water and sat down opposite her. <br/><br/>Since yesterday, she had been holding on to something to tell her, but she hesitated and seemed scared. <br/><br/>“I...” Serena Buster took a sip of water, then gently inhaled, “Yesterday... I went to the film set. <br/><br/>Daisy Zane didn’t say anything and just looked at her, waiting for her to continue. <br/><br/>Feeling the pressure of Daisy Zane’s gaze, Serena Buster was hesitant to look up. After a few seconds of silence, she said, “You... When you were practicing with the martial arts instructor, I snuck and hid behind the props to watch you.” <br/><br/>Daisy Zane’s eyes suddenly narrowed. <br/><br/>“1...1 didn’t mean any harm. 1...1 just wanted to see.” Serena Buster’s voice grew fainter and weaker, “I saw him touch you, but... 1...1 was too scared, so I didn’t go out. But I turned on the recording.” <br/><br/>Inside the bedchamber, Arthur North and Xavier Dominic were standing by the door. Out of respect, neither of them looked inside. The door was not fully closed. <br/><br/>So naturally, the conversation in the living room reached their ears as well. <br/><br/>At first, everything was okay, but after the words “he touched you” reached the bedroom. Xavier Dominic could clearly feel Arthur North getting angry. <br/><br/>That kind of diffused, deadly silent murderous aura was too intimidating. Xavier Dominic couldn’t take it any longer and shifted to the side. <br/><br/>Soon, Arthur North took out his cell phone and sent a message to Michael Jackson: [Find out if the martial arts instructor had any previous issues, make sure he stays in jail. And I want his two arms.] <br/><br/>Michael Jackson: [Yes, Third Master, I’ll do it right away..]\t\t\t\t\t\t</div>", "images": {}, "success": true}