{"id": 49, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14078508.html", "title": "Chapter 49 - 49: Red Cliff Village (Part 2)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 49 - 49: Red Cliff Village (Part 2)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 49: Chapter 49: Red Cliff Village (Part 2) <br/><br/>Translator: 549690339 <br/><br/>Kevin Clark brought a lot of people this time, obviously planning to use the terrain to catch them all in the open and confront them face to face. <br/><br/>It was early in the morning, around three when Kevin Clark’s people started their move. <br/><br/>The intense confrontation broke out, and the helicopter circled in the sky as Daisy Zane immediately took the opportunity to avoid the chaos and head to the southern factory building. <br/><br/>There were still people guarding the factory, but Daisy Zane easily knocked them out and went straight in. She wanted to leave before Kevin Clark arrived. <br/><br/>Otherwise, it would be quite troublesome. <br/><br/>The equipment inside the factory looked brand new, showing no signs of operation. <br/><br/>She glanced around briefly, stopping at an elevator, but the elevator required a password. <br/><br/>No wonder the Sky Rights Bar’s chaos didn’t affect this hidden place with the brick factory as a cover. <br/><br/>Daisy Zane went outside and grabbed someone: “Password.” <br/><br/>“I, I don’t know.” <br/><br/>“Don’t know?” Daisy Zane squatted down and looked into his eyes, chuckling softly as a spring knife instantly appeared in her hand, pressing against the artery on his neck, “You really don’t know?” <br/><br/>“I, I...” The man crawled to the password input and nervously entered an eighteen-digit password, and the elevator opened. <br/><br/>But Daisy Zane didn’t plan to let him go, dragging him into the elevator with her. <br/><br/>The elevator only went down to Lower Level One. Upon arrival, Daisy Zane found a rope to bind the man she had brought in and threw him to one side. <br/><br/>Inside was a small warehouse. <br/><br/>The area wasn’t very large, and there were many boxes piled up, some empty and others with sealing tapes on them, marked with dates. Unearth this data, retracing it to the very heart of Nøv€lß¡n★<br/><br/>Daisy Zane opened a box and took out two bottles of elixir from inside. The labels on the sealing bottles read: 319(i) <br/><br/>She didn’t look much further, took two bottles and put them in her clothes pocket, zipping it up. Then she rummaged through the other boxes and found one packed with paper reports. <br/><br/>Daisy Zane quickly went through them. <br/><br/>All handwritten with several different handwriting styles, clearly records from more than one person. <br/><br/>The papers described different peoples’ reactions to the elixirs, the different symptoms caused by different dosages, and so on providing extensive detail. <br/><br/>The further she read, the more startling the information. <br/><br/>The gun finally rested on her right shoulder, and Kevin whispered, “One slight movement from me, and this bone in your arm will shatter, rendering it useless.” <br/><br/>Just as he finished speaking, his attention was drawn to the hand he was holding. A woman’s hand, slender and fair, incredibly beautiful and familiar. <br/><br/>His eyelashes quivered as he looked at her ring finger. Due to the dislocation of her wrist, she couldn’t muster any strength, and he easily spotted the mole on the inside of her finger. <br/><br/>Kevin instinctively loosened his grip. <br/><br/>Daisy immediately freed herself, turned around, grabbed his gun-holding hand, snatched the weapon away and kicked him as she did so. Her kick landed on his left thigh, making him take a step back. <br/><br/>Daisy then pointed the gun at Kevin. <br/><br/>“Third Master!” Michael Jackson and Thomas Firway instantly drew their guns. <br/><br/>Kevin glanced at Daisy, his eyes narrowed and his smile dangerous, “Let her go.” <br/><br/>Daisy slowly backed into the elevator, pressing the button and closing the doors. Kevin made no further moves. <br/><br/>After coming to their senses, Michael and Thomas said, “Third Master, we can notify people to surround her.” <br/><br/>“Let her go.” <br/><br/>Michael and Thomas exchanged puzzled glances but said nothing more. <br/><br/>Kevin glanced at the footprint on his pants and gritted his teeth. She really knew how to kick, just a little off... <br/><br/>At 5 0’clock, everyone was arrested, everything was taken away, and the entire brick factory was closed. <br/><br/>“Third Master, two new drugs are missing,” reported Michael. “It seems that person took them. Should we investigate?” <br/><br/>“No need.” Kevin got into the car, “You guys clean up; I’ll go back first.” <br/><br/>“Yes.” <br/><br/>As Kevin drove away, Michael looked at the dejected Thomas, “You look so wilted, like a wilted cabbage.” <br/><br/>Thomas became even more disheartened. Normally, a man with a murderous aura, he now seemed childlike, “Brother Michael, in a few months, I’ve been beaten twice. How can I live up to the title of Dark Radiance’s Top Fighter?” <br/><br/>Michael raised his hand and squeezed Thomas’ nape, “The title is still yours. After all, if you can’t beat them, neither can anyone else. It’s just that the person is too strong.” <br/><br/>“I could feel that they held back and didn’t use their full strength,” Thomas said. <br/><br/>Michael rubbed his hair again, not saying anything, but his expression clearly conveyed, “So you felt it too.” <br/><br/>After a while, Michael asked, “Which of the two was stronger?” <br/><br/>Thomas responded, “The first one. They were like a demon, clad in black and exuding an aura from Hell. They were so fierce that it was almost as if they had ‘Death to whoever I see’ written all over them. Today’s opponent was just better at fighting.” <br/><br/>Michael patted his shoulder, gazing at the distant mountains. It seemed they were not dealing with the same person....\t\t\t\t\t\t</div>", "images": {}, "success": true}