{"id": 48, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14078507.html", "title": "Chapter 48 - 48: Red Cliff Village (Part 1)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 48 - 48: Red Cliff Village (Part 1)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 48: Chapter 48: Red Cliff Village (Part 1) <br/><br/>Translator: 549690339 <br/><br/>The Davis Residence was different from the Miles Family. The latter had only risen in recent years and joined the ranks of the wealthy. <br/><br/>The Davis family, on the other hand, had existed in Truro City for generations, with deep roots and a stable foundation, they were truly wealthy, and had been for several generations. <br/><br/>In Truro City, the Miles Family aspired to curry favor with two families; the Andersons and the Davises. <br/><br/>At that time, Amelia Miles had two choices too, John Anderson and Liam Davis. <br/><br/>And back then, she was more inclined towards Liam Davis. John Anderson was too strictly controlled by his father, his actions were quite conventional. In comparison, Liam Davis was richer, bolder in his actions, and very generous to those around him, he knew how to pamper people. <br/><br/>But after subtly expressing her feelings a few times and seeing Liam Davis showing no reaction, she gave up. <br/><br/>Liam Davis’s standards were far too high, and he also had a mother who was extremely critical. <br/><br/>The future Mrs. Davis would certainly need to have an exceptional family background, talent, looks, and abilities. <br/><br/>She never would’ve thought, never at all, that he would be attracted to Daisy Zane, what’s so good about Daisy Zane? <br/><br/>“You, are you sure?” Charles Hobson asked after a while, “Which, which Liam Davis?” <br/><br/>“Of course, it’s Liam Davis from the Davis family.” said Johanes Miles, looking exhausted, “He came to our company today with a project we’ve always wanted, the only condition for cooperation is that he wants Daisy Zane to be his girlfriend.” <br/><br/>“How did he, how did he meet Daisy Zane?” <br/><br/>“He saw her online.” Johanes Miles said, “After seeing her online, he conducted some research and found our family.” <br/><br/>“Then why didn’t he go directly to Daisy Zane, why did he come to us?” Charles asked in a somewhat anxious tone. <br/><br/>Johanes glanced at him and said, “He said that since he wants to chase her, he must show his sincerity.” <br/><br/>“What sincerity?” After this question was asked, both Charles Hobson and Amelia Miles held their breath. <br/><br/>“The Miles family acknowledges their daughter and treats her equally.” Johanes Miles closed his eyes, “He wants to give this as a gift to Daisy Zane.” <br/><br/>Amelia’s face turned slightly pale, as Charles’s hand by her side began to tremble. <br/><br/>She had witnessed firsthand how Johanes Miles treated his wife and daughter for his own benefit. <br/><br/>As long as it was profitable enough for him, he and his always scheming father could do anything. <br/><br/>She didn’t at all behave like someone with big backing. She didn’t even have an assistant. <br/><br/>So the director immediately gave her the day off, letting her go rest. Only George Dunn was left behind to finish his part. <br/><br/>Arriving at the hotel, Daisy Zane didn’t go in but waited until the driver left. She had James Collins come and pick her up. <br/><br/>As the car started, James rolled his eyes at her, “Sis, aren’t you going to change clothes?” <br/><br/>In the last scene Daisy filmed, she was dressed as a boy, wearing a page boy’s outfit. Her hair had been tightly coiled up by the stylist and topped with a beret. <br/><br/>She left her hat in the nanny car, so her tightly coiled hair was clearly visible. With her hair no longer obscuring her face, her delicacy seemed amplified, making her all the more ravishing. <br/><br/>She shrugged off the vest over her shirt, “Give me your coat later.” <br/><br/>“Okay.” <br/><br/>The car drove deep into the mountain and stopped by a dense forest. <br/><br/>The two got out of the car, James Collins gave his coat to Daisy Zane first, then picked up a suitcase, and the two walked on foot into the deep mountains. <br/><br/>The further they walked, the thicker the trees, the denser the foliage. Completely blocking out the sky, even a drone couldn’t see anything beyond the leaves. <br/><br/>Both of them walked at a brisk pace, and after almost half an hour, they arrived outside a brick factory. <br/><br/>The brick factory was quite large and was still operating. It was surrounded by mountains on three sides, and on their side was a dense forested hill. A tunnel had been dug under one of the mountains for vehicles and pedestrians to get in and out. <br/><br/>“Sis,” James Collins handed a pair of binoculars to Daisy Zane. “The big factory building to the south and the one to the east are suspect.” <br/><br/>Daisy Zane looked through the binoculars. There were trucks going in and out of the southern factory building. <br/><br/>The trucks were large, and although the back was covered with black cloth, only two or three boxes were unloaded from each truck. <br/><br/>“This must be the new batch of elixir.” James said, “Both of the factory buildings are spotless, with no signs of operation. And they’re guarded tightly, I suspect there’s a basement. Their person in charge goes in sometimes and doesn’t come out for a day.” <br/><br/>CCTV cameras were everywhere in the brick factory, leaving no blind spots. If they went in, they would be discovered immediately. <br/><br/>James Collins had previously snuck into the factory once, after observing it for a while he kept watch on the periphery. <br/><br/>Daisy Zane scoped things out for a while, then passed the binoculars to James <br/><br/>Collins. While putting on a mask, she said, “I’ll go down first. I’ll go in when <br/><br/>Harton Clark starts making his move.” <br/><br/>“Sis, be careful.” James Collins said. “I’ll set up my gun here..”\t\t\t\t\t\t</div>", "images": {}, "success": true}