{"id": 42, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14078501.html", "title": "Chapter 42 - 42: Ridiculed By The Crowd", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 42 - 42: Ridiculed By The Crowd</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 42: Chapter 42: Ridiculed by the Crowd <br/><br/>Translator: 549690339 <br/><br/>As she left the room, Serena Buster could no longer hold back her tears. Humiliation, helplessness, anger, and the sorrow of an unbearable reality all surged to her heart at once. <br/><br/>This was not the first time Lilian Lopez had bullied her, starting from the script reading. Knowing that she played a small role, Lilian kept ordering her around, insulting her and mocking her. <br/><br/>Originally, she didn’t have many scenes, so she didn’t need to be there every day for the month of script reading and makeup setting. But Lilian Lopez insisted that she come every day, treating her like an assistant. Otherwise, she wouldn’t let her play the role at all. <br/><br/>Even more so on the film set in recent days, she had no chance to work outside even when she wasn’t in any scenes. <br/><br/>Once Serena started crying, it was like breaking the dam – she couldn’t stop, the sadness came from the heart. <br/><br/>Walking slowly, Daisy Zane had just heard the sound of a slamming door when she encountered Serena a second later. <br/><br/>Serena was the kind of beauty that looked sweet, especially when she cried. It was pitiful and heart-wrenching. <br/><br/>The two stood about two meters apart, Daisy Zane expressionless, her phoenix eyes cold and unwelcoming. <br/><br/>But she didn’t move, and neither did Serena. <br/><br/>Seeing someone crying so pitifully in front of her, Daisy Zane thought for a moment, then sidestepped, intending to leave first. <br/><br/>But just as she passed, Serena suddenly called out to her, “Daisy Zane.” <br/><br/>It was the second time this person had stopped her, so Daisy Zane stopped walking, turned around to look at her, and didn’t speak. <br/><br/>Serena Buster also turned around, not speaking, just letting the tears fall. <br/><br/>Daisy Zane didn’t quite understand her behavior and watched her for a few seconds before taking a piece of sugar out of her pocket and handing it to her. <br/><br/>Then Serena’s crying grew even louder. <br/><br/>Daisy Zane’s eyebrows twitched. <br/><br/>Serena took the sugar from her hand, unwrapped it, put it in her mouth, turned around, and walked away, still crying. <br/><br/>Watching her retreating figure, Daisy Zane held back and held back again, but finally couldn’t help her mouth twitching. <br/><br/>What kind of behavior was this? <br/><br/>Back in her room, Daisy Zane called James Collins. <br/><br/>James had arrived in the town yesterday, and the trouble at the Sky Rights Bar had caused quite a stir but had not affected Red Cliff Village. <br/><br/>The batch of drugs was still scheduled to arrive in three days. <br/><br/>Arthur North’s arrival at this time was probably related to this matter. <br/><br/>James only knew their exact trading location but had no idea what was inside or what they were doing. <br/><br/>“Mommy is here, mommy is here, don’t be afraid, don’t be afraid,” Hill Dawson cooed to the child while saying, “At this time, the trending topic is still rising, someone must be manipulating it. The video is really bad for us, but I’ll figure out a solution for now.” <br/><br/>“You don’t have to worry, go to bed early, I have evidence, so it’ll be fine by tomorrow morning.” <br/><br/>“Huh?” <br/><br/>“Don’t worry.” <br/><br/>After hanging up, Daisy Zane went to wash and change into her pajamas, and after returning to bed, she opened the trending topics on her phone to have a look. <br/><br/>The first post was from a newly registered account. <br/><br/>The caption read: The circle is too deep, they don’t treat people like people at all. The action scenes are too real, and the martial arts actor couldn’t get up for a long time after being hit. <br/><br/>There was also a video below, all of her hitting the man. The part where the martial arts instructor tried to scratch her face had been cut out. And the place where she unloaded the martial arts instructor’s wrist, if the video were slowed down by ten times, it should be visible. <br/><br/>The comments were also mostly one-sided, all insulting her. All kinds of ugly words, personal attacks, and even cursing her ancestors for eighteen generations. <br/><br/>Daisy Zane watched for a while and decided to contact Arthur North tomorrow morning to get a statement from the martial arts instructor. <br/><br/>Just as she was about to fall asleep, her phone rang several times in quick succession. <br/><br/>She opened it to see a group chat with only a period as its name. <br/><br/>Robinson Scott first forwarded a Facebook post to the group, then tagged all group members. <br/><br/>Roy Ryder: [Come and see our Brother Nine in action, look at those long legs, look at the ferocity when she kicks someone, doesn’t it make you miss her?] <br/><br/>Luke: [She’s only using a tenth of her strength. If she were at full power, this strongman might be in serious danger.] <br/><br/>Logan: [I went to look at the comments, they’re all scolding Brother Nine, hahahahahahaha.] <br/><br/>Henry Brown: [I’m gonna watch too, I’ve never seen anyone scold Brother Nine before, I can’t miss this rare opportunity.] <br/><br/>Alvin Phantom: [Don’t worry, there’ll be plenty more on the internet in the future, you won’t miss out.] <br/><br/>Logan: [Someone even cursed Brother Nine as an ugly monster, I’m dying laughing, hahahahahahahaha.] <br/><br/>Samuel Gray: [Damn! You guys have no heart, Brother Nine is being scolded, and you’re laughing so loudly, you’re not afraid of being found dead on the street tomorrow.] <br/><br/>Roy Ryder: [Don’t worry, she doesn’t have any night scenes tonight, and she’ll definitely be asleep at this time. In a while we’ll disband this group, create a new one, and she won’t know about it.] <br/><br/>Just as those words were said, Daisy Zane sent a deathly smiling face. <br/><br/>The group suddenly fell silent. <br/><br/>Then Daisy Zane changed the group name to three smiling faces. <br/><br/>After that, Daisy Zane’s bank card received a series of transfers and six apology <br/><br/>messages....\t\t\t\t\t\t</div>", "images": {}, "success": true}