{"id": 45, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14078504.html", "title": "Chapter 45 - 45: Reading A Book To Lull You To Sleep", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 45 - 45: Reading A Book To Lull You To Sleep</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 45: Chapter 45: Reading a Book to Lull You to Sleep <br/><br/>Translator: 549690339 <br/><br/>At the guest house, Kevin Clark, Allonzo Hobson, Michael Jackson, and Thomas Firway were staying. <br/><br/>When they walked from the lake to the guest house, they ran into Michael Jackson and Thomas Firway. <br/><br/>Michael Jackson greeted Daisy Zane politely, but Thomas Firway glared at <br/><br/>Daisy Zane after calling out “Third Master” and “Young Master Hobson”. <br/><br/>Daisy Zane didn’t care, even lifting her eyebrows slightly. <br/><br/>It’s just that, Thomas Firway received a knife-like gaze from Kevin Clark, which frightened him and made him shrink his neck, and he hurriedly find an excuse to leave. Unearth this data, retracing it to the very heart of Nøv€lß¡n★<br/><br/>In the morning, Kevin Clark accompanied Daisy Zane as they strolled around, and even rowed a boat on the lake for a while. <br/><br/>After lunch, Daisy Zane sat down on a recliner in the sunroom, looking at lotuses in the lake through the glass. <br/><br/>It was early afternoon, sunlight pouring in, very comfortable. <br/><br/>In a short while, Kevin Clark came over with a few lotus seeds and sat on the recliner next to Daisy Zane. <br/><br/>A small round table separated the two of them. Kevin Clark placed the lotus seeds on the round table and began to peel one. <br/><br/>Daisy Zane tilted her head to watch him, her spirits always high, showing no signs of fatigue, but the red at the corners of her eyes seemed to deepen. “You can go ahead and do your business, no need to accompany me.” <br/><br/>“I have nothing to do; I am quite free today.” Kevin Clark looked up and smiled at her, then lowered his head to continue peeling the lotus seed. <br/><br/>As the green lotus seed was peeled open, the green-coated lotus seeds were taken out one by one. <br/><br/>Kevin Clark’s hands were too beautiful – slender, fair-skinned, and forceful. <br/><br/>Through those hands, one seemed to sense the owner’s devilishly perfect face. <br/><br/>“Take a break, then.” Even with a warm statement, Daisy Zane spoke coolly and dispassionately. <br/><br/>But Kevin Clark was used to it, or rather, he understood Daisy Zane. He could sense her emotions from her flat, emotionless tone. <br/><br/>It was as if Daisy Zane had wrapped herself layer by layer in a tough, indifferent exterior, but he could see through those layers of icy coldness to her passionate heart. <br/><br/>“It’s okay.” Kevin Clark removed the green skin of the lotus seed, broke it apart to remove the lotus heart, and then placed it on a small plate beside him, “I’m not tired; have a taste.” <br/><br/>Daisy Zane kept staring at his hands for a while before picking up a lotus seed and putting it in her mouth, tasting it. <br/><br/>“How is it?” <br/><br/>“Hmm...” Daisy Zane savored the taste again, “It’s a bit like fresh peanuts just pulled out of the ground.” <br/><br/>“Huh?” Kevin Clark looked up at her, still peeling the lotus seed, “Really?” <br/><br/>“I got these from the guest house owner; I didn’t pay attention and just brought them over,” Michael explained when he saw the dense English words, immediately thinking of “Daisy Zane has never been to school.” Handing her all-English books would be humiliating, right? <br/><br/>With this thought, sweat broke out on Michael’s forehead, and he even felt that he was about to lose his job right away. He didn’t dare to look at Kevin’s gaze on him. <br/><br/>“I’ll take this one,” Daisy handed back the remaining books to Michael and said, <br/><br/>“Thank you.” <br/><br/>Michael took them, and hurriedly said, “You’re welcome. It’s my duty.” <br/><br/>Then he glanced at the book in Daisy’s hand, “Future History.” <br/><br/>The book cover had Chinese characters, but the inside was all in English. <br/><br/>For some reason, Michael just stood there, not moving. <br/><br/>Kevin was also looking at the book in her hand. <br/><br/>Daisy glanced at the catalogue, then directly went to the text and looked at it for a while before saying, “The owner’s book is a pirated version. There’s a misprint in the English.” <br/><br/>Michael’s eyes widened because, following where Daisy was pointing, the word was indeed wrong. <br/><br/>Kevin raised an eyebrow and smiled. He then looked towards Michael. <br/><br/>Feeling the gaze, Michael quickly left the room, no longer surprised. <br/><br/>Daisy looked down for a while, turning two pages before looking up at Kevin, who had been watching her the whole time, “My English is pretty good. Want to hear it?” <br/><br/>Kevin showed no sign of embarrassment and graciously smiled, “I’d be honored.” <br/><br/>Daisy threw the blanket next to her to him: “Lie down.” <br/><br/>After that, she threw another blanket over herself and lay back on the recliner. she flipped the book back to the first page of the text. <br/><br/>Kevin immediately understood that she wanted him to rest for a while. He spread the blanket over himself and lay down. <br/><br/>Seeing that he was settled, Daisy began to read the book aloud: “At the dawn of the third millennium, humanity wakes up, stretching its limbs, and rubbing its eyes. Remnants of some awful nightmare are still drifting across it mind . <br/><br/>A moment of surprise passed in Kevin’s eyes. He looked at her for a moment, then closed his eyes. <br/><br/>Daisy’s pronunciation was standard, like a slight London accent, yet unique in its own right. Her voice was pleasing, like a breeze and falling snow. It was cool and refreshing, brushing past the heart and calming the mind. <br/><br/>In no time, Kevin fell asleep. <br/><br/>Daisy continued reading for over twenty minutes after realizing he was asleep, then placed the book on her chest and turned her head to look at Kevin. <br/><br/>Underneath the sunlight, Kevin’s skin seemed to glow, his lips a deep red, his eyelashes thick and his face appeared like a richly painted ancient painting. <br/><br/>Daisy watched him for a while, then smiled and closed her eyes as well. <br/><br/>That afternoon, with the warm sunshine, a bright blue sky, and a tranquil lake, the serenity of knowing each other was close by enveloped them both....\t\t\t\t\t\t</div>", "images": {}, "success": true}