{"id": 41, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14078500.html", "title": "Chapter 41 - 41: No Room For Development", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 41 - 41: No Room For Development</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 41: Chapter 41: No Room for Development <br/><br/>Translator: 549690339 <br/><br/>When Allonzo Hobson spoke those words, the director and the screenwriter were dumbstruck. The meal was going so smoothly; how did things take such a sudden turn? <br/><br/>The atmosphere felt like it had instantly frozen. <br/><br/>The director had to admit that his mind had never worked as swiftly as it did now. <br/><br/>He suddenly turned to Daisy Zane. <br/><br/>A female lead and a supporting female, both equally crucial characters. The director was aware of the tense relations between them and had also heard of Lilian Lopez ostracizing Daisy Zane with everyone else. <br/><br/>But Daisy Zane gave her all while filming every day and kept to herself, completely ignoring those who slighted her. He too, having been busy, overlooked all the backstage drama. <br/><br/>Daisy Zane obviously knew Allonzo Hobson and the young aristocrat next to him. <br/><br/>Pretending not to know them on the set was probably to avoid any gossip, which was why Allonzo Hobson didn’t expose it either. <br/><br/>Looking at it now, this meal seemed to be a ploy to take revenge for Daisy Zane. <br/><br/>“What are you looking at us for?” Kevin Clark noticed the director’s gaze on Daisy Zane and looked back at him. <br/><br/>His soft voice and piercing eyes literally shook the director, who hastily averted his gaze. <br/><br/>Kevin Clark placed the picked fish meat on Daisy Zane’s side, refilled her wine, and said, “Leave us out of your mess.” <br/><br/>In one sentence, he spared Daisy Zane from any blame. <br/><br/>“Indeed, it’s my personal grudge.” Allonzo Hobson continued to smile, “Can you accommodate me, Director Nash?” <br/><br/>“Uh...” the director glanced at the screenwriter, “Young Master Hobson, you know that...it is difficult for me... <br/><br/>“Give me an answer tomorrow morning, Director Nash,” Allonzo Hobson stated, “So I can decide whether or not the drama crew should start filming.” <br/><br/>There was no room for negotiation, the director and the screenwriter turned pale. <br/><br/>They even wondered if they were jinxed. How was it that filming a drama could be so challenging? <br/><br/>Earlier, they had happily secured a best actor, a female lead with a great online presence, and a supporting female matching the character, they believed their show would surely be a hit. <br/><br/>However, they first offended the Giovanni Family, who had just been pacified when Allonzo Hobson was troubled. <br/><br/>Each one was more unmanageable than the last. <br/><br/>Ignoring everything else, where could they find a new female lead in one night? <br/><br/>After all, in this age of rampant digital information, people who were quick to gossips and rumors were numerous. Any random bit of gossip would be passed around instantly. <br/><br/>Thus, many of the leaked news-pieces, true or false, were hard to discern. <br/><br/>Daisy Zane didn’t pay much mind, heading towards her room. Turning a corner, the voice grew clearer, hard to ignore. <br/><br/>Moreover, it was Lilian Lopez’s voice. <br/><br/>She slowed her steps, listening as she walked. <br/><br/>The door to Lilian Lopez’s room was not completely closed. <br/><br/>She sat on the sofa, her face somewhat flushed. Looking at the person standing in front of her, she said, “Serena Buster, you are merely my stand-in. If not for me, would you have had today, would you have been noticed? Would you have been able to enter this drama crew?” <br/><br/>“I requested you kneel and remove my shoes. So what? Did that offend you? <br/><br/>That was a sign of my respect.” <br/><br/>“Lilian Lopez! You’re too much!” Serena Buster said, her face full of humiliation. <br/><br/>“I’m too much? When you see me, you don’t even bother to greet me properly. You don’t respect me at all. What’s this? After getting a minor role you think you’re the king of the world and already stepping on me.” Lilian Lopez had a rough day, had a bit to drink and meeting Serena Buster, she just let her anger spill out on her. <br/><br/>“Lilian Lopez, aren’t you afraid of retribution?” <br/><br/>“Retribution?” Lilian Lopez scoffed, “Let me tell you, my position and career are only going to get better, while you, as long as you’re in this industry, will always be beneath me.” <br/><br/>“Let’s put it this way, even if my words today are recorded by you, or by someone else and uploaded online.” Lilian Lopez arrogantly stated, “Even without the company’s intervention, my fans would suppress the heat and help clear my name.” <br/><br/>“Sister Molly, you’ve had too much to drink, don’t say anymore,” the assistant persuaded from the side. <br/><br/>Lilian Lopez glared at her, “Get lost! What right does an assistant like you have to manage me?” <br/><br/>“So you’re just using your fans like this?” Serena Buster said, “Anyway, without your fans contributing to your popularity, you wouldn’t be getting such good roles.” <br/><br/>“Who’s to blame tor them being tools? A little guidance, and they can be used easily.” <br/><br/>Ignoring Lilian Lopez, Serena Buster turned around to leave. Lilian Lopez threw a glass from the table at her feet. <br/><br/>The shattered glass cut Serena Buster’s ankle, and blood started to well up immediately. <br/><br/>“Who told you to leave! Come here, kneel down and take off my shoes. I’ll let your lack of greeting today slide.” Lilian Lopez in a tone that suggested she was doing Serena Buster a favor, “If you dare to leave, don’t even think about working here again.” <br/><br/>Without turning her head, Serena Buster left the room and slammed the door. <br/><br/>Upon hearing the slamming of the door, Lilian Lopez swept all the glasses on the table to the ground. The sound of glass breaking was heard all around, scaring the assistant into backing a few steps. <br/><br/>“Damn it! A mere stand-in dares to slam the door in my face. What’s happening to the world!” Lilian Lopez cursed a lot, then picked up her cell phone from the sofa. She opened her newly registered Facebook account, composed a post, added a video and posted it.\t\t\t\t\t\t</div>", "images": {}, "success": true}