{"id": 47, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14078506.html", "title": "Chapter 47 - 47: How Lovely", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 47 - 47: How Lovely</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 47: Chapter 47: How Lovely <br/><br/>Translator: 549690339 <br/><br/>The room was as bright as daylight, but Lilian Lopez felt darkness surrounding her. <br/><br/>Her brain had stopped thinking. <br/><br/>Though Daisy Zane’s hand around her neck didn’t strangle her, she still felt it hard to breathe. Her breath was hot, but her body was cold and rigid and her hair stood on end. <br/><br/>Why was this person so terrifying? <br/><br/>The assistant fell to the floor, holding her head and shaking uncontrollably. <br/><br/>Daisy Zane lowered her gaze at Lilian’s face; her eyes seemed to freeze. She held a hairpin, pressing it against Lilian’s skin without breaking it, but making it hurt. <br/><br/>Lilian’s legs instantly went weak, and her body trembled involuntarily. <br/><br/>“Lilian Lopez, you really know how to cross my line,” Daisy Zane chuckled lightly, then let go of her hand. <br/><br/>Lilian fell to the ground, gasping for air, one hand covering her neck, and the other on her face. <br/><br/>Her tears blurred her vision, and she sobbed gently as she dared not look up at Daisy Zane. <br/><br/>Standing there for a while, Daisy Zane put the hairpin in her pocket and turned to leave the room. <br/><br/>After returning to her room, Daisy Zane took a cold shower to clear her head. <br/><br/>Sitting on the bed, she saw the phone call from Holt Lawrence twenty minutes ago. <br/><br/>As she dried her hair, she called him back. <br/><br/>“The audio has been released?” Daisy Zane asked. <br/><br/>“Yes, it’s out. I found some evidence of old scandals she’s clarified before, so I sent those too,” Holt Lawrence replied, “It’s pretty lively online now. I suddenly discovered how enjoyable gossip can be.” <br/><br/>“Is there anything else?” Daisy Zane asked directly. <br/><br/>“There’s actually a more ruthless one.” Holt Lawrence spoke before noting the change in Daisy’s tone, “Nana, what’s wrong?” <br/><br/>“Nothing.” Daisy Zane threw the towel aside, “You can continue.” <br/><br/>A few years ago, there was a well-known director with the surname Park. <br/><br/>Lilian Lopez was his mistress. The car accident that killed his wife was arranged by her. The drunk driver at fault is still in jail.” Holt Lawrence <br/><br/>explained, “Lilian even married the director. But when his career started to <br/><br/>decline, she divorced him.” <br/><br/>“Just expose it online,” Daisy Zane’s eyes were fierce, “Someone will naturally investigate. You should prepare the evidence.” <br/><br/>Holt Lawrence’s first reaction upon hearing this was that Lilian must have upset Daisy Zane, “Alright, I’ll take care of it immediately.” <br/><br/>After hanging up, Daisy Zane rubbed her brow. <br/><br/>Even if Lilian had found a group of people to cripple her today, she wouldn’t be as furious as she is now. But the moment her hand touched Lilian’s neck, she almost lost control. <br/><br/>“Damn!” Allonzo Hobson rubbed his hair in disbelief, “What are you laughing at? Why are you still able to laugh? Aren’t you scared?” <br/><br/>“How adorable.” <br/><br/>Allonzo Hobson felt his scalp tingle: “You call this adorable????” <br/><br/>“Isn’t it?” Kevin Clark looked at him. <br/><br/>Allonzo Hobson immediately felt an invisible pressure, and begrudgingly said: “Adorable, adorable, very adorable.” <br/><br/>Truro City, Miles Family’s house. <br/><br/>Olivia Chester sat in the Miles’ living room, looking exhausted. <br/><br/>Charles Hobson and Amelia Miles were both accompanying her. <br/><br/>Soon, she answered another phone call: “Lilian Lopez, stop calling me. The path you chose has nothing to do with me.” <br/><br/>“How can it have nothing to do with you!” Lilian screamed like a madwoman, “You were the one who told me to deal with Daisy Zane, and you can’t just kick me away after T get into trouble!” <br/><br/>“What you did years ago had nothing to do with me,” Olivia Chester said, “You think Daisy Zane is someone capable of finding erased news and having someone take down your works. You should think about who you’ve offended.” Hearing Daisy Zane’s name, Charles Hobson and Amelia Miles looked over. <br/><br/>“It’s her! It must be her! It’s Daisy Zane! It must be Daisy Zane!” Lilian Lopez screamed hysterically. <br/><br/>Olivia Chester hung up the phone and turned it off: “It’s Lilian Lopez. She might be mentally unstable. She insists that Daisy Zane is the one who hurt her.” <br/><br/>“I’ve read the news online as well,” Charles Hobson sneered, “It’s obvious that the person behind all this is a big shot. That dead girl came out of Cold Green Village, and even if she struck gold falling from the sky, she wouldn’t have such capability.” <br/><br/>“She’s been flaunting herself all day and doesn’t know who she’s offended, and now she wants me to clean up her mess,” Olivia Chester rubbed her temples, “This year has been really unfortunate for me, one bad thing after another.” <br/><br/>“As long as no one is hurt, everything else is external.” Charles Hobson said. <br/><br/>“That’s true. With Lilian Lopez’s situation, I got out just in time, losing only her, and nothing else.” Olivia Chester said, “Ever since Johanes Miles and his father stopped mentioning Daisy Zane, your complexion has improved.” <br/><br/>“As long as that little bitch doesn’t come between our family and Amelia, my mood will be much better.” <br/><br/>Amelia smiled sweetly at them. <br/><br/>“Don’t worry, if she dares to come to Truro City, I will not let her live comfortably.” Olivia Chester patted Charles Hobson’s hand with a smile. <br/><br/>Olivia Chester stayed at the Miles’ house for the whole afternoon, leaving only when Johanes Miles returned home. <br/><br/>“You’re back?” Charles Hobson went to the entrance to take Johanes Miles’ coat. <br/><br/>“Mhm.” Johanes Miles looked at him, “You’re in a good mood.” <br/><br/>“Not too bad.” <br/><br/>“Dad, you’re back?” Amelia also came up to greet him. <br/><br/>Johanes Miles sat down on the sofa, looked at his wife and daughter, then rubbed his brow and said with some fatigue: “Amelia, do you know how the filming of that Daisy Zane show is going?” <br/><br/>Upon hearing this name from his mouth, the smiles on Charles Hobson and Amelia Miles’ faces froze for a moment. <br/><br/>“What’s the matter, Dad?” Amelia’s smile returned hastily, so much so that the usual “Sister” seemed hard to say, “Why suddenly... ‘ <br/><br/>“Liam Davis has his eye on her..”\t\t\t\t\t\t</div>", "images": {}, "success": true}