{"id": 50, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14078509.html", "title": "Chapter 50 - 50: Listen, Give Me Your Hand", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 50 - 50: Listen, Give Me Your Hand</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 50: Chapter 50: Listen, give me your hand <br/><br/>Translator: 549690339 <br/><br/>When the doorbell of the room rang, Daisy Zane got up from the bed and glanced at her cell phone; it was not even 6:30 yet. <br/><br/>She put on a coat and went to open the door. <br/><br/>As soon as the door opened, she saw Kevin Clark standing outside, with a bag in his hand. He was still wearing the same clothes he wore at the brick factory. <br/><br/>Daisy felt a rush of cold air as soon as she opened the door. <br/><br/>Seeing her sleepy-eyed, Kevin said gently, “Just woke up?” <br/><br/>Daisy casually brushed her hair with her left hand, stepped aside to let him in, and said, “Not yet awake.” <br/><br/>Kevin came inside and cast a glance at her right hand hanging by her side, her wrist visibly swollen. <br/><br/>He placed the breakfast on the table, then washed his hands and sat down on the sofa. <br/><br/>Daisy watched his series of actions and sat down on the sofa opposite him, “Third Master, is there something wrong?” <br/><br/>“Come here.” <br/><br/>“Huh?” <br/><br/>“Sit here.” <br/><br/>Neither his voice nor his expression seemed dangerous to Daisy. Hesitating for a moment, she sat down next to him. <br/><br/>“What’s wrong?” <br/><br/>“Give me your right hand.” Arthur said as he reached out his hand. <br/><br/>Daisy looked at him without moving; her left hand slowly clenched by her side. <br/><br/>Kevin looked at her too. Seeing that she still wasn’t moving, he lifted the corner of his mouth and said, “Be obedient, give me your hand.” <br/><br/>Perhaps being bewitched by his voice, Daisy hesitated for a few seconds before finally extending her hand. <br/><br/>Arthur held her fingertips as he felt light calluses on them. The calluses formed over the years must have been from more than just handling guns. <br/><br/>With his other hand, he pressed on her wrist, causing Daisy to frown slightly. “The swelling is quite bad.” Arthur frowned, his voice suddenly becoming heavier. <br/><br/>Daisy looked at her own wrist without saying anything. <br/><br/>Without saying much else, Kevin took out two tubes of medicine and a disinfectant cotton swab from his pocket. <br/><br/>He broke the cotton swab in half, gently disinfected her wrist, applied a bit of the medicine, and then slowly massaged her hand. His technique was very professional. “Bear with it; it might hurt a little.” <br/><br/>Neither of them spoke any further, and the room was quiet. <br/><br/>Kevin’s expression was serious as he carefully massaged her wrist, his gaze lowered. <br/><br/>Meanwhile, Daisy’s eyes fell on his hand, watching it and thinking about things. <br/><br/>She hadn’t finished reading the box of paper reports in the South Factory, and she hadn’t even seen anything in the East Factory. Since she had been exposed, she could try to learn some information from Kevin. <br/><br/>But could she trust him? <br/><br/>They chatted for a bit before hanging up. Then Daisy looked at Serena Buster, who had already taken a seat beside her. <br/><br/>Feeling her gaze, Serena looked up at her and gave her a sweet smile. <br/><br/>Daisy looked at her without much reaction for a while, then said, “You’ve gained some weight.” <br/><br/>“...l!! I did not!” Serena immediately covered her face, her voice becoming weaker, “I just gained two pounds.” “Well, it’s pretty obvious.” <br/><br/>“What are you doing here?” Daisy asked. <br/><br/>Serena looked at her and complained, “Daisy Zane, it’s a good thing you’re not a guy. Otherwise, with your attitude, you’d be single for life.” <br/><br/>Daisy: <br/><br/>“I have a scene to film today, so I was waiting here.” Serena picked up a stone and played with it in her hand. “I am pretty idle. How about I be your assistant?” <br/><br/>“No thanks, I can’t afford it.’ <br/><br/>Serena pouted and whispered, “You’re not really out of money.” <br/><br/>Daisy heard her, although her voice was low. She stared at her and after a <br/><br/>while, got up and said, “Follow me.” “What for?” <br/><br/>Daisy ignored her and walked away. <br/><br/>Dumbfounded, Serena followed her. <br/><br/>The director had just finished filming a scene and was discussing the next one with George Dunn. <br/><br/>Daisy stood aside waiting, not interrupting them. <br/><br/>It took nearly 5 minutes for the director to notice Daisy, “Daisy, you need something?” <br/><br/>Daisy walked over and asked, “Director Nash, has the female lead been decided?” <br/><br/>The director rubbed his messy hair and frowned, “We’ve looked at a few people, but they’re all booked. Still searching.” <br/><br/>Daisy pointed to Serena, who was not far behind her, “Why not give her a shot?” <br/><br/>Both the director and George Dunn glanced over, and Serena stepped back in fright. <br/><br/>“Come here.” Daisy said. <br/><br/>Swallowing hard, Serena quickly walked over and stood next to Daisy, “Best Actor Dunn, Director, hello.” <br/><br/>Director Nash scanned Serena, “Isn’t she one of our drama crew members? I think I’ve seen her before.’ <br/><br/>“Yes, Director,” said Serena, “I play Mia Flores, the girl who got killed for sending a telegram.” <br/><br/>“She’s got too sweet of a face,” the director said, “It doesn’t fit the character of the female lead.’ <br/><br/>Staring as wide as brass bells, Serena could hardly believe what she was hearing. Female lead? What female lead? And what was Daisy going to do? Daisy said, “If there’s time, you can let her try a scene.” <br/><br/>Actually, the director had already dismissed her in his heart, but Daisy’s words were so convincing that he began to waver. <br/><br/>“Why not let her try, just one scene. It won’t be much of a delay anyway.” George Dunn suddenly suggested. <br/><br/>“Alright then.” The director flipped through the script lying nearby and handed it to Serena, “Practice this scene, learn the lines..”\t\t\t\t\t\t</div>", "images": {}, "success": true}