{"id": 59, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223321.html", "title": "Chapter 59 - 59: Living Expenses", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 59 - 59: Living Expenses</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 59: Chapter 59: Living Expenses <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane had been by Kevin Clark’s side all day, even having lunch with him. <br/><br/>It wasn’t until two o’clock in the afternoon when she was in the living room, staring at the blank computer screen, trying to come up with a design, that she heard the sound of a door opening. <br/><br/>It was her room door opening, very faint, but she heard it. <br/><br/>James Collins had arrived. <br/><br/>Kevin Clark also heard the sound; he looked up from the heap of code in front of him and glanced at Daisy Zane. <br/><br/>Daisy gave no indication of wanting to go out and check; she merely closed her laptop, placed the peeled grapes from the tea table on top of it, and began eating them one by one. <br/><br/>Only when she was halfway through eating did she remember that the person who had peeled the grapes was still sitting next to her. <br/><br/>She grabbed the plate and passed it over. <br/><br/>Kevin Clark looked up, and said softly, “I’m good, you keep eating.” <br/><br/>Daisy withdrew her hand, continuing to eat. It was his choice not to eat after all. <br/><br/>After finishing the grapes, she opened a box of chocolates. After eating two pieces, she opened a bag of potato chips. <br/><br/>Concerned about disturbing the person beside her, she intentionally moved quietly and chewed softly. <br/><br/>“Just eat normally, you’re not disturbing me.” Kevin said. <br/><br/>“Okay.” Daisy responded, but she still ate quietly. <br/><br/>After finishing the chips, she ate a box of mini cookies. <br/><br/>Kevin watched her out of the corner of his eye. Despite her slow eating, she was inexplicably cute, like a tiny squirrel. <br/><br/>Sensing Kevin’s amusement, Daisy turned and looked at him. Updated from novelbIn.(c)om<br/><br/>She trailed her gaze from his eyes to the bridge of his nose, then to his vermilion thin lips. Holding her gaze there for a few seconds, she moved down his jawline to his throat... <br/><br/>To Daisy, this man seemed perfect in every way. <br/><br/>Almost a minute later, Kevin could no longer focus on his code. He stopped typing, looked at Daisy, and said softly, “Lucia.” <br/><br/>There was a hint of strain in his voice. <br/><br/>Daisy’s eyelashes fluttered, and she slowly withdrew her gaze. “What is it?” <br/><br/>Kevin looked at her for a few seconds before laughing, “Nothing. Are you bored? Do you want to go out and play for a bit?” <br/><br/>As he spoke, he deleted the jumbled mess of code he’d just written. <br/><br/>But before she could speak, James, who was watching their exchange, quickly interrupted them. “Sis, do you want to take this too?” <br/><br/>Both turned to look at him, and the topic was dropped for now. <br/><br/>James was sitting on the floor, holding a guitar case in his arms. The case was black, with real leather wrapping the outside. <br/><br/>Such a case usually contained a Pipa. Kevin remembered the callouses on Daisy’s fingertips. <br/><br/>Upon seeing the case, Daisy instinctively massaged her own knuckles. She said in silence for a few seconds before replying, “Whatever.” <br/><br/>Upon hearing her answer, James immediately took the Pipa to the storage room. <br/><br/>In that moment, Kevin felt that the person beside him seemed somewhat down, but upon looking at her, saw that she appeared no different than usual. <br/><br/>She was simply studying the blue diamond in her hand. <br/><br/>The items James had brought over were a mess. Not only were they from <br/><br/>Daisy’s former residence, but some of them were gifts from a few people. <br/><br/>Daisy hadn’t given them her address, so they’d sent everything to James. <br/><br/>Among the various items, she kept some wine and a few books, and had James return the rest. <br/><br/>By 5 0’clock in the afternoon, the room was finally tidied. <br/><br/>James insisted on personally transporting the items, “Sis, I need to leave again. ” <br/><br/>His tone was pitiful, and his expression even more so. <br/><br/>But Daisy merely glanced at him and said coldly, “Your hair’s faded, it’s ugly.” <br/><br/>James: ‘ <br/><br/>“I’ve told you before, don’t act cute when you’re ugly.” James: <br/><br/>“Otherwise not only will it not work, but it will backfire.” <br/><br/>James’s handsome face was now contorted to resemble a bitter gourd. <br/><br/>“Are you not leaving yet? Do you want me to calculate the cost?” <br/><br/>“I’ll leave immediately.” James immediately put on a sweet smile, “Sis, I’ll come visit when I have time.” <br/><br/>Daisy casually agreed. <br/><br/>James glared at the grinning Kevin before opening the door and leaving. <br/><br/>“What are you laughing at?” Daisy turned around and looked at Kevin. <br/><br/>“Ahem...” Kevin immediately retracted his smile and said, “I’ll help you put the wine in the wine cabinet.” <br/><br/>Watching the direction Kevin left in, Daisy softly laughed for a moment..\t\t\t\t\t\t</div>", "images": {}, "success": true}