{"id": 58, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14078534.html", "title": "Chapter 58 - 58: Pretty Good", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 58 - 58: Pretty Good</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 58: Chapter 58: Pretty Good <br/><br/>Translator: 549690339 <br/><br/>From the moment Charles Hobson started yelling, Amelia Miles had come out of her room and stood in the corridor on the second floor, listening. <br/><br/>Johanes Miles had drunk all night, and although not drunk, his head was pounding. Charles’ yelling made him feel even worse. <br/><br/>“Jordan,” said Johanes Miles, trying to be patient, “even if the Miles family recognizes her, it will only be a formality, and then allocate her a share. She will not come here, will not cause us trouble, and everything will be the same as before. <br/><br/>“The same as before? Johannes Miles, if you want it to be like before, let that little bitch stay far away from this home, or don’t expect it to be like before!” <br/><br/>“Jordan!” <br/><br/>“I said, I don’t allow it!” <br/><br/>“Jordan.” Johanes Miles stood up from the sofa, “I hope you think about it, and besides, Arthur North’s family should have her share.” <br/><br/>Amelia Miles, who had been listening on the second floor, clenched her hands tightly upon hearing this. <br/><br/>Johanes Miles didn’t argue with her but warned her with a clear tone. Charles Hobson suddenly stepped back, looking at him in disbelief. <br/><br/>Johanes Miles did not say anything more and went straight back upstairs. <br/><br/>When he reached the upstairs, he saw Amelia Miles standing at the entrance of the room in her pajamas and was momentarily startled: “Amelia, you haven’t slept yet.’ <br/><br/>“Dad, you...” Amelia Miles smiled obediently, “Drink less wine in the future, it’s not good for your health.” <br/><br/>“Hmm, I know.” Johanes Miles’s voice softened, “Help your dad go and persuade your mom.” <br/><br/>“I know.” Plunge into the depths of Nøv€lß¡n, where information dwells.<br/><br/>When Johanes Miles returned to his room, Amelia Miles went downstairs. <br/><br/>Charles Hobson was already sitting on the sofa, her shawl had fallen off her shoulders. Hearing the footsteps, she looked up and saw Amelia Miles, the tears just beginning to fall: “Amelia.” <br/><br/>“Mom.” Amelia Miles handed her two tissues to wipe her tears, “Arguing doesn’t solve anything, it only causes cracks in your relationship with Dad.” “I don’t want to argue either, but look at what he’s done.” <br/><br/>“Mom, don’t worry.” Amelia Miles comforted, “If they want to recognize her because of Liam Davis, this matter doesn’t need us to worry about. Let alone Liam’s fickleness and habit of changing women like clothes. Even Liam’s mother wouldn’t approve of Daisy Zane.” <br/><br/>Charles Hobson wiped her tears and replied, “I know, I’m just disappointed with your father’s approach.” <br/><br/>“Dad still loves you, that’s why he tells you these things.” Amelia Miles leaned back on the sofa, “Liam’s mother has a high standard for her daughter-in-law. No matter what, she would never let Daisy Zane, who has not been to school and has the identity of an illegitimate daughter, marry into their family.” Charles Hobson nodded her head gently. <br/><br/>Amelia Miles held her mother’s hand, looked at the tea table, and her expression darkened bit by bit. <br/><br/>Even if Liam’s mother was blind and favored Daisy Zane, she could still find a way to ruin her. <br/><br/>“Didn’t sleep well?” <br/><br/>“It was good.” It was such a good sleep that she woke up early. <br/><br/>“I made red date and lotus seed porridge, and it should be ready soon. Want breakfast?” Kevin walked out of the room. <br/><br/>“You made it?” <br/><br/>“Yep,” Kevin replied, “I woke up a bit early today too, so I made some porridge and went for a run outside. <br/><br/>“So you took a bath early in the morning.” <br/><br/>“What else?” Kevin somehow felt that there was something in Daisy Zane’s expression. <br/><br/>Ignoring his words, Daisy Zane went straight to the dining room where some breakfast items Kevin had bought were on the table. <br/><br/>Kevin looked at her retreating figure and laughed. Then he brought her a bowl of porridge, “Be careful, it’s a bit hot.” <br/><br/>“Okay.” <br/><br/>Daisy took a spoonful, blew on it for a while, and then took a bite. It tasted good. <br/><br/>“How is it?” <br/><br/>“Very good.” Daisy scooped another spoonful of porridge and blew on it. <br/><br/>Kevin chuckled as he prepared the rest of their breakfast. “I won’t compare myself to the chef at Doomsday Hotel, but how about comparing to Michael Jackson? Whose cooking is better?” <br/><br/>Upon hearing this, Daisy looked up at him. <br/><br/>Kevin unabashedly displayed a hint of jealousy towards Michael Jackson, not hiding it at all. <br/><br/>Daisy took another bite, slowly stirring the porridge with her slender fingers holding the spoon, and said, “It’s better than the Doomsday Hotel chef’s.” <br/><br/>Kevin, somewhat surprised, glanced at Daisy before laughing, “Seems like I’ve got some talent for cooking.” <br/><br/>“Yeah, you can develop it further.” <br/><br/>“Alright.’ <br/><br/>After breakfast, Kevin had work to do, but he didn’t go to the study. He took his computer and sat in the living room. <br/><br/>Daisy had a report to write as well. <br/><br/>So, the two of them sat, one cross-legged on a three-seater sofa, the other on a single-seat sofa, legs crossed. The sound of typing on their keyboards was like a competition. <br/><br/>It was quite noticeable that there was one difference between them: the line spacing on Kevin’s computer was larger than Daisy’s..\t\t\t\t\t\t</div>", "images": {}, "success": true}