{"id": 55, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14078517.html", "title": "Chapter 55 - 55: Seeing Johanes Miles Again", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 55 - 55: Seeing Johanes Miles Again</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 55: Chapter 55: Seeing Johanes Miles Again <br/><br/>Translator: 549690339 <br/><br/>When Arthur North came out of the study, he saw the fine sweat on Daisy Zane’s forehead. He also sensed her low pressure and turbulent temperament she was trying to suppress. <br/><br/>He thought she must have had a nightmare and couldn’t sleep, which was why she came out. <br/><br/>So he didn’t go back to his room. After finishing his work, he sat and dozed off on the chair by the French window. <br/><br/>Luckily, Daisy Zane slept peacefully after falling asleep and only stirred a few times. <br/><br/>From leaning on the sofa, she gradually lay on her side on the sofa, and then curled up, leaving only a bunch of hair outside. <br/><br/>She slept very soundly, and she heard Arthur North’s light footsteps several times, but she didn’t wake up knowing it was him in her subconsciousness. <br/><br/>Almost 9 0’clock, there were two wrong password inputs from the door outside. Daisy Zane opened her eyes, sat up, and looked at the living room entrance. <br/><br/>“Awake?” Arthur North walked over from the French window. <br/><br/>Daisy Zane looked back at him and stared at the redness at the corner of his eyes for two seconds. “Didn’t you sleep last night?” <br/><br/>Arthur North poured her a glass of water and put it on the tea table. “Dealt with some matters.” <br/><br/>“There’s someone outside the door.” <br/><br/>No sooner had the words been spoken than Arthur North’s cell phone rang. He answered the call and directly said, “Wait outside for a while.” <br/><br/>“No, how come you changed the password?” Allonzo Hobson finished speaking, suddenly fell silent for two seconds, then excitedly said, “Holy shit! Arthur! <br/><br/>You’re hiding your girlfriend! You’ve finally done the deed!” <br/><br/>The voice was really loud, not only coming out of the cell phone but also coming in from the entrance. <br/><br/>Daisy Zane looked at Arthur North’s sudden speechless expression, raised her eyebrows in a drowsy manner, and then took the quilt and went straight back to her room. <br/><br/>She didn’t even wear her slippers, just went barefooted. <br/><br/>Seeing her indifferent expression, Arthur North felt relieved, hung up the phone directly, and put the slippers at the master bedroom door. He knocked on the door and said, “Daisy, come out and put on your shoes.” After two seconds, Daisy Zane opened the door and put on her shoes. <br/><br/>Arthur North smoothed the somewhat messy strands of hair on her head and said, “Wash up, we’ll go out to eat.” <br/><br/>“Mm.” <br/><br/>After Daisy Zane finished washing and changing her clothes, the two were ready to leave. When they opened the door, Allonzo Hobson was still waiting outside. <br/><br/>“Arthur, you finally remembered me, as soon as you laid eyes on...” Allonzo Hobson began to complain when he heard the door sound but suddenly closed his mouth when he saw Daisy Zane, “Lady Zane is here too.” <br/><br/>“Young Master Hobson.” Daisy Zane greeted him with a smile. <br/><br/>But Allonzo Hobson looked at her smile and suddenly shivered from the bottom of his heart: “Lady Zane.” <br/><br/>Kevin Clark smiled and said, “Really, it’s on the way. I’m going to take care of something over there.” <br/><br/>John Anderson arranged to meet at the cafe downstairs of the Maple Elite <br/><br/>Entertainment. He didn’t mention the specifics, only that he wanted to see her. <br/><br/>Daisy Zane thought it might not be that simple. <br/><br/>As she expected, when she entered the cafe and went to the second floor to find the reserved seat, she saw Johanes Miles and an unknown man sitting there. <br/><br/>He was wearing a well-tailored gray suit, looking to be in his twenties, with an expensive watch on his wrist. He had a handsome face, but there was a hint of rascality and debauchery in his eyes. <br/><br/>Waiter: “This way, please.” <br/><br/>Probably hearing the waiter’s voice, Johanes Miles and the man both looked over. <br/><br/>Johanes squeezed out a kindly smile: “Lucia, over here.” <br/><br/>The man also gave a smile, his eyes unabashedly looking her up and down. <br/><br/>Today, Daisy Zane was wearing a skirt. On top, she had a light purple chiffon blouse, and underneath, was a matching long light purple skirt that reached her ankles. <br/><br/>Her shoes were white casual shoes, with long socks covering her legs. <br/><br/>Now that the weather was cold, Kevin Clark didn’t stop her from wearing a skirt when they left. But, he let her wear long socks to protect her ankles. <br/><br/>Daisy Zane looked at the two of them, her eyes indifferent, and in her heart, she understood. <br/><br/>The man was sitting across from Johanes Miles, and they had connected soft seats on both sides. As she walked over, she pulled a chair from a nearby table and placed it next to the table without sitting close to either of them. <br/><br/>“What’s up? <br/><br/>“Lucia.” Johanes Miles was irritated by her cold voice but still introduced with a smile, “Let me introduce you, this is Liam Davis from the Davis Corporation.” <br/><br/>Liam Davis stood up and gentlemanly reached out his hand to her: “Lady Zane, how are you.” <br/><br/>Daisy Zane looked at him, her gaze falling on his face, then his hand, and then she didn’t move. <br/><br/>“Lucia.” Johanes Miles called her name from the side. <br/><br/>Daisy Zane lowered her eyes, adjusting her cuff, and said indifferently: “Hello.” Seeing her reaction, Liam Davis laughed, relaxed his hand, and sat back down. <br/><br/>Johanes Miles smiled apologetically: “Sorry, she just came here not long ago, and she’s still not used to it.” <br/><br/>“I understand.” Liam Davis called the waiter over and asked, “Lady Zane, what would you like to drink?” <br/><br/>“Iced Americano.” Daisy Zane paused and said, “Make it a hot Americano.” “Alright, please wait a moment.” <br/><br/>“In the future, when it’s cold, don’t drink iced beverages.” Johanes Miles said with a concerned tone. <br/><br/>Daisy Zane finally looked at him directly and let out a soft chuckle: “Mr.. Miles, isn’t it a little late for you to play the caring father?”\t\t\t\t\t\t</div>", "images": {}, "success": true}