{"id": 56, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14078521.html", "title": "Chapter 56 - 56: This Is…Gold, Isn’T It?", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 56 - 56: This Is…Gold, Isn’T It?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 56: Chapter 56: This is...gold, isn’t it? <br/><br/>Translator: 549690339 <br/><br/>They chose seats by the window, and from Daisy’s position, she could see the pedestrians and vehicles outside through the glass. <br/><br/>After telling Johanes that, his face turned pale. <br/><br/>It wasn’t until the waiter brought the coffee and said, “Please enjoy,” that Johanes slightly recovered and said in a low voice, “Daisy, I admit I was wrong all these years, and I have been trying to make it up to you.” <br/><br/>“I said that if you really want to make it up to me, you should give me a share of what Amelia has.” Daisy stirred her coffee slowly, her expression indifferent, <br/><br/>“That’s not too much to ask for now.” <br/><br/>Liam’s gaze remained on Daisy, and upon hearing her words, he quickly said, “It’s not too much. They’re both daughters, so naturally, they should be treated the same. Director Miles, don’t you agree?” <br/><br/>Johanes’s face stiffened for a moment, and he said, “Mr. Davis is right.” <br/><br/>Daisy didn’t take his compliance to heart and continued to lower her gaze to stir her coffee without looking at them. <br/><br/>After a while, Liam glanced at Johanes, who got the hint and stood up saying, <br/><br/>“Daisy, you chat with Mr. Davis first, I have something to do and have to leave.” <br/><br/>Liam stood up, “Director Miles, you go ahead, I’ll visit you another day.” <br/><br/>Johanes nodded with a smile, and as he left, he gave Daisy a warning glance, but she sat there dignified and cool, not looking up. <br/><br/>It wasn’t until Johanes left that Liam laughed and said, “He’s gone.” Daisy looked at him, her phoenix eyes upturned and beautiful, emanating a sense of distance and indifference, “Don’t waste your time on me.” <br/><br/>Not expecting her to be so straightforward, Liam was stunned for a moment before he likewise said directly, “Lady Zane, you should at least consider and give it a try.” <br/><br/>Daisy looked at him for a while before commenting, “You’re quite confident.” <br/><br/>“Yes, I’ve always felt that I have the confidence to back it up,” Liam said. <br/><br/>Daisy took another look at him and said nothing. <br/><br/>“Lady Zane, you must know that if you’re with me, you’ll immediately get what you want,” Liam said, looking at her, “You’ll have a place in the Miles family, and you’ll have everything Amelia has, and even more.” <br/><br/>Daisy still didn’t sneak or look at him. she just nicked un the coffee and took a sip. <br/><br/>Liam’s eyes stayed on her, never leaving. He didn’t know what was going on with him. He went to Daisy’s film premiere with a little celebrity. <br/><br/>His goal was to please that little celebrity, so he didn’t pay much attention to the film. Unearth this data, retracing it to the very heart of Nøv€lß¡n★<br/><br/>But at the end of the film, he inadvertently glanced at the screen just in time to see Daisy’s close-up. <br/><br/>The shot was short, lasting only a few seconds before the movie ended. <br/><br/>But Liam felt that those few seconds stretched infinitely in his vision, and everything around him suddenly lost its color. <br/><br/>“Yes.” <br/><br/>The elevator opened at the twenty-eighth floor, and the three came out together. <br/><br/>Harton Clark glanced at Daisy Zane’s residence and said, “He won’t be here tonight.’ <br/><br/>Allonzo Hobson also quickly added, “Oh, right, I came to get something and will leave after that. <br/><br/>“It’s fine,” Daisy Zane said. “James Collins sent me the password, and I’ll get my luggage and go back.” <br/><br/>Upon hearing this, Harton Clark hesitated while opening the door, and even frowned where the other two couldn’t see. But he quickly regained his composure: “Are you sure it’s correct?” <br/><br/>Daisy Zane didn’t speak, clearly not very sure. <br/><br/>Although James Collins had assured her repeatedly that the password was correct when he texted her and even offered to freeze his own bank card if it wasn’t. <br/><br/>But... <br/><br/>“I’ll go try it first.’ <br/><br/>“Sure.” <br/><br/>Harton Clark agreed verbally, but in his heart, he kept praying that she wouldn’t be able to open the door. <br/><br/>Allonzo Hobson, who had been quiet throughout and obviously a bit tired, noticed Harton Clark’s reaction. He raised his eyebrows, amusement evident on his face. <br/><br/>However, things didn’t go as Harton Clark hoped, and he heard the sound of Daisy Zane’s password being entered correctly and the door opening. <br/><br/>Allonzo Hobson was close by and clearly felt Harton Clark’s sudden drop in pressure when the door opened, like a tornado. <br/><br/>Before Allonzo Hobson could react, there was a “crash” from Daisy Zane’s place following the sound of the door opening. <br/><br/>Something had fallen over, and there was the noise of metal scattering on the ground. <br/><br/>Before Allonzo Hobson could respond, Harton Clark was already walking towards Daisy Zane. <br/><br/>“Lucia. ” <br/><br/>Daisy Zane was standing at the door, looking at the express delivery boxes piled half a person high from the entryway to the living room entrance – big and small, long and square. <br/><br/>And from the looks of it, there were even more piles in the living room. <br/><br/>It resembled a warehouse, leaving her just enough space to pass. <br/><br/>However, she didn’t even have space to pass now because when she opened the door, the express delivery boxes on the right fell over. <br/><br/>Harton Clark first checked on Daisy Zane to make sure she was alright, then glanced into the room and was stunned for a moment. <br/><br/>Daisy Zane’s expression was not good. She stared at the boxes, looking like she was on the verge of exploding. <br/><br/>Following the scene, Allonzo Hobson couldn’t help but curse out loud, then he saw some glittering gold items scattered on the floor. <br/><br/>He bent down to pick up two, weighing them in his hand, glanced at Daisy Zane, then at Harton Clark, and said, “If I’m not mistaken, this is.... gold, right?”\t\t\t\t\t\t</div>", "images": {}, "success": true}