{"id": 54, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14078513.html", "title": "Chapter 54 - 54: Am I A Good Person?", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 54 - 54: Am I A Good Person?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 54: Chapter 54: Am I a Good Person? <br/><br/>Translator: 549690339 <br/><br/>Kevin Clark hadn’t gone to sleep, and was in the study dealing with some matters. <br/><br/>When he heard the sound of the door of the master bedroom opening, he thought that Daisy Zane had come out to get some water to drink. But he hadn’t heard the sound of her going back. <br/><br/>So he came out to check. The initial posting of this chapter occurred via noovelllbbin<br/><br/>The living room light was not on, Daisy Zane was sitting on the carpet next to the sofa, and a lit candle was placed on the tea table. <br/><br/>The warm yellow candlelight illuminated a small circle, struggling against the darkness. Warm and tranquil. <br/><br/>Hearing the movement, Daisy Zane turned her head and saw Kevin’s figure said, “Haven’t slept yet?” <br/><br/>“Mm.” Kevin replied softly. As he approached, he noticed that Daisy was holding an ash leveler, and there was an incense burner on the tea table, she was leveling the ash inside. <br/><br/>His home clothes looked too big on Daisy Zane, both the pant legs and sleeves were rolled up, making her seem smaller than usual. <br/><br/>The candlelight on her face faded a little from her usual aloofness. <br/><br/>Kevin sat down on the sofa, keeping an appropriate distance from her. <br/><br/>Daisy continued to level the ash. She rotated the incense burner with one hand while the other held the ash leveler, gently smoothing the white incense ash inside. <br/><br/>Her technique was not only professional but also very skilled. <br/><br/>She said, “I couldn’t smell the scent of Eaglewood in the bedroom anymore, so I came out and tampered with your things, wanting to make a new one.” <br/><br/>“Help yourself to anything at home,” Kevin’s voice grew gentler. <br/><br/>Daisy Zane didn’t respond, the incense burner, the bottle of incense powder, and the candlestick were all antiques. The rest, whether it was the incense spoon, incense shovel, incense cleaner, incense seal, or the ash leveler in her hand, were all pure gold. <br/><br/>If she wasn’t really restless, she certainly wouldn’t touch them. <br/><br/>“Do you like the scent of Eaglewood?” Kevin noticed some fine sweat on her forehead. <br/><br/>“Mm, it smells really good,” Daisy picked up the incense cleaner, brushed the ash on the wall of the incense burner, and then picked up the ash leveler to level the ash again. <br/><br/>Not only did the scent of Eaglewood calm the mind, but the process of making the incense seal also cleared the soul. <br/><br/>After leveling the ash. Daisy Zane took the incense seal mold and placed it on <br/><br/>the incense ash. She then picked up the incense spoon, opened the incense bottle, and scooped the incense powder onto the seal mold spoonful by spoonful. <br/><br/>She filled the mold with the incense shovel and replaced the excess incense powder. She turned the spoon handle to tap on the seal mold, picked it up, and a perfect incense seal was made. <br/><br/>Afterward, Daisy took a thread of incense and lit it on the candle. She used the thread incense to light the incense seal in the burner and put the lid on. <br/><br/>Daisy looked at him but didn’t move. She crossed her legs and leaned back on the sofa with her elbow, her hand propped up against her forehead—a rather cool pose. <br/><br/>Seeing her not moving, Kevin slightly leaned in, closing the distance between them: “Daisy, do you dare?” <br/><br/>The two stared at each other, one like clear snow, the other like a blood moon. <br/><br/>After a moment, Daisy averted her gaze and stood up: “Pull it.” Her tone was a bit fierce. <br/><br/>Kevin stood straight, chuckled, and then pulled out the sofa. <br/><br/>Although it wasn’t as big as a bed, it would surely be comfortable enough for a night’s sleep. <br/><br/>Daisy leaned back on the half-shortened sofa back, her legs straightened comfortably on the extended sofa. <br/><br/>Kevin fetched a quilt and gently placed it over Daisy. He also brought a cushion for her: “Put it under your waist.” <br/><br/>“Hm?” Daisy adjusted the quilt on herself. <br/><br/>“Doesn’t it feel uncomfortable hanging your waist like that?” Kevin sat on the edge of the sofa, picked up the poetry collection, and flipped through it. <br/><br/>He had seen her leaning on the sofa with her waist suspended when he left his room earlier. <br/><br/>Despite the loose home clothes, he could sense that her small waist was slim and soft. He dared not look at it again after a glance. <br/><br/>“My waist is fine.” Daisy casually placed the cushion under her waist, her tone light and cold—as if it wasn’t a big deal. <br/><br/>However, Kevin’s hand holding the book suddenly tightened, leaving fingerprints on its pages. He closed his eyes and took a light breath. When he spoke again, his voice was slightly hoarse: “I’ll begin.” “Mhm.” Daisy found a comfortable position. <br/><br/>“When Day Is Done. If the day is done, If birds sing no more...” <br/><br/>Daisy turned her head to look at him. In the candlelight, his face looked even more enchanting, as if it were coated with an intense glow. <br/><br/>She had always thought that Kevin’s voice was the most pleasant she had ever heard. It was a bit low, carrying a touch of his unique Beijing accent, yet very clear. <br/><br/>A very regal voice. <br/><br/>After a while, Daisy closed her eyes. Smelling the scent of eaglewood and listening to Kevin’s voice, she fell asleep quickly. <br/><br/>Kevin read for a long time, his voice slow, until he was sure that Daisy had entered deep sleep. Only then did he put the book on the tea table, gently got up, and slowly lowered the back of the sofa a bit. Afterward, he covered her with the quilt again. <br/><br/>Kevin’s home clothes were quite big, and when Daisy wore them, the collar leaned to the left, revealing her beautiful collarbone. Now it leaned to the right. <br/><br/>As Kevin covered her with the quilt, his gaze moved from her face, inadvertently falling on her collar. <br/><br/>He saw the red scar on her collarbone. <br/><br/>Because of the clothing, he could only see a small part of it. There were three of them, varying in length, as if something had scratched her. <br/><br/>Kevin’s gaze paused for a moment, then moved back to Daisy’s face. <br/><br/>After quietly watching her for some time, he went to the study and got his computer, then sat in the chair by the French window. He worked while keeping an eye on Daisy from a distance..\t\t\t\t\t\t</div>", "images": {}, "success": true}