{"id": 52, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14078511.html", "title": "Chapter 52 - 52: Come Rest At My Place", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 52 - 52: Come Rest At My Place</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 52: Chapter 52: Come Rest at My Place <br/><br/>Translator: 549690339 <br/><br/>The two of them sat in the nanny car. <br/><br/>Kevin Clark arranged the food boxes layer by layer on the tableboard. There were fish, meat, shrimp, soup, and even cut fruits, including grapes peeled off. <br/><br/>“Give me your hand, I want to check it.” Kevin Clark said. <br/><br/>Daisy Zane extended her hand to him, glanced at his eyes to find that the corners of his eyes were once again reddened. He hadn’t got a good rest. <br/><br/>Kevin Clark held her wrist and pressed it. The swelling had subsided significantly: “Does it still hurt?” <br/><br/>“No pain.” Daisy Zane replied, holding a fork in her left hand, and ate a grape. <br/><br/>Kevin Clark glanced at her, doubting her two-word response: “You still need to apply the medicine.” <br/><br/>“Hmm.” Plunge into the depths of Nøv€lß¡n, where information dwells.<br/><br/>He didn’t quite believe her, so he added: “I will remind you when it’s time.” <br/><br/>Daisy Zane chewed the grapes in her mouth slowly, looking at Kevin Clark. <br/><br/>Normally, she wouldn’t care much about such a slight injury. It’s just that she didn’t care much when Kevin Clark told her to apply the medicine twice a day, morning and night. <br/><br/>Kevin Clark seemed to see through her thoughts, so that night, he called her exactly at eight o’clock to remind her to take the medicine. <br/><br/>Daisy Zane agreed, but Kevin Clark insisted on waiting until she finished applying the medicine before hanging up the phone. <br/><br/>That night, it took her more than ten minutes to find the two tubes of ointment, which finally turned up in the laundry basket. <br/><br/>She didn’t notice when she was sorting out the clothes, and the tubes of medicine were tossed inside with the clothes. <br/><br/>After that day, Kevin Clark started to video call her promptly at eight, morning and night, watching her apply the medicine. <br/><br/>“Is the grape sweet?” Kevin Clark put his hand back on her leg. <br/><br/>“Hmm.” <br/><br/>Kevin Clark gave a small smile and handed her the chopsticks: “Eat first.” <br/><br/>Daisy Zane took the chopsticks, took a bite of her meal, and after swallowing, she asked, “Are you done with work?” <br/><br/>“Not yet.” Kevin Clark carefully removed the fish bones for her. Hearing her question, the corners of his mouth slightly turned upward, “In two days’ time, I have managed to interrogate the arrested persons around the clock. However, no valuable information has been obtained.’ <br/><br/>Daisy Zane paused her hand for a moment, she didn’t expect him to share so much with her. <br/><br/>“Um.” Kevin said, “Let me know when you’ve settled the schedule, I will pick you up.” <br/><br/>As the female lead was finally established, Serena Buster signed a contract at the fastest speed and started filming. <br/><br/>To make up for the scenes of the female lead, Daisy had to work through the night; after that, the director gave her a break. <br/><br/>To put it nicely, they were letting her rest, but not so nicely, they were rushing to film the female lead’s scenes, so she was not needed anymore. <br/><br/>So, Daisy returned to Truro City the morning after filming had wrapped up. <br/><br/>She left at 8 0’clock in the morning, it was a little over four-hour drive, but she was stuck in traffic for two hours. By the time she arrived at Everlasting Palace, it was already past three in the afternoon. <br/><br/>Exiting the elevator, Daisy stood at the entrance of her door trying her fingerprint to unlock it. It didn’t open even after trying three times. Then she tried the password, but the password was incorrect. <br/><br/>Daisy: <br/><br/>She pressed the doorbell twice, no one answered from her side of the house, but there was the sound of a door opening from across the hall. <br/><br/>Daisy turned around. <br/><br/>Kevin, in his house clothes, looked somewhat surprised to see her, and lightly teased, “What’s up, can’t get into your own house?” <br/><br/>Daisy removed her mask and pulled out her cell phone, saying, “James Collins deleted my fingerprint and changed the password.” <br/><br/>Kevin kept a straight face as he pursed his lips, realizing the man had really made himself at home. He walked closer and asked, “Isn’t he coming back tomorrow?” <br/><br/>“Yes, one of the scenes got canceled, and I came back early.” Daisy said and then dialed James Collins’s number. <br/><br/>James answered the phone rather quickly which allowed Kevin to hear him excitedly yell “Sister” on the other end. <br/><br/>But... Daisy tried the new password James gave her three times, and it was wrong each time. <br/><br/>“James.” Daisy lightly called his name. <br/><br/>“Sister, sister, calm down, I’ll think, I’ll think about it.” James explained, “I was drunk that night, I can’t remember it very well. Let me think.” <br/><br/>Then James gave her another set of numbers, and even after Daisy input them, it was still incorrect. <br/><br/>As the incorrect password prompt entered the phone, James’s heart went cold. Before Daisy said anything, he conceded, “Sister! I was wrong! Wrong! I really...” <br/><br/>“Where are you?” The question was cold and resonant. <br/><br/>“I am not in Truro City.” <br/><br/>Daisy immediately hung up the phone. <br/><br/>Kevin was standing not far behind her, a slight smile crept onto his face. He picked up her suitcase and gently said, “Come to my place first, rest for a while.” <br/><br/>Suppressing the urge to kick the door, Daisy took a light breath and replied, “Sure..”\t\t\t\t\t\t</div>", "images": {}, "success": true}