{"id": 53, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14078512.html", "title": "Chapter 53 - 53: I Am Jealous", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 53 - 53: I Am Jealous</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 53: Chapter 53: I am Jealous <br/><br/>Translator: 549690339 <br/><br/>Kevin had visited Arthur’s residence once before, and the layout was generally similar to hers. <br/><br/>However, she was unsure whether it was due to the scent of Eaglewood or Arthur’s personal temperament. She always felt there was a refined and antiquated atmosphere on her side. <br/><br/>At the entrance, Arthur placed a pair of white, fluffy cotton slippers for her, which were dedicated to women. <br/><br/>Daisy looked at him questioningly. <br/><br/>Arthur smiled, “It’s getting cold, wear these to keep warm.” <br/><br/>Daisy didn’t say anything and bent down to change into the slippers. <br/><br/>As they entered the living room, Arthur looked at her fair ankles and the fluffy cotton slippers on her feet, and lifted his eyebrows in good spirits. <br/><br/>Just as he had imagined, she looked just as beautiful and adorable. <br/><br/>Daisy sat down on the sofa, and Arthur poured her a cup of warm water before sitting down on a nearby single sofa, “Resting for a few days?” <br/><br/>“Five days.” Daisy glanced at the incense burner on the tea table. It was a valuable antique. The scent of Eaglewood made her feel even more at ease than when she was at her own place. <br/><br/>“Yeah, you can have a good rest.” <br/><br/>“Didn’t you go out today?” Daisy looked at the home clothes he was wearing, which appeared slightly more leisurely than usual. <br/><br/>“I came back around eleven, and took a nap.” Arthur said, “I just woke up when I heard your doorbell.” <br/><br/>Daisy leaned back in the sofa, relaxing her posture. She took a sip of her water and asked, “Are you going to sleep some more?” <br/><br/>Arthur immediately realized what she wanted to do and instead of answering, he asked, “Have you eaten lunch?” <br/><br/>“Yeah, I ate on the way.” <br/><br/>“Alright.” Arthur stood up, “I’m going to change my clothes, wait for me.” <br/><br/>Daisy nodded. <br/><br/>Soon, Arthur came out dressed. <br/><br/>Arthur’s clothes were simple, mostly consisting of suits and shirts in black. The colors were monotonous, but the styles were diverse. <br/><br/>He wore a black shirt and carried a suit jacket in his hand, “Let’s go.” <br/><br/>“Alright.” <br/><br/>The two left together, and Arthur drove them straight to the police station. <br/><br/>Before arriving at the station, Arthur made a call. When they got there, a man named William led them directly to a room. <br/><br/>The room was quite empty, with only a desk and a few chairs, and nothing else. <br/><br/>Back at their quarters, Kevin Clark went to the kitchen to wash some fruit and placed it on the tea table. He told Daisy Zane to sit on the sofa for a while as he went back to his room to tidy up. <br/><br/>Almost half an hour had passed before he emerged from his room with some clothes and went to the guest room. <br/><br/>Coming out of the guest room, he took Daisy Zane’s suitcase to the master bedroom, “I’ve changed the sheets and covers, you can stay here.” <br/><br/>“I can stay in the guest room,” Daisy Zane stood up and followed him. <br/><br/>“No way,” Kevin Clark put the suitcase at the entrance of the master bedroom without going inside, “Allonzo Hobson slept in the guest room.” <br/><br/>Daisy leaned against the door frame, smiling at him. <br/><br/>Seeing her smile made Kevin Clark’s fingers itch. “I’m jealous,” he calmly confessed. <br/><br/>Daisy’s smile deepened, and she even let out a quiet laugh. <br/><br/>After watching her laugh for a bit, Kevin Clark raised his hand and tapped the top of her head, “Go to sleep early.” <br/><br/>“Okay,” Daisy straightened up. <br/><br/>“The towels, bath towels, and toothbrushes in the restroom are all new,” Kevin <br/><br/>Clark said, “Is there anything else you need?” <br/><br/>Daisy thought for a moment and said, “Lend me some pajamas.” <br/><br/>She had everything she needed at home, so her suitcase was filled with some out-of-season clothes and her computer. But she didn’t expect to be unable to enter her own home. <br/><br/>Kevin Clark walked into the room, opened the wardrobe, and said, “These are all new, never worn; help yourself.” <br/><br/>“Thanks.” <br/><br/>The night before she had spent almost the entire night filming, and she didn’t get much rest at the hotel, leaving at eight in the morning. <br/><br/>Although it was a six-hour journey, she hardly rested. As soon as she returned to Truro City, she spent several more hours reviewing the reports. <br/><br/>So, after taking a bath, Daisy fell asleep as soon as she lay down on the bed. <br/><br/>But suddenly, she woke up around 1 a.m. <br/><br/>The lights in her room were off, and the curtains were only half drawn. The cold moonlight seemed to carry a hint of chill as it spilled into the room. <br/><br/>Daisy’s phoenix eyes snapped open, filled with icy fury. It was like a sudden blizzard, threatening to tear a hole in the darkness. <br/><br/>She paused for a moment and then switched on the bedside light. <br/><br/>The darkness retreated, and Daisy leaned against the head of the bed. <br/><br/>Her hair was loose, her face slightly sweaty, and a few strands of hair clung to her face. Apart from the red bloodshot eyes, a closer look revealed some moisture in her eyes. <br/><br/>The scenes from her dreams were like a movie, replaying frame by frame in her head. <br/><br/>The effects of the elixir were also itemized in her mind. <br/><br/>Convulsions, self-harm, loss of consciousness, hallucinations, pain like ants gnawing at her heart, and even obedient, command-following reactions....\t\t\t\t\t\t</div>", "images": {}, "success": true}