{"id": 57, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14078526.html", "title": "Chapter 57 - 57: Staying Another Night", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 57 - 57: Staying Another Night</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 57: Chapter 57: Staying Another Night <br/><br/>Translator: 549690339 <br/><br/>Perhaps Allonzo Hobson accidentally bumped into something while picking up things, and the small cardboard box that spilled gold bars tilted further down. <br/><br/>With a splash, many more fell out. <br/><br/>Allonzo Hobson’s eyes couldn’t help but widen. A box full of gold bars! <br/><br/>He looked at the two in his hand, just two bare gold bars without any imprints. <br/><br/>And they were just packed in such a shabby cardboard box with no protective padding inside. Was it this casual? <br/><br/>Plus...the express order on this broken box, these things can’t be sent through express delivery, right? <br/><br/>As he was thinking, the box next to this one also fell. This time no gold bars fell out, but a few diamonds did, including a blue one and a pink one. <br/><br/>This was just what had fallen out, and Allonzo Hobson had a feeling that the whole box was full of them. <br/><br/>It seemed that these few diamonds had been the last straw that wore away Daisy Zane’s patience. <br/><br/>Kevin Clark clearly felt that the person next to him was growing colder and colder. He then saw her slowly take out her cell phone, swipe a few times, and dial a number. <br/><br/>A few seconds later, it connected. Plunge into the depths of Nøv€lß¡n, where information dwells.<br/><br/>The first voice to come out was James Collins’, which Kevin Clark, being close by, heard clearly. <br/><br/>“Sister, how is it? The password must be correct this time...” <br/><br/>“James Collins.” Daisy Zane cut off his voice, her tone cold and frightening, “Who the fuck did you tell my address to?” <br/><br/>It wasn’t loud or harsh, but it sent shivers down one’s spine. <br/><br/>Allonzo Hobson couldn’t help but gasp for cold air. <br/><br/>Kevin Clark, on the other hand, raised an eyebrow and smirked with amusement. <br/><br/>Daisy Zane was a cold and cool person. But it was obvious that she had a good upbringing, her manners and behavior were very good. <br/><br/>How to put it, she was quite like an ancient general’s mansion young lady. She had the elegant manners of a lady of the boudoir, but also the capable and dashing temperament of someone skilled in both literature and martial arts. <br/><br/>Although her speech carried no emotion, making her seem quite unapproachable, she was actually quite patient. <br/><br/>It was the first time Kevin Clark had seen her curse and lose her temper. <br/><br/>It seemed she was truly angry this time. <br/><br/>James Collins was apparently scared and it took him a while to regain his voice: “Sister, I didn’t. I just moved your stuff from your previous place.” <br/><br/>“Say that again.” <br/><br/>“Charles,” Johanes Miles held her hand while sitting down on the sofa, <br/><br/>“Charles, thank you for all these years. I feel really secure with you by my side.” <br/><br/>“Why are you suddenly bringing this up?” Charles Hobson grasped his hand and looked at him. <br/><br/>“Charles, I’m sorry.” <br/><br/>“What’s wrong?” Charles Hobson’s expression became more solemn. <br/><br/>“Liam Davis met Daisy Zane today.” <br/><br/>Charles Hobson’s hand instantly went cold: “And then what?” <br/><br/>“They met at noon.” Johanes Miles rubbed his brow and said, “In the evening, Liam dined with me—until now.” <br/><br/>Feeling the strength in Charles Hobson’s hand weaken, he gripped her tighter: “He said he likes Daisy Zane very much and insists on having her return to the Miles Family, giving her a share of everything that belongs to Johnson Sophie. Otherwise...” <br/><br/>“Otherwise, what? What does he want to do?” <br/><br/>“Otherwise, he will stand in opposition to us and become our enemy.” <br/><br/>“Let him stand in opposition! Are we scared of him?” Charles Hobson suddenly let go of Johanes Miles’s hand, “Why are you telling me all this? You want the b* * *h to come back, don’t you?” <br/><br/>“Charles, don’t be unreasonable. The Miles Family has just started to flourish and has suffered a heavy blow again.” Johanes Miles said, “We no longer have the strength and energy to deal with the powerful Davis Residence.” <br/><br/>“What do you mean we don’t have the strength, we don’t have the energy?” Charles Hobson stood up, “We are related by marriage to the Anning Faction, we have Maple Elite Entertainment, and we have our Hobson Family. What can he, one of the Davis Residence, possibly do!” <br/><br/>Johanes Miles didn’t respond. The Hobson Family has played a significant role in the Miles Family’s success today. But just like the old master said, the assistance the Hobson Family can provide is limited. <br/><br/>If the Davis Residence were to stand against them, the best-case scenario for the Miles Family would be to keep from declining with the support of Maple Elite Entertainment and the Hobson Family. <br/><br/>However, if the Davis Residence were to stand with them, the Miles Family’s future would stand to prosper. <br/><br/>“Johanes Miles, now that you’ve become so successful, do you think the Hobson Family is beneath you?” Tears suddenly fell from Charles Hobson’s eyes, her hand was raised but didn’t strike him in the end. <br/><br/>She had loved this man since her twenties, given birth to his children, paved the way for his career, and even fought tooth and nail to snatch him from someone else. <br/><br/>However, in his eyes, the interests of the Miles Family always came first. <br/><br/>“Johanes Miles, do you have a heart? Have you ever genuinely thought about <br/><br/>Johnson Sophie, have you ever thought about your son!” <br/><br/>“Isn’t everything I’m doing now for their sake?” <br/><br/>“For their sake, you want to give away their possessions!” Charles Hobson threw the pillow from the sofa at him. <br/><br/>“The Miles Family will belong to Henry Smith sooner or later, and Johnson Sophie will marry eventually. Isn’t it true that the better the Miles Family develops, the smoother Henry’s takeover will be and the more valuable Johnson Sophie’s shares will become, and her position in her birth family will be more secure?” <br/><br/>“You’re talking nonsense! You’re just trying to justify your actions! You just want to bring that b* * *h back home!”\t\t\t\t\t\t</div>", "images": {}, "success": true}