{"id": 60, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223322.html", "title": "Chapter 60 - 60: Similar To You", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 60 - 60: Similar To You</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 60: Chapter 60: Similar to You <br/><br/>Translator: 549690339 <br/><br/>Since Daisy Zane had finished cleaning up her place, she naturally wouldn’t be staying at Kevin Clark’s place anymore. <br/><br/>So after dinner, she brought her suitcase and computer over. <br/><br/>Kevin Clark moved back into the master bedroom. <br/><br/>When returning to the bedroom from the study that night, Kevin Clark stood by the bed for a long time after taking a shower. <br/><br/>In the end, he didn’t change the sheets and duvet cover and lay down directly. But he, who had always had good sleep quality, suffered from insomnia that night on that bed. <br/><br/>Daisy Zane had used his shower gel and wore his clothes when she showered at his place. The smell of her skincare products was very faint. <br/><br/>But he inexplicably smelled a scent that was like falling snow. <br/><br/>His mind was full of Daisy Zane, and for a moment, he wanted to knock on the door next door. <br/><br/>He stayed awake until around 3 0’clock before falling asleep. <br/><br/>Before falling asleep, a thought floated through his mind: Kevin Clark, after so many years of being an ascetic, you finally have a day like this. <br/><br/>The next morning, when Daisy Zane woke up and saw Kevin Clark’s message, she replied, telling him that she was awake. <br/><br/>Then, twenty minutes later, just after she finished washing up, Kevin Clark came with breakfast, ringing her doorbell. <br/><br/>Opening the door, Daisy Zane looked at his red eyes and asked, “Didn’t sleep well last night?” <br/><br/>“It was pretty good.” Kevin Clark changed his shoes and thought, just thinking about you kept me awake at the beginning, and then kept dreaming about you after falling asleep. <br/><br/>So it was pretty good indeed. <br/><br/>Breakfast was placed on the table, and Kevin Clark said, “I wanted to wake up early and cook some porridge, but I got up late.” <br/><br/>Daisy Zane ate a small dumpling: “Tastes good.” <br/><br/>When they were almost done eating, Kevin Clark said, “I have to return to the Imperial Capital later. Do you want to play in the Imperial Capital for a few days?” <br/><br/>Daisy Zane paused her soup-drinking: “No.” <br/><br/>“It’s fine, you’re going to start working again in a few days, so rest well these days.” Kevin Clark said, “If you have anything to do, find Michael Jackson.” <br/><br/>“Okay.” <br/><br/>After breakfast, Kevin Clark left. <br/><br/>On the way to the airport, he received a phone call. When he saw the words “William Lane” on the caller ID, Kevin Clark raised his eyebrows. <br/><br/>He answered the phone without any greeting and directly said, “You seem quite free today.” <br/><br/>The person on the other end of the phone laughed, and without any pleasantries, asked directly, “Are you in the Imperial Capital?” <br/><br/>“On my way back, what’s up? <br/><br/>William Lane: “Can you make it by noon? Let’s have lunch together?” <br/><br/>“Huh? You’re back in the Imperial Capital?” Kevin Clark was a bit surprised. This person spent about 360 days out of a year not in the country. <br/><br/>“Yeah.” William Lane sighed, and then spoke somewhat helplessly, “My sister is skipping school and getting into fights, and my dad is accompanying my mom on her tour, so... I came back to catch her.” <br/><br/>Kevin Clark didn’t say anything more to him. <br/><br/>Seeing his expressionless face, William Lane felt a faint pain in his forehead: “I’ll go check the surveillance.” <br/><br/>“Young Master, how could you come out by yourself? Thankfully, I found you.” An over-fifty-year-old man ran out of the hotel before William Lane even went to check the surveillance. He squatted down beside the child, carefully examining him, and sighed in relief after seeing that he was fine. <br/><br/>“Thank you both for the trouble. Thank you, thank you.” <br/><br/>Kevin Clark slightly nodded. <br/><br/>“Young Master, let’s go home.” <br/><br/>The man spoke, and the child hesitated a little before letting go of Kevin Clark’s sleeve and hugged the man’s neck. <br/><br/>The man held the child in his arms, slightly bowed to Kevin Clark and his companion, and left. <br/><br/>“Young Master, you mustn’t run around like this again. You scared me to death.” The man said while walking, “And in the future, don’t get so close to strangers. Today you met kind people, but what if you meet bad ones? The young master would be taken away.” <br/><br/>The child rested on his shoulder, looking back at Kevin Clark entering the hotel. Then he whispered softly, “He smells like something Mommy likes.” <br/><br/>“What?” The man didn’t hear clearly and asked again. <br/><br/>But the child did not want to speak again. <br/><br/>After lunch, Daisy Zane went to the storage room and took out a drawing board. <br/><br/>She sat in front of the French window, holding a paintbrush, aimlessly sketching while contemplating the theme for her design draft. <br/><br/>But after thinking for two hours, she still couldn’t decide. Instead, she received a call from Emily. <br/><br/>“Sister Emily.” <br/><br/>“Daisy, do you have time? I found you an assistant; come to the company to meet her. By the way, talk about the follow-up work.” <br/><br/>“Okay.” <br/><br/>After hanging up, Daisy Zane went out. <br/><br/>When she tried to call a car outside the Everlasting Palace, Liam Davis stopped his car in front of her, “Lady Zane, where are you going? Let me give you a ride.” <br/><br/>Without a doubt, Johanes Miles must have told him the address. <br/><br/>Daisy Zane stepped back and continued trying to call a car. <br/><br/>But... no one accepted the order. <br/><br/>“Let’s go, I don’t have anything to do either.” <br/><br/>Daisy Zane still ignored him and waited for someone to accept her ride request. But after a minute, no one accepted, and she started to think about going back to drive her own car. <br/><br/>“Lady Zane, just get in the car. I won’t charge you, and I won’t do anything.” Davis said, “Just think of it as hitching a ride.” <br/><br/>Daisy Zane waited another minute, but no one accepted her order, and Davis didn’t leave. <br/><br/>She took a step forward, opened the back door, and sat down: “Maple Elite Entertainment.” <br/><br/>David Davis turned his head and looked at her with a smile, “I said it’s a free ride, and you really treat me like a driver, huh?” <br/><br/>Daisy Zane turned her head, meeting his gaze. She took out 100 USD from her pocket and placed it on the armrest box in the middle, saying, “Car fare. <br/><br/>Remember to give me back 50 later..”\t\t\t\t\t\t</div>", "images": {}, "success": true}