{"id": 69, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223331.html", "title": "Chapter 69 - 68: Getting Into Trouble", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 69 - 68: Getting Into Trouble</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 69: Chapter 68: Getting into Trouble <br/><br/>Translator: 549690339 <br/><br/>The car window was knocked on a few times, as soon as Daisy Zane looked at the hand, she knew it was Kevin Clark. <br/><br/>She sat up and adjusted the seat back to its original position, then lowered the car window. <br/><br/>The cool morning air made her shiver involuntarily. <br/><br/>“Why are you sweating so much?” Kevin Clark furrowed his brow. <br/><br/>“I had a dream.” Daisy Zane took a few tissues from the armrest box to wipe the sweat on her forehead and neck, “Any news?” <br/><br/>“Nothing.” Kevin Clark said, “The whole bamboo forest was searched thoroughly, and all the traffic arteries are being checked, but there’s no news.” <br/><br/>Daisy Zane’s fingers curled up a bit, the result was within expectations. Four minutes was enough for him to escape. <br/><br/>But she always wanted to hold on to some hope, just as she insisted on going to Truro City, holding on to that little bit of hope, hoping that Johanes Miles knew something about her grandma. <br/><br/>“Breakfast.” Kevin Clark handed the breakfast through the car window, “It’s from a nearby town, I went to their kitchen and it looked quite hygienic. Have something to eat.” <br/><br/>Daisy Zane took the soy milk and soup dumplings: “You went to their kitchen?” <br/><br/>“Yeah, I saw the ingredients, the meat filling and all that. I checked several places before I found this satisfactory one.” Kevin Clark said, “I also watched them make and steam it.” <br/><br/>Daisy Zane lifted the lid of soy milk and took a sip, then looked at him and said, “Did no one really try to hit you?” <br/><br/>Kevin Clark laughed, “They probably thought I looked too fierce to mess with.” <br/><br/>Indeed, Kevin Clark’s appearance was both enchanting and aristocratic. It looked good, but when he was expressionless, he seemed quite intimidating. <br/><br/>Third Master Clark had enjoyed a luxurious childhood, and was not familiar with the ways of the world, so Daisy Zane could somewhat understand. <br/><br/>She was different, she could eat anything. She even ate tree bark, earthworms... as long as it didn’t poison her to death, she could eat it. <br/><br/>After Daisy Zane finished breakfast, Kevin Clark drove her back. Waiting for the news in any place was the same. <br/><br/>However, he originally wanted to take her back to the hotel for some rest. <br/><br/>But Daisy Zane insisted on going to the film set, so in the end, he drove her there. Read latest chapters at novelhall.com Only<br/><br/>Upon arrival at the film set, he didn’t linger for long. He told her some things to pay attention to, then left in his car. <br/><br/>Throughout the day, Daisy Zane was quite normal, diligently working on the film, communicating with the director and George Dunn. She didn’t talk much but was serious about everything she did. When Anisa Cooper spoke to her, she responded. <br/><br/>So they spent some money and borrowed the neighboring crew’s makeup artist. <br/><br/>On the day of the makeup application, Daisy Zane was asked to arrive at six o’clock in the morning. <br/><br/>So she and Anisa Cooper set off from the Everlasting Palace before five o’clock. <br/><br/>As a result, they waited in the public makeup room until past eight o’clock, but Daisy Zane didn’t receive any notice about her makeup application. <br/><br/>Anisa Cooper first asked about it at six fifty, and the director said the makeup artist hadn’t arrived yet. The second time she asked was at eight ten. <br/><br/>After being away for more than ten minutes, Anisa Cooper came back with a handprint on her face. <br/><br/>At that time, Daisy Zane was browsing the 24 solar terms on her phone, and after many days, she finally confirmed the design draft content. <br/><br/>“Daisy, the makeup artist has arrived and asked you to come over,” Anisa Cooper spoke in a normal tone. <br/><br/>Daisy Zane replied, then closed her phone and stood up. She glanced at Anisa Cooper, who was staring at the ground. <br/><br/>Anisa Cooper’s hair reached her shoulders, but she always tied it up when working. However, this morning she had tied it up before leaving, and it had now come undone. <br/><br/>“Look up.” <br/><br/>Anisa Cooper bit her lip without moving. <br/><br/>Daisy Zane directly gripped Anisa Cooper’s chin and lifted her face. Her hair automatically slid back, revealing the red mark on her right cheek. Daisy Zane extended her index finger and hooked the hair back. <br/><br/>A very clear handprint. <br/><br/>“Who hit you?” <br/><br/>Anisa Cooper’s eyes were red, and although there were no tears initially, as soon as Daisy Zane spoke, the tears started falling, and her mouth trembled. <br/><br/>“Speak up. Who hit you?” <br/><br/>“The...the makeup artist,” Anisa Cooper wiped her tears and cried, “He went to the restroom, and I was waiting outside makeup room 1 for him. But when he came back, he accused me of stealing his ring. Daisy, I didn’t steal it; I didn’t even go in the makeup room when there was no one there.” <br/><br/>Daisy Zane put her phone in her pocket, her eyebrows furrowing in irritation. <br/><br/>“He also...also took my ring away. He said it was his, and then he slapped me.” In a grievance-like manner, Anisa Cooper continued, “That ring was what I bought, intending to use it for my engagement with my boyfriend.” <br/><br/>“So you just stood there and let him slap you? And came back without saying a word?” <br/><br/>Anisa Cooper sniffed, “I was afraid of causing trouble for you. I wanted...wanted to wait until after the makeup was done to say something.” <br/><br/>Daisy Zane looked at her for a while, and then chuckled lightly before turning around and walking out, “Well, trouble has been caused..”\t\t\t\t\t\t</div>", "images": {}, "success": true}