{"id": 62, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223324.html", "title": "Chapter 62 - 62: Standards For Choosing A Spouse", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 62 - 62: Standards For Choosing A Spouse</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 62: Chapter 62: Standards for Choosing a Spouse <br/><br/>Translator: 549690339 <br/><br/>After Elsa finished introducing the matter, Lucia fell silent for a moment before asking Emily, “Are you sure about the information?” <br/><br/>“Certainly accurate,” replied Emily. “It’s info leaked from within Spotlight that just hasn’t been made public yet.” <br/><br/>“Really?” Lucia said. Why didn’t she know? Why had no one told her? <br/><br/>“Yeah,” Emily said. “And the international supermodel’s contract as spokesperson is due to expire this November. They’re definitely going to need a new one.” <br/><br/>On the side, Elsa nodded vigorously like a little chicken pecking at rice. <br/><br/>Emily continued, “When they chose the supermodel as their spokesperson, it was to gain international stature. Now that they have a stable position and the contract is ending, many of their designs are better suited for a domestic spokesperson.” <br/><br/>“Right, right,” Elsa chimed in. <br/><br/>“So, what? You want me to try out to be their spokesperson?” Lucia inquired. <br/><br/>“Yeah, why not seize the opportunity,” said Emily. <br/><br/>“Emily,” Lucia replied, “I’m not famous now, and I don’t have any iconic work. If I become a spokesperson, have you ever thought about how badly I’d get criticized?” <br/><br/>“Fame is indeed important,” Emily agreed, “but you have a face and figure unparalleled in the entertainment industry. You have no idea how striking and eye-catching your face truly is.” Elsa nodded like a pestle once again. <br/><br/>Lucia: <br/><br/>“If I worked for Spotlight, I would definitely choose you,” Emily said. “High-end accessories paired with the ultimate beauty will surely achieve synergistic results.” <br/><br/>Elsa’s nodding ability went back online. <br/><br/>Lucia looked at the two of them somewhat speechlessly. <br/><br/>“Lucia, listen to me on this. We have to seize the opportunity and deal with future matters later,” said Emily. “All the artists are vying for this endorsement; we can’t fall behind.’ <br/><br/>Emily lowered her voice and said, “Amelia Miles has the same idea. She has several dance masterpieces under her belt and has won a few awards. Olivia plans to market her well in the coming days, boosting her popularity and creating a more classical image.” <br/><br/>Lucia: <br/><br/>“Her classical dance is really good, and her image aligns well with some of Spotlight’s designs,” Emily explained. “Even she wants to fight for it, so we can’t give up. What if we end up being chosen?” <br/><br/>“If that happens, Felix Baker must be blind,” Lucia calmly assessed. <br/><br/>Emily looked at her, obviously not wanting to give up this opportunity. <br/><br/>Seeing her like this, Lucia moved her lips but finally advised, “Well... don’t get your hopes up too high.” <br/><br/>“Don’t worry, this is what I do for a living,” Emily responded. <br/><br/>Later, Lucia exchanged contact information with Elsa, telling her to come to the drama crew in two days, and then let her leave first. <br/><br/>Although they did not meet in person, the two talked on the phone every day. <br/><br/>This brought some consolation to Kevin Clark’s heart, even though he was far away in the Imperial Capital. <br/><br/>Daisy’s return to the drama crew with Anisa Cooper saved her a lot of trouble. Anisa was very clever and efficient in her work, and she was a very happy part-timer. <br/><br/>She was happy every day. <br/><br/>She seemed to be careless, but she was actually a very delicate person. <br/><br/>Seeing Anisa’s smiling face every day, Daisy felt that her acting job was a little bit easier. <br/><br/>That day, Daisy was playing a scene where she was captured and subjected to torture. <br/><br/>Riley Maxwell was an undercover agent whose identity was suspected, so she was captured for questioning, and George Dunn was the one responsible for interrogating her. <br/><br/>When Kevin came to visit the set, he saw Daisy tied to a frame, wearing light-colored, tattered clothes stained with blood plasma. <br/><br/>Her face was also covered in blood plasma, with several wounds, and her hair was messy. <br/><br/>According to the director’s assistant’s explanation, they had just filmed a scene where she was beaten. <br/><br/>Kevin’s expression was not very good, as he kept watching Daisy from the equipment. The pace of the director’s assistant’s breathing slowed down. <br/><br/>His attention was all on Daisy, so he didn’t hear the call for action. That’s why when George splashed a bucket of water on Daisy, Kevin’s eyebrows furrowed deeply. In that instant, a fierce aura spread out from him as the center. <br/><br/>A few people around shuddered in fear. <br/><br/>Daisy choked on a few mouthfuls of water and cursed at George. But George was afraid of exposing his identity as well, so he didn’t show any mercy. He released Daisy from the wooden frame where she was tied. <br/><br/>He grabbed her arm, dragged her to the tub, and forced her head into the water, saying, “Tell me, what’s your purpose in coming here? Who’s your contact, and where are they?!” <br/><br/>Only then did he pull Daisy up. <br/><br/>Daisy coughed several times, and that stunningly beautiful face was drowned, but still had a touch of disabled beauty. She said weakly, “I don’t know what you’re talking about. I’ve been framed, someone set me up....” <br/><br/>Before she could finish her words, George pushed her back into the water. After four or five times of going back and forth, the director finally called “cut.” <br/><br/>Daisy sat directly on the ground, coughing. In order to achieve a realistic effect and save the trouble of acting, she purposely choked on quite a bit of water. <br/><br/>Although it was indoors, the weather was a little chilly now, and it had just rained in the morning. She had been splashed with water and dunked in the tub, so she was really cold. <br/><br/>George’s assistant and Anisa both rushed over immediately to give Daisy a towel. Anisa wrapped her up with a towel and then hugged her directly, with teary-red eyes, “Daisy.” <br/><br/>“Cough, cough, cough, cough... it’s fine.” <br/><br/>“Wipe her hair for her,” George said from the side. <br/><br/>George’s assistant picked up the towel to wipe Daisy’s hair, but before he could touch her, someone grabbed his wrist and took the towel away. <br/><br/>He glanced to the side and saw an incredibly handsome man crouching on the ground, wiping Daisy’s hair. <br/><br/>His face didn’t look good, but his movements were gentle..\t\t\t\t\t\t</div>", "images": {}, "success": true}