{"id": 68, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223330.html", "title": "Chapter 68 - 67: Don ‘T Be Angry Anymore", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 68 - 67: Don ‘T Be Angry Anymore</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 68: Chapter 67: Don ‘t Be Angry Anymore <br/><br/>Translator: 549690339 <br/><br/>“Action. ” <br/><br/>It was past one in the early morning, and sixteen minutes had passed since the tracker stopped moving. They had been there for about three minutes now. <br/><br/>Kevin Clark’s men surrounded the entire courtyard from the outside. <br/><br/>At the sound of his order, the voice transmitted through earpieces, and everyone moved in at once. <br/><br/>It didn’t take long for them to search the courtyard, and when they entered the ground floor they began searching each room. Meanwhile, Daisy Zane went straight upstairs. <br/><br/>On the top floor was a single room, with its entrance directly across from the staircase. <br/><br/>Daisy went upstairs and immediately kicked open the door to the room. <br/><br/>As he tried to enter, Kevin pulled her back, entered the room first, and Daisy followed close behind. <br/><br/>After that, Michael Jackson and Allonzo Hobson also entered the room. <br/><br/>The four of them checked every possible hiding place in the room and found no clothes, let alone any people. <br/><br/>If it wasn’t for the footsteps in the courtyard and the fact that there wasn’t even any dust inside the house, they couldn’t be sure anyone had ever been there. <br/><br/>“Third Master, there’s no one on the first floor,” Thomas Firway reported. <br/><br/>Daisy went to the window and stood there for a while, then fully opened the half-drawn curtains. <br/><br/>On the edge of the windowsill, an empty wine glass sat on top of a note, with the tracker beside it. <br/><br/>With one hand holding the wine glass, Daisy pulled the note out with the other. <br/><br/>Written on it was: “See you later.” <br/><br/>There was a time noted: 00:56 <br/><br/>And another word below: Yan (Inkstone). <br/><br/>Seeing the note, Kevin and the others couldn’t help but check the current time. <br/><br/>It was 1:05 now. Updated from novelbIn.(c)om<br/><br/>No one spoke. Allonzo, Thomas, and Michael immediately turned and left the room. Soon, their voices could be heard from downstairs, ordering others to search the bamboo forest and block all nearby roads. <br/><br/>They had reached the outskirts of the bamboo forest at one o’clock, which meant that whoever was in the courtyard had left four minutes before they arrived. <br/><br/>The person must have been aware of the tracker and decided to flee. <br/><br/>Daisy looked at the note in her hand, clearly a provocation, or perhaps a warning to her. For a moment, she clenched the note in her palm. At the same time, her hand pressing on the wine glass crushed it. <br/><br/>But his deliberate emphasis on the “person behind 319” was probably to confirm whether her so-called “master” and “creator of 319” were the same person. <br/><br/>So she accepted it. <br/><br/>Alice Eugene always took orders only from that man, and she always accompanied him. So wherever Alice Eugene was, that man must be there as well. <br/><br/>Given that man’s character, he always wanted to be in control of everything. He wouldn’t run errands in such a place for someone else, so there wouldn’t be any cooperation between him and others. <br/><br/>He must be the one leading the 319 drug. <br/><br/>In fact, if it hadn’t been for encountering Alice Eugene today, Daisy Zane wouldn’t have known that the 319 drug was related to that man. <br/><br/>She should have noticed it long ago. That man had been spending every day in the laboratory, and every time he visited her, he carried the smell of elixir. And 319, 319... if she had it calculated correctly. It should have been March 19th that year. <br/><br/>That man picked her up... <br/><br/>The drug she had worked so hard to investigate and that man turned out to be the same person... <br/><br/>So... that incident also happened because of her, it was she who caused the death of... <br/><br/>“Lucia? Lucia... <br/><br/>Daisy Zane suddenly came back to her senses when she heard Kevin Clark’s voice and looked at him. <br/><br/>“What’s wrong? Are you feeling unwell?” Kevin Clark asked. <br/><br/>Daisy Zane lowered her gaze, pressed her temples, and said, “It’s nothing; I’m probably just a little tired.” <br/><br/>“Sleep in the car for a while? Or should I take you home first?” <br/><br/>“Let me sleep for a while. In case there’s news.” <br/><br/>“Alright.” <br/><br/>Kevin Clark reclined his seat a bit, covered her with his coat, and then rubbed her head, saying, “Sleep.” <br/><br/>Daisy Zane closed her eyes, and amidst the jumble of thoughts in her mind, she gradually fell asleep. <br/><br/>She had a dream about that man. <br/><br/>In her dream, that man was sitting by her bed, but she couldn’t see his face clearly. <br/><br/>She heard his gentle voice, “Let’s name it Enigma Starry.” <br/><br/>“Enigma Starry?” <br/><br/>“Yes, Enigma Starry refers to Mars,” the man said patiently, “My name has a <br/><br/>‘Yan’ character in it, which belongs to the Earth element in the five elements. Enigma Starry is of the Fire element, and fire generates earth.” <br/><br/>At this point in the dream, Daisy Zane suddenly awoke. <br/><br/>She opened her eyes, and after a moment, she realized that the sky was already bright, with a grayish hue. She had been sweating heavily, and the clothes inside were wet....\t\t\t\t\t\t</div>", "images": {}, "success": true}