{"id": 66, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223328.html", "title": "Chapter 66 - 66: Enigma Starry", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 66 - 66: Enigma Starry</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 66: Chapter 66: Enigma Starry <br/><br/>Translator: 549690339 <br/><br/>“You’re still alive.” <br/><br/>The woman suddenly moved closer to Daisy Zane, speaking in a sinister tone. Daisy Zane sneered, looking at her eyes flightily, without saying a word. <br/><br/>“You heartless wretch.” The woman cursed at her. <br/><br/>“What’s the point of cursing.” The smile on Daisy Zane’s face became more prominent, eerie. “If you have the guts, kill me. You must dream of seeing me dead. ” <br/><br/>As soon as she finished speaking, Daisy Zane’s wrist was grabbed, while the woman released her at once, avoiding Arthur North’s attack, retreating a few steps back. This chapter is updated by nov(e)(l)biin.com<br/><br/>Daisy Zane smelled the scent of Eaglewood, her expression quickly returned to normal. <br/><br/>“Are you alright?” Arthur North looked at her. <br/><br/>“I’m fine.” Daisy Zane shook her head, kicking away someone nearby. <br/><br/>“Be careful.” After saying that, Arthur North let go of her to confront the woman. <br/><br/>After that, Daisy Zane became a bit more serious in fighting, but still intentionally hid her true strength. <br/><br/>Not long afterwards, the opponents were losing. After taking down two people, Daisy Zane went to find Arthur North. <br/><br/>She felt that if she didn’t interfere, Arthur North might kill that woman soon. <br/><br/>Therefore, Daisy Zane picked out a man next to the woman, after engaging him for a couple of moves, she deliberately let him kick her. She retreated several steps, directly bumping into Arthur North. <br/><br/>Arthur North didn’t have time for anything else and first steadied her. <br/><br/>Allonzo Hobson didn’t know what to say because he had seen it too. <br/><br/>Further provoked by this, Thomas Firway got even angrier: “You came here on purpose, to create chaos. You deliberately got close to our Third Master, you... <br/><br/>mmph mmph mmph...” <br/><br/>Before he could finish, Allonzo Hobson covered his mouth. <br/><br/>Because he saw the terrifying gloom on Arthur North’s face, who was on the phone not far away. <br/><br/>He had not seen Arthur North so intimidating in a long time. <br/><br/>If Thomas Firway kept talking, he was sure that nobody present would get away unharmed. <br/><br/>When Arthur North got angry, it was no less than the end of the world. <br/><br/>Thomas Firway’s eyes were red with fury. <br/><br/>Eventually, Daisy Zane also looked up from her cell phone screen to glance at Thomas Firway: “If I was really on their side, do you think you would still be alive?” <br/><br/>As soon as she finished speaking, Arthur North walked over. <br/><br/>From beginning to end, he did not say anything or ask any questions. He was not a person who was driven by emotions, but on such an important matter, he chose to trust her unhesitatingly. <br/><br/>Daisy Zane handed her cell phone to Arthur North. <br/><br/>Arthur North took it and noticed a map on the screen, with a red dot moving on it. <br/><br/>He raised an eyebrow slightly. <br/><br/>“I suggest deploying more manpower.” Daisy Zane’s voice was colder than usual..\t\t\t\t\t\t</div>", "images": {}, "success": true}