{"id": 64, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223326.html", "title": "Chapter 64 - 64: Red Cliff Village Address", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 64 - 64: Red Cliff Village Address</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 64: Chapter 64: Red Cliff Village Address <br/><br/>Translator: 549690339 <br/><br/>After dinner, Daisy Zane returned to her room, and Kevin Clark worked on some tasks as he saw it was still early. <br/><br/>At around 8 0’clock, Kevin Clark made a phone call to Allonzo Hobson. <br/><br/>“When can you get here?” <br/><br/>“I’m here, I’m upstairs with my mom.” Allonzo Hobson said, “Didn’t you see my message? I’ve been sending it for several hours.” <br/><br/>Kevin Clark’s gaze paused for a moment as he browsed the files, then he silently said after two seconds: “Leave at 9 0’clock.” <br/><br/>“Hmm, got it.” <br/><br/>Kevin Clark hung up and opened his WhatsApp. <br/><br/>In the afternoon, there were quite a few unread messages, but he was sure he had looked at them all, just not seeing any messages from Allonzo Hobson. Updated from novelb(i)n.c(o)m<br/><br/>Allonzo Hobson’s name had already been pushed down to the bottom. He clicked on it and then gently raised an eyebrow. <br/><br/>It was a little past eight, and the sky was completely dark. <br/><br/>Daisy Zane changed into a black outfit, secured her hair with a hairpin, and left the room. <br/><br/>When she arrived at the living room, Anisa Cooper, who was writing on the tea table, looked up at her: “Daisy, what’s up? Anything wrong?” <br/><br/>After asking, Anisa Cooper looked at her clothes and finally realized that she was probably going out. <br/><br/>“I’m going out for a bit.” <br/><br/>“Should I... go with you?” Anisa Cooper asked, her voice involuntarily getting quieter. <br/><br/>She suddenly remembered the man who had taken Daisy Zane away this afternoon and felt that she might have touched on something private. <br/><br/>And what flashed through her mind was that Daisy was having a clandestine rendezvous with a man – how exciting! <br/><br/>“No need.” Daisy Zane said, “You don’t have to wait for me, go to sleep if you’re sleepy.” <br/><br/>“Ah. Okay.” Anisa Cooper replied, hesitating a bit before saying, “Daisy, there are a lot of paparazzi around the hotel, be careful.” <br/><br/>Daisy Zane then left the room. <br/><br/>As she stood before the elevator, preparing to press the button, a déj? vu scene occurred. <br/><br/>Before she could press the button, the elevator door opened, and Kevin Clark was standing inside. <br/><br/>In that instant when their eyes met, it was as if they were back to their first encounter at the Doomsday Hotel. <br/><br/>Same scenario, same people. <br/><br/>Both of them seemed to freeze for a moment. After a few seconds, just when the elevator door was about to close, Kevin Clark blocked it with his hand: <br/><br/>So... choosing Red Cliff Village had its own special reasons. <br/><br/>“According to the information on the household registration at the time, the person they found was consistent with the information provided by the neighbors. However, this person did not move away more than 20 years ago; he disappeared. He disappeared completely, and there were no traces of him left.”&amp;thinsp; <br/><br/>“Either he died, or he had a new identity and is still living,” Daisy Zane said. Allonzo Hobson couldn’t help but glance at Daisy Zane. Her voice was terribly cold, so cold that she seemed to have a heart of steel and no emotions. <br/><br/>Moreover, the thought process of an ordinary person would not be like this. <br/><br/>“And this person is a Doctor of Medical Formulation,” Kevin continued, “The main thing is that the people in the village don’t know that they have such a high level of education.”&amp;thinsp; <br/><br/>“What about his family?” <br/><br/>“He grew up with his aunt. Before moving away, he left a large sum of cash for his aunt, and then they lost contact.” <br/><br/>“Are they looking for something, or deliberately trying to draw you guys there?” Daisy Zane immediately addressed the key point. <br/><br/>Both Michael Jackson and Thomas Firway looked at her. <br/><br/>“The latter seems more likely,” Kevin raised his eyebrows. <br/><br/>. So, tonight you guys are going for a head-on confrontation.”&amp;thinsp; <br/><br/>“Yes,” Kevin answered, “If they still go there tonight.” <br/><br/>Daisy Zane: . <br/><br/>“So, Daisy, you should know that what you did just now was very dangerous, ” Kevin’s voice became a bit more serious.&amp;thinsp; <br/><br/>Daisy glanced at him without saying a word, picked up a cracked pistachio, put it in her mouth, and ate it slowly.&amp;thinsp; <br/><br/>But Kevin could tell from her expressionless face that she was thinking: It’s not yet clear who is in danger. <br/><br/>“These pistachios are quite delicious.” <br/><br/>Kevin Clark: <br/><br/>“They really are delicious.” <br/><br/>Kevin, speechless, finally smiled: “Well, they’re all for you. I’ll bring a few bags to the film set tomorrow.” &amp;thinsp; <br/><br/>Allonzo Hobson, Michael Jackson, and Thomas Firway: <br/><br/>“I didn’t intend to keep it from you,” Kevin explained, “I planned to tell you after tonight.”&amp;thinsp; <br/><br/>The other three people had puzzled expressions on their faces, still unable to understand why Kevin had shared this information with her. <br/><br/>Especially Thomas Firway, his gaze made it clear that he thought Daisy Zane was a dangerous woman, who had caused Kevin to cross the line and tell her about the important matters. <br/><br/>Daisy looked up at Kevin again. <br/><br/>He didn’t have to tell her all this. It was her who had secretly checked his cell phone. <br/><br/>As if he had seen through her thoughts, Kevin smiled and said, “You can check my cell phone at any time. I won’t change the password.” <br/><br/>Upon hearing this, Allonzo Hobson couldn’t help but twitch his lips. In all his years, he had never seen Kevin this “capable” before..\t\t\t\t\t\t</div>", "images": {}, "success": true}