{"id": 65, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223327.html", "title": "Chapter 65 - 65: Mysterious Woman", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 65 - 65: Mysterious Woman</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 65: Chapter 65: Mysterious Woman <br/><br/>Translator: 549690339 Updated from novelbIn.(c)om<br/><br/>“Michael Jackson, you stay behind.” <br/><br/>At 8:50, when Kevin Clark was about to set off, he said these words. <br/><br/>Everyone was taken aback, especially Michael Jackson. However, he didn’t dare to argue with Kevin Clark’s words and just stood there without a word. <br/><br/>“Arthur North, you’re not going to bring Lady Zane with you, are you?” Allonzo Hobson asked. <br/><br/>“Yes.” <br/><br/>“Third Master, how can you bring her along? She’s a woman.” Thomas Firway said, “It’s dangerous tonight, bringing her will slow us down...” <br/><br/>Kevin Clark looked at him, and with just a glance, Thomas Firway felt an immense pressure, and the following words got stuck in his throat. <br/><br/>However, even though he didn’t say it out, his expression clearly showed his disagreement. He didn’t approve. <br/><br/>“If you think she’s going to slow you down, you can stay behind and let Michael Jackson follow us.” Kevin Clark spoke slowly. <br/><br/>Michael Jackson, standing behind Thomas Firway, subtly poked his waist with his finger. <br/><br/>Getting the hint, Thomas Firway glanced at Daisy Zane and lowered his head, saying, “Third Master, I was wrong.” <br/><br/>Kevin Clark ignored him and moved straight to the entrance. <br/><br/>As Daisy Zane passed by Thomas Firway, she stopped in front of him, looking triumphant and challengingly raised her eyebrows. <br/><br/>She just fell short of saying: I’m deliberately following along to slow you all down. <br/><br/>Thomas Firway was dumbstruck. <br/><br/>If it wasn’t for Michael Jackson patting his head, he might have been steaming with anger on the spot. <br/><br/>“Arthur North, you know how dangerous this trip will be.” Allonzo Hobson walked beside Kevin Clark, speaking softly, “You’ll let Lady Zane face this danger? Can you bear it?” <br/><br/>“I can’t.” <br/><br/>“Huh?” Allonzo Hobson felt that there was a trap in his smile. <br/><br/>“But I won’t stop her from doing what she wants.” <br/><br/>“Hmm?” <br/><br/>Allonzo Hobson didn’t quite understand the meaning of these words, but he was sure that the final expression of Kevin Clark was to despise him. <br/><br/>The four of them went to the hotel’s parking lot together and got in the car. <br/><br/>Thomas Firway drove, Allonzo Hobson was in the copilot’s seat, and Daisy Zane and Kevin Clark were in the back. <br/><br/>As the car left the parking lot, Allonzo Hobson opened the car’s center console and handed Kevin Clark a paper bag. <br/><br/>Inside the bag was a gun, which Kevin Clark took out and placed behind his back directly. <br/><br/>Allonzo Hobson said, “Arthur North, there won’t be another encounter with that person tonight, right?” <br/><br/>Kevin Clark didn’t make a sound but glanced at Daisy Zane instead. <br/><br/>Daisy Zane appeared indifferent, clearly uninterested in the “person” Allonzo Hobson was referring to. <br/><br/>“Third Master, you indeed have courage.” A woman’s voice said, “You haven’t disappointed me, though you’re a bit later than I expected.” <br/><br/>There was no reaction from the three of them, but at the sound of the voice, Daisy’s loose fingers suddenly trembled a little. <br/><br/>“Enough with the false flattery.” Kevin Clark gripped Daisy’s hand and gave it a squeeze, “You went to great lengths to lure me here, what do you want to do?” <br/><br/>The woman laughed: “Of course, I want to kill you.” <br/><br/>Xavier Dominic and Thomas Firway both tightened their grips on their guns as their faces grew darker. <br/><br/>“It took us years to build the place, and Third Master destroyed it overnight.” The woman said, “The report we collected gradually, Third Master took away. A rival like Third Master, of course, it’s better to get rid of him early.” <br/><br/>“Do you think you can insult people like that just because there are a few of you?” <br/><br/>“There are ten of us, and only four of you.” The woman said, “I knew Third Master would come and not bring many people. Because you are too eager to see us, you want to learn things from us. Afraid to scare us away.” <br/><br/>“No, you’re wrong. Even with just four of us, we can handle you all.” <br/><br/>What she said indeed reflected Kevin Clark’s concerns, but he also had confidence in himself and his people. <br/><br/>If they brought too many people, they would be detected. Likewise, if the other side brought too many people, they would naturally be detected as well. <br/><br/>Under no agreement, both sides had settled on bringing just one car. However... He didn’t expect the opponent’s car to be bigger and overloaded. <br/><br/>“You’re too arrogant.” <br/><br/>“You’re the overconfident one.’ <br/><br/>“Really? Let’s give it a try.” The woman finished speaking and gently waved her hand. The people behind her immediately rushed over. <br/><br/>Instinctively, Kevin Clark moved Daisy behind him, but she charged out from the other side as soon as she was placed behind him, landing a kick on their opponent’s wrist. <br/><br/>Just like that, both groups were fighting. It’s worth mentioning that each of their ten opponents was formidable. <br/><br/>Even though Kevin Clark and Daisy were both strong, it took them some time to gain the upper hand. Even more so since Daisy seemed a little off today. <br/><br/>She was focusing on defense more than offense and kept moving closer to the woman, her maneuvering crafty. <br/><br/>Kevin Clark wanted to go to her side to protect her but couldn’t keep up with her repositioning. <br/><br/>Finally, after dodging, Daisy squared off against the woman. <br/><br/>This woman’s strength was far greater than that of Lucia’s underlings. After exchanging a move, Daisy could feel it. Or maybe she knew it all along. <br/><br/>However, Daisy still didn’t show her true skill, but took the opportunity while striking to fiercely yank the woman’s hair. <br/><br/>A very underhanded move. <br/><br/>The woman was clearly shocked and angered by Daisy, and her next move was even more ruthless. <br/><br/>However, when the woman reached out to strike, Daisy moved her face under the woman’s hand, letting her scrape off her mask. <br/><br/>The night was black, lit only by the dim street lamp. <br/><br/>At first, the woman did not pay much attention to Daisy, and didn’t even look at her properly. Especially after feeling how weak Daisy was, she didn’t see her as a threat. <br/><br/>But when the mask was removed, the woman saw Daisy’s face crystal clear. <br/><br/>A face so stunning that it stood out even in the dark, a face that she would never forget in her life. <br/><br/>The punch the woman wanted to throw was immediately withdrawn. And even when a man on the side struck Daisy, the woman kicked him away....\t\t\t\t\t\t</div>", "images": {}, "success": true}