{"id": 67, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223329.html", "title": "Chapter 67 - 66: Enigma Starry_2", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 67 - 66: Enigma Starry_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 67: Chapter 66: Enigma Starry_2 <br/><br/>Translator: 549690339 <br/><br/>Allonzo Hobson covered up Thomas Firway’s mouth and came over for a glance. Seeing the moving red dot on the cell phone, he was taken aback for a moment. He looked at Daisy Zane, “What the fuck? This is insane.” <br/><br/>“With their speed, they’ll be out of this forest in half an hour at the fastest.” Daisy Zane said, “Half an hour for deployment.” <br/><br/>“Xavier, call the Director Giovanni, ” Kevin Clark looked at Thomas Firway, his voice lowering, “Thomas, bring all your people.” <br/><br/>Both men started making phone calls, and Kevin Clark rubbed Daisy Zane’s head, “Daisy, don’t be mad.” <br/><br/>Daisy Zane glanced at him and ignored him. <br/><br/>Kevin Clark’s mouth twitched, ‘ <br/><br/>It was tough to determine the route taken by the two people in the forest with their multiple turns. To avoid wasting effort, they had to deploy on every road and pursue the two after they left the forest. <br/><br/>Forty minutes later, the pair left the forest. <br/><br/>Kevin Clark and his team immediately chased after them in cars. <br/><br/>The location of the duo paused for fifteen minutes, then their speed picked up, probably because a car had picked them up. Updated from novelbIn.(c)om<br/><br/>Thomas Firway’s car raced fast along the rough road, bouncing a bit inside. <br/><br/>After a while, he couldn’t help but ask, “Why release the woman instead of the others? She must know more than the others.’ <br/><br/>Daisy Zane looked at the back of his head, didn’t really want to pay attention to him, but couldn’t help it. <br/><br/>“Capturing that woman is no different than capturing a corpse. She won’t reveal anything. As for the others, little thugs. Do you think they could even meet their boss? You understand ‘capture the thief to capture the king’?” Daisy Zane spoke slowly. “Young man, think a little more. If your brain doesn’t move, it’ll rust.” <br/><br/>“You...” Thomas Firway kept his mouth shut, stayed silent for a moment, and muttered, “How do you know the woman can see their boss? How do you know she’s going to meet her boss?” <br/><br/>When told to think, he really thought right away. <br/><br/>The man exerted more force and then spoke, his voice no longer gentle but gloomy, “You touched her!” <br/><br/>Alice Eugene stepped back, her head lowered, not daring to breathe heavily. Deep in her eyes, along with fear and hatred, there was also jealousy. <br/><br/>“I, I didn’t—really, I didn’t!” <br/><br/>“Really?” <br/><br/>Alice Eugene’s head lowered even more, “He didn’t touch her. I stopped it.” <br/><br/>The man lifted his foot off the man’s hand and walked towards the window, looking down at the ring on his index finger. <br/><br/>The silver ring bore a distinctive totem, seemingly chaotic, but the letters “YH” were discernible. It was an abbreviation for Enigma Starry. <br/><br/>After a while, the man’s voice sounded again, and he turned to look at Alice Eugene, “Is she with Kevin Clark?” <br/><br/>“Yes,” Alice Eugene replied. <br/><br/>With a hint of indulgence and darkness in his tone, the man suddenly chuckled, “She’s really naughty.” Alice Eugene dared not speak. “All right, get out of here.” <br/><br/>“Yes.” <br/><br/>After replying, Alice Eugene went to help the man on the ground. However, as soon as she bent over, the man’s voice rang out once more, “Don’t move.” Alice Eugene immediately froze. <br/><br/>The man walked over to her, leaned down, and picked up an incredibly small black object resembling a button from her hair. Then, looking at Alice Eugene, he asked, “What’s this? A tracker?” <br/><br/>The object blended with her hair, but the man spotted it right away. <br/><br/>Alice Eugene’s pupils shrank, and she fell to her knees, “I-I... it was Lucia, she pulled my hair.” <br/><br/>The man looked at her, and Alice Eugene kept her head down, not daring to look up. A drop of sweat fell to the floor within seconds. But after a few seconds, the man straightened up. <br/><br/>Alice Eugene suddenly exhaled a breath of relief. <br/><br/>He held the tracker, smiling and saying, “Little Enigma has grown up, starting to help outsiders deal with her elder brother..”\t\t\t\t\t\t</div>", "images": {}, "success": true}