{"id": 63, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223325.html", "title": "Chapter 63 - 63: Finished Drinking This Cup Of Ginger Tea", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 63 - 63: Finished Drinking This Cup Of Ginger Tea</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 63: Chapter 63: Finished Drinking This Cup of Ginger Tea <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane coughed for a while, feeling her breathing eased, and immediately smelled the scent of Eaglewood. <br/><br/>She turned her head and glanced to the side, only to see Kevin Clark with a gloomy face, wiping her hair. <br/><br/>“Third Master.” <br/><br/>Kevin Clark looked at her but didn’t say anything. <br/><br/>It was only now that Anisa Cooper looked up at the person beside her. Her eyes widened instantly, and she sighed once again about the man’s good looks following Daisy Zane. <br/><br/>She was close and could see it clearly. The man in front of her had a delicate appearance, as if it was carefully drawn bit by bit. <br/><br/>However...the surrounding intimidating aura was a bit frightening. After Anisa Cooper glanced at it, she dared not look again. <br/><br/>She took the thermos cup, opened it, and handed it to Daisy Zane: “Daisy, have some hot water to warm up.” <br/><br/>Daisy Zane took it and drank two sips. “Feeling better?” Kevin Clark finally spoke. <br/><br/>“Yeah, I’m fine.’ <br/><br/>Kevin Clark felt impatient listening to her nonchalant tone: “Change your clothes; we’re going back to the hotel.” <br/><br/>“I still have a few close-ups to shoot.” Daisy Zane replied. <br/><br/>Kevin Clark’s lips tightened as he looked at her. For a moment, he wanted to pick her up and take her away. But thinking that Daisy Zane would get angry, he resisted and didn’t do it. <br/><br/>Daisy Zane looked at his gradually greenish face and blinked: “Third Master?” Kevin Clark glanced at her again, then got up and looked at George Dunn. <br/><br/>Feeling the murderous gaze, George Dunn suddenly swallowed nervously. <br/><br/>Then Kevin Clark walked quickly to the equipment and said to the director, “Hurry up and shoot.” <br/><br/>“Yes, yes.” The director immediately arranged the walkie-talkies. <br/><br/>Afterward, Kevin Clark watched as Daisy Zane was pressed into the water tank twice. This time, her close-up was even clearer in the equipment. <br/><br/>His hands hanging at his side tightened bit by bit, and his face tensed. <br/><br/>Actually, he could feel that Daisy Zane didn’t like acting very much. Even sometimes, he could feel her disgust. <br/><br/>She did have a talent for acting, and she performed well. <br/><br/>But she didn’t like it; she was just very serious and treated this matter earnestly. She immersed herself completely, even though she might have dissected her previously hidden inner self. <br/><br/>It was only to act well and empathize with the characters. <br/><br/>After discovering this, Kevin Clark didn’t understand why she chose this path and why she had to suffer. <br/><br/>After the shoot was over, Anisa Cooper accompanied Daisy Zane to the changing room to change her clothes. As soon as they came out, Kevin Clark put his suit jacket on her and led her away by her wrist. Updated from novelbIn.(c)om<br/><br/>“Hey? Third Master.” <br/><br/>Feeling her icy wrist, Kevin Clark ignored her and took her directly to his car. <br/><br/>Michael Jackson was sitting in the driver’s seat, watching Kevin Clark put Daisy Zane in the car and then moving to the other side to get in the car as well. <br/><br/>“Lady Zane.” Michael Jackson called her, then handed her a cup of ginger tea, “Third Master asked me to buy it.” <br/><br/>After a long shower, Kevin Clark told her to dry her hair. <br/><br/>Daisy’s patience was exhausted, and she sat on the sofa, muttering, “Troublesome.” <br/><br/>Kevin Clark looked at her. <br/><br/>Daisy said bluntly, “Third Master, you’ll tire yourself out like this. Hair will dry even without blowing.” <br/><br/>Kevin Clark laughed and said, “How about I blow it for you?” <br/><br/>Daisy’s hand drying her hair paused, and she said after a moment, “As you please.” <br/><br/>The smile on Kevin Clark’s face deepened, and he picked up the hairdryer and stood behind the sofa. <br/><br/>He tested the temperature of the hot air and gently blew her hair. <br/><br/>Kevin Clark’s movements were gentle and restrained. By the time he finished drying her hair, twenty minutes had passed. <br/><br/>In a little while longer, Daisy would have fallen asleep. <br/><br/>“I said it was troublesome.” <br/><br/>“No trouble.” Kevin Clark rubbed the top of her head, the corner of his mouth raised as he appeared to be in a great mood. <br/><br/>Daisy looked up at him and then asked, “Can I use your phone?” <br/><br/>Kevin Clark handed his phone to her directly: “The password is 128000.” <br/><br/>After saying that, he put away the hairdryer and returned to the restroom. <br/><br/>Daisy unlocked the phone with the password, revealing Kevin Clarks WhatsApp interface. <br/><br/>And almost the entire page was unread messages. <br/><br/>Daisy wasn’t interested in other people’s privacy and immediately pressed the back button, but accidentally pressed a message at the bottom of the screen. <br/><br/>The phone screen changed to a chat page. <br/><br/>She tried to press the exit button, but after seeing the chat history at the top, she didn’t move. <br/><br/>The latest message was sent by Allonzo Hobson: [I’m at the hotel, accompanying my mom. Call me before the evening action.] <br/><br/>At the top of this chat page was a detailed address for Red Cliff Village, specific to which row and number. <br/><br/>Further down was a message from Allonzo Hobson: [Related to 319?] <br/><br/>Kevin Clark: [Yes, someone went there at night.] <br/><br/>Soon, Kevin Clark came out of the restroom. Hearing his footsteps, Daisy casually exited the page, opened the dialing page, and dialed a number from memory. <br/><br/>The call was quickly answered: “Hello.” <br/><br/>“Naomi, it’s me,” Daisy said, “You can take the nanny car back to the hotel, and you don’t have to worry about dinner for me.” <br/><br/>“Okay, Daisy.” <br/><br/>Kevin Clark sat on a single sofa next to her, and after she hung up, he asked, “What do you want to eat tonight?” <br/><br/>“Porridge,” Daisy gave the phone back to him. <br/><br/>“Okay..”\t\t\t\t\t\t</div>", "images": {}, "success": true}