{"id": 78, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223341.html", "title": "Chapter 78 - 76: Be Honest", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 78 - 76: Be Honest</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 78: Chapter 76: Be Honest <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane knew that Kevin Clark liked her, and it seemed that he liked her a lot at present. However, she had never thought that Kevin Clark’s affection for her would last. <br/><br/>What does Third Master lack? If he wanted, women could be different every day. Why stick to her alone? <br/><br/>She was young, beautiful, had a pulling appearance, a poor background, a rare personality, and after getting to know her, a mysterious identity. <br/><br/>Anyone would be curious. <br/><br/>But how long it could last, she didn’t know. <br/><br/>Indeed, she found Kevin Clark quite pleasing to the eye. Both his character and his appearance were to her liking. <br/><br/>But... she had always admired beautiful things, just to appreciate. <br/><br/>Therefore, they were practically meeting each other’s needs at the moment. Even if they parted ways in the future, it wouldn’t be a loss. <br/><br/>“Lucia, I’m afraid you’ll be taken advantage of.” Robinson Scott eventually returned to his senses, “After all, you’re a girl, with a blank slate when it comes to relationships, whereas he... with all his romantic history, could be considered quite experienced.” <br/><br/>Daisy Zane’s lips moved, “You’re overthinking it. This is purely on a personal level. It won’t cross into anything physical.” <br/><br/>“Is it? But you two were just embraced.” <br/><br/>Daisy Zane didn’t say anything. <br/><br/>Robinson Scott quickly changed the subject: “It was just a hug. How normal. A few years ago, James Collins used to cling to your leg crying his heart out all the time.” <br/><br/>Daisy Zane lowered her eyes: “How’s everything on D Continent?” <br/><br/>“While the clam and crane fight, the fisherman profits. They’re letting others take advantage. Regards to the present, things are at a standstill. Lucia, are you going to the film set tomorrow?” <br/><br/>“Hmm.” <br/><br/>“I’ll come with you.” Robinson Scott said, “I’ll be your assistant, perhaps the director would think I’m pretty and even give me a role.” <br/><br/>“I have an assistant.” <br/><br/>“Lucia.” Robinson Scott put on a pitiful face. Daisy Zane: “...Whatever you want.” <br/><br/>“Good.” <br/><br/>At the Sky Rights Hotel, Clarissa Mason had just taken a bath. Dressed in a bathrobe, she poured a glass of red wine for herself and another for the person next to her. <br/><br/>“Brother Joseph, it’s rare for you to visit Truro City. Don’t you want to visit the film set?” Clarissa Mason asked in a soft voice, “As the producer and the investor, aren’t you curious?” <br/><br/>But as she passed by Joseph Johnson, he reached out to stop her, “Miss Zane, it’s fate that we meet, don’t you think?” <br/><br/>Daisy Zane glanced at his outstretched arm. <br/><br/>Joseph Johnson stepped back a bit, looking at her, “Miss Zane, you haven’t settled on your next drama role yet, have you? I’ve just taken a liking to a script and plan on investing in it. How about we collaborate once more?” <br/><br/>Daisy Zane clenched the clothes in her hand. <br/><br/>Suddenly, Joseph Johnson moved in closer, “Don’t worry. I don’t have the energy to maintain a long-term lover now. One night will be enough. Miss Zane, trading one night for a script sounds like a good deal, huh?” <br/><br/>The warm breath tickling her face, Daisy Zane suddenly felt queasy. She tossed her clothes onto a chair nearby and pushed him on the shoulder, simultaneously tripping him up. <br/><br/>Joseph Johnson went “thump” and fell to the ground. <br/><br/>Daisy Zane kicked him once more. He grunted but didn’t manage to utter curse before wincing in pain. He was kicked two meters away, curling up and cradling his stomach, unable to speak. <br/><br/>Daisy Zane slowly walked over to him, kicked his shoulder, forcing him onto the ground, then stepped on his chest. <br/><br/>Joseph Johnson gasped harshly, panting heavily and attempting to speak, “What...what are you doing... I’m... the producer... and also investor... I won’t let you... continue in the crew...” <br/><br/>“Oh really?” Daisy Zane responded with an unconcerned tone, her eyes flickering with a malice and mischief as she took out her cell phone, opening a file. <br/><br/>The file had been compiled during the casting for the drama when Clarissa <br/><br/>Mason had taken her role. While investigating the capitalists behind Clarissa <br/><br/>Mason and Olivia Chester, she also found a series of scandals concerning Joseph Johnson. <br/><br/>She hardly had time to use it back then, and the issue was resolved by Kevin Clark. But it seemed to have found its usefulness today. <br/><br/>Daisy Zane bent down, stepping a bit harder on his leg and showed him the phone’s screen, “Looks familiar, doesn’t it? These things.” <br/><br/>As Daisy flipped through them one by one, Joseph’s eyes grew wider, his complexion getting paler, even cold sweat breaking out. <br/><br/>There was fear in his eyes. <br/><br/>Tired of flipping, Daisy Zane put away her phone, stood upright, and removed her foot from him, “How do you think you’ll end up if I leak just a few of these?” <br/><br/>“You... where did you get these things that defame me, I’m going to sue you for spreading rumors.” <br/><br/>Daisy Zane softly laughed, “My possession of these files is enough proof of their veracity. If you want to sue me, go ahead. After all, in the end, it’s clear who will fall.’ <br/><br/>“Who... who are you, really!” <br/><br/>“Better behave.” Daisy Zane looked down at him condescendingly, “If I encounter any unfair treatment in the crew, or if you try to trip me up behind my back, these files will be public immediately. Make your decision.” <br/><br/>After speaking, Daisy Zane turned to pick up her clothes from the chair and left..\t\t\t\t\t\t</div>", "images": {}, "success": true}