{"id": 72, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223334.html", "title": "Chapter 72 - 70: What’S The Matter?", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 72 - 70: What’S The Matter?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 72: Chapter 70: What’s the Matter? <br/><br/>Translator: 549690339 <br/><br/>“What a perfect match.” <br/><br/>Kevin Clark hid behind a wall, peeking his head out and watched Arthur North and Daisy Zane’s silhouettes standing outside. <br/><br/>Seeing Arthur North take off his trench coat and put it on Daisy, Kevin clenched his fists and excitedly hit the wall. <br/><br/>“Hmm, they really are a perfect match.” <br/><br/>Suddenly, a voice came from behind, scaring Kevin. He quickly covered his mouth and looked back to see who it was. <br/><br/>He saw that there were four people standing behind him: Allonzo Hobson, <br/><br/>Michael Jackson, the director, and the director’s assistant. <br/><br/>“Young Master Hobson, Director,” Kevin said nervously. <br/><br/>“You’re bold, spying like this,” Allonzo said, also peeking out at the scene, “Well... a handsome man and a beautiful woman. <br/><br/>“I, I just wanted to take a look,” Kevin stammered. <br/><br/>Allonzo looked at Kevin’s swollen face and didn’t tease him any further. <br/><br/>The director urged, “Naomi, why don’t you ask if the makeup artist is available? <br/><br/>The stage outside is set, but we can’t film the scene without the makeup.” <br/><br/>“I, I should ask?” Kevin glanced at Allonzo, Michael, and the director before hesitating. <br/><br/>He saw all three nodding at him. The assistant, realizing what was happening, also nodded. <br/><br/>“I, I, I...” Kevin muttered, wanting to say he dared not. Third Master was so frightening. He was afraid to interrupt their time together. Updated from novelb(i)n.c(o)m<br/><br/>“Don’t worry. You’re Lady Zane’s person; that man won’t dare hurt you,” Allonzo assured him. <br/><br/>“Really?” Kevin asked skeptically. <br/><br/>“Yes, go ahead.” <br/><br/>Kevin’s mouth twitched. The words sounded like “Go ahead! Go die!” Even more frightened, Kevin carefully shuffled forward. <br/><br/>He was only halfway there when Daisy and Arthur heard him and turned around to look. <br/><br/>Startled, Kevin straightened up immediately. <br/><br/>“What’s wrong?” Daisy asked him. <br/><br/>In the makeup room, Daisy Zane looked in the mirror and saw her face with its base makeup and couldn’t help but twitch the corners of her mouth. <br/><br/>She felt like a zombie and was too embarrassed, so she simply closed her eyes and urged, “Hurry up.” <br/><br/>“Alright.” Arthur North replied, and then began to apply the red makeup. The red paint spread out from the corners of her eyes like a begonia flower blooming little by little. <br/><br/>“Third Master, my face is all real; you can use more force.” Daisy Zane suddenly said. <br/><br/>“I know it’s all real.” Arthur North replied with a smile, but his movements were still very gentle. <br/><br/>Doing makeup was a very long process, and Daisy Zane was getting sleepy. Afraid that she would fall asleep, she randomly started a conversation: “Has <br/><br/>Third Master ever done makeup for himself?” <br/><br/>“No,” Arthur North said. “After my mom gave up on the idea of me learning opera, she sent me backstage because I was so restless. However, I’ve only ever done makeup for her, and no one else dared let me do theirs. Open your eyes and let me see.” <br/><br/>Daisy Zane opened her eyes. Arthur North’s fingertips pressed against her temples and lifted the corners of her eyes to check. <br/><br/>Actually, Daisy Zane’s eyes were already somewhat upturned, so it was relatively easy to do her eye makeup. “Close your eyes so I can do the other one.” <br/><br/>Daisy Zane closed her eyes, and Arthur North couldn’t help but smile at her rare obedience. <br/><br/>After the eye makeup was done, all that was left were the eyebrows and lips. <br/><br/>Arthur North bent down with his waist, one hand gently lifting her chin, and the other drawing her eyebrows, with a very focused expression. <br/><br/>At first, Daisy Zane kept her eyes closed, but after a while, for some unknown reason, she opened them. <br/><br/>Arthur North’s face was very close, so close she could see each of his long, thick, and slightly curled eyelashes. <br/><br/>Daisy Zane stared at his eyelashes, somewhat entranced, and didn’t even notice them trembling slightly. <br/><br/>Arthur North pursed his lips, seemingly trying hard to hold back, before finally moving his gaze from her eyebrows to her eyes. His voice was a bit restrained, “Daisy.” <br/><br/>This time, Daisy Zane’s lashes trembled slightly as she looked into his eyes. <br/><br/>“Hmm?” <br/><br/>Arthur North looked into her fearless eyes that met his gaze. For a moment, he sighed softly and smiled with a hint of helplessness. “Lucia, if you keep staring at me like that, I might not be able to resist doing something not so good.” <br/><br/>Daisy Zane continued to look at him, a faint smile gradually appearing in her eyes. Then she raised her eyebrows playfully and teased, “What thing?” <br/><br/>That provocative tone. <br/><br/>Arthur North gritted his teeth, but no matter how much Daisy Zane provoked him, she seemed to know that he wouldn’t really do anything to her, so she kept teasing: “What thing?” <br/><br/>Arthur North’s index finger had been holding her chin up all this time without letting go. Seeing her like this, he narrowed his eyes and suddenly leaned in. <br/><br/>He placed his thumb against the corner of her lips and gave her a light peck..\t\t\t\t\t\t</div>", "images": {}, "success": true}