{"id": 75, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223337.html", "title": "Chapter 75 - 73: We Have Quite A Fate", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 75 - 73: We Have Quite A Fate</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 75: Chapter 73: We Have Quite a Fate <br/><br/>Translator: 549690339 <br/><br/>“What happened?” <br/><br/>Wilton Edwards seemed much older than when Kevin Clark last saw him, as if aging overnight: “A few days ago, the Young Master was playing in the courtyard and accidentally fell into the lake, catching a cold fever. The family doctor has been treating him. Though the fever has subsided for three days, it suddenly flared up again after dinner tonight...” <br/><br/>Wilton wiped away tears: “The family doctor gave him intravenous fluids and stabilized him. In the second half of the night, I felt uneasy and went to check on him in his room. Then I saw his little face turning red-purple and struggling to breathe, and he couldn’t be awakened. The hospital doctor said it was a lung infection.” <br/><br/>“I’ll make a phone call.” Kevin Clark rubbed Daisy Zane’s hair a little, “Don’t worry.” <br/><br/>Daisy Zane nodded and helped Wilton sit down on a seat. She stood at the side, leaning against the wall, her eyes fixed on the light from the rescue room without blinking. <br/><br/>Even with the lights on in the hospital corridor, it felt very dark, as if the distance was pitch black and devoid of light. <br/><br/>Daisy Zane could only stare hard at the light from the rescue room. <br/><br/>After some time, footsteps sounded from not far away. <br/><br/>Kevin Clark wore a black trenchcoat, and several doctors accompanied him. He was talking to one of them with his head turned to the side. <br/><br/>The doctor was very respectful, nodding in agreement constantly. <br/><br/>Daisy Zane kept staring at him until he came to her side. She blinked and then glanced at the doctor who entered the rescue room. <br/><br/>“Rest assured, everything will be fine.” <br/><br/>Kevin Clark stood next to her, gripping her hand. <br/><br/>Daisy Zane was wearing thick clothes and a down jacket on the outside. The corridor was heated, warm, but her hand was cold and lifeless. <br/><br/>It would not get warm no matter what. <br/><br/>Half an hour later, the door to the rescue room opened. <br/><br/>Daisy Zane’s gaze fell on the first doctor who came out, but she didn’t move. She observed his expression when he took off the mask and then lowered her eyes. Gradually, her rigid body relaxed. <br/><br/>Wilton hurriedly got up and walked over: “Doctor...” <br/><br/>The doctor patted his arm, comforting him. Then he walked up to Kevin Clark, glanced at Daisy Zane, and said, “Third Master, the child is out of danger now. <br/><br/>Daisy thought he wouldn’t come, so she kept looking at him for a while before lowering her gaze, only then noticing that he had something in both hands. <br/><br/>On one side was a food box, and on the other, toiletries, most of which were for children. <br/><br/>Kevin Clark put those things on the seat and sat down, saying, “The doctor said the child would need to stay in the hospital for a few days after leaving the Intensive Care Unit, so I bought some stuff for their stay.” <br/><br/>Daisy looked at those things without speaking. <br/><br/>Kevin Clark opened the food box and said, “Let’s eat something first. Don’t worry, it’s just a day of observation. I asked Xavier Dominic to take a leave of absence for you from the drama crew, so you can stay here with peace of mind for a few days.” <br/><br/>He had arranged everything. <br/><br/>“You’ve been smoking.” <br/><br/>Startled by her abrupt comment, Kevin Clark hesitated as he reached for a spoon: “Does it... smell terrible?” <br/><br/>Daisy shook her head, paused, and then said slowly, “That day, you were coughing so badly... Your acting skills were good.” <br/><br/>Kevin Clark remembered the act he put on to stop her from smoking was genuinely choking that day.” <br/><br/>Daisy smiled, took the spoon from him, and ate a mouthful of porridge. <br/><br/>Neither of them spoke for a while, the atmosphere quiet and then Kevin Clark asked, “What’s the child’s name?” <br/><br/>“Charles Amos,” Daisy stirred the porridge and said, “Charles, as in South and North, and Amos, as in inheriting.” <br/><br/>“What about his father?” Kevin Clark’s index finger tapped lightly on his thigh. Daisy’s hand paused momentarily, and then she slightly frowned, “He passed away.” <br/><br/>Kevin Clark clenched his hand and then slowly let go. Although he felt a little guilty for feeling relieved, he was indeed somewhat relieved. <br/><br/>Just then, Wilton Edwards returned. <br/><br/>“Miss,” Wilton Edwards greeted her, then glanced at the gentleman beside her and hesitated for a moment, “This is... <br/><br/>Wilton Edwards was so worried last night that he didn’t even notice what the person next to him looked like, let alone that there was a man there. <br/><br/>“Ah, I’ve met this gentleman before. At the entrance of the Doomsday Hotel, it was he who picked up the young master,” Wilton Edwards had an average memory, but Kevin Clark’s appearance was truly unforgettable, “I was so flustered that day; I didn’t properly thank him.” <br/><br/>Daisy looked at Kevin Clark: “You’ve met him?” <br/><br/>Kevin Clark smiled, “Yes, it seems like the little guy and I are quite fated.” <br/><br/>Daisy:...This chapter is updated by nov(e)(l)biin.com\t\t\t\t\t\t</div>", "images": {}, "success": true}