{"id": 79, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223343.html", "title": "Chapter 79 - 77: The Child Comes To The Door", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 79 - 77: The Child Comes To The Door</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 79: Chapter 77: The Child Comes to the Door <br/><br/>Translator: 549690339 <br/><br/>Five minutes after Daisy Zane left, Joseph Johnson slowly got up from the ground and sat down on a chair nearby. <br/><br/>His whole body seemed to have lost its soul, he could not feel the pain. <br/><br/>His mind was full of what he saw on Daisy Zane’s cellphone—page after page, each like a knife hanging over his neck. <br/><br/>A few minutes later, the door of the changing room was pushed open. <br/><br/>Joseph Johnson, as if by reflex, felt his heart jump to his throat, breaking out into a cold sweat. <br/><br/>But when he saw that it was Clarissa Mason at the entrance, he breathed a sigh of relief, yet his anger flared up, yelling, “Where the hell have you been! You told me to come here to find you! Where have you been!” <br/><br/>Clarissa Mason, trembling from being yelled at, shrugged with a small voice, <br/><br/>“I, I came here to wait for you. I even cleared the area. But, but I suddenly had stomach pains, so I went to the restroom first. I, I sent you a message, but <br/><br/>when I clicked send, it didn’t send.” <br/><br/>“Worthless!” <br/><br/>“Brother Johnson, you, what happened to you?” Clarissa Mason’s eyes welled up with tears in an instant, looking terrified, “Why are you so angry?” <br/><br/>Joseph Johnson was annoyed when he saw her like this, losing all interest. He got up and walked out, even pushing her when he reached her side, and then slammed the door behind him. <br/><br/>Clarissa Mason stumbled back a few steps, her side hitting a nearby table, causing her to grit her teeth in pain, the sensation shooting up to her head. <br/><br/>It took her a while to straighten up, then she walked over to the table by the door, ripping a miniature camera from the side of a discarded makeup box. <br/><br/>She held the camera in her hand, lowering her head and snickering, “Daisy Zane, I’d like to see whether the Davis family still wants you.” <br/><br/>When Daisy Zane went out, Anisa Cooper was running over from the film set. <br/><br/>By the time she reached Daisy, she was too out of breath to speak. However, her hands and feet were still moving, and she checked Daisy’s face, arms, and hands while panting. Seeing that Daisy was fine, she sat down on the ground. This chapter is updated by nov(e)(l)biin.com<br/><br/>Daisy Zane reached out to help her up, but Anisa started crying while still panting. <br/><br/>“...Hey? Why are you crying? People might think I scolded you.” <br/><br/>Anisa couldn’t speak and just sat on the ground crying, sobbing hard. <br/><br/>Daisy Zane had no choice but to squat beside her and hand her a tissue paper. <br/><br/>After a while, Anisa finally calmed down a bit, “Lucia, Lucia, you, scold me. I, <br/><br/>I’m so stupid, I, I was, deceived.” <br/><br/>Round and plump, they looked like a little bundle. <br/><br/>Although some distance away, Kevin Clark recognized the child as Charles Amos instantly. He asked Michael Jackson to stop the car, and he got out and walked over to the green area. <br/><br/>Upon seeing someone approaching, Charles Amos quickly stood up, looking defensive and a bit fierce. <br/><br/>However, since he had met Kevin once before and recognized his face, his defensive expression softened a bit. <br/><br/>“What are you doing here?” Kevin looked around and squatted in front of him, asking. “Where is Wilton Edwards?” <br/><br/>Charles Amos stared at him, his eyes filling with confusion when he heard the words “Wilton Edwards,” but he remained silent. <br/><br/>“Are you here to find Daisy?” <br/><br/>Hearing these words, Charles blinked and furrowed his brow, seemingly not understanding. He still did not speak. <br/><br/>Remembering how Wilton Edwards said Charles didn’t like to talk, Kevin thought for a moment and said, “Daisy is working and hasn’t come back yet. <br/><br/>I’m her friend. Can you go back with me first?” <br/><br/>Not only did Charles not respond, he took a step back and started looking defensively at Kevin again. <br/><br/>Seeing his reaction, Kevin knew he was being mistaken for a trafficker. <br/><br/>So, Kevin sent Daisy Zane a message asking if she had time to accept a video call. Daisy did not reply but sent a video request immediately. <br/><br/>“What’s up? Is there something wrong?” Daisy had just finished filming. <br/><br/>Hearing her voice, Charles’s eyes lit up, and his big eyes blinked rapidly. Kevin looked at her and then at Charles, saying, “I’m in Truro City now.” “Hmm?” <br/><br/>“I’m at the entrance of Everlasting Palace and ran into Charles Amos,” Kevin watched as Daisy’s eyebrows furrowed bit by bit before adding, “He seems to be alone.” <br/><br/>“By himself?” <br/><br/>“Mhm.” Kevin could feel her anger through the screen, “He must have been waiting outside for a long time, his little face is all red from the cold. I asked him to go back with me, but he thinks I’m a trafficker.” <br/><br/>Daisy Zane was silent for a while and said, “Give him the phone.” <br/><br/>Kevin handed the phone to Charles Amos. Upon seeing the person on the screen, Charles stared blankly for a few seconds before his eyes reddened. <br/><br/>However, before things could escalate, Daisy said, “Hold it back.” <br/><br/>Charles held back his tears. <br/><br/>“Who brought you here?” <br/><br/>Charles finally spoke up, his quiet voice a little hoarse, “I came by myself.” <br/><br/>Kevin looked at him in surprise, raising an eyebrow..\t\t\t\t\t\t</div>", "images": {}, "success": true}