{"id": 77, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223339.html", "title": "Chapter 77 - 75: I Do Quite Like Him", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 77 - 75: I Do Quite Like Him</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 77: Chapter 75: I Do Quite Like Him <br/><br/>Translator: 549690339 <br/><br/>They were planning to return to Truro City and take a flight back, but Kevin Clark suddenly went onto the expressway at an intersection. <br/><br/>He wanted to spend a little more time with Daisy Zane, and also calm himself down. <br/><br/>“Hm?” Read latest chapters at novelhall.com Only<br/><br/>Kevin glanced at her and said, “Since there’s nothing to do, let’s drive back.” Daisy looked at him sideways. <br/><br/>Kevin looked ahead and laughed, “Don’t worry, I’m very good at driving.” <br/><br/>“You have great stamina.” Daisy sincerely praised. <br/><br/>Kevin: <br/><br/>Daisy really thought Kevin had great stamina; she had never seen him tired, only with redness at the corner of his eyes. And...he had obviously been busy for a few days, but still dared to drive on the highway for several hours back to Truro City. <br/><br/>Was her safety really not an issue? <br/><br/>Although she wasn’t afraid, it would be too unworthy to get hurt or worse in this way. <br/><br/>“You can rest for a while, and let me drive when we reach the rest area.’ <br/><br/>“No need, I have good energy.” Kevin laughed. <br/><br/>Daisy: ‘ Praising him once, and he got carried away. <br/><br/>Even though Daisy thought so in her heart, she soon fell asleep. And slept very soundly; Kevin went to the rest area and covered her with a piece of clothing, and she didn’t wake up. <br/><br/>By the time she woke up, they were already coming off the highway in Truro <br/><br/>City. <br/><br/>“Awake?” <br/><br/>The winter sun set a little early, and Truro City was getting a bit dark at this time. <br/><br/>For a moment, Daisy was a little confused as she looked at the street scene outside, and after a while, she said, “I...slept for so long?” <br/><br/>“Not too long.” <br/><br/>Daisy wanted to say how could it not be long, she felt that Kevin was the incarnation of a hypnotist, every time he was around, she slept exceptionally well. <br/><br/>“Hungry?” <br/><br/>Just as the question was asked, Daisy’s stomach gave two timely grumbles. <br/><br/>Daisy: <br/><br/>Kevin laughed, “Alright, I got it.” <br/><br/>“You broke the tail light of my brand new car, and you’re still arguing?” Robinson Scott angrily hurled her high heel shoe at him. <br/><br/>Allonzo Hobson dodged the attack: “You slam the brakes on the main road, and you still think you’re right?” <br/><br/>“Bullshit!” Robinson Scott threw her other high heel, “If you hadn’t been following me, you wouldn’t have hit me!” <br/><br/>“I wasn’t following you! I was just on my way!” Allonzo Hobson dodged her <br/><br/>high heel again, “You must have a persecution complex.” <br/><br/>Robinson Scott then threw a diamond hairpin from her hair: “You’re the one with a persecution complex, and you’re crazy!” <br/><br/>Allonzo Hobson managed to catch the hairpin: “You’re the one who’s crazy.” <br/><br/>Kevin Clark and Daisy Zane watched the two bicker. After a while, the two looked at each other, seeing disdain in each other’s eyes. <br/><br/>Daisy Zane simply went back to her side, and Kevin Clark pulled Allonzo Hobson away. <br/><br/>Seeing them leave, Robinson Scott followed Daisy Zane back. As she closed the door, she gave Allonzo Hobson the finger and cursed viciously: “Smelly man, I curse you never to have an erection in your lifetime.” <br/><br/>Just as Allonzo Hobson was about to close his own door, he heard her words and immediately retorted: “I curse you never to experience the pleasure of sex.” <br/><br/>Then the two of them slammed their doors shut at the same time. <br/><br/>“Damn it, I’m so angry!” Robinson Scott vigorously rubbed her hair. <br/><br/>Daisy Zane poured a glass of water and drank it, then said, “You two have a pretty high standard when it comes to cursing.” <br/><br/>“Daisy!” Robinson Scott was so angry that she sat barefoot on the sofa, “I just got the car I’ve been waiting for a year! I’m so heartbroken.” <br/><br/>Daisy Zane laughed and sat down on the sofa. <br/><br/>After stewing in her anger for a while, Robinson Scott looked at Daisy Zane and said, “Olivia, what’s going on with you? I was just gone for a little while, and you’re already embracing Kevin Clark!” <br/><br/>Daisy Zane took another sip of water: “It was an accident.” <br/><br/>“An accident?” Robinson Scott’s face looked almost distorted in surprise, “You would let this kind of accident happen. Remember when someone tried to touch your hand before, and you broke their arm without even getting touched? Have you forgotten that?” <br/><br/>“I forgot.” <br/><br/>Robinson Scott paused, “You didn’t really fall for him, did you?” <br/><br/>Daisy Zane smiled and looked at Robinson Scott: “I do like him quite a bit.” <br/><br/>Robinson Scott shuddered at the sight of her smile. <br/><br/>“And he likes me a lot too.” Daisy Zane continued. <br/><br/>Robinson Scott twitched the corners of her mouth, especially afraid of Daisy <br/><br/>Zane’s calculating gaze, “So, what now?” <br/><br/>“Kevin Clark is a very smart and capable person, and I need his help.” Daisy Zane finished the water in her glass. Cold water down her throat was very refreshing. “So, I need to make use of his assistance before he loses interest in me..”\t\t\t\t\t\t</div>", "images": {}, "success": true}