{"id": 76, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223338.html", "title": "Chapter 76 - 74: Charles Amos", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 76 - 74: Charles Amos</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 76: Chapter 74: Charles Amos <br/><br/>Translator: 549690339 <br/><br/>Charles Amos woke up in the intensive care unit at noon and was allowed to have family visit him for ten minutes in the afternoon. Daisy Zane let Wilton <br/><br/>Edwards go in and specifically told him not to mention that she had been there. <br/><br/>Kevin Clark left early in the afternoon because of some matters. <br/><br/>Hearing that Charles Amos was not in any serious condition, Daisy Zane left the hospital the next morning and took a taxi to the headquarters of Spotlight. <br/><br/>Spotlight’s building was quite far away, close to the edge of the Imperial Capital. <br/><br/>Felix Baker bought the office building on the edge of the city for its relatively cheap cost. <br/><br/>When Daisy Zane arrived at the ground floor of the Spotlight building, she called Mr. Baker’s assistant, Anna Skyler, to pick her up. <br/><br/>“Sister!” Anna Skyler hurried downstairs as soon as she received the call, hugged Daisy Zane briefly, and then let go. “Sister, why didn’t you tell us in advance? We could have prepared.” <br/><br/>“Surprise attack.” <br/><br/>“Alright, alright, surprise attack.” Anna Skyler walked with her towards the skyscraper. “Mr. Baker isn’t here; he flew to D Continent a few days ago to look at the mine.” <br/><br/>“Well, I came because he’s not here.” <br/><br/>Anna Skyler laughed, “Mr. Baker would be so happy to know you’re here.” <br/><br/>As they reached the door, Anna pulled the glass door open to let Daisy Zane through. <br/><br/>“Thank you,” Anna Skyler said with a smile. <br/><br/>The man nodded slightly with a smile. <br/><br/>Wearing a mask, Daisy Zane glanced at the man as she entered. <br/><br/>The man looked handsome with sharp features and had a small mole below his left eyebrow. While Daisy Zane looked at him, he was also looking at her, as if thinking about something. <br/><br/>Daisy Zane felt that she had seen him before, but she couldn’t recall who he was for a moment. <br/><br/>It wasn’t until she entered the elevator that she asked, “Is that man from the <br/><br/>company!” <br/><br/>“He’s here for an interview.” Anna Skyler suddenly became smitten. “He graduated from a prestigious overseas jewelry design school, and his designs are excellent. He’s also a wealthy second-generation. His family owns a company for him to inherit, but he insists on being a designer in another company. He’s good-looking and very polite.” <br/><br/>Daisy Zane glanced at the girl next to her, “You know so much?” <br/><br/>Wilton Edwards could only watch them leave. <br/><br/>In the car, Daisy Zane sat in the copilot’s seat and didn’t say anything. <br/><br/>Kevin Clark drove, and it wasn’t until the third red light stopped the car that he finally spoke, “Why didn’t you see Charles Amos?” <br/><br/>Daisy Zane was silent for a moment and didn’t answer this question. Instead, she said, “Kevin Clark, you only asked half of the question that day, and you didn’t ask the other half.’ <br/><br/>“Hmm? What question?” The red light was short, and soon it turned green, so the car started moving again. <br/><br/>Daisy Zane looked out the window and slowly began, “You asked about his father, but you didn’t ask about his mother.” <br/><br/>Suddenly, Kevin Clark hit the steering wheel, slammed on the brakes, and pulled the car over to the side of the road. <br/><br/>Luckily Daisy Zane reacted quickly and didn’t hit her head on the glass. <br/><br/>“Are you okay?” Kevin Clark touched Daisy Zane’s head first, “Did you hit yourself?” <br/><br/>Daisy Zane looked at him and said, “Third Master, your driving isn’t very good.” <br/><br/>“Cough.” Kevin Clark cleared his throat, “The performance of this car is a bit poor.” <br/><br/>Daisy Zane laughed, clearly mocking him. <br/><br/>But Kevin Clark’s mind wasn’t on this, and after calming down a bit, he asked, <br/><br/>“What about Charles Amos’s mother?” <br/><br/>“She had a difficult delivery when giving birth to him and didn’t make it through,” Daisy Zane said. <br/><br/>When Kevin Clark heard this, he didn’t even know what to feel. The usually calm and composed man had experienced an emotional roller coaster in just a few days. <br/><br/>Having barely accepted the highest point of the ride, he suddenly realized that he was still on the ground. <br/><br/>The fluctuations were so great that there was no reaction. <br/><br/>He held the steering wheel, and after a while, he said blankly, “I thought he...” <br/><br/>“Thought he was mine?” Daisy Zane looked at his reaction and found it somewhat amusing. “Just because he called me ‘Mom’, you thought I gave birth to him?” <br/><br/>“He’s eight years old. When he was born, I wasn’t even an adult yet.” Kevin Clark gradually regained his composure, “He’s eight?” <br/><br/>“He’s just developing slowly and looks younger,” Daisy Zane said, “When he was one, his father... <br/><br/>Daisy Zane suddenly furrowed her brows, her fingers unconsciously tightening. She immediately shifted the topic to Charles Amos, “When he was little, he spent more time with me. As he grew older, I handed him over to Wilton Edwards, only occasionally visiting him. I didn’t want him to get too close to me; it’s better for him to gradually forget about me, but this process seems a bit slow and a bit...painful.” <br/><br/>Kevin Clark grasped her hand and gently squeezed it, “Why?” <br/><br/>“I don’t know how long I can accompany him.” Daisy Zane held Kevin Clark’s hand in return, looking at it as she spoke words she had never shared with anyone before, “I don’t want him to experience the pain of being separated from someone he’s close to. It’s better to let him forget about me sooner..”\t\t\t\t\t\t</div>", "images": {}, "success": true}