{"id": 71, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223333.html", "title": "Chapter 71 - 69: Revenge For Enmity_2", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 71 - 69: Revenge For Enmity_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 71: Chapter 69: Revenge for Enmity_2 <br/><br/>Translator: 549690339 <br/><br/>Before Anisa could finish speaking, there were noises and people gasping and screaming at the entrance. <br/><br/>They looked over and soon saw the director, along with Harton Clark and Xavier Dominic at the entrance. <br/><br/>Harton Clark wore a black trench coat, his figure tall and straight. He was so eye-catching just standing there. <br/><br/>Upon seeing him, Daisy’s eyelashes trembled slightly before her eyebrows hitched up. She showed no intention of getting up from her chair. <br/><br/>Everyone else was standing, and she was the only one sitting. <br/><br/>Harton Clark gave her a smile. It had been more than half a month since they’d seen each other, and he felt his longing was about to overflow. <br/><br/>These people might not recognize Harton Clark, but it was impossible for them not to know Xavier Dominic. <br/><br/>“Young Master Hobson?” The makeup artist was surprised for a moment before immediately putting on a fawning smile, stepping forward and saying, “Young Master Hobson, what brings you here?” <br/><br/>Xavier Dominic walked into the makeup room and asked, “I heard you lost something?” <br/><br/>After Anisa left with a slap, the makeup artist immediately called the director to complain about the matter. <br/><br/>The director was occupied, so he sent the assistant first. <br/><br/>However, when the director finally had time to come over, Harton Clark and Xavier Dominic arrived. They had already asked about Daisy and where she was, so the director told them about the situation on the way. <br/><br/>Just now they were standing on the periphery, listening for a while. <br/><br/>Many people were watching from outside, so Harton Clark only walked a few steps into the room before stopping. He didn’t approach Daisy but kept looking at her. <br/><br/>“It’s not something valuable,” The makeup artist said, smiling fawningly. “Isn’t it valuable?” Daisy casually replied, “People like us can’t even afford it.” <br/><br/>Xavier Dominic’s mouth twitched, thinking of the box of gold bars and diamonds in Daisy’s house. <br/><br/>“Of course you guys can’t afford it,” The makeup artist replied, “But for Young Master Hobson, those things are like sand. You country bumpkins can’t compare.” <br/><br/>“Do modern makeup artists also lack basic manners?” Harton Clark suddenly asked lightly. <br/><br/>Xavier Dominic laughed, “This kind... I guess they don’t want to keep their careers.” <br/><br/>Anisa immediately took the ring, checked that it was fine, and carefully put it back in her pocket. <br/><br/>She didn’t respond to him. <br/><br/>The makeup artist continued, “I’m sorry for my foul mouth and saying unpleasant things. I apologize to both of you.” <br/><br/>Daisy supported her temple, lifting her eyelid to look at him. <br/><br/>Since Daisy didn’t make a sound, Anisa didn’t either. <br/><br/>Of course, Harton Clark and the others wouldn’t say anything either, leaving the rest of the situation up to Daisy’s decision. <br/><br/>“I... I’ll be Lady Zane’s makeup artist for free. You can use me for as long as you want.” The makeup artist hoped to save her career with this offer. <br/><br/>“People like us can’t afford you,” Daisy said softly. <br/><br/>“I was just spouting nonsense, I...” <br/><br/>“You still owe my assistant a slap,” Daisy interrupted him, not wanting to hear more of his words. <br/><br/>The makeup artist hesitated for a moment, then took a step towards Anisa with determination. <br/><br/>Anisa, frightened, stepped back and looked to Daisy for guidance. <br/><br/>“Don’t dirty my assistant’s hand,” Daisy said, looking at her own fingertips. <br/><br/>Harton Clark’s mouth curved up. The little girl was like this, holding grudges and never showing mercy. <br/><br/>The makeup artist paused for two seconds, slapped herself lightly, then held her face in pain, nose souring from the slap. <br/><br/>The director and assistant were both startled. Xavier Dominic and Michael Jackson exchanged a silent glance, seeing admiration and respect for Daisy in each other’s eyes. <br/><br/>But Daisy still hadn’t moved. This time, without much hesitation, the makeup artist slapped herself loudly on the other side. <br/><br/>Now, both hands covered her face, and she was in so much pain that tears welled up. <br/><br/>Daisy finally stood up without looking at him, “If you have any objections to everything that has happened, you can either sue me or go to the police.” <br/><br/>After saying this, she walked to the entrance, glancing at Harton Clark as she passed him. <br/><br/>Harton Clark immediately lowered his head and smiled, following her out of the makeup room..\t\t\t\t\t\t</div>", "images": {}, "success": true}