{"id": 70, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223332.html", "title": "Chapter 70 - 69: Revenge For Enmity", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 70 - 69: Revenge For Enmity</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 70: Chapter 69: Revenge for Enmity Updated from novelb(i)n.c(o)m<br/><br/>Translator: 549690339 <br/><br/>Ever since Lilian Lopez left their drama crew, only George Dunn had a separate makeup room. <br/><br/>The rest were shared. The number one Makeup Room was cleared out by the director yesterday, as requested by the makeup artist, stating the need for a separate room. <br/><br/>When Daisy Zane arrived, the door to the makeup room wasn’t tightly closed, leaving a small gap. <br/><br/>A very unfamiliar male voice was ranting inside, while the director’s assistant was apologizing. Many spectators gathered outside and when they saw Daisy Zane approaching, they moved back a little, but their gossip craving did not allow them to leave. <br/><br/>Daisy glanced at the CCTV camera in the top right corner and stood outside, listening for a while. <br/><br/>“Get your director over here! I need to see him!” The man yelled while pinching his throat, “I only came here because of your director. Otherwise, I wouldn’t bother doing makeup for a newcomer. Do you know that my hands have touched top-tier celebrities?” <br/><br/>“Yes, yes, please calm down. The director really can’t make it right now.” The assistant said, “Maybe there’s some misunderstanding.” <br/><br/>“Misunderstanding? I saw her at my door, gripping this ring in her pocket.” The man said, “I caught her red-handed, there’s no misunderstanding.” <br/><br/>Daisy didn’t sit in front of the dressing table, she just grabbed a random chair and sat down. <br/><br/>With her legs crossed, she tilted her chin at him, “Are we going to talk about punctuality first? Or about stealing?” <br/><br/>“What right do you have to talk to me? What do you think you are?” The makeup artist retorted. <br/><br/>“Let’s start with punctuality.” Daisy ignored his words and went straight to the point, “You told us last night to come at six o’clock for makeup today, but you arrived past eight o’clock. That’s your so-called punctuality.” <br/><br/>The makeup artist folded his arms and scoffed, confidently saying, “I didn’t even know you guys, I was just giving you a heads-up to be prepared.” <br/><br/>Daisy chuckled lightly, “Okay, let’s talk about stealing then. What did my assistant steal from you?” <br/><br/>“The ring, caught red-handed! Do you still want to deny it?” <br/><br/>Daisy directly said, “My assistant hadn’t been in the makeup room, the outside CCTV can prove it. You can ask someone to check the surveillance. The ring was bought by my assistant herself, please return it to her.” <br/><br/>Daisy purposely left the door open and now people watching the drama had gathered around the entrance. <br/><br/>“I caught her with the stolen item, why should I check the surveillance? Is the surveillance yours? You say check and it’s checked.” The makeup artist said, “Just admit you stole it. Admitting your mistake is not hard. I know people like you who haven’t seen much of the world, with dirty hands and love to take things. I’m not even making a fuss about it, is admitting your mistake so hard?” “I didn’t take it! It’s the one I bought myself!” Anisa yelled. <br/><br/>“Do you know how much this ring costs? You bought it? With those clothes you’re wearing, can you afford it?!” “You, there’s a receipt at my home....”\t\t\t\t\t\t</div>", "images": {}, "success": true}