{"id": 74, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223336.html", "title": "Chapter 74 - 72: Little Young Master", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 74 - 72: Little Young Master</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 74: Chapter 72: Little Young Master <br/><br/>Translator: 549690339 <br/><br/>“Johanes Miles, what do you mean by this? Did I agree to this?” Charles Hobson said as he threw a contract of equity transfer onto Johanes’ body. “How dare you rummage through my study?” <br/><br/>“So now I’m not even allowed to look at things in your study, huh?” <br/><br/>Johanes rubbed his temples and sighed, “Charles, can we please stop arguing? This is already giving me a headache. Can’t you understand me just a little bit?” “Understand you? How am I supposed to understand you?” Charles replied, “The Miles Family’s success today is more than half due to my family. Yet, now you want to give away a portion of it to someone else, taking away what belongs to my children.” <br/><br/>“Charles, she’s not just anyone. She carries half of my blood. Even if we back down a million steps, giving her a share is appropriate.” <br/><br/>“What you’re giving her belongs to the Miles Family, right? You wouldn’t be who you are today without us Hobsons!” <br/><br/>Johanes’ sore spot was hit, and he glared at her in return. After a while, he said, “That’s true, without the Hobson Family, there would be no Miles Family today, and there wouldn’t be Jace Miles or Amelia Miles. Today, this home would only have Claudia Zane and Daisy Zane.” <br/><br/>Hearing that name, Charles Hobson slapped Johanes Miles. Following the crisp sound, everything fell into silence. <br/><br/>It was as if something lay between the two people in the air. <br/><br/>Charles tightly clutched his fingers and, after a daze, said, “Johanes, I... ” <br/><br/>Johanes didn’t speak again, turned around, picked up his clothes, and left the house. <br/><br/>Amelia Miles was in the dance practice room with Clarissa Mason when she <br/><br/>received the call. <br/><br/>“Mom, what’s wrong?” <br/><br/>“Amelia, I found a contract of equity transfer in your father’s study, for Daisy <br/><br/>Zane. ” <br/><br/>Hearing this, Amelia tightened her grip on the mineral water bottle in her hand: “Is it in effect?” <br/><br/>“No, it’s just a prepared contract.” <br/><br/>“I see.” <br/><br/>“What’s wrong? Why do you suddenly look so bad?” Clarissa Mason asked after seeing her finish the phone call. <br/><br/>“It’s nothing.” Amelia shook her head and smiled, “Liam Davis wants to marry my sister, and my dad wants to give my sister a dowry. My mom is just a bit upset. ” <br/><br/>“Who wouldn’t be, the daughter of a mistress, her presence itself serves as a reminder of the betrayal in their marriage. If it were me, I’d want her dead.” <br/><br/>Clarissa said, “Getting married and preparing a dowry for her, if that were me, <br/><br/>Daisy Zane smiled, taking a bite of the cream: “How long will you stay in Truro <br/><br/>“I’ll go back to the Imperial Capital tomorrow afternoon.” Kevin Clark asked, “Do you have any plans?” <br/><br/>Daisy Zane shook her head. It had been almost half a year since she had been to the Imperial Capital. <br/><br/>After having dinner together, they went back to Everlasting Palace. Daisy Zane worked on design drafts until past eleven o’clock before going to bed. <br/><br/>At past 2 AM, the sudden ringtone of her cell phone woke her up. <br/><br/>Daisy Zane opened her eyes abruptly, reached for her phone, and as soon as she saw the unmarked but deeply ingrained phone number, her heart sank. <br/><br/>She quickly answered the call, and an older-sounding man in his fifties sobbed on the other end of the line, “Lady, the young master is in the rescue room.” <br/><br/>When Kevin Clark’s cell phone rang, he was in the study room, dealing with matters. As soon as he saw the note and then the knocking on the door from outside. <br/><br/>He answered the phone and walked out at the same time. <br/><br/>“Open the door.” <br/><br/>Daisy Zane’s voice was cold and somewhat panicked. <br/><br/>When Kevin Clark opened the door, he saw her wearing just a nightgown, her hair somewhat messy. Her entire state was a seemingly calm but chilling demeanor, so cold that it was terrifying. But, her eyes were red. <br/><br/>Upon seeing Kevin Clark, she clung to him like a lifeline, grabbing his arm: <br/><br/>“Kevin Clark, I need to go to the Imperial Capital, now, immediately.” <br/><br/>“Tell me the exact address, ” Kevin Clark immediately asked. <br/><br/>“First Hospital.” <br/><br/>“Alright, I’ll arrange it.” Kevin Clark pulled her into the room, realizing that she hadn’t even had time to close the door, “Wait inside for a while.’ <br/><br/>The arrangements were made quickly, and they boarded the plane on the rooftop of Everlasting Palace. An hour later, they landed at the Imperial Capital First Hospital. <br/><br/>When Daisy Zane arrived outside the rescue room, only a man in his fifties was waiting there. <br/><br/>Hearing footsteps, the man looked at her: “Young lady.” <br/><br/>After uttering these two words, the man shed tears. <br/><br/>Kevin Clark, who was walking behind Daisy Zane, paused for a moment when he saw this man. He had seen him before, at the entrance of the Doomsday Hotel, the family member of the little boy who bumped into him. <br/><br/>“Wilton Edwards.” Daisy Zane supported him, “How is he?” <br/><br/>“I don’t know, it’s been more than an hour, and the doctor hasn’t come out yet.” Wilton Edwards wiped away his tears, “It’s my fault. I didn’t take good care of the young master. I deserve to die, I deserve to die..”\t\t\t\t\t\t</div>", "images": {}, "success": true}