{"id": 73, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223335.html", "title": "Chapter 73 - 71: I Am Innocent", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 73 - 71: I Am Innocent</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 73: Chapter 71: I Am Innocent <br/><br/>Translator: 549690339 <br/><br/>“Do you still need to ask?” <br/><br/>Arthur North let go of her chin, still leaning over to look at her, creating an oppressive atmosphere. <br/><br/>Daisy Zane stared at him in astonishment. After a while, she finally realized that Arthur had kissed his own finger. <br/><br/>She pursed her lips slightly and lowered her gaze, whispering, “Third Master, you’re not taking this seriously.” <br/><br/>Her voice was as cold as usual, showing no sign of emotion. If Arthur hadn’t seen her blushing ear tips, he would have thought that Daisy was lacking certain emotional capacity. <br/><br/>“What is it that I’m not taking seriously?” Arthur looked at her ears and decided to tease her, “I can be more serious.” <br/><br/>Daisy frowned and looked up at him. Despite her heavy opera makeup, the chilliness in her gaze was noticeable. <br/><br/>Arthur’s smile froze, and he quickly admitted, “I made a mistake.” <br/><br/>Seeing his pitiful and sincere expression, Daisy hesitated for a moment and then laughed gently. <br/><br/>Arthur was relieved to see that she was not angry about his actions and laughed along, “Close your eyes, I’ll do it seriously.” <br/><br/>After doing her makeup, Arthur called Anisa Cooper in to help her comb her hair and wear the costume. <br/><br/>It was past eleven o’clock in the morning by the time they finished everything. During the process, the director’s assistant secretly peeked three times. He thought no one noticed him, but in reality, his round head had already been discovered. <br/><br/>So, after getting ready, Daisy immediately headed to the film set. <br/><br/>When she arrived at the scene, the director was genuinely stunned. <br/><br/>Daisy’s natural beauty was already captivating and eye-catching, a perfect combination of elegance and coldness. <br/><br/>Now, with her opera makeup, her beauty was magnified. The original coldness was overlaid with colors, making her look like a blooming begonia. Moreover, her temperament and bearing were unparalleled. <br/><br/>The director was dumbstruck. <br/><br/>It wasn’t until he felt an invisible knife hanging over his neck that he suddenly came to his senses, withdrew his gaze, and cautiously glanced at Arthur. <br/><br/>Then he squeezed out an even uglier smile than crying. <br/><br/>Arthur: <br/><br/>The director was a detail-oriented person and willing to spend money on filming. <br/><br/>The stage was built very professionally, almost a one-to-one reproduction of the stages seen in old photos. <br/><br/>Hill Dawson had said that Amelia Miles also wanted the Spotlight endorsement. Olivia Chester had been working hard to increase her popularity recently. <br/><br/>You could tell that a lot of effort had been put into it. <br/><br/>Suddenly, Kevin Clark’s hand gently squeezed the back of her neck, Daisy Zane looked up at him but didn’t say anything and continued scrolling through the videos on her phone. <br/><br/>Soon, there was another video of Amelia Miles dancing. <br/><br/>Daisy Zane initially wanted to swipe away, but a line in the video caught her attention. <br/><br/>—Amelia Miles dancing to “Years” is called Little Kiara. <br/><br/>Daisy Zane couldn’t help but watch the dance section she performed. Kevin Clark, standing behind her, could see it naturally. <br/><br/>“Do you like it?” Kevin Clark knew she had a dance background but never asked about it. <br/><br/>Daisy Zane didn’t answer him, instead asking, “Kiara is...?” <br/><br/>“Sophie Ortiz,” Kevin Clark said, “from the Imperial Capital’s Lane family, Mrs. Lane. A very powerful dancer and chairman of the Dance Association.” “The Lane family.” Daisy Zane repeated. <br/><br/>‘”Years’ is one of Mrs. Lane’s classic works,” Kevin Clark said, pausing as if wanting to say more, but ultimately remaining silent. <br/><br/>Daisy Zane watched the dance again and asked, “I heard that the Leafeild and Lane families in Imperial City are equally matched and at odds. How do you guys get along?” <br/><br/>“What do you think?” <br/><br/>“I heard... both of you want to destroy each other and become the most powerful family alone,” Daisy Zane said calmly. <br/><br/>“Daisy, where do you hear these things?” Kevin Clark laughed, “Why are eight out of ten pieces of news fake?” <br/><br/>“Which two are true?” Daisy Zane turned her head up and looked at him, “Third <br/><br/>Master Clark’s romantic exploits or his scandals?” <br/><br/>Kevin Clark gently flicked her forehead, “Did you do that on purpose?” <br/><br/>Because of the facial pieces from the opera, her face felt a bit tight, so she could only smile with pursed lips. <br/><br/>Even though Kevin Clark knew she did it on purpose, he still explained, “Don’t listen to those nonsense, I am innocent.” <br/><br/>Daisy Zane laughed even harder, and her headdress started to tremble with her laughter. <br/><br/>Kevin Clark: <br/><br/>Anisa Cooper, who was chatting with Allonzo Hobson and Michael Jackson not far away, couldn’t help but smile when she saw this scene. <br/><br/>She noticed that Daisy Zane seemed to smile a lot when she was with Third <br/><br/>Master Clark..\t\t\t\t\t\t</div>", "images": {}, "success": true}