{"id": 88, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223361.html", "title": "Chapter 88 - 86: Lucia Everleigh’S Idol", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 88 - 86: Lucia Everleigh’S Idol</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 88: Chapter 86: Lucia Everleigh’s Idol <br/><br/>Translator: 549690339 <br/><br/>Felix Baker wore a white haute couture suit, his hair fixed backwards with hair gel, and a small widow’s peak on his forehead. <br/><br/>He had a very gentle appearance, giving people a warm and comforting feeling at first glance, but when he smiled, he had a bit of a flirtatious air. <br/><br/>As soon as he came out, he was surrounded by a group of people, exchanging pleasantries and toasting with wine. <br/><br/>Even someone like Olivia Chester, who has earned a gold reputation in the entertainment industry, had to wait in line. <br/><br/>Hill Dawson was no exception. <br/><br/>So, Daisy Zane and Clarissa Mason ended up standing together. <br/><br/>Clarissa Mason was also pretty and had a good temperament, but when she stood next to Daisy Zane, her looks and temperament were overshadowed. <br/><br/>She even looked a bit plain and rustic. <br/><br/>“What are you doing here? Do you think Felix Baker would even notice someone with your fame? Coming here is a waste of time,” Clarissa Mason whispered. <br/><br/>“If you’re not afraid of it being a waste, why should I be?” Daisy Zane kept looking forward without even glancing at her. <br/><br/>“What do I have to be afraid of? I have works and fame,” Clarissa Mason said, <br/><br/>“What about you? You have nothing.” <br/><br/>“I’ll have those in the future. You, on the other hand, may not.” <br/><br/>Amelia Miles followed closely behind Olivia Chester, seemingly ready to show herself to Felix Baker at any moment. Seeing that Clarissa Mason wasn’t by her side, she turned her head and glanced over. <br/><br/>She caught Clarissa Mason and Daisy Zane whispering to each other. <br/><br/>Amelia looked at them with disdain and contempt, and then turned her eyes away. <br/><br/>“Do you think the entertainment industry belongs to your family? You say you’ll have something and you will. But what people ultimately care about in this industry are numbers. Do you think anyone will like you? What a joke,” <br/><br/>Clarissa Mason sneered. “With your current fame, even if you approached him, <br/><br/>Felix Baker wouldn’t even spare you a second glance.” <br/><br/>“Yes, he’d definitely give you a few extra glances.” <br/><br/>“Good that you know.” Clarissa Mason finished speaking and raised her chin. <br/><br/>But she heard Daisy Zane say, “After all, fools always attract more attention wherever they go.” <br/><br/>“You!” <br/><br/>“Lucia.” Hill Dawson tugged at her skirt and quietly reminded her. <br/><br/>Felix Baker didn’t withdraw his hand and even raised his eyebrow to smile at her. <br/><br/>Under the watchful eyes of everyone, Daisy Zane stretched out her hand to shake his, then squeezed his hand tightly with her fingers. <br/><br/>Felix Baker silently gasped for air, his eyes widening in pain, but he managed not to scream. <br/><br/>“This is Lucia’s first time attending such an event. It’s natural for her to be a bit nervous.” Hill Dawson intervened, “Besides, you are her idol. Seeing her idol, she couldn’t react in time due to the surprise.” <br/><br/>Daisy Zane: . <br/><br/>“Am I still Lady Zane’s idol?” Felix Baker was clearly holding back his laughter. <br/><br/>“Of course.” Hill Dawson said, “On the way here, Lucia kept talking about your works. She originally intended to wear the earrings you designed tonight, but she accidentally forgot them in the rush.” <br/><br/>Felix Baker stared at Daisy Zane’s gradually speechless face, and his smile grew rampant: “Really? I wonder which of my works Lady Zane likes the most? I’d like to hear her opinions on my creations.” <br/><br/>“This...” Hill Dawson choked, glancing at Daisy Zane. It’s over, she said too much. <br/><br/>Olivia Chester and Amelia Miles both curled their lips, their eyes filled with mockery. Let her talk, let’s see what she can say. A country bumpkin, does she even know what a Spotlight is? <br/><br/>Just waiting for her to make a fool of herself. <br/><br/>“Fifty-six hairpins.” Daisy Zane stared at Felix Baker under everyone’s gaze and said, “Among all of Mr. Baker’s designs, I have always liked the fifty-six hairpins the most. Each hairpin is designed with the characteristics of different ethnic tribes. Each one has its own uniqueness, but all fifty-six come together as a whole.” <br/><br/>Hill Dawson looked sideways at Daisy Zane, his excited expression seemed to say, you’ve been doing your homework behind my back. <br/><br/>Felix Baker’s frivolous smile on his face suddenly turned serious. <br/><br/>Even a bit uncomfortable. <br/><br/>Perhaps it was because Daisy Zane had been hurting him too much, and he really couldn’t get used to it when she was so sincere in praising him. <br/><br/>“But the other works...” Daisy Zane gazed at him lightly and said, “I think Mr. <br/><br/>Baker should try harder. Design can’t keep up with the concept.” <br/><br/>As expected, being moved is all temporary. <br/><br/>Hill Dawson’s mouth twitched, and he quickly gripped her wrist, pulling her slightly behind him: “Mr. Baker, she really has no filter. Please don’t take it personally.” <br/><br/>“Does Mr. Baker want to hear more? I still have a lot of ‘opinions’ to offer.” Daisy Zane deliberately emphasized the word ‘opinions’. <br/><br/>Felix Baker’s heart skipped a beat, thinking, it’s over, I didn’t control myself and got her riled up. <br/><br/>Seeing him silent, Hill Dawson thought Felix Baker was mad and was about to speak up. Clarissa Mason’s voice rang out first: “Mr. Baker, don’t bother with her.” <br/><br/>While speaking, she swayed her hips and stepped beside Felix Baker: “Mr. Baker, you probably don’t know. Lady Zane grew up in Cold Green Village and hasn’t read much in her life. She barely knows a few big words and hasn’t seen much of the world. With such crude taste, she naturally can’t comprehend your high-end designs..”\t\t\t\t\t\t</div>", "images": {}, "success": true}