{"id": 86, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223357.html", "title": "Chapter 86 - 84: Don’T Want Others To See You", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 86 - 84: Don’T Want Others To See You</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 86: Chapter 84: Don’t Want Others to See You <br/><br/>Translator: 549690339 <br/><br/>Hill Dawson stood at the entrance of the room, unable to move her hand resting on the doorknob, as she heard Kevin Clark’s words. <br/><br/>Kevin Clark felt her gaze and turned around to see her eyes locked on him. <br/><br/>Under her watchful gaze, his eyes gradually turned cold, but his voice remained gentle as he told Daisy Zane, “It seems she said she has something to attend to and won’t be back anytime soon.” <br/><br/>Hill Dawson’s legs suddenly trembled, almost causing her to fall on her knees, before she quickly opened the door and left. <br/><br/>At this time, the door behind Kevin opened as well. <br/><br/>He heard the sound and turned around. Even though he was prepared, he was still stunned by Daisy Zane’s gorgeous appearance. <br/><br/>Daisy Zane’s beautiful phoenix eyes were slightly lifted at the corners, and the makeup artist had drawn a delicate eyeliner along the corner of her eyes, giving her a cold and noble yet somewhat bold look. <br/><br/>Her eyebrows, due to the eyes’ contrast, also appeared to be slightly raised. <br/><br/>Her lip color was a bit deeper than usual, her hair loosely tied at the back, parted into a three-to-seven ratio with the lesser section tucked behind her ear, while the other side was curled down the side of her face, right to her jawline. <br/><br/>Especially the light purple dress she was wearing, her skin barely visible beneath the sheer fabric, revealing her slender neck. <br/><br/>Coldly dazzling, with a touch of carefree elegance hidden within. <br/><br/>“Third Master?” Daisy noticed his stillness and called out to him.” <br/><br/>Kevin moved his gaze downward without changing his expression, clenched his fingertips, and asked, “Is there anything the matter?” <br/><br/>Daisy stepped aside to let him in, saying, “I can’t seem to fasten the strap in the back. ” <br/><br/>In reality, the strap in the back was just a decoration and the zipper had already been pulled up, so she wasn’t in a hurry. <br/><br/>“Let me help you.” <br/><br/>Daisy glanced at him, her eyes seemingly asking, ‘Are you capable?’ <br/><br/>“What kind of look is that?” Kevin laughed, “Can’t I even tie a strap?” <br/><br/>Daisy showed him the dress’s display diagram on the table. There were six light fabric straps, three on each side, which when tied together formed a simple pattern. <br/><br/>Upon closer inspection, one could see it was actually a simple lotus. <br/><br/>The dress was the latest haute couture from Cloud Clothing and Rainbow <br/><br/>Skirts. It continued their theme for the year, “Shallow Purple.” <br/><br/>Each year, Cloud Clothing and Rainbow Skirts would confirm the theme for the following year’s designs at year-end, oftentimes based on traditional colors; then seasonal clothes would be released accordingly. <br/><br/>“Hmm.” Kevin Clark adjusted his cuffs while nodding, his eyes downcast and unreadable. <br/><br/>Hearing his response, Daisy Zane began to walk out. But the moment her hand touched the door, she heard some hurried footsteps behind her. <br/><br/>She frowned, and the next second, Kevin Clark was behind her, turning off the light in the room. <br/><br/>With the curtains drawn in the hotel, the room was instantly plunged into darkness when the light was turned off. <br/><br/>Feeling a sense of danger due to the momentary blindness, Daisy Zane instinctively raised her hand, turned around, and threw a punch at the person behind her. <br/><br/>Her eyes hadn’t yet adjusted to the darkness, but Kevin Clark accurately caught Daisy Zane’s incoming fist, guided her movement, and pinned her against the door. <br/><br/>Fearing she would hurt her back, he cushioned it with his other hand: “Don’t be scared. ” <br/><br/>Daisy Zane’s grip didn’t loosen, and her other hand pressed against his shoulder, looking up at him as she coldly asked, “What are you doing?” <br/><br/>Even through the darkness, Kevin Clark could feel the chill in her voice: “Lucia, if you don’t want to go, then don’t. I’ll handle the director and the endorsements.” <br/><br/>Daisy Zane didn’t move or say anything. <br/><br/>Kevin Clark always reduced his oppressive aura in front of her. But when he just walked over, it was as if he was furious. <br/><br/>Otherwise, Daisy Zane wouldn’t have fought him. <br/><br/>Even now, he hadn’t fully suppressed his aura, but his tone was gentle, as if he was coaxing and comforting her. <br/><br/>“Alright?” <br/><br/>“You...” Kevin Clark was close, and his voice was already pleasant, not to mention the show of weakness. Daisy Zane’s grip on him involuntarily loosened a bit, “I’m already here.” <br/><br/>As her eyes gradually adjusted to the darkness, Kevin Clark looked down at her, moved closer, and whispered softly, “I’ve been wanting to say this since yesterday. But I also wanted to see you dressed up in a beautiful gown, so I refrained from saying anything.” <br/><br/>A question mark appeared in Daisy Zane’s eyes, as if to say, “Is there something wrong with you?” <br/><br/>Kevin Clark’s red lips curved slightly, his desire to possess her nearly spilling out of his eyes, his voice even lower than before: “Now that I’ve seen you, I don’t want anyone else to.” <br/><br/>The low, deep voice flowed into her ears and seemed like a clear spring entering her heart. When it reached the bottom, it stirred up splashes of water. Daisy Zane’s heart felt like it was struck by the water splashes and suddenly sped up. <br/><br/>This unfamiliar feeling made her frown. <br/><br/>She looked up and met Kevin Clark’s gaze, his long, narrow eyes containing both wickedness and unfathomable tenderness. <br/><br/>Surrounded by darkness and silence, their breaths intertwined. <br/><br/>The hand Kevin Clark placed on her back suddenly exerted force, pulling her closer to himself, before lowering his head and gently kissing her lips. <br/><br/>Daisy Zane’s pupils trembled, and the hand resting on his shoulder clenched on his clothes. <br/><br/>Seeing no resistance from her, Kevin Clark gently pressed his lips against hers once more before slowly pulling away a bit..\t\t\t\t\t\t</div>", "images": {}, "success": true}