{"id": 87, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223359.html", "title": "Chapter 87 - 85: Think About It", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 87 - 85: Think About It</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 87: Chapter 85: Think About It <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane wasn’t a teenager who knew nothing. Not only did she know things, she knew too much. <br/><br/>She even knew what men liked and how to please them. <br/><br/>But knowing and practicing were two different things. <br/><br/>Although she knew all these things, she had never used them on anyone. Updated from novelbIn.(c)om<br/><br/>When Kevin Clark suddenly made a move, she was indeed a little dumbfounded. <br/><br/>There was even a moment when she felt her mind went blank. <br/><br/>As Kevin Clark moved away, seeing her slightly bewildered look, he rubbed her wrist with his thumb and said sincerely, “I’m sorry, I couldn’t help it.” <br/><br/>Daisy Zane’s gaze was slightly unfocused. <br/><br/>“Lucia...” Kevin Clark looked at her seriously, “Do you want to consider having a boyfriend?” <br/><br/>He had planned to say this later, but he suddenly made this move. He couldn’t just take advantage of her and give no promises. <br/><br/>Fearing that it would be too sudden and difficult for her, he added, “Just think about it, alright?” <br/><br/>With that cajoling tone, Daisy Zane’s eyes focused as she looked at his beguiling face and her expression became a bit agitated. <br/><br/>She didn’t understand why she was agitated. <br/><br/>Seeing her like this, Kevin Clark let go of her hand and thought for a moment before saying, “How about you hit me a few times? I won’t fight back.” <br/><br/>Hearing this, Daisy Zane’s expression immediately turned cold and she raised her hand to strike him on the shoulder. <br/><br/>She used at least 70% of her strength, which was much more than when she almost hit him earlier. <br/><br/>Kevin Clark bent over and suddenly sucked in a breath. After a moment, he looked at Daisy Zane with a smile. <br/><br/>As their gazes met, Daisy Zane wanted to hit him again but ended up just looking at him for a while before turning around to push the door open. Before she left, she said, “Stay here, don’t follow me.” <br/><br/>The light from outside shone in and Kevin Clark saw her pink neck and hesitated a bit. <br/><br/>As the door closed, the room plunged back into darkness. Kevin Clark froze for a moment, rubbing his shoulder, and gradually the corners of his mouth lifted into a smile. <br/><br/>Afterward, she continued introducing Daisy to some producers, investors, and others she was more familiar with. <br/><br/>There was a performance on stage that hadn’t started yet, so people were holding wine glasses and chatting about the place. Only a few industry heavyweights sat in their seats, waiting for others to come and toast them. <br/><br/>Daisy’s appearance and outfit drew attention. After all, Cloud Clothing and Rainbow Skirts’ clothes were not something anyone with money could buy and wear. <br/><br/>As a result, everyone took a glance and whispered about her. <br/><br/>“Zane, smile, smile,” whispered Emily. <br/><br/>Daisy glanced at her and forced a smile. <br/><br/>In such a noisy environment, Daisy was already doing her best to be polite and stay here without a cold face. <br/><br/>Emily: <br/><br/>“Aren’t you here with an artist too, Emily?” <br/><br/>The pretentious voice could only belong to Olivia Chester. Both of them turned to look at her. <br/><br/>Clarissa Mason and Amelia Miles were standing behind Olivia. <br/><br/>Emily immediately showed a very friendly smile: “Olivia, you’re here too. Look at you, so busy every day, and you still have to bring your little minions to attend events. It must be so tiring.” <br/><br/>“Ah!” said Emily, covering her mouth, “I misspoke, I misspoke. What minions? Olivia’s artists are all very capable, not useless troops at all.” <br/><br/>Clarissa Mason’s face darkened, but in this media-filled environment, she had to keep smiling, though it looked distorted. <br/><br/>Olivia was also smiling appropriately, saying, “Emily, you’ve also made time to bring your artist here. I think you’d be better off staying home with your kids. Coming here is a waste.” <br/><br/>“How could it be a waste?” Emily laughed happily and even patted Olivia’s arm affectionately, “Our Zane can easily take the roles you’re eyeing, and you can’t do anything about it. We’re practically a bright future waiting to happen.” With that said, Clarissa’s smile became even more twisted. <br/><br/>Amelia Miles, on the other hand, had been very well-behaved, occasionally looking at Daisy Zane as if they were close sisters. <br/><br/>“Bright future?” Olivia also laughed kindly, “This barely passable girl, wearing any clothes is just a waste.” <br/><br/>“I know you’re just jealous,” Emily laughed and patted Daisy’s hand, “Look at Olivia, she’s jealous. Look at that jealous face.” <br/><br/>Daisy Zane: “......”You two are wasting your talents by not acting. <br/><br/>Olivia wanted to say something else, but she suddenly saw Felix Baker and, without another word, walked away with Clarissa Mason and Amelia Miles. <br/><br/>Emily followed Olivia’s gaze and saw Felix as well, so she pulled Daisy along and walked in that direction, “Zane, hurry up, let’s go and toast him too.” “Hurry, hurry, look at all those people, we can’t be left behind..”\t\t\t\t\t\t</div>", "images": {}, "success": true}