{"id": 89, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223363.html", "title": "Chapter 89 - 87: Act Early", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 89 - 87: Act Early</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 89: Chapter 87: Act Early <br/><br/>Translator: 549690339 <br/><br/>At the place where Felix Baker stood, there were naturally many people. Even though Clarissa Mason’s voice was not loud, everyone around still heard it. <br/><br/>There were smirking and discussing. <br/><br/>Most of them didn’t know about the Cold Green Village. <br/><br/>Amelia Miles heard this and a hint of laughter emerged in her eyes. <br/><br/>She knew that bringing this woman would save her a lot of trouble. It seems that she did not inculcate those ideas into her for nothing. <br/><br/>They did come in handy at critical moments. <br/><br/>“Furthermore...” Clarissa Mason covered her mouth with her hand, leaned closer to Felix Baker and whispered, “She’s an illegitimate daughter.” <br/><br/>When she finished, Clarissa Mason couldn’t help but laugh, looking at Daisy Zane with eyes full of triumph and provocation. <br/><br/>“Clarissa Mason, isn’t it a bit too much to make fun of other people’s origins?” Hill Dawson said. <br/><br/>“I am just stating the facts, not joking. She has such a background, can you blame me? It’s not like people can’t talk about it.” Updated from novelbIn.(c)om<br/><br/>Felix Baker lowered his eyes, the corners of his mouth slightly hooked up, and then looked at Clarissa Mason and said, “Miss, you said she has poor taste. But <br/><br/>Lady Zane just said she likes my designed hairpin. Are you saying my design is also in poor taste?” <br/><br/>The smile on Clarissa Mason’s face quickly disappeared, turning into shock in an instant, as if she hadn’t heard what Felix Baker was saying. <br/><br/>Seeing this, the discussions around them gradually died down as well. <br/><br/>Felix Baker still maintained a gentle smile on his face, his tone very mild, “You said she is uneducated, so what? Are uneducated people born inferior? Do people born in Cold Green Village not have the right to struggle and strive?” <br/><br/>“I...” Clarissa Mason’s face turned pale quickly, and she couldn’t help but stagger backward. “I didn’t mean...” <br/><br/>“I think some educated people are just wasting educational resources while still having a low quality.” Felix Baker didn’t show any mercy at all. <br/><br/>On his turf, bullying his Chief Designer, did they think he was dead? <br/><br/>“Today is the Spotlight’s gala event, I’m discussing some design ideas with Lady Zane. This lady barges in without any care, even saying some absurd things. Are you trying to slap my face? Or the face of Spotlight?” <br/><br/>“I don’t mean that, I haven’t. I didn’t mean that,” Clarissa Mason panicked. <br/><br/>“Felix Baker is a smiling tiger. On the surface, he is gentle as jade, but deep down, there’s a vicious wolf,” said Phoebe Turner, who was almost fifty but well preserved, appearing to be in her thirties. <br/><br/>With a beautiful face and charming eyes, every move she made was enchanting. Her sensuality, maturity, and liveliness were fully embodied in her. <br/><br/>“He is only after his own interests. He wouldn’t stick his neck out for just anyone,” she said, looking at Kevin Clark. “You understand what I’m saying, don’t you, Kevin?” <br/><br/>Kevin Clark looked down at the people below, his eyes ruthless. <br/><br/>Anyone with eyes could see that Felix Baker had taken a liking to Daisy Zane. <br/><br/>“Kevin, since you’ve taken a fancy to such a beauty, you have to bear the pain of her being liked by others,” Phoebe Turner said. “Besides, she’s in the entertainment industry, and there will be many fans in the future. More people will like her. You understand what I’m trying to say, right?” <br/><br/>Kevin Clark looked at her and replied, “I understand. Like Xavier Dominic’s father, I should make a move early, legalize the relationship, and then whoever likes her, I’ll show them the marriage certificate, so they won’t dare to covet her.” <br/><br/>Phoebe Turner’s mouth twitched. Is that what I meant? <br/><br/>“You stay here and rest for a while, I’ll go downstairs to take care of some things,” Kevin Clark said before turning and leaving. <br/><br/>Phoebe Turner looked at him, then at the assistant behind her, speechless. <br/><br/>What she meant was that he should have the awareness of being a celebrity husband, not to be jealous. Instead, she was not trying to make him go down the same old road as Henry Horton. <br/><br/>A lovely young girl, who would willingly get married and become pregnant at an early age! <br/><br/>You didn’t understand a damn thing! <br/><br/>Felix Baker originally intended to take Daisy Zane to the rest area, but he was just about to reach the door when someone called him away. So, he just opened the door for her to rest and went to deal with his business without even having the chance to say a few words. <br/><br/>Upon entering the room and closing the door, Hill Dawson burst into laughter, “Oh, that was so enjoyable. You didn’t see the look on Olivia Chester’s face; it was even blacker than the bottom of a pot.” <br/><br/>Daisy Zane sat down on the sofa, pressing her forehead, finally finding some peace. <br/><br/>“Lucia, do you think Felix Baker is into you?” Hill Dawson sat down next to her. <br/><br/>“Why would he protect you like that?” <br/><br/>Daisy Zane wanted to say because he started the confrontation in the first place, so of course he would protect her, or else he might be beaten to a pulp tonight. In the end, she just said: “I’m not interested in him.” <br/><br/>Hill Dawson laughed, “True, although he’s good-looking, he still falls short compared to Third Master.” <br/><br/>Hearing the words “Third Master,” Daisy Zane couldn’t help but purse her lips slightly, feeling a heated sensation on her lips. <br/><br/>Suddenly, she realized that the development of some events might have deviated from her expectations..\t\t\t\t\t\t</div>", "images": {}, "success": true}