{"id": 83, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223351.html", "title": "Chapter 83 - 81: Mrs. Davis", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 83 - 81: Mrs. Davis</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 83: Chapter 81: Mrs. Davis <br/><br/>Translator: 549690339 <br/><br/>Ever since Clarissa Mason had released two videos from Maple Elite <br/><br/>Entertainment to clear her name, she had been worried about being exposed. <br/><br/>After all, she had arranged for a hacker to steal the surveillance footage, and she was the only one who had the video from the changing room. <br/><br/>She didn’t know how Daisy Zane had found the video. <br/><br/>She hadn’t been able to sleep or eat well for several days. She kept checking online for the news, fearing that there would suddenly be a report targeting her. <br/><br/>Moreover, she could not get in touch with Joseph Johnsonspace anymore. <br/><br/>Her nerves were constantly on edge, and her heart would race every time her phone rang with a message, feeling on the verge of an emotional breakdown. <br/><br/>However, as the days went by and nothing happened to her, and the hacker did not do anything else, her emotions gradually stabilized. <br/><br/>Shrouded with a sense of luck, she gradually began to consider her schemes again. <br/><br/>But even with the news handled so quickly, there was one thing that she wished for. <br/><br/>Liam Davis’s mother went directly to Daisy Zane’s drama crew. <br/><br/>That afternoon, Daisy Zane, Anisa Cooper, and Robinson Scott were headed to the nanny car just after finishing their work. <br/><br/>Before they could reach the car, a man got out of a nearby Rolls-Royce and walked towards them. <br/><br/>At first, the three of them didn’t pay much attention since he was still far away, but as he approached, they realized he was heading towards them, and they stopped. <br/><br/>The man glanced at the three of them, and then said formally, “Is it Lady <br/><br/>Zane?” <br/><br/>Daisy Zane replied with a nod. <br/><br/>The man showed a smile, “Lady Zane, our Madam has requested to have a few words with you.” <br/><br/>“Which Madam are you talking about?” Robinson Scott glared at him, his tone not very pleasant. <br/><br/>“The Johnson Family in Truro City.” The man’s tone naturally carried a few hints of arrogance. <br/><br/>“I don’t know her, and I don’t recognize her,” Robinson Scott replied, “Don’t delay our trip home.” <br/><br/>Just then, Daisy Zane remembered the messages Liam Davis had sent her. Since then, he would send her greetings every now and then. <br/><br/>Although she hadn’t responded and even blocked him, he would change his mobile number and continue to send messages. <br/><br/>“Lead the way.” <br/><br/>Robinson Scott and Anisa Cooper looked at her. <br/><br/>The man said, “This way, please.” <br/><br/>“You two go back to the car first,” Daisy Zane instructed. <br/><br/>“Daisy, let me follow you,” Anisa Cooper said worriedly. <br/><br/>It was a coldness that made one feel as if she was standing right in front of them but still out of reach, untouchable. Coldness that made her calm words feel extremely oppressive. <br/><br/>After she finished, she ignored the ashen-faced Mrs. Davis sitting opposite her. She got up, went to the order desk to get her coffee, paid, and left. <br/><br/>Before leaving, the waiter who served her just now gave her a thumbs up. <br/><br/>Back in the nanny car, after giving the lattes to Anisa Cooper, Robinson Scott, and the driver, Daisy Zane didn’t get in. Instead, she walked a little further and <br/><br/>got into a Maybach. <br/><br/>Arthur North was working on his computer in the car. Hearing the door open, he looked up, smiled at Daisy Zane, and took the drink from her hand: “Did you also go to buy drinks?” <br/><br/>“Yeah. On the way.” <br/><br/>After sitting down in the car, Daisy handed a cup of coffee to the person in the front, then realized the driver was not Michael Jackson. It was someone she had never seen before. <br/><br/>He had light brown skin, a pair of fox-like eyes, and a pretty good appearance. As Daisy Zane looked at him, he also looked at her, seemingly curious. When he smiled, he seemed innocent and harmless: “Lady Zane, hello, my name is Juan <br/><br/>Wright.’ <br/><br/>“One of the gossips?” <br/><br/>“Yes.” Juan smiled. <br/><br/>Daisy nodded and handed the coffee to him. <br/><br/>“Thank you, Lady Zane.” <br/><br/>“Where’s Michael?” <br/><br/>Arthur looked at Daisy and said, “Lucia, you looking for him like this, to be honest, I’m a bit... <br/><br/>“Don’t be honest. I don’t want to hear it.’ <br/><br/>Arthur, whose words were cut off, didn’t have any temper and was still smiling. <br/><br/>Juan looked at his master smiling, and after being shocked, he took a closer look. He sipped his coffee and said, “I’m basking in Michael’s glory today.” <br/><br/>Juan was probably older than all of them, more stable than Michael, and more familiar with Arthur. <br/><br/>Daisy looked at him and said, “Yeah. Next time I’ll buy you one specially.” <br/><br/>Juan looked at Daisy through the rearview mirror, and to be honest, when Thomas Firway and the others said she was beautiful, he didn’t really pay attention. But seeing her in person, he was indeed amazed. <br/><br/>Her beauty was so stunning, the more he looked at her, the more he liked it. More importantly, she didn’t seem simple, which was exactly how Thomas had described her. Juan could almost instantly tell that she would become the future mistress of the house. <br/><br/>It was because the aura emanating from her, although different from his master’s, still belonged to the same class. <br/><br/>This woman was not simple, and that was Juan’s first... second impression of her. <br/><br/>His first impression was that she was so beautiful that she was a perfect match for his master. <br/><br/>“Thank you, Lady Zane.” <br/><br/>Daisy sat down, opened the coffee, and handed it to Arthur. Arthur took it and said: “Thank you, Lucia.” <br/><br/>“Where’s Thomas? I haven’t seen him for a long time.” To be precise, after the last trip to Red Cliff Village together, she hadn’t seen him since. <br/><br/>“Exiled.” As Arthur spoke, he rolled up Daisy’s down jacket sleeve for her. <br/><br/>Daisy raised an eyebrow: “That’s kind of harsh..”\t\t\t\t\t\t</div>", "images": {}, "success": true}