{"id": 85, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223355.html", "title": "Chapter 85 - 83: Tattoo On The Left Rear Shoulder", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 85 - 83: Tattoo On The Left Rear Shoulder</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 85: Chapter 83: Tattoo on the Left Rear Shoulder <br/><br/>Translator: 549690339 <br/><br/>The Spotlight Gala was on the evening of December 31. <br/><br/>Although many celebrities were not invited, those with connections could still get in if they wanted to. The more impressive ones could even walk the red carpet. <br/><br/>At first, Daisy Zane didn’t even think about this matter, but on the 30th, Hill Dawson showed up at Everlasting Palace with an invitation in hand. She had no scenes from the 30th to the 1st, so she was resting at home. <br/><br/>“Can I not go?” Daisy Zane asked blankly. <br/><br/>“No, you can’t,” Hill Dawson replied. “The directors of the two scripts that you’re interested in will be attending, and you must meet them. Otherwise, you might not even get a chance to audition.” <br/><br/>Daisy Zane really didn’t want to participate in such large-scale events, as they were way too noisy. <br/><br/>“I got this invitation with the help of John Anderson,” Hill Dawson said. “You must go. We can’t walk the red carpet, but we can meet more people. Aside from the two directors, it’s best if you can also show yourself in front of Felix Baker. Who knows, you might become the spokesperson of the next series or even the brand ambassador.” <br/><br/>Daisy Zane: . <br/><br/>Kevin Clark was also present that day; he sat on the single sofa next to Daisy Zane and clearly saw the moment of disdain in her eyes. <br/><br/>“Olivia Chester is bringing several of her artists along, even Amelia Miles is included,” Hill Dawson said. “Since Phoebe Turner became the global spokesperson, Amelia Miles has been keeping an eye on the spokesperson position for Spotlight’s series.” <br/><br/>“Spotlight only had one global spokesperson and one spokesperson for each series before,” Daisy Zane said. “What? Do you have more insider information?” <br/><br/>“Not really,” Hill Dawson replied. “But what if Felix Baker thinks someone looks good and is suitable for his designs. After all, each series has different designs, and there will always be more suitable spokespersons.” <br/><br/>Daisy Zane wanted to say that someone as stingy as Felix Baker would only spend his money on buying gemstones and not on hiring more spokespersons. <br/><br/>“Come, let’s choose a dress.” Hill Dawson took out her tablet and opened it. “These are the ones I picked out last night. Have a look. Third Master, can you help too?” <br/><br/>Kevin Clark moved over to sit beside Daisy Zane: “Sure.” <br/><br/>Daisy Zane:Did I agree to go? <br/><br/>Daisy Zane sat in the middle of the sofa with the tablet, while Hill Dawson and Kevin Clark looked on from either side. <br/><br/>“What about this one?” Hill Dawson asked. “You’ll look like an absolute flower fairy in it.” <br/><br/>“No,” Daisy Zane replied. “I have a scar on my collarbone, so I can’t show it.” Kevin Clark’s eyelashes trembled a couple of times upon hearing this. “Ah?” Hill Dawson was stunned for a moment. “Is it very obvious?” Updated from novelbIn.(c)om<br/><br/>“Mm-hmm.” Daisy Zane replied nonchalantly. <br/><br/>“Then...” Hill Dawson scrolled down a few more images, discarding all those that revealed the collarbone. “How about this one? Black Swan. <br/><br/>Daisy Zane glanced at Hill Dawson and said, “I have a tattoo on my left shoulder.” <br/><br/>“Okay.” <br/><br/>Hill Dawson and Daisy Zane went to try on the dresses together. <br/><br/>The dress was a perfect fit, as if it had been custom-made for Daisy Zane’s figure. The design of the dress collar was also very ingenious. <br/><br/>It barely covered the scar on her right collarbone and the tattoo on her left shoulder. Although it was a straight collar design, it embroidered small silver lotus flowers at the place where her scar was, connected to the gauze at the back, covering the scar. <br/><br/>On the left shoulder, a large silver lotus flower embroidered to cover the tattoo, connected with the gauze in the front. <br/><br/>What needed to be exposed was exposed, and what needed to be covered was covered. <br/><br/>Her beautiful straight shoulders were hidden under the purple gauze, faintly visible. <br/><br/>“Lucia, if it weren’t for the fact that a Cloud Clothes and Rainbow Skirts haute couture dress takes several months to make, I’d suspect that Third Master had it customized specifically for you.” <br/><br/>After trying it on, Daisy Zane immediately took the dress off: “Let’s go with this one.” <br/><br/>“Why did you take it off? Aren’t you going to show it to Third Master?” Daisy Zane paused while changing, “Why would I show it to him?” <br/><br/>Hill Dawson: “......Ah, he’ll see it tonight anyway.” <br/><br/>In the afternoon, Daisy Zane took a nap. At four o’clock, a makeup artist arrived to do her makeup. <br/><br/>The makeup artist was found by Kevin Clark. He heard that it was Phoebe Turner’s exclusive makeup team. <br/><br/>Phoebe Turner was Allonzo Hobson’s mother, and as the global spokesperson, she naturally had to attend the event tonight. <br/><br/>Throughout the makeup session, the makeup artist kept praising Daisy Zane’s face. <br/><br/>Kevin Clark sat on the sofa behind her, listening to the compliments with a smile on his lips. But Daisy Zane’s face seemed numb, as if she had gotten used to being praised so much that she was not surprised anymore. <br/><br/>Originally, when the makeup artist saw Kevin Clark sitting down, his hand shook a little. But when he saw him smiling and looking at Daisy Zane tenderly, he knew he had won their approval, so he praised Daisy even more enthusiastically. <br/><br/>After the makeup was done, Daisy Zane went to change. <br/><br/>She was able to zip up the dress’s zipper by herself. But besides the zipper, there were a few gauze belts on the back that she couldn’t tie. <br/><br/>She was waiting for Hill Dawson to come in and fasten them for her, but Hill Dawson, who was supposed to accompany her, didn’t come; even when Daisy called out, no one answered her. <br/><br/>Instead, Kevin Clark knocked on the door outside and asked, “Lucia, can I come <br/><br/>“Where’s Sister Emily?” <br/><br/>“She’s taking a phone call.” <br/><br/>Hill Dawson, who was just about to enter and had been sent away, happened to hear this at the entrance:\t\t\t\t\t\t</div>", "images": {}, "success": true}