{"id": 80, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223345.html", "title": "Chapter 80 - 78: One Big One Small", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 80 - 78: One Big One Small</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 80: Chapter 78: One Big One Small <br/><br/>Translator: 549690339 <br/><br/>Hearing the words “I myself”, Daisy Zane’s face turned colder for a moment, remaining silent for two seconds before saying, “Don’t wait for me to ask, just explain everything clearly.” <br/><br/>Charles Amos pursed his lips, lowered his head, and sniffed, “I—I found this address in Uncle James’s cell phone. Then I sneaked out of the house and went to the long-distance bus station without telling Grandpa Edwards. At the entrance of the bus station, I carpooled to Truro City.” <br/><br/>“I followed the three adults, making them believe I was the child of one of them, so the driver took me up.” Charles said softly. <br/><br/>Daisy Zane: . <br/><br/>Kevin Clark looked at this little boy with great interest. <br/><br/>“What about Wilton Edwards?” <br/><br/>“I lit a self-reinforced calming incense at home so they should still be asleep.” Charles whispered, “If they were awake, they should have called you early to say I was missing.” <br/><br/>“Charles. ” <br/><br/>“I was careful with the dose, they won’t be in any trouble.” <br/><br/>Daisy Zane was so angry that for a moment, she didn’t know what to say. At this point, she even had the thought of raising the child so down-and-out that he wouldn’t learn or know anything. <br/><br/>After a while, she finally said, “You go home with this uncle first, and I’ll deal with you when I get back.” <br/><br/>Charles hesitated for a moment, then asked, “Will you come back?” <br/><br/>“Where else would I go if I don’t? You’ve already blocked my door.” Daisy’s icy tone betrayed her helplessness. <br/><br/>Charles immediately smiled, pursing his lips and then handed the cell phone to Kevin Clark. Read latest chapters at novelhall.com Only<br/><br/>“Help me take care of him first, I’ll be right back.” Daisy Zane said. <br/><br/>“Okay,” Kevin replied softly, “Don’t worry, don’t rush.” <br/><br/>“Okay.” <br/><br/>After ending the video, Kevin Clark looked at the little boy, who in turn looked back at him, his eyes holding a bit of scrutiny. Kevin smiled and said, “Let’s go, head home first.” <br/><br/>Charles followed him into the car. <br/><br/>At the entrance to the house, Kevin opened the door and said, “Lucia lives across.” <br/><br/>Charles glanced across and followed Kevin into the room. <br/><br/>Sitting on the sofa, Kevin poured him a cup of hot water. Charles’s small hands were frozen stiff; he held the cup to warm them, and then looked at Kevin sitting opposite him. <br/><br/>Neither of them spoke, just looking at each other. <br/><br/>Kevin looked back at him. <br/><br/>So, when Daisy came, the two of them sat face-to-face in silence for nearly an hour. <br/><br/>Kevin went to open the door, and as their eyes met, he felt the helplessness beneath Daisy’s indifferent expression. <br/><br/>“Where is he?” <br/><br/>“Inside Village.” <br/><br/>As soon as the three words were spoken, the two heard the sound of running footsteps. Soon, Charles passed by Kevin’s legs and hugged Daisy’s leg at once. <br/><br/>Daisy looked down at his curly hair and was silent for two seconds before saying, “Get up.” <br/><br/>Charles Amos couldn’t win the argument and simply closed his mouth sullenly. <br/><br/>Kevin Clark saw Daisy Zane’s expression saying “I haven’t let you off the hook, little bastard” and couldn’t help but lift the corners of his mouth. <br/><br/>Yet when his mouth began to rise, Daisy Zane looked over. <br/><br/>Kevin Clark immediately stiffened, “Ahem, you two talk, I’ll go check the study room.” <br/><br/>When Kevin Clark left, both people in the living room quieted down for a while. <br/><br/>Charles Amos lowered his head, fiddling with his fingers, looking like a submissive child admitting his mistake. <br/><br/>Yet Daisy Zane wasn’t fooled by his appearance, “Now tell me, how are we going to handle this?” <br/><br/>“I’ll copy books,” Charles said, “until you’re satisfied.” <br/><br/>“Charles, you thought of this when you were in the Imperial Capital, didn’t you?” <br/><br/>Charles Amos didn’t answer but admitted. <br/><br/>“Okay, copy books,” Daisy Zane said, “Start with ‘Strategies of the Warring <br/><br/>States,’ then ‘Records of the Three Kingdoms,’ ‘Records of the Grand Historian,’ ‘Turn Left,’ ‘Ramirez’s Spring and Autumn’... ‘ <br/><br/>“So many?” <br/><br/>“More than that. Copy until I’m satisfied.” Daisy Zane touched his head, “Write the words beautifully, I’ll check every day, if I’m not satisfied I’ll have you rewrite it. If you don’t reach the standard, you won’t sleep at night. Got it?” <br/><br/>Charles Amos was overjoyed when he heard “every day” but still pretended with a limp, “Understood.” <br/><br/>Daisy Zane saw his little scheming but did not expose him. <br/><br/>“If you run around on your own again, I’ll break your two little legs.” <br/><br/>Her voice was very gentle, so gentle that it made one’s heart tremble. <br/><br/>Charles Amos twitched his mouth, “There won’t be a next time.” <br/><br/>Then he added, “My legs aren’t short.” <br/><br/>Daisy Zane looked at him, “Hmm, you’re short.” <br/><br/>Charles Amos: <br/><br/>Kevin Clark could hear the conversation between the two of them in the study room clearly. He couldn’t help thinking that the kid is so bold and resourceful, probably learning from Daisy Zane. <br/><br/>Not only did Michael Jackson buy dinner, but he also bought toiletries, clothes, pajamas, and slippers for Charles Amos. <br/><br/>Daisy Zane hadn’t thought about these things at all, but Kevin Clark did. <br/><br/>Later that evening, when Daisy Zane wanted to return to her side, Kevin Clark kept little Charles at his side, letting Daisy Zane go back by herself. <br/><br/>Because before dinner, when little Charles went to the restroom, Kevin Clark stopped him there, and the two made a deal. <br/><br/>Charles would sleep at Kevin Clark’s side, and Kevin Clark would help Charles stay with Daisy Zane. <br/><br/>Then Charles Amos said “really?” to Kevin Clark for the first time. <br/><br/>“Of course. <br/><br/>Charles Amos thought for a moment and finally agreed to the deal. <br/><br/>So when Daisy Zane stood outside the door and heard Charles Amos tell her that “men and women need to have a separation, they have to sleep together,” her forehead twitched a few times. <br/><br/>Especially when the big and small figures standing together, bidding her back to the opposite door, she felt that she might be a bit out of it..\t\t\t\t\t\t</div>", "images": {}, "success": true}