{"id": 84, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223353.html", "title": "Chapter 84 - 82: Changing Teeth", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 84 - 82: Changing Teeth</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 84: Chapter 82: Changing Teeth <br/><br/>Translator: 549690339 <br/><br/>The sun set, the sky was dim, accompanied by a cold wind, which was somewhat chilling. <br/><br/>Mrs. Davis stepped out of the coffee shop and stood on the steps with a face that looked like she had eaten a bitter gourd. <br/><br/>Her lips were firmly pressed together, she was doing her utmost to maintain her dignity. <br/><br/>She did not expect that this countryside-girl would have such a sharp tongue, not only belittling their Davis family but also her son. <br/><br/>Looking down on the Davis family, what audacity she had. <br/><br/>Who did she think she was, thinking she was superior just because she seemed less interested in money and spoke arrogantly? <br/><br/>What a joke. <br/><br/>Liam Davis was enamoured with her, was he blind? Enthralled by her. <br/><br/>A cunning woman, even thinking about entering the Davis household, when there’s no chance she could do that. <br/><br/>Mrs. Davis’ chest heaved violently, she stood at the entrance of the coffee shop for a while before preparing to leave. <br/><br/>Yet, she didn’t know if it was due to the darkness or her anger blurring her vision, she missed her footing while coming down the steps... <br/><br/>There were three steps in total, she tumbled head-first downwards with her foot still on the steps and her head at the bottom. She lay face down there. <br/><br/>“Madam!” The man who had been following her immediately rushed to help her. <br/><br/>Then they went directly from the Film Studio to the hospital. <br/><br/>On the other hand, Daisy Zane had no idea of the damage her words had inflicted. She simply left the coffee shop, saw the look on Mrs. Davis’ face, and returned home in a good mood. <br/><br/>Gideon Amos was usually always with Kevin Clark, only occasionally visiting Daisy Zane when she was resting or when Robinson Scott was home. <br/><br/>Therefore, whenever Daisy Zane came home, she would first go to Kevin Clark’s side, see Gideon, eat, sit for a while, then return to her place. <br/><br/>Today was the same, Juan Wright went back with them. <br/><br/>As soon as the door opened, Gideon ran out, glanced at Kevin Clark, ignored him, and directly wrapped his arms around Daisy Zane’s legs. <br/><br/>Then, like presenting a treasure, he raised his little hand to show Daisy Zane. <br/><br/>Daisy looked down and saw... a tooth in his chubby hand. <br/><br/>“Did your tooth fall out?” <br/><br/>Gideon nodded his head emphatically. <br/><br/>Kevin Clark too looked over and laughed, “Changing his teeth.” <br/><br/>Daisy Zane picked up the tooth, walked in with Gideon, and while changing shoes, she asked, “Finally changed. Did it hurt?” <br/><br/>Daisy Zane looked at Kevin Clark and raised an eyebrow. <br/><br/>The smile on Kevin Clark’s face deepened, “Impressive.” <br/><br/>Past 9 PM, Charles had taken a bath and was now wearing fluffy lion pajamas, his hair half-dry and curly. <br/><br/>Kevin Clark sat on a single sofa, blowing Charles’ hair dry with a hairdryer. <br/><br/>Meanwhile, Daisy Zane was sitting on another sofa, reading over the papers Charles had copied. <br/><br/>Juan Wright, who had been handling business in the study, had opened the door because he needed to talk to Kevin Clark. However, after seeing this scene, he was stunned, quickly shut the door, and retreated back into the study. <br/><br/>He had always thought that any chance of marriage for his respected old man had been completely severed. Falling in love, getting married, having children – he hadn’t even considered these things. <br/><br/>All the eligible ladies in Imperial Capital paled in comparison to this man who wouldn’t even spare them a glance. <br/><br/>Even the Miss of the Maxwell Family, someone so exceptional that she would have been privately acknowledged as a worthy mistress, he had always outright ignored. <br/><br/>But the scene he’d never even dared to imagine suddenly appeared before him. <br/><br/>A warm family of three. <br/><br/>He realized that his respected old man could in fact become this gentle. That he could have eyes only for one person. That he could like everything about a person because he liked her. <br/><br/>When Charles went back to his room to sleep, Daisy Zane returned to her own place. <br/><br/>Upon finding that Robinson Scott had not come home again, she didn’t bother turning on the light and walked directly into the living room and sat down on the sofa. <br/><br/>Surrounded by darkness, the silence allowed her to think. <br/><br/>Some things, when they come to a halt, really can’t be easily continued. <br/><br/>She had to admit that when Charles suddenly sought her out, she didn’t have the heart to drive him away again. <br/><br/>But could she really be with him forever? <br/><br/>If she openly exposed herself, as long as Charles was in contact with her, close contact even, the person tracking her could easily find Charles and perhaps even take him away. <br/><br/>Could Kevin Clark protect Charles? And for how long? <br/><br/>Kevin Clark wasn’t the kind to abuse the kindness of others – there was no reason for him to go out of his way to protect someone he had no relationship with. <br/><br/>Unless they could establish a bond between Charles and Kevin Clark. <br/><br/>Sitting in the darkness for a long time, Daisy Zane took out her cell phone and found a name marked as “Jack Amos” in a hidden list of contacts. <br/><br/>She stared at that name for a while, then opened the chat interface. <br/><br/>Slowly typing the words: [Brother, Charles started losing his baby teeth today. He lost a front tooth and has a bit of speech defect now. I couldn’t help but laugh at him, and he got a little mad at me.] <br/><br/>After sending the message, Daisy Zane remembered Charles’ appearance today and couldn’t help but chuckle. <br/><br/>However, her sent message received no reply. For a long time now, Daisy Zane had been sharing little pieces of information about Charles with Jack Amos in this chat. <br/><br/>But... she was always the only one talking, there was never a reply..\t\t\t\t\t\t</div>", "images": {}, "success": true}