{"id": 81, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223347.html", "title": "Chapter 81 - 79: Illegitimate Daughter", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 81 - 79: Illegitimate Daughter</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 81: Chapter 79: Illegitimate Daughter <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane had to film, so she couldn’t take Charles Amos to the film set. When she wasn’t around, Charles was either looked after by Robinson Scott or Michael Jackson. <br/><br/>Occasionally, when Kevin Clark didn’t go to the film set and was still in Truro City, he would also take Charles out. <br/><br/>So one day at the dining table, everyone was shocked to see Kevin Clark with a child. Someone boldly asked: “When did Third Master have... a child?” <br/><br/>Charles looked like a little girl, but his clothes were all for a little boy. This made people unsure whether he was a son or a daughter. <br/><br/>Kevin Clark calmly replied, “I’ve had him for a while.” <br/><br/>Charles sat next to him, raised his little head and glanced at him, thinking: I knew there must be a purpose to taking me out. You’re trying to establish my identity first before pursuing my mom. <br/><br/>Seeing Charles looking at him, Kevin Clark raised his hand and patted him on the head, pressing his raised little head back down: “Eat well.” <br/><br/>Then Charles ate his meal while hearing more compliments than ever before. Even compliments like “good appetite” were included. <br/><br/>“Naomi Nelson, how about it? Hasn’t our Daisy got a perfect figure?” Robinson Scott finally adjusted to the timezone and had followed Daisy Zane to the drama crew for three days. <br/><br/>Over these three days, she not only became familiar with Anisa Cooper but also George Dunn’s assistant and the director’s assistant. <br/><br/>“Daisy has always been in great shape, I know.” Anisa Cooper said. <br/><br/>“How do you know? Tell me, have you been secretly checking out our Daisy?” <br/><br/>“I’m an assistant; I know Daisy’s measurements.” <br/><br/>Hearing her words, Kevin Clark couldn’t help but furrow his brows, sitting not far away. <br/><br/>“Our Daisy may look thin, but she’s actually quite curvy underneath her clothes. <br/><br/>Everything that should be there is there. No, actually more than there,” said Robinson Scott. “It’s a shame; I don’t know which lucky fool will benefit from that.” <br/><br/>Kevin Clark listened to this and twitched at the corner of his forehead: <br/><br/>Today, Daisy Zane was wearing a somewhat brightly colored cheongsam for her role, which showed a mix of seductive sensuality and intellectual elegance. Just like Robinson Scott said, all of her figure was revealed by the cheongsam. <br/><br/>Especially her waist, which looked so thin that it seemed like an arm could go around it. <br/><br/>From the moment he sat down, Kevin Clark’s eyes never left Daisy Zane. <br/><br/>“Who is it?” Robinson Scott asked out of curiosity, “I just want to know if they’re still alive.” <br/><br/>Daisy Zane ignored her, exited the photos, and read the accompanying text. <br/><br/>[Worthy of being an illegitimate daughter, Little Sam’s daughter, acting bold and intimate in the drama crew’s changing room with a married man. Like mother, like daughter. Picking up married men on purpose.] <br/><br/>Soon this Facebook post was trending, obviously someone had bought its place in the Hot search. <br/><br/>Moreover, the speed was very fast – Daisy Zane’s identity as Truro Song Family’s illegitimate daughter was exposed. <br/><br/>This had to have been done by someone with insider knowledge; if it was just netizens finding out, it wouldn’t have been so fast. <br/><br/>A phone call from Hill Dawson came in almost immediately, but Daisy Zane didn’t take it, letting Anisa Cooper answer instead. <br/><br/>She opened the comments section. <br/><br/>[Wow, she didn’t even go to school, grew up in Cold Green Village, no wonder she has no manners, no upbringing.] <br/><br/>[Her mother is Claudia Zane, hooked up with Johanes Miles, and had her. <br/><br/>There’s cheap blood in her veins, she’s a cheap seed too.] <br/><br/>[They do say that like mother, like daughter. She didn’t learn any of the good stuff, only these cheap things. Enticing married men.] <br/><br/>[Get out of the entertainment industry, what qualifications does a person like this have to be a public figure? I feel sick watching her shows.] <br/><br/>[Daisy Zane, get out of the entertainment industry.] <br/><br/>[This kind of trash, maybe she got her acting roles by sleeping her way in.] <br/><br/>“This must be the work of Paid Trolls, right? People actually believe these things?” Robinson Scott said with an onlooker’s attitude, “We were only in the changing room for a short moment, what could have happened? If something really happened, the man... isn’t very capable and needs treatment.” <br/><br/>Daisy Zane didn’t even bother to answer her. She was browsing through the comments when she caught a glimpse of Kevin Clark taking out his phone and opening it. <br/><br/>She immediately grabbed his wrist, looking at him. <br/><br/>Kevin Clark also looked at her and said, “I’ll have someone handle it, don’t worry about such matters.” <br/><br/>His voice was cold, clearly angry, but he tried to be gentle in order to comfort Daisy Zane. <br/><br/>Daisy Zane smiled and said, “No need, I’ll handle it myself.” <br/><br/>Kevin Clark frowned slightly. <br/><br/>“I can handle it,” Daisy Zane said, “There’s no need for Third Master to take action, especially... regarding the matter of the illegitimate daughter..”\t\t\t\t\t\t</div>", "images": {}, "success": true}