{"id": 96, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223377.html", "title": "Chapter 96 - 94: Eldest Daughter Of Lane Family", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 96 - 94: Eldest Daughter Of Lane Family</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 96: Chapter 94: Eldest Daughter of Lane Family <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane sat on the bed, wearing fluffy pajamas, like a lazy white cat. <br/><br/>She asked quietly after a moment, “Has the man with the last name Bai ever used 319?” <br/><br/>Kevin Clark shook his head: “No.” <br/><br/>Daisy Zane smirked sarcastically: “Then the girl is his girlfriend, and they have been dating for more than a year.” <br/><br/>Kevin Clark didn’t speak, just quietly looked at her. <br/><br/>“I remember reading in the reports about the brick factory that after using 319, some people would become mentally confused.” <br/><br/>“Yeah.” <br/><br/>“So doing certain things at this time would produce physiological reactions more easily than in a normal state.” Daisy Zane spoke as calmly as if they were discussing what they were going to eat later. <br/><br/>Kevin Clark choked on his own saliva: “Cough, cough...” <br/><br/>Daisy Zane looked up at him, realizing she might have said too much: “I mean... <br/><br/>some hideouts should be checked, maybe they hold some clues.” <br/><br/>“I didn’t mean anything, just accidentally choked.” Kevin Clark looked at her and said. <br/><br/>Daisy Zane: . <br/><br/>Kevin Clark laughed, reached out to touch her head, and stood up: “I’ll have someone check it out for me. Just in time, at the end of the year, I’ll do my part for the Sweeping Huang Team’s performance. You wash and rinse, come out for a meal. <br/><br/>“Okay.” <br/><br/>“I bought tickets for a 5 0’clock flight back to Truro City.” <br/><br/>Daisy Zane nodded and asked, “Are you going back also?” <br/><br/>“I...” Kevin Clark raised an eyebrow, “Does Lucia want me to go back with her?” “I don’t.” Daisy Zane blurted out. <br/><br/>Kevin Clark was choked again, and the smile at the corners of his mouth was frozen. <br/><br/>Seeing his expression, a smile appeared in Daisy Zane’s eyes. <br/><br/>Kevin Clark laughed again and said, “I’ll send you to the airport. I still have some things to deal with in the Imperial Capital. I should be able to return after the sixth.” <br/><br/>Daisy Zane nodded. <br/><br/>“Lucia, is your next film going to be shot in the Imperial Capital?” <br/><br/>“No.” Daisy Zane refused succinctly. <br/><br/>Daisy Zane raised her eyebrows: “So... Young Master Lane should call you... Third Uncle?” <br/><br/>“Yeah.” Kevin Clark laughed, “He doesn’t call me that. Instead, he has me call him Brother. We had a fight, and then we called each other by our first names.” <br/><br/>Daisy Zane also laughed, looking out of Kevin Clark’s car window at the convoy outside: “So the Lane Family’s Patriarch is often not in Imperial Capital?” <br/><br/>“Yeah, usually in Oxford City.” Kevin Clark said, “If there’s nothing going on, most of the Lane Family would be back in the capital by January 5th each year.” <br/><br/>“Why?” <br/><br/>Kevin Clark hesitated for a moment. <br/><br/>Daisy Zane looked at him, “I just asked casually. You don’t have to answer.” <br/><br/>“It’s okay.” Kevin Clark said, “January 5th is the eldest daughter of the Lane Family’s birthday. By the 5th, no matter where the Lane Family members are or what they are doing, they will return home.” <br/><br/>So this eldest daughter of the Lane Family is truly a precious gem on a pedestal. Daisy Zane’s first thought was just how grand the event must be. <br/><br/>The Lane Family owns two Doomsday Hotels, where the prices soar sky-high. <br/><br/>She has to admit that she has a bit of a grudge against the wealthy. <br/><br/>“There’s even a young lady in the Lane Family?” Hill Dawson gossiped, “I’ve never heard of it, I only heard there’s a young master Lane.” <br/><br/>Kevin Clark originally didn’t want to say more, but seeing Daisy Zane’s curiosity, he said: “William Lane has two younger sisters. The elder one is twenty-two this year. The younger one is only eighteen.” <br/><br/>Daisy Zane nodded, it seemed the relationship between the Clark and Lane Families was really good. <br/><br/>It turned out that not everything heard from the outside could be trusted. <br/><br/>“So, you’re going back to Truro City on the 6th for the Lane Family eldest daughter’s birthday?” Daisy Zane looked at him calmly, her tone normal, as if it was the most ordinary conversation. <br/><br/>But Kevin Clark’s heart still thumped, and his words stuttered: “I, I...” <br/><br/>Hill Dawson watched the two of them, laughed a little, and turned his head back to stop participating in their conversation. <br/><br/>“I... I have to accompany my parents since my older brother isn’t home.” <br/><br/>Daisy Zane responded with an ‘Oh’, then lowered her head to look at her phone again. <br/><br/>Kevin Clark’s lips moved slightly, a visible sign of inner panic. He licked his lips, and reached out to hold Daisy Zane’s hand: “Lucia.” <br/><br/>The driver had never seen this side of the Third Master before. After holding back for a long time, he couldn’t help but glance at him for a moment. When he looked away, his back was covered in cold sweat. <br/><br/>Thankfully, thankfully, he wasn’t discovered peeking! <br/><br/>“What’s the matter?” Daisy Zane looked as if she had no idea what had happened. <br/><br/>Kevin Clark looked at her carefully. <br/><br/>Daisy Zane looked at him for a moment, then turned her head to look out the window, laughing so hard that her shoulders trembled. <br/><br/>Kevin Clark: “.....” That little girl was messing with him again..\t\t\t\t\t\t</div>", "images": {}, "success": true}