{"id": 99, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223383.html", "title": "Chapter 99 - 97: Fail", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 99 - 97: Fail</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 99: Chapter 97: Fail <br/><br/>Translator: 549690339 <br/><br/>After the last day of filming, Daisy Zane lounged around at home for three days. <br/><br/>During these three days, Arthur North and Charles Amos came to see her during the day. <br/><br/>Moreover, early in the morning on the third day, Arthur North dragged her out for a morning jog. They ran two rounds around the perimeter of the housing estate. <br/><br/>“Daisy, your physical strength is very good, and your stamina is excellent too.” Arthur North spoke while running. <br/><br/>Daisy Zane looked at him: “You’re not bad either.” <br/><br/>Arthur North helped her to tuck her wind-blown hair behind her ears: “Thank you for your praise, Daisy.” <br/><br/>They went back home for a shower and breakfast after the morning jog. <br/><br/>After breakfast, the two adults were sitting opposite each other at a long table, each with a computer. Arthur North was reviewing some new experimental reports, and Daisy Zane was making corrections to a script. <br/><br/>If the two were sitting side by side, it would be very obvious that the line spacing on their respective computers was different. <br/><br/>Charles, on the other hand, was sitting obediently next to Daisy Zane, working on a thick geometry book. <br/><br/>He generally wrote smoothly, but occasionally he would get stuck. <br/><br/>Observing that Charles had been stationary for a while, Daisy Zane would glance over to help him pinpoint the key points or to draw an auxiliary line and such. <br/><br/>“Write your characters neatly..” Daisy Zane said, “Look at how messy yours are.” <br/><br/>Charles glanced at her, erased the characters he had just written with an eraser, and rewrote them. <br/><br/>Arthur North closed a report, opened a new one, and then glanced up when he heard Daisy Zane’s words. <br/><br/>“What’s wrong?” Daisy Zane felt his gaze without raising her head. <br/><br/>Arthur North hesitated, then finally said, “Nothing.” Updated from novelbIn.(c)om<br/><br/>Charles Amos was with him all day; naturally, he had seen his handwriting. Even at his young age, there was a majestic momentum in his handwriting. <br/><br/>It was much better looking than Daisy Zane’s grade-schooler script. <br/><br/>And she had the nerve to complain about Charles’ handwriting. <br/><br/>Sigh— <br/><br/>Forget it, he could not say it. <br/><br/>Arthur North could only divert his gaze back to the computer. <br/><br/>However, upon reading just the beginning of the report, he frowned. <br/><br/>The line spacing of this report was much smaller than the one he had just seen. <br/><br/>Someone had submitted a report without following his instructions again. <br/><br/>Arthur North scrolled up and saw the name. The two big characters “Nicholson Amos” came into his view. <br/><br/>He looked at the two characters, paused for two seconds, then, without hesitation, filled in the score under the name. <br/><br/>Fifty-nine points. <br/><br/>Although all of them were personnel secretly trained by the research institute, they were also students of Imperial Capital University. <br/><br/>They had to pass the exams of Imperial Capital University first, then be selected through three levels of exams by the research institute to become personnel secretly trained. <br/><br/>Her tone wasn’t one of indifference but rather, it seemed like she was ready for a fight to the end. <br/><br/>Daisy questioned the assistant about the issue and after a while, the assistant replied: [The professor said, you should revise your report again. He said if there is another time, then...] <br/><br/>The assistant didn’t finish the sentence, but Daisy had anticipated it wouldn’t be anything good. <br/><br/>Looking at the text “If there is another time”, Daisy frowned. <br/><br/>She had never done anything else but arguing with the professor about the line spacing on her reports. <br/><br/>But... She remembered clearly that she had changed it. <br/><br/>But when she opened her experimental report... She was greeted by the familiar line spacing. It was definitely still eighteen pounds. <br/><br/>Daisy’s temples twitched. She felt like she was seeing a ghost?! <br/><br/>However, she didn’t know, the day before handing in the report, Charles had opened that report when he was using her computer. <br/><br/>Seeing that the line spacing in the report was not like the one she usually used, knowing that she has OCD in this aspect, he kindly helped her revise it. <br/><br/>And Daisy, believing that no one would dare touch her stuff, didn’t check the history. <br/><br/>Helping Charles evade the bullet. <br/><br/>In the office of Johanes Miles at the Miles Group. <br/><br/>Liam Davis, holding three project proposals that Johanes Miles had coveted for a long time, sat in his office. <br/><br/>“Mr. Davis, is this... <br/><br/>“You’re preparing for a family recognition banquet, admitting Daisy Zane rightfully back into the family and these three projects are all yours.” Liam Davis replied, “Afterwards, our Davis and Scarlet families will be united by marriage and the Scarlet family can count on any form of support from the Davis family.” <br/><br/>Johanes Miles looked at the three proposals, slightly stunned: “But.. I met Mrs. <br/><br/>Davis a while ago, and she seemed unwilling to form this alliance...” <br/><br/>“All my mother cares about is that Daisy doesn’t have a rightful identity.” Liam Davis reassured him. “Once you have recognised her as your daughter, she will be the lady of the Scarlet family. With the current status of the Scarlet family, being united with the Davis family would be seen as an equal match. Don’t you agree, Uncle Scarlet?” <br/><br/>A while ago, Liam Davis had been sent abroad by his father. He had just returned the day before. <br/><br/>He heard that Daisy wrapped up filming, so he went to stand at the entrance of the Everlasting Palace early in the morning, hoping to catch a glimpse of her. <br/><br/>Then he saw her, doing a morning run with a man. <br/><br/>Although that man maintained a sensible distance from her. <br/><br/>But he still detected that Daisy’s attitude towards that man was different. <br/><br/>Although he had not interacted much with Daisy, he didn’t understand why he was so enamoured with her. He was so infatuated that it became an obsession; he didn’t even want to look at other women. <br/><br/>It was probably what you’d call love at first sight. <br/><br/>One sight of her and he was hooked, regardless of her personality or background, he would still love her, believing that she’s the best in every way. <br/><br/>So, regardless of the method used, he must marry Daisy Zane. <br/><br/>Even if it meant causing a scene at home, defying his mother or even pressurising Daisy. <br/><br/>The weight of Liam Davis’s words made Johanes Miles feel flattered. <br/><br/>The Scarlet family being an equal match with the Davis family... That was indeed a prestigious alliance for the Scarlet family. <br/><br/>But Johanes was still being a little realistic: “But...Mr. Davis and Mrs. Davis...” <br/><br/>“Uncle Scarlet, you know I’ve taken over the company. I have the final say on all matters in the company.” Liam Davis knew Johanes was a materialistic person, only interested in money, “As for my parents, I will naturally persuade them. So about Daisy, I’ll have to trouble Uncle Scarlet.’\t\t\t\t\t\t</div>", "images": {}, "success": true}