{"id": 95, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223375.html", "title": "Chapter 95 - 93: I Have Never Liked Someone Before…", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 95 - 93: I Have Never Liked Someone Before…</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 95: Chapter 93: I have never liked someone before... <br/><br/>Translator: 549690339 <br/><br/>After the girl was taken away, Kevin Clark had someone search the room they were in. <br/><br/>A few used bottles of 319 were found, but nothing else of use. <br/><br/>Then he took Daisy Zane back to the hotel room. <br/><br/>When they returned to the room, Daisy Zane told Kevin Clark that she was going to her room, changed her shoes, and went back to her own side. <br/><br/>Kevin Clark watched her enter the room, stood at the door for a while, and then went out again. <br/><br/>Almost an hour later, he came back with a food box and a small medical kit. <br/><br/>In the sub-zero temperatures of the Imperial Capital, he was still only wearing that one shirt, and his hands had turned red from the cold. <br/><br/>He put down the food box and medical kit, warmed his hands for a moment, then went to wash up before knocking on Daisy Zane’s door. <br/><br/>It took three knocks before Daisy Zane opened the door. <br/><br/>She had taken a shower, was dressed in her own pajamas, and her hair was still a bit wet: “What’s up? <br/><br/>“I bought some food.” Kevin Clark said, looking at her, “Have something to eat.” <br/><br/>“No need...” <br/><br/>Just as Daisy Zane said those two words, Kevin Clark’s hand pressed directly on the door to prevent her from closing it. Stunned by his action, Daisy Zane didn’t say anything else. <br/><br/>“Have a little.” Kevin Clark’s voice was gentle, but his eyes were strong, as if she wouldn’t be allowed to not eat today. <br/><br/>Daisy Zane was somewhat tired and didn’t want to be standoffish with him, so she came out of the room. <br/><br/>She sat down on the sofa. <br/><br/>Kevin Clark opened the food box and served her a bowl of Red Date and Lotus Seed Porridge. <br/><br/>The porridge was fragrant and steaming hot. <br/><br/>Daisy Zane held it in her hands, stirred with a spoon, and took a bite. <br/><br/>The warmth spread all the way to her stomach, and Daisy Zane’s body warmed up in response. <br/><br/>Kevin Clark watched her take a few bites before opening the medical kit and kneeling on one knee in front of her. <br/><br/>Because of his action, Daisy Zane suddenly sat up straight, and her feet shrank back a bit. <br/><br/>Kevin Clark grabbed her ankle and lifted her foot, making her step on his kneeling leg. <br/><br/>By the time Kevin Clark put down her foot, she was already asleep against the sofa. <br/><br/>Kevin Clark got up, pressed his slightly numb leg, and then leaned over and called her twice. But she only lightly furrowed her brow, without waking up. <br/><br/>Kevin Clark laughed and watched her for a while before gently lifting her up. <br/><br/>Although he moved carefully, Daisy Zane still opened her eyes and looked at him. <br/><br/>“Back to the room,” Kevin Clark whispered softly. <br/><br/>“Mm.” She mumbled her response and closed her eyes again. <br/><br/>It was a rare sight to see her behave so obediently. Kevin Clark’s heart softened, and the corners of his mouth curled, carrying her back to the room. He put her on the bed and covered her with the quilt. Then, Kevin Clark watched her beside the bed for a while. <br/><br/>He investigated 319 because the research institute couldn’t identify the main drug ingredients, and the police had received a murder case, but they were unable to trace the source. He was assisting the case. <br/><br/>But why was she investigating 319? <br/><br/>Her reaction today was so intense...maybe someone close to her had suffered at the hands of 319. <br/><br/>Kevin Clark sat beside her bed for a long time, watching her. It wasn’t until Daisy Zane turned over, and the quilt covered half her face. <br/><br/>He got up, tucked her in, and brushed her bangs to the side. Then, he bent down and lightly kissed her temple before quietly leaving the room. <br/><br/>However, the moment he closed the door, Daisy Zane, who had been sleeping soundly, slowly opened her eyes. <br/><br/>Her eyes were drowsy, and she lazily fluttered her eyelashes twice. Then, she raised her hand to touch her temple, covered her head with the quilt, and slept again. <br/><br/>Daisy Zane slept exceptionally long, all the way into the afternoon. Eventually, Kevin Clark felt that if she slept any longer, it would be too excessive, so he went to wake her up. <br/><br/>“What time is it?” Daisy Zane sat on the bed, half-opening her eyes. <br/><br/>“It’s past two o’clock in the afternoon.” Kevin Clark tidied her hair as he saw her in this state. <br/><br/>“It’s so late.” Daisy Zane clutched the quilt and moved back into bed, letting Kevin Clark sit down, “Did they interrogate that group of people?” <br/><br/>Kevin Clark sat on the edge of the bed: “Mm. They interrogated them overnight.” <br/><br/>“Did they find anything useful?” <br/><br/>“The three people caught in the fire access lane provided information about their supplier,” Kevin Clark said, “I’ve already sent someone to track them down.” <br/><br/>“319 in the hands of Mr. White was sold to him by those three people, right?” Daisy Zane said. <br/><br/>“Mm.” <br/><br/>“Have they investigated Mr. White’s social connections?” Daisy Zane asked, “The people around him, his misfit friends, might also have come into contact with it.” <br/><br/>“Mm, they’re being investigated,” Kevin Clark said, “Don’t worry, I’ve arranged everything. “\t\t\t\t\t\t</div>", "images": {}, "success": true}