{"id": 91, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223367.html", "title": "Chapter 91 - 89: Taking The Opportunity To Hug", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 91 - 89: Taking The Opportunity To Hug</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 91: Chapter 89: Taking the Opportunity to Hug <br/><br/>Translator: 549690339 Read latest chapters at novelhall.com Only<br/><br/>As the deal seemed to be settled, Felix Baker’s smile became much more sincere. <br/><br/>He started to look at Kevin Clark and Daisy Zane as if they were the God of Wealth. <br/><br/>After eating two delicate Osmanthus cakes, Daisy found Felix’s face somewhat repulsive. She poured some more wine in her glass and said, “I’ll toast to Mr. <br/><br/>Baker. Thank you for giving me this opportunity.” <br/><br/>Seeing the eerie cold smile at the corner of her mouth, Felix’s smile stiffened for a moment, “No, no, you should thank Third Master more.” <br/><br/>Daisy smiled but didn’t say anything. She just raised her glass to him, tilted her head back, and drank all the wine in her glass, then looked at Felix. <br/><br/>Under her gaze, Felix had no choice but to drink up as well, “Lady Zane is too polite.” <br/><br/>Daisy poured more wine and said, “For the second glass, I want to thank Mr. <br/><br/>Baker for helping me out tonight.” <br/><br/>Felix’s mouth twitched and he quickly said, “It was just a small effort, Lady <br/><br/>Zane, there’s no need to be so polite.” <br/><br/>Seeing that he didn’t want to drink, Daisy turned her gaze to Anna Skyler. <br/><br/>Anna glanced at Felix, then at Daisy, and finally filled Felix’s glass with wine. <br/><br/>Felix, looking at the glass filled to the brim, scowled at the wolf beside him. <br/><br/>Anna shrank her neck in fear. <br/><br/>“I’ll drink up. Mr. Baker, please.” Daisy finished her wine with her head tilted back. <br/><br/>“Daisy, don’t drink too much. The after-effects of this red wine are quite strong.” Phoebe Turner whispered beside her and then looked at Kevin Clark, signaling him to stop her drinking. <br/><br/>But Kevin just silently sat there, watching, clearly letting her do as she pleased. <br/><br/>Phoebe Turner: <br/><br/>“Why won’t Mr. Baker drink? Is my sincerity not enough?” Daisy asked. <br/><br/>“Not at all.” Felix took a deep breath for the sake of that 60% payment, tilted his head back, and gulped down the wine. After drinking it all, he felt somewhat blurry in front of him. <br/><br/>However, Daisy poured another glass, “With this third glass, I’d like to ask Mr. <br/><br/>Baker to take good care of me in the future.” <br/><br/>As soon as she finished her sentence, Anna was about to pour wine for Felix. <br/><br/>Felix quickly grabbed the wine bottle: “I’ll do it myself.” He poured a small glass for himself, “As for taking care, I’ll have to rely heavily on Lady Zane in <br/><br/>Spotlight.” <br/><br/>Just as Felix spoke, Kevin Clark’s voice rang out. Daisy Zane had been leaning on the restroom door with one leg bent, but she instinctively straightened up as she heard him. <br/><br/>Felix swallowed back his retort. <br/><br/>“Is Third Master coming to the restroom too?” Felix revealed a gentle smile. But Kevin ignored him and looked directly at Daisy: “What took you so long?” “Oh, I ran into a not-so-smart thing and chatted for a bit.” <br/><br/>Felix inhaled deeply, deciding not to argue with her anymore, and said softly, “Third Master, you two chat. I’ll go back first.” <br/><br/>After he left, Kevin turned to Daisy and whispered, “What were you talking to him for so long?” <br/><br/>“Long, was it long?” Daisy tried to hold back without retreating. <br/><br/>“Yes, long.” Kevin could almost be certain that they knew each other, but he didn’t ask any questions. Instead, he just said, “I’ve been waiting for so long that I wanted Felix to just disappear.” <br/><br/>Daisy looked up at him, catching a glimpse of the fleeting ferocity in his eyes. <br/><br/>Realizing that she had noticed, Kevin immediately smiled: “But I’m afraid you’ll get angry, so I didn’t dare.” <br/><br/>Daisy turned her gaze away, pondering for a moment before saying, “Kevin, reconsider the contract with Felix. It’s not worth it.” <br/><br/>Having been called by his name, Kevin was thrilled and gently said, “It’s worth it, totally worth it. Don’t worry, Lucia, I’ve got it all figured out.” <br/><br/>Daisy was about to say something else, when suddenly footsteps were heard from outside. <br/><br/>At least four or five people were rushing in. <br/><br/>Daisy instinctively took a step back, creating some distance between the two of them. But the next moment, Kevin raised his hand to grab the collar of her coat that she was wearing. <br/><br/>As he adjusted her clothes, he pulled her forward a step, pressing her against his chest. <br/><br/>One of Kevin’s hands was on her waist, while the other rested on her head. She was completely enveloped in his embrace. <br/><br/>“Don’t move. A man and a woman in the restroom can’t explain themselves. You’re a public figure.” Kevin whispered in her ear. <br/><br/>Kevin’s coat was on her, with only a shirt underneath. Daisy’s face pressed against his chest, feeling the warmth of his body and his breath near her ear. <br/><br/>Suddenly, her heartbeat sped up again, and she felt a warmth. <br/><br/>People rushed into the restroom, stunned for a moment at the sight of the two embracing, but quickly averted their gaze and entered the men’s restroom. <br/><br/>It seemed they were looking for something, as only one person entered while the others stayed by the entrance. <br/><br/>The man quickly exited and then entered the women’s restroom. <br/><br/>Luckily, there were few people on this floor, and the restrooms were empty. <br/><br/>Daisy couldn’t see, but she could hear the man’s hurried footsteps and the sound of him opening partition doors. <br/><br/>Kevin had his back to them and could only rely on listening, only catching a glimpse of the man’s face when he entered. <br/><br/>The man came out of the women’s restroom and reached for his cell phone as he walked away, accidentally dropping something from his pocket. There was a crisp sound, the sound of glass hitting the ground. <br/><br/>Kevin glanced down instinctively... <br/><br/>The sealing bottle that fell on the ground rolled twice and ended up with the label facing up, which read: 319(i).\t\t\t\t\t\t</div>", "images": {}, "success": true}