{"id": 97, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223379.html", "title": "Chapter 97 - 95: So Cruel", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 97 - 95: So Cruel</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 97: Chapter 95: So Cruel <br/><br/>Translator: 549690339 <br/><br/>On the next day after Daisy Zane returned to Truro City, she started filming. The progress was good, and the shooting went smoothly, finishing a few days ahead of schedule. <br/><br/>Moreover, it just so happened that the final scene Daisy acted in was Riley Maxwell’s last scene as well. <br/><br/>Daisy Zane’s acting was absolutely brilliant, really touching the depths of one’s soul. <br/><br/>Everyone on the film set was touched, and they all emotionally entered the plot. <br/><br/>There was even a fleeting moment when it felt like they had encountered the war-ravaged era separated by a century. <br/><br/>It took the director a while to fully immerse himself before he shouted, “Cut!” <br/><br/>While the others were still immersed, Daisy Zane had already snapped out of character and returned to her usual aloofness, as if she was a cold-hearted person. <br/><br/>Since it was Riley Maxwell’s last scene, <br/><br/>There was a small celebration after filming, with flowers, group photos, and farewells... <br/><br/>But there were still other shooting tasks, so the small celebration ended quickly. <br/><br/>“Hey, Riley, wait a moment.” George Dunn stopped her. “Give me your contact information. When it’s time for the casting of Flynn Ninevara’s script, I’ll let you know.” <br/><br/>Daisy Zane looked at him but didn’t move. <br/><br/>George Dunn took the cell phone from his assistant’s hand, “Hurry up, I still have to change clothes.” <br/><br/>After some thought, Daisy Zane gave him her other mobile number. <br/><br/>She had two mobile numbers: one was more private, and the other was easy to find and she used for her company. <br/><br/>When she had contacted George Dunn in the past, she had used the more private one. Now, she gave him the other number as well. <br/><br/>She had already reminded him twice, but he didn’t believe her. So she would just keep hiding her identity. <br/><br/>“Alright, just wait for my notice.” George Dunn said, “The latest will be right after the New Year.” <br/><br/>“Okay.” <br/><br/>After George Dunn left, Anisa Cooper immediately moved closer, excitedly saying, “Daisy, are you going to be in Catherine God’s drama now? From what Best Actor Dunn said, the chances of it happening are 90%.” <br/><br/>“There’s not even a 1% chance.” <br/><br/>“Huh?” Anisa Cooper’s face suddenly fell. “Why though? You’re so good, Catherine will definitely choose you.” <br/><br/>Daisy Zane glanced at her, not saying anything. <br/><br/>Why? Because when she wrote the script, she never intended to cast herself. <br/><br/>After leaving the film set, Robinson Scott, Kevin Clark, and Allonzo Hobson were all waiting outside. <br/><br/>Their scenes together were few and far between; Daisy Zane had already wrapped up her filming, and they could count on one hand the number of their exchanges on the set. <br/><br/>But... even so, Daisy Zane still felt that Serena Buster seemed to have a different kind of unspoken affection for her... <br/><br/>Serena Buster was a very persistent person. Once she set her mind on a path, even if it was painful to walk, she would keep going. At the same time, her character seemed a bit soft and was easily bullied, not knowing how to fight back. <br/><br/>Maybe she had been bullied before, so when she was talking to others, she was always very cautious and careful. <br/><br/>It was as if she couldn’t determine whether the other person was good or bad, so she was even more cautious. <br/><br/>However, when she faced Daisy Zane, she was very open-minded, always headstrong and never caring about the consequences. <br/><br/>It was as if she had already categorized Daisy Zane as a good person. <br/><br/>By the way, haven’t we met before?” Everyone was watching quietly when Robinson Scott suddenly spoke up. <br/><br/>Serena Buster had been looking at Daisy Zane all the time, only then did she glance at the others and nod. <br/><br/>Daisy Zane glanced at Robinson Scott. In her memory, there was indeed no record of any experience related to Serena Buster. <br/><br/>Robinson Scott walked a few steps closer to Daisy Zane, slung his arm around her shoulder, and said, “Daisy, have you forgotten? It was about two or three years ago, at the Imperial Capital Bar.” <br/><br/>Daisy Zane wanted to say she’d been to so many bars, which one were you talking about? <br/><br/>“That time,” Robinson Scott said, seeing that she didn’t remember, “A man was bullying a female waitress. Touching her and partaking in all kinds of inappropriate conduct, while others were cheering him on. You then took a bottle of wine and smashed the guy’s head.” <br/><br/>Arthur North and Allonzo Hobson both looked at Daisy Zane. <br/><br/>Daisy Zane’s mouth twitched. She did have a vague impression. <br/><br/>Robinson Scott continued, “With one hit, the man’s head started bleedinz, but he still wouldn’t shut up. He held his head in pain while fiercely cursing and saying the waitress should be happy to get touched.” <br/><br/>Serena Buster lowered her head, biting her lip lightly, her face turning a little red. She was the waitress, and Daisy Zane had saved her back then; Serena would always remember that. <br/><br/>“Then what happened?” Kevin Clark asked with a smile, looking at Daisy Zane. <br/><br/>“Then?” Robinson Scott chuckled, “Then, Daisy grabbed the guy’s collar and dragged him into a nearby private room. She stomped on him mercilessly.” <br/><br/>Anisa Cooper’s head snapped like a rattle and she looked at Daisy Zane. Her skinny Olivia sister... was so fierce? <br/><br/>Kevin Clark’s smile froze at the corner of his mouth. <br/><br/>Allonzo Hobson’s eyes widened like a magnifying glass, “No, she stepped on him mercilessly.” <br/><br/>“With a single stomp, Daisy ruined the guy. Oh, the terrible screams,” Robinson Scott narrated vividly, “She even said, ‘Since you look like this, you won’t mind if I step on you, right?”‘ <br/><br/>Kevin Clark: <br/><br/>Allonzo Hobson shivered involuntarily, retreating a few steps, keeping a great distance between himself and Daisy Zane. <br/><br/>Daisy Zane furrowed her eyebrows lightly, “Was I really that cruel back then?” “Do you have any misunderstandings about yourself?” Robinson Scott replied, <br/><br/>“You were much more fierce than that..\t\t\t\t\t\t</div>", "images": {}, "success": true}