{"id": 93, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223371.html", "title": "Chapter 93 - 91: Arrest At The Hotel (Part 2)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 93 - 91: Arrest At The Hotel (Part 2)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 93: Chapter 91: Arrest at the Hotel (Part 2) <br/><br/>Translator: 549690339 <br/><br/>Kevin Clark and Daisy Zane both spoke quickly, but they remained calm, lending them an inherent persuasiveness. <br/><br/>The man in front of Daisy Zane received an instruction, immediately pressed his earpiece, and asked the person in the surveillance room. Two seconds later, he got a reply: “Third Master, they’re going up the stairs.” <br/><br/>“Which floor are they on now?” <br/><br/>“Between the 15th and 16th.” <br/><br/>Without any need for communication, Daisy Zane and Kevin Clark simultaneously turned and entered the elevator that had been parked on the 12th floor. <br/><br/>Upon entering the elevator, Daisy Zane pressed the button for the 17th floor, and then the 21st floor: “You take the fire access lane from the 17th floor. I’ll go from the 21st. <br/><br/>“We’re not sure if they’ll keep going up,” said one of the two men who got into the elevator with them. <br/><br/>“I’ll bet they keep going up. They won’t stop until at least the 25th floor,” replied Kevin Clark. <br/><br/>Daisy Zane glanced at him and then subtly curved her lips into a smile: “It seems we are synced up. Have the surveillance room keep us updated on their progress.” <br/><br/>“Yes.” The bodyguard instinctively obeyed Daisy Zane, placing her words on par with Kevin Clark’s. <br/><br/>Kevin Clark also laughed and gave her hand a squeeze. <br/><br/>The elevator quickly reached the 17th floor, and Kevin Clark took one of the men with him. <br/><br/>The other man continued upwards with Daisy Zane. <br/><br/>At this point, the two of them acted in unison, in a natural partnership that required no words. <br/><br/>By the time they reached the 21st floor, there was a message from the surveillance room that their targets had reached the 19th floor. <br/><br/>As soon as Daisy Zane exited the elevator, she began to run towards the fire access lane. <br/><br/>Despite being dressed in a dress and high heels, Daisy Zane ran steadily and quickly. She matched the pace of the professional, specially trained bodyguard by her side. <br/><br/>Halfway there, as though considering her dress an encumbrance, Daisy Zane tossed it to the bodyguard for him to hold. She picked up the skirt hem, and her speed increased further. <br/><br/>The bodyguard was stunned for a moment, a twitch appearing at the corner of his professionally trained lips. <br/><br/>This... this beautiful woman, how can... she be so powerful. <br/><br/>Upon reaching the fire access lane, Daisy Zane had scarcely pushed the door open when she heard voices below. <br/><br/>They were running up a corner staircase. Daisy Zane stopped on the steps, neither moving nor allowing the man behind her to move. <br/><br/>“Second Brother Davis, there, there are people, chasing. Chasing us.” <br/><br/>“Run faster. <br/><br/>After almost a minute, Daisy Zane suddenly felt that wasting time here was pointless; without saying a word, she turned around, pushed open the door, and walked out. <br/><br/>Kevin Clark’s eyes revealed a moment of panic, and he quickly chased after her: <br/><br/>“Lucia. ” <br/><br/>He reached out to block Daisy Zane, looking at her and saying, “I’m sorry, I was too anxious just now, and my tone was not good.” <br/><br/>Daisy Zane just glanced at him and then lowered her lashes. There was no expression on her face. She was completely like a block of cold stone. <br/><br/>For a moment, Kevin Clark even felt as if she had no feelings at all. <br/><br/>She seemed like a completely different person from the Daisy Zane he usually knew. <br/><br/>“Third Master, I need to hurry to the 12th floor to see that woman.” <br/><br/>Her cold voice made Kevin Clark’s heart tighten. <br/><br/>“I’ll go with you.” <br/><br/>The two of them traveled in silence; by the time they reached the 12th floor, everyone in the corridor had already returned to their rooms; it was very quiet. <br/><br/>By the room where the woman was taken in, several people were standing guard. <br/><br/>“Third Master, despite all the commotion outside, no one has come out from inside, and no movement can be heard,” One of the guards reported. <br/><br/>“Open the door.” <br/><br/>“Yes.” <br/><br/>As the room door was opened, Kevin Clark took a step inside and was immediately hit with the smell of the room. <br/><br/>A strong smell of smoke was mixed with the fishy smell of something else. <br/><br/>Kevin Clark furrowed his eyebrows and subconsciously reached out to hold Daisy Zane’s hand, not wanting her to go in. <br/><br/>But Daisy Zane slipped away, not letting him touch her. <br/><br/>Then, without even glancing at him, she went straight in. <br/><br/>Kevin Clark clenched his fingertips and quietly followed her. <br/><br/>The room was in a mess. There were takeout boxes piled up at the entrance, and clothes were thrown everywhere. <br/><br/>Daisy Zane walked a few steps inside and on the living room sofa, she saw the woman. <br/><br/>She was laying on the sofa, her robe now covered her body. <br/><br/>Her hair was messy and covered her face; her exposed arms, neck, and thighs were all marked. <br/><br/>She was lying there, giving off no signs of life...\t\t\t\t\t\t</div>", "images": {}, "success": true}