{"id": 94, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223373.html", "title": "Chapter 94 - 92: Crazy Criticism", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 94 - 92: Crazy Criticism</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 94: Chapter 92: Crazy Criticism <br/><br/>Translator: 549690339 <br/><br/>Perhaps hearing the commotion outside, the people inside the room came out. <br/><br/>Two men, both wearing bathrobes and with wet hair, seemed to have just taken a shower. <br/><br/>“Who are you?” one of them asked. <br/><br/>No one answered him. <br/><br/>Another man asked: “What do you want!” <br/><br/>Still no one answered him. <br/><br/>“You break into someone else’s room, leave now, or I’ll call the police!” <br/><br/>Kevin Clark furrowed his brow and glanced at the bodyguard behind him. The bodyguard nodded, walked over, and quickly subdued the two men on the ground. <br/><br/>Then he taped their mouths shut. <br/><br/>Throughout the whole process, Kevin’s eyes never looked towards the two men, only watching Daisy Zane’s back from a distance of two meters. <br/><br/>Not only did Daisy not look in their direction, but she also didn’t even seem to hear them. <br/><br/>She just stood in place, staring at the young woman. <br/><br/>Gradually, the scene before her eyes overlapped with the images that appeared in her dreams. <br/><br/>Both were used as 319 victims, both experienced the same fate. The figure in front of her lay desolate on the sofa, while the figure in her dream died right before her eyes. <br/><br/>In the dream, the person’s carotid artery was cut open, blood flowing all over the ground from the deep wound. Even after her body was lifeless, those bastards didn’t leave her alone. <br/><br/>Until she returned, her eyes never closed. <br/><br/>Daisy walked step by step to the sofa, picked up the blanket on the floor, squatted in front of the sofa, and wrapped the girl in it. <br/><br/>She also felt for the girl’s neck pulse, feeling it beating. She withdrew her hand and looked down at her. <br/><br/>If she had returned a bit earlier that day, or if she had been as strong as the person before her, or perhaps if she had been softer inside and not so stubborn, maybe there would be someone with her now. Read latest chapters at novelhall.com Only<br/><br/>Daisy touched the pendant inside her clothes, and after a moment, she stood up and walked directly toward the two men. <br/><br/>As she approached, she leaned down and her right hand gripped one man’s neck, lifting him up. She quickly walked a few steps and slammed him against the wall. <br/><br/>A loud thud sounded as if the man’s organs had been displaced. <br/><br/>The bodyguards who followed her inside stared blankly at this woman. <br/><br/>Not only was she fast and strong, <br/><br/>Kevin gestured for them to leave, and once they had all left, he opened the living room window a bit and then stepped outside as well. <br/><br/>“Third Master... this person... should we send him to the hospital?” The bodyguard asked. <br/><br/>“Isn’t he still alive?” Kevin’s voice became harsher, “Send them all in, interrogate them one by one.””Yes.” <br/><br/>“How is the surveillance check going?” Kevin pressed his brow, his thoughts all on Daisy Zane. <br/><br/>“We did a double-speed check and found no evidence of them interacting with others at the hotel,” said the bodyguard, “We are now looking into the details more closely.” <br/><br/>Upon hearing this, Kevin took out his cellphone and scrolled through his call records, locating Felix Baker’s mobile number and called him. <br/><br/>As soon as the call connected, the person on the other end spoke first, “Are you alright?” <br/><br/>“This is Kevin Clark.” <br/><br/>“Ah, Third Master. That...small...no, Zhang... Tang...” Felix suddenly felt awkward with any form of address and finally went straight to the point, “What about her?” <br/><br/>“She’s fine,” Kevin said, “Once the matter is settled, you can do as you please at the conference hall.” <br/><br/>Having said that, Kevin didn’t want to elaborate further and hung up the phone. Then, he informed Phoebe Turner about it. <br/><br/>Once all arrangements were made, Kevin instructed everyone to leave and stood guard outside the room himself. He also had someone bring clean clothes and sent them into the room. <br/><br/>Considering both the girl’s mental and physical state, Kevin thought they would come out shortly. <br/><br/>However, it was over three hours before he heard the door open. <br/><br/>The girl seemed to have taken a shower, changed into clean clothes, and combed her hair. <br/><br/>Only her eyes seemed somewhat hollow and blank. <br/><br/>Daisy Zane, on the other hand, had returned to her usual state, just a bit colder than before. <br/><br/>“Have someone take her to the hospital.” <br/><br/>“Okay.” <br/><br/>Kevin immediately called someone upstairs, including a female whom he specifically sought out for the task. <br/><br/>They took the girl away. <br/><br/>After a few steps, the girl suddenly turned back to look at Daisy Zane, her previously empty eyes now filled with tears, “Is there really hope for me? Can I really be cured?” <br/><br/>“Yes.” <br/><br/>The word from Daisy Zane was cold but resolute. <br/><br/>Kevin glanced at her and could sense that she wasn’t just comforting the girl, but making a promise. <br/><br/>“Alright, I’ll cooperate with the treatment. Thank you.” <br/><br/>Daisy Zane gave a slight nod, watching them leave.\t\t\t\t\t\t</div>", "images": {}, "success": true}