{"id": 90, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223365.html", "title": "Chapter 90 - 88: How Did My Designer Become Your Man?", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 90 - 88: How Did My Designer Become Your Man?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 90: Chapter 88: How Did My Designer Become Your Man? <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane had been in the restroom for half an hour, and the performance in the conference hall had already begun. <br/><br/>She didn’t find it very interesting, so she decided to leave. <br/><br/>“Wouldn’t it be rude for us to leave if Felix Baker arrives later?” Hill Dawson tried to stop her. “I’ll tell him.” <br/><br/>“How are you going to tell him?” <br/><br/>Daisy Zane got up and walked out, saying to the bodyguard outside the door, <br/><br/>“Tell Felix Baker when he comes back that we’ve left.’ <br/><br/>The bodyguard was startled for a moment before nodding: “Okay.” Updated from novelbIn.(c)om<br/><br/>Hill Dawson :”..... .” What’s the difference between telling him and not telling him? <br/><br/>But Daisy Zane had already left, and she had no choice but to follow. Before leaving, she said to the bodyguard, “Thank you, sorry for the inconvenience. Lucia, wait for me, why are you walking so fast in high heels?” <br/><br/>“I’m tired.” Daisy Zane said as she turned a corner, seeing a figure approaching from the opposite direction, she took a second look involuntarily, then froze in her tracks. <br/><br/>“Ouch.” Hill Dawson almost bumped into her, “Why have you stopped walking?” <br/><br/>Harton Clark was approaching from the other side of the corridor. Broad shoulders, narrow waist, long legs. His features were like a thick ink painting, ethereal and wanton. <br/><br/>As if he had walked out from an ancient painting, he appeared alluringly enchanting. <br/><br/>Daisy Zane watched as Harton Clark approached step by step, stopping just two steps away. His eyes sparkled with mischief as he looked at her. <br/><br/>Daisy Zane:” ......” That ingratiating smile. <br/><br/>Harton Clark watched her for a moment before turning to Hill Dawson: “I’m taking Lucia to meet someone.” <br/><br/>The implication was clear – get lost, you’re in the way. <br/><br/>“Ah, I just remembered something I need to do, I’ll go first. You guys chat.” Hill Dawson made her exit hurriedly. <br/><br/>The moment she walked away, Harton Clark took another step closer, his voice low and gentle as he spoke: “Lady Zane, will you please grant me an audience?” “What for, asking me for a fight?” Daisy Zane gazed at him calmly. <br/><br/>“Fighting is too violent, not good.” Harton Clark replied, “I’d like to take you somewhere fun.’ <br/><br/>Daisy Zane lifted her chin subtly to indicate that he should lead the way. <br/><br/>Harton Clark chuckled lightly, straightened his body, and walked out with her. <br/><br/>Daisy Zane was quiet and seemed calm, but her right hand, which was hanging by her side, was constantly playing with her fingertips. <br/><br/>They entered the elevator and Harton Clark pressed the button for the second floor. He then took off his suit jacket and draped it over Daisy Zane’s shoulders. <br/><br/>“I’m not cold.” <br/><br/>Daisy politely smiled, sat beside her, and then turned her gaze towards Felix Baker and Anna Skyler who were starring at her. <br/><br/>Sensing cold, icy eyes on her, Anna Skyler came to her senses first and lowered her head anxiously, tugging at Felix Baker’s clothes. <br/><br/>Felix Baker finally came to his senses and looked at Kevin Clark: “Third Master...this is...um...the spokesperson you were talking about?” <br/><br/>“Yes.” Kevin Clark sat next to Daisy and poured her a glass of wine, “Is Mr. <br/><br/>Baker satisfied with this deal?” <br/><br/>Felix Baker touched the wine glass and took a sip. In seconds, his brain was working at the speed of light. This was such a great bargain that ‘satisfied’ felt like an understatement. <br/><br/>He had struck such a massive luck, wouldn’t he be struck by lightning? <br/><br/>Wait, isn’t the more important question when did Daisy become his person?! Daisy turned her head to Kevin Clark: “Spokesperson? Deal?” <br/><br/>“I plan to use the spokesperson role as an apology to Daisy.” Kevin Clark said in a low voice. <br/><br/>Daisy’s eyelashes fluttered a bit, deliberately erasing the reason of his apology from her mind: “What conditions were met to secure this?” <br/><br/>With Felix Baker’s stingy character, normal conditions couldn’t have possibly won this. <br/><br/>After asking, she felt Kevin Clark’s response would certainly hold back some details. So, she turned to Felix Baker and casually looked at him: “So, what’s the deal?” <br/><br/>“Ah... The deal... Uh...” Her gaze was too intimidating, Felix Baker glanced at Kevin Clark, then shifted humbly on his seat, and said looking at his wine glass, “Third Master agreed that Spotlight will pay sixty percent of the price for all diamonds and jadeite purchased from D Continent for one year. No matter the quantity purchased, he would bear the sixty percent, and Spotlight will only pay forty percent. The only condition is to offer you a series spokesperson contract. ” <br/><br/>After listening, Daisy didn’t want to say another word. No limit on quantity, would Felix Baker empty the mine on D Continent? <br/><br/>Phoebe Turner meanwhile, put her hand over her mouth and laughed softly. <br/><br/>Kevin Clark, unwilling to push Daisy for romantic progress, had resorted to tossing money at Felix Baker. <br/><br/>It wasn’t just that he had brought along a spokesperson to meet Felix Baker; it was an outright declaration of his authority. There she was, all wrapped up despite the warm room temperature, strictly reserved for his eyes only. <br/><br/>It was him saying to Felix Baker, this woman is mine. You... should not touch and preferably not even look. <br/><br/>But... Felix Baker’s reaction... was a bit odd. <br/><br/>Phoebe Turner caught on to it, and naturally, so did Kevin Clark. He could clearly sense that Felix Baker seemed somewhat afraid of Daisy. <br/><br/>They seemed to know each other. <br/><br/>“Daisy,” Kevin Clark held her hand under the table. <br/><br/>Feeling the warmth, Daisy looked at his hand, and in an instant, her mind was filled with a single thought. <br/><br/>His hand was indeed very warm. <br/><br/>On Felix Baker’s side, seeing Daisy retract her gaze as if she didn’t want to deal with this, he picked up his wine glass, smiled warmly, and said, “So, Third Master... should we set a date for signing the contract?” <br/><br/>“Okay,” Kevin Clark said, “I’ll arrange for my assistant to get in touch with you.” <br/><br/>“Fine. Then, it’s settled.”\t\t\t\t\t\t</div>", "images": {}, "success": true}