{"id": 98, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223381.html", "title": "Chapter 98 - 96: Bullying The Child", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 98 - 96: Bullying The Child</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 98: Chapter 96: Bullying the Child <br/><br/>Translator: 549690339 <br/><br/>In the past, Daisy Zane was indeed more ruthless and wild. Perhaps being young and having fewer concerns, she could hardly control herself. <br/><br/>If there was a matter that could be resolved with one punch, she definitely wouldn’t bother saying a single word. <br/><br/>But now... she’s an actress, a public figure, and has to be measured in everything she does. <br/><br/>Furthermore, her thinking has become much more mature and composed than before, believing that some problems could be solved by talking. Watching others being frustrated to the point of nearly losing their breath was quite enjoyable. <br/><br/>“Were you the waitress?” Daisy Zane asked, looking at Serena Buster. <br/><br/>Serena Buster glanced at her and quickly lowered her head, gently nodding: “You never recognized me, so I didn’t mention it.” <br/><br/>Daisy really didn’t have any impression of this face. <br/><br/>Logically speaking, Serena Buster was so beautiful that she shouldn’t have been unmemorable. <br/><br/>“Brother Nine, she wasn’t this beautiful before.” Robinson Scott whispered very quietly in her ear. <br/><br/>Daisy understood, so she probably really didn’t pay attention to her before. <br/><br/>She reached out and took the gardenia flower pot from her hand: “They seem to be about to shoot over here, you should go check it out.” <br/><br/>“Mm.” <br/><br/>“Do you have anything else to say?” Daisy asked, seeing her not moving. <br/><br/>“Well... I wanted to say thank you.” Serena Buster lowered her head and looked away, “Thank you for recommending me to the director. Otherwise, I wouldn’t have gotten this opportunity.” <br/><br/>Daisy held the flower pot in one hand and twisted a leaf with her other hand, saying, “You don’t have to thank me. I just thought the role would have a better effect with some contrast, so I recommended you. But if you weren’t good enough, you wouldn’t have gotten the role.” <br/><br/>“Yeah, but I still want to thank you.” After Serena Buster said this, she glanced at her, “So I’ll go now.” <br/><br/>“Mm.” <br/><br/>After Serena Buster left, Harton Clark took the flower from Daisy Zane’s hand: <br/><br/>“I’ll help you hold it.’ <br/><br/>“Give it to Charles when we get back, have him take care of it.” Daisy said. <br/><br/>“Ah, what did little Charles do wrong?” Robinson Scott said, “Every day besides copying books, studying, now he has to raise flowers, poor thing.” <br/><br/>“Then you raise it.” <br/><br/>“Ahem...” Robinson Scott coughed a little, “Well, I... I don’t have time, I have to leave tomorrow.” <br/><br/>“Will I see you after the New Year?” Daisy asked. <br/><br/>Michael, who had been watching the whole time: <br/><br/>“So what?” Daisy let Kevin do as he pleased, just looking down at Charles, “Are you saving your money to get married?” <br/><br/>Charles ignored her. <br/><br/>“Fine.” Daisy mocked, “So young and already thinking about a wife, forgetting about your mother.” <br/><br/>Charles looked up at her, huffing angrily. Then he took out his cell phone from his clothes pocket, found the payment code, stood on his tiptoes, stretched out his hand, and handed the phone to the waitress with difficulty. <br/><br/>After that, he got a strawberry-flavored ice cream. <br/><br/>But he only took two bites before Daisy took it away, “Children should eat less.” <br/><br/>Charles’s expression was as if he had been struck by lightning. He should have known, she insisted on strawberry flavor because she wanted to eat it herself! <br/><br/>But Daisy only took one bite before Kevin took the ice cream away, “You should eat less, too. It’s too cold today.” <br/><br/>“Be good,” Kevin said, “Girls should eat less cold food.” <br/><br/>Daisy glanced at the ice cream in his hand. What was the point of her getting out of the car? <br/><br/>Well, it’s better to have one bite than none at all. <br/><br/>She looked down at Charles’s scrunched-up face, thought for a moment, picked him up, and walked towards Snack Street, “Let’s go buy something else to eat.” <br/><br/>Charles immediately smiled, hugging her neck and leaning happily on her shoulder, laughing so much he forgot he was a little buck-toothed kid, <br/><br/>“Alright!” <br/><br/>Kevin looked at their backs, one big and one small, smiling. Then he took a bite of the ice cream in his hand, and the smile in his eyes grew deeper. <br/><br/>Even the deep laughter in his eyes seemed sweet. <br/><br/>Seeing this, Michael took a light breath. <br/><br/>Boss, if you wanted to eat, our family could buy all the ice cream in Truro City. Why settle for leftovers? <br/><br/>Sigh — Men <br/><br/>When Charles, being carried by Daisy, came out of Snack Street, he was put back on the ground. <br/><br/>Taking small steps, he walked on while looking at the eggette in his hand, then at the bags full of food in Michael and Kevin’s hands. <br/><br/>He belatedly realized that Daisy only carried him to make it easier for him to pay. <br/><br/>In just one hour, his little wallet would be empty. <br/><br/>The money he had worked so hard to save for her New Year gift was spent just like that... <br/><br/>Never underestimate a woman’s buying power. It seems that he needs to plan for the future; otherwise, he won’t be able to support her.\t\t\t\t\t\t</div>", "images": {}, "success": true}