{"id": 100, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223385.html", "title": "Chapter 100 - 98: Planning A Family Recognition Banquet", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 100 - 98: Planning A Family Recognition Banquet</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 100: Chapter 98: Planning a Family Recognition Banquet <br/><br/>Translator: 549690339 <br/><br/>“He really said that?” Old Master Miles said. <br/><br/>“Yes.” <br/><br/>After Liam Davis left the company, Johanes Miles went to Old Master Miles’ residence and told him about the whole situation. <br/><br/>“It seems that Liam really likes Daisy.” Old Master Miles remarked. <br/><br/>“Yes.” Johanes Miles made tea for Old Master Miles, “There was no movement for some time, and with her mother telling me those words, I thought he had already fallen for someone else. I didn’t expect that he would still be thinking about her, and he even brought the project proposal directly to my office.” “How did he put it?” <br/><br/>“He said that if I could confirm the date of the Family Recognition Banquet, he would give me all three projects.” Johanes Miles recalled the three projects, his eyes flashing with excitement, “If those three projects can be done, the Miles Group will take another big step forward, which is equivalent to three years less of struggle.” <br/><br/>Old Master Miles chuckled. The laughter clearly contained the thought, “Aren’t <br/><br/>Daisy’s fates with Miles family really as grand as the Grand Master said?” <br/><br/>“That’s just the condition for the Family Recognition Banquet.” Johanes Miles said, “After the two families get married, there will be even more conditions.” <br/><br/>“From the way Liam Davis acts, he’s willing to spend a fortune for Daisy.” Old Master Miles said, “Actually, his plan isn’t bad. When our families join forces, the stronger the Miles family gets, the more advantageous it will be for the Davis family. Both families will be able to progress together and reach new heights.” <br/><br/>“I will.” Hearing that Daisy was like him, Johanes softened a bit. <br/><br/>“If she refuses to see you, pay her a few more visits.” Old Master Miles said, “If that doesn’t work, I’ll go. By virtue of my age, she should still give me some face. <br/><br/>“Alright.” Johanes Miles responded, “Adding more trouble for my father again.” <br/><br/>“Let’s not talk about that within the family.” Old Master Miles took a sip of tea, then paused for a moment to ask, “How is Henry Smith? Last time I spoke to him on the phone, he was just asking about me. I didn’t get a chance to ask him.” <br/><br/>“He has joined the Spotlight company.” Johanes Miles said, “Everything is going smoothly.” <br/><br/>“He insisted on learning jewelry design instead of management.” Old Master Miles said, “He had our family’s company at his disposal but chose to work in someone else’s company. Young people these days have big ideas.” <br/><br/>“He’s still young, and after a few years of experience outside, he will come back. ” <br/><br/>“I know Henry Smith is a responsible person and takes care of the family.” Old Master Miles said, “I just feel that since he’s going to come back eventually, why bother going through all the trouble? What’s the significance of these few years?” <br/><br/>Johanes Miles lowered his eyes to sip tea and said, “Perhaps for him, it is of great importance.” <br/><br/>Old Master Miles glanced at him but didn’t say anything. <br/><br/>Kevin Clark stayed with Daisy in Truro City for a few days and then returned to the Imperial Capital. He took Michael Jackson with him, leaving Juan Wright to take care of Charles Amos. <br/><br/>So even when Kevin was not around, Charles Amos would still go to his place every evening to sleep. <br/><br/>Daisy also visited the laboratory at Truro University several times..\t\t\t\t\t\t</div>", "images": {}, "success": true}