{"id": 109, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223403.html", "title": "Chapter 109 - 106: Slapping The Face", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 109 - 106: Slapping The Face</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 109: Chapter 106: Slapping the Face <br/><br/>Translator: 549690339 <br/><br/>“Is there any more candy?” <br/><br/>Daisy Zane looked back and asked when no one came in. <br/><br/>Kevin Clark fumbled in his coat pocket and gave her two pieces. <br/><br/>“You two are like kids secretly eating snacks in class,” Allonzo Hobson commented from behind. <br/><br/>Director Morris watched and couldn’t make any comments. <br/><br/>He really wanted to object to this marriage. <br/><br/>But upon seeing the usual arrogant Third Master Clark with tender eyes and doting expression, he couldn’t say a word. <br/><br/>“The person who auditioned just now seemed to know you,” Daisy Zane said with candy in her mouth. <br/><br/>“Huh?” Kevin Clark looked at her, “Which one?” <br/><br/>Daisy Zane pulled the audition material from the table and held it up in front of Kevin Clark: “Stella Edwards.” <br/><br/>Allonzo Hobson laughed on the side. <br/><br/>He never thought he would see Third Master Clark freak out in his life. <br/><br/>It really was one thing subsiding another. <br/><br/>Seeing he didn’t respond, Daisy Zane continued, “When Director Morris asked her questions, she glanced at you a few times and even smiled at you.” <br/><br/>Kevin Clark’s forehead twitched: “I... don’t know her well, just met her a few times.” <br/><br/>There were many auditionees, and finding suitable actors required a careful evaluation of each. Besides the Female Lead, there were several other major characters. <br/><br/>Almost all the suitable choices were tested on the spot. <br/><br/>All these role selections were making their eyes sour. <br/><br/>George Dunn was tired from helping on the sidelines. <br/><br/>So they took a 5-minute break. <br/><br/>Daisy Zane flipped through the materials in her hand, recalling each one. <br/><br/>Kevin Clark watched her, then moved up behind her, gently pressing her back of the neck, “Take a break.” <br/><br/>“I’m not tired.” <br/><br/>“Director Morris went outside just now,” Kevin Clark stood behind her, looking at the words on her material, squinting his eyes. <br/><br/>The handwriting was sloppy and not good-looking. <br/><br/>But... it was definitely much better than her usual elementary school-level handwriting. <br/><br/>“He had a smoke,” Daisy Zane said. <br/><br/>Kevin Clark looked away from her writing, saw her hair coming loose, and took out a hairpin to fix it up again. <br/><br/>Daisy Zane just lowered her head and did her own thing, as if it was a normal thing, waiting for Kevin Clark to fix her hair. <br/><br/>Outside the audition room, it was almost Amelia Miles’s turn. <br/><br/>They stood at the entrance, with Olivia Chester holding Amelia Miles’s hand, “Don’t be nervous, I’ll go in with you. We’ve met Director Morris a few times. He may have a temper, but he’ll give me face for the people I bring. You just have to perform well.” <br/><br/>“I’m not nervous,” Amelia Miles said, “I’ve read the script you gave me the day before yesterday. It seems pretty simple..”\t\t\t\t\t\t</div>", "images": {}, "success": true}