{"id": 108, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223401.html", "title": "Chapter 108 - 105 Flynn Ninevara (3)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 108 - 105 Flynn Ninevara (3)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 108: Chapter 105 Flynn Ninevara (3) <br/><br/>Translator: 549690339 <br/><br/>Kevin Clark had been blocked by Morris all along, watching the two whispering to each other, he felt extremely annoyed. <br/><br/>So, he suddenly stood up, walked between them, and forcibly separated them. <br/><br/>Daisy Zane stepped back slightly. <br/><br/>Morris looked at the man who had suddenly appeared in his line of sight, and his brow furrowed slightly. <br/><br/>But he didn’t dare to provoke him, and immediately put on a smile. Adjusting his glasses, he said, “Third Master.” <br/><br/>Kevin Clark tilted his head to look at Daisy Zane, ignoring him. <br/><br/>Seeing this, Morris felt a pang of unease in his heart. <br/><br/>It was over, this young master had truly taken a liking to her. <br/><br/>He quickly stepped in between them again, bringing Daisy Zane closer to himself: “Nana, this is Third Master Clark from the Imperial Capital.” <br/><br/>“Ah, Third Master Clark.” Daisy Zane gave a faint smile and reached out to shake hands with him. <br/><br/>Kevin Clark looked at her hand and also smiled. He firmly shook her hand: <br/><br/>“Daisy, from now on, does this ‘X’ become Flynn Ninevara’s ‘Ninevara’?” <br/><br/>“As you wish, Third Master.” <br/><br/>Kevin Clark squeezed her hand slightly, pulling her towards himself. <br/><br/>Morris hesitated for a moment: “You two know each other?” <br/><br/>Daisy Zane nodded very lightly. <br/><br/>Morris let out a loud sigh of relief: “You should have said that earlier. I’ve been worried for nothing.” <br/><br/>George Dunn couldn’t accept this reality. He went to the restroom to smoke two cigarettes before calming down a bit. <br/><br/>When he returned, everyone was seated, and the audition was about to begin. He glanced over at Daisy Zane, who was sitting next to Morris, and went over to sit beside her. <br/><br/>Daisy Zane was looking at the audition materials and noticed someone sitting down. She glanced to the side: “Best Actor Dunn is back?” <br/><br/>George Dunn swallowed hard, looked at Kevin Clark, who was not far behind Daisy Zane, and then fell silent for two seconds: “Are you really Brook God?” New novel chapters are published on<br/><br/>Daisy Zane took one more look at him and didn’t answer. <br/><br/>Not receiving a reply, George Dunn asked again after a while: “Is it true?” <br/><br/>“Did you donate all your intelligence to your acting skills?” <br/><br/>Morris chuckled at the remark. <br/><br/>And now, she was sitting next to Morris, watching them audition, without publicly revealing her identity. <br/><br/>Anyone would be curious and surprised. <br/><br/>Perhaps, after they left, someone would say something nasty about her. <br/><br/>“Nana, what do you think of these people?” Morris asked, turning his head to her. <br/><br/>But as he finished asking his question, he saw Kevin Clark’s hand fingering the belt on the back of Daisy Zane’s clothes. <br/><br/>Daisy Zane was wearing a long down jacket on the outside and a cotton skirt inside. There was a belt around her waist tied in the back. <br/><br/>She sat upright in her seat and didn’t lean on the backrest. <br/><br/>Kevin Clark’s hand reached through the gap in the chair’s openwork back and was playing with the belt on her back. <br/><br/>Daisy Zane noticed Morris’s gaze but pretended not to see it, saying, “The second and sixth ones are very beautiful.” Morris: All you care about is beauty.” Kevin Clark chuckled softly in the back. <br/><br/>Daisy Zane heard him and gave her belt a tug. <br/><br/>Kevin Clark’s hand was pulled forward by the belt and immediately whispered, “I won’t laugh anymore.” <br/><br/>Morris blinked and suddenly felt that something was off between the two of them. <br/><br/>“Isn’t it because there’s nothing to attract me, so I just look at appearances, right?” Daisy Zane said, “But I think the third one is quite suitable for the supporting female role. What do you think?” <br/><br/>“I think the last one is suitable for the supporting female role.” <br/><br/>Alright, let’s keep watching.” <br/><br/>For the next three hours, Daisy Zane saw a variety of beauties. She enjoyed the view while also not forgetting to work diligently. <br/><br/>She recorded a lot of information on the back of each person’s material. <br/><br/>Because of her quick memory, her handwriting was very messy, and she even used shorthand symbols. <br/><br/>Meanwhile, Kevin Clark wasn’t idle behind her. <br/><br/>One moment, he handed her a piece of candy, the next a small cake. A little later, he gave her a small cookie, then a bag of fruit juice. <br/><br/>As he handed her these things, he noticed that her fingertips were cold. <br/><br/>He took out a small hand warmer from his pocket, shaped like a cat’s paw, and placed it in her hand. <br/><br/>Daisy Zane accepted everything calmly while eating and drinking. <br/><br/>But Morris wasn’t doing so well. Every time he turned his head, he saw Kevin Clark’s outstretched hand. <br/><br/>It was as if he would starve Daisy Zane. <br/><br/>And that feeling, it was as if his cabbage had been dug up by someone else. <br/><br/>It was infuriating..\t\t\t\t\t\t</div>", "images": {}, "success": true}