{"id": 103, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223391.html", "title": "Chapter 103 - 100: Happy Birthday", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 103 - 100: Happy Birthday</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 103: Chapter 100: Happy Birthday <br/><br/>Translator: 549690339 <br/><br/>“Is Charles not here?” <br/><br/>Kevin Clark took off his coat and sat down on the sofa. <br/><br/>“No, I slept all day,” Daisy Zane said, “I told Juan not to come.” <br/><br/>It seems she really was busy these past few days, not avoiding his video calls on purpose. <br/><br/>Knowing the reason, Kevin’s heart lightened by more than half. The smile in his eyes became more relaxed, no longer tense. <br/><br/>It wasn’t that she didn’t want to see him, she was genuinely busy. <br/><br/>Daisy Zane sat on the sofa for a while, then went to her room to fetch something for Kevin. <br/><br/>A neat and delicate pearwood box with hand-carved bamboo on the lid. It looked newly made and freshly carved. <br/><br/>Kevin looked at the box, then at Daisy Zane. <br/><br/>Daisy Zane stood in front of him, backlit by the light. Her bare face, phoenix eyes, and drooping gaze were slightly lazy and cold. <br/><br/>But still breathtaking. <br/><br/>“For me?” <br/><br/>“Mhm,” Daisy Zane said softly, “Happy birthday.” <br/><br/>Kevin was taken aback, “You knew?” <br/><br/>“Mhm,” Daisy Zane replied, “I saw your ID card, there’s no mistake with the date, right?” <br/><br/>Kevin smiled, “No.” <br/><br/>“Then why did you come back today?” Daisy Zane asked. <br/><br/>“I had lunch with my family, then came back,” Kevin looked at her and smiled, “I missed Daisy, so I hurried back.” <br/><br/>Daisy Zane didn’t react to his words in any special way, just very calmly. She only pushed the box in her hand closer to him. <br/><br/>Kevin laughed, “Thank you, Daisy.” <br/><br/>Daisy Zane didn’t say anything, just turned to leave. But Kevin grabbed her hand, “Where are you going?” <br/><br/>“I’m sitting over there.” Daisy Zane pointed her chin at the sofa opposite him. <br/><br/>“Sit here.” Kevin pulled her over to sit next to him. <br/><br/>Daisy Zane didn’t refuse, she took off her slippers and sat cross-legged on the sofa, looking at her cell phone. <br/><br/>Anisa Cooper shared a lot of gossip with her, so she casually flipped through them. <br/><br/>Meanwhile, Kevin opened the wooden box. <br/><br/>It contained an eaglewood bracelet that gave off a rich fragrance the moment it was opened. New novel chapters are published on<br/><br/>Glancing at it, Daisy Zane lowered her head again. <br/><br/>Kevin Clark closed his eyes and chuckled, “Daisy, don’t move around. My self-control isn’t that strong.” <br/><br/>Daisy Zane: . <br/><br/>Kevin Clark didn’t say anything else. He was really tired after so many days without proper rest. <br/><br/>As time ticked by, the quietness around them became overwhelming. All they could hear were each other’s breaths and heartbeats. <br/><br/>After a while, just when Daisy Zane thought that Kevin Clark might have fallen asleep, her stomach growled. <br/><br/>“Gurgle_” <br/><br/>In the quiet, the sound was exceptionally loud and jarring. <br/><br/>Kevin Clark laughed softly, then, whether intentionally or not, nuzzled his eyes against her shoulder. <br/><br/>Daisy Zane could clearly feel his face brushing against the side of her neck. <br/><br/>She suddenly held her breath, her heartbeat becoming irregular in that instant. <br/><br/>Kevin Clark released her, rubbing her head gently: “Sit for a while. I’ll bring Charles over and have Juan go buy some food.” <br/><br/>“Okay.” Daisy Zane replied calmly, showing no signs of emotion. <br/><br/>However, as soon as Kevin Clark left, she curled up on the sofa, sighing softly. <br/><br/>It seemed like the situation was getting complicated. <br/><br/>“Aunt Claire, what’s up?” Amelia Miles was practicing in her dance studio when she suddenly received a call from Olivia Chester. <br/><br/>“Amelia, what are you doing? Are you busy?” Olivia Chester’s joyful voice came through the phone. <br/><br/>“Not really. Aunt Claire, just tell me what’s going on.” <br/><br/>“Well, Catherine God is casting for a drama.” Olivia Chester said, “It’s on the 30th in Imperial Capital. The female lead requires deep dance skills. So I thought I’d let you give it a try.” <br/><br/>“Me? Will I be able to do it? That’s Catherine God!” Even as Amelia spoke modestly, a hint of pride flickered in her eyes, “I’ve never acted before.” <br/><br/>“A lot of people haven’t acted before becoming an actor, but they still win awards. These big productions have training, so don’t worry.” Olivia Chester said, “Plus, your dance skills are outstanding. You’ll definitely have no issue.” “But I never thought about going down the actor route...” <br/><br/>“You’re just experiencing life as a dance actor in the show.” Olivia Chester said, “And it will quickly increase your exposure. Then I can promote your dance further. This is just using the show to boost your visibility.” <br/><br/>Amelia Miles paused for a moment and said, “Indeed, that’s a good idea.” <br/><br/>“That’s right. Even the most talented people need exposure for more people to recognize their abilities.” Olivia Chester chuckled, “This way, whether it’s for future Spotlight endorsements or becoming a disciple of Kiara Lawrence, it will be very beneficial.” <br/><br/>“Aunt Claire, I understand.” Amelia Miles hesitated for a moment before saying, “Will my sister be going too?” <br/><br/>“I haven’t heard anything yet.” Olivia Chester sneered, “I only just saw Morris’s Facebook post about the recruitment order. That mean Hill Dawson will definitely take advantage of this opportunity. She’ll surely take Daisy Zane with her.” <br/><br/>Amelia Miles didn’t say anything. <br/><br/>“But for someone like Daisy Zane who knows nothing, a simple vase, Morris wouldn’t even give her a glance.” Olivia Chester said, “It’s pointless for her to go. It’ll only make her the butt of a joke.” <br/><br/>Hearing this, Amelia Miles’s eyes flashed with a hint of mockery. She smiled and said, “I understand, Aunt Claire. I’ll prepare and head to Imperial Capital tomorrow.” <br/><br/>“Alright, first head over to your uncle’s house.” Olivia Chester said, “I’ve got some things to handle. I’ll come later tonight.” <br/><br/>“Okay.”\t\t\t\t\t\t</div>", "images": {}, "success": true}