{"id": 104, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223393.html", "title": "Chapter 104 - 101: Your Two Children Are So Grown Up Now", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 104 - 101: Your Two Children Are So Grown Up Now</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 104: Chapter 101: Your Two Children Are So Grown Up Now <br/><br/>Translator: 549690339 <br/><br/>Hill Dawson indeed received the audition news, but not from the recruitment order, instead, a phone call from George Dunn. <br/><br/>Because he was concerned that Daisy Zane might not be very reliable, George Dunn called her agent, Hill Dawson, after talking to Daisy. <br/><br/>So Hill Dawson immediately took on a supervisory role. <br/><br/>Early the next day, she went to Daisy’s place, watched her, and forced her to go. <br/><br/>Daisy had not planned to go originally. <br/><br/>But she was so keen, and Morris called later on. <br/><br/>Finally, they only bought afternoon plane tickets. <br/><br/>Not only her ticket but also those for Kevin Clark, Charles Amos, and Hill Dawson. <br/><br/>It’s almost Chinese New Year, she’d have to send Charles Amos back home. <br/><br/>Hill Dawson had never known about Charles Amos’ existence. As a result, a scene emerged of Hill Dawson and Charles staring at each other wide-eyed. <br/><br/>Daisy glanced at the two of them and said softly, “Call her Auntie. His name is Charles Amos. ” <br/><br/>Hill Dawson’s first reaction was that he was called Yenan Amos. Charles Amos looked at her, pursed his lips, and remained silent. <br/><br/>“He doesn’t talk much.” Daisy Zane explained. <br/><br/>Hill Dawson kept looking at him for a while, then looked at Kevin Clark, and then Daisy Zane. Suddenly, many melodramatic plots appeared in her head. <br/><br/>Situations like Daisy Zane having a child for love, meeting the child’s biological father many years later, and the family of three living happily together. <br/><br/>Or events like one-night stand in the past, meeting and falling in love again, and only to find out they have a child. <br/><br/>{“Daisy, you didn’t tell me that you two had a child this big.”} <br/><br/>Daisy Zane was texting Monk Morris and paused when she heard that, turning her head to look at Hill Dawson. <br/><br/>Kevin Clark, hearing that, seemed to pause for a second before starting to laugh. <br/><br/>Daisy glanced at the laughing Kevin Clark and said, “How did you figure out that this child has anything to do with him?” <br/><br/>“No... no connection?” Hill Dawson looked at them again, “But they look a bit similar.” <br/><br/>Daisy Zane also looked, “Where’s the similarity?” <br/><br/>“It’s just... it just feels quite similar.” Hill Dawson finished her remark and stared at Charles Amos again. Then her eyes suddenly widened, she ran to Daisy Zane and whispered, “You actually have a child!” <br/><br/>“I won’t let anyone take pictures of him.” <br/><br/>Her grandmother was no longer there, so returning to Cold Green Village would mean spending the New Year alone. <br/><br/>“How many years is that?” <br/><br/>Grateful for the probing questions, Daisy Zane said, “Ten years.” Charles Amos pursed his lips and sniffed again. <br/><br/>Daisy Zane handed him two tissues, “Hurry up and wipe it, you’ve cried so ugly.” <br/><br/>Charles accepted the tissues and wiped his face as he thought: Women are all superficial visual creatures. Hmph, they don’t care about his inner beauty at all. <br/><br/>The car stopped in front of a large villa, a five-story European-style building. <br/><br/>The yard was beautifully maintained, and there were even two evergreen trees at the entrance... they looked like they had been planted just a few years ago. <br/><br/>As soon as they got out of the car, Wilton Edwards came over with a group of people. <br/><br/>Wearing uniform uniforms, half male and half female. <br/><br/>All of them were the villa’s servants, helping with luggage. <br/><br/>“Miss, Young Master.” Wilton Edwards saw them and smiled with his twinkling eyes. Charles Amos also immediately ran towards him, hugging his leg. <br/><br/>Wilton Edwards quickly picked him up: “Oh my, Young Master, you’ve had me worried sick.” <br/><br/>Charles Amos hugged him around the neck, not saying a word. <br/><br/>Wilton Edwards smiled, then looked at Kevin Clark, “Sir, good to see you.” <br/><br/>Kevin Clark nodded: “Good to see you.” <br/><br/>“This is... <br/><br/>“My agent, surname Zhou.” <br/><br/>“Miss Zhou, nice to meet you.” <br/><br/>Hill Dawson was already dumbfounded, looking at the large villa in front of her and the group of people in front of her, completely stunned. <br/><br/>She wasn’t bringing an artist, but rather, she met a big benefactor. <br/><br/>How did she manage to turn her luck around after taking a two-year break? <br/><br/>Daisy Zane looked at the neatly lined up group of people and asked, “Why are there so many people?” <br/><br/>“They were all handpicked by me to look after the Young Master.” said Wilton Edwards. “Miss, rest assured. I’ve checked everyone and can use them with confidence.’ <br/><br/>Kevin Clark raised an eyebrow, this Wilton Edwards...is quite resourceful. <br/><br/>Daisy Zane nodded her head. <br/><br/>They must be all watching Charles, so he doesn’t slip away or use calming incense again and run off on his own..\t\t\t\t\t\t</div>", "images": {}, "success": true}