{"id": 102, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223389.html", "title": "Chapter 102 - 99: Afraid You ‘Il Help Me Forget", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 102 - 99: Afraid You ‘Il Help Me Forget</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 102: Chapter 99: Afraid You ‘Il Help Me Forget <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane didn’t return to the Everlasting Palace for three consecutive days, staying at Truro University’s laboratory instead. She would rest in the laboratory when she was tired, and continue her experiments after waking up. <br/><br/>As a result, she had been rejecting Kevin Clark’s video calls for three days in a row, switching them all to voice calls instead. <br/><br/>This made Kevin Clark, who was in the Imperial Capital Research Institute, quite uneasy. <br/><br/>He felt as if something bad was about to happen. <br/><br/>Not until the early morning of the fourth day did Daisy return home, took a bath, and went to bed. <br/><br/>However, she was awakened by a phone call at just past ten o’clock. <br/><br/>“Hello, Director Morris.” <br/><br/>The person who called her was her exclusive director, Morris. <br/><br/>Morris was originally a producer with a strange temper sometimes, and often disliked everyone. He was famous for his weird temper in the industry. <br/><br/>Because he couldn’t find a director who could work with the actors, he became a director himself. He personally selected the scripts, actors, and producers. <br/><br/>He even formed his own team, handling a series of productions from <br/><br/>costumes, makeup, sets, to post-production. <br/><br/>Morris seemed to be born specifically for this industry. <br/><br/>By a stroke of luck, Daisy handed her script directly to him. <br/><br/>He was attracted to it at first sight, and since then, he had never used anyone else’s script. <br/><br/>Flynn Ninevara became his exclusive screenwriter, and he became Flynn’s exclusive director. <br/><br/>George Dunn then became the exclusive Male Lead for both of them. <br/><br/>Fortunately, George was a versatile actor, able to fit into any role, saving the screenwriter and director from spending the whole day selecting actors. <br/><br/>Morris was in his forties this year, never married, and had been immersed in movies and TV series all day. Also, he held a high position in the industry. <br/><br/>Many things were done with just a single word from him. <br/><br/>All of Lilian Lopez’s works and variety shows were taken down by Morris’s arrangements. <br/><br/>“It’s so late, and you haven’t woken up yet?” Morris heard Daisy’s vague voice over the phone. <br/><br/>“I slept late,” Daisy said, retreating into the quilt with her cell phone, and speaking in a muffled voice. <br/><br/>“You’re young, and still a girl, so don’t stay up too late. It’s not good for your health, and you’ll age faster.” <br/><br/>“Yes,” Daisy replied, “you’re obviously getting old, and nagging people more.” <br/><br/>“What a way to talk.” Morris’s tone sounded like an elder, “I don’t even nag at others.” <br/><br/>“Yes,” Daisy replied, “what’s up?” <br/><br/>“Ah, almost forgot,” Morris said, “I wanted to tell you that the script has been confirmed and revised. I’m preparing for things here, and I want to set a date for casting.” <br/><br/>“Yes, you’re free to decide,” Daisy knew his speed, like the wind when fast. <br/><br/>“I want to finalize the characters before the New Year, then have Script Reading and Martial Arts Training. The costumes, makeup, and set production will go on simultaneously. We should start shooting about a month after the New <br/><br/>Year.” <br/><br/>“Alright,” Daisy replied. <br/><br/>“I’m thinking of casting on the 30th, would you like to come and take a look?” Finally got to the point. <br/><br/>Before this, Morris never discussed these matters with her, he just went ahead and did them. Only when there was a problem with the script would he contact her. <br/><br/>“We haven’t seen each other in quite a long time,” Morris claimed, “and besides... you wrote the script yourself, don’t you want to audition it yourself?” “I haven’t thought about that, maybe later,” Daisy replied. <br/><br/>“Then come to the scene,” Morris insisted, “it’s so boring to watch the shooting videos every time. If you’re not satisfied with the selection, I find it troublesome to re-select. This time, the Female Lead needs to be able to dance, have a good figure, and give off the vibe of a lady from an ancient noble family. I’m not quite confident about this character setting.” <br/><br/>“What’s the date today?” Daisy asked. <br/><br/>“28th,” Morris replied. <br/><br/>Daisy suddenly opened her eyes that had been closed, and looked at the date on her cell phone with a sleepy gaze. It truly was the 28th. <br/><br/>“What’s wrong? Why there’s no sound?” Morris asked. <br/><br/>“Nothing,” Daisy’s voice was somewhat clearer than before, “I’ll see if I have time to go.” <br/><br/>“Really?” Morris asked. New novel chapters are published on<br/><br/>“Yes,” Daisy confirmed. <br/><br/>“Great, I’ll call you again tomorrow to ask. If there’s no problem, I’ll book a flight for you,” Morris said. <br/><br/>“I can book it myself,” Daisy replied. <br/><br/>After hanging up, Daisy stared at the date on her phone for a while. <br/><br/>Then she opened Kevin Clark’s chat page and stared at it for a while too. In the end, she didn’t say anything. She turned off her phone and went back to sleep. <br/><br/>She slept straight through until it was past five o’clock in the afternoon, and it was already dark outside. <br/><br/>If it weren’t for her phone waking her up again, she might have continued sleeping. <br/><br/>This time the call was from George Dunn. <br/><br/>He first discussed the Male Lead’s character with her, and then asked if she would go to the casting on the 30th. <br/><br/>Daisy told him directly that she wouldn’t go. <br/><br/>However, as soon as she hung up, he called back in. <br/><br/>Daisy stared at the name for two seconds before remembering that he was calling her with another number. <br/><br/>“Yes,” Daisy replied, “what’s up?” <br/><br/>“Ah, almost forgot,” Morris said, “I wanted to tell you that the script has been confirmed and revised. I’m preparing for things here, and I want to set a date for casting.” <br/><br/>“Yes, you’re free to decide,” Daisy knew his speed, like the wind when fast. <br/><br/>“I want to finalize the characters before the New Year, then have Script Reading and Martial Arts Training. The costumes, makeup, and set production will go on simultaneously. We should start shooting about a month after the New <br/><br/>Year.” <br/><br/>“Alright,” Daisy replied. <br/><br/>“I’m thinking of casting on the 30th, would you like to come and take a look?” Finally got to the point. <br/><br/>Before this, Morris never discussed these matters with her, he just went ahead and did them. Only when there was a problem with the script would he contact her. <br/><br/>“We haven’t seen each other in quite a long time,” Morris claimed, “and besides... you wrote the script yourself, don’t you want to audition it yourself?” “I haven’t thought about that, maybe later,” Daisy replied. <br/><br/>“Then come to the scene,” Morris insisted, “it’s so boring to watch the shooting videos every time. If you’re not satisfied with the selection, I find it troublesome to re-select. This time, the Female Lead needs to be able to dance, have a good figure, and give off the vibe of a lady from an ancient noble family. I’m not quite confident about this character setting.” <br/><br/>“What’s the date today?” Daisy asked. <br/><br/>“28th,” Morris replied. <br/><br/>Daisy suddenly opened her eyes that had been closed, and looked at the date on her cell phone with a sleepy gaze. It truly was the 28th. <br/><br/>“What’s wrong? Why there’s no sound?” Morris asked. <br/><br/>“Nothing,” Daisy’s voice was somewhat clearer than before, “I’ll see if I have time to go.” <br/><br/>“Really?” Morris asked. <br/><br/>“Yes,” Daisy confirmed. <br/><br/>“Great, I’ll call you again tomorrow to ask. If there’s no problem, I’ll book a flight for you,” Morris said. <br/><br/>“I can book it myself,” Daisy replied. <br/><br/>After hanging up, Daisy stared at the date on her phone for a while. <br/><br/>Then she opened Kevin Clark’s chat page and stared at it for a while too. In the end, she didn’t say anything. She turned off her phone and went back to sleep. <br/><br/>She slept straight through until it was past five o’clock in the afternoon, and it was already dark outside. <br/><br/>If it weren’t for her phone waking her up again, she might have continued sleeping. <br/><br/>This time the call was from George Dunn. <br/><br/>He first discussed the Male Lead’s character with her, and then asked if she would go to the casting on the 30th. <br/><br/>Daisy told him directly that she wouldn’t go. <br/><br/>However, as soon as she hung up, he called back in. <br/><br/>Daisy stared at the name for two seconds before remembering that he was calling her with another number. <br/><br/>Daisy was speechless for a moment, then answered the phone, “Best <br/><br/>Actor Dunn, what’s the matter?” <br/><br/>“What the fuck!” George cursed as soon as he heard her voice, “Daisy, you just woke up too. I just called Catherine, and she just woke up as well. Your voices sound exactly the same, it scared the hell out of me.” <br/><br/>Daisy: <br/><br/>“Hey, how did you know it was me?” George asked, “I only kept your mobile number, I didn’t give you mine.” <br/><br/>Daisy: <br/><br/>“I wanted to tease you.” <br/><br/>She wondered how she had seen something in this fool in the first place. “Right, I just wanted to tell you. On the 30th, in Imperial Capital, they’ll be casting tor Catherine’s script,” George said, “Do you have time?” <br/><br/>“Yes,” Daisy replied. <br/><br/>“Alright, I’ll send you the exact address, and you can come over. Let me know when you arrive, and I’ll take you inside,” George suggested. <br/><br/>“Yes,” Daisy had nothing else to say to him except that. <br/><br/>“Alright, bye,” George knew she didn’t talk much and wasn’t friendly to people. He didn’t linger and hung up the phone right away. <br/><br/>Daisy threw her phone to the side, looked at the dark sky outside, lay down for a bit, and then sat up. <br/><br/>Anyway, she had nothing to do, so she might as well go straight to Imperial Capital. <br/><br/>As soon as this idea came up, Daisy immediately opened her phone and booked the nearest flight. <br/><br/>She then got up and started packing. <br/><br/>But just as she put her suitcase in the living room, she hadn’t even changed her clothes yet. <br/><br/>The doorbell rang. <br/><br/>As she opened the door, she saw Kevin Clark standing outside, wearing a black trench coat, and exuding a chill. Clearly, he had just returned and hadn’t even entered his home yet. <br/><br/>His eyebrows and eyes were as finely drawn as if they were in a painting, like a mysterious faraway mountain after a light fog, mysterious, wicked, and enchanting. <br/><br/>As Daisy saw him, a fleeting surprise flashed in her eyes, “Why are you back?” <br/><br/>“If I don’t come back, I’m afraid Daisy would forget about me,” Kevin’s eyes were full of a smile, but there was a hint of grievance and pitifulness, “You didn’t even accept my video calls.” <br/><br/>“I’ve been busy this past few days,” Daisy replied, stepping aside to let him in. <br/><br/>Kevin came in and saw her pajamas and disheveled hair. He could tell she had just gotten up, “Were you resting?” <br/><br/>“No,” Daisy said directly, “I just got up.” <br/><br/>Kevin raised his eyebrow, entered the living room, and saw the suitcase, “Are you going out?” <br/><br/>“Yes,” Daisy looked at the suitcase, went to pour him a glass of hot water, “I was planning to go to the airport, but I didn’t make it in time. I’ll try again tomorrow.” <br/><br/>While she was talking, she calmly took out her phone and canceled her flight, which was supposed to take off in more than three hours..\t\t\t\t\t\t</div>", "images": {}, "success": true}