{"id": 107, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223399.html", "title": "Chapter 107 - 104 Flynn Ninevara (2)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 107 - 104 Flynn Ninevara (2)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 107: Chapter 104 Flynn Ninevara (2) <br/><br/>Translator: 549690339 <br/><br/>“Daisy, I’ve met the director, Morris, once before.” Hill Dawson said while walking towards the audition room, “He’s quite arrogant, and sometimes his words can be harsh. You... If he says something, don’t take it to heart.” <br/><br/>“Alright.’ <br/><br/>“Artists tend to have some temper and are proud.” Hill Dawson explained, “Just perform well. Make sure you keep your temper in check and don’t argue with him.” <br/><br/>“Alright.’ <br/><br/>George Dunn glanced at the two whispering and laughed, “Don’t worry. Morris is quite nice, and under normal circumstances, he’s very normal.” <br/><br/>“What about the non-normal situations?” Daisy Zane asked. <br/><br/>“In non-normal situations, just treat him like a mad dog biting people. After he bites, he’ll be fine.” George Dunn said. <br/><br/>Hill Dawson’s mouth twitched a bit. Sure enough, as the Best Actor, he dared to describe the big director this way. <br/><br/>However, Daisy suddenly chuckled. <br/><br/>The door to the audition room was pushed open. <br/><br/>George Dunn stood at the entrance, with Daisy slightly behind him. With the door wide open, everyone inside could be seen clearly from the entrance. <br/><br/>And Daisy’s eyes locked on Arthur North sitting inside, right away. <br/><br/>Arthur North heard the noise and looked over. His enchanting face was emotionless, with traces of subtle fierceness in his eyes. It was quite scary. <br/><br/>But when he saw Daisy, a smile immediately appeared in his eyes. <br/><br/>Daisy looked at him and squinted her eyes. She didn’t let him follow her, but he went straight inside. This man was really... <br/><br/>Arthur North sensed Daisy’s scrutinizing look, and his smile became more evident. <br/><br/>Allonzo Hobson, who was watching the two exchange glances across so many people, couldn’t help but roll his eyes. <br/><br/>The director, Morris, in the room noticed the noise and also looked over. <br/><br/>He looked at George Dunn entering the room and didn’t even bother greeting him, just making eye contact to acknowledge his arrival. <br/><br/>Then he looked back and when he saw Daisy’s face, he suddenly stood up. <br/><br/>The other director sitting next to him was still chatting with him and didn’t understand Morris’s reaction, so he also looked at the entrance but only noticed George Dunn. <br/><br/>He thought to himself, no wonder George Dunn was the director’s favorite Male Lead. <br/><br/>Due to Morris’s reaction, George Dunn stopped in his tracks. <br/><br/>Hill Dawson leaned on her again. <br/><br/>Her heart and body couldn’t take it anymore. <br/><br/>Morris looked at George Dunn’s stiff face again, “What’s the deal with you two? <br/><br/>You’ve been filming together for months, and you still don’t know who each other are?” <br/><br/>Morris then looked at Daisy, “Why are you still hiding your identity?” <br/><br/>“I’ve told him twice.” Daisy said calmly, “He didn’t believe me.” <br/><br/>After a pause, she added, “He even confidently told me that if I were to stand in front of him, he would recognize me at first glance.” <br/><br/>Morris’s mouth twitched. Then he nodded and said, “Indeed... sometimes the brain isn’t enough. I understand, I understand.” <br/><br/>“He just called you a mad dog.” <br/><br/>“He’s the mad dog.” Morris directly left George Dunn behind and walked away with Daisy. <br/><br/>“Everyone, sit down.” Morris was in a good mood today, speaking more gently than usual, “Come, Nana. Let me introduce you. This is Charles Lee, Director Hamilton.” <br/><br/>“Brook God,” Charles Lee reached out his hand first, with a humble gesture, <br/><br/>“We met at the Spotlight Gala. Do you remember?” <br/><br/>Daisy extended her hand and shook his, “Director Hamilton.” <br/><br/>Seeing that there was work to be done, Hill Dawson suddenly regained her composure. She stood up straight and also shook hands with Charles Lee, “Director Hamilton, nice to meet you. I remember, we even exchanged contact information. I was thinking of auditioning when you were casting for your show.” <br/><br/>“For Brook God to come, it would be a great honor for our drama crew.” Charles Lee’s palm was sweating, “Once the crew is ready, we will inform you immediately.” <br/><br/>“Alright, then it’s settled.” <br/><br/>As Hill Dawson chatted, Daisy glanced at Arthur North, who had been watching her the whole time. Then she quietly said to Morris, “You did this on purpose, didn’t you?” <br/><br/>Morris noticed Arthur North’s gaze as well. <br/><br/>Flynn Ninevara was so dazzling; he couldn’t let this dissipated son have his way with her. <br/><br/>So he nonchalantly made a provocative move, deliberately blocking the two’s line of sight. <br/><br/>Daisy: <br/><br/>Arthur North frowned: <br/><br/>Morris whispered, “Didn’t you want to act in his show? I happen to know him. Knowing that you would be here today, I brought him along.” <br/><br/>Morris thought he wasn’t blocking well enough and moved a little more, completely blocking Arthur North, “To save you the trouble of auditioning. Last time there was so much trouble, aren’t you tired of it? One experience with that broken process is enough. How about it? Are you addicted to it? It’s not like we don’t have the connections..”\t\t\t\t\t\t</div>", "images": {}, "success": true}