{"id": 101, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223387.html", "title": "Chapter 101 - 98: Planning A Family Recognition Banquet_2", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 101 - 98: Planning A Family Recognition Banquet_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 101: Chapter 98: Planning a Family Recognition Banquet_2 <br/><br/>Translator: 549690339 <br/><br/>Although she couldn’t access the core research at the Research Institute, she now had access to 319. So, she could conduct some research on her own. <br/><br/>But there had been no significant progress so far. <br/><br/>The main ingredient of 319 was simply nothing like any existing Thing, impossible to study and there were no previous records. <br/><br/>The most convenient way was to find that group of people, including Alice Eugene. However, after that day, they disappeared without a trace, and there was no information about them whatsoever... <br/><br/>During this time, Johanes Miles and Liam Davis came to the outside of Everlasting Palace to find her several times. <br/><br/>But she deliberately avoided them, not wanting to meet them. <br/><br/>Until one early morning, Old Master Miles waited for her outside the Everlasting Palace. <br/><br/>It was then that Daisy Zane met them. <br/><br/>With Old Master Miles, not only did Amelia Miles come, but also Amelia Miles. <br/><br/>Juan Wright went out to buy breakfast and was about to return when he saw the scene from afar. <br/><br/>Daisy Zane one against three. <br/><br/>He immediately called her: “Lady Zane, what’s the situation there, do you need my help?” <br/><br/>“No need.” Daisy Zane glanced at the three of them, walked a few steps away, and said, “You can go back. I can handle them with one hand.” <br/><br/>Juan Wright chuckled and said, “Alright. If you need anything, just give me a call. It something happens to you, no, it you lose a single hair, Third Master will have my life.” <br/><br/>Daisy Zane casually raised the corner of her mouth, which could almost be overlooked: “Don’t worry, for the sake of your life, I won’t lose any hair today.” <br/><br/>“Alright, thank you, Lady Zane.” <br/><br/>After hanging up the phone, Daisy Zane looked at the three of them: “Is there anything you need?” <br/><br/>“Sister, Dad and Grandpa miss you.” Amelia Miles held Old Master Miles’s arm and said, “So they came to see you. Please let us in and sit down, also to take a look at where Sister lives. I heard that the house price of Everlasting Palace is expensive.” <br/><br/>“Zane, it’s been a long time since we last met.” The Old Master smiled kindly, “You’ve become more beautiful since the last time we met.’ <br/><br/>“Really?” Daisy Zane asked again, deliberately stabbing at her sore spot to see how long she could pretend. <br/><br/>“Of course it’s true.” Amelia Miles’s smile was about to fade. <br/><br/>Daisy Zane scoffed, “There’s no need for a Family Recognition Banquet. Just give me a share of whatever Amelia has.” <br/><br/>She looked at Johanes Miles: “You know that what I want is not too much.” Johanes Miles looked startled for a moment, unable to react immediately. <br/><br/>“You’re all members of the Miles Family, so of course it’s not too much.” Old Master Miles said in time. <br/><br/>Daisy Zane ambiguously hooked the corner of her lips: “Since you’ve delivered the message, if there’s nothing else, I’ll leave. I have some things to do.” <br/><br/>After saying that, she stood up, picked up her teacup in front of her, and placed it upside down on the table. The tea quickly spread and soaked the tablecloth. <br/><br/>She pulled out a tissue and slowly wiped her slender fingers: “Miss Miles’ tea art and etiquette still need some work.” <br/><br/>Double-edged words, she glanced at the spout facing her: “Otherwise, you’ll be laughed at when you go out.” <br/><br/>Amelia Miles’ face turned from pale to red instantly. <br/><br/>She originally wanted to make Daisy Zane look bad in front of her grandfather and father, to show them how vulgar the girl from the Countryside was compared to herself. But in the end, she was the one who ended up looking bad... <br/><br/>Daisy Zane smiled at her indifferently, nodded to Old Master Miles, and left. <br/><br/>As soon as Daisy Zane left, Old Master Miles’ face immediately darkened. He looked very unhappy with Amelia Miles: “Amelia, what you did today was a bit too much.” <br/><br/>“Grandpa...” After calling him, Amelia Miles lowered her head. <br/><br/>“She is your sister. When she returns to the Miles Family, you will all be daughters of the Miles Family, members of the same family. Don’t bully her just because she has lived in the Countryside.” <br/><br/>“I didn’t, I just...” <br/><br/>“You’re not a child anymore, you’re grown up. You should know your limits.” Old Master Miles interrupted, “No matter the reason, this kind of thing shall not happen again in the future. In the end, it’s the Miles Family who loses face.” <br/><br/>Amelia Miles clenched her hands tightly, feeling sick to her stomach and blocked at her chest, as if she couldn’t breathe. But she still obediently said, “I know, Grandpa, it’s my fault.” <br/><br/>“Hmm.” Old Master Miles said, “Your sister’s return is helping the Miles Family. You won’t lose anything that is rightfully yours. Don’t think too much.” <br/><br/>Amelia Miles’ nails pierced the palm of her hand, the stinging pain made her a little sober. The title of Miss Miles had been stolen, so who was she? <br/><br/>It was Daisy Zane who was the illegitimate daughter that could not be shown in public. <br/><br/>“I know, Grandpa..”\t\t\t\t\t\t</div>", "images": {}, "success": true}