{"id": 106, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223397.html", "title": "Chapter 106 - 103 Flynn Ninevara (1)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 106 - 103 Flynn Ninevara (1)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 106: Chapter 103 Flynn Ninevara (1) <br/><br/>Translator: 549690339 <br/><br/>Although a lot of big shots come to audition for Director Morris’s show, he’s not the type who prioritizes their status or popularity. <br/><br/>And his show has no need for these. <br/><br/>“Fall of the Quince”, directed by Director Nash, does not usually employ popular celebrities or seasoned artists. This is because his budget is limited, and the money mostly goes into production, not into paying actors. So, there are many newcomers. <br/><br/>As for Director Morris himself as a producer, he’s never stingy. <br/><br/>He always cares if the actors fit the characters. <br/><br/>As long as they fit the roles, no matter how eminent they are, he’d do whatever it takes to get them. And if anyone is obscure, he wouldn’t mind promoting them to popularity. <br/><br/>So, there are many industry big shots coming, but...it also hosts many newcomers. <br/><br/>If luck is on your side and you truly match the character’s design, overnight success might be within reach. <br/><br/>Upon spotting Amelia Miles and Clarissa Mason, Hill Dawson immediately rolled her eyes: “Why are they everywhere? It’s so annoying. Like lost souls that won’t leave.” <br/><br/>Daisy Zane chuckled at her reaction. <br/><br/>Hill Dawson then looked around and took out her cell phone: “Best Actor Dunn said to wait here for a while. He’ll take us directly to meet Director Morris. I wonder if Catherine God will come today? Meeting a diva like that is always good, to familiarize ourselves. What if a suitable role comes up in the future?” Daisy Zane looked at her for a moment and said, “She will come.” <br/><br/>“Really?” Hill Dawson suddenly looked up at her, “How do you know? Who told you? I had no idea.” <br/><br/>Daisy Zane just gave her a cryptic look, saying nothing. <br/><br/>“Oh, you guys are here too?” Olivia Chester suddenly walked over and asked. <br/><br/>Hill Dawson, hearing this voice, rolled her eyes again before turning to look at her. She threw back in the same tone: “Oh, you guys are here too?” <br/><br/>Olivia Chester scornfully replied, “I think you’re really getting old. Your judgment of people is getting poorer and poorer. You dare bring anyone.” <br/><br/>“Better than you.” <br/><br/>“I’ll give you a heads up.” Olivia Chester looked at Daisy Zane and said with a smirk: “While audition hasn’t started, hurry and take her away. You know how Director Morris dislikes useless display pieces. If you get scolded later, you two will lose massive face.’ <br/><br/>“That advice goes to you as well.” Hill Dawson shot a glance at Clarissa Mason: “And, here’s another piece of advice for you. This one you brought, she can’t even compare to a display piece. You should stop parading her around and making a fool of yourself.” <br/><br/>“You...” Clarissa Mason wanted to say something, but was silenced by a look from Olivia Chester. <br/><br/>“You can only have a sharp tongue for now.” Olivia Chester sneered: “Just wait until it’s your turn to lose face. Oh, right, the director of the next show you aim to work is also here today. If you lose face there, you probably could lose the next show as well.” <br/><br/>Director Morris is known to be a bit eccentric within the industry, he does not hesitate in berating anyone if things don’t go his way. <br/><br/>George Dunn soon came over. <br/><br/>Olivia Chester went up to him to greet him: “Best Actor Dunn, it’s been quite a while.” <br/><br/>George Dunn first looked at Daisy Zane and others, then smiled and said, “Sister Chester, it’s indeed been a quite a while. You’re getting younger by the day.” <br/><br/>“Best Actor Dunn surely knows how to flatter.” <br/><br/>“I’m just being honest.” George Dunn spoke, glancing at Amelia Miles behind Olivia Chester, “Sister Chester, you’ve brought a newcomer with you? She’s really attractive. Your eye for talent never falters.” <br/><br/>“What newcomer?” Olivia Chester pulled Amelia Miles to her side, “She’s my goddaughter. A dancer from the Truro Dance Theatre. Doesn’t the call for actors this time ask for a background in dance? So I brought her here. Her name is Amelia Miles.” <br/><br/>George Dunn, of course, understood their intentions. But he said, “So it’s Sister <br/><br/>Chester’s goddaughter, no wonder she is so excellent. Nice to meet you, Miss <br/><br/>Miles.” <br/><br/>“Nice to meet you, Best Actor Dunn, ” Amelia Miles shook hands with him. <br/><br/>“Considering Miss Miles’s qualifications, Director Morris will definitely notice her.” George Dunn kindly said, “They’re about to start inside, I need to go and have a look.” <br/><br/>“Alright, go ahead with your work,” Olivia Chester said in a familiar tone. <br/><br/>George Dunn nodded at the two of them, and under their watchful gaze, walked over to Daisy Zane and her group. <br/><br/>“Daisy, I was starting to think you wouldn’t come.” George Dunn’s tone was noticeably less polite, more like a casual conversation between friends. <br/><br/>He genuinely enjoyed performing opposite Daisy Zane, not just because of her voice, but also because the two of them worked extremely well together. <br/><br/>In all these years, he had never come across an actor with such a rapport. “How could I dare not come when Best Actor Dunn personally invites me?” <br/><br/>“You’re flattering me again,” George Dunn said, “Come on, let me introduce you to Director Morris.” <br/><br/>Although their voices were not loud, Olivia Chester and her group heard them. <br/><br/>Olivia Chester’s face immediately fell. <br/><br/>Clarissa Mason tugged at her sleeve, swearing under her breath, “What a vixen. She only had a show with George Dunn, and already hooked him. I bet she got this role by spreading her legs.” <br/><br/>Amelia Miles lowered her gaze, squeezing her own hand tightly, but remained silent. <br/><br/>“Shut your mouth!” Olivia Chester glared at Clarissa Mason, directing her anger at her, “You’ve been sleeping with that producer for so long, and got nothing out of it. You’re the last person who should talk.” <br/><br/>“Shut it!” <br/><br/>Clarissa Mason closed her mouth in frustration..\t\t\t\t\t\t</div>", "images": {}, "success": true}