{"id": 105, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223395.html", "title": "Chapter 105 - 102 Uncle Clark (Fourth Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 105 - 102 Uncle Clark (Fourth Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 105: Chapter 102 Uncle Clark (Fourth Update) <br/><br/>Translator: 549690339 <br/><br/>After dinner, Daisy Zane, Kevin Clark, and Hill Dawson sat for a while and then went straight back to their own rooms. <br/><br/>She was a bit unaccustomed to seeing people everywhere all of a sudden. <br/><br/>Out of sight, out of mind, she went back to her room. <br/><br/>Once in her room, she organized her experiment report and made a call to Holt Lawrence, reporting on the current information held by the Celestial Pivot. <br/><br/>While she was on the phone, the sound of a piano emerged from downstairs. <br/><br/>She listened for a while, it was Chopin’s “Nocturne”. And it wasn’t Charles Amos playing. Charles’ skills are only at a beginner level. <br/><br/>This level of playing was much more advanced, verging on concert-level. <br/><br/>After chatting with Holt Lawrence for a while, she hung up, and left her room. <br/><br/>Standing in the second-floor corridor, she could clearly see the piano downstairs. <br/><br/>Kevin Clark was sitting at the piano, his ten fingers dancing across the black and white piano keys. Each touch of a fingertip to a key producing a beautiful note. <br/><br/>His fingers were naturally beautiful, long and distinct. <br/><br/>On the piano, it was hard to know whether the song became more artistic or his hands added a greater sense of artistry. <br/><br/>Moreover, there was a sense of ancient elegance in Kevin Clark, playing the song. <br/><br/>It felt like a visual feast where ancient Eastern elegance collided with Western romanticism. <br/><br/>Charles Amos sat beside him, initially looking at the keys, but gradually started to watch Kevin Clark. His big, sparkling eyes shed light of admiration. <br/><br/>It was rare to see Charles admiring someone like this. <br/><br/>“Miss.” Wilton Edwards came from the stairs holding a glass of wine for her. <br/><br/>“Thank you.” Daisy Zane took the glass, took a big gulp, and continued to watch from above. <br/><br/>Wilton also looked with her and remarked after a while, “The young master seems to like Third Master very much.” <br/><br/>Daisy Zane knew even if she didn’t mention, he would be aware of Kevin Clark’s identity. She responded affirmatively. <br/><br/>“Third Master is also very kind to the young master.” Wilton Edwards said, “He probably has a love for everything related to the young master. The other day when we saw him at the Doomsday Hotel, Third Master seemed to dislike children very much, ” he recalled. <br/><br/>“Really?” <br/><br/>“Yes,” Wilton Edwards confirmed, “Not at all interested, even a bit annoyed. It’s only out of kindness that he didn’t leave him there.” <br/><br/>Daisy Zane gave a slight chuckle. <br/><br/>“Miss... if possible, the best thing for the young master would be to have a home,” Wilton Edwards said, his face full of sympathy, “We all have to look forward. We can’t continually dwell on the past.” <br/><br/>Daisy Zane gripped her wine glass tighter, and glanced downwards to see Kevin Clark. <br/><br/>“Hmm.” Charles Amos confirmed. <br/><br/>“Sure.” said Kevin Clark, “I’ll come over when I have time.” <br/><br/>“A real man keeps his promises.” Charles Amos glanced at Daisy Zane, and then murmured in a low voice, “I won’t let you teach me for nothing.” <br/><br/>Daisy Zane suddenly squinted her eyes. What was going on? Was he trying to sell out his mother? <br/><br/>The smile on Kevin Clark’s face deepened: “Deal.” <br/><br/>Charles Amos was happily carried away by Wilton Edwards. <br/><br/>“Congratulations, Uncle Clark.” Daisy Zane called out with her cold voice. <br/><br/>Kevin Clark lightly flicked her forehead with his index finger and middle finger crossed: “Why are you so cheeky.” <br/><br/>Daisy Zane raised her eyebrows. <br/><br/>The next afternoon, Kevin Clark originally wanted to go for Daisy Zane’s audition at the hotel with her. <br/><br/>But Daisy Zane found him too flashy and firmly rejected him. <br/><br/>So, he could only get Allonzo Hobson to speak to Morris. He went straight to the audition room, anyway, he wanted to see Daisy Zane’s live audition. <br/><br/>Allonzo Hobson also went to join in the fun. <br/><br/>Morris did not refuse. After all, that was someone from the Clark family, no matter how bad his temper was, he still would not provoke them if he could avoid it. Otherwise, everything he pursued might be eradicated overnight. <br/><br/>However, he was still extremely disdainful of these young masters internally. <br/><br/>He firmly believed that they came to ogle the beauties and wanted to approach <br/><br/>me pretty gins. <br/><br/>Saying it nicely, they came to learn. <br/><br/>Bullshit! They were nothing! Dissipated sons! <br/><br/>While Morris was cursing the young masters in his heart, Hill Dawson and Daisy Zane had arrived at the hotel for the audition. <br/><br/>This audition was much grander than the last one in Sky Rights Hotel. <br/><br/>Although only a few main roles were picked today. <br/><br/>But there were many people present. Most importantly, almost all of them were big-name celebrities and veteran artists. <br/><br/>These people came, mostly for Flynn Ninevara’s script and for the awards that Morris’ direction could easily grab. <br/><br/>Seeing all these people, Daisy Zane suddenly felt that there were so many beauties to feast her eyes on, it wasn’t a wasted trip. <br/><br/>But Hill Dawson’s face didn’t look so well: “Daisy... these are the big shots of the entertainment circle. This...” they seemed doomed before they’d even started. <br/><br/>“Not all are big shots..” Daisy Zane, looking at the crowd, stated, “Aren’t Amelia <br/><br/>Miles and Clarissa Mason also here?”\t\t\t\t\t\t</div>", "images": {}, "success": true}