{"id": 111, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223407.html", "title": "Chapter 111 - 107: Sly Third Master", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 111 - 107: Sly Third Master</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 111: Chapter 107: Sly Third Master <br/><br/>Translator: 549690339 <br/><br/>The audition started at around 1:30 PM and didn’t end until past 9 PM. <br/><br/>Because it was so late, they had dinner directly at the hotel. <br/><br/>When they finished eating and went outside, they didn’t know when it had started snowing. The ground was already covered with a thin layer of snow. “It’s snowing,” said Hill Dawson. <br/><br/>“And quite a lot,” Allonzo Hobson said while taking pictures of the streetlights with his cell phone. “I didn’t think we’d see snow before the Chinese New Year.” <br/><br/>“Let’s each go our separate ways then,” Morris chimed in. “We should hurry, the roads will get even worse when the snow piles up.” Updated from novelbIn.(c)om<br/><br/>The group parted ways at the hotel entrance. <br/><br/>Kevin Clark glanced at Daisy Zane, who was watching the snow, and said, “Xavier, you take Hill home. We’ll go for a walk. I’ll send you the address on your phone.” <br/><br/>“Alright,” Xavier Dominic agreed readily. “Sister Emily, let me take you home.” <br/><br/>“Thanks, Young Master Hobson.” <br/><br/>Waiting for them to leave, Kevin Clark zipped up Daisy Zane’s down jacket and then put her hat on, “Do you like snow?” <br/><br/>Daisy Zane looked at him, “Maybe. I rarely see it.” <br/><br/>Kevin Clark met her gaze with a smile. Then he took her hand and put it in his pocket. They walked hand in hand along the roadside. <br/><br/>“In Cold Green Village, the lowest temperature of the year is about fifteen or sixteen degrees.” He said, “Will you be able to adapt to the weather here?” <br/><br/>But when Daisy Zane told him that she had already been in the Imperial Capital for six days and was leaving today, Holt Lawrence was so irritated that he almost choked on his words. <br/><br/>He abruptly hung up on her. <br/><br/>But by the time he called her back, Daisy Zane’s cell phone had already been turned off. <br/><br/>After a flight of over three hours and landing, Daisy Zane rented an off-road vehicle. <br/><br/>After having lunch, she drove toward Cold Green Village. It was manageable at the beginning, but once she entered the mountains, the winding roads made it very difficult to navigate. <br/><br/>It wasn’t until past 8 PM that she finally arrived at Cold Green Village. <br/><br/>They didn’t live in the village itself but on a hillside about one kilometer outside. They hardly interacted with the people in the village. <br/><br/>Unable to drive further, Daisy Zane had to lock the car, pick up her suitcase, and walk up the mountain. <br/><br/>There were two simple houses with small living spaces. One was for living, and the other was for cooking. <br/><br/>There was also a small courtyard made of piled stones. The courtyard wall was only waist-high. <br/><br/>It couldn’t be called beautiful, but it provided shelter from the wind and rain. <br/><br/>After being away for a year, the courtyard was overgrown with grass, and vines had climbed up the stone wall. <br/><br/>As she entered the courtyard, Daisy Zane took out her key and opened the door to the house where they lived. <br/><br/>The moment the wooden doors swung open, she saw horrifying images flashing through her mind—messy rooms and blood on the floor. <br/><br/>But when she opened the door, she was greeted by darkness and a faint musty smell..\t\t\t\t\t\t</div>", "images": {}, "success": true}