{"id": 116, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223417.html", "title": "Chapter 116 - 111: Sharing The Same Bed", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 116 - 111: Sharing The Same Bed</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 116: Chapter 111: Sharing the Same Bed <br/><br/>Translator: 549690339 <br/><br/>“Third Master...Wilton Edwards...didn’t he tell you to bring beddings like quilts wnen you came over”‘ <br/><br/>As Kevin Clark was tidying up the things he had brought, Daisy Zane’s voice suddenly came from behind. <br/><br/>He turned around to look at her and said, “There’s no quilt?” “Yeah,” said Daisy Zane, “The glass here is damp and has a musty smell.” <br/><br/>“Then, you...” Kevin Clark glanced at the bed behind her. <br/><br/>The quilt on the bed looked new. <br/><br/>He looked at the bed on the other side. He didn’t notice it just now, but now he saw that there were two quilts on that bed. <br/><br/>“It’s alright.” Kevin Clark quickly accepted the fact. “I can cover myself with clothes. But... where am I supposed to sleep? That bed?” <br/><br/>That bed used to be Daisy Zane’s grandmother’s and it’s been many years. <br/><br/>When she came back to clean that day, she noticed the bed board had been bitten by insects in the middle. <br/><br/>It’s fine to put a quilt on it, but... if you lie a person on it, the bed board would definitely break. <br/><br/>She stood by the bed for a while, then picked up the glass and the cushion from the bed and handed them to Kevin Clark. <br/><br/>She pulled open the single bed herself. <br/><br/>The single bed turned into a double bed. <br/><br/>Kevin Clark raised his eyebrows, this bed looked homemade. It was quite innovative and well-designed. <br/><br/>“Sleep here.” <br/><br/>Kevin Clark was still looking at the bed when he heard this, and paused for a moment, “Then where are you...going to sleep?” <br/><br/>“I’ll sleep here too,” said Daisy Zane calmly. “That bed is about to collapse, this one was made new a few years ago.” <br/><br/>Kevin Clark held the quilt and didn’t move. <br/><br/>No one told him that he would have to face such a test when he came here. <br/><br/>“What’s wrong?” Daisy Zane asked when she saw him not moving. <br/><br/>“Ah, well...l...” Kevin Clark started to speak but didn’t know what else to say, “Isn’t it, kind of inconvenient?” <br/><br/>Daisy Zane pulled the mattress out of his arms and spread it on the bed, “If you think of me as a man, it won’t be inconvenient.’ <br/><br/>Kevin Clark’s mouth twitched. He, he might not be able to do that. <br/><br/>She purposefully got a double mattress, folded it up, and placed it on the single bed. <br/><br/>Now that it’s unfolded, it might feel a bit stiff at night. <br/><br/>“Throw the quilt on the bed.” <br/><br/>Kevin Clark did as she said. <br/><br/>Daisy Zane spread out the quilt and put it on the bed. Then she folded it over to the outside, placing the pillow on the outer side as well. <br/><br/>She then took off her coat and threw it inside. Glancing at the somewhat dazed Kevin Clark, she chuckled, “Third Master... What’s the matter?” <br/><br/>“What do you think?” Kevin Clark looked at her, his eyes somewhat resentful. <br/><br/>The smile on Daisy Zane’s face deepened. She patted his shoulder and said, <br/><br/>“Don’t worry, I won’t do anything to you.” <br/><br/>Almost as soon as she saw him, Daisy smelled the aroma of the food, and her stomach appropriately growled on cue. <br/><br/>Kevin put the tray on the desk, then leaned over to brush her hair back and casually touched her face. “Let’s get up and eat.” <br/><br/>Daisy glanced at the redness around his eyes and then buried herself back under the covers, mumbling, “It’s cloudy outside.” “Hmm. It’s a little cold today. Wear more later.” <br/><br/>“Did you wash the dishes?” <br/><br/>“Yes. The chopsticks had grown moldy, and I thought we’d have to whittle a couple of sticks to use as chopsticks today.” Kevin sat on the edge of the bed, stroking her hair and joking, “Then I discovered there were stainless steel chopsticks. ” <br/><br/>Daisy laughed, “Thanks, Third Master.” <br/><br/>“Hurry up and get up, the porridge will be cold soon.” Kevin stood up and said, “I’ll go out first, call me when you’re dressed.” <br/><br/>Daisy waved her hand to show that she understood. <br/><br/>It wasn’t until he closed the door that she got out of bed, folded the quilt, took out her suitcase, and changed into some sportswear. <br/><br/>Then, using yesterday’s hairpin, she tied up her hair. <br/><br/>When she went outside, Kevin was pulling weeds in the courtyard. <br/><br/>This scene truly surprised Daisy, and she choked on her saliva, coughing, “Kevin Clark... you don’t need to do that, just let them grow.” <br/><br/>“It’s fine, go wash up.” <br/><br/>Daisy looked at him, hesitated, but didn’t say anything else, and went to the kitchen to fetch her toiletries. <br/><br/>In the back of the kitchen was a cabinet where Daisy’s toiletries were all stored. Today, there was an extra set – Kevin’s. <br/><br/>It must have been Kevin who had organized everything neatly, and both of their toothbrushes were placed together. <br/><br/>Everything else belonged to the two of them separately, but only the toothbrushes were touching. <br/><br/>Somehow, this filled Daisy’s heart with a warm feeling. <br/><br/>She looked at them for a moment, then smiled softly. <br/><br/>As she brushed her teeth in the courtyard, Daisy wandered around the courtyard wall. <br/><br/>Then, she suddenly noticed a layer of cooked rice spread out on top of the wall – to be more precise, some white, some yellowish, and some... black. <br/><br/>It was evident that the rice had been burnt. <br/><br/>Daisy rinsed her mouth and looked at the rice, saying, “Kevin Clark, you’ve done a good job controlling the heat while cooking porridge.” <br/><br/>Kevin threw the pulled-up weeds to the side, looked back at her, and seeing her looking at the rice, laughed, “The fire was too high the first time.” <br/><br/>“Why put it here?” <br/><br/>“Let the small animals eat it,” Kevin replied, “Consider it inviting friends.” “Friends?” <br/><br/>“They’ve been with you in the mountains for so many years. They’d count as friends, right?” <br/><br/>Today was a cloudy day, with grey skies and a blowing wind. It rustled the tree leaves and swayed the grass. <br/><br/>Kevin squatted on the ground and looked back at her. With the grass behind him, the mountain in the distance, and the mountain concealed by the fog even further away, he appeared to have an ancient noble elegance about him. <br/><br/>Looking at him and listening to his words, Daisy could feel his tenderness, romance, and his affection for everything about this place. <br/><br/>In fact, she truly envied Kevin’s family for raising such a person. <br/><br/>After a while, she spoke up, “Friends, huh? Well... some friends taste quite good when roasted.” <br/><br/>Kevin Clark: <br/><br/>“Fine, go ahead and treat them,” Daisy said, “The fatter they get, the tastier.” <br/><br/>Kevin Clark:\t\t\t\t\t\t</div>", "images": {}, "success": true}