{"id": 119, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223423.html", "title": "Chapter 119 - 114: Responding And Causing Trouble Again", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 119 - 114: Responding And Causing Trouble Again</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 119: Chapter 114: Responding and Causing Trouble Again <br/><br/>Translator: 549690339 <br/><br/>In the evening, Amelia Miles finished her meal and returned to her room, where she spent the rest of the night browsing the internet for the latest gossip. <br/><br/>The sight of all the abusive comments was like a happy stimulant for her. <br/><br/>She kept reading until she was tired and ready to sleep. Only then did she stop browsing the comments. <br/><br/>However, when she returned to the hot search page, she noticed that it had been updated. <br/><br/>A new hot topic titled [Morris Responds] appeared on the list. <br/><br/>Amelia clicked on it. <br/><br/>She saw that Morris had posted on Facebook: [I’m working on the storyboard manuscript and was too focused to know about the big news today. First of all, I want to wish you all a happy new year. And then... I guess I’ll have to figure out how to tell you that @Daisy Zane and @Flynn Ninevara are the same person.] <br/><br/>Morris had indeed been working on the storyboard manuscript when the scandal broke, but he waited until now because he spent time drafting dozens of posts, all of which he thought were not good enough; in the end, he went with the first one. <br/><br/>Amelia looked at the post and felt as if she were hallucinating. She quickly exited the page and refreshed the hot search. <br/><br/>Within moments, the hot search topic climbed to number three. <br/><br/>And more related topics appeared alongside it. <br/><br/>[Daisy Zane and Flynn Ninevara are the same person.] <br/><br/>[Ninevara has been exposed.] <br/><br/>[Flynn Ninevara’s face revealed.] <br/><br/>Amelia clicked on each one of them. <br/><br/>Inside, there were those who doubted and didn’t dare believe it, but the overwhelming majority were stunned. <br/><br/>One topic even had nothing but question marks and exclamation points in it. <br/><br/>Amelia sat up on her bed, her sleepiness gone, and refreshed the page again, not wanting to give up easily. <br/><br/>Now, a response from George Dunn appeared. <br/><br/>[How do I gently break it to you all that I made a show with Flynn Ninevara?] Follow current novels at novelhall.com)<br/><br/>Beneath, he posted a picture of a handwritten title, “Fall of the Quince”, along with a smug emoji. <br/><br/>Nowadays, any artist caught in a scandal could be blacklisted. <br/><br/>Just before the New Year’s, “Fall of the Quince” finished filming, and then Daisy Zane’s scandal broke out. <br/><br/>Director Nash had been closely following this incident, worried about whether his unfortunate show would be able to air. <br/><br/>When Morris posted on Facebook, Nash was still in shock. After all, Flynn Ninevara was like a divine presence in their circle, and everyone wanted to benefit from his fame. <br/><br/>Only when George Dunn posted on Facebook did he snap out of his stupor. <br/><br/>First, he left a comment with twenty-two question marks. <br/><br/>Then, ten minutes later, he added another comment: [You all conspired to deceive us in the drama crew! You have no conscience!!] <br/><br/>With the experience of one night, the two of them had obviously adapted much more as they lay down tonight. <br/><br/>Because of the cloudy weather, it was a bit cold at night. Daisy even covered Kevin’s side with the quilt. <br/><br/>“Are we really going back tomorrow?” <br/><br/>“Yeah.” Daisy Zane was looking at the script on her cell phone. <br/><br/>Before she came, she had downloaded the electronic version of the script for the next show directed by Charles Lee. <br/><br/>“Just come back and have a look,” Daisy said, “We have to leave sooner or later.” <br/><br/>Lying on his arm, Kevin said, “When I said I would come back with you anytime at noon today, I meant it. I wasn’t just being polite.” <br/><br/>Daisy Zane glanced at him, “I know.” <br/><br/>Kevin felt that she was perfunctory in her chat with him: “What are you looking <br/><br/>“Script.” Daisy Zane moved her phone closer to him, “It’s for my next show.” Kevin and her looked at it together for a while and asked, “This time, you’re a female general.’ <br/><br/>“Yeah,” Daisy Zane commented, “she has a bumpy life. Smooth career but heartbreaks whenever it comes to love.” <br/><br/>“There’s still a love line.” Kevin said leisurely. <br/><br/>“Three love lines,” Daisy Zane said lightly, “The first two are very difficult, one for national hatred and one for family feud. It’s not until the end that she meets her prophesied emperor. The two go through countless difficulties before they finally get together.” <br/><br/>Kevin almost didn’t hear what she said later, only hearing “three love lines”: “Will there be physical contact? Are there kissing scenes? Are there scenes that are more intense than the kissing ones?” <br/><br/>Daisy Zane paused for a moment before looking at him. <br/><br/>When their eyes met, Kevin’s gaze held a mixture of reproach and dominance. But eventually, the dominance faded away as he gently said, “You don’t need intimate scenes. It’s not a romance drama. There are many ways to express feelings. You don’t have to kiss and cuddle.” <br/><br/>Daisy still stared at him. <br/><br/>“Your scripts also have very few intimate scenes,” Kevin said, “When two people are in love, they can tell by a single glance, right?” <br/><br/>“You’ve watched my shows?” <br/><br/>“Yes, I’ve been catching up.” After saying that, Kevin insisted, “It can be done without intimate scenes, right?” <br/><br/>Daisy was really susceptible to Kevin’s submissive attitude. He could see through her and knew how to hide his dominant side in front of her. <br/><br/>As they looked at each other, they smiled softly, with Daisy agreeing, “Okay.” <br/><br/>Hearing her consent, Kevin also smiled. He took her cell phone, turned it off, and placed it on the table. Then he grabbed her hand, placed it under the quilt, and covered her: “It’s getting late, we have to get up early tomorrow. Go to sleep.” <br/><br/>“The light isn’t off.” Daisy said lazily. <br/><br/>Kevin didn’t want to let go of her hand, “Can I just hit it with a book?” <br/><br/>Daisy looked at him and was about to get up herself. <br/><br/>Kevin pressed her shoulder: “I’ll go, don’t move.” <br/><br/>He got out of bed to turn off the light, and after lying back down, he groped for her hand under the blanket and gently said, “Let’s go to sleep.” <br/><br/>Daisy moved her fingertips as though she was going to withdraw her hand, but she suddenly clutched it tighter, “Hold it for a while.” <br/><br/>She didn’t move again and closed her eyes. <br/><br/>Before falling asleep, she was thinking that Kevin must be taking advantage of being good-looking and having a pleasant voice, so she was so lenient with him..\t\t\t\t\t\t</div>", "images": {}, "success": true}