{"id": 112, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223409.html", "title": "Chapter 112 - 107: Sly Third Master_2", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 112 - 107: Sly Third Master_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 112: Chapter 107: Sly Third Master_2 <br/><br/>Translator: 549690339 <br/><br/>When she last left, she placed a fragrance in the room. However, the weather here was humid and the temperature was high. No one lived here and no one took care of it, so it was inevitable that there would be a smell. <br/><br/>She touched the switch on the wall and turned on the light. <br/><br/>The dim yellow light came on, and it was so weak that it was hard to tell whether it drove away the darkness or brought deeper darkness. <br/><br/>Everything in the room remains unchanged. <br/><br/>A square table was placed facing the entrance, with single beds on both the east and west sides against the wall. <br/><br/>There were two tables beside the beds with many books on them. All kinds of books, in Chinese and English, about history, math, and so on... <br/><br/>Everything looked neat and tidy. <br/><br/>Daisy Zane stood at the door, looking at everything in the room, until the light flickered, and then slowly returned to her senses. <br/><br/>The electricity in the village was sometimes unreliable. <br/><br/>She unpacked her suitcase, took off her coat, and rolled up her sleeves. She decided to clean the dust in the room first and then rest. <br/><br/>Imperial Capital <br/><br/>Kevin Clark had been staring at his cell phone since Daisy sent him a message in the afternoon telling him she had entered the mountain area. He looked at his own messages that no one had replied to. <br/><br/>After a while, he made several phone calls. <br/><br/>Several times in a row, the calls were all out of service area. <br/><br/>He felt that what he said was wrong. <br/><br/>The signal in Cold Green Village was not just bad, it was non-existent. <br/><br/>New Year’s Eve is tomorrow. <br/><br/>Kevin Clark’s eldest brother and his wife had also come to the old mansion and were chatting with their parents in the living room. <br/><br/>“Mom. What’s wrong with him?” Theo Clark had seen his younger brother’s sullen look when he arrived home in the evening. <br/><br/>As time went on, the sullenness grew deeper. <br/><br/>Natalie Wayne shook her head, “I don’t know. He’s been like this since the afternoon. Why don’t you try asking him?” <br/><br/>“Kevin Clark, you!” Edward North hurriedly grabbed Natalie Wayne’s hand, “Madam, I absolutely have no such thought. Your position in my heart is always the first.” <br/><br/>Natalie Wayne cooperated very well with Kevin Clark, gave a light snort, and then got up from the sofa without looking at Edward North. “You guys chat, I’m going back to my room.” <br/><br/>As soon as she finished speaking, she started to walk away. <br/><br/>“Madam, Madam... Don’t listen to his nonsense, Madam...” Edward North grabbed his crutch and chased after her. When he reached the door, he looked at Kevin Clark and cursed, “You little bastard! If I had known you would turn out like this, I would have taken a bowl of abortifacient and poisoned you to death. ” <br/><br/>“It’s too late to say that now. The b*stard is already grown up.” <br/><br/>“Get lost!” Edward North scolded and then hurriedly chased after his wife, “Madam! Madam! I was wrong! I will drink the medicine properly from now on! Don’t be angry.” <br/><br/>When the couple left, Kevin Clark looked down at his still-quiet cell phone and sighed silently. <br/><br/>Then he looked at the couple still sitting on the sofa. <br/><br/>Theo Clark felt his gaze and looked back. <br/><br/>In the instant their eyes met, Theo Clark’s heart jumped. He could tell from his younger brother’s eyes that he was not up to any good. <br/><br/>Sure enough, the next moment, he heard Kevin Clark’s devilishly deep voice. <br/><br/>“Sister-in-law.” <br/><br/>“Hmm? What’s the matter, Kevin Clark?” <br/><br/>Kevin Clark looked at his brother and said, “A few days ago, my brother asked <br/><br/>Enamel Cannon for 100 USD.” <br/><br/>Theo Clark was about to take a sip of tea to calm his nerves, but when he heard this, his hand was scalded by the hot tea. <br/><br/>‘What?!” <br/><br/>“He bought a pack of cigarettes.” Kevin Clark said quietly, “He probably hasn’t finished smoking them yet. You can ask him.” <br/><br/>“Kevin Clark, you...” <br/><br/>“Theo Clark! You’ve been smoking behind my back again and asking our son for money!” <br/><br/>“Come back to the room with me, and let’s have a good talk!” <br/><br/>Before leaving, Theo Clark gave Kevin Clark a wait-and-see look. <br/><br/>Once everyone had left, Kevin Clark looked back at the silent phone and found some balance in his heart..\t\t\t\t\t\t</div>", "images": {}, "success": true}