{"id": 110, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223405.html", "title": "Chapter 110 - 106: Slapping The Face 2", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 110 - 106: Slapping The Face 2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 110: Chapter 106: Slapping the Face 2 <br/><br/>Translator: 549690339 <br/><br/>“That means you have talent.” Olivia Chester laughed. <br/><br/>“I don’t know what’s going on with Sister Amelia.” Amelia Miles suddenly said, “Why hasn’t she come out since she went in?” <br/><br/>“Who cares what she’s doing. George Dunn brought her in, and she must be staying inside because of his face.” Olivia laughed snidely, “I just went to ask around, and they’re trying almost every role inside. This means that none of these roles have confirmed candidates. Daisy Zane must not have been chosen.” Amelia Miles lowered her head and let out a faint smile. <br/><br/>“She’s just a vase, even with George Dunn’s recommendation, she won’t make it.” Olivia Chester said, “She’s just thick-skinned, like Melody Collins. Even if she’s not selected, she has to cling inside, shamelessly.” <br/><br/>“The room has a back door.” Clarissa Mason said, “Maybe she already left with <br/><br/>George Dunn. The hotel is so convenient.” <br/><br/>“Shut your mouth.” Olivia Chester is now afraid of her causing trouble whenever she speaks, “How many times have I told you, mind your manners when you’re outside. Keep your mouth under control.” <br/><br/>“I got it.” <br/><br/>Five minutes passed quickly. <br/><br/>The audition continued. <br/><br/>Daisy Zane suddenly remembered that the role she had reserved for Phoebe <br/><br/>Turner had not been auditioned by anyone. <br/><br/>But there was still no response from Phoebe Turner’s side either. <br/><br/>So she asked Allonzo Hobson if Phoebe Turner had time. <br/><br/>As she was whispering with Allonzo Hobson, someone entered the room and the door was pushed open. <br/><br/>Then she heard Olivia Chester’s voice: “Director Morris, hello. These are my two artists...” <br/><br/>Daisy Zane didn’t pay attention, but Allonzo Hobson glanced at them while talking and soon looked away. <br/><br/>“The show my mom is filming now is almost done. She told me she’s taking on the next one.” Allonzo Hobson said, “Maybe there’s an issue with the company notification, I’ll ask.” <br/><br/>“Alright.’ <br/><br/>After asking, Daisy Zane immediately turned around. <br/><br/>When she turned around, Amelia Miles was standing in the middle, introducing herself. <br/><br/>They had a whole bunch of little movements between them. <br/><br/>As Director Morris continued his rant. <br/><br/>“Director Morris...” <br/><br/>“Olivia Chester, you’re a gold medal agent in the industry. Is this the kind of talent a gold medal agent brings out?” Director Morris couldn’t see Clarissa Mason, so he vented his anger at Olivia Chester, “I’m here to choose roles, not to spend half a day getting tired and being cursed at.” <br/><br/>He did not leave any face for her, and Olivia Chester’s face was a bit unbearable. <br/><br/>“I can’t afford to use people like that.” Director Morris put his glasses on the table, “If she starts cursing me during the shoot, I can’t take it with my temper.” <br/><br/>Allonzo Hobson deliberately laughed out loud. <br/><br/>When he laughed, the staff around them also followed suit and laughed. <br/><br/>Amelia Miles stood in the middle, her face flushed, feeling as if all the laughter and ridicule were directed at her. <br/><br/>She could not wait to crawl into a crack in the ground. <br/><br/>“Some artists nowadays, with a few fans, feel like their tails are in the sky. It seems like they are a cut above the rest.” Director Morris continued, “In the drama crew, they act like they are somebody’s father. They even want people to serve them. I’m not paying money to buy a father. Rolls like that better leave; I can’t afford them.’ <br/><br/>Olivia Chester couldn’t stand the humiliation. <br/><br/>She glanced at Director Morris and Daisy Zane, then turned and slammed the door with Clarissa Mason in tow. <br/><br/>Seeing them leaving, Director Morris looked at Amelia Miles: “Do you want to continue?” <br/><br/>Amelia Miles gave a panicked look, bowed to them, and left as if escaping... <br/><br/>“They have personal grievances.” Director Morris tilted his head and watched as Daisy Zane slapped Harton Clark’s hand. Harton Clark retracted his hand, looking aggrieved. <br/><br/>Director Morris: <br/><br/>“I guess so.” Daisy Zane knew that he usually led a secluded life. If she hadn’t told him about Lilian Lopez’s incident last time, he wouldn’t have known. <br/><br/>So she didn’t explain much. <br/><br/>“Do you feel avenged?” <br/><br/>“Sort of.” Daisy Zane picked up his glasses that had been set aside, “These are just decorations.” <br/><br/>“Yes, they make me look more gentlemanly.” <br/><br/>Daisy Zane put them back for him, and said with an expressionless face, thought they were reading glasses.” Director Morris:...\t\t\t\t\t\t</div>", "images": {}, "success": true}