{"id": 114, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223413.html", "title": "Chapter 114 - 109: Arriving At Cold Green Village", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 114 - 109: Arriving At Cold Green Village</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 114: Chapter 109: Arriving at Cold Green Village <br/><br/>Translator: 549690339 <br/><br/>On the first day of the Chinese lunar year, Daisy Zane went up the mountain once again and returned home in the afternoon to cook and eat two barrels of instant noodles. <br/><br/>She then squatted at the entrance of the kitchen, supporting her chin with one hand, looking at the overgrown grass in the courtyard. <br/><br/>It should be cleaned, but...it’s better to go back to the room for a nap first. <br/><br/>As a result, she slept all the way until the evening. <br/><br/>So, when Kevin Clark arrived in the evening, Daisy Zane was busy pulling up the grass in the courtyard. <br/><br/>Completing the work that should have been done during the day but was not. <br/><br/>The dim courtyard light was on. <br/><br/>Daisy Zane’s fair hands were covered with dirt, her slender jade-like fingers seemed soft and powerless. Yet, with one hand, she dug in, her knuckles bulging, and the roots of the small grass peeling out with the soil, losing their lives. <br/><br/>Being engrossed in her weeding, she suddenly heard footsteps accompanied by the sound of the wind, which reached her ears. <br/><br/>Daisy Zane’s hand paused, and her blank expression instantly hardened. <br/><br/>This place was usually deserted. No one came here this late, especially when the courtyard light was on. <br/><br/>Quickly, she pulled out a handful of grass and then quietly listened to the approaching footsteps. <br/><br/>When the footsteps reached the entrance, she quickly stood up. The speed was swift, like a gust of wind, flipping over the courtyard wall. <br/><br/>Seeing the person standing at the entrance, her hand instinctively shot out even before her brain reacted. <br/><br/>It was almost seamless; flipping over the wall, seeing the person, and attacking, all happened without any pause. <br/><br/>And the attack was vicious. <br/><br/>The person at the entrance heard the commotion and quickly turned around. Instinctively, he blocked Daisy Zane’s strike. <br/><br/>Then he grabbed her other hand, which was about to strike. <br/><br/>Just as he grabbed her hand, he hurriedly used his other one to block her raised knee. <br/><br/>“Lucia, it’s me.” <br/><br/>Daisy Zane’s whole series of actions took place within a few seconds. By the time he spoke, her free hand had already reached Kevin Clark’s neck. <br/><br/>If he had spoken a fraction of a second later, she would have chopped him on the side of the neck already. <br/><br/>Now, with her hand stopped beside his neck, she hesitated for a moment: <br/><br/>“Kevin Clark?” <br/><br/>“It’s me,” Kevin Clark replied with a smile. <br/><br/>Daisy Zane, smelling the scent of eaglewood: “You, how did you come?” Kevin Clark wrapped his hand that she grabbed around in his palm: “Wishing you a happy new year.” <br/><br/>“Wishing me a happy new year?” Daisy Zane’s expression was somewhat blank, her head becoming blank as well. <br/><br/>The surprise of Kevin Clark’s appearance here was akin to her being told that as a materialist, ghosts existed in this world. <br/><br/>“Yeah,” Kevin Clark replied with a smile, “I mainly wanted to see you; I missed you too much.” <br/><br/>Kevin Clark was backlit, his entire figure shrouded in darkness. It felt unreal, but Daisy Zane’s hand was in his, feeling his warmth, knowing he was truly standing before her. <br/><br/>Daisy Zane looked up at him and didn’t move for a long time. <br/><br/>Cold Green Village was a corner hidden deep in her heart, a place where no one had ever set foot, never before. However, Kevin Clark walked right in without any warning. <br/><br/>The courtyard light was on, and the front yard was quite low. But Kevin Clark was too tall, completely blocking the light. <br/><br/>Kevin Clark smiled, and moved the two sticks piled together to the side a bit, “I’ve participated in outdoor training. Lighting a fire is an essential skill. If you can’t light a fire, you have to eat raw food.” <br/><br/>Daisy Zane raised her eyebrows. She didn’t expect that. <br/><br/>After all, Kevin Clark’s background and usual delicate life seemed like a young master who needs to be taken care of. <br/><br/>“Lucia, put some water in after washing your hands.” Kevin Clark said, “If there’s no water for too long, the pot will get burnt.” <br/><br/>Daisy Zane went out to wash her hands. When she came back, she scooped some water from the water tank next to the stove and put it in the pot. <br/><br/>Only then did Kevin Clark notice the place for washing hands in the courtyard. It was a bucket with a hand pump on top. <br/><br/>Before washing their hands, they had to press a few times to get the water out, and the water needed to be filled frequently. <br/><br/>“I remember there was no shortage of water here, and every household has tap water.” <br/><br/>“Yes, it’s connected in the village.” Daisy Zane said, “But this place is on a mountain one kilometer away from the village.” <br/><br/>“So the water...” <br/><br/>“After going down the mountain, walk about five or six hundred meters, and there’s a well.” Daisy Zane said, “If we run out of water, we will go get it.” <br/><br/>Kevin Clark said nothing. The conditions in Cold Green Village were already bad enough, but the place they lived in was even worse. <br/><br/>They were making life difficult for themselves. <br/><br/>“It’s really inconvenient, but once you get used to it, it doesn’t feel like anything.” Daisy Zane said, “You know, my grandma is mixed-blood, and was sold to this place. At that time, everyone was rejecting her, so she moved to the mountain by herself.” <br/><br/>Kevin Clark played with a small stick, stirring the fire, and listened quietly to her. <br/><br/>“There’s a small piece of land behind the house, which can be self-sufficient.” <br/><br/>Daisy Zane tapped the edge of the water tank with her hand, looking at Kevin Clark’s half-face illuminated by the fire, “Over time, I’ve gotten used to it. It’s almost like being cut off from the world, quite enjoyable.” <br/><br/>Kevin Clark played with the wooden stick in his hand and thought about her words. <br/><br/>If she was really enjoying her life, then why did she leave Cold Green Village again? <br/><br/>She and her grandma were dependent on each other. Moreover, her grandma’s health was not good and needed someone to take care of her for a long time. <br/><br/>Why would she leave her grandma behind without anyone to look after her? <br/><br/>She had known those people for many years, not just after her grandma’s death in the past two years. <br/><br/>Unless someone else took care of her grandma here, or the information he got was wrong. <br/><br/>“When did you leave Cold Green Village?” <br/><br/>Daisy Zane’s fingers, tapping the water tank, paused for a moment and then she silently said, “It’s been quite a few years. I don’t remember it very well.” <br/><br/>Feeling that she seemed not very willing to talk about it, Kevin Clark didn’t ask more and changed the topic, “I went to see Charles Amos yesterday, and he knew I was coming over. He asked me to say ‘Happy New Year’ to you.” <br/><br/>Daisy Zane smiled, “Didn’t he say to bring New Year’s gifts?” <br/><br/>“No.” Kevin Clark said, “Apparently, he had some financial problems and needs to collect New Year’s money before he can send gifts.” <br/><br/>Daisy Zane laughed, “What a little brat, so young, but has so many cunning ideas.” <br/><br/>“He’s very smart.” Kevin Clark praised, “Much smarter than his peers.” <br/><br/>“Good genes, I guess.” Daisy Zane casually said. <br/><br/>Kevin Clark raised his eyebrows and smiled, “I was also very smart when I was young, and smarter than my peers.” <br/><br/>Daisy Zane didn’t know why he suddenly praised himself. <br/><br/>“My genes are also very good.” Kevin Clark joked. <br/><br/>Daisy Zane: .\t\t\t\t\t\t</div>", "images": {}, "success": true}