{"id": 113, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223411.html", "title": "Chapter 113 - 108: Going Out To Give New Year’S Greetings", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 113 - 108: Going Out To Give New Year’S Greetings</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 113: Chapter 108: Going Out to Give New Year’s Greetings <br/><br/>Translator: 549690339 <br/><br/>The next day was New Year’s Eve. <br/><br/>Daisy Zane hardly slept all night, rising as dawn began to brighten the sky. <br/><br/>She took two bottles of wine and three goblets from her suitcase, then headed uphill. <br/><br/>After a long walk, she reached a mountaintop. <br/><br/>The mountain was full of lush greenery, with an ancient tree that must have been there for a hundred years. <br/><br/>The trunk was so thick that two adults couldn’t wrap their arms around it. <br/><br/>It faced the sun, so its lush, wide canopy stretched out to the south. <br/><br/>It provided excellent shade below. <br/><br/>However, in this shady spot, two gravestones stood to the south. Updated from novelbIn.(c)om<br/><br/>One belonged to Daisy’s grandmother, Victoria Zane, and at the other, there was an empty tombstone with nothing written on it. <br/><br/>They stood on the mountaintop, facing the sun, gazing at the stretching mountains and the world beyond Cold Green Village. <br/><br/>Daisy Zane hadn’t been here for an entire year, and some weeds had grown around the tombstones. <br/><br/>She set down the wine and glasses, cleared some of the weeds, and then cleaned the two tombstones. <br/><br/>Once she finished, she squatted in front of the tombstones and watched for a while. Then she opened a bottle of wine, pouring it into all three glasses. <br/><br/>She placed a glass in front of each tombstone, then took one for herself. She sat between the two tombstones, gazing out at the rugged, unending mountains... <br/><br/>The sun rose higher, and the temperature climbed with it. <br/><br/>The wind on the mountaintop blew, sweeping over the grass beneath and rustling the tree overhead, causing Daisy’s hair to flutter. Even the wine in the glass rippled. <br/><br/>Daisy’s eyes looked even lighter under the sunlight, and she remained motionless. The usual cold demeanor had faded. <br/><br/>She looked dazed, expressionless. <br/><br/>It was a state of deep relaxation, not just physical but also mental. Even her thoughts seemed to have slackened. <br/><br/>She even looked a little deflated. <br/><br/>Another gust of wind blew across, pushing the hair on her cheek back down. <br/><br/>It was as though an invisible hand had soothed her hair back into place. <br/><br/>Her eyelashes twitched slightly, and she gradually regained her focus, glancing at the empty tombstone next to her. <br/><br/>A faint smile curled her lips, and she sipped the wine. <br/><br/>“Brought your favorite wine,” she said. “It’s New Year’s, you can drink a bit more.” <br/><br/>Although he seemed serious, you could tell he was slightly anxious. <br/><br/>He didn’t even ask the servants to carry his cases, presumably because he felt they were too slow. <br/><br/>Mr. &amp; Mrs. Clark, along with Theo Clark’s family of four, and a yard full of servants, all watched him. <br/><br/>They hadn’t seen Kevin Clark in such a rush before, not to mention carrying suitcases himself. <br/><br/>“Where are you going during the New Year?” Theo Clark asked. <br/><br/>“Out to pay some New Year visits,” Kevin Clark replied. <br/><br/>Theo looked at his parents, then his wife. He felt like he was dreaming: “Does our family... have relatives that require you personally to pay New Year visits? <br/><br/>And with luggage? Who has such a big influence?” <br/><br/>Kevin Clark looked at his parents: “Mom, Dad, I’m going on a vacation down south, I’ll be back after the seventh day of Chinese New Year.” <br/><br/>Then he turned to Theo: “Big brother, you guys stay at home and be with mom and dad. I’m leaving.” <br/><br/>As soon as he finished speaking, not giving anyone time to protest, Kevin Clark hurriedly left the main courtyard. <br/><br/>By the time everyone regained their senses, he was long gone. <br/><br/>“Rebellious child! He’s always away from home, now he’s even gone during <br/><br/>New Year!” Elina Clark scolded.” <br/><br/>Theo Clark also felt it was unusual. His brother, every year except for paying respects to the patriarch of the Lane family, hardly met anyone. <br/><br/>Granted, their family didn’t have many relatives, and those who came to visit did so for him and his dad. <br/><br/>Kevin was never responsible for entertaining guests, when he was at home, he would either be playing with birds or watering plants. <br/><br/>But running off somewhere, this was the first time in years. <br/><br/>“Hugo, where did he go?” Theo suddenly turned to his son. <br/><br/>Hugo Clark was standing at the back of the crowd, looking down at a message that Allonzo Hobson had sent him. <br/><br/>[Your third uncle seems to be in an extremely bad mood these days.] <br/><br/>[It’s about the Miss Zane I’ve told you about before. The Miss Zane, who made your third uncle bloom like an iron tree. She went back to Cold Green Village for the New Year and won’t return until after the seventh day.] <br/><br/>[You probably know about Cold Green Village. It’s underlined in the poverty alleviation project. There’s no internet or signal there.] <br/><br/>[Your third uncle can’t contact her, he must be going crazy inside. Here’s a word of advice: annoy him less during these days, or you might be the one to bear the brunt of it.] <br/><br/>Hugo Clark promptly turned his cellphone screen off and looked up at his father, saying in a deep voice: “How would I know about third uncle’s affairs?” <br/><br/>“The two of you are always joined at the hip, how could you not know about his affairs?” <br/><br/>“Dad, I hardly saw the third uncle since September till yesterday.” Hugo Clark said. <br/><br/>Theo Clark choked: “You’re two years older than him, ordinarily you should look out for him more. What can he be up to, running away on New Year’s. This kid, doesn’t let people worry less.” <br/><br/>Behind-the-scene knowledgeable Hugo Clark: ‘ What else could it be, he just went to court love..\t\t\t\t\t\t</div>", "images": {}, "success": true}