{"id": 115, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223415.html", "title": "Chapter 115 - 110 Happy New Year", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 115 - 110 Happy New Year</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 115: Chapter 110 Happy New Year <br/><br/>Translator: 549690339 <br/><br/>After the water boiled, Daisy Zane planned to pour it into the thermos flask. This way, when the esteemed gentleman beside her wanted to drink, he wouldn’t need to boil water again. <br/><br/>“Let me do it.” Kevin Clark said. <br/><br/>“No need.” Daisy Zane responded without even looking at him, “Just sit there, don’t meddle.” <br/><br/>He wanted to say something else, but Daisy Zane shot him a light look. He didn’t dare to speak any further and obediently stepped back. <br/><br/>“Be careful, don’t scald yourself.” <br/><br/>Daisy Zane gently blew on the steam: “I won’t.” <br/><br/>After filling the flask, Kevin Clark took it and they both returned to the other room. <br/><br/>Daisy Zane gave a full round of the room before she went into the kitchen to check. <br/><br/>At last, she stared at the dusty cups in the kitchen for a while and put them back. She returned to the room empty-handed. <br/><br/>She really didn’t want to clean, and these cups were quite old. <br/><br/>Even if cleaned, there might still be some traces left. <br/><br/>She could give them to Kevin Clark for usage, he surely would use them. <br/><br/>But she felt it was inappropriate for the prestigious Third Master. <br/><br/>Therefore, after returning to the room, she took out the thermos cup that Kevin Clark bought for her, rinsed it with boiled water, and poured some water for him. <br/><br/>“Third Master, please make do with it.” Daisy Zane said. <br/><br/>Kevin Clark was standing by the desk, looking at the books there. They covered all sorts of topics: ancient and modern, folk affairs, some were even handwritten and thread-bound, all fairly old. The bottom layer seemed to contain a few yellowed newspapers. He accepted the thermos cup: “Thank you.” <br/><br/>“I rinsed it with boiled water.” Daisy Zane said. <br/><br/>Kevin Clark glanced at the cup, smiling, “It would have been fine without rinsing.” <br/><br/>Actually, he preferred not to use a cup that had been rinsed. <br/><br/>Daisy Zane didn’t grasp his words and ignored him. <br/><br/>A smile teased the corner of Kevin’s mouth, “Have you read all these books?” <br/><br/>Hearing his words, Daisy Zane’s eyelashes trembled slightly, then she replied, <br/><br/>“Yes. After my mother went to school, she bought these books for my grandma. Some were written by my grandma herself. Later, I read them.” <br/><br/>“Your grandmother loved studying, eh?” Kevin Clark said. <br/><br/>Daisy Zane nodded her head, “Even though she didn’t go to school, but everything that needed to be learned was probably already learned.” <br/><br/>“May I have a look?” <br/><br/>“Feel free to. <br/><br/>And the other suitcase was entirely packed with food. <br/><br/>Canned food, vacuum-packed sausages, vacuum-packed shrimp with several kinds of shrimp. There were vacuum-packed raw meat as well as an entire raw chicken. <br/><br/>There was even vacuum-packed vegetables, and rice. <br/><br/>Daisy Zane was contemplating, whether she should go up the mountain to catch a couple of snakes for a soup to improve their meals tomorrow. <br/><br/>But this man had brought his own food. <br/><br/>Daisy Zane was shocked. <br/><br/>After watching her expression, Kevin Clark said with a smile: “I visited Charles Amos yesterday. Uncle Edwards reminded me after knowing that I was coming over, that you didn’t bring any food. You were probably going to buy instant noodles when you get off the plane.” <br/><br/>Daisy Zane: . . They don’t just have instant noodles, there are so many other convenience foods now.” <br/><br/>The smile on Kevin Clark’s face softened, gazing at her. He suspected seriously, if no one was managing Daisy Zane, would she, perhaps pamper herself too much. <br/><br/>Daisy Zane avoided his gaze, squatted beside the suitcase, picked a snack, and chewed away slowly. <br/><br/>Seeing her not looking at him, Kevin Clark watched her for a while. He gave her a long wooden box from within the suitcase: “New Year’s gift.” <br/><br/>Daisy Zane put the remainder of the biscuit in her mouth, then accepted the box, and immediately opened it. <br/><br/>It contained a hairpin. <br/><br/>She took it out to inspect it. <br/><br/>The hairpin shank was pure gold, and judging by the weight, it should be solid. <br/><br/>The hairpin top was inlaid with a piece of ice-blue jadeite. The quality was excellent and very transparent. It was clearly valuable at a glance. <br/><br/>A very simple design, but at the same time, very high-class. It also gave a clean feeling. <br/><br/>Some things, the simpler they are, the higher grade they have. <br/><br/>“Do you like it?” <br/><br/>Daisy Zane looked at him, then back to the hairpin: “Mhm.” <br/><br/>Kevin Clark gave a light laugh, walked behind her: “Let me help you put it on.” Daisy Zane handed the hairpin to him. <br/><br/>Kevin Clark delicately pulled out the wooden hairpin from her hair and tucked it into his pocket. Then he used the new hairpin to tie up her hair carefully. <br/><br/>After fixing her hair, he also sorted out the loose strands in the front. <br/><br/>He really loved her appearance when she tucked her hair. A cold demeanor, with a subtle, mature gentleness hidden within, and sometimes a little bit of laziness. <br/><br/>Daisy Zane shook her head, it was very secure, she then turned to look at him: “Third Master, your hairpin-tying skills are very practiced.” <br/><br/>“I specially learned it.” <br/><br/>Daisy Zane laughed, “Since I received the gift, I should offer a New Year’s greeting. Happy New Year.” <br/><br/>Kevin Clark bent down, pushed aside the hair on her forehead: “Happy New <br/><br/>Year.”\t\t\t\t\t\t</div>", "images": {}, "success": true}