{"id": 117, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223419.html", "title": "Chapter 117 - 112: Little Girl", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 117 - 112: Little Girl</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 117: Chapter 112: Little Girl <br/><br/>Translator: 549690339 <br/><br/>Chinese New Year is the time for visiting. <br/><br/>In the second day of the Chinese New Year, Amelia Miles, John Anderson, and Amelia’s brother Jace Miles went to the Hobson Family’s home in the Imperial Capital to offer New Year greetings. <br/><br/>The Hobson Family had always been extremely doting on Charles Hobson, and both Amelia’s brother and sister-in-law had spoiled her as well. <br/><br/>As a result, they were particularly affectionate towards Charles Hobson’s son and daughter, treating them as if they were their own children, especially Amelia Miles. <br/><br/>Moreover, now that they were connected by marriage to the Anning Faction, they had always wanted to win favor with Harry Anderson, so they were also very polite to John Anderson. <br/><br/>They arrived early in the morning, and the whole family sat in the living room chatting. <br/><br/>Amelia Miles leaned on John Anderson’s shoulder, playing with her cell phone, feeling tired from listening to all their conversations. <br/><br/>John Anderson chatted while helping her peel nuts. <br/><br/>“Have you two made any plans for when to get married?” asked their aunt with a smile. <br/><br/>John Anderson glanced at Amelia Miles and said, “We’ve been discussing this issue recently and are considering getting married around June.” <br/><br/>“It’s good that you have plans,” added their uncle. “But once you’ve made up your minds, make sure to tell your family in advance. We only have one daughter in our family, and both families dote on her. We must have a grand wedding. Many things need to be arranged, so we need to know ahead of time.” Updated from novelbIn.(c)om<br/><br/>“I understand, uncle,” Amelia Miles replied. “You’ll be the first one to know when the time comes.” <br/><br/>“Tell your mom first, and then tell me.” <br/><br/>“Okay, okay, I got it,” Amelia Miles said obediently with a smile. <br/><br/>After she finished speaking, she no longer participated in their conversations and quietly looked at her phone. <br/><br/>After watching a video, she opened Facebook. <br/><br/>She was just browsing aimlessly. <br/><br/>Suddenly, a post caught her attention. <br/><br/>[Is there any clean place left? The entertainment industry is so dirty. Even a nobody like Daisy Zane can sit next to a big-shot director and choose characters. I really don’t know what she can choose. I also don’t know why she can sit there and on what basis. @Morris @ Flynn Ninevara. I really like their shows, and I regard both of them as idols. But I won’t watch them again, because it’s disgusting and too dirty. ] <br/><br/>There were two photos below the post, taken during the audition day, showing Daisy Zane sitting next to Morris. <br/><br/>They were probably taken secretly, so they were somewhat blurry. But they could still clearly see that it was Daisy Zane and Morris. <br/><br/>The account that posted this has very few followers and mostly share some gourmet food. <br/><br/>So far, not many people have seen it. <br/><br/>Looking at the post, Amelia Miles’ heart raced. Finally, someone was talking about it. Finally, someone was addressing this issue. <br/><br/>She tightly clenched her phone, showing no emotion on her face. She told everyone in the living room that she was going to make a phone call and hurried to the courtyard to call Olivia Chester, informing her of this matter. <br/><br/>While the storm brewed outside, the two people in Cold Green Village, completely isolated from the world, were still pulling weeds in the courtyard. <br/><br/>Who could have thought that the Third Master of the Imperial Capital would drive himself to Cold Green Village? <br/><br/>And who would have thought that the Third Master, who was born with a golden spoon in his mouth, not only came to Cold Green Village but also pulled weeds there. <br/><br/>If they told anyone, it would probably scare everyone’s heads off. <br/><br/>“Third Master, actually, it’s okay not to pull them. They’ll grow back next year anyway.” <br/><br/>After finishing breakfast, Kevin Clark continued to weed. This was already the third time Daisy Zane had tried to persuade him. <br/><br/>“You don’t want me to work hard?” <br/><br/>Daisy Zane turned her head to look at him and gave him an “if you say one more word, believe it or not, I’ll leave you here” look. <br/><br/>Kevin Clark understood her meaning and smiled, “If I didn’t come, you would definitely clean up the courtyard, right?” <br/><br/>Daisy Zane looked away and didn’t say anything, tacitly agreeing. <br/><br/>“Since there are still people coming back, it makes no sense to let the courtyard go to waste.” Kevin Clark switched legs to squat and continued, “If they grow back next year, I’ll come back to pull them then.” <br/><br/>Hearing his words, Daisy Zane clenched her hand tightly, cutting the grass in her hand in half. <br/><br/>Why would there be someone who understood her so well. <br/><br/>“Daisy, let’s discuss something.” <br/><br/>“Hmm?” <br/><br/>“Don’t call me Third Master anymore.” Kevin Clark said, “Call me by my name.” <br/><br/>“What if I don’t,” Daisy Zane said coldly, not letting any emotion seep into her words. <br/><br/>“Then...” Kevin Clark looked at her, his eyes narrowing dangerously as he smiled, “We are alone in these wild mountains, I might just take advantage of you.” <br/><br/>Daisy Zane flicked the dew from the grass onto his face, “What dreams are you having, Third Master.” <br/><br/>She bit down a bit harder on the words “Third Master”. <br/><br/>After being splashed with water, Kevin Clark closed his eyes and wiped his face with his arm. He didn’t get angry at all and laughed, “Little girl, you know I won’t do anything to you, you’re getting more and more unscrupulous.” <br/><br/>Daisy Zane showed no emotion on her face, staring at him. Then she lowered her head, pinched a bit of dirt, and threw it onto Kevin Clarks shoes. <br/><br/>“Hiss— <br/><br/>Hearing his grinding and helpless sound, a faint smile appeared in Daisy Zane’s eyes. <br/><br/>Kevin Clark saw her smile and felt happy inside. He wanted to reach out and pinch her face, but his hand was a little dirty. In the end, he could only rub her face with the back of his hand and said in a doting tone, “Little girl.’ <br/><br/>Just a little girl. No matter how strong, mature, or indifferent her appearance, she was still a little girl in her heart. <br/><br/>So mischievous she couldn’t handle it..\t\t\t\t\t\t</div>", "images": {}, "success": true}