{"id": 128, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223441.html", "title": "Chapter 128 - 120 Easton Group", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 128 - 120 Easton Group</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 128: Chapter 120 Easton Group <br/><br/>Translator: 549690339 <br/><br/>Bonnie Maxwell had finished using the restroom a while ago but she stayed inside and continued listening. <br/><br/>She knew about Daisy Zane’s existence and had investigated her identity. A lass from the countryside, and an illegitimate child. <br/><br/>Kevin Clark was interested in her probably because he found her attractive and she fit his aesthetic preferences. <br/><br/>After all, in some respects, Daisy Zane had something in common with Natalie <br/><br/>Wayne. <br/><br/>Men tend to be fond of women who bear resemblance to their mothers. <br/><br/>However, for Daisy Zane, with her current status, to enter the Clark family...was absolutely impossible. Kevin Clark surely understood this too, he was just amusing himself with her. <br/><br/>But now...the sudden interest of Natalie Wayne in Daisy made things a different story. <br/><br/>Even though she had introduced Daisy to Hugo Clark, she...couldn’t let down her guard. <br/><br/>Bonnie Maxwell waited until Natalie Wayne and Hugo Clark had finished their chat and then a little while more before leaving the restroom. <br/><br/>“Aunt Wayne, I’m ready.” <br/><br/>Natalie Wayne put away her phone, and gently smiled, “Let’s go back and see if there are any pieces you like.” <br/><br/>“Okay.” Bonnie Maxwell held Natalie’s arm. After leaving the restroom, she casually said, “The woman in the restroom just now seemed to be a celebrity.” “Do you recognize her?” Natalie Wayne looked at her and asked. <br/><br/>“I have seen her online.” Bonnie Maxwell said, “I think her name is something... Daisy... Daisy Zane.” <br/><br/>“Daisy Zane.” Natalie Wayne repeated the name, smiled gently, “Zane... it’s a nice name.” <br/><br/>“I saw online that she’s apparently from the Truro Song Family.” <br/><br/>“The Song Family?” Natalie Wayne took another look at Bonnie Maxwell, continuing her thought, “Then why is her surname Zane? Is it her mother’s surname?” <br/><br/>“Yes, it’s said online that Daisy was born from her father’s extramarital affair.” Bonnie Maxwell stopped there and said softly, “I’m not sure if it is true. We can’t believe everything on the internet. It’s common for celebrities to disparage each other. The entertainment industry is quite chaotic.” <br/><br/>Natalie Wayne’s expression didn’t change, commenting as if she were chatting idly, “Her background seems quite pitiful.” <br/><br/>Bonnie Maxwell paused for a moment, “Indeed, nobody wants to bear the label of ‘illegitimate child.”‘ <br/><br/>Natalie Wayne smiled and naturally switched the topic. <br/><br/>When Daisy Zane left the restroom, she only took a few steps before running into Kevin Clark. <br/><br/>Upon seeing him, Daisy Zane felt at ease for reasons unknown. But such subconscious peace was soon replaced by a sense of fear and unease deep within her heart. <br/><br/>“Lucia, do you...know something?” watched Kevin Clark, asking pointedly. <br/><br/>Daisy Zane fixed her gaze upon his, her lips slightly curling, “I know a lot of things. ” <br/><br/>Kevin Clark’s gaze that held hers suddenly darkened, his eyes reflecting a ruthless determination, his voice slightly low, “Really?” <br/><br/>“Yes.” said Daisy Zane, her action against him, akin with standing against the edge of a sword without any fear, “I not only know that Easton’s Group mass-produces electronic products, artificial intelligence on the surface, I also know what Easton’s Group researches secretly...” <br/><br/>The secret that Daisy was aware of, so she halted rather than saying it outright; “Also...l know that the Easton Group is of the Clark lineage. The Clark as in Kevin Clark.” <br/><br/>Allonzo Hobson clenched his fists, Michael Jackson felt a chill pass over him, and Juan Wright looked serious for once. <br/><br/>Kevin Clark watched her, his eyes held an unprecedented seriousness and intensity towards her. Very few people knew about what he did, even his parents were unaware. What did she know? Who is behind her? <br/><br/>Daisy Zane kept looking at him as well. <br/><br/>However, Allonzo Hobson and the other two shared the same thought, that they shouldn’t underestimate her, but they still did. <br/><br/>Yet, Kevin Clark gazed at her for a while, and all of a sudden he laughed, all his malevolence disappeared. He glanced at the robot on the catalog, “Do you like it? If you do, I can have a few delivered for you to play with.” <br/><br/>Daisy Zane looked at him, neither moved nor said a word. <br/><br/>The other three noticed Kevin Clark’s attitude and seemed to want to say something, but they remained silent in the end. <br/><br/>“Lucia?” <br/><br/>Daisy Zane looked down at the catalog and shook her head, then after a while, joked, “Aren’t you going to make this another unsolved case?” <br/><br/>“If it was someone else, it would be nasty.” Clark’s response was with a raised eyebrow. <br/><br/>Kevin Clark believed she wouldn’t harm Easton, and she wouldn’t reveal their secrets. <br/><br/>Moreover, he had confidence in himself. <br/><br/>Even six years ago, when Nathan Ninevara shut down the whole Easton, he couldn’t touch the core of Easton. At most, they only found out what they were researching on a deeper level. <br/><br/>Because their secret research itself was separate from Easton. <br/><br/>And they increased their security afterwards. <br/><br/>The more people who knew about it, the more trouble they would have. <br/><br/>For example, someone would directly bring people to Easton’s territory and forcefully seize the technology. <br/><br/>Although, she didn’t take that into account. But it’s always better to avoid trouble whenever possible. <br/><br/>So if the person who said those things just now wasn’t Daisy Zane. Now that person, including the people behind him, shouldn’t expect to get away with it. <br/><br/>Daisy Zane also smiled lightly and looked down at the auction below. <br/><br/>Her thumb was constantly rubbing against the hand warmer in her hand, almost wearing down the thin layer of skin on its surface..\t\t\t\t\t\t</div>", "images": {}, "success": true}