{"id": 126, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223437.html", "title": "Chapter 126 - 118: Getting Married Into The Lane Family", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 126 - 118: Getting Married Into The Lane Family</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 126: Chapter 118: Getting Married into the Lane Family <br/><br/>Translator: 549690339 <br/><br/>On the evening of the eighth day of the lunar month, the Doomsday Hotel held an auction. <br/><br/>In the afternoon, Daisy Zane was waiting at home for Arthur North to pick her up. <br/><br/>She was sitting in the living room, watching Charles Amos running back and forth in the room. His curly shoulder-length hair was all messed up. <br/><br/>“Come here, let me tie up your hair.” <br/><br/>Charles fetched a box of small hair ties from the living room bookshelf and grabbed an ancient Luban lock next to it. <br/><br/>He sat on the carpet with his back to Daisy, fiddling with the exceedingly complicated Luban lock <br/><br/>“Can’t we just cut it short?” <br/><br/>Daisy ran her fingers through his hair and said, “With those curls of yours, cutting it short would just make them frizzier.” <br/><br/>“But which boy keeps long hair?” Charles said and then continued, “I don’t want to be like that weird uncle.” <br/><br/>“That person is weird, but it has nothing to do with him having long hair, ” Daisy said calmly. “If you go back a few hundred years, everyone had long hair.” “That’s feudal dross, not acceptable,” Charles argued. <br/><br/>“Feudal dross refers to thoughts and certain systems,” Daisy said, “The way you’re thinking right now is truly feudal dross.” <br/><br/>“Oh,” Charles responded and was silent for a while before asking, “But who did I inherit these curls from?” <br/><br/>Wilton Edwards, who was watering the plants in the living room, suddenly quivered, and the water spilled out. <br/><br/>“Daddy’s hair is both black and straight,” Charles said. “Although Mom’s is a bit yellow, it’s still straight.’ <br/><br/>“Who knows where your quarter-blood genes came from,” Daisy tied a half-bun for him and said, “Off you go.” <br/><br/>Charles touched his small bun, put the box of hair ties back in place, and began running around the living room again. <br/><br/>After a while, Wilton served Daisy a bowl of his freshly boiled Tremella soup and said, “Young Master is much more lively since Miss came back.” Daisy sat up straight, took the bowl with both hands, and said, “You talk too much.” <br/><br/>Wilton sat down on a single sofa, and just as he was about to say something, the cell phone on Daisy’s table suddenly rang, interrupting him. <br/><br/>Daisy glanced at the incoming call display, which was from Felix Baker, an overseas call. She picked up the phone and put it on speakerphone. <br/><br/>“You’re in D Continent?” <br/><br/>“Yes,” Felix replied. “I arrived here on the third day of the lunar month.” “What’s the matter?” Daisy sipped her Tremella soup and said, “You don’t sound very happy.” <br/><br/>“Fuck, the price of jadeite in D Continent has skyrocketed several times,” Felix cursed. “Now, even if I pay 40 percent of the price, it’s no different from when I paid the full amount before.” <br/><br/>Daisy frowned slightly and asked, “What’s going on?” <br/><br/>“I don’t know,” Felix said, “I can’t find any information. People are only saying that if you want to buy, pay up; if you don’t want to, just leave.” <br/><br/>“What about the diamonds in F Continent? Did you check on those?” <br/><br/>“Doomsday Hotel.” Daisy said, “I’ve seen a lot of rich people. But those like Doomsday Hotel, flaunting their wealth... are just so easy to hate.” <br/><br/>Allonzo Hobson chuckled and gave Daisy a thumbs-up: “Brook Sister, you’re brave for saying the Lane Family deserves a beatdown.” <br/><br/>“You flatter me.” Daisy replied. <br/><br/>Kevin smiled at her. <br/><br/>“The first time I stepped into the Doomsday Hotel, my first instinct was to make it my own.” Daisy said. <br/><br/>Allonzo’s mouth twitched. What a grand aspiration. He dared not even dream of it his entire life. <br/><br/>“Have you done anything in pursuit of this goal?” Kevin asked, pouring tea for her. <br/><br/>Daisy looked at the color of the tea, paused, and said, “After observing for three years, the only easy and reasonable method I could think of was to marry into the Lane Family.” <br/><br/>“Cough—I’ Allonzo almost choked on a sunflower seed shell. <br/><br/>Kevin’s hand trembled, spilling tea on the table. <br/><br/>Michael Jackson and Juan Wright had been sitting behind the three of them. Both were shocked. Michael was quick to react, standing up and grabbing some tissues to clean the spilled tea. <br/><br/>When Daisy saw his tea spill, she glanced at him. <br/><br/>Kevin seemed to want to say something, but his lips quivered, and he suddenly couldn’t speak. <br/><br/>He suddenly remembered that Daisy seemed quite interested in the Lane family’s affairs. After all, aside from the ostentatious Doomsday Hotel, they were very mysterious. It was normal for people to be curious; everyone was curious. <br/><br/>What he never expected was that she would have such a thought. <br/><br/>Warning bells rang in his heart. <br/><br/>“Lucia.” Kevin said seriously, “Actually... my family is also very rich, even richer than the Lane family.” <br/><br/>Allonzo, Michael, and Juan all turned to look at Kevin. <br/><br/>“Does your family’s wealth have a lot to do with you? You don’t even have any shares or inheritance rights.” Daisy looked at him and said casually. <br/><br/>Kevin’s mouth twitched. <br/><br/>The other three all pursed their lips, obviously wanting to laugh but fearing it would be bad luck at this moment, so they held it in. <br/><br/>“I’m also very rich.” Kevin said, “Not worse off than the Lane family.” <br/><br/>Daisy looked at him, his anxious expression to prove himself, and couldn’t help it: she burst out laughing. <br/><br/>Seeing her laugh, Kevin knew she was teasing him again, and he had fallen for it once more. <br/><br/>“I just thought it was one possible option.” Daisy said with a light smile, “I never said I wanted to follow through with it.” <br/><br/>Allonzo rubbed his face, trying to tamp down the corners of his mouth, trying not to grin. <br/><br/>Kevin clenched his teeth, pinched her face, and threatened, “I’ll tame you sooner or later.” <br/><br/>Daisy used the back of her hand to rub the spot he pinched, lowered her head, and laughed even harder..\t\t\t\t\t\t</div>", "images": {}, "success": true}