{"id": 123, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223431.html", "title": "Chapter 123 - 116: No Discord, No Concord", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 123 - 116: No Discord, No Concord</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 123: Chapter 116: No Discord, No Concord <br/><br/>Translator: 549690339 <br/><br/>After the first person asked for an autograph, others quickly grew bolder. <br/><br/>Although Daisy Zane seemed unapproachable, she didn’t turn anyone down. <br/><br/>As a result, she spent over half an hour just signing autographs. <br/><br/>Juan Wright drove over to pick them up, but he didn’t dare come closer when he saw so many people from a distance. <br/><br/>He only ran over to help with the luggage when both of them walked over to him. Follow current novels at novelhall.com)<br/><br/>“Happy New Year, Lady Zane,” He said with a smile. <br/><br/>“Happy New Year,” Daisy Zane replied. <br/><br/>Once they got in the car, Daisy Zane leaned back in the seat, closing her eyes. <br/><br/>Kevin Clark held her hand and asked with a laugh, “Tired?” <br/><br/>“Just a bit noisy.” Daisy Zane responded with her eyes closed. “I can’t tell what ‘Flynn Ninevara’ means now.” Kevin Clark chuckled. <br/><br/>“Being a celebrity is really tough.” <br/><br/>Daisy Zane wasn’t really tired, but she found the noisy, adoring environment a bit unbearable. <br/><br/>“Third Master... Those media definitely captured you in their footage, do we need to deal with it?” Juan Wright asked when they fell silent. <br/><br/>“What, can I not show my face?” Kevin Clark retorted. <br/><br/>Daisy Zane: . <br/><br/>“Moreover...he paralyzed the entire program of our skyscraper when he sabotage us. You issued a warrant for him at that time.” Juan Wright said, “If it were me, I wouldn’t show up either. I’d be afraid of you chopping off my hands, or worse, you might kill me.” <br/><br/>Daisy Zane scratched her cheek and looked out of the car window. <br/><br/>“Although he belongs to Celestial Pivot now, with his level, even Holt Lawrence probably doesn’t know where he is.” Juan Wright continued, “The only option available to us is to break into Celestial Pivot’s system, forcing him out. Once he comes out, we could launch an attack on Celestial Pivot and force Holt <br/><br/>Lawrence to hand him over.” <br/><br/>Daisy Zane: . <br/><br/>“Once that happens and we have Nathan Ninevara on our side, we can let bygones be bygones.” Juan Wright said excitedly, “If he refuses to follow...then we’ll cut off his hands, chop off his feet, open his head, then...” <br/><br/>“Shut up,” Kevin Clark said softly. <br/><br/>Juan Wright suddenly remembered Daisy Zane’s presence, in a hurry, he said, <br/><br/>“Lady Zane, I was joking. We normally act upright, really! ” <br/><br/>To this, Daisy Zane returned a ‘you think I believe that?’ sort of look. <br/><br/>“Really.” Juan Wright said, “Against our enemies, we always try to change them with love.” <br/><br/>“You’re full of ideas, how about I give you the position of Big Boss?” Kevin Clark suggested. <br/><br/>“No, no, no. Third Master. What I said was nonsense,” Juan Wright quickly responded. <br/><br/>“If you continue to be this worthless, eating food without doing work, I’ll chop off your hands first.” Kevin Clark didn’t even look at him, his voice calm but deadly. <br/><br/>Juan Wright’s heart skipped a beat. He swallowed and didn’t dare say another word..\t\t\t\t\t\t</div>", "images": {}, "success": true}