{"id": 125, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223435.html", "title": "Chapter 125 - 117: You Are Still The Best", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 125 - 117: You Are Still The Best</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 125: Chapter 117: You Are Still the Best <br/><br/>Translator: 549690339 <br/><br/>“Did you find Old Master Ian?” <br/><br/>Daisy Zane saw the video online and called Morris. <br/><br/>“Old Master Ian has been retired for so many years?” Morris said, “That time we met was just a chance encounter. Do I have that much face to invite him? Besides, I forgot that you were there when we met.” <br/><br/>Morris used to work at the National Theater, and Old Master Ian retired in Morris’s second year of work. <br/><br/>Perhaps because of his bad temper and weird personality at times, the old master had a particularly deep impression of Morris. <br/><br/>So when they met at the restaurant, Old Master Ian recognized Morris immediately, and the two talked for a few minutes. <br/><br/>Maybe it was indeed a matter of fate. Catherine and Morris happened to have dinner together and just happened to meet Old Master Ian that time. <br/><br/>So Morris just gave a brief introduction. <br/><br/>“I wanted to ask you.” Morris said, “I thought you pulled some strings behind my back and got to know such an incredible person.” <br/><br/>Daisy Zane: . <br/><br/>“Do you know Old Master Ian’s status in this industry?” Morris excitedly said, “He is a divine presence. His verification for you is like your screenwriter status being endorsed by the country. An official authoritative certification. It’s one hundred times more impressive than you winning ten thousand awards. I’m even basking in your glory.” <br/><br/>“Use Catherine’s Facebook to reply to that video.” Daisy Zane said. <br/><br/>“Okay. I know.” <br/><br/>After hanging up the phone, Daisy Zane lay in bed for a while, only getting up to wash and rinse when the sound of the piano came from downstairs. When she went downstairs, Harton Clark was sitting next to Charles Amos, watching him play the piano. <br/><br/>“When did you come?” Daisy Zane, wearing white home clothes and a bun, walked over to the piano. <br/><br/>Charles Amos stopped playing and said in a milky voice, “Uncle Clark came early in the morning, took me out for a run, accompanied me for breakfast, helped me practice writing, and now is accompanying me to play the piano. And you’ve been sleeping.” <br/><br/>“You must be itching for a spanking, aren’t you?” <br/><br/>Charles Amos glanced at her, closed his little mouth, and dared not speak. <br/><br/>Harton Clark rubbed the child’s hair and said to Daisy Zane, “Go eat something first.’ Updated from novelbIn.(c)om<br/><br/>“Hmm.” Daisy Zane agreed but didn’t move. Leaning on the piano, she asked, “Is Old Master Ian the one you found?” <br/><br/>Harton Clark nodded: “The Clarks still have some influence in Imperial Capital.” “Did you go yesterday afternoon?” “Hmm.” <br/><br/>“Any news on the Davis side?” <br/><br/>“Liam Davis contacted me yesterday afternoon, saying that the Family Recognition Banquet should proceed as planned, ” Johanes Miles said. <br/><br/>“It should, indeed, continue as per planned,” Old Master Miles said. “Even without the Davis family, her screenwriter identity has reached this level, and she must have many connections. George Dunn, who has always been helping her clarify matters, is the son of the Imperial City Dunn Family. It seems that their relationship is very close based on what he posted.” <br/><br/>“Yes.” <br/><br/>“Then proceed as per planned,” Old Master Miles said. “Find media outlets and release the news first. Once the specific date is confirmed, make the official announcement. ” <br/><br/>“Okay.” <br/><br/>“Jace, do you have any opinions about this matter?” Old Master Miles suddenly asked him. <br/><br/>Jace was enjoying a fruit plate and nearly choked when Old Master Miles suddenly called on him. He quickly swallowed the fruit and said, “I have no objections. They are all Father’s children; it’s right to recognize them.” <br/><br/>Charles Hobson glared at him. <br/><br/>“Although I may not treat her like I would Amelia, I’ll... try to take on the role of an elder brother.” <br/><br/>“Well, that’s good,” Old Master Miles said. “Only with unity among siblings will the Miles Family continue to prosper.” <br/><br/>“Yes, I know, Grandfather.’ <br/><br/>Amelia heard these conversations at the entrance but didn’t enter the living room. Instead, she turned around and left the house again. <br/><br/>She returned to her car, changed the SIM card in her phone, and called someone. <br/><br/>“What are the investigation results about Daisy Zane’s assistant?” <br/><br/>The voice on the other side was disguised, neither male nor female, saying, “She comes from a normal family. Anisa Cooper has a boyfriend. They’ve been together for many years. However... her family doesn’t approve of their relationship.” <br/><br/>Amelia’s fingertips circled the steering wheel, her eyes filled with a malicious glint: “Create some trouble for her and her boyfriend, then resolve it. Let her be grateful and indebted so that she can be used by us.” <br/><br/>“Okay.” <br/><br/>“Is Daisy Zane still in Imperial Capital?” <br/><br/>“Yes.” <br/><br/>Amelia was silent for two seconds before saying, “Release the news to <br/><br/>Benjamin Hobson.” <br/><br/>“Benjamin Hobson?” the voice on the other side said. “Isn’t he your cousin?” “Just release the news to him,” Amelia said impatiently. <br/><br/>“Alright, I’ll do it for the money,” the voice on the other side said. “Wait for the news..”\t\t\t\t\t\t</div>", "images": {}, "success": true}