{"id": 129, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223443.html", "title": "Chapter 129 - 121: When Will You Give (Me) A Status?", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 129 - 121: When Will You Give (Me) A Status?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 129: Chapter 121: When Will You Give (me) A Status? <br/><br/>Translator: 549690339 <br/><br/>Kevin Clark was at the auction for fun and it would be hard to explain if he didn’t bid on anything. <br/><br/>There was a dressing box at the back, coming from the hands of an old master during the England period. <br/><br/>The material, craftsmanship, and carving were all very good. <br/><br/>So Kevin Clark asked Juan Wright to bid. <br/><br/>But... There was a bidding voice from the partition room in the southeast corner of the upper floor. <br/><br/>He thought they would give up after a few bids. <br/><br/>But unexpectedly, the person in the southeast corner was relentless. <br/><br/>And they showed no signs of weakness, following closely. <br/><br/>Daisy Zane was sitting beside him, chatting with Kevin Clark as usual, but half of her mind had already wandered off. <br/><br/>Thinking about other things. <br/><br/>So she didn’t think much and assumed that the dressing box was for his mother. <br/><br/>She had seen how Kevin Clark was wealthy and persistent, so she just quietly watched Juan Wright bidding on the side. <br/><br/>As the stalemate between the two parties continued, and no one was willing to give in, the auction on the ground floor had become a spectacle and could not proceed towards its conclusion. <br/><br/>So the Lane Family intervened and mediated. <br/><br/>Although they didn’t know who was in the partition rooms, the Lane Family knew. So they came to Kevin Clark’s side first to inform them of the details. <br/><br/>The door of the partition was knocked. <br/><br/>Michael Jackson opened the door, spoke a few words with the Lane Family, and then came back in. <br/><br/>“Third Master...” Michael Jackson bent down beside Kevin Clark and whispered, <br/><br/>“The one bidding against us is Madam.” <br/><br/>Juan Wright had just called out another bid, and upon hearing this, he suddenly looked at Kevin Clark. His neck almost snapped. <br/><br/>“My mom?” Kevin Clark looked at Michael Jackson. <br/><br/>Michael Jackson nodded his head, his expression somewhat tragic: “Yes.” Kevin Clark: <br/><br/>Although half of Daisy Zane’s mind was occupied with other matters, she still <br/><br/>chuckled. <br/><br/>Raising the price against one’s own family... <br/><br/>Natalie Wayne’s mouth twitches in response. A few seconds pass, and she looks at her fingertips. <br/><br/>He won’t let her touch his pulse, could it be... <br/><br/>Natalie Wayne takes a sharp breath, immediately deciding to go home and study a prescription. <br/><br/>After talking with his mother, Kevin Clark leaves with Daisy Zane first. <br/><br/>He asks Juan Wright to get the dressing box. <br/><br/>After taking Daisy Zane home, the car stops in the courtyard entrance, and Kevin Clark accompanies her inside. <br/><br/>Daisy Zane’s hand is tucked into her coat pocket while she slowly walks, saying, “I thought... you were getting the dressing box for Mrs. Clark.” <br/><br/>Kevin Clark leans back, hears her words, smiles, and softly repeats, “Mrs. <br/><br/>Clark. ” <br/><br/>Daisy Zane: . <br/><br/>“Daisy.” Kevin Clark stops and calls her name. <br/><br/>Daisy Zane has already climbed a level of steps when she hears him speaking, so she turns and looks at him. <br/><br/>“Daisy.” Kevin Clark moves a step forward, gripping his fingertips, and slightly lowers his head to look at her, “Daisy, when can you give me a title? A... boyfriend’s title.” <br/><br/>Daisy Zane tilts her head to look at him, suddenly stunned. Her eyelashes flutter twice, dazed. <br/><br/>There’s a sudden pang in her heart. <br/><br/>Seeing that she doesn’t speak, Kevin Clark lifts his hand to touch her face, and whispers gently, “It’s alright, there’s no rush. This is a lifelong event and needs to be thought through.’ <br/><br/>Daisy Zane looks at him and tightens her lips a little. “Go home.” Kevin Clark says, “It’s too late; I won’t come in.” <br/><br/>“Mhm.” <br/><br/>When Daisy Zane returns home, Charles Amos is already asleep. <br/><br/>She tells Wilton Edwards to go to bed, and she goes to Charles’s room herself. She sits in Charles’s room for more than an hour before returning to her own room. <br/><br/>After taking a shower, Daisy Zane lies in bed for a long time. Thinking about today’s phone calls, she can’t fall asleep. <br/><br/>Around 3 a.m., she puts on a coat, goes downstairs, and opens two bottles of wine. <br/><br/>Then she sits by the bay window, sipping wine glass by glass. <br/><br/>At around 4 0’clock, Wilton Edwards comes out and sees the light on under the bay window. He goes to check and sees Daisy Zane leaning on the glass, her hair a bit messy. An empty red wine bottle is lying at her feet, and another half-full bottle is beside it. <br/><br/>“Lady...” <br/><br/>Daisy Zane turns her head to look at him. Her eyes are red, as if she’s been crying, but it doesn’t look like she shed any tears: “Wilton Edwards, why are you out?” <br/><br/>Wilton Edwards is wearing a coat, and when he sees her like this, his eyes fill with tears. He walks to her side and asks, “Lady, what’s wrong? Did you encounter any problems?” <br/><br/>Daisy Zane sits up straight, raises her hand to brush back her hair, and says in a hoarse voice, “It’s nothing, I just can’t sleep..”\t\t\t\t\t\t</div>", "images": {}, "success": true}