{"id": 124, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223433.html", "title": "Chapter 124 - 116: No Discord, No Concord_2", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 124 - 116: No Discord, No Concord_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 124: Chapter 116: No Discord, No Concord_2 <br/><br/>Translator: 549690339 <br/><br/>Kevin Clark didn’t bother with him anymore, and turned his head to Daisy Zane, saying, “Stay and play in Imperial Capital for a few more days before going back.” <br/><br/>Daisy Zane thought for a while and said, “That’s fine.” <br/><br/>“In a few days, there will be an auction at the Doomsday Hotel,” Kevin Clark said, “Let’s go check it out together.” <br/><br/>Daisy Zane was reminded of last year when the two didn’t know each other yet, and they both grabbed things at the Doomsday Hotel auction and she had never grabbed anything from him. <br/><br/>She stared at him. <br/><br/>Kevin Clark smiled, holding her hand and said, “This time, whatever you like, I’ll pay for it and I won’t grab it again.” <br/><br/>Daisy Zane also gave a very faint smile. <br/><br/>“We... can be considered having become friends through fighting.” <br/><br/>Daisy Zane looked at him, and after a while, nodded her head. Indeed, they became friends through fighting, six years ago, she had paralyzed the entire computer system of his Easton Group building. <br/><br/>It was at that time that she learned about the existence of a character like Kevin Clark. <br/><br/>Although she hadn’t seen his face at the time, thinking about it now, she had a great admiration for him at the time. <br/><br/>That’s why she quickly retreated. <br/><br/>She was so kind back then. If she had played off him at the time, maybe she would have escaped early, maybe... <br/><br/>Forget it... there are no more maybes. <br/><br/>Daisy Zane’s interview response started a big wave on the internet. <br/><br/>Both Daisy Zane and Catherine’s Facebook fans increased a lot. <br/><br/>Even people who had never heard of Catherine became admirers of her looks. <br/><br/>Some people even became fans of her plain, cold, and somewhat lazy voice. <br/><br/>Even more, a comment suggesting her to become a voice actor got several hundred thousand likes. <br/><br/>A legendary figure. <br/><br/>The old master didn’t have his own social media account, so he used his granddaughter’s Facebook to post the video. <br/><br/>Dressed in Tang Dynasty-style clothing, sitting up straight on a chair, looking at the lens and speaking appropriately: “Over the Chinese New Year, I saw some messages online. After much deliberation, I decided to come out and say a few words.” <br/><br/>The old master reached out and picked up a photo from the table, a freshly printed photo. Holding the photo, he aimed it at the lens and said, “Can you see clearly?” <br/><br/>“Grandpa, lower the photo a bit, a little lower, there, perfect,” a female voice said. <br/><br/>“I’ve met that girl Catherine once, very young and beautiful. This is a photo my granddaughter took secretly of us at the time, with Director Morris present as well. She’s been saving it, and although it’s not good to take sneaky photos, at least it serves as evidence.” <br/><br/>“Yesterday you scolded me all afternoon,” the granddaughter suddenly said, <br/><br/>“You even hit me with your cane.” <br/><br/>“You deserved it,” the old master glared at her before continuing, “I’ve read <br/><br/>Catherine’s script, and not only is it fascinating, but it’s also very meaningful. On this point, I hope our domestic screenwriters can learn from her.” “Catherine is about the same age as my granddaughter. That little girl has given me a new understanding of this generation of young people and represents new strength in our society. As an elder, I feel proud and reassured to see such successors in this industry.” <br/><br/>“I know that with young people like them inheriting the tradition in this industry, I can rest easy even a hundred years later.” <br/><br/>“So, I hope our industry doesn’t discourage young people. I also hope the atmosphere in this industry can be rectified, not too impetuous, and stop resorting to underhanded tactics.” As the old master said this, he tapped the floor with his cane. <br/><br/>“We are public figures, and we must set positive examples to guide our youth.” <br/><br/>“Alright, that’s all I have to say. During the New Year, everyone should spend more time with their families and not go online to make baseless remarks. <br/><br/>Goodbye, everybody.” <br/><br/>The video ended, and the photo the old master had held was posted again separately afterward. <br/><br/>Although there was no date to prove when the photo was taken, no one dared to question it. <br/><br/>Because... at that time, Director Morris still had long shoulder-length hair, and he was wearing a coffee-colored, worn-out cotton-padded jacket with his elbows worn through. <br/><br/>Director Morris had cut his hair short just the year before last, and that iconic tattered cotton-padded jacket was snatched away by a monkey during a shoot last year. <br/><br/>So, George Dunn had posted on Facebook about his tragic experience at that time. <br/><br/>And the comments below the post were all celebrating that Director Morris could finally get a new padded jacket..\t\t\t\t\t\t</div>", "images": {}, "success": true}