{"id": 127, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223439.html", "title": "Chapter 127 - 119: Brother Misses You", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 127 - 119: Brother Misses You</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 127: Chapter 119: Brother misses you <br/><br/>Translator: 549690339 <br/><br/>The auction began, with properties and land being sold at first, followed by various art pieces. <br/><br/>Daisy Zane wasn’t particularly interested and just enjoyed the food and drinks in the partition room. <br/><br/>Kevin Clark flipped through the auction manual: “Anything you like?” <br/><br/>Daisy was about to answer when her cell phone suddenly rang. <br/><br/>She looked at the screen and saw an incoming unknown call: “I’ll step out and take this call.” <br/><br/>“Alright.” Kevin nodded. <br/><br/>Outside the partition room, the Lane Family members were stationed, both men and women. To maintain secrecy, they made sure that no one in the partition rooms could see each other. <br/><br/>At least within this area, everyone was oblivious to who sat beside them. <br/><br/>So, the Lanes stood guard outside each partition room. <br/><br/>“Miss, is there anything I can help you with?” <br/><br/>“Taking a phone call.” <br/><br/>“This way, please.” The waitress led Daisy to a public area. <br/><br/>By the time they arrived at the public area, the phone had already disconnected. <br/><br/>Daisy walked to the window and looked at her cell phone. After waiting for a while, the phone rang again quickly. <br/><br/>She pressed the answer button and held the phone to her ear: “Who is this?” After a two-second silence, the caller suddenly laughed: “Enigma Starry. <br/><br/>Happy New Year.” <br/><br/>Upon hearing the voice, Daisy clenched her phone, and her lips turned white in an instant. <br/><br/>A momentary look of terror flashed in her eyes, but it quickly turned into deep hatred and a killing intention. <br/><br/>If one looked closely, her body was also trembling slightly. <br/><br/>Hearing no response from her, the caller continued: “Enigma, have you missed your brother?” <br/><br/>Daisy felt like everything around her had suddenly darkened and all the light disappeared. <br/><br/>“Brother misses Enigma so much that he can’t sleep at night. Every time I close my eyes, I see Enigma smiling and calling for her brother.” <br/><br/>“Shut up!” Daisy growled softly. <br/><br/>The caller just laughed and continued, “I really wanted to see Enigma last time, but...Enigma was with someone else, which made brother angry. And Enigma still doesn’t realize her mistakes, if she were to meet her brother, violence would be inevitable. Brother would be heartbroken.” <br/><br/>“What do you want?” As Daisy said this, the veins on her neck bulged, and her voice turned hoarse. <br/><br/>“Of course, I miss our Enigma. It took me a lot of effort to find this number.” <br/><br/>“You’re asking for death.” <br/><br/>The caller suddenly laughed and took some time to respond, “Enigma, everything you’ve learned was taught to you by me. No one in this world understands you better than I do. As long as I don’t want you to find me, you will never find me.’ <br/><br/>“Really?” <br/><br/>“Certainly. I raised you; I can see right through you.” The caller said slowly, “You can never beat me. So, Enigma, just come back obediently. Don’t let more people die because of you. What do you say? You want Kevin Clark to be next?” <br/><br/>After Bonnie Maxwell entered the restroom, Natalie took a lipstick out of her handbag, twisted it out while walking towards Daisy Zane. <br/><br/>Daisy Zane’s hands were red from the cold water. She took a few pieces of paper, wiped her hands dry, and was about to leave. <br/><br/>But when she turned around and walked past Natalie, Natalie’s high heels suddenly twisted, and she immediately fell towards Daisy Zane. <br/><br/>Daisy Zane subconsciously tried to support her. <br/><br/>However, Natalie’s movement was swift, smearing all the lipstick onto Daisy Zane’s clothes until it broke and fell to the ground. <br/><br/>“Ouch—I’ <br/><br/>“Are you alright?” Daisy Zane helped her up. <br/><br/>Natalie stood up, “I’m so sorry, I’m so sorry. I’m getting old, and my legs aren’t working well.” <br/><br/>“Did you sprain your foot?” Daisy Zane was unaware that her cold voice had softened a bit. <br/><br/>Natalie moved her foot, “It’s okay, it’s okay. I’m fine. But... your dress.” Daisy Zane looked down. <br/><br/>She was wearing an off-white dress today, and now her waist had several smudges of lipstick on it, very eye-catching. <br/><br/>“It’s fine, don’t worry.” <br/><br/>“How can it be okay?” Natalie seemed to be afraid Daisy would run away, she grabbed her arm at once. Although she talked about the dress, her eyes were fixed on Daisy’s face, “This dress looks expensive, and it’s gotten dirty just like that. Let me compensate you.” <br/><br/>“Madam, no need. I’ll wash it when I go home.” <br/><br/>“How can this fabric be washed off!” Natalie said, “Give me your contact information, and I’ll compensate you.” <br/><br/>“Madam, really, there’s no need.” <br/><br/>“We have to. Definitely have to.” Natalie said, then suddenly patted her own chest, “I have a bad heart. If I don’t compensate you, I’ll keep feeling guilty about this, and I could easily get sick.” <br/><br/>Daisy Zane’s mouth twitched a bit. <br/><br/>“Do you really want to see me at this age hospitalized?” <br/><br/>Daisy Zane looked at the hand holding her arm. <br/><br/>“Give me your mobile number...” Natalie said, taking her cell phone out of her bag, then clasping Daisy’s wrist, “Let me write it down.” <br/><br/>Daisy Zane felt that she couldn’t go back today without giving her mobile number. So, she reported her mobile number. <br/><br/>After Natalie entered the mobile number, she immediately called Daisy and saw her phone ringing. Then she gently let go of her arm and smiled. “That’s my aunt’s mobile number. Wait for Aunt to contact you.” <br/><br/>Daisy Zane nodded with an expression she didn’t know what to make. <br/><br/>As soon as Daisy Zane left, Natalie immediately sent the mobile number to Hugo Clark. <br/><br/>Then she started sending voice messages one by one on her phone. <br/><br/>“Hugo, this mobile number belongs to a beautiful girl. She’s gorgeous and definitely fits your taste.” <br/><br/>“Add her contact information and talk.’ <br/><br/>“I’m telling you, the moment I saw her, I knew she’s destined to be with our family.” <br/><br/>“Add her contact, ask her out to meet. I have a premonition; this could happen.” <br/><br/>“I’m warning you; I’ve set my eyes on this girl. You must meet her for me. If you come up with any excuses not to, I’ll have your father chase and hit you.” <br/><br/>“By the way, I got her dress dirty. You help me compensate her for that. This is something we must do.”\t\t\t\t\t\t</div>", "images": {}, "success": true}