{"id": 122, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223429.html", "title": "Chapter 122 - 115: Not Here To Clarify, But To Confront_3", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 122 - 115: Not Here To Clarify, But To Confront_3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 122: Chapter 115: Not Here to Clarify, But to Confront_3 <br/><br/>Translator: 549690339 <br/><br/>Suddenly a few people gasped after hearing Daisy Zane’s flat, cold voice. <br/><br/>“Since everyone is here, let me say something,” Daisy Zane said. “I am indeed Flynn Ninevara. That’s why I went to the audition selection that day.” <br/><br/>“I know, just saying this can’t prove that I am Flynn Ninevara. But... those who doubt me online are unrelated rumormongers. Why should I prove to you that I am who I am? You’re not even worth my time and effort.” Read latest chapters at novelhall.com Only<br/><br/>Daisy Zane had no extra expression on her face, and her voice was steady throughout. <br/><br/>But that kind of arrogance and disdain reached people’s hearts, acting as a sort of accusation. <br/><br/>Kevin Clark couldn’t help but lower his eyes, his eyes curving into a smile. <br/><br/>“Also, to those who say I should act in other shows, or be the supporting female in other plays. What about it? I don’t want to act in my own script, I want to go out and play, do I have to apply to you?” <br/><br/>“Oh, and those who mock me for not attending college,” Daisy Zane continued, “is there a major conflict between not attending college and learning through reading on my own?” <br/><br/>“Now I want to ask those trolls online, why is your quality so poor despite your high education? Shouldn’t you reflect on whether you are wasting educational resources?” <br/><br/>Everyone was stunned, they thought they came to hear her clarify things, not to listen to her confront people. <br/><br/>“Flynn Ninevara!” <br/><br/>As soon as she said she wanted to leave, someone in the crowd suddenly called out to her. The voice sounded fearful, breaking with tremors. <br/><br/>“Yes?” Daisy Zane looked at her. <br/><br/>“Can you, can you sign an autograph?” The girl looked like a college student, perhaps nervous to see her idol or perhaps intimidated by Daisy Zane’s aloofness, her hand and voice were shaking, “I’ve been a fan of yours since your first script. I... I wanted to be closer to you, so I took the entrance exam for the Imperial Capital Film Academy to study screenwriting, and I’m now in my sophomore year.” <br/><br/>All eyes fell on the two of them, Daisy Zane looked at the girl without moving, but the girl’s face turned red quickly. “No, no autograph, or, or not, but- -” <br/><br/>“Give it to me.” <br/><br/>The girl looked up at her in surprise, then immediately handed her the book and pen: “Thank you.” <br/><br/>“What’s the name?” <br/><br/>“Just write my pen name. Clear Dust. ‘Clear’ as in cold, and ‘Dust’ as in dirt.” <br/><br/>Daisy Zane took the pen and wrote down her name, along with a blessing, and then signed Flynn Ninevara’s name. <br/><br/>Kevin Clark watched her writing from the side, and suddenly raised his eyebrows. <br/><br/>This writing... was different from her usual writing. This writing had a strong and sweeping momentum, full of a majestic and free-spirited atmosphere. <br/><br/>It seemed a bit familiar....\t\t\t\t\t\t</div>", "images": {}, "success": true}