{"id": 121, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223427.html", "title": "Chapter 121 - 115: Not Here To Clarify, But To Confront 2", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 121 - 115: Not Here To Clarify, But To Confront 2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 121: Chapter 115: Not Here to Clarify, But to Confront 2 <br/><br/>Translator: 549690339 <br/><br/>“Where did this come from?” <br/><br/>John Anderson looked up at the person next to him, “It was sent to me anonymously.” <br/><br/>Amelia Miles clenched her fists tightly, trying hard to maintain her composure. <br/><br/>“Amelia, I can understand that you dislike Daisy Zane. But why did you hire paid trolls to smear her?” John Anderson asked in a deep voice, “Those are all grievances from older generations, she too is a victim. She doesn’t want to be labeled as an illegitimate child either.” <br/><br/>“I just wanted to show everyone the truth. How could she possibly be <br/><br/>Catherine?” Amelia Miles stared at the computer and said mechanically. <br/><br/>“Why can’t she be Catherine?” John Anderson asked, “Your manipulation of public opinion is causing her a great deal of trouble.” <br/><br/>Amelia Miles looked at him sharply, her hands clenched so tight her veins were bulging: “You’ve read Catherine’s script too. Daisy Zane grew up in Cold Green Village and has never been to school. Can she write a script like Catherine’s?” John Anderson remained silent, looking at Amelia Miles. <br/><br/>Even though she was trying hard to control herself, he could feel that she was completely different from her usual self. <br/><br/>Normally she was obedient, understanding, kind, and always taking others into consideration. But now, there seemed to be a beast inside her, ready to burst out at any moment. <br/><br/>“It’s just a way for her and Edward Monk to whitewash their reputation.” <br/><br/>“Fine, you can have your doubts. Everyone has the right to be skeptical.” John <br/><br/>Anderson said, “But why lead public opinion?” <br/><br/>“I just want everyone to see her true face.” <br/><br/>Daisy Zane looked at him for a moment, “If you want to stay, just say it.” <br/><br/>Harton Clark laughed, helped her adjust her hair and said softly, “I’ll be your bodyguard.” <br/><br/>“Alright.” Daisy Zane responded indifferently and handed him a mask from her pocket, “Put it on. You’re too conspicuous.” <br/><br/>“Okay.” <br/><br/>Sure enough, when they walked out, a crowd of people and reporters were waiting for them. <br/><br/>Daisy Zane’s eyes were too distinctive, and she was recognized as soon as she appeared. <br/><br/>The crowd instantly became restless, snapping photos with their cellphones and cameras. <br/><br/>Even though the airport security was holding back the crowd, Harton Clark felt uneasy and stayed close by her side without taking a single step away. <br/><br/>“Catherine, Catherine, are you Catherine?” “Daisy Zane, are you and Catherine the same person?” <br/><br/>“Are you really Catherine? Are you really?” <br/><br/>Daisy Zane glanced at the crowd calmly, then took off her mask. <br/><br/>In an instant, the crowd suddenly fell silent, not a single person speaking. <br/><br/>All eyes were fixed on her cold yet breathtaking face. <br/><br/>Daisy Zane looked at the camera pointed at her and said, “The camera’s still rolling, right?” <br/><br/>The cameraman, taken aback, nodded dazedly. <br/><br/>Daisy Zane also nodded, her fingers hooked around her mask, she looked at the camera and said casually, “I’ve heard that there have been some controversies about me online in the past few days. I didn’t respond immediately. That’s because I just left Cold Green Village yesterday and finally had a signal..’\t\t\t\t\t\t</div>", "images": {}, "success": true}