{"id": 131, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223447.html", "title": "Chapter 131 - 123: A Report Every Day", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 131 - 123: A Report Every Day</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 131: Chapter 123: A Report Every Day <br/><br/>Translator: 549690339 <br/><br/>“What’s wrong with Charles?” <br/><br/>Kevin Clark came to take Daisy Zane to the airport, and saw Charles sulking in a corner, his back to them, and ignoring everyone. <br/><br/>“I didn’t buy him a plane ticket, so he’s angry.” Daisy Zane glanced at him and said. <br/><br/>“You said you’d take me when you leave, you don’t keep your word.” Charles didn’t look at them, facing the wall and grumbling angrily. New novel chapters are published on<br/><br/>“I didn’t say which trip.” <br/><br/>“You said you’d take me back after the Chinese New Year.” <br/><br/>“I didn’t say it was this year’s Chinese New Year.” Daisy Zane blatantly bullied the child. <br/><br/>“How can you bully a child like that?” Kevin Clark whispered, lifting his hand to tuck a strand of her hair behind her ear. <br/><br/>“Might as well bully him while he’s still a child.” <br/><br/>Charles heard their murmurs and turned around, sitting on the carpet with his arms folded. His chubby cheeks puffed up in anger, and his big eyes blinked as if tears were about to fall. <br/><br/>“Hold it back, or I’ll make you.” <br/><br/>Charles pursed his lips, forcibly holding back his tears. <br/><br/>Kevin Clark chuckled as he watched from the sidelines. He walked over and picked Charles up, “I’ll come to see you whenever I have some time. I’ll teach you to play the piano.” <br/><br/>Charles didn’t say anything, just looking at Daisy Zane. <br/><br/>After locking eyes with him for a moment, Daisy Zane took him from Kevin Clark’s embrace and messed up his curly hair: “I’m going back to film, and I don’t have time to take care of you. It’s not very safe for you to be with me either.” <br/><br/>“But you promised me.” <br/><br/>“I’m sorry.” Daisy Zane said patiently, “I’ll try to come back whenever I have time.” <br/><br/>Charles hesitated for a while, “Really?” <br/><br/>“Really.” Daisy Zane said, “I won’t abandon you.” “Then you have to answer my phone calls,” Charles said. <br/><br/>“Alright.” <br/><br/>On the way to the airport, Juan Wright drove while Kevin Clark and Daisy Zane sat in the back. <br/><br/>“Why are you suddenly leaving?” <br/><br/>It was too sudden – even Kevin Clark had to squeeze out some time to send her off today. <br/><br/>“Something came up,” Daisy Zane said, “You don’t need someone to accompany me, you’re busy.” <br/><br/>“Juan will go with you.” <br/><br/>On the fourth day when he appeared at the entrance again, Daisy couldn’t stand it anymore. <br/><br/>But before she could take action, Juan Wright took the first step. <br/><br/>Juan Wright noticed Liam Davis brightening his eyes when Daisy came out and was about to approach her. Juan stepped forward and blocked him with his hand. <br/><br/>“Dear fan,” said Juan, “four days in a row now, you’ve been disrupting our artist’s life. If you get any closer, I’ll call the police.” <br/><br/>Liam Davis frowned and looked at Juan Wright, “Who are you?” <br/><br/>“I am Lady Zane’s bodyguard.” <br/><br/>“I know Daisy.” Liam Davis said. <br/><br/>Juan Wright smiled faintly, “Whether you know her or not is your business, protecting her is my duty. And knowing... can it prove that you won’t cause any trouble or danger to our artist?” <br/><br/>“Get out of the way!” Liam Davis shouted. <br/><br/>“Sir, please behave.” <br/><br/>Liam Davis pushed his hand and tried to walk forward, but Juan Wright immediately grabbed his wrist and exerted force. <br/><br/>In an instant, Liam Davis’s whole arm went numb: “You motherfucker! You... <br/><br/>“Sir, don’t make a scene.” Juan Wright smiled, but his grip on Liam Davis’s arm tightened. <br/><br/>During their conversation, Daisy had already returned to her car. <br/><br/>Liam Davis knew he couldn’t beat him, so he gave up, shook off Juan Wright’s arm, and left. <br/><br/>Juan Wright watched his retreating figure, hooked his lip, took out his cell phone, and started sending a message to Kevin Clark to take credit: “Third Master, that man is back, I chased him away. He didn’t see Lady Zane.” <br/><br/>About fifty meters away from them, in a parking space, Benjamin Hobson, wearing sunglasses, sat on the back seat of the car with the window down, watching it all. <br/><br/>“Who’s that guy? <br/><br/>The driver in front replied, “He’s Daisy’s driver.” <br/><br/>“Driver? Can a driver grow up like that? He must be her little lover.” Benjamin Hobson laughed, “As expected, very promiscuous.” <br/><br/>“This man picks up and drops off Daisy every day.” The driver said, “I’m afraid of being discovered, so I didn’t follow their car. I just watched them from this parking space.” <br/><br/>“Well, you’ve done a good job.” Benjamin Hobson said, “Keep an eye on them here. When that driver stops picking her up, let me know.” <br/><br/>“Yes, young master.” <br/><br/>“This kind of woman can’t live without a man by her side. But we can’t be disrespectful either. Wait until she’s done playing with this guy before we make a move.” Benjamin Hobson said. <br/><br/>“Yes, sir.” <br/><br/>Benjamin Hobson closed the car window and chuckled softly. From the Imperial Capital to here, he had to get this girl. It was undeniable that, as daughters of the same father, Daisy was much more beautiful than his cousin. <br/><br/>Just looking at her was enough to make one’s imagination run wild....\t\t\t\t\t\t</div>", "images": {}, "success": true}