{"id": 137, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223459.html", "title": "Chapter 137 - 129", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 137 - 129</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 137: Chapter 129 <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane only took three days off, so she didn’t involve herself with everything happening on the D Continent, and hurriedly flew back to Truro City. <br/><br/>Kevin Clark left Michael Jackson on the D Continent to assist the Darknight Alliance with their matters. <br/><br/>It was practically as though he asked him to take orders from the Darknight Alliance. <br/><br/>After returning to Truro City, Daisy Zane directly went to the drama set. <br/><br/>There wasn’t much for Kevin Clark to take care of recently, so he naturally followed along as well. <br/><br/>While Daisy Zane was filming, Kevin Clark would sit in his Nanny Car, remotely dealing with some matters using his computer. <br/><br/>During long waits or meal times, Daisy Zane would go back to the Nanny Car to keep him company for a while. <br/><br/>“Sister Lucia, you can sleep for a while after lunch.” Anisa Cooper suggested while opening a food box, “Your afternoon scene starts around three o’clock.” “Mhm.” Daisy Zane was still wearing her costume, a very simple white inner garment. Her hair was tied high up in a ponytail, and her makeup was minimal. <br/><br/>She gave off a female general’s aura. <br/><br/>The weather is still very cold, Daisy Zane’s hands were numb from the cold and she could only watch Anisa Cooper carefully placing each dish in the food box, unable to eat. <br/><br/>Kevin Clark also extended his hands into the hand warmer to warm her hands. <br/><br/>Anisa Cooper glanced at them, laughed softly and then sat aside, reading something on her phone. <br/><br/>She lightly browsed through her messages, suddenly expressing her confusion. <br/><br/>Daisy Zane asked her, “What’s the matter?” <br/><br/>“Sister Emily didn’t reply to my message.” Anisa Cooper refreshed her messages again but still nothing, “It’s been almost five hours without a reply. Sister Emily has been acting a bit strange recently.” <br/><br/>Even if Emily Hill wasn’t on set, she would call Daisy Zane every two days to check in. It seems like she has been making fewer calls recently. <br/><br/>“Just call her and ask.” <br/><br/>“Okay.” As Anisa Cooper agreed, her phone screen suddenly changed. <br/><br/>A phone call came in but the phone only lightly vibrates once before Anisa Cooper swiftly pressed the volume button to mute the incoming call. She quickly flipped the phone over, “Sister Lucia, I need to make a call.” <br/><br/>“Okay.” <br/><br/>Once the car’s door closed, Kevin Clark shifted his gaze back to Daisy Zane, <br/><br/>“She...seems to have some issues.” <br/><br/>Daisy Zane raised an eyebrow, “What kind of issues?” <br/><br/>“She’s hiding something.” said Kevin Clark, “This matter might be related to you. Recently, she’s been somewhat distracted. When she is distracted, she would subconsciously look at you, and her eyes seem off.” <br/><br/>Daisy Zane gave a light smile, “So do you think keeping her close would bring danger?” <br/><br/>Kevin Clark picked up the chopsticks and helped Daisy Zane with her food: “I think your memory is failing you. I only ever held Lila Campbell, I’ve barely even seen your younger sister.” <br/><br/>“You...” William Lane said, “If I had known you would be like this, I wouldn’t have let you hold Lila either.” <br/><br/>Kevin Clark no longer argued with him, saying, “You should let Enamel Canon know.” <br/><br/>“All right, I can only turn to him if you’re not around.” William Lane said, “Can’t count on you when needed.” <br/><br/>Kevin Clark immediately hung up his call. <br/><br/>Daisy Zane picked up a piece of sweet and sour pork rib and began to eat it slowly, “William Lane?” <br/><br/>Kevin Clark’s expression paused for a moment: “Yes.” <br/><br/>“The eldest daughter of the Lane Family is called Charlotte Lane?” Daisy Zane had heard earlier. <br/><br/>Kevin said he had held Lila but had never held the youngest one. <br/><br/>“Yes.” <br/><br/>“And the youngest one?” <br/><br/>“Evelyn Lane.” <br/><br/>After having a few mouthfuls of food, Daisy Zane asked: “Is William Lane often not in Imperial Capital?” <br/><br/>Kevin Clark glanced at her: “He is usually on the F Continent. He comes back occasionally.” <br/><br/>Daisy Zane nodded but said no more. <br/><br/>The Lane Family is really interesting. <br/><br/>Such a large family business, Old Master Lane is not in the Imperial Capital. The eldest young master of the Lane Family is also not in the Imperial Capital. <br/><br/>“Daisy.” Kevin Clark suddenly called her name. <br/><br/>Daisy Zane looked up at him. <br/><br/>Kevin Clark, holding her hand intently, said: “Daisy, my family really is very wealthy.” <br/><br/>Daisy Zane blinked. What’s going on, showing off his wealth? Does he want to be beaten up? <br/><br/>Kevin Clark continued on: “And at the Clark’s... There won’t be any trouble from younger sisters-in-law.” <br/><br/>Daisy Zane: . <br/><br/>Kevin Clark then contemplated a bit and said: “If you like the Doomsday Hotel, we can build one. It will be no different from theirs, and we can even build it to your liking.” <br/><br/>Daisy Zane: “......I am just simply curious, just asking.” <br/><br/>“Oh. Well...l’m also just simply stating.” Kevin Clark looked at her while a smile on his face and said, “Aren’t you curious about our family? Feel free to ask.” <br/><br/>Daisy Zane: .\t\t\t\t\t\t</div>", "images": {}, "success": true}