{"id": 135, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223455.html", "title": "Chapter 135 - 127: Justifiable Words And Actions", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 135 - 127: Justifiable Words And Actions</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 135: Chapter 127: Justifiable Words and Actions <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane took a shower and called Robinson Scott afterward. <br/><br/>As she had expected, Robinson was calling to gossip after talking to James Collins. <br/><br/>“Daisy, what’s going on! James said that the b*stard who messed with the jadeite is... is Kevin Clark!” <br/><br/>“Mhm.” Daisy Zane was in the bathroom, wearing a half-length, belly-baring vest. Looking at the bruised swellings on her ribs in the mirror, she said softly, “That fairy.” <br/><br/>“Olivia!” Robinson Scott exclaimed excitedly, “Doesn’t that mean that the entire <br/><br/>D Continent’s mines now belong to you? Darknight Clan has a gold mine, and Kevin Clark has jadeite.” <br/><br/>“Darknight Clan is yours, and the jadeite is Kevin Clark’s, so how does it belong to me?” <br/><br/>“Darknight is your natal home, and Kevin Clark is your husband’s family,” Robinson Scott said. “Of course, it belongs to you.” <br/><br/>Daisy Zane: . <br/><br/>“Really, I’m a good sport and I don’t hold grudges. I can be peaceful with him in the future for your sake.” <br/><br/>“Who told me that Kevin Clark is extremely dangerous and should not be approached?” <br/><br/>“How can it be the same?” Robinson Scott replied, “Isn’t he the owner of a mine now?” <br/><br/>“So, for the mine’s sake, you’re telling me to get married?” Daisy Zane asked, <br/><br/>“Where’s your conscience?” <br/><br/>“Conscience? I fed it to Samuel Gray.” <br/><br/>“...Wait until he bites you. I’m hanging up. I’m going to sleep now.” <br/><br/>After hanging up, Daisy Zane took another look at her left arm in the mirror, saw it was slightly red and seemed as if something was about to surface. <br/><br/>She grabbed a nearby towel, turned the water to the cold side, wetted the <br/><br/>towel, and applied it to her left arm. <br/><br/>After doing this several times, the thing on her arm gradually disappeared. <br/><br/>Afterward, she also applied the cold towel to the bruises on her ribs. <br/><br/>While applying the towel, she thought about when she hit Kevin Clark. <br/><br/>She was only focused on venting her frustration on Damian Brown. She should have hit him more, to get her share of revenge too. <br/><br/>After applying the towel to her ribs, she washed the towel, then went straight out. <br/><br/>Just after leaving the restroom and walking two steps, she saw Kevin Clark entering the room through the door. <br/><br/>“The person behind 319?” Kevin Clark guessed. <br/><br/>Daisy Zane’s eyelashes fluttered slightly, “Yes.” <br/><br/>Kevin Clark looked at her and said after a two-second silence, “Lucia. First, I’m not afraid of him. I have the strength and power not to be afraid of him. Secondly, he can’t defeat me. I mean both in terms of physical strength and intelligence, including his conspiracies and tricks. Lastly, I wish he would gift himself to me. I truly wish. It would save me a lot of trouble.” <br/><br/>Daisy Zane looked up at him, a hint of admiration rising in her heart. <br/><br/>No one had such confidence when facing that person. This confidence seemed to come from an innate sense of suppression. <br/><br/>Even Daisy Zane herself could only think of the best outcome as mutual destruction, taking that person to hell with her. <br/><br/>But Kevin Clark had it, and she believed him wholeheartedly. <br/><br/>At the same time, she felt a strange sense of familiarity. <br/><br/>This familiarity made her want to get closer. <br/><br/>“So, Lucia, to me, this is nothing at all.” Since she had mentioned it, Kevin Clark clearly understood what she was thinking. <br/><br/>She feared getting him involved. <br/><br/>Daisy Zane hooked her lip, looking down at the medicine box he was still holding in his hand, “I don’t want to apply the medicine.” <br/><br/>“Put some on, it’ll heal faster.” Kevin Clark’s voice was like coaxing a child, “Be good, it will hurt less.” <br/><br/>Daisy Zane looked up at him, her eyes shining, and somewhat seductive, “Will Third Master help me apply it?” <br/><br/>Kevin Clark’s pupils visibly constricted, and his face froze for a moment. <br/><br/>Fortunately, his mind was still clear, not blinded by her beauty. <br/><br/>His eyebrows and eyes were filled with tenderness, half-joking, and half-doting, “It’s...not very convenient for me, right?” <br/><br/>“That’s true...” Daisy Zane nodded, “Being alone together, the name isn’t justified.” <br/><br/>Kevin Clark gently raised his eyebrows, just about to speak when the collar of his shirt was suddenly grabbed. He was pulled by the collar and bent over. <br/><br/>Before he could react, Daisy Zane suddenly moved closer the next second and a soft touch pressed against his lips. <br/><br/>At that moment, Kevin Clark’s head felt as if something had exploded. <br/><br/>Exploding into a riot of colors before his eyes and ringing in his ears. <br/><br/>Daisy Zane’s hand, gripping his shirt collar, was clenched so tightly that her knuckles turned white. <br/><br/>After pressing her lips against his for a while, she released his collar and backed away half a step. <br/><br/>Kevin Clark looked at her in a daze, “Luc, Lucia...” <br/><br/>Daisy Zane, seemingly as if nothing had just happened, had a calm expression, of course, ignoring her ears that were red all the way to the roots, “I’ve given you the identity of a boyfriend...” <br/><br/>As she spoke, she took another step forward, getting closer to Kevin Clark, tilting her head up and leaning in, “Now it’s justified..”\t\t\t\t\t\t</div>", "images": {}, "success": true}