{"id": 134, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223453.html", "title": "Chapter 134 - 126: What The Heck Is Going On?", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 134 - 126: What The Heck Is Going On?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 134: Chapter 126: What the Heck is Going On? <br/><br/>Translator: 549690339 <br/><br/>When the lamp light came on again, Daisy Zane had already removed her hat, and was taking off her mask. <br/><br/>Everyone was momentarily blinded by the light. <br/><br/>But Kevin Clark blinked and forced his eyes open, looking at Daisy Zane to see where she was hurt: “Lucia, where are you injured?” <br/><br/>Daisy Zane held the mask at her fingertips, adjusted to the light, and slowly raised her eyes to look at him. <br/><br/>That icy and extremely hostile gaze made Kevin Clark’s back break out in a cold sweat in an instant: “Lucia, Daisy.” <br/><br/>Daisy Zane looked at him, the anger in her heart surging up bit by bit. <br/><br/>She was worried about him having to pay that 60% fee, sending people here to check, and finally causing such a mess. Yet, it turned out that this money would eventually end up in his own pocket. <br/><br/>She had been wondering, always being fine, why the jadeite suddenly went up in price. It turned out that he was afraid of losing himself and was deliberately sabotaging Felix Baker. <br/><br/>A hint of fire seemed to burn in Daisy Zane’s eyes. <br/><br/>And... she was worried that someone would do something to him. With this power and skill, the Clark Family protected him in the Imperial Capital, and he guarded Ryan Easton in F Continent. And here, he could monopolize the entire D Continent’s jadeite, trap the Darknight Clan, and capture Damian Brown. <br/><br/>Who could do anything to him? <br/><br/>Daisy Zane’s temples throbbed in pain. <br/><br/>But Kevin Clark didn’t dare to breathe heavily as he looked at Daisy Zane. <br/><br/>Michael Jackson wasn’t much better. After adjusting to the light, he opened his eyes to see Daisy Zane. <br/><br/>Then he hesitated for two seconds, thinking he must be hallucinating, so he closed his eyes and reopened them again. <br/><br/>As a result, he still saw Daisy Zane. <br/><br/>Then he suddenly felt weak in his legs and leaned against the wall nearby. <br/><br/>Leaning against the wall, he took a few breaths and felt as if someone was watching him. So he looked up. <br/><br/>He saw James Collins in a baseball cap, his peach blossom eyes smiling, “Brother Michael, long time no see.” <br/><br/>Damian Brown glanced at him. <br/><br/>Michael Jackson choked on his own saliva, coughing for a while without saying a word. <br/><br/>It was apparent that the shock had not been light <br/><br/>Perhaps he felt that he had fallen into some terrible nightmare. <br/><br/>Truly, he could accept any identity of Daisy Zane. However, her connection with the Darknight Alliance was really hard for him to accept. <br/><br/>At least not for a while. <br/><br/>“Pretending.” Daisy said coldly, “It’s been a while, the pain must have subsided by now.” <br/><br/>It was true that Daisy had hit him hard, but it didn’t really hurt him; it just caused some momentary pain. <br/><br/>Kevin chuckled softly, “Why don’t you rest here tonight?” <br/><br/>“What’s the matter? Want to confine me? So you can make me submit to you.” <br/><br/>“I wouldn’t dare.” Kevin said gently, “I’ll only obey Lucia. Whatever Lucia tells me to do, I’ll do.” <br/><br/>Daisy snorted with laughter, “Weren’t you just hitting me?” <br/><br/>Kevin flinched inwardly, straightened up, and looked at her, “Lucia, I...” <br/><br/>“I’m tired.” Daisy cut him off. <br/><br/>Kevin was choked, “I’ll go arrange a room for you right now.” <br/><br/>Both James Collins and Damian Brown had settled down, and Daisy informed Robinson Scott to take their people back. <br/><br/>Kevin gave up his bedchamber for Daisy. <br/><br/>While she was taking a bath, Kevin went to find some medicine. <br/><br/>Michael Jackson followed Kevin with a somewhat stiff expression, “Third <br/><br/>Master, is... Lady Zane... really Nameless?” <br/><br/>Kevin glanced at the medicine in his hand, then looked at Michael, “Who else could be that skilled?” <br/><br/>Michael fell silent, indeed she was very skilled. And the ability to sneak in here undetected, it could be no one else. <br/><br/>Kevin’s strength was extraordinary and indescribable, and the fact that Daisy could last nearly ten minutes against him with her bare hands alone was also beyond ordinary. <br/><br/>If it weren’t for Kevin’s presence at the manor, the situation in D Continent might have changed drastically due to her alone tonight. <br/><br/>However, when a strong person meets an even stronger one, it’s simply a matter of bad luck. <br/><br/>But... Michael looked at Kevin, it seemed that this stronger person was afraid of his wife. It appeared that their seemingly sure-win game was actually a total loss. <br/><br/>“So the person who broke Thomas Firway’s ribs at Birch Manor... was that Lady Zane?” Michael suddenly remembered. <br/><br/>Kevin’s hand, holding the medicine, paused. Ever since he found out that Nameless was Daisy, he had been preoccupied with fear all night. The joy of seeing her return after a long absence was overshadowed by terror. <br/><br/>He hadn’t thought much about anything else. <br/><br/>No wonder he felt something familiar about her handwriting when she signed her autograph at the airport entrance that day. Wasn’t it the same handwriting found on the goods at Birch Manor? <br/><br/>But something didn’t seem quite right... <br/><br/>Kevin was lost in thought, and so was Michael. He was thinking about Thomas Firway. <br/><br/>He wondered if Thomas would burst into tears if he knew that the person he had been complaining about and despising was none other than Nameless, the one who had beaten him to the point where he couldn’t even get out of bed..\t\t\t\t\t\t</div>", "images": {}, "success": true}