{"id": 130, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223445.html", "title": "Chapter 130 - 122: Falling In Love With Him", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 130 - 122: Falling In Love With Him</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 130: Chapter 122: Falling in Love with Him <br/><br/>Translator: 549690339 <br/><br/>Wilton Edwards sat at a distance from her and also sat down. <br/><br/>“Lady, if you have any concerns, feel free to talk to me.” <br/><br/>Daisy Zane took another sip of wine and then lowered her head without saying a word. <br/><br/>Wilton Edwards sat beside her, not disturbing her. <br/><br/>After a while, Daisy Zane said, “I kind of miss Jack Amos.” <br/><br/>Wilton Edwards was stunned for a moment, then raised his hand to wipe his eyes and swallowed before saying, “Lady... it has nothing to do with you.” <br/><br/>Daisy Zane shook her head, “I just suddenly miss him.” <br/><br/>“Lady... you’ve put too much pressure on yourself.” Wilton Edwards said, “You used to be so happy.” Read latest chapters at novelhall.com Only<br/><br/>Daisy Zane smiled, propped her head on her bent knees, and was quiet for a while before asking, “Wilton Edwards, what did you want to talk to me about this afternoon?” <br/><br/>Wilton Edwards thought for a moment and said, “I wanted to ask whether to still bring Young Master with us to Truro City.” <br/><br/>“I don’t know.” Daisy Zane said, “I originally intended to bring him.” Wilton Edwards listened quietly. <br/><br/>“I have to shoot a film, and he can easily be photographed by the media in Truro City. But... I want him to have more contact with Kevin Clark.” Daisy Zane finished the last sip of wine in her glass, “If something happens to me someday, the Clark family is powerful, and Kevin Clark is very loyal. Perhaps remembering our relationship, he may protect you all.” <br/><br/>“Lady...” <br/><br/>“In the domestic realm, no one is more formidable than the Clark and Lane families. So when I found out that Kevin Clark seemed to have feelings for me, I decided to take advantage of his feelings and borrow his power. With his help, many things would be more convenient to execute.” <br/><br/>Daisy Zane put down her wine glass, and her right thumb slowly pressed on her index and middle fingers, “Kevin Clark has a bad reputation. I think his affections won’t last long, so I allowed him to approach me. I thought to exploit his feelings while he still likes me as much as possible.” <br/><br/>“But Lady, you gradually realize that Kevin Clark... is serious. He is different from the rumors, he is a gentleman, polite, knows his boundaries, and respects the lady.” Wilton Edwards glanced at her fingers and said softly, “When he thought Young Master was your biological child, he didn’t leave. And for you, a young master who has been pampered since childhood went to Cold Green Village.” <br/><br/>Wilton Edwards knew very well what Cold Green Village meant to her. The moment Kevin Clark wanted to go, he knew that this man would enter her heart. <br/><br/>Daisy Zane’s eyelashes trembled slightly. <br/><br/>“Most importantly, he is good looking, and he makes the lady feel comfortable in every way.” Wilton Edwards said, “Otherwise, with your personality, even with a purpose in mind, you wouldn’t have been able to get along with him for long.” <br/><br/>Daisy Zane chuckled softly. <br/><br/>Wilton Edwards also laughed, then became silent for two seconds before saying, “And now, not only has the lady discovered that he is serious, but she has also discovered that she has feelings for him.” <br/><br/>Daisy Zane’s hand, which was pinching her finger, paused, and she remained silent. <br/><br/>“Is the lady afraid that the man will target Third Master Clark?” She thought of Jack Amos, and Wilton Edwards could tell what she was worried about by their conversation. <br/><br/>Daisy Zane looked at him. <br/><br/>Wilton Edwards smiled and said, “Lady, I have watched you grow up...” <br/><br/>Having said that, Wilton Edwards suddenly thought of something and wiped his eyes again. He calmed his emotions and said, “Third Master is not ordinary; there is no need to worry.” <br/><br/>“But that man is crazy.” Daisy Zane had been calm all along, with no emotional fluctuations. Her voice, besides being hoarse, did not reveal any abnormalities, “He is capable of anything.” <br/><br/>“What’s up? <br/><br/>“Felix Baker went to D Continent to buy jadeite.” Daisy Zane said, “The price of jadeite has skyrocketed. He paid 40% of the price, which is about the same as what he paid in full before. You still have to pay 60%.” <br/><br/>Kevin chuckled, “Afraid I’ll spend too much money?” <br/><br/>Daisy didn’t answer him, instead saying directly, “The price can’t go down. Felix will definitely buy it. You should weigh your options. It might cost more to breach the contract than to buy the jadeite.” <br/><br/>“A breach of contract...wouldn’t it be bad for my reputation?” Kevin laughed. <br/><br/>“Even Third Master is starting to care about his reputation.” Daisy laughed as well. <br/><br/>“Yeah.” Kevin’s voice softened, “Otherwise, Lucia would misunderstand me.’ <br/><br/>“Can I possibly misunderstand your reputation any deeper?” After saying this, <br/><br/>Daisy continued, “Endorsing Spotlight is not important.” <br/><br/>Kevin chuckled softly, “I’ll keep that in mind.” <br/><br/>“Okay.” <br/><br/>After hanging up, Daisy Zane lay in bed for a while, before getting up. <br/><br/>As she washed and rinsed, she looked at the messages on her phone. <br/><br/>In the morning, Hill Dawson had shared a piece of Truro City News. <br/><br/>The headline read: [Miles Group plans to recognize their illegitimate daughter.] <br/><br/>Daisy clicked on it to read further. <br/><br/>The article discussed how the media had gotten wind of the news and had interviewed Johanes Miles outside the Miles Group building. Johanes didn’t deny the news about him recognizing his illegitimate daughter. <br/><br/>He only said that he would definitely inform everyone when there was news. <br/><br/>Daisy didn’t continue reading. Instead, she directly called Hill Dawson. <br/><br/>After the call went to voicemail, she didn’t call back and thought for a while. It wasn’t until she finished washing up that Hill Dawson returned her call. <br/><br/>“Sister Emily. Just ignore the news online.” <br/><br/>“Alright.” Hill Dawson replied, “When are you coming back?” <br/><br/>“In a day or two.” Listening to her hoarse voice, Daisy asked, “Do you have a cold?” <br/><br/>“I’m fine.” Hill Dawson replied, “The room is a bit dry, and my throat is uncomfortable. I just need to drink some water, and I’ll be fine.” <br/><br/>Just as Hill Dawson finished saying this, there was a sound of glass breaking on the other end of the line. <br/><br/>“What happened?” <br/><br/>“Nothing, the maid dropped a glass. I’ll go take a look. Let’s talk later.” Hill Dawson quickly hung up the phone. <br/><br/>Daisy flipped through the messages on her phone and saw a file sent by her assistant. <br/><br/>After looking at the file for a while, she decided to go to Truro University’s laboratory. <br/><br/>So, she booked a flight ticket..\t\t\t\t\t\t</div>", "images": {}, "success": true}