{"id": 133, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223451.html", "title": "Chapter 133 - 125: Third Master Is In Danger", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 133 - 125: Third Master Is In Danger</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 133: Chapter 125: Third Master is in Danger <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane went to sleep once she arrived at the Darknight Alliance. <br/><br/>She slept until it was dark. <br/><br/>There was a one-hour time difference between D Continent and the domestic area. At 11 0’clock in the night, Daisy Zane took James Collins and prepared to leave. Updated from novelbIn.(c)om<br/><br/>“Brother Nine, are you really not taking me with you?” Robinson Scott asked. <br/><br/>“The Darknight Alliance is yours; you can bring them along. You can take them to provide support outside.” Daisy Zane casually said while putting on her black finger gloves, “James Collins and I will go in first to check the situation. If we need, we will call you.” <br/><br/>Robinson Scott smiled: “We’ll play it by ear.” <br/><br/>“Mmm.” Daisy Zane checked her gun, then tucked it behind her back, looking at Robinson Scott, her eyes filled with mischief, “Since we have to break the balance, it can only be us who dominate them.” <br/><br/>“Of course,” Robinson Scott said. <br/><br/>“Let’s go,” Daisy Zane flicked her earpiece, “wait for the message.” <br/><br/>“Mmm, safety first.’ <br/><br/>At 12:30 PM, Kevin Clark was listening to the opera from the phonograph and drinking tea. <br/><br/>“Third Master, are you not going to sleep yet?” Michael Jackson asked. <br/><br/>Kevin Clark glanced at the time again and said, “It’s almost been three days. I feel someone will come tonight.” <br/><br/>Michael Jackson immediately understood: “Nameless?” <br/><br/>Kevin Clark raised an eyebrow: “Emma Clark has come twice with her people but didn’t manage to rescue anyone. It’s time for Nameless to show up.” <br/><br/>“Third Master has only been defending and not attacking these days, waiting for him,” Michael Jackson said. <br/><br/>“Mmm.” Kevin Clark’s fingertips tapped on the table, “Darknight Alliance must be destroyed, but we also need to recruit talents.” <br/><br/>“Can he sneak in?” <br/><br/>“If he doesn’t even have the ability to sneak in, why would I want him? To waste food?” <br/><br/>Michael Jackson stood by and stopped talking, knowing that his master had calculated everything and wanted to catch the fish in the vat. <br/><br/>As long as the person was captured, his master would naturally have various methods to tame and use them. <br/><br/>As Michael Jackson thought about this, he heard the opera on the phonograph singing “The Beauty Case.” <br/><br/>It was singing: “...At the age of thirty-two, Qin Xianglian sued the current groom, deceiving the king, hiding from the emperor, regretting the marriage and inviting a man to her bed, killing her wife and losing her conscience...” <br/><br/>He noticed that Kevin Clark suddenly turned his head to look at the phonograph, paused for two seconds, and then yanked out the phonograph’s power cord. <br/><br/>The person was forced to step back a couple of steps. <br/><br/>Then the people behind him immediately stepped forward and exchanged blows with Daisy Zane. <br/><br/>However, after just two moves, Daisy Zane could sense that this person was strong. So, she became even more serious. <br/><br/>Meanwhile, James and Damian also started fighting with others. <br/><br/>In the darkness, Daisy Zane couldn’t tell who was winning and had no time to listen. However, James was very strong, which eased some of her concerns. <br/><br/>As long as she kept this person occupied, the other two could escape without any problem. <br/><br/>It was just a matter of time. <br/><br/>Daisy executed a spinning kick, but the opponent raised their hand to block. Turning their hand to grab her leg, Daisy quickly dodged the move. <br/><br/>However, the gun at her waist was taken away. <br/><br/>She touched her waist, then clenched her fists, fighting even fiercer. Almost every blow was aimed at taking the opponent’s life. <br/><br/>But the opponent was too powerful. Within ten minutes, Daisy lost the upper hand. <br/><br/>Moreover, she took two hits to her ribs. The opponent didn’t hold back, and although she buffered the power as much as possible, the strikes weren’t light. <br/><br/>She threw another punch at her opponent, but he grabbed her arm in response, twisting it behind her back and bending her waist. <br/><br/>Daisy bent her waist and reached for the hand on her shoulder with her other hand. However, the opponent was too strong, so she couldn’t budge at all. <br/><br/>After struggling for a bit, she still couldn’t break free. <br/><br/>“Nameless. Admit defeat.” This voice should have been familiar, but this tone was strange. It was contemptuous, arrogant, and filled with the disdain of someone in power. <br/><br/>Daisy didn’t pay much attention, so she didn’t recognize the voice. Without thinking, she cursed back, “Fuck off!” <br/><br/>Suddenly, the person behind her fell silent for two seconds. Then, in a voice filled with disbelief, with a hint of probing and trembling, he said, “Daisy?” <br/><br/>Daisy was stunned for a moment, her body visibly stiffened. After two seconds, she exclaimed, “Kevin Clark?!” <br/><br/>Kevin Clark hesitated for a moment before immediately releasing her. He helped her up: “Lucia, Daisy, you...how...” <br/><br/>Daisy didn’t say a word, but it could be felt through the darkness that she was not in a good state right now. <br/><br/>“Michael Jackson, call them off!” Kevin Clark yelled, “Restore the power.” <br/><br/>James heard the name “Michael Jackson” first before recognizing Kevin Clark’s voice. However, he didn’t stop fighting. Instead, he took advantage of the situation and kicked the two men beside him, causing them to fall. <br/><br/>Michael Jackson, clearly unaware of what had happened, could only follow orders and stop the fight. Then, he ordered someone to restore the power upstairs. <br/><br/>“Daisy, I’m sorry. I... where are your injuries?” Kevin Clark’s hand had never been this cold before. Holding Daisy’s fingertips, his hands trembled slightly. <br/><br/>His head had never been so numb and his tongue was knotted....\t\t\t\t\t\t</div>", "images": {}, "success": true}