{"id": 138, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223461.html", "title": "Chapter 138 - 130: So Miserable", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 138 - 130: So Miserable</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 138: Chapter 130: So Miserable <br/><br/>Translator: 549690339 <br/><br/>The wind in Truro City was damp and cold. <br/><br/>Anisa Cooper found a secluded place to take the phone call, her nails scratching at the bark of a nearby tree. <br/><br/>“I already said I won’t marry him. Since they’re offering so much money, why don’t you marry him instead?” Anisa cried with red-rimmed eyes. <br/><br/>Immediately, curses came from the other side of the phone: “You disrespectful girl! How dare you speak to me like that? Do you even remember that I’m your mother? Who raised you to this age?” <br/><br/>“Do you even remember that I’m your daughter? I’m a person, not an object to be traded for your son’s house, car, and wife,” Anisa’s nail dug into the tree bark. <br/><br/>“So you won’t marry the rich family, but you insist on marrying that cripple? Are you out of your mind?” Anisa’s mother snapped. <br/><br/>“He’s not a cripple!” Anisa growled. <br/><br/>“He doesn’t even want you, yet you’re still trying to stick to him like glue. How pathetic!” Anisa’s mother continued, “Now you get back here and marry the man I chose for you. You won’t even need to work anymore, and you’ll be free from serving that celebrity. This is such a good life – where else could you find it! I’m doing all this for your own good.” <br/><br/>Anisa trembled all over, tears pooling in her eyes. She swallowed hard, her voice hoarse: “When have you ever done anything for my own good? The two of you only care about your son.” <br/><br/>“We only care about our son? Aren’t you the one we raised? Didn’t I give birth to you? If I hadn’t, where would you be?” Anisa’s mother retorted, “You’ll get married eventually – what’s the difference between one man and another? Your brother’s child will carry our family name, while yours won’t. How can you even compare yourself to him?” <br/><br/>Tears streamed down Anisa’s face, falling silently and endlessly. <br/><br/>“Have you ever thought about what kind of life your daughter would have after marrying that man who’s over forty and has already been divorced four times?” Anisa choked. <br/><br/>“That’s just because he had no fate with his previous partners.” Anisa’s mother argued, “So what? Even if you get divorced, he can’t take back the money he gave us. Besides, if you end up divorced as well, you’ll be free too.” <br/><br/>Anisa silently raised her hand to cover her eyes. <br/><br/>“I’ll have you know that I’ve already taken the money,” her mother continued, “and I already gave part of it as a down payment for your brother’s house. If you don’t want your mother to die at the entrance of your room and have to bear the guilt of driving me to my death, you’d better come home and get married obediently.” <br/><br/>“You...” <br/><br/>Just as Anisa was about to speak, the phone call was abruptly ended. Leaning against the tree, she buried her face in her arms, biting her lip to keep herself from sobbing out loud. <br/><br/>After a while, she pounded the tree with her hand a couple of times. <br/><br/>Her fingers were scraped and bleeding from the rough tree bark, and several of her nails cracked as well. <br/><br/>It took a while for her to calm down, dry her tears, and rub warmth back into her wind-chilled face. <br/><br/>Just as she was about to get up and walk back, her cell phone rang again. <br/><br/>There was hardly a single pleasant event. <br/><br/>From tomorrow onwards, things wouldn’t be any better for the female lead. <br/><br/>Every day was filled with either crying, shouting, or suffering hardships and injuries... <br/><br/>“Only by going through that can she become strong,” Daisy commented. <br/><br/>“Does one need to go through such tragedy to grow stronger?” Harton wondered. <br/><br/>Daisy looked at him, clearly not everyone did. He was a living example of that. <br/><br/>Furthermore, an example she couldn’t even defeat. <br/><br/>Some people grow stronger by choice. <br/><br/>Others are forced into it. Clearly, the female lead was the latter. <br/><br/>“This is just one tragic part of her story. Once this part is over, she’ll be able to face the hardships calmly in the future,” Daisy said softly, her eyes downcast. <br/><br/>Harton’s lips moved, many words wanting to come out, but he didn’t know where to start. <br/><br/>Filming such exhausting fight scenes, constantly dealing with injuries, both old and new, on top of the weight of connecting with the character’s emotions. <br/><br/>Daisy glanced at him, noticing his pursed lips and uneasy expression. <br/><br/>She considered for a moment before asking, “What’s wrong?” <br/><br/>“Nothing,” Harton knew that discussing these issues would be pointless, as he held her hand and said, “I just find the script somewhat unreasonable.” <br/><br/>“In what way?” <br/><br/>He thought for a moment before nitpicking, “The romance part isn’t very logical. ” <br/><br/>Daisy: “...and how should it be logical?” <br/><br/>“I think it would be quite logical if there’s no romance at all,” Harton suggested. <br/><br/>Anisa chuckled quietly. <br/><br/>Daisy glanced at her, then back at Harton. Her icy gaze fixated on him. <br/><br/>“Well... I suddenly think it’s quite logical, too,” Harton immediately corrected himself. <br/><br/>Daisy laughed and pinched the tip of his finger.\t\t\t\t\t\t</div>", "images": {}, "success": true}