{"id": 136, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223457.html", "title": "Chapter 136 - 128: The Second Fool", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 136 - 128: The Second Fool</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 136: Chapter 128: The Second Fool <br/><br/>Translator: 549690339 <br/><br/>Kevin Clark was caught off guard by Daisy Zane’s flirtation. <br/><br/>Looking down at her, he fixated on her eyes, her nose tip, and her lips. <br/><br/>The suppressed feelings of affection, desire, and love that had been buried deep within him suddenly ignited like a fire, soaring uncontrollably. <br/><br/>He closed the medicine box and tossed it aside onto a chair. <br/><br/>“Lucia...” His voice was deep and hoarse, magnetically making one’s ears tingle, <br/><br/>“do you know the consequences of teasing?” <br/><br/>Daisy Zane raised her eyebrows, unaware of the impending danger, provocatively challenged, “What?” <br/><br/>Looking at her, Kevin Clark lightly chuckled and said, “Try it and you’ll see.” <br/><br/>Daisy Zane felt a burn under his gaze, and the next second, she was pulled into his embrace. <br/><br/>One of his arms wrapped around her slender waist, while the other hand gently cupped her chin. He forced her to open her mouth slightly, then went in for a kiss. <br/><br/>It was assertive, yet gentle. <br/><br/>Daisy Zane was leaning on the bedside, her robe untied and falling open on her left side to reveal a purple bruise on her lower left rib. <br/><br/>Kevin Clark sat in the chair beside the bed, carefully applying medicine on her. <br/><br/>With her eyes cast down, Daisy Zane stared at Kevin Clark’s hand, lost in thought. <br/><br/>Her lips were very red, and slightly swollen upon closer inspection. <br/><br/>Moreover, her tongue was numb. <br/><br/>Daisy Zane watched as Kevin Clark carefully applied the medicine, as though he was afraid of hurting her. This was in stark contrast to his behavior just moments before. <br/><br/>She had grown accustomed to his gentleness, forgetting that this man was not the benevolent type after all; he was assertive, domineering, and ruthless. <br/><br/>Robinson Scott was right, he was a fairy. A fairy capable of revealing his true form. <br/><br/>Lost in thought, Daisy Zane frowned, looking at the bed she was leaning against. <br/><br/>How had she gotten here? <br/><br/>Ah. He had carried her here. <br/><br/>And it seemed that he had just been kissing her here a moment ago. <br/><br/>Daisy Zane: . <br/><br/>“Lucia?” <br/><br/>However, the next morning, when Michael Jackson saw Kevin Clark, he had a good scare. <br/><br/>When Michael Jackson handed Kevin Clark some paperwork to sign, Kevin Clark was all smiles —sitting alone in his office, in front of a pile of files, he was... laughing. <br/><br/>Moreover, he even shared a friendly chat with Michael Jackson. <br/><br/>After leaving Kevin Clark’s office, Michael Jackson called his mother and gave her all his bank cards along with the passwords. He suspected Kevin’s plans of getting rid of him. <br/><br/>Showing him kindness before Michael’s predicted downfall. <br/><br/>Other than this possibility, Michael Jackson could not think of any other reason for the unsettlingly friendly treatment. <br/><br/>As a result, Michael Jackson spent the rest of the day on edge, unable to finish his lunch. <br/><br/>Not just Michael Jackson, even James Collins thought that Kevin Clark was being unusually friendly towards him that day and began to suspect a conspiracy. <br/><br/>“You... what are you planning?” James Collins asked warily, “Why are you smiling?” <br/><br/>Listening to their conversation, Damian Brown lifted his head from a pile of snacks, his left cheek stuffed full, showing a vigilant expression. <br/><br/>“Did I laugh?” Kevin Clark asked while sipping his tea. <br/><br/>“Didn’t you?” James Collins looked at him and then reached towards the snacks in Damian Brown’s hand. <br/><br/>Before he could even touch the snack, Damian Brown caught his wrist, “What do you want?” <br/><br/>“Why are you being defensive about your food?” <br/><br/>Damian Brown glared at him. <br/><br/>“Okay okay, it’s yours, all yours. Be careful not to overeat or no one will want you.” James Collins withdrew his hand and took a sip of his tea as he asked, “Where’s my sister? Why hasn’t she woken up yet?” <br/><br/>Again, Kevin Clark broke into a smile. <br/><br/>“What’s the matter with you? Why are you laughing again?” James Collins felt a chill run down his spine. He wondered when Kevin Clark ever laughed in his presence. “Is there some D Continent custom that requires smiling?” Kevin Clark glanced at him, stood up and said, “I’m going to check on Lucia. <br/><br/>You two carry on.” <br/><br/>James Collins watched as he left, utterly bemused. Turning to Damian Brown, he said, “Do you think he’s possessed? He’s acting so oddly.” <br/><br/>Damian Brown licked the cream from his lips, looked at James Collins, took another cream-filled bite and said, “Idiot. <br/><br/>“You think so too,” James Collins responded, “I also think he’s behaving like an idiot. If he continues like this, my sister won’t like him.” <br/><br/>Damian Brown: “......I was saying you’re the idiot. Can’t you see he’s over the moon?” <br/><br/>“Over the moon, what does he have to be happy about?” James Collins glanced at her, “You’re calling me an idiot, but I’m no idiot, my IQ is 180!” <br/><br/>“Did you forget to multiply by zero?” <br/><br/>You, you... you’re bullying me again, I’ll go tell my sister.” <br/><br/>Damian Brown glanced at him and took another large bite of cream: “You’re over twenty and still you go tell on others..”\t\t\t\t\t\t</div>", "images": {}, "success": true}