{"id": 139, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223463.html", "title": "Chapter 139 - 131", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 139 - 131</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 139: Chapter 131 <br/><br/>Translator: 549690339 <br/><br/>Miles Family <br/><br/>“Dad, I’ve found a good day for the event.” Johanes Miles said, “March 20 is an auspicious day. It’s the best day for the Family Recognition Banquet.” <br/><br/>Upon hearing this, Charles Hobson did not show a good face to them and left right away. <br/><br/>Amelia Miles sat aside, glanced at her mother, but did not move. <br/><br/>Continuing to play the considerate part, she quietly listened to their conversation. <br/><br/>“Then let’s set it on that day.” Old Master Miles said, “You should prepare well these days, get everything ready, and then notify the media reporters.” “Alright.” Johanes Miles said, “What about Daisy Zane’s side...” <br/><br/>Old Master Miles thought for a moment, “Wait until the media are notified, then tell her.” <br/><br/>“I understand.” <br/><br/>Amelia Miles listened and sneered in her heart. <br/><br/>Waiting to notify the media before telling her – are they afraid she won’t agree, and plan to use the media and the public to pressure her? <br/><br/>What would she not agree to? She couldn’t wait to enter this family, tear off the label of her illegitimate child, and become the young lady of the Miles family. <br/><br/>Just as she was thinking about it, her cell phone rang once. <br/><br/>She first looked at the phone she usually used and saw no new messages. Then she checked another phone. A hidden number sent a message. <br/><br/>[Anisa Cooper agreed.] <br/><br/>Amelia Miles clenched her phone suddenly, took several soft breaths, and suppressed the excitement in her heart. <br/><br/>When replying to the message, her hands were shaking with excitement: [Do it right away, the faster the better. Leak the news to Clarissa Mason so she can report it.] <br/><br/>[No problem.] <br/><br/>Kevin Clark took care of some stuff during the day. <br/><br/>When he returned to the drama crew’s hotel in the evening, Daisy Zane’s eyes were swollen, and her throat was hoarse. <br/><br/>She spent all day filming tear-jerker scenes, crying until her eyes swelled and yelling until her voice was hoarse. <br/><br/>Kevin Clark felt very sorry for her. <br/><br/>After dinner, he made her apply compresses to her eyes and fed her two types of medicine to help ease her throat. <br/><br/>Daisy Zane, leaning on the sofa, held her head back against the sofa cushion, applied a thick eye mask, and exuded a whiff of medicinal fragrance from time to time. <br/><br/>And she was still running a fever. <br/><br/>Kevin Clark sat by her side, applying medicine to the gauze. <br/><br/>Anisa Cooper looked at them and realized she couldn’t help much and might even be in the way. So she told Daisy Zane that she was leaving and went back to her room. <br/><br/>This time they stayed at separate hotel rooms. <br/><br/>Kevin had already put on his coat, and he took her coat and helped her put it on. <br/><br/>The two went to the parking lot together, and only after the car left the parking lot did Daisy ask, “What happened?” <br/><br/>“There’s been a homeless man in the antique street area of Truro City,” Kevin said as he drove, “A few days ago, he suddenly went to a nearby police station, saying someone wanted to harm him and he wanted to report it. But before he could finish speaking, he suddenly lost consciousness.” <br/><br/>Daisy looked at him, frowning. <br/><br/>“Drugs were found in his body,” Kevin said, “It resembles 319, but it’s not the same. It’s also unidentifiable.’ <br/><br/>“What’s the cause of death?” <br/><br/>“The forensic doctor currently says it’s cardiac arrest. Multiple organ damage has occurred all over his body,” Kevin said, “They’re still confirming.” “Organ damage throughout his body? Is it related to the drug?” “Not sure yet,” Kevin said, taking her hand. <br/><br/>Daisy nodded and didn’t say anything, looking out of the car. <br/><br/>At the same time in Truro City, Clarissa Mason looked at the message on her cell phone. After a while, she called the police: “Hello, I’d like to report someone using drugs. The address is . <br/><br/>After hanging up, she made another call: “Ferdason Hotel, tonight the police will come, there’s big news.” <br/><br/>At 0:27 early in the morning. <br/><br/>The police swiped open Dawson Zane’s room door and began searching inside. <br/><br/>The hotel room was simple, with only a few clothes and some cosmetics. <br/><br/>After about twenty minutes of searching, the police found three small bags of white powder in a makeup bag. <br/><br/>“What is this . <br/><br/>“Take it back for testing first.” <br/><br/>“Where is the person in this room?” <br/><br/>“Did they know someone reported them and run away? <br/><br/>“Check the surveillance. Contact their drama crew. Question all the relevant people.” <br/><br/>“Alright.” <br/><br/>Many reporters were waiting outside the hotel, and it seemed that the source of the leak had informed more than one media outlet. <br/><br/>Despite the late hour and the biting cold, they were all alert and focused on the hotel entrance. <br/><br/>They watched as the police entered the hotel, and after a long time, they saw the police come out of the hotel. <br/><br/>And they took someone away. <br/><br/>All the reporters rushed forward, asking questions. The photographer carried the camera and took pictures. <br/><br/>Soon someone recognized who was taken away. <br/><br/>“Isn’t that Anisa Cooper?” <br/><br/>“Who is Anisa Cooper?” <br/><br/>“Daisy Zane’s assistant, Catherine’s assistant.” <br/><br/>“Oh my god, what happened to her? What’s going on? What’s the situation?” “This is big news. Is Daisy Zane in trouble? Where is she? Where did she go?”\t\t\t\t\t\t</div>", "images": {}, "success": true}