{"id": 132, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223449.html", "title": "Chapter 132 - 124: Heading To D Continent", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 132 - 124: Heading To D Continent</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 132: Chapter 124: Heading to D Continent <br/><br/>Translator: 549690339 <br/><br/>Kevin Clark was busy up until the day that Daisy Zane’s new film started shooting, leaving him with some free time. <br/><br/>As he had Michael Jackson book him a flight to Truro City and was already packing his things, Michael Jackson suddenly received a phone call. <br/><br/>Then he said, “Third Master, there’s a problem in D Continent.” <br/><br/>Kevin Clark looked at Michael Jackson, whose pair of evil red eyes glared back with malice, as if black clouds were bearing down on them, “What happened?” <br/><br/>Michael Jackson swallowed hard, reporting with tension and stiffness, “The Darknight Alliance has been ambushing us on our transportation route. They won’t let our things be transported out. We’ve had several fights, with no clear winner, but our stuff has been stuck.’ <br/><br/>Kevin Clark furrowed his brows. <br/><br/>Michael Jackson glanced at him, licked his lips and said, “The Darknight Alliance claims they have something to discuss. If we refuse to talk, they’ll continue to obstruct. Neither of us will be at ease.’ <br/><br/>“What do they want to talk about?” Kevin Clark’s voice was as cold as an ice blade, cutting into one’s heart. <br/><br/>“Not sure yet.” <br/><br/>“Let’s go to D Continent.” Kevin Clark lowered his head and slowly fastened his cufflinks, saying, “If they want to talk, let’s talk about how the Darknight Alliance should disappear.” <br/><br/>Having been with Kevin Clark for so long, Michael Jackson was still frightened, his face turning paler. “Yes, I’ll arrange it right away.” <br/><br/>After Michael Jackson left, Kevin Clark looked at the suitcase beside him, gritted his teeth, and sent Daisy Zane a message: [Something came up, I’ll be a few days late to Truro City] <br/><br/>Daisy Zane was filming and didn’t respond to him. <br/><br/>Benjamin Hobson ordered the driver to watch the training location for more than half a month, but Juan Wright had been there every day, not giving them any chance to approach. <br/><br/>So he followed her to the film set, staying at the hotel where Daisy Zane was lodged. <br/><br/>He spent his days idling and mingling, and while coveting Daisy Zane, he was never short of women around him. <br/><br/>The shooting location for Daisy Zane’s project was rather far from the city center. Sometimes, it would be more convenient to be close by for night shoots, so she decided to stay in a nearby hotel. <br/><br/>She would only go back to Everlasting Palace occasionally when she had fewer scenes. <br/><br/>After joining the film set, Daisy Zane didn’t have Juan Wright follow her and resumed using her previous driver. <br/><br/>“Naomi Nelson, is something bothering you?” Daisy Zane asked while waiting for her next scene, noticing Naomi Nelson lost in thought. <br/><br/>“Huh? Daisy, what did you say?” Naomi Nelson suddenly came to her senses, “Do you want some water? Are you cold?” <br/><br/>“I’m fine.” Daisy Zane looked at her weary expression and swollen eyes, asking again, “Is there something going on with you?” <br/><br/>As soon as she opened the room door and before stepping in, she received a call from Robinson Scott. <br/><br/>“Brother Nine, Damian Brown has been arrested in D Continent.’ <br/><br/>Daisy Zane’s face changed for a moment, and immediately became fierce: “Who arrested him?” <br/><br/>“That jadeite-dealing b*stard.” Robinson Scott said, “I tried to rescue him with a team twice but failed. This time, I’m afraid the balance will be broken. <br/><br/>Daisy Zane understood Robinson Scott’s meaning. <br/><br/>In D Continent, the Darknight Alliance and the jadeite-dealing group had been counterbalancing each other for many years. Although the struggle was never-ending, both parties had accepted this balanced state. <br/><br/>Now that such a big commotion had started, it seemed that it wouldn’t stop until one side was swallowed up. <br/><br/>Daisy Zane raised her eyebrows, her expression arrogant and disdainful, “Wait for me, I’ll come over.’ <br/><br/>“Okay.” <br/><br/>After hanging up the phone, Daisy Zane called the director to ask for a three-day leave, then informed Hill Dawson and Anisa Cooper. <br/><br/>Then she went directly to the airport. <br/><br/>After flying for more than seven hours and landing in D Continent, Daisy Zane was picked up by James Collins as soon as she left the airport. <br/><br/>“You’re here too?” Daisy Zane looked at James Collins’ pink hair and asked. <br/><br/>“Logan and Luke sent me as a representative to help out,” James Collins smiled, “Sister, doesn’t my new hairstyle look handsome?” <br/><br/>Daisy Zane stared at his pink hair and remained silent in silence. <br/><br/>Seeing no response from Daisy Zane, James Collins suddenly stepped on the brakes and looked at her, “Doesn’t it look good?” <br/><br/>When he turned his head, Daisy Zane could see his peach blossom eyes, and only then did she feel somewhat appeased. However, she still said expressionlessly, “It looks just like a pink tufted doll.” <br/><br/>James Collins: <br/><br/>“Where did you learn this bizarre aesthetic?” Daisy Zane asked, puzzled. “Doesn’t it look good?” <br/><br/>Daisy Zane was a little afraid that he would keep asking insistently, so she moved her eyes away from his head and endured the humiliation by saying, <br/><br/>“It’s pretty good.” <br/><br/>These three words might have required all her acting skills in her life. <br/><br/>Hearing Daisy Zane praise him, James Collins finally started the car again and happily asked, “Sister, how do you plan to deal with this situation?” <br/><br/>Daisy Zane looked at the gradually brightening sky outside and said, “Tonight, sneak in with me and get a feel of their internal structure and layout.” <br/><br/>James Collins’ mouth hooked up, his interest piqued, and excitement filled his eyes, “No problem..”\t\t\t\t\t\t</div>", "images": {}, "success": true}