{"id": 147, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223479.html", "title": "Chapter 147 - 138: How Can Someone Be So Cruel Part 2", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 147 - 138: How Can Someone Be So Cruel Part 2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 147: Chapter 138: How Can Someone Be So Cruel Part 2 <br/><br/>Translator: 549690339 <br/><br/>As she was seated, the collar of her pajamas dipped even lower. <br/><br/>Kevin Clark glanced at it and then walked over to her, pulling up her clothes. <br/><br/>“Hm?” <br/><br/>Kevin Clark leaned down and looked into her eyes, “Lucia, I’m not that much of a gentleman.” <br/><br/>Daisy Zane lowered her gaze to her clothes, although they were now raised by Kevin Clark and nothing could be seen. But just now, it must have... <br/><br/>Kevin Clark watched her ears turn redder by the moment, and the smile in his eyes deepened. <br/><br/>However, when Daisy Zane looked up and met his gaze, there was no difference from usual. The same indifferent eyes and an unshakable calm expression. “Is that so? What do you want to do since you’re not a gentleman?” <br/><br/>Kevin Clark narrowed his eyes, and a dangerous look instantly filled them, brazen and as if he could swallow someone whole. <br/><br/>Daisy Zane raised her hand and grabbed his collar, pulling hard. Two people were now closer. Kevin Clark raised an eyebrow, looking at her. <br/><br/>Daisy Zane leaned close to his ear and whispered, “What if I said I did it on purpose?” <br/><br/>Even though he knew she was talking nonsense, Kevin Clark’s pupils still shrank, and all the blood in his body rushed to his head. <br/><br/>He gripped Daisy Zane’s wrist as she held onto his collar, just about to put force. Daisy Zane suddenly broke free from his grasp and walked to the other side of the sofa. <br/><br/>Kevin Clark was stunned for a moment, looking up at her. <br/><br/>Daisy Zane arrogantly and provocatively raised her eyebrows, then turned around at a leisurely pace, swaggering into the bedchamber and closed the door. <br/><br/>Watching her retreating figure, as well as the closed door of the bedchamber, Kevin Clark’s lips trembled slightly. <br/><br/>The desire, ruthlessness, and evil in his eyes could all tear someone apart. <br/><br/>He clenched his face and gritted his teeth for a while before calming his inner turmoil. <br/><br/>Daisy Zane didn’t dare make a sound, cursing him in her heart. <br/><br/>“Arthur, Arthur, Kevin Clark, where did you go? Are you listening to me? Is the connection bad? Where did you run off to this time, with such a poor signal?” Tom Wayne rambled on the other end of the line, but the hand Kevin Clark held his cell phone with had already reached Daisy Zane’s nape without any intention of responding to him. <br/><br/>Daisy Zane could hear Tom Wayne’s voice clearer than he did, feeling awkward as if... they were doing something in front of his mother... So, she bit Kevin Clark. <br/><br/>Only then did Kevin Clark let go of some strength in his hand, slowly withdrawing, kissing her twice more at the corner of her mouth, and then taking a deep breath before continuing the phone call, “Mom, the signal might be a bit bad.” <br/><br/>“You’re running around again,” Tom Wayne said, “Alright, I won’t talk to you anymore. Just remember what I said.” <br/><br/>“Mhm.” Kevin Clark raised his hand and gently rubbed Daisy Zane’s shining lips with his thumb, “I will definitely obey Mother’s command.” <br/><br/>When he hung up the call, Daisy Zane clenched her fist and hit him. <br/><br/>Kevin Clark immediately bent down, resting his head on Daisy Zane’s shoulder and hugging her, “Lucia, that hurts.” <br/><br/>“Bullshit.’ <br/><br/>Kevin Clark chuckled and hugged her even tighter, “It really hurts.” <br/><br/>“I didn’t even use any force.” <br/><br/>“I know.” Kevin Clark laughed, “Lucia can’t bear it.” <br/><br/>Daisy Zane: . <br/><br/>“Don’t be mad,” Kevin Clark said, “I did it because I was afraid Lucia would get shy. What if Lucia really wanted to, but was too embarrassed? I had to take the initiative.” <br/><br/>“You’re really a quick learner.” <br/><br/>“My mom taught her son well,” Kevin Clark laughed. <br/><br/>Daisy Zane: . <br/><br/>“Lucia, it really hurts a little,” Kevin Clark said as his hug tightened, “My lips also hurt a bit from the bite.’ <br/><br/>Daisy Zane inhaled sharply and thought: He’s such a scoundrel..\t\t\t\t\t\t</div>", "images": {}, "success": true}