{"id": 146, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223477.html", "title": "Chapter 146 - 138: How Can Someone Be So Cruel", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 146 - 138: How Can Someone Be So Cruel</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 146: Chapter 138: How Can Someone Be So Cruel <br/><br/>Translator: 549690339 <br/><br/>After reviewing Mason Davis’ material, Kevin Clark drove Daisy Zane home and told her to get some sleep at the Everlasting Palace. <br/><br/>Upon arriving at the palace, Kevin picked up some packed medicines meant for throat protection from his place. After watching Daisy consume one dose, he planned to leave. <br/><br/>“Aren’t you resting for a bit?” <br/><br/>“I’m okay.” Kevin kissed her forehead, “I’ve placed an order for your lunch, it will be delivered.” <br/><br/>“You don’t need to bother about me.” <br/><br/>“I always have time to spare for you.” Kevin chuckled. <br/><br/>Daisy raised her eyebrow and said, “Why not research on the population migration in Truro city from ten to twenty years ago and check if there’s anyone who disappeared after moving, or anyone who vanished suddenly. That homeless man couldn’t have wandered into Truro City for no reason.” <br/><br/>“Hmm. Okay.” Kevin verbally agreed, but his mind was elsewhere. His thoughts were filled with love and romance, while hers were filled with work, “Call me if anything comes up.” <br/><br/>Leaning against the door, Daisy replied nonchalantly, “What could happen?” <br/><br/>“For instance... You might miss me.” Kevin stated. <br/><br/>Daisy: <br/><br/>Seeing her reaction, Kevin laughed and gently caressed her face, “Well, I’m leaving. You don’t have to worry about anything. I’ve arranged everything. Read latest chapters at novelhall.com Only<br/><br/>Sweet dreams.’ <br/><br/>“That’s not ruled out. But it’s still not confirmed.” Kevin entered the living room and went to wash his hands in the washroom, “The specific composition of 319 is quite peculiar. As we cannot identify it, we’re clueless about what it is. So far, there hasn’t been any record related to this substance.” <br/><br/>Daisy leaned on the washroom door, understanding clearly. As long as they didn’t know what it was, every step would be difficult. <br/><br/>They would not know what could suppress it if they didn’t know what it was. <br/><br/>Numerous experiments were being conducted by the research institute every day. Despite countless method trials, all of them ended in failure. <br/><br/>“Daisy.” Kevin called her from beside the sink. <br/><br/>“Hmm?” <br/><br/>“I want to use the washroom.” Kevin stated. <br/><br/>Daisy stalled for a second, then leaned against the door frame with an indifferent expression, “Hmm, go ahead.” <br/><br/>Seeing her nonchalance, Kevin chuckled. His already captivating features became even more enchanting due to the crimson color around his eyes, “Since <br/><br/>Daisy doesn’t mind, I naturally don’t.” <br/><br/>Daisy didn’t move, her gaze even slid down before she raised an eyebrow. <br/><br/>Kevin ground his teeth, his hand rested on his belt buckle before pressing it. <br/><br/>Watching his belt loosening, Daisy instantly straightened up and without uttering a word, turned around and left. Seeing her leaving, Kevin chuckled and mumbled, “Cheeky miss.” <br/><br/>Then he closed the washroom door. <br/><br/>When he came out of the washroom again, Daisy was sitting on the sofa, twirling a pencil she had found somewhere in her hand, deep in thought..\t\t\t\t\t\t</div>", "images": {}, "success": true}