{"id": 140, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223465.html", "title": "Chapter 140 - 132: Message Spreads", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 140 - 132: Message Spreads</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 140: Chapter 132: Message Spreads <br/><br/>Translator: 549690339 <br/><br/>Truro Police Department <br/><br/>Upon arriving, Kevin Clark and Daisy Zane were led straightaway to meet the director. <br/><br/>“Third Master.” <br/><br/>“Director Hamilton.” The two appeared very familiar with each other, forgoing any superfluous pleasantries. <br/><br/>Edward Lee glanced at Daisy Zane by Kevin’s side but refrained from asking too many questions. He introduced the person next to him, “This is Deputy <br/><br/>Director Giovanni. Recently transferred from a nearby market town, Diego Giovanni has cracked many major cases.” <br/><br/>Diego Giovanni appeared to be in his forties and bore an upright appearance. With a stern face, he exuded reliability at first glance. <br/><br/>He extended his hand to shake Kevin’s: “Third Master.” <br/><br/>Afterward, he glanced at Daisy Zane. <br/><br/>Daisy Zane also looked at him, and as their eyes met for a moment, both indifferently looked away. <br/><br/>After exchanging brief greetings, Edward Lee began telling Kevin about the case involving the homeless man. <br/><br/>He handed over several of the forensic pathologist’s reports to Kevin first. Kevin placed the report near Daisy Zane, and they looked at it together. <br/><br/>“These indexes seem too high,” Daisy said. <br/><br/>“Indeed. They’re three times higher than those of an average person, ” Kevin said, glancing at the time on the report before flipping through a couple more pages. <br/><br/>It was another identical examination report. <br/><br/>The previous one had been taken three hours after the deceased had passed away. <br/><br/>It was clear that the forensic pathologist suspected something was off, so another examination was performed twenty-four hours later. <br/><br/>While the indexes were not as high as they were the first time, they remained higher than average. <br/><br/>“Normally, three hours after death, these data would be very low, nearly zero,” Kevin said. “But with these results taken twenty-four hours later, the values are still higher than those of a living person.” <br/><br/>“It’s as if these data are saying this isn’t a normal human being,” Daisy added. <br/><br/>Edward Lee and Diego Giovanni both glanced at Daisy Zane. <br/><br/>Kevin nodded, flipping through the report again. <br/><br/>There was another section about the blood drug analysis. <br/><br/>Edward Lee said, “They are currently working to further detect if the drug components in his blood are related to case 319.” <br/><br/>“Hmm,” Kevin replied, “Howmuch longer until the results come out?” <br/><br/>Almost as if the sleeping fans were called up to watch the drama unfold, staring wide-eyed at the developments. <br/><br/>And about an hour later, a media outlet called Zealot Media released a piece of news. <br/><br/>[Daisy Zane arrested for drug use, illicit substance found in her hotel room. <br/><br/>Assistant Anisa Cooper taken away for investigation.] <br/><br/>Below were three photos of Anisa Cooper being taken away, and six photos of Daisy Zane and Kevin Clark entering the police station. <br/><br/>Kevin Clark’s face was blurred, leaving only Daisy Zane visible. <br/><br/>As soon as the news came out, it was like a bomb thrown into water, causing great waves. <br/><br/>Daisy Zane’s identity might not have caused such a storm, but Flynn Ninevara’s could. <br/><br/>[Holy shit, what happened? What’s going on? This is the first time I’ve heard of a female celebrity doing this.] <br/><br/>[Ban her, ban her, ban her, ban her.] <br/><br/>[There’s no official news yet, you guys have no evidence, this is a rumor.] <br/><br/>[Do those few photos look like someone being arrested? Who goes to a police station like that after being arrested? Shameless media spreading rumors, just wait to be sued.] <br/><br/>[Don’t brainwash fans anymore, Zealot has been a media outlet for many years, would they spread rumors about this kind of thing?] <br/><br/>[Daisy Zane doesn’t look like she’s been arrested, but her assistant has been taken away for real. Fans who still dream of whitewashing her, just wait for her to be banned.] <br/><br/>Clarissa Mason saw the news online and felt her blood boiling. <br/><br/>Her excitement was as if every cell in her body was dancing along. <br/><br/>She looked at the incoming call on her cellphone, calmed her mood, and answered: “What’s up? <br/><br/>“Are you sure there won’t be any problem with the news?” The editor of Zealot Media asked on the phone call. <br/><br/>“Don’t worry, the news is 100% true,” Clarissa Mason said, “Just wait for Zealot to become the industry’s top hitter again.” <br/><br/>“All right.” The other side hung up after saying this. <br/><br/>Clarissa Mason threw her phone on the table, danced happily for a moment, tapping her rhythm. <br/><br/>As she turned around in a circle, she suddenly sat on the ground. <br/><br/>Her fingers touched the smooth floor, laughing sinisterly: “What if you are <br/><br/>Flynn Ninevara? In the end, you will still be ruined.” <br/><br/>“Stealing my roles, causing me to be beaten, causing me to be abandoned by <br/><br/>Olivia Chester, being banned by the industry... it’s all because of you, all you.” Clarissa Mason fiercely stab the floor twice, “You are here to ruin me, as long as you’re gone, my future in stardom will be smooth.” <br/><br/>After saying that, she lay down on the floor and started laughing.\t\t\t\t\t\t</div>", "images": {}, "success": true}