{"id": 145, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223475.html", "title": "Chapter 145 - 137: I’Ve Seen Him", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 145 - 137: I’Ve Seen Him</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 145: Chapter 137: I’ve Seen Him <br/><br/>Translator: 549690339 <br/><br/>After dinner, Juan Wright took Anisa Cooper away. Kevin Clark and Daisy Zane went straight to the police station. <br/><br/>This time, the entrance to the police station was much quieter. Kevin Clark had ordered all the paparazzi to be removed. <br/><br/>So he held Daisy Zane’s hand as they entered the police station. <br/><br/>The two of them brought food for everyone, Daisy Zane even specially requested two servings of Crystal Shrimp Dim Sum. Although she didn’t say anything, the shrimp dumplings ended up beside Diego Giovanni. <br/><br/>When she ordered the two servings of shrimp dumplings, Kevin Clark knew something was wrong. <br/><br/>As expected, they were for Diego Giovanni. <br/><br/>Kevin Clark saw it, his heart filled with jealousy, but he didn’t say anything, or else it would make him seem petty. <br/><br/>So he took advantage of his height and hid Daisy Zane behind himself, not letting anyone see her. <br/><br/>“How’s the investigation going?” Kevin Clark asked. <br/><br/>While eating his steamed bun, Edward Lee replied, “We are still investigating. We sent more people to Antique Street to inquire about the identity of the homeless man and see if we can find any clues about his identity.” <br/><br/>“Hmm,” Kevin Clark said, “I’ll take another look at the material about the Red Cliff Village Doctor of Medical Formulation.” <br/><br/>Daisy Zane was blocked behind him, so she moved a little. As soon as she moved, Kevin Clark moved too. <br/><br/>She moved to the other side again, and Kevin Clark followed suit. <br/><br/>Daisy Zane: . ‘ Childish. <br/><br/>“Any new leads?” Edward Lee asked. <br/><br/>“Hmm, we’ll see,” Kevin Clark replied. <br/><br/>“Alright, I’ll have someone fetch them.” <br/><br/>William took them back to the room where they had read the Red Cliff Village Brick Factory reports last time. <br/><br/>After giving them each a set of paper documents, he left. <br/><br/>Daisy Zane looked at the report in Kevin Clark’s hand and suddenly asked, “What if we, as normal people, had those high index indicators for those who are dead – what would happen?” <br/><br/>Kevin Clark looked at her, and after a while, he suddenly smiled. <br/><br/>Daisy Zane gazed at the smile on his face. <br/><br/>“I saw him when he was called Mason Davis.” Daisy Zane lowered her eyes, but her gaze did not settle on anything. “He had a wife and a four-year-old daughter.” <br/><br/>Kevin Clark looked at her, and a bad feeling surged in his heart: “What happened after that?” <br/><br/>“After that...” Daisy Zane stroked her knuckles, “I saw their family of three’s corpses.” <br/><br/>“How did they die?” <br/><br/>Daisy Zane shook her head gently. “Mason had a bullet wound in his chest and head. But it should have been caused after death. His wife and daughter had no obvious injuries.” <br/><br/>Kevin Clark lightly pursed his lips, and finally asked the question: “How did you see them?” <br/><br/>Daisy Zane’s eyelashes trembled slightly but did not answer his question. Instead, she said, “It seems that Mason was involved in some research, but suddenly stopped participating, took his wife and daughter, and left. It would be more accurate to say they fled.” <br/><br/>“So because of his leaving, they killed his family of three?” Kevin Clark speculated based on the information she provided. <br/><br/>Daisy Zane was silent for a while before nodding. <br/><br/>“If Mason was involved in the research related to 319 and died because of 319,” <br/><br/>Kevin Clark said, “then the homeless man probably died for the same reason.” <br/><br/>“Hmm,” Daisy Zane said. “That person made themselves a homeless man, perhaps to hide from them.” <br/><br/>Daisy Zane now understood why the trade location had such a relatively special place, Red Cliff Village. That person was commemorating something. <br/><br/>Commemorating Mason’s death in this way, Mason’s betrayal. And also commemorating her, commemorating her first mission. <br/><br/>Kevin Clark threw the material in his hand onto the table. After a while, he looked very seriously at Daisy Zane and said softly, “Lucia, I need an answer.” <br/><br/>Daisy Zane looked up at him, stared at him for two seconds and said, “What if the answer I give is not what you want?” <br/><br/>The two looked at each other silently for a few more seconds, and these seconds felt like they were being stretched infinitely long for both of them. Each heartbeat seemed to slow down as well. <br/><br/>It hurt the heart terribly. <br/><br/>Shortly after, Kevin Clark stepped forward and embraced Daisy Zane, stroking her head and saying, “I think my Lucia wouldn’t give me the answer I don’t want.” <br/><br/>“What if I lied to you?” Daisy Zane’s voice was cold and quiet, without any fluctuations or emotions. <br/><br/>“I trust you,” Kevin Clark said. “I believe anything you say.” <br/><br/>Hearing this, Daisy Zane twitched the corner of her mouth, closed her eyes, and took a gentle breath. <br/><br/>Kevin Clark’s scent of eaglewood was comforting. She whispered, “I’ve never participated in 319. Nor have I been involved in any other research. But...” <br/><br/>“Alright, that’s enough.” Kevin Clark interrupted her, “As long as you’re safe and they won’t harm you in this way. We’re not afraid of anything else..”\t\t\t\t\t\t</div>", "images": {}, "success": true}