{"id": 141, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223467.html", "title": "Chapter 141 - 133: Clarifying The Relationship", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 141 - 133: Clarifying The Relationship</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 141: Chapter 133: Clarifying the Relationship <br/><br/>Translator: 549690339 <br/><br/>The news on the internet spread quickly, and there was still no response from the authorities. <br/><br/>It can be said that it took one night until dawn. <br/><br/>Daisy Zane, Maple Elite Entertainment, and the drama crew all didn’t give a response. <br/><br/>It was as if they were tacitly admitting to it. <br/><br/>However, the lack of response on the internet was because everyone was trying to contact Daisy Zane. Allonzo Hobson was also trying to contact Kevin Clark. <br/><br/>But neither of their phones were being answered, although they were reachable. <br/><br/>It’s easy to control the news online, but searching Daisy Zane’s residence for evidence is not an easy task. <br/><br/>So everyone can only wait for news to confirm what was going on with Daisy Zane before they could clarify and respond specifically. <br/><br/>Allonzo Hobson couldn’t reach anyone, so he immediately called Juan Wright. <br/><br/>Only then did he find out that the person in the photos online at the entrance of the police station, whose identity was completely blurred, was Kevin Clark. <br/><br/>After learning that Daisy Zane and Kevin Clark had entered the police station together, Allonzo Hobson immediately felt relieved. <br/><br/>Moreover, knowing that they were dealing with the 319 case, he didn’t hurry to contact them. <br/><br/>Compared to that, this matter was more pressing. <br/><br/>In this case, Daisy Zane was innocent, and with so many people involved, they wouldn’t let her suffer this injustice for nothing. <br/><br/>But with the other case, a difference of just one minute might miss the best opportunity to arrest someone. <br/><br/>So he told Gentry Morris, Harry Thompson, and Hill Dawson not to worry. With Kevin Clark there, even if the sky exploded, he could stitch it up without a trace. <br/><br/>He controlled the news online for a while and then didn’t bother anymore. <br/><br/>Miles Family <br/><br/>Amelia Miles looked at the news online and didn’t sleep all night. <br/><br/>[Is there any problem with Anisa Cooper?] She sent out a message. <br/><br/>[Don’t worry, even if she talks, it won’t lead to me, let alone to you.] The other party quickly replied with a message. <br/><br/>Amelia Miles felt relieved, wanted to go wash up, but after thinking about it, <br/><br/>she didn’t. She didn’t change clothes either, casually grabbed a coat to put on, and then left her room. <br/><br/>On the ground floor, Johanes Miles and Old Master Miles were sitting opposite each other, both looking unhappy. <br/><br/>Charles Hobson was sitting on the side, not speaking at this time to avoid making himself unhappy. But he seemed to be in a good mood. <br/><br/>As soon as she finished speaking, the door of the office was knocked open. Edward Lee turned around and asked, “What’s up? <br/><br/>William stood at the doorway and said, “The Drug Prohibition Task Force said they are looking for Lady Zane Daisy.” <br/><br/>Kevin Clark, Daisy Zane, and Diego Giovanni were all watching the surveillance footage, and upon hearing this, they all looked up at the entrance. <br/><br/>“Daisy Zane? Who’s Daisy Zane?” <br/><br/>Edward Lee never asked about the person Kevin Clark brought along. <br/><br/>But he could see that something was off about Kevin and that woman, too concerned about her. When did he ever care if someone was tired or not? He would only kick them awake when they were about to doze off. <br/><br/>“What’s going on?” Kevin Clark asked. <br/><br/>Edward Lee looked over and remembered that he didn’t even know the name of the person Kevin brought. <br/><br/>“That... The Drug Prohibition Task Force said... Lady Zane is involved in drug use... Let’s cooperate with the investigation.” <br/><br/>The Drug Prohibition Task Force tracked Daisy Zane through Ferdason Hotel’s CCTV and various road cameras, eventually leading them to Daisy in the police station... <br/><br/>After searching for several hours, they found that the person they were looking for was in the same place as themselves. <br/><br/>So they showed the CCTV footage to William and asked if he had seen the woman in the footage. <br/><br/>Then, William knocked on the door. <br/><br/>Kevin Clark’s eyes were somewhat red, and upon hearing this sentence, his expression became fierce, as if his eyes were stained with blood, particularly terrifying. <br/><br/>Diego Giovanni’s face also darkened upon hearing this, and he looked as if he wanted to curse. <br/><br/>Daisy Zane had no expression, glanced at William, and then looked at Diego Giovanni: “5 minutes.” <br/><br/>Diego Giovanni didn’t say a word and went straight out of the office. <br/><br/>Daisy Zane then looked back at the computer and magnified the footage: “Here, there are two shadows on the glass.” <br/><br/>The spot was a corner where the homeless man would rest every night, right in a blind spot for surveillance cameras. <br/><br/>However, diagonally across the corner, the glass facing the camera reflected two shadows. <br/><br/>“Indeed,” Edward Lee said. <br/><br/>Kevin Clark rewound the footage a little and played it in slow motion again. <br/><br/>The shadows on the glass weren’t very clear, and they could barely make out that one person was sitting, while the other bent down as if talking. <br/><br/>Later, the person sitting struggled to get up, and the standing person seemed to push the sitting person away, then walked in the opposite direction, deliberately avoiding the camera on this side. <br/><br/>As for the person sitting, they didn’t move at all, not budging an inch as seen from the shadows on the glass. <br/><br/>Kevin Clark played the footage at double speed. <br/><br/>It wasn’t until the next day, around seven o’clock, that the shadows on the glass moved. Then the homeless man walked out from the corner. <br/><br/>Based on the time, it seemed like he went straight to the police station afterward....Updated from novelbIn.(c)om\t\t\t\t\t\t</div>", "images": {}, "success": true}