{"id": 144, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223473.html", "title": "Chapter 144 - 136: Clarification", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 144 - 136: Clarification</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 144: Chapter 136: Clarification <br/><br/>Translator: 549690339 <br/><br/>The efficiency of dealing with various aspects was very fast. The first one to clarify was Maple Elite Entertainment, followed by the drama crew. <br/><br/>Then, the reporters at the entrance of the police station released photos of Daisy Zane leaving the police station. <br/><br/>Soon, the police department issued an official announcement. <br/><br/>Both Daisy Zane and Anisa Cooper tested negative, which proved that the media’s claim that illicit drugs were found at Daisy Zane’s residence was a rumor. <br/><br/>It also criticized the rumormonger and threatened legal action against those responsible for the false accusations. <br/><br/>At first, when the company and the drama crew clarified the situation, some people did not believe it. But as soon as the official news came out, the voices of doubt of the netizens subsided. <br/><br/>Whenever there was a questioning, the netizens would directly tag the Truro Police Department official website in the comment thread. <br/><br/>If anyone wanted to question, just directly question the police department and let the official website answer. <br/><br/>update by newn0el .org Updated from novelbIn.(c)om<br/><br/>As soon as the clarification news came out, many netizens just followed it and enjoyed the drama throughout the evening. <br/><br/>But some people weren’t satisfied. <br/><br/>Amelia Miles kept staring at the news online, and once the clarification was out, she immediately sent a message to the hacker. <br/><br/>[What’s going on online?] <br/><br/>The hacker quickly responded: [Anisa Cooper fooled us. She never planted that thing.] <br/><br/>Amelia Miles: [How did you manage to screw up? Weren’t you sure it would go off without a hitch? Much ado about nothing.] <br/><br/>[How could I have known that Miss Cooper would be so bold and dare to deceive me? She must not care about her life, playing me like that.] Amelia Miles: [What do we do now?] <br/><br/>[We can only make another plan. There are many ways, just find another opportunity.] <br/><br/>It took about three minutes for Amelia Miles to reply: [We have no other choice. Don’t let Anisa Cooper get away!] <br/><br/>[Of course not. She dares to fool me; I won’t let her live in peace. I’ll show her that I’m not bluffing.] <br/><br/>Amelia Miles: [Take care of your side of things. Don’t let anyone find out about me.] <br/><br/>[How many times do I have to say? Rest assured, no one will find me. Much less you.] <br/><br/>The hacker sat in front of five or six computers in a sealed-off room lit only by the glow of the screens. <br/><br/>His bearded face was grim and sinister, like a rat hiding in a gutter. <br/><br/>Wearing a smug smile, he moved his fingertips, deleting the chat with Amelia Miles. <br/><br/>Suddenly, all the computers went black. <br/><br/>In the video, the hacker was dragged to the car by two people, unable to walk anymore. <br/><br/>The voice of Juan Wright came through the video, “Third Master, the hacker is captured. I kicked him twice. Now his legs are like jelly, and he can’t walk. <br/><br/>Should we cut him into pieces or mud?” <br/><br/>Anisa Cooper listened to this, shivering twice in a daze. <br/><br/>Harton Clark replied with a message: [Take him back first. Wait.] <br/><br/>Daisy took a bite of a milk custard bun, chewed slowly, then swallowed and said, “Naomi Nelson, where did you keep the stuff that man gave you?” <br/><br/>“Huh?” Anisa Cooper looked at Daisy and was puzzled for two seconds before responding, “It’s in the house I rented.” <br/><br/>“Get it after dinner.” Daisy said, “You need to cooperate with the police investigation. Tell them everything. You’ll be fine.” <br/><br/>“I, I know.” Anisa Cooper replied, “Now that the hacker has been caught, I’m not afraid anymore.” <br/><br/>Clark added some soup for Lucia and said to Anisa, “Juan will come later, let him accompany you to get the stuff, and then go directly to the police station.” “Okay.” Anisa Cooper agreed. <br/><br/>Clark continued, “All this was done by Amelia Miles. She was the one who found those people, and let them go to your home to propose a marriage.” Anisa Cooper widened her eyes, “Even this was arranged by them. They create trouble for me and then solve it to win me over.’ <br/><br/>“Yes.” Harton Clark replied, “So, remember to speak up early if something like this happens again. It’ll save everyone a lot of trouble.” <br/><br/>Anisa Cooper lowered her head and whispered, “I understand now. I’m sorry.” <br/><br/>Daisy sipped her soup, lowered her gaze, and said, “Let’s eat first.” <br/><br/>“Okay.” Anisa Cooper picked up her chopsticks. <br/><br/>Harton Clark looked at her and smiled, “Amelia probably doesn’t want the Miles Family to recognize you.” <br/><br/>Daisy hummed in agreement. <br/><br/>“She used Olivia Chester’s ID card to apply for the SIM card she contacted the hacker with. At first, she used the card in her own frequently used cell phone. <br/><br/>Later on, she put the card in a newly purchased cell phone.” <br/><br/>Of course, Holt Lawrence could find this information just as Juan Wright could. <br/><br/>However, Lucia didn’t interrupt Clark and listened to him say, “After everything was set up, she let the hacker tell Clarissa Mason. So, it was Clarissa who reported this, as well as leaked it to the editor of Zealot Media.” <br/><br/>“Are all the people dealt with?” <br/><br/>“Yes.” Clark responded calmly, “Once Anisa Cooper goes to the police station, none of these people on the line will escape. For rumormongers with serious consequences, they’ll face three to seven years imprisonment. For serious consequences caused by framing or deception, they’ll face three to ten years. Of course, if other things are investigated, separate charges will apply.” <br/><br/>Clarke seemed to be sure of the word “of course,” as if something would definitely come up during their investigation. <br/><br/>Lucia raised her eyebrows, looking satisfied that she didn’t have to do anything herself. <br/><br/>Anisa Cooper was holding her breath, trying to minimize her presence as much as possible. <br/><br/>Harton Clark’s eyebrows and eyes still contained a smile, but he exuded an intimidating aura. <br/><br/>In front of him, she felt like an ant; with just a flick of his finger, he could decide her life or death..\t\t\t\t\t\t</div>", "images": {}, "success": true}