{"id": 148, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223481.html", "title": "Chapter 148 - 139: Disturbing The Lovebirds", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 148 - 139: Disturbing The Lovebirds</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 148: Chapter 139: Disturbing the Lovebirds <br/><br/>Translator: 549690339 <br/><br/>Originally, she wanted to go back to the Imperial Capital to see Charles Amos, but she was delayed for a day. After having lunch the next day, Daisy Zane went straight back to the drama crew. <br/><br/>She couldn’t make it. <br/><br/>In the afternoon, Kevin Clark accompanied her to the drama crew. As the two were in the car, he said, “I’ll go back to the Imperial Capital in a few days and bring Charles Amos here. When there’s no show in the evenings, you can still go back to the Everlasting Palace to see him.” <br/><br/>“It’s too much trouble.” <br/><br/>“But if you don’t go back for a long time, he’ll miss you.” Kevin Clark said, matter how mature his mind is, he still needs you.” <br/><br/>Daisy Zane didn’t say anything. <br/><br/>“Michael Jackson will be back in a few days, too.” Kevin Clark said, “If those two can’t even protect a child, what are they good for?” <br/><br/>“Fine.” Daisy Zane said, “By the way, ask Wilton Edwards if he’s willing to come and let him come over, too. If they’re apart for too long, Wilton Edwards will miss the child.” <br/><br/>“Okay. Fine.” <br/><br/>Daisy Zane fell asleep in the car for a while. When she woke up, they were almost at the hotel where the drama crew was staying. <br/><br/>She touched her neck and looked outside, asking, “Can Naomi Nelson come back tomorrow?” <br/><br/>“That possibility is not excluded.” Kevin Clark said. <br/><br/>After Amelia Miles was released, she was picked up by John Anderson. <br/><br/>From the police station entrance to her apartment, Amelia Miles cried continuously. She wouldn’t say anything other than that she was scared. <br/><br/>Seeing her like this, John Anderson was heartbroken and stopped asking questions. He stayed up all night with her, comforting her. <br/><br/>The next morning, because Olivia Chester was arrested, several artists in the company were also implicated. Maple Elite Entertainment suffered unprecedented damage, and the company was in chaos. The media almost blocked the ground floor. <br/><br/>There was no other choice. John Anderson called Charles Hobson and asked him to come to the apartment to accompany Amelia Miles while he hurried back to the company. <br/><br/>Although the company had been continuously calling John Anderson, he still waited for Charles Hobson to arrive before leaving. <br/><br/>“Charles, Sophie is terrified.” John Anderson said, “Please accompany her. I really can’t leave the company.” <br/><br/>Charles Hobson’s eyes were swollen and red, clearly from crying, “Alright, you go ahead, don’t worry about this side.” <br/><br/>“Alright.” <br/><br/>Charles Hobson saw John Anderson leave, and his expression immediately turned cold. <br/><br/>He went to the bedchamber and saw Amelia Miles sitting on the bay window, looking at him. <br/><br/>There was not a trace of fear on her face, which was very calm. Even her expression seemed to imply that everything was still going according to her plan..\t\t\t\t\t\t</div>", "images": {}, "success": true}