{"id": 142, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223469.html", "title": "Chapter 142 - 134: Current Girlfriend", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 142 - 134: Current Girlfriend</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 142: Chapter 134: Current Girlfriend <br/><br/>Translator: 549690339 Follow current novels at novelhall.com)<br/><br/>“Have someone check the surveillance around the corner. Cross-check the figure on the glass to see if there’s any footage captured.” Kevin Clark said, “Also, look into the identity of this homeless man. It’s a bit suspicious.” <br/><br/>“Yeah.” Edward Lee said, “The perpetrator has a very specific target, as if they came directly for this homeless man.” <br/><br/>“Yes.” Kevin Clark said, “You get someone to look into it first.” <br/><br/>After speaking, Kevin Clark looked at Daisy Zane: “Let’s go, I’ll accompany you.” <br/><br/>“I can go by myself.” Daisy Zane stretched lazily and stood up. <br/><br/>Edward Lee glanced at the two of them, held back for a moment, and asked, “This <br/><br/>Kevin Clark also stood up, picked up Daisy Zane’s coat from the chair next to him, and said, “Current girlfriend...” <br/><br/>Current girlfriend? <br/><br/>Edward Lee furrowed his eyebrows, what did that mean? Would anyone introduce their girlfriend like that? <br/><br/>No, the key is, how could someone like him have a girlfriend? <br/><br/>Was this girl dazzled by his appearance and therefore chose him? <br/><br/>What a poor judgment in choosing a man for this little girl. <br/><br/>Hearing these three words, Daisy Zane looked at Kevin Clark. Her eyes, having stayed up all night, were even colder. <br/><br/>Kevin Clark draped the coat over her, rubbed her face, and smiled, “Future wife. <br/><br/>Daisy Zane: . <br/><br/>Edward Lee: <br/><br/>“So fierce.” Kevin Clark carefully tore off the gauze on her neck, “Go back and take more medicine.” <br/><br/>“Hmm.” <br/><br/>Edward Lee felt goosebumps all over his body listening to his gentle words and even shivered. <br/><br/>On the way to the Drug Prohibition Task Force with Daisy Zane, Kevin Clark. <br/><br/>Daisy Zane checked her phone. <br/><br/>She put her phone on silent before entering the police station. <br/><br/>As she expected, something this big was already causing a commotion outside. <br/><br/>So many people had called her. <br/><br/>Even Holt Lawrence and Damian Brown called her. <br/><br/>Daisy Zane listened quietly, her face expressionless. She seemed as cold as fallen snow, exuding a faint chill. <br/><br/>so clean and coldly beautiful. <br/><br/>The female police officer gently sighed, “It’s a cosmetic. It’s called setting powder for makeup.” “All three packages?” <br/><br/>“Yes.” <br/><br/>Police officer: ...... I didn’t think it looked like one. But with the informant saying it had a nose and eyes, I thought a new product was out.” Daisy Zane: . <br/><br/>The police officer looked at Daisy Zane, “You guys package it in bags?” <br/><br/>“Maybe... for the convenience of the makeup artist.” Daisy Zane said. <br/><br/>Earlier when the police told her they found the stuff in the bottom layer of her makeup box, she had honestly said she wasn’t sure what it was. <br/><br/>The makeup box was prepared by the drama crew’s makeup artist, and everything inside was the makeup artist’s. <br/><br/>Since the makeup artist is responsible for her and two other actors in the drama, the makeup artist had Anisa Cooper carrying the box exclusively for her every day. <br/><br/>She had only seen the threefold top layer but never the bottom layer since the makeup artist had never opened it. <br/><br/>Police officer: . Just wait for your results.” <br/><br/>Daisy Zane nodded. <br/><br/>More than an hour later, the hair drug test result came out, and it was negative. <br/><br/>It turned out to be a false alarm after a whole night of fuss. <br/><br/>The police asked Daisy Zane more questions and then let her go. <br/><br/>When Daisy Zane walked out, Harton Clark was still waiting outside. Seeing her, he smiled first, “Let’s eat something. I’ve arranged everything else.” <br/><br/>Daisy Zane nodded and said, “Let’s wait for Anisa Cooper.” <br/><br/>“Alright,” said Harton Clark. <br/><br/>“Can I take a look at the material about the missing doctor from Red Cliff Village?” Daisy Zane suddenly asked. <br/><br/>“Hmm?” Harton Clark looked at her and asked, “Why did you suddenly think of him?” <br/><br/>“I thought about it when I was in the interrogation room.” Daisy Zane put her hand into Harton Clark’s coat pocket, pulled out a piece of candy, peeled it and put it in her mouth, and continued, “This homeless man’s behavior is very much like he’s avoiding something. And there’s no information about his previous job.” <br/><br/>“Yes,” Harton Clark took away the candy wrapper from her hand, “If the drug component confirmed in his body is 319. It’s very likely that the homeless man is related to 319.” <br/><br/>“That’s why I suddenly thought of the doctor from Red Cliff Village,” Daisy <br/><br/>Zane said, “I just want to have a look.” <br/><br/>“Okay,” Harton Clark said, “I’ll let you see it after dinner.” <br/><br/>“Alright..”\t\t\t\t\t\t</div>", "images": {}, "success": true}