{"id": 149, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223483.html", "title": "Chapter 149 - 139: Disturbing The Lovebirds 2", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 149 - 139: Disturbing The Lovebirds 2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 149: Chapter 139: Disturbing the Lovebirds 2 <br/><br/>Translator: 549690339 <br/><br/>When Charles Hobson saw this, he walked over and slapped her, shouting in a low voice, “Amelia Miles, she is your Aunt Claire, who has watched you grow up since you were a child! She treated you like her own daughter! How can you calculate this way against her?” <br/><br/>Yesterday when Amelia came out, Johanes Miles had someone inquire about some internal news and roughly learned what had happened. <br/><br/>Johanes and Old Master Miles didn’t notice this, but how could Charles not know when Amelia was his daughter? <br/><br/>Amelia raised her hand to wipe the area where she was slapped, her expression unchanged, “Mom, you can’t blame me for this. If you had any way to keep Daisy Zane from entering the Miles Family gates and not stealing my status as the young lady of the Miles Family, I wouldn’t have come to such a desperate situation.” <br/><br/>“Then go and harm Olivia Chester!” <br/><br/>“If Aunt Claire is clean and innocent, how would she willingly take on the responsibility for me?” Amelia said, her expression still unchanged, but tears fell from her eyes. “She knew she couldn’t get out anyway, so she wanted to protect me. Whether or not this happens to me has no effect on her.” <br/><br/>Charles covered her mouth and silently started to cry, “What will Aunt Claire do inside? How will she bear this kind of punishment?” <br/><br/>Amelia stood up and hugged Charles, whispering, “Mom, you should think about it. It’s not your daughter who was sent in. If it wasn’t for her, it would be me. Also... either way, Daisy Zane can’t enter the Miles Family door now. Dad has publicly fallen out with her.” <br/><br/>“But your Aunt Claire...” <br/><br/>“I will repay Aunt Claire’s efforts.” Amelia’s eyes were hollow, staring blankly at Charles’s back, mechanically saying, “I will repay Aunt Claire’s efforts.” <br/><br/>At this time in the Miles Family, Old Master Miles and Lorenzo Jasper were sitting in the study, and no one spoke. <br/><br/>The study felt suffocatingly quiet for a moment. <br/><br/>Yesterday, Johanes Miles had someone inquire about Amelia’s news. After the inquiry, the person was probably a little busy, only explained the situation to him roughly, and then was gone. <br/><br/>Johanes sent a few words of thanks later, but there was no response from the other side. <br/><br/>It wasn’t until today that they responded. <br/><br/>After some casual greetings, the other side sent a few lines. <br/><br/>[Director Miles, Daisy Zane is your daughter, right? You are really blessed to have such a capable daughter.] <br/><br/>Johanes was dumbfounded when he saw this. He thought about it back and forth for a long time before replying with a message to ask a question. <br/><br/>The answer came back quickly. <br/><br/>“Oh.” Tom Wayne looked at him and said casually, “What is her last name?” <br/><br/>Hugo took a sip of tea. “It’s Zhao.” <br/><br/>“Is that so?” <br/><br/>“Yes.” <br/><br/>Tom Wayne picked up the book from the tea table and hit him on the back. <br/><br/>“You liar!” <br/><br/>Hugo was startled, and the tea in his cup spilled on his hand. <br/><br/>“You said her last name is Zhao, the next time I introduce you to a girl, you’ll probably lie to me and say her last name is Cash. You’re playing around with surnames with me.” Tom Wayne said exasperatedly. <br/><br/>“Grandma, I...” Hugo moved to the side, fearing she would hit him again. He grabbed a few pieces of paper and wiped his hands. <br/><br/>“Don’t call me grandma. I don’t want a grandson like you,” Tom Wayne threw the book on the tea table. “And you want to deceive me! The girl’s last name is clearly Tang. ” <br/><br/>Hugo: He should have said her last name was Tang. <br/><br/>“Her name is Daisy Zane.” <br/><br/>When Hugo heard these three words, he nearly choked on his breath. “What... what is her name?” <br/><br/>“Daisy Zane!” Tom Wayne said, “She’s also a superstar and a famous screenwriter.” <br/><br/>Hugo’s forehead twitched, and he had a vague feeling of unease. “Grandma, why don’t you introduce her to Third Uncle?” <br/><br/>“Your Third Uncle has a girlfriend. Why would I introduce her to him?” Tom Wayne picked up the book and hit him again. “Your Third Uncle already has a girlfriend, you fool.” <br/><br/>“Third Uncle is an elder. He should have one, right?” <br/><br/>“You’re older too. Let me tell you, when men get too old, their bodies will fail them.” <br/><br/>Hugo’s face darkened: What was she talking about? He was still healthy. <br/><br/>Tom Wayne didn’t pay attention to his expression and sighed, “Since you don’t want to, let’s forget it. I heard the girl has a bad reputation and background. <br/><br/>Our kind of family....”\t\t\t\t\t\t</div>", "images": {}, "success": true}