{"id": 143, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223471.html", "title": "Chapter 143 - 135: Never Acknowledging Kinship", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 143 - 135: Never Acknowledging Kinship</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 143: Chapter 135: Never Acknowledging Kinship <br/><br/>Translator: 549690339 <br/><br/>Harton Clark and Daisy waited at the entrance of the Police Station for Anisa Cooper to come out. <br/><br/>While waiting, Harton Clark had already arranged everything for clarification. Allonzo Hobson, Hill Dawson, the drama crew, and Maple Elite Entertainment would all release statements to clarify the situation. <br/><br/>Due to their public status and the significant impact of the incident. <br/><br/>The police would also release a statement to verify their innocence. <br/><br/>Just as everyone was arranging the clarification, a response from the Miles Family appeared on Facebook’s hot search. <br/><br/>Daisy clicked to check it. <br/><br/>There was a video among them, in front of the Miles Group skyscraper, surrounded by a swarm of reporters. <br/><br/>When Johanes Miles appeared, the reporters rushed forward and surrounded him in the middle. Updated from novelbIn.(c)om<br/><br/>update by newn0el .org <br/><br/>[Director Miles, I heard that you are preparing a Family Recognition Banquet recently to accept Daisy back into the Miles Family. Is that true?] <br/><br/>[Director Miles, have you seen the news online? What do you think of those news?] <br/><br/>[Director Miles, do you have any explanation about Daisy involving in this kind of thing?] <br/><br/>[Director Miles, did you know about what Daisy has done beforehand?] <br/><br/>“Everyone, please be quiet, please be quiet,” Johanes Miles was surrounded by security in the middle, saying loudly, “Please hear me out, please hear me out.” All media outlets quieted down, and their microphones and cameras were aimed at him. <br/><br/>Johanes Miles straightened his face and said, “I’ve seen the news online, and to be honest, I was very shocked and very guilty when I saw it. I was shocked because I didn’t expect Daisy would dare to do such outrageous things. I was guilty because, although I didn’t know about her existence for these twenty-plus years, I felt guilty for not giving her proper education, resulting in her becoming like this. So, I am deeply sorry for the adverse influence she has brought to our country and society.” <br/><br/>“So, is it true that Daisy takes drugs?” The reporter suddenly asked. <br/><br/>Johanes Miles’ face stiffened for a moment and then said, “The officials will give us an answer to that. I won’t say more.” <br/><br/>“Didn’t you know beforehand?” someone else asked. <br/><br/>“We didn’t know at all. If I had known she had done such a thing, I would have sent her in at once.” Johanes Miles spoke about waiting for an official message, but his words implied that the incident was true as described online. <br/><br/>“Ever since Daisy came to Truro City, we’ve met a few times.” Johanes Miles cleared his name, “And all of these few times, we parted unhappily, even more unfamiliar than strangers.” <br/><br/>“What about the Family Recognition Banquet?” The reporter asked again. <br/><br/>“The Miles Family has never thought about recognizing her as a family member, so the question of a Family Recognition Banquet does not arise.” <br/><br/>Johanes Miles said, “There have been constant rumors online that the Miles Family is preparing a Family Recognition Banquet. I would like to take this opportunity today to clarify this point. The Miles Family has never considered recognizing her as a family member due to various reasons back then...” <br/><br/>Johanes Miles hesitated and then continued, “But after all, the child is innocent. So after knowing about Daisy’s existence, I have given her due compensation. Subsequently, a company will make it public for everyone. But recognizing her as a family member has never been thought of and never will.” <br/><br/>“Besides, she’s done this now. We are businessmen, but we can still distinguish between right and wrong in the face of national interests and major issues.” Johanes Miles said with righteousness and solemnity, “Even without those past incidents, with her like this now, the Miles Family would never accept her.” <br/><br/>“Director Miles, you mean to say that when you had a relationship with someone back then, it was the woman’s fault?” The sharp reporter asked. <br/><br/>Anisa took several sheets and pressed them to her eyes: “I, I’m scared. That, that man, he, he’s monitoring my cell phone. He, he also threatened me, saying, saying he’d hurt my mother. I, I don’t know what to do.” <br/><br/>“Why didn’t you put it?” <br/><br/>“I, I can’t harm you.” Anisa said, “I, I’m a hero’s future family member. I, I have at least some vigilance.” <br/><br/>As Daisy Zane looked at her, she suddenly laughed. <br/><br/>Harton Clark glanced at her in the rearview mirror and raised the corner of his mouth. <br/><br/>“X sister, why are you laughing?” Anisa asked. <br/><br/>“Nothing.” Daisy Zane said calmly, “What was the deal with the loose powder in the makeup box?” <br/><br/>Anisa had heard about it at the police station. She said: “I don’t know, I didn’t know there was such a thing as loose powder in the makeup box. I, I’ve never seen it before. When the police searched the room and found things, I, I thought they didn’t trust me and still found someone else to harm you.” <br/><br/>Daisy Zane: “...” It seems that it was just a misunderstanding, and it happened by coincidence. <br/><br/>“You continue.” Daisy Zane said. <br/><br/>Anisa took two deep breaths, steadied herself, and said: “I was scared and didn’t know what to do. So, so I agreed to their demands, thinking that I could buy one more day. I thought I could come up with a solution.” <br/><br/>“Did you find a solution?” Daisy Zane raised her eyebrow. <br/><br/>“No. They asked me yesterday if I had placed the stuff as they asked. After I told them I did, I wanted to talk to you. I couldn’t think of any other solution.” Anisa said, “But you were so tired after shooting all day yesterday. I thought I’d talk to you in the evening, but Third Master came last night. I didn’t find an opportunity. I didn’t expect them to act last night.” <br/><br/>Daisy Zane thought about it; a young girl in her twenties, with no money, no power, and no influence. She probably never thought she would encounter a hacker. Being inexperienced, sudden events like this would have terrified her. <br/><br/>“I wanted to tell everything at the police station.” Anisa said, “But the person who approached me said that even if I called the police, they wouldn’t be able to find him. And the things he gave me, they’re still with me. I’m afraid I really won’t be able to find him, and in the end, I’ll have things in my hands and can’t explain them. I don’t have any evidence, so I didn’t say anything.” <br/><br/>“He scared you.” Daisy Zane said. <br/><br/>“But...isn’t it true that hackers can’t be found by anyone?” Anisa calmed down a bit, her red eyes looking at Daisy Zane, “He can monitor my cell phone, he’s so capable.” <br/><br/>Daisy Zane: . . Don’t insult the word ‘capable.’” <br/><br/>“X sister, what should I do now? He must know that I didn’t put those things in your room. I’m really afraid they’ll do something to my family.” Anisa said, “That hacker knows me very well, and I’m afraid he’ll hurt my boyfriend. Besides, who’s trying to harm you? If we don’t catch them, there’ll be more trouble.” <br/><br/>“Juan Wright has sent people to catch the hacker.” Harton Clark said, “Now...he should be caught.” <br/><br/>Anisa was stunned for two seconds before she understood Harton Clark’s words, and asked blankly: “Huh? Caught, caught?” <br/><br/>Daisy Zane also looked at Harton Clark: “Juan Wright found out?” <br/><br/>“Hmm.” Harton Clark said, “He’s quite useful besides failing to attack the Celestial Pivot.” <br/><br/>Daisy Zane raised her eyebrow and thought: The technology is not bad. I don’t know if Holt can scare the guy at this point. <br/><br/>“X, X sister?” Anisa looked at Daisy Zane blankly, not daring to believe it, “Did, did Third Master just say that the hacker was caught?” <br/><br/>“Yes.” Daisy Zane said lightly. <br/><br/>“Just, just like that, he was caught so quickly?” <br/><br/>“He’s just a piece of trash. Why bother?” Daisy Zane said contemptuously..\t\t\t\t\t\t</div>", "images": {}, "success": true}