{"id": 159, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223503.html", "title": "Chapter 159 - 149: Clarification", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 159 - 149: Clarification</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 159: Chapter 149: Clarification <br/><br/>Translator: 549690339 <br/><br/>Ever since Daisy Zane walked out of the police station unscathed that evening after the Hobson Family had suffered a complete disaster, the Miles Family’s desire to mend their relationship with her had only intensified. <br/><br/>Not only was it because Daisy Zane could bring huge benefits to the Miles Family, but they also worried that she could take revenge on them. <br/><br/>So they wanted to mend the relationship as quickly as possible. <br/><br/>When Daisy Zane received a message from Johanes Miles while having lunch, she simply deleted it after checking it. <br/><br/>Then she opened a message sent by Austin Allen: [By the way, I’m going to sue those who led the army of paid trolls too.] Daisy Zane replied to him: [Okay, tonight, don’t forget.] <br/><br/>Austin Allen: [Don’t worry, I’ll be on time.] <br/><br/>Afterwards, Daisy Zane asked Melody Collins for her Facebook account and password. She also told Melody that it was best to turn off her phone or mute it tonight while sleeping. <br/><br/>Melody, who never took more than ten minutes to reply to a message, only replied to Daisy Zane when she was eating dinner that evening. <br/><br/>Daisy Zane finished work early today. However, after returning to the hotel, she didn’t sleep. <br/><br/>She opened a bottle of wine and drank while working on her design drafts. <br/><br/>With a theme of the 24 solar terms, Daisy Zane promised Felix Baker that she would submit a draft every quarter. It’s already April, and the first quarter has passed. <br/><br/>So, she decided to submit every six solar terms. <br/><br/>Anyway, she would submit four drafts each year, so she wasn’t being dishonest with her agreement. <br/><br/>Once the Grain Rain solar term passed, she would submit her draft. <br/><br/>Daisy worked on her draft until 11:55 p.m. <br/><br/>She put down her pen, picked up her wine glass, and cell phone, and walked to the French window to gaze at the dark night outside. nove(l)bi(n.)com<br/><br/>The time on her phone changed to midnight. As soon as it hit midnight, it was April 15th. <br/><br/>Daisy Zane opened the official Facebook account of the Lee Law Firm. <br/><br/>At midnight, the Lee Law Firm released a lawyer’s statement. <br/><br/>Daisy Zane’s recent popularity was high, and the post quickly received widespread attention. <br/><br/>Ever since Daisy Zane appeared in the public eye, she was accompanied by her identity as an illegitimate child. She never responded to it. <br/><br/>As a result, she didn’t respond, but now she retaliated with a deadly counterstrike. <br/><br/>[Poor X sister. She lost her mother before she was even a month old. After so many years, her biological father’s business flourished, but she suffered in a place like Cold Green Village.] <br/><br/>[It was not easy to get out of such a place, and she was slandered as an illegitimate child. And her biological father not only refused to clarify but also deliberately blackened her image in interviews. How could there be such a disgusting person.] <br/><br/>[During Daisy Zane’s investigation, Johanes Miles immediately cut off the relationship, fearing it would affect him. He even said something like he would never recognize his family.] <br/><br/>[Moreover, the words he said were obviously implying that it was Claudia Zane who seduced him to make a mistake. He even mentioned that he only knew about Daisy Zane’s existence more than twenty years later. Their divorce date was clearly after Daisy Zane’s birth, how could he not know about his daughter. <br/><br/>So shameless.] <br/><br/>[And those relevant authorities are too terrifying. Money can do all kinds of wicked things, they must be thoroughly investigated.] <br/><br/>[Everyone, go check out @luo’s Facebook. A newly opened account posted screenshots of chat records. It’s Amelia Miles buying paid trolls to disparage Daisy Zane as an illegitimate child.] <br/><br/>[I saw it, I saw it. So shameless. I wondered why the issue of illegitimate children suddenly came up again. Turns out someone was behind it.] <br/><br/>[How dare she disparage others as illegitimate children. Her brother is the real illegitimate child. She was lucky to be born after her parents got married. Her mother is the third party. Yet she disparages others, pretending to be a pure lotus. She can’t stand Daisy Zane being better than her, so she discredits her.] <br/><br/>[I used to think Amelia Miles was pretty good, good-looking, good at dancing, and a good personality. Now I suddenly feel disgusted.] <br/><br/>[What kind of good person can be educated growing up in such a family?] <br/><br/>[You guys are blaming now, but the court hasn’t even accepted the case yet. Is everything true just because a lawyer’s statement was issued?] <br/><br/>[Moreover, this is their family’s private affair. They’ve already submitted it to the court, why bring it up using public resources? Desperate for fame?] <br/><br/>[Accepting the case in court is only a matter of time. Who would fake such a thing when they dare to issue a lawyer’s statement? You must be a fool.] <br/><br/>[Who occupies public resources? Not knowing who is leading the rhythm on the internet, saying Daisy Zane is an illegitimate child. You are allowed to spread rumors, but she’s not allowed to clarify? How many times have they spread rumors on the internet? She just clarifies once. If she doesn’t clarify online, should she let you continue to slander? If your brain can’t work, just pick it off and kick it for fun.] <br/><br/>Apart from the netizens’ righteous indignation, the most obvious reaction was Miles Group’s stock falling, even worse than the last time Daisy Zane had an accident. <br/><br/>Daisy Zane didn’t pay much attention to the online news. She stood in front of the French window, wearing a silk sleeping robe. After putting her cell phone aside, she reached into her clothes and touched the pendant. <br/><br/>“If only you were alive... How nice it would be,” Daisy Zane slowly lowered her eyes, paused, and drank the wine in her glass. <br/><br/>Then she was silent for a while, whispering, “That way... I could tell you in person..”\t\t\t\t\t\t</div>", "images": {}, "success": true}