{"id": 157, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223499.html", "title": "Chapter 157 - 147: I’M Jealous", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 157 - 147: I’M Jealous</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 157: Chapter 147: I’m Jealous <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane suddenly felt Arthur North was very much like a large pet, one that needed regular attention. Seeing him like this, she gradually loosened the strength from her hand. <br/><br/>Arthur North immediately held her in his arms. In truth, he was deeply grieved. He couldn’t imagine what she had gone through to drive herself to this state. <br/><br/>“Lucia. ” <br/><br/>“Hmm?” Daisy Zane simply removed her slippers and put her bare feet directly on the seat. <br/><br/>Arthur North pulled a blanket over from the side and covered her feet, saying, <br/><br/>“I am a bit jealous.” <br/><br/>“What?” <br/><br/>“Why didn’t you call me when something happened.” Arthur North stroked her head and said, “And why did you call that guy, Austin?” <br/><br/>“He’s a lawyer.” <br/><br/>“But I’m your boyfriend.” Arthur North softly said, “Shouldn’t your first instinct be to turn to me when something happens?” <br/><br/>“I...” Daisy Zane swallowed the words at the tip of her tongue and said, “You were the first one I thought of.” <br/><br/>“Really?” Arthur North’s voice carried a hint of laughter. <br/><br/>“Mhmm.” The way Daisy Zane hummed, seemed very genuine. <br/><br/>Arthur North laughed and said, “You thought of me first, but you went to someone else for help first. Right?” <br/><br/>“Mhmm.” Daisy Zane willingly admitted. <br/><br/>“Naughty girl.” Arthur North lightly tapped her back “You just love to upset me.” <br/><br/>Daisy Zane leaned on his shoulder, her eyelashes fluttering lightly. For some reason, a very familiar feeling climbed into her heart, making her feel uncomfortable. <br/><br/>“He also calls you Lucia.” Arthur North added. <br/><br/>“Because he didn’t know what my name was originally. He heard someone else call me Lucia, so he started to as well.” Daisy Zane explained, “I’m not that close with him.” <br/><br/>“Others also call you Lucia. So, are you very close with someone else?” Arthur <br/><br/>North quickly pinpointed the key point, “A man or a woman?” <br/><br/>Daisy Zane: . <br/><br/>Not hearing her reply, Arthur North raised his head, looking at her, he laughed and said, “What’s the matter? Are you upset because I teased you?” <br/><br/>“No.” Daisy Zane randomly found an excuse, “I’m just a bit tired.” Arthur North gave her forehead a light peck:”Let’s go back to the hotel.” <br/><br/>“Mhmm.” <br/><br/>Two days later, Austin Allen had some free time, so he arranged to see Daisy nove(l)bi(n.)com<br/><br/>But Daisy Zane handled it very well. <br/><br/>Although it was the same expression, no eyes widening, or any movement, but those eyes communicated her emotional changes. <br/><br/>That evening, searches related to “Fall of the Quince” and Daisy Zane occupied six entries on the trending topics. <br/><br/>Of course, negative fans are everywhere, but their combat power is too weak and their words have been drowned out. <br/><br/>The number of followers on Daisy Zane’s Facebook page skyrocketed overnight. <br/><br/>Some fans even mistakenly went to Flynn Ninevara’s page. They were guided back by other fans, who asked them to distinguish between the actor Daisy <br/><br/>Zane and the screenwriter Flynn Ninevara. <br/><br/>Even Daisy Zane’s new drama received considerable attention. <br/><br/>Hill Dawson called Daisy Zane several times during this period. The drama crew asked if she wanted to promote the new drama with everyone, but Daisy Zane declined. <br/><br/>She said that just forwarding news from the drama crew on Facebook was enough. <br/><br/>She was content with just acting, she didn’t want to attend press conferences and other promotional events. <br/><br/>On April 13, Anisa Cooper returned to work, with a new ring on the middle finger of her left hand. <br/><br/>Her face was glowing, a clear sign of good news. <br/><br/>“This ring isn’t part of the set I saw last time.” Daisy Zane commented as she rested in the nanny car. <br/><br/>Anisa Cooper giggled shyly, “This one was purchased by him, he proposed.” Daisy Zane joined in the laughter. <br/><br/>Kevin Clark, who was watching Daisy Zane’s new drama nearby, said, “Lucia, you seem to bring luck to the staff.” <br/><br/>“Hmm?” <br/><br/>“Your assistant got engaged, the driver had a son,” Kevin Clark looked up at <br/><br/>her, “When will you bring me good luck?” <br/><br/>“Haven’t I already?” <br/><br/>“You have,” Kevin Clark laughed, “I’m no longer single.” <br/><br/>Anisa Cooper chuckled at their exchange, and then, glancing at a message on her cell phone, said, “Third Master, Daisy. I’m going to get food.” <br/><br/>“Mhm.” <br/><br/>When Anisa Cooper left, Kevin Clark said, “It seems like you like this assistant very much. ” <br/><br/>“Yes.” Kevin Clark touched her face, “You treat her a bit differently than others.” <br/><br/>Daisy Zane lowered her eyes and smiled faintly, not continuing the topic, <br/><br/>“What time is the flight in the afternoon?” <br/><br/>“5 0’clock. I’ll definitely bring Charles Amos back this time, ” Kevin Clark smiled, “No idea how that little rascal is cursing me at home.” <br/><br/>“At most he’ll just ignore you again..”\t\t\t\t\t\t</div>", "images": {}, "success": true}