{"id": 156, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223497.html", "title": "Chapter 156 - 146: Give A Hug", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 156 - 146: Give A Hug</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 156: Chapter 146: Give a Hug <br/><br/>Translator: 549690339 <br/><br/>After leaving the police station, Anisa Cooper held on to Daisy Zane’s hand. She was genuinely scared and wanted someone to lean on. <br/><br/>Daisy Zane looked at her and hesitated before saying, “Call your boyfriend.” <br/><br/>Kevin Clark and Allonzo Hobson looked at Daisy Zane. <br/><br/>Allonzo Hobson even asked, “Whose boyfriend?” <br/><br/>Daisy Zane paused before looking at him and saying, “You have a boyfriend?” “Who has a boyfriend! I don’t have a boyfriend! And I’ll never have a boyfriend!” Allonzo Hobson suddenly became very agitated, as if his tail had been stepped on. <br/><br/>Daisy Zane glanced at him again, and Kevin Clark said, “Don’t mind him.” <br/><br/>“Daisy, are you talking to me?” Anisa asked. <br/><br/>“Mm-hmm.” <br/><br/>“Why?” Anisa was confused. “It’s so late; he must be asleep.” <br/><br/>“Then wake him up,” Daisy Zane said. “This late at night, and you’re at the police station. Shouldn’t he come to pick you up? <br/><br/>“But, but...” Anisa said, “But we haven’t reconciled yet.” <br/><br/>Daisy Zane looked at the silly girl beside her and after a moment of silence, said, “Today is a good day; it should be a great time for reconciliation.” <br/><br/>“Huh?” Anisa didn’t understand but eventually took out her cell phone and made a call. <br/><br/>The call was answered after about ten seconds. The man on the other end was sleeping, and his voice was hoarse. He seemed to realize that something had happened since she was calling so late, so as soon as he picked up, he hurriedly asked, “Naomi, what happened?” <br/><br/>As soon as Anisa heard his voice, tears immediately started falling. Crying, she said, “Brother Miller!” <br/><br/>Allonzo Hobson was scared by her crying, but Daisy Zane remained calm. She held Anisa’s hand and led her towards the parking lot while listening to her cry. <br/><br/>Kevin Clark just looked sideways at Daisy Zane. Updated from novelbIn.(c)om<br/><br/>Anisa couldn’t even see the road from crying so much and could only rely on Daisy Zane to lead her, sobbing, “Brother Miller, someone bullied me. I’m, I’m at the police station...” <br/><br/>After saying that, Anisa stopped talking and just listened to the other side, nodding in response. <br/><br/>After about a minute, she hung up the phone. <br/><br/>Allonzo Hobson handed her two tissues. Anisa snuffled and said, “Thank you, Young Master Hobson.” <br/><br/>“What did he say?” Daisy Zane asked. <br/><br/>“He, he said he’d come pick me up and asked me to wait for him here.” Anisa wiped her tears as she spoke. <br/><br/>“Yes,” Anisa replied. “Daisy avenged me. She beat the person and sent them to the hospital.’ <br/><br/>As they spoke, Daisy Zane got out of the car and strolled over. <br/><br/>John Collins looked up at her. When Anisa wanted to be her assistant, he had looked her up online and knew that she was a beautiful young lady. <br/><br/>But seeing her in person still amazed him. <br/><br/>“Daisy Zane.” She extended her hand. <br/><br/>John Collins shook her hand politely. “John Collins. Thank you for tonight.’ <br/><br/>“It’s my pleasure.” Daisy Zane took a quick look at him, then turned to Anisa. “She’s been frightened. She probably won’t be able to work for a while. You can take her home first. <br/><br/>Anisa kept her head down and didn’t say anything. <br/><br/>John Collins hesitated for a moment, but seeing Anisa’s expression, he immediately agreed. “Alright, I’ll take her home first.” <br/><br/>After the two left, Daisy Zane returned to the car. At that moment, Arthur North returned with the takeout he had just ordered. <br/><br/>He ordered two milk teas, put a straw in one, and placed it in Daisy Zane’s hand. <br/><br/>Daisy Zane looked out the car window. “Where’s Young Master Hobson?” <br/><br/>“He ordered a car and went back to the Everlasting Palace.” Arthur North sat down with her in the back seat and then leaned down to touch her ankle. <br/><br/>Daisy Zane moved away and looked at him. <br/><br/>Arthur North laughed. “You’re not cold, are you? Why are you hiding?” <br/><br/>“I’m not cold,” Daisy Zane took a sip of her milk tea. <br/><br/>Arthur North looked at her face. He’d always thought her complexion was bad because she was cold, but... He placed his hand on her pulse and after a while said, “Menstruation.” <br/><br/>Daisy Zane raised an eyebrow. “You can tell?” “Yes.” Arthur North frowned, then released her hand. “Does it hurt?” <br/><br/>“I took a painkiller tonight.” Daisy Zane replied. <br/><br/>Arthur North paused for two seconds, then grabbed Daisy Zane’s hand and said, “Lucia.” <br/><br/>“Yes?” <br/><br/>Arthur North put the milk tea from her hand aside. “Come here, let me give you a hug.” <br/><br/>Daisy Zane didn’t move, finding him a bit strange. <br/><br/>Arthur North reached over and wrapped one arm around her waist, pulling her onto his lap with one force. With his other hand, he shielded her head to prevent it from bumping against the car roof. <br/><br/>“What are you doing?” Daisy Zane’s hand pressed against Arthur North’s shoulder, secretly exerting force against him. <br/><br/>“Lucia, let’s just hug for a while,” Arthur North’s head rested against her shoulder, coaxing with a smile.. “What can I do?”\t\t\t\t\t\t</div>", "images": {}, "success": true}