{"id": 158, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223501.html", "title": "Chapter 158 - 148: Amelia Miles Comes To The Door", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 158 - 148: Amelia Miles Comes To The Door</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 158: Chapter 148: Amelia Miles Comes to the Door <br/><br/>Translator: 549690339 <br/><br/>In the afternoon, Kevin Clark left, and when Daisy Zane returned to the hotel in the evening, she encountered a little trouble. <br/><br/>It was past three in the morning when Daisy Zane and Anisa Cooper got out of the car in the parking lot. They hadn’t walked far when they heard the sound of a car door opening and closing in front of them. <br/><br/>After a few footsteps, Amelia Miles appeared in front of them. Updated from novelb(i)n.c(o)m<br/><br/>Daisy Zane had been filming all day and didn’t want to say a word now. She glanced at Amelia and tried to walk around her with Anisa. <br/><br/>But Amelia Miles stepped forward to block them. <br/><br/>“What? Are you blind? Can’t see people?” Amelia Miles completely dropped her usual pretense of being well-behaved, “Or do you think you’ve done something remarkable and no longer need to respect others?” <br/><br/>“Get out of the way.” Daisy Zane said, looking at Amelia’s hand. <br/><br/>“What if I don’t?” <br/><br/>Daisy Zane looked up at her. <br/><br/>As their gazes met, Amelia Miles fell silent for a while before laughing, “Daisy <br/><br/>Zane, do you think you can enter the Miles family just because your <br/><br/>connections are strong enough to impress my father and grandfather? Do you <br/><br/>think once you become part of the Miles family, you’ll be considered one of the <br/><br/>young ladies of our family?” <br/><br/>Amelia Miles suddenly laughed and approached Daisy Zane, saying word by word, “Your mother was a third party who broke up someone else’s family, and you’re the daughter of a mistress. Even if you return to the Miles family, you’ll always be an illegitimate child. Your mother will always be a mistress, and you’ll always be an illegitimate child!” <br/><br/>“No matter how big your connections become, no matter how high you stand or how famous you get, you’ll always be seen as inferior to others and looked down upon!” Amelia Miles grew more excited as she spoke, “The more famous you become, the more people will know that your mother was a mistress. <br/><br/>Because of you! Even in death, she will be insulted by thousands!” <br/><br/>“Did you have your meal in the bathroom tonight? Your mouth is so filthy!” Anisa suddenly said, “Only someone as dirty as you could have such disgusting thoughts.” <br/><br/>“What are you, and who gave you the right to speak?” Amelia Miles looked at <br/><br/>Anisa, “You’re nothing more than a dog Daisy Zane keeps, go away.” <br/><br/>“What are you?” Anisa said, wanting to step forward, but Daisy Zane held her back. <br/><br/>Daisy Zane handed the clothes in her hand to Anisa, and calmly began to adjust her sleeves. <br/><br/>Amelia Miles poked Daisy Zane’s shoulder again, sneering, “Daisy Zane, can you sleep at night? You sent Olivia Chester and Clarissa Mason to prison, and now my cousin is lying in the hospital, waiting for his sentence to be announced. Doesn’t your conscience feel uneasy? Aren’t you afraid of retribution for all the evil things you’ve done?” <br/><br/>Daisy Zane: [As a nearly forty-year-old man, don’t stay up late. Mind your own business instead of focusing on us twenty-something-year-old ladies.] <br/><br/>Holt Lawrence: [Who knows if you’re really in your twenties, you might be older than me!] <br/><br/>This message was quickly retracted, but Daisy Zane still saw it. <br/><br/>She smiled, put her phone back in her pocket, and entered the elevator with Anisa Cooper. <br/><br/>Amelia Miles sat on the ground for about ten minutes before finally feeling alive again. It felt as if her throat had been cut open, and she didn’t dare swallow. <br/><br/>There were red, swollen fingerprints on her neck, and her hoarse voice <br/><br/>sounded like sandpaper: “Crazy, she’s really crazy, she dares to kill.” <br/><br/>As she muttered to herself, she made a phone call. <br/><br/>Following the arrest of the previous hacker, Amelia Miles quickly found a new one. <br/><br/>“Ferdason Hotel Fl parking lot surveillance.” <br/><br/>“Okay,” the other party said, “Give me a moment.” <br/><br/>Amelia didn’t hang up the phone and kept waiting, but a minute, two minutes went by, and there was still no reply from the other party. <br/><br/>“Isn’t it done yet?” she asked hoarsely, like a rooster, “Does it take this long to check the surveillance?” <br/><br/>“Parking lot surveillance has been hacked.” <br/><br/>“What?” Amelia Miles asked, “Can’t you recover it?” <br/><br/>“Their technology is too advanced,” the person on the other end of the phone said, “There’s no way to recover it.” <br/><br/>“Useless!” Amelia cursed, ending the call and throwing her phone away, “They’re all useless!” <br/><br/>The “Fall of the Quince” was a hit, generating a lot of buzz every day, not only on Facebook but also on various short video platforms with clips from the show. <br/><br/>Amelia Miles took advantage of the show’s popularity and bought a hot search claiming Daisy Zane was an illegitimate daughter. <br/><br/>Paid trolls led the charge, turning one hot search term’s thread into a cesspool of slander, abuse, and humiliation. <br/><br/>Daisy Zane remained silent and didn’t have Hill Dawson intervene. <br/><br/>Harton Clark’s side also tacitly agreed not to let anyone handle it. <br/><br/>The first to handle the matter were the Miles Family. <br/><br/>They paid a large sum to have the hot search removed and to control the comments. <br/><br/>After everything was settled, Johanes Miles sent a message to Daisy Zane: [Lucia, I’ve taken care of the online situation. Focus on filming, and don’t worry about it..]\t\t\t\t\t\t</div>", "images": {}, "success": true}