{"id": 154, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223493.html", "title": "Chapter 154 - 144: Diego Giovanni", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 154 - 144: Diego Giovanni</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 154: Chapter 144: Diego Giovanni <br/><br/>Translator: 549690339 <br/><br/>“Madam, don’t talk nonsense, or you’ll be arrested later.” Allonzo Hobson said, “What kind of young lady would use her own reputation to frame someone? Do you not know what kind of character your son has? Our little Miss isn’t even married yet. If this has any impact on our reputation, we will sue you.” <br/><br/>“Is her reputation more important than my son’s life? My son’s life is at stake.” Mrs. Hobson said, “What good reputation can she have? Birds of a feather flock together. If she dares to kill, they can’t have a good reputation.” <br/><br/>The Hobson Family had already discussed with their lawyers outside the police station. They must hold Daisy Zane responsible for murder. <br/><br/>Attempted murder carries a minimum sentence of three years. As long as she’s jailed, they’ll leave Diego Giovanni to handle the rest, and she won’t get out. <br/><br/>“Ma’am, please watch your language.” The police said. <br/><br/>“So what if she killed him?” Kevin Clark stood beside Daisy Zane and suddenly spoke. <br/><br/>His voice was soft, soft enough to make people feel cold to the heart. The narrow eyes stared at the Hobson couple, as if they could tear them apart in the next second. <br/><br/>The police frowned when they heard his words and were about to warn him. But when they looked at him, his aura choked the words. <br/><br/>Before the police could speak again, Austin Allen had already spoken and immediately cooperated with Kevin Clark, saying, “According to Article 20, Section 3 of the “Criminal Law”: If a person defends against someone who is committing violent crimes such as murder, robbery, rape, kidnapping, and other serious threats to personal safety, and the wrongful intruder is injured or killed, it does not constitute excessive defense and is not held criminally responsible.” <br/><br/>Austin Allen immediately brought the focus to Daisy Zane’s legitimate defense. And the opposing lawyer also immediately followed his thoughts. <br/><br/>“Lawyer Allen, judging from the multiple injuries on Benjamin Hobson, Miss Zane’s defense has been excessive.” the opposing lawyer said. <br/><br/>Austin Allen smiled slightly, “Lawyer Richie, only having excessive defense or only having excessive results does not constitute excessive defense.” Updated from novelb(i)n.c(o)m<br/><br/>“Isn’t that excessive results?” Mr. Hobson said harshly. <br/><br/>“Of course not.” Austin Allen replied, “According to the injury report, it won’t cause his death or disability. Besides, do you have any evidence that Daisy Zane’s defense was excessive?” <br/><br/>“Aren’t the injuries on my son’s body evidence?” Mr. Hobson didn’t fear Allonzo <br/><br/>Hobson and his group at all. Diego Giovanni had already agreed. As long as Diego Giovanni confirmed it, he believed that Allonzo Hobson wouldn’t risk taking action for a little girl. <br/><br/>Those young masters were just looking for novelty and fun. Each of them was clever and wouldn’t unnecessarily cause trouble for celebrities and young girls. <br/><br/>“What kind of evidence is that? What if he was unlucky and fell? Should the blame still be on us?” Allonzo Hobson said. <br/><br/>“Young Master Hobson, the injury report clearly states that the injuries on Benjamin Hobson were caused by artificial harm,” Lawyer Richie said. <br/><br/>“Is there any evidence that Daisy Zane did it?” Allonzo Hobson insisted on being shameless till the end. <br/><br/>Austin Allen adjusted his glasses without speaking. Since the other side started to shamelessly argue for legitimate defense, they had no choice but to be shameless too. <br/><br/>“You guys...” <br/><br/>“We have a witness, the driver who called the police. He was there the whole time,” Lawyer Richie said. <br/><br/>“We’ve already questioned earlier, the driver didn’t see anything,” The police said, “When we arrived at the scene, the driver’s location indeed couldn’t see anything inside the alley.” <br/><br/>“Alley?” Austin Allen questioned. <br/><br/>Lawyer Richie helped Mrs. Hobson and quickly whispered to them, “They have no evidence of intentional murder. As long as that girl changes her statement, the rape charge will not stand.” <br/><br/>In short, they would stop talking today and find a time for Naomi Nelson to change her statement, saying that she was willingly involved with Benjamin Hobson. <br/><br/>“What happened?” The police rushed over to check. “Call an ambulance quickly.” <br/><br/>Naomi Nelson thought Mrs. Hobson was really in trouble, and her face turned pale again. Daisy Zane saw her fear and pulled her back, making her sit down. <br/><br/>“Lucia...she...” <br/><br/>“It’s okay.” Daisy Zane said, “Don’t worry, just watch it.” <br/><br/>Allonzo Hobson came over and put his hand on Naomi Nelson’s shoulder: <br/><br/>“Naomi, don’t be afraid, we have so many people here. What could go wrong?” <br/><br/>Daisy Zane looked at his arm, “Take your hand off.” <br/><br/>Allonzo Hobson quickly removed his arm and laughed, “Brook Sister, don’t scare me.” <br/><br/>On the other side, Austin Allen looked at their family, his face unchanged, and said softly, “Since this lady is unwell, let’s have Lawyer Richie stay.” <br/><br/>The door of the interrogation room was pushed open again. Everyone looked at the entrance, only to see Diego Giovanni wearing a police uniform, standing solemnly at the door. <br/><br/>“Deputy Director Giovanni...” William called out first. <br/><br/>Uncle and Mrs. Hobson were all at the entrance, so Diego Giovanni saw the messy scene as soon as he opened the door. He asked with a straight face, “What happened?” <br/><br/>Seeing him, Uncle Horton felt like he had seen a savior. However, he only exchanged glances with Diego Giovanni and made no move. <br/><br/>Diego Giovanni’s memory was outstanding, and he recognized Uncle Horton instantly. He walked over and looked at Mrs. Hobson, “What happened to her?” <br/><br/>“She suddenly fainted.” After Uncle Horton finished, he lowered his voice, and said in a volume only they could hear, “Deputy Director Giovanni, we have an issue. I need two days.” <br/><br/>“What do you need the time for?” <br/><br/>“Their words are very unfavorable to us.” Uncle Horton trusted Mr. Santiago too much, and he had a sense of dependence on Diego Giovanni, so he told him everything without any precautions. <br/><br/>“You want them to change their statements?” <br/><br/>Uncle Horton didn’t nod, but from his gaze, it was clear that he admitted it. <br/><br/>Diego Giovanni’s expression remained unchanged from beginning to end, but he thought to himself, some people really dared to ask him to do such a thing. Should he praise them for being stubborn or call them brainless? Diego Giovanni looked at Mrs. Hobson again, “What’s wrong with her?” “It’s okay. It’s okay.” Uncle Horton said, “It’s just a helpless move.” <br/><br/>“What’s going on? They found the Vice Bureau Chief.” Allonzo Hobson whispered, “Where is Bureau Chief Hamilton?” <br/><br/>“He went to a meeting in another city,” Juan Wright said. <br/><br/>Allonzo Hobson: “......lt’s fine, it’s a small matter. No matter how big their power is, can it be bigger than Third Master’s?” <br/><br/>Kevin Clark ignored them and turned his gaze back to Daisy Zane after looking at Diego Giovanni’s side. <br/><br/>He just happened to see Daisy Zane looking at the group of people on their side and laughing lightly.\t\t\t\t\t\t</div>", "images": {}, "success": true}