{"id": 150, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223485.html", "title": "Chapter 150 - 140: We Are Not Compatible", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 150 - 140: We Are Not Compatible</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 150: Chapter 140: We Are Not Compatible <br/><br/>Translator: 549690339 <br/><br/>“You’re at home. That’s rare.” <br/><br/>When Kevin Clark got home, he walked into the living room and saw Natalie Wayne winding yarn, with Hugo Clark acting as a tool, holding the yarn for her with both hands. <br/><br/>Hugo Clark heard the sound, glanced at him, and then calmly called out, “Third <br/><br/>Uncle. ” <br/><br/>Kevin Clark glanced at him but didn’t respond. <br/><br/>When Natalie saw him coming back, her eyes lit up. But she only looked at him for a moment before craning her neck to look behind him. <br/><br/>Kevin Clark took off his coat and handed it to a servant nearby, smiling, “Mom, what are you looking at?” <br/><br/>“Did you come back alone?” <br/><br/>“When have I ever not come back alone?” <br/><br/>“Where’s my daughter-in-law?” Natalie stared at him and said, “What are you coming back alone for? I called you back to see my daughter-in-law!” “So... am I out of favor in this house?” Kevin Clark said amusingly. <br/><br/>Natalie gave him a glare and ignored him. <br/><br/>Kevin Clark washed his hands and sat across from them, “Mom, you’ll see her sooner or later, no need to be anxious right now.” <br/><br/>“So I won’t be able to hold my grandson before the New Year?” <br/><br/>“Mom, you already have grandsons and granddaughters. I think you can consider holding your great-grandson before the New Year.” Kevin Clark looked at Hugo Clark. <br/><br/>Although there was a smile on his face, it was the kind that made people feel alarmed. <br/><br/>Hugo Clark raised his eyes to meet his gaze, a stern expression on his face. He also looked quite intimidating. <br/><br/>“Hugo, hurry up a bit, there’s still time.” <br/><br/>“Third Uncle has a girlfriend, so his progress should be quicker.” Hugo Clark glanced at the bracelet on his wrist and counterattacked. <br/><br/>Kevin Clark raised his eyebrows, “That’s true, I have a girlfriend.” <br/><br/>Then he changed to an elder’s tone, “Hugo, you’re not getting any younger. You should take care of your personal matters too. As your third uncle, I’m worried about you.” <br/><br/>“No need for Third Uncle to worry.” Hugo Clark said. <br/><br/>“If you had gotten married at a normal age, our family would have had four generations living together by now.” <br/><br/>Hugo Clark: ‘ <br/><br/>Natalie Wayne was winding the yarn to the side, as if she had directly blocked the two out of her sight, neither hearing their voices nor seeing the tense atmosphere between them. <br/><br/>It seemed she was used to it. <br/><br/>Only when he stopped talking did Kevin Clark look at Natalie and ask, “Where’s my father?” <br/><br/>“In the North Court front hall.” Natalie took a glance at him and said, “Henry Clark is here.” <br/><br/>Kevin Clark’s expression paused for a moment, “Why did he come?” <br/><br/>Henry Clark was his father’s younger brother, sharing the same father but different mothers. He was more than twenty years younger than his father. He would have to call him Second Uncle, and Hugo Clark would have to call him Grandfather. <br/><br/>But more than ten years ago, he was sent abroad by his father and had never returned since. <br/><br/>“He said he was held up during the Chinese New Year, so he came to see everyone.” Natalie explained. <br/><br/>Kevin Clark exchanged a glance with Hugo Clark, then stood up and said, “I haven’t seen this Second Uncle for a long time. I’ll go see how he’s still alive.” <br/><br/>Benjamin Hobson chuckled inwardly, thinking that she would bring herself up without him making a move. What a flirt. <br/><br/>“Are you filming here?” Benjamin Hobson asked. <br/><br/>Daisy Zane looked at him coldly and slowly uttered three words: “Speak properly.” <br/><br/>Feeling a bit rushed, Benjamin Hobson’s smile on his face became even more frivolous: “Miss, are you alone tonight? So am I.” <br/><br/>“What do you want?” Anisa stepped in front of Daisy Zane. <br/><br/>Benjamin Hobson glanced at Anisa, who was also quite good-looking. But compared to Daisy Zane, she was far worse. <br/><br/>Despite Anisa being half a head taller, Daisy Zane locked eyes with Benjamin <br/><br/>Hobson: “Yes, indeed, alone.” <br/><br/>The smile on Benjamin Hobson’s face deepened: “Then... tonight... Miss, would you like to...” <br/><br/>Benjamin paused for a moment and then thought of a word that sounded elegant and romantic: “spend the night with me?” <br/><br/>Anisa rolled her eyes. <br/><br/>Daisy Zane wore a mask, and with her make-up removed at the drama crew, her hair was casually tied, a bit messy. Her phoenix eyes had no make-up, the corners lifted upward, indifferent, and coldly beautiful. <br/><br/>She didn’t speak but glanced at the floor number – the 12th floor. She pressed the button for the 14th floor and pulled Anisa to stand behind her. <br/><br/>“Daisy...” <br/><br/>Daisy Zane squeezed Anisa’s hand to reassure her. <br/><br/>Watching her actions, Benjamin Hobson chuckled: “So the miss has a secret place all to herself.” <br/><br/>After he finished his sentence, the elevator door opened on the 14th floor. Daisy Zane looked outside and gestured for the man to go out first. <br/><br/>Benjamin Hobson smirked ambiguously and walked out. <br/><br/>But as soon as he took a step out, Daisy Zane kicked him out with her foot. With that force, Benjamin Hobson fell straight on the floor outside the elevator. <br/><br/>“Damn it! What the f– -... Benjamin Hobson’s chin rubbed against the floor, leaving a faint bloody mark. <br/><br/>Anisa was startled and saw the man getting up. As soon as she reacted, she quickly pressed the close button, afraid that he would hit Daisy Zane after getting up. <br/><br/>But Daisy Zane held the elevator and looked at him. <br/><br/>The fierceness in her eyes made Benjamin Hobson, who had just stood up, freeze in place, and he swallowed the curse words he wanted to say. <br/><br/>“Don’t come to disgust me again.” The lazy voice carried an immeasurable disdain. <br/><br/>Benjamin Hobson’s chest heaved a bit, as did his legs. <br/><br/>Clearly, he was angered by her words but afraid to make a move. <br/><br/>“Did you hear me?” Daisy Zane said again. Just a light, fluttering sentence, but it was as sharp as a knife. <br/><br/>“Yes, yes, I heard.” Benjamin Hobson instinctively answered her. <br/><br/>Getting a response, Daisy Zane let go of the elevator. The door slowly closed and went up. <br/><br/>Anisa breathed a sigh of relief as well, standing behind Daisy Zane and peeking at her. Her eyes were full of admiration, like stars. <br/><br/>Daisy Zane checked the time on her cell phone, and then sent a message to Holt Lawrence: [Ferdason Hotel, East Side Elevator, 14th-floor surveillance, less than a minute ago, clean it up.] <br/><br/>On the 14th floor, Benjamin Hobson watched the elevator go up. After being stunned for a while, he kicked the trash can next to him. <br/><br/>“Damn! Bitch! What purity are you pretending?! Sooner or later, I’ll get you in my hands.” <br/><br/>“Hiss—” He cursed, touched his chin, and then rubbed his knee, “It hurts like hell.. Damn it!”\t\t\t\t\t\t</div>", "images": {}, "success": true}