{"id": 152, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223489.html", "title": "Chapter 152 - 142: The Hobson Group Couple Comes To Truro City", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 152 - 142: The Hobson Group Couple Comes To Truro City</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 152: Chapter 142: The Hobson Group Couple Comes to Truro City <br/><br/>Translator: 549690339 <br/><br/>After the police arrived, Daisy Zane, Anisa Cooper, and the driver who drove Benjamin Hobson were all taken back to the police station. <br/><br/>Due to severe injuries, Benjamin Hobson was sent to the hospital, and the Hobson couple rushed to the hospital overnight from the Imperial Capital after getting the news. By the time they arrived, Charles Hobson and Johanes Miles were already at the hospital. <br/><br/>“What happened? What’s going on?” Mrs. Hobson’s eyes were red, and her fingers were trembling, “How is Benjamin? How is he doing?” <br/><br/>“Sister-in-law, don’t worry first. Benjamin is not in critical condition, but he is severely injured.” Charles Hobson said, holding her hand. <br/><br/>“How is he doing?” Uncle Horton asked again. <br/><br/>“Two broken ribs, lost two teeth, right wrist dislocation,” Charles Hobson said, “also, a moderate concussion. There’s a wound on the head, it was stitched up with five stitches. The doctor said he lost a lot of blood.’ <br/><br/>As she spoke, Johanes Miles didn’t say a word on the side, and his expression was quite serious. <br/><br/>Listening to this, Mrs. Hobson burst into tears. <br/><br/>Uncle Horton’s face tightened, and his expression was serious. No matter how mischievous his son was, he was still his son. He naturally felt heartache seeing him suffer such serious injuries. <br/><br/>“Sister-in-law, stop crying,” said Charles Hobson. “Benjamin has come out of the rescue room and is now in the ward. Let’s go see him.” The four immediately went to the ward together. <br/><br/>Benjamin Hobson was conscious but couldn’t move on the bed. <br/><br/>Only his eyes and mouth could move. <br/><br/>The left side of his face was swollen to the size of a fist, even his lips were swollen. The wound on his head must also be swollen, but it was wrapped in gauze like it was wrapped very thickly. <br/><br/>The injuries in other places couldn’t be seen because they were covered with a <br/><br/>quilt. <br/><br/>“Benjamin, Benjamin.” Mrs. Hobson laid on the bed crying, wanting to touch her son’s face but not knowing where to start, in the end, she could only hold his hand, “Benjamin, does it hurt a lot?” <br/><br/>Benjamin looked at his parents and struggled to open his lips and make a sound: “Dad...Mom... It’s, it’s Daisy Zane, it’s Daisy Zane, it’s Daisy Zane.” <br/><br/>He kept repeating this sentence laboriously. <br/><br/>“Who? Daisy Zane?” Uncle Horton asked. <br/><br/>“It’s her, it’s her.” Benjamin Hobson said, “Dad, you help me kill her, kill her.” The Hobsons both turned to look at Mr. and Mrs. Jasper. <br/><br/>Johanes Miles always held a grim face, without any superfluous expression. Charles Hobson nodded and said: “Daisy Zane is now at the police station.” <br/><br/>“Johanes, your good daughter really has some skills, to beat someone up like this. Is she a bandit? A robber?” Uncle Horton said. <br/><br/>All these years, Uncle Horton always talked to Johanes Miles in this tone. It’s more like Johanes Miles had gradually ignored it and didn’t take it to heart anymore, instead of being used to it. <br/><br/>The Hobson couple arrived at the entrance of the police station but didn’t go in immediately. Instead, they waited for news from Mr. Santiago. When they received the news that Diego Giovanni would arrive at the police station soon, they, along with their attorney, entered the station. <br/><br/>At the time of their entry, Daisy Zane, Anisa Cooper, and the driver were all sitting in the interrogation room. <br/><br/>Daisy Zane and Anisa Cooper were seated on a long bench. Daisy Zane was leaning against the chair with her eyes closed, the zipper of her down jacket pulled up completely. Her hands were tucked into her pockets, she was wearing cotton slippers and pajama trousers. <br/><br/>Her posture seemed quite relaxed. <br/><br/>But Anisa Cooper, sitting beside her, didn’t seem to be feeling good. Sitting upright, her eyes swollen from crying, she was glaring at the driver sitting in front of them, her gaze empty yet fierce. One of her hands was being held by Daisy Zane and kept warmed inside her pocket. <br/><br/>Two hours ago, after being questioned by the police, Daisy Zane had called her lawyer. <br/><br/>But the lawyer was in the Capital, and it would take him at least two more hours to get there. <br/><br/>No one came from the other side, so they continued to wait inside. <br/><br/>What they didn’t know was that, two hours ago, Harton Clark had also received the news and was rushing over. <br/><br/>When Daisy Zane and Anisa Cooper were brought to the police station, William saw them. <br/><br/>He asked a few brief questions, and then immediately called Juan Wright. After Juan Wright knew, he immediately informed Harton Clark. <br/><br/>While everyone was waiting in silence, the door to the interrogation room was opened. <br/><br/>Anisa Cooper suddenly looked towards the entrance, swallowing nervously. <br/><br/>“Daisy Zane, I am going to kill you!” When Mrs. Hobson came in and saw Daisy Zane, she strode forward intending to hit her. <br/><br/>But she was promptly stopped by the police. <br/><br/>Daisy Zane slowly opened her eyes and glanced at Mr. and Mrs. Hobson, as well as the lawyer behind them. <br/><br/>She took a brief look at them and then retreated her gaze, tightly holding Anisa Cooper’s cold hand. <br/><br/>“Daisy Zane, have you any respect for the law? What’s happened to my son? You hit him so viciously. Were you trying to kill him?” Mrs. Hobson cried and yelled. <br/><br/>Daisy Zane held Anisa Cooper’s fingers as if she hadn’t heard her, not lifting her eyes in the slightest. <br/><br/>“Miss Zane...” <br/><br/>“Wait for my lawyer.” <br/><br/>The lawyer behind them immediately came forward as he heard and said formally, “Hello, Miss Zane. I am Benjamin Hobson’s lawyer...” <br/><br/>Daisy Zane looked up at him, her gaze cold and ruthless. She wasn’t in the mood to waste too many words at the moment. <br/><br/>She had just explained everything to the police and would have to repeat all of it with the lawyer who would arrive in a while. <br/><br/>She didn’t have the patience to keep repeating the same thing over and over again. <br/><br/>“Can’t you understand? Wait for my lawyer..”\t\t\t\t\t\t</div>", "images": {}, "success": true}