{"id": 153, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223491.html", "title": "Chapter 153 - 143: Heading To Truro City", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 153 - 143: Heading To Truro City</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 153: Chapter 143: Heading to Truro City <br/><br/>Translator: 549690339 <br/><br/>Truro Airport <br/><br/>Kevin Clark and Allonzo Hobson hurriedly walked out. Read latest chapters at novelhall.com Only<br/><br/>As they came out of the airport, they happened to see someone else walking out as well, looking quite anxious. <br/><br/>Allonzo Hobson glanced at the person and, upon seeing his face, his eyes lit up for a moment: “Lawyer Allen?” <br/><br/>The man next to him heard someone calling him and turned his head to look. <br/><br/>After seeing Kevin Clark and Allonzo Hobson, he hesitated for a moment before saying, “Third Master, Young Master Hobson.” <br/><br/>Lawyer Allen, whose full name is Austin Allen, is an elite lawyer in the Imperial Capital. So far, he has never lost a case. <br/><br/>Since they had run into each other, there was no need not to make use of him. Allonzo Hobson asked, “Is Lawyer Allen here on business in Truro City? Is it urgent?” <br/><br/>Austin Allen wore gold-rimmed glasses and a grey suit, carrying his coat in his hand. He looked refined and gentlemanly. When he spoke, the corner of his mouth always carried a gentle smile, “It’s fine.” <br/><br/>“We have an urgent matter,” Allonzo Hobson said. “Since your matter is fine, take care of ours first. <br/><br/>“Young Master Hobson, I’m sorry. Although the matter is not urgent, my client is in the Police Station...” “Truro Police Department?” <br/><br/>“Yes.” <br/><br/>Kevin Clark turned his head to glance at him. <br/><br/>Allonzo Hobson grabbed his arm and said, “Great, we’re going to Truro Police <br/><br/>Department too. Let’s go together. You can handle both matters at once.” <br/><br/>Austin Allen stumbled a step as he was pulled and adjusted his glasses before saying, “Alright then.” <br/><br/>Inside the police station, due to Daisy Zane’s refusal to communicate, the two groups of people could only wait in the interrogation chamber. <br/><br/>About twenty minutes later, the door to the interrogation room was knocked, and a police officer came in and said, “Lady Zane’s lawyer has arrived.” <br/><br/>The Hobson couple and their lawyer stood up, all looking prepared for battle with a determined air. <br/><br/>After the police officer outside the door finished speaking, Austin Allen entered the interrogation chamber. He glanced around courteously and said, “I am Lady Zane’s lawyer, Austin Allen.” <br/><br/>Upon finishing this sentence, not only did the people inside the interrogation room freeze, but even Kevin Clark, Allonzo Hobson, and Juan Wright, who were about to enter the room, stopped in their tracks. <br/><br/>Kevin Clark didn’t look at the others, instead focusing his attention on Daisy Zane. Seeing her wearing pajama pants and slippers, he frowned. <br/><br/>His eyes deepened, especially when he saw the red mark on her neck. <br/><br/>He took off his coat and draped it over Daisy Zane’s legs, touching her hand while doing so. It was very cold, as if it penetrated the bone. <br/><br/>“Comrade Police, you must uphold justice for us.” Mrs. Hobson suddenly cried. “My son was fine when he called me last night. Now he’s lying in the hospital, unable to move. He’s injured all over. Daisy Zane is trying to take his life.” <br/><br/>Austin Allen adjusted his glasses and said softly, “Ma’am, you said your son was in the hospital unable to move. Do you have any evidence?” <br/><br/>The Hobson family’s lawyer immediately stepped forward and placed a report on the table in front of everyone: “Lawyer Allen, this is the injury report for Daniel Horton.” <br/><br/>Austin Allen picked it up and looked at it, with Allonzo Hobson and Juan Wright also taking a glance. <br/><br/>As they saw the words broken ribs, lost teeth, and concussion on the report, Allonzo Hobson and Juan Wright looked at each other, and both saw a sense of admiration in the other’s eyes. <br/><br/>“What’s your name?” Austin Allen asked the lawyer after looking at the report. <br/><br/>“Cash.” <br/><br/>Austin Allen politely smiled at him and then turned to look at Daisy Zane and asked, “Lucia, what caused the conflict?” <br/><br/>Normally, he should have talked to Daisy Zane privately to understand the situation first, but since the other party was in a hurry, it didn’t matter to start directly. <br/><br/>After all, Daisy Zane would cooperate with him. <br/><br/>This addressed caused Kevin Clark to give him a glance. <br/><br/>Daisy Zane sat down, casually looked at the couple and the lawyer, and said slowly, “He attempted murder.” <br/><br/>“You’re talking nonsense!” Mrs. Hobson said, “Don’t slander people. Do you have any evidence?” <br/><br/>“The fingerprints on the dagger found by the police belong to your son.” Daisy Zane then pointed to the bloodstain on her neck and continued, “This wound here is also evidence.” <br/><br/>Kevin Clark looked at the wound, and a storm seemed to pass through his eyes. A terrifying storm was brewing. <br/><br/>“With just that little skin-breaking wound, you want to accuse my son of attempted murder? Do you think everyone else is a fool?” <br/><br/>“Luckily, it’s only a skin-breaking wound. If it had been one centimeter deeper, your son would be in the interrogation room being questioned.” Austin Allen’s speech was slow and his tone was calm, but every word was powerful. <br/><br/>“Henry Horton’s use of the knife was self-defense during the assault.” Lawyer Richie argued, “Lady Zane’s injury doesn’t even count as a minor injury...” <br/><br/>Anisa Cooper stood up after hearing their attempts to shift the blame and said, “Henry Horton not only intended to kill, but he also tried to force me to have sex with him first. Lucia came to my rescue in time and saved me, so he wanted to kill her.” <br/><br/>“You little girl, don’t slander people with your empty mouth.” Mrs.. Hobson pointed and scolded her, “You’ll be held legally responsible for talking nonsense here!”\t\t\t\t\t\t</div>", "images": {}, "success": true}