{"id": 151, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223487.html", "title": "Chapter 151 - 141: Benjamin Hobson Gets Tragically Cleaned Up", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 151 - 141: Benjamin Hobson Gets Tragically Cleaned Up</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 151: Chapter 141: Benjamin Hobson Gets Tragically Cleaned Up <br/><br/>Translator: 549690339 <br/><br/>“Daisy, here’s your water.” <br/><br/>Daisy Zane had just finished discussing the next scene with the director. Anisa Cooper noticed her pale face and handed her water. <br/><br/>She took a sip and realized it was brown sugar water, and gave Anisa a glance. <br/><br/>“I just bought it,” Anisa whispered, “Daisy, your period is so irregular, it’s more than two weeks early this time.” <br/><br/>Daisy Zane took another sip of the brown sugar water. She wanted to say that her period was already very regular. It had been going on for a long time without missing a month. <br/><br/>There used to be months when it didn’t come at all. <br/><br/>Now that it’s finally not coming, it starts happening every month again. <br/><br/>“Daisy, is it very painful? Your face looks bad.” <br/><br/>“No,” Daisy Zane said, “Luckily, my character in this scene doesn’t require a good complexion.” <br/><br/>“Should I go back to the hotel and get you some painkillers?” Anisa suggested. “No need, ” Daisy Zane drank all the brown sugar water and handed the glass back, “We have three scenes left to shoot today. I’ll take them when we’re done. I’m fine. <br/><br/>After saying that, Daisy Zane went to continue filming. <br/><br/>After finishing the three scenes, they returned to the hotel around 9:00 PM. <br/><br/>Daisy Zane went back to the hotel, washed up, and went to bed. Anisa waited until she was asleep before going to her own room. nove(l)bi(n.)com<br/><br/>As soon as she got to her room, she received a call from the driver. <br/><br/>The driver’s wife suddenly went into labor early, and he had to go back immediately. He definitely couldn’t make it back tomorrow, so he needed to leave the nanny car key behind. <br/><br/>The driver had already mentioned this to Daisy Zane, saying that he might need to take a few days off. Daisy agreed at the time, but didn’t expect labor to come so suddenly. <br/><br/>He was in a hurry, so he called a taxi and rushed out. After several miles, he realized that the car key was still with him, and hurriedly asked Mr. Driver to turn back to the hotel. <br/><br/>Anisa heard this and immediately went downstairs to get the car key. <br/><br/>The driver’s legs were so weak from nervousness that he couldn’t even get out of the car. Anisa had to run over to the taxi to get it. <br/><br/>After getting the car key, Anisa watched their car leave before turning to walk back to the hotel. <br/><br/>However, after taking only two steps, a black car suddenly stopped at the entrance. <br/><br/>The tires screeched loudly against the pavement as the car stopped abruptly. Anisa was startled and reflexively looked back. <br/><br/>But before she could get a clear look, the back door of the black car was pulled open, and she was dragged into the car. <br/><br/>After taking the painkillers, Daisy Zane fell asleep. <br/><br/>But she was soon awakened by her ringing cell phone. <br/><br/>In the silent darkness of night, the ringing sounded like a heavy blow against the quiet. <br/><br/>Daisy Zane opened her eyes, picked up her cell phone, and saw that the call was from Anisa Cooper. Her heart sank. <br/><br/>She immediately answered the call. Before she could say anything, the other side spoke first. <br/><br/>A panicked and urgent shout: “Daisy! I’m at the back of the hotel...” <br/><br/>Before finishing the sentence, with accompanying angry yelling, chaos, and Anisa’s screams, the call was disconnected. <br/><br/>Anisa hugged Daisy Zane tightly and cried incessantly. <br/><br/>Daisy Zane comforted her, waiting for her to catch her breath a little. She let her go, buttoned her blouse and straightened her clothes. <br/><br/>Then she picked up her coat from the bottom of the car seat and draped it over her. <br/><br/>“Don’t cry anymore.” Daisy Zane’s voice was still devoid of any warmth, even colder than usual, but it gave a sense of security. <br/><br/>She wiped the tears from Anisa’s face and said, “Sit here for a while, and we’ll be back soon.” <br/><br/>“Okay.” <br/><br/>Daisy Zane got out of the car and Benjamin was still sitting by it. <br/><br/>His belt was undone and the buttons and zippers on his pants were open. <br/><br/>She walked slowly over to him and just grabbed his collar. The look on Benjamin’s face turned fierce, and a spring knife suddenly appeared in his hand, stabbing straight at Daisy Zane. <br/><br/>Daisy Zane tilted her head in the nick of time, calculating the distance as the knife brushed against her neck, leaving a shallow cut on her fair skin. <br/><br/>She achieved her goal, raised her hand to grab his wrist, and twisted it forcefully. <br/><br/>With a crisp sound, the spring knife fell to the ground, and Benjamin screamed. <br/><br/>The driver in the distance was startled by the scream. Enduring the sharp pain in his body, he shivered as he took out his cell phone and called the police. <br/><br/>“Hello, police? There’s a murder happening here. Help, help!” The driver was so scared that he couldn’t speak fluently anymore. <br/><br/>On this end, Daisy Zane grabbed the man’s collar and lifted him up, walked a few steps to the side, and threw him against the wall. <br/><br/>Benjamin had never been beaten like this before, with blood all over his face and his wrist dislocated. His chest heaved rapidly, each breath as painful as a stab to his heart. <br/><br/>“Didn’t I say, don’t disgust me again in front of my eyes?” Daisy Zane kicked him one more time. <br/><br/>Benjamin was directly kicked a meter away, and as he saw Daisy Zane step closer to him, he shouted, “Daisy Zane, Daisy Zane... I’m Benjamin, I’m <br/><br/>Benjamin.” <br/><br/>Daisy Zane stopped beside him and looked down at him. <br/><br/>“I’m from the Imperial Capital Hobson Family, my uncle is Johanes Miles.” <br/><br/>Benjamin endured the pain, “Our families are related, we’re related.” <br/><br/>Daisy Zane listened to him, snorted with a laugh, and stepped on his fingers, <br/><br/>“Charles Hobson, relying on the power of the Hobson Family, interfered in Johanes Miles’ marriage. The person I hate most is her, so since you’re his nephew, let’s pay you back too.” <br/><br/>“It was clearly your mother who interfered in my aunt’s marriage... Ah!” <br/><br/>Daisy Zane kicked him again in the ribs, and Benjamin let out a miserable scream. <br/><br/>And then, another kick to his face—this time, he didn’t make a sound, spitting out blood and losing a tooth. <br/><br/>When she was about to hit him again, Anisa suddenly ran over and hugged <br/><br/>Daisy: “Daisy, enough, let it go. If you keep hitting him, he’ll die.” <br/><br/>Daisy Zane looked down at Benjamin, as if looking at some insect, “What’s the use of keeping such a cheap life?” <br/><br/>Benjamin, lying on the ground, trembled in pain. Blood, sweat, and tears mixed with the dirt on the ground, covering his face, making him look incredibly pathetic. <br/><br/>Anisa hugged Daisy Zane tighter, crying, “Daisy, please stop hitting him, I’m scared, I’m scared!”\t\t\t\t\t\t</div>", "images": {}, "success": true}