{"id": 155, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223495.html", "title": "Chapter 155 - 145: Settled", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 155 - 145: Settled</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 155: Chapter 145: Settled <br/><br/>Translator: 549690339 <br/><br/>After understanding the situation, Deputy Director Giovanni stepped back from the crowd. Uncle Horton immediately stood up, his expression changing as if a different person had taken over his body. <br/><br/>The look on his face was one of triumph. It was as if he could obliterate Daisy <br/><br/>Zane and her group at any time. <br/><br/>Deputy Director Giovanni looked at Austin Allen first. <br/><br/>Austin maintained his polite smile in the face of the stern expression, but chose to ignore him, considering him to be on the Hobson Family’s side. <br/><br/>Or perhaps, he didn’t think he was worthy of the title “Deputy Director”. <br/><br/>Deputy Director Giovanni didn’t engage with him either. After looking at him, he turned his attention to the others behind him. <br/><br/>Standing about three meters apart, Deputy Director Giovanni’s gaze met Daisy Read latest chapters at novelhall.com Only<br/><br/>Zane’s. <br/><br/>Daisy glanced at him in a relaxed manner, her expression half-smiling. <br/><br/>For a moment, Deputy Director Giovanni hesitated, and although his face remained expressionless, it was evident that he paused for a second. <br/><br/>Kevin Clark thought that this was probably the most significant change in expression he’d seen from him since they first met. <br/><br/>Deputy Director Giovanni hesitated for two seconds, and then his gaze fell on Daisy’s neck. <br/><br/>There was a thin, dried cut on her neck, which was particularly noticeable on her pale skin. <br/><br/>He squinted his eyes and asked William in a deep voice, “What happened?” <br/><br/>At first, he had thought about giving face to the Yue family and proceeding in a normal manner, without holding any grudges over the fact that they’d contacted someone who had interfered with the police investigation. <br/><br/>But now... <br/><br/>Deputy Director Giovanni’s face darkened a few shades. <br/><br/>William quickly recounted the entire incident, without taking sides, just describing the events as they happened. <br/><br/>As he spoke, Uncle Horton kept his eyes fixed on Daisy Zane, full of confidence. As long as they could deal with her, they could avenge Daniel and resolve the issue with Jordan Ashton. <br/><br/>Lawyer Richie’s face was also flushed with excitement. Although he was trying hard to suppress it, his emotions still seeped through. <br/><br/>If he could get the girl to change her statement within two days, he would be the first person to defeat Austin Allen and make a name for himself in the legal profession. <br/><br/>Once William had finished speaking, Deputy Director Giovanni went to review the surveillance footage. After watching it, he looked at Anisa Cooper and asked, “Do you know Daniel Horton?” <br/><br/>Anisa shuddered, and immediately stood up, her posture stiff. <br/><br/>Uncle Horton and Lawyer Richie’s faces changed when they heard him suddenly asking Anisa. <br/><br/>What was going on? Weren’t they supposed to stall and let them leave first? <br/><br/>“Deputy Director Giovanni...” Uncle Horton called out before Anisa opened her mouth to speak. <br/><br/>But Deputy Director Giovanni ignored him. <br/><br/>“You’re framing my son!” Mrs. Hobson suddenly lunged forward, trying to snatch the material from Diego Giovanni’s hand. <br/><br/>William, quick as lightning, restrained her: “Be honest!” <br/><br/>After reading it, Diego Giovanni frowned, “Such a big thing, why didn’t anyone report it?” <br/><br/>“The girl was from a single-parent family, and her mother went crazy after her death,” Juan Wright said. <br/><br/>Diego Giovanni turned another page and suddenly saw the logo of Celestial Pivot Detective Agency in the lower-right corner of the last page. <br/><br/>He gave Juan Wright another look. <br/><br/>Juan raised his eyebrows. <br/><br/>His boss, Third Master, heard that Daisy Zane was taken to the police station for hitting Benjamin Hobson and didn’t use him; he went straight to Celestial Pivot to buy information about Benjamin Hobson. <br/><br/>And Celestial Pivot responded quickly this time, directly revealing this significant matter. With just this one incident, Benjamin Hobson could be sentenced to death. <br/><br/>From the beginning, Kevin Clark never intended to use the current case to deal with Benjamin Hobson. He only wanted to clear Daisy Zane of any charges here. <br/><br/>Then... No matter what, Benjamin Hobson would not be let off easily. <br/><br/>If Celestial Pivot could investigate matters related to him, he would never come out again. <br/><br/>If they couldn’t, then he had his ways of making him disappear. <br/><br/>Diego Giovanni looked at the materials in his hand, an incident from two years ago. With no one even reporting the case, only Celestial Pivot could investigate such thorough details. <br/><br/>They even found out that Benjamin Hobson was afraid that the girl’s mother was faking her insanity and planned to harm her mother. <br/><br/>Not only were the details of the incident provided, but there were also clear pieces of evidence. <br/><br/>“Is Benjamin Hobson in the hospital?” <br/><br/>“Yes,” William said. <br/><br/>“You go to the hospital right now,” Diego Giovanni handed the material to William. <br/><br/>“Yes.” <br/><br/>William took the materials and went outside to call someone. <br/><br/>Mrs. Hobson wanted to follow, but her legs gave out, and she collapsed onto the ground directly. <br/><br/>“I’m Daisy Zane’s lawyer, Austin Allen.” Austin Allen suddenly spoke up, his smiling face gone, replaced by a serious expression, “For that girl... I’ll be her lawyer.” <br/><br/>He looked at the Hobson couple, “Unlimited free service until the perpetrator is sentenced to death.” <br/><br/>Hearing this, Mr. Hobson seemed to age decades overnight, barely staying upright by supporting himself on a nearby table. <br/><br/>His mind was a complete blank, the more he wanted to think of a solution, the more it was blank. <br/><br/>Daisy Zane was satisfied with this result. She picked up her clothes from her lap, handed them to Kevin Clark, and stood up, “Let’s go back. I have a show to shoot tomorrow morning.” <br/><br/>“Okay,” Kevin Clark said. <br/><br/>“Lucia, you go back first. I’ll stay and deal with the aftermath,” Austin Allen said. <br/><br/>“Hmm.” Daisy Zane glanced again at Diego Giovanni, their eyes meeting for a brief moment before she looked away and left..\t\t\t\t\t\t</div>", "images": {}, "success": true}