{"id": 160, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223505.html", "title": "Chapter 160 - 150: Little Charles Amos Appears", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 160 - 150: Little Charles Amos Appears</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 160: Chapter 150: Little Charles Amos Appears <br/><br/>Translator: 549690339 <br/><br/>“Seeing Daisy Zane’s Facebook post, Kevin Clark immediately called her. <br/><br/>Zoe Dawson used her account to post on Facebook, which was done very formally and politely. Unlike this Facebook post that was insolent and provocative. <br/><br/>Kevin, upon seeing this, knew right away that it was Daisy who posted it, so he quickly called her. <br/><br/>Only after confirming that Daisy was okay did Kevin stop worrying about leaving Charles in Imperial Capital and hurrying over to Truro City. He still decided to take Charles back to Truro City the next day. <br/><br/>He then told Daisy to go to sleep. <br/><br/>Daisy Zane, after putting her phone on silent, calmed down quickly. She didn’t plan on reading anyone’s messages or answering any calls. <br/><br/>She slept for over three hours before Anisa Cooper came to wake her up to do her makeup. <br/><br/>Anisa had clearly gone to bed very early, and she was still unaware of what was happening online. When she came to wake Daisy up, she was still feeling disoriented. <br/><br/>Daisy Zane loved to sleep when she didn’t have anything to do. Under normal circumstances, she would fall asleep very quickly. As for the quality of her sleep, it depended on what she dreamed of. Sometimes good, sometimes bad. <br/><br/>Although she seemed to be a sleepyhead, she never hit the snooze button when it was time to wake up, and she never had a grumpy morning attitude. You just need to wake her up once. <br/><br/>After getting her makeup done at the drama crew, Daisy spent the whole day filming. She didn’t even eat lunch and continued filming until around 3 in the afternoon before having a meal. <br/><br/>By this time, Anisa had already found out what had happened online. <br/><br/>“Daisy...,”Anisa looked at Daisy, her face full of sympathy. <br/><br/>“Why the long face?” Daisy had a sip of water and said, “I’m going back to <br/><br/>Everlasting Palace today.” <br/><br/>“Okay.” Anisa remained silent for a while before adding, “Also, the court has accepted the case. Both the court and Lawyer Allen have publicized it.” <br/><br/>“Hmm.” Daisy replied, looked at Anisa for a while, and then playfully scratched Anisa’s chin. “This is a good thing. From your expression, I thought I was an illegitimate child.” <br/><br/>“They’ve bullied too much! Especially that Amelia Miles! She even has the nerve to come around.” Anisa was extremely angry. <br/><br/>Daisy chuckled, saying, “Isn’t this her retribution?” <br/><br/>Anisa took a moment to think, then said, “But it’s still infuriating.” <br/><br/>Daisy took a bite of food, then pinched Anisa’s face. “Smile.” <br/><br/>Anisa thought for a moment, then smiled. “But I do get some satisfaction from thinking about the current predicament of the Miles family.” <br/><br/>Daisy looked at Anisa’s smile, heard Anisa’s voice, and suddenly felt a bit distant. She looked at Anisa for a moment, then also smiled. Afterwards, she lowered her head and slowly went back to eating her meal. <br/><br/>Seeing her happy, Kevin Clark was also cheerful. <br/><br/>Unable to argue with her, Charles Amos broke free of her hands and ran off again. <br/><br/>Kevin Clark laughed and said: “Wilton Edwards didn’t want to come over.” <br/><br/>Daisy Zane went to the restroom to wash her hands and said: “Take him back to see Wilton Edwards when you have time.” <br/><br/>“Okay.” Kevin Clark went to the restroom with her and watched her washing her hands, “Daisy, why didn’t you let Charles Amos go to school? He’s old enough to have some contact with the outside world.” <br/><br/>“He used to go to school.” <br/><br/>“Huh?” <br/><br/>“First grade, attended for half a year.” Daisy Zane said somewhat helplessly, “but...he said all his classmates are idiots. He was educated for a while. He stopped saying it, but...every day, he made a child doubt if they are an idiot through his actions. During that time, Wilton Edwards received complaints from teachers and parents every day.” <br/><br/>Kevin Clark laughed. <br/><br/>“Then, half a year later, half of Wilton Edwards’ hair had turned white. So, I didn’t let him go to school anymore.” <br/><br/>“He was intentionally making trouble at school.” Kevin Clark laughed. <br/><br/>“Exactly.” Daisy Zane said, “He was bored and I insisted on leaving him at school. Since he couldn’t do anything about me, he took it out on the people around him.” <br/><br/>“He’s young, but he’s got quite a few tricks up his sleeve.” Kevin Clark said. <br/><br/>“Are you talking about me?” Charles Amos suddenly popped his head out of the doorway. <br/><br/>Kevin Clark pressed his head lightly: “Yes, we are talking about you.” <br/><br/>“What are you saying about me?” Charles Amos asked. <br/><br/>“We are saying that you have gaps in your teeth and your speech is leaking air.” Daisy Zane bluntly said. <br/><br/>“Who doesn’t have a gap-tooth phase?” Charles Amos grumbled softly, raising his small hand, opening it, revealing another lost tooth in his hand. <br/><br/>“Another one?” Daisy Zane furrowed her eyebrows. <br/><br/>Kevin Clark squatted down and looked at him, “Open your mouth, let me see.” <br/><br/>Charles Amos opened his mouth, he had lost four teeth in a row at the top. The place where the tooth had just fallen out was still faintly bleeding. Kevin Clark touched his hair: “It’s alright, come, let’s rinse your mouth.” “He lost three teeth in two days, is that normal?” Daisy Zane asked. <br/><br/>“It’s normal.” Kevin Clark said, “No need to worry.” <br/><br/>Daisy Zane nodded: “Go rinse your mouth.” <br/><br/>Kevin Clark took him to rinse his mouth, and Daisy Zane looked at the backs of the two, one big and one small, tilting her eyebrows for a moment. <br/><br/>This scene... seems not bad at all..\t\t\t\t\t\t</div>", "images": {}, "success": true}