{"id": 164, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223513.html", "title": "Chapter 164 - 154: Just Know A Little", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 164 - 154: Just Know A Little</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 164: Chapter 154: Just Know a Little <br/><br/>Translator: 549690339 <br/><br/>While everyone was paying attention to the court ruling, Daisy Zane was still filming all day. <br/><br/>The outcome was already set. <br/><br/>She was confident in the evidence she provided, and also confident in Austin Allen. This was the inevitable result. <br/><br/>So by the time she forwarded the Facebook post, she had already returned to the hotel after a day’s work in the evening. <br/><br/>She didn’t say anything special, just thanked everyone for their attention and support. <br/><br/>There was no joy, no excitement. Just plain and simple. <br/><br/>“This has hit the Miles Family hard. Miles Group has also been heavily impacted.” As Kevin Clark unpacked the things Michael Jackson had sent today, he said, “The only way for the Miles Family to save themselves now is to acknowledge you, publicly give you shares of Miles Group, and reconcile with you. To salvage some of the Miles family’s reputation.” “Hmm.” Daisy Zane watched him unpack and responded. <br/><br/>“What do you want to do?” <br/><br/>“I won’t go back,” Daisy Zane said, “But if they give me shares, I’ll take them. <br/><br/>Then cash out.” <br/><br/>“That’s also possible.” Kevin Clark finally opened the box. <br/><br/>He then took out three large bags from inside. He tore open one bag, and a strong herbal scent immediately floated out. <br/><br/>Daisy Zane was close and subconsciously moved back when she smelled the scent. <br/><br/>“What’s this?” <br/><br/>“Medicine.” Kevin Clark took out a small package. It looked like a tea bag and weighed the same. <br/><br/>Daisy Zane looked at him warily: “What’s it for?” <br/><br/>Kevin Clark smiled at her, then turned his head and called Anisa Cooper: “Naomi Nelson.” <br/><br/>Anisa Cooper was tidying up in the bedroom and came running out when she heard the call: “What’s wrong, Third Master?” <br/><br/>“This...” Kevin Clark shook the tea bag in his hand and said, “Every day make a cup of this for Lucia. Just put it directly into the glass and add boiling water. <br/><br/>Wait for the water to cool down, add two spoonfuls of honey, and you can drink it directly. Have it one cup after breakfast every day.” <br/><br/>“Alright.” Anisa Cooper agreed briskly. <br/><br/>Listening to their conversation as if Daisy Zane didn’t exist, she frowned and said coldly, “Did I agree to drink it? You two have decided for me?” <br/><br/>Anisa Cooper looked at her, smiling innocently. Kevin Clark smiled again and said, “You can go ahead.” <br/><br/>“Okay.” Anisa Cooper ran back to the bedroom. <br/><br/>Kevin Clark put the medicine away, then sat down beside Daisy Zane and said, “Be obedient. It smells strong, but it’s not bitter when you drink it. I adjusted the medicine specially.” <br/><br/>“You adjusted the medicine?” <br/><br/>This not only concerned Daisy Zane’s physical health but also whether the Imperial City Leafield Family would spare his life. <br/><br/>So the director hesitated for a second and gave Daisy Zane a three-day break. He asked her to go back and rest, insisting she must go back and rest. <br/><br/>As it happened, Daisy Zane had an experiment to do, so she happily agreed to it. <br/><br/>On the first day of the vacation, Daisy Zane went to the laboratory. Arthur North didn’t see her until past eleven o’clock that night. <br/><br/>Moreover, Daisy Zane even shook off the people Arthur North had arranged to protect her. <br/><br/>So Arthur North had no idea where she had disappeared to all day. But he didn’t ask either. <br/><br/>The next day, Daisy Zane didn’t go out again, but took a thick painting book and went to Arthur North’s side. <br/><br/>Arthur North was handling things in his study, while Charles Amos was sitting on a chair next to Arthur North, writing something. <br/><br/>Daisy Zane sat in the study’s sofa, drawing design drafts. <br/><br/>All morning, Xavier Dominic entered the study three times. But Daisy Zane’s movements remained almost unchanged. <br/><br/>Each time he came in, he saw Daisy Zane nestled in the sofa, one leg raised and resting on the painting book. Holding a pencil in her hand, she kept drawing and drawing. <br/><br/>She never even looked up at him. <br/><br/>On his third entry, out of curiosity, Xavier Dominic circled to her back and secretly peeked from a distance. <br/><br/>On the open page, the top left corner read the four characters “Rainy Grain”. <br/><br/>She was drawing a necklace. The necklace was divided into two layers, the top layer resembling raindrops and the bottom layer looking like some kind of <br/><br/>grain. Xavier Dominic couldn’t quite recognize it. <br/><br/>The shape was only roughly outlined, but it was also extremely beautiful and fashionable. <br/><br/>As Daisy Zane was drawing, she felt the gaze from behind her. She stopped her pencil and turned to look back. <br/><br/>Xavier Dominic was so absorbed in watching that when she suddenly turned around, he was startled. <br/><br/>He coughed lightly and said, “Ms. Lucia, you, are you drawing a design draft?” <br/><br/>Hearing him speak, Arthur North and Charles Amos both looked up. <br/><br/>Daisy Zane nodded lightly. <br/><br/>Xavier Dominic took a step forward, looking at the draft in her hand, and said, <br/><br/>“Ms. Lucia, you know design too?” <br/><br/>“A little.” Daisy Zane replied, “Just doodling.” <br/><br/>Xavier Dominic was looking at the drafts, and it didn’t seem like she knew just a little. <br/><br/>“Are you very free?” Arthur North suddenly spoke up. <br/><br/>Xavier Dominic immediately withdrew his gaze, not asking any more questions, “Ms. Lucia, you’re busy, I’ll go first..”\t\t\t\t\t\t</div>", "images": {}, "success": true}