{"id": 162, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223509.html", "title": "Chapter 162 - 152: I Want A Gift Too", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 162 - 152: I Want A Gift Too</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 162: Chapter 152: I Want a Gift Too <br/><br/>Translator: 549690339 <br/><br/>Kevin Clark escorted Daisy Zane back to her place across the street but didn’t go in, stopping at her front door. Once she entered, he planned to leave. But just as he turned around, Daisy Zane suddenly called out to him. <br/><br/>“Kevin Clark.” <br/><br/>“Huh?” Kevin Clark turned back to face her, then smiled and said, “Do you feel more comfortable leaning on me than on a bed?” <br/><br/>Daisy Zane: . <br/><br/>“Alright, I won’t say anything more.” Kevin Clark straightened his expression and asked. “What’s up?” <br/><br/>Daisy Zane stared at him for two seconds, seemingly hesitating whether she should say anything. Finally, she shared her thoughts: “You are of great use for me.” <br/><br/>“Hmm?” <br/><br/>“Knowing you’re there, I feel very secure.” Daisy Zane’s voice remained cold and emotionless, “I’ve never felt like this before. <br/><br/>Maybe it was her cold voice, or perhaps it was that he didn’t expect Daisy Zane to say such words. Kevin Clark was momentarily dazed before he realized what he had heard. <br/><br/>He walked to the entryway and held Daisy Zane in his arms, kissing the top of her head. <br/><br/>He whispered, “Lucia, I’ll always be here for you. You can go about your business without worrying about anything behind you. I’ll always be there to handle it.” <br/><br/>Daisy Zane closed her eyes and took a gentle breath: “Mm.” <br/><br/>The next day, when Daisy Zane went to the drama crew, Charles Amos hadn’t woken up yet. <br/><br/>She went to check on Charles in his room, then gently touched his smooth face before walking out. <br/><br/>Juan Wright had already come up from the ground floor and assured Daisy, “Lady Zane, don’t worry, I’ll take good care of him.” <br/><br/>“Thanks a lot.” <br/><br/>“No problem,” Juan replied, “Having him around saves me from boredom.” <br/><br/>Daisy Zane handed him a book she’d brought from her side: “As a thank-you gift, this may be of some help to you.” <br/><br/>The book was about two centimeters thick and 16 open size, with a layer of thick kraft paper on the outside. The paper seemed aged, with some torn edges. <br/><br/>But there was nothing written on the paper, and it was impossible to tell what kind of book it was just by looking at it. <br/><br/>Juan glanced at Kevin Clark, then took the book with both hands: “Lady Zane, you’re too kind. What’s the need for a thank-you gift? We’re like family. I should be...” <br/><br/>Juan opened the book and saw the big characters on it; his following words were instantly cut short. His eyes widened in surprise. <br/><br/>Daisy Zane pretended not to see his reaction, stretched her hand again to take the book back: “I think you’re right. It’s awkward to give thank-you gifts once you’re already familiar with each other.” <br/><br/>Maybe... It could even nurture a successor for Holt Lawrence. Juan Wright does have some talent. <br/><br/>“His book is not bad, worth studying.” <br/><br/>Upon hearing this, Juan Wright couldn’t hold back the corners of his mouth from twitching. “Not bad? Boss Lawrence’s book, in the hacker community, is like a supreme martial arts secret.” <br/><br/>Would Holt Lawrence hit someone upon hearing this? <br/><br/>Kevin Clark was going to the drama crew with Daisy Zane again. <br/><br/>Since Charles Amos was home, Juan Wright didn’t go downstairs to send them off. <br/><br/>The two entered the elevator together, and as soon as the elevator door closed, Kevin Clark’s expression, which was a bit fierce when not laughing, suddenly turned somewhat pitiful. “Lucia, I want a gift too.” <br/><br/>Daisy Zane looked up at him. <br/><br/>“Juan Wright has a gift.” Kevin Clark looked at her with a charming smile, “I don’t.” <br/><br/>Daisy Zane: . Is this guy a jealous fairy or what? <br/><br/>Seeing that she didn’t say anything, Kevin Clark leaned forward and said again, “I don’t.” <br/><br/>As Daisy Zane looked at his eyebrows and eyes, she suddenly pulled his collar, making him bend down, and then kissed him on the lips. <br/><br/>After a quick kiss, she let him go and took a step back. <br/><br/>The smile on Kevin Clark’s face deepened immediately, he stepped forward and slightly leaned down to kiss Daisy Zane’s lips again, then laughed, “A precious gift, this is the return gift.” <br/><br/>This man... is really something else... <br/><br/>Daisy Zane pursed her lips lightly, looked at him for a while, and suddenly laughed, “Third Master... have you really never been in love before?” <br/><br/>“No.” Kevin Clark stood up straight and touched her face again, “Why do you suddenly ask that?” <br/><br/>“It doesn’t seem like it.” Daisy Zane said, “You seem like... a seasoned veteran in the game of love.” <br/><br/>“I...” Kevin Clark’s face was about to turn black with injustice, “The rumors are really fake.” <br/><br/>Seeing him like this, Daisy Zane leaned against the elevator wall and laughed, <br/><br/>“I didn’t say the rumors were true, Third Master, why are you so nervous?” <br/><br/>Kevin Clark looked at her squinting eyes, and the danger swept across the entire elevator, closing in on Daisy Zane. <br/><br/>At this moment, the elevator door opened. Daisy Zane provocatively raised her eyebrows at him and then leisurely walked out of the elevator, leaving him with a view of her back. <br/><br/>Looking at that silhouette, with every strand of hair exuding triumph, Kevin Clark took a deep breath, gritted his teeth, and finally walked out just before the elevator door closed. <br/><br/>Damn girl, teasing him again..\t\t\t\t\t\t</div>", "images": {}, "success": true}