{"id": 161, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223507.html", "title": "Chapter 161 - 151: April 15", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 161 - 151: April 15</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 161: Chapter 151: April 15 <br/><br/>Translator: 549690339 <br/><br/>Past 9 PM, Charles Amos finished taking a shower by himself and came out with wet hair dripping. <br/><br/>Because it was wet, the hair was even curlier, like an exploding mess. <br/><br/>Thankfully, his little face looked good with the round eyes, so it didn’t affect his appearance. <br/><br/>Harton Clark got a hairdryer to let him sit on his lap and blow-dry his hair. <br/><br/>After dinner, Daisy also followed them and sat quietly on the carpet, carefully practicing her incense seal. <br/><br/>The sound of the hairdryer suddenly started. Lucia turned her head and saw Charles sitting obediently on Harton’s lap, holding a Rubik’s cube, playing it over and over again. <br/><br/>This little monster rarely behaved so well with others, but he was surprisingly obedient to Harton. <br/><br/>Harton noticed her gaze and looked at her with a smile. <br/><br/>Lucia raised her eyebrow slightly before lowering her head to continue cleaning the incense burner. <br/><br/>After finishing blow-drying Charles’s hair, Harton took him to sleep. <br/><br/>“Good night,” Charles and Lucia said to each other. <br/><br/>“Yeah,” Lucia messed up his freshly dried hair, patted his butt, and said, “Good night. Go to sleep.” <br/><br/>Harton took Charles back to the room, but he never came back. Lucia had finished lighting the incense, but he still hadn’t returned. <br/><br/>Just when she was about to go and see if he was going to sleep with Charles, her cell phone rang suddenly. <br/><br/>It was a call from Johanes Miles. <br/><br/>He had called her many times in the early morning and throughout the day today, but her phone was on silent, and she didn’t hear any of them. <br/><br/>She later saw the calls but ignored them. <br/><br/>In the afternoon, when she turned her phone volume back on, Johanes didn’t call again. He probably had too many things to deal with and didn’t have time to call her. <br/><br/>Looking at the incoming call, Lucia thought for a moment, answered it, and put it on speakerphone. <br/><br/>She thought Johanes would yell at her, but he didn’t. His voice was exhausted, as if he had no more energy left to shout. <br/><br/>“Daisy, what exactly do you want to do?” <br/><br/>Daisy Zane opened her mouth again, “On the memorial day, something must be offered as a sacrifice to appease the restless souls.” <br/><br/>As soon as she finished this sentence, she could clearly hear the disorder in Johannes Miles’s breathing through the phone. <br/><br/>“Or what did you think, that I would hold onto the evidence and not speak up to clear my name after you slandered me as an illegitimate daughter time and again?” Daisy Zane said, “I’ve been waiting for this day. She’s been wronged for more than twenty years, so we need to pick an important day to clear her name.” <br/><br/>Daisy Zane’s voice had not changed at all, and her expression remained cold and nonchalant. But these words sounded increasingly eerie and terrifying. <br/><br/>“Johannes Miles, after all these years, do you still remember what she looked like? What she liked? What she looked like when she laughed?” Daisy Zane’s words struck the heart, “When you hold the newcomer by your side and laugh, do you ever think about the wronged soul under the yellow soil, buried with her old, dry bones?” <br/><br/>Johannes Miles suddenly hung up the phone. <br/><br/>Daisy Zane glanced at the hung-up phone and put the incense cleaner back. <br/><br/>Then she turned to Kevin Clark and said, “Eavesdropping again.” <br/><br/>Kevin Clark smiled, walked over, sat down beside her, hugged her from behind, and said, “Yup, accidentally eavesdropped again.” <br/><br/>“Is that an accident?” <br/><br/>Kevin Clark rubbed his face against hers, “It is an accident.” “Don’t move around.” Daisy Zane dodged, “It’s ticklish.” <br/><br/>Kevin Clark laughed and kissed her face, “Alright, I won’t move.” <br/><br/>After holding her for a while, Kevin Clark said, “In the afternoon, the stock of the Miles Group plummeted.” <br/><br/>“No wonder Johannes Miles was quiet all afternoon.” <br/><br/>Kevin Clark pinched her hand and asked, “Is there anything you need my help with?” <br/><br/>Daisy Zane thought for a moment and said, “No.” <br/><br/>“Sigh—I’ Kevin Clark said disappointedly, “I’m such a useless boyfriend.” <br/><br/>“You do have some uses.” Daisy Zane said. <br/><br/>“What?” <br/><br/>“Being a comfortable cushion.” Daisy Zane leaned more on him as she spoke. <br/><br/>Kevin Clark hugged her closer, “How about I hold you like this when we sleep tonight?” <br/><br/>Daisy Zane looked at him, “Compared to that, I think lying in bed is more comfortable.’ <br/><br/>Kevin Clark laughed and didn’t tease her anymore. After kissing her face again, he said, “Go to sleep. We have to get up early tomorrow.” <br/><br/>“Yeah.”\t\t\t\t\t\t</div>", "images": {}, "success": true}