{"id": 168, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223521.html", "title": "Chapter 168 - 158: Incompatible Blood Types", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 168 - 158: Incompatible Blood Types</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 168: Chapter 158: Incompatible Blood Types <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane knew Kevin Clark was there, so she slept soundly afterwards and didn’t wake up again. <br/><br/>The child didn’t wake up all night but woke up before six o’clock in the morning. <br/><br/>And it was after kicking Kevin Clark in the leg that she woke up. <br/><br/>When Kevin Clark was woken up by her kick, the first thing he did was look at Daisy Zane. He saw her snuggled under the quilt with a pile of hair sticking out and still asleep. <br/><br/>The little girl didn’t cry again after waking up. Instead, she stared at Kevin Clark with wide eyes, seemingly curious. <br/><br/>After sleeping for a night, the child’s hair was all messed up, like a little bird’s nest. But the little girl was beautiful and resembled Melody Collins around the eyes. <br/><br/>But Kevin Clark really didn’t like children. <br/><br/>Charles Amos was an exception because of his love for the whole family, but this one... this one... was to save Daisy Zane from getting tired. <br/><br/>So he gently got out of bed, intending to take the child to the living room. <br/><br/>Although he moved softly, Daisy Zane still poked her head out of the quilt, glanced at them, and murmured, “Awake?” <br/><br/>“Yeah, I’ll take her out.” Kevin Clark held the child, walked to the bedside, and gave Daisy Zane a head rub, saying softly, “You can sleep a little more.” “Hmm.” Daisy Zane responded and closed her eyes again. <br/><br/>But as soon as Kevin Clark left the room with the child and gently closed the door, she immediately sat up. <br/><br/>The child would definitely need to use the restroom in the morning, and if... Third Master might freak out. So she hurriedly got up. <br/><br/>As she expected, when she opened the door, the little girl was looking up at Kevin Clark while tugging at her pants. <br/><br/>Kevin Clark was a bit confused and trying to communicate with her when he saw Daisy Zane come out, “Awake already?” <br/><br/>“I’ll take her to the restroom.” Daisy Zane picked up the child. <br/><br/>“Let me help.” <br/><br/>“No need.” Daisy Zane refused crisply, “You’d better make her some breakfast.” <br/><br/>Kevin Clark was stunned by her refusal but quickly agreed, “All right, I’ll cook.” <br/><br/>Melody Collins woke up in the early morning, and her cousin told her about the situation—that the child had been taken away by Daisy Zane. After feeling relieved, she soon fell asleep again. <br/><br/>She slept until her parents came to the hospital in the morning and woke up again at the sound of their voices in the ward. <br/><br/>Kevin Clark had left someone at the hospital, who informed him of the news early in the morning. <br/><br/>As he approached, Michael Jackson realized that many of these things were materials about Daisy Zane that he had once obtained from Cold Green Village. Right in Kevin Clark’s line of sight was a photocopy of a birth certificate. <br/><br/>It was Daisy Zane’s birth certificate copy. <br/><br/>All of these had been passed from Michael Jackson’s hand to Kevin Clark’s. <br/><br/>So, Michael Jackson was also well aware of what was written on them. <br/><br/>On that birth certificate, the blood type column clearly stated: Type B. <br/><br/>Therefore, when Daisy said she had Type A blood at the hospital, both Kevin Clark and Michael Jackson had been puzzled for a moment. <br/><br/>Before transfusing blood to Melody Collins, the hospital would have checked Daisy’s blood thoroughly. Since the transfusion took place, it meant that she had Type A blood. <br/><br/>However, the chance of the blood type on a birth certificate being wrong is almost zero. <br/><br/>“Third Master...” <br/><br/>After a moment of silence, Kevin Clark looked up at Michael Jackson: “What’s the matter?” <br/><br/>“This file needs your signature.” Michael Jackson handed over the file. <br/><br/>Kevin Clark took it, looked at it and signed his name before returning it to Michael Jackson. <br/><br/>But Michael Jackson didn’t move with the file in hand. <br/><br/>After a while, Kevin Clark pointed at a one-inch black and white photo. It was a picture of Daisy Zane when she was three or four years old, the features already blurred and indistinguishable. <br/><br/>He asked: “Do you think...she looks like them?” <br/><br/>Michael Jackson glanced at the photo, which only showed a row of small white teeth, and hesitated before saying: “Third Master...l really can’t tell.” <br/><br/>Kevin Clark didn’t say anything else. Instead, he took out two more photos. <br/><br/>One was of Claudia Zane in her twenties, and the other was of Johanes Miles in his twenties. <br/><br/>“Do they look alike?” <br/><br/>Michael Jackson’s lips twitched; Claudia Zane had a nimble and quiet beauty, and Johanes Miles was quite handsome when he was young, which was why Charles Hobson was so obsessed with him. <br/><br/>However...Daisy Zane didn’t really resemble either of them. <br/><br/>Daisy Zane had a very prominent appearance, a cold and stunning beauty. Especially those phoenix eyes, they were so attractive that people couldn’t help but be drawn to them. <br/><br/>“There... are actually many children who don’t look like their parents...” <br/><br/>Michael Jackson really didn’t want to accept the truth. He would rather believe that the blood type on the birth certificate was wrong. <br/><br/>So he kept looking for reasons.\t\t\t\t\t\t</div>", "images": {}, "success": true}