{"id": 167, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223519.html", "title": "Chapter 167 - 157: She Can ‘T Cook", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 167 - 157: She Can ‘T Cook</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 167: Chapter 157: She Can ‘t Cook <br/><br/>Translator: 549690339 <br/><br/>As suggested by Uncle Wilton Edwards, Kevin Clark cooked some white porridge, fried an egg, steamed half a pumpkin and boiled some green vegetables. <br/><br/>Fearing that the children would have digestion problems, he made everything quite soft and tender. <br/><br/>During the time he was cooking, the child eventually stopped crying. <br/><br/>However, she insisted that Daisy Zane hold her. The moment she was put down, she would start fussing and threatening to cry. <br/><br/>Daisy Zane, worried that the child might develop some problems from continuous crying, had no choice but to carry her around the living room. Eventually, they ended up in the kitchen, watching Kevin Clark cook. <br/><br/>Charles Amos moved a small stool, stepped on it, and also watched Kevin Clark cook. <br/><br/>“I also want a fried egg.” Charles Amos suddenly announced. <br/><br/>“Didn’t you already have dinner?” Daisy Zane asked from the entrance. <br/><br/>“Can’t I eat another one?” <br/><br/>Daisy Zane didn’t approve, so Charles Amos turned to Kevin Clark, after all, she wasn’t the one cooking. But Kevin Clark glanced down at him and chuckled, “If Daisy Zane doesn’t allow, I dare not.” <br/><br/>Charles Amos: <br/><br/>Hearing this, Daisy Zane upturned the corner of her lips lightly. <br/><br/>Patting Charles Amos’s head, Kevin Clark suggested, “Let’s eat it tomorrow morning. ” <br/><br/>“Okay.” <br/><br/>“When you were his age, did Daisy Zane also take care of you like this?” Kevin Clark wanted Charles Amos to appreciate Daisy Zane’s efforts, so he wouldn’t feel jealous for her carrying another child all the time. But to his surprise, Charles Amos responded, “No.” <br/><br/>“Huh?” <br/><br/>“She can’t cook.” Charles Amos looked at the golden-colored fried egg and added, “Uncle Wilton Edwards always cooked for me.” <br/><br/>A fleeting look of suspicion crossed Kevin Clark’s eyes, but he quickly returned to normal, chuckling softly. <br/><br/>“After she flips the egg over, it would disappear.” Charles Amos added. Carrying the little child, Daisy Zane cast a floating glance at Charles Amos’ head and narrowed her eyes, her gaze murderous. <br/><br/>“Why would it disappear?” Kevin Clark followed along. <br/><br/>“Because, after flipping, it would be the same colour as the base of the pot.” Charles Amos thought for a moment and added, “Just burnt black.” <br/><br/>“Charles Amos, are you asking for a beating?” Daisy Zane suddenly asked. <br/><br/>At the sound of her chilly voice, Charles Amos recoiled, jumped off the stool and squeezed between Kevin Clark’s legs and the food preparation table for protection. <br/><br/>Kevin Clark suppressed a laugh, looking at Daisy Zane, “So there are things that Daisy isn’t good at.” <br/><br/>Daisy Zane looked at him. <br/><br/>Some of Kevin Clark’s laughter died away, “Don’t worry, I can cook. I’ll handle it.” <br/><br/>Changing her target, Daisy Zane turned to Charles Amos, “Come out; you should go to sleep.” “Don’t hit me.” <br/><br/>“Hmm.” <br/><br/>Daisy looked up at him. <br/><br/>“What does that look mean? Do you see me as a wolf?” Kevin laughed, “Are you afraid I’ll do something bad?” <br/><br/>Daisy chuckled softly, her head lowered, as she headshot a character in her game. <br/><br/>“Is it me or does that laugh sound like you’re looking down on me?” Kevin joked as he playfully hooked her chin. <br/><br/>“You’re hearing things,” Daisy shut off the game on her phone but left it open for a soft glow. She put it on the bedside table and said, “There’s another quilt in the cabinet.” <br/><br/>“Huh?” <br/><br/>“You’re staying here, aren’t you?” Daisy asked, “Or do you plan to sit here all night?” <br/><br/>Kevin fell into silent for a moment and then answered, “At first I did plan to, but now...” <br/><br/>“Go get the quilt. <br/><br/>“All right.” <br/><br/>Kevin got up to retrieve the quilt, and Daisy gently nudged the child slightly towards herself. <br/><br/>By the time Kevin returned with the quilt, Daisy had cleared a sizable space on the other side of the child. <br/><br/>It was certainly enough for Kevin Clark to sleep on. <br/><br/>“I sleep here?” <br/><br/>“Where else do you want to sleep?” Daisy asked, “It’s better for you to be there in case the child rolls over in her sleep.” <br/><br/>Kevin Clark: So he was just a tool after all. <br/><br/>Getting into bed quietly, Kevin whispered, “Okay, go to sleep.” <br/><br/>Daisy turned off her phone and lay down. <br/><br/>The room plunged into darkness. Kevin lay on his side, looking towards Daisy across the dark. <br/><br/>If anyone else had as many secrets as she did, he wouldn’t let that person get close to him. But, for the woman before him, he was the one who actively sought her company. <br/><br/>He liked her, starting from love at first sight to a point of no return. <br/><br/>He liked her so much that even if there was an unfathomable abyss ahead, he would jump in, even if it meant shattering himself to pieces. <br/><br/>He liked her so much that he handled everything with extra caution, taking care of her meticulously, and slowly trying to understand her. <br/><br/>Actually, there were many questions Kevin Clark wanted to ask Daisy. But he feared that if he crossed the protective line in her heart against the world, Daisy would become annoyed with him. <br/><br/>So, he could only wait patiently for Daisy to fully accept him, to trust him, and to initiate the conversation herself. <br/><br/>“Daisy...” Kevin Clark suddenly whispered her name. <br/><br/>But Daisy was already asleep. She stirred at the sound of his voice, waking up slightly, but not completely awake. <br/><br/>Because Kevin’s voice obviously didn’t suggest any emergency. She murmured, <br/><br/>“I’m asleep, I can’t hear anything.” <br/><br/>Kevin chuckled and said, “Go back to sleep..”\t\t\t\t\t\t</div>", "images": {}, "success": true}