{"id": 165, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223515.html", "title": "Chapter 165 - 155: Zhou Might Be In Trouble", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 165 - 155: Zhou Might Be In Trouble</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 165: Chapter 155: Zhou might be in trouble <br/><br/>Translator: 549690339 <br/><br/>Not long after Allonzo left, Michael came in again. <br/><br/>However, Kevin was busy explaining a math problem to Charles, so Michael had to wait on the side. <br/><br/>“Come here, let me tell you.” Daisy put down the painting book and just finished saying that when her cell phone rang. <br/><br/>Charles was about to get off the chair but looked at Kevin instead. <br/><br/>But Kevin was looking at Daisy. <br/><br/>Charles: <br/><br/>The call was from Emily Hill, Daisy thought it might be work-related. But after answering the phone, the voice on the other end was not Emily’s, it was a little girl crying. <br/><br/>Then, they could faintly hear the sound of yelling and fighting coming from the cell phone. <br/><br/>The child on the other side of the line kept crying, her wailing making Daisy’s head feel numb. <br/><br/>Daisy stood up and started walking out, saying, “Don’t cry, what happened? Where is your mom?” <br/><br/>Seeing her get up, Kevin followed. Hearing her speak, Michael and Charles followed her out as well. <br/><br/>As Daisy was putting on her clothes at the door, the child finally spoke, “My dad is beating my mom, and she is bleeding a lot. Please save my mom!” <br/><br/>Daisy’s expression turned severe as she looked at Juan, who was sitting on the living room sofa, and said, “Juan, locate the phone.” <br/><br/>After saying that, Daisy gave Emily’s mobile number to Juan. <br/><br/>“Ok.” Juan immediately got to work. <br/><br/>“Send it to my cell phone.” After Daisy said this, she left the house. <br/><br/>Kevin told Charles to stay at home and left with Michael in tow. <br/><br/>After they reached the parking lot, Juan’s location information came through. Daisy directly navigated to the place and handed the phone to Michael. <br/><br/>She and Kevin sat in the back seat of the car. Updated from novelb(i)n.c(o)m<br/><br/>After the car left the parking lot, Kevin finally asked, “What happened?” <br/><br/>“Emily’s daughter called.” Daisy frowned, “She said her dad is hitting her mom, and her mom is bleeding. Call an ambulance.” <br/><br/>As Daisy finished speaking, Kevin was already dialing the emergency number. <br/><br/>Michael’s car was driving fast, but by the time they arrived at Emily’s home, twenty minutes had already passed. <br/><br/>The ambulance arrived earlier, but only the child’s crying could be heard from the room, and no one opened the door when they knocked. <br/><br/>The doctor came to them and said, “She has an ectopic pregnancy and is bleeding heavily. Is anyone of you type A blood?” <br/><br/>“Isn’t there any blood in the blood bank?” Kevin Clark asked. <br/><br/>Type A blood is not uncommon, and with such a large hospital, there should be blood in the blood bank. <br/><br/>“This morning, a maternal patient bled heavily, and she is also type A blood. Now the blood in the blood bank is not enough. We have already requested blood from other hospitals, but it will take some time.” The doctor quickly said, <br/><br/>“She needs to have one of her fallopian tubes removed. You need to sign the consent form and be aware of the critical condition notice as her blood loss is too great...” <br/><br/>Daisy Zane frowned and said, “I am type A blood.” <br/><br/>After that, she handed the child to Michael Jackson and signed the consent form. <br/><br/>Hearing her words, Kevin Clark hesitated for a moment and exchanged a glance with Michael Jackson, whose eyes also contained confusion. But the child started crying when she was not in Daisy Zane’s arms. Michael Jackson had no choice but to console the child first. <br/><br/>“Are you a family member?” <br/><br/>“We have no blood relation.” Daisy Zane said, “Take me for a check-up.” <br/><br/>“Follow me.” <br/><br/>It took three hours to rescue Emily Hill, and she was finally saved but remained unconscious. <br/><br/>After Daisy Zane had her blood drawn, she looked energetic, but her lips turned a little pale. <br/><br/>Emily Hill’s parents were abroad, and she only had a cousin in China. <br/><br/>Even if her parents were notified, they could only arrive by tomorrow morning at the earliest. However, her cousin arrived quickly. <br/><br/>Michael Jackson went to pick her up and told the others that she had come on a motorcycle. <br/><br/>After her cousin arrived and learned about the situation, she cried and cursed the man, her cursing ability simply astonishing. <br/><br/>Again and again, she said the same thing: “I knew that man was no good, but she insisted on marrying him. What kind of spell has he put on you for you to follow him so blindly?” <br/><br/>Then she continuously thanked Daisy Zane and the others. <br/><br/>She wanted Daisy Zane and her friends to go home first, and she would stay with Emily Hill in the hospital. <br/><br/>However, she had to entrust the child to Daisy Zane’s care. <br/><br/>Although the cousin was in her forties, she was single and only barely able to take care of herself, let alone a child... <br/><br/>As a result, Daisy Zane brought the child back with her. <br/><br/>“Are you okay?” Kevin Clark asked Daisy Zane, looking at her pale lips. <br/><br/>“I don’t feel anything.” Daisy Zane looked at the child who was crying asleep in Michael Jackson’s arms and said, “Let’s go to Sister Emily’s house first and get some things the child usually uses.” <br/><br/>“Alright.’\t\t\t\t\t\t</div>", "images": {}, "success": true}