{"id": 163, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223511.html", "title": "Chapter 163 - 153: Pronouncement Of Judgment", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 163 - 153: Pronouncement Of Judgment</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 163: Chapter 153: Pronouncement of Judgment <br/><br/>Translator: 549690339 <br/><br/>Because Johanes Miles’ case involved corruption by related authorities, it attracted significant attention. Moreover, the material evidence submitted by Austin Allen was very clear. <br/><br/>Even witnesses who had attended the wedding of Johanes Miles and Claudia Zane were found. <br/><br/>Thus, the court proceedings moved quickly, and a trial date was scheduled one month later. Due to the widespread attention on the case, the court announced the trial date online. <br/><br/>During this month, the Miles Family had been continuously attempting to contact Daisy Zane. <br/><br/>However, Daisy Zane blocked all phone numbers related to the Miles Family after talking to Johanes Miles that night. <br/><br/>Unable to reach her by phone, the Miles Family began looking for her at the drama crew and Everlasting Palace. <br/><br/>Johanes Miles, Charles Hobson, and even Old Master Miles went to look for Daisy Zane but none of them were able to find her. <br/><br/>The security at the drama crew, hotel, and Everlasting Palace had been mostly replaced by Kevin Clark’s people. <br/><br/>While protecting Daisy Zane, they also shielded her from these unnecessary troubles. <br/><br/>So, the Miles Family was not able to see even a glimpse of Daisy Zane. <br/><br/>In Truro City, the Miles Family was prestigious. Even those who didn’t pay much attention to celebrities knew about Daisy Zane because of the Miles Family. <br/><br/>Anyone with some sense and a bit of intelligence, seeing the incidents that Daisy Zane had dealt with, knew that Daisy Zane had substantial backing behind her. <br/><br/>So when the Miles Family encountered trouble this time, everyone distanced themselves immediately. Some people even chose to pay penalties to terminate cooperation agreements. <br/><br/>They were afraid that they would unintentionally provoke a powerful force and end up going bankrupt overnight. <br/><br/>The situation at the Hobson Family was similar due to Benjamin Hobson’s incident. <br/><br/>Although they were not at a point where everyone pushed them while they were down, they certainly had reached a stage where everyone gathered to watch the excitement. <br/><br/>As the Hobson Family declined, Charles Hobson’s arrogance diminished by more than half. <br/><br/>And this matter was related to her. It was because she had set her sights on the already married Johanes Miles that she was determined to marry him. <br/><br/>Which led to the Hobsons using their influence to force a marriage. <br/><br/>Old Master Miles favored the power of the Hobson Family and had always looked down on Claudia Zane, a poor girl with no background. <br/><br/>Moreover, in the end, Claudia Zane disappointingly gave birth to a girl. <br/><br/>So, Old Master Miles encouraged Johanes Miles to divorce Claudia Zane and marry Charles Hobson. <br/><br/>The modification of the marriage registration information was done by the Hobson Family. <br/><br/>Daisy Zane opened her mouth, intending to say that she could protect herself. But in the end, she swallowed her words. She figured that if she let him follow her, Kevin would feel more at ease. <br/><br/>“Okay.” <br/><br/>Kevin Clark could see through her thoughts and smiled gently: “The court hearing is tomorrow. But... Old Master of the Miles Family suddenly went to the hospital. The Miles Family wants to postpone the hearing on the grounds of the old master’s illness.’ <br/><br/>Daisy Zane raised her eyebrows lightly: “So what?” <br/><br/>“So...” Kevin Clark looked at her and said, “I brought a medical team from the Imperial Capital to testify in court. Old Master Miles just had a hypoglycemic incident and fainted, and it’s not serious enough for his son not to show up in court. ” <br/><br/>After listening, Daisy Zane laughed: “So it’s really just low blood sugar?” “I spared him some face.” Kevin Clark said, “Didn’t say that he was faking it. <br/><br/>“...You are really mean.” <br/><br/>Kevin Clark also smiled and lazily said: “Everything is arranged at the hospital. Even if there is really something wrong with Old Master Miles, we can save him. Besides, I’ve arranged with the media that if Johanes Miles still doesn’t show up, he will be live-streamed nationwide.” <br/><br/>Daisy Zane laughed briefly and then quickly held it back. But after holding it for a while, she couldn’t help it and laughed, lowering her head. <br/><br/>Seeing her shoulders shaking with laughter, Kevin Clark said: “Is it really that funny?” <br/><br/>“Not really.” Daisy Zane laughed. <br/><br/>Kevin Clark watched her laugh, like sunshine sprinkling over the cold snow, making her look dazzling and stunning. He suddenly felt the urge to touch her, but since her makeup and hair were freshly done, he could only hold her hand. <br/><br/>The next day, the court was in session, and both Johanes Miles and Charles Hobson appeared. <br/><br/>Although the case was old and involved many people, there was strong and clear evidence, along with witnesses and the testimony of involved officials. <br/><br/>Above all, there was the gold-medal lawyer Austin Allen, who was unstoppable in court. <br/><br/>He left the opposing defense lawyers speechless and sweating profusely. <br/><br/>So there was no need for a second hearing, and the verdict was announced right there and then. <br/><br/>It truly restored Claudia Zane’s innocence. <br/><br/>The court ruled that the Miles Family had to pay for eighteen years of child support, reputational damages to Claudia and Daisy Zane, as well as Claudia Zane’s mental distress. <br/><br/>And they had to publicly apologize to Claudia Zane and Daisy Zane. <br/><br/>Involved officials were sentenced to life imprisonment and confiscation of property. <br/><br/>As for the tampering of the marriage registration information, it was all done by Uncle Horton. <br/><br/>Although he didn’t appear in court, he would be taken to the police station for questioning after the case was over. <br/><br/>If everything was proven to be true, he would be sentenced to at least ten years. <br/><br/>The entire process was live-streamed, with a peak viewership of millions. Afterward, the court and Lee Law Firm announced the verdict online again....\t\t\t\t\t\t</div>", "images": {}, "success": true}