{"id": 166, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223517.html", "title": "Chapter 166 - 156: Taking Care Of The Child", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 166 - 156: Taking Care Of The Child</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 166: Chapter 156: Taking Care of the Child <br/><br/>Translator: 549690339 <br/><br/>Once again visiting Emily, Daisy Zane got quite a few things for the child. Clothes, food, necessities, and toys, she brought some of each. <br/><br/>For such a young child, without their mother beside them, they easily recognize familiar things. <br/><br/>Arthur North also took the chance to have someone install a new door for her home. <br/><br/>After returning to the Everlasting Palace, Daisy Zane took the child directly to her room. <br/><br/>Hearing the noise, Charles Amos also asked Juan Wright to accompany him to her room. <br/><br/>As he entered, he saw the blood on Arthur North and Daisy Zane, and was frozen in place. <br/><br/>Juan Wright, following behind him, immediately covered his eyes. <br/><br/>Daisy Zane glanced at him and took off her coat. She looked at Arthur North and said, “You should change your clothes too.” <br/><br/>“Okay.” <br/><br/>Daisy Zane went back to her room to change her clothes first. After coming out, she took Charles Amos into her arms and said, “It’s okay, it’s not our blood.” <br/><br/>When Arthur North came back after changing clothes, he saw Daisy Zane holding Charles Amos, stroking his head, and comforting him all the time. <br/><br/>It was the first time he had seen Daisy Zane comforting Charles Amos so seriously and patiently. <br/><br/>Usually, she just said a few words casually and left him alone. Updated from novelb(i)n.c(o)m<br/><br/>“Scared?” Arthur North went over and patted Charles Amos’s head. <br/><br/>Charles Amos buried his face in Daisy Zane’s neck and shoulder, not saying a word. <br/><br/>“I wasn’t hurt either, and nothing happened.” Daisy Zane’s voice was still cold, but it was much softer. <br/><br/>“Was it him?” Charles Amos suddenly asked in a low voice. <br/><br/>Arthur North looked at Daisy Zane, and he noticed that her hand seemed to stiffen for a moment, and even her expression seemed to freeze for a moment. <br/><br/>But it was gone in an instant. <br/><br/>“It wasn’t him.” Daisy Zane said, “It was the little sister’s mother who had an accident.” <br/><br/>“The little sister?” <br/><br/>“Yes.” Daisy Zane took Charles Amos to the little girl’s side. The child was still sleeping, and Michael Jackson had just placed her on the sofa. “Would you like to take a look?” <br/><br/>As Charles Amos raised his head, he looked on the sofa. <br/><br/>The little girl had soft black hair, braided into two scorpion braids. Her small face was plump, and after falling asleep, her little mouth was a bit moist, occasionally smacking her lips. <br/><br/>Charles Amos looked at her for a while before looking back at Daisy Zane. <br/><br/>Daisy Zane immediately said, “It’s just a temporary stay.” <br/><br/>Charles Amos’ tense expression immediately relaxed. <br/><br/>“Yes.” Kevin Clark chuckled and backed away. <br/><br/>As soon as the baby started drinking the milk, her cries stopped. <br/><br/>They took this opportunity to have a quick meal. But halfway through, the baby started crying again. <br/><br/>“You eat, I’ll go check on her.” Kevin Clark said. <br/><br/>Daisy Zane ate quickly and then let Kevin Clark go eat. <br/><br/>She held the baby but didn’t try to soothe her, just cradling her in her arms and patting her back gently. <br/><br/>Listening to the baby’s cries, her thoughts began to drift away. <br/><br/>When Jack Amos left, Charles Amos was only over a year old, his crying was even more intense. <br/><br/>At that time, she and Wilton Edwards took turns staying up with him night after night. Besides taking care of Charles, they were also afraid that someone might come near and hurt him. <br/><br/>When Kevin Clark finished eating and came out, he saw Daisy Zane lost in thought while holding the baby. <br/><br/>He approached her and reached out to touch her face. <br/><br/>But Daisy Zane suddenly grabbed his hand tightly and then looked up at him. <br/><br/>Her eyes showed unhidden anger, resentment, and even a killing intention, like a sharp knife that could pierce into one’s heart. <br/><br/>Kevin Clark was taken aback for a moment, instinctively tensed his hand, then quickly let go: “What’s wrong?” <br/><br/>Daisy Zane glanced at Kevin Clark’s face and came to her senses. She slowly released her grip: “I’m sorry.” <br/><br/>“It’s okay.” Kevin Clark still reached out and touched her face, “Are you tired?” Daisy Zane shook her head lightly, glancing at the red mark on his wrist. <br/><br/>She had left a mark on his delicate skin. <br/><br/>“Let me hold her for a while.” Kevin Clark reached out to take the baby. But Daisy Zane did not hand her over: “You... make some food for her.” <br/><br/>“Huh?” <br/><br/>“At her age, she can eat solid food. I’m afraid she’ll be hungry if she only drinks formula.” Daisy Zane said, “Use my cell phone to call Uncle Edwards and ask him what to buy and how to prepare it.” <br/><br/>“All right.” <br/><br/>“I’ll call.” Charles Amos found Daisy Zane’s cell phone, unlocked it with his fingerprint, and dialed Wilton Edwards’ number. <br/><br/>He even put it on speakerphone. <br/><br/>“Lady...” <br/><br/>“Grandpa Edwards, it’s me.” Charles Amos said sweetly. <br/><br/>“Ah, it’s Young Master.” Wilton Edwards’ voice was filled with kind laughter. <br/><br/>Kevin Clark smiled: “Charles talks more than he used to.” <br/><br/>Daisy Zane glanced at him and nodded in agreement. <br/><br/>Especially after talking to Kevin Clark, Charles started to communicate with others simply as well. <br/><br/>Perhaps Kevin Clark made him realize that not everyone was like that madman..\t\t\t\t\t\t</div>", "images": {}, "success": true}