{"id": 171, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223527.html", "title": "Chapter 171 - 161: Edward Kirsten", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 171 - 161: Edward Kirsten</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 171: Chapter 161: Edward Kirsten <br/><br/>Translator: 549690339 <br/><br/>Kevin Clark has been away for more than half a month, and he’s been very busy, sometimes he only calls Daisy Zane once every other day. <br/><br/>Even though he’s not around, Daisy Zane’s restrictions have not been relaxed at all. <br/><br/>Every morning, Anisa Cooper watches her take her medicine naggingly, not to mention the weather in late June, she has to drink hot water every day, steaming hot water. <br/><br/>The most annoying thing is that everyone in the drama crew gets to eat ice cream, and she doesn’t. <br/><br/>In the scorching afternoon sun, everyone in the drama crew has an ice cream in hand, and she just watches from the side. <br/><br/>Anisa Cooper even eats one while watching her. <br/><br/>The main point is, she’s footing the bill for all this. <br/><br/>All she wanted was to treat the drama crew and sneak an ice cream for herself. She had no idea what benefits Kevin Clark had given Anisa Cooper to make her assistant treat her this way. <br/><br/>She even took away the ice that she had frozen in her hotel fridge. <br/><br/>So, Daisy Zane, who was in a bad mood all afternoon, sent Anisa Cooper back to her place early after returning to the hotel in the evening. <br/><br/>Then she ordered three ice creams from takeout. <br/><br/>She ate them while playing a game. <br/><br/>She was planning to destroy the evidence after eating, but then Gael Easton suddenly called her and interrupted her. <br/><br/>“Was it you who leaked my information from M continent?” <br/><br/>“What happened?” Daisy Zane poured a glass of wine and slowly walked to the window. <br/><br/>“What happened?!” Gael Easton exploded, “The international police have been after me for more than ten days, I have lost so much money because I haven’t been able to do anything for these ten days!” <br/><br/>“Aren’t you okay?” Daisy Zane laughed. <br/><br/>“So I think it’s you who’s messing with me.” Gael Easton cursed, “Who else besides you is so inhumane. Who else besides you could have leaked my whereabouts, leaking them for a few days, then going dark for a few days. You’ve been playing both me and the international police!” <br/><br/>Daisy Zane chuckled softly, “Why are you afraid of them? It’s a private matter between you two. Oh, you’re afraid they’ll abuse their power.” <br/><br/>“I’m not afraid of him! I just find it troublesome. You’d better fix it now.” Gael Easton said, “And you, get back here now! Don’t wait for me to bring people to catch you. I don’t have time.” <br/><br/>“Then why do you think you don’t have time.” nove(l)bi(n.)com<br/><br/>Holt Lawrence was suddenly at a loss for words. <br/><br/>“If it weren’t for me, who would go to a place like Cold Green Village to kill an old woman who could barely move and a girl in her twenties.” Daisy Zane’s voice remained steady, her expression unchanged, but a single tear fell from her left eye, landing directly on the ground, “Edward Kirsten, that madman, there’s nothing he wouldn’t do. He just wanted to tell me. No matter where I am, what I’m doing. As long as he wishes, I can never beat him.” <br/><br/>Daisy Zane reached up to touch the pendant hanging from her neck. <br/><br/>That day, if she’d just gone home an hour earlier, just an hour. If the car had been driven a little faster, she could have saved them. They wouldn’t have been touched by those beasts. <br/><br/>“But... in the photos you sent from the crime scene, both rooms were ransacked.” Holt Lawrence said, “They were looking for something.” <br/><br/>“If they truly were looking for something important, they wouldn’t have killed.” Daisy Zane answered quietly. <br/><br/>“You also once suspected Victoria Zane’s identity.” Holt Lawrence said. <br/><br/>Daisy Zane didn’t respond. At that time, she had indeed been suspicious when they couldn’t find the murderer, so she had gone to Johanes Miles for answers, but came up empty-handed. <br/><br/>“Nana, you’re carrying too much on your own.” Holt Lawrence said, “Not every incident involving Edward Kirsten needs to be your responsibility.” <br/><br/>Daisy Zane wiped the tear off her eyelashes, paused for a moment and said: “No it doesn’t. If anything happened to you, and it was related to Edward Kirsten, I wouldn’t interfere. <br/><br/>Holt Lawrence: “......I knew it, you wouldn’t show me your human side.” <br/><br/>“I believe it’s a waste.” <br/><br/>“I won’t bother you anymore, I’m going to sleep.” <br/><br/>“So early, are you trying to nurse your health?” Daisy Zane teased. <br/><br/>“None of your business.” With that, Holt Lawrence hung up the phone. <br/><br/>But after hanging up, Holt Lawrence thought about it and ended up transferring some money to the Healing Manor. And he included a message: <br/><br/>[Please do your best to treat him.] <br/><br/>As for Daisy Zane, after hanging up the phone, she just kept staring at the glass surface, at the characters ” she had written. <br/><br/>Her mind was filled with vivid, bloody images, the ground drenched in fresh blood, a sea aflame reaching for the sky, gunfire ringing out everywhere... <br/><br/>She closed her eyes and furrowed her brow, massaging her temple. <br/><br/>The surrounding darkness swirled and swooped down on her like a giant whirlpool, threatening to swallow her whole. <br/><br/>All of a sudden, the room’s doorbell rang, tugging her back from the abyss of darkness. <br/><br/>Daisy Zane opened her eyes and looked at her reflection on the glass. She massaged her temple again, took a deep breath and went to open the door....\t\t\t\t\t\t</div>", "images": {}, "success": true}