{"id": 175, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223535.html", "title": "Chapter 175 - 165: Under Alvin Phantom’S Command", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 175 - 165: Under Alvin Phantom’S Command</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 175: Chapter 165: Under Alvin Phantom’s Command <br/><br/>Translator: 549690339 <br/><br/>After making a call to Michael Jackson and briefly explaining the situation, he swiftly arranged everything. <br/><br/>Kevin Clark went to get stitches, without wanting Daisy Zane to follow him. <br/><br/>Daisy Zane didn’t follow him in, she just waited outside. <br/><br/>Her cell phone was now submerged at the bottom of the river inside the nanny car. She borrowed a cell phone from Jackson and called Holt Lawrence. <br/><br/>“It’s me.” <br/><br/>“Ah, are you okay?” Lawrence asked, “I saw the news.” <br/><br/>“I’m fine.” Daisy Zane leaned on the chair, looking up at the wall opposite her, <br/><br/>“Find out who caused the accident.” <br/><br/>“I’ve already checked it out,” Lawrence said, “I looked it up as soon as I saw the news online. Do you want me to send you the information? To your phone?” “No need,” Daisy Zane closed her eyes and said, “Just give me a brief overview.” <br/><br/>“Alright,” Lawrence continued, “The mastermind is Benjamin Hobson’s mother.” <br/><br/>Daisy Zane pinched her fingers. <br/><br/>“She’s currently staying with the Miles Family. The mobile number she used to contact the outside world was previously used by a servant of the family,” Lawrence explained, “She also borrowed a high-interest loan using the servant’s identity.” <br/><br/>Daisy Zane kept pinching her fingers, knowing that Benjamin’s mother must be aware of Kevin Clark’s people keeping an eye on her, so she used someone else’s mobile number to contact the outside world. <br/><br/>“She borrowed 10 million from the high-interest loan and gave it to a small foreign gang,” Lawrence continued, “The gang is all about taking money to do business. As long as the money is in place, they’ll do anything. I found the gang by tracing the car that hit you and then traced it back to Benjamin’s mother.” <br/><br/>“The target was me.” <br/><br/>“Yes, her main demand in the text messages was to target you,” Lawrence said, “Although Benjamin’s mother used someone else’s mobile number, she still used her own original phone. I traced her phone to confirm it was her.” <br/><br/>Daisy Zane opened her eyes, and they were bloodthirsty. <br/><br/>It was her fault that Kevin Clark got hurt and nearly cost the lives of the driver and Anisa Cooper. <br/><br/>“Nana, however, Benjamin’s mother can completely deny any involvement, claiming the servant used her phone,” Lawrence explained, “Without concrete evidence that it was her, it’s difficult to pin down the responsibility. Besides, being able to borrow a high-interest loan under a servant’s identity, that’s not easy to deal with.” <br/><br/>Daisy Zane let out a soft laugh: “There are ways to make her confess. That gang, take them down. And, have your guys wait at the Miles’ place.” <br/><br/>Lawrence and Robinson Scott had people stationed in Truro City. They didn’t follow Daisy Zane on a daily basis but were always ready to be called upon. <br/><br/>Lawrence paused for a moment, not knowing why she was so angry, but he quickly replied, “Okay.” <br/><br/>These people were incredibly skilled. <br/><br/>Xavier Dominic and Juan Wright both worried that Daisy Zane would be bullied if she went alone, so they accompanied her to the Miles Family. <br/><br/>As they arrived outside the Miles Family villa, they saw a line of black Mercedes-Maybachs parked outside, stretching down the road. <br/><br/>“What the hell?” Xavier Dominic watched the scene from the car, “Whose power is this? What are they up to? Lucia, don’t worry, it’s just a small scene. We can call for backup too.” <br/><br/>“No need,” Daisy Zane said, preparing to get out of the car. <br/><br/>Xavier Dominic urged, “Lucia, don’t get out yet, figure out the situation first...” Before he could finish, Daisy Zane had already left the car. <br/><br/>Juan Wright and Xavier Dominic exchanged glances before quickly getting out of the car as well. <br/><br/>Then they saw a man emerge from the first car opposite and run towards them. <br/><br/>As soon as the man appeared, all the people in the cars behind him got out too. Standing tall and uniform in their black suits. <br/><br/>Seeing the man running towards them, Juan Wright and Xavier Dominic both moved in front of Daisy Zane, shielding her tightly. <br/><br/>Daisy Zane: . <br/><br/>“What do you want?” Xavier Dominic dropped his usual lazy demeanor altogether. <br/><br/>The man glanced at them, then looked past them to see Daisy Zane. <br/><br/>Daisy Zane came out from the side. <br/><br/>The man immediately moved to the side as well, bowing slightly and saying, <br/><br/>“Second Branch, awaiting your command.” <br/><br/>There was no specific title for her, and in order to hide her identity further, he had omitted four words. <br/><br/>It should have been, “Under the command of Alvin Phantom’s Second Branch, awaiting your orders.” <br/><br/>But from his tone and movements, one could see his respect, or rather, awe. <br/><br/>Juan Wright and Xavier Dominic very neatly and slowly turned their heads to look at Daisy Zane, their faces filled with astonishment. <br/><br/>Daisy Zane had her hands in her pockets, her expression unchanged throughout, but her whole body was filled with a murderous aura. She whispered, “Surround them outside. Control the situation inside.” <br/><br/>The man’s head lowered further and he replied, “Yes!” <br/><br/>Then he straightened up, turned around, and raised his hand towards the people behind him. <br/><br/>Everyone immediately took action...\t\t\t\t\t\t</div>", "images": {}, "success": true}