{"id": 176, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223537.html", "title": "Chapter 176 - 166: Live Stream Is Out", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 176 - 166: Live Stream Is Out</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 176: Chapter 166: Live Stream is Out <br/><br/>Translator: 549690339 <br/><br/>The door of the Miles Family’s home opened, and Daisy Zane’s people swarmed in. <br/><br/>From the entrance to the villa entrance, guards stood on both sides of the road. <br/><br/>Daisy Zane entered the villa and glanced at its exterior before retracting her gaze. <br/><br/>Juan Wright and Allonzo Hobson looked at each other and then followed her into the villa. <br/><br/>As soon as they reached the entrance, a shout came from inside. It was Johanes Miles’s voice, “Who are you? What are you doing! Breaking into a private residence, be careful, I’ll call the police.” <br/><br/>There was also Charles Hobson’s voice: “What are you doing? Who let you in?” <br/><br/>Johanes Miles may have been stopped from calling the police. He shouted again, “I dare anyone to touch me?!” <br/><br/>“Let him call the police.” Daisy Zane stepped into the villa and said, “Don’t stop him; it’ll save us some trouble.” <br/><br/>As soon as her voice came out, the sound in the living room suddenly disappeared. <br/><br/>Daisy Zane walked into the living room and stood at the entrance of the living room. After seeing the layout inside, she didn’t walk any further. <br/><br/>Allonzo Hobson and Juan Wright followed her, like guards on either side. <br/><br/>Upon seeing Daisy Zane, the Miles family members seemed to have paused, watching her in silence. <br/><br/>“Daisy Zane?” Charles Hobson was the first to speak, but she remained motionless after speaking. <br/><br/>The first to react was the Old Master of the Miles Family, who was standing on the stairs and preparing to go down. He held the handrail and went down immediately. completely ignoring the dark crowd in the living room. and said affectionately, “Is Daisy here?” <br/><br/>His voice was so affectionate that it seemed as if Daisy Zane often came back. <br/><br/>As soon as the Old Master spoke, Johanes Miles came to his senses. He looked at Daisy Zane and then at the two people behind her. <br/><br/>He didn’t know Juan Wright, but he did know Allonzo Hobson. Follow current novels at novelhall.com)<br/><br/>The young master of the Imperial Capital, who had been playing with the Third Master of the Clark Family since childhood. <br/><br/>If they could build a relationship with him, the Miles Family would be able to revive even from bankruptcy. <br/><br/>“Young Master Hobson?” Johanes Miles immediately put on a smile and straightened his clothes, “Daisy, please bring Young Master Hobson in to sit. <br/><br/>Why are you standing at the door? Hurry up and make some tea.” <br/><br/>The servants glanced at the ferocious black-clothed men beside them, and no one dared to move. <br/><br/>“No, thank you, Director Miles.” Allonzo Hobson smiled and said, “We wouldn’t dare drink this tea. What if we end up horizontal after drinking it, it’s not worth it.” <br/><br/>Johanes Miles was stunned, and the smile on his face froze for a moment: “Young Master Hobson, you really have a sense of humor.” <br/><br/>“Not at all, I’m just telling the truth.” Allonzo Hobson decided to maintain his smiling face to the end. <br/><br/>Over a hundred people, just increasing but not decreasing. However, growth was slow. <br/><br/>“There are really people watching.” Daisy held the phone, with the whole phone focused on herself. <br/><br/>Filming from bottom to top, the angle wasn’t great. <br/><br/>But the 360-degree flawless Daisy Zane still looked good on the screen. <br/><br/>“Sister, don’t film yourself, turn it off quickly.” Allonzo just made a call and arranged help. He was preparing to make another call. <br/><br/>“It’s futile!” Amelia glared at Daisy, her face full of malicious smiles, “I’ve been live-streaming since your people came in! It’s already been broadcasted! Just wait for your reputation to be ruined. No matter who you call, it won’t help unless you can make people forget.” <br/><br/>“Really?” <br/><br/>Daisy chuckled lightly. <br/><br/>Then Allonzo Hobson saw the comments on the live stream and the voice on the phone suddenly stop. <br/><br/>Sea King: [Yes, Boss, we have been watching you. Someone with a white name sent us the link, saying it was a good chance to see you.] <br/><br/>Fuck Heaven Fuck Earth: [That’s right, the one with the white name, he even took money. We bought the link from him. Just to see you.] <br/><br/>Yesterday Ate Too Many Chili Peppers: [That’s right, it’s been a long time since we last saw you. The distance between us can’t quench the love we feel for our <br/><br/>Boss. My love for Boss is like the raging river, wave after wave, waves in my heart.] <br/><br/>Today’s KPI Task: [I just popped up to say hello, my KPI task is not complete yet, so I’ll leave first.] <br/><br/>Little Lazy Crowd Clothes: [Boss, eat more, you’ve suffered.] <br/><br/>Hope Endures: [To the person above, please type the words correctly. My boss must be the attacker.] <br/><br/>Seeing the Boss Costs Eighty-Eight: [What do you mean by attacker or receiver? I just came in and didn’t see it. Does Boss have a girlfriend?!] <br/><br/>I Belong to the Boss: [What! Boss has a girlfriend!] <br/><br/>Sea King: [Spread the word, Boss has a girlfriend.] <br/><br/>Broke with Only Money Left: [What! Boss is the receiver?!?!?!] <br/><br/>“Young Master Hobson? Young Master Hobson?” The person on the other side of the phone, when Allonzo didn’t respond, called out for him. <br/><br/>Allonzo came back to his senses, looked at Daisy, and said something on the phone, “Ah, that, that... it’s nothing.” <br/><br/>His voice was floating, barely audible even to himself. <br/><br/>Seeing that the comments on the live stream became more and more skewed, Daisy whispered, “Did you think I wouldn’t know who you are if you changed your usernames?” <br/><br/>Instantly, the comments quieted down, and no one dared to speak anymore. <br/><br/>‘I ! ! !” Allonzo took another deep breath, looking at Daisy. <br/><br/>He felt as though he had encountered some sort of demon or that he hadn’t woken up yet..\t\t\t\t\t\t</div>", "images": {}, "success": true}