{"id": 174, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223533.html", "title": "Chapter 174 - 164: It’S Good That Nothing’S Wrong", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 174 - 164: It’S Good That Nothing’S Wrong</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 174: Chapter 164: It’s Good that Nothing’s Wrong <br/><br/>Translator: 549690339 <br/><br/>The car was gradually sinking deeper underwater. Harton Clark unbuckled his and Daisy Zane’s seat belts, noticing that Daisy had her eyes closed and was unresponsive. <br/><br/>He became anxious and completely ignored the two unconscious people in the front. He brought Daisy out of the car, preparing to swim upwards with her. <br/><br/>However, as soon as they left the car, Daisy opened her eyes. She tried to take a breath and ended up choking on water. <br/><br/>Harton immediately covered her mouth, anxiously looking at her, his eyes asking if she was okay. <br/><br/>Daisy finally recognized Harton and immediately regained her composure. <br/><br/>Both of them were underwater, their hair floating. <br/><br/>Daisy seldom saw Harton in such a state of urgency. She shook her head, eyebrow furrowing at the sight of the bleeding wound on his forehead. Seeing that she was alright, Harton continued to ascend with her. <br/><br/>But Daisy tugged at him and pointed back towards the car. <br/><br/>Harton, who was focused on her, only then remembered that there were still two people left in the car. <br/><br/>He signaled for Daisy to swim up first while he went back to rescue the others. <br/><br/>The car was still sinking, water filling up the interior. The water pressure inside and outside the car became almost equal. Harton pulled open the car door by the driver’s seat with force. <br/><br/>He pulled out the driver first and then, when attempting to get Anisa Cooper, Daisy opened the car door from another side and dragged Anisa out. <br/><br/>They shared a glance, each of them carrying a person, and continued to swim upwards. <br/><br/>But after a short while, they saw a group of people swimming towards them from a distance. <br/><br/>They shared another glance. Harton shook his head, indicating it was not his team coming. <br/><br/>If they were not his team and not rescuers, then likely they were coming to kill them. <br/><br/>The swift approach of the five men offered them an answer. <br/><br/>Upon the sight of them, both Harton and Daisy reached a unified decision – to ignore them and continue swimming upward. <br/><br/>Because not only the two unconscious people but also they themselves needed to surface soon. <br/><br/>It was until the five men got close and made the first attack, that Harton and Daisy responded. <br/><br/>At first, they held nothing in their hands, probably intending to cover Harton and Daisy’s mouth to suffocate them underwater. <br/><br/>Under the water resistance, Daisy, hugging Anisa Cooper with one arm, managed to knock one out with the other hand. Harton, after knocking one out with a punch, <br/><br/>Pulled out their knives and aimed at them. <br/><br/>As they lunged, Harton dodged, snatched their knives, and with a flick of his wrist, plunged the knife into the man’s right ribs. <br/><br/>He didn’t hesitate in the slightest. <br/><br/>First, they got the driver and Anisa Cooper onboard. The rescuers prioritized treating them. <br/><br/>Harton Clark and Daisy Zane boarded another one. <br/><br/>The driver and Anisa Cooper regained consciousness on the lifeboat. But they were still promptly taken to the hospital along with the other two. <br/><br/>On the way to the hospital, Harton Clark borrowed a cell phone to call Michael Jackson. <br/><br/>By the time they arrived at the hospital, Michael Jackson and his crew were already there. <br/><br/>As someone at the scene had taken pictures of Daisy Zane, numerous reporters were waiting at the hospital entrance. <br/><br/>Michael Jackson had the reporters held back to prevent them from sneaking into the hospital. Allonzo Hobson and Juan Wright also controlled the news online. <br/><br/>Allonzo Hobson told all the media outlets directly that if anyone dares to report without accuracy, they would share the same fate as Zealot Media. <br/><br/>At the hospital, all four of them were examined thoroughly. <br/><br/>The driver and Anisa Cooper both had mild concussions. They were feeling dizzy and nauseous, so they were temporarily hospitalized. <br/><br/>Harton Clark had a bruise on his shoulder from a bump in the car and a minor cut on his forehead. Other than that, he was fine except for the severe cuts on his hand, which needed stitches. <br/><br/>As for Daisy Zane, she was not hurt at all. She only hit her head in the car, which hurt for a while, but she was fine after the pain subsided. <br/><br/>After her examination, she immediately headed over to where Harton Clark was. <br/><br/>But as soon as she opened the door, Harton Clark was waiting for her outside. <br/><br/>“What did the doctor say? <br/><br/>“How are you?” <br/><br/>Both spoke at the same time. <br/><br/>Harton Clark laughed a little, “I’m fine, the wound is not deep, it’s just a flesh wound, and the bleeding has stopped. I’ll get stitched up in a bit, no need to worry.” <br/><br/>Daisy Zane frowned upon hearing this, “Will it leave a scar?” <br/><br/>“No.” Harton Clark took her into his arms with his other hand, “How about you? Are you hurt anywhere?” <br/><br/>“No, everything is fine.” Daisy Zane buried her face in his chest, listening to his heartbeat. Her voice muffled. <br/><br/>During the car accident, Harton Clark used all his strength to press her into the seat to minimize her injuries. But he didn’t take care of himself at all. <br/><br/>“As long as you’re fine.” Harton Clark hugged her arm with a bit more force, pulling her closer, his voice laced with lingering fear, “As long as you’re fine.” <br/><br/>That moment when he couldn’t wake Daisy Zane up, for the first time, he truly understood the weakness that fear could bring. <br/><br/>It could indeed make a person feel cold to the core, leaving their mind blank. <br/><br/>“What about your head?” <br/><br/>“It’s just a minor cut.” Harton Clark said..nove(l)bi(n.)com\t\t\t\t\t\t</div>", "images": {}, "success": true}