{"id": 172, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223529.html", "title": "Chapter 172 - 162: Chasing Me Away?", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 172 - 162: Chasing Me Away?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 172: Chapter 162: Chasing Me Away? <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane had never been in the habit of looking out through the cat-eye, but today, her hand on the doorknob, she paused and glanced out through it. <br/><br/>Then she saw a familiar face. <br/><br/>She didn’t notice it herself, but the speed at which she opened the door was a bit faster than usual. <br/><br/>The room door opened, and Kevin Clark stood outside, wearing black suit pants and a shirt. The top button of the shirt was undone. <br/><br/>Above that, vermilion thin lips, a delicate nose tip, a high-bridged nose, narrow and elongated eyes, profound and enchanting, filled with a gentle smile. <br/><br/>His hair was also a little shorter than the last time they met, probably just trimmed. The hair on the right side could just cover a little bit of his eyebrow tail. <br/><br/>“What? Don’t you recognize me after not seeing me for more than half a month?” Kevin Clark raised his hand and touched her face. <br/><br/>Daisy’s eyelashes trembled, “Why are you back? Weren’t there a few more days to go?” <br/><br/>“I missed you so much,” Kevin said, “so I came back early.” <br/><br/>Daisy stepped aside to let him in, her eyes never leaving him. <br/><br/>Kevin brought his suitcase in and closed the door with ease. <br/><br/>However, as soon as he put the suitcase down and straightened up, Daisy stepped forward and rested her forehead on his shoulder. <br/><br/>Her arms didn’t move, hanging loosely at her sides. <br/><br/>Kevin was momentarily stunned, then immediately raised his hand to hug her. He could sense that Daisy’s mood was not good, but he didn’t expect her to suddenly act like this. It seemed that something was really bothering her. <br/><br/>“What’s wrong?” he asked gently, “Do you miss me that much?” <br/><br/>“I just need to lean on you for a while,” Daisy said softly. <br/><br/>Kevin lowered his head and kissed the top of her hair, “I’m here. If you’re tired, you can rest for a while.” <br/><br/>Daisy didn’t say anything, just quietly sniffing the scent of eaglewood on him. After a while, she raised her hand and grabbed the shirt on his waist. Kevin didn’t say anything either, just letting her lean on him quietly at the entrance. <br/><br/>After a long time, Daisy moved and turned her face to rest on his shoulder. She moved the fingers grabbing his shirt, stretched out her index finger, and tickled Kevin’s waist through the shirt. <br/><br/>“Hey, little girl, what are you doing?” Kevin asked with a smile. <br/><br/>Daisy didn’t say anything but tickled him again. <br/><br/>Kevin caught her hand, holding it in his own and said, “If you keep messing around, you’ll be responsible for the consequences, understand?” <br/><br/>Daisy laughed, withdrew from his embrace, glanced at him, and then walked into the room. <br/><br/>Kevin watched her back, somehow feeling that she was just using him and then throwing him aside. <br/><br/>Daisy went to the kitchen and simply brewed him a cup of tea, handing it to him saying, “The director’s gifted tea.” <br/><br/>Kevin sniffed it, not bad, “Is this show about to wrap up? <br/><br/>The chef specifically cooked meals for Kevin Clark and Daisy Zane. <br/><br/>It had been a while since it was sent up, so it was obviously being freshly made. <br/><br/>“It smells good.” Kevin Clark said, giving her neck a gentle kiss. Daisy Zane dodged again: “Can you behave?” <br/><br/>Kevin Clark smiled and whispered softly, indulging her, “Alright.” <br/><br/>The deep voice in her ear and the warm breath on her collarbone made Daisy Zane curl her fingertips, feeling her skin a little hot. <br/><br/>But Kevin Clark didn’t show any intention of letting her go, so she didn’t move and let him hold her. <br/><br/>It wasn’t until the doorbell was pressed that Kevin Clark kissed Daisy Zane again and let her go to open the door. <br/><br/>Afterwards, Kevin Clark sat on the sofa eating, while Daisy Zane picked up her cell phone and sat next to him, playing a game. <br/><br/>“This lotus root is good.” Kevin Clark picked up a piece and brought it to Daisy Zane’s mouth, “Try it.” <br/><br/>The lotus root slice was quite large, so Daisy Zane took a bite and looked at it, then lowered her head to continue playing her game. <br/><br/>After a fierce gunfight ended, Daisy Zane looked up to eat the rest of the lotus root slice, but she didn’t see the half-eaten piece on the plate next to her. <br/><br/>“What are you looking for?” Kevin Clark said, feeding her a piece of deboned fish. <br/><br/>Daisy Zane chewed slowly, looking at Kevin Clark. <br/><br/>“Want another piece?” <br/><br/>Daisy Zane shook her head, lowering her gaze back to the game. He actually ate her lotus root... <br/><br/>Kevin Clark hooked up the corner of his lips and continued eating. <br/><br/>After finishing the meal and cleaning up, Kevin Clark was about to leave. Daisy Zane escorted him to the door: “Aren’t you taking your suitcase?” <br/><br/>“There are things in there for you.” <br/><br/>“Don’t tell me there’s more medicine?” Daisy Zane frowned. <br/><br/>“There are also snacks.” Kevin Clark said, “Some snacks I brought from M <br/><br/>Continent. ” <br/><br/>Daisy Zane raised her eyebrows, so he had been to M Continent. “Little girl...” Kevin Clark patted her head, “Let’s discuss something.” “Huh?” Daisy Zane looked up at him. <br/><br/>“In the future, don’t eat so many ice creams at once.” Kevin Clark said in a negotiating tone, “Deal?” <br/><br/>Daisy Zane thought for a moment, “Two?” “One.” Kevin Clark’s tone was fierce. <br/><br/>“...Alright.” <br/><br/>“Don’t try to deceive me.” Kevin Clark leaned in closer, “I’ll find out.” <br/><br/>Kevin Clark smiled, kissing the corner of her lips, “I’m leaving, get some rest.” <br/><br/>Daisy Zane casually responded..\t\t\t\t\t\t</div>", "images": {}, "success": true}