{"id": 177, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223539.html", "title": "Chapter 177 - 167: Settling Accounts", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 177 - 167: Settling Accounts</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 177: Chapter 167: Settling Accounts <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane threw the cell phone to Amelia Miles and looked down at her fingertips, saying, “You think your live stream can be broadcasted?” <br/><br/>“You, you...” Amelia looked at the comments on the screen in disbelief. <br/><br/>The camera was no longer aimed at Daisy Zane, and the comments came back to life. <br/><br/>[Ouch, that scared me. This woman doesn’t look like a good person.] <br/><br/>[Damn! She’s so ugly.] <br/><br/>[Little girl, I advise you to be kind. You can’t beat our boss.] <br/><br/>[Hey girl, please move the screen away from your face, I feel a bit nauseous.] <br/><br/>These people were ridiculing Amelia relentlessly. <br/><br/>Daisy Zane glanced over each of the Miles family members and whispered, “Forget the live streaming; do you think the CCTV cameras in your house still work?” Updated from novelb(i)n.c(o)m<br/><br/>Everyone in the Miles family stared at Daisy Zane in horror. <br/><br/>Amelia looked at the comments insulting her, then immediately turned off the live stream and threw her cell phone on the ground. She grabbed a handful of hair, irritated and muttered something. <br/><br/>“If I wanted to, I could make sure none of you leave this villa,” Daisy Zane said, looking at the broken cell phone, “and I guarantee that no one would know.” <br/><br/>Allonzo Hobson swallowed nervously. A perfect match, truly a perfect match. Kevin Clark and her together were indeed a perfect match, even in the way they conducted themselves. <br/><br/>None of the Miles family members dared to speak. They never imagined Daisy Zane to be so powerful. They could sense she wasn’t joking, but indeed had such capabilities. <br/><br/>Old Master Miles, despite his age and having seen many things, was frightened by the girl in front of him. <br/><br/>Amelia also stood to one side and kept her head down in submission. <br/><br/>Daisy Zane looked towards Jasmine Anderson and Michael Blackman immediately pulled her in front of her. <br/><br/>“What do you want to do?” Jasmine glared at her and said, “You dare come after ruining my son and husband!” <br/><br/>“Your son and husband did so many disgraceful things, and you blame others for it?!” Allonzo Hobson snapped. <br/><br/>“It’s all because of you. If it weren’t for you, our family would be fine! You’re a disaster star! A jinx.” <br/><br/>As Jasmine cursed, she tried to step forward and hit Daisy but was held back by Michael Blackman. <br/><br/>“Why don’t you go die! How are you still alive!” <br/><br/>Daisy Zane, seemingly deaf to her words, asked Michael Blackman, “Give me her right hand.” <br/><br/>Michael Blackman grabbed her right hand, and although Jasmine instinctively resisted, her strength was nothing compared to his. <br/><br/>“What are you doing? What else do you want to do?” <br/><br/>“It’s not about what I want to do,” Daisy Zane replied, “It depends on what you do.” <br/><br/>“What do you mean?” <br/><br/>“Have you heard about the treatment someone like Benjamin Hobson receives in prison?” Daisy Zane stared into her eyes, as if she could see straight into her fear, “He would be treated the same way he treated others. Even worse, he would be treated like an animal.” <br/><br/>Jasmine’s expression suddenly froze, and her body gradually began to tremble. <br/><br/>The Miles family’s faces weren’t good either. They remained silent, and even their breathing seemed to grow lighter. <br/><br/>It was one thing to know about it, but hearing it from someone else was different. <br/><br/>Especially after hearing it, they felt as if it was already happening to Benjamin Hobson. They used to console themselves by thinking about the best-case scenario. <br/><br/>But after hearing this, their inner defenses crumbled. <br/><br/>Even Xavier Dominic felt chills running down his spine as he listened to her talk. <br/><br/>“Do you need me to share some examples?” <br/><br/>“Ah—” Jasmine suddenly screamed and struggled. “I won’t listen! I won’t listen! Don’t say it! Don’t say it! It won’t happen! It won’t happen! You’re lying! You’re lying.’ <br/><br/>“You know in your heart if I’m lying to you or not.” <br/><br/>“It won’t happen, it won’t happen, it won’t happen...” Jasmine was just showing a defiant expression, but now she suddenly burst into tears and mumbled, “It won’t happen...” <br/><br/>“Maybe I can make him suffer less.” Daisy Zane said, “Death is inevitable, but perhaps he can endure less suffering while alive.” <br/><br/>Jasmine looked at her, her eyes reignited like ashes, “What did you say?” <br/><br/>“It depends on what you do.” Daisy Zane replied, “Tell the truth, explain what you did and how you did it to the police. Otherwise, I’ll make your son’s life even worse.” <br/><br/>Jasmine stared at her for a while and then asked, “Are you telling the truth? <br/><br/>Really? Will you do as you say?” <br/><br/>Daisy Zane leaned in slightly, looking at her and whispered, “You have no choice but to trust me. Do you want to see your son’s suffering every time you have a nightmare? Do you want to hear him say it was because of your evasion that he had to endure all that?” <br/><br/>Xavier Dominic looked at her, his body gradually covered in goosebumps. It wasn’t scary for someone to be able to fight; if there were more people, they could always take care of them. The scariest part was, while this person could fight, she was also calculating and manipulative. <br/><br/>Daisy Zane’s tone had remained even since she entered, and even her speaking pace was slow. Except for being colder and more ruthless than usual, there was nothing strange. <br/><br/>But every sentence she uttered stirred fear. Every word touched the softest part of one’s heart. <br/><br/>“I don’t want to, I don’t.” Jasmine seemed to go insane, “It was me, it was me who bought her mobile number from the servant. It was also me who secretly used her ID to take out a loan. And it was me who contacted people abroad to kill you and silence you. I admit it, I admit it all.” <br/><br/>“Sister-in-law! What are you talking about!” Charles Hobson cried. <br/><br/>“It’s me, it’s all me.” Jasmine stared wide-eyed, struggling to get closer to Daisy Zane, “Keep your word, keep your word.” <br/><br/>Daisy Zane stood up straight, not looking at her anymore, “You go and confess, and I will naturally do my part.”\t\t\t\t\t\t</div>", "images": {}, "success": true}