{"id": 173, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223531.html", "title": "Chapter 173 - 163: Car Accident", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 173 - 163: Car Accident</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 173: Chapter 163: Car Accident <br/><br/>Translator: 549690339 <br/><br/>Upon finishing the shooting at Truro Film City, the drama crew moved to the next shooting location. <br/><br/>It happened that Daisy Zane had a day off, so she planned to pay a visit to Charles Amos in the Everlasting Palace and rest for a day. <br/><br/>“Okay, it’s all here.” Anisa Cooper checked all the luggage, got into the nanny car, and said, “Let’s go.” <br/><br/>Daisy Zane was working on a design draft using a tablet. Hearing the conversation, she handed Anisa a bottle of water with the cap already unscrewed. <br/><br/>Anisa took it and drank a sip: “Thank you, Daisy.” <br/><br/>Daisy Zane responded without looking up. <br/><br/>“It doesn’t seem like we brought a lot of things, but it’s quite a bit when cleaning up,” Anisa said, “Daisy, Sister Emily told me yesterday that another clothing brand wants you to be their spokesperson, and if you say yes, they’ll provide clothes for you all year round.” <br/><br/>“No need,” Daisy Zane said while drawing, “I have clothes to wear... How’s Sister Emily doing?” <br/><br/>“She’s recovering well,” Anisa said, “I saw her on a video yesterday, and her complexion looked good. And her mood seemed fine as well.” <br/><br/>“Hmm, maybe it’s because she’s away from men.” <br/><br/>Kevin Clark glanced at her with a raised eyebrow. <br/><br/>Feeling his gaze, Daisy Zane quickly changed her response, “Maybe it’s because she’s away from the scumbag.” <br/><br/>Anisa couldn’t help but smile when she saw the doting yet helpless look on Kevin Clark’s face. <br/><br/>A while later, the driver got in, and Daisy Zane handed him a bottle of water as well. <br/><br/>As the car drove on, Anisa sat in the co-pilot seat, and after replying to a couple of messages, she said, “Daisy, your popularity is really high these days.” Follow current novels at novelhall.com)<br/><br/>“Yeah, I saw it,” Daisy Zane replied, “Someone is spreading rumors that I slept with Serena Buster.” <br/><br/>Anisa just took a sip of water and almost spewed it all over the windshield. She hurriedly wiped it off with tissue paper and exclaimed, “I, I didn’t see that?” <br/><br/>After “Fall of the Quince” aired, Daisy Zane’s popularity skyrocketed. Not only did she receive numerous endorsement offers and scripts, but there were also popular variety shows and interviews. <br/><br/>Of course, these were all forwarded to Hill Dawson, but Daisy Zane didn’t want to accept any endorsements, interviews, or most of the scripts. <br/><br/>With fame comes controversy, and there had been plenty of negative voices. <br/><br/>For instance, many rumors sprouted. <br/><br/>Her supposed relationship with Serena Buster was one of them. <br/><br/>The movie’s director mentioned Daisy Zane suggested casting the newcomer, <br/><br/>Serena, in an interview. <br/><br/>Gradually, the rumors about the two of them spread. <br/><br/>It took almost an hour to drive back to Everlasting Palace from the drama crew. <br/><br/>Anisa chatted for a while and then fell asleep after playing with her cell phone for a while. <br/><br/>In the car, except for the sound of Kevin typing on a keyboard and Daisy occasionally tapping on the screen, there was silence. <br/><br/>Both of them were doing their own things, very focused, without disturbing each other. <br/><br/>The car was going a bit fast but smooth, merging with traffic while going onto the bridge. <br/><br/>However, just as they reached the middle of the bridge, the body of the car was suddenly hit, giving it a harsh jolt. <br/><br/>Kevin immediately grabbed Daisy Zane’s hand, then closed his computer and looked out the car window. <br/><br/>Daisy Zane also looked at the window on his side. <br/><br/>Anisa’s head was knocked against the car window and woke up with a start, <br/><br/>At that very moment, before the driver could correct the car’s position, the car was hit hard again, harder than the first time. <br/><br/>The driver could not regain control, and the nanny car charged straight towards the railing of the bridge. <br/><br/>Kevin just saw the traffic on the bridge being stopped. The first business car that caused the accident was already parked on the side of the road. The second car to hit them was also a business car of the same type, speeding at them. <br/><br/>Then the nanny car broke through the barrier and fell into the river below. <br/><br/>“Ah!” Anisa was so frightened that she instinctively hugged her head. <br/><br/>Honking and screaming filled the air along with the sound of the vehicle crashing through the barrier. <br/><br/>Kevin immediately tried to open the car door. <br/><br/>The moment the nanny car touched the water, the door was opened, allowing a large amount of water to pour into the car. <br/><br/>However, the moment the car collided with the water’s surface, it was subjected to a huge impact. <br/><br/>The airbags deployed, and the driver and Anisa were knocked unconscious by the airbags. <br/><br/>Kevin held Daisy Zane’s shoulder tightly, pressing her against the seat, but her head still got knocked a little. <br/><br/>At that moment, Daisy Zane’s head suddenly felt like it was exploding with pain. <br/><br/>Suddenly, a series of unfamiliar images flooded into her mind. <br/><br/>She squeezed her eyes shut as the images in her head became clearer. She felt like an experiencer and an observer at the same time. <br/><br/>The surrounding explosions, gunshots, and the sky full of flames. A sniper rifle with a reflective scope flashed before her eyes. She ran desperately to protect someone but was instead hit by a motorcycle racing out of nowhere, falling off the cliff... <br/><br/>Into the icy cold sea... <br/><br/>It seemed like someone was calling her... <br/><br/>She couldn’t hear clearly, nor could she see clearly....\t\t\t\t\t\t</div>", "images": {}, "success": true}