{"id": 178, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223541.html", "title": "Chapter 178 - 168: Eating Soft Rice (Fifth Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 178 - 168: Eating Soft Rice (Fifth Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 178: Chapter 168: Eating Soft Rice (Fifth Update) <br/><br/>Translator: 549690339 <br/><br/>“Sister-in-law, don’t just admit it because of her few words,” Charles Hobson suddenly said, “She’s deceiving you, deceiving you! What are you talking about! <br/><br/>Don’t take everything on yourself, she’s framing you.” <br/><br/>“We didn’t say anything since we came in,” Xavier Dominic said, “It was all her own confession. Where are we framing her?” <br/><br/>Having resolved the matter, Daisy Zane intended to leave. But hearing Charles Hobson speak, she paused and looked at Johanes Miles and Charles Hobson. <br/><br/>Seeing her gaze, Old Master Miles hurriedly said, “Daisy... Is there some misunderstanding?” <br/><br/>Daisy Zane still ignored him, staring at the couple and said, “You two haven’t publicly apologized yet. Remember to do it quickly, or bear the consequences.” “You want me to apologize to you? Dream on!” Charles Hobson cursed. <br/><br/>Johanes Miles pulled him again, “Shut up!” <br/><br/>“Sure enough, Little Sam speaks with a strong attitude,” Xavier Dominic said, “I didn’t believe it when I heard it before, but today was an eye-opener for me.” <br/><br/>“You...” Charles Hobson’s face flushed like a stepped-on tail, but because it was Xavier Dominic, she didn’t dare to curse and had to swallow it back. <br/><br/>“Oh, people. When slandering others as Little Sam, they’re so energetic,” Xavier Dominic said sarcastically, “But she’s the true Little Sam and doesn’t want people to talk about it. Brook Sister, have you ever seen such a shameless person?” <br/><br/>Daisy Zane cooperatively said, “Nope. This is the first time in my life.” <br/><br/>Xavier Dominic laughed out loud sarcastically, making everyone’s hearts shiver, “I’ve really opened my eyes today.” <br/><br/>The Miles family, especially Charles Hobson, were all red-faced in shame. But they dared not speak up, their faces as red as boiled crabs. <br/><br/>Daisy Zane’s gaze swept over them and then paused on Amelia Miles. She almost forgot about the live-streaming matter. <br/><br/>Holt Lawrence had not let the live stream leak out in advance, causing no impact on her. But it had nothing to do with Amelia Miles, the matter still needed to be settled. <br/><br/>She said: “Originally, I wanted to deal with that matter privately. It was your good daughter who spread rumors about me being an illegitimate daughter on the Internet all day long. I had no choice but to deal with it publicly. If you think it’s humiliating and that Miles Group’s reputation has been damaged, then it’s all thanks to your good daughter.” <br/><br/>Johanes Miles and Old Master Miles both looked at Amelia Miles. nove(l)bi(n.)com<br/><br/>“Nonsense! Don’t frame me!”, Amelia Miles immediately stood up and said, “Dad, Grandpa, I didn’t. I didn’t. She’s talking nonsense, she’s talking nonsense.” <br/><br/>Daisy Zane did not want to listen to their messy voices and turned to leave. <br/><br/>Xavier Dominic didn’t come out until he saw Johanes Miles slap Amelia Miles. <br/><br/>No matter how obedient the daughter was, or how fragile, the Miles family would always end up in the same situation if their interests were hurt. <br/><br/>“Young Master Hobson, please help me call the police and catch Jasmine Anderson,” Daisy Zane said. <br/><br/>“Mhm,” Xavier Dominic said, “Don’t worry, we’ll handle the rest. Harton Clark won’t let them go.” <br/><br/>“Mhm.” <br/><br/>When Daisy Zane left the villa’s courtyard, Michael Blackman withdrew from the villa. <br/><br/>“It’s okay, it’ll be better in two days.” <br/><br/>“Yeah.” Daisy Zane gently held his hand and leaned back on the seat, “I’m sleepy. ” <br/><br/>Kevin Clark chuckled, leaned closer, and kissed her on the forehead. “Sleep a little.” <br/><br/>“Yeah.” <br/><br/>Allonzo Hobson couldn’t stand this gentle demeanor from him. As soon as he raised his head, he saw Kevin Clark kissing her through the rearview mirror. Allonzo Hobson: . Can you please consider the single nobles in the car!” <br/><br/>Driving back to the Everlasting Palace, Daisy Zane slept the whole way. <br/><br/>When they arrived at the parking lot, Kevin Clark didn’t wake her but carried her straight out of the car instead. <br/><br/>Daisy Zane woke up as soon as he held her, looked at him, and said, “Your hand.” <br/><br/>“It’s fine,” Kevin Clark said. “I didn’t touch it, go back to sleep.” <br/><br/>“Yeah.” Daisy Zane nuzzled against his shoulder and fell asleep again. <br/><br/>She didn’t know what was wrong, but she had never been this sleepy before, making it hard to even keep her eyes open. <br/><br/>Kevin Clark carried her to her room, and after giving the password, Allonzo Hobson opened the door for them. <br/><br/>After he went in, Allonzo Hobson stood outside the door, rolling his eyes again. <br/><br/>He knew the password, but still, every time he came, he knocked and waited for someone to open the door for him. <br/><br/>After settling Daisy Zane in and checking her pulse to make sure she had no issues, Kevin Clark came out. <br/><br/>Allonzo Hobson returned to his room, and then told Kevin Clark everything that happened at the Miles Family. <br/><br/>Afraid they wouldn’t be able to perfectly convey the scene, Allonzo Hobson and Juan Wright acted it out for Kevin Clark, complete with gestures and dialogue. <br/><br/>“Harton, you have no idea of her aura at that time,” Allonzo Hobson said enthusiastically. “I think she went there intending to slaughter the Miles <br/><br/>Family.” <br/><br/>Kevin Clark just listened quietly. <br/><br/>“Dude, you didn’t see it. I don’t know how she grasped Jasmine Anderson’s hand, and with a little force from her thumb, she broke her finger,” Allonzo Hobson said. “I thought about it for a long time, but I couldn’t do it. That’s so cruel.” <br/><br/>After a pause, he said, “No, it was too cool. So impressive I bled all over my face. <br/><br/>Kevin Clark looked at his hand and grinned slightly. <br/><br/>“You’re so full of yourself,” Allonzo Hobson sat on the sofa. “Third Master, seriously, think about living off your wife.” “I think your suggestion is good,” Kevin Clark said. <br/><br/>“You have no shame.” <br/><br/>“Is having a wife more important than having a face?” Kevin Clark seemed in a good mood. <br/><br/>Allonzo Hobson was speechless. Fine, he didn’t have a wife..\t\t\t\t\t\t</div>", "images": {}, "success": true}