{"id": 179, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223543.html", "title": "Chapter 179 - 169: Paradise City (Sixth Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 179 - 169: Paradise City (Sixth Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 179: Chapter 169: Paradise City (Sixth update) <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane’s confidentiality work has always been well done. Firstly, the security at the film set is well maintained. There’s no chance for stand-ins to get a glimpse of her. <br/><br/>Secondly, Holt Lawrence and Allonzo Hobson are doing good work controlling information online. <br/><br/>Even if photographs were taken, Holt Lawrence’s team is almost always able to deal with them promptly. <br/><br/>As a result, information about Daisy Zane on the Internet is scarce. <br/><br/>Her flight details, daily photos, and even the license plate number of her nanny car are not available. nove(l)bi(n.)com<br/><br/>Even among the stand-ins, there’s a saying going around. “Daisy Zane has deep waters behind her, stay away if you can.” <br/><br/>So when the car accident happened on the bridge, no one knew who it was that fell into the river. <br/><br/>Not until Kevin Clark and Daisy Zane got on the lifeboat and were photographed did it attract attention. <br/><br/>The reporters pretty much arrived at the hospital at the same time as the ambulance. <br/><br/>But the hospital was under the control of people brought by Michael Jackson, so the media didn’t manage to film anything there. <br/><br/>Only photos of the scene in the river, on the lifeboat, and on the ambulance were circulated on the Internet. <br/><br/>And Kevin Clark was also photographed. <br/><br/>Since everyone’s concern was online, Daisy Zane posted a message on Facebook that very night saying she was fine, having only swallowed a bit of water and would be back filming the day after tomorrow. <br/><br/>The entire incident didn’t create too much controversy and the official statement was that it was a traffic accident, which Jasmine Anderson was investigating privately. <br/><br/>The five people in the river were also dealt with by Kevin Clark’s team. <br/><br/>Daisy Zane took another day off at home before heading to the filming location. <br/><br/>The driver and Anisa Cooper were both still in the hospital, so the driver was one of Kevin Clark’s people. As for the assistant... she initially wanted to go alone. <br/><br/>But the day before leaving for the filming location, Robinson Scott showed up. He insisted on following her upon hearing about going to the desert so she ended up taking him along. <br/><br/>Kevin Clark couldn’t join her either due to some matters at the Imperial Capital <br/><br/>Laboratory that he needed to handle. <br/><br/>However, once inside the laboratory, he was only able to guide from the sidelines due to a hand injury that temporarily prevented him from conducting experiments. <br/><br/>So, to a certain extent, the experiment schedule was delayed. <br/><br/>The crew was heading to the desert, but they also filmed a lot of scenes and took many shots at various scenic spots along the way. <br/><br/>Daisy Zane was there to film, but Robinson Scott seemed to be on a sightseeing trip. <br/><br/>Every time he arrived at a new location, he would buy a bunch of souvenirs and send them all back to his dad. <br/><br/>“Yes, you did! You’ve changed,” Robinson Scott looked at her and said, “so much so, that I hardly recognize you.” <br/><br/>Daisy Zane took anther sip of her hot water, without uttering a word. <br/><br/>The next day, Daisy Zane and Robinson Scott set off early and visited three sites along the way. <br/><br/>To Daisy Zane, it was a sourcing trip. She took many photos. Robinson Scott was there simply to splurge. <br/><br/>Daisy Zane thought he seemed to be ill if he didn’t spend money. <br/><br/>It wasn’t until 6 PM that they finally reached Paradise City. <br/><br/>The two of them found a hotel to stay in and ate something there. When it was dark, they drove to the Dark Street. <br/><br/>The two girls were conspicuous as it was in Dark Street, let alone with Daisy Zane’s appearance. <br/><br/>So both of them wore baseball caps and masks. They also wore black clothing. <br/><br/>The nights were a bit chilly there, so they both wore long sleeves. <br/><br/>At first sight, the two of them were wrapped up tightly. If it wasn’t for their long hair, it would’ve been impossible to tell their genders from their appearances. <br/><br/>They looked around store by store from one end of the Dark Street. They even went to a boxing ring to watch a boxing match in between. <br/><br/>“Such blatant cheating, ” Robinson Scott complained, “Good thing we didn’t bet, or we would have lost a fortune. <br/><br/>“You wouldn’t lose anything.” Daisy Zane, who had grabbed a bunch of sunflower seeds inside, cracked one open and said: “If you lost, you would just get up and take a punch.” <br/><br/>“That’s true,” Robinson Scott said. Suddenly he saw a piece of calligraphy hanging by the entrance of a store. His eyes lit up and he pulled Daisy towards it, “Good stuff over here, Lucia. Quick, quick.” <br/><br/>Daisy Zane stumbled a few steps as she was dragged along and crammed the sunflower seed shells in Robinson Scott’s pocket. <br/><br/>The piece of calligraphy was the work of an emperor from over 800 years ago. <br/><br/>The emperor was also a master in calligraphy, well known for his beautiful handwriting. <br/><br/>Robinson Scott’s father was an archeology expert and Robinson had learned how to identify valuable artifacts since he was a child. <br/><br/>Daisy Zane watched as he took out a magnifying glass from nowhere and examined the calligraphy bit by bit. <br/><br/>Seeing his serious demeanor, Daisy Zane knew for sure that it was a genuine piece. <br/><br/>“Shopkeeper, how much for this piece?” Robinson Scott asked. <br/><br/>The shopkeeper made a five sign: “5 million.” <br/><br/>After hearing the price, Robinson Scott interrupted his investigation and looked up at the shopkeeper, “5 million?” <br/><br/>The shopkeeper nodded. <br/><br/>Robinson Scott glanced at him again, then frowned and turned back to the calligraphy, murmuring in his mind: did Dark Street stop being a black-market hub or did he make a mistake. <br/><br/>Is it really this cheap?\t\t\t\t\t\t</div>", "images": {}, "success": true}