{"id": 170, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223525.html", "title": "Chapter 170 - 160: Wishful Thinking", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 170 - 160: Wishful Thinking</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 170: Chapter 160: Wishful Thinking <br/><br/>Translator: 549690339 <br/><br/>The drama crew had been shooting some light-hearted scenes recently. <br/><br/>These scenes were all about the Female Lead’s life before her family fell into ruin, with her parents and elder brother doting on her. <br/><br/>Playful, lively, happy, and mischievous. She would act spoiled with her parents, cling to her elder brother for money, spend lavishly, and make her brother take the blame for her mischief. <br/><br/>On the outside, she was the dignified Lady of the General’s Mansion, but behind closed doors, she was a spoiled and cunning little rascal. Read latest chapters at novelhall.com Only<br/><br/>In fact, since the director had confirmed that Daisy Zane would be playing the Female Lead, he had been worried about her performance in these scenes. <br/><br/>After all, Daisy Zane’s image, especially her personality, didn’t match these scenes. <br/><br/>There was no issue with her acting in the scenes after the Female Lead’s family was annihilated; even the role seemed suitable for her. However, portraying the quirky and lively... <br/><br/>With Daisy Zane’s calm, indifferent, and aloof personality, the director was afraid she wouldn’t be able to pull it off. <br/><br/>But the final result turned out to be even better than what the director had imagined. <br/><br/>Daisy Zane could deliver the desired effect, even surpassing the director’s expectations. <br/><br/>Playfulness, mischief, acting spoiled – it all seemed to come to her naturally. <br/><br/>Moreover, she could immediately snap out of character after filming. It was as if her character was separate from herself. <br/><br/>The director was genuinely astonished by her acting skills. <br/><br/>Everyone on set was amazed by Daisy Zane’s performance, while only Kevin Clark felt heartbroken for her. <br/><br/>He always believed that this was how Daisy Zane used to be. She knew how to act spoiled, cunning, playful, willful at times, and she had a sweet smile. But she had wrapped herself in layers, and now all that was left of her was a cold, distant facade that seemed to prevent anyone from getting close. <br/><br/>Apart from feeling heartbroken for her... Kevin Clark couldn’t help but find the male actor playing her brother especially annoying. The incessant “elder brother” calls from Daisy Zane also felt particularly jarring. <br/><br/>Kevin Clark sat behind the director, watching Daisy Zane through the equipment. <br/><br/>In the June weather, the director didn’t know why, but he felt an ever-growing coldness behind him, getting colder and colder. It got so cold that the hairs on his arms started standing on end. <br/><br/>At the shooting location, Daisy Zane was sitting on the ground, hugging the man’s leg, tilting her head up, pouting, and putting on a pitiable expression. <br/><br/>“Elder Brother, I really only glanced at the Night Pearl, and it broke. I didn’t touch it.” <br/><br/>“Get up. If you didn’t touch it, how could it break?” The man tried to tug his clothes, but couldn’t move them. “That’s Father’s favorite, don’t think I’ll take the blame for you.” <br/><br/>“Will you help me or not? If you don’t help me, I’ll spread the news of your secret meetings with the Lady of Marquis Manor everywhere. I’ll tell everyone! ” <br/><br/>“You...” <br/><br/>“Elder Brother, Father will scold me.” <br/><br/>Caught off guard by his sudden move, Daisy braced her hand against the window and the other on his shoulder. <br/><br/>She frowned slightly, “You...” <br/><br/>Before she could finish speaking, Kevin pressed her head and kissed her... <br/><br/>At first, Daisy struggled with him, using force on her hands and neck. <br/><br/>But soon after, the resistance disappeared. <br/><br/>Kevin immediately tightened his arms, holding her even tighter. <br/><br/>The quiet car was gradually filled with ambiguous atmosphere. <br/><br/>The increasingly chaotic breathing sounds intertwined like vines, growing wildly and tightly entwined. <br/><br/>Kevin’s hand on her waist gently caressed her. Later, it gradually clenched into a fist, trying hard to suppress his own impulses. <br/><br/>After a while, Daisy felt as if she could hardly breathe anymore. And only then, Kevin let go of her, kissing her lips twice more. <br/><br/>His eyes were red, the depths of his dark pupils deep and enchanting. His desire was seductive and would capture one’s heart. <br/><br/>“Why do you look like you’ve been bullied?” Kevin’s voice was filled with laughter, accompanied by a low hoarseness. <br/><br/>Daisy’s heart was beating a bit fast. She slightly pursed her lips and coldly glared at Kevin. <br/><br/>Her eyes were faintly moist, and her usual coldness seemed to be soaked, making others itch in their hearts as they watched. <br/><br/>“What are you doing at noon?” Daisy asked flatly. <br/><br/>Kevin laughed and looked up at her, “I have to go back to Imperial Capital this afternoon. I might be away for a while.” <br/><br/>“So I wanted to give you a kiss.” Kevin said, leaning in and kissing her corner of the mouth, “I won’t be able to see my little girl for a long time.” <br/><br/>Daisy looked at him and asked, “Is that the only reason?” <br/><br/>Kevin looked her in the eyes, the smile on his face deepening, “No, I also want to hear you call me brother, call me brother.” <br/><br/>Daisy snorted with laughter. <br/><br/>“You’ve already called someone else.” Kevin said, pinching her hand. <br/><br/>His voice was low, even a little weak and vulnerable, quite a contrast from the <br/><br/>Kevin who seemed to want to devour someone just a moment ago. <br/><br/>“It wasn’t me who called.” Daisy said, “It was the Female Lead.” <br/><br/>“I want to hear you call.” Kevin’s voice was like coaxing a child, “Is that okay?” Daisy continued to look into his eyes, and after a while, she leaned close to his ear. <br/><br/>Kevin raised an eyebrow, his heart leaping with anticipation. Then he heard Daisy slowly, and somewhat vindictively, say three words in his ear, “In your dreams.” <br/><br/>Kevin:\t\t\t\t\t\t</div>", "images": {}, "success": true}