{"id": 186, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14226452.html", "title": "Chapter 186 - 176: Don’T Want To Leave Anymore…", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 186 - 176: Don’T Want To Leave Anymore…</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 186: Chapter 176: Don’t Want to Leave Anymore... <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane instinctively resisted showing her vulnerable and helpless side to others. <br/><br/>Kevin Clark naturally felt it, so he stretched out his hand to lift Daisy’s chin and let her look at him, “Can’t you tell me about it?” <br/><br/>Daisy looked at him but still said nothing. <br/><br/>“Not even telling me, isn’t that too off-putting?” Kevin said, suddenly looking a bit gloomy, “We’ve kissed, and I’m still an outsider. Why do I feel like I’ve been done wrong?” <br/><br/>Daisy: <br/><br/>Seeing her speechless expression, Kevin suddenly stepped forward, placing his hands on either side of her body, staring at her up close, and threatening, “Shouldn’t I make our relationship a bit more familiar?” <br/><br/>Daisy raised her hand, stuck out a finger, poked it onto his shoulder, and pushed him back to the bedside: “Third Master, think more about practical matters.” <br/><br/>Kevin laughed, holding her hand, kissed it near the lips, and said, “Tell me, maybe you’ll feel better once you talk about it.” <br/><br/>Daisy was silent for a while again. <br/><br/>Kevin didn’t rush, simply pinching her fingers, waiting quietly. <br/><br/>Almost a minute passed before Daisy looked at Kevin’s fingers and spoke up, “When Charles Amos was one year old, his father, named Jack Amos, died in front of me, just like in the show this afternoon.” <br/><br/>Kevin’s expression froze for a moment, but he continued to stroke her hand. It had been eight years since Charles was one year old, how old was she then? Still gazing at his hand, Daisy spoke in a calm voice as if speaking about someone else, “It’s not exactly the same as this afternoon’s show. Jack Amos died because of me, and it was even worse than this afternoon’s show. He was stabbed thirty-two times all over his body, just two meters away from me, separated by a layer of glass.” <br/><br/>What had she gone through? And what was the reason it happened because of her? <br/><br/>Kevin moved closer, held her in his arms, gently patted her back, and quietly listened to her speak. <br/><br/>Daisy’s eyes pressed against his shoulder, and she whispered, “At that time, I was completely useless. Apart from crying and watching him die with my own eyes, I couldn’t do anything, not even collecting his body.” <br/><br/>At that time, watching Jack Amos fall motionless in the rain, Daisy struggled desperately to go out, but Edward Kirsten stopped her from leaving. <br/><br/>In the end, she fainted and fell into a feverish coma for three days. <br/><br/>When she woke up, Jack Amos had been taken care of by them, and she didn’t even know where he was buried. <br/><br/>Usually, the people who took care of her were replaced by newcomers, except for Wilton Edwards and Edward Kirsten. <br/><br/>Edward Kirsten also keenly noticed that she intended to commit suicide, so he threatened her with Charles’ life. <br/><br/>Kevin held her tighter in his arms, his heart aching as if it was being rubbed back and forth by a blunt knife. Her little girl, so young, carrying guilt, hatred... <br/><br/>Eight years... how did she endure? <br/><br/>No wonder... <br/><br/>“We’ll catch him eventually,” Kevin said. <br/><br/>“Mm.” <br/><br/>The two hugged for a while longer, and as Daisy gradually grew sleepy, she backed out of his embrace and said, “You go to sleep, I’m fine.” Looking at her, Kevin hesitated and asked, “Can I stay here?” <br/><br/>Daisy looked up at him. <br/><br/>“Can I be with you here?” <br/><br/>Daisy slowly narrowed her eyes. <br/><br/>Kevin laughed, “Are you afraid of me? What can I possibly do?” <br/><br/>Daisy also laughed, “Afraid of you? What could you possibly do?” <br/><br/>“There’s a lot I could do,” Kevin’s voice became softer and softer, “and...since you can’t beat me, I...” <br/><br/>Seeing her gradually cooling eyes, Kevin immediately stopped himself and coughed lightly, “You’re feverish, I’m a bit worried.” <br/><br/>Daisy looked at him again, afraid that he would sit in the living room all night, so she scooted over a bit and said, “Come up.” <br/><br/>With such a straightforward agreement, did she really think he wouldn’t do anything? <br/><br/>Kevin raised an eyebrow, waited for her to lie down before getting into bed and settling himself as well. <br/><br/>With her eyes closed, Daisy felt the mattress sink beside her, and her heartbeat quickened. She rolled away from Kevin, pulling the quilt over her head, and whispered, “Turn off the light.” <br/><br/>“Alright.” <br/><br/>Kevin lay down and turned off the light. <br/><br/>Darkness enveloped the room, and his vision went black for a moment. <br/><br/>Once his sight had adjusted somewhat, he turned and looked at Daisy. <br/><br/>At first, he didn’t understand why she had chosen to accept this script. <br/><br/>There were so many good ones out there, all easier than this one. Why did she insist on torturing herself, subjecting herself to such immense physical and psychological pressure every day? <br/><br/>Now he more or less understood. <br/><br/>The female lead’s experiences resonated with her, or rather, her sympathy for the female lead in the script. <br/><br/>He still remembered his words at that time, “How can she become strong without suffering?” <br/><br/>She didn’t want to become like this, nor did she want to shoulder so much responsibility, nor run around with a bloody knife... it was reality that forced her into what she has become....\t\t\t\t\t\t</div>", "images": {}, "success": true}