{"id": 183, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14226449.html", "title": "Chapter 183 - 173: A Drama That Can’T Be Beaten… (Ten More)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 183 - 173: A Drama That Can’T Be Beaten… (Ten More)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 183: Chapter 173: A Drama That Can’t Be Beaten... (Ten More) Updated from novelbIn.(c)om<br/><br/>Translator: 549690339 <br/><br/>Kevin Clark and Calvin Stewart spent over two hours browsing the Dark Street, and eventually spent over 50 million on a jewelry set as a meeting gift for Daisy Zane. <br/><br/>The next day they had lunch together. <br/><br/>Before the meal, Calvin had given Kevin two tasks. <br/><br/>First, ask her name. Second, take a video or photo for them to see. <br/><br/>As a result, neither task was accomplished during the meal. <br/><br/>Not only did he fail to take a video or photo, but he also didn’t even find out what the girl’s name was. <br/><br/>On the way back to the Imperial Capital, Kevin was nagged by Calvin for a long time. <br/><br/>It wasn’t until the plane landed in the Imperial Capital that Kevin realized Arthur North seemed to have deliberately withheld her name. <br/><br/>Kevin already thought there was something unusual about his girlfriend, and with Arthur deliberately hiding her name, he became even more suspicious. <br/><br/>Moreover... upon closer thought, he felt like his girlfriend seemed somehow familiar. <br/><br/>Meanwhile, Daisy Zane also noticed that something was wrong. <br/><br/>She realized that Arthur hadn’t called her “Daisy” or “Daisy” for a long time. <br/><br/>He just kept calling her Little Girl... <br/><br/>In the blink of an eye, two days passed and Daisy Zane was in the desert filming. <br/><br/>Arthur North, Allonzo Hobson, Robinson Scott, and Michael Jackson all went with her. <br/><br/>They sat in a row behind the director, all staring at Daisy Zane on the equipment screen. <br/><br/>The temperature was already high in the desert during the day. With the four of them sitting behind him, the director felt the back of his head was insecure, and he was sweating even more heavily. <br/><br/>And Daisy Zane seemed a bit off today. Normally, her acting skills were spot-on, but today she seemed especially off. <br/><br/>She couldn’t fully get into the role, and as a result, the scene had to be shot three times without success. <br/><br/>It was a hot afternoon, and the sand temperature was high. <br/><br/>The makeup artist touched up Daisy Zane’s makeup again. <br/><br/>Arthur handed her some water and looked at her reddened hands. “Go rest for a while.” <br/><br/>Daisy Zane shook her head. <br/><br/>“If you really can’t shoot it, communicate with the director and screenwriter, ” <br/><br/>Arthur suggested. “Try a different way to advance the plot.” <br/><br/>Daisy Zane looked up at him, staring at his face, into his eyes. <br/><br/>“What’s wrong?” Arthur gently touched her face. <br/><br/>Daisy Zane didn’t say anything but just looked at him for a while. When the director came to talk, she finally shifted her gaze. <br/><br/>The director first glanced at Arthur before carefully broaching the subject: <br/><br/>“Lucia, about this scene...” <br/><br/>“Director, I know.” Daisy interrupted him softly, “Let’s do it one more time, the last one.” <br/><br/>The director hesitated for a moment, then said, “Well... I’ll go prepare first.” “Will you be okay?” Arthur asked, his eyes on her. “Rest for a while, you might find the feeling. It’s better than going over and over.” <br/><br/>“I can do it,” Daisy answered in a quiet, calmer voice than usual, looking down. <br/><br/>From Arthur’s angle, he could only see her downcast eyelashes, like little fans, hiding the emotions in the depths of her eyes. <br/><br/>For a moment, she lifted her gaze to meet his. “After we finish...you...” <br/><br/>“I’ll be right here waiting for you,” Arthur said. “As soon as you’re done, I’ll come find you.” <br/><br/>Daisy looked into his eyes, inhaling the Eaglewood scent from him, which reassured her. She nodded, handing him the bottle of water. <br/><br/>Then she playfully patted Arthur’s shoulder, with a teasing tone, “You’ve worked hard, Third Master.” <br/><br/>Arthur met her teasing gaze, and in a deep low voice, he replied, “Don’t forget to compensate me properly.” <br/><br/>Daisy gave him a fake smile before turning to shoot the scene again. <br/><br/>Arthur watched her receding figure, her hands grasping the skirt hem, walking slowly in the sand, occasionally taking deep and shallow footsteps... <br/><br/>In a short while, he slowly clenched his fingertips..\t\t\t\t\t\t</div>", "images": {}, "success": true}