{"id": 189, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244240.html", "title": "Chapter 189 - 179: Return To The Capital, Wrap Up Filming", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 189 - 179: Return To The Capital, Wrap Up Filming</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 189: Chapter 179: Return to the Capital, Wrap Up Filming <br/><br/>Translator: 549690339 <br/><br/>Kevin Clark looked at Daisy Zane, thinking that he might have been too lenient with her, leading to this little girl growing bolder and bolder. <br/><br/>“Come here,” Kevin Clark said nonchalantly. <br/><br/>Daisy Zane raised an eyebrow, lazily and fearlessly walked over to him. <br/><br/>Kevin Clark raised his hand to hook her chin, the words that came out were tougher one after another, “Little girl, if you provoke me again, I don’t mind taking a bath with you.” <br/><br/>Daisy Zane could feel that he was not just threatening, he really meant it. <br/><br/>She believed she couldn’t afford this loss. <br/><br/>So she directly changed the subject: “The misunderstanding between Allonzo Hobson and Robinson Scott is cleared up, they are both in Robinson’s room, cuddling each other.” <br/><br/>However, Kevin Clark ignored what she said, instead, he suddenly leaned in close to her and sniffed, “You’ve been smoking?” <br/><br/>Daisy Zane: “......lf I say no, would you believe me?” <br/><br/>“Do you think I am a fool?” Kevin Clark looked into her eyes. <br/><br/>“You don’t look like one.” Daisy Zane said, “But you can pretend to be one.” <br/><br/>Kevin Clark: “......No more smoking.” <br/><br/>“Uh-huh, I will try my best.” Daisy Zane replied nonchalantly. <br/><br/>“Just try your best?” Kevin Clark’s oppressive aura grew stronger. <br/><br/>“Just try my best.” Daisy Zane repeated these four words in a declarative manner. <br/><br/>Kevin Clark pursed his lips, that expression was just like he couldn’t find a solution for a while, completely helpless. <br/><br/>Daisy Zane looked into his eyes, then she helped him adjust the collar of his bathrobe, revealing less of his bare skin. <br/><br/>Kevin Clark lowered his head and looked at her hand. <br/><br/>After adjusting the collar, whether Daisy Zane did it purposefully or not, her thumb brushed across his collarbone. <br/><br/>It was very light, like the touch of a feather. <br/><br/>But Kevin Clark’s gaze still deepened, so much so that he forgot his intent to lecture her about smoking. <br/><br/>“I’m also going to take a bath.” This chapter is updated by nov(e)(l)biin.com<br/><br/>Ten minutes after the term appeared, Amelia Miles updated her Facebook with a prayer for Charles Hobson’s safety. <br/><br/>An hour later, she posted an update stating that Charles Hobson had been resuscitated and was out of danger. <br/><br/>Daisy Zane attended the wrap-up dinner that evening and had a meal with the drama crew. <br/><br/>It was on her way home, in the car, when she saw the online incidents that Anisa Cooper and Melody Collins had sent her. <br/><br/>Harton Clark sitting beside her said after seeing her looking at the online messages, “I had someone check. Charles Hobson has a mango allergy that caused his breathing to be blocked. His symptoms were mild, and the doctor initially planned to give him an injection. But Charles Hobson insisted on being hospitalized, so he was given an IV.” <br/><br/>After hearing this, Daisy Zane didn’t react. She flicked through her Facebook again. <br/><br/>Her Facebook DMS were full of accusations. <br/><br/>[Charles Hobson almost died. Are you happy now? It’s all your doing.] <br/><br/>[Charles Hobson’s hospitalization is all caused by you and your fans. You and your fans are murderers!] <br/><br/>[You’re so desperate for fame, using an old story about your mother to gain attention. Why don’t you go die?] <br/><br/>[When you wanted to resolve matters, you said it publicly on the Internet and played the victim. Now that things have happened, why aren’t you speaking now; hiding again?! Disgusting!] <br/><br/>Harton Clark was by her side and saw these messages. His expression darkened, “Before Charles Hobson’s apology in the afternoon, Amelia Miles bought paid trolls and guided the comments.” <br/><br/>Daisy Zane let out a sarcastic snort, “These netizens who consider themselves as saints are rather miserable. A few days ago, they drove an innocent person to depression and suicide, and now they’re siding with a past perpetrator and speaking for him from a moral high ground.” <br/><br/>Harton Clark held Daisy Zane’s hand. <br/><br/>“I’d really like to throw them into Cold Green Village and let them experience a life where their cries to heaven and earth are unanswered,” Daisy Zane said. “Let them see what life is like when your family is destroyed by a third party and you grow up without parents. I wonder if they could still talk like this then. ” <br/><br/>“Should we respond?” asked Harton Clark. “I can get evidence from Truro Hospital and have the doctors bear witness.” <br/><br/>“No,” said Daisy Zane. “Trolls aren’t smart to begin with, so we shouldn’t add to the burden on the limited capacity of their brains. Otherwise, we will become the targets of other people’s cell phone flashes.” Harton Clark laughed at her sarcastic tone. <br/><br/>Daisy Zane glanced at him. <br/><br/>“Alright, if these things are bothering you, we can ruin the Miles Family anytime you want, ” Harton Clark said. <br/><br/>Daisy Zane laughed and said, “I think it’s more demoralizing to leave them lingering on the edge of survival.” <br/><br/>It was as if they could see hope, but never reach it. <br/><br/>Harton Clark raised an eyebrow. This little girl was truly wicked. <br/><br/>“Don’t take those private messages, those comments to heart.” <br/><br/>“I will,” said Daisy Zane, looking out the window and whispering, “They need to know, they’re responsible for the words they speak..”\t\t\t\t\t\t</div>", "images": {}, "success": true}