{"id": 181, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223985.html", "title": "Chapter 181 - 171: Very Suitable For Beating Up Boyfriend (Eight More Updates)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 181 - 171: Very Suitable For Beating Up Boyfriend (Eight More Updates)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 181: Chapter 171: Very Suitable for Beating Up Boyfriend (Eight More Updates) <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane no longer needed to fight, so she sat back down on the chair, pressed her hat down, and then took off her mask while eating sunflower seeds. <br/><br/>She reached into her pocket, and fetched out the last six seeds. <br/><br/>Just as she was about to peel a seed apart, the door of the store was kicked open with a loud noise. <br/><br/>The shop assistant was frightened and immediately covered his head. <br/><br/>Robinson Scott was startled as well. <br/><br/>Daisy Zane was fine; she put the popped seed into her mouth then turned her head to look at the entrance. <br/><br/>There she saw three very familiar figures. <br/><br/>Robinson Scott and the five men were facing the entrance; they all looked back when they heard the noise. <br/><br/>Upon seeing the newcomers, Robinson Scott gasped, “Kevin Clark?” And at the same moment, Kevin Clark spoke softly, “Arthur North?” <br/><br/>“Third Master.” The other four men shouted uniformly. <br/><br/>Robinson Scott was wrapped in clothes very tightly, only revealing her eyes. Hearing the man next to her shouted “Arthur North,” she turned her head to look at him. <br/><br/>Full of confusion, suspicion, astonishment, and even feelings of wrong with her ears. <br/><br/>Kevin Clark also looked at her. <br/><br/>Daisy Zane was a little farther away from them, so no one paid attention to her for the time being. She observed the situation quietly, not making any movements. <br/><br/>It wasn’t until she saw Kevin Clark walk a few steps in, stood in front of the man, looked him up and down, then called out softly, “Brother.” <br/><br/>Daisy Zane crushed the seed between her fingertips. <br/><br/>She was reluctant to believe what she had just heard. <br/><br/>Meanwhile, Robinson Scott was still shocked, “Brother? Kevin...Kevin North!?” Only then did Kevin Clark recognize Robinson Scott’s voice, “Robinson?” <br/><br/>Kevin North withdrew his gaze from Robinson Scott and asked Kevin Clark, “You know her?” <br/><br/>Kevin Clark didn’t answer him directly, but looked around the store first. Since Robinson Scott was here, where was that little girl... <br/><br/>As expected, the next second, he saw the little girl sitting not far away. <br/><br/>Daisy Zane had already put on her mask and pressed her hat down. Only her hands were exposed. <br/><br/>But Kevin Clark still recognized her and smiled at her. <br/><br/>Kevin North looked at his brother’s strange smile, feeling baffled and even a bit creepy. <br/><br/>“Brother, did you fight with the two of them?” Kevin Clark asked with a smile. <br/><br/>Kevin North felt his brother’s smile was weird, as if he was going to be played tricks on, but still replied, “Yes. You know them?” “You didn’t win?” Kevin Clark asked again. <br/><br/>Kevin North: <br/><br/>He knew she was sincerely respecting his family. <br/><br/>“There’s nothing to be sorry about.” Theo looked at her, suddenly feeling at a loss and nervous. This kind of nervousness was like suddenly meeting his own son’s girlfriend. The more nervous he was, the more he wanted to be polite, and the more nervous he became. In the end, his voice was very serious when he finally said, “I simply lost. My skill is inferior.” <br/><br/>Daisy Zane suddenly felt the sense that a superior leader was talking to a subordinate. <br/><br/>And Robinson Scott reacted quickly, going to the counter to pay promptly and carefully rolling up the calligraphy. Then she went to Daisy Zane, handing her the calligraphy. <br/><br/>Her dad would have to take a back seat for now in front of her Brother Nine’s happiness. <br/><br/>Daisy took the calligraphy with one hand, trying to pull her other hand out of Kevin’s grasp, wanting to give the calligraphy to Theo with both hands, but she couldn’t pull away. <br/><br/>Moreover, Kevin just took the calligraphy away and said, “Let’s chalk it up to us getting acquainted through a fight.” <br/><br/>Daisy Zane: . <br/><br/>Forget about getting acquainted through a fight, who would want such an acquaintance? <br/><br/>The kind of acquaintance that starts with a knife at someone’s throat... <br/><br/>Daisy Zane suddenly remembered the time she met his mother in the restroom. <br/><br/>She must be at odds with his family; every encounter was so bizarre. <br/><br/>Daisy Zane pinched Kevin’s hand, but suddenly thought of something and quickly let go. <br/><br/>And Allonzo Hobson and the four others exchanged glances with Theo. They left the store very consciously. <br/><br/>Seeing Robinson still standing there, Allonzo took a few steps, then came back and pulled her by the collar, dragging her away, <br/><br/>“What are you doing!” Robinson whispered. <br/><br/>“Don’t you have any sense?” Allonzo dragged her by the back of her collar, “It’s their family matter, none of your business.” <br/><br/>Suddenly, only the three of them and the shop assistant were left in the store. <br/><br/>Daisy Zane immediately felt that Theo’s leadership aura diminished somewhat, but his elder aura increased several times. <br/><br/>It was said that the eldest son of the Clark Family could be Kevin’s father by age. <br/><br/>Kevin rubbed his thumb on the back of Daisy’s hand and held the calligraphy in his other hand, “You’re a grown-up now? You’re really not embarrassed to grab something from a young girl?” Theo Clark: <br/><br/>“And this girl is your sister-in-law.” <br/><br/>Theo’s face flushed, <br/><br/>Daisy Zane looked at the increasingly serious expression on Theo’s face, feeling that if Kevin said another word, Theo would disown him as a brother. <br/><br/>She gently tugged at Kevin. <br/><br/>But Kevin was fearless and said again, “We’re taking this calligraphy.” <br/><br/>Daisy Zane tugged at Kevin again. <br/><br/>Kevin said, “We paid for it this time. Brother, you remember to prepare a meeting gift.’ <br/><br/>Daisy Zane: .The weather is nice today, perfect for beating up her boyfriend..\t\t\t\t\t\t</div>", "images": {}, "success": true}