{"id": 185, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14226451.html", "title": "Chapter 185 - 175: Ten Years Of Memories", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 185 - 175: Ten Years Of Memories</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 185: Chapter 175: Ten Years of Memories <br/><br/>Translator: 549690339 <br/><br/>After Daisy Zane shot a few more close-ups, they wrapped up for the day. <br/><br/>As soon as they finished, Kevin Clark took her back to the hotel first. <br/><br/>Meanwhile, the drama crew shot a few more scenes in the desert in the afternoon, and the filming there was over. <br/><br/>They would return to the Imperial Capital to shoot a few more scenes, and the whole show would be wrapped up. <br/><br/>The entire drama crew had some free time now. <br/><br/>So, in the evening, Allonzo Hobson hosted a party for the entire crew with unlimited food and fun in Daisy Zane’s name. <br/><br/>First, it was to leave a good impression of Daisy Zane on the drama crew. Second, they had to shoot several takes of the afternoon scene, during which all staff were exposed to the sun in the desert, exhausting them. <br/><br/>This was considered an apology. <br/><br/>Allonzo Hobson arranged everything. <br/><br/>After returning to the hotel, Daisy Zane and Kevin Clark didn’t go out again. <br/><br/>They even had dinner at the hotel. <br/><br/>Daisy Zane’s knees had been kneeling on the hot sand in the desert for a long time. It wasn’t so hot that it caused burns, but the area below the knees was very red. <br/><br/>It was abnormally red. <br/><br/>Kevin Clark applied medicine to it, but later on, the skin would surely peel off. <br/><br/>Moreover, because they had filmed action scenes in the morning, there were some bruises on her arms, shoulders, and back. <br/><br/>Kevin Clark applied medicine to those parts as well. <br/><br/>Daisy Zane, wearing shorts and a halter top, sat cross-legged on the sofa and let Kevin Clark apply the medicine. <br/><br/>She was playing a game on her cell phone with her head down. <br/><br/>Kevin Clark’s movements were gentle, and he was thorough in applying the medicine, but when he applied it to her shoulder, he couldn’t help but take a few more glances at the scars on her collarbone. <br/><br/>There were three long scars stretching from the shoulder to the collarbone, looking like they were caused by an animal’s scratch. <br/><br/>“How did you get these scars?” <br/><br/>Daisy Zane paused for a moment, looked at the scars on her collarbone, and casually said, “I accidentally scratched myself.” <br/><br/>This answer seemed to brush off the question like a fool’s. <br/><br/>But seeing that she didn’t want to talk about it, Kevin Clark played the fool. <br/><br/>“Why don’t you remove it?” <br/><br/>As far as Kevin Clark knew, this girl cared about her appearance. These long scars had already affected her ability to wear beautiful dresses. With her personality, she should want to remove them. <br/><br/>“Does it look ugly?” Daisy Zane asked. <br/><br/>In case something happened, he could know about it immediately. <br/><br/>Around lam in the morning, a sudden sound broke the silence in the pitch-dark room. <br/><br/>“Jack Amos!” <br/><br/>The sound wasn’t loud, but it was like a suppressed growl. <br/><br/>Daisy Zane suddenly opened her eyes, her sharp gaze staring into the darkness, and her breathing becoming a bit rapid. <br/><br/>After a while, she sat up and leaned against the head of the bed. <br/><br/>But just as she leaned back against the head of the bed, the door to the room was gently pushed open. Daisy Zane immediately reached for the hairpin by her pillow. <br/><br/>Kevin Clark stood at the entrance, keenly aware of the sudden surge of murderous intent. He said, “It’s me.” <br/><br/>Hearing the familiar voice, Daisy Zane slowly let go of the hairpin in her hand and leaned back against the head of the bed. <br/><br/>Kevin Clark walked to her bedside and turned on the bedside lamp. <br/><br/>The dim yellow light came on, driving back the surrounding darkness. <br/><br/>Kevin Clark saw that Daisy Zane’s neck was sweaty, her skin glistening in the light, and her lips were somewhat red: “Did you have a nightmare?” <br/><br/>Daisy Zane stared at him. Just waking from her dream, she suddenly became alert for a moment, asking, “What did you come here for?” <br/><br/>“I’m in the living room. I heard you shouting something.” Kevin Clark didn’t mind her tone, touched her forehead, and it felt somewhat hot, “So I came in. <br/><br/>Daisy Zane’s voice wasn’t loud, but Kevin Clark heard it right away. <br/><br/>“It seems you have a fever.” Kevin Clark sat on the bed, holding her hand with one hand and putting the other on her pulse. <br/><br/>Daisy Zane glanced at the time on the bedside and then looked at Kevin Clark again. <br/><br/>He was still in the living room at this hour. <br/><br/>As Kevin Clark felt her pulse, his brow furrowed for a moment. <br/><br/>It was similar to before, with her emotions fluctuating too much, and she forcibly suppressed her emotions, hiding her own emotions. As a result, the stifled flow of energy and blood caused her heart to overheat. <br/><br/>When Kevin Clark released her wrist, he took out a few tissue papers from the bedside table and wiped the sweat off her neck: “Little girl, you have a fever again. ” <br/><br/>Daisy Zane raised her hand to touch her forehead, only feeling the sweat and nothing else. She didn’t seem to care about it, “Do you get a fever from sweating so much?” <br/><br/>“Yes.” Kevin Clark took out a few more tissues and wiped her forehead sweat. Then he pulled the quilt up a bit, saying, “Be careful not to catch a cold from the sweat.’ <br/><br/>“It’s a bit hot.” <br/><br/>“It’ll be fine in a little while.” Kevin Clark looked at her, “Did you have a nightmare?” <br/><br/>Daisy Zane stared at him, her eyelashes quivering slightly, but she didn’t say anything. <br/><br/>Seeing that she wasn’t saying anything, Kevin Clark hesitated for a moment before asking softly, “Does it have anything to do with the scene you filmed this afternoon?” <br/><br/>Daisy Zane pressed her slightly aching temples, lowered her eyes, avoiding <br/><br/>Kevin Clark’s gaze....\t\t\t\t\t\t</div>", "images": {}, "success": true}