{"id": 187, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244238.html", "title": "Chapter 187 - 177: Poisoning You", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 187 - 177: Poisoning You</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 187: Chapter 177: Poisoning You <br/><br/>Translator: 549690339 <br/><br/>Kevin Clark barely slept last night. <br/><br/>On one hand, he felt sorry for Daisy Zane, and on the other hand, he worried about her fever. <br/><br/>Although it was emotionally induced, he was afraid that her fever might be too severe, leading to other inflammation. <br/><br/>Fortunately, around four o’clock, Daisy Zane’s fever subsided. <br/><br/>After Daisy Zane fell asleep, Kevin Clark held her in his arms. He let her use his arm as a pillow all night. <br/><br/>After four o’clock, he touched her forehead and saw that her fever had subsided. He then kissed her forehead, put his other hand on her waist and fell asleep. <br/><br/>The two slept until almost ten o’clock. <br/><br/>Around eight o’clock, Kevin Clark woke up once. He wanted to get up, but seeing Daisy Zane sleeping soundly in his arms, he thought about it and seized the rare opportunity, and went back to sleep. <br/><br/>It wasn’t until nearly ten o’clock that Daisy Zane’s cell phone rang. <br/><br/>Both of them woke up. <br/><br/>As soon as opened her eyes, she saw Kevin’s exposed collarbone through his home clothes, and her sleepiness instantly vanished. <br/><br/>She raised her head and looked at Kevin Clark in a dazed manner. <br/><br/>Kevin Clark saw her like this and smiled, his narrow eyes were slightly red from just waking up and carried a hint of drowsiness, which was alluring in its laziness. <br/><br/>“I didn’t do anything,” Kevin Clark kissed her and then went to get her phone. “I just secretly held you.” <br/><br/>Daisy Zane sat up. She had slept a bit too soundly last night. <br/><br/>She tucked her hair back and took the phone. It was a call from Robinson Scott. <br/><br/>As soon as she answered, before she had a chance to say anything, Robinson <br/><br/>Scott roared from the other side, “Ah! Brother Nine! I slept with Allonzo Hobson! ” <br/><br/>Daisy Zane’s expression obviously hesitated for a moment; her calm face, which did not usually waver, gradually became somewhat frightened. <br/><br/>Robinson Scott’s voice was so loud that Kevin, who had just sat up, also heard it clearly and looked at Daisy Zane in surprise. <br/><br/>“Ah! Ah! Ah! Brother Nine! What do I do!” Robinson Scott continued to roar. “I sneaked back to my room while Allonzo Hobson was still asleep! My innocence!” <br/><br/>“You...” Daisy Zane’s mind was a bit stuck. <br/><br/>Kevin Clark reacted quickly. He thought Robinson Scott should have a lot of things to say to Daisy Zane. So he planned to leave first. <br/><br/>Only then did Daisy Zane belatedly realize that this position was... a bit... not just a bit, but very... embarrassing. <br/><br/>Seeing her ears gradually turning red, the smile on Kevin Clark’s face deepened, and the next second he hugged her waist, turned over, and pressed her beneath him, kissing her. <br/><br/>Kevin Clark was usually very gentle with her, even speaking several degrees softer. <br/><br/>But when it came to these matters, he was very terrifying. <br/><br/>It wasn’t that he was rude; he was actually quite gentle. But when his aura suddenly changed, it would always make Daisy fear about whether he would hurt her. <br/><br/>After a while, Kevin Clark released her, lowered his head and kissed the exposed scar on her collarbone a couple of times, burying his head in her neck. <br/><br/>Daisy Zane looked at the ceiling, breathing lightly. After a while, she touched her fingertips and said coldly, “If you can’t calm down, head to the restroom.” <br/><br/>Kevin Clark: <br/><br/>“Or...” stared at the ceiling and continued, “Let me change my clothes and I’ll leave the room to you.” <br/><br/>Kevin Clark looked up at Daisy Zane. <br/><br/>When Daisy Zane met his gaze, her heart trembled. As her temple throbbed, she immediately raised her hand to cover Kevin Clark’s mouth. <br/><br/>“I have to go see Robinson Scott,” said Daisy Zane, “I’m afraid if I take much longer, she will go and kill Allonzo Hobson.” Kevin Clark kissed the palm of her hand. <br/><br/>Daisy Zane let go of her hand again. <br/><br/>Kevin Clark’s eyes flashed with anger, but it soon disappeared. He sighed lightly and said, “Little girl, just keep bullying me. You’ll have to pay me back one day.” <br/><br/>Daisy Zane raised an eyebrow and showed no fear at all, completely in a “let’s talk when you want to get it back” attitude: “Get up, you’re too heavy.” <br/><br/>Kevin Clark had no choice but to turn over and sit up and pull her up as well. <br/><br/>Daisy came down from the bed, took two clothes from the suitcase, and changed in the restroom. <br/><br/>When she came out, Kevin Clark was still sitting on the bed, seemingly not having moved at all. <br/><br/>Daisy quickly rinsed her mouth, changed into sportswear, and casually tied her hair up with a wooden hairpin. <br/><br/>She glanced at Kevin Clark but didn’t say anything, just walked to the door. But after opening it, she looked back at him again, “Third Master, the room is left to you. Take your time, I won’t be back for a while.” <br/><br/>While saying this, she couldn’t control her upturned mouth. <br/><br/>Moreover, after saying it, she didn’t look at Kevin Clark’s eyes, closed the door, and left. <br/><br/>Kevin Clark was left alone in the room, staring at the entrance, grinding his teeth. <br/><br/>His eyes seemed to want to pierce the door with his gaze. <br/><br/>This little girl.... was too bad!\t\t\t\t\t\t</div>", "images": {}, "success": true}