{"id": 188, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244239.html", "title": "Chapter 188 - 178: Misunderstandings, All Misunderstandings", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 188 - 178: Misunderstandings, All Misunderstandings</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 188: Chapter 178: Misunderstandings, all misunderstandings <br/><br/>Translator: 549690339 <br/><br/>When Daisy Zane went to see Robinson Scott. he had already calmed down. <br/><br/>But his calmness was somewhat extreme. <br/><br/>She opened the door for Daisy Zane, simply called out “Brother Nine”, and entered the room. <br/><br/>Upon seeing her reaction, Daisy Zane raised an eyebrow and followed her into the living room. <br/><br/>Then, on the living room’s tea table, she noticed his gun. <br/><br/>Robinson Scott sat on the sofa, lit a cigarette first, then while smoking it, began cleaning his weapon. <br/><br/>Daisy Zane sat directly on the tea table, looking at him and asked, “Have you remembered what happened?” <br/><br/>“I can’t remember.” Robinson Scott took the cigarette from his mouth and exhaled out smoke, “I truly blacked out from drinking.” <br/><br/>Daisy Zane picked up the cigarette and lighter from the tea table and lit one herself: “What if you forced yourself on someone?” <br/><br/>“I forced him? I forced him!” Robinson Scott threw the gun on the tea table and pointed at himself, “Brother Nine, look at me! Look at my face, my body, my situation. Would I coerce him? Even if I were to get a gigolo, I wouldn’t glance twice at him!” <br/><br/>Indeed, Robinson Scott was very handsome with an exotic look, and a great physique, while also being cute. <br/><br/>The phrase ‘western beauty’ probably referred to Robinson Scott’s appearance. <br/><br/>Daisy Zane took a gentle puff on her cigarette, her slender fingers holding it, as she flicked the ash into a tray, “I just think... no one could coerce you.” <br/><br/>After a pause, she continued: “Even if you were drunk.” <br/><br/>“I...” Robinson Scott’s attitude suddenly diminished, “I truly can’t remember, I have absolutely no impression.” <br/><br/>“Did something really happen then?” Daisy Zane asked while looking at him. <br/><br/>Robinson Scott stared at Daisy Zane through a thin layer of smoke, thought seriously for a moment and responded, “I am not too sure, just that after waking up, I had a headache and aching all over. After seeing Allonzo Hobson near me, I was afraid I wouldn’t be able to resist killing him, so I came back here first. <br/><br/>Daisy Zane: . <br/><br/>The two of them stared at each other in silence. Nobody said anything and continued their peaceful stare-off. <br/><br/>“You made me sleep on the carpet?!” <br/><br/>“It was you who chose to sleep on the carpet. I was kind enough to move you to the sofa.” <br/><br/>Robinson Scott, seeing that he didn’t appear to be lying, paused before asking, “Then why did I wake up in your bed, my, my clothes were off!” <br/><br/>When Allonzo Hobson heard the first part of her sentence, he was all geared up to counter her. But upon hearing the second part, his face turned quite colorful. <br/><br/>His mind went blank as if someone had hit him with a hammer. <br/><br/>Damn! This is a big deal! <br/><br/>“Speak up.” Robinson Scott snarled. <br/><br/>“I didn’t do anything.” Allonzo Hobson’s voice softened a few degrees, his tone became gentle. Instead of denying things forcefully, he just stated the facts, “I didn’t drink much yesterday. I was sober. After I put you on the sofa, I went to bed. I slept till just now. I had no idea when you left. I just brought your clothes over when I saw them on my side.” <br/><br/>“Really?!” Robinson Scott, who was bending over from fatigue, stepped onto the sofa, “Then why did I wake up with a stiff waist and back pain?” <br/><br/>“Sis, your sleeping position is just like those immortal practitioners.” Allonzo Hobson said, “It would be strange if you weren’t in pain.” Robinson Scott thought he made some sense. <br/><br/>“Did you really do nothing?” <br/><br/>Allonzo Hobson shook his head. <br/><br/>After staying silent for a while, Robinson Scott suddenly burst out: “Damn it! A stunning beauty lies by your bed and you did nothing? Are you even a man?! Or are you impotent?!” Allonzo Hobson: “???” <br/><br/>Daisy Zane: . <br/><br/>“Damn...” Allonzo Hobson took a deep breath, swallowed, “You’re truly eccentric.” <br/><br/>“You call me eccentric?!” <br/><br/>Hearing them arguing, Daisy Zane massaged her temples. Without disturbing the two, she left the room. <br/><br/>Returning to her own room, once entering the living room, she saw Kevin Clark who had just taken a shower was drinking water. <br/><br/>Dressed in a black robe, with water still dripping from his hair. <br/><br/>His throat was moving, eyes slightly reddened, the robe slightly loose around the neck, revealing a glimpse of his muscle lines... <br/><br/>He completely resembled a fairy who had just taken a bath. <br/><br/>After watching for a couple of seconds, Daisy Zane suddenly whistled, and casually said: “Third Master, you took a bath, huh?”Updated from novelb(i)n.c(o)m\t\t\t\t\t\t</div>", "images": {}, "success": true}