{"id": 182, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223990.html", "title": "Chapter 182 - 172: Quite Good At Fighting (9 More Updates)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 182 - 172: Quite Good At Fighting (9 More Updates)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 182: Chapter 172: Quite Good at Fighting (9 more updates) <br/><br/>Translator: 549690339 <br/><br/>“What?! You’ve met Third Brother’s girlfriend!” <br/><br/>The group came out of the store, and Kevin Clark took Daisy Zane back to the car first. <br/><br/>The rest of them, including Robinson Scott, were wandering around the street with Arthur North. <br/><br/>However, after a while, Arthur North told them to go on without him while he made a phone call. <br/><br/>So, that’s what happened. <br/><br/>Arthur North went into a dead-end alley to call his wife. <br/><br/>Allonzo Hobson and the others were standing guard outside the alley. “What does she look like?! How is she?” Calvin Stewart interrupted Arthur’s words without letting him finish, hearing the five words “third brother’s girlfriend”. <br/><br/>As a leader, Arthur North was used to speaking in the military district. Moreover, the people he dealt with were almost all men. Occasionally, he would interact with some women, but they were almost all subordinates. A few polite words would suffice for strangers. <br/><br/>Now faced with such a situation, he wasn’t sure how to deal with it. <br/><br/>After all, she was his future sister-in-law, neither a subordinate nor a stranger. <br/><br/>He was afraid that if he wasn’t careful enough, the girl might feel that the Clark Family was being rude, and that would cause trouble. <br/><br/>It wasn’t easy for Kevin Clark to find a girlfriend, and it seemed that she was cherished deeply. <br/><br/>If any problem arose because of him. <br/><br/>Would Kevin Clark refuse to acknowledge him as a brother anymore? Read latest chapters at novelhall.com Only<br/><br/>“Uh...” Arthur, having been interrupted, thought for a moment and said, “She’s very beautiful. And... she’s pretty good at fighting.” <br/><br/>“What do you mean by that?” Calvin Stewart asked. <br/><br/>“She’s very strong. I couldn’t beat her.” Arthur North told the truth, “She’s... <br/><br/>quite steady and polite when she’s quiet. It’s just that she seems a bit hard to get close to.” <br/><br/>Because of Arthur’s introduction, within an hour, the Clark Family knew that Kevin Clark had found a girlfriend who Arthur couldn’t beat and who wasn’t easy to approach. <br/><br/>Calvin Stewart suddenly went silent for a moment, as a rough, fierce, and sinister image flashed through his head. On top of that image, there was still a pretty face. <br/><br/>What kind of girlfriend had Kevin found? Did the third brother like this kind of image? An unconventional taste? <br/><br/>After a while, he asked, “What’s her name?” <br/><br/>“Ah...” Arthur thought, as if no one had told him what she was called, “I don’t know, nobody told me.” <br/><br/>Calvin Stewart: “......What’s the use of you.” Arthur North: <br/><br/>Daisy Zane’s anger subsided considerably. <br/><br/>“It’s my first love affair, and I may not handle some things well,” Kevin Clark tucked her hair behind her ear, “please bear with me a little longer, and give me a chance to improve and do better. Is that alright?” <br/><br/>Daisy Zane pursed her lips, released her fist, and leaned back in her seat. <br/><br/>She silently cursed in her heart: Damn, he won me over! <br/><br/>Seeing that she wasn’t angry anymore, Kevin Clark held her hand and asked, <br/><br/>“Did my brother hurt you anywhere?” <br/><br/>Daisy Zane glanced at him and thought for a moment before saying, “I kicked your brother’s ribs pretty hard...” Kevin Clark: <br/><br/>“You should check on him later.” <br/><br/>“Alright.” Kevin Clark thought about it, his brother should be fine, “Consider him paying back a debt for me.” <br/><br/>“You sure know how to calculate.” <br/><br/>“We’re brothers; we don’t need to be so calculative.” <br/><br/>Daisy Zane looked at him again, she could indeed feel that the Clark family really pampered him. Perhaps it was the age difference that caused his brother to dote on him as well. <br/><br/>That’s why he could be so lawless. <br/><br/>“Give that calligraphy to your brother,” Daisy Zane said. <br/><br/>“No need, ” Kevin Clark once more placed his hand on her waist, pulling her closer, “you keep it.” <br/><br/>“It’s no use for me to keep it.” Daisy Zane lowered her head to look at the palm of Kevin’s scarred hand. It had been a while since the stitches were removed, but the scar remained. <br/><br/>The scar was still a bit red now. <br/><br/>“Robinson Scott wanted to give it to his dad. If his dad takes it, he’ll probably just study it,” Daisy Zane said, “but it seems like your brother really likes it.” <br/><br/>“My father likes it,” Kevin Clark said, “my brother wanted to buy it for my father.’ <br/><br/>“Then you take it.” <br/><br/>“Alright,” Kevin Clark said, “my father will definitely be very happy.” <br/><br/>Daisy Zane didn’t give much thought to this statement, assuming he meant that his father would be happy to see the calligraphy. <br/><br/>But when Kevin Clark brought it home, he told his father it was a gift from his future daughter-in-law. <br/><br/>And to prevent his mother from being jealous, Kevin Clark prepared a gift for her as well. <br/><br/>Although based on Calvin Stewart’s description, everyone thought that the future daughter-in-law had a beautiful face that didn’t seem easy to provoke. <br/><br/>But they were all delighted and coaxed by this yet-unseen future daughter-in-law..\t\t\t\t\t\t</div>", "images": {}, "success": true}