{"id": 184, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14226450.html", "title": "Chapter 184 - 174: Jack Amos", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 184 - 174: Jack Amos</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 184: Chapter 174: Jack Amos <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane arrived at the shooting location, exchanged a glance with her fellow actor, and then knelt down in the sand again. <br/><br/>The makeup artist came over to fix her clothes and hair, and she lowered her eyes, staring at the sand as she slowly dismantled the defenses at the bottom of her heart. <br/><br/>The tough exterior was peeled away, revealing tender flesh beneath. <br/><br/>“Are you ready?” the director asked through the walkie-talkie. <br/><br/>Daisy Zane took a gentle breath, raised her hand to grab the male actor’s clothing, tears already filling her eyes, and nodded towards the camera. <br/><br/>The male actor quickly bent over, gripping her other arm and twisting it behind her, making a motion as if to restrain her. <br/><br/>With the sound of “action” falling. <br/><br/>Daisy Zane clenched the male actor’s clothing, and as she lifted her head to look at him, her tears streaked down, followed by a massive surge of emotion. <br/><br/>She struggled for a moment, trying to get up but was pushed back down. Then she strained her throat, desperately shouting, “MO Ye! Let go of my brother, let him go. We will stay away from the court and pose no threat to you. Let him go! Please! I beg you, let him go! I’ll do anything, just let him go!” Read latest chapters at novelhall.com Only<br/><br/>The male actor leaned over, staring at her tear-streaked face, and gently wiped her tears away, whispering, “I only believe that a dead man won’t threaten me. <br/><br/>Be good, don’t cry anymore. I’ll treat you well in the future.” <br/><br/>“Brother! Brother!” Daisy Zane looked forward again, gripping the sand and desperately trying to crawl forward to save her brother, but she was powerless to do anything. She couldn’t even reach his side. <br/><br/>Daisy Zane’s face was covered in tears, and her clothes, hair, and face were all covered in sand. <br/><br/>Desperation, helplessness, and pain reached their peak in a flash. <br/><br/>In the vast desert, cries of despair spread, striking the hearts of everyone present. <br/><br/>But the scene in front of Daisy Zane’s eyes was dark. <br/><br/>What she saw was the night eight years ago when Nan Xiao died in front of her. <br/><br/>She cried and begged Jing Yuezai in the same way back then. But Jing Yuezai forced her to watch as Nan Xiao was stabbed to death in front of her, one knife after another. <br/><br/>There was heavy rain that night, but the sound of the rain couldn’t cover her cries. <br/><br/>“Yuezai! I was wrong! I won’t run anymore! I won’t! Let him go, let him go!” Daisy Zane, in front of the French window on the first floor, wanted to go outside but was stopped. So she could only beg Jing Yuezai. <br/><br/>But soon, Michael Jackson ran over and took the umbrella from him. <br/><br/>Daisy looked up at Harton Clark, her eyes red from crying. Her facial expression seemed to have come out of clarity, with no more significant fluctuations, and has already calmed down. But tears still fell from her eyes. <br/><br/>“Alright. Stop crying.” Harton Clark wiped her tears away. <br/><br/>Daisy looked at him for two more seconds, then lowered her gaze and, after a pause, calmly said, “I’m fine.” <br/><br/>She thought she would lose control, even break down. But...eight years have passed, and she was no longer the useless person who couldn’t do anything and only cried. <br/><br/>“Get up first.” Harton Clark helped her up and patted the sand off her body. <br/><br/>Meanwhile, sitting behind the director’s equipment, Robinson Scott’s tears fell like a chain. <br/><br/>Her empathy was not strong, even very poor. She was cold-hearted since childhood. When watching a movie, the whole cinema would cry, but she never felt anything, even thinking that everyone in the cinema had lost control of their tears. <br/><br/>But Daisy instantly pulled her into it. <br/><br/>Even someone like her, who had been domineering and overbearing since childhood, felt that the desperate sense of powerlessness. <br/><br/>Allonzo Hobson noticed her silently shedding tears and found her two tissue papers. <br/><br/>Robinson Scott glanced at the tissue paper, took it, and wiped her tears. While wiping, she said, “I didn’t cry.” <br/><br/>“Yes, yes, yes.” Allonzo Hobson said, “You’re contributing water resources to the desert. You’re great, you’re selfless.” <br/><br/>“Get lost.” Robinson Scott said, “Why are you so annoying?” <br/><br/>“If you find it annoying, give me back my tissue paper.” <br/><br/>Robinson Scott wiped her nose and threw the tissue paper into his arms: “Here you go, who needs it.” <br/><br/>Allonzo Hobson jumped up from his chair, the tissue paper falling to the ground, and he said disdainfully, “Can you be a little more hygienic?” <br/><br/>“You tell me.” Robinson Scott stood up and wanted to go. “Everyone is responsible for protecting the environment. Remember to pick it up when you leave.” <br/><br/>“You...” Allonzo Hobson watched Robinson Scott walk away, and a thousand explicit words wanted to come out of his mouth. <br/><br/>But she was too far away, and no one would hear him if he cursed, so he could only shut his mouth sullenly. <br/><br/>And then, after a while, he pinched a small corner of the tissue paper, picked it up and threw it into the trash can. <br/><br/>As he threw it, he muttered, “Whoever marries such a woman is really out of luck..”\t\t\t\t\t\t</div>", "images": {}, "success": true}