{"id": 180, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14223545.html", "title": "Chapter 180 - 170: Conflict (Seven More Updates)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 180 - 170: Conflict (Seven More Updates)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 180: Chapter 170: Conflict (Seven More Updates) <br/><br/>Translator: 549690339 <br/><br/>Robinson Scott kept looking at the painting, while Daisy Zane sat on a chair behind him, eating sunflower seeds from her hand. <br/><br/>By the time she had finished a handful, Scott had already started bargaining with the store owner. <br/><br/>Although the price in Scott’s heart was quite cheap, the bargaining process was still essential. <br/><br/>Five minutes later, the two were still going back and forth over 100 USD. <br/><br/>Five more people entered the store, and Daisy Zane, while eating sunflower seeds, stretched out a finger, pushed up the brim of her hat, and took a slanted glance at them. <br/><br/>The man in the lead looked to be in his forties. <br/><br/>Daisy Zane’s first impression of him was that he was very good-looking. Among all the men she had ever met, Harton Clark ranked first, and he...could be in third place. <br/><br/>As for the second place... Gael Easton had not been pushed down yet. <br/><br/>Moreover, this mature man...men who were mature yet not greasy scored extra points. <br/><br/>He had a great figure, a straight posture, and an air of fierceness. <br/><br/>He had a similar aura to Diego Giovanni but was also different. This difference might come from their original families. This man’s fierceness was somewhat introverted or, perhaps, more elegant. <br/><br/>A bit contradictory and interesting. <br/><br/>The four young men behind him also had straight postures. <br/><br/>The man noticed Daisy Zane’s gaze and looked over as well. But by the time he did, Daisy Zane had already pushed her hat brim down and lowered her head. <br/><br/>So, he only saw her fair chin and rosy thin lips. With this glance, he looked away and walked towards the counter. <br/><br/>Daisy Zane continued to munch on sunflower seeds with her head down, not looking at him again. <br/><br/>However, she didn’t expect that this man would directly approach the calligraphy piece in Robinson Scott’s hands. <br/><br/>Daisy Zane listened for a moment and got a rough idea of the situation. <br/><br/>She did not know where the man had heard about the calligraphy piece, but he was here specifically to buy it. <br/><br/>But, how could Scott let go of something he had set his eyes on? <br/><br/>In all these years, the only time Scott had failed to get his hands on something he desired was at the auction held in the Doomsday Hotel. <br/><br/>Where Kevin Clark had taken a hairpin away. <br/><br/>Moreover, that time, it was Daisy who had asked her not to continue bidding, and then she had stopped. <br/><br/>Otherwise, Scott might have fought Kevin Clark to the end. <br/><br/>“Commander Clark is really filial,” Henry Horton said. “He’s so busy all the time, but he would still come such a long way on his vacation... Why not let you buy it and take it back since you’re here?” <br/><br/>“I only found out he was here after I arrived today.” <br/><br/>After the phone call in the afternoon, Harton Clark found out that his brother would come, so he came first. <br/><br/>This place was a mess, but Harton Clark wasn’t worried that his brother couldn’t handle it. Commander Clark was over 50 years old, but his physical abilities were still very young. <br/><br/>But since his brother had a special identity, it would be more convenient for Harton Clark to intervene if any trouble occurred. <br/><br/>As it turned out, trouble indeed happened. <br/><br/>Harton Clark had only walked about 100 meters after getting out of the car when he received a message on Michael Jackson’s cell phone with their location. <br/><br/>“Third Master, looks like there’s trouble with Commander Clark, ” Michael Jackson handed his cell phone to Harton Clark to show him the location sent by someone following his brother. <br/><br/>Harton Clark’s expression became serious, “Let’s get there right away.” <br/><br/>These five people were a bit difficult for Daisy Zane to deal with. <br/><br/>Especially the leader. He was very polite and able to fight well. <br/><br/>Sometimes it was Robinson Scott versus three, sometimes it was Daisy Zane versus four, and they fought chaotically in the narrow store. <br/><br/>Gradually, the five men began to lose. One of them quickly reached into his pants and pressed the power button of his cell phone three times. <br/><br/>He sent their location. <br/><br/>Nearly five minutes later, Daisy Zane quickly kicked the man in his right ribs. <br/><br/>The man stepped back two steps, and Daisy Zane hurriedly went forward and twisted his arm behind his back. She stood behind him, and with her other hand pressed the knife she had slipped out of her sleeve against the man’s neck. <br/><br/>“You lost.” Daisy Zane whispered, “Do you admit it?” <br/><br/>The man didn’t expect to lose to a young girl. Although reluctantly, he had to admit defeat. There are always people better than others; the student outdoes the master. <br/><br/>“I admit.” <br/><br/>As soon as the leader was subdued, the other four immediately behaved. <br/><br/>They stopped fighting Robinson Scott and looked warily at Daisy Zane. <br/><br/>Daisy Zane raised her eyebrows and released him. Then she said somewhat arrogantly, “Goodbye, I won’t see you off.” <br/><br/>The man turned his head to look at her and said nothing. <br/><br/>But he approached Robinson Scott again, trying one last effort, and asked, “Miss, is there really no room for negotiation? Give me the calligraphy, and you can name your price.” <br/><br/>Daisy Zane sat back down on the chair she had been in earlier. <br/><br/>This person... was really not suitable for doing business in a place like this. <br/><br/>In a place like this, with anyone else, if the person couldn’t win a fight and couldn’t get their merchandise, they would definitely leave right away, find more people, and start a fight at the next location before going straight for the loot.\t\t\t\t\t\t</div>", "images": {}, "success": true}