{"id": 199, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244289.html", "title": "Chapter 199 - 189: Devoting Oneself", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 199 - 189: Devoting Oneself</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 199: Chapter 189: Devoting Oneself <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane watched as a sunny girl turned into a pale-faced, motionless, and miserable miss who couldn’t stand up straight. New novel chapters are published on<br/><br/>She looked at the flower in her hand and thought: “Or maybe...” <br/><br/>Before she could finish her sentence, a voice rang out behind them: “What are you two doing?” <br/><br/>It was Kevin Clark’s voice. <br/><br/>Lily Parker shuddered in fright. <br/><br/>Daisy Zane felt that if she hadn’t held onto her, Lily could have shuddered herself right into the pond. <br/><br/>Kevin Clark saw the two of them not moving, so he walked over. <br/><br/>Hearing the footsteps getting closer, Lily glanced at Daisy, her eyes full of apology. She then hid her hand behind her back and straightened up. “Third Uncle,” she greeted him, smiling. <br/><br/>Kevin looked at her ingratiating smile and ignored her, turning his gaze to Daisy Zane. <br/><br/>Daisy didn’t understand the meaning of her expression temporarily, so she also stood up straight and looked at Kevin Clark without saying anything. <br/><br/>“What’s wrong?” <br/><br/>“No...” Daisy tried to move forward but was stopped by Lily. <br/><br/>Daisy looked at her and saw her move to her side, pressing her arm against herself and squeezing it behind her back. <br/><br/>Then Lily stuffed the lotus in her hand from behind her back to Daisy’s. <br/><br/>Daisy Zane instantly understood why Lily had given her an apologetic look earlier. <br/><br/>After Lily handed her the lotus flower, she distanced herself and smiled imploringly. <br/><br/>Clutching the lotus flower, Daisy stood with her hands behind her back, expressionless but secretly thinking about the five-digit sum of money. <br/><br/>Lily smiled and introduced Daisy: “Third Uncle, let me introduce you. This is Daisy Zane, a superstar. Brother Xavier Dominic brought her.” <br/><br/>Kevin Clark glanced at her and said nothing. <br/><br/>“Third Uncle, how did you come here?” asked Lily, taking a few steps closer to him. “I’ve been practicing hard lately, and my progress has been huge. You’re here at home, so why don’t you give me some guidance? Let’s go to the practice room.” <br/><br/>“Watch you practice in the heat of noon? How can I eat after that?” <br/><br/>Lily: “......I’m not as bad as you say.” <br/><br/>“Don’t you know if you’re bad or not?” <br/><br/>It’s not like you’re giving away the Lotus for someone else to raise and die, but you’re insinuating that they should pay for it! <br/><br/>Kevin’s anger made his eyebrows stand on end. <br/><br/>But the moment Arthur turned around, his face immediately turned into a smile as he obediently called out, “Third Uncle.” <br/><br/>Arthur looked at Kevin and said, “I won’t pursue how the flower broke today. You should know for whose sake is this.’ <br/><br/>Kevin obediently nodded and said, “I know it’s for Auntie. Thank you, Auntie.” Daisy Zane: . <br/><br/>Arthur was delighted by her calling him “Auntie.” He said, “Hmm, I’ll come to check your martial arts practice some other day.” Kevin’s mouth twitched. He eventually managed to say, “...Okay.” <br/><br/>“Leave now,” Arthur ordered without any courtesy. <br/><br/>‘ Kevin was speechless but could only smile and say, “Okay. Goodbye, Third <br/><br/>Uncle, goodbye Auntie.” <br/><br/>He quickly left after saying it. <br/><br/>“Is it hot?” Arthur asked Daisy, noticing a thin layer of sweat on her forehead. <br/><br/>“It’s alright.’ <br/><br/>“Let’s go back first,” Arthur said, “I’ll bring you back here when it’s cooler in the afternoon.’ <br/><br/>“Okay.” <br/><br/>As they walked back, Arthur held the Lotus behind his back with one hand and held Daisy’s hand with the other. <br/><br/>Both of their footsteps were slow, leisurely strolling along the corridor. It was as if they were merging into a picturesque scene with the surrounding landscape. <br/><br/>Green leaves and pure lotus, a beautiful woman walking gracefully. “After lunch, I’ll take you to meet a few people,” Arthur said. <br/><br/>“Hmm?” <br/><br/>“Yesterday, Enamel Cannon went to save Olivia Lane. He found several bottles of 319,” Arthur said, “It was dug up in the courtyard.” <br/><br/>“Did they question those few people?” <br/><br/>“Enamel Cannon’s men questioned them, but they didn’t get any useful information,” Arthur said, “According to Enamel Cannon, they don’t seem like ordinary small fries who know nothing.” <br/><br/>Daisy’s expression dimmed. <br/><br/>Arthur’s Second Uncle Peter... He wouldn’t be working with Edward Kirsten’s people, would he? <br/><br/>“After lunch, I’ll take you to take a look too.” <br/><br/>“Okay..”\t\t\t\t\t\t</div>", "images": {}, "success": true}