{"id": 195, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244273.html", "title": "Chapter 195 - 185: Accepting A Disciple Or Not?", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 195 - 185: Accepting A Disciple Or Not?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 195: Chapter 185: Accepting a Disciple or Not? <br/><br/>Translator: 549690339 <br/><br/>There were only two hours and five minutes left. <br/><br/>The Clark Family was in the north of Imperial Capital, and to get to the south now, during rush hour, would take more than an hour and a half even on the fastest route. <br/><br/>Arthur North checked the time and said, “First, have someone drive to the <br/><br/>South Town and make a big commotion.” <br/><br/>“Yes.” Michael Jackson immediately went to do so. <br/><br/>They had to let Henry Clark know that they had already gone to South Town before he could do any harm to Olivia Lane during this time. <br/><br/>Juan Wright was sweating with anxiety, and as each second passed, the sweat on his face grew more and more. <br/><br/>There was still no news from Holt Lawrence’s side. <br/><br/>The atmosphere in the living room was getting more and more tense, more and more condensed. <br/><br/>Those who went to South Town did not carry the seal, and before six o’clock, even if the person arrived but the seal did not, Olivia Lane would still be in danger. <br/><br/>Moreover, if Olivia Lane’s location was too far away, even if they found out, if it took them longer than six o’clock to get there, the result would be the same. So every minute and every second was very tense. <br/><br/>Another drop of sweat dripped down Juan Wright’s chin, Juan pulled out a piece of paper, wiped his sweat and said, “Lady Zane, do you happen to know any powerful hackers?” <br/><br/>Arthur North and Hugo Clark looked at her. <br/><br/>Daisy Zane glanced at Juan Wright’s computer, touched her right thumb and knuckles, and pursed her lips without saying a word. <br/><br/>Juan Wright’s eyes never left the computer, typing as he said, “The hacker <br/><br/>Henry Clark found is too powerful. He’s been guarding against my attacks. If Celestial Pivot is also attacking, then this hacker is like a godlike existence, guarding against multiple attacks.” <br/><br/>Daisy Zane looked at the living room clock again, looking at the old clock, the second hand moving one tick at a time. The little girl’s fingers were getting more and more dangerous. <br/><br/>“There’s still no news from Celestial Pivot, and I even suspect that Nathan Ninevara and Holt Lawrence have fallen out,” Juan Wright said. “We’re facing <br/><br/>Nathan Ninevara.” <br/><br/>The second hand pointed to twelve, and the minute hand also pointed to twelve. The four o’clock bell sounded. <br/><br/>“Boom!” The old, heavy sound struck deep into everyone’s hearts. <br/><br/>Daisy Zane let go of Arthur North’s hand, slowly stood up, and walked behind Juan Wright. <br/><br/>Everyone’s eyes followed Daisy Zane. <br/><br/>Arthur North also stood up and quietly followed behind her, looking at her. <br/><br/>Daisy Zane stood behind Juan Wright for a while, then bent down and grabbed his wrist. <br/><br/>Daisy Zane conducted another operation, checking the time the cell phone contacted Hugo Clark. The map then zoomed in and showed the cell phone’s movements today. <br/><br/>Starting from the time it called Hugo Clark. <br/><br/>The red dot moved quickly and finally stopped. <br/><br/>“The person with the phone should still be with Olivia Lane,” said Daisy Zane. “It’s not far, the address takes a maximum of 30 minutes to get to.” <br/><br/>There was no movement from the people behind her. <br/><br/>Daisy Zane turned around and looked up at them. <br/><br/>Seeing her gaze, Kevin Clark hid his astonishment and smiled while rubbing her head. <br/><br/>Allonzo Hobson stared at her with an indescribable look of amazement, his lips moving back and forth as if to speak, yet remaining silent. <br/><br/>Juan Wright stared with wide eyes, holding his breath to the point of almost passing out. It wasn’t until several seconds after Daisy Zane spoke that he took a deep breath to revive himself. <br/><br/>Hugo Clark also looked at her, finding this woman to be more and more remarkable. <br/><br/>“Hugo, you go with the others,” arranged Arthur North. “I won’t go. Be careful.” <br/><br/>From an outsider’s perspective, their uncle and nephew relationship appeared unfavorable, so it was best not to act together. <br/><br/>“Alright,” Hugo Clark looked at Daisy Zane again. <br/><br/>Receiving his gaze, Daisy Zane turned back to the computer, tapped a few more keys, and sent the location to him. <br/><br/>After hearing his phone beep, Hugo Clark checked the message, nodded at her, glanced at Arthur North, and hurriedly left. <br/><br/>Allonzo Hobson looked at the departing Hugo Clark and then at Daisy Zane. His lips quivered a couple of times, but still, no words came out as he quickly followed Hugo. <br/><br/>Daisy Zane slowly clenched her fingertips and looked at the doorway, asking, <br/><br/>“Did you mute him with poison?” <br/><br/>Arthur North touched her face and then held the clenched hand, laughing, “You reminded me, muting him with poison would make the world much quieter.” A laugh escaped from Daisy Zane. <br/><br/>Meanwhile, Juan Wright, who had been standing aside, suddenly experienced an epiphany. <br/><br/>It suddenly dawned on him why she didn’t think much of Holt Lawrence’s book. Her skills were like a dimensional attack on Holt’s techniques. <br/><br/>With this realization, Juan Wright suddenly crouched beside Daisy Zane, looking up at her with admiration, and very devoutly said, “Father, do you want to take me as an apprentice?” <br/><br/>Daisy Zane: . <br/><br/>“Father, don’t you think I look like an apprentice?” Juan’s eyes blinked rapidly. <br/><br/>“Get out of the way,” Arthur North looked at him with disgust as he blinked. <br/><br/>Juan looked at him and didn’t move. <br/><br/>But as he saw the look on Arthur North’s face harden, he immediately stood up, and without even taking his computer, he ran off..\t\t\t\t\t\t</div>", "images": {}, "success": true}