{"id": 196, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244277.html", "title": "Chapter 196 - 186: '2”, A Particle…", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 196 - 186: '2”, A Particle…</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 196: Chapter 186: “2”, a particle... <br/><br/>Translator: 549690339 <br/><br/>Around four forty, Hugo Clark called to inform Harton Clark that Olivia Lane had been safely rescued unharmed. <br/><br/>Not only was Olivia unscathed, but according to Allonzo Hobson, when they stormed in, she had also taken down several people who were guarding her. <br/><br/>Hearing the commotion outside, she seized the opportunity to make her move. <br/><br/>After learning that Olivia was safe and sound, Daisy Zane finally put down her hanging heart. She thought, this little girl is really clever, knowing to make a move only when someone comes to her rescue. <br/><br/>Later, close to 5 0’clock, Holt Lawrence sent the location message to Daisy <br/><br/>Zane. <br/><br/>At the same time, he naturally sent a copy to Hugo Clark. <br/><br/>There was no news from Hugo’s side, but Daisy Zane saw the message and replied with one word: [Trash.] <br/><br/>Holt Lawrence retorted angrily: [What do you know! I’ll tell you, the hacker who hid the location is very skilled, and you’re definitely a match for them. Even if you did it yourself, it would take at least an hour. You really talk big, I’m telling you, this hacker might even surpass you.] <br/><br/>Daisy Zane first sent him a very disdainful emoji. <br/><br/>Then she sent another message: [Less than five minutes. And don’t compare trash to me.] <br/><br/>After this message, there was no response from Holt Lawrence for a long time. <br/><br/>However, ten minutes later, the phone suddenly rang. <br/><br/>Daisy Zane was looking at the photos on the living room wall at the time, most of which were of Mrs. Clark’s Peking opera roles, with a small number of family photos. <br/><br/>Some of them were even black and white, and judging from the background of the photos, they were at least fifty or sixty years old. <br/><br/>Mrs. Clark was the epitome of twinkling eyes and a lovely demeanor, with a graceful figure. <br/><br/>Harton Clark followed her and introduced the photos to her one by one as she showed interest. Folloow current novÊls on nov3lb((in).(com)<br/><br/>Daisy Zane listened quietly. <br/><br/>So when Holt Lawrence called, she glanced at the phone and hung up. <br/><br/>He then called two more times, and she hung up both times. <br/><br/>Holt Lawrence began sending messages: [Nana! Come out! You actually took matters into your own hands!] <br/><br/>[Are you going to make a comeback to Bart Lake? Are you, are you!] <br/><br/>“And then, under everyone’s anticipation, the third son of the Clark family was born.” Kevin Clark laughed, “My big brother said that my dad was only concerned about how my mom was doing at the time and didn’t even hear what the doctor and nurse said. It was my big brother and sister-in-law who took care of me. It wasn’t until three days later that he found out that his third child was a boy.” <br/><br/>Daisy Zane turned her head and laughed. <br/><br/>“And it was also because my mom was being discharged from the hospital and a birth certificate had to be issued. My big brother asked my dad to pick a name for me, and that’s when everyone realized that my dad didn’t know my gender.” <br/><br/>“Because the name he chose was for a little girl?” Daisy Zane asked while laughing. <br/><br/>“Yes,” Kevin Clark said, “According to the family naming rule, my name should have started with ‘North’, but my dad didn’t have the mood to choose a name after knowing the truth, so he used the character ‘Zhi’ (2) instead. It’s an auxiliary character... meaningless.” <br/><br/>Daisy Zane couldn’t help but let out a soft laugh, taking a moment to collect herself before asking, “Did he never consider that it might be a boy and prepare a name for a son?” <br/><br/>“My mom could feel the pulse and determine the baby’s gender.” Kevin Clark said, “She informed my dad about the first two in advance. But this time, in order to save my life, she hid it from him.” <br/><br/>“That’s amazing.” <br/><br/>“Yes.” Kevin Clark saw her laughing so hard that tears were about to come out, so he leaned down and kissed her eyes, “Fortunately, I grew up to look a lot like my mom. So I didn’t have as hard a time living in this family.” <br/><br/>Daisy Zane loved hearing Kevin Clark talk about his family. <br/><br/>The atmosphere in the Clark family was very good. Although they were a noble family, there was a sense of warmth and humanity in their courtyard. <br/><br/>It was an enviable family. <br/><br/>Just listening to it made one happy. <br/><br/>Around 5:50, the people who went to South Town captured the people waiting at the unfinished building in South Town and brought them back. Soon after, Hugo Clark returned after taking Olivia Lane home. <br/><br/>Among the captured people, Henry Clark was not found. <br/><br/>Henry Clark’s phone call to Hugo Clark was pre-recorded, and Henry himself never came to China. <br/><br/>“The people we caught aren’t Henry Clark’s people.” Hugo Clark said. <br/><br/>Kevin Clark raised an eyebrow, “He’s cooperating with someone else. He’s borrowing someone else’s power, and that ‘someone else’ is definitely seeking something in return.” <br/><br/>“Your Clark family.” <br/><br/>Both Kevin Clark and Hugo Clark looked at Daisy Zane. <br/><br/>Daisy Zane looked at the two and said lazily, “Henry Clark collaborates with someone to help him seize the Clark family. Once the Clark family is in Henry Clark’s hands, the collaborator could use the Clark family to operate freely in the Imperial Capital.” <br/><br/>With the power of the Clark family, taking action in the Imperial Capital would be a breeze. <br/><br/>Kevin Clark chuckled, his laughter filled with contempt for the insignificant power, “Looks like Henry Clark’s days are numbered.” <br/><br/>Hearing this, the expression on Hugo Clark’s face gradually darkened. <br/><br/>Indeed, it was time for things to come to an end..\t\t\t\t\t\t</div>", "images": {}, "success": true}