{"id": 197, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244281.html", "title": "Chapter 197 - 187: How Dare You Covet The Lane Family’S Daughter", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 197 - 187: How Dare You Covet The Lane Family’S Daughter</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 197: Chapter 187: How Dare You Covet the Lane Family’s Daughter <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane had dinner at the Clark Manor with Hugo Clark and Allonzo Hobson. <br/><br/>The food at the Clark’s was very tasty, not to mention exceptionally exquisite, so exquisite that it would make one question life, making it hard for them to pick up their chopsticks. <br/><br/>They were just regular home-cooked dishes. <br/><br/>But once they reached the dining table at the Clark’s, they transformed into royal cuisine. <br/><br/>Daisy Zane even felt that if she ate too much, she would spoil the image of the entire mansion. <br/><br/>But... she still let herself eat her fill. <br/><br/>After all, she would only feel at ease once this exquisite food was in her stomach. <br/><br/>As a host, it wasn’t right to put down the chopsticks before the guest was finished eating. <br/><br/>So, Hugo Clark spent nearly half an hour more eating this meal than he usually would. <br/><br/>After the meal, the four of them sat in the living room for a while. Allonzo Hobson went home first, followed by Hugo Clark who also had to return to his own courtyard. <br/><br/>Seeing Hugo about to leave, Arthur North asked Daisy Zane to wait in the living room for a while. He then walked Hugo out. <br/><br/>The uncle and nephew walked off into the distance and stood in the hallway to chat. <br/><br/>“What are you planning on doing about the situation with Henry Clark?” Hugo Clark asked, lighting a cigarette. <br/><br/>“I don’t know yet.” Arthur North replied. The source of this content nov(el)bi((n))<br/><br/>“It’s hard to explain to Grandfather.” Hugo Clark said, “Henry Clark is his only relative left. He might find it hard to let go...” <br/><br/>The older one gets, the softer their heart becomes. <br/><br/>“Henry Clark almost got you killed back then. It was already a chance given to him when we let him go abroad instead of taking his life,” Arthur North said softly, “this time... if he still harbours such intentions, there is no way I’m going to let him off again.” <br/><br/>Hugo Clark smoked in silence, looking down. <br/><br/>“If necessary, tell William Lane about Olivia Lane’s arrest,” Arthur North said, “Let him take action.” <br/><br/>Hugo Clark chuckled, this was indeed a good strategy of ‘killing with a borrowed knife’; a classic move of his third uncle. <br/><br/>Arthur North, with his left hand behind his back, stood tall, he glanced at Hugo Clark and said, “Hugo, I underestimated you. You even dare to have feelings for the Lane Family’s daughter.” <br/><br/>Hugo Clark was taken aback, he subconsciously wanted to retort but didn’t speak. <br/><br/>“A twelve years age difference... and she’s still in high school.” Arthur North chuckled, “I wonder if William Lane would bite. I’m actually starting to look forward to his reaction now.” <br/><br/>Hugo Clark: ‘ <br/><br/>Arthur North chuckled again, “My third uncle certainly didn’t foresee your love life to be this complicated. You probably know how much the Lane Family spoils their daughter. Those hurdles set by her parents...and her brother...” Hugo Clark: ‘ <br/><br/>“But at least you’re a match in terms of status.” Arthur North said, “My third uncle will prepare a generous dowry for you.” <br/><br/>Daisy took it from him and held it. <br/><br/>Seeing her satisfied curiosity, Kevin Clark smiled slightly, “Shall we walk over, or take a car?” <br/><br/>“How long will it take?” Daisy asked. <br/><br/>“Within thirty minutes.” <br/><br/>“Let’s walk.” <br/><br/>“Good,” said Kevin Clark softly, “Let’s enjoy our home’s courtyard on our way.” <br/><br/>It was indeed worth admiring. <br/><br/>After a while, Daisy asked, “Can we take a car?” <br/><br/>“Yes,” Kevin Clark said, “If we take a car, it’s a different route. The car route is smoother and wider. I can show you tomorrow.” <br/><br/>Daisy contemplated and agreed, considering the size of the mansion, it was quite tiring to walk around, especially since Kevin Clark’s parents were aged. <br/><br/>“My parents live in the central courtyard,” Kevin Clark introduced, “My eldest brother and Hugo live in the eastern courtyard. But they both mostly reside outside.” <br/><br/>“Where do you live? The western courtyard?” <br/><br/>“I live in the north.” When they reached a moon gate, Kevin Clark let Daisy go first, “The northern courtyard has the largest area, including the part up the mountain. I also dug a lotus pond over there.” “Twenty-acre lotus pond,” Daisy said. <br/><br/>Kevin Clark chuckled, “The rumors are inaccurate.” <br/><br/>“How much then?” <br/><br/>“Twenty-five acres.” <br/><br/>Daisy: So much for inaccurate rumors. <br/><br/>They had been walking for over ten minutes, winding around. If anyone had a slightly poor sense of direction, once they entered, they would probably lost and can’t find their way out. <br/><br/>A few minutes later, Daisy suddenly heard the sound of flowing water. After a few steps, they stepped onto an arched wooden bridge. <br/><br/>There were ground lights on both sides of the bridge, and there were round lampshades on the railings. <br/><br/>Below the bridge was a small river, from which the sound of water came, but both sides seem endless. Only after a certain distance, there would be a similar small bridge. <br/><br/>Faintly, there was a small boat and lotus flowers in the river. <br/><br/>The riverside was lined with willow trees, swaying gently in the slight night breeze. <br/><br/>“Your lotus flowers?” Daisy stopped and looked at the river. <br/><br/>“They were donated to the river. The ones that didn’t grow well, I would have them transplanted here,” said Kevin Clark, “Tomorrow when it’s cooler, I can take you boating.” <br/><br/>A gentle breeze brushed her face, with a small bridge over the flowing river. <br/><br/>Unexpectedly, Daisy felt like she was in a small southern town, feeling carefree and comfortable. <br/><br/>Seeing that she likes this place, Kevin Clark was secretly pleased. Finally, she liked more than just the Doomsday Hotel in her heart..\t\t\t\t\t\t</div>", "images": {}, "success": true}