{"id": 194, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244269.html", "title": "Chapter 194 - 184: Clark Manor", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 194 - 184: Clark Manor</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 194: Chapter 184: Clark Manor <br/><br/>Translator: 549690339 <br/><br/>The car drove towards the Imperial Capital suburbs. <br/><br/>Daisy Zane watched the changing scenery outside the car, her fingers tapping lightly on her thigh. <br/><br/>Since Arthur North had kidnapped Olivia Lane because of the Clark Family and even called Hugo Clark, at least for a certain period of time, Olivia Lane’s safety would not be an issue. <br/><br/>But she didn’t know why she felt a little uncomfortable in her heart. <br/><br/>The car stopped and Daisy Zane quickly got out of the car with Harton Clark. However, as soon as she got out of the car and saw the scene before her, her door-closing movement paused. <br/><br/>There were a grand gate with five doors and three entrances, red walls and green tiles, and the gate was painted red with nine rows and seven columns of door studs. The beam of the gate was decorated with colorful paintings, and the roof ridge was adorned with kissing beasts and the eaves with immortals and animals. <br/><br/>On both sides of the gate, two stone lions were placed, majestic and imposing. <br/><br/>The most important thing was the golden plaque above the gate. The two big golden characters “Clark Manor” shone with golden light. <br/><br/>The sun had just moved westward, shining on the plaque from the southwest, making the two characters glimmer. <br/><br/>Daisy Zane’s gaze went up and it was no longer a mansion that reflected in the bottom of her eyes, but power and money. <br/><br/>Clark Manor was located at the foot of a mountain in the north of the Imperial Capital. <br/><br/>The flat land at the foot of the mountain covered an area of nearly ten hectares. <br/><br/>However, Clark Manor was built up the mountain from the foot, and the area on the mountain was unmeasured. <br/><br/>Anyway, standing at the entrance, one could not see the end of the buildings on the mountain. <br/><br/>When Harton Clark’s car stopped, someone ran out from the side gate at the entrance, taking the car key from his hands. <br/><br/>“Third Master is back?” This person... was actually wearing a long gown. <br/><br/>“Yes.” Seeing Daisy Zane hadn’t moved, Harton Clark went to her side, took her hand, and said, “My parents are not at home.” <br/><br/>Daisy Zane was focused on the mansion and hadn’t even thought of his parents. She calmly responded with a hum. <br/><br/>The young man in the long gown saw his Third Master holding a young lady’s hand and immediately started to gossip. <br/><br/>Harton Clark led Daisy Zane inside while holding her hand but then turned back after a few steps, looked at the young man who was about to get into the car, and said, “Less gossip.” <br/><br/>The young man stood upright, closed his mouth tightly, and nodded... <br/><br/>Harton Clark led Daisy Zane inside. After entering the gate, there was a stone-carved screen wall. As they walked past the screen wall, the scenery inside was very sophisticated. <br/><br/>Exquisite craftsmanship and elegant layout. <br/><br/>“What did Ye Sheng say on the phone?” Kevin Clark asked. <br/><br/>“He said to bring the Clark family’s seal to the unfinished building in South <br/><br/>Town Suburb before 6 PM, and then he’ll tell me where Olivia Lane is.” Hugo Clark pressed the bridge of his nose, “Or else... Olivia Lane will lose a finger for every ten-minute delay.” <br/><br/>Daisy Zane pinched her fingertips, and her aura instantly turned cold. <br/><br/>Kevin Clark glanced at her and squeezed her hand. Looking at the time, there were still two hours and ten minutes until six o’clock. <br/><br/>Xavier Dominic and Hugo Clark both noticed the change and looked at her. <br/><br/>“Ye Sheng sent me a video of him kidnapping Olivia Lane.” Hugo Clark continued, “It was filmed in a car, with no visible background or sound. She is... <br/><br/>safe for now.” <br/><br/>“There’s no information about Ye Sheng entering the country.” Kevin Clark said. <br/><br/>“Indeed, there’s not a trace of him.” Hugo Clark replied, “The only thing we have is the mobile number.” <br/><br/>“Why did he kidnap Olivia Lane to threaten you?” Kevin Clark looked up at Hugo Clark, staring into his eyes. <br/><br/>Hugo Clark pursed his lips, his expression looked like he was choking up. <br/><br/>“Yeah, why her? He could have kidnapped someone else!” Xavier Dominic exclaimed, “He kidnapped William Lane’s sister. If William Lane knew his sister was taken, what would he do? Juan Wright, you have to act fast! If the people guarding Olivia notice her disappearance, William Lane will find out soon too.” <br/><br/>“I’m trying.” Juan Wright didn’t lift his head. <br/><br/>“Did she shake off her guards again?” Kevin Clark asked. <br/><br/>He heard William Lane say that Olivia Lane would often shake off her guards, go out and play by herself. <br/><br/>The guards, in addition to protecting her, also kept her from fighting with others. <br/><br/>“Yes.” Hugo Clark helplessly replied, “After Ye Sheng called me, I tried calling Olivia Lane but couldn’t get through. Then I called her guards. Using the excuse of inquiring about her recent situation, they said she slipped away from them when she went to the restroom.” <br/><br/>Kevin Clark looked at Hugo Clark, and after a moment, raised his eyebrows mysteriously. <br/><br/>Hugo Clark shuddered slightly due to his raised eyebrows. <br/><br/>“Longer we wait, the more likely her guards will notice something is wrong.” <br/><br/>Xavier Dominic said, “If anything happens to this ancestor from the Lane Family, would William Lane end the friendship with us? I’m more worried he won’t be able to handle it. He’s already spent a lifetime on one sister, if something else happens to this one....” <br/><br/>Kevin Clark and Hugo Clark both looked at him. <br/><br/>Xavier Dominic immediately closed his mouth and retreated to the farthest chair without saying anything else. <br/><br/>Daisy Zane saw their reactions and didn’t dwell on their deeper meanings, simply looking down at the time on her phone....\t\t\t\t\t\t</div>", "images": {}, "success": true}