{"id": 192, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244245.html", "title": "Chapter 192 - 182: Olivia Lane", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 192 - 182: Olivia Lane</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 192: Chapter 182: Olivia Lane <br/><br/>Translator: 549690339 <br/><br/>Olivia Lane appeared to be visiting for the first time, her eyes brimming with curiosity, seemingly unfazed by the many people staring at her on the first floor. <br/><br/>She strolled along, looking around at everything. <br/><br/>Behind her were four people, one carrying a food box, and another holding a cat carrier with a blue-eyed ragdoll cat inside. <br/><br/>Olivia walked briskly, observing her surroundings, and only noticed Kevin Clark when she reached the staircase. <br/><br/>Then, Daisy Zane saw Olivia shudder as if she had seen a ghost, staggering back and her face, which had previously been curious and relaxed, tense up with just a hint of fear. <br/><br/>Daisy glanced at Kevin Clark. <br/><br/>When Kevin wasn’t smiling, his aura was powerful, and his expression seemed naturally wicked and fierce. <br/><br/>He was like a mysterious, enchanting, and oppressive distant mountain shrouded in mist and rain. <br/><br/>Olivia, obviously frightened of him, stepped back and called out, “Thir-, Third Uncle.” <br/><br/>For the first time, Daisy witnessed Kevin Clark’s seniority skyrocket. <br/><br/>“Uncle, so you’re here too,” she said. <br/><br/>“What are you doing here?” Kevin asked. <br/><br/>Daisy thought Kevin appeared to be looking at Olivia as if she were his mischievous niece, which made her automatically elevate her own seniority. <br/><br/>Olivia glanced at Daisy and mumbled quietly, “What else could I be doing here but watching a show?” <br/><br/>Kevin pretended not to hear her last words, looked at the cat, and said, “The cat cannot go inside.” <br/><br/>“Why not?” Olivia asked, “I’ve already put it in a cage.” <br/><br/>“Even in a cage, can you guarantee it won’t meow and disrupt the audience?” <br/><br/>Olivia countered, “But my brother said it’s okay.” <br/><br/>“Let your brother come.” <br/><br/>“My brother isn’t in the Imperial Capital. How could he come?” <br/><br/>Kevin stared at her without saying a word. <br/><br/>Feeling a chill in her heart from his gaze, Olivia turned to the people behind her and said, “Take it out and take good care of it. Be careful. You two go with them as well.” <br/><br/>Daisy raised her eyebrows, thinking how befitting of a spoiled little lady to have so many people attending to her cat. She looked at the cat, but because the person holding it had already turned to leave, all she could see was a tail. <br/><br/>Daisy Zane could somewhat understand. <br/><br/>The eldest daughter of the Lane family was born with a golden spoon in her mouth. If it were in ancient times, with the Lane family’s status, <br/><br/>She would almost be equivalent to a legitimate princess of the royal family. <br/><br/>She would be the recipient of thousands of love and affection. <br/><br/>Such an honorable status. <br/><br/>“Back then, if Charlotte wanted stars, the Lane family would probably be able to pick all the stars and the moon from the sky and place them in front of her.” Kevin Clark said, “And William Lane doted on her the most. He was always around her, almost wishing he could bring her to school with him.” Daisy Zane laughed as she listened to Kevin Clark’s resentful tone. <br/><br/>“So that led to William Lane thinking that everyone was coveting his sister.” Kevin Clark said helplessly, “He always thought that we were trying to steal his sister. Look... the result of spoiling her like just now.” <br/><br/>“It’s not bad.” Daisy Zane said, “She’s quite cute.” <br/><br/>Kevin Clark looked at her, and the more he thought about it, the more he felt that something was wrong. <br/><br/>This little girl was curious about the Lane family, which was fine, but now she even found Olivia Lane cute. <br/><br/>The alarm bells in his heart were ringing loudly. <br/><br/>Kevine Clark took another step forward and said: “Little girl, Olivia Lane is used to being arrogant and she’s not easy to get along with.” <br/><br/>Daisy Zane:??? <br/><br/>“William Lane only has his sister in his heart. Marrying into his family won’t bring happiness.” <br/><br/>Daisy Zane: . <br/><br/>“And...William Lane is not as good-looking as me.” <br/><br/>Daisy Zane looked at him and suddenly laughed. <br/><br/>“Third Master, don’t you want your brother anymore? You’re slandering him like that.” <br/><br/>“A brother is for slandering at critical moments.” Kevin Clark laughed, “But what I said is true; he’s really not as good-looking as me.” <br/><br/>Kevin Clark had a firm grasp on Daisy Zane’s superficial focus on appearances. <br/><br/>Daisy Zane looked at his eyebrows and eyes, and after a moment, her smile deepened, and she whispered softly: “Yes. You are the best-looking.” <br/><br/>Kevin Clark’s smile also deepened, he lowered his head and lightly pecked her lips: “My little girl is also the best-looking.” <br/><br/>Daisy Zane stretched out her finger to poke his shoulder, prompting him to take a step back, “Public place, be mindful of your image.” <br/><br/>“It doesn’t count as a public place; everything here is mine.” Kevin Clark laughed. <br/><br/>Daisy Zane: . <br/><br/>It seemed like he was showing off his wealth, and he was so annoying..\t\t\t\t\t\t</div>", "images": {}, "success": true}