{"id": 191, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244243.html", "title": "Chapter 191 - 181: Stella Edwards", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 191 - 181: Stella Edwards</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 191: Chapter 181: Stella Edwards <br/><br/>Translator: 549690339 <br/><br/>“What’s this person’s name?” <br/><br/>In the dimly lit room, all the curtains were drawn tightly, not letting any light in. <br/><br/>A man sat on the sofa, facing a projected video of a dance performance. <br/><br/>The background of the dance was rather dark, and only the dancers on stage were illuminated by a beam of light. <br/><br/>Therefore, it didn’t bring much brightness to the dim room. <br/><br/>The man was somewhat hidden in the darkness and his face couldn’t be seen clearly. But his slightly blue eyes were especially bright as he looked at the screen. <br/><br/>As he watched the dancer on the screen, the interest in his eyes grew stronger and stronger, and he finally couldn’t help but ask the person beside him. <br/><br/>The woman standing by his side promptly looked up the information about this dancer. <br/><br/>And then she reports, “Her name is Stella Edwards, a member of the Dance <br/><br/>Association. The only disciple of Sophie Ortiz, the president of the Dance <br/><br/>Association. Currently on a world tour...” <br/><br/>Edward Kirsten swayed a glass of red wine in his right hand, the vivid red wine slowly swirled in the glass. He looked at the screen and said softly, “Stella <br/><br/>Edwards...” <br/><br/>“How old is she?” <br/><br/>“Twenty-five this year.” Alice Eugene answered. <br/><br/>Edward Kirsten looked at the woman on the screen again and said, “Alice... <br/><br/>don’t you think she looks somewhat similar to Little Enigma when dancing?” <br/><br/>Alice stood at the side, and upon hearing his remark, her eyelashes trembled slightly. <br/><br/>“No...,” Edward Kirsten stared at the screen and continued, “Little Enigma dances better and is better looking than her. Her waist... is thinner than hers, and her body proportions are better.” <br/><br/>Alice stood beside him like a piece of wood, emotionless and unresponsive. <br/><br/>“If Little Enigma were to dance this piece, she would definitely do better than her.” Edward Kirsten closed his eyes, and his other hand rested on his thigh, tapping to the rhythm of the music in the video. <br/><br/>With his eyes closed, he seemed to imagine Enigma dancing to this piece, and a soft laugh escaped his lips shortly after. <br/><br/>But at the end of the laugh, he immediately smashed the wine glass in his hand on the floor. <br/><br/>The glass shattered, red wine splattered everywhere. <br/><br/>Alice lowered her head, even trying to breathe softly. <br/><br/>“Hm?” Kevin Clark frowned, “What did someone say?” <br/><br/>“Not about her personality, but... her appearance.” Senior sister explained, “You should discuss with Daisy and go meet your parents. I think if you don’t, <br/><br/>Daisy’s image might be imagined from Guan Yu and Zhang Fei to an alien.” Kevin Clark: What exactly happened to his family? <br/><br/>“You asked me to help keep it a secret, and I’ve been playing clueless this whole time.” The senior sister said, “I don’t dare tell the teacher that I’ve met Daisy. I’m afraid she’ll scold me for helping you hide the truth from her. So, you should handle this yourself.” <br/><br/>Kevin Clark nodded. <br/><br/>Senior sister also smiled at Daisy Zane, who was waiting for him in the distance, and then said to Kevin Clark, “That’s all I wanted to talk to you about. <br/><br/>Go ahead.” <br/><br/>Their seats were on the second floor’s private rooms with small partitions. <br/><br/>As the two walked back, about two meters away from the staircase, Daisy Zane suddenly noticed several black-suited men quickly coming up the stairs. <br/><br/>Two men were stationed at the staircase on the first and second floors. Then, in the second floor corridor, two more men were stationed every two meters. <br/><br/>Daisy Zane looked at these men, her pace stopping for a moment. <br/><br/>Kevin Clark also stopped, and explained to her, “They’re from the Lane Family.” <br/><br/>It was then that Daisy Zane noticed the “Lane” character two centimeters above the left cuff of their suits. She gently raised her eyebrows. <br/><br/>No wonder... <br/><br/>This Orchard Garden belonged to the Clark Family, and no one but the Lane Family dared to make such a grand entrance on the Clark Family’s territory. They’d be asking to get taken down. <br/><br/>“Who’s here?” Daisy Zane casually asked. <br/><br/>Kevin Clark hadn’t heard that anyone from the Lane Family had reservations today, so he took a look towards the entrance. <br/><br/>Seeing him not speaking, Daisy Zane also followed his line of sight. <br/><br/>They then saw a little girl wearing high-waisted wide-leg jeans and a simple white T-shirt. Her short waist just met the jeans, without exposing her belly. <br/><br/>The young girl’s appearance was also stunning. Very fair skin, pale pink lips, a pair of beautiful eyes, somewhat like peach blossom eyes, but colder by a few degrees. <br/><br/>Her hair was casually tied up with a hairpin, giving it a lazy and disheveled look. It didn’t make her look mature, but rather it added a touch of playfulness. <br/><br/>The little girl had her hands behind her back, craning her neck, looking left and right, seemingly full of curiosity about the inside. <br/><br/>There were also two women and two men following behind her. <br/><br/>It seemed that they were all there to protect her. <br/><br/>“Olivia Lane.” Kevin Clark said. <br/><br/>Daisy Zane kept watching her, not taking her eyes off the girl since she appeared: “The youngest daughter of the Lane Family?” <br/><br/>“Yeah..”\t\t\t\t\t\t</div>", "images": {}, "success": true}