{"id": 193, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244265.html", "title": "Chapter 193 - 183: Variety Show Program", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 193 - 183: Variety Show Program</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 193: Chapter 183: Variety Show Program <br/><br/>Translator: 549690339 <br/><br/>On the way back from the Pear Orchard, Uncle Wilton was still reminiscing about the opera in the Theatre Garden. <br/><br/>As for Charles Amos, he couldn’t understand it and found it to be just a bunch of strange noises, so he got bored and fell asleep halfway through. <br/><br/>He was even carried to the car by Uncle Wilton and was still being held by him, sleeping soundly. <br/><br/>“Uncle Wilton, if you like it, you can come and listen often.” Daisy Zane said. <br/><br/>“I really do like it.” Uncle Wilton sighed, “Maybe it’s because I’m getting older, but I find traditional things more pleasing now.” <br/><br/>Kevin Clark said, “I’ll have someone send you tickets regularly.” <br/><br/>“I wouldn’t dare bother Third Master.” Uncle Wilton said. “I’ll iust buv them myself when I want to listen.” <br/><br/>“It’s no trouble.” Kevin Clark said, “Just let me know.” “Thank you, Third Master.” Daisy Zane said. <br/><br/>“You’re welcome.” Kevin Clark replied with a smile. <br/><br/>Uncle Wilton looked at the two of them and smiled, then lowered his gaze to Charles Amos, “The young master should also listen more and experience the cultural influences of our country.” <br/><br/>Charles Amos mumbled something, not knowing what beautiful dreams he was having. <br/><br/>“Drive away those Western genes inside him.” Daisy Zane said. Smiling, Kevin Clark asked, “What nationality is he mixed with?” <br/><br/>“I don’t know.” Daisy Zane said, “Really strange.” <br/><br/>Kevin Clark had felt Daisy Zane’s rejection of some of Charles Amos’ genes more than once. <br/><br/>“Who’s strange?” Charles Amos suddenly asked, opening his eyes. <br/><br/>“You.” Daisy Zane replied bluntly. <br/><br/>“What’s wrong with me?” Charles Amos said, clutching Uncle Wilton’s suit collar and tilting his head back, still looking half-asleep. <br/><br/>“Never mind. Go back to sleep.” Uncle Wilton patted his back and said. <br/><br/>“Oh.” Charles Amos leaned his head back on Uncle Wilton’s shoulder and went back to sleep. <br/><br/>After a while, he murmured in his sleep, “I’m not strange.” <br/><br/>Daisy Zane: . <br/><br/>Ever since she wrapped up filming the show, Daisy Zane hadn’t found the right job for her. <br/><br/>She had already filmed two TV series and wanted her next project to be a movie. Something with a higher production value and likely to win an award. <br/><br/>Her role in “Fall of the Quince” had made her very popular. <br/><br/>She was offered numerous scripts due to her massive fanbase and her association with Flynn Ninevara. <br/><br/>But... Daisy Zane’s initial intention joining the industry was to win awards. As for fanbase and fame, she wasn’t interested. <br/><br/>She just wanted to win awards earnestly. <br/><br/>Kevin Clark smiled and said, “Once in a while. It’s not too bad.” <br/><br/>“Let’s talk about it then.” Daisy Zane reached out again to touch the plants beside her, but accidentally tore off a leaf as soon as she touched it. She quickly looked around, saw that Wilton Edwards wasn’t there, and surreptitiously destroyed the evidence. “I might not have the time.” <br/><br/>“Okay.” As an accomplice, Kevin Clark removed the half-broken leaf stem from the plant, “We’ll talk then.” <br/><br/>As soon as he finished speaking, his cell phone rang. <br/><br/>He looked at the incoming call display, saw that it was Hugo Clark and immediately answered the phone. <br/><br/>But before he could say anything, the always calm and collected Hugo Clark anxiously spoke first. <br/><br/>“Third Uncle, Olivia Lane has been taken away by Henry Clark’s people.” <br/><br/>Kevin Clark’s expression suddenly turned fierce, and his grip on the swing tightened: “Did Henry Clark call you?” <br/><br/>“Yes.” <br/><br/>“Where are you now?” <br/><br/>“At our house.” <br/><br/>“I’ll be right back.” Kevin Clark said, “Tell Juan Wright to locate and find the people.” <br/><br/>“I know.” <br/><br/>Seeing his expression, Daisy Zane stepped on the ground and stopped the swing, asking, “What’s the matter?” <br/><br/>“Olivia Lane was taken away by my Second Uncle.” Kevin Clark’s voice was cold and ruthless, but his expression and speed were very calm. “I have to go back first.’ <br/><br/>Daisy Zane frowned, stood up, and said, “I’ll go with you.” <br/><br/>Kevin Clark glanced at her, thought about going back home, and then... <br/><br/>He quietly agreed: “Alright.’ <br/><br/>In an emergency, Daisy Zane didn’t ask too many questions, not until they were both in the car and Kevin Clark had made some arrangements over the phone with his men. <br/><br/>Daisy Zane finally asked, “You have another uncle?” <br/><br/>“Yes,” Kevin Clark said, “He’s my father’s half-brother.” <br/><br/>“When you had people following me in Truro City, was it to guard against your Second Uncle?” Daisy Zane immediately figured it out. <br/><br/>“Yes.” <br/><br/>Daisy Zane thought for a moment and understood the general situation: his <br/><br/>Second Uncle must be at odds with his family. But.. <br/><br/>“Why did he take Olivia Lane?” <br/><br/>Kevin Clark furrowed his eyebrows, as he was thinking about this as well. <br/><br/>Under such circumstances, it was more likely for Henry Clark to try to win over the Lane Family or make the Lane family feel that this was a private matter of the Clark family and not to interfere. <br/><br/>But in any case, they shouldn’t make enemies with the Lane family by taking <br/><br/>Olivia Lane...This chapter is updated by nov(e)(l)biin.com\t\t\t\t\t\t</div>", "images": {}, "success": true}