{"id": 190, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244241.html", "title": "Chapter 190 - 180: Educating Children", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 190 - 180: Educating Children</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 190: Chapter 180: Educating Children <br/><br/>Translator: 549690339 <br/><br/>Miles Family’s incident continued to create a buzz online, with the heat showing no signs of abating. <br/><br/>Besides those condemning the Family, those defending them, and others simply waiting to see the excitement unfold. <br/><br/>They wanted to see how Daisy Zane would respond, whether she would apologize to the Miles Family, and what her opinion was on the Charles Hobson matter. <br/><br/>However, Daisy Zane merely went online once, paying no attention to the incident. <br/><br/>Instead, the Miles Family appeared overnight as the hot search on Facebook, like a clown jumping up and down on their own accord. <br/><br/>Of course, there were those who claimed that Daisy Zane had dared not respond. Some even accused her in the comments under her latest Facebook post. <br/><br/>Amelia Miles waited for Daisy Zane’s response before proceeding with her next attack plan. <br/><br/>However, Daisy Zane didn’t take the bait, giving her no chance to act. <br/><br/>Although the incident brought some benefits to the Miles Family, helping salvage some of their reputation, Daisy Zane’s unwillingness to engage put them in an awkward situation. <br/><br/>So, the heat lasted only one night, gradually subsiding afterward. <br/><br/>On Daisy Zane’s side, she slept until noon, getting up to make a child’s... <br/><br/>After lunch, she waited for Kevin Clark to pick her up and take her to the Orchard Garden to watch a show. <br/><br/>After Kevin Clark’s senior learned Daisy Zane was in the Imperial Capital, she gave her some tickets, inviting her to come and watch her performance. <br/><br/>So, when Kevin Clark arrived, he saw Wilton Edwards busy trimming the courtyard’s plants. <br/><br/>Daisy Zane was on the indoor swing, making a phone call. <br/><br/>Charles Amos, meanwhile, was standing by the staircase, blushing with red eyes, as if he had been punished to stand. This chapter is updated by nov(e)(l)biin.com<br/><br/>Kevin Clark exchanged glances with him and then looked at Daisy Zane. <br/><br/>Daisy Zane was stepping on the ground, swinging the swing and making a phone call. Detecting the gaze, she glanced at Kevin Clark too. <br/><br/>She was talking to Edward Monk. <br/><br/>Monk: “You should start preparing your next script. It’s been almost a month since this one wrapped up.” <br/><br/>“Mm,” Daisy Zane replied. <br/><br/>“This Stella Edwards is really good,” Monk said, “A very clever girl who learns quickly. She also works well with George Dunn. I’d like her to act in the next script. Make sure to leave her a role.” <br/><br/>“Mm,” Daisy Zane said, “But does she have time? I saw on the Dance Association’s official website that there are performances from mid-June to <br/><br/>December. Is she available?” <br/><br/>Trying to communicate with Charles Amos, he remained silent, only staring at him with red eyes. <br/><br/>Overhearing Daisy Zane’s words, Kevin Clark looked at her. <br/><br/>She was paying attention to the Dance Association’s news... <br/><br/>His little mouth was tightly pursed, and it seemed like he was trying hard to hold back tears. <br/><br/>Harton raised an eyebrow and laughed, “What did he do wrong?” <br/><br/>“He talked back to Wilton Edwards and even yelled at him once. It was very impolite.” Daisy Zane said. <br/><br/>Even though Wilton Edwards appeared to be a housekeeper, Harton knew that the little girl respected him highly and treated him like an elder. <br/><br/>Even when eating, she would naturally sit next to him at the dining table, leaving the main seat empty. <br/><br/>“You really hit him?” <br/><br/>“Mhm,” Daisy Zane said, “Who would be fooling around with him, otherwise.” <br/><br/>Harton turned and glanced at Charles Amos, then turned back and said, “After hitting him, you made him stand in punishment?” <br/><br/>“Mhm. He didn’t even eat lunch.” <br/><br/>Harton’s eyebrows moved slightly. She really did love him, and she really did discipline him. She didn’t hold back at all. <br/><br/>“How long will he stand?” <br/><br/>“Two hours.” Daisy Zane glanced at her phone, and it had already been two hours and two minutes. She turned to Charles Amos and said, “Go and apologize to Grandpa Edwards.” <br/><br/>Charles Amos pursed his lips and immediately ran out. <br/><br/>Harton wanted to see how Charles Amos would apologize to Wilton, but from his angle, he couldn’t see anything as it was blocked by a large green plant. <br/><br/>It wasn’t until ten minutes later that Wilton came in carrying Charles Amos. <br/><br/>Charles Amos had clearly been crying, and there were still tears on his long eyelashes. <br/><br/>Daisy Zane glanced at them and didn’t say much more. She said to Harton, “You take him to eat.” <br/><br/>“Alright.” <br/><br/>Charles Amos looked at Daisy Zane, and seeing that she still wasn’t talking to him, he became even more heartbroken. <br/><br/>So when Wilton put him down next to the dining table, Charles Amos immediately ran to Daisy Zane’s side instead of sitting down. <br/><br/>He stood beside her for a while, and tugged at her clothes: “I already know I was wrong and I won’t do it again. Can’t you just talk to me?” <br/><br/>“Wait until I’m not angry anymore.” <br/><br/>“I already know I was wrong, why are you still angry?” <br/><br/>“Can’t I be?” Daisy Zane asked, righteously. <br/><br/>Hearing her words, Harton and Wilton exchanged a glance and then laughed together. <br/><br/>Charles Amos: “...You can.” <br/><br/>“Go eat.” <br/><br/>“Oh.” Charles Amos whispered obediently, and walked away with his head down. <br/><br/>Daisy Zane looked at his despondent figure, feeling quite pleased with herself as she raised an eyebrow. <br/><br/>Bullying children sure feels great..\t\t\t\t\t\t</div>", "images": {}, "success": true}