{"id": 198, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244285.html", "title": "Chapter 198 - 188: Broke A Lotus Flower", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 198 - 188: Broke A Lotus Flower</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 198: Chapter 188: Broke a Lotus Flower <br/><br/>Translator: 549690339 <br/><br/>The courtyard of Arthur North’s home was not only large, but also more luxurious than any courtyard Daisy Zane had seen on her way here. <br/><br/>Pavilions, terraces, flying eaves and painted walls, jade towers and golden palaces. <br/><br/>The road leading directly to his living room is paved with cut jadeite rough stones. <br/><br/>Daisy Zane looked with the lantern, and the ones she saw were of good quality and good color. <br/><br/>If Felix Baker were to see this road, he would probably come with a shovel to dig out the stones. <br/><br/>All the servants in his courtyard were male and wore long robes, but in different colors, all black. <br/><br/>There were quite a few people, and ever since Daisy Zane entered the courtyard, everyone would take a look at her. Curiosity was in their eyes, but they dared not look too much or act improperly. <br/><br/>That night, Arthur North gave his room to Daisy Zane and went to sleep in the guesthouse. <br/><br/>Fearing she might not sleep well in this strange environment, he lit calming incenses in the room. <br/><br/>As a result, Daisy Zane didn’t wake up until more than 10 0’clock in the morning. <br/><br/>At past eight o’clock, she heard someone come in once. <br/><br/>She opened her eyes and saw that Arthur North had brought her new clothes. <br/><br/>She remembered Arthur North walking to the head of her bed and kissing her, then she went back to sleep. <br/><br/>She even had a dream in her sleep. <br/><br/>She dreamed of a three or four-year-old girl, who accidentally tripped while crossing a small wooden bridge. <br/><br/>It didn’t seem to hurt badly but not very much either. <br/><br/>Because the little girl got up by herself and brushed off the dirt on her skirt. <br/><br/>But then suddenly, an elder brother came over and squatted down in front of her, asking if she was hurt. <br/><br/>The little girl then threw herself into his arms, crying and asking him to hug her. <br/><br/>Daisy Zane wanted to see what this elder brother looked like. <br/><br/>But just before she could see him, she suddenly woke up. <br/><br/>Upon opening her eyes, Daisy Zane stared at the ceiling for a while, thinking that maybe she had stood on that bridge too long last night, which was why she had such a dream. <br/><br/>She got up and washed and rinsed her face. <br/><br/>While changing her clothes, Daisy Zane realized that Arthur North had not only prepared a dress for her but also underwear. <br/><br/>The dress was a regular outfit from Cloud Clothing and Rainbow Skirts, and the underwear was also from the brand she usually wore. <br/><br/>Moreover, the sizes were all appropriate. <br/><br/>There was a young woman about five meters away, walking towards her. <br/><br/>Seeing Daisy looking her way, the young woman stopped in her tracks. <br/><br/>The young woman had an elegant air about her. Her hair was dyed light blue and worn in a bun. She had fair skin and a natural look on her face. <br/><br/>Her eyes had the classic almond shape, and her lips a vibrant red, not like the color of lipstick. She dressed in a practice outfit of white top and black pants, giving her a slender, delicate figure. <br/><br/>Separated by five meters, the two locked eyes for a moment. Then the young woman broke into an excited smile and quickly approached Daisy. <br/><br/>Daisy watched her walk towards her and scrutinized her, saying, “Riley Maxwell, is that really you?” <br/><br/>Daisy looked at her calmly without saying a word, her expression unchanged. <br/><br/>The young woman laughed, “No, Riley Maxwell is a character’s name. Your name is... Daisy Zane, right? I absolutely love your performance in ‘Fall of the <br/><br/>Quince’, big fan!” <br/><br/>Daisy didn’t expect to encounter a fan here. <br/><br/>“My name is Lily Parker,” The young woman didn’t mind Daisy’s silence and aloofness, and continued to introduce herself, “Um... what are you doing here? Oh! Did Allonzo Hobson bring you here?” <br/><br/>A member of the Clark Family... Daisy thought for a moment. This young woman should be Kevin Clark’s niece, Hugo Clark’s younger sister. <br/><br/>“Hello,” Daisy said. <br/><br/>“Hello, hello,” Lily Parker laughed, “How did you come here on your own? Why didn’t Allonzo Hobson accompany you?” <br/><br/>“The view here is nice,” Daisy replied. <br/><br/>“The view is indeed nice, but the owner here is quite fierce,” Lily Parker thought for a moment before describing, “Like a big gray wolf.” <br/><br/>Daisy arched her eyebrows but said nothing. <br/><br/>“Seriously, don’t doubt it,” Lily Parker continued, “He treats these lotus flowers like treasures and will tolerate anyone just looking at them, but if someone were to touch them, he’ll snap.” <br/><br/>“I’ve heard of that.’ <br/><br/>“So even you know,” Lily said while bending over to poke the lotus flower, <br/><br/>“Allonzo Hobson must have told you, but why would he leave you here alone? <br/><br/>He should have been worried that the big gray wolf would eat you.” <br/><br/>Watching her vent her frustration by poking the lotus flower, Daisy smiled and said, “Be careful... it’ll break... <br/><br/>As soon as Daisy said that, Lily, used too much force and broke the lotus stem, while also knocking off a leaf. The two watched the broken lotus fall towards the pond. Lily swiftly grabbed it, preventing it from landing in the water. <br/><br/>Bending over with one hand supporting her on the railing and the other holding the lotus flower, she looked at Daisy in terror. Daisy watched as Lily’s face instantly turned pale. <br/><br/>“Five... five figures...” <br/><br/>Daisy: <br/><br/>“Plus... plus my life...” Lily was on the verge of tears..\t\t\t\t\t\t</div>", "images": {}, "success": true}