{"id": 205, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244313.html", "title": "Chapter 205 - 195: Saving People In The Late Night", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 205 - 195: Saving People In The Late Night</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 205: Chapter 195: Saving People in the Late Night <br/><br/>Translator: 549690339 Visit no(v)eLb(i)n.com for the best novel reading experience<br/><br/>“Eh? Arthur, you’re letting her take an umbrella, why don’t you let her take another one for me? I’m hot too.” Allonzo Hobson shouted. <br/><br/>“Endure it.” Kevin Clark threw two words at him. <br/><br/>Allonzo Hobson pouted, enduring it. Hmph, no need to be so fierce, having a girlfriend is so amazing, huh? <br/><br/>He will find one tomorrow, and then get married. <br/><br/>He will be the first one to get married! Let them all be envious! <br/><br/>Single dogs hand in hand, whoever gets married first, happiness forever! <br/><br/>Allonzo Hobson muttered silently in his heart for more than ten meters before speaking again, “By the way, Brook Sister. Did you see a green talking bird last night when you slept here?” <br/><br/>“A green bird?” Daisy Zane turned to look at him, “No.” <br/><br/>Kevin Clark: <br/><br/>Allonzo Hobson glanced at Kevin Clark, then fearlessly grinned and said, “It’s a parrot called Little Ten. It calls everyone ‘Daddy.”‘ <br/><br/>Daisy Zane raised her eyebrows, “Really?” <br/><br/>“Yeah.” Allonzo Hobson said, “That bird relies on people’s power to be fierce and even curses at people. It was all taught by Arthur.” <br/><br/>Daisy Zane looked at Kevin Clark. <br/><br/>Kevin Clark straightened up and clarified, “Don’t listen to his nonsense. Am I that kind of person?” <br/><br/>Daisy Zane nodded, “Since I haven’t seen it last night, I think you are.” <br/><br/>Allonzo Hobson laughed out loud. <br/><br/>Kevin Clark glanced at Allonzo Hobson. <br/><br/>Allonzo Hobson was laughing so proudly. The moment he looked up and met Kevin’s eyes, the smile on his face disappeared instantly. In that moment, he had even thought about where to bury himself. <br/><br/>He even drafted his own epitaph. <br/><br/>“It’s a bit noisy.” Kevin Clark said, “So I kept it in the courtyard last night. If you...want to see it, I’ll have someone bring it over.” <br/><br/>Hearing his hesitation, Daisy Zane knew that the parrot must really curse people. <br/><br/>Kevin Clark paused, then gently said, “Use some of that medicine that can poison people into being mute on Allonzo Hobson, the one you mentioned last time.” <br/><br/>Daisy Zane smiled, “Alright.” <br/><br/>Allonzo Hobson’s eyes widened, and he stopped walking, not following them <br/><br/>anymore. <br/><br/>Standing still, roaring in his heart. <br/><br/>These seven or eight people were meant to psychologically torment the man on the opposite side. <br/><br/>All the people on both sides woke up upon hearing the commotion and looked at her. <br/><br/>Daisy Zane glanced at the smart password lock on the glass door and raised her eyebrow slightly. <br/><br/>She squatted down, took out her cell phone. The thin phone unfolded in the middle and she gently pulled out a projection camera, which projected a laser keyboard on the floor. <br/><br/>Daisy Zane quickly operated with her nimble fingers, and in less than half a minute, she unlocked the smart lock. Then, she looked up at the CCTV camera above her and blacked it out. <br/><br/>The cell phone returned to its original state, and Daisy Zane stood up and pushed the door open. <br/><br/>Upon seeing Daisy Zane, the man became instantly alert. <br/><br/>His hands were locked with iron chains, and a dagger was still embedded in his forearm. <br/><br/>Daisy Zane approached and looked at the wound. <br/><br/>It seemed like it had been pulled out once, but then was pushed back in. <br/><br/>“Who are you?” The man asked. <br/><br/>Daisy Zane didn’t bother to talk to him, and showed him the tattoo on her right arm by rolling up her sleeve. <br/><br/>It was a black phoenix tattoo, and even the eyes were red. Centered around the eyes, a totem could be seen. <br/><br/>“You are... Lady Alice.” <br/><br/>Daisy Zane shook her head and squatted down to undo the man’s iron chains, “I’m Lady Alice’s stand-in.” <br/><br/>The man looked at her in amazement. <br/><br/>“Don’t ask.” Daisy Zane said coldly. <br/><br/>“Yes, I understand.” The man replied. <br/><br/>As Daisy Zane loosed one iron ring and went to loosen the other, she said, <br/><br/>“Lady Alice heard about your capture. I’ve been hiding in the Clark Manor, and she asked me to save you.” <br/><br/>“Why would Lady Alice... save me?” <br/><br/>“I’m just carrying out orders.” <br/><br/>After unlocking the chains, Daisy Zane helped him stand up: “Can you walk?” <br/><br/>“Yes.” <br/><br/>Daisy Zane helped him out of the confinement room and saw that the people on the opposite side were looking at her expectantly, some quietly pleading for her to save them. <br/><br/>“Them...” Daisy Zane asked. <br/><br/>“Don’t save them, they confessed to everything and they are all traitors.” The man said. <br/><br/>Daisy Zane gave them a cold glance and then, very resolutely, escorted the man out..\t\t\t\t\t\t</div>", "images": {}, "success": true}