{"id": 201, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244297.html", "title": "Chapter 201 - 191: Interrogation", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 201 - 191: Interrogation</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 201: Chapter 191: Interrogation <br/><br/>Translator: 549690339 <br/><br/>“Ever seen one?” Kevin Clark asked. <br/><br/>“I’ve seen the tattoo.” Daisy Zane said, “However, the chances of him revealing anything are slim.” <br/><br/>Kevin Clark lightly raised his eyebrows. Once it was clear who was more valuable and who knew more, it was time for him to step in. <br/><br/>Daisy Zane stood outside the one-way glass, watching that man, she idly twisted her fingertip. <br/><br/>Kevin Clark went to the interrogation room, walked directly in front of the man, leaning on the table in front of him, looking down at him. <br/><br/>“I know, you don’t fear death, you have no attachments.” Kevin Clark cut straight to the chase, “Even during your training, you underwent all sorts of drug resistance exercises. So we can’t really do anything with you.” <br/><br/>“If you know that, then don’t waste your breath.” <br/><br/>“But there is something your body can’t resist.” A hint of contempt laced Kevin Clark’s eyes, “Honestly, I’ve trained a batch of assassins before, any one of them would whip you.” <br/><br/>The man looked at him, without making a sound. <br/><br/>“So I’m quite familiar with your kind of training methods.” Kevin Clark said, <br/><br/>“How do you think I trained that group of people to be stronger than you?” “What are you trying to say?” <br/><br/>“You got to your current position through some form of training.” Kevin Clark said, “Because you’ve been through it, you might now look back and feel that the training back then was nothing.” <br/><br/>“But ...” Kevin Clark chuckled lightly, but the laughter didn’t reach his eyes. The chilling look in his eyes was bone-chilling, “If it’s ten times more brutal than those trainings, do you think you can still withstand it?” <br/><br/>Not knowing if he was reminded of his past trainings or frightened by Kevin’s cold gaze, the seated man suddenly swallowed his saliva. <br/><br/>“Honestly, I don’t understand what you’re insisting on.” Kevin Clark continued in a slow voice, “You’re not even afraid of death. Are you afraid of saying some things? What can happen if you talk? Talking would only make you feel better now. Even if people curse you, hate you. But you are here now, what does that have to do with you?” <br/><br/>Kevin Clark’s voice was very soft, as if a bone-scraper was lightly scraping on bone. <br/><br/>Even facing his back, Hugo Clark couldn’t help but frown a little. <br/><br/>And Allonzo Hobson’s hairs stood on end. <br/><br/>Not just because of his terrifying aura, but also the way he used to train people, his means. <br/><br/>It was simply purgatory, unbearable for a man. <br/><br/>“What are you afraid of? You don’t have anyone to worry about out there.” Kevin Clark lightly waggled his wrist, “Even if you do have someone to worry about. You’ve been caught, could the one you care about really end well?” <br/><br/>On Kevin Clark’s left wrist today, there was a mechanical watch worn together with an eaglewood bracelet. <br/><br/>The man couldn’t help but glanced at his watch as he moved, and sneered, “Those of you young masters, all you have are fair-weather friends, naturally you can’t understand people like us, loyalty, fidelity!” “Loyalty, fidelity?” Kevin Clark laughed as he spoke. <br/><br/>The sitting man, his eyes drifting over the watch, began to glaze over. In addition to Kevin Clark’s voice, the ticking sound of the second’s hand grew louder in his ears. <br/><br/>“Think about it, does your master truly deserve your loyalty?” Kevin Clark continued looking at him, his tapping on the desk gradually lessening, his fingers slowly pulling back, “Your striven faith is in worldly pleasures. Your master only promises you money to enjoy them. In working for him, he pays you. It’s essentially a straightforward transaction.” <br/><br/>The man’s eyes started to defocus. <br/><br/>“Why should you die for him? What does he have that’s worth your life?” Kevin Clark’s expression, his speed of speech, remained the same, “He isn’t worth it. <br/><br/>But if you share what we want to know, I can assure you a more comfortable life than you have now.” <br/><br/>“Really?” <br/><br/>Kevin Clark’s eyebrows twitched slightly: “How do you feel now? Dizzy, nauseous, short of breath? Numb all over?” <br/><br/>The sitting man screwed up his eyebrows. Every symptom Clark mentioned added to his discomfort: “...Yes.’ <br/><br/>Hugo Clark and Allonzo Hobson exchanged glances, both inwardly drawing a breath. <br/><br/>From behind the glass, Daisy Zane frowned. <br/><br/>Hypnosis... <br/><br/>Psychological defenses, rhythmic tapping, mechanical watch... <br/><br/>For the first time, Daisy Zane felt that Kevin Clark was more terrifying than she had imagined. <br/><br/>“I can make you feel better, would you like that?” Kevin Clarks voice took on a strangely eerie tone. <br/><br/>“Yes.” <br/><br/>“Then answer a few questions for me.” <br/><br/>“Fine. ” <br/><br/>“Where does the 319 come from?” <br/><br/>“Got , got it from the laboratory.” <br/><br/>Kevin Clark narrowed his eyes slightly: “Which laboratory?” <br/><br/>The man sitting there was growing paler by the minute. He seemed genuinely unwell, his breath uneven, and stutteringly gave three locations. <br/><br/>“Any others?” <br/><br/>“there are others.” the man said, “But, but I don’t know.” <br/><br/>“Don’t know?” <br/><br/>“Hmm.” the man struggled to say, “My main task, was, was to assist Henry Clark. Help, help Henry Clark, do, do business in the Imperial Capital. While also, attending to, some, 319 matters. I, I only know of these three, three locations..”\t\t\t\t\t\t</div>", "images": {}, "success": true}