{"id": 203, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244305.html", "title": "Chapter 203 - 193: I Lived With Him For Four Years", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 203 - 193: I Lived With Him For Four Years</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 203: Chapter 193: I Lived with Him for Four Years <br/><br/>Translator: 549690339 <br/><br/>The four of them came out of the 18th Prison and sat down in a nearby gazebo. <br/><br/>A servant brought them a pot of cold tea and poured it for each of them. <br/><br/>The sunshade and gentle breeze made them feel cool when they calmed down. But some people just couldn’t sit still, like Allonzo Hobson. <br/><br/>So in less than a minute, while the other three enjoyed the breeze and the gift of nature, Allonzo asked someone to fetch two ice creams. <br/><br/>Clark Manor is so big, with thousands of servants. The salary and welfare here are good. <br/><br/>So in summer, there are refrigerators with ice cream available at intervals in <br/><br/>Clark Manor. <br/><br/>Only they are hidden so well that they don’t affect the overall classical atmosphere of the house. <br/><br/>Allonzo fetched two of them and specifically got a strawberry flavored one for <br/><br/>Daisy Zane. He placed it in front of Daisy and said, “Brook Sister, here.” <br/><br/>Putting the spoon in his mouth, he sat down and removed the lid, saying, <br/><br/>“Aren’t you guys hot in this weather?” <br/><br/>Daisy’s cool eyes were instantly drawn to the ice cream. <br/><br/>Kevin Clark looked at Daisy. <br/><br/>Hugo also noticed that something was suddenly off and glanced at Daisy as well. <br/><br/>“Sister Lucia, eat it, it’s free,” said Allonzo. <br/><br/>Daisy stared at the ice cream for two seconds, then pretending not to see Kevin’s gaze, reached out to open the ice cream box. <br/><br/>As she reached for a spoon, she caught sight of Kevin’s hand reaching out in the corner of her eye. <br/><br/>Daisy quickly pressed down on Kevin’s hand, then looked up at him. <br/><br/>Allonzo bit down on his spoon, looking at the two of them, unable to swallow the ice cream he had just put in his mouth. Hugo was also startled by the sudden coldness in Daisy’s demeanor and looked at the couple. <br/><br/>Kevin exchanged a look with her and laughed, “What? If I don’t let you eat, are you going to kill your husband?” <br/><br/>Daisy’s expression remained unchanged, and she just stared at him without speaking. <br/><br/>“That’s why... you can’t be born a bad guy.” Hugo Clark said, “You don’t need to be caught by others, you’ll expose yourself.” <br/><br/>“To hell with that! I definitely won’t!” Allonzo Hobson replied, his legs crossed, “I pursue freedom, leisure, and a simple life. You don’t understand.” <br/><br/>Hugo Clark ignored him. <br/><br/>“The enemy is hidden in the dark, taking advantage of their concealed position. Naturally, it will take some effort.” Arthur North said, “Even the most sophisticated criminals will show flaws.” <br/><br/>Allonzo Hobson nodded, eating his ice cream, quiet for a while, and then asked, “You said that this person has undergone special training for addresses. <br/><br/>What about names? Could Edward Kirsten be a fake name?” <br/><br/>Hugo Clark didn’t say anything, but he acknowledged the possibility. <br/><br/>“There hasn’t been any training,” Arthur North said, “but the name he knows could be fake.’ <br/><br/>Allonzo Hobson started nodding again, but after only two nods, he suddenly stopped. <br/><br/>Because he heard Daisy Zane slowly speaking, her voice casual, “It’s not fake, his name is Edward Kirsten. Edward as in scenery, Kirsten as in inkstone, and white as in the color white. But... I don’t know if he had any other names before.’ <br/><br/>All three men looked at her again. <br/><br/>Arthur North remembered the note he found in Red Cliff Village. <br/><br/>See you later. The signature was a single character: “Kirsten.” <br/><br/>Daisy Zane sat upright, her back straight, her legs together, and even her skirt hem was tidied up when she sat down. But her posture looked relaxed and casual. <br/><br/>Proper and comfortable. <br/><br/>“Brook... Brook Sister, how did you know?” <br/><br/>Daisy Zane gently scraped her ice cream with a spoon, paused, and said softly, “I lived with him for four years.” <br/><br/>Arthur North’s hand under the round table slowly clenched. <br/><br/>The usually calm Hugo Clark’s pupils trembled slightly. <br/><br/>But the biggest reaction came from Allonzo Hobson, who had dropped the wooden spoon from his hand onto the ground, making a slight collision sound with the stone brick. <br/><br/>What explosive news this was. <br/><br/>Allonzo Hobson even felt a momentary ringing in his ears, as if something had dully knocked on his head. <br/><br/>“I lived with him in Continent A for four years.” Daisy Zane ignored their reactions and continued, “But I don’t know where his laboratory is; I only found out 319 was his creation when I met an acquaintance at Red Cliff Village last year. The only thing I know is what he was researching, but he never let me get involved.” <br/><br/>Allonzo Hobson listened to her calm voice, which sounded like she was narrating a script, and swallowed hard....\t\t\t\t\t\t</div>", "images": {}, "success": true}