{"id": 207, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244321.html", "title": "Chapter 207 - 197: Rescue Failure?", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 207 - 197: Rescue Failure?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 207: Chapter 197: Rescue Failure? <br/><br/>Translator: 549690339 <br/><br/>The two hid behind a trash can, listening to the movements. The people behind them kept trying to rush over, but they were repelled by the sniper on the mountain. <br/><br/>The stalemate continued, with gunshots constantly ringing in their ears. <br/><br/>There were also occasional shouts from Allonzo Hobson. <br/><br/>Daisy Zane looked at the man in front of her and said, “Boss Kirsten is no longer on the island in M Continent; he has already moved somewhere else.” <br/><br/>The man was gasping for breath, and he didn’t show any special reaction to <br/><br/>Daisy Zane’s words, “If he’s not there, then it’s about the report in my hand.” <br/><br/>Seeing his reaction, Daisy Zane believed the address was probably accurate. <br/><br/>She asked again, “Where is the report?” <br/><br/>“F... F Continent, F Continent... Tim, Tim...” <br/><br/>The man couldn’t finish his words and closed his eyes. <br/><br/>Daisy Zane frowned and raised her hand to touch his carotid artery. <br/><br/>Then she squatted down and stared at him for a while before taking her cellphone out and sending a message in a four-person group chat. <br/><br/>[It’s done.] <br/><br/>Two seconds later, the gunfire nearby ceased. <br/><br/>Allonzo Hobson was the first to rush over, “Brook Sister, are you okay?” <br/><br/>Daisy Zane stood up, removed her mask, wiped the blood from the corner of her eyes with the mask, and shook her head. <br/><br/>Hugo Clark bent down to check the man’s carotid artery, then stood up and said, “It’s my fault; my shot was off.” <br/><br/>“He lost his balance in that instant and swayed his body.” Daisy Zane scanned the crowd, “Where is Harton Clark?” <br/><br/>“He’s setting up the gun for you on the mountain,” Allonzo Hobson said helplessly, “He insisted on being on your team and then went up the mountain.” <br/><br/>Daisy Zane looked up at the mountain. <br/><br/>Harton Clark was already standing on the mountain. With one knee bent on a rock and his hands holding the sniper rifle, he saw Daisy Zane’s speechless expression through the scope. <br/><br/>Closing one eye, his thin lips curled slightly. Then he put away the rifle and walked down the mountain. <br/><br/>“Let’s find a place to rest while we wait for Third Uncle,” suggested Hugo Clark. <br/><br/>In order to make it more realistic, the people in the 18th Prison didn’t greet each other, yet Daisy managed to bring the person out in such a short time without triggering any alarms inside. <br/><br/>Kevin Clark could not get over how formidable this woman was for a long time. <br/><br/>At first he didn’t believe his dad’s words that he couldn’t beat her. He thought his dad was exaggerating to maintain a gentlemanly demeanor outside and didn’t want to use his real strength on a girl. <br/><br/>After all, Kevin Clark had seen pictures of Daisy Zane on the Internet, with her slender arms, slim legs, and slim waist. There was no way his dad could not beat her. <br/><br/>Now it seems... his dad was being conservative with his words. <br/><br/>“Brook Sister...” Alonzo Hobson clasped his hands together, “I surrender completely, from now on I will follow you.” Daisy Zane gently hooked her thin lips and said, “Mmm, I will cover you.” <br/><br/>“With Brook Sister’s words, I feel relieved.’ <br/><br/>“Cover me too.” Arthur North’s voice came from the staircase. <br/><br/>All three looked over, and after a few sounds of leather shoes stepping on wooden planks, Arthur North’s face appeared in their sights. <br/><br/>With beautifully painted eyebrows and eyes, bright red lips, bewitchingly and enchanting. Perhaps because he came over in a hurry, he was slightly panting, his forehead beading with sweat, his hair ends a little damp. <br/><br/>Arthur North seemed not to see the other two people, his eyes fell directly on Daisy Zane’s body, walked up to her, gently smiled and said, “I want to enjoy the pleasure of living off a woman.” <br/><br/>Alonzo Hobson: <br/><br/>Kevin Clark picked up a teacup and took a sip, looking away, not wanting to see the people in front of him. <br/><br/>Daisy Zane looked at him for two seconds, then moved her gaze away, picked up her teacup and took a sip of tea, saying, “Stop acting like a demon, sit down and let’s talk about serious matters.” <br/><br/>...Ok.” <br/><br/>Arthur North chuckled, sat next to her, and then poured himself a cup of tea. <br/><br/>Kevin Clark took another sip of tea, his eyes still fixed outside. He thought to himself, besides his grandmother, this person in front of him was the only one who dared to speak to his Third Uncle like that and not be retaliated against. <br/><br/>Daisy Zane took out several sheets of paper from a small drawer under the tea table and handed them to Arthur North. <br/><br/>Arthur North took them, wiped the sweat off his forehead, and asked, “Did they mention the address?” <br/><br/>“M Continent, Koymoon Island.” Daisy Zane said calmly, “I tried probing, they didn’t seem to be lying.” <br/><br/>It was simpler than Daisy Zane had imagined. She had prepared a pile of rhetoric to use afterwards, but it turned out to be unnecessary. <br/><br/>“Koymoon Island?” Arthur North thought for a moment, “A private island?” <br/><br/>“It should be.” Daisy Zane paused, then continued, “Besides, they said they had a important report in their hands. They only mentioned it was in F Continent, but... they didn’t give a specific location.” <br/><br/>“Huh?” <br/><br/>“They hung up.” <br/><br/>Arthur North:\t\t\t\t\t\t</div>", "images": {}, "success": true}