{"id": 209, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244329.html", "title": "Chapter 209 - 199: I Don’T Quite Understand You…", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 209 - 199: I Don’T Quite Understand You…</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 209: Chapter 199: I Don’t Quite Understand You... <br/><br/>Translator: 549690339 <br/><br/>Bonnie Maxwell’s “Third Brother!” called out with not only affection but also a hint of ambiguity that anyone with ears could detect. <br/><br/>At first, Kevin Clark hadn’t thought much about seeing her. <br/><br/>However, after she called him “Third Brother”, especially when Daisy Zane glanced at her, Kevin imagined himself picking a color for a washing board. New novel chapters are published on<br/><br/>A curious smile appeared in Daisy Zane’s eyes. <br/><br/>Kevin licked his lips, swallowed and said, “I...” <br/><br/>“Third Brother.” Bonnie approached the two and called out to him again, “You have guests.” <br/><br/>Daisy withdrew her gaze from Kevin and looked at Bonnie. <br/><br/>Upon seeing Daisy, Bonnie was startled, then asked, “Have we...have we met somewhere before?” <br/><br/>Daisy examined her eyes as if she could see right into her heart. She then replied with a detached, faint smile, “Perhaps.” <br/><br/>With a smile, Bonnie insisted, “We must have. Otherwise, why would you look so familiar?” <br/><br/>Daisy smiled politely but didn’t respond. <br/><br/>Deciding not to talk to Daisy, Bonnie turned to Kevin and said, “Third Brother, my father brought back some bird’s nest from his business trip, and I brought some for Aunt Wayne.” <br/><br/>“Okay,” Kevin gently agreed. “My parents are not here, so just make yourself at home.” <br/><br/>“Alright.” Bonnie responded, “You go entertain your guest. I’m as familiar with this place as my own home, so there’s no need to worry about me.” <br/><br/>Upon hearing her words, Daisy raised her eyebrows slightly. <br/><br/>Kevin’s eyes darkened a little, then he turned to Daisy, caressed the top of her head, and said softly, “Little Girl, wait for me outside for a while.” <br/><br/>Daisy looked at him, hesitated for a moment, nodded, glanced at Bonnie, and walked outside. <br/><br/>Bonnie also turned to look at Daisy. As she faced away from Kevin, her gaze turned sullen, her feelings unconcealed. <br/><br/>However, unexpectedly, Daisy stopped in her tracks, turned around, and looked back. <br/><br/>Their gazes locked across the distance of five or six meters. <br/><br/>Bonnie couldn’t avoid it, and her sullen expression was exposed. She didn’t even have time to hide it. <br/><br/>Daisy raised her eyebrows contemptuously, turned around and resumed walking. <br/><br/>With a steady pace, neither hurried nor slow, back straight, and an outstanding demeanor. <br/><br/>The car started, and Kevin Clark asked, “Is it about the endorsement?” <br/><br/>Daisy Zane casually replied, “We’ll discuss it first.” <br/><br/>Kevin Clark didn’t think too much about it and then quietly said after a while, “I’d like to request an explanation.” <br/><br/>Daisy Zane had just turned on the light on her cell phone and wanted to shine it on the ruby. When she heard him speak, she looked up at him first and then thought about it, “Go ahead.” <br/><br/>“Her name is Bonnie Maxwell.” <br/><br/>“Oh, she’s a young lady from the Maxwell Family,” Daisy Zane said. <br/><br/>“Yeah. When she was little, she got sick, and my mom gave her an injection, which saved her life,” Kevin Clark explained. “Afterward, she followed my mom to learn traditional medicine, and my mom became her half-teacher. So she often visits my mother at home. My older brother and her father are both in the military district, so the two families have a good relationship.” <br/><br/>“Mm,” Daisy Zane responded indifferently. <br/><br/>Seeing her bland response, Kevin Clark felt that he hadn’t received the proper care. He couldn’t feel Daisy Zane’s love for him. <br/><br/>He felt even worse: “Little girl, aren’t you jealous?” <br/><br/>“Why would I be jealous?” Daisy Zane countered. <br/><br/>Kevin Clark was taken aback by her question, his handsome face momentarily distorted. His lips even trembled a couple of times: “There’s a woman, she, she, she’s interested in me. You, you don’t have any reaction?” <br/><br/>Daisy Zane looked at him, scrutinizing him. After a while, she said, “But... <br/><br/>didn’t you just stay behind to explain things? I... what reaction should I have?” <br/><br/>Michael Jackson was driving in front, trying hard to keep the corners of his mouth at a horizontal position, not letting them rise. <br/><br/>Kevin Clark was silent, seemingly stumped by her question. <br/><br/>Daisy Zane noticed that he wasn’t speaking and continued, “You just asked for an explanation. Wasn’t it because you were afraid I’d be jealous?” <br/><br/>Seeing his Third Master at a loss for words, Michael Jackson couldn’t help but momentarily grin, only to immediately straighten his mouth again when it was caught. <br/><br/>“I’m not so gullible as to fall for her little tricks.” <br/><br/>Kevin Clark: <br/><br/>“And besides, don’t I trust that you’re not a troublemaker?” <br/><br/>Kevin Clark: <br/><br/>Seeing him unable to speak, Daisy Zane continued to provoke him with one comment after another, not intending to let him off the hook: “When I’m jealous, you worry; when I’m not jealous, you’re anxious. I...” <br/><br/>At this point, seeing his expression, Daisy Zane couldn’t help but laugh out loud, her voice changing pitch: “I don’t quite understand you...” <br/><br/>Kevin Clark: She was actually making fun of himself. And laughing so happily..\t\t\t\t\t\t</div>", "images": {}, "success": true}