{"id": 202, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244301.html", "title": "Chapter 202 - 192: Hypnosis Fails", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 202 - 192: Hypnosis Fails</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 202: Chapter 192: Hypnosis Fails <br/><br/>Translator: 549690339 <br/><br/>The sound in the interrogation room could be heard outside the glass. <br/><br/>After the interrogatee provided three locations, no one in the interrogation room made any move, afraid that any noise might wake him up. <br/><br/>But Hugo Clark immediately looked towards the glass outside. <br/><br/>Several people stood outside the glass, who, upon receiving Hugo Clark’s gaze, nodded and immediately left. <br/><br/>Harton Clark’s questioning continued, “How many people in the domestic front are helping Henry Clark?” <br/><br/>“I, I don’t know. We all act independently and don’t contact each other. The team I led has all been captured by you.” <br/><br/>“Were you involved in the production of 319?” <br/><br/>“No. We, we are only responsible for carrying out various tasks assigned to us. <br/><br/>There are dedicated researchers for 319.” <br/><br/>Harton Clark asked, “Where is the research site?” <br/><br/>“I don’t know. The stuff we got was at entertainment venues in various continents. Someone would give it to us there, and then we would send it out.” “Who is your superior?” <br/><br/>“I don’t know. We use codes every time we meet. There are men and women, whoever we encounter. But since I got caught, their code is voided and won’t be used anymore.” <br/><br/>Harton Clark’s expression darkened a bit, after dealing for several years. They couldn’t catch anyone because the person was too cautious, leaving no small detail for people to notice. <br/><br/>“To whom have you always been loyal?” Harton Clark asked again. <br/><br/>“I don’t know who he is...” <br/><br/>That was a question with several unknowns. <br/><br/>Harton Clark changed his inquiry, “Then describe him.” <br/><br/>“He... he... he wears a black mask, his eyes... are light blue, and his face is not clear. He’s about 6’1′′ tall and wears a suit... on his right hand, the right index finger has a ring.” <br/><br/>“A ring? What does it look like?” Harton Clark asked. <br/><br/>“It’s silver with a totem. And there’s... there’s also...” The man being interrogated’s face became worse and worse, “two letters Y... H...” <br/><br/>Daisy Zane listened to his words, her hands clenched tighter, and her expression grew colder and more indifferent. <br/><br/>Harton Clark paused for a few seconds, roughly piecing together the appearance he described. <br/><br/>“Is he a foreigner?” “His hair is black, and he speaks Mandarin.” <br/><br/>He is of mixed race. <br/><br/>The man sneered, “You can try it and see if I would say another word.” <br/><br/>Harton Clark lightly raised his eyebrows, then turned his wrist and inserted the dagger into his forearm. <br/><br/>The dagger pierced his forearm, and blood dripped onto his clothes and seat. The man’s facial expression twisted instantly, but he gritted his teeth and didn’t utter a sound. <br/><br/>Harton Clark didn’t even bother saying an extra word to him. He directly looked at the people behind him and had them take him away. <br/><br/>He expressed his utmost contempt for the trash. <br/><br/>The man seemed a little surprised, wondering why Harton Clark would start without asking him anything again, making his aggressive courage seem a bit ridiculous. <br/><br/>After he was taken out, Harton Clark said, “Let people ask all of them one by one. Reveal some information that the man said to them, and say that he confessed everything. Then tell them it’s to verify the authenticity of the information. If anyone says something that is false and different from what the others say, kill them.” <br/><br/>“Understood!” The Ye Family member standing by responded and went to order people. <br/><br/>“Lock up that man just now separately, lock him inside the glass door upstairs. Don’t treat his injury.” Harton Clark said, “Additionally, find a few people he is familiar with and lock them in front of him. Treat these people a bit better. Let him see how we treat those who actively cooperate.” <br/><br/>“Understood.” <br/><br/>After saying that, Harton Clark left the interrogation room. <br/><br/>Of course, Hugo Clark and Allonzo Hobson followed him out. The two of them came out and saw Daisy Zane outside. <br/><br/>“Brook Sister, are you here too?’ <br/><br/>“Mm.” <br/><br/>Hugo Clark nodded at her again, greeting her. <br/><br/>Daisy Zane looked at Harton Clark and said softly, “The hypnosis technique is not bad.” <br/><br/>Harton Clark smiled softly with his eyes and said, “Thanks for the compliment.” <br/><br/>Hugo Clark looked at his Third Uncle and how he suddenly changed his face: <br/><br/>Allonzo Hobson, however, was already used to it and didn’t find it odd anymore. <br/><br/>Harton Clark didn’t bother with them, holding Daisy Zane’s hand as they walked out, saying as they went, “Are you afraid? I might hypnotize you at any time and ask you what I want to know.” <br/><br/>Daisy Zane raised her eyebrows and provocatively said, “You can try it.” <br/><br/>Harton Clark’s hypnosis, the first step, was to break through a person’s psychological defenses, making them weak-willed and mentally scattered. <br/><br/>However, Daisy Zane had undergone extraordinary training, breaking her psychological defenses... hard to say the least. <br/><br/>This first step would be Harton Clark’s biggest obstacle. <br/><br/>“I don’t dare try.” Harton Clark smiled, “I’m afraid of getting beaten.” How could Harton Clark bear to attack her psychological defenses? <br/><br/>Hugo Clark: ‘\t\t\t\t\t\t</div>", "images": {}, "success": true}