{"id": 206, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244317.html", "title": "Chapter 206 - 196: Continue Saving People…", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 206 - 196: Continue Saving People…</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 206: Chapter 196: Continue Saving People... <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane, with one hand gripped around the man’s arm, she supported him as she pulled him to walk outside. <br/><br/>The man glanced at those people lying on the ground, pulled the dagger out from his forearm, and clutched it in his hand. <br/><br/>Daisy Zane caught sight of the dagger and then hit the elevator button. <br/><br/>The pair smoothly got out from the 18th Prison, Daisy Zane leading him northward. <br/><br/>The man glanced at the ones dropped at the entrance, then at the mountain in the north, “Are we heading up the mountain?” <br/><br/>“Uh-huh,” replied Daisy Zane. “We can escape from up the mountain; there will be people outside to pick us up.” <br/><br/>“You’re very familiar with this place.” <br/><br/>“I’ve been undercover here for two years. I am well-acquainted with the Clark Manor.” Daisy Zane, guiding him to crouch behind a rockery, managed to avoid a night patrol. “Usually undercover here, only acting upon orders when necessary.” <br/><br/>The man looked outside, then followed her, “I’m surprised you could go undercover in Clark Manor. I heard those who can enter here undergo rigorous selection and background checks.” <br/><br/>“For Lady Alice, creating a virtuous identity is very easy.” <br/><br/>The man’s suspicions were somewhat alleviated. Indeed, for them, this was very simple. His own identity, after all, was also fabricated by Alice. <br/><br/>That’s how he managed to arrive in the mainland successfully. <br/><br/>Even, no one had discovered anything related to his original identity. <br/><br/>“Hurry, Clark’s people will discover you’ve escaped soon.” Daisy Zane urged him while they were walking. <br/><br/>“Okay.” <br/><br/>Just after the man had responded, the alarm at the Clark Manor sounded. <br/><br/>Hearing the alarm, Daisy Zane furrowed her brows and quickened her pace. The man clutched his bleeding arm, trying his best to keep up with her. But after they had covered almost one hundred meters, the steps up the mountain were already faintly visible in the distance. <br/><br/>Just then, a squad suddenly appeared from up front. There were at least dozens of them blocking their way. <br/><br/>And those who led the squad were there – Hugo Clark and Allonzo Hobson. <br/><br/>The man ground to a halt, glaring at them with ruthless eyes. <br/><br/>Daisy Zane too, stood still, looking at the two men. <br/><br/>“Where are you guys going so late at night?” Allonzo Hobson started, dragging out his words. <br/><br/>Daisy Zane: . This sounds like the opening line of a TV series. <br/><br/>Daisy Zane didn’t say a word, and neither did the man. <br/><br/>Daisy Zane had one hand supporting the man and the other hand was spent battling the enemies. <br/><br/>The man recognized early, she was very strong. Not only was she fast and fierce, but her stamina was incredible. <br/><br/>She would be capable of several more rounds against opponents of this scale. If she didn’t have to carry him, she would definitely be able to escape. <br/><br/>“Please leave, do not carry my burden,” the man hesitated and said. <br/><br/>“My mission is to get you out,” replied Daisy Zane. She quickly cleared a path through the crowd and immediately led him towards the stairs up the mountain. <br/><br/>The men behind them were about to catch up. <br/><br/>But then, several shots were fired from up the mountain. <br/><br/>The marksmanship was accurate, landing exactly behind Daisy Zane and in front of the group. <br/><br/>Seeing the bullets hit the ground and spark, the group immediately took cover. <br/><br/>Daisy Zane also quickened her pace with the man, saying, “They are our backup.” <br/><br/>“Good.” <br/><br/>The man lit up with some hope, but this hope was short-lived. A bullet hit his back, spraying blood that stained Daisy Zane’s clothes and face. <br/><br/>Daisy Zane blinked gently, while the man’s eyes widened as he fell to his knees on the ground. <br/><br/>Daisy Zane was forced to hunch over, she quickly pulled him behind a trash can. <br/><br/>Allonzo Hobson and his men tried to move forward but shots from the mountain forced them to retreat and a stalemate occurred. <br/><br/>“Can you still walk?” Daisy Zane asked calmly, like a ruthless robot. <br/><br/>It was because of this, the man firmly believed that Daisy Zane was with Alice <br/><br/>Eugene. <br/><br/>“I can’t,” the man replied weakly, “You can’t escape with me.” <br/><br/>“I must get you out,” Daisy Zane was like a killer who only saw the mission and disregarded their own life. <br/><br/>“Listen to me, Alice Eugene wanted you to get me out because she was afraid that if I stayed inside for too long, I might reveal Boss Kirsten’s address.” Daisy Zane looked at him. <br/><br/>“And...there’s a report that was just delivered to me. I haven’t gotten it yet,” the man continued, “I was supposed to finish Henry Clark’s task. Then, get the report and deliver it to my contact.” <br/><br/>Daisy Zane’s expression remained unchanged. She paused and then said, “I heard they hypnotized you.” <br/><br/>“Yes,” the man’s breath became lighter and shorter. <br/><br/>Daisy Zane’s eyes were filled with anger and resentment. <br/><br/>The man breathed slowly, “Don’t worry, I didn’t tell them Big Boss Kirsten’s address. He’s in M Continent, Koymoon Island..”\t\t\t\t\t\t</div>", "images": {}, "success": true}