{"id": 200, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244293.html", "title": "Chapter 200 - 190: Edward Kirsten ‘S People", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 200 - 190: Edward Kirsten ‘S People</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 200: Chapter 190: Edward Kirsten ‘s People <br/><br/>Translator: 549690339 <br/><br/>From the place where Olivia Lane was captured, the people brought back were obviously professionally trained, <br/><br/>They wouldn’t say anything when questioned, and didn’t even have a slight change in expression. Their psychological quality was very solid. <br/><br/>Hugo Clark fought against several of them, professionally trained fighters. <br/><br/>Moreover, after being captured, they all appeared to prefer dying over revealing any information. <br/><br/>After lunch, Daisy Zane and Arthur North got in a car inside the mansion and headed to the north side. <br/><br/>The cars inside the mansion were generally divided into two types. One was a sedan chair, and the other was a palanquin. <br/><br/>Both the seating areas were made of wood. But the driving force was electric, not carried by people. <br/><br/>Underneath the sedan chair and palanquin was a square intelligent robot with four wheels. <br/><br/>Just insert a coin or scan a barcode in front of it, tell it the destination, and it would start and take you there. <br/><br/>There were also different speeds and modes. <br/><br/>If you were in a hurry, it would go faster and be more stable. <br/><br/>But if you had a leisurely pace, just wanting to take a look around, its speed would be slower, and it could even sway slightly, giving people the real feeling of sitting in a sedan chair or palanquin. <br/><br/>There were also many styles of sedan chairs and palanquins to choose from, luxurious, fresh, simple, elegant... <br/><br/>Arthur North and Daisy Zane got into a sedan chair, and then Arthur North fingerprinted himself on his side. <br/><br/>The robot below immediately lit up, and the machinery said, “Third Master, hello. Owen Clark will serve you throughout the whole journey.” <br/><br/>Daisy Zane glanced at him and said, “Don’t you have to pay? <br/><br/>“I don’t have to. They were all made by me. They all have my fingerprints on record.” Arthur North said, “Only I have this privilege. That’s why it calls me Third Master.” <br/><br/>Daisy Zane raised her eyebrow: “How does it charge normally?” <br/><br/>“Twenty dollars per trip,” Arthur North said, “No matter the distance, it’s twenty. It’s cheap. Anyone can ride as long as they pay.” <br/><br/>“So... where does the money go?” <br/><br/>“Of course, to my account.” Arthur North raised his eyebrows, “It’s a service I provide.” <br/><br/>Daisy Zane chuckled, not letting even his own family’s money go, this man...really had... a black heart. <br/><br/>“Of course, it’s all yours too.” <br/><br/>With that said, Daisy Zane suddenly felt that he was a kind and beautiful person, only charging twenty dollars per trip, too little. <br/><br/>“Please enter the destination for the two passengers,” Owen Clark’s mechanical voice suddenly sounded. <br/><br/>“To the 18th Prison.” <br/><br/>“Alright, Owen Clark will serve you for the whole journey.” “Why is she called Owen Clark?” Daisy Zane asked. <br/><br/>Generally, in this situation, they know that they can’t get out. They are desperate to die and don’t want to be tortured. That’s why they publicly provoke and speak madly. <br/><br/>But the people trained by the Clark Family are of a high caliber. <br/><br/>Comparing mental fortitude, patience, and endurance, these people didn’t think they had the upper hand. <br/><br/>Sometimes mental torture is more crushing than physical pain. <br/><br/>But obviously, it was a time-consuming process. <br/><br/>“By the time they confess to a trading location, that location will probably already be empty,” said Daisy Zane. <br/><br/>“Now being able to destroy one is enough,” Kevin Clark said. “Emptying one location is also a step towards dismantling one hideout.” <br/><br/>“Can’t you find any information about them?” <br/><br/>“No, it’s very clean.” <br/><br/>Another person was interrogated in the room, and when the man sat down, he also had the same arrogant attitude. <br/><br/>He twisted his neck left and right, not answering any questions. <br/><br/>Daisy Zane watched and suddenly saw the edge of a tattoo under his clothes when he moved his neck. <br/><br/>“What’s under his clothes?” <br/><br/>Kevin Clark had seen it just now as well, and glanced at the people behind him. <br/><br/>One of them immediately went into the room, held down the person being questioned, and rudely pulled open his clothes. <br/><br/>When the clothes were stripped, the back was exposed. <br/><br/>A black chaotic fierce beast was tattooed on the left side of this person’s scapula. <br/><br/>The tattoo was entirely black, but the eyes of the chaos beast were red. <br/><br/>Daisy Zane’s pupils suddenly contracted, and her voice became colder: “Is he the only one with it?” <br/><br/>Seeing her reaction, Kevin Clark immediately looked at the other people behind him. <br/><br/>They got the hint and left immediately. <br/><br/>Three minutes later, one person came back and said, “Third Master, indeed only he has it.” <br/><br/>Kevin Clark looked at Daisy Zane. <br/><br/>Daisy Zane looked through the glass at the tattoo and said, “Focus on questioning him, he should know a lot.” <br/><br/>The black chaotic beast, red eyes, with the eyes as the center, and observing it in a unique way, one can discover that there is a rather special totem on the tattoo. It is a totem personally drawn by Edward Kirsten. <br/><br/>Besides having Alice Eugene, who almost always protected him 24 hours a day, Edward Kirsten also had 28 Star Guards and four fierce beasts under his command. <br/><br/>These people all could meet him. <br/><br/>They even knew where Edward Kirsten was. <br/><br/>It seemed that Edward Kirsten must have really cooperated with Henry Clark, and with great sincerity too..\t\t\t\t\t\t</div>", "images": {}, "success": true}