{"id": 204, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244309.html", "title": "Chapter 204 - 194: I Don’T Remember His Appearance", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 204 - 194: I Don’T Remember His Appearance</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 204: Chapter 194: I Don’t Remember His Appearance <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane’s voice was very calm and indifferent, as if recounting these events from a third person’s perspective. <br/><br/>But the more unusual the indifference, the more it showed how much damage those past experiences had inflicted on her. <br/><br/>Kevin Clark watched her, noticing that her expression remained unchanged. After a moment, he held her hand and said, “You don’t have to talk about it if you don’t want to.” <br/><br/>Hugo Clark glanced at Kevin and his surprised expression faded a bit. <br/><br/>If his Third Uncle knew about it, there shouldn’t be any problems. <br/><br/>“It’s fine.” Daisy Zane held Kevin’s hand tighter and continued, “Six years ago, I blew up that place in Continent A. I originally planned to settle things with Edward Kirsten too, but... I failed, and he escaped.” <br/><br/>Allonzo Hobson, sitting across from her, stared at her dumbfoundedly, wondering how she could talk about these events so casually. <br/><br/>“Later, I almost turned Continent A upside down looking for him,” said Daisy Zane. “Not only in Continent A, but many other places too. However, there has been no news.” <br/><br/>“Since he escaped back then, he must have been seriously injured,” said Hugo Clark. “Under such circumstances, he still managed to evade everyone.” <br/><br/>“Yeah. I spent nearly two years studying his power structure. The explosion six years ago almost shattered his power,” said Daisy Zane. “It hasn’t been fully rebuilt yet. Otherwise, he wouldn’t have run away during the incident at Red <br/><br/>Cliff Village. ” <br/><br/>“If his power is reestablished, won’t it be even harder for us to find him?” Allonzo Hobson’s voice trembled slightly as he spoke. <br/><br/>Daisy Zane lowered her eyelashes, stirred her ice cream a couple of times, and said softly, “If his power is restored, he will come to find me.” <br/><br/>Hugo Clark sensed something unusual in her words and raised his eyebrows slightly. <br/><br/>Kevin felt it too, his expression becoming enigmatic as he pressed his tongue against his teeth. <br/><br/>Only Allonzo was left behind in his thoughts, “Why? Why would he come to find you?” <br/><br/>Under the scrutiny of Kevin’s gaze, Daisy Zane slowly uttered two words, <br/><br/>“Revenge.” <br/><br/>“Oh, right, that makes sense,” said Allonzo. <br/><br/>She had said Charles had been with her since they were kids and only later came under Wilton’s care. <br/><br/>It turns out that Wilton had been taking care of them both from the beginning. <br/><br/>That’s why she respected Wilton so much. <br/><br/>Moreover, she must have been injured six years ago, which was why she ended up in Cold Green Village. <br/><br/>Although Cold Green Village was in the mountains, the province it was located in had a coastline to the south. That sea connected to Continent A. So that’s how she met the real Daisy Zane and left traces of her life in Cold Green Village. <br/><br/>Although Allonzo was surprised, his ability to accept and process information was good, allowing him to understand the overall situation. <br/><br/>However, Hugo, with much less information to work with, felt slightly confused. <br/><br/>First of all, he had no idea who Wilton was. <br/><br/>He had never heard of Charles Amos either. <br/><br/>Secondly, he didn’t understand the meaning behind Daisy’s statement that she went to Cold Green Village. <br/><br/>She was originally from Cold Green Village, so why did her words seem to imply she didn’t return there but went there? <br/><br/>The three of them sat in the gazebo for nearly an hour before dispersing. <br/><br/>Hugo went straight back to his courtyard in a car, Kevin and Daisy rode together in a car, and Allonzo followed in a separate vehicle. <br/><br/>This intelligent robot had a chat mode. <br/><br/>Daisy listened to Allonzo in the car behind them, chatting with a robot named Clark 96 all the way. <br/><br/>Allonzo was indeed a famous chatterbox in his circle, managing to chat even a robot into submission. <br/><br/>The three of them stopped by a lotus pond. Kevin planned to take Daisy through the lotus pond and return to his own courtyard. <br/><br/>Anyway, the layout of the Clark Manor was such that all major roads led to various places, albeit at varying distances. <br/><br/>After getting out of the car, Kevin took an oil-paper umbrella from a servant and opened it, shading Daisy’s head. <br/><br/>While they were in the car, Kevin had asked a servant to bring the umbrella. The oil-paper umbrella was made of high-quality tung oil, which provided sun protection, and the surface was painted with green bamboo, giving it an elegant touch. <br/><br/>Daisy glanced at the umbrella above her head, then lifted the hem of her skirt with one hand and stepped onto the corridor. <br/><br/>In her heart, she thought that Kevin had indeed made their life what she had always dreamed of..\t\t\t\t\t\t</div>", "images": {}, "success": true}