{"id": 211, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244337.html", "title": "Chapter 211 - 201: A Family, All Are Family…", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 211 - 201: A Family, All Are Family…</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 211: Chapter 201: A Family, All are Family... <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane hacked Arthur North’s cell phone and located him. <br/><br/>Arthur North’s cell phone had a strong defense system, and it took Daisy Zane almost a minute to crack it open. <br/><br/>And it was done directly, cracking it violently. <br/><br/>Arthur North’s cell phone would immediately raise an alarm alert. <br/><br/>The position was confirmed, without considering the vertical height distance, the cell phone was only 3-9 kilometers away from her. The person was on the island. <br/><br/>Daisy Zane stared at the location on the computer; her fingertips suddenly started trembling. To avoid being discovered, she directly clenched her fingers. James Collins cleared his throat and asked, “Sister, you...know hacking skills <br/><br/>“Big Boss...when did you learn hacking and not tell us?” Liana Butch asked as well. <br/><br/>Daisy Zane heard their voices, blinked her eyelashes, shared Arthur North’s location to her own cell phone, synchronized it to her watch, and closed the computer. <br/><br/>“I am taking ten people down; no one else moves,” Daisy Zane said. <br/><br/>“Yes.” Liana Butch immediately selected eight people, and together with her and James Collins, there were exactly ten people. <br/><br/>The helicopter descended to a forest on the island. <br/><br/>The original plan was for people on the sea surface to attract firepower, and they would sneak down from the forest during the chaos. <br/><br/>It was still the same situation now, just that the people attracting firepower were not their own. New novel chapters are published on<br/><br/>Ten people landed smoothly, and Daisy Zane checked the location on her watch. <br/><br/>Located very close to the north side, Daisy Zane didn’t think much and directly led the team towards Arthur North’s location. <br/><br/>What if... Arthur North encountered Edward Kirsten?...Thinking this way, Daisy <br/><br/>Zane sped up. <br/><br/>The ten people moved rapidly to the south side. Their position effectively surrounded the people on the island with Arthur North’s people. <br/><br/>People far away used guns, and people close by used daggers. <br/><br/>Daisy Zane had a gun in each hand, and every shot hit the target. Not a single bullet was wasted. <br/><br/>Moreover, when using a dagger, sometimes her left hand and sometimes her right hand were used. <br/><br/>Both hands were very skilled. <br/><br/>Half an hour later, they arrived at the back of a villa. <br/><br/>Ten people hid behind a rockery and observed the situation. <br/><br/>“What? Die what?” Liana Butch asked with great momentum. <br/><br/>After glancing at Liana Butch and Daisy Zane, Allonzo Hobson leaned close to Kevin Clark and whispered, “Arthur, that woman next to the foreigner, her... <br/><br/>her eyes... don’t they look like Lucia?” <br/><br/>As soon as Kevin Clark came in, his eyes directly fell on Daisy Zane. After hearing Allonzo Hobson’s words, his thin, blood-red lips hooked slightly, and then he walked directly towards Daisy Zane. <br/><br/>“Hey! What if it’s not her?” Allonzo Hobson muttered quietly, but he couldn’t stop Kevin Clark and could only follow closely behind. <br/><br/>Seeing the people on the other side suddenly walking over, Liana Butch’s party instantly went on alert. <br/><br/>James Collins changed his position and aimed his sniper rifle, as people walked closer, he moved his scope and aimed his gun muzzle directly at the newcomers’ heads, and then... he saw Kevin’s face. <br/><br/>He hesitated for a moment, and then rolled his eyes, wondering why he was everywhere. <br/><br/>Kevin Clark walked directly in front of Daisy Zane and looked at her. <br/><br/>Liana Butch’s first reaction was that this man was coveting their leader’s beauty and wanted to kill him instantly. <br/><br/>“Little girl, who told you to come here.” <br/><br/>Daisy Zane didn’t speak, her right hand gun moved downward, and at the same time she took a step forward, pressing her gun against Kevin Clark’s heart. <br/><br/>Seeing this, Allonzo Hobson directly aimed his gun at Daisy Zane’s head. While <br/><br/>Liana Butch pointed her gun at Allonzo Hobson’s head. <br/><br/>“Is this the person you said to come to me?” Daisy Zane asked coldly while looking into Kevin Clark’s eyes. <br/><br/>“Sister Lucia! It’s really you!” Hearing her voice, Allonzo Hobson immediately withdrew his gun. <br/><br/>Liana Butch looked at them: “Acquainted?” <br/><br/>Allonzo Hobson pushed the gun aimed at his head down: “A family, a family.” Liana Butch glanced at him and then at Daisy Zane. <br/><br/>“I... didn’t feel at ease. I came over personally to take a look, ” Kevin Clark said softly, “Worried about me?” <br/><br/>Daisy Zane didn’t say anything, but her expression looked quite fierce. Moreover, she pulled the trigger. <br/><br/>“Sister Lucia!” <br/><br/>Allonzo Hobson broke out into a cold sweat with fright. <br/><br/>However, the gun only made a slight noise, there were no bullets inside. <br/><br/>Kevin Clark looked down at the gun. <br/><br/>Daisy Zane looked at him in the eye and whispered, “The next time you hide something from me, I will fill the gun with live rounds.” <br/><br/>She knew that the person who arrived was Kevin Clark; she knew that when Kevin Clark might have encountered Edward Kirsten, she was truly afraid..\t\t\t\t\t\t</div>", "images": {}, "success": true}