{"id": 213, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244345.html", "title": "Chapter 213 - 203: Lady Enigma Starry", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 213 - 203: Lady Enigma Starry</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 213: Chapter 203: Lady Enigma Starry <br/><br/>Translator: 549690339 <br/><br/>Kevin Clark lowered his gaze and watched as Daisy Zane closed herself off layer by layer, pushing everyone away. He swallowed lightly, his voice somewhat hoarse, “Okay, be careful.” <br/><br/>After saying that, Kevin Clark stepped aside to let Daisy Zane go first. <br/><br/>Daisy Zane never looked at Kevin Clark again. When he stepped aside, she went straight in. <br/><br/>Kevin Clark followed closely behind her. <br/><br/>Allonzo Hobson, James Collins, and Liana Butch, along with some others who came with them, all entered the passage. The remaining people stayed in the partition room, preparing to attack those on the third floor. <br/><br/>The passage was long, narrow, and cramped. The black walls on both sides <br/><br/>visually and spatially suppressed everyone, making it hard to breathe. <br/><br/>However, after walking a certain distance, the black walls suddenly changed. <br/><br/>On them were paintings of dancing girls. <br/><br/>The girls wore simple, clean clothes, had graceful figures, and danced lightly. Each painting was a different pose, extending forward. <br/><br/>Even though the figures in the paintings had no facial features and only had static poses, one could still feel the happiness and liveliness of the girls when they danced. <br/><br/>Upon seeing the paintings on the wall, Daisy Zane just glanced at them indifferently and didn’t look at them again. <br/><br/>Kevin Clark’s footsteps didn’t stop, but he looked at every painting on both sides. <br/><br/>Behind him, the trio of Hobson, Collins, and Butch slowed down and took a close look at the paintings. <br/><br/>James Collins whispered, “This person in the painting... looks so familiar.” Liana Butch also whispered, “Shut up, don’t talk.” <br/><br/>The group followed the passage to the end, and when there was no more road, Daisy Zane pressed a spot about three inches away from the wall on her right. <br/><br/>Then a 10cm square board popped open. <br/><br/>It has to be said that the hidden doors in this villa were done very well. Without touching it, one would not be able to see any openings in the wall. <br/><br/>Underneath the board was another password lock. <br/><br/>Daisy Zane entered a date, which was Edward Kirsten’s birthday. <br/><br/>Afterwards, the door on the right automatically opened. <br/><br/>Inside was still pitch black, but with the light coming from the passage, they could see it was a set of ascending stairs. It was as narrow as the passage. <br/><br/>Daisy Zane turned on the light, and with the light on, they could see that the height of the stairs was as tall as two floors. <br/><br/>While climbing the stairs, Kevin Clark heard a voice in his earpiece. <br/><br/>All personnel on the third floor were captured; a total of 36 people, 27 lightly injured, 9 seriously injured, all alive. <br/><br/>After this matter was reported, the people guarding the fifth floor gave an update. <br/><br/>Apparently, Edward Kirsten had informed others of this place. It seemed that he had intentionally left them here to wait for Daisy Zane. <br/><br/>Robert Kirsten bowed, and the twenty or so people behind him also bowed their heads neatly. <br/><br/>It wasn’t until Robert Kirsten straightened up that the people behind him followed suit. <br/><br/>Allonzo Hobson and James Collins were both wide-eyed with surprise, looking at Daisy Zane in disbelief. <br/><br/>Was this... the enemy putting on such a grand display and collectively saluting them? <br/><br/>Enigma Starry? <br/><br/>The look in Kevin Clark’s eyes grew even colder, Enigma Starry... the ring on Edward Kirsten’s index finger. Y, H... <br/><br/>“Lady Enigma Starry, the young master knew you were coming, so he specifically asked me to wait here,” Robert Kirsten smiled. <br/><br/>Daisy Zane’s eyelashes fluttered slightly. Edward Kirsten knew and let him escape again: “Where is he?” <br/><br/>“I’m not quite sure of the young master’s whereabouts as he has been quite busy recently.” <br/><br/>“So, what are you doing here?” Daisy Zane asked him, though she had already guessed Edward Kirsten’s general intentions. <br/><br/>“The young master misses the lady very much and has many things he wants to say to her.” <br/><br/>The first thing Allonzo Hobson thought of when he heard this was to look at <br/><br/>Kevin Clark. He felt that Kevin Clark wanted to tear someone apart right now. <br/><br/>“But the last time the young master called the lady, he was almost tracked down,” Robert Kirsten said with a smile. “It’s not the best time for him to meet her now, so he asked me to relay some words.” <br/><br/>“Do you not know that staying here is a dead end?” Daisy Zane pulled out her dagger. <br/><br/>Robert Kirsten looked at the dagger in her hand and laughed: “First of all, I don’t think the lady has the heart to let me die. Secondly... even if it’s a dead end... people, who doesn’t eventually die? But... by staying here, at least I can see Alozon Kirsten before I die, right?” <br/><br/>“Wilton Edwards will not see you. And I won’t let him see you.” <br/><br/>“He betrayed the young master... of course, he has no face to see us old friends,” Robert Kirsten said softly. “But the young master said that since he has been taking care of the lady and protecting her all these years, he won’t hold him accountable.” <br/><br/>James Collins’ expression changed constantly, each time more shocked than the last. Wilton Edwards used to be one of them... <br/><br/>“So, in order to personally convey Edward Kirsten’s waiver to Wilton Edwards, you’re staying here to wait for death.” <br/><br/>“Of course not,” Robert Kirsten smiled, then looked at Kevin Clark, paused, and said, “The young master said that either bring the lady back or kill Kevin Clark. <br/><br/>We must complete one of them.” <br/><br/>Daisy Zane clenched her dagger tightly, her eyes turning even colder. <br/><br/>Kevin Clark, on the other hand, let out a very faint sneer. <br/><br/>Robert Kirsten caught the disdain in Kevin Clark’s eyes but didn’t mind, simply smiling and saying, “I just learned about the situation outside. There is no possibility of taking the lady back. I guess I underestimated the Clark family. So... now we only have one mission left.” <br/><br/>“Do you think you can accomplish that?” Kevin Clark’s voice sounded like a demon, extremely terrifying. <br/><br/>“All the people here have been trained by me, they are all top assassins,” Robert Kirsten gestured with his hand, introducing the works he had created behind him. “And me...” <br/><br/>Robert Kirsten paused for a moment, then proudly said, “They don’t even have to do anything. I alone am more than enough to deal with you..”\t\t\t\t\t\t</div>", "images": {}, "success": true}