{"id": 212, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244341.html", "title": "Chapter 212 - 202: All Are Memories", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 212 - 202: All Are Memories</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 212: Chapter 202: All Are Memories <br/><br/>Translator: 549690339 <br/><br/>When Allonzo Hobson realized that there were no bullets in the gun, his legs turned to jelly and he leaned against Liana Butch. <br/><br/>“Damn it! Damn it!” Allonzo Hobson patted his own chest, “I was scared to death, I thought you were going to kill your husband. This is not okay to play like this, my poor heart.” <br/><br/>Liana Butch pushed him away: “Get away, don’t take advantage of me.” <br/><br/>“Who’s taking advantage of you?” Allonzo Hobson hugged himself, “I should say that you are taking advantage of me.” <br/><br/>Liana Butch glared at him and gave him the middle finger. <br/><br/>Allonzo Hobson: <br/><br/>In everyone’s eyes, Daisy Zane was now like a fierce wolf. <br/><br/>Cold, fierce, bloodthirsty, covered in blood and anger. <br/><br/>But Kevin Clark knew that she was worried about him, worried that he would confront Edward Kirsten head-on, worried that something would happen to him. <br/><br/>After all, she had lived with Edward for four years and knew his ways and methods. <br/><br/>She had also witnessed Edward killing Jack Amos in front of her eyes. <br/><br/>Daisy Zane removed the gun, put the gun in her left hand behind her waist, and then loaded the bullet in the gun in her right hand. <br/><br/>“The sea surface periphery is covered by my people, and the snipers on the rockery in the backyard are James Collins.” Daisy Zane loaded the bullets with her head down, “Tell your people.” <br/><br/>“Xavier...” Kevin Clark called him. <br/><br/>“I’ll notify them right away.” Allonzo Hobson took a few steps back, pressed his earpiece and notified his people. <br/><br/>Kevin Clark took a handkerchief from his pocket, held Daisy Zane’s face, and looked up at her. <br/><br/>Seeing him touch her, Liana Butch immediately grabbed his wrist: “What are you doing?” <br/><br/>Kevin Clark looked at her and saw the two silver earrings on her ears: “Logan?” <br/><br/>Liana Butch slightly squinted her eyes. <br/><br/>Daisy Zane lowered her gaze and said softly, “Sister Dorothea, let go.” <br/><br/>As soon as she heard the word “Sister,” Liana Butch understood that their big boss did not want to reveal her identity. She smirked, “Little sister, introduce this guy.” <br/><br/>Daisy Zane pulled down Kevin Clark’s hand and looked at Liana Butch, “My boyfriend. ” The source of this content nov(el)bi((n))<br/><br/>The smile on Liana Butch’s mouth froze, she looked at Kevin Clark and then at Daisy Zane, “You have actually got a boyfriend!” <br/><br/>“I don’t like women, so I have a boyfriend.” Daisy Zane looked at her calmly. <br/><br/>Liana Butch’s lips trembled twice, and she looked at Kevin Clark again. Full of scrutiny and exploration. <br/><br/>Kevin Clark heard something strange in Daisy Zane’s words. He hadn’t cared at first, his people had only dealt with Logan a few times. <br/><br/>There was no real hatred. <br/><br/>However, if it was about stealing a wife, then it would be an act of revenge. <br/><br/>Kevin Clark suddenly smiled, his expression unpredictable: “It’s my little girl’s friend. <br/><br/>Liana Butch: “What does that mean? What does that mean?!” <br/><br/>Daisy Zane: . <br/><br/>It was a small partition, no more than a dozen square meters. There was nothing inside, seemingly used only for hiding purposes. <br/><br/>Arthur North and Daisy Zane exchanged glances, anger flickering in both their eyes. <br/><br/>Daisy Zane was only fifty percent sure that the place had a hidden door. Running over here was a risk. And because Arthur North wasn’t sure if the door existed, he had shielded her with his body. <br/><br/>However, both of them looked away simultaneously, not wanting to argue at this time. <br/><br/>Arthur North checked the situation outside the door. <br/><br/>Daisy Zane turned on the room’s light and found a password lock under a floor tile in the right corner, just as she remembered. <br/><br/>Arthur North came over to see her input an eight-digit password. <br/><br/>It seemed to be a date. <br/><br/>Then the wall on the left side made a noise. <br/><br/>There was a secret door. <br/><br/>Daisy Zane covered the floorboard again, then stood up without looking at Arthur North, and said with downcast eyes, “The layout of this island is the same as where I lived in Continent A.” <br/><br/>And this password was the date she first met Edward Kirsten. She had been unconscious for more than two months, and this was the first time she woke up to see Edward Kirsten. <br/><br/>June 5, xxxx. <br/><br/>Edward Kirsten also treated this day as her birthday, celebrating it for her every year. <br/><br/>Arthur North looked at her, clenching his hand at his side, the knuckles turning somewhat white. <br/><br/>Daisy Zane didn’t look at him and instead pulled open the hidden door on the left-side wall. <br/><br/>At the same time, following a burst of rapid gunfire, Allonzo Hobson, Liana Butch, James Collins, and several others also came running over. <br/><br/>The cramped space suddenly felt claustrophobic. <br/><br/>“Wow! It’s so small. <br/><br/>“There’s another secret door inside.” James Collins walked over and saw the darkness behind the secret door, unable to see anything. “Where does this lead? <br/><br/>How long is it?” <br/><br/>Daisy Zane reached in and turned on the light inside. <br/><br/>The light illuminated a narrow passageway, seemingly endless. <br/><br/>Without thinking, Arthur North wanted to go inside, but Daisy Zane stopped him: “If Edward Kirsten is really here, the only person he wouldn’t hurt in this place is me.” <br/><br/>Everyone looked at her. <br/><br/>Arthur North looked at her for a moment, then gently touched her head with great effort to soften his voice: “What if it’s not Edward Kirsten?” <br/><br/>“No one else knows about this passage. Only him and me.” Daisy Zane’s voice was cold, as if she was wrapping her usually aloof demeanor with a thick layer of ice. <br/><br/>Encasing her warm, beating heart in ice, bit by bit. <br/><br/>Here, there were too many memories between her and Edward Kirsten. Memories that belonged solely to her and Edward Kirsten, without any interference from anyone else. <br/><br/>Anyone would doubt their relationship, even suspecting that something had happened between them. <br/><br/>But she didn’t want to think about any of that. <br/><br/>What she needed now was to maintain her clarity at all times. <br/><br/>Nothing could interfere with her..\t\t\t\t\t\t</div>", "images": {}, "success": true}