{"id": 215, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244353.html", "title": "Chapter 215 - 205: The Former Enigma", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 215 - 205: The Former Enigma</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 215: Chapter 205: The Former Enigma This chapter is updated by nov(e)(l)biin.com<br/><br/>Translator: 549690339 <br/><br/>At that time, Daisy Zane wasn’t as tall as she is now, and her face still had some baby fat. Her beautiful phoenix eyes would curve when she smiled. <br/><br/>Her whole body didn’t have the sharp aura that she has now; compared to her current self, she seemed like an innocent little bunny. <br/><br/>She wore a flower wreath made of peach blossoms on her head, and her black hair reached her waist. It fluttered lightly as she danced. <br/><br/>Even when dancing spontaneously, it was evident that she had a solid foundation in dance. Her grace, posture, and technique were all perfectly interpreted. <br/><br/>Soft yet powerful, her dance moves were light and graceful, her body as ethereal as cloud fluff. Her body was so flexible that it seemed boneless. <br/><br/>As she spun smoothly, her slender neck drew beautiful lines, and every movement reached the pinnacle of elegance. <br/><br/>When she spun in place, her skirt hem fluttered, and her hair followed suit. <br/><br/>A gust of wind passed by the peach blossoms, and petals fell all around. <br/><br/>Daisy Zane in the video spun and lifted her hand to catch the petals. <br/><br/>The smile on her face was pure and carefree, coming from the depths of her heart. <br/><br/>It was a smile that none of the people in front of the screen had ever seen. <br/><br/>The picture before their eyes was crystal clear. Kevin Clark stared intently at the little girl on the screen, at the little girl who now seemed so different. <br/><br/>“Little Enigma.” <br/><br/>A man’s voice suddenly came from the screen. It was a low, magnetic, and pleasant voice. <br/><br/>And the tone was very indulgent and tender. <br/><br/>However, when it reached Daisy Zane’s ears, she only felt disgust. <br/><br/>Hearing this voice, Kevin Clark’s eyelashes trembled slightly, and a fierce look appeared in the depths of his eyes in an instant. <br/><br/>The man in the video did not appear on the screen, but Little Enigma heard his voice and stopped, turning to look at him. <br/><br/>As she saw him, the smile on her face grew even deeper. <br/><br/>“Brother Yabez.” Little Enigma ran to him a few steps, “Didn’t you say you’d come back in two days?” <br/><br/>Only the peach blossom tree was left on the screen. <br/><br/>There was also the sound of the two people’s conversation. <br/><br/>How did that man turn such a naive and cheerful little girl into what she is now? <br/><br/>Daisy Zane didn’t show any emotional fluctuations at all, her coldness reached the extreme, as if she had lost all reaction to everything around her. <br/><br/>Suddenly another voice sounded, much louder and deeper than before, with a hint of sinister laughter. <br/><br/>“Little Enigma.” <br/><br/>Daisy Zane’s eyes blinked gently, watching the unchanging scene before her. <br/><br/>“Brother really misses you.” <br/><br/>“Damn!” James Collins cursed under his breath. <br/><br/>“I knew you’d come, so brother prepared a special surprise for you, do you like it?” <br/><br/>Kevin Clark saw Daisy Zane’s complexion worsening and pulled out the gun from his waist and aimed it at the screen. <br/><br/>However, Daisy Zane raised her hand to lower his arm, stopping him: “Don’t, let him talk.” <br/><br/>Kevin Clark looked at her. <br/><br/>Daisy Zane could sense his gaze, but didn’t raise her head, only pressing down on his arm with more force. <br/><br/>There were things that Kevin Clark should know, and he had the right to know. <br/><br/>Kevin Clark’s hand was pressed down, preventing him from firing. So he put away his gun and held Daisy Zane’s hand in his. <br/><br/>Feeling his warmth, Daisy Zane hesitated for a moment, but in the end, she didn’t move. <br/><br/>Edward Kirsten’s voice continued: “Brother misses Little Enigma’s smile and also misses her sleeping face. Remember when Brother said, you’re well-behaved and quiet when you sleep. Brother must see it every day before he can fall asleep.” <br/><br/>James Collins couldn’t hold back any longer and turned around in place, wanting to pierce Edward Kirsten’s throat to see if he could still talk. Allonzo Hobson’s skin crawled with goosebumps and his hairs stood on end. <br/><br/>Fuck! Why is this man so disgusting and perverted? Is he even human? How could anyone stand such a person by their side? <br/><br/>Daisy Zane’s fingertips stiffened, trying to pull her hand away. <br/><br/>But Kevin Clark immediately tightened his grip. He finally understood why this little girl loved to sleep with her head wrapped up. <br/><br/>It was all because of him. <br/><br/>“Brother knows that you’re investigating the 319 case, and that you have many doubts. So today, Brother will casually answer two questions for you.” <br/><br/>Daisy Zane’s pupils deepened. <br/><br/>Edward Kirsten’s voice said: “Brother has been studying this Thing for many years... It can be said that this Thing has been studied since my grandfather’s youth, and it’s already the third generation.” <br/><br/>“Originally, in my grandfather’s generation, a more refined elixir than what you see now had already been developed. But some accidents happened, the research results were lost, and only some information about the elixir was left. So, with the completion of only a fifth part of the elixir, my father and I have been conducting research, resulting in today’s 319. Unfortunately... it still hasn’t achieved the effect of the previous version. Even back then, it wasn’t completely successful....”\t\t\t\t\t\t</div>", "images": {}, "success": true}