{"id": 214, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244349.html", "title": "Chapter 214 - 204: Extremely Satisfying Work", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 214 - 204: Extremely Satisfying Work</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 214: Chapter 204: Extremely Satisfying Work <br/><br/>Translator: 549690339 <br/><br/>Although Robert Kirsten’s words were arrogant, he had the capital to be arrogant. <br/><br/>Many people around Edward Kirsten were trained by him, including Alice <br/><br/>Eugene. <br/><br/>Indeed, they could all be considered top-notch assassins. <br/><br/>These people were not very well-known in the world, but their strength was even more significant than some famous ones. Updated from novelb(i)n.c(o)m<br/><br/>But Daisy Zane didn’t take them seriously, and it was even more true for Kevin Clark. <br/><br/>“The young master knew that Austin Chaors was captured, and he knew that Kevin Clark would find out this location,” Robert Kirsten said. “The young master appreciates Kevin Clark as an opponent.” <br/><br/>“I don’t think much of him either,” Kevin Clark said coldly. “After all, a rat that only knows how to hide in corners is despised by anyone.” <br/><br/>Allonzo Hobson took a light breath, rarely seeing Kevin Clark talk like this. <br/><br/>For the first time, he heard from his mouth a tone of utter disgust for someone. <br/><br/>This was really infuriating. <br/><br/>Allonzo Hobson could feel how contemptuous his tone was now, and how miserable the person on the other side would die later. <br/><br/>Robert Kirsten sneered and didn’t take his words to heart. He continued, <br/><br/>“Originally, the young master wanted to plant bombs all over the island and blow it up when Third Master landed on the island. But the young master knew that Lady and Third Master were together. If she knew, she would definitely come to the island as well.” <br/><br/>Daisy Zane seemed to be numb already, listening to his words without any fluctuations in her heart. <br/><br/>“For the lady’s safety, the young master abandoned this plan,” Robert Kirsten said. “Lady, you’ve been away for so many years, it’s about time to go home, the young master misses you a lot.” <br/><br/>Daisy Zane chuckled lightly, but there was no hint of a smile in her eyes: <br/><br/>“Home? Where is home?” <br/><br/>Kevin Clark turned his head to look at her, at the little girl in front of him. <br/><br/>It was as if there was a rotten wound on his heart, constantly being eroded by pus, the fresh and tender flesh decaying, making him feel more pain every time. <br/><br/>“In Edward Kirsten’s eyes, I am just a very satisfactory work he cultivated, ” <br/><br/>Daisy Zane lightly flicked the thin blade of the dagger and said sarcastically, “He saved me and kept me just because of this face. The various things he taught me were just the process of creating a satisfactory work.” A trace of surprise surfaced in Robert Kirsten’s eyes: “Is this how you think?” <br/><br/>Kevin Clark became ruthless, attacking with accuracy. With each punch, palm strike, and kick, he aimed for where it hurt the most, almost making his opponents wish for death. <br/><br/>When facing the duo, there was a moment where Robert Kirsten felt as if their techniques and moves were taught by the same person. <br/><br/>Liana Butch, as a skilled assassin across various continents, was renowned for her cruelty and ruthlessness, practically killing opponents with each move. <br/><br/>And Daisy Zane, being trained by James Collins, was naturally not bad either. <br/><br/>Considering they too had a fair number of comrades with strong abilities. <br/><br/>It didn’t take long for Robert Kirsten’s team to be completely taken down. <br/><br/>Robert Kirsten was covered in wounds; exhausted, he eventually knelt with one knee on the ground gasping for breath. He tried a few times to stand, but failed. <br/><br/>Kevin Clark and Daisy Zane stood in front of him, both looking down at him. <br/><br/>Gasping for breath, Robert Kirsten watched Kevin Clark’s people handcuff and tie up his team. He also watched them treat the wounds of the injured. After a while, he chuckled lightly, “I told Young Master a long time ago that Miss was well-suited for martial arts. But Young Master couldn’t bear to see Miss suffer, so he didn’t agree.” <br/><br/>Daisy Zane wiped the blood off her dagger, seemingly not hearing his words. <br/><br/>“As expected, I wasn’t wrong,” Robert Kirsten said, “I submit.” Daisy Zane still ignored him. <br/><br/>Kevin Clark spoke up, “It seems that your mission has failed.” <br/><br/>“Yes, it has,” Robert Kirsten looked up at him, “I’ve only heard that Third Master Clark is good at strategizing and playing mind games. I never thought that Third Master’s skills would be so good.” <br/><br/>“You guys were just not good enough.” <br/><br/>“Yes, some people, no matter how hard they try, ultimately cannot compare to natural talent.” Robert Kirsten lowered his head and said these words before suddenly putting his hand in his pocket. <br/><br/>Not knowing what he was planning, Kevin Clark was about to step forward to stop him. <br/><br/>At that moment, the liquid crystal display screen several meters away lit up. <br/><br/>As the entire display screen lit up, the room brightened as well. <br/><br/>Everyone’s eyes were drawn to it. <br/><br/>They all watched as the image on the screen gradually changed from blurry to clear. <br/><br/>On the huge screen, under a peach blossom tree, a fourteen- or fifteen-year-old girl was dancing. <br/><br/>It was the season when peach blossoms were in full bloom. <br/><br/>As the wind blew, petals fell. <br/><br/>The girl wore a peach-pink dress with a carefree smile on her face, dancing buoyantly....\t\t\t\t\t\t</div>", "images": {}, "success": true}