{"id": 216, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244357.html", "title": "Chapter 216 - 206: Instigating Divisions And Provoking Edward Kirsten", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 216 - 206: Instigating Divisions And Provoking Edward Kirsten</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 216: Chapter 206: Instigating Divisions and Provoking Edward Kirsten <br/><br/>Translator: 549690339 <br/><br/>Edward Kirsten’s grandfather had been researching it for ages, making the time frame too vast. <br/><br/>Moreover, the current 319 didn’t achieve the effect it had back then, so what kind of effect did it have at the time, and what kind of reaction would it produce in people? <br/><br/>Kevin Clark was obviously surprised by what he had just heard. <br/><br/>The research conditions and experimental conditions of that era were poor, but with the current level of research, they couldn’t reproduce what they had back then. <br/><br/>“By the way, Enigma, do you know why it’s called ‘319’?” Edward Kirsten’s voice laughed, “Because Enigma wanted to leave her brother, and her brother was very angry. So he used the date of the first time he found her as the name of this medicine. He knew she would definitely hate this stage of the drug. It’s a small punishment.” <br/><br/>Listening to this, Allonzo Hobson’s emotions went from shock, anger, and heartache to admiration. <br/><br/>He was so full of admiration that he now wanted to bow down to Daisy Zane. <br/><br/>If he had lived with such a person for four years, he would have either died or gone insane. He definitely wouldn’t be standing here unscathed. <br/><br/>“Oh, right, there’s also...” Edward Kirsten continued, “You guys should be curious about why there’s a trading location at Red Cliff Village.” Daisy Zane lowered her gaze, listening to what he had to say. <br/><br/>Kevin Clark glanced at her. <br/><br/>Edward Kirsten laughed and said, “Enigma, do you remember Mason Davis?” <br/><br/>Daisy Zane’s hand unconsciously tightened around Kevin Clark’s hand, pressing harder and harder. <br/><br/>“Enigma must remember. After all, it was you who helped find him for my brother,” Edward Kirsten said, “Mason Davis, previously called Oliver Constantine, had always been part of my laboratory. But...he betrayed me. He escaped from the laboratory and went into hiding with his wife.” <br/><br/>“He made enough money from me and then wanted to leave. There’s no such cheap deal in the world, how could I let that happen and maintain my authority?” <br/><br/>“However...l couldn’t find him for many years. Thanks to Enigma’s hacking skills, she found him within a few minutes.’ <br/><br/>“But now my brother regrets it. If he hadn’t let Enigma find him, Enigma wouldn’t have seen the three corpses later. She wouldn’t have been so angry and yelled at her brother, questioning why he killed people.” <br/><br/>“My brother also regrets telling you so much. I thought Enigma would stand by her brother, but I didn’t expect her to be so extreme. If I had continued to keep her in the dark and let her remain ignorant, maybe now, we would still be living together. ” <br/><br/>“However...the death of Mason Davis and his family of three, Enigma contributed to as well. My little Enigma, her hands aren’t clean either, and that child was only four years old.” <br/><br/>Kevin Clark was such a proud and noble person, always wanting the best of everything. <br/><br/>Everyone in the Clark family had a clean background. <br/><br/>The woman by Kevin’s side, his future wife, and daughter-in-law of the Clark family, naturally also had to be clean and pure. <br/><br/>Moreover, with Edward Kirsten frequently mentioning Enigma and his family, who wouldn’t misunderstand their past relationship? <br/><br/>Edward Kirsten must have anticipated that the noble and proud Third Master Clark would stay away from Daisy Zane. <br/><br/>He wanted to drive away everyone around Daisy Zane, one by one, leaving her with nowhere to go, forcing her back to his side. <br/><br/>Daisy Zane had stayed on the island until the end with Kevin Clark and the others, waiting until all matters were handled, and each location had been checked. Leaving some guards behind, it was only when Kevin planned to return that Daisy decided to leave with her people. <br/><br/>“You can take all the people back and do whatever you want with them,” Daisy Zane never looked up at him, “We’re leaving first.” <br/><br/>After saying that, Daisy Zane led her people in the opposite direction. Kevin Clark followed her for a few steps but was stopped by James Collins. <br/><br/>“My sister...” James Collins paused for a moment, “Let her be by herself for a while. She needs to calm down.” <br/><br/>Kevin Clark looked at her receding figure, clenching his fingers. <br/><br/>If she calmed down by herself, she’d probably leave him behind to save his life once she was calm. <br/><br/>But... she must be eager to get some sleep now. Her psychological burden was too great, and she needed to rest. <br/><br/>So, Kevin Clark didn’t catch up. He just asked James Collins, “Where do you guys stay?” <br/><br/>“Uh...” James Collins thought for a moment, “You can ask my sister later when you see her. I’ve got to go.” <br/><br/>Kevin Clark watched James Collins run off, then his eyes fell on Daisy Zane once more until her shadow, along with her entire group, was about to disappear. <br/><br/>He glanced at Liana Butch’s receding figure. <br/><br/>Logan... <br/><br/>An undisclosed residence... <br/><br/>The resting place of the Hundred Demons Pavilion in the M Continent....\t\t\t\t\t\t</div>", "images": {}, "success": true}