{"id": 217, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244361.html", "title": "Chapter 217 - 207: Pure Chat", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 217 - 207: Pure Chat</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 217: Chapter 207: Pure Chat <br/><br/>Translator: 549690339 <br/><br/>Aside from being colder and quieter than usual, there wasn’t much difference in Daisy Zane. <br/><br/>On the helicopter, she also responded to a few words that James Collins and Liana Butch said to her. <br/><br/>And before getting off the helicopter, she messed up James Collins’ green hair. <br/><br/>James Collins squatted in front of her, letting her mess with his hair. <br/><br/>After returning to the manor, Daisy Zane went straight back to her room and slept on the bed. <br/><br/>Liana Butch and James Collins stayed on the first floor, watching her go up to the third floor. They didn’t return to the sofa until they heard the sound of the door closing. <br/><br/>“Damn it! Who is that man! Damn it! I’m so angry! He dared to bully my sister like that!” James Collins got up from the sofa and paced around the living room, “I’m so angry! I’m so angry! I’m so angry!” <br/><br/>“Stop swaggering around.” Liana Butch glanced at him. <br/><br/>“He bullied my sister, I want to kill him!” James Collins gritted his teeth and growled, “He bullied my sister and completely changed her!” <br/><br/>“If he could be killed, the big boss would have done it long ago, and not left it till now,” Liana Butch whispered. “We’ve wasted so much effort tonight, and didn’t even see the person. Our big boss, who is such a capable person, has nothing to do for now. It shows how difficult this person is to deal with.” <br/><br/>“Ah!!” James Collins groaned and rubbed his hair again. <br/><br/>Liana Butch lit a cigarette and watched him pace back and forth expressionlessly. After a while, she said, “Little poor thing, come here.” <br/><br/>“What for?” <br/><br/>Liana Butch spat out a puff of smoke and said, “Come here.” <br/><br/>James Collins went around another circle and sat next to her. He also took a cigarette from her box, lit it, and asked, “What for?” <br/><br/>“What’s the deal between the big boss and Harton Clark?” <br/><br/>James Collins didn’t expect her to gossip. He was speechless for a while: “Just like that.” <br/><br/>“Are they together?” <br/><br/>“Yeah.” <br/><br/>“For how long?” <br/><br/>James Collins thought about it and said, “It’s been several months.” <br/><br/>Liana Butch spat out another puff of smoke, her expression unreadable behind the thin smoke. Her deep eyes narrowed: “Being the daughter-in-law of the Clark family... that’s a bit difficult, isn’t it?” <br/><br/>“Would my sister be afraid of difficulties?” <br/><br/>Liana Butch glanced at him, put the cigarette in the ashtray, and walked away. <br/><br/>“No worries, you can look as much as you want. I won’t charge you.” Arthur North joked. <br/><br/>Daisy Zane quietly stared at him for a while longer and then asked directly, “Why are you here?” <br/><br/>Arthur North also gazed into her eyes, admiring the tranquility in her beautiful phoenix eyes, as well as the resolute determination there, which could shut others out at any moment. <br/><br/>After a while, he stood up straight. <br/><br/>Daisy Zane’s eyes followed him, and she lifted her head as well. <br/><br/>Arthur North unbuttoned his cuffs, lifted the quilt, took off his shoes, and climbed onto the bed. <br/><br/>He stretched out his arms to embrace Daisy Zane and lay down next to her, and then he reached over to turn off the bedside lamp. <br/><br/>Ever since Arthur North had gone to Daisy Zane’s room, James Collins had been watching her room from the courtyard. <br/><br/>Although the curtains were drawn, he could vaguely see that the lights were on inside. <br/><br/>And just as he was watching, the light suddenly went out. <br/><br/>James Collins’ peach blossom eyes instantly widened, and he ran upstairs with all his might. <br/><br/>Wasn’t it just a chat? Why did they need to turn off the lights for that? Arthur North was a big liar! <br/><br/>He rushed all the way to Daisy Zane’s room entrance. <br/><br/>His hand was about to knock on the door, but he withdrew it just in time. <br/><br/>He was already a grown-up, and his sister should be getting married as well. Some things... some brother-in-law... he should have, and it was time for him to try to accept them. <br/><br/>They were all adults now. <br/><br/>It took James Collins some time to convince himself, then he cursed Arthur North as an old beast while pointing at the door, and left with a grim face. <br/><br/>In the room, Daisy Zane had her arm resting on Arthur North’s neck, leaning against him. <br/><br/>In the darkness, both of them listened to the footsteps outside. When the person left, Daisy Zane asked, “What are you doing?” <br/><br/>Arthur North chuckled, quite pleasantly, “If I really wanted to do something, do you think you have the ability to resist?” <br/><br/>Daisy Zane clenched her hand with a sound. This man in front of her was invincible, unbeatable, unbeatable... <br/><br/>But... the outcome of anything wasn’t set in stone, you only know once you’ve tried. <br/><br/>“You could give it a try.” <br/><br/>Seeing her determination, Arthur North gripped her hand and whispered, “I was just joking. Even if I had the desire, I wouldn’t have the guts. Let’s just hug for a bit.’ <br/><br/>“Do you have to hug here?” Daisy Zane relaxed her grip slightly. <br/><br/>“Mhm.” Sensing her loosening grip, Arthur North took the opportunity to remove her arm, held her hand, and kissed it gently. “The legendary chatting under a quilt.” <br/><br/>Daisy Zane: .Updated from novelb(i)n.c(o)m\t\t\t\t\t\t</div>", "images": {}, "success": true}