{"id": 218, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244365.html", "title": "Chapter 218 - 208: First Love", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 218 - 208: First Love</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 218: Chapter 208: First Love <br/><br/>Translator: 549690339 <br/><br/>In the darkness, inside the quiet room. <br/><br/>The two of them lay facing each other. <br/><br/>Kevin’s hand stretched over from under Daisy’s neck, letting her rest on it. <br/><br/>His other arm was placed on her back, touching her soft hair. <br/><br/>As they lay quietly for a while, Kevin suddenly asked in a low voice, “Are you thinking about how to not want me?” <br/><br/>The voice was right in her ear, and Daisy could hear a trace of grievance. She looked up at him. <br/><br/>Though the room was very dark, she could still faintly see Kevin’s eyebrows and eyes. <br/><br/>“Does this silence mean... you think I came here today to break up?” Kevin said. <br/><br/>Daisy still didn’t say anything, almost as if she agreed. <br/><br/>Seeing her acquiescent response, Kevin gritted his teeth, and after a while, he clenched his teeth and said, “I came here to settle the score.” <br/><br/>“Settle what?” <br/><br/>“Whatever I remember, I’ll settle.” Kevin exclaimed angrily. <br/><br/>Daisy: <br/><br/>“Do you think I’d hear Edward Kirsten babble a few words and then come over here to break up?” Kevin forced his voice to soften somewhat, then pinched her face, “Little girl, you really know how to annoy someone.” <br/><br/>“He wasn’t exactly babbling.” Daisy said calmly. <br/><br/>Kevin was silent for a moment, and then couldn’t help but feel heartache. He hugged Daisy closer and kissed the top of her head: “Then tell me, which parts of what he said were not nonsense?” <br/><br/>“Most of it was true?” <br/><br/>“What about the small part?” <br/><br/>Daisy thought for a moment and decided to clear things up. In a flat voice, she said, “This is my first love affair.” <br/><br/>Kevin seemed to be stunned for a moment, then he laughed, “Oh, I’m your first love.” <br/><br/>Suddenly, Daisy felt that this man’s mood changed too quickly, and even had reason to suspect that he had learned the art of face-changing in Peking opera at home. <br/><br/>“Little girl, I like you, and I’ll get to know you little by little. My eyes can see, I only want to believe what I see for myself. I know what kind of person you are, and I don’t need anyone else to tell me.” New novel chapters are published at novelhall.com<br/><br/>Daisy quietly rested on his arm, and because they were closer, she could even hear his heartbeat. <br/><br/>“Do I seem like a jerk? I say I like you and I like you, and then I don’t like you after hearing a few words from others.” <br/><br/>But as time went on, his malicious nature was exposed. <br/><br/>He became more and more irritable because she ignored him and rejected him. <br/><br/>Unable to accept his twisted values, his crazed reasoning, and his so-called “truth” in his heart. <br/><br/>The more she refused, the harder Edward tried to force his ideas on her, until she became highly resistant. <br/><br/>How could Edward accept her turning away from him? <br/><br/>So he kept provoking her, brainwashing her. If she couldn’t accept it, he would forcibly make her just like him. <br/><br/>So he was like a madman, telling her every day that the death of the Davis family was her fault. <br/><br/>He told her that even though she despised him, she was already that kind of person. <br/><br/>And threatened her with the people around her. <br/><br/>Telling her that the Davis family tragedy was just the beginning, and she would use her hacking skills to kill even more people in the future. <br/><br/>And if she didn’t obey, he would kill someone who frequently took care of her. <br/><br/>So... Daisy Zane cut off her own ten fingers. <br/><br/>Edward was frightened at that time, and he didn’t dare to provoke her for a long time afterward. <br/><br/>The two entered a standoff period. <br/><br/>Later, taking advantage of Edward’s reluctance to visit her frequently, Daisy Zane planned an escape. <br/><br/>She didn’t tell Kevin much about it, but simply said, “I tried to escape once, Jack Amos helped me. But... it wasn’t successful.” <br/><br/>Kevin realized why Edward wanted to kill Jack Amos. <br/><br/>“I was only away for 22 hours before I got caught and taken back,” Daisy Zane said, “It’s because of this that I got Jack Amos killed.” <br/><br/>Twenty-two hours... Kevin remembered she had said that Jack had been stabbed 22 times. <br/><br/>One knife per hour, how could his little girl have endured that. <br/><br/>Kevin held her a little tighter, his voice slightly hoarse, “Little girl, the sin is Edward’s, you shouldn’t feel so guilty for his sins.” <br/><br/>Daisy Zane’s fingertips circled his front buttons, listening to him quietly. <br/><br/>“Also, there is something that wasn’t done right,” Kevin said, “Although it was your hacker technology that found Mason Davis and made you feel that hacking wasn’t a good thing for you. But your skills can have other positive uses, like... saving Olivia Lane. There’s no need to give up a valuable skill just because of one bad experience.” <br/><br/>Daisy Zane listened to his words, remained silent for a moment, and said softly, “You sound like someone I know.” <br/><br/>Who?” <br/><br/>Daisy Zane lifted her head from his shoulder, resting it back on his arm, and said, “Someone who looks a lot like Anisa Cooper.” <br/><br/>“So.... do I resemble Anisa Cooper?”\t\t\t\t\t\t</div>", "images": {}, "success": true}