{"id": 210, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244333.html", "title": "Chapter 210 - 200: M Continent", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 210 - 200: M Continent</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 210: Chapter 200: M Continent <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane went to Spotlight to discuss the concept release conference for the past two quarters with Felix Baker. <br/><br/>Kevin Clark had to go on a business trip, so he couldn’t accompany her. After dropping her off at Spotlight, he let Michael Jackson stay behind and got into his car to leave. <br/><br/>After staying for more than an hour at Spotlight, Daisy Zane went home to check on Charles Amos and Wilton Edwards. Then she bought a ticket to the M Continent. <br/><br/>After nearly fourteen hours of flying, the plane landed at dawn in M Continent, just as light was appearing at the horizon. <br/><br/>Outside the airport, James Collins wore sunglasses, with green hair, wearing a casual shirt with the top two buttons undone, leaning against the car door and playing with his phone. <br/><br/>He looked like an irreverent young master. <br/><br/>A few minutes later, Daisy Zane came out of the airport. <br/><br/>The man sitting in the driver’s seat of the car tapped on the glass. The source of this content nov(el)bi((n))<br/><br/>James Collins immediately looked towards the airport entrance. Upon seeing Daisy Zane’s figure, he immediately straightened his body, his thin lips curving into a smile. <br/><br/>Then he ran to Daisy Zane and : “Sister!” <br/><br/>Daisy was wearing athletic clothes and didn’t even carry a suitcase. When she saw James Collins, she first looked at his green hair: <br/><br/>“Sis, long time no see. Did you miss me?” <br/><br/>“You...turned green?” <br/><br/>James Collins: ......This is fashion. <br/><br/>Looking at his hair, Daisy Zane didn’t want to speak. Blessings on his fair face, or else this guy could’ve been gone long ago. She would have to spend a few years grooming another one. <br/><br/>As she was thinking, a whistle suddenly entered her ears. <br/><br/>Daisy retracted her gaze and looked towards the source of the whistle. <br/><br/>Right in front of the car where James Collins had been leaning on, stood a beautiful woman. <br/><br/>She was dressed all in black with high heels, exuding cool and sexy vibes. <br/><br/>A very standard handsome Western face, deep eye sockets, a high nose, thin lips, and white skin. <br/><br/>Her hair was very short, all combed back into a slick back. Two silver earrings adorned her left auricle. <br/><br/>Her body was also very good, curves were beautiful, and her black top was slightly translucent. <br/><br/>Daisy Zane raised an eyebrow: “Less meddling in Gael Easton’s affairs. The water behind him is too deep. At least cause less trouble in M Continent.” <br/><br/>“I know.” Liana Butch lit a cigarette and said, “It’s fun.” <br/><br/>Daisy Zane went upstairs to the third floor. She opened a nearby room and took a glance inside before turning to look at Liana Butch and say, “I will take a nap. We will elaborate on the deployment in the afternoon.” <br/><br/>Liana Butch leaned against the door with his deep eyes, slightly raised. “Shall I sleep with you?” <br/><br/>“If you can beat me, I don’t mind.” Daisy Zane said, looking at him. <br/><br/>Liana Butch shrugged, “Hard to please.” Daisy Zane gave a small laugh. <br/><br/>Liana Butch sighed, “Fine, you sleep. I’ll go.” <br/><br/>Daisy Zane slept until noon and then had a meal. In the afternoon, she further elaborated on the deployment. <br/><br/>The attack would take place from the airspace and sea at the same time. <br/><br/>They would set off at 6 PM. <br/><br/>Daisy Zane, James Collins, and Liana Butch boarded the same plane. <br/><br/>After more than two hours, they arrived in the airspace above Koymoon Island. <br/><br/>From above, Liana Butch observed the terrain of Koymoon Island gradually become clear. After a few seconds, he looked at Daisy Zane. <br/><br/>Wearing a mask, Daisy Zane looked down at the island, feeling Liana Butch’s gaze. She nodded after waiting for two seconds. <br/><br/>Liana Butch pressed his earpiece, “All units pay attention...” <br/><br/>“Report, there is a situation.” The voice coming from the earpiece suddenly interrupted Liana Butch. <br/><br/>Daisy Zane, who was about to put on her hat, looked up at Liana Butch. <br/><br/>Liana Butch furrowed his brows, “Go on.’ “Someone beat us to the island and has already started fighting.” <br/><br/>“Were you discovered?” Liana Butch inquired. <br/><br/>“Yes. The other party shouted at us first and saw that we did not move. They temporarily refrained from attacking.” <br/><br/>The current elevation of the helicopter did not allow them to see the situation on the island clearly. Daisy Zane thought for a moment and said, “Tell the people on the sea to retreat 200 meters and not to take any action. Make sure no one escapes.” <br/><br/>“Yes.” Liana Butch immediately relayed the order. “What about us?” <br/><br/>Not many people knew about the situation on Koymoon Island. Although not excluding personal enmity, but in case... <br/><br/>“Give me the computer.” <br/><br/>James Collins immediately handed the computer to Daisy Zane..\t\t\t\t\t\t</div>", "images": {}, "success": true}