{"id": 221, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244377.html", "title": "Chapter 221 - 211: Must Win Her Back", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 221 - 211: Must Win Her Back</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 221: Chapter 211: Must Win Her Back <br/><br/>Translator: 549690339 <br/><br/>Truro City, the residence of Old Master of the Miles Family. <br/><br/>Early in the morning, Old Master sat in the courtyard, craning his neck and looking towards the entrance. <br/><br/>When he saw Johanes Miles’ car stop at the entrance and someone got out of the car, he immediately stood up with the help of his cane. <br/><br/>As Johanes approached, he hastily asked, “How did it go? Did you see anyone?” <br/><br/>Johanes, with a few more strands of white hair combed back at his temples and a somewhat somber expression, shook his head, “No. I asked the security guards in the residential estate. They haven’t seen her come back.” <br/><br/>“Didn’t she leave another address with the company? Did you check there?” <br/><br/>“I did.” Johanes helped the Old Master sit down in the chair, “There is no trace of anyone living there.” <br/><br/>“Where did she go then?” <br/><br/>“Based on the information on the Internet, her last scene was filmed in the Imperial Capital,” said Johanes Miles with a sigh, “After that, there has been no news.” <br/><br/>“Does she have a place to stay in the Imperial Capital?” <br/><br/>“Probably,” Johanes said, “Her popularity is high, the media attention is high, and she has many fans. But no one can take a picture of her in real life aside from when she’s filming.” <br/><br/>“Can one Allonzo Hobson really make it happen like this?” <br/><br/>“There were photos of her taken by the media before, showing her going in and out of the Everlasting Palace. But when the pictures were posted online, they were removed within a minute. The information about her private life is tightly controlled.” <br/><br/>Old Master Miles rubbed his cane and said solemnly, “The power behind her is probably even greater than we could imagine.” <br/><br/>Johanes sighed again, “Now we can’t contact her, nor can we find her. Although Miles Group’s reputation has been somewhat salvaged because Jordan Ashton went to the hospital, many important projects still have no one daring to cooperate, all fearing Daisy Zane’s power.” <br/><br/>“So the most important step now is to get her back. We must bring her back at all costs.” Old Master Miles added, “Otherwise, the Miles Family will really collapse.” <br/><br/>“I know, but...’ <br/><br/>“Think of other ways, ask someone in the Imperial Capital for news about her.” Old Master Miles suggested. <br/><br/>“Alright, that’s all we can do for now.” <br/><br/>“How have Johnson Sophie and John Anderson been these days?” <br/><br/>Charles Amos still looked at his green hair. <br/><br/>Daisy Zane didn’t pay attention to them, walked into the living room by herself, sat down on the sofa, and poured a glass of water to drink. James Collins tapped Charles Amos’s head, “Did you grow taller?” <br/><br/>Charles Amos looked at his hair again and then gently nodded. <br/><br/>“I brought a present for you,” James Collins patted the box on the ground, “A drone.” <br/><br/>Charles Amos’s eyes immediately lit up as he squatted down beside the box. <br/><br/>Seeing his joy, James Collins also felt happy, looking at him and asking, “So what do you have to say for this gift?” <br/><br/>Charles Amos glanced at the box on the ground and then at James Collins, pursing his lips, “Thank you, Uncle.” <br/><br/>At first, James Collins only wanted to tease him but didn’t expect that he would actually talk to him. He was momentarily stunned, “You, what did you just say? You called me Uncle, right? I didn’t hear you wrong, you were talking to me, right?” <br/><br/>Actually, Charles Amos and James Collins have always played well together. James Collins was nice to him, and he was close to James Collins, but he just wouldn’t talk with him. <br/><br/>“Sister, Sister, Sister!” James Collins ran back behind Daisy Zane, “Did you hear it? He just called me Uncle, he called me Uncle.” <br/><br/>Daisy Zane looked through the messages on her cell phone, glanced at him, and with a flat tone, said, “I’m sure he called you Uncle, not Dad.” <br/><br/>“Huh?” James Collins was confused for a moment. <br/><br/>“With you acting like a father, people might think you have an extra son.” Daisy Zane said, looking at Charles Amos. <br/><br/>Watching Charles Amos lower his head and untying his boxing gloves, she saw a faint smile at the bottom of her eyes. <br/><br/>James Collins also smiled, helping him take off his gloves, grabbing the drone, and taking him to the backyard. <br/><br/>Daisy Zane watched the two and suddenly thought of something she had never considered before. When Charles Amos grows up, will he also be as tall and... <br/><br/>forget it, she couldn’t imagine Charles with green curly hair. <br/><br/>The two went to the backyard, and Daisy Zane sat in the living room for a while, sent a few messages to Kevin Clark, and decided to go upstairs. <br/><br/>But just as she went up the stairs, her cell phone rang again. She glanced at the caller ID, it was Morris, and she answered it. <br/><br/>“What’s up? <br/><br/>“I’m so angry.” Morris blurted out, “I’m going to be driven mad by anger.” <br/><br/>“Who’s making you angry?” Daisy Zane walked slowly up to the second floor. <br/><br/>“It’s just that Billy Allen,” Morris cursed, “I want to slap him a couple of times now. Slapping him a couple of times is not enough to calm my anger..”\t\t\t\t\t\t</div>", "images": {}, "success": true}