{"id": 225, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244393.html", "title": "Chapter 225 - 215: As You Wish", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 225 - 215: As You Wish</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 225: Chapter 215: As You Wish <br/><br/>Translator: 549690339 <br/><br/>The light from the crystal lamp was blocked by Kevin Clark. <br/><br/>Daisy Zane was enveloped in his shadow, looking at his picturesque eyebrows and eyes, the gentle specks of light in the depths of his eyes, and the hidden, restrained sense of oppression. <br/><br/>“Why aren’t you talking anymore? I’ll satisfy whatever sincerity you want.” <br/><br/>Kevin Clark’s unique Beijing accent, even if filled with ambiguity, had an ancient, humbling charm to it. It was like a clear stream flowing directly into one’s heart. <br/><br/>Daisy Zane watched as he approached her a little closer, the oppressive feeling instantly surrounding her. <br/><br/>She raised her hand and pressed it against his shoulder, pushing him back slightly, and said, “Tenant, please keep your distance.” <br/><br/>Kevin Clark glanced at her reddened ears and did not expose her. He kissed her hand, “Have you had enough of this sight? No more?” <br/><br/>Daisy Zane: . <br/><br/>Kevin Clark smiled at her speechless appearance and sat down beside her, helping her take out the half-baked cheese. Just then, his phone rang, and Hugo Clark transferred some money to him. <br/><br/>It was accompanied by a message: [Help me transfer this to Auntie.] <br/><br/>Looking at this message, Kevin Clark raised an eyebrow slightly. He could imagine how humiliating Hugo Clark’s expression was when he typed the word <br/><br/>“Auntie.” <br/><br/>It was bad enough that his younger brother was older than him but his auntie is even younger than him. <br/><br/>Before long, Hugo Clark sent another message: [Third Uncle, please talk to Grandmother about my blind date.] <br/><br/>He then transferred another sum of money to him. <br/><br/>[Auntie’s meeting gift.] <br/><br/>Kevin Clark chuckled and didn’t reply to him. He sent a message to his mother, telling her to let Hugo Clark off the hook. <br/><br/>Natalie Wayne’s response came quickly, with voice message. <br/><br/>Kevin Clark clicked on it, and Natalie Wayne’s voice rang out immediately: “You’re taking advantage of me to bully Hugo again. Do you have any idea how to be an uncle? Seeing an uncle like you is really bad luck. You two go out and I’ll have some peace of mind.” <br/><br/>Daisy Zane, who was eating the half-baked cheese, glanced at him when she heard the sound, “Really got kicked out of the house.” <br/><br/>“Yeah. I’ll have to live off your earnings from now on.” Kevin Clark said, transferring all the money Hugo Clark had sent to her. <br/><br/>“Fine.” Daisy Zane saved her drawing and said, “You pay the living expenses, and I’ll support you.” <br/><br/>“It still costs money to live off someone.” The source of this content nov(el)bi((n))<br/><br/>What if next time she introduces her to some of her other disciples. <br/><br/>It’s better not to let mothers create their sons’ love rivals. <br/><br/>“If my mother finds out we’re together...” said Arthur North, “There’s a 98% chance she will not be able to resist coming to see you.” <br/><br/>Daisy Zane’s eyebrows moved slightly. <br/><br/>“It’s very likely that she’ll show up suddenly without you and me knowing.” Arthur North observed Daisy Zane’s expression. Seeing that she wasn’t annoyed, he continued, “We have had such experience.” <br/><br/>Daisy Zane listened as Arthur North’s voice became more and more uncertain. <br/><br/>“Like... my sister-in-law, and my senior sister’s husband. After she found out, she pretended to be a stranger and got close to them.” Arthur North suddenly felt that he couldn’t quite see through the girl in front of him, couldn’t understand her current mood, so he felt even more unsure, “She actually enjoyed it. Waiting to give people a surprise when meeting the parents.” <br/><br/>Daisy Zane noticed that Arthur North’s palms were sweating, so she tried to pull her hand out, but Arthur North immediately gripped it tighter: “If you think it’s too much trouble, I won’t tell my parents for now.” <br/><br/>“...You’re getting in the way of my eating,” said Daisy Zane softly. <br/><br/>Arthur North glanced at her hand and reluctantly let go. <br/><br/>Daisy Zane handed him a few tissues, teasingly saying, “Third Master, wipe the sweat off your hands.” <br/><br/>Arthur North took the tissues: <br/><br/>Daisy Zane took a bite of the half-baked cheese, slowly chewing on it: “So you came over to talk to me in person about this?” <br/><br/>“I wanted to ask for your opinion in person.” Arthur North held her waist from behind, his chin resting on her shoulder, and said softly, “If you don’t want to, I won’t tell them.” <br/><br/>Daisy Zane looked down at his hand. <br/><br/>It seemed that rumors really couldn’t be trusted. <br/><br/>This so-called prodigal son in everyone’s mouth was actually experiencing his first love affair. <br/><br/>He was a gentleman with self-restraint, knew how to maintain boundaries, and always showed respect, care, and affection. <br/><br/>He took love seriously, thinking about their future together, and didn’t hesitate to introduce his girlfriend to his family. <br/><br/>“It’s up to you.” <br/><br/>Just as Arthur North was thinking about how to prevent his mother from creating love rivals, he suddenly heard her words and froze for a moment. After a while, he raised his head and looked at her, “What?” <br/><br/>“I said, it’s up to you.” Daisy Zane poked a bit of half-baked cheese with her fork and brought it to Arthur North’s mouth, “If your mother really comes to see me, I’ll pretend I don’t know who she is.” <br/><br/>Arthur North opened his mouth to eat, paused for two seconds, and suddenly laughed. <br/><br/>His mother seemed to have met her match. <br/><br/>And his... importance in the little girl’s heart seemed to be much heavier than what he thought..\t\t\t\t\t\t</div>", "images": {}, "success": true}