{"id": 223, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244385.html", "title": "Chapter 223 - 213: Shelter For One Night?", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 223 - 213: Shelter For One Night?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 223: Chapter 213: Shelter for One Night? <br/><br/>Translator: 549690339 <br/><br/>The atmosphere in the living room gradually became strange with Natalie Wayne’s words. <br/><br/>Kevin Clark’s upward smile stiffened, and a moment later, he turned his head to look at Hugo Clark. <br/><br/>Feeling the gaze, Hugo Clark immediately picked up a cup of tea and gently sipped it. Pretending to be seriously tasting the tea, he pretended not to see his Third Uncle’s gaze. <br/><br/>Hardy Clark watched the bustle without interfering, looking at her Third Uncle and her brother, then ran to Natalie Wayne’s side, holding her arm and said, “Grandma, you’ve met her before. How did you meet? Tell me, tell me.” <br/><br/>Natalie Wayne patted her hand and said with a smile, “It was at the Doomsday <br/><br/>Hotel auction last time. I met her in the restroom.” <br/><br/>“How is it? Doesn’t she look better in person than on TV?” <br/><br/>“Yes, she looks better than on TV.” Natalie Wayne smiled, “I was amazed at first glance. How could there be such a beautiful person with such an outstanding temperament? So, I became interested.” <br/><br/>Hardy Clark quickly glanced at Kevin Clark, then smiled and said, “Then how did you get her contact information? I don’t think she’s the type to give her contact information to strangers.” <br/><br/>“Do you know who your grandma is?” Natalie Wayne smiled, “I had a sudden idea at that moment and pretended to fall with lipstick in hand. The young lady seemed approachable but very kind, so she helped me.” <br/><br/>Natalie Wayne reached for a cup of tea on the tea table and drank. <br/><br/>While waiting for her to drink the tea, everyone stared at her, waiting for the follow-up story. <br/><br/>Natalie Wayne raised her hand to touch her hair, looked at several pairs of “inquiring” eyes, and said slowly, “I took advantage of her help by smearing her clothes with lipstick.” <br/><br/>Kevin Clark: So, that’s how the apricot-colored skirt got dirty. No wonder... <br/><br/>Hardy Clark’s mouth twitched, and she looked at her Third Uncle and said, <br/><br/>“Grandma, you, you’re so brave.” <br/><br/>“It’s all because your brother is still single at this age, which worries me.” Natalie Wayne scolded Hugo Clark, then continued, “That girl was very polite to me. Her skirt was so expensive, but she kept saying it was fine. However, I couldn’t miss such an opportunity. I stubbornly grabbed her arm, demanded her contact information as compensation for the skirt, and even called her on the spot to make sure the number was correct before letting her go.” <br/><br/>Kevin Clark was speechless. He thought the young lady must have recognized his mother; otherwise, she would never have let anyone make her skirt so dirty. <br/><br/>She wouldn’t have given out her contact information just because she was dragged and not allowed to leave. <br/><br/>This young lady had a thousand ways to deal with people. <br/><br/>“And then what? Did you give my brother her contact information?” Hardy Clark continued to ask. <br/><br/>Hugo Clark immediately turned his head and glared at her. <br/><br/>But Hardy Clark stuck out her tongue at him, showing no intention of stopping. <br/><br/>“I gave it to your brother immediately,” Natalie Wayne glanced at Hugo Clark and snorted coldly, “But your brother not only failed to contact her, but he also lied to me.” <br/><br/>“What did my brother lie about to you?” <br/><br/>“He lied to me that the girl’s last name was Zhao.” Natalie Wayne said gloomily, “Her real name is Daisy Zane!” <br/><br/>Hardy Clark covered her mouth with her hand and giggled secretly. Folloow current novÊls on nov3lb((in).(com)<br/><br/>Hugo Clark’s mouth was pursed straight, and the word “grievance” was clearly printed on his clean and handsome face. <br/><br/>It seemed fierce, but he couldn’t provoke anyone in the room. <br/><br/>“Such a good girl, but she has no fate with our family.” Natalie Wayne sighed. <br/><br/>“It’s true. You can ask Third Uncle if you don’t believe me.” <br/><br/>Tom Wayne looked at Arthur North. <br/><br/>Arthur North, looking at Daisy Zane on TV, said, “Hugo, although I’m your elder and should protect you, this is about your lifelong happiness. I really can’t cover for you in this matter.” <br/><br/>Hugo Clark: ‘ <br/><br/>Hardy Clark shot a sympathetic glance at his brother. What a short memory he had, provoking Third Uncle again and again since childhood and never learning from his mistakes. Instead of letting his uncle have the last word, he continued digging an even deeper hole for himself. <br/><br/>“You see, you see, you’re lying to me again!” Tom Wayne looked around for something to throw at him. <br/><br/>Seeing nothing handy by her side, Elina handed her a cushion. Tom Wayne immediately threw it: “You little b*stard!” <br/><br/>Hugo Clark caught the cushion, at a loss for words. <br/><br/>“Tomorrow, stay home and wait for the matchmaker to come!” <br/><br/>As Tom Wayne spoke, Arthur North’s cell phone suddenly rang. He looked down and saw it was a call from Daisy Zane. <br/><br/>Arthur North’s eyes tightened, and he immediately answered the phone. <br/><br/>The Little Girl rarely called him; there must be something wrong. <br/><br/>He answered the phone while walking out: “What’s up? <br/><br/>Daisy Zane hesitated for a moment before she said, “Fish... How much is it per fish?” <br/><br/>“Huh?” Arthur North stepped out of the door and went to the outside corridor. <br/><br/>“Charles Amos asked me to ask you, if a fish gets overfed to death, is there any chance of reviving it?” <br/><br/>Arthur North froze for a moment before laughing, “There’s hope of seeing even more fish.’ <br/><br/>After that, he heard Daisy Zane saying to Charles Amos, “Uncle Clark said you should think about where to bury them.” <br/><br/>Arthur North: <br/><br/>Charles Amos’s small voice rang from the cell phone, “Why are they so fragile? <br/><br/>They just ate a little too much. I only wanted to take care of them.” <br/><br/>“It’s because I fed them too much today; it has nothing to do with your care,” Daisy Zane said, and then told Arthur North, “Alright, nothing’s wrong. He’s afraid you’ll be mad. He asked me to make the call to test the waters.” <br/><br/>Arthur North looked at the courtyard and smiled, but his tone was obviously disappointed: “Oh, it was Charles who asked you to call.” Daisy Zane: “...Hang up.” <br/><br/>“Little Girl, wait a moment.” Arthur North stopped her. <br/><br/>“Hmm?” <br/><br/>Arthur North swallowed the words on the tip of his tongue, thinking it would be better to speak in person. In a gentle voice, he said, “Can I stay at your place tonight?” <br/><br/>Daisy Zane paused for a moment, then asked, “How come? Have you been kicked out of your home?” <br/><br/>Arthur North sounded somewhat pitiful, “What if I said yes?” <br/><br/>“That’s so pitiful...” Daisy Zane chuckled softly, her voice lazy, “I can rent you a room.” <br/><br/>Arthur North: <br/><br/>“Come over and we’ll discuss the rent.” <br/><br/>Arthur North immediately smiled: “Alright..”\t\t\t\t\t\t</div>", "images": {}, "success": true}