{"id": 220, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244373.html", "title": "Chapter 220 - 210: Hundred Demons Pavilion", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 220 - 210: Hundred Demons Pavilion</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 220: Chapter 210: Hundred Demons Pavilion <br/><br/>Translator: 549690339 <br/><br/>At first, Hundred Demons Pavilion was just a small gang. What set it apart from many other similar small gangs was a pair of siblings who were highly skilled in fighting and quite ruthless. <br/><br/>These siblings were none other than Black and Logan, who are now in the Hundred Demons Pavilion. <br/><br/>There were many small gangs, but the top ones were always a select few. <br/><br/>The siblings, Luke and Logan, had a strong momentum at the time and were very capable in leading their gang. <br/><br/>From the age of 15 or 16, the siblings relied on each other and slowly struggled for over ten years... <br/><br/>Regardless of what kind of powers approached them, they never accepted any offers. <br/><br/>Despite the oppression from various forces, they never gave up. If they won, they gained fame again, and if they lost, as long as they were still alive, they would regroup and fight again. <br/><br/>In any case, it was impossible for them to serve under anyone else. <br/><br/>Just when everyone thought that the siblings would eventually establish themselves among the major powers in the world... <br/><br/>The Hundred Demons Pavilion suddenly appeared in everyone’s sight. <br/><br/>And the two great generals under the command of the Ghost King of the Hundred Demons Pavilion were none other than the brother and sister duo who would never submit to anyone in all those years. <br/><br/>No one knew what had happened, and now there were too many versions of the story about them in circulation. <br/><br/>Nobody knew which version was true. <br/><br/>Most importantly, the Hundred Demons Pavilion, within a year of its establishment, began sending out challenges to various countries. <br/><br/>And they never lost. <br/><br/>The reputation of Hundred Demons Pavilion in various countries soared to the point of being feared by others. <br/><br/>Over the course of two years, the power of the Hundred Demons Pavilion infiltrated all aspects of life in various countries, attracting talented individuals. <br/><br/>You never knew if the top talents around you might secretly be members of the Hundred Demons Pavilion. <br/><br/>As for the Ghost King, he was even more mysterious; his gender unknown, and even whether he was human or ghost was uncertain in the whispers that circulated throughout the various nations. <br/><br/>Anyhow, according to the most widely-spread version, the Ghost King was eight feet tall, completely black in appearance, and could tear people apart with his bare hands. <br/><br/>“It seems that you don’t have a good impression of the Hundred Demons Pavilion,” said Daisy Zane. <br/><br/>“I wouldn’t say I have a bad impression,” replied Kevin Clark. “After all, being cautious is wise when dealing with someone who rose to power within two years, putting the Hundred Demons Pavilion among the top forces in the world.” <br/><br/>Daisy Zane raised an eyebrow slightly. <br/><br/>“What if the Ghost King is moody and kills people easily?” Kevin Clark tried to scare her. “If you stay at the manor house, wouldn’t you be in danger?” <br/><br/>“Do you think I can’t defeat him?’} <br/><br/>Daisy Zane raised her hand and smacked James on the head, “Stop talking nonsense.” <br/><br/>James shrank his neck and didn’t dare to speak anymore. “Where else did you get hurt?” Daisy Zane asked, sipping water. <br/><br/>“Just the wrist.” Liana leaned against the sofa. <br/><br/>Daisy Zane pinched her shoulder: “Don’t worry, I can’t beat him either.” <br/><br/>Not only did this not reassure Liana, but it made her more worried. She glanced at the kitchen and whispered, “Big Boss! You can’t beat him either! You can’t beat him!” <br/><br/>“You can’t marry this kind of man. If you marry him, you’ll be bullied!” Liana said, “Look at his cunning face; he doesn’t seem honest at all. And you can’t even beat him; you’ll be taken advantage of. No, I don’t agree with this marriage.” <br/><br/>“As if it’s up to you to agree.” James mumbled quietly. <br/><br/>“Why shouldn’t it be?!” Liana raised her leg and kicked him, “Just because the <br/><br/>Big Boss is protecting you, doesn’t mean I won’t hit you.” <br/><br/>“Sorry, but you can’t beat me right now.” <br/><br/>“Huh!” Liana sneered, “I can beat you, and I will beat you! Let’s go to the martial arts arena right now.” <br/><br/>“It’s too sunny now, if you want to go, go by yourself...” <br/><br/>Ignoring their conversation, Daisy Zane turned around and went to the kitchen to check on Kevin Clark. <br/><br/>Even in the kitchen, Third Master Clark’s demeanor didn’t diminish in the slightest. His ancient and elegant air added a touch of refinement to the kitchen. <br/><br/>Seeing her, Kevin Clark smiled first: “Come here.” <br/><br/>Daisy Zane put her hands in her pants pockets and walked to his side in a few steps. <br/><br/>Without moving his hand, Kevin lowered his head and touched his forehead to hers: “No more fever.’ <br/><br/>Daisy Zane didn’t care much about her fever and didn’t even know when it occurred. She looked at the glutinous rice balls on the side. “I saw them in the fridge, so I cooked them. Want to eat?” <br/><br/>“Yeah.” <br/><br/>Kevin Clark served her a bowl. Daisy Zane held the bowl with one hand and the spoon with the other, eating the glutinous rice balls, standing beside him, watching his hands work. <br/><br/>“Go to the restaurant. It’ll be ready soon.” <br/><br/>“No need.” Daisy Zane blew on a glutinous rice ball and put it in her mouth, “Are you going back home?” <br/><br/>“You go back first,” Kevin Clark said, “I’ll wrap things up here and return in a couple of days.” <br/><br/>Daisy Zane leisurely chewed on the glutinous rice ball, nodding her head. <br/><br/>“I don’t plan on bringing these people back to our country,” Kevin Clark continued, “but as for Robert Kirsten... Wilton Edwards. <br/><br/>“No,” Daisy Zane very decisively refused. <br/><br/>“Alright, I understand..”\t\t\t\t\t\t</div>", "images": {}, "success": true}