{"id": 226, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244397.html", "title": "Chapter 226 - 216: This Is Plagiarism!", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 226 - 216: This Is Plagiarism!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 226: Chapter 216: This is Plagiarism! The source of this content nov(el)bi((n))<br/><br/>Translator: 549690339 <br/><br/>At the end of August, the weather was still sweltering, the sun released energy as if it had been injected with a stimulant. The cicadas on the trees seemed to be fighting the heat with their loud and clear singing. <br/><br/>Zane still hadn’t found a satisfactory script. <br/><br/>So Daisy Zane didn’t have a job for the time being. <br/><br/>She spent her days either drawing design drafts or in the laboratory. <br/><br/>As a result, she was photographed twice at Imperial Capital University. <br/><br/>Someone uploaded the photos online. Since it was uploaded by an individual and didn’t reveal any sensitive information, the matter was not dealt with. <br/><br/>However, being photographed at Imperial Capital University did create a bit of controversy online. <br/><br/>Most of the comments were positive. But there were always some who seemed unable to bear anyone’s success. <br/><br/>Some accused her of trying to ride on the coattails of Imperial Capital University. <br/><br/>Others said that someone uneducated like her going to such a place tarnished the sacred ground of the school. <br/><br/>There were even those who claimed she went to Imperial Capital University for a staged shoot, deliberately allowing herself to be photographed. <br/><br/>And some even said that going to Imperial Capital University couldn’t wash away her ignorant and impoverished aura. <br/><br/>In short, it was all very negative and toxic. <br/><br/>Daisy Zane made no response to these online comments and told Zane and John Anderson not to bother with it either. <br/><br/>Her attitude towards these online remarks was to ignore them. <br/><br/>Otherwise, the more she clarified, the more they would be spurred on. <br/><br/>Ignoring them meant this matter would eventually die down. <br/><br/>Additionally, Daisy Zane went to Spotlight a few times to prepare for the concept release conference, which eventually was scheduled for August 28th. <br/><br/>On the 29th, there would be the autumn/winter haute couture fashion show for Cloud Clothing and Rainbow Skirts. <br/><br/>Director Nash had also approached her a few times for a variety show about going to school, which Daisy Zane declined too. <br/><br/>Since there was no script and no show to film, there was no need to involve Billy Allen. Daisy Zane gradually started to conceive a new script. <br/><br/>So, she was quite busy during this period and had less time to sleep. <br/><br/>Daisy Zane didn’t attend the concept release conference at Spotlight on the morning of the 28th, and she didn’t even pay attention to it. <br/><br/>She didn’t sleep the night before and spent the entire night writing the script, only going to bed after daybreak. When she woke up, it was already 10 in the morning, and the conference had been going on for half an hour. <br/><br/>Although she didn’t pay attention to the conference, she saw the live broadcast of it on the living room TV after she finished washing up and went downstairs. <br/><br/>There were many people at the scene, including not only domestic reporters, but also some foreign ones. <br/><br/>Kevin Clark, Allonzo Hobson, Juan Wright, and Michael Jackson were all there, too. <br/><br/>She didn’t know when they had arrived. <br/><br/>The few of them were sitting on the sofa watching the press conference on TV while also playing with Charles Amos. <br/><br/>Allonzo Hobson noticed Kevin’s glance at Daisy Zane, and quickly suggested, <br/><br/>“Let’s invite Daisy, too. I can introduce her to William.” <br/><br/>Kevin Clark: <br/><br/>“Why are you looking at me like that? Did I say something wrong?” Allonzo <br/><br/>Hobson noticed Kevin’s murderous gaze and shrank back, “Among all of us, Daisy hasn’t met William yet. Aren’t you going to introduce them to each other?” <br/><br/>Hearing his words, Daisy Zane casually replied without looking up, “I have something to do tonight, so I won’t go.” <br/><br/>Kevin Clark suddenly relaxed. <br/><br/>Allonzo Hobson hadn’t caught the main point yet, and continued, “Daisy, are you sure you don’t want to meet him? William Lane doesn’t come to Imperial Capital often. This time he came back because of his sister’s school matters, and we don’t know when we can see him again.” <br/><br/>Kevin Clark kicked Allonzo slightly. <br/><br/>Allonzo Hobson found it inexplicable and moved closer to Daisy for her protection after looking at Kevin. <br/><br/>“Is Olivia Lane going to school?” <br/><br/>“Yeah,” Allonzo replied, “William is definitely a sister-obsessed patient. He insisted on coming back to personally send his sister to school, even though it’s just high school, and their parents could have done it.” <br/><br/>Daisy Zane raised her eyebrows slightly, “After all, she’s the little princess of the Lane Family.” <br/><br/>“More like the ancestor of the Lane Family.” <br/><br/>“Which school?” Daisy asked casually while typing on the keyboard. <br/><br/>“I think it’s Gathering Joy Private.” Allonzo said, “Imperial Capital Royal Private High School.” <br/><br/>Daisy Zane’s hand paused on the keyboard. The variety show that Director Nash mentioned also took place in this school. <br/><br/>“I don’t know if he’ll be able to graduate smoothly this time,” Allonzo said while weighing an apple in his hand, “Year after year, I’m worried about William <br/><br/>Lane.” <br/><br/>Daisy Zane stared at the computer screen and suddenly zoned out. <br/><br/>But Allonzo’s sudden shout brought her back. <br/><br/>She looked up to see Allonzo pointing at the TV, exclaiming, “Daisy, look, look, look! This necklace, isn’t it the same as the one in your painting book?” <br/><br/>Hearing this, the people in the living room all turned to look at the TV. <br/><br/>The press conference was introducing the necklace of the Grain Rain Festival, Rainy Grain. <br/><br/>The necklace consisted of two layers, the upper layer being diamond raindrops gradually decreasing in size from the center. <br/><br/>The lower layer displayed tender sprouts of grain. <br/><br/>Although it was not exactly the same as the one in the painting book, the design concept was the same. <br/><br/>After watching the necklace on TV, Kevin Clark looked at Daisy Zane. <br/><br/>Allonzo Hobson was still ranting, “This must be plagiarism! The designer is Clayson Ninevara! The chief designer of Spotlight! What a chief! He actually plagiarized!” <br/><br/>Daisy Zane: . <br/><br/>Charles Amos looked up at Allonzo Hobson, whose face was flushed with anger, then shook his head helplessly..\t\t\t\t\t\t</div>", "images": {}, "success": true}