{"id": 229, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244409.html", "title": "Chapter 229 - 219 Press Conference (1)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 229 - 219 Press Conference (1)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 229: Chapter 219 Press Conference (1) <br/><br/>Translator: 549690339 <br/><br/>After Dawson Hill got divorced, her parents didn’t return to the abroad, instead they stayed domestic to help her look after her child. <br/><br/>Without her husband’s mischief and her child’s ties, Dawson Hill had more time to invest in work. <br/><br/>Especially with an artist like Daisy Zane working under her. <br/><br/>In the entertainment industry, Flynn Ninevara’s status was as good as gold. <br/><br/>Everyone in the industry would jump at the chance to form connections with Ninevara. Being Ninevara’s agent meant that resources would naturally be shared with her other artists. <br/><br/>So once Dawson Hill started focusing on her work, her workload increased substantially. <br/><br/>She also intended to nurture Anisa Cooper, letting her handle some tasks when Daisy Zane wasn’t working. <br/><br/>Considering many people were present today, she decided to introduce Anisa Cooper to some people. <br/><br/>“Sister Emily, Amelia Miles also came.” Anisa Cooper saw Amelia Miles entering hand in hand with John Anderson, and whispered it into Dawson Hill’s ear. <br/><br/>Dawson Hill also looked towards the entrance. <br/><br/>She just happened to catch sight of Amelia Miles wearing a short light pink dress, hair flowing freely. She had her arm linked with John Anderson’s and was waving to others with her free hand, a sweet smile on her face. <br/><br/>Upon seeing her, Dawson Hill rolled her eyes and looked elsewhere: “Petty.” <br/><br/>Anisa Cooper chuckled and said, “Many people came today. A lot of them also brought their wives.” <br/><br/>Dawson Hill took two drinks from the side and handed one to Anisa Cooper: “Just within this hall, societal classes are thoroughly divided.” <br/><br/>As she spoke, she nodded her chin towards Anisa Cooper to look: “Look, that group. They are all rich housewives. That circle over there, they are a level below. That place, they are all involved in arts. <br/><br/>Each community has its own unique characteristics, it’s clear as day to see who’s high and who’s low.” <br/><br/>Following her introduction, Anisa Cooper carefully observed. <br/><br/>“Who’s that?” Anisa Cooper suddenly noticed a very active lady, who was extremely enthusiastic with everyone, flitting between the various Madams. <br/><br/>Having observed Madam, Dawson Hill thought for a moment and replied: “She belongs to the Davis Residence of Truro City. That’s Liam Davis’s mother. Liam Davis was pestering Lucia for quite some time.” <br/><br/>“Ah, it’s her.” Anisa Cooper said, “She even came to the film set to look for Lucia.” <br/><br/>“Really? What did she say?” <br/><br/>“I’m not sure, Lucia didn’t let me follow.” <br/><br/>Dawson Hill took another look at her, then didn’t say anything else: “Let’s go, I’ll introduce you to a director.” <br/><br/>“Alright.’ <br/><br/>After Harton Clark and Daisy Zane finished a round of chess, the two looked around. <br/><br/>Some people came over to greet Harton Clark, coincidentally stopping by an ancient guqin. Daisy Zane’s attention was quickly drawn to it. <br/><br/>After staring at it for a while, she unconsciously plucked one of the strings. <br/><br/>Later, Daisy Zane met many acquaintances at the conference. Some were from the same drama crew and had worked together, and some came to greet her because of her identity as Flynn Ninevara. <br/><br/>Daisy Zane could seem unapproachable, rejecting people harshly, but she responded politely to everyone who spoke to her, which was why she was constantly being approached. <br/><br/>If she caught someone’s eye and was cast in a role, all the greetings would not have been in vain. <br/><br/>“Nana.” Director Morris approached, “Been looking everywhere for you.” <br/><br/>“You were looking for me?” <br/><br/>“Yes.” <br/><br/>“Oh. ” <br/><br/>“What’s wrong?” Director Morris asked. <br/><br/>“I just saw you hurriedly passing by me twice.” Daisy Zane finished her statement and added: “I understand. As we age, our vision isn’t as good.” <br/><br/>Director Morris: <br/><br/>Michael Jackson and Juan Wright both laughed. <br/><br/>Director Morris glanced at the two of them and asked, “What are you having me here for?” <br/><br/>“What’s the matter?” Daisy Zane handed him a drink, “Calm down.” <br/><br/>“I’m annoyed.” Director Morris clinked glasses with her, “I saw that Billy Allen again. He’s over there laughing and joking around with a bunch of foreigners.” <br/><br/>Daisy Zane laughed softly: “So he really came?” <br/><br/>“Yes.” Director Morris took another swig of his drink, then reacted, “Wait, what do you mean? You knew he was coming?” <br/><br/>“Just guessed.” <br/><br/>“Guessed?” Director Morris was a bit confused, “Why would you guess that?” Daisy Zane smiled again, her expression mysterious. <br/><br/>Director Morris’s mouth twitched. No matter how he looked at it, he thought her smile was a bit frightening. <br/><br/>Director Morris rarely attended these kinds of events and didn’t particularly enjoy them either. He was a bit eccentric, and when he didn’t feel like talking to people, he ignored everyone. <br/><br/>So, he just stuck close to Daisy Zane the entire time. <br/><br/>The two of them got bored and started playing chess together. Director Morris suffered defeat after defeat, the quickest game ending in checkmate in less than 5 minutes. <br/><br/>Director Morris was extremely unwilling to accept his loss and was about to start another game when Billy Allen suddenly approached them. <br/><br/>“Hi, Director Morris.’ <br/><br/>Director Morris glanced at him but didn’t respond, choosing instead to continue setting up the chessboard. <br/><br/>Daisy Zane was sitting on a bench, leisurely supporting her chin with one hand and arranging the chess pieces with the other. <br/><br/>She sat upright with her legs crossed. Her body was slightly off-center, so her slender waist formed a pleasing curve. <br/><br/>She glanced at Director Morris and upon seeing his reaction, she raised an eyebrow. Then, she glanced at Billy Allen. <br/><br/>Billy Allen happened to look her way just then, and their eyes met. Billy Allen immediately greeted her with a smile.\t\t\t\t\t\t</div>", "images": {}, "success": true}