{"id": 222, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244381.html", "title": "Chapter 222 - 212", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 222 - 212</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 222: Chapter 212 <br/><br/>Translator: 549690339 <br/><br/>The last time Morris gave her a call, he expressed his admiration, even had her watch so many of Billy’s films. Now he was starting to swear. <br/><br/>Daisy Zane went upstairs and standing in the corridor, asked, “What happened?” <br/><br/>“I attended a movie event this morning and saw him.” Morris said angrily. <br/><br/>“And then?” <br/><br/>“Then... I thought since I ran into him, we could talk. Guess what the hell he said?” <br/><br/>Daisy didn’t make a sound. He certainly hadn’t said anything nice, otherwise, Morris wouldn’t be this upset. <br/><br/>“He said the quality of domestic films is too poor, the production, storyline, and plot are all unacceptable, so he won’t shoot domestic films. Damn! It pissed me off!” <br/><br/>Daisy slightly raised her eyebrows, not saying a word. <br/><br/>“What’s even more annoying is, I introduced him to my production team, my status, even your identity as a screenwriter, and the various major awards you’ve won.” Morris’ voice was trembling with anger, “But then, you know what he said? He said ‘so what?”‘ <br/><br/>Daisy chuckled lightly, “He is after all an international Best Actor”. <br/><br/>“A few years ago, our movie won a big award internationally. Did I act stuck-up? Did I brag? Did I have my nose in the air?” Morris continued, “He is bullying people in my territory”. <br/><br/>Standing upstairs, Daisy suddenly saw the fish that were being raised in the living room below. <br/><br/>They must have been sent over by Kevin Clark. <br/><br/>Seeing the goldfish lifted Daisy’s spirits, and she continued to listen to Morris’ rant. <br/><br/>“I hate those kinds of people the most, those who hold foreign things in high esteem.” Morris said, “If he thinks that the domestic film industry is not doing well, he should save it. What does he mean by disparaging it? He just talks down to people. Damn it! I don’t want to work with him anymore! I’d rather work with anybody else but him! There will come a time when he will be crying and begging to come back, lets see who dares to use him then.” <br/><br/>Daisy went back downstairs intending to visit the fish, “Since he looks down on domestic films, why did he come back all of a sudden?” <br/><br/>“I heard he wanted to meet a clothing brand designer.” Morris heard someone mention it during the event, but didn’t pay much attention, “I think he came to discuss some kind of collaboration. <br/><br/>Daisy came in front of the fish tank, took some fish food, and sprinkled it into the tank, “Is that so?” <br/><br/>“That’s what I heard. That’s not important. The important thing is...” Morris said, “He’ll never take you seriously. Don’t tell me you’re not upset?” <br/><br/>“Why should I be upset?” Daisy sprinkled a little more fish food into the tank, “As you’ve said, there will be a time when he will be crying and begging.” Morris let out a long sigh, “I can’t wait to see him begging and weeping.” <br/><br/>“You will.” <br/><br/>“What will?” <br/><br/>“Nothing. I’ll hang up now.” <br/><br/>Daisy hung up the phone. Seeing that the fish in the tank were happily eating, she sprinkled a bit more food in. Visit no(v)eLb(i)n.com for the best novel reading experience<br/><br/>Kevin Clark raised his eyebrow; his parents were not the types to enjoy TV series. What was going on today? Everyone seemed glued to the television. <br/><br/>Moreover, there hadn’t been any dialogue in the TV series from the moment he entered. There was only intense background music. <br/><br/>“What are you watching that’s got you so hooked?” Kevin Clark asked as he made his way to an unoccupied single sofa. <br/><br/>Just then, the screen showed a close-up of the female actor. <br/><br/>She was by a window, holding a sniper rifle, watching the situation on the street outside through the rifle scope. <br/><br/>The lens was almost up close to her face, and on the big TV screen, Daisy Zane’s face was portrayed vividly. <br/><br/>The cold stunning beauty, the sharp, murderous aura surrounding her, as well as the relentless determination in her eyes. <br/><br/>Even having seen it many times, Kevin Clark was once again amazed by this stunning beauty with a strong impact. Then, he raised his eyebrows, and the corner of his mouth even lifted slightly. <br/><br/>Hugo Clark, Hardy Clark, and his senior all glanced at Kevin Clark’s reaction, but not one of them dared to speak out. <br/><br/>“Why the sudden interest in TV dramas?” Kevin Clark asked. <br/><br/>“Quiet,” said Tom Wayne. <br/><br/>Kevin Clark:” <br/><br/>Not until the Daisy Zane on the screen had finished off several people on the street and put away her sniper rifle, did Tom Wayne look at his son and then speak, “This show is called ‘Fall of the Quince’, and it’s really good.” <br/><br/>Kevin Clark didn’t say anything as he looked at the TV. <br/><br/>Hugo Clark kept a straight face and couldn’t help but complain in his heart. <br/><br/>There was no need for the introduction since his Third Uncle was literally <br/><br/>watching the filming. <br/><br/>“Yes, it’s very well made,” Dupont also commented, “The lead actress is obviously very professional. Her posture when holding the gun is very standard. The fight scenes are also well executed. It’s not like some TV dramas, where anything goes, and they only focus on the image of the actors.” <br/><br/>“Grandpa, she’s supposed to be the supporting female,” Hardy Clark pointed out. <br/><br/>“The supporting female? But she seems like the lead female to me,” commented Dupont. <br/><br/>“Are you biased because you think she’s pretty?” Tom Wayne interjected. <br/><br/>“I’m only saying that she’s good at acting, and who could be prettier than you?” Dupont always knew how to save himself. <br/><br/>Everyone laughed a bit. From their reactions, it was clear that they were used to such exchanges. <br/><br/>Tom Wayne shot a glance at Dupont and then said, “But indeed, she’s beautiful, and so is her temperament.” <br/><br/>Unconsciously, a smile appeared at the corner of Kevin Clark’s mouth. <br/><br/>Then he heard Tom Wayne continuing: “This is also the girl I bumped into in the restroom that time. I even got her contact information because I wanted to introduce her to Hugo.. Don’t they make a perfect match?”\t\t\t\t\t\t</div>", "images": {}, "success": true}