{"id": 238, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14248135.html", "title": "Chapter 238 - 227: Sharp-Tongued_2", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 238 - 227: Sharp-Tongued_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 238: Chapter 227: Sharp-tongued_2 <br/><br/>Translator: 549690339 <br/><br/>This was the first time. He desperately wanted to kill the man in front of him, but no deal meant his end. The wedding date was already set, he couldn’t afford to mess it up now. So, he had to swallow his pride. <br/><br/>Daisy Zane glanced at a chair not too far away, found it somewhat distant, then turned her attention back to him. ReAd latest chapters at novelhall.com Only<br/><br/>She was especially good at hitting where it hurts. <br/><br/>Obsessed with face-saving and flaunting his power. Well, she would just grind his dignity into dust. <br/><br/>“I remember Best Actor Allen saying that he doesn’t value domestic films.” Billy Allen swallowed, saying nothing. <br/><br/>Daisy Zane said, “Actually, I wasn’t just spouting off last night, I genuinely don’t rate you as a Best Actor. You think domestic films winning awards is to console their efforts. And I feel the same, that you winning the Best Actor award is to console your unpaid acting efforts in so many films.” <br/><br/>Billy Allen’s fists tightened until his knuckles were white. The muscles on his face also tensed to stiffness. <br/><br/>Meanwhile, Joseph Allen walked toward the chair Daisy Zane was looking at. <br/><br/>“The film that you won the award for, I didn’t find particularly impressive either,” Daisy Zane glanced at Joseph Allen and continued in a gentle tone, “It’s true, the production quality of domestic films has been somewhat subpar in past years. But recently, it’s no worse than the international ones. In fact, I think it’s even better.” <br/><br/>“That’s what you say,” Joseph Allen squeezed out these words through gritted teeth. <br/><br/>In contrast, Morris was having a field day. Suddenly, the air of the conference hall seemed sweetly fragrant. <br/><br/>Joseph Allen carried the chair over and placed it behind Daisy Zane. <br/><br/>Daisy Zane sat down directly, arranging her skirt as she spoke, “Everyone has different tastes, ideas, hobbies... Everyone has the right to define ‘beauty’. <br/><br/>There is no need to belittle others just because you don’t like something. People who...” <br/><br/>Daisy Zane paused, looked up at him, and saw right into his heart, “People like that are genuinely awful.” <br/><br/>Hugo Clark, hearing her words, suddenly had a change of heart about her. Two words floated into his mind. Strong and gentle. <br/><br/>Strong in her ability to remain unfazed by everything. <br/><br/>And gentle in understanding respect for differences. <br/><br/>Also, she was quite the smart mouth. <br/><br/>This seemingly cold person with few words, really knew how to hurl a stinger when confronting people. <br/><br/>Not only was her fighting skill good, but her witty retorts were also sharp. <br/><br/>“Absolutely,” Morris said, “I feel like my Governor Vessel and Conception Vessel meridians are about to open up.” <br/><br/>“Mm. Mainly because you’re older. I was afraid venting your anger would cause health problems.” <br/><br/>“You...” <br/><br/>Just as Kevin Clark and the others approached, Morris didn’t continue. Allonzo Hobson came over, paid homage to Daisy Zane with a fist and palm salute, “Respect to you, Lady Catherine.” <br/><br/>Daisy Zane gave a faint smile. <br/><br/>Hugo Clark nodded as a greeting. <br/><br/>Kevin Clark walked up to Daisy Zane, raised an eyebrow and said, “Can I get a discount when I buy clothes next time?” <br/><br/>Daisy Zane pondered for a moment, and said flatly, “Yes, 12% off.” <br/><br/>Kevin Clark ruffled this mischief girl’s hair, then turned to look at Joseph <br/><br/>Allen. <br/><br/>Joseph Allen smiled gently, “Third Master.” <br/><br/>Of course, he knew that they were together. Austin Allen told him when he was in Truro City. <br/><br/>To him, as long as Daisy Zane is happy, it doesn’t matter who she marries. He didn’t harbor much hope. He just hoped that she would be safe, happy, and that he could see her often. <br/><br/>Kevin Clark responded softly. <br/><br/>Joseph Allen said, “I booked a private booth upstairs, let’s have dinner and chat there.” <br/><br/>“Okay,” Morris said, “I need a couple of drinks to celebrate.” <br/><br/>As the group was about to head upstairs, Daisy Zane turned her gaze to the direction Billy Allen left and said, “You guys go first, I need to use the restroom.” <br/><br/>Joseph Allen looked at her, wanting to say something but decided to hold it in and look at Kevin Clark instead. <br/><br/>Kevin Clark looked back at Joseph Allen, and then said, “I’ll go with you.” “No need.” Daisy Zane put her hand in her dress pocket and said, “You guys go first. <br/><br/>Kevin Clark looked at her profile and pondered for a while, “Okay. Five minutes?” <br/><br/>Daisy Zane raised her eyebrow, “Can.” <br/><br/>“?????” <br/><br/>Morris and the others looked at each other, not catching what the two were communicating in front of them..\t\t\t\t\t\t</div>", "images": {}, "success": true}