{"id": 232, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244421.html", "title": "Chapter 232 - 222 Press Conference (4)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 232 - 222 Press Conference (4)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 232: Chapter 222 Press Conference (4) <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane really did make a phone call to Juan Wright, asking him to find an excuse to get Mrs. Davis out of the conference hall. One reason was that she was genuinely upset, and the other was to prevent Mrs. Davis from finding <br/><br/>Olivia Lane. <br/><br/>But what she didn’t expect was that Mrs. Davis ran into Olivia Lane just as she left. <br/><br/>Daisy Zane was on the phone when she heard the voices of the two. <br/><br/>Instead of going out, she listened in the restroom for a while. <br/><br/>Outside the restroom, not far away. <br/><br/>Mrs. Davis looked at Olivia Lane, her eyes sparkling, and her face full of kindly smiles: “Miss Lane.” <br/><br/>Olivia Lane was about to go to the restroom when she was suddenly stopped by her and hesitated. But seeing her full of smiles, she shuddered from the depths of her heart: “You are... <br/><br/>At the moment when she was stopped, the Lanes who had been following her not far away all looked at Mrs. Davis. Like a falcon staring at its prey, they watched her every move closely. <br/><br/>“I am from Johnson Family in Truro City, and Davis Corporation.” With a smile on her face, Mrs. Davis confidently introduced herself, “My son is Liam Davis, now the person in charge of Davis Corporation....” <br/><br/>While listening to her introduction, Olivia Lane interrupted her: “Why are you telling me all this?” <br/><br/>Mrs. Davis was stunned for a moment and then laughed: “I saw Miss Lane twice at the conference hall just now. I think Miss Lane is very pleasant to the eye, and I particularly like Miss Lane.” <br/><br/>“You’d better not like me.” Olivia Lane said bluntly, “You scare me.” <br/><br/>Listening to these words in the restroom, Daisy Zane’s mouth lightly lifted. <br/><br/>.. Miss Lane...” <br/><br/>“Don’t call me.” Olivia Lane interrupted her again, “If you want to ask my family for help, don’t ask me. I don’t care about family matters. If you want to find a partner for your son, don’t bother with me either. I’m not interested.” <br/><br/>After saying that, Olivia Lane was about to go to the restroom, but Mrs. Davis stopped her again. <br/><br/>Olivia Lane quickly avoided her hand, grumpily stomping her foot and hurriedly saying, “Get out of my way!” <br/><br/>“Miss Lane...” <br/><br/>The Lanes immediately appeared and stopped her. <br/><br/>Upon seeing them, Olivia Lane quickly entered the restroom. <br/><br/>Mrs. Davis was still looking at Olivia Lane’s retreating figure when Juan Wright came over. He glanced at the Lanes and then looked at Mrs. Davis: “From the Johnson Family in Truro City, right?” <br/><br/>“You are...” <br/><br/>Up close, Daisy couldn’t help but be drawn to the young girl’s features. Even Olivia’s defiance and willfulness seemed cute to her. <br/><br/>Raising an eyebrow, she asked, “Can you read the four words written on my face?” <br/><br/>“What?” Olivia was perplexed, “What words?” “Loves to meddle,” Daisy Zane said softly. <br/><br/>Olivia Lane: <br/><br/>Daisy Zane raised her hand and brushed Olivia’s bangs, saying, “The Johnson family in Truro City is not the best place to be. Stay away from them.” With that, she left the restroom. <br/><br/>Olivia Lane was left dumbfounded in the restroom for a moment before stomping her foot in anger. <br/><br/>She wasn’t a child, and she didn’t understand why everyone was so intent on meddling with her. <br/><br/>As Daisy Zane emerged from the restroom, Kevin Clark was waiting by the entrance. <br/><br/>“Why so happy?” Kevin asked. <br/><br/>“Nothing, just teasing a little girl,” Daisy’s eyes crinkled into a smile. <br/><br/>Seeing her happy, Kevin also smiled and then took her hand, saying, “Let’s go. The show has already begun.” <br/><br/>“Hmm.” <br/><br/>As the two left, Hugo Clark turned the corner. <br/><br/>He caught Olivia Lane just as she was stepping out of the restroom. <br/><br/>Olivia was startled, her entire body shook: “Bro-Brother Enamel. You... you’re still here.” <br/><br/>She had made up an excuse to ditch him earlier, and now he’d caught up to her again. <br/><br/>“Where else would I be?” Hugo asked. <br/><br/>Olivia forced a smile. She didn’t care where he went as long as he wasn’t around scaring her. <br/><br/>His serious face, with few expressions, was just as intimidating as his Third Uncle’s menacing presence. <br/><br/>Olivia smiled but didn’t say anything. <br/><br/>Hugo Clark looked at her for two seconds, noticing that she was a little afraid of him, then spoke in a gentler tone, “The show has begun. Want to watch?” <br/><br/>Olivia looked around and saw that there weren’t many people left. <br/><br/>“Yes, let’s go.” <br/><br/>“Alright then.” <br/><br/>“Okay.” <br/><br/>Olivia slowly followed behind him, walking together to the conference hall....\t\t\t\t\t\t</div>", "images": {}, "success": true}