{"id": 230, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244413.html", "title": "Chapter 230 - 220 Press Conference (2)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 230 - 220 Press Conference (2)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 230: Chapter 220 Press Conference (2) <br/><br/>Translator: 549690339 <br/><br/>Mu Ying’s smile was both eager and enthusiastic, with a hint of cunning and greed hidden deep in his eyes. <br/><br/>A decent appearance, but not very likeable. <br/><br/>At least if he had developed his career in China, he might not have been as popular as he is now. <br/><br/>Mu Ying did not pay much attention to the attitude of Shang Guan, and went straight to look at Daisy Zane. He placed the wine in his hand beside the chessboard: “This beautiful lady, can we get to know each other?” <br/><br/>Shang Guan suddenly raised his head to look at Mu Ying, his expression much more intense than just now. <br/><br/>He wished he could tear him apart with his eyes alone. <br/><br/>Michael Jackson and Juan Wright, who had been watching the comings and goings of people near Daisy Zane, stood up straight when they saw Mu Ying put the wine down beside the chessboard. <br/><br/>Both looked ready to slaughter anyone who dared to covet their Third Master’s woman. Eyes were not needed if they got in the way. <br/><br/>Even George Dunn, who was chatting not far away, had his eyes on Mu Ying. He was closely watching Mu Ying’s every move, as if he was ready to pin him down to the ground at any moment. <br/><br/>Daisy Zane looked at him, leaning on her chin, and sized him up and down with her eyes. <br/><br/>Seeing her scrutinizing gaze, Mu Ying’s face showed a very confident smile and he straightened his back. In an instant, the muscles under his clothes propped up his suit. <br/><br/>Seeing him like this, Juan Wright practically rolled his eyes and almost threw up the meal from the night before. <br/><br/>Daisy Zane’s expression didn’t change at all. She finished looking him over, withdrew her gaze, and placed the chess piece she was holding onto the chessboard. <br/><br/>Mu Ying’s gaze swept across her waist, and seeing that she didn’t care about him, he chuckled, “This lady, my name is Billy Allen. And yours?” <br/><br/>Daisy Zane did not raise her head, saying: “Flynn Ninevara.” <br/><br/>“Flynn?”] Mu Ying paused for a moment. He looked at Shang Guan and then at Daisy Zane, and said, “Are you the screenwriter?” <br/><br/>“Mm-hmm.” Daisy Zane replied softly. <br/><br/>Mu Ying laughed again, “Then you must have heard of me?” <br/><br/>“What?!”] Mu Ying seemed to have heard the biggest joke in the world. “You say my acting skills don’t pass? I am an internationally renowned Best Actor, and you say I don’t pass.” <br/><br/>“Yes, that’s right.” Daisy Zane said calmly, “Mr. Mu doesn’t need to repeat it.” <br/><br/>Mu Ying sneered again, licking his lips: “It is precisely because of your ignorance and stupidity that the domestic film industry remains stagnant. It’s really sad! A great tragedy!” <br/><br/>“Since Mr. Mu thinks it’s such a tragedy, then why not return to China and save the domestic film industry?” George Dunn came over with a glass of wine, placing it beside the chessboard. He took the glass Mu Ying had left and forcibly shoved it back into his hand, “What’s with this disdainful attitude?” Mu Ying snorted coldly. <br/><br/>“Oh, right. Best Actor Mu doesn’t think much of domestic productions.” George Dunn continued, “Mu Ying is an international Best Actor.” <br/><br/>Mu Ying glanced at the group of people surrounding him, and finally let his eyes rest on Daisy Zane’s face. He sneered for a moment, “Such a beautiful shell, yet underneath lies a foolish, ignorant soul.” <br/><br/>“You’re fucking asking for death.” Juan Wright raised his arm, about to take action, but Daisy Zane stopped him in time. <br/><br/>Mu Ying took a step back, intending to say something else, but seeing the expressions on Juan Wright and the others’ faces, he swallowed his words and left directly. <br/><br/>“Teacher, so we’re just letting him get away with this?” <br/><br/>Daisy Zane picked up the wine, took a sip: “Being scolded by someone with such flawed thinking should be expected. If he praised me, I’d think he was insulting me. ” <br/><br/>Juan Wright opened his mouth, suddenly feeling that there was nothing wrong with what she had said. And for some reason, he wasn’t angry anymore. <br/><br/>Michael Jackson smiled softly in admiration of her strong psychological resilience. <br/><br/>When Kevin Clark went to visit his mother, he realized what Michael Jackson had meant by “Madam and them.” <br/><br/>His mother, his sister-in-law Wood, Hugo Clark, Hardy Clark, and Bonnie Maxwell were all there, along with two of his sister-in-law’s friends. <br/><br/>With so many people, he didn’t need to watch over them. Besides, Clark Family members were always with them. <br/><br/>So he greeted them briefly and left. <br/><br/>But as soon as he turned around, he received a call from Roy Madison, who asked him about Olivia Lane’s abduction by Henry Clark. <br/><br/>Kevin Clark knew that for someone like Roy Madison who regarded his sister as his life, he wouldn’t let the matter go until he had gotten to the bottom of it. <br/><br/>So he went outside to take the call, briefly explaining the situation to Roy Madison, along with his plan to use Roy’s knife to kill Henry Clark. <br/><br/>This conversation took up some time. <br/><br/>So much so, that he missed one after another “hero saving the damsel in distress” moment and lost opportunities to show off....\t\t\t\t\t\t</div>", "images": {}, "success": true}