{"id": 236, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14244437.html", "title": "Chapter 236 - 226: Shopie Easton", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 236 - 226: Shopie Easton</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 236: Chapter 226: Shopie Easton <br/><br/>Translator: 549690339 <br/><br/>Arthur North has always been confident in himself, especially in this circle. His status is always there, and he has never failed. <br/><br/>So he thinks that Flynn Ninevara’s not giving in is just playing hard to get. Updated from novelb(i)n.c(o)m<br/><br/>But the more she does this, the more interested he becomes in the person before him. <br/><br/>“Lady Catherine, if you think my proposal is good. I’ll see you in the hotel upstairs later,” Arthur North said, leaning in suggestively. <br/><br/>Daisy Zane looked at him and then smiled softly, “You came to China this time to meet Daisy’s designer to customize a wedding dress for your fiancée, right?” Arthur North’s smile at the corner of his mouth stiffened for a moment. <br/><br/>Daisy Zane stared into his eyes, seeing right through him: “I heard that your fiancée’s family is quite powerful abroad.” <br/><br/>Arthur North’s face changed drastically. <br/><br/>“She knows about your flings, right? Even if she doesn’t care...” Daisy Zane lowered her gaze, her fingertips twisting, “You say... what do you think those people in her family would do to you if they knew?” <br/><br/>As she was informed last time on the phone, Arthur North’s fiancée had quite a significant background abroad. <br/><br/>Arthur North has made quite a name for himself abroad, and anyone who deals with him would treat him with some respect. It is partly due to his fiancée’s family background. <br/><br/>According to her research, his fiancée liked Daisy’s designs. <br/><br/>This time Arthur North came to China mainly to ask Daisy to design their wedding dress. <br/><br/>But when he came to the conference hall today, she was guessing. She wasn’t sure when he intended to meet her. <br/><br/>“What do you want to do?” Arthur North suddenly lowered his voice, “Since you know her family is powerful, you better behave. I have many ways, but you... be careful not to pay with your life.” <br/><br/>Daisy Zane didn’t take his words to heart, she continued: “First, let’s not talk about your affairs abroad. This time... if the deal with Daisy doesn’t work out, what will happen when you go back?” <br/><br/>“How would you know it won’t work out?” Arthur North laughed, “You think everyone is as shortsighted as you. Do you know how influential I am?” <br/><br/>Daisy Zane suddenly laughed at his words, somewhat curious about how a man in his thirties could still think that the world would stop turning without him. <br/><br/>“Just wait and see how you lose a big opportunity yourself.” Arthur North’s tone was full of arrogance, “You better think about it, after rejecting me today, will <br/><br/>I let you continue in this circle? One word from me, and you’ll lose your job.’ <br/><br/>Daisy Zane raised her eyebrows, and the look in her eyes gradually grew colder. <br/><br/>Arthur North continued: “Of course, if you come crying to me for help later, I might be compassionate and give you a chance to live.” <br/><br/>Daisy Zane showed no emotion, looked up at the people in the conference hall, and glanced at the CCTV cameras throughout the hall. Then she took a step back, tilted her chin, and gestured in the direction of the restroom. <br/><br/>Arthur North laughed instantly, “So cooperative.” <br/><br/>Daisy Zane remained silent. Her beautiful phoenix eyes and upturned eyelashes turned icy cold. <br/><br/>“Cough, cough, cough...” Joseph Allen choked upon hearing her words. <br/><br/>The smile that always graced Austin Allen’s face suddenly froze, and his eyes also turned cold. <br/><br/>He indeed had a heart that could accommodate everything. But he had two bottom lines that nobody could cross. <br/><br/>One was his younger brother Joseph Allen, and the other was Daisy Zane. <br/><br/>Kevin Clark, who had just walked over, also heard her words. He stopped a little distance away, the anger in his eyes like a dark sky before a storm, exerting an oppressive force. <br/><br/>Hugo Clark and Alonzo Hobson behind him both glanced at him and then took a step away in perfect sync, fearing that Third Master’s anger would affect them as well. <br/><br/>“Cough...” Billy Allen’s face also stiffened for a moment, then he laughed and said, “I was just joking with Lady Catherine. Don’t take it seriously.” “So even Best Actor Allen makes such crude jokes,” Morris said. <br/><br/>“You...” <br/><br/>Austin Allen started laughing again, but this time his smile didn’t reach the bottom of his eyes: “Since it’s Best Actor Allen’s private matter, I shouldn’t interfere. <br/><br/>Morris heard this and clicked his tongue. Then he pulled Daisy Zane’s arm back a step, whispering, “What kind of lousy friends are you making? Let’s go home and ignore them. If I stay a bit longer, I won’t be able to help but curse here.” <br/><br/>Hill Dawson pulled his hand from Daisy Zane’s arm and said, “We only have some acquaintanceship. What do you expect him to do? Stand up and fight for her? Does Austin look like the type of person who would fight?” <br/><br/>“Lucia, let’s go back,” Anisa Cooper whispered, “I think none of them look like good people.” <br/><br/>But Daisy Zane didn’t move. <br/><br/>As for Billy Allen, he immediately laughed again, looking victoriously at Daisy Zane and even raising an eyebrow towards her. <br/><br/>He was just a step away from saying outright, “Look how many people want to butter up to me.” <br/><br/>“Mr. Allen, I’m still waiting for you to take me to see the Shopie Designer,” Billy Allen reminded Daisy Zane with a look. <br/><br/>It seemed like a displaying peacock, always showing off itself. <br/><br/>Austin Allen smiled and nodded, “Time is not early, let’s meet now.” <br/><br/>Joseph Allen listened quietly, inhaling a deep breath, waiting for the drama to unfold. <br/><br/>“Great,” Billy Allen said. <br/><br/>Austin looked at Billy Allen, then turned to Daisy Zane and said, “Lucia, come here.” <br/><br/>Kevin Clark’s sight fell on Austin Allen. <br/><br/>Meanwhile, Anisa Cooper pulled Daisy Zane’s arm, suspecting that Austin Allen wanted Lucia to do something bad. <br/><br/>Daisy Zane pinched her hand and let go of her arm. She went to Austin Allen’s side and looked at Billy Allen. <br/><br/>Close up, Austin Allen looked at Daisy Zane’s side profile and introduced her, “The founder and chief designer of Cloud Clothing and Rainbow Skirts, Sophie <br/><br/>Easton. Best Actor Allen, let’s meet..”\t\t\t\t\t\t</div>", "images": {}, "success": true}