{"id": 237, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14248134.html", "title": "Chapter 237 - 227: Sharp-Tongued", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 237 - 227: Sharp-Tongued</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 237: Chapter 227: Sharp-tongued <br/><br/>Translator: 549690339 <br/><br/>The conference hall was playing a very melodious song. <br/><br/>But after Joseph Allen finished speaking, the music in everyone’s ears suddenly drifted away. It’s as if the music and people were separated into two worlds. <br/><br/>Everything around them became increasingly unreal. <br/><br/>“Holy shit! Holy shit! Holy shit!” Xavier Dominic almost knelt down on the <br/><br/>spot, he found out about Daisy Zane’s two identities within just two days. <br/><br/>Clayson Ninevara... Shopie Easton... <br/><br/>Two domestic brands that have a foothold in the international market, and both have the same chief designer. <br/><br/>What the hell... <br/><br/>Xavier Dominic walked over to Kevin Clark, his voice floated, “Arthur, Arthur North, can you talk to Brook Sister and ask her not to scare me like this? I can’t take any more surprises; my heart is about to give out!” <br/><br/>Hugo Clark, on the other hand, doesn’t seem to have much of an expression, as usual, looking rather calm. He just glanced at his third uncle. <br/><br/>Kevin Clark’s eyebrows twitched slightly, and the look in his eyes deepened. <br/><br/>He had thought the little girl had something to do with Cloud Clothing and Rainbow Skirts but did not expect their relationship to be so big. <br/><br/>It wasn’t until Cloud Clothing and Rainbow Skirts’ third year of establishment that it gradually gained fame, and it was during that year, after gaining attention, that Joseph and Shopie became known as the founders. <br/><br/>But that was seven or eight years ago, how old was the little girl at that time? Based on the timeline, she should still be by Edward Kirsten’s side. <br/><br/>With this thought in mind, Kevin Clark sighed softly in his heart, feeling extremely annoyed. <br/><br/>It seemed like everyone else had met his little girl before he did, and he was the last to meet her. <br/><br/>“Lady Shopie...it’s all a misunderstanding.” <br/><br/>“Whether it’s a misunderstanding or not, I know it clearly in my heart.” <br/><br/>Seeing that she had made up her mind not to agree, Billy Allen looked at Joseph <br/><br/>Allen, “Mr. Allen...” <br/><br/>Joseph Allen caught his gaze and smiled, “Cloud Clothing and Rainbow Skirts’ decisions have always been up to Lucia.” <br/><br/>Kevin Clark narrowed his eyes. This guy...over thirty years old and still not married. <br/><br/>Billy Allen looked at Daisy Zane again, his pride and confidence completely gone. <br/><br/>He knew very well what it would mean if this deal fell through and he had to return home empty-handed. <br/><br/>He had promised repeatedly before coming that he would definitely close the deal. <br/><br/>“Best Actor Allen, aren’t you leaving?” <br/><br/>“Lady Catherine, I apologize for my rashness tonight.” Billy Allen, after careful consideration, clenched his fist and bowed slightly to Daisy Zane, “I’m sorry, please forgive me.” <br/><br/>Daisy Zane’s expression did not change at all, and her eyes were tinged with an indelible frost, “Aren’t you leaving?” <br/><br/>Seeing that she was not wavering at all, Billy Allen’s face began to turn pale, “Lady Catherine, if you’re willing, I can act in your script for zero income.” “You’re not worthy!” Morris said with his arms crossed. <br/><br/>Billy Allen didn’t look at Morris, just looked at Daisy Zane, waiting for her to change her mind. <br/><br/>But this woman was much more difficult to deal with than he had imagined. <br/><br/>Daisy Zane completely ignored what he had said, speaking slowly and gently, “Since Best Actor Allen doesn’t want to leave, I might as well say some things.” <br/><br/>“Please speak.” Billy Allen’s face was very pale, but he felt a burning sensation on his face. <br/><br/>He had never been so humble and spoken this way to anyone outside. Even his fiancée would save him face in public..\t\t\t\t\t\t</div>", "images": {}, "success": true}