{"id": 247, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14274350.html", "title": "Chapter 247 - 236: Dream…", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 247 - 236: Dream…</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 247: Chapter 236: Dream... <br/><br/>Translator: 549690339 <br/><br/>Everyone in the room stared at little Charles, shocked, curious, and unbelieving. <br/><br/>An eerie atmosphere enveloped the living room, making the air seem thinner somehow. <br/><br/>After little Charles called out “Beautiful Grandma,” nobody else spoke. <br/><br/>Even the chirping of the birds outside seemed to have disappeared. Updated from n0velb(i)n.c(o)/m<br/><br/>Seeing that no one was talking, little Charles turned to look at Kevin Clark. <br/><br/>Kevin patted his little head to calm him down and introduced Elina: <br/><br/>“This is Grandpa.” <br/><br/>Charles looked at the dignified grandfather, paused for a moment, and said: “Hello, Grandpa.” <br/><br/>Elina quickly recovered her senses, shifted her buttocks on the sofa, and hurriedly switched from dignified to kind, responding: “Ah, hello, hello.” Kevin smiled and then introduced Calvin Stewart: “This is Aunt.” <br/><br/>He called out again: “Hello, Aunt.” <br/><br/>“You, hello, hello,” Calvin replied. However, it was clear that she had still not recovered from the shock. <br/><br/>Afterward, Kevin introduced everyone else, and little Charles greeted each person in turn. <br/><br/>Everyone responded, but they were still bewildered. <br/><br/>Seeing that Natalie Wayne still hadn’t reacted, Elina pulled at her clothes. Natalie finally came to her senses and looked at Kevin, fiercely calling out his name: “Kevin Clark.” <br/><br/>It had been many years since his mother had called his name with such coldness and severity. <br/><br/>Little Charles’s heart pounded with fear. <br/><br/>Generally, if Daisy Zane called him like this, he would get beaten within a minute. <br/><br/>He glanced at Kevin. <br/><br/>Seeing that Kevin was not afraid and even smiling, Charles silently wondered: Is this what it’s like to be scolded when you grow up? Can you really smile about it? Can you actually laugh it off? <br/><br/>Kevin lifted his hand, holding Charles’s little head and making him look away from himself and towards Natalie again. <br/><br/>Little Charles hesitated for a moment and then quickly regained his composure. <br/><br/>However, he didn’t take any action, but instead, looked back at Kevin as if to say: Can you ensure I won’t be beaten? <br/><br/>Whether Kevin understood the meaning of Charles’s gaze or not, he forcibly turned the boy’s head towards Natalie again. <br/><br/>Charles: <br/><br/>Natalie saw their silent exchange and looked down at Charles. <br/><br/>Little Charles pursed his lips, his expression looking like he had been tricked into entering a wolf’s den. <br/><br/>His facial expression amused Natalie, who waved him over: “Child, come here.” <br/><br/>After seeing her smile and her gentle and beautiful appearance, Charles hesitated and then walked up to her: “Beautiful Grandma.” <br/><br/>Once they started talking, the smile on the Senior Sister’s face froze for a moment. <br/><br/>Natalie Wayne glanced at the group, then lowered her head and looked at <br/><br/>Charles Amos, “For Little Charles’ sake, let’s forget about this matter.” <br/><br/>Hugo Clark glanced at Kevin Clark, who had allowed them to suffer a day of cold eyes due to him. He hid for a day doing nothing, then brought a child back as a shield. <br/><br/>“Teacher, I definitely won’t dare to do it again in the future.” Senior Sister said. <br/><br/>Natalie Wayne snorted, “You better not dare.” <br/><br/>Hugo Clark and Hardy Clark both said, “Thank you, grandmother,” and hurriedly left. <br/><br/>They had already endured a day of cold violence, and they couldn’t stay any longer... <br/><br/>On the Clarks’ side, all was peaceful, and with little Charles Amos, Kevin Clark narrowly avoided a scolding, enjoying tea in the living room at ease. <br/><br/>After speaking with Director Nash on the phone, Daisy Zane, Hill Dawson, and Anisa Cooper discussed some details. <br/><br/>These were issues related to post-production promotion, so Daisy Zane didn’t get involved and went to the sunroom’s hanging chair with her computer to write the script. <br/><br/>This script was not going smoothly, either stalling or being constantly revised. <br/><br/>Daisy Zane felt quite annoyed. <br/><br/>As she was writing, she couldn’t make progress again. <br/><br/>Daisy Zane simply deleted everything she had written in the past two days. <br/><br/>Then she leaned back in the hanging chair to organize her thoughts. <br/><br/>As she was sorting through them, she fell asleep with her computer in her arms. <br/><br/>She even had a dream, in which she saw a snowy mountain and broken ice on the river, both bitterly cold. <br/><br/>Daisy was immersed in the icy cold river with several others, carrying heavy sandbags on their shoulders. Their faces were covered, and they wore black clothes that didn’t reveal any skin. <br/><br/>The people standing on the shore also wore the same attire, even covering their original figures with clothes. <br/><br/>At the sound of the ominous, terrifying, and scary voice, it seemed like a hellish fiend was urging the dead. <br/><br/>He said, “You don’t have to tell me your names or ages, and I don’t want to know what you look like. Here you only have numbers. The only condition for staying here is survival of the fittest.” <br/><br/>The sound echoed in their ears, and the bodies standing in the river were already stiff and numb with no sensation. But the sandbags on their shoulders still made their numb legs gradually bend. <br/><br/>Meanwhile, the man’s voice continued, “I don’t need a lot of people, I need the best. Don’t harbor any lucky thoughts. If you’re afraid of death, it’s better to drop out early ...” <br/><br/>The voice in the dream gradually faded, and the scene changed. <br/><br/>The group of them found themselves in an enclosed room. <br/><br/>They were doing drug resistance training. <br/><br/>All kinds of drugs entered their bodies again and again. They were carried into the hospital, one time after another. <br/><br/>Vomiting, dizziness, hallucinations, and unbearable pain like a bone-picking... <br/><br/>Time and time again, they endured torturous training. With every session, they felt as if they had stepped into the Ghost Gate Pass, only to be dragged back out afterward....\t\t\t\t\t\t</div>", "images": {}, "success": true}