{"id": 245, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14273744.html", "title": "Chapter 245 - 234: Court Music Academy", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 245 - 234: Court Music Academy</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 245: Chapter 234: Court Music Academy <br/><br/>Translator: 549690339 <br/><br/>“What are you doing?” Daisy Zane was listening to Hill Dawson and Director Nash talk when Charles Amos came over and tugged at her clothes. <br/><br/>“Uncle Clark said he’d take me out to play, ” replied Charles Amos. <br/><br/>Daisy Zane glanced at Kevin Clark standing at the entrance of the side hall, then looked down at Charles Amos: “Where to?” <br/><br/>Charles Amos pursed his lips and looked at Kevin Clark. <br/><br/>Kevin Clark laughed and said, “Can it be a secret?” <br/><br/>Daisy Zane turned to him again, asking, “When will you be back?” <br/><br/>“After dinner, perhaps.” <br/><br/>“You agreed to it?” Daisy Zane flicked the little braid on Charles’s head. <br/><br/>Charles nodded, affirming, “Yeah.” <br/><br/>Daisy Zane looked at Charles, her eyebrows raised slightly. It was the first time Charles had willingly gone out to play with someone other than her and Wilton Edwards. <br/><br/>And they were going to be out for a while. <br/><br/>He wouldn’t even go with James Collins usually. <br/><br/>“Alright, go,” Daisy Zane said, “Don’t cause trouble for your Uncle Clark.” <br/><br/>“Okay,” Charles agreed with a smile. <br/><br/>“Take your cell phone,” Daisy said, “If you want to come back midway, call me.” “Would you come and pick me up then?” Charles asked, his eyes sparkling. <br/><br/>“Wishful thinking,” Daisy Zane pinched his little face playfully, “What do you think the driver at home is for?” <br/><br/>The light in Charles’s eyes disappeared in an instant, “Oh.” “Go ahead,” Daisy Zane repeated, “Don’t disturb my work.” Charles: <br/><br/>As he headed towards Kevin Clark, Charles grumbled inwardly. <br/><br/>This woman truly has her heart figured out, she’s clearly worried about me, but she is pretending not to care. <br/><br/>Charles could see it, and naturally, so could Kevin Clark. He said, “Don’t worry, I’ll make sure to bring him back safely.” <br/><br/>“As you wish, he’s all yours now,” said Daisy Zane casually. <br/><br/>Just as he reached Kevin Clark’s side, Charles: ‘ . <br/><br/>Kevin Clark looked at his speechless little face and took him away from the side hall, saying, “It’s okay. There’s no different if he’s with me. We all be a family sooner or later, it’s the same.” <br/><br/>His words weren’t uttered carefully enough to keep the volume down, and naturally, the three people in the side hall heard him. Even Director Nash on the other end of the phone heard it. <br/><br/>“So, should I call you daddy?” Charles’s voice suddenly increased a few notches. <br/><br/>Kevin Clark could tell this little guy was deliberately saying this so Daisy could hear. But his heart still beat a bit faster. He nonchalantly said, “Would you like to call me that?” <br/><br/>Little Charles paused for a moment, then turned to sneak a peek at Daisy Zane. The two of them made eye contact, and her icy stare scared him. He quickly turned back and said, “I, I’ll listen to my mom.” <br/><br/>Kevin Clark could see his complacent little state, and the corners of his mouth slightly curled upwards. The revolt hasn’t even started before it was suppressed. <br/><br/>Not only did Kevin Clark take Charles to buy a piano, but he also introduced him to his old teacher. <br/><br/>Alex Justin, one of the two top elders of the Royal Court Music Academy and a world-class piano master. He is over seventy this year, and Kevin Clark has been learning piano from him since he was five. <br/><br/>He is also his most successful student. <br/><br/>The two figures also happened to come from the corridor. <br/><br/>A man and a woman. <br/><br/>The man was dressed in a white robe with a jade ornament on his waist. His hair was partially gray and his face showed some wrinkles. However, he had a tall, straight figure. <br/><br/>He resembled a bamboo, refined and beyond convention. <br/><br/>He was another elder figure of the Court Music Academy, Charles Flores. <br/><br/>And also the founder of the Court Music Academy. <br/><br/>Currently, he is the leader in representing traditional ethnic instruments to the world. <br/><br/>He was considered a national treasure. <br/><br/>“Master Flores,” said Kevin Clark. <br/><br/>Charles Flores responded and then looked at Charles Amos. “Third Master Clark came to see your teacher again?” <br/><br/>“Yes,” glanced at the woman holding a Pipa behind Charles Flores, “Does Master Flores have a new apprentice?” <br/><br/>Charles Flores shook his head and laughed, without intending to explain too much, “Someone from the Academy. She’s quite talented. I plan to guide her for a couple of days.” <br/><br/>The woman looked to be in her twenties. Upon seeing Kevin Clark, her eyes widened, and even her breathing became quieter. <br/><br/>However, Kevin Clark didn’t pay attention to how the woman looked. <br/><br/>He just thought that if Charles Flores said she was talented, it meant she must be outstanding. <br/><br/>Charles Flores was a very picky person, and hardly anyone could meet his standards. Over the years, he trained only one apprentice. It was heard that he was extremely fond of this apprentice at the time. <br/><br/>“Third Master Clark...”. Charles Flores suddenly signaled Kevin Clark to move to the side. <br/><br/>Kevin Clark immediately led Charles a few steps to the side. Little Charles’ eyes remained on the Pipa the woman was holding. <br/><br/>The woman also smiled as she watched him. However, after Charles glanced at her, his gaze returned to the Pipa, showing no interest in her. <br/><br/>“Third Master Clark,” Charles Flores dropped his voice, “Have you heard from Lila Campbell?” <br/><br/>Kevin Clark’s eyelashes fluttered slightly, “Not yet.” <br/><br/>Charles Flores sighed softly, the beautiful fingers behind his back subtly quivered, “Third Master Clark, I have nothing else. I dare not ask about Lane Family’s matter, fearing it would touch on painful memories. I can only bother you.” <br/><br/>“If there is any news, you will be the first to know,” said Kevin Clark. “Good, good. Thank you, Third Master Clark.” <br/><br/>After talking with Charles Flores, Kevin Clark left with Charles Amos. Seeing him continuously staring at the Pipa, Kevin Clark asked, “Do you like it?” <br/><br/>“My mom likes it,” Charles responded, “She plays it really well. Have you heard it?” <br/><br/>Kevin Clark looked down at him; what was with this show-off tone? <br/><br/>“Oh. You haven’t heard it.” Charles mimicked Daisy Zane’s indifferent tone. <br/><br/>Kevin Clark: <br/><br/>“Doesn’t she play for you?” Charles continued to ask. <br/><br/>Kevin Clark looked down at him, his narrow eyes filled with a chill. It felt like a dark cloud was pressing directly towards little Charles. <br/><br/>On receiving this gaze, Charles promptly shut his mouth. He was adaptable and knew when to keep quiet. <br/><br/>Meanwhile, the woman following Charles Flores remained gazing at Kevin <br/><br/>Clark. Even after he left, she turned to look at him three times until she could no longer see Kevin Clark. She finally stopped turning back....\t\t\t\t\t\t</div>", "images": {}, "success": true}