{"id": 241, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14256539.html", "title": "Chapter 241 - 230: Go Find Something Good To Watch", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 241 - 230: Go Find Something Good To Watch</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 241: Chapter 230: Go Find Something Good to Watch <br/><br/>Translator: 549690339 <br/><br/>The lighting in the parking lot was somewhat dim and chilly. <br/><br/>Daisy Zane’s voice remained cold as ever, devoid of warmth or emotion. <br/><br/>But Kevin Clark’s heart was enveloped in warmth. <br/><br/>As the elevator door opened, Daisy went in, but Kevin stood still. <br/><br/>After pressing the floor number, Daisy put her hand on the elevator door and looked back at him, “Aren’t you coming?” <br/><br/>Upon making eye contact and hearing her voice, Kevin entered the elevator. <br/><br/>The elevator door closed, and after a couple of seconds, Kevin laughed and said, “What if... one day, I’m not good-looking anymore?” <br/><br/>Daisy looked up at him, taking in his finely sculpted brows and eyes. <br/><br/>She had to admit that people can be hypocritical. <br/><br/>In her eyes, Kevin was always the best looking, no matter what. <br/><br/>“Hmm? Why aren’t you speaking?” Kevin asked again. <br/><br/>Daisy shifted her gaze from his face to the elevator door and said calmly, “Then be careful. If you’re not good-looking anymore, I’ll find someone who is.” Kevin’s smile suddenly disappeared. An overwhelming pressure filled the elevator. <br/><br/>It weighed on their hearts, making the air seem even thinner. <br/><br/>For the first time, Daisy was up close and personal with Kevin’s intimidating aura. <br/><br/>While being somewhat shocked, she also detected a sense of familiarity. <br/><br/>It was so familiar that she instinctively wanted to resist. <br/><br/>But before this resistance could fully take root, Kevin suddenly leaned in, wrapped his arm around her waist, and pushed her against the elevator wall. <br/><br/>Fearing she might hit the wall too hard, he cushioned her back with his hand. The next second, Kevin used his other hand to lift her chin and kissed her again. <br/><br/>As the elevator door opened on the fifth floor, he pressed the close button. <br/><br/>Daisy Zane: . <br/><br/>After a while, she still didn’t feel that Kevin was going to let her go. <br/><br/>For a brief moment, she felt a touch of despair at the thought of her predicament. <br/><br/>Moreover, Kevin’s aura was so intimidating that it made her think that he might kill her right there in the elevator. <br/><br/>Daisy placed her hand on his shoulder and tried to push back against him. <br/><br/>Resting his forehead against hers, a seductive red glint appeared in Kevin’s eyes, “Little girl, you can be cheeky in the future, but if you say anything about finding someone else again, I’ll get angry.” <br/><br/>Daisy genuinely didn’t want to be near Kevin right now and she tried to push him away with more force. <br/><br/>As he took a step back, he noticed a thin layer of moisture in her eyes and an unresolvable resistance lurking deep within. <br/><br/>Stunned, his aura immediately diminished, and his tone became lighter, almost cautious, “Are you mad?” <br/><br/>Looking at Kevin, Daisy’s hanging hand slowly clenched into a fist. <br/><br/>In her memory, she had never met Kevin before. <br/><br/>But this feeling... <br/><br/>“What do you think? Could you still stand here?” Daisy straightened up, patting down the wrinkled suit he had pressed against. <br/><br/>Upon hearing her words, Kevin’s lips curved. He touched her swollen, reddened lips again, “I might’ve been too rough.” <br/><br/>“Can you talk less?” <br/><br/>“Only you would take advantage of such things,” Hugo Clark snorted. <br/><br/>“Who wouldn’t want more money?” <br/><br/>Daisy Zane smiled lightly and said, “The clothes you make for me every year are worth more than my salary, so there’s no need to give Charles money. The money Charles has now is enough for him to marry ten wives.” <br/><br/>“But he said that 80% of it is to support your old age, and the remaining 20% is for buying you gifts,” Joseph Allen said. <br/><br/>“He talks to you too?” <br/><br/>“Mhm.” Speaking of this, Joseph Allen was obviously excited and a bit relieved, “He took the initiative to call me.” <br/><br/>Kevin Clark’s fingers tapped lightly on his leg. This little brat was really friendly with everyone. <br/><br/>“Our little Charles Amos sure thinks far ahead,” Allonzo Hobson laughed, “He’s already planned for Brook Sister’s retirement so many years in advance.” <br/><br/>Daisy Zane’s eyebrow twitched slightly. Not only had he planned, but he was also very persistent. <br/><br/>He knew she was prepared to leave him, so he stubbornly saved money for her old age. <br/><br/>It was as if the more money he saved, the less likely she would leave. <br/><br/>“Charles Amos... who is he?” Hugo Clark suddenly asked. <br/><br/>The whole table suddenly turned to look at him. With this sudden focal point, the atmosphere seemed to freeze for a moment. <br/><br/>Hugo Clark looked at everyone’s reaction and hesitated for a moment before asking, “What’s wrong?” <br/><br/>Across from him, Morris and George Dunn both lowered their eyes and took a sip of water before glancing at Kevin Clark and Daisy Zane. <br/><br/>The others, not answering, also looked towards Kevin Clark. <br/><br/>Especially Joseph Allen, whose eyes flashed a subtle gleam. Kevin Clark hadn’t told his family that Lucia had a child in the Clark Family... <br/><br/>Only Kevin Clark and Daisy Zane appeared calm. <br/><br/>Kevin Clark poured Daisy Zane a cup of tea and said, “Your cousin.” <br/><br/>Hugo Clark’s expressionless face suddenly registered shock for a moment. His pupils trembled as he furrowed his eyebrows, “My... cousin?” <br/><br/>He knew how chaste his Third Uncle was: he would definitelv resDect the woman. No matter how much he liked her, he would never have a child before marriage and bring it into the Clark Family. <br/><br/>So there was only one possibility for this child... <br/><br/>Hugo Clark looked at Daisy Zane, and Daisy Zane looked back at him. <br/><br/>The two locked eyes for two seconds, and just as Daisy Zane was about to speak, Kevin Clark held her hand, forcing Hugo Clark to avert his gaze. <br/><br/>Hugo Clark looked away, suppressing the questions in his heart, and didn’t say anything more. <br/><br/>Moreover, this was his Third Uncle’s private matter, and he shouldn’t interfere too much. <br/><br/>After a few drinks and a lot of conversation, the dinner lasted for more than two hours. <br/><br/>And Kevin Clark, the legendary figure who stood in the clouds and looked down upon all, was very polite to everyone because of Daisy Zane. With his wide range of knowledge, he could engage in every topic. <br/><br/>Usually, Daisy Zane was quiet, and since she was among familiar people, she was relatively casual. <br/><br/>She occasionally spoke a few words, but most of the time she focused on eating. <br/><br/>Kevin Clark sat beside her, peeling shrimp and removing fish bones while chatting with the others. He even prepared a crab for her, only letting her eat one. <br/><br/>Joseph Allen, sitting next to her, watched all of this silently, occasionally handing her a couple of tissues. <br/><br/>Gradually, he became reassured. <br/><br/>Kevin Clark took great care of this little girl. <br/><br/>It was nearly impeccable. <br/><br/>And looking at the nonchalant attitudes of the group, it seemed that this little girl was always taken care of this way.\t\t\t\t\t\t</div>", "images": {}, "success": true}