{"id": 248, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14274351.html", "title": "Chapter 248 - 237", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 248 - 237</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 248: Chapter 237 <br/><br/>Translator: 549690339 <br/><br/>The sun was setting, and the temperature in the sunroom gradually decreased, making the coolness from the air conditioning more obvious. <br/><br/>Wilton Edwards came downstairs intending to water the plants in the courtyard. Seeing that Daisy Zane had fallen asleep, he went to fetch a blanket. <br/><br/>However, just as he approached her with the blanket, without even reaching her side. <br/><br/>Daisy Zane suddenly opened her eyes and looked at him. <br/><br/>The fierceness in her eyes seemed like a frozen abyss that could pierce one’s heart. It sent chills down one’s spine and instilled fear. <br/><br/>It was more like a wolf staring at its prey, ready to tear it apart at any moment. <br/><br/>Wilton Edwards’ lips moved as if he wanted to say something, but he didn’t in the end. He responded and went outside. <br/><br/>Daisy Zane looked at Wilton Edwards, and her gaze quickly returned to clarity, gradually calming down. <br/><br/>She raised her hand to rub her temple, her voice slightly hoarse, “Wilton Edwards.” <br/><br/>Only then did Wilton Edwards make a move, walked a few steps forward, and gently placed the blanket on the edge of the hanging chair, “Miss, did you have a nightmare?” <br/><br/>“No. I dreamt of some past events.” Daisy Zane glanced at the time, “Did Charles Amos send any messages?” <br/><br/>“I just called to ask.” Wilton Edwards said gently, “He sounds happy. Third <br/><br/>Master will bring him back after dinner. Don’t worry.” <br/><br/>“Okay,” Daisy Zane replied softly, “You can go ahead.” <br/><br/>Wilton Edwards’ lips moved as if he wanted to say something, but he didn’t in the end. He responded and went outside. <br/><br/>Daisy Zane watched Wilton Edwards leave, and then looked down at the cold sweat in the palm of her hand. <br/><br/>Her back was also covered in cold sweat, which made her, who already felt a little cold, feel even colder. <br/><br/>The last part of her dream was about psychological training. <br/><br/>The person training them continually crushed their willpower and tested their psychological defenses. <br/><br/>For every point they resisted, he would attack five times more fiercely. Over and over, time and time again. <br/><br/>It was as if a knife had sliced through their hearts, constantly prying at their weakest point with the blade. <br/><br/>Repeatedly stirring, not stopping even if their flesh and blood were a mess and their fresh flesh was rotting. <br/><br/>Only when that soft spot became indestructible, able to withstand the sharp blade, would he stop. <br/><br/>Under such torture, everyone would exhibit self-harm and even experience a mental breakdown, wanting to die. <br/><br/>Daisy Zane didn’t know how she got through it or how she managed to stay behind. <br/><br/>Even after she stayed, it took her a long time to feel as if she was already dead. She was just a walking corpse, a puppet, only obeying orders, only submitting... <br/><br/>After a while, Daisy Zane put the computer aside on the round table and took out two tissues to slowly wipe her hands. <br/><br/>She never wanted to recall those days. <br/><br/>That part of her memory seemed to be forgotten in some corner of her heart, never wanting to open or mention it. <br/><br/>Perhaps the training at that time had subtly included the inability to mention that period of time. <br/><br/>After Kevin Clark was slightly stunned, he laughed and said, “No, what’s the matter, Dad?” <br/><br/>“I always feel that he looks a bit like you.” “Really?” Kevin Clark laughed. <br/><br/>“Yes,” Elina Clark said with certainty. <br/><br/>Tom Wayne smiled and said, “Maybe there is a father-son bond.” <br/><br/>Elina Clark looked at South bears with his cane. <br/><br/>Maybe... <br/><br/>South bears ran around the lotus pond for a while, and Kevin Clark took him away. <br/><br/>He is afraid that he would fall into the lotus pond. <br/><br/>“I haven’t had enough fun yet.” South bears said reluctantly. <br/><br/>“I’m afraid if you fall in, the little girl will kill me.” Kevin Clark took his hand and pulled him away by force. <br/><br/>“How could I fall in if I don’t jump?” South bears muttered. <br/><br/>Kevin Clark snorted, “Wasn’t the fever from last year that required hospitalization caused by you falling into the lake?” <br/><br/>“I...” South bears uttered a syllable, but soon stopped talking and remained silent. <br/><br/>Seeing his sudden silence, in a while, Kevin Clark stopped and looked down at him, “So you jumped into the lake yourself?” <br/><br/>South bears lowered his head and pretended not to hear. <br/><br/>Kevin Clark continued, “Did you jump in to get the little girl to come and see you?” <br/><br/>South bears still didn’t say anything. <br/><br/>Kevin Clark chuckled. He even dared to go to Truro City by himself and knocked out Wilton Edwards. <br/><br/>Jumping into a lake is nothing compared to that. <br/><br/>The strong willpower and determination to do whatever he wants are exactly the same as that of the little girl. <br/><br/>“Your little secret is in my hands, so behave yourself.” <br/><br/>South bears said reluctantly, “Okay.” <br/><br/>As he shouldered the responsibility, he grumbled in his heart. <br/><br/>Why is life treating him badly and setting pitfalls for him at every turn? <br/><br/>He is just a child after all. <br/><br/>After dinner, when South bears left, Tom Wayne and Calvin Stewart gave him a big red envelope each. <br/><br/>Tom also left him a contact number, saying to keep in touch. <br/><br/>South bears happily took the two red envelopes, got in the car, and then his little face collapsed, “How do I explain when I go back?” <br/><br/>“Tell the truth.” <br/><br/>“Will my mom hit me?” <br/><br/>“Well...” Kevin Clark thought for a moment, “She is more likely to hit me.” Upon hearing this, South bears instantly breathed a sigh of relief: “That’s good, that’s good.” <br/><br/>Kevin Clark:\t\t\t\t\t\t</div>", "images": {}, "success": true}