{"id": 249, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14275430.html", "title": "Chapter 249 - 238: I’M Afraid She’Ll Be Angry", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 249 - 238: I’M Afraid She’Ll Be Angry</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 249: Chapter 238: I’m Afraid She’ll Be Angry <br/><br/>Translator: 549690339 <br/><br/>The car drove into the villa, and Charles’s hand clutching the red envelopes suddenly tightened. <br/><br/>He looked up at Kevin Clark and whispered, “Are you really not going to hit <br/><br/>Kevin Clark looked down at his nervous and scared expression, laughing and said, “Hmm, I won’t hit you.” <br/><br/>The car stopped, Charles got out, and when he followed Kevin Clark to the entrance of the living room, he looked up at him again and said, “Are you scared?” <br/><br/>“Yes, I am.” <br/><br/>“But you’re not afraid of your grandmother being angry.” Charles said. <br/><br/>“But I’m afraid of the little girl being angry.” Kevin Clark looked at him. <br/><br/>“What can we do?”Charles asked worriedly, “Will it involve me?” <br/><br/>Kevin Clark snorted in his heart; this kid was only worried about himself being involved, “Not necessarily.” <br/><br/>Charles: <br/><br/>“Will you protect me then?” Charles asked again. <br/><br/>“That depends on my mood.” Kevin Clark perfunctorily said. <br/><br/>Charles’s eyes were almost round, and just as he was about to speak, Daisy’s cold voice came from inside the living room: “Are you two reciting some incantation before entering?” <br/><br/>Charles was startled, dropping a red envelope on the ground. <br/><br/>After picking up the red envelope, Kevin Clark led him into the living room. <br/><br/>Daisy was wearing gray home clothes instead of the clothes they wore when they left in the morning. Her hair was loose and seemed to have been washed not long ago. <br/><br/>It seemed that she had just come down from the upper floor and was standing next to the sofa, looking at the entrance of the living room. <br/><br/>As soon as Kevin Clark and Charles entered the living room, she saw the two thick red envelopes in Charles’s hand. <br/><br/>She squinted slightly and whispered, “Who gave them?” <br/><br/>Charles leaned towards Kevin Clark’s leg, suddenly at a loss for words. <br/><br/>Daisy glanced at Kevin Clark again, speaking with the same tone and voice as usual, “Speak.” <br/><br/>But little Charles was still frightened, his little heart trembling, “It’s from Beautiful Grandma and Aunt. Updated from n0velb(i)n.c(o)/m<br/><br/>Daisy’s gaze lingered on his face for two seconds before looking at Kevin Clark. <br/><br/>Kevin Clark’s eyebrows and eyes were gentle, and he smiled, “My mother and my sister-in-law.” <br/><br/>After saying that, he walked forward with Charles, but little Charles pulled his hand and exerted force in the opposite direction. So Kevin Clark dragged Charles to Daisy’s side. <br/><br/>Daisy thought for a moment and almost understood, “You took him to your home?” <br/><br/>“Yes.” Kevin Clark looked at her, “My mother was angry with me, so I brought her a grandson as a shield.” <br/><br/>Daisy was silent for a while, then lowered her head to look at Charles, “You go back to your room first, or find Grandpa Edwards.” <br/><br/>Following her instructions, Charles let go of Kevin Clark’s hand and ran toward Uncle Edwards’ room. <br/><br/>He disappeared from the living room in a puff of smoke. <br/><br/>Kevin Clark watched the little white-eyed boy and gritted his teeth. <br/><br/>“You were hoping he’d plead for you?” Daisy sat down on the sofa, “He can’t even protect himself.” <br/><br/>“Why did you come out?” <br/><br/>“I’m going to see Charles.” <br/><br/>Kevin Clark’s excitement vanished instantly: “...Oh.” <br/><br/>Daisy Zane looked at him suspiciously again, then turned and went to Charles’s room. <br/><br/>Little Charles was sitting on his carpet counting money when the door knocked. He thought it was Uncle Wilton, so he opened the door directly. <br/><br/>But when he saw it was Daisy Zane, he instinctively tried to close the door, but Daisy Zane’s hand pressed against the door, preventing him from shutting it. <br/><br/>“What are you doing?” Daisy Zane asked him. <br/><br/>“Nothing.” Charles glanced at her and quickly lowered his head, “What’s up? <br/><br/>Daisy Zane walked straight into his room and saw the money spread all over the room, “Taking inventory of your wealth?” <br/><br/>Charles followed her without a word. <br/><br/>Daisy Zane squat on the ground and looked at the money, “Not a small amount. Did Beautiful Grandma and Aunt Wood give it all to you?” <br/><br/>“Yes,” Charles replied. <br/><br/>Daisy Zane looked at him, “Do you like Beautiful Grandma and Aunt Wood?” <br/><br/>Charles thought for a moment before saying, “They, along with grandfather, treat me very well. They don’t make things difficult for me. Grandma even took down my contact information and just spoke with me a while ago. She asked when I would have time to come over to her place.” <br/><br/>Daisy Zane’s eyebrows moved gently, and there was a hint of a smile in her eyes. A child’s mind is very perceptive – if he says they’re good, then they must be good. <br/><br/>“Remember to bring them gifts next time. Use this money to buy them.” “Can I go?” Charles squatted down beside her and looked up at her. <br/><br/>“If you want to, you can.” <br/><br/>Charles smiled and, after thinking for a moment, continued, “Today Uncle Clark took me to the Court Music Academy.” <br/><br/>“He introduced me to Master Alex Justin,” Charles said. “Grandpa Justin said he wants to take me as his apprentice...grandson.” <br/><br/>Daisy Zane looked at Charles, recalling Kevin Clark’s words about offering a “little” benefit. <br/><br/>A world-class piano master at the Court Music Academy. What a “little” benefit indeed. <br/><br/>“Is it okay?” Charles asked cautiously. <br/><br/>“You can decide on this matter on your own.” <br/><br/>Charles was so happy that he couldn’t even purse his lips, grinning ear to ear and showing his gap teeth. <br/><br/>Daisy Zane looked at his grown teeth and quietly observed him for a while before reaching up and patting his head, “Thank you.” <br/><br/>Charles’s expression, which had been immersed in joy, suddenly froze, and he stared blankly at Daisy Zane. <br/><br/>Daisy Zane’s voice was as gentle as it could ever be, making her words barely distinguishable from her usual speech: “Thank you for helping me eliminate a concern. You were very brave.” <br/><br/>It wasn’t as if Charles hadn’t been praised or thanked before. Daisy Zane always thanked him every time he bought her a gift. <br/><br/>But this was his first time being thanked in such a way, as if he’d protected her. Charles stared at Daisy Zane, his face slowly turning pink. <br/><br/>Seeing his reaction, Daisy Zane smiled and then scooped up a handful of money from the ground, “Everyone gets a share.” <br/><br/>Charles’s eyes immediately followed the money in her hand. <br/><br/>Daisy Zane stood up, even deliberately shaking a few bills in her hand and said, “Go to sleep early.” <br/><br/>Then she walked away with the money. <br/><br/>It wasn’t until the door closed that little Charles came to his senses. He looked at the remaining money on the floor, clearly missing a few bills, and sat down with a thud, exclaiming, “Ah, my money!”\t\t\t\t\t\t</div>", "images": {}, "success": true}