{"id": 246, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14273747.html", "title": "Chapter 246 - 235: Make A Deal", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 246 - 235: Make A Deal</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 246: Chapter 235: Make a Deal <br/><br/>Translator: 549690339 <br/><br/>After leaving the Court Music Academy, Kevin Clark took Charles Amos to the dessert shop. <br/><br/>He ordered him quite a bit of stuff and even let him eat an ice cream. <br/><br/>As he was eating, Kevin Clark said, “Charles, I’ve done so much for you today, don’t you think you should help me as well?” <br/><br/>A scoop of ice cream in Charles’s mouth suddenly couldn’t be swallowed. Eyes wide open, he looked at Kevin Clark cautiously. <br/><br/>He had a feeling there was no such thing as a free lunch. <br/><br/>“What? Don’t you want to help?” Kevin Clark asked. <br/><br/>Charles swallowed the ice cream in his mouth, looked at him, and said, “If you guys get married, I have no objection.” Kevin Clark raised his eyebrows, “So I passed the test?” Charles pursed his lips and nodded his head. <br/><br/>Kevin Clark smiled. He hadn’t spoiled this brat for nothing. <br/><br/>“So, would you like to do your part and help us get married?” Kevin Clark asked. <br/><br/>“Help how?” Charles looked at him, his big eyes blinked. He hoped that this wasn’t about living together with them. <br/><br/>“There’s a beautiful grandmother that needs your help to come around.” Kevin Clark said. <br/><br/>“Grandmother?” <br/><br/>“My mother.” Kevin Clark tried to appeal to the child’s sense of fairness, “I took care of your mother, you take care of mine. Isn’t that fair?” <br/><br/>The small tuft of hair on top of Charles’ head, shaken by the indoor air conditioning, fluttered about. <br/><br/>Doubts surfaced in his eyes. This sounded like...he was getting the short end of the stick. <br/><br/>Seeing his confusion, Kevin Clark laughed and said, “If you help me, I’ll help you with the apprenticeship.” <br/><br/>Charles hesitated immediately. He took a bite of ice cream and thought for a moment, “But are you sure I won’t make things worse?” <br/><br/>Kevin Clark didn’t expect him to ask this. He was slightly taken aback for a <br/><br/>moment, then he reassured, “The beautiful grandmother will definitely like you. <br/><br/>“Really?” <br/><br/>“Yes.” said, “If you get her to come around, it would alleviate one of Daisy’s concerns.” <br/><br/>As soon as Daisy Zane was mentioned, Charles didn’t hesitate and immediately agreed, “Okay.” <br/><br/>Seeing him agree, Kevin Clark smiled and took a sip of water from his glass. <br/><br/>Since his mother already knew, he might as well tell her everything all at once. <br/><br/>This would alleviate Daisy’s worries and avoid unnecessary trouble. <br/><br/>Charles was going to live in the Clark family sooner or later, so they ought to find out about him sooner rather than later. <br/><br/>Kevin Clark held his hand and said, “Don’t stumble.” Little Charles snapped back to reality: “Is this your house?” <br/><br/>“Yep. Have you seen it before?” <br/><br/>Charles pointed to the west: “There’s a holiday hotel on the mountain over there. You can see this place from the top floor. Grandpa Edwards brought me there.” <br/><br/>“Do you like it?” <br/><br/>Charles nodded, looking around curiously. <br/><br/>After a while, they finally reached the front hall. <br/><br/>Just getting to the entrance, Little Charles felt a wave of repressed air rushing over him. <br/><br/>He gripped Kevin Clark’s hand tightly. <br/><br/>Kevin Clark smiled down at him: “It’s okay. Relax.” <br/><br/>The moment the two stepped into the entrance, the few silent people sitting in the front hall immediately turned to look. <br/><br/>Their expressions were like “you’re finally back, you have no idea what we’ve been through,” and behind these expressions, they all looked ready to devour someone. <br/><br/>But when their eyes moved down and saw the child, the surprise and confusion instantly appeared on their faces. <br/><br/>“So you know to come back?” Natalie Wayne didn’t even look at him when she heard his steps, “I was about to report you missing.” <br/><br/>Charles, seeing everyone in the room looking at him, naturally leaned closer to Kevin Clark. <br/><br/>Elina Clark was also staring dumbfounded at this childhood. <br/><br/>It wasn’t that she hadn’t seen children before. She had never seen Kevin Clark holding a child’s hand. <br/><br/>Kevin Clark had found kids irritating since he was a teenager. <br/><br/>She only remembers Kevin Clark holding the Lane Family’s oldest daughter’s hand when he was a child. He didn’t even hold Hardy Clark’s hand when she was a child. <br/><br/>Most importantly, why does this child look somewhat like Kevin Clark? <br/><br/>“Of course I know to return to my home,” Kevin Clark laughed. <br/><br/>“You remember this is your home.” Natalie Wayne said as she turned her head to look at him, “Tell me, how many days in a year do you spend at home... in your home.” <br/><br/>Natalie Wayne saw the child by his side, her tone instantly softened, and her words stuttered. <br/><br/>Mainly because Charles’ pair of dewy big eyes made it hard for people to be stern. <br/><br/>Now, everyone in the room was looking at Charles. <br/><br/>It seemed like a group of monsters staring at a little cub. <br/><br/>Kevin Clark gripped Charles’ slightly sweaty little hand and said: “Call out to grandma. ” <br/><br/>Natalie Wayne’s eyes widened a bit more, looking at Charles. <br/><br/>Charles also looked at her, waited for two seconds, let go of Kevin Clark’s hand, moved half a step forward. Then he pursed his lips, and with a slightly trembling voice, said: “Hello, beautiful grandma.” <br/><br/>Hearing his sweet words, Kevin Clark chuckled. The little one sure knows how to flatter..\t\t\t\t\t\t</div>", "images": {}, "success": true}