{"id": 242, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14256540.html", "title": "Chapter 242 - 231: Drunk?", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 242 - 231: Drunk?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 242: Chapter 231: Drunk? <br/><br/>Translator: 549690339 <br/><br/>After dinner, everyone went their separate ways at Doomsday Hotel. <br/><br/>Since they all drank wine, those without drivers were sent home by the Clark family members. <br/><br/>Hill Dawson and Anisa Cooper took a car back to Daisy Zane’s residence. <br/><br/>Kevin Clark and Daisy Zane were in another car, going back to her residence. <br/><br/>Upon getting in the car, Daisy Zane asked, “Aren’t you going back with Hugo <br/><br/>Clark and the others?” <br/><br/>“Going to your place.” <br/><br/>Daisy Zane: . This feeling... it really is like having a gigolo. <br/><br/>“What are you thinking?” <br/><br/>“Nothing?” Daisy Zane stole a glance at the slightly reddened corner of his eyes, then turned her gaze out the window. <br/><br/>Kevin Clark held her hand in his, gently squeezing it. <br/><br/>The car moved smoothly along the road, with scenery on both sides rushing past. <br/><br/>After a quiet moment in the car, Kevin Clark seemed to strike up a casual conversation, “How did you meet Joseph Allen?” <br/><br/>Daisy Zane lowered her gaze, thinking for a moment, “About eight or nine years ago, I submitted a design draft to Joseph Allen, and then we got acquainted.” <br/><br/>“That early, huh.” <br/><br/>“Yes.” Daisy Zane turned her head, looking at Kevin Clark’s hand. “At that time, <br/><br/>I was still in Continent A. I accidentally saw the Cloud Clothing and Rainbow Skirts apparel online and fell in love with them.” <br/><br/>“And then you took up fashion design?” Kevin Clark asked. <br/><br/>“Yes. I found it interesting, so I taught myself for a while.” Daisy Zane glanced at the scars on his palm, which had faded considerably due to medication. “After submitting my work to Joseph Allen, we kept in touch. I would send him submissions every year.” <br/><br/>“Apply the medicine every day,” Kevin Clark said, “In time, the scars will be gone.” <br/><br/>Daisy Zane nodded, “Joseph Allen really likes my designs, and I admire his designs as well. We share common interests and have always been on good terms. Moreover, after Cloud Clothing and Rainbow Skirts gained traction, Joseph Allen placed me in the position of co-founder.” <br/><br/>Kevin Clark could sense it. <br/><br/>There was mutual admiration and attraction between her and Joseph Allen. <br/><br/>Her relationship with Felix Baker was more about intertwined interests, but with Joseph Allen, there were different feelings involved. <br/><br/>Even without Cloud Clothing and Rainbow Skirts, they would still be close friends. <br/><br/>“I want to borrow half of your bed.” Arthur said, leaning down to hug her. His deep voice close to her ear asked, “Is that okay with you?” <br/><br/>“What? Borrow my bed?” Daisy felt something wasn’t quite right. “Did you break your bed?” <br/><br/>“...The bed isn’t broken.” Arthur embraced her as they entered the room, then kicked the door closed with his foot, “But my room doesn’t have you in it.” <br/><br/>Daisy Zane: “???” When did you ever have me in your room? <br/><br/>“Arthur North...” <br/><br/>“I’m here.” <br/><br/>Daisy pulled his arm away, freeing herself and then took a careful look at him. <br/><br/>Arthur didn’t drink much, and she didn’t know how much he could drink or if he could handle it. But he had quite a bit to drink tonight. <br/><br/>After a while, she asked, “Arthur North, are you... drunk?” <br/><br/>“No,” Arthur held her face and kissed the corner of her lips, “I’m not drunk.” Not drunk... then what’s with the nonsense? <br/><br/>As Daisy was pondering, Arthur cupped her face with both hands and rubbed it: “Miss, you still haven’t promised me that you won’t say you don’t want me and want to find someone else. <br/><br/>Daisy’s face was almost distorted by the rubbing, so she slapped away Arthur’s hands and touched her face. <br/><br/>Arthur, seemingly unaware of why he was slapped, instantly looked hurt. Then he hugged Daisy again, burying his face in her shoulder: “I’m sorry.” “What are you sorry for?” Daisy asked deliberately. <br/><br/>“Not sure,” Arthur said softly, “But if Miss hits me, she must be angry. I’ll apologize first.” <br/><br/>Daisy raised an eyebrow. <br/><br/>And he claims he’s not drunk. <br/><br/>I can’t believe it. <br/><br/>When they returned, Arthur seemed completely fine and showed no signs of being drunk. He even chatted with her on the way. <br/><br/>His voice, gaze, words, and pace were all normal, except for the redness in the corners of his eyes. <br/><br/>Perhaps it was because he had just taken a shower, which accelerated his blood circulation, causing the alcohol to go to his head. <br/><br/>But he still walked steadily, his eyes were clear, and even the tone, speed, and mood of his speech remained unchanged. <br/><br/>It’s just that he was using all his normal behavior to say things he normally <br/><br/>wouldn’t. <br/><br/>And his reaction was a bit out of sync. <br/><br/>If it had been any other time, he definitely wouldn’t have come over this late, asking to borrow half of her bed for no reason. <br/><br/>Daisy chuckled lightly. <br/><br/>Then Arthur said again, “Miss, you still haven’t agreed to my request. You can’t talk about finding someone else.” Daisy Zane: “.......” Is he possessed?\t\t\t\t\t\t</div>", "images": {}, "success": true}