{"id": 240, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14253968.html", "title": "Chapter 240 - 229", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 240 - 229</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 240: Chapter 229 <br/><br/>Translator: 549690339 <br/><br/>After getting in the car, Olivia Lane checked the messages on her phone once she sat in the back seat. <br/><br/>William Lane sitting next to her, fastened her seat belt: “You’re such a lazybones.” <br/><br/>“When you’re around, of course I’m lazy.” <br/><br/>“You’re pretty brazen about it.” William fastened her belt and sat down himself. <br/><br/>“Of course.” Olivia finished, put away her phone after a while, and casually asked, “Brother, are you still leaving?” <br/><br/>“Yeah.” William responded, “I’ll take you to school the day after tomorrow, and then I’ll go to F Continent.” <br/><br/>“Is it really that urgent?” Olivia frowned, “Can’t you stay a few more days?” William stayed silent, lips pressed together. <br/><br/>Olivia glanced at him, her lips moved as if to say something but then swallowed it back. A few seconds later, she spoke, “Sister... She might not be there anymore.” <br/><br/>William’s fingertips curled on his leg. After a moment, he looked out the window and said, “But if she’s not there, where would she be?” <br/><br/>Every possible location had been searched. <br/><br/>Such a vast sea area, every method and technology available had been used. <br/><br/>In the end, only a longevity lock was found. <br/><br/>As for her... alive, she couldn’t be found, dead... <br/><br/>William suddenly clenched his hand; he really couldn’t accept any other outcome. <br/><br/>Ten years had passed, and the entire Lane family had been avoiding another outcome. <br/><br/>It felt like comfort, yet also like hope. VIsit n0(v)eLb(i)n.com for the best novel reading experience<br/><br/>As the years went by, hope dwindled, but the search for her never ended – like a small flame that would never burn out. <br/><br/>“F Continent has so many people, do you have to go there personally?” Olivia asked. <br/><br/>William remained silent, tacitly agreeing. <br/><br/>Olivia stared at him for a moment, then turned her gaze back to the window and grumbled, “Can’t you spare more time to be with me?” <br/><br/>“Olivia...” William looked at her, paused, and said, “I’m sorry.” <br/><br/>“I don’t need your apology.” Olivia retorted, “What good does saying sorry do? <br/><br/>You all like my sister, not me.” <br/><br/>Hearing her words, William chuckled, “Let me see, which ungrateful little person is saying this.” <br/><br/>“Hmph.” Olivia snorted. <br/><br/>William reached out and grasped her wrist, gently pinching: “I’ll try my best to come home more often.’ <br/><br/>He even felt that there was no difference between him and them in her heart. What’s more, if something happened one day, he could be broken up with and abandoned. But the relationships between her and the others would never change. <br/><br/>However he looked at it, his variability seemed greater. <br/><br/>In a word, at present, he felt very insecure, so much so that he couldn’t restrain his possessiveness. <br/><br/>Daisy Zane stared at him as if she understood what Kevin Clark was thinking. <br/><br/>She suddenly took another step forward and then grabbed Kevin Clark’s collar, pulling him into a bow and kissing him on the lips. <br/><br/>Once, twice, three times... <br/><br/>Kevin Clark had experienced being grabbed by the collar before. He understood her intentions the moment she moved. <br/><br/>So the instant her lips pressed against his, he embraced her, taking the initiative and kissing her gently. <br/><br/>In the vast parking lot, in this small corner, not exactly a hidden place, someone could appear at any time. <br/><br/>But between them, there was only each other, their souls constantly drawing closer. <br/><br/>After a long time, Daisy Zane leaned against his chest, and Kevin Clark finally let her go. <br/><br/>She had applied a faint lipstick on her lips, which had been smudged around the edges. <br/><br/>But the color of her lips was even redder than before. <br/><br/>Kevin Clark gently pecked the corners of her lips twice. His heart was racing fast, so his breath was somewhat rushed. He said with a smile, “The lipstick got smudged outside.” <br/><br/>Daisy Zane didn’t pay much attention to the remark. She loosened her grip on his collar and the clothes were now wrinkled. She took a light breath and asked, “Has your jealousy subsided?” <br/><br/>Kevin Clark took a handkerchief from his pocket and gently wiped the lipstick for her. “Half subsided.’ <br/><br/>“The other half you’ll have to digest yourself.” Daisy Zane’s voice became hoarser due to the cold, “Hard to please.” <br/><br/>Kevin Clark laughed softly, “Little girl, your difficult times are yet to come.” <br/><br/>Daisy Zane: “...Really?” <br/><br/>“Your tone indicates disbelief.’ <br/><br/>Daisy Zane didn’t say anything, but her raised eyebrows showed defiance and provocation. <br/><br/>Kevin Clark wiped her lipstick and kissed her again, “Be defiant, there will always be a day when you’ll be honest.” <br/><br/>Daisy Zane raised her eyebrows again, took the handkerchief trom him, and wiped his lips too. <br/><br/>The action was not gentle, somewhat casual. She stuffed the handkerchief back into his hand, turned around, and went to the elevator. Kevin Clark put the handkerchief away and followed her. <br/><br/>They waited for the elevator for a while. <br/><br/>As the elevator was about to arrive, Daisy Zane suddenly turned her head and said, “Kevin Clark.” <br/><br/>“Hmm?” <br/><br/>“Don’t worry, you’re better-looking than them all..”\t\t\t\t\t\t</div>", "images": {}, "success": true}