{"id": 243, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14258175.html", "title": "Chapter 243 - 232: Am I Drunk? I’M Pretending", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 243 - 232: Am I Drunk? I’M Pretending</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 243: Chapter 232: Am I Drunk? I’m Pretending <br/><br/>Translator: 549690339 <br/><br/>The room was only lit by the lamp on the head of the bed, casting a dim yellow glow throughout. <br/><br/>It was warm and tender, soothing the heart. <br/><br/>Kevin Clark held Daisy Zane in his arms, his head buried in the crook of her shoulder while his warm breath tickled her neck. <br/><br/>Daisy Zane felt a bit itchy, so she tilted her head and said, “Kevin Clark, get up.” <br/><br/>“Promise me first. You haven’t promised me yet.” Kevin Clark spoke gently. <br/><br/>When he spoke, her neck felt even itchier. Daisy Zane lifted her hand and pressed it against his forehead, raising his head. <br/><br/>The corners of Kevin Clark’s eyes seemed redder, and he looked at Daisy Zane with a mix of grievance and pity. <br/><br/>Daisy Zane: . <br/><br/>“Will you promise?” <br/><br/>“Shut up.” Daisy Zane whispered softly. <br/><br/>Kevin Clark’s hand rested on her waist, and he looked down at her for a while. Then he buried his head on her shoulder again, “Dizzy.” <br/><br/>“You...” Thi/s chapter is updated by nov(e)(l)biin.co/m<br/><br/>After Daisy Zane spoke, Kevin Clark suddenly straightened up and then bent down to pick her up horizontally. <br/><br/>“Kevin Clark...” <br/><br/>Daisy Zane had just uncovered the quilt on the bed. Kevin Clark gently placed her on the bed, covered her with the quilt, turned off the bedside lamp, and then laid down himself, hugging Daisy Zane who had just sat up. <br/><br/>“Kevin Clark.” Daisy Zane’s arm strained against Kevin Clark, her voice bearing <br/><br/>a or coldness. <br/><br/>Kevin Clark’s voice was too gentle and carried a touch of pity: “Miss, my head hurts.” <br/><br/>Daisy Zane: . <br/><br/>With his strong embrace, Kevin Clark didn’t give Daisy Zane any chance to resist. <br/><br/>Struggling against him was a waste of effort for Daisy Zane. If Kevin Clark really wanted to do something by force, she would likely be powerless. So, after a while, she relaxed her strength. <br/><br/>Feeling her easing the strength, Kevin Clark raised the corner of his mouth slightly in the darkness and whispered, “I won’t do anything. Just let me hold you for a moment.” <br/><br/>Daisy Zane ignored him. She didn’t want to talk to a drunkard. <br/><br/>Underestimating her, Kevin Clark tightened his arms, holding her even closer and gently kissed her hair, “I haven’t married my little girl yet. I won’t do anything. ” <br/><br/>Daisy Zane’s fingertips curled slightly, and her eyelashes trembled lightly. <br/><br/>“I just miss you too much.” Kevin Clark continued, “I can’t sleep.” “Didn’t we just see each other before we came back to the room?” <br/><br/>After waiting for a while, feeling the room’s temperature had cooled down, he went over and hugged her in his arms again. <br/><br/>Daisy Zane frowned with her back to him and muttered, “Hot.” <br/><br/>“Not hot anymore,” Kevin Clark whispered, “It has cooled down.” <br/><br/>Maybe it was this subtle hint that worked, for Daisy Zane didn’t move again. <br/><br/>Seeing her asleep, Kevin Clark allowed her to use his arm as a pillow and kept it properly on the bed. The other arm was also very properly wrapped around her waist, his hand resting on her belly, not daring to move recklessly. <br/><br/>Running to sleep in her bed was already too much; he couldn’t bully his little girl anymore. <br/><br/>The next day, a little past ten o’clock. <br/><br/>Everyone was up, but there was still no movement in Kevin Clark’s and Daisy Zane’s room. <br/><br/>At exactly eleven o’clock, the biscuits in the oven that Wilton Edwards put in were ready, but there was still no movement in the two rooms upstairs. <br/><br/>Daisy Zane loved to sleep, and being lazy in bed at times was quite normal. However, Kevin Clark, who had stayed here a few times, always woke up early every day. <br/><br/>He didn’t seem like a late sleeper. <br/><br/>Wilton Edwards felt more and more that something was wrong, so he asked Charles Amos to go upstairs and check. <br/><br/>Charles was asking Anisa Cooper and Melody Collins a math question. <br/><br/>A just-graduated college student... Anisa Cooper, who had never learned advanced math in college and had forgotten all her high school knowledge, and Melody Collins, who teaches her daughter basic math every day and is nearly forty years old. <br/><br/>Both were deep in thought about the question. <br/><br/>Neither of them wanted to admit to a child that they didn’t know the answer. But they really didn’t know. <br/><br/>So Anisa struggled a bit, “Charles, at your age, you should learn how to think independently.” <br/><br/>Little Charles looked at her with his round, innocent eyes. <br/><br/>Anisa was made uneasy by the purity in his eyes but still insisted, “Independent thinking is also a way to hone your abilities. For this question, the learning effect is completely different when others tell you the answer and when you figure it out yourself.” <br/><br/>“But I’ve been thinking about it all morning, and I can’t do it,” Charles told her. <br/><br/>“Then think about it for a while longer.” <br/><br/>“If you already know you can’t do it, continuing to think about it is a waste of time,” Charles said. “That’s not the attitude you should have towards learning; you can’t have that kind of mentality.” <br/><br/>Anisa: <br/><br/>Melody Collins smiled. <br/><br/>“I know, you don’t know, you’re just stalling for time,” Charles continued. “Anisa’s attitude is also not good. If you don’t feel shame in asking questions, you’ll progress.” <br/><br/>Just as Anisa was being educated by a child, Wilton Edwards called Charles <br/><br/>away. <br/><br/>He saved Anisa. <br/><br/>Anisa collapsed onto the sofa, “My God. As expected... Lucia’s son is no pushover either..”\t\t\t\t\t\t</div>", "images": {}, "success": true}