{"id": 257, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14279906.html", "title": "Chapter 257 - 246: Slap In The Face (The Previous Chapter Was Modified)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 257 - 246: Slap In The Face (The Previous Chapter Was Modified)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 257: Chapter 246: Slap in the Face (The previous chapter was modified) <br/><br/>Translator: 549690339 <br/><br/>Bonnie Maxwell’s eyes widened as she stared at Daisy Zane, her entire body petrified, stunned, unable to believe what she was seeing. <br/><br/>How did she do it? How is this possible? How could this be possible? <br/><br/>Daisy Zane disregarded her thoughts and handed the gun over to her. <br/><br/>Instinctively catching the gun, Bonnie Maxwell gazed at it for a while before spinning the cylinder open. <br/><br/>Just before spinning it open, she was confident that there was no bullet inside, but as soon as she opened it, there it was. <br/><br/>And if she fired again, this bullet could be shot out. <br/><br/>Kevin Clark’s eyes were on Daisy Zane all along. The sight of the bullet caught in his peripheral vision, startled him. <br/><br/>She pulled the trigger so decisively, he had thought that there might not be a bullet in there at all. <br/><br/>But... <br/><br/>Seeing Bonnie Maxwell’s reaction, James Collins chuckled, “Did you think my sister would cheat? Let me tell you, when you’ve got the skills, you don’t need cheap tricks.” <br/><br/>“How is this possible?” George Maxwell reacted, staring at the gun in disbelief. <br/><br/>“Why is it impossible?” James Collins folded his arms, speaking on behalf of his sister as if he were her spokesperson, “Just because you can’t do it, doesn’t mean my sister can’t. Her ability is so strong, it will make you kneel and scream ‘daddy.”‘ <br/><br/>The others gradually came to their senses, looking at Daisy Zane. <br/><br/>The admiration, even submission, was evident in their eyes. <br/><br/>This was more than just predicting the bullet’s location; she’d directly turned the bullet to a specific position and then slid it back into the gun. <br/><br/>And she didn’t hesitate when she pulled the trigger. <br/><br/>This was 100% confidence, precise knowledge that she would not make a single mistake. <br/><br/>Apart from Kevin Clark, no one else there dared to say they have this skill. Nor did they possess the guts to hold a gun to their own head. <br/><br/>“Miss Maxwell, it’s your turn,” Daisy Zane said, looking directly at her, hands in her pockets. Followw new chapters at novelhall.com<br/><br/>Bonnie Maxwell’s eyes slowly moved up to Daisy Zane’s face, stupefied as she observed the mocking expression on her beautiful face. <br/><br/>“What’s the matter? Not so brave now?” James Collins turned his mockery up to the max, “Just a moment ago, didn’t you act invincible, filled with a vainglorious sense of self-importance and arrogance? Now you’re scared?” Bonnie Maxwell’s face turned red, at a loss for words. <br/><br/>“If you’re scared to play, there’s no problem. Just admit defeat,” James Collins continued, “What were you saying before? Oh, calling yourself a wimp, a coward, admitting that you’re not as good as my sister. Well, go ahead and admit it.” <br/><br/>“You can’t go too far!” George Maxwell protested. <br/><br/>“This competition was your suggestion and the terms were set by you,” rebutted Allonzo Hobson, “The method of play was also agreed upon by you. Now that you’re losing, you’re blaming others for being unfair. What’s the matter? You think your family should have all the perks in this world?” <br/><br/>“If we really wanted to bully you, do you think you’d be able to talk now or even breathe?” Hugo Clark commented casually. <br/><br/>Bonnie suddenly took off her blindfold, looking at the gun with a mixture of shock, embarrassment, and anger in her eyes. <br/><br/>James, unceremoniously, burst out laughing. <br/><br/>Daisy Zane also chuckled and said lightly, “I bet the next shot is also blank.” <br/><br/>Bonnie glared at her, her eyes filled with spite, “That’s impossible.” <br/><br/>Daisy Zane’s cell phone buzzed twice, she took it out and glanced at it whilst replying to a message, “If the next shot isn’t blank, you win.” <br/><br/>“I don’t need that.” Bonnie said, and fired. <br/><br/>Her eyes even prepared to blink in anticipation. But... there was no bullet. <br/><br/>“Ha–” Xavier couldn’t help but laugh. <br/><br/>“Oh my god, I can’t- -” James bent over laughing, “Sweet lady, are you here to amuse me today? You’re going to kill me with laughter. You sounded so confident.’ <br/><br/>Bonnie looked at the gun in her hand, she couldn’t have made a mistake, it was impossible. She fired again, this time it did go off. <br/><br/>Anticipating her action, Daisy and Arthur shielded Charles’ ears. Their hands crashed together. Daisy noticed that Arthur’s hand was unusually cold. <br/><br/>It was rare for Arthur’s hands to be cold. <br/><br/>The two exchanged a look, no need for words, each covering one of Charles’ ears. <br/><br/>The echo from the shot rang in Bonnie’s ears. It felt like the bullet had hit her face instead of the shooting range. <br/><br/>Her pride of over the years was trampled underfoot today, and in front of so many people at that. <br/><br/>By afternoon, the whole military district would know. They’d say she was inferior, that she was nothing. <br/><br/>Her face felt like it was on fire, as if it had been slapped hard. <br/><br/>But she would never bow down to a damn girl, she was Miss Maxwell, born noble. She would never lower her head to a damn girl. <br/><br/>Even if she lost, she would lose with dignity. So she straightened her back and said to Daisy, “I lost.” <br/><br/>Daisy fixed her gaze on her, took her hand from Charles’ ear and it was immediately held by Arthur, “We all saw it.” <br/><br/>James quickly added, “Not only did you lose, you lost terribly.” <br/><br/>Bonnie didn’t bother with him, she took a deep breath, “Say it, what do you want?” <br/><br/>Her tone was like she was bestowing charity. <br/><br/>James clicked his tongue lightly, if this was not the place, he would have long torn the mouths of these two siblings. <br/><br/>Daisy gave her a look, then turned to George Maxwell, and whispered, “Tell him to apologize.” <br/><br/>“Apologize for what?” Bonnie frowned. <br/><br/>“Apologize to Michael Jackson and Juan Wright..”\t\t\t\t\t\t</div>", "images": {}, "success": true}