{"id": 253, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14276906.html", "title": "Chapter 253 - 242: War Is Deceit", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 253 - 242: War Is Deceit</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 253: Chapter 242: War is Deceit <br/><br/>Translator: 549690339 <br/><br/>The moving target consists of randomly thrown targets from various directions in the sky. <br/><br/>The range of Type 64 handgun is only fifty meters. <br/><br/>So you can only hit the target if it enters your firing range. <br/><br/>Daisy Zane and Kevin Clark stood side by side, with a distance of only one meter between them. But if the target appears from one of their directions, the other person would be at a disadvantage due to the distance. <br/><br/>Moreover, the targets appear randomly. If all seven targets appear from one person’s direction, the other person would be at a disadvantage in each instance. <br/><br/>However, for skilled shooters, these factors are not a problem. <br/><br/>What matters is not only accurate marksmanship, but also shooting speed, reaction speed, distance judgment, and timing of firing. <br/><br/>“Enamel, who do you think will win?” Allonzo Hobson asked Hugo Clark by his side. <br/><br/>“Third Uncle,” Hugo Clark answered without hesitation. <br/><br/>“Definitely my sister,” James Collins said. <br/><br/>Hugo Clark gave him a glance, assuming he was just supporting his sister for the sake of it, and did not argue with him. <br/><br/>“Let’s place bets,” Allonzo Hobson put his arm on James Collins’ shoulder and smiled, “I bet 1 million on Brook Sister’s victory.” <br/><br/>“You have good taste,” James Collins crossed his arms, “I also bet 1 million on my sister’s victory.” <br/><br/>Hugo Clark glanced at Allonzo Hobson and then looked at Michael Jackson and Juan Wright: “You two.” <br/><br/>Juan Wright smiled at Hugo Clark and said, “I bet 1 million on my teacher’s victory.” <br/><br/>Hugo Clark: ‘ <br/><br/>Allonzo Hobson and James Collins both laughed. <br/><br/>Then everyone’s eyes fell on Michael Jackson. <br/><br/>Michael Jackson coughed lightly and touched his nose, saying, “1...1 abstain.” <br/><br/>Hugo Clark: ‘ <br/><br/>Juan Wright gave him a light nudge with his elbow, “Can you do it or not?” <br/><br/>Michael Jackson deflected it with his hand and said with a smile, “I need to save money for my wife.” <br/><br/>“Brother,” Juan Wright patted him on the shoulder, “first of all, you need to have a wife. <br/><br/>Michael Jackson smiled but didn’t speak. <br/><br/>Allonzo Hobson looked at Hugo Clark again, “Enamel, last chance, who do you bet on?” <br/><br/>Hugo Clark met his gaze and said softly, “5 million on my Third Uncle.” <br/><br/>“Enamel, you better think it over,” Allonzo Hobson said, “My Brook Sister is really strong.” <br/><br/>Hugo Clark didn’t say anything. <br/><br/>Again, the few people behind him were speechless: <br/><br/>As long as Daisy was replaced with one of them, without considering whether they dared to play like this, in the end, Kevin would press their heads and make them admit defeat. <br/><br/>Indeed... people always have double standards. <br/><br/>“One request.” Kevin reached out and placed a strand of her hair blown forward back, saying, “Feel free to ask.” <br/><br/>“I’ll think about it,” Daisy said indifferently. <br/><br/>“Mm.” <br/><br/>Soon after, the few people behind him started shouting for Hugo Clark to pay up. <br/><br/>Of course, it was mostly Allonzo Hobson and James Collins who were the vocal ones. <br/><br/>Hugo was bothered by their clamor, as he had truly underestimated her skill. It was mainly because he couldn’t believe someone could match his Third Uncle’s amazing marksmanship. <br/><br/>He glanced down at Charles Amos, looking up at him, then said, “With the child here, you two have the nerve to shout for money.” <br/><br/>“What? Why? Do you want to renege on the deal!” cried Allonzo, “Hey! Kevin, keep an eye on your big nephew; he wants to renege on the deal.” <br/><br/>Kevin didn’t respond to him. <br/><br/>Hugo glanced at Kevin, and the look in his eyes clearly said, “You’ve betrayed my trust.” <br/><br/>But Kevin looked back at him, as if to say, “What’s it to you if I fail you?” <br/><br/>Being used to Kevin’s ruthlessness, Hugo didn’t show any reaction but said, “I’ll transfer the money to Charles.” <br/><br/>Charles’s eyes widened, and then he looked at Daisy. Seeing the look in her eyes, Charles said, “Brother, I don’t want it.” <br/><br/>“That’s fine,” Kevin said, “I’ll send you my bank account number later.” <br/><br/>Just as Daisy was about to speak up, Kevin pulled her back and whispered, “It’s okay, he has plenty of money. If you don’t take it, it’s a waste. You have to let Charles save some for my retirement fund too.” Daisy: <br/><br/>James Collins said, “I have no objections.” <br/><br/>“Neither do I,” Juan Wright agreed. <br/><br/>However, Allonzo squatted down next to Charles and said very seriously, <br/><br/>“Baby, remember, this money isn’t from your Brother Hugo. It’s from your Brother Juan Wright, Brother Xavier Dominic, Brother James Collins.” <br/><br/>“I’m Uncle,” James Collins reminded him. <br/><br/>Allonzo looked up at him, “How can you take advantage of me.” <br/><br/>“If I don’t have to give out red envelopes, I don’t mind having another nephew,” James Collins laughed. <br/><br/>“Get out of here!” Allonzo picked up a small stone from the ground and threw it at James, “Go play somewhere else, kid.” <br/><br/>Charles cast another glance at Daisy, who didn’t intercede, and then looked at <br/><br/>Kevin. Then he said to Hugo, “Thank you, Cousin.” <br/><br/>Daisy: <br/><br/>Everyone paused for a moment, then burst into laughter. <br/><br/>James Collins pulled at his braid, “Why do you acknowledge kinship when you see money? You little money-grubber..”\t\t\t\t\t\t</div>", "images": {}, "success": true}