{"id": 250, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14275431.html", "title": "Chapter 250 - 239: Lending You Half Of The Bed Again", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 250 - 239: Lending You Half Of The Bed Again</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 250: Chapter 239: Lending You Half of the Bed Again <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane left in a good mood with the few bills and exited the room. When she was making her way to her own room, she noticed Arthur North still standing at the entrance. <br/><br/>Arthur North looked at her and saw the money in her hand, “This is...” <br/><br/>“Stolen.” Daisy Zane replied. There were eight bills. <br/><br/>Arthur North gave a slight laugh, “Even taking from a child.” <br/><br/>“Who can blame me when he’s so small and easy to bully?” Daisy Zane pocketed the money. She then leisurely walked up to him, looked at him, and said after some thought, “Third Master... do you want me to lend you half of my bed?” Arthur North’s behavior was somewhat unusual, Daisy Zane probably thought for a moment before she tentatively asked. <br/><br/>At her guess, the bright light that emerged on Arthur North’s face beneath his shock proved her speculation. <br/><br/>Daisy Zane immediately had ill intentions. She took another step forward, shifted her gaze from his lips to his eyes, and looked deeply into them as she said, “Third Master, what do you think of my proposal?” <br/><br/>Arthur North lowered his eyes to her, his throat involuntarily swallowing. <br/><br/>Daisy Zane met his gaze and said after a while, “Last night... I wasn’t very drunk.” <br/><br/>Arthur North’s pupils trembled, “I...” <br/><br/>She had guessed right again. <br/><br/>Daisy Zane gave a soft laugh, “Third Master... not very righteous.” <br/><br/>Arthur North took a breath and rather helplessly said, “I just couldn’t help myself. ” <br/><br/>He paused before adding, “I’m sorry.” <br/><br/>“What about tonight? Still borrowing?” Daisy Zane inquired again. <br/><br/>Arthur North clenched his fist, his forehead’s veins bulging, as the inner struggle seemed to tear him apart. <br/><br/>This kind of little girl was too alluring, like the cold, slanted moonlight transformed into an enchanting fairy. <br/><br/>Arthur North’s already weak will towards her was barely holding up. <br/><br/>He raised his hand to hold her chin, his voice threatening, “Little girl, if you continue teasing, I can’t guarantee nothing will happen.” <br/><br/>“What will happen?” “What do you think?” “Slept with me?” <br/><br/>“You...” <br/><br/>Daisy Zane smiled as her eyes seemed to confirm that Arthur North wouldn’t do anything to her, so she brazenly teased him. <br/><br/>Arthur North resisted for two seconds before he directly swept her off her feet and carried her into her room, kicking the door open. <br/><br/>He carried her straight to the bed, placing Daisy Zane on it. Then, he pressed himself on top of her, kissing her. <br/><br/>Kevin Clark glanced at it subconsciously and saw that it was from someone labeled “Assistant.” <br/><br/>He raised an eyebrow but didn’t think much of it and left the room. <br/><br/>The Assistant sent Daisy Zane three messages in a row. <br/><br/>[School is starting soon, and you haven’t submitted your vacation experiment report yet.] <br/><br/>[Make sure the format is correct, or the professor will give you trouble again.] <br/><br/>[Your application for deferred graduation has been accepted, and you need to confirm it in person.] <br/><br/>The variety show recording for “Going to School” was set for September 16th. <br/><br/>And the name was quite simple, just called “Going to School.” Easy to understand and straightforward. <br/><br/>Originally, there were six people scheduled to participate in the recording, with guest stars appearing in between. However, due to the addition of Daisy Zane, Director Nash wanted to find one more person to make it an even number. <br/><br/>After considering many options, Director Nash approached George Dunn. But George quickly rejected him. He was waiting for Brook God’s new script, and he didn’t have the time. <br/><br/>However, Director Nash wasn’t worried about his rejection. He casually told him that Brook God was also participating. <br/><br/>After confirming the truth of the matter, George immediately agreed. <br/><br/>He even bribed the director to make sure he and Brook God would be in the same class. <br/><br/>There were still half a month left until the variety show recording. During that time, Daisy Zane was also very busy. <br/><br/>She spent most of her time in the laboratory. <br/><br/>She finished her vacation report, handed it in, and got it approved. But, as soon as the new semester began, she received new tasks. <br/><br/>Moreover, Daisy Zane had more tasks than anyone else. <br/><br/>The Assistant even told her [capability brings more responsibility] <br/><br/>This meant that she had more tasks than others. <br/><br/>For more than a week, Daisy Zane only rested an average of three hours a day, and on some days, she even stayed in the laboratory overnight. <br/><br/>Kevin Clark, who was also busy, felt very worried and distressed every time he saw the red veins in Daisy’s eyes during video calls. <br/><br/>He asked Wilton Edwards, who told him Daisy barely went home and was always busy. When she did come home, she only stayed for a few hours before leaving again. <br/><br/>While Kevin Clark had some free time, he went to see Daisy Zane. He happened to catch her just as she got home. Daisy Zane didn’t say two words to him before going straight to her room to sleep. <br/><br/>Kevin Clark: What was she so busy with that she was exhausting herself like this? <br/><br/>Worried and distressed, Kevin Clark didn’t notice the strong smell of chemical drugs on Daisy Zane’s body. <br/><br/>It was the same smell he had encountered in the laboratory these days.\t\t\t\t\t\t</div>", "images": {}, "success": true}