{"id": 256, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14278335.html", "title": "Chapter 256 - 245: Scaring Everyone Silly", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 256 - 245: Scaring Everyone Silly</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 256: Chapter 245: Scaring Everyone Silly <br/><br/>Translator: 549690339 <br/><br/>Bonnie Maxwell’s move was to embroil Daisy Zane in this matter. <br/><br/>Either Daisy Zane would be too frightened to do anything out of fear, or she would end up with one useless arm. <br/><br/>Of course, at this place, and for the sake of Kevin Clark’s face, Bonnie would not dare to ruin Daisy’s arm for real. <br/><br/>Because she was certain that Daisy could not predict where the bullet was. Daisy would definitely move the gun elsewhere out of fear. <br/><br/>But if she really does ruin an arm, that would be an unexpected gain. <br/><br/>Both parties in the competition must be willing to accept a loss. <br/><br/>At most, she would have to apologize to the Clark Family; her father would protect her, and the Clark Family would never cause trouble with her or her family for the sake of a lowly girl. <br/><br/>As long as enough time passes, this incident will invariably be forgotten. <br/><br/>That way, there is no loss in competing. <br/><br/>“Is such a small, broken competition even worth my sister’s time?” James Collins, holding Charles Amos’s hand, sent him to Juan Wright’s side, then walked to Daisy’s side and said to Bonnie, “I’ll compete with you.” <br/><br/>“What does it have to do with you?” George Maxwell disdainfully said, “If she’s too scared, she just has to admit that she’s a coward and not as good as my sister. What are you doing, substituting for her?” <br/><br/>“Me competing with her is already giving her a lot of face,” said James Collins, <br/><br/>“And now you want my sister to make a move? Have you no shame?” <br/><br/>Bonnie ignored him and looked directly at Daisy: “Do you want to compete? If not... just give up.” <br/><br/>Daisy glanced at her, said nothing, and picked up a revolver from the side. <br/><br/>“Sister...” called James Collins. <br/><br/>Daisy looked down at the gun in her hand and said, “Don’t interfere.” <br/><br/>They had always obeyed Daisy’s words. Telling him not to interfere meant that <br/><br/>James Collins dared not say anything more; he just kept his eyes on the gun in her hand. <br/><br/>At this moment, Kevin Clark and the others returned. <br/><br/>“What’s going on?” Kevin noticed Bonnie and George Maxwell from afar, then hurriedly walked over to Daisy’s side. <br/><br/>Daisy was spinning the cylinder of the revolver in her hand and raised her eyes to look at Kevin when she heard him: “It’s nothing; just a little competition.” <br/><br/>When Bonnie saw Kevin’s disregard for everything around him, she felt as if her heart was bleeding. She bit her teeth hard to prevent her lips from trembling. <br/><br/>Kevin’s appearance has always been very aggressive. Among their group of friends who had known him for so long, regardless of whether he was smiling or not, his most common appearance was one of deep aggression. <br/><br/>Who had ever seen Third Master Clark so gentle and affectionate before meeting Daisy? <br/><br/>That alone was enough to drive Bonnie mad. <br/><br/>She had loved this man for so long, and silently given so much for him. How could she bear to see him look at another woman like that? She had to have this man in her grasp. <br/><br/>He had faith in her, but... faith was not the same as a lack of worry. <br/><br/>Once the bullet was loaded, Daisy lightly turned the cylinder with her left hand. <br/><br/>The sound of the cylinder rolling was quiet and almost imperceptible in the vast shooting range. <br/><br/>However, it sounded like it had been amplified a hundred times in everyone’s ears, as if the sound could vibrate their eardrums. <br/><br/>No one knew what Daisy had in mind, but they all felt inexplicably tense. <br/><br/>The sound of the cylinder rolling stopped when she snapped it back into place. Immediately after, the sound of the hammer being pressed down could be heard. <br/><br/>At that sound, everyone’s hearts tightened. <br/><br/>Daisy’s following action raised everyone’s hearts to their throats, and they all held their breaths. <br/><br/>She held the gun in her right hand, her thumb pressed down on the hammer, and then pointed the gun directly at her temple. <br/><br/>As everyone held their breaths and their bodies stiffened, she pulled the trigger. <br/><br/>Click, click, click, click. Click.” <br/><br/>Five times in a row. <br/><br/>Each sound crisp and decisive, without any hesitation. <br/><br/>With each trigger pull, Bonnie Maxwell’s eyes widened. But after the fifth time, Daisy was unharmed. <br/><br/>Even those standing beside her were frightened. <br/><br/>Each sound was like a giant hand grabbing and squeezing everyone’s hearts. <br/><br/>Juan Wright’s legs trembled, and if it weren’t for Michael Jackson’s support, he might have already collapsed. <br/><br/>Michael’s face turned pale, even his lips losing color. <br/><br/>Although there was no change in Hugo Clark’s facial expressions, the hand in his pocket clenched tightly, and his heartbeat quickened with every sound. <br/><br/>Xavier Dominic touched his heart, and only after a while did he suddenly inhale deeply, taking in a breath of fresh air. He felt like his heart and lungs were about to burst. <br/><br/>Charles Amos ran to Daisy, looked up at her with reddened eyes. If the situation lasted any longer, tears might have spilled from his eyes. Only when he saw that Daisy was fine did he forcefully hold back his tears. <br/><br/>In the entire shooting range, only Arthur North and James Collins seemed somewhat normal. <br/><br/>James was completely trusting in Daisy. <br/><br/>Aside from trusting her, Arthur was also forcing himself to hold up, at least partway. <br/><br/>Yet even with his efforts, Hugo noticed the signs – the restraint in trying to calm himself down, making all the worries and fears turn into boundless murderous aura. <br/><br/>Upon closer inspection, one could see that his clenched hand was trembling slightly. <br/><br/>In the whole shooting range, Daisy seemed to be the only one who remembered their competition. <br/><br/>The black blindfold contrasted sharply with her fair skin, creating a strong visual impact. <br/><br/>Her pale pink lips curved into a beautiful arc. <br/><br/>In an instant, she untied the blindfold around her eyes, hooked the gun on her fingertip, and handed it to Bonnie Maxwell. She said, “Miss Maxwell, it’s your turn now..”\t\t\t\t\t\t</div>", "images": {}, "success": true}