{"id": 255, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14278334.html", "title": "Chapter 255 - 244: Accepting The Challenge", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 255 - 244: Accepting The Challenge</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 255: Chapter 244: Accepting the Challenge <br/><br/>Translator: 549690339 <br/><br/>The afternoon sun was a bit harsh. Juan Wright and Michael Jackson stepped forward, instantly shielding Daisy Zane and Charles Amos from the sun. <br/><br/>Little Charles also adjusted his position so that Michael Jackson could block the sun even more thoroughly. <br/><br/>Then, because of his cleverness, he turned to Daisy Zane and smiled. Ignoring Bonnie Maxwell’s words completely. <br/><br/>Daisy Zane glanced at him, then raised her eyes to look at the backs of the two men in front of her: “I’m not interested,” she said. <br/><br/>“Are you not interested, or are you scared?” Bonnie Maxwell asked. <br/><br/>Daisy Zane ignored her. <br/><br/>James Collins assembled his gun and fired, breaking the awkward silence that had appeared all of a sudden. <br/><br/>George Maxwell chuckled: “She must be scared, after all... The ones brought by <br/><br/>Third Master, if they lose, it is Third Master’s face they are losing.” <br/><br/>Daisy Zane didn’t listen to his words. However, James Collins was about to speak, when Michael Jackson made his move. <br/><br/>He twisted George’s arm around his back in two movements, bending his waist. <br/><br/>“Ah!” George screamed in pain. He tried to fight back, but Michael Jackson was too strong. The struggle only made it more painful for him, “What are doing you doing! Let me go, Michael Jackson!” <br/><br/>“Michael Jackson, let him go.” Bonnie Maxwell took a couple of steps forward, but was blocked by Juan Wright. <br/><br/>“What do you think you’re doing?” Bonnie Maxwell glared at them. <br/><br/>“Lady Maxwell,” Juan Wright beamed at her, “Third Master has instructed us before he left to not allow anyone to approach this area. We’ve already politely told you both. However, Young Master Maxwell not only didn’t leave, he was also bad-mouthing us. Might as well start a friendly match.” <br/><br/>James Collins looked at them, his mouth curving slightly upward. They were true followers of Kevin Clark. They always followed protocol and were relentlessly strict on their principles. <br/><br/>Bonnie Maxwell saw George’s face turn pale due to pain but she couldn’t attack them, so she warned: “Michael Jackson, don’t go overboard.” <br/><br/>“Nothing’s overboard, we’re just having a friendly match,” Juan Wright, his fox-like eyes glinting with innocence. <br/><br/>Michel Jackson followed up calmly: “Lady Maxwell, I really didn’t want to, but it’s Young Master Maxwell’s mouth that... ‘ <br/><br/>“Was I wrong? She is just afraid,” George Maxwell, who was gasping in pain, blurted out. “She’s afraid of losing face here. She’s afraid others around would find out she is nowhere close to my sister. People would start to think: ‘the girlfriend Third Master has is completely unable to handle being Mrs. Clark’” <br/><br/>His comment, neither loud nor soft, was heard by everyone present. <br/><br/>The complexion on Bonnie Maxwell’s face turned even paler. <br/><br/>“Michael, let him go.” Daisy Zane finished typing her message and sent it. <br/><br/>Upon hearing her, Michael immediately let go of his grip. <br/><br/>George Maxwell instantly backed off, muttering and cursing while clutching his shoulder, and retreated to Bonnie Maxwell’s side. <br/><br/>Michael Jackson and Juan Wright paid him no further attention, waiting instead for Daisy Zane’s next instruction. <br/><br/>Bonnie Maxwell glared at George, indicating for him to shut up. But George remained indignant, grumbling and complaining. <br/><br/>Daisy Zane put away her cell phone, stood up, and looked at Bonnie Maxwell, casually asking, “What are we competing over?” <br/><br/>Hearing her voice, both James Collins and Charles Amos turned their heads towards Daisy Zane. <br/><br/>A flash of resentment flickered in Bonnie Maxwell’s eyes, but she didn’t say anything. She really wanted to compete, to embarrass Daisy, but George’s outburst had made a spectacle of them. <br/><br/>She regretted having impulsively invited George to come. <br/><br/>“What happened? Weren’t you saying you wanted to compete?” Daisy Zane looked at Bonnie and said, “Are you scared?” <br/><br/>Bonnie Maxwell gave a soft laugh: “Scared? I’m afraid you’re the one who’s scared.” <br/><br/>“Say it then, what are we competing over?” Daisy Zane glanced at the revolver that Bonnie had touched earlier, “Are we competing with this? How?” <br/><br/>“Teacher, think twice.” Juan Wright suddenly whispered a word of caution. <br/><br/>Daisy Zane shot him a look. It was a plain and peaceful glance, but Juan Wright read deep, complex meanings from it that reassured him greatly. <br/><br/>So, he stopped talking. <br/><br/>“Let’s compete with this.” Bonnie Maxwell, dressed in combat gear, walked forward a few steps and picked up the revolver again, “Do you dare?” <br/><br/>“How do we compete?” Daisy Zane seemed to find her talkative. <br/><br/>Bonnie Maxwell smiled, opening the cylinder of the revolver, and said: “This revolver can load six bullets. We will blindfold ourselves, load only one bullet, spin the cylinder, and take turns shooting at our arms. Let’s see who the bullet hits. ” <br/><br/>“Teacher.” <br/><br/>“Lady Zane...” <br/><br/>Seeing the worried expressions of Juan Wright and Michael Jackson, Bonnie Maxwell’s smile turned nastier: “Of course, if you can predict where the bullet is, you can aim it elsewhere. But if the shot you fire elsewhere is empty, or if the bullet hits in the shot you take at your own arm, you lose..”\t\t\t\t\t\t</div>", "images": {}, "success": true}