{"id": 259, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14280859.html", "title": "Chapter 259 - 248: Old Age", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 259 - 248: Old Age</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 259: Chapter 248: Old Age <br/><br/>Translator: 549690339 <br/><br/>Charles Amos was just a child, after all; several adults were already frightened, let alone a nine-year-old child like him. <br/><br/>Daisy Zane glanced down at him for a while and said, “It’s not okay.” <br/><br/>“What if it is?” <br/><br/>“There is no what if.’ <br/><br/>“How do you know there’s no what if?” Charles countered. “I know because I put the bullet in,” Daisy replied softly. “You... you’re being unreasonable,” said Charles. “And you’re making a fuss for no reason.” <br/><br/>The other men: <br/><br/>Charles was speechless. He just wanted to get angry and make a fuss so that she would learn not to take her own life for granted. <br/><br/>“Let go,” Daisy’s voice became colder, “Don’t keep going on and on.” <br/><br/>Charles’s chubby cheeks puffed up more, and he glared at her, holding onto her leg with both hands. <br/><br/>“Let go.” <br/><br/>“I won’t, you apologize and promise not to do that anymore.” <br/><br/>“Do you want me to beat you again?” <br/><br/>Charles stared at her but didn’t say anything. <br/><br/>Daisy Zane looked down at him, and after a while, said, “Don’t make me hit you.” <br/><br/>“You’re a dictator!” Charles growled angrily. <br/><br/>“What’s wrong with being a dictator?” <br/><br/>Little Charles was obviously no match for Daisy in terms of skill level and instantly didn’t know what to say anymore. Even his momentum shrank by half. <br/><br/>The other men just watched the show, not one of them offering to help him. <br/><br/>They just watched him lose. <br/><br/>Daisy Zane asked, “Are you coming or not?” <br/><br/>“I, I...” Charles thought for a while and decided to use a last-ditch move. He said, “You... promise not to do this again. Otherwise... I’ll message Dad and tell on you.” <br/><br/>Except for Kevin Clark, those present didn’t really know much about Charles’s background. <br/><br/>Even James Collins didn’t know much. He only knew that the child had been with Daisy since he met her. <br/><br/>He didn’t ask too many questions, and the only thing he knew was that the child had no blood relation to her. <br/><br/>Hugo Clark knew even less. <br/><br/>At this moment, when the word ‘father’ was mentioned, his first instinct was to look at Kevin Clark. <br/><br/>But Kevin just watched the young and old with a smile in his eyes. Upon hearing Charles’s words, he lifted his eyebrows gently, then observed Daisy’s reaction. <br/><br/>There were no signs of jealousy, envy, or unhappiness in his expression. <br/><br/>Daisy looked down and stared at Charles with narrowed eyes. <br/><br/>Little Charles’s heart skipped a beat or two due to her gaze, but he still braced himself and said, “I’ll tell him right now.” <br/><br/>Then, he let go of her leg with one arm and went to grab his cell phone. Read latest novels at novelhall.com<br/><br/>Daisy watched as he unlocked her phone, then found the mobile number that Jack Amos used to use. <br/><br/>After all, the program team had already communicated with the teachers of all subjects, and the eight participants had only to follow the teachers’ instructions. <br/><br/>Moreover, it is a two-week closed recording. <br/><br/>During the weekends, the students can go home or leave the school like those who stay in the lodgings. The rest of the time, they must be in school. <br/><br/>No one is allowed to go out at noon and evening. <br/><br/>The only consolation is that they can use their cell phones after returning to the dormitory. <br/><br/>After meeting with the program team, Daisy Zane went home in the evening and began packing her clothes and daily necessities. <br/><br/>Hill Dawson and Anisa Cooper returned to Truro City for a while and came back yesterday at noon. <br/><br/>The two of them went back to the villa and packed things together for Daisy Zane. <br/><br/>Meanwhile, Daisy and Kevin were in the living room, taking Charles’ game controller and playing video games. <br/><br/>Little Charles, feeling wronged, stood by and watched the two of them play, trying to make them feel guilty. <br/><br/>However, the two were chatting away while playing, completely ignoring Charles watching. <br/><br/>So, after a while, he went to play the piano on his own. <br/><br/>Kevin saw him leave and, while playing the game, said, “The artists participating in this variety show are generally quite young.” <br/><br/>“Really?” asked Daisy Zane. “Is George Dunn young?” <br/><br/>“Apart from George Dunn, the other four are quite young,” Kevin said, focusing on the game. <br/><br/>The other four... <br/><br/>Out of the eight, three are girls. Aside from George Dunn, the other four were specifically mentioned. <br/><br/>Daisy raised the corners of her mouth slightly and said, “Oh, yes, they are quite young. One is just 19.” <br/><br/>Kevin glanced at her. Taking advantage of this, Daisy swiftly made a series of moves, defeating Kevin’s side in the game. <br/><br/>The large display screen showed the two letters “K.O.” on his half. <br/><br/>Kevin didn’t care and put down the controller. Looking at Daisy, he said, <br/><br/>“What’s wrong with being 19?” <br/><br/>“19... young, innocent...” Daisy looked into his eyes, “energetic, full of vitality...” <br/><br/>Even though he knew she was doing it on purpose, Kevin’s pupils still trembled slightly. <br/><br/>He held her chin with the web of his thumb and index finger, his voice somewhat threatening as he asked, “Are you trying to upset me on purpose again?” <br/><br/>“You said it yourself,” Daisy said, looking at him calmly. <br/><br/>Looking at her eyebrows and eyes, and her smug expression after achieving her goal, Kevin had no choice but to kiss her on the lips and say, “Miss Zane, you have a boyfriend. No matter how young or good-looking others may be, you must not look at them too much. Understand?” <br/><br/>Daisy’s lips curved up slightly, and she raised her hand to hook his jaw, saying, “Don’t worry, you have the advantage of being older.” <br/><br/>“What kind of advantage is that?” <br/><br/>Daisy pulled his hand away and stood up, saying, “The advantage of being respected as an elder.” <br/><br/>“You...” <br/><br/>Kevin was just about to reach for her when Daisy quickly moved one step ahead. <br/><br/>After taking that step, she turned back and raised an eyebrow at Kevin nonchalantly. <br/><br/>Kevin:..\t\t\t\t\t\t</div>", "images": {}, "success": true}