{"id": 251, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14276260.html", "title": "Chapter 251 - 240: Donated All The Income", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 251 - 240: Donated All The Income</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 251: Chapter 240: Donated All the Income <br/><br/>Translator: 549690339 <br/><br/>After finishing the work at the lab that day, Daisy Zane went home and slept for a full day. <br/><br/>She was in a near-comatose state for half of the morning and spent the other half arguing with the bald professor in her dreams. <br/><br/>Finally, she woke up a little after 10 PM, feeling hungry. <br/><br/>As she descended from the upstairs, she saw Kevin Clark sitting in the living room chatting with Wilton Edwards. She had taken a shower, and her hair was half-dried. Kevin asked her, “Did you have a good sleep?” <br/><br/>“Not bad.” Daisy sat on the sofa next to him, “When did you arrive?” <br/><br/>“About an hour ago.” Kevin said, noticing that she had a good rest, “Done with the busy work?” <br/><br/>“Yep.” Daisy took out and ate a cheesecake that Cole Amos had left by the tea table, “You’ve been quite free today as well.” <br/><br/>The last time they met, she had hardly said more than a few words before heading upstairs to sleep. Later, she heard from Wilton that Kevin had left almost immediately after going upstairs to check on her, not even staying for ten minutes. <br/><br/>Here he was, staying for an hour this time. <br/><br/>“Yeah.” Kevin replied, “I’ll be done with my work soon.” <br/><br/>Wilton went to check on the meal being prepared by the servants. After finishing her cheesecake, Daisy asked Kevin about the file bag on his hand, “What’s inside?” <br/><br/>Kevin showed her, “Jadeite pricing from D Continent, Felix Baker went there again. ” <br/><br/>Daisy: <br/><br/>“Take a look and help set a price.” Daisy took the file bag, “You really want me to set the price?” <br/><br/>“Yes.” Kevin replied with a smile. <br/><br/>Daisy raised an eyebrow but didn’t hesitate to open the file bag. She examined the previous jadeite pricing and price fluctuations over the years. <br/><br/>“I heard that Felix has a huge warehouse in his house filled with treasures,” <br/><br/>Kevin mentioned. <br/><br/>“Not bad, there are quite a few items, but not many are really valuable,” Daisy commented while looking through the files, “Nowhere near as extravagant as your courtyard paved with jadeite.” <br/><br/>Kevin chuckled and remained quiet for a moment before bringing up, “Did you donate your entire salary from ‘Fall of the Quince’?” <br/><br/>Surprised, Daisy looked at him, “How did you know?” <br/><br/>Then she remembered and said, “Oh, the charity foundation was run by your family.” <br/><br/>Kevin added, “Hugo Clark saw it. He told us, and Xavier Dominic found out. He said it was your entire salary from that show.” <br/><br/>Together, they discussed many questions about ancient clothing. <br/><br/>It had been a long time since they had enjoyed such in-depth conversations. <br/><br/>Three days later, in the afternoon, Daisy Zane was cutting Charles Amos’ hair. <br/><br/>Due to a mistake, a tuft of hair was cut too short, causing the curls to stick out. <br/><br/>It was very obvious among the curls and couldn’t be smoothed down. <br/><br/>Charles looked at her resentfully, while she stared emotionlessly at the tuft of hair. <br/><br/>James Collins and Wilton Edwards watched the two, neither saying a word, wondering whether the tuft of hair or the whole head of hair would be unlucky first. <br/><br/>At that moment, Arthur North and his friends arrived. <br/><br/>Before they even entered, Henry Horton shouted, “Brook Sister, let’s go. I’ll show you around.” <br/><br/>Hearing the voice, Charles quickly covered the tuft of short hair with his hand. <br/><br/>Daisy Zane, holding scissors, turned to look at the living room entrance. <br/><br/>Arthur North, Henry Horton, Michael Jackson, and Juan Wright walked through the door. Except for Arthur North, the others were dressed very neatly, like soldiers. <br/><br/>Only Arthur North was still wearing a black shirt. <br/><br/>Daisy Zane raised her eyebrows, her eyes showing a hint of interest, “What’s up? A mission?” <br/><br/>Arthur North laughed, “No.” <br/><br/>Daisy Zane’s interest disappeared instantly. <br/><br/>Seeing her change of expression so quickly, Henry Horton laughed, “Really no mission. But the Third Military District is semi-open to the public today. Do you want to have a look, Brook Sister?” <br/><br/>The Third Military District was under the command of Nathan North. The formidable James’s Group and White Tiger Squadron were all based there. Daisy Zane’s interest was piqued once again, “Semi-opening... is it fun?” “Relatives have special privileges,” said Arthur North. <br/><br/>“What about the relatives of the relatives?” James Collins suddenly asked. <br/><br/>“You can only see the semi-open stuff,” replied Arthur North. <br/><br/>James Collins: <br/><br/>Arthur North glanced at Cole Amos and Wilton Edwards and said, “Cole Amos and Wilton Edwards, you should come too.” <br/><br/>“Young master, go ahead. I won’t go,” Wilton Edwards said with a smile, “I don’t understand any of those things. If I go, I’ll just be staring blankly.” <br/><br/>Daisy Zane held up her scissors, looking at Arthur North with probing eyes. <br/><br/>And Arthur North’s smile seemed ingratiating, all that was missing were the words “I really invited Wilton Edwards, no ulterior motives” written all over his face..\t\t\t\t\t\t</div>", "images": {}, "success": true}