{"id": 258, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14279911.html", "title": "Chapter 258 - 247: You’Re So Annoying", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 258 - 247: You’Re So Annoying</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 258: Chapter 247: You’re So Annoying <br/><br/>Translator: 549690339 <br/><br/>Michael Jackson and Juan Wright were quietly watching the commotion when they suddenly heard their names and were stunned for a moment. They looked at each other and it took them two seconds to react. <br/><br/>Immediately after, they received a gaze from Kevin Clark. <br/><br/>The two of them suddenly swallowed their saliva together, and Juan Wright walked up to Kevin Clark and said, “George Maxwell called us dogs raised by the Clark Family.” <br/><br/>Kevin Clark’s eyelashes fluttered slightly, and then he looked towards Daisy Zane. <br/><br/>He was still wondering why this little girl would accept a challenge simply because of someone’s nasty words. So, it turned out that it was for them. <br/><br/>Daisy Zane continued to look at George Maxwell. <br/><br/>George Maxwell hesitated for a moment and then shouted, “Why should I apologize? Can they even bear my apology?” <br/><br/>“We’re all human, aren’t we? How can we not bear it?” Daisy Zane said softly, “We didn’t even mind your cheap apology.” <br/><br/>“You...” George Maxwell was about to curse, but when he looked at Kevin Clark, his words were suddenly stuck in his throat. <br/><br/>As for Michael Jackson and Juan Wright, even if he got beaten up himself, he didn’t want to let go. But Kevin Clark was someone who genuinely scared him. <br/><br/>So, just one glance from Kevin made him behave. <br/><br/>Kevin Clark held Daisy Zane’s hand and looked at George Maxwell, “You think this place is your Maxwell Family’s home court, and because others are considering the venue, they dare not do anything. So you bully my people.” <br/><br/>“I, I...” George Maxwell was forced to take a step back by Kevin Clark’s imposing aura, “I didn’t.” <br/><br/>“Do you think the Clarks and the Maxwells are close, and even if my people are offended, the Clark Family will not pursue the matter for the sake of our relationship?” Kevin Clark’s words were a direct jab at the hearts of the brother and sister. <br/><br/>“Third Master...” Bonnie Maxwell called out to him, but looking at his increasingly cold expression, she didn’t say anything else. <br/><br/>“The Clarks are the Clarks, and I am Kevin Clark,” Kevin said slowly, “Enamel Cannon is the one who has a connection with you, and you’re trying to bully me.” <br/><br/>Hugo Clark: ‘ <br/><br/>Kevin Clark’s narrow eyes exuded a bone-chilling coldness, and in an instant, he uttered two words: “Apologize.” Followw new chapters at novelhall.com<br/><br/>George Maxwell was already scared silly by Kevin Clark’s aura and didn’t even know what he was saying. <br/><br/>Bonnie Maxwell also realized that today’s incident couldn’t end without an apology. She immediately tugged on George Maxwell and said, “Apologize!” <br/><br/>George Maxwell came to his senses, glanced at Michael Jackson and Juan Wright. He still didn’t want to apologize, but facing Kevin Clark’s gaze, he dared not disobey. <br/><br/>So he hesitated for a moment and reluctantly said, “I’m sorry.” <br/><br/>“Sorry for what?” Daisy Zane asked, “Sorry to whom?” <br/><br/>Michael Jackson and Juan Wright were so touched by Daisy Zane that they nearly shed tears on the spot. <br/><br/>“Third Master.” <br/><br/>“George Maxwell... within half a year, I don’t want to see him step outside of the Maxwell family’s door,” Kevin Clark said. <br/><br/>Michael Jackson immediately understood: “Alright.” <br/><br/>“Just leave him some breathing room.” Kevin Clark said, “And by the way, tell his father it was me who had him beaten.’ <br/><br/>“Yes.” Michael Jackson responded and quickly left. <br/><br/>Hugo Clark glanced at him but didn’t say anything. His Third Uncle wanted to publicly break the facade with the Maxwell family. If not for the fact that taking action here would cause trouble for his father. <br/><br/>George Maxwell wouldn’t be able to leave this place today. <br/><br/>Moreover, with the Maxwell family... this was definitely just the beginning. <br/><br/>George Maxwell was treated as an ancestor at home. If he was beaten, the Maxwell family would never let it go. Even if they didn’t pursue it openly, they would definitely not let it go in private. <br/><br/>The Clark family was the Clark family, and his Third Uncle was completely detached from all the interests of the Clark family. So he didn’t have to worry too much when he acted, and likewise, others’ considerations for him would be relatively less than those for the Clark family. <br/><br/>So it’s very likely that the Maxwell family would confront his Third Uncle separately. <br/><br/>But then again... his Third Uncle’s bad reputation was more than just a talk. <br/><br/>Even without the Clark family, his Third Uncle could still stand at the top of the Imperial Capital. <br/><br/>“Are you satisfied now?” Kevin Clark asked. <br/><br/>Daisy Zane glanced at him: “It’s alright.’ <br/><br/>Kevin Clark smiled, and just as he was about to speak, Charles Amos, who somehow escaped from James Collins, ran up to Daisy Zane, grabbed her leg, and restrained her pace. <br/><br/>Daisy Zane stopped and looked down at him. Kevin Clark and the others stopped as well. <br/><br/>Little Charles looked up, his eyes still a little red, his mouth pouted, and glared at her angrily. <br/><br/>“What?” <br/><br/>“I’m angry,” Charles said. <br/><br/>“You apologize,” Charles said. <br/><br/>“Why should I?” Daisy Zane asked, “Did I offend you?” <br/><br/>“Yes, you did,” Charles’ voice was a little childish, and even more fierce because of his anger. Especially that expression, even his little eyebrows seemed to be standing up. <br/><br/>“What did I do to offend you?” Daisy Zane’s voice didn’t have any ups and downs because he was just a child, but it sounded strangely childish, especially when paired with Charles’ babyish tone. <br/><br/>As soon as it was mentioned, Charles’ eyes became even redder. <br/><br/>“Hold it back,” Daisy Zane said. <br/><br/>Charles held back his breath, and when he finally opened his mouth, his voice was hoarse, “You pointed a gun at yourself.. I hate you!”\t\t\t\t\t\t</div>", "images": {}, "success": true}