{"id": 252, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14276261.html", "title": "Chapter 252 - 241: The Monk", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 252 - 241: The Monk</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 252: Chapter 241: The Monk <br/><br/>Translator: 549690339 Thi/s chapter is updated by nov(e)(l)biin.co/m<br/><br/>Daisy Zane changed into a neat outfit and tied up Charles Amos’s hair that had been cut off. She went with James Collins, Charles Amos, and Kevin Clark together. <br/><br/>After entering the military district and getting off the car, they went straight to the schoolyard. <br/><br/>Daisy Zane wore her hair loose, with a duckbill cap for shading the sun. Dressed simply in gray ankle-length pants and a white short sleeve shirt, her legs were long and straight, and her slender waist was revealed where the short-sleeved shirt was tucked into her pants. <br/><br/>Even dressed simply, she was still dazzling. <br/><br/>After changing her clothes, Kevin Clark’s gaze kept moving between her legs and her waist. <br/><br/>After walking for a while, little Charles Amos’s stride was obviously quicker than the others. Everyone had long legs, so he had to take two and a half steps for every step everyone else took. <br/><br/>Thus, Kevin Clark picked him up directly. <br/><br/>Little Charles Amos, who suddenly floated into the air, looked at Kevin Clark for a moment, then happily embraced his neck. Why not take advantage of this free ride? <br/><br/>Daisy Zane took off her cap and put it on James Collins’ head. <br/><br/>James Collins tucked in his neck, and after realizing it wasn’t a beating, smiled and said, “Sister, I’m not hot.” <br/><br/>“Wear it,” Daisy Zane said without looking at him, “Cover your green hair.” <br/><br/>James Collins: ...oh.” <br/><br/>Some people were training on the schoolyard. <br/><br/>They stood on the periphery and watched for a while. <br/><br/>Daisy Zane watched the close-up fighting training and the 500 meters obstacle course further away. <br/><br/>Brook Sister, when we were young, we all trained here,” Xavier Dominic said. “At that time, we were under complete military control. I was miserable, struggling to get up every day, and wanted to cry.” <br/><br/>“It’s not that you wanted to cry every day,” Hugo Clark’s voice suddenly sounded from behind them. “You were crying every day.” <br/><br/>Hearing his voice, everyone looked back. <br/><br/>Xavier Dominic, who couldn’t beat him, could only clench his teeth and say, “Hugo Clark, with a friend like me, you must have incense burning for your ancestors.” <br/><br/>“It’s more like a curse on the ancestors,” Kevin Clark suddenly said. <br/><br/>“You two, you uncle and nephew...” Xavier Dominic glanced at Hugo and Kevin Clark in turn, both of whom were too hard to provoke, “Forget it, I have a heart that can tolerate everything.” <br/><br/>Michael Jackson and Juan Wright both laughed indifferently. <br/><br/>Little Charles Amos stood beside Daisy Zane’s leg, waiting for everyone to stop talking before looking up and shouting, “Elder Brother.” <br/><br/>Daisy Zane: . <br/><br/>There was no emotion on Hugo Clark’s face as he looked at him for two seconds and then patted him on the head, acknowledging him. <br/><br/>Kevin Clark glanced at his nephew and then looked at the schoolyard, raising the corner of his mouth. <br/><br/>Such training methods would break his heart even if she just touched them. <br/><br/>Daisy Zane didn’t say anything but looked at the schoolyard, watching their training as if it were in slow motion to herself. <br/><br/>After standing outside of the periphery for a while, they went to the shooting range. <br/><br/>All sorts of guns were spread out in front of them, anyone’s eyes would sparkle for a moment after taking a look at them. <br/><br/>Allonzo Hobson had witnessed Daisy Zane’s marksmanship on Koymoon Island, which was extraordinary. <br/><br/>“Brook Sister, why not show off a bit?” <br/><br/>Daisy Zane looked at the guns and her hands itched for them. She thought about it, picked up a Type 64 pistol, and said to Kevin Clark, “Third Master, want to compete?” <br/><br/>Kevin Clark raised an eyebrow: “Will we be able to determine a winner?” <br/><br/>Daisy Zane smirked, coming up with a naughty idea: “We will.” <br/><br/>Kevin Clark saw through her scheme but didn’t expose it. He readily agreed to the challenge: “Fine. How do we play?” <br/><br/>Daisy Zane took out the magazine and checked it. She said, “Moving targets, seven bullets, see who can hit more.” <br/><br/>Hugo Clark had never seen Daisy Zane with a gun. Today was the first time. Her playful and wicked demeanor made it seem as if this place was her home court. <br/><br/>It was like she was radiating light. <br/><br/>Another side to this person. <br/><br/>“Fine,” Kevin Clark also picked up a Type 64. “Stakes?” <br/><br/>Daisy Zane thought about it and said, “Whoever loses must agree to one request from the winner.” <br/><br/>“Such tempting terms,” Kevin Clark laughed. “Then I have to take this seriously.” <br/><br/>Daisy Zane gave him a “You’re bound to lose, whether you’re serious or not” look. <br/><br/>Hugo Clark watched their exchanges and automatically stepped back. He also took little Charles Amos away, so the gunshots wouldn’t scare the child. <br/><br/>At a distance, Bonnie Maxwell, who had just arrived at the shooting range, saw their group and paused. She stood still and watched them from afar. “That group...” <br/><br/>“They came with Third Master,” said the person beside her. “I heard she’s Third Master’s girlfriend, and she’s beautiful.” <br/><br/>Bonnie Maxwell clenched her fist slowly. She recognized Daisy Zane but couldn’t believe Kevin Clark actually brought her here. <br/><br/>What right did she have to be here? What qualifications did she have to be here? <br/><br/>So what if she’s beautiful? <br/><br/>How could an empty vessel be worthy of the title of Clark Family’s Madam? <br/><br/>“Who’s that child?” <br/><br/>“Not sure, but Third Master brought him and even carried him here,” said the person. <br/><br/>Bonnie Maxwell knitted her brows, looking at Charles Amos’s figure, and her eyes darkened..\t\t\t\t\t\t</div>", "images": {}, "success": true}