{"id": 264, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14282910.html", "title": "Chapter 264 - 253: Third Master’S Crisis", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 264 - 253: Third Master’S Crisis</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 264: Chapter 253: Third Master’s Crisis <br/><br/>Translator: 549690339 <br/><br/>After Kevin Clark returned to Clark Manor, he greeted his parents and took the smart little sedan chair driven by Edo Clark back to his courtyard. <br/><br/>As he sat in the sedan chair, Kevin’s gaze never left the notebook in his hand. <br/><br/>He was always looking at Daisy Zane. <br/><br/>His mood had been quite good, but seeing Daisy and Olivia Lane sitting together and exchanging pleasantries, he gradually furrowed his brows. <br/><br/>The camera’s audio capture was limited, but the conversation between the two was transmitted to Kevin’s ears through the microphone on Daisy’s clothes. <br/><br/>Kevin clearly felt that the little girl really liked Olivia Lane. <br/><br/>Instantly, the alarm bells in his heart rang again. <br/><br/>The Lane Family, the only one that could rival the Clark Family. William Lane was just one year older than him, excellent, rich, powerful, and good-looking. <br/><br/>Originally, having a domineering sister-in-law could have been a trouble to dissuade the little girl. <br/><br/>But why does this little girl still like Olivia Lane so much? <br/><br/>Kevin was a bit unhappy, half lowering his eyes to look at the screen of the little girl and said after a while: “Edo.” <br/><br/>“Third Master, what do you say?” Edo replied with a mechanical voice. <br/><br/>“Go back the same way.” <br/><br/>“Okay, Third Master.” <br/><br/>On the way back, Kevin called William Lane. <br/><br/>It took more than ten seconds for the other party to answer. <br/><br/>Without any pleasantries, Kevin went straight to the point: “Roy, my mom has been a bit idle lately and wants to find you a girlfriend. Tomorrow she’ll probably send you some material photos. Take a look and see if there’s anyone you’re satisfied with?” <br/><br/>“What?!?!” William Lane’s voice in the cell phone seemed to be splitting apart. <br/><br/>Kevin’s fingertips tapped lightly on the computer, his eyes murky and obscure, like clouds that won’t disperse: “To pick a partner for blind dates.” <br/><br/>William Lane quieted down for a moment before saying, “Isn’t it, why do you want to find one for me? Doesn’t Enamel Cannon not have any results yet?” <br/><br/>Kevin glanced at Olivia Lane on the computer screen and laughed: “Enamel <br/><br/>Cannon has a target now and is pursuing.” <br/><br/>“Hey. The iron tree is blooming?” William Lane laughed too, “Which poor girl has caught his eye.” <br/><br/>Kevin didn’t answer him, just said: “Remember to give a big red envelope at that time.” <br/><br/>“You don’t have to say that, I’ll give a big red envelope to any of you who get married.” <br/><br/>Everyone was fearless. <br/><br/>If she didn’t know that Director Nash hadn’t given a script to this group of students, she would have thought they were acting. <br/><br/>Skyler Thomas’ reaction, on the other hand, seemed like he was already used to it. <br/><br/>The teacher spoke very fast but taught at a slightly slower pace. <br/><br/>She seemed impatient but very patient at the same time. <br/><br/>She was the type of person who, despite being obviously flustered herself, would still comfort others by saying, “Don’t worry, take your time.” <br/><br/>Facing such a group of students, she never gave up, constantly calling on people to answer questions, guiding them to learn, trying to bring the prodigal sons back. <br/><br/>Daisy Zane felt tired on her behalf. <br/><br/>As another question came up, Daisy Zane noticed Skyler Thomas’ gaze sweeping across the class. Then her eyes narrowed, she feigned a shot, looked at Daisy Zane, and called on Celeste Martin. <br/><br/>After calling on her, Skyler Thomas looked like she found it amusing and smiled proudly at Daisy Zane. <br/><br/>As if to say: You got scared, didn’t you. <br/><br/>Daisy Zane: . <br/><br/>Celeste Martin’s foundation was indeed good. She had graduated from high school for so long and could still remember some knowledge points and managed to answer half of the question correctly. <br/><br/>The latter half was supplemented by Skyler Thomas’ guidance. <br/><br/>Then Skyler Thomas praised her a few times, and the class applauded. <br/><br/>“Formalism.” Olivia Lane muttered while playing her game. <br/><br/>Daisy Zane heard it, turned her head to look at her, and then looked at the game on her phone. <br/><br/>It was one of the most popular shooting competition games at the moment. “If you’re bored, you can play on your phone.” Olivia Lane whispered. <br/><br/>“I think it’s quite interesting.” Daisy Zane said. <br/><br/>Olivia Lane looked at her, didn’t say anything, and lowered her head again. <br/><br/>Daisy Zane watched her game. When Olivia Lane was in a critical situation, aiming at someone, Daisy Zane suddenly reached out and pulled her clothes. <br/><br/>Olivia Lane’s hand slipped, and that shot almost ended up at grandma’s house. She was instantly knocked down by the opponent. <br/><br/>She stared at the character on her phone, crawling on the ground, blood level dropping bit by bit, froze for two seconds, and then suddenly looked at Daisy Zane. She stared at her with a blend of surprise and anger. <br/><br/>It took her a long time to grind her teeth and say, “What are you doing?” <br/><br/>Daisy Zane looked at her calmly, her eyes exuding a bit of coldness, her voice carrying a lazy, teasing tone: “Keep playing games during class, and I’ll make you go from War God to Bronze.” <br/><br/>“What do you want to do!” Olivia Lane was so shocked that she asked again. <br/><br/>Daisy Zane raised her brows and replied casually, “Meddling in others’ business..”\t\t\t\t\t\t</div>", "images": {}, "success": true}