{"id": 265, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14282911.html", "title": "Chapter 265 - 254: Problem Solving", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 265 - 254: Problem Solving</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 265: Chapter 254: Problem Solving <br/><br/>Translator: 549690339 <br/><br/>Olivia Lane had been used to her bluster for a long time, apart from her parents berating her occasionally for not behaving properly in recent years, she had never felt this kind of humiliation. <br/><br/>Looking at Daisy Zane, she clenched her lips, wishing she could bite her. <br/><br/>But Daisy Zane was fearless, even pulling away the cell phone in her hand when she was glaring at her heatedly. <br/><br/>Olivia Lane: <br/><br/>Daisy Zane gently shook the cell phone, put it in her pocket, and said, “I’ll give it back to you at noon when school’s out.” <br/><br/>“You!” <br/><br/>“Daisy Zane, can you write down the answer for this problem?” Skyler Thomas suddenly called her name. <br/><br/>Daisy Zane: . <br/><br/>Olivia Lane looked at her for another two seconds, then turned her head away, without moving. <br/><br/>Daisy Zane stood up, patting her on the top of the head, and said, “Stand up, <br/><br/>I’m leaving.” <br/><br/>Olivia Lane hummed lightly, turned her head to one side, ignored her, and didn’t move. <br/><br/>“So angry?” Daisy Zane softly hooked the corner of her lips, bent down and lifted the chair with one hand, dragging the chair and the person on it a bit forward. <br/><br/>The boy behind Olivia Lane who was about to pull his desk backwards stopped his movement, raising his eyes to look at Daisy Zane. <br/><br/>The whole class, whoever was looking at her, their eyes widened a bit. <br/><br/>George Dunn, leaning on the chair, was initially worried when the teacher called her name, but seeing her movement, he suddenly chuckled. <br/><br/>Marsh Turner, sitting beside him, also laughed. <br/><br/>And Olivia Lane’s beautiful eyes were filled with shock. <br/><br/>This... this strength... <br/><br/>Daisy Zane patted her head again before she walked ahead. She put her hand in her pocket as she walked, but halfway through the movement, she put her hand back down. <br/><br/>When she reached the podium, she picked up a piece of chalk and glanced at the problem on the blackboard. <br/><br/>It was a function problem. <br/><br/>Skyler Thomas also knew about her situation, and said on the side, “Just answer the first question, this question’s first part is basic, it’s a basic elementary function. ” <br/><br/>“Hmm.” <br/><br/>Daisy Zane responded, and first wrote the word “solution” on the blackboard. <br/><br/>Charles Amos would always write the word “solution” under the problem every time he couldn’t solve it, saying he could earn two points. <br/><br/>So she also wrote it first. <br/><br/>However... what she wrote for the last question... he felt like he was reading an alien language. <br/><br/>“It seems you don’t have to worry now.” Marsh Turner said. <br/><br/>“You talk too much, just like your cousin.” George Dunn responded. <br/><br/>Olivia Lane looked at her, seemed to smile for a moment, then suppressed it, sneering. <br/><br/>Turner Daniel looked at the steps she used to solve the problem, narrowed his eyes slightly, as he didn’t think of that method. <br/><br/>The more Skyler Thomas watched, the more surprised and dazed he became. <br/><br/>If he was not wrong, those things Daisy Zane wrote were things he only saw in university. <br/><br/>Daisy Zane wrote very fast, only in six lines, using a formula that no one had ever seen before, she calculated the answer. <br/><br/>Skyler looked at the answer, then at his answer written on a dense B5 sheet of paper: <br/><br/>The results were the same, but hers was so much simpler. <br/><br/>Daisy Zane put the chalk back after finishing writing and rubbed the chalk dust on her fingertips saying, “I didn’t go to school, I learned things myself, so they’re not very structured. I can only calculate the result, the process is probably not standard.” <br/><br/>Skyler’s eyes followed her all the time, and when he heard her speak, he came back to his senses. Then he opened his mouth, his lips trembling slightly, “You learned, you learned by yourself?” <br/><br/>Daisy Zane’s eyelashes trembled slightly, and the voice of Edward Kirsten suddenly sounded in her ears. <br/><br/>“How did she learn on her own?” Someone from the audience unexpectedly questioned. <br/><br/>Daisy Zane looked in that direction, her expression did not change at all, but it still produced a sense of pressure, “My grandmother is a mixed-race woman. Before she came to Cold Green Village, she received a good education.” <br/><br/>“So that’s how it is.” Skyler commented, “Her Grandma must have been a talented student, these sophisticated solving methods are probably only taught in university.” <br/><br/>Daisy Zane did not speak. <br/><br/>Skyler showed everyone his answers and process, “You see, my process. Then look at what’s on the blackboard.” <br/><br/>“Wow— The students suddenly exclaimed, “Teacher, don’t talk anymore, I feel like vomiting.” <br/><br/>“The words make me dizzy.” <br/><br/>“I’m getting dizzy from studying.” <br/><br/>“I’m getting dizzy from the classroom, I want to go home.” <br/><br/>“Or let’s just discuss Sister Lucia’s solution, it’s too concise.” <br/><br/>“Man, you sure know how to go with the flow, you even call her Sister Lucia now.” <br/><br/>“Yeah, Sister Lucia, any objections?” <br/><br/>“None. Just withdraw it and let me call her first.” <br/><br/>Meanwhile, Harton Clark watched what she was writing, narrowing his eyes slightly. <br/><br/>Victoria Zane taught tang Zhi xi’s method. <br/><br/>How about this little girl? <br/><br/>Harton Clark thought for a while, felt a sharp pain in his heart. I’m afraid the only one would be Edward Kirsten....\t\t\t\t\t\t</div>", "images": {}, "success": true}