{"id": 261, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14281517.html", "title": "Chapter 261 - 250: Boyfriend", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 261 - 250: Boyfriend</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 261: Chapter 250: Boyfriend <br/><br/>Translator: 549690339 <br/><br/>After receiving their school uniforms, the boys and girls were led back to their dormitories by the dormitory supervisor. <br/><br/>The girls’ dormitory was on the third floor, and only the floors above the third floor had an elevator. <br/><br/>So they had to carry their suitcases upstairs. <br/><br/>Daisy Zane and Celeste Martin’s suitcases were relatively light. However, Serena Buster’s extra-large suitcase was hard for her to lift with both hands. ViisiT n0(v)eLb(i)(n).com for the best novel reading experience<br/><br/>So Daisy offered her own suitcase to Serena and helped her carry it. “I’ll do it myself,” Serena said, “otherwise people will say we’re a couple again.” <br/><br/>“If I don’t help you, people will say we’ve broken up,” Daisy said calmly. <br/><br/>“Oh, that’s true.” Serena saw that Daisy didn’t mind and handed her the suitcase. <br/><br/>Celeste also chimed in: “I’ll help you lift it too, it looks quite heavy.” “No need,” Daisy said, and then lifted the suitcase with one hand. <br/><br/>After feeling its weight, she glanced at Serena: “Did you bring your whole house with you?” <br/><br/>Serena glanced at her, then glanced at the dormitory supervisor, and didn’t dare to speak. <br/><br/>The first thing they did when they got to the dormitory was to check their suitcases. <br/><br/>A few cosmetic items were removed from Celeste’s suitcase, and when Serena’s extra-large suitcase was opened, four-fifths of it was filled with snacks. <br/><br/>Daisy Zane: . <br/><br/>Celeste: “If we had known earlier, we could have had a feast downstairs.’ <br/><br/>But the teacher’s eyes were clearly bright, and she neatly and proficiently unfolded a folding bag and began to pack the snacks, as if she had captured a criminal. <br/><br/>“Teacher, teacher. These are sugar, not snacks, please leave a bag for us,” Serena said, as if her heart was bleeding, “Leave five pieces, five pieces. Two pieces, two pieces are fine too.” <br/><br/>However, the teacher didn’t leave a single piece for her. <br/><br/>“Teacher, that’s for drinking, for drinking,” Serena said, “Leave one, leave one.” <br/><br/>As if she hadn’t heard Serena, the teacher mercilessly put all of the items into the bag. <br/><br/>Serena looked at the empty suitcase, and the light in her eyes instantly disappeared. <br/><br/>She was in shock. <br/><br/>As for Daisy’s suitcase, she had always thought that there was nothing inside. But when it was opened, one-quarter of it was filled with snacks, and the other quarter was filled with medicine she often took. <br/><br/>There were even words written on the snacks. It was clearly Anisa Cooper’s handwriting. <br/><br/>The dormitory had six beds in one large room, each with a bed above and a desk below. <br/><br/>The three of them shared one side of the room, with a small staircase leading up to each bed. The other three students’ beds were opposite them. <br/><br/>The grooming area and restrooms were shared by all. They took their school uniforms to the restroom to change in the partitioned stalls. <br/><br/>Daisy Zane changed quickly, spoke to them briefly, and went back to the dormitory first. <br/><br/>The school uniform was a simple blue and white one. <br/><br/>Daisy Zane wore it neatly, zipping it up to her collarbone and making sure the collar lay flat on both sides. <br/><br/>It could definitely be described as a decent way to wear the uniform. <br/><br/>Although the uniform looked a bit loose at first, it fitted well on her tall and slender figure, giving the ordinary school uniform a fashionable look. <br/><br/>Back in the dormitory, Daisy Zane sorted out her belongings. <br/><br/>Their beds had their names on them. Daisy Zane put her things away and then looked at the information on the opposite student’s bed. <br/><br/>She saw the name: Olivia Lane. <br/><br/>And below it, the age and class. Nineteen years old, Senior Three Class Sixteen. <br/><br/>Daisy Zane: . <br/><br/>She frowned slightly, wondering how she could be so unlucky. <br/><br/>Before she could think too much about it though, Celeste Martin and Serena Buster returned. <br/><br/>The two of them quickly sorted out their belongings, and the three of them headed to the teaching building together. <br/><br/>The teaching building was right in front of the dormitory and quite close. It was likely meant to save time. <br/><br/>When the three of them arrived, five guys and two teachers were already there. <br/><br/>These people who were usually fashionable and played various characters on the outside suddenly changed into school uniforms and put up a pure and innocent student act. <br/><br/>It looked both hilarious and a bit cringeworthy, no matter how one looked at it. <br/><br/>So, after both groups of people exchanged glances and greeted each other, following the introduction of the homeroom teachers from Senior Three Class Fifteen and Class Sixteen, they all laughed. <br/><br/>Then, they proceeded to tease and joke with one another. <br/><br/>Daisy Zane also smiled faintly and looked at George Dunn, saying, “I didn’t expect you to be quite young.” <br/><br/>George Dunn was taken aback and laughed, “You’re actually complimenting me. Are you sure you’re not being sarcastic?” <br/><br/>“Did you figure it out?” Daisy Zane raised her eyebrow and asked. George Dunn: “...I knew I shouldn’t have had that illusion.” <br/><br/>Daisy Zane laughed again..\t\t\t\t\t\t</div>", "images": {}, "success": true}