{"id": 268, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14284207.html", "title": "Chapter 268 - 257", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 268 - 257</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 268: Chapter 257 <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane often forgot how cunning Arthur North could be whenever he was gentle with her. <br/><br/>What kind of fun is she looking for? <br/><br/>Looking forward to Robinson Scott’s two dads coming to Imperial Capital to meddle in affairs and muddy the waters? <br/><br/>Daisy Zane always felt that he seemed to be plotting something. <br/><br/>“Alright, let’s hang up.” Daisy Zane said. <br/><br/>“Little Girl.” Arthur North was afraid she would suddenly hang up the phone, so he called out in a somewhat urgent tone. <br/><br/>Hearing his shout, Daisy Zane moved her finger away from the hang-up button: “Yes?” Geet latest novel chapters on novelbj/n(.)c/om<br/><br/>“It’s not easy to make a phone call, won’t you ask about me?” Arthur North said. <br/><br/>“I remember we just met this morning.” <br/><br/>Arthur North: <br/><br/>“Besides... can’t you see me?” <br/><br/>Arthur North: <br/><br/>When she found out that the surveillance equipment was provided by the Easton Group, Daisy Zane knew what Arthur North had in mind. <br/><br/>“I know you’re watching, so behave yourself and don’t flirt with other girls.” <br/><br/>“Do you have any objections?” Daisy Zane heard someone coming into the restroom, washing their hands. <br/><br/>“Can I... have an objection?” <br/><br/>“Up to you.” Daisy Zane said indifferently. <br/><br/>“And then I have my objections, and you’ll still do what you want.” <br/><br/>“Mm.” <br/><br/>Arthur North laughed helplessly: “Alright, I’ll take it as your loving care for your niece.” <br/><br/>Daisy Zane: . <br/><br/>After hanging up the phone, Daisy Zane checked her cell phone again in the restroom, replied to a few people, and then sent the hot search news to Robinson Scott before leaving the restroom. <br/><br/>It was only when she reached the washbasin outside that she realized that the person who had come in was Olivia Lane. <br/><br/>She was washing her hands. <br/><br/>Daisy Zane looked at her and laughed: “You’ve been washing your hands for quite a while.” <br/><br/>“None of your business.” <br/><br/>Daisy Zane also washed her hands and said, “Shall we go back together?” <br/><br/>Two of Daisy’s roommates were her fans, apart from Olivia Lane. <br/><br/>To avoid any awkwardness for the other two, they asked all three of them for autographs after they returned to the dorm. <br/><br/>Celeste Martin said, “I originally brought gifts for you, but the dormitory supervisor confiscated them.” <br/><br/>“Exactly, my whole box of snacks got confiscated, ” Serena Buster added. Suddenly, she took out a few boxes of potato chips from the cabinet and distributed them among everyone, “Thankfully, I was smart enough to hide a few in my clothes bag. Come on, let’s eat them quickly before they get discovered. ” <br/><br/>One of the girls, holding a bag of potato chips, asked, “Can the teacher see us through this camera?” <br/><br/>Everyone suddenly looked at the camera. They stared at it, and then Daisy Zane said, “If they could see, they would have seen us already. The only thing we can do now is eat these chips before the teacher comes.” <br/><br/>“And then deny it till we die?” asked Serena Buster. <br/><br/>Daisy Zane looked at her and slowly uttered four words, “Enjoy while we can.” <br/><br/>Olivia Lane chuckled softly, but when Daisy Zane looked over, she immediately stopped laughing and even glared at her. <br/><br/>Daisy Zane smiled to herself, thinking: what a strange and stubborn little girl. <br/><br/>“What are we waiting for then? Let’s eat!” said one of the girls. The other quickly locked the dormitory door and said, “Let’s take our time.” “You’re all so sneaky,” Serena Buster laughed. “Hurry, hurry, eat.” <br/><br/>The six girls in the dormitory ate and chatted at ease, not in a hurry at all. <br/><br/>Daisy Zane sat in a chair, her cell phone thrown onto the table while she listened to them. <br/><br/>The other two girls were adorable and very entertaining to talk to. <br/><br/>They likely were assigned by the school to help lighten the mood. <br/><br/>As Daisy Zane listened, suddenly, her phone on the table rang. <br/><br/>The sound wasn’t very loud, but everyone’s attention was instantly drawn to it. <br/><br/>They all looked at the cell phone. <br/><br/>The caller’s name was marked with an asterisk, but the background picture of the incoming call was a side profile of Kevin Clark. <br/><br/>Celeste Martin was standing right beside her, leaning against her cabinet, very close to her. <br/><br/>She slightly turned her head and saw the picture on the cell phone. Her eyes tightened instantly. <br/><br/>It was the man who was at the Court Music Academy, talking to a little boy and Charles Flores that day. <br/><br/>Charles Flores had called him “Third Master.” <br/><br/>Later, she asked about him, but Charles Flores told her not to inquire too much. So she searched for him online on her own. <br/><br/>Although there were no photos available, who else could be called “Third Master” other than the man from the Clark Family? <br/><br/>However, why did Daisy Zane have his photo and even set it as the background for her incoming calls? <br/><br/>Was it Third Master Clark calling her? <br/><br/>How could that be possible? <br/><br/>The two other girls and Serena Buster, who were farther away, couldn’t see clearly. After a quick glance, they looked away, not wanting to pry into someone’s privacy. <br/><br/>Only when Olivia Lane saw it, she almost wrote “speechless” on her face. Didn’t they have contact over the phone just at noon? Why is he calling again now?\t\t\t\t\t\t</div>", "images": {}, "success": true}