{"id": 263, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14282274.html", "title": "Chapter 263 - 252: So Familiar", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 263 - 252: So Familiar</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 263: Chapter 252: So Familiar <br/><br/>Translator: 549690339 <br/><br/>The cheers from the boys in the class were already somewhat teasing, but when Daisy Zane suddenly smiled, everyone paused for a moment and looked at her. The applause instantly became much more sincere. <br/><br/>“Hey? Oh my god, how beautiful is this star named Daisy Zane?” a boy whispered. <br/><br/>“I knew she was beautiful, but she’s even more beautiful in person than on screen. Shen, isn’t she so beautiful? Even more beautiful than Amelie Quentin.”. <br/><br/>The one called Marsh Turner, with his hand resting on his cheek, was looking at Daisy Zane casually. After a moment, he smiled faintly. <br/><br/>“Didn’t they say that Cold Green Village is very poor? Yet how can people raised there be so beautiful and refreshing?” a girl whispered to her deskmate, “I always thought her beauty was just packaging, but now I don’t think so. Her beauty is deep in her bones.” <br/><br/>“Maybe the packaging starts from the bones too,” the girl in front of Amelie Quentin suddenly whispered. <br/><br/>The CCTV cameras installed in the classroom had audio recording functions, but the audio was not turned up to the maximum, so very low noises could not be picked up, only normal speaking voices. <br/><br/>Upon hearing this, Amelie Quentin stretched out her leg and gently kicked the other girl’s chair, whispering: “If you can’t talk properly, tear out your tongue.” <br/><br/>The girl in front suddenly turned around and looked at Amelie Quentin. But when she met Amelie Quentin’s cold eyes, she swallowed her words and just gave her a glare before turning back around. <br/><br/>It took Skyler Thomas almost two minutes to deliver some very official remarks, praising the school and then the individual classes. Then, he finally allowed the four newcomers to introduce themselves. <br/><br/>George Dunn, the first one to introduce himself, did so in great detail. <br/><br/>Name, gender, zodiac, height, weight, hobbies, marital status, star sign, lucky number, favorite color, favorite food, favorite sport, etc., etc. <br/><br/>Except for age, it was almost like introducing himself for a blind date. <br/><br/>Both Skyler Thomas and the students of the class burst out laughing. <br/><br/>Next was Turner Daniel, whose introduction was relatively simple. He only mentioned his name and age, and then said a few polite words about looking forward to the future and asking everyone to take care of him. After Turner Daniel, it was Celeste Martin’s turn to introduce herself. <br/><br/>Celeste Martin’s introduction was more formal. <br/><br/>She talked about some awards she had won in high school, college entrance exam scores, and her college life, giving those preparing for the college entrance exam something to look forward to in college. <br/><br/>Celeste Martin, in addition to being a singer, had an even more respectable identity. <br/><br/>A student of the Court Music Academy. LaTest novels at novelhall.com<br/><br/>In the hearts of these students, the status of the Court Music Academy was extremely significant. <br/><br/>They would hold Charles Flores, a member of the Clark and Lane families, in great awe, to say nothing of their own reaction. <br/><br/>So, Celeste Martin was very popular and even respected. <br/><br/>But Jessica Maxwell, who switched seats with the boy, sat in front of Olivia. “Teacher, my seatmate will be a new student too, so it doesn’t matter where I sit, right?” Jessica Maxwell said. <br/><br/>“No, switch back,” Skyler Thomas ordered, “Hurry up. William Butch, pack your things too.” <br/><br/>William Butch was the boy who was supposed to sit in front of Daisy Zane. <br/><br/>Jessica Maxwell pouted, quickly gathered her things, and changed back with William Butch. Skyler Thomas let Turner Daniel sit down and assigned Celeste Martin to sit next to Jessica Maxwell’s original seat. <br/><br/>When William Butch walked to his seat, Daisy Zane looked up at him. <br/><br/>The boy was relatively thin, with very pale, almost sickly white skin. He also had long hair that covered his eyes. The zipper on his school uniform was also pulled all the way up, almost covering his mouth. <br/><br/>Moreover, he kept his head down without looking anywhere. <br/><br/>Daisy Zane only looked at him for a moment, her gaze not lingering on him for too long before lowering her head again. <br/><br/>After a while, she looked at Olivia and said, “Lend me a pen.” <br/><br/>“...Do you not even bring a pen to school?” Olivia asked while searching for an extra pen. <br/><br/>“I have you as my seatmate,” Daisy Zane said calmly. <br/><br/>Olivia glanced at her and continued to search for a while before realizing that besides the pen in her hand, there were no others, “You sure know how to count.” <br/><br/>“Thank you for the compliment.” <br/><br/>Olivia side-eyed her, then threw the pen in her hand to her and turned to the boy behind her, “Give me a pen.” <br/><br/>The boy immediately handed her his pen. <br/><br/>Daisy Zane looked at the pen in her hand, then twirled it and started writing her name in the new textbooks. <br/><br/>As she wrote her name, she thought to herself: Coming to school with your name must have been our way of attending school together. <br/><br/>Olivia saw that she was quietly writing her name in each book and glanced over. <br/><br/>Since Daisy used to sign “Flynn Ninevara” with her own handwriting, she started using her own handwriting in public now. <br/><br/>The handwriting in the books was the same as the one on the blackboard. <br/><br/>However, the “Everleigh” on the blackboard had a clear pause at the end of that last stroke because there were impurities inside the chalk and it got stuck for a moment. <br/><br/>That’s why her last stroke didn’t hook upward. <br/><br/>But in the names written in the books, the final stroke in “Everleigh” hooked up. <br/><br/>Olivia frowned at the sight of the character, then suddenly realized that the handwriting was so familiar, as if she had seen it somewhere before..\t\t\t\t\t\t</div>", "images": {}, "success": true}