{"id": 260, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14281516.html", "title": "Chapter 260 - 249: Variety Show Recording", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 260 - 249: Variety Show Recording</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 260: Chapter 249: Variety Show Recording <br/><br/>Translator: 549690339 <br/><br/>“Going to School” program is going to be recorded, and the artists participating in the recording have been revealed online. <br/><br/>So, there have been continuous online attacks on Daisy Zane. <br/><br/>Of course, most of the comments are good, positive, and encouraging. <br/><br/>Only a small part is attacking, but it is disgusting enough. <br/><br/>These negative comments are divided into two categories, one saying that current actors enter the entertainment industry just to make money in the variety show circle. <br/><br/>Another part attacks her for not having attended school and having no education. <br/><br/>They say she doesn’t even have an elementary school diploma, so why is she participating in a high school recording? <br/><br/>As for these, Daisy Zane and her team still choose to ignore them and not engage. <br/><br/>Actually, Daisy Zane’s Facebook doesn’t have many updates apart from promoting things. She rarely responds to online rumors or negative comments from fans. <br/><br/>She doesn’t even have her own pictures. <br/><br/>Mostly, there are just stills from her shows. <br/><br/>When there is no new drama to promote, it seems as if Daisy Zane has disappeared from the world. <br/><br/>She can’t be photographed in daily life, and there is no news about her online. <br/><br/>At first, everyone used to search for her online all the time, but gradually they got used to it and no longer bothered. <br/><br/>The program team keeps the recording time a secret to avoid media or fans from surrounding the school. <br/><br/>However, on the day of the recording, both media and fans still showed up at the school entrance. <br/><br/>But before anything could start, they were dispersed, because Kevin Clark had people stationed at the entrance early in the morning, covering the entire school. <br/><br/>Anyone suspicious who approached would be asked to leave. <br/><br/>Not to mention those media personnel carrying equipment. <br/><br/>As it’s time for both boarding and day students to return to school, there are many people waiting at the gate. <br/><br/>And the Imperial City Leafield Family’s mark is very obvious. <br/><br/>Everyone in Imperial Capital is aware, even the high school students are starting to understand the situation. <br/><br/>Not only the media and fans, but even the students’ parents were alarmed by this huge presence. <br/><br/>It’s the Clark Family after all. <br/><br/>Nobody knew what was happening, and they thought someone from the Clark Family was visiting the school for inspection. <br/><br/>The media didn’t even dare to take sneak photos. <br/><br/>In fact, Third Master Clark was just worried that the crowd would add more trouble to the already congested entrance, and accidents might happen from the massive gathering. <br/><br/>Especially with students involved. <br/><br/>“Teacher, how many people are in each dorm room?” asked one of the girls. <br/><br/>“Six people per room,” the teacher said. “The three of you girls will be together, along with three other students.” <br/><br/>Daisy Zane glanced at the girl who asked the question, and then her gaze landed on the girl’s hand. <br/><br/>Director Nash had given everyone a file with each other’s information. <br/><br/>This girl’s name was Celeste Martin. She was a singer and a student studying at the Imperial Music Academy, specializing in playing the pipa. <br/><br/>“Are there cameras installed in the dormitory as well?” Serena Buster asked this question. <br/><br/>Three girls in total: Daisy Zane, Serena Buster, and Celeste Martin. <br/><br/>“Yes,” the teacher said. “Lights out at ten at night. At nine-thirty, the dormitory supervisor will turn off the cameras. Once off, no one can turn them back on except for the supervisor’s fingerprint. You can cover the camera if you feel unsafe. <br/><br/>“Are all the cameras fingerprint-activated now? That’s so advanced!” asked a male student. <br/><br/>“Of course,” the teacher smiled. “It’s Ryan Easton Group’s intelligent technology. It’s bound to be advanced.” <br/><br/>“Gosh, Ryan Easton.” The boy’s eyes seemed to light up. <br/><br/>Daisy Zane glanced at him and raised her eyebrows. He was the nineteen-year-old boy she and Kevin Clark talked about last night. <br/><br/>An Imperial Capital University top-candidate student who graduated at eighteen. <br/><br/>His name is Turner Daniel. <br/><br/>He studied software engineering in college. <br/><br/>After graduation, he was recommended for postgraduate studies but turned down the offer, instead shooting movies for a year. <br/><br/>Listed in the Imperial Capital University Top Talent Hall of Fame at the age of eighteen! <br/><br/>His acting was quite good. <br/><br/>Yesterday at dinner, Daisy Zane hadn’t paid much attention, but now taking a closer look, the boy seemed decent-looking, with red lips and white teeth. <br/><br/>“We have lunch break at noon and half an hour for lunch,” the teacher continued. “You can rest in the dormitory from half-past twelve to two. Remember, you cannot bring lunch to the dormitory. Other snacks are also prohibited. After returning to the dormitory, we will inspect your suitcases.” Daisy Zane: . <br/><br/>“We will send you the school rules later, which you need to memorize and strictly follow,” the teacher said. “We will check.” <br/><br/>“When I went to school, I never thought that in my twenties, I would still have to memorize school rules,” said one of the boys. <br/><br/>“When I went to school, I didn’t even know our school had rules.” <br/><br/>George Dunn laughed: “That’s why there’s payback when you try to game the system.” <br/><br/>Everyone laughed: “Yes, if I had been more serious in my final year of high school, maybe my face would have been on Imperial Capital University’s Hall of Fame by now.” <br/><br/>“Turner is already there,” Celeste Martin said. “On the list at eighteen.” <br/><br/>“Thank you, thank you,” Turner Daniel said. “It was just my brain developing too fast. It had nothing to do with me.” <br/><br/>“If it had nothing to do with you, did your brain separate from your body?” <br/><br/>“It’s not that terrifying. I’m not that brave, anyway.” <br/><br/>Everyone laughed again, and Daisy Zane raised her mouth slightly..\t\t\t\t\t\t</div>", "images": {}, "success": true}