{"id": 266, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14283532.html", "title": "Chapter 266 - 255 Megan Cruz", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 266 - 255 Megan Cruz</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 266: Chapter 255 Megan Cruz <br/><br/>Translator: 549690339 Geet your favorite novels at novelhall.com<br/><br/>Skyler Thomas looked at the group in his class who despised their daily studies, massaged his temples and said, “Shut up, all of you. Alright, Daisy <br/><br/>Zane, you can go.” <br/><br/>Daisy Zane nodded and began to walk away. <br/><br/>As she took her first step, George Dunn suddenly started clapping. If others had it, then Flynn Ninevara, the ‘Brook God’, should not be left out. His handclap was so loud that it startled Marsh Turner next to him. <br/><br/>But after Marsh Turner glanced at him, he too began to clap. <br/><br/>Marsh Turner was the ‘big boss’ in the class, good looking and coming from a good family, many in the class followed his lead. <br/><br/>So when he started clapping, everyone else immediately joined in. <br/><br/>Even Skyler Thomas, who caught on, laughed and joined in the applause. <br/><br/>Daisy Zane: . <br/><br/>Daisy Zane took her place amid the applause. <br/><br/>Jessica Maxwell clapped while saying, “What’s the smug look? Can’t even afford school.” <br/><br/>Celeste Martin pursed her lips; smiles on her face were subtly stiff. Director Nash and she once worked together, and she also had the identity of Catherine, probably gave her topics secretly to get her to shine. <br/><br/>When Daisy Zane returned to her seat and the applause subsided, Skyler Thomas said, “So it seems, educational qualifications and knowledge are two different things.” <br/><br/>Everyone nodded in agreement. Then a boy said, “Teacher, I agree with what you say, so I don’t understand why my dad insists on sending me here.” Skyler Thomas glared at him and said, “Why? Because the little knowledge I have can’t be crammed into your head. How can you expect to learn on your own?” <br/><br/>The boy was speechless. <br/><br/>“Some people, even without access to education, understand its importance. But you guys... never mind, it’s futile to tell you. Let’s just continue with the class.” <br/><br/>Daisy Zane took her seat, glanced at Olivia Lane before noticing that the desk’s front William Butch had quickly peeked at her. <br/><br/>He just glanced at her and quickly withdrew his gaze, bowing his head to sit properly. <br/><br/>Seeing his tense and careful movements, Daisy Zane pretended not to notice. <br/><br/>The morning classes passed quickly. <br/><br/>Because two teachers had to go to the Education Bureau for a meeting, there were two Math classes and two Chinese classes in the morning. <br/><br/>The Math class was alright, as students were constantly asked questions, so everyone stayed relatively alert. <br/><br/>However, more than half of the class fell asleep during the subsequent Chinese classes. <br/><br/>On one hand, students had nothing to fear, on the other, they believed in the school and the potential of post-production editing. <br/><br/>In their current state, there certainly wasn’t anything suitable for broadcast. The Chinese teacher also made their best efforts to keep the students awake. <br/><br/>However, the effect wasn’t significant. <br/><br/>Amelie Quentin didn’t fall asleep, but she didn’t pay attention in class either. With no cell phone, she was lost in her own thoughts. <br/><br/>She must have gone mad when she heard they were coming to film. She requested a dorm change and even bribed a teacher to let Daisy Zane sit next to her. <br/><br/>As soon as Marsh Turner came over, a bunch of boys also surrounded them. <br/><br/>“Let’s go, Brook God, let’s go for lunch.” George Dunn said. <br/><br/>Daisy Zane glanced at him, then at the boys around him. <br/><br/>Boys of this age are already quite tall, almost as tall as George Dunn. They were quite handsome, and had a shallow dimple on the left when they smiled, appearing somewhat rogue-ish. <br/><br/>Noticing her gaze, Marsh Turner introduced himself, “Daisy, Marsh Turner. The ‘Turner’ from Prime Minister. <br/><br/>Daisy Zane raised her eyebrows slightly. She felt a sense of familiarity in his facial expression, and greeted, “Hello.” <br/><br/>“Hello, Daisy.” Marsh Turner’s dimple deepened with his smile. <br/><br/>“Wow, there are so many people.” Celeste Martin intervened, “Are we all going to eat together? But we don’t have meal cards.” <br/><br/>“It’s okay.” George Dunn glanced at Marsh Turner, “He will pay.” <br/><br/>“Yes, I’ll pay.” Marsh Turner agreed, “Let’s go, Daisy.” <br/><br/>Daisy Zane gave both of them a look, and figured both of them should know each other. But she didn’t probe further and simply got up to join the others, <br/><br/>“Thank you.” <br/><br/>“You’re welcome, Daisy.” <br/><br/>Before she left the classroom, Daisy Zane took one last look at William Butch, who was still sitting there with his head bowed. However, by the perusal of his relaxed shoulders, it seemed he had become less tense. <br/><br/>Kevin Clark watched as they all left to have lunch. Watching Daisy Zane surrounded by a bunch of teenage boys, he almost lost his appetite. <br/><br/>Trust his instinct as a man, this Marsh Turner didn’t seem to hold a pure gaze towards the young girl. <br/><br/>But he didn’t need to worry, Marsh Turner and Allonzo Hobson were cut from the same mold, and the girl certainly wouldn’t like them. <br/><br/>Nevertheless, concern or not, a necessary warning was still required. <br/><br/>So he reached for his phone, about to make a call. <br/><br/>But before he could make the call, a message popped up on the bottom right corner of his computer. <br/><br/>He glanced at it subconsciously and saw the three characters “Allonzo Hobson” in the title. <br/><br/>Halting his attempt to make the call, he clicked open the message first. <br/><br/>The complete title was: [Allonzo Hobson photographed checking into a hotel with an unknown woman.] <br/><br/>Straightforward. Hitting right on the matter. <br/><br/>Kevin Clark checked further and found several photos attached. <br/><br/>Two of rest of them were pictures of Allonzo Hobson supporting a woman along the hotel corridor. Two others were of Allonzo Hobson assisting the woman to open a hotel room door. <br/><br/>The photo that captured the act of opening the room captured Allonzo Hobson’s profile, but the woman’s face was never caught. <br/><br/>However, one look at the figure, and anyone familiar would know that it was Robinson Scott. <br/><br/>Considering Allonzo Hobson’s attire, the photos seemed to have been taken after a banquet, following the completion of filming in the desert. <br/><br/>That evening, Allonzo Hobson and Robinson Scott ended up sharing a bed, leading to a huge misunderstanding..\t\t\t\t\t\t</div>", "images": {}, "success": true}