{"id": 267, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14283534.html", "title": "Chapter 267 - 256: Third Master Who Loves Watching Excitement", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 267 - 256: Third Master Who Loves Watching Excitement</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 267: Chapter 256: Third Master Who Loves Watching Excitement <br/><br/>Translator: 549690339 <br/><br/>The senior three in Gathering Joy Private School had a separate cafeteria, which was quite spacious and offered a wide variety of dishes. <br/><br/>Daisy Zane and her entourage, along with the videographers, were quite eye-catching. <br/><br/>George Dunn and Marsh Turner stayed close to Daisy Zane, like two guardians on either side of her. <br/><br/>A group of students followed behind them, chatting and laughing all the way. <br/><br/>Daisy Zane listened quietly, occasionally chiming in when she was cued. <br/><br/>There were also a bunch of students around Celeste Martin. Jessica Maxwell was holding her arm and they were chatting excitedly and harmoniously. <br/><br/>Entering the cafeteria, Marsh Turner said, “Daisy, what do you want to eat? Let me give you some recommendations.” Foolloow new stories at novelhall.com<br/><br/>Upon hearing this, Celeste Martin and Jessica Maxwell both looked at Marsh Turner. <br/><br/>“Do you even know? Go ahead, give your recommendations.” George Dunn said. <br/><br/>Marsh Turner didn’t stay on campus; he only had a meal card, so he usually didn’t eat in the cafeteria. <br/><br/>“Don’t I know how to read?” Marsh Turner countered, “Can’t I see the big signs? <br/><br/>“So you mean Brook God can’t read? Can’t see the big signs?” George Dunn retorted. <br/><br/>“Brother Michael, why are you trying to sow discord?” Marsh Turner chided, <br/><br/>“I’m over a decade younger than you; can’t you give me a break?” “Sorry, I just can’t control myself when I see you.” <br/><br/>Daisy Zane listened and faintly smiled, “I’ll go see for myself.” <br/><br/>“Sure,” Marsh Turner replied, “Let’s go. We’ll get in line for whatever you want.” <br/><br/>Wherever Daisy Zane went, she was the center of attention. Even if everyone was wearing the same school uniform, even if only her back was visible, everyone’s eyes would be drawn to her. <br/><br/>So everyone’s eyes followed her as she walked to three different windows and got a serving of rice and a bowl of noodles. <br/><br/>Marsh Turner helped her carry the noodles, thinking that she just wanted to taste them and wouldn’t eat everything. <br/><br/>But as he sat down diagonally across from her and watched her eat the rice, vegetables, and noodles at a leisurely pace, she slowly finished all of the food. <br/><br/>She even drank a bowl of soup. <br/><br/>Marsh Turner: <br/><br/>Serena Buster ran into them while waiting in line for her meal and decided to sit next to Daisy Zane to eat. <br/><br/>Seeing her eat so much, Serena whispered, “You really eat that much?” <br/><br/>“Yeah.” <br/><br/>“But you’re a female celebrity, there are so many cameras.” <br/><br/>“Do you know what’s going on?” Amelie Quentin asked impatiently. <br/><br/>“Let me check.” Daisy Zane took out her cell phone and looked at the hot search on Facebook. <br/><br/>It was the top trending topic. <br/><br/>Daisy Zane clicked and looked at it, scrolling down a bit. When she saw the photo, her eyes narrowed. <br/><br/>She scrolled down again and checked the time. It had been almost an hour. <br/><br/>And no one had handled it. <br/><br/>Seeing Daisy Zane silent, Amelie Quentin asked, “What’s wrong?” <br/><br/>“Nothing.” Daisy Zane blinked and stood up. “The news is fake,” she said before leaving the room with her cell phone. <br/><br/>Amelie Quentin watched her go, paused for a moment, and then continued playing her game. <br/><br/>Daisy Zane went to the restroom and called Harton Clark first. <br/><br/>The call was connected after two rings, and he answered with a smile, his gentle and pleasant voice flowing into Daisy Zane’s ears through the phone, “What’s up? Missing me?” <br/><br/>Daisy Zane: “... What’s the deal with Robinson Scott and Xavier Dominic?” <br/><br/>Harton Clark: <br/><br/>“What?” <br/><br/>“It’s not a big deal.” The Third Master, who hadn’t been greeted, spoke softly, <br/><br/>“The photo was taken by the man who almost took Robinson Scott away at the banquet after the desert shoot. Recently, Xavier Dominic took two of the guy’s projects. The exposure is purely revenge, venting personal anger.” <br/><br/>“Why hasn’t it been handled?” Daisy Zane was in the bathroom stall, wearing earphones, staring at a side-profile photo of Harton Clark on the call screen. <br/><br/>One afternoon, Daisy Zane had asked Charles Amos to secretly take some pictures. <br/><br/>That day, the sunset was beautiful. Harton Clark stood beside her, seemingly blending with the red sky, forming an exquisite and colorful painting. <br/><br/>So she sent a message to Charles Amos, asking him to secretly take a few pictures. <br/><br/>“Xavier Dominic is taking people directly to his house to confront him, making the person clarify and delete it.” Harton Clark said, “We don’t need to bother.” “But the photo is right there, and no one will believe the clarification.” <br/><br/>“So Xavier Dominic is venting his anger by attacking.” Harton Clark asked, <br/><br/>“Where’s Robinson Scott?” <br/><br/>“I don’t know.” <br/><br/>Harton Clark: ‘ <br/><br/>“Third Master, a reminder. If you don’t delete it as soon as possible, and if Robinson Scott’s two fathers find out, you should know how troublesome things will get.” <br/><br/>Harton Clark chuckled mysteriously, “Then let’s watch the show.” <br/><br/>Daisy Zane: .\t\t\t\t\t\t</div>", "images": {}, "success": true}