{"id": 269, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14284208.html", "title": "Chapter 269 - 258: Su Family", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 269 - 258: Su Family</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 269: Chapter 258: Su Family <br/><br/>Translator: 549690339 <br/><br/>Celeste Martin’s gaze was too obvious, not only did Daisy Zane feel it, but Olivia Lane also furrowed her brows. <br/><br/>Daisy picked up her cellphone, looking up at Celeste. <br/><br/>Celeste, seeing her phone being taken away, looked at Daisy subconsciously. Seeing her staring back, Celeste’s eyelashes fluttered twice before she quickly forced a smile. <br/><br/>Daisy looked away and didn’t pay her any more attention. She pressed answer and went to the balcony to take the call. <br/><br/>When no incidents occur, phone calls between her and Kevin Clark hardly ever last longer than five minutes. <br/><br/>Moreover, they had already talked on the phone at noon, so tonight’s call might not even last three minutes. <br/><br/>Third Master Clark knew this, so he brought Charles Amos to Clark Manor to kill time. <br/><br/>Thus, the call successfully lasted more than ten minutes. <br/><br/>Before hanging up, Daisy advised Charles not to cause trouble and not to fall into the pool since he was staying at Clark Manor. <br/><br/>When Daisy returned to the dormitory, Serena Buster and the other two students had already gone to wash and rinse. <br/><br/>Only Olivia Lane and Celeste Martin were left in the dorm. <br/><br/>Olivia was on the phone too, and from the tone of her words, it seemed like William Lane was on the other end of the line. <br/><br/>Celeste heard the sound of the balcony door opening and immediately looked at Daisy, smiling, “Was it your boyfriend’s call?” <br/><br/>Daisy looked at her. <br/><br/>As Olivia continued her call, she too looked at Celeste. <br/><br/>Seeing both of them looking at her, Celeste froze for a moment, then laughed, “I’m sorry, I’m being nosy.” <br/><br/>“It’s nothing.” <br/><br/>“Don’t let yourself be bullied,” William said, “If you’re in trouble, call Kevin.” <br/><br/>“I know, you can hang up now, I’m going to wash up.” <br/><br/>“Alright, behave yourself.” <br/><br/>“I got it <br/><br/>Daisy looked down quietly and listened, a shallow smile in her eyes. <br/><br/>For a moment, she thought about why she liked this young girl. <br/><br/>Probably one-third of it was down to envy, she supposed. <br/><br/>As for the remaining two-thirds, she felt it might be fate. <br/><br/>“Are you going to wash up?” Olivia threw her cellphone onto the table and looked at her. <br/><br/>“Mhm.” <br/><br/>High school dorms have strict management; the lights are turned off at the designated hour. If you don’t finish washing up, the teachers will chase you like ducks. <br/><br/>Daisy and Olivia were both hurriedly sent back by the teachers. <br/><br/>Luckily, they both finished washing up and didn’t end up like the girls in the partition room next door, who had to return to the dorm with their hair covered in foam. <br/><br/>After returning to the dorm, the two tidied up in the dark and got into bed before the teacher came to check. <br/><br/>When the teacher left, Daisy said, “Olivia, dry your hair before you sleep.” The usually sharp-tongued little girl suddenly fell silent. <br/><br/>Daisy waited a few seconds, and when she didn’t hear a response, she called out to her again, “Olivia?” <br/><br/>Finally, Olivia replied, “What? You’re not allowed to call me by my name.” “Why?” Daisy whispered, “Why can others call you that, but I can’t?”\t\t\t\t\t\t</div>", "images": {}, "success": true}