{"id": 276, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14390953.html", "title": "Chapter 276 - 260: Sister 2", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 276 - 260: Sister 2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 276 - 260: Sister 2<br/><br/>Chapter 276: Chapter 260: Sister 2<br/><br/>Translator: 549690339<br/><br/>The four of them stood quietly for a few seconds. Olivia lowered her gaze and took a light breath, wanting to leave.<br/><br/>However, Hugo subconsciously grabbed her arm, not allowing her to walk away.<br/><br/>After letting off steam, Olivia realized she might have gone a bit too far. So she said nothing when Hugo grabbed her arm, just lowered her head and stayed still.<br/><br/>“Amelie.” Hugo softened his voice, “The Lanes didn’t come with you, and it’s not safe for you to go out alone at night.”<br/><br/>“I know.” Olivia paused and said softly, “Thank you for your concern, Brother Enamel.”<br/><br/>Daisy raised an eyebrow—the girl sure had a temper, but she was quick to admit her mistakes.<br/><br/>Seeing that Olivia was no longer angry, Hugo breathed a sigh of relief and gently tousled her hair. “Alright. Let’s go; I’ll take you back home.”<br/><br/>“Okay.”<br/><br/>Olivia responded and went ahead, with Hugo following closely behind.<br/><br/>Watching from where she stood, Daisy looked at Hugo for a moment.<br/><br/>Suddenly, she thought that maybe this man was not sent by Roy Madison.<br/><br/>“What’s wrong?” Harton asked her when he noticed she wasn’t moving. Daisy retracted her gaze and walked forward, “Nothing.”<br/><br/>Although Olivia and Hugo walked ahead, both she and Olivia, as if by tacit understanding, chose to sit in the back seat of the car when they got there.<br/><br/>Once they sat down, Daisy looked at the calmed Olivia. “Have you had enough excitement for today?”<br/><br/>Leaning back, Olivia glanced at her and said, “It wasn’t too bad. I didn’t expect this twist; however, that woman named Robinson and Brother Xavier do seem like a good match.”<br/><br/>Harton and Hugo stood outside the car, looking at each other.<br/><br/>Uncle and nephew were both glaring at each other with contempt.<br/><br/>In the end, it was Harton who got in the co-pilot seat first, a step ahead of Hugo.<br/><br/>Once he was inside, Olivia, who had been in mid-sentence, choked back her words, not daring to make a sound.<br/><br/>After a while, Hugo also got in. The pressure in the car dropped, as the two men’s presence doubled, making Olivia wish she could hide herself away.<br/><br/>The car started and drove smoothly.<br/><br/>After a while, Harton asked, “Shall I take you back to the school?”<br/><br/>“Yes.” Daisy said, “The back gate of the school.”<br/><br/>Harton chuckled and said, “Little girl, you broke school rules by sneaking out on your first day.”<br/><br/>Daisy looked down at her cell phone and said, “Is it my fault?”<br/><br/>“No, it’s mine.” Harton replied, “I didn’t explain things clearly, and I worried you.”<br/><br/>Olivia: “...” This was not the Harton she knew!<br/><br/>Daisy informed Holt that everything was fine now and put her phone away, saying, “I was just afraid Edward Kirsten would infiltrate Imperial Capital.” Hearing the name, Harton’s expression darkened. “He won’t get that chance.”<br/><br/>With this simple sentence, Daisy’s heart settled a bit. She smiled and said,<br/><br/>“Well, then, I’ll just pretend I was just here to watch the excitement.”<br/><br/>Harton smiled and said, “If you have any concerns in the future, let me know.<br/><br/>Running around at night and recording shows during the day? Your body can’t handle the lack of rest.. for new novels\t\t\t\t\t\t</div>", "images": {}, "success": true}