{"id": 275, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14290149.html", "title": "Chapter 275 - 260: Sister", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 275 - 260: Sister</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 275: Chapter 260: Sister <br/><br/>Translator: 549690339 <br/><br/>Kevin Clark spoke more casually with them, since they were of the same generation. <br/><br/>And the effect of this sentence was quite significant. <br/><br/>Both families instantly fell into a pondering state. <br/><br/>Seeing the effect, Robinson Scott almost clapped for Kevin Clark. <br/><br/>Robinson kept thinking: Brother Nine got a good marriage, Brother Nine knows how to control his husband, Brother Nine is so domineering. <br/><br/>No one spoke in the living room, and Daisy Zane calmly said: “I think Third <br/><br/>Master Clark makes sense.” <br/><br/>Everyone looked at Daisy Zane, who originally thought that Kevin Clark was right, but now they felt it even more reasonable after hearing her push. <br/><br/>Kevin Clark also looked at her, for the first time feeling so wonderful to be echoed. <br/><br/>And the way these two echo each other... <br/><br/>Is this...husband and wife? <br/><br/>Daisy Zane glanced at their eyes, then picked up the tea and took a sip. <br/><br/>With just a casual glance, everyone came back to their senses and looked away. <br/><br/>Adam Scott coughed lightly and said: “Hmm...what Third Master and Nana said makes sense. In-laws, what do you think?” <br/><br/>Pete Baker coughed again, if it weren’t for the presence of outsiders, he really wanted to curse him shameless. <br/><br/>Robinson Scott: If it makes sense, then don’t call them in-laws. <br/><br/>She was silently praying in her heart for him to leave quickly. <br/><br/>However, the prayer didn’t work. On the contrary, it had a counter-effect, causing Hugo Clark to suddenly speak. <br/><br/>His calm, even somewhat experienced tone, suddenly startled Olivia Lane. <br/><br/>“Why are you running out so late?” <br/><br/>Olivia Lane pursed her lips and didn’t answer him. <br/><br/>Hugo Clark looked at her and continued: “Won’t you be sleepy in class tomorrow if you go out so late?” <br/><br/>Olivia Lane still didn’t speak. <br/><br/>Daisy Zane glanced at Hugo Clark, thinking that he seemed to have been sent by William Lane. <br/><br/>And Kevin Clark also glanced at him, that glance seemed to be cursing him. How could their family have such a fool. <br/><br/>Didn’t they have anything else to say when they finally met? <br/><br/>However, Hugo Clark continued: “Didn’t you promise your brother that you would study hard this year?” <br/><br/>Kevin Clark: <br/><br/>“When do you graduate with this attitude toward learning?” <br/><br/>Olivia Lane was annoyed with his questions and looked at him, saying, “Can <br/><br/>you stop asking already! Graduation is next year anyway, there is no hurry. Why are you all so annoying? I’m not a child anymore, and a bunch of people are watching me.” <br/><br/>Hugo Clark stopped walking and looked at her. Seeing her angry appearance, he suddenly swallowed and didn’t dare to say anything. <br/><br/>Or rather...suddenly, he didn’t know what to say anymore. <br/><br/>Kevin Clark and Daisy Zane also stopped walking and looked at them..\t\t\t\t\t\t</div>", "images": {}, "success": true}