{"id": 271, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14285086.html", "title": "Chapter 271 - 258 Su Family_3", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 271 - 258 Su Family_3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 271: Chapter 258 Su Family_3 <br/><br/>Translator: 549690339 <br/><br/>Upon reaching the first floor, she observed there was no movement. She then quietly and cautiously made her way to the side door in the corridor. <br/><br/>There was a side door at the end of the corridor, which was usually locked. <br/><br/>Pulling out a piece of iron wire from a nearby broom, she opened the lock and glanced back. <br/><br/>The corridor was eerily quiet at night. <br/><br/>Feeling a slight shiver, sensing a strange and chilling aura, she quickly and silently stepped outside and then locked the door from the outside. <br/><br/>Quiet as a whisper, she had escaped from the dormitory. <br/><br/>Daisy Zane had climbed over the school wall and made her way to the main road, after which she used her cell phone to order a car. <br/><br/>As she was waiting for the car by the road, she heard the sound of footsteps. <br/><br/>It was rather late, and the noise seemed to be coming from the direction of the school fence. <br/><br/>She immediately turned around to look and saw Olivia Lane walking toward her. <br/><br/>Olivia Lane must have been running for some distance, her thin lips slightly parted as she panted. <br/><br/>Daisy Zane frowned as she saw her, her voice somewhat cold, “How did you manage to get out?” <br/><br/>Olivia Lane walked over, “What? You’re allowed to go out, but I’m not?” <br/><br/>Daisy Zane did not reply. <br/><br/>Oblivious of Daisy Zane’s eye, Olivia Lane responded, “I opened the lock on the side door on the first floor. I didn’t do something... like jumping out of the window, like you.” <br/><br/>Hearing her answer, Daisy Zane’s gaze softened slightly, “Ah, so you came out because of me. <br/><br/>“You must be dreaming if you think I’d come out because of you!” Olivia Lane stood next to Daisy Zane with her arms crossed. “I was having trouble sleeping and came out for some fresh air. I wanted to see if you had broken an arm or a leg.” <br/><br/>The wind was slightly strong that night, causing both their hair to flutter about. <br/><br/>Daisy Zane smoothed out her hair and said, “Don’t follow my example. It’s a <br/><br/>bad habit.’ <br/><br/>Olivia Lane glanced at him but said nothing. <br/><br/>Juan Wright then looked back at Daisy Zane. <br/><br/>Daisy Zane asked, “What’s happening inside?” <br/><br/>Juan Wright responded, “The Third Master and Young Master Lane are inside. They’ve been in there for almost ten minutes, not entirely sure what they’re doing.” <br/><br/>“Hugo Clark is also there?!” Olivia Lane immediately lost interest in the gossip. <br/><br/>“Yes, Miss Lane.” <br/><br/>Daisy Zane looked at Olivia Lane’s immediate reaction of wanting to hide and chuckled, “Let’s go in.” <br/><br/>“Okay.” <br/><br/>As they were walking in, Olivia Lane asked, “What happened that caused such a commotion? Who are those people?” <br/><br/>Daisy Zane replied, “The former Scott Family.” <br/><br/>Olivia Lane stopped in her tracks, “The Scott Family!” <br/><br/>Daisy Zane, knowing what she must be thinking, assured her, “There won’t be any problems.” <br/><br/>Considering her thought, Olivia Lane believed there probably wouldn’t be any issue as long as Harton Clark was present. <br/><br/>The two women entered the living room, permeated by an eerie silence, not knowing what the two sides had just discussed. <br/><br/>The whole living room was eerily silent. <br/><br/>It was only after the two of them entered the living room that the eerie silence was broken. <br/><br/>Everyone in the living room turned to look at the door upon hearing footsteps. <br/><br/>Harton Clark was sitting on the sofa, his face devoid of any expression as he looked their way. <br/><br/>The sharp and overpowering aura emanating from his narrow eyes was extremely intense and stifling, compelling and domineering in nature. <br/><br/>However, the moment he recognized who had walked in, his astonished gaze softened as all intensity dissipated. <br/><br/>His previously cold and indifferent face immediately softened into a gentle and warm expression. <br/><br/>Seeing his change of expression, Olivia Lane thought:\t\t\t\t\t\t</div>", "images": {}, "success": true}