{"id": 273, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14285806.html", "title": "Chapter 273 - 259_2", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 273 - 259_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 273: Chapter 259_2 <br/><br/>Translator: 549690339 <br/><br/>Now that Allonzo Hobson said something, Adam Scott ignored him. <br/><br/>Just as the atmosphere was frozen again, Allonzo’s father George Hobson and mother Phoebe Turner hurried over. <br/><br/>As soon as the two entered the living room, George nodded to Arthur North and Hugo Clark, then turned his gaze to Adam Scott and Pete Baker. Finndd new updates at novelhall.com<br/><br/>Meanwhile, Phoebe Turner made eye contact with Daisy Zane, and then her gaze fell directly on Robinson Scott. <br/><br/>“Dad, Mom, how come you’re here?” Allonzo Hobson walked up to them and asked. <br/><br/>But neither of them paid any attention to him, as if they hadn’t seen him at all. George went past him to shake hands with Scott and Baker, while Phoebe went straight to Robinson Scott. <br/><br/>Her eyes sparkled as she looked at Robinson as if she had found some kind of treasure. <br/><br/>“You must be Robinson Scott,” she said. <br/><br/>Robinson blinked and said, “Uh...yes.” <br/><br/>Phoebe’s eyes were practically closed from her smile, “You’re really beautiful.” Robinson awkwardly smiled back. <br/><br/>Allonzo’s heart sank at his mother’s smile. He had a feeling that bigger troubles were coming his way. <br/><br/>George stood in front of Adam Scott and extended his hand, “Mr. Scott, Mr. <br/><br/>Meanwhile, Arthur North and the others leisurely brewed their tea on the other side. <br/><br/>After preparing the tea, Arthur poured a cup for Daisy Zane. As soon as he finished, she handed the cup to Olivia Lane. <br/><br/>Arthur’s expression didn’t change, but he exchanged a glance with Hugo Clark. <br/><br/>Both men saw resentment in each other’s eyes. <br/><br/>Arthur’s resentment came from jealousy over Daisy’s kindness to someone else. Hugo’s resentment came from losing an opportunity to personally pour tea for Olivia. <br/><br/>The two men looked away from each other, feeling annoyed. <br/><br/>After observing Allonzo’s attitude and his parents’ demeanor, Adam Scott finally spoke up. He took a sip of the tea Phoebe had poured and said, “In this matter, Robinson is at fault too, she was simply groggy.” <br/><br/>“No, no,” Phoebe insisted with a smile, “It’s Allonzo, he didn’t handle the matter properly. It’s all his fault.” <br/><br/>“Uncle Scott, I do bear a great deal of responsibility for this,” Allonzo admitted. <br/><br/>Adam looked at Allonzo, thinking that he was good-looking, responsible, capable, and came from a good family with a good job. He was quite satisfied. Moreover, Allonzo’s parents seemed to be understanding and reasonable as well. <br/><br/>The Scotts had brought quite a few people with them, but the Hobsons hadn’t taken advantage of their geographical or power advantage to bully them... <br/><br/>Adam Scott straightened his face and said, “Regardless of who’s at fault, the fact that this incident has happened to these two children. I think...” Adam paused for a moment, taking a sip of tea. <br/><br/>George and Phoebe both looked at him, waiting for him to continue. <br/><br/>“I think this is also their fate,” Adam continued. “Since the incident took place and the scandal has begun to spread, why not take this opportunity and unite our two families through marriage?” <br/><br/>Upon hearing him say this, Pete Baker, who was clear about Adam’s intention from the beginning, lowered his gaze and continued drinking tea, not wanting to say a word..\t\t\t\t\t\t</div>", "images": {}, "success": true}