{"id": 270, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14285085.html", "title": "Chapter 270 - 258 Su Family_2", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 270 - 258 Su Family_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 270: Chapter 258 Su Family_2 <br/><br/>Translator: 549690339 <br/><br/>“No means no.” <br/><br/>“Okay,” Daisy Zane said, “Dry your hair before you sleep.” <br/><br/>“I know.” Olivia Lane replied impatiently. <br/><br/>The dorm teacher was strolling outside, and the six roommates whispered a few words when the teacher was not around. <br/><br/>However, after being warned twice, everyone quieted down. <br/><br/>Gradually, they all fell asleep. <br/><br/>Only Olivia Lane, because Daisy called her name, suddenly suffered from insomnia. <br/><br/>Actually, people around her called her by her name, but she didn’t know why Daisy calling her made her feel inexplicably panicked. <br/><br/>Lying in bed, staring at the ceiling, Olivia Lane didn’t fall asleep until after midnight. <br/><br/>However, fifteen minutes later, Daisy Zane’s cell phone suddenly lit up. <br/><br/>Afraid of disturbing others, she put her phone on mute before going to bed and placed it beside her pillow. <br/><br/>But as soon as it lit up, Daisy Zane opened her eyes. <br/><br/>Olivia Lane, who happened to have just fallen asleep, also opened her eyes due to the sudden brightness. <br/><br/>Daisy Zane saw that it was a call from Robinson Scott and hung up first. Then she covered herself with a quilt and texted him. Geet latest novel chapters on novelbj/n(.)c/om<br/><br/>Olivia Lane, who had been awakened, glanced at her, turned over gently, and continued to sleep. <br/><br/>If Edward Kirsten infiltrated the Imperial Capital, it would definitely be a big problem. <br/><br/>Adam Scott and Harton Clark should be acquainted. But for his daughter, Adam Scott could do anything. <br/><br/>Although he certainly wouldn’t be able to touch Harton Clark, if it escalated to a fight, the Imperial Capital might be in chaos. <br/><br/>But... Harton Clark should have a sense of propriety. <br/><br/>She just didn’t know if Adam Scott’s overnight visit to the Hobson residence with such a big show was within Harton Clark’s tolerance. <br/><br/>Daisy Zane thought about it and felt this might be the excitement that Harton Clark mentioned. <br/><br/>Since it was excitement, she should join in. <br/><br/>[Understood.] Daisy Zane replied to Holt Lawrence with a message. Then she left the partition and headed straight towards the window. <br/><br/>There were no railings on the restroom windows, so she opened the window and looked down. <br/><br/>Then she propped herself up on the windowsill with one hand and jumped out of the window. <br/><br/>Olivia Lane saw that she hadn’t returned, so she went out for a look. But as soon as she entered the restroom, she saw her jumping out of the window. <br/><br/>She was startled, feeling as if her heart had stopped for a moment, and ran immediately to the window to look down. <br/><br/>Then she saw Daisy Zane, dressed in black, walking towards the school’s exit. <br/><br/>Olivia Lane watched her figure, her heart that almost jumped to her throat slowly subsided, and then she looked down again. <br/><br/>Third floor... <br/><br/>What was she doing jumping out so late? <br/><br/>Olivia Lane stood by the window, watching Daisy Zane’s figure disappear. After thinking about it, she quickly returned to her dormitory, changed her clothes quietly, and left the dormitory to run down the side stairs..\t\t\t\t\t\t</div>", "images": {}, "success": true}