{"id": 274, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14290146.html", "title": "Chapter 274 - 259_3", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 274 - 259_3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 274: Chapter 259_3 <br/><br/>Translator: 549690339 <br/><br/>Who would have thought he came with such a grand display just to threaten someone into marrying his own daughter? <br/><br/>Everyone stared at Robinson Scott with widened eyes. <br/><br/>Allonzo Hobson and Robinson were completely dumbfounded. <br/><br/>George Hobson’s expression, besides being surprised, was obviously mixed with some strange emotions. Then he glanced at Phoebe Turner. <br/><br/>Phoebe hesitated for a moment, then clapped her hands and laughed, “Mr. Hobson, is that really what you’re thinking? That’s what I was thinking too!” Allonzo looked at his mother: “?” <br/><br/>“I took a liking to Robinson the moment I saw him, thinking we have fate together.” Phoebe said, “Sure enough, we’re on the same page.” <br/><br/>A smile finally appeared on Adam Scott’s face: “I’m also quite satisfied with your son.” <br/><br/>“Dad!” Robinson called out to him. <br/><br/>Adam gave her a fierce glare: “Shut up!” <br/><br/>Robinson turned to look at Pete Baker: “Daddy...” <br/><br/>“There’s no use in calling him. I’ve made up my mind about this.” Adam said. <br/><br/>Robinson opened her mouth, anger on her face but not daring to speak it, face turning red. <br/><br/>Kevin Clark raised his eyebrows and whispered to Daisy Zane, “Lively.” Th/e most uptodate novels are published on n0velbj)n(.)co/m<br/><br/>Daisy looked at him sideways. She really didn’t expect what he meant by “lively” to be this matter. <br/><br/>How well do you have to understand someone so that you can even predict what Adam would want to do after seeing that piece of gossip? <br/><br/>Third Master Clark’s reputation for being calculating is indeed not in vain. <br/><br/>“Why that look?” Kevin smiled at her. <br/><br/>Daisy looked at him for a moment longer. <br/><br/>Since he understood people to that extent, and Kevin would definitely not joke around about this kind of thing to screw over Allonzo and Robinson, he must have a solution. <br/><br/>“You solve it.” Daisy said calmly. <br/><br/>“Alright, I’ll solve it.” Kevin said, “Shall I take you home first?” <br/><br/>Daisy glanced at Olivia Lane, who was resting her chin on her hand, looking very interested, and said, “A cup of tea.” <br/><br/>Meaning to stay for the time it takes to drink a cup of tea. <br/><br/>Xavier, who was daydreaming, sensed the attention on himself, straightened up, and said, “This situation arose because of me and has implicated Miss <br/><br/>Scott’s reputation. As I said, I will take responsibility. As long as Miss Scott has no objections, I can agree.” <br/><br/>“You can kiss my ass.” Robinson grabbed a pillow from the side and threw it at Xavier. <br/><br/>Xavier didn’t dodge and was hit by the pillow. <br/><br/>“You stay put,” Adam Scott told her. <br/><br/>Robinson glared at Xavier and then Adam Scott before yelling, “Brother Nine!” <br/><br/>“It’s no use calling for Nana,” Adam Scott said, “I’ve made the decision on this.” Daisy Zane, who was called, looked at Kevin Clark. <br/><br/>Kevin Clark smiled at her and said, “Mr. Hobson, Mr. Baker, we can’t force relationships.” <br/><br/>Everyone looked at Kevin Clark. <br/><br/>Under the incandescent lamp, the enchanting aura between Kevin’s eyebrows became clearer: “How about letting them get to know each other first, for a period of one year? Let the two of them decide for themselves.” <br/><br/>“This...” Adam Scott didn’t want to. <br/><br/>“Mr. Scott,” Kevin spoke to him, “Even if you were to tie Robinson up and take her to the Civil Affairs Bureau tomorrow, after you leave, she could easily get a divorce if they don’t have that fate. Then she’d be a divorcee.” <br/><br/>This means that it would be even more difficult for her to get married. <br/><br/>Initially, Adam and Pete wanted to adopt a boy, which would be more convenient to care for. <br/><br/>But they happened to pick up Robinson from the road. <br/><br/>Over the years, those well-matched families have looked down on Robinson because of her background. It’s not only due to their relationship but also due to the gossip about them raising a little girl, as well as criticisms of Robinson. <br/><br/>People always talk about gender equality, but deep down, they’re always more vicious to girls. <br/><br/>Even their legally recognized father-daughter relationship was dragged through the mud. <br/><br/>Robinson has had a bad temper since childhood, and the only reputable job she has now is the leader of the Darknight Clan. <br/><br/>But those well-matched families also despise a girl with ambitions, who is involved in strife and killings. <br/><br/>For the lesser families, Adam and Pete can’t approve. <br/><br/>That’s why they’ve been worried about Robinson’s marriage for years. <br/><br/>If they don’t address her marriage, they’ll be guilty for a lifetime. <br/><br/>So, they inquired about Xavier, and then they forced the marriage. <br/><br/>But... what if... she becomes a divorcee? It would be an even bigger problem then. <br/><br/>“Since fate has brought everyone here, why not give it another chance?” Kevin suggested, “What do you think?”\t\t\t\t\t\t</div>", "images": {}, "success": true}