{"id": 278, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14390961.html", "title": "Chapter 278 - 261 Civil Affairs Bureau", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 278 - 261 Civil Affairs Bureau</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 278 - 261 Civil Affairs Bureau<br/><br/>Chapter 278: Chapter 261 Civil Affairs Bureau<br/><br/>Translator: 549690339<br/><br/>Olivia Lane’s face was buried in Hugo Clark’s chest, biting her lip stopping any sound escape, but her shoulders kept quivering slightly.<br/><br/>Hugo Clark looked down at her, his hand gently stroking her head.<br/><br/>After a moment of watching them, Arthur North unbuckled his seatbelt, got out of the car, then opened the rear door.<br/><br/>Daisy Zane heard the sound of the door, her eyelashes fluttered once before she hesitated and then followed him out of the car, walking forward.<br/><br/>The pair walked into a nearby alleyway and stopped, standing shoulder to shoulder by the wall.<br/><br/>Daisy Zane looked looking back once again before pondering, “Your nephew...”<br/><br/>“What about him?” Arthur North laughed.<br/><br/>Daisy Zane shot him a glance, lazily saying, “Suddenly, I find him a bit displeasing.”<br/><br/>As she spoke, she stretched her hand into his pocket only to find it empty.<br/><br/>Arthur North’s leg felt the warmth from her hand, and his pupils suddenly trembled, “Little girl, you...”<br/><br/>“Where are the candies?” she glanced into his pocket, “Didn’t you bring any?”<br/><br/>Arthur North quickly came back to his senses and handed her two pieces of candy from his other pocket, “Here.”<br/><br/>Daisy Zane accepted them, unwrapped one and put it in her mouth.<br/><br/>Arthur North rubbed his fingers, his movement subtle as he touched the spot on his leg which had been touched by her. Then he swallowed, turning his head and asking, “How does it taste?”<br/><br/>Daisy Zane looked at the wall across from them, hearing his question but saying nothing in response nor looking at him. Instead, she just offered him another piece of candy with a casual flip of her hand.<br/><br/>Arthur North’s body jolted, his breathing faltered for a moment, becoming a bit heavier than before.<br/><br/>Just as he was catching his breath, Daisy Zane pulled away from his embrace, stepping back a couple of steps. She put the candy she had clenched in her hand into her mouth, watching him with what looked like a challenge.<br/><br/>Arthur North pressed his lips together, slowly calming his breathing and looking at the mischievous little girl in front of him.<br/><br/>He had figured it out; until he made a serious move, she would always brazenly provoke him.<br/><br/>After a moment, he took a step forward.<br/><br/>Daisy Zane showed no fear, meeting his gaze, staring into his seductive and intimidating gaze.<br/><br/>Arthur North took another step, grabbing her hand and saying, “Let’s go home.<br/><br/>Tomorrow at 8 0’clock, we’ll go to the Civil Affairs Bureau.” Hearing his words, Daisy Zane’s eyes widened little by little.<br/><br/>“Let’s go.” Arthur North pulled her hand, intending to leave the alley. Daisy Zane pulled back against his direction with some force.<br/><br/>Arthur North stopped in his tracks and looked at her.<br/><br/>The cold moonlight poured down, accompanied by the night breeze. The evening was covered in a layer of chill.<br/><br/>The two people stared at each other for a moment; Arthur North chuckled, standing in front of her, pinched her cheeks, and his voice softened, “Are you scared?”<br/><br/>Daisy Zane looked at him but didn’t say anything.<br/><br/>“Behave from now on.” Arthur North continued, “If not, whether you like it or not, I’ll take you to the Civil Affairs Bureau.”<br/><br/>Daisy Zane stared at him for another moment, looked down and laughed, “You can try it.”<br/><br/>Arthur North heard the scorn in her voice, and said, “Little girl, you can’t beat me.”<br/><br/>Daisy Zane lifted her head and squinted at him, “I will be able to eventually..”\t\t\t\t\t\t</div>", "images": {}, "success": true}