{"id": 279, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14390965.html", "title": "Chapter 279 - 261 Civil Affairs Bureau_2", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 279 - 261 Civil Affairs Bureau_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 279 - 261 Civil Affairs Bureau_2<br/><br/>Chapter 279: Chapter 261 Civil Affairs Bureau_2<br/><br/>Translator: 549690339<br/><br/>Arthur North raised his eyebrows and leaned down to kiss her, saying, “Okay, I’m ready for battle anytime.”<br/><br/>Daisy Zane once again looked away, watching Kevin Clark standing outside the car in the distance for a while.<br/><br/>Arthur North stopped talking, holding her hand and pinching her fingers.<br/><br/>After a while, Daisy’s gaze gradually became unfocused, her thoughts drifting far away. Then she suddenly said, “Wait until the variety show is over.”<br/><br/>“Huh?” Arthur didn’t quite understand her sudden statement.<br/><br/>Daisy lowered her gaze, but it didn’t settle anywhere concrete, her voice still somewhat cold: “Go to the Civil Affairs Bureau.<br/><br/>Arthur’s grip on her hand suddenly tightened, his pupils trembling violently deep inside, and he opened his mouth twice but failed to speak: “Wh-what?” Daisy looked up at him, only to find that the corners of his eyes had suddenly turned red.<br/><br/>She hesitated for a moment, then suddenly laughed: “Third Master... you...”<br/><br/>Arthur grabbed her shoulder and interrupted her for the first time: “Little Girl, what did you just say?”<br/><br/>Daisy looked at him but deliberately remained silent.<br/><br/>Arthur never expected that at this moment, this little girl would still be teasing him. He couldn’t help but laugh and said, “The variety show will be over on the weekend. In two days, let’s go to the Civil Affairs Bureau. By then, whatever happens, don’t back out, got it?” Daisy still didn’t say anything.<br/><br/>“Do you understand?”<br/><br/>Seeing his truly anxious expression, Daisy finally spoke: “Mhm.”<br/><br/>Arthur immediately laughed, his hand trembling, holding her face, and kissed her lips several times: “Little girl... thank you.”<br/><br/>Daisy’s eyelashes trembled twice, and she pursed her lips without saying a word.<br/><br/>“There will be news,” Kevin said.<br/><br/>Olivia lowered her head, her hair scattered on both sides, and said nothing.<br/><br/>Kevin tucked her hair behind her ears. If it hadn’t been for tonight’s upheaval, no one would have known that she had been waiting for Lila Campbell to return.<br/><br/>She had disguised her true feelings, acting indifferent, willful, and domineering.<br/><br/>At that time, she was only nine years old, so little, and yet she pretended not to care about anything, just so her family wouldn’t worry about her. “Where are Third Uncle and Daisy Zane?” Olivia Lane suddenly asked.<br/><br/>“In the alley up ahead.”<br/><br/>“Oh,” Olivia said, “I thought Daisy Zane had left me behind and run away.”<br/><br/>Kevin Clark hooked the corner of his lips and said, “Are you going back to school?”<br/><br/>“Mhm,” Olivia said with a nasal voice, “Didn’t you say you want to have a good learning attitude?”<br/><br/>“That’s what you said, the college entrance exam isn’t until next year.”<br/><br/>Olivia pouted, feeling somewhat willful: “I want to go back to school. Ask Daisy Zane for me.<br/><br/>“Okay.”<br/><br/>Kevin took out his cell phone and called Arthur North, asking them to come back.<br/><br/>Arthur North and Daisy Zane came back quickly.<br/><br/>Kevin Clark watched his Third Uncle go to the alley and come back with an expression as if he had found a gold mine, a flicker of doubt flashed in his eyes.<br/><br/>Olivia Lane glanced at the two of them and then lowered her head. Then, she hesitated and said, “Third Uncle, I’m sorry for causing you trouble.”<br/><br/>Arthur North’s mood was so good that even if Olivia were really causing him trouble right now, he probably wouldn’t mind. But as soon as he spoke, his voice became as deep as usual, like an elder: “Lila Campbell would also want to see her sister outstanding..”\t\t\t\t\t\t</div>", "images": {}, "success": true}