{"id": 284, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14390985.html", "title": "Chapter 284: 263: Compensation For The Door", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 284: 263: Compensation For The Door</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 284: 263: Compensation for the Door<br/><br/>Translator: 549690339<br/><br/>Daisy Zane looked at the few wilted men in the restroom, and then glanced at Marsh Turner.<br/><br/>It seemed that this kid not only has a good family background, but it’s also quite intimidating, enough to make them scared like this.<br/><br/>“Marsh... Marsh Brother?” one of the boys said.<br/><br/>Marsh Turner looked at them, his usually smiling eyes suddenly turning cold:<br/><br/>“Bullying people, and now you’ve reached me.”<br/><br/>“Brother Marsh, it’s a misunderstanding.”<br/><br/>“You beat someone like this and you call it a misunderstanding.” Marsh Turner looked at them and said, “So if I cripple you now, can I also say it’s a misunderstanding?”<br/><br/>“Enough.” Skyler Thomas said, “You all go back to class, I’ll handle this matter.”<br/><br/>Marsh Turner’s gaze moved away from them and looked at Skyler Thomas, his voice slightly softened: “Teacher, it’s your class. Without you, how are we going to attend?”<br/><br/>Skyler Thomas:<br/><br/>“I’ll stay with you.” Marsh Turner said.<br/><br/>Skyler Thomas almost believed he was making sense, but he reacted in time: “Go away, you just don’t want to attend class. Go to the office, get the papers from my desk, and distribute them to everyone to complete.”<br/><br/>Marsh Turner:<br/><br/>“Move!” Skyler Thomas said, “I’ll take William Butch and the others to see the principal.”<br/><br/>Instead of looking at him, Daisy Zane looked at Skyler Thomas and said,<br/><br/>“Teacher, let’s go back to class.”<br/><br/>Skyler paused for a moment, then realized: “Alright, since it’s like this, everyone disperse.”<br/><br/>One of the boys leading the group laughed, glanced at William Butch, and then looked at Daisy Zane before swaggering out of the restroom.<br/><br/>If it wasn’t for Marsh Turner standing next to Daisy Zane, they might have bumped into her when they walked out.<br/><br/>Daisy Zane watched them leave the restroom from the corner of her eye.<br/><br/>Starting from the third boy, when they walked beside Marsh Turner, they would call out to him: “Brother Marsh.”<br/><br/>One even said, “Brother Marsh, I’m leaving.”<br/><br/>Marsh Turner didn’t bother looking at them and just replied, “Hurry up and get lost.”<br/><br/>When they had all finally left, Skyler Thomas looked at Daisy Zane again, then took William Butch with him: “Let’s go, you come with me to the office to clean up your clothes first.”<br/><br/>William Butch’s lips moved, and as he followed Skyler Thomas out. When he reached Daisy Zane’s side, he paused for a moment. Then, with his head lowered, he whispered, “Thank you.”<br/><br/>After saying that, he quickly caught up with Skyler Thomas and left.<br/><br/>As Daisy Zane and the others walked back, the cameraman said, “Teacher Zane, our equipment has built-in audio recording capabilities, and the sound pickup function of your and Best Actor Dunn’s mics is also good. We were close just now, so we should have picked up some of the conversations inside.”<br/><br/>Daisy Zane nodded and said, “If needed, I’ll contact you.”<br/><br/>“Alright.”<br/><br/>After the two of them finished talking, Marsh Turner finally asked, “Daisy, why did you stop me just now?”\t\t\t\t\t\t</div>", "images": {}, "success": true}