{"id": 281, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14390973.html", "title": "Chapter 281 - 262: The Power Of Sister Xi", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 281 - 262: The Power Of Sister Xi</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 281 - 262: The Power of Sister Xi<br/><br/>Chapter 281: Chapter 262: The Power of Sister Xi<br/><br/>Translator: 549690339<br/><br/>The ringtone was extremely harsh, like a broken, rusty horn rubbing and tearing at the ears, making people’s scalp tingle.<br/><br/>The ringing got louder and louder near the ear, and Daisy Zane, who was lying on her side in bed, suddenly opened her eyes.<br/><br/>Her beautiful phoenix eyes were filled with a cold chill.<br/><br/>Her forehead and neck were covered in sweat beads. Her heartbeat was fast, and her breathing was a bit rapid.<br/><br/>She opened her eyes, stared at the wall for a while, then slowly adjusted her breathing while thinking about the scene in her dream.<br/><br/>After a moment, she gently frowned and raised her hand to press her temples, somewhat unable to recall what she had dreamt about.<br/><br/>The ringing stopped, and the song played louder.<br/><br/>There were sounds of getting up and turning over in the dormitory.<br/><br/>Daisy Zane lay still for a while, rubbed her aching head, and sat up.<br/><br/>Olivia Lane on the opposite bed was still asleep, probably because the wake-up bell was too loud, so she was curled up under the quilt.<br/><br/>The other two classmates were already up and sitting on the bed changing clothes.<br/><br/>Celeste Martin and Serena Buster on this side hadn’t gotten up, but Celeste had already opened her eyes and was lying in bed. Daisy couldn’t see if Serena was awake because she was a bit far away.<br/><br/>But it was Serena who made the first sound: “Ah—why so early? I’m not even fully awake yet.”<br/><br/>She finished washing quickly, and when she returned, no one else in the dormitory had come back yet.<br/><br/>Olivia Lane was still sleeping in bed.<br/><br/>Daisy cleaned up her stuff and got dressed. Then she went up the small staircase beside Olivia Lane’s bed, sat on the stairs, and pulled the quilt down, revealing her head.<br/><br/>“Miss, are you getting up or not?” Daisy looked at her and said, “It’s already six forty-five.”<br/><br/>Olivia curled up her body, her hair stuck to her face, and her eyes were still swollen from crying last night.<br/><br/>Because she heard her speak, Olivia tried to cover her head with the quilt. But Daisy grabbed her wrist and laughed, “It’s time to get up.”<br/><br/>Olivia frowned, shook off her hand, hugged the quilt and said, “I’m not going, ask for a leave for me.’<br/><br/>“Are you sure you’re not going?”<br/><br/>“I’m too sleepy.” Olivia rubbed her head against the quilt again, “I’m not going.<br/><br/>Just tell the teacher I have my period, and I have a stomachache.”<br/><br/>“Alright.” Daisy moved the hair from her face and hesitated for a moment before she couldn’t help but poke her face, “Should I ask for half a day or a whole day?”<br/><br/>“Half day.” Olivia’s voice grew faint, “Aunt Cruz will bring my lunch at noon, so I have to go out. Otherwise, my brother will find out I missed class again.”<br/><br/>Daisy laughed: “What about breakfast?”<br/><br/>Olivia waited quietly for a while, then touched her cell phone, unlocked it with her fingerprint, and handed it to Daisy, “Send a message to Aunt Cruz saying I’m having breakfast with my classmates, so she doesn’t have to bring it.”<br/><br/>Daisy took the phone and found Aunt Cruz..\t\t\t\t\t\t</div>", "images": {}, "success": true}