{"id": 285, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14390989.html", "title": "Chapter 285: 263: Compensation For The Door_2", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 285: 263: Compensation For The Door_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 285: 263: Compensation for the Door_2<br/><br/>Translator: 549690339<br/><br/>“Even if we help Arthur North today and vent his anger, once we leave, he will still get beaten up anyway. Perhaps even more severely,” Daisy Zane says, with her hand in her trouser pocket. “If he can’t learn to fight back, any help from others will be futile.’<br/><br/>“Hmm,” Marsh Turner understands, but feels the problem has become more difficult. “Indeed, nobody can follow him 24/7. But do you think he looks like someone who would fight back?”<br/><br/>Daisy Zane says nothing.<br/><br/>“The more honest and submissive he is, the more he will be bullied.” Marsh Turner clicks his tongue again. “The faces of those six guys just now pissed me off.’<br/><br/>Daisy Zane glances at him, noticing his youthful exuberance.<br/><br/>“Next time I see them, I’ll teach them a lesson,” Marsh Turner mutters to himself.<br/><br/>“Be careful that your dad doesn’t find out and beat you up,” George Dunn says.Yôur favorite stories at novelhall.com<br/><br/>“As long as he doesn’t find out, it’ll be fine,” Marsh Turner mumbles in response.<br/><br/>Daisy Zane chuckles, “Go get the test papers. Teacher Little Geng asked you to get them.”<br/><br/>“Almost forgot.” Marsh Turner slaps his forehead, “Daisy, I’ll go first.”<br/><br/>Daisy Zane and George Dunn watch Marsh Turner run forward. After a while, he even jumps up and touches a slogan on the corridor wall.<br/><br/>Children of this age are at their best. They are carefree, bright, occasionally naughty and mischievous, but always kind-hearted, full of justice, free of worries, and have boundless futures.<br/><br/>Daisy Zane walks slowly and watches Marsh Turner’s figure until he disappears.<br/><br/>Instead of being comforted by Third Master’s gentle laughter, everyone feels as if something unclean has entered the office and taken control of Third Master.<br/><br/>Or they think they must have been too busy lately, causing hallucinations in their eyes and ears.<br/><br/>In the school, the morning classes consist of writing exams and going over them.<br/><br/>It’s Daisy Zane’s first day of school, and she hasn’t gotten over the novelty of it yet.<br/><br/>As for the other seven participants of the variety show, after a morning full of lessons, they gather in the cafeteria and are all exhausted.<br/><br/>Firstly, they lack the energy and spirit that current students possess; secondly, they have already experienced Senior Three once and now really don’t want to revisit the past, lacking the same determination as before, which only brings tiredness.<br/><br/>Moreover, according to them, the more time passes, the more boring and harder it becomes.<br/><br/>What they see and experience now is just the tip of the iceberg.<br/><br/>After lunch, Daisy Zane returns to the classroom with her classmates.<br/><br/>She sits in her seat and looks at the seat in front of her.<br/><br/>Arthur North has not returned all morning, and Skyler Thomas checked the classroom during the long break but didn’t come back again afterwards.<br/><br/>Turner Daniels sits in front, staring blankly for a while before grabbing a test paper and burying his head in it.<br/><br/>Seeing him writing the exam, Daisy Zane glances at her own desk, takes out her cell phone, and checks if there are any important matters to deal with.<br/><br/>One year ago, when she planned to go to Truro City, she had already arranged all matters related to various continents well in advance. There are people guarding every place. They can handle things unless there are major events that need to be discussed or require her intervention. In general, most messages they send are casual chats..\t\t\t\t\t\t</div>", "images": {}, "success": true}