{"id": 283, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14390981.html", "title": "Chapter 283 - 262: The Power Of X Sister – 3", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 283 - 262: The Power Of X Sister – 3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 283 - 262: The Power of X Sister – 3<br/><br/>Chapter 283: Chapter 262: The Power of X Sister – 3<br/><br/>Translator: 549690339<br/><br/>“Aren’t you good at studying? A genius? You are the grade topper even though you are younger than us, aren’t you? How come you’re not anymore?”<br/><br/>“Let me think, let me think about how many points you got at the end of the semester. It should be more than a thousand, right?”<br/><br/>“You still come to school and want to study like this? What’s the use? With these useless grades, you can’t even get into a university.”<br/><br/>“Let me give you some advice. Go be a little escort, accompany a few rich people. Make more money while you’re young. Otherwise, when you get old, no one will want you. Hahaha...”<br/><br/>After the voice, there are a few slaps.<br/><br/>The restroom’s soundproofing is good, and after closing the door, the sound inside is very small.<br/><br/>The incoming 16th class, separated by a ladies restroom and a small storage room, can’t hear any sound from this side.<br/><br/>Daisy Zane and George Dunn just happened to be walking by and heard it because they were close.<br/><br/>Listening to it, George’s brows furrowed deeper, and he was about to take action when he heard Daisy give a light sigh and walked in front of the men’s restroom door. She kicked the restroom door open with one foot.<br/><br/>With a crash, the door was kicked open, hit the wall on one side, and bounced back.<br/><br/>Daisy propped it up with her foot and looked at the several men in the restroom.<br/><br/>The cameraman who had been following the two of them saw this and was about to turn off the camera, but George stopped him.<br/><br/>Let them keep shooting.<br/><br/>He walked to Daisy’s rear side.<br/><br/>In the restroom, six boys were huddled around, all startled and scared, looking apprehensively at the entrance.<br/><br/>Daisy was dressed neatly in a school uniform, with her hands in her trouser pockets, standing straight, her hair tied up in a high ponytail, with beautiful phoenix eyes that tilted up slightly at the corners.<br/><br/>At first, they didn’t know what had happened until a curious boy peeked out from the back door and saw Daisy and George standing at the entrance to the men’s restroom.<br/><br/>So he hurried to notify the teacher.<br/><br/>Skyler Thomas came quickly with Marsh Turner and a few boys, asking, “What’s going on? What’s happened?”<br/><br/>Hearing her voice, Daisy glanced at her from the side.<br/><br/>With just that glance, it was enough to make one’s heart race.<br/><br/>As a teacher, Skyler had studied some psychology and was able to sense the intense emotions from Daisy’s gaze.<br/><br/>It was a feeling that she had never seen in the people she had met before and was not present in the people at the scene.<br/><br/>As if this person had been shattered and reassembled, experiencing a great ordeal, and polishing her heart to be unbreakable.<br/><br/>After giving Skyler a glance, Daisy gestured into the restroom, whispering, “Bullying our classmates.”<br/><br/>Skyler stood at the door, looked at the few boys, and then at William Butch standing beside George, her expression immediately becoming stern, “Which class are you guys from? Follow me to the principal’s office.”<br/><br/>Hearing Skyler’s words, the boys didn’t care and even felt disdainful.<br/><br/>But Marsh squeezed in beside Daisy and asked, “Daisy, are you alright? Did you get hurt anywhere?”<br/><br/>Daisy looked at him and shook her head.<br/><br/>George looked at Marsh and shook his head, thinking, “Young man, you don’t know anything about your Daisy’s strength. Your Daisy broke the door lock with just one kick.”<br/><br/>With that thought, George looked at the lock on the door.<br/><br/>It had fallen to the ground in two halves, with a small part still dangling on the door.<br/><br/>The six boys wilted upon seeing Marsh appear, although he didn’t look at them or speak to them.<br/><br/>Like flowers and plants withering in the hot sun..\t\t\t\t\t\t</div>", "images": {}, "success": true}