{"id": 286, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14390993.html", "title": "Chapter 286: 263: Compensation For The Door—3", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 286: 263: Compensation For The Door—3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 286: 263: Compensation for the Door—3<br/><br/>Translator: 549690339<br/><br/>Whenever she was idly chatting, Daisy Zane was pretty casual.<br/><br/>Replying whenever she felt like it and leaving messages read without replying if she didn’t.<br/><br/>Today was no exception, only Holt Lawrence was trying to reach her for various reasons to meet up.<br/><br/>[Nana, the biennial selection for Celestial Pivot is about to start, do you want to make the questions?]<br/><br/>Daisy Zane leaned back in her chair, wearing a Bluetooth headset. Her hand holding the cell phone resting on her leg, lowered her head, and tapped the<br/><br/>reply to Holt Lawrence: [Let me make the questions, you mean no one wants to participate this year?] Holt Lawrence: [...Can you be a bit humble?]<br/><br/>[Why should I be humble?]<br/><br/>[Fine, fine, you have the right to be proud. The quality of the competitors chosen in the year before last was too low, I want to raise the difficulty of the selection this year.]<br/><br/>Daisy Zane understood.<br/><br/>It wasn’t that he desperately needed her to come up with the questions; he needed the reputation of “Nathan Ninevara” behind the questions. That way, many people would participate, and the quality of the participants would be better from the start of registration.<br/><br/>[How many questions, and what difficulty?] Daisy Zane replied.<br/><br/>[Three. You choose the difficulty. It’s just for your namesake anyway, it won’t be the sole assessment standard.]<br/><br/>Daisy Zane: .<br/><br/>Just as Daisy Zane was about to reply, Turner Daniel suddenly turned his head. So, she looked up at him.<br/><br/>Turner Daniel held a pen in his right hand and a test paper in his left. When their eyes met, he hesitated for a moment.<br/><br/>No matter how many times he saw her face, each time he did, it was still captivating.<br/><br/>How could someone be so beautiful.<br/><br/>Especially those eyes, deep and tranquil like an ancient well, devoid of any emotion, it was even impossible to see any feelings hidden within.<br/><br/>But they were incredibly alluring all the same.<br/><br/>Seeing him spaced out, Daisy Zane asked, “What’s up?<br/><br/>The Chinese characters... Celeste Martin and Jessica Maxwell could recognize, but they had never seen those numbers and symbols that followed.<br/><br/>The two exchanged glances, unable to speak. He wrote that question, and they wondered what connection it had with the questions on their test papers that made him think of this question.<br/><br/>Turner Daniel also didn’t look at them, and took a piece of A4 paper from his desk, placed it next to Daisy Zane, and said, “This is the working I just did, the result came out, but it’s too complicated. I remember our professor explained it very simply.”<br/><br/>Celeste Martin and Jessica Maxwell looked at that piece of paper, filled with dense writing on both front and back. And they thought he was not writing about math, but English.<br/><br/>Symbols and letters covered the entire paper.<br/><br/>The four of them fell silent for a moment, then Jessica Maxwell spoke sarcastically, “Can she understand it?”<br/><br/>Turner Daniel frowned slightly, while Daisy Zane picked up the pen on her table, and directly wrote down a mathematical method on the test paper followed by three formulas.<br/><br/>Celeste Martin and Jessica Maxwell still couldn’t understand it.<br/><br/>However, Turner Daniel widened his eyes, looked at the mathematical method, then looked at Daisy Zane.<br/><br/>His face showed a sudden understanding after his initial shock.<br/><br/>“Is the professor Edbert Shire?” Daisy Zane asked.<br/><br/>“No.” Turner Daniel said, “Do you know her?”<br/><br/>“I don’t.” Daisy Zane replied, “I’ve read her published thesis, and this mathematical method was developed by her.”<br/><br/>“Yeah.” Turner Daniel stared blankly at Daisy Zane, with little stars of admiration in his eyes if you looked closely, “She’s my mother.”<br/><br/>Daisy Zane: . So it’s a family of super scholars.<br/><br/>Turner Daniel looked back at the test paper, “If we use this method... it’s even simpler than what the professor explained.”<br/><br/>“You haven’t read your mother’s research results?” Daisy Zane asked.<br/><br/>“I just have a general understanding.” Turner Daniel replied, “I didn’t know it could be applied so broadly.”<br/><br/>“Here’s a suggestion for you.” Daisy Zane said.<br/><br/>“What?”<br/><br/>“Bribe the program team to delete this part, or else I’m afraid you won’t be able to go home.” Daisy Zane said quietly..\t\t\t\t\t\t</div>", "images": {}, "success": true}