{"id": 280, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14390969.html", "title": "Chapter 280 - 261 Civil Affairs Bureau—3", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 280 - 261 Civil Affairs Bureau—3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 280 - 261 Civil Affairs Bureau—3<br/><br/>Chapter 280: Chapter 261 Civil Affairs Bureau—3<br/><br/>Translator: 549690339<br/><br/>The light in Daisy Zane’s eyes flickered.<br/><br/>The young lady from the Lane family...seemed to be not at home. Had she... disappeared?<br/><br/>Indeed... when Arthur North mentioned Lila Campbell, Arthur’s mood showed a very subtle change. She didn’t pay much attention to it at the time, but thinking about it now, it felt a bit off.<br/><br/>But...since she wasn’t at home, why did everyone still come to the city to celebrate her birthday every year?<br/><br/>Listening to Arthur North’s words, Olivia Lane tightened her hand resting on her leg but remained silent.<br/><br/>Arthur North stopped there and didn’t say anything else.<br/><br/>Daisy Zane, leaning against the car, reached out, flicked her eyelashes, and asked: “Are you going back to school?”<br/><br/>Olivia Lane looked at her, her eyes were red from crying and a little swollen.<br/><br/>But her gaze was very fierce: “Why? Are you not going back?”<br/><br/>Upon seeing her like this, Daisy Zane deliberately didn’t answer.<br/><br/>Instantly, Olivia Lane grew even more angry, her expression fierce much: “How could you be like this! You brought me out here! And now you’re not going back! We’re already at the school gate!”<br/><br/>Arthur North and Hugo Clark both looked at Daisy Zane.<br/><br/>Daisy Zane laughed and said, “Lady, you’re being unreasonable. I came out, and you followed.”<br/><br/>“I don’t care! I have to return to the dormitory, and you must come back with me.”<br/><br/>“What if I don’t?” Daisy Zane asked.<br/><br/>Arthur North watched her teasing the kid:<br/><br/>Hugo Clark: ‘<br/><br/>Calling her immature wasn’t quite right since her tone, speech, and manner were all very steady and mature. However, calling her mature also wasn’t suitable as she was teasing others like a child.<br/><br/>“It’s not okay, you must come back with me!” Olivia Lane insisted, “Otherwise, I’ll step on your feet...”<br/><br/>Daisy Zane quickly covered her mouth: “Let’s go.”<br/><br/>“I know.”<br/><br/>Daisy Zane and Olivia Lane returned to their dormitory through the side door.<br/><br/>By the time they got back, it was almost four o’clock, and everyone in the dormitory was still sleeping.<br/><br/>The two of them took off their coats, quietly climbed into bed. Shortly after, their breathing became steady as they fell asleep.<br/><br/>Around five-thirty in the morning, the sky outside was grey. Daisy Zane lay in bed, hearing the noise of hand washing at the area dedicated for grooming. At first, it sounded like just one or two people were washing their hands.<br/><br/>Gradually, more and more people seemed to be coming.<br/><br/>Daisy Zane closed her eyes, her sleep was extremely light, silently listening ton these sounds.<br/><br/>Gradually, the sound of the flowing water seemed to be magnified. The sound of the water flowing from the faucet gradually became louder and louder, like the sound of waves being swept up by the wind.<br/><br/>Daisy Zane slowly fell into a dream.<br/><br/>She found herself in the middle of a vast prairie, surrounded by thick smoke, but upon closer inspection, it seemed like she was engulfed in the fog.<br/><br/>She stood there, unable to distinguish the direction, unable to determine her position.<br/><br/>The thick smoke seemed to isolate something from her, preventing her from seeing the truth behind the smoke.<br/><br/>She picked a direction at random and walked slowly. But as she walked, the ground cracked open, and she suddenly found herself standing on a cliff.<br/><br/>Below was the sound of roaring seawater, and on the cliff ridge, after she glanced at the sea, the atmosphere suddenly became filled with gunpowder, swordfish infestation, and chaos.<br/><br/>Destroyed vehicles, people falling on the ground with unrecognizable faces, various weapons.<br/><br/>She looked at everything before her; her heartbeat gradually quickened, and it became increasingly difficult to breathe.<br/><br/>Suddenly there was a roar, and a motorcycle sprang out in front of her, hitting her.<br/><br/>She couldn’t dodge it in time and was knocked off the cliff by the motorcycle, falling into the sea.<br/><br/>The moment she was falling, she heard someone shouting from the shore: “Sister<br/><br/>Then she plunged into the sea, her body soaked by seawater, her ears filled with water, and she inhaled water through her nostrils...<br/><br/>Her breathing became more and more difficult, and the air in her lungs was gradually sucked out...<br/><br/>Just when she felt she was about to suffocate, a harsh ringing sound suddenly exploded beside her ear....\t\t\t\t\t\t</div>", "images": {}, "success": true}