{"id": 299, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391045.html", "title": "Chapter 299 - 275", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 299 - 275</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 299: Chapter 275 <br/><br/>Translator: 549690339 <br/><br/>Because they were entangled for a while, Daisy Zane and the business car ahead had pulled a long distance apart. <br/><br/>After reaching the suburbs, there was no more surveillance, and Holt Lawrence couldn’t see anything. Daisy Zane could only follow Daisy’s position. <br/><br/>And they had driven along a very uneven road. <br/><br/>The ground clearance of the car she drove was too low, and the bottom was scraping along that section of the road. <br/><br/>It wasn’t until almost ten minutes later that she drove the car to a desolate area, where she finally saw the business car. <br/><br/>This place was overgrown with weeds and desolate. <br/><br/>Holt Lawrence looked at their moving position, checked the map and said, “There is an abandoned factory one kilometer ahead, they might have set people up in there.” <br/><br/>This meant to tell Daisy Zane that it would be best to stop the car before reaching the factory. <br/><br/>So Daisy Zane caught up with the car, hit it three times, and forced it to stop. <br/><br/>When the business car stopped, Daisy immediately looked outside. Before she was taken in the car, her cell phone had been thrown into a roadside sewer. <br/><br/>She had not seen who she had called for help at all. <br/><br/>So when she saw Daisy Zane getting out of that broken-down Bugatti, Daisy felt that the scene in front of her had lost its color. <br/><br/>It was even worse than her being kidnapped just now. <br/><br/>When the people in the car saw a girl in a school uniform getting out, they all laughed. <br/><br/>They even completely forgot that they had just left a car to intercept someone and failed to do so. <br/><br/>Daisy glared at them and then struggled with her tied hands, but they didn’t budge. <br/><br/>Angry, she kicked the nearby seat. <br/><br/>The leading man opened the car door, and all five men got out. <br/><br/>Daisy hesitated for a moment and followed them out. <br/><br/>The men didn’t take Daisy Zane seriously, so they didn’t refuse to let Daisy get out and let her follow. <br/><br/>Daisy Zane walked past a few men, and her gaze fell directly on Daisy. <br/><br/>After checking her for a moment and seeing that she had no injuries, she relaxed a little. <br/><br/>When Daisy saw her, her eyes turned red with urgency, and she yelled, “Why did you come!” <br/><br/>Hearing her speak, Daisy Zane’s stern expression softened, and she raised an eyebrow, “Miss, you called me.” <br/><br/>“You...” Daisy stomped her foot and didn’t want to talk anymore. <br/><br/>“What are you doing?” Olivia Lane asked as she looked at her. <br/><br/>Daisy Zane got in the car, rummaged through it, and found a gun. She checked the magazine, which was full, and handed it to Olivia Lane: “You know how to use it, right?” <br/><br/>Olivia Lane touched the gun and nodded. <br/><br/>“Take it for self-defense.” <br/><br/>“What about you?” <br/><br/>Daisy Zane shook the knife in her hand: “This is a suburban area, and they have many people. Close combat is their first choice. They won’t use guns unless it’s absolutely necessary. It makes too much noise.” <br/><br/>As she spoke, the sound of vehicles stopping nearby could be heard, one after another. <br/><br/>Then came the sound of car doors opening, people getting out, and doors closing. <br/><br/>Daisy Zane glanced outside and rubbed Olivia Lane’s head, saying, “Don’t be afraid. Your Third Uncle, Brother Enamel, as well as your family, should all be on their way.” <br/><br/>Fearing that Daisy Zane would leave the car, Olivia Lane grabbed her wrist: “How long till they arrive?” <br/><br/>Before getting out of the car, Daisy Zane checked the location of Kevin Clark and thought about it, saying, “Within 5 minutes.” <br/><br/>“That long?” <br/><br/>“Henry Clark and the others have timed the distance well. This place is far away from the Lane and Clark Families and even from the police station. They are already very fast.” Daisy Zane patted her hand, “Don’t worry, stay here. Lock the car door.” <br/><br/>Listening to her, Olivia Lane held Daisy Zane’s hand, squeezing hard, “I’ll follow you.” <br/><br/>Daisy Zane looked at her and suddenly noticed her panic. This panic seemed not to come from fear of the people outside the car but from a deep, hidden wound. <br/><br/>Olivia Lane also felt her reaction was excessive, she licked her lips and said, “I, I don’t think it’s safe in the car. While you are fighting with them, they may try to pry the door open from the other side.” <br/><br/>Daisy Zane raised an eyebrow; there was indeed a possibility, so she said, “Follow behind me.” <br/><br/>“Okay.” Olivia Lane nodded. <br/><br/>There were many people outside, and their position was directly surrounded. <br/><br/>They were cautious and careful as they approached their location. <br/><br/>The two got out of the car, and everyone immediately stopped and stared at them. Their expressions were extremely serious, but when they saw there were only two young girls, their tension instantly dissipated. <br/><br/>How could these two girls, however capable, pummel so many of them to the ground? <br/><br/>Daisy Zane wore loose white half-sleeves, with her school uniform pants on the bottom and a high ponytail. Her clear, tender skin looked very refreshing. <br/><br/>However, her aura made her a one-woman army. <br/><br/>Those upturned phoenix eyes were like a cold, snowy winter, chilling to the bone. <br/><br/>She lowered her eyes to weigh the knife in her hand, then looked up at the people in front. In the depths of her eyes, besides the cold, murderous intent, there was excitement. <br/><br/>She really hadn’t seen so many people to fight in a long time.\t\t\t\t\t\t</div>", "images": {}, "success": true}