{"id": 298, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391041.html", "title": "Chapter 298 - 274: I Admit Defeat", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 298 - 274: I Admit Defeat</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 298: Chapter 274: I Admit Defeat <br/><br/>Translator: 549690339 <br/><br/>“Enamel, Olivia Lane has been taken away by Henry Clark again.” After receiving the phone call from Daisy Zane, Arthur North grabbed his car keys and walked outside while calling Hugo Clark. <br/><br/>As soon as his words were finished, he heard the sound of something being smashed on the ground from the cell phone. <br/><br/>After leaving the office, Arthur North glanced at Michael Jackson and Juan Wright outside. <br/><br/>The two immediately understood, and they followed him as soon as they put down their work. <br/><br/>Arthur North asked Hugo: “Does she have any other positioning devices besides her cell phone?” <br/><br/>Relying solely on traffic surveillance, it’s easy to lose track of a vehicle. So, Arthur North asked this question. <br/><br/>“Yes.” <br/><br/>Olivia Lane had been wearing a necklace with a longevity lock since the last time she was taken away by Henry Clark. Hugo had secretly installed a positioning device in the longevity lock when she was asleep. <br/><br/>However, he never checked her location. <br/><br/>After installing the device, it could help to prevent her from encountering any danger. <br/><br/>“Notify the Lanes,” Arthur North said, “I’ll have Michael Jackson and Juan Wright send a team as well.” <br/><br/>“Okay.” <br/><br/>After hanging up the phone, Arthur North had exited the elevator and arrived at the parking lot. He quickly walked to his parking space while saying, “Both of you, take your teams to meet up with Hugo and ask for the positioning info.” <br/><br/>Michael Jackson and Juan Wright: “Yes.” <br/><br/>After responding, the two quickly left. <br/><br/>Arthur North immediately got in his car and, after fastening his seatbelt, started location sharing with Daisy Zane. <br/><br/>Daisy Zane quickly accepted on her end, Arthur North looked at her moving speed and frowned, right away driving out of the parking lot. <br/><br/>On Daisy Zane’s end, she was constantly on the phone with Holt Lawrence, who guided her through traffic surveillance and planned the shortest, fastest route for her. <br/><br/>“Nana, turn left at the traffic light intersection ahead and enter the side road. There’s a traffic jam on the road ahead,” Holt Lawrence said. <br/><br/>Daisy Zane looked ahead, her expression cold and her eyes frosty. She gripped the steering wheel with one hand, while her other hand remained on the gearshift. <br/><br/>When she reached the traffic light intersection, she gently turned the steering wheel and instantly entered the side road. <br/><br/>“Nana, two more suspicious vehicles have appeared. They just came from the direction of the school and are driving fast. It looks like they’re chasing the business car ahead of you,” Holt said as he stared at more than a dozen screens in front of him, keeping watch on the vehicles and traffic surveillance while tracking Daisy Zane’s location and operating several computers. <br/><br/>It should be the Lanes who were stationed near the school who got the news: “It should be the Lanes.” <br/><br/>However, without wasting even a second, she switched gears again and stepped on the accelerator, crashing directly into the rear of the business car. <br/><br/>The impact was powerful, causing Daisy Zane’s body to lurch forward due to inertia, but she quickly leaned back into her seat. <br/><br/>The business car was hit and spun 90 degrees. <br/><br/>Daisy Zane didn’t want to get entangled with them, so she reversed her car again, intending to continue chasing Olivia Lane. <br/><br/>But the business car once again blocked her path, seemingly intent on hitting her again. <br/><br/>Daisy Zane’s eyes seemed bloodthirsty, her lips pressed together and her cold gaze piercing. Raising her eyebrows slightly, she shifted gears and reversed. <br/><br/>Perceiving her intentions, Holt Lawrence quickly spoke up, “Nana! The Lanes are right behind you, they’ll be here soon. You don’t need to take the risk.” <br/><br/>However, the business car straightened up, its front facing Daisy Zane, as if prepared for a head-on collision. <br/><br/>Daisy Zane didn’t listen to what Holt Lawrence said, gripping the steering wheel and stepping on the accelerator. <br/><br/>The Bugatti roared, shooting out like the wind. <br/><br/>The opposing business car also started moving, its speed very fast as well. <br/><br/>The two cars seemed to be on a collision course for mutual destruction, but the business car was playing psychological warfare, betting that Daisy Zane would slow down and dodge at the last moment. <br/><br/>Just as the two cars were about to collide at breakneck speed, Daisy Zane did indeed turn the steering wheel, switching gears at the same time. <br/><br/>The business car thought they had judged correctly, but as Daisy Zane dodged, they tried to ram into her again. <br/><br/>However, the Bugatti spun on the spot as it dodged, its tires screeching against the ground and raising a cloud of smoke. <br/><br/>The business car turned its steering wheel but failed to hit the Bugatti at all. <br/><br/>Instead, it was the Bugatti that swung its rear and forcefully struck the business car with its body. <br/><br/>The sound of the ground being scraped, the cars roaring, and the massive impact seemed to tear a hole in the air, assaulting people’s eardrums... <br/><br/>Due to the high speed and the change of direction, the Bugatti’s swing added force to the business car’s movement, causing it to roll over on its side. <br/><br/>Daisy Zane’s judgment was precise, without even a second or a millimeter of error. She had the skill and the confidence to do it. <br/><br/>Holt Lawrence had been holding his breath from the moment he saw her car speed up, watching through the surveillance video. It wasn’t until he saw that she was unharmed, her car still drivable, and that she had flipped over the business car and chased after the one in front that he finally exhaled heavily. <br/><br/>His heart raced uncontrollably, and even his hands were shaking. <br/><br/>It took him a while before he said, “Nana, I’m truly impressed by you.” <br/><br/>Throughout the entire process, Daisy Zane’s expression hadn’t changed, and she didn’t even blink once. <br/><br/>Having flipped the other car, she simply continued chasing the one in front...\t\t\t\t\t\t</div>", "images": {}, "success": true}