{"id": 294, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391025.html", "title": "Chapter 294: 270: Sketch_2", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 294: 270: Sketch_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 294: 270: Sketch_2<br/><br/>Translator: 549690339<br/><br/>Edward Kirsten had helped her explore many hobbies, and painting was one of them. He hired a teacher specifically for her. Sketching, drawing, watercolor... She had systematically learned them all.<br/><br/>She didn’t know if it was because she had a foundation before, but she learned many things very quickly.<br/><br/>So when she later taught herself fashion design, because she had the basic skills of painting, she learned it more easily. As for jewelry design... it could only be considered part of the package.<br/><br/>When George Dunn heard her talking with Daisy Zane, especially when Daisy said “a little,” the corner of his mouth couldn’t help but twitch.<br/><br/>The chief designer of Cloud Clothing and Rainbow Skirts should have a solid foundation in painting, right?<br/><br/>“When I was young, I also learned a little,” George Dunn said, “but after half a year, my teacher returned my tuition fee to my mom, even refunding an extra 500 dollars and told me to go home.”<br/><br/>George Dunn was born and raised in Imperial Capital, and has a good background. He must have learned a lot of things from childhood and developed in many ways.<br/><br/>Daisy listened to his words and glanced at him:<br/><br/>On the other hand, Serena Buster openly laughed.<br/><br/>George Dunn: He was a best actor anyway and considered a giant in the entertainment industry. This damn Miss, she laughed so obviously.<br/><br/>Did she want to continue mixing?<br/><br/>Daisy ignored their grudges and looked at the imitation material beside her after sharpening the pencil tip.<br/><br/>After a few seconds, she placed the material aside and started drawing the outline on the sketch paper.<br/><br/>More than an hour later, the teacher came to see their work, and even with her psychological preparation, she was shocked by their drawings.<br/><br/>One boy’s drawing had a braised egg-like head...<br/><br/>She admired him for a moment for making it so round.<br/><br/>There was also a drawing of a person that looked like a mantis. She thought that it wasn’t a hand but a five-pronged fork for demon-slaying.<br/><br/>Another had a completely blackened head and four round holes left on the face. From the position, it seemed like the eyes, nose, and mouth.<br/><br/>In any case, for her, a teacher with nearly ten years of teaching experience, this was a large-scale car accident scene.<br/><br/>Fortunately, these were not her students; otherwise, she would have a cerebral hemorrhage looking at their drawings.Rêạd new chapters at novelhall.com<br/><br/>However, the front row was better off.<br/><br/>Serena Buster had seen Harton Clark on the film set before. She looked at the painting, then looked at Daisy, and then put on a face of confirmed speculation.<br/><br/>As expected, the two of you are together. She didn’t ship the wrong CP.<br/><br/>However... is this what she calls having studied a little? Is this a bit of a bully?<br/><br/>When Turner Daniel looked, he hesitated for a moment. It was him... the man he had seen at the Pharmaceutical Formulation Institute entrance. Drawing him, did she... like him? Or did she see him as an idol?<br/><br/>What do they have in common?<br/><br/>He had heard from his grandfather that the man was outstanding...<br/><br/>As Turner Daniel stared at the painting and pondered, Celeste Martin’s eyes trembled when she looked.<br/><br/>Not only was it because Daisy’s sketch was so good, but also because of the man in the painting.<br/><br/>The man who made her fall for him after just one glance.<br/><br/>Was it really this man who called her in the evening?<br/><br/>That was the Clark Family of Imperial Capital. Even she felt that it was a wild idea for her to be with Harton Clark. She was just a wild girl from Cold Green Village – what right did she have? How could she dare?<br/><br/>Daisy didn’t directly answer the teacher’s question, instead, she said, “Just a random drawing.”<br/><br/>The teacher heard her answer, looked at her, and then smiled.<br/><br/>It should be someone who really exists, right? After all, with Daisy’s looks, only a man like the one in the painting would be a match for her.<br/><br/>Just as the teacher was about to say something else, the front door was gently knocked twice.<br/><br/>All the students looked over.<br/><br/>The director in charge of the Special Talent Class was standing at the entrance, greeting the teacher before saying, “Everyone, pack up your things and go to the Ceremony Hall.”<br/><br/>Daisy watched from behind when the class was ordered. As soon as the director finished speaking, all the students seemed to stretch their necks and listen attentively.<br/><br/>The director continued, “Thanks to the program team, they invited the founder of Spotlight, Felix Baker, to give a lecture on jewelry design.”<br/><br/>Daisy:<br/><br/>“Wow!!!” The classroom suddenly erupted. There were not only screams, but also stomping, clapping, and even the sound of books hitting the ground.<br/><br/>The director clapped his hands to calm them down: “Quiet down. If you want to pursue design, listen carefully. This is a very rare opportunity. Hurry up and orderly head to the Ceremony Hall. Don’t let our guests wait.”\t\t\t\t\t\t</div>", "images": {}, "success": true}