{"id": 293, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391021.html", "title": "Chapter 293: 270: Sketch", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 293: 270: Sketch</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 293: 270: Sketch<br/><br/>Translator: 549690339<br/><br/>Wednesday, the day in the five-day school week that marks the transition from more to fewer days left. Once this day is over, the time to rest gets closer and closer.<br/><br/>Daisy Zane’s Wednesday also underwent a change.<br/><br/>They no longer attended class in their usual classroom.<br/><br/>After having breakfast, they were taken to the Art Building to experience the life of specialized students.<br/><br/>The specialized students started preparing for the annual Art Examination after entering Senior Three, so they hardly took any liberal arts courses anymore.<br/><br/>Today’s schedule was for them to spend the morning with art students and the afternoon with music talent students.<br/><br/>Tomorrow, they would have dance and sports.<br/><br/>The group of eight didn’t separate, instead, they all entered a single classroom.<br/><br/>Obviously, there were differences in clothing and style between the art students and those who only studied liberal arts.<br/><br/>Although they all wore school uniforms, the art students had a distinctive artistic temperament.<br/><br/>Moreover, a striking feature of art specialty students was the presence of watercolor on their clothes.<br/><br/>When the group of eight entered the classroom, the teacher gave a brief introduction and then let them sit by the previously arranged easels.<br/><br/>As for the other students in the classroom, they only paused, listening to the teacher’s introduction, clapped in welcome, and then picked up their pens and continued drawing.<br/><br/>The teacher, with her long wavy black hair and a modified cheongsam-style skirt, had an ordinary appearance; she was neither pretty nor dazzlingly beautiful.<br/><br/>But the warm, intellectual, and rich temperament that radiated from within her was very attractive.<br/><br/>“You’re already doing well.” The teacher continued, and then looked at Turner Daniel next to Celeste Martin.<br/><br/>Turner Daniel’s drafting was very professional, and the teacher raised her eyebrows in surprise, “Have you learned this before?”<br/><br/>“Yes,” Turner Daniel said, ” My grandmother is a professor at the Art College.”<br/><br/>Everyone:<br/><br/>Teacher: “So you’ve been influenced since you were young.”<br/><br/>“I guess so,” Turner Daniel said.<br/><br/>The teacher looked at the drawings of the others and saw that they hadn’t started yet, so she said, “Today’s task is to imitate the material next to you. You have a time limit of three hours.<br/><br/>“Three hours?” one of the boys asked.<br/><br/>“Yes, the Art Examination is three hours long.” The teacher glanced at the watch on her wrist, “It’s 8:11 now, and the time starts now. Considering some of you haven’t learned this before, you can be creative. Art has no specific definition, but you can use the pen in your hand to give your work its definition.<br/><br/>The teacher paused for a moment before continuing, “However... this is imitation. Don’t go too far with your imagination. Okay, start drawing.”<br/><br/>When the teacher left, Serena Buster moved her easel and stool closer to Daisy Zane, “Daisy, have you learned this before?”<br/><br/>“I’ve learned a little,” Daisy Zane said as she slowly sharpened her pencil with a knife..\t\t\t\t\t\t</div>", "images": {}, "success": true}