{"id": 295, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391029.html", "title": "Chapter 295: 271: Cut From The Same Mold", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 295: 271: Cut From The Same Mold</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 295: 271: Cut from the Same Mold<br/><br/>Translator: 549690339<br/><br/>The Art Specialty Class has six classes and over 200 students.<br/><br/>They all lined up outside the classroom and headed towards the Ceremony Hall.<br/><br/>Daisy Zane took her half-finished painting off the easel and handed it to the shooting director after she went out, asking him to help keep it safe. Director Nash came over, with something to discuss with her and George<br/><br/>Dunn.<br/><br/>“That Brook God and George, help me out by looking after Felix Baker a bit later,” said Director Nash.<br/><br/>Daisy Zane, who wanted to blend in with the students and avoid Felix Baker, said:<br/><br/>Director Nash continued: “Felix has been very busy lately; it took our program team a whole month to grind out this bit of time.”<br/><br/>Daisy Zane’s eyebrows moved slightly, indeed busy, busy buying jadeite in D Continent.<br/><br/>Director Nash knew that the Dunn family had business dealings with the<br/><br/>Spotlight group, and George Dunn and Felix Baker were somewhat acquainted. As for Daisy Zane, he heard from people in the Program Team that Felix seemed to have a good impression of Daisy Zane during last year’s Spotlight Gala, even inviting her for a private chat.<br/><br/>Felix Baker was a well-known egoist.<br/><br/>He might look gentle, but in reality, he was quite difficult to deal with. As long as his interests were not harmed, everything was negotiable. But if he suffered just a little loss, he wouldn’t let it go.<br/><br/>It could be said that burning incense was offered in gratitude when the program team managed to invite him this time, setting aside the matter of money.<br/><br/>They were afraid of not treating him well and provoking him. They felt Felix might just leave midway if things didn’t go well.<br/><br/>So the program team thought about asking two people, who were more familiar with him, to entertain him a bit.<br/><br/>Such a connection would facilitate easier interaction on both sides.<br/><br/>“Brook God, George, do you mind helping out?” Director Nash asked.<br/><br/>George Dunn cleared his throat and said, “I... am not that close to him, actually.”<br/><br/>Although the Dunn family had business dealings with Spotlight, George hadn’t been directly involved. At most, he had a relationship with Felix where they would greet each other when they met.<br/><br/>“No worries, just have a casual chat,” said Director Nash.<br/><br/>“Alright then,” George Dunn agreed.<br/><br/>Director Nash then looked at Daisy Zane.<br/><br/>Daisy Zane’s lips quivered, wanting to refuse. But seeing Director Nash’s pitiful and attentive expression, she eventually didn’t say anything and agreed to it.<br/><br/>Felix Baker looked at them, and was just about to greet them politely, when he suddenly caught a glimpse of a familiar figure out of the corner of his eye.<br/><br/>The smile on his face stiffened for a moment as he turned to look.<br/><br/>Then he saw Daisy Zane, dressed neatly in a school uniform and a high ponytail.<br/><br/>As Daisy Zane looked over, her expression remained indifferent, with no change at all. Even a touch of annoyance appeared at the bottom of her eyes.<br/><br/>However, Felix Baker stared at her for two seconds before moving his eyes away, thinking to himself how much she resembled Clayson Ninevara, as if they were carved from the same mold.<br/><br/>As the thought flashed through his mind, he was taken aback for a moment before turning to look at Daisy Zane again.<br/><br/>To see her behind George Dunn, Felix Baker took a step back on purpose.<br/><br/>Daisy Zane: .<br/><br/>Felix Baker stared at her for two more seconds and said: “You...<br/><br/>Thinking that he couldn’t remember Daisy Zane, Director Nash stepped between them and said: “Mr. Baker, this is Daisy Zane, a screenwriter for Flynn Ninevara. You met her at the Spotlight Gala.”<br/><br/>As he finished the introduction, Felix Baker’s amiable face almost contorted.<br/><br/>Opening his mouth, he took a deep breath and said: “It’s really you!”<br/><br/>Standing aside, Celeste Martin’s smile had disappeared by more than half as she watched Felix Baker and Daisy Zane. Her hands slowly clenched together at her sides.<br/><br/>Daisy Zane did not want to deal with him.<br/><br/>“How are you here?” Felix Baker said.<br/><br/>Seeing his reaction, Director Nash was taken aback. It seemed as if he was about to lose his temper. He exchanged glances with some school leaders, and then said as a mediator: “Mr. Baker, Daisy Zane is also participating in the recording of our program.”<br/><br/>Felix Baker glanced at Director Nash, then looked at Daisy Zane, and said with a stiff tone: “You came here to record a show.” “Am I not allowed to?” Daisy Zane countered.<br/><br/>Her voice was somewhat cold.<br/><br/>Felix Baker’s arrogance immediately dropped by half: “...Of course, you are allowed.”<br/><br/>The audience: “???” What’s going on here?<br/><br/>Felix Baker was still a little confused, mainly because it was confusing to see Daisy Zane in her school uniform. He didn’t know how to describe his feelings at the moment. He didn’t even know how to describe Daisy Zane now.<br/><br/>He even felt a little dizzy.<br/><br/>He still didn’t understand how Harton Clark agreed to let her come and record the show. Not hiding her at home was one thing, but letting her out, were they crazy?<br/><br/>Felix Baker stared blankly at Daisy Zane for a while, then turned to Director Nash and said: “No, she’s here to record a show. You have a ready-made person right here. You’ve been grinding me for more than a month to get me here for a lecture.”<br/><br/>Director Nash blinked, paused for a moment, and didn’t understand: “Wha, what do you mean?” for new novels\t\t\t\t\t\t</div>", "images": {}, "success": true}