{"id": 291, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391013.html", "title": "Chapter 291: 268: Should I Call You Sister-In-Law?", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 291: 268: Should I Call You Sister-In-Law?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 291: 268: Should I call you Sister-in-law?<br/><br/>Translator: 549690339<br/><br/>Daisy Zane stayed in the office for half a class period, and when she came out, she went straight to the rooftop.<br/><br/>As she pushed open the door to the rooftop, she dialed Holt Lawrence’s number.<br/><br/>She heard the sound of the phone connecting, and also saw Olivia Lane looking down from the rooftop.<br/><br/>Olivia Lane turned around when she heard the door opening.Finnd new chapters at novelhall.com<br/><br/>Daisy Zane looked at her, her eyebrows raised slightly, and closed the door behind her.<br/><br/>Just as she was about to speak, Holt Lawrence picked up the call and began to speak excitedly: “Nana, did you come to Celestial Pivot? Are you at the ground floor? I’ll come and fetch you.”<br/><br/>Daisy Zane walked up to Olivia Lane while listening to Holt Lawrence speak. As if she hadn’t heard him, in a calm voice she said, “Help me investigate a person.”<br/><br/>Holt Lawrence: .<br/><br/>“William Butch, 15 years old, a student of Gathering Joy Private Class 36.” Daisy Zane continued, “I want all the information. Family, experience, including his interpersonal relationships at school. Also, the people he often comes into contact with, their impressions of him, and their evaluation.”<br/><br/>Olivia Lane looked at her, her gaze deepened.<br/><br/>“Who is this person? He’s only fifteen, is it related to us?” Holt Lawrence asked.<br/><br/>“I’m doing someone a favor.” Daisy Zane looked at Olivia Lane and gave her an amused smirk.<br/><br/>Holt Lawrence: “...Aren’t you tired? You’re so busy with your own matters, yet you’re still helping others.”<br/><br/>“I’ve been rather free recently.” Daisy Zane replied, “Just right to find something to do. To kill some time.”<br/><br/>“If you are free, come and help me out at Celestial Pivot for a couple of days.” chuckled: “Get it done for me as soon as possible.”<br/><br/>“Understood.” Holt Lawrence replied, “Your problem is urgent; I’ll have to release the info tonight.”<br/><br/>“Hold on to the intel, I don’t have a computer on hand.”<br/><br/>“Okay.”<br/><br/>After hanging up the phone, Daisy Zane looked at Olivia Lane and asked, “What are you doing here?”<br/><br/>“Why are you here?” Olivia Lane countered.<br/><br/>“Making a phone call.”<br/><br/>“Can’t you find a secluded area to make your call secretly?”<br/><br/>“I thought there would be no one here.” Daisy Zane replied with a smile.<br/><br/>“But you were talking in front of me.”<br/><br/>However, Daisy was wary of Jessica Maxwell. She had the feeling that the girl had a grudge against her.<br/><br/>No matter what Daisy did, Jessica seemed to take an instant dislike.<br/><br/>“Do you know why Jessica dislikes you?” Amelie asked.<br/><br/>“Why?” Daisy asked, looking at her.<br/><br/>“Apart from the possibility that she might be trolling you online, there’s another reason,” Amelie answered. “She’s the cousin of Bonnie Maxwell. Do you know who Bonnie Maxwell is?”<br/><br/>Daisy:<br/><br/>Daisy typically kept her emotions to herself, so Amelie didn’t know if she recognized the name or not.<br/><br/>“She is the young lady of the Maxwell family. You know them, right? They are close with the Clark family.”<br/><br/>Daisy noticed Amelie’s excitement, her face lighting up with curiosity. The little girl...<br/><br/>Amelie bent down and whispered into her ear, “Bonnie is always visiting the Clark family. Even I’ve heard about it. A lot of people in Imperial Capital claim that Bonnie is the future Mrs. Kevin Clark.”<br/><br/>Seeing a mischievous glint in Amelie’s eyes, Daisy chuckled and said, “What are you trying to say?”<br/><br/>Amelie smiled roguishly: “From what I hear, Kevin favor a variety of partners. There are a lot of women by his side.”<br/><br/>“And then?”<br/><br/>“Perhaps you should consider our Lane family,” suggested Amelie, her smile widening. “My brother is very handsome, extremely gentle and he leads a very clean private life. Besides, when it comes to status, our family can hold its own against the Clark family.”<br/><br/>“Ah, so you want me to be your sister-in-law.”<br/><br/>Amelie scratched her cheeklist, turned her gaze away as though uninterested, and nonchalantly said, “I just think you’re a good person.”<br/><br/>“Oh,” Daisy pulled out her cell phone and randomly tapped on it a couple of times. Putting it to her ear, she said, “I’ll ask Kevin if he’s cool with it.”<br/><br/>‘I !!!” Amelie’s eyes grew wide with shock. After a moment of stunned silence, she immediately tried to snatch the phone out of Daisy’s hands, “I was just kidding! You can’t go tattling like that! Don’t tell him, don’t tell him!”<br/><br/>As Amelie lunged to grab the cell phone, Daisy easily held it out of her reach with one hand, while wrapping the other arm around Amelie’s neck. Daisy pocketed her phone — which hadn’t dialed any number — inside her uniform, and then pinched Amelie’s cheeks while saying, “Little girl, when your Third Uncle gets mad, everyone within a hundred miles will suffer. So behave, and don’t speak ill of me.”<br/><br/>“Let go of me first.’<br/><br/>“Promise me you won’t go blabbering nonsense first.” Daisy pinched her cheek again.<br/><br/>Amelie, her waist bent from Daisy’s hold, grasped at Daisy’s clothes. She reluctantly said, “I won’t say it anymore.”<br/><br/>Daisy gave a soft laugh and let go.<br/><br/>The moment she was released, Amelie, like a kitten, lifted her hands and began to slap harmlessly at Daisy, “Ah, how dare you bully me, how dare you bully me.”<br/><br/>Amelie’s playful hits couldn’t even be classified as tickling, so Daisy just sat there, laughing as Amelie vented her frustration.\t\t\t\t\t\t</div>", "images": {}, "success": true}