{"id": 296, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391033.html", "title": "Chapter 296: 272: Madam…", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 296: 272: Madam…</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 296: 272: Madam...<br/><br/>Translator: 549690339<br/><br/>The students entering the Ceremony Hall are being arranged to find their seats by the teacher.<br/><br/>At the entrance, a group of people are stunned by Felix Baker’s words.<br/><br/>Everyone is a little confused about the meaning of Felix Baker’s sentence.<br/><br/>George Dunn hesitated for a moment, then turned his head to look at Daisy Zane. Was this person related to Spotlight too?<br/><br/>Flynn Ninevara... and Clayson Ninevara...<br/><br/>Thinking about it, George Dunn shook his head, shaking off his thoughts. It couldn’t be, it couldn’t be. This was the chief designer of Cloud Clothing and Rainbow Skirts, how could they be related to Spotlight?<br/><br/>Impossible, impossible.<br/><br/>Celeste Martin, seeing everyone’s attention being taken away by Daisy Zane, felt sick in her heart.<br/><br/>Felix Baker saw the puzzled looks on their faces, looked at the director, then at Daisy Zane, and realized, “Ah, no, no meaning.”<br/><br/>Director Nash’s stiff face twitched slightly, then let out a dry laugh, “Hahaha, Mr. Baker, let me introduce you to these people who are participating in the recording.”<br/><br/>“Sure.” Felix Baker glanced at Daisy Zane again, smiling as he agreed.<br/><br/>Director Nash introduced the participants one by one, and Felix Baker shook hands with each of them. Afterwards, he chatted with George Dunn, “Didn’t expect Best Actor Dunn to be here.”<br/><br/>George Dunn smiled and glanced at Daisy Zane, “No choice, haven’t had any movies to shoot recently.”<br/><br/>Daisy Zane:<br/><br/>“I understand. I have the same feeling when my Clayson doesn’t submit his manuscript,” said Felix Baker, smiling amicably.<br/><br/>Upon hearing his words, Daisy Zane rubbed her fingertips.<br/><br/>“But recently, her manuscript has been handed in promptly. She prioritized Spotlight amidst her busy schedule, which makes me feel relieved. She’s really thoughtful,” Felix Baker continued, “You know our Concept Release Conference just ended, and we’ve been very busy.”<br/><br/>George Dunn wore a polite smile, but his inner thoughts were, this tone... why is it so smug?<br/><br/>Seeing this, Director Nash was about to praise Clayson Ninevara, but before the words reached his lips, Daisy Zane said, “The students are all seated, it’s time to begin.”<br/><br/>Everyone looked at Daisy Zane.<br/><br/>Daisy Zane didn’t look at anyone else but only stared at Felix Baker, saying calmly, “Mr. Baker, please come this way.”<br/><br/>Felix Baker was called ‘Mr. Baker’, his heart thumping, almost jumping out of his chest.<br/><br/>“Yes, yes, Mr. Baker, please come this way,” Director Nash said.<br/><br/>“Oh, alright,” Felix Baker glanced at Daisy Zane again, saying, “Let’s all go together, shall we?”<br/><br/>Having said that, just when he was about to move, Daisy Zane took a step ahead of him.<br/><br/>Felix Baker then saw Daisy Zane walk to his side, not even looking at him, and stepped on his foot.<br/><br/>“Hiss–” Felix Baker gasped in pain.<br/><br/>Daisy Zane did not move her foot away even after hearing his gasp, and deliberately used more force. It was obviously intentional.<br/><br/>Felix Baker bent over in pain.<br/><br/>Director Nash was in complete shock, sweating profusely, “Mr. Baker, Mr. Baker, are you okay? Daisy didn’t mean it.”<br/><br/>After sending the message, he sent over the receipt for customizing the shoes.<br/><br/>Brightly demanding compensation.<br/><br/>However, five minutes later, Kevin Clark replied: [Good stepping.]<br/><br/>Felix looked at the message: “......” The word “wife” was spoken in vain.<br/><br/>But after a while, Kevin Clark sent another message: [I have a piece of ruby in my hand. I’ll have it sent to Spotlight.]<br/><br/>Felix’s mood instantly smoothed, and sure enough, those two words pleased Kevin Clark.<br/><br/>Two “Mrs. Clark” for a piece of ruby; he felt like he had found the road to wealth.<br/><br/>In the classroom, Olivia Lane looked at the empty seats around her, both nearby and in front.<br/><br/>Daisy Zane had only been there for two days, and they hadn’t talked much during class.<br/><br/>However, when she suddenly left, Olivia felt that something was missing, and she became increasingly bored.<br/><br/>The Class Representative was handing out test papers again, and within the span of two classes, Daisy’s desk was cluttered.<br/><br/>Olivia Lane looked for a while, then rearranged the papers on Daisy’s desk.<br/><br/>A stack of papers, Olivia didn’t grab them properly, and the one at the bottom fell out.<br/><br/>It was a language test written by Daisy during last night’s evening self-study.<br/><br/>Almost every question on the entire paper was answered, only the final composition was not written.<br/><br/>Especially the poetry appreciation and reading comprehension sections at the back, they were filled with words.<br/><br/>Olivia Lane looked at the handwriting for a while, feeling more and more familiar.<br/><br/>Suddenly, her pupils trembled, and her hand holding the paper tensed, piercing through the paper.<br/><br/>Some things had been stored at home for too long, and in addition to her own problems, she couldn’t remember many things clearly.<br/><br/>She had secretly studied psychology courses, a side effect of being too stimulated.<br/><br/>Some things she would remember vaguely. In severe cases, she would even experience forgetfulness.<br/><br/>Only when she saw it again would she gradually remember.<br/><br/>So this familiar handwriting, she couldn’t be sure if it was the same as her sister’s.<br/><br/>After sitting in her seat for a while, Olivia Lane’s hand was shaking slightly. She looked at the paper again, then got up with the paper, folding it while walking out of the classroom.<br/><br/>As she left the teaching building, the bell rang for the start of class.<br/><br/>Olivia Lane, as if she hadn’t heard it, continued with a cold expression, quickening her pace toward the place where she often jumped out.<br/><br/>Upon reaching it, she effortlessly climbed the wall.<br/><br/>However, seeing the Lanes guarding the outside of the wall, she hesitated for less than a second before jumping back into school before they could see her.<br/><br/>Without stopping, she headed in the opposite direction.<br/><br/>She jumped out from the garbage pit.<br/><br/>Because she knew that her brother wouldn’t let anyone guard this place.<br/><br/>Her brother thought she was too delicate to even approach a garbage pit.\t\t\t\t\t\t</div>", "images": {}, "success": true}