{"id": 301, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391053.html", "title": "Chapter 301: 277: Old Wound", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 301: 277: Old Wound</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 301: 277: Old Wound<br/><br/>Translator: 549690339<br/><br/>Many people from both the Clark Court and the Lane Family had come.<br/><br/>Over a dozen cars protected Daisy Zane and Amelie Quentin in the middle, while more vehicles surrounded the outsiders directly.<br/><br/>Both sides started fighting quickly.<br/><br/>Arthur North didn’t bother about anything and took Daisy Zane to their car.<br/><br/>Before Daisy Zane was taken away, she pulled Amelie Quentin with her left hand.<br/><br/>In an instant, Arthur North stopped and said softly, “Don’t force it.”<br/><br/>His voice was quiet, but filled with authority.<br/><br/>Amelie Quentin immediately let go of Daisy Zane’s hand and said, “I’ll get in the car myself.”<br/><br/>After saying that, she quickly got into the car first.<br/><br/>Arthur North held Daisy Zane’s right hand, led her to the copilot side, opened the car door, let her in, and even helped her fasten her seat belt.<br/><br/>Then he walked back to the driver’s seat.<br/><br/>Daisy Zane watched his actions, pursed her lips, thinking that she wasn’t disabled.<br/><br/>Hugo Clark came over immediately as well, and before Arthur North started the car, he opened the back door and got in quickly.<br/><br/>As the car started, Hugo Clark held Amelie Quentin’s shoulder and looked her up and down, “Are you hurt anywhere?”<br/><br/>Amelie Quentin looked up at Hugo Clark, feeling for the first time a desire to depend on him. She shook her head and then looked at Daisy Zane’s arm.<br/><br/>Hugo Clark examined almost every hair on Amelie Quentin’s head and saw that she was really not hurt at all. Then he followed her gaze to Daisy Zane’s arm.<br/><br/>Daisy Zane’s hand was on her leg, and the back of her hand and both her index and middle fingers were swollen. Her forearm was also swollen, red, and swollen.<br/><br/>Her originally fair and slender arm now looked like a red steamed bun.<br/><br/>Hugo Clark frowned, glanced at Daisy Zane’s arm, and then glanced at Arthur North’s back. No wonder there was a cold air enveloping the car, making it feel chilling.<br/><br/>He glanced at Amelie Quentin again and saw her staring at Daisy Zane’s arm all the time.<br/><br/>He probably guessed the situation by now.<br/><br/>She was likely injured while protecting Amelie Quentin.<br/><br/>He touched Amelie Quentin’s head, then held her hand in his palm, comforting her.<br/><br/>All of Amelie Quentin’s thoughts were on Daisy Zane, and her senses were fading away. She didn’t even feel Hugo Clark’s hand, so she didn’t move.<br/><br/>The car quickly drove back, and when it reached the particularly difficult road section,<br/><br/>Many vehicles came head-on.<br/><br/>Arthur North stopped the car and watched the vehicles coming towards them.<br/><br/>Hugo Clark also looked ahead, his expression darkened, and said in a low voice, “Do they have reinforcements?”<br/><br/>“My bones are fine.” Daisy Zane lowered her hands, “Just need to reduce the swelling.”<br/><br/>“Listen to the doctor.” Kevin Clark looked at her with downcast eyes.<br/><br/>His voice was so cold that he sounded like an emotionless robot, and the pressure in his eyes bore down directly on Daisy Zane.<br/><br/>Daisy Zane looked up at him too, sensing that he was trying to control his temper and softening his tone, because back in the Doomsday Hotel, he had told her “No matter the reason, no harsh language or losing temper is acceptable.”<br/><br/>So he had been controlling himself.<br/><br/>The two stared at each other.<br/><br/>Hugo Clark and Olivia Lane both stepped back a bit, as pretty much only Daisy Zane could withstand the terrifying aura of their Third Uncle (Kevin Clark).<br/><br/>Even the doctor’s face changed when he saw this.<br/><br/>After staring at each other for a while, Daisy Zane finally loosened up and made an excuse: “There’s radiation.”<br/><br/>The doctor swallowed, rubbing his hands together, “You two are trying to conceive?”<br/><br/>Daisy Zane: “......”<br/><br/>“No.” Kevin Clark answered coldly, “Prescribe some medicine.”<br/><br/>“Okay, okay.”<br/><br/>As the doctor prescribed the medication, he said, “There is some radiation, so you should be cautious during intercourse during this period.”<br/><br/>Daisy Zane: “......”<br/><br/>Watching Kevin Clark and Daisy Zane, and hearing the doctor’s words, Olivia Lane’s little face gradually turned red.<br/><br/>Hugo Clark tilted his head, noticed her ears were about to turn bright red, and smiled with upturned lips.<br/><br/>In the end, Daisy Zane was still dragged by Kevin Clark to take an X-ray.<br/><br/>After taking the X-ray, the computer at the doctor’s office uploaded it, so they didn’t have to wait for the film, and the four went back to the doctor’s office again.<br/><br/>When they returned, Daisy Zane hesitated obviously at the door of the clinic before she entered.<br/><br/>She took a seat while the other three stood.<br/><br/>The doctor scrolled the mouse, examining the X-ray image on the computer. After a moment, he asked, “Is this an old injury?”<br/><br/>Daisy Zane’s right fingertips curled up, and she remained silent.<br/><br/>Hearing what the doctor said, Kevin Clark’s fingertips trembled and the stabbing pain in his heart intensified.<br/><br/>That was why she had resisted taking an X-ray.<br/><br/>“There are no problems with the bones in your arm, fingers, and back of the hand.” said the doctor, “All five finger bones have old fractures, but the surgery was very successful and delicate. It’s just that the index finger is comminuted... ”<br/><br/>“Doctor, just prescribe some medicine.” Daisy Zane interrupted him.<br/><br/>Her voice was cold, bitterly cold.<br/><br/>The doctor was taken aback by her tone, realizing that he seemed to have picked at someone’s wounds, so he immediately stopped talking: “Alright, alright, I’ll prescribe the medication.”\t\t\t\t\t\t</div>", "images": {}, "success": true}