{"id": 309, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391085.html", "title": "Chapter 309: 285: William Lane Trains His Sister From A Thousand Miles Away", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 309: 285: William Lane Trains His Sister From A Thousand Miles Away</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 309: 285: William Lane Trains His Sister from a Thousand Miles Away<br/><br/>Translator: 549690339<br/><br/>William Lane received the message in the morning and rushed back from F Continent. After getting off the airplane, he called Kevin Clark and went straight to the school.<br/><br/>As Olivia left the school and saw William’s car, she immediately slowed down, walking towards it little by little.<br/><br/>William sat in the backseat, watching her come out. He lowered the car window and looked at her moving towards him quietly.<br/><br/>Five minutes later, Olivia finally moved to the side of the car, looked inside at her brother through the window, and squeezed a smile, “Brother, why did you come back?”<br/><br/>William didn’t answer her, just saying, “Get in the car.”<br/><br/>Olivia pursed her lips, opened the car door, and got in.<br/><br/>After sitting down, she stole a glance at her brother with a turn of her eyes.<br/><br/>The driver started the car and drove towards the Lane family home.<br/><br/>William glanced at her, his light thin lips gently pursed. After a while, he said, “Olivia, what did I say last time?”<br/><br/>His tone was flat, and his voice was somewhat cold. But he didn’t yell at her angrily.<br/><br/>Olivia lowered her head and didn’t say anything.<br/><br/>“Why don’t you listen, why skip class, and why avoid the people following you?” William, wearing a white shirt, had a cool and gentle temperament. His eyes hid the usual smile, and his voice was uncharacteristically serious, “Olivia, I need an explanation.”<br/><br/>Olivia still didn’t say anything with her head down.<br/><br/>William waited for a while and said, “Speak.”<br/><br/>“Brother, I’m sorry.” Olivia said, pinching her fingers.<br/><br/>“You’re not sorry to me; you’re sorry to yourself,” William said, “You’re wasting your life. Do you want to be stuck in Senior Three when you’re twenty?”<br/><br/>Olivia didn’t say anything again.<br/><br/>“Last time Henry Clark took you away, didn’t he tell you not to lose the people following you ever again?” William’s tone became even more serious. “You take your brother’s words for granted. If it wasn’t for Arthur’s girlfriend today, do you think you could be sitting here safe and sound? Henry Clark is after your life.”<br/><br/>Olivia clenched the paper in her pocket that Daisy Zane had written on.<br/><br/>“Olivia, Arthur’s girlfriend got injured saving you; you should be grateful that it’s just a swelling,” William said. “What if her arm had been broken or disabled? Have you ever thought about how you and the Lane family will explain it to Arthur and the Clark family?”<br/><br/>The driver in front drove the car and glanced at his young master through the rearview mirror. It was the first time he had seen him speak so harshly to his sister.<br/><br/>“Arthur put his girlfriend on a pedestal, do you think she’d let you off easily if it weren’t for the Lane family’s sake?” William continued, “Olivia, your brother can cover for you if you usually cause a little trouble, but now you’ve become willful to the point of endangering your own life or others’.”<br/><br/>“I didn’t do that,” Olivia said quietly.<br/><br/>“What didn’t you do?” William asked, “Did you not skip class by climbing the wall, or did you not get someone injured because of you?”<br/><br/>After that sentence, both of them stopped talking.<br/><br/>After that, the two of them were silent for a while. After some time, William Lane said, “Daisy Zane, I’ll say this for the last time: no matter what you’re doing, have someone with you. Do you understand?”<br/><br/>Daisy Zane looked at him and nodded, “Mmhmm.”<br/><br/>“I’ll let you have your way with everything else, but you have to listen to me on this matter,” William Lane tucked her hair behind her ear, “I don’t want to hear news like today’s anymore,” he said.<br/><br/>“Mmhmm.”<br/><br/>Seeing her obediently agree, a smile appeared in William Lane’s eyes, and then he asked, “Do you really like Arthur North’s girlfriend?”<br/><br/>Upon mention of Daisy Zane, Daisy Zane suddenly looked at the street outside and said, “Brother, I’m not going home. I have to go back to school.”<br/><br/>“Huh?” William Lane thought he had heard wrong; with him at home, his sister wasn’t going back to their house, “What for?”<br/><br/>“It’s just that Daisy Zane’s hand needs medicine,” Daisy Zane said, as if she was reluctant to admit her concern. “I just wanted to see if she needs my help.”<br/><br/>William Lane raised an eyebrow. It seemed like she really liked her a lot.<br/><br/>It just made him more curious.<br/><br/>His sister believed this person to be very beautiful and cared so much for her. The person was also very capable of fighting.<br/><br/>What kind of sacred person did Kevin Clark find?<br/><br/>“Our little Daisy Zane has grown up, you’ve learned to care for others now.”<br/><br/>Daisy Zane pouted.<br/><br/>William Lane told the driver, “Turn around and go back to the school.”<br/><br/>“Alright.”<br/><br/>Once back at the school, Daisy Zane didn’t return to the classroom. Instead, she sat in the stands on the playground for a while, and only returned to the dormitory after evening self-study was over.<br/><br/>When she got back, Daisy Zane was on the balcony making a phone call. Daisy Zane sat on a chair, playing with her cell phone for a while.<br/><br/>After ten minutes, everyone else went to wash up. Daisy Zane only came inside the dormitory from the balcony.<br/><br/>As soon as she opened the balcony door and saw Daisy Zane, Daisy Zane raised an eyebrow, “You’re back?”<br/><br/>“Why did you make such a long phone call?”<br/><br/>Daisy Zane looked at her with a smile in her eyes, seeming to see through her every thought but said nothing.<br/><br/>Daisy Zane felt as if she had been exposed. She stood up and said, “Let’s go! Wash up! Lights out soon.”<br/><br/>“Why are you in such a hurry today?” Daisy Zane asked deliberately as she walked towards her bed.<br/><br/>“It’s my pleasure.”<br/><br/>Daisy Zane chuckled and said, “Alright, let’s wash up.”\t\t\t\t\t\t</div>", "images": {}, "success": true}