{"id": 306, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391073.html", "title": "Chapter 306: 282: All The Fish In That Sea… Are Mine", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 306: 282: All The Fish In That Sea… Are Mine</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 306: 282: All the fish in that sea... are mine<br/><br/>Translator: 549690339<br/><br/>The girl sitting in front of them was very shy. When she looked back and saw Daisy Zane, her face turned red.<br/><br/>Daisy Zane noticed her reaction and raised her eyebrows.<br/><br/>However, when Daisy looked at Daisy Zane, the words that were just about to reach her lips were suddenly held back.<br/><br/>She looked at her speechlessly, thinking that she was like a playboy Sea King...girl!<br/><br/>Once she thought about this setting, Daisy felt increasingly convinced. And she was one of her victims in her ocean.<br/><br/>Daisy:<br/><br/>The girl holding the pipa did not dare look Daisy Zane in the eyes: “I, I’m not good at playing.”<br/><br/>“You must be better than us.” Turner Daniel moved his chair and sat on the other side of Daisy Zane,”My ears are about to throw up. Let me cleanse them now.”<br/><br/>The girl lowered her head and pursed her lips. Just as she placed her hand on the pipa, a student came over: “Willow Martin, what are you doing here? Everyone has gone to Celeste Martin’s side.”<br/><br/>After she finished speaking, she sweetly greeted Daisy Zane and the others.<br/><br/>“I’m not going.” Willow Martin said.<br/><br/>“Why not? Celeste Martin has come here after such a long time.” Another girl pulled Willow Martin’s arm and said, “Her guidance session is about to end.”<br/><br/>“You go, I’m not going.”<br/><br/>“Where’s your usual enthusiasm for learning? What a great opportunity! And yet, you’re not taking advantage of it.” The girl was puzzled.<br/><br/>“I don’t want to go.” Willow Martin lowered her head, possibly due to anxiety. Her face turned even redder, and she said, “You go by yourself.”<br/><br/>Seeing her unusual expression, the girl did not press her any further. She said a few words to Daisy Zane and the others before leaving.<br/><br/>Suddenly, Willow Martin felt both awkward and nervous.<br/><br/>Turner Daniel smiled and said, “Well... let us have a performance to soothe my wounded heart.”<br/><br/>Willow Martin glanced at him, then quickly smiled as well, “Alright. Then...I will play ‘Spring Snow.’”<br/><br/>“Spring Snow” had a lively rhythm, fresh and smooth. It depicted the scene of early spring when ice and snow melt, and everything revives, giving people a feeling of freshness.<br/><br/>Willow Martin had a good foundation, but there were subtle differences in her fingering and hand shape. Although not easy to detect, those who listened carefully could tell.<br/><br/>This resulted in the piece being slightly off.<br/><br/>Perhaps this imperfection was never discovered, which led her to be forever inadequate, no matter how hard she practiced.<br/><br/>However... one very commendable point was her excellent emotional expression.<br/><br/>It was very pleasant to listen to.<br/><br/>As Daisy Zane and the others listened on their side, the students surrounding George Dunn and the teacher were only interrupted by the harsh sound of their instruments and the laughter of the group.<br/><br/>It was unknown what had happened, but the teacher was so amused that he doubled over in laughter, drawing no attention to Daisy Zane’s group.<br/><br/>Daisy Zane watched Willow Martin’s hand movements, which seemed fine in terms of strength and speed in a normal state.<br/><br/>As they watched, a group of students suddenly surrounded them.<br/><br/>Daisy Zane looked up and saw the same student who had previously brought Celeste Martin over: “Teacher Celeste, it’s over here. Her name is Willow Martin, and she shares the same last name as you. Usually, she works very hard, but she’s just a bit shy, that’s why she doesn’t feel at ease.”<br/><br/>As Willow Martin played the pipa with focus and involvement, she suddenly heard a voice. Her hand shook, and the string of the pipa made a harsh sound.<br/><br/>Daisy suddenly furrowed her brows.<br/><br/>“Huh?” Willow looked at her in surprise.<br/><br/>Turner Daniel and Olivia Lane also looked at her.<br/><br/>Daisy didn’t say anything else and just gently raised her chin, signaling Willow to place her hand on the strings.<br/><br/>Willow glanced at her again, then put her hand on the strings.<br/><br/>“Play a pluck.”<br/><br/>Willow did as instructed.<br/><br/>“This is the strength you think you should apply,” Daisy explained. “Your hand has been injured, and even if it has recovered well, it still affects you. Don’t treat it as an ordinary finger.”<br/><br/>Willow looked at her.<br/><br/>Olivia’s eyelashes trembled slightly, recalling their conversation in the hospital. The doctor had mentioned that Daisy’s hand had been injured – all five fingers...<br/><br/>Perhaps not just five fingers. Maybe her right hand, too...<br/><br/>“You tried to reach the desired strength as if it were a normal finger, which led to slight deviations in your hand shape and fingering techniques,” Daisy said slowly, ignoring the looks from both sides of her. “Come sit here.”<br/><br/>Turner quickly vacated his seat so that Willow could sit next to Daisy.<br/><br/>“Place your hand properly.” Daisy held her hand. “Your thumb is fine; the main issue is your index finger. Play.”<br/><br/>As soon as Willow tried to play, she wanted to apply force, but Daisy’s strength was much greater. If Daisy didn’t want her to move, she couldn’t move at all.<br/><br/>So, the note Willow played was weak and powerless.<br/><br/>“Again.”<br/><br/>Willow’s hand was held by Daisy, their strengths wrestling, but she was no match for Daisy. She could only play each note weakly, like a crippled person.<br/><br/>It wasn’t until some twenty attempts later that Daisy finally heard the sound she wanted.<br/><br/>Olivia’s eyelashes trembled slightly again.<br/><br/>Willow looked at Daisy with surprise and delight.<br/><br/>Daisy’s eyes remained calm and indifferent as she glanced at Willow’s hand. “Once more, with the same strength as just now.”<br/><br/>Turner, who didn’t understand a thing, just observed the expressions of the three girls.<br/><br/>From this, it seemed that Daisy was very impressive.<br/><br/>Willow played another dozen or more times, with more than half the notes sounding good. Then Daisy released her, letting her play by herself.<br/><br/>She played the pluck as well.<br/><br/>It turned out that Willow had a good understanding. Daisy’s judgment was correct.<br/><br/>“Practice using this method. The rest is up to you,” Daisy said calmly.<br/><br/>Willow looked at Daisy, her eyes shining, and her face even redder. Touching the back of her hand where Daisy had held it, she whispered, “Thank you.”<br/><br/>“Thank yourself,” Daisy replied. “Don’t waste your talent.”<br/><br/>Hearing her words, Willow’s eyes suddenly turned red. She lowered her head in a fluster and nodded, “Yes.”<br/><br/>Daisy didn’t want to get involved in other people’s sad stories, so she didn’t say anything more.<br/><br/>Olivia also remained silent, looking at her own hand.<br/><br/>As for Turner, he looked at Daisy with admiration, respect, and determination in his eyes. It was as if he had confirmed some ideas in his heart and made a decision.\t\t\t\t\t\t</div>", "images": {}, "success": true}