{"id": 307, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391077.html", "title": "Chapter 307: 283: It’S Not Her Fault In The First Place", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 307: 283: It’S Not Her Fault In The First Place</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 307: 283: It’s Not Her Fault in the First Place<br/><br/>After leaving school, Kevin Clark drove directly to Daisy Zane’s villa.<br/><br/>On the way, Michael Jackson called to report the situation, informing him that all the people deployed in the factory had been caught.<br/><br/>While driving, a vicious look crossed Kevin’s eyes: “Gather people at Henry Clark’s residence.”<br/><br/>Michael heard his words and suddenly fell silent for two seconds. For the first time, he questioned Kevin’s order: “Us?”<br/><br/>“Yes,” Kevin replied, “Wait for me for an hour.”<br/><br/>“Third Master, are you going personally?” Michael questioned again.<br/><br/>“Yes.”<br/><br/>“But what about the Old Master...” Michael said, “And the Lane Family?”<br/><br/>“I know,” Kevin replied, “No need for the Lane Family. I’ll keep it from Enamel Cannon and go by myself.”<br/><br/>Michael hadn’t seen Daisy Zane, but hearing how angry the Third Master was, he could guess that Henry Clark and Edward Kirsten’s men had come into contact with her. The Third Master wanted to take matters into his own hands.<br/><br/>He didn’t ask any more questions and simply replied: “Yes.”<br/><br/>Kevin went to Daisy’s residence and looked for Wilton Edwards.<br/><br/>As soon as he entered the living room, Wilton saw him and then stretched his neck to look behind him.<br/><br/>“I came by myself.”<br/><br/>Wilton didn’t let his disappointment show on his face, and smiled: “Ah, did the Young Master cause any trouble at Clark Manor?”<br/><br/>“No,” Kevin replied, “My parents really like him. They are getting along very well.”<br/><br/>“Good, good, that’s good,” Wilton said, “Third Master, please have a seat. Orchard Garden sent tickets yesterday and also brought tea. I’ll go get it for you to try.”<br/><br/>“Okay.” Because of Daisy, Kevin respected Wilton a lot.<br/><br/>The tea set was on the tea table. Wilton went to get the tea, and while making the tea, he said, “Using the tea the Third Master sent to entertain the Third Master.”<br/><br/>“They gave it to my mother. I haven’t tasted it yet.”<br/><br/>Wilton smiled kindly and asked, “Does the Third Master have any matters to discuss?”<br/><br/>“Yes, I want to ask about something.”<br/><br/>“Is it about the young lady?”<br/><br/>“Yes.” Kevin hesitated, then asked, “How did her fingers get broken?”<br/><br/>After Kevin finished speaking, he got up and walked out. When he was already at the entrance, Wilton Edwards suddenly called out to him: “Third Master...”<br/><br/>Kevin stopped and looked at him.<br/><br/>Wilton Edwards got up, walked a few steps towards him and said: “Third Master, has the young lady ever mentioned Jack Amos to you?”<br/><br/>Kevin was silent for a moment and gave a light “hmm.”<br/><br/>Wilton Edwards hesitated for a moment and said, “Third Master, there have always been conflicts between Edward Kirsten and Jack Amos. It was only a fuse when Jack helped her escape.”<br/><br/>Kevin’s eyelashes blinked lightly.<br/><br/>“The young master is the child of Jack Amos and Harris Kirsten. Harris Kirsten is Edward Kirsten’s biological sister.” Wilton Edwards looked at Kevin, “Edward Kirsten has always hated Jack Amos. The two of them are always at odds, and their conflicts have gradually intensified over time.”<br/><br/>Listening to Wilton Edwards’ words, it turned out that Charles Amos was really blood-related to Edward Kirsten.<br/><br/>Very closely related.<br/><br/>Uncle and nephew.<br/><br/>“Harris had a difficult delivery giving birth to the young master and could not be saved. Edward blamed all the mistakes on Jack Amos and the young master.” Wilton Edwards spoke, his eyes gradually getting wet, “Edward Kirsten and Jack Amos’ conflicts escalated at that moment. He not only thought about killing Jack Amos but also wanted to kill the young master.”<br/><br/>Kevin frowned.<br/><br/>“Jack helping the young lady escape was merely a fuse.” Wilton Edwards pressed his eyes, “Regardless of whether this happened or not, Edward Kirsten would not let Jack Amos live. He just used the death of Jack as an excuse to force the young lady to stay by his side.”<br/><br/>Kevin rubbed his fingertips.<br/><br/>“The young lady has always attributed this matter to her own fault. She has always believed that Jack’s death was caused by her hands. She has been living in guilt for all these years.” Wilton Edwards’ voice gradually turned hoarse.<br/><br/>Kevin lowered his gaze to conceal the emotions in his eyes.<br/><br/>“Third Master, the young lady really trusts you.” Wilton Edwards said, “Maybe you are the only one who can help her get out of this.”<br/><br/>Kevin swallowed, his voice hoarse, “I understand.”<br/><br/>“Thank you, Third Master.” Wilton Edwards said softly, his eyes red.<br/><br/>“I should do it.”<br/><br/>After saying that, Kevin left.<br/><br/>When Kevin sat in his car, he stayed inside, staring at the road ahead, for a long time, not starting the car.<br/><br/>The pain in his heart was like an uncontrolled vine growing and spreading, with thorns, covering his whole body through his blood.<br/><br/>His little girl was so good, how could he bear to let her experience so much suffering?<br/><br/>How could he make up for her pain and suffering all these years by loving his little girl?\t\t\t\t\t\t</div>", "images": {}, "success": true}