{"id": 308, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391081.html", "title": "Chapter 308: 284: She’S Not There", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 308: 284: She’S Not There</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 308: 284: She’s Not There<br/><br/>Translator: 549690339<br/><br/>Kevin Clark took a long time in the car before driving to the villa, where Henry Clark was staying.<br/><br/>When he arrived, Michael Jackson and Juan Wright had already surrounded the villa.<br/><br/>The three-story villa was simply decorated. The flowers and plants in the courtyard were also simply cared for, with no attention paid to elegance.<br/><br/>The entire villa, from the inside out, appeared to be just a temporary resting place.<br/><br/>It was never intended for long-term residence.<br/><br/>After all, Henry Clark planned to live in Clark Manor.<br/><br/>When Kevin Clark entered the villa, only Henry Clark was sitting on the sofa with a sullen face, and the others had been subdued.<br/><br/>The members of the Clark Family surrounded Henry Clark, like vengeful ghosts.<br/><br/>When Kevin Clark walked to the entrance, he was somewhat backlit.<br/><br/>Henry Clark could only see a tall figure, like a hellish Asura, coming to judge his fate.<br/><br/>It wasn’t until Kevin Clark approached that Henry reacted and stood up immediately, holding back his anger and saying, “Arthur, what are you doing here?”<br/><br/>Kevin Clark sat directly on the sofa opposite him, crossed his legs, and looked at him.<br/><br/>His narrow eyes were filled with ruthlessness and poison, appearing careless yet horrifying.<br/><br/>“Arthur. Is there a misunderstanding between us?”<br/><br/>Henry Clark and Elina Clark looked similar, but Henry’s face carried a cunning look, whereas Elina’s was full of righteousness.<br/><br/>“No misunderstanding, only grievances.” Juan Wright’s fox-like eyes were smiling but chilly as he said, “You kidnapped Young Miss Lane twice. The first time, you forced the young master to hand over the seal. The second time, you attempted to provoke conflict between the Lane Family and the Clark Family...”<br/><br/>“Don’t slander me!” Henry Clark interrupted Juan Wright’s words.<br/><br/>Juan ignored him and continued, “And you colluded with Edward Kirsten’s power.”<br/><br/>“Nonsense!” Henry Clark yelled.<br/><br/>“You know very well whether it’s nonsense or not,” said Michael Jackson.<br/><br/>“Arthur, I don’t understand what you’re talking about,” Henry Clark straightened his back and said, “I just came to Imperial Capital for a short stay. Your father said nothing, but you came here with great fanfare, surrounding the villa and beating people. Is this how you treat your elders?”<br/><br/>Kevin Clark looked at him, waiting for him to continue.<br/><br/>“Withdraw your people immediately, I won’t pursue the matter. I’ll just consider it a prank,” said Henry Clark, “Otherwise, I’ll have to go to Clark Manor and ask for an explanation from Big Brother.”<br/><br/>“Do you think you can get out of here?” Kevin Clark asked softly.<br/><br/>Henry Clark’s face changed abruptly: “What do you want?”<br/><br/>“You think that by capturing Olivia Lane, and having it carried out by people not connected to you, you can absolve yourself of responsibility when something goes wrong?” Kevin Clark said.<br/><br/>“What are you talking about!” Henry Clark said, “You’re saying that I ordered the kidnapping of Olivia Lane, do you have any evidence?”<br/><br/>“Why would I need evidence?” Kevin Clark retorted.<br/><br/>Then it vibrated again.<br/><br/>Olivia muted it again and looked at her phone for a while before dragging Daisy out of the classroom and heading straight for the restroom.<br/><br/>When they got to the restroom, Olivia suddenly said to Daisy, “Say I’m not here.”<br/><br/>After saying that, she pressed the answer button and put the cell phone to Daisy’s ear.<br/><br/>Daisy looked at Olivia and said, “......”<br/><br/>As soon as the call connected, a voice from the phone said, “Olivia, I’m at the school entrance, come out.”<br/><br/>The voice was a bit stern, and Olivia’s little heart sped up in fright.<br/><br/>Normally, her brother would spoil her rotten. Whenever she got into trouble, he would never scold her and would always solve her problems.<br/><br/>But last time she was taken away by Henry Clark, her brother got angry at her. This time it was even more dangerous, and Arthur’s girlfriend got hurt too. Arthur must have badmouthed her to her brother.<br/><br/>Her brother will definitely be even angrier this time.<br/><br/>She didn’t want to face it.<br/><br/>As for Daisy, her eye twitched a little when she heard the voice.<br/><br/>“Olivia?”William Lane couldn’t hear a response and called her name again.<br/><br/>Olivia pitifully looked at Daisy, sending her a distress signal.<br/><br/>Daisy glanced at Olivia, and then she said to the phone in a calm voice, “She says she’s not here.”<br/><br/>Olivia’s face fell,<br/><br/>William Lane also went quiet for a moment upon hearing this cold voice, curious that Olivia would let someone else answer her phone at school.<br/><br/>The three of them kept quiet for a few seconds, then Olivia began to pester Daisy like a kitten, grabbing at her clothes and saying, “Ah! How could you do this! I’m going to tell Arthur North that you’re flirting with young girls at school.”<br/><br/>Daisy didn’t avoid her, smiling and saying, “Young girl, I lied for you. What if your brother comes in and hits me?”<br/><br/>Listening to their conversation, William Lane didn’t say anything for a moment. His sister had never been this close to someone before.<br/><br/>“My brother wouldn’t hit anyone,” Olivia muttered.<br/><br/>“Then what are you afraid of?”<br/><br/>“I... it’s none of your business.”<br/><br/>“Olivia, be polite when you speak,” William’s voice suddenly came from the phone.<br/><br/>Daisy and Olivia both looked at the phone.<br/><br/>Olivia immediately behaved, but she still glared at Daisy angrily.<br/><br/>Daisy pinched her face and handed the phone back to her, saying, “You’ve been tired all day, go home and sleep tonight.”<br/><br/>Olivia looked at her phone silently.<br/><br/>“Go ahead, your brother is waiting for you.”\t\t\t\t\t\t</div>", "images": {}, "success": true}