{"id": 304, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391065.html", "title": "Chapter 304 - 280: Return To School", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 304 - 280: Return To School</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 304: Chapter 280: Return to School <br/><br/>Translator: 549690339 <br/><br/>“Little girl, aren’t you being a little too nice to Olivia Lane?” Kevin Clark asked as he picked up a piece of food for her. <br/><br/>Daisy Zane glanced at him, “I do like the young lady quite a bit.” <br/><br/>“You even drew a portrait for her.” Kevin Clark grumbled, “I saw it while watching the video last night.” <br/><br/>Daisy Zane took a bite of celery and swallowed before saying, “Why don’t you finish watching the video tonight, and then decide what tone you should take when speaking to me.” <br/><br/>Kevin Clark raised an eyebrow, “Do I get a share?” <br/><br/>“Depends on my mood.” <br/><br/>After dinner, the clothes were just bought and returned. <br/><br/>Daisy Zane changed clothes and asked Kevin Clark to drive her back to school. On the way, they bought George Dunn a cellphone, with Kevin Clark paying the bill. <br/><br/>When they arrived at School, it was already a little past three o’clock. <br/><br/>The car stopped at the school entrance, and Daisy said “Let’s go” while unbuckling her seat belt, trying to get out of the car, but Kevin Clark stopped her. Rêạd new chapters at novelhall.com<br/><br/>Kevin Clark’s hand was on the back of her neck, pulling her gently towards him for a kiss. <br/><br/>Daisy let him kiss her for a moment before pushing him away by pressing on his shoulder, “I have a show to record.” <br/><br/>Kevin Clark understood and kissed her lips twice more, “There’s no swelling; it’s not noticeable.” <br/><br/>Daisy Zane: <br/><br/>Kevin Clark chuckled softly and pinched the back of her neck, “Don’t worry about anything outside, I’ll take care of it. Enjoy your campus life.” <br/><br/>“Alright.” <br/><br/>“Off you go.” <br/><br/>Kevin Clark watched Daisy Zane’s retreating figure, the corner of his mouth hooked with a gentle, satisfied smile. <br/><br/>After entering school, Daisy first returned to her dormitory to change into her school uniform, then went to the art building to record the show. <br/><br/>The shooting director had already been waiting at the entrance of the art building. Seeing her coming, he immediately handed her a mic to wear. <br/><br/>But when he saw her hand, he was startled, “What happened? It looks serious!” <br/><br/>Daisy explained to Director Nash that she had accidentally tripped and went to the hospital to get it treated. <br/><br/>“The swelling’s bad, but it’ll be fine in a couple of days,” Daisy’s tone was casual, her voice cold, clearly not caring much about it. <br/><br/>The shooting director looked at her carrot-like wrapped fingers, wondering how it could not be a big deal. <br/><br/>“Where is your strength? Do you hear the sound you’re playing? Is the strength in place?” <br/><br/>“Oh my! Your pitch accuracy is off. The art examination is coming soon, can’t you hear that your pipa pitch isn’t accurate?” <br/><br/>“It sounds accurate to me,” the student quietly retorted. <br/><br/>“Did your ears run away from home?” The teacher handed her a tuner, “Where is it accurate? Listen, where is it accurate?” <br/><br/>The student attached the tuner and played a bit. There was a very subtle deviation on the tuner: “Just a tiny bit.” <br/><br/>“A tiny bit is still not acceptable,” the teacher said. <br/><br/>“Oh.” The student adjusted the pitch. Then she played again, only to find that she still couldn’t discern anything. <br/><br/>Seeing her expression, the teacher became so angry she almost choked: “Next one, next one!” <br/><br/>Daisy Zane looked on from behind and raised the corner of her mouth momentarily. <br/><br/>“What are you laughing about?” Olivia Lane rubbed her ears, “it’s a disaster scene here, and you can still laugh.” <br/><br/>Daisy Zane didn’t say anything but listened as the teacher said: “Oh no, your string crossing is still not fast enough. Practice more.” <br/><br/>“Ha, yours is fast enough, but what the hell are you playing? I’ve never heard this song in all my years in the industry.” <br/><br/>Under the teacher’s criticism and attacks, each of the more than twenty students was finally corrected once. <br/><br/>But the teacher’s complaints did not end there: “You people think you’re so great every day, acting like no one else exists. You hear people around you playing at a similar level and think your skills are enough.” <br/><br/>None of the students in the class spoke, remaining quiet and listening. They were accustomed to this state. <br/><br/>“If you never see the mountain beyond the current mountain, you’ll never know where your skills stand.” <br/><br/>All the specialized students in Gathering Joy Private School trained in their own school. Teachers were all hired from outside and paid by the hour. <br/><br/>Furthermore, they did not accept outside trainees. <br/><br/>The teachers were highly skilled, and there were few students. They could pay attention to every student. <br/><br/>So the students’ skills were not bad, but as their skill level improved, the teacher’s demands also increased. <br/><br/>“You should thank the program team for choosing our school and inviting students from the Royal Court Music Academy,” the teacher said, “And you should also thank Celeste Martin, who is studying the pipa. It’s a bargain for you to meet people from the Royal Court Music Academy for free.” <br/><br/>Upon hearing the teacher, the students immediately became excited. Applause and cheers immediately filled the entire classroom. <br/><br/>Everyone turned to look at Celeste Martin. <br/><br/>The recording crew in the back also joined in the applause. <br/><br/>Daisy Zane could only move one hand, but she saw Olivia Lane sitting on the side, with no intention of joining in. <br/><br/>So she turned Olivia’s hand over and clapped it twice. <br/><br/>Olivia Lane: “... Childish.”\t\t\t\t\t\t</div>", "images": {}, "success": true}