{"id": 302, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391057.html", "title": "Chapter 302 - 278: What Else Do You Want…", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 302 - 278: What Else Do You Want…</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 302: Chapter 278: What else do you want...<br/><br/>Translator: 549690339<br/><br/>Daisy Zane’s arms and hands were patched with swelling and pain relief patches, which were wrapped in another layer of bandages.<br/><br/>The bandages were wrapped from her lower arm to her fingertips, leaving only her ring finger, little finger, and thumb exposed outside.<br/><br/>Afterwards, the doctor had also prescribed some ointments.<br/><br/>Most of the medications at the First Hospital were supplied by the Research Institute, so they were all very effective.<br/><br/>“Change it every 24 hours,” the doctor said, “Clean it with alcohol first, apply this and then this, then stick these, and bandage it.”<br/><br/>Every one, except Daisy Zane was listening earnestly. Even Hugo Clark was taking notes intently while Daisy, on the other hand, found it all troublesome.<br/><br/>It was capable of reducing its own swelling. Why did it have to be so complicated?<br/><br/>Having gotten the medicines, the four of them didn’t even leave the consulting room. It was the doctor who went back to his office.<br/><br/>The First Hospital is a private hospital, backed by the Clark and Lane Family.<br/><br/>So when they arrived, they directly came from the parking lot via an exclusively assigned elevator. The doctor had been called over as well.<br/><br/>From examination to getting medications, the four of them didn’t encounter anyone else except the doctor and nurses.<br/><br/>After the doctor left, Harton Clark wiped the blood off Daisy Zane with wet wipes.<br/><br/>Holding her face, he gently wiped off the blood traces from her face with utmost care.<br/><br/>Daisy Zane lifted her head to see Harton Clark. She saw him pursing his lips with a rather sickly pale face, looking down at her face but avoidant of her eyes.<br/><br/>After a quiet while, when Hugo Clark was planning to leave with Olivia Lane, Olivia suddenly moved a few steps forward, getting closer to Harton Clark and Daisy Zane.<br/><br/>Then she hung down her head and softly said, “Third Uncle, I’m sorry.”<br/><br/>Daisy Zane turned her head to look at her, but Harton Clark corrected her turned head: “......”<br/><br/>Olivia Lane continued, “She got hurt because she was protecting me.”<br/><br/>Harton Clark didn’t even look at Olivia Lane and bluntly said, “No need to explain it to me; explain yourself to your brother. Why were you skipping school and why did you necessarily have to shake off the people who are following you?”<br/><br/>Olivia Lane’s lower lips quivered.<br/><br/>“Think about it. Because of your wilfulness, how much trouble you brought to others,” Harton Clark’s voice was steady, but it still felt like a knife repeatedly cutting into the tender flesh, just like blood-spraying torment.<br/><br/>Hugo Clark walked up to Olivia Lane and gently guided her towards himself.<br/><br/>Arthur North put the handbrake up and turned to look at Daisy Zane.<br/><br/>Daisy Zane also turned to him, paused and then said, “My hand is just swollen...”<br/><br/>“What else do you expect?” Arthur North spat out before he could control his tone.<br/><br/>Daisy Zane blinked slightly but before she could speak, Arthur North immediately said, “I’m sorry.”<br/><br/>Both of them fell silent, the atmosphere in the car seemed to freeze, making it hard for them to breathe.<br/><br/>After a moment, Daisy Zane reached out and held Arthur’s hand which was resting on the handbrake.<br/><br/>Her left hand was firmly bandaged, resting on top of his. She could only use her little finger and ring finger to grasp his hand.<br/><br/>Arthur North instantly held onto those two fingers, whispering, “Don’t put too much force.”<br/><br/>“I’m really fine.” Despite Daisy Zane’s voice remaining cool, she deliberately sounded more gentle. “The little girl thought there was a sniper on the mountain, so she protected me, that’s why she was hurt.”<br/><br/>Arthur North watched her for a few seconds before undoing her seat belt. He then lifted her by the waist and set her onto his lap, even pulling her legs over his own.<br/><br/>Daisy Zane initially tried to move away, but Arthur North held her waist, stopping her from moving. He looked into her eyes and said, “Little girl. Try to trust me, rely on me, is that okay?”<br/><br/>Daisy Zane, having her right hand supported on his shoulder, didn’t say anything.<br/><br/>“Today, with just one call, both the Lanes and Clarks could have been mobilised.” Arthur North’s voice became deliberately softer, to the extent that it was hoarse. “Why take the risk yourself? You were driving so fast, a single error could have...”<br/><br/>Arthur North didn’t finish his sentence.<br/><br/>Daisy Zane had synched the surveillance Holt Lawrence could see, to Arthur North’s systems.<br/><br/>As such, what Holt Lawrence could see, Arthur North could as well.<br/><br/>However, Arthur North did not know the origin of that surveillance footage.<br/><br/>While driving, he watched Daisy Zane on the surveillance decide to ram into the business car.<br/><br/>At that moment, Arthur North broke out in a cold sweat as he felt all his strength being drained. Mechanically, he continued to drive, getting closer to Daisy Zane’s location.<br/><br/>What Arthur North saw on the surveillance and what Daisy Zane saw from her car were different angles, so he was even more worried.<br/><br/>Because of this discrepancy, from his perspective on the surveillance, it appeared Daisy Zane had steered too late.<br/><br/>Only after Daisy Zane’s car successfully tipped the business car did Arthur North gradually regain his senses, realising his own heart was pounding.<br/><br/>If there had been even the slightest error, Arthur North didn’t dare to comprehend what could have happened.<br/><br/>Daisy Zane felt Arthur North’s arm tighten around her. The hand she had rested on his shoulder loosened a little as she said, “Third Master, perhaps you could try trusting me more. Consider me an equal to you...”\t\t\t\t\t\t</div>", "images": {}, "success": true}