{"id": 305, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391069.html", "title": "Chapter 305: 281: Pipa Class", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 305: 281: Pipa Class</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 305: 281: Pipa Class<br/><br/>Translator: 549690339<br/><br/>There were not many people learning Pipa in the school. There were only two classes, with less than fifty people combined.<br/><br/>The teacher requested to call the neighbouring class over.<br/><br/>Everyone was to listen to Celeste Martin showcase first.<br/><br/>Celeste Martin picked up her Pipa and stepped forward, and the seven of them behind were each handed a Pipa.<br/><br/>Turner Daniel took the Pipa and said, “Can I go play the piano next door? I’m afraid someone will come after me later.”<br/><br/>George Dunn patted his shoulders and said, “Just do your best give it all, so you can block it for our elder brothers and sisters. It’s fine if they only come after you.”<br/><br/>“Is this how you take care of a newly grown-up?” Turner Daniel said.<br/><br/>“This will make you grow up fast,” said Serena Buster.<br/><br/>Turner Daniel glanced at Daisy Zane who was sitting in her seat, watching their banter. He then looked at the others and said, “You... I’ve got my eyes on you.”<br/><br/>The few chuckled, and George Dunn took the opportunity to walk up to Daisy Zane and asked in a low voice, “What happened to your hand?”<br/><br/>“I had a fall,” Daisy Zane handed him her cell phone from her pocket, “My cell phone is broken. Can you replace the SIM card for me?”Điscover new chapters at novelhall.com<br/><br/>George Dunn extended his hand to take the cell phone. Something must have happened, otherwise even if the phone was broken from a fall, why would the SIM card need replacing?<br/><br/>And she was in such a rush when she left.<br/><br/>However, George Dunn didn’t ask further, “It’s just a phone, I’ll buy a new one myself.”<br/><br/>“I only reimbursed you because it’s cheap,” Daisy Zane said calmly.<br/><br/>Olivia Lane laughed out.<br/><br/>George Dunn: Does that mean, if it had been more expensive, she wouldn’t have reimbursed him?<br/><br/>Once the students from both classes settled down, the teacher arrived from behind. He explained to the group participating in the show how to hold the Pipa properly.<br/><br/>Since Daisy Zane had injured her hand, she wasn’t asked to participate. Hence, she just cradled the Pipa in her arms, watching the teacher instruct others.<br/><br/>Meanwhile, Celeste Martin brought her Pipa forward.<br/><br/>It was a custom-made Pipa, with her name on it. It must have cost over 300,000 USD at the very least.<br/><br/>As soon as the Pipa was unveiled, a wave of awe swept through the room.<br/><br/>Celeste Martin smiled and adjusted the strings, “I haven’t played for a few days. I kind of miss it.”<br/><br/>The entire classroom was filled with eyes shining in admiration.<br/><br/>“Let’s play ‘The Ambush from Ten Sides’. It’s a very common song,” Celeste Martin stretched her fingers, “The more common a song is, the harder it is to stand out because everyone has heard it so much. However, learning an instrument is a very drab process in itself. Every song is practiced till you’re sick of it.”<br/><br/>Daisy Zane had heard Charles Flores’ Pipa playing before, which was supreme. If we compare them, Celeste Martin’s Pipa playing is indeed only passable.<br/><br/>The only disciple of Charles Flores... that’s not a matter that can be simply described as “amazing”.<br/><br/>Some people really do have a head start the moment they’re born.<br/><br/>An incomparably prestigious lineage, unbeatable talents, love that’s cherished in the palm of hands...<br/><br/>The word “envy” had already become numb for her, Daisy Zane furrowed her brows, then asked: “What about you?”<br/><br/>“What?”<br/><br/>“I heard your brother plays the Guqin and your sister plays the Pipa. What about you?” Daisy Zane casually inquired.<br/><br/>Olivia Lane clenched her fingers, stayed silent for a while before she finally replied, “It’s none of your business.”<br/><br/>Daisy Zane drew in a breath, then reached out to pinch her face, “Speak politely.”<br/><br/>Olivia Lane’s face was misshaped by Daisy Zane’s pinch. She intended to remove Daisy Zane’s hand but paused after she saw the other hand wrapped in bandages, then said, “Oh.”<br/><br/>After Celeste Martin finished playing, she began to instruct everyone. She was pretty, had a nice voice, spoke gently, and was patient. Everyone gathered around her.<br/><br/>They surrounded her so tightly that the camera couldn’t capture her, so they called in a cameraman to specifically film her.<br/><br/>The seven people in the back were not idle either, the teacher taught them how to pluck using their right hand.<br/><br/>The moment they plucked, Daisy Zane immediately understood the meaning of “murderous” that Turner Daniel had told her about. She wanted to tie up their six hands now.<br/><br/>After listening for a while, Olivia Lane covered her ears.<br/><br/>Daisy Zane, with her left hand holding the Pipa in her arms, handed a pair of headphones to Olivia Lane.<br/><br/>It was a gift from the cell phone shop where she had just bought a phone for George Dunn.<br/><br/>Olivia Lane quickly took out her cell phone, found a song, and put on the headphones.<br/><br/>While Daisy Zane was quietly observing them and continuously stroking the Pipa with her right hand.<br/><br/>After a long while, the crowd around Celeste Martin had changed twice. Daisy Zane couldn’t help but pluck a string.<br/><br/>Pluck with the index finger, strike with the thumb, with great strength. The hand shape was correct and beautiful. She tuned every string that she plucked until it was in tune.<br/><br/>When she was tuning the first string, Olivia Lane was switching songs in her headphones and heard the sound. Her first reaction was to unplug her headphones, but she didn’t move.<br/><br/>However, Daisy Zane stopped moving after playing and tuning a few times. She listened to the young girl, sitting in front of her, who hadn’t moved before playing the Pipa.<br/><br/>Almost everyone else had gathered around Celeste Martin, only she hadn’t moved.<br/><br/>Olivia Lane was clenching her headphones, it was only a few notes, just those few notes, even though it was a simple right hand pluck, it completely overshadowed Celeste Martin.<br/><br/>Absolutely, she was absolutely certain in her heart.<br/><br/>Turning her head sideways, Olivia Lane moved her lips, but before she could speak, Daisy Zane unexpectedly patted the girl in front of her and casually suggested, “Why don’t we enjoy a bit of your playing?”\t\t\t\t\t\t</div>", "images": {}, "success": true}