{"id": 300, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391049.html", "title": "Chapter 300: 276: Injured", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 300: 276: Injured</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 300: 276: Injured<br/><br/>Translator: 549690339<br/><br/>Daisy Zane’s fighting skills were extremely fierce, not just because of her strength and fierceness, but also her impressive endurance, well-suited for prolonged combat.<br/><br/>They were surrounded on all sides. Daisy couldn’t stay in place and allow herself and Olivia Lane to be completely encircled and killed.<br/><br/>So, she grabbed Olivia and broke through the encirclement, while making sure that Olivia wasn’t touched by anyone.<br/><br/>Although Olivia wasn’t a strong fighter, she maximized her assistance abilities under Daisy’s powerful combat prowess.<br/><br/>The young miss had great courage and showed no mercy. She didn’t hinder Daisy in any way, but actually provided some assistance.<br/><br/>It seemed that she had received some professional combat training, although it might not have been very rigorous, considering she was a precious daughter at home, and nobody would allow her to suffer.<br/><br/>As soon as Daisy broke through the encirclement, she immediately pulled Olivia behind her.<br/><br/>She could be said to have grabbed Olivia’s arm and thrown her directly behind her.<br/><br/>Surrounding them were weeds, some of which were as tall as half a person. The ground was uneven with pits and small stones scattered about.<br/><br/>Daisy held a dagger in her hand, her arms and half-sleeve stained with blood, and some splattered onto her face as well.<br/><br/>Her originally cold demeanor was tainted a shade of bloodiness.<br/><br/>She retreated with Olivia while clearly understanding that their numerous opponents could easily encircle them again.<br/><br/>And five minutes had already passed. Those from the Lane family following Olivia hadn’t arrived.<br/><br/>Indeed, before getting out of the car, she had looked at Kevin Clark’s position but falsely told Olivia they would be there in five minutes just to comfort her.<br/><br/>Only the two Lane family cars following Olivia could have made it within five minutes.<br/><br/>There must have been an incident on the road.<br/><br/>When getting out of the car, Daisy found George Dunn’s cellphone in her uniform pocket and threw it in the car, severing contact with Holt Lawrence.<br/><br/>Olivia looked at Daisy from behind.<br/><br/>It was like seeing a person she had just met that day.<br/><br/>She had always thought Daisy was just cold and unapproachable, but always kind to her, even speaking softly.<br/><br/>Now she realized that Daisy seemed to have a truly cold heart.<br/><br/>Facing such a crowd, her eyes did not blink as she knocked down one opponent after another.<br/><br/>It was as if she were a devil crawled up from hell, evil and sinful, as if this was her true nature.<br/><br/>The smell of blood was so intense that... for an instant, one could not sense the breath of a living person.<br/><br/>After standing up, Olivia looked at Daisy’s trembling hand that was holding the iron rod. Her forearm, index and middle fingers were swollen: “How are you?”<br/><br/>“I’m fine.” Other than Daisy’s face turning pale and her voice colder, there seemed to be no noticeable difference. She handed the iron rod to Olivia, “Hold it.”<br/><br/>Olivia obediently took it, whispering, “I’m sorry, I thought there was a sniper on the hillside.”<br/><br/>“It’s okay.” Daisy poked her face with her hand, “Follow behind me.”<br/><br/>After saying that, she looked at the people ahead, her expression colder, like a wolf ready to tear someone apart at any moment.<br/><br/>It was at this moment that the sounds of vehicles reached everyone’s ears.<br/><br/>Before anyone could react, a Maybach charged in.<br/><br/>Daisy glanced at the car; it was Kevin Clark’s.<br/><br/>The people who were about to encircle them instinctively moved to the sides.<br/><br/>And the car did not stop; after rushing in, it circled around Daisy and Olivia, dispersing the people nearby.<br/><br/>It then circled around them twice more, each time widening the gap.<br/><br/>Kevin’s car was fast, not giving anyone time to react or get close again.<br/><br/>The car forcefully drove the group of people more than ten meters away.<br/><br/>Surrounding grass was all flattened, and dry soil flew up.<br/><br/>At the same time, more cars arrived. In just a few seconds, more than a dozen cars drove up, stopping at a distance of about ten meters away from Daisy and Olivia.<br/><br/>It was the same distance that Kevin had driven them away earlier.<br/><br/>It was like a barrier, protecting the two in the middle.<br/><br/>Kevin’s car stopped about two meters away from Daisy.<br/><br/>The car door opened, and Kevin Clark got out.<br/><br/>He wore black trousers and a black shirt, looking tall and slender. Wrapped in an oppressive aura, he appeared both mysterious and dangerous.<br/><br/>After getting out of the car, his eyes immediately fell on Daisy. It was as if everything else disappeared, and he walked straight towards Daisy.<br/><br/>Standing in front of Daisy, Kevin wiped the dried blood off her face with his hand, then looked at her arm: “Are you hurt?”<br/><br/>Kevin’s voice was cold and hoarse, as if he still suppressed his inner brutality.<br/><br/>Olivia Lane was immediately frightened, lowering her head and holding her breath.<br/><br/>On the contrary, Daisy’s voice was calm, as if she had just lost a strand of hair: “It’s okay, just bumped it by accident.”\t\t\t\t\t\t</div>", "images": {}, "success": true}