{"id": 310, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391089.html", "title": "Chapter 310: 286: Arthur North’S Son", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 310: 286: Arthur North’S Son</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 310: 286: Arthur North’s Son<br/><br/>Translator: 549690339<br/><br/>The dormitory’s grooming area was quite large.<br/><br/>Beyond the area for washing faces and brushing teeth, there were separate partition rooms for showering.<br/><br/>Every floor had one, but due to the number of people, the usage time for each person was rather short.<br/><br/>Daisy Zane and Amelie Quentin waited outside for a while and entered two adjacent partition rooms.<br/><br/>As Daisy undressed in the partition room, she accidentally caught a glimpse of a red mark on her shoulder.<br/><br/>It was very noticeable on her fair skin.<br/><br/>Her movements halted as she looked at the red mark on her left shoulder, her thoughts suddenly drifting far away.<br/><br/>It had been left by Harton Clark in the car.<br/><br/>His heavy panting seemed to linger in her ears even now.<br/><br/>She had told him not to mark her neck since she had a show to record, so he had pulled down her shirt and kissed her shoulder instead.<br/><br/>She could feel how Harton Clark struggled to control himself at that moment, almost losing control.<br/><br/>“Daisy Zane, is it inconvenient for you to use your hand?” Amelie Quentin hadn’t seen her turn the showerhead on from the partition next door and asked.<br/><br/>Daisy’s eyelashes trembled, and she returned to her senses, grabbing her right hand and saying, “No.”<br/><br/>“Oh. Then you should hurry up and wash,” Amelie Quentin said.<br/><br/>“Mm.”<br/><br/>Daisy Zane’s grooming was very fast, and Amelie Quentin, to save time, also washed quickly. When she heard Daisy turning off the showerhead, she hadn’t even dried her hair yet, so she quickly wrapped it, put on her pajamas, and went outside.<br/><br/>“Don’t rush,” Daisy Zane said.<br/><br/>“I’m not in a hurry,” Amelie Quentin replied before glancing at her hand and hurrying back. “Hurry up.”<br/><br/>Daisy Zane looked at the impatient girl and chuckled softly to herself.<br/><br/>Because Amelie Quentin was in such a rush, her pajama buttons were not properly fastened. Since her left hand was holding her wrapped hair and she was walking hastily, her pajama top slid down after a few steps.<br/><br/>Daisy Zane followed her at a leisurely pace.<br/><br/>As soon as Amelie Quentin’s clothes slid down, she noticed.<br/><br/>Then she looked at her left shoulder and narrowed her eyes.<br/><br/>The young girl’s skin was tender, so white that it seemed to reflect light slightly.<br/><br/>Thus, when a hint of red appeared on her left shoulder, it was particularly striking.<br/><br/>It looked like a tattoo, but only two points were visible, with the majority covered by her clothes. The full design was not visible.<br/><br/>The young girl apparently had a tattoo.<br/><br/>With this thought, Daisy Zane moved her left shoulder.<br/><br/>Upon entering the dormitory, Amelie Quentin set down her belongings and checked the time. There were still ten minutes left before lights out. She immediately walked to Daisy Zane’s side and asked, “Where’s your medicine?”<br/><br/>After taking Olivia Lane back to school, William Lane asked the driver to head to Doomsday Hotel.<br/><br/>Arthur North, Hugo Clark, and Allonzo Hobson were all waiting for him there.<br/><br/>When he pushed the door to enter, Allonzo Hobson was complaining, “Oh man, such an exciting thing and you didn’t call me. I’ve missed another one of Brook Sister’s cool, dazzling performances. You’re not brotherly enough.”<br/><br/>The four of them were so familiar that, when William Lane came in, there were no pleasantries exchanged. He walked to his seat and sat down, saying, “You call her sister, what do you call Arthur?”<br/><br/>“Of course, I call him brother-in-law. I’m Brook Sister’s family.”<br/><br/>“You sure know how to take advantage of the situation.” As he finished speaking, William Lane’s gaze landed on the child beside Arthur North.<br/><br/>Charles Amos was sitting close to Arthur North, his big eyes curiously watching William Lane.<br/><br/>Allonzo Hobson smirked wickedly and asked, “Did you see Amelie?”<br/><br/>“Yeah.”<br/><br/>Hugo Clark glanced at him.<br/><br/>Allonzo Hobson said, “Was the young lady scared today?”<br/><br/>“Someone was protecting her, so she couldn’t be scared.” After William Lane said this, he looked at Arthur North and said softly, “Thank you.”<br/><br/>Arthur North glanced at him, took a gentle breath, and said nothing.<br/><br/>Seeing his attitude, William Lane smiled and then looked at Charles Amos, “This is...?”<br/><br/>“William, look at you, always in F Continent. Arthur’s son is already this old, and you don’t even know,” Allonzo Hobson laughed, “What kind of brother are you?”<br/><br/>Looking at Charles Amos, William Lane suddenly remembered, “Isn’t this the child we bumped into at the hotel entrance last year?”<br/><br/>“You’ve seen him before,” Allonzo Hobson said.<br/><br/>William Lane nodded. As he looked at young Charles Amos, he thought that his understanding of Miss Zane had to change again.<br/><br/>Apparently, she even had a child.<br/><br/>Arthur North was going to become a stepfather.<br/><br/>How much gossip did he miss while he was in F Continent?<br/><br/>Charles Amos noticed him staring, so he looked up at Arthur North.<br/><br/>Arthur North raised his hand and rubbed Charles’s little head, speaking softly, “William Lane is from the same generation as your cousin.”<br/><br/>Charles understood, got down from his seat, stood beside Arthur North, and called out, “Hello, Brother Roy.”<br/><br/>William Lane, who was stubbornly clinging to the hierarchy, said, “... Call me uncle.”<br/><br/>Charles Amos glanced at Arthur North again.<br/><br/>Arthur North looked at William Lane and said, “Are you really willing to embarrass a child?”<br/><br/>William Lane:<br/><br/>Charles Amos, always on the same side, immediately called out again, “Brother Roy.”<br/><br/>Arthur North raised the corner of his mouth.<br/><br/>William Lane: “...Alright, call me brother then.”\t\t\t\t\t\t</div>", "images": {}, "success": true}