{"id": 311, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391093.html", "title": "Chapter 311 - 287: Everyone Has Changed.", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 311 - 287: Everyone Has Changed.</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 311: Chapter 287: Everyone Has Changed. <br/><br/>Translator: 549690339 <br/><br/>The four of them chatted casually in the private room, not drinking much because of Charles Amos. <br/><br/>After a while, William Lane said, “Arthur, let’s have a meal together with Lady Zane this weekend. I want to thank her in person.” <br/><br/>Kevin Clark looked up at him and hesitated for a moment before saying, “No time.” <br/><br/>William Lane was taken aback, “You don’t have to record a show this weekend.” <br/><br/>“Yeah,” Kevin Clark said, “but no time.” <br/><br/>Before he got the marriage certificate, he would never let William Lane meet the little girl. <br/><br/>William Lane obviously noticed a hint of hostility from Kevin Clark: “......” <br/><br/>Allonzo Hobson held his wine glass and glanced at the two with rolling eyes, understanding immediately. It must be because of the last auction when his Brook Sister mentioned the idea of wanting to marry William Lane. <br/><br/>Kevin Clark unilaterally considered him a love rival. <br/><br/>Oh—men. <br/><br/>“Hiding her so well?” William Lane smiled, “Not even letting me see her.” <br/><br/>Kevin Clark gave him a glance but remained silent. <br/><br/>Allonzo Hobson said, “It’s not difficult if you want to see her. Brook Sister’s drama is so popular, and a new one will be aired in a few days. There must be a lot of publicity during this time. You can see her online.” <br/><br/>“Roy Madison only has phone calls and text messages as means of communication, and no chatting social software,” Hugo Clark complained. “Do you think he would go online?” <br/><br/>“Ah, I forgot,” Allonzo Hobson laughed. “Young Master Lane is still living an ancient life.” <br/><br/>William Lane said, “Seeing her online is not so interesting. If I want to see her, I want to see her in person.” <br/><br/>Kevin Clark gaze at him, his eyes filled with coldness. <br/><br/>William Lane looked at him with a smile in his eyes. <br/><br/>The two stared at each other, as if an electric current connected them, making crackling noises. <br/><br/>Hugo Clark and Allonzo Hobson were very in sync, not interfering with the two of them, and quietly watched them from the side. <br/><br/>Soon, Charles Amos tugged on Kevin Clark’s clothes, rubbed his eyes, buried his head in his arm, and whispered, “I’m sleepy.” <br/><br/>Kevin Clark looked down at him, not noticing that he had made everyone so sleepy, “Which place should we go to?” <br/><br/>“Wilton Edwards’ place,” Charles Amos mumbled with his head buried. <br/><br/>Kevin Clark pressed on his head, “Get up, I’ll take you there.” <br/><br/>Charles Amos didn’t move. <br/><br/>“No going back?” Kevin Clark said. <br/><br/>Charles Amos still didn’t move and looked up at him with his eyes filled with fatigue and blurred vision. <br/><br/>William Lane furrowed his brow as he listened. <br/><br/>Seeing his expression, Hugo Clark said slowly, “After waking up from the dream, Amelie cried for a long time.” <br/><br/>William Lane’s eyes trembled, and it took him several tries before he could say, “Did she, did she dream of Lila?” <br/><br/>“Yeah.” <br/><br/>William Lane was stunned for a moment, then he poured himself a glass of wine and took a sip. <br/><br/>His sister, he understood. <br/><br/>After what Hugo Clark said, he had a general idea. <br/><br/>For all these years, his family had been deceived by her. <br/><br/>She didn’t want to forget Lila, she was hiding herself so that they wouldn’t worry about her. She made everyone think she was heartless and didn’t need any comfort. <br/><br/>She often pretended to casually ask him to go home, and would also casually compete for attention. <br/><br/>Everything was deliberately said for him to hear. <br/><br/>Hugo Clark saw that he didn’t speak and added, “Have you ever thought about why she doesn’t learn anything and doesn’t even want to go to school?” <br/><br/>William Lane clenched his fingers slowly, and the veins on the back of his hand bulged out. The answer to the question that had puzzled him for a long time suddenly became clear. <br/><br/>She felt that her life was exchanged for Lila’s and that she didn’t deserve the things Lila didn’t get to enjoy. <br/><br/>The private room seemed to be suddenly covered with a layer of dust, as if dust was blocking the air, making it difficult to breathe. <br/><br/>“Today, she thought there was a sniper on the mountainside, so she protected Lady Zane under her body,” Hugo Clark said quietly, “That’s what caused Lady Zane to be injured.” <br/><br/>William Lane clenched and released his hand, his fingertips trembling uncontrollably. <br/><br/>Back then, in the F Continent, it was the sniper rifle aimed at Olivia Lane that had its scope reflecting the light. <br/><br/>Charlotte Lane had noticed it and risked running to her side to push her away. <br/><br/>Olivia was pushed to the ground, while Charlotte was hit by a motorcycle that suddenly rushed up and fell off the cliff into the sea. <br/><br/>It all happened too quickly, too suddenly, no one had seen whether Charlotte had been hit by that shot or not. <br/><br/>William Lane closed his eyes. His sister knew everything and had been living in guilt and shadow all this time. <br/><br/>Today, she even wanted to make up for it with her own life. <br/><br/>But he had made her cry today. <br/><br/>Hugo Clark watched him for a while, drank the wine in his glass in one gulp, then left without saying anything. <br/><br/>He had said everything he needed to, and William Lane understood. <br/><br/>William Lane sat in the private room until three o’clock in the early morning. He didn’t drink, but stayed sober and thought about everything Amelie had been through in the past ten years. <br/><br/>Then he realized that he had spent too little time with her, and there were very few things he could actually remember. <br/><br/>After sitting in the private room for a long time, William Lane went to the parking lot of Doomsday Hotel and asked the driver to take him to Oxford City.\t\t\t\t\t\t</div>", "images": {}, "success": true}