{"id": 315, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391109.html", "title": "Chapter 315 - 291 Dance Class", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 315 - 291 Dance Class</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 315: Chapter 291 Dance Class<br/><br/>Translator: 549690339<br/><br/>Daisy Zane’s lunch was still brought by Amelie Quentin, and it was a lot.<br/><br/>Daisy Zane admitted that she ate quite a lot, but not to this extent.<br/><br/>With the principle of not wasting food in mind, she tried her best to eat. She’d eaten quite a bit in the morning, and it hadn’t fully digested yet. Even if it was delicious, she’d done her best.<br/><br/>So much so that when she went to dance class in the afternoon and put on her workout clothes, she felt her stomach was protruding.<br/><br/>Plus, when she stepped on the electronic scale in the dance room, she was four pounds heavier than usual.<br/><br/>When Daisy Zane stepped off the scale, everyone in the dance class felt a sudden cold breeze.<br/><br/>However, looking at Daisy Zane, they didn’t notice anything odd.<br/><br/>The focus of today’s dance practice was primarily on basic skills.<br/><br/>The dance teacher, who was hired from outside the school, had a great demeanor.<br/><br/>In addition, they had arranged for an in-house teacher for their group of eight, to teach them some technical skills, basic skills.<br/><br/>Because all eight of them said they hadn’t learned before.<br/><br/>The teacher treated them as beginners and was especially gentle when teaching basic skills.<br/><br/>While the other teacher, who was leading the other students, was quite strict.<br/><br/>Other than being loud, she really went in hard.<br/><br/>The eight of them were doing leg stretches on this side, while the other teacher was showing them chest and shoulder openers.<br/><br/>One student even fainted at the touch.<br/><br/>The teacher remained expressionless throughout.<br/><br/>For a moment, Serena Buster’s face turned pale.<br/><br/>One of the boys even let loose some curses.<br/><br/>The in-house teacher assured them, “It’s fine, these are all normal.”<br/><br/>So they, on the one hand, endured their pain, while on the other, they watched the “normal phenomenon” on the other side.<br/><br/>The students finished chest and shoulder opening, and then they all did leg stretches on the bar.<br/><br/>The way they stretched their legs was different than these eight.<br/><br/>They all had one leg up on the bar, the other leg drawn back, their legs forming a straight 180 degree angle.<br/><br/>Even 180 degrees wasn’t enough — as they stretched their legs on the bar, the teacher came around and pressed each of them further down.<br/><br/>At the end, the students couldn’t draw their legs back from the bar.<br/><br/>Their hips were fixed in place.<br/><br/>They drew back, little by little.<br/><br/>Of course, some cried out in pain, but those cries fell on deaf ears. The teacher saw no tears, only more pressure to be applied.<br/><br/>So the dance studio’s floor was covered with not only sweat but also tears.<br/><br/>And this was only the basic practice before each class.<br/><br/>Initially, the eight of them watched the students cry, but soon it was their turn.<br/><br/>Because the outside teacher, taking advantage of the students practicing on their own, came for them.<br/><br/>“Count again.”<br/><br/>George Dunn:<br/><br/>Then the teacher gave him pressure again, and George immediately said, “One, two, three...”<br/><br/>After moving one leg, there was the other.<br/><br/>Then it was someone else’s turn.<br/><br/>Daisy Zane was the sixth one to get her turn.<br/><br/>The five before her were all men, all sweating profusely, collapsed on the ground, rubbing their legs. They felt their legs were completely useless, and they couldn’t stand up anymore.<br/><br/>“Teacher, please be gentler with my River God,” George Dunn looked at Daisy Zane and laughed with a smirk, “Better yet, make her cry immediately.”<br/><br/>“You’re really looking for death, wanting River God to cry.” Another boy said, “River God, I’m talented in acting and my looks aren’t bad. I honestly feel the main male lead can be replaced by someone else.”<br/><br/>“Eh? Publicly snatching resources now. Can’t you plot behind my back?” George Dunn said.<br/><br/>“If I do it behind your back, it’ll seem insincere.”<br/><br/>“So snatching publicly is being...” George Dunn watched as the teacher easily stretched Daisy Zane’s leg to 180 degrees and suddenly widened his eyes, “What the hell?”<br/><br/>Everyone was stunned.<br/><br/>Turner Daniel, who was taken aback for a moment, whispered, “Is there anything Sister X can’t do? Sister X is omnipotent.”<br/><br/>Hearing this, the color in Celeste Martin’s eyes deepened.<br/><br/>Seeing the teacher press Daisy Zane’s leg, Serena Buster, had been so shocked that she covered her mouth and let go of Daisy Zane’s legs.<br/><br/>Daisy Zane, realizing the teacher was about to let go, braced her legs, and thus didn’t budge.<br/><br/>Seeing this, a smile appeared in the teacher’s eyes, and she raised an eyebrow at Daisy Zane.<br/><br/>Daisy Zane knew what she meant, and said, “Flexible.”<br/><br/>The teacher didn’t say anything when she didn’t admit it.<br/><br/>If it hadn’t been for the leg injury years ago, Sophie Ortiz’s only student wouldn’t have been Stella Edwards.<br/><br/>Daisy had always been Sophie Ortiz’s most valued student.<br/><br/>Who would know if they hadn’t learned to dance, she could always tell at one glance.<br/><br/>Everyone was wearing the same practice clothes, white tops, and black pants. Although the outfits were the same, when Daisy Zane stood there, her figure, temperament, appearance, and aura were all the most exceptional.<br/><br/>The teacher had noticed her when she entered the classroom.<br/><br/>The teacher was sure that not only did she know how to dance, but her dance foundation should be very solid.<br/><br/>It was just that she didn’t admit it, and the teacher felt a sense of regret for not being able to see her dance showcase.<br/><br/>After the other leg was done, the teacher looked at her for a while, then suddenly said, “You remind me of my younger student sister.”<br/><br/>Daisy Zane looked up at her, and through her eyes saw the sadness and regret in her heart. She didn’t say much, just politely smiled a little in response.<br/><br/>Daisy Zane’s legs were done stretching quickly.<br/><br/>She got up and moved around, and as George Dunn watched her in astonishment, she walked over to him, stepped on his hand on the ground, very deliberately yet casually.<br/><br/>Though she was wearing dance shoes, it wouldn’t cause much harm.<br/><br/>But Daisy Zane had used force. George painfully shivered and said, “River God, my hand. The hand of your male lead, you were so harsh.”<br/><br/>Daisy Zane looked down at him, quietly saying, “Hmm, I was taking revenge. Can’t you tell?”<br/><br/>George Dunn held his hand and said:\t\t\t\t\t\t</div>", "images": {}, "success": true}