{"id": 312, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391097.html", "title": "Chapter 312 - 288: Wanting To Write Her Name On The Family Tree", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 312 - 288: Wanting To Write Her Name On The Family Tree</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 312: Chapter 288: Wanting to Write Her Name on the Family Tree <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane and the others had one more day left to experience the life of specialized students. Điscover new chapters at novelhall.com<br/><br/>Early in the morning, right after they got up, they were called to the playground to gather and were asked to run laps with the sports students. <br/><br/>The Program Team saw that Daisy’s hand was injured and originally wanted her to rest. <br/><br/>But Daisy said it wouldn’t affect her, so she just followed everyone else in running. <br/><br/>In the beginning, all eight of them managed to follow along convincingly. <br/><br/>However, after one lap around the 400-meter track, it was evident that Serena Buster and Celeste Martin had fallen behind. <br/><br/>With one hand on their waists, the two of them struggled to move forward, feeling as if their lungs were about to explode from gasping. Each breath caused a stabbing pain in their chest. Their legs felt as though they were filled with lead, unable to move. <br/><br/>After two more laps, the few boys gradually fell behind as well, and they couldn’t run anymore. <br/><br/>All of them were in their twenties, and they rarely engaged in any sports other than filming. <br/><br/>Suddenly, joining a long-distance run without properly adjusting their breathing from the start was challenging. <br/><br/>Soon, they couldn’t continue running. <br/><br/>At first, there were photographers following both the front and the rear group. But later, the photographers couldn’t keep up either. <br/><br/>Feeling like they had enough close-up materials, they switched to using the cameras mounted on the side. <br/><br/>Only Daisy kept following the sports students without missing a single step. <br/><br/>After another lap, Daisy surpassed George Dunn and Turner Daniel by an entire lap. <br/><br/>She caught up from behind and then slowed down, leisurely saying, “Must be getting old, huh?” <br/><br/>George Dunn: <br/><br/>Turner Daniel gasped and looked at Daisy, asking, “Sister Lucia, aren’t you tired?” <br/><br/>“Not too bad.” <br/><br/>“What’s wrong with being older?” George gasped, “I, I am older. But Turner is young, and he’s like this too.” <br/><br/>“You’re really going to compare yourself to a child?” Daisy retorted. <br/><br/>“I’m not a child anymore,” Turner suddenly said, “I’m only six years younger than Sister Lucia.” <br/><br/>Daisy glanced at him, not paying much attention, and then patted George on the shoulder, saying, “Your health is most important, don’t push yourself.” <br/><br/>After that, she quickened her pace and went to catch up with the sports student she had been following. <br/><br/>George felt so refuted by her that he almost couldn’t catch his breath. He had known Daisy for many years, and naturally, he knew she liked to tease those she was close to. <br/><br/>The main issue was that he could never refute her, and this annoyed him a lot. <br/><br/>Celeste eventually couldn’t run anymore and slowly walked on the track. <br/><br/>Soon, Daisy ran past her. Looking at Daisy’s receding figure, a strong doubt crawled up in Celeste’s heart. <br/><br/>If it was about studying, the Program Team provided her with topics, arranged scripts for her, and let her shine. But in the art classroom, she had witnessed Daisy painting with her own eyes. <br/><br/>Daisy Zane had broken a sweat and ran against the wind on the playground. <br/><br/>Surrounded by students in their school uniforms like her, and a little further away, in the classrooms sat seventeen and eighteen-year-olds working hard for their futures. <br/><br/>The refreshing wind glided over her skin, and Daisy Zane curled the corners of her lips. <br/><br/>At this moment, she felt she was just like them, in the most unrestrained age, the most carefree age, full of expectations for the future and bewildering age. <br/><br/>At this age, perhaps not doing well in exams was the most significant issue. <br/><br/>Beyond that, she didn’t have to consider or think about anything else. <br/><br/>She was just responsible for enjoying her youth. <br/><br/>George Dunn and Turner Daniel were instinctively unwilling to give in to their physical endurance and persisted in running. <br/><br/>But then they suddenly saw Daisy Zane speed up, and both gradually stopped. <br/><br/>Catching their breath while watching her. <br/><br/>It could be said that everyone on the playground was watching her. <br/><br/>George Dunn and Turner Daniel were both a little stupefied. <br/><br/>Daisy Zane’s appearance was both cold and stunning, which indeed had nothing to do with immaturity, after all, it didn’t belong to that type. <br/><br/>Her temperament, besides being intrinsically cold, also had a maturity and steadiness from within. <br/><br/>That kind of stability and maturity made it seem like nothing could ever shake her. <br/><br/>Even in usual jokes, she never lost that temperament. <br/><br/>But now it was different, the Daisy Zane running on the playground. Although they were far away from her and could only see her figure, they both felt the sudden burst of vitality in her. <br/><br/>Her whole person shone brilliantly with that youthful vitality, incredibly dazzling. <br/><br/>Turner Daniel watched her, his eyes constantly drawn to her. His heart filled with her presence as she occupied more and more of it. <br/><br/>He was born into an extraordinarily distinguished family. <br/><br/>Both his grandparents and mother were university professors in different fields. <br/><br/>His grandfather and father’s status was even more prestigious. <br/><br/>Seeing his family’s outstanding achievements, he thought the people around him were unremarkable. <br/><br/>He knew it was because of his good genes, but he didn’t pay much attention to the people around him, nor had there been anyone worth noticing. <br/><br/>But Daisy Zane was different. The first time he saw her, he just thought she was exceedingly beautiful. <br/><br/>So beautiful that an occasional glance was satisfying. He didn’t pay too much attention or care about her. <br/><br/>Until the first period of Math class, when he saw her solving methods. <br/><br/>And later, when he saw her thoroughly researching his mother’s Math methods. <br/><br/>He couldn’t help but notice her. <br/><br/>The more he paid attention to her, the more outstanding he found her. It seemed there was nothing she couldn’t do. <br/><br/>The more he felt this way, the more he wanted to add her to his family tree...\t\t\t\t\t\t</div>", "images": {}, "success": true}