{"id": 316, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391113.html", "title": "Chapter 316 - 292: The Meals Of The Lane Family Are Very Tasty", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 316 - 292: The Meals Of The Lane Family Are Very Tasty</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 316: Chapter 292: The Meals of the Lane Family Are Very Tasty<br/><br/>Translator: 549690339<br/><br/>After half a day of dance class, the eight of them walked out of the dance classroom towards the cafeteria. Not only were they drenched in sweat, but everyone except Daisy Zane was also walking with a limp.<br/><br/>The more they tried to walk normally, the more their legs refused to cooperate.<br/><br/>The eight of them instantly became a spectacular sight.<br/><br/>In order to avoid any unnecessary attention, Daisy Zane glanced at the other seven and then mercilessly left them behind.<br/><br/>“Brook God.”<br/><br/>“Daisy.”<br/><br/>“Daisy Zane.”<br/><br/>Daisy Zane, deaf to their calls, made her way to the cafeteria.<br/><br/>Arriving at the cafeteria, she glanced at the spot where she had eaten breakfast and lunch. Sure enough, she saw Amelie Quentin waiting for her.<br/><br/>She walked over and gently tapped the table with her finger.<br/><br/>Amelie Quentin, who had her headphones on and was playing a game, glanced up when she noticed the movement on the table.<br/><br/>She froze for a moment when she saw Daisy Zane.<br/><br/>Daisy was still in her practice outfit, her hair tied up in a bun.<br/><br/>It magnified her usual grace several times, and added a touch of uniqueness common to dancers.<br/><br/>Seeing Amelie Quentin staring, Daisy Zane poked her smooth little face, “What, don’t you recognize me?”<br/><br/>“You... you took a dance class?” Amelie Quentin stuttered, regaining her senses.<br/><br/>“Yeah.” Daisy Zane sat down, put on a disposable glove, peeled a shrimp to eat, and then peeled another one for Amelie Quentin, “Don’t bother bringing my lunch tomorrow, I’ll eat in the cafeteria.”<br/><br/>“Tell that to my brother,” Amelie Quentin replied, “he was the one who sent it.”<br/><br/>“Can you help me pass the message along to him?”<br/><br/>“No.”<br/><br/>Daisy Zane shot her a look, laughed, and dropped the matter.<br/><br/>Daisy Zane had a substantial dinner and had planned to go for a run on the playground after the evening self-study.<br/><br/>But that didn’t happen.<br/><br/>The assistant gave her two experiments that needed to be done.<br/><br/>The reports had to be handed in tomorrow afternoon.<br/><br/>So she sent a message to James Collins, who had just arrived at Imperial Capital University, asking him to bring her laptop and wait for her outside the school.<br/><br/>After the evening self-study, she returned to her dormitory. It didn’t take long before she received a call from Kevin Clark.<br/><br/>“Mm.”<br/><br/>After hanging up, Daisy was again urged by Olivia Lane to wash up and apply medication.<br/><br/>Before even twelve o’clock, everyone went to sleep. Daisy, however, hopped out of the restroom once more.<br/><br/>This time, she deliberately avoided Olivia.<br/><br/>James Collins was waiting for her outside the wall. When she got into the car, she first glanced at James’s newly dyed dark hair, and then at the hickey on his neck in the second glance.<br/><br/>James noticed her gaze, and instinctively reached to touch his neck. Then with those flirtatious peach blossom eyes, he grinned at her.<br/><br/>But as his gaze drifted down to Daisy’s hand, his expression instantly changed, “Sis, what happened to your hand? Who did this?”<br/><br/>“I had a little fall.”<br/><br/>“You fell?” James didn’t believe her.<br/><br/>“Yes.” Daisy changed the subject, “Did it delay your escapades?”<br/><br/>Seeing that she didn’t want to talk about it, James didn’t pry further: “How is that possible? Sis, I’m quite the honest type.”<br/><br/>“Do you think I believe that?” Daisy glanced at the hickey on his neck.<br/><br/>“This really was an accident.”<br/><br/>“Alright, an accident.” Daisy said nothing more, leaning back in her seat and closing her eyes.<br/><br/>Seeing that she had fallen asleep, James drove the car more gently, even the brakes were lighter than usual.<br/><br/>But as he looked at her hand, his expression dimmed.<br/><br/>After dropping Daisy off at Imperial Capital University, James drove straight to Celestial Pivot to speak with Holt Lawrence.<br/><br/>But after understanding the situation, he found no room to put himself to use.<br/><br/>“Kevin Clark has sent his Second Uncle off to M Continent Prison?” James asked, “He is a ruthless man. It might have been kinder to just kill him.”<br/><br/>Holt Lawrence, initially asleep, had been awakened by James’s call. Now sitting in bed, with disheveled hair and red eyes, he remarked, “You are just realizing how ruthless he is? That’s why I’m really worried about Nana being with him.”<br/><br/>“No need to worry about my sister. She’s really tough.”<br/><br/>Holt Lawrence glanced at him and said nothing.<br/><br/>James had spent much of his time on M Continent and Mountain Sea Continent.<br/><br/>Celestial Pivot had always been located in the Imperial Capital. Although Kevin had made a notoriously bad name for himself, as a detective agency privy to inside information, they knew some of the truth.<br/><br/>The impression Holt had of Kevin was terrifying, chilling, ruthless, and merciless.<br/><br/>It was best to keep dealings with such a man limited to online, where everyone remained anonymous and transactions could be carried out smoothly.<br/><br/>In real life, it was better not to so much as cast a second glance.<br/><br/>He genuinely doubted Nana would have the upper hand with Kevin.<br/><br/>“Are we just decorations?” Seeing the look in his eyes, the flirtatiousness in James’ peach blossom eyes suddenly chilled, “No one can bully my sister.”\t\t\t\t\t\t</div>", "images": {}, "success": true}