{"id": 313, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391101.html", "title": "Chapter 313 - 289: Appetite…", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 313 - 289: Appetite…</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 313: Chapter 289: Appetite... <br/><br/>Translator: 549690339 <br/><br/>The distance between the playground and the cafeteria is quite far. <br/><br/>So, athletes have an earlier mealtime. <br/><br/>When coming out of the playground, Daisy Zane unzipped her school uniform. <br/><br/>She was too hot and had sweated a lot. <br/><br/>But as soon as she unzipped it, Turner Daniel said, “Daisy, the wind is cold. Don’t take it off, be careful not to catch a cold.” <br/><br/>Hearing his words, George Dunn glanced at him. <br/><br/>Daisy Zane also looked at him and said, “Hmmm.” <br/><br/>She had sweated all over, and her clothes were sticking to her body, but she didn’t stop taking them off. <br/><br/>Just then, several athletes from the playground walked by. Several people were leaning on each other, exhausted, but their eyes looked very energetic. After passing by Daisy Zane, they all respectfully shouted, “Daisy.” <br/><br/>They just greeted the others casually. <br/><br/>Daisy Zane’s eyes showed a hint of a smile, and she raised her eyebrows as if to acknowledge them. <br/><br/>“Daisy, will you come tomorrow morning?” one of the boys asked. “Tomorrow we are running short races.” <br/><br/>“I’ll be in the classroom tomorrow.” Daisy Zane resumed her usual demeanor, as if the person sprinting on the playground wasn’t her. <br/><br/>“That’s a shame.” <br/><br/>A few boys chatted casually with Daisy Zane while walking towards the cafeteria. <br/><br/>Celeste Martin walked beside Serena Buster and saw that none of the boys looked at her even once, as if treating them like air. Her heart felt choked like a block of stone, unable to breathe. <br/><br/>It was just brute strength and being able to run. <br/><br/>What was there to be proud of? It wasn’t an elegant sport, but it could still be shown off. <br/><br/>Working in the countryside, one’s physical strength improves, but it’s not something to treasure. <br/><br/>Daisy Zane didn’t talk much, but she still responded to the questions. <br/><br/>Moreover, she talked about some useful things that were helpful to them. <br/><br/>The boys kept talking to Daisy Zane until they reached the cafeteria before reluctantly parting to eat. <br/><br/>“Daisy Zane, how do you know everything?” Serena Buster suddenly said. <br/><br/>Hearing her words, Celeste Martin muttered in her heart. So what if she knew? It’s all not good stuff anyway. <br/><br/>“I have some understanding.” <br/><br/>After she finished speaking, her cell phone rang in her pocket. <br/><br/>It was a call from Olivia Lane. <br/><br/>She answered the phone, “What’s wrong, little girl?” <br/><br/>Watching her eat one piece of radish, Olivia asked, “Do you eat white radish?” <br/><br/>Daisy Zane looked at her, saw her surprised expression, and hesitated, “Do I... not eat white radish?” <br/><br/>“You...” Olivia’s words reached her mouth, but she quickly swallowed them back, “It’s nothing.” <br/><br/>She might still be a little sleepy and confused. <br/><br/>“Why, don’t you like it?” Daisy asked, “It’s not good to be picky.” <br/><br/>“Mind your own business.” Olivia poked at the pan-fried buns in front of her a few times. <br/><br/>Although they brought a lot of breakfast, it was eventually eaten almost completely. <br/><br/>Olivia Lane was already full and just watched Daisy Zane seemingly eating slowly but actually quite fast, consuming a lot of food. <br/><br/>How could she maintain her figure eating this much? <br/><br/>What they both didn’t know was that early this morning, both William Lane and Allonzo Hobson found out what Daisy Zane liked to eat. <br/><br/>As for why they didn’t ask Kevin Clark, it was because William Lane felt that due to Kevin Clark’s inexplicable hostility towards him, he wouldn’t tell him. <br/><br/>Among the four of them, except for Kevin Clark, Allonzo Hobson was the one who had the most contact with Daisy Zane. <br/><br/>However, Allonzo Hobson told him that his sister Lucia could eat anything and everything. The only requirement was to prepare more. <br/><br/>He was a bit surprised and suddenly felt Allonzo Hobson’s words were not very reliable. After all, preparing too much for a girl could also be seen as impolite. <br/><br/>So, he asked Hugo Clark. <br/><br/>As a result, Hugo Clark said that it should be prepared twice the amount of Olivia’s portion. <br/><br/>But in the end, what was sent from home was much more than twice the amount. <br/><br/>However, Daisy Zane almost ate all of it, because it was indeed delicious. <br/><br/>She had tried every dish, but each one tasted different from what was available outside. <br/><br/>And all this was arranged by William Lane on the way. <br/><br/>It wasn’t until past eight o’clock that he arrived at the place where Old Master Lane lived in Oxford City. <br/><br/>Due to its geographical location, Oxford City has a great climate, which is very suitable for the elderly. <br/><br/>Old Master Lane purposely moved to the countryside to slow down his life’s rhythm. <br/><br/>The car stopped in front of the courtyard. <br/><br/>The courtyard was very spacious. As far as the eye could see, there were various fruit trees and flowers. <br/><br/>Usually, the servants took good care of the place in an exquisite manner. Not only did they ensure the growth of the fruits, but they also maintained the aesthetic appeal and artistic sense of the fruit trees. <br/><br/>With various flowers interspersed among the trees. <br/><br/>Upon entering this place, one had a feeling of entering a fairyland. <br/><br/>Regardless of the different scenery since his last visit, William Lane had no mood to enjoy the view. Instead, he went straight into the house. <br/><br/>He had not slept all night, a trace of fatigue on his face, but his mind was clear. He wanted to see Old Master Lane immediately and talk to him.\t\t\t\t\t\t</div>", "images": {}, "success": true}