{"id": 317, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391117.html", "title": "Chapter 317 - 293: Delivering Medicine", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 317 - 293: Delivering Medicine</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 317: Chapter 293: Delivering Medicine<br/><br/>Translator: 549690339<br/><br/>Both experiments were relatively simple for Daisy Zane, so she left Imperial Capital University just after four o’clock.<br/><br/>James Collins was still waiting for her outside.<br/><br/>Once she got in the car, she opened her computer and started writing the experiment report.<br/><br/>James didn’t disturb her and quietly drove the car.<br/><br/>When they reached the outside wall of Gathering Joy Private School, Daisy not only sent the report to her assistant, but also sent the questions for the Celestial Pivot assessment to Holt Lawrence.<br/><br/>“Sister, shall I pick you up this afternoon?”<br/><br/>“No need, the program team will send me back.” Daisy put her computer aside, “Go back, I’m leaving.”<br/><br/>“Okay.”<br/><br/>Daisy climbed over the wall into the school, and after reaching the dormitory building, she climbed up to the third floor and jumped into the restroom.<br/><br/>Unnoticed, she returned to the dormitory.<br/><br/>And she even slept for more than an hour.<br/><br/>Today was Friday, the eight of them returned to their respective classrooms for class.<br/><br/>Since experiencing the life of senior three in high school, Daisy also experienced the act of dozing off during class.<br/><br/>Morning self-study was fine as everyone was doing their own thing, like writing papers or reciting books.<br/><br/>But during the later classes, as soon as the teacher started lecturing, Daisy’s consciousness would involuntarily sink.<br/><br/>She felt that she wouldn’t be this sleepy even if she didn’t sleep for two consecutive days.<br/><br/>As expected the classroom was a magical place.<br/><br/>It rained in the morning, so there was no exercise during the long break.<br/><br/>Daisy took advantage of this time and immediately took a nap on the desk.<br/><br/>Marsh Turner came with a basketball, but Olivia Lane glared at him just after he slapped it: “Keep it down.”<br/><br/>Marsh immediately held the ball in his hand, looked at Daisy, and then looked at Olivia: “What happened to Daisy’s hand?”<br/><br/>Daisy was lying on her right arm, with her left hand on the back of her neck.<br/><br/>“I fell.”<br/><br/>Marsh moved a chair, gently placed it beside Olivia, sat down and whispered, “Is it serious?”<br/><br/>“It’s swollen,” Olivia said, “Why do you have so many questions?”<br/><br/>“I’m just concerned.”<br/><br/>Olivia looked at him, suddenly narrowed her eyes: “Marsh Turner, what do you want to do?”<br/><br/>“I’m just genuinely concerned.” Marsh’s words sounded candid, but the look in his eyes betrayed him.<br/><br/>A man of such high social status, in the midst of his busy schedule, personally came to deliver pain relief patches to his girlfriend on a rainy day, just to avoid her fingers from hurting.<br/><br/>And he didn’t even meet his girlfriend face to face.<br/><br/>She had to reevaluate her understanding of Kevin Clark.<br/><br/>Her own brother should take note and learn something.<br/><br/>Daisy Zane still ate the food sent by the Lane family all day, and it was even delivered directly to her classroom.<br/><br/>Perhaps Olivia Lane mentioned to her family to cook less; today Daisy Zane didn’t overeat.<br/><br/>As it was Friday, there was no need for evening self-study.<br/><br/>After finishing their classes in the afternoon, they could rest for two days.<br/><br/>The rain didn’t stop all day, and with the parents picking up their children, the entrance was so congested that cars couldn’t even move.<br/><br/>The program team recording the show didn’t leave in a hurry, nor did Olivia Lane, Marsh Turner, or several other students.<br/><br/>So everyone simply chatted in the classroom.<br/><br/>Ever since Turner Daniel left in the morning, he hadn’t returned. The director said he had something at home to take care of.<br/><br/>Everyone chatted in the classroom until an hour later when the traffic jam at the entrance cleared up, and then they left one after another.<br/><br/>Those who were recording the show were taken to a nearby hotel by the program team. They would all have a meal together, review the five days of shooting, and then arrange the next five days of shooting.<br/><br/>When they left, Olivia Lane was still in the classroom. Daisy Zane rubbed her head and asked, “Has anyone from your family come yet?”<br/><br/>“My brother is at the entrance,” answered Olivia Lane, “he’s coming to pick me up.”<br/><br/>“Oh, alright. I’m leaving now.”<br/><br/>Olivia Lane nodded her head. Hesitating for a moment, she said, “Remember to apply the medicine to your arm.”<br/><br/>“Okay.”<br/><br/>From upstairs, the rain didn’t seem that heavy.<br/><br/>But when they reached the first floor lobby, the first thing that greeted them was a wave of dampness, followed by a layer of water on the ground. Raindrops splashed, creating small droplets of water.<br/><br/>Daisy Zane followed the other six people, opening her umbrella as she reached the entrance.<br/><br/>As she opened her umbrella and just as it covered her head, William Lane entered the school building with his umbrella.<br/><br/>The two brushed past each other.<br/><br/>All Daisy Zane saw were a pair of legs wearing dress pants. During normal times, she might have been curious about the person’s face and looked up, but today’s damp weather annoyed her, so she didn’t pay much attention. With one hand in her pocket and the other holding the umbrella, she just left straight away.<br/><br/>As soon as William Lane stepped inside the school building, he suddenly stopped.<br/><br/>Then, as if possessed, he turned to look back.<br/><br/>But apart from seeing some people in raincoats carrying video cameras, he only saw students in school uniforms holding umbrellas through the gaps between them.<br/><br/>He didn’t know why he turned back, nor what he hoped to see.<br/><br/>He furrowed his brow, closed his umbrella, and entered the school building.\t\t\t\t\t\t</div>", "images": {}, "success": true}