{"id": 314, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391105.html", "title": "Chapter 314 - 290: Return To The Imperial Capital", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 314 - 290: Return To The Imperial Capital</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 314: Chapter 290: Return to the Imperial Capital <br/><br/>Translator: 549690339 <br/><br/>The dwelling of Old Master Lane was a single-story house in the front courtyard. <br/><br/>When William Lane arrived, the Old Master was feeding birds on the porch. Hearing footsteps, he turned his head to the back. <br/><br/>After seeing the exhausted and self-blaming expression in William’s eyes, he put down the spoon, placed his left hand behind him, and rubbed the longevity lock in his hand. <br/><br/>“Grandfather,” William called as he walked to the porch. <br/><br/>Old Master Lane was dressed in a Tang-style suit. Over eighty years old, his hair was completely white, but he stood tall and appeared quite spirited. He looked at William, his expression and voice calm and steady throughout, “When did you come back?” <br/><br/>“Arrived in the Imperial Capital last night.” <br/><br/>“Didn’t sleep a wink?” asked Old Master Lane. <br/><br/>“Mm.” <br/><br/>The old man glanced at him and walked toward the room. It seemed he deliberately avoided giving any bad news, so he specifically asked, “Did Olivia get into trouble again?” <br/><br/>William followed him, “Henry Clark returned to the Imperial Capital. Kidnapped Olivia.” <br/><br/>Old Master glanced back at him, and it seemed as if a hurricane had swept through his eyes, but they quickly returned to calm, “How’s Olivia?” <br/><br/>“She’s fine. Arthur’s girlfriend was recording a show at her school.” William said, “She rescued her just in time.” <br/><br/>Old Master Lane felt relieved, sat in the Spring and Autumn chair, and looked at William. “Arthur’s girlfriend? Does Arthur have a girlfriend now?” <br/><br/>“For almost a year now.” <br/><br/>Old Master Lane stroked the longevity lock in his hand for a long while without speaking. After a while, he sighed softly, “I always thought Arthur would be my grandson-in-law.” <br/><br/>William looked at the longevity lock without speaking. <br/><br/>“Charlotte... she liked Arthur so much.” <br/><br/>William fell into recollection, silent for a while, with the corners of his mouth turning up, “When she was one year old, the moment she got into Arthur’s arms, she kissed him with a face full of drool.” <br/><br/>Old Master Lane also smiled and said, “She really enjoyed spending time with Arthur. If she saw him and wasn’t embraced by him, she would cry endlessly.” <br/><br/>“Arthur took advantage of his good looks, despite hating children, he would carry her around all day.” <br/><br/>“Olivia is also nineteen, and in a few years, she will be of marriageable age.” Old Master Lane said, “While she is still at home, spend more time with her.” <br/><br/>William returning to the Imperial Capital meant that people would remain in F Continent, still looking for Charlotte. But with William coming back, it was like announcing a piece of bad news to everyone. <br/><br/>Charlotte couldn’t be found. <br/><br/>She disappeared forever. <br/><br/>Perhaps she was no more... <br/><br/>“Grandfather, I’m sorry,” William said in a muffled voice. <br/><br/>Old Master Lane sighed softly, “Perhaps our fate as grandfather and granddaughter, father and daughter, mother and daughter, brother and sister, and sisters with Charlotte lasted only for those few years. There is nothing to be sorry for. In these ten years, while you were in F Continent, you still managed the family business. You’re the one who’s the most tired.” <br/><br/>“It’s me who lost Charlotte.” <br/><br/>“It’s not you,” said the Old Master. “No one expected the attack, it couldn’t be helped. It’s not your fault.” <br/><br/>William couldn’t let go of his two younger sisters. But, Charlotte had been missing for ten years without any news. Whereas, Olivia had been living in the shadows, immersed in guilt. <br/><br/>So, Old Master Lane made this decision for him. <br/><br/>After all... it had been ten years. <br/><br/>In that area of the sea... a person falling could simply vanish without a trace. It was entirely possible. <br/><br/>Not being able to find her for ten years, the chances of survival were slim. <br/><br/>William stayed with Old Master Lane until noon before leaving. While he was there, the old man seemed quite normal. <br/><br/>As soon as he left, the Old Master got up from the chair, feeling dizzy and unsteady on his feet, almost falling down. <br/><br/>Fortunately, the housekeeper was close by and supported him in time, “Old Master, are you feeling unwell?” <br/><br/>Old Master Lane sat back down in the chair, waved off the housekeeper with a gesture and said, “It’s fine, it’s fine. Just need a little rest, I’ll be alright.” <br/><br/>“This won’t do,” the housekeeper looked at the nearby servant, “Go to the backyard and call the doctor.” <br/><br/>Old Master Lane tightly clutched the longevity lock in his hand, closed his eyes, leaned back in the chair, and said in a deep voice, “It’s nothing, it’s nothing. Perhaps my blood pressure is a little high, but it’s not a big problem. I’ll just rest for a while.” <br/><br/>He hadn’t found his Charlotte yet, hadn’t found her yet. <br/><br/>He couldn’t let anything happen to him...\t\t\t\t\t\t</div>", "images": {}, "success": true}