{"id": 318, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391121.html", "title": "Chapter 318 - 294: Stepping On You And Soaking You Wet", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 318 - 294: Stepping On You And Soaking You Wet</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 318: Chapter 294: Stepping on You and Soaking You Wet<br/><br/>Translator: 549690339<br/><br/>Daisy Zane had a light meal with the program team at the hotel, sitting with them until the dinner ended.<br/><br/>She didn’t talk much, nor did she participate much, mostly just listening quietly.<br/><br/>When someone offered her a drink, she took the wine glass and had a sip.<br/><br/>She was very low-key, but sitting there, it was hard for others to ignore her presence.<br/><br/>More than an hour later, everyone dispersed and went their separate ways back home.<br/><br/>The rain was still falling.<br/><br/>A few people left the private room, and Daisy Zane, still walking at a slow pace, followed behind them, with George Dunn and Serena Buster accompanying her.<br/><br/>Celeste Martin was chatting happily with others and a few directors ahead of them.<br/><br/>When they reached the grand hall, Celeste, who was laughing and talking with Director Nash, happened to glance at the sofa in the lobby. She suddenly stopped in her tracks, her words halted.<br/><br/>Then she stared blankly at the direction of the sofa in the grand hall.<br/><br/>Seeing her unusual expression, Director Nash followed her gaze.<br/><br/>He saw Kevin Clark sitting on a sofa in the grand hall, dressed in a black suit and shirt. He sat cross-legged on the sofa, with a laptop on his thighs, looking intently at the computer screen.<br/><br/>The faint light from the laptop reflected on his face, making his features appear even more mysterious and enchanting. His skin also had a slight reflection.<br/><br/>Michael Jackson was sitting on another sofa, seeing them come out, he promptly stood up and walked over to Kevin, whispering something to him.<br/><br/>Then Kevin raised his head, his eyes moving from Director Nash and the others, eventually settling on Daisy Zane. His sharp gaze softened instantly.<br/><br/>Daisy was still wearing her school uniform, which made her look both obedient and cute in Kevin’s eyes.<br/><br/>He closed his computer, handed it to Michael, then picked up his coat and walked towards them.<br/><br/>After a brief pause, Director Nash quickly reacted, leading the group of people forward and respectfully greeted, “Third Master.”Điscover new chapters at novelhall.com<br/><br/>Kevin glanced at Director Nash, nodded, and looked at Daisy Zane again.<br/><br/>Daisy also glanced at him, then walked over to his side while replying to Holt Lawrence’s message.<br/><br/>Holt Lawrence: [Is the question you used for the exam too difficult? I spent the whole day trying, but still could not solve the final one. Don’t you want to let Celestial Pivot select people?!]<br/><br/>Daisy Zane: [Isn’t it just for the sake of my reputation?]<br/><br/>Holt Lawrence: [But there’s no need to make it that difficult, right?]<br/><br/>Daisy Zane: [You should just step down.]<br/><br/>Out of everyone in the grand hall, only Daisy Zane was still sending messages with her head down.<br/><br/>The others, besides the ones who had met Kevin or knew of his identity, stood there looking dazedly at the incredibly distinguished and noble man before them.<br/><br/>Kevin Clark took the umbrella and walked out with Daisy Zane.<br/><br/>On the oil-paper umbrella was ink bamboo paintings, raindrops hit the surface, making a light sound.<br/><br/>Daisy Zane looked up at the umbrella and then turned her head to look at Kevin Clark.<br/><br/>The surrounding lights were blurred by a layer of mist due to the rain.<br/><br/>Kevin Clark, holding the umbrella, looked like a crossing-century gentleman who walked out of a painting, both bewitching and elegant.<br/><br/>Because of the high humidity due to the rain and an entire sleepless night, Daisy Zane’s mood had been somewhat low, but now she suddenly felt much better.<br/><br/>Rainwater splashed a bit on her ankle. Daisy Zane lowered her eyes and saw a slightly lower spot near where the car stopped, where some water had accumulated.<br/><br/>As she approached, Daisy Zane looked up and called out, “Kevin Clark.”<br/><br/>Kevin Clark looked down.<br/><br/>The next second, Daisy Zane stepped into the water at the low spot.<br/><br/>Water splashed, all over both their legs.<br/><br/>The black suit pants on Kevin Clark were not obvious, but Daisy Zane’s blue school uniform pants were clearly wet quite a bit.<br/><br/>Michael Jackson walked to the side of the car, waiting to open the door for them. Seeing this, his heart suddenly twitched, and he subconsciously thought that Third Master would be angry.<br/><br/>Kevin Clark saw that her pants and shoes were wet, his brow furrowed slightly. But after seeing the laughter in her eyes, his brows relaxed.<br/><br/>He pinched her face: “You’re so naughty.”<br/><br/>The breath Michael Jackson was holding was relieved. He forgot that the person who stepped on the water was the future Madam, and Third Master didn’t dare to get angry.<br/><br/>Daisy Zane raised her eyebrows but didn’t speak, continuing to walk forward.<br/><br/>Kevin Clark immediately caught up, and Michael Jackson hurriedly opened the car door.<br/><br/>After getting in the car, Kevin Clark took several tissues and leaned down to wipe the water off Daisy Zane’s ankles: “Did the water get into your shoes?”<br/><br/>“No.”<br/><br/>“Really?”<br/><br/>“Yes.”<br/><br/>After wiping, Kevin Clark held her ankle with his hand. Fortunately, it wasn’t too cold. He sat upright and looked at her: “Go to the Rose Garden?”<br/><br/>The Rose Garden was the villa Kevin Clark took Daisy Zane to last time.<br/><br/>Michael Jackson’s eyes widened abruptly.<br/><br/>What were they going there for? A man and a woman alone, without parents, without children. What did they want?<br/><br/>Daisy Zane stared at him, her scrutinizing gaze not hidden at all.<br/><br/>Kevin Clark supported her chin with the tiger’s mouth and kissed her lips, smiling, “What are you thinking? Your pant leg is wet, it’s close. Better not to catch a cold.”\t\t\t\t\t\t</div>", "images": {}, "success": true}