{"id": 328, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391161.html", "title": "Chapter 328: 304: The Elder", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 328: 304: The Elder</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 328: 304: The Elder<br/><br/>Translator: 549690339<br/><br/>Hearing this news, Kevin Clark was at a loss for his feelings for a moment.<br/><br/>Back then, the little girl kept calling him “Brother Arthur” and always wanted him to hold her. He hadn’t even held his own niece before.<br/><br/>But he would hold her while eating at the table.<br/><br/>He really thought of her as his own sister.<br/><br/>Everyone used to search for her, but now, all of a sudden<br/><br/>“Is Uncle Lane alright?”<br/><br/>“He’s fine.” William Lane replied, “His blood pressure just suddenly went up a bit. A doctor is with him.”<br/><br/>Kevin Clark stayed silent for a while and didn’t say anything else.<br/><br/>After all, he was just an outsider, and the people who were suffering the most were the Lane family.<br/><br/>“Well, let me welcome you on behalf of the Research Institute first.”<br/><br/>William Lane chuckled.T/his chapter is updated by nov(ê(l)biin.co/m<br/><br/>“Dean Yue is hospitalized and very busy recently,” Kevin Clark said, “Take a couple of days to get used to everything, and then you can help me share the work.”<br/><br/>“Alright. I’m just free anyway.”<br/><br/>When Daisy Zane arrived at Senior Three Class Sixteen, there were 5 minutes left before the morning self-study. She greeted Skyler Thomas and took a seat.<br/><br/>The other people involved in recording the show were there as well, and Turner Daniels had returned too.<br/><br/>As soon as Daisy Zane sat down, Turner Daniels placed his milk tea on her desk, “Daisy, it’s hot.”<br/><br/>Daisy Zane glanced at the milk tea and said, “Thank you.”<br/><br/>Turner Daniels smiled, shook his head, and returned to his seat.<br/><br/>The moment the morning self-study bell rang, Olivia Lane walked in, right on time.<br/><br/>Skyler Thomas had an emotionless expression while watching her.<br/><br/>Olivia Lane glared back at her, then walked at her leisurely pace to her seat.<br/><br/>As she walked over, Daisy Zane looked at her and immediately noticed her swollen eyes.<br/><br/>And she also saw her wilting, obviously in a bad mood.<br/><br/>After Olivia Lane sat down, Daisy Zane asked, “Little girl, have you been crying?”<br/><br/>“You’re the one who’s been crying!” Olivia Lane glared at her and said, “This is from drinking too much water last night.”<br/><br/>Daisy Zane raised an eyebrow but didn’t say anything else.<br/><br/>Olivia Lane was silent for a moment, then looked at Daisy’s hand and asked, “How’s your hand?”<br/><br/>The news on the internet was withdrawn so quickly that it must have been Kevin Clark who intervened.<br/><br/>Did Kevin find out about her? But she used a black card.<br/><br/>And even if she was caught, how come no one had come after her in two days?<br/><br/>Celeste kept comforting herself not to scare herself, and she had to hold on and stay steady. But thinking this way, her face still turned pale.<br/><br/>Seeing the situation, George immediately pulled Daisy Zane’s clothes from under the table.<br/><br/>This part would definitely be cut out, so the videography was not a big issue. There were just many students around, and it wasn’t good for this scene to be seen.<br/><br/>Daisy Zane wouldn’t cause a scene, so when she felt George tugging on her clothes, she looked down and continued to peel the egg in her hand.<br/><br/>Seeing this, the director group found an excuse and said they had something to discuss with Celeste, and asked her to leave.<br/><br/>Celeste couldn’t stand Daisy Zane’s gaze at all, so she hurried away as soon as the director called her.<br/><br/>As soon as she left, George Dunn smiled and asked, “Did she annoy you?”<br/><br/>Daisy Zane didn’t say anything, but took a bite of the egg and chewed slowly.<br/><br/>Turner Daniel soon came back, and he put the glass next to Daisy Zane.<br/><br/>Daisy Zane thanked him, finishing the last bite of the egg and starting to tear the medicine packet.<br/><br/>“Where’s Celeste?” Turner Daniel asked.<br/><br/>“She was called away by the director. It seemed like there was an issue,” George chatted casually, “I thought you weren’t coming back after you left last week.”<br/><br/>“No, my grandpa had an accident. I went to M Continent.” Turner Daniel rested his cheek on his hand, his face still showing the innocence of a teenager in his teens, but his eyes were mature, “But after recording this show, I might quit the circle.”<br/><br/>“Is it serious?” George Dunn frowned, subconsciously feeling that his grandfather’s accident must have been major.<br/><br/>“It’s not serious for my grandfather. He broke his leg. It’s just that he’s getting old and needs some time to recover.”<br/><br/>George, from a wealthy family himself, could understand his mindset.<br/><br/>When someone took care of their family matters, they could indulge outside and do what they liked.<br/><br/>But when something happened at home that they needed to take responsibility for, they had to put aside their external affairs.<br/><br/>Apparently, Turner Daniel had to return home to take over the family business at a young age.<br/><br/>Upon hearing the words M Continent, accident, broken leg, and old age, Daisy Zane immediately thought of three characters in her mind.<br/><br/>Ezekiel Santiago.<br/><br/>Same surname<br/><br/>This Turner Daniel is he Dean Yue’s grandson?<br/><br/>As Daisy Zane thought about it, she glanced at Turner Daniel and then raised her eyebrows.<br/><br/>She was a generation older than him.\t\t\t\t\t\t</div>", "images": {}, "success": true}