{"id": 321, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391133.html", "title": "Chapter 321 - 297: Got Beaten Up", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 321 - 297: Got Beaten Up</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 321: Chapter 297: Got Beaten Up <br/><br/>Translator: 549690339 <br/><br/>Elina Clark was over eighty this year, a rather progressive little old man, who could keep up with the young people’s mindset. <br/><br/>However, he was very strict about the family rules of the Clark Family. <br/><br/>In fact, there were not even five family rules, all of which were constraints on major ethical behaviors. <br/><br/>These were the behavioral ethics standards that children would learn from a young age. <br/><br/>Any normal person wouldn’t violate them. Th.ê most uptodate novels are published on n(0)velbj)n(.)co/m<br/><br/>Take the first one, the prohibition of infighting within the family. <br/><br/>Elina Clark was very strict about this rule, perhaps due to the influence of the old times. His grandfather and father had adhered to it, so he has always subconsciously believed that any violation would bring retribution, a negative karma. <br/><br/>Naturally, he knew that Henry Clark had to be overthrown given the current situation, but he did not want to see the person taking action be Kevin Clark, or anyone from the Clark Family. <br/><br/>“Release him quickly.” Elina Clark stated, “I don’t care what others do, but it definitely can’t be you.” <br/><br/>Kevin Clark understood his father’s thinking, and considering that his father was an old man, trying to change his ingrained thoughts was hardly possible: “Dad, I’ve already done it, I won’t let him go now.” <br/><br/>Elina Clark didn’t expect him to refuse, he stood up and looked at him: “Kevin Clark, say it again for me.” <br/><br/>Seeing this, Calvin Stewart grabbed Theo Clark’s hand. <br/><br/>Theo Clark had been watching them all along, but when his father got angry, he dared not speak up. He understood that the more he tried to persuade, the angrier his father would get. <br/><br/>Natalie Wayne didn’t interrupt at this time either, just quietly watching from the side. <br/><br/>“Dad, over twenty years ago, Henry Clark threw Hugo Clark into the swimming pool and he almost drowned.” Kevin Clark said softly, “He has lived for these twenty years due to the protection of our ancestors. But this time our ancestors can’t protect him.” <br/><br/>Kevin Clark’s voice had just stopped when suddenly, a slap sounded again in the living room. <br/><br/>Everyone was stunned as Elina Clark sharply slapped Kevin Clark on the face. <br/><br/>Kevin Clark was hit so hard that his head turned to the side, and he staggered to the side a little. <br/><br/>Elina Clark lost his support and due to the inertia, staggered as well. <br/><br/>Natalie Wayne immediately stood up, supporting him, and at the same time held him back: “Brother Louis.” <br/><br/>Calvin Stewart felt a heartache and his eyes instantly turned red, he stood up. <br/><br/>Theo Clark also immediately walked to Elina Clark’s side, supporting his other hand: “Dad.” <br/><br/>Hugo Clark also stood up, but dared not to get closer. Hardy Clark hid directly behind Hugo Clark. <br/><br/>Upon reaching the parking lot, the elevator door opened, and Daisy Zane saw Kevin Clark standing at the elevator entrance. <br/><br/>She squinted her eyes when she saw Kevin Clark’s somewhat reddened face and split lips. <br/><br/>Kevin Clark’s skin reddened easily. Sometimes, when she tightly held his wrist, there would be reddish marks on it. But it wouldn’t swell up easily. <br/><br/>Last time when his palm was badly injured, only the area around the wound swelled slightly. <br/><br/>Kevin Clark took her hand, grabbed the medicine from her hand, and led her towards the car. “Who told you? Someone’s a real whistleblower, they told you in such a short time.” <br/><br/>“Your father is quite ruthless.” Daisy Zane’s voice was somewhat bleak. <br/><br/>“He was furious,” explained Kevin Clark, “and it doesn’t hurt.” <br/><br/>Daisy Zane kept silent and got in the car with him. <br/><br/>Both of them sat in the back seat. Daisy Zane opened the bottle of alcohol, preparing to disinfect his wound. In a soft voice, she asked, “Henry Clark kidnapped Olivia Lane, why didn’t you use the Lane Family?” <br/><br/>Kevin Clark knew what Daisy Zane was thinking about, so he looked at her without speaking. <br/><br/>“Because of me?” <br/><br/>Kevin Clark pinched her chin and kissed her lip, “The debt of injuring you, I’m going to make him pay no matter what.” <br/><br/>“You’re disregarding family rules?” <br/><br/>“My father is getting older, not only does he overly follow routines, he’s also indecisive. If he were my age, he wouldn’t hesitate so much, Henry Clark wouldn’t have stayed alive till now, and he wouldn’t have laid hands on me today.” <br/><br/>Right after Kevin Clark finished speaking, he was about to lean in and kiss her again. But Daisy Zane put the cotton swab soaked in alcohol at the corner of his mouth. <br/><br/>Kevin Clark involuntarily frowned, then laughed, “Little Girl, you seem to have a bit of a personal grudge there.” <br/><br/>Daisy Zane glanced at him and lightened her movements, “You can let Henry Clark go. I’d catch him later.” <br/><br/>Kevin Clark chuckled, “I see, my Little Girl came here to mediate. My family actually bribed my girlfriend.” <br/><br/>“I came here to watch the fun.” Daisy Zane dabbed some medicine on the corner of his mouth and said softly, “If I may ask, Third Master, how does it feel to be hit for the first time at the age of 29?” <br/><br/>“I guess my life seems complete now.” Kevin Clark joked, “It makes up for the regret of my childhood.” <br/><br/>“You had quite the regret of not being hit as a child.” <br/><br/>“Not anymore.” Kevin Clark held her waist and pulled her into his arms. “Even though the old Clark is over eighty, his punch is still so powerful. It must have hurt a lot when he was young. No wonder my elder brother, event at an age of over fifty, dares not to make a peep when he sees my father get angry.” <br/><br/>Daisy Zane gently touched his reddened cheek with her thumb, leaned on his shoulder, and after a while, she said, “If you don’t let Henry Clark go, how will you explain it to your father?” <br/><br/>“He has already vented his anger by hitting me. I’ll bring Charles Amos over tomorrow to cheer him up.” <br/><br/>Daisy Zane: ” ” So, Charles Amos is brought to pacify the mood.\t\t\t\t\t\t</div>", "images": {}, "success": true}