{"id": 326, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391153.html", "title": "Chapter 326: 302: Will Find It", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 326: 302: Will Find It</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 326: 302: Will Find It<br/><br/>Translator: 549690339<br/><br/>The handwriting doesn’t match.<br/><br/>The handwriting doesn’t match<br/><br/>After knowing this result, Olivia Lane sat in the chair, feeling as if she could not feel her heart for a moment.<br/><br/>It seemed suddenly blank, confused, and helpless.<br/><br/>The handwriting doesn’t match.<br/><br/>After a while, Olivia Lane’s dull gaze moved to the photo frame on the desk.<br/><br/>There is a photo in the frame, taken when Charlotte Lane was twelve years old on her birthday.<br/><br/>Later, when Charlotte went missing, her mother put the photo on the desk.<br/><br/>The person in the photo had black hair over her shoulders. She had monolid eyes, which gave the impression of Phoenix eyes. Her face had some baby fat, and when she smiled, her eyes were slightly bent.<br/><br/>She was very beautiful and cute.<br/><br/>The glint in her eyes was as brilliant as crystal.<br/><br/>Just from a photo, one could feel her contentment from being surrounded by love and adoration.<br/><br/>As Olivia Lane looked at the picture, she reached out and gently touched the frame.<br/><br/>How could the handwriting match? She must have gone mad, thinking that Daisy Zane’s handwriting and her sister’s would match.<br/><br/>They were clearly two different people, completely unrelated.<br/><br/>There was no similarity to their appearance whatsoever.<br/><br/>Daisy Zane’s eyes were clearly double-lidded, although the double lids were thin.<br/><br/>Besides that, their noses, mouths, and facial shapes had no resemblance at all.<br/><br/>Moreover, Daisy Zane was from the Truro Song Family, and she had tested DNA with her biological father.<br/><br/>Although she couldn’t understand why she came from Cold Green Village with so much knowledge and even saved her from being attacked by hundreds of people.<br/><br/>But she was indeed a person with a blood relationship to the Song family.<br/><br/>Why was she always fixated on unrealistic ideas?<br/><br/>Thinking like this, Olivia Lane hooked the corner of her lips. But while her face smiled, tears fell from her eyes.<br/><br/>However, he didn’t say it since she seemed so happy.<br/><br/>Olivia looked at him, her pupils gradually dilating, her eyebrows furrowing bit by bit, and finally laughed, “Wh-what do you mean not going back to F Continent?”<br/><br/>William looked at her expression, taking a light breath to make his voice sound more normal, “From now on, your brother will stay in Imperial Capital with you, okay?”<br/><br/>“Stay with me? Why stay with me?” Olivia’s lips trembled, “I-I’m grown up now; I don’t need you to stay with me.”<br/><br/>“Olivia ”<br/><br/>“Brother, I really grew up. I won’t cause trouble anymore, and I will study well at school.” Olivia grasped his sleeve, tears welling up in her eyes, “Next June, I will go to university, and I won’t take a break from school.”<br/><br/>“Olivia, I have already discussed this with grandfather and our parents.” William looked at the tears in her eyes and said softly, “This is the decision we made after discussing it.”<br/><br/>Olivia’s tears fell on his hand.<br/><br/>After the first tear, the others followed like a string of pearls, falling down one by one.<br/><br/>“Olivia ”<br/><br/>“Sister is still in F Continent, how could you all decide to withdraw?” Olivia cried, “What if she wants to come back but can’t find anyone from our family in F Continent? What if she appears in F Continent tomorrow? What if you aren’t there, and no one can recognize her?”<br/><br/>Olivia completely forgot the bunch of excuses she had thought up just moments ago, and she also forgot how she deliberately said they were biased, urging them to return from F Continent.<br/><br/>William wiped her tears, and his own eyes gradually reddened, “Olivia ”<br/><br/>His words stopped at his lips, and instead, he said, “The people in F Continent haven’t retreated; it’s just brother who has come back.”<br/><br/>Olivia was not foolish; when he withdrew, it didn’t matter if there were people in F Continent or not. It was the same thing.<br/><br/>“How could we leave sister alone there? How could we leave her alone there? Why did we stop searching? How could we stop searching?” Olivia cried so hard her throat wouldn’t make a sound, so she spoke even harder.<br/><br/>William was so heartbroken that he lost his voice too. He stood up and held Olivia in his embrace, gently patting her back.<br/><br/>Olivia buried her face in his chest, crying as if she were suffocating, “Sister, why won’t she come back? How can she not come back?”<br/><br/>William patted her back, not making a sound.<br/><br/>After a while, Olivia’s hand lightly tapped his waist twice, “Why did we stop searching? Why did we stop searching? Grandfather loves sister so much, how could he agree? We’ll definitely find her; we will find her!”<br/><br/>William’s hand, holding Olivia, trembled slightly. He blinked, forcing back his tears.<br/><br/>He mechanically repeated the words in his head.<br/><br/>We will find her.<br/><br/>We will find her.\t\t\t\t\t\t</div>", "images": {}, "success": true}