{"id": 324, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391145.html", "title": "Chapter 324: 300: I’Ve Always Been Here", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 324: 300: I’Ve Always Been Here</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 324: 300: I’ve Always Been Here<br/><br/>Translator: 549690339<br/><br/>Kevin Clark and Gael Easton stood face to face, the surrounding air filled with palpable tension and danger. Between them was like a tensed thread, stretched thinner and tighter, on the verge of snapping at any moment.<br/><br/>But Daisy Zane wouldn’t allow the thread to snap.<br/><br/>Once it snapped, both Imperial Capital and M Continent wouldn’t be able to catch a breath.<br/><br/>Though she was curious about who might have the upper hand if both powers were to clash, there was no need to know such things, as curious as she was.<br/><br/>And so Daisy Zane spoke, causing the tension to slacken a bit.<br/><br/>“Are you two going to keep this up until it creates some sentimental value?”<br/><br/>Kevin Clark:<br/><br/>Upon hearing this, Gael Easton immediately averted his gaze and huffed coldly.<br/><br/>Daisy Zane stood next to Kevin Clark, and said to Gael Easton, “If you wish to stay in the Imperial Capital, then behave and stay here for a few days. If not, I can arrange for someone to buy a ticket for you to leave tomorrow.”<br/><br/>“You’re kicking me out!” Gael Easton couldn’t believe it.<br/><br/>“Do you think your status is suitable for a long-term stay here?”<br/><br/>Gael Easton choked a bit and then paused, “Fine, I’ll leave. But you’re coming with me.”<br/><br/>Kevin Clark frowned.<br/><br/>Daisy Zane stared at him.<br/><br/>Gael Easton let out a loud huff, “What the hell do you think you’re doing here? Being a celebrity? Letting the whole world know about you? Have you had enough of your peaceful days?”<br/><br/>“I have my plans.”<br/><br/>“What plans? Planning to return to Edward Kirsten?” Gael Easton glared, chest heaving violently, “For god’s sake the girl from Cold Green Village is already dead. Why are you clinging to a dead person’s dream? Like you don’t even want your own life!”<br/><br/>The nonchalant look on Daisy Zane’s face froze instantly, her complexion going pale. The bottom of her blood-red eyes, like ice that had frozen for many years.<br/><br/>Cold, desolate, and heartbroken.<br/><br/>As if the façade had been ripped apart, revealing the rotten flesh of her heart, bleeding<br/><br/>Seeing this, Kevin Clark immediately grabbed Daisy Zane’s hand, caressing the back of her hand to comfort her.<br/><br/>He hadn’t failed to think that since the little girl had assumed Daisy Zane’s name, either the real Daisy was gone, or she had been hidden away by the little girl.<br/><br/>He had been deliberately avoiding the first possibility.<br/><br/>He had witnessed her inability to cut ties with Cold Green Village.<br/><br/>Seeing her reaction, Gael Easton realized he had spoken too harshly. He looked at Daisy Zane’s demeanor but said nothing.<br/><br/>“Who told you?” Daisy Zane’s voice was hoarse after trying to suppress her emotions.<br/><br/>At this point, any comforting words were superfluous. It was enough for her to know he was there.<br/><br/>Daisy Zane’s eyelashes fluttered slightly. After a moment, she turned around and rested her head on his shoulder.<br/><br/>Kevin Clark slightly tightened his arms, lifting a hand to gently fold around the back of her neck.<br/><br/>The room lights were switched off, only the moonlight outside came into the room.<br/><br/>The two of them hugged. The window curtains fluttered with the night breeze, everything around them was quietly fading.<br/><br/>After a while, Daisy Zane said softly, “Kevin Clark I’m a bit tired.”<br/><br/>Her voice was very low, as if she were whispering. It was like a leaf floating on the water, looking for shore to rest.<br/><br/>Kevin Clark held her tighter, whispered in her ear, “If you’re tired, rest a little. I’m here, always.”<br/><br/>Daisy Zane did not speak, she leaned on him for a while then straightened her body. She took a step back, touching her eyes, “I’m going to take a bath.”<br/><br/>“Alright.”<br/><br/>As Daisy Zane was about to leave, she looked back at him, “Can I borrow half of your bed?”<br/><br/>Kevin Clark raised an eyebrow, “Gael Easton is still outside.”<br/><br/>Daisy Zane understood his meaning. He was protecting her. Even if the person outside was his romantic rival, he did not want to use her reputation to declare any dominance.<br/><br/>A boyfriend is a boyfriend, they hadn’t yet progressed to the level of a husband who shares a bed.<br/><br/>What a considerate gentleman and yet stubborn.<br/><br/>“So what?” Daisy Zane responded.<br/><br/>Kevin Clark looked at her, and after a while, pinched her chin and smiled, “Little girl, you trust me so easily. What if I’m a bad guy? What if I am rubbish?”<br/><br/>“Are you?” Daisy Zane responded.<br/><br/>“Not.” Kevin Clark said, “I can prove it with the rest of my life.”<br/><br/>Daisy Zane raised an eyebrow and stepped toward him. Her eyes displayed strong confrontation. She looked up into Kevin Clark’s, and lightly said, “If you dare to hurt me I’ll ruin you.”<br/><br/>Kevin Clark’s eyes gradually filled with a smile. He raised his hand to her back head, bent down to kiss her for a moment.<br/><br/>Making all her valiant spirit melted away.<br/><br/>After releasing her, he pecked on her lips corner again, Kevin Clark said, “I’ll go to my room to get my pajamas.”<br/><br/>“I have some here.”<br/><br/>“What?” Kevin Clark looked at her suggestively.<br/><br/>Daisy Zane looked back at him and headed to the restroom, “After some people faked drunk and slept here for a night, my room suddenly received many more belongings.”<br/><br/>Kevin Clark:\t\t\t\t\t\t</div>", "images": {}, "success": true}