{"id": 322, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391137.html", "title": "Chapter 322 - 298: Strange Uncle", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 322 - 298: Strange Uncle</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 322: Chapter 298: Strange Uncle <br/><br/>Translator: 549690339 <br/><br/>Clark Manor <br/><br/>After Kevin and the others returned to their Courtyard, Natalie Wayne brought a bowl of calming soup. <br/><br/>When she returned to the bedchamber, Elina Clark was standing on the terrace, looking outside. <br/><br/>Natalie put the calming soup on the round table, walked over to Elina, held her hand, and softly whispered, “Brother Louis.” <br/><br/>Elina immediately held her hand tightly, turned her head to look at her, with some deep, defeated eyes, her voice trembling a bit, “Mimi, I shouldn’t have hit Harton.” <br/><br/>When they were young, Elina always called Natalie “Mimi.” However, as the children grew up, she only used the nickname in private. <br/><br/>Usually, she would be called “Madam.” Reêad latest novels at novelhall.com<br/><br/>“I was just talking about that part.” Natalie said softly. <br/><br/>Elina sighed lightly, holding Natalie in her arms, “I never hit Harton since he was young. This is not his fault, I shouldn’t have laid a hand on him.” <br/><br/>With one hand behind his back, Natalie gently stroked him, “Harton understands.” <br/><br/>“It was my soft-heartedness that let Henry Clark live.” Elina tightened her arms a bit, her head buried in Natalie’s shoulder, “I should have handled it earlier and not caused trouble for the children.” <br/><br/>“Father begged you before his death, to let Henry Clark live no matter what, for his sake.” Natalie Wayne said, “We kept our promise. As for the result, this is what Henry Clark deserves.” <br/><br/>“I was confused. I should have known he would never change. I shouldn’t have left this hidden danger for the children. I’m an old man now, I have lived enough. What family rules, and what retribution? I’d rather have done this myself than having Harton do it.” <br/><br/>“Louis, don’t say that. We thought that the Lane family would handle this matter, but Harton suddenly took action. This is what Henry Clark deserves, and it has nothing to do with anyone else.” <br/><br/>“Mimi, I had Harton at such an old age. The fatherly love he could enjoy is already scarce. Even if I live to be a hundred, I’ll only be a burden to the children later on.” Elina whispered, “I owe him so much, yet I let him bear the consequences of the disaster I left behind. Not only that, but I also hit him.” <br/><br/>“It’s alright, Louis, it’s fine,” Natalie gently patted his back and softly comforted him, “You were just worried. Harton understands. He’s grown up now, and he doesn’t need us to worry about him.” <br/><br/>After chatting for a while at Ryan Easton’s parking lot, Harton sent Daisy Zane home. <br/><br/>He then immediately returned to the Research Institute. <br/><br/>And Daisy Zane stayed up all night organizing the data. <br/><br/>After breakfast the next morning, she went straight to the laboratory at Imperial Capital University. <br/><br/>She kept busy until past three o’clock in the afternoon. When the experiment was finished, and the lost data reorganized, she sent it to the assistant. <br/><br/>Three seconds later, Arthur clenched his jaw and said: “Little girl, are you trying to provoke me on purpose?” <br/><br/>“Did you get provoked?” Daisy looked at him and asked. <br/><br/>Arthur reached out and pinched her face, gritting his teeth: “What do you think?” <br/><br/>Daisy’s eyes were dry and swollen, so she closed them and laughed: “But they’re not as handsome as you.” <br/><br/>Arthur squinted his eyes, touching her face with his hand, and used his thumb under her eyes to gently stroke it: “Then just look at me and not others. Otherwise, I’ll bully you until you cry.” <br/><br/>Daisy raised her eyebrows. <br/><br/>Arthur looked at her eyes and didn’t care about her teasing him anymore: “Is it very uncomfortable?” <br/><br/>“It’s fine.” <br/><br/>“Close your eyes and take a break. I’ll call you when we get there.” <br/><br/>“Mhm.” <br/><br/>By the time they finished eating at Doomsday Hotel and returned to Daisy’s villa, it was almost eleven o’clock. <br/><br/>It would be expected that Charles Amos would have gone to bed by this time, but as they approached the villa, they saw him sitting in front of the entrance, resting his chin on his hand, sitting on a small stool with a troubled expression on his face. <br/><br/>Hearing footsteps, Charles lifted his head and saw the two of them. His eyes lit up, and he immediately ran over to Daisy. <br/><br/>“Why aren’t you sleeping?” Daisy asked him. <br/><br/>It seemed as if Charles suddenly remembered something, sighing and slumping his shoulders. He looked at Arthur and said: “That weird uncle is here.” <br/><br/>Daisy was stunned for a moment. <br/><br/>Arthur tilted his head to look at her. <br/><br/>Charles glanced at Arthur again, complaining with disgust: “He’s in my room eating stinky tofu and forcing me to eat it too.” <br/><br/>It took Daisy a moment to respond: “When did he arrive?” <br/><br/>“Almost an hour ago.” <br/><br/>Daisy looked up at the entrance and then grabbed Charles by the collar, intending to take him with her and leave: “I’ll take you out to stay somewhere for a few days.” <br/><br/>Arthur raised his eyebrows, surprised to see someone that seemed to make the little girl want to avoid them so badly. <br/><br/>Charles grabbed onto Daisy’s sleeve: “But Grandpa Edwards is still inside with him. You should go check on him. Grandpa Edwards must be getting flavored by the stinky tofu by now.” <br/><br/>Daisy:\t\t\t\t\t\t</div>", "images": {}, "success": true}