{"id": 336, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391193.html", "title": "Chapter 336: 312: Vulnerable And Incapable Of Taking Care Of Oneself", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 336: 312: Vulnerable And Incapable Of Taking Care Of Oneself</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 336: 312: Vulnerable and Incapable of Taking Care of Oneself<br/><br/>Translator: 549690339<br/><br/>Even if Daisy Zane didn’t want to get involved in William Butch’s situation, it seemed she had no choice.<br/><br/>After all, she was the one who put him in the position to get beaten twice, and she owed him a favor because of that.<br/><br/>She looked at Daniel Brown then at the people on the ground who had already managed to sit up. Her cold voice was filled with a touch of annoyance, “Get lost.”<br/><br/>Daniel Brown quickly stood up, leaning against the wall, and walked toward the alley exit.<br/><br/>The others on the ground helped each other up and walked out as well.<br/><br/>Marsh Turner glanced at the boys from Class 8. He wanted to say something, but he wasn’t in the mood. So he looked at them and then looked away.<br/><br/>Unexpectedly, the two boys from Class 8 supporting each other, as they approached Daisy Zane suddenly tried to stab her with a spring knife in the back.<br/><br/>As the incident happened so fast, William Butch saw everything and managed to yell out.<br/><br/>Hearing his yell, Marsh Turner finally noticed the spring knife.<br/><br/>But due to the overwhelming shock, he was slow to react physically.<br/><br/>Only Daisy Zane despite facing the opposite direction, was able to turn and grab the hand of the attacker in the instant the spring knife came at her.<br/><br/>Moreover, she used her strength to dislocate his wrist.<br/><br/>The boy screamed in pain, and the spring knife fell to the ground with a clang.<br/><br/>Finally, Marsh Turner reacted and kicked the boy in his ribs, sending him flying.<br/><br/>“James Butch, are you out of your mind?” Marsh Turner cursed.<br/><br/>James Butch lay on the ground, holding his ribs with his left hand, his face pale as he could not speak.<br/><br/>Marsh Turner was about to continue attacking when Daisy Zane held him back. He then stopped and said, “I’m warning you all – if any of you dare to touch anyone in our class again, you better not show your faces in Domestic.”.<br/><br/>Daisy Zane raised an eyebrow.<br/><br/>Marsh Turner said, “Get lost now!”<br/><br/>The other two boys quickly helped James Butch up and left.<br/><br/>When they were all far away, Marsh Turner took a few breaths and walked two steps towards William Butch. He pinched his chin, forcing him to lift his head and look at the injuries on his face.<br/><br/>Daisy Zane pointed her finger at the brim of her hat and looked at William Butch as well.<br/><br/>It seemed like this was the first time she saw William Butch’s face.<br/><br/>Indeed he was quite small.<br/><br/>A pretty young boy, though the injuries on his face somewhat diminished his attractiveness.<br/><br/>“What did I tell you this afternoon? If they hit you again, you have to hit back!” Marsh Turner spoke with a tone of disappointment, “The more you’re like this, the more they’ll bully you. Look at you, all beaten up again. You’re not afraid of getting hit, so why are you afraid to hit back?!”<br/><br/>William Butch freed himself from Marsh’s grip and lowered his head, briefly saying, “Thank you.”<br/><br/>“Thanks for nothing! The day you stop getting hit will be the day you’ve truly thanked me.” Marsh Turner said.<br/><br/>William Butch didn’t say anything more.<br/><br/>Marsh Turner took a deep breath, calmed himself down, and turned to Daisy Zane, asking, “Um this Big Brother? Sister? How should I address you?”<br/><br/>Daisy Zane glanced at him and said nothing.<br/><br/>She told the two of them, “I’m going now, and everything that happened tonight is a secret.” Then she left.<br/><br/>Marsh Turner didn’t react until Daisy Zane had walked away, too overwhelmed by the shock.<br/><br/>It was only when William Butch called him again that he finally came to his senses.<br/><br/>But by then, Daisy Zane had already walked far away.<br/><br/>On the way back to school, Daisy Zane put her hat and mask back on.<br/><br/>When she left the school, she sent a message to Kevin Clark, telling him she was busy and he didn’t need to call her anymore.<br/><br/>Kevin Clark replied: [Okay, call me when you’re done.]<br/><br/>So Daisy Zane walked back while calling him.<br/><br/>The phone rang for a while before it was finally answered.<br/><br/>Daisy Zane asked, “Busy?”<br/><br/>“No.” Kevin Clark spoke warmly, “Where are you? It’s lights out now, right?”<br/><br/>Daisy Zane didn’t hide the truth, and directly replied, “I’ll be back at school in five minutes.”<br/><br/>Kevin Clark: ” You went out?”<br/><br/>“Yes.”<br/><br/>Kevin Clark:<br/><br/>Daisy Zane heard his silent silence and laughed.<br/><br/>“Little girl, I’m a bit unhappy.”<br/><br/>“Hmm?”<br/><br/>“You went out without seeing me.”<br/><br/>Daisy Zane:<br/><br/>“And you definitely met someone else.”<br/><br/>Daisy Zane:<br/><br/>“How about I pick you up, and you don’t go back tonight?” His words sounded like he wanted to make her feel guilty first before making his request.<br/><br/>Unfortunately his plan was exposed, and Daisy Zane didn’t take the bait, even turning the tables, “Not going back Do you want to sleep holding me?”<br/><br/>Kevin Clark suddenly fell silent.<br/><br/>The corner of Daisy Zane’s mouth curled up under the mask, and she spoke casually, “Or do you want to do something else?”<br/><br/>Alluding to something else made Kevin Clark’s breathing heavier.<br/><br/>They both fell silent for two seconds, and Daisy Zane heard footsteps and the sound of an opening door through the phone.<br/><br/>She spoke up in time, “Third Master just think about it. I’m at school now, I’m hanging up.”<br/><br/>With that, she hung up the phone and continued her leisurely walk.<br/><br/>She felt that Kevin Clark had seriously considered coming to pick her up just now.<br/><br/>Kevin Clark’s message came through quickly, and she could feel the fierceness in the words even through the screen: [Little girl. Just a reminder, it’s best to cancel all plans for next week.]<br/><br/>Looking at the message, Daisy Zane raised her eyebrows, thinking: Why should I cancel all of my plans?\t\t\t\t\t\t</div>", "images": {}, "success": true}