{"id": 338, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391201.html", "title": "Chapter 338 - 314 The Hobson Family Gets Involved", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 338 - 314 The Hobson Family Gets Involved</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 338: Chapter 314 The Hobson Family Gets Involved <br/><br/>Translator: 549690339 <br/><br/>Director Nash was watching the class through the monitor and was initially a bit confused. <br/><br/>However, seeing so many students suddenly stand up, he quickly grabbed the walkie-talkie and said, “Pause the recording of Class 16’s program, turn off the video equipment, and turn off everyone’s mics.” <br/><br/>The shooting director, who was outside the corridor, heard this and stepped back, asking, “Turn them all off? Should we leave one on to record the evidence?” <br/><br/>“No need, in case there’s a conflict, it’s not good for the students,” Director Nash replied, “their classroom has its CCTV camera. We shouldn’t interfere, and the school probably doesn’t want us to intervene either. You guys should also try to withdraw as soon as possible.” <br/><br/>The shooting director agreed, “Okay.” <br/><br/>Daisy Zane and the others also immediately received the message. <br/><br/>After reading the message on her cell phone, Daisy Zane turned off her mic. At the same time, Turner Daniel also turned off his mic. <br/><br/>Celeste Martin glanced over at them as well. <br/><br/>Skyler Thomas held her waist in pain, as the collision left her legs slightly weakened, “I said I would give you an explanation, but if you want to forcefully take someone from my class, I’m telling you, there’s no way.” <br/><br/>Marsh Turner moved past the students standing behind Skyler Thomas, pinching her shoulder, “Why are you pushing my teacher for my sake? Skyler, let’s go have our injuries examined and sue them later.” <br/><br/>“Sue us? We’re going to sue you!” <br/><br/>Skyler Thomas backed up and blocked Marsh Turner, “You go back first, I’ll handle it.” <br/><br/>“How are you going to handle it? Are you covering for him?” The parent said, “This brat bullies people because of his powerful family background. Did you take any benefits from his family to protect him like this?” <br/><br/>“What’s wrong with having a good family background? Can people with good family backgrounds just randomly hurt others? Is there no law anymore?” Another parent said, “Under the emperor’s feet, who would dare to be arrogant!” <br/><br/>“And you as the teacher, I’ve heard that you taught a class of underachievers. Every one of them has poor grades and lacks quality” Another parent said, “A teacher like you will only bring out students like them. There’s no need for such a class to exist when all the names have to be found at the bottom of the school’s academic list. It’s simply a waste of educational resources.” <br/><br/>“If they have money, they should just go back home and inherit their family business instead of coming to school and stirring up trouble!” <br/><br/>Class 8’s homeroom teacher, who had been standing at the entrance wearing a mask, slightly raised the corners of his mouth under the mask when he heard this. <br/><br/>Then the classroom suddenly became lively, with voices of rebuttal. <br/><br/>The male students standing behind Skyler Thomas were all ready to charge forward. <br/><br/>But they were stopped by Skyler Thomas and her small frame. <br/><br/>She spotted the glass cup on the desk behind her, picked it up, and smashed it hard on the podium. <br/><br/>The glass cup shattered with a loud crash, and shards of glass flew everywhere. <br/><br/>However, because of the podium, the students on both sides were far away, so no one was hurt. <br/><br/>It was just that the sound was so loud that it scared everyone. <br/><br/>The classroom full of students, those few parents who kept bickering, and even the principal who had been trying to mediate were all startled. <br/><br/>Immediately, the classroom quieted down. <br/><br/>Skyler Thomas, trembling with anger, glared at the parents and yelled, “If you’re here to solve the problem, then sit down and talk properly. If not, please leave! If I hear any of you say another word about my students, I’m telling you, this matter is far from over!” <br/><br/>Daisy Zane slightly raised her eyebrows. <br/><br/>The entire classroom was silent, and the students were even breathing lightly. <br/><br/>William Butch nodded gently. <br/><br/>Daisy Zane and Turner Daniel walked together out of the classroom. <br/><br/>As they reached the doorway, she overheard two girls at the table near the door whispering to each other, “Did you see the news online? Are the Hobsons done for?” <br/><br/>Another girl whispered resentfully, “If this is true, they’re definitely done for. No matter how powerful the Hobson family is, or how crafty Allonzo Hobson is, they’ll be finished. They beat someone so brutally, it’s too cruel.” <br/><br/>Daisy Zane stepped out of the classroom. George Dunn, Celeste Martin, and some staff were waiting outside. <br/><br/>When everyone had assembled, they led them out. <br/><br/>As they walked, Daisy Zane took out her cell phone and looked at the hot searches on Facebook. <br/><br/>Of the top ten searches, two were related to the Hobson family, three to Allonzo Hobson, and one to Phoebe Turner. <br/><br/>Daisy Zane clicked on the highest trending topic: [The Hobsons bully others with their power.] <br/><br/>The content inside read: [Marsh Turner, the son of the Turner family, takes advantage of the Hobsons’ influence to beat up his schoolmates, putting their lives at risk.] <br/><br/>Nine pictures accompanied the post, the first three of which showed a male student lying in a hospital bed. <br/><br/>The fourth picture was the diagnosis certificate for the boy. <br/><br/>The diagnosis stated that the boy had multiple contusions, a dislocated wrist, and two broken ribs. <br/><br/>Even though the boy’s face was blurred, the censorship wasn’t thick, so one could barely make out that he was the one who tried to stab Daisy Zane with a spring knife last night. <br/><br/>Daisy Zane remembered that Marsh Turner had called him James Butch. <br/><br/>The remaining five pictures were of five different male students, each with distinct bruises on their bodies. Some had bruised ribs, some had bruised arms, and some had bruised backs. <br/><br/>All of these were Daisy Zane’s handiwork. <br/><br/>Daisy Zane didn’t read the comments but clicked on a few more search topics about Allonzo Hobson and Phoebe Turner. <br/><br/>Events that had been clarified 800 years ago were being criticized again. <br/><br/>The Hobson family was a giant in the entertainment industry, and Allonzo Hobson had a high-profile style and often appeared in the media. Phoebe Turner was also a Best Actress. <br/><br/>Any news about the Hobson family would undoubtedly become a major event in the entertainment industry. <br/><br/>Daisy Zane didn’t expect that the search topics about the Hobson family mentioned Marsh Turner’s situation as well. <br/><br/>Phoebe Turner, Marsh Turner <br/><br/>Daisy Zane asked George Dunn, who was beside her, “Marsh Turner is Allonzo’s ” <br/><br/>“Cousin,” replied George. “Didn’t you know?” <br/><br/>No one told her, so she had no idea. <br/><br/>Daisy Zane took a deep breath. Things had gotten way out of hand. <br/><br/>Not only did Marsh Turner end up being the scapegoat, but also the entire Hobson family was affected. <br/><br/>George Dunn glanced at her phone screen and whispered, “Someone is using public opinion to put pressure on the Hobson family.” <br/><br/>Daisy Zane turned off her phone and raised her eyebrows slightly. <br/><br/>She initially wanted to handle things privately, but since it’s come to this point she couldn’t be blamed anymore.\t\t\t\t\t\t</div>", "images": {}, "success": true}