{"id": 330, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391169.html", "title": "Chapter 330: 306: Blacklisted", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 330: 306: Blacklisted</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 330: 306: Blacklisted<br/><br/>Translator: 549690339<br/><br/>The little episode with Jessica Maxwell soon passed, and everyone didn’t take it to heart.<br/><br/>The first period was English class, and the teacher was talking about the weekend assignment. When discussing multiple-choice questions, the teacher was explaining restrictive and non-restrictive relative clauses.<br/><br/>Daisy Zane listened for a while before her thoughts drifted to William Butch.<br/><br/>Holt Lawrence had sent her all the information he found that night.<br/><br/>Everything was organized in great detail.<br/><br/>William Butch had been taken care of by his grandparents since he was two or three years old.<br/><br/>His parents divorced, and neither of them wanted him. His father had his own family a year after the divorce and completely left William Butch out of his life.<br/><br/>As for William’s mother, she lived abroad. The information they found showed that the last time she came to see William was four years ago.<br/><br/>From the plane tickets and hotel bookings, it seemed she had only stayed in the Imperial Capital for one night before leaving.<br/><br/>His mother had been sending money to her parents, and she also gave William a separate sum of money.<br/><br/>There was a bank card under William’s name, where his mother deposited money every month.<br/><br/>But William rarely used that card.<br/><br/>He was also raised pretty much freely by his grandparents.Th.ê most uptodate novels are published on n(0)velbj)n(.)co/m<br/><br/>It seemed like their only responsibility was to keep him alive, and they didn’t care about anything else.<br/><br/>According to the investigation, the bullying William experienced mainly came from two aspects.<br/><br/>One was his personality and hobbies.<br/><br/>William was too quiet, very shy, and had a passive personality. The original quote from the person sent by Holt Lawrence to investigate was: “That child, so quiet like a little Miss.”<br/><br/>When Daisy Zane saw this, she immediately thought in her head: Why does quiet necessarily mean being like a little Miss? Robinson Scott, the girl she knew, she had never seen her being quiet.<br/><br/>As for his hobbies one of the most memorable was that he liked pink things a lot.<br/><br/>For example, pens, pencil cases, book covers, bags, clothes, shoes<br/><br/>He had a weak spot for anything pink.<br/><br/>The second reason was that he was too smart and intelligent, which led to his isolation.<br/><br/>William was intelligent since he was young and even skipped a grade.<br/><br/>The teacher often praised him, often saying sentences like, “Look at William, and then look at yourselves.”<br/><br/>William was that other person’s child in the parents’ eyes.<br/><br/>This also caused some students who were older and taller than him, often nagged by their teachers and parents, to bully him.<br/><br/>Daisy Zane looked at William, who was now stripped from his pink trappings from head to toe and ranked second to last in the entire school, and thought about the beatings he took.<br/><br/>Moreover, those beatings were just a part of the investigation, learned from some people. There might be even more that they didn’t find out about.<br/><br/>She didn’t quite understand.<br/><br/>Why didn’t he fight back?<br/><br/>Even if he couldn’t win, it was still better than standing there and taking the hit.<br/><br/>If the other party had more people, he could just randomly grab someone and fight back.<br/><br/>Olivia Lane said nothing and turned her head away, not wanting to deal with Daisy Zane anymore. Turner Daniel, on the other hand, blinked twice before handing her two tissues.<br/><br/>William Butch looked at his sleeve and said after a moment of silence, “Thank you.”<br/><br/>“Your clothes are dirty,” said Daisy Zane.<br/><br/>Already turning his body to the side, William Butch still kept his head down. Hearing her words, he shook his head to indicate that it was all right.<br/><br/>At this moment, George Dunn came in from outside, stopped when he reached them, and said while scratching his exposed arm, “Do we have mosquitoes in our classroom?”<br/><br/>Daisy Zane: ” ”<br/><br/>George Dunn stretched his arm out to show them and said, “Look, this mosquito must be a king. With this weather and this temperature, it can still survive and bite me so big.”<br/><br/>Turner Daniel looked up at George Dunn and saw a somewhat proud expression in his eyes.<br/><br/>As expected, two seconds later, he heard George Dunn say, “Sure enough the mosquitoes that bite me are not ordinary mosquitoes.”<br/><br/>Olivia Lane:<br/><br/>Daisy Zane couldn’t listen anymore and threw the tissue she had just wiped her hands with in front of George Dunn. The side with the dead mosquito and blood on it was facing up, “Not as good as the mosquito king with long eyelashes.”<br/><br/>George Dunn looked at the tissue and said, “?”<br/><br/>Daisy Zane stood up and said to Olivia Lane, “I’m going to wash my hands.”<br/><br/>As she walked out, she added, “It’s your blood, bad luck.”<br/><br/>This disgusted tone Both Turner Daniel and Olivia Lane laughed.<br/><br/>George Dunn came back to his senses: “???! !!!”<br/><br/>After washing her hands, Daisy Zane checked the messages on her cell phone in the restroom.<br/><br/>Her phone vibrated several times during class, so she silenced it.<br/><br/>She opened it and saw that all the messages were from Gael Easton.<br/><br/>He said a lot of random things in the front, most of them complaining about Harton Clark.<br/><br/>He even sent a long picture, with all the shortcomings of Harton Clark he had listed. A total of one hundred and one.<br/><br/>Daisy Zane clicked on the image, glanced over it, and saw the shortcomings lying in it, such as “looking too good makes one restless,” “men who look like him would have ugly children,” “the surname Ye doesn’t match hers,” “male fox spirits are no good,” “men over 185cm tall lack oxygen,” and so on.<br/><br/>Afterward, probably because Daisy Zane kept ignoring him, Gaul began to apologize for his own inappropriate comments.<br/><br/>It was just that his way of apologizing was unique.<br/><br/>[Well it’s good to have dreams. It’s nice for anyone’s dreams to come true.]<br/><br/>[Domestic is good too, with beautiful mountains and rivers and good public security. Some issues might not even be a problem.]<br/><br/>[Celebrities are good; they have a mass base and can reach the grassroots. They can also experience all aspects of life.]<br/><br/>After sending a dozen or so messages apologizing without saying the word “apologize,” Gael Easton started cursing.<br/><br/>Every sentence began with “stinky brat.”<br/><br/>He cursed for more than twenty minutes, and when he still didn’t get a response, he started transferring money.<br/><br/>USD 10,000 at a time, transferring USD 200,000 in total.<br/><br/>After reaching the WhatsApp limit, he switched to a bank card. After transferring more than ten million, he finally calmed down.<br/><br/>Daisy Zane casually read the messages and then collected the money one by one.<br/><br/>And then she blacklisted Gael Easton...\t\t\t\t\t\t</div>", "images": {}, "success": true}