{"id": 331, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391173.html", "title": "Chapter 331: 307: Gifts Bought For Charles Amos", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 331: 307: Gifts Bought For Charles Amos</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 331: 307: Gifts Bought for Charles Amos<br/><br/>Translator: 549690339<br/><br/>Only after the wound on Kevin Clark’s mouth had fully healed did he bring Charles Amos home on Tuesday morning to visit his elderly father.<br/><br/>So his father wouldn’t see him in an awkward situation.<br/><br/>What he didn’t know was that there was a guest at home, talking about Charles Amos.<br/><br/>Bonnie Maxwell arrived more than nine o’clock, still bringing lots of things with her.<br/><br/>Because when she was young, Tom Wayne saved her life, and she studied acupuncture and traditional medicine with him, so she visited Clark Manor very frequently.<br/><br/>Although nine out of ten times she wouldn’t bump into Kevin Clark, and the one time she did, he would say “Hmm” to her at most.<br/><br/>But she still came, and got along well with Mr. &amp; Mrs. Clark.<br/><br/>The Clark family naturally knew her intentions, but they never interfered with the affairs of the young people.<br/><br/>At most, they would urge them to find a partner soon.<br/><br/>So they never got too close to Bonnie Maxwell, just stayed at the level of elders and juniors relationships.<br/><br/>They always managed this relationship very well.<br/><br/>“Clara, I heard that you’re going to participate in the Celestial Pivot selection,” Elina Clark asked.<br/><br/>When she said this, Charles Amos had just run to the front hall and heard the familiar voice inside, a voice he would remember for the rest of his life.<br/><br/>It was the woman who had competed in marksmanship against his mother at the military district shooting range and was defeated. She had almost scared him to tears.<br/><br/>So he stopped and didn’t move.<br/><br/>Even gestured a “shush” sign to Kevin Clark, who was walking slowly behind him.<br/><br/>In the hall, Bonnie Maxwell replied with a smile, “Yes. I haven’t been too busy lately, so I thought I’d give it a try.”<br/><br/>“Instead of taking a break while you’re not busy,” Tom Wayne said, “don’t work too hard, and pay attention to your health.”<br/><br/>“Yeah,” Bonnie Maxwell replied, “we don’t have any Celestial Pivot members, and every time we want some information, we have to pay a high price for it. If I get in, I can climb up, and it’ll be more convenient in the future whenever we need information.”<br/><br/>“That’s true.” Elina Clark nodded in agreement.<br/><br/>Bonnie Maxwell’s mouth still had a smile, and after talking for a bit more, she said, “My father went to the south recently and brought back some tea, so I brought some over too.”<br/><br/>“Thanks for thinking of us, having your father bring things every time.”<br/><br/>“It’s my pleasure,” Bonnie Maxwell replied, “I also bought a game console that is popular among children nowadays, as well as some educational Lego toys, all for Charles.”<br/><br/>Tom Wayne looked at her, “For Charles?”<br/><br/>“Yes. I asked, and they are all things that nine or ten-year-old children like.” Bonnie Maxwell said, smiling at Tom Wayne.<br/><br/>Charles glanced at Clara, who had been staring at him non-stop, and ran to Elina’s side, “Grandpa, I missed you and Grandma so much.”<br/><br/>“Why didn’t you come to visit us then?” Natalie spoke gently.<br/><br/>Elina touched his hand, his eyes involuntarily drifting toward the living room door.<br/><br/>“I wanted to visit earlier,” Charles started blaming Kevin, “but Uncle didn’t let me. He found me annoying and didn’t like me; he even wanted to hit me just now.”<br/><br/>Charles’s cunning acting skills showed up on the spot, making his story sound more pitiful.<br/><br/>Natalie smiled and said, “If he dares to hit you, Grandma will chase him away with a stick.”<br/><br/>“Thank you, Grandma,” Charles sweetly voiced his gratitude.<br/><br/>Just then, Kevin entered, his sudden appearance catching Elina off guard, who, being older, had slightly less keen hearing and hadn’t heard his footsteps.<br/><br/>She quickly looked away, unable to put on an angry expression in time.<br/><br/>Caught red-handed by Kevin.<br/><br/>As a result, Elina had to exert effort twice on her facial muscles to show he was still angry.<br/><br/>Kevin laughed inwardly but didn’t expose him. He looked at Charles and said, “Fine, you let my mom hit me, and I’ll let your mom hit you. Fair enough.”<br/><br/>Charles’s smug little face immediately crumbled.<br/><br/>Kevin looked at him again and then turned to Elina, “Dad.”<br/><br/>Elina held Charles’s little hand, lowering her head, not looking or engaging with him.<br/><br/>Natalie glanced at him, then exchanged a smile with Kevin.<br/><br/>“Charles, come to Grandma,” Natalie let him sit beside her, then introduced the cunning little boy, “Charles, Lucia here is Grandma’s apprentice. She often comes to visit Grandpa and Grandma. You can call her Auntie Bonnie.”<br/><br/>When Kevin entered the room, Clara had already calmed down.<br/><br/>She never expected that the Clark Family knew about the existence of this child and had even brought him home.<br/><br/>Fortunately, she hadn’t said anything too harsh earlier.<br/><br/>There was still a chance to make amends.<br/><br/>As Natalie introduced her, Clara smiled at Charles. Although the smile didn’t reach her eyes and hid a great distortion beneath her calm surface,<br/><br/>Charles looked at her, his lips moving several times without uttering anything.<br/><br/>He didn’t want to address this bad woman, but he was afraid his grandparents would think he was being impolite.<br/><br/>If he was impolite, it would affect his mother’s educational reputation and her image.<br/><br/>But he couldn’t say it.\t\t\t\t\t\t</div>", "images": {}, "success": true}