{"id": 337, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391197.html", "title": "Chapter 337: 313: Trouble In The Class", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 337: 313: Trouble In The Class</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 337: 313: Trouble in the Class<br/><br/>Translator: 549690339<br/><br/>Before entering the school, Daisy Zane made a call to Holt Lawrence, asking him to check if she had been captured by surveillance cameras along the path she had just taken.<br/><br/>And also the surveillance of her scaling the school’s wall.<br/><br/>Used to her constant vigilance, especially now that she is under the public eye, every move of hers could be amplified limitlessly.<br/><br/>She wasn’t afraid, just found it bothersome.<br/><br/>If one problem could be reduced, then so be it.<br/><br/>Naturally, Holt Lawrence agreed readily.<br/><br/>However, after Daisy Zane returned to the dormitory, went to wash and rinse in secret, and quietly came back to bed, she discovered a message from Holt Lawrence sent about ten minutes ago.<br/><br/>[There’s something weird. I just checked the surveillance that captured you and didn’t touch it. Someone hacked it before me.]<br/><br/>Daisy Zane: [?]<br/><br/>Holt Lawrence: [The skills are decent, took me some time to bypass him. This person used a computer in a black internet cafe to hack the surveillance. By the time I checked, the computer was just logged off.]<br/><br/>Daisy Zane: [You mean, you couldn’t find any useful information?]<br/><br/>Holt Lawrence: [The other party is too cautious, leaving nothing behind. If it wasn’t for the good skills, all the temporary data, seems like a beginner hacker trying to test his hand at hacking surveillance.]<br/><br/>Daisy Zane: [A ‘beginner’ that still commands your time.]<br/><br/>[... Don’t make fun of me. Is this an acquaintance of yours? I specially checked, he just hacked the surveillance. Seems like he did it to protect you.]<br/><br/>Daisy Zane: [I don’t know, no impression.]<br/><br/>[ I wanted to say, if it’s an acquaintance of yours, quickly introduce him to Celestial Pivot. With these skills, I can open the backdoor for him. Prevent the meat from overflowing to outsiders.]<br/><br/>Daisy Zane: [I don’t know him, I’m going to sleep.]<br/><br/>Upon saying this, Daisy Zane turned off her mobile phone and laid down.<br/><br/>She thought for a while about who it might be in her head, but could not think of anyone, so she slept.<br/><br/>...<br/><br/>The Celestial Pivot’s assessment runs on Wednesday from zero o’clock to 23:59.<br/><br/>During this time, your start time is not restricted.<br/><br/>As long as it’s within this time frame, you can answer the questions whenever you want.<br/><br/>If you have confidence to pass the assessment, no one cares if you start answering the questions at 23:00.<br/><br/>This year, because Nathan Ninevara participated in the test formulation, the number of people participating in the assessment exploded.<br/><br/>Holt Lawrence sat in front of the computer, dropping a few goji berries in his thermos cup. Watching the increasing numbers of participants on the screen, he let out a sigh of marvel.<br/><br/>The number of people is already twice as much as the last batch.<br/><br/>Nathan Ninevara’s reputation Truly well-deserved.<br/><br/>However, nearly half of the students below could not rouse their spirits and were slumping, listless.<br/><br/>But upon hearing the noise outside, their heads were all simultaneously raised like flowers watered with nectar, all looking outside.<br/><br/>Just as the gossip was sparked, the door of the classroom was abruptly kicked open.<br/><br/>The students who were attentively listening to the class were startled, some scared into yelling.<br/><br/>Even Skyler Thomas was startled. The chalk that was on the blackboard suddenly traced a parabola. She looked at the entrance in shock and, without thinking, put herself in between the person responsible and the classroom.<br/><br/>Daisy Zane watched the parabola drawn by Skyler Thomas and turned her eyes to the door. At the same time, she raised her hand to rub Olivia Lane’s head, comforting her startled little heart.<br/><br/>There were approximately eight or nine individuals outside the classroom.<br/><br/>Both men and women, almost all of them were around forty-five or older.<br/><br/>Among them, three were principals and teachers trying to resist the several infuriated individuals.<br/><br/>“May I ask what’s the matter?” Skyler Thomas asked towards the principal whose forehead was beaded with sweat.<br/><br/>“Where’s Marsh Turner?! We are looking for him!” One of the women said.<br/><br/>“Yes, we’re looking for him!”<br/><br/>Hearing this name, more than half of the students turned their heads to look at Marsh Turner.<br/><br/>Marsh Turner had a bewildered look on his face.<br/><br/>When the students turned around, the people at the entrance immediately recognized Marsh Turner and stepped forward to walk into the classroom.<br/><br/>Skyler Thomas immediately stood in front of them, and the teachers along with the principal also stopped them.<br/><br/>Skyler Thomas said, “He is my student, tell me what’s the matter.”<br/><br/>“Tell you! What could we tell you! He hit my son! My son is still lying in the hospital! By telling you, can my son get better right away?”<br/><br/>“Yes, my son is also at the hospital. How do you teach? What kind of students do you teach! Besides fighting, what else can he do! If I were you, I would be too ashamed to stand at the podium.”<br/><br/>“Get out of the way! Let him out! So what! Does he think he can get away with hitting my son!”<br/><br/>George Dunn turned his head to look at Marsh Turner, paused for a while and asked, “Who did you fight with? Did you cause a serious injury? It’s created quite a fuss.”<br/><br/>Marsh Turner looked at the several parents in front. One or two of them seemed familiar, probably the parents of a few boys from Class 8. The fight didn’t involve him, but it was impossible for him to bring up Daisy Zane’s name: “I had a bit of a dispute.”<br/><br/>George Dunn was a bit confused, murmuring to himself, “Why is it being blown out of proportion, it shouldn’t be this way.”<br/><br/>Marsh Turner’s family background was well-known here, theoretically the matter shouldn’t have escalated like this.<br/><br/>The few parents were very emotional, they were trying to rush into the room while arguing. Skyler Thomas forcefully stopped them, saying, “If he really did get into a fight, the school will give everyone a satisfactory explanation. Please calm down and let us understand the situation first.”<br/><br/>“Calm down, how do we calm down.” The woman in front suddenly pushed Skyler Thomas, “If your child was hit, would you be able to calm down?”<br/><br/>Skyler Thomas was pushed, her back hit the desk behind her which was pushed away. Thankfully, the girl behind her swiftly helped her, preventing her from falling to the ground.<br/><br/>When Skyler Thomas was pushed, more than half of the students in the class stood up. Especially the boys, all of them stood behind Skyler Thomas.<br/><br/>Helping Skyler Thomas and confronting the parents. It seemed as though if they dared to lay their hands on Skyler Thomas again, they would retaliate.\t\t\t\t\t\t</div>", "images": {}, "success": true}