{"id": 333, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391181.html", "title": "Chapter 333: 309: Beaten Up Again", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 333: 309: Beaten Up Again</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 333: 309: Beaten Up Again<br/><br/>Translator: 549690339<br/><br/>Before the afternoon class, Daisy Zane received another bombardment of messages from Gael Easton’s new number.<br/><br/>[You blacklisted me! Not only on WhatsApp, but you even blacklisted my two numbers!]<br/><br/>[If you blacklist me, fine, but don’t take my money!]<br/><br/>[You smelly girl! How dare you blacklist me! Do you think I can’t do anything to you!]<br/><br/>Daisy Zane looked at the messages popping up one by one on her cell phone, moved her fingertips, and blacklisted this new number as well.<br/><br/>However, three minutes later, Gael Easton switched to another number and came back.<br/><br/>[Fine, are you addicted to blacklisting me? If I contact you again, I’ll take your surname.]<br/><br/>[After I send this message, we’ll end our friendship. We’ll contact each other through drift bottles.]<br/><br/>As the class bell rang, Daisy Zane didn’t bother with him, turned off her cell phone, and took out the roll she needed for class.<br/><br/>The teacher came to the classroom ten minutes early and was surrounded by students asking questions at the front.<br/><br/>As the class bell rang, she let the students return to their seats to begin the lesson.<br/><br/>About ten minutes later, William Butch walked in through the entrance, still keeping his head down.<br/><br/>However, lowering his head did not cover the injury on his face.<br/><br/>His left cheek was obviously swollen, and the corner of his mouth was torn. His school uniform was dirty, with footprints all over his pants.<br/><br/>He was walking a little faster than usual. Turner Daniel hesitated for a moment when he saw him like this, then immediately got up and let him sit back in his seat.<br/><br/>Following William Butch, came Marsh Turner.<br/><br/>Marsh Turner was carrying his school uniform jacket, and in order not to disturb the teacher’s class, he just smiled apologetically at the teacher when she looked at him, then quickly walked towards his seat.<br/><br/>Daisy Zane raised her eyes to look at Marsh Turner’s face, then moved her gaze down to see his hand hanging by his side.<br/><br/>There were slight scratches on the back of his hand, probably from a fight with someone.<br/><br/>As Marsh Turner sat down, Daisy Zane shifted her gaze back to William Butch sitting in front of her.<br/><br/>Turner Daniel was giving him tissue paper to wipe the blood from his face.<br/><br/>William Butch, however, shrunk his neck and ignored him.<br/><br/>Turner Daniel then placed the tissue paper next to him.<br/><br/>Olivia Lane, who was a little sleepy moments before, suddenly became more than half awake. The whole class looked over at them consciously or unconsciously.<br/><br/>Daisy Zane didn’t know what she wanted to talk about, so mysteriously. Still, she reached back and turned off her microphone: “What’s the matter?”<br/><br/>Willow Martin’s face turned even redder under her gaze. She rubbed the drink in her hand, then lowered her head, not daring to look into Daisy’s eyes, and whispered: “Wasn’t there a boy in your class who was beaten up today?”<br/><br/>Hearing her words, Daisy Zane raised her eyebrows slightly: “How do you know?”<br/><br/>“It really was your class.” Willow Martin murmured softly, “I just happened to see it when I came to school today, and I eavesdropped on their conversation.”<br/><br/>Daisy Zane looked at her drooping eyelashes. She suddenly came to find herself. Could it be that this matter had something to do with her as well: “Is it related to me?”<br/><br/>Willow Martin nodded.<br/><br/>Daisy Zane: ” ”<br/><br/>“Those who beat him up were from both inside and outside the school.” Willow Martin looked up at her and then lowered her gaze again, “From what I heard them say, it seemed like they wanted the boy in your class to take you out last night. But not only did he not take you, but he also managed to avoid them last night. That’s why he was cornered and beaten up at noon today.”<br/><br/>Daisy Zane rubbed her fingertips hanging at her side: “Take me out?”<br/><br/>“Yes, it was your name.” Willow Martin said, “I also heard them slapping that boy’s face and saying, ‘Wasn’t that woman protecting you? Why didn’t she come today?’”<br/><br/>Daisy Zane thought of the faces of those people in the restroom that day.<br/><br/>“Sister Zane, be careful. Many students in this school have powerful family backgrounds. They are lawless.” Willow Martin said, “Don’t be caught alone. They might might ”<br/><br/>As Willow Martin spoke, she thought about her words, “They might do something terrifying.”<br/><br/>Because of her euphemistic words, Daisy Zane raised the corner of her mouth for a moment. After a while, she asked, “Did you hear anything else?”<br/><br/>“Well ” After thinking about it, Willow Martin said, “No more. Then a very tall boy came over and chased them all away. I took the opportunity to run away when they were fighting.”<br/><br/>At this point, Willow Martin felt a little guilty, “Should I have called the police? At the time, I was too scared, so I hid in the corner and didn’t dare to move. I was afraid they would discover me.”<br/><br/>Actually, when Willow Martin heard someone fighting, she wanted to run away. Still, when she heard Daisy Zane’s name, she stopped in her tracks and hid.<br/><br/>“You don’t need to get involved. I can handle it.”<br/><br/>Willow Martin’s lips moved: “Then you be careful.”<br/><br/>Daisy Zane looked at her, paused for a while, and then said, “Thank you.”<br/><br/>Hearing her gratitude, some of the red that had just faded from Willow Martin’s face came back up again: “No, it doesn’t matter. No, not no need to thank me.”<br/><br/>Daisy Zane raised the corner of her mouth: “How is your pipa practice going?”<br/><br/>“I’ve made a lot of progress recently.” Willow Martin said, lowering her head, “I’ll play it for you when I have time.”<br/><br/>“Alright.”<br/><br/>Upon hearing her response, Willow Martin’s mood instantly improved. She handed the drink in her hand to Daisy: “Here, for you. I was in such a hurry to come over after class that I just bought this.”<br/><br/>Daisy Zane looked at her hand’s drink, hesitated for a moment, and then took it.\t\t\t\t\t\t</div>", "images": {}, "success": true}