{"id": 339, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391205.html", "title": "Chapter 339 - 315: Our Side", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 339 - 315: Our Side</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 339: Chapter 315: Our Side <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane left School and called Austin Allen first, asking him to come over when he had time. Then she borrowed a computer from Director Nash, searched for the information she wanted, and put it on her phone. <br/><br/>While waiting for Austin to arrive in the car, Turner Daniel and George Dunn bought food and drinks for everyone. <br/><br/>Recording of the 15th Class continued, and Director Nash was still focused on the filming. <br/><br/>The staff who had been following the 16th Class all gathered and started chatting. <br/><br/>Daisy Zane grabbed a drink and didn’t join them, just sitting quietly and listening. T/his chapter is updated by nov(ê(l)biin.co/m<br/><br/>After chatting with them for about two minutes, Celeste Martin was called away by Director Nash. He asked her to take the shooting director to the art building. <br/><br/>Since they didn’t have anything else to shoot, they wanted to capture more footage of Celeste teaching students how to play the Pipa. <br/><br/>Before Celeste left, she asked if the other three wanted to go with her, but Daisy Zane didn’t respond. George Dunn and Turner Daniel were very resistant. <br/><br/>They never wanted to touch Pipa again in their lives. <br/><br/>George Dunn’s fingers were blistered from playing for just half a day last time. <br/><br/>Almost twenty minutes after Celeste left, Austin arrived. <br/><br/>Daisy Zane told the director and then left directly. <br/><br/>As George and Turner watched her leave, they exchanged puzzled glances. <br/><br/>Daisy Zane went to the School entrance to pick up Austin and found out that not only had Austin come, but Joseph Allen had come as well. <br/><br/>The brothers leaned against the car. Joseph wore an ancient-style suit, while Austin was dressed in a black suit, still wearing gold-rimmed glasses. <br/><br/>Because he knew she had scars. The one on her collarbone looked like a scratch mark from a large animal, as if it was the result of a fight. <br/><br/>He also knew she had a tattoo on her back shoulder. <br/><br/>So every garment designed for Daisy Zane would cleverly cover these two areas. <br/><br/>Up to now, all of Joseph’s designs still had this little feature. <br/><br/>Even many clothes, haute couture dresses, Daisy Zane didn’t wear. <br/><br/>But he still maintained the habit. <br/><br/>This led to some celebrities, artists and madams even wanting to wear Cloud Clothes and Rainbow Skirts had to have not only money but also fate. <br/><br/>This fate was whether or not the size was suitable and whether they could wear it. <br/><br/>Daisy Zane went to the print shop across from the School, printed out everything she needed, and returned to the dormitory before going to the Principal’s Office with Austin and Joseph. <br/><br/>However, when they reached the floor of the office, the three of them turned a corner and ran into several acquaintances. <br/><br/>These acquaintances also looked over after hearing footsteps. <br/><br/>For a moment, both groups stared at each other across the two-meter distance, and neither side spoke. <br/><br/>Two seconds later, Marsh Turner was the first to speak, “Daisy, how did you get here?” <br/><br/>Daisy Zane’s eyelashes fluttered in acknowledgment, her gaze shifting from Marsh Turner to Xavier Dominic, and then onto the two slightly older-looking people. <br/><br/>They seemed to be Marsh Turner’s parents. <br/><br/>Finally, her gaze stopped at the seemingly calm, detached, almost inspection-like figure of Arthur North. <br/><br/>As soon as Daisy Zane rounded the corner, Arthur’s gaze fell directly on her.\t\t\t\t\t\t</div>", "images": {}, "success": true}