{"id": 334, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391185.html", "title": "Chapter 334: 310: Asking For Leave To Go Outside The Campus", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 334: 310: Asking For Leave To Go Outside The Campus</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 334: 310: Asking for Leave to Go Outside the Campus<br/><br/>Translator: 549690339<br/><br/>During the evening self-study session, William Butch returned.<br/><br/>His wounds had been treated, probably by Skyler Thomas.<br/><br/>Still sitting at his seat without saying a word, head down, as if even movement had ceased.<br/><br/>When he returned, Daisy Zane glanced at him, then wrote the chemistry paper on her desk.<br/><br/>Olivia Lane sat next to her, watching her hold a pen in her hand, casually looking at the test paper, and then filling in the answers.<br/><br/>No calculation process, no steps. Whether it was multiple-choice, fill-in-the-blank, or essay questions, she looked at them for a while and then filled in the results.<br/><br/>Moreover, according to Olivia Lane’s observation, her answers were all correct.<br/><br/>After finishing the chemistry paper, Daisy Zane wrote the math paper.<br/><br/>Then, with ten minutes left before the end of evening self-study, she got up, intending to go out.<br/><br/>Olivia Lane didn’t make way for her and asked, “What are you doing?”<br/><br/>Daisy Zane rubbed her hair: “The director wants to see me.”<br/><br/>“Oh.” Olivia Lane replied and then asked, “Will you return to the dormitory?”<br/><br/>“Mhm.”<br/><br/>Olivia Lane got an answer, then moved her chair forward a little to let her out.<br/><br/>Daisy Zane went to the front and told the teacher about the director calling for her before leaving the classroom.<br/><br/>The shooting director waiting outside the classroom, hearing her voice coming through the mike, stared at her blankly, their eyes dazed.<br/><br/>“I didn’t call, right?”<br/><br/>While removing her mike, Daisy Zane said: “Director Nash called me.”<br/><br/>“Did Director Nash call?” The shooting director looked at the person next to him.<br/><br/>Nobody around dared to speak up.<br/><br/>This was Director Nash, who even Allonzo Hobson had taken care of.<br/><br/>“Director Nash called,” Daisy Zane said, “You can check.”<br/><br/>The shooting director picked up his walkie-talkie to ask, putting it close to his mouth, when he suddenly realized.<br/><br/>Who am I doubting here?!<br/><br/>He was insanely bold.<br/><br/>Just as he put down the walkie-talkie, director Nash’s voice came through it: “I called Daisy, I forgot to tell you, and I contacted her directly.”<br/><br/>“Okay, okay.” Shooting Director wiped his sweat, “Daisy, please, please.”<br/><br/>“With your girly look, you dare to like someone. With your weak, chicken-like body, what do you think you can do? Still, you dare to foolishly fantasize about liking someone.”<br/><br/>Daisy Zane’s eyebrows and eyes were within the shadow of the hat brim, and she gently twirled her fingertips.<br/><br/>A few people laughed again: “I’ve seen pictures of Daisy Zane online, incredibly beautiful, with both looks and figure. You protect her so much, but she probably wouldn’t even give you a glance. She’s just here to record a show, and she’ll be gone next week. Why are you protecting her so much?”<br/><br/>William Butch still didn’t make a sound.<br/><br/>After a few seconds of silence, someone got angry.<br/><br/>There was a loud slap, breaking the silence of the darkness.<br/><br/>Daisy Zane immediately walked deeper into the alley.<br/><br/>William Butch was slapped so hard that he was thrown to the side. However, he was very close to the wall, so he collided with it instead of falling down.<br/><br/>The slap gave him a brief moment of dizziness.<br/><br/>It also seemed like a signal for everyone else to start taking action.<br/><br/>But during William’s moment of dizziness, he instinctively leaned against the wall and covered his head with his hands.<br/><br/>Daisy Zane had her hands in her pockets, with her school uniform draped over her wrists. In the midst of their punching and kicking, she whistled softly.<br/><br/>The sound was not particularly loud, but it made everyone stop their assault and stare at her.<br/><br/>In this alley, there were not only a few Gathering Joy School students, but also three people from other schools.<br/><br/>They were dressed in branded clothes, wearing gold chains and gold watches, and had dyed yellow hair.<br/><br/>Clearly, troublemakers.<br/><br/>“What is this all about?” The voice came from the one who had been talking to William Butch all along, a bleached-haired youth.<br/><br/>Daisy Zane didn’t say a word and continued to walk towards them.<br/><br/>The group couldn’t quite figure out her background, but they could only see her school uniform pants, white half-sleeves, a head of shoulder-length black hair, a black mask, and a black hat.<br/><br/>The hat brim was pressed so low that her face was completely obscured.<br/><br/>As she walked leisurely, her aura seemed to be an army of thousands in the darkness about to leave them all dead in the alley.<br/><br/>Yet, they only saw a female student in front of them.<br/><br/>So, even though her aura was powerful, the group quickly reacted.<br/><br/>“Let me tell you, don’t meddle in our business, it’s not something you can handle. Otherwise, you’ll bring trouble down on yourself.”<br/><br/>William Butch was shaking with fear, holding his head close to the wall as if he had once again blocked out everything around him.<br/><br/>“Can’t you understand?” The bleached-haired youth stepped forward, sized her up, then scoffed, “What is it? Are you here to please us?”<br/><br/>Daisy Zane still didn’t say a word. She calmly walked up to the bleached-haired youth and kicked him away with a swift motion.<br/><br/>The bleached-haired youth soared into the air and fell heavily onto the ground. The thud of his heavy body landing sounded as if it would crack the concrete.<br/><br/>After falling, he slid almost a yard across the ground before lying still. A few seconds later, he began to roll and groan in pain.\t\t\t\t\t\t</div>", "images": {}, "success": true}