{"id": 332, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391177.html", "title": "Chapter 332: 308: Replace Holt Lawrence", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 332: 308: Replace Holt Lawrence</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 332: 308: Replace Holt Lawrence<br/><br/>Translator: 549690339<br/><br/>Arthur North saw that Charles Amos’s mouth was moving, but no sound came out.<br/><br/>He laughed, sat down beside him, and casually placed the strawberry plate on the tea table on his lap, saying, “Eat.”<br/><br/>Charles Amos looked at the fruit plate on his lap, then at Arthur North, and whispered, “Thank you.”<br/><br/>Arthur North didn’t answer him but looked at Clara Mitchell and said, “Last time in the Military District, you and your brother started trouble. Charles still has a bad impression of you. Children are sensitive.”<br/><br/>In a few sentences, Arthur North removed Charles’s crisis<br/><br/>Charles pursed his lips, thinking: for today’s events, he wouldn’t tattle.<br/><br/>Clara Mitchell courteously said, “It really was offensive of us.”<br/><br/>Arthur North didn’t quite listen to her words but directly said, “Miss Maxwell, I just heard at the entrance that you bought something for Charles.”<br/><br/>Clara Mitchell’s fingers tightened instantly. Although there was a smile in Arthur North’s eyes, it was colder than the December frost. She swallowed subconsciously and tried to squeeze out a smile, “Yes, I did. I ”<br/><br/>“Miss Maxwell really made an effort,” Arthur North interrupted her directly, “You even knew his age.”<br/><br/>“I I just guessed,” Clara Mitchell said.<br/><br/>“You guessed,” Arthur North scoffed, “With his height, would you guess he’s eight or nine years old?”<br/><br/>Charles’s little eyebrows almost stood up: ” ” Tattling could still be arranged.<br/><br/>“I ” Clara Mitchell stammered.<br/><br/>Arthur North’s aura was too strong, and the pressure was too intense. Not only was Clara Mitchell tongue-tied, but her gaze began to waver.<br/><br/>“Checking on me,” Arthur North said lazily, “Do you think a few of the Maxwell family are enough for me to handle?”<br/><br/>This sentence weighed heavily on Clara Mitchell’s heart, like a stone.<br/><br/>Her heart was about to explode. She didn’t expect Arthur North to say that, without any regard for the relationship between the two families.<br/><br/>She looked at him incredulously.<br/><br/>It was incredible that he would go this far for a Daisy Zane.<br/><br/>“Arthur,” Tom Wayne called him.<br/><br/>Arthur North averted his gaze and said lightly, “I’m not joking. If there’s a next time, I’ll make the entire Maxwell family disappear.”<br/><br/>Clara Mitchell couldn’t utter a single word.<br/><br/>Arthur North said, “It’s almost noon, so I won’t invite Miss Mitchell to have lunch.”<br/><br/>He gave the eviction order.<br/><br/>Clara Mitchell’s hands clenched hard, her knuckles turning white, and her jawline tensing. She didn’t expect Arthur North to say something so heavy.<br/><br/>And Tom Wayne and the others didn’t say a word for her.<br/><br/>She took a light breath and tried her best to squeeze out a smile, “Then Aunt Wayne, Uncle Clark, I’ll take my leave first.”<br/><br/>“Alright,” Tom Wayne stood up to send her off.<br/><br/>As she walked out, she heard Charles suddenly say, “Grandpa, do you like the Celestial Pivot? If you do, I’ll replace Holt Lawrence in the future. Whatever you want to know, I’ll tell you personally.”<br/><br/>Elina Clark was amused by him, “You know Holt Lawrence?”<br/><br/>“Yes,” Charles nodded.<br/><br/>After lunch, the classroom was a bit lively at school.<br/><br/>Daisy Zane noticed something these past few days; the students in her class were quite gossip-loving. They would gather to discuss whenever there was a tiny ripple online as soon as class ended.<br/><br/>On Monday, the topic revolved around Celestial Pivot, while on Tuesday morning, they were discussing the national dance competition.<br/><br/>And the discussions continued right after lunch.<br/><br/>Apparently, this competition had nothing to do with anyone in the class, but everyone was excited about the topic.<br/><br/>Moreover, the focus was not on the competition itself but on the Lane family.<br/><br/>That’s because Olivia Lane’s mother, Sophie Ortiz, would be sitting on the judging panel of the Dance Association during the finals as the chairperson.<br/><br/>At least half of the Dance Association members came from various dance competitions.<br/><br/>Years ago, Stella Edwards was handpicked by Sophie Ortiz from a dance competition and was even taken as an apprentice.<br/><br/>So each dance competition garnered significant attention.<br/><br/>Joining the Dance Association is one thing, but if someone becomes Sophie Ortiz’s apprentice, their future prospects would be limitless.<br/><br/>The Dance Association’s official website announced today that the open audition would be held next Monday. After that, it would be the preliminaries, semi-finals, and finals.<br/><br/>As soon as the news was released, it immediately became a hot search.<br/><br/>However, the class’s discussions didn’t have much to do with dancing.<br/><br/>It was because the official website included a photo of Sophie Ortiz, and everyone was discussing why Lady Lane’s mother was so young, so beautiful, and had such a great temperament.<br/><br/>Olivia Lane wore earphones in one ear, buried her head in a game, and automatically blocked out their conversations.<br/><br/>Daisy Zane also followed the Dance Association’s matters and checked the discussions after hearing about them.<br/><br/>She looked at Sophie Ortiz for a while, then looked at Olivia Lane, “You look a lot like your mother.”<br/><br/>“That’s my mom, of course, we look alike.” Olivia Lane replied before glancing at Daisy Zane, “Are you going to participate?”<br/><br/>“What?”<br/><br/>Olivia Lane stared at her and said impatiently, “The dance competition.”<br/><br/>Daisy Zane raised her eyebrows, “I can’t.”<br/><br/>“You’re lying!” Olivia Lane threw three words at her.<br/><br/>Daisy Zane smiled and took out her cell phone to check it but didn’t say anything else.<br/><br/>Olivia Lane waited for her to speak, but realized she had no intention of continuing the conversation.<br/><br/>She blinked her eyes, and didn’t look at her phone until she heard the game’s kill announcements. Then she was quiet for a while before saying, “Amelia Miles is participating.”<br/><br/>Upon hearing this name, Daisy Zane looked up and asked with a smile, “How do you know?”<br/><br/>Olivia Lane gazed at the game screen without lifting her head and sighed, “Just saw it unintentionally on Facebook. She posted that she was going to compete and is now in the Imperial Capital for training.”<br/><br/>Daisy Zane raised her eyebrows.<br/><br/>The Miles family had been too quiet these days, and she had almost forgotten about them.<br/><br/>Johanes Miles said he would give her shares, but there had been no news on that front.<br/><br/>Olivia Lane tapped the screen a few times and said, “What a jinx, it ruined my lunch.”<br/><br/>Watching her angry expression, Daisy Zane raised the corner of her mouth with a smile.\t\t\t\t\t\t</div>", "images": {}, "success": true}