{"id": 349, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391245.html", "title": "Chapter 349 - 323: A Duo That Tricks Children_2", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 349 - 323: A Duo That Tricks Children_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 349: Chapter 323: A Duo That Tricks Children_2<br/><br/>Translator: 549690339<br/><br/>Daisy Zane and Amelie Quentin went up to the rooftop of the teaching building to have a voice chat on their phones.<br/><br/>After a team battle, the five of them became relaxed again as their opponents were at a disadvantage.<br/><br/>Allonzo Hobson started chatting: “Brook Sister, did those parents apologize to the class yesterday?”<br/><br/>“I heard they did.” Daisy Zane said.<br/><br/>Amelie Quentin: “They came. They were very sincere; they even almost bowed down to apologize to each classmate. It must be you guys who did it, I was wondering why they suddenly changed their attitude.”<br/><br/>“Not us, it’s Brook Sister alone.” Allonzo Hobson said.<br/><br/>“What happened?” Amelie Quentin looked at Daisy Zane, “Did I miss something exciting?”<br/><br/>With no outsiders present, Allonzo Hobson briefly explained the incident.<br/><br/>Although he only gave a general description, his words were extremely exaggerated.<br/><br/>He portrayed Daisy Zane as a bully.<br/><br/>“Amelie, you really missed a great scene.” Allonzo Hobson said, “You didn’t see how cool your auntie was when she threw out the evidence one by one.”<br/><br/>“Who’s my auntie? She’s not.” Amelie Quentin whispered.<br/><br/>“If she’s not your auntie, what is she? It seems like you also want to call her sister.” Allonzo Hobson laughed, “You two brothers really know how to take advantage of Arthur North.”<br/><br/>“What if she becomes my sister-in-law in the future?” Amelie Quentin started talking nonsense again.<br/><br/>As soon as these words came out, Daisy Zane used a skill in the game.<br/><br/>At the same time, William Lane, who had just taken a sip of water, sprayed it all over the table. Seeing Arthur North’s gloomy face, he couldn’t help but cough until his face turned red.<br/><br/>Allonzo Hobson was quiet for a while and then burst into laughter: “Amelie, you’re amazing. You actually want to steal Arthur North’s wife. Will Arthur kill someone? Damn! I can’t wait to see what Arthur’s expression will be when he finds out.”<br/><br/>“Who’s sister-in-law?” Arthur North’s ethereal voice came from the game, entering everyone’s ears, “What are you looking forward to?”<br/><br/>Allonzo Hobson: “!!!”<br/><br/>Amelie Quentin: “!!!”<br/><br/>Suddenly, everyone went silent, as if even the game’s sounds had disappeared.<br/><br/>William Lane was still coughing, and Amelie Quentin’s in-game character stood still. Allonzo Hobson’s character was moving, but what was he doing in place?<br/><br/>In the game map, Daisy Zane controlled Clark Ava, facing the enemy heroes coming over and turned her full support style into assassin style.<br/><br/>“The child can also pay for the father’s debt.” Arthur North said lazily.<br/><br/>So that means they will vent their anger on Charles Amos if they have any disagreements in the future?<br/><br/>Allonzo Hobson snorted with laughter: “What did our Charles do wrong to end up with parents like you two?”<br/><br/>Marsh Turner was sent back to the city for free. Heartbroken. They even had a child together.<br/><br/>And the child even knew how to tattle and do homework!<br/><br/>After one more game, they barely won.<br/><br/>In the third round, Marsh Turner was invited out by Allonzo Hobson and Arthur North came in.<br/><br/>Allonzo Hobson saw Arthur North’s game ranking and muttered: “You guys all have your own tricks. When you ask you to play games with me, you refuse. But one of you secretly registers an account to protect your little sister and another one secretly practices, only to train with their girlfriend when she’s bored. You guys really have it all.”<br/><br/>No one responded to him.<br/><br/>Allonzo Hobson didn’t mind. After entering the game, he was silent for a while and then said: “Brook Sister, did you check out the Celestial Pivot Assessment questions yesterday?”<br/><br/>In this round, Arthur North was playing support and went to the bottom lane with Daisy Zane. Amelie Quentin went to the middle lane.<br/><br/>Daisy Zane glanced at Amelie Quentin’s position and said: “I did.”<br/><br/>“Were Nathan Ninevara’s questions difficult?” Allonzo Hobson asked, “I heard from a little bird that only one person managed to solve all of Nathan Ninevara’s questions.”<br/><br/>“Not difficult.” Daisy Zane replied indifferently.<br/><br/>Amelie Quentin looked at her again and asked, “So you know hacking, too?”<br/><br/>“Amelie, when you were first taken away by Henry Clark, it was your auntie who tracked you down.” Allonzo Hobson said, “Do you know your auntie’s level? She’s capable of grinding Holt Lawrence into the ground.”<br/><br/>Amelie Quentin was surprised again, she had so many shocks today.<br/><br/>After a while, she asked: “Then why didn’t you join Celestial Pivot?”<br/><br/>Daisy Zane looked at her, then at her phone, and said nonchalantly: “I’m afraid I’d make Holt Lawrence lose his job.”<br/><br/>Amelie Quentin:<br/><br/>“A 40-year-old unemployed man that’s pretty miserable.”<br/><br/>Amelie Quentin:<br/><br/>Allonzo Hobson burst into laughter.<br/><br/>William Lane looked at the man sitting across from him, smiling as he hooked his lips.<br/><br/>He now realized that Arthur North’s girlfriend was also a devil.<br/><br/>She might even be worse than Arthur North.\t\t\t\t\t\t</div>", "images": {}, "success": true}