{"id": 344, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391225.html", "title": "Chapter 344: 319: Reminiscing The Past", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 344: 319: Reminiscing The Past</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 344: 319: Reminiscing the Past<br/><br/>Translator: 549690339<br/><br/>Everyone had left the office, leaving only Skyler Thomas and the principal to continue comforting the parents.<br/><br/>Fearing that some parents might overreact, the principal even called ten security guards to stand by.<br/><br/>“Since there are so many of us, let’s go out to eat,” Xavier Dominic said as he walked out.<br/><br/>“It’s a little past four o’clock how long are we going to eat?” Austin Allen laughed.<br/><br/>“We can chat first, then eat,” said Xavier.Domain.<br/><br/>“Shouldn’t Lucia be recording a show?” Joseph Allen asked.<br/><br/>Hearing this, Marsh Turner’s gaze moved from Harton Clark and Daisy Zane’s intertwined hands to Joseph Allen.<br/><br/>The founder of “Cloud Clothing and Rainbow Skirts” called her “Lucia,” they’re so close!<br/><br/>He had thought that Austin and Joseph were here for Harton Clark.<br/><br/>“The recording has been paused,” Daisy Zane said.<br/><br/>“That’s good,” Xavier Dominic smiled. “I’ll report to the police first, and then we’ll find a place to sit.”<br/><br/>“Let Michael Jackson and Juan Wright handle it,” Harton Clark said.<br/><br/>Xavier Dominic hesitated. Although the Hobson Family and the Clark Family were allies, the Hobson Family had its own power. Their own family could have solved this issue without the help of the Clark Family.<br/><br/>Using Michael Jackson and Juan Wright meant deploying the power of the Clark Family.<br/><br/>What would be the consequences?<br/><br/>The matter would be ruthlessly resolved, leaving the worst outcome for the Butch Family and those involved.<br/><br/>He had forgotten that these people had offended Daisy Zane.<br/><br/>In case Daisy Zane was a weak and helpless girl, then the abused child might have taken her away.<br/><br/>He didn’t dare to think about the consequences.<br/><br/>Their Third Master would go crazy!<br/><br/>“Alright, I’ll talk to Michael Jackson,” he said.<br/><br/>Harton Clark looked at Austin Allen again: “Someone will contact you.”<br/><br/>“Okay.”<br/><br/>“Let’s go to Doomsday Hotel. You guys go to the car first, I’ll contact Michael Jackson ”<br/><br/>Before he finished speaking, he caught Harton Clark pulling Daisy Zane into an empty classroom out of the corner of his eye.<br/><br/>He then closed the door and locked it.<br/><br/>Kevin Clark realized she was uncomfortable and eased up a bit.<br/><br/>Just at this moment, the bell rang for the end of the class period.<br/><br/>Soon, there were voices of students talking and playing outside.<br/><br/>Daisy Zane’s body shivered, and she tried to push Kevin away with her hand on his shoulder. But Kevin suddenly tightened his grip on her back and held her in his arms.<br/><br/>He did not let her go.<br/><br/>After a while, he lifted her up and put her on the desk next to them. He also squeezed himself between her legs, with one hand on her head and the other caressing her waist.<br/><br/>A moment later, someone accidentally bumped the door.<br/><br/>Daisy Zane, who had always been calm, was startled by the sound.<br/><br/>Kevin Clark seemed to see her scared for the first time and laughed a little, his lips close to hers.<br/><br/>But he still didn’t let her go, and the hand on her waist slowly lifted her school uniform jacket, touching her skin.<br/><br/>Daisy Zane’s breath quickened.<br/><br/>Noticing her nervousness, Kevin withdrew his hand and stopped teasing her. The hand on her head moved to the back of her neck and gently squeezed, soothing her.<br/><br/>He stepped back and looked down at her with a smile. “Why are you so sensitive?”<br/><br/>Daisy Zane used her hand on his shoulder to push him away a little, and slowly adjusted her breath without responding to him.<br/><br/>Kevin Clark held her hand on his shoulder and gently squeezed it. Seeing her blushing ears, he didn’t continue teasing her but changed the subject. “So, you had a fight last night?”<br/><br/>“Yes.”<br/><br/>“How did you know they were looking for you?”<br/><br/>“A student overheard their conversation and told me,” Daisy Zane said softly. “The bullied kid sits in front of me, he’s only 15, and he took two beatings because of me.”<br/><br/>Kevin Clark understood immediately.<br/><br/>The kid would rather be beaten than call for help.<br/><br/>The little girl seemed ruthless, but she was actually very loyal. She would surely repay the favor she owed for someone being beaten because of her, and she’d do it doubly.<br/><br/>“Little girl, you’re quite popular.” Kevin Clark stroked her face.<br/><br/>Daisy Zane lazily replied, “Maybe because I’m pretty.”<br/><br/>Kevin Clark laughed.<br/><br/>“What’s so funny? Weren’t you lustful when we first met at the Doomsday Hotel?” Daisy Zane raised her eyes, looking at him curiously.<br/><br/>Her beautiful phoenix eyes seemed to have a thin layer of mist, making them clean and clear as if they had been washed with water.<br/><br/>Kevin Clark’s throat rolled for a moment, and he leaned in closer to kiss her eyelids, after a moment, he asked, “What about you?”<br/><br/>Daisy Zane raised her eyebrows and replied honestly, “Me I was lustful too. I invited you over to drink to admire you up close “\t\t\t\t\t\t</div>", "images": {}, "success": true}