{"id": 348, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391241.html", "title": "Chapter 348 - 323: A Duo That Tricks Children", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 348 - 323: A Duo That Tricks Children</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 348: Chapter 323: A Duo That Tricks Children<br/><br/>Translator: 549690339<br/><br/>Upon hearing about Bonnie Maxwell’s entry into Celestial Pivot, Daisy Zane didn’t pay much attention to it. She entered the game, invited Olivia Lane, and then invited Marsh Turner.<br/><br/>She then glanced through her friend list, saw Allonzo Hobson online, and invited him too.<br/><br/>Allonzo Hobson entered the game very quickly. After logging in, he asked, “Brook Sister Olivia Lane is here too. How come you’re here?”<br/><br/>Olivia Lane responded softly, wearing a headset.<br/><br/>From there, Marsh Turner yelled out, “Brother. My dad won’t let me go out, so I can only stay at home and play.”<br/><br/>Allonzo Hobson chuckled and said, “Serves you right.”<br/><br/>Daisy Zane asked, “Can any of you guys bring someone else?”<br/><br/>“Wait a minute, I just called my brother, he hasn’t come online yet.” Olivia Lane said.<br/><br/>Daisy Zane tilted her head and looked at her with a smile, “So you lost in a game, and now you want your brother to get revenge for you?”<br/><br/>“Is there a problem with that?” Olivia Lane asked.<br/><br/>“Not at all.”<br/><br/>After their conversation, Allonzo Hobson chimed in, “Wait, that primitive guy, William Lane, can he actually play games? Are you looking for him to get revenge or screw you over?”<br/><br/>“My brother is definitely better than you,” Olivia Lane said. “My brother doesn’t live a primitive life, he just doesn’t have many useless social media apps.”<br/><br/>Allonzo Hobson replied, “Fine, there you go defending him.”<br/><br/>Just as he finished speaking, William Lane entered the game. Allonzo Hobson immediately addressed him, “Hey, who told me he doesn’t have WhatsApp? How did he log in? When he plays games with his sister, does he have WhatsApp?”<br/><br/>It was understandable for Daisy Zane, a support, to follow Olivia Lane. But William Lane, a jungler, roamed wildly through the jungle, yet always managed to be beside Olivia Lane the moment someone came near her.<br/><br/>With a series of elegant moves, they secured kills for Olivia Lane before leaving and disappearing back into the jungle.<br/><br/>What was most infuriating: Allonzo Hobson was almost killed. Then he saw Gary Whitepear brush past him, rushing towards Olivia Lane.<br/><br/>Allonzo Hobson watched his back as he left without a glance, and was sent back to base for free.<br/><br/>Meanwhile, Daisy Zane controlled her Clark Ava, healing bit by bit, not taking a single kill.<br/><br/>It was only during later team fights that they managed to secure two kills.<br/><br/>The game lasted for twenty-two minutes when the other team surrendered.<br/><br/>Without a doubt, Olivia Lane benefited the most from this game.<br/><br/>The frustration of being sabotaged for two games dissipated, and she finally felt happy.<br/><br/>Seeing her happy, Daisy Zane also followed suit and curled up her lips. Then she started the next match.<br/><br/>In the next game, with the same lineup and same tactics, Allonzo Hobson finally couldn’t take it anymore: “William, don’t you know that there are other people in the game besides your sister?”<br/><br/>“Hmm, I saw Arthur North’s girlfriend.”<br/><br/>“You “Allonzo Hobson clenched his teeth and said, “Before forty seconds, you passed me by. Thirty seconds later, you stepped on my corpse and returned to the jungle.”<br/><br/>“Oh,” William Lane said indifferently, “are you trying to tell me how bad you are?”<br/><br/>“Get lost!” Allonzo Hobson didn’t want to speak anymore.<br/><br/>The opposing players were significantly stronger than those in the previous game, so the five of them got more serious.<br/><br/>They also discussed some tactics.<br/><br/>Someone in the class had already fallen asleep.\t\t\t\t\t\t</div>", "images": {}, "success": true}