{"id": 343, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391221.html", "title": "Chapter 343 - 318: Future Madam", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 343 - 318: Future Madam</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 343: Chapter 318: Future Madam <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane made a clear distinction between herself now and the scene last night when she entered the alley to beat people up and questioned them with a male voice. <br/><br/>If the police questioned her later, she would naturally admit that she was the person in the alley. <br/><br/>But now, there were so many people She didn’t trust the parents across the table. <br/><br/>She wouldn’t bring trouble upon herself for nothing. <br/><br/>So, she only claimed to be the informant. <br/><br/>“Mr. Butch, let me answer your questions,” said Daisy Zane, “Why am I here? What does this matter have to do with me? Because I am Daisy Zane, the one your son tried to shoot an indecent video of with the help of outsiders.” <br/><br/>“Lawyer Allen, please educate Mr. Butch and everyone else about the law,” Kevin Clark suddenly said coldly. <br/><br/>Austin Allen’s professional smile disappeared as he spoke slowly, “School bullying involving minors carries criminal responsibility. Moreover, all these people are already adults. Let me briefly list the charges against these classmates: intentional injury, insult, group fighting, provocation, and infringement on Lady Zane’s privacy, intentional injury “” <br/><br/>“Lawyer Allen, as a lawyer, do not make groundless accusations. The lady is sitting right here. Where was her privacy violated? Where was the intentional injury?” <br/><br/>“What? Do you want this matter to be investigated further?” Kevin Clark looked at him. <br/><br/>Allonzo Hobson, sitting on the other side of Clark, stood up and sat on a chair with Marsh Turner as they were affected by the hostility. <br/><br/>Kevin Clark’s aura was overwhelmingly powerful, making the other side freeze instantly. <br/><br/>Mr. Butch’s teeth chattered under the pressure, but he still forced himself to ask, “May I know who you are “” <br/><br/>Third Master’s reputation was well-known, but not many people had actually met him. <br/><br/>Without answering his question, Kevin Clark said, “How can you bully my future wife like this?” <br/><br/>Daisy Zane: <br/><br/>All the parents on the other side were first stunned, and then they all took a sharp breath, looking at him in disbelief. <br/><br/>The Turner couple also suddenly turned their heads towards them. They were looking at Third Master Clark’s future wife. <br/><br/>And Marsh Turner’s head suddenly turned to Kevin Clark, his eyes wide open. <br/><br/>What! What! What! <br/><br/>Future wife! Whose future wife! Who is the future wife? <br/><br/>Allonzo Hobson saw his reaction and slapped him on the back of the head, “What are you doing?” <br/><br/>Marsh Turner was speechless looking at Kevin Clark. <br/><br/>Skyler Thomas looked at Daisy Zane, and her breath was almost gone. Who on earth did she know! <br/><br/>Kevin Clark continued, “You should be grateful that someone stopped them last night. Otherwise how many sons do you have to pay for this loss?” <br/><br/>“Th-Third Master ” Mr. Butch muttered. <br/><br/>Kevin Clark ignored him. <br/><br/>Austin Allen, seeing that Clark had stopped talking, continued, “Mr. Butch, what’s the hurry? I haven’t finished speaking. Attempting to shoot an indecent video has already constituted an invasion of privacy and intentional injuries to others. Although unsuccessful the audio clearly indicates their intentions.” <br/><br/>No one spoke again, and after silence for a while, Mrs. Butch spoke: “Who are you to have the final say here! We don’t even know who the victim is! Furthermore, how do you know that the child doesn’t want to settle privately?” <br/><br/>Daisy Zane said: “Lawyer Allen represents the victim, so do you think he wants to settle privately?” <br/><br/>“We have the right to protect the privacy of the victim.” Austin Allen said, “It’s nailed down and impossible to settle privately now.” <br/><br/>Allonzo Hobson smiled and said, “Don’t worry. I’ll report the case soon. I won’t remove the hot search online, and I’m waiting for the police’s notice to clear the Hobson family’s name. During the investigation, remember to compensate for the losses of the Hobson and Turner families.” <br/><br/>The faces of the parents across turned pale, some looked dazed, and some even cried. <br/><br/>Then they began begging Daisy Zane, Allonzo Hobson, and the Turner family. <br/><br/>It was a noisy scene. <br/><br/>Kevin Clark was about to leave with Daisy Zane. <br/><br/>But after standing up, Daisy Zane didn’t move. Instead, she looked at the parents who had caused trouble in the class and said, “There’s one more thing. You all need to apologize to Teacher Thomas, Marsh Turner, and the 16th Class.” <br/><br/>Kevin Clark looked at her. <br/><br/>Skyler Thomas was startled and looked at the parents across. She suddenly felt softhearted. <br/><br/>Just as she was about to say forget it, Daisy Zane’s hand pressed on her shoulder, telling her not to speak. <br/><br/>“You should bear the consequences of not educating your children properly.” Daisy Zane looked down at her cell phone, sending those videos and audio files to Austin Allen while saying, “The parents of the beaten child are angry and heartbroken. Why don’t the parents of the abusive child know how to restrain and educate their children? If you don’t educate them, someone else will.” <br/><br/>Skyler Thomas thought of William Butch and instantly stopped feeling softhearted. <br/><br/>“Verbal abuse is also violence.” Daisy Zane put away her cell phone and looked at them, “It’s best to apologize now, or else be careful that all the sins fall upon your sons.” <br/><br/>The crying and noises quieted down a bit. <br/><br/>Daisy Zane did not avoid saying bluntly: “You’d better all behave. Otherwise there are many different kinds of life in prison. I don’t need to go into details, do I?” <br/><br/>With just a gentle word, she threw it out. <br/><br/>Although she couldn’t interfere with the judicial system, she was definitely capable of “taking care” of life inside prison. <br/><br/>Not only did the parents’ faces change, but so did those of the three Turners, as well as the principal and Skyler Thomas. <br/><br/>Maybe because she was used to acting low-key while wearing a school uniform and at school, the sudden change was too much contrast for people to accept. <br/><br/>Especially this kind of seemingly gentle yet ruthless approach. <br/><br/>And Kevin Clark, standing next to her, clearly had an attitude of being indulged and spoiled. <br/><br/>“Let’s go,” Daisy Zane said to Kevin Clark. <br/><br/>After saying that, Kevin Clark led her by the hand and walked out. <br/><br/>“Miss Zane, Miss Zane,” Mr. Butch tried to chase after her. <br/><br/>He clearly understood that only if Daisy Zane took a step back, would there have been hope to settle privately. <br/><br/>But as soon as he took a step forward, Austin and Joseph, along with Allonzo Hobson, came in his way. <br/><br/>“Mr. Butch, if your son’s not disciplined, don’t try to rely on others after causing trouble.” Joseph Allen coldly stared, and uttered some harsh words, “Begging the victim? What kind of mentality do you have? Have you no shame?” <br/><br/>Hearing his brother speak like this, Austin Allen almost burst out laughing. <br/><br/>Allonzo Hobson also widened his eyes and glanced at him. Was this the Joseph Allen he knew?\t\t\t\t\t\t</div>", "images": {}, "success": true}