{"id": 347, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391237.html", "title": "Chapter 347: 322", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 347: 322</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 347: 322<br/><br/>Translator: 549690339<br/><br/>Daisy Zane had briefly informed William Butch of the situation, and he agreed to cooperate with the police.<br/><br/>After chatting with him, it was nearly time for evening self-study, so Daisy Zane went to wait for Amelie Quentin at the bottom of the teaching building.<br/><br/>When Amelie Quentin joined her to go back to the dormitory, just two minutes after they arrived, Harton Clark called.<br/><br/>Amelie Quentin waited for her to finish the call and then went to wash and rinse together.<br/><br/>Seeing her returning from the balcony, Quentin inquired, “You just saw him, why did he call you again?”<br/><br/>Daisy Zane raised her eyebrow: “How do you know I saw him?”<br/><br/>“You have a strong eaglewood scent on you that you usually don’t have,” Amelie Quentin said, “It must have come from Harton Clark.”<br/><br/>“You could smell that?”<br/><br/>Amelie Quentin looked at her and asked, “What did you two do? Such a heavy scent.”<br/><br/>Daisy Zane stroked the cell phone in her hand.<br/><br/>Amelie Quentin realized she had said too much and immediately said, “Never mind, I don’t really want to know.”<br/><br/>Daisy Zane turned around, looked at her desk, and laughed.<br/><br/>Amelie Quentin:<br/><br/>At twelve o’clock in the evening, Daisy Zane, who was asleep, was awakened by the sudden light of her phone.<br/><br/>She looked at the message, which had been sent by Holt Lawrence.<br/><br/>The assessment results must be out.<br/><br/>However Usually, he would just send a list and be done with it. Today, the messages were jumping out one by one, which was a little unusual.<br/><br/>So Daisy Zane took her phone and went to the restroom again.<br/><br/>Sitting on the toilet, she looked at the messages sent by Holt Lawrence one by one.<br/><br/>[Nana, it’s unbelievable, someone has solved all three questions you set!]<br/><br/>Daisy Zane didn’t react because she thought someone should be able to solve them; she didn’t make them too difficult.<br/><br/>She continued to read.<br/><br/>[Not only did they solve it, but they did it in a very short time.]<br/><br/>[From 22:00 to 23:51, they solved them all! They were the fastest this year!]<br/><br/>Daisy Zane raised her eyebrow at this message.<br/><br/>It had taken Holt Lawrence almost a day to solve them.<br/><br/>Although solving her questions didn’t mean that the person’s skills were above Holt Lawrence’s.<br/><br/>After all, it was just a few questions, and everyone had different ways of learning and approaching them. Naturally, everyone had their own strengths.<br/><br/>However being able to achieve this level in one aspect could mean that with some guidance and training in other areas, they would not be far behind.<br/><br/>Holt Lawrence:<br/><br/>Holt Lawrence stopped sending messages, and Daisy Zane felt much quieter in an instant.<br/><br/>She hadn’t expected William Butch to have such an ability and to be so powerful.<br/><br/>It had been a long time since she last felt challenged in this way. He had solved her questions in less than two hours.<br/><br/>She had to admit, she was a little excited right now. She even wanted to personally test how powerful William Butch was.<br/><br/>Sitting in the restroom for a while, Daisy Zane seemed to think of something. She flipped through Holt Lawrence’s messages once more and looked at the list of those who had passed the assessment.<br/><br/>Among the millions of participants from various continents, only ten were chosen by Celestial Pivot.<br/><br/>Daisy Zane looked at the hacker code names of the ten people on the list.<br/><br/>With a trace of disbelief in her eyes, she thought, “This can’t tell who is who.”<br/><br/>For a moment, she let out a slightly mocking laugh.<br/><br/>A Bonnie Maxwell was not worth her concern.<br/><br/>The next day, William Butch didn’t come to class.<br/><br/>Daisy Zane heard from Skyler Thomas that he was working with the police investigation.<br/><br/>Then, Daisy Zane asked Austin Allen, and Allen said that William Butch was with him.<br/><br/>He also told her that he wouldn’t let those parents see William Butch and that he would protect him.<br/><br/>With Austin Allen present, Daisy Zane felt more at ease, so she went to record the show.<br/><br/>At noon, Holt Lawrence, who had been removed from the blacklist, sent a message: [William Butch really didn’t plan to join Celestial Pivot.][Crying][Tough guy tears]<br/><br/>Somewhat unsurprisingly, Daisy Zane saw this message.<br/><br/>She even subconsciously felt that William Butch would do just that.<br/><br/>She replied with: [You’re already 40, don’t act like a young girl sending emojis, it’s disgusting.]<br/><br/>[Nana, he’s right in front of you, can you help persuade him? Celestial Pivot really needs him.]<br/><br/>Daisy Zane looked at his message, set it to do not disturb, then opened the game, waiting for Amelie Quentin to come back and play together.<br/><br/>The new season needed points, and Amelie Quentin’s newly matched teammates had ruined two rounds. Now she had gone to the restroom to wash her hands and calm down,<br/><br/>Or in other words, wash away bad luck and get rid of the noobs.<br/><br/>But when Amelie Quentin returned, she also brought back a piece of news.<br/><br/>As soon as she sat down, she said, “Bonnie Maxwell joined Celestial Pivot.”<br/><br/>Daisy Zane raised her eyebrows.<br/><br/>In the early morning, Holt Lawrence had a list and only showed it to her. It was only publicly announced this morning.<br/><br/>All ten of them, except for William Butch, had chosen Celestial Pivot.<br/><br/>Amelie Quentin opened the game page and said, “Now she’s gonna be smug again.”\t\t\t\t\t\t</div>", "images": {}, "success": true}