{"id": 341, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391213.html", "title": "Chapter 341 - 316: I Am Her Parent", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 341 - 316: I Am Her Parent</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 341: Chapter 316: I am Her Parent<br/><br/>Translator: 549690339<br/><br/>When the Hobsons were trending online, Allonzo Hobson looked into who had posted the message.<br/><br/>However, after Kevin Clark and Allonzo Hobson arrived, it was discovered that the instigator —the Butch family — was not among these parents.<br/><br/>So Allonzo Hobson laid it out for the parents: “Bring the Butches over, or there’s no point in resolving this. It’s just a trending topic, the Hobsons and the Turners can afford it.”<br/><br/>While waiting for the Butch family to arrive, they all retreated outside the office.<br/><br/>To avoid the headache of the cacophonous parents, only Skyler Thomas stayed behind to negotiate and appease the parents.Discover new chapters at novelhall.com<br/><br/>On the way, Skyler Thomas had already gotten a rough idea from Marsh Turner.<br/><br/>Marsh Turner mentioned nothing about Daisy Zane, only that they had bullied William Butch.<br/><br/>Skyler Thomas understood, but what she could do was limited; after all, William Butch was very fragile, and a testimony from him was highly unlikely, given the requirement for evidence.<br/><br/>All she could do was delay the proceedings and counsel the parents.<br/><br/>James Butch’s parents arrived quickly, before Austin Allen could fully grasp the information in Daisy Zane’s possession.<br/><br/>But Daisy Zane always cooperated well with him.<br/><br/>Whatever she could throw, he could catch.<br/><br/>With the arrival of the Butch family, everyone proceeded to the office.<br/><br/>Daisy Zane followed behind Allonzo Hobson and the Turner family. As she was about to step through the entrance, Austin Allen stopped her: “Lucia, give me an idea of the extent we’re dealing with here.”<br/><br/>Hearing him speak, everyone stopped in their tracks, then heard Daisy Zane respond impassively, “I don’t intend to keep it private. And they’re all of legal age.”<br/><br/>Her soft-spoken words sent shockwaves through everyone.<br/><br/>That they were all of age meant they could be criminally convicted.<br/><br/>Daisy Zane did not intend to leave them any way out.<br/><br/>The Turner couple, meeting her for the first time, didn’t expect her to be so ruthless.<br/><br/>And Marsh Turner was stunned too. His understanding of Daisy Zane was far too one-sided.<br/><br/>But the others were evidently used to this side of her.<br/><br/>Austin Allen smiled, “Alright, understood.”<br/><br/>They all entered the office.<br/><br/>The spacious office suddenly felt crowded.<br/><br/>The Principal even started to question whether the placement of this table was unlucky, causing him to deal with such a major issue.<br/><br/>After everyone took their seats, Allonzo Hobson cut right to the chase saying, “Let’s hear it. How are you going to compensate the Hobsons, the Turners, my mother, and my personal reputation for the damage done.”<br/><br/>The Hobsons, who had just found chairs and were about to sit down, looked bewildered: “???”<br/><br/>People: “???”<br/><br/>Daisy Zane let out a soft laugh.<br/><br/>Kevin Clark squeezed her hand and seeing her laugh, he too let out a smile.<br/><br/>The parents of the remaining five families had been incited by the Butches to come here, following the Butches’ orders.<br/><br/>Now that the Butches were here, they instantly became the quiet ones, with everyone looking to the Butches for cues.<br/><br/>Henry Horton hadn’t anticipated that Allonzo Hobson would say such a thing. He chuckled, “Young Master Hobson, afraid you’ve got it mixed up. My son is the one hospitalized. Shouldn’t the Hobsons and the Turners give me an explanation?”<br/><br/>Just as Mr. Turner was about to respond, Allonzo Hobson patted his hand under the table, signaling him not to worry, he had it. “What has your son’s hospitalization got to do with us? Isn’t it his just deserts?”<br/><br/>Mrs. Butch said, “Young Master Hobson, isn’t that a bit too harsh? What do you mean, ‘his just deserts’?”<br/><br/>“He’s engaged in school bullying, so he deserves it.” Allonzo Hobson had already gotten an idea of the situation from Marsh Turner.<br/><br/>He knew his younger brother best, and he would never hit someone without a reason.<br/><br/>“What evidence do you have that he’s engaged in school bullying?” James Butch’s father interjected, “He was beaten so badly, it seems he’s the one being bullied. Young Master Hobson, you better not slander people!”<br/><br/>The Butches were counting on the fact that the Hobsons, as a family involved in the entertainment industry, greatly valued their reputation.<br/><br/>That’s why they stirred up public opinion, hoping to restrain the Hobsons with the power of the online public, while they concentrated their firepower on the Turners.<br/><br/>As long as they took down the Turner family, the fact that James Butch was beaten would stand. They would be the victims.<br/><br/>The Hobsons, under public pressure, would then hesitate, even if they retaliated later, not daring to do it openly.<br/><br/>Moreover, any future crisis for the Butches would lead everyone to suspect that the Hobsons were pulling the strings.<br/><br/>Believing that the Hobsons would be swayed by public opinion and wouldn’t dare to do anything to them, gave the Butches the audacity to act as they did.<br/><br/>But they were naive, thinking everyone else was as foolish as them.<br/><br/>The Hobsons had been in the entertainment industry for so long; taking them on with these tactics was asking for trouble.<br/><br/>Hearing their conversation, Daisy Zane tossed her cell phone onto the table. The sound of the impact drew everyone’s attention to her.<br/><br/>Skyler Thomas, sitting next to her, was startled.<br/><br/>Daisy Zane stated, “Evidence.”<br/><br/>After she spoke, she turned her gaze toward the Butch couple. Her beautiful phoenix eyes filled with coldness, “Not only the evidence of his bullying, but also of his long-term bullying. It’s all in here.”\t\t\t\t\t\t</div>", "images": {}, "success": true}