{"id": 340, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391209.html", "title": "Chapter 340 - 315: Our Side_2", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 340 - 315: Our Side_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 340: Chapter 315: Our Side_2<br/><br/>Translator: 549690339<br/><br/>After she looked at everyone, she also looked at Austin and Joseph.<br/><br/>Then the three words ‘Wild Man’ floated through her mind.<br/><br/>Mr. and Mrs. Turner looked at Austin, their hearts sinking for a moment, their first thought was that the other party had actually brought in Austin, the top lawyer.<br/><br/>Do they still have a chance of winning?<br/><br/>Or do they need to give money to settle the matter privately?<br/><br/>Mr. Turner looked at Marsh Turner and glared at him.<br/><br/>This little bastard, causing trouble, if he had known 18 years ago when he was still just a cell, he should have killed him.<br/><br/>Isn’t their world as a couple good enough? Why bring such an ancestor to trouble themselves?<br/><br/>“Daisy.” Marsh Turner stepped in front of Daisy Zane and glanced at the two people beside her before whispering, “Why did you come here? You don’t have to worry about this, I have a way to solve it, there won’t be any problems. Don’t worry, don’t get you in trouble ”<br/><br/>Before Marsh Turner finished speaking, he saw a shadow out of the corner of his eye, and then he saw Daisy Zane being pulled away.<br/><br/>He frowned and turned to look.<br/><br/>Arthur North’s deep, stern eyes met his, and he stumbled to the side with a start, “Th-Third Master.”<br/><br/>Arthur North glanced at the boy who was talking so close to him and wrapped Daisy Zane’s hand in his palm, looking down at the little girl next to him.<br/><br/>Daisy Zane looked up at him and raised her eyebrows, “Third Master, what a coincidence.”<br/><br/>Arthur North snorted lightly, “Yes, quite a coincidence.”<br/><br/>Joseph looked at the two of them and laughed quietly.<br/><br/>At this time, Mr. Turner stepped forward and shook hands with Austin and Joseph first, “Mr. Allen, Lawyer Allen.”<br/><br/>“Mr. Turner.” Austin and Joseph also courteously returned the greeting, “Mrs. Turner.”<br/><br/>Allonzo Hobson shrugged his shoulders and said nothing.<br/><br/>Mr. Turner still didn’t quite dare to believe it and looked at Daisy Zane.<br/><br/>Daisy Zane looked at him calmly and said, “This has nothing to do with Marsh Turner. I hit those people.”<br/><br/>Arthur North looked at her.<br/><br/>Allonzo Hobson’s face twitched.<br/><br/>Mr. and Mrs. Turner: “!!!”<br/><br/>Daisy Zane didn’t pay attention to them and continued, “Marsh Turner took the blame for me.”<br/><br/>“Daisy, I’m the one who broke James Butch’s rib.” Marsh Turner said.<br/><br/>Daisy Zane glanced at him and then at Allonzo Hobson, “The Hobson family is implicated in this.”<br/><br/>Allonzo Hobson immediately responded, laughing nonchalantly, “It’s a small matter, what does it matter.”<br/><br/>Daisy Zane looked at Marsh Turner’s parents and paused before saying, “I’m sorry for implicating Marsh Turner. I’ll handle this matter properly.”<br/><br/>Her voice was cold, but the sincerity could be heard.<br/><br/>Arthur North held her hand and tightened his grip a little. His thumb gently stroked the back of her hand.<br/><br/>Austin and Joseph both looked at her but said nothing.<br/><br/>“No, Daisy,” Marsh Turner hurriedly said, “I really did hit James Butch. It has nothing to do with you.”<br/><br/>Allonzo Hobson was startled by her apology, “Lucia, like I said, we’re family. No need for courtesies.”<br/><br/>Daisy Zane looked at him and said, “Arthur North said not to pretend to be close.”<br/><br/>Allonzo Hobson:<br/><br/>A hint of amusement appeared in Arthur North’s eyes.<br/><br/>Mr. and Mrs. Turner also quickly reacted, “Since Allonzo’s friend, there is no need for these courtesies. And Marsh Turner has also taken responsibility.”\t\t\t\t\t\t</div>", "images": {}, "success": true}