{"id": 342, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391217.html", "title": "Chapter 342 - 317: Watching The Bustle, Unfolding On Oneself", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 342 - 317: Watching The Bustle, Unfolding On Oneself</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 342: Chapter 317: Watching the Bustle, Unfolding On Oneself <br/><br/>Translator: 549690339 <br/><br/>The cell phone was thrown on the table, all eyes were on it, no one spoke. <br/><br/>Then under everyone’s gaze, Daisy Zane picked up the phone again, unlocked it, and connected it to the projector on the table. She played a video. <br/><br/>It was a surveillance video, a bit blurry, but it didn’t interfere with identifying the people. The date at the top left showed it was from two years ago in May. <br/><br/>Even across the screen, one could feel the force, the brutality every time a punch or kick landed. <br/><br/>The video that lasted less than three minutes ended. <br/><br/>Daisy Zane played another one. It was also a surveillance video, but from last year. Both videos were found by Holt Lawrence during his investigation of William Butch. <br/><br/>The same perpetrators were still there, only this time the person being beaten was not lying on the ground but sitting on it. <br/><br/>At the start, he was covering his head with his hands, burying his face between his knees. But then he was forced to raise his head by James Butch grabbing his hair. <br/><br/>Even though his face is blurred after the head is lifted, it can still be clearly seen that James Butch slapped him several times. <br/><br/>The video was silent, yet everyone there seemed to hear the slaps. <br/><br/>Skyler Thomas watched, her hands on her thighs tightly clenching, her eyes instantly reddening. She knew, of course, the person being beaten was William Butch. <br/><br/>Just by looking at his physique, William Butch then was even smaller, thinner than he is now. <br/><br/>The entire office was so quiet you could hear a pin drop. <br/><br/>Daisy Zane looked at the parents across the table and said coldly, “See for yourselves whose children they are.” <br/><br/>The parents who had just caused the most ruckus were now not just quiet, they wished they could disappear on the spot. <br/><br/>Their children might return home with bruises, but generally, nothing serious ever happened. But now, not only could they take no advantage, but they could also get into trouble. <br/><br/>Mr. and Mrs. Butch watched the video. After it finished and a while passed, Mrs. Butch tugged at the sleeve of Mr. Butch. <br/><br/>Mr. Butch turned directly to Daisy Zane, glaring at her with a murderous look on his face: “Who are you? What does all this have to do with you? These videos are old, why bring them out now? When children are little, there are inevitably some frictions, and small fights are a common occurrence. Besides, what we are discussing now is my son getting beaten, what purpose does it serve to play these videos? What significance does it have! Does showing these videos conceal the fact that my son was seriously injured by Marsh Turner?! Was Marsh Turner the one being beaten in these videos!” <br/><br/>“If the person being beaten in the video was Marsh Turner, do you think you would still see your son?” Mr. Turner said coldly. Discover new chapters at novelhall.com<br/><br/>Daisy Zane restored the surveillance footage from the dark alley yesterday. <br/><br/>The footage showed her following James Butch’s group into the alley. <br/><br/>She looked at the video and said, “Marsh Turner entered later. So how can you determine that Marsh Turner was the one who hit someone? Because only Marsh Turner showed his face, so the ones framing and slandering are you.” <br/><br/>“The crime of false accusation and framing ” Austin Allen suddenly spoke up in a light voice, “In severe cases, one can be sentenced to imprisonment for up to three years, if it causes serious consequences, imprisonment for three to ten years.” <br/><br/>It was unclear whether Mr. and Mrs. Butch were too focused on Skyler Thomas’ outburst, or Austin Allen had kept a low profile when he came in. <br/><br/>It was then that the Butch Family noticed Austin Allen’s presence. <br/><br/>The instant Mr. Butch saw Austin Allen, Daisy Zane felt like he almost didn’t manage to catch his breath and passed out: “Au, Austin?!” <br/><br/>Austin Allen adjusted his glasses, showing a professionally polite smile, “Mr. Butch, hello. I represent the victim of the bullying. Let’s first deal with your matter, later we will talk about our issue.” <br/><br/>Upon hearing this, Mrs. Butch was utterly shocked, her eyes completely blank. <br/><br/>Mr. Butch suddenly collapsed in his chair. <br/><br/>The parents’ faces were also ashen. <br/><br/>Skyler Thomas let out a scoffed laugh. <br/><br/>Daisy Zane glanced at them and continued playing the audio. It was recorded in the alley before she started fighting last night, as well as her conversation in a male voice asking Daniel Brown’s group why they were looking for Daisy Zane. <br/><br/>“Why are you looking for Daisy Zane?” <br/><br/>The moment these words were spoken, Arthur North’s casual expression changed. <br/><br/>After hearing what Daniel Brown said later, his expression became increasingly horrified. He was so focused on listening to what Daniel Brown was saying that he completely ignored Daisy Zane’s voice. <br/><br/>Arthur North had initially come today to see Daisy Zane. <br/><br/>When Skyler Thomas saw the news online, he was with Arthur North. Knowing that Skyler Thomas was going to school, and since Arthur North had some time, he came along, thinking of seeing Daisy Zane in passing. <br/><br/>He came with the mentality of watching the commotion, but did not expect the commotion would involve himself. <br/><br/>All tenderness disappeared from Joseph Allen’s and Austin Allen’s faces. <br/><br/>The places in the audio where Daniel Brown’s name was mentioned were muted, leaving only Daisy Zane, Marsh Turner, and Daniel Brown’s voices. <br/><br/>Daisy Zane said: “This audio is from the alley last night, according to evidence provided by the informer, it can all prove that Marsh Turner wasn’t the one who hit people. When the police get involved, this informant can also cooperate with the police investigation. Mr. Butch, your son’s issue is more than just bullying.”\t\t\t\t\t\t</div>", "images": {}, "success": true}