{"id": 354, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391265.html", "title": "Chapter 354: 325: The End Of The Show_3", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 354: 325: The End Of The Show_3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 354: 325: The End of the Show_3<br/><br/>Translator: 549690339<br/><br/>Celeste Martin went up to the podium, took the certificate from Skyler Thomas’s hand, and placed it in front of her obediently.<br/><br/>Then, she also gave a speech.<br/><br/>Celeste Martin’s voice was soft and gentle, and her attitude was sincere. She summarized her experiences over the past two weeks and thanked several classmates specifically.<br/><br/>When she got to the part about not wanting to leave, her voice became choked up and her eyes teared up.<br/><br/>No one likes farewells, especially these naive students.<br/><br/>With tears in Celeste Martin’s eyes, some of the girls in the class also became teary-eyed.<br/><br/>Olivia Lane watched Celeste Martin and then turned to Daisy Zane and said, “You might want to get some inspiration from her.”<br/><br/>“Inspiration for what?” Daisy Zane asked.<br/><br/>Olivia Lane looked at Daisy Zane’s indifferent expression and cold demeanor, fearing that if she went up there like she had insulted her yesterday, she might insult the entire class.<br/><br/>Then would the students in this class chase her and beat her up?<br/><br/>Oh, the people in this class wouldn’t be able to beat her even if they tried.<br/><br/>When Celeste Martin finished speaking, there was applause from the class, which lasted for a while. When Celeste Martin and George Dunn stood beside the podium, tears fell from their eyes.<br/><br/>George handed her a tissue.<br/><br/>Skyler Thomas was also moved by Celeste’s speech, and when she started speaking, her voice had turned hoarse.<br/><br/>She cleared her throat and began to read Daisy Zane’s comments: “Education does not equal knowledge, but knowledge is always one of the necessary factors to enrich one’s heart. Despite many difficulties, she never backed down. Despite many difficulties, she never gave up. Even in unfavorable conditions, she can still stand at the top. She has paved her own broad and flat road with her own abilities. True gold fears no fire. Gold will always shine wherever it goes.”<br/><br/>Skyler Thomas looked at Daisy Zane: “But I think she is more like a brilliant star. A star that can illuminate the darkness, a star that can dispel the darkness for others. A light that shines bright, putting an end to eternal night.”<br/><br/>Everyone looked at Daisy Zane.<br/><br/>Daisy Zane looked at Skyler Thomas calmly, without any change in her expression. Just a few seconds later, a faint smile appeared at the corners of her mouth.<br/><br/>She got up, walked over to where Skyler Thomas was, and took the certificate from her.<br/><br/>Skyler Thomas smiled at her and stepped aside, giving the podium to Daisy Zane.<br/><br/>All the students in the class stared at Daisy Zane, confused about why she was suddenly bringing this up and why the conversation took such an abrupt turn.<br/><br/>Daisy Zane looked at the puzzled faces and said, “Marsh Turner said he wants to be the grade topper in this mid-term exam.”<br/><br/>The whole class was stunned: “?????”<br/><br/>Daisy Zane looked at George Dunn and Turner Daniel: “Both of you were there when he said it, right? You both heard it.”<br/><br/>George, holding back laughter, said, “I can vouch for that.”<br/><br/>Turner Daniel glanced at her and added, “I heard it too.”<br/><br/>Celeste Martin looked utterly lost.<br/><br/>Daisy Zane nodded, “Since Marsh Turner isn’t here today, we have to be men of our word. When we leave, everyone have to help supervise Marsh Turner.”<br/><br/>It took a while for the class to gradually understand. Someone laughed and shouted, “Daisy, we’ll keep an eye on him for you.”<br/><br/>“Yeah, we’ll watch him.”<br/><br/>Daisy Zane nodded and continued at a slow pace, “Marsh Turner will be a responsible person. So those ahead of him should be careful. As for those behind him I hope you follow Marsh Turner’s ranking and move forward together.”<br/><br/>The class finally understood and fell silent, listening to Daisy Zane speak.<br/><br/>Skyler Thomas also looked at her, her eyes more determined and confident. Their class would be a champion class.<br/><br/>“With Marsh Turner as the dividing line, it’s up to you who steps on whom,” Daisy Zane’s fingers tapped on the results sheet, speaking softly, “It’s only been a month since the start of school, so there’s still a year left.”<br/><br/>Daisy Zane looked at each student, who seemed to be listening quietly and attentively, although their thoughts may have been elsewhere.<br/><br/>Even if they’re thinking about working hard now, how long will the enthusiasm last?<br/><br/>But she still said what she wanted to say. She looked around the class one last time and finally set her eyes on Olivia Lane, “Next September, I hope to see all of you on the Imperial Capital University admission list.”<br/><br/>Her words may not have much impact, and their short-lived enthusiasm might not last long.<br/><br/>But what if someone takes the lead?<br/><br/>She trusted both Marsh Turner and Olivia Lane, and she also had expectations for William Butch.<br/><br/>In fact, the future of this class is limitless.<br/><br/>Daisy Zane’s mouth curled into a smile, and her cold voice gave a sense of unshakable conviction: “I hope you all make the most of your youth and enjoy a bright future.”\t\t\t\t\t\t</div>", "images": {}, "success": true}