{"id": 359, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391285.html", "title": "Chapter 359 - 329: Like Me", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 359 - 329: Like Me</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 359: Chapter 329: Like Me <br/><br/>Translator: 549690339 <br/><br/>After dinner, Daisy Zane took her computer back to her room, looking up materials and finding many campus bullying cases. <br/><br/>Those who made it through, the tragedies that occurred, living life with shadows <br/><br/>She went through those cases one by one, and it wasn’t until past eleven o’clock that she fell asleep on the bay window, hugging her computer. <br/><br/>After dinner, Kevin Clark went to the study room to sort things out. Around 1:30, he checked the time, put down what he had in hand, and went back to his room to check on the little girl. <br/><br/>Then he saw the little girl sleeping on the bay window, and the window was open. Even the window on the balcony on the other side was open. <br/><br/>He slightly frowned and stepped closer to see that Daisy Zane’s forehead and neck were covered with beads of sweat. Her brows were also slightly furrowed. <br/><br/>Kevin Clark looked at the computer in her arms and then reached out to touch her face, “Little girl.” <br/><br/>Daisy Zane furrowed her brows again, and two seconds later, she slowly opened her eyes. <br/><br/>However, she didn’t look up at Kevin Clark. Th.ê most uptodate novels are published on n(0)velbj)n(.)co/m<br/><br/>She felt Kevin Clark’s approach, and that made her come out of her dream. <br/><br/>Kevin Clark’s thumb rubbed her face, waiting for a moment, and then he called her again, “Little girl.” <br/><br/>Daisy Zane blinked her eyelashes gently, and then pressed her brow, “I’m alright.” <br/><br/>Kevin Clark placed the computer aside, sat beside her, and asked softly, “What’s wrong? Did you have a nightmare?” <br/><br/>“I dreamt about Jack Amos.” <br/><br/>Although she didn’t remember Edward Kirsten’s face, her nephew Charles Amos didn’t look like his uncle in the slightest. <br/><br/>He doesn’t look like Harris Kirsten, and he doesn’t look like Jack Amos either. <br/><br/>If he resembled Harris or Jack Amos, she could recall the past when she looked at him. <br/><br/>If he looked like Edward Kirsten, he might even help her find Edward Kirsten. <br/><br/>But he ?doesn’t look like anyone. <br/><br/>“Don’t they all say that Charles Amos looks like me?” Kevin Clark said. <br/><br/>Daisy Zane: <br/><br/>“Fate, I guess.” <br/><br/>“He ?isn’t as good-looking as you,” Daisy Zane said. <br/><br/>Hearing this, Kevin Clark lowered his head and smiled. <br/><br/>But just as he lowered his head, his smile froze on his lips. <br/><br/>Daisy Zane was wearing a silk nightgown tonight, and as she bent her leg, the nightgown slipped down <br/><br/>From where Kevin Clark was sitting, with his head down, it was indeed ?convenient. <br/><br/>His smile disappeared from the corner of his lips, and after a moment, he picked up another blanket and covered her legs with it. <br/><br/>Daisy Zane hadn’t noticed at first, but when he covered her with the blanket, it dawned on her, and she instinctively put her leg down. <br/><br/>Kevin Clark looked up at her, and the laughter in his eyes deepened. <br/><br/>But just as he was about to say something, Daisy Zane’s phone suddenly rang, and the words he was about to say got stuck in his mouth.\t\t\t\t\t\t</div>", "images": {}, "success": true}