{"id": 353, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391261.html", "title": "Chapter 353: 325: The End Of The Show_2", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 353: 325: The End Of The Show_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 353: 325: The End of the Show_2<br/><br/>Translator: 549690339<br/><br/>Daisy Zane looked at Olivia Lane, who sat huddled together with herself as if she was a child who had done something wrong.<br/><br/>Suddenly, Daisy Zane’s head throbbed with a sharp pain, and many blurry images flashed through her mind. She staggered to the side and subconsciously tried to find support, gripping Olivia Lane’s fingertips tightly.<br/><br/>Catching a glimpse of Daisy’s stumble in the corner of her eye, Olivia quickly tightened her grip as well and stood up. With her other hand, she held Daisy’s arm: “What’s wrong with you?”<br/><br/>Daisy touched her temples: “I stood up too quickly.”<br/><br/>Olivia looked at her and saw through the lie: “You’ve been up for almost a minute.”<br/><br/>Daisy didn’t change her expression: “There is a delay.”<br/><br/>Olivia: Did she look that easy to fool?<br/><br/>“Going to class?” Daisy asked.<br/><br/>“Are you sure you’re okay?”<br/><br/>“I’m fine.”<br/><br/>“Let’s go back after the next class.” Olivia picked up the water on the ground and took a sip.<br/><br/>“Okay.”<br/><br/>Daisy agreed and sat back on the steps. After a while, she took out her cell phone and texted Holt Lawrence: [Find me a psychologist who is good at hypnosis.]<br/><br/>After typing this, Daisy’s fingers hovered over the send button for a moment before deleting the entire text.<br/><br/>She closed her phone as well.<br/><br/>As the program recording drew to a close.<br/><br/>On the last day of recording on Friday, they recorded until the very last class of the day.<br/><br/>A certificate with the Gathering Joy Private School stamp, and four big characters written on the certificate besides their names: “Bright Future.”<br/><br/>Skyler Thomas began, in a formal tone: “Turner Daniel. A young genius who became famous in his youth. Entered Imperial Capital University with a total score of 741. Graduated from university at the age of 18. A backbone in the young team.”<br/><br/>Turner Daniel:<br/><br/>“Come on, Turner Daniel, come up and receive your award.”<br/><br/>Turner Daniel did not want to move, but he still went up. He held the certificate in both hands and gave a short speech.<br/><br/>His speech could be divided into three parts: discussing his feelings about the past few weeks, thanking everyone for their care, and giving his wishes to the classmates in the class and looking forward to the future.<br/><br/>“Hmm do students have to go through this process in school?” Daisy Zane asked Olivia Lane while watching Skyler Thomas adjust Turner Daniel’s certificate for him.<br/><br/>Olivia Lane said expressionlessly: “If Skyler Thomas dares to do this, I won’t be the top student for her.”<br/><br/>Daisy Zane raised the corner of her mouth and smiled.<br/><br/>Next up was George Dunn. Skyler Thomas said, “George Dunn. Beneath the mature exterior lies a youthful heart.”<br/><br/>George Dunn:<br/><br/>Daisy Zane chuckled.<br/><br/>The classmates in the class also laughed.<br/><br/>Skyler Thomas continued: “With excellent grades, George has the courage to pursue his interests and achieve excellence in what he loves. Despite his many experiences, he remains a youth at heart.”<br/><br/>Following the same procedure, George Dunn went on stage to receive the award and give a speech.<br/><br/>He was originally holding the certificate with one hand, but Skyler Thomas forcibly positioned his other hand on the other side of the certificate and placed it in front of him.<br/><br/>While speaking, George Dunn allowed Skyler Thomas to rearrange him as needed.<br/><br/>The third person was Celeste Martin. The comment Skyler Thomas gave was: “Beautiful inside and out, always willing to help others, lively and cheerful. She shines in the field she loves and, at a young age, has been able to enter the Court Music Academy. She has never given up any effort for her dreams. Her delicate frame conceals an enormous energy.”\t\t\t\t\t\t</div>", "images": {}, "success": true}