{"id": 355, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391269.html", "title": "Chapter 355: 326: Bad Reputation", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 355: 326: Bad Reputation</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 355: 326: Bad Reputation<br/><br/>Translator: 549690339<br/><br/>With twenty minutes left in the final class, the director allowed the eight of them recording the program to leave early.<br/><br/>Today is Friday, and many parents are arriving to pick up their children.<br/><br/>The traffic is gradually building up.<br/><br/>And fearing the school entrance would be swarmed by paparazzi, the Clark family’s people came again.<br/><br/>During lunch today, they had packed up their dormitory belongings, which were now placed in the dormitory building’s great hall.<br/><br/>After leaving the teaching building, they went to the dormitory to get their luggage and walked out with the program staff.<br/><br/>“Oh my God, it’s finally over,” said Serena Buster,”I need to sleep all day tomorrow.”<br/><br/>“Right, my spirit has been greatly tormented.” said one of the boys.<br/><br/>“This money it’s not easy to earn.” said another boy, “I hope this show goes on for several seasons to torment other people too.”<br/><br/>“Haha, you’re so wicked,” Serena Buster laughed.<br/><br/>As they walked out and saw the school’s main gate, the first thing they noticed were the people standing guard at the entrance.<br/><br/>Just like day one of recording, they were dressed in black, hands behind their backs, standing straight, face expressionless.<br/><br/>They didn’t look like people to mess with.<br/><br/>“I’ve been wanting to ask since the first day we came to record,” whispered one of the boys, “where did these people come from? They’re so intimidating.”<br/><br/>George Dunn knew but kept quiet.<br/><br/>Turner Daniel recognized the Clark family’s emblem and glanced at Daisy Zane but didn’t say anything.<br/><br/>“Yeah, I’ve been wanting to ask too,” said another boy, “I looked up their emblem, and it seems to belong to the Clark family.”<br/><br/>Someone gasped, “The Clark family! Is it that Clark family?”<br/><br/>“What other Clark family could it be?”<br/><br/>Celeste Martin listened to their conversation and looked at Daisy Zane.<br/><br/>Daisy Zane was chatting with Allonzo Hobson, not participating in their topic, nor paying attention to their gaze.<br/><br/>Allonzo Hobson: [Brook Sister, James Butch said there is a follow-up video of the bathroom incident, where William Butch denies they hit him.]<br/><br/>Daisy Zane kicked down the bathroom door, and initially, William Butch didn’t say anything. Later when Skyler Thomas said he would take them to the principal,<br/><br/>afraid of retaliation, William Butch immediately said that James Butch didn’t hit him and that it was an accident. James and his friends also said that they did not hit anyone, just trying to help him up.<br/><br/>Daisy Zane replied to the message: [If he says it exists, let him produce the evidence.]<br/><br/>All the recording devices are networked together.<br/><br/>She intercepted the video by hacking into the program team’s equipment.<br/><br/>The subsequent part of the video was destroyed. Not only James Butch, even the program team couldn’t find it.<br/><br/>Allonzo Hobson: [Then I can rest assured. Actually, even if it’s found, it doesn’t matter. It’s just troublesome. This way is more convenient. Also, Brook Sister, you and George Dunn should be aware that since George is in the video, the police will find him.]<br/><br/>Daisy Zane: [Mhm.]<br/><br/>Not just George Dunn, she will also have to cooperate with the investigation tomorrow morning.<br/><br/>Her cold stare immediately caused Celeste to stop in her tracks and sheepishly look away.<br/><br/>Daisy Zane didn’t linger on her for another second, directing her gaze forward once more.<br/><br/>Upon reaching the entrance, everyone began to look for their respective assistants. Daisy Zane also looked around. Right when she saw Anisa Cooper hopping and waving at her, a person standing beside her came over.<br/><br/>Everyone was still inside the school gates, and the assistants were outside, as the supervisor hadn’t allowed them in.<br/><br/>A person from the Clark family’s security team suddenly approached them, leaving onlookers in a brief state of confusion.<br/><br/>They stared in shock as the man walked up to Daisy Zane, bent down, and respectfully said, “Lady Zane, Third Master is waiting in the car. I can take your luggage over for you.”<br/><br/>Daisy Zane handed him her suitcase, “Thank you.”<br/><br/>The three gossiping people froze as they stared at Daisy Zane.<br/><br/>Last week when Director Nash called her boyfriend “Third Master ”<br/><br/>Everyone called that person from Ye’s family Third Master Clark.<br/><br/>So They were the same person!<br/><br/>Third Master Clark was her boyfriend!<br/><br/>That’s why so many people were guarding the place for her!<br/><br/>Ah ah ah ah ah!<br/><br/>What did they all say just now? What did they say!<br/><br/>The program staff, who had been leading the group, had almost finished their tasks and were waiting for the students to leave school before dismantling the equipment.<br/><br/>Director Nash came over and spoke a few words, then said, “Everyone, go home for today. We will gather at noon tomorrow to discuss the next steps. Well, we will record some thoughts on the program’s conclusion.”<br/><br/>Several people responded.<br/><br/>Director Nash continued, “Alright, let’s go. So as not to disturb the order when the students leave school later.”<br/><br/>The group headed to the entrance, where their assistants came to greet them.<br/><br/>Anisa Cooper rushed over and hugged Daisy Zane directly before separating again, “Daisy, I missed you so much.”<br/><br/>Daisy Zane pinched her face, “It’s only been two weeks.”<br/><br/>“But I feel like I haven’t seen you for so long.” Anisa Cooper finished speaking and then exchanged greetings with others who had joined the show, especially Serena Buster and George Dunn, “Daisy, let’s go. Third Master is in the car. There are so many people here; he didn’t get out.”<br/><br/>“Alright.”<br/><br/>Daisy Zane agreed, then looked at George Dunn and the others. Her eyes signaled that she was leaving first.<br/><br/>George Dunn and the others also nodded in response.<br/><br/>Then Daisy Zane looked at the three stupefied people, paused for a moment, and said, “Farewell, for now.”<br/><br/>After saying that, she left with Anisa Cooper.<br/><br/>As for the three stupefied people, their expressions changed drastically all of a sudden.<br/><br/>The fear of being on the brink of death was displayed unabashedly, even frightening their assistants.<br/><br/>What they heard was not merely the four words “Farewell, for now.”<br/><br/>Rather, it was as if a devil was whispering in their ears, “Harton Clark will personally come and slit your throats one by one to fertilize the lotus as manure!”\t\t\t\t\t\t</div>", "images": {}, "success": true}