{"id": 358, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391281.html", "title": "Chapter 358 - 328", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 358 - 328</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 358: Chapter 328 <br/><br/>Translator: 549690339 <br/><br/>Arriving at the Rose Garden, Daisy Zane went back to her room first and changed her clothes. <br/><br/>She randomly picked a skirt and came out from the cloakroom. <br/><br/>But as she tried to leave the room, Kevin Clark blocked her way back in. <br/><br/>Kevin Clark looked down at her, his school uniform off, exuding an icy and breathtaking aura. The restrained demeanor he had while wearing the uniform disappeared completely. <br/><br/>“What?” Daisy retreated a few steps, cornered by him. <br/><br/>Kevin Clark trapped her in a dead angle, looking down at her, his narrow eyes seemingly capable of sucking people in. “Little girl, I’m now the boss of Easton Group.” <br/><br/>“Oh, then we aren’t familiar.” <br/><br/>“Really?” Kevin stepped closer, “Since we’re not familiar how about we get to know each other better?” <br/><br/>Daisy Zane: <br/><br/>“Hm?” <br/><br/>Daisy put her hand on his shoulder, not letting him get any closer. “Third Master it’s not even completely dark yet, keep your thoughts clean.” <br/><br/>Kevin raised his eyebrows and laughed softly, “Where are my thoughts unclean?” <br/><br/>Daisy Zane: <br/><br/>“Getting to know each other better, exchanging hearts, do we have to wait until it’s completely dark?” Kevin asked, kissing her ear gently. “What’s unclean about that?” <br/><br/>Daisy Zane: <br/><br/>“Little girl, what are you thinking?” Kevin’s voice was filled with laughter, like a bewitching demon. <br/><br/>Daisy looked at him, her eyes growing colder by the second. And just as Kevin thought he might get hit if he continued to tease her, Daisy punched him in the ribs. <br/><br/>“Hiss -” Kevin leaned on the wall, bending over instantly. <br/><br/>Daisy, whose hand had been resting on his shoulder, gently pushed him away. <br/><br/>She then glanced at him indifferently, opened the door, and left. <br/><br/>The door opened and then closed again. <br/><br/>Kevin leaned against the wall, his hand over his ribs. Seeing the little girl didn’t seem to show any remorse for her actions, his heart sank <br/><br/>He lowered his hand, stood up straight, chuckled lightly, and left the room too. <br/><br/>It seems she was really annoyed, but the strength of the punch wasn’t too harsh. <br/><br/>Kevin also went back to his room and changed into more casual clothes. When he went downstairs, Daisy was sitting on the carpet arranging flowers. <br/><br/>She was trimming the roses he’d bought in the afternoon and was placing them in a vase. <br/><br/>This was the first time Gael had heard Charles address him as ‘uncle’ since they had known each other. <br/><br/>Gael didn’t think too much about it and immediately went forward to try and grab Charles back. <br/><br/>At the same moment when Gael clashed with the men, Wilton Edwards arrived on the scene. <br/><br/>Upon seeing this, Wilton didn’t hesitate for a second and immediately went to help. <br/><br/>There had always been guards posted around the villa’s perimeter, but for those exceptionally skilled, it was still possible to sneak in. <br/><br/>As the commotion in the room escalated, sounds of fighting could be heard around the villa. <br/><br/>More than two men in black had arrived. However, the others hadn’t managed to enter the villa. <br/><br/>These two men in black were highly skilled and strong. <br/><br/>However, both Gael and Wilton also possessed top-tier skills. <br/><br/>Moreover, the enemies were burdened with holding Charles, inevitably limiting their movements. <br/><br/>If it had been just Wilton alone today, he might not have been able to defeat the two of them. But with Gael there, the two of them were more than a match for the men in black. <br/><br/>“Wilton, we’re just taking the young master back. If you know what’s good for you, come back with us,” one of the men said. <br/><br/>Wilton blocked his fist while simultaneously striking back. The other man dodged and replied, “The lady has said that no one can take the young master away.” <br/><br/>“Wilton, don’t be stubborn.” The man tried again, “The lady will eventually return, too. Henry Kirsten has already rebuilt his entire power base. How long do you think you can last in the outside world?” <br/><br/>“Go fuck yourselves!” Gael suddenly snapped, “So, it’s Henry Kirsten’s men! What if he’s rebuilt his power base? We destroyed him once, we can do it again.” <br/><br/>As Gael spoke, he stabbed the corkscrew into the man’s shoulder. <br/><br/>With a muffled grunt of pain, the man almost dropped Charles. <br/><br/>Seeing this, the man fighting with Wilton called out, “Withdraw!” <br/><br/>Upon hearing this, the man holding Charles immediately threw Charles in their direction. <br/><br/>Gael’s expression changed, and he moved to catch Charles. <br/><br/>Wilton didn’t spare a thought for anything else other than catching Charles either. <br/><br/>Since shouting “Uncle Easton” earlier, Charles hadn’t uttered another word. <br/><br/>He didn’t want to cause any more chaos or disturb Wilton’s thoughts. <br/><br/>Gael caught Charles and took a few steps back until he was stopped by Wilton’s support. <br/><br/>By that time, the two men had already jumped out of the window and fled. <br/><br/>“Jeez, how did you get so heavy?” Despite his words of disdain, Gael still held Charles tightly. <br/><br/>Charles quickly hugged his neck tightly, gripping it tightly as his whole body trembled lightly. <br/><br/>Wilton hurriedly checked Charles’ body, his previous aggressiveness fading away, replaced by concern. <br/><br/>It was as if the decisive general on the battlefield had transformed into a worried old father: “Young master, are you hurt anywhere? Does anything hurt?”\t\t\t\t\t\t</div>", "images": {}, "success": true}