{"id": 351, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391253.html", "title": "Chapter 351: 324: If The Lane Family Tries To Kill Me _2", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 351: 324: If The Lane Family Tries To Kill Me _2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 351: 324: If the Lane Family Tries to Kill Me _2<br/><br/>Translator: 549690339<br/><br/>“Evan Silas, I’m saying it one last time, please mind your language! Your duty is not just to teach, but the more important task of educating!”<br/><br/>Evan Silas laughed quietly again, the mockery in his tone was very obvious: “With the kind of students you have in your class, you dare to talk about education with me? Hilarious! Academics are the top priority. Without good grades, not just your students, but you too wouldn’t amount to anything! After these students leave, you just wait for all the students and parents in the next grade to switch classes as soon as they hear your name.”<br/><br/>Skyler Thomas didn’t say a word, feeling that there was no need to talk to such a person.<br/><br/>“I’m just waiting to see how you’ll ruin your own reputation.” Evan Silas said, “I’m curious to see what your so-called ‘educating’ will bring forth. One last reminder, this is a private school. When your time is up, you’d better pray that the Hobson and Turner families intervene to save your job here.”<br/><br/>With that, Evan Silas left first.<br/><br/>Skyler Thomas stood in place for more than two minutes before leaving as well.<br/><br/>After they left, Daisy Zane looked at Olivia Lane.<br/><br/>Olivia Lane, having watched the excitement, looked back at her and said, “Originally, Evan Silas was supposed to be in charge of the 16th Class. But when he saw our class’s grades, he went to find the director. Since then, Class 16 hasn’t had a homeroom teacher.”<br/><br/>“Skyler Thomas isn’t she the original homeroom teacher of Class 8?” Daisy Zane said.<br/><br/>“Congratulations, you guessed it right.” Olivia Lane replied, “Evan Silas would rather be idle all day than come to Class 16. No one wanted to take responsibility for Class 16. The director came to watch us every day and taught our math classes. In the end Skyler Thomas volunteered to come here.”<br/><br/>Daisy Zane laughed.<br/><br/>This wasn’t just as simple as changing classes, it was equivalent to giving up the fame, fortune, and honor that were within reach.<br/><br/>No wonder Class 8’s teacher hated her so much.<br/><br/>She voluntarily took over this mess in Class 16.<br/><br/>In comparison, Evan Silas’s approach was just too disgraceful.<br/><br/>One was noble and selfless, the other was selfish and self-serving.<br/><br/>Without comparison, everything seemed fine, but with the contrast, Evan Silas’s pride had nowhere to hide.<br/><br/>Daisy Zane looked at her reaction and calmly said, “She comes back only to see her younger sister having achieved nothing, not even able to attend school. How do you think she would feel? Guilty for a lifetime, heartbroken for a lifetime?”<br/><br/>Olivia Lane’s lips trembled, and she looked up at her.<br/><br/>Her eyes were cold, but the rims were red. It was like the irritation of having one’s troubles exposed and the anger of having one’s wounds ripped open.<br/><br/>Seeing Olivia Lane like this, Daisy Zane didn’t plan on holding back and continued, “Or are you doing this on purpose because you don’t really like her, and you’re deliberately making her feel guilty when she comes back with a new life?”<br/><br/>“Daisy Zane, you’re talking too much today.” Olivia Lane finally spoke, her voice cold and hoarse.<br/><br/>Daisy Zane raised the corner of her mouth, looked into her eyes, and said something very provocative: “Or do you think Charlotte Lane will never come back?”<br/><br/>“Shut up!” Olivia Lane suddenly grabbed Daisy Zane’s collar, her eyes reddened even more, “Nonsense! My sister will definitely come back! She will come back!”<br/><br/>Daisy Zane glanced at her hand, holding her collar, and thought to herself how amazing she was.<br/><br/>She managed to make Olivia Lane hold her collar.<br/><br/>Holding her collar was one thing, not having her hit back was another.<br/><br/>She looked back at Olivia Lane’s reddened eyes, about to spill tears: “Since you’re so intent on ruining your future, I thought you believed she would never come back.”<br/><br/>“Daisy Zane!”<br/><br/>Daisy Zane grabbed her wrist, pulling her hand from her collar and looked straight into her eyes, cold and indifferent yet striking straight to the heart: “If I were your sister, seeing you like this, I wouldn’t want to come back.”<br/><br/>With that, she let go of Olivia Lane’s hand, and without looking at her again, walked straight down the stairs.<br/><br/>As she turned the corner, she heard Olivia Lane’s suppressed crying.<br/><br/>Daisy Zane sighed softly, walked to a place where Olivia Lane couldn’t see her, and kept watch while texting Harton Clark: [If the Lane Family comes after me, whose side will you be on?]<br/><br/>After two minutes, Harton Clark finally replied: [?]<br/><br/>After sending it, Harton Clark immediately followed up with another message: [On your side.]<br/><br/>Daisy Zane raised the corners of her mouth: [I made Olivia Lane cry, so tell William Lane to come pick her up. I guess she’s not in the mood for class anymore.]\t\t\t\t\t\t</div>", "images": {}, "success": true}