{"id": 350, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391249.html", "title": "Chapter 350: 324: If Chu Family Tries To Kill Me", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 350: 324: If Chu Family Tries To Kill Me</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 350: 324: If Chu Family Tries to Kill Me<br/><br/>Translator: 549690339<br/><br/>They had been playing games for a whole afternoon, enjoying a winning streak for an entire afternoon, with Daisy Zane and Olivia Lane staying on the rooftop.<br/><br/>They only considered going back down when there were twenty minutes left before class started.<br/><br/>But just as they went down less than five steps, they heard arguments coming from the ground floor.<br/><br/>Few people ever came to the rooftop.<br/><br/>Even the ground floor was already considered a relatively secluded area.<br/><br/>People tended to gather and hang out on the ground floor, but not many ever went up to the rooftop.<br/><br/>Hearing the voices, both of them stopped in their tracks and stood still.<br/><br/>Daisy recognized one of the voices as Skyler Thomas, while the other was a woman she had never heard before.<br/><br/>Olivia Lane typed a few words on her cell phone and showed it to Daisy Zane: [Skyler Thomas and Class 8 homeroom teacher]<br/><br/>Skyler Thomas could no longer bear it and blurted out, “Do you have some kind of problem?”<br/><br/>As if convinced of Skyler Thomas’s intentions, Evan Silas’s facial expression grew increasingly malicious, and there was even a hint of excitement.<br/><br/>This excitement seemed to suggest that he had discovered that this person was also after profit, and any pretense of nobility was false.<br/><br/>As if there was no real difference between them.<br/><br/>“What a pity. What can you do if you climb up them as a teacher? They will leave in a year and forget about you. Later, when they mention ‘Skyler Thomas,’ they won’t even know who it is,” Evan Silas said.<br/><br/>Laughing suddenly, Evan Silas continued, “And when their grades aren’t good, their parents will blame you. They’ll blame your incompetence. When their grades are good, it’s because of their children’s hard work. When they’re not, it’s because the teacher isn’t dedicated or qualified. They’ll only despise you. And since you don’t even have a title, they’ll despise you even more, calling you rubbish, unworthy of being a teacher.”<br/><br/>Skyler Thomas looked at her without saying a word.<br/><br/>Evan Silas went on: “What nobility are you pretending? No one will pay attention to you. Even if you climb up the Turner and Hobson Family, so what? ‘Outstanding Teacher’ is based on students’ grades, and no one can interfere. You still won’t be anything; you won’t be anything.”<br/><br/>Taking a deep breath, Skyler Thomas slowly exhaled, “Evan Silas, you’re too extreme. Grades aren’t the only measurement of everything.”<br/><br/>“But without grades, you’re nothing,” Evan Silas said, “This year’s College Entrance Exam’s top scholar will definitely be from our class. The ‘Outstanding Teacher’ award, bonus, and honor will all be mine. But you you can only see off a batch of poor students. This is the price you pay for your false nobility. You’ll end up with nothing!”\t\t\t\t\t\t</div>", "images": {}, "success": true}