{"id": 352, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391257.html", "title": "Chapter 352: 325: The End Of The Show", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 352: 325: The End Of The Show</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 352: 325: The End of the Show<br/><br/>Translator: 549690339<br/><br/>Class had already started, but Daisy Zane didn’t go back.<br/><br/>She stood downstairs and heard the suppressed crying of Amelie Quentin.<br/><br/>She had somewhat underestimated the reaction of the young girl. She even thought that Amelie Quentin’s listlessness for nearly a week might have something to do with Charlotte Lane, and she had just happened to be caught in the crossfire.<br/><br/>Kevin Clark was still texting her: [Little Girl, I’m a little curious, what did you do to make her cry?]<br/><br/>Daisy Zane didn’t tell him, but instead asked: [Did you tell William Lane?]<br/><br/>Kevin Clark: [No. William Lane doesn’t have time right now.]<br/><br/>William had just entered the laboratory, and it would be quite a while before he could come out. Besides, they thought it was just a little crying, so it wouldn’t be a big deal.<br/><br/>Daisy Zane: [ ]<br/><br/>Kevin Clark: [She’ll be alright after crying.]<br/><br/>Daisy Zane turned off her cell phone and ignored Kevin Clark.<br/><br/>She looked at the staircase handrail, listening to Amelie Quentin’s crying, which had been going on for nearly 5 minutes. Amelie showed no sign of stopping.<br/><br/>She can really cry.<br/><br/>Daisy stroked her fingertips, feeling somewhat agitated. After a while, she went downstairs to buy a bottle of water and some tissue paper. Holding these things, she slowly went back upstairs.<br/><br/>Amelie Quentin was sitting on the stairs, her face buried in her knees, crying with her shoulders shaking.Discover new chapters at novelhall.com<br/><br/>She heard footsteps, suddenly raised her head, looking down the steps.<br/><br/>Daisy Zane was standing there, holding a bottle of water, looking at her indifferently.<br/><br/>From the moment she spoke provocatively to her, until now, she stood without any expression change.<br/><br/>As if she was truly cold-blooded.<br/><br/>“Do I need to respond?” Daisy replied flatly.<br/><br/>“Yes.” Amelie answered softly.<br/><br/>“I heard you.” Daisy opened the bottle of water in her hand and handed it to her, “She will come back.”<br/><br/>“She will come back.” Amelie repeated, then took the water.<br/><br/>All the people around Daisy had no blood relation to her, so she didn’t know what kind of magical effect blood ties could produce.<br/><br/>But looking at Amelie like this, it seemed that blood relations were indeed magical.<br/><br/>What she had heard more about in the past was the infighting and power struggles inside large families, like Gael Easton’s family, for instance.<br/><br/>The internal conflicts were severe.<br/><br/>On the surface, everyone looked peaceful, but behind the scenes, they couldn’t wait to curse each other and have the other person dead.<br/><br/>However, there was no such situation in the Clark and Lane families.<br/><br/>The family atmosphere was good, and William Lane loved his sister dearly.<br/><br/>Perhaps Charlotte also loved Amelie at that time, which was the reason why she was so persistent.<br/><br/>“Since she will come back, you should take care of yourself.” Daisy said softly, “Wait for her return and continue to be her bright and outstanding sister.”<br/><br/>Ameilie hung her head, her eyelashes still hanging with teardrops, took a while before gently answering.<br/><br/>Daisy looked at her for a moment, reached out to ruffle her hair, and then stood up.<br/><br/>She walked down one step, and suddenly her hand that was hanging by her side was grabbed.<br/><br/>She looked down and saw Amelie with her head down, her left hand gripping her fingers, and she said dryly, “Thank you.”<br/><br/>Daisy raised her eyebrows.<br/><br/>“I’m sorry ” Amelie whispered, “My attitude was too bad just now.”\t\t\t\t\t\t</div>", "images": {}, "success": true}