{"id": 368, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391321.html", "title": "Chapter 368: 334: Everyone Watching The Show", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 368: 334: Everyone Watching The Show</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 368: 334: Everyone Watching the Show<br/><br/>Translator: 549690339<br/><br/>[I’ve got to tell you guys! Something unbelievable just happened!]<br/><br/>After learning that Charles Amos and Wilton Edwards had come to Clark Manor, Allonzo Hobson went over in the afternoon with loads of presents.<br/><br/>Once he reached Kevin Clark’s courtyard, he saw the barren lotus pond!<br/><br/>He stood there, flabbergasted for a good ten minutes before finally making a move.<br/><br/>As far as he knew Kevin Clark, every single lotus flower in the pond would be razed<br/><br/>Like hell these were all treasured by Kevin Clark!<br/><br/>Who the hell was so daring that not only did they take every single lotus flower, but they also plucked the lotus leaves until nothing was left?!<br/><br/>Alonzo Hobson couldn’t imagine how Kevin was going to react to this.<br/><br/>He stood by the pondside for more than ten minutes, and eventually, his ice-cold limbs warmed up. He grabbed someone nearby, asking, “Where are the lotus flowers?!”<br/><br/>The man saw the blood drain from Allonzo’s face and worriedly asked, “Young Master Hobson, are you okay?”<br/><br/>“I’m fine, where are the lotus flowers?”<br/><br/>“The lotus lotus flowers Third Master had them plucked.”<br/><br/>“Who picked them?” Allonzo thought there was something wrong with his ears.<br/><br/>“Third Third Master.”<br/><br/>Hugo Clark: [I didn’t hear any news either. I just found out when I saw all the lotus flowers that I’ve been growing for over twenty years got picked clean.]<br/><br/>Allonzo Hobson: [Holy shit! He covered the Doomsday Hotel’s two weeks’ revenue! All the lotus flowers in the pond! How much freaking money did Kevin spend?! Money is the least concern! Those flowers are precious! They’re worth millions per piece! He went all out for his fiancée!]<br/><br/>Hugo Clark: [Is the proposal happening today?]<br/><br/>Roy Madison: [Yes.]<br/><br/>Allonzo Hobson: [Hey! Kevin Clark didn’t even tell us about his proposal! It’s such an important moment for Third Master Clark! We should be there to witness it, right?]<br/><br/>Allonzo Hobson: [I wonder what Third Master’s reaction will be when he proposes. Holy shit! I’m excited!]<br/><br/>Hugo Clark: [I’m already on my way.]<br/><br/>Allonzo Hobson: [Damn! You’re too impulsive! Wait for me! I’m also going to the Doomsday Hotel. Roy! Roy! Where are you! Let’s go together!]<br/><br/>Roy Madison, at the Imperial Capital Research Institute, calmly sent a message: [I’m in Oxford City. You guys go ahead. I won’t make it back in time.]<br/><br/>When Kevin had borrowed the Doomsday Hotel from him, he had explicitly refused his involvement.<br/><br/>It was clear he didn’t want anyone to interrupt their intimate world of two.<br/><br/>Roy would never take the risk of being cold-shouldered.<br/><br/>As for others well, they were brothers. It wouldn’t hurt to have a little fun.<br/><br/>Allonzo Hobson: [Well, that’s too bad for you. You won’t get to witness Third Master’s big moment.]<br/><br/>After sending this message, Allonzo Hobson called Robinson Scott to inform him as well.\t\t\t\t\t\t</div>", "images": {}, "success": true}