{"id": 361, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391293.html", "title": "Chapter 361 - 329 Like Me _3", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 361 - 329 Like Me _3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 361: Chapter 329 Like Me _3 <br/><br/>Translator: 549690339 <br/><br/>Kevin Clark raised an eyebrow. Just now he was so anxious that he wished he could fly over, but now he’s stubborn about it. <br/><br/>Gael Easton: <br/><br/>Charles Amos sneered but continued to watch her. <br/><br/>After a few seconds, Daisy Zane took him from Wilton Edwards’ arms and held him. Only then did she realize that Charles was still trembling slightly. “What are you afraid of?” <br/><br/>Charles hugged her neck, his face buried in her shoulder, and it took him a while to say, “It’s him. He wants to take me away.” <br/><br/>Hearing him speak, Wilton let out a sigh of relief. From just now until now, Charles hadn’t said a single word. <br/><br/>Hearing Charles’s words, Daisy looked at Wilton. <br/><br/>Wilton nodded, “Fortunately, Mr. Easton discovered it in time, otherwise Young Master might have been taken away.” <br/><br/>Daisy looked at Gael Easton again. <br/><br/>Gael Easton turned his face away proudly, thinking: Just say thank you, and I will not end the friendship with you. <br/><br/>As a result Daisy ignored him and sat directly on the sofa. <br/><br/>Gael Easton waited for two seconds, then another two seconds, but still didn’t hear her speak. So he looked at her and said, “Stinky girl ” <br/><br/>Daisy didn’t even look at him, “Shut up.” <br/><br/>Gael Easton: <br/><br/>Kevin Clark raised the corner of his mouth, sat next to Daisy, and rubbed Charles’s head. <br/><br/>Gael Easton could feel Kevin’s smugness and showing off. <br/><br/>This man <br/><br/>“Do you know who it is?” Daisy asked. <br/><br/>“They know me,” Wilton said, “But as for who it is specifically, I don’t know.” <br/><br/>There were too many people who knew Wilton, and it was impossible for him to remember everyone’s voice. <br/><br/>Gael sat on the single sofa across from Kevin, tapping his leg, and casually said, “It’s a small matter. Just thwart them once more. I’m very familiar with this sort of thing.” <br/><br/>Kevin looked up at him. <br/><br/>Their gazes met in mid-air, and the smell of gunpowder instantly filled the entire living room. <br/><br/>Seeing that she didn’t agree, Gael laughed out loud. <br/><br/>Kevin shot him a glance. <br/><br/>“I don’t want to sleep by myself,” Charles suddenly said. <br/><br/>Daisy looked down at him, eyeing his pitiful expression, and said, “Then you sleep in the living room. There are so many fish to accompany you.” <br/><br/>Charles pouted angrily. <br/><br/>Wilton wisely remained silent. <br/><br/>“Sleep with me,” Kevin said. <br/><br/>Charles looked at him without speaking. <br/><br/>Kevin knew exactly what was on his little mind. He stood up and directly took Charles from Daisy’s arms, “Let’s go, I’ll take you to bed.” <br/><br/>Charles was held by him and looked at Daisy. He struggled a bit. <br/><br/>But he soon calmed down. <br/><br/>Because Daisy’s expression clearly told him. <br/><br/>Either sleep with Kevin or sleep alone. <br/><br/>So he compromised and chose Kevin. <br/><br/>As they walked upstairs, they passed by Gael Easton’s room first. <br/><br/>Gael opened the door and said to Daisy, “Stinky girl, my bed is very big. Want to sleep together?” <br/><br/>Kevin stopped in his tracks and looked at him. <br/><br/>Gael looked back at him provocatively. <br/><br/>Just as Kevin was about to put Charles down and take action, Daisy took the initiative and kicked Gael back into his room and closed the door. <br/><br/>She had maintained world peace. <br/><br/>Caught off guard by the sudden kick, Gael staggered forward, his long wolf-tail hair still trailing behind him. <br/><br/>When Daisy closed the door, it almost caught his hair. <br/><br/>“You stinky girl!” Gael shouted from the room, even making a move to open the door again. <br/><br/>Daisy said, “If you come out, one of us has to see blood today.” <br/><br/>Gael fell silent, and he behaved himself.\t\t\t\t\t\t</div>", "images": {}, "success": true}