{"id": 360, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391289.html", "title": "Chapter 360 - 329 Like Me _2", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 360 - 329 Like Me _2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 360: Chapter 329 Like Me _2 <br/><br/>Translator: 549690339 <br/><br/>Daisy Zane glanced at her cell phone. The note there was a chaos. It was the note she had replaced for Holt Lawrence. <br/><br/>She answered the phone and said, “Speak.” <br/><br/>Kevin Clark raised an eyebrow. <br/><br/>Holt Lawrence’s voice was somewhat hollow. Right as he began speaking he said, “Nana, I have something to tell you. Don’t get angry.” <br/><br/>“Hmm. Go on.” <br/><br/>“Well, that that ” Holt Lawrence stammered for a moment, then gathered his courage and quickly said, “William Butch attempted suicide. He’s in the hospital now, but he’s been resuscitated. People are watching him around the clock.” <br/><br/>Daisy Zane’s expression suddenly turned cold: “What happened?” <br/><br/>“We’ve been secretly following him. Anyone who attempted to approach him was turned away,” said Holt Lawrence. “But I checked just now. Today oh, it’s past midnight now. Yesterday morning, after William Butch left home, the Butch family went to visit his grandmother’s house.” <br/><br/>Daisy Zane looked down. Th.ê most uptodate novels are published on n(0)velbj)n(.)co/m<br/><br/>“Our people kept following William Butch, paying no attention to his grandmother’s house,” said Holt Lawrence. “Yesterday evening, after William Butch returned home, he went out again within two hours. Then took a taxi straight to the beach.” <br/><br/>“He jumped into the sea?” <br/><br/>Kevin Clark looked at Daisy Zane, but he couldn’t hear what was being said on the phone. <br/><br/>“No, he just fell over while he was standing by the sea,” said Holt Lawrence. “Our people immediately took him to the hospital. A large amount of sedative was detected in his blood. It’s a good thing we got him to the hospital in time, otherwise we wouldn’t have been able to save him.” <br/><br/>After he finished speaking, Daisy Zane stayed silent for a while before saying, “Keep an eye on him for now.” <br/><br/>Throughout their journey, Daisy Zane kept recalling familiar images — from the bombing of Edward Kirsten’s base, to their escape from Continent A, down to their life in Continent A. <br/><br/>When she had left Continent A, Charles Amos was only three years old. <br/><br/>Barely old enough to remember anything. <br/><br/>Although Charles Amos hardly remembered life in Continent A, he was terrified of Edward Kirsten. <br/><br/>At that time, whenever Edward Kirsten approached him, he would cry — his face turning purple, his whole body trembling. <br/><br/>Daisy Zane didn’t know what Edward Kirsten had done to him, but ever since that time, she kept Edward Kirsten from getting close to him. <br/><br/>As the car drove into the villa, before it could completely come to a stop, Daisy Zane got out. <br/><br/>Being obvious signs of a fight around the villa, Daisy Zane didn’t bother looking closely and went straight into the living room. <br/><br/>In the living room, Uncle Wilton was holding Charles Amos, constantly patting his back. <br/><br/>Gael Easton was pacing in large strides around the room. <br/><br/>As soon as Daisy Zane entered the living room, both Uncle Wilton and Gael Easton looked her way. <br/><br/>But Charles Amos, burying his head in Uncle Wilton’s shoulder, didn’t move. <br/><br/>He only lifted his head when Uncle Wilton stood up and called out “Miss”. Charles Amos then glanced over. <br/><br/>Daisy Zane walked over, holding Charles Amos’s gaze. <br/><br/>Charles Amos’s face was extremely pale, with red-rimmed eyes, but he wasn’t crying. <br/><br/>His little hands gripped tightly onto Uncle Wilton’s clothes. <br/><br/>After a few seconds of eye contact, Daisy Zane spoke, her tone light: “Not crying that’s progress.”\t\t\t\t\t\t</div>", "images": {}, "success": true}