{"id": 367, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391317.html", "title": "Chapter 367: 333: Proposal", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 367: 333: Proposal</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 367: 333: Proposal<br/><br/>Translator: 549690339<br/><br/>After leaving the private room, Kevin Clark instructed Juan Wright to tamper with the surveillance footage.<br/><br/>Upon exiting, Daisy Zane gazed at the spot where the figure had disappeared.<br/><br/>Kevin exchanged a few words with Kai Lincoln and, turning his head, noticed Daisy staring off into the distance. He asked, “What’s the matter?”<br/><br/>Daisy Zane withdrew her gaze: “Nothing.”<br/><br/>“Heading back?”<br/><br/>“Yeah.”<br/><br/>Kevin Clark took Daisy Zane back to the Rose Garden and stayed with her for a while before leaving.<br/><br/>After he left, Daisy stayed in the backyard for a while.<br/><br/>The backyard was full of roses, covering a large area, almost like a rose field.<br/><br/>However, it was almost October now, so the rose season had passed and only green leaves remained.<br/><br/>Only some roses in the greenhouse were still blooming.<br/><br/>Daisy looked at the roses for a while before heading upstairs.<br/><br/>She used her computer to hack into the surveillance system at Fog Mountain Restaurant.<br/><br/>She checked the surveillance footage on the ninth floor, but the footage of her, Liam’s mother, and Amelia Miles in the hallway was gone.<br/><br/>Daisy didn’t care too much; her main focus was on the silhouette captured on the ninth-floor camera.<br/><br/>Following the figure, she not only hacked Fog Mountain Restaurant’s surveillance, but also the surveillance footage at every intersection the figure passed.<br/><br/>The figure kept walking without taking a car.<br/><br/>However, the figure suddenly disappeared in front of a supermarket.<br/><br/>It was unclear whether they deliberately avoided the surveillance or wandered into a blind spot.<br/><br/>Later, Daisy went through all the available surveillance footage near the supermarket but found nothing.<br/><br/>After checking, Daisy sat in front of the French window and looked outside.<br/><br/>The sun happened to shine on her, casting its light on her eyelashes, while the shadow of her lashes fell on her distant eyes.<br/><br/>After a while, her eyelashes fluttered gently and Daisy closed her eyes.<br/><br/>The figure looked so much like Jack Amos.<br/><br/>Except for being much thinner than Jack, everything else was strikingly similar.<br/><br/>But with thirty-two wounds on Jack’s body, the chances of him surviving the final deadly wound were almost zero.<br/><br/>Edward Kirsten wouldn’t have left a survivor.<br/><br/>Daisy closed her eyes and pressed her brow for a moment.<br/><br/>She wondered why she was so fixated on finding this person and how it could possibly be Jack.<br/><br/>In the afternoon, Daisy went to a private hospital to meet a psychologist.<br/><br/>She had a general understanding of the psychological problems related to students being bullied.<br/><br/>The conversation lasted until past 6 o’clock in the afternoon.<br/><br/>As she was leaving, Daisy asked the psychologist, “Can hypnosis make someone forget their past?”<br/><br/>Caught off guard by the question, the psychologist hesitated but quickly responded, “If the hypnotist is highly skilled, it’s possible.”<br/><br/>“Is there a way to recover the memories?”<br/><br/>“Hypnosis can be tried to retrieve memories,” the doctor thought for a moment and continued. “Some people who have experienced major psychological trauma may also recall familiar scenes or events.”<br/><br/>Daisy nodded: “Thank you.”<br/><br/>“You’re welcome.”<br/><br/>After leaving the hospital, Daisy called for a car.<br/><br/>As she waited, she reflected on her life on Continent A.<br/><br/>She had no memories of ever being hypnotized, not even a whisper. Since waking up on the 5th of June that year, her memories were a complete blank.<br/><br/>The first person she saw when she woke up was Edward Kirsten.<br/><br/>Edward Kirsten only told her that her name was Enigma Starry, but didn’t reveal anything else.<br/><br/>Kevin Clark smiled at her, his hands clasped behind him and his fingertips tense. “Shall we go inside and take a look?”<br/><br/>Daisy Zane looked at him and nodded. She walked slowly inside.<br/><br/>Following the reserved path, she walked inside.<br/><br/>From the hotel’s grand hall all the way to the banquet hall, there were lotus flowers leading the way.<br/><br/>A huge banquet hall was surrounded by lotus flowers.<br/><br/>Different varieties, different colors, progressing in layers, very exquisite.<br/><br/>Not a day’s work.<br/><br/>One couldn’t help but feel shocked and amazed.<br/><br/>Daisy Zane walked slowly to the center of the banquet hall and stopped. Despite her excellent vision, the lotus flowers in the distance seemed a little blurred.<br/><br/>She stood for a while, then reached down to touch a lotus.<br/><br/>Only then did she realize they were all real.<br/><br/>She thought they were just incredibly lifelike.<br/><br/>She looked at Kevin Clark: “This ”<br/><br/>Kevin Clark tucked her hair behind her ear: “From Clark Manor.”<br/><br/>Daisy Zane stared at him, hesitated and then asked, “Didn’t you pick all 25 acres of lotus flowers?”<br/><br/>Such a large area, and the flowers were so tightly packed.<br/><br/>Kevin Clark realized that his hand touching her face was trembling at the fingertips.<br/><br/>He withdrew his hand, letting it hang at his side, and said, “After thinking about it, the only decoration that I’ve raised for years that matches the little girl is the lotus.”<br/><br/>Daisy Zane did not speak.<br/><br/>Though rumors may be unreliable.<br/><br/>But she knew that these lotus flowers were really expensive.<br/><br/>Several tens of thousands for one plant was the cheapest.<br/><br/>Hardy Clark had once told her that some of the lotus flowers in their ponds had been auctioned for seven figures.<br/><br/>She had also learned from Juan Wright and Michael Jackson.<br/><br/>Kevin Clark’s love for lotus flowers had already reached the point where he would not let anyone pick or touch even the wild lotus flowers outside.<br/><br/>“Does it hurt?” Daisy Zane didn’t know what to say, and all her words combined led to these three words.<br/><br/>“They are nothing compared to the little girl,” Kevin Clark said, holding her face and planting a kiss on the corner of her mouth.<br/><br/>Daisy Zane felt the cold sweat in the palm of his hand<br/><br/>After this kiss, Kevin Clark took a step back, took a small box from his pocket, and knelt on one knee.<br/><br/>Daisy Zane subconsciously wanted to help him, but Kevin Clark clasped her hand.<br/><br/>Kevin Clark, on one knee in front of her, looked up at her and smiled. “Little girl let me change my status.”<br/><br/>No questions asked; it was a certainty.<br/><br/>Daisy Zane looked into the eyes of the man before her.<br/><br/>For a moment, everything around her vanished, and all she saw was this man.<br/><br/>This man could make everything else fade away.<br/><br/>“Won’t you ask if I agree?” Daisy Zane said.<br/><br/>Kevin Clark took a gentle breath and then laughed, “Can I not ask?”<br/><br/>Daisy Zane felt that this man was trying to seduce her with his beauty, but she still said, “And can you still not ask?”<br/><br/>Kevin Clark smiled, hiding his nervousness within the laugh. But even when nervous, Third Master would satisfy all his girl’s needs.<br/><br/>He rubbed her fingers, his throat gently rolled, and he said tenderly and devoutly, “Little girl marry me, will you?”<br/><br/>Daisy Zane stared at her trembling hand held by him, and after a pause, she said firmly, “Yes.”<br/><br/>Kevin Clark held her hand tight, relieved in his heart. In an instant, his eyes were filled with a myriad of stars, but those countless stars revolved only around the person in his eyes.<br/><br/>He solemnly said, “Little girl, I will always love you, protect you, and be loyal to you.”<br/><br/>Having said this, Kevin Clark devoutly placed the ring on Daisy Zane’s left ring finger.\t\t\t\t\t\t</div>", "images": {}, "success": true}