{"id": 369, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391325.html", "title": "Chapter 369: 334: Everyone Watches The Fun – Part 2", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 369: 334: Everyone Watches The Fun – Part 2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 369: 334: Everyone Watches the Fun – Part 2<br/><br/>Translator: 549690339<br/><br/>Robinson Scott answered the phone quickly, and it was still very noisy around him. “What’s up?” he shouted.<br/><br/>Allonzo Hobson moved the phone a little further away before putting it back to his ear and asked, “Are you in Imperial Capital?”<br/><br/>“Say what you want.”<br/><br/>Allonzo Hobson: “...Arthur North is proposing to your Brother Nine.”<br/><br/>“What?!” Robinson Scott didn’t hear clearly because of the noise around him.<br/><br/>Allonzo Hobson patiently repeated it and then moved the phone away again.<br/><br/>As expected, the next second, Robinson Scott shouted even louder, “Ah! Where!”<br/><br/>Allonzo Hobson laughed and said, “Doomsday Hotel, you should be able to make it if you go now.”<br/><br/>Robinson Scott hung up directly.<br/><br/>Allonzo Hobson raised his eyebrows as he looked at his disconnected call.<br/><br/>Humph, they won’t see me.<br/><br/>That’s the end of you.<br/><br/>When Hugo Clark received the message, Hardy Clark was next to him. He was urged to go out by Hardy Clark, who replied to the last two messages.<br/><br/>Before going out, he sent Olivia Lane a message, asking her if she wanted to go and watch the fun.<br/><br/>Olivia Lane agreed immediately.<br/><br/>So Hugo Clark went to pick up Olivia Lane with Hardy Clark.<br/><br/>Meanwhile, Robinson Scott also yelled in their group chat.<br/><br/>The group chat exploded right away.<br/><br/>However, apart from James Collins and Robinson Scott being in Imperial Capital and having time, others couldn’t make it. They could only jump around in the group chat.<br/><br/>“Yeah, sis.” James Collins said with a wronged face.<br/><br/>Olivia Lane looked at the man with blue hair and blinked. Is this her younger brother? She has another younger brother too?<br/><br/>“Such a thing shouldn’t it be kept a secret from me?” Daisy Zane said softly.<br/><br/>Everyone fell silent.<br/><br/>Yeah, who knew about it beforehand, Daisy Zane wouldn’t have been able to know either.<br/><br/>So Robinson Scott and James Collins both looked at Arthur North.<br/><br/>Then they found they couldn’t mess with Arthur North either, so they all wilted.<br/><br/>After another moment of silence, they walked inside.<br/><br/>James Collins and Robinson Scott walked casually, but the other four were cautious. Because they all knew how expensive these lotus flowers were.<br/><br/>“Arthur, you will be my brother-in-law in the future,” Allonzo Hobson said.<br/><br/>Arthur North:<br/><br/>“Sis Lucia, why did you agree so readily?” Allonzo Hobson laughed. “Why not make it hard for him? Only then will men understand the value.”<br/><br/>Arthur North glanced at Robinson Scott and said, “Yes, make it hard. Only then will they understand the value.”<br/><br/>Allonzo Hobson’s scalp tingled, and he cursed quietly in his heart. Why did he dig a hole for himself? This guy has proposed now, but he’s still single.<br/><br/>He looked back at Robinson Scott.<br/><br/>Robinson Scott silently spat at him: “Don’t look at me!”<br/><br/>Allonzo Hobson:<br/><br/>Daisy Zane raised the corner of her mouth and looked at Olivia Lane, “You also came to join the excitement.”<br/><br/>Olivia Lane pursed her lips: “I just came over out of boredom to take a look.”<br/><br/>“I’ve been wanting to ask, who is this little sister? She’s so pretty,” Robinson Scott hooked her arm around Olivia Lane’s neck and said playfully, “She’s so cute. Let your sister introduce you to a marriage partner.”\t\t\t\t\t\t</div>", "images": {}, "success": true}