{"id": 362, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391297.html", "title": "Chapter 362 - 330: My Own Home", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 362 - 330: My Own Home</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 362: Chapter 330: My Own Home<br/><br/>Translator: 549690339<br/><br/>Returning to the room, Kevin changed Charles’ clothes and let him lie down on the bed.<br/><br/>And he sat down on a chair nearby.<br/><br/>Charles, with his wide-open eyes, showed no signs of sleepiness. He looked at Kevin and asked, “Aren’t you going to sleep?”<br/><br/>“You sleep first.”<br/><br/>“Are you planning to sneak away after I fall asleep?” Charles looked at him and said.<br/><br/>“I wasn’t planning on it, but now that you’ve mentioned it “, Kevin replied, “I’m starting to consider it.”<br/><br/>Charles pursed his lips and stared at him.<br/><br/>Kevin patted him on the head and said, “Go to sleep, I won’t leave.”<br/><br/>“Really?”<br/><br/>“Mm-hmm.”<br/><br/>“But I’m not sleepy.”<br/><br/>As Kevin squinted his eyes, Charles immediately closed his own.<br/><br/>Although he claimed not to be sleepy, Charles fell asleep in less than five minutes.<br/><br/>But only ten seconds after closing his eyes, he grabbed the corner of Kevin’s clothes – not letting go until he fell asleep.<br/><br/>Kevin looked down at the little hand and gently pinched it after a moment.<br/><br/>The little girl said he didn’t resemble anyone.<br/><br/>But maybe it’s because he had spent so much time with the little girl, he actually shared many similarities with her.<br/><br/>The tone, demeanor, and occasional glances were all very alike.<br/><br/>After waiting for a while, Kevin saw that Charles showed no signs of waking up. He gently removed Charles’ hand from his clothes, and put it under the blanket.<br/><br/>He wanted to check on Daisy Zane.<br/><br/>Edward Kirsten’s people had arrived in the Imperial Capital. He worried that the little girl might be upset.<br/><br/>As he was about to get up from the chair, the bedroom door was pushed open.<br/><br/>Kevin looked up and saw Daisy Zane close the door and come in.<br/><br/>He raised his eyebrows and watched her approach.<br/><br/>Daisy, as usual, maintained a cold demeanor, but her lips had deepened in color. She glanced at the sleeping Charles, “Fell asleep so quickly.”<br/><br/>“Mm.” Kevin touched her face which was slightly warm, “Why did you come over?”<br/><br/>Daisy looked at him and hesitated, “I didn’t want to sleep alone.”<br/><br/>Her voice and her expression were no different than usual—indifferent, distant, cold, and repelling.<br/><br/>Even sounding a bit arrogant.<br/><br/>But Kevin could feel her heart drawing close.<br/><br/>He smiled and leaned down to kiss her lips, “So ”<br/><br/>Kevin looked at Charles.<br/><br/>Daisy also looked at Charles and said softly, “Wilton Edwards has not slept.”<br/><br/>Kevin raised his eyebrows.<br/><br/>Then, Daisy called Wilton Edwards to come upstairs and the two of them went to Daisy’s room.<br/><br/>So when Charles woke up in the morning and discovered all this, he was angry and refused to talk to them all morning.<br/><br/>But the two of them didn’t care whether he was angry or not and simply ignored him.<br/><br/>Kevin Clark laughed: “Make the best use of everything.”<br/><br/>“Hmm.”<br/><br/>Kevin Clark drove Charles Amos and Uncle Wilton to Clark Manor.<br/><br/>While they were packing their things, he arranged everything at home.<br/><br/>When they arrived at the entrance of Clark Manor, Kevin Clark looked at Daisy Zane and said, “My dad went to the Theatre Garden with my mom early this morning. Want to go in and take a look?”<br/><br/>Daisy Zane took a look at the main entrance of Clark Manor: “Not now. I’ll visit next time.”<br/><br/>Kevin Clark raised his eyebrows at her words.<br/><br/>“I came here today mainly because I was afraid that Uncle Wilton would jump out of the car halfway,” Daisy Zane said lazily.<br/><br/>Uncle Wilton cleared his throat and said awkwardly, “Miss, you’re overthinking it.”<br/><br/>Kevin Clark smiled and said to Uncle Wilton, “Uncle Wilton, when I informed my family, my parents had already gone out. Sorry for the inconvenience.”<br/><br/>“You’re too polite, Young Master,” Uncle Wilton said, “It’s me who’s disturbing.”<br/><br/>“Not at all,” Kevin Clark said, “It’s only a matter of time before we bring you and Charles Amos here. Don’t treat yourself as a guest.”<br/><br/>Uncle Wilton glanced at Daisy Zane.<br/><br/>Sensing his gaze, Daisy Zane said without looking up, “Hmm, it’s your home.”<br/><br/>Kevin Clark smiled, spoke a few words with the people who came to carry the luggage, and then said to Uncle Wilton, “There are many plants and flowers in my courtyard. I’ll have to trouble you.”<br/><br/>“Of course, of course.”<br/><br/>After Uncle Wilton and Charles Amos entered Clark Manor, Kevin Clark drove Daisy Zane to the police station.<br/><br/>“We’ve already increased our efforts to investigate the Imperial Capital,” Kevin Clark said, “I’ll have someone follow you recently.”<br/><br/>Daisy Zane looked up at him: “Are you afraid I’ll be taken away?”<br/><br/>Kevin Clark indeed had this concern.<br/><br/>“Third Master it’s on your territory.”<br/><br/>Kevin Clark:<br/><br/>“Actually, they can’t take Charles Amos or Uncle Wilton away, can they?”<br/><br/>“Yes,” Kevin Clark said, “Even if they took Charles Amos out of the villa last night, they couldn’t leave the Imperial Capital.”<br/><br/>This was the confidence of the Clark Family.<br/><br/>However, as a bargaining chip to threaten Daisy Zane, the safety of Charles Amos and Uncle Wilton might not be guaranteed.<br/><br/>Edward Kirsten was a madman who could do anything.<br/><br/>If he wanted to force her, he could hurt Charles Amos and Uncle Wilton without leaving the Imperial Capital.<br/><br/>Kevin Clark obviously realized this, so both of them decided to have them move to a new place without hesitation.<br/><br/>“Isn’t it better to cooperate both inside and outside?” After being quiet for a while, Daisy Zane suddenly asked.<br/><br/>Hearing her words, Kevin Clark suddenly stepped on the brakes and stopped the car by the roadside. He looked at her seriously and said, “Little girl, you shouldn’t have such thoughts.”<br/><br/>Daisy Zane looked at him obliquely. The oppressive feeling of an ungentle Kevin Clark was indeed too strong.<br/><br/>It felt like the pressure penetrated her body, squeezing her heart directly.<br/><br/>“If you dare to have such thoughts, I’ll lock you up in Clark Manor,” Kevin Clark said softly.<br/><br/>Daisy Zane looked at him for a while. Although Kevin Clark’s aura made her uncomfortable, she still joked without changing her expression, “Third Master, playing confinement, isn’t it a bit wild?”<br/><br/>“Don’t play around with me,” Kevin Clark said seriously.<br/><br/>Daisy Zane:<br/><br/>“Little girl, I’m not joking.”<br/><br/>“Hmm. I understand,” Daisy Zane replied.\t\t\t\t\t\t</div>", "images": {}, "success": true}