{"id": 378, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14424379.html", "title": "Chapter 378 - 341 Daisy Zane", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 378 - 341 Daisy Zane</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 378: Chapter 341 Daisy Zane<br/><br/>Translator: 549690339<br/><br/>“Hey, you, the one without a name. Why are you gloomy all the time? Smile a bit, like this. Here, smile.”<br/><br/>“To improve your life, I had to kill the old hen at home. Aren’t you happy even after getting something good to eat?”<br/><br/>“You really are hard to please. You are lucky to have met me. If it were someone else, they would have discarded you into the mountains by now due to your stubbornness.”<br/><br/>“The white orchids in the mountains have bloomed. They are remarkably beautiful. I picked two for you, do you like them?”<br/><br/>“Aren’t you happy even after seeing such beautiful things?”<br/><br/>“Be like me and laugh out loud. See, doesn’t that feel better?”<br/><br/>“Shopie, I don’t know what you’ve been through. But, I can sense your sorrow. I don’t know how to help you. It’s become challenging for me to argue with you seeing you like this all day.”<br/><br/>“Shopie, life must go on.”<br/><br/>“There will always be someone you cherish. For them, you must take good care of yourself. If not, then at least do it for your own sake. This is your life; no one else has the right to make you give up on yourself.”<br/><br/>“Shopie, one cannot spend their entire life harboring hatred. Aside from hate, there are many wonderful things in life. What do you think about me, for example? Ha ha ha ”<br/><br/>“Shopie, will you return?”<br/><br/>“Then please bring me some good food from outside when you return. I’d love to taste the delicious food there that makes you despise my cooking.”<br/><br/>“You naughty girl! You haven’t shown up for over a year. I thought you’d forgotten about me and grandma! What on earth have you been doing this past year? It seems like I’ve saved an ungrateful wretch!”<br/><br/>“Shopie, what have you done in the past year? You’ve gotten so thin and your hair has become so short. When I saw you on the mountain, I mistook you for a man. I was scared and ready to go home for my kitchen knife for self-defense.”<br/><br/>“Shopie, please grow out your hair. I prefer you with long hair, it suits you.”Điscover new chapters at novelhall.com<br/><br/>“Shopie, I’ve made up my mind. I want to become a celebrity, the Best Actress, and win numerous awards. I will convince grandma and leave this place, so wait for me.”<br/><br/>“My great screenwriter, you are amazing. Once grandma agrees to leave with us, you must write a script for me to act in.”<br/><br/>“When that time comes, you better not give me any preferential treatment. I want to start from scratch. I want to experience everything from auditioning as a newcomer to acting as a small actor. I want to progress step by step on my own, as that’s where I’ll find the sense of accomplishment. Don’t you agree?”<br/><br/>“Kevin Clark.”<br/><br/>“I’m here.” Kevin replied softly.<br/><br/>It seemed as if she was checking if Kevin was still there. After calling his name, Daisy didn’t utter anything for a while, waiting for some time before speaking, “One day later, I went to a place with a signal and called Diego Giovanni. He brought a forensic doctor for the autopsy.”<br/><br/>Kevin gently massaged her ear as he listened.<br/><br/>“It was only a month later that I left this place, after seeing the autopsy report.” Daisy said quietly. “There were three fatal stab wounds on grandma’s chest. Lucia had multiple bruises and contusions on her body, the result of a beating. The cut on her neck seemed self-inflicted. Signs of violations could be seen on her body that occurred both before and after her death.”<br/><br/>She paused, drawing a breath, then said, “Both had been injected with a drug, 319.”<br/><br/>Kevin’s gaze shifted a little.<br/><br/>This must be why she was investigating 319, although it was unexpected that the investigation ultimately led to Edward Kirsten.<br/><br/>So the little girl believed that Lucia’s death was her fault.<br/><br/>First Jack Amos, then Daisy<br/><br/>Kevin drew a deep breath, feeling as though each breath was drawing in sharp thorns that hurt him everywhere.<br/><br/>How could he let his little girl suffer so much?<br/><br/>After remaining silent for a while, Daisy turned to bury her head in Kevin’s shoulder. She whispered, “Kevin Clark, I am a little cold. Can you hold me tighter?”<br/><br/>Kevin immediately tighten his arms around her, leaned in to kiss her ear softly, and assured her, “Ok, I am here.”<br/><br/>“Kevin Clark, why would such an optimistic and positive person like her lose hope? She always encouraged me, yet she lost hope herself. Why did she have to end her life for others’ mistakes?” Daisy’s words came out slow, like a quiet murmur. It felt as if she was asking not only Kevin, but also Lucia who had left them.<br/><br/>“Many people are good at preaching to others than practicing themselves,” Kevin softly comforted her, “319 can also cause hallucinations.”<br/><br/>It could not rule out the influence of the drug.<br/><br/>“I kinda miss her,” Daisy murmured softly.<br/><br/>From her calm tone, Kevin could sense her vulnerability, the vulnerability hidden behind the hardened exterior.<br/><br/>“As long as she is in your heart, she will always be with you,” Kevin gently consoled her while holding her in his arms, “She is just accompanying you in a different form.”\t\t\t\t\t\t</div>", "images": {}, "success": true}