{"id": 372, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391337.html", "title": "Chapter 372: 336: The Person Belongs To Him", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 372: 336: The Person Belongs To Him</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 372: 336: The Person Belongs to Him<br/><br/>Translator: 549690339<br/><br/>The lights in the room were off, and the thick curtains were drawn.<br/><br/>But through the gap in the curtains that were not fully closed, one could tell that daylight had arrived.<br/><br/>Daisy Zane lay on her side in bed, her hand dangling limply over the edge. Half opening her eyes, she looked at the light filtering through the gap<br/><br/>Her face was flushed with a rare blush, her eyelashes still wet with tears. Her slightly swollen lips were pursed together, revealing extreme irritability hidden beneath her exhaustion.<br/><br/>Was that the physical strength of a human?<br/><br/>She doubted if Kevin Clark was really a supernatural creature.<br/><br/>In a moment, her hand hanging over the edge of the bed was clasped, and Kevin Clark hugged her from behind, kissing her at the back of the neck. His tone and voice all exuded his satisfaction, happiness, and joy: “I’ll carry you to take a bath.”<br/><br/>Daisy Zane closed her eyes and ignored him.<br/><br/>Kevin Clark tightened his arm, hugging her tighter, and chuckled quietly, “Why won’t you talk to me anymore?”<br/><br/>“Kevin Clark, you ” Daisy Zane said with her eyes closed.<br/><br/>“What about me?”<br/><br/>Daisy Zane didn’t want to move, allowing him to pinch her hand. “Didn’t you say let me sleep early?”<br/><br/>“It was Madam who invited me to experience it together.” Kevin Clark said with a smile.<br/><br/>“Get lost.” Daisy Zane cursed him weakly. “If I had known you were like this ”<br/><br/>Kevin Clark kept smiling, not having any particular reaction to her cursing. He had just driven her to desperation, and she had cursed him several times in a hoarse voice. “What am I like?”<br/><br/>“Shut up.”<br/><br/>Kevin Clark stopped talking, hugged her for a while, kissed her neck, then sat up. “Go take a bath so you won’t be uncomfortable.”Yôur favorite stories at novelhall.com<br/><br/>Daisy Zane didn’t move.<br/><br/>Daisy Zane didn’t want to move.<br/><br/>Kevin Clark lifted the quilt, intending to carry her.<br/><br/>Daisy Zane immediately rolled from one side of the bed to the other, wrapped in the quilt, and got out of bed.<br/><br/>Her moves were smooth and swift, neat and dashing.<br/><br/>However, after stepping on the ground, Daisy Zane’s legs felt weak.<br/><br/>She quickly held the bedside table beside her, and Kevin Clark timely supported her from the other side.<br/><br/>“I’ll carry you.”<br/><br/>Daisy Zane dodged his hand, even pushing him aside, and then walked to the restroom wrapped in the quilt.<br/><br/>Knowing he had pushed her too far and being in the wrong, Kevin Clark didn’t dare to make a sound, slowly following her from behind.<br/><br/>When they arrived at the restroom door, he watched her enter and closed the door with a slap. After the sound of a gust of wind, the sound of the lock clicked from inside.<br/><br/>Kevin Clark: Was she protecting herself from wolves?<br/><br/>In the restroom, Daisy Zane threw the quilt on the ground and took off her sleeping robe hanging on her left arm.<br/><br/>Daisy didn’t say anything, letting him carry her to the bed.<br/><br/>She laid down on the bed, covered herself with the quilt and closed her eyes.<br/><br/>“Eat before sleeping.”<br/><br/>“No. Sleepy.”<br/><br/>“Aren’t you hungry?” Kevin Clark asked, stroking her face.<br/><br/>“Sleepy.”<br/><br/>Kevin Clark smiled, leaned down and kissed her on the cheek, “Alright, sleep first.”<br/><br/>“Mhmm.”<br/><br/>After responding, she fell asleep almost instantly.<br/><br/>But a few minutes later, she suddenly opened her eyes.<br/><br/>Her eyes were bloodshot and murderous as she stared at Kevin Clark.<br/><br/>His hand had just touched a box on the bedside table, and he froze when she suddenly looked over, “What’s wrong?”<br/><br/>She stared at him, murder radiating from her gaze, “What are you doing?”<br/><br/>Kevin Clark realized, he picked up the empty box on the bedside table and shook it, “It’s empty, gonna throw it away.”<br/><br/>Daisy assessed him, deciding whether she could trust his words.<br/><br/>If he continued to mess with her, she would fight him right now.<br/><br/>Seeing her like this, Kevin Clark smiled and tossed the empty box into the trash can. He leaned closer to her and whispered, “Go to sleep, I won’t bother you anymore.”<br/><br/>After saying that, he added, “There aren’t any suitable sizes left, they’re all too small.”<br/><br/>Daisy Zane:<br/><br/>Daisy Zane looked at him wordlessly for two seconds, then took a pillow from her side and threw it at him. She turned her back to him and kept sleeping.<br/><br/>Kevin, holding the pillow she tossed, silently chuckled.<br/><br/>He felt if she wasn’t so sleepy, she might actually fight him now.<br/><br/>Daisy slept until around 3 in the afternoon.<br/><br/>In the morning, Kevin joined her in bed for a while. Afterwards, he continued to deal with his work.<br/><br/>He laid in bed while working on his laptop.<br/><br/>He set the brightness to the lowest and didn’t use the keyboard. Whenever he needed to type, he used the laptop’s touchpad and software keyboard.<br/><br/>It was because he’d put Daisy’s arm on his torso, letting her sleep hugging his waist.<br/><br/>Daisy was well-behaved in her sleep and rarely moved.<br/><br/>While Kevin worked, he could look down and see her sleeping face. Her usual aloof demeanor faded a bit, and in his eyes, she looked rather tame.<br/><br/>From time to time, he would softly touch her here and there.<br/><br/>He felt a sense of satisfaction as though she was his, and he could touch her as he pleased.\t\t\t\t\t\t</div>", "images": {}, "success": true}