{"id": 379, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14424381.html", "title": "Chapter 379 - 342: Grandma", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 379 - 342: Grandma</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 379: Chapter 342: Grandma <br/><br/>Translator: 549690339 <br/><br/>The rain continued, and Daisy Zane gradually fell asleep in Kevin Clark’s embrace. <br/><br/>Listening to her steady breathing, Kevin stroked her head with one hand and gently patted her back with the other. <br/><br/>He watched the rain dripping from the eaves, piecing together the little girl’s past life based on what he now knew. <br/><br/>If only he had met her earlier, much earlier. <br/><br/>Before Jack Amos died, or before Daisy Zane died, or if she had met him instead of Edward Kirsten. Maybe then he could have protected her. <br/><br/>To let her live a lifetime of happiness, worry-free, and willful. <br/><br/>Without hate, without guilt <br/><br/>After sitting on the folding bed for a while, Kevin carried her back to the bed. <br/><br/>As he lay her down, Daisy Zane opened her eyes and looked at him. <br/><br/>“Sleep,” Kevin whispered softly. <br/><br/>Daisy looked confused in her eyes. After staring at him for a moment, she murmured vaguely, “Brother Arthur ” <br/><br/>“Hmm?” The voice was too soft and unclear, so Kevin didn’t hear her well, “What?” <br/><br/>Daisy looked at him for a while, then closed her eyes and fell back asleep. <br/><br/>Kevin raised the corner of his lips, giving her a gentle kiss on her forehead before lying down beside her. <br/><br/>By morning, the rain had stopped, and the sun had come out. But Daisy Zane had not woken, so Kevin didn’t move either, sleeping beside her until after ten o’clock. <br/><br/>When she finally woke up, Daisy didn’t get up. <br/><br/>It wasn’t until Kevin went to cook that she got up to wash and rinse herself before helping him in the kitchen. <br/><br/>However, after breaking a plate, Kevin took her by the hand and led her to the courtyard. After kissing her for a while, he said, “Play here for a bit, and then we’ll eat.” <br/><br/>Daisy: <br/><br/>A sweet jujube followed by a bucket of cold water? <br/><br/>Daisy didn’t mind him and strolled around the courtyard by herself. <br/><br/>There were many more weeds in the yard because the ground was still damp from last night’s rain. <br/><br/>Daisy walked along the stone-paved path, looking at the little sapling that had been left behind during the Chinese New Year from a distance. <br/><br/>The sapling was thin but covered in green leaves. <br/><br/>It seemed to be thriving. <br/><br/>And it was a White Orchid. RêAd lateSt chapters at novelhall.com Only<br/><br/>It was indeed Daisy’s favorite flower. <br/><br/>Daisy smiled, remembering Kevin’s words during the New Year about sitting in the shade under the tree once it grew tall. <br/><br/>She also thought about what he said last night. <br/><br/>She had always been there, just in another way, accompanying him. <br/><br/>After looking at the tree for a while, she followed the stone path around to the back of the house. <br/><br/>There was an open space behind the house with some vegetables and a chicken coop along the wall, housing several hens. <br/><br/>After she woke up here, she had eaten all the eggs the chickens had laid. <br/><br/>Her grandma hadn’t even gotten to eat any, they had all been given to Daisy. <br/><br/>A handwritten, English experimental record. <br/><br/>Compared to today’s electronic versions, it was not standardized, and it didn’t meet some current record standards. <br/><br/>Kevin Clark furrowed his brow, and Daisy Zane’s pupils trembled slightly. <br/><br/>For the two of them, these things couldn’t be more familiar. <br/><br/>They often encountered such things at the Pharmaceutical Formulation Institute. <br/><br/>The two remained silent, flipping through some more pages. In the middle, several pages had been preserved relatively well. <br/><br/>But they were only relatively well preserved. <br/><br/>They could make out that there were some antibiotics, antimicrobial drugs, and antituberculous drugs’ molecular and structural formulas. <br/><br/>In the following sections, they couldn’t make out what they were, just like the earlier pages. <br/><br/>Only from the incomplete traces of indentations could they guess that they resembled drug synthesis route diagrams. <br/><br/>Moreover, looking at the relatively well-preserved pages in the middle, this method of record-keeping seemed more like a manuscript. <br/><br/>A personal research manuscript. <br/><br/>The two looked at the stack of papers in silence for a while before Kevin Clark said, “Judging from the quality of this paper, it should be several decades old.” <br/><br/>Daisy Zane came to her senses, knowing what Kevin Clark meant. This might be her grandmother’s work: “I have never seen it before.” <br/><br/>Kevin Clark touched the rusted iron box again and said, “These things seem to be carefully preserved, but at the same time, very casually.” <br/><br/>The iron box was of good quality, and a waterproof paper wrapper was on the outside of the manuscript. <br/><br/>But no matter the quality, if it was buried underground, it would ultimately be damaged. <br/><br/>It was only a matter of time. <br/><br/>“It’s a bit like putting it there leaving it up to fate whether it’s good or bad,” Kevin Clark said. <br/><br/>Daisy Zane stared at the papers without speaking. Back then, someone had almost turned this place upside down. <br/><br/>They were looking for something <br/><br/>But from various clues, there were only four of them, and they had nothing suspicious on them. Nothing was missing after she cleaned up the place. <br/><br/>Diego Giovanni also said that if they were looking for something, it seemed they didn’t find it. <br/><br/>If they didn’t find it, why did they have to kill <br/><br/>It was too contradictory. <br/><br/>Kevin Clark was also silent for a while before saying, “The old lady was somewhat mysterious.” <br/><br/>“She never mentioned her own past,” Daisy Zane recalled, stroking her fingers, “She only told me about Daisy’s background. Because she was afraid that after she was gone, Daisy would leave Cold Green Village and be bullied by the Miles family. Daisy also didn’t know about her.” <br/><br/>After all, there were so many books at home, too diverse and too extensive in coverage. <br/><br/>Moreover, many were written by Victoria Zane herself, and many even had annotations and opinions on them. <br/><br/>Furthermore, from their daily conversations, Victoria Zane’s erudition could be felt. <br/><br/>Most intuitively the real Daisy Zane had never left Cold Green Village, yet she was taught so well. <br/><br/>From any angle, the old lady didn’t seem like someone willing to be in Cold Green Village. <br/><br/>Unless there was something inevitable. <br/><br/>So she had also asked the real Daisy Zane before, what was her grandmother’s job? But she didn’t know either. <br/><br/>She just said that her grandmother would not talk about it, nor would she allow any questions. <br/><br/>“I have also asked Johanes Miles in Truro City. He doesn’t know either,” Daisy Zane said.\t\t\t\t\t\t</div>", "images": {}, "success": true}