{"id": 376, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391353.html", "title": "Chapter 376 - 339: Identity_2", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 376 - 339: Identity_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 376: Chapter 339: Identity_2 <br/><br/>Translator: 549690339 <br/><br/>“The design drafts from Clayson Ninevara.” Jace Miles said, “Felix Baker gave them to me, saying they were for learning purposes.” <br/><br/>“Are you allowed to show these drafts to people?” Amelia Miles stood up when she heard they were Clayson Ninevara’s designs and looked over Jace’s shoulder. <br/><br/>“These are all photocopies.” Jace Miles said, “Clayson Ninevara himself agreed. It’s just for us to see and learn. The company also wants to train designers to improve their skills.” <br/><br/>“Clayson’s designs are indeed amazing.” Amelia Miles said, “They’re simple and high-class, and full of unique artistic elements. They’re so recognizable!” <br/><br/>“That’s where he excels.” Jace Miles replied, “That’s why he’s the chief designer at Spotlight. One of the most famous jewelry designers in the world.” <br/><br/>Amelia Miles nodded, “Brother, you’ve been at Spotlight for so long, have you ever met Clayson in person? Man or woman?” <br/><br/>“No,” Jace Miles said, “Clayson doesn’t work in-house. Felix has never revealed the gender.” <br/><br/>“So mysterious.” <br/><br/>“Yeah.” Jace Miles finished his slice of bread, stood up, and went upstairs, “Have a successful audition this afternoon.” <br/><br/>Amelia Miles smiled and said, “Of course.” <br/><br/>When Kevin Clark and Daisy Zane arrived at Cold Green Village, it was already dark. Yôur favorite stories at novelhall.com<br/><br/>The mountain path was difficult to walk, and halfway there, Daisy Zane wanted to switch with Kevin. But Kevin didn’t let her, so she slept the entire way. <br/><br/>Just like the last time, they parked the car at the foot of the slope and walked up the mountain. <br/><br/>They had four suitcases, and Daisy Zane carried two small ones. <br/><br/>Inside were clothes and quilts. They were so light that it seemed like nothing was inside. <br/><br/>The two suitcases in Kevin Clark’s hands were much heavier, large and filled with food, drink, and other necessities. <br/><br/>The two of them walked slowly uphill with their suitcases. <br/><br/>“What’s wrong?” Kevin Clark asked. <br/><br/>“The lock has been tampered with,” Daisy Zane pushed the door open, hung the lock on the door, and placed the suitcases at the entrance. <br/><br/>The doors inside the house were locked too when they left. Kevin Clark inspected them and saw signs of tampering as well. <br/><br/>He opened the door and turned on the light. <br/><br/>The room was tidy, as they had cleaned it before they left. <br/><br/>However, it was evident that someone had been rummaging through their things. <br/><br/>“Someone went through our stuff,” Kevin Clark said, “But ?they seemed to be careful not to leave too many traces.” <br/><br/>Looking at the room, Daisy Zane felt a sudden chill in her blood, as if it had frozen for a moment. She felt the icy pain in her veins. <br/><br/>However, Kevin Clark’s comment about the intruder being “careful” warmed her up a bit. <br/><br/>This was different from the last time. <br/><br/>Last time, the intruders had torn the place apart, nearly digging three feet into the ground to find what they were looking for. <br/><br/>These careful movements indicated that this wasn’t the same group of people. <br/><br/>Kevin Clark held her hand and said gently, “Don’t worry, maybe someone was just curious and came in to take a look.” <br/><br/>Daisy Zane squeezed Kevin Clark’s hand and looked at the ceiling in the left front of the room, “There’s a CCTV camera in there. But without a card reader, we can’t view the footage now.” <br/><br/>Kevin Clark followed her gaze and saw the camera. It was so well-hidden that he hadn’t noticed it last time. <br/><br/>This camera and her reaction just now hinted that someone had been here before. <br/><br/>“How long can it store footage?” <br/><br/>“One year,” Daisy Zane said, “I replaced the storage card just before Chinese New Year, right before you arrived.” <br/><br/>“Okay, take it with you when we leave.” <br/><br/>“Alright.”\t\t\t\t\t\t</div>", "images": {}, "success": true}