{"id": 373, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391341.html", "title": "Chapter 373: 337: Shopie Easton", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 373: 337: Shopie Easton</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 373: 337: Shopie Easton<br/><br/>Translator: 549690339<br/><br/>Around 3, Daisy Zane opened her eyes and saw Arthur North’s waist.<br/><br/>After a pause, she realized her hand was still resting on him.<br/><br/>She leaned back and looked at him.<br/><br/>Arthur North turned his head, touched her face, and smiled, “Awake?”<br/><br/>“Mm.” Daisy Zane glanced outside; the curtains were drawn, and the crevice was gone, making it impossible to tell the time. “What time is it?”<br/><br/>“3:20.” Arthur North said, “Do you want to sleep more or eat something?”<br/><br/>Daisy remained silent and closed her eyes again. Then she slid her hand inside his sleeping robe and accurately touched the scar on his right rib.<br/><br/>“Little girl, what are you trying to do?” Arthur North asked with a smile.<br/><br/>Daisy Zane didn’t answer him but asked, “How did you get this?”<br/><br/>Arthur North looked down at her and said softly, “It happened during training, when I got cut.”<br/><br/>A long scar, from a knife.<br/><br/>Last night, Daisy Zane had touched it.<br/><br/>“Someone can actually hurt Third Master,” Daisy Zane murmured.<br/><br/>“Don’t worry, no one will be able to hurt me in the future.”<br/><br/>After saying that, Arthur North put the computer aside, got out of bed, and poured her a glass of water.<br/><br/>Daisy Zane sat up, drank the water, and then immediately lay down again. She lay flat, looking at the ceiling, her hair a bit messy.<br/><br/>After a while, she raised her hand and touched the red rope around her neck.<br/><br/>Seeing her lost in thought, Arthur North asked, “What’s the matter?”<br/><br/>“Arthur North ” Daisy Zane stared at the ceiling, thinking about the dream she just had, “I want to go back to Cold Green Village.”<br/><br/>She had just dreamt of Cold Green Village.<br/><br/>Arthur North was taken aback for a moment, then asked, “When do you want to go?”<br/><br/>“When are you free?” Daisy Zane asked, looking at him.<br/><br/>Seeing that she wanted him to go with her, a smile appeared in Arthur North’s eyes, “I’m always free.”<br/><br/>“I’ll probably be at the drama crew for Chinese New Year this year. I want to take advantage of these days and go back for a visit.” Daisy Zane said quietly.<br/><br/>“Alright.” Arthur North agreed.<br/><br/>In the afternoon, the two discussed returning home in the next few days, and in the evening, they decided to go directly to the airport and then to Cold Green Village after leaving the Civil Affairs Bureau the next day.<br/><br/>So, after dinner at the Doomsday Hotel, the couple went back to the Rose Garden to pack their bags.<br/><br/>Daisy Zane hadn’t opened her suitcase since she brought it back from the program.<br/><br/>He put the shirt he was holding back and took one like hers.<br/><br/>The driver loaded their suitcases into the car.<br/><br/>Before going downstairs, Kevin Clark looked at the empty-handed little girl and felt inexplicably nervous. He said, “Miss, the documents.”<br/><br/>“They’ll be delivered to the entrance of the Civil Affairs Bureau,” Daisy replied.<br/><br/>“Alright.”<br/><br/>On the way there, Kevin Clark held Daisy’s hand, his palm constantly sweating.<br/><br/>Whenever Daisy’s hand moved slightly, Kevin Clark’s grip would tighten.<br/><br/>And when they got out of the car, his grip tightened even more.<br/><br/>Though the Civil Affairs Bureau hadn’t opened yet, there were already people waiting at the entrance.<br/><br/>There weren’t many people, so the wait shouldn’t be too long.<br/><br/>Kevin Clark, holding her hand, scanned the entrance and asked, “Where are the people delivering the documents?”<br/><br/>Daisy glanced at their clasped hands, and for a brief moment, a smile crossed her usually cold face: “Kevin Clark.”<br/><br/>“Hmm?”<br/><br/>“I won’t run.”<br/><br/>Kevin Clark looked at her, paused, and still didn’t let go of her hand. He said calmly, “There are many people, don’t get lost.”<br/><br/>Daisy looked at the sparse crowd and smiled silently.<br/><br/>Soon, someone from the Celestial Pivot arrived to deliver Daisy’s documents.<br/><br/>He treated Daisy respectfully, but it seemed like he didn’t know how to address her. When he reached her side, he simply handed the file bag to her with both hands and said, “Here are the documents you need.”<br/><br/>Daisy thanked him.<br/><br/>The man bowed his head and watched Kevin and Daisy go to line up before he left.<br/><br/>There were five couples ahead of them.<br/><br/>Soon after the Civil Affairs Bureau opened, it was their turn.<br/><br/>It wasn’t until they sat down that Kevin Clark let go of Daisy’s hand.<br/><br/>Third Master Clark seemed calm and no different from usual, but when opening the file bag, his fingertips trembled, and it took him a while.<br/><br/>Daisy watched his hand and suddenly felt a warm stream in her heart. She swallowed and held his hand, rubbing her thumb against the back of his hand a few times.<br/><br/>Her hand was a bit cold, but Kevin Clark still felt the warmth.<br/><br/>He turned to look at her, smiled tenderly, and then took out their documents.<br/><br/>He handed his own over first, but when it came to handing out Daisy’s documents, he suddenly stopped and withdrew his hand.<br/><br/>He looked at the name on the Household Register and ID card.<br/><br/>Shopie Easton.\t\t\t\t\t\t</div>", "images": {}, "success": true}