{"id": 375, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14391349.html", "title": "Chapter 375 - 339: Identity", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 375 - 339: Identity</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 375: Chapter 339: Identity<br/><br/>Translator: 549690339<br/><br/>The news of Daisy Zane’s marriage certificate immediately became a hot search topic.<br/><br/>She and Kevin Clark went to Cold Green Village to avoid the chaos, but the outside world was in an uproar.<br/><br/>Especially the Maxwell and Miles families.<br/><br/>Bonnie Maxwell was furious enough to spit blood.<br/><br/>Daisy Zane’s Facebook photo only showed the outer cover of the marriage certificate and not the inside.<br/><br/>At first, when she saw it, she still held a glimmer of hope, thinking that Daisy had broken up with Kevin and married someone else instead.<br/><br/>Because she always thought that Kevin was just attracted to Daisy’s beauty for a while and would get tired of her eventually.<br/><br/>So she subtly inquired at the Clark Manor and found out the certificate was indeed with Kevin.<br/><br/>She couldn’t believe that Kevin was serious and acted so quickly.<br/><br/>Not only her but the entire Maxwell family was in a somber mood due to the news.T/his chapter is updated by nov(ê(l)biin.co/m<br/><br/>Their daughter had been talked about as Kevin Clark’s fiancée in Imperial Capital for so long, but now his wife was someone else.<br/><br/>It was a true laughingstock.<br/><br/>The Maxwell family had lost face completely.<br/><br/>Most importantly, the great opportunity of a marriage alliance with the Clark family was gone.<br/><br/>That meant the Maxwell family lost a significant support.<br/><br/>Bonnie couldn’t stand the atmosphere at home and drove to her living quarters.<br/><br/>She clicked on the photo of the marriage certificate and stared at it for a long time.<br/><br/>What kind of luck did Daisy have to get the attention of the Clark family without doing anything?<br/><br/>What was so good about her that Kevin Clark would marry her?<br/><br/>She really underestimated her.<br/><br/>She was truly skilled in seducing men.<br/><br/>While she was looking, Jace Miles came downstairs and saw her sitting on the sofa, staring at her phone. He asked, “You’re not going out?”<br/><br/>After arriving in Imperial Capital, Amelia Miles had been staying at Jace Miles’ apartment.<br/><br/>“I’ll leave in a bit.” Amelia looked at him with an all-nighter appearance and holding the design draft in his hand as he came downstairs. “Aren’t you going to work today?”<br/><br/>As Jace looked at the design draft in his hand and walked toward the kitchen, he said, “I took a day off.”<br/><br/>Amelia Miles was speechless. Her brother was so absorbed in his designs that he was losing track of day and night.<br/><br/>After a while, Jace stepped out of the kitchen with a slice of bread in his mouth and sat across from Amelia. “You heard about Daisy Zane getting her marriage certificate, didn’t you?”<br/><br/>“Yeah,” Amelia replied.<br/><br/>“How did you all hear about it?”<br/><br/>Amelia Miles narrowed her eyes and said nonchalantly, “You know about it too.”<br/><br/>“Dad just called and told me,” Jace said. “He asked if I knew who the guy was. How would I know? Do you?”<br/><br/>Amelia Miles immediately said, “I don’t know. I’ve never seen him.”<br/><br/>Jace looked up at her.<br/><br/>Amelia felt goosebumps from his gaze and quickly changed the subject, “What have you been looking at that you can’t even put it down while eating?”\t\t\t\t\t\t</div>", "images": {}, "success": true}