{"id": 384, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14491447.html", "title": "Chapter 384 - 346: Shopping_2", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 384 - 346: Shopping_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 384: Chapter 346: Shopping_2 <br/><br/>Translator: 549690339 <br/><br/>Natalie Wayne couldn’t help but laugh at her words. <br/><br/>Jane Chester also chuckled, “Miss, we’ve already decided to buy this dress.” <br/><br/>“I said, it’s not paid for, right?” Miss Johnson looked at the salesperson and said, “How much is this dress? I’ll pay double the price.” <br/><br/>The salesperson glanced at Johnson Lily, and then at Natalie Wayne but she had never seen her before. She then smiled and said, “Since Miss Johnson likes it, I’ll pack it up for you.” <br/><br/>A mocking flash appeared in Natalie’s eyes. <br/><br/>Jane couldn’t help but sneer, “Is that how Cloud Clothing and Rainbow Skirts sells things?” <br/><br/>The salesperson showed a standard smile and said, “Since you haven’t paid yet, others naturally have the right to choose.” <br/><br/>“Didn’t I just say to pack it up for me?” Jane Chester insisted. <br/><br/>The salesperson ignored her outright. <br/><br/>Jane tried to speak, but she really couldn’t find the words. It was the first time she heard about such a situation. <br/><br/>Natalie Wayne didn’t expect to encounter this kind of situation, either. <br/><br/>Johnson Lily looked at them and revealed a smug smile, “In such a luxurious place, the one with money rules. Do you know how much I spend here in a year? It’s enough for your ten years’ living expenses.” <br/><br/>Jane Chester almost rolled her eyes at her, took out her card, and put it on the cashier counter, “Whoever pays first gets it, so I’ll pay now.” <br/><br/>Johnson Lily, who was looking at other clothes, turned when she heard it. <br/><br/>Jane said, “Swipe the card.” <br/><br/>The salesperson hesitated for a moment and then smiled, “Miss Johnson is one of our senior members and has priority choice.” <br/><br/>“So it’s a must to sell this dress to her today.” <br/><br/>The salesperson remained silent. <br/><br/>Johnson Lily grinned, “Of course. I contribute so much to Cloud Clothing and Rainbow Skirts every year. The two of you should just stop wasting your effort trying to compete with me.” <br/><br/>The salesperson smiled and took the dress down to prepare to pack it. <br/><br/>Jane Chester took a step forward, trying to stop her, but Natalie Wayne stopped her, “Lucia is here.” <br/><br/>Jane halted. <br/><br/>Today, they were out shopping with Daisy Zane. Because their mood was affected due to this incident, they hadn’t been good hosts, which was indeed impolite. <br/><br/>It’s not a big deal anyway; they could handle it afterward. <br/><br/>“What can happen if I don’t compensate?” Daisy confidently asked. <br/><br/>Salesperson: “You ” <br/><br/>Johnson Lily scoffed and mocked, “You think Cloud Clothing and Rainbow Skirts are your home? Just because you say you won’t compensate doesn’t mean you won’t.” <br/><br/>“Actually, it is her home,” a voice suddenly sounded at the entrance. <br/><br/>Everyone looked at the entrance. <br/><br/>Joseph Allen walked in with his secretary, assistant, and the person in charge of this place. He looked at Daisy, his eyes filled with laughter, but his voice was somewhat cold, “Not just one dress. Even if she smashed or burned this entire floor, she wouldn’t need to pay any compensation. Even the Cloud Clothing and Rainbow Skirts headquarters would be at her disposal.” <br/><br/>Everyone was stunned upon seeing Joseph. <br/><br/>The mall outside had pictures of Joseph Allen on display, who did not know him? <br/><br/>Natalie Wayne looked at Joseph, and especially after hearing his words, she immediately exchanged glances with Jane Chester. <br/><br/>Neither of them spoke, but they both saw the two words “love rival” in each other’s eyes. <br/><br/>“Mr. Allen,” the salesperson only reacted when he approached and immediately lowered her head to greet him. <br/><br/>Johnson Lily also looked at Joseph Allen, momentarily unable to react. <br/><br/>Joseph, oblivious to everyone else, walked directly to Daisy, “It’s quite a wonder, Lucia starts shopping.” <br/><br/>Daisy gave him a signal with her eyes and said softly, “Nearby?” <br/><br/>Joseph caught her eye but still answered her question first, “I was inspecting the store. It happened to be nearby.” <br/><br/>After saying that, he looked to the side. <br/><br/>Seeing Natalie and Jane Chester, he immediately smiled warmly, “Boss Wayne, what brings you here today?” <br/><br/>Natalie Wayne stood up and smiled, “Mr. Allen, long time no see. We were close by so we came over.” <br/><br/>The salesperson’s face instantly turned pale, even her lips were white, a sickly white. <br/><br/>Johnson Lily also immediately fell silent. They knew Joseph Allen, and they were so familiar with him. <br/><br/>Joseph looked at Daisy, knowingly said, “Taking Lucia out shopping.” <br/><br/>With one sentence, he established a relationship with Daisy. Although it was familiar, it sounded more like an elder brother to a younger sister. And he knew about their relationship. <br/><br/>Natalie naturally understood his words and asked without changing her expression, “Mr. Allen knows Lucia?” <br/><br/>“Boss Wayne, you and Lucia have quite a connection,” Joseph said. <br/><br/>“How so?” Natalie asked curiously. <br/><br/>Joseph glanced at Daisy, then took off her little vest, “She’s Shopie Easton.” <br/><br/>Natalie was momentarily stunned, then suddenly looked at Daisy.\t\t\t\t\t\t</div>", "images": {}, "success": true}