{"id": 380, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14473446.html", "title": "Chapter 380 - 343: Going Up The Mountain Together", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 380 - 343: Going Up The Mountain Together</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 380: Chapter 343: Going up the Mountain Together <br/><br/>Translator: 549690339 <br/><br/>Although the manuscript was severely damaged and it was impossible to see what was on it, Kevin Clark and Daisy Zane still kept it. <br/><br/>There were too many mysteries to solve, and no way to start. <br/><br/>They could only keep it and make a plan slowly. <br/><br/>After lunch at noon and a two-hour rest, the two cleared the weeds in the courtyard. <br/><br/>Kevin Clark also repaired the slightly damaged parts of the walls and roof. <br/><br/>He worked until it was dark and then went to cook. <br/><br/>This time Daisy Zane followed him into the kitchen, touching nothing, just sitting on the edge of the stove watching Kevin Clark cook. <br/><br/>“Madam, move back a bit. Be careful not to get splashed by oil.” <br/><br/>Daisy Zane tried to push her chair back by stepping on the ground. <br/><br/>However, the bamboo chair and the ground friction made it difficult to move, and it even creaked and wobbled for a moment. <br/><br/>Daisy Zane: ” .” <br/><br/>Hearing the sound, Kevin Clark looked back and saw her expression, laughed, walked over, bent down and held her knees with his arm. <br/><br/>“Hold my neck with your hands.” <br/><br/>Daisy Zane looked at him and embraced his neck. <br/><br/>With one arm supporting her knees and one hand holding the chair, Kevin Clark stood up, took a few steps back, put down the chair, and bent down to put her on the chair again. <br/><br/>Daisy Zane looked closely at his eyebrows and eyes, and after a moment, she gently licked her lips with the tip of her tongue. <br/><br/>Kevin Clark kissed her, his eyes smiling, “Sit for a while, it’ll be ready soon.” <br/><br/>Daisy Zane withdrew her hand and leaned back on the chair. Watching Kevin Clark’s silhouette go back to the stove, his broad shoulders and long legs made even the cooking smoke seem like an aura of immortality around him. After a moment, she whispered, “Third Master has such a nice waist.” Follow the latest novels at novelhall.com<br/><br/>Kevin Clark turned his head to look at her, seeing her unabashedly scrutinizing him, he hesitated for a moment and laughed, “Doesn’t Madam know if it’s good or not?” <br/><br/>Daisy Zane’s expression froze: <br/><br/>The next day, early in the morning, Daisy Zane and Kevin Clark went up the mountain together. <br/><br/>On the way, Daisy Zane picked a few white orchid flowers, and Kevin Clark helped her carry the wine. <br/><br/>When they reached the top of the mountain, the hundred-year-old tree was still flourishing, casting a shadow below. <br/><br/>The Miles Family, Amelia Miles in particular, acted as a catalyst in the process of clarifying her identity. <br/><br/>Daisy Zane’s identity was not revealed by netizens from the beginning. <br/><br/>It was Amelia Miles who spread the information. <br/><br/>She didn’t deny that she went to Truro City with a purpose, but the current situation of the Miles Family was their own doing. <br/><br/>If only Johanes Miles treated her, who was impersonating Daisy Zane, a little better, if he had a little guilt for “Daisy Zane” and shared some of his love for Amelia Miles with her. <br/><br/>The Miles Family would not have ended up like this today. <br/><br/>Daisy Zane talked a lot to the empty tombstone. <br/><br/>Kevin Clark stood behind her all along and accompanied her. <br/><br/>After a long time, Daisy Zane stood up, took two steps back, and stood together with Kevin Clark: “I’ll show you the photos of Daisy.” <br/><br/>Kevin Clark looked at her: “Okay.” <br/><br/>Daisy Zane found an encrypted album, typed in the password, and there were more than a thousand photos inside, all of her with Daisy Zane and Victoria Zane. <br/><br/>There were also many landscape photos. <br/><br/>They were all from Cold Green Village. <br/><br/>She flipped through and found a solo photo of Daisy Zane. <br/><br/>Her shoulder-length hair, a lively and gentle appearance, her eyes were spirited, and her left cheek dimpled when she smiled. <br/><br/>Through the screen, one could feel her aura and vivacity. <br/><br/>Most importantly, she looked so much like Amelia Miles. <br/><br/>Apart from that spirituality and dimple, she was almost identical. <br/><br/>She also resembled Johanes Miles but looked even more like Amelia Miles. <br/><br/>Kevin Clark looked at the little girl, looking at her drooping eyes with a hint of a smile. <br/><br/>Perhaps this was the reason why she never came down hard on Amelia Miles and Johanes Miles. <br/><br/>If Amelia Miles was gone, there would never be anyone as similar to her in this world. Even if they only looked alike, seeing them for a moment would be enough. <br/><br/>If Johanes Miles was gone, there would be no one in this world connected to her. <br/><br/>So even if she hated them, she never got ruthless with them. <br/><br/>“Let’s go back.” Daisy Zane closed her cell phone and said faintly. <br/><br/>“Alright.”\t\t\t\t\t\t</div>", "images": {}, "success": true}