{"id": 383, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14478359.html", "title": "Chapter 383: 346: Shopping", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 383: 346: Shopping</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 383: 346: Shopping<br/><br/>Translator: 549690339<br/><br/>Kevin Clark was busy at the company last night, and then went to the Research Institute early in the morning.<br/><br/>He was busy until past eleven o’clock.<br/><br/>During these days that he went to Cold Green Village, it was William Lane who took over his tasks.<br/><br/>Now he also planned to go home and rest. William Lane, dragging his white lab coat, said, “Are we going to Mountain Sea Continent in a few days?”<br/><br/>“Yeah. Together?”<br/><br/>“What about the laboratory?” William Lane said.Nêww chapters will be fully updated at novelhall.com<br/><br/>“True.”<br/><br/>“How long will it take to come back?”<br/><br/>After thinking about it, Kevin Clark said, “At most half a month.”<br/><br/>“So fast this time?”<br/><br/>Kevin Clark looked at him and said leisurely, “I have a family now, and I can’t be wandering outside for too long.”<br/><br/>William Lane: He just asked too much.<br/><br/>Kevin Clark smiled and said, “It’s been a long time since I’ve been back. I’ll take this opportunity to deal with some things. As for training, let Thomas Firway take care of it.”<br/><br/>“Indeed. How about the training you personally provided? You still had one fake death and leaving.”<br/><br/>Kevin Clark’s eyes were filled with a fleeting darkness at the mention of this.<br/><br/>William Lane looked at him and said, “Kevin Clark, I’m a bit curious. If you meet him, can you beat him?”<br/><br/>Kevin Clark raised his eyebrows slightly. He didn’t speak, but his meaning couldn’t be clearer.<br/><br/>When Natalie Wayne saw something and asked her, she would express her own opinion.<br/><br/>She felt that the acting skills of her entire life were used at this time.<br/><br/>Turning a thing that she hated into a normal thing to deal with.<br/><br/>The entire fifteenth floor of the Commerce and Trade building were Cloud Clothing and Rainbow Skirts stores.<br/><br/>There were few people on this floor. When the three of them came up, Natalie Wayne and Jane Chester entered a nearby store.<br/><br/>Daisy Zane went to answer a phone call.<br/><br/>It was Morris who called, telling her that the previous movie, the one with Stella Edwards as the Female Lead, was about to be broadcast, and asked if she would attend the premiere.<br/><br/>Daisy Zane told him not to go.<br/><br/>Then the two of them chatted about the new script for a few minutes.<br/><br/>No more than 5 minutes later, when Daisy Zane returned, she saw someone was giving Natalie Wayne a hard time.<br/><br/>She walked over listening to the voice.<br/><br/>The other party was a celebrity. When Daisy Zane was filming her second drama, the Female Lead of the neighboring drama crew was already famous for many years.<br/><br/>Years ago, Morris invited her to film a movie, but she refused because the income was too low.<br/><br/>Daisy Zane only remembers her last name, Xu, but she couldn’t remember her first name clearly.<br/><br/>In front of others, Natalie Wayne always maintained a gentle image. Even if the person opposite was picking a fight, she still tried to reason.<br/><br/>You couldn’t see her momentum when she scolded Kevin Clark at all.<br/><br/>Daisy Zane listened as she approached.<br/><br/>Natalie Wayne said, “Miss, there’s an order to buying things. I saw this dress first, and I’m going to check out. If you still want it, wouldn’t it be inappropriate?”<br/><br/>“It hasn’t been checked out yet, has it? If it’s not checked out, then we have the right to compete equally for this dress.”\t\t\t\t\t\t</div>", "images": {}, "success": true}