{"id": 381, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14473447.html", "title": "Chapter 381 - 344 Mr. Jing", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 381 - 344 Mr. Jing</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 381: Chapter 344 Mr. Jing <br/><br/>Translator: 549690339 <br/><br/>M Continent Dance Theater <br/><br/>Stella Edwards had just finished her performance and stepped off the stage when she was handed a bouquet of roses backstage. <br/><br/>Seeing the roses, those around her joked, “Stella, did your boyfriend send flowers again?” <br/><br/>With the roses in her hand, a joy grew in Stella’s heart as she laughed and said, “Nonsense, he’s not my boyfriend.” <br/><br/>“Not your boyfriend, yet he sends flowers for every performance, roses at that,” quipped a young girl nearby. <br/><br/>“If not a boyfriend, he must be an admirer. Stella, you’re irresistible. He’s been pursuing you for so long. Every time you’re in the M Continent, right after your performance, there’s always a flower waiting for you.” <br/><br/>Stella chuckled, a soft twinkling in her eyes. <br/><br/>The man was neither her boyfriend nor had he ever shown intentions of courting her. <br/><br/>He was simply very kind to her. <br/><br/>“If he’s impressive and decent, I might consider it. I’m at an age to entertain a relationship.” <br/><br/>Stella pressed her lips together, her heartbeat racing a bit. <br/><br/>After jesting around a bit more, Stella went to change her clothes. <br/><br/>Once in the changing room, Stella took a whiff of the roses and then looked at the card that came with the bouquet. <br/><br/>[Congratulations on a successful performance. Do you have time? I’m waiting outside. -Edward.] <br/><br/>Seeing the message on the card deepened the smile in her eyes. She quickly changed her clothes, removed her stage makeup, and promptly applied a light, fresh-faced look. <br/><br/>Before leaving, she checked her appearance in the mirror, revealing a faint smile. Once satisfied, she promptly made her way to the entrance. <br/><br/>A Rolls-Royce was parked outside. <br/><br/>The moment she caught sight of the car, the rear window rolled down. <br/><br/>Edward Kirsten, wearing a black mask, smiled at her and said, “Stella, over here.” <br/><br/>Stella broke into a smile and ran over, “Mr. Kirsten.” <br/><br/>A hint of laughter colored Edward’s pale blue eyes, “I’ll take you to something delicious.” <br/><br/>Alice Eugene, who was driving ahead, slightly lowered her gaze upon hearing this. This was something Edward often said to Kiara Lawrence. <br/><br/>“Ok.” <br/><br/>Stella climbed into the car, and Edward reached up to remove his mask. <br/><br/>He had sharp features and apart from his pale blue eyes, he did not seem to be of mixed ethnicity. <br/><br/>His lips were pale, radiating a cool, attractive charm. <br/><br/>Stella always saw him dressed in a perfectly tailored three-piece suit. <br/><br/>These facts fit exactly with the person they had been looking for. <br/><br/>Alice Eugene caught several glimpses of Edward Kirsten through the rearview mirror. <br/><br/>The usually calm and quiet man seemed somewhat restless now. <br/><br/>But Edward Kirsten kept staring at that photo. <br/><br/>He had not seen his Enigma for too long <br/><br/>Edward Kirsten had been spending nearly all his time in the laboratory, leaving him very little time for himself. <br/><br/>He hardly ever went online, partly because he felt no need to, and partly because he thought it was unsafe and would easily expose him to tracking. He only occasionally asked Alice Eugene to look up something online. <br/><br/>Even the information that Harton Clark was by her side was discovered by Alice Eugene’s chance encounter in Red Cliff Village. <br/><br/>It wasn’t that he hadn’t tried to find her before. <br/><br/>But for the first few years after she left Continent A, he couldn’t find any trace of her. <br/><br/>He was well aware of Enigma’s hacker abilities. If she wanted to hide, it would be too easy for her. <br/><br/>Moreover, back then, he was being heavily tracked, so he had to put off searching for her temporarily. <br/><br/>And after Alice Eugene encountered her in Red Cliff Village, he didn’t bother to look her up again. <br/><br/>What he needed was to rebuild his forces quickly. <br/><br/>Once he rebuilt his forces and exposed his whereabouts, Enigma would definitely come to find him. What he needed was a force capable of trapping her. <br/><br/>Aside from that, even if he found out where she was and what she was doing, it would all be futile if he couldn’t bring her back. <br/><br/>Thus, he had no idea that Enigma was acting in domestic movies, and naturally would pay no attention to domestic entertainment news. <br/><br/>The phone call during Chinese New Year was traced through a tracker that Enigma had stuck to her hair in Red Cliff Village. <br/><br/>But the mobile number was registered under the name Nicholson Amos. <br/><br/>He was able to trace the mobile number through the tracker, but couldn’t find any other information, and couldn’t even locate the cellphone. <br/><br/>At that time, he thought that it might have been a trap set up by Enigma. Therefore, when Alice Eugene started searching, they didn’t do it on their own turf. They even changed locations several times during the search as a precaution. <br/><br/>And after he found the number, he quickly made the call and then swiftly moved to another location. However, he was nearly tracked down. <br/><br/>Edward Kirsten indeed didn’t expect that she would dare to cause such a commotion domestically. <br/><br/>She had completely exposed herself to the public. <br/><br/>Among the people with him now, except for Alice Eugene, everyone else who had seen Enigma was already gone. <br/><br/>So even if his people saw her online, or if the domestic people saw her in person, they would not know that Daisy Zane was the Enigma he spoke of. <br/><br/>But many people had seen Alozon Kirsten. <br/><br/>This resulted in his domestic people finding out where Alozon and Jack Kingsley lived, and they nearly managed to seize Jack Kingsley. However, they didn’t bring back even the slightest bit of news about Enigma. <br/><br/>If he had known If he had known that Enigma had become an actor, why would he watch those old videos over and over again every day?\t\t\t\t\t\t</div>", "images": {}, "success": true}