{"id": 389, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14492875.html", "title": "Chapter 389 - 349: Bottom Line", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 389 - 349: Bottom Line</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 389: Chapter 349: Bottom Line<br/><br/>Translator: 549690339<br/><br/>Daisy Zane and William Butch were on the rooftop for a long time, none of them engaged in conversation, they were just standing there looking down.<br/><br/>It wasn’t until William sneezed twice from the cold that Daisy took him back to the ward.<br/><br/>On their return, Holt Lawrence was waiting for them at the entrance to the ward.<br/><br/>He wore his shirt as if it were a cloth ripped from somewhere, his demeanor was scattered and rather weary.<br/><br/>He had, however, shaved his beard and had his hair trimmed.<br/><br/>He looked more spirited and refreshed compared to the last time Daisy saw him.<br/><br/>The last time Daisy encountered him at the Celestial Pivot, she thought he was drained by some Fairy Clan creature.<br/><br/>William cast him a glance and then lowered his head without speaking.<br/><br/>Daisy led him back to the ward.<br/><br/>Holt Lawrence looked at him and said, “Child, there’s a computer that I brought for you on the bedside table, feel free to use it.”<br/><br/>William stopped in his tracks, his lips moved slightly without speaking, then he entered the ward.<br/><br/>Once the room door closed, both Daisy Zane and Holt Lawrence shifted a bit to the side.<br/><br/>Holt Lawrence asked, “How is he? Has he recovered?”<br/><br/>Daisy glanced at him.<br/><br/>Holt Lawrence said, “Oh. It’s a psychological issue with him, it has to be taken slow.”<br/><br/>“Let him reflect on it himself for the time being, continue to have him watched closely to prevent him from doing anything rash.”<br/><br/>Daisy squeezed her icy fingertips, another call came in.<br/><br/>Without looking, she said, “It’s alright, I’ll handle it.”<br/><br/>“Lucia, where are you? I’ll come and keep you company.”<br/><br/>“No need.”<br/><br/>After hanging up the call, Daisy wanted to check the news on her phone but Harton Clark’s call came in.<br/><br/>Her finger hesitated on the end call button, it then moved and put her phone away, “Let me use your phone.”<br/><br/>Holt handed her his phone.<br/><br/>Daisy opened Facebook, and without even having to search, she saw the trending topic about her.<br/><br/>She clicked on it, and then directly played the video.<br/><br/>In the video, a man who seemed to be in his late fifties, with dark and slightly rough skin, was dressed in the unique costume of Cold Green Village.<br/><br/>His accent was heavy, but what he was saying was still understandable.<br/><br/>He roughly talked about Daisy having relationships with many people in the village while they were dating.<br/><br/>Claiming that she had conceived his child, but aborted it.<br/><br/>He even gave specific details concerning where Daisy had relations with him and others. It all took place at Daisy’s home.<br/><br/>The details of the house that Daisy lived in, the kitchen she cooked in, and the furnishings inside were all described by him.<br/><br/>His words were disgusting to listen to.<br/><br/>He also mentioned the reasoning behind his visit to the Imperial Capital and recording this video.<br/><br/>It was to confront her, as to why she was involved with others while dating him.\t\t\t\t\t\t</div>", "images": {}, "success": true}