{"id": 385, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14491448.html", "title": "Chapter 385 - 347: Hero Saves The Beauty", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 385 - 347: Hero Saves The Beauty</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 385: Chapter 347: Hero Saves the Beauty<br/><br/>Translator: 549690339T/his chapter is updated by nov(ê(l)biin.co/m<br/><br/>Seven or eight years ago, Cloud Clothing and Rainbow Skirts had just started.<br/><br/>Natalie Wayne accidentally discovered clothes designed by Shopie Easton and fell in love with them.<br/><br/>She specifically asked Shopie to design clothes for her for almost a year.<br/><br/>So, for almost a year, Shopie only designed clothes for Natalie.<br/><br/>But she had never met Natalie, and didn’t even know who she was making them for. She only listened to a rough description given by Joseph Allen of Natalie’s appearance, occupation, temperament, personality, and preferences and designed clothes based on that information.<br/><br/>Because it brought a considerable profit to Cloud Clothing and Rainbow Skirts at the time, she gladly agreed to the arrangement.<br/><br/>At the scene, not only was Natalie surprised to see Daisy Zane, but Jane Chester’s brain was completely stunned.<br/><br/>And both Johnson Lily and the salesperson were dumbfounded.<br/><br/>Johnson Lily couldn’t accept this fact, feeling like she was dreaming or her ears were playing tricks on her.<br/><br/>The more arrogant she had been just now, the more embarrassed she was now.<br/><br/>Because the capital she used to show off was actually someone else’s.<br/><br/>“Lucia is Shopie?” Tom Wayne asked.<br/><br/>Joseph nodded, his tone proud: “Yes.”<br/><br/>Tom looked at Joseph, then at Daisy, and after a while, murmured, “How young she was back then.”<br/><br/>“Mr. Allen, Mr. Allen. Mr. Easton I can’t lose this job. If I leave here, who would dare to hire me. I have a family to support; I can’t lose this job.” The salesperson cried, tears streaming down her face.<br/><br/>In a soft voice, Daisy asked her, “Why are you crying?” while handing her a tissue paper from the side.<br/><br/>The salesperson took the tissue paper, thinking Daisy was going soft, and wiped her tears while saying, “Mr. Easton, I’m sorry. I’ll never do it again. Please give me another chance.”<br/><br/>Daisy looked at her and stroked the clothes in her hand, saying, “Clothes, I can barely understand why you’d let someone pay you first. But just now, when she tried to pay, you didn’t allow her. What’s the logic in that?”<br/><br/>“I won’t do it again, I won’t.”<br/><br/>Ignoring her, Daisy continued in a soft voice, “Because of your fawning, incompetence, and snobbishness, you offended people. In the end, it’s Cloud Clothing and Rainbow Skirts who has to pay the price. Today, I was here, and they were selling me a favor. What if I wasn’t here? Tomorrow, Cloud Clothing and Rainbow Skirts would be torn apart, not even leaving a single bone.”<br/><br/>Joseph and Tom exchanged glances and both politely smiled before looking away.<br/><br/>As Johnson Lily looked at Tom, she felt her body getting colder and colder.<br/><br/>It seemed she had offended quite a figure.<br/><br/>“Then I’ll be the one crying at that time.” Daisy spoke slowly, “I have no reason to keep someone who almost caused a loss to the company.”<br/><br/>“Mr. Easton, Mr. Easton, I ”<br/><br/>“Don’t say you need to support your family; who doesn’t?” Daisy interrupted her, “You caused the problem, take responsibility.”<br/><br/>The salesperson saw that pleading with Daisy was futile, so she turned to Joseph, “Mr. Allen, Mr. Allen. Give me one more chance.”<br/><br/>Joseph looked at her, hesitated for a moment, and said, “Wipe your tears, and leave here with dignity.”<br/><br/>The salesperson couldn’t hold back her tears.<br/><br/>The choked sobbing, like she was suffocating to death.\t\t\t\t\t\t</div>", "images": {}, "success": true}