{"id": 386, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14492203.html", "title": "Chapter 386 - 347: Hero Saves The Beauty_2", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 386 - 347: Hero Saves The Beauty_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 386: Chapter 347: Hero Saves the Beauty_2<br/><br/>Translator: 549690339<br/><br/>Arthur felt sorry for her as she cried pitifully.<br/><br/>Daisy didn’t look at her anymore and turned to Lily Johnson.<br/><br/>The moment Lily met her gaze, her pupils suddenly contracted, and she staggered back a step, “What do you want?”<br/><br/>“Shouldn’t Miss Johnson apologize?”<br/><br/>“I, why should I apologize? And why should I?” Lily said, “What? You use your power to bully your employees. Shouldn’t you apologize to them?”<br/><br/>“Sophie Easton has the right to manage Cloud Clothing and Rainbow Skirts. There’s no bullying in just firing an employee,” Joseph Allen said with a sarcastic smile.<br/><br/>“Well, then, why should I apologize? I will not apologize. Do you know how many fans I have? Their spit alone can drown you.” Lily raised her arrogant head, refusing to bow.<br/><br/>“Let’s see if you can leave this place today,” Daisy said, looking at her.<br/><br/>“What do you want? Dare to confine me?”<br/><br/>Daisy looked at her without saying anything, even raising the corner of her lips slightly.<br/><br/>But Lily realized that she dared to confine her, and Daisy’s cold, chilling, and contemptuous gaze told her that she could do even worse.<br/><br/>Lily stepped back again, looked at Daisy, and then at Joseph Allen and Arthur North.<br/><br/>Now, only the sobbing salesperson remained in the store.<br/><br/>Seeing that her pleas to Sophie Easton and Joseph were useless, the salesperson turned to Arthur North and called out like Joseph did, “Boss Wayne, I’m sorry, I’m really sorry. I didn’t recognize your importance. Please forgive my mistakes and give me a chance to live. If I get fired from here, no one else will dare hire me.”<br/><br/>As she said this, she tried to reach for Arthur’s arm, but Daisy grabbed her arm first, preventing her from touching him.<br/><br/>“Boss Wayne, I’m only twenty-seven, and I still have a child to raise. I didn’t do it on purpose.”<br/><br/>As an older person, Arthur easily felt sympathy. Seeing her crying like that, he couldn’t bear it, so he said, “Daisy Why not spare her?”<br/><br/>Daisy glanced at Arthur and then at the salesperson, her expression never loosening. “I haven’t been involved in the company’s affairs. But I passed by the employee training area twice and saw a service concept: Supreme service, equal treatment for all.”<br/><br/>The salesperson didn’t say anything, just lowered her head and sobbed.<br/><br/>Arthur looked at Daisy.<br/><br/>He always thought that Daisy’s way of handling things was similar to Kevin Clark’s.<br/><br/>“You made the mistake first. Your mistake almost caused an irreparable loss to Cloud Clothing and Rainbow Skirts,” Daisy said calmly. “Keeping you here, you’ll only create trouble one after another. Do you want to offend everyone for Cloud Clothing and Rainbow Skirts?”<br/><br/>The consequences of her mistake would eventually come back to Cloud Clothing and Rainbow Skirts.<br/><br/>Just like Jane Chester said, “Is this how Cloud Clothing and Rainbow Skirts sells things?”<br/><br/>“I won’t do it again, really.”<br/><br/>“The only way for me to believe that you won’t do it again is for you not to be here,” Daisy said. “I don’t understand why you cry as if I’m the one bullying you when you made the mistake in the first place.”\t\t\t\t\t\t</div>", "images": {}, "success": true}