{"id": 388, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14492874.html", "title": "Chapter 388 - 348: Meeting William Butch", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 388 - 348: Meeting William Butch</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 388: Chapter 348: Meeting William Butch<br/><br/>Translator: 549690339<br/><br/>Daisy Zane originally planned to see Holt Lawrence in the morning, but Natalie Wayne suddenly arrived, so she changed it to the afternoon.<br/><br/>However, Kevin Clark didn’t get any rest last night, and if she went out, he would definitely follow her.<br/><br/>So, she simply went home to rest as well.<br/><br/>After they returned home, when Kevin finished taking a shower, Daisy held a tablet in her hand with a half-finished design for a piece of clothing on it.<br/><br/>And the person had already laid down and fallen asleep.<br/><br/>He saved everything on the tablet, turned it off, and placed it on the bedside table.<br/><br/>Then he went to bed, hugged her, kissed her, and fell asleep holding her.<br/><br/>The two of them slept until past six o’clock.<br/><br/>This also led to the well-rested Third Master Clark bothering her at night.<br/><br/>So, the next day when Daisy Zane went to see Holt Lawrence, it was already the afternoon.<br/><br/>Since Daisy Zane mainly wanted to see William Butch, she and Holt agreed to meet at the hospital.<br/><br/>The two met at the entrance of the Inpatient Department, and as soon as Holt Lawrence saw Daisy Zane, he greeted her warmly and started asking how she had been.<br/><br/>Then, Daisy Zane handed him a USB flash drive, shutting him up, “Everything you need is in here.”<br/><br/>“Alright.” Holt Lawrence touched the USB flash drive, almost wanting to kiss it. He carefully put it away while following Daisy Zane upstairs, and then asked, “Nana, what’s wrong? You seem a bit out of spirits.”<br/><br/>What happened? Kevin Clark was being unreasonable, not letting her sleep.<br/><br/>All these gentlemanly, polite, and civilized manners are fake.<br/><br/>He’s a wolf.<br/><br/>“It’s nothing. How is William?”<br/><br/>“Sigh.” Holt Lawrence sighed, “He has been eating well three meals a day, but he hasn’t said a word. He lost almost 20 pounds in just these few days. I’m afraid he might disappear completely with his thin arms and legs.”<br/><br/>“What about his family and school?”<br/><br/>“I asked for leave from his school.” Holt Lawrence said, “The police have gone to his house saying they need to protect William and not let him go home for now.”<br/><br/>“And the Butch family?”<br/><br/>“They went to William’s grandma’s house a few times, but since William isn’t there, their visits were pointless. Let them do what they want; they can’t cause much trouble.”<br/><br/>The two reached William’s ward entrance while talking.<br/><br/>They looked through the glass door.<br/><br/>William looked down without speaking.<br/><br/>Daisy Zane looked down for a moment, then gently pushed on his shoulder.<br/><br/>As his body leaned forward, William’s hands instinctively pressed onto the edge of the rooftop, then propped himself up and shrank back.<br/><br/>He reflexively became scared of falling.<br/><br/>When he finally stood firm and took a breather, he realized that Daisy Zane had been holding onto his arm the entire time.<br/><br/>He didn’t know when she had grabbed him.<br/><br/>He looked at Daisy Zane with a slightly startled and puzzled expression.<br/><br/>Daisy Zane was expressionless, like a cold-blooded animal: “If I’d used a little more force just now, you’d already be a corpse.”<br/><br/>William’s face gradually turned pale.<br/><br/>“At this height of thirty floors, do you know how loud the sound would be when you hit the ground? Do you know which part of you would hit the ground first? Do you know what you would look like after the fall? How much blood would you lose?” Daisy Zane said indifferently.<br/><br/>William imagined it as she spoke.<br/><br/>For every sentence she said, he would follow along in his imagination.<br/><br/>“Are you scared?” Daisy Zane asked again.<br/><br/>This time, William didn’t remain silent, but faintly and dazedly said: “Not scared.”<br/><br/>Daisy Zane chuckled softly, the wind blowing her fragmented hair in disarray: “If you’re not afraid of death, then why are you afraid of living? Why are you afraid of those who hit you?”<br/><br/>“Living is more terrifying.”<br/><br/>“Living isn’t terrifying; dying is terrifying.” Daisy Zane said softly, “Death only has one outcome, but life can have countless outcomes.”<br/><br/>William stared at her blankly.<br/><br/>“Do you think that if you die, those who bully you would feel guilty? Regret? Or change their ways?”<br/><br/>William didn’t speak again.<br/><br/>“None of that would happen.” Daisy Zane spoke indifferently, “They might be afraid for a while, but they’d continue to harm others. No one will help you reclaim what you’ve been bullied for, nobody will help you clarify the slander you faced. You’ll gradually disappear from everyone’s memory, and you won’t affect anyone’s life.”<br/><br/>“They, they they’ve been punished.” William said.<br/><br/>“Is it because of your death that they were punished?” Daisy Zane lazily replied, “It’s because you cooperated with the police.”<br/><br/>William’s eyelashes trembled all the while, and his eyebrows gradually furrowed.<br/><br/>“Do you understand?” Daisy Zane asked.<br/><br/>William continued to look bewildered.<br/><br/>Daisy Zane didn’t rush him either. She simply said: “Think about it. Why should you let your life pay for the mistakes of others do they deserve that?”\t\t\t\t\t\t</div>", "images": {}, "success": true}