{"id": 399, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14515303.html", "title": "Chapter 399: 352: Who Is She _2", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 399: 352: Who Is She _2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 399: 352: Who Is She _2<br/><br/>Translator: 549690339<br/><br/>“Ah!” Bonnie Maxwell cried out, trembling with pain all over, her lips shivering as well.<br/><br/>Because James Collins was still twisting her arm, the pain kept increasing, gradually making her unable to speak.<br/><br/>Daisy Zane looked on with cold eyes.<br/><br/>Natalie Wayne stood up and looked at Bonnie Maxwell.<br/><br/>After all, she was a child who had grown up under her care, and it pained her to see Bonnie in such a state. Even though she was furious just now, her heartache was genuine when seeing Bonnie like this.<br/><br/>However, when she was about to speak up for Bonnie, Elina Clark held her hand, patted the back of it to prevent her from speaking.<br/><br/>James released her, and Bonnie Maxwell’s arm immediately hung down, making her hum in pain again.<br/><br/>James squatted in front of her, looking at her, and said with a faint smile, “So, it was these hands that sent the videos to cover up the truth for someone else? Now they can’t do such things anymore.”<br/><br/>Fear spread throughout Bonnie Maxwell’s entire body. Her face was covered in cold sweat, mixed with tears, as she looked at James Collins in terror.<br/><br/>James really had the idea of crippling her hands, but as he reached for them, Daisy Zane stopped him.<br/><br/>“James, that’s enough.” She didn’t want to scare Natalie and the others.<br/><br/>James paused and drew back his hand, “You’re lucky.”<br/><br/>He stood up straight and dragged Bonnie Maxwell up by her good arm, “Let’s go.”<br/><br/>Bonnie Maxwell gritted her teeth and endured the pain. After being forcibly dragged by James for a couple of steps, she suddenly yelled with a hoarse voice, “Daisy Zane, you dare to take me away illegally!”<br/><br/>Diego Giovanni turned his gaze to Bonnie Maxwell and said, “Bonnie Maxwell, right? Someone filed a report saying that you maliciously slandered and defamed others, causing severe damage to the victim’s reputation. Please cooperate with the investigation.”Alll latest novels at novelhall.com<br/><br/>Daisy Zane looked at Diego Giovanni.<br/><br/>She knew that he came specifically for this matter.<br/><br/>Taking a person into custody through formal procedures could save her a lot of trouble.<br/><br/>Upon hearing Diego Giovanni’s words, James led Bonnie Maxwell away.<br/><br/>As they were leaving, Bonnie Maxwell’s pain-filled gaze looked towards Theo Clark, as if trying to say something. But the pain in her arm kept her from speaking as James tightened his grip.<br/><br/>In just a fraction of a second, James had taken her away.<br/><br/>However, everyone was focused on how to clear up the video issue, and didn’t pay much attention to him.<br/><br/>Michael Jackson drove the car, and Daisy Zane kept looking out the window.<br/><br/>Kevin Clark’s cell phone kept vibrating. He took out his phone and checked it while holding Daisy Zane’s hand.<br/><br/>Xavier Dominic was sending messages again.<br/><br/>Xavier Dominic: [What should we do about Brook Sister’s situation? Has anyone come up with a solution? I had someone control the heat of the online news, not letting the news ferment.]<br/><br/>Xavier Dominic: [This is too difficult to deal with. They are just taking advantage of the poor conditions and facilities in Cold Green Village, without any evidence or witnesses, so they dare to spread these rumors.]<br/><br/>Xavier Dominic: [Arthur, Arthur, Arthur. Is there any evidence that can be used from Brook Sister’s side?]<br/><br/>Nobody answered him. A minute later, Xavier sent another message.<br/><br/>[I have always wanted to ask, where is the real Daisy and why did Brook Sister assume Daisy’s identity? Actually can we try to find a solution from the fact that Brook Sister is not Daisy?]<br/><br/>Immediately after this message, someone replied.<br/><br/>William Lane:<br/><br/>Enamel Cannon:<br/><br/>Xavier Dominic: [Damn! You two are here! You didn’t say anything! Let me babble on my own.]<br/><br/>Enamel Cannon: [What do you mean Brook Sister is not Daisy?]<br/><br/>Xavier Dominic: [Yo! We have two big, clueless poor victims here.]<br/><br/>William Lane: [What do you mean?]<br/><br/>Xavier Dominic didn’t bother to figure out what he was asking, and simply said, [You guys take a look at Brook Sister’s layered identities and various skills. Does it look like she grew up in Cold Green Village?]<br/><br/>Again, nobody spoke for a while.<br/><br/>A few minutes later, Enamel Cannon: [So who is she?]<br/><br/>Xavier Dominic: [Err ]<br/><br/>Kevin looked at the four-word message sent by Enamel Cannon, and his eyes darkened.<br/><br/>Yes, who is this little girl?\t\t\t\t\t\t</div>", "images": {}, "success": true}