{"id": 398, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14515302.html", "title": "Chapter 398: 352: Who Is She", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 398: 352: Who Is She</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 398: 352: Who Is She<br/><br/>Translator: 549690339<br/><br/>On their way here, Daisy Zane had asked James Collins to bring people to surround this place.<br/><br/>Because they were not sure if the person here was Clara Mitchell or not, they did not make a big fuss, but secretly arranged someone to surround it.<br/><br/>Not to mention Clara Mitchell, all the people in this tea room, as long as she does not allow it, no one can leave.<br/><br/>Clara Mitchell stared at her with wide eyes: “You dare!”<br/><br/>Daisy Zane lowered her eyes and sent a voice message to James Collins: “James Collins, come upstairs.”<br/><br/>“Daisy Zane, this is the Imperial Capital, who do you think you are? Even if you surround this place, what do you think you can do to me?!”<br/><br/>“She is my wife, Kevin Clark. Not to mention in the Imperial Capital, anywhere, any matter is up to her mood,” said Arthur North softly.<br/><br/>Clara Mitchell looked at Arthur North incredulously: “Third Master you would disregard the relationship between our two families for her sake?”<br/><br/>“It’s Hugo Clark who should care about the relationship, what does it have to do with me?” Arthur North said softly, “The Clark Family doesn’t put money in my pocket every year.”<br/><br/>Hugo Clark:<br/><br/>The rest of the Clark Family: ” ”<br/><br/>Clara Mitchell breathed heavily, looking at Arthur North, and at the man in front of her who had fascinated her for ten or more years. After a long while, she said, “Arthur North, if you want to get rid of the Clark Family, you have to give up their power. Without their power, what will you use to protect Daisy Zane?”<br/><br/>“The Maxwell Family can give it a try, and see what I use to protect her,” Arthur North said coldly.<br/><br/>As the words fell, James Collins pushed open the door of the tea room.<br/><br/>Everyone looked at the entrance.<br/><br/>Those who guarded the door on both sides were all on guard, but since they heard the conversation in the tea room and didn’t hear any orders inside, they didn’t move.<br/><br/>Theo Clark looked at Daisy Zane again.<br/><br/>This girl really gave them too many surprises.<br/><br/>She even knew Diego Giovanni and got him to treat her differently.<br/><br/>“Sister, who should I take away?” James Collins walked over to her, glanced at Clara Mitchell, and then rubbed Charles Amos’ head at his side, “Is it her?”<br/><br/>“Mhm.”<br/><br/>“It’s you, huh.” James Collins walked in front of her, his expression harsh, “It’s a miracle you’re still alive. You slandered Daisy’s reputation and wanted to hurt my Charles. Isn’t it good to be alive?”<br/><br/>“What do you want to do?”<br/><br/>“Of course, make arrangements for your second half of life.” As James Collins said this, he reached out to grab her arm.<br/><br/>But Clara Mitchell dodged in time.<br/><br/>After all, Clara Mitchell grew up in a military district and could be admired by Thomas Firway, so her skills were naturally not bad.<br/><br/>However, James Collins was personally trained by Daisy Zane and could walk the various continents without any worry, so he didn’t take her seriously.<br/><br/>After just a few exchanges, James Collins grabbed her arm. Then, without pity, he kicked her knee.<br/><br/>Clara Mitchell was caught off guard, falling to one knee on the ground.<br/><br/>With a thud, it seemed as if the kneecap could be shattered. Clara Mitchell’s face instantly turned pale, and cold sweat broke out on her body.<br/><br/>Tom Wayne looked on with a tightened heart.<br/><br/>Calvin Stewart, who had never seen such a scene, was also somewhat scared.<br/><br/>Hardy Clark also pulled up Hugo Clark’s sleeve.<br/><br/>However, James Collins hadn’t planned to stop yet. Pressing on Clara Mitchell’s shoulder, he dislocated her arm.\t\t\t\t\t\t</div>", "images": {}, "success": true}