{"id": 396, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14503231.html", "title": "Chapter 396: 351 Nine Gods_2", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 396: 351 Nine Gods_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 396: 351 Nine Gods_2<br/><br/>Translator: 549690339<br/><br/>Could it be every time he was teaching, Charles was just pretending not to understand????<br/><br/>The Clark family was surprised.<br/><br/>Bonnie Maxwell sneered, “Lady Zane, he’s just a child. Mind what you say.”<br/><br/>“According to Celestial Pivot’s internal stats, the toughest can break through to 99%,” Daisy Zane said lightly. “But that remaining one percent will be the insurmountable gap for everyone.”<br/><br/>“The ninety-nine percent is something to strive for,” Charles said. “The remaining one percent is something to strive for.”<br/><br/>Everyone looked at Charles, knowing he was smart.<br/><br/>But they underestimated his power.<br/><br/>Hidden and unassuming, for such a young age.<br/><br/>“So there’s nothing to show off about, nothing to be proud of,” Daisy Zane said.<br/><br/>Veins popped on Bonnie Maxwell’s neck as she struggled to maintain her composure. With tightly clenched teeth, she said, “Lady Zane, the way you are talking makes it sound like you know a lot.”<br/><br/>She squinted at Daisy Zane, waiting for her response, curious to see how she would further comment.<br/><br/>“Just a bit of knowledge.”<br/><br/>Kevin Clark smirked.<br/><br/>Hugo Clark:<br/><br/>Juan Wright: “!!!!!!” Just a bit of knowledge indeed.<br/><br/>“Miss Maxwell, you have a computer.” Daisy Zane looked at her with a mask hiding her anger, “Lend it for a moment.”<br/><br/>Bonnie looked at her and after a few seconds, she finally showed some reaction. She laughed and elevated Daisy Zane, “Sure. Let’s see how Lady Zane cracks the Celestial Pivot’s defense system. I’d like to learn as well.”<br/><br/>Bonnie Maxwell too was watching, as the progress bar passed 59%, 67%, and nudged quickly to 99%.<br/><br/>When Juan Wright saw it hit 99%, his nerves were on edge, nearly frozen, his heart pounding in his throat.<br/><br/>All eyes were set on the screen, the progress bar was now at 100%.<br/><br/>Simultaneously, Bonnie Maxwell’s phone rang.<br/><br/>The Celestial Pivot’s alarm went off<br/><br/>The moment the defense system is breached, not only would the Celestial Pivot skyscraper echo with an alarm sound, all the members of the Celestial Pivot, and anyone with implanted security systems on their phones would receive an alarm.<br/><br/>However, Daisy Zane’s phone stayed silent, because she had just disabled the alarm on her phone while talking with Charles.<br/><br/>Everyone dazedly looked at Daisy Zane.<br/><br/>Even Kevin Clark was stunned for a moment, but he quickly recovered. A smile slowly formed on his face as he looked at Daisy Zane.<br/><br/>Only Charles remained the calmest.<br/><br/>“Was was it breached?” Nathan North asked.<br/><br/>Hugo Clark blinked his eyes back to reality: “Yes.”<br/><br/>Nathan breathed in sharply. That that that’s Celestial Pivot. The independent entity of Celestial Pivot, standing boldly out in Dark Street.<br/><br/>He wondered if Celestial Pivot would retaliate soon, and whether he should redirect some people here.<br/><br/>While everyone was still reeling from shock, Daisy Zane’s phone rang.<br/><br/>She didn’t even have to look to know it would be Holt Lawrence.<br/><br/>Daisy Zane answered the call and put it on speaker.<br/><br/>Holt Lawrence’s voice came through loud and clear, with a backdrop of the sounds of him typing furiously, layered with the sound of the persistent alarms.\t\t\t\t\t\t</div>", "images": {}, "success": true}