{"id": 400, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14522931.html", "title": "Chapter 400: 353: Wanting To Clarify Things As Soon As Possible", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 400: 353: Wanting To Clarify Things As Soon As Possible</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 400: 353: Wanting to Clarify Things as Soon as Possible<br/><br/>Translator: 549690339<br/><br/>It wasn’t far from Santiago Tea House to the Clark Manor, and within twenty minutes they arrived at the Clarks’.<br/><br/>Everyone was silent on the way, and when they entered the Clark Manor, Elina Clark said, “Third Brother’s wife is not a simple one.”<br/><br/>Theo Clark said, “It’s more than just not simple. Ever since I’ve known Diego Giovanni, I’ve never heard him speak so gently to anyone.”<br/><br/>“Diego Giovanni is that him?” Calvin Stewart asked.<br/><br/>“Yes.” Theo Clark said ambiguously and admiringly, “He licks blood off the knife’s edge. His body is full of medals and honors, but he’s never cared about fame and fortune.”<br/><br/>Lily Parker pursed her lips and didn’t ask any further questions.<br/><br/>Whoever could earn her father’s admiration must be a very important person.<br/><br/>“The person Arthur North is interested in can never be ordinary.” Calvin Stewart said.<br/><br/>Elina Clark and Theo Clark both nodded, “This miss has skills that are not inferior to Arthur North’s.”<br/><br/>“Nathan Ninevara of Celestial Pivot.” Theo Clark said, “The one who holds the Celestial Pivot in his hand.”<br/><br/>“But according to this miss, Arthur North has been searching for her all over the world and wants to cut off her hand.” Elina Clark said, “What is Arthur North up to?”<br/><br/>As soon as these words were spoken, everyone looked at Hugo Clark together.<br/><br/>Hugo Clark was still thinking about the fact that Daisy Zane wasn’t Daisy Zane.<br/><br/>Suddenly so many people looked at him, and he paused before saying, “I don’t know either.”<br/><br/>“You guys just conspire to deceive us.” Elina Clark snorted.<br/><br/>Natalie Wayne, who had not been speaking, and stepped into the front hall, asked, “What’s going to happen to Bonnie Maxwell?”<br/><br/>Everyone looked at each other and didn’t speak for a moment.<br/><br/>Natalie Wayne looked at them, realizing what was going on but still asked, “Is there no way out?”<br/><br/>“When Daisy revealed her identity as Nathan Ninevara, Bonnie Maxwell had no way to retreat.” Theo Clark said, “The fact that we know but are unharmed is thanks to Arthur North’s influence. Or perhaps it’s that Daisy trusts Arthur North’s family very much.”<br/><br/>If the news that Nathan Ninevara is Daisy Zane gets out, how many people would swarm into the country? Those who want simply to see her, those who want to challenge her, those who want to subdue her, and even those who want to assassinate her.<br/><br/>“Does she dare to go against the Clark family?” Calvin Stewart asked.<br/><br/>“I always feel that her power is even greater than that.” Theo Clark said.<br/><br/>Calvin Stewart slightly furrowed his brow.<br/><br/>Natalie Wayne sighed softly and sat down on a chair.<br/><br/>Elina Clark sat next to her and comforted her, “It’s her own fault.”<br/><br/>From his perspective as a man, if someone bullied Natalie Wayne like that, his approach would not have been any less drastic than Arthur North’s today.<br/><br/>The only difference would be<br/><br/>Kevin Clark narrowed his eyes slightly: “What kind of medicine?”<br/><br/>“A drug that can cause sudden heart failure if taken in small doses over time.” Daisy Zane looked at Kevin Clark, “It’s hard to detect and looks like a sudden illness.”<br/><br/>Kevin Clark understood: “I’ll have a doctor go take a look.”<br/><br/>“Find an excuse so as not to arouse suspicion,” Daisy Zane said.<br/><br/>“Mhm.” Kevin Clark immediately made a phone call.<br/><br/>Spreading rumors without evidence would always make people worry that the truth might be exposed.<br/><br/>They probably wouldn’t keep this man.<br/><br/>So both Kevin Clark and Daisy Zane confirmed the man’s whereabouts in the shortest time and sent someone to find him.<br/><br/>Bonnie Maxwell and Amelia Miles weren’t afraid to take action at this critical moment.<br/><br/>Because once something happened to this man, the first person everyone would suspect would be Daisy Zane.<br/><br/>And then, there would be no one left to confront.<br/><br/>There would be no chance to clear things up.<br/><br/>Before Kevin Clark’s phone call was over, Allonzo Hobson and Robinson Scott arrived.<br/><br/>After the two arrived, Robinson Scott first unilaterally scolded Allonzo Hobson a few times, and then sat down on the edge of the sofa with a look of disgust.<br/><br/>Then Allonzo Hobson sat on the nearest single sofa to her.<br/><br/>Robinson Scott’s eyes widened instantly.<br/><br/>Just as she was about to speak, Daisy Zane clicked her cell phone onto the tea table with a soft sound.<br/><br/>Robinson Scott swallowed the words she was about to say and turned to ask, “Olivia, have you thought of a countermeasure?”<br/><br/>“Brook Sister, my suggestion is to wait a few days.” Allonzo Hobson said, “The news has just come out, and the public’s mind is filled with sudden emotions, lacking rationality. No matter what we say now, people won’t listen.”<br/><br/>Daisy Zane, who was always used to dealing with online news calmly, of course, knew this.<br/><br/>But<br/><br/>“I can’t stand the news being online for too long.” Daisy Zane said, “I want to hold a press conference tonight.”<br/><br/>Allonzo Hobson was stunned and looked at Kevin Clark.<br/><br/>Kevin Clark lowered his eyes and didn’t say anything. It seemed that he was weighing the pros and cons of this matter.<br/><br/>Allonzo Hobson understood that Third Master Clark had no say in this. Whatever Madam wanted to do, he would do.<br/><br/>“Olivia, do you have evidence?” Although Robinson Scott was asking, she was sure that Daisy Zane could handle it.<br/><br/>After all, in her eyes, there was nothing Daisy Zane could not do.<br/><br/>“Some.” Daisy Zane recalled some things, found some useful evidence, “But it might arouse suspicion about my identity.” for new novels\t\t\t\t\t\t</div>", "images": {}, "success": true}