{"id": 407, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14530094.html", "title": "Chapter 407 - 359: The Truth About Black Ryan Easton", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 407 - 359: The Truth About Black Ryan Easton</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 407: Chapter 359: The Truth About Black Ryan Easton<br/><br/>Translator: 549690339<br/><br/>In the morning around 8 o’clock, Daisy Zane’s cell phone rang twice, her eyelashes fluttered slightly, but she did not wake up.<br/><br/>Kevin Clark had been awake for a while, but he didn’t want to disturb her sleep, so he remained still.<br/><br/>Seeing her eyelashes move, Kevin Clark kissed her face gently.<br/><br/>“What time is it?” After a while, Daisy Zane asked with her eyes still closed.<br/><br/>Kevin Clark held her hand, smoothing her hair gently, “It’s past eight o’clock, sleep a bit more.”<br/><br/>Daisy Zane was silent for another while. When Kevin Clark thought she was asleep again, she spoke, “Free this morning?”<br/><br/>“Hmm.” Kevin Clark kissed her lips again, “What do you want to do?”<br/><br/>“I need to meet your parents at Clark Manor.”<br/><br/>Kevin Clark was taken aback, but then laughed, “No rush, we have plenty of time for that. Sleep a bit more.”<br/><br/>“I’m awake.” Daisy Zane’s voice still sounded foggy. “Time to pay a visit.”<br/><br/>“Let’s sleep a bit more, no rush.” Kevin Clark responded.<br/><br/>“Hmm.”<br/><br/>Daisy Zane closed her eyes and went back to sleep.<br/><br/>Over ten o’clock, Kevin Clark drove Daisy Zane and Charles Amos to Celestial Pivot.<br/><br/>The two entered through the back door, not staying for long.<br/><br/>Daisy Zane came to get some things.<br/><br/>She had asked Holt Lawrence to fetch a few things from her warehouse yesterday. She wanted to give them to Kevin Clark’s parents and his elder brother’s family.<br/><br/>She had two warehouses in Celestial Pivot.<br/><br/>One was for storing some beautiful “stones” and other miscellaneous antiques, paintings, and such.<br/><br/>Some were gifts, some were sourced by Robinson Scott from his dad and others were collected by Robinson Scott from all over.<br/><br/>The warehouse was stocked to the brim Daisy Zane wasn’t quite sure what else was inside.<br/><br/>The other warehouse was used solely for storing hairpins.<br/><br/>All sorts of precious hairpins.<br/><br/>From ancient times to the present anywhere with beautiful, valuable hairpins, she would have them stored in this warehouse.<br/><br/>Every single hairpin here was priceless.<br/><br/>But before she met Kevin Clark, Daisy Zane only ever used plastic hairpins that cost 9,93 USD each.<br/><br/>“I originally planned to paralyze Jose Easton, and then expose my location.” Daisy said, “You would send people to catch me, inevitably causing a conflict with Edward Kirsten’s people, allowing me to escape in the ensuing chaos.”<br/><br/>The mention of Edward Kirsten made Charles Amos shrink back immediately.<br/><br/>Kevin Clark hadn’t expected this.<br/><br/>He gripped the steering wheel tightly, and it took him a while to ask, “So why did you stop?”<br/><br/>“I found out what Jose Easton was researching secretly.” Daisy casually replied while fiddling with her phone, “I didn’t want to get you involved.”<br/><br/>While threatened by Edward Kirsten, she learned about Kevin Clark’s actions.<br/><br/>The sharp contrast made her respect the name ‘Kevin Clark’ deeply.<br/><br/>So she immediately backed out, not wanting to implicate him.<br/><br/>Kevin Clark slowed the car, his mind playing those sentences over and over.<br/><br/>He had the chance of meeting the little girl earlier.<br/><br/>Although he couldn’t avoid the incident with Edward Kirsten, he could have avoided the one in Cold Green Village.<br/><br/>Moreover, Edward Kirsten had always been kind to her.<br/><br/>If Jose Easton had gone to Continent A at that time.<br/><br/>If he happened to meet the little girl who was plotting to escape in the confusion.<br/><br/>Would that not have spared her from the hardships that followed?<br/><br/>“And then?” Kevin asked.<br/><br/>“I borrowed Gael Easton’s power.” Daisy said, “I hacked ten of Gael Easton’s base locations, which kept him on edge. He then went to Continent A to catch me.”<br/><br/>Daisy had always felt as though she owed Gael Easton a debt because of this. Even knowing the complications surrounding Gael Easton’s background, she didn’t sever ties with him.<br/><br/>She would be willing to be used by Gael Easton, if the need arose.<br/><br/>Kevin Clark’s heartache had mutated into feeling stifled.<br/><br/>“Gael mentioned that someone on Continent A revealed that I am the hacker.” Daisy said, “When I met Gael on Continent M, he recognized me instantly.”<br/><br/>Gael let her off the hook because he found her attractive.<br/><br/>“Who disclosed it?” Kevin asked.<br/><br/>“According to Gael, it was likely Alice Eugene. The woman we fought in Red Cliff Village. We were always at odds.”<br/><br/>Kevin Clark understood.<br/><br/>He remained silent for a while, then regretfully said, “We could have met earlier.”<br/><br/>Daisy Zane looked at him, then blandly replied, “Met for what? To tempt me into having a premature romance?”<br/><br/>Kevin Clark:<br/><br/>Daisy Zane smirked, then Kevin Clark spoke, “Experiencing the joy of growth, raising my wife, seems to be a good idea.”<br/><br/>Daisy Zane:\t\t\t\t\t\t</div>", "images": {}, "success": true}