{"id": 403, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14522934.html", "title": "Chapter 403 - 355: Press Conference (2)", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 403 - 355: Press Conference (2)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 403: Chapter 355: Press Conference (2)<br/><br/>Translator: 549690339<br/><br/>“The man in the video is named Jeremy Wheeler. According to his ID, he is a villager of Cold Green Village. How could Lady Zane not recognize him?”<br/><br/>“Lady Zane said she didn’t do those things. Then why would Jeremy Wheeler say such things?”<br/><br/>“And he even spoke vividly, even describing the structure of your house very clearly.”<br/><br/>“Living in the same village, how could the villagers not recognize each other? Lady Zane’s denial is so thorough, is she trying to cover up the truth?”<br/><br/>After Daisy Zane finished speaking, all the reporters immediately began asking questions one after another, not giving her a chance to catch her breath.<br/><br/>Daisy Zane looked at the reporters under the stage, who were like boiling water, before she paused and tapped her cellphone on the microphone.<br/><br/>In an instant, a piercing electric sound filled the conference hall, and everyone subconsciously covered their ears, making the reporters quiet down.<br/><br/>Daisy Zane glanced under the stage, leaned back in her chair, and slowly scrolled through her phone before connecting it to the projector.<br/><br/>Then she played the video of the man from Cold Green Village.<br/><br/>It was a clip that focused on the man’s description of the details of Daisy Zane’s residence in the village.<br/><br/>“Lucia, the dressing table in your room, I sold a year’s worth of rice and skimped and saved to buy it for you from the town.”<br/><br/>“And the cabinet beside the bed for your books, you said you liked it, so I spent two months making it for you.”<br/><br/>“You mentioned that you liked the clock that the family who went out to work brought back to the village. So I went to the town to work for two months just so I could buy one for you.”<br/><br/>“But when I came back, you were in the kitchen with another man You lied and said he was just there to borrow something. Who would believe that? But I chose to believe it because I liked you so much, I forced myself to believe it.”<br/><br/>Perhaps to verify the authenticity of the man’s words, the living quarters in Cold Green Village were described in detail.<br/><br/>So after the video was released, some people drew pictures of Daisy Zane’s residence in Cold Green Village and the interior furnishings online.<br/><br/>Daisy Zane downloaded a few drawings from the internet and projected them onto the screen behind her.<br/><br/>She said, “These are renderings of the living quarters in Cold Green Village found online. These drawings are similar, and they seem to match the description given by this man in the video.”<br/><br/>All the media reporters remained silent, not knowing what she was trying to accomplish with this information.<br/><br/>Even the people watching the live stream were saying that Daisy Zane might have been mentally disturbed.<br/><br/>Daisy Zane picked one of the images: “This one is the closest and has the highest degree of restoration.”<br/><br/>“Who told you?” Daisy Zane leisurely sat in her seat and asked.<br/><br/>The man immediately changed his story: “I saw it on the internet, so I came over.”<br/><br/>“You seem very well-informed,” Daisy Zane replied, “What are you here for?”<br/><br/>“I missed you so much, I wanted to see you. Lucia, how could you forget me after all I have done for you?”<br/><br/>“It seems that you care about me deeply,” Daisy Zane said indifferently, “When did we get together then? I’m sure you remember it very clearly.”<br/><br/>“Six years ago, in July,” the man said, “Of course, I will remember, and I will remember it very clearly.”<br/><br/>Six years ago, Daisy Zane was twenty years old and already an adult.<br/><br/>Not too naive<br/><br/>Throughout the live stream, the comments in the barrage were almost overwhelmingly one-sided.<br/><br/>[Gosh, this man must be at least over 50 years old. How could Daisy Zane even stand him?]<br/><br/>[It brought her some benefits, right? Women like this, for their own sake, will do anything.]<br/><br/>[Who knows how she got those resources? Might as well say she just replaced someone else’s name with Flynn.]<br/><br/>[This woman is married now! It’s a shame for her husband. Who knows how many people she’s been with before? He completely picked up a worn-out shoe.]<br/><br/>[This man looks even older than in the video! My goodness.]<br/><br/>[This man is quite pitiful too. His living conditions were already poor, but he still gave everything he could to Daisy Zane. In the end, he couldn’t keep anything. He lost his child and his wife ran away.]<br/><br/>[Can’t say Daisy Zane isn’t ruthless.]<br/><br/>The live stream barrage was moving too fast for fans to help speak up before they were quickly drowned out by other comments.<br/><br/>Listening to the man, Daisy Zane raised the corners of her lips.<br/><br/>Instead of saying anything, she lowered her head and searched her phone for a screenshot of the surveillance footage and projected it onto the screen.<br/><br/>The date in the top left corner was clear, showing that the footage was from the previous month.<br/><br/>The still image showed the living quarters in Cold Green Village.<br/><br/>Daisy Zane said, “This is the current condition and furnishings in the living quarters in Cold Green Village. The date is visible for everyone to see on the screen. All the furnishings inside are exactly the same as what this man named Jeremy Wheeler described.”<br/><br/>It was evident that the image had been captured by a CCTV camera, so everyone stared in amazement at the footage, and the media resumed their barrage of photos.<br/><br/>Daisy Zane looked at the reporter who had just asked the question and then turned her gaze to the live stream camera lens. Her phoenix eyes were filled with coldness and an intense, chilling air. She said unhurriedly, “Of course, I have evidence. Otherwise, why would I hold a press conference?”\t\t\t\t\t\t</div>", "images": {}, "success": true}