{"id": 401, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14522932.html", "title": "Chapter 401: 354: Press Conference (1)", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 401: 354: Press Conference (1)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 401: 354: Press Conference (1)<br/><br/>Translator: 549690339<br/><br/>Daisy Zane announced an press conference around six in the afternoon, and by six-thirty, Allonzo Hobson had contacted the major media outlets to spread the news.<br/><br/>So, the first thing Hill Dawson saw after getting off the airplane was this news.<br/><br/>She almost fainted at the airport.<br/><br/>She came to discuss a solution, but now the press conference was already being set up.<br/><br/>Could she really say goodbye to being an agent?<br/><br/>She truly felt useless.<br/><br/>The conference was scheduled for 8 o’clock. As soon as the news broke, it immediately shot to the top of the trending topics.<br/><br/>After Amelia Miles saw the news, she immediately tried to get in touch with Bonnie Maxwell but couldn’t get through no matter how many times she called.<br/><br/>She was really afraid of Daisy Zane’s power. In the past, Daisy could always track her down. Especially in the parking lot incident, Daisy had almost strangled her to death.<br/><br/>Amelia still felt lingering fears even now.<br/><br/>And she suddenly couldn’t get in touch with Bonnie.<br/><br/>With a restless heart, Amelia paced back and forth in the living room, feeling her heartbeat quicken with each step.<br/><br/>At seven o’clock, she called Bonnie again but still got no answer.<br/><br/>But no one came looking for her either.<br/><br/>So, in the midst of extreme anxiety, Amelia forced herself to calm down.<br/><br/>After all, Bonnie was part of the Celestial Pivot and had taken action within the organization.<br/><br/>Even the most formidable hacker would be no match for the Celestial Pivot.<br/><br/>Otherwise, the Celestial Pivot would have fallen by now.<br/><br/>As she thought about this, Amelia’s thumping heartbeat gradually stabilized.<br/><br/>“Daisy!”<br/><br/>“Catherine!!”<br/><br/>“Daisy!!”<br/><br/>Those who knew it was a rally for a single person, and those who didn’t, thought the fans from both sides were fighting.<br/><br/>Three cars were parked across the street. Daisy Zane watched the fans at the entrance and listened to their chants.<br/><br/>Harton Clark said, “The test results are in, there are indeed traces of drugs in the man’s blood.”<br/><br/>Harton Clark’s men had disguised themselves as Amelia’s people, telling the man that he needed a medical check for a residence permit. Even temporary residents needed to apply for one.<br/><br/>The man didn’t suspect anything and immediately cooperated with the doctor during the examination, having his blood drawn.<br/><br/>Afterward, when the doctor left and reported back to Harton Clark, he even added in a message that it was unfortunate that people without education and living in harsh conditions could be so easily deceived.<br/><br/>“Is it serious?” Daisy Zane asked.<br/><br/>“It’s not life-threatening for now.”<br/><br/>Daisy Zane didn’t dwell on this issue too much. As long as it didn’t hinder her clarification efforts, she wasn’t bothered about the rest.<br/><br/>“Where are they now?”<br/><br/>Harton Clark sent a message and a few seconds later said, “Ten minutes.”<br/><br/>Daisy Zane nodded slightly as she listened to the fans outside.<br/><br/>Originally, Harton Clark’s men planned to continue posing as Amelia’s people and bring the man from Cold Green Village to the press conference.<br/><br/>Daisy wanted to confront him face to face.<br/><br/>But after Holt Lawrence secretly listened in on Amelia’s phone call and informed Daisy, Harton Clark didn’t let his men take action.<br/><br/>They just kept following them.<br/><br/>“Michael Jackson, go buy some drinks and throat protection for those people outside later,” Daisy Zane said.<br/><br/>Michael Jackson, who was seated in the driver’s seat, looked in the direction of Daisy’s gaze and understood whom she was referring to: “Alright.”\t\t\t\t\t\t</div>", "images": {}, "success": true}