{"id": 402, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14522933.html", "title": "Chapter 402 - 354: Press Conference (1)_2", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 402 - 354: Press Conference (1)_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 402: Chapter 354: Press Conference (1)_2<br/><br/>Translator: 549690339<br/><br/>“Let’s go to the entrance.” Daisy Zane said.<br/><br/>Arthur North paused for a moment, Juan Wright also saw the back: “Teacher, there are media outside and it’s very likely that someone will attack the person while causing chaos.”<br/><br/>Both of them looked at Kevin Clark.<br/><br/>Kevin Clark also hesitated for a moment, but soon said: “Block the media and fans, and prevent anyone from mixing in.”<br/><br/>“Yes.” Juan Wright immediately arranged it over the phone.<br/><br/>Early on, their people were stationed outside the hotel.<br/><br/>Kevin Clark: “I’ll go with you.”<br/><br/>“You all go through the back door.”<br/><br/>But this time Kevin Clark didn’t listen to her, instead, he firmly said, “I’ll go with you.”<br/><br/>Seeing that he couldn’t be persuaded, Daisy Zane handed him a mask from the car: “Put it on.”<br/><br/>Kevin Clark took the mask, reluctantly said, “Ah — I ”<br/><br/>“Stop it.” Daisy Zane blocked his words directly.<br/><br/>Kevin Clark’s statement “I look so good that I can’t be hidden” suddenly got stuck in his mouth. It choked him for a moment.<br/><br/>Arthur North held back his laughter, and Juan Wright couldn’t help but laugh out loud.<br/><br/>Then he received a glare from Kevin Clark: “Juan Wright, you’re going to M Continent tomorrow.”<br/><br/>“Third Master, Third Master, I was wrong. I won’t laugh anymore, I won’t.” Juan Wright immediately backed down, his teacher was Nathan Ninevara, he hasn’t shown off yet, he hasn’t had a chance to ask for advice, he wouldn’t leave, “If I laugh again, Arthur North won’t find a wife.”<br/><br/>Arthur North: ” Get out.”<br/><br/>Daisy Zane chuckled softly.<br/><br/>Kevin Clark breathed a sigh of relief and finally laughed.<br/><br/>Allonzo Hobson and Robinson Scott drove the car directly to the back door.<br/><br/>Hill Dawson and Anisa Cooper escorted Daisy Zane from the front door together with Kevin Clark.<br/><br/>Today, Daisy Zane wore a deep green long dress, her tall figure and aura fully displayed.<br/><br/>The moment she got out of the car, the fans’ shouts became even louder, like a wave of heat hitting their faces.<br/><br/>However, as soon as Kevin Clark got out of the car and stood beside Daisy Zane, the fans’ voices suddenly quieted down in unison.<br/><br/>It could be described as silent as a grave.<br/><br/>Kevin Clark was only wearing a black shirt, and the cuffs matched the color of Daisy Zane’s dress.<br/><br/>He stood still, glanced around, then looked down, watching Daisy Zane with his peripheral vision.<br/><br/>The press conference venue had a long table set up.<br/><br/>At Sharp 8 o’clock, Daisy Zane went on stage, stood in front of the table, and tested the microphone.<br/><br/>However, as soon as she finished testing the microphone, reporters from the media began asking questions below the stage.<br/><br/>Those who entered the venue were reporters from major media outlets.<br/><br/>Originally, the various media organizations received notices, thinking that they would receive the questions arranged by Daisy Zane’s team.<br/><br/>Moreover, it was Allonzo Hobson’s assistant who informed them, so they had to give Allonzo Hobson some face.<br/><br/>But they had been waiting until 8 o’clock, and hadn’t received anything.<br/><br/>So, the various media informed their reporters to watch each other and see how other media would ask questions.<br/><br/>In any case, they couldn’t lose their headline news.<br/><br/>As it turned out, one media outlet couldn’t hold back and asked outright, “Lady Zane, is it true that you had an abortion for that man?”<br/><br/>Then, the media started asking more and more tricky questions.<br/><br/>And as if afraid that other media would steal their questions, they all tried to be the first to ask.<br/><br/>As a result, the scene became chaotic for a while.<br/><br/>However, Daisy Zane didn’t bother with them, but instead sat down calmly, straightened her dress, adjusted the microphone, and then finally said, “Everyone please quiet down.”<br/><br/>Everyone quieted down.<br/><br/>Daisy Zane scanned the scene and said: “I heard a few of your smoky questions. Some of them if they were a bit more offensive, I would have called the police directly.”<br/><br/>Allonzo Hobson, listening backstage, laughed softly: “Brook Sister is just Brook Sister, she’s confronting the media right off the bat.”<br/><br/>“My Brother Nine has already shown restraint.” Robinson Scott said, “If it were before, this place would have been turned upside down.”<br/><br/>“Daisy, Daisy, did you use to bowl?” Anisa Cooper suddenly asked softly.<br/><br/>Except for Kevin Clark, everyone looked at Anisa Cooper.<br/><br/>Anisa Cooper’s eyes were still red from crying at the entrance earlier, seeing that everyone was looking at her, she blinked her eyes: “What’s wrong?”<br/><br/>Allonzo Hobson laughed for a moment without saying anything.<br/><br/>Robinson Scott looked at her with a speechless expression, and after a while said: “Sister, you’re so adorable. And your train of thought is so cute too.”<br/><br/>Anisa Cooper pursed her lips and said nothing, her red eyes looking pitiful.<br/><br/>Robinson Scott looked at her for a moment, then laughed: “Eat more, so that when your Daisy throws you like a ball, you can knock down more.”<br/><br/>Hill Dawson also laughed.<br/><br/>Anisa Cooper:<br/><br/>Only Kevin Clark kept his eyes on Daisy Zane.<br/><br/>Daisy Zane looked at the media below the stage and said, “To save time, I’ll answer all your questions at once. I’ve never seen or known the man in the video, and I haven’t done any of the things he said.”\t\t\t\t\t\t</div>", "images": {}, "success": true}