{"id": 409, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14540527.html", "title": "Chapter 409 - 361: Are You Feeling Heartache For Me?", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 409 - 361: Are You Feeling Heartache For Me?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 409: Chapter 361: Are you feeling heartache for me?<br/><br/>Translator: 549690339<br/><br/>In the afternoon, Natalie Wayne and Calvin Stewart took Daisy Zane on a tour of many places in Clark Manor.<br/><br/>Herbal Pharmacy, Rehearsal Room, Stage<br/><br/>And some the flowers and plants that Natalie took care of.<br/><br/>Throughout the courtyard, one could almost feel the consideration and affection Elina Clark had for Natalie Wayne everywhere.<br/><br/>Kevin Clark found his way from his courtyard, but then was sent away after just two sentences by his mother.<br/><br/>He saw Daisy getting along well with them so he went back to deal with some matters.<br/><br/>In the evening, after dinner, the family sat and chatted in the living room for a while.<br/><br/>But half an hour later, the housekeeper said the Maxwell family had arrived.<br/><br/>Everyone turned their eyes to Kevin Clark.<br/><br/>Kevin Clark raised an eyebrow: “Why are you looking at me? They are here to visit you all.”<br/><br/>Elina Clark glared at him.<br/><br/>Look, this rebellious child. He’s putting his parents in front of him when there is trouble.<br/><br/>Theo Clark said, “They probably know you are in Clark Manor.”<br/><br/>Kevin Clark looked at Daisy Zane and then patted Charles Amos on the head: “Charles is sleepy, we have to sleep now.”<br/><br/>Daisy Zane:<br/><br/>Hugo Clark glanced at the clock. It was not even 8 o’clock yet.<br/><br/>Charles Amos looked up at him: “Am I sleepy?”<br/><br/>Kevin Clark: “You are sleepy.”<br/><br/>“Oh.”<br/><br/>Elina Clark:<br/><br/>Kevin Clark smiled and stood up, holding Daisy’s hand: “Mom and Dad. Big Brother and Sister-in-law, we’re going to rest.”<br/><br/>No one paid attention to him.<br/><br/>Kevin Clark led Daisy Zane outside and said to Charles Amos: “Follow us.”<br/><br/>Charles Amos: Doesn’t he even get the treatment of holding hands?<br/><br/>“Grandpa and Grandma, Uncle, Aunt. Brother, Sister. I’m going to sleep.” Charles Amos finished and trotted to catch up with them.<br/><br/>Kevin Clark was holding a lantern for illumination.<br/><br/>Charles Amos followed behind them, holding a small lantern.<br/><br/>Charles Amos was growing fast, taller, and his facial features were gradually unfolding.<br/><br/>Daisy Zane suddenly noticed that he seemed to resemble Kevin Clark.<br/><br/>She never thought he looked like Kevin Clark when Hill Dawson and Anisa Cooper said so. But now, she didn’t know if it was because she had spent more time with Kevin Clark.<br/><br/>It just felt a bit like him.<br/><br/>After returning from Charles Amos’s room, Daisy Zane went to take a shower.<br/><br/>After the shower, she put on her sleeping robe and went out. Just as she opened the door, she saw Kevin Clark, who had also just returned to his room.<br/><br/>Kevin Clark stopped in his tracks, and his eyes unconsciously looked down at her silk red sleeping robe before looking at her half-wet hair.<br/><br/>Daisy Zane looked at him, paused for a moment, and said, “Are you done with your work?”<br/><br/>“Yeah. I brought you ”<br/><br/>“How about trying the bathroom tonight?” Daisy Zane leaned against the door frame and raised an eyebrow.<br/><br/>Kevin Clark’s eyes visibly widened a little, and he seemed taken aback. The words “I’ll dry your hair” got stuck in his throat.<br/><br/>Daisy Zane especially enjoyed seeing the usually calm and composed Third Master Clark show expressions of surprise and astonishment.<br/><br/>She smiled happily, straightened up, and walked towards the bedroom.<br/><br/>However, as soon as she stepped out, Kevin Clark swept her into the bathroom like a gust of wind and kicked the door closed<br/><br/>Two layers of bath towels were spread on the washbasin, and Daisy Zane was lifted from under the shower to the washbasin.<br/><br/>The red sleeping robe on her body was already damp, clinging to her body, revealing her figure. The wet red color and fair skin created a strong visual contrast.<br/><br/>Kevin Clark initially wanted to help her take it off, but Daisy didn’t let him. Worried about her catching a cold, he turned up the temperature in the bathroom.<br/><br/>Daisy Zane’s forehead was leaning against his shoulder, and the corners of her mouth couldn’t help but let out some whimpers.<br/><br/>The heavy breathing of Kevin Clark brushed against her ear, and he whispered, “What did my mom say to you this afternoon?”<br/><br/>Daisy Zane bit her lip and didn’t say a word.<br/><br/>Kevin Clark guessed what his mother might have said to her. He kissed her ear and couldn’t help but hold her tighter, saying softly, “Do you feel bad for me?”<br/><br/>Daisy Zane still didn’t speak, but with Kevin Clark’s movement, she let out a soft hum.<br/><br/>Kevin Clark chuckled softly, then held her face with one hand, made her raise her head, and kissed her<br/><br/>When the kiss was over, tears filled Daisy Zane’s eyes as she opened them.<br/><br/>Sexy and enchanting, yet heartbreaking.<br/><br/>Kevin Clark swallowed and took a deep breath, smiling, “Why are you crying? Does it hurt?”<br/><br/>Daisy Zane ignored him.<br/><br/>“If it’s not pain, then it’s ”<br/><br/>“Can you shut up?” Daisy Zane said.<br/><br/>“Alright.” Kevin Clark replied, and then kissed her again.\t\t\t\t\t\t</div>", "images": {}, "success": true}