{"id": 405, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14525177.html", "title": "Chapter 405 - 357: They Are The Ones Who Should Cry", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 405 - 357: They Are The Ones Who Should Cry</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 405: Chapter 357: They Are the Ones Who Should Cry <br/><br/>Translator: 549690339 <br/><br/>All the media in the venue turned their attention to the entrance. The live broadcasting equipment also turned towards the entrance. <br/><br/>The man standing at the entrance, who wanted to run but couldn’t, was one of the men in the surveillance video rummaging through things and taking photos. <br/><br/>The audience was in an uproar. <br/><br/>Daisy Zane said, “You brought him here. And now what? You want to ditch him and run because you’ve been exposed?” <br/><br/>“I don’t understand what you’re talking about. I want to leave because I have matters to attend to, and you won’t let me go. What, do you dare to restrict personal freedom?” The man shouted at the entrance. <br/><br/>Daisy Zane looked at him without speaking. <br/><br/>Meanwhile, Kevin Clark suddenly went on stage with a bottle of water. <br/><br/>Daisy Zane tilted her head. <br/><br/>Kevin Clark, still wearing his mask, glanced at Jeremy Wheeler first, then unscrewed the water bottle and placed it next to Daisy Zane: “Drink some water, moisten your throat.” <br/><br/>His voice wasn’t loud, but it spread through the hall through the microphone. <br/><br/>Those who had been looking at the entrance turned their heads back again. <br/><br/>Everyone stared at the man for a moment, then immediately started taking photos. <br/><br/>Allonzo Hobson: <br/><br/>Robinson Scott rolled his eyes: ” ..He Is it necessary for him to show off like this?” <br/><br/>“Perhaps.” <br/><br/>Robinson Scott: He really couldn’t find the words to say. <br/><br/>At this moment, the man at the entrance wanted to run again and seemed to have made up his mind to confront the people at the door. <br/><br/>However, the bodyguard at the entrance sensed his intention, and directly held his hand, not giving him any chance to resist, and brought him onto the stage. <br/><br/>It seemed like the bodyguard was only grabbing his arm, but the man couldn’t fight back at all. <br/><br/>Daisy Zane looked at Kevin Clark: “Aren’t you going down?” <br/><br/>“Can I not go down?” Kevin Clark asked with a smile. <br/><br/>The live barrage was filled with question marks. <br/><br/>Thinking she was calling the police, Jeremy’s legs went weak, and he almost fell to the ground, his vision grew dark: “Don’t call the police, don’t call the police. I’ll tell you, someone sent me. Someone approached me in Cold Green Village. They didn’t just find me, they found many people in the village, but only I agreed.” <br/><br/>Kevin Clark smirked backstage. <br/><br/>The little girl knew that Jeremy’s psychological defenses would easily be broken. <br/><br/>What she wanted was for Jeremy to admit it himself. <br/><br/>When the man next to Jeremy heard his confession, he closed his eyes and cursed silently. <br/><br/>“They said they’d give me a lot of money, let me live in a small city, and have a worry-free second half of life.” Jeremy said, squatting on the ground, his rough hands constantly rubbing his hair, “I came here with them. But after arriving, I felt both fearful and guilty.” <br/><br/>Daisy Zane watched him. <br/><br/>“You and your grandma lived on the mountain for many years, and the village chief wouldn’t allow anyone to disturb you. You always covered yourself so well when you went out. The villagers had never seen your face, and naturally, I couldn’t have either.” Jeremy’s accent became thick with emotion, “I feel guilty for framing you for no reason, so I backed out.” <br/><br/>The scene turned into whispers, and the live stream barrage, especially Daisy Zane’s fans, had gone berserk. <br/><br/>“But they locked me up and wouldn’t let me go. They kept persuading me that the situation would never be exposed and that I should be at ease. They even doubled the money they promised me. I was blinded by the money, I’m sorry, I’m sorry.” <br/><br/>Daisy Zane’s expression remained unchanged. Just a few seconds after he finished speaking, she said, “I called the police before the press conference. If you do something wrong, you should be punished.” <br/><br/>A grown man, he squatted on the ground, hugging his head and crying. <br/><br/>Immediately, the door to the press conference opened, and the police walked in from the entrance. <br/><br/>It was the people sent by Diego Giovanni. <br/><br/>If it weren’t for the large number of media present, Diego Giovanni would have wanted to come personally. <br/><br/>The police showed their badges to the media, said a few words asking for their cooperation during the investigation, and took the two men away. <br/><br/>Calling the police during a press conference and seeing it through to the end was a first for Daisy Zane. <br/><br/>After the people left, the scene quieted down. <br/><br/>Daisy Zane walked to the microphone, adjusted it, and said to the live-streaming camera, “All the original evidence has been handed over to the police. I will cooperate with the investigation afterwards.” <br/><br/>Reporters still had questions, but seeing Daisy Zane’s expression, their lips moved without daring to speak. <br/><br/>Daisy Zane continued, “By now, it should have been three years ago. Some changes took place in the Cold Green Village residence. As a result, the vases, chairs, and two table lamps were all broken. That’s why we have the current room. You’ve seen it, there are fewer things. That’s why I installed surveillance in Cold Green Village.” <br/><br/>Allonzo Hobson let out a sigh of relief backstage, “Good thing we installed that surveillance, or there’d really be trouble now.” <br/><br/>Hill Dawson exclaimed, “Some things really seem like they’re arranged by fate. The video from years ago, the surveillance now.” <br/><br/>Pausing for a moment, Daisy Zane looked at the live-streaming camera and raised the corner of her mouth defiantly, “I want to say something to the fans ” <br/><br/>“As I said, the ones who should be crying are them.”\t\t\t\t\t\t</div>", "images": {}, "success": true}