{"id": 406, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14530093.html", "title": "Chapter 406 - 358: They Have All Grown Up", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 406 - 358: They Have All Grown Up</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 406: Chapter 358: They Have All Grown Up<br/><br/>Translator: 549690339<br/><br/>“The press conference is almost over, Lorenzo. We should hurry to the hotel entrance,” said the Old Master.<br/><br/>The Old Master threw his tablet onto the table and got up to leave.<br/><br/>Johanes Miles picked up the tablet and followed him, “Dad, slow down.”<br/><br/>“Hurry up, or we might miss them.”<br/><br/>“Dad, we don’t know if they’re leaving from the front or back door.”<br/><br/>Before he could finish his sentence, a man suddenly appeared at the entrance, blocking their path.<br/><br/>The man was dressed in sportswear and wore a duckbill cap, its brim covering his eyes, revealing only his slightly cold thin lips.<br/><br/>Sensing the man had ill intentions, Johanes Miles instantly became cautious, “Can I help you?”ÚpTodated novels on no(v)el()bin(.)com<br/><br/>“Yes.”<br/><br/>“What do you want?” The Old Master frowned.<br/><br/>The man pulled a faint smile, his voice indifferent, “Is this store mine?”<br/><br/>“And so?” Johanes Miles asked.<br/><br/>“So as I was passing by, I happened to overhear a few things.”<br/><br/>Old Master and Johanes Miles both stared at him.<br/><br/>“You intend to use the media, public opinion, to pressure her into returning to the Miles family?”<br/><br/>“Who are you?” Johanes Miles questioned.<br/><br/>The man didn’t answer his question but said, “Stay here and rest for a while. Once the people across leave, then you can leave.”<br/><br/>“Who are you to stop us from leaving?” Johanes Miles said with a low voice.<br/><br/>“Then try it, see if you can leave just like that.” The man smiled.<br/><br/>The Old Master stared at him then said, “Lorenzo, call the police.”<br/><br/>Johanes immediately took out his phone to make a call.<br/><br/>The man chuckled lightly, then in the next moment he grabbed Johanes’s hand.<br/><br/>Johanes flinched in pain, letting go of his hand, dropping his phone.<br/><br/>After he let go of his hand, the man bent down to catch the phone. He seemed to be in no hurry, completely at ease, “I’ll hold on to this for you.”<br/><br/>“What the hell are you trying to do!”<br/><br/>It was Joseph Allen who had helped contact the clock company at that time.<br/><br/>When the clock was made, a lot of thought was put into it, with Daisy Zane’s name and white orchid flower engraved on the clock.<br/><br/>But when the clock was completed, the real Daisy Zane never saw it. Now the clock had stopped working<br/><br/>All the reviews online were quite positive, except for a few who were still questioning the evidence Daisy Zane put forth.<br/><br/>Some suggested that the video could be fake since it was too much of a coincidence to have video footage and surveillance.<br/><br/>They even suggested that even if it was sent to a detection agency, the agency might be bribed to lie.<br/><br/>And then those who raised suspicions were drowned out online by Daisy Zane’s fans and spectators .<br/><br/>[The video is fake? How was it fake? The Daisy Zane in the video, with such short hair, such an innocent face, it’s clearly from a few years ago. Tell me, how was it faked? How was it faked?]<br/><br/>[Some people really have bad eyes, and their ears don’t work either. But they are good at taking things out of context. Didn’t you hear what Daisy said afterwards? The security cameras were installed in Cold Green Village after an incident. They only use electricity, don’t connect to the internet, and use storage cards!]<br/><br/>[I advise you to read more and speak less. Don’t let people know that you have no common sense the moment you open your mouth.]<br/><br/>[All the original copies of the videos have been handed over to the police, you dare to question the police. Wow! That takes courage.]<br/><br/>[If you have the guts to say it here, then why don’t you go to the police and let them investigate? All you do is talk nonsense online, but in real life, you’re nothing more than timid turtles.]<br/><br/>The incident was resolved smoothly and completely.<br/><br/>A few negative voices were expected, as there are always some people who can’t keep their mouths or hands to themselves. It was inevitable.<br/><br/>All the netizens were immersed in the excitement of the reveal at that moment. Especially Daisy Zane’s fans, they were celebrating the successful clarification.<br/><br/>Some drama fans were relieved that the airing of the TV series was not affected.<br/><br/>Even at around 11 PM, the streaming platform announced: An additional two episodes of the drama would be aired each night this week.<br/><br/>They cleverly rode on the wave of the hype.<br/><br/>Those celebrating, celebrated, those watching, watched, and those eating melons, ate melons. Everyone was oblivious to the fact that there were three people in the video Daisy Zane used as evidence.<br/><br/>It was not until past two in the morning that someone finally questioned,<br/><br/>[There were three people in Cold Green Village. Who was filming? Why did the person filming call Daisy Zane ‘Daisy’?]<br/><br/>After this message was posted, many people started discussing it.<br/><br/>After over a thousand threads of discussion, someone else commented: [Do you think there’s a possibility that the current Daisy Zane is not Daisy Zane?]<br/><br/>The discussion then gradually began to become bizarre.<br/><br/>[Could she have been possessed?]<br/><br/>[Have you ever heard of soul swapping?]<br/><br/>[Wow! Enough guys! This is too much, especially late at night.]<br/><br/>Everyone continued discussing, but at around 5 AM, the discussion suddenly disappeared online\t\t\t\t\t\t</div>", "images": {}, "success": true}