{"id": 419, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14554531.html", "title": "Chapter 419: 371: Take Her And Run First", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 419: 371: Take Her And Run First</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 419: 371: Take Her and Run First<br/><br/>Translator: 549690339<br/><br/>There were too many enemies on Adrian’s side, so many that from the periphery Dark Radiance’s people could not be seen.<br/><br/>Both James and Adrian had vehicles for transporting goods. But the goods Adrian was carrying were fake, meant to confuse the enemies.<br/><br/>But Adrian managed to make the enemy think that the goods on his side were real.<br/><br/>So from the very beginning, the main firepower was aimed at Adrian’s side.<br/><br/>“Kent, go to Captain Mason’s side.”<br/><br/>Kent was stunned, and Michael also looked at the back: “Lady Zane ”<br/><br/>“Listen to my arrangement.”<br/><br/>Kent looked at Michael, who hesitated but still listened to Daisy’s words. He nodded.<br/><br/>Kent was even more indecisive, mainly because he couldn’t make up his mind. After thinking about it, he finally turned the car around towards Adrian’s side.<br/><br/>The four vehicles that had been following him saw him leave, so they followed suit.<br/><br/>James immediately noticed Daisy’s departure. He hurriedly called Michael. Instead of his usual kind manner, he roared: “Michael, what are you doing! Bring Lady Zane back right away! If anything happens, how can we explain it to Third Master?”<br/><br/>Before Michael could speak, Daisy took the phone. Her voice was steady and filled with coldness: “James, you are responsible for safely bringing back the goods and the people you lead. This is your only task now. We’ll meet at Shallow Creek.”<br/><br/>James’s roar stopped.<br/><br/>There was something about Daisy’s words that made people feel at ease and convinced.<br/><br/>It made people want to obey subconsciously.<br/><br/>“But Third Master ”<br/><br/>“I’ll explain to Kevin.”<br/><br/>After Daisy spoke, she hung up the phone.<br/><br/>There were too many forces on Adrian’s side, coming from all directions. They completely surrounded Adrian and his men inside.<br/><br/>It was unrealistic for Daisy’s group to circle around the periphery, so they concentrated their firepower on a weaker force from the outside.<br/><br/>A hole was torn through the force’s defense.<br/><br/>As soon as the encirclement cracked, it was like half a victory.<br/><br/>But the abilities of Adrian and the others in Dark Radiance were not just for show.<br/><br/>Each of them was formidable in combat.<br/><br/>It was just a matter of time for them to break through the encirclement from the inside.<br/><br/>As soon as the words left his mouth, the brother on lookout reported: “Captain Mason, Black Fox’s forces have been spotted approaching.”<br/><br/>Adrian:<br/><br/>Michael:<br/><br/>Kent:<br/><br/>Daisy:” .”<br/><br/>Adrian’s breath stuck in his throat as he looked at Kent. He was so angry that he wanted to bite him: “You damn jinx!”<br/><br/>Black Fox, the name of the entire organization was Black Fox, and their boss’s name was also Black Fox.<br/><br/>It was a big power in the M Continent, a mysterious organization that rarely appeared near the border.<br/><br/>But today they met.<br/><br/>Black Fox had a distinct feature: the organization seemed to have many reckless members.<br/><br/>No matter how big the force, or who was behind it, they dared to strike, and strike forcefully.<br/><br/>And when they encountered such a force, they would inevitably fight.<br/><br/>For so many years they have always been around.<br/><br/>It seemed that they had not grown much, but they had not disappeared, and their reputation was still there.<br/><br/>This was the reason Adrian was worried.<br/><br/>Moreover, the key point was that their people had already experienced a fierce battle, and some of them were injured.<br/><br/>If they fought again, he wasn’t unsure about winning, just afraid that the damage would be too severe.<br/><br/>There was still a long way to go, and Shallow Creek was still far away. There were many unknowns ahead.<br/><br/>If they fought here again, they would probably be in big trouble if they encountered another blockade.<br/><br/>But the enemy was already in front of them, they had no choice but to fight.<br/><br/>Adrian looked at Daisy, but before he could speak, Black Fox’s people had already approached. From a distance, they could see them, and they took out speakers to shout, “Dark Radiance, it’s our first encounter! Meeting is fate, we haven’t fought Dark Radiance before, don’t know if you are really that powerful.”<br/><br/>Daisy listened to the voice, and the speakers were at least the lowest quality ones.<br/><br/>Without Adrian saying anything, everyone immediately went on guard and entered combat status.<br/><br/>Black Fox shouted again, “I see you have injured people. In that case, all of you kneel down and kowtow three times. Today, I’ll break my rule and let you go. Each person kowtows three more times, and I’ll escort you a distance.”<br/><br/>Adrian wanted to say something to Daisy, but suddenly forgot what it was.<br/><br/>He spat, cursed, and immediately walked forward, as he spoke to Kent and Michael: “Protect her well, in case something happens take her away first.”Updated chapters at novelhall.com\t\t\t\t\t\t</div>", "images": {}, "success": true}