{"id": 416, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14554527.html", "title": "Chapter 416 - 368: Come Back And Complain To Me", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 416 - 368: Come Back And Complain To Me</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 416: Chapter 368: Come Back and Complain to Me<br/><br/>Translator: 549690339<br/><br/>“Third Master actually agreed to let her go. What can she do when she goes there? Damn, I’ll have to take care of her.”<br/><br/>“It seems like Big Boss has changed this time.”<br/><br/>“Big Boss never had room for women in his eyes before. Look at Miss Santiago on Mountain Sea Continent, even though she is the daughter of an old friend, when did Big Boss ever treat her like a woman?”<br/><br/>Siera Santiago lay on the conference table with her eyes closed, and hearing this remark, she said without even opening her eyes, “Get lost, don’t even mention me.”<br/><br/>“This Lady Zane is not simple at all, she’s really not simple, she even made Big Boss gentle.”<br/><br/>“Don’t you guys think that Big Boss is more terrifying after becoming gentle?”<br/><br/>Everyone nodded in agreement.<br/><br/>“I really don’t want to take her, I’ve never taken care of a woman before, I don’t know how to do it.”<br/><br/>“With her delicate skin and tender flesh, how should I serve and attend to her to make her comfortable? Only then can I prevent her from being willful and causing trouble.”<br/><br/>“To ensure her safety, Third Master even asked Captain Mason to transport the goods tomorrow. When has Captain Mason, who is in charge of the 12th Hall, ever done such a thing?”<br/><br/>“With Captain Mason’s temperament and character, I’m actually a bit worried about Lady Zane. I hope he doesn’t scare her to tears.”<br/><br/>“Lady Zane doesn’t seem like that kind of person,” James Cooper said.<br/><br/>Everyone in the meeting room looked at him.<br/><br/>After a while, James Cooper was attacked by the group.<br/><br/>“What about her doesn’t seem like that kind of person, just look at what she just said in the restaurant, listen.”<br/><br/>“Have you been bewitched by her too, with your foggy mind?”<br/><br/>Thomas Firway dragged out his exhausted tone and shouted, “You’ve only known her for a few days, I’ve known her for a long time, and she’s always like this. Third Master listens to everything she says.”<br/><br/>James Cooper:<br/><br/>Thomas Firway: “Me and Miss Santiago’s current state, isn’t it the best evidence? Otherwise, would the two of us be like this?”<br/><br/>“Yeah, when have you seen Third Master treat Miss Santiago like this?”<br/><br/>“I sincerely pray that she changes her mind tonight and doesn’t go tomorrow.”<br/><br/>“What did Third Master see in her? She can’t shoulder any responsibility or handle anything, and apart from being beautiful, she’s practically useless.”<br/><br/>“Beauty is enough,” Siera Santiago mumbling with her eyes closed, “Kevin Clark is just a visual creature.”<br/><br/>No one dared to respond.<br/><br/>Looking across the whole Dark Radiance, only this daughter of an old friend had the guts to say such things about Kevin Clark behind his back.<br/><br/>A group of people piled up in the meeting room, secretly complaining. Inside the room, Daisy Zane was writing the script, and Kevin Clark went to make her another bowl of “brown sugar water” and put it beside her.<br/><br/>Daisy Zane took a look and continued writing.<br/><br/>Arthur North hugged her from behind, resting his chin on her shoulder, and after a while, he asked, “Do you really want to go tomorrow?”<br/><br/>“Yes.”<br/><br/>“I’m afraid you’ll feel uncomfortable.”<br/><br/>“It’s okay,” Daisy Zane said, “I want to have a look.”<br/><br/>“I have something to do tomorrow, I can’t accompany you.” Kevin Clark apologized.<br/><br/>“I’ll keep an eye on them for you,” Daisy Zane said lightly as she typed.<br/><br/>Kevin Clark chuckled, “Okay. Letting Madam work so hard. When Madam comes back, I’ll definitely serve her well.”<br/><br/>Hearing the implied meaning in his words, Daisy Zane’s fingers faltered, and she said, “Get lost.”<br/><br/>Kevin Clark didn’t move but held her tighter, chuckling softly. “I’ll have Michael Jackson follow you and put safety first.”<br/><br/>“Okay.”<br/><br/>“Lady Zane, I’m here,” Michael Jackson immediately said, “What do you want to eat? Drink? Or something else?”<br/><br/>Adrian Roberts and James Cooper both glanced over.<br/><br/>While James didn’t mind, Adrian’s face could hardly conceal his dissatisfaction.<br/><br/>Daisy Zane glanced at Michael Jackson, then lowered her head to continue drawing the design diagram. She asked softly, “Is this our first day of acquaintance?”<br/><br/>“No,” Michael Jackson replied, even though he didn’t understand the question.<br/><br/>“Then you’re nervous.”<br/><br/>Michael Jackson: ” I, I’m not.”<br/><br/>Daisy Zane chuckled lightly: “Tell me about the power dynamics in the Mountain Sea Continent.”<br/><br/>“Yes.” Michael Jackson obliged, pondering for a moment, “There are two major powers in the Mountain Sea Continent: Dark Radiance and Hundred Demons Pavilion. Dark Radiance was established ten years ago. At that time, it was one of the many small organizations. The Mountain Sea Continent was chaotic then, with many forces stationed here. Seeing this, Third Master also sent his people here.”<br/><br/>Daisy Zane closed the tablet and listened to Michael Jackson’s words.<br/><br/>Seeing her response, Michael Jackson felt a warm current in his heart. It felt good to be respected.<br/><br/>“Captain Mason ” Michael Jackson looked at Adrian Roberts, “He was the first to come to the Mountain Sea Continent.”<br/><br/>Daisy Zane took a look at Adrian.<br/><br/>When their gazes met, Adrian narrowed his eyes before shifting away with resentment.<br/><br/>Daisy Zane raised her eyebrows.<br/><br/>Michael Jackson continued: “At that time, Third Master was busy with other matters and couldn’t pay much attention to this place. It was Captain Mason who had been expanding Dark Radiance.”<br/><br/>Daisy Zane thought for a moment and realized that Kevin Clark must have been busy with Easton Group’s affairs in F Continent at that time.<br/><br/>“Later when Third Master came over, Dark Radiance grew rapidly. They were originally in balance with an organization called the Thousand Mountains Alliance. However, the Hundred Demons Pavilion suddenly rose, and within two years they became the other major power in the Mountain Sea Continent. The Thousand Mountains Alliance, under the suppression of Hundred Demons Pavilion, didn’t become the third major power.”<br/><br/>Daisy Zane listened and raised her eyebrows.<br/><br/>Adrian listened on the other side, feeling choked up.<br/><br/>Telling her so much, would she understand?<br/><br/>Adrian had more than just a little bit of an issue with her.<br/><br/>That he could come here was all thanks to her. Because Thomas Firway and Siera Santiago couldn’t move now.<br/><br/>Most importantly, Third Master had been urging him to take good care of her.<br/><br/>When had he ever taken care of anyone? He had only beaten people up!<br/><br/>If he hit her once, would Third Master tear him apart?<br/><br/>Pent-up<br/><br/>Michael Jackson went on: “The Mountain Sea Continent has a set of rules different from those in the domestic area. Both Dark Radiance and Hundred Demons Pavilion hold great power here ”<br/><br/>Michael Jackson talked about many things regarding the Mountain Sea Continent, clearly understanding the matters well.<br/><br/>Moreover, his language was clear, and his logic was sound.<br/><br/>No wonder, among so many people, only Michael Jackson was chosen as Kevin Clark’s assistant.<br/><br/>That’s about it.”<br/><br/>Daisy Zane nodded, then opened the tablet again to continue her drawing.<br/><br/>After hesitating for a few seconds, Michael Jackson suddenly realized that he was no longer nervous.<br/><br/>He blinked but didn’t dare to look at Daisy Zane.<br/><br/>Back in the Imperial Capital, the police station’s arrest warrant for the Mountain Sea Continent<br/><br/>Anyone capable of getting the arrest warrant, knowing Logan, and having once used Alvin Phantom’s men in Truro City, must be familiar with the power distribution in the Mountain Sea Continent.<br/><br/>Michael Jackson paused and said, “Thank you, Lady Zane.”<br/><br/>Daisy Zane didn’t look up: “No need to thank me. It’s your nervousness that affected me.”<br/><br/>Michael Jackson:\t\t\t\t\t\t</div>", "images": {}, "success": true}