{"id": 411, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14540534.html", "title": "Chapter 411 - 363: Seeing Bonnie Maxwell", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 411 - 363: Seeing Bonnie Maxwell</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 411: Chapter 363: Seeing Bonnie Maxwell <br/><br/>Translator: 549690339 <br/><br/>The Maxwell couple came in the morning, and Daisy Zane went to the police station in the afternoon to see Bonnie Maxwell. <br/><br/>During the days Bonnie Maxwell was detained, the Maxwell family made several visits, sought help from many people, pulled many strings, but no one was able to see her. <br/><br/>When Daisy Zane saw her, Bonnie Maxwell seemed to be in good shape. <br/><br/>Even better than when she was taken away. <br/><br/>“What are you doing here? Are you here to ridicule me?” Bonnie Maxwell said, “Is everything cleared up? Do you have any ways to clear things up?” <br/><br/>Looking at her, Daisy Zane spoke calmly, “You have forgotten. You still don’t know what has happened outside.” <br/><br/>Bonnie Maxwell glared at her fiercely. <br/><br/>Daisy Zane took out her cell phone and scrolled through some messages. She tossed her cell phone to Bonnie, “They got him, that’s an official statement from the police. The entire process, the people involved, the final outcome, as well as various pieces of evidence. Because the evidence was abundant, they were quick to take action.” <br/><br/>Bonnie Maxwell looked over the evidence released by the police. <br/><br/>And also searched for video evidence recorded by the media on the day of the press conference according to the trending searches. <br/><br/>After a while, she said, “You’ve installed surveillance cameras in Cold Green Village!” <br/><br/>Daisy Zane did not respond. <br/><br/>Bonnie Maxwell looked at the cell phone for a while and then scoffed, “Daisy Zane, did you come here today to tell me that you cleared things up? What good does clearing things up do? What can you do to me even if you managed to clear up the matter? How many days can you have me detained for this? Seven days? Fifteen days?” <br/><br/>“What if I have more than just this one case on hand?” Daisy Zane asked. <br/><br/>Bonnie Maxwell narrowed her eyes and smirked, “Tell me, what else do you have?” <br/><br/>“There are traces of a particular drug in Jeremy Wheeler. It’s a slow-acting poison that you purchased.” Daisy Zane said mildly. <br/><br/>“And so what?” Bonnie Maxwell laughed even more triumphantly, she had thought through everything in these past few days. Every action she took, even if it could be linked back to her, none of it could be used to convict her domestically, “how can you prove that the drug in Jeremy Wheeler’s system is the same one I bought? What if the ingredients are the same? You can’t prove it was mine.” <br/><br/>Daisy Zane said nothing and just looked at her. <br/><br/>“The purchase evidence is useless domestically.” Bonnie Maxwell said, “The transaction proof from Mountain Sea Continent is invalid domestically.” <br/><br/>She wouldn’t let her off the hook. <br/><br/>And also this was her own doing. <br/><br/>The light in Bonnie Maxwell’s wide-opened eyes gradually faded, her voice stiffened, “I don’t believe it, I don’t believe it. It’s fake, fake. How could you have an arrest warrant from Mountain Sea Continent, how could you! Impossible, impossible.” <br/><br/>Daisy Zane stood up, put the arrest warrant away, took back her cell phone, and looked down at Bonnie, “If I permit it, you can establish yourselves on the Mountain Sea Continent. If I don’t permit it you won’t even survive 24 hours.” <br/><br/>Having said that, Daisy Zane left. <br/><br/>Bonnie Maxwell stared blankly at Daisy Zane’s retreating figure. After a few seconds, she suddenly struggled and shouted, “Daisy Zane! Daisy Zane! Who are you! Let me out! Let me out! Who are you!” <br/><br/>Today, Kevin Clark didn’t accompany her; instead, he went to the research institute. <br/><br/>But just fifteen minutes after Daisy Zane left the police station, he received a message. <br/><br/>Bonnie Maxwell would be sent to the Mountain Sea Continent overnight. <br/><br/>“She has an arrest warrant?” Kevin Clark exclaimed. <br/><br/>Michael Jackson received this news from the police station, “Yes. It was signed by a foreign man. I don’t know who.” <br/><br/>Kevin Clark lifted an eyebrow. <br/><br/>She had her power on the Mountain Sea Continent, and since she could get an arrest warrant, her influence shouldn’t be small. <br/><br/>Michael Jackson said, “Master Clark, we don’t need the arrest warrant we issued.” <br/><br/>“Hmm,” Kevin Clark said, “Keep an eye on the Maxwell Family tonight.” <br/><br/>“Roger that.” <br/><br/>That evening Daisy Zane received a call from Holt Lawrence. <br/><br/>“Nana The Maxwell Family really did send people to rescue Bonnie Maxwell.” Holt Lawrence said, “But they didn’t end up fighting our people.” <br/><br/>“Hmm?” <br/><br/>“The Maxwell Family and your Third Master’s people confronted each other. Then they slinked off dispiritingly.” <br/><br/>Daisy Zane:\t\t\t\t\t\t</div>", "images": {}, "success": true}