{"id": 418, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14554529.html", "title": "Chapter 418: 370: Surround And Block", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 418: 370: Surround And Block</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 418: 370: Surround and Block<br/><br/>Translator: 549690339<br/><br/>After lunch, they continued on their journey.<br/><br/>Daisy Zane dozed off again after getting back into the car.<br/><br/>Firstly, she hadn’t slept the previous night and was genuinely tired. Secondly, it was genuinely quite uneventful seemingly calm and peaceful all the time.<br/><br/>But since they were carrying the ‘Thing’, how could it remain calm and peaceful all the time.<br/><br/>It was 2:06 in the afternoon, local time.<br/><br/>Daisy Zane heard the gunfire and opened her eyes.<br/><br/>Simultaneously, voices came from the walkie-talkies inside the car.<br/><br/>In their car, other than the driver, there was only Michael Jackson in the copilot seat and Daisy Zane in the backseat.<br/><br/>A burst of static, then voices from the walkies talking about being ambushed by more than one group of people.<br/><br/>It could be some powers temporarily teaming up to intercept Dark Radiance’s ‘Thing’, or it could simply be every faction trying to compete on their own.<br/><br/>After this message came over, Adrian Roberts’ voice rang out: “Stick to the plan, prioritize the cargo. If forced to disperse, rendezvous at Shallow Creek.”<br/><br/>“Understood.”<br/><br/>The sound of gunfire drew nearer, and Daisy Zane noticed the vehicles approaching from afar.<br/><br/>The walkie-talkie crackled again: “Kent Jericho, follow James Cooper’s car. Ensure Lady Zane’s safety.”<br/><br/>Kent Jericho was Daisy Zane’s driver, and quickly responded, “Roger that.”<br/><br/>There were vehicles ahead and behind Daisy Zane’s car specifically for her protection.<br/><br/>Michael Jackson turned his head to look at Daisy Zane in the rear, saw her calm and somewhat sleepy demeanor, and silently turned his gaze forward again.<br/><br/>Who was protecting who It was hard to tell.<br/><br/>The forces on the perimeter were closing in fast.<br/><br/>Driving their cars in an attempt to crash into theirs, they opened fire on their cars.<br/><br/>Daisy Zane’s car was unaffected— vehicles swiftly surrounded it for protection.<br/><br/>All their cars were modified: glass and tires were bulletproof, and the entire body had been refitted.<br/><br/>To avoid impacting the speed, special materials were used in the cars. They could still maintain high speeds.<br/><br/>As long as there wasn’t a sustained attack, the cars would generally not have any issues.<br/><br/>The opposing factions quickly engaged in combat, with gunfire and crashes heard all around.<br/><br/>The driver called Kent Jericho was very skilled at driving.<br/><br/>Though they were under siege, he could always manage to evade. However, while the car’s speed was fast, it was only circling around, not escaping the area.<br/><br/>There were many enemies, and they couldn’t break away for now. So, to avoid the enemy, all he could do was circle.<br/><br/>The cars carrying the cargo, driven by James Cooper and his team, too, were engaging while circling around.<br/><br/>The scene was incredibly chaotic.<br/><br/>He saw her quickly refilling the magazine very quickly, her face cold and composed.<br/><br/>Even though bullets were constantly hitting the car windows and doors, her expression remained unchanged, her eyelashes didn’t even blink once.<br/><br/>“Five minutes.” Daisy loaded the magazine, “Pin them down here.”<br/><br/>Her calm demeanor, the dismissive tone of her voice gave Kent great comfort. He obeyed and kept circling the car.<br/><br/>Four other vehicles also mimicked their action.<br/><br/>For five minutes, Daisy attacked with her gun while also guiding Kent on the road.<br/><br/>All those who had chased them were either injured or handicapped, and some also retreated<br/><br/>When they were completely unable to chase them anymore, Daisy then said, “Retreat.”<br/><br/>Kent took a breath and exhaled slowly, both nervous and excited. His hands gripping the steering wheel were completely wet.<br/><br/>Just their five cars had wiped out a team that had been chasing them.<br/><br/>He had never felt so exhilarated before.<br/><br/>Kent’s eyes glittered with excitement as he drove towards James.<br/><br/>Their plan was that James was responsible for taking the goods away, and couldn’t afford to be involved in battle.<br/><br/>Most importantly, the goods were the second priority, Daisy Zane’s safety was the first priority.<br/><br/>On the other hand, Adrian was part of the group who wished to fight, purely to distract the enemy’s firepower.<br/><br/>Compared to them, Daisy was initially in the safest position.<br/><br/>But because of the location being a plain, it was barren all around, only dry weeds were present.<br/><br/>When the enemy surrounded them, the whole team was being attacked from all directions.<br/><br/>Under the current circumstances, whether they wished to fight or not, all were in the heat of battle.<br/><br/>Even though James’ team was moving, the battle was not let up.<br/><br/>In fact, initially when attacked, the team was somewhat dispersed, fighting individually. They were currently retreating while trying to regroup.<br/><br/>When Daisy left, neither James nor Adrian noticed.<br/><br/>One, they did not foresee Daisy leaving the safe area, and two, they were too preoccupied in that moment.<br/><br/>Only when Kent drove back to join forces with James to strike the enemy did James realize that Daisy was not with the team.<br/><br/>James instantly broke out in cold sweat.<br/><br/>Even though Daisy was safe and sound, the image of Harton Clark’s murderous eyes still floated into his mind<br/><br/>The enemy was flanked, and suffered heavy losses.<br/><br/>Now was a good opportunity to retreat.<br/><br/>Even though the thought of Harton Clark made James’ legs go weak, he did not drag his feet and immediately ordered the retreat.<br/><br/>Leaving some people to cover them, Kent drove the car to a safer location.<br/><br/>From the car window, Daisy looked toward Adrian’s team.\t\t\t\t\t\t</div>", "images": {}, "success": true}