{"id": 414, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14553153.html", "title": "Chapter 414: 366: Martin Hanzel", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 414: 366: Martin Hanzel</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 414: 366: Martin Hanzel<br/><br/>Translator: 549690339<br/><br/>In the evening, after Daisy Zane fell asleep, Kevin Clark got up and left the room.<br/><br/>Daisy Zane sensed his departure, but her eyelashes only trembled slightly without opening her eyes. She then pulled the quilt over herself and continued to sleep.<br/><br/>Kevin Clark went to the study room on the second floor downstairs.<br/><br/>There was someone waiting for him in the study.<br/><br/>Two men, dressed in black clothes and wearing masks, lowered their heads and greeted him after he entered the study, calling him “Big Boss.”.<br/><br/>Kevin Clark lightly acknowledged, then sat down on the chair behind the desk.<br/><br/>The two men also removed their masks. They looked very similar, being twin brothers.<br/><br/>Yoshua Archer and Edward Darkmoon.<br/><br/>“Have you heard anything from Martin Hanzel?” Kevin Clark asked.<br/><br/>The two brothers shook their heads together.<br/><br/>A moment of fierceness flashed across Kevin Clark’s eyes, then he remained silent for a while before speaking again.<br/><br/>In M Continent, he had once spent a year cultivating four assassins.<br/><br/>Later, they were given names: Martin Hanzel, Harrison Theodore, Yoshua Archer, and Edward Darkmoon.<br/><br/>At the time, there were hundreds of people participating in the training, but only these four were left in the end.<br/><br/>Hugo Clark participated too.<br/><br/>However, in order to preserve the Clark family, Kevin Clark asked Hugo to withdraw halfway through the training, which was a testament to the cruelty of the training.RêAd lateSt chapters at novelhall.com Only<br/><br/>Aside from him, Thomas Firway also participated and became Harrison Theodore.<br/><br/>Like the other hundred people, their entire bodies were covered, not a single inch of skin exposed, and it was impossible to know who was who.<br/><br/>Kevin Clark was the same, even using a disguised voice.<br/><br/>For a year, as people around him dwindled, nobody knew who the person beside them was or what they looked like.<br/><br/>Even at the beginning, everyone only had identification numbers.<br/><br/>It was only after cultivating these four assassins for a year that Martin Hanzel faked his death and left.<br/><br/>As Dark Radiance became completely stable under Edward Darkmoon’s watch, Thomas Firway took over all matters related to it. Yoshua Archer and Edward Darkmoon, the two brothers, were very down-to-earth and showed no disloyalty.<br/><br/>So Kevin Clark allowed them to come to the Mountain Sea Continent and revealed his identity as their Big Boss, showing them his true face.<br/><br/>From then on, they would also drop their disguises in front of Kevin Clark.<br/><br/>However, Thomas Firway had not seen their full appearances yet. Every time he saw them, he identified them by their attire and eyes.<br/><br/>Thomas Firway, being carefree, often flaunted his true appearance when not on a special mission.<br/><br/>“Yes,” Daisy said, “I’m a bit thirsty, and I don’t have any pads.”<br/><br/>“I have some in my suitcase.” Kevin picked her up without hesitation and walked towards the bedroom. “I’ll get you some water first. Go back to your room.”<br/><br/>Daisy Zane: ” I’m not immobile, I could even fight you.”<br/><br/>“I won’t fight.” Kevin refused. “Go back to your room first.”<br/><br/>Carrying Daisy back to the room, Kevin brought over a small suitcase and placed it by the bed. He took out a medicine packet from inside, then leaned down to kiss Daisy before leaving the room.<br/><br/>Daisy Zane looked at the contents of the suitcase and smiled gently. Everything was well-prepared.<br/><br/>She had forgotten about this, but Kevin had thought of everything.<br/><br/>He had even prepared several medicine packets and heat patches to help ease her stomach pain.<br/><br/>Kevin went down to the first floor, where James Cooper and two others happened to be.<br/><br/>Seeing him come downstairs, everyone stood up: “Third Master.”<br/><br/>“Mm,” Kevin acknowledged, then walked straight towards the kitchen.<br/><br/>James watched him head for the kitchen and exchanged glances with the other two before following Kevin. “Third Master, what do you need? Let me do it.”<br/><br/>“I’m going to cook something,” Kevin said.<br/><br/>“I, I’ll call someone.” Another person was about to call the cook after he spoke.<br/><br/>But Kevin stopped him, “No need. I’ll do it myself.”<br/><br/>The man hesitated for a moment, then suddenly turned his head to look at the other two people behind him.<br/><br/>The other two were also looking at him.<br/><br/>The three of them looked at each other and then at Kevin, as if they were all checking to see if their Third Master had come downstairs.<br/><br/>Or perhaps it was too late, and they were dreaming.<br/><br/>Driven by curiosity, James suddenly grew bolder and stood at the kitchen door, watching Kevin, “Thir-, Third Master, can you cook too?”<br/><br/>Kevin glanced over. His expression was calm and devoid of any extra emotion. Even because he was thinking of Daisy Zane, his eyes were somewhat gentle.<br/><br/>However, the three people outside the door still retreated two meters the moment he looked at them.<br/><br/>Kevin looked at them and spoke softly after a moment: “Haven’t you eaten the snake soup, grilled fish, boiled mice, and fried insects I’ve cooked before?”<br/><br/>The three of them looked at him, trying to recall those dishes, and none of them spoke for a while.<br/><br/>Kevin didn’t bother with them further, first boiling some hot water. Then he cooked some brown sugar water and put the medicine packet he had retrieved into it.<br/><br/>The three men outside the door remained standing there. After a while, one of them spoke up, “I have eaten all those dishes.”<br/><br/>James nodded and said, “But I’m sure it was raw.”<br/><br/>The other two nodded in unison.\t\t\t\t\t\t</div>", "images": {}, "success": true}