{"id": 412, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14551511.html", "title": "Chapter 412: 364: Going To Mountain Sea Continent", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 412: 364: Going To Mountain Sea Continent</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 412: 364: Going to Mountain Sea Continent<br/><br/>Translator: 549690339<br/><br/>One week later, Arthur North took Daisy Zane to the Mountain Sea Continent. Accompanying them were Michael Jackson and Allonzo Hobson.<br/><br/>Outside the Airport, more than a dozen cars were waiting to pick them up.<br/><br/>But Daisy Zane only recognized one person.<br/><br/>Thomas Firway, whom she hadn’t seen for a long time.<br/><br/>After seeing her, Thomas Firway’s excited expression instantly dimmed.<br/><br/>As if harboring a grudge.<br/><br/>On the contrary, Daisy Zane looked amused by his sudden change of face, raising an eyebrow with a smile.<br/><br/>“Third Master. Young Master Hobson.” Thomas Firway called out in unison with the person beside him.<br/><br/>Then, Thomas Firway glanced at Daisy Zane, pursed his lips, and sullenly lowered his head without speaking. The person next to him courteously nodded at Daisy Zane.<br/><br/>Arthur North glanced at Thomas Firway but ignored him. Instead, he introduced Daisy Zane to the person: “James Cooper, he usually stays around the Mountain Sea Continent.”<br/><br/>“Lady Zane, nice to meet you.”<br/><br/>Daisy Zane nodded to him.<br/><br/>They got in the car.<br/><br/>Allonzo Hobson was in the same car with them, and James Cooper was the driver.<br/><br/>Thomas Firway originally wanted to drive the car, but he was only glanced briefly at by Arthur North. Michael Jackson quickly pulled Thomas Firway to another car.<br/><br/>After a journey of more than an hour, the car drove into a Manor House.<br/><br/>The whole decoration of the Manor House was somewhat dark, with an ancient, mysterious, and evil ambiance.<br/><br/>It was vast in size, too large to estimate visually.<br/><br/>In the center of the estate, there was a banner.<br/><br/>On it, a dark sun.<br/><br/>The flag of Dark Radiance.<br/><br/>Dark Radiance one of the two dominant powers in the Mountain Sea Continent.<br/><br/>Daisy Zane had been sleeping on the way, and her eyes still had some lingering sleepiness.<br/><br/>She looked at the flag of Dark Radiance, her eyes unreadable and obscure.<br/><br/>After a moment, she said, “I seem to have fought against Dark Radiance’s people.”<br/><br/>James Cooper’s entire impression of their Big Boss’s wife came from Thomas Firway’s description.<br/><br/>But Thomas Firway to this day, nobody had told him about Daisy Zane’s real strength.<br/><br/>Everyone was tacitly and deliberately keeping him in the dark.<br/><br/>Even Michael Jackson hadn’t mentioned it.<br/><br/>So... when James Cooper heard this, he instinctively glanced at her from the rearview mirror, surprise evident in his eyes.<br/><br/>“Three days later.” Kevin Clark pecked her cheek, “They have all been selected over the past two months. Martial Arts Arena competition in three days, some people will be eliminated again. It should be quite exciting.”<br/><br/>“What if it’s not exciting?” Daisy Zane asked.<br/><br/>“Not exciting ” Kevin Clark laughed, “I’ll go down to the field myself, until the madam feels it’s exciting enough.”<br/><br/>Daisy Zane smiled. With Kevin Clark’s skills, it would be hard to select anyone from Dark Radiance: “What about after that?”<br/><br/>“After that, it’s not only about the Mountain Sea Continent, Thomas Firway will mainly take charge.” Kevin Clark said, “I’m just here to preside and handle some things.”<br/><br/>Daisy Zane nodded, drank another sip of water, and put it aside.<br/><br/>“Shall we go for a tour?” Kevin Clark took the glass and finished the remaining water.<br/><br/>Daisy Zane glanced at him: “Mhm.”<br/><br/>The manor house was too large, half of the area was occupied by the Martial Arts Arena.<br/><br/>The Martial Arts Arena was so vast that it was hard to see the end.<br/><br/>There were indoor and outdoor areas.<br/><br/>Kevin Clark took Daisy Zane for a stroll outside while she watched the training below.<br/><br/>Michael Jackson, Thomas Firway, James Cooper, and several others were all following behind.<br/><br/>Without even looking back, Daisy Zane discerned their tension and even fear.<br/><br/>Who they were afraid of was obvious.<br/><br/>Whether it was because of this place or the influence of emotions, even Michael Jackson, who had become less nervous around Daisy Zane after her arrival, began to be tense and rigid.<br/><br/>“Are you getting sunburned?” Kevin Clark looked at Daisy Zane’s slightly reflective skin, “Michael Jackson, go get an umbrella.”<br/><br/>“Yes.” Michael Jackson’s voice trembled.<br/><br/>“No need, absorbing calcium.” Daisy Zane said indifferently.<br/><br/>Kevin Clark smiled and asked softly, “Aren’t you afraid of getting tanned?”<br/><br/>Daisy Zane looked at him, her expression unchanged, but Kevin Clark still understood her meaning, and immediately said, “I’m not afraid of getting tanned.”<br/><br/>He was a grown man<br/><br/>Daisy Zane laughed, and looked down again.<br/><br/>Seeing her laugh, Kevin Clark also smiled and pulled her closer to block some of the sunlight for her.<br/><br/>Michael Jackson remained still in his place.<br/><br/>As he didn’t move, the others stared at him in shock.<br/><br/>They didn’t dare to speak up and could only remind him with their eyes: What are you doing? Why aren’t you moving? Third Master told you to get an umbrella! Get an umbrella! Get an umbrella!<br/><br/>Michael Jackson, flustered by their anxious glances, blinked and said: Lady Zane said, no need!<br/><br/>Others: Whose words are you listening to?! Don’t you want to live anymore?! How dare you defy the Third Master’s orders?!<br/><br/>Michael Jackson paused, his face mysteriously shaking his head, turning himself into a man detached from the mundane world.<br/><br/>Others: “?????” Has this man been scared out of his wits?\t\t\t\t\t\t</div>", "images": {}, "success": true}