{"id": 423, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14572523.html", "title": "Chapter 423: 375: Alvin Phantom", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 423: 375: Alvin Phantom</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 423: 375: Alvin Phantom<br/><br/>Translator: 549690339<br/><br/>Kevin Clark settled Daisy Zane in and went to meet Adrian Roberts and the others.<br/><br/>They reported all the goods they had gathered, including those from Gael Easton.<br/><br/>Then, they talked about everything that had happened along the way in great detail.<br/><br/>Of course, they omitted the part where Black Fox handed her a cigarette and Daisy Zane smoked.<br/><br/>Allonzo Hobson wasn’t surprised anymore, Daisy’s layers of identity no longer shook him: “Brook Sister... even knows Black Fox.”<br/><br/>Kevin Clark was also calm: “Black Fox dares to be so fearless; there must be someone behind him.”<br/><br/>“Do you mean... Brook Sister is behind him?”<br/><br/>Kevin Clark didn’t say anything more.<br/><br/>“Third Master... the wife you’ve married.” Allonzo Hobson laughed, “This is expanding your power.”<br/><br/>Kevin Clark’s mouth curled up slightly.<br/><br/>Adrian Roberts and the others caught on, but they only knew the tip of the iceberg.<br/><br/>This Lady Zane... there was more to her.<br/><br/>Seeing that there was nothing else to discuss, Adrian Roberts and the others left.<br/><br/>Only Kevin Clark and Allonzo Hobson remained in the room.<br/><br/>After a while, Allonzo Hobson said, “Arthur, who do you think Brook Sister is aligned with? She can get the arrest warrants from the Mountain Sea Continent and use people under Alvin Phantom, knows Logan, and can even stay at the Hundred Demons Pavilion on M Continent.”<br/><br/>All these clues were pointing to one place.<br/><br/>Hundred Demons Pavilion.<br/><br/>Since Allonzo had asked this way, he must have thought about it too.<br/><br/>“So, who is Brook Sister?”<br/><br/>Kevin Clark still didn’t say anything.<br/><br/>“Luke has always been on the Mountain Sea Continent, and we have seen Logan. Although we haven’t seen Samuel’s ghost’s face, we know he’s a man,” analyzed Allonzo Hobson. “That leaves Alvin Phantom, Roy Ryder, and Damian Brown. Roy and Damian are women. Alvin... only heard the name, never seen.”<br/><br/>“Alvin Phantom’s probability is relatively high,” said Kevin Clark.<br/><br/>“Indeed,” Allonzo Hobson agreed, “Ghost King Pavilion Master has such good fortune.”<br/><br/>Kevin Clark remained silent, cursing that the Ghost King Pavilion Master was old and ugly in his heart.<br/><br/>Only then will the little girl focus only on him.<br/><br/>“Fortunately, we don’t have any conflicts with the Hundred Demons Pavilion,” said Allonzo Hobson. “Otherwise, it would be hard to explain.”<br/><br/>Kevin Clark kept cursing in his heart, not paying attention to Allonzo Hobson’s words.<br/><br/>In the room, Daisy Zane finished her bath, drying her hair while looking at the group chat messages on her cell phone.<br/><br/>Luke: [I heard... Gael Easton’s goods were intercepted at the border. It’s rumored that Dark Radiance intercepted them, and that Big Boss helped Dark Radiance.]<br/><br/>Afterward, the chat was filled with question marks.<br/><br/>For convenience, he printed it out. He printed two copies – one of which he had edited and taken back to the Imperial Capital for the dean. The other unedited copy was left here.<br/><br/>He didn’t come to this place more than once a year, so the thesis was left there, untouched by anyone.<br/><br/>“I helped someone read it.” Kevin Clark said.<br/><br/>Daisy Zane’s eyes held a hint of curiosity: “What did you study in college?”<br/><br/>“Pharmaceutical formulation.” Kevin Clark touched her face and added, “and a minor in philosophy.”<br/><br/>Daisy Zane hadn’t expected the pharmaceutical formulation part.<br/><br/>If she hadn’t seen the thesis out of the blue tonight, she wouldn’t have thought in that direction.<br/><br/>“Double major.”<br/><br/>“Yeah.”<br/><br/>“I’ve always thought you studied something programming-related.” Daisy Zane said, “So...are you working in pharmaceutical formulation?”<br/><br/>“Sort of.”<br/><br/>Daisy Zane didn’t ask further.<br/><br/>Being able to help someone with their thesis, which was deeply researched, meant that he was definitely not working any simple job. It might be related to the Research Institute.<br/><br/>If it was related to the Research Institute, she couldn’t ask further.<br/><br/>There were too many interests and family connections involved in the Research Institute.<br/><br/>It wasn’t just about the Clark and Lane families anymore, and the power involved extended beyond the Imperial Capital.<br/><br/>Dealing with deep waters, it is also inconvenient to disclose.<br/><br/>Daisy Zane sorted out the thesis and put it on the bedside table, then lay on her side in bed: “Why did you choose philosophy as a minor?”<br/><br/>Kevin Clark held her hand and said softly, “William Lane’s grandfather, Uncle Lane. He used to hold a high position, have you heard of him?”<br/><br/>“A little.”<br/><br/>Perhaps it was because of Old Master Lane that the Lane family had not only the Doomsday Hotel but also Sophie Ortiz as the Dance Association Chairman.<br/><br/>There was little information about the others.<br/><br/>“He wanted me, Roy Madison, and Lila Campbell to succeed him.” Kevin Clark said, “But in the end, none of us took that path.”<br/><br/>Daisy Zane still remembered. Kevin Clark had said that Old Master Lane was his mentor.<br/><br/>That’s why Kevin Clark had considered going into politics.<br/><br/>So you...”<br/><br/>“I had decided to give up that path when I was in college.” Kevin Clark said, “But I felt guilty towards Uncle Lane. I chose this major...just to play mind games. I wanted to find some comfort.”<br/><br/>Daisy Zane listened to his words and was silent for a while, saying, “It’s good.”<br/><br/>“Hmm?”<br/><br/>“It’s good now.”<br/><br/>Kevin Clark understood what she meant, smiled, bent down, and kissed her, “As long as my wife thinks it’s good.”\t\t\t\t\t\t</div>", "images": {}, "success": true}