{"id": 427, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14574365.html", "title": "Chapter 427: 379: New Moon", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 427: 379: New Moon</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 427: 379: New Moon<br/><br/>Translator: 549690339<br/><br/>On the Savage Mountain was a vast forest, with steep terrain and thriving weeds.<br/><br/>Thomas Firway led them into the mountain, simulating actual combat in the harsh environment, and they probably wouldn’t come out for three to five days.<br/><br/>The Thousand Mountains Alliance and an unknown force entered the Savage Mountain at this time, and there was a 90% chance they were going for Dark Radiance.<br/><br/>With the attack, the newcomers lacked combat experience and coordination. Dark Radiance would definitely send people into the mountain for support.<br/><br/>With its complex terrain, the Savage Mountain was suitable for simulated combat, and they would certainly be allowed to survive.<br/><br/>However, when live ammunition is used, and the strength of the Thousand Mountains Alliance was not to be underestimated, it would be dangerous for anyone who entered.<br/><br/>As soon as Daisy Zane arrived with her team, she entered the mountain.<br/><br/>James Collins had already entered the mountain, after Daisy Zane entered, she headed straight towards James Collins’ position.<br/><br/>Apart from James Collins’ location, she also hacked into Kevin Clark’s cell phone and located his position.<br/><br/>Kevin Clark had also entered the mountain.<br/><br/>In the evening a fog rose in the forest, the tree leaves blocked the light, and it was the night of the 15th full moon. The bright moonlight filtered through the leaves and scattered into the mountain.<br/><br/>The surrounding weeds were sometimes taller than a person, and the path underfoot was sometimes deep and sometimes shallow.<br/><br/>It was gloomy and eerie.<br/><br/>Daisy Zane led her team towards James Collins’ direction, and James Collins’ position was constantly moving, so they must have been engaged in battle.<br/><br/>She could only head towards their general location.<br/><br/>The fighting here was especially intense, and it was pretty much the main attack location of the Thousand Mountains Alliance.<br/><br/>Dark Radiance’s participants in the selection were likely here as well.<br/><br/>The area was vast, and the distant fires seemed to reach the sky.<br/><br/>“Lady Zane, Lady Zane?”<br/><br/>Daisy Zane heard someone shouting her name from behind, shot a person with her right hand and slit another person’s throat with the left-hand dagger before turning around.<br/><br/>It was Thomas Firway.<br/><br/>Thomas Firway recognized the clothes of the Hundred Demons Pavilion and only after seeing that they weren’t coming for them did he recognize Daisy Zane.<br/><br/>He saw Daisy Zane’s eyes.<br/><br/>Unlike the usual coldness, those eyes now burst with unmasked bloodlust and killing intent.<br/><br/>“Lady Zane, is it really you?” Thomas Firway was surprised, amazed, and puzzled.<br/><br/>“Where are the people participating in the training?” Daisy Zane asked in a deep voice.<br/><br/>As soon as she finished speaking, Daisy Zane’s expression sharpened, and she quickly pulled Thomas Firway behind a low mound.<br/><br/>As soon as the two left, a few bullets landed at the spot where they had just been standing.<br/><br/>Daisy Zane’s expression was calm, and her emotions didn’t fluctuate much. She lowered her gaze to wipe the blood off her dagger and said, “In a battle, no matter what you encounter, who you see, your alertness and focus must always be 100% concentrated.”<br/><br/>Listening to her words, Thomas Firway suddenly froze.<br/><br/>A few years ago, someone had said something similar to him, but it wasn’t this voice, and he hadn’t seen that person’s face.<br/><br/>He had noticed just now that with his reaction, the bullets wouldn’t have hit him.\t\t\t\t\t\t</div>", "images": {}, "success": true}