{"id": 425, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14573199.html", "title": "Chapter 425 - 377: Martial Arts Competition", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 425 - 377: Martial Arts Competition</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 425: Chapter 377: Martial Arts Competition<br/><br/>Translator: 549690339<br/><br/>The second round of the competition on the viewing platform had already begun for a while.<br/><br/>The person who just came to report to Kevin Clark hadn’t left yet.<br/><br/>Seeing Daisy Zane return, Kevin Clark’s aura lessened a bit, and he whispered to the person next to him, “Don’t conflict with the people from Hundred Demons Pavilion.”<br/><br/>“Yes.” The person next to him responded and left.<br/><br/>Daisy Zane heard his conversation but didn’t react, continuing to watch the arena below.<br/><br/>The morning matches could not be completed, so some had to be postponed to the afternoon.<br/><br/>Throughout the morning, Thomas Firway hadn’t received any challenges.<br/><br/>Seeing him being pitiful under the sun, the person hosting the matches asked before the morning session ended if anyone would like to challenge Thomas Firway.<br/><br/>He also did some encouragement.<br/><br/>However... as a gust of wind blew across the Martial Arts Arena, carrying a desolate feeling with the falling leaves...<br/><br/>No one challenged him.<br/><br/>Daisy Zane looked at Thomas Firway’s increasingly gloomy face and chuckled, “Third Master, are there any gender restrictions in the 13th Hall?”<br/><br/>Everyone looked at Daisy Zane.<br/><br/>Kevin Clark also looked at her, smiling and said, “I’m very fierce to my subordinates.”<br/><br/>Daisy Zane raised her eyebrows, “Really?”<br/><br/>Kevin Clark reached out and touched her face, “The wife of Dark Radiance has the right to challenge anyone. Just a simple challenge.”<br/><br/>Daisy Zane’s cold eyes looked into his, then she reached out her hand to him.<br/><br/>Kevin Clark immediately understood and took a hair tie from his pocket and handed it to her, “Be careful.”<br/><br/>“Mm.” Daisy Zane took the hair tie, stood up, and picked up a Lotus Seed from the table.<br/><br/>Then she jumped down directly from the two-meter viewing platform.<br/><br/>Knowing she wouldn’t be injured, but Kevin Clark’s heartbeat still increased.<br/><br/>This little girl.<br/><br/>Daisy Zane landed steadily, and in an instant, everyone both in the stands and the Martial Arts Arena looked over.<br/><br/>Thomas Firway looked at her and knit his brows.<br/><br/>As if she didn’t see the many gazes on her, Daisy Zane walked toward the fighting platform while winding the hair tie around her left thumb and index finger.<br/><br/>Then she placed the Lotus Seed on the hair tie, pulled with her right hand, and aimed at the gong used to announce challenges.<br/><br/>Letting go, the Lotus Seed shot out and struck the gong perfectly.<br/><br/>The sound of the gong echoes in the Martial Arts Arena, challenging Thomas Firway.<br/><br/>Thomas Firway clenched his fists in an instant, standing still without moving.<br/><br/>Fighting a woman and winning wouldn’t bring him any glory.<br/><br/>Allonzo Hobson whistled at this moment, looking on with excitement.<br/><br/>On the other side, after Adrian Roberts and the others reacted, they all looked at Kevin Clark. Hesitating, they said, “Third Master... Lady Zane... That’s Thomas Firway.”<br/><br/>Dark Radiance’s Top Fighter wasn’t just a title.<br/><br/>During the next exchange, Daisy Zane kicked Thomas Firway’s blocking arm. When her kick failed to connect, she quickly used the momentum to launch another kick with her other leg.<br/><br/>She had formidable core strength.<br/><br/>With that kick, Thomas Firway was sent tumbling from the arena to the ground below.<br/><br/>The whole crowd gasped for air. Allonzo Hobson laughed and clapped.<br/><br/>“My God! Just how strong is Lady Zane?” Adrian Roberts exclaimed, standing up, “That’s Thomas Firway, that’s Thomas Firway.”<br/><br/>James Cooper had heard of Daisy Zane breaking Thomas Firway’s ribs before, but witnessing it in person left him speechless.<br/><br/>How did a woman accomplish such a feat?<br/><br/>Kevin Clark, on the other hand, listened to the crowd’s praise and arrogantly sipped his tea.<br/><br/>He looked utterly smug, as if the compliments were meant for him.<br/><br/>From the ground back onto the arena,<br/><br/>Thomas Firway’s endurance was also excellent, and he remained full of energy. After several exchanges, he suddenly realized that the style of combat was similar—that of Truro City.<br/><br/>He retreated a few steps, steadied his body, and said: “You... you are from Truro City...”<br/><br/>Daisy Zane brushed the wrinkles on her sleeves, and chuckled: “You finally recognized me.”<br/><br/>Without giving Thomas Firway time to think further, Daisy Zane launched another attack. Thomas Firway dodged her hand strike, and the distance between them increased. Daisy Zane then raised her leg for a side kick from the right, causing Thomas Firway to dodge to the left.<br/><br/>However, Daisy Zane didn’t fully commit to the kick. Instead, she switched legs and immediately launched another kick from the left.<br/><br/>A feint. Thomas Firway couldn’t dodge in time and was struck in the ribs once again.<br/><br/>His first thought was, ‘It’s over. I’ll have to lie down for another month.’<br/><br/>Michael Jackson, who had been watching from the viewing platform, suddenly leaned forward. However, he quickly realized his overreaction and sat back down.<br/><br/>Kevin Clark noticed his movement and turned to glance at him.<br/><br/>Michael Jackson immediately looked away.<br/><br/>But Thomas Firway was fine, only retreating a few steps because of the kick.<br/><br/>Daisy Zane didn’t continue her attack. Instead, she spoke in a calm tone: “You still haven’t learned your lesson after suffering once.”<br/><br/>Gasping for air, Thomas Firway touched his ribs and looked at her, unable to say a word.<br/><br/>Daisy Zane mocked him again: “What? Have your ribs become sturdier after breaking once? Can you take a beating now?”<br/><br/>Thomas Firway: “......”<br/><br/>Daisy Zane looked at him with oppressive eyes: “If you spread rumors about me again, I won’t show any mercy for Kevin Clark’s and Michael Jackson’s sake.”<br/><br/>Thomas Firway pursed his lips, gazing at her, and said nothing.<br/><br/>She didn’t say anything more either and left the arena.<br/><br/>For two seconds, the entire martial arts arena was dead silent before a thunderous applause erupted.<br/><br/>Kevin Clark had already come down from the viewing platform.<br/><br/>Adrian Roberts and the others also followed, looking at Daisy Zane with even greater respect.<br/><br/>Kevin Clark walked a few steps forward, wiped the sweat off Daisy Zane’s forehead with a handkerchief, and then said: “Madam... maybe you could give them some pointers for a few days?”<br/><br/>Their eyes lit up at the suggestion.<br/><br/>Daisy Zane looked at him: “You really know how to take advantage of free labor.”<br/><br/>“I’ll pay,” Kevin Clark said with a smile.<br/><br/>Daisy Zane scrutinized him and felt that his “payment” wasn’t as simple as it sounded. She dismissed him: “Forget it. I don’t want your payment.”\t\t\t\t\t\t</div>", "images": {}, "success": true}