{"id": 420, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14557349.html", "title": "Chapter 420: 372: Face Scan", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 420: 372: Face Scan</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 420: 372: Face Scan<br/><br/>Translator: 549690339<br/><br/>Black Fox closed in, both sides faced off.<br/><br/>Dark Radiance’s people completely surrounded Daisy Zane to ensure her safety. They even left an escape route.<br/><br/>An escape route<br/><br/>This had never happened before.<br/><br/>Dark Radiance never feared a battle and had never been defeated.<br/><br/>There would never be any escape route.<br/><br/>As both sides faced off, ready to fight at any time, Brother Nine of Black Fox spoke through a megaphone again, “Dark Radiance, I see you’ve got fewer people. Let’s make it fair. One from our side, one from your side, one-on-one. Best two out of three. How about that?”<br/><br/>This was clearly not about the goods they were carrying – they just wanted to fight and challenge Dark Radiance.<br/><br/>Adrian Roberts had never seen such arrogance; blood rushed to his head.<br/><br/>Holding a megaphone, he shouted, “Fight then, less talk. If you won’t fight, get out of the way.”<br/><br/>The sound of this megaphone sounded really expensive.<br/><br/>Sitting inside the car with a computer on her lap displaying a satellite map, Daisy Zane saw the distribution of many forces.<br/><br/>Almost all of them were in motion.<br/><br/>After typing for a while, she confirmed that the people opposite her were indeed Black Fox.<br/><br/>Black Fox: “Heh, you’ve got quite the temper. If you don’t take the chance, when you lose later, you’ll all kneel down and call me ‘Grandfather’.”<br/><br/>Adrian Roberts didn’t respond. He threw away the megaphone, loaded his gun, and prepared to fight.<br/><br/>Black Fox’s people also approached once again.<br/><br/>Once within firing range, the two sides would start fighting.<br/><br/>It was at this moment that Daisy Zane made her move.<br/><br/>“Lady Zane ”<br/><br/>As Daisy Zane got out of the car, Kent Jericho and Michael Jackson immediately followed her.<br/><br/>Kent Jericho said, “Lady Zane, Captain Mason told us not to go forward. We’d better not go. Captain Mason will be angry.”<br/><br/>Michael only silently followed her as she walked forward.<br/><br/>Daisy Zane didn’t stop walking. With both hands in her pocket, she strolled forward as if taking a walk.<br/><br/>Kent, standing beside her, didn’t stop her from walking either. In his anxiousness, he tried to hold her back, but couldn’t find the right way to do it.<br/><br/>He wondered what kind of move he should make to stop her without getting his hand chopped off by Third Master.<br/><br/>In the end, he could only grab her sleeve in desperation<br/><br/>Michael looked at him: ” How old is this child?”<br/><br/>He pulled on her sleeve, Daisy Zane stopped and looked at her sleeve first. Then, she looked at Kent.<br/><br/>Kent awkwardly let go of her as he said, “Lady Zane, please don’t move forward.”<br/><br/>Kent: “?????”<br/><br/>Dark Radiance had already planned the rescue, and then suddenly discovered that Black Fox’s side had all stopped.<br/><br/>“Captain Mason, Black Fox’s side has stopped.”<br/><br/>Just as the words fell, Adrian saw a white flag appearing on a car.<br/><br/>Adrian: “??????”<br/><br/>Everyone in Dark Radiance: “??????”<br/><br/>“What, what’s going on?” someone asked.<br/><br/>Adrian was also puzzled.<br/><br/>The car with the white flag drove over separately.<br/><br/>Adrian immediately changed the rescue plan again: “I’ll drive over to pick them up first, you all be on guard.”<br/><br/>“Yes.”<br/><br/>As Adrian drove over, Black Fox’s car also stopped not far away.<br/><br/>Adrian stopped the car, and Black Fox got out.<br/><br/>Adrian stood in front of Daisy, shielding her behind him. Black Fox jogged forward a few steps, stopped two meters away, stretched his neck out to see Daisy over Adrian.<br/><br/>His face was full of smiles, as if seeing a relative, “Brother Nine, Brother Nine! It’s me, Black Fox.”<br/><br/>Adrian’s fierce expression hesitated.<br/><br/>Michael and Kent looked at Daisy after a moment of hesitation.<br/><br/>Daisy glanced at Adrian’s back and then walked out from his side, looking at Black Fox.<br/><br/>Black Fox took a step forward, full of excitement, “Brother Nine! How long has it been since we’ve seen each other? What are you doing here?”<br/><br/>Adrian was completely dumbfounded, and turned to look at Daisy.<br/><br/>Daisy kept a straight face, looking at Black Fox, and walked forward, “If I kowtow three times to you, will you let me pass?”<br/><br/>Black Fox’s smile stiffened, “No, no, no, Brother Nine, I didn’t know it was you.”<br/><br/>“Kowtow three more times and escort me away?” Daisy continued to walk forward.<br/><br/>“Brother Nine, I wouldn’t dare?” Black Fox wanted to cry.<br/><br/>“One-on-one, best of three,” Daisy continued in a calm voice.<br/><br/>Because of her walking forward, Black Fox kept retreating, “Brother Nine, who can beat you?”<br/><br/>“Losing means kneeling down and calling me Grandfather,” Daisy looked at him.<br/><br/>Her phoenix eyes had a domineering presence, cold and penetrating.<br/><br/>Black Fox’s legs went weak, “Dad, I was wrong, wrong. I didn’t know it was you. Let me kowtow to you twice first.”<br/><br/>As Black Fox was about to kneel, Daisy pulled him up, “Stand up.”<br/><br/>Black Fox stood up, not daring to make a sound.<br/><br/>As for Adrian, Michael and Kent, they were like three human-shaped wooden stakes, standing motionless, even their expressions seemed frozen.\t\t\t\t\t\t</div>", "images": {}, "success": true}