{"id": 422, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14572522.html", "title": "Chapter 422: 374: Settle Down A Bit", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 422: 374: Settle Down A Bit</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 422: 374: Settle Down a Bit<br/><br/>Translator: 549690339<br/><br/>They set out from Shallow Creek.<br/><br/>Daisy Zane got in the car. Michael Jackson helped her close the car door and then got into the copilot seat himself.<br/><br/>However, as Kent Jericho was about to sit in the driver’s seat, he was suddenly pulled back.<br/><br/>Turning around, Adrian Roberts was behind him. “Roberts, Captain Roberts.”<br/><br/>“I will drive this one, you go to another car.”<br/><br/>“Huh?”<br/><br/>“Go,” Adrian Roberts ordered.<br/><br/>Obediently, Kent Jericho glanced at Daisy Zane in the backseat and reluctantly made his way to another car.<br/><br/>Adrian Roberts took the driver’s seat, fastening his seat belt while stating gravely, “That car is not easy to drive, I’ll take this one. Lady Zane won’t mind, right?”<br/><br/>Hearing his deliberately lowered voice, Daisy Zane didn’t expose him: “As you wish.”<br/><br/>Adrian Roberts relaxed and started the car.<br/><br/>There wasn’t much communication amongst them all. For the first time, Adrian Roberts admired a woman enough to willingly serve as her driver. Yet, being a man of few words, he didn’t know how to interact with women.<br/><br/>Otherwise, he wouldn’t still be single after his forties.<br/><br/>Daisy Zane wasn’t much of a talker either. After getting in the car and spending some time on her cell phone, she fell asleep.<br/><br/>Michael Jackson, on the other hand, wasn’t a man of few words, but someone very aware of boundaries. He made his standing very clear and never spoke excessively especially in front of Kevin Clark and Daisy Zane.<br/><br/>Thus, silence reigned amongst the three all the way.<br/><br/>Until, more than an hour later, Daisy Zane’s cell phone rang, breaking the silence in the car.<br/><br/>Moreover, it wasn’t just broken – it became noisy.<br/><br/>Daisy Zane glanced at the unfamiliar number on the phone and answered it, but didn’t put it to her ear.<br/><br/>The next second, Gael Easton’s roar emerged from the phone.<br/><br/>An echo effect as if he was shouting into a loudspeaker.<br/><br/>“You brat! Tell me what you did! What have you done!”<br/><br/>Adrian Roberts glanced in the rearview mirror.<br/><br/>Gael Easton continued yelling, “How dare you! You stole my goods! You stole my goods! And did it with the help of Dark Radiance. You joined forces with an outsider to steal my goods! Since when have you sided with Dark Radiance!”<br/><br/>“As I said, this is for rent and living expenses.”<br/><br/>“I’ve only been living there for a few days, it hasn’t even been a month!”<br/><br/>“Do you know how expensive it is to rent in the Imperial Capital? How valuable the villas in my area are?” Daisy Zane’s tone had a hint of sleepiness.<br/><br/>Gael Easton snorted, “Do you know how valuable that batch of goods was!”<br/><br/>“I know it’s valuable. Otherwise, why would I steal it?”<br/><br/>Michael Jackson chuckled softly, Adrian Roberts gave him a glance. He had a feeling that it was a normal occurrence for this lady to aggravate people.<br/><br/>“You...” Gael Easton ranted, “Since when did you and Dark Radiance get together! You are biting the hand that feeds you!”<br/><br/>Used to his insults, Daisy Zane said calmly, “I am certain that you stand on the side of the outsider.”<br/><br/>“You little brat! Where is your conscience!” Gael Easton shouted louder, “Who was it! Who was it that went to Continent A to rescue you! And then who was it! That gave you utmost care in the M Continent!”<br/><br/>Lazily, Daisy Zane retorted, “I’m certain...you went to Continent A to kill me.”<br/><br/>Adrian Roberts, Michael Jackson:<br/><br/>“And in the M Continent...why did you take care of me, don’t you know? Also...it’s more accurate to say you were ranting than caring.”<br/><br/>But just as she was about to leave, Arthur North grabbed her hand, bent down, leaned in close to her and said, “Little Girl... you’ve been smoking.”<br/><br/>Daisy Zane: How good was his nose? It had been quite a while.<br/><br/>“Not at all.” Daisy Zane lied calmly.<br/><br/>Arthur North looked at her, squinted, and then stood straight looking at Adrian Roberts and the others.<br/><br/>Seeing Arthur North’s gaze on them, Adrian Roberts and others immediately understood his intentions.<br/><br/>Under Arthur North’s oppressive gaze, Adrian Roberts lips moved, about to speak, but then Daisy Zane suddenly turned to look at him.<br/><br/>Adrian Robert’s tongue slipped in his mouth, “No.”<br/><br/>Michael Jackson remained silent, while Kent Jericho also said, “No, no.”<br/><br/>As for James Cooper...James Cooper was completely clueless.<br/><br/>The others who were in the know also shook their heads in negation.<br/><br/>Daisy Zane withdrew her gaze, fairly satisfied with their responses.<br/><br/>Hearing their answers, after some time, Arthur North let out a light laugh.<br/><br/>Everyone lowered their heads, their hearts pounding wildly.<br/><br/>But Arthur North didn’t say anything, he just looked at Daisy Zane and laughed, “Madam has a fast knack for winning people’s hearts.”<br/><br/>Daisy Zane’s eyebrows and eyes lifted, cool and calm, “Isn’t that what Third Master expected?”<br/><br/>Arthur North’s eyebrows twitched slightly, indeed it was within his expectations.<br/><br/>Allonzo Hobson chortled, watching the two of them.<br/><br/>“I’ll rest, you chat.” Daisy Zane said.<br/><br/>Arthur North took her bag from Michael Jackson’s hands and said, “Together, let them wait for a while.”<br/><br/>Daisy Zane:<br/><br/>Adrian Robert: “I have to keep an eye on the truck over there.”<br/><br/>Kent Jericho: “I have to help.”<br/><br/>Michael Jackson: “I have to clean up.”<br/><br/>James Cooper, seeing all of them have left, confused: “Um, um... I, I...”<br/><br/>After mumbling for a long time, James Cooper didn’t come up with anything, turned his head and ran off straight away.<br/><br/>“They’re all busy.” Arthur North said.<br/><br/>Daisy Zane:<br/><br/>There is a villa near the heliport, Arthur North took Daisy Zane back to the room, as soon as they entered, he pushed her against the wall and kissed her.<br/><br/>A gentle kiss, filled with longing.<br/><br/>“You still claim you haven’t smoked.”<br/><br/>The room was dark without any lights on. Their senses were being magnified infinitely in this darkness.<br/><br/>Arthur North’s deep voice was right next to her ear, totally beguiling.<br/><br/>Daisy Zane lowered her gaze, pursed her lips, “Just one.”<br/><br/>“No smoking during your menstrual period.” Arthur North said, “Otherwise... be careful, I’ll lose my temper.”<br/><br/>Daisy Zane chuckled, clearly not paying attention to his threat.<br/><br/>“I mean losing my temper in bed.” Arthur North whispered in her ear after a gentle kiss.<br/><br/>Daisy Zane: “...calm down.”<br/><br/>Arthur North held her in his arms, tightened his arm, buried his face in her neck, and said gently, “Alright, Madam.”\t\t\t\t\t\t</div>", "images": {}, "success": true}