{"id": 424, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14573198.html", "title": "Chapter 424 - 376: Don’T Mess With Me", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 424 - 376: Don’T Mess With Me</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 424: Chapter 376: Don’t Mess with Me<br/><br/>Translator: 549690339<br/><br/>On the day they returned to Dark Radiance from the heliport, it was the training selection competition of Dark Radiance.<br/><br/>It was held directly in the martial arts arena at the Dark Radiance Base.<br/><br/>The martial arts arena was overall round-shaped. The upper part was the viewing platform, and the lower part was the fighting arena.<br/><br/>All the participating candidates had already been screened several times, and even if they were eliminated again in this competition, they could still stay in Dark Radiance.<br/><br/>However, they were not allowed to participate in the next stage of training.<br/><br/>The next stage of training might not only be confined to the Mountain Sea Continent but also include actual combat.<br/><br/>In the end, those selected would be under the command of Yoshua Archer and Edward Darkmoon.<br/><br/>And those who continue to be eliminated can also stay in Dark Radiance.<br/><br/>So they could compete in the Dark Radiance Base and also see Harton Clark.<br/><br/>Before the competition started, Harton Clark casually said a few words, and within less than a minute, he announced the start of the competition.<br/><br/>Then he went to the stands, accompanied by Daisy Zane.<br/><br/>After Harton Clark sat down, he peeled pistachios for Daisy Zane and said, “The competition format is quite simple. We’ll draw lots to decide who will face each other.”<br/><br/>Daisy Zane ate the pistachios and looked down, nodding, “Thomas Firway is also down there.”<br/><br/>“Yes,” Harton Clark said, “In addition to the drawing of lots to determine opponents, they can choose to challenge Thomas Firway directly. If they defeat Thomas Firway, they can skip all subsequent training and directly enter the 13th Hall.”<br/><br/>Daisy Zane did not ask about the 13th Hall.<br/><br/>After all, it belonged to Dark Radiance’s internal affairs, and she did not intend to inquire too much.<br/><br/>However, Harton Clark took the initiative to tell her, “Adrian Roberts has twelve halls under him, each of which is responsible for different matters of Dark Radiance. The 13th Hall is directly commanded by me, and everything is reported directly to me. The hall is filled with assassins selected through the previous selections.”<br/><br/>Daisy Zane looked at Harton Clark, “Is Thomas Firway in the 13th Hall?”<br/><br/>“Yes.”<br/><br/>Daisy Zane nodded and did not say more. Thomas Firway’s skills were indeed good. Of course...don’t compare him to her.<br/><br/>As the competition began, Daisy Zane watched quietly.<br/><br/>After a while, she heard some movement behind her and turned her head to look.<br/><br/>She saw Adrian Roberts and Kent Jericho, along with a few others who had transported goods with them, quietly sitting behind her.<br/><br/>Kent Jericho smiled softly and said, “Lady Zane.”<br/><br/>Adrian Roberts, on the other hand, respectfully nodded at her.<br/><br/>Daisy Zane looked at each of them, greeted them, and then looked back down.<br/><br/>Meanwhile, Harton Clark glared at them one by one.<br/><br/>If it were usual, they would have been frightened and run away long ago.<br/><br/>But now, with Daisy Zane present, they all became braver. They subconsciously felt that Daisy Zane was their protective shield, able to block Harton Clark.<br/><br/>But suddenly, Siera Santiago reached out and stopped her.<br/><br/>“What’s the hurry?” Siera Santiago looked at her contemptuously. “Are you afraid of being beaten when you come out? Are you looking for Third Master to protect yourself?”<br/><br/>Daisy Zane stopped and looked at her.<br/><br/>“Daisy Zane, you really have a way of making Third Master Clark head over heels for you,” said Siera Santiago. “Even a person as important as his brother would be punished for a word from you.”<br/><br/>Daisy Zane let her speak.<br/><br/>However, the more silent Daisy Zane was, the more aggressive Siera Santiago became and hurled abuses: “A woman with a beautiful appearance is indeed a weapon. But how long can a skin-deep beauty last? Even the most beautiful things will get tired of it someday.”<br/><br/>“So?” Daisy Zane said indifferently.<br/><br/>“So...how long do you think you can win Harton Clark’s love with just this skin-deep beauty?” Siera Santiago sneered. “Good for nothing. Not only can you not help him in any way, but you also drag him down in many aspects. How long do you think he’ll be annoyed with you?”<br/><br/>After she said this, Daisy Zane raised the corner of her mouth, and a flash of ruthless determination crossed her eyes.<br/><br/>In the next moment, she took action.<br/><br/>Siera Santiago immediately reacted, raising her hand to block.<br/><br/>However, Daisy Zane instantly opened her hand, grabbed her throat, and dragged her to the railing.<br/><br/>Siera Santiago felt her strength and the speed of her attack.<br/><br/>Her other hand counterattacked immediately.<br/><br/>Daisy Zane effortlessly pressed down the counterattacking hand, gripped Siera Santiago’s throat, and pushed half of the girl’s body over the railing.<br/><br/>Factoring in the height of the Martial Arts Arena, the drop is about three stories high from their position.<br/><br/>“Daisy Zane!” Siera Santiago shouted at the height.<br/><br/>Not exerting much force with the hand gripping her throat, Daisy Zane laughed and said, “Where’s your brain? If Harton Clark really brought a good-for-nothing woman, would he bring her to the Dark Radiance?”<br/><br/>Siera Santiago stared at her in terror.<br/><br/>“So in your hearts, Harton Clark is just a lecher,” said Daisy Zane.<br/><br/>Now it was Siera Santiago’s turn to fall silent.<br/><br/>Daisy Zane looked at her and said, “Don’t provoke me, or I’ll really throw you down from here.”<br/><br/>Siera Santiago blinked.<br/><br/>Daisy Zane let her go and turned to walk downstairs.<br/><br/>Clinging to the railing with one hand and touching her throat with the other, Siera Santiago watched Daisy Zane’s retreating figure until it disappeared. She regained her senses and muttered, “I... I’m injured. Otherwise... otherwise... I wouldn’t be defeated so quickly by you!”<br/><br/>Although they hadn’t really sparred, she knew she couldn’t win.<br/><br/>However, she surely could have lasted longer without the injury.<br/><br/>Siera Santiago stood there for a while before looking down.<br/><br/>It’s so high.<br/><br/>Then she touched her throat again.<br/><br/>This woman’s hand... is so cold.\t\t\t\t\t\t</div>", "images": {}, "success": true}