{"id": 426, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14574364.html", "title": "Chapter 426: 378: Attacking Dark Radiance", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 426: 378: Attacking Dark Radiance</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 426: 378: Attacking Dark Radiance<br/><br/>Translator: 549690339<br/><br/>The selection competition’s next day.<br/><br/>When Daisy Zane woke up in the morning, Kevin Clark had already been up for almost three hours.<br/><br/>She worked late into the night revising the script. Finally, Kevin Clark forcefully tucked her into the blanket. Only then did she go to bed.<br/><br/>She lay in bed a while longer, checked the time, and decided to stay at the Hundred Demons Pavilion for a few days.<br/><br/>After washing and rinsing, she descended the stairs and just as she reached the living room, she heard the commotion outside.<br/><br/>Curious, she stepped outside to see what was happening.<br/><br/>Adrian Roberts, James Cooper, Michael Jackson, and a few of the hall masters were standing on the steps while Thomas Firway was sitting there, clinging to Michael’s leg and howling.<br/><br/>“You guys are not fair, you knew everything but didn’t tell me!” Thomas Firway complained, “Because of you, Third Master ignored me all day. While you were all enjoying your time in the Imperial Capital, Third Master left me in the Mountain Sea Continent, forbidding me to step into Imperial Capital.”<br/><br/>Adrian Roberts was speechless, “Whose fault is that? Everyone could see it but you were the only one clueless. What? Have you been forced to eat tree bark here every day?”<br/><br/>“How was I to know if no one told me?”<br/><br/>James Cooper: “We all found out on our own.”<br/><br/>“I don’t care, I blame you all.” Thomas Firway was clinging to Michael’s leg, “And you, you also conspired with them to deceive me.”<br/><br/>Michael Jackson:<br/><br/>“How could you blame us?!” Adrian Roberts retorted, “If not for your rumors about Lady Zane being just a pretty face, would we have initially had any doubts about her? We haven’t even complained about how Third Master gave all of us the cold shoulder because of you. Yet you still blame us.”<br/><br/>James Cooper nodded in agreement, “Miss Santiago is still having difficulty walking, isn’t she?”<br/><br/>“Michael, they’re scolding me.” Thomas Firway protested.<br/><br/>Michael Jackson: “...he’s still young...”<br/><br/>“He’s well into his twenties, how is he young?” proclaimed Adrian Roberts, “Being young justifies his foolishness?”<br/><br/>Thomas Firway clung to Michael’s leg, pouting, and hung his head without saying a word.<br/><br/>After a quiet moment, Thomas Firway abruptly asked, “Do you think she’ll still talk to me if I approach her?”<br/><br/>Adrian Roberts deliberately said, “I don’t think so.”<br/><br/>James Cooper: “The chances aren’t great.”<br/><br/>Thomas Firway was even more dispirited. He shook Michael’s leg, “Michael, please plead my case.”<br/><br/>“I? I don’t have that kind of influence.” Michael Jackson looked downward at his own hair.<br/><br/>“You do.” Thomas Firway gloomily said, “Yesterday, she only showed mercy to me for Third Master’s and your sake.”<br/><br/>Michael stared blankly for a moment and then blinked.<br/><br/>Daisy Zane watched Thomas Firway, who was curled up and clinging to Michael, and slightly narrowed her eyes. She had this feeling that she had seen him somewhere before.<br/><br/>She said, “I don’t think there’s much of a chance either.”<br/><br/>Everyone nodded in agreement, only realizing it was Daisy Zane’s voice after they had done so.<br/><br/>Everyone immediately turned to look at her, and Thomas Firway quickly straightened up from the steps.<br/><br/>“Lady Zane.” Everyone greeted respectfully.<br/><br/>“Or...five days?”<br/><br/>Kevin:<br/><br/>Daisy laughed, she was never so lenient to Charles Amos: “Three days.”<br/><br/>Although Kevin thought that was too long, he didn’t say anything. He just said, “Take care and be careful about everything.”<br/><br/>“Hmm, you too.”<br/><br/>“Little girl, everything should be based on your will. If you don’t want to do it, don’t.” Kevin said, “Dark Radiance is never afraid to fight and will always be by your side. Even if the opponent is Hundred Demon Pavilion.”<br/><br/>Daisy knew that Kevin would associate her with the Hundred Demons Pavilion.<br/><br/>He said those words because he was worried the Master of the Pavilion might ask her to do something she didn’t want to.<br/><br/>If she didn’t want it, she wouldn’t do it.<br/><br/>He was ready to rescue her from the Hundred Demon Pavilion and protect her fully.<br/><br/>Such touching words, but a pity... the Pavilion Master was herself, so this sentence... seemed to be taken as a challenge.<br/><br/>Daisy stayed quiet for two seconds and then chuckled, “Sure. Don’t worry.”<br/><br/>Managed under Luke, the Hundred Demons Pavilion has always been working smoothly.<br/><br/>There were very few things that Daisy needed to worry about.<br/><br/>Daisy came back this time mainly to check on the Hundred Demons Pavilion and Luke.<br/><br/>She was here to solve the problems Luke hadn’t been able to handle, if there were any.<br/><br/>There was now another task at hand, which was to investigate the unknown powers.<br/><br/>Damian Brown and Samuel Gray had both returned and were going out every day.<br/><br/>Dark Radiance was also working on this same matter. They have run into each other more than once.<br/><br/>But after they met, they all pretended not they hadn’t seen each other and separated.<br/><br/>It wasn’t until Daisy’s second night at the Hundred Demons Pavilion that Samuel Gray returned with news.<br/><br/>He found that the Thousand Mountain Alliance had dealings with a group of unidentified powers. It could not be confirmed whether this was the force that had previously taken action.<br/><br/>However, the Thousand Mountain Alliance made a move that night and was heading towards the Savage Mountain.<br/><br/>Savage Mountain is a complex and sparsely populated place that very few people enter.<br/><br/>It is easy to get trapped there and the mountain has venomous snakes.<br/><br/>Hearing the news, Luke was also a bit surprised, “What are they going there for?”<br/><br/>Daisy’s expression cooled: “Dark Radiance has taken some people there for training.”<br/><br/>She had seen Dark Radiance’s training plan; after the selection match, they were to rest for a day and then proceed to Savage Mountain.<br/><br/>“They want to target Dark Radiance,” Luke replied, frowning.<br/><br/>Daisy immediately walked towards the Weaponry Storehouse: “Get a team together. Follow me.”<br/><br/>“You’re going to go there yourself, Boss?”<br/><br/>“Hmm.”\t\t\t\t\t\t</div>", "images": {}, "success": true}