{"id": 428, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14575888.html", "title": "Chapter 428: 379 New Moon_2", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 428: 379 New Moon_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 428: 379 New Moon_2<br/><br/>Translator: 549690339<br/><br/>But Daisy Zane found cover faster and managed to hide with him first.<br/><br/>“Where are the people involved in the selection?” Daisy Zane asked him again when he remained silent.<br/><br/>Thomas Firway snapped back to reality: “They didn’t come.”<br/><br/>Daisy Zane’s eyebrows twitched ever so slightly.<br/><br/>“There’s a mole among the people involved in the selection,” Thomas Firway said, “Third Master had discovered it earlier, so... he planned accordingly. The selectees are all still at Dark Radiance Base. The mole has been caught.”<br/><br/>Lure the enemy into the pot.<br/><br/>Daisy Zane pursed her lips faintly.<br/><br/>Kevin Clark was truly Kevin Clark.<br/><br/>It was thought to be a move against Dark Radiance, but it was actually Dark Radiance’s ploy all along.<br/><br/>“Lady Zane, why are you at Hundred Demons Pavilion?”<br/><br/>Daisy Zane glanced at him but did not answer. Instead, she said, “I’m going to find Kevin Clark. You...”<br/><br/>“I’ll go with you,” Thomas Firway immediately said, “The 12th Hall Master is here too. I was just about to go to Third Master.”<br/><br/>Thomas Firway followed Daisy Zane, once again admiring her exceptional skills as they fought their way across.<br/><br/>Even though everything was under Dark Radiance’s control, the strength of Thousand Mountains was formidable and the unidentified enemies were all powerful fighters with plenty of experience.<br/><br/>As a result, the battle between the two sides was extremely intense for a time.<br/><br/>Daisy Zane and Thomas Firway eventually saw Kevin Clark, but they couldn’t get very close to him.<br/><br/>The two of them took position on a mountain slope, switching out the people manning the guns.<br/><br/>“Lady Zane, aren’t you going to find Third Master?” As he spoke, Thomas Firway took aim and shot an enemy.<br/><br/>For a moment, it felt like she was two people; one was shocked at the truth, the other was fighting.<br/><br/>Quickly, she found the shooter and took aim.<br/><br/>The wolf, identified as Silver Palace, continued to chase after enemies.<br/><br/>In the midst of the chaotic gunfire, Daisy Zane heard Kevin Clark yelling, “Silver Palace! Come back!”<br/><br/>In such a distance, it should have heard him, but it didn’t return.<br/><br/>Silver Palace demonstrated astounding combat efficiency, the number of guns aiming at it increased. Daisy Zane did her best to provide covering fire.<br/><br/>Unfortunately, a bullet grazed Silver Palace’s hind leg.<br/><br/>With its nimble reaction, Silver Palace suffered a glancing blow. A preliminary judgement showed it probably didn’t hit the bone.<br/><br/>But the pain in its hind leg caused Silver Palace to tumble down the slope.<br/><br/>Thomas Firway cursed under his breath.<br/><br/>Daisy Zane immediately threw down her gun and leaped down the slope from another side.<br/><br/>“Lady Zane!”<br/><br/>Thomas Firway wanted to follow her but knew that providing cover fire was the best choice at that moment, so he stayed put and provided cover for Daisy Zane’s advancement.<br/><br/>Simultaneously, Kevin Clark was leading Yoshua and Edward towards that side.<br/><br/>One reason was because of Silver Palace, and another was because their main targets were there.<br/><br/>Since they were here today, neither Thousand Mountains nor the unidentified forces could escape.<br/><br/>Daisy Zane sprinted at an incredibly fast speed towards that direction.<br/><br/>She ruthlessly attacked any enemy she encountered along the way.<br/><br/>She struck with a force and speed far surpassing her earlier efforts. Despite bullets flying around her, she didn’t flinch, not even slightly.\t\t\t\t\t\t</div>", "images": {}, "success": true}