{"id": 439, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14578923.html", "title": "Chapter 436 - 386: He Doesn’T Understand", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 436 - 386: He Doesn’T Understand</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 436: Chapter 386: He Doesn’t Understand <br/><br/>Translator: 549690339 <br/><br/>Due to minor stomach bleeding, Kevin had to be extra careful with his diet. <br/><br/>So after he woke up, James went to ask the specially invited recuperating team from the domestic to cook for him. <br/><br/>When he took the meal over to him, he saw three sullen figures sitting outside the door. They all looked depressed. <br/><br/>The shock of his brother who once fought alongside him turning into a woman and becoming, his own boss’s wife was already massive. <br/><br/>And on top of that, they also encountered... <br/><br/>Even though they all had good psychological quality, it was still a bit hard for them to bear at this moment. <br/><br/>“What are you guys doing here?” <br/><br/>The three of them looked up at him but no one spoke. <br/><br/>James glanced at the confusion in their eyes, feeling inexplicable. <br/><br/>Ignoring the three of them, James knocked on the door. After waiting for a bit, he pushed it open and entered. <br/><br/>Thomas Firway watched his knocking action... <br/><br/>Didn’t he have long arms? Why didn’t he knock just now? <br/><br/>After James went in, and not coming out again, the three of them immediately got up and followed him inside. <br/><br/>“Third Master, have something to eat.” As James spoke, he placed a small table on the bed and then placed the food on it one by one. <br/><br/>Not only was there food for Kevin, but also for Daisy. <br/><br/>James had brought Daisy her breakfast earlier in the day, but when he saw that she hadn’t eaten, he thought it must have gone cold, so he brought her a new set as well. <br/><br/>After everything was set, James looked at Kevin for a moment. Suddenly noticing his broken lips, he blurted out, “Third Master, what happened to your lips?” <br/><br/>The three people behind him all looked at Kevin’s lips. <br/><br/>His lower lip was cracked, and it was a little swollen. <br/><br/>After the four of them finished examining his lips, they all involuntarily looked at Daisy. <br/><br/>This wife...is quite fierce, huh? <br/><br/>Daisy first glanced at Kevin, who had a smile in his eyes, then looked up at the four of them. <br/><br/>Her gaze seemed to say: What are you looking at? <br/><br/>It also seemed to say: You know too much, she’s going to kill off the witnesses. <br/><br/>Thomas Firway averted his gaze first. <br/><br/>James realized belatedly that he’d been too quick to speak. He coughed lightly and said, “Third Master, Lady Zane, enjoy your meal. I’ll be right outside if you need me.” <br/><br/>He left without saying another word. <br/><br/>The other three didn’t say a word and followed him out. <br/><br/>It wasn’t until they were gone that Daisy finally withdrew her gaze. <br/><br/>Kevin pinched her fingers and said, “Go back to Dark Radiance and rest after we finish eating.” <br/><br/>“There’s no need,” Daisy said. “There’s a bed here, it’s just as good for resting.” <br/><br/>“Little Girl...” <br/><br/>“Alright,” Daisy said, “I’ll make time for it. What kind of gift do you want?” <br/><br/>“Isn’t it obvious?” Olivia replied. “Anything but the banners, just as long as you show up.” <br/><br/>“Okay.” <br/><br/>After hanging up, Daisy finally started eating. <br/><br/>Kevin served her some food: “The Lane family holds a charity auction on Olivia’s birthday every three years. Outsiders only know about the charity auction every three years but don’t know it’s Olivia’s birthday on that day.” <br/><br/>Hosting the charity auction was like offering a blessing to Olivia. <br/><br/>It was enough for the family to know that, and there was no need for it to go public. <br/><br/>That’s why it was never announced. <br/><br/>Daisy replied, “It must be quite lively that day.” <br/><br/>“Yes,” Kevin said, “A rare large-scale socializing opportunity.” <br/><br/>“Do you go back for Olivia’s birthday every year?” <br/><br/>Kevin shook his head: “Occasionally.” <br/><br/>Daisy nodded: “I suppose you go to Charlotte’s birthday every year?” <br/><br/>Caught off guard, Kevin choked: “Not really.” <br/><br/>He indeed had not attended Charlotte’s birthday during the early years of starting the Easton Group. So... it wasn’t a lie. <br/><br/>“Don’t get worked up. I didn’t say anything else,” Daisy said calmly. <br/><br/>Kevin felt his heart skip two beats. This was even more terrifying than saying something else: “My lady, she’s just my niece. She’s no different in my heart than Lily. To me, she’s just a junior relative.” <br/><br/>Daisy raised her eyebrows: “Third Master, if you explain further, it means you’re guilty.” <br/><br/>Kevin immediately shut up, took a big bite of food, and stuffed his mouth. <br/><br/>Daisy raised the corner of her mouth. <br/><br/>Meanwhile, in the Imperial Capital. <br/><br/>William felt that Olivia became much happier after talking on the phone with Daisy. <br/><br/>Watching Olivia humming a tune while going upstairs, William narrowed his eyes. <br/><br/>A 745 score that she casually mentioned to him, how come she was so happy after telling an outsider? <br/><br/>When did his sister open up to an outsider? <br/><br/>Kevin’s wife... <br/><br/>Was it possible that she casts spells on people? <br/><br/>Why did everyone who got close to her end up liking her? <br/><br/>When Xavier mentioned her, his words were full of admiration and respect. Hugo praised her as well. <br/><br/>Kevin? He practically blossomed! <br/><br/>And his sister... his sister made him feel as if she was being taken away from him. <br/><br/>Was it worth it? <br/><br/>All for a woman? Was it worth it? <br/><br/>He couldn’t understand it, not for a million reasons.\t\t\t\t\t\t</div>", "images": {}, "success": true}