{"id": 436, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14578142.html", "title": "Chapter 433 - 383: Treason And Crime", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 433 - 383: Treason And Crime</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t433 Chapter 383: Treason and Crime <br/><br/>After returning to their home country, both Kevin Clark and Daisy Zane had been busy. <br/><br/>Kevin was running between the Research Institute and Imperial Capital. <br/><br/>Daisy was either in Imperial Capital University's laboratory or discussing the script with Assistant. <br/><br/>They discussed a plot point that might not make it through review so much that their draft was almost worn out. <br/><br/>Within a week, they saw each other only twice. <br/><br/>After spending more than a week completing things at both institutions, Kevin finally managed to free up half a month. Gét latest novel chapters on nov(e)lbj/n(.)c/om<br/><br/>Everything was settled that evening and he returned to the Rose Garden. <br/><br/>However, Daisy didn't come back. <br/><br/>Since he had handed over the Research Institute affairs, Daisy had become busy. <br/><br/>Daisy could have gone home that evening, but after being notified by Assistant, she couldn't leave. <br/><br/>Thus, Kevin didn't see her, but he decided not to go find her - instead, he called her. <br/><br/>\"I have some matters to deal with and might be away from the country for more than half a month.\" Kevin said after chatting with Daisy for a while. <br/><br/>\"Is it about the 319 project?\" Daisy asked, her cell phone on another experimental table on speaker mode. <br/><br/>\"It's something else.\" Kevin said, \"It's not a big issue, but it'll take a longer time to deal with.\" <br/><br/>Daisy glanced at her experiment, which wouldn't be done anytime soon, and gave up on the idea of seeing him: \"Hmm, take care.\" <br/><br/>\"Alright.\" Kevin's voice held a smile, \"By the time I return, you will probably be joining the drama crew.\" <br/><br/>\"Probably.\" <br/><br/>When she first had a rough idea for the script, Daisy had discussed it with Assistant. <br/><br/>They completed all the preparatory work for production, costumes, and other aspects during the time she was writing the script. <br/><br/>Moreover, Georgia Dunn was cast as the male lead, and she was the female lead. <br/><br/>Apart from the boy Daisy found to record the show alongside her, the remaining supporting roles were all found by Assistant from previous colleagues. <br/><br/>Thus, they didn't have to go through the casting process. <br/><br/>Assistant put a lot of effort into the entire production, and they didn't use any newcomers for the cast. <br/><br/>This movie was intended to earn Daisy an award, so no aspects could be lacking - they needed refinement and precision. <br/><br/>As soon as Daisy's script was perfected, the subsequent matters would be handled swiftly. <br/><br/>\"We'll meet at the drama crew then.\" Daisy said. <br/><br/>Kevin laughed: \"Alright.\" <br/><br/>\"It was my Lady.\" <br/><br/>After the uninformed attendees understood what he was saying, they were shocked to their core. <br/><br/>Their entire bodies felt numb, as if they had been electrocuted. <br/><br/>\"Dark Radiance has rules. Those who break the rules must be punished.\" Kevin's calm voice conveyed an oppressive feeling, \"Treason carries a penalty of 24 hours in the Discipline Hall.\" <br/><br/>\"Big Boss.\" Adrian, who had finally come to his senses, said, \"There's no need. Martin's current status doesn't constitute treason; the charge doesn't hold. What... punishment are you talking about?\" <br/><br/>Edward also chimed in, \"Yes, Big Boss. Although Martin is powerful, the Discipline Hall can maim or even kill him.\" <br/><br/>Only if the punishment was severe and threatened one's life would people be deterred from betraying the organization. <br/><br/>This was the intention behind the establishment of the punishment for treason. <br/><br/>\"Rules aren't decorations.\" Kevin said solemnly, \"She is my Lady. As husband and wife, we are one. In the Discipline Hall, I will take her place.\" <br/><br/>Now everyone was even more agitated. <br/><br/>\"Third Master...\" <br/><br/>\"Big Boss...\" <br/><br/>But Kevin glanced at them, causing them to hold their tongues. <br/><br/>He simply and quickly explained what had happened before saying, \"That's it. Dismissed.\" <br/><br/>No one moved. <br/><br/>No one had ever been able to sway Kevin's decisions before. <br/><br/>What's more, this time he was setting an example for Dark Radiance's higher and lower-ranking members. <br/><br/>He was demonstrating that rules were rules and no one could break them - not even his own wife. <br/><br/>Rules were not decorations. <br/><br/>He knew that if he hadn't mentioned it, Yoshua and Edward would have helped cover it up for him. <br/><br/>But... he wanted everyone to genuinely submit and be treated equally. <br/><br/>Everyone couldn't say anything; they could only follow Kevin to the entrance of the Discipline Hall. <br/><br/>After Kevin entered, everyone stayed outside for a while longer. <br/><br/>\"Third Master... will he be okay?\" <br/><br/>\"With Big Boss's skills... he should be fine for 24 hours.\" <br/><br/>\"Let's get a doctor on standby anyway.\" Adrian thought for a moment before saying, \"The Master of the Discipline Hall will stay here. The rest can return to their usual duties.\" <br/><br/>Everyone remained silent as they left... <br/><br/>...\t\t\t\t\t\t</div>", "images": {}, "success": true}