{"id": 437, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14578150.html", "title": "Chapter 434 - 384: Going To Mountain Sea Continent Again", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 434 - 384: Going To Mountain Sea Continent Again</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 434: Chapter 384: Going to Mountain Sea Continent Again<br/><br/>Translator: 549690339<br/><br/>Even though the punishment was supposed to be for twenty-four hours, Kevin had been in the Discipline Hall for more than forty hours without coming out.<br/><br/>He even locked the Discipline Hall from the inside.<br/><br/>They could not open the lock from the outside, and the lock outside seemed to be completely useless.<br/><br/>Thomas Firway and his men couldn’t get in, so they planned to break the door forcibly from the outside. But suddenly, Kevin’s voice came from inside, telling them not to interfere.<br/><br/>With his command, they dared not move.<br/><br/>Moreover, the material and structure of the Discipline Hall were special, so the probability of them forcibly breaking in was not high.<br/><br/>Everyone outside did not know what was going on inside. All they could know was that there were still vital signs inside.<br/><br/>“It’s been more than forty hours. If it continues like this, big boss might be in danger.”<br/><br/>“Twenty-four hours is already life-threatening enough.”<br/><br/>“What should we do? He won’t come out and won’t let us interfere.”<br/><br/>Everyone fell silent, staring at the door of the Discipline Hall.<br/><br/>They had always obeyed his orders, and the rest of the things....<br/><br/>Inside the Discipline Hall was an immense, fully intelligent building.<br/><br/>All the operations inside were done intelligently, which meant all the punishments inside were devoid of any human emotions.<br/><br/>Whatever was set would be executed precisely.<br/><br/>It could be as cruel as it wanted to be.<br/><br/>Kevin sat on the ground, leaning against the wallside with one leg bent. His forehead was covered with sweat beads, and his broken hair was damp.<br/><br/>His narrow eyes were filled with vicious redness.<br/><br/>His sleeve was folded up, revealing a small arm filled with bruises and wounds.<br/><br/>His black clothes were also damaged. However, because of the dark color, the blood stains were not very noticeable.<br/><br/>He gasped heavily, opened an ampoule, and used a syringe to draw out the medicine and injected it into his own arm.<br/><br/>It was a medicine that could sustain his physical strength even if he did not eat or drink.<br/><br/>The twenty-four hours was meant to give an explanation to Dark Radiance.<br/><br/>As for not coming out, it was because he was too heartbroken for his little girl, and he did not know how to ease his heartache.<br/><br/>During these days, he kept recalling the events of nearly a year.<br/><br/>The river had thin ice in winter when he threw so many people into it. He even once held people under the water in the river.<br/><br/>Over and over again, they tested their physical and psychological limits.<br/><br/>Almost all conceivable experiences were encountered.<br/><br/>Martin Hanzel and the other three had undergone life and death training to come out alive.<br/><br/>There was also mental training and drug tolerance training.<br/><br/>How could she have believed Kevin Clark’s lies? She should have thought of it long ago.<br/><br/>And even after time had passed, Kevin Clark still didn’t come out... It was probably because of her too.<br/><br/>All those experiences were voluntary, and if she could be where she is today, it was all thanks to Kevin Clark.<br/><br/>But the two people treated this matter from different standpoints.<br/><br/>She was full of gratitude. But all Kevin Clark had was guilt and heartache.<br/><br/>When they arrived at Dark Radiance, Daisy Zane headed straight for the Discipline Hall.<br/><br/>When she faked her death and betrayed them, they didn’t know about Dark Radiance or the Discipline Hall. At that time, betrayal meant death.<br/><br/>There weren’t so many twists and turns then.<br/><br/>“Lady Zane.”<br/><br/>“Martin.”<br/><br/>Everyone was surprised for a moment, and then looked at Daisy Zane as if they had seen the savior.<br/><br/>Daisy Zane watched Adrian Roberts and the others trying to break the door, making it all flowery. There were also hackers trying to crack it.<br/><br/>If she had known that the Discipline Hall was an intelligent building that could be hacked, she would have paralyzed it while still in the country.<br/><br/>“How is he?” Daisy Zane asked in a deep voice.<br/><br/>“Not quite sure, but we can only detect that there are still vital signs.” Edward Darkmoon said, “You can talk to the inside from here.”<br/><br/>Daisy Zane went straight over, pressed the call button, and said coldly: “Kevin Clark, open this door within three seconds. Once I hack it and get in, it will be troublesome.”<br/><br/>Edward Darkmoon was closest to her, and he hadn’t clearly transitioned his identity. Hearing her talk to his boss like this, his body hair stood up.<br/><br/>As soon as her voice fell, the door sounded, and the lock opened.<br/><br/>Everyone: “!!!!!!!!”<br/><br/>Daisy Zane was the first one to enter the Discipline Hall. After seeing the equipment inside, her heart trembled for a moment.<br/><br/>Kevin Clark was standing in front of the equipment, barely able to stand even with the support of something nearby.<br/><br/>There was no better way to describe Kevin Clark than ‘covered in wounds.’<br/><br/>Daisy Zane took a gentle breath, walked up to him, and put his arm over her shoulder. As soon as she did, Kevin Clark involuntarily pressed down on her.<br/><br/>Daisy Zane steadied him, not planning to help him outside.<br/><br/>Because the doctors outside were coming in.<br/><br/>“Little Girl, why are you here?” Kevin Clark’s voice was hoarse and weak.<br/><br/>Daisy Zane didn’t answer him.<br/><br/>Kevin Clark leaned against her: “Don’t worry, I’m fine. I know my limits.”<br/><br/>Daisy Zane still didn’t answer him. She and the doctor put him on a stretcher together.<br/><br/>When Yoshua, Adrian Roberts, and the others came in, the first thing they saw was Kevin Clark, and the second thing they saw were the bloodstains all over the floor of the Discipline Hall.<br/><br/>There were different colors, some dried up, and some fresh.<br/><br/>Especially seeing Kevin Clark’s wounds all over his body, they all seemed to have developed aphasia, and no one could speak.\t\t\t\t\t\t</div>", "images": {}, "success": true}