{"id": 438, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14578922.html", "title": "Chapter 435 - 385: Is This The Restraint You’Re Talking About?", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 435 - 385: Is This The Restraint You’Re Talking About?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 435: Chapter 385: Is this the restraint you’re talking about? Diiscover new stories at novelhall.com<br/><br/>Translator: 549690339 <br/><br/>Kevin Clark’s injuries were too severe; his skin was bruised, and there were multiple wounds, some deep and some shallow. <br/><br/>The left forearm bone had a fracture. <br/><br/>Due to the heavy impact, his liver was bruised. There was also some minor bleeding in the stomach. <br/><br/>The injuries were very serious, and he needed a good recuperation. Otherwise, it could lead to some permanent injuries and complications. <br/><br/>Exhausted from mental and physical strain, he had been unconscious for three days and nights since leaving the operating room. <br/><br/>During this time, Daisy Zane had been staying with him in the hospital. <br/><br/>She had been personally in charge of changing and applying medicines to his wounds. <br/><br/>“Lady Zane, you should go back and rest. We’ll take care of things here,” said James Cooper. <br/><br/>“I’m fine,” she replied. <br/><br/>James watched her caring for Kevin. <br/><br/>Ever since Daisy arrived at Dark Radiance and saw Third Master in such a condition, she tamed down her usual demeanour by not crying, not making a fuss, and barely talking. Besides the oppressive, gloomy and hostile atmosphere that surrounded her, her reactions appeared too calm. <br/><br/>So calm that they hardly experienced her love for Third Master. <br/><br/>In fact, after Third Master was brought out of the operating room and the doctor informed them of his condition, she asked if they could paralyze him. <br/><br/>This frightened the doctor, who thought she was some sort of terrorist trying to harm Third Master. <br/><br/>However, she remained by his side throughout the three days, handling everything personally. <br/><br/>“Lady Zane, here’s breakfast,” James said as he placed the breakfast tray down. <br/><br/>“Alright, I’ll eat in a bit.” <br/><br/>As Daisy was wiping Kevin’s other hand, Kevin suddenly tightened his grip on her fingers. <br/><br/>She paused and looked up at his face. <br/><br/>A few seconds later, Kevin opened his eyes. With a weary and hazy look in his narrow eyes, he faintly said, “Little girl, go eat first.” <br/><br/>After he spoke, a violent hostility surged in Daisy’s calm eyes. <br/><br/>On the other side, James sensed the sudden rise of a killing intention. <br/><br/>He quickly turned to look at Daisy and saw her staring at Third Master. He hurriedly looked at Kevin and realized he had woken up. <br/><br/>Surprised, the hostility in James’s side subsided as he took a couple of steps towards the bed, “Third Master, you’re awake?” <br/><br/>Kevin seemed not to hear him, only looking at Daisy. <br/><br/>After a couple of seconds, she let go of his hand, pressed the bedside call button, and started walking out of the room. <br/><br/>Kevin instinctively wanted to follow her. <br/><br/>Daisy Zane was stunned for a moment, and then tried to get up, <br/><br/>But Arthur North’s strength was too great, and she didn’t dare to resist forcefully for fear of hurting him. <br/><br/>In the end, she helplessly bit his lip. <br/><br/>She bit hard, and Arthur North shrank back a little, but didn’t let go of her, instead kissing her even tighter. <br/><br/>It wasn’t until Daisy Zane stopped resisting that his hand moved from her neck to her head, his fingers weaving through her hair, seemingly consoling her. <br/><br/>But... there was suddenly a noise at the door. Just the sound of the door opening made everyone feel tense. <br/><br/>Daisy Zane moved to get up, but Arthur North still didn’t let her go. <br/><br/>Then she heard Thomas Firway enter the room, “Third Master! I heard you woke up, I...” <br/><br/>As Thomas Firway entered and saw the scene, his mind went blank, but his first reaction was to quickly turn around and block Yoshua Archer and Edward Darkmoon from coming in. <br/><br/>Then he hurriedly closed the door again. <br/><br/>“What’s going on?” <br/><br/>Because of the sudden retreat, Yoshua stepped on Edward’s foot. Edward was so in pain he could barely stand, leaning against the wall for support. <br/><br/>“Third Master just woke up, and there’s a lot to talk about with Third Brother. It’s not right for us to go in at this time,” Thomas Firway said, his face flushed. <br/><br/>Yoshua and Edward stared for a moment, and then both understood what was going on. <br/><br/>Then the two brothers silently sat in the chairs outside the ward. <br/><br/>Thomas Firway stood for a moment before sitting down as well. <br/><br/>Inside the room, Arthur North finally let go of Daisy Zane, kissed the corner of her mouth a couple of times, then raised his thumb to wipe the crystal clear saliva from her mouth. <br/><br/>Daisy Zane’s hand was propped against the bed, not getting up yet. She stared at Arthur North, her expression ready to fight him at any moment. <br/><br/>Arthur North also looked at her, stroking her face: “Don’t be angry, I know I was wrong.” <br/><br/>Daisy Zane stared at him for a while before lowering her gaze and sitting down at the side of the bed. “No need to say insincere words.” <br/><br/>“No, I really do know I was wrong.” Arthur North held her hand gently, squeezing it, “Don’t be angry anymore.” <br/><br/>These words were indeed sincere. <br/><br/>He deliberately left a half-month gap so his little girl wouldn’t worry. <br/><br/>But not only did he make her worry, but she also ended up taking care of him for three days here. <br/><br/>He could easily guess that it must have been Thomas Firway who called her to come. If he had known, he would have sent Thomas Firway away beforehand. <br/><br/>These people... were too concerned about him. How could he really risk his life like that? <br/><br/>He still had his wife to accompany him, so he had to be measured. <br/><br/>It was only three days compared to her year of training. <br/><br/>So, what was this compared to that?\t\t\t\t\t\t</div>", "images": {}, "success": true}