{"id": 430, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14576704.html", "title": "Chapter 430: 380: Silver Palace", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 430: 380: Silver Palace</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 430: 380: Silver Palace<br/><br/>Translator: 549690339<br/><br/>At Kevin Clark’s command, everyone listened and obeyed from all directions.<br/><br/>Yoshua Archer and Edward Darkmoon immediately put aside the question of Yoshua’s gender and identity, responding: “Understood.”<br/><br/>Even Silver Palace was prepared to strike at any moment.<br/><br/>Daisy Zane unconsciously followed his command too, her left hand holding a dagger while her right hand pulled out another one that was tucked at her waist.<br/><br/>Kevin Clark looked at Daisy’s favorite double daggers. They were formidable in close combat. Even he had been injured by her before.<br/><br/>His lips moved, but in the end, he said nothing, only uttering: “Be careful.”<br/><br/>Daisy didn’t look at him, just lowered her eyes and acknowledged. She bent down and patted Silver Palace’s head twice: “Stay in place. I’ll call you back.”<br/><br/>Yoshua Archer and Edward Darkmoon had already taken action.<br/><br/>Silver Palace waited for Daisy to move.<br/><br/>As soon as Silver Palace received her signal, it relaxed and prepared to standby.<br/><br/>After that, Daisy went to find Yoshua Archer and the others. Kevin Clark immediately followed her.Geett the latest novels at novelhall.com<br/><br/>Kevin Clark’s adaptability had always been strong, and he had great synergy with everyone, no matter who it was.<br/><br/>As for Daisy who wielded double daggers, he knew even better how to cooperate.<br/><br/>With Daisy attacking in close quarters, he would take full responsibility for the distant targets.<br/><br/>With Daisy in the distance not having to worry about anything. Kevin Clark, up close, wouldn’t have any concerns.<br/><br/>Especially since Edward Darkmoon’s men were still setting up their guns on the mountain slope.<br/><br/>Daisy and Kevin Clark never strayed far apart. For a moment, it seemed as if they had returned to the days when they fought side by side years ago.<br/><br/>“A sniper has moved to the eleven o’clock direction,” said Daisy.<br/><br/>Kevin Clark immediately pressed his earpiece, reported the sniper’s location to Edward Darkmoon’s snipers, and had them handle it.<br/><br/>After that, Kevin Clark asked Daisy, “Do you recognize the leader of the Thousand Mountains Alliance?”<br/><br/>“Yes.” Daisy locked on the face of the leader of the Thousand Mountains Alliance in the dark.<br/><br/>“I’ll cover you.”<br/><br/>“Understood.”<br/><br/>With that, Daisy immediately moved in that direction.<br/><br/>Kevin Clark followed closely behind.<br/><br/>As the people of the Thousand Mountains Alliance quickly realized their intentions, they concentrated their firepower on them.<br/><br/>Edward Darkmoon immediately protected them and fought back.<br/><br/>Kevin Clark embraced Daisy, forcefully bent her waist, and made her duck down to avoid two gunshots.<br/><br/>As she ducked, Daisy listened for the gunman’s position. When she got up again, she immediately locked onto the gunman, not far away.<br/><br/>Before leaving, he exchanged a few words with Allonzo Hobson: “I never expected Kevin Clark to have such abilities, to actually be from Dark Radiance. But... he’s not as strong as my sister.”<br/><br/>Allonzo Hobson: “......” He rarely encountered someone who talked more than him.<br/><br/>Dark Radiance members stayed to clean up the battlefield while Kevin Clark and Daisy Zane went to find the Silver Palace. The two were silent all the way, Kevin Clark following her quietly.<br/><br/>Kevin Clark, who always considered himself intelligent and emotionally intelligent, was a mess inside his head. Several times, he started to say something but stopped himself.<br/><br/>As soon as they arrived near the location of the Silver Palace, it suddenly sprung out.<br/><br/>It pounced directly onto Daisy Zane, not applying too much force, just enough for her to hold it without falling over.<br/><br/>Daisy Zane held it without saying a word, only lowering her head to rub her forehead gently against the Silver Palace’s forehead.<br/><br/>“It missed you a lot.” Kevin Clark said.<br/><br/>Daisy Zane gazed at the Silver Palace without speaking.<br/><br/>Back when she left Cold Green Village, she went straight to M Continent.<br/><br/>By chance, on her fifth day in M Continent, she unknowingly participated in a training selection.<br/><br/>At that time, there were many people, and she went through layers of screening, barely passing each time.<br/><br/>With her abilities back then, she could be considered the weakest link among the entire team.<br/><br/>Perhaps heaven took pity on her; although her abilities were mediocre, she managed to scrape by in every assessment.<br/><br/>Then, along with the nearly one hundred other people who were selected, they met Kevin Clark of that time.<br/><br/>He wore all black, not exposing any skin. His voice and demeanor were different from now, showing a drastic difference from the current him.<br/><br/>Otherwise, she wouldn’t have failed to recognize him.<br/><br/>During that nearly year-long training, Daisy Zane felt like she was on the verge of death every day. On several occasions, she even thought that one foot had stepped into the Ghost Gate Pass.<br/><br/>And then she was cruelly pulled back out.<br/><br/>Her body was thoroughly tormented, followed by endless psychological and drug resistance training.<br/><br/>Psychological and drug resistance training was torturous.<br/><br/>Once, when Daisy Zane was pushed to her limit, she fought back against the people training them.<br/><br/>Thinking back... Kevin Clark’s rib injury had been inflicted by her dagger.<br/><br/>Though the training was brutal, Daisy Zane had to admit that she made rapid progress.<br/><br/>From the weakest among them, she became the strongest.<br/><br/>In the end, when only a dozen people were left, they were thrown into a wolf den deep in the mountains.<br/><br/>That was when the Silver Palace was tamed by Daisy Zane.<br/><br/>And the scar on Daisy Zane’s collarbone was also left during the process of taming the Silver Palace.<br/><br/>They were abandoned in the deep mountains for almost a month.<br/><br/>That month, Daisy Zane and the tamed Silver Palace relied on each other for survival, sharing food and sleep, and fighting together against enemies.<br/><br/>She didn’t have the scar removed, unwilling to erase the only connection she had with the Silver Palace\t\t\t\t\t\t</div>", "images": {}, "success": true}