{"id": 442, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14580680.html", "title": "Chapter 439: 388 Hypnosis_2", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 439: 388 Hypnosis_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 439: 388 Hypnosis_2<br/><br/>Translator: 549690339<br/><br/>Busy with returning home, once again we headed for Mountain Sea Continent and Kevin Clark was injured again, in the hospital, our beds were always placed side by side.<br/><br/>“Arm.” Daisy Zane said with her eyes closed.<br/><br/>“Is it a bit stiff?”<br/><br/>“No.” Daisy Zane responded, “Be careful.”.<br/><br/>“It’s fine.” Kevin Clark gently patted her as he watched her long eyelashes, after a moment he said, “Charles’ adoption has been finalized.”<br/><br/>“You’re now his legal father.”<br/><br/>Kevin Clark gave a gentle laughter, saying warmly, “Have you noticed Charles looks more and more like me?”.<br/><br/>“You should thank your lucky stars I’ve witnessed Charles’s growth from a cell to his birth, and then growing up so big.” Daisy Zane’s voice gradually blurred, “Otherwise, I would have reason to suspect the rumors about Third Master Clark’s promiscuity.”<br/><br/>“He’s also like you, his little expressions are all very similar to yours.”<br/><br/>Daisy Zane felt Kevin Clark’s hand moving from her back to her waist.<br/><br/>The feeling magnified, she couldn’t help but be attracted by Kevin Clark’s rhythmic pats.<br/><br/>She intended to ask him to move his hand to a different spot, but before she could speak, Kevin Clark suddenly said something else.<br/><br/>“Was Charles very cute when he was a child?”<br/><br/>“He cares a lot about every aspect of my life, and is very supportive of what I want to learn. His care for me is thorough.” Daisy Zane said, “But he’s a bad person, he kills. He is crazy, he kills anyone. He even wanted to kill Charles.”<br/><br/>Daisy Zane knitted her brows tightly, her hand clutching Kevin Clark’s clothes suddenly tightened. She murmured: “Killing is wrong. I... I am... I am... Grandfather said... said... I, I am supposed to protect everyone, I can’t kill.”<br/><br/>Daisy Zane’s words were disconnected, barely audible.<br/><br/>Kevin Clark clenched his fingertip, forcing himself not to touch her. He paused, then slowly guided her, “Do you remember the first time you met Edward Kirsten?”<br/><br/>Her grip on his clothes loosened slightly: “I remember. At the hospital. March 19. The first person I saw when I opened my eyes was him. He said he found me and named me Enigma.”<br/><br/>Kevin Clark’s fingertips trembled slightly as he looked at the person in his arms, following her memories he asked, “Did you see his face the first time?”<br/><br/>“Yes.”<br/><br/>“What...what did he look like?” Kevin Clark asked this question with gritted teeth.<br/><br/>“He...he....” Daisy Zane tightened her grip on Kevin Clark’s clothes again, sweat forming on her forehead, “He... ”<br/><br/>Daisy Zane frowned, it suddenly seemed as if many voices poured into her ears.<br/><br/>“Little Enigma, do you miss your brother?”<br/><br/>“Little Enigma, get up. You’re being lazy again.”<br/><br/>“Look, these are the gifts your brother brought for you.”<br/><br/>“Little Enigma, your brother tells you, your brother has not only killed Mason Davis’s family, your brother has killed many others.”<br/><br/>“That child was only four years old, Enigma helped your brother find him. Enigma helped your brother kill him.”\t\t\t\t\t\t</div>", "images": {}, "success": true}