{"id": 443, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14580683.html", "title": "Chapter 440: 388 Hypnosis_3", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 440: 388 Hypnosis_3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 440: 388 Hypnosis_3<br/><br/>Translator: 549690339<br/><br/>“Elder Brother, would you like to come down to the basement with me to see how I kill?”<br/><br/>“Little Enigma, remember this well. Jack Amos died because of you.”<br/><br/>“Remember, Jack Kingsley lost his father because of you. If he dares to help you escape, he deserves to die.”<br/><br/>Daisy Zane’s lips turned pale instantly, her eyelashes were trembling, and sweat dripped into her hair from her forehead.<br/><br/>Kevin Clark clenched his fingertips, stopping himself from waking her up.<br/><br/>But a few seconds later, Daisy Zane suddenly opened her eyes. Then, like a conditioned reflex, she rolled over and straddled Kevin Clark, her right hand directly grabbing his neck.<br/><br/>Kevin Clark didn’t resist, allowing her to do as she pleased.<br/><br/>At that moment, the killing intention burst out from the depths of Daisy Zane’s eyes. Her face was very pale, but an intense hardness permeated her whole body.<br/><br/>All her defensiveness was provoked, aimed at the person beside her.<br/><br/>But as soon as she recognized Kevin Clark, she immediately let go of him. After a moment of stupor, she began to breathe heavily.<br/><br/>Even though she was sweating heavily, her whole body was shivering slightly.<br/><br/>Ignoring the discomfort in his throat, Kevin Clark sat up against the head of the bed, took Daisy Zane into his arms, lied her down onto his chest, and embraced her: “It’s all fake; it has all passed.”<br/><br/>He kissed the top of her head, “I’m sorry, I’m sorry.”<br/><br/>Daisy Zane leaned against his shoulder, staring at the pitch-black room.<br/><br/>At her most vulnerable moment, Kevin Clark sneakily used Charles Amos to lure her into hypnosis.<br/><br/>He used Charles Amos’s childhood experiences to trigger her memories of life in Continent A.<br/><br/>His hand was knocking on her waist.<br/><br/>Kevin Clark covered her eyes, and then the light on the bedside table turned on.<br/><br/>Only when he felt she could adapt to the light did he slowly remove his hand from her eyes, and stroked her head, “Don’t be afraid, I’m here.”<br/><br/>Daisy Zane took a moment, calming her breath.<br/><br/>Whenever Daisy Zane moved slightly, he would wake up.<br/><br/>But... Daisy Zane’s psychological quality was indeed commendable. After she fell asleep, she slept very soundly.<br/><br/>Until dawn, she even had a dream.<br/><br/>She dreamt of a little girl reading a book.<br/><br/>The voice was youthful. Next to her were two boys. Sitting right in front of her was an elder.<br/><br/>She was focused on reading and did not look at the people around her.<br/><br/>“The heavens are always moving, the gentleman should constantly work towards self-improvement. The earth is meek, the gentleman carries things with his inner strength. The gentle wind, the gentleman manifests his will through his actions. The gradual thunderstorm, the gentleman maintains a state of mindfulness through fear and self-examination...”<br/><br/>The little girl read word by word from the book. However, the words she recited were not the same as the words she was pointing at.<br/><br/>Some people on the side commented that she had memorized the lines, but couldn’t read very well.<br/><br/>“Grandfather, what is a gentleman?”<br/><br/>The elder in front of her suddenly smiled kindly, held the little girl in his arms, and said: “Oh, Little Lila Campbell can recite it.”<br/><br/>“Yes.” The little girl said proudly, “It’s easy.”<br/><br/>The elder smiled again, “A gentleman, Lila, must have both virtue and talent, adhere to benevolence and righteousness, and bear the world in mind. The gentleman should know what to do and what not to do, know what can be done, and do it; know what can’t be done, and don’t do it. When they succeed, they should benefit the world. When they are poor, they should be good to themselves.”<br/><br/>The little girl was even more confused.<br/><br/>One of the boys suddenly laughed and said: “Grandpa, she is only three years old, if you speak like this, she won’t understand.”<br/><br/>“No matter, our Little Lila Campbell is clever. She can remember it first and understand it slowly in the future.”<br/><br/>“Yes, Lila is smart.” The little girl smiled, then turned to the other boy, “Brother Arthur, don’t you think so?”<br/><br/>“Yes, very clever.”<br/><br/>“That’s your Third Uncle.”<br/><br/>“This is Brother Arthur.”<br/><br/>“Brother Arthur, Brother Arthur. Do you only have your real brother in your eyes?”<br/><br/>The little girl pursed her lips and looked at him. After a while, she suddenly said, “Elder Brother is a big jealous jar.”\t\t\t\t\t\t</div>", "images": {}, "success": true}