{"id": 440, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14579780.html", "title": "Chapter 437 - 387: 319", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 437 - 387: 319</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 437: Chapter 387: 319<br/><br/>Translator: 549690339<br/><br/>“Dean Yue, if there’s another time, please let someone else guide her instead.” Kevin Clark leaned against the head of the bed while taking the call.<br/><br/>He spoke respectfully, but there was no sugarcoating in his words.<br/><br/>The dean of the Pharmaceutical Formulation Institute personally called Kevin Clark to ask for leave for Nicholson Amos.<br/><br/>Only then did Kevin Clark find out that Nicholson Amos had abandoned her experiment to take care of her own business.<br/><br/>After missing two conferences the year before last and inexplicably disappearing for half a year, she now had the Dean asking for leave on her behalf. She really was something.<br/><br/>“She does have an urgent matter to attend to,” said Ezekiel Santiago.<br/><br/>“Dean, she’s very capable, and she doesn’t need me to guide her at all,” said Kevin Clark. “There’s no need to trouble me with her.”<br/><br/>“In order for her to get a pass to enter the research institute, she needs to be guided by a professor,” Ezekiel Santiago said directly. “I really don’t have the time, otherwise I wouldn’t want to bother anyone else.”<br/><br/>Kevin Clark:Fịndd new updates at novelhall.com<br/><br/>And then Ezekiel Santiago added another sentence: “Ah, I’ll personally guide her. Nicholson Amos has already graduated, and she is now in the research institute.”<br/><br/>This was insinuating that he had failed his courses.<br/><br/>Kevin Clark narrowed his eyes: “Dean, you entrusted her to me, so I’ll naturally decide whether she meets the qualifications for the research institute.”<br/><br/>Ezekiel Santiago:<br/><br/>If it were only about her abilities, Kevin Clark would have no complaints about Nicholson Amos.<br/><br/>But regarding her attitude, he couldn’t guarantee it.<br/><br/>Experiments require a meticulous attitude and persevering spirit.<br/><br/>He couldn’t see that in her. At least people who could enter the research institute wouldn’t miss events without reason, disappear without reason, or make mistakes in their report formats several times.<br/><br/>He couldn’t guarantee that in the future, this Nicholson Amos wouldn’t bring this attitude into her experiments.<br/><br/>Even geniuses need to have the right attitude.<br/><br/>Otherwise, it’s just a ticking time bomb.<br/><br/>Ezekiel Santiago fell silent for a moment and said: “You’re so old-fashioned.”<br/><br/>Kevin Clark:<br/><br/>“Come on, I’m personally asking for leave. Show some respect,” pleaded Ezekiel Santiago.<br/><br/>“One last time.”<br/><br/>Daisy Zane’s hand gripping the folder tightened involuntarily.<br/><br/>Clark held her hand.<br/><br/>Daisy Zane looked at his hand and released some of her grip: “They’ve been experimenting on humans all along.”<br/><br/>Clark looked at her and gave a soft hum: “From what we know about 319, it enters the human body and affects the cells, so different reactions occur in different people.”<br/><br/>As he squeezed her hand, he spoke slowly: “Based on the transaction location in Red Cliff Village and the subsequent discovered transaction locations, the confiscated various reports on the reactions to 319 show that different people react differently to the drug. However... there’s no pattern to the reactions.”<br/><br/>“The homeless man in Truro City.” Daisy Zane said.<br/><br/>“Based on the autopsy report of the homeless man in Truro City, the 319 dose he was injected with was too large, his body couldn’t withstand it, and he died abruptly,” Clark explained. “The current 319 and 319(i) have strictly controlled doses. The 319(i) dose is slightly larger than the 319 dose, but neither pose a threat to life.”<br/><br/>Daisy Zane said, “They’re looking for people who can adapt to the drug.”<br/><br/>“Yes,” Clark replied. “They’re targeting the Mountain Sea Continent, and they will definitely target other continents as well. After all, the living environment and physical condition of the people vary in each place. They’re expanding the scope of their experiments, as well as the ‘type’ of experiments.”<br/><br/>Daisy Zane knew Edward Kirsten was insane, but she still underestimated the extent of his madness.<br/><br/>After a moment of silence, Daisy Zane looked at Clark and asked, “What do you think 319 is researching?”<br/><br/>Clark looked at her and asked in return, “What do you think?”<br/><br/>“Eternal life,” Daisy Zane replied.<br/><br/>Clark’s eyelashes trembled, and it seemed that he understood why she had gone to Imperial Capital University—she was researching 319 on her own.<br/><br/>Moreover, it seemed that she had single-handedly done what the entire research institute was investigating.<br/><br/>Originally, they had no clue about 319.<br/><br/>They couldn’t break down the components, and even experiments with mice yielded no results.<br/><br/>It wasn’t until the suspected 319 discovered inside the Truro City homeless man’s body and issues with the doses of 319 and 319(i) that the research institute began to mimic the substances detected in the homeless man’s body and adjust the doses accordingly.<br/><br/>Through a large number of experiments and observations, they discovered that it could prevent unstable cells, such as those that age, die, and regenerate in a day or two, from aging.<br/><br/>These cells remained in a constant state of freshness and vigor.<br/><br/>However, such changes in various cells were too much for a living body to withstand, leading to rapid death from the drug.<br/><br/>Edward Kirsten’s current approach seemed to be a desperate attempt to experiment on humans using adjusted doses to produce the desired results.<br/><br/>Therefore, they had to find Edward Kirsten and his laboratory as soon as possible.<br/><br/>After another period of silence, Daisy Zane said, “Kevin Clark, can you hypnotize me?”<br/><br/>Hearing her words, Clark’s eyes tensed. He knew she wanted to recall Edward Kirsten’s appearance.<br/><br/>“Ordinary hypnotists have no effect on me,” Daisy Zane said as she looked at him. “You trained me, so you should know best how to hypnotize me.”\t\t\t\t\t\t</div>", "images": {}, "success": true}