{"id": 448, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14583914.html", "title": "Chapter 445 - 391: Charity Auction_3", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 445 - 391: Charity Auction_3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 445: Chapter 391: Charity Auction_3 <br/><br/>Liam Davis stepped forward and gentlemanly said, “Miss Lane, hello.” <br/><br/>Olivia Lane vaguely remembered something and looked at Liam Davis, asking, “What is it?” <br/><br/>“I just met Miss Lane and wanted to get to know her.” Liam said. <br/><br/>“Why do I have to know you?” Olivia replied. <br/><br/>Daisy Zane smirked. <br/><br/>Liam choked on his words. <br/><br/>Mrs. Davis immediately said, “Miss Lane, my son is excellent. He has a master’s degree in Business Administration from Imperial Capital University. Our Davis family is the richest family in Truro City. My son also has his own company and is thriving...” <br/><br/>“So what?” Olivia interrupted her, “Would you like me to introduce you to my brother?” <br/><br/>Mrs. Davis also choked on her words. <br/><br/>This time, Daisy Zane laughed out loud. <br/><br/>Liam and Mrs. Davis both looked at her. <br/><br/>Daisy Zane looked directly at Mrs. Davis and whispered, “This is the last time. If I hear that you approached her once more, the Davis family won’t just lose their status as the richest family in Truro City.” <br/><br/>Having said that, Daisy Zane no longer looked at them and walked away, holding Olivia Lane’s hand. <br/><br/>Mrs. Davis and Liam watched their retreating figures. After a while, Mrs. Davis said angrily, “Did you see that? This is the person you like. She has no manners or politeness.” <br/><br/>“I won’t like her anymore.” Liam’s eyes seemed to be poisoned, “She makes people take action against you and the Davis family. I won’t let her off easily.” <br/><br/>“Only the Lane family can compete with the Imperial City Leafield Family.” Mrs. Davis said, “If we want to save our family, it’s the Lane family that can help. My son, do you understand? Olivia Lane is very beautiful, and she can be a wife without any loss.” <br/><br/>“I know.” <br/><br/>“In fact, there is a good opportunity now for William Lane and Harton Clark to turn against each other.” Amelia Miles suddenly approached them. <br/><br/>Mrs. Davis and Liam both looked at her. After a while, Mrs. Davis asked, “What opportunity?” <br/><br/>“The Doomsday Hotel Rooftop.” <br/><br/>Daisy Zane suddenly paused, listening to the gradually fading voice of Mrs. Davis. <br/><br/>“Liam accompanied Miss Lane back to her room.” Mrs. Davis laughed, “Ah, don’t worry. No one will disturb them. The rooftop of the Doomsday Hotel has Miss Lane’s room, and no one dares to go there. This matter will definitely succeed.” <br/><br/>The banquet hall was noisy, but Daisy Zane clearly heard these sentences. <br/><br/>Mrs. Davis also seemed quite proud of herself. <br/><br/>Daisy Zane’s expression turned cold, and she immediately called Olivia Lane. <br/><br/>She felt that something was wrong. This was the Lane family’s territory; the attitude of Olivia Lane towards Liam Davis was also clear. <br/><br/>There was no way the Lane family would allow a stranger to take Olivia Lane away. <br/><br/>As she called Olivia Lane, she headed towards the elevator. After calling Olivia Lane twice without an answer, she entered the elevator and pressed the floor for the rooftop. <br/><br/>In fact, the plan that the Davis mother and son came up with at the last minute had many flaws. <br/><br/>For example, they didn’t expect Daisy Zane to call Olivia Lane. <br/><br/>For example... they didn’t include needing to swipe the room card to go to the designated floor in their plan. <br/><br/>Or because of the need to swipe the card, the idea Amelia suggested from the beginning was wrong. <br/><br/>The rooftop was a taboo, and naturally, people were not allowed to have access to the room card. <br/><br/>That person who went to the rooftop while in the Dance Association had gone there by accident. <br/><br/>But... it seemed as if there was an invisible force leading her, Olivia Lane did not answer the phone. <br/><br/>Daisy Zane was too worried, and after entering the elevator and pressing the floor button without any response, she remembered the need for a room card. <br/><br/>She didn’t waste time finding someone. Instead, she chose the fastest method. <br/><br/>She tapped her cell phone a few times, then held it close to the sensing area and pressed the floor button. <br/><br/>She could access any floor. <br/><br/>If Olivia Lane was really taken away by Liam Davis, she had to find help as fast as possible, or Olivia Lane might be bullied. <br/><br/>Regardless, she needed to check and make sure first.\t\t\t\t\t\t</div>", "images": {}, "success": true}