{"id": 446, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14582555.html", "title": "Chapter 443: 391: Charity Auction", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 443: 391: Charity Auction</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 443: 391: Charity Auction<br/><br/>The Miles Family from Truro City, Davis Residence, and John Anderson also came.<br/><br/>From the Miles Family, everyone except Jace Miles came, even Old Master Miles paid a visit, and the Davis family came as a group of three. John Anderson came alone.<br/><br/>Although Amelia Miles didn’t make it into the top three of the dance competition, she still secured a spot in the Dance Association.<br/><br/>Due to the influence of the Lane Family, many people paid attention to the dance competition.<br/><br/>A lot of people, although indifferent about dancing, were very keen on the Dance Association.<br/><br/>Those who entered the Dance Association had a chance to receive favors from the Lane Family, which was a valuable connection.<br/><br/>So at the banquet hall, many people would take the initiative to greet Amelia Miles.<br/><br/>Old Master Miles wouldn’t miss this opportunity to network, so the family stayed with Amelia Miles, welcoming everyone with a smile.<br/><br/>When Kevin Clark and Daisy Zane entered the banquet hall, several media reporters spotted Daisy Zane and turned their cameras towards her.<br/><br/>In order to maintain order at the scene, the media reporters were at designated locations.<br/><br/>Daisy Zane looked at those lenses and said, “Let them blur out your face when they release the footage.”<br/><br/>“Is that necessary?” Kevin Clark asked softly.<br/><br/>Daisy Zane looked at him.<br/><br/>“I want to appear with my wife. I don’t want them to say that I am a balding, big-eared, middle-aged man,” Kevin Clark paused and continued.<br/><br/>Daisy Zane: “...As you wish.”<br/><br/>Meanwhile, the other three members of the Miles Family were still a bit stunned. Johanes Miles looked at Amelia and asked, “Is what he said true?”<br/><br/>Amelia Miles barely smiled, “I don’t know. I haven’t met them.”<br/><br/>Old Master Miles said, “How could it be false? Look at how respectful those people are to them. Those are the people who wouldn’t even spare a glance at us.”<br/><br/>Johanes Miles fell silent.<br/><br/>Old Master Miles observed for a while and concluded, “We’ve been playing this move wrong from the start.”<br/><br/>Charles Hobson clenched his fists, understanding that what Old Master Miles meant by “the start” was when Johanes Miles married her.<br/><br/>If Johanes Miles had stayed with Claudia Zane, then their daughter, Daisy Zane, would have married into the Clark Family, and the Miles Family would have reached the sky in one step.<br/><br/>Now they were left with nothing.<br/><br/>Amelia Miles didn’t respond.<br/><br/>Old Master Miles continued, “Johanes, come with me to greet her. With so many people here, and in front of her husband, she has to put on an act.”<br/><br/>Johanes Miles removed Charles Hobson’s hand from his arm and followed Old Master Miles.<br/><br/>Charles Hobson’s eyes immediately reddened with anger.<br/><br/>Amelia Miles held her mother’s hand and said, “Mom, don’t worry. They will still rely on me in the end. If she can get Kevin Clark, I can get William Lane too.”<br/><br/>Charles Hobson gripped her hand tightly, “Amelia, your brother and you are all I have left.”<br/><br/>Old Master Miles and Johanes Miles intended to go see Daisy Zane, but they couldn’t get close to her at all.\t\t\t\t\t\t</div>", "images": {}, "success": true}