{"id": 444, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14581567.html", "title": "Chapter 441: 389: The Ugly Freak", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 441: 389: The Ugly Freak</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 441: 389: The Ugly Freak<br/><br/>However, the ringtone only rang twice before going silent.<br/><br/>She opened her eyes and glanced at Kevin Clark: “Who is it?”<br/><br/>Kevin had just muted the phone and hadn’t taken his hand back yet. Seeing her awake, he casually took the phone: “Morris.”<br/><br/>Daisy took the phone and answered the call: “What’s up?”<br/><br/>“My dear, just a reminder, you have a script reading tomorrow.”<br/><br/>Daisy was silent for a while before replying: “Is it worth calling so early in the morning for this?”<br/><br/>“Early? What time is it now? You...” Morris suddenly realized that there might be a time difference, “Where are you?”<br/><br/>“Abroad.”<br/><br/>Morris: “... Can you come back tomorrow?”<br/><br/>“No.” Daisy replied, “You guys start the script reading first; I’ll be back in a couple of days.”<br/><br/>“You, aren’t you afraid of people saying you’re acting like a diva?” Morris said, “Although you’ve worked with these people before, people can still cause trouble.”<br/><br/>Daisy snuggled under the quilt and lazily said: “Don’t I have the capital to act like a diva?”<br/><br/>Morris:<br/><br/>Kevin stroked her hair and chuckled when he heard her words.<br/><br/>“That’s it, then. Hang up.”<br/><br/>After saying that, Daisy hung up the phone and threw it casually on the bed.<br/><br/>Kevin said, “Sleep some more.”<br/><br/>Daisy was silent for a while and then sighed softly: “No, there are still things to take care of at the Hundred Demons Pavilion. Disturbing dreams.”<br/><br/>“What did you dream about?” Kevin kissed her face and said softly, “I just saw you smile.”<br/><br/>“I dreamt about...” Daisy suddenly paused, finding her mind blank and unable to remember anything. The only thing she knew was that the dream content should have been good, and she was in a pretty good mood, “Oh, I forgot.”<br/><br/>Kevin laughed: “That’s normal.”<br/><br/>Daisy was silent for a while, picked up her phone, and set several alarms.<br/><br/>All set for early morning domestic time.<br/><br/>If Morris wants to disturb her dreams, then he won’t get any sleep today either.<br/><br/>Kevin watched her series of actions and laughed as he hugged her, his face buried in her neck for a long time.<br/><br/>After having breakfast, Daisy returned to the Hundred Demons Pavilion.<br/><br/>Moreover, there was a significant controversy this year, which kept the online discussion going all day without stopping.<br/><br/>It was... Amelia Miles’s ranking.<br/><br/>Amelia Miles placed fifth.<br/><br/>The first-place girl was self-taught and came from the countryside, just seventeen years old. The second and third places were from dance academies.<br/><br/>There were a total of six judges in the final competition.<br/><br/>For Amelia’s dance, five of them gave her high scores, all above 9.5 points. However, when it came to Sophie Ortiz, she gave the lowest score of the competition: 7.6 points.<br/><br/>If this score had been above 8 points, Amelia could have made it into the top three.<br/><br/>But she ended up falling to fifth place.<br/><br/>Online, people were divided into two camps.<br/><br/>One side agreed with Sophie Ortiz, while the other side criticized her, saying that her aesthetic standards were twisted and no longer in line with the times.<br/><br/>The online dispute was heated, and there was also a post-competition interview with the reporter. The reporter asked Sophie about Amelia’s low score.<br/><br/>Sophie just said three words: “Not enough seasoning.”<br/><br/>Immediately after, the reporter asked: “But we all think she’s doing great. Her technique is skillful, her movements beautiful, and her expressiveness is excellent. By casually dismissing her with three words, don’t you think you’re being unfair to her? Besides, she is known as the ‘little Sophie Ortiz.’ Shouldn’t you finding fault in her be akin to finding fault in yourself?”<br/><br/>Sophie looked at the reporter, then chuckled and said, “So you think the top four are not as good as her?”<br/><br/>Unable to respond, the reporter fell silent.<br/><br/>Sophie continued, “Whoever thinks it’s unfair can replace me as a judge at the next competition. Also, I didn’t give her the nickname ‘little Sophie Ortiz.’<br/><br/>With a polite smile for everyone, Sophie left.<br/><br/>Throughout the conversation, she maintained an elegant demeanor, leaving gracefully. Yet it radiated her arrogance and confidence.<br/><br/>It showed that she was indeed untouchable no matter what others thought.<br/><br/>Daisy watched the interview video and laughed.<br/><br/>When Luke came to find her, he saw her smile: “The Boss is in a good mood.”<br/><br/>“Not bad.” Daisy closed her phone, “What’s up?”<br/><br/>“We need you to sign some documents.” Luke said.<br/><br/>Daisy glanced at the files in his hand: “You can sign them. Why do you need me?”<br/><br/>“You’re here.”<br/><br/>“I’m leaving soon.” Daisy replied, “You sign it yourself.”<br/><br/>Luke:\t\t\t\t\t\t</div>", "images": {}, "success": true}