{"id": 447, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14582556.html", "title": "Chapter 444: 391: Charity Auction_2", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 444: 391: Charity Auction_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 444: 391: Charity Auction_2<br/><br/>After greeting everyone, Kevin Clark led Daisy Zane toward the rest area: “Going to see Olivia Lane? They’re in the inner hall, celebrating her birthday first.”<br/><br/>Daisy Zane asked, “Are all the Lanes here?”<br/><br/>“Yep.”<br/><br/>“No,” Daisy Zane replied. “It’s not appropriate for outsiders to go join her family.”<br/><br/>Kevin knew she didn’t like meeting elders, so he didn’t say anything further: “Let’s sit over there for a bit.”<br/><br/>“Okay.”<br/><br/>The two sat in the rest area.<br/><br/>Clark family members were standing all around, no one could get close.<br/><br/>Kevin worried Daisy was hungry, so he got someone to bring her some food.<br/><br/>Daisy ate and flipped through the auction manual.<br/><br/>“Anything you like?”<br/><br/>Daisy shook her head: “Let’s bid on this Luban lock set for Charles Amos. It’s our contribution to the charity auction.”<br/><br/>“Alright.”<br/><br/>After celebrating her birthday with her family, Olivia came out to find Daisy. She texted Daisy for her location and went straight to the rest area.<br/><br/>“Daisy Zane...” Olivia exclaimed excitedly, but when she saw Kevin by her side, her smile vanished in an instant. She greeted him politely: “Third Uncle, you’re here too.”<br/><br/>Kevin eyed her and said, “You should call me Auntie.”<br/><br/>Olivia pursed her lips.<br/><br/>Daisy Zane:<br/><br/>Olivia turned to Daisy for help.<br/><br/>Daisy stood up and said, “Let’s take a walk around the banquet hall.”<br/><br/>“He’s in the hospital.” William Butch was undergoing therapy every day, so he simply stayed in the hospital.<br/><br/>“Huh?” Olivia asked, “What’s wrong with him? Did he get beaten up again?”<br/><br/>“He’s fine. I’ll take you to see him when I have time,” Daisy promised.<br/><br/>“Okay.”<br/><br/>Olivia nodded and then saw her brother, William Lane, talking with someone nearby. “Have you met my brother?”<br/><br/>“No.”<br/><br/>“Let me introduce you. He’s a great guy; I’m sure you’ll like him.”<br/><br/>Daisy raised her eyebrows: she’d like him? Kevin ... would be drowning himself in a vinegar jar.<br/><br/>Just as she was about to turn down the offer, someone called out to Olivia.<br/><br/>“Miss Lane.”<br/><br/>They both looked over.<br/><br/>It was Mrs. Davis and Liam Davis from the Johnson family in Truro City.<br/><br/>Liam glanced at Daisy before turning his gaze back to Olivia.<br/><br/>Mrs. Davis didn’t even seem to notice Daisy. Her eyes were locked on Olivia.<br/><br/>Daisy watched the two with indifference.<br/><br/>Olivia had a vague sense of familiarity with the lady, but she couldn’t recall her. And the man... she had never met him before.<br/><br/>“What can I do for you?”<br/><br/>“Miss Lane, we’ve met before. Do you remember?” Mrs. Davis attempted to approach them, but Daisy pulled Olivia back and stepped in front of her.<br/><br/>Feeling Daisy’s hostility, Olivia asked, “Who are you?”<br/><br/>“I’m from the Truro City Johnson family.” Mrs. Davis didn’t beat around the bush since Daisy was present: “This is my son, Liam Davis.”\t\t\t\t\t\t</div>", "images": {}, "success": true}