{"id": 445, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14581568.html", "title": "Chapter 442: 390: Joining The Group", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 442: 390: Joining The Group</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 442: 390: Joining the Group<br/><br/>Upon returning to her country, she immediately joined the crew.<br/><br/>Moreover, the variety show “Going to School” began airing, and her previous TV series had also ended.<br/><br/>Daisy Zane didn’t pay much attention, only posting on Facebook when the variety show aired and another post saying goodbye to her character after the finale of the TV series.<br/><br/>By the time Arthur North returned to the country, her movie had already started filming.<br/><br/>This movie is a school-themed film, mainly reflecting campus bullying and violence.<br/><br/>The entire movie is based on two plotlines.<br/><br/>One is the female lead being bullied.<br/><br/>The other is the male lead being bullied.<br/><br/>These two people, who have both suffered from bullying, meet each other.<br/><br/>On the day they met, the male lead had planned to end his own life, but was suddenly interrupted by the female lead.<br/><br/>He then found out that the girl was planning a counterattack.<br/><br/>Her counterattack plan was to continuously train her weak body, at least allowing her to have the ability to defend herself.<br/><br/>She didn’t need to fight violence with violence; all she wanted was to not be bullied and to legitimately defend herself.<br/><br/>She was also looking for evidence and timing to call the police, let the police intervene, prove her innocence and silence the rumormongers.<br/><br/>It’s not scary if nobody helps; she could help herself.<br/><br/>The victims should never be afraid of fighting back.<br/><br/>The aggressors are guilty with their fists and words, but the victims are innocent.<br/><br/>When the guilty are rampant, what reason do the innocent have to shrink back?<br/><br/>School, society, family, police – there must be somewhere to seek help. Even if not, there is still oneself.<br/><br/>No one has the right to make oneself give up on life.<br/><br/>Coming to this world is not for being bullied to death.<br/><br/>One must have the courage to resist at any time.<br/><br/>The male lead discovers the female lead’s plan and joins her in the plan.<br/><br/>The two victims support and encourage each other, creating a path for themselves.<br/><br/>There is also a point in the movie where a parent of one of the bullies stops their child from group bullying and criticizes and educates them about their behavior.<br/><br/>It reflects on the side that parents should not only teach their children not to be bullied but also not to hurt others and instill the correct values.<br/><br/>When the script was first formed, Morris suggested that at least one of the two plotlines must have a tragic ending.<br/><br/>Such an ending would be more engaging and award-winning.<br/><br/>However, Daisy Zane directly rejected the suggestion.<br/><br/>If it was another theme, she could accept a tragic ending for aesthetic reasons.<br/><br/>But for this theme, both plotlines must have a perfect ending.<br/><br/>No negative images should be set up, and anxiety should not be increased.<br/><br/>It wasn’t until her hair and makeup were done, and Daisy Zane needed to change her clothes, that the crowd dispersed towards the conference hall.<br/><br/>Only the three of them were left in the room.<br/><br/>Then... Kevin Clark took advantage of Daisy Zane’s trip to the inner room to change clothes and threw Charles Amos out to Hugo Clark.<br/><br/>It had been a long time since the couple had seen each other, and the presence of others was bothersome.<br/><br/>He had been patient for quite a while already.<br/><br/>After sending off the last visitor, Kevin Clark went to the room to find Daisy Zane.<br/><br/>Daisy Zane had already put on her dress and was pulling up the zipper at the back by herself.<br/><br/>Kevin Clark went over to help her, and then kissed her lightly on the back of her neck.<br/><br/>“Why didn’t you call me?”<br/><br/>“I can pull it up.”<br/><br/>The dress was apricot white in color, accentuating her curves in the upper body and fairy-like beauty in the flowing skirt hem.<br/><br/>The entire dress was studded with diamonds that sparkled with her every step, like a myriad of stars.<br/><br/>Moreover, it completely covered Daisy Zane’s tattoos and scars.<br/><br/>The depth of the V-neck was just right, sexy yet restrained.<br/><br/>Because the shoulder was well covered, the back of the waist was exposed.<br/><br/>Not completely exposed, there was a belt tied at the back of her waist.<br/><br/>It provided a hint of hidden beauty.<br/><br/>Kevin Clark discovered that he might as well not help her with the belt, as it was even more provocative without it.<br/><br/>“Ready?” Daisy Zane asked.<br/><br/>“Yeah.”<br/><br/>“Let’s go.” After saying that, Daisy Zane started to walk out.<br/><br/>But after only one step, she was grabbed around the waist by Kevin Clark.<br/><br/>Her whole body was pulled back, and she took several steps backward with Kevin Clark.<br/><br/>Then she noticed that Kevin Clark was sitting on the bed. Moments later, she felt a warmth on the back of her waist.<br/><br/>Kevin Clark planted a kiss on her lower back.<br/><br/>Reverently and preciously, he kissed her once.<br/><br/>Her pupils trembled lightly as if her lower back had been slightly burned.<br/><br/>But before she could fully react, Kevin Clark applied more force, making her sit on his lap.<br/><br/>Kevin Clark held her waist and reached his hand directly under her dress, “Can I give you a kiss before we leave?”<br/><br/>“I just finished my makeup.” Daisy Zane’s voice was calm and cool, with no hint of discrepancy.<br/><br/>“I’ll be careful not to smudge it.” Kevin Clark said softly, as if coaxing a child, “I’ve been wanting to kiss you. But they were always around. So annoying.”<br/><br/>Daisy Zane:\t\t\t\t\t\t</div>", "images": {}, "success": true}