{"id": 455, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14674531.html", "title": "Chapter 452: 396: How Did He Come Too?", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 452: 396: How Did He Come Too?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 452: 396: How Did He Come Too?<br/><br/>During this time, the Old Master portrayed himself as someone composed, calm, and able to handle any situation. He asserted himself as the head of the family, unaffected by any situation.<br/><br/>However, once William Lane left, the Old Master quickly ordered his things to be packed.<br/><br/>“Hurry up, hurry up, we need to return to Imperial Capital,” Old Master Lane said. “My granddaughter is there; we must return quickly.”<br/><br/>“Old Master...” The housekeeper looked at him, confused by his sudden change of attire, complete with a bow tie.<br/><br/>“What are you waiting for? Start packing,” the Old Master continued. “Make sure to pack everything I need for a long stay in Imperial Capital.”<br/><br/>“Oh, alright.”<br/><br/>“Be quick about it,” the Old Master urged. “You all start packing, and I’ll head back to Imperial Capital on my own.”<br/><br/>“Old Master, even if you return... you won’t be able to see Miss Daisy.”<br/><br/>“How would you know I won’t be able to see her,” Old Master Lane retorted. “Even if I can’t... I’ll still be closer to my granddaughter. It makes me feel at ease knowing that we are breathing the same city air.”<br/><br/>The housekeeper laughed: “Alright, alright. I’ll accompany you first, and let the others pack. We’ll go enjoy some fresh air together.”<br/><br/>“That’s more like it. Let’s get a move on.”<br/><br/>However, not long after the Old Master’s return... Daisy Zane left for Continent A, forcing the drama crew to halt their work.<br/><br/>Five days before Daisy left for Continent A...<br/><br/>While enjoying a break from filming, she received a phone call from Luke.<br/><br/>On Continent A’s seaside, a large number of corpses had washed ashore after the tide receded.<br/><br/>Preliminary autopsy reports suggested that they had been injected with or had ingested high doses of the drug 319.<br/><br/>Apart from that, the death toll in Continent A continued to rise.Vissit novelbin(.)c.om for updates<br/><br/>Some people who had taken 319 didn’t die instantly, but as time went on without treatment, they eventually succumbed to death, causing the death toll to keep rising.<br/><br/>After receiving Luke’s call and learning about the situation, Kevin Clark immediately phoned Daisy.<br/><br/>The Pharmaceutical Formulation Institute was ordered to assist in Continent A.<br/><br/>Kevin Clark would lead the team.<br/><br/>Kevin Clark said, “Have you heard the news?”<br/><br/>“Yeah, Luke just called me.”<br/><br/>“I’m on my way to the airport.” Kevin Clark continued. “I might be busy soon and won’t have time to keep in touch.”<br/><br/>“I know,” Daisy replied. “Please be careful. Decomposing corpses might produce contagious viruses, so make sure to take necessary precautions.”<br/><br/>“You know better than anyone else when you make things difficult for those you don’t like,” the Dean retorted. “You won’t be difficult when it comes to work, but in other areas... I can’t say for sure.”<br/><br/>Kevin Clark:<br/><br/>“She’s just a young woman...”<br/><br/>“Should I find someone to look after her specifically?”<br/><br/>“That won’t be necessary,” the Dean declared.<br/><br/>Kevin Clark said, “As long as she focuses on the experiments, I won’t say a word. I’ll be busy anyway.”<br/><br/>“That’s great. Get along well,” Ezekiel Santiago said, trying to lighten the mood. “The institute will rely on both of you in the future.”<br/><br/>After their call, Kevin Clark made arrangements for someone to pick Daisy up from the airport.<br/><br/>Michael Jackson asked, “Is Nicholson Amos coming?”<br/><br/>“Yes,” replied Kevin Clark, looking at the report.<br/><br/>For someone to come up with such an idea, they must have had frequent contact with 319, probably even experimented with it. Nicholson Amos had conducted unauthorized experiments with 319... and where did she get so much of the drug?<br/><br/>Daisy took a ten-hour-plus flight, sleeping the entire way.<br/><br/>After landing, she was picked up by a research institute staff member and slept during the entire drive.<br/><br/>Upon arriving at the base, she first went to her assigned living quarters, took a shower, and ate before getting straight to work.<br/><br/>“The dean has instructed us to cooperate fully with you,” said her guide. “Would you like to go directly to the laboratory or...”<br/><br/>“I’d like to see the autopsy reports first,” she replied.<br/><br/>“Alright, follow me.”<br/><br/>More and more corpses were being retrieved from the shoreline, and the number of autopsy reports increased accordingly.<br/><br/>Daisy reviewed reports for two hours, noting that the doses involved in the cases seemed to be consistent.<br/><br/>“You must be Nicholson Amos, right?” a sudden voice asked. “Your professor is asking for you.”<br/><br/>“My professor?” Daisy was surprised. Was he here too?<br/><br/>“Yes, he’s in the lab in the Third District. You’d better go quickly.”<br/><br/>“Alright, thank you.”<br/><br/>Daisy collected the autopsy reports and headed over to the Third District.<br/><br/>She was genuinely surprised: instead of encountering Kevin Clark first, it was her professor she had to go meet.<br/><br/>Why on earth was the professor here, too?\t\t\t\t\t\t</div>", "images": {}, "success": true}