{"id": 459, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14776019.html", "title": "Chapter 456 - 399: Storage Card_2", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 456 - 399: Storage Card_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 456: Chapter 399: Storage Card_2 <br/><br/>Kevin Clark sent a message to Thomas Firway: “It’s okay, Thomas and his crew are following us.” <br/><br/>The driver was also there to protect them and accelerated the car to leave the forest quickly. However, not long after moving forward, the car tire was shot, and the vehicle stopped in its tracks. <br/><br/>“What should we do? What should we do?” the older professor asked anxiously. <br/><br/>Daisy Zane looked at the car window and said, “This glass can’t withstand a sniper’s bullet.” <br/><br/>“They want to capture us alive,” Kevin Clark said. <br/><br/>The car wasn’t modified, so the windows could be easily broken, but they hadn’t done that; they had only forced them to stop. <br/><br/>The older professor, clutching his head, suddenly trembled, “I swear I’ll never help them with their research to harm people.” <br/><br/>Daisy Zane looked at the people coming from outside and said coldly, “Don’t worry, professor. They’re the ones who’ll die.” <br/><br/>Kevin Clark took a gun from a nearby bag and handed it to Daisy Zane along with some bullets and a dagger. <br/><br/>After that, he picked up another gun for himself and loaded it. <br/><br/>The driver and professor looked at them, “You...?” Điscover new chapters at novelhall.com<br/><br/>Kevin Clark opened the car door and said to the driver, “Protect the professor.” <br/><br/>After saying this, Kevin Clark and Daisy Zane both got out of the car. <br/><br/>The professor wanted to pull them back into the car, but the sound of the car door slamming shut startled him. <br/><br/>“Oh, what are they doing?” The professor said to the driver, “You go protect them, hurry up. I’m old, my contribution ends here, but they are the hope of the future.” <br/><br/>The driver looked outside and replied, “If I go out... they might have to protect me instead.” <br/><br/>“Huh?” The professor was scared but still looked outside. He saw Nicholson Amos shoot someone dead without blinking an eye. <br/><br/>The sight frightened the professor, who immediately withdrew his head and said, “In that case, you’d better not go out and make a mess.” <br/><br/>The driver: <br/><br/>Thomas Firway and his crew arrived quickly, and the battle between both sides was chaotic. <br/><br/>The researchers had almost zero combat power, so their safety had to be guaranteed 100%. <br/><br/>However, neither Kevin Clark nor Daisy Zane had seen those people. <br/><br/>It seemed like those people had deliberately avoided them, never coming near them. <br/><br/>“Arthur, Arthur.” The older professor who had just gotten out of the car approached Kevin Clark. <br/><br/>Kevin Clark walked over to him, “What’s wrong?” <br/><br/>“Arthur, during the chaos just now, someone wearing a disguise gave me this note,” The professor handed the note to Kevin Clark, “They said to give it to you or Lady Zane. Who’s Lady Zane? Or did I mishear?” <br/><br/>Daisy Zane, who had picked up the pendant, also came over. <br/><br/>Kevin Clark took the note and opened it to read. <br/><br/>[The people from M Continent Laboratory hired them. M Continent Laboratory is secretly collaborating with Edward Kirsten. Be prepared.] <br/><br/>The professor handed the note to him and returned to the car. Thomas Firway didn’t look at the contents of the note either. <br/><br/>Kevin Clark paused, then looked at Daisy Zane, “These handwriting... ” <br/><br/>“I don’t recognize it,” Daisy Zane said. <br/><br/>It was very ugly handwriting. <br/><br/>Both of them didn’t discuss the note much, they needed to escort the researchers out of the area first, as this place could be ambushed again at any time. <br/><br/>Kevin Clark put away the note, and Daisy Zane patted off the dried leaves that had stuck to the pendant’s red rope. <br/><br/>She wasn’t sure if she applied too much force, if the glue holding the pendant had weakened over time, or if it had just fallen. <br/><br/>The pendant suddenly cracked open. <br/><br/>The pendant was a heart-shaped combination of two goose egg stones, polished and glued together; the outside was a small net-like weave of red rope. <br/><br/>It suddenly broke apart, and Daisy Zane’s hand shook slightly as she held it. <br/><br/>Kevin Clark also looked at it. <br/><br/>He knew the pendant was specially made for the real Daisy Zane, and she cherished it. <br/><br/>Just as he was about to say something comforting, he saw Daisy Zane pull out a small black... storage card from the cracked pendant. <br/><br/>He swallowed the words he was about to say. <br/><br/>Daisy Zane’s brow also creased slightly.\t\t\t\t\t\t</div>", "images": {}, "success": true}