{"id": 452, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14587184.html", "title": "Chapter 449: 393 Who Would Marry Their Daughter To Kevin Clark", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 449: 393 Who Would Marry Their Daughter To Kevin Clark</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 449: 393 Who Would Marry Their Daughter to Kevin Clark<br/><br/>Daisy Zane kept her eyes closed and didn’t move. Soon, Kevin Clark got up and turned the alarm off. Then he touched her face and gently kissed her.<br/><br/>“Are you leaving so early?”<br/><br/>“Yes.” Daisy Zane didn’t want to open her eyes, “I have a show in the morning.”<br/><br/>“Why don’t you take a day off.” Kevin Clark touched her face, “You didn’t sleep well last night.”<br/><br/>Daisy Zane seldom suffered from insomnia. When there were too many things going on and the mental burden was too heavy, she would fall asleep faster and feel much better after sleeping.<br/><br/>But she suffered from insomnia last night and couldn’t fall asleep for a long time.<br/><br/>She was thinking about the past, but her mind was blank.<br/><br/>In the past, everything was like a tangled ball of wool. Now that she had found the end of the thread, it had turned into a blank space where she couldn’t remember anything, and there was nothing left.<br/><br/>She couldn’t sleep. Kevin Clark kept her company and didn’t sleep much either. In the end, he told her a lot about when he first established the Easton Group, and eventually managed to lull her to sleep by talking.<br/><br/>“It’s okay, it won’t delay me.” Daisy Zane sat up while speaking.<br/><br/>Kevin Clark also sat up and hugged her from behind, resting his chin on her shoulder and said softly, “Sweetie, if you have any troubles, you can talk to me. Even if the problem can’t be solved right away, maybe you’ll feel better by just talking. Don’t take on everything by yourself. Remember, I’m here for you.”<br/><br/>Daisy Zane was silent for a while, but still didn’t say anything.<br/><br/>It was not that she was deliberately concealing anything from Kevin Clark, she wanted to wait before saying anything.<br/><br/>At least... let herself accept the situation first.<br/><br/>There are very few things she can’t accept, but this matter was hanging on the edge of what she could possibly tolerate.<br/><br/>Moreover, she wasn’t able to recall the past. Even if she could, she hadn’t been at the Lane Family’s place for ten years already.<br/><br/>That place... is very strange to her.<br/><br/>She had changed a lot herself.<br/><br/>If the Lanes came to recognize her as family, she wouldn’t even know how to interact with them.<br/><br/>So, when she herself was in turmoil, she didn’t want to see Kevin Clark’s surprised expression.<br/><br/>At the very least, Kevin Clark being in a stable state could make her feel a little more at ease.<br/><br/>She figured she would deal with it slowly, and then talk about it.<br/><br/>“There’s nothing.” Daisy Zane said in a gentle voice, “But since you’ve suggested it, there is indeed something that bothers me.”<br/><br/>“Tsk.” Kevin Clark clicked his tongue, “Madam, you sound distant with the way you are speaking.”<br/><br/>Daisy Zane laughed, “The Davis Residence in Truro City, I don’t want to see them again.”<br/><br/>“What did they do this time?”<br/><br/>Andrew Lane: “What would a grown man... cry about?”<br/><br/>“If my son wants to cry, let him cry. It’s none of your business.”<br/><br/>Andrew Lane was speechless.<br/><br/>Sophie Ortiz ignored him, turned to Olivia Lane and asked, “Olivia, has your brother been acting strange lately?”<br/><br/>“No,” Olivia said, “Just last night, someone went to the rooftop of Doomsday Hotel. My brother was very angry.”<br/><br/>Both Andrew Lane and Sophie Ortiz raised their eyebrows, “Who was on the rooftop again? How did they get up there?”<br/><br/>“I’m not sure how they got up there,” Olivia Lane said, “Perhaps my brother couldn’t vent his anger and he’s been upset since then?”<br/><br/>“What do you mean he couldn’t vent his anger?” Sophie asked.<br/><br/>Andrew Lane also echoed, “What do you mean his anger didn’t go away? Has our Lane family fallen so low now?”<br/><br/>“The woman who went up there is Harton Clark’s wife. Plus... she was framed. She thought I was in danger, which was why she went up there,” Olivia said softly.<br/><br/>“Whose wife?” Sophie asked.<br/><br/>“Clark... Third Uncle’s wife.”<br/><br/>“Harton Clark is married?!” Andrew Lane and Sophie Ortiz asked simultaneously.<br/><br/>Caught off guard by the sudden rise in their voices, Olivia paused before saying, “Yes, didn’t you know?”<br/><br/>“No one told us, how would we know?” Sophie Ortiz replied.<br/><br/>Harton Clark managed to find a wife?” Andrew Lane was surprised.<br/><br/>The Clarks and the Lanes did indeed have a long-standing relationship.<br/><br/>However, the relationship was primarily between Old Master Lane and Elina Clark. They were from the same generation.<br/><br/>Elina Clark and Tom Wayne were like older generation figures to them.<br/><br/>Furthermore, Andrew Lane often accompanied Sophie Ortiz to various performances and work trips and wasn’t often in the Imperial Capital. Their interactions weren’t very frequent as a result.<br/><br/>Therefore, when Harton Clark got married, and it was only a simple legal procedure with no wedding banquet, the Clarks only notified Old Master Lane.<br/><br/>Unless they had a wedding ceremony, they wouldn’t send them any invitation.<br/><br/>“Which family has given up on life and married their daughter to Harton Clark? How could they bear it?” Andrew Lane was so surprised that he had to ask again.<br/><br/>“Andrew, that’s not right,” Sophie responded, “What’s wrong with Harton Clark? He’s handsome and from a good family. There are lots of girls who want to marry him.”<br/><br/>“What’s the use of being handsome,” Andrew Lane said.<br/><br/>“Being handsome can get you a wife,” Sophie laughed, “Don’t you agree?”<br/><br/>Andrew Lane, who got his wife due to his handsome looks: “...Yes.”\t\t\t\t\t\t</div>", "images": {}, "success": true}