{"id": 456, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14732354.html", "title": "Chapter 453: 397 Tattoo", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 453: 397 Tattoo</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 453: 397 Tattoo<br/><br/>Daisy Zane nodded her head.<br/><br/>“Come with me; the professor is free at the moment. I’ll take you to him.”<br/><br/>“Thank you.”<br/><br/>“No need to be polite. You’re our savior.” The boy led her to an office.<br/><br/>Daisy Zane stood at the entrance for two seconds, then knocked on the door, and pushed it open after waiting for a while.<br/><br/>As soon as she pushed the door open, she saw Kevin Clark, who was inside... eating.<br/><br/>He was wearing a white lab coat, with a mask hanging on one ear.<br/><br/>Hearing the sound of the door opening, Kevin Clark looked up. His usually sharp eyes became unexpectedly gentle, but it was done in such a haste that the softness didn’t fully come through.<br/><br/>Their eyes met, and they both froze for an instant.<br/><br/>Then... Daisy Zane looked around the office, made sure no one else was there, and closed the door again.<br/><br/>The boy who had brought her here was about to leave, but when he saw her close the door, he stopped: “What’s wrong?”<br/><br/>Daisy Zane looked at the boy, paused for two seconds: “Is there only the professor inside? The professor who is looking for me?”<br/><br/>“Yes.” The boy nodded blankly, “You’re Nicholson Amos, right?”<br/><br/>Daisy Zane opened the door again. This time when she opened it, Kevin Clark was standing at the door.<br/><br/>The boy saw him and respectfully greeted, “Professor.”<br/><br/>Daisy Zane asked the boy, “Is he the one looking for me?”<br/><br/>The boy continued to nod blankly, “Have you never seen your professor?”<br/><br/>Daisy Zane looked at Kevin Clark again. She had seen him all too well.<br/><br/>At this moment, Kevin Clark also reacted. The words “Little Girl, what are you doing here?” that were on the tip of his tongue turned into a cautiously asked question, “Are you Nicholson Amos?”<br/><br/>Daisy Zane clenched the hand hanging by her side.<br/><br/>Seeing this, Kevin Clark immediately grabbed her hand, pulled her into the office, and locked the door behind them.<br/><br/>He cleared his throat, “Little Girl... let me explain.”<br/><br/>Daisy Zane looked at him.<br/><br/>The bald, big-bellied, over sixty years old man she imagined who was holding her back and postponing her graduation...<br/><br/>Was her husband.<br/><br/>What a damn coincidence.<br/><br/>“Explain.” Daisy Zane said these three words with an icy tone.<br/><br/>“I...” With the numerous words in the Chinese dictionary, Kevin Clark couldn’t manage to say anything beyond “I...”<br/><br/>Daisy Zane’s hand relaxed, tightened again, and relaxed again. All her feelings finally funnelled into one sentence, she gritted her teeth, “I demand 18-point line spacing.”<br/><br/>Kevin Clark hugged her, stroked her head, and instantly agreed, “Okay, no problem. Let’s do what Madam says.”<br/><br/>Daisy Zane took a light breath. Business before personal matters were crucial, she thought, putting her personal grudge aside for now.<br/><br/>Christian life is long, she can slowly settle their scores.<br/><br/>“When did you cook this meal?”<br/><br/>“Breakfast.”<br/><br/>Daisy Zane said, “Go eat first.”<br/><br/>Olivia Lane quickly replied, but after waiting for a while, Daisy Zane didn’t reply again.<br/><br/>“Amelie, hurry to the shower.” Her roommate called her, “The lights will be out soon.”<br/><br/>“Okay.” Olivia Lane responded and waited for a while longer. Seeing that Daisy Zane hadn’t replied, she put her cell phone down and undressed, preparing to take a bath.<br/><br/>Her roommate had just finished her shower and was tidying up her things when she looked up and saw Olivia Lane undressing.<br/><br/>The tattoo on her shoulder was exposed.<br/><br/>Her roommate startled, then approached her, “Amelie! You got a tattoo.”<br/><br/>Olivia Lane rarely changed clothes in front of them. She was distracted today and undressed directly.<br/><br/>When her roommate spoke, she was taken aback, then said, “I got it when I was a child.”<br/><br/>“You got it when you were a child?”<br/><br/>“Yes.”<br/><br/>As the two were talking, another roommate returned. Seeing them close together, she also joined in the fun.<br/><br/>She also asked, “Amelie, you got a tattoo?!”<br/><br/>Olivia Lane repeated what she had just said.<br/><br/>“A tattoo from childhood? But... it seems similar to the tattoo on Daisy Zane’s shoulder.”<br/><br/>Olivia Lane, who had just picked up her pajamas to take a shower, heard her words and suddenly dropped her pajamas from her hand.<br/><br/>She looked at this roommate, “What did you say?”<br/><br/>“Daisy Zane also has a tattoo like this.” The roommate picked up her clothes for her and looked at the other roommate, “You saw it that morning, didn’t you?”<br/><br/>“Yes. I was going to say that it seems similar. They’re both crowns, but... the pattern on top seems different.”<br/><br/>Olivia Lane’s breathing suddenly became heavy and unstable, her eyes reddening with excitement. She took a step forward and grabbed her roommate’s hand, “Are you sure she also has it on her shoulder?”<br/><br/>“Amelie, what’s wrong? Are you not feeling well?”<br/><br/>“Just tell me whether Daisy Zane has a tattoo on her shoulder.”<br/><br/>The two roommates were somewhat worried about her, but still said, “Yes, the shape should be exactly the same, but the patterns on top seem a bit different. I can’t remember clearly. Just saw it that morning.”<br/><br/>“Yes. I also think it’s similar. The color is the same.”<br/><br/>Olivia Lane stood there, stupefied, as if her soul had drifted away.<br/><br/>The tears that suddenly welled up in her eyes fell directly onto the floor.<br/><br/>“Amelie, what’s wrong? What happened? You’re scaring us.”<br/><br/>Hearing the voice, Olivia Lane snapped back to reality.<br/><br/>She put on her coat and walked out, but when she got to the door, she came back to grab her cell phone.<br/><br/>When her roommates called her, she didn’t hear them.<br/><br/>She went straight downstairs, left the dormitory building, and headed towards the school entrance.<br/><br/>She dialed William Lane’s number while walking: “Brother, where are you, come to school and pick me up now.”<br/><br/>Hearing her sobbing voice, William Lane immediately became alarmed, “What happened? What’s the matter?”<br/><br/>Olivia Lane broke down and started crying. As she walked towards the school entrance, her crying voice became somewhat unclear, “Come and pick me up, come and pick me up now!”<br/><br/>“Okay. I’m coming right away. Stay in the school, don’t come out.”<br/><br/>Olivia Lane sobbed in response, “Okay.”\t\t\t\t\t\t</div>", "images": {}, "success": true}