{"id": 453, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14587185.html", "title": "Chapter 450: 394: You Are", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 450: 394: You Are</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 450: 394: You Are<br/><br/>After becoming friends with him, it took two hours for her to receive a message from William Lane.<br/><br/>[Hello, I am William Lane.]<br/><br/>Young Master Lane spent two hours editing his message, which consisted of seven words.<br/><br/>Last night was Olivia Lane’s birthday, and Old Master Lane came back from Oxford City for the occasion.<br/><br/>After seeing Daisy Zane, William’s expression was somewhat dazed.<br/><br/>The first thing he did after finishing the auction was to visit Old Master Lane at the hotel room and tell him about this matter.<br/><br/>However, when he reached the door, he hesitated for a moment and then left.<br/><br/>At the rooftop of the Doomsday Hotel, although Daisy was obviously stunned upon seeing him, her gaze toward William was unfamiliar afterward.<br/><br/>It seemed like she didn’t recognize him.<br/><br/>And since she was in Imperial Capital, why didn’t she go home?<br/><br/>Was it that she didn’t remember, or were there other reasons?<br/><br/>He needed to figure it out first.<br/><br/>So before Old Master Lane returned to Oxford City, he didn’t mention it.<br/><br/>Daisy looked at the message on her cell phone and, after hesitating, she replied with two words: [Hello.]<br/><br/>William Lane: [Do you have night filming tonight?]<br/><br/>[No, finished work.]<br/><br/>It took a while for William’s side to respond, but it indicated that he was in the process of typing...<br/><br/>Daisy threw her phone on the tea table, opened a bottle of wine, and returned to find William still typing.<br/><br/>About a minute later, William sent a message: [When are you available? Can we meet?]<br/><br/>Daisy looked at the message for a while and replied: [I have an hour tomorrow noon.]<br/><br/>[Alright, I’ll come tomorrow.]<br/><br/>Daisy thought about it and sent him a location.<br/><br/>William Lane: [Go to bed early, don’t stay up too late.]<br/><br/>[Hmm.]<br/><br/>After ending the chat, William was both excited and distressed while holding his phone.<br/><br/>He looked at the family portrait in his room.<br/><br/>Daisy Zane now looked very different from before.<br/><br/>In fact, they could be considered two completely different people.<br/><br/>The person now looked nothing like her past self, but the moment he saw her, he recognized her immediately.<br/><br/>The next day, he drove to the hotel location Daisy had sent him yesterday.<br/><br/>He waited until noon.<br/><br/>He ordered food and then sent Daisy a message telling her the exact location and asked her to let him know when she was done at the film set.<br/><br/>Half an hour later, Daisy replied to his message.<br/><br/>Once he received the message, William began serving the dishes.<br/><br/>About ten minutes later, Daisy arrived.<br/><br/>As the door opened, William saw her and suddenly stood up.<br/><br/>From a distance of three or four meters, Daisy felt William’s nervousness for a moment. She glanced at him and said calmly, “Sorry, I was held up at the film set, and you’ve been waiting for a long time.”<br/><br/>“No, I haven’t been here long either,” William said.<br/><br/>Daisy didn’t say anything more, entered the private booth, and walked over to the table. William pulled out a chair for her, and she sat down without hesitation.<br/><br/>William also sat down, looking at Daisy with a tender gaze, tinged with caution, “Is filming tiring?”<br/><br/>“It’s alright.” Daisy took off her coat and put it on the chair.<br/><br/>William looked at the school uniform she was wearing and suddenly felt a sense of deja vu.<br/><br/>It seemed like just ten years ago Charlotte was still at home, attending high school. Today at noon, he had come to school to pick her up for lunch.<br/><br/>When Daisy saw him staring at her school uniform, she explained, “I’m filming a school drama.”<br/><br/>William came back to reality: “Oh. Let’s eat first—don’t delay the afternoon’s filming. I’ve heard that Morris is quite a scolder.”<br/><br/>Daisy raised an eyebrow: “His bad temper is indeed famous.”<br/><br/>William put on gloves, took a shrimp, and started peeling: “I’ve heard a thing or two.”<br/><br/>“He doesn’t dare to scold me,” Daisy said, “and he can’t out-scold me.”<br/><br/>William smiled and placed the peeled shrimp on Daisy’s plate: “As long as you aren’t bullied.”<br/><br/>Seeing the shrimp added to her plate, Daisy hesitated for a moment then went straight to the point, “Do you have something to ask me?”<br/><br/>As William peeled a shrimp, he suddenly pressed too hard, and his fingertip hit the sharp end of the shrimp head, causing blood to appear. He took a tissue and pressed it against his finger, “I...”<br/><br/>Seeing that he had difficulty speaking up, Daisy said, “Do you want to ask if I am Charlotte Lane?”<br/><br/>“You are.” William said firmly.<br/><br/>Daisy was taken aback, and then she smiled and said, “So sure? Because I went to the rooftop of the Doomsday Hotel? I unlocked that door? You must have heard that I’m a great hacker. I even once saved Olivia’s life. A door lock is nothing to me.”<br/><br/>Daisy purposely said this because she was curious why he was so certain.<br/><br/>After all... her appearance had changed significantly from before.<br/><br/>Moreover... she didn’t seem to resemble anyone in the Lane family.<br/><br/>William looked at her for a moment, then took out his phone and opened an album. He handed the phone to her, “These are all photos from before I turned thirteen.”\t\t\t\t\t\t</div>", "images": {}, "success": true}