{"id": 458, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14776018.html", "title": "Chapter 455 - 399: Storage Card", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 455 - 399: Storage Card</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 455: Chapter 399: Storage Card <br/><br/>“We’ve been so busy, we didn’t even celebrate the new year.” Said the person from the Research Institute who was sent to help. <br/><br/>Things are under control on Continent A-side. <br/><br/>If a different dose of 319 appears again, laboratories in Continent A have the ability to control it. <br/><br/>It’s already the end of February, and people from the Research Institute are planning to return home. <br/><br/>“Speaking of the New Year, Daisy almost missed out on eating dumplings on New Year’s Eve. It was only when the professor called her out of the laboratory that she got to eat one.” <br/><br/>Daisy Zane: <br/><br/>During the Chinese New Year, when everyone was busy, the logistics department of the laboratory in Continent A specially prepared dumplings for the people from the Research Institute. <br/><br/>Daisy only ate one. <br/><br/>She and Kevin Clark exchanged New Year’s greetings and then went back to their work. <br/><br/>Although both of them were at the experimental base, sometimes they wouldn’t see each other for days. <br/><br/>Busy day and night. <br/><br/>On Kevin’s birthday, at the last minute, Daisy remembered and called him to wish him a happy birthday, and then the two began to get busy again. <br/><br/>Kevin had already forgotten about it, not even getting to eat longevity noodles. <br/><br/>On January 5, William Lane also sent her a message. <br/><br/>However, Daisy saw the message two days later. <br/><br/>They rested in Continent A for two days before embarking on their return journey. <br/><br/>Daisy slept most of the time during these two days to catch up on her sleep, even leaning on Kevin and sleeping on the way from the laboratory to the airport. <br/><br/>Other than these events, the little girl was absent twice from the research discussions, and her half-year disappearance seemed to coincide with the real death of Daisy and her grandmother. <br/><br/>The more Kevin thought about it, the more frightened he became, and the more he thought about how much trouble he was in, the more he thought the little girl had been quiet all these days, perhaps holding back a big move. <br/><br/>Kevin suddenly felt a chill down his spine. <br/><br/>Kevin’s heartbeat suddenly quickened. <br/><br/>Kevin suddenly found it difficult to breathe. <br/><br/>While he was in a state of shock, suddenly, there was a loud noise from the front of the car. <br/><br/>The sound of bullets hitting the car. <br/><br/>The driver, startled, instinctively turned the steering wheel, then immediately straightened up again. <br/><br/>The car swayed violently, and Kevin first reached out to support Daisy’s face. <br/><br/>Daisy instantly opened her eyes and looked outside. <br/><br/>To get to the airport from the laboratory, they had to pass through a forest, which they had just arrived at. <br/><br/>“There’s an ambush,” the driver sped up and said, “Third Master, hold on tight.” <br/><br/>With bloodshot eyes from just waking up, Daisy glared fiercely: “They’re targeting us.” <br/><br/>Kevin also glanced outside: “We’re blocking their way.” <br/><br/>“What should we do? What should we do? They have guns,” said the senior professor who hadn’t experienced this kind of thing before, panicking, “Can those escorting us fight back?” <br/><br/>As they spoke, bullets kept hitting the car, becoming more and more intense. <br/><br/>The senior professor bent down, covering his head, “Domestic safety is still the best; nowhere is safer than home. This kind of thing won’t happen at home.” <br/><br/>“Quite a few of them.”\t\t\t\t\t\t</div>", "images": {}, "success": true}