{"id": 451, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14584438.html", "title": "Chapter 448: 392: Top Floor_3", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 448: 392: Top Floor_3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 448: 392: Top Floor_3<br/><br/>Daisy shook her head.<br/><br/>Kevin gently massaged her wrist and said after a moment, “That’s Lila Campbell’s room. Lila went missing at sea when she was 13 years old. The Lane Family has been searching for her, but...”<br/><br/>He didn’t finish the sentence, not wanting to speak the outcome that no one wanted to hear. So he took a pause and added, “That’s why anything related to Lila gradually became a taboo for Roy Madison. He doesn’t allow strangers to touch Lila’s things.”<br/><br/>Daisy didn’t say a word, just looking down at Kevin’s hand.<br/><br/>Thirteen years old... it’s been ten years since then.<br/><br/>Her memory only reaches back nearly ten years as well.<br/><br/>Kevin saw that she wasn’t speaking and thought she was still angry. He cupped her face, making her look at him, and spoke gently, “If you’re still angry... how about we go back and beat him up?”<br/><br/>Daisy chuckled lightly, “Isn’t he your brother?”<br/><br/>“Even a brother can’t bully my wife.” Kevin kissed the corner of her lips, “Don’t worry, just give him a beating without ripping him to shreds.”<br/><br/>Daisy looked at him, smiled again, and then said softly, “Kevin, let’s go back. I don’t want to stay here any longer.”<br/><br/>“Alright, let’s go back.”<br/><br/>Upstairs, Roy Madison stared in a daze at the direction where Daisy had disappeared for a long time.<br/><br/>Amelie Quentin was alarmed by his state and kept comforting him and trying to dissuade him.<br/><br/>“Brother, don’t scare me. What’s wrong with you?” Amelie Quentin’s voice was so urgent, it didn’t even sound right anymore.<br/><br/>Hearing her sobbing voice, Roy Madison gradually came to his senses, touched her head, and said, “I’m sorry, I scared you.”<br/><br/>Amelie Quentin’s eyes filled with tears and she shook her head, “Brother, she didn’t come up here on purpose. She thought I was in danger.”<br/><br/>As Daisy soaked in the bath, she thought about Roy Madison’s agitated expression.<br/><br/>Agitated, happy, incredulous, and... nervous, afraid.<br/><br/>As if he was afraid the sight before him was fake.<br/><br/>Daisy felt his boundless joy and his infinite sadness.<br/><br/>The way he looked at her, as if looking at a long-lost treasure.<br/><br/>And she knew the password for the room at the Doomsday Hotel, her inexplicable familiarity with Roy Madison, her inexplicable affection for Amelie Quentin...<br/><br/>As well as the timeline of Lila Campbell’s disappearance.<br/><br/>All these pointed to one direction.<br/><br/>She is Lila Campbell.<br/><br/>At this thought, Daisy looked up, closed her eyes, and laughed.<br/><br/>She is Lila Campbell, she is Lila Campbell...<br/><br/>She is actually Lila Campbell.<br/><br/>The one who made her jealous and envious. The one with parents, a brother, a sister. For whose birthday even her grandfather would travel thousands of miles from afar to celebrate. She was the young lady of the Lane Family who had been bathed in love and affection from the moment she was born.<br/><br/>She had never even dreamt of that.<br/><br/>For a moment, Daisy lifted her hand to cover her eyes and took a gentle breath.<br/><br/>At this moment... she really didn’t know whether to envy herself or to feel sorry for herself.\t\t\t\t\t\t</div>", "images": {}, "success": true}