{"id": 454, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14674530.html", "title": "Chapter 451: 395: Grandson-In-Law", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 451: 395: Grandson-In-Law</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 451: 395: Grandson-in-law<br/><br/>“There are many more pictures behind.” William Lane said.<br/><br/>Daisy Zane looked through them, and they were all of her. She was smiling in every photo.<br/><br/>Single eyelid, a bit chubby, a very cute little girl.<br/><br/>As she looked further, it was clear that she was getting younger in the pictures.<br/><br/>After looking at some of them, Daisy Zane said, “Can you recognize me from these?”<br/><br/>“I can.” William said. He could recognize his sister no matter what she looked like.<br/><br/>Daisy Zane smiled, returned the cell phone to him: “According to this timeline, I should have had a growth spurt and changed my appearance little by little when I was 14. By the time I was 15, I changed so much that I didn’t look like my old self.”<br/><br/>At that time, Edward Kirsten joked that it might be a genetic mutation.<br/><br/>How could such a huge change happen all at once?<br/><br/>“No matter what, you’re still very beautiful,” William commented.<br/><br/>“That’s true.”<br/><br/>William Lane smiled.<br/><br/>Daisy also smiled slightly. She ate the shrimp he had peeled just now and said, “I don’t remember anything from before.”<br/><br/>William looked at her, his hand under the table slowly clenching, “Did you suffer any trauma?”<br/><br/>He had considered the possibility that falling from such a high cliff might have caused some trauma, resulting in her not remembering them.<br/><br/>Daisy thought for a moment and did not elaborate, but said, “I’m not sure, but I’m in good health.”<br/><br/>William’s heart eased slightly.<br/><br/>Daisy asked, “Did you tell them about this?”<br/><br/>William understood the “them” she was referring to were his family members: “Not yet.”<br/><br/>“Don’t say anything for now,” she requested.<br/><br/>As soon as she said that, William became instantly anxious. Did she not want to come home? Did she not want them anymore?<br/><br/>Daisy looked at William’s sudden anxiety and felt a bit amused. “I need some time,” she said softly. “Whether I can remember the past or not, I need time to adjust.”<br/><br/>William looked at her but remained silent.<br/><br/>Daisy added, “I’m not used to what’s happening right now.”<br/><br/>This man in front of her was her brother, and Olivia Lane was her sister.<br/><br/>Her parents and her grandfather were now in the picture, too.<br/><br/>The old master swallowed hard, and after a while, he asked with a trembling voice, “Good news? Or bad news?”<br/><br/>“Good news.” William, who had been trying to control his emotions for the past two days, suddenly burst into tears. “Grandfather, I found Lila. I found her.”<br/><br/>“Found? Found her?” As soon as he heard the news, the old master froze for a moment, then suddenly staggered backward.<br/><br/>William quickly supported him and stood up, helping the old master sit down.<br/><br/>The housekeeper also immediately ran to get the medicine, and dialed the doctor’s number as he ran.<br/><br/>“Grandfather, how are you feeling?”<br/><br/>“Where’s Lila? Found her? Where is she? Why didn’t she come?” The old master, gripping William’s wrist and flushed with excitement, asked anxiously, “How is she? Where is she? Did you really find her?”<br/><br/>“Grandfather, don’t get too excited. I really found her.” William smiled, “She’s in Imperial Capital, and she’s doing well. Let me tell you everything slowly.”<br/><br/>The doctor arrived quickly, checked on the old master, and found that his blood pressure had risen due to emotional excitement.<br/><br/>After taking his medicine, William helped him back to his room.<br/><br/>He told the old master everything he knew from the past two days, including their meeting at noon and Daisy’s request not to tell the family.<br/><br/>After listening, the old master pondered and said, “They have not been together for ten years. And she was only thirteen when she went missing. We missed half of her growth, and she has forgotten everything that happened before. It’s normal for her to be unfamiliar, uneasy, and unaccustomed.”<br/><br/>“Yes,” William said, “but... she didn’t reject my approach.”<br/><br/>Looking at the videos of Daisy on his tablet and holding the longevity lock in his hand, the old master said, “As long as she’s doing well, I’ll be at ease. For everything else... we’ll take it one step at a time.”<br/><br/>“Mm.”<br/><br/>“I heard that being an actor is very tiring,” the old master said. “Tell her to take good care of her health.”<br/><br/>“Mm.” William paused and then added, “Grandfather, there’s one more thing.”<br/><br/>“What?”<br/><br/>“She’s married to Arthur North.”<br/><br/>Upon hearing this, the old master dropped his tablet, “What? With whom? Arthur North?”<br/><br/>“Grandfather, don’t get too excited.”<br/><br/>“Didn’t Arthur recognize her?” The old master then added, “Well, it makes sense since you stopped letting Arthur see Lila when she was very young. It’s only natural that he wouldn’t recognize her after she’s changed so much.”<br/><br/>William thought, “......” He did indeed have to take responsibility for this. In order to prevent Arthur from getting his sister, William had always kept Arthur away from Lila.<br/><br/>But... damn it, she was still taken away by him.<br/><br/>“Lila has loved Arthur since she was a child,” the old master cleared his throat, clearly hiding his laughter and pretending to be calm, “I like Arthur too. So he’s really my grandson-in-law now.”<br/><br/>William:\t\t\t\t\t\t</div>", "images": {}, "success": true}