{"id": 457, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14732355.html", "title": "Chapter 454: 398: Gaining Control", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 454: 398: Gaining Control</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 454: 398: Gaining Control<br/><br/>The car stopped at the school entrance, and he rushed out.<br/><br/>Amelie Quentin was squatting at the entrance, staring at the ground, her small shoulders shaking uncontrollably.<br/><br/>“Amelie.”<br/><br/>As soon as William Lane called out to her, Amelie Quentin immediately looked up. Upon seeing him, she rose and threw herself into his arms.<br/><br/>“What’s wrong?” Holding her close, William Lane ran his hand through her hair, “Did someone bully you at school? Whatever it is, stop crying. Your brother is here.”<br/><br/>Upon hearing this, Amelie Quentin cried even harder, her words choked with sobs, “Brother, brother, I-I-I...my sister, my sister.”<br/><br/>“What?” William Lane couldn’t make out what she was saying because she was crying so loudly.<br/><br/>“My sister,” Amelie Quentin clutched his clothes tightly, “My sister! Daisy Zane! Daisy Zane!”<br/><br/>Finally, William Lane heard her clearly and stroked her hair, “Alright, alright. Don’t cry anymore.”<br/><br/>“Daisy Zane is my sister, she’s my sister! Brother, you have to find her, you have to find her!”<br/><br/>“Okay, Amelie, you need to calm down. Listen to your brother.”<br/><br/>“We have to find her first. We have to find my sister first!” Amelie Quentin detached herself from his embrace, pushing him towards the car.<br/><br/>Hence, William Lane brought her back to the car.<br/><br/>Once in the car, Amelie Quentin urged him to drive off.<br/><br/>William Lane handed her a tissue to wipe her tears, “Amelie, you need to listen to your brother first. I’ve already seen Lila and we have already had a talk.”<br/><br/>Amelie Quentin’s eyes, reddened from crying, looked at him helplessly. As she took some time to comprehend his words, her previously calm demeanor collapsed once again.<br/><br/>Then, she began crying loudly again.<br/><br/>William Lane: “Err, Amelie?”<br/><br/>“You’ve been keeping this from me!”<br/><br/>On a pitch-dark night, a car was parked under a street lamp.<br/><br/>The girl inside the car kept chattering non-stop.<br/><br/>But... William Lane didn’t comprehend a single word of what she was saying.<br/><br/>He had a feeling that his sister was berating him, but he had no evidence to support it.<br/><br/>Eventually, Amelie Quentin began to calm down. William Lane breathed a sigh of relief, “Amelie, your brother didn’t mean to hide this from you.”<br/><br/>Amelie Quentin looked down, sniffling a little before responding quietly, “You have a chance to explain.”<br/><br/>William Lane explained the situation to her, “Lila asked me not to tell anyone at home first. I wasn’t sure how to bring it up to you.”<br/><br/>I had found her, yet she doesn’t wish to acknowledge us.<br/><br/>Both girls were reprimanded while the other three men in the family, William Lane, Andrew Lane, and The Old Master Lane watched from afar, too afraid to intervene.<br/><br/>Everyone had to stand in attendance while only Sophie Ortiz was seated, scolding the girls for over two hours.<br/><br/>It ended when Amelie Quentin started crying.<br/><br/>“But... she did the DNA identification with the Miles family, which is why I...” Amelie Quentin began.<br/><br/>William Lane interjected, “She is not Daisy Zane. She simply used Daisy Zane’s identity. As to exactly how things happened... I am also not clear of the details.”<br/><br/>Amelie Quentin nodded before being silent for a while. She then asked, “Do our parents know?”<br/><br/>“I haven’t told them yet,” William Lane declared. “When I came home from Grandfather’s, Dad had already gone to M Continent with Mom for the world tour. They probably won’t be back for another two months. I didn’t want them to be distracted which is why I decided to wait until they come back.”<br/><br/>“So that’s why you were hiding it from me.”<br/><br/>William Lane:<br/><br/>“Humph.”<br/><br/>“It’s my fault.”<br/><br/>“I want to go home. I don’t want to go back to school.”<br/><br/>“Okay, good. I’ll talk to your teacher.”<br/><br/>Meanwhile, Daisy Zane was conducting experiments in Continent A, oblivious to the repeated revelations about her identity.<br/><br/>Using the first batch of the 319 potion given by Harton Clark, she developed an elixir to suppress the effects of the 319.<br/><br/>Only after a large number of repeated tests was the elixir rolled out for use.<br/><br/>Fortunately, the 319 in the human body was suppressed.<br/><br/>Although it was not eradicated and there would still be some reactions once 319 entered the body, at least people’s lives were protected.<br/><br/>Edward Kirsten wanted to conduct tests using different dosages of the 319 potion.<br/><br/>Therefore, they could only cooperate with the hospital to measure the 319 in each person identified, developing targeted elixirs batch by batch, and producing them in bulk.<br/><br/>This process required massive manpower and resources.<br/><br/>It took nearly two months of constant experimenting, researching, and production, before the situation in Continent A was brought under control.<br/><br/>Meanwhile, over these two months, Continent A kept investigating and tracing the source of 319.<br/><br/>They were strictly prevent the further spread of 319. As soon as it was discovered, it was immediately seized.<br/><br/>All this while, timely control measures meant that dead bodies in the sea did not spread infectious viruses.<br/><br/>In response to the situation in Continent A, all other continents also stepped up their precautions.<br/><br/>The grim situation seemed to be temporarily under control.\t\t\t\t\t\t</div>", "images": {}, "success": true}