{"id": 468, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14827711.html", "title": "Chapter 465: 408: It’S Not Her!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 465: 408: It’S Not Her!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t  Chapter 465: 408: It’s Not Her!<br/><br/>Seeing the two of them silent, Holt Lawrence said, “This Michael Kirsten is...”<br/><br/>Daisy blinked, closed the document, and opened the second file, saying, “Edward’s grandfather.”<br/><br/>Holt looked at Kevin and then at Daisy, seeing that they were both unfazed, showing no particular reaction, he said, “So ... Edward killed in Cold Green Village because Victoria Zane bombed the lab, right? Just like the homeless man in Truro City, who was killed in 319 for betraying Edward’s father.”<br/><br/>As the file opened, Daisy scrolled through the file without a word.<br/><br/>However, Kevin said, “Yeah, probably.”<br/><br/>Daisy turned to look at Kevin.<br/><br/><br/><br/>Seeing her look at Kevin, Holt secretly grimaced behind them. If I speak, you can’t hear, but if he speaks, you look at him.<br/><br/>Kevin also looked at Daisy. “I think so.”<br/><br/>Daisy pursed her lips, looked back at the computer, hesitated, and then said, “My grandmother went into the lab right after graduation and spent more than a decade there, mainly researching Immortal. All of this is almost related to 319.”<br/><br/>Kevin said, “Main ingredient of 319 is...”<br/><br/>“Yes. If my grandmother recorded...” Daisy took a shallow breath and said softly, “These things are too important for us.”<br/><br/>Daisy and Kevin have read only a few of the thousands of files.<br/><br/>They are almost all about the research process, experimental data. The content is so vast that they can’t finish it all immediately.<br/><br/>At half-past three in the morning, Kevin checked the time, squeezed Daisy’s hand, and said, “Miss, don’t look anymore, it’s too late.”<br/><br/>Checking the time, Daisy closed the file and woke Holt, who had fallen asleep on a chair nearby.<br/><br/>“What’s up? Is it breakfast time?” Holt, somewhat dazed, looked at Daisy’s face and snapped back to reality a bit, “Did you finish?”<br/><br/>“No.” Daisy said, “Backup all these things in two places. Then send one to me and one to Kevin.”<br/><br/>Holt: “Okay. It’s just that there’s a ton of this stuff, so it may take a while.”<br/><br/><br/><br/>“Okay.” Daisy stood up and said, “I’ll go ahead.”<br/><br/>On the way home, Kevin was driving, Daisy was in the co-pilot seat with her eyes closed. A few minutes later, Daisy said, “Kevin, find a few people in the research institute who are trustworthy and tight-lipped. I’m worried the institute is also not safe.”<br/><br/>“Alright.” Kevin said, “Get some sleep.”<br/><br/>Daisy closed her eyes and remained silent for a while. “I can’t sleep.”<br/><br/>Having stopped at a red light, Kevin reached out and touched Daisy’s face, saying, “I heard Uncle Lane mention a little about the explosion in Continent F years ago.”<br/><br/>Daisy opened her eyes to look at him.<br/><br/>“The report at the time was about a severe casualty loss due to a lab error,” Kevin said. “Uncle Lane said... the actual death toll was much higher than reported, and... the number of deaths was much higher than the number of registered lab staff.”<br/><br/>“Were they the ones being experimented on?” Daisy asked.<br/><br/>The explosion was too significant and was probably going to attract attention, so it’s likely they threw those being experimented on into the explosion site.<br/><br/>To cover the truth and then buy off the reports.<br/><br/>“Yes.” Kevin said, “The lab was bombed twice, once on the day, and again a day later.”<br/><br/><br/><br/>Daisy furrowed her brows.<br/><br/>“There are many doubts. But that era had no internet, a backward economy, and an incomplete legal system,” Kevin said. “And... mainly because the evidence was destroyed cleanly, so... even though there were many suspicions, it gradually subsided over time.”Upstodatee from n(0)/ve/lbIn/.(co/m<br/><br/><br/><br/>“Little girl, little girl, little girl...” Kevin Clark was rubbing Daisy Zane’s hand as he called her. At first, despite calling out several times, she didn’t wake up.<br/><br/>Just as he was about to give up calling and let her continue sleeping by granting her a leave, Daisy Zane opened her eyes.<br/><br/><br/><br/>Kevin Clark smiled a little, in a gentle voice, “Awake now?”<br/><br/>Daisy Zane stared at him blankly for a bit, then she suddenly closed her eyes and covered them with her hand.<br/><br/>Kevin Clark: “?????” He was completely baffled by her reaction.<br/><br/>“What’s wrong?”<br/><br/>Daisy Zane, still covering her eyes, took a moment to calm down and said, “It’s fine. What time is it?”<br/><br/>Kevin Clark told her the time and noticed that her ears were very red.<br/><br/>Could this mean...<br/><br/>“Madam, did you have a dream?” Kevin Clark asked with a smile.<br/><br/>Daisy Zane opened her eyes and, without looking at Kevin Clark, replied coldly, “No.”<br/><br/>Kevin Clark chuckled.<br/><br/>Daisy Zane shot him a glare.<br/><br/>Kevin Clark cupped her face, forcing her to look at him, “What did you dream about?”<br/><br/>Being forced to look at him, the scenes from her dream gradually became clearer.<br/><br/>She was very young in the dream, and so was Kevin Clark, possibly not even ten years old.<br/><br/>The events in her dream were real and had indeed happened before.<br/><br/>Brother Arthur...<br/><br/>Suddenly, Daisy Zane closed her eyes again.<br/><br/>Her face bore an expression of speechlessness.<br/><br/>Kevin Clark had never seen her in such a silent, speechless state... so regretful.<br/><br/>“What’s wrong?” Kevin Clark stopped teasing her.<br/><br/>Daisy Zane remained silent.<br/><br/>Brother Arthur, Brother Arthur...<br/><br/>That babyish voice...<br/><br/>Those crude acting skills...<br/><br/>That melodramatic plea for comfort...<br/><br/>There must be something wrong with her memory.<br/><br/>That certainly wasn’t her.<br/><br/>It wasn’t her.<br/><br/>IT WASN’T HER!\t\t\t\t\t\t</div>", "images": {}, "success": true}