{"id": 464, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14827699.html", "title": "Chapter 461: 404: Handwriting", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 461: 404: Handwriting</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t  Chapter 461: 404: Handwriting<br/><br/>Only little Charles Amos was left at home with Elina Clark and Natalie Wayne.<br/><br/>“It’s nice to have a child at home, my father is more spirited than before.” Theo Clark and his wife came back to the old house for a meal.<br/><br/>“He even wanted to go skating with Charles yesterday.” Natalie Wayne said, “I stopped him at the entrance. He’s over eighty years old and has no idea.”<br/><br/>Seeing that he was going to be scolded again, Elina Clark silently got up and walked upstairs: “I’ll go check on Charles practicing his handwriting.”<br/><br/>Natalie Wayne glanced at him, indifferent.<br/><br/>Theo Clark and Calvin Stewart laughed quietly.<br/><br/><br/><br/>Calvin Stewart asked, “Did Arthur and Lucia mention any plans for having children?”<br/><br/>Natalie Wayne replied, “Arthur is too busy, and Lucia’s career is just beginning; I’m afraid it will be a few more years.”<br/><br/>“No need to hurry. Charles is still young; by the time he grows up and they have kids, there will be more children to keep you and dad company,” Calvin Stewart said.<br/><br/>“In a few years... Enamel Cannon will have children too, it’ll be lively then.”<br/><br/>Calvin Stewart laughed: “Enamel Cannon... Enamel Cannon needs to find a girlfriend first.”<br/><br/>Natalie Wayne smiled.<br/><br/>Upstairs in the study room.<br/><br/>Charles was practicing his handwriting, and Elina Clark stood behind him watching.<br/><br/>While watching, he suddenly said, “This handwriting... it’s getting more and more like your Second Uncle’s.”<br/><br/>“Second Uncle?” Charles looked up at him, “The one from the photo?”<br/><br/>“Yes.” Elina Clark touched his hair, “Oh, you should call him Second Uncle Davis.”<br/><br/>Charles looked at his own writing, then looked back at his grandfather and asked, “Very similar?”<br/><br/><br/><br/>“Somewhat similar.” Elina Clark thought for a moment, walked to the bookshelf, picked up a stack of Finn Clark’s old papers, and showed it to Charles. “Look, these are the papers your Second Uncle Davis wrote. Aren’t they a bit alike?”<br/><br/>Charles looked at the papers with his head resting on Elina Clark’s arm, and after a while, he suddenly widened his eyes and sat up straight.<br/><br/>“What’s wrong?”<br/><br/>Charles couldn’t tell if his writing was similar to the writing on the papers, but... the writing on the papers was just like his dad’s.Cheêck out latest novels on n/o/ve/l/bin(.)c/o/m<br/><br/>“Grandpa, wait for me, I will be right back.”<br/><br/>As soon as Charles got off the chair, he ran out of the study.<br/><br/>“Where are you going?” Elina Clark asked.<br/><br/>“Just wait here; I’ll be back soon.”<br/><br/><br/><br/>“Can grandpa see it?”<br/><br/><br/><br/>“Yeah.” Charles took out his cell phone, found a photo of Jack Amos, and handed it to his grandfather, “Grandpa, here.”<br/><br/>Elina Clark took the cell phone and looked at the photo.<br/><br/>It wasn’t Finn Clark, not his son.<br/><br/>Elina Clark exhaled a long breath, pinching the bridge of his nose, “Is this your father?”<br/><br/>“Yes.” Charles nodded.<br/><br/>Elina Clark stared at the photo on the phone.<br/><br/>The handwriting was just like Finn Clark’s, and not just that, even the tone of the letters was similar.<br/><br/>But this person...wasn’t his son.<br/><br/>“Grandpa, what’s wrong?”<br/><br/>“Nothing, nothing.” Elina Clark touched Charles’ little head, “Keep the letters safe and don’t show them to grandma.”<br/><br/>Charles saw the look on Elina Clark’s face and didn’t ask any more questions, so he agreed.<br/><br/><br/><br/>In the evening, Charles went back to the North Court to sleep.<br/><br/>Elina Clark couldn’t sleep after Natalie Wayne went to bed.<br/><br/>His head was full of the writing from the letters over and over again.<br/><br/>That was Finn Clark’s handwriting, and he wouldn’t mistake that. The tone...was also Finn Clark’s.<br/><br/>But Finn Clark did die, and the person in the photo was indeed not Finn Clark.<br/><br/>However...Charles looked like Arthur North and Natalie Wayne. How could this be explained?<br/><br/>Elina Clark pondered all night and still couldn’t figure it out.<br/><br/>So the next morning, he took Charles’ hair, Natalie Wayne’s hair, and his own hair...to the hospital assessment center.<br/><br/>The Assessment Center charged an expedited fee, but since it was a generational test, the expedited result would take a little longer. At the fastest, it would take twelve hours.<br/><br/>So Elina Clark returned home first and didn’t go back to the hospital that night, but went early the next day.<br/><br/>Elina Clark seldom attended so diligently, especially when it came to catching up with the outside world, and he acted suspiciously like a thief.<br/><br/>Natalie Wayne gave him countless opportunities to confess, but...he mentioned nothing.<br/><br/>If this were the days of youth, Natalie Wayne would have believed that he had other people in his life.<br/><br/>However, he was now so old... other than looking at his family property, he was over eighty...<br/><br/>But for the family property...the only part that Elina Clark had was in Natalie Wayne’s name.\t\t\t\t\t\t</div>", "images": {}, "success": true}