{"id": 465, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14827702.html", "title": "Chapter 462: 405 Are You Sure He’S Not Your Son?", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 462: 405 Are You Sure He’S Not Your Son?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t  Chapter 462: 405 Are You Sure He’s Not Your Son?<br/><br/>She sat in a chair in the corridor, calming herself for a while before opening the identification report.<br/><br/>Elina directly looked at the result. Her pupils shivered violently for a moment, and then she quickly opened the other one.<br/><br/>The results on both were the same.<br/><br/>Both confirmed blood relations between the two sides.<br/><br/>Looking at the two identification results, Elina’s lips started to tremble bit by bit.<br/><br/>She was breathing heavily, constantly calming herself, but in the end she still lifted her hand to cover her eyes.<br/><br/><br/><br/>Her straight back also bent down, with her shoulders slightly trembling.<br/><br/>Elina sat in the chair in the corridor until noon without leaving.<br/><br/>She was in a hurry when she left in the morning, and she didn’t take her cell phone.<br/><br/>Natalie Wayne kept making phone calls to the driver.Cheêck out latest novels on n/o/ve/l/bin(.)c/o/m<br/><br/>The driver indeed informed Natalie about the specific location of the hospital.<br/><br/>When Natalie found it, Elina was still sitting in the chair, as if she hadn’t moved.<br/><br/>“Brother Louis?”<br/><br/>Upon hearing Natalie’s voice, Elina came back to her senses. She looked up at Natalie and said with a hoarse voice, “Lily, why did you come?”<br/><br/>“Brother Louis? What happened?” Natalie Wayne asked, full of concern.<br/><br/>“Nothing, it’s nothing.” Elina held her hand, feeling how cold it was. She put the two reports aside and covered Natalie’s hands with hers.<br/><br/>Only... His hands were also not very warm.<br/><br/>“I’m fine, why didn’t you go home?” Natalie asked, “What is this?”<br/><br/><br/><br/>Natalie pulled her hand out to pick up the two reports: “DNA Identification?”<br/><br/>She opened the two reports. First she saw the names of Charles Amos and Elina, then she looked at the results.<br/><br/>After reading the results, she frowned and hurriedly looked at the other one, which was hers and Charles Amos’s.<br/><br/>The result was the same.<br/><br/>Natalie stared at the two results for a moment, then asked, “Is Charles... really Arthur North’s child?”<br/><br/>Elina put the reports aside again, holding Natalie’s hand, and said, “Lily... The day before yesterday... I thought Charles’s handwriting looked somewhat like Edward North’s.”<br/><br/>Natalie’s pupils shuddered for a moment.<br/><br/>“I showed Charles the Little Brother’s handwriting, and then... Charles went to get a letter written by his father. The handwriting on the letter was the same as Little Brother’s.”<br/><br/>Natalie suddenly held Elina’s hand tightly, her eyes wide open in disbelief as she looked at him.<br/><br/>“But... The photo of Charles’s father that Charles showed me... It’s not Edward North.” Elina spoke slowly, “I was confused, so I came to do the identification. According to this identification result... Charles is our biological grandson. If this child has no relation with Theo Clark and Arthur North...”<br/><br/><br/><br/>Kevin Clark thought so, and so did Theo Clark and Hugo Clark.<br/><br/>From the look on their faces, Elina Clark knew what the three of them were thinking and said irritably, “What are you thinking! There’s another report!”<br/><br/>He had them do another one with Charles Amos and Natalie Wayne, because he was afraid they would think this way.<br/><br/>Each and every one of them were rebels!<br/><br/>When they finished reading the other one, Theo Clark suddenly said, “You and mom have another child, so we are four brothers?”<br/><br/>Kevin Clark’s eyelashes trembled slightly.<br/><br/>It’s not Harris Kirsten, so it must be Jack Amos who is his family.<br/><br/>Natalie Wayne and Elina Clark both glared at them.<br/><br/>Everyone was a little stunned, waiting for the two of them to speak.<br/><br/><br/><br/>Elina Clark paused and said, “The handwriting of Charles Amos’s father is the same as Edward North’s.”<br/><br/>Kevin Clark’s clenched his hand at his side immediately.<br/><br/>Hugo Clark furrowed his brow.<br/><br/>Theo Clark blurted out, “What?!”<br/><br/>Calvin Stewart and Hardy Clark were also dumbfounded.<br/><br/>“But the father in the photo that Charles Amos has, it’s not Edward North.” Elina Clark looked at Kevin Clark and said, “Are you sure Charles Amos isn’t your child? I mean, your biological son.”<br/><br/>Kevin Clark was at a loss for words.<br/><br/>Charles Amos was a child Harris Kirsten and Jack Amos had, from pregnancy to birth to growth, all under the watchful eyes of the little girl.<br/><br/>Charles Amos was the child of Harris Kirsten and Jack Amos, there’s no mistake about that.<br/><br/>So, Charles Amos wouldn’t have any relation to him, let alone any connection with his older brother or Hugo Clark.<br/><br/>And as for Henry Clark... If it were someone related to Henry Clark, the DNA match would not be so high.<br/><br/>Then Jack Amos...<br/><br/>“Are you sure it’s just us three?” Kevin Clark counter-asked.<br/><br/>Elina Clark: “...... We are very sure that it is just the three of you!”<br/><br/>Kevin Clark furrowed his brow.<br/><br/>Seeing his reaction, Theo Clark had an idea: “But... Edward North was at the border...”<br/><br/>Kevin Clark clenched his hand and said: “We did not see the body.”<br/><br/>“But the environment was extremely harsh on the snowy mountain, with almost no survival chances.” Theo Clark said.<br/><br/>The day Edward North left on his mission, the snow was unusually heavy, and the vast snowy plains were endless. It wouldn’t take long to bury a person. Let alone a person who had been shot.\t\t\t\t\t\t</div>", "images": {}, "success": true}