{"id": 469, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14827714.html", "title": "Chapter 466: 409: A Set-Up?", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 466: 409: A Set-Up?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t  Chapter 466: 409: A Set-up?<br/><br/>At the Research Institute, Kevin Clark and William Lane led a small group to study the contents of the storage card.<br/><br/>On the drama crew’s side, Daisy Zane would also look at the card’s contents whenever she had time, and visited the Imperial Capital University Laboratory during her spare time.<br/><br/>Since the drama started shooting again, Daisy Zane had been scolded several times and made it onto the hot search list.<br/><br/>Both the company and her personally did not respond anymore.<br/><br/>Moreover, the number of stand-ins on the drama crew’s side had increased significantly, and they couldn’t be stopped.<br/><br/>During Daisy Zane’s break, she saw a drone flying overhead for the third time, and felt the urge to shoot it down with a sniper rifle.<br/><br/><br/><br/>“Daisy, you’ve been so busy lately that you’ve lost weight,” Anisa Cooper said as she sat beside her.<br/><br/>“You’ve gained at least five pounds,” replied Daisy Zane without lifting her head from the computer.<br/><br/>Anisa Cooper immediately touched her face and said dejectedly, “I’ve been eating too much lately.”Cheêck out latest novels on n/o/ve/l/bin(.)c/o/m<br/><br/>“It’s good to gain some weight,” Daisy Zane glanced at her, “You look better when you’re a bit chubbier.”<br/><br/>Anisa Cooper immediately burst into laughter, “Brother Miller also said that I’m getting more and more beautiful.”<br/><br/>Daisy Zane laughed.<br/><br/>Anisa Cooper said, “Brother Miller said that Daisy is my nobleman. After meeting Daisy, I’ve been encountering good things constantly.”<br/><br/>“You yourself are your own nobleman,” Daisy said. Just then, the director called her over to shoot.<br/><br/>Anisa Cooper packed up her computer, carried it in her hand, and immediately followed her to the shooting location.<br/><br/>After finishing the morning scene, it was time for the night scene.<br/><br/>They could rest in the afternoon, so Daisy Zane and Anisa Cooper didn’t eat at the drama crew’s area but went straight back to the hotel after shooting.<br/><br/>The nanny car drove out of the drama crew’s location but hadn’t reached the main road yet.<br/><br/><br/><br/>The driver suddenly stopped.<br/><br/>Anisa Cooper was browsing Facebook, checking who was badmouthing her Sister today, when suddenly the car stopped. She looked up at the driver, “What’s wrong?”<br/><br/>“An old man is stopping the car.”<br/><br/>Anisa Cooper’s eyes widened instantly. Seeing that Daisy Zane had her eyes closed, she whispered, “No way! There are fraudsters here!”<br/><br/>Daisy Zane, who had wanted to take a nap, opened her eyes upon hearing her voice, and also looked ahead.<br/><br/>An old man stood by the roadside, with white hair, wearing a long black down jacket, leaning on a cane in his left hand, and waving his right hand to stop the car.<br/><br/>He was a bit far away, so they couldn’t see his face clearly.<br/><br/>But it was evident that he was in good spirits, and he had an excellent presence.<br/><br/>The driver said, “He doesn’t look like a fraudster.”<br/><br/>“Even if he’s not, be careful. If something happens, we’ll be in trouble,” Anisa Cooper said. “Even if we’re right, we’ll become the wronged party because we’re public figures. It would always be our fault.”<br/><br/><br/><br/>Anisa was about to make the call.<br/><br/>Old Master Lane stopped her, “Young lady, no need to bother the police. I know the address. Can you see if it’s convenient to call a car for me and take me back? You can leave me your contact information, and I’ll have someone give you the money when I get home. Or... I can pawn my watch to you.”<br/><br/>He really missed his granddaughter, that’s why he came looking for her.<br/><br/>As a stranger, it’s good to have a chat. Even if they don’t talk, it’s still good to look at each other.<br/><br/>Anisa hesitated for a moment, thinking that it would be better for both parties to be safe if he knew the address and they could still call the police directly, “Grandfather, it’s not convenient to call a car here. Let’s ask the police uncle for help.”<br/><br/>Old Master Lane: “......” How could he bother the police for his own affairs.<br/><br/>“Um, well...”<br/><br/>“Haven’t you had lunch yet?” Daisy Zane suddenly spoke up, interrupting Old Master Lane’s impromptu coping strategy.<br/><br/>Old Master Lane paused for a moment, then said, “Not yet.”<br/><br/><br/><br/>Anisa looked at Daisy Zane, “Daisy?”<br/><br/>Daisy Zane rubbed her fingertips together, “Let’s have a meal first. After that... I’ll have the driver take you.”<br/><br/>Anisa:<br/><br/>Old Master Lane gripped his cane and said, “Alright. Thank you, Miss.”<br/><br/>Daisy Zane let Old Master Lane get into the car first, and when she tried to get on, Anisa pulled her back.<br/><br/>“Daisy, do you know him?”<br/><br/>Daisy Zane just gave silent consent.<br/><br/>Anisa breathed a sigh of relief, “That’s good, that’s good. I was just saying, my Daisy can’t be deceived. But... we might have been photographed just now. I’m afraid people will gossip online again.”<br/><br/>Daisy Zane looked at Anisa and then patted her head, “Don’t worry.”<br/><br/>“Huh??”<br/><br/>Anisa didn’t understand Daisy Zane’s words, but shortly after she got in the car, she kept observing Old Master Lane.<br/><br/>Upon observing him, she suddenly recognized him.<br/><br/>Then she immediately did a search, and the news online was from more than thirty years ago, so were the photos.<br/><br/>But if you look closely, you can still see the resemblance.<br/><br/>In that instant, Anisa felt like she almost fainted.<br/><br/>She was with whom in the car.<br/><br/>She initially thought who was trying to scam.<br/><br/>She thought who was a fraudster and a bad person!<br/><br/>With this identity, who would dare to take photos and post them online.\t\t\t\t\t\t</div>", "images": {}, "success": true}