{"id": 460, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14827687.html", "title": "Chapter 457: 400: Return To The Homeland", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 457: 400: Return To The Homeland</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t  Chapter 457: 400: Return to the Homeland<br/><br/>But everyone discussed and decided to return home immediately.<br/><br/>At least it’s safe in the country.<br/><br/>So the guards were replaced by Thomas Firway’s men, and the original bodyguards stayed behind to deal with the aftermath.<br/><br/>After more than ten hours on the plane, everyone breathed a sigh of relief as soon as it landed.<br/><br/>Finally home, finally safe, finally at ease.<br/><br/>Everyone went to the research institute for a meeting first and reported on their support in Continent A.<br/><br/><br/><br/>Then... each person handed in a summary report.<br/><br/>Daisy Zane was not considered part of the research institute, so she wanted to slip through not writing the report. However, as a student of Kevin Clark and having gone to Continent A together, the report had to be written.<br/><br/>There was no escape.<br/><br/>At the end of the meeting, Ezekiel Santiago even asked Kevin Clark and Daisy Zane to stay.<br/><br/>As soon as the others left and the meeting room door closed, Ezekiel Santiago’s eyes lit up.<br/><br/>This light... was full of gossip.<br/><br/>“What’s going on between you two? How do I hear...that you two are quite ambiguous?”Fôll0w current novÊls o/n n/o/(v)/3l/b((in).(c/o/m)<br/><br/>Daisy Zane:<br/><br/>Kevin Clark looked at him: “Is it wrong for a legal couple to be ambiguous?”<br/><br/>“!!” Ezekiel Santiago glared, “Legal couple? You two got married?! When did this happen? How come I didn’t know?”<br/><br/>“It happened last year.” Daisy Zane said.<br/><br/>Ezekiel Santiago looked at the two of them in amazement for a while and then said to Kevin Clark, “You little bastard, you’ve gone too far. You’ve just abducted a good seedling that I’ve found so hard.”<br/><br/><br/><br/>Kevin Clark:<br/><br/>“Hey? No, no. You two are married? And you don’t know each other’s identities?”<br/><br/>Kevin Clark:<br/><br/>Daisy Zane:<br/><br/>What’s the big deal about getting married? Aren’t there many things they don’t know about each other? What’s the difference of one more?<br/><br/>Ezekiel Santiago looked at their cold faces and laughed softly, “Oh, Kevin, who was telling me recently... that Nicholson Amos’s attitude is problematic and not suitable for entering the research institute.”<br/><br/>Kevin Clark just picked up a cup of tea, and it spilled all over his hand.<br/><br/><br/><br/>Kevin Clark said, “The factions within the M Continent Laboratory are also divided, and some people are afraid of having other intentions for power struggles.”<br/><br/>“We should also pay more attention internally.” Ezekiel Santiago said, “The research institute involves the interests of various families, so we must be prepared.”<br/><br/>Kevin Clark nodded.<br/><br/><br/><br/>Daisy Zane listened quietly to their conversation without participating in their topic.<br/><br/>After the three finished chatting, Kevin Clark and Daisy Zane left.<br/><br/>As soon as the two of them stepped out of the meeting room, they saw Turner Daniel standing outside the door.<br/><br/>Turner Daniel was stunned when he saw Daisy Zane, then glanced at Kevin Clark and said, “Sister Xie, what are you doing here?”<br/><br/>Daisy Zane glanced at the folder in his hand. The last time she heard news about Turner Daniel was when he left the circle, and then there was no news. She didn’t expect him to join the research institute: “Looking for the Dean?”<br/><br/>“Yeah.”<br/><br/>“He’s inside.”<br/><br/>Turner Daniel nodded and pushed the door into the meeting room in some confusion.<br/><br/>Meanwhile, Kevin Clark looked at Turner Daniel and asked, “Who is he...?”<br/><br/>“The dean’s grandson.”<br/><br/>Kevin Clark raised his eyebrows, “What a coincidence.”<br/><br/>Daisy Zane suddenly thought of Siera Santiago from the Mountain Sea Continent: “Siera Santiago... ”<br/><br/><br/><br/>“As Madam thought.” Kevin Clark took her hand and walked out, “The dean’s granddaughter. Turner Daniel’s cousin. A few years ago, her parents died in an experimental explosion. Her father was very good to me when he was alive, both as a teacher and a friend. So I took care of her a bit.”<br/><br/>Daisy Zane nodded, “You should.”<br/><br/>As the two of them left the research institute and got into the car, Daisy Zane took the note from Kevin Clark’s pocket and looked at it again.<br/><br/>She indeed didn’t recognize the handwriting, but since the other party knew Edward Kirsten, she always vaguely felt that she should know this person.<br/><br/>“If this person’s words are true. How does he know that M Continent is cooperating with Edward Kirsten? And why doesn’t he show his face.”<br/><br/>Kevin Clark was also thinking about this.<br/><br/>Daisy Zane said again, “He even pointed out to give the note to you or me. He knows us both... and seems to understand us well.”<br/><br/>Kevin Clark said, “The matter about Edward Kirsten has always been very confidential, and not many people know about it. This person knows Edward Kirsten, knows you, knows me, and may also know about the M Continent Laboratory.”<br/><br/>For someone who meets these conditions... neither Kevin Clark nor Daisy Zane could think of a specific person.<br/><br/>Because starting from the direction of Edward Kirsten, there were no acquaintances for Kevin Clark.\t\t\t\t\t\t</div>", "images": {}, "success": true}