{"id": 467, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14827708.html", "title": "Chapter 464: 407 Victoria Zane", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 464: 407 Victoria Zane</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t  Chapter 464: 407 Victoria Zane<br/><br/>They had dinner and went back to the hotel together.<br/><br/>But as soon as they arrived at the hotel, and before they had a chance to wash up, Holt Lawrence called.<br/><br/>Daisy Zane answered the phone: “Has the storage card been decrypted?”<br/><br/>“Yes.”<br/><br/>“What’s inside?” Daisy Zane asked.<br/><br/>Holt Lawrence hesitated for a moment and said, “Well... I don’t understand ninety percent of the content. The part I can understand is about Victoria Zane’s identity. Do you have time? Can you come over? The content is too huge to be transmitted. If you want to see it now, you have to come to Celestial Pivot. Otherwise, just wait.”<br/><br/><br/><br/>Daisy Zane’s eyelashes trembled slightly, “I’ll be right there.”<br/><br/>So Kevin Clark took Daisy Zane to Celestial Pivot.<br/><br/>Kevin Clark entered the core area of Celestial Pivot for the first time.<br/><br/>The area was large and had a strong sense of technology.<br/><br/>At the same time, it was evident that people who usually stayed here were very introverted.<br/><br/>There were clothes and blankets thrown on the chairs.<br/><br/>“Third Master.” After Holt Lawrence greeted him politely, he whispered to Daisy Zane, “Does he still not know about the situation between you and William Lane?”<br/><br/>Daisy Zane looked at him coldly: “Do you believe that I will have a lawyer’s letter on your desk tomorrow?”Fôll0w current novÊls o/n n/o/(v)/3l/b((in).(c/o/m)<br/><br/>Holt Lawrence shut up immediately.<br/><br/>Daisy Zane walked straight to the computer, pulled a chair for Kevin Clark, and then both sat in front of the computer.<br/><br/>There were thousands of files in the storage card.<br/><br/>Except for the first one, each file was vast.<br/><br/><br/><br/>So Daisy Zane opened the first one.<br/><br/>Inside was a document, and the first sentence was: [There are always people beyond people, and heavens beyond heavens. Someone finally decrypted my storage card, but it’s a shame we can’t meet face to face.]<br/><br/>“Actually, it’s not a pity. Nana met her.” Holt Lawrence was standing behind them, holding a thermos cup in his hand.<br/><br/>Daisy Zane ignored him, and Kevin Clark didn’t speak either.<br/><br/>Both were looking down at the document.<br/><br/>The content in the entire document was a general self-introduction from Victoria Zane.<br/><br/>Victoria Zane’s English name is Clara.<br/><br/>The name Victoria Zane was adopted after moving to the domestic country.<br/><br/>More than sixty years ago, Victoria Zane and her husband were staff members of the Immortal Laboratory in F Continent.<br/><br/>Both were talented graduates in the pharmaceutical formulation major.<br/><br/><br/><br/>But a year later, Victoria Zane and her husband discovered that Michael Kirsten was conducting experiments on human subjects.<br/><br/>As a result of this incident, both sides had a big fight.<br/><br/>Michael Kirsten’s reason given was “survival of the fittest.”<br/><br/>Evolution needed pressure; otherwise, it wouldn’t progress. With thousands of years of history, it would probably take another few thousand years for human evolution to advance significantly.<br/><br/>However, Victoria Zane and her husband believed that he wasn’t accelerating evolution with these actions, but rather hastening extinction.<br/><br/>They were most familiar with their research.<br/><br/>Doing this would be sending humanity towards extinction.<br/><br/>Both sides continued to argue, defending their respective viewpoints.<br/><br/>In the end, Victoria Zane and her husband’s research were suspended, but Michael Kirsten’s experiments did not stop completely.<br/><br/>For three more months, Victoria Zane and her husband witnessed more and more people developing brain death-like conditions due to the experiments.<br/><br/><br/><br/>The elixir developed from the research was named Immortal.<br/><br/>Upon injection, the human body showed no reaction for half a month.<br/><br/>But... after half a month, symptoms similar to brain death would appear.<br/><br/>The number of such cases continued to increase, and Michael Kirsten became more and more insane.<br/><br/>He even increased the dose, accelerating death.<br/><br/>So to prevent Michael Kirsten from harming more people,<br/><br/>Victoria Zane and her husband blew up the laboratory, destroying the elixir they had researched for ten years.<br/><br/>Everything has its arrangements. When human beings evolve to that level, naturally, someone will be able to research an elixir like the extract from Drunken Life Grass again.<br/><br/>The laboratory was bombed, and Victoria Zane and her husband were hunted down.<br/><br/>On the way to escape to the domestic country, Victoria Zane’s husband was killed by Michael Kirsten’s people.<br/><br/>So Victoria Zane fled to the domestic country alone.<br/><br/>She took the name Victoria Zane, found Claudia Zane, and raised her to adulthood.<br/><br/>All the content on the storage card, including several layers of encryption, was created when Victoria Zane bought a computer after Claudia Zane went to Truro City University. She recorded all the research results based on her memory.<br/><br/>Then she also left this self-narrative.<br/><br/>Originally, she wanted to take all the research results with her after her death.<br/><br/>But in the end, she couldn’t let go.<br/><br/>Moreover, she and her husband both conducted the research.<br/><br/>So, she finally recorded it.\t\t\t\t\t\t</div>", "images": {}, "success": true}