{"id": 466, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14827705.html", "title": "Chapter 463: 406: It’S Him", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 463: 406: It’S Him</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t  Chapter 463: 406: It’s Him<br/><br/>“Could there be a mistake in Charles’ photo?” Calvin Stewart asked.<br/><br/>Kevin Clark stepped back a few steps and sat down on the chair behind him: “The little girl has seen Second Brother’s photo. If it’s Charles’ father, she wouldn’t keep quiet about it.”<br/><br/>After he finished speaking, the living room suddenly fell silent for a while.<br/><br/>Kevin Clark’s eyes stared at one spot, constantly rubbing his fingertips.<br/><br/>After a while, Hugo Clark said: “With today’s technology, changing a person’s appearance...shouldn’t be difficult.”<br/><br/>Although the photo doesn’t match. Although they don’t know why someone “returns from the dead”, why they don’t return home, or why they change their appearance.<br/><br/><br/><br/>But...all the results point to Jack Amos being Finn Clark.<br/><br/>Charles Amos’ DNA test wouldn’t lie.<br/><br/>The handwriting wouldn’t lie.<br/><br/>“It’s Finn, it’s Finn, it must be Finn.” Natalie Wayne suddenly said, “It’s Finn!”<br/><br/>“Mom, don’t get too excited, calm down.” Theo Clark said.<br/><br/>“Where is he? What happened to him? Why has Daisy been raising Charles?” Natalie Wayne looked at Kevin Clark.<br/><br/>Kevin Clark’s lips moved slightly, and the hand by his side slowly clenched, white-knuckled with force. After a while, he said: “Charles’ father passed away when he was one year old.”<br/><br/>Twenty-two knives, stabbed thirty-two times...<br/><br/>It was done by Edward Kirsten.<br/><br/>Kevin Clark controlled his emotions, lowered his gaze, and concealed the emotions in his eyes.<br/><br/>Natalie Wayne covered her mouth and began to cry quietly.<br/><br/>She had thought of this outcome, but it was still hard to hear.<br/><br/><br/><br/>Elina Clark let out a gentle breath, gently patting Natalie Wayne’s back: “It’s all right, madam. Charles is back with us. He is Finn’s blood.”<br/><br/>Natalie Wayne leaned on Elina Clark’s shoulder.<br/><br/>Calvin Stewart and Hardy Clark also had red eyes.<br/><br/>The living room fell silent again, only the sound of Natalie Wayne’s quiet sobbing could be heard.<br/><br/>Kevin Clark, with his gaze downcast, said after a while: “No one should tell the little girl, or tell Charles.”<br/><br/>Everyone looked at him.<br/><br/>Hugo Clark pursed his lips without saying a word. Theo Clark asked, “Why?”<br/><br/>“Just don’t tell them, pretend you don’t know.” Kevin Clark finished speaking and stood up, not even looking at them, “I have other things to do, I’ll leave first.”<br/><br/>Everyone watched Kevin Clark leave without saying anything.<br/><br/>Finn Clark’s departure had a great impact on Kevin Clark, even changing the course of his entire life.<br/><br/>Apart from Mr. &amp; Mrs. Clark, the shock to Kevin Clark was probably the greatest.<br/><br/>Kevin Clark walked towards the entrance without looking back.<br/><br/><br/><br/>He set out from the manor, went to the Outer Ring, drove at a fast speed, and circled around the ring before heading to the film set.<br/><br/>When he arrived at the film set, Daisy Zane hadn’t finished filming, so Kevin waited for her.<br/><br/>During a break in filming, Kevin took Daisy directly onto the nanny car.<br/><br/>Getting onto the car, he turned on the heating inside and held Daisy’s hand.<br/><br/>Wrapped in her down jacket, Daisy asked, “Why did you suddenly come over?”<br/><br/><br/><br/>Kevin replied, “There was nothing to do, so I came.”<br/><br/>Daisy stared at him for a while, then said, “The Research Institute is magical, isn’t it, Third Master? Busy with no time for breakfast in the morning, and then nothing to do in the afternoon.”<br/><br/>“It’s Thomas Firway reporting to you again.”<br/><br/>Daisy raised her eyebrows, “If you scold him, he’ll tell me too.”<br/><br/>Kevin took a light breath.<br/><br/>Daisy smiled, “Come on, what’s up?”<br/><br/>“I missed you.”<br/><br/>When do you not miss me?” Daisy said, “Kevin Clark, you didn’t even wear a proper jacket when you came out.”<br/><br/>Kevin looked down at himself,<br/><br/>“Don’t tell me it’s in the car,” Daisy said.<br/><br/>Kevin hesitated for a moment, then hugged her tightly, burying his face in her shoulder, and said in a muffled voice, “There really is nothing. I just suddenly wanted to see you.”<br/><br/>And also to thank you in person.<br/><br/>But I’m afraid you’d be suspicious if I said it, so I just said it silently in my heart.<br/><br/>Jack Amos is Edward North.<br/><br/>He dared not tell Daisy Zane.<br/><br/>Daisy had always thought she had harmed Jack.<br/><br/>He was afraid that if he told her, the little girl would feel guilty and that she owed him.<br/><br/>Little Girl was too sentimental, so he feared she would feel indebted to his family.<br/><br/>Daisy let him hold her and didn’t ask any more questions when she saw that he was unwilling to talk about it.<br/><br/>She held him until Anisa Cooper came to find them, saying the director was urging them. Only then did Kevin release her.<br/><br/>“Will you go back or stay here?” Daisy asked.<br/><br/>“I’ll stay here,” Kevin replied.<br/><br/>“Mmm,” Daisy said, “We’ll finish in about two hours. You just stay here, it’s really cold outside.”<br/><br/>“Alright.” Kevin gave her a quick peck on the corner of her lips, “Be careful when filming.”<br/><br/>“Mmm,” she replied.\t\t\t\t\t\t</div>", "images": {}, "success": true}