{"id": 463, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14827696.html", "title": "Chapter 460 - 403: Picky Eating", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 460 - 403: Picky Eating</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 460: Chapter 403: Picky Eating <br/><br/>At noon, a few people had a meal together at the villa. <br/><br/>At the dining table, Holt Lawrence watched as William Lane first peeled a shrimp for Daisy Zane and then picked a dish for Olivia Lane, suddenly revealing an enlightened look on his face. <br/><br/>And yet, Daisy Zane suddenly remembered how every time they ate when they were younger, William Lane would sit between her and Olivia. <br/><br/>Picking dishes for one sister and then the other sister. <br/><br/>When Daisy Zane thought of that scene, she suddenly raised the corner of her mouth and then put a piece of crown daisy in her mouth. <br/><br/>At the same time, William Lane was startled by her actions, instinctively grabbing her hand. <br/><br/>Daisy Zane had just put the crown daisy in her mouth, with half of it still sticking out. <br/><br/>She turned her head to look at William Lane. <br/><br/>Everyone at the table looked at William Lane. <br/><br/>Except for Olivia, everyone else looked puzzled. <br/><br/>William Lane hesitated and said, “It’s crown daisy.” <br/><br/>Daisy Zane looked down at the half of the vegetable sticking out and gave a “Hmm.” <br/><br/>Seeing her calm and puzzled expression, after a moment, William released her hand and said, “I... thought you didn’t eat it.” <br/><br/>“Young Master Lane, Nana is really good in this aspect, she eats everything,” Holt Lawrence said, “She’s not picky.” <br/><br/>William Lane gave a small smile, “Is that so?” <br/><br/>Although William was smiling, everyone saw the fleeting loss in his eyes. <br/><br/>Olivia looked at her brother and gently pursed her lips. <br/><br/>Daisy Zane put the other half of the crown daisy in her mouth, chewed it, and swallowed it, saying, “The taste is indeed not very good, but it’s nutritious.” <br/><br/>William Lane smiled at her, not saying anything more. <br/><br/>When Charlotte Lane was young, because of her pickiness, the family would cook dishes she didn’t like, but... she preferred not to eat. <br/><br/>In the end, no one in the family could be as obstinate as her. <br/><br/>They allowed her to be picky. <br/><br/>And they were extremely careful to avoid the things she didn’t like to eat. <br/><br/>Because ever since they didn’t correct her pickiness, she would throw tantrums whenever she ate something she didn’t like. <br/><br/>No one in the family wanted to upset her, their little ancestor. <br/><br/>That’s why William Lane was so emotional just now. <br/><br/>Actually, Daisy still didn’t like those things, but later when she was training in M Continent, she ate everything. At that time, who would spoil her? If she didn’t eat, she would starve. <br/><br/>After trying those things, they didn’t seem so bad anymore. <br/><br/>As Daisy Zane ate, she looked up to see Charles Amos using his chopsticks to hold a piece of green vegetable, planning to move it to Holt Lawrence’s bowl. <br/><br/>After regaining his balance, Holt looked back at Daisy Zane and pointed at her, saying, “Nana, you...” <br/><br/>Daisy Zane walked a few steps forward, grabbed his wrist, and stared at him coldly, “If your eyesight is bad, wear glasses. Don’t talk nonsense.” <br/><br/>“Nana, ouch, my wrist,” Holt said. <br/><br/>Daisy Zane released him and said, “If you spread more rumors, I’ll sue you.” <br/><br/>Holt held his wrist, not daring to speak. <br/><br/>When they returned, Daisy Zane still had William Lane drive them to Doomsday Hotel. It would save someone else the trouble of sending them both on another trip. <br/><br/>Then she drove Charles Amos back to Clark Manor. <br/><br/>When they arrived at Clark Manor, Charles was asleep in the car. <br/><br/>Daisy Zane called him twice, but he didn’t wake up. So, she wrapped him in a blanket to keep him from getting cold and carried him down from the car. <br/><br/>After entering Clark Manor and walking for a short while with Charles in her arms, Arthur North came out to greet them. <br/><br/>Upon his return, Arthur North had spoken with the person at the entrance, and Daisy Zane had informed him as well. <br/><br/>Arthur North walked quickly over and took Charles: “How did he fall asleep?” <br/><br/>“He’s drowsy because of a full stomach, and would not wake up.” <br/><br/>Arthur North looked at Charles’s small face wrapped in the blanket, fast asleep. <br/><br/>He carried Charles directly to his parents’ room, then took Daisy Zane back to his own courtyard. <br/><br/>“Here is the cloak my mom made for you,” he said, putting it on her. <br/><br/>It was a red cotton cloak with a white furry collar. <br/><br/>There were also embroidered phoenix feathers on the cloak. <br/><br/>It was just the right length, reaching her ankles. <br/><br/>Daisy Zane looked at it and said, “Thank you, Aunt.” <br/><br/>“There’s also a white one, but it’s not finished yet,” Arthur North said, then handed her a hand warmer, “Your hands get cold in winter.” <br/><br/>“It’s normal to feel cold in winter,” Daisy Zane looked at the gold hand warmer with a beautiful cloth pocket around it, “What’s inside?” <br/><br/>“Charcoal. My mom made it. There’s Eaglewood and Anxiang inside the charcoal,” Arthur North adjusted her hair that had been pressed by the cloak, kissed the corner of her lips, and said, “I asked her for some, and I’ll bring them to the drama crew tomorrow.” <br/><br/>“Hmm.” <br/><br/>“Let’s go back to North Court.” <br/><br/>“Hmm.” <br/><br/>Daisy Zane wrapped herself in the cloak, holding the hand warmer. <br/><br/>Arthur North, wearing a black coat, walked beside her with his arm around her. <br/><br/>They strolled through the courtyard, on the stone path, over the arch bridge... <br/><br/>Blending perfectly with the elegant scenery of the entire courtyard, they became a natural part of the painting.\t\t\t\t\t\t</div>", "images": {}, "success": true}