{"id": 474, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14852421.html", "title": "Chapter 471: 414: Memory", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 471: 414: Memory</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 471: 414: Memory<br/><br/>Kevin Clark forcibly took Daisy Zane out of the laboratory.<br/><br/>The two did not go home, but instead stayed at the dormitory of the research institute.<br/><br/>The dorm rooms at the research institute were all single rooms with double beds. Kevin Clark always had his own fixed residence.<br/><br/>So, upon entering the room, Daisy Zane smelled the scent of eaglewood on Kevin Clark.<br/><br/>This unfamiliar place suddenly became more familiar.<br/><br/>“Go take a bath first.” Kevin Clark found a set of his own home clothes for her, “Wear mine tonight? We’ll have someone bring your clothes tomorrow morning.”<br/><br/>“Okay.”<br/><br/>Daisy Zane took the clothes and went to take a bath.<br/><br/>After her bath, she wore Kevin Clark’s clothes, folding the pants and sleeves. Although they were big, they didn’t look bad on her.<br/><br/>Kevin Clark kissed her, and then used a hairdryer to dry her hair before going to take a bath himself.<br/><br/>After he went to the bathroom, Daisy Zane lay in bed and looked at the messages on her cell phone, and then looked at the news about the Dance Association from that night.<br/><br/>She had intended to wait for Kevin Clark to finish his bath and then tell him about her identity and her relationship with William Lane.<br/><br/>But by the time Kevin Clark came out of the bathroom, she had fallen asleep, leaning against the head of the bed.<br/><br/>The phone’s screen still displayed the final group photo at the end of the Dance Association event.<br/><br/>Kevin Clark walked to the side of the bed and took the phone from her hand, turned it off, and placed it on the bedside table. Then he supported her neck and knees to make her lie flat on the bed and covered her with the quilt.<br/><br/>Daisy Zane knew that Kevin Clark had helped her turn off the phone and made her lie down.<br/><br/>But she didn’t want to open her eyes, not even wanting to look at Kevin Clark, because she was too tired.<br/><br/>So she didn’t want to say what she had planned to say either.<br/><br/>Before falling asleep again, the only thought in her head was, forget the explanation of the relationship, let it be what it will be.<br/><br/>Kevin Clark leaned over and kissed Daisy Zane, waiting for her to fall asleep before lying down on the other side.<br/><br/>Daisy Zane had been too tired these days.<br/><br/>In order to keep up with the schedule, the drama crew filmed one scene after another.<br/><br/>While ensuring progress, they also had to ensure quality.<br/><br/>She originally had no time to rest on the drama crew, and after returning, she went straight to the research institute.<br/><br/>She had no rest today either; high mental activity consumed even more energy.<br/><br/>“Grandpa, Mom and Dad, how come you’re here?” Amelia said, “If only you had told me earlier, I would have come to pick you up.”<br/><br/>Charles Hobson was in a good mood, and he was even happier to see Amelia: “It’s not our first time in the Imperial Capital. There are so many of us; we don’t need you to pick us up.”<br/><br/>Old Master Miles said, “We’ll stay here for a while. Once the house in West Town is renovated, we’ll move there.”<br/><br/>Amelia Miles instantly understood their purpose for coming to the Imperial Capital but still showed a surprised expression, “Grandpa, are you planning on living here permanently?”<br/><br/>Johanes said, “We’ve discussed it and decided to develop our business in the Imperial Capital, gradually moving the Miles Group here.”<br/><br/>“That’s great,” Amelia said excitedly, “It’ll be convenient for the Lane Family to support and help us in the Imperial Capital in the future.”<br/><br/>Amelia’s tone seemed casual and natural.<br/><br/>As if the Lane Family’s support was a given.<br/><br/>But Johanes and Old Master Miles were relieved when they heard this sentence.<br/><br/>They entered the living room.<br/><br/>Amelia went to make tea, while Charles followed her into the kitchen.<br/><br/>As the kitchen door closed, Charles lowered his voice and asked, “Amelia, how is your progress with Young Master Lane?”<br/><br/>“It’s going well. We chatted for a while at the Dance Harmony Gathering. He’s a gentle man, and we get along well,” Amelia said. “Mom, you don’t have to worry. I’ve clearly understood all his likes and dislikes and found his contact information. Everything is under control. I’m determined to become Young Madam Lane.”<br/><br/>Charles was relieved: “If you say you can do it, then you definitely can. Your mom believes in you.”<br/><br/>Amelia smiled, “Dad and Grandpa... they gave up on Daisy Zane.”<br/><br/>Speaking of this, Charles couldn’t hide the smile on her face. She held Amelia’s hand and said, “Amelia, thank you. If it weren’t for you, I would have been finished. After the Dance Harmony Gathering, your grandpa and your dad’s attitude towards me improved.”<br/><br/>Amelia revealed a triumphant smile on her face, “Mom, I told you not to worry. In the future, both the Miles and Lane Families will be ours. You can be at ease as Mrs. Miles, and you’ll be the mother-in-law of the future Master of the Lane family.”<br/><br/>Charles nodded with a smile: “They’ve been trying to find Daisy Zane, but they can’t contact her at all. They know they can’t rely on her, so they came back to lean on you.”<br/><br/>“After all, I’m the one who has been raised in the family since I was young and always looked after the Miles Family.” Amelia said.<br/><br/>Charles nodded, “Your father is too filial and indecisive, always listening to your grandfather. It’s my success or failure in this life. Don’t blame him. He cares about us in his heart.”<br/><br/>“I know,” Amelia said, “Mom, don’t worry. Everything will be fine. William Lane is over thirty and has never been in a relationship. A man like that is easy to win over. Plus... Sophie Ortiz has a good impression of me.”<br/><br/>“Your mom believes in you,” Charles said, “You’ve received excellent upbringing and education since you were young. You’re so outstanding; John Anderson shouldn’t be your destination. Only a large family like the Lanes is worthy of your years of dedication.”<br/><br/>“The mistress of a big family should excel in various aspects, so even if Daisy Zane marries into the Clark Family, she won’t last long,” Amelia said.<br/><br/>Charles nodded, “That’s right. That’s one of the reasons your father and grandfather decided to give up on her. It’s undeniable that she’s beautiful, and men like beautiful women, but beauty isn’t permanent.”<br/><br/>Amelia smiled while making tea.<br/><br/>“No matter how beautiful, men get tired of it eventually,” Charles continued, “If one can’t support a family or be a man’s backup, they’ll be abandoned sooner or later.”Ne/w novel chapters are p/u/blished at novelhall.com\t\t\t\t\t\t</div>", "images": {}, "success": true}