{"id": 471, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14827720.html", "title": "Chapter 468: 463: Delicious Bowl Rice Pudding", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 468: 463: Delicious Bowl Rice Pudding</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t  Chapter 468: 463: Delicious Bowl Rice Pudding<br/><br/>“Director, I want to ask for leave this afternoon.” Fang Hong looked at Guo Aiguo, hoping he would approve it.<br/><br/>“What’s the matter? Why do you need to ask for leave?” Guo Aiguo looked at Fang Hong in surprise.<br/><br/>“I’ve been away for more than ten days without going home, now that I’m back, I want to check on the situation at home.” Fang Hong couldn’t really give up her family just because of work.<br/><br/>“Okay, I’ll approve your leave.” Guo Aiguo knew Fang Hong’s potential meaning, and indeed, one shouldn’t neglect their family because of work.<br/><br/>“Thank you, Director.” Fang Hong said happily. She had been sent out for work since the TV advertisement aired and had been running around outside ever since.<br/><br/>She was out for more than ten days, wondering how Mr. Xie was doing.<br/><br/><br/><br/>If she didn’t go back soon, Mr. Xie might have opinions.<br/><br/>“Well, go back, be safe, finish up your work before leaving, and take an extra day off tomorrow to spend more time with your family.” Guo Aiguo was also a family man, and he knew that family members needed companionship.<br/><br/>“Really? Thank you, Director! I’ll be leaving first then.” Fang Hong didn’t expect Guo Aiguo to be so generous.Upstodatee from n(0)/ve/lbIn/.(co/m<br/><br/><br/><br/>Traditional Rice Pudding Cake was more common in the past, mainly made at home for consumption. Nowadays, crystal Rice Pudding Cake is more prevalent, mainly made to sell.<br/><br/>Qin Xue wanted to make more Rice Pudding Cake so that everyone could have a taste.<br/><br/>Qin Xue directly used 1 kg of glutinous rice flour and wheat starch to make Rice Pudding Cake.<br/><br/>When Qin Xue was steaming the mochi, she also put the red beans in to steam them at the same time.<br/><br/>So now, she could directly use the red beans to make Rice Pudding Cake.<br/><br/>Qin Xue poured an appropriate amount of water into the flour to make a paste, then mixed an appropriate amount of white sugar with water to make a sugar syrup, and combined the two pastes, stirring until evenly mixed.<br/><br/>Once the steaming cups were heated inside the steamer, Qin Xue put red beans into the cups then poured the paste over the red beans. She steamed it over high heat for twenty minutes, let it cool down and demolded it. If there was a refrigerator, she would put it in to chill before eating to improve the taste.<br/><br/>In the end, Qin Xue made more than a hundred Rice Pudding Cake. Because the steaming cups she bought were small, she made a lot.<br/><br/>However, since they were small, men could eat one in one bite and women in two bites, so more than a hundred seemed a lot, but still not enough for everyone to eat.<br/><br/>After making them, Qin Xue couldn’t help but put them in water to chill first, waiting for them to cool down so she could eat them. Thinking of this, Qin Xue felt so happy; it had been a long time since she had eaten these snacks.<br/><br/> </div>", "images": {}, "success": true}