{"id": 476, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14852423.html", "title": "Chapter 473 - 416: Reasoning", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 473 - 416: Reasoning</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 473: Chapter 416: Reasoning <br/><br/>Daisy Zane spent a day at Clark Manor to rest, and followed Kevin Clark to the Research Institute the next day. <br/><br/>Upon arrival, she went to find Ezekiel Santiago first. <br/><br/>She went to complete the formalities of joining the Research Institute. <br/><br/>Apart from Ezekiel Santiago’s signature, it also required signatures from several professors and even the recognition of several major families. <br/><br/>This was because the Research Institute was primarily supported by various families’ funding. <br/><br/>If one were to join after a normal graduation, only signatures from Ezekiel Santiago and Kevin Clark would be required. <br/><br/>However, since she was entering with exceptional admittance, the procedures were more complicated. <br/><br/>But since Daisy Zane’s abilities were well known, and she was instrumental in assisting Continent A, even the more complicated procedures were easily handled. <br/><br/>Ezekiel Santiago hadn’t expected, though, to face a hurdle from the Maxwell Family side. <br/><br/>There were people from various families in the Research Institute, and its situation was unlike the Imperial Capital, where the Clark and Lane Families were the major forces. <br/><br/>When the Research Institute was first established, the intention was to maintain internal balance and prevent any one family from becoming too dominant. The main families within the institute had equal power and influence. <br/><br/>The Maxwell Family, however, refused to grant approval, and the two professors under their care did not sign either. <br/><br/>Their reason was due to Daisy Zane’s previous failed exam. <br/><br/>This reason didn’t even faze Daisy Zane, but Kevin Clark blew up first. <br/><br/>That’s because he was the one who failed the course. <br/><br/>If one family refused to sign the paperwork, joining the Research Institute would be postponed. <br/><br/>This delay was euphemistically referred to as an “observation period.” <br/><br/>So when Kevin Clark realized that Daisy Zane was stuck outside for half a day and only got an observation period, he threw aside his experiment and ordered Thomas Firway to surround the Maxwell Family with his men. <br/><br/>Inside the Research Institute, the power and influence were evenly distributed, so Kevin Clark decided to settle this issue outside the institute. <br/><br/>He led his men into the Maxwell Home and sat in the living room. Without mentioning the Research Institute matters, he ordered the capture of George Maxwell. <br/><br/>Anyone from the Maxwell Family who resisted was beaten by Thomas Firway’s men. <br/><br/>At first, George Maxwell struggled and protested loudly, but after getting hit by Thomas Firway a couple of times, he immediately quieted down and didn’t dare say a word. <br/><br/>Seeing her son captured and beaten, Mrs. Maxwell screamed and rushed towards Kevin Clark, itching to tear him apart. <br/><br/>She had already fallen into their hands once, and they only had this one son left; no one could hurt their son. <br/><br/>However, she was immediately stopped by the men brought by Thomas Firway, who grabbed her wrist and immobilized her. <br/><br/>“Kevin Clark, what are you trying to do?!” Julian Maxwell roared as he watched his son get captured and his wife get restrained. <br/><br/>“Nothing much,” Kevin Clark replied calmly and slowly, “I just have some personal grievances with George Maxwell. I’ll take him away now. You people go on with your business.” <br/><br/>“Kevin Clark!” Mrs. Maxwell shouted in anger. <br/><br/>Kevin Clark didn’t say anything more, just stood up and motioned for Thomas Firway to take his men and leave. <br/><br/>Even if they really didn’t want to sell, they would have to give Kevin some face. <br/><br/>So when Kevin went to the Maxwell family, Juan went to buy the pub with a lawyer. <br/><br/>“Third Master, where are we taking George Maxwell?” Thomas asked. <br/><br/>“Manor Dungeon,” Kevin replied, “keep him there for now.” <br/><br/>At the Research Institute, lunchtime came, and Daisy Zane and William Lane went to the cafeteria together. <br/><br/>William even asked someone to buy Daisy a cup of strawberry-flavored milk tea. <br/><br/>“Where’s Kevin Clark?” William didn’t know what had happened since he went to the upstairs laboratory in the morning. “Are the procedures all done?” <br/><br/>“Not yet.” Daisy replied, “There was a problem, and Kevin went to reason with them.” <br/><br/>William frowned, “What happened?” <br/><br/>“The Maxwell family didn’t sign.” Daisy took a sip of milk tea, “Not a big issue.” <br/><br/>“When did he go?” As William asked, he was about to leave. <br/><br/>Daisy said, “He should be back soon.” <br/><br/>William sat back down. <br/><br/>Sitting for a while, William became increasingly upset. He then sent a message to his special assistant, asking him to check if there were any recent important projects of the Maxwell family. <br/><br/>Although Julian Maxwell was stationed in the military district and under Theo Clark’s control, <br/><br/>the Maxwell family also had an inherited business. <br/><br/>William didn’t catch up with Kevin to “reason” together, but he couldn’t let the Maxwell family get away with it either. <br/><br/>Daisy didn’t think too much, took a few more sips of the milk tea, and suddenly asked, “Does Grandfather have a sworn son?” <br/><br/>Hearing her words, William suddenly dropped his phone in surprise and looked at Daisy with amazement and joy. <br/><br/>She had just said “Grandfather” instead of “your grandfather” or “Old Master Lane.” <br/><br/>She... She recognized their relationship. <br/><br/>Daisy and William looked at each other for a while, then Daisy softly said, “The phone screen should be shattered.” <br/><br/>That sound was the sound of the screen shattering. <br/><br/>William came back to his senses, picked up the phone from the ground, and saw that the screen was indeed shattered. <br/><br/>“It’s okay.” William casually put the phone on the table, feigning calm but utterly panicked, “You, what did you just say? Does Grandfather have a sworn son?” <br/><br/>Daisy hesitated for a moment and then smiled and replied. <br/><br/>William looked at her and smiled: “Yes, he does. Why?” <br/><br/>“Nothing. I remembered him recently.” Daisy said, “We even had a conflict in M Continent.” <br/><br/>William raised his eyebrows: “It’s fine. We’ve lost touch with him, almost broken all contacts.” <br/><br/>Daisy nodded.\t\t\t\t\t\t</div>", "images": {}, "success": true}