{"id": 477, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14852424.html", "title": "Chapter 474 - 417: Entering The Research Institute", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 474 - 417: Entering The Research Institute</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 474: Chapter 417: Entering the Research Institute <br/><br/>Kevin Clark took George Maxwell away, and Julian Maxwell tried all ways but failed to find him, let alone rescue him. <br/><br/>Julian knew his son too well. <br/><br/>He was well aware of all the bad things George had done and how many problems he had fixed for him. <br/><br/>If he dared to call the police, Kevin could surely get George arrested. <br/><br/>But Kevin didn’t choose to send George to prison directly, instead, he left some room for Julian to do what he had to do. <br/><br/>So this matter could only be settled privately. <br/><br/>That’s also why Kevin dared to take George away so blatantly. <br/><br/>After searching for a day and night, Julian finally had no choice but to ask Nathan North for help, hoping he would intercede. <br/><br/>Nathan did talk to Kevin, who agreed very readily. <br/><br/>But then...the matter seemed to be dropped. <br/><br/>As if Nathan had never talked to Kevin at all. <br/><br/>Not until one day later, with Mrs. Maxwell constantly making a fuss at home, Julian ran out of options. <br/><br/>He learned that none of the Clark Family’s forces were involved. <br/><br/>Those who took George away and broke into the Maxwell Family were Kevin’s own people, completely unrelated to the Clark Family. <br/><br/>As a result, he had no clue where to find George. <br/><br/>Everyone knew that all this was because the Maxwell Family hadn’t signed the qualification letter for Daisy Zane to enter the Research Institute. <br/><br/>Julian even found out that the bar, where George was taken away, had been transferred to Kevin the same day. <br/><br/>But even with this knowledge, he was helpless since his son was in their hands. <br/><br/>The bar was just an excuse. <br/><br/>After dragging on for two days, Julian didn’t want to compromise. <br/><br/>If Clara Mitchell was taken to Mountain Sea Continent Prison, he wouldn’t let Daisy Zane off easily. <br/><br/>However, with George captured, Kevin wouldn’t possibly treat him well. <br/><br/>The best outcome would be to lock him up and ignore him. <br/><br/>But what if he got beaten? <br/><br/>Within the Maxwell Family, Julian had seen the power of Thomas Firway’s fist. <br/><br/>Could George’s body withstand Thomas’s punches? <br/><br/>So in the end, with no other choice, Julian signed the letter. <br/><br/>He went to the Research Institute early in the morning to sign it. <br/><br/>After the Maxwell Family signed, the two professors also signed. Daisy Zane’s enrollment in the Research Institute was quickly settled. <br/><br/>But because Julian had dragged it for two days, Kevin still waited for another day before letting someone send George back. <br/><br/>On the eve of the entrance exam, Daisy Zane prepared bracelets for everyone in Senior Three Class Sixteen. <br/><br/>She designed them a long time ago. <br/><br/>Two different designs for boys and girls. <br/><br/>After she made the designs, she had a factory, which was specially responsible for production at Spotlight, spent nearly three months making them. <br/><br/>Both Skyler Thomas and the teachers of various subjects received them. <br/><br/>Daisy Zane didn’t show up, she let Anisa Cooper send them instead. <br/><br/>Following Daisy Zane’s instructions, Anisa Cooper said a few encouraging words to everyone. <br/><br/>Then she also said that the gift was not expensive, it was designed by Daisy Zane herself, mainly for the purpose of bringing good luck. <br/><br/>But it could be seen that high-quality jadeite was used, and the price was not cheap. <br/><br/>On the day of the College Entrance Exam, Daisy Zane finally put her experiment aside and saw Olivia Lane off. <br/><br/>Originally, the entire Lane Family wanted to send Olivia Lane off. <br/><br/>However, Olivia Lane felt a little embarrassed about her whole family coming to see her off for the exam at age 20. <br/><br/>So she turned them down. <br/><br/>Then she turned around and called Daisy Zane, asking her to see her off. <br/><br/>So, early in the morning on June 7th, both William Lane who insisted on coming and Daisy Zane who was invited, came to see Olivia Lane off together. <br/><br/>Kevin Clark originally wanted to come along too, but Daisy Zane refused as she was afraid that he might scare Olivia Lane and affect her performance during the exam. <br/><br/>Fearing to cause a disturbance at the entrance, Daisy Zane didn’t get out of the car when they arrived at the examination venue. <br/><br/>“Do your best,” Daisy Zane said, “I’ve reserved a banner for you. It will stretch from the school entrance to your front door.” <br/><br/>Olivia Lane pursed her lips: “I said I don’t want it.” <br/><br/>Daisy Zane smiled: “What do you want then?” <br/><br/>After thinking for a moment, Olivia Lane said, “If I become the City’s Top Scorer, you will grant me a wish.” <br/><br/>“Am I a genie lamp?” <br/><br/>Olivia Lane looked at her. <br/><br/>Daisy Zane raised her eyebrows: “Fine. I’m the genie lamp.” <br/><br/>William Lane watched the two from the driver’s seat. <br/><br/>Why did his younger sister seem to have a higher status than him? Even more than just a little bit. <br/><br/>“You promised that you would grant any wish.” <br/><br/>“Mmm.” Daisy Zane said, “Definitely. Even if you want a star, I’ll try to find a way to pick one for you.” <br/><br/>Olivia Lane smiled, hugged Daisy Zane, opened the car door, and got out, completely ignoring William Lane. <br/><br/>William Lane watched Olivia Lane walk towards the examination room without looking back, got out of the car, and chased after her. <br/><br/>Daisy Zane watched the two of them from inside the car, raising the corner of her mouth with a smile.\t\t\t\t\t\t</div>", "images": {}, "success": true}