{"id": 478, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14854869.html", "title": "Chapter 475 - 418: Taking You Home", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 475 - 418: Taking You Home</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 475: Chapter 418: Taking You Home <br/><br/>The first day of the college entrance exam saw students being sent to the examination hall. <br/><br/>After the last exam, Daisy Zane went to the examination hall to pick people up again. <br/><br/>This time, she came by herself because William Lane and Kevin Clark were busy with a meeting at the research institute. <br/><br/>Daisy Zane had brought a bouquet of pink roses for her, not for any special reason, but because she remembered that Amelie Quentin loved pink roses, so she bought some. <br/><br/>So, when Amelie Quentin came out and saw the bouquet of roses, she stared at Daisy Zane for a while before refusing to let go of the flowers. <br/><br/>“Where to?” Daisy Zane asked, looking at the delight in her face. <br/><br/>“Why don’t you ask me how I did on my exams first?” replied Amelie Quentin. <br/><br/>Daisy Zane noticed that someone was filming her on their cell phone, so she started the car first. “How did the exams go?” <br/><br/>Amelie Quentin grinned, “They said the questions were quite challenging this year. So... I guess I got a perfect score.” <br/><br/>Daisy Zane laughed, “Hmm, pretty good.” <br/><br/>“Then you remember the wish I made.” <br/><br/>“Yep, I remember it.” Daisy Zane hit the main road and asked again, “Where to?” <br/><br/>Amelie Quentin thought for a while, “Can you take me home?” <br/><br/>Daisy Zane arched an eyebrow, “Sure.” <br/><br/>“Do you need a GPS?” asked Amelie Quentin, hesitating. <br/><br/>Daisy Zane glanced at her and smiled, “Just head east. Anyone in the Imperial Capital should know where the Lane Family lives, right?” <br/><br/>Amelie Quentin pursed her lips. <br/><br/>Seeing that she was quiet, Daisy Zane asked after a while, “Have you thought of any course you want to pursue?” <br/><br/>“Pharmaceutical Formulation,” Amelie Quentin immediately replied. <br/><br/>“Do you like it?” Daisy Zane asked. <br/><br/>“I want to be with you guys.” <br/><br/>“Choose what you like,” Daisy Zane said. “Even if you don’t get into the research institute, we will still be together. Plus, once you join the institute and get involved in different projects, there’s a chance we might not see each other for months.” <br/><br/>Amelie Quentin hadn’t considered these issues before. <br/><br/>Indeed, if they were involved in different projects, and by the time she finishes her work, the rest could still be busy. And by the time they’re done, she might be busy again. <br/><br/>“Then I’ll think about it again,” Amelie Quentin said. <br/><br/>Daisy Zane didn’t want her to join the research institute for personal reasons. If she liked it, there’s nothing for her to remark upon, but if it’s for this reason, she would not advise it. <br/><br/>At least from what can be seen now, the research institute might not be peaceful, with troubles both inside and outside, which is very dangerous. <br/><br/>“Choose what you like,” Daisy Zane said. “Anything is fine, as long as you like it.” <br/><br/>“Hmm.” Amelie Quentin agreed, “Then, I will pick again.” <br/><br/>Later, Xavier Dominic sent an invitation, and Phoebe had messaged her once again. <br/><br/>“Then I will join too,” Amelie Quentin said. <br/><br/>“Alright.” Daisy Zane said, “Go home.” <br/><br/>“Hmm.” <br/><br/>Phoebe Turner’s birthday banquet this time was a huge event. <br/><br/>There was no special reason. It was just that, a marketing account had been spreading rumors about her tumultuous marriage, even with specific details. <br/><br/>Although it seemed like convincing rumors, she didn’t pay any mind to it at first. <br/><br/>But suddenly someone started to target her husband, blatantly flirting with him. <br/><br/>Even some people targeted her, sending flowers, bags, jewelry, and even real estate. <br/><br/>Then Xavier Dominic got angry first. <br/><br/>What were they doing? He had a big son right here, right? <br/><br/>Flirting with his dad and seducing his mom. <br/><br/>Where did that leave him? <br/><br/>So, he suggested hosting the birthday banquet. To clarify false news, and then... strengthen some relationships. <br/><br/>Every year, their family, a titan in the entertainment industry, hosted events, which were mostly attended by people from inside the industry. <br/><br/>They took this opportunity to throw a big party and forge relationships with people in the Imperial Capital’s business circle. <br/><br/>The venue was still the Doomsday Hotel and many people attended. <br/><br/>The Clark Family, with Theo Clark included, came by, and from the Lane Family, Andrew Lane brought his wife along. <br/><br/>Most attendees were equals to Phoebe Turner, the older generation wasn’t present. <br/><br/>Kevin Clark and Daisy Zane arrived early. When they arrived, the banquet had not yet begun. <br/><br/>Both of them went to Phoebe Turner’s room first. <br/><br/>Daisy Zane had specifically brought a gift for Phoebe Turner. <br/><br/>It was a set of jewelry that she had designed herself. <br/><br/>She had drawn the design very early, and it had been kept in Felix Baker’s safe all this while. <br/><br/>Before joining the group last year, she went to Spotlight to get some design drawings she had drawn before, made some modifications, then asked Felix Baker to produce the finished items. <br/><br/>But they had not been released yet. <br/><br/>Because the release conference of Spotlight was still in preparation. <br/><br/>This was one of them. Daisy Zane felt that it was very suitable for Phoebe Turner, so she took it as a birthday gift to her. <br/><br/>After receiving the gift, Phoebe Turner loved it, and it matched her dress for today. <br/><br/>So, she wore the necklace and earrings from the set.\t\t\t\t\t\t</div>", "images": {}, "success": true}