{"id": 472, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14827723.html", "title": "Chapter 469: 412: Data Error", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 469: 412: Data Error</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t  Chapter 469: 412: Data Error<br/><br/>Upon arrival at the Research Institute, Daisy Zane went straight to the laboratory where their team worked with Kevin Clark.<br/><br/>As soon as they entered, they ran into a man wearing a mask, a white lab coat, with extremely messy hair, and eyes that were so swollen that they were not completely open yet.<br/><br/>“Third Master, Lady Zane.”<br/><br/>Hearing the voice, Daisy Zane recognized the person.<br/><br/>It was Michael Jackson.<br/><br/>Michael Jackson followed Kevin Clark at the Research Institute, Juan Wright followed Kevin Clark in Easton Group, Thomas Firway and James Cooper were in the Dark Radiance. The rest of the few people belonged to the gossip circle, which Daisy Zane had not met yet.<br/><br/><br/><br/>Daisy Zane looked at Michael Jackson and raised her eyebrows slightly.<br/><br/>Michael Jackson rubbed his chicken nest hair: “Sorry, I’m a bit busy.”<br/><br/>“You were busy too on Continent A.”<br/><br/>Daisy Zane meant that he was so busy in Continent A, but she never saw his hair standing up like that.<br/><br/>“I need to pay attention to my appearance when I’m abroad.” Michael Jackson said, somewhat embarrassed, “When I’m home, I can be more casual.”<br/><br/>Daisy Zane nodded, understanding, and continued the conversation. Michael Jackson and Kevin Clark exchanged a few words before Michael Jackson left with some files.<br/><br/>Kevin Clark led her inside: “He’s not really that busy, he’s just being casual.”<br/><br/>“Mm.”<br/><br/>For the whole morning, Daisy Zane just watched Kevin Clark’s experiments.<br/><br/>Because many of the experiments were still ongoing, it was not appropriate for her to get involved at this time. Besides, they knew their own experiments best.<br/><br/>She just kept observing and studying the data by their side, acting as an assistant to Kevin Clark.<br/><br/>William Lane was in another laboratory, separated only by a layer of glass, so he could see them by just raising his head.<br/><br/><br/><br/>When everyone was working, they were all busy and not paying attention to others.<br/><br/>However, when it was almost lunchtime, William Lane finished first on his side.<br/><br/>As soon as he relaxed, he looked up and saw Kevin Clark and his sister standing together, and this sight made him feel uncomfortable.<br/><br/>With that gaze, he wished he could pierce through the glass, putting a galaxy between the two of them.<br/><br/>William Lane stared at Kevin Clark.<br/><br/>Did Kevin Clark always look like this?<br/><br/>The more he looked, the more annoyed he became.<br/><br/><br/><br/>“Drunken Life Grass,” Kevin said while eating, “Immortal was originally imitating the effects of Drunken Life Grass. When the data for Immortal was lost, they tried to research and recreate a drug with similar effects to Drunken Life Grass. However, the newly researched drug differed greatly from the original one. So 319 has similarities and differences to Immortal.”<br/><br/>“The records about Drunken Life Grass on the storage card are incorrect,” Daisy frowned.<br/><br/>It’s unclear whether it was a mistake or intentional at the time.<br/><br/><br/><br/>Based on the experiments currently being conducted, the data related to Drunken Life Grass is incorrect.<br/><br/>They don’t know the real data, nor do they have any way of finding out.<br/><br/>This makes the decomposition of 319 quite difficult.<br/><br/>William Lane said, “Drunken Life Grass is the key.”<br/><br/>Both Daisy Zane and Kevin Clark fell silent for a moment.<br/><br/>After a while, Kevin said, “All experiments and data are huge. A lot more experimental verification is needed. Perhaps our current phase of experiments is insufficient to prove it. It’s too early to draw conclusions now.”<br/><br/>William Lane also said, “Indeed. Perhaps as time goes on, 319 will be decomposed. Or maybe... the data of Drunken Life Grass is not problematic, and we just haven’t reached that level.”<br/><br/>Hearing their words, Daisy raised her eyebrows, “Hmm, makes sense.”<br/><br/>For now, they could only think positively about this matter.<br/><br/>Hopefully they are lucky.<br/><br/>After finishing their meal, the three returned to the laboratory.<br/><br/><br/><br/>Halfway there, Kevin suddenly looked at William Lane and asked, “Don’t you have something to do this afternoon? Why are you following us back?”<br/><br/>William Lane didn’t want to bother with him, but seeing Charlotte Lane looking over, he explained, “There’s a Dance Association gathering at Doomsday Hotel tonight. I need to attend to help maintain the scene, sort of like being the host.”<br/><br/>Kevin gently furrowed his eyebrows.<br/><br/>He had originally been walking next to Daisy Zane when he suddenly took her hand and pulled her closer to him.<br/><br/>Looking at his actions, William Lane:<br/><br/>“A Dance Association gathering?” Daisy asked.<br/><br/>“Yeah,” William Lane tried not to look at their hands, avoiding it, “We gather every year. It’s casual—whenever we have time, we gather. We celebrate various performance successes, and welcome newcomers if there are any. Do you...”<br/><br/>William Lane glanced at Kevin and changed his words, “...want to go?”<br/><br/>Daisy Zane shook her head.<br/><br/>Seeing Daisy Zane shake her head, Kevin bluntly refused, “No.”<br/><br/>William Lane:\t\t\t\t\t\t</div>", "images": {}, "success": true}