{"id": 475, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14852422.html", "title": "Chapter 472: 415: What Kind Of Person?", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 472: 415: What Kind Of Person?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 472: 415: What Kind of Person?<br/><br/>Kevin Clark went to the set to pick her up. He brought a wrapping gift and, this time, without changing the type of flowers, he took a bouquet of roses with him again.<br/><br/>Before, Kevin Clark would send different flowers for the end of every event or when her TV series wrapped up.<br/><br/>However, since giving her a bouquet of roses after the last variety show, Kevin felt that she liked roses, so he continued to give roses thereafter.<br/><br/>Kevin Clark and Daisy Zane went straight back to Clark Manor from the set.<br/><br/>Mainly because Daisy Zane wanted to go back and see Charles Amos.<br/><br/>Ever since she joined the crew again, she hadn’t seen Charles Amos.<br/><br/>The lotus leaves in Clark Manor’s lotus pond were gradually unfolding.<br/><br/>Moreover, Kevin left a piece of land on the north side of his courtyard and planted nearly ten acres of roses.<br/><br/>Now Clark Manor looked more like a multielement scenic spot.<br/><br/>That evening, after Charles Amos went to sleep, Daisy Zane opened two bottles of wine.<br/><br/>Kevin knew she had something on her mind, so he didn’t stop her and accompanied her in drinking.<br/><br/>However, Kevin’s alcohol tolerance was really limited. After less than three glasses, he was already slightly intoxicated.<br/><br/>The two of them were drinking wine on an Arhat bed in the side hall.<br/><br/>The wine was placed on the small tea table in the middle.<br/><br/>Behind them, there was only a dim, yellow lotus lamp casting light. Centered on the lotus lamp, the dim yellow light spread out into the darkness.<br/><br/>The dim light gave a sense of peace in that little corner of the world.T/his chapter is updat/ed by nov(ê(l)biin.c/o/m<br/><br/>Kevin’s consciousness became blurred, so he leaned on the back of the bed, watching Daisy Zane.<br/><br/>Her narrow, elongated eyes were tinged with red, soaked in drunkenness, yet filled with endless tenderness.<br/><br/>He watched Daisy Zane take a sip of wine and then said, “Little Girl, I’m always by your side, and you can do whatever you want.”<br/><br/>Daisy Zane looked at him.<br/><br/>Kevin understood the meaning in her eyes, and his thin, dark red lips turned up a bit, “I’m not the strongest support.”<br/><br/>When it comes to pharmaceutical formulation research, Kevin has to admit that he is not as good as Daisy Zane.<br/><br/>Some things do indeed rely on talent.<br/><br/>Daisy Zane doesn’t think Kevin is incompetent, nor does she think the entire Research Institute is incompetent, only she can do it.<br/><br/>She just feels that with one more person and one more effort, the chances of success will be greater.<br/><br/>As of now, the matters of the Research Institute and Project 319 are more urgent than anything else.<br/><br/>This concerns human lives.<br/><br/>She has to choose.<br/><br/>The true wish of Daisy Zane and all she could accomplish, can go only this far.<br/><br/>As for whether the movie can win an award, everything is uncertain.<br/><br/>On the other hand, her connection with the real Daisy Zane has been severed once again.<br/><br/>“Little girl,” Kevin Clark hadn’t heard her speak for a while, so he reached out to hold her hand and gently squeezed, “Don’t be angry.”<br/><br/>Daisy Zane lowered her eyes to look at his hand, and after a moment, she raised her eyebrows and asked, “What kind of person is Charlotte Lane?”<br/><br/>“Huh?” Kevin Clark’s mind was starting to struggle to keep up.<br/><br/>“Charlotte Lane, what kind of person is she?” Daisy Zane asked again.<br/><br/>Kevin Clark looked down at her hand, hesitated a moment, and said, “Spoiled.”<br/><br/>Daisy Zane’s already raised eyebrows rose even higher.<br/><br/>“Crybaby.”<br/><br/>Daisy Zane looked at him, her other hand tapping lightly on the glass.<br/><br/>“Attention seeker.”<br/><br/>Daisy Zane’s hand tapped a little harder on the glass.<br/><br/>“Drama queen.”<br/><br/>Daisy Zane’s beautiful phoenix eyes narrowed.<br/><br/>Kevin Clark touched the ring on Daisy Zane’s left ring finger.<br/><br/>It had been a long time since Daisy Zane had worn a ring, neither on set nor in the laboratory.<br/><br/>But when she had nothing else to do, she would wear it on her hand.<br/><br/>“Is she pretty?” Daisy Zane asked.<br/><br/>“What?”<br/><br/>Daisy Zane said, “Charlotte Lane.”<br/><br/>Kevin Clark didn’t speak.<br/><br/>Daisy Zane asked again, “Is Charlotte Lane pretty?”<br/><br/>Kevin Clark, one hand on his forehead, suddenly said, “Little girl, I’m sleepy.”<br/><br/>Daisy Zane:<br/><br/>“Let’s go back and rest.”<br/><br/>If it weren’t for his lack of reaction to such a significant matter, Daisy Zane would have reason to suspect he was faking his drunkenness.<br/><br/>In fact, Kevin Clark was really starting to struggle, and he was beginning to get confused about what she was asking.<br/><br/>He just had a feeling that if he continued to talk about another woman, the little girl would get angry.<br/><br/>Daisy Zane looked at the four opened wine bottles on the table, three of which were nearly empty.<br/><br/>Although they had only opened two bottles, she had placed several more under the tea table.<br/><br/>She finished the last bit in her glass, then stood up.<br/><br/>She felt a little dizzy as well.<br/><br/>She pressed her temples, pulled Kevin Clark up, and said, “Let’s go upstairs to sleep.”<br/><br/>Kevin Clark stood up, kissed Daisy Zane’s lips, and followed her back to their room.\t\t\t\t\t\t</div>", "images": {}, "success": true}