{"id": 473, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14827726.html", "title": "Chapter 470: 413: Dance Association Gathering", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 470: 413: Dance Association Gathering</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t  Chapter 470: 413: Dance Association Gathering<br/><br/>The tour had taken longer than expected because they had encountered terrible weather at one of the places in D Continent. They were unable to go out for a month and all the schedules had been pushed back.<br/><br/>So, it took much longer than expected.<br/><br/>Every year at the Dance Association Gathering, Andrew Lane and Sophie Ortiz would attend, and they would also bring along William Lane.<br/><br/>Especially in recent years, William Lane had become a must-attend member.<br/><br/>The hospitality is insincere.<br/><br/>What kind of host!<br/><br/><br/><br/>It’s obviously that Sophie Ortiz wants to find a daughter-in-law, so... William Lane is brought along to the gathering every year.<br/><br/>What if there’s a potential match?<br/><br/>What if the fate doesn’t come this year, but arrives the next year?<br/><br/>So, Sophie Ortiz holds onto this hope year after year, several years have passed, and her son is still single.<br/><br/>The Dance Association gathering is not mandatory to attend, but most of them still do.<br/><br/>Of course, those who just joined the Dance Association last year have also attended. This includes Amelia Miles.<br/><br/>Amelia Miles and a few newcomers toasted to Sophie Ortiz, then left to toast the other teachers.<br/><br/>William Lane chatted with a few teachers of the Dance Association and then went over to Sophie Ortiz.<br/><br/>“What are you looking at?”<br/><br/>Upon hearing his voice, Sophie Ortiz didn’t even look at him, she just said directly: “Son, look, that girl. The one with the ponytail, wearing sportswear.”<br/><br/>William Lane saw her, but still said, “Which one?”<br/><br/>Sophie Ortiz turned her head and glared at him: “Are you blind?”<br/><br/><br/><br/>William Lane laughed: “Well, I see. Very conspicuous, everyone else is dressed so gorgeously, she is the plainest, so she was spotted at a glance.”<br/><br/>Sophie Ortiz raised her eyebrows: “So, what do you think?”Upstodatee from n(0)/ve/lbIn/.(co/m<br/><br/>“Two possible thoughts. Either she is really plain or... trying to catch people’s attention.” William Lane said lightly.<br/><br/>Sophie Ortiz laughed: “What if she’s intentionally trying to catch people’s attention? Has she caught Young Master Lane’s eyes?”<br/><br/>William Lane looked at the young girl and remained silent.<br/><br/>Seeing him not talking, Sophie Ortiz sighed softly.<br/><br/>Well, another unsuccessful match.<br/><br/>“She is last year’s dance champion. She’s not trying to catch attention, she’s just really plain.” Sophie Ortiz said, “Her family condition is average. But the girl is very good, very hardworking, and very resilient, I really like her.”<br/><br/>William Lane raised his brow.<br/><br/>Not hearing William Lane talk again, Sophie Ortiz sighed softly: “Are you mute again? Get lost, don’t bother people here.”<br/><br/>Being scolded, William Lane laughed: “Mom, what’s going on with dad?”<br/><br/>There are not few male teachers and male students in the Dance Association, Andrew Lane kept chatting with them.<br/><br/><br/><br/>However, William Lane noticed early that Andrew Lane’s left face seemed to be a bit swollen.<br/><br/><br/><br/>Just... William Lane looked at his father and mother, and then thought of Olivia Lane and Old Master Lane.<br/><br/>This family mixing in the show business should all be the level of Best Actor and Best Actress.<br/><br/>“Didn’t you go to the hospital for a check?” William Lane asked.<br/><br/>“I did. The medicine I took in the morning was very effective.” Sophie Ortiz said, “I surfed the internet in the afternoon and saw a photo of Charlotte and Harton Clark standing together, and then the medicine stopped working.”<br/><br/><br/><br/>William Lane:<br/><br/>When William Lane told them about this, he deliberately avoided the matter between Charlotte Lane and Harton Clark.<br/><br/>He felt that his father might not be able to take this news.<br/><br/>But... it will be known sooner or later anyways. But he didn’t expect the news to come so soon.<br/><br/>As the two were talking, Sophie Ortiz looked up and saw Amelia Miles walking towards them.<br/><br/>William Lane also saw it, but the two kept talking without any change in their expressions.<br/><br/>“The daughter of the Miles’s?” Sophie Ortiz asked.<br/><br/>“Yes.”<br/><br/>Sophie Ortiz had heard a lot about Charlotte Lane from Olivia Lane these past few days.<br/><br/>They missed Charlotte Lane’s life for ten years, so they tried to understand as much as possible within half a month.<br/><br/>All the details, they don’t want to miss anything they could know.<br/><br/>So they also learned some things about the Miles and Amelia Miles.<br/><br/>And Olivia Lane learned most things from Allonzo Hobson, she probably knew more clearly than William Lane.<br/><br/>“If I knew it earlier, I wouldn’t let her into the Dance Association.” Sophie Ortiz murmured.<br/><br/>William Lane laughed: “Mom, you got so much criticism online for giving her a very low score.”<br/><br/>As the chairman of the Dance Association, Sophie Ortiz certainly has the power to decide anything. But the Association has always been democratic, and many teachers have the power to choose their own students.<br/><br/>So even though she didn’t like Amelia Miles’s dance at the time, she didn’t oppose it when other teachers picked her up later.<br/><br/>For Amelia Miles, it was an opportunity, a rare opportunity. For young people, since there is such an opportunity, she is still willing to give it.<br/><br/>As for whether she is suitable or not for this road will be proven by time.<br/><br/>Amelia Miles walked over here, and chatted with the people around halfway through.<br/><br/>Sophie Ortiz took back her sight and said: “Her eyes are not clean enough. Ambition isn’t bad, but this ambition isn’t clean. A dance without a soul...Whether it’s score or post-game interview, I’ve been very restrained.”<br/><br/>But she didn’t expect that this person also bullied people at her home.<br/><br/>She must be dispensed with no matter what.<br/><br/>“Mom, people who are harmful to Charlotte, Charlotte almost never show mercy.” William Lane said, “But Amelia Miles is an exception. She’s still safe and sound.”<br/><br/>Sophie Ortiz understood, paused and said: “Okay, I won’t get involved, I won’t add chaos.”<br/><br/>Amelia Miles happened to come over and said respectfully: “Teacher Ortiz, Young Master Lane.”<br/><br/>With the principle of not adding chaos, Sophie Ortiz and William Lane both politely chatted with her a few sentences.\t\t\t\t\t\t</div>", "images": {}, "success": true}