{"id": 489, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14863001.html", "title": "Chapter 486: 429 Cleaning Up The Door", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 486: 429 Cleaning Up The Door</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tOscar Turner saw that the Clarks had no intention of leaving, so he directly ignored them.<br/><br/>“Father, since that’s the case, then it’s fine,” said Oscar, “let the Clarks and the Hobsons be our witnesses.”<br/><br/>“Witness what?” Old Master Lane said, “Oscar, no matter when, it’s not your turn to make decisions in this family.”<br/><br/>“Father, this is where you’re wrong.” Oscar took out a contract and gave it to the old master, “This is a joint action agreement, and any of us can have a 33% voting right.”<br/><br/>Old Master Lane looked at him, and although he maintained calm on the surface, he couldn’t speak for a while.<br/><br/>Kevin Clark frowned slightly.<br/><br/>They came today to delay things.<br/><br/>They couldn’t interfere in the Lane family’s affairs, but as long as they were sitting here, Oscar couldn’t get his way today.<br/><br/>At least they wouldn’t dare to use force to overturn the Lane family.<br/><br/>As long as Old Master Lane didn’t give in, Oscar couldn’t get the Lane family’s seal today.<br/><br/>After today...<br/><br/>Even if the end result is the worst, at least there’s still Olivia Lane.<br/><br/>Her injuries were not severe, as long as she woke up, the situation would turn around.<br/><br/>The car accident scene was so serious. When boarding the ambulance, William Lane and Olivia Lane were both covered in blood and had fainted.<br/><br/>There was still a metal piece from the car door stuck in William Lane’s body.<br/><br/>The firefighters came and worked with the medical staff to saw the metal piece off the car door.<br/><br/>At that time, the situation was chaotic. The metal piece appeared to be stuck in William Lane’s heart.<br/><br/>And Olivia Lane’s body was covered in blood.<br/><br/>So... Oscar thought that both of them couldn’t be saved, so he came over.<br/><br/>But he didn’t expect that all the blood on Olivia Lane was from William Lane, and compared to him, her injuries were minor.<br/><br/>“Only 33%...” Xavier Dominic sneered, “Why are you making a fuss about 33%? What’s so special about it?”<br/><br/>“Is there anything else beyond this 33% now?” Oscar asked, “Do Andrew couple’s shares have an heir?”<br/><br/>What he meant was that Andrew Lane and Sophie Ortiz wouldn’t survive. Neither would William Lane and Olivia Lane.<br/><br/>Hugo Clark narrowed his eyes and suddenly felt the urge to kill.<br/><br/>Old Master Lane knew about Olivia Lane and William Lane’s situation, but he didn’t know about Andrew Lane and his wife’s situation.<br/><br/>His son, daughter-in-law, and grandson’s lives were all in danger.<br/><br/>Old Master Lane hadn’t slept all night. Even after taking medication, his blood pressure didn’t decrease, and he could only force himself to stay strong: “Who said there isn’t?”<br/><br/>Oscar laughed and said, “Father, don’t force yourself. The hospital has blocked the news, and everyone knows the truth. If there wasn’t some irreversible situation, why would they block the news?”<br/><br/>Old Master Lane’s gaze shifted from his face to the longevity lock in his hand.<br/><br/>Especially when filled with murderous intent, which was why Oscar Turner identified her quickly.<br/><br/>“What are you here for?” Oscar Turner frowned.<br/><br/>Daisy Zane looked at him, her voice cold and disdainful, “To take your life.”<br/><br/>Oscar Turner’s expression froze for a moment, and he laughed, “Do you dare? This is Imperial Capital, not M Continent.”<br/><br/>Daisy Zane looked at him without saying a word.<br/><br/>Oscar Turner continued, “You try it. Would the Clark family and Lane family let you touch me? If you start a fight here today, within an hour, the news of the disorder in the Lane family will spread.”<br/><br/>Oscar Turner stood up and said, “The internal collapse of the Lane family, one of the two great families, will spread not only throughout the Imperial Capital but also other continents and cities. People who want to take advantage of the situation and step on the Lane family will immediately flood in. The situation in the Imperial Capital will immediately become chaotic.”<br/><br/>Old Master Lane looked at Daisy Zane and noticed her standing in place, her powerful aura intimidating just from standing there.<br/><br/>“You may not care about Imperial Capital. But...” Oscar Turner glanced at Arthur North’s hand that was connected with Daisy Zane’s hand, and then looked at Allonzo Hobson and Hugo Clark, “What about them? They will not let Imperial Capital be thrown into chaos.”<br/><br/>Holt Lawrence raised an eyebrow and said indifferently, “Arrogance should have limits, or else you’ll die miserably.”<br/><br/>Oscar Turner didn’t take Holt Lawrence’s words to heart and looked at Daisy Zane, “Besides, you can’t not care about Imperial Capital. You two are already married, aren’t you?”<br/><br/>He saw the rings on Arthur North and Daisy Zane’s hands, “Since you are married, you’re also considered part of the Clark family. Your husband can’t get involved in this matter. You... have even less qualification.”<br/><br/>Arthur North narrowed his eyes and glanced at Thomas Firway.<br/><br/>Thomas Firway immediately stepped forward.<br/><br/>Arthur North had been holding back for a long time. For the sake of the situation in Imperial Capital and the Lane family, he could temporarily endure it.<br/><br/>But if Oscar Turner dared to speak to his wife like that, he could no longer care about many things.<br/><br/>If necessary, let the Imperial Capital undergo a bloody reshuffle.<br/><br/>As Thomas Firway stepped forward, Allonzo Hobson, Hugo Clark, as well as Mr. &amp; Mrs. Clark, were all startled.<br/><br/>Olivia Lane was only slightly injured, and the situation in Imperial Capital had not reached an uncontrollable point.<br/><br/>They came here to buy time and seek peace.<br/><br/>If they take action now...<br/><br/>“Arthur North,” Elina Clark and Old Master Lane called out to him.<br/><br/>However, just as Thomas Firway was about to touch Oscar Turner, Daisy Zane stopped him.<br/><br/>Thomas Firway listened to Daisy Zane very well, so when she held him back, he stopped and retreated to one side.<br/><br/>Oscar Turner nearly got hit and was almost scared to the point of his legs going soft. But when he saw Thomas Firway being stopped, his arrogant expression reappeared on his face.<br/><br/>Holt Lawrence had never seen anyone more deserving of a beating.<br/><br/>Daisy Zane held Arthur North’s hand tightly and then let go. She took a step forward and said, “As the wife of the Clark family, it is indeed not appropriate for me to interfere in this matter...”<br/><br/>Oscar Turner chuckled and said leisurely, “That’s good to know.”<br/><br/>Daisy Zane’s fingertips touched each other slightly, her cold and slow voice stated, “However, as the eldest daughter of the Lane family, I am qualified to clean house.”\t\t\t\t\t\t</div>", "images": {}, "success": true}