{"id": 486, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14862992.html", "title": "Chapter 483: 426: Car Accident", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 483: 426: Car Accident</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 483: 426: Car Accident<br/><br/>After confirming it was related to the new 319 elixir, Daisy Zane sneaked out to find the Dean while Kevin Clark was busy downstairs in the Laboratory.<br/><br/>In the Dean’s office, the two chatted for a while, and Ezekiel Santiago said, “Nicholson, this is very dangerous for you. For both industrial and personal reasons, I don’t want you to take this risk.”<br/><br/>“There will be no danger,” Daisy Zane said calmly.<br/><br/>“What if?” Ezekiel asked back, “Now it’s not just Edward Kirsten’s power, but also the meddling from the M Continent.”<br/><br/>“This method is the fastest,” Daisy Zane did not answer him, but said, “The emergence of 319 (ii) means that there will be a batch of experiments in progress. We don’t have that much time.”<br/><br/>Ezekiel looked at her without speaking.<br/><br/>“I’m in Imperial Capital, they can’t take me away,” Daisy Zane said.<br/><br/>“Kevin won’t agree.”<br/><br/>“That’s why... don’t tell him,” Daisy Zane said, “He doesn’t know I came today.”<br/><br/>Ezekiel:<br/><br/>“I remember that many things in the Research Institute don’t require their permission,” Daisy Zane looked at Ezekiel Santiago.<br/><br/>Ezekiel didn’t speak.<br/><br/>Daisy Zane paused, raised her eyebrows, and said, “Afraid that Kevin Clark will come looking for you.”<br/><br/>Ezekiel still didn’t speak, but this time it seemed like he had acquiesced.<br/><br/>Daisy Zane raised the corner of her mouth and said, “Let’s treat it as my way of repaying you for helping me ask for leave last time. I can help you block people.”<br/><br/>Ezekiel was still silent, and after a while, he said, “You go back first, and I’ll think about it.”<br/><br/>Daisy Zane knew that the matter was 80% certain, so she didn’t stay long and returned to the experiment.<br/><br/>When she arrived at the entrance of the Experimental Tower, she happened to run into William Lane leaving.<br/><br/>When William Lane saw her, he immediately smiled and asked, “Where have you been?”<br/><br/>Daisy Zane put on a serious face and lied, “I saw a friend at the entrance... You left early.”<br/><br/>The smile on William Lane’s face deepened, “I’m free for now. Amelie and my parents went to the M Continent for a few days and returned today. I’m going to the Airport to pick her up.”<br/><br/>“She’s coming back by herself?”<br/><br/>“Yes. There was a dance exchange meeting in M Continent, and my parents still have to stay there for half a month,” explained William Lane, “Amelie went with them to play for two days but got bored and came back. Moreover, the results will be released in a few days.”<br/><br/>“A top scorer (valedictorian) is about to appear in your family,” Daisy Zane said.<br/><br/>William Lane looked at her for a while and softly called out, “Lila.”<br/><br/>The villa in the backyard had always reserved a Room for her and was regularly cleaned.<br/><br/>However, Daisy Zane hadn’t stayed in this Room for over two years.<br/><br/>She didn’t know whether it was the unfamiliarity from not staying here for a long time or something else, but Daisy Zane didn’t sleep well that night.<br/><br/>Before seven o’clock in the morning, she simply got up, washed and rinsed, and planned to return to the Research Institute.<br/><br/>As she went downstairs, Holt Lawrence had just returned from the Celestial Pivot Building and was about to go to rest.<br/><br/>Seeing her, Holt asked, “Awake so early?”<br/><br/>“I’m afraid that you, the second-ranked hacker, will harbor murderous thoughts towards me, the first-ranked,” Daisy Zane’s lazy and cold voice clearly indicated that she hadn’t slept well. “You didn’t sleep either?”<br/><br/>“Yeah, I’m going to sleep now,” Holt Lawrence said, “There’s Breakfast on the table.”<br/><br/>“Okay,” Daisy Zane replied softly, her eyes downcast as she walked downstairs.<br/><br/>Holt went up two steps, suddenly remembering something, and stopped and asked, “By the way, Nana, how is William Lane?”<br/><br/>Daisy Zane’s footsteps paused, and she turned and looked at him. Most of the sleepiness in her eyes disappeared instantly, “What?”<br/><br/>“William Lane.”<br/><br/>“What happened to him?” Daisy Zane frowned and asked.<br/><br/>“You don’t know? Didn’t Kevin tell you?” The sleepy look on Holt’s face cleared a bit, “He had a car accident yesterday morning. It was quite serious.”<br/><br/>Holt said, recalling that Daisy Zane was almost in a closed test at the Celestial Pivot yesterday. Even he only found out about the accident around 3 am.<br/><br/>He continued, “William’s car was hit by two cars and ended up sandwiched in between, followed by a truck crashing into them too. The driver died on the spot, and it seems William Lane is also in serious condition. However, the news was blocked, so we’re not clear about the specifics of his condition.”<br/><br/>Daisy Zane’s pupils trembled violently, and her face turned pale in an instant.<br/><br/>“Nana, are you okay? What’s wrong?” Seeing something was off with her, Holt came back down the stairs.<br/><br/>Daisy Zane swallowed tightly and looked at Holt, her voice hoarse, “Give me a car key. Hurry up.”<br/><br/>“Where are you going? I’ll take you,” Holt worried about her and was concerned about traffic safety on the road today.<br/><br/>He feared receiving countless fines.<br/><br/>“Which hospital is William Lane in?”<br/><br/>Holt Lawrence said, “First Hospital.”<br/><br/>“Take me there.”<br/><br/>“Okay.”\t\t\t\t\t\t</div>", "images": {}, "success": true}