{"id": 488, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14862994.html", "title": "Chapter 485: 428: Lane Family", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 485: 428: Lane Family</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tDaisy Zane looked at William Lane outside the intensive care unit.<br/><br/>Inside, he was the only one present, his eyes tightly shut, and there was not a hint of color on his face.<br/><br/>The only evidence that he was still alive came from the monitor next to him.<br/><br/>Through the glass, Daisy Zane looked at William Lane.<br/><br/>She connected fragmented memories bit by bit, putting them together to form a complete recall.<br/><br/>Charlotte Lane started remembering things from a very early age. She still remembers some things from when she was about three years old.<br/><br/>During that time, William Lane would wake her up every morning. He would carry her to wash and rinse, and even helped her comb her hair.<br/><br/>At that time, William Lane was only about ten years old.<br/><br/>Now looking back, Daisy Zane realized that William Lane, at such a tender age, seemed to have become a father figure.<br/><br/>“Lila, would you stop letting Kevin Clark carry you all the time? Isn’t it okay if your brother carries you?”<br/><br/>“It’s good when my brother carries me too.” Little Lila said, “But I also want Brother Arthur to carry me.”<br/><br/>“Then you cannot call him Brother Arthur, you should call him Third Uncle.”<br/><br/>“But he is Brother Arthur.”<br/><br/>Not long after that conversation, Charlotte Lane could no longer see Kevin Clark.<br/><br/>During that period, Kevin Clark used to visit Old Master Lane of the Lane Family nearly every day.<br/><br/>However, Old Master Lane’s residence was in the north of the manor house. There was a door in the north that could be arrived at without passing through their living quarters.<br/><br/>When the time came, Charlotte Lane would run to the north.<br/><br/>But each time, William Lane would coax her in various ways to prevent her from going.<br/><br/>This situation continued until she was nine years old, and Kevin Clark, who was fifteen at that time, no longer came.<br/><br/>During that time, only when Charlotte Lane occasionally accompanied Old Master Lane to the Clark Manor, could she catch a glimpse of Kevin Clark.<br/><br/>Thinking of this, Daisy Zane let out a small laugh. But the tears slid from the corners of her eyes.<br/><br/>Her expression remained mostly unchanged. She lifted her hand to gently wipe the tears off her face. After one more glance at William Lane, she turned and left.<br/><br/>Holt Lawrence immediately followed her.<br/><br/>“Nana...”<br/><br/>“Go to the Lane House.” Daisy Zane strode away.<br/><br/>Holt Lawrence immediately left his perplexing thoughts behind: “Okay.”<br/><br/>As the car started, Daisy Zane made a phone call to Luke.<br/><br/>She said only two sentences.<br/><br/>“Oscar Turner, it is not for you to decide who the Lane Family invites or not.” Old Master Lane growled under his breath.<br/><br/>“Father, this house...”<br/><br/>“And what if we do not leave today?” Kevin Clark cut him off.<br/><br/>Oscar Turner turned to look at him, asking, “Kevin Clark, today concerns the Lane Family’s internal affairs. Does the Clark Family intend to interfere?”<br/><br/>“When did I say I wanted to interfere?”<br/><br/>“Then for what reason do you bring such a large group here?” Relatives from the Lane Family who sat across the room started to raise their voices.<br/><br/>Gently rubbing his fingertips, Kevin Clark retorted, “Then why did you bring along so many people on your return trip?”<br/><br/>“Exactly.” Xavier Dominic quipped sarcastically, “Aren’t we just following your example?”<br/><br/>Everyone present knew clearly that, apart from the Lane Family, outsiders hold no sway in this matter.<br/><br/>Despite bringing in a large group, it merely served as temporary intimidation. No hands would be raised.<br/><br/>Because these people, whether it’s Oscar Turner or these relatives, possess real shares of the Lane Family’s company.<br/><br/>If outsiders interfere.<br/><br/>This matter will immediately escalate into a conflict between the Clark and Lane Families.<br/><br/>Should the Clark and Lane families fall out, Imperial Capital’s power will immediately swing one way or another.<br/><br/>Should the Lane Family face such a situation, it wouldn’t just cause a power reshuffle in Imperial Capital. It could deal a severe blow to the Lane Family, even resulting in people adding insult to injury.<br/><br/>Outsiders wouldn’t dare to take such risks, be it on a major or minor scale.<br/><br/>We must maintain the harmony in Imperial Capital, and we must protect the Lane Family’s interests.<br/><br/>At this time, even if the Clark Family has grievances against Oscar Turner, they should put it aside temporarily.<br/><br/>Oscar Turner audaciously showed up precisely because he calculated this move.<br/><br/>Considering everyone present, neither the Clark nor the Hobson Family were a threat to him.<br/><br/>As for the internal matters of the Lane Family...Old Master Lane hasn’t received a single share. He hasn’t laid hands on the Lane venture.<br/><br/>Andrew Lane took over the Lane Family’s power from Old Master Lane’s younger brother.<br/><br/>Within the power structure of Imperial Capital, particularly at this crucial point in time, the people who could be fully mobilized by Old Master Lane were limited.<br/><br/>Most of the Lane Family’s power...At a time like this, they prioritized their shares.<br/><br/>Whoever gains the upper hand within the Lane Family, they would follow.<br/><br/>As for who would hold sway over the Lane Family at this juncture, it remains uncertain.<br/><br/>The Lane Family had done everything possible to avoid this situation, but it was still unfolding before their eyes.<br/><br/>It’s not that the Lane Family was doing anything wrong, but rather such circumstances exist in every family.<br/><br/>If the Clark family... if the three Clark brothers were at odds, the Clark family’s predicament would be far worse than the Lane family’s current situation.\t\t\t\t\t\t</div>", "images": {}, "success": true}