{"id": 481, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14856887.html", "title": "Chapter 478: 421: Resolving The Issue Discreetly", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 478: 421: Resolving The Issue Discreetly</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 478: 421: Resolving the Issue Discreetly<br/><br/>Seeing Daisy silent in her speechlessness, with the silence spreading, Kevin asked, “Where is Felix Baker?”<br/><br/>Joseph Allen looked around and said, “I think he just went out to answer a phone call.”<br/><br/>Kevin Clark:<br/><br/>As soon as this conversation ended, everyone in the banquet hall looked over.<br/><br/>Some were curious, some were confused, some were just looking. Some were disgusted, some were condemning...<br/><br/>Kevin Clark scanned the crowd and then placed his wine glass on the table beside him.<br/><br/>The collision of the glass and table made a noise, and the glass shattered the next second. The red liquid in the glass spilled out and flowed down the table.<br/><br/>Everyone’s pupils shrank, and then they immediately looked away.<br/><br/>Joseph Allen glanced at the broken glass and said, “I’ll go check on Felix Baker.”<br/><br/>Daisy Zane nodded.<br/><br/>The message on the screen continued to roll.<br/><br/>Daisy Zane casually took a sip of wine and looked at it calmly.<br/><br/>The screen displayed messages about her plagiarism, sent by a staff member from within Spotlight.<br/><br/>They posted a photo, a close-up screenshot of Phoebe Turner’s necklace, and a design draft.<br/><br/>Comparing the two, they were mostly the same with just some changes to the details.<br/><br/>To prove it, the staff member posted their work certificate with only simple redactions.<br/><br/>That design draft was indeed Daisy’s draft, which had been in Felix Baker’s safe.<br/><br/>Daisy thought to herself. It wasn’t always in the safe though.<br/><br/>Spotlight has a plan to train designers, and Felix Baker used some of her designs as teaching aids for others.<br/><br/>Two separate photos were also intentionally posted on the screen, enlarged and compared.<br/><br/>As she watched, William Lane, Robinson Scott, and Olivia Lane came over.<br/><br/>William Lane looked very serious, and he wished he could catch and kill the person responsible the next second.<br/><br/>Hardy Clark had a face full of sympathy and concern.<br/><br/>The rest... their expressions were all subdued. Hugo Clark and Robinson Scott were the most indifferent. Robinson Scott even had a look of relishing the spectacle on his face.<br/><br/>As for Olivia Lane... her beautiful little face seemed to be saying, “how unlucky can you be?”<br/><br/>Looking at their expressions, Daisy Zane understood that only Hardy Clark was unaware of the situation.<br/><br/>“Brother Nine, how do we resolve this?” Robinson Scott asked leisurely.<br/><br/>“Wait for the official site to clarify.” This matter was simple – once Spotlight cleared things up, it would be fine.<br/><br/>“Just like that?” Allonzo Hobson, who had just arrived, heard her question. “I didn’t let them turn off the screens; I’ve informed the media. Why not resolve it on-site?”<br/><br/>Daisy shook her head.<br/><br/>Today was Phoebe Turner’s birthday, and it was Hobson Family’s home field.<br/><br/>She preferred to resolve the issue quietly.<br/><br/>But... some people didn’t want her to resolve it quietly.<br/><br/>As her earrings hadn’t stopped shaking from her head’s movement, a sudden voice burst into their small group.<br/><br/>“Lady Zane sure knows how to steal the spotlight, even disrupting others’ birthdays.”<br/><br/>Everyone looked over, and Mrs. Maxwell and Clara Mitchell were standing at the side.<br/><br/>Daisy raised her eyebrows slightly after spotting them.<br/><br/>These two... one could be considered an irreconcilable enemy. She had sent Bonnie Maxwell to Mountain Sea Continent Prison, and Kevin Clark had beaten George Maxwell...<br/><br/>The other one could be considered the leader of her haters.<br/><br/>Putting these two together, they’d probably want to kill her.<br/><br/>As soon as Mrs. Maxwell spoke, the reluctant onlookers immediately looked over.<br/><br/>Now, they were shamelessly enjoying the drama.<br/><br/>Seeing them coming, Kevin Clark left Theo and his wife and joined Daisy’s side.<br/><br/>William Lane looked at her: “Mrs. Maxwell is quite good at catching attention too, and quite idle – she flocks to wherever there’s a commotion.”<br/><br/>“Mm?” Robinson Scott whispered to Daisy, “Is William Lane really that sarcastic?”<br/><br/>Daisy raised the corner of her mouth: “It’s genetic, I guess.”<br/><br/>Robinson Scott:”?”<br/><br/>Mrs. Maxwell’s sense of propriety was intact until she saw Kevin Clark. When she saw him, the knives in her eyes seemed ready to fly out, and she even forgot what William Lane said. In the end, she couldn’t maintain her politeness.<br/><br/>“I’ve lived for so many years, and this is the first time I’ve seen someone who copied others’ works at such a high-level banquet. It’s really novel.” Mrs. Maxwell tore the facade, not caring about anything. “Nowadays, what kind of people can enter?”<br/><br/>Kevin Clark looked at her, asking in a low voice: “What kind of people are we, the Clark Family?”<br/><br/>William Lane frowned:<br/><br/>Olivia Lane pursed her lips, thinking, who belongs to your family?\t\t\t\t\t\t</div>", "images": {}, "success": true}