{"id": 487, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14862993.html", "title": "Chapter 484: 427: Oscar Turner", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 484: 427: Oscar Turner</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 484: 427: Oscar Turner<br/><br/>William Lane had been rushed to the Intensive Care Unit following a terrible car accident that was deliberately targeting their vehicle. William had desperately covered Olivia, but the deformed car door had squeezed and pierced through his back. A sharp metal fragment from the car door had gone straight through his body, very close to his heart.<br/><br/>It entered his back and came out of his chest, barely missing Olivia.<br/><br/>Now, even the doctors couldn’t say if he could pull through.<br/><br/>Olivia had been protected by William, but she had also hit her head.<br/><br/>She was unconscious due to a moderate concussion.<br/><br/>Hugo stayed with her for a long time in the ward until the Lane family members arrived. He then went to the ICU area.<br/><br/>“Third Master, Young Master Lane, Young Master Hobson,” Juan Wright approached them, “Oscar Turner has gone to the Lane Family Home.”<br/><br/>Oscar Turner was the adoptive son of Old Master Lane, but after some incident, he was referred to as a sworn son.<br/><br/>“Damn! It must have been him!” Allonzo Hobson said.<br/><br/>Juan Wright replied, “The Old Master and Madam have gone to the Lane family home as well.”<br/><br/>Exhausted from staying up all night, Kevin Clark’s eyes were red, and people around him couldn’t bear to look directly at him. He asked, “Has anyone gotten in touch with William’s parents?”<br/><br/>“No,” Juan’s voice softened, “The M Continent, both the Lane family and the people from Dark Radiance are looking for them, but there’s no news yet.”<br/><br/>“So now, all that’s left is Old Master Lane,” Allonzo Hobson said.<br/><br/>“Juan, take some people and stay here,” Kevin Clark instructed. “Whatever happens, no one is allowed near Olivia’s ward. The doctors must be trustworthy; don’t let anyone get close to them.”<br/><br/>“Yes,” Juan agreed.<br/><br/>Kevin Clark looked at Allonzo Hobson and Hugo Clark.<br/><br/>“Let’s go together,” Hugo Clark said.<br/><br/>Allonzo Hobson added, “We may be outsiders, but we can help out for now. William can’t wake up to find his home gone. What would we be then if we weren’t his brothers?”<br/><br/>Without saying anything else, Kevin Clark walked out while calling Daisy Zane.<br/><br/>Hugo Clark and Allonzo Hobson said, “You two go ahead; I’ll go look after Olivia.”<br/><br/>“Okay.”<br/><br/>Daisy Zane had just reached the halfway point when Kevin Clark called.<br/><br/>“How are William Lane and Olivia doing?” Daisy asked as soon as she picked up the call.<br/><br/>There was a moment of silence on Kevin Clark’s end before he replied, “You’ve heard?”<br/><br/>“How are they?”<br/><br/>As Holt Lawrence drove, he glanced at Daisy Zane.<br/><br/>“Olivia is unconscious with a moderate concussion,” Kevin Clark said. “As for William... he’s in the ICU, and it’s hard to say for now.”<br/><br/>Daisy Zane immediately clenched her fist tightly and hesitated for a moment before asking, “Is there anything you need?”<br/><br/>Holt Lawrence:<br/><br/>Nana knows her?<br/><br/>This woman called Nana Lila?<br/><br/>Is his hearing faulty due to old age, or did he experience auditory hallucinations because he didn’t sleep last night?<br/><br/>He had always known some things about the eldest daughter of the Lane family...<br/><br/>Nana is... from the Lane family...<br/><br/>Holt Lawrence stared at Daisy Zane dumbfounded.<br/><br/>What the hell...<br/><br/>Aunt Cruz wanted to reply but couldn’t make a sound, so she just nodded continuously.<br/><br/>Daisy Zane wiped away her tears with her hand.<br/><br/>Aunt Cruz held her hand, looked at her for a while, then led everyone into the ward to Olivia’s bedside.<br/><br/>Daisy Zane looked down at Olivia Lane on the hospital bed.<br/><br/>Her forehead was wrapped in gauze, and there was a bruise on her left cheekbone.<br/><br/>Her small face and lips were sickly white.<br/><br/>Daisy Zane took a deep breath, and her eyes gradually became red, “What did the doctor say?”<br/><br/>“Mild concussion,” Aunt Cruz replied in a hoarse voice, “She should wake up tonight or tomorrow.”<br/><br/>Daisy Zane reached down and touched Olivia’s face.<br/><br/>Aunt Cruz said with heartache, “Olivia has never suffered this much in her life. This must be so painful. And Roy Madison...”<br/><br/>Upon mentioning William Lane, Aunt Cruz choked up and couldn’t continue.<br/><br/>Daisy Zane reached up and squeezed her shoulder, “Everything will be fine.”<br/><br/>Aunt Cruz nodded while wiping her tears.<br/><br/>Daisy Zane didn’t stay in the ward for long. After talking with Olivia and Aunt Cruz, she left to see William Lane.<br/><br/>As soon as they left the ward, Juan Wright came over.<br/><br/>“Teacher,” he greeted.<br/><br/>Daisy Zane nodded and then asked, “Where did Kevin Clark go?”<br/><br/>She had called Kevin and knew he wasn’t at the hospital, but she was in a hurry to get to the hospital and didn’t ask him.<br/><br/>“Third Master and Young Master Lane went to the Lane’s home,” Juan said, “Oscar Turner went to the Lane’s home. He’s Old Master Lane’s sworn son.”<br/><br/>Daisy Zane’s footsteps halted for a moment, and a fleeting coldness flashed in her eyes. She immediately realized Oscar’s intentions.<br/><br/>Then she quickened her steps to the upper floor...\t\t\t\t\t\t</div>", "images": {}, "success": true}