{"id": 485, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14862991.html", "title": "Chapter 482: 425: Courier", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 482: 425: Courier</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 482: 425: Courier<br/><br/>Arthur North said, “The courier hasn’t gone far.”<br/><br/>Daisy Zane immediately looked at Amelie Quentin: “Amelie, have the people from the Doomsday Hotel pursue the courier.”<br/><br/>As they came here to attend the birthday banquet, they arrived on their own, without any attendants.<br/><br/>They can only rely on the staff at the Doomsday Hotel for assistance.<br/><br/>Amelie Quentin promptly responded, “Okay,” without asking anything else.<br/><br/>Daisy Zane then looked at the lobby manager, “Get me a computer.”<br/><br/>The lobby manager immediately brought a computer to Daisy Zane.<br/><br/>With the lobby manager watching, Daisy Zane hacked into the Doomsday Hotel’s system.<br/><br/>The hotel lobby manager immediately broke into a cold sweat, wiping his forehead nervously.<br/><br/>Since the computer was given out by him, he wondered if he would be held accountable for this.<br/><br/>Even though Third Master Clark was on good terms with their young master, surely their relationship wasn’t this deep.<br/><br/>Daisy Zane hacked the surveillance system of the Doomsday Hotel, captured a clear image of the courier’s face, and immediately sent it to Amelie Quentin.<br/><br/>Then she hacked all the nearby surveillance systems within range of the Doomsday Hotel.<br/><br/>She located the figure of the courier.<br/><br/>“Robinson Scott.”<br/><br/>“Present.” Robinson Scott promptly replied.<br/><br/>“You...” As Daisy Zane turned her head and noticed Scott was wearing a skirt and high heels, she swallowed her words.<br/><br/>“Hugo Clark and I will go.” Arthur North spoke while calling Daisy Zane’s cell phone, “Keep the line open and guide us.”<br/><br/>“Okay.”<br/><br/>Arthur North and Hugo Clark left immediately.<br/><br/>“I’m fine, I’ll go too.” Robinson Scott said, stepping forward.<br/><br/>“Come back.” Daisy Zane called her back, “Let them go.”<br/><br/>Robinson Scott immediately turned back.<br/><br/>A substance like 319 certainly couldn’t be shipped via courier because it would be detected during security checks.<br/><br/>Therefore, there was only one possibility, the courier was an imposter.<br/><br/>Moreover, the package had been wrapped layer upon layer, likely to buy more time.<br/><br/>The courier left the Doomsday Hotel, crossed the main road, and went to Gourmet Street on the other side. The streets within the Gourmet Street were like a labyrinth, but the courier was still within the surveillance range.<br/><br/>Daisy Zane watched Arthur North and Hugo Clark on the surveillance feed. The two men were faster than the Lane family’s personnel. They could certainly catch the courier within three minutes.<br/><br/>But then...the courier turned into another street and disappeared from the surveillance footage at the end of the road.<br/><br/>Both Robinson Scott and Lily Parker frowned at this, but remained quiet.<br/><br/>“If he had the audacity to deliver here, he’s prepared not to be found.” William Lane said, “The folks from the Doomsday Hotel will be on the lookout. We’ll just have to wait for news.”<br/><br/>Daisy Zane nodded again.<br/><br/>Arthur North said, “If the elixir delivered to us this time is real, that means there’s another batch of new elixir, and they’re likely still experimenting.”<br/><br/>Everyone suddenly fell silent, and after a while, Allonzo Hobson cursed.<br/><br/>“Neither domestically nor in any other continent, 319 (ii) has been detected at present.” Daisy Zane said, “So... it should not have been used in experiments yet.”<br/><br/>“Report it, and continue to strengthen defenses.” Arthur North commanded, “We’ll intensify our own territory, and report the rest to higher-ups.”<br/><br/>Both Hugo Clark, and Allonzo Hobson agreed.<br/><br/>Daisy Zane stared down at the color of the tea in her cup, not saying a word.<br/><br/>Arthur North reached out and squeezed the back of her neck, then said, “Alright, let’s all head back, it’s getting late.”<br/><br/>“Oh, right.” William Lane suddenly said, “The hacker who tampered with the equipment in the Black Banquet Hall has been caught.”<br/><br/>Allonzo Hobson: “That fast?”<br/><br/>“My father did it himself.” William Lane put a cell phone sealed in a bag on the tea table.<br/><br/>Daisy Zane looked at William Lane.<br/><br/>Allonzo Hobson was surprised, “Uncle Lane actually took action himself. Wow, I actually witnessed Uncle Lane in action.”<br/><br/>William Lane laughed a little and then said, “According to that hacker, he found the cell phone that had been in contact with him.”<br/><br/>Arthur North glanced at the cell phone, guessing what William Lane might say next.<br/><br/>“But I only found this cell phone.” William Lane said, “It’s a new phone, with a black card. Apart from posting on Facebook, the phone had contact with the staff at the Spotlight and the hacker, but there’s no other content. No location information was found either. It had probably been switched off until today.”<br/><br/>Olivia Lane blinked her eyes, “So cautious?”<br/><br/>Daisy Zane asked, “Where was the cell phone found?”<br/><br/>“In a trash can across the street from Doomsday Hotel.”<br/><br/>Allonzo Hobson: “... Are there cameras that caught the trash can?”<br/><br/>“There are, but... the people throwing out the trash are strangers.” William Lane said, “No one was seen throwing out a cellphone.”<br/><br/>Daisy Zane took out her cell phone and dialed Felix Baker’s number. The cell phone in the seal bag on the tea table rang almost immediately.<br/><br/>After one ring, Daisy Zane hung up.<br/><br/>Confirmed that this was the cell phone that had contacted the staff at Spotlight.<br/><br/>Daisy Zane said in a low voice: “Just throwing away trash, mixed in with other garbage. It could be thrown away by sanitation workers, or anyone willing to help.”<br/><br/>“Indeed.”<br/><br/>“Could it be Amelia Miles?” Olivia Lane suddenly suggested.<br/><br/>Daisy Zane looked at her and said, “My girl, without evidence, don’t suspect people.”<br/><br/>Olivia Lane pursed her lips, “ok.”<br/><br/>Seeing how obedient she was, Daisy Zane smiled and then, “No matter who it is, they’ll slip up eventually.”\t\t\t\t\t\t</div>", "images": {}, "success": true}