{"id": 480, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14856886.html", "title": "Chapter 477: 420: Plagiarism", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 477: 420: Plagiarism</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 477: 420: Plagiarism<br/><br/>Arthur North, William Lane, and the others found the quietest rest area with the widest view in the banquet hall and sat down.<br/><br/>Lily Parker and Amelie Quentin even started playing dice.<br/><br/>William Lane said, “What a good opportunity to build relationships, but we’re just sitting here doing nothing.”<br/><br/>Arthur North said, “I’m not the Clark Family heir, I don’t need to.”<br/><br/>“...I don’t want to drink today.” Hugo Clark said, then looked at William Lane, “What about you?”<br/><br/>“I’m lazy; I don’t want to move.” William Lane continued to do nothing.<br/><br/>Robinson Scott looked at them and whispered to Daisy Zane, “Why are they all like this?”<br/><br/>“What did you expect?” Daisy Zane replied.<br/><br/>Robinson Scott had nothing to say, and guessed the dice in Amelie Quentin’s hand: “Big!”<br/><br/>Daisy Zane: “... Small.”<br/><br/>Amelie Quentin lifted the cover: “Two two three, small.”<br/><br/>Robinson Scott said, “It’s a good thing this isn’t a casino, or I’d be dead broke today.”<br/><br/>“How are things between you and Xavier Dominic?” Daisy Zane suddenly asked.<br/><br/>“Just like that.” Robinson Scott said, “Anyway, I will never marry him. Even if there is only one man left in the world, I won’t marry him.”<br/><br/>Daisy Zane raised her wine glass and tapped it against Robinson’s: “You have ambition.”<br/><br/>“Of course,” Robinson Scott said. “Ambition is what I lack the least. Hey? Brother Arthur, isn’t that Amelia Miles?”<br/><br/>As she said this, Lily Parker and Amelie Quentin also looked in the direction she was pointing.<br/><br/>“How did she get in?” Amelie Quentin wondered.<br/><br/>William Lane noticed her disgusted tone and followed her gaze, and then said, “She must have been brought by Professor Bill. He really likes her.”<br/><br/>“Why is she still in the Dance Association?” Amelie Quentin said.<br/><br/>Robinson looked at her and said, “Brother Arthur, you’re a bit soft-hearted.”<br/><br/>Hearing her words, a few people looked at Robinson Scott and then at Daisy Zane.<br/><br/>Daisy Zane tilted her head back slightly, took a sip of wine, and didn’t say anything.<br/><br/>Robinson Scott said, “Just a face, after all. If you can’t bring yourself to do it, I will. I’ve got plenty of time recently.”<br/><br/>Arthur North squeezed Daisy Zane’s hand gently.<br/><br/>The dance competition had been over for a long time.<br/><br/>Even the Johnson family in Truro City had fallen, and Amelia Miles had been exposed as the person behind sending Daisy Zane to the rooftop of Doomsday Hotel.<br/><br/>But Daisy Zane hadn’t made a move yet.<br/><br/>Arthur North knew she wasn’t soft-hearted.<br/><br/>She just didn’t want to watch every person and thing related to the real Daisy Zane disappear one by one from this world.<br/><br/>For a while, the backstage staff was also in a mess.<br/><br/>Xavier Dominic saw the chaos backstage and hurriedly asked, “What’s going on?”<br/><br/>“Young Master Hobson.” The staff in charge of the equipment said, “We have been attacked by a hacker. The main target is the computer connected to the screen.”<br/><br/>Although at the Doomsday Hotel.<br/><br/>The computer used to play the screen used a normal system, without any other security systems installed. Because this computer was just used to display some activities, there was no need for any special security systems.<br/><br/>“Reboot it,” said another staff member.<br/><br/>“That’s the only way.”<br/><br/>“Wait,” Xavier Dominic said. “Leave it like that.”<br/><br/>“Huh?” The staff all had confused expressions on their faces.<br/><br/>“Leave it like that. You don’t have to worry about it.” Xavier Dominic finished speaking and went back out front.<br/><br/>As soon as he went out, Phoebe Turner and George Hobson came over. Phoebe Turner thought the dress was hindering her walking speed, so she lifted the dress’s skirt hem with one hand and anxiously asked, “What’s going on?”<br/><br/>Seeing his parents, Xavier Dominic’s gloomy face eased slightly: “Mom, don’t worry, it’s a hacker attack.”<br/><br/>George Hobson frowned, “What’s going on? Who would dare?”<br/><br/>“It’s my fault,” Phoebe Turner blamed herself. “I talked too much online and caused trouble. What should we do now? According to the screen, the Spotlight staff got involved.”<br/><br/>“Mom, it’s okay,” Xavier Dominic gripped her hand, “It’s easy to solve. You and dad rest for a while.”<br/><br/>At the rest area, Roy Madison, Robinson Scott, and others also saw the message on the screen.<br/><br/>Roy Madison stood up and walked towards Daisy Zane.<br/><br/>Olivia Lane and Lily Parker immediately checked the online news.<br/><br/>Robinson Scott put the wine glass on the table and got up, “There is more free entertainment to watch. Come on, two little sisters, let’s go and watch the excitement.”<br/><br/>Theo Clark and his wife and Andrew couple on the upper floor also saw the news on the screen.<br/><br/>The Andrew couple knew Charlotte Lane’s identity in Spotlight based on their almost all-round understanding during this period.<br/><br/>But Theo Clark and his wife didn’t know, and Calvin Stewart hurried downstairs.<br/><br/>“Madam, what are you doing?” Theo Clark asked as he followed her.<br/><br/>“Backing her up,” Calvin Stewart threw two words impatiently.<br/><br/>Theo Clark followed her downstairs. This posture didn’t look like backing up; instead, it looked like going directly to hit someone.<br/><br/>Andrew Lane and Sophie Ortiz, on the other hand, were relatively calm.<br/><br/>Sophie Ortiz said, “No one should dare to blatantly change the content on the screen backstage.”<br/><br/>After all, this was the Lane Family’s territory, and it was Phoebe Turner’s birthday party.<br/><br/>Andrew Lane’s face went cold, and he made a phone call: “Bring the computer from the car.”<br/><br/>He wanted to see, which hacker was so reckless as to target their Lane Family.\t\t\t\t\t\t</div>", "images": {}, "success": true}