{"id": 482, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14858525.html", "title": "Chapter 479: 422 Clayson Ninevara", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 479: 422 Clayson Ninevara</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 479: 422 Clayson Ninevara<br/><br/>They stood with their backs towards Theo Clark and Calvin Stewart, avoiding a direct confrontation between the couple.<br/><br/>Arthur North had just told them not to get involved and to watch from the sidelines. After all, this was a personal matter between him and the Maxwell family.<br/><br/>He didn’t want any part of the Clark Family’s shares, fully embracing the idea of being independent from the family. for new novels<br/><br/>At the banquet scene, many people didn’t know Arthur North,<br/><br/>but they were aware of his relationship with Daisy Zane.<br/><br/>Not only had they been photographed together, but many from the drama crew knew that Arthur had visited the set.<br/><br/>They knew Arthur North was not ordinary, as the director had always greeted him with a smile.<br/><br/>But they never expected him to be this influential.<br/><br/>So, when they heard the words “Clark Family,” a gasp went through the crowd.<br/><br/>Though everyone tried to contain their surprise, the commotion was still noticeable in the scene.<br/><br/>“Third Master, I think you should get to know Lady Zane first before deciding if she should be treated as family.” Jessica Maxwell suddenly whispered.<br/><br/>“Why are you everywhere?” Olivia Lane retorted.<br/><br/>Jessica furrowed her brows and shot back: “Why are you everywhere?!”<br/><br/>“This is my...” Olivia snapped back but was interrupted by William Lane pushing her head down and holding her behind him, saying “Behave.”<br/><br/>She fell silent.<br/><br/>Mrs. Maxwell said, “Third Master, as an outsider, it’s not right for us to say too much.”<br/><br/>“Then don’t say anything.” Arthur North replied.<br/><br/>Daisy Zane’s mouth twitched slightly.<br/><br/>Noticing her urge to laugh, Arthur gently squeezed her hand.<br/><br/>William Lane observed their subtle interaction, finding it quite numerous.<br/><br/>Mrs. Maxwell felt even more furious after being silenced. Chin raised, she said harshly, “Choosing a wife should be done carefully. A woman like her will only ruin your reputation. Plagiarizing someone else’s work, what kind of decent person would do that?”<br/><br/>“Plagiarized work? Where is the evidence?” Arthur North’s voice was light and cold, terrifying to hear. “Besides... marrying her would be the Clark Family’s honor, my honor.”<br/><br/>Both William Lane and Olivia Lane turned to look at Arthur North.<br/><br/>As if it was just an ordinary statement, he didn’t show any particular emotion.<br/><br/>If anything, he seemed to be suppressing the urge to strangle the person in front of him.<br/><br/>Mrs. Maxwell didn’t expect Arthur North to say this. She pointed to the screen and said, “The evidence is right there. The staff of Spotlight came forward to testify. What other evidence do we need? The necklace in the design draft is exactly the same.”<br/><br/>At her words, everyone started whispering amongst themselves.<br/><br/>“Your comprehension... still needs more reading,” Daisy Zane said, looking at Mrs. Maxwell with a faint gaze that was also oppressive, “The work is my design and the design sketch is mine too. Do you understand now?”<br/><br/>Everyone was taken aback.<br/><br/>Even the onlookers were stunned; they could understand each word Daisy Zane said, but somehow, they couldn’t understand the sentence as a whole.<br/><br/>Mrs. Maxwell hesitated for a moment before saying, “What a joke! The staff at Spotlight has clearly stated that the design sketch was drawn years ago by a Clayson Ninevara designer. Are you treating us as idiots or illiterates?”<br/><br/>Daisy Zane and Harton Clark’s hands were intertwined, and she turned the ring on Harton’s finger, signaling him that she would handle this herself: “Call yourself an idiot or an illiterate, but don’t involve others.”<br/><br/>Olivia Lane, who was standing behind William Lane, couldn’t help but laugh.<br/><br/>“Stop quibbling! The truth is right in front of us. Can you deny it with just a few words?” Mrs. Maxwell became increasingly agitated and vicious, “The work is yours, the design sketch is yours? What does that mean? Are you saying that Clayson Ninevara plagiarized you?”<br/><br/>Daisy Zane: “...If you insist on saying that, it’s not impossible.”<br/><br/>All attendees:<br/><br/>It was chaos in the banquet hall.<br/><br/>Lily Parker had a puzzled face.<br/><br/>The insiders remained indifferent.<br/><br/>Mrs. Maxwell just heard the biggest joke, “Clayson Ninevara plagiarized you? Are you worthy? Clayson Ninevara had plagiarized? Why don’t you sue them for plagiarism.”<br/><br/>“Who spread the rumors about my Chief Designer plagiarizing?” Felix Baker’s voice was loud, just following Mrs. Maxwell’s statement, and it was getting closer, his footsteps hurried.<br/><br/>Joseph Allen finally brought him back...<br/><br/>Felix Baker entered the crowd, and Joseph Allen stood outside the crowd.<br/><br/>As soon as Felix Baker arrived, everyone’s interested expressions became even more excited.<br/><br/>It was as if they were saying.<br/><br/>The gossip is feeding me, forcing me to eat it.<br/><br/>Amelia Miles saw Felix Baker, her mouth corners were almost imperceptible.<br/><br/>Mrs. Maxwell seemed to see her savior, “Mr. Baker, it’s her. She plagiarized Clayson Ninevara’s work. And she even said they plagiarized her.”<br/><br/>Felix Baker and Joseph Allen had figured out the situation on their way here, so when he looked at Mrs. Maxwell, he realized she must have had a grudge against Clayson Ninevara. Otherwise, she wouldn’t be clinging to this in such an event.<br/><br/>Then he looked at Daisy Zane, his face showing difficulty, he hesitated and said, “Daisy, I’m not trying to hide your identity, but the trouble is too much. Look, it’s not just about saying you’re a virtual person anymore. Now the trouble is coming to you.”<br/><br/>Daisy Zane:<br/><br/>Everyone is confused, but why can’t they understand?<br/><br/>What is this bizarre statement?<br/><br/>As everyone was puzzled, Felix Baker stood next to Daisy Zane, straightened his expression, and said, “Since we’re talking about this and today is the birthday of our global spokesperson, I’ll take this opportunity to introduce her to everyone. Daisy Zane, my Chief Designer at Spotlight, Clayson Ninevara.”\t\t\t\t\t\t</div>", "images": {}, "success": true}