{"id": 493, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14863009.html", "title": "Chapter 490: 433: Third Uncle", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 490: 433: Third Uncle</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tKevin Clark had nothing going on, but after Daisy Zane kissed him again, he couldn’t temporarily leave the restroom.<br/><br/>Daisy Zane sat on the washbasin, while Kevin Clark leaned against the restroom door slowly catching his breath.<br/><br/>“Laughing,” Kevin Clark gritted his teeth.<br/><br/>“Even Third Master has vulnerable moments,” Daisy Zane overstepped.<br/><br/>“Don’t push me to find a hotel nearby,” Kevin Clark warned her.<br/><br/>Daisy Zane:<br/><br/>Seeing her quiet down, Kevin Clark slowly exhaled, “When did you find out?”<br/><br/>Daisy Zane knew he was talking about her identity as Charlotte Lane: “The day I went to the rooftop of the Doomsday Hotel. I remembered something when I saw my brother.”<br/><br/>“And then?”<br/><br/>“Then... I met my brother,” Daisy Zane said. “We sort of recognized each other, but not completely since I couldn’t recall my past at that time.”<br/><br/>Daisy Zane roughly explained the whole story to him, including Old Master Lane visiting her on the drama crew, and Mr. and Mrs. Andrew Lane staying at the drama crew hotel, among other related events.<br/><br/>After she finished, Kevin Clark was silent for a while, then said, “Half a year.”<br/><br/>Daisy Zane looked at him without responding.<br/><br/>Kevin Clark also looked at her, “Why didn’t you tell me?”<br/><br/>“At first, I was shocked and confused, not sure how to tell you,” Daisy Zane said softly. “Later... that day you got drunk, I told you once, but... you didn’t understand.”<br/><br/>Kevin Clark:<br/><br/>“Then you said... Charlotte Lane is delicate, cries easily, acts spoiled, a drama queen,” Daisy Zane repeated his words one by one for him to hear.<br/><br/>Kevin Clark:<br/><br/>“Those descriptions hurt me, so I didn’t want to say anything,” Daisy Zane lied seriously.<br/><br/>She had wanted to tell him several times since, but had been interrupted by other matters.<br/><br/>Kevin Clark didn’t feel her pain but sensed her revenge, “I didn’t say that, I don’t remember.”<br/><br/>“It’s fine, I remember, my memory is good.”<br/><br/>Kevin Clark: “... forget about it.”<br/><br/>Daisy Zane raised her eyebrows, just about to say something else, but seeing his pitiful expression, she decided not to tease him any further.<br/><br/>The two were quietly together for a while, Daisy Zane said, “Kevin Clark, I was in a bit of a rush this morning. Gael Easton is familiar with M Continent, so I contacted him.”<br/><br/>Kevin Clark was surprised she brought this up and paused before replying, “I know.”<br/><br/>Daisy Zane did not say anything else, and the two remained quiet for a moment. Kevin Clark raised his hand towards her, “Let’s go, get out.”<br/><br/>Daisy Zane got down from the washbasin and walked towards him.<br/><br/>As she reached him, Kevin Clark grabbed her hand and pulled her into his embrace.<br/><br/>“Third Master, do you still want to go out or not?”<br/><br/>Kevin Clark didn’t answer, instead tightening his arms, embracing her a little more for a while before saying, “We’ve both grown up so much.”<br/><br/>So, the online news appeared quickly and disappeared just as fast.<br/><br/>Besides, the Lane Family remained stable internally, with no conflicts or divisions, which discouraged outsiders from taking any rash actions.<br/><br/>The topics involving the Lane Family cooled down a bit.<br/><br/>Now the focus turned to the Clark Family.<br/><br/>Everyone was discussing, what did the Clark Family go to the Lane Family for in the morning?<br/><br/>If the Lane Family was fine, why did the Clark Family go there in such a grand manner?<br/><br/>Did the Clark Family and the Lane Family have a falling out?<br/><br/>Half an hour later, the Clark Group’s official website posted an update.<br/><br/>They retweeted a post asking about the purpose of the Clark Family’s visit to the Lane Family and replied with two words: [Proposing marriage.]<br/><br/>As for who proposed marriage and to whom, it was not explicitly stated.<br/><br/>Nevertheless, Imperial Capital was abuzz.<br/><br/>As the news of the alliance between the two great families of Imperial Capital was released...<br/><br/>Some were happy, some worried, and some excitedly watched the drama unfold.<br/><br/>It was well known that all the Clarks, apart from Lily Parker, were males and that Harton Clark was already married.<br/><br/>After all, a marriage proposal was mentioned!<br/><br/>Although the Lane Family had a daughter besides Roy Madison, gossip-lovers were not clear about the Lane Family’s members.<br/><br/>So, based on these reasons, several possibilities emerged:<br/><br/>Either, Hugo Clark was marrying the Lane Family’s daughter.<br/><br/>Or, Harton Clark and Daisy Zane were divorcing, and he was marrying the Lane Family’s daughter.<br/><br/>Or, Hugo Clark was marrying Roy Madison!<br/><br/>Then, the possibility of Hugo Clark and Roy Madison got the highest attention.<br/><br/>People even uncovered several photos of the two, scrutinized every detail, and imagined all sorts of scenarios.<br/><br/>They somehow managed to create a love affair between the two...<br/><br/>The Clark Family’s response also indirectly addressed Roy Madison’s injuries.<br/><br/>While the Lane Family’s denial didn’t mention Roy Madison, the Clark Family mentioned proposing marriage.<br/><br/>So, people assumed that Roy Madison was not badly injured.<br/><br/>After all... one couldn’t propose marriage while someone was severely injured.<br/><br/>Of course, there were also claims that both families wanted to cover up something deliberately.<br/><br/>But after the Lane and Clark families responded, they did not pay much attention to the online speculations anymore.<br/><br/>After all, no significant issues could be uncovered.<br/><br/>So, let them be.\t\t\t\t\t\t</div>", "images": {}, "success": true}