{"id": 498, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14874138.html", "title": "Chapter 495: 438: Visiting The Door", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 495: 438: Visiting The Door</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 495: Chapter 438: Visiting the Door<br/><br/>Charlotte Lane took advantage of the free time and accepted the endorsement of this year’s latest jewelry design series for Spotlight.<br/><br/>She shot the endorsement photos and the advertisements, but both Maple Elite Entertainment and Spotlight have not made official announcements yet.<br/><br/>Both sides wanted to find a better day to make the announcements.<br/><br/>Charlotte returned to the Lane family during this time.<br/><br/>Moreover, she didn’t go back to Rose Garden or Clark Manor for three consecutive days.<br/><br/>This made Arthur North particularly gloomy.<br/><br/>The Research Institute finallyhad a break, and he could see people during the day, but he couldn’t find his wife in the evening.<br/><br/>It was even worse today. There’s not much going on at the Research Institute, and he couldn’t see his wife all day long.<br/><br/>Arthur stood by the lotus pond in his courtyard, pinching fish food in his hand, and sprinkling it little by little into the pond.<br/><br/>With each sprinkle of fish food, Arthur’s irritation seemed to rise a little.<br/><br/>“Yo, feeling gloomy here?”<br/><br/>Arthur heard the voice and turned to look at Tom Wayne behind him.<br/><br/>Then he looked at Elina Clark in the distance, who was playing with Charles Amos.<br/><br/>“Mom.”<br/><br/>Tom was wearing a plain cheongsam dress. Seeing Arthur’s appearance, he smiled, walked to Arthur’s side, and looked at the fish in the pond, “Charlotte hasn’t been home for more than ten years. You have to understand her sudden return.”<br/><br/>“I know,” said Arthur, as if forced.<br/><br/>“Andrew Lane is a devoted daughter’s slave, and Charlotte was the first daughter in the Lane family back then. Their affection for her is even greater,” Tom said, “Now, he’s your elder, and you should be more tolerant.”<br/><br/>“Hmm.” Arthur replied.<br/><br/>Tom stood quietly beside him for a while and then said, “Arthur, do you remember when I wanted to introduce you to Amelie Quentin and what you said?”<br/><br/>Arthur glanced at his mother:<br/><br/>“You say it,” Tom imitated his tone, “Our two families have been friends for generations, and even from our ancestors, that girl should call me uncle. I’m an elder, and I can’t be so disrespectful.”<br/><br/>Arthur: “Mom, how do you remember everything?”<br/><br/>Tom laughed and said, “What now? Why don’t you say you’re an elder now? Why don’t you say you’re disrespectful now?”<br/><br/>“Mom,” said Arthur helplessly. “I suspect you’re here to mock me.”<br/><br/>Tom laughed again for a while and said, “I’m just repeating what you said.”<br/><br/>Arthur sighed in resignation and then laughed.<br/><br/>When she was a little girl, she never called him uncle.<br/><br/>Now, she couldn’t call him Brother Arthur.<br/><br/>Such irony that fate played on him specifically.<br/><br/>Tom sighed and then looked at the lotus leaves in the distance, “It’s great. The Lane family is reunited.”<br/><br/>More than ten years have passed. Although no one said anything, everyone might have thought they would never find Charlotte again.<br/><br/>But now she has returned.<br/><br/>“Understood.”<br/><br/>After explaining George’s situation, Kevin didn’t feel the slightest bit relieved.<br/><br/>So he fed the fish from one lotus pond to another.<br/><br/>It wasn’t until after four in the afternoon that he received a call from Charlotte.<br/><br/>He left the “stuffed fish” and the “still hungry fish,” prepared a bunch of gifts, and headed to the Lane home.<br/><br/>Gael had been in the Imperial Capital all these days, spending the first night at the Lane home before moving to the Doomsday Hotel.<br/><br/>The Lane Family wanted to express their gratitude and had specifically arranged an early dinner with Gael.<br/><br/>Although they didn’t ask Charlotte directly, they could somewhat tell that Gael had feelings for her.<br/><br/>So they specifically invited Kevin as well.<br/><br/>Even though Andrew Lane didn’t have a good impression of Kevin, after all, he was the person his daughter liked.<br/><br/>They couldn’t invite Kevin’s love rival to their home for dinner without Kevin there.<br/><br/>Otherwise, what would that look like?<br/><br/>However, even though they had handled the situation this way,<br/><br/>it was clear that Andrew had no intention of letting Kevin off the hook.<br/><br/>During dinner, he got Kevin drunk.<br/><br/>He went overboard, continuously thanking Gael to the point of almost referring to him as a brother.<br/><br/>And with each thank you and toast to Gael, Andrew would look “kindly” at Kevin and ask politely yet firmly, “Arthur, care to join in?”<br/><br/>If not that, it was, “Arthur, join us.”<br/><br/>Or, “Arthur, you must have a drink with us.”<br/><br/>Eventually, it was just, “Come, Arthur.”<br/><br/>“Arthur.”<br/><br/>Kevin drank one glass after another.<br/><br/>Charlotte sat next to him, originally planning to secretly block some drinks for him or drink some on his behalf.<br/><br/>However, Kevin held her hand tightly, not letting her make a move.<br/><br/>So, in the end, Charlotte watched as Kevin held her hand with one, and drank with the other, joining them all.<br/><br/>Even when Kevin got drunk, he appeared to be very steady outwardly, and his voice sounded a little hoarse but normal, speaking very naturally.<br/><br/>But after experiencing it once before, Charlotte had a rough idea of his alcohol tolerance.<br/><br/>She knew how drunk he would get.<br/><br/>Plus, Andrew was being sneaky: the alcohol content of the drinks he and Gael had was much lower than the one Kevin had.<br/><br/>However, he underestimated Kevin and overestimated Gael.<br/><br/>Gael didn’t seem to care about the alcohol content; he was one of those people who would get excited and somewhat unconscious after three drinks.<br/><br/>And seeing that Charlotte had been watching Kevin the whole time without any expression, Andrew sensed that his daughter appeared to be in distress.<br/><br/>So, Andrew ended the “drinking session.”<br/><br/>Then everyone accompanied the already tipsy Gael in drinking some cold water...\t\t\t\t\t\t</div>", "images": {}, "success": true}