{"id": 490, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14863004.html", "title": "Chapter 487: 430: I Am A Bandit", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 487: 430: I Am A Bandit</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tDaisy Zane’s voice wasn’t loud, but it fell into the ears of everyone in the banquet hall and left them all stunned.<br/><br/>For a moment, the whole reception room was so quiet that you could hear a pin drop.<br/><br/>Even the usually unflappable Arthur North was taken aback, his pupils slightly dilating as he stared at Daisy Zane.<br/><br/>And the normally expressionless face of Hugo Clark was even more so.<br/><br/>Allonzo Hobson was so surprised that his ears rang; he felt that either his ears or his brain had a problem.<br/><br/>Thomas Firway’s face twisted in shock.<br/><br/>Old Master Lane was also taken aback, but quickly returned to his usual self,<br/><br/>Oscar Turner and the rest of the Lane Family relatives also fell silent.<br/><br/>Daisy Zane didn’t care about their reactions and continued, “How long have you been planning this? You made my parents go missing in M Continent, and staged a car accident in our country to harm my siblings. Oscar Turner, you thought yesterday was a once-in-a-lifetime opportunity, but you never expected that Charlotte Lane did not die.”<br/><br/>After she said this, Natalie Wayne suddenly reacted.<br/><br/>She hurriedly stood up, and in her haste, she knocked over the teacup.<br/><br/>The sound of the shattered teacup brought everyone in the reception room back to their senses... except for Arthur North.<br/><br/>Elina Clark also immediately stood up and checked Natalie Wayne’s hand.<br/><br/>Hugo Clark and Allonzo Hobson both glanced at Natalie Wayne and then looked at each other, and then both tacitly looked at Arthur North.<br/><br/>Arthur North did not react, just kept looking at Daisy Zane.<br/><br/>Seeing his reaction, Hugo Clark and Allonzo Hobson felt a little more reassured.<br/><br/>“How can you possibly be Charlotte Lane?” Oscar Turner couldn’t help but raise his voice.<br/><br/>“Why not?” Old Master Lane said in a deep voice.<br/><br/>As soon as the Old Master spoke, everyone looked at him.<br/><br/>Arthur North also looked at him.<br/><br/>Everyone saw the Old Master’s calm face, and even a very subtle hint of smugness. In an instant, they all understood.<br/><br/>He had known all along.<br/><br/>The only ones who didn’t know were them.<br/><br/>Arthur North’s gaze returned to Daisy Zane, and he couldn’t help but stare. It seemed that he was judging the authenticity of this matter, and looking for traces of the past in the girl he knew so well.<br/><br/>Seeing him go after Daisy Zane, Mr. &amp; Mrs. Clark and Old Master Lane all became anxious. Natalie Wayne moved forward one step as Old Master Lane stood up immediately.<br/><br/>But Arthur North and Hugo Clark didn’t bother much.<br/><br/>Because in front of Daisy Zane, Oscar Turner is not even a match.<br/><br/>Moreover, it was a good opportunity for Daisy Zane to establish her authority in front of these relatives.<br/><br/>As Oscar charged, Daisy Zane caught his attacking wrist, then lifted her leg and without any mercy, kneed him directly in the ribs.<br/><br/>Oscar let out a stifled groan; he could even faintly hear his own bone fracture.<br/><br/>His entire body suddenly retreating, but as his wrist was still held, Daisy Zane pulled him back in.<br/><br/>As she pulled him back, Daisy Zane lifted her leg again, her knee landing on his other rib.<br/><br/>Oscar let out a low growl in pain, then his strength drained from him.<br/><br/>Daisy Zane twisted his hand suddenly, and Oscar turned, kneeling on one knee on the ground.<br/><br/>Seeing this situation, Old Master Lane silently sat back down in his chair. After sitting for a while, he glanced at the Clarks again.<br/><br/>Elina Clark and Tom Wayne were surprised, but didn’t have any excessive reactions.<br/><br/>Daisy Zane, her hand holding Oscar’s wrist, did not release her grip. Her eyes were filled with murderous intent, and all the calmness disappeared in an instant.<br/><br/>Her entire being was draped in a layer of terrifying gloom.<br/><br/>In a soft voice, she said, “Oscar, how many lives do you have to compensate for the pain my brother and sister suffered? Who gave you the guts to do it?”<br/><br/>Oscar’s body trembled from the pain. He resisted for a moment but couldn’t break free. After a few seconds of silence, he shouted maliciously, “Are you only compensating for your siblings? What about your parents? Let me tell you! Your parents have already become corpses. You should be ready to...”<br/><br/>Daisy Zane twisted his arm with force, cutting off his words.<br/><br/>Then, with her other hand, she took the gun from her waist and held it in her hand. She held it with one hand, tapped it on the table to load it, and pressed it directly against the back of Oscar’s head.<br/><br/>She had taken the gun from Holt Lawrence’s car and had it hidden behind her coat all this time.<br/><br/>“You really do deserve to die.”<br/><br/>Just as she was about to pull the trigger, Charlotte Lane shouted, “Stop! Don’t let the home be stained with blood.”<br/><br/>All the Lane family relatives were frightened.<br/><br/>Daisy Zane didn’t move the gun that was pressed against Oscar’s head.<br/><br/>Arthur North walked to her side, grabbed her hand, took the gun from her and said, “Let me do this kind of thing. Don’t dirty your hands.”\t\t\t\t\t\t</div>", "images": {}, "success": true}