{"id": 492, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14863008.html", "title": "Chapter 489: 432: Don’T Be Stressed", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 489: 432: Don’T Be Stressed</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tOscar Turner was caught, and the people he brought with them saw the current situation and didn’t dare to act. They were easily subdued.<br/><br/>The relatives also left one after another because of Charlotte Lane’s expulsion order.<br/><br/>They came with grandiosity and left with their tails between their legs.<br/><br/>The living room quieted down and became much more spacious. Even the air seemed to be fresher.<br/><br/>Everyone stood in the living room, quiet for a while, until Xavier Dominic coughed lightly, and all eyes turned to him.<br/><br/>“I, my throat is itchy.” Xavier Dominic repeated, “Really, it’s just itchy.”<br/><br/>Everyone ignored him and shifted their gaze towards Daisy Zane.<br/><br/>Daisy Zane noticed their gazes but didn’t look at them. Instead, she looked at Old Master Lane.<br/><br/>Old Master Lane was also looking at her.<br/><br/>Last time they met, the old master only had a fleeting glimpse of his granddaughter. Now, in the open, he could take a close look at her.<br/><br/>“Charlotte...” The old man was just about to speak.<br/><br/>Daisy Zane suddenly took a step back, knelt in front of the old master, kowtowed before him, and then straightened her waist and said, “Your unfilial granddaughter has caused you worry all these years.”<br/><br/>Everyone looked at Daisy Zane with downcast eyes.<br/><br/>The earlier shock was already significant, but with Oscar Turner’s matter, everyone had temporarily put this event aside.<br/><br/>Now that things had settled, everyone found it a little harder to bear the shock.<br/><br/>Kevin Clark, Hugo Clark, and Xavier Dominic had played with Charlotte Lane when they were younger, due to their good relationship with William Lane.<br/><br/>After so many years, they met again.<br/><br/>It was supposed to be a first meeting, but it turned out to be a reunion.<br/><br/>And all this time, they hadn’t recognized each other.<br/><br/>Holt Lawrence was also having a hard time adjusting.<br/><br/>The Nana he knew... he always felt that she was a wild child.<br/><br/>No matter how calm and steady she seemed on the surface, there was always a touch of wildness deep down.<br/><br/>Now she suddenly went from wild to domestic...<br/><br/>He was really having a hard time adapting.<br/><br/>Old Master Lane was also stunned for a moment, and then he could no longer control his emotions. His eyes moistened instantly.<br/><br/>He hurriedly bent down to help Charlotte Lane up: “Get up, get up. It’s good that you’re back. It’s good.”<br/><br/>Kevin Clark also helped Daisy Zane up.<br/><br/>Kevin still didn’t say anything.<br/><br/>Old Master Lane knew that this matter had a considerable impact on him. He smiled and said: “Charlotte was always very clingy to you when she was little.”<br/><br/>Daisy Zane:<br/><br/>Kevin still did not speak, but in his heart, he thought: But now she’s not clingy to him anymore.<br/><br/>“Have you ever thought that Charlotte would marry you?” The old man asked.<br/><br/>“I...” Kevin couldn’t speak.<br/><br/>“I thought Charlotte would marry you.” Old Master Lane didn’t wait for him to answer, “I would be at ease and satisfied if Charlotte married you.”<br/><br/>The old man stood at the entrance of the room and looked at Kevin: “Arthur, don’t feel pressured.”<br/><br/>Daisy Zane held back a laugh.<br/><br/>Kevin swallowed, feeling that what the old man said was not “don’t feel pressured” but “your pressure is yet to come.”<br/><br/>“Okay.” Kevin responded.<br/><br/>The housekeeper accompanied Old Master Lane into the room, and Kevin and Daisy went downstairs.<br/><br/>As the two walked side by side down the stairs and stood in the middle of the living room, Kevin turned to look at Daisy.<br/><br/>Daisy also looked up at him.<br/><br/>After a brief exchange of glances, Kevin pulled Daisy into the restroom of the living room and locked the door.<br/><br/>Then he lifted her onto the washbasin and kissed her.<br/><br/>Kevin’s kiss was not gentle but rather fierce.<br/><br/>Daisy had no choice but to bear it.<br/><br/>Kevin’s emotions were complicated, a mixture of various emotions.<br/><br/>The identity of the little girl had never been such a significant shock to him.<br/><br/>Daisy let him kiss her, not struggling until he let her go.<br/><br/>Kevin touched her face, looking at her eyes: “Little Girl.”<br/><br/>A hint of desire appeared in Daisy’s cold gaze: “Kevin Clark, let me remind you that we are at my home.”<br/><br/>Kevin looked at her.<br/><br/>“Of course, I don’t mind.” Daisy’s eyes swept downwards, but she couldn’t see much as Kevin held her face and tilted her head back, “But... can you do it?”<br/><br/>It took Kevin a moment to understand what she meant. He leaned closer, biting her lips lightly: “My earlier kiss wasn’t passionate enough, and you still dare to tease me.”<br/><br/>Daisy raised the corner of her mouth, her right hand hooked around his neck, pressed him down a little, and kissed him again.\t\t\t\t\t\t</div>", "images": {}, "success": true}