{"id": 499, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14874141.html", "title": "Chapter 496: 439: Dissipated Son", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 496: 439: Dissipated Son</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 496: Chapter 439: Dissipated Son<br/><br/>About drinking alcohol.<br/><br/>Gael Easton is both a lightweight and a heavy drinker.<br/><br/>Even when he’s already drunk, he insists on drinking more.<br/><br/>So... Charlotte Lane secretly switched his drink to plain water, and he still drank happily.<br/><br/>Andrew Lane was drinking with him, during which he took a trip to the restroom.<br/><br/>Upon returning, Gael Easton was still not done drinking.<br/><br/>“Uncle Lane, here.” Gael Easton poured water for Andrew Lane.<br/><br/>“Gael Easton...” Charlotte Lane called out to him from across the table, then said politely, “You should go to bed.”<br/><br/>At the sound of her cold voice, Gael Easton immediately sobered up significantly, then narrowed his eyes to look at her for a moment and said, “Little Miss, you’re here too.”<br/><br/>Everyone at the table, except for Harton Clark who was watching the bottle of wine with half-lidded eyes, all looked towards Charlotte Lane.<br/><br/>Charlotte Lane was silent as she looked at Gael Easton.<br/><br/>Gael Easton looked at her in a daze for a moment, then suddenly stood up and pointed at Charlotte Lane, “You! Get up! Help me get back to my room!”<br/><br/>A glint of ferocity flashed through Charlotte Lane’s eyes.<br/><br/>Harton Clark also lifted his gaze to look at Gael Easton.<br/><br/>After looking at Charlotte Lane for a while, Gael Easton said, “Forget it. I suddenly remembered that you’re married. Damn it! That lucky Clark.”<br/><br/>“Mr. Easton, let me assist you back to your room,” Wilton Edwards stood up and propositioned.<br/><br/>“Alright, thank you, Wilton Edwards.”<br/><br/>Sophie Ortiz also followed them upstairs to lend a hand.<br/><br/>Once Gael Easton left, the people at the dining table dispersed.<br/><br/>“Lila, assist Harton up the stairs first,” Old Master Lane instructed.<br/><br/>“Alright.” Charlotte Lane helped Harton Clark to his feet.<br/><br/>Seeing this, Andrew Lane also quickly stood up: “I’ve arranged a room for him, I’ll lead you there.”<br/><br/>Charlotte Lane:<br/><br/>Amelie Quentin blinked, first looking at her sister and then at Harton Clark.<br/><br/>Old Master Lane also raised an eyebrow but didn’t say anything more.<br/><br/>Andrew Lane led them upstairs and ran into Gael Easton, who was leaning against the wall by the guestroom door.<br/><br/>“Huh? Little Miss, why are you here again?” Gael Easton said, leaning against the wall, “And Harton Clark, why are you two roaming around this late at night instead of sleeping?”<br/><br/>“To irritate you.” Harton Clark, standing next to Charlotte Lane, suddenly spat out two words.<br/><br/>“What?!” Gael Easton immediately started ranting, “Annoy me! You can annoy me! I dare you to try!”<br/><br/>Amelie Quentin replied quickly: [What are you doing?]<br/><br/>Charlotte Lane: [None of your business, kiddo.]<br/><br/>Amelie Quentin: [...Okay.]<br/><br/>Amelie Quentin went downstairs, playfully enticed Andrew Lane away, and Charlotte Lane promptly went from her room to Kevin Clark’s guest room.<br/><br/>Andrew Lane, once Amelie Quentin returned to her room, went back to the living room.<br/><br/>Finally, Sophie Ortiz, unable to take it anymore, told him off and made him return to his room.<br/><br/>“Are you out of your mind? They’re a married couple, and yet you’re making them sleep in separate rooms!” Sophie Ortiz continued to berate him after she had returned to her room.<br/><br/>“What about it? So what if they are married? Can they do whatever they please because they are married!” Andrew Lane countered, “My daughter hasn’t returned home for ten years, and the moment she does, that wastrel takes her away. It breaks my heart. Just looking at him makes me uncomfortable.”<br/><br/>Sophie Ortiz remained silent.<br/><br/>Andrew Lane continued: “I haven’t had the chance to hold and pamper my daughter properly, and she’s someone else’s now.”<br/><br/>Sophie Ortiz: “Kevin treats Charlotte very well.”<br/><br/>“Don’t mention him to me.”<br/><br/>Sophie Ortiz was too lazy to deal with him.<br/><br/>On the other side, Charlotte Lane went to Kevin Clark’s room.<br/><br/>When she entered, Kevin Clark was already in bed, asleep, his clothes were not even taken off. But when he heard the footsteps, he quickly woke up. Seeing it was Charlotte Lane, he momentarily stared and said, “Little miss?”<br/><br/>“Yes.”<br/><br/>“What brought you here?” Kevin Clark tried to hold her hand.<br/><br/>“To watch the spectacle of a drunk Third Master Clark,” Charlotte Lane responded flatly.<br/><br/>Kevin Clark chuckled a bit and then sat up, saying, “Don’t go back tonight, okay?”<br/><br/>Charlotte Lane raised an eyebrow.<br/><br/>“Three days...” Kevin Clark whispered, “I slept alone for three days.”<br/><br/>“Third Master, this is my home,” Charlotte Lane reminded him.<br/><br/>“I know.” Kevin Clark was drunk, but not as severely as the previous time; he could still think, although not too clearly, “I won’t do anything, I just want to hold you.”<br/><br/>“Really?” Sitting on the bedside table, Charlotte Lane teased, “But we haven’t been together in several days.”<br/><br/>“Not tonight.” Looking at her hand, Kevin spoke in a low voice, “I drank too much, I don’t know how strong I’d be. I don’t want to hurt you.”<br/><br/>Charlotte Lane:<br/><br/>“Will you stay?” Kevin Clark asked, looking up at her.<br/><br/>Upon witnessing the redness in the corner of Kevin’s eyes, the expectation in his gaze, the trace of pitiful helpless resignation, Charlotte Lane gently agreed.<br/><br/>Kevin Clark immediately chuckled, “I’ll go take a bath.”<br/><br/>“Can you manage alone?”<br/><br/>“Yes.” Kevin Clark stood up and kissed her, “Lay down first, I’ll be right back.”\t\t\t\t\t\t</div>", "images": {}, "success": true}