{"id": 496, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14874131.html", "title": "Chapter 493: 436: Is It… Over Between Us?", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 493: 436: Is It… Over Between Us?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 493: Chapter 436: Is it... Over Between Us?<br/><br/>In the evening, Charlotte Lane sent everyone home and stayed at the hospital with Olivia Lane.<br/><br/>Sophie Ortiz and Aunt Cruz wanted to stay as well, but Charlotte asked them to leave.<br/><br/>So Andrew Lane and his group took Gael Easton back to the Lane Family home.<br/><br/>Kevin Clark stayed behind with Charlotte.<br/><br/>He accompanied the Old Master in another ward, while Charlotte stayed with Olivia.<br/><br/>When everyone had left, Charlotte intended to clean Olivia’s face and let her sleep, but Kevin suddenly called her from outside the ward.<br/><br/>Once she went out, she found not only Kevin but also Hugo Clark.<br/><br/>“Auntie.”<br/><br/>Charlotte glanced at him and then looked at Kevin.<br/><br/>Kevin laughed, “Want to chat with Grandfather for a while?”<br/><br/>Charlotte was silent for a moment, then looked at Hugo, “She needs to rest early.”<br/><br/>“Alright,” Hugo said, “Thank you, Auntie.”<br/><br/>Charlotte followed Kevin to the ward next door.<br/><br/>As soon as Hugo entered the ward, Charlotte looked back.<br/><br/>Kevin said, “Hugo... he’s a pretty good guy.”<br/><br/>Charlotte looked at him outside the Old Master’s ward, “Of course, you think he’s good because he’s your blood nephew.”<br/><br/>“Olivia is not young; she can make her own decisions.” Kevin said, acting like he didn’t care about Hugo, but deep down he did, as they were family.<br/><br/>“If she likes him, I won’t object.” Charlotte said softly.<br/><br/>Kevin laughed and didn’t say anything.<br/><br/>If Hugo could really win Olivia’s heart...<br/><br/>Then the Lane Family... might become allergic to the “Clark” surname in the future.<br/><br/>“He’s only two years older than you, how come I don’t have much impression of him?” Charlotte asked.<br/><br/>“Hugo spent more time at his grandma’s when he was young.” Kevin laughed, “I guess you have an especially deep impression of me instead.”<br/><br/>Charlotte looked up at him, and after a moment, raised her eyebrows, “Just so-so.”<br/><br/>“Is it just so-so?” Kevin asked with a smile in his eyes, “When you were little, you often called me Brother Arthur and asked me to hold you. Why did you become so distant when you grew up?”<br/><br/>“Distant?” Charlotte looked at him, her eyes filled with flirtatious overtones, “I not only let you hold me...”<br/><br/>Kevin’s eyes, full of laughter, suddenly stilled, and he lightly inhaled.<br/><br/>Charlotte smiled, “Still want to hear it?”<br/><br/>A week later, William Lane was transferred from ICU to a regular ward, and both Olivia and Old Master Lane were discharged from the hospital.<br/><br/>Finally, the Lane family had some downtime.<br/><br/>However, William Lane still hadn’t woken up.<br/><br/>His vital signs had been stable the entire time, but he never regained consciousness.<br/><br/>Medical teams were consulted one after another, but none could confirm whether or not he would wake up.<br/><br/>So, in the end, the best anyone could do was keep him company and talk to him whenever they had time, hoping that it might have some effect.<br/><br/>“Sis, when are you coming home?” Olivia asked.<br/><br/>Charlotte Lane had brought Olivia lunch she bought during her lunch break at the hospital.<br/><br/>Olivia had spent most of her days at the hospital during these times.<br/><br/>“I will finish up at the Research Institute in about three days,” Charlotte answered.<br/><br/>Due to William Lane’s injury, the Research Institute suddenly lost one of its main forces, causing work to get slightly busier.<br/><br/>“Alright, then will you be staying at home?” Olivia inquired.<br/><br/>“Home is too far from the Research Institute,” Charlotte replied as she opened the food and checked the equipment beside William.<br/><br/>“Maybe you could stay the night occasionally,” Olivia suggested as she sat at the dinner table, “That’s what my elder brother used to do.”<br/><br/>“Ok,” Charlotte agreed, then sat at William’s bedside and turned to look at Olivia, “The results are out.”<br/><br/>“Yeah,” Olivia replied with a smile, “749 points.”<br/><br/>Charlotte raised her eyebrows and clinked her water glass with Olivia’s, “Congratulations, Little Top Scholar.”<br/><br/>Olivia smiled: “149 in Language; I think I lost one point in the composition.”<br/><br/>“That’s great.”<br/><br/>“Oh gosh, Skyler Thomas was so excited that he cried while calling me,” Olivia said, “It made me feel embarrassed to be so calm.”<br/><br/>“So?”<br/><br/>“So, I recited a 500-word speech of gratitude on the spot,” Olivia explained, “I thanked heaven and earth, our country, my parents, siblings, classmates, teachers, and even an anthill under the second tree to the left on the school playground.”<br/><br/>Charlotte laughed: “What happened to the anthill?”<br/><br/>“I thanked it for giving me entertainment by counting the ants.”<br/><br/>Charlotte’s laughter caused her shoulders to shake.<br/><br/>On the hospital bed, William Lane’s fingers twitched slightly.<br/><br/>However, since Charlotte and Olivia were too engrossed in conversation, neither noticed the movement.<br/><br/>“All the students in 16th Class performed really well,” Olivia continued after laughing, “Marsh Turner’s extraordinary performance placed him in fifth place for the whole city.”<br/><br/>“That’s great.”\t\t\t\t\t\t</div>", "images": {}, "success": true}