{"id": 494, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14874126.html", "title": "Chapter 491: 434: Changing The Tune Quickly", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 491: 434: Changing The Tune Quickly</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tWhen Old Master Lane and the others arrived at the hospital, Olivia Lane had just been awake for a while.<br/><br/>Hugo Clark and Aunt Cruz were both accompanying her.<br/><br/>After she woke up, she first asked about William Lane’s condition, and then she didn’t talk much.<br/><br/>Hugo thought she would make a fuss and cry, but she didn’t show any reaction and just lay quietly on the bed.<br/><br/>When people talked to her, she either said yes or no. Otherwise, she wouldn’t respond.<br/><br/>This continued until Charlotte Lane and Old Master Lane arrived.<br/><br/>Olivia’s gaze turned to the door upon hearing the sound of the door opening and footsteps, she suddenly sat up on the bed after seeing Charlotte.<br/><br/>Hugo, afraid that she would be dizzy, immediately got up to support her.<br/><br/>“Sister.” As soon as Olivia spoke, her voice was filled with sobs, and she reached out to hug Charlotte.<br/><br/>Charlotte walked two steps forward, standing beside the bed. Olivia immediately hugged her and burst into tears, “Sister.”<br/><br/>Charlotte gently placed her hand on Olivia’s head, not daring to use force, and lightly touched her, saying, “Why are you crying?”<br/><br/>Olivia’s shoulders trembled as she cried, and after a while, her voice became noticeably hoarse, “Brother, he, he...”<br/><br/>“It’s okay, he’ll be fine.”<br/><br/>“It’s my fault, it’s all my fault.” Olivia choked up, “Brother did it to protect me, if he hadn’t come to pick me up...”<br/><br/>“It’s not your fault,” Charlotte said. “Someone deliberately set it up, and we have already taken care of it. None of those who should be dealt with will be spared.”<br/><br/>Olivia cried for a long time, and finally, when her emotions calmed down a bit, her eyelids had completely disappeared from crying.<br/><br/>Charlotte was about to grab a tissue to wipe Olivia’s tears, but when she turned around, Hugo handed her a box of tissues. Charlotte glanced at him and took two tissues to wipe Olivia’s tears.<br/><br/>That glance made Hugo’s heart race.<br/><br/>Charlotte said, “You cried so much you look ugly.”<br/><br/>“Are you despising me?” Olivia tilted her head back to look at her, letting Charlotte wipe her tears.<br/><br/>“How dare I?” Charlotte said, “If I make you cry again, I’ll have to call the doctor to give you a sedative.”<br/><br/>Olivia sniffed, “That’s so cruel.”<br/><br/>Charlotte smiled slightly, “Lie down.”<br/><br/>“Okay.” Olivia was about to lie down, but suddenly saw Old Master Lane standing behind Charlotte.<br/><br/>She was too close to Charlotte just now, and her line of sight was blocked, so she didn’t see Old Master Lane at all.<br/><br/>And when they entered the room just now, it seemed that she only saw her sister.<br/><br/>“Grandpa, you’re here too?” Olivia straightened up immediately.<br/><br/>Old Master Lane took two steps forward, smiling, “Finally noticed your grandpa? I thought you only had eyes for your sister.”<br/><br/>She never liked anyone and didn’t even care about being in love.<br/><br/>“Third Uncle, how did you win Auntie over?”<br/><br/>Arthur North ignored him.<br/><br/>“According to reason, shouldn’t the love story take up a certain place in the minds of little girls of Olivia’s age?” Hugo Clark didn’t understand, “But she doesn’t have a point at all.”<br/><br/>“Do you think she is precocious or late-blooming?”<br/><br/>“Or did she see through the world?”<br/><br/>Hugo Clark usually didn’t say much, but today he kept talking and talking, annoying Arthur North.<br/><br/>Arthur North finished his cigarette and turned to leave: “Just stay single. As for having great-grandchildren, let my parents count on Charles Amos.”<br/><br/>With that, he left.<br/><br/>Hugo Clark looked at his retreating figure and clicked his tongue.<br/><br/>He should have asked him how to chase someone first.<br/><br/>Now that he has annoyed him, it’s none of his business.<br/><br/>Miscalculation.<br/><br/>After Arthur North returned to the ward, he found that the little girl had admitted Old Master Lane to the hospital, and his ward was next to Olivia Lane’s.<br/><br/>“What happened?” Arthur North thought something had happened while he was away.<br/><br/>“His blood pressure is too high.” Charlotte Lane said indifferently.<br/><br/>“It’s all thanks to the young lady.” The housekeeper’s expression relaxed a lot, “Otherwise, the Old Master wouldn’t even be willing to be hospitalized.”<br/><br/>“Charlotte, Charlotte.” The Old Master called her from the ward.<br/><br/>Arthur North and Charlotte Lane entered the ward together.<br/><br/>“Charlotte, I’m really fine,” the Old Master said. “I’ll be fine after taking some medicine. Let’s go back. I’m not used to this place.”<br/><br/>“You’ll get used to it.” Charlotte Lane said mercilessly, “Before your blood pressure goes down and stabilizes, I won’t hear a word about leaving the hospital.”<br/><br/>Old Master Lane:<br/><br/>Arthur North chuckled.<br/><br/>Old Master Lane looked at Arthur North and said, “Arthur, I’m really fine. Come and take my pulse and tell me if I’m fine, if I don’t need to be hospitalized.”<br/><br/>Charlotte Lane looked sideways at Arthur North.<br/><br/>Arthur North felt half of his body freezing due to her gaze: “Grandpa, do I look like I have a say in this?”<br/><br/>Charlotte Lane’s eyelashes trembled slightly.<br/><br/>Old Master Lane:<br/><br/>After a while, the Old Master was climbing onto the bed resignedly, grumbling, “Kid, you sure know how to change your tune.”\t\t\t\t\t\t</div>", "images": {}, "success": true}