{"id": 491, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14863006.html", "title": "Chapter 488: 431: Are You Okay?", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 488: 431: Are You Okay?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tOscar Turner had brought quite a few people with him, filling the Lane Family’s courtyard.<br/><br/>However, Harton Clark had brought his people too, as well as those who were already guarding the Lane Family’s home.<br/><br/>When there was a commotion in the Reception Room, Oscar’s men tried to barge in, but they were blocked outside by the people of the Lane Family and Harton’s men.<br/><br/>Although no fighting had occurred, the two sides were in a stand-off.<br/><br/>Inside the Reception Room, Daisy Zane let go of Oscar.<br/><br/>Thomas Firway immediately pulled Oscar aside.<br/><br/>Having dealt with him, Daisy turned to the group of relatives. She was about to speak when her cell phone rang.<br/><br/>She took it out, saw that it was Gael Easton’s number, and picked up right away.<br/><br/>“How did it go?”<br/><br/>Gael laughed and said: “Of course, everything is fine and safe. This is my territory, if you ask me to find someone, could I possibly fail?”<br/><br/>Daisy lowered her gaze and let out a sigh of relief without showing any change of expression: “Did they get hurt?”<br/><br/>“No.” Gael said, “They were originally escorted by people from the Lane Family; they were only forced into a mountain due to danger, and there was no signal inside the dense woods on the mountain.”<br/><br/>Gael, who is usually boisterous, suddenly lowered his voice: “The Lanes, and the two you asked me to find, are all very powerful fighters. Oh, no, it’s mainly Andrew Lane who’s very strong. Sophie Ortiz doesn’t fight, but didn’t slow them down at all. They didn’t have a lot of people, but they fought against so many for almost a day and a night. These Lanes... are really not to be messed with.”<br/><br/>“Please entertain them a little.” Daisy said.<br/><br/>“Of course. But they seem in a hurry to get back.” Gael said, then suddenly raised his voice again, but it wasn’t meant for Daisy.<br/><br/>“Yes, she asked me to find you. She... her name is Daisy Zane.” Gael almost forgot what Daisy’s current name is. “Do you want to say a few words to her?”<br/><br/>“Daisy...” It was Sophie Ortiz’s voice.<br/><br/>Daisy’s eyelashes fluttered, she responded, and then asked, “You... You’re not hurt, are you?”<br/><br/>“We’re not.” Sophie said, “But William and Amelie...”<br/><br/>Everyone guessed who she was on the phone with.<br/><br/>Old Master Lane walked up to her with his cane.<br/><br/>Daisy looked up at him, signaling that everything was fine.<br/><br/>Old Master Lane let out a sigh of relief.<br/><br/>Daisy said: “They are all fine, and not injured. The Lanes are fine too. Don’t rush to get back, take a little rest there.”<br/><br/>“We’d better go back, we don’t feel at ease here.” Sophie Ortiz said.<br/><br/>“Alright, let Gael arrange an airplane for you.” Daisy said in a calm voice, “Don’t hesitate to ask him for anything, he owes me a lot of money, so feel free to give him orders.”<br/><br/>Gael, who had heard this sentence through the loudspeaker: #¥%*&amp;amp;#¥...<br/><br/>“You may be unaware.” Daisy Zane held the gun in her hand, unloaded the magazine, “Previously when I was home, I was pampered and ruled unhindered. In this home, whatever I say goes.”<br/><br/>Old Master Lane glanced at her and then nodded, agreeing.<br/><br/>Kevin Clark also turned his head to look at her.<br/><br/>“In this home, I indeed have the final say.” Daisy Zane casually proclaimed with great impudence.<br/><br/>Nobody spoke.<br/><br/>Allonzo Hobson scratched his cheek, Daisy was indeed the young lady of the Lane family – they couldn’t simply constrain her.<br/><br/>Daisy Zane continued, “I’m short-tempered, impatient. Within a month, someone will contact all of you. It’s in your best interest to cooperate, otherwise... the issue elevates from just reclaiming shares.”<br/><br/>Daisy Zane turned towards Oscar Turner and said, “He’s just an example, but I wouldn’t mind making examples out of all of you.”<br/><br/>“You, you’re crossing the line.” another person stepped in, asking, “Old Master, are you not going to intervene? The Lane Family will turn into a bandit’s den if left in her hands.”<br/><br/>“Indeed, indeed.”<br/><br/>Everyone echoed in agreement.<br/><br/>Old Master Lane, leaning on his cane, cleared his throat and declared, “I can’t interfere. I don’t have Lane family’s shares, I have no say.”<br/><br/>All the relatives: “????????” Are you okay?<br/><br/>Just now, he was giving out to Oscar Turner, and suddenly now he claims to have no say?<br/><br/>Allonzo Hobson couldn’t help but laugh at his double standards.<br/><br/>“If you’re afraid it will turn into a bandit’s den, hurry and return the shares.” Old Master Lane continued, “Whether the Lane Family turns into a bandit’s den or a wolf’s pit, it’s none of your concern.”<br/><br/>All the relatives:<br/><br/>Daisy Zane subtly raised her eyebrow without showing much emotion.<br/><br/>The reception room went silent before someone retorted, “Don’t intimidate us. Old Master has been in power for many years with a clean reputation in public. You dare let Lane family members do anything to us? You’re merely trying to scare us off.”<br/><br/>“To deal with you, we don’t even need the Lane family.” Daisy Zane said, “Did you ever wonder how I managed to survive in the M Continent?”<br/><br/>All the relatives were taken aback.<br/><br/>Holt Lawrence spoke, “Allow me to introduce myself, Holt Lawrence, of the Celestial Pivot Detective Agency.”<br/><br/>All the relatives: “!”<br/><br/>“The Celestial Pivot Detective Agency is independent of all families but only obeys Charlotte Lane.” After Holt Lawrence finished, he smiled and said, “I welcome all of you to become adversaries of Celestial Pivot.”<br/><br/>Suddenly, no one spoke anymore.<br/><br/>They all understood clearly. Even without the Lane family, there were various methods to deal with them.<br/><br/>Seeing they had quieted down, Daisy Zane issued an eviction order: “We haven’t prepared lunch for you all today, so you all should head back earlier.”\t\t\t\t\t\t</div>", "images": {}, "success": true}