{"id": 497, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14874133.html", "title": "Chapter 494: 437 No Little Prince", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 494: 437 No Little Prince</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 494: Chapter 437 No Little Prince<br/><br/>Just after the results came out, Olivia Lane had to return to School in the afternoon.<br/><br/>She had a meal in the Hospital and chatted with Charlotte Lane for a while before being taken away by Hugo Clark.<br/><br/>Only Charlotte Lane and William Lane were left in the Ward.<br/><br/>Then, following her principle of talking more with William Lane, Charlotte opened her Cell phone and found all kinds of electronic reading materials shared with her by Anisa Cooper.<br/><br/>Then, she spent ten minutes deciding to open the search app and searched for several bedtime stories to read to William Lane.<br/><br/>She told Anisa to look for some light, simple, and easy-to-understand recreational reading materials for her.<br/><br/>She did find her quite a few, all of them novels, several of them started with On the Bed scenes as soon as they started.<br/><br/>Can that level of description pass the review?<br/><br/>It was really liberal a few years ago.<br/><br/>Now they probably can’t even find it. It turned out they’re all Anisa’s collector’s editions.<br/><br/>Charlotte Lane looked for several children’s bedtime stories to read to William Lane.<br/><br/>Her voice was naturally cold, and the story was read without any extra emotion, clear and cool, with a lazy dragging tone.<br/><br/>After finishing, she didn’t forget to comment.<br/><br/>“It’s just fooling kids, just listen to it.”<br/><br/>“When I was a kid, were you fooling me like this? I was so easy to fool without a kindergarten diploma.”<br/><br/>“Although the ugly duckling was born a white swan, becoming beautiful is something that everyone can achieve through hard work.”<br/><br/>“Hmm? This Snow White Princess is awakened by the prince’s kiss? Why did I hear a version when I was little that Snow White’s good deeds moved the heavens, so they gave her a chance to be reborn?”<br/><br/>Then Charlotte flipped through several versions and couldn’t find the ending she heard.<br/><br/>She looked at the lying William Lane: “Well, should you explain it to me? Why did other kids have ‘The Little Prince’ when I was little and I had ‘good deeds’, moved the...”<br/><br/>Charlotte Lane’s words were suddenly choked, she saw William Lane’s eyelids move and opened his Eyes to look at her.<br/><br/>William was very weak, even his eyelids looked weak, but still looked at Charlotte and gently pulled the corners of his mouth.<br/><br/>Charlotte Lane immediately stood up, pressed the call bell, and put a hand on his shoulder, softly calling him, “Elder brother.”<br/><br/>William had no strength to speak, so he could only blink his eyes in response to her.<br/><br/>“Hold on for a while, don’t sleep.” Charlotte Lane’s hand gently pinched his shoulder, her eyes gradually reddening, “Doctor is coming soon.”<br/><br/>After the Doctor came and checked him.<br/><br/>Once people wake up, the follow-up is just good nursing and recuperation, and there are no major issues.<br/><br/>However, William was too weak, the doctor examined him thoroughly, and Charlotte spoke a few words to him. While she was on the phone telling her parents, he fell back asleep.<br/><br/>Olivia laughed at her sister’s expression.<br/><br/>William also chuckled and then asked, “Olivia, what major do you want to choose?”<br/><br/>“Administrative Management.”<br/><br/>Both William and Lila were surprised that she chose this major.<br/><br/>Then William asked, “Because of Grandfather?”<br/><br/>Olivia was silent for a moment, then shook her head, “I can only say that I’m somewhat influenced by Grandfather. But more so because I wanted it myself.”<br/><br/>“Why?” Lila looked at her and asked.<br/><br/>“I ran into some trouble at a class reunion yesterday.” Olivia looked at their suddenly serious expressions and quickly said, “Don’t worry, I’m fine. It’s something that happened in the past. I found out last night that they’ve been covering for each other, and it was never dealt with.”<br/><br/>William and Lila didn’t say anything.<br/><br/>“I thought about it for a long time last night.” Olivia used the fruit knife to stab the apple repeatedly, “I don’t think I can do anything about it. The only thing I can do is to reach that position myself and try to avoid such things as much as possible.”<br/><br/>Lila raised her brow slightly as she listened to her sister’s words.<br/><br/>William was silent for a while before he said gently, “Do you know what you’ll have to give up?”<br/><br/>Olivia thought for a moment and said, “I seem to know.”<br/><br/>Once she goes down this road, the Lane family wouldn’t be able to protect her as they do now.<br/><br/>In some ways... she couldn’t rely too much on the Lane family either.<br/><br/>The Late Master Lane had achieved a certain level of authority before he got the title of ‘Clear Reputation.’<br/><br/>“I don’t know if I can do it well.” Olivia said.<br/><br/>“You can.” Lila replied, looking down.<br/><br/>William also said, “Our Olivia has really grown up.”<br/><br/>Lila and Olivia stayed with William from the afternoon until the evening, having dinner together at the hospital before leaving together.<br/><br/>On their way back, Lila gave Olivia Diego Giovanni’s mobile number: “He’s from the police station, his surname is Diego, you can find him if you need anything. Just say you’re my sister.”<br/><br/>“Okay.”<br/><br/>“Sis, are you going home tonight?”<br/><br/>Lila suddenly remembered Harton Clark’s pitiful look before she came today, “I’ll go back tomorrow night.”<br/><br/>“Okay.” Olivia was silent for a moment before saying, “Sis, do you think Brother Enamel has taken a fancy to me? Why is he talking to me every day?”<br/><br/>Lila: “...If so, what do you plan to do?”<br/><br/>“Of course, stay away.” Olivia said, “He’s scary. He’s both old-fashioned and serious. I’m very afraid of him.”<br/><br/>Lila chuckled. She wondered how Hugo Clark managed to leave such an impression while pursuing someone.\t\t\t\t\t\t</div>", "images": {}, "success": true}