{"id": 495, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14874129.html", "title": "Chapter 492: 435: Feeling A Bit Sorry For You", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 492: 435: Feeling A Bit Sorry For You</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tAndrew and Sophie arrived in Imperial City in the evening.<br/><br/>The helicopter landed directly on the rooftop of First Hospital.<br/><br/>Gael Easton had arranged for the helicopter in M Continent, but it needed coordination domestically.<br/><br/>After some contact with M Continent, Gael Easton got in touch with Harton Clark.<br/><br/>Domestically, everything was always managed by Harton Clark and William Lane, completely independent of their respective families, with power held in their hands.<br/><br/>With William Lane injured, Gael Easton eventually had to contact Harton Clark.<br/><br/>By the time they were in contact, Harton Clark had already arranged everything.<br/><br/>When Harton Clark and Daisy Zane came to pick people up from the rooftop, they found that Gael Easton had also come along.<br/><br/>“Daisy,” Sophie said as she spotted her and immediately walked towards her.<br/><br/>Andrew followed her quickly.<br/><br/>“Daisy,” Sophie held her hand, “What’s the current situation?”<br/><br/>Charlotte Lane glanced at the couple and then shouted, “Mom and Dad, my brother’s condition is more serious, but the rest is fine.”<br/><br/>She had always been afraid that she wouldn’t know how to get along with them.<br/><br/>For ten years, she had no concept of family or blood relationship.<br/><br/>But in reality, once she recalled everything and saw them, all worries were unnecessary.<br/><br/>She knew that her parents loved her very much.<br/><br/>She loved them too.<br/><br/>Andrew and Sophie were stunned and didn’t even hear what she said next clearly.<br/><br/>After a while, Sophie finally said, “Lila, Lila.”<br/><br/>After calling out to her, she hugged her tightly, “Lila, my Lila has returned.”<br/><br/>Andrew wiped his eyes, wanting to hug both of them, but considering that Charlotte had grown up and had been away from home for over ten years,<br/><br/>he worried that being too enthusiastic would make her uncomfortable. So he just pinched her shoulder.<br/><br/>After a brief reunion on the rooftop, Charlotte led them to see William Lane and Olivia Lane.<br/><br/>“Grandfather’s blood pressure is high,” Charlotte said, “I admitted him to the hospital as well.”<br/><br/>“Good, good,” Andrew replied, “He listens to you. He doesn’t listen to anything we say.”<br/><br/>The family of three walked towards the hospital, completely ignoring Harton Clark, who hesitated for a moment and then silently followed them.<br/><br/>Just as he took two steps, he was suddenly stopped.<br/><br/>Harton Clark turned around, frowning when he saw Gael Easton.<br/><br/>He almost forgot that this person had been ignored too.<br/><br/>Gael Easton ignored Harton Clark’s disgusted look, asking, “When did this little girl get parents?”<br/><br/>Harton Clark pulled out his arm.<br/><br/>“Little girl.”<br/><br/>Charlotte Lane glanced at Kevin Clark’s rolled-up shirt sleeves, then looked at Gael Easton sitting on the ground, and asked, “Did you guys fight?”<br/><br/>“How could we?”<br/><br/>As Kevin Clark’s voice fell, Gael Easton stood up and began to rant, “Why not? You little brat, do you know how scary he is?”<br/><br/>Charlotte Lane didn’t say anything.<br/><br/>She knew Kevin Clark could be ruthless when dealing with enemies.<br/><br/>“He almost threw me off the roof.” Gael Easton walked towards her and stopped halfway, pointing down from the edge of the rooftop, “Do you know how high this is?”<br/><br/>“This is the top floor of a twenty-nine-story building,” Charlotte Lane answered calmly.<br/><br/>Gael Easton was choked: “Am I asking you where we are?”<br/><br/>“No,” Charlotte Lane said, “You’re asking how high this is.”<br/><br/>“You, you two...” Gael Easton pointed at them and said, “What a sinister couple.”<br/><br/>Charlotte Lane looked him over: “At least you’re not injured.”<br/><br/>“Damn, you really have the nerve to say that.” Gael Easton pointed at Kevin Clark, “He does psychological damage!”<br/><br/>Gael Easton immediately thumped his chest and coughed twice, “I can’t take it anymore, I need to go get an X-ray.”<br/><br/>As soon as he finished speaking, Andrew Lane came up: “Mr. Easton.”<br/><br/>Gael Easton immediately straightened up, his expression and demeanor becoming more polite, and he even stopped ranting, smiling warmly. “Uncle Lane.”<br/><br/>Kevin Clark:<br/><br/>Charlotte Lane:<br/><br/>“Mr. Easton, I apologize for any rudeness. I was in a rush.” Andrew Lane personally came to greet him, giving Gael Easton a lot of face.<br/><br/>“Uncle Lane, you’re too polite.” Gael Easton walked towards him, and halfway there, he raised an eyebrow at Kevin Clark smugly, “I’m fine, I and Charlotte are very close, you don’t need to be so polite.”<br/><br/>Andrew Lane escorted Gael Easton away and glared at Kevin Clark before leaving.<br/><br/>Kevin Clark saw the murderous intent in the eyes of a doting father.<br/><br/>With the two people gone, only Kevin Clark and Charlotte Lane were left on the rooftop.<br/><br/>After staring at each other for a while, Kevin Clark said, “I was wrong.”<br/><br/>Charlotte Lane raised her eyebrows, “What did you do wrong?”<br/><br/>“I shouldn’t have used force,” Kevin Clark said, “I should have stuffed Gael Easton back in the helicopter before it left.”<br/><br/>Charlotte Lane laughed, then said, “Third Uncle, suddenly, I feel a bit sorry for you.”<br/><br/>She was referring to her father’s attitude.<br/><br/>Kevin Clark:<br/><br/>“If you want to call me Third Uncle, then don’t bother feeling sorry for me.” After Kevin Clark finished speaking, he bit her lips gently.<br/><br/>And then... Charlotte Lane laughed out loud.\t\t\t\t\t\t</div>", "images": {}, "success": true}