{"id": 505, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14875906.html", "title": "Chapter 502: 445: Little Bunny Brat", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 502: 445: Little Bunny Brat</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 502: Chapter 445: Little Bunny Brat<br/><br/>“Return to Rose Garden or Clark Manor.” Kevin Clark took off his white lab coat and asked Charlotte Lane.<br/><br/>Charlotte Lane looked at the location Charles Amos had sent her and asked, “Why isn’t the Lane Family an option?”<br/><br/>Kevin Clark looked at her without speaking.<br/><br/>Charlotte Lane looked up at him, saw his somewhat pitiful look, and showed him her cell phone, saying, “Let’s go find Charles first.”<br/><br/>Kevin Clark also took a look at the location: “What happened? Why did he suddenly ask us to go there?”<br/><br/>“I don’t know, there must be something going on.”<br/><br/>“Could it be dangerous?” Kevin Clark noticed that she was quite calm, so it didn’t seem like there was any danger.<br/><br/>“No.” Charlotte Lane checked other messages and still had no news from Jack Thompson. “If there is any danger, his message would be followed by two exclamation marks.”<br/><br/>Kevin Clark chuckled, “Let’s go check it out then.”<br/><br/>“Okay.”<br/><br/>At this time in the Imperial Capital, traffic was heavy, and it was hard to speed up.<br/><br/>Charles Amos was in a coffee shop, leisurely eating cake and taking his time.<br/><br/>Wilton Edwards didn’t rush him, as this was the first time Charles could remember seeing his father, and it was inevitable he’d be curious about him.<br/><br/>Similarly, although Jack Amos had seen Charles many times from afar in Imperial Capital, this was the first time they had met face to face since Charles had grown up.<br/><br/>This was the child he had with Harris Kirsten...<br/><br/>The child she had spent her life caring for...<br/><br/>So as they spent time together, they inadvertently lost track of time.<br/><br/>Charles hadn’t returned yet, so Tom Wayne called.<br/><br/>As Charles continued to eat his cake, he put his cell phone on the table, turned on the speakerphone, and answered, “Grandmother.”<br/><br/>Tom Wayne’s voice came from the cell phone, “Charles, where are you?”<br/><br/>Jack Amos’ eyelashes quivered slightly as he looked at Charles’ phone.<br/><br/>“Grandma, I’m at a coffee shop, and I’ll be back soon.” Charles said, “I’ll bring some cake home for you.”<br/><br/>“Alright.” Tom Wayne replied, “Your grandmother will be waiting for you at home.”<br/><br/>“Mmm.”<br/><br/>After hanging up, Charles noticed Jack Amos had been staring at his phone, so he asked, “What are you looking at?”<br/><br/>“Do you like your grandparents?”<br/><br/>“Yes,” Charles said, “I also like Uncle and Aunt Brown, and my elder brothers and sisters.”<br/><br/>Jack Amos smiled, knowing that his family would not be hard on the child.<br/><br/>Jack Amos was also stunned, even somewhat shocked by the completely unexpected scene before him.<br/><br/>Kevin Clark also looked at Jack Amos, tensing for a moment. But after noticing Charlotte Lane’s trembling, he subconsciously squeezed her hand and comforted her.<br/><br/>Charles walked to Charlotte Lane’s side, gently pulling on her clothes.<br/><br/>Charlotte Lane blinked gently, but her eyes remained fixed on Jack Amos.<br/><br/>Wilton Edwards looked at Charles and immediately knew his series of actions just now were to delay time. He stood up and said, “Third Master, Lady.”<br/><br/>Charlotte Lane looked at him, paused, and then looked at Jack Amos again. It took her a while to find her voice: “You...”<br/><br/>Jack Amos came back to his senses, stood up, and looked at them. When not seeing him, it was fine, but when facing each other like this, all the emotions surged forth.<br/><br/>It felt like yesterday when he called Kevin Clark, talking about his next homecoming day.<br/><br/>It also felt like yesterday when he and Enigma Starry were sitting together, discussing why Jack Kingsley loved to cry so much.<br/><br/>He controlled himself not to look at Kevin Clark but looked at Charlotte Lane, slightly smiling, and said, “Enigma.”<br/><br/>Charlotte Lane’s eyelashes trembled, and as she stared at Jack Amos, her tears inexplicably fell.<br/><br/>Kevin Clark heard his voice, and his eyes instantly turned red.<br/><br/>Jack Amos reached out to wipe away Charlotte Lane’s tears but stopped as he lifted his hand, realizing that she had grown up and married. His actions were no longer appropriate.<br/><br/>He put his hand down and tried to make his tone sound lighter, saying, “The person who started the attack was one of my own, and the last stab was deliberately off target.”<br/><br/>But those thirty-two knives, they were all stabbed solidly into his body. Even a few might have touched nerves.<br/><br/>Even if he didn’t die, recovering to his current state might have taken several years.<br/><br/>And he didn’t know how much suffering he had to endure.<br/><br/>Charlotte Lane found herself unable to speak, and she rarely had such emotional moments. She could only nod in response.<br/><br/>Jack Amos took a few tissue papers from the table and handed them to her, “Alright, don’t cry anymore. You won’t be pretty if you keep crying.”<br/><br/>Kevin Clark took the tissue papers from his hand and wiped Charlotte Lane’s tears.<br/><br/>“No way, my mom is the prettiest,” Charles murmured softly.<br/><br/>As soon as he spoke, Jack Amos immediately looked at him.<br/><br/>That look, as if to cut off his own future.<br/><br/>Only now did he realize that he had fallen into Charles’s trap, with his pity and chess-playing all intentional.<br/><br/>Charles immediately hid behind Charlotte Lane, grabbing her clothes, loudly complaining, “Mom, he wouldn’t let me tell you I’ve seen him before!”<br/><br/>Jack Amos:<br/><br/>Kevin Clark and Charlotte Lane both looked at Jack Amos.<br/><br/>Jack Amos coughed lightly, not looking at the two of them, especially Kevin Clark’s angry eyes. He suspected the kid might have discovered something.<br/><br/>Otherwise, just by a similar voice, he shouldn’t have recognized him.\t\t\t\t\t\t</div>", "images": {}, "success": true}