{"id": 502, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14875903.html", "title": "Chapter 499: 442: Confronting Someone", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 499: 442: Confronting Someone</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 499: Chapter 442: Confronting Someone<br/><br/>[Are there really so many hidden facts in this matter? The Miles family is too benevolent.]<br/><br/>[Damn, I didn’t expect there to be a twist in this.]<br/><br/>[The Miles Family is so miserable. Johanes Miles is a real man. Charles Hobson is also very good.]<br/><br/>[Whatever they say, you believe it? How do you know this isn’t a self-directed and self-acted play by the Johanes Miles family to prove themselves innocent? Look at these news, which one doesn’t whitewash the Miles family?]<br/><br/>[If it’s really like this, how could the Miles family swallow their humiliation for so long? I don’t believe that they didn’t want to clarify it when Miles Group was suppressed to this extent today, and they rely on others to clarify to tell the truth.]<br/><br/>[Why can’t it be true? Jack Thompson is obviously drunk and clarifying out of guilt. Those who say that the Miles family is self-directed and self-acted are stupid Daisy Zane fans. Stupid fans get lost.]<br/><br/>[Johanes Miles’s statement is full of loopholes, are you all blind, you believe everything.]<br/><br/>[If both parties have long been non-interfering, how could there be Daisy Zane? Why did they have Jace Miles with Charles Hobson first, and then Daisy Zane with Claudia Zane?]<br/><br/>[Jack Thompson said that he had been with Daisy Zane when Johanes Miles met Charles Hobson, is Daisy Zane Johanes Miles’s daughter?]<br/><br/>[Wow, she might not be. Look who Daisy Zane looks like? They say daughters take after their fathers, but she doesn’t look like Johanes Miles at all.]<br/><br/>[Then she dare to go to the Miles family’s recognition?]<br/><br/>[For money and for her own reputation. It’s really possible that she’s not. Otherwise, why wouldn’t her grandmother let Johanes Miles take her back to Truro City.]<br/><br/>[Then Johanes Miles is really pitiful. Divorcing from his wife. His wife is taken by his brother, and his child’s identity is unknown and he is used by this unknown origin child after many years.]<br/><br/>[So that’s what type Claudia Zane is, I used to be sad for her a long time ago.]<br/><br/>[Like mother like daughter, Daisy Zane couldn’t be a good thing.]<br/><br/>[Really wronged our Sophie. She has suffered so much and has always been scolded. All blame the damn Daisy Zane.]<br/><br/>[If it’s really as Johanes Miles said, what’s the matter with the erasure of marriage records back then? The person involved was sentenced.]<br/><br/>[Daisy Zane used the power behind it. The depth of the water behind her is the Clark Family. Compared to this matter, the drama crew starting and stopping work are all trivial matters.]<br/><br/>Online arguments are fierce.<br/><br/>On one side are those who support Johanes Miles, and on the other side are those who support Daisy Zane.<br/><br/>Charlotte Lane watched Johanes Miles’s video while these comments floated across the screen like barrage.<br/><br/>They could feel Charlotte Lane’s murderous intent getting heavier and heavier.<br/><br/>“Lila...” William Lane called her.<br/><br/>Charlotte Lane closed the computer, then sighed softly, “I just thought of a quick solution.”<br/><br/>Nobody spoke.<br/><br/>There were no records of him leaving at any bus station, train station, or airport either.<br/><br/>The Clark Family, Lane Family, and Celestial Pivot dispatched people overnight to search for him.<br/><br/>They even secretly checked the place where the Miles family was now staying, but found nothing.<br/><br/>One night passed, and the situation did not progress.<br/><br/>On the contrary, the online hot searches were updated rapidly.<br/><br/>First was Jack Thompson, then Johanes Miles, Miles Family, Charles Hobson, and Amelia Miles all appeared on the hot search chart one after another.<br/><br/>Daisy Zane and Claudia Zane had always been on the hot search chart. The next morning, Daisy Zane’s background, Clark Family, also appeared on the hot search chart.<br/><br/>Even the long-silent news of the drama crew stopping work resurfaced.<br/><br/>As the online information was not controlled, some media outlets and self-proclaimed “righteous people” trying to gain traffic became increasingly active.<br/><br/>They were all indignant.<br/><br/>They couldn’t wait to eat Daisy Zane’s flesh and drink her blood.<br/><br/>Charlotte Lane didn’t return to the Lane family that night. After resting for one night, she calmed down a lot.<br/><br/>She discussed with Melody Collins and Anisa Cooper and decided to respond on Facebook first.<br/><br/>Otherwise, people would really think she was guilty and chose to remain silent.<br/><br/>So Charlotte Lane logged in to Facebook.<br/><br/>Then...Melody Collins encountered the Nth obstacle of her career.<br/><br/>First, Charlotte Lane reposted Jack Thompson’s video and wrote: [So good at spreading rumors, stop pretending to be missing. Come out and accept your father’s lawyer’s letter.]<br/><br/>Then she reposted the video of Johanes Miles being interviewed and wrote: [Sounds so nice. Weren’t you the one who called me for help? Good thing I recorded it, let everyone enjoy it.]<br/><br/>After that, she started reposting hot search posts from netizens who scolded Daisy Zane and Claudia Zane.<br/><br/>Each time she reposted a post, she would add a witty comment to counter the person: [You sound so sure, did you witness the incident back then?]<br/><br/>[Give me your address, I’ll send you some walnuts.]<br/><br/>[You analyze so logically...good thing you’re not a detective, or you’d have wronged many people.]<br/><br/>[I know you’re an elementary school student, so...go do your homework.]<br/><br/>[Does leeching off my traffic smell good? Wait for me to sue you.]<br/><br/>[Which paid troll do you work for? How much did they pay you? Having you repeat the same sentence in eleven different comment sections.]<br/><br/>[My background is big? Yeah, I am lucky. Are you jealous?]\t\t\t\t\t\t</div>", "images": {}, "success": true}