{"id": 509, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14883728.html", "title": "Chapter 506: 449: The True Cause Of Death", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 506: 449: The True Cause Of Death</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 506: Chapter 449: The True Cause of Death<br/><br/>As soon as it hit seven o’clock, Charlotte Lane’s internal clock woke her up.<br/><br/>She opened her heavy eyelids and saw Harton Clark’s Adam’s apple the moment she raised her head.<br/><br/>She stared at it for a moment before her eyelids began to droop again.<br/><br/>After countless failed attempts to keep her eyes open, Charlotte Lane extended her leg and kicked Harton Clark off the bed.<br/><br/>However, since Harton was holding her while they slept, they both shared the quilt.<br/><br/>When Harton fell off the bed, Charlotte was pulled down with him.<br/><br/>Except Harton fell onto the floor, while Charlotte landed on him.<br/><br/>Harton had just woken up, his recently opened eyes filled with surprise, especially after getting hit by Charlotte.<br/><br/>He took a light breath, his hand resting on Charlotte’s waist, and smiled, “What are you doing? Attempting to murder your husband?”<br/><br/>Charlotte glanced at him, ignored him, and walked towards the restroom after removing his hand from her waist.<br/><br/>Harton knew he had gone overboard last night, so he didn’t get angry. He got up and followed her to the restroom.<br/><br/>However, Charlotte locked him out.<br/><br/>Harton tried the doorknob a couple of times, “Little Girl, I got you your leave, why not sleep in a bit more?”<br/><br/>No one responded to him.<br/><br/>Harton tried the doorknob again.<br/><br/>Then a few water droplets spread on the frosted glass, and Charlotte’s cold voice came from inside, “Shut up.”<br/><br/>After Harton remained quiet, Charlotte looked at messages on her phone while brushing her teeth.<br/><br/>That’s when she found out she had made the hot search for being late and cheating.<br/><br/>The leaker made the story sound so convincing that she almost believed it herself.<br/><br/>However, what attracted her attention more was the fact that many co-stars from her previous films were defending her.<br/><br/>Suddenly, a hot search titled [The real cause of Ella Harrizon’s death] rose to the fifth place.<br/><br/>She stopped at the restroom entrance, clicked on the hot search.<br/><br/>Inside was a video.<br/><br/>The woman in the video looked like she was in her seventies or eighties, with gray hair, sitting on a hospital bed, looking frail.<br/><br/>“Hello, everyone. My name is Ariel Lee. I used to be the nanny of the Miles family, and I was specifically responsible for taking care of Ella Harrizon when she was in the Miles family. Recently... I have seen many messages on the internet...”<br/><br/>Ariel Lee seemed to have trouble speaking. She paused and gasped for a while before continuing: “I don’t know much about the marriage between Mr. Johanes Miles and Ella Harrizon, and I’m not sure who cheated. I just know... Ella Harrizon liked Mr. Miles a lot.”<br/><br/>“Almost one year before Lady Harrizon became pregnant, Mr. Miles rarely came home. Lady Harrizon was always waiting for him to come home at that time.”<br/><br/>It took Ariel Lee a long time to say, “My body is not well, and I can’t sit for too long. I won’t say any more unnecessary words. The main reason I made this video today is because I did something that has been bothering me for more than twenty years.”<br/><br/>“Ella Harrizon, Lady Harrizon... didn’t die by suicide at all. At that time, she had already moved out of the Miles Family with her newly born child. That day, under the pretext of visiting her, I put a large amount of crushed sleeping pills in her food.”<br/><br/>Charlotte Lane’s hand holding the cell phone tightened slightly, just as Harton Clark came back from washing up next door.<br/><br/>“What are you watching?” Harton Clark stood by her and looked at her cell phone.<br/><br/>Ariel Lee’s weak voice appeared again: “And the medicine... was given to me by the Old Master of the Miles Family. She asked me to put the medicine. She also said... let me poison the child to death, and then fake it as Ella Harrizon committed suicide out of depression and wanted to kill the child. But the child was so small, and I couldn’t do it...”<br/><br/>“Later, the Old Master sent me abroad. I suspect he hired someone to assassinate me, but I have no evidence.” Ariel Lee touched a knife scar at least four centimeters long on the left side of her neck, “God had mercy on me, and I survived. I’ve been living incognito overseas for these years.”<br/><br/>Ariel Lee wiped away her tears: “This matter has been hidden in my heart for more than twenty years. I have always felt guilty, and I dare not speak out, because I am the one who poisoned her, and I don’t want to go to jail. But now my life is coming to an end, and I have no concerns. Before I die... I must say this matter. I have already called the police, and if I can still return to China, I will turn myself in.”<br/><br/>Ariel Lee took out a cassette tape: “Here is the recording of when the Old Master of the Miles Family found me back then. Although the sound quality is not good, I heard that current technology can identify if it is someone’s voice. You don’t have to bother to have someone take this recording away. When this video is released, the recording is already sent to the police station in China.”<br/><br/>After watching the video, Charlotte Lane was silent for two seconds, then called Holt Lawrence and whispered: “This time even the gods can’t save the Miles Family.”<br/><br/>When Holt Lawrence answered, Charlotte Lane said, “Did the police go to the Miles Family yet?”<br/><br/>“They did,” Holt Lawrence said, “I also arranged for the media. As soon as someone from the Miles Family is taken away, it will immediately go on the hot search. Nana, have you seen the video the aunt posted online? This time, even if you want to show mercy, it’s impossible. The Miles Family’s Old Master is involved in a murder.”<br/><br/>“Show mercy?” Charlotte Lane clenched her fingertips.<br/><br/>These four words no longer have anything to do with her.<br/><br/>She had given the Miles Family enough chances, but they didn’t want them...\t\t\t\t\t\t</div>", "images": {}, "success": true}