{"id": 507, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14883724.html", "title": "Chapter 504: 447: Two Little Rabbits", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 504: 447: Two Little Rabbits</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 504: Chapter 447: Two Little Rabbits<br/><br/>In the coffee shop.<br/><br/>Jack Amos, Wilton Edwards, and Charles Amos returned to their seats.<br/><br/>Jack Amos rubbed his lower back and looked at Charles Amos across the table.<br/><br/>Charles played chess by himself, his facial expression alternating between guilt and self-righteousness.<br/><br/>“Call your Uncle Clark and ask him to come back,” Jack Amos said to him as he watched his face change for the nth time.<br/><br/>“Why?”<br/><br/>“Why do you always ask why?”<br/><br/>Charles Amos looked at him and did not speak.<br/><br/>“Either you make the call, or I hit you,” Jack Amos said.<br/><br/>“Why are you like this?” Charles frowned and said, “When other fathers and sons meet, they cry their hearts out, like they want to give the whole world to him, they like him so much. But you, you just want to hit me when we meet.”<br/><br/>Jack said, “Did I make the first move?”<br/><br/>“It was me,” Charles admitted.<br/><br/>Jack raised his eyebrows.<br/><br/>Charles picked up the cell phone and called Kevin Clark, then put it on speakerphone.<br/><br/>Kevin quickly answered the call on the other end, but did not say anything.<br/><br/>Charles said, “Uncle Clark, you left me here.”<br/><br/>“Wilton Edwards, the driver, and the bodyguard are with you,” he replied.<br/><br/>“But, but...” Charles looked at Jack and said, “the other person with the last name Amos said he wanted to hit me.”<br/><br/>Jack Amos:<br/><br/>Kevin Clark was silent for a moment and then said, “I’ll call the police for you.”<br/><br/>Charles Amos:<br/><br/>Jack Amos chuckled, “Where are you?”<br/><br/>Kevin didn’t say anything after hearing his voice.<br/><br/>“Come back, I’ll take you to eat something delicious.”<br/><br/>Kevin Clark:<br/><br/>Charlotte Lane glanced at Kevin Clark.<br/><br/>No one spoke.<br/><br/>Charlotte Lane said, “We’ll be back right away.”<br/><br/>“Okay.” Jack laughed.<br/><br/>Less than three minutes after hanging up the phone, Charlotte brought Kevin back.<br/><br/>Kevin’s eyes were no longer red, and he was no longer angry, just silent.<br/><br/>Jack pointed to the two empty dessert boxes in the trash can, “Who ate these?”<br/><br/>“I’m not full.”<br/><br/>“Whose poor family is it that has met such a little foodie like you?” said Jack Amos, and then added, “Oh, mine.”<br/><br/>Kevin laughed a little.<br/><br/>Jack said, “They are having a barbecue in the back of the shop, want to eat?”<br/><br/>Kevin looked at Charlotte.<br/><br/>Charlotte said, “Mm.”<br/><br/>The three adults took the child to the back of the shop. In addition to the barbecue, Jack also asked the Doomsday Hotel to send a lot of other food.<br/><br/>“When are we going home?” Kevin asked.<br/><br/>Jack took a sip of beer and hesitated before saying, “Don’t tell our family for now.”<br/><br/>“Why?” Kevin asked.<br/><br/>Jack heard him ask why, frowned and instinctively looked at Charles.<br/><br/>Charles was biting on a mutton skewer. When he saw him looking, he bit down on the stick, showing a row of small teeth and smiling at him.<br/><br/>Jack looked away, furrowed his eyebrows, and suddenly didn’t know how to explain it to Kevin.<br/><br/>Telling him that not only had his appearance changed, but he had also gotten himself into such a state.<br/><br/>His parents used to take great pride in their son, who was once full of achievements, but now he had fallen to such a level.<br/><br/>Also... what he was doing now was very dangerous.<br/><br/>He didn’t want his parents to bear the pain of losing their son twice.<br/><br/>Seeing his expression, Kevin seemed to understand his predicament and said, “I know.”<br/><br/>Jack looked at Kevin, smiled, and clinked beer glasses with him.<br/><br/>Although no words were spoken, the expression seemed to say, it’s still my little brother who understands me.<br/><br/>But he didn’t expect to be tricked for the second time in just a few hours.<br/><br/>After drinking with Kevin, Jack went to the restroom for a while.<br/><br/>After washing his hands, he sent a message to Hugo Clark: [Are you still in Clark Manor?]<br/><br/>Hugo Clark: [Yes. Aren’t you guys coming back? Grandma keeps talking about Charles.]<br/><br/>Kevin Clark: [Are your parents and Sister-in-law Wood there?]<br/><br/>Hugo Clark: [Mm.]<br/><br/>Kevin sent his current location: [Bring your grandparents, your parents, and Lily Parker here. Hurry up.]<br/><br/>So, an hour later, when Jack saw his parents, elder brother, sister-in-law, and his nephew and niece suddenly appear in front of him...<br/><br/>His first reaction was to think that he had drunk too much and was hallucinating.<br/><br/>The second reaction was to look at Kevin Clark, then at Charles Amos, who was leaning against Kevin and almost falling asleep.<br/><br/>The two damn rabbits.\t\t\t\t\t\t</div>", "images": {}, "success": true}