{"id": 506, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14883723.html", "title": "Chapter 503: 446: Too Coincidental", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 503: 446: Too Coincidental</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 503: Chapter 446: Too Coincidental<br/><br/>Ever since the Clark family stood outside the coffee shop, a couple had come in to buy coffee and left as soon as they finished their purchase.<br/><br/>So besides the shop assistant, it was just them inside.<br/><br/>Jack Amos looked at Kevin Clark and Charlotte Lane, both with red eyes, and hesitated before asking, “I read online that you got married. Is this... your husband?”<br/><br/>Charlotte Lane took a light breath, but due to her emotional agitation, her throat was dry and sore, so she just nodded in the end.<br/><br/>Jack Amos turned to Kevin and smiled a little, extending his hand politely, “Jack Amos. How should I address you?”<br/><br/>Kevin threw the tissue in his hand into the trash can, glanced at Jack’s hand, then looked up at him, his voice icy, “Don’t you recognize me?”<br/><br/>Charlotte tilted her head to look at him, some confusion in her eyes.<br/><br/>Jack felt his heart skip a beat. He swallowed, but couldn’t find the words for a moment.<br/><br/>Kevin rubbed his fingertips together and said, “Change your tone before pretending you don’t know me and testing me.”<br/><br/>Charlotte gently frowned.<br/><br/>Wilton Edwards was also a little confused.<br/><br/>“I...” Jack couldn’t finish his sentence.<br/><br/>Because Kevin made a move.<br/><br/>With a bang, Jack took a punch and bumped into the table behind him.<br/><br/>Charles Amos was startled.<br/><br/>Kevin stepped forward, grabbing Jack’s collar, his hoarse voice saying, “Why the hell are you alive... and not going home!”<br/><br/>Charlotte’s words of intervention died on her lips, and she silently watched the two of them.<br/><br/>Charles’ face was full of confusion, his eyes wide.<br/><br/>Wilton was too.<br/><br/>The shop assistant saw Jack get hit and wanted to help, but hearing Kevin’s words, he stopped as well.<br/><br/>Jack held Kevin’s wrist and sighed softly, “Kevin...”<br/><br/>Hearing these two words, Kevin’s eyes turned even redder, even bloodshot.<br/><br/>He gripped Jack’s collar tightly, stared at the man in front of him, then let go, taking a step back.<br/><br/>He turned around, took Charlotte’s hand, and left the coffee shop.<br/><br/>Charles stood in place, staring at his empty little hand. He then looked at the two people who had walked some distance away, accepting the fact that he had been abandoned.<br/><br/>Kevin chuckled and looked up at her.<br/><br/>His eyes were very red, rarely this red, and the corners of his eyes were moist. It seemed as if he had cried, but Charlotte knew that he hadn’t.<br/><br/>“Jack is Edward North.” Kevin caressed Charlotte’s face and said, “He’s my Second Brother.”<br/><br/>Charlotte had guessed already. From the moment he asked Jack why he didn’t go home, she had thought of Edward North.<br/><br/>Because the Clark Family was missing this one person, and there weren’t many people who could make Kevin so emotional.<br/><br/>However, she still found it difficult to accept, even to believe.<br/><br/>“You guessed it, right?” Kevin said.<br/><br/>“Yes.” Charlotte fell silent for a while and then said, “His appearance...”<br/><br/>She thought about the attitude Kevin had when mentioned Jack before, treating him like a stranger.<br/><br/>“How... did you find out?” Charlotte asked.<br/><br/>“My Father discovered it.” Kevin leaned back and touched under her red-rimmed eyes, “The letter he wrote to Charles Amos had the same handwriting as my Second Brother’s. And... Charles Amos increasingly looks like me. So my parents and Charles did a parent-child identification. The child is not mine, nor my Big Brother’s, and my parents don’t have any other children. Although the appearance doesn’t match, the handwriting does.”<br/><br/>Charlotte fell silent for a while again, looking at Kevin and asking, “When did this happen?”<br/><br/>Kevin thought for a moment and said, “Not long after you returned to the drama crew after the New Year.”<br/><br/>Charlotte suddenly remembered that when she was in the drama crew, Kevin, without even wearing a coat, drove to find her.<br/><br/>His mood was off that day, but he wouldn’t tell her why.<br/><br/>He didn’t say because he was afraid she would feel guilty, afraid she would feel sorry for his family.<br/><br/>Charlotte fell silent once more.<br/><br/>Jack was Edward North.<br/><br/>She had lived with Edward North for several years in Continent A.<br/><br/>The two families were close, but when Charlotte was born, Edward North had already gone to serve in the military and was often not at home.<br/><br/>So Edward North had never actually seen Charlotte.<br/><br/>But Charlotte had seen his photos, although his appearance had changed.<br/><br/>Looking down at Kevin’s hand holding her fingers, she thought, so... Charles was Kevin’s biological nephew.<br/><br/>So... Charles didn’t resemble Kevin. He didn’t resemble any of his parents either; he resembled Edward North, who hadn’t had a change in appearance.<br/><br/>“Does Charles... know?” Charlotte asked.<br/><br/>“Never told him.”<br/><br/>Charlotte still found it hard to accept that all these things were just too coincidental.\t\t\t\t\t\t</div>", "images": {}, "success": true}