{"id": 500, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14874144.html", "title": "Chapter 497: 440: Making Trouble Again", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 497: 440: Making Trouble Again</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 497: Chapter 440: Making Trouble Again<br/><br/>At 5 AM, Andrew Lane brewed a cup of coffee and sat on the living room sofa, staring at Charlotte Lane’s room.<br/><br/>He had already planned that if he saw Kevin Clark leaving his daughter’s room, he would get him drunk again tonight, drench him unconscious, and then dump him at the gateway of Clark Manor in the middle of the night!<br/><br/>Let him sleep on the streets!<br/><br/>Then get a few media outlets so that he would be on the front page!<br/><br/>As Andrew Lane sipped his coffee, he contemplated his various strategies.<br/><br/>Suddenly, he heard the sound of the door opening from the other side.<br/><br/>Immediateley he turned his head to look over.<br/><br/>Then... his eyes met with Charlotte Lane’s who had just come out of Kevin Clark’s room.<br/><br/>Charlotte Lane did not want Andrew Lane to know that she had gone to Kevin Clark’s room at night.<br/><br/>She somewhat understood some of Andrew Lane’s feelings.<br/><br/>So, she wanted to return to her room early.<br/><br/>Unexpectedly... at such a coincidence, she was caught red-handed.<br/><br/>Andrew Lane also didn’t expect this situation to happen now.<br/><br/>He didn’t expect that Kevin Clark wouldn’t go to his daughter’s room, but rather, his daughter went to Kevin Clark’s room.<br/><br/>How was he to handle this?<br/><br/>He hadn’t expected such a situation.<br/><br/>The two viewed each other for two seconds from the upper and lower floors, then Andrew Lane first averted his gaze, lowered his head to drink his coffee, and also picked up the newspaper beside him, pretending he hadn’t seen anyone.<br/><br/>Charlotte Lane, seeing his reaction, lifted the corner of her mouth and leisurely returned to her room.<br/><br/>Such a long distance, Charlotte Lane walked slowly, but all this time, Andrew Lane never looked up again.<br/><br/>It wasn’t until he heard Charlotte Lane’s room door open and close again that he finally let out a long breath of relief.<br/><br/>Ah it was a bit awkward.<br/><br/>This Kevin Clark... he must have been a member of the Fairy Clan in his previous life to bewitch his daughter like this.<br/><br/>After Charlotte Lane returned to her room and changed her clothes, she came downstairs.<br/><br/>Andrew Lane didn’t think she would come down so soon. He was planning to finish his coffee and then retreat, but he didn’t have time to do that.<br/><br/>“Lila, did you wake up?” Andrew Lane warmly asked as though he saw her for the first time today, “Why not sleep a little longer?”<br/><br/>“Can’t sleep anymore,” Charlotte Lane responded, “Dad, you woke up so early too.”<br/><br/>Andrew Lane smiled and said: “I couldn’t sleep either.”<br/><br/>Charlotte Lane raised her eyebrow.<br/><br/>“Do you want some coffee?” Andrew Lane inquired, “Should I make some for you?”<br/><br/>Charlotte Lane nodded: “Um.”<br/><br/>Andrew Lane’s mood immediately improved a lot, he got up and responded, “Dad also knows how to make latte art, do you want some?”<br/><br/>He didn’t deny that he abandoned the idea of killing her because she was attractive. In addition to that, her abilities and influence were very strong.<br/><br/>Which could provide great help to him in the future power struggle.<br/><br/>But... over the years, over the years... there must be some feelings, right?<br/><br/>As for Charlotte Lane, there were feelings indeed, but merely friendships.<br/><br/>She always thought that Gael Easton was all talk. Because that’s how he was when they first got to know each other.<br/><br/>She didn’t expect him to mean it.<br/><br/>“You little brat, you’ve crossed the line,” Gael Easton pointed at her and said, “Fine. Let’s cut off contact. Contact me only when necessary.”<br/><br/>“Alright.”<br/><br/>“What do you mean alright!” Gael Easton clutched his chest, “Damn it! I feel sorry for Kevin Clark now. How did he end up with such a cold-hearted woman like you. Eh? What are you doing?”<br/><br/>“Getting my dues.” Charlotte Lane looked down at her phone and said, “Putting ‘cold-hearted woman’ into practice.”<br/><br/>Gael Easton thought she was going to delete him as a friend, surprisingly it was worse. He quickly said, “Wait! Wait a minute! I can find another adjective. My command of Chinese isn’t that good, let me think, let me think! Don’t be impulsive, Fortune favours the peacemakers.”<br/><br/>After seeing Gael Easton off to the plane, Kevin Clark and Charlotte Lane went to the Research Institute.<br/><br/>They spent the whole day at the Research Institute, had dinner outside at past seven in the evening, and then went to the hospital to visit William Lane.<br/><br/>However, while they were in the hospital elevator, they received a phone call from Olivia Lane.<br/><br/>“Sister, where are you?”<br/><br/>“What’s wrong?”<br/><br/>“Check the internet.” Olivia Lane’s voice was filled with anger, “A man just popped up online claiming to have had an affair with Claudia Zane. He’s claiming that Claudia Zane had been unfaithful when she was married.”<br/><br/>Charlotte Lane hadn’t expected anyone would target Claudia Zane.<br/><br/>She furrowed her brows and said, “Alright. I’ll check it.”<br/><br/>After hanging up, Charlotte Lane and Kevin Clark didn’t go to the ward. Instead, they stayed outside and checked the news online.<br/><br/>A man named Jack Thompson had released a video online.<br/><br/>The person in the video looked drunk, his face was red and his speech was slightly slurred.<br/><br/>“My name is Jack Thompson, I was Claudia Zane’s classmate in university. I was also once good friends with Johannes Miles.”<br/><br/>“I met with Johannes Miles a couple of days ago.” Jack Thompson said, as he lifted his hand to wipe his face, “I saw a once vibrant man now living a messy life.”<br/><br/>“Miles Group has been suppressed, the Miles family has been ostracized, Mrs. Miles has been insulted, and their child has been deemed the child of a mistress. I didn’t know the extent of the influence and damage that the lawsuits back then had caused.”<br/><br/>As Jack Thompson spoke, he wiped away a tear: “Seeing the state of their family, I couldn’t bear it any longer. So, today, I’m willing to lose face, I don’t want to live a tormented life with an uneasy conscience anymore, I want to present the truth.”<br/><br/>“Actually, Claudia Zane and I were together even before Johannes Miles and his present wife met.”<br/><br/>“She said that Johannes Miles was so engrossed with his career that he neglected her. Because she was too lonely, we started an affair behind Johannes Miles’ back.”<br/><br/>Suddenly, Jack Thompson slapped himself twice: “I’m not human, I’m not human. I even snatched my good brother’s wife. We were together for a year before Johannes Miles found out. To save our face, he didn’t raise a big fuss about it. At that time, his old master’s health wasn’t good. Johannes Miles didn’t want to worry his father, so they didn’t get a divorce immediately.”<br/><br/>“But at that time, Claudia Zane and Johannes Miles had already reached an agreement. Although they temporarily did not divorce, both of them would not interfere with each other’s relationships. They planned for a peaceful divorce once his old master’s health improved.”<br/><br/>“So, there’s no issue of who is the mistress, or who is the illegitimate child.”\t\t\t\t\t\t</div>", "images": {}, "success": true}