{"id": 501, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14874147.html", "title": "Chapter 498: 441: Interviewed By A Reporter", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 498: 441: Interviewed By A Reporter</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 498: Chapter 441: Interviewed by a Reporter<br/><br/>After Dou Shaobai’s video was released, the heat rose rapidly. Each time it was refreshed, it ranked higher on the hot search list.<br/><br/>Obviously, someone was pushing behind the scenes.<br/><br/>The video seemed to be from Dou Shaobai, suffering from condemnation in his heart, getting drunk, and impulsively posting it.<br/><br/>However... although his face was flushed, and his speech was slightly slurred, the words in the video didn’t sound like something a drunk person could say.<br/><br/>His tone was too calm, and for a drunk person, the words were too fluent.<br/><br/>It should have been prepared in advance.<br/><br/>“Holy shit! Look, look, look!” Allonzo Hobson’s voice suddenly came from the ward, “This definitely isn’t something someone can say when they’re drunk. This must be read from a script.”<br/><br/>Allonzo’s voice brought Charlotte Lane back to her senses, as she closed her cellphone and leaned against the wall.<br/><br/>Harton Clark held her hand and said, “Miss, we need to find this person first.”<br/><br/>Olivia Lane blinked her eyelashes, and then straightened her body as she entered the ward.<br/><br/>It wasn’t just Allonzo Hobson in the ward; Hugo Clark and Olivia Lane were also there.<br/><br/>They all froze for a moment when they saw Charlotte Lane and Harton Clark. Allonzo asked, “Brook Sister, you’ve arrived?”<br/><br/>“Yeah.” Charlotte Lane looked at William Lane, seeing that his spirits were high, and asked, “Where is the computer your assistant brought for you?”<br/><br/>Olivia Lane immediately looked at William Lane.<br/><br/>The doctor told him to rest, but he kept worrying about work and the experiments at the Research Institute. He had asked family members for his computer, but they refused.<br/><br/>As a result, he had asked his assistant to sneak it in behind their backs.<br/><br/>William Lane coughed lightly, knowing that Charlotte Lane needed the computer urgently, so he didn’t hide it anymore. He said, “It’s in the bottom drawer of the cabinet.”<br/><br/>Olivia Lane immediately crouched down and took out the computer for Charlotte Lane. Then, she stood by the bedside with her hands on her hips, looking at William Lane.<br/><br/>Seeing her like this, William Lane laughed and said, “Olivia...”<br/><br/>“Who is Olivia? I don’t go by Olivia anymore.” Olivia Lane stood with her hands on her hips, “Today, I am called ‘stubborn elder brother.’”<br/><br/>William Lane laughed again and said, “I didn’t use it much. Just don’t bother Charlotte.”<br/><br/>“I won’t be disturbed.” Charlotte Lane sat aside, typing on the keyboard without raising her head, “Don’t let him off easily. Settle the score well.”<br/><br/>Olivia Lane’s momentum became even more intimidating.<br/><br/>William Lane:<br/><br/>Allonzo Hobson laughed and clapped Hugo Clark on the shoulder while sitting on the bed. “Old Clark, what does it feel like having two sisters?”<br/><br/>Even this Daisy is fake.<br/><br/>If the matter is taken seriously, her fake identity would only prove that Claudia Zane had an affair.<br/><br/>Charlotte Lane rubbed her temples.<br/><br/>Kevin Clark stood behind her and touched her face from behind, “There will always be a solution.”<br/><br/>William Lane glanced at Kevin Clark’s hand, and then looked away after a moment.<br/><br/>Out of sight, out of mind.<br/><br/>“Uh... do you want to see what’s happening online now?” Allonzo Hobson said, holding his cellphone, “Johanes Miles... got interviewed by a reporter.”<br/><br/>“How did he get interviewed by a reporter?” Olivia Lane frowned.<br/><br/>“It looks like it’s in front of Dance Association’s entrance.” Allonzo Hobson just saw a few screenshots online, but hadn’t seen the video yet, “It’s said that Johanes Miles went to pick up Amelia Miles to go Home and bumped into a reporter at the entrance of the Dance Association.”<br/><br/>As he spoke, Charlotte Lane had already found the video of Johanes Miles being interviewed on her computer and clicked play.<br/><br/>Everyone quickly watched.<br/><br/>When the reporter asked if the news on the internet was true, Johanes Miles looked confused in the video, as if he didn’t know what was happening online.<br/><br/>Then the reporter showed Johanes Miles the video Jack Thompson had posted.<br/><br/>After watching, Johanes Miles was silent for a long time.<br/><br/>Amelia Miles stood beside him, watching the video with a surprised look. After a while, she looked at Johanes Miles and called out, “Dad?”<br/><br/>Johanes Miles suddenly came back to his senses.<br/><br/>The reporter asked if the man in the video was telling the truth.<br/><br/>Johanes Miles looked at the reporter and fell silent again for a moment. He suddenly pressed his eye socket and sighed with his head down, “It’s been so long, why bring it up again?”<br/><br/>The reporter asked, “So you mean, what Jack Thompson said is true? If it’s true, why didn’t your lawyer mention it when Daisy sued you? You accepted the court’s ruling and even made your home like this?”<br/><br/>“I feel guilty towards Daisy; she is my daughter and has lived in Cold Green Village for more than twenty years. I failed in my duty as a father.” Johanes Miles said sorrowfully, “Moreover, afterward, when Claudia Zane committed suicide due to postpartum depression, I still felt guilty. I failed my child. I don’t know how to make amends to her. And after telling the truth, what would you have the child do? How would Daisy think of her mother?”<br/><br/>“Since you feel guilty, why didn’t you bring Daisy back from Cold Green Village back then?” the reporter asked again.<br/><br/>“I tried.” Johanes Miles sighed, “My father and Jordan Ashton both wanted me to bring her back. I visited more than ten times. But her grandma insisted on raising the child herself, there was nothing we could do.”<br/><br/>“So you let your wife, son, and daughter live with disgrace all their lives?” The reporter’s points were all sharp.<br/><br/>“It was Jordan Ashton who felt that Daisy was suffering too much. She thinks she is too bitter alone.” Johanes Miles said, “She said that our family has so many people that we can slowly improve our lives. Daisy is on her own...”<br/><br/>At the end of his words, Johanes Miles’s eyes were wet and red. Amelia Miles’s eyes turned red as she cried and wiped her tears with her head down, facing away from the camera.\t\t\t\t\t\t</div>", "images": {}, "success": true}