{"id": 508, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14883726.html", "title": "Chapter 505: 448: Finding Jack Thompson", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 505: 448: Finding Jack Thompson</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 505: Chapter 448: Finding Jack Thompson<br/><br/>The night breeze felt cool as the stars filled the sky.<br/><br/>Kevin Clark watched as his mother hugged his brother Edward North, crying, while everyone else crowded around Edward. Meanwhile, Kevin sat to the side, leisurely snacking on skewers.<br/><br/>Charlotte Lane looked at him and paused before saying, “Third Master, you even tricked your own brother.”<br/><br/>Kevin patted Charles Amos’ head and laughed, “He even tricked his own dad.”<br/><br/>Charles was initially dozing off but woke up when so many people suddenly appeared.<br/><br/>Charlotte glanced at the two of them. She suddenly felt that Charles’ cunning in some aspects might not be due to Edward Kirsten, but instead due to Kevin Clark.<br/><br/>After all... In this way, the two of them were as close to her as Edward Kirsten.<br/><br/>Kevin had some idea of what Edward North was doing and indeed guessed his concerns.<br/><br/>His thoughts were simple.<br/><br/>As a family member, all he wanted was for Edward to be safe and healthy. As for what he looked like or what he was doing, whether he had any achievements, none of that mattered.<br/><br/>As for the dangerous things...<br/><br/>Now that Edward North had returned, Kevin Clark had plenty of ways to keep him out of danger. If all else failed, he would just keep him confined at home.<br/><br/>Eventually, Edward North was taken by Theo Clark and Hugo Clark to the car and directly brought back to Clark Manor.<br/><br/>Kevin, Charlotte Lane, and Charles Amos also returned to Clark Manor.<br/><br/>On the way back,<br/><br/>Edward North sat between Elina Clark and Tom Wayne, holding Tom’s hand.<br/><br/>Tom had already recovered a little, his tearful eyes filled with laughter, “Do you think... Charlotte is our family’s lucky charm? It feels like ever since she married Kevin, good things have happened to our family.”<br/><br/>Amid her tears, Elina agreed happily: “That’s true.”<br/><br/>Charlotte? Edward North asked, “Isn’t her name Daisy?”<br/><br/>“You probably don’t know,” Tom replied. “She is the daughter of the Lane Family, Charlotte Lane.”<br/><br/>Edward North was stunned by this series of amazing surprises, “Who?!”<br/><br/>Once they arrived at Clark Manor, Edward North asked Charlotte about it, and then he learned that Second Uncle Peter was involved.<br/><br/>The words “Second Uncle” left Edward North dumbfounded.<br/><br/>How did Enigma Starry used to call him?<br/><br/>Jack Amos called him “Elder Brother.”<br/><br/>Jack Amos called him “Elder Brother” and “Second Uncle.”<br/><br/>The devastating effect these words had on his fragile heart today was immense.<br/><br/>Holding the sleeping Charles Amos, Kevin chuckled on the side.<br/><br/>Edward North glared at him, “What’s so funny? I haven’t even settled the score with you.”<br/><br/>After Kevin finished the phone call, he placed the phone on the bedside table.<br/><br/>Then he lied down on the bed and gently held Charlotte Lane in his arms.<br/><br/>“Who was it?” Charlotte Lane asked in a low voice.<br/><br/>“Holt Lawrence.” Kevin Clark kissed her forehead, “Jack Thompson has been found.”<br/><br/>Charlotte Lane opened her eyes: “Where? Is he still alive?”<br/><br/>“Alive.” Kevin Clark said, “At the Miles Family’s Imperial Capital apartment’s parking lot.”<br/><br/>“Didn’t they search there the night before?”<br/><br/>“Yes. In the trunk of the car in the parking garage.” Kevin Clark said, “Holt Lawrence said. He had someone sneak in and check at dawn. They didn’t find anything at first, but suddenly there was some movement in the trunk, so they found him.”<br/><br/>Charlotte Lane frowned.<br/><br/>“I told Holt Lawrence to call the police. Using the name of the Miles Family’s servant, exposing the Miles Family’s illegal detention of people.” Kevin Clark said, “An anonymous call, they can’t trace it to Holt Lawrence.”<br/><br/>Charlotte Lane nodded: “Okay.”<br/><br/>“Wait for the news.”<br/><br/>“Okay.”<br/><br/>“Let’s sleep a little more.” Kevin Clark said.<br/><br/>Charlotte Lane closed her eyes and muttered, “Now you’re willing to let me sleep.”<br/><br/>Kevin Clark laughed and said, “Madam is too charming; it’s hard to control myself sometimes...”<br/><br/>Charlotte Lane mercilessly rewarded him with one word: “Scram.”<br/><br/>Less than ten minutes after Holt Lawrence called the police.<br/><br/>At just past six o’clock in the early morning, when the night owl netizens who had been eating melon till late night had not yet woken up, the news about Charlotte Lane once again topped the hot searches.<br/><br/>First, the so-called insider, who claimed to be a staff member on the film set, exposed that Daisy Zane threw a tantrum on the set and slapped a staff member.<br/><br/>The whistleblower was furious, and although there were no photos or videos for proof, the excited voice, angry tone, and vicious oaths made the story sound very real.<br/><br/>As soon as the hot search came out, it instantly woke up the netizens who might have just fallen asleep.<br/><br/>And soon, another hot search about Daisy Zane’s infidelity appeared.<br/><br/>There were many photos of Daisy Zane with Liam Davis, Daisy Zane with John Anderson, Daisy Zane with William Lane, and Daisy Zane with Joseph Allen.<br/><br/>With Liam Davis, and with John Anderson, they were just standing together talking, but some photos made them look intimate because of the angle.<br/><br/>But it was quite apparent that Charlotte Lane’s face read “polite indifference.”<br/><br/>There was no sign of alienation in the photos with Joseph Allen; the two looked very familiar. It’s just that the photo was taken in the Cloud Clothing and Rainbow Skirts parking lot, making it seem like the two were involved in something.<br/><br/>The photos with William Lane looked a bit more intimate.<br/><br/>Because it was not long ago, Charlotte Lane was helping William Lane walk to the hospital garden.<br/><br/>Early in the morning, while Charlotte Lane was still sleeping soundly, a series of terms such as “hooking up with multiple men,” “infidelity within marriage,” and “giving Kevin Clark a green hat” were quickly assigned to her.\t\t\t\t\t\t</div>", "images": {}, "success": true}