{"id": 504, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14875905.html", "title": "Chapter 501: 444: He’S Just Like Jack Amos.", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 501: 444: He’S Just Like Jack Amos.</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 501: Chapter 444: He’s just like Jack Amos.<br/><br/>Around six in the afternoon, Uncle Edwards picked up Charles Amos from Court Music Academy.<br/><br/>Seeing that several new cars had joined their convoy, Charles Amos, feeling somewhat anxious, asked, “Grandpa Edwards, has something happened again?”<br/><br/>“It’s because of the messages online,” said Uncle Edwards, holding on to Charles’s hand, “Third Master is worried that someone might use you against miss, so he has placed some extra guards.”<br/><br/>Having seen the messages online, Charles frowned slightly at Edwards’ words, “Has it not been resolved yet?”<br/><br/>“Third Master and miss know what they’re doing.” Uncle Edwards helped Charles get into the car, “The cars following us have been modified for performance but look ordinary. This keeps our profile low.”<br/><br/>“Hmm.”<br/><br/>“Did you find your classes tiring today?”<br/><br/>“Not tiring. But today’s song was kind of tough.” As Charles spoke, he looked outside at the passing city, “Uncle Driver, are we taking Heriken Road today?”<br/><br/>“Yes,” the driver responded.<br/><br/>“I want to buy coffee from the coffee shop across from the Night View Hotel,” Charles turned to Edwards, “Sister Lily is visiting Clark Manor today. She really loves the coffee and desserts from there.”<br/><br/>“Alright,” Uncle Edwards said warmly, “I’ll accompany you.”<br/><br/>The cars pulled over one by one into the parking spaces in front of the coffee shop.<br/><br/>Charles exited the car, opened the door for Uncle Edwards, and they then made their way toward the coffee shop together.<br/><br/>Just as they had arrived at the entrance of the coffee shop, an electric vehicle came hurtling toward them.<br/><br/>The vehicle was too fast and too close – it didn’t leave either of them any time to react.<br/><br/>The guards of the Clark Family, who had confirmed the safety of the surroundings before they got out of the car, weren’t close enough for a timely response.<br/><br/>No one had expected the danger to come from an electric vehicle.<br/><br/>Uncle Edwards, noticing the vehicle, instinctively hugged Charles and darted sideways. But, in his haste, he dodged in the wrong direction, placing them in the path of the vehicle.<br/><br/>The suddenness of it all terrified the bystanders; those who were closer intended to help, while the ones further off screamed in panic.<br/><br/>“Grandpa Edwards!” Charles yelled in distress.<br/><br/>The child driving the electric vehicle, gripped the handles tightly in fear, increasing the speed of the vehicle with his crying.<br/><br/>Uncle Edwards shielded Charles, thinking to himself: We’re done for. If we fall and get crushed, we’d be bedridden for at least a month.<br/><br/>But the expected collision didn’t occur.<br/><br/>The electric vehicle was stopped. The child on the vehicle was hoisted up, and Uncle Edwards was steadied.<br/><br/>Uncle Edwards regained his footing, neglecting everything else, he first checked on Charles.<br/><br/>“Grandpa Edwards! Are you hurt anywhere?” a worried Charles asked urgently.<br/><br/>“I’m alright. I’m okay,” Edwards answered, relieved that Charles was unharmed. He glanced at the electric vehicle lying at his feet, then turned to the man who was holding the child, “Thank you, sir.”<br/><br/>The man was wearing a duckbill cap. His head bowed low, only his chin and thin lips were visible. On hearing Edwards, he shook his head gently, then turned a little to comfort the child in his arms.<br/><br/>Charles, held by Uncle Edwards, watched the man intently.<br/><br/>“Sir, I am deeply grateful for your actions today,” Uncle Edwards continued his gratitude.<br/><br/>Without speaking, the man kept shaking his head.<br/><br/>It wasn’t until the mother of the child came running over that Uncle Edwards ceased his thanks.<br/><br/>The woman witnessed the entire incident and was desperately rushing towards them. She had left the electric vehicle unattended while she was talking to someone and the child had gone back inside the vehicle.<br/><br/>Upon noticing the child had wandered off, she immediately gave chase. But, the accident still happened.<br/><br/>She took the child from the man, apologized profusely, and seeing the large number of bodyguards at the scene, she got all the more anxious.<br/><br/>Setting Charles down, Uncle Edwards didn’t say much, only advising, “Be more careful next time. With the child being so small, getting hurt would cause pain for the child and also heartache for the parents.”<br/><br/>Though there were many onlookers, the Clark Family bodyguards managed to clear the crowd.<br/><br/>The woman, holding her crying child, kept apologizing.<br/><br/>“What?!’”<br/><br/>“I can’t say.”<br/><br/>Charles Amos narrowed his eyes, “Liar. You’re making excuses!”<br/><br/>Jack Amos squinted back at him, “Is this how you talk to me?”<br/><br/>Charles Amos lost a bit of his bluster.<br/><br/>“You little brat,” Jack Amos replied.<br/><br/>Charles Amos stared at him, considered his words, and chose not to refute them.<br/><br/>Seeing that he had quieted down, Jack Amos turned to Wilton Edwards, “Don’t tell Enigma Starry... or I guess now you should call her Daisy. Don’t tell her yet.”<br/><br/>“Why not? The young lady would be overjoyed to hear that you’re alive” Wilton Edwards said.<br/><br/>“I still have a few things to handle,” Jack Amos explained, “She has a lot on her plate. Let’s not give her more to worry about. When the time comes, I’ll see her.”<br/><br/>Wilton Edwards felt that Jack Amos was trying to hint at something.<br/><br/>It was as if he didn’t know if he would survive, so he didn’t want to let her know and cause her to grieve again.<br/><br/>“Uncle Wilton, we all want her to be happy, right?” Jack Amos continued.<br/><br/>Wilton Edwards looked at him for a moment, and after a while, he nodded, “Fair enough. You should see her when the time comes.”<br/><br/>“Alright.” Having resolved one issue, Jack Amos turned to the other. “You are not allowed to say anything either.”<br/><br/>“Why not?” Charles Amos asked, a touch of arrogance in his tone.<br/><br/>Jack Amos looked at him. This little troublemaker was as difficult to deal with as a certain person had been when they were a child.<br/><br/>“Don’t you want mom to be happy?”<br/><br/>Charles didn’t say anything, tacitly conceding the point.<br/><br/>“If you want mom to be happy, then you won’t say anything.”<br/><br/>“Why not?” Charles asked again.<br/><br/>Jack Amos:<br/><br/>Jack Amos: “Never you mind what adults have to do.”<br/><br/>“Oh, okay then.” Charles agreed.<br/><br/>“Just make sure you do as you say,” Jack Amos warned.<br/><br/>“Mmhm,” Charles replied softly.<br/><br/>“Good,” Jack Amos said, “Go tell the waiter what you’d like to drink.”<br/><br/>“Are you treating?” Charles asked.<br/><br/>“Mmhm. I’ll treat.”<br/><br/>Charles immediately went to order something. He stood at the ordering desk and pointed out what he wanted to eat and drink.<br/><br/>Then he turned to look at Jack Amos, who was still talking to Uncle Wilton.<br/><br/>Various memories suddenly resurfaced in his mind.<br/><br/>Like how a certain cell phone back at home would regularly receive updates on his whereabouts.<br/><br/>Considering the content of the texts on the phone, Charles accessed the chat box of Charlotte Lane with a few taps.<br/><br/>Charlotte Lane had just finished an experiment with Kevin Clark when she received the message.<br/><br/>Her phone was flooded with messages due to something that happened online,<br/><br/>but Charles’ message stood out right away.<br/><br/>Charles sent her a location.<br/><br/>Followed by two characters: [Come immediately.]\t\t\t\t\t\t</div>", "images": {}, "success": true}