{"id": 514, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14908977.html", "title": "Chapter 511: 454: We Will Encounter This Frequently In The Future.", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 511: 454: We Will Encounter This Frequently In The Future.</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 511: Chapter 454: We will encounter this frequently in the future.<br/><br/>Sometime during the night, the sky had changed outside the window. Accompanied by a rumbling sound, a flash of lightning lit up the darkness, reflecting light into the room.<br/><br/>Stella Edwards leaned against the table, her fingers tightly gripping the edge, constantly applying force.<br/><br/>Her eyes were fixed on a spot, her chest heaving, as if she could only breathe with heavy gasps.<br/><br/>Alice Eugene saw her like this, a momentary viciousness in her eyes as if she had made a decision after some hesitation and struggle, “As long as Daisy Zane is alive, Henry Kirsten’s heart will never have room for anyone else.”<br/><br/>Stella Edwards looked up at her.<br/><br/>“Do you want to be someone’s substitute forever?” Alice continued, “Women should always fight for the things they like, especially for an outstanding man.”<br/><br/>Stella Edwards just looked at her.<br/><br/>“If I were you. I would replace that person.” Alice looked into her eyes, “Turn from a substitute into the only one.”<br/><br/>“Why are you telling me all this?” Stella Edwards asked, looking at her.<br/><br/>“Because, compared to Daisy Zane, I’d rather the person by Henry’s side be you.” Alice continued, “Besides, Daisy is already married. She’s not worthy of Henry. But Henry can’t forget her, so only if she dies, everything can be resolved.”<br/><br/>Stella Edwards stared at her for a while, then slowly lowered her gaze.<br/><br/>“If she’s alive, you’ll be a substitute for a lifetime,” Alice continued, “Only if she dies, will Henry’s eyes truly see you.”<br/><br/>Stella Edwards did not answer, her gaze downcast.<br/><br/>Alice glanced at her for a moment, fearing that saying too much would be counterproductive, and didn’t say anything more before leaving her room.<br/><br/>The room’s door opened and closed. Flash after flash of lightning outside the window, and the sound of thunder grew louder and louder.<br/><br/>Stella Edwards stood by the table for a while longer before her legs suddenly gave way, and she collapsed on the ground, covering her mouth as she started to cry.<br/><br/>It was the first time she had felt moved, the first time she had liked a man.<br/><br/>But this man only saw her as a replacement.<br/><br/>Stella Edwards did not sleep that night, and when she went out for breakfast the next morning, she deliberately wore heavy makeup to hide the fatigue on her face.<br/><br/>When she arrived at the restaurant, Henry Kirsten was already there.<br/><br/>Seeing her, he said to her, “Today’s makeup is a bit different.”<br/><br/>Stella Edwards forced a smile, “Yes, I didn’t sleep well. My complexion is a bit off.”<br/><br/>“Are you feeling upset?” When Henry noticed her earlier, he sensed that her mood was very low, as if something was on her mind.<br/><br/>Alice glanced at Stella Edwards.<br/><br/>Without looking at Alice, Stella Edwards answered Henry, “I had a fight with someone online last night.”<br/><br/>Henry chuckled, “How did you even get into a fight with someone online?”<br/><br/>Charlotte Lane was the first to notice Stella Edwards. She noticed someone was looking at them, so she looked back.<br/><br/>They were separated by a short distance, and their gazes met. Charlotte Lane felt the hostility from Stella Edwards.<br/><br/>Stella Edwards’ eyes flickered and dodged the moment Charlotte looked over.<br/><br/>Seeing that Charlotte Lane hadn’t moved, Old Master Lane followed her gaze.<br/><br/>Seeing Old Master Lane also looking at her, Stella Edwards immediately smiled and walked over: “Grandfather Lane, you’re back?”<br/><br/>Old Master Lane also smiled: “Yes, I’ve been back for a while. Are you here to see your teacher?”<br/><br/>“Yes.” Stella Edwards glanced at Charlotte Lane, “I just came back from Brother Roy’s place.”<br/><br/>“Go ahead,” Old Master Lane said, “Your teacher and the others are inside.”<br/><br/>“Alright.”<br/><br/>After Stella Edwards left, Charlotte Lane and Old Master Lane continued planting flowers.<br/><br/>By the time they finished planting flowers in the garden and went inside, Sophie Ortiz had been chatting with Stella Edwards for quite some time.<br/><br/>As soon as Sophie Ortiz saw Charlotte Lane, she said, “I believe you two should know each other.”<br/><br/>Sophie Ortiz had only communicated with Edward Monk about Stella Edwards’ movie and didn’t know much about Flynn Ninevara.<br/><br/>It was only later when she learned about Charlotte Lane, did she find out that Charlotte Lane was the screenwriter for Stella Edwards’ movie.<br/><br/>Charlotte Lane nodded her head.<br/><br/>Stella Edwards hadn’t had time to ask why “Daisy Zane” was here, so she politely said, “Brook God.”<br/><br/>Charlotte Lane looked at her: “Hello.”<br/><br/>Stella Edwards smiled, but there was always some awkwardness and reluctance in her smile: “Hello. I didn’t expect to see Brook God here.”<br/><br/>Sophie Ortiz smiled and said, “You’ll see her more often in the future.”<br/><br/>Stella Edwards looked confusedly at Sophie Ortiz.<br/><br/>Sophie Ortiz smiled and said, “I’ll tell you later.”<br/><br/>Then she turned to Charlotte Lane and said, “Lila, go upstairs and call Amelie. It’s past ten o’clock, and she still hasn’t gotten up. We’ve called her twice, and she hasn’t come out. If she sleeps any longer, her head will be flattened.”<br/><br/>Charlotte Lane raised an eyebrow, “Alright. I’ll go and check on her head.”<br/><br/>Charlotte Lane went upstairs to call Amelie Quentin.<br/><br/>Stella Edwards sat on the sofa with a baffled look on her face: “Lila?”<br/><br/>“Yes, Lila.” Sophie Ortiz tucked Stella Edwards’ stray hair behind her ear and treated her like family, saying, “She is Lila, your junior sister.”\t\t\t\t\t\t</div>", "images": {}, "success": true}