{"id": 516, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14908983.html", "title": "Chapter 513: 456: Taking The Order Myself", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 513: 456: Taking The Order Myself</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 513: Chapter 456: Taking the Order Myself<br/><br/>The Lanes really liked Charles Amos. Charles was also willing to spend time to accompany those who were nice to him.<br/><br/>After dinner, everyone was chatting in the living room.<br/><br/>Almost all the topics were about Charles Amos.<br/><br/>His tone, speed, and pitch were very similar to Charlotte Lane’s, except for his slightly childish voice due to his young age.<br/><br/>Old Master Lane and the others always felt that Charles was like a mini version of Charlotte.<br/><br/>Kevin Clark and Charlotte Lane were sitting together on a two-seater sofa, listening to their conversation.<br/><br/>From time to time, Charlotte would banter with Charles, but Charles would always lose the argument.<br/><br/>“Did you see the assassin’s order on the dark web?” Kevin whispered.<br/><br/>Charlotte nodded, “James Collins and Logan have told me. I heard it’s been hanging there for a week, and no one has taken it.”<br/><br/>Eighty percent of the killers who made it onto the dark web killer rankings were from the Hundred Demons Pavilion and Edward Darkmoon’s group.<br/><br/>Although the others didn’t know...<br/><br/>And to hire them, not only did you have to have money, but also a large organization behind you.<br/><br/>For example... the previous Platinum Burke Family didn’t qualify, but now they do. So they posted an assassin’s order on the dark web.<br/><br/>They were targeting “Daisy Zane.”<br/><br/>But... when everyone clicked in and found out it was Charlotte, they all silently withdrew.<br/><br/>The news from Yoshua Archer and Edward Darkmoon was directly reported to Kevin Clark.<br/><br/>James Collins and Logan directly reported to Charlotte Lane.<br/><br/>Then Holt Lawrence entered the dark web and locked the order-taking permissions.<br/><br/>To prevent the remaining twenty percent from taking the order.<br/><br/>Charlotte glanced at the messages on her cell phone and said, “Your Third Uncle, is Edward Darkmoon not doing well?”<br/><br/>“Tsk,” Kevin clicked his tongue lightly, “There’s no Third Uncle here.”<br/><br/>Charlotte laughed.<br/><br/>Kevin raised his hand to pinch her face, and noticing the side glances, he looked up to meet Andrew Lane’s gaze.<br/><br/>From Andrew’s fleeting glance, Kevin sensed his murderous intent to chop off his hand.<br/><br/>Kevin remained calm and slowly withdrew his hand, sighing silently in his heart.<br/><br/>He was beginning to regret why he had ruined his reputation so badly back then.<br/><br/>Why had he made himself look like nothing more than a dissipated son in the eyes of others?<br/><br/>Anisa Cooper was also there.<br/><br/>It had been a long time since Anisa had seen Charlotte, so she came over to talk to her about the endorsement from Spotlight ?&gt;”&gt;<br/><br/>Anisa was the first to see the hot search.<br/><br/>She told Charlotte and Kevin about it.<br/><br/>Then she saw the atmosphere between them becoming stranger and stranger.<br/><br/>It was probably because Charlotte was acting carefree and unconcerned, while Kevin appeared extremely guilty.<br/><br/>“Not serious about research, not respecting research, bad research attitude...” Charlotte recited the comments from the hot search in a soft voice, “How can someone like this do research? Who would dare to use the things she researched with this attitude? Isn’t this playing with people’s lives? The state’s investments are not for her to do research while playing...”<br/><br/>With every comment she read, Kevin’s eyelids twitched.<br/><br/>“Third Master, don’t you think the people online are quite right in what they say?” Charlotte asked softly.<br/><br/>Kevin’s brow twitched, and in a deep voice, he said, “They’re talking nonsense.”<br/><br/>“How can you say that about yourself?” Charlotte muttered nonchalantly.<br/><br/>Anisa stiffened her neck, swinging her gaze back and forth between the two.<br/><br/>She replayed the conversation in her head, and then, like a flash of light, it dawned on her.<br/><br/>Third Master Clark was her Daisy’s secret hater!<br/><br/>Anisa’s gaze towards Kevin instantly became alert.<br/><br/>Kevin kept a straight face, his expression screaming that he wished he could stab himself. He glanced at Anisa.<br/><br/>Anisa immediately lowered her head pretending to look at the files in her hand. She looked at them for a while before realizing that there were only three words and a period on the page she had opened.<br/><br/>“Scaring my assistant.” Charlotte commented softly.<br/><br/>Anisa felt protected once again and raised her head.<br/><br/>Kevin looked at Charlotte, his eyes pleading and weak.<br/><br/>Charlotte and he stared at each other for a while...<br/><br/>Alright, her lust had clouded her judgment. This account... could be delayed.<br/><br/>“Daisy.” Anisa looked at her phone and suddenly said in disbelief, “Sister Emily... is cursing people on Facebook.”<br/><br/>Charlotte raised an eyebrow.<br/><br/>The always smooth-talking Hill Dawson was actually cursing people online.<br/><br/>Less than a minute after Anisa finished speaking, the chat group belonging to the three of them buzzed.<br/><br/>Hill Dawson: [I never knew cursing people was so fun.]\t\t\t\t\t\t</div>", "images": {}, "success": true}