{"id": 511, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14883732.html", "title": "Chapter 508: 451", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 508: 451</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 508: Chapter 451<br/><br/>As soon as the two recordings were released, the online wind direction changed dramatically.<br/><br/>Even for the first few minutes... it seemed as if the entire internet went silent for a few minutes.<br/><br/>After that, they all swarmed under the official Weibo of the Miles Group. And because too many people rushed in at once, many could not get in.<br/><br/>Even worse, some got stuck halfway while writing.<br/><br/>After that, everyone went to Daisy Zane’s Facebook to apologize.<br/><br/>The matter of the Miles Family slandering Claudia Zane’s infidelity before her death and even killing her was nailed to the board.<br/><br/>The recordings released by the police in the morning have drowned the official Weibo of the Miles Group in curses.<br/><br/>Meanwhile, all those haters had been silent for half a day.<br/><br/>However, in the afternoon... after being silent for half a day, the haters started to take action.<br/><br/>They had nothing to say about Claudia Zane’s case, but they kept repeating Daisy Zane’s diva behavior, her reliance on power to have the drama crew stop work, and her infidelity.<br/><br/>It seemed as if they must pin a crime on Daisy Zane and bring her down in disgrace.<br/><br/>Charlotte Lane checked online news in the morning, had Hill Dawson post a status on her Facebook, and then continued with her experiments.<br/><br/>It wasn’t until Holt Lawrence sent her a message in the afternoon that she checked the news again.<br/><br/>Holt Lawrence: [The news about you having an affair and being a diva are all released by the Miles Family. Now all those who are attacking you are your haters. According to my investigation, there is a huge organization behind your haters. The organizer is Jessica Maxwell.]<br/><br/>Charlotte Lane: [So that’s how the memes on your phone came about? What role did you play in this organization?]<br/><br/>Holt Lawrence: [I’ve infiltrated the enemy’s ranks to gather intel.]<br/><br/>Charlotte Lane ignored him.<br/><br/>She left the laboratory and called Ezekiel Santiago: “Dean, I think today is a good day, what do you think?”<br/><br/>Ezekiel Santiago hesitated for a moment and said, “Is today really a good day? Do you really think so? Should we pick another day? Or find someone to calculate a good day?”<br/><br/>Charlotte Lane said, “There are a lot of people cursing me online, and I need the Research Institute to help me clarify.”<br/><br/>Ezekiel Santiago hesitated again, “Well, then...wait until you guys come back home. Arthur North is at the Research Institute. It’s too convenient to come to my office. You can help me block him when you are at home.”<br/><br/>“Alright.”<br/><br/>...<br/><br/>Harton Clark and Charlotte Lane got off work in the afternoon on time.<br/><br/>It started with Logan and Damian Brown chatting, then Holt Lawrence joined in.<br/><br/>“Nana, you’re here too.”<br/><br/>“Yeah, I’m worried that you guys might badmouth me, so I’m listening.” Charlotte Lane said.<br/><br/>Damian Brown said, “How is that possible? How dare we speak badly of the big boss?”<br/><br/>Logan said, “Exactly, big boss. We don’t even have enough time to like you.”<br/><br/>“You’ve said it more than once, not to mention the ones I didn’t discover.” Charlotte Lane looked at her computer data and said, “Do you want me to show you your transfer records?”<br/><br/>Because they were discovered once, they would transfer an account to Charlotte Lane.<br/><br/>Damian Brown and Logan suddenly went silent.<br/><br/>Holt Lawrence laughed and said, “Nana, Amelia Miles has left the M Continent for the Mountain Sea Continent.”<br/><br/>Charlotte Lane raised an eyebrow.<br/><br/>“Not only her but also Liam Davis,” said Holt Lawrence. “They are backed by the Platinum Burke Family.”<br/><br/>“The Platinum Burke Family?” Damian Brown asked. “After the Thousand Mountains Alliance was eradicated, the Platinum Burke Family has grown rapidly in the Mountain Sea Continent. Even more recently, they’re getting cocky. Luke and Dark Radiance over there are both keeping an eye on them.”<br/><br/>“That’s right,” Holt Lawrence said. “The internal affairs of the Platinum Burke Family have always been chaotic. However, after Liam Davis seized power from the M Continent, the power of the M Continent and the Mountain Sea Continent has become more united, making it grow rapidly.”<br/><br/>“Liam Davis took power?” Charlotte Lane asked inquisitively.<br/><br/>“Yes,” Holt Lawrence said. “Unexpected, isn’t it? Since the establishment of the Platinum Burke Family, there have always been two housemasters in the M Continent and the Mountain Sea Continent. The two sides have equal power, checking and restraining each other. The daughter of the housemaster from the M Continent side took a fancy to Liam Davis. Liam Davis pretended to accommodate her but killed his girlfriend and future father-in-law to seize power. Of course, with the help of this side of the Mountain Sea Continent.”<br/><br/>“So ruthless?” Logan sneered. “Such a scumbag. I’ll go back to the Mountain Sea Continent tonight and take care of him.”<br/><br/>“Amelia Miles and Liam Davis have always been in touch. Because Amelia Miles is in the Dance Association, she has the possibility of marrying into the Lane Family. In that way, the Platinum Burke Family can extend their reach to the Imperial Capital,” Holt Lawrence said. “There’s also another reason...they all want to kill Nana.”<br/><br/>Charlotte Lane opened a new file on her computer and said, “Logan, I don’t need you for this.”<br/><br/>Logan asked, “Are you going to handle it personally?”<br/><br/>“Yes.”<br/><br/>“Hey? Nana,” Holt Lawrence suddenly said. “The research institute has made your support for Continent A public.”<br/><br/>Charlotte Lane’s fingers paused: “When did that happen?”<br/><br/>“Almost ten minutes ago,” Holt Lawrence said.<br/><br/>Charlotte Lane immediately closed the computer and walked towards the study room.<br/><br/>As she walked and thought, ten minutes... Harton Clark was busy, he probably hadn’t seen it yet.\t\t\t\t\t\t</div>", "images": {}, "success": true}