{"id": 519, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14908992.html", "title": "Chapter 516: 459", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 516: 459</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 516: Chapter 459<br/><br/>Finn Clark was completely questioned into submission by the two of them.<br/><br/>Moreover, it was too difficult for him to deceive these two people.<br/><br/>So he compromised and said, “It’s a pity that you two don’t interrogate criminals.”-<br/><br/>“You flatter us,” replied Kevin Clark.<br/><br/>Finn Clark sighed and said, “I did wake up in M Continent Laboratory. After waking up, I had no memory and looked like Jack Amos. They told me that my name was Jack Amos, a researcher at the laboratory, but because of a serious injury and memory loss, I could not continue my research.”<br/><br/>“So they let you live as Jack Amos,” Kevin Clark said.<br/><br/>“Yes,” Finn Clark replied, “Later, I also verified that Jack Amos was indeed a researcher at M Continent Laboratory, and all the height and blood type matched. However, he was injured in an attack. The researchers who were attacked along with him all died. In fact, Jack Amos also died, but I took his place.”<br/><br/>“How did you end up in Continent A?” Charlotte Lane asked.<br/><br/>“Because I couldn’t do experiments, but I had to do something for the laboratory. So I was assigned to get close to Edward Kirsten as an undercover agent,” Finn Clark paused before continuing, “The first thing I did was to approach Harris Kirsten, and then I got close to Edward Kirsten.”<br/><br/>It was true that they used Harris Kirsten, and it was also true that they really liked Harris Kirsten.<br/><br/>Finn Clark looked down at his hands, his thumb rubbing along the side of his index finger. He was silent for a while before continuing, “It seems that the M Continent Laboratory knows something about Edward Kirsten’s research. They’ve been wanting to obtain it, but Edward Kirsten is too cautious. After so many years, I haven’t even found out where their laboratory is.”<br/><br/>This time, Kevin Clark and Charlotte Lane were silent for a moment.<br/><br/>Kevin Clark then said, “The M Continent Laboratory can’t research anything on their own, so they just steal from everywhere.”<br/><br/>Charlotte Lane added, “They’re used to being robbers and thieves.”<br/><br/>Finn Clark nodded in agreement.<br/><br/>“So, after faking your death with Edward Kirsten, you returned to M Continent?” Kevin Clark asked Finn Clark.<br/><br/>“Over so many years, not only in Continent A, I have also cultivated my own people in the M Continent Laboratory. After coming out from Continent A, I was unconscious for a while,” Finn Clark explained casually, “After waking up, I suddenly remembered a lot of things. Then I contacted my people from the M Continent Laboratory to see what they really wanted to do.”<br/><br/>Kevin Clark looked at him for a while and asked, “So, you’ve regained your memories for many years?”<br/><br/>Finn Clark: “...You really know how to catch the key point.”<br/><br/>Kevin Clark chuckled, “I should have hit you harder that day.”<br/><br/>Charlotte Lane raised an eyebrow, not saying anything.<br/><br/>She had witnessed firsthand how severely “Jack Amos” had been injured. Even if he had regained his memories, it would have taken years to recover his physical strength.<br/><br/>Finn Clark smiled and said, “At first, I was just curious about what M Continent was looking for with Edward Kirsten. But as the investigation deepened, I found out that they had teamed up. What M Continent had always wanted was 319.”<br/><br/>Charlotte Lane paused for a moment before asking, “Have you... ever seen what Edward Kirsten looks like?”<br/><br/>Finn Clark hesitated, wondering why Charlotte Lane would ask such a question, “Haven’t you seen him?”<br/><br/>“I have, but I don’t remember it,” Charlotte Lane replied.<br/><br/>“Huh?” Finn Clark was still puzzled, but after a pause he asked cautiously, “Is it... because of me?”<br/><br/>Finn Clark felt that his “death” had been too traumatic for Charlotte Lane, causing some sort of psychological damage.<br/><br/>It’s just that Jack Amos happened to have a high similarity to him, so he became Jack Amos.<br/><br/>“Shouldn’t you be a bit more self-aware?” Charlotte Lane looked at Charles Amos and said, “Eating so much, do you want to spend the night on the toilet?”<br/><br/>Charles Amos had just put the half strawberry he was holding into his mouth and then picked up a new one.<br/><br/>Suddenly, as he looked into Charlotte’s eyes, he put the strawberry back and withdrew his guilty little hand.<br/><br/>Finn Clark lowered his gaze and looked at Charles Amos.<br/><br/>Charlotte Lane had poured all her efforts into Charles Amos.<br/><br/>She knew everything about him and tried her best to teach him.<br/><br/>Charles Amos was excellent.<br/><br/>Finn Clark looked at Charles Amos for a while, then turned to Charlotte Lane and said, “I’ve come clean, so...the people from the Lane family opposite the Doomsday Hotel should withdraw, right? My brother hasn’t been out for a long time.”<br/><br/>The brother who pretended to be a courier delivering package 319 (ii) to Doomsday Hotel.<br/><br/>After escaping into the shop on that street, he never came out again.<br/><br/>Because the people from the Lane family were guarding there all the time.<br/><br/>“No withdrawal.” Kevin Clark said decisively, “If I hadn’t asked, you wouldn’t have said anything. I see that your brother is not in a hurry to come out either.”<br/><br/>“You don’t have the final say.” Finn Clark said, “It’s not your home.”<br/><br/>Charlotte Lane and Finn Clark looked at each other for a while, then stood up and said, “It’s time to sleep.”<br/><br/>Kevin Clark immediately stood up: “Let’s go, we’ll go back to sleep.”<br/><br/>Kevin Clark and Charlotte Lane walked away hand in hand, leaving Finn Clark with their backs.<br/><br/>Finn Clark: “?????????”<br/><br/>Charles Amos looked at him and put on an experienced expression, saying earnestly: “You’ll get used to it eventually.”<br/><br/>...<br/><br/>In the summer evening, a breeze blew across the river, accompanied by the chirping of crickets in the grass, making it very comfortable and cozy.<br/><br/>Kevin Clark and Charlotte Lane were walking towards North Court. Both of them had been quiet for a while before Kevin Clark said, “Shall we go to the Mountain Sea Continent next week?”<br/><br/>Charlotte Lane thought about her ongoing experiment and said, “Yes.”<br/><br/>“Then I’ll talk to Dean Yue about it tomorrow,” Kevin Clark said, “We’ll treat it like a rest in the Mountain Sea Continent.”<br/><br/>Charlotte Lane raised the corner of her mouth: “I’ve already fallen to the point where I need to go to the Mountain Sea Continent for rest.”<br/><br/>Kevin Clark also smiled: “Will Roy Madison be discharged from the hospital in a couple of days?”<br/><br/>Charlotte Lane nodded: “Just in time, we’re going to the Mountain Sea Continent. My brother will take over the experiment at the research institute... Poor guy, he’ll have a lot of work right after being discharged from the hospital.”<br/><br/>“It is a bit miserable.”<br/><br/>...\t\t\t\t\t\t</div>", "images": {}, "success": true}