{"id": 512, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14908969.html", "title": "Chapter 509: 452: What Is The Meaning Of Taking This Step?", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 509: 452: What Is The Meaning Of Taking This Step?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 509: Chapter 452: What is the Meaning of Taking This Step?<br/><br/>The Pharmaceutical Formulation Institute has a high status and prestige in the domestic industry.<br/><br/>Not only because it is backed by several major domestic families and the support of the country, but also because the drugs originating from the Institute are cheaper than those from other manufacturers.<br/><br/>Moreover, the newly researched pharmaceutical formulations are priced as low as possible.<br/><br/>Although many drugs are still expensive for many families, the Institute has tried its best to reduce the price to the lowest level.<br/><br/>The reputation and prestige of the Institute are earned over many years.<br/><br/>So when the Institute spoke out, netizens suddenly didn’t know how to react.<br/><br/>Everyone knew about the situation in Continent A before the New Year.<br/><br/>At that time, someone posted photos of numerous floating corpses in Continent A online, which were seen by many people. However, the information was quickly removed from the internet due to timely control.<br/><br/>After that, the rising death toll in Continent A was also semi-public.<br/><br/>About the 319 issue, the domestic authorities had Ezekiel Santiago come out and explain its hazards at that time.<br/><br/>He warned everyone to be cautious in daily life and report to the relevant departments if they find any 319 incidents.<br/><br/>During that time, the domestic prevention measures were strict, and the hazards of 319 were heavily publicized, almost going from house to house.<br/><br/>Moreover, at the beginning, Continent A was not under control, so there was mass panic.<br/><br/>It was only when things were under control in Continent A that people were relieved.<br/><br/>However, both Continent A and the domestic authorities kept the identities of the researchers secret. They only revealed that the researcher who found a way to control 319 was from the domestic territory.<br/><br/>All other details were kept confidential.<br/><br/>This was to ensure their safety.<br/><br/>This time, the Institute only disclosed the name of Charlotte Lane, stating that “researchers who have made great contributions should not be insulted.”<br/><br/>To clarify why Daisy Zane’s drama crew stopped production.<br/><br/>The announcement issued by the Institute used Nicholson Amos’s name, but tagged Daisy Zane’s Facebook.<br/><br/>The content not only briefly described Nicholson Amos’s support for Continent A but also specifically stated that she was the most meritorious person in the support of Continent A because she researched the pharmaceutical formulation that could suppress 319.<br/><br/>Later, to avoid suspicion, they released Nicholson Amos’s certificate of admission to Imperial Capital University and her qualifications to be trained by the Research Institute.<br/><br/>During her two years of training at the Research Institute, she participated in some experimental projects, her recent assistance to Continent A, and her official entry into the Institute.<br/><br/>In addition, they mentioned some feasible methods proposed by Nicholson Amos, some new experimental methods, and their current contributions to research.<br/><br/>When the Institute’s announcement was released, netizens were dumbfounded for a while.<br/><br/>[Uh...does this mean that the Daisy Zane we’re fans of, the Daisy Zane who acted in a TV series, the Clayson Ninevara who wrote the script, the Flynn Ninevara who designed the spotlight, and the Daisy Zane who appeared on the variety show “Going to School”...are all the same person as the researcher from the Institute, Nicholson Amos? Did I understand it correctly? Is that what it means?]<br/><br/>[Sister, you probably didn’t misunderstand. The ID photos on Nicholson Amos’s admission to Imperial Capital University and entry into the Research Institute look exactly like Daisy Zane.]<br/><br/>[Has the Institute’s account been hacked? Or have I not woken up yet?]<br/><br/>[Oh my god, who have I become a fan of? Who exactly am I a fan of? To those who said we’re uneducated and never went to school, come out now! I can still take you on for a thousand more rounds.]<br/><br/>“He won’t come in person.” Kevin answered himself, “Edward Kirsten, a cautious man, has a ninety percent chance of not coming. That’s because this is not his territory, and because he knows that coming here would be walking into a trap.”<br/><br/>Charlotte pulled her hand out of his.<br/><br/>“Since Edward Kirsten won’t come, what’s the point of taking this step?” Kevin said, “He sends someone to the country, but they can’t take you away. If we capture the person he sends, it won’t be of much use.”<br/><br/>Kevin continued to watch Charlotte, who had lowered her gaze. After a while, he pinched her chin, making her look up at him.<br/><br/>His narrow eyes searched her, looking directly into Charlotte’s eyes, “Little Girl, tell me why you want to take this step.”<br/><br/>“I’m betting on that ten percent.” Charlotte looked at him, her eyes meeting his.<br/><br/>Her expression unchanged, she kept her emotions hidden and remained calm, just like usual.<br/><br/>“Is that so?” Kevin looked at her, “Are you really betting on that ten percent, or do you want to find Edward Kirsten?”<br/><br/>Charlotte didn’t move or speak.<br/><br/>“You’re in Imperial Capital. Indeed, nobody can take you away.” Kevin looked at her and said, “But what if you want to leave with them?”<br/><br/>“Kevin...”<br/><br/>“Little girl.” Kevin cut her off, “Do you remember what I said? If you dare to have any treasonous thoughts, I’ll lock you up. I...”<br/><br/>Charlotte looked at his frowning face, thinking he could barely control his temper. She suddenly grabbed his collar and pulled him down, kissing him on the lips.<br/><br/>As she pulled him down, Kevin reflexively cooperated with her, “You...”<br/><br/>Charlotte kissed him again.<br/><br/>Kevin’s aura shrank to less than half in an instant.<br/><br/>Seeing it worked, Charlotte raised her eyebrows slightly.<br/><br/>“I’m talking about serious matters.” Kevin’s tone was neither high nor low.<br/><br/>Charlotte raised the corner of her mouth because of his tone, “I didn’t think that way. Also, I’m not betting on ten percent. I’m betting on twenty percent. Third Master, I’m safe in Imperial Capital, aren’t I? Whether it’s ten percent or twenty percent, there’s hope, isn’t there?”<br/><br/>Kevin looked at her, trying to confirm whether her words were true or not.<br/><br/>“And even if I want to leave with him, it won’t be that easy, right? The Clark Family and Lane Family are blocking my way, it’s hard for me to get out.”<br/><br/>Kevin didn’t say anything, but he agreed tacitly.<br/><br/>“Third Master, you’re overthinking it.” Charlotte said.<br/><br/>Kevin was genuinely frightened when he saw her Facebook post. But with her attitude, it seemed like he was overthinking it. He leaned in slightly and kissed her lips, “Little girl, I’m not joking. Don’t even think about doing something like that, got it?”<br/><br/>“Mm.” Charlotte replied, and after a while, she leaned against the desk behind her, “Third Uncle, you seem to like locking me up.”<br/><br/>Kevin furrowed his brow lightly, “What?”<br/><br/>“Why don’t... you lock me up for a week?” Charlotte’s voice was still cold, “There’s nothing going on at the Research Institute recently. I can cooperate with you. What do you think, Third Uncle?”<br/><br/>Kevin’s face changed several times before he finally bit her lip, “Next time you make such a wild request, don’t call me Third Uncle.”<br/><br/>“Okay. Third Uncle.”<br/><br/>Kevin: “......”\t\t\t\t\t\t</div>", "images": {}, "success": true}