{"id": 513, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14908974.html", "title": "Chapter 510: 453: You Are Just A Substitute", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 510: 453: You Are Just A Substitute</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 510: Chapter 453: You Are Just a Substitute<br/><br/>In a courtyard on the M Continent.<br/><br/>Edward Kirsten sat by an outdoor tea table, just finished watching Chloe Davis dance under a peach tree.<br/><br/>This season, the peach blossoms have already bloomed and the peaches are ripe.<br/><br/>It may not be as beautiful as when the tree was full of blossoms.<br/><br/>But Edward Kirsten loved watching Chloe Davis dance under the peach tree.<br/><br/>He even bought this courtyard because of that tree.<br/><br/>Chloe Davis had been here for over three months. Edward Kirsten would stay here every time he came to the M Continent, and she would wait for him there.<br/><br/>She finished dancing and came over.<br/><br/>Edward handed her a handkerchief, “Are you tired?”<br/><br/>Chloe shook her head, took the handkerchief, and smiled, “Not tired.”<br/><br/>“Have you not been home lately?” Edward asked.<br/><br/>“Yes,” Chloe replied, “There’s nothing going on at the Dance Association. And I didn’t know when you would come, so I simply didn’t leave.”<br/><br/>Edward glanced at her and, seeing her blush, smiled gently, “Don’t worry. I only come when you are here.”<br/><br/>Chloe lowered her head and smiled, pressing her lips together.<br/><br/>“Mr. Kirsten,” Alice Eugene stood beside Edward and handed him a tablet, “There’s news.”<br/><br/>Edward took the tablet and saw the message from the Pharmaceutical Formulation Institute.<br/><br/>He suddenly narrowed his eyes.<br/><br/>Alice looked at Chloe who was standing beside her.<br/><br/>Chloe met her gaze, knowing that they had something to discuss, and said, “You guys talk, I’ll go wash my hands.”<br/><br/>Edward didn’t say anything or look up as he read the message on the tablet.<br/><br/>Chloe didn’t get a response from him, so she left on her own.<br/><br/>After she left, Alice said, “It’s Enigma.”<br/><br/>“Did we make sure not to hurt her last time in Continent A?” Edward asked.<br/><br/>“No,” Alice replied, “Only three people came back after the interception in Continent A. According to their reports, no researchers were injured.”<br/><br/>Edward felt a little relieved and, looking at the message from the Institute, said, “Enigma is trying to bait me out.”<br/><br/>Stella Edwards was puzzled for a moment but still answered her question, “Yes.”<br/><br/>“Henry Kirsten likes her very much too. Do you know why?” Alice Eugene said.<br/><br/>Stella Edwards looked at her.<br/><br/>“You don’t think Henry Kirsten watching her TV series, and learning about her-related news is because you like her and want to find a common topic with you, do you?” Alice Eugene sneered.<br/><br/>Stella Edwards knitted her brows but remained silent. She did indeed think so.<br/><br/>Although she didn’t know what Edward Kristens’ profession was, she knew they were in different fields.<br/><br/>They had almost no common topic except for dance.<br/><br/>Later, besides dance, Edward Kirsten occasionally mentioned Daisy Zane to her. But he didn’t make her feel uncomfortable.<br/><br/>So she’d always thought Edward Kirsten was learning about her preferences and looking for their common topics.<br/><br/>Seeing her like this, Alice Eugene snorted and said, “Daisy Zane was called Enigma Starry eleven years ago, and the name was given by Henry Kirsten. They lived together for four years, and Henry Kirsten spoiled her like a treasure.”<br/><br/>Stella Edwards looked at Alice Eugene, her expression suddenly becoming somewhat flustered. She then asked, “Why are you telling me these things?”<br/><br/>Alice Eugene opened her cell phone and played a video for her to watch.<br/><br/>It was a video of Enigma Starry dancing under the peach blossom tree.<br/><br/>Not only was there a dance performed by Enigma Starry, but also conversations between Edward Kirsten and Enigma Starry.<br/><br/>Enigma Starry called him Brother Yabez.<br/><br/>And Edward Kirsten’s tone was something Stella Edwards had never heard before; it was full of affection.<br/><br/>After the video was played, Alice Eugene put away her phone and said, “As a professional dancer, it’s not hard to see that your dance is very similar to hers, right?”<br/><br/>Stella Edwards suddenly staggered backward.<br/><br/>Alice Eugene continued, “And not just similar. The few places Henry Kirsten later taught you to change were all based on Enigma Starry’s habits.”<br/><br/>Stella Edwards looked up at Alice Eugene and suddenly growled, “What are you trying to say!”<br/><br/>“You very well know what I’m trying to say,” Alice Eugene said. “Henry Kirsten doesn’t like you at all. He only likes Enigma Starry, Daisy Zane. And you... are just a substitute.”<br/><br/>Stella Edwards looked at the person in front of her, feeling a pain like an explosion in her heart, which made it difficult for her to breathe. Her head also seemed to explode with something she hadn’t noticed before, and many details she hadn’t noticed before poured into her mind.<br/><br/>The more she didn’t want to think about these things, the more they surfaced in her head: “You’re talking nonsense, I don’t believe it. I don’t believe it.”<br/><br/>“You already believe it,” Alice Eugene said. “The reason Henry Kirsten went to see you was that he saw your dance on the Internet, so he took initiative to get to know you. Do you know why he likes to watch you dance under that peach tree? Because Enigma used to love dancing under the peach blossom tree.”<br/><br/>Stella Edwards shook her head and backed away, retreating to the table by the wall. She shook her head, not wanting to believe or listen.<br/><br/>“Do you think Henry Kirsten was happily watching you every time? He was just looking through you, at someone else,” Alice Eugene said.\t\t\t\t\t\t</div>", "images": {}, "success": true}