{"id": 518, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14908989.html", "title": "Chapter 515: 458: Singing In Unison", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 515: 458: Singing In Unison</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 515: Chapter 458: Singing in Unison<br/><br/>The biggest secret behind Easton Group has always been about the research content, not the founder.<br/><br/>The reason for hiding this secret was that Kevin Clark wanted to avoid trouble.<br/><br/>With Hugo Clark to inherit the Clark Family, it was good for Kevin to appear as a playboy in the eyes of others.<br/><br/>It could not only help him avoid a lot of trouble but also fend off romantic interests.<br/><br/>And as it seemed now, the effect was quite significant.<br/><br/>His father-in-law was very dissatisfied with him.<br/><br/>So he took the initiative to announce his identity as the chairman of Easton Group.<br/><br/>Hoping to tear down the labels of relying on the family and being a dissipated son.<br/><br/>As Kevin Clark exposed his identity, it caused another uproar online.<br/><br/>After ten minutes, Charlotte Lane went onto Catherine’s Facebook, liked her post, and then changed her profile picture to the photo of their marriage certificate.<br/><br/>Clark Manor<br/><br/>After having an early dinner, while everyone was chatting in the front hall, Kevin Clark revealed his identity using his cell phone.<br/><br/>Then... the whole family stared at him.<br/><br/>Not a single person spoke.<br/><br/>With a calm expression, Kevin Clark maintained eye contact under the pressure of his family.<br/><br/>Charlotte Lane and Charles Amos watched the scene amusedly.<br/><br/>This staring match lasted nearly three minutes, and Natalie Wayne continued to fiddle with her coaster.<br/><br/>Elina Clark took a sip of tea and said, “Reimburse me for the two intelligent housekeepers at home.”<br/><br/>“Dad, you won them fair and square,” Kevin Clark said, “it’s not appropriate for me to reimburse.”<br/><br/>Elina Clark stared at him, “Are you trying to scam your dad out of money?”<br/><br/>“I’m helping you invest in the intelligent technology industry,” Kevin Clark said calmly.<br/><br/>“Oh—” Elina Clark nodded, “Where’s the return on my investment?”<br/><br/>“It’s in your son’s hands.”<br/><br/>Elina Clark glared at his rebellious child and cursed, “You’ve got no shame.”<br/><br/>Kevin Clark laughed.<br/><br/>After chatting with Mr. &amp; Mrs. Clark for a while, they went for a walk in the courtyard together.<br/><br/>Only Finn Clark, Charles Amos, Kevin Clark, and Charlotte Lane were left in the front hall.<br/><br/>At that moment, Charlotte Lane went to Facebook, liked a post, and changed her profile picture.<br/><br/>“So you must know that I went easy on you that day,” Kevin Clark’s resentment quickly dissipated.<br/><br/>Charles Amos finished the remaining half of his strawberry, lowered his gaze, and picked up a new one.<br/><br/>Arthur North managed to squeeze out a smile.<br/><br/>Kevin Clark held Charlotte Lane’s hand, slowly pinching it, and after a while asked, “So... wouldn’t it be right to tell us what happened back then?”<br/><br/>Arthur North’s eyes flickered slightly, and after being silent for a while, he leaned back and said, “Indeed, I was shot during the mission at the border and fell down the snow mountain. The snow was heavy that day, and by the time I lost consciousness, my body was already half buried. I really thought I was going to die there.”<br/><br/>Charles Amos took another strawberry, watching Arthur North as he ate.<br/><br/>“But... I’m not sure what happened, but when I woke up, I had no memory,” Arthur North said, “When I woke up, I looked like Jack Amos.”<br/><br/>Kevin Clark narrowed his eyes slightly: “Where did you wake up?”<br/><br/>Arthur North hesitated for a moment, obviously not wanting to say, even intending to dodge the question.<br/><br/>But Charlotte Lane didn’t give him a chance, saying bluntly: “The M Continent Laboratory, right?”<br/><br/>Arthur North’s eyelashes flickered, and he continued to watch the couple in silence.<br/><br/>Charlotte Lane said slowly: “Honesty will make things easier.”<br/><br/>Kevin Clark immediately followed up: “Resistance will make things tougher.”<br/><br/>Arthur North: “... You two... really pushed the limits.”<br/><br/>“You can’t swear,” Charles Amos suddenly said.<br/><br/>Arthur North glanced at him: “Children shouldn’t interrupt when adults are talking.”<br/><br/>Charles Amos pouted and continued eating strawberries.<br/><br/>Kevin Clark raised his eyebrows.<br/><br/>Charlotte Lane glanced at Charles Amos and said, “At Continent A, when we were attacked, you sent us the note, right?”<br/><br/>Arthur North didn’t want to talk.<br/><br/>Not giving him a chance to think, Kevin Clark immediately followed up Charlotte Lane’s words: “Don’t deny it. Knowing Edward Kirsten and trusting both Little Girl and me. Among the people we both know who fit these criteria, there’s only you.”<br/><br/>At that time, they didn’t know that Jack Amos was still alive, so they couldn’t find this person.<br/><br/>But from the moment they knew Jack Amos was alive, Kevin Clark and Charlotte Lane immediately thought of him.<br/><br/>“At Doomsday Hotel, room 319 (ii) was also sent by you, right?” Charlotte Lane continued.<br/><br/>Arthur North: “......”<br/><br/>Kevin Clark took a sip of tea: “Honesty will make things easier.”<br/><br/>Charlotte Lane cooperated: “Resistance will make things tougher.”<br/><br/>Arthur North: “......” Is this perfect harmony a match made in hell?\t\t\t\t\t\t</div>", "images": {}, "success": true}