{"id": 517, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14908986.html", "title": "Chapter 514: 457: Easton Group’S Chairman", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 514: 457: Easton Group’S Chairman</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 514: Chapter 457: Easton Group’s Chairman<br/><br/>Hill Dawson’s Personal Studio: [First of all, @DaisyZane, the two TV series, one movie and one variety show were all filmed before officially entering the Research Institute. During the filming process, none of the experimental projects involved had any problems and were all completed on time. ]<br/><br/>[Secondly, all the income Daisy Zane earned was from her own hard work, and she deserved it. No matter how powerful or wealthy she is, she has the right to pursue her hobbies and no one has the right to deprive her of that. Who says that people with power and money can’t be actors, can’t film? If you don’t have the ability to multitask, then don’t nag about it. ]<br/><br/>[Lastly, Daisy Zane didn’t take a cent from the income of her two TV series, one movie, and one variety show – she donated it all. Below are the details of all her income and donations, as well as how each donation was spent. Every penny has a detailed record and proof. Not only can you verify it online, but also go to the local areas to check if the funds have been implemented. ]<br/><br/>[Some people are just too idle, always sticking their nose into other people’s business. Just because you can’t do it, doesn’t mean others can’t. Don’t always try to understand others with your tiny-minded perspective. All you know is how to nag online, but in real life, you don’t dare to make a sound. This online world is your fig leaf, your protection shell for being a coward. ]<br/><br/>After posting on Facebook, Hill Dawson also commented under her own post.<br/><br/>[If you have the guts, come to my studio and scold me. I’ll take care of you all in one sweep. ]<br/><br/>Anisa Cooper stared at the post for a long time, unable to come back to her senses.<br/><br/>For a moment, she even thought her Daisy might have some magic that could seize control,<br/><br/>just now that post was sent by her Daisy through Hill Dawson’s hand, and then she instantly came back.<br/><br/>“You seem pretty idle today.” Charlotte Lane said.<br/><br/>Although Hill Dawson had established her personal studio and was still under Maple Elite, she had gained much more power and freedom.<br/><br/>Anisa Cooper now also started to take care of many things in the studio, so she was much busier than when she was Charlotte Lane’s assistant.<br/><br/>Today, she was actually quite free, but looking at her closely, she seemed a bit listless.<br/><br/>Hearing her voice, Anisa Cooper came back to reality, and when mentioning this matter, she became even more listless: “Ah, today is Brother Miller’s birthday and I asked for leave.”<br/><br/>“And then?” Charlotte Lane asked softly.<br/><br/>“Then... I got stood up.” Anisa Cooper deflated like a balloon, “Brother Miller worked overtime for a week to make this day available to be with me, and just when we finally had time today, he got an early morning call and had to leave. He won’t be back, not even by tomorrow.”<br/><br/>Anisa Cooper said weakly, and then angrily added: “The Easton Group ‘s chairman is definitely a cold-blooded creature. A vampire with no humanity! He doesn’t even let people celebrate their birthday! It’s too much!”<br/><br/>Charlotte Lane raised her eyebrows and glanced at Kevin Clark.<br/><br/>Kevin Clark had no expression, listening to Anisa Cooper’s evaluation with a peace of mind.<br/><br/>“Daisy, my love life is even worse than long-distance relationships.” Anisa Cooper said with a sigh, “At least long-distance couples can make phone calls and text messages. If I send a message, by the time I get a reply, I would need to scroll back up to see what I said to him.”<br/><br/>Charlotte Lane looked at this pitiful girl.<br/><br/>Anisa Cooper continued: “My contract is about to expire. After renewing it, there won’t be any requirements for me to get married or have children. But with this situation... I won’t have any children in the next three years.”<br/><br/>Charlotte Lane said, “Go ahead. Let Sister Emily give you one more day off.”<br/><br/>“Thank you, Daisy! Thank you, Third Master!” Anisa Cooper immediately ran off, still floating when she left the Rose Garden.<br/><br/>Who on earth had she met?!<br/><br/>That was the Easton Group!<br/><br/>Wait a minute! Did she discover some big secret? The people behind the Easton Group were supposed to be confidential, right?<br/><br/>So when she found out... would she be silenced?<br/><br/>Maybe she knew too much.<br/><br/>However, Anisa Cooper’s concern didn’t last long.<br/><br/>Because that evening, during her candlelight dinner date with John Collins... she caught a glimpse of a message on her Facebook feed on her cell phone.<br/><br/>Out of work habit, she instinctively clicked on it to take a look.<br/><br/>A Weibo (Facebook) account registered two years ago.<br/><br/>Username: Kevin Clark.<br/><br/>Facebook Certification: Chairman of the Easton Group.<br/><br/>As for the avatar... it was a photo of Kevin Clark and Charlotte Lane from their marriage certificate.<br/><br/>Red background and white clothes, both of them were dressed in casual white shirts.<br/><br/>Both of them had their usual expressions, neither of them were smiling.<br/><br/>But one could see the happiness in the calm depths of their eyes.<br/><br/>One demon and one pure, both were extraordinary beauties. Despite their contrasting temperaments, they were a perfect match.<br/><br/>Anisa Cooper subconsciously flipped through Kevin Clark’s Facebook posts. There were not many, but every one of them was about “Daisy Zane.”<br/><br/>And the latest post was published just three minutes ago.<br/><br/>[My wife @Flynn Ninevara and I have always had a good relationship. We had a good relationship in the past, we have a good one now, and we will continue to have a good one in the future. To those who covet my wife’s excellence and beauty, don’t try to ruin my relationship with my wife. First of all, you’re not better looking than me. Secondly, you’re not as outstanding as me. Don’t have any unrealistic ideas; you’re not worthy of my wife. Lastly, to those who spread rumors, expect a court summons tomorrow.]<br/><br/>...\t\t\t\t\t\t</div>", "images": {}, "success": true}