{"id": 515, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14908980.html", "title": "Chapter 512: 455: Substitute From Beginning To End.", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 512: 455: Substitute From Beginning To End.</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 512: Chapter 455: Substitute from Beginning to End.<br/><br/>Daisy Zane is Charlotte Lane.<br/><br/>When Stella Edwards heard this news, she felt as if she had been struck by lightning.<br/><br/>She didn’t know how she managed to finish her meal at the Lane’s, nor how she left their house.<br/><br/>From the moment she heard this news, she had been in a daze, far from her usual self.<br/><br/>Sophie Ortiz noticed something was off with her, and originally wanted her to stay at the Lane’s.<br/><br/>But Stella insisted on leaving, so Sophie had the driver take her back to where she was staying.<br/><br/>As soon as she returned to her apartment, she sat right there in the entryway.<br/><br/>Daisy Zane is Charlotte Lane.<br/><br/>Daisy Zane is Enigma Starry.<br/><br/>So... that’s why their dances had similarities. That’s why, after Edward Kirsten suggested she make some changes to her dance, Sophie Ortiz also came to love it.<br/><br/>So... out of the many people in the Dance Association, Sophie Ortiz only accepted her as a disciple.<br/><br/>Because she was the only one who danced like Charlotte Lane did as a child, out of the many people her teacher had taught over the years in the Dance Association, that’s why they took her on as a disciple.<br/><br/>Stella Edwards sat in the entryway for a while, then buried her face in the crook of her arm and began to sob softly.<br/><br/>She had always believed that her current position was achieved through her own strength, through her own hard work. That she stood in the center of the stage and received the goodwill of the Lane family.<br/><br/>Because of the Lane family, in the Imperial Capital, who would not admire her, or give her some respect?<br/><br/>But it turns out, all of this was simply because she was similar to Charlotte Lane.<br/><br/>From beginning to end, she was just a substitute.<br/><br/>For the Lane family, she was.<br/><br/>For Edward Kirsten, she was too.<br/><br/>All she had acquired was for that reason as well.<br/><br/>From beginning to end, she had been acting as a stand-in for Charlotte Lane.<br/><br/>Why did it have to be Daisy Zane who was Charlotte Lane, why! Why! Why!<br/><br/>...<br/><br/>Ever since the Research Institute made Charlotte Lane’s identity public, the defenses in the Imperial Capital quietly increased by a lot.<br/><br/>They subtly left a small opening.<br/><br/>But this opening was a one-way street.<br/><br/>Come in, but don’t think about leaving.<br/><br/>The fact that Charlotte Lane is being observed by the Research Institute made not only Kevin Clark nervous, but the Lanes as well.<br/><br/>His mother had many names, some he had heard of, and some he hadn’t. He got used to different people calling her different names and didn’t pay much attention to it.<br/><br/>He assumed it was a new identity, a new name.<br/><br/>Just like when he went to Truro City to find his mother.<br/><br/>When he heard Kevin Clark call her “Lucia”, he didn’t think much of it.<br/><br/>He just muttered to himself, so her name is “Lucia” now.<br/><br/>So... when they arrived at the Lane’s and Kevin Clark asked Charles Amos to call Andrew Lane and Sophie Ortiz as his grandparents, Charles Amos was stupefied.<br/><br/>Not only didn’t he call them that, he looked up at Kevin Clark and asked, “Why?”<br/><br/>Then he heard Charlotte Lane say, “Because they are your grandparents.”<br/><br/>Charles Amos suddenly widened his eyes, leaning against Kevin Clark’s leg, his pupils even trembled.<br/><br/>He was clearly afraid.<br/><br/>Seeing his reaction, Charlotte immediately realized.<br/><br/>Charles Amos thought these were his father Edward Kirsten’s parents.<br/><br/>So she immediately squatted down and looked at Charles Amos, saying, “They are my parents.”<br/><br/>Charles Amos blinked his big eyes, saying, “Your parents?”<br/><br/>“Yes.” Seeing him getting scared so quickly, Charlotte’s voice softened, “My parents.”<br/><br/>Charles looked at Andrew couple who were smiling at him, then he looked at Charlotte, and asked her in a low voice, “By blood?”<br/><br/>“Yes.”<br/><br/>It took Charles two seconds to accept this reality. Then he walked over to Andrew Lane and Sophie Ortiz, looked up and obediently said, “Grandpa, grandma. I am Charles.”<br/><br/>Andrew Lane and Sophie Ortiz squatted down to talk to him, and they were obviously more popular than Kevin Clark.<br/><br/>Afterwards, Olivia Lane and Old Master Lane also came downstairs.<br/><br/>Charles called out to his great-grandfather, and then his aunt.<br/><br/>He finally understood why Olivia Lane was so insistent on having him call her aunt.<br/><br/>Turns out she really was his aunt.<br/><br/>As the four adults gathered around Charles Amos, Kevin Clark and Charlotte Lane went and sat to the side.<br/><br/>“Was it okay for him to call him great-grandfather?” asked Charlotte Lane.<br/><br/>“Let him. It comes naturally.” Kevin Clark looked at her and replied.<br/><br/>“Third Master. You are an impressive one.” Charlotte said, “Using Charles as a shield in the Clark manor, and now you’re using him as a pass at our place.”<br/><br/>“Children after all.” Kevin Clark kissed Charlotte Lane while everyone was not paying attention to them, “They are always useful to have around.”\t\t\t\t\t\t</div>", "images": {}, "success": true}