{"id": 510, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14883730.html", "title": "Chapter 507: 450: Recording", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 507: 450: Recording</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 507: Chapter 450: Recording<br/><br/>The breakfast at Clark Manor today was extremely generous, generous to the point that... Lila Campbell felt like they wanted Finley Clark to eat back all the meals he missed over the past decade.<br/><br/>“Eat properly, what are you doing?” Lila Campbell flicked Charles Amos’ head, “What did you do last night? You are looking listless.”<br/><br/>“You ask him.” Charles Amos glanced at Harton Clark.<br/><br/>Everyone at the table immediately looked at Harton Clark.<br/><br/>Harton Clark looked innocent, “What’s wrong with me? I even told you a story before you went to sleep last night.”<br/><br/>Charles Amos’ eyebrows almost shot up in amusement with this mention, “You have the nerve to say it out loud. You told me a ghost story. I dreamt I was chased by a female ghost all night, I am completely exhausted.”<br/><br/>Everyone at the table fell silent for a brief moment, then suddenly burst out in laughter.<br/><br/>Tom Wayne didn’t sleep last night, but he was in high spirits now. He laughed and said: “How dare you even tease a child.”<br/><br/>“Where do you see a child, he is a little devil.” Harton Clark said, “And a little devil who specializes in causing trouble.”<br/><br/>Charles Amos pursed his lips and started to eat his meal silently.<br/><br/>After Kevin Clark had peeled the egg, he broke it open and put the yolk in Charles’s bowl.<br/><br/>Charles, watching Kevin putting things into the bowl next to him, said without lifting his head, “Thank you, Dad.”<br/><br/>Kevin was taken aback and immediately turned to look at Charles.<br/><br/>All the people at the table became silent for a brief moment, looking at Charles and Kevin.<br/><br/>They saw the seldom surprise, joy, and somewhat overwhelmed emotions all mixed together on Kevin’s face.<br/><br/>Charles, appearing quite spiritless and seemingly lost in daydreaming, didn’t pay much attention to everyone at the table. He tilts his head to look at the food in his bowl.<br/><br/>An egg yolk.<br/><br/>!!!<br/><br/>His wandering soul semi-returned instantly.<br/><br/>He looked at the egg yolk for a while, then looked up at Kevin.<br/><br/>At the moment their eyes met, Kevin felt a pang of guilt in his heart.<br/><br/>But it was just a tiny bit.<br/><br/>And so, he took out the yolk, stretched his hand, and put it in Harton’s bowl who was sitting opposite him.<br/><br/>Harton, seeing the newly appeared egg yolk in his bowl, was like: “??????”<br/><br/>Then... Charles suddenly raised his voice: “Mom, Dad is picky about his food.”<br/><br/>“Hmm, I saw it.” Lila Campbell seeing the peeled egg in her dish by Kevin.<br/><br/>Besides, the evidence mentioned by Jack Thompson was revealed. A recording lasting more than an hour. No editing was done, everything was sent out.<br/><br/>According to Jack Thompson’s confession and the content of the recording, the whole process of the incident was roughly restored.<br/><br/>Jack Thompson’s company was facing bankruptcy, and he had once sought out Johanes Miles.<br/><br/>It was the time that Charlotte Lane had found from the surveillance of the tea room when the two met.<br/><br/>Jack Thompson wanted Johanes Miles to help him out of the spirit of college friendship, but the situation of the Miles Group was also bad, and Johanes Miles refused him.<br/><br/>However... two days later, the old master of the Miles family suddenly contacted him.<br/><br/>The two agreed to meet at a coffee shop where there was no surveillance on the whole street.<br/><br/>That is the day Jack Thompson made the recording with the voice recorder.<br/><br/>The old master agreed to invest two million to help Jack Thompson’s company through the crisis. The premise is... Jack Thompson has to do him a favor.<br/><br/>That is, let Jack Thompson pretend to confess out of guilt because of drunk, frame Claudia Zane and slander her for having a relationship with him.<br/><br/>It was Claudia Zane who cheated first.<br/><br/>Remove the Miles family and the Miles Group from this matter. Restore some of the reputation of the Miles family.<br/><br/>As long as this matter can be successful, if the Miles Group improves, the Miles family will give him another two million afterwards.<br/><br/>The old master also said that he didn’t have to worry about all the matters, he just needed to show his face.<br/><br/>The manuscript will be written for him.<br/><br/>From the recording, Jack Thompson initially refused.<br/><br/>He said: “Claudia and we are all college classmates. She is such a good girl, how can I ruin her reputation after her death.”<br/><br/>But after nearly an hour of persuasion from the old master, Jack Thompson agreed in the face of huge benefits.<br/><br/>That day after he agreed, the old master gave him two suitcases with one million cash in them and let him take them away.<br/><br/>The other million will be given to him after he releases the video.<br/><br/>Jack Thompson made the video a few days later, and then took it to the coffee house to show it to the old master.<br/><br/>According to Jack Thompson’s confession.<br/><br/>The old man felt okay after watching it that day, and asked him to set it up for timed forwarding.<br/><br/>Then he left the coffee shop with the other million, and was put in a car. He had been in the trunk since then.<br/><br/>The reason for the tape recorder was that he was afraid of accidents, so he left one and recorded the sound and put it in the safe at home.<br/><br/>And told his wife, if he was missing for more than twelve hours, call the police. If he couldn’t be found in a week, give the voice recorder in the safe to the police.<br/><br/>But it didn’t take a week, he was found in two nights.<br/><br/>The voice recorder was equipped with a storage card, and it had not been played on any device with a network, so neither Charlotte Lane nor Celestial Pivot found out.\t\t\t\t\t\t</div>", "images": {}, "success": true}