{"id": 523, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14909004.html", "title": "Chapter 520: 463: Conversation", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 520: 463: Conversation</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 520: Chapter 463: Conversation<br/><br/>Coffee Shop<br/><br/>Kevin Clark and Andrew Lane sat facing each other.<br/><br/>The two of them were silent for a while before Andrew spoke up, “Do you know why I wanted to talk to you?”<br/><br/>“I have some idea,” Kevin replied honestly.<br/><br/>Andrew fell silent for a moment and then continued, “Kevin Clark, actually, I quite admire you as a person.”<br/><br/>Kevin rubbed his fingertips, waiting for him to say “but.”<br/><br/>“But... Although I admire you, I’ve never thought of marrying my daughter to you like my father did,” Andrew said, “You’re too calculating, too complicated. And you’re ruthless. To be honest, I’m not at ease.”<br/><br/>Kevin didn’t say anything.<br/><br/>Andrew didn’t need him to say anything either: “Of course... my understanding of you is relatively one-sided. Because we didn’t spend much time together in the past. Back then, we would only meet once a year on Lila’s birthday. So... I need time to get to know you.”<br/><br/>“I understand,” Kevin said.<br/><br/>“However... I am still willing to trust Lila’s judgment,” Andrew said, “I always pick her up to take her home, indeed, my personal preference weighs heavier. Sometimes, I even deliberately avoid thinking about the fact that she’s already married. I don’t love her to the point of wanting to control her; I just can’t accept the fact that she got married as soon as she came back.”<br/><br/>Kevin couldn’t fully empathize with a father’s love for his daughter.<br/><br/>But he thought of Charlotte Lane when she was little – so adorable and smart.<br/><br/>Back then, he didn’t think she was that cute. She was just clingy, making him have to hold her.<br/><br/>However, now thinking about that time, Kevin felt that she was really adorable.<br/><br/>So... he could understand why the Lane family was reluctant to let their daughter get married.<br/><br/>Anyone would be reluctant, right?<br/><br/>“Kevin Clark, have you really thought about Lila’s health issues?” Andrew finally mentioned the main issue of the day.<br/><br/>“Yes,” Kevin replied, “Uncle Lane, no matter what I say to you now, it would be better to show it in my actions in the future. Time will prove Little Girl’s judgment.”<br/><br/>Andrew smiled and said, “A person’s life is very long; with the increase of age, desires and needs will constantly change. You don’t like children now and feel indifferent about having them or not, but you may think differently later on.”<br/><br/>Kevin stayed silent but looked frank, revealing his deep feelings for Charlotte Lane.<br/><br/>William Lane looked at Kevin and said, “No one can predict the future. So... let’s not talk about the future, just focus on the present. Just focus on the countless possible futures that may come. You reap what you sow.”<br/><br/>Kevin listened to him.<br/><br/>Kevin laughed, “You came to see if I’m still intact, huh?”<br/><br/>“If that’s how you want to think about it, sure,” Charlotte replied, relieved that he seemed alright, and said, “I’m going back to the lab.”<br/><br/>Kevin caught her, “You’ve been waiting for me here, aren’t you going to comfort me?”<br/><br/>“Do you need comfort?” Charlotte looked into his eyes and asked.<br/><br/>Being seen through, Kevin shamelessly said, “Yes, I need it.”<br/><br/>Rolling their eyes on the steps, William interjected, “......”<br/><br/>Charlotte glanced at William and then pulled Kevin’s collar to turn him around and stepped down another step. This conveniently blocked William’s line of sight. She then kissed him on the lips.<br/><br/>After kissing him, she turned around and left, leaving him with just a view of her back.<br/><br/>It was like a shameless woman who put on her clothes and didn’t recognize her lover from the night before.<br/><br/>Kevin watched her back and laughed softly after a while.<br/><br/>Meanwhile, William, whose view was blocked and could only see Kevin’s back, could guess what the two were doing and clicked his tongue softly.<br/><br/>“Any objections?” Kevin turned to look at him.<br/><br/>“Can you at least show some initiative? That’s my sister, you’re not going to curry favor with me?” William said.<br/><br/>“What does your opinion matter?” Kevin retorted, “Little Girl wouldn’t listen to you even when she was three.”<br/><br/>William was rendered speechless.<br/><br/>“Has Little Girl mentioned anything to you?” Kevin asked.<br/><br/>“Yes,” William stretched his legs, “She wanted us to reduce our obstacles to you.”<br/><br/>“Did you?” Kevin asked.<br/><br/>“No,” William replied.<br/><br/>“That’s fine because I don’t need it,” Kevin said, “It’s better if you guys give me a hard time. That way, Little Girl will feel more sorry for me, and then she’ll be even nicer to me.”<br/><br/>“Do you have no shame?”<br/><br/>Kevin raised an eyebrow but didn’t answer.<br/><br/>William also fell silent for a moment before whispering, “How come Lila has suffered so much?”<br/><br/>Kevin’s eyelashes trembled slightly and, after a while, he said, “She won’t anymore in the future.”\t\t\t\t\t\t</div>", "images": {}, "success": true}