{"id": 526, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14909015.html", "title": "Chapter 523: 466: Lady Quinn", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 523: 466: Lady Quinn</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 523: Chapter 466: Lady Quinn<br/><br/>Charlotte Lane had nothing to do with Daisy Zane or the Court Music Academy, so she did not have an invitation. If she wanted to attend, she could only go with Kevin Clark.<br/><br/>The birthday banquet started at 2 PM.<br/><br/>From 2 PM onwards, the main agenda was to engage in conversations with each other.<br/><br/>The Court Music Academy had long been a fusion of Eastern and Western music.<br/><br/>Charles Flores’ birthday had been grandly celebrated every year from a very long time ago, he just later changed the date, with the main objective being engaging in interactions.<br/><br/>Not only from the domestic academies but also from foreign ones.<br/><br/>Especially since every friend of Charles Flores was a Master, of a world-class musician’s calibre.<br/><br/>Hosting a birthday banquet was akin to giving an opportunity for students of the musical academy and even domestically, to interact and advance with one another.<br/><br/>Hence, most of the people who attended around this time were proficient in musical instruments and held a certain status in this field.<br/><br/>Others, such as Charles Flores’ friends, would mostly come around at night.<br/><br/>After having lunch, Charles Amos asked Wilton Edwards to drop him to the Court Music Academy soon after.<br/><br/>By the time Charlotte Lane and Kevin Clark arrived at the Court Music Academy, it was almost 5 PM.<br/><br/>The birthday banquet was held in the open area behind the Court Music Academy.<br/><br/>Everyone held their proficient musical instrument in their hand, engaging in mutual interaction.<br/><br/>As soon as Kevin Clark and Charlotte Lane stepped into the Court Music Academy, they heard the sound of various musical instruments.<br/><br/>As the two were walking inside, they heard a battle of music.<br/><br/>Between Erhu and Violin.<br/><br/>Charlotte Lane gazed at the surrounding scenery as she walked towards the back.<br/><br/>Familiar bamboo forests, stone benches, and arches. And unfamiliar flowers, corridor paintings, and people.<br/><br/>Upon seeing her watching the surroundings, Kevin Clark slowed down his steps, “Did you come here often before?”<br/><br/>Gazing at the musical score painted on the wall, Charlotte Lane nodded and said, “Hmm. Every day. Sometimes I’d even stay here for a night over the weekend.”<br/><br/>“Did uncle Lane allow it?” Kevin Clark asked.<br/><br/>“It’s only for one night, and not always.” Charlotte Lane said, “Moreover, Aunt Cruz would come to accompany me.”<br/><br/>As Charlotte Lane watched the musical scores on the wall, Kevin Clark watched her.<br/><br/>He has recalled little Charlotte Lane from his childhood more than once.<br/><br/>William Lane deliberately kept him from meeting his sister, and afterwards, he indeed hadn’t seen Charlotte Lane much.<br/><br/>Sometimes Old Master Lane would bring little Lila to the Clark Manor, where they’d meet. Lil Lila wouldn’t act unfamiliar because she hadn’t seen him for a while.<br/><br/>She’d always gaze at him without any attempt to hide, openly and outright. Then, she’d ask him to hold her, and to play with her.<br/><br/>This hasn’t changed at all.<br/><br/>It’s the same as it is now. Whenever Charlotte Lane wants to watch him, she never tries to hide. Her admiration for him, occasional desire, possession, has never been hidden.<br/><br/>Kevin Clark gave a polite smile: “Lady Quinn.”<br/><br/>Caroline Quinn joked: “I thought you had forgotten me.”<br/><br/>Kevin Clark just gave a small smile without saying anything.<br/><br/>Caroline Quinn turned to Charlotte Lane, asking: “And who is this?”<br/><br/>“My wife.” Kevin Clark didn’t intend to introduce them.<br/><br/>A look of surprise appeared on Caroline Quinn’s face: “You...got married?”<br/><br/>“Yes.” Kevin Clark, holding Charlotte Lane’s hand, said to Caroline Quinn, “We’re going to greet Master Flores.”<br/><br/>Having said that, Kevin Clark nodded respectfully to her, and then directly led Charlotte Lane away.<br/><br/>Caroline Quinn stood where she was, staring blankly at the retreating figure of Kevin Clark and his wife.<br/><br/>Wasn’t it said that he would never settle down?<br/><br/>It’s just been a few years, and he’s already married.<br/><br/>Caroline Quinn was watching the couple when a voice suddenly sounded behind her: “Senior Quinn.”<br/><br/>She had been so distracted, she hadn’t noticed when the person had approached from behind.<br/><br/>Turning around, she saw the woman behind her. Alex Justin had introduced her earlier, saying that she played the pipa beautifully, and was highly valued by the Court Music Academy.<br/><br/>Her name was Celeste Martin.<br/><br/>Caroline Quinn smiled: “So you’re here too.”<br/><br/>“Yes. I’ve been playing the pipa for too long. I’m taking a break and going for a walk.” After finishing her sentence, Celeste Martin asked, “Senior Quinn, do you know Third Master Clark?”<br/><br/>Caroline Quinn answered, “Yes, we used to learn piano together. Do you know them too?”<br/><br/>“I don’t know Third Master very well, but I’m quite familiar with his wife. We recorded a show together.” Celeste Martin replied.<br/><br/>“She is from the entertainment industry?” Caroline Quinn asked.<br/><br/>“Yes, she has become quite popular in recent years.”<br/><br/>Caroline Quinn doesn’t pay much attention to the entertainment industry, naturally she wouldn’t have known; and she didn’t expect Kevin Clark to marry someone from the entertainment industry either.<br/><br/>She took a glance earlier, indeed, the woman was stunningly beautiful.<br/><br/>And Kevin Clark seemed to like her a lot.<br/><br/>“Senior, she is very talented, you can have a chat with her later.” Celeste Martin said.<br/><br/>“Is that so?” Caroline Quinn appeared somewhat absent-minded and forced a smile, “Does she also play the piano?”<br/><br/>Celeste Martin smiled, seemingly recognizing this as truth and then said, “Senior, learning from each other would surely be today’s highlight.”<br/><br/>Caroline Quinn raised her eyebrows, “I mustn’t waste such a good learning opportunity then.”<br/><br/>Celeste Martin agreed with a smile, her face full of innocence.<br/><br/>Daisy Zane, you’ve brought this upon yourself, no one can be blamed for your humiliation.<br/><br/>By then...it’s the reputation of the Clark Family you will be tarnishing.\t\t\t\t\t\t</div>", "images": {}, "success": true}