{"id": 520, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14908995.html", "title": "Chapter 517: 460: Ezekiel Santiago", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 517: 460: Ezekiel Santiago</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 517: Chapter 460: Ezekiel Santiago<br/><br/>Kevin Clark and Charlotte Lane’s laboratories were arranged, and they planned to go to Mountain Sea Continent next week.<br/><br/>However, Kevin Clark got held up when he went to ask for leave from Ezekiel Santiago.<br/><br/>Turner Daniel, Ezekiel Santiago’s grandson, did not major in pharmaceutical formulation in college, so his only way to join the Research Institute was the same as Charlotte Lane’s.<br/><br/>First, he had to pass the examination to obtain the qualifications for the Research Institute’s training, and then go through two years of training, pass all the assessments in these two years, and finally obtain the qualifications for entering the Research Institute.<br/><br/>Last year, after Santiago suffered an attack, Turner Daniel quit his field, took the exam and got the qualifications for the Research Institute’s training.<br/><br/>Now it’s time for the final examination, and Santiago wants Nicholson Amos to mentor his grandson.<br/><br/>After listening to this matter, Kevin Clark directly refused: “What’s going on? Giving preferential treatment to your own grandson?”<br/><br/>“I’m different from you.” Santiago said with a serious face, “You can treat your own wife fairly and impartially. I can’t. If I have the resources, of course I want to pave the way for my grandson.”<br/><br/>Kevin Clark: “........”<br/><br/>Seeing him silent for a moment, Santiago chuckled. Mentioning Nicholson Amos was still effective.<br/><br/>Kevin Clark looked at him and asked after a while, “Why do you want to do this?”<br/><br/>“What do you mean, why do I want to do this?”<br/><br/>“There are so many people in the Research Institute. Turner Daniel still has a professor to teach him. Why do you have to find Nicholson Amos to mentor him?” Kevin Clark asked.<br/><br/>“Can just anyone mentor my grandson?” Santiago said, “To be honest, I don’t even look up to you.”<br/><br/>Kevin Clark narrowed his eyes.<br/><br/>Santiago’s momentum weakened a bit, and he coughed lightly, “I’ll tell you the truth. After this final examination, the professor who is mentoring him will retire, and I want Nicholson Amos to mentor him.”<br/><br/>Kevin Clark looked at Santiago and was silent for a while.<br/><br/>Santiago was sweating under his gaze, “What are you looking at? Is there something on my face?”<br/><br/>“Old man, there’s something wrong with you.” Kevin Clark said gravely.<br/><br/>After a while, Santiago sighed, “Harton, there’s no need for someone to be so clever.”<br/><br/>After sighing, Kevin Clark saw that Santiago looked somewhat listless, “What’s the matter?”<br/><br/>“I had a recent medical check. Leukemia.” Santiago said calmly, “If the medicine can control it, I can live for one or two more years. Therefore, I want Turner Daniel to quickly develop the ability to take over my position.”<br/><br/>Kevin Clark furrowed his brows and hesitated for a while, “Is medicine the only way to control it?”<br/><br/>“Yes.” Santiago nodded, “After the last attack, my health has been poor. If I try other methods, I may die even faster.”<br/><br/>After carefully assessing Turner Daniel’s abilities, she devised a plan for him.<br/><br/>Third Master Clark was also appointed as an assistant and was responsible for most of the communication between Charlotte Lane and Turner Daniel.<br/><br/>Both of them mentored him with great dedication.<br/><br/>After being discharged from the hospital, the Lane family gathered and celebrated.<br/><br/>On the day of William Lane’s discharge, the Lane family gathered together for a celebration.<br/><br/>The next day, they invited some friends over, and the Clark and Hobson families came to join them.<br/><br/>After everyone happily gathered, the Lane couple didn’t return home for three consecutive days.<br/><br/>For three days in a row, young and old in the family didn’t see the couple, just received phone calls from them.<br/><br/>Andrew Lane even stopped picking up Charlotte Lane from work.<br/><br/>At first, Charlotte Lane didn’t notice anything.<br/><br/>When Andrew Lane stopped driving her, Kevin Clark took her back to the Clark Family home.<br/><br/>Even on the fourth day when Andrew Lane came to pick her up from work and Sophie Ortiz returned home, Charlotte Lane still didn’t notice anything.<br/><br/>Both of them seemed normal, as if they had just been away for three days.<br/><br/>It wasn’t until the evening when Charlotte Lane and Kevin Clark finished their video call and were preparing to go to bed.<br/><br/>Robinson Scott sent her some photos, saying: [Brother Nine, are these your parents? I saw them coming in and out of this hospital for three consecutive days.]<br/><br/>Charlotte Lane looked at the photos. They wore different clothes and had entered and exited the hospital over the past three days.<br/><br/>And after zooming in one photo, it was clear that Sophie Ortiz seems to have cried, as her eyes were swollen.<br/><br/>That moment, Charlotte Lane’s drowsiness disappeared.<br/><br/>She sat on the bed for a while and then opened her computer to hack the hospital’s system.<br/><br/>But she couldn’t find any information about Sophie Ortiz and Andrew Lane.<br/><br/>So, Charlotte Lane hacked their cell phones.<br/><br/>In the end, she found the information on Sophie Ortiz’s phone. She had searched the functions of many medicinal materials, and also some cases of treating infertility.<br/><br/>She looked for cure rates as well as the pain suffered during the treatment process.<br/><br/>After searching, Sophie Ortiz deleted all the information.<br/><br/>Staring at the information found on her computer, Charlotte Lane’s fingertips grew colder and colder, and the blood on her lips slowly faded...\t\t\t\t\t\t</div>", "images": {}, "success": true}