{"id": 522, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14909001.html", "title": "Chapter 519: 462: Because I Like You", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 519: 462: Because I Like You</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 519: Chapter 462: Because I Like You<br/><br/>Charlotte Lane knew that the medicine she drank had been prescribed by Kevin Clark, so she believed he should be aware of its effects.<br/><br/>However, she was afraid that he might not know and had only prescribed these specific herbs because he thought they were effective.<br/><br/>Because she had never been quite sure about Kevin Clark’s medical expertise.<br/><br/>She kept watching Kevin Clark’s reaction. Only when she saw him relax after reading the report did she confirm that he knew.<br/><br/>Kevin Clark knelt in front of her, carefully folded the report, put it in his pocket, then looked at her and asked softly, “What made you suddenly decide to get a check-up?”<br/><br/>“It was my parents. They came to the hospital to ask what my herbal medicine was for,” Charlotte Lane replied simply.<br/><br/>Kevin Clark held Charlotte Lane’s hand, gently caressing it: “Then why did you come by yourself?”<br/><br/>“They didn’t tell me about it, I found out on my own.” Charlotte Lane paused before continuing, “You always knew?”<br/><br/>Kevin Clark nodded.<br/><br/>Charlotte Lane looked at him: “Was it the time I had a fever?”<br/><br/>“Yes.”<br/><br/>It was so early, and at that time, Kevin Clark had just started to have feelings and curiosity for her.<br/><br/>“I have a responsibility. It’s related to the training I had that year.” Kevin Clark thought about the events of that year, frowning slightly.<br/><br/>“You didn’t know it was me. And I’ve said it before, it’s all voluntary on my part.” Charlotte Lane said.<br/><br/>Kevin Clark knew she was Martin Hanzel’s when they were already married.<br/><br/>Despite knowing about her health issues, he had stayed by her side and married her.<br/><br/>“Why did you marry me then?” Charlotte Lane’s voice was still cold and calm.<br/><br/>“Because I like you, I love you.” Kevin Clark held her hand, looked at her, “liking you and having a child of my own have no necessary connection, and there’s no cause-and-effect relationship.”<br/><br/>“But, Kevin Clark, you won’t have your own child.” Charlotte Lane’s voice cooled down a bit more, “I’ve just thought about it, if you dare to let someone else give birth to your child, I might cripple you.”<br/><br/>Kevin Clark laughed and then said, “I’ve just thought about it too, if there were a child, it would take away the little girl’s love for me, so it’s better not to have one.”<br/><br/>Charlotte Lane didn’t say anything.<br/><br/>Kevin Clark touched her face: “I just want my little girl to be healthy and well.”<br/><br/>Charlotte Lane slowly lowered her gaze, remaining silent.<br/><br/>Kevin Clark kept looking at her, keeping silent with her for a while. Just when he was about to speak, Charlotte Lane suddenly spoke up.<br/><br/>“Then why do you take such good precautions every time? Doesn’t it feel uncomfortable?”<br/><br/>The comforting words were on the tip of his tongue, but they got stuck there, and he couldn’t say them.<br/><br/>Kevin Clark’s lips trembled, and his forehead twitched. The sudden change of topic caught him off guard, and he couldn’t even utter a single syllable.<br/><br/>“Third Uncle, don’t use it next time.” Charlotte Lane seemed to be seriously suggesting.<br/><br/>Charlotte Lane slightly raised the corner of her mouth: “My eyesight has always been good.”<br/><br/>Andrew Lane was silent for a moment: “But that doesn’t mean he can take advantage of her.”<br/><br/>“Yes, I’ll follow your advice,” Charlotte Lane replied.<br/><br/>The next day, Andrew Lane took Charlotte Lane, as well as Roy Madison, to work.<br/><br/>Charlotte Lane sipped yogurt and sat in the back with Andrew Lane.<br/><br/>Roy Madison sat in the copilot seat, looking at the yogurt in Charlotte Lane’s hand, and asked, “I didn’t see you take it from home, where did you get it?”<br/><br/>“Dad gave it to me.”<br/><br/>Roy Madison looked at Andrew Lane.<br/><br/>Andrew Lane glanced at him, “What are you looking at? If you want to drink, go buy it yourself.”<br/><br/>Roy Madison: “......”<br/><br/>Charlotte Lane chuckled.<br/><br/>Roy Madison looked at her and then gave her an envious look.<br/><br/>When they arrived at the research institute, Kevin Clark saw Roy Madison get out of the car at the entrance and his face darkened a degree.<br/><br/>Charlotte Lane went home every day, so the amount of time that just the two of them were alone in the research institute during the day had increased with Roy Madison around.<br/><br/>“What’s with that expression?” Roy Madison deliberately asked, “You’re welcoming your brother back to the research institute like this?”<br/><br/>“Who said you and I are brothers?” Kevin Clark didn’t even want to look at him.<br/><br/>“Oh, right. I’m your cousin Smith.” As Roy Madison said this, he felt a refreshing sense of having his grievances of many years redressed.<br/><br/>Kevin Clark had a retort on the tip of his tongue, but seeing that Andrew Lane’s car hadn’t left yet, he swallowed the words and ignored him.<br/><br/>“Kevin Clark.” Andrew Lane suddenly called out to him.<br/><br/>“Uncle Lane.”<br/><br/>“Are you free this morning?”<br/><br/>“Yes.” Kevin Clark replied and glanced at Charlotte Lane.<br/><br/>Charlotte Lane blinked her eyes, and he understood immediately that she had talked with them last night.<br/><br/>“I’ll wait for you here. After you clock in, come out when you have time, I have something to talk to you about.” Andrew Lane said.<br/><br/>“Uncle Lane, I can do it now. I don’t need to clock in.” Kevin Clark walked towards the car.<br/><br/>Andrew Lane looked at him. Although his expression was neutral, he was asking why.<br/><br/>Roy Madison joked, “Dad, your son-in-law often deducts money from the research institute due to being late, leaving early, and absent from work.”<br/><br/>Kevin Clark: “......” Thank you for establishing such an image of me.\t\t\t\t\t\t</div>", "images": {}, "success": true}