{"id": 521, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14908998.html", "title": "Chapter 518: 461: Inspection", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 518: 461: Inspection</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 518: Chapter 461: Inspection<br/><br/>The room was lit only by a dim bedside lamp; the surrounding darkness struggled with the weak light, constantly encroaching.<br/><br/>Charlotte Lane sat on the edge of the bed, staring at something on the computer. She looked cold and numb.<br/><br/>After a long time, her fingertips moved to close the page on the computer, then opened the appointment registration page for the First Hospital.<br/><br/>She booked an appointment for tomorrow morning and turned off the computer.<br/><br/>Charlotte lay in bed, closing her eyes.<br/><br/>If it wasn’t her, the person who made Sophie Ortiz hide outside for three days without coming home, continuously going in and out of the hospital, crying red-eyed, and still having this kind of problem would be Olivia Lane.<br/><br/>But her mother had checked so many herbal ingredients.<br/><br/>So there was a more than ninety percent chance that the person was herself.<br/><br/>Only she was taking herbal medicine at home.<br/><br/>Long ago, Sophie had asked her what she drank every morning.<br/><br/>She said it was to regulate her body.<br/><br/>She indeed never thought about it in that way, she actually thought it was for regulating her menstrual period.<br/><br/>She didn’t even know what medicines were in the medicine packet.<br/><br/>Sophie probably didn’t trust her and thought she was deceiving them, so she took the leftover medicine to investigate.<br/><br/>Thinking back... she trusted Arthur North too much back then. She said she was on guard, but deep down she still believed him.<br/><br/>Arthur gave her the medicine, and she took it without even checking it.<br/><br/>If Arthur wasn’t a good person and had poisoned her, she might have already gone through a Memorial Day.<br/><br/>...<br/><br/>The next day, Charlotte was sent to work at the Research Institute as usual by Andrew Lane.<br/><br/>Arthur North was also waiting for her at the entrance of the Research Institute as usual.<br/><br/>The two entered the Experimental Tower together, and Arthur sent her to the entrance of the Laboratory before going back to his own Laboratory.<br/><br/>After Charlotte entered the Laboratory, she checked the progress of the experiments, arranged some tasks, and left an hour later.<br/><br/>Charlotte raised her brows after listening to it.<br/><br/>Then Robinson sent another voice message: “Brother Nine, I’m kind of regretting it now. If I had known he was so shameless, I would have beaten him up more that night. Regardless of the outcome, I would have had to care for him anyway, so I might as well have made sure he really ended up lying in bed!”<br/><br/>After a while, Robinson sent another one: “Brother Nine- what should I do? How did I fall for him? I can’t look at younger guys anymore, can’t casually add their contact info, can’t flirt with them anymore. How did I end up here today!! I deleted over a hundred contacts last night in tears. How can I give up an entire sea for one person? I can’t figure it out-”<br/><br/>Charlotte listened to her excited, sad, and regretful mixed tone, and raised the corners of her mouth, then put away her phone.<br/><br/>She leaned back on the bench, listening to the cicadas chirping and watching the mottled sunlight filtering through the tree leaves.<br/><br/>“This is a permanent damage, with a very, very low chance of recovery.”<br/><br/>The doctor’s words floated in her ear.<br/><br/>“Indeed, there are such cases where most people chose treatment, but... so far, none have been successful.”<br/><br/>“This prescription is primarily for nourishing the body of people with infertility. Since infertility is caused by physical damage, these medications focus on regulating your body.”<br/><br/>“But it’s not specifically for fertility. It’s just for regulating and protecting your body from the effects of hormones and other factors.”<br/><br/>“The purpose is to help you avoid potential problems that might arise as you age. The person who prepared the medicine chose a gentle approach to protect and strengthen your body in the long term.”<br/><br/>“For traditional medicine, treating your condition... would involve fortifying the fundamentals and using specific medications. But the medicine might be strong, causing a series of medicinal reactions such as body pain, vomiting, loss of appetite, and each person’s body is different, so there might be some permanent side effects.”<br/><br/>Charlotte’s cold phoenix eyes gazed at the tree leaves, thinking about what the Chinese and Western doctors had said when suddenly a shadow enveloped her and blocked her sight.<br/><br/>First, she saw the black shirt on Kevin Clark’s body, and his rising and falling chest. Then her gaze moved upward to his face.<br/><br/>Even though it was from a lower perspective, Kevin looked as stunning as ever, especially with tiny crystal-like beads of sweat on his forehead, translucent skin, long and narrow eyes, and deep red thin lips, making him appear even more enchanting.<br/><br/>Kevin looked down at her. After a moment, he squatted in front of her, and his gaze shifted from looking down to looking up: “Are you feeling unwell?”<br/><br/>His voice was soft, but worried and tense.<br/><br/>Charlotte’s gaze followed his face as he moved, not saying anything.<br/><br/>Seeing she didn’t speak, Kevin glanced at her hand, and then at her side. He spotted a corner of a piece of paper sticking out of her pocket.<br/><br/>He took it out directly; it was the lab report results.<br/><br/>While opening it, Kevin could feel his hand trembling. But after reading, he breathed a sigh of relief.<br/><br/>His heart that had been lifted also dropped back down somewhat.\t\t\t\t\t\t</div>", "images": {}, "success": true}