{"id": 525, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14909012.html", "title": "Chapter 522: 465: The Day Of Apprenticeship", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 522: 465: The Day Of Apprenticeship</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 522: Chapter 465: The Day of Apprenticeship<br/><br/>Kevin Clark only posted a few words on Facebook, but it made people feel a sense of oppression. It also made people feel... the unfathomable sense of jealousy.<br/><br/>[Sisters, honestly, I’ve been going back and forth, in and out, below these three people’s Facebook posts, and sparks have been flying.]<br/><br/>[The great grieved party has turned into a giant vat of vinegar.]<br/><br/>[Oh my God, what is making me laugh at the chairman of Easton Group.]<br/><br/>[He’s anxious, he’s anxious, he’s anxious.]<br/><br/>[It turns out that three men can really put on a show together.]<br/><br/>[Oh, my goodness, my head is rolling with laughter.]<br/><br/>[Third Master Clark does have a bit of a domineering CEO vibe to him, but... not much. As for why it’s not much, it’s because, in contrast to Brook Sister, it’s just not much.]<br/><br/>[Damn! Third Master Clark is really scary, okay? His looks are very aggressive, especially when he has no expression, and I don’t dare to look him in the eye through the screen.]<br/><br/>[Sorry, I haven’t seen it. I’ve only seen a photo of the Third Master standing next to Daisy, smiling. I don’t look at scary photos, as they cause nightmares in the evening.]<br/><br/>...<br/><br/>Not long after Kevin Clark’s Facebook post.<br/><br/>Catherine’s Facebook was updated.<br/><br/>[What are you guys doing????????????????]<br/><br/>There’s no @, just six words and sixteen question marks, but it’s obvious who they’re talking about.<br/><br/>Kevin Clark was the first to comment, simply replying with four words: [Proclaiming sovereignty.]<br/><br/>Then Felix Baker came: [It’s nothing, nothing happened, just chatting casually.]<br/><br/>Finally, Joseph Allen: [Joining the fun.]<br/><br/>The replies of the three people are different, but they all convey a sense of “obedience”.<br/><br/>When asked what you are doing, you really reply with what you are doing.<br/><br/>Then, the netizens flocked to Catherine’s Facebook again to laugh.<br/><br/>[It seems that Brook Sister is indeed a woman at the top of the food chain.]<br/><br/>[It turns out that only one Catherine is needed to make the three men standing on the clouds quiet down.]<br/><br/>[Look at these sixteen question marks, they are more than just sixteen question marks.]<br/><br/>[From these sixteen question marks, I deeply feel Catherine’s helplessness.]<br/><br/>[Helplessness mixed with speechlessness.]<br/><br/>[Speechlessness mixed with incomprehension.]<br/><br/>[Incomprehension mixed with the feeling that you three are too childish.]<br/><br/>[Hahahahaha, how funny it is, the more I think about it, the funnier it gets.]<br/><br/>Upon reaching her side, he pouted and looked at Charlotte with an aggrieved expression.<br/><br/>A thousand unspoken words were condensed in his eyes.<br/><br/>Charlotte took a handkerchief from Kevin’s pocket and wiped Charles’ sweat. “Quit pretending with me. If you really couldn’t stand it, you would’ve used a hundred tricks to escape by now.”<br/><br/>Charles made a sad face. “I’ve been sunburned like this, and you don’t even feel sorry for me?”<br/><br/>Charlotte finished wiping his sweat, held his chin in the crook of her hand, and pinched his chubby cheek. “It’s cooler under the lotus pond. If I throw you in there, would that count as feeling sorry for you?”<br/><br/>Charles: “......”<br/><br/>Charlotte let go of him and said, “Let’s find a cool place this afternoon.”<br/><br/>Charles chuckled twice. “You don’t mean that.”<br/><br/>Charlotte ignored him as she got off the swing.<br/><br/>Charles grabbed her hand. “I’m going to the Court Music Academy this afternoon.”<br/><br/>“Isn’t today your day off?” Charlotte asked.<br/><br/>“See, you even know when my days off are.”<br/><br/>Charlotte continued to ignore him.<br/><br/>Kevin let out a laugh.<br/><br/>Finn Clark handed Charles a water bottle. “Drink some water, you little rascal.”<br/><br/>Charles took the water bottle, drank a few sips, and then said, “Boss Flores has a birthday today. He invited a lot of people. I also received an invitation.”<br/><br/>“Oh, you got invited too.” Finn patted him on the head, getting a handful of sweat. He wiped it off disdainfully on Charles’ clothes.<br/><br/>Charles frowned at him.<br/><br/>Finn pretended not to see.<br/><br/>Charlotte looked at Kevin. “When did his birthday become in August?”<br/><br/>As Charlotte asked the question, she realized what day it was today and slightly furrowed her brows.<br/><br/>Today was the day she had become an apprentice.<br/><br/>Seeing that she had guessed, Kevin kept quiet.<br/><br/>Charles hugged the water bottle and looked up at the two of them.<br/><br/>Kevin asked, “Would you like to go together?”<br/><br/>Charlotte looked at her hand hanging by her side. She touched her fingers with her thumb, and after a while, she said, “Yes.”<br/><br/>In the nearly two months since she had been back home, her family talked to her about meeting Charles Flores.<br/><br/>She told her parents that she would meet him in person, so they didn’t speak on her behalf.<br/><br/>However, she had been putting it off yet never went.<br/><br/>Seeing Charlotte touching her fingers, Kevin clasped her hand and gave it a gentle squeeze.\t\t\t\t\t\t</div>", "images": {}, "success": true}