{"id": 539, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14914999.html", "title": "Chapter 536 - 479: Ryan Easton Attacked…", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 536 - 479: Ryan Easton Attacked…</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 536: Chapter 479: Ryan Easton Attacked... <br/><br/>A portion of Dark Radiance had followed Arthur North in Imperial Capital while he was in F Continent. <br/><br/>So they were relatively familiar with Hugo Clark. <br/><br/>Charlotte Lane had a lot to consider. <br/><br/>Although she was now Mrs. Clark and the people of Dark Radiance obeyed her, after all, they had spent little time together. <br/><br/>What if someone targets Dark Radiance in Arthur North’s absence? <br/><br/>She might not be able to unite Dark Radiance’s members. <br/><br/>It would be safer to have Hugo Clark stay behind. <br/><br/>Charlotte Lane changed her clothes and went downstairs to find Adrian Roberts when Allonzo Hobson came back from outside. <br/><br/>He was discussing with Adrian Roberts and Hugo Clark about which route to take, apparently going with them as well. <br/><br/>Charlotte Lane listened to their discussion while checking her gun and dagger. <br/><br/>After a brief discussion, everyone got in the car and prepared to leave. <br/><br/>But just as Charlotte Lane got in the car, Juan Wright suddenly called. <br/><br/>Charlotte Lane closed the car door and answered the phone. <br/><br/>The car drove towards the entrance, and after listening to what Juan Wright said, Charlotte told the driver to stop. <br/><br/>“Brook Sister, what’s wrong?” <br/><br/>“Easton Group is under hacker attack.” Charlotte Lane was very calm, chillingly so. It was as if something separated her from the rest, stripping away all emotions. <br/><br/>Someone was targeting Arthur North. <br/><br/>Allonzo Hobson straightened up abruptly: “Then Easton Group’s things...” <br/><br/>If Nathan Ninevara stated that Easton Group was under hacker attack, then the attackers must have significant backing. <br/><br/>“It’s fine for now.” The ice beneath Charlotte’s eyes accumulated, even forming a layer of ice around her, making it difficult for others to approach. <br/><br/>Adrian Roberts had never seen her like this and didn’t dare to speak for a moment. <br/><br/>It was fine for now, but who knows what the future holds. <br/><br/>“You guys go find Arthur North.” Charlotte Lane looked at Allonzo Hobson and made a quick decision, “I’ll go block Easton Group’s online attack.” <br/><br/>“Alright.” Allonzo Hobson immediately agreed, “Brook Sister, don’t worry, Arthur will be fine.” <br/><br/>“Ok.” <br/><br/>Charlotte Lane got out of the car. <br/><br/>She approached the car in the back and stroked Silver Palace’s neck through the lowered window. <br/><br/>The two stared at each other briefly, and that was it. <br/><br/>She sensed that one of their opponents might be stronger than Holt Lawrence. <br/><br/>Such long-term battles of attrition were quite common, actually. <br/><br/>Since her childhood, when Andrew Lane taught her, he told her that many battles required perseverance and determination. <br/><br/>Everyone knew about her defeating Holt Lawrence back then, showcasing her talent. <br/><br/>In reality, during the first match, she ambushed Holt Lawrence and didn’t require much time. <br/><br/>Later, they fought a second time, a proper battle. They fought for two days, and ultimately Holt Lawrence was defeated and handed Celestial Pivot over to her. <br/><br/>Thus Charlotte Lane didn’t pay much mind to this long, drawn-out hacker battle. No matter how powerful the enemy was, she didn’t take them seriously. <br/><br/>The only thing that tormented her was the lack of news about Arthur North. <br/><br/>A voice in her heart told her to trust Arthur North, as he was so powerful, and nothing would happen to him. <br/><br/>However, the current situation forced her to doubt her inner voice. <br/><br/>Arthur’s opponents were well-prepared and well-informed. They even seemed to understand them well. <br/><br/>Moreover, like she was now facing, there might even be someone more powerful than Arthur North. <br/><br/>All was uncertain. <br/><br/>Amelie Quentin stayed with Charlotte Lane in the room the whole time. <br/><br/>Charlotte Lane was very calm, very composed. Last night, she even arranged for a group of people from Hundred Demons Pavilion to find Arthur North. <br/><br/>Yet, Amelie Quentin clearly felt that with the passage of time, Charlotte Lane’s aura gradually became colder, more ruthless, numb, and merciless. <br/><br/>She was repelling everything from the outside world while wrapping herself in layers of frost— the very layers of frost once melted by Arthur North were now being wrapped around again. <br/><br/>After another night, it was a little past 7 am. <br/><br/>Charlotte Lane’s counter-attack firmly defeated the X Hacker Alliance. <br/><br/>The hackers of Celestial Pivot led by Holt Lawrence immediately cooperated with Charlotte Lane, paralyzing the attackers’ computers and systems completely. <br/><br/>The crisis at Easton Group was over, and Charlotte Lane not only reinforced Easton Group’s defenses, but she also investigated the alliance thoroughly. <br/><br/>With their defeat, investigating them was easy. <br/><br/>Her investigations led her to the Platinum Burke Family. <br/><br/>This X Hacker Alliance had colluded with the Platinum Burke Family, who supported them from the shadows. <br/><br/>Charlotte Lane looked at the computer constantly monitoring Arthur’s location, which displayed no progress. <br/><br/>She looked at it for a while, a fierce murderous intent flashing in her eyes, then got up and walked outside. <br/><br/>A family like the Platinum Burke Family wouldn’t dare provoke Dark Radiance or Easton Group. <br/><br/>They wouldn’t dare even if Liam Davis had some level of influence. <br/><br/>Unless there was someone else promoting the Platinum Burke Family from behind, emboldening them to take this step.\t\t\t\t\t\t</div>", "images": {}, "success": true}