{"id": 533, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14909036.html", "title": "Chapter 530: 473: Arthur North……", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 530: 473: Arthur North……</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 530: Chapter 473: Arthur North......<br/><br/>Charlotte Lane came out of the restroom, and Kevin Clark was standing by the window, smiling at her.<br/><br/>“Fighting battles again?” Kevin asked gently.<br/><br/>“Eavesdropping?” Charlotte stared at him.<br/><br/>“Little girl, that’s the women’s restroom.” Kevin touched her face, “Is this how you see me in your mind? I saw that girl crying as she left.”<br/><br/>“Crying?” Charlotte asked, “So fragile.”<br/><br/>“Perhaps losing the contest was the main reason for her tears,” Kevin analyzed.<br/><br/>“Well, she had it coming,” Charlotte said.<br/><br/>Kevin laughed, and the two returned to the practice room together.<br/><br/>Charlotte and her team stayed until the banquet ended and chatted with Charles Flores for a while before leaving.<br/><br/>Charles Flores walked them to the entrance of the Court Music Academy, chatting with Charlotte the whole time.<br/><br/>Right after Charlotte got in the car, Charles Flores continued chatting with her through the window.<br/><br/>As Kevin was about to get into the car from the other side, Caroline Quinn suddenly came out of the Royal Court Music Academy and called out to him: “Arthur, wait a moment.”<br/><br/>Kevin turned to look at her, and Charlotte looked at her as well.<br/><br/>Caroline smiled at Kevin and then turned to Charlotte, apologizing, “Mrs. Clark, I’m sorry for causing you trouble today. I really heard that you play the pipa very well, so I wanted to challenge you. I didn’t expect to cause you any trouble.”<br/><br/>Charlotte sat in the car and looked at her, “Indeed, I do play the pipa very well, don’t I?”<br/><br/>Kevin slightly furrowed his brows; the more he thought about her words, the more awkward they seemed, as if she were teasing Caroline.<br/><br/>Especially Caroline’s smile, it made one feel uncomfortable: “It’s really good, very good.”<br/><br/>Charlotte didn’t show any particular expression, just continued looking at Caroline: “It was Celeste Martin who told you, wasn’t it?”<br/><br/>Caroline didn’t mention Celeste, as she didn’t like talking about others. She also wanted to handle the matters between her and Celeste herself. However, since Charlotte brought it up, she admitted it: “Yes.”<br/><br/>Charlotte said, “It’s because I have some private grievances with her that you were dragged into it.”<br/><br/>Caroline didn’t expect her to say that, so she gently shook her head.<br/><br/>He actually did sense her feeling of subtle loss but noticed that it quickly disappeared after he returned to the room and talked with her.<br/><br/>Or rather, it was quickly hidden.<br/><br/>The little girl seldom needed his extra consolation. Most of the time, she derived a sense of security and stability from him.<br/><br/>So often, he didn’t need to say much.<br/><br/>All he needed was to listen to the little girl speak or simply accompany her.<br/><br/>The arm Harton used to hold Charlotte’s waist began to tighten. After a while, he threw the hairdryer to one side and placed his hand on the back of her head, slowly caressing it.<br/><br/>Outside, it began to rain. The pattering rain floated into the room through the open window on the balcony.<br/><br/>Charlotte backed away slightly, opening her eyes to meet Harton’s gaze. She saw his red eyes and the bottomless desire within them.<br/><br/>The two locked eyes for a brief moment; Harton then caressed her face and kissed her again.<br/><br/>Her sleeping robe slipped off her shoulders, and Charlotte suddenly exerted force, pushing Harton onto the rocking chair behind them. She straddled him.<br/><br/>Both of them were wearing silk nightgowns, very thin, allowing them to feel each other’s body heat through the fabric.<br/><br/>Harton’s heartbeat raced, and a thin layer of sweat formed on his forehead. Touching Charlotte’s face, his voice was hoarse and tender as he asked, “Here?”<br/><br/>“Yes,” Charlotte replied softly.<br/><br/>The rain outside intensified, and soon, a wind began to blow.<br/><br/>The wind rocked the trees outside, constantly swaying back and forth. Occasionally, a stronger gust would cause them to sway even more violently.<br/><br/>Rainwater was blown onto the French windows, streaming down the glass.<br/><br/>Charlotte buried her face in Harton’s shoulder, her fingers trembling slightly as she clutched his clothes. After a while, she said, “Harton Clark...”<br/><br/>Harton tilted his head and kissed her ear, whispering teasingly, “Beg me.”<br/><br/>Although he said this, Harton still became more gentle.<br/><br/>Charlotte was forced into silence for a moment before her trembling voice uttered, “Just fucking kill me.”<br/><br/>Begging him was out of the question; if he had the guts, he should kill her.<br/><br/>Harton chuckled softly and then lifted Charlotte’s face and kissed her deeply once more.\t\t\t\t\t\t</div>", "images": {}, "success": true}