{"id": 531, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14909030.html", "title": "Chapter 528 - 471: Ensemble", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 528 - 471: Ensemble</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 528: Chapter 471: Ensemble <br/><br/>As the protagonist of today’s birthday banquet, Charles Flores was actually the most “leisurely”. <br/><br/>Others were busy introducing their apprentices, exchanging knowledge, and comparing skills. He needed to do none of these, as his apprentice was not around. <br/><br/>Hence, his foremost task today was engaging in endless conversations and attending to guests. <br/><br/>Everything around seemed to be related to him, yet somehow unrelated. <br/><br/>Until he suddenly heard the familiar sound of a pipa. <br/><br/>It was as if something had struck him, calling his wandering soul back. <br/><br/>Initially, he thought he had misheard. <br/><br/>But a few seconds later, he left the person he was conversing with, turned around, and headed into the crowd. <br/><br/>In his haste, he bumped into several people. <br/><br/>However, he paid no mind to that, even losing his usual elegance. <br/><br/>The sound of the pipa was near, and the person playing was in the crowd. <br/><br/>Charles Flores’ heartbeat quickened. <br/><br/>Finally, he pushed through to the front of the crowd and immediately looked towards the person playing the pipa. <br/><br/>He observed a stranger cradling the pipa that he recognized so well. <br/><br/>If it were any other time, seeing a stranger holding his apprentice’s pipa, he would surely be furious. <br/><br/>But staring at this stranger now, he felt neither anger nor comprehension. <br/><br/>Charlotte Lane was always an innovator, whether during experiments or while learning the pipa. <br/><br/>She was not rigidly attached to traditional techniques but innovated some methods to bring out the unique characteristics of the pipa to the fullest. <br/><br/>Charles Flores frequently used to say that Charlotte wasn’t merely learning to play the pipa; she was communicating with it. <br/><br/>She understood the pipa well and knew exactly how to present it. <br/><br/>This was a profound realm few could reach. <br/><br/>Although this person was a stranger, the technique of playing the pipa couldn’t lie. <br/><br/>It was unique to Charlotte Lane. <br/><br/>Charlotte Lane was always unique, irreplaceable by anyone. <br/><br/>Therefore, Charles Flores immediately confirmed the identity of the person. <br/><br/>The sound of the pipa gradually weakened, signalling the end. <br/><br/>Charlotte Lane, on the other hand, held her pipa single-handedly. <br/><br/>The family of three quickly exited the crowd, left the banquet venue, and went to the practice room in the nearest tower building. <br/><br/>As soon as they arrived, Kevin Clark hadn’t even got a chance to exchange a few words with Charlotte Lane before the door was pushed open again. <br/><br/>Charles Flores was standing at the entrance, with William Lane and Olivia Lane behind him. <br/><br/>Charlotte Lane was initially sitting on the table, but upon seeing Charles Flores, she instantly got off the table. <br/><br/>The master and apprentice locked eyes. <br/><br/>Touching her fingers, Charlotte Lane moved her lips slightly. <br/><br/>Watching her, Charles Flores’ eyes began to redden. <br/><br/>Then, Charlotte Lane made the first move. She walked over to the entrance, stood in front of Charles Flores, and whispered softly, “Teacher.” <br/><br/>Charles Flores couldn’t utter a reply, he just kept nodding, his eyes locked on Charlotte Lane. <br/><br/>Kevin Clark took Charles Amos out. <br/><br/>The practice room was left to the master and apprentice. <br/><br/>The remaining four people went to the end of the corridor. <br/><br/>Inside the practice room, the master and apprentice expressed their concerns for each other. At the end of the corridor, Olivia Lane and Charles Amos were complimenting Charlotte Lane, their words leaping out one after another. <br/><br/>In the end, it seemed like a competition; they even got carried away. <br/><br/>Kevin Clark and William Lane chose to ignore the two juveniles. <br/><br/>Charles Flores asked Charlotte Lane a lot about her life outside, constantly concerned if she was doing well. His words were full of joy and relief about Charlotte’s return. <br/><br/>The conversation eventually landed on Charlotte Lane’s fingers. <br/><br/>He asked if her fingers had been injured. <br/><br/>Even though it didn’t affect her pipa performance just now, Charles Flores still astutely perceived it. <br/><br/>Charlotte Lane nodded, telling him which fingers were severely injured. <br/><br/>Charles Flores was heartbroken. <br/><br/>The two chatted for over half an hour. If there hadn’t been so many people outside waiting for him to greet, Charles Flores might have kept chatting for hours. <br/><br/>Charlotte Lane set the time for their next meeting before Charles Flores left. <br/><br/>When he stepped outside, Charles Flores saw Kevin Clark and called out, “Third Master.” <br/><br/>The demoted Kevin Clark didn’t respond, but instead said, “Just call me Clark.” <br/><br/>Then Charles Flores joked, “I never thought there would come a day when I would receive such treatment. It’s all thanks to my apprentice.”\t\t\t\t\t\t</div>", "images": {}, "success": true}