{"id": 537, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14914988.html", "title": "Chapter 534: 477: Going To Mountain Sea Continent", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 534: 477: Going To Mountain Sea Continent</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 534: Chapter 477: Going to Mountain Sea Continent<br/><br/>“Sis, are you asleep?”<br/><br/>It was past 10 PM, and Olivia Lane came to Charlotte Lane’s door after taking a shower.<br/><br/>Charlotte’s door wasn’t locked, so she easily opened it.<br/><br/>“Not yet.” Charlotte was working on a design draft. Hearing Olivia’s voice, she shut off the tablet, “Come in.”<br/><br/>Olivia quickly entered the room and immediately takes a seat on her sister’s bed.<br/><br/>Charlotte, seated on the sofa by the French windows, raised an eyebrow when she saw her sister sitting on the bed.<br/><br/>“Sis, can I sleep with you tonight?” Olivia Lane sat on her bed, her legs swinging.<br/><br/>Charlotte raised an eyebrow: “What’s up?”<br/><br/>“Nothing, just want to sleep with you.” Olivia Lane tugged on her pajamas, “We used to always sleep together when we were kids.”<br/><br/>Charlotte looked at her, and after a while she said, “Okay.”<br/><br/>Olivia immediately perked up. She placed her cell phone on the bedside table and cheerfully pulled back the covers to lie on the bed. She then rolled around in the quilt, “You carry on with your work, no need to mind me.”<br/><br/>“I’m done.” After bidding goodnight to Kevin Clark through a message on her phone, Charlotte walked to the other side of the bed, turned off the ceiling light with the remote control, and also lay on the bed, “Going to sleep?”<br/><br/>Olivia grabbed her phone and quickly replied to a message, “Sleep, turn off the light.”<br/><br/>Charlotte then turned off the bedside lamp as well.<br/><br/>After they both settled down, Olivia Lane, just like when they were little, immediately touched Charlotte’s arm and hugged it, “Sis, take me to Mountain Sea Continent tomorrow.”<br/><br/>“Hm?”<br/><br/>“I haven’t been to Mountain Sea Continent, take me to see.” Olivia suggested.<br/><br/>“What’s so special about Mountain Sea Continent?” Charlotte asked puzzledly.<br/><br/>“Of course, all new places are worth seeing.” Olivia hugged her arm, “Sis, take me with you. I promise I’ll behave and not give you any trouble.”<br/><br/>“But it’s really hot over there now.”<br/><br/>“It’s okay, I’m not afraid of the heat.”<br/><br/>Charlotte laughed, “Will mom and dad agree? Will Brother agree?”<br/><br/>“At home, if you agree, everyone will agree.” Olivia responded, “I’ve already packed my stuff. Tomorrow, I can just grab my bag and go with you.”<br/><br/>“Okay, fine.” Charlotte agreed.<br/><br/>“You’ve agreed?”<br/><br/>“Yeah.”<br/><br/>“Thank you, sis.” Olivia cuddles her head on Charlotte’s shoulder, “I knew you’re the best.”<br/><br/>Charlotte patted her head lightly, “Better sleep now, we have to get up early tomorrow.”<br/><br/>“Alright.”<br/><br/>...<br/><br/>The next day, Olivia successfully accompanied Charlotte onto the flight to Mountain Sea Continent.<br/><br/>And to her surprise, not only was Kevin Clark, whom she anticipated, on the plane, but also Hugo Clark and Allonzo Hobson.<br/><br/>Charlotte held her and didn’t let her back away further: “Don’t be afraid, it won’t bite.”<br/><br/>“Ah?” Olivia was held by one hand by Charlotte and the other hand was held by Hugo<br/><br/>The Silver Palace sat in front of Charlotte, looking up at her.<br/><br/>Charlotte bent down and touched its head.<br/><br/>The tail of the Silver Palace immediately brushed the ground once.<br/><br/>“Would you like to touch it?” Charlotte said.<br/><br/>Olivia shook her head immediately: “I feel like it doesn’t seem to like me, it looks at me so fiercely.”<br/><br/>The Silver Palace was too big. When it walked, the muscles under its white fur were clearly visible.<br/><br/>Olivia thought that one swipe of its paw could kill her.<br/><br/>Later, the group went to the reception room.<br/><br/>The Silver Palace was always by the side of Charlotte.<br/><br/>Especially after sitting on the sofa, the Silver Palace directly jumped on the sofa and lay on Charlotte’s legs.<br/><br/>Charlotte was sitting with Kevin Clark on her right, and the Silver Palace on her left.<br/><br/>Olivia sat between Hugo Clark and Allonzo Hobson, grabbing the sleeves of the two. Watching Charlotte combing the wolf’s hair. She said, “Sis, you know it well?”<br/><br/>“Yes,” Charlotte said, “It’s called the Silver Palace.”<br/><br/>“Silver Palace?”<br/><br/>The Silver Palace opened its eyes and looked at her.<br/><br/>Olivia held her breath and said: “You sleep, you sleep. You don’t need to look at me. Don’t mind me. Your eyes are looking at me like you’re looking at food.”<br/><br/>“The Silver Palace won’t attack people randomly,” Hugo Clark said.<br/><br/>“You know it too?” Olivia looked at him.<br/><br/>Hugo nodded.<br/><br/>The Silver Palace indeed won’t randomly attack people, but he had never seen it so submissive towards anyone.<br/><br/>Not even towards his Third Uncle...<br/><br/>Towards his Third Uncle... at most they just have a mutually beneficial relationship.<br/><br/>I kill for you, you feed me meat.<br/><br/>What happened to his aunt when she came to the Mountain Sea Continent last time?<br/><br/>Allonzo also mentioned after returning home that there had been something absolutely unimaginable.<br/><br/>But he only said such a sentence and did not explain in detail.<br/><br/>Looking at it now, indeed there were some things he couldn’t even imagine.<br/><br/>The only possibility was... His aunt is Martin Hanzel.<br/><br/>This thought made Hugo’s head feel numb for a moment.<br/><br/>He unconsciously looked at Kevin Clark.\t\t\t\t\t\t</div>", "images": {}, "success": true}