{"id": 530, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14909027.html", "title": "Chapter 527 - 470: Not Bad", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 527 - 470: Not Bad</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 527: Chapter 470: Not Bad <br/><br/>Within the Court Music Academy, Celeste Martin’s pipa skills were among the best, and she had even received personal guidance from Charles Flores. <br/><br/>Charles Flores never easily instructed anyone unless he felt that the person had reached a certain level of proficiency and was worth cultivating, only then would he give some guidance. <br/><br/>Thus... Celeste Martin had great confidence in her pipa skills. <br/><br/>Of course, her confidence was soon validated. <br/><br/>Indeed, she played very well with a high level of performance. <br/><br/>She handled the details well and had a very strong expressiveness. <br/><br/>Few people could reach her level. <br/><br/>Being able to willingly receive guidance from Charles Flores, Celeste Martin indeed had something extraordinary about her. <br/><br/>In this matter, she had the capital to feel proud and arrogant. <br/><br/>Celeste Martin sat on the bench, with the powerful music radiating around her as the center, and the whole person sitting there seemed to be glowing. <br/><br/>More and more people gathered around, even Charles Flores, who had been conversing with someone in the distance, walked over and stood on the periphery, watching Celeste Martin through the gaps in the crowd. <br/><br/>Someone beside him said, “Master Flores, this student from the Court Music Academy has boundless potential.” <br/><br/>With a slight smile at the corners of his mouth, Charles Flores politely chuckled. <br/><br/>“Since you play so well... Master Flores can actually take on another disciple.” <br/><br/>Charles Flores looked at Celeste Martin, his eyes calm and indifferent: “Not bad.” <br/><br/>“Of course, it’s just ‘not bad’ compared to Master Flores.” <br/><br/>Charles Flores shook his head with a smile: “It’s just ‘not bad’ compared to my disciple too.” <br/><br/>The person next to him didn’t say anything further. <br/><br/>He had not seen Charles Flores’ disciple and didn’t know how proficient they actually were, he had only heard a little about them. <br/><br/>The girl in front of him already had a very high level of skill, but it was still only ‘not bad’. <br/><br/>At what level was his disciple then? <br/><br/>The Pipa music stopped, and the surrounding area was once again filled with enthusiastic applause and generous praise. <br/><br/>Charles Flores also looked away, not particularly interested in what was going to happen next. He and the person beside him continued their earlier conversation as they walked further back. <br/><br/>Celeste Martin got up with her pipa in her arms and gave a slight bow to the people around her before looking towards Daisy Zane. <br/><br/>“Plectrum,” Olivia Lane handed her another box. <br/><br/>With plectrum in hand, Olivia Lane stepped aside with the Pipa case, as Charlotte Lane took the Pipa and walked to the stool. <br/><br/>She carried the stool with one hand and took a few steps towards Arthur North, put it down, and looked at him. <br/><br/>Their eyes met, and Arthur North raised his eyebrows. The look in his eyes was one of expectation for her. <br/><br/>Charlotte Lane gave a slight smile, retracted her gaze, and sat down on the stool. <br/><br/>She cradled the Pipa, tested the sound, and then tuned it. <br/><br/>It hadn’t been used in many years; moreover, someone must have been taking care of it regularly, so its pitch accuracy was slightly off. <br/><br/>Celeste Martin stood by with a challenging smile, waiting to see what would happen. <br/><br/>Once the tuning was done, Charlotte Lane simply warmed up her fingers. <br/><br/>She then held the Pipa properly, placed her left hand on the strings, and began to play. The familiar tune of the Court Music Academy filled everyone’s ears once more. <br/><br/>It had been a piece of piano music just now, and now it was a piece of Pipa music. <br/><br/>Charlotte Lane’s fingers were beautiful, slender and fair, like priceless white jade. <br/><br/>As she held the Pipa and her right hand’s plucking techniques kept changing, her speed was fast enough to leave afterimages. <br/><br/>Yet every note was incredibly accurate, and each transition was smooth. <br/><br/>The tune was aggressive from the very beginning, requiring the player to produce a powerful momentum. However, Charlotte Lane managed to create an even more intense atmosphere based on that foundation. <br/><br/>She did not exaggerate her performance and maintained a calm, composed demeanor while holding the Pipa and sitting gracefully on the stool. Occasionally, she would glimpse at the Pipa, but most of the time, she simply closed her eyes and felt the music. <br/><br/>The contrast between the calmness of the person and the excitement of the tune created a powerful feeling, suggesting that one could control everything. <br/><br/>No matter how things change, be it a gentle stream or passionate vigor, they are always under one’s control. <br/><br/>Therefore, one can remain calm and detached, unfazed by any ups and downs. <br/><br/>It is difficult to reach this state, whether in life or in playing the Pipa. However, some people do manage to achieve it. <br/><br/>Celeste Martin’s smug expression changed as soon as Charlotte Lane played the first note and continued to evolve as the performance went on. <br/><br/>She couldn’t believe the sight before her and felt a surge of dizziness in her head. The more she tried to remember something, the less she could recall. <br/><br/>She even gradually lost the understanding of why she was standing there. <br/><br/>As she wanted to leave, her legs felt as if they were filled with lead, unable to move. <br/><br/>Astonished as well was Charles Flores, who had been chatting on the periphery of the crowd.\t\t\t\t\t\t</div>", "images": {}, "success": true}