{"id": 535, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14909042.html", "title": "Chapter 532: 475: Dancing", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 532: 475: Dancing</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 532: Chapter 475: Dancing<br/><br/>Old Master Lane’s sudden question made William Lane choke on his tea.<br/><br/>Over the years, William Lane would discuss everything with Old Master Lane, especially when he couldn’t make a decision.<br/><br/>Old Master Lane would always provide him with the necessary help.<br/><br/>But there were very few times when he made decisions for him.<br/><br/>He would always analyze the situation and let William Lane make the decision himself.<br/><br/>Because he knew that William Lane wasn’t clueless about what to do; he was just used to having a supportive voice.<br/><br/>Moreover, sometimes Old Master Lane would also pose questions about the situation to William.<br/><br/>Listening to his thoughts and his insights.<br/><br/>So, a question like today’s was quite normal.<br/><br/>But today’s felt a bit different.<br/><br/>He couldn’t quite pinpoint where the difference was.<br/><br/>It felt like being taken back to his childhood, when he and Kevin Clark would sit together, occasionally joined by a young Lila.<br/><br/>The three of them would be questioned together.<br/><br/>Back then, they didn’t understand much, so sometimes their answers were off.<br/><br/>And because of that, they would sometimes reject questions.<br/><br/>Compared to William’s reaction, Kevin Clark was much more composed.<br/><br/>He said, “Let nature take its course. If he has the ability to take over, that’s great. After all, he was appointed by Dean Yue, so supporting him, both publicly and privately, is the right thing to do. But if he doesn’t have the ability, then we’ll have to replace him. Stability in the Research Institute is the priority.”<br/><br/>The Dean has the power to designate a successor.<br/><br/>Once designated, the successor would qualify to take over if more than half of the families in the Research Institute agreed.<br/><br/>After taking office for half a year, there would be another vote.<br/><br/>Only if more than half still agreed could they officially take up the post.<br/><br/>Old Master Lane nodded, “What about you, Lila? What do you think?”<br/><br/>Lila looked at Old Master Lane and hesitated before saying, “The person I trained shouldn’t be bad.”<br/><br/>Old Master Lane looked at William Lane again.<br/><br/>William Lane said, “Grandfather, don’t look at me. One Lane Family is enough for me to deal with, I really don’t have that much energy.”<br/><br/>“You can let your sisters handle the Lane Family,” Old Master Lane said.<br/><br/>William Lane looked at Lila and Olivia Lane.<br/><br/>Actually, she danced very well.<br/><br/>Charlotte Lane chuckled, “Technically, since I learned from my mom when I was so young, I should be their senior. But because I didn’t learn well, my mom stripped me of that title. The title of junior was given to me because I am her daughter.”<br/><br/>Kevin Clark slightly raised the corner of his lips, “We have an unspoken bond, both of us not following our mothers’ professions.”<br/><br/>“I followed my father’s profession,” Charlotte Lane said, “I’m doing pretty well in the hacker community. My dad taught me when I was little. That should count.”<br/><br/>“It counts.” Kevin Clark touched her face and said, “You’ve surpassed your teacher. The word ‘good’ doesn’t do justice to your abilities.”<br/><br/>“Your flattery, Third Master, is getting more and more practiced,” Charlotte Lane said, then looked at the trophies on the wall. After a while, she looked back at Kevin Clark and said, “Would you like to see me dance?”<br/><br/>“Am I really that fortunate?” There was a hint of surprise in Kevin Clark’s eyes, as he hadn’t expected her to take the initiative to offer.<br/><br/>“Yes,” Charlotte Lane replied, “But... you might be better off watching the practice going on in another practice room.”<br/><br/>“But they’re not you,” Kevin Clark said.<br/><br/>Charlotte Lane raised her eyebrows and led Kevin Clark into an empty rehearsal room.<br/><br/>She glanced at the chair next to the mirror and said, “Sit.”<br/><br/>Kevin Clark sat down as instructed.<br/><br/>Charlotte Lane picked a music at random on her cell phone, but she didn’t connect to the speaker. After playing the music, she put her cell phone on top of the speaker. Then, she took a hair tie from Kevin Clark’s pocket and turned her high ponytail into a hair bun.<br/><br/>After fixing her hair, she stood in the middle of the practice room, did some simple stretches, then chose a random starting point, entered the music, and followed the beat.<br/><br/>The impromptu performance somewhat caught her off guard.<br/><br/>So, she simply showed off her skills.<br/><br/>She performed on-the-spot aerial turns, leg lifts, four-position turns, step-up aerial turns, whip turns...<br/><br/>For each skill, Charlotte Lane did at least six rotations as a base. Sometimes, she would do more than ten rotations for a single skill.<br/><br/>Moreover, she performed several techniques one after another, without any pause. Her speed was so fast that her arms and hair created afterimages.<br/><br/>Today, she was wearing a simple white T-shirt and a pair of blue skinny jeans. The white T-shirt was tucked into her jeans.<br/><br/>It was simple and elegant.<br/><br/>When she danced, she looked refreshingly refined.<br/><br/>She performed front flips in the cloud, leaps with front flips, bridge, leg lifts, and kicks...<br/><br/>One technique after another.<br/><br/>When she bent her waist, she was so flexible, she seemed boneless.<br/><br/>Because of the movement, her white T-shirt came untucked from her jeans, revealing her fair waist...<br/><br/>Kevin Clark was initially immersed in her technique, but when he saw her waist, he narrowed his eyes slightly...\t\t\t\t\t\t</div>", "images": {}, "success": true}