{"id": 534, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14909039.html", "title": "Chapter 531: 474: This Person Is A Bit Scheming", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 531: 474: This Person Is A Bit Scheming</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 531: Chapter 474: This Person is a Bit Scheming<br/><br/>From the rocking chair in the room to the bathroom.<br/><br/>After being bathed again and brought out, Charlotte Lane glanced at the time and closed her eyes, not wanting to open them again.<br/><br/>It was already past three’o’clock in the morning...<br/><br/>He was still so energetic.<br/><br/>She used to say that Harton Clark had great stamina...<br/><br/>What she thought was good at the time, now thinking about it, she still underestimated him.<br/><br/>Charlotte Lane thought about it, turning to her side and falling asleep.<br/><br/>Harton Clark finished tidying up the bathroom and came out after taking a shower. Charlotte Lane had already fallen asleep.<br/><br/>He walked gently to the side of the bed and looked at the sleeping person.<br/><br/>After taking a bath, Charlotte Lane did not wear a sleeping robe but opted for a camisole. Now lying on her side in bed, the quilt was draped over her waist.<br/><br/>The tattoo on her left arm was revealed due to the rising temperature of her body.<br/><br/>At first, she didn’t allow the tattoo to be seen, always hiding it.<br/><br/>After Martin Hanzel’s identity was exposed, she no longer covered the tattoo.<br/><br/>Every time her body temperature increased, the tattoo would show.<br/><br/>Looking at her fair arm, Harton Clark swallowed as his eyes were drawn to the bright red tattoo.<br/><br/>Perhaps it was psychological, but every time he kissed this spot, Charlotte Lane seemed to think of her previous training, which made her especially sensitive.<br/><br/>After looking at her for a while, Harton Clark closed his eyes, shook his head lightly, and suppressed the rising urge within him.<br/><br/>Then he leaned down and gently kissed the tattoo on her arm.<br/><br/>Charlotte Lane, who had been sleeping soundly, moved her arm slightly and then opened her eyes.<br/><br/>“Why did you wake up?” Harton Clark kissed her forehead.<br/><br/>“Who are you pretending to be gentle for now?” Charlotte Lane’s eyes were hazy, and her voice was hoarse.<br/><br/>Harton Clark held her hand, gently squeezing it as he laughed softly, “I was gentle just now, too.”<br/><br/>Charlotte Lane snorted coldly but did not refute, instead turning over with her back to him, saying, “Are you going to sleep or not?”<br/><br/>“Yes.”<br/><br/>Harton Clark went to the other side of the bed, lay down, held Charlotte Lane in his arms, and kissed the top of her head, “Sleep.”<br/><br/>“Mm-hmm.” Charlotte Lane responded groggily.<br/><br/>...<br/><br/>Turner Daniel passed his final exams smoothly, and after his original professor retired, Charlotte Lane formally started mentoring him.<br/><br/>Although Turner Daniel’s undergraduate studies were not in the same field, he had developed a great talent in the area due to the influence and guidance of his father and grandfather since childhood.<br/><br/>“Hmm, Charlotte just told me,” Andrew Lane’s tone didn’t seem guilty at all.<br/><br/>Charlotte watched her father while eating her cake with a fork.<br/><br/>“You only found out because my sister told you,” William finished speaking, “So come pick me up.”<br/><br/>“How old are you? And you still need someone to pick you up? Moreover, you’re in your thirties, what’s the deal with still living at home?” Andrew Lane not only didn’t feel guilty but seemed somewhat disgusted.<br/><br/>William Lane: “......”<br/><br/>Charlotte listened silently to her father’s double standard.<br/><br/>“Kevin Clark is a year younger than you, and he’s been married for almost a year,” Andrew Lane found a reason out of nowhere, “Look at you.”<br/><br/>“Fine, I won’t come home tonight,” William Lane finished speaking and then landed a fatal blow, “My sister’s computer is still with me, tell her to use it tomorrow morning.”<br/><br/>“Wait a minute!” Andrew Lane said, “Come back tonight first.”<br/><br/>Then the voice of Kevin Clark came from the phone, “Okay, Uncle Lane. I’ll take him home.”<br/><br/>Thinking that he wouldn’t have to turn back, Andrew Lane immediately agreed, “Alright, so be it.”<br/><br/>After William hung up the phone, he glanced at the cunning person beside him.<br/><br/>Kevin Clark took out his car key, smiled, and said, “Let’s go.”<br/><br/>William Lane gritted his teeth.<br/><br/>This guy not only showed off in front of his father-in-law but also managed to legitimately stay at the Lanes’ house tonight.<br/><br/>...<br/><br/>That night, Kevin Clark had dinner at the Lanes’ and even drank some wine.<br/><br/>Then, as a matter of course, he couldn’t drive due to having consumed alcohol and ended up staying at the Lane’s residence.<br/><br/>After dinner, everyone sat in the living room for a while, watching TV and chatting.<br/><br/>Old Master Lane watched TV for a while and suddenly said, “I heard that Turner Daniel wants his grandson to succeed as Dean?”<br/><br/>“Dad, you’ve heard of it too?” Andrew Lane asked.<br/><br/>Old Master Lane nodded, “The news has been spreading quickly over the past few days. I’ve also heard a little bit about it.”<br/><br/>Charlotte always felt that there was something wrong with this, “Isn’t the news spreading too quickly?”<br/><br/>Kevin Clark, sitting next to her, peeling pistachios, said, “Ezekiel Santiago was targeted the moment he entered the Research Institute. Any small disturbance would be amplified. It’s expected that the news spread quickly.”<br/><br/>Andrew Lane said, “The situation was even worse when Ezekiel Santiago’s father joined the Research Institute. He was closely watched and couldn’t stand it, so he wrote a letter of commitment, promising never to take over the Research Institute, and that’s when things subsided.”<br/><br/>Charlotte had heard some of the stories about Turner Daniel’s father, so Turner Daniel wanted his grandson to take over directly.<br/><br/>“But everyone has asked the Dean for clues, and he hasn’t given a clear answer. Now it’s just speculation.” William Lane said, “At least now it seems calm on the surface.”<br/><br/>Everyone agreed with this view.<br/><br/>Then Old Master Lane said again, “What do you think about Turner Daniel becoming Dean?”\t\t\t\t\t\t</div>", "images": {}, "success": true}