{"id": 538, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14914992.html", "title": "Chapter 535 - 478: Lost Contact", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 535 - 478: Lost Contact</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 535: Chapter 478: Lost Contact <br/><br/>On the second day of their arrival at the Mountain Sea Continent, Charlotte Lane left a box of snacks brought by Sophie Ortiz and Aunt Cruz for Edward Darkmoon, and another box for the Hundred Demons Pavilion. <br/><br/>Logan, who rarely returned to the Mountain Sea Continent, found himself unable to leave for half a month after coming back. <br/><br/>Being exploited by his own brother, he had to work hard without making any money. <br/><br/>As he wondered how to escape back to the M Continent without getting scolded every day, Charlotte Lane brought Kevin Clark and Olivia Lane to visit. <br/><br/>Logan, who had been preparing to “run away from home” at any moment, immediately changed his mind about leaving. <br/><br/>“Big Boss! Why didn’t you say you were coming? I missed you so much.” Logan came down the stairs and, halfway down, leaped off to the side and walked up to Charlotte Lane, wanting to hug her. <br/><br/>But the moment she stretched out her hand, Charlotte Lane was pulled back a bit. <br/><br/>Logan’s raised hand froze as he looked at Kevin Clark, who pulled her back. Instantly, murderous intent filled the air: “What are you doing here?” <br/><br/>“I’m naturally accompanying my lady.” Kevin Clark’s voice was light, but it was obvious he was deliberately trying to annoy Logan. <br/><br/>“Who’s your lady?” Logan’s facial features were very pronounced, and just a slight cold expression made him appear aggressive. <br/><br/>The surrounding air suddenly solidified, and it seemed as if a string was stretched between Kevin Clark and Logan – Logan was pulling the string one-sided, but Kevin Clark had no intention of letting go. <br/><br/>Charlotte Lane raised her hand to scratch the corner of her eyebrow and was about to speak, but a voice came from upstairs before she had a chance. <br/><br/>“Camilia, you’re being too rude.” Luke said while coming down from upstairs. <br/><br/>Logan quieted down a bit but still glared at Kevin Clark. <br/><br/>Olivia Lane watched the man coming down from the second floor: blonde hair, white skin, and blue eyes. He had deep eye sockets and a high nose. <br/><br/>He looked like a man who had stepped out of a comic. <br/><br/>Olivia Lane was immediately mesmerized. <br/><br/>Luke walked up to Charlotte Lane and smiled, “Big Boss.” <br/><br/>Charlotte Lane responded. <br/><br/>Then he looked at Kevin Clark and extended his hand: “Third Master.” <br/><br/>Kevin Clark shook hands with him. <br/><br/>Luke said, “I’m sorry, my sister can be like this. Please be understanding.” <br/><br/>Kevin Clark raised his eyebrows but didn’t say anything. <br/><br/>Then Luke looked at the person beside Charlotte Lane, “Boss, this is...” <br/><br/>“My sister.” Charlotte Lane led Olivia Lane to the seating area. <br/><br/>“Sister?” Logan immediately followed Olivia Lane, carefully looking her over, “Sister from where?” <br/><br/>He just sent her a message, saying that he would be out for a trip and would be back in the evening. <br/><br/>When Charlotte Lane returned to the Dark Radiance in the afternoon, Adrian Roberts and Thomas Firway also told her about Kevin’s departure, but Charlotte didn’t ask more, and they didn’t say more. <br/><br/>However, Kevin didn’t return that night. <br/><br/>Charlotte Lane finished dinner and slept for a while. When she woke up, she found that her sent message had not received a reply. <br/><br/>She faintly felt that something was wrong and immediately checked Kevin’s location, but couldn’t find it. <br/><br/>Even the locations of Yoshua Archer, Edward Darkmoon, and the people they took with them couldn’t be found. <br/><br/>The signal was being interfered with. <br/><br/>Charlotte Lane had the computer monitor their location and immediately went out to look for Adrian Roberts. <br/><br/>Hugo Clark happened to be outside. Seeing her serious expression, he asked, “Auntie, what’s wrong?” <br/><br/>“Where did Kevin go today?” Charlotte Lane asked. <br/><br/>“Third Uncle went to see Adam Scott today.” Hugo Clark said, “Is there a problem?” <br/><br/>Adam Scott, Robinson Scott’s father. <br/><br/>“I can’t contact him.” Charlotte immediately called Adam Scott: “Uncle Scott, is Kevin still with you?” <br/><br/>On the other side, Adam Scott said that Kevin had left long ago and should have arrived at Dark Radiance according to the time. <br/><br/>Charlotte Lane hung up the phone and went through the entire map of Mountain Sea Continent in her head. She wondered where there would be no signal at all, where they couldn’t locate it at all. <br/><br/>Or maybe someone deliberately interfered. <br/><br/>“Auntie.” <br/><br/>“I can’t contact Kevin, and I can’t locate them.” Charlotte Lane said, “Their signal has been shielded. How many people did he bring when he left?” <br/><br/>“Apart from Yoshua Archer and Edward Darkmoon, he brought a team of people.” Adrian Roberts said. <br/><br/>Since they were going to see Adam Scott to discuss a contract renewal, they didn’t bring many people. <br/><br/>Yoshua Archer and Edward Darkmoon were bored at Dark Radiance and joined in the trip. <br/><br/>“I’ll take some people to find them,” Charlotte Lane said as she walked out. “Captain Mason, call four teams of people.” <br/><br/>“Yes.” <br/><br/>Hugo Clark followed her and said, “Auntie, you stay, I’ll go.” <br/><br/>“You stay behind,” Charlotte Lane said, “If someone is really targeting Kevin, and this precisely, I’m afraid Dark Radiance is also in their plan. Guard here.” <br/><br/>Hugo’s eyebrows knitted. <br/><br/>Charlotte Lane didn’t get his response, and she looked at him, “You are more commanding here than I am. Also, protect Olivia.”\t\t\t\t\t\t</div>", "images": {}, "success": true}