{"id": 543, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14915015.html", "title": "Chapter 540: 483: Feeling A Bit Wronged…", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 540: 483: Feeling A Bit Wronged…</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 540: Chapter 483: Feeling a Bit Wronged...<br/><br/>Kevin Clark wore the same black combat suit as Charlotte Lane. Due to the lack of rest, the corners of his eyes were red and there were bloodstains on his neck.<br/><br/>There was a cut on the left sleeve of his clothes, as if it had been slashed by a knife.<br/><br/>He was wrapped in a murderous aura, looking like a demon that had just emerged from hell.<br/><br/>With every step, he took a life.<br/><br/>Charlotte Lane stopped when she saw him for an instant and then continued to fight, casting glances at Kevin Clark.<br/><br/>Her dog, Silver Palace, was around her – pouncing, biting, extremely ferocious, with much blood staining its white fur.<br/><br/>Kevin Clark quickly approached, and Allonzo Hobson and Thomas Firway followed, quickly dealing with the people around them.<br/><br/>“Little girl.”<br/><br/>Having taken care of the people around her, Charlotte Lane looked at Kevin Clark. Her eyes seem puzzled as she gazed for one moment.<br/><br/>She seemed a little unsure of what she was seeing and didn’t understand why Kevin Clark would be there.<br/><br/>She even wondered if she was experiencing a hallucination.<br/><br/>Kevin Clark immediately hugged her briefly, touching her head. Then he quickly let go, kissed her brow and asked, “What, don’t recognize me?”<br/><br/>Charlotte Lane looked at his face with her lips moving slightly, but she remained silent.<br/><br/>“It’s me. I’ll explain when we get back.” Kevin Clark looked at her body, her hands, and touched the red marks on her neck. “Where’s your gun?”<br/><br/>Charlotte Lane lowered her gaze, looking at Kevin Clark’s body, and replied, “No more bullets.”<br/><br/>Kevin Clark sensitively noticed that her voice was cold with a tinge of unnoticeable grievance.<br/><br/>“And the person I wanted to shoot is out of range.” Charlotte Lane’s voice became colder as if to hide that grievance, but it was still ineffective in Kevin Clark’s ears.<br/><br/>Everyone around her was engaged in close combat, and the gun was of no use. Furthermore, Alice Eugene was out of firing range, so having bullets wouldn’t matter anyway.<br/><br/>So, she opted not to grab anyone’s gun and wielded two daggers instead.<br/><br/>It allowed her to kill faster.<br/><br/>Seeing Charlotte Lane like this for the first time, Kevin Clark felt his heart soften. He immediately handed his gun to her, “Go, deal with her.”<br/><br/>Charlotte Lane caressed the gun in her hand and looked outside towards the reception room.<br/><br/>Alice Eugene had become hidden and was out of sight.<br/><br/>“Silver Palace, let’s go.”<br/><br/>Having shaken off a person from its feet, Silver Palace leaped towards the direction Charlotte Lane was looking at, leading the way.<br/><br/>“Big Boss...” Yoshua called out to Kevin Clark when he came over.<br/><br/>Charlotte Lane glanced at the situation and quickly walked out.<br/><br/>Kevin Clark said, “Have some people guard the surrounding area, expand the scope, be more careful, and find the exit. Edward, crack the passwords.”<br/><br/>Yoshua and Edward immediately responded, “Yes!”<br/><br/>Kevin Clark hurriedly followed Charlotte Lane.<br/><br/>Dark Radiance and the Hundred Demons Pavilion members had come in, and the fighting gradually stopped.<br/><br/>Charlotte Lane went to find Liam Davis and the Housemaster.<br/><br/>This was the Platinum Burke Family, and the secret room was right here, but these two had not managed to escape.<br/><br/>Because when Alice arrived, both of them felt they had someone to rely on.<br/><br/>But they didn’t expect that Alice wouldn’t have time to take care of them.<br/><br/>As soon as Alice reached the entrance of the reception room, Charlotte Lane asked James Cooper to deal with the two of them. So James Cooper and a Hall Master came out of the reception room and took care of them first.<br/><br/>The Housemaster seemed to have suffered severe injuries, barely able to speak coherently anymore.<br/><br/>Compared to him, Liam Davis was much better. Even though his face was bruised and his clothes were covered in footprints, he still seemed to be able to move around with some difficulty.<br/><br/>Charlotte Lane found them and looked at the Housemaster before turning to Liam Davis, asking, “What’s the password for the secret room?”<br/><br/>Liam Davis looked at her and chuckled before whispering hoarsely, “Daisy Zane, you want to know, don’t you? Well, I won’t tell you.”<br/><br/>The color in Charlotte Lane’s eyes deepened as she grabbed Liam Davis’s throat and pressed him down onto the ground.<br/><br/>Liam Davis’s breathing suddenly became difficult, his chest heaving and one leg constantly kicking the ground. His bloodshot eyes glared at Charlotte Lane.<br/><br/>Charlotte Lane squatted beside him, her hand gradually increasing the pressure, “The password, and where does it lead?”<br/><br/>“I, won’t, won’t say it.”<br/><br/>Kevin Clark was watching the Housemaster nearby, thinking that since he couldn’t speak clearly, he could try to have him write it down, but he found that the Housemaster’s mind wasn’t clear, which was why he couldn’t speak coherently.<br/><br/>This path wouldn’t work, so he looked at Charlotte Lane, “Little girl, spare some breath.”<br/><br/>Charlotte Lane let go of her hand.<br/><br/>Liam Davis lay on the ground as if he was dead, then after a few seconds, he suddenly took a deep breath like he had resurrected.<br/><br/>“Will you say it?” Charlotte Lane asked again.<br/><br/>Liam Davis took a moment to recover, then he laughed and said hoarsely, “I won’t say it even if I die! Hahaha! No one... should think... that they can get away with it! I won’t, won’t tell you.”\t\t\t\t\t\t</div>", "images": {}, "success": true}