{"id": 544, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14915019.html", "title": "Chapter 541: 484: It Has Always Been You", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 541: 484: It Has Always Been You</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 541: Chapter 484: It Has Always Been You<br/><br/>Liam Davis’s laughter sounded like annoying, noisy interference in her ears.<br/><br/>Charlotte Lane couldn’t stand it anymore, she got up and kicked him in the leg.<br/><br/>Liam Davis immediately stopped laughing, rolled on the ground, and couldn’t get up right away.<br/><br/>Kevin Clark gripped Charlotte’s hand, “Take a break.”<br/><br/>Charlotte Lane stepped back and Kevin Clark crouched down.<br/><br/>Liam Davis moved his eyes to Kevin Clark as if he realized something. He muttered, “Height 190cm, slim waist, long legs...fair skin, good-looking, unique temperament. From a wealthy family...and successful career. Nice voice, even sings Peking Opera.”<br/><br/>Although his voice was barely audible, Kevin Clark listened carefully. He raised his eyebrows in confusion.<br/><br/>“Kevin, it’s you, isn’t it?” Liam Davis said with his eyes closed.<br/><br/>“I do fit the description. What’s the matter?” Kevin Clark’s deliberately slowed down his speech.<br/><br/>“Two years ago, Daisy Zane told me her criteria for a partner.” Liam Davis suddenly coughed twice. “It’s always been you.”<br/><br/>Kevin Clark’s eyelashes fluttered a bit.<br/><br/>They got together in the spring of last year.<br/><br/>Two years ago...<br/><br/>Kevin Clark suddenly turned his head to look at Charlotte Lane.<br/><br/>Charlotte Lane met his gaze, looking at the smile spreading in his eyes. She hesitated, then turned away and walked out.<br/><br/>“Little girl...”<br/><br/>Charlotte Lane didn’t hear him and walked faster.<br/><br/>Kevin watched her retreating figure and chuckled lightly.<br/><br/>...<br/><br/>Charlotte Lane went to watch the family getting raided, looking for the Platinum Burke Family. The Burke family members were being taken away in groups.<br/><br/>Just as she reached the entrance of the reception room, she saw Amelia Miles being helped out of the side hall.<br/><br/>Amelia Miles was supported and walked without any significant issues.<br/><br/>Some time had passed, and she seemed to be recovering a little.<br/><br/>The wounds had been treated simply.<br/><br/>Many parts of her body had been cut by debris, and her clothes were stained with blood.<br/><br/>But she had changed into clean clothes now, her broken arm had been treated, wrapped in gauze, and was hanging around her neck.<br/><br/>Amelia Miles suddenly struggled.<br/><br/>Like a fish dropped into boiling oil, she jerked violently yet quickly wilted again.<br/><br/>When Charlotte Lane saw her like this, she let go of her, shaking off the blood on her hands and let someone take her away.<br/><br/>She didn’t look at Amelia Miles again, but lowered her head, using the gauze she carried on her body to wipe the blood from her hands.<br/><br/>It wasn’t until William Lane handed her a pack of wet wipes.<br/><br/>She took them, lightening her movements as she wiped the blood from her hands.<br/><br/>“Brother.”<br/><br/>“Hm?”<br/><br/>“Did you see it?” Charlotte Lane asked.<br/><br/>William Lane knew she was talking about the incident just now, and he replied, “Yes.”<br/><br/>After his response, the two fell silent for a moment.<br/><br/>After a while, Charlotte Lane looked at him. The determination in her eyes hadn’t dissipated, and with a broken-hearted, past-breaking feeling, she said softly, “I may not be able to go back to how I was before.”<br/><br/>William Lane looked at her emotionless face and paused before saying, “But you’ll always be Grandfather’s most beloved granddaughter, our parents’ beloved daughter, and my favorite sister. Also, Amelie Quentin’s best sister.”<br/><br/>Hearing his words, the emotions in Charlotte Lane’s eyes gradually dissipated, and she raised a corner of her mouth, “Am I not your best sister?”<br/><br/>Seeing her finally smile, William Lane also laughed, “All of you are my best sisters.”<br/><br/>“So Young Master Lane is actually a master of balancing,” Charlotte Lane leaned against the wall.<br/><br/>“Not bad, I’m striving to balance.” After saying that, William Lane looked at the silver palace lying down at her feet, “How come it listens to you so much?”<br/><br/>“Don’t you already have an answer in your heart?” Charlotte Lane asked back.<br/><br/>William Lane looked at her, his entire being seemingly petrified.<br/><br/>To guess was one thing, to be right was another.<br/><br/>The fact that Silver Palace followed her like this indeed made him suspicious.<br/><br/>Moreover... her martial prowess was very high and she coordinated well with Yoshua and Edward.<br/><br/>With just one look, they knew what to do next.<br/><br/>The most important point was... after Harton Clark’s visit to the Mountain Sea Continent. The pursuit of Martin Hanzel had no follow-up.<br/><br/>His sister was Martin Hanzel.<br/><br/>The first assassin under the Dark Radiance Banner.<br/><br/>Faking death, being sentenced and hunted down...\t\t\t\t\t\t</div>", "images": {}, "success": true}