{"id": 548, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998855.html", "title": "Chapter 545: 488: Meddling In Your Relationship", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 545: 488: Meddling In Your Relationship</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 545: Chapter 488: Meddling in Your Relationship<br/><br/>After dinner, Charlotte Lane went to see Silver Palace again.<br/><br/>Arthur North and Hugo Clark discussed some matters, but as soon as they were finished, they couldn’t find her.<br/><br/>They asked Thomas Firway and found out she went to see Silver Palace.<br/><br/>When Arthur found her, Charlotte was sitting on the ground cross-legged, hugging Silver Palace and staring blankly.<br/><br/>Charlotte didn’t react to the sound of his footsteps, but Silver Palace looked up at him warily.<br/><br/>Arthur North interpreted the unfriendly meaning from Silver Palace’s eyes, but it only looked at him without making any aggressive moves.<br/><br/>Anyway, this wolf... In all these years with Dark Radiance, he had grown accustomed to its attitude towards him.<br/><br/>Arthur ignored its glare, walked behind Charlotte, and patted her head: “What are you thinking about? The ground is cold.”<br/><br/>Charlotte’s eyelashes trembled slightly, “It’s not cold.”<br/><br/>Since she didn’t get up, Arthur crouched down, turned Silver Palace’s head to the side, and kissed Charlotte’s cheek, “What’s on your mind?”<br/><br/>“I’m thinking about how to convince you to let me sleep with Silver Palace tonight.” Charlotte looked at him and said softly.<br/><br/>“No way.” Arthur North rejected her very firmly, “No convincing will work.”<br/><br/>“Stingy.” Charlotte said, “It’s just a wolf.”<br/><br/>“But it’s a male.” Arthur held her chin, pinched her face, and said fiercely, “It’s already very generous of me to let you hug it.”<br/><br/>After saying that, Arthur stood up and pulled her up, “Alright, let’s go.”<br/><br/>Silver Palace suddenly stood up, stumbled a bit, and looked even more ferocious at Arthur.<br/><br/>Arthur glared back at it, then took Charlotte’s hand and left.<br/><br/>They walked about ten meters before slowing down.<br/><br/>“Third Uncle...”<br/><br/>“Shut up.”<br/><br/>Charlotte laughed out loud.<br/><br/>Arthur gently squeezed her hand: “And you’re still laughing.”<br/><br/>Charlotte poked his side with her other hand: “Are all men in their thirties like this?”<br/><br/>Arthur suddenly stopped, let go of her hand, and looked at her sideways.<br/><br/>He felt that the little girl was very polite for not adding the word “old” in front of “man.”<br/><br/>Charlotte looked at Arthur.<br/><br/>The warm yellow street lamp behind him cast both light and shadows on him.<br/><br/>When she reached the entrance of the Meeting Room, she knocked on the door twice before opening it.<br/><br/>That’s when she saw Kevin Clark and William Lane “embracing” each other.<br/><br/>Kevin had one hand pressed against William’s chest while William gripped Kevin’s shirt tightly with his other hand. Kevin’s other hand was holding the wrist of the hand gripping his shirt.<br/><br/>The two men were very close.<br/><br/>And the Meeting Room was a total mess.<br/><br/>Chairs were overturned and toppled, the conference table was askew, and several paintings had fallen from the walls.<br/><br/>They had probably been fighting for a while.<br/><br/>Neither of them appeared injured as they didn’t go all out, but the Meeting Room was in a sorry state.<br/><br/>When they heard the door opening, they both looked towards it, then froze as they saw Charlotte standing there.<br/><br/>Charlotte hesitated for a few seconds, then took a step back, saying as she prepared to close the door, “Sorry for interrupting, you two can continue.”<br/><br/>Kevin Clark and William Lane both gave each other a push, then walked towards the door.<br/><br/>“Little Girl.”<br/><br/>“Charlotte.”<br/><br/>The two of them pulled open the closed door and brought Charlotte, who was still standing outside, into the Meeting Room.<br/><br/>The door was closed again.<br/><br/>The three of them stood in the room, falling into a strange silence.<br/><br/>After a while, Charlotte was the first to speak, saying softly, “It’s my fault for interfering in your relationship.”<br/><br/>William Lane: “......”<br/><br/>Kevin gently flicked her forehead, “Stop talking nonsense.”<br/><br/>Charlotte raised her eyebrows, walked into the Meeting Room, straightened a chair, sat down, and said, “Are you done fighting? Do you need me to mediate?”<br/><br/>“How do you plan to mediate?” Kevin asked with interest.<br/><br/>“You guys can fight again.”<br/><br/>William Lane and Kevin Clark both laughed.<br/><br/>Charlotte didn’t want to get involved in their affairs. She guessed it might be because of her, but with the level of their fights, she didn’t think it necessary to interfere. She said, “I have to return to the Hundred Demons Pavilion. You guys should settle your issues before I come back.”<br/><br/>“I’ll take you there,” Kevin offered.<br/><br/>“No need, James Collins is driving, just let him drop me off on his way.”<br/><br/>...\t\t\t\t\t\t</div>", "images": {}, "success": true}