{"id": 549, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998857.html", "title": "Chapter 546: 489: Driving People Mad", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 546: 489: Driving People Mad</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 546: Chapter 489: Driving People Mad<br/><br/>“My sister and the others haven’t come out yet?” James Collins and Charlotte Lane returned together to the Hundred Demons Pavilion.<br/><br/>When they arrived at the Hundred Demons Pavilion, Charlotte Lane and Luke went to the rooftop to discuss matters and did not come out for a long time.<br/><br/>“No,” Damian Brown said, “it must be something important.”<br/><br/>“What could be so important that it takes so long to discuss?” James Collins murmured.<br/><br/>“I don’t know. Be quiet.”<br/><br/>James Collins: “Oh.”<br/><br/>The office on the rooftop.<br/><br/>Charlotte Lane sat on the table, and Luke sat in a chair more than three meters away from her.<br/><br/>Charlotte Lane appeared calm, but Luke’s brows remained furrowed.<br/><br/>The two were quiet for a while before Luke said, “Big Boss, I still hope you can reconsider.”<br/><br/>Charlotte Lane made an affirmative sound.<br/><br/>Luke could sense her perfunctory response, but he did not dare to say more.<br/><br/>“How’s the girl?” Charlotte Lane suddenly asked.<br/><br/>“Her mental state is still not very good. She often isn’t very conscious,” Luke said. “The psychologist has been with her all the time.”<br/><br/>Some time ago, the Hundred Demons Pavilion had a confrontation with Edward Kirsten’s people.<br/><br/>Luke rarely went on missions to the M Continent, but when he did, he happened to clash with Alice Eugene.<br/><br/>At that time, Luke had completed his mission and was preparing to return to the Mountain Sea Continent with the cargo when he encountered a convoy halfway there.<br/><br/>There were many forces in that area, so it wasn’t surprising to encounter people, organizations, or alliances.<br/><br/>If neither side wanted to fight, they would both pass by without incident.<br/><br/>If they wanted to fight, they would have a skirmish.<br/><br/>That was just the way of life.<br/><br/>It was just a convoy carrying seemingly nothing of value, so Luke didn’t pay much attention to it.<br/><br/>However... they didn’t make a move first, but the other party began to attack.<br/><br/>It seemed like a spontaneous decision, wanting to intercept their cargo.<br/><br/>Thus, the two sides quickly started fighting.<br/><br/>The other party knew that they were from the Hundred Demons Pavilion, but they didn’t know who the other party was.<br/><br/>Luke didn’t care who they were either. He just wanted to finish the battle quickly and return home.<br/><br/>But during the fight, a girl suddenly ran down from the other party’s car and rushed into the battle scene, clutching her head and running around while screaming.<br/><br/>Luke felt that the girl’s scream at one point was louder than the sound of gunshots.<br/><br/>It quickly captured his attention.<br/><br/>He looked over and, upon seeing the girl’s face, instinctively charged out to bring her back.<br/><br/>He would visit her whenever he had time.<br/><br/>Charlotte Lane shook her head, “Do your best to treat her.”<br/><br/>“Got it.”<br/><br/>“Have you found any news about her family?” Charlotte Lane asked.<br/><br/>“Not yet,” Luke replied. “We found some missing persons reports in the M Continent, but none of them were her. We’re expanding the search range.”<br/><br/>Charlotte Lane nodded.<br/><br/>Luke said, “She’s very quiet when she’s conscious now, and she doesn’t say anything when we ask her questions, so it’s hard to find her family.”<br/><br/>Charlotte Lane was quiet for a while before saying, “I’m a bit worried that there may be more than one victim like this.”<br/><br/>Luke remained silent.<br/><br/>Because the possibility was enormous.<br/><br/>This girl was targeted because she looked like her. So, Edward Kirsten forced her to mimic her voice.<br/><br/>Up to the point of driving her insane.<br/><br/>If there were others with similar personality, voice or appearance to hers,<br/><br/>then the number of victims would be countless.<br/><br/>She even began to suspect-<br/><br/>Edward Kirsten might have intentionally driven the girl mad and then had Alice Eugene send her to her in order to pressure her.<br/><br/>After all, Alice started the confrontation.<br/><br/>Losing the battle was uneconomical and not to his advantage.<br/><br/>It was hard for her not to think more about it.<br/><br/>But Edward Kirsten shouldn’t know about her connection to the Hundred Demons Pavilion.<br/><br/>But he might know...<br/><br/>Because there was an informant in his home.<br/><br/>She had never mentioned the Hundred Demons Pavilion at home, but James Collins, Robinson Scott, Gael Easton, and others often visited her home.<br/><br/>After all, they were all close to each other, and their conversations were casual.<br/><br/>It’s quite possible that someone mentioned the Hundred Demons Pavilion inadvertently, and someone else overheard it.<br/><br/>Edward Kirsten then sent the girl to the Hundred Demons Pavilion.<br/><br/>Charlotte Lane pressed her temples with her hands, deep in thought.<br/><br/>Edward Kirsten was always hiding in the shadows. He had thousands of ways to escape and tens of thousands of places to hide.<br/><br/>He didn’t even have to show his face to infiltrate her circle without making a sound.<br/><br/>His enemies lurked in secret, enjoying various advantages and knowing her very well, knowing how to deal with her.<br/><br/>Charlotte Lane clicked her tongue softly, cursing, “I used to think he was just crazy, but now... he’s definitely a pervert.”\t\t\t\t\t\t</div>", "images": {}, "success": true}