{"id": 545, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14915024.html", "title": "Chapter 542: 485: Have A Fight", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 542: 485: Have A Fight</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 542: Chapter 485: Have a Fight<br/><br/>“Oh my, who is this handsome guy?” After Logan and his group had finished dealing with the matter at hand, they came over to meet Lila Campbell.<br/><br/>Damian Brown said, “Big Boss.”<br/><br/>James Collins grinned and said, “Sister.”<br/><br/>Logan slung his arm around Lila Campbell’s neck and noticed a red mark on her throat. He gently touched it to make sure it wasn’t anything serious before turning his attention to William Lane, “Handsome man, how should we address you?”<br/><br/>Looking at the outfits of the three men in front of him, William Lane quickly guessed their identities.<br/><br/>When they were in Imperial Capital, Amelie Quentin had already informed him.<br/><br/>Her sister was the Pavilion Master of Hundred Demons Pavilion.<br/><br/>The one in Mountain Sea Continent.<br/><br/>The members of Hundred Demons Pavilion also wore black combat uniforms, quite similar to each other.<br/><br/>Only the symbols on their arms were colored differently to denote their individual identities.<br/><br/>The mark for Logan’s group was red.<br/><br/>That of Samuel Gray’s was grey.<br/><br/>Damian Brown’s was yellow.<br/><br/>“My brother.” Lila Campbell added immediately after, “My biological brother.”<br/><br/>“Young Master Lane.” Logan and his group had already gossiped with Holt Lawrence about Lila Campbell’s background, “Big Boss, your brother is so handsome. Oh my! I suddenly feel like getting a male partner wouldn’t be such a bad idea.”<br/><br/>William Lane raised an eyebrow at that.<br/><br/>Lila Campbell removed Logan’s hand from her shoulder, “Trying to be my sister-in-law? Too bad, my brother already has someone he likes.”<br/><br/>“Such a pity,” Logan said, “It’s the first time in my life I’ve had feelings for a man.”<br/><br/>Lila Campbell couldn’t be bothered to respond.<br/><br/>William Lane, with a smile, extended his hand towards Logan and introduced himself politely, “William Lane.”<br/><br/>Logan shook his hand and said, “Logan.”<br/><br/>Damian Brown also shook his hand and introduced himself.<br/><br/>James Collins not only introduced himself but also added enthusiastically, “Brother! Biological Brother!”<br/><br/>Soon after they finished their introductions, Kevin Clark arrived.<br/><br/>The moment Logan saw him, the smile on his face instantly vanished.<br/><br/>“Did you find out anything?” Lila Campbell asked.<br/><br/>“No. He only knows one lock password.” Kevin Clark glanced over the group of people, then his eyes settled on Lila Campbell, “The other two passwords were incorrect.”<br/><br/>William Lane asked, “When are you free?”<br/><br/>Kevin Clark looked at him.<br/><br/>“Let’s have a duel.”<br/><br/>Kevin Clark: “?” Should duels be scheduled so openly these days?<br/><br/>This time, William Lane silently stared at him, not saying anything.<br/><br/>Kevin Clark observed him for a bit, figuring that it probably had something to do with his young sister, Martin Hanzel’s identity being revealed, “I won’t have time in the next couple of days. How about we do it later?”<br/><br/>Seeing that Kevin Clark had agreed, William Lane turned around and left.<br/><br/>As Kevin Clark watched his retreating figure, he thought to himself, this resolute departure was undoubtedly a trait of the siblings.<br/><br/>On the way back, Lila Campbell spoke little.<br/><br/>Most of the conversation was Kevin Clark monologuing.<br/><br/>He mentioned that he had been ambushed and ended up in the Ghost Forest. The forest was covered in a dense fog and filled with towering trees that left no room for light to penetrate.<br/><br/>There was absolutely no signal.<br/><br/>Not to mention, he had gotten lost in the forest for a while.<br/><br/>Although he was talking about his experience in a casual manner, Lila Campbell knew how difficult it was fighting and finding a way out in that place.<br/><br/>No one ever entered the mountain forest in normal times, as it was believed that once entered, there was no way out.<br/><br/>No wonder it was called the Ghost Forest.<br/><br/>A one-way path, filled with wandering spirits.<br/><br/>Thankfully, Kevin Clark and his squad had a wealth of experience in the wild.<br/><br/>Otherwise, even if there wasn’t anyone blocking their way, they would’ve found it difficult to leave the forest, let alone finding the exit while fighting enemies.<br/><br/>As they were finding their way out, they encountered Allonzo Hobson, who had come searching for them.<br/><br/>Because of the presence of the Silver Palace, their exit was relatively quick.<br/><br/>After exiting the Ghost Forest, as soon as Kevin Clark got signal on his cell phone, he immediately contacted Lila Campbell, calling her and sending her a text message.<br/><br/>By that time, Lila Campbell had already reached the Platinum Burke Family territory. As she was on a mission, her phone was set to vibrate by habit.<br/><br/>Therefore, she hadn’t heard it.<br/><br/>Subsequently, Kevin Clark directly contacted Hugo Clark.<br/><br/>Hugo Clark informed him that Lila Campbell and their crew had gone to the Platinum Burke Family territory.<br/><br/>That’s why Kevin Clark and his group directly headed to the Platinum Burke Family territory.\t\t\t\t\t\t</div>", "images": {}, "success": true}