{"id": 540, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14915003.html", "title": "Chapter 537: 480: Platinum Burke Family", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 537: 480: Platinum Burke Family</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 537: Chapter 480: Platinum Burke Family<br/><br/>As Charlotte Lane opened the door, she saw William Lane about to enter.<br/><br/>Their eyes met, and William’s eyebrows gently knitted together.<br/><br/>Charlotte was enveloped in an eerie cold aura, her thin lips pressed together, and there was no expression on her face.<br/><br/>Furthermore, she hadn’t rested for a long time resulting in an unnatural pallor on her face and a shallow blue color under her eyes.<br/><br/>It added a layer of indifference to her already cold appearance.<br/><br/>“Charlotte,” William looked at her and called her name.<br/><br/>Charlotte lowered her gaze, sounding hoarse, “Brother.”<br/><br/>William raised his hand to touch her head, “Arthur North should be fine. Whoever encounters him is bound to have bad luck.”<br/><br/>Charlotte tried to smile but couldn’t quite manage it. Then she asked a trivial question, “When did you arrive?”<br/><br/>“Just now.” William was heartbroken to see Charlotte like this, “What are you going to do?”<br/><br/>“I’ve stabilized the situation at the Easton Group,” Charlotte said with her gaze down, “and tracked down the Platinum Burke Family.”<br/><br/>“So?”<br/><br/>“I’ve raided the Platinum Burke Family.” Charlotte’s voice was flat.<br/><br/>William’s eyes flickered, and he immediately realized, “Someone is supporting the Platinum Burke Family from behind.”<br/><br/>“It seems so.”<br/><br/>“It’s very dangerous for you to go now.” William said, “We don’t know who is behind them and how powerful they are.”<br/><br/>“Whoever they are, they’ll end up as corpses anyway.” Charlotte spoke in a flat tone.<br/><br/>William frowned.<br/><br/>Charlotte’s current state was frightening, and it made him feel an unfamiliarity.<br/><br/>This unfamiliarity, whether it was eleven years ago or after her return, it was something he had never seen before.<br/><br/>“Charlotte...”<br/><br/>“Brother, don’t try to talk me out of it.”<br/><br/>William paused and then said, “Brother will go with you.”<br/><br/>“I’ll be fine on my own.”<br/><br/>“I’ll go with you.” William insisted.<br/><br/>Charlotte looked up at him and nodded after a moment, “Alright.”<br/><br/>Seeing that Charlotte agreed, William said, “Let’s eat something first. Amelie told me that you haven’t eaten much since last night.”<br/><br/>“I’ll grab something to eat in the car.”<br/><br/>...<br/><br/>The housemaster, though his Chinese was poor, could understand it: “Mrs. Clark?”<br/><br/>Amelia stood in front of Charlotte, her face full of pride and her previous deceitful docility vanished: “Sister, we haven’t seen each other in a while.”<br/><br/>Charlotte just looked at her without moving.<br/><br/>Amelia then looked at William and said, “So, Young Master Lane has also come? What is this...knowing that your own brother is losing, you started to go after your brother’s wife?”<br/><br/>These words were spoken.<br/><br/>It was as if both sides had been given a clear and obvious fuse to start the battle.<br/><br/>The Platinum Burke housemaster’s insincere enthusiasm vanished from his face, replaced by an expression of arrogance and readiness for action.<br/><br/>A flash of murderous intent flickered in the depths of William’s eyes.<br/><br/>Amelia continued to laugh, “Oh, I’m just joking. Don’t take it seriously, don’t take it seriously.”<br/><br/>After that, she looked at Charlotte and said, “Sister, don’t be too sad. Men, of course, need to move on from old relationships.”<br/><br/>Charlotte listened to the delicate ticking of her wristwatch.<br/><br/>“Also, sister, don’t deliberately waste time.” Amelia sneered, “Your intentions are obvious to everyone. The Dark Radiance forces have been stopped halfway. No one is coming.”<br/><br/>James Cooper suddenly furrowed his eyebrows.<br/><br/>Amelia caught his expression and laughed without concealment.<br/><br/>Today, she wanted to watch Daisy Zane kneel in front of her and die in front of her.<br/><br/>“Young Master Lane, this is not the Imperial Capital. Nor is it a place where the Lane Family holds power.” Amelia said, “Choosing the right team is essential.”<br/><br/>Amelia’s expression softened a bit when she looked at William.<br/><br/>“Is it?” William said.<br/><br/>“Of course.” Amelia replied, “Dark Radiance has always been loyal to the Clarks, and they may not last much longer. If we cooperate, there will be a time when the Lane Family will rise in the Mountain Sea Continent. Of course...today I’m merely extending an olive branch to you, we can discuss this matter later. Now, I have something important to discuss with Lady Zane.”<br/><br/>As she said this, she looked at Charlotte’s cold face, paused, and said, “Daisy Zane, in our sisterly bond, you should kneel and beg me. I’ll give you a chance to be buried with Kevin Clark...Ah!”<br/><br/>Charlotte retaliated with a slap.<br/><br/>The force was so strong that Amelia was almost knocked down, but Charlotte quickly pulled her back up.<br/><br/>Liam Davis and the housemaster were both startled.<br/><br/>The people around were all on alert.<br/><br/>Amelia’s vision was blurred by stars, and it took her a while to focus on Charlotte’s face. Her mouth was split open by the blow, and blood flowed down her chin.<br/><br/>She touched the blood on her chin and glared at Charlotte, “You dare hit me!”<br/><br/>Charlotte wore a black combat suit and boots, with a tight waist and high ponytail.<br/><br/>She emanated a cold, ruthless aura and a frighteningly powerful murderous intent.<br/><br/>She gripped Amelia’s arm, applying a little force, and whispered, “Hit you? I came here today to take your life.”\t\t\t\t\t\t</div>", "images": {}, "success": true}