{"id": 546, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998850.html", "title": "Chapter 543: 486: Return To Dark Radiance", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 543: 486: Return To Dark Radiance</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 543: Chapter 486: Return to Dark Radiance<br/><br/>Charlotte Lane didn’t talk much on the way, and when they arrived at Dark Radiance, Hugo Clark and Amelie Quentin were waiting outside for them.<br/><br/>They had received the message on the way back.<br/><br/>But Amelie Quentin still insisted on waiting outside for them.<br/><br/>Upon seeing Charlotte Lane getting out of the car, she immediately ran to hug her. However, Charlotte stopped her with a hand on her shoulder: “Don’t hug me, I’m dirty. I’m fine.”<br/><br/>Amelie Quentin looked her up and down, saw nothing wrong, and stood beside her.<br/><br/>“Why aren’t you waiting inside when it’s so hot outside?” Charlotte Lane asked.<br/><br/>“It’s even more sweaty inside,” Amelie Quentin said in a low voice.<br/><br/>“My brother is staying there to finish up and will be back later,” Charlotte Lane said.<br/><br/>Amelie Quentin nodded.<br/><br/>As the group walked to the living room, they chatted.<br/><br/>Arriving at the living room, Charlotte Lane didn’t sit down: “I’m going to catch up on sleep.”<br/><br/>Amelie Quentin said, “Do you want to eat something first?”<br/><br/>“I’ll eat after I wake up.” Charlotte Lane looked at Kevin Clark, “You go take a shower, then come down to eat.”<br/><br/>“Alright.”<br/><br/>Kevin Clark went upstairs with her.<br/><br/>Charlotte Lane took a shower in the bedroom.<br/><br/>Kevin Clark went to the room next door. When he came back after taking a shower, Charlotte Lane had already finished her shower and was sitting by the bed, mechanically wiping her hair.<br/><br/>Kevin Clark held a hairdryer in his hand and walked over to her.<br/><br/>Charlotte Lane had been looking down, but after seeing Kevin Clark’s legs, she looked up at him.<br/><br/>His eyes grew even redder from the steam of the shower.<br/><br/>“When I went to the next room just now, Amelie Quentin asked Hugo to pass me a message,” Kevin Clark said as he plugged in the hairdryer.<br/><br/>Charlotte Lane didn’t speak, waiting for him to continue.<br/><br/>“She said... if I disappear again, she will find someone to finish me off,” Kevin Clark said slowly.<br/><br/>Charlotte Lane raised the corner of her mouth, “Before finishing you off, she would have to find you first.”<br/><br/>“So... I couldn’t discern the good and bad of this sentence for a while.” After saying that, Kevin Clark turned on the hairdryer to dry her hair.<br/><br/>But Charlotte Lane grasped his hand, turning off the hairdryer.<br/><br/>“What’s wrong?” Kevin Clark asked.<br/><br/>Without a word, Charlotte Lane hugged his waist and put her head against him.<br/><br/>Kevin Clark put the hairdryer aside, hugged her, and stroked her head: “I made my little girl worry.”<br/><br/>After they returned to the room, he sent a message to Charles Amos and went back to sleep.<br/><br/>This sleep lasted until the next day.<br/><br/>By the time she woke up, William Lane and the others had returned, and James Collins had come over as well.<br/><br/>The password lock on the Platinum Burke family’s secret chamber was opened.<br/><br/>William Lane personally led people into the secret chamber.<br/><br/>Only bloodstains were found in the secret chamber, and no other people were found.<br/><br/>Following the bloodstains, they cracked another code, then followed the chamber to the sewer.<br/><br/>The sewers had two directions: north and south.<br/><br/>People were sent in both directions.<br/><br/>They also sent people to search on the ground but found no one.<br/><br/>There was a shallow layer of sewage in the sewer, dark and smelly. They turned on their lights but found no trace of blood. It was possible the places tainted with blood had been cleaned up.<br/><br/>There were so many passages above the sewer, and quite a few sewer wells in remote areas.<br/><br/>The geographical location of the Platinum Burke family was remote, let alone the surrounding areas.<br/><br/>This secret chamber was designed for escape, so the arrangements above the sewer were quite appropriate. Places with manhole covers either had no surveillance, or the surveillance was fake.<br/><br/>Temporarily unable to determine where they left from or where they had gone.<br/><br/>When Charlotte Lane went downstairs, William Lane was taking a bath upstairs.<br/><br/>Then, Olivia Lane complained to Charlotte Lane: “Sister, my brother smells now.”<br/><br/>“So that’s why you have a disgusted look on your face?”<br/><br/>“Not really.” Olivia Lane pointed at James Collins and said, “He! He called me ‘sister’ when he came in. And...his hair is rainbow-colored!”<br/><br/>“Rainbow hair looks so good.” James Collins, in an indecent sitting position on the single sofa, touched his hair, “Isn’t it nice? Sister, don’t you like it?”<br/><br/>Olivia Lane crossed her arms and looked at James Collins.<br/><br/>James Collins bent his peach blossom eyes, waiting for Charlotte Lane’s response.<br/><br/>Charlotte Lane had already seen his rainbow hair yesterday, but she had no mood to admire it yesterday, and today...she couldn’t manage to admire it either.<br/><br/>“Damian Brown... didn’t beat you up?”<br/><br/>Upon mentioning Damian Brown, James Collins suddenly sat upright, his facial expression stiffening for a moment: “Sister, you, how do you know about it?”<br/><br/>Olivia Lane immediately pricked up her ears to listen to the gossip.<br/><br/>Although she didn’t know Damian Brown, it didn’t stop her from gossiping.<br/><br/>Charlotte Lane raised her eyebrow but didn’t say anything.<br/><br/>“Yes, she started it first.” James Collins suddenly acted like an elementary school student tattletelling, “She kissed me first, slept with me. The hickey on my neck was her doing!”\t\t\t\t\t\t</div>", "images": {}, "success": true}