{"id": 542, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14915011.html", "title": "Chapter 539: 482: Crossing Hands", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 539: 482: Crossing Hands</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 539: Chapter 482: Crossing Hands<br/><br/>Charlotte Lane was used to working from the inside out, and that’s how she’d done it all these years.<br/><br/>However, working from the inside out isn’t always a pattern, but a method, and it can be used in hundreds of different ways.<br/><br/>Dark Radiance being intercepted on land was within her calculations.<br/><br/>So, Dark Radiance took to the air.<br/><br/>And they timed their departure, just needing to stall for a little while after they arrived for everything to be successful.<br/><br/>Besides, there was also Hundred Demons Pavilion on the other side.<br/><br/>Charlotte Lane contacted Luke before Dark Radiance set off.<br/><br/>Hundred Demons Pavilion was farther away, so when Charlotte Lane set off from Dark Radiance, Hundred Demons Pavilion had already left.<br/><br/>There were too many forces attacking from the outskirts, and their firepower was too fierce, so Liam Davis and the Housemaster had to allocate most of their forces to the periphery for defense.<br/><br/>And the number of people from Platinum Burke Family in the Reception Room was getting fewer and fewer.<br/><br/>It was precisely because of this that Liam Davis could so clearly feel Charlotte Lane’s terrifying combat power.<br/><br/>When Liam Davis saw the inner area was about to be lost and was considering retreating with the Housemaster.<br/><br/>Alice Eugene came with her people.<br/><br/>Liam Davis and the Housemaster immediately felt relieved.<br/><br/>The Platinum Burke family was just a quickly rising family after encountering a suitable opportunity after the Thousand Mountains Alliance was wiped out.<br/><br/>In fact, their martial power from top to bottom wasn’t very good.<br/><br/>The Housemaster inherited his father’s position and relied completely on the protection of those around him.<br/><br/>Liam Davis was a late-comer half-learner, and when he went out, a group of bodyguards followed him.<br/><br/>And these bodyguards’ skills were far inferior compared to Dark Radiance.<br/><br/>If they wanted to win, they could only rely on numbers and attrition.<br/><br/>When the people were drawn away, it was clearly impossible.<br/><br/>But Alice Eugene’s people were different. They were all carefully selected and trained.<br/><br/>They could completely fight against the people from Dark Radiance. What’s more, Dark Radiance’s people had already fought a round.<br/><br/>The two sides clashed, Alice Eugene directly went towards Charlotte Lane.<br/><br/>She swung her fist from behind, and Charlotte Lane immediately dodged it. Then she turned to look at her.<br/><br/>There was no cover on Alice’s face today, she looked at Charlotte Lane with an evil smile on her exposed face, and then said slyly, “Enigma Starry, long time no see.”<br/><br/>Charlotte Lane’s body was shrouded in murderous intent, and when she saw her, it didn’t change at all, but her heart still sank a little.<br/><br/>The person behind the Platinum Burke family was Edward Kirsten.<br/><br/>So... the disappearance of Arthur North was also Edward Kirsten’s doing.<br/><br/>“What? You don’t recognize me?” Alice Eugene had a sinister smile on her face.<br/><br/>However, Dark Radiance’s people were not many, and they had been engaged in a prolonged battle with the Platinum Burke Family. Now that they encountered Alice’s people, Dark Radiance gradually became disadvantaged over time.<br/><br/>William Lane never dared to stray too far from Charlotte, fearing someone nearby would harm her.<br/><br/>Alice’s skills had vastly improved since their last encounter at Red Cliff Village, making her a difficult opponent.<br/><br/>But Charlotte still managed to defeat her, utilizing a combination of punches, dodges, elbow strikes, knee lifts, flying knees, and lateral kicks.<br/><br/>Charlotte’s attacks were fast and powerful, kicking Alice away.<br/><br/>Alice crashed into several people.<br/><br/>Once she fell, she couldn’t get up immediately.<br/><br/>Her people helped her up.<br/><br/>After a while, Alice recovered, pulled her gun, and aimed.<br/><br/>Charlotte, who was dealing with the people around her, caught a glimpse of Alice drawing her gun, then saved her last bullet for Alice.<br/><br/>She dodged to the side and fired a shot.<br/><br/>Because Alice also dodged, the bullet hit her left shoulder.<br/><br/>The force of the impact caused Alice to stagger back a few steps, held up by someone.<br/><br/>She held her injured shoulder, staring at Charlotte through the crowds of fighting people.<br/><br/>Her eyes were filled with hatred, but her first reaction after being injured was to leave.<br/><br/>If she killed Enigma Starry, she would have no qualms about losing her life.<br/><br/>But if she couldn’t kill her, then sacrificing her life wouldn’t be worth it.<br/><br/>So she let her people help her retreat, step by step.<br/><br/>Charlotte spotted her intentions and immediately pursued her.<br/><br/>But the surrounding people blocked her way, intent on covering Alice’s retreat.<br/><br/>William Lane also moved towards her to assist her in breaking through.<br/><br/>However, he was quickly surrounded, unable to reach Charlotte.<br/><br/>Charlotte dealt with the people surrounding her while watching Alice move farther away.<br/><br/>As she was being trapped, she heard a loud noise in the reception room on her right.<br/><br/>The side gate of the reception room was knocked open.<br/><br/>A white flash jumped in.<br/><br/>While everyone was stunned, the white flash quickly approached Charlotte, pinning down one of the people beside her.<br/><br/>Silver Palace!<br/><br/>Upon seeing it, Charlotte felt numb for a moment.<br/><br/>Then she immediately looked towards the side gate.<br/><br/>Through the crowd, she spotted Kevin Clark with his gun, coming over...\t\t\t\t\t\t</div>", "images": {}, "success": true}