{"id": 555, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998869.html", "title": "Chapter 552: 495: The Bottom Line Is You", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 552: 495: The Bottom Line Is You</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 552: Chapter 495: The Bottom Line is You<br/><br/>Easton Group.<br/><br/>After finishing his work, Kevin Clark didn’t leave right away.<br/><br/>On the side wall of the office, there was a ten-meter by ten-meter holographic transparent projection screen.<br/><br/>Displayed on it were the distribution maps of M Continent, D Continent, F Continent, A Continent, and Mountain Sea Continent.<br/><br/>It showed the distribution of entertainment venues, underground casinos, boxing rings, and other locations on each continent.<br/><br/>Each location was marked with a red dot.<br/><br/>Some were marked with green dots.<br/><br/>The green dots marked the trading locations of 319 that had been destroyed in the past.<br/><br/>Overall, these red and green dots were intertwined in their distribution.<br/><br/>Kevin Clark sat behind the office desk, looking at the distribution with the chair tilted to one side.<br/><br/>After a while, he marked a few points and connected a few lines. Then he wiped one line, tapping his fingers on the table, wondering where the line would be more appropriate to connect.<br/><br/>At that moment, there was a knock on the office door.<br/><br/>He turned his head and saw Charlotte Lane standing at the entrance as the door opened.<br/><br/>Kevin Clark paused, then turned off the projection with a flick of his hand.<br/><br/>He smiled as usual and then stood up, saying, “Little girl, what brings you here?”<br/><br/>Charlotte glanced at the wall and didn’t come in: “Are you busy?”<br/><br/>“It’s not an urgent matter, just looking into something.” Kevin Clark walked up to her and noticed her lips were unnaturally red, “What’s wrong?”<br/><br/>He touched her forehead and felt it was hot.<br/><br/>“Is it Wilton Edwards?” Kevin asked.<br/><br/>Charlotte nodded: “He admitted it to me.”<br/><br/>Kevin Clark hugged her and stroked her head: “It’s alright, everything will be fine.”<br/><br/>Charlotte leaned her face against his shoulder and said softly, “When I first left the Continent A, only Wilton was with me. With him around, I knew someone was protecting Charles Amos, and I felt at ease and settled.”<br/><br/>“I understand.”<br/><br/>“He helped me deal with many things.”<br/><br/>Kevin Clark stroked her hair.<br/><br/>“I really wish I had been wrong in my suspicions.” Charlotte’s hand gripped Kevin’s shirt tightly, her body shaking slightly from the force.<br/><br/>Kevin Clark gently kissed the top of her head: “I know.”<br/><br/>Wilton Edwards lowered his head in disappointment: “Third Master, I’m sorry.”<br/><br/>“Many things can’t be judged by right or wrong, you have your loyalty, and we have our beliefs,” Kevin Clark said, “different paths. Although the person you’re loyal to isn’t worth anything. But that’s between us and him. So there’s no need to apologize.”<br/><br/>Wilton Edwards smiled: “I didn’t tell Young Master, and I don’t know how to tell him. I left him a letter. Please help me give it to him, Third Master.”<br/><br/>Kevin Clark took it: “Okay.”<br/><br/>After Wilton Edwards was sent away, Kevin Clark took the letter back to Clark Manor.<br/><br/>Finn Clark was already up and jogging in the courtyard.<br/><br/>Seeing Kevin Clark return, he asked, “Did he leave?”<br/><br/>“Yes.”<br/><br/>“What’s this?” Finn Clark looked at the letter in his hand and asked.<br/><br/>Kevin Clark handed it to him: “The letter from Alozon Kirsten to Charles Amos.”<br/><br/>Finn Clark immediately took a step back: “Why are you giving it to me?”<br/><br/>“It’s your son, so of course you should give it to him,” Kevin Clark said.<br/><br/>“Now you remember he’s my son?” Finn Clark said, “What? Did you cut off your father-son relationship with him?”<br/><br/>“Have you had a problem with me lately?” Kevin Clark looked at him and said, “Why do your words always carry a sting to them?”<br/><br/>“Heh.” Finn Clark chuckled lightly, “You try being locked up in your own house and not allowed out. If it were you with your bad temper, you would have definitely torn the house apart by now.”<br/><br/>Kevin Clark raised his eyebrows: “What? Is the house too small for you to run, or not enough for you to train? Big Brother specially set up a shooting range for you at home. I never had this treatment.”<br/><br/>Not mentioning it would have been fine, but it only made Finn Clark angrier: “Was that set up for me? That was set up for Charles Amos to practice shooting.”<br/><br/>As soon as Charles Amos was mentioned, Kevin Clark looked at the letter in his hand and worried.<br/><br/>Seeing his appearance, Finn Clark asked, “Will he cry? I haven’t seen him cry since I came back.”<br/><br/>Kevin Clark directly pressed the letter on him: “Just in time, you can go and see.”<br/><br/>After saying this, he turned and walked away.<br/><br/>The letter fell from his body, and Finn Clark subconsciously caught it: “Third Master Clark, you’re going too far. I’m angry!”<br/><br/>Kevin Clark didn’t hear it and walked leisurely to the front hall.<br/><br/>“Hey, you’ve really grown wings and become hard-hearted,” Finn Clark yelled, “Who was it! Who patiently advised in front of our parents, so they gave birth to you? So you have your current happy life, and now you’ve forgotten?”<br/><br/>“I didn’t forget.” Kevin Clark said slowly without turning his head. “It was you. You’re the best Second Brother, so you won’t refuse your little brother this small request, will you?”<br/><br/>Finn Clark: “.......”<br/><br/>Finn Clark: “??????”<br/><br/>How was it that he had been turned against and his heart pierced?\t\t\t\t\t\t</div>", "images": {}, "success": true}