{"id": 552, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998863.html", "title": "Chapter 549 - 492: Rescue", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 549 - 492: Rescue</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 549: Chapter 492: Rescue <br/><br/>The glass door of the gym could be shattered with a single gunshot. Fortunately, the cabinet material was good, and it was large enough to completely block the entrance. <br/><br/>People inside also pushed some fitness equipment against the entrance cabinet. <br/><br/>Once they were sure it couldn’t be pushed open from outside by human force, they all retreated to the opposite corner, with no one near the entrance. <br/><br/>Although it couldn’t be pushed open, there was a risk of bullets coming through, making the entrance very dangerous. <br/><br/>While they were inside blocking the door, reinforcements arrived on the sixth floor. <br/><br/>Kevin Clark and Charlotte Lane fought with them for a while outside, buying time for those inside to block the door. <br/><br/>When the situation inside was more or less under control, the two went to the safety passage. <br/><br/>People had also come up from the safety passage downstairs, and the two of them took out some more people in the safety passage, picked up some more bullets, then went upstairs through the staircase. <br/><br/>They both stayed on the 15th floor and reached it without damaging any surveillance devices. <br/><br/>No one intercepted them upstairs, and they were as fast as an elevator. <br/><br/>So they easily returned to their room. <br/><br/>Kevin Clark guarded the door, while Charlotte Lane fetched her laptop from her suitcase. <br/><br/>As she caught her breath, she searched for the police equipment outside and synced the hotel’s surveillance with theirs. <br/><br/>Letting them know exactly where the enemies and hostages were in the hotel. <br/><br/>Then she contacted them with her cellphone. <br/><br/>As soon as she connected, they asked her who she was in English. <br/><br/>Charlotte Lane simply communicated with them in English and said directly: “In five minutes, all the displays inside the hotel that can be watched will go black, and only you can see what’s going on inside the hotel.” <br/><br/>With five minutes’ time, the people outside knew the situation inside the hotel, and they could cooperate from within to sneakily attack from behind. <br/><br/>After five minutes, the hotel’s surveillance displays would be shut down, and the deception syndicate would be unable to see what was going on inside the hotel, or know where anyone had come in. <br/><br/>That’s when they could destroy the surveillance. <br/><br/>Charlotte Lane also synced the hotel’s surveillance to her and Kevin Clark’s cellphones and checked their check-in information. <br/><br/>Kevin Clark was already fighting with people outside the door, so she handed him her gun and cellphone: “They won’t send too many people up.” <br/><br/>“Yes.” Kevin Clark quickly loaded bullets into the gun, “But they have hostages downstairs, and it’s hard to attack whether it’s from the inside or the outside. Once we get through this, they’ll probably let us go.” <br/><br/>Charlotte Lane took down an opponent and said, “There are people watching the police outside on the seventh and eighth floors.” <br/><br/>Kevin Clark finished off the last person: “Let’s go there first.” <br/><br/>“We’ll split up.” Charlotte Lane said. <br/><br/>Charlotte Lane looked at the girl, her eyes fixed on her profile for a moment. <br/><br/>It was Jessica Maxwell. <br/><br/>Charlotte Lane and Kevin Clark looked at each other. <br/><br/>Both of them had a hint of speechlessness in their calm expressions. <br/><br/>What a coincidence. <br/><br/>The sound from the megaphone outside also came in: “Don’t get angry; we can talk about everything. We have prepared the car you requested. Don’t kill anyone, and we’ll let you go!” <br/><br/>“Negotiate? Your people are already attacking...” <br/><br/>Charlotte Lane clenched the dagger in her sleeve, and as the small leader didn’t finish his second sentence, she rushed out. <br/><br/>Kevin Clark also immediately fired a shot that hit the man’s hand, knocking the gun out of his hand and then covering Charlotte Lane. <br/><br/>In an instant, all the guards in this room pointed their firepower at Kevin Clark and Charlotte Lane. <br/><br/>Police waiting in the first-floor safety passage immediately rushed in, and the police outside also started to attack. <br/><br/>Charlotte Lane took Jessica Maxwell with her and quickly moved behind a single-seater sofa. <br/><br/>Then returned fire. <br/><br/>Seeing this, the rest of the people in the lobby covered their heads, screaming, but thankfully no one got up and ran around. <br/><br/>Jessica Maxwell trembled with fear, clenching tightly onto Charlotte Lane’s clothes. <br/><br/>Charlotte Lane’s movements were hindered, so she simply pulled Jessica’s hand away and held her wrist to keep her from moving around. <br/><br/>A few minutes later, the deception syndicate was subdued, and the gunfire upstairs stopped. <br/><br/>People were injured both upstairs and downstairs. <br/><br/>Some people had been shot. <br/><br/>But there was no immediate danger to their lives. <br/><br/>Ambulances were standing by outside, and the injured were taken away in batches. <br/><br/>The members of the deception syndicate were also taken away. <br/><br/>Because there were so many people involved, they were not taken to the police station. <br/><br/>At the same time, while comforting everyone, they asked them some questions on the spot. <br/><br/>There were not only guests but also nineteen young people who had been deceived into joining. <br/><br/>Among these nineteen people was Jessica Maxwell. <br/><br/>And Charlotte Lane and Kevin Clark were separately interrogated in their room upstairs. <br/><br/>As they expected, Kevin Clark called the M Continent Dark Radiance branch and asked them to bail them out.\t\t\t\t\t\t</div>", "images": {}, "success": true}