{"id": 550, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998859.html", "title": "Chapter 547 - 490: Trouble In The Hotel", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 547 - 490: Trouble In The Hotel</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 547: Chapter 490: Trouble in the Hotel <br/><br/>Things in the Mountain Sea Continent were mostly settled. <br/><br/>Imperial Capital still had some matters to attend to, so William Lane, Hugo Clark, and Olivia Lane returned first. <br/><br/>Due to accepting a task from Hundred Demons Pavilion, Kevin Clark and Lila Campbell would return a few days later. <br/><br/>Allonzo Hobson originally planned to return with William Lane and his party, but then Robinson Scott arrived at the Mountain Sea Continent, so he went with Robinson Scott to visit the Scott Family. <br/><br/>Kevin Clark accompanied Lila Campbell to the Hundred Demons Pavilion and planned to go with her to M Continent in the afternoon, then carry out the task together in the evening. <br/><br/>The two of them arrived after William Lane and the others left yesterday, and they stayed the night here. <br/><br/>Early in the morning, while Lila Campbell was still asleep, Kevin Clark and Luke took a stroll around the Hundred Demons Pavilion. <br/><br/>When they returned, Lila Campbell was already having breakfast in the restaurant. <br/><br/>“You’re awake?” Kevin Clark walked over to her, touched her hair, and sat down. <br/><br/>Lila Campbell ate while looking at her cell phone. When both of them sat down, she looked up at Kevin Clark and said lightly, “Tell me, what do you have in mind after surveying the terrain early in the morning?” <br/><br/>Luke was seated across from them and smiled at Lila Campbell. <br/><br/>“To admire my wife’s territory,” Kevin Clark said softly, “and plan for my future freeloading.” <br/><br/>“Alright,” Lila Campbell lowered her head and ate her porridge, “Once I take down Dark Radiance, I’ll then marry you.” <br/><br/>Kevin Clark smiled and said, “There is no need to fight; it’s already yours.” <br/><br/>Lila Campbell raised her eyebrows. <br/><br/>Luke drank his soup while thinking about how he felt a bit redundant. <br/><br/>Kevin Clark also served himself a bowl of soup and then asked Lila Campbell, who was engrossed with her cell phone: “What are you looking at? Eat first?” <br/><br/>Lila Campbell put away her cell phone and started eating. <br/><br/>Luke looked at his obedient boss. <br/><br/>It was a rare sight, so he took another look. <br/><br/>“Yesterday, my brother and his party were photographed at the airport when they returned to the Imperial Capital,” Lila Campbell said. <br/><br/>“Oh?” <br/><br/>“It’s not a big deal. Just... people are saying my brother and Hugo Clark went on a honeymoon and just came back,” Lila Campbell said calmly. <br/><br/>Kevin Clark had just bitten into a fried egg and suddenly found it difficult to swallow: “......” <br/><br/>“Isn’t the sister there too?” Luke said. <br/><br/>“Yeah, my sister was Photoshopped out, leaving only Hugo Clark and my brother,” Lila Campbell replied with a smile, “It’s already made the hot search list.” <br/><br/>“It’s a bit of a pity,” Kevin Clark suddenly said. <br/><br/>“What’s a pity?” Luke asked. <br/><br/>“A pity we’re not in the domestic area right now,” Lila Campbell said, “so we can’t witness my brother and Hugo Clark’s embarrassment in person.” <br/><br/>“Right,” Kevin Clark replied with a smile. <br/><br/>“Boss, that’s your brother,” Luke reminded her. <br/><br/>Kevin Clark raised his eyebrows and kissed her, “Good suggestion.” <br/><br/>Even though that’s what they said, the two still changed their clothes, just in case. <br/><br/>Moreover, they didn’t change into their combat clothes, but their everyday outfits. <br/><br/>They didn’t know what had happened. <br/><br/>They didn’t know if the situation would involve them, so to avoid drawing attention, it would be better for the two to be low-key. <br/><br/>As soon as the two finished changing, the hotel room door was swiped open from the outside. <br/><br/>Kevin Clark pulled Charlotte Lane behind him. <br/><br/>The person outside kicked the door open, shouting, “Nobody move, we have guns,” while turning on all the lights. <br/><br/>“Come out! We won’t kill you if you cooperate!” they said while firing another shot. <br/><br/>With a bang, the window facing the entrance was shattered. <br/><br/>Kevin Clark and Charlotte Lane exchanged another glance, and with a single look, the two knew what each other was thinking. <br/><br/>While the two intruders entered the cloakroom, two guns were aimed at them. <br/><br/>“Don’t move!” <br/><br/>Kevin Clark and Charlotte Lane cooperated without moving or speaking. <br/><br/>The other two, seeing their calm demeanor, were a bit wary so they shouted, “Raise your hands!” <br/><br/>The two complied and raised their hands, though somewhat perfunctorily. <br/><br/>“Take out your cell phones! All electronic devices out!” <br/><br/>The two threw down their cell phones, then turned their pockets inside out for the intruders to see, clean and empty, nothing there at all. <br/><br/>The two gunmen were masked, and seeing the couple so calm and cooperative, they were silent for two seconds. <br/><br/>But the couple made no other moves. <br/><br/>So, the intruders assumed the couple must have been scared silly and didn’t give it much thought. <br/><br/>The intruders walked behind them, holding guns to their backs, and said, “Walk out!” <br/><br/>The couple walked out. <br/><br/>“Keep some distance! Don’t stick so close together!” <br/><br/>Kevin Clark and Charlotte Lane were directed out of the room by the intruders. <br/><br/>Out in the hallway, they encountered two couples coming from the corridor. Like them, someone held guns to their backs as well. <br/><br/>However, the other two couples weren’t as composed, all scared, and some were even dragged by the intruders. <br/><br/>Kevin Clark and Charlotte Lane exchanged another glance. <br/><br/>Kevin Clark’s eyes conveyed: Shouldn’t we have pretended just now too? <br/><br/>Charlotte Lane: It’s too late now. <br/><br/>This floor should only have been occupied by the three couples. <br/><br/>They entered two elevators, descending...\t\t\t\t\t\t</div>", "images": {}, "success": true}