{"id": 553, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998865.html", "title": "Chapter 550 - 493: Returning To The Capital", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 550 - 493: Returning To The Capital</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 550: Chapter 493: Returning to the Capital <br/><br/>Kevin Clark said that someone would come to pick them up, and as soon as he mentioned Dark Radiance, the M Continent police became more polite. <br/><br/>He called to have someone come pick them up. <br/><br/>While waiting for someone to come, Kevin Clark and Charlotte Lane took a rest and listened to the stories of how these people were deceived. <br/><br/>All nineteen men and women were all deceived by online relationships. <br/><br/>They went to different places to meet face to face and were then taken to this place. <br/><br/>The police said that this organization probably specialized in using online relationships as a means of deception. <br/><br/>They would divide into many smaller groups, each with its own deceptive methods. <br/><br/>Charlotte Lane and Kevin Clark did not say much more. When someone came to pick them up, they took their belongings and prepared to leave. <br/><br/>In the grand hall, the deceived people were sitting in a row on the long bench. <br/><br/>Jessica Maxwell saw Charlotte Lane coming out and instinctively followed her. <br/><br/>Charlotte Lane saw her running over and paused for a moment. <br/><br/>“Daisy Zane.” <br/><br/>Charlotte Lane did not respond, just looking at her. <br/><br/>Jessica Maxwell clenched her clothes and whispered, “Thank you.” <br/><br/>After that, she said, “I’m sorry.” <br/><br/>Charlotte Lane paused for a moment, and said “You’re welcome.”, but she didn’t accept the apology. <br/><br/>Jessica Maxwell’s face was covered with dried tear marks, and her eyes were still red, looking quite pitiful. Charlottet Lane didn’t say anything after saying “You’re welcome” and neither did Jessica. <br/><br/>She just stood there with her head down, like a child who had done something wrong. <br/><br/>“Is there anything else?” Charlottet Lane asked. <br/><br/>“You heard about how I was deceived, didn’t you?” Jessica suddenly asked. <br/><br/>“Yes.” Charlotte Lane replied. <br/><br/>“Don’t you have anything to say to me?” Jessica’s head lowered even more due to embarrassment and shame. <br/><br/>It seemed she was prepared to accept Charlottet Lane’s ridicule. <br/><br/>Charlotte Lane put her hands in her pockets, looked at her, and said after a while, “Online relationships are risky, be cautious when meeting in person.” <br/><br/>Kevin Clark raised his eyebrow. <br/><br/>Jessica looked up at her: “That’s all?” <br/><br/>“What else?” Charlotte Lane replied, “You organized such a big online event to slander me. Since you’re so capable and yet got deceived, apart from advising you to be cautious, what else can I say?” <br/><br/>Jessica frowned, met her calm gaze, and immediately lowered her head again: “I’ve already apologized.” <br/><br/>“Yes, but I didn’t accept it.” Charlotte Lane said calmly. <br/><br/>Jessica was choked up. After a few seconds, she said, “It’s your fault, too. Third Master told me. I’ve been in a daze these days, that’s why it was so easy for me to get deceived.” <br/><br/>After returning to the Imperial Capital, the two went to the Research Institute every day. <br/><br/>Kevin Clark occasionally went to Ryan Easton as well. <br/><br/>Andrew Lane accompanied Sophie Ortiz on a tour. <br/><br/>So for the time being, no one was available to take Charlotte Lane. <br/><br/>Charlotte Lane went to visit Old Master Lane on Monday, Wednesday, and Friday. <br/><br/>On Tuesday, Thursday, and Saturday, she went to Clark Manor with Kevin Clark. <br/><br/>On Sundays, where she went was up to her mood. <br/><br/>Two weeks after coming back, they rested for a day on Sunday. <br/><br/>After having breakfast, Kevin Clark went to the Easton Group, and Charlotte Lane stayed at home. After eating breakfast, she took over Kevin Clark’s study room. <br/><br/>She organized the experimental data and then began writing her thesis. <br/><br/>After lunch, Charles Amos joined her in the study room. <br/><br/>As she wrote her thesis, Charles Amos hugged his computer, typing and pausing in between, coding programs. <br/><br/>Charlotte Lane glanced at him: “What are you doing?” <br/><br/>“Mr. Clark assigned me a task.” Perhaps he encountered some difficulties, and Charles Amos’ little face looked a bit bitter. <br/><br/>“What task?” <br/><br/>“He wants me to inherit Ryan Easton, so I have to learn some things now,” Charles Amos said seriously. <br/><br/>Charlotte Lane: “......” <br/><br/>Charles Amos typed a few more characters and then stopped to look at Charlotte Lane. <br/><br/>Charlotte Lane knew what he was thinking as soon as she saw his eyes and immediately said, “I can’t help you, don’t look at me.” <br/><br/>“But you’re Nathan Ninevara.” <br/><br/>“Just because I’m Nathan Ninevara doesn’t mean I have to know everything,” Charlotte Lane continued writing her thesis, ignoring him. <br/><br/>Seeing that she really wouldn’t help him, Charles Amos had no choice but to note down what he didn’t understand and wait to ask Kevin Clark when he got back. <br/><br/>After a while, Charles Amos said, “Did something happen?” <br/><br/>“What do you mean?” Charlotte Lane’s eyes remained on her computer. <br/><br/>“Every time I go out these days, an uncle follows me,” Charles Amos said, “I already have bodyguards with me when I leave the house, so why suddenly add another one who sticks so close to me?” <br/><br/>Charlotte Lane’s expression changed slightly, and then she said, “Close protection pays more money. They just want to earn more money.” <br/><br/>Charles Amos’s lips twitched, and he accepted this reason: “...Okay.” <br/><br/>At around the 3 p.m., Charles Amos fell asleep in the study room. Charlotte Lane carried him back to the bedroom and watched him for a while before going to the Lotus Pond to walk around for a bit. <br/><br/>She sat on the swing, looking at the blooming lotuses. <br/><br/>After a while, she heard approaching footsteps and stopped the swing to look over. <br/><br/>Wilton Edwards walked over, stopped, looked at her with kind eyes, and called out, “Lady.”\t\t\t\t\t\t</div>", "images": {}, "success": true}