{"id": 556, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998872.html", "title": "Chapter 553: 496: Soothing The Child", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 553: 496: Soothing The Child</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 553: Chapter 496: Soothing the Child<br/><br/>Although Arthur North and Finn Clark hesitated for a while, they eventually gave the letter to Charles Amos after he had breakfast for more than an hour.<br/><br/>In the morning, Charles woke up and did not see Wilton Edwards. He had already looked around and asked where Wilton had gone.<br/><br/>However, Elina Clark and Natalie Wayne didn’t know how to explain it to him for the time being, so they vaguely told him that Wilton seemed to be busy outside.<br/><br/>Charles felt that something was wrong.<br/><br/>Maybe since he woke up from his nap yesterday afternoon, he felt that something was off about Wilton.<br/><br/>After finishing breakfast with doubts, he played the piano for a while. Arthur North and Finn Clark then handed him the letter.<br/><br/>Wilton’s letter didn’t say much, only that: [Young Master has grown up. It’s time for Grandpa Edwards to do his own thing. There’s another grandfather who needs Grandpa Edwards’ care, so he won’t accompany the Young Master anymore.]<br/><br/>It was just a simple sentence.<br/><br/>After reading the letter, Charles stared at the two people in front of him with bewildered eyes.<br/><br/>Arthur North and Finn Clark looked back at him, and neither of them spoke.<br/><br/>The three of them stayed silent for a while, and Charles holding the letter, asked them: “What does Wilton mean? Who is the other grandfather?”<br/><br/>Finn didn’t say anything.<br/><br/>Arthur replied softly, “You don’t know him.”<br/><br/>“Can’t he be brought to the Imperial Capital for care?” Charles asked again.<br/><br/>This time Arthur didn’t speak, but tacitly agreed that it was not possible.<br/><br/>“So... Wilton won’t come back anymore?” Charles asked, his eyes reddening, and his voice becoming hoarse.<br/><br/>“Yes,” Finn replied.<br/><br/>“Why?” After asking, Charles felt they wouldn’t answer, so he immediately asked another question, “Does my mom know?”<br/><br/>Arthur nodded, “Yes.”<br/><br/>Charles tilted his face up, and when he heard these two words, tears fell from his eyes.<br/><br/>He quickly raised his hand to wipe them, and then lowered his head trying to hold back the tears.<br/><br/>However, it wasn’t very successful. His little body was trembling, and he let out a faint sob.<br/><br/>Finn’s eyes twitched, “Charles.”<br/><br/>“I’m fine,” Charles choked, “I’ll be okay in a while.”<br/><br/>Finn frowned in sympathy.<br/><br/>Arthur patted Charles’ head, “It’s okay to cry if you’re upset.”<br/><br/>“He’s just closer to Lila,” Elina responded.<br/><br/>“Of course,” chimed in Natalie Wayne.<br/><br/>Charlotte was still a distance away when she saw Charles crying. As she approached, there was no sign of hurry in her steps. She watched him cry, getting closer step by step, like an ice-cold, heartless person.<br/><br/>But when she finally reached him, she squatted down.<br/><br/>Charles immediately hugged her neck, buried his face in her shoulder, and sobbed.<br/><br/>Arthur stood behind Charlotte, watching the two of them.<br/><br/>Charlotte didn’t say anything, she just let Charles hold her and cry. Until Charles had cried enough, his voice softened, and he buried his head inside her shoulder and whispered, “Can I still see Grandpa Edwards in the future?”<br/><br/>“I heard you’ve grown up,” Charlotte didn’t answer him, instead saying, “You said you wouldn’t cry.”<br/><br/>Charles had soaked her shoulder with tears. He moved and buried his face in her other shoulder, “I’m already like this, and you’re still making fun of me.”<br/><br/>“You’re like this, and I can’t even make fun of you?” Charlotte said, “Isn’t this just giving me a chance to mock you?”<br/><br/>Arthur chuckled.<br/><br/>Charles fell silent, “.......”<br/><br/>Seeing that he didn’t speak, Charlotte finally answered his previous question, “If you want to see him, you can go see him.”<br/><br/>“Really?” Charles asked softly.<br/><br/>“Yes,” Charlotte confirmed.<br/><br/>“What about you?” Charles asked again.<br/><br/>“I won’t go,” Charlotte replied. “Charles, what happens between us adults won’t affect you, so you don’t have to worry about anything. Right now, you’re little. If you want to do something, you need to tell me or someone else at home and let them take you there. When you grow up, where you want to go or who you want to see will be up to you. You don’t need to tell me anymore.”<br/><br/>Charles held onto her and was silent for a while, but he finally voiced his inner thoughts, “But I won’t be able to see Wilton every day.”<br/><br/>“Yes,” Charlotte replied. “So you should learn to accept it. No one can be with you every day. You’re growing up, and even if we wanted to see you every day, we wouldn’t be able to. Of course, that situation doesn’t exist, because I don’t want to see you every day.”<br/><br/>Arthur patted Charlotte’s head as he stood behind her.<br/><br/>Charles did not say anything, but just held onto her a little tighter.<br/><br/>Charlotte let him hold her for a while and then said, “Get up; my leg is numb.”<br/><br/>It was only then that Charles let her go, his eyes and nose red from crying.<br/><br/>Arthur helped Charlotte up.<br/><br/>Seeing Charles’ pitiful expression, Charlotte suddenly said, “Your snot is all over my clothes. You should at least pay for one.”<br/><br/>Charles pursed his lips, now even more heartbroken.\t\t\t\t\t\t</div>", "images": {}, "success": true}