{"id": 554, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998867.html", "title": "Chapter 551: 494: Each For Its Own Master", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 551: 494: Each For Its Own Master</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 551: Chapter 494: Each for Its Own Master<br/><br/>A gentle breeze blew by, causing the lotus flowers to sway softly in the wind.<br/><br/>Charlotte Lane looked at Wilton Edwards and asked, “Uncle Edwards, is something the matter?”<br/><br/>Wilton shook his head, then walked over to the edge of the lotus pond and gazed at the distant lotus flowers, saying, “Lady, time flies, doesn’t it?”<br/><br/>Charlotte looked at him, her hands gripping the swing’s rope tightening involuntarily: “Yes.”<br/><br/>“Young Master has grown up so quickly,” Wilton reminisced.<br/><br/>Charlotte remained silent.<br/><br/>Wilton was silent for a while before speaking again, “Lady, have I ever told you how I came to be by Edward Kirsten’s side?”<br/><br/>Charlotte’s thumb gently brushed the swing’s rope as she softly responded, “Mm.”<br/><br/>“Robert Kirsten and I were originally from an orphanage. When we were ten, we were chosen by Michael Kirsten, Edward Kirsten’s father, to participate in a training program. Over thirty of us were training together, eating and sleeping in the same place,” Wilton slowly recounted. “In the orphanage, we often went hungry, but at the training camp, we didn’t have to worry about being fed or clothed. Those days were the happiest times for Robert and me.”<br/><br/>“What happened after that?” Charlotte asked.<br/><br/>“We continued that life for eight years,” Wilton said. “After that, we were taken to a martial arts arena we had never been to before. Michael Kirsten, several years older than me at the time, said that out of the thirty of us, he only needed five. Whoever survived until the end was up to their own abilities. That was the first time I killed to stay alive – my victims were the friends who had been by my side for eight years.”<br/><br/>Charlotte looked at him: “Fortunately for you, both you and Robert Kirsten survived.”<br/><br/>“Yes,” Wilton calmly said, “After that, we became Michael Kirsten’s assassins.”<br/><br/>“Uncle Edwards, you don’t seem like an assassin,” Charlotte remarked. “You have too many personal feelings.”<br/><br/>“Lady, you are right. I have always longed for a peaceful and stable life,” Wilton said with a faint smile. “Before Michael Kirsten passed away, his orders were for us to take care of and protect Henry Kirsten and Lady Kirsten, to follow their commands.”<br/><br/>“Robert Kirsten and I grew up together, and he knows me well. He took over my share of the tasks, allowing me to stay at home and take care of Henry Kirsten and Lady Kirsten,” Wilton continued after a pause. “But Young Master Henry Kirsten has been distant since childhood, both towards his father and us. He doesn’t need anyone’s care. He knows what he wants and what he needs to do. All he needs are obedient subordinates. So my main task is to take care of Lady Kirsten.”<br/><br/>“So you have deep feelings for Lady Kirsten,” Charlotte remarked. “You treat her like your own daughter.”<br/><br/>“Yes.”<br/><br/>“What about Charles Amos then?” Charlotte asked. “Do you love him too because of her?”<br/><br/>“Initially, it was because Lady Kirsten gave her life for him, and he is her continuation,” Wilton’s voice grew slightly hoarse. “But later on... I really came to love him.”<br/><br/>“I know,” Charlotte said softly. “That’s why... I never worried that you would hurt Charles.”<br/><br/>“So... that’s also why you let me stay with Young Master Charles after you returned to the city,” Wilton looked at Charlotte.<br/><br/>Everyone has their own master.<br/><br/>Charlotte Lane did not respond.<br/><br/>“It is even more torturous for me if Lady does not expose the truth. Rather than this, it’s better to tell everything.” After saying this, Wilton Edwards pressed his eyes, “Lady is doing this because there is no direct evidence and wanted to force me to confess.”<br/><br/>“Do you know the consequences of saying this?” Charlotte Lane asked.<br/><br/>“Will Lady take my life?” Wilton Edwards looked at her.<br/><br/>Charlotte Lane looked back at him, and the two stared at each other for a long while. In the end, Charlotte Lane averted her gaze and plucked a lotus beside her.<br/><br/>For the past eleven years, Wilton Edwards had been like a father to her.<br/><br/>She respected, cherished, and trusted him.<br/><br/>Taking his life was something she couldn’t bear to do.<br/><br/>“Last year on M Continent’s Koymoon Island, I met Robert Kirsten.” She said quietly.<br/><br/>Wilton Edwards’ whole body tensed up again: “He...”<br/><br/>“He’s always wanted to see you, but I didn’t allow it,” Charlotte Lane said, “It seems I’ve hindered your reunion.”<br/><br/>“Lady is also protecting me.” Wilton Edwards asked, “How is he now?”<br/><br/>“In M Continent.” Charlotte Lane said, “I had someone break his legs.”<br/><br/>Wilton Edwards’ lips trembled, and his breathing quickened.<br/><br/>“You go take care of him, perhaps he can live a few more years.” Charlotte Lane’s voice was cold to the extreme, ruthless and numb.<br/><br/>Wilton Edwards gazed at her blankly.<br/><br/>“Say goodbye to Henry Horton today.” Charlotte Lane got up from the swing, “I will have someone send you away tomorrow.”<br/><br/>Wilton Edwards stood in place without a word.<br/><br/>“It’s up to you how you say it to him.” Charlotte Lane said, “He’s grown up now, he should learn to face separation.”<br/><br/>After saying this, Charlotte Lane left.<br/><br/>Wilton Edwards stood there for a long time before he left.\t\t\t\t\t\t</div>", "images": {}, "success": true}