{"id": 551, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998861.html", "title": "Chapter 548 - 491: Thank You All", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 548 - 491: Thank You All</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 548: Chapter 491: Thank You All <br/><br/>The elevator stopped at the sixth floor, and they were led out. <br/><br/>As they exited the elevator, Arthur North and Charlotte Lane both glanced at the hotel layout map next to the elevator. <br/><br/>There was a gym on the sixth floor, guarded by many people. Each person was armed with a gun. <br/><br/>They were led into the gym, where they discovered that there were more than twenty people inside. <br/><br/>“Stay put! Any attempts to escape will be met with deadly force!” <br/><br/>“If you value your lives, behave!” <br/><br/>Having said that, they closed the gym door and stood guard outside. <br/><br/>The other two couples immediately clung to each other, the men comforting the women. <br/><br/>Charlotte Lane surveyed the layout of the gym while Arthur North eyed the couples. He then turned his gaze to the rest of the people in the gym. <br/><br/>There were quite a number of couples, all huddled together. <br/><br/>“Little Girl.” <br/><br/>“Hmm?” Charlotte turned to look at him. <br/><br/>“They’re all huddling together, we should...” <br/><br/>Charlotte moved further away from him. <br/><br/>Arthur North: “.......” <br/><br/>Charlotte looked around the gym once more, then made her way toward several staff members in hotel uniforms. <br/><br/>They didn’t make a move in their room upstairs because their lives didn’t seem to be in immediate danger, so they followed the captors downstairs intending to understand the situation before making a decision. <br/><br/>Arthur North accompanied her. <br/><br/>The two of them sat down next to the staff. <br/><br/>Charlotte asked, “What’s happening outside? What’s going on?” <br/><br/>“Aren’t you scared?” A female staff member asked. <br/><br/>Charlotte responded calmly, “I am.” <br/><br/>Feeling that her response lacked emphasis, she added, “Very scared.” <br/><br/>Arthur North sat in silence. <br/><br/>The people around her were watching them. <br/><br/>Charlotte didn’t say anything else, and asked again, “What happened here?” <br/><br/>“We heard that a deception syndicate checked into the hotel this evening. They used a company team-building event as a cover to check in.” One of the staff members explained. <br/><br/>Charlotte listened. <br/><br/>“They were numerous, over a hundred of them. There were also around ten young men and women who seemed not to be quite lucid and had to be supported. They claimed those people were drunk, but they didn’t reek of alcohol,” another staff member added, “The hotel manager sensed something was off and decided to call the police.” <br/><br/>“After the police arrived, they checked the surveillance in the grand hall and recognized two men in duckbill caps who were under their surveillance.” A staff member continued, “The police immediately told the hotel to discreetly evacuate the other guests. They called in for backup.” <br/><br/>“But not many people had left before we were discovered.” <br/><br/>Charlotte got it. <br/><br/>Even if they had the capability to notify all the guests at once, mass evacuation would draw too much attention. <br/><br/>So, discreet, gradual evacuation was the sensible course of action, and less likely to create panic. <br/><br/>“Just do it.” Charlotte ordered. <br/><br/>“It’s dangerous outside.” One of the staff members hastily advised. <br/><br/>“Indeed, it’s very dangerous.” Charlotte had barely finished speaking when a sound was heard from below. <br/><br/>It was the sound of a megaphone. <br/><br/>“Attention police outside the hotel! I have gathered everyone inside the hotel to a few floors. I give you ten minutes to leave... otherwise, for every extra minute, I kill one person on each floor. I mean what I say.” <br/><br/>A war of words ensued from the ground level. <br/><br/>The crying and shouting inside the gym grew louder. <br/><br/>“What do we do? Will they really kill people? I don’t want to die yet.” <br/><br/>“I’m still young, what will my parents do?” <br/><br/>“They have guns; they’ll be daring enough to do anything. They’d definitely kill in order to escape.” <br/><br/>... <br/><br/>The cries grew louder and more heartbreaking one after another. <br/><br/>From the gym’s glass door, Charlotte watched as two figures stationed themselves at the entrance, seemingly ready to enter and commence the slaughter at any moment. <br/><br/>The despair inside the gym deepened. <br/><br/>“It’s time.” Kevin declared. <br/><br/>Charlotte merely nodded her agreement. Their chaos could disrupt the attacker’s plan, possibly throwing off the timing of the potential slaughter. At the very least, the people in this room would be safe. <br/><br/>The two of them sat on the treadmills, observing the doorway. <br/><br/>A few seconds later, Kevin announced, “Move.” <br/><br/>Both sprang into action instantaneously, their movements extremely swift. Approaching the entrance, they swung the door open. Before the two guards outside could react, they had taken them down. <br/><br/>All the people inside the gym witnessed this scene; every single sound had been silenced. <br/><br/>The people in the hallway immediately noticed them. <br/><br/>With the taken-down guards as human shields, Kevin and Charlotte seized their guns and fought back swiftly. <br/><br/>Gunshots echoed around, followed by spurts of fresh blood, prompting everyone inside the gym to cover their ears and scream. <br/><br/>The two staff members quickly sprung into action, moving the cabinets. But because they were nervous and scared, they couldn’t apply much force. <br/><br/>Seeing this, the other men present all came forward to help. <br/><br/>After several gunshots, no assistance had arrived from the room opposite the gym; once they confirmed safety, Kevin shot the door lock open with a gun. <br/><br/>Both entered the room, using it as a barricade to return fire. <br/><br/>A quick resolution was needed in case reinforcements arrived. <br/><br/>Once they had dealt with this floor, Kevin and Charlotte collected some of the guns and bullets from the downed attackers, preparing to move up to the other floors. <br/><br/>The people in the gym, noticing the silence outside, nervously called out, “Are you guys okay?” <br/><br/>Kevin and Charlotte, who had just reached the door, both paused. <br/><br/>Charlotte replied, “We’re fine.” <br/><br/>“Come in, there’ll surely be more of them coming up with all this commotion.” The people inside started moving the cabinets, “Quickly, come in.” <br/><br/>Charlotte looked at the door, hesitated, then said, “We’re going elsewhere. Stay indoors. Unless there’s a special situation, don’t come out. You should be safe inside.” <br/><br/>“OK. Be careful.” More than one voice urged them, quickly followed by another voice saying, “Thank you.”\t\t\t\t\t\t</div>", "images": {}, "success": true}