{"id": 559, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998881.html", "title": "Chapter 556: 499: Alice Eugene……", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 556: 499: Alice Eugene……</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 556: Chapter 499: Alice Eugene......<br/><br/>No one knows that Jessica Maxwell is the leader of the hate group.<br/><br/>All we know is that the organization behind the Hate Group Leader is enormous.<br/><br/>So its sudden dissolution has caused quite a bit of attention.<br/><br/>[Did...did the Third Master sue her?]<br/><br/>[I don’t think it has much to do with the Third Master. I remember when he first sued her, she was quite arrogant. Everyone knows her family is rich, and they seem to live in the Imperial Capital and have some connections to the Clark Family. It wouldn’t serve the Third Master well to meddle with her unless necessary.]<br/><br/>[Then what happened to her? I’m not used to this.]<br/><br/>[She deleted all the negative posts about Miss Brook from her Facebook.]<br/><br/>[I’m a fan from another fandom coming to gather some tips on how to dissolve a hate group.]<br/><br/>[I’m a fan from another fandom too, witnessing this for the first time. Just a bystander.]<br/><br/>[I’ve heard of haters becoming fans, but never of the leader of haters becoming a fan.]<br/><br/>[Although this ex-hater suddenly started praising our Miss Brook. As a fan, I suddenly feel a bit lost for what I should do.]<br/><br/>[You guys, what exactly did Miss Brook do to receive such praise from a former hate group leader?]<br/><br/>...<br/><br/>When Jessica Maxwell quit the internet, Lila Campbell was playing chess with Old Master Lane at home.<br/><br/>They were sitting under a rose trellis, a mosquito coil burning next to the chess board, small colored lights illuminating the vine rack above them.<br/><br/>“Lila, Charles Flores visited yesterday.”<br/><br/>Lila Campbell raised an eyebrow and took one of Old Master’s knights on the chess board: “Did he come to see you?”<br/><br/>Old Master Lane chuckled, “Why are you pretending to act silly now? When has he ever come to see me?”<br/><br/>“During Chinese New Year.” Lila Campbell answered.<br/><br/>“Exactly.” Old Master Lane said with a clicking sound, “And I didn’t actually ask when he came to see me. You little girl...”<br/><br/>Lila Campbell smiled.<br/><br/>“The older you get, the naughtier you become. Do you bully Arthur North every day?”<br/><br/>“Grandpa, I am your real granddaughter.” Lila Campbell reminded him.<br/><br/>Old Master Lane chuckled at her before speaking again, “Charles Flores wants me to persuade you to return to the Court Music Academy. He wants you to take over it.”<br/><br/>“Grandpa, I’ve already told my teacher that I lack the time,” Lila Campbell said gently, “The research institute is demanding, and I don’t have much time for anything else, not just the Court Music Academy.”<br/><br/>“Indeed, the Research Institute will keep you busy if that’s where your focus is.”<br/><br/>Lila Campbell glanced at Old Master Lane and the corner of her mouth curled upward, but she didn’t say anything.<br/><br/>Old Master Lane got up, and Charlotte Lane too, stood up with him.<br/><br/>“You should go to bed early too.” Old Master Lane said to Charlotte Lane.<br/><br/>“Okay.” Charlotte Lane replied, “Goodnight, Grandfather.”<br/><br/>After waiting for Old Master Lane to return to his room, Charlotte Lane sat outside for a while longer.<br/><br/>She finished her call with Kevin Clark, and then received another call from Felix Baker.<br/><br/>Jace Miles wanted to see her.<br/><br/>Giving it some thought, he might want to discuss matters about the Miles Family, so she agreed and decided to meet after work the next day.<br/><br/>After ending the call with Felix Baker, Charlotte Lane went back to her room to sleep.<br/><br/>Meanwhile, on M Continent.<br/><br/>Due to the time difference, it was still day time in M Continent.<br/><br/>Stella Edwards’ performance in M Continent ended two days ago.<br/><br/>After resting for two days at her hotel, she went to Edward Kirsten’s current location in M Continent.<br/><br/>Even though there was no communication between them, Edward Kirsten clearly knew her performance schedule.<br/><br/>So if she had a performance, there was a high probability that Edward Kirsten would be here in the days following the end of the performance.<br/><br/>Like always, Stella Edwards arrived at this location by car.<br/><br/>The courtyard was also as usual, full of servants and bodyguards.<br/><br/>All familiar faces that would be in the mansion whether Edward Kirsten was there or not.<br/><br/>Stella Edwards asked at the entrance if Henry Kirsten had arrived.<br/><br/>They said he had.<br/><br/>Stella Edwards was still somewhat happy.<br/><br/>No matter if the person in his heart was her or not, she was still happy because he came here.<br/><br/>Stella Edwards quickened her pace a bit towards the courtyard.<br/><br/>She first went to the front courtyard, after not finding anyone there, she went to the backyard.<br/><br/>However, just as she was about to reach the backyard, being two to three meters away from the Moon Gate, she suddenly heard the sound of a cup shattering from inside the room in the backyard.<br/><br/>The noise was loud, even from this distance, it could be heard that it was forcefully thrown on the ground.<br/><br/>Startled, Stella Edwards stopped moving, unconsciously sidestepping to avoid directly standing in front of the Moon Gate.<br/><br/>Immediately after, a sharp clamor of a slap was heard.<br/><br/>And then Edward Kirsten’s furious roar: “Alice Eugene! How dare you defy my command and target Enigma Starry!”\t\t\t\t\t\t</div>", "images": {}, "success": true}