{"id": 565, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998899.html", "title": "Chapter 562: 505: Going To M Continent Again", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 562: 505: Going To M Continent Again</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 562: Chapter 505: Going to M Continent Again<br/><br/>Sophie Ortiz’s tour had long ended, and she should have already returned.<br/><br/>But Andrew Lane and Sophie Ortiz said they wanted to spend some time in M Continent and attend a dance exchange meeting, so they delayed their return until now.<br/><br/>However, it now appeared that they were not having fun in M Continent, and the exchange meeting might not even exist.<br/><br/>They were in M Continent because of an accident that Stella Edwards had.<br/><br/>After finishing a phone call, Charlotte Lane sat on her bed, thinking about Stella Edwards’s situation.<br/><br/>She was wondering why they hid Stella’s accident from her.<br/><br/>Was it just her, or were they hiding it from others too?<br/><br/>While she was thinking, Arthur North returned to the room.<br/><br/>Arthur North quietly entered the room, walked inside, and saw her sitting beside the bed. Once he got closer, he leaned down and gently kissed the top of her head, “Awake?”<br/><br/>Charlotte Lane turned her eyes towards Arthur North, “Yes.”<br/><br/>“What’s wrong?”<br/><br/>“My mother just called me.” Charlotte Lane looked at him and said, “She said Stella woke up and wants to see me.”<br/><br/>Arthur North looked at her, his expression unchanged, as calm as ever when he heard about things.<br/><br/>But Charlotte Lane could tell that he knew about this.<br/><br/>So... only she didn’t know, and everyone else was hiding it from her.<br/><br/>“Why didn’t you tell me?” Charlotte Lane spoke up, “I want the truth.”<br/><br/>It was a situation that everyone had worked on together, but in the end, only he had to bear the consequences.<br/><br/>Arthur North swallowed lightly, pulled a chair to sit opposite her, and said truthfully, “It was discovered in the mansion in M Continent. When she was found, her condition wasn’t very good, so... we discussed it and decided not to tell you.”<br/><br/>Charlotte Lane’s eyes narrowed slightly.<br/><br/>Arthur North tentatively touched her hand, seeing that she didn’t avoid him, he took her hand, “We didn’t want you to worry.”<br/><br/>The person was found at Edward Kirsten’s suspected resting place.<br/><br/>So, Stella’s accident might be related to Edward Kirsten.<br/><br/>Ever since Stella was sent to the hospital, she had been in a coma.<br/><br/>If she didn’t wake up, many things could only be guessed at.<br/><br/>Judging from the other resting places.<br/><br/>Arthur North could guess why Stella Edwards might have been in contact with Edward Kirsten.<br/><br/>The “same door” dance would surely have similarities.<br/><br/>And it was unknown whether Stella would wake up or not.<br/><br/>It would be best if she woke up.<br/><br/>If she couldn’t wake up... Charlotte Lane would bear this life on her shoulders again.<br/><br/>More than ten hours.<br/><br/>Charlotte Lane slept restlessly on the plane.<br/><br/>Upon arrival, they went straight to the hospital where Stella Edwards was staying.<br/><br/>Both Sophie Ortiz and Andrew Lane were there. Sophie Ortiz had also lost some weight.<br/><br/>The few of them chatted outside the ward for a while.<br/><br/>Charlotte Lane asked, “Will her leg affect her dancing in the future?”<br/><br/>“It’s hard to say for now.” Sophie Ortiz said dejectedly, “The doctor said it depends on her recovery. Stella’s mood is not very good. She cries all the time.”<br/><br/>Charlotte Lane didn’t say anything.<br/><br/>Arthur North squeezed her hand.<br/><br/>“Light Song, she always says she has something to tell you.” Sophie Ortiz said, “I asked her to tell me, but she wouldn’t.”<br/><br/>Charlotte Lane squeezed her hand, “Don’t worry, it’ll be alright.”<br/><br/>“Mm.”<br/><br/>After they had finished talking, Arthur North accompanied Charlotte Lane to the ward. Charlotte entered the ward, and he waited at the entrance.<br/><br/>Stella Edwards seemed to have just finished crying, her eyes were red and still wet.<br/><br/>When she saw Charlotte Lane, she instinctively wiped her tears again.<br/><br/>She was lying on the bed, her left leg fixed.<br/><br/>For so long, the bruise caused by the choke on her neck could still be seen faintly.<br/><br/>She had lost a lot of weight and looked haggard.<br/><br/>“You’re here?” Stella Edwards whispered.<br/><br/>“Yes.” Charlotte Lane stood by the foot of the bed, looking at her.<br/><br/>“Sit.” Stella Edwards glanced at the bedside stool.<br/><br/>Charlotte Lane sat down beside the bed.<br/><br/>Stella Edwards looked at her, and neither of them spoke.<br/><br/>The ward was quiet for a while.<br/><br/>Then Stella Edwards said weakly, without emotion, “Don’t you want to ask about my injury?”<br/><br/>Charlotte Lane remained calm, her voice cold and distant, “I asked the doctor outside.”<br/><br/>She finished and added, “Take good care of yourself, and you’ll recover.”<br/><br/>Stella Edwards looked at her for a while, then forced a smile, “If my leg is ruined, I don’t know what I can do in the future? I don’t even know the meaning of living.”<br/><br/>Charlotte Lane rubbed her fingertips.<br/><br/>Stella Edwards whispered again, “I’ve always thought I was born for dancing. And I always believed that the day I couldn’t dance would be the end of my life.”\t\t\t\t\t\t</div>", "images": {}, "success": true}