{"id": 566, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998902.html", "title": "Chapter 563: 506: She Is Still Alive…", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 563: 506: She Is Still Alive…</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 563: Chapter 506: She Is Still Alive...<br/><br/>Charlotte Lane was not good at comforting others, so she just listened quietly.<br/><br/>“I’ve always felt that dancing is the reason for my existence in this world.” Stella Edwards’s voice was very soft, like a weak force, as if the silence was due to overwhelming sadness with no vitality, “But then I met a person...”<br/><br/>Charlotte Lane’s pupils shrank slightly.<br/><br/>Stella Edwards looked out the window and continued: “He was very gentlemanly and gentle. From the first moment I saw him, I felt that there was an extra reason for me to be in this world. He really liked my dancing, and he watched every repertoire of mine. He even understood the subtle changes I’ve gone through since I first stepped on stage.”<br/><br/>Charlotte Lane fell into an extreme state of calm.<br/><br/>“I know we don’t have much in common.” Stella Edwards was still looking out the window, “I also know he is mysterious, and I’ve thought that a person who doesn’t use electronic devices much should be treated with precaution. But I still fell for him.”<br/><br/>“He would send me a bunch of roses after each performance. No matter where I performed, his flowers would always be delivered.” Stella Edwards’s tone suddenly lightened up a little, “Sometimes he would come to see me personally. He would remember what I liked to eat and recommend some dishes to me. He would also remember my favorite clothing styles and then give me other styles of clothes, telling me they suited me better.”<br/><br/>Charlotte Lane’s eyes darkened slightly.<br/><br/>“He would also talk about things I was more familiar with, such as ... dancing, and ... my favorite actress — Daisy Zane. I always thought that everything he did was out of genuine love for me. I even thought he really liked me. More than that, when I went to see him, I would deliberately dress according to his advice.”<br/><br/>Stella Edwards looked at Charlotte Lane, the lightness in her voice gone: “Later I found out that I was just a substitute. Everything he did was just to make me resemble the person in his heart more. Right? Enigma Starry.”<br/><br/>Charlotte Lane looked at her and after a while, said: “So ... that’s the reason for your hostility towards me.”<br/><br/>“Yes,” Stella Edwards admitted.<br/><br/>“How did you find out?” Charlotte asked.<br/><br/>Stella Edwards’s hostility towards her began a few months ago.<br/><br/>If she knew from Edward Kirsten, he wouldn’t have waited until now to make a move against her.<br/><br/>Moreover ... Edward Kirsten wouldn’t tell her these things.<br/><br/>“Alice Eugene told you,” Charlotte Lane said.<br/><br/>“Yes,” Stella Edwards admitted again.<br/><br/>Charlotte Lane raised her eyebrows slightly, her eyes filled with cold frost: “What else did she tell you? To kill me? Replace me?”<br/><br/>Stella Edwards looked at her and fell silent for a moment, then said, “You really understand them.”<br/><br/>Charlotte Lane didn’t speak.<br/><br/>Edward Kirsten would often stay with her at home for three to five days and then leave for a while. A week, half a month, but never more than a month.<br/><br/>But that time he stayed with her for almost two months.<br/><br/>“Have you ever thought of doing this?” Charlotte asked again.<br/><br/>Stella Edwards stared at her, trying to discern what she was thinking from her expression.<br/><br/>But the person in front of her was too calm, she could not see anything.<br/><br/>“When I first found out, I indeed hated you and was jealous of you. I even felt that I was your substitute everywhere. I was in Edward Kirsten’s life and also in Teacher’s.” When Stella Edwards mentioned her teacher, she suddenly lowered her eyes in shame, “But after calming down, I thought about it. What did you do wrong? It was Edward Kirsten who used me as your substitute, not you. And ... I’m not so desperate to confuse right and wrong. Especially after the things he did.”<br/><br/>“My mother never praised me for my dancing.” Charlotte Lane said, “But she often said at home that you were very talented. It was your talent and hard work that made you who you are today. We are two different individuals. In her heart, the Lane family had three daughters.”<br/><br/>“That’s why I feel guilty.” Stella Edwards said, “How could I think of Teacher like that?”<br/><br/>Charlotte Lane still didn’t comfort her but asked: “What was he doing that you mentioned? What happened?”<br/><br/>“319. Don’t you know? 319 seems to be his production.” Stella Edwards’s voice gradually became weaker and fearful, “I overheard it. I overheard Edward Kirsten’s conversation with Alice. So ... Edward Kirsten tried to kill me.”<br/><br/>Charlotte Lane frowned slightly: “Did Edward Kirsten try to kill you because you eavesdropped on him?”<br/><br/>“Yes.” Stella Edwards was still scared when she thought about it.<br/><br/>Edward Kirsten at that time was too terrifying.<br/><br/>“Wasn’t that more than twenty days ago?”<br/><br/>Stella Edwards agreed.<br/><br/>“A conversation between Edward Kirsten and Alice?” Charlotte Lane asked, “Are you sure it was Alice?”<br/><br/>“I’m sure.” Stella Edwards gripped the quilt, her voice getting softer, “Edward Kirsten was furious with her because she wanted to kill you. He hit her, choked her, and also stabbed a dagger into her left breast, causing a lot of bleeding. I personally saw Alice being carried out of the room to be taken to the hospital.”<br/><br/>“Is she still alive?” Charlotte Lane whispered.<br/><br/>“Alice?” Stella Edwards thought for a moment and said, “I vaguely heard Edward Kirsten say something about a research subject, how interesting it is, and that her heart isn’t here. The distance was quite far, so I could only hear Alice’s screams, not Edward Kirsten’s clearly.”<br/><br/>Charlotte Lane lowered her eyes and touched her knuckles, a fleeting irritation flashing in her eyes.<br/><br/>“My main purpose is to talk to you about the 319 incident. Alice said they were the source.” Stella Edwards ́s speech slowed down, “Now they are always tracking 319. I hope I can also provide some help.”\t\t\t\t\t\t</div>", "images": {}, "success": true}