{"id": 562, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998890.html", "title": "Chapter 559: 502: Dark Radiance In Action", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 559: 502: Dark Radiance In Action</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 559: Chapter 502: Dark Radiance in Action<br/><br/>Once mid-October passed, the weather became increasingly cooler.<br/><br/>As a result... Charlotte Lane’s right to eat ice cream was stripped away once again.<br/><br/>After getting off work at the Research Institute, Charlotte Lane and Kevin Clark went back to Clark Manor together.<br/><br/>After dinner, Kevin Clark went to the study room to talk to Elina Clark for a bit.<br/><br/>It only took 30 minutes, but when he came out, he only found Tom Wayne and Hardy Clark in the living room.<br/><br/>“Where’s Auntie?” Kevin Clark asked.<br/><br/>“Auntie said she was tired and took Charles Amos back to the North Court,” Hardy Clark replied.<br/><br/>Kevin Clark frowned slightly.<br/><br/>Hardy Clark, holding Tom Wayne’s arm, snuggled on the sofa watching TV, and said, “Third Uncle, you’re so inconsiderate of Auntie. You didn’t even know she was tired, and you went to the study room with Grandfather after dinner, leaving Auntie here alone.”<br/><br/>Tom Wayne glanced at Kevin Clark, and upon seeing his dark face, chuckled in his heart.<br/><br/>Kevin Clark looked at Hardy Clark, “Sit properly.”<br/><br/>Hardy Clark subconsciously straightened her body, then cautiously glanced at Kevin Clark.<br/><br/>But Kevin Clark did not look at her again, and simply left.<br/><br/>At this time, in the North Court, Charlotte Lane and Charles Amos, one big and one small, sat on the swing near the rose field. Each of them held an ice cream in their hands, seeming very happy.<br/><br/>“Why are we here?” Charles Amos asked.<br/><br/>Charlotte Lane lazily said, “Keep it down.”<br/><br/>“Why are we here?” Charles Amos asked quietly.<br/><br/>“It looks nice here.” Charlotte Lane looked at the first day’s full moon in the sky.<br/><br/>Charles Amos looked at the roseless roses and did not dare to refute.<br/><br/>“But there are mosquitoes here.” Charles Amos said, “We didn’t bring mosquito repellent. Why are there still mosquitoes at this time?”<br/><br/>“Do you want to eat ice cream here or go back?” Charlotte Lane asked calmly.<br/><br/>Bring mosquito repellent? Too much smoke would give their position away too quickly.<br/><br/>“Eat ice cream.” Charles Amos chose without hesitation.<br/><br/>Although Charlotte Lane said that, she still used the sleeve of her removed coat to drive mosquitoes away from him, “Do you want to go to school?”<br/><br/>“Huh?” Charles Amos almost choked on the ice cream in his mouth.<br/><br/>“I don’t think I can let you be this happy.” Charlotte Lane said lightly, “It’s time for you to taste the bitterness of studying.”<br/><br/>Charles Amos: “......”<br/><br/>The direction of the matter... it didn’t go quite as she expected.<br/><br/>Her fingers slowly tapped the computer, thinking when Kevin Clark returned after just over two minutes with an ointment in his hand.<br/><br/>She watched Kevin Clark approaching.<br/><br/>“Why are you looking at me?” Kevin Clark walked to her side, looking down at her. “Do you think I left because I was angry?”<br/><br/>Charlotte Lane raised her eyebrows slightly.<br/><br/>Kevin Clark brought a chair over with his foot, sat down, squeezed some ointment, and applied it to Charlotte Lane’s arm.<br/><br/>There were three mosquito bites on her arm.<br/><br/>“I just went to see Charles Amos, and he said he wasn’t bitten by mosquitoes,” Kevin Clark said.<br/><br/>“Maybe... his blood isn’t sweet enough.”<br/><br/>Kevin Clark chuckled, “How many did you eat?”<br/><br/>“What?”<br/><br/>Kevin Clark looked at her.<br/><br/>Charlotte Lane looked at him too.<br/><br/>“Charles Amos has already confessed, so you should confess too,” Kevin Clark looked at her, his eyes suddenly hardening, “Otherwise...”<br/><br/>“Or what?”<br/><br/>Just as Kevin Clark was about to speak, Charlotte Lane’s cell phone suddenly rang.<br/><br/>Both of them turned their heads to look, and the note showed a bunch of random codes. But Kevin Clark remembered this chaos, it was Luke.<br/><br/>Charlotte Lane answered the phone.<br/><br/>Luke said directly, “Boss, I have something to report to you.”<br/><br/>“Go ahead.”<br/><br/>“Do you know that Dark Radiance has been very active lately?” Luke suddenly asked cautiously.<br/><br/>Charlotte Lane looked at Kevin Clark.<br/><br/>Kevin Clark’s eyes asked her a question.<br/><br/>“I don’t know,” Charlotte Lane replied to Luke.<br/><br/>Luke was silent for a moment, then said, “Dark Radiance has been active on various continents recently. In just half a month, they have disrupted sixty-seven 319 transactions and arrested many people.”<br/><br/>Charlotte Lane’s eyes flashed lightly.<br/><br/>Seeing her not speaking, Luke continued, “They say there have been several seemingly resting places where there was fierce fighting. And in one place... during the fight, they saw a masked man being escorted away. Although they were too far away to see his face clearly, they speculated that it might be Edward Kirsten.”\t\t\t\t\t\t</div>", "images": {}, "success": true}