{"id": 564, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998896.html", "title": "Chapter 561: 504: Want To See You", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 561: 504: Want To See You</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 561: Chapter 504: Want to See You<br/><br/>It was a new week and Charlotte, Harton Clark, and William Lane went straight to the meeting room at the Research Institute.<br/><br/>Ezekiel Santiago made a call for a meeting in the meeting room.<br/><br/>When they arrived, besides Ezekiel, Turner Daniel and long-unseen Siera Santiago were also in the meeting room.<br/><br/>Turner Daniel sat upright while Siera Santiago looked as if she had just woken up. Ezekiel Santiago looked well, showing no signs of illness.<br/><br/>The main focus of the meeting was around the progress of some experiments that Charlotte Lane, Harton Clark, and William Lane were responsible for, as well as the emphasis of the future work.<br/><br/>At the end of the meeting, Ezekiel asked about the condition of Turner Daniel in recent days.<br/><br/>The latter briefly reported his situation.<br/><br/>Then Charlotte also gave an evaluation: “Not bad.”<br/><br/>These three words were already satisfactory to Ezekiel Santiago.<br/><br/>Turner Daniel also smiled, curving his thin lips.<br/><br/>The meeting ended, and one of Santiago’s assistants came in with some files for Charlotte Lane and William Lane.<br/><br/>They both needed to sign off on some experimental data they were responsible for.<br/><br/>Harton Clark and William Lane reviewed all the data without finding any issues and signed off on them.<br/><br/>When they handed the files back to the assistant, William Lane said, “Looks like Assistant Qinke is busy with these trivial matters now.”<br/><br/>Assistant Qinke smiled warmly, “All of it is part of my job.”<br/><br/>Ezekiel also said, “I’m getting old, not as energetic as before. The other assistant asked for leave to attend family matters. Peter Qinke has been working around the clock recently.”<br/><br/>“You should hire another one,” Siera Santiago said weakly.<br/><br/>“Even if we found one, they would need to be interviewed. And I really don’t feel comfortable making Peter responsible for those tasks. Let’s see how things go when it gets a little easier,” Ezekiel Santiago replied.<br/><br/>“Only Peter Qinke can tolerate your eccentricities. Finding another one would be difficult,” Siera Santiago retorted.<br/><br/>Charlotte Lane handed the files and the pen back to Peter Qinke, then glanced at Siera Santiago.<br/><br/>Ezekiel Santiago: “........ With so many people here, could you give me some face?”<br/><br/>“There are no outsiders here anyway,” Siera Santiago said, yawning.<br/><br/>“You sure act familiar,” Ezekiel Santiago huffed.<br/><br/>“Because I am,” Siera Santiago pointed at Harton Clark. “This one is my promised bridegroom number one.”<br/><br/>Harton Clark’s thin lips tightened a bit, subconsciously looking towards Charlotte.<br/><br/>Charlotte didn’t look at him, but she raised her eyebrow slightly.<br/><br/>Siera Santiago pointed at William Lane, “And he is my promised bridegroom number two.”<br/><br/>William Lane just laughed it off casually.<br/><br/>In the beginning, possibly due to overconfidence, Edward Kirsten didn’t take any measures to protect the other trading spots even when many were being destroyed.<br/><br/>They even continued operating.<br/><br/>It wasn’t until the losses became too heavy that they slowly started to retreat and relocate.<br/><br/>Therefore, by the time they arrived at some places, they would find nothing but abandoned sites.<br/><br/>However... the situation still seemed to be rather optimistic for Kevin and his team.<br/><br/>Edward Kirsten’s careful plans and strategies were all in vain, and he was driven to the point where he could not launch a counterattack. This was nothing short of a soul-wrenching blow for Edward Kirsten.<br/><br/>All things seemed to be developing in a beneficial direction.<br/><br/>The rest day arrived.<br/><br/>Charlotte spent the first half of her rest day asleep.<br/><br/>She didn’t eat breakfast, and even lunchtime had passed.<br/><br/>It was Kevin who, out of fear that she’d starve, woke her up to have lunch.<br/><br/>After eating, she didn’t go back to sleep. She had some matters to deal with, while Kevin sat beside her, massaging her waist.<br/><br/>Seeing the stark contrast between the two of them after pulling an all-nighter, Charlotte finally couldn’t hold back and asked, “Kevin Clark, have you been secretly fortifying yourself behind my back?”<br/><br/>Kevin Clark: “......”<br/><br/>“Or have you been developing some kind of medication for yourself?” Charlotte asked lazily while looking at her computer, “We’re both human, why are you so energetic?”<br/><br/>Kevin reflected on himself for a moment, then responded, “I’ll try to keep myself in check next time.”<br/><br/>Charlotte Lane snorted, thinking: Like I’d believe you.<br/><br/>After finishing her work, Charlotte went back to sleep, and didn’t wake up until past eight o’clock in the evening.<br/><br/>She opened her eyes, looked at the dim room, was startled for a couple of seconds, then sat up on the bed. Kevin wasn’t in the room.<br/><br/>She hadn’t allowed herself to oversleep like this in a long time.<br/><br/>She used to love lingering in bed, but she didn’t have the luxury of time now.<br/><br/>She figured that today was a day to indulge in some laziness.<br/><br/>She unlocked her phone and replied to a few messages, planning to go find Kevin.<br/><br/>Just as she was about to step on the floor, her phone rang.<br/><br/>It was a call from Sophie Ortiz.<br/><br/>Charlotte picked up, “Mom, what’s up?”<br/><br/>Sophie Ortiz first asked about her well-being, then posed her question, “Charlotte, are you busy with work at the institute right now?”<br/><br/>“It’s manageable. What’s going on?”<br/><br/>“There’s a bit of an issue, I’m afraid I’m going to have to trouble you with a trip to M Continent.” Sophie said, “Chloe Davis has had some issues and has been in the hospital. She woke up yesterday and today...she keeps saying she wants to see you.”\t\t\t\t\t\t</div>", "images": {}, "success": true}