{"id": 561, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998887.html", "title": "Chapter 558: 501: Ziwei Enters Destiny", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 558: 501: Ziwei Enters Destiny</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 558: Chapter 501: Ziwei Enters Destiny<br/><br/>“Mr. Kirsten, someone is coming our way.”<br/><br/>Edward Kirsten was squatting on the ground, releasing his hand from Stella Edwards’s neck.<br/><br/>Immediately, Stella fell to the ground, motionless. Her face was turning blue, with tears still undried on her face, and her left leg was twisted in an unnatural way.<br/><br/>The person who came to report glanced at Stella and dared not move his eyes further.<br/><br/>Edward Kirsten didn’t look at Stella either and stood up, asking, “Who is the person coming?”<br/><br/>“Not sure.”<br/><br/>“Even in such a hidden place, we’re discovered, and you don’t even know who the intruder is,” Edward Kirsten said softly, “you’re really capable.”<br/><br/>The man in front of him lowered his head even more.<br/><br/>Edward Kirsten didn’t say anything else, found a mask to wear, picked up his coat, and headed straight for the back door.<br/><br/>The enemy came violently, and soon the entire mansion was surrounded.<br/><br/>At first, both sides were evenly matched, but Edward Kirsten didn’t fight back, taking advantage of the fierce battle between the two sides, and sneaking away with two people in the chaos.<br/><br/>It took almost half an hour for the noise of the fight to gradually stop.<br/><br/>Of Edward Kirsten’s people, besides him and the two he took away, none of the others could escape, and all were lost here.<br/><br/>After the fight stopped, the courtyard was searched again.<br/><br/>Nothing useful was found, but they did discover that Stella Edwards was still breathing faintly, so they took her away...<br/><br/>**<br/><br/>Domestic.<br/><br/>After Charlotte Lane got off work at the Research Institute, Harton Clark accompanied her to meet Jace Miles.<br/><br/>They agreed to meet at a nearby coffee shop of Spotlight.<br/><br/>Charlotte Lane asked Harton Clark to wait in the car, and she went to meet Jace alone. By the time she arrived, Jace had been sitting inside for a while.<br/><br/>After sitting down, Jace looked at her for a while and hesitated, “I don’t know how to address you.”<br/><br/>Charlotte Lane looked at Jace’s haggard face and asked, “Why?”<br/><br/>“You’re not Daisy. I don’t know how to address you,” Jace didn’t beat around the bush and was very direct.<br/><br/>He didn’t even ask if they wanted to drink something.<br/><br/>“You don’t have to address me.” Charlotte Lane admitted directly as well.<br/><br/>Jace was surprised for a moment and touched the coffee cup in front of him, “I didn’t expect you to admit it so simply.”<br/><br/>It was just that Johanes had been completely led astray by Old Master Miles.<br/><br/>Or perhaps like Charles Hobson.<br/><br/>Except for being spoiled by the Hobson family, Charles didn’t seem to have much of a cunning mind.<br/><br/>“I shouldn’t have asked, but as their son, I still want to try.” Jace Miles lowered his head, not looking at Charlotte Lane, and struggled to speak. “I want to plead for my parents. I’ll do anything. I just want to plead for them. No matter what, my parents don’t deserve to die.”<br/><br/>“Whether they deserve to die or not, the law will decide. This plea...should not be brought to me at all.”<br/><br/>Jace Miles gripped his hand and hesitated for a moment. “I, I’m worried...”<br/><br/>“Worried that I would let the Clark family interfere?” Charlotte Lane asked.<br/><br/>Jace Miles tacitly accepted.<br/><br/>“We don’t have that much idle time,”Charlotte Lane said.”Everything will be judged as it should be. If you don’t accept the result, you can appeal, including me.”<br/><br/>Jace Miles didn’t say anything.<br/><br/>Charlotte Lane knew in her heart. Old Master Miles, with human lives on his hands, would never be released.<br/><br/>As for Johanes Miles and Charles Hobson, their hands were far from clean, and once they entered, they would be thoroughly investigated.<br/><br/>Although not punishable by death, by the time they got out, they would be too old to cause any more trouble, especially without Old Master Miles to give them advice.<br/><br/>“Do you have any other questions?” Charlotte Lane asked.<br/><br/>Jace Miles shook his head.<br/><br/>Surprisingly, he didn’t ask about Amelia Miles. Charlotte Lane thought, something seemed to have happened between the two siblings.<br/><br/>“Well, then I’ll leave.” She said and stood up.<br/><br/>Jace Miles also stood up, and suddenly said, “If the Miles family hadn’t targeted you, and had taken responsibility for their mistakes instead of continually targeting you, would things have turned out better?”<br/><br/>Charlotte Lane looked at him.<br/><br/>Jace Miles said, “You’ve never made things difficult for me at Spotlight. In fact...my time at Spotlight has been very good, with excellent treatment.”<br/><br/>“Why should I make things difficult for you?” Charlotte Lane countered.<br/><br/>Jace Miles was stunned for a moment.<br/><br/>“And...there are no ‘ifs’.” Charlotte Lane put her hands in her pockets, “Weigh things well. Don’t bear the consequences and then think about ‘ifs’.”<br/><br/>Jace Miles heard the warning in her words.<br/><br/>After hesitating for two seconds, when she reached the door of the private room, he suddenly asked, “What kind of person is she?”<br/><br/>Charlotte Lane paused, pinched her fingertips, and whispered, “All the adjectives in the world cannot describe how wonderful she is.”\t\t\t\t\t\t</div>", "images": {}, "success": true}