{"id": 568, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998908.html", "title": "Chapter 565: 508: Returning To The Capital", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 565: 508: Returning To The Capital</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 565: Chapter 508: Returning to the Capital<br/><br/>It’s the time when everyone returns to their dormitories in the evening, and there were quite a few people at the entrance of the dormitory building.<br/><br/>Daisy Zane took Jessica Maxwell for a walk outside, noticing that she kept holding her hand, she asked, “What’s the matter? Why are you in such a hurry?”<br/><br/>“I need to speak to Daisy in person, do you have her contact information?” Jessica Maxwell tightened her grip on her arm, “It’s urgent, a matter of life and death.”<br/><br/>“Hold on, I’ll call her.” Daisy Zane said while dialing Charlotte Lane’s number.<br/><br/>But after calling three times, the other party was temporarily unreachable.<br/><br/>“What about Third Master Clark?” Jessica Maxwell asked again.<br/><br/>Daisy Zane also contacted Kevin Clark, and it was the same situation – temporarily unreachable.<br/><br/>She thought for a moment and said, “They should be on the plane, not in the country.”<br/><br/>“Not in the country, not in the country.” Jessica Maxwell’s head was confused, and she couldn’t think of who to turn to. She didn’t even know who she could trust.<br/><br/>“What exactly is going on? Why don’t you tell me first?” Daisy Zane tried moving her arm but couldn’t break free, “Since it’s a matter of life and death, why not call the police?”<br/><br/>“Call the police? No, we can’t call the police.” Jessica Maxwell stared blankly at a spot.<br/><br/>If she called the police, and it alarmed the Maxwell Family, the Maxwell Family might try to contain the situation. Then she would be done for.<br/><br/>“Jessica Maxwell, what on earth is going on?” Daisy Zane asked again.<br/><br/>Jessica Maxwell finally looked at Daisy Zane; she stared at her for a while before deciding to take a bet and try to trust Daisy Zane.<br/><br/>She pulled Daisy Zane and looked to the side, planning to take her for another walk.<br/><br/>At this moment, two girls passed by on their way back to the dormitory.<br/><br/>Although there was a distance of several meters between them, the two girls spoke quite loudly.<br/><br/>“Did you see the hot search? Dean Yue was sent to the hospital.”<br/><br/>“I saw it. There was just a video of an ambulance at the entrance of the Santiago Family’s house. But as soon as I clicked on it, the video was gone before I had a chance to look at it carefully.”<br/><br/>“Someone must have removed it, Facebook dared not show it.”<br/><br/>“So, is this very serious? Dean Yue is not young anymore.”<br/><br/>“Will the Research Institute be in danger?”<br/><br/>“That’s hard to say. Dean Yue is such a good person, I really hope nothing happens to him.”<br/><br/>Hearing the conversation of the two girls, Daisy Zane and Jessica Maxwell both froze for a moment. Then a few seconds later, Jessica Maxwell suddenly let go of Daisy Zane’s arm and turned to run away.<br/><br/>“Hey!”<br/><br/>Charlotte Lane’s heart sank for a moment, and she unwittingly tightened her grip on Kevin Clark’s hand.<br/><br/>The Santiago Family immediately walked up to them.<br/><br/>The doctors shook their heads and then said, “We did our best.”<br/><br/>Members of the Santiago Family became even more silent, looking like they were in a daze, with no one speaking a word.<br/><br/>Siera Santiago’s tears silently fell, and she immediately wiped them away with her hand.<br/><br/>“Old Master has something to tell you. Go in and have a look. There’s also someone named Nicholson Amos, he asked if she was here.”<br/><br/>Everyone else immediately looked at Charlotte Lane, except for the dazed Santiago Family.<br/><br/>Charlotte Lane didn’t look at their eyes; under everyone’s gaze, she followed the Santiago Family into the rescue room.<br/><br/>Dean Santiago was wearing a ventilator, barely maintaining his breathing.<br/><br/>Seeing the four members of the Santiago Family, his eyelids fluttered.<br/><br/>Turner Daniel’s parents walked to the bedside and called out to him.<br/><br/>Dean Santiago closed his eyes in response. Then he looked at Turner Daniel and Siera Santiago and said weakly, “Siera, don’t cry.”<br/><br/>Siera Santiago squatted beside the bed, holding his hand, nodding her head while shedding tears.<br/><br/>“Daniel, you all have to be obedient.”<br/><br/>“Grandfather, I know.” Turner Daniel said hoarsely.<br/><br/>“The Santiago Family... it’s up to you now,” Dean Santiago said, “Don’t be sad for me, I’ve had a good life, a fulfilled one, a happy one, with no regrets. The Santiago family will surely get better and better in the future.”<br/><br/>“Grandfather, rest assured.” Turner Daniel said, his voice trembling.<br/><br/>“Yes. With you all, I can rest assured.” Dean Santiago said, before looking at Charlotte Lane who was standing behind them.<br/><br/>Turner Daniel and his father immediately stepped aside, letting her come forward.<br/><br/>Siera Santiago also stepped aside.<br/><br/>Charlotte Lane walked forward and squatted down in front of the bed. “Dean Santiago.”<br/><br/>“Nicholson.”<br/><br/>“Yes.”<br/><br/>Dean Santiago propped himself up to look at her for a while, then said, “Be good. Listen to me.”<br/><br/>Charlotte Lane clenched her fingertips, swallowed, her eyes moistened, and replied, “Alright.”<br/><br/>“Good, good...” Dean Santiago slowly closed his eyes, “Everyone is obedient, everyone is obedient...”\t\t\t\t\t\t</div>", "images": {}, "success": true}