{"id": 563, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998893.html", "title": "Chapter 560: 503: Counterattack", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 560: 503: Counterattack</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 560: Chapter 503: Counterattack<br/><br/>“What’s wrong?” Kevin Clark noticed that something was off with Charlotte Lane’s expression.<br/><br/>Charlotte Lane said a word to Luke and hung up the phone first, looking at Kevin Clark.<br/><br/>“Is there something going on with the Hundred Demons Pavilion?” Kevin Clark asked again.<br/><br/>Charlotte Lane clenched her fingertip and said, “Are you looking for Edward Kirsten?”<br/><br/>Maybe her question was not accurate enough.<br/><br/>They had always been looking for Edward Kirsten.<br/><br/>It’s just that...Kevin Clark seemed to have found him.<br/><br/>He cornered the 319 transaction location, even forcing Edward Kirsten to flee.<br/><br/>Kevin Clark felt a little more relieved, then holding her hand, he said, “Well, we’re still looking for him right now.”<br/><br/>Charlotte Lane was a bit surprised, “how... did you find him?”<br/><br/>“I have summarized various entertainments places, boxing rings, casinos...in different continents. Then I’ve made repeated deductions about Edward Kirsten’s possible psychology, and finally obtained some locations.” Kevin Clark said, “According to the obtained locations, I tried some methods; then I pushed back and scattered countless points from them, feeling feasible and taking action.”<br/><br/>Kevin Clark’s explanation was simple, but whether pushing forward or reflecting backward, it’s a continual process of trial and error.<br/><br/>He even simulated Edward Kirsten’s criminal psychology.<br/><br/>Moreover, he used various methods, both old and new, Chinese and foreign, from the skies, and underground. He even used feng shui to check the locations.<br/><br/>He used combinations of two methods or even three methods.<br/><br/>Because there were too many locations, Kevin Clark believed that apart from some places where Edward Kirsten wanted to be subjectively, other locations must have regular patterns to follow.<br/><br/>It’s just that these rules are hard to find.<br/><br/>Kevin Clark spent a lot of time and energy.<br/><br/>Charlotte Lane looked at Kevin Clark.<br/><br/>He could actually simulate Edward Kirsten’s psychology.<br/><br/>Most importantly, he had never seen Edward Kirsten, and had only based it on other people’s words and some recordings to simulate his psychology.<br/><br/>And... he got it right!<br/><br/>Edward Kirsten was so twisted.<br/><br/>He even... forced Edward Kirsten to flee, breaking the 319 transaction chain.<br/><br/>One could say that they had taken the initiative and started counterattacks.<br/><br/>“Little girl, I didn’t mean to hide it from you.” Kevin Clark said softly, “I just wanted to tell you after making substantial progress.”<br/><br/>Charlotte Lane digested the news as quickly as possible, then asked, “Luke said...someone fled during the fighting...”<br/><br/>Kevin Clark was a little surprised as to how Luke knew so much.<br/><br/>She paused for a moment, opened a drawing tool.<br/><br/>She quickly drew a simple room layout.<br/><br/>“Do I know you best?” Charlotte Lane moved her shoulder a little.<br/><br/>Kevin Clark looked at the picture, which was indeed his usual room layout.<br/><br/>“You only know about my room?” Kevin Clark’s voice was very low, right in Charlotte Lane’s ear.<br/><br/>Charlotte Lane listened to his deliberately pitiful voice, slowly curled her fingertips, took a gentle breath, and said, “Not just that.”<br/><br/>“What else do you know?” Kevin Clark said.<br/><br/>“I know you as a person, I know your thoughts.” Charlotte Lane said in a low voice.<br/><br/>Kevin Clark chuckled, raised his head, and turned Charlotte Lane’s head so she was looking at him. He asked with interest, “What thoughts of mine do you know?”<br/><br/>Charlotte Lane looked at him, paused, and accurately put her hand on his belt buckle, then loosened it for him.<br/><br/>Kevin Clark: “......”<br/><br/>“Do you know?” Charlotte Lane asked.<br/><br/>Kevin Clark suddenly didn’t speak.<br/><br/>If he said he knew, then he would admit that he had dirty thoughts in his head every day.<br/><br/>If he said he didn’t know...he couldn’t be insincere.<br/><br/>“I’ll have the Hundred Demons Pavilion send some people to help you. Their people on various continents will cooperate with Dark Radiance.” Charlotte Lane suddenly said.<br/><br/>Kevin Clark’s thoughts came to an abrupt halt: “...Alright.”<br/><br/>“Do you want to continue?” Charlotte Lane asked again.<br/><br/>Kevin Clark’s thoughts encountered another U-turn: “......”<br/><br/>He paused, holding the back of her head, and kissed her.<br/><br/>A kiss that was not gentle but a little fierce.<br/><br/>After releasing her, Kevin Clark kissed her lips twice more.<br/><br/>He, of course, wanted to continue, but she had been too tired these days and hadn’t been sleeping well.<br/><br/>He couldn’t bear it.<br/><br/>“On our next rest day, I’ve made a reservation. You’re not allowed to go home.”<br/><br/>Charlotte Lane chuckled, lowered her eyes, and tightened his belt again.<br/><br/>Kevin Clark’s forehead vein bulged out: “...”<br/><br/>He suspected she did it on purpose.\t\t\t\t\t\t</div>", "images": {}, "success": true}