{"id": 567, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998905.html", "title": "Chapter 564: 507: A Very Important Matter…", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 564: 507: A Very Important Matter…</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 564: Chapter 507: A Very Important Matter...<br/><br/>“It seems like you really hate him.” Stella Edwards suddenly said.<br/><br/>Charlotte Lane looked at Stella Edwards for a while, then lowered her gaze and asked back, “Don’t you?”<br/><br/>“Me?” Stella Edwards fell silent for a good while before she whispered, “I hate and fear him.”<br/><br/>As Stella finished speaking, her hand gripped the quilt, and tears fell from her eyes once again.<br/><br/>Charlotte Lane handed her a couple of tissue paper.<br/><br/>When Stella’s emotions had stabilized somewhat, Charlotte asked, “Do you still remember what he looks like?”<br/><br/>With her eyes red, Stella Edwards looked at Charlotte Lane: “What do you mean?”<br/><br/>“Do you remember his appearance now?” Charlotte Lane didn’t explain further but asked again.<br/><br/>Seeing that Charlotte didn’t want to say more, Stella Edwards nodded her head and replied, “I do.”<br/><br/>“Can you have a portrait painter come and paint him?” Charlotte Lane asked.<br/><br/>Stella Edwards nodded her head, slightly stunned.<br/><br/>Charlotte Lane sat for a while longer before asking, “Is there anything else you want to tell me?”<br/><br/>“No.”<br/><br/>“Then rest and recuperate well.” Charlotte Lane stood up after speaking.<br/><br/>As Charlotte was about to leave, Stella Edwards immediately called out to her, “Charlotte.”<br/><br/>Charlotte Lane looked at her.<br/><br/>“Don’t tell my teacher and Uncle Charlotte.” Stella Edwards said, “I don’t want too many people to know, especially about Edward Kirsten.”<br/><br/>“Alright.” Charlotte Lane replied, “The portrait painter will also keep it a secret.”<br/><br/>“Thank you.”<br/><br/>“I should be the one thanking you.” Charlotte Lane said, “Your help is invaluable.”<br/><br/>Stella Edwards forced a smile on her lips.<br/><br/>“Take good care of yourself, and everything will be fine.” Charlotte Lane assured her.<br/><br/>...<br/><br/>As she left the ward, Kevin Clark was waiting for her outside.<br/><br/>Kevin Clark touched Charlotte’s face and saw her reddened lips. He sighed inwardly, realizing that she had a fever again.<br/><br/>“Find a reliable portrait painter who can keep their mouth shut.” Charlotte Lane said.<br/><br/>Kevin Clark immediately understood and replied, “Alright, I’ll arrange it now.”<br/><br/>“Where are my parents?”<br/><br/>“The doctor is discussing Stella’s leg treatment plan with them,” Kevin Clark replied. “Let’s go to the hotel and check in first.”<br/><br/>“Alright.”<br/><br/>There weren’t many people in the corridor, and the two of them walked side by side at a leisurely pace. After a while, Charlotte Lane said, “I feel like having some red date and lotus seed porridge.”<br/><br/>“I’ll go buy the ingredients and make it.” Kevin Clark said tenderly.<br/><br/>Charlotte Lane turned her head to look at him, hesitated, and then fell silent.<br/><br/>“What do you want to say?” Kevin Clark asked considerately.<br/><br/>After Charlotte Lane finished looking at the portrait, she folded it back up and handed it back to Arthur North: “It’s very accurate. Give a copy to both Dark Radiance and Hundred Demons Pavilion, so the next time we encounter this person, we’ll know who to focus on.”<br/><br/>Arthur North kept his eyes down, watching her.<br/><br/>Charlotte Lane looked up at his gaze, and for a moment, squinted her eyes.<br/><br/>Arthur North suddenly felt a hint of danger and rubbed her head: “What kind of look is that?”<br/><br/>Charlotte Lane raised the corner of her mouth, a smile in her cold voice: “Third Master, you just had that cautious look in your eyes, as if you’d be easy to bully.”<br/><br/>Arthur North: “......”<br/><br/>Arthur North had a feeling that she just had some evil thoughts.<br/><br/>Looking at her Third Master who would be serious and not easily bullied, Charlotte Lane sighed silently in her heart.<br/><br/>If her Third Master was as big as Charles Amos, bullying him into tears would probably be fun.<br/><br/>What a pity.<br/><br/>She could only imagine it.<br/><br/>“What are you thinking about?” Arthur North looked at her.<br/><br/>Charlotte Lane came back to her senses: “Nothing. Let’s go to the hospital and then return to our country.”<br/><br/>Arthur North put the portrait in a file bag, and after thinking about it, still felt that the little girl’s look just now was quite dangerous.<br/><br/>**<br/><br/>It was past 10 PM in the country.<br/><br/>Jessica Maxwell hurriedly ran out of Julian’s villa.<br/><br/>After leaving the villa courtyard of the Maxwell Family, she looked back to see no one was following. She then quickened her pace and ran towards the main road.<br/><br/>There were no taxis in the villa area, so she didn’t bother using her cell phone to call a car. Instead, she ran out, clutching her phone tightly.<br/><br/>Not until she reached the main road outside did she slow down her pace. While walking along the road, she looked for a taxi, carefully observing the people around her.<br/><br/>About ten minutes later, she hailed a taxi.<br/><br/>Once she got in the car, the driver asked her where she was going.<br/><br/>Jessica Maxwell hesitated for a while before giving an address: “To Imperial Capital University.”<br/><br/>The driver noticed her nervous and frightened demeanor, worrying that she might have encountered some trouble, and asked if she needed to call the police.<br/><br/>Jessica Maxwell made up a random excuse to brush it off.<br/><br/>Not until the taxi had driven a considerable distance did she open her phone and back up a recording.<br/><br/>After thinking for a moment, she reached out to a classmate from Senior Three class and asked for Olivia Lane’s contact information.<br/><br/>After obtaining the information, she didn’t rush to make the call. Instead, she waited until she arrived at Imperial Capital University and directly went to Olivia Lane’s dormitory on the ground floor.<br/><br/>She was also studying at Imperial Capital University and had met Olivia Lane at school before. However, she didn’t attend school that day, as she had accompanied her parents to Julian’s house for dinner.<br/><br/>Moreover, with Olivia Lane’s beauty and excellent academic performance, she gained popularity as soon as she entered university.<br/><br/>So, it was easy for Jessica to know which dormitory building she resided in.<br/><br/>Upon reaching the ground floor of the dormitory building, she hesitated for a while before making up her mind and calling Olivia Lane.<br/><br/>Although Olivia Lane was surprised to receive a call from Jessica Maxwell, she came down after hearing her anxious tone.<br/><br/>When she saw Jessica, her eyes were already red with anxiety. Olivia Lane asked, “What happened?”<br/><br/>Jessica Maxwell suddenly grabbed her arm and urgently said: “Can you contact Daisy Zane? I have something important to tell her.”\t\t\t\t\t\t</div>", "images": {}, "success": true}