{"id": 560, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998884.html", "title": "Chapter 557: 500: Discovered", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 557: 500: Discovered</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 557: Chapter 500: Discovered<br/><br/>M Continent.<br/><br/>In the backyard room.<br/><br/>Edward Kirsten stood by the table, his pale blue eyes seemingly bloodthirsty, wrapped in a layer of terrifying murderous aura.<br/><br/>Alice Eugene knelt on the ground, her face pale, her forehead covered in beads of sweat, and blood seeping from the corners of her mouth.<br/><br/>She had laid in the hospital for more than forty days before barely surviving. She was just discharged today, and when she learned that Edward Kirsten had arrived, she hurried over.<br/><br/>At first, everything was fine, and Edward Kirsten even cared for her a bit.<br/><br/>But after resting in the backyard room, he went out for more than an hour, and when he came back, he started fighting with her.<br/><br/>The person who had gone with her to Mountain Sea Continent must have said something to Edward Kirsten.<br/><br/>That person had always been secretly hostile to her and didn’t even want to bring her back. Someone else brought her back, and now seeing her alive, they want to target her again.<br/><br/>Edward Kirsten took off his coat, revealing a neatly buttoned white shirt and a gray suit vest. He looked down at Alice with his chest heaving, “What did I tell you?”<br/><br/>Alice knelt on the ground for a moment in silence.<br/><br/>“Speak!” Edward said.<br/><br/>“Let me... let me bring Enigma back,” Alice said, trembling.<br/><br/>“How did you do it?” Edward Kirsten lifted his foot and kicked her left breast, “You want to kill Enigma, how dare you try to kill her!”<br/><br/>Alice lay on the ground and found that she couldn’t get up no matter how hard she tried. The place where he kicked was exactly where she was injured. Although the special effects medicine given by Edward Kirsten allowed her wounds to recover quickly.<br/><br/>But after being hit like this, it still made her feel so much pain that her whole body couldn’t exert any strength.<br/><br/>“Alice, was I too lenient with you, so you think my words to Enigma are just empty talk?” Edward Kirsten said softly.<br/><br/>Alice struggled to get up, bracing herself with both hands on the ground: “Henry, it’s precisely because you treat her too well. So well that even though you know she wants to kill you, you still want to keep her by your side.”<br/><br/>As soon as she finished this sentence, she started coughing.<br/><br/>Edward Kirsten had kicked too hard, and Alice coughed for a while before she finally started coughing up a bit of blood.<br/><br/>“So now you’re making decisions for me?” Edward Kirsten coldly stared at the blood in her palm, “Do my orders mean nothing to you?”<br/><br/>“No.”<br/><br/>“No?” Edward Kirsten crouched in front of her, looking at her, “I can’t even bear to raise my voice to her, yet you try for her life. Isn’t that going against my orders? Isn’t that treating my words like nothing? I was foolish to trust you.”<br/><br/>“Henry, I didn’t, I won’t, I will only be loyal to you alone, only be faithful to you alone.” Alice suddenly panicked.<br/><br/>“But keeping you is not for you to make decisions for me. Since there’s still a life left this time, I won’t drive you away.”<br/><br/>After finishing speaking, he let her go, stood up, took a handkerchief from his pocket, and slowly wiped the blood on his hands.<br/><br/>Alice lay on the ground with her eyes closed, showing no signs of life.<br/><br/>Just as Edward Kirsten was about to leave, someone suddenly knocked on the door outside: “Henry.”<br/><br/>Edward Kirsten directly opened the room door, and two people dressed as servants stood outside, one of them grabbing Stella Edwards’ arm.<br/><br/>Stella was struggling, but after seeing the blood on Edward’s face and collar, she was so scared that she forgot to struggle, and even her legs began to tremble and soften.<br/><br/>“What’s wrong?” Edward looked at Stella.<br/><br/>“Henry, she was sneaking around outside the courtyard, it seemed like she was eavesdropping.”<br/><br/>Edward looked at her: “Is it?”<br/><br/>Stella shook her head: “I, I didn’t. I didn’t.”<br/><br/>“If you didn’t, then what are you afraid of?” Edward took a step outside and said to the other person, “Take the one inside to the hospital.”<br/><br/>“Yes.”<br/><br/>Alice was carried out horizontally.<br/><br/>Stella glanced at the bloodstains on Alice’s body and trembled even more.<br/><br/>Edward got closer to her, grabbed her other arm, and then gestured for the other person to leave.<br/><br/>Stella couldn’t stand on her own, especially after Edward touched her.<br/><br/>She was now completely relying on Edward to support her.<br/><br/>“When did you come?” Edward’s voice was as gentle as usual.<br/><br/>But Stella was just scared: “Just, just now.”<br/><br/>“What did you hear? You’re so scared.” Edward laughed.<br/><br/>“I, I didn’t hear anything.”<br/><br/>“Chloe, lying is not good.” Edward’s other hand touched her neck and the blood got on her fair-skinned neck. His indifferent gaze deepened.<br/><br/>“I, I really just arrived.” Stella closed her eyes tightly, feeling the coldness of Edward’s fingertips, “I didn’t hear anything, I didn’t even enter the courtyard.”<br/><br/>Edward smiled gently: “Miss, lying can cost you your life.”\t\t\t\t\t\t</div>", "images": {}, "success": true}