{"id": 571, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998917.html", "title": "Chapter 568: 511: The Eldest Daughter Of The Lane Family", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 568: 511: The Eldest Daughter Of The Lane Family</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 568: Chapter 511: The Eldest Daughter of the Lane Family<br/><br/>Gradually, everyone regained their composure, and all eyes were cast upon Charlotte Lane.<br/><br/>The Lane Family, the Clark Family, and the Hobson Family were all caught off guard by this outcome, stupefied for a moment.<br/><br/>Charlotte Lane’s eyes were red, completely ignoring everyone else’s reactions.<br/><br/>As for the result, it was Julian Maxwell who became anxious first: “Why ahould it be her?!”<br/><br/>Turner Daniel had no significant achievements in the Research Institute and was quite young.<br/><br/>Even if his performance during these days only proved that his learning ability was good, it was not enough to take over as Dean.<br/><br/>Those who supported him did so just because of Dean Yue’s regard.<br/><br/>But eventually, they would still be skeptical of him.<br/><br/>Therefore, Julian Maxwell was confident in today’s meeting. Even if few people were on his side, it would be difficult for Turner Daniel’s votes to exceed half.<br/><br/>For Turner Daniel, he didn’t even have to bother winning anyone over.<br/><br/>But if it was Charlotte Lane...he couldn’t be so sure.<br/><br/>Austin Allen gave a slight smile: “It couldn’t be more clear on Dean Yue’s will that Nicholson Amos is the candidate for the new Dean. The will has legal effect, and I still have the audio and video recordings of Dean Yue, as well as two witnesses. Here is a copy of the will. Mr. Maxwell, do you have any doubts?”<br/><br/>Julian Maxwell choked, and his face turned slightly green.<br/><br/>He couldn’t question the will, so he turned to look at the Santiago Family.<br/><br/>Siera Santiago crossed her arms and leaned back in her chair, watching Julian Maxwell: “What are you looking at? We all know. My uncle, aunt, and younger brother know too. What, you want to provoke my family?”<br/><br/>Julian Maxwell didn’t expect her to be so direct.<br/><br/>He also didn’t expect the Santiago Family to willingly give up the Dean’s position so easily.<br/><br/>“Mr. Maxwell, you just said that we’re all here for the Research Institute,” said Turner Daniel’s mother. “Nicholson Amos is the most suitable candidate for the Dean. It will also be best for our development. The Santiago Family fully supports her. Mr. Maxwell, we are all here for the Research Institute, so you should support her too, right?”<br/><br/>Seeing the Santiagos’ attitude, Julian Maxwell remained silent for a moment and exchanged glances with the Skyler Family.<br/><br/>Immediately after, the Skyler Family spoke: “The Dean has always been one of the 12th Families. Nicholson Amos’s identity...might not be suitable.”<br/><br/>“Always? Where does that come from?” Harton Clark looked at the Skyler Family, and the entire conference hall’s atmosphere dropped several degrees. “Where does this stipulation come from?”<br/><br/>The Skyler Family faced Harton Clark, clearly faltering in their stance. But remembering that this was the Research Institute and that the 12 Houses had equal power, they gained some confidence: “Although there is no explicit provision, it has always been this way. The one who becomes the Dean must be one of the 12 Houses.”<br/><br/>“So, you’re saying that my Clark Family doesn’t belong to the 12 Houses?” Harton Clark asked.<br/><br/>After a long silence, Julian Maxwell began to speak again, avoiding the matter Kevin Clark cared about, and said, “Fine, we won’t talk about marriage. Third Master Clark has no Clark Family shares and does not participate in any family affairs. Within the 12th Families, it’s Hugo Clark. You two are a couple, so naturally, Nicholson Amos doesn’t belong to the 12th Families either.”<br/><br/>Normally, it was fine, but once faced with a problem, people would try to bring you down from all angles and excessively interpret any matter.<br/><br/>Charlotte Lane finally recovered her senses and looked at Julian Maxwell, “What kind of bullshit rule is this? Are you using this rule without any basis to bully me because you have no other strategies?”<br/><br/>She was extremely calm, as if she had wrapped herself up and pushed everyone else away. With her red, moist eyes, she said coldly, “Julian Maxwell, this is Dean Yue’s dying wish, I will take this position. Put away your disgusting face.”<br/><br/>“You’ll take it?” Julian Maxwell sneered, “What do you have to become the Dean? Do you think that with your identity outside the 12th Families, you can get more than half of the votes?”<br/><br/>“Even without more than half of the votes, if I want to be the Dean, what can you all do?” Charlotte Lane’s eyes swept over everyone present.<br/><br/>The people in the conference hall were all intimidated by Charlotte Lane’s aura.<br/><br/>The Santiago Family had to admit her aura was impressive, but despite her youth, managing the Research Institute wouldn’t be a problem.<br/><br/>Austin Allen had never seen her like this, and he felt a little scared.<br/><br/>Allonzo Hobson took a deep breath, thinking to himself: Today’s meeting can’t proceed peacefully, this couple might really disregard the situation and take over the Research Institute.<br/><br/>“Do you want to grab it forcibly?” the Skyler Family angrily said, “Is this Research Institute a place where you can do whatever you want? Do you think the rest of our families are weak and easily scared?”<br/><br/>“Your true colors are exposed so quickly. You two are so aggressive and ruthless. How can you lead the Research Institute?” Julian Maxwell also said, “In the 12th Families, there is nobody like you. It should be a relief.”<br/><br/>As soon as the words fell, the sound of breaking glass echoed in the conference hall.<br/><br/>Everyone looked over.<br/><br/>Sophie Ortiz swung her hand and knocked the teacup on the table to the ground. Although she didn’t use much force, the sound of it breaking on the floor silenced the conference hall.<br/><br/>Sophie Ortiz took a deep breath, her eyes moved from Skyler Family members to Julian Maxwell, and she said coldly, “Julian Maxwell, it’s a disgrace that the 12th Families are associated with you.”<br/><br/>Andrew Lane gently lifted his eyebrows, seemingly already used to this kind of regular operation.<br/><br/>“You...”<br/><br/>“You, what you? Shut up.” Sophie Ortiz’s eyes moved away from him, her expression disdainful, as if one more glance would disgust her, “You say that those who are not part of the 12th Families don’t have the right to inherit, and that Kevin doesn’t have the right to participate in Clark Family affairs. Fine, I agree.”<br/><br/>The Skyler and Ferguson families said nothing more.<br/><br/>Julian Maxwell didn’t say anything either, but he furrowed his brows in confusion.<br/><br/>Why did the Lane and Clark Family suddenly start this drama?<br/><br/>Just as he was puzzled, Sophie Ortiz slowly and coldly said, “Since Kiara Lawrence, as the daughter-in-law of the Clark Family, is not qualified...”<br/><br/>Enduring the disgust, Sophie Ortiz turned to Julian Maxwell again and said, word by word, “What about how it is as the daughter of our Lane Family, the eldest daughter of the Lane Family? Is that qualified enough?”\t\t\t\t\t\t</div>", "images": {}, "success": true}