{"id": 577, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998935.html", "title": "Chapter 574: 517: Brief Loss Of Trust", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 574: 517: Brief Loss Of Trust</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 574: Chapter 517: Brief Loss of Trust<br/><br/>“Continent A and D Continent are heavily guarded, would he still dare to go?” Allonzo Hobson questioned, “Is there such a possibility?”<br/><br/>“Where is there no heavy security?” questioned Arthur North in return.<br/><br/>Allonzo Hobson opened his mouth but said nothing. Everywhere was heavily guarded, but Edward Kirsten didn’t seem to care, going wherever he wanted.<br/><br/>That was precisely what made him so terrifying.<br/><br/>“If he were that easy to catch, he would have been caught already.” Arthur North spoke slowly.<br/><br/>Charlotte Lane didn’t interject, just listened to their conversation while leaning on the sofa.<br/><br/>“Jeez, I’ve never seen anyone who could hide so well.” said Allonzo Hobson.<br/><br/>“Well, you’re seeing him now.” Thomas Firway replied.<br/><br/>Allonzo Hobson: “......”<br/><br/>“Maybe we can have a good New Year this time.” Arthur North suddenly suggested.<br/><br/>Charlotte Lane tilted her head to look at him.<br/><br/>Thomas Firway faltered for a moment.<br/><br/>Allonzo Hobson looked at him for two seconds, then laughed: “It still takes Third Master, eh? Even the most terrifying people can be captured by our Third Master. He can hide, and you can chase.”<br/><br/>“Can you please say something more pleasing to the ear?” Arthur North said in a deep voice.<br/><br/>Charlotte Lane laughed softly.<br/><br/>Arthur North turned his head towards her: “Tired?”<br/><br/>“No.”<br/><br/>“Oh right, the Santiago Family reported a case to the police this morning.” Allonzo Hobson said.<br/><br/>“Hmm, I’ve heard.” replied Arthur North.<br/><br/>“They said when Assistant Peter Qinke was sorting out Dean Yue’s things, he discovered that there was a problem with the medicine he usually took.” Allonzo Hobson’s voice turned cold, “Damn it, who exactly wanted to harm the dean?”<br/><br/>“The people around him, close people, the Santiago family members, maids, drivers, including me and Peter Qinke himself, all are suspects.” Arthur North said calmly, “For those with ulterior motives, it’s not difficult to tamper with the medicine. Maybe...the Dean’s illness was a conspiracy from the beginning.”<br/><br/>Overseeing a research institute, tampering with medicine, or causing harm to someone’s body- it’s all too convenient.<br/><br/>Charlotte Lane squinted lightly, and a short-lived ruthlessness quickly flashed in her eyes.<br/><br/>Allonzo Hobson frowned: “Since they’re determined to do it, they must be extremely cautious. I’m afraid it won’t be easy to investigate.”<br/><br/>Arthur North nodded in agreement.<br/><br/>The few of them fell silent in the living room for a while.<br/><br/>Arthur North stood up while holding Charlotte Lane’s hand: “You two can leave now, we’re going to rest.”<br/><br/>Allonzo Hobson: “......” Yeah, the wife returns and you’re kicking us out.<br/><br/>...<br/><br/>After returning to the room, Charlotte Lane went straight to the restroom.<br/><br/>As the door was about to close, Arthur North held it open from outside.<br/><br/>Charlotte Lane paused and looked at him.<br/><br/>Seeing her suspicious gaze, Arthur North’s smile grew deeper: “What does that look mean?”<br/><br/>She was kissed again, and Charlotte Lane swallowed her words.<br/><br/>Kevin Clark placed her by the bathtub, filled the water with one hand, and hugged her with the other, as if afraid she would run away.<br/><br/>Charlotte Lane watched the water level in the bathtub rise.<br/><br/>She decided to struggle again, mustering her acting skills: “Kevin Clark, I’m a bit tired today. I... ”<br/><br/>Kevin Clark didn’t believe her anymore. Seeing her expression, he exposed her acting: “Well, then, Madame, pray that I’ll finish quickly.”<br/><br/>Charlotte Lane leaned despondently in Kevin Clark’s arms.<br/><br/>Instead of praying for that, she might as well pray for winning a hundred million in the lottery tomorrow; the odds were even greater.<br/><br/>Heh.<br/><br/>It served her right.<br/><br/>Why did she act so arrogantly?<br/><br/>Because they were going to the Research Institute the next day, Kevin Clark didn’t bully her too much.<br/><br/>But all day the next day, Kevin Clark still felt murderous intent.<br/><br/>It came from everywhere. She behaved normally with him and spoke nicely to him.<br/><br/>Even before getting off the car at the Research Institute, he even received a kiss.<br/><br/>This had never happened before.<br/><br/>It was the murderous intent that directly struck his heart.<br/><br/>He felt as if he had done something unspeakable last night.<br/><br/>Finally, the murderous intent was appeased with an ice cream after work.<br/><br/>Thomas Firway picked them up.<br/><br/>Kevin Clark specifically asked him to buy it.<br/><br/>On the way home, Kevin Clark watched Charlotte Lane eat her ice cream slowly, the calm but triumphant expression on her face...<br/><br/>He felt that he was calculated upon once again.<br/><br/>...<br/><br/>After dinner.<br/><br/>Kevin Clark and Charlotte Lane both went to the study room.<br/><br/>Kevin Clark sat next to the desk, while Charlotte Lane held a computer on the sofa.<br/><br/>The study room was quiet, with only the sound of the keyboard.<br/><br/>Although there was no communication, both of them were seriously dealing with their own work, and the atmosphere was exceptionally relaxed and harmonious.<br/><br/>More than an hour later, Charlotte Lane’s cell phone rang once.<br/><br/>She glanced at it, the note was a bunch of new garbled codes.<br/><br/>Her new note for Diego Giovanni.<br/><br/>Diego Giovanni sent her a message: [In ten minutes, they’ll set off.]<br/><br/>...\t\t\t\t\t\t</div>", "images": {}, "success": true}