{"id": 573, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998923.html", "title": "Chapter 570: 513: Dean Yue’S Letter", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 570: 513: Dean Yue’S Letter</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 570: Chapter 513: Dean Yue’s Letter<br/><br/>Charlotte Lane spoke only one sentence after being elected as the next Dean.<br/><br/>“Enough talk, see you in half a year.”<br/><br/>Half a year later, the position of Dean will be voted on again by the twelve families.”<br/><br/>In half a year, the ability to serve as a Dean will be evident enough.”<br/><br/>Words matter less than actual performance.”<br/><br/>As the meeting ended, Julian Maxwell left the conference room without looking back, followed by the hurried departure of the Skyler and Ferguson families.”<br/><br/>As they left, the atmosphere in the conference room suddenly relaxed.”<br/><br/>The remaining families congratulated Charlotte Lane and exchanged a few words with her before leaving.<br/><br/>Charlotte Lane thanked them all politely.<br/><br/>When almost everyone had left, the Santiago family approached.<br/><br/>Siera Santiago squeezed herself between Harton Clark and Charlotte Lane, looking at Charlotte sideways, “You’re really Charlotte, huh?”<br/><br/>Harton Clark frowned and moved aside helplessly, making room for her.<br/><br/>Charlotte turned to Siera and said quietly, “I remember... in the sixth grade, you took 20 USD from me and never returned it.”<br/><br/>William Lane and Xavier Dominic, who were talking to each other, all looked over when they heard this sentence.<br/><br/>Siera blushed and stuttered, “That was so long ago, and you still remember? I went to a different school later, besides, you’re Charlotte Lane. You beat me so badly at Mountain Sea Continent.”<br/><br/>“I’m quite sure you insulted me first,” Charlotte retorted, “You started it.”<br/><br/>“I didn’t know it was you,” Siera muttered under her breath.<br/><br/>“I didn’t know it was you either,” Charlotte said softly, “If I’d known it was you insulting me, I would’ve hit you harder.”<br/><br/>Siera: “...... Blame Thomas Firway.”<br/><br/>“Yes,” Charlotte agreed, “He bears the primary responsibility.”<br/><br/>After their conversation ended, Turner Daniel’s mother exchanged contact information with Charlotte Lane.<br/><br/>After a while, as they were about to leave, Turner Daniel called out to Charlotte Lane. Everyone else left the conference room, leaving the two of them alone.<br/><br/>“Suddenly, I don’t know what to call you,” Turner Daniel said.<br/><br/>“Keep calling me what you used to,” Charlotte replied.<br/><br/>Turner Daniel nodded and handed her an envelope: “A letter from Grandpa.”<br/><br/>Charlotte looked down at the words “For Nicholson Amos’s Personal Reading” on the envelope and took it with both hands.<br/><br/>I had thought about having Kevin Clark succeed me, but he is elusive and unpredictable. Then I met you, and after a period of observation, I am very satisfied with you in all aspects. So I immediately removed him from the list of successors.<br/><br/>Originally, I planned to wait until the research institute was peaceful and settled before handing it over to you. But then I suddenly fell ill, which I did not expect.<br/><br/>That’s why I did all this, just in case.<br/><br/>Child, don’t feel burdened.<br/><br/>What I’ve done is not for you but for the research institute. Or rather, I haven’t given much thought to your wishes in doing what I did for the institute.<br/><br/>So you don’t need to feel guilty.<br/><br/>I also have my own selfishness. I hope you can protect the Santiago family and Turner Daniel.<br/><br/>It could be said that I am using their affection to exploit you.<br/><br/>With you in charge of the research institute, I can rest assured. I believe that the research institute will become better and better under your leadership......]<br/><br/>Kevin Clark sat next to Charlotte Lane.<br/><br/>He didn’t look at the contents of the letter but saw her tears fall on the paper.<br/><br/>“Little girl...” Kevin Clark reached out to touch her head.<br/><br/>Charlotte Lane clutched the letter and, after a while, turned around and buried herself in his chest.<br/><br/>Kevin Clark held her tightly, kissed the top of her head, and said, “Lila, we’ll protect the research institute and make it grow. That’s the best way to repay Dean Yue.”<br/><br/>Charlotte Lane didn’t say anything.<br/><br/>Thomas Firway was driving in front, and after a glance at the back, his mood also became downcast.<br/><br/>Kevin Clark felt her injured hand clutching his clothes, so he took her hand and held her fingers.<br/><br/>He didn’t comfort her further, he just patted her back gently, letting her express her emotions.<br/><br/>The car was very quiet, and Thomas Firway drove smoothly.<br/><br/>Gradually, quiet sobs and suppressed cries filled the car.<br/><br/>Kevin Clark felt a pang in his heart and slightly furrowed his brows.<br/><br/>Unlike the last time she injured her hand, Charlotte Lane didn’t deliberately cry in front of Kevin Clark to divert his attention.<br/><br/>This time she couldn’t help it...<br/><br/>This letter was left by Dean Yue, fearing that she would feel guilty for Turner Daniel taking risks on her behalf.<br/><br/>It’s true that the research institute comes first for Dean Yue, but protecting her is also important.<br/><br/>...\t\t\t\t\t\t</div>", "images": {}, "success": true}