{"id": 576, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998932.html", "title": "Chapter 573: 516: Not Breaking One’S Word", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 573: 516: Not Breaking One’S Word</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 573: Chapter 516: Not Breaking One’s Word<br/><br/>The internet buzzed with activity, but Charlotte Lane didn’t watch, nor did she respond in any way.<br/><br/>Holt Lawrence tracked down the person behind the online provocations and sent their information to her, but she didn’t bother with it.<br/><br/>She slept in until seven o’clock the next morning. She and Kevin Clark went to the Research Institute.<br/><br/>Since he was just elected dean, there were many procedures to go through.<br/><br/>Kevin Clark went to the lab.<br/><br/>Charlotte Lane, accompanied by Turner Daniel and Siera Santiago, spent the whole morning handling paperwork.<br/><br/>Once the paperwork was done, she was officially confirmed as the dean.<br/><br/>At noon, they had lunch together, and Charlotte Lane entered the lab.<br/><br/>After half an hour in the lab, she left on her own.<br/><br/>She took a taxi to Imperial Capital University and called Olivia Lane out.<br/><br/>“Sister! What brings you here?” Olivia quickly grabbed an electric vehicle and rushed to the entrance of the campus when she received Charlotte’s call.<br/><br/>Seeing Olivia riding a small green electric vehicle, Charlotte smiled, “It seems like you’ve been enjoying college life.”<br/><br/>“Just average.”, Olivia said, “Sister, why did you come all of a sudden?”<br/><br/>“I’m too tired and need to relax.”, Charlotte replied, “That’s why I came to hang out with you.”<br/><br/>Linking her arm with Charlotte’s, Olivia said, “Sis, you chose the right person. I’m very experienced when it comes to having fun. Just so happens my friend’s family opened a new amusement park that hasn’t opened to the public yet. Let me take you there to unwind.”<br/><br/>“Sure.”<br/><br/>“But...Kevin Clark isn’t with you today?” Olivia was busy contacting her friend as she said this.<br/><br/>“He doesn’t know I came out.”, Charlotte said.<br/><br/>“Sister, I must praise your clever move.”, Olivia replied.<br/><br/>Smiling, Charlotte asked, “Does he really not like socializing?”<br/><br/>“Sister, let me put it this way. I’ve only ever met two men who scare me. One is Kevin Clark, and the other is Hugo Clark. One is a black-hearted fairy and the other is a cold-faced killer.”, Olivia said.<br/><br/>Charlotte chuckled softly and nodded in agreement, “That describes them quite accurately.”<br/><br/>The sisters played at the amusement park for over three hours.<br/><br/>They tried all the thrilling attractions they could.<br/><br/>Afterward, they went to a nearby store to order some food.<br/><br/>Olivia asked while sipping her milk tea, “Sister, where should we go next? You’re not really going back now, are you?” Her eyes were full of pleading, not wanting Charlotte to leave.<br/><br/>Charlotte looked at her and hesitated. “How about...I take you to a place?”<br/><br/>“Sure.”, Olivia agreed with enthusiasm, as long as she could have more fun.<br/><br/>Olivia was speechless when looking at the whole warehouse.<br/><br/>“I’ll let the Celestial Pivot guys know, and you can come anytime you want,” Charlotte said, “or you can also ask someone to move them back home. You can wear them all – their sources have been checked and there are no problems with any of the hairpins.”<br/><br/>“These... couldn’t have been collected in just a year or two, could they?” Olivia asked.<br/><br/>“Yes.”<br/><br/>Olivia clutched Charlotte’s skirt; although her sister didn’t remember her, she remembered the promise she made to her.<br/><br/>Charlotte looked down at her hand.<br/><br/>Over the years, she had strangely wanted to collect beautiful hairpins, and only until she remembered her past, she realized it was because she had promised this little girl.<br/><br/>Apart from the red hairpin she and Harton Clark fought for at the auction, she had collected everything else here.<br/><br/>“You can take a look around,” Charlotte said, “I’ll go out and make a phone call.”<br/><br/>“Alright.”<br/><br/>Charlotte checked the time and sent Harton a message that she and Olivia were out having fun.<br/><br/>After a while, Harton invited her: [Can I pick you up?]<br/><br/>Charlotte: [No need. There’s still time before we go back, don’t wait for me for dinner.]<br/><br/>Harton Clark: [Okay. Which place are we going back to tonight?]<br/><br/>Charlotte: [Rose Garden.]<br/><br/>After sending the message, her finger stayed on Charles Amos’s contact information for a moment, but she didn’t click on it and closed the cell phone instead.<br/><br/>...<br/><br/>It was past 10 PM when Olivia was sent back to her university, and Charlotte went directly back to the Rose Garden.<br/><br/>When she returned, Harton, Thomas Firway, and Henry Horton were discussing things in the living room.<br/><br/>“Brook Sister is back?” asked Henry Horton.<br/><br/>“Yes.” Charlotte sat down next to Harton and looked at the map on the tea table. “What are you looking at?”<br/><br/>“A map,” Harton replied.<br/><br/>Charlotte: “......”<br/><br/>Henry Horton laughed: “Captain Mason’s men said they saw Edward Kirsten in F Continent, although they’re not sure.”<br/><br/>“Suspected?” Charlotte asked.<br/><br/>“Yes. They said that it seemed like they saw Edward Kirsten, it looked like him, but they weren’t very sure. He ran too fast, and they didn’t catch up.” Thomas Firway said.<br/><br/>“But Harton said it wasn’t Edward Kirsten. He said... he wouldn’t go to F Continent,” said Henry Horton.<br/><br/>Charlotte thought for a moment and tended to agree with Harton’s idea: “So where do you think he would go?”<br/><br/>Harton pointed to the map twice: “Continent A or D Continent.”\t\t\t\t\t\t</div>", "images": {}, "success": true}