{"id": 578, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998938.html", "title": "Chapter 575: 518: Brother Arthur…", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 575: 518: Brother Arthur…</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 575: Chapter 518: Brother Arthur...<br/><br/>After receiving Diego Giovanni’s message, Charlotte Lane’s fingertips gradually grew cold.<br/><br/>She calculated the time and forcefully suppressed her emotions, continuing to look at her computer as if nothing had happened.<br/><br/>She finished dealing with the Research Institute Affairs and sent them to Turner Daniel.<br/><br/>Afterward, she opened her design draft that she had been working on during her free time, and sent it along with detailed body measurement data to Joseph Allen.<br/><br/>She asked him to make the clothing and then send it to Rose Garden.<br/><br/>After doing these things, she told Kevin Clark that she needed to make a phone call.<br/><br/>Kevin Clark nodded.<br/><br/>She left the Study Room. But she didn’t make any phone calls outside. Instead, she went straight back to her Bedchamber.<br/><br/>When she reached the Bedchamber, she took out two things from the pocket of her school uniform jacket which had always been hanging in the cloakroom.<br/><br/>A glass medicine bottle containing only two pills, and a sealed bag of incense powder.<br/><br/>The school uniform was worn during the recording of a variety show; after being washed, it was left here untouched by anyone.<br/><br/>So, she had placed these two things in the pocket of the uniform.<br/><br/>Charlotte Lane poured out the two pills from the glass medicine bottle and swallowed them directly.<br/><br/>After swallowing the pills, she went back to the Bedchamber.<br/><br/>She brought the two incense burners in the room to the head of the bed.<br/><br/>After waiting for five minutes, she scooped out the incense powder that had not been burned completely from the burner.<br/><br/>The ceiling light was on, and the light cast a small shadow from her eyelashes onto her eyes.<br/><br/>It was not clear if it was because of the incandescent lamp, but her originally cold white skin seemed even colder.<br/><br/>The faint pink on her lips seemed to be filled with icy indifference.<br/><br/>She casually leveled the ashes in the incense burner. Then she placed the seal mold and slowly spread the incense powder from the sealed bag on it, bit by bit.<br/><br/>Each movement was neither fast nor slow, but with each action, a mechanical coldness was revealed.<br/><br/>The incense powder in both burners was ignited, and the scent of Eaglewood began to drift again.<br/><br/>There was not much difference compared to the previous times.<br/><br/>Charlotte Lane placed one incense burner on the bedside table.<br/><br/>“I don’t know,” Kevin Clark said, “I didn’t let them in, and I didn’t ask in detail.”<br/><br/>“Someone is deliberately targeting me,” Charlotte Lane said.<br/><br/>“So...I won’t let them take you away,” Kevin Clark made his stance clear. “Even if you want to go, I won’t let you.”<br/><br/>Charlotte Lane looked at him, and after a moment, smiled, “They’re already at the door.”<br/><br/>“They don’t dare to break in,” Kevin Clark’s fingertips moved, “I will investigate it as soon as possible.”<br/><br/>Charlotte Lane looked at his lips slightly pursed, and after a moment of silence, asked, “What if I insist on going with them?”<br/><br/>Kevin Clark suddenly frowned, subconsciously wanting to grab Charlotte Lane’s hand, but the hand on his leg, trying to move but unable to exert strength.<br/><br/>He tried to move his other hand, but couldn’t lift it either, completely powerless.<br/><br/>Not only his hands, but also his legs, waist, and neck gradually lost strength.<br/><br/>He suddenly looked at Charlotte Lane.<br/><br/>Charlotte Lane had never seen Kevin Clark show such fierce eyes to her. She smiled, her hand covering Kevin Clark’s, “Brother Arthur, don’t waste your energy. That incense...”<br/><br/>Charlotte Lane glanced at the incense next to her, “I tampered with it. Because of your drug resistance, I used this slow infiltration method.”<br/><br/>Kevin Clark was so angry that the veins in his neck bulged. He didn’t want to hear the four words “Brother Arthur” at all right now.<br/><br/>Charlotte Lane touched his hand, “This trick... I learned from Isaac Amos. I took the medicine in advance. The incense powder I mixed will not harm the body. After it burns out, your strength will slowly recover in an hour.”<br/><br/>Kevin Clark glanced at the incense burner, and it would be more than two hours before it burned out.<br/><br/>“Dean Yue...was harmed by Peter Qinke and Edward Kirsten.” Charlotte Lane’s smile disappeared from her face, replaced by numb coldness, “I learned about it on the day of the dean’s funeral. The Maxwell family is an accomplice.”<br/><br/>Kevin Clark looked at her. As she mentioned Edward Kirsten, her eyes, which were full of hatred, became flustered, and the corners of her eyes gradually reddened.<br/><br/>“They framed me, forcing me to be unable to stay in the country and to join them,” Charlotte Lane said coldly, “So... I decided to go along with their plan.”<br/><br/>Kevin Clark moved his lips with difficulty, his voice strained, “Charlotte Lane!”<br/><br/>Charlotte Lane blinked her eyes, looking at Kevin Clark, “Brother Arthur, I know that if you say we can have a good year this year, you can do it. It’s just a matter of a few months. But in these few months...I don’t want to see anyone else die because of me.”<br/><br/>Kevin Clark’s fingers moved slightly.<br/><br/>Charlotte Lane held his fingers, gently rubbing his knuckles, “Besides...I want to know the data in his laboratory. With Edward Kirsten’s personality, if caught, he would immediately destroy the laboratory. The data inside is essential to us and will speed up our experiments.”<br/><br/>Kevin Clark’s whole body was numb, and finally, even his voice was gone. He could only force himself to look at Charlotte Lane and compete with his body.<br/><br/>“Brother Arthur. Don’t be angry,” Charlotte Lane said softly, “I will protect myself. After I come back... whether you want to lock me up or anything, I accept it.”\t\t\t\t\t\t</div>", "images": {}, "success": true}