{"id": 574, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998926.html", "title": "Chapter 571 - 514: Wait For Her To Be Utterly Discredited", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 571 - 514: Wait For Her To Be Utterly Discredited</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 571: Chapter 514: Wait for Her to Be Utterly Discredited<br/><br/>“Mr. Maxwell, what should we do now? Nicholson Amos turned out to be Charlotte Lane, and she smoothly became the dean.” A member of the Skyler Family said, “Now, not only have we offended the Dean, but we’ve also fallen out with both the Clark and Lane Families.”<br/><br/>“Who would have thought that Ezekiel Santiago would suddenly pull something like this? Our initial target was Turner Daniel, but it ended up being Nicholson Amos.” A member of the Ferguson Family also said.<br/><br/>“The situation has become dire now. Although the twelve families are equal within the Research Institute, offending the Clark and Lane Families will bring us misery in the future.” The Skyler Family said.<br/><br/>“Wasn’t her name Daisy Zane? Wasn’t she from the Song Family in Truro City? How did she become Charlotte Lane?”<br/><br/>“Right, let’s utilize public opinion against her identity.”<br/><br/>“It won’t be of much use.” Julian Maxwell said in a low voice, “Many have already questioned her identity online. Netizens already have their doubts, and it’s not going to harm her significantly.”<br/><br/>“Then what should we do? Kevin Clark is notoriously ruthless, and Nicholson Amos doesn’t seem easy to deal with, just like a cold-faced assassin.” A member of the Skyler Family said, “With these two devils, how can we live peacefully in the future?”<br/><br/>“That’s right, Mr. Maxwell.” A member of the Ferguson Family also chimed in, “Please think of a solution for us. What should we do?”<br/><br/>Julian rubbed his brows, feeling incredibly annoyed inside, yet still polite to the two families.<br/><br/>After all, if Charlotte Lane were to be dismissed,<br/><br/>He would still have to rely on these two families to support his recommended candidate.<br/><br/>“You don’t have to worry; I have ways to deal with Daisy Zane.” Julian said, “Whether she is the dean or not, I won’t let her stay. Just go back and wait for the news.”<br/><br/>The members of the Skyler and Ferguson Family exchanged glances.<br/><br/>Both had heard that the tragic fate of the Maxwell siblings was due to Daisy Zane.<br/><br/>Therefore, they didn’t really have a place in the resentment towards her.<br/><br/>It was natural for the Maxwell Family to take care of her.<br/><br/>“As long as Mr. Maxwell has a plan, that’s good.”<br/><br/>“Well, then we won’t bother you. We will wait for your good news.”<br/><br/>After they left, Julian sat at home for a while, calming his emotions. Then he returned to his room to make a phone call.<br/><br/>When the call was connected, he directly asked, “Do you know about Daisy Zane being Charlotte Lane?”<br/><br/>There was a brief silence on the other end: “I don’t.”<br/><br/>“What about her becoming the dean by Ezekiel Santiago’s arrangement?”<br/><br/>“Oh?” The person on the other end spoke with interest, “The old master has chosen her as the dean. Wasn’t it supposed to be for Turner Daniel? This is... even more interesting.”<br/><br/>Listening to his light tone, Julian felt even more irritated, but he managed to suppress it and asked, “Isn’t it time for you to take action on the matter?”<br/><br/>The matter got too heated and involved the Research Institute, so they had to respond.<br/><br/>First, the Santiago Family contacted the Research Institute and issued a statement.<br/><br/>It explained that the Research Institute never stipulated that the Dean must be an inside member of the 12th Families.<br/><br/>It also explained the fairness of the conference voting process.<br/><br/>But netizens still didn’t accept it.<br/><br/>They began attacking the Clark family and the Research Institute.<br/><br/>They accused the Clark Family of secretly manipulating the votes, buying over relationships and threatening other families.<br/><br/>They also accused the Research Institute of corruption, saying that they deliberately announced Daisy Zane as the Dean to the public. Back then, the Deans were all insiders of the 12th Families.<br/><br/>Anyway, they refused to let go.<br/><br/>Half an hour later, the official website of the Lane Family responded.<br/><br/>[Just saw the messages online and decided to clarify some things. We originally wanted to keep a low profile, but...the situation now seems not to allow it.<br/><br/>Today’s protagonist of the online events, Nicholson Amos, who we all know as Daisy Zane, is our daughter Charlotte Lane, who went missing for eleven years.<br/><br/>Don’t come here questioning us, saying that we only gave her the identity of the Lane Family’s eldest miss just to make her the Dean.<br/><br/>My daughter’s identity in the Lane Family is not something that anyone can have, nor anyone can be capable of. Other than her, her true self.<br/><br/>We, the Lane Family, will not give anyone the position of my daughter for the sake of their relationship or ego.<br/><br/>So...everyone, mind your own mouths.<br/><br/>As for the other matters, regarding the doubts about Daisy Zane’s identity, it will be explained by Lila Campbell personally in the future.]<br/><br/>After the Lane Family issued its statement, the Research Institute updated their response again.<br/><br/>It reiterated once more that the Dean does not have to be from within the 12th Families.<br/><br/>They even released the eligibility criteria for the Dean election.<br/><br/>Then the official website of the Clark Family also issued a statement: [We’ve already said that it was a marriage proposal that day. Instead of guessing about Third Master Clark, who is already married, why are you all insisting on guessing about Young Master Clark and Young Master Lane, sighing jpg.]<br/><br/>Dealing with these online messages was all done by Harton Clark, in consultation with the Lane and Santiago families.<br/><br/>Charlotte Lane was never involved, and she didn’t even know what was happening online.<br/><br/>She returned to the Rose Garden after leaving the Research Institute.<br/><br/>After coming back, she washed and rinsed up before going to bed.<br/><br/>She needed rest after several days of intense thinking and emotional upheaval to restore her energy.\t\t\t\t\t\t</div>", "images": {}, "success": true}