{"id": 575, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998929.html", "title": "Chapter 572 - 515: This Is Your Uncle", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 572 - 515: This Is Your Uncle</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 572: Chapter 515: This is Your Uncle<br/><br/>[Ladies, let me make this clear today. If anyone dares to question Charlotte Lane’s status again, I swear I will play a father role for all of you.]<br/><br/>[This is my solemn oath, if I ever defend her identity or argue with anyone about it again, I will only use a 2G network for going online.]<br/><br/>[This is just unfair. I’m here arguing and fighting. And what’s the conclusion? She is Charlotte Lane! She is Charlotte Lane! I! I! Why would I need to worry about a young lady of nobility? Am I worthy!?]<br/><br/>[To be honest, if I took a brick from the Doomsday Hotel, I could live a life of luxury for the rest of my lifetime, without a care in the world.]<br/><br/>[Oh my God. That’s the Lane Family. That’s the Lane Family. I often see circles of so-called famous rich ladies mocking at Brook Sister, a nobody climbing up to the Clark Family and becoming a phoenix. Our Brook Sister was born a phoenix.]<br/><br/>[I’ve seen it too. They always get together and analyze Brook Sister. Now they’ve been slapped in the face. What kind of family, what kind of famous rich lady can compare with the Lane Family.]<br/><br/>[Why do they analyze Brook Sister so often? Because they are jealous. This round, it really felt good to let out a breath.]<br/><br/>[What did I do to deserve watching a TV series starred by the eldest daughter of Lane Family.]<br/><br/>[Damn it, in my lifetime, I actually witnessed a marriage alliance between the Clark Family and the Lane Family. What a major event I am witnessing.]<br/><br/>[Wait, ladies, I’ve noticed something. Charlotte Lane and Third Master Clark...don’t they have an age difference?]<br/><br/>[!!!!!!!!!!!!!!!!!!!]<br/><br/>[Ahhhhhhhhhhhhhhhhhh!]<br/><br/>[It’s more than that. If Brook Sister is Charlotte Lane, then their age difference widens. Third Master is six years older than Brook Sister!]<br/><br/>[Uncle who is six years older. Suddenly Third Master seems a bit old.]<br/><br/>[I’m going to say hi to our Uncle.]<br/><br/>[Wait, I’m going too.]<br/><br/>[Is this really okay? You guys are too mean. Have you ever thought about how Third Master feels? I don’t think we should behave like this. Count me in, our Uncle needs some support.]<br/><br/>...<br/><br/>At around seven o’clock in the evening, Kevin Clark was looking at the comments on his Facebook post. All of them called him “Third Uncle”, “Uncle”, “Uncle Clark”.<br/><br/>HIs head throbbed with pain.<br/><br/>His latest Facebook post was still from a long time ago.<br/><br/>The comments below had been thoroughly replaced.<br/><br/>Thinking about it, since he started using Facebook...<br/><br/>He has always been ridiculed online.<br/><br/>Him, the almighty Chairman of the Easton Group, the fearsome Third Master Clark, constantly being made fun of...<br/><br/>It’s just wonderful.<br/><br/>Upon seeing this, Henry Horton kept sending him laughing messages. Kevin Clark just blocked him.<br/><br/>After a while, Thomas Firway brought a food box in, knocking on the door: “Third Master, Mom made it herself.”<br/><br/>“My mom cooked?” Kevin Clark put down his phone, surprised and raised an eyebrow.<br/><br/>“Yes.” Thomas Firway nodded, then said, “But... she only made some for Third Brother.”<br/><br/>Kevin Clark: “......” Okay, biological mother.<br/><br/>“So what about my food?” Kevin Clark asked again.<br/><br/>Thomas Firway was shocked, his facial expression stiffened, stammered, “I, I was in a hurry, a hurry to bring food to Third Brother... I forgot to bring yours.”<br/><br/>Kevin Clark stared at him for a while. Running to the Clark Manor, just to bring one person’s meal.<br/><br/>If his biological mother did not cook, it wouldn’t hurt to bring some from home.<br/><br/>Thomas Firway lowered his head, not daring to look up: “I, I’ll go get it right away.”<br/><br/>After a while, Kevin Clark looked away: “Forget it, just have the Aunt at the Villa make something.”<br/><br/>Third Master Clark’s status kept falling, even his quality of life deteriorated a bit.<br/><br/>“Yes.”<br/><br/>“Did you find out why the Hundred Demons Pavilion came to the domestic market?” Kevin Clark asked again.<br/><br/>At the mention of this, Thomas Firway’s voice grew a little louder: “I asked. But James Collins didn’t tell me. He said not to steal the secrets of the Hundred Demons Pavilion.”<br/><br/>Kevin Clark: “.......What use are you to me.”<br/><br/>Thomas Firway moistened his lips, quieted for a while and said, “There should be no problem. It’s just a dozen or so people, and they’re in Imperial Capital. We’d know at the slightest stirring.”<br/><br/>“Alright, go on.”<br/><br/>Thomas Firway took a few steps towards the exit, then promptly stopped. “Third Master, you should call your ‘Third Bro’ too. Our meal would cool if we don’t eat now.”<br/><br/>“I don’t need you to tell me.”<br/><br/>The tone of Third Master’s voice suddenly grew cold. Hearing this, Thomas Firway quickly opened the door and ran out.<br/><br/>After sitting in the study for a while, Kevin Clark took a food box and headed to the bedchamber.<br/><br/>The bedchamber was without light, pitch black.<br/><br/>He walked in the dark to get inside. He turned on the lamp at the foot of the bed.<br/><br/>The dim yellow light illuminated the room.<br/><br/>Charlotte Lane was still sleeping. She lay on her side on the bed, her quilt covering her head, exposing only a few strands of hair.<br/><br/>Kevin Clark walked to the head of the bed, put down the food box, then sat beside the bed and pulled open her quilt.<br/><br/>He knew Charlotte Lane was aware of his presence, yet she remained motionless.<br/><br/>“Little girl.” Kevin’s hand reached under her neck, gave it a gentle touch, then he leaned down and kissed her cheek once. “Wake up, have some food.”<br/><br/>After a while, Thomas Firway brought a food box in, knocking on the door: “Third Master, Mom made it herself.”<br/><br/>“My mom cooked?” Kevin Clark put down his phone, surprised and raised an eyebrow.<br/><br/>“Yes.” Thomas Firway nodded, then said, “But... she only made some for Third Brother.”<br/><br/>Kevin Clark: “......” Okay, biological mother.<br/><br/>“So what about my food?” Kevin Clark asked again.<br/><br/>Thomas Firway was shocked, his facial expression stiffened, stammered, “I, I was in a hurry, a hurry to bring food to Third Brother... I forgot to bring yours.”<br/><br/>Kevin Clark stared at him for a while. Running to the Clark Manor, just to bring one person’s meal.<br/><br/>If his biological mother did not cook, it wouldn’t hurt to bring some from home.<br/><br/>Thomas Firway lowered his head, not daring to look up: “I, I’ll go get it right away.”<br/><br/>After a while, Kevin Clark looked away: “Forget it, just have the Aunt at the Villa make something.”<br/><br/>Third Master Clark’s status kept falling, even his quality of life deteriorated a bit.<br/><br/>“Yes.”<br/><br/>“Did you find out why the Hundred Demons Pavilion came to the domestic market?” Kevin Clark asked again.<br/><br/>At the mention of this, Thomas Firway’s voice grew a little louder: “I asked. But James Collins didn’t tell me. He said not to steal the secrets of the Hundred Demons Pavilion.”<br/><br/>Kevin Clark: “.......What use are you to me.”<br/><br/>Thomas Firway moistened his lips, quieted for a while and said, “There should be no problem. It’s just a dozen or so people, and they’re in Imperial Capital. We’d know at the slightest stirring.”<br/><br/>“Alright, go on.”<br/><br/>Thomas Firway took a few steps towards the exit, then promptly stopped. “Third Master, you should call your ‘Third Bro’ too. Our meal would cool if we don’t eat now.”<br/><br/>“I don’t need you to tell me.”<br/><br/>The tone of Third Master’s voice suddenly grew cold. Hearing this, Thomas Firway quickly opened the door and ran out.<br/><br/>After sitting in the study for a while, Kevin Clark took a food box and headed to the bedchamber.<br/><br/>The bedchamber was without light, pitch black.<br/><br/>He walked in the dark to get inside. He turned on the lamp at the foot of the bed.<br/><br/>The dim yellow light illuminated the room.<br/><br/>Charlotte Lane was still sleeping. She lay on her side on the bed, her quilt covering her head, exposing only a few strands of hair.<br/><br/>Kevin Clark walked to the head of the bed, put down the food box, then sat beside the bed and pulled open her quilt.<br/><br/>He knew Charlotte Lane was aware of his presence, yet she remained motionless.<br/><br/>“Little girl.” Kevin’s hand reached under her neck, gave it a gentle touch, then he leaned down and kissed her cheek once. “Wake up, have some food.”<br/><br/>Charlotte Lane’s eyes were closed. Her eyelashes twitched slightly, but she gave him no response.<br/><br/>“We can sleep after we’ve eaten.” Kevin Clark looked down at her face, his hand sneakily caressing here and there, as if admiring a precious treasure.<br/><br/>Charlotte Lane removed his hand, trying to pull the quilt over her head; she failed. She knitted her brows lightly and mumbled, “I don’t want to eat.”<br/><br/>Kevin Clark kissed her again, “At least have a little bit.”<br/><br/>“No.” Charlotte Lane gently pushed him away, “You go sleep in another room tonight.”<br/><br/>Kevin Clark was taken aback, “Isn’t it too much to ask to sleep in separate rooms?”<br/><br/>Charlotte Lane ignored him.<br/><br/>“I won’t do anything, you know?” Kevin Clark pinched her earlobe, “You feel I take up half of your bed?”<br/><br/>Charlotte Lane pushed him away again.<br/><br/>Kevin Clark grabbed her hand, his voice soothing, “Sleep after you eat. My mom personally cooked this meal just for you. Can you give her a bit of face?”<br/><br/>Charlotte Lane forced herself to open her eyes.<br/><br/>Kevin Clark smiled, then kissed her lips again. He then stroked her face and held her at the back of her neck, making her sit up. “Looks like my mom’s face outweighs mine.”<br/><br/>“You just realized it?” Charlotte Lane yawned and asked, “What time is it? Why did you make a trip to Clark Manor for a meal?”<br/><br/>“Around seven thirty. I was initially planning to head for Doomsday Hotel. The journey was about the same, so I went to Clark Manor.” Kevin Clark opened the food box and took out the food, “Eat a bit, then go back to sleep.”<br/><br/>“Hmm.” Charlotte Lane responded and then reached for her cell phone.<br/><br/>Upon opening her cell phone, the piles of messages almost caused her phone to explode.<br/><br/>She wasn’t sure which one to check first.<br/><br/>“What’s going on online?” Charlotte Lane directly asked.<br/><br/>Kevin Clark poured her a bowl of soup, “Everyone knows that you are Charlotte Lane now.”<br/><br/>Charlotte Lane didn’t say anything, nor did she react in any particular way. This was somewhat expected.<br/><br/>While she was eating, Kevin sat beside her. After a while, he asked, “Does the arrival of the Hundred Demons Pavilion faction in the capital indicate any plans?”<br/><br/>Charlotte Lane was concentrating on her food, only when he asked did she look up at him, “Who’s in the capital?”<br/><br/>“James Collins’ team.”<br/><br/>“I don’t know. No one told me.” Said Charlotte Lane, her voice was cool, yet firm, “Has there been any trouble?”<br/><br/>Seeing the genuine ignorance in her eyes, Kevin Clark felt a pang of relief, “No. They just suddenly came to the capital. It was rather curious.”<br/><br/>“Luke has the power to make decisions, many things don’t have to go through me.” Charlotte Lane said, “There should be no trouble. He’ll leave after finishing the task. He would’ve told me otherwise.”<br/><br/>“Hmm.”<br/><br/>Without further words, Charlotte Lane eagerly continued her food.<br/><br/>A quiet sigh of relief echoed in her heart.\t\t\t\t\t\t</div>", "images": {}, "success": true}