{"id": 572, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998920.html", "title": "Chapter 569: 512: Dean…", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 569: 512: Dean…</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 569: Chapter 512: Dean...<br/><br/>The news of the Eldest Miss Lane getting lost was not widely known. Some people even didn’t know how many children the Lane Family had.<br/><br/>However, the people in the conference hall today happened to know about this.<br/><br/>For ten or more years, they thought that the Lane Family’s daughter would never return.<br/><br/>Unexpectedly, not only did she come back, but they also met her today.<br/><br/>Sophie Ortiz’s few words left everyone a bit confused.<br/><br/>Julian Maxwell was silent for a while, and then said, “Mrs. Lane, don’t talk nonsense. The eldest daughter of the Lane Family? Where is she?”<br/><br/>“Is Mr. Maxwell going to treat his ears? Or should I check his brain?” Allonzo Hobson said, “Mrs. Lane has made it clear, didn’t you understand? The daughter-in-law of the Clark Family, Kevin’s wife, Nicholson Amos, is the Eldest daughter of the Lane Family, Charlotte Lane. Do you understand?”<br/><br/>“How is that possible!” Julian Maxwell refuted in haste, raising his voice a bit.<br/><br/>“Why isn’t it possible?” Sophie Ortiz asked back, “Is my Lane Family’s daughter fake?”<br/><br/>“What evidence do you have to prove she is Charlotte Lane?” Julian Maxwell said, “I’m afraid, you people intentionally said that to make her eligible to run for the position of Dean.”<br/><br/>“Why does my daughter have to prove herself to you?” Sophie Ortiz’s voice rose a bit too, “No one can replace my Lane Family’s daughter. This is the identity of my family’s eldest daughter, and only she has the right to hold this identity.”<br/><br/>William Lane calmly nodded his head.<br/><br/>Andrew Lane also leisurely nodded.<br/><br/>The four members of the Santiago Family sat opposite to them, staring blankly at Charlotte Lane, their faces expressionless.<br/><br/>The always smiling face of Austin Allen suddenly sank, and he stared foolishly at Charlotte Lane. If it wasn’t for the occasion, he would want to immediately call his brother.<br/><br/>That is the Lane Family’s daughter!<br/><br/>That is the Lane Family’s eldest daughter!<br/><br/>Phoebe Turner grabbed Allonzo Hobson’s clothes, spinning him around to face her, her eyes full of disbelief and shock as she stared at him.<br/><br/>Allonzo Hobson glanced at his mother and father, then nodded at them.<br/><br/>Phoebe Turner’s eyes widened even more, disbelievingly glanced at Charlotte Lane, and then pinched Allonzo Hobson.<br/><br/>Allonzo Hobson silently gasped, rubbing his arm, whispering, “Mom, what are you doing?”<br/><br/>“You’ve grown up with such a hard wing, and you don’t even share the news with your mother anymore.”, Phoebe Turner whispered, “I missed so many first-hand news. And it’s such a big thing.”<br/><br/>Allonzo Hobson made a bitter face: “I’ll definitely tell you first next time.”<br/><br/>“How can she be Charlotte Lane?” Julian Maxwell still couldn’t believe it and didn’t want to believe it.<br/><br/>Sophie Ortiz gave him a glance and ignored him.<br/><br/>He looked back at her, giving her a gentle smile. His fingers tapped her hand to reassure her.<br/><br/>Everyone tacitly refrained from rushing the proceedings, and the meeting seemed to pause, quieting down.<br/><br/>It wasn’t until another 5 minutes had passed, giving everyone enough time to think, that Turner Daniel’s father and Kevin Clark exchanged glances and said, “I guess everyone has thought it through. Let’s vote.”<br/><br/>William Lane nodded.<br/><br/>“Alright,” Xavier Dominic responded.<br/><br/>Julian Maxwell wanted to say something, but his lips moved without making a sound, and he ended up sitting silently in his seat with a pale face.<br/><br/>Seeing that no one had any objections, Turner Daniel’s father said directly, “If you agree on Nicholson Amos to be the next dean, write ‘agree’, otherwise, ‘disagree’. We all know the process, so I won’t waste words. Please write your decision.”<br/><br/>There was a tablet on the table for each family.<br/><br/>After everyone had written their agreement or disagreement, the large screen in the conference hall would show the voting results.<br/><br/>Three minutes were given to vote.<br/><br/>Turner Daniel saw that everyone had finished voting and turned on the conference hall screen with the remote control.<br/><br/>The results of the vote were clearly displayed on the screen.<br/><br/>More than half of the votes were in favor.<br/><br/>Seven families agreed, two abstained, and three disagreed.<br/><br/>After seeing the results, Xavier Dominic was the first to clap.<br/><br/>The Santiago Family followed suit, with Hugo Clark and the Lane Family joining in.<br/><br/>Kevin Clark kindly said, “Congratulations, Dean Lane.”<br/><br/>Charlotte Lane didn’t have much of a reaction; she just blinked lightly when Kevin Clark spoke.<br/><br/>Her ambitions were indeed great.<br/><br/>She was also used to fighting and striving for what she wanted on her own.<br/><br/>But this dean’s position was secured for her by others’ protection.<br/><br/>At this moment, it was more about fulfilling Dean Yue’s last wish.<br/><br/>She struggled to suppress her emotions, not letting anything leak out.<br/><br/>“Brook Sister, congratulations,” Xavier Dominic hastily offered his blessings, bypassing Hugo Clark.<br/><br/>Hugo Clark, in disgust, peeled Xavier Dominic’s hand off him, and then said, “Congratulation, Auntie.”<br/><br/>Charlotte Lane’s eyes were continuously red, and her expression was somewhat rigid. She just smiled politely at them...\t\t\t\t\t\t</div>", "images": {}, "success": true}