{"id": 570, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998914.html", "title": "Chapter 567: 510: The New Dean", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 567: 510: The New Dean</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 567: Chapter 510: The New Dean<br/><br/>Three days later, a meeting was convened within the Research Institute.<br/><br/>Everyone was focused on the Dean’s position, genuinely concerned about the matter. Not just domestically, but also internationally, all eyes were on the Research Institute.<br/><br/>Thus, the sooner the new Dean was confirmed, the better.<br/><br/>On the day of the meeting, all twelve families of the institute were in attendance.<br/><br/>Furthermore, not only did each family send one representative, but they had all come in larger numbers, hence a large conference hall was purposely used.<br/><br/>The Lane Family couple and William Lane were all present.<br/><br/>Hugo Clark represented the Clark Family.<br/><br/>The Hobson Family attended as a trio.<br/><br/>Charlotte Lane could have chosen not to come.<br/><br/>However, she was slightly worried about Turner Daniel, so she asked Kevin Clark to accompany her early in the morning.<br/><br/>Tables were arranged in four directions in the conference hall, surrounding an empty space in the middle. The sightline was clear, and one could easily see the people sitting opposite with a glance.<br/><br/>Everyone arrived early, taking their seats, with little conversation. Each one appeared solemn, preparing for the intense discussion ahead that would draw no blood.<br/><br/>The Santiago Family arrived only right when the meeting was supposed to start.<br/><br/>As Turner Daniel, his family of three, and Siera Santiago entered the conference hall with Austin Allen, everyone immediately turned their gaze towards them.<br/><br/>However, the Santiago Family merely greeted the Clark and Lane families from across the room with their eyes before sitting down nearby.<br/><br/>After Austin Allen took his seat next to Turner Daniel, he cocked an eyebrow and greeted Charlotte Lane sitting diagonally across him.<br/><br/>Charlotte Lane: “......”<br/><br/>Once everyone arrived, the conference hall suddenly went quiet for a moment.<br/><br/>In the silence, an endless taste of gunpowder permeated.<br/><br/>It seemed like the smallest spark would cause an explosion that could tear the sky apart.<br/><br/>Hugo Clark waited for someone to speak with a stern face.<br/><br/>Somebody would inevitably lose their patience, exposing their desire.<br/><br/>After he waited for a while, he inadvertently looked down to see Kevin Clark, sitting next to him, playing with the diamond ring on his aunt’s hand under the table.<br/><br/>Hugo Clark: “......” He regretted letting his gaze wander.<br/><br/>More than a minute passed without anyone saying a word.<br/><br/>Finally, Julian Maxwell spoke first.<br/><br/>“Now that everyone has arrived, let’s begin the meeting.”<br/><br/>Austin Allen’s voice wasn’t loud, but his words resonated like a giant boulder thrown into the sea, stirring up waves of reactions.<br/><br/>Aside from Dean Yue’s family and Siera Santiago, everyone was taken aback.<br/><br/>Proponents, opponents, and even those neutral were stunned into silence.<br/><br/>Regardless of their positions, they all came today thinking Turner Daniel would be the successor.<br/><br/>But none of them could have anticipated Nicholson Amos.<br/><br/>Having always been composed, even Charlotte Lane was taken aback upon hearing the announcement.<br/><br/>Harton Clark gently touched the ring on her hand and then slowly enveloped her hand in his.<br/><br/>Compared to the others, Harton Clark was calm.<br/><br/>He had a vague suspicion, and even... when Charlotte Lane inferred that things were not quite right, he had deliberately guided her.<br/><br/>Charlotte Lane, after a moment of shock, looked towards Turner Daniel.<br/><br/>As Turner Daniel noticed her gaze, he responded with a smile.<br/><br/>Charlotte Lane quickly understood the situation.<br/><br/>From the beginning, Dean Yue never intended for Turner Daniel to take charge of the Research Institute.<br/><br/>He simply had Turner Daniel shoulder the risks on her behalf.<br/><br/>In the Research Institute, the potential candidates were few.<br/><br/>The younger ones were her, Harton Clark, and William Lane... and a few older ones.<br/><br/>She had been granted the exceptional opportunity to join the Research Institute by Dean Yue himself.<br/><br/>Whether it was her novel methods of addressing the suppression of 319 or her solution for researching 319, among other things.<br/><br/>All of it made her stand out, attracting attention.<br/><br/>She hadn’t been at the Research Institute for long, but her achievements surpassed those of others who had been there for years.<br/><br/>With the support of the Clark family and being the favored, perhaps even preferred, choice of the Dean, it made her become an attention-getting target.<br/><br/>If Dean Yue did not explicitly groom a successor, she would have been the most likely candidate for the next Dean.<br/><br/>However, with a designated successor, no matter how high her achievements, the attention on her would lessen.<br/><br/>That is why Dean Yue had been so ostentatious in fostering Turner Daniel; it was all to protect her.<br/><br/>Charlotte Lane’s eyes gradually grew moist.<br/><br/>Dean Yue’s words – “make her obey,” weren’t a command to protect Turner Daniel’s succession.<br/><br/>Instead, they were an instruction for her to heed his words and accept the position of Dean...\t\t\t\t\t\t</div>", "images": {}, "success": true}