{"id": 586, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15007766.html", "title": "Chapter 583 - 526: All Used Against Him", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 583 - 526: All Used Against Him</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 583: Chapter 526: All Used Against Him<br/><br/>Imperial Capital, Easton Group.<br/><br/>“Third Master, Peter Qinke has been captured.” Juan Wright received a call and went to the office to report.<br/><br/>Kevin Clark was looking at all the maps in the office, searching for possible places where Charlotte Lane and her party could be hiding.<br/><br/>Upon hearing Juan’s words, Kevin turned his gaze towards him.<br/><br/>Understanding his intentions, Juan replied, “Only Peter Qinke.”<br/><br/>The expression in Kevin’s eyes darkened, and he asked, “Where did they take him?”<br/><br/>“Emperor Winter Mansion’s basement,” Juan responded, “Our men had just brought Peter Qinke back when they ran into Luke. Luke and James Collins followed them to Emperor Winter Mansion, seemingly wanting to see you.”<br/><br/>The Emperor Winter Mansion was Kevin Clark’s residence, and when he wasn’t at Clark Manor, he would return there.<br/><br/>But after discovering Charlotte Lane’s liking for the rose garden, he started frequenting the mansion more often.<br/><br/>Besides, there were a lot of places in Emperor Winter Mansion that were under renovation, which was why he never took Charlotte Lane there.<br/><br/>Kevin Clark made his way out: “Let’s go to Emperor Winter Mansion.”<br/><br/>“Yes, sir.”<br/><br/>Arriving at Emperor Winter Mansion, Kevin didn’t go to the living room but went directly to the basement in the backyard.<br/><br/>The basement was dark and damp.<br/><br/>Even though the lights on the walls on either side were bright, they still gave off an unbearably gloomy and lightless atmosphere.<br/><br/>Juan followed Kevin into the room where Peter Qinke was detained.<br/><br/>Peter Qinke was tied to a chair, shivering at the sight of Kevin, “Th, Third Master.”<br/><br/>Kevin sat across him, his expression cold and his tone light. He cut straight to the chase, “Did you ever feel guilty when you harmed the Dean?”<br/><br/>Peter Qinke’s terrified expression suddenly turned dumbstruck.<br/><br/>“The Dean never suspected you until his death,” Kevin said, “Otherwise, he wouldn’t have been tricked by you.”<br/><br/>Peter Qinke was unable to utter a single word, but his hands were shaking uncontrollably.<br/><br/>“With your abilities... and the Dean’s feelings for you...” Kevin’s hand was rhythmically tapping on the table beside him. Each tap sounded like it was striking Peter Qinke’s heart, causing his eyelashes to tremble, “If you came clean with the Dean, would the M Continent Laboratory have been yours?”<br/><br/>Peter Qinke slightly furrowed his brows.<br/><br/>Kevin said, “It would have been. The Laboratory’s style wouldn’t have lasted much longer. If you were honest with him... the Laboratory would be yours.”<br/><br/>All of a sudden, Peter Qinke closed his eyes and leaned back against the chair, appearing to be quite relaxed.<br/><br/>Kevin clenched his fist, stopped tapping the table, and asked softly, “Did you cause the Dean’s initial illness?”<br/><br/>Peter Qinke replied mechanically, “Yes. I tampered with his meals. That’s why the hospital thought it was from lab radiation exposure.”<br/><br/>Standing behind Kevin, Juan was on a call with his cell phone.<br/><br/>The screen displayed the name Turner Daniel.<br/><br/>Kevin asked, “Where were you planning to go when you escaped?”<br/><br/>“I was going to meet Edward Kirsten,” replied Peter Qinke.<br/><br/>“Where is he?” Kevin’s gaze darkened.<br/><br/>“I don’t know,” Peter Qinke replied, “The few escorts and I were separated from the main group by your men. We were following the people ahead and didn’t know the destination. Once we were separated, we had no idea where to go. We were trying to secretly get in touch with them, but we never found them.”<br/><br/>Then a few minutes later, Daniel came out, supporting himself against a tree, retching.<br/><br/>Seeing him constantly throwing up, almost bringing up his bile, Juan Wright kindly patted his back.<br/><br/>Poor kid, he told him not to go in.<br/><br/>He’llprobably lose his appetite for many meals.<br/><br/>After a while, Turner Daniel was unable to vomit anymore. His face was pale. He walked a few steps to the side, leaned against another tree, his whole body still trembling a bit. He asked in a listless tone: “Is he still alive?”<br/><br/>“Yes,” Juan Wright said, “Just barely.”<br/><br/>Turner Daniel shuddered, his body hair standing up again: “I’ve learned one thing.”<br/><br/>“What?”<br/><br/>“People must heed advice.” Turner Daniel squatted down against the tree.<br/><br/>Juan Wright chuckled softly: “Third Master went to the front hall, do you want to see him?”<br/><br/>Turner Daniel shook his head: “I don’t want to see him for a while, I dare not.”<br/><br/>“Okay, then I won’t keep you.”<br/><br/>“Wait a bit, stay a bit longer.” Turner Daniel sat down directly, “My legs are weak, I can’t walk.”<br/><br/>Juan Wright: “......”<br/><br/>Meanwhile, after Kevin Clark returned to his room and changed clothes, he met with Luke and James Collins.<br/><br/>Both men stood up from the sofa when they saw Kevin Clark.<br/><br/>Luke was typically indifferent, greeted, “Third Master.”<br/><br/>James Collins thought for a moment and greeted, “Brother-in-law.”<br/><br/>Kevin Clark didn’t respond but gave James Collins a glance.<br/><br/>He sat down, and without showing any politeness, Luke and James followed suit.<br/><br/>Kevin Clark poured a glass of water, took a sip, and asked: “Has Lila said anything to you?”<br/><br/>“The Big Boss told us to follow your command.” Luke said, “Our people have been arranged around the Imperial Capital, some inside. We all obey the Third Master.”<br/><br/>Kevin Clark looked at Luke: “That’s all?”<br/><br/>Luke nodded.<br/><br/>Kevin Clark shifted his gaze away, silent for a while.<br/><br/>There wasn’t much to ask anyway, they just followed orders, their knowledge of the matter was probably less than his.<br/><br/>The purpose of this meeting was to tell him that they awaited his command.<br/><br/>So after a moment of silence, he casually asked: “Why didn’t you participate when Dark Radiance sent people before?”<br/><br/>“The Big Boss said... by helping her leave the Imperial Capital, she surprised Dark Radiance. Dark Radiance will hold back due to old ties.” Luke said calmly, “But if we interfere again afterwards, Third Master won’t show any mercy. So she asked us to pull back in time.”<br/><br/>If they were to fight without any restraint, both sides would probably end up hurting each other.<br/><br/>Kevin Clark closed his eyes, gritting his teeth in anger, “She really knows me well.”<br/><br/>Luke and James Collins remained silent.<br/><br/>Kevin Clark was infuriated, his head throbbing in pain.<br/><br/>That little girl’s tactics were all used against him.\t\t\t\t\t\t</div>", "images": {}, "success": true}