{"id": 585, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15001927.html", "title": "Chapter 582: 525: Starting To Miss Him A Bit", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 582: 525: Starting To Miss Him A Bit</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 582: Chapter 525: Starting to Miss Him a Bit<br/><br/>Charlotte Lane spent three days on the private island before setting off with Edward Kirsten again.<br/><br/>This time, her eyes were not covered. She spent two days traveling on the road, winding and turning.<br/><br/>Charlotte Lane almost vomited on the road.<br/><br/>After two days, they finally arrived at their destination.<br/><br/>Charlotte Lane slept continuously in the car. She didn’t open her eyes even when the car stopped because she didn’t know if there was any further travel; she didn’t bother to look outside either.<br/><br/>She was so tired and felt so nauseous that she didn’t even care.<br/><br/>It was only when Edward Kirsten called her that she opened her eyes.<br/><br/>Edward Kirsten rubbed her head, “Feeling better?”<br/><br/>Charlotte Lane stared at him: “Do I look better to you? With your driving skills, even if you paid me, I wouldn’t ride with you.”<br/><br/>Edward Kirsten smiled, “We’ve arrived, no more traveling.”<br/><br/>Without even looking outside, Charlotte Lane opened the car door and stepped out to take a breath of fresh air.<br/><br/><br/><br/>With the arrival of fresh air, Charlotte’s nausea eased a little.<br/><br/>Only then did she take a look around.<br/><br/>The car drove directly into the courtyard, stopping in front of the villa.<br/><br/>The courtyard was vast, and looking around, Charlotte recognized every part of it...every scene was extremely familiar.<br/><br/>It was identical to where she lived in Continent A.<br/><br/>And it was a one-to-one replica.<br/><br/>“Alice, bring the doctor over,” said Edward Kirsten.<br/><br/>Alice nodded and left.<br/><br/>Edward Kirsten walked to Charlotte’s side and said, “Go inside and rest for a while.”<br/><br/>Charlotte Lane withdrew her gaze from the distance, murmuring, “I’m going to sleep, don’t let the doctor disturb me.”<br/><br/>“Enigma...”<br/><br/>“If you dare to disturb me, I will scold you,” said Charlotte Lane.<br/><br/>Edward Kirsten: “... Enigma, don’t you think it’s time to soften your temper a bit?”<br/><br/>Charlotte Lane glanced at him, ignored him, and went straight into the villa. Out in the living room, she paused, looking towards the French windows of the small living room.<br/><br/>Back then in Continent A, it was at that very spot that she saw Jack Amos fall in the rainy night, into a pool of blood.<br/><br/>“Enigma,” Edward Kirsten’s voice broke her reverie from behind her.<br/><br/><br/><br/>Little night lights were hung on the greening of the courtyard, blinking like a sky full of stars. It was beautiful.<br/><br/>It had been her idea to hang them back then. And from her room, the view was the best.<br/><br/>“Does Harton Clark treat you well?” Edward Kirsten suddenly asked.<br/><br/>Upon hearing this name, Charlotte Lane’s hand tightened. She did not reply, but instead said, “You must know by now that my real last name is Lane, right?”<br/><br/>“Yes,” Edward Kirsten responded, “I saw the news online.”<br/><br/>“That’s surprising. You’re online,” said Charlotte Lane, “Ever since I came here, I haven’t seen any electronic devices. Are you preventing me from using them?”<br/><br/><br/><br/>“Would that stop you?” Edward Kirsten counter-questioned.<br/><br/>“It’s impossible for a clever woman to cook without rice,” Charlotte Lane said in a gentle voice, “No matter how capable I am, without devices, do you expect me to spread my thoughts by telepathy?”<br/><br/>Edward Kirsten was silent.<br/><br/>Charlotte Lane paused before saying, “I’ve known Martias Clark since I was a child. When I was very little, I liked him. Even though I forgot about him once, I fell in love with him again later.”<br/><br/>Listening to her words, Edward Kirsten bit by bit clenched his fists, struggling to suppress his anger: “You like him that much.”<br/><br/>“Yes,” Charlotte Lane looked at him, “So, are you going to kill him?”<br/><br/>Edward Kirsten looked into her eyes, his eyes revealing a storm that he was barely able to conceal, “If you behave, I can spare his life.”<br/><br/>The two shared a long and intense gaze; it was as if time had been stretched to infinity.<br/><br/>After a while, Charlotte Lane looked away and said, “Alright.”<br/><br/>Edward Kirsten didn’t have any particular reaction to her agreement, as if he’d expected it or didn’t entirely trust it.<br/><br/>“How many girls do you have around?” Charlotte Lane suddenly asked.<br/><br/>Edward Kirsten hesitated a moment before answering, “Not many.”<br/><br/>So, there were more girls like her.<br/><br/><br/><br/>“Edward Kirsten...” Charlotte Lane sighed lightly, her voice very soft, “You’re really crazy.”<br/><br/>“Enigma, didn’t you always know that?” Edward responded lightly, “I missed you so much, so whenever I saw a girl who looked like you, I wanted to keep them.”<br/><br/>“Now that I’m back, send them away,” Charlotte Lane said, looking at him.<br/><br/>“I can do that. But you have to promise me one thing.”<br/><br/>“What is it.”<br/><br/>“Be good, and stop getting angry easily.”<br/><br/>“Alright,” Charlotte Lane agreed, “This request won’t harm you or cause you any loss. I hope you will keep your promise.”<br/><br/>“When have I ever failed to do what I promised you?”\t\t\t\t\t\t</div>", "images": {}, "success": true}