{"id": 582, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998950.html", "title": "Chapter 579: 522: No One Can Feel Comfortable", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 579: 522: No One Can Feel Comfortable</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 579: Chapter 522: No One Can Feel Comfortable<br/><br/>It was obvious that Edward Kirsten had been prepared for Charlotte Lane’s arrival.<br/><br/>Or, he had been preparing since Charlotte left Continent A.<br/><br/>The place they were now was a private island.<br/><br/>Charlotte estimated that this should be a new resting place, as the room decorations seemed to be done in a hurry.<br/><br/>It was not Edward’s final base, and their brief rest might continue on.<br/><br/>When Charlotte returned to her room, Edward introduced her to the aunt who would be taking care of her life.<br/><br/>Aunt Zhou was in her fifties, she took Charlotte into the room and told her where the clothes were placed.<br/><br/>The clothes in the wardrobe were all Charlotte’s favorite styles, mostly skirts.<br/><br/>There were different sizes, Aunt Zhou looked at Charlotte and found a suitable size home clothes for her.<br/><br/>Throughout the process, Aunt Zhou only spoke three sentences, one of which was asking Charlotte if there was anything else to be done.<br/><br/>Charlotte said no.<br/><br/>Aunt Zhou then tidied up some ill-fitting clothes and took them out.<br/><br/>Charlotte waited for Aunt Zhou to leave, locked the door, and went into the restroom to take a bath.<br/><br/>After taking a bath, when she went downstairs, the meal was already prepared.<br/><br/>Charlotte ignored Edward’s greeting, went to the restaurant on her own, sat down, picked up her chopsticks and started eating.<br/><br/>Alice Eugene watched her behavior with a sullen expression.<br/><br/>Edward showed no anger, stood in the living room for a while, and then entered the restaurant and sat down.<br/><br/>The table was full of dishes Charlotte loved.<br/><br/>Edward poured her a bowl of soup and put it in front of her, “It’s been a long time since you’ve eaten, drink some soup first.”<br/><br/>Charlotte did not skimp on herself, put down her chopsticks and drank a bowl of soup first.<br/><br/>After finishing the soup, Edward filled her bowl again, then began peeling shrimp for her, “I had food prepared for you on the road, why didn’t you eat some? Did they mistreat you?”<br/><br/>“Is the food safe?” Charlotte replied without even lifting her eyes, “If someone poisons it, I would die halfway.”<br/><br/>“No one will poison it,” Edward said.<br/><br/>“Yes, but someone knows my allergies,” Charlotte sarcastically said with precision, “If I suffocate to death, who will I talk to about it?”<br/><br/>Alice Eugene stood not far away, her face showing a moment of panic as she heard Charlotte’s words.<br/><br/>Edward turned his head and looked at Alice Eugene.<br/><br/>Alice immediately lowered her head and said, “Henry Kirsten, I dare not.”<br/><br/>Charlotte’s chopsticks paused and she looked at Alice, “I’m curious, how are you not dead?”<br/><br/>Alice Eugene felt Edward’s gaze still on her, she didn’t dare to raise her head and didn’t dare to respond.<br/><br/>“Enigma Starry, what are you doing?” Alice Eugene blocked Edward Kirsten’s front.’,<br/><br/>Charlotte Lane glanced at them and then found a slingshot from somewhere upstairs.<br/><br/>She picked up a stone from the vase of green plants on the second floor, put it on the slingshot, pulled it back, and aimed.<br/><br/>Bang——<br/><br/>A large vase in the living room was shattered.<br/><br/>The people guarding the entry of the living room all looked over.<br/><br/>Everyone had a solemn expression as they thought about how miserably this person might die.<br/><br/>They had followed Edward Kirsten for so long, but they had never seen anyone dare to provoke him like this.<br/><br/>Charlotte Lane picked up another stone, pulled back the slingshot, and aimed for another big vase on the other side.<br/><br/>“Enigma Starry, don’t shoot anymore.” Edward Kirsten looked up at her, his voice slightly more serious.<br/><br/>Instead of stopping, Charlotte Lane just cast a glance at him and then released the slingshot.<br/><br/>Once again, there was a loud noise, and the vase shattered.<br/><br/>She had to pretend to follow him willingly, but if she was unhappy inside, she would make everyone else uncomfortable.<br/><br/>Edward Kirsten: “......”<br/><br/>Charlotte Lane looked at Edward Kirsten.<br/><br/>Edward Kirsten’s light blue eyes narrowed.<br/><br/>Under his gaze, Charlotte Lane grabbed the green plant next to her, and with a push, knocked it down, shattering the vase.<br/><br/>Shards and dirt fell from the second-floor railing.<br/><br/>A helpless look appeared in Edward Kirsten’s eyes.<br/><br/>Charlotte Lane didn’t look at him any longer and turned to return to her room.<br/><br/>As the chaos subsided, Alice Eugene glanced at the wreckage on the floor, took a breath, and looked at Edward Kirsten, “Mr. Kirsten, what about this...”<br/><br/>Edward Kirsten sighed softly, his voice revealing his indulgence, “Children, when they’re upset, they throw tantrums.”<br/><br/>Alice Eugene: “......”<br/><br/>A group of people outside the living room, watching the young girl ignore Edward Kirsten and return to her room without any issues suddenly questioned whether the Edward Kirsten they knew today was the same person as before.<br/><br/>“Her temper...” Alice Eugene said, “Why is it even worse than a few years ago?”<br/><br/>Edward Kirsten laughed, “She’s grown up, and her temper has grown with her. Just have someone clean up.”<br/><br/>“Yes.”<br/><br/>After Edward Kirsten left, Alice Eugene asked someone to clean up the mess.<br/><br/>Looking at the shards on the floor, she suddenly thought of a word: was this what they called indulgence leading to arrogance...\t\t\t\t\t\t</div>", "images": {}, "success": true}