{"id": 583, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998953.html", "title": "Chapter 580: 523: Recording", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 580: 523: Recording</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 580: Chapter 523: Recording<br/><br/>Imperial Capital, Maxwell Family<br/><br/>After failing to get in touch with Peter Qinke again, Julian Maxwell angrily threw his cell phone against the wall.<br/><br/>Concerned, Mrs. Maxwell asked, “Why can’t we get in touch with him?”<br/><br/>“Why can’t we get in touch with him?!” Julian Maxwell roared, “I’ve been used! He actually dared to use me!”<br/><br/>While saying this, Julian swept everything off the table onto the ground.<br/><br/>Mrs. Maxwell, frightened, covered her ears and took a few steps back, not daring to speak.<br/><br/>Fuming, Julian’s chest heaved and his face turned red. After a while, he said, “He said to let his people come in and kill Daisy Zane so that I wouldn’t have to get involved, that there would be no connection to me. All bullshit! He took the person away! He dared to use me!”<br/><br/>He smashed everything within reach.<br/><br/>Mrs. Maxwell covered her ears and listened to the thunderous crashes, one after another. Suddenly, she shouted, “There’s no use in losing your temper here. If you have the ability, bring him back, bring all of them back, and take revenge for your son and daughter!”<br/><br/>“Shut up! Except for talking, what can you do! Don’t even think about educating me!”<br/><br/>As Julian’s voice fell, a loud noise came from outside.<br/><br/>“Ah!” Mrs. Maxwell was frightened, hiding beside the wall covering her head.<br/><br/>Julian was startled, too. He paused for a moment before looking out the study window.<br/><br/>The villa’s main gate had fallen to the ground, leaving a gaping entrance.<br/><br/>A group of people in black combat suits burst in, surrounding the Maxwell villa.<br/><br/>As these intruders rushed in, they wreaked havoc.<br/><br/>All the stone benches by the road were toppled, and whatever could be destroyed was destroyed.<br/><br/>Villa staff tried to confront them, but the intruders showed no mercy, beating them without any restraint.<br/><br/>Upon seeing this, Julian quickly rushed to the ground floor.<br/><br/>By the time he got there, all the French windows in the living room had been smashed, glass shards were scattered everywhere.<br/><br/>“Who are you! What are you doing! Do you know where this is?!” Julian bellowed.<br/><br/>James Cooper glanced at him and sneered, “Mr. Maxwell, where exactly are you asking? Are you asking this place’s address or its latitude and longitude?”<br/><br/>Then Peter Qinke’s voice: “Of course, I have a personal grudge. Doesn’t Mr. Maxwell want her dead as well?”<br/><br/>The recording went silent for a while.<br/><br/>Afterward, Peter Qinke’s voice continued, “Mr. Maxwell. I took advantage of the time when she signed the files to get her fingerprint. I have already replaced the medicine Dean Yue eats for two days. As soon as the Dean dies, I can frame her. I have told Mr. Maxwell all this; this is my sincerity.”<br/><br/>“Why would you want to kill Dean Yue? Weren’t you raised by him?” Julian’s voice revealed his shock.<br/><br/>Peter Qinke chuckled and said, “Yes. Someone intentionally sent me to the Dean’s side. Killing him is my final task.”<br/><br/>Again, a long silence followed before Peter Qinke spoke up.<br/><br/>“Mr. Maxwell, what do you think? It’s best to make a decision soon. It’s just a matter of a few days.”<br/><br/>Julian hesitated for a while before saying, “Just a fingerprint is not enough to convict her.”<br/><br/>“Online public opinion. As long as we make the matter public, black and white, right and wrong will all become blurry,” Peter Qinke said. “And it’s during this confusion that she will be dealt with, disappearing forever. That way, all the issues will never be clear. Even in death, she will carry the weight of a crime.”<br/><br/>“Why did you come to me? And how can you be sure that I will help you, rather than expose you?” Julian questioned.<br/><br/>“I trust Mr. Maxwell.”<br/><br/>Julian laughed, “You should know that I won’t do these things. Although I can mobilize many people, they don’t belong to me personally. I won’t risk my whole life for this one thing.”<br/><br/>“Mr. Maxwell. You don’t need to do this yourself. I won’t allow you to get your hands dirty,” Peter Qinke said. “Imperial Capital is tightly guarded, but a gap has been left. It’s easy to get in but difficult to get out. Mr. Maxwell, you just need to cooperate when my people leave, and the rest will be taken care of by them.”<br/><br/>“Your people?” Julian questioned. “How can I trust that they can accomplish this?”<br/><br/>“319,” Peter Qinke replied calmly. “Mr. Maxwell, have you heard of the abilities of the people behind 319?”<br/><br/>“You’re one of them?”<br/><br/>Peter Qinke said, “That’s not accurate. I’m just working with them. Killing Dean Yue is our common goal. As we need to leave, we need Mr. Maxwell’s help. On the matter of Daisy Zane, consider it a favor we owe you.”<br/><br/>Julian remained silent.<br/><br/>After a while, Peter Qinke spoke, “Mr. Maxwell, regarding Dean Yue, I have already taken action. Regardless, it’s already underway, and it’s too late to turn back. Mr. Maxwell’s hands will remain clean from start to finish. So...what are you still hesitating about?”<br/><br/>Julian thought for a long time before finally saying, “I will only help you leave. I won’t get involved in the rest.”<br/><br/>“No problem.” Peter Qinke laughed. “Wait for my good news, Mr. Maxwell.”<br/><br/>...\t\t\t\t\t\t</div>", "images": {}, "success": true}