{"id": 581, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998947.html", "title": "Chapter 578: 521: Meeting Edward Kirsten", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 578: 521: Meeting Edward Kirsten</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 578: Chapter 521: Meeting Edward Kirsten<br/><br/>Early morning around four, William Lane returned home, and the lights in the house were still on.<br/><br/>As soon as he entered the living room, his grandfather, parents, and Aunt Cruz all looked at him.<br/><br/>With such a big commotion, the Clark family and Lane family were both involved. They couldn’t possibly not know about it.<br/><br/>When they saw William’s expression, they knew that the person hadn’t been found.<br/><br/>Sophie Ortiz’s tears were about to fall again.<br/><br/>Andrew Lane held her hand tightly.<br/><br/>“What happened?” Old Master Lane took a breath and said, “I heard that Charlotte was taken away by a police car, but then was hijacked by someone halfway? Didn’t Arthur North... stop them?”<br/><br/>They definitely wouldn’t talk about how Charlotte purposely let them take her away.<br/><br/>Externally...everyone thought that either Edward Kirsten’s people had hijacked the police car, or they were suddenly attacked and taken away by an unknown person.<br/><br/>William glanced at the living room where only the four of them were present, and the servants had either gone to rest or gone out. He sat down and said, “Charlotte wanted to leave on her own. Arthur... was drugged by her, and he hasn’t fully recovered yet.”<br/><br/>The Lanes were all taken aback.<br/><br/>Andrew asked, “What happened?”<br/><br/>William briefly explained the situation, but he wasn’t too clear about the specific details either.<br/><br/>“Since it’s her own decision...” Old Master Lane paused, suppressed his emotions, and spoke out the rest of his thoughts, “We should respect it.”<br/><br/>No one in the Lane family spoke, as reason and emotion were separate matters.<br/><br/>“If the situation started because of her, then it should also end with her.” Old Master Lane took a deep breath, “If any price was paid, she has to bear it, and so do we.”<br/><br/>Sophie couldn’t help but cry out.<br/><br/>William leaned back on the sofa, blinking his sore eyes.<br/><br/>He thought of the hairpin that Olivia showed off in that warehouse the day before yesterday.<br/><br/>Charlotte had planned it all along.<br/><br/>She might have even made the worst-case scenario plan.<br/><br/>That’s why she took Olivia to see the hairpins in the warehouse at this time.<br/><br/>“Everyone, go and rest.” Old Master Lane stood up and said, “Charlotte is taking risks alone. There’s a lot of work to be done here as well. Everyone be alert and don’t hold her back.”<br/><br/>William stood up too: “Yes, grandfather.”<br/><br/>“I’m going to rest as well.”<br/><br/>William accompanied the Old Master back to his room. But at the entrance, the Old Master didn’t let him in.<br/><br/>When the room door closed, the Old Master leaned against the door for a while before walking unsteadily toward the head of the bed.<br/><br/>He opened the drawer of the bedside table and took out an exquisitely carved wooden box.<br/><br/>He had carved it himself.<br/><br/>Inside was a longevity lock that he often held in his hand, with a new chain on it.<br/><br/>This was the longevity lock retrieved from the sea after Charlotte fell into the sea years ago.<br/><br/>Old Master Lane had been holding it in his hand all these years.<br/><br/>Charlotte was all too familiar with this gaze.<br/><br/>Seeing it again, she didn’t know if she felt more anger or fear.<br/><br/>Regardless of the feeling, she didn’t express any of it.<br/><br/>Seeing her looking at him, Edward’s smile deepened, “Enigma, long time no see.”<br/><br/>Charlotte’s eyes were bloodshot, and her face didn’t look great due to a lack of rest and food and the sudden appearance of Edward.<br/><br/>She stared at Edward for a moment and then delivered a slap to his face.<br/><br/>The crisp sound entered the ears of everyone present.<br/><br/>Edward’s head slanted from the slap, and he tasted blood in his mouth.<br/><br/>Everyone was stunned, then suddenly pulled out their guns, pointing at Charlotte.<br/><br/>Alice rushed forward as if wanting to return the favor with another slap.<br/><br/>But she was quickly stopped by Edward.<br/><br/>“Put them down.”<br/><br/>His gentle command was obeyed. Alice stood behind him, glaring at Charlotte ominously.<br/><br/>Edward looked at Charlotte, still gentle, “Is one slap enough? Does it put your anger to rest?”<br/><br/>Charlotte stared at him for a moment, then turned her head away, not looking at him anymore.<br/><br/>Edward smiled, “How about you hit me a few more times to ease your anger?”<br/><br/>“Get lost.”<br/><br/>Edward’s laughter grew louder, “Alright, let’s put these slaps on hold for now. Whenever you want to hit me again, you can. Let’s go wash up, eat something, and have a rest.”<br/><br/>Edward reached out to grab her hand as he spoke.<br/><br/>However, Charlotte immediately dodged his attempt.<br/><br/>Edward’s hand stiffened, and the smile on his face faded slightly as he looked at her.<br/><br/>Charlotte knew he was looking at her and met his gaze with a cold face, calmly saying, “Want to fight?”<br/><br/>Edward didn’t respond.<br/><br/>Charlotte continued, “I’ve been starving for over thirty hours; I don’t have the strength.”<br/><br/>Having said that, she walked away on her own towards the inside.<br/><br/>As she passed Alice, she deliberately kicked her leg and tripped her hard.<br/><br/>Alice struggled to keep her balance and almost fell over.<br/><br/>So much for not having any strength.<br/><br/>Regaining her balance, Alice turned and looked at Charlotte, “Enigma!”<br/><br/>Charlotte acted as if she didn’t hear and continued to leisurely stroll forward.<br/><br/>Edward watched her retreating figure, and after a while, he laughed.<br/><br/>Alice: “......”\t\t\t\t\t\t</div>", "images": {}, "success": true}