{"id": 589, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15007784.html", "title": "Chapter 586: 529: The Laboratory", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 586: 529: The Laboratory</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 586: Chapter 529: The Laboratory<br/><br/>Charlotte Lane stood in front of the washbasin, expressionless as she looked at the painting in her hand.<br/><br/>After a while, she used the lighter belonging to the restroom air freshener to set the painting on fire.<br/><br/>The flames illuminated her cold, white skin.<br/><br/>She watched the fire consume the painting...<br/><br/>Her reputation at the Research Institute was so great, having even suppressed 319. Edward Kirsten must have already wanted her to enter his laboratory.<br/><br/>He was just hesitating or perhaps planning to bring it up after some time.<br/><br/>After all, she was different from before, and Edward Kirsten was somewhat wary of her.<br/><br/>Originally, she could have waited as well.<br/><br/>But she didn’t want to wait now.<br/><br/>There were still so many people in the Imperial Capital waiting for her return; she couldn’t risk her life here.<br/><br/>At the very least, she couldn’t risk it without even touching the laboratory.<br/><br/><br/><br/>So she took a gamble.<br/><br/>Although Edward Kirsten probably still saw through her, he simply didn’t have the heart to listen to her cry, so he moved the laboratory out. Regardless, it didn’t matter as long as this was the result in the end.<br/><br/>He was confident that he could keep her here.<br/><br/>Similarly, she was also confident that she could leave this place.<br/><br/>It was a mere competition, and there would be a winner and a loser.<br/><br/>The painting had been burnt to a pile of black ashes, which fell into the washbasin.<br/><br/>Charlotte Lane turned on the tap, washing away all the ashes.<br/><br/>She washed her hands, then took the ointment from the medicine box and applied it bit by bit onto her neck.<br/><br/>...<br/><br/>As he said he would, Edward Kirsten took Charlotte Lane to the laboratory the next day.<br/><br/>Moreover, he openly let Charlotte Lane see the route from their living quarters to the laboratory.<br/><br/>When they stopped the car, Charlotte Lane got out and found they were at the foot of a barren mountain.<br/><br/>She looked at the mountain, her face speechless.<br/><br/>Edward Kirsten looked at her expression, raised the corners of his mouth, and laughed softly, “What’s the matter? Do you think I’m lying to you?”<br/><br/>“Mr. Kirsten certainly knows himself well.”<br/><br/>Edward Kirsten chuckled, “It’s inside.”<br/><br/>Charlotte Lane tilted her head to look at him.<br/><br/>Edward Kirsten also looked at her, then walked forward.<br/><br/>Charlotte Lane followed him.<br/><br/><br/><br/>Ahead was a winding mountain path covered with weeds, so much so that the path was hardly visible.<br/><br/><br/><br/>“What is this floor for?” Charlotte asked while looking around and trying to figure out the purpose of this floor from the equipment laid out.<br/><br/>“Reports brought back from outside.” Edward replied calmly.<br/><br/>Charlotte lowered her gaze to conceal the emotions in her eyes. These were reports summarizing the human experiments conducted outside.<br/><br/>Edward continued his introduction, “Underground Level 5 is the data archive, where all data and materials are stored. Level 6 is the living quarters for them.”<br/><br/>“What about Underground Level 2?” Charlotte inquired.<br/><br/>Edward gently smiled, “It’s better for Little Enigma not to know.”<br/><br/>Charlotte clenched her fingers, walking beside him, and after a moment, she asked, “Don’t you think they’re innocent?”<br/><br/>“How could they be innocent when they contributed their lives?” Edward countered, “Enigma, do you really want to discuss this with me? You should know that when we have different opinions, we only end up arguing.”<br/><br/>Charlotte pinched the tip of her index finger with her nails and stopped talking.<br/><br/>She followed Edward to the Laboratory again.<br/><br/><br/><br/>Some of the experimental equipment was new and high-tech, while others looked ancient. If not for having seen “retired” devices like these in Dean Yue’s office, Charlotte wouldn’t have even recognized what they were.<br/><br/>Not only the experimental floors, but the entire underground laboratory seemed to have existed for a long time.<br/><br/>It indeed appeared to be the Kingsley Family’s laboratory.<br/><br/>...<br/><br/>Charlotte spent a week in the laboratory. For the first five days, she observed Edward’s experiments and learned about their purpose. In the last two days, she told him about her method of suppressing 319.<br/><br/>Edward looked at her, regretting not teaching her and involving her in experiments back then. If he had, the progress of many experiments might have been much faster.<br/><br/>“How can you be so intelligent?” Edward asked.<br/><br/>Charlotte, dressed in her radiation-protective clothes and observing his experiment, replied without looking at him, “You’re just realizing that now?”<br/><br/>Edward smiled, “I knew it a long time ago. It’s just that you’re getting more and more intelligent.”<br/><br/>Charlotte nonchalantly praised, “You have a good eye.”<br/><br/>Edward’s mood improved somewhat, “Don’t you want to go see the materials in the data archive?”<br/><br/>Charlotte glanced at him.<br/><br/>“You can go.” Edward took off his radiation suit and handed her a key from his trouser pocket, “Can you go by yourself?”<br/><br/>Charlotte took the key without hesitation and turned to leave.<br/><br/>But she returned quickly.<br/><br/>There were too many materials.<br/><br/>There was no computer here, all experimental data were handwritten and organized.<br/><br/>Although the materials in the archive were clearly categorized, Charlotte couldn’t find what she wanted after looking around and came back.<br/><br/>“Why did you come back?”<br/><br/>“I want to see the data on Drunken Life Grass.” Charlotte answered directly.<br/><br/>Hearing these three words, the smile in Edward’s eyes gradually faded...\t\t\t\t\t\t</div>", "images": {}, "success": true}