{"id": 584, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15001926.html", "title": "Chapter 581: 524: Just Want Her To Be Safe", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 581: 524: Just Want Her To Be Safe</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 581: Chapter 524: Just Want Her to Be Safe<br/><br/>The recording ended, and Julian Maxwell couldn’t say a single word.<br/><br/>He thought he had handled everything well, even if the person who gave the order was taken away, it wouldn’t expose him.<br/><br/>But... there was actually a recording.<br/><br/>There was no personal grudge between Peter Qinke and Daisy Zane.<br/><br/>He just wanted to use him to get Daisy Zane out.<br/><br/>He couldn’t even utilize online public opinion; he couldn’t send anything out, as if it was being detected.<br/><br/>“Julian Maxwell, do you think... is this enough to justify confiscating your property?” Kevin Clark said.<br/><br/>The noise from the upper floor grew louder, as if something was being dismantled.<br/><br/>After a while, someone brought down a stack of documents and handed it to Kevin Clark.<br/><br/>Kevin Clark flipped through them casually: “How did someone like you survive till now?”<br/><br/>Julian Maxwell looked at the things in his hand, regaining some composure: “Kevin Clark, even if I’m guilty, with my status, it should be dealt with through proper procedures. What can you do to me? What can you do to me?”<br/><br/><br/><br/>Kevin Clark handed the documents to James Cooper, walked up two steps, grabbed Julian Maxwell’s neck, dragged him forward two steps, and then threw him onto the ground.<br/><br/>With a muffled thud, Julian Maxwell’s head hit the ground, and blood started to flow. His eyes rolled back in his head, and he could not speak a word.<br/><br/>Mrs. Maxwell sat on the ground, screaming and yelling.<br/><br/>James Cooper was a man who had seen it all, but even he shuddered at Kevin Clark’s ruthless act.<br/><br/>“If I wanted to do something to you, who would dare stop me?” Kevin Clark said coldly, “Going through procedures? You want your lord up there to save you? Let me tell you, he’s going to accompany you today. You wanted to drag my big brother down? What do you think you are?”<br/><br/>Kevin Clark let go, and Julian Maxwell lay still on the ground, as if dead.<br/><br/>“Let him watch this place be dismantled bit by bit.” Kevin Clark wiped his fingers and said, “Then carry him away.”<br/><br/>“Yes.”<br/><br/>Kevin Clark didn’t linger, and left directly.<br/><br/>The sky was gloomy, and the fallen leaves were scattered on the ground.<br/><br/>The cell phone in Kevin Clark’s pocket rang twice, and he took it out to check. A message had come in on the cell phone Charlotte Lane left behind.<br/><br/>Joseph Allen sent two pictures.<br/><br/>Both pictures were of black men’s dress shirts, but with more traditional Chinese elements and a more antique look.<br/><br/>Soon, Joseph Allen sent two more messages.<br/><br/><br/><br/>But... with the Maxwell Family gone, everyone would know soon.<br/><br/>“What?” Kevin asked softly.<br/><br/>“Peter Qinke is an illegitimate child from M Continent Laboratory,” Finn said. “Those in the M Continent value family inheritance. In theory, Peter has the right to inherit.”<br/><br/>“Since I can remember, Peter has been by Dean Yue’s side,” said Kevin.<br/><br/>“When Peter was eight or nine years old, Dean Yue found him in M Continent. I’m not sure about the details, but later Dean Yue has been taking care of him,” said Finn. “Once, Dean Yue was attacked in M Continent, and Peter leaked his itinerary. Later, he even pushed the blame onto others.”<br/><br/>“He killed Dean Yue and disrupted the Research Institute. As the thorn in the side of M Continent Laboratory, Peter’s actions can be considered meritorious,” Kevin said.<br/><br/>“That’s right. As an illegitimate child, doing this will increase his chances of inheritance,” Finn said. “No matter how well he does at the Research Institute, and how well Dean Yue treats him, the institute will never end up in his hands.”<br/><br/>“In one fell swoop, he’s destroyed the Research Institute and earned merit for himself,” Kevin said.<br/><br/>He had heard the recording, and so had the little girl.<br/><br/><br/><br/>What had she thought when she left?<br/><br/>Self-blame? Guilt?<br/><br/>Did she attribute Dean Yue’s death solely to herself?<br/><br/>Since Edward Kirsten was involved, she might feel responsible for Edward hurting Dean Yue.<br/><br/>He was not sure why Edward Kirsten wanted to kill Dean Yue, but even without him, and only with Peter, he would still kill Dean Yue, frame the new Dean, and turn the Research Institute into muddy waters.<br/><br/>Kevin suddenly furrowed his eyebrows.<br/><br/>“What’s wrong?” asked Finn.<br/><br/>Charles Amos looked up at Kevin, seeing that his lips had suddenly paled.<br/><br/>Kevin shook his head lightly and, after a moment of silence, said, “I still haven’t found their whereabouts.”<br/><br/>“If you find them now, what do you plan to do?” Finn said. “Lucia took a risk for nothing. Do you just want to bring her back? Lucia’s goal is Edward Kirsten’s laboratory, right? Now, she might not even know where the laboratory is, and you want to bring her back? Everything would have been in vain. What were these past few days for?”<br/><br/>Kevin closed his eyes and lowered his head.<br/><br/>Charles Amos grabbed Kevin’s clothes.<br/><br/>Finn’s gaze fell on Charles, who stood up and left the living room.<br/><br/><br/><br/>Now with just the two brothers, Kevin finally spoke softly after a while, “Brother. I’ve been with Uncle Lane since I was young, and my education has always been about putting the greater good first. I’ve always felt like I haven’t done well, but I guess I haven’t let Uncle Lane down too much. However, I’ve just realized how selfish I am.”<br/><br/>Finn looked at Kevin’s lowered head and bent back, feeling a bitter taste in his heart.<br/><br/>“I don’t want to care about anything else anymore. I just want her to be safe,” Kevin’s voice grew heavier. “But... I’m so powerless. I can’t protect her, and I can’t find her.”<br/><br/>...\t\t\t\t\t\t</div>", "images": {}, "success": true}