{"id": 588, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15007779.html", "title": "Chapter 585: 528: Taking You To The Laboratory", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 585: 528: Taking You To The Laboratory</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 585: Chapter 528: Taking You to the Laboratory<br/><br/>Edward Kirsten looked at Charlotte Lane’s retreating figure, standing alone in the cold wind.<br/><br/>For a moment, his fingers touched his side.<br/><br/>The tears on his fingertips had long dried, but he still felt a post-warmth there.<br/><br/>He sighed softly, touched the slapped face, and murmured, “Edward Kirsten, how can you bear it?”<br/><br/>When Charlotte returned, she entered the living room and bumped into Alice Eugene.<br/><br/>Alice immediately noticed the red mark on her neck, clearly made by a hand grip.<br/><br/>Charlotte ignored her and walked inside. But Alice raised her hand to stop her.<br/><br/>Alice laughed and said, “Oh, what happened here?”<br/><br/>Charlotte raised her eyes to look at her.<br/><br/>Alice saw her reddened eyes, clearly from crying, and her heart was filled with pleasure, “Henry Kirsten has ordered everyone here not to disrespect you. You...surely didn’t do this to yourself, did you?”<br/><br/>Charlotte’s throat hurt, and she didn’t want to talk, just stared at Alice.<br/><br/><br/><br/>“Enigma Starry, let me give you a piece of advice.” Alice’s voice slowly turned cold, “You’d better stay here obediently and not act so high and mighty, no one will tolerate you forever.”<br/><br/>Charlotte waited for her to finish talking, and quickly grabbed Alice’s neck – so fast that Alice didn’t have time to react.<br/><br/>As soon as Charlotte grabbed her neck, she held her up and walked into the living room.<br/><br/>Alice’s attempt to resist was blocked by her hand.<br/><br/>She quickly dragged Alice into the living room and forcefully knocked her head on the tea table.<br/><br/>Blood stained the tea table in an instant.<br/><br/>Alice’s attempt to fight back immediately weakened, her eyes blurred, and she couldn’t see things clearly or speak.<br/><br/>Charlotte looked at her, slowly spat out two words: “Trash.”<br/><br/>With that, she let go of Alice and went upstairs.<br/><br/>When she got upstairs, she locked the door and went to the restroom to wash her hands.<br/><br/>Then she stood in front of the mirror and looked at the handprint on her neck.<br/><br/>All her emotions had disappeared, leaving only endless coldness. She looked at it for a while, then reached up and touched the red mark on her neck.<br/><br/>She then opened the drawer under the washbasin and looked at the medicine box inside.<br/><br/>It was filled with various ointments for external injuries.<br/><br/>Back when she was in Continent A and danced, she would often get bruises, so Edward Kirsten always kept a lot of medicine in her room.<br/><br/>She closed the drawer without taking any medicine and instead pressed her fingers harder into each red mark, making them deeper.<br/><br/>Downstairs, Alice was helped out just as Edward Kirsten returned with a trench coat.<br/><br/>“What happened?” Edward Kirsten looked at the blood on the back of her neck, staining her clothes red.<br/><br/>Alice’s vision blurred: “It’s nothing. Just accidentally bumped into something.”<br/><br/><br/><br/>Edward Kirsten stared at her without saying a word.<br/><br/><br/><br/>He had always thought that Enigma had become very different from before. Cold, distant, wary, and even her every step seemed calculated.<br/><br/>But her crying now made him suddenly realize that no matter how much she changed, she was still the same little Miss.<br/><br/>No matter how she disguised herself on the outside, it was still the same girl who would cry because he was too fierce.<br/><br/>Edward’s thoughts were suddenly jumbled by her crying.<br/><br/>After a while, he finally reacted, moved forward, and wanted to put his hand on her back to comfort her. But before he could touch her, he heard her say, “Don’t touch me!”<br/><br/>Edward’s hand was stiff in the air, and after a moment, he withdrew it reluctantly. “Alright, Enigma. Don’t cry. It’s my fault.”<br/><br/>Charlotte still ignored him.<br/><br/>Edward listened to her cries for a while and then pulled the quilt over her.<br/><br/>Charlotte pulled the quilt back and moved away from him, snatching the quilt out of his hand.<br/><br/>Edward looked at his empty hand. “Enigma, what’s done is done. My apology can’t change anything. What can I do to make you stop being angry?”<br/><br/><br/><br/>“You go away,” Charlotte said.<br/><br/>Edward pressed his lips together. “If you behave, I’ll take you to the Laboratory tomorrow.”<br/><br/>“Get out!”<br/><br/>Edward: “......”<br/><br/>“Don’t make helping you with experiments sound like I’m begging.”<br/><br/>Edward looked at the top of her head and smoothed her messy hair. “Aren’t you curious about 319?”<br/><br/>Charlotte buried her head and didn’t make a sound.<br/><br/>“You’re curious, and I need you for the experiment. We both need each other,” Edward said softly.<br/><br/>Charlotte Lane was silent for a while, and then she said, “What about you hurting me?”<br/><br/>Because of her words, Edward raised his eyebrows in a good mood. “You can look at all the materials and data in the laboratory.”<br/><br/>“You leave.”<br/><br/>Edward’s eyebrows furrowed.<br/><br/>“I want to change my clothes. I’m hungry.”<br/><br/>Edward’s frown relaxed, and he raised the corners of his mouth, getting up to leave.<br/><br/>After hearing the sound of the door closing, Charlotte put her legs down and wiped the tears from her face. She stared at the quilt for a while.<br/><br/>Then she got out of bed and went to the restroom.<br/><br/>She glanced at herself in the mirror, her eyes were red, and the tears had not fully dried.<br/><br/>She looked away in disgust after a brief glance and opened the drawer under the washbasin.<br/><br/>There was a new drawing under the medicine box.<br/><br/>She had drawn it yesterday.<br/><br/>It was a simple figure on the page, crying piteously against the sunlight, head down and bent over.<br/><br/>But behind this person, the extended shadow smiled with a hint of terror.\t\t\t\t\t\t</div>", "images": {}, "success": true}