{"id": 580, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/14998944.html", "title": "Chapter 577: 520: We Must Trust Her", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 577: 520: We Must Trust Her</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 577: Chapter 520: We Must Trust Her<br/><br/>At 2 AM, the Rose Garden was brilliantly lit, with all doors and windows wide open for ventilation.<br/><br/>In the living room were Hugo Clark, William Lane, Allonzo Hobson, plus others from the Dark Radiance whom Robinson Scott had summoned from the Imperial Capital.<br/><br/>All of them wore troubled expressions.<br/><br/>Kevin Clark was sitting on the sofa, looking distraught, his eyes bloodshot, and his eyelids moist. Due to the lingering effect of the drugs, his fingertips were still trembling slightly.<br/><br/>Thomas Firway and the others who had later entered the living room were still not fully awake.<br/><br/>William Lane was exceptionally silent. His face was ashen, and even without speaking a word, those around him could sense the smoldering anger within him.<br/><br/>Allonzo Hobson and Hugo Clark quietly observed William Lane, fearing that he would lose control and injure Kevin Clark, who currently had mobility.<br/><br/>But William Lane hadn’t uttered a word of blame or interrogation since he came in.<br/><br/>He had intended to speak, even had the desire to throw punches.<br/><br/>But after seeing Kevin Clark’s state, he didn’t even utter a single syllable.<br/><br/>This was the first time he saw Kevin Clark in such a state. It could accurately be described as “shameful”.<br/><br/>It wasn’t superficial shame but a deep-seated shame, one rooted in self-blame.<br/><br/>They grew up together, and he had only seen the proud Third Master Arthur North and the strategic Third Master Arthur North.<br/><br/>But tonight, all of these images were shattered.<br/><br/>After a long silence, Kevin Clark, with his eyes downturned, croaked, “Control the information online. Don’t let a single piece of information about this incident leak out.”<br/><br/>“Okay,” Allonzo Hobson complied, “I will contact the media, and all platforms. The Celestial Pivot has likely already controlled the information on the network. As of now, no news has appeared.”<br/><br/>Kevin Clark softly acknowledged and then asked, “What’s the situation outside the Imperial Capital?”<br/><br/>Hugo Clark and Allonzo Hobson did not go to the scene, and what they knew was very limited. They turned to look at William Lane.<br/><br/>But it was clear William Lane didn’t want to speak.<br/><br/>Hence, the two directed their gaze at Yoshua Archer.<br/><br/>Meeting their gaze, Yoshua Archer gave a rundown of the situation at the city’s border. “The southeast area was suddenly attacked. Those guarding it retaliated. But... when Dark Radiance’s people joined the fight, they ended up attacking them too. Even the Clark family and Lane family were thrown into disarray because of this, so... right from the start, a gap was left open for escape.”<br/><br/>“Why did they attack together?” Allonzo Hobson asked.<br/><br/>Hugo Clark explained, “All the guards are just following orders. My father has just investigated this, they said that they received orders to treat everyone unidentified as the enemy. They mistook the people who suddenly attacked as allies, so they attacked together.”<br/><br/>“Who issued the order?”<br/><br/>Kevin Clark paused, raising his eyes to look at him.<br/><br/>Allonzo Hobson and the others also turned to look at him.<br/><br/>“Stop looking.” William Lane tried to control his emotions, his voice slightly hoarse, “This is Lila’s own choice. We shouldn’t interfere with her actions.”<br/><br/>Kevin Clark lowered his gaze to the map, “Let go.”<br/><br/>William Lane didn’t move. He took a soft breath. Even though he couldn’t bear it, he still respected his sister’s decision and even wanted to help her achieve it, “We have to have faith in her.”<br/><br/>“How to trust?” Kevin Clark looked at him again, “If Edward Kirsten truly can’t bear to harm her, what about the people at the M Continent Laboratory? Eliminate these factors. What if Edward Kirsten is driven to a corner and decides to die with her?”<br/><br/>William Lane was suddenly silent.<br/><br/>Kevin Clark forcefully pulled the map out of William Lane’s grasp.<br/><br/>“Kevin. Lila must have thought this through before taking this step,” the trembling in William Lane’s voice revealed his struggle. It was unclear whether he was saying it for Kevin Clark’s benefit or to convince himself, “She knows you’re waiting for her, she’ll return.”<br/><br/>Kevin Clark ignored him and continued to mark locations.<br/><br/>After finishing with the domestic map, he started on a few more continents.<br/><br/>William Lane fell silent again, watching as Kevin Clark stubbornly marked the possible locations they might have passed through.<br/><br/>When all the locations were marked, Kevin Clark put the pen down and turned to Yoshua Archer, “Add more manpower to these locations. If the people from the Hundred Demons Pavilion and the Darknight Alliance interfere, hold back but fight relentlessly, show no mercy.”<br/><br/>“Yes,” Yoshua Archer took the map and left.<br/><br/>Kevin Clark then turned to Allonzo Hobson, “Keep an eye on Robinson Scott.”<br/><br/>“Ok,” After Allonzo Hobson agreed, he immediately left to find Robinson Scott.<br/><br/>He certainly didn’t want his wife to get hurt.<br/><br/>Soon after, William Lane also left.<br/><br/>Only Hugo Clark remained in Rose Garden with Kevin Clark.<br/><br/>“Third Uncle, do you want to take a rest?”<br/><br/>Kevin Clark shook his head, “I’ll wait here for news.”<br/><br/>Afterwards, he studied the terrain of Continent A and D. If they couldn’t find them, he had to be prepared to find Edward Kirsten himself.<br/><br/>Seeing this, Hugo Clark poured him a glass of water and sat next to him without disturbing him.<br/><br/>...\t\t\t\t\t\t</div>", "images": {}, "success": true}