{"id": 587, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15007774.html", "title": "Chapter 584 - 527: What’S There To Be Happy About?", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 584 - 527: What’S There To Be Happy About?</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 584: Chapter 527: What’s There To Be Happy About?<br/><br/>Since Edward Kirsten’s people had passed through the West Hillside, Kevin Clark’s initial route must have been correct.<br/><br/>So, Kevin Clark searched for their final resting place along that route once again.<br/><br/>As for Charlotte Lane...<br/><br/>She had been in this new place for five days and was not too sure about her exact location.<br/><br/>No one would tell her, and she didn’t bother to find out.<br/><br/>Since she promised Edward Kirsten not to lose her temper anymore, she spent these five days eating, sleeping, and wandering around the courtyard.<br/><br/>Edward Kirsten had left that night.<br/><br/>Based on her guess, his laboratory shouldn’t be too far from where they were living now.<br/><br/>Another day, in the afternoon, Charlotte Lane was swaying slowly on the swing. Just as she was about to fall asleep on the swing, she heard Edward Kirsten’s footsteps behind her.<br/><br/>She immediately woke up and looked back.<br/><br/>Edward Kirsten was holding a trench coat in his hand. Seeing her looking over, he stopped a few meters away, a little surprised by her alertness.<br/><br/>Charlotte Lane only looked at him for a moment before turning her gaze away, not saying a word to him.<br/><br/>Edward Kirsten then stepped behind her and gently draped the trench coat over her: “Aren’t you cold?”<br/><br/>Charlotte Lane clenched her fingers without any expression and remained silent.<br/><br/>Edward Kirsten sat down on a stone bench beside her, watching the silent Charlotte Lane. After a while, he asked: “Aunt Dawson said you haven’t eaten much these past few days. What’s wrong? Is the food not to your taste, or are you feeling unwell?”<br/><br/>Charlotte Lane still said nothing.<br/><br/>“Enigma.”<br/><br/>Charlotte Lane ignored him.<br/><br/>Edward Kirsten sighed softly in his heart: “I’ve sent all those girls back safely.”<br/><br/>Charlotte Lane finally made a sound, but only a soft hum.<br/><br/>The two were silent for a while.<br/><br/>The climate here was similar to that in their home country. The leaves that had been swept away in the morning were blown away by the wind, and a few more fell down.<br/><br/>“Because you’re really disobedient, running everywhere, opposing me, and upsetting me,” Edward said as he suddenly tightened his grip on her throats.<br/><br/>Charlotte involuntarily tilted her head back, her neck forming a beautiful curve under Edward’s hand.<br/><br/>She couldn’t breathe in an instant, and the suffocating feeling made her body tremble slightly, her eyes filled with tears.<br/><br/>But her hands only tightened around the swing ropes, not resisting.<br/><br/>Edward’s grip didn’t loosen, as he leaned in closer, whispering in her ear, “Little Enigma, are you betting that I won’t bear to kill you?”<br/><br/>Charlotte looked up, tears streaming down her face.<br/><br/>Edward used his other hand to wipe away her tears and softly said, “Right now... big brother really can’t bear to see you dead. Although a corpse is obedient, I still like Little Enigma when she smiles, talks, dances, paints, and plays the pipa.”<br/><br/>Charlotte’s vision blurred, and she closed her eyes, her hands falling from the swing ropes.<br/><br/>“Remember this feeling. If you tell me you want to die again, I’ll make those you care about suffer even more than this,” Edward said. “So don’t try to be clever with your big brother. It’ll be easier for everyone, and they’ll be safe.”<br/><br/>With that, he let go of Charlotte.<br/><br/>Charlotte lowered her head and touched her throat, coughing violently.<br/><br/>Edward gently patted her back and soothingly stroked her head a couple of times.<br/><br/>After a while, Charlotte had somewhat recovered. She wiped her tear-stained face with the sleeve of her trenchcoat.<br/><br/>Then she looked up with a glare at Edward.<br/><br/>Edward looked at her fierce, cold expression and smiled, “Why cry? Feeling wronged? You’re so strong, why don’t you fight me?”<br/><br/>Charlotte didn’t say anything.<br/><br/>“Enigma... you don’t have to pretend to be dependent on me and unable to fight me,” Edward said. “No matter how you planned it in the Imperial Capital and whether you can clear your name for killing Ezekiel Santiago, I won’t give you any chance to go back.”<br/><br/>Edward Kirsten looked into her eyes: “I raised you for so long, I can guess your thoughts in an instant, so don’t pretend in front of me.”<br/><br/>As soon as he finished speaking, Charlotte slapped him hard across the face.<br/><br/>This slap was much heavier than the last one, and blood quickly seeped from the corner of Edward’s mouth.<br/><br/>He wiped the blood from his mouth with his finger and touched the spot where he had been slapped.<br/><br/>Then Charlotte pushed him with a stagger.<br/><br/>Charlotte stood up from the swing, her eyes red and her neck turning redder from the choke marks.<br/><br/>She took off her trenchcoat and threw it on the ground, then turned and walked towards the villa...\t\t\t\t\t\t</div>", "images": {}, "success": true}