{"id": 596, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15021012.html", "title": "Chapter 593: 536: Lock It Up", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 593: 536: Lock It Up</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 593: Chapter 536: Lock It Up<br/><br/>Kevin Clark’s suppressed emotions suddenly erupted like a collapsing mountain and a falling sea.<br/><br/>His terrifying aura filled the spacious bedchamber.<br/><br/>Charlotte Lane felt the oppressive atmosphere slowly creeping into her body through her pores.<br/><br/>She hadn’t seen Kevin Clark like this in a long time.<br/><br/>Though not as ruthless as when he had trained her in the past, it was still horrifying enough.<br/><br/>She looked at Kevin Clark, blinking her eyes.<br/><br/>“What are you thinking?” Kevin Clark asked her, “Using drugs on me again and running away once more?”<br/><br/>Keeping her composure, Charlotte stepped back twice and examined the structure of the bedchamber. Then she nodded and replied to his previous question, “The room is nice.”<br/><br/>“As long as Madam likes it.” Kevin Clark said softly.<br/><br/>“Mhm. Decorate other places in this style.” Charlotte said with an inspection-like tone, “I have no other suggestions. Let’s go to the Research Institute.”<br/><br/>As she spoke, she hurriedly walked past him towards the exit.<br/><br/><br/><br/>But just as she reached the door, before the lock was opened, a gust of wind blew from behind, and Kevin Clark grabbed her hand, making her turn around.<br/><br/>He then bent down, hoisting her over his shoulder, and headed back into the bedchamber.<br/><br/>When he held her hand, her instinct was to counterattack, but in the end, she didn’t move.<br/><br/>After all, she was the one who had deceived him first.<br/><br/>Upon entering the bedchamber, Kevin Clark roughly threw her onto the bed.<br/><br/>The soft bed wouldn’t hurt her.<br/><br/>Charlotte sank into the bed and bounced back up.<br/><br/>She frowned, suppressing her nauseous feeling. Just as she propped herself up to sit, Kevin Clark’s leg knelt between her thighs, leaned forward, and pressed her shoulders down onto the bed.<br/><br/>“Kevin Clark.”<br/><br/>“Why aren’t you calling me Brother Kevin anymore?” Kevin Clark’s eyes turned red and his gaze filled with lingering resentment, “You were fine calling me that the other day.”<br/><br/>“That can’t always happen.” Charlotte said softly.<br/><br/>Kevin Clark didn’t respond.<br/><br/>Charlotte tried to move unsuccessfully, “I have to do an experiment.”<br/><br/>“Didn’t you say I could lock you up or do whatever I want once we got back?” Kevin Clark’s narrow eyes fixed on her, “What now? Are you going back on your word?”<br/><br/>Charlotte remained calm, so her words sounded extremely convincing, “Did I say that? Maybe it was a side effect of the drug, causing hallucinations?”<br/><br/>Kevin Clark narrowed his eyes and chuckled softly, “Fine.”<br/><br/>As soon as the word left his mouth, he lowered himself completely onto her body.<br/><br/>Charlotte involuntarily clenched the bedsheets.<br/><br/>Kevin Clark’s slender fingers grazed her face before gripping her cheeks, forcing her mouth open and kissing her deeply.<br/><br/><br/><br/>Seeing that she remained quiet, after a while, Kevin Clark kissed her again.<br/><br/>Charlotte Lane offered no resistance, and Kevin Clark advanced little by little, then punished her with a vengeance.<br/><br/>They kept kissing and held each other tightly.<br/><br/>It was as if they wanted to melt into each other’s bodies, intertwining their souls.<br/><br/>...<br/><br/>Whether to keep her locked up or not was never discussed again.<br/><br/>They had no time to discuss it either.<br/><br/>Charlotte Lane had been asleep since the afternoon. Past 10 PM, Kevin Clark woke her up to eat something. Then, Charlotte Lane took a bath. While waiting for Kevin Clark to blow dry her hair, she fell asleep again.<br/><br/>Kevin Clark had worn her out during the day, so she was tired. He didn’t think much of it.<br/><br/>He carried her back to the bed and tucked her in the blanket.<br/><br/>He handled some affairs, then lay down on the bed too, gently hugged her in his arms, kissed her, and stared at her.<br/><br/>With her sleeping by his side, he felt like he could lose her at any moment.<br/><br/><br/><br/>He couldn’t bear to lock her up.<br/><br/>But without doing so... he didn’t know how to make her face the severity of the problem.<br/><br/>He kept staring at her, about to reach out and touch her face.<br/><br/>Charlotte Lane raised her hand, slapping it on his face, her voice hoarse, “Sleep, stop staring.”<br/><br/>Kevin Clark chuckled, clasped her hand, and kissed the fingertips, “You could still tell I was staring at you when you’re asleep.”<br/><br/>“Your gaze is unsettling.” Charlotte Lane nuzzled against his shoulder, “Feels like you’re going to press me down on the bed and continue doing it in the next second.”<br/><br/>“Am I that much of a beast?” Kevin Clark pinched her ear.<br/><br/>“Think about what we did all day today, and you’ll discover you’re even worse than a beast.” Charlotte Lane spoke groggily, “If the things in the room could become human, they’d definitely chase you down to scold you.”<br/><br/>Kevin Clark smiled and kissed her again.<br/><br/>Charlotte Lane rested her hand on his waist, her voice barely audible and drowsy, “Brother Arthur, let’s sleep.”<br/><br/>“Alright.”<br/><br/>...<br/><br/>The next day, early morning, Kevin Clark got up.<br/><br/>Charlotte Lane turned over, her wrist resting on the edge of the bed as she continued to sleep.<br/><br/>Kevin Clark tried waking her up, but Charlotte Lane buried her head into the blanket. Her hand at the edge of the bed balled up as she mumbled, “My waist is sore. Don’t want to get up.”<br/><br/>“Eat something then sleep some more.” Kevin Clark sat on the edge of the bed, kissed her, and massaged her waist.<br/><br/>Charlotte Lane was silent for a while and said, “Let’s eat upstairs. I don’t want to move.”<br/><br/>“Alright.”\t\t\t\t\t\t</div>", "images": {}, "success": true}