{"id": 597, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15021013.html", "title": "Chapter 594: 537: Don’T Worry!", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 594: 537: Don’T Worry!</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 594: Chapter 537: Don’t Worry!<br/><br/>Kevin Clark massaged Charlotte Lane’s waist, and she fell asleep again.<br/><br/>After she fell asleep, he massaged her for a little while longer, then went downstairs to get breakfast.<br/><br/>He brought it back, placed it on the bedside table, and gently rubbed Charlotte’s face, “Why are you so sleepy? Eat something first.”<br/><br/>Charlotte lifted her hand, clutched Kevin’s shoulder, and used it as leverage to sit up, “I want to go to the Research Institute.”<br/><br/>Kevin looked at her without speaking.<br/><br/>Seeing that he didn’t agree, Charlotte released the grip on his shoulder, and laid back down on the bed, closing her eyes.<br/><br/>“Slow down.” Kevin rubbed the top of her head which had almost hit something.<br/><br/>“You didn’t say that when you threw me on the bed yesterday.” Charlotte said with her eyes closed.<br/><br/>“Holding a grudge?” Kevin laughed.<br/><br/>“I hold a huge grudge,” Charlotte said, “You better be prepared for some revenge.”<br/><br/>Kevin laughed out loud, supported her neck, and held her up again, “Let’s talk about revenge later, eat first.”<br/><br/><br/><br/>Charlotte pulled back her clothes a bit, drank a glass of water, then picked up a bowl, took a spoon, and ate a mouthful of porridge.<br/><br/>She was fine with the first mouthful, but Kevin noticed that she suddenly slowed down when eating the second one.<br/><br/>“Don’t you like it?” Kevin asked.<br/><br/>Charlotte didn’t respond, put down the bowl, pushed Kevin away, got out of bed, put on her shoes, and walked to the restroom.<br/><br/>Kevin hesitated for a moment and followed her.<br/><br/>Charlotte calmly arrived at the restroom, lifted the toilet lid, and vomited.<br/><br/>“What happened?” Kevin’s face suddenly turned bad. He went behind her, used the hair tie on his wrist to tie up her hair and gently patted her back.<br/><br/>Charlotte had only taken one mouthful of the porridge and hadn’t even swallowed the second one.<br/><br/>There was nothing much to throw up.<br/><br/>She just kept retching.<br/><br/>Kevin went outside to get her a glass of water, and after she felt a little better, handed it over for her to rinse her mouth.<br/><br/>Charlotte’s face also turned pale. She rinsed her mouth and said softly, “It’s just a reaction to not being allowed to go out and having a bad mood.”<br/><br/>Kevin frowned, his face worse than Charlotte’s, and he had no intention of joking, “Do you still want to throw up?”<br/><br/>“No.”<br/><br/>Kevin brought her back to the room and made her sit on the bed. He pulled a chair from the side and sat in front of her.<br/><br/>“Dizzy?” He asked while holding her wrist, one hand supporting her while the other touched her pulse.<br/><br/>“Not dizzy,” Charlotte answered.<br/><br/>“How about your stomach?” Kevin asked, “Any discomfort?”<br/><br/>“No. I just felt suddenly nauseous,” Charlotte saw that he was worried, so she didn’t tease him any further.<br/><br/><br/><br/>Kevin felt her pulse, his expression serious. A few seconds later, his fingertip trembled, and his expression became even more solemn.<br/><br/><br/><br/>After Allonzo Hobson said this, William Lane thought of Olivia Lane subconsciously.<br/><br/>He knew about Charlotte Lane’s physical condition, so he thought of the other sister.<br/><br/>William Lane exploded on the spot in the laboratory, “How did you know? Where are they?”<br/><br/>“They were photographed in the maternity department.” Allonzo Hobson said.<br/><br/>“Who is Olivia with?” William Lane walked out, thinking of how he didn’t bring a knife today.<br/><br/>“Huh? Olivia?” Allonzo Hobson was confused. “How did it involve Olivia? It’s Brook Sister and Harton.”<br/><br/>William Lane paused, “Who?”<br/><br/>Ten minutes later, the Clark Family, Lane Family, Holt Lawrence from Celestial Pivot, Charles Flores from Court Music Academy, Joseph Allen from Cloud Clothing and Rainbow Skirts, and Robinson Scott, James Collins, Luke, Gael Easton in Imperial Capital...<br/><br/>People from all directions drove to the hospital.<br/><br/>Meanwhile, at the hospital...<br/><br/>Charlotte Lane had a blood test and a B-ultrasound.<br/><br/><br/><br/>The doctor said she was pregnant for about fifty-seven days, eight weeks.<br/><br/>Hearing the doctor’s words, Charlotte Lane and Kevin Clark were silent for a moment, and then Charlotte Lane said, “But I... can’t get pregnant.”<br/><br/>Charlotte Lane had her check-ups at this hospital.<br/><br/>The system still had her medical records.<br/><br/>After reading them, the doctor said, “Theoretically speaking, there is indeed no possibility of pregnancy, and the chances of recovery in this situation are extremely small.”<br/><br/>When the doctor used the word “extremely small,” it was already considered tactful.<br/><br/>“But the fact is that she is pregnant, and there are no problems at all.” the doctor stated, “There are also two gestational sacs.”<br/><br/>During the B-ultrasound, the doctor mentioned that there were twin gestational sacs, both with fetal heart and fetal buds.<br/><br/>Twins.<br/><br/>Charlotte Lane didn’t speak again.<br/><br/>Kevin Clark had been holding her hand, “Will this situation have any impact on the mother’s body?”<br/><br/>The doctor looked at the report in his hand, “Her body is very healthy. The only problem is the difficulty in conception. But she has conceived, and based on the current examination, there are no problems with the adults or the children. So, there will be no impact on the grown-ups too.”<br/><br/>“What about later?” Kevin Clark asked again.<br/><br/>“Anything has risks,” the doctor said. “So regular check-ups are necessary, and observations should be made all the time.”<br/><br/>“If there are any problems in the later stages, will it cause great harm to the mother?” Kevin Clark asked.<br/><br/>Charlotte Lane frowned.<br/><br/>She thought that if the doctor answered yes, Kevin Clark would schedule an abortion surgery for her to prevent any problems from arising.<br/><br/>Ensure that there were no problems by not allowing problems to occur.<br/><br/>The doctor looked like he was in his seventies, with some gray hair and wearing reading glasses.<br/><br/>Hearing Kevin Clark keep asking, he looked up from above his glasses at Kevin Clark, paused for a moment, and said sternly, “As a husband, don’t be too anxious. Don’t affect the pregnant woman’s mood.”\t\t\t\t\t\t</div>", "images": {}, "success": true}