{"id": 592, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15016849.html", "title": "Chapter 589: 532: This Is The Price You Have To Pay", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 589: 532: This Is The Price You Have To Pay</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 589: Chapter 532: This Is the Price You Have to Pay<br/><br/>Another day in the laboratory, Edward Kirsten brought Charlotte Lane back to their living quarters.<br/><br/>The next day, Alice Eugene brought back news that they’d found Kevin Clark’s whereabouts.<br/><br/>Edward Kirsten told her to go set things up at the training field in advance.<br/><br/>After Alice had left, he went upstairs to find Charlotte Lane.<br/><br/>Charlotte Lane’s room was very large. One side was used for sleeping, and the other was as big as two bedrooms. Apart from the cloakroom, the rest was all dedicated to her hobbies.<br/><br/>Without leaving her room, she could do everything she loved.<br/><br/>When Edward Kirsten came to find her, she was painting with watercolors.<br/><br/>On the easel was an unfinished rose.<br/><br/>Charlotte Lane glanced at him, said nothing, and continued to paint.<br/><br/>Edward Kirsten pulled up a chair and sat next to her and watched her paint for a while before he said, “I’ve planted a rose field. If you have time, do you want me to take you to see it?”<br/><br/>Charlotte Lane glanced at him again, then nodded her head.<br/><br/><br/><br/>Edward Kirsten’s gaze slipped past the red rope around her neck, then onto the ring on her hand before finally looking at her painting.<br/><br/>He sat next to her, stayed until she finished painting, before finally leaving.<br/><br/>The next day, they went to the laboratory as usual.<br/><br/>After two days at the laboratory, Edward Kirsten answered a phone call, and then past 10 PM, he called on Charlotte Lane to return home.<br/><br/>Coming down from the mountain and getting into the car, Charlotte Lane closed her eyes to rest as usual.<br/><br/>However, about twenty minutes later she suddenly opened her eyes and looked outside.<br/><br/>She glanced at the scenery outside, then turned her head to look at Edward Kirsten, “This isn’t the way back home? Where are we going?”<br/><br/>“To see the rose field.”<br/><br/>This time, this season.<br/><br/>Charlotte Lane glanced again at the unfamiliar scenery outside, “Edward Kirsten, you...”<br/><br/>Before she could finish her sentence, she heard the sound of an explosion from far away.<br/><br/>She immediately looked through the back of the car.<br/><br/>It was too far away to see anything.<br/><br/>But one sound after another, it was indeed the sound of an explosion.<br/><br/>Charlotte Lane shifted her gaze back to Edward Kirsten.<br/><br/>Edward Kirsten had a mocking smile in his eyes, “Our living place, and the training field next to it is exploding.”<br/><br/>Charlotte Lane tightened her fingers, her face slowly draining of color.<br/><br/>Edward Kirsten looked at her and said, “A few days ago... Kevin Clark came here.”<br/><br/><br/><br/>Now, as they battled, she could feel his prowess.<br/><br/>But he was still inferior to Harton Clark.<br/><br/><br/><br/>Which meant she could beat him.<br/><br/>The two fought, and the people nearby were all on alert, but Edward Kirsten gave no order, so they dared not move.<br/><br/>After a few more rounds, Charlotte Lane, having discerned Edward Kirsten’s evasion direction, stabbed her pen towards him.<br/><br/>She was just about to hit her mark, when suddenly, a gunshot rang out.<br/><br/>Feeling the danger, she had to dodge. The bullet passed through her lifted hair, knocking off a strand.<br/><br/>Had she hesitated for half a second longer, she might have lost her life there and then.<br/><br/>Taking advantage of the moment she dodged the bullet, Edward Kirsten put a safe distance between them.<br/><br/>And that gunshot seemed like a signal, the surrounding people all drew their guns, chambered a round, all pointed at Charlotte Lane.<br/><br/>Alice Eugene, gun in hand, stood by Edward Kirsten’s side.<br/><br/>The shot just now, had been fired by her.<br/><br/>Under the cover of the dark night, Charlotte Lane faced countless gun muzzles without any hesitation. She caressed the pen in her hand, looking at Edward Kirsten.<br/><br/>Edward Kirsten was also looking at her, astonishment and rage in his eyes: “Enigma Starry, you actually tried to kill me.”<br/><br/>Charlotte Lane casually raised an eyebrow: “Didn’t you say, a corpse is the most obedient.”<br/><br/><br/><br/>Edward Kirsten chuckled softly: “What a vicious little wolf I’ve raised.”<br/><br/>“Indeed.” Charlotte Lane said coldly, “And so... this is the price you pay for raising me.”<br/><br/>“Enigma Starry.” Edward Kirsten’s voice turned cold, “I’ve killed countless people, but for you... I’ve shown nothing but tenderness. Are you really going against me, want to kill me, over those people?”<br/><br/>“Edward Kirsten, are you playing the emotional card now?” Charlotte Lane sounded as cold and hard as stone, devoid of emotion, “Even if I don’t kill you today, would you dare to keep me by your side? Since things have already come to the point where you could only keep me as a corpse by your side, why bother saying so much? Are you unwilling? Can’t you make up your mind?”<br/><br/>Edward Kirsten didn’t say a word.<br/><br/>Charlotte Lane let out a snort of laughter: “Don’t worry. Even if I were to turn into a corpse, I wouldn’t be yours.”<br/><br/>Edward Kirsten’s gaze grew increasingly gloomier, but he still didn’t speak, even held back Alice Eugene’s gun-wielding hand, fearing she might give the command to fire.<br/><br/>Just then, the surrounding area was filled with the deafening sounds of gunfire, and small range explosions.<br/><br/>The gun muzzles that were originally aimed at Charlotte Lane, were now mostly pointed towards the surrounding area.<br/><br/>Alice Eugene’s face changed drastically, she also looked towards the outside.<br/><br/>Edward Kirsten frowned, his expression turning quite grim.<br/><br/>Suddenly, a chorus of wolf howls pierced through the sounds of gunshots.<br/><br/>“Howl, howl, howl~~~~~”<br/><br/>Charlotte Lane looked at the fiery glow illuminating the distant horizon, listening to the wolf howls, a faint hint of a smile appeared in her hard, murderous eyes.\t\t\t\t\t\t</div>", "images": {}, "success": true}