{"id": 598, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15023239.html", "title": "Chapter 595: 538: Congratulating Your Uncle", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 595: 538: Congratulating Your Uncle</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 595: Chapter 538: Congratulating Your Uncle<br/><br/>The doctor didn’t care who Kevin Clark was, he started with his lecture, “She is pregnant, her pregnancy hormones are unstable, it can easily affect her mood. As a husband, you need to control yourself. Don’t upset her for no good reason! You’re behaving like an immature youth.”<br/><br/>Kevin Clark did not speak.<br/><br/>The Dean quietly tugged at the doctor’s white lab coat.<br/><br/>The doctor turned around and glared at him: “Why are you pulling on my clothes!”<br/><br/>The Dean”........”<br/><br/>“Next! No sex during pregnancy!” the doctor continued, “Especially during the first three months, the fetus is not yet stable and there’s a high chance of miscarriage. This kind of situation seriously harms her body!”<br/><br/>Charlotte Lane suddenly remembered what she had done during this time.<br/><br/>According to this timeline, it should have happened before her trip to M Continent to see Stella Edwards.<br/><br/>After Dean Yue left, her mood had been bad.<br/><br/>Furthermore, before her secret escape, Kevin Clark had cornered her in the restroom once.<br/><br/>Afterward, she went to Continent A, then... she threw herself down from the second floor of her own room... once.<br/><br/><br/><br/>That night in Continent A, she got into a fight, and she also hurt her waist.<br/><br/>Yesterday... Kevin Clark threw her on the bed, and was quite brutal...<br/><br/>Charlotte Lane inadvertently touched her stomach.<br/><br/>These two little ones are really strong, they’re fine after all of this.<br/><br/>When Kevin Clark finished listening, he frowned. He too was afraid of what had happened during this time, especially how excessive he was yesterday.<br/><br/>When the doctor saw his frown, he thought he was not satisfied, his voice became more serious: “What? You are still not willing? Look how you’ve hurt her neck! All men are alike, only care about their own comfort!”<br/><br/>The Dean secretly glanced at Kevin Clark’s expression, then reached up to wipe the sweat off his forehead.<br/><br/>Charlotte Lane also glanced at Kevin Clark, and suddenly smiled.<br/><br/>When the doctor saw her smile, he said to her again: “Don’t pamper him, let him have his way. Or else he’ll become too presumptuous, taking everything for granted. No matter the circumstances, you have to protect yourself, understand?”<br/><br/>Charlotte Lane nodded.<br/><br/>Afterward, the doctor reiterated a lot of things, Kevin Clark was very attentive on the side, asking in detail.<br/><br/>The doctor saw that his attitude was good, the tone of his voice became a bit gentler.<br/><br/>“Let nature take its course, don’t be too anxious.”<br/><br/>The two thanked him.<br/><br/>The doctor and the Dean left, leaving the consultation room to the two of them.<br/><br/>Outside, the Dean’s hair was wet with sweat: “You scared me to death.”<br/><br/>“Is it necessary?” the doctor removed his reading glasses.<br/><br/>“That man is the patriarch of the Clark Family.” The Dean whispered.<br/><br/>“Even the patriarch of the Clark Family should treat his wife properly.” the doctor replied, then he went back to his office.<br/><br/><br/><br/>The Dean was left at the door, wiping his sweat.<br/><br/>In the consultation room, Charlotte Lane sat in the chair, looking at Kevin Clark.<br/><br/><br/><br/>Kevin Clark furrowed his brows, looking at the group of people, each of them with sparkling eyes. He wondered why these people were so excited about his wife’s pregnancy.<br/><br/>Seeing Kevin Clark not responding, the crowd immediately lost hope in him.<br/><br/>All eyes turned towards Charlotte Lane.<br/><br/>Because Kevin Clark was shielding Charlotte Lane, Elina Clark used her cane to pull him aside.<br/><br/>Kevin Clark bowed his head to glance at the dirt stain on his coat.<br/><br/>“Eight... weeks.” Charlotte Lane heard her voice drift a little.<br/><br/>...<br/><br/>The news of the hospital periphery being surrounded by luxury cars quickly became trending on social media.<br/><br/><br/><br/>Not only was there a video of the luxury cars surrounding the hospital, but there were also videos of Kevin Clark and Charlotte Lane being surrounded by people.<br/><br/>Some people took them from the hospital’s upper floors.<br/><br/>And they were released online without any obstruction.<br/><br/>Additionally, there were also trending posts of each luxury car getting a penalty ticket.<br/><br/>Each parking spot was fined to prevent the hospital from getting congested.<br/><br/>[The long-lost globally limited car reappears, not only that, I also saw the mysterious buyer. A head of pink hair.]<br/><br/>[The only one who got blurred is Old Master Lane, right?]<br/><br/>[A random car part could be enough for me to buy a house.]<br/><br/>[So many people I don’t recognize. Especially those I don’t recognize, their cars are even more luxurious. The Clark and Lane families seem relatively low-key.]<br/><br/>[I was a volunteer in the hospital’s second-floor lobby, I could see everything very clearly from the second floor. With that show of force, I thought they were planning to flatten the hospital.]<br/><br/>[What kind of fairy friends does Kiara have?]<br/><br/>[That foreign man, so handsome. My god, just one look at him is enough to get me pregnant.]<br/><br/>[The one with the pink hair is also really handsome, okay!]<br/><br/>[I was lucky enough to see the pink-haired man got down the car because I was riding my $250 electric bike. I was so charmed by him that I almost fell, and he even helped me with my bike. My god! You guys don’t know how handsome he is in person. His peach blossom eyes are truly captivating!]<br/><br/>[Ah ah ah ah ah, why didn’t I go out for a stroll, my house is very close to the First Hospital.]<br/><br/>[Are you saying Kiara is really pregnant?]<br/><br/>[Absolutely, if she’s not, it wouldn’t be worth this big scene.]<br/><br/>[Watching the video, I almost laughed to death. Is Kiara’s backward step real?]<br/><br/>[In fact, it’s a big step backwards. Kevin’s action to protect his wife, it seems like the crowd in front are evil spirits. LOL.]<br/><br/>[The celestial status of the baby of the Clark and Lane families, I dare not think.]<br/><br/>[This baby sure knows how to choose its reincarnation.]<br/><br/>[I’m so tired of saying the word ‘envy.’]<br/><br/>[Enough said, I’m going to go to Facebook to congratulate Aunt Megan.]<br/><br/>[I’m going too.]<br/><br/>...\t\t\t\t\t\t</div>", "images": {}, "success": true}