{"id": 591, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15011104.html", "title": "Chapter 588: 531: Really Not Obedient", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 588: 531: Really Not Obedient</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 588: Chapter 531: Really Not Obedient<br/><br/>All eyes widened, staring at the blinking red dot on the map. Shock and disbelief spread rapidly.<br/><br/>Kevin Clark’s grip on his cell phone tightened suddenly, his heart pounding as if it were about to burst out of his chest.<br/><br/>He stared at the red dot displayed on the map, his throat dry and aching, and the corners of his eyes turning gradually red.<br/><br/>After a moment, he swallowed hard and hoarsely said, “Juan Wright, computer.”<br/><br/>Only then did everyone react and look at him. Juan Wright immediately stood up and went to fetch his own computer.<br/><br/>The content on Kevin’s cell phone was synchronized to the computer, and the computer was synchronized to the screen in the meeting room. The location zoomed in. Charlotte Lane was in a small town in the southern part of Continent A.<br/><br/>Everyone’s gaze shifted from the screen to Kevin Clark. Allonzo Hobson exclaimed, “She’s really there! Holy shit, Kevin... This is unbelievable.”<br/><br/>Luke also couldn’t help but nod in admiration.<br/><br/>Continent A had always been their main focus of surveillance, so when it was pinpointed in Continent A, Luke didn’t hold out for too much hope.<br/><br/>He came here just to carry out his orders.<br/><br/>It was truly unexpected that Edward Kirsten had actually chosen this place for his lair.<br/><br/><br/><br/>Continent A’s area is vast and its geography diverse. It took a long time to explore even after narrowing down the search to the southern and eastern regions.<br/><br/>Especially since Edward Kirsten was so adept at hiding and disguising both people and places.<br/><br/>Charlotte Lane’s location was provided just in time.<br/><br/>“Third Master...” Juan Wright looked at his computer and said, “Teacher gave the positioning and routes, and we can see where she has been with the locator.”<br/><br/>“Take a look,” Kevin Clark said in a deep voice.<br/><br/>Juan Wright tapped a few keys on the keyboard, pressed Enter, and a clear route map appeared.<br/><br/>It started from the Rose Garden, winding through many places before finally reaching a temporary resting place.<br/><br/>After staying at the temporary resting place for a long time, the movement continued all the way to Continent A...<br/><br/>Meanwhile, in Continent A, Charlotte Lane sent her location to them, then wedged the button-like locator in a crack between the restroom wall tiles. She then fixed the pendant and wound the red rope back up its original form little by little.<br/><br/>As she did so, she thought about the people in Imperial Capital.<br/><br/>She didn’t think too much about the others, but Kevin Clark must have been gritting his teeth, cursing her as a “stinky girl” in his heart as he looked at her photo.<br/><br/>As this thought crossed her mind, Charlotte Lane lifted the corner of her mouth slightly, restored the pendant, hung it around her neck, and then left the restroom to sleep.<br/><br/>She slept soundly.<br/><br/><br/><br/>When it came to finding Charlotte Lane, he had been more anxious than anyone. But now that she had been found, he fell silent.<br/><br/>William Lane looked at Allonzo Hobson, “Why are you more anxious than me, her brother?”<br/><br/>Allonzo Hobson raised his eyebrows, “Well, Brook Sister... I practically watched her grow up...”<br/><br/>Everyone looked at Allonzo Hobson.<br/><br/>Even Kevin Clark looked up at him.<br/><br/>Allonzo Hobson swallowed back his words, then changed the subject, “Brook Sister is really amazing. She managed to sync her location to so many people’s phones. Impressive, right?”<br/><br/>No one responded to him.<br/><br/>Allonzo Hobson turned to Robinson Scott.<br/><br/>Robinson Scott pursed his lips, then forced out four words through clenched teeth: “Yes, very impressive.”<br/><br/>Allonzo Hobson laughed.<br/><br/>Luke glanced at Robinson Scott and also chuckled, thinking: Evil people always find their match.<br/><br/>He felt that all of Robinson Scott’s thorns had been smoothed out.<br/><br/><br/><br/>...<br/><br/>In Continent A, Charlotte Lane rested for two days at the living quarters before following Edward Kirsten to the laboratory.<br/><br/>At the laboratory, she began doing her own experiments, and Edward Kirsten did not stop her.<br/><br/>Because they were more focused on the experiments, their time together was harmonious.<br/><br/>Three days later, while Charlotte was working on her experiments, Alice Eugene arrived.<br/><br/>Edward Kirsten followed Alice Eugene out of the laboratory, and Charlotte glanced at them before continuing with her experiment.<br/><br/>Outside the laboratory, Alice Eugene lowered her voice and said, “Mr. Kirsten, we’ve discovered people from Dark Radiance.”<br/><br/>Edward Kirsten looked in the direction of the laboratory and clucked his tongue. “They just won’t behave.”<br/><br/>Then he asked, “Are there many people? Have they found Kevin Clark?”<br/><br/>“There are quite a few, but we haven’t seen Kevin Clark yet,” Alice Eugene replied. “Enigma Starry exposed her location, and she still had a locator on her.”<br/><br/>Edward Kirsten laughed, “Wait until we find Kevin Clark’s whereabouts, and then make a move.”<br/><br/>“Yes,” Alice Eugene’s eyes flashed with excitement.<br/><br/> </div>", "images": {}, "success": true}