{"id": 594, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15019111.html", "title": "Chapter 591: 534: Being A Good Person", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 591: 534: Being A Good Person</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 591: Chapter 534: Being a Good Person<br/><br/>Edward Kirsten pulled Charlotte Lane to his right side, protecting her with his body.<br/><br/>The bullet went through his left chest and fell to the ground.<br/><br/>Charlotte stared at Edward in shock, her ears buzzing.<br/><br/>Edward looked down at her and forced a smile. Following that, he could no longer support himself and fell to the ground.<br/><br/>Charlotte grabbed his arm, and as he fell, she knelt beside him, preventing him from lying directly on the ground.<br/><br/>Wooden planks were beneath them, making a thud sound when they fell.<br/><br/>Edward grabbed her sleeve: “Does it hurt?”<br/><br/>Charlotte stared at Edward, still numb, and not responding.<br/><br/>As the blood on Edward’s chest slowly spread, her eyes gradually filled with tears.<br/><br/>“I have to admit, although I thought about dying together, in the end, I still hope you can live.”<br/><br/>Since Edward was shot, the sniper had not fired again.<br/><br/><br/><br/>Harton Clark ran over from a distance, but when he saw the scene, he stopped and did not approach.<br/><br/>William Lane and Xavier Dominic arrived after a while. Noticing Harton’s distance, they also stood still and watched.<br/><br/>As soon as the two arrived, Harton turned to face the other direction, no longer observing Charlotte and Edward.<br/><br/>When he came, he had planned to pull Charlotte up and take her away.<br/><br/>However, after taking just one step forward, he stepped back and stopped, securing the surroundings instead.<br/><br/>“Enigma, I’m sorry.” Edward gripped Charlotte’s sleeve, “I shouldn’t have fought you that day.”<br/><br/>Charlotte looked at him, unable to speak.<br/><br/>From the moment Harton attacked, Edward knew he had lost.<br/><br/>The words he spoke earlier were his farewell to her.<br/><br/>“I planted a rosefield in the backyard, but the season is off; the flowers haven’t bloomed yet. I haven’t taken you to see it.” Edward finished speaking and suddenly coughed a few times.<br/><br/>Blood spurted from his mouth, staining his pale skin a sharp red.<br/><br/>Charlotte’s tears fell on his clothes.<br/><br/>Edward wanted to raise his hand to wipe her tears, but he had no strength left.<br/><br/><br/><br/>Charlotte Lane draped Kevin Clark’s clothes over herself as she went to wash her face.<br/><br/>Kevin Clark waited outside the villa, while Gael Easton and his men were on the outermost periphery. They now came over to find Kevin Clark.<br/><br/>“Where’s that annoying little girl?”<br/><br/>Kevin Clark tilted his chin towards the inside of the villa: “She’s washing her face.”<br/><br/>Gael Easton looked inside, seeing no one coming out, and said, “Something strange happened. The sniper across from us... committed suicide.”<br/><br/>Kevin Clark looked at him.<br/><br/>Charlotte Lane was targeted by the sniper, and Gael Easton’s men were closest to the location the sniper wanted. So Kevin Clark ordered Gael Easton’s men to deal with it through the earpiece.<br/><br/>“There were a total of three snipers, including Alice Eugene,” Gael Easton said. “When my men arrived, the three were dead. Alice cut her carotid artery with Dagger. The other two... judging from their wounds, Alice killed them.”<br/><br/>A dark light flashed through Kevin Clark’s eyes for an instant.<br/><br/>He thought the sniper stopped suddenly because Gael Easton’s men arrived on time.<br/><br/>But it turns out they stopped on their own.<br/><br/>And they stopped after killing Edward Kirsten, with the girl unharmed.<br/><br/><br/><br/>If he were a sniper, faced with someone he despised, he wouldn’t miss such a good opportunity.<br/><br/>“I just heard... Edward Kirsten took a bullet for the girl,” Gael Easton said in a lowered voice. “Do you think... this was on purpose?”<br/><br/>Kevin Clark raised an eyebrow, his eyes seeming to say, “How did you suddenly become so insightful?”<br/><br/>Gael Easton didn’t pay much attention to Kevin Clark’s look, and continued analyzing, “Actually... for Edward Kirsten, tonight was a dead end. He knew he couldn’t get out, that he was going to die no matter what.”<br/><br/>“But if he died by taking a bullet for the girl...” Gael Easton made a disgusted sound, “With her character, she’ll remember him for the rest of her life. This guy was still scheming till the very end... Damn it! What’s with that look you’re giving me? Like I’m an idiot!”<br/><br/>Gael Easton finally noticed Kevin Clark’s expression.<br/><br/>Kevin Clark didn’t look at him anymore.<br/><br/>Gael Easton was quiet for a moment before continuing, “I’ve heard about the feud between Alice Eugene and the girl for a long time. Years ago, Alice was the one who tipped me off to kill the girl. With such a deep grudge, what do you think... made Alice not kill her but commit suicide? Ordinarily, she wouldn’t listen to Edward Kirsten when it came to the girl.”<br/><br/>Kevin Clark hesitated for a moment then said, “Maybe deep down, she wanted to become the only person to accompany Edward Kirsten in the afterlife. Or maybe... for once in her life, she completely obeyed an order.”<br/><br/>Gael Easton listened and nodded in agreement, “Edward Kirsten... how to deal with him?”<br/><br/>“Hundred Demons Pavilion is handling it,” Kevin Clark replied. “As for the details, we’ll let her decide.”<br/><br/>Gael Easton nodded again, “That’s true, it’s her business, let her deal with it.”<br/><br/> </div>", "images": {}, "success": true}