{"id": 593, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15016850.html", "title": "Chapter 590: 533: Underestimating Kevin Clark", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 590: 533: Underestimating Kevin Clark</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 590: Chapter 533: Underestimating Kevin Clark<br/><br/>When she heard the explosion at her original residence, Charlotte Lane was genuinely frightened.<br/><br/>But she quickly calmed down.<br/><br/>She trusts Kevin Clark.<br/><br/>And Kevin Clark has never let her down.<br/><br/>The gunshots and the cries from the Silver Palace around her all tell her that Kevin Clark is coming to pick her up.<br/><br/>The gunshots around her are getting closer, and someone runs in from outside.<br/><br/>When he approached, Alice Eugene grabbed his collar tightly and harshly asked, “What happened!”<br/><br/>“It’s the people from Dark Radiance.” The person stuttered, “And the people from the Hundred Demons Pavilion, and a group of people with unknown power.”<br/><br/>“How could it be them! Wasn’t the residence blown up!” Alice shouted.<br/><br/>“Yes, it was blown up. But... the brother in charge of detonating didn’t send any message. They disappeared.”<br/><br/>Alice threw him off: “A bunch of useless people!”<br/><br/><br/><br/>After scolding them, she looked at Edward Kirsten.<br/><br/>Compared to Alice’s excitement and anger, Edward Kirsten was much calmer. He looked at Charlotte Lane and ordered Alice, “Then we’ll face the enemy head-on.”<br/><br/>“Yes.” Alice nodded and left. Before leaving, she glared at Charlotte Lane.<br/><br/>There are still many gun muzzles pointed at Charlotte Lane, who didn’t dare to move recklessly for a moment.<br/><br/>“I really underestimated Kevin Clark.” Edward Kirsten said.<br/><br/>Charlotte Lane looked at him without speaking.<br/><br/>“What do you think... what will be the outcome tonight?” Edward Kirsten looked at Charlotte Lane gently.<br/><br/>Charlotte Lane said, “Do you think... you still have a chance of winning?”<br/><br/>“Of course, there is. Although it’s small, there’s still a chance.” Edward Kirsten said, “As long as there is, we shouldn’t give up, right?”<br/><br/>“Yes.” Charlotte Lane said.<br/><br/>Edward Kirsten looked at her and said after a moment of silence, “You seem to have a lot of confidence in Kevin Clark.”<br/><br/>“Yes.” Charlotte Lane replied.<br/><br/>Edward Kirsten smiled, “Do you think Kevin Clark, who’s outside the periphery, can save you from so many gun muzzles?”<br/><br/>Charlotte Lane also gave a soft smile, “He can try.”<br/><br/>“Do you think I’ll be willing to?” Edward Kirsten asked again.<br/><br/>“It’s just a matter of moving your lips, what’s there to be reluctant about?” Charlotte Lane said.<br/><br/>Edward Kirsten’s smile was bitter, and he seemed to have no sense of urgency for his life being threatened. His voice suddenly softened, “Enigma... I suddenly think it would be nice for us to die together.”<br/><br/>In the darkness, Charlotte Lane’s eyes flashed.<br/><br/>“Wait and see.” Edward Kirsten said, “Let’s see if we will die together tonight, or if Kevin Clark and his group will die together.”<br/><br/><br/><br/>Charlotte Lane climbed the peach blossom tree and reached the second floor of the villa.<br/><br/>Edward Kirsten tried to go inside the villa to find her, but at this moment, the people outside broke into the courtyard.<br/><br/>He couldn’t enter the villa and started fighting with the intruders.<br/><br/>The fighting outside was still fierce, but as soon as some people broke in, many retreated back and focused on protecting Edward Kirsten.<br/><br/>Meanwhile, Charlotte Lane went straight to Alice Eugene and Edward Kirsten’s room after entering the villa.<br/><br/>She found two guns in their room, checked if they had bullets and were usable, and then went back downstairs to help.<br/><br/>The outside battle continued.<br/><br/>Charlotte Lane didn’t see anyone she recognized.<br/><br/>Not only could she not see the desired Kevin Clark, but she couldn’t even see Edward Kirsten, who was surrounded by people.<br/><br/>She didn’t care too much about that, found cover, and started shooting at people.<br/><br/>A portion of the firepower was directed at her from behind as she was being attacked.<br/><br/>The battle lasted a long time, and Edward Kirsten’s men gradually decreased in number.<br/><br/>Finally, Charlotte Lane saw Kevin Clark’s figure.<br/><br/><br/><br/>She had discarded seven or eight guns beside her, all of which were her own used guns, taken from the opponent’s hands.<br/><br/>After finishing off the people around her, she glanced at Kevin Clark again and started looking for Edward Kirsten.<br/><br/>Edward Kirsten disappeared at some point.<br/><br/>But... they were trapped in the outer perimeter and couldn’t escape anyway.<br/><br/>Keeping an eye on her surroundings, Charlotte Lane searched for Edward Kirsten.<br/><br/>Aside from Edward Kirsten’s men, she was the most familiar with this place.<br/><br/>There was a narrow path connecting the front courtyard to the backyard, and Charlotte Lane moved slowly along it.<br/><br/>Suddenly, she felt something was off, and at the same time, voices were heard from afar—Kevin Clark and William Lane shouted, “Lila!”<br/><br/>Charlotte Lane dodged one bullet to the side, but another one immediately followed.<br/><br/>There were snipers on the other side, and at this speed... there was more than one.<br/><br/>Charlotte Lane dodged again, but as she ran behind a pillar, a third bullet came in.<br/><br/>The snipers were predicting her next position, so Charlotte Lane immediately changed directions, catching a glimpse of a figure in her peripheral vision rushing towards her.<br/><br/>Everything happened too quickly for Charlotte Lane to even recognize who the figure was; instinctively, she grabbed the person, intending to dodge with them.<br/><br/>However, the person used a force in the opposite direction, protecting her by holding her in their arms.<br/><br/>Charlotte Lane heard the sound of a bullet passing through a body, and the scalding hot blood splattered on her neck.<br/><br/>Her whole body ran cold, and she immediately turned her head to look at the person who had protected her.<br/><br/>Edward Kirsten’s left chest was drenched in red on his white suit...\t\t\t\t\t\t</div>", "images": {}, "success": true}