{"id": 595, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15019112.html", "title": "Chapter 592: 535: Getting Into Big Trouble", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 592: 535: Getting Into Big Trouble</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 592: Chapter 535: Getting into Big Trouble<br/><br/>Charlotte Lane stepped out of the villa after washing her face and saw Gael Easton standing at the entrance.<br/><br/>Her expression was back to normal, but her eyes were slightly red and swollen.<br/><br/>“You’re here too?”<br/><br/>Gael hummed a laugh and teased, “Yeah. Aren’t you surprised? Why wouldn’t I come for the opportunity to... let you owe me a favor? Today, I’m doing you guys a favor, so tomorrow, you’ll both have to help me out.”<br/><br/>He’s referring to what she said at the airport last time, about not complicating their relationship and just using each other’s power.<br/><br/>“You have a high level of awareness,” Charlotte Lane said lightly, “But... your luck isn’t very good. You’ve met someone like me who’s cold-hearted and loves to take advantage. Don’t worry, if you need help, I’ll definitely bring people to watch.”<br/><br/>“You!” Gael was choked with anger.<br/><br/>Kevin Clark was standing beside them with no expression and did not join in their banter.<br/><br/>Charlotte took a glance at Gael: “Thanks.”<br/><br/>“Huh?” Gael thought his ear was broken.<br/><br/>“But it won’t change the fact that I’ll be watching the fun.” Charlotte added.<br/><br/><br/><br/>Gael: “...” His ear was still intact.<br/><br/>When things here were almost dealt with, Charlotte went back with them to their base in Continent A.<br/><br/>On the way, there were seven of them in one car, including the driver.<br/><br/>There was a bloody smell on each person in the car, and they had to open the windows for ventilation.<br/><br/>After the car had been driven for a while, Allonzo Hobson said, “Brook Sister, were you frightened when the explosion happened?”<br/><br/>Charlotte Lane, with Kevin Clark on her left and Roy Madison on her right, nodded her head.<br/><br/>“Don’t worry, Brother Nine,” Robinson Scott, who was sitting next to Allonzo Hobson, said. “None of our people were lost.”<br/><br/>Charlotte nodded again, and although she didn’t say anything, her gaze at Robinson Scott and Allonzo Hobson told them to continue.<br/><br/>Allonzo Hobson said, “Our Third Master’s brain is not an ordinary one. When we saw the positioning, our first reaction was to come to you. But when our Third Master saw the positioning, he immediately sent people to Continent A to deliberately expose their tracks in a concealed way.”<br/><br/>Charlotte’s face showed a hint of a smile.<br/><br/>“Third Master directly launched a counter-surveillance operation,” Allonzo Hobson said. “In a short time, he figured out their plot, and last night, we took the initiative to throw a thunderstorm at them, followed by a sky-high explosion. Then we let the people who were secretly monitoring outside the laboratory follow you to the location, surrounded it, and attacked.”<br/><br/>Charlotte glanced at Kevin Clark.<br/><br/>Kevin Clark didn’t look at her, but just lowered his gaze. However, the hand holding hers tightened slightly.<br/><br/>“And what’s the most annoying thing, do you know, Brook Sister?”<br/><br/>“What?” Charlotte Lane asked.<br/><br/>“When we asked him why he thought it was like this,” Allonzo Hobson complained. “This guy just said: ‘I don’t know, it’s just a feeling.’”<br/><br/>Perhaps it was because Allonzo Hobson’s tone was so angry and funny.<br/><br/>Everyone in the car laughed except for Kevin Clark.<br/><br/>Kevin Clark seemed like a person who had exhausted his energy and left only an empty shell, with his inside in hibernation.<br/><br/><br/><br/>Moreover, it wasn’t just towards her, Arthur North talked less with everyone, and seldom smiled.<br/><br/>He would still smile at her, but his smile seemed to lack the tenderness it once had.<br/><br/>After half a month, they all returned home.<br/><br/>Robinson Scott went back to the Lane Family with William Lane first.<br/><br/>Arthur North didn’t follow her; instead, he sent Charles Amos to the Lane Family an hour after she got home.<br/><br/>Robinson Scott began to consider the possibility of marital discord.<br/><br/>She spent a week at the Lane Family, and Arthur North only called her every night without mentioning picking her up.<br/><br/>The possibility of marital discord grew greater.<br/><br/>Robinson Scott didn’t know if her mood was affecting her, but her appetite decreased a lot.<br/><br/>After being forced to stay at home and rest for a week by her parents, she decided to go to the Research Institute.<br/><br/>On the morning of the day she was to go to the Research Institute,<br/><br/>Arthur North suddenly appeared at her home and took her away.<br/><br/><br/><br/>On the way, Robinson Scott noticed they weren’t heading to the Research Institute and wondered if they might be going to the Civil Affairs Bureau instead?<br/><br/>Robinson Scott started to feel carsick again and felt nauseous.<br/><br/>Just when she was about to talk to Arthur North, the car stopped at a manor house.<br/><br/>Robinson Scott looked at the sprawling manor, which was still under construction, and asked, “Where’s this?”<br/><br/>“Emperor Winter Mansion. The place I live.” Arthur North helped her unbuckle her seat belt and said, “Before I lived at Clark Manor, I used to live here.”<br/><br/>Robinson Scott followed him out of the car.<br/><br/>As soon as she got out, Arthur North quickly grabbed her hand.<br/><br/>Robinson Scott felt the urgency in his grip, as if he was afraid she would run away.<br/><br/>Arthur North led her by the hand and took her straight to the bedchamber.<br/><br/>Robinson Scott was still uncertain about why they had come to the bedchamber this early in the morning when she suddenly heard the sound of a door lock.<br/><br/>She paused, her excitement at admiring the manor and room disappearing in an instant.<br/><br/>Two words immediately came to her mind: “It’s done.”<br/><br/>Arthur North stood by the door, watching her while slowly undoing his cuff. His eyes became more sinister, and he chuckled, “Madam, how do you feel about this place?”<br/><br/>Robinson Scott calmly looked into his eyes, not wanting to answer his question.<br/><br/>All of it suddenly made sense.<br/><br/>There was no marital discord, she had been duped. She had been tricked big time, Arthur North was here waiting to settle the score with her.<br/><br/>Cold and calm, they were just Arthur North suppressing his emotions.<br/><br/>Letting her return to the Lane Family for a week was just to set the stage for keeping her locked up here.<br/><br/>This would be where she would never be allowed to go home again in the future.\t\t\t\t\t\t</div>", "images": {}, "success": true}