{"id": 590, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15011103.html", "title": "Chapter 587: 530: A Surprise From Afar", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 587: 530: A Surprise From Afar</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 587: Chapter 530: A Surprise from Afar<br/><br/>With the coldness of the laboratory, the smile on Edward Kirsten’s face disappeared, making the place even colder.<br/><br/>Charlotte Lane’s expression remained unchanged, still looking at him calmly.<br/><br/>After a while, Edward Kirsten asked, “How did you know about the Drunken Life Grass? Did Victoria Zane tell you?”<br/><br/>Charlotte Lane looked at him, her voice cold, “Is it an unexpected surprise?”<br/><br/>Edward Kirsten chuckled, “She really did tell you about it.”<br/><br/>Charlotte Lane didn’t respond.<br/><br/>“Indeed, an unexpected surprise,” said Edward Kirsten softly. “So what else did she tell you?”<br/><br/>Charlotte Lane raised her eyebrows, “I’ll tell you if I’m in a good mood.”<br/><br/>“How can I make you happy?”<br/><br/>“At least... I want to see the data of the Drunken Life Grass first,” said Charlotte Lane.<br/><br/>Edward Kirsten squinted his eyes and smiled, “Alright. I’ll take you.”<br/><br/><br/><br/>It took Charlotte Lane two days to study and remember all the data and information about the Drunken Life Grass.<br/><br/>She then spent a lot of time studying data related to the 319 experiment.<br/><br/>She spent a week in the laboratory.<br/><br/>Edward Kirsten had someone prepare a resting room for her.<br/><br/>Edward Kirsten was usually busy, so he only went home to see Charlotte Lane.<br/><br/>Now that Charlotte Lane was in the laboratory, he didn’t need to worry about going home.<br/><br/>But after a week, his experiment was not yet finished, so he decided to take Charlotte Lane back home.<br/><br/>He felt that if he didn’t take her home soon, she might collapse from exhaustion in the laboratory.<br/><br/>On the way back, Charlotte Lane kept her eyes closed, resting.<br/><br/>It wasn’t until they were almost home that she opened her eyes and looked around.<br/><br/>“Awake?”<br/><br/>Charlotte Lane, observing the outside world with her beautiful phoenix eyes, spoke in a newly awakened voice, “I’m hungry. I wonder if there’s any good food nearby. Can we eat out?”<br/><br/>“Of course,” Edward Kirsten looked at her, “Do you want to eat steak? There’s a Western restaurant nearby.”<br/><br/>“I want to eat two servings.”<br/><br/>Edward Kirsten smiled gently, “Okay.”<br/><br/>Originally, they were almost at the entrance of their living quarters. The driver turned the steering wheel and set off for the Western restaurant.<br/><br/>The area they lived in was not bustling, so it would take some time to get to the Western restaurant.<br/><br/>After the driver changed direction, he drove half a circle around their living quarters before taking another road.<br/><br/>After driving for a while, Charlotte Lane looked at the surrounding buildings, and her eyelashes trembled slightly.<br/><br/><br/><br/>She lowered her gaze and grabbed Edward Kirsten’s sleeve before turning her head, “Where are we?”<br/><br/>She grabbed his sleeve first and then looked at Edward Kirsten.<br/><br/>The expression in her eyes changed quickly. When she looked at Edward Kirsten, her eyes were filled with smiles and curiosity.<br/><br/><br/><br/>Alice Eugene was so furious she couldn’t speak and just stuffed her mouth with breakfast mechanically.<br/><br/>After a while, Edward Kirsten came down the stairs: “Is the sun rising from the west? What’s the occasion for you getting up so early?”<br/><br/>Charlotte Lane looked at him and said: “It’s cloudy today. There’s no sun.”<br/><br/>Edward Kirsten sat down at the dining table.<br/><br/>Charlotte Lane immediately turned to him: “I wanted to go to the training field.”<br/><br/>Edward Kirsten looked at her with a knowing expression: “No. It’s not a place for girls to go often.”<br/><br/>Charlotte Lane looked at him coldly.<br/><br/><br/><br/>Edward Kirsten refused mercilessly: “Even if you stare a hole through me, you can’t go.”<br/><br/>Charlotte Lane withdrew her gaze, finished her milk, stood up, and coldly said: “Who cares about going?”<br/><br/>With that, she turned around and left the restaurant, heading for the stairs.<br/><br/>“Sit downstairs for a while before going up to sleep.” Edward Kirsten said.<br/><br/>Charlotte Lane, who was about to step up the stairs, paused, turned around, and sat back down on the sofa to digest breakfast silently.<br/><br/>Edward Kirsten smiled at her then continued eating breakfast.<br/><br/>...<br/><br/>In the evening, Charlotte Lane went to her room to sleep when it was time.<br/><br/>At 9 o’clock local time, she was actually asleep.<br/><br/>But by midnight, she woke up.<br/><br/>She went to the restroom and took off the pendant around her neck at the washbasin.<br/><br/>She slowly unraveled the red rope, and the white heart-shaped stone was revealed.<br/><br/>Charlotte Lane applied slight force, and the stone broke apart from the glued middle. A small, button-sized black object fell out.<br/><br/>Charlotte Lane picked up the black button and pricked it with a needle in the middle.<br/><br/>At the same time, far away in the Imperial Capital, which was still daytime.<br/><br/>Harton Clark, William Lane, Hugo Clark, Xavier Dominic, Robinson Scott, Luke, James Collins, Thomas Firway and others were sitting together discussing matters.<br/><br/>Harton Clark enlarged the map on the screen in front of them: “The eastern and southern parts of Continent A are where Edward Kirsten is most likely to be. Send someone to secretly investigate first...”<br/><br/>Before he could finish, several harsh alarm sounds rang out.<br/><br/>Everyone was startled.<br/><br/>Then, almost everyone grabbed their cell phones.<br/><br/>Because the alarm sounds were coming from their phones.<br/><br/>When they opened their phones, they all saw the same image on everyone’s screen.<br/><br/>A photo of Charlotte Lane.<br/><br/>Beside the photo, it read: “A surprise from afar.”<br/><br/>Everyone froze, staring at their phones motionlessly, as if they had turned into wax statues.<br/><br/>Then, after about ten seconds, the photo disappeared. Their screens showed a map, with a blinking red dot revealing Charlotte Lane’s current location.\t\t\t\t\t\t</div>", "images": {}, "success": true}