{"id": 599, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15023240.html", "title": "Chapter 596: 539: Third Master’S Anxiety", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 596: 539: Third Master’S Anxiety</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 596: Chapter 539: Third Master’s Anxiety<br/><br/>Kevin said he wanted to go back to Clark Manor, but at the hospital entrance, they got into William Lane’s car directly.<br/><br/>Then, everyone’s cars followed William Lane’s car back to the Lane Family.<br/><br/>On the way, Kevin kept holding Charlotte’s hand absentmindedly, saying the most frequent phrase for William Lane to slow down.<br/><br/>Finally, William Lane, unable to bear it any longer, said, “Why don’t you drive? Look outside; even the person pushing the stroller is faster than us.”<br/><br/>“I can’t drive.” Kevin didn’t look outside, just saying, “You slow down.”<br/><br/>William Lane took a deep breath, “How can you say it so confidently?”<br/><br/>“Focus on driving and talk less.”<br/><br/>“That’s my sister.” William Lane said, “Don’t I know to be careful?”<br/><br/>“If it weren’t for the fact that you’re her brother, do you think we’d get in your car?” Kevin said.<br/><br/>William Lane: “......”<br/><br/>Charlotte closed her eyes, listening to their bickering, not wanting to get involved at all.<br/><br/><br/><br/>The car finally stopped, and Charlotte opened the door and got out.<br/><br/>After Kevin got out of the car, he looked at the entrance of the Lane Family, “Why did we come here?”<br/><br/>“What do you think?” William Lane said, “You’ve been clueless the whole way. Even Charlotte, who was asleep, knew the route was to the Lane Family.”<br/><br/>Kevin looked at Charlotte.<br/><br/>Charlotte patted Kevin’s shoulder, “Third Master, you’re a bit too anxious.”<br/><br/>Kevin opened his mouth, “I’m adjusting.”<br/><br/>Charlotte nodded her head without any emotion, “Keep it up.”<br/><br/>Charlotte originally wanted to wait for everyone to arrive before going in, but Kevin took her to the living room first.<br/><br/>Leaving William Lane waiting outside for everyone.<br/><br/>By the time everyone arrived, Kevin had already warmed a glass of milk for Charlotte to drink.<br/><br/>Charlotte, holding the glass, saw them come in and stood aside.<br/><br/>Then she looked at one group after another coming in and said, “Why did you all follow?”<br/><br/>“I don’t know.” Robinson Scott blinked and looked at her neck, “Everyone drove here without an appointment.”<br/><br/>After Charlotte came in and took off her coat and scarf, the bite marks on her neck showed up, and she looked at Luke again.<br/><br/>Luke’s gaze involuntarily glanced at her neck, and then immediately moved away, “I’ve never been to the Big Boss’s house, so I came to have a look.”<br/><br/>“I’m different; I’m here to see my future niece.” James Collins said.<br/><br/>“You’re quite early.” Charlotte said.<br/><br/>“Come early to improve our relationship.” James Collins suddenly saw her neck bite marks, gaping and taking a step back.<br/><br/>Luke saw Kevin’s murderous gaze and quickly pulled James Collins behind him, blocking him.<br/><br/><br/><br/>James Collins reacted and coughed softly.<br/><br/>He always thought his sister was cold in this aspect.<br/><br/>Didn’t expect her to be so fierce.<br/><br/>After all, he’s about to have a new niece.<br/><br/><br/><br/>Since they were at the Lane Family, Andrew Lane and Sophie Ortiz were attending to everyone.<br/><br/>After settling the other group, Andrew Lane and Sophie Ortiz came over to greet them. Joseph Allen, Holt Lawrence, and others were in Imperial Capital, and they met before and knew each other.<br/><br/>But none of them had met these few people.<br/><br/><br/><br/>Knowing that she had something to say to him, Natalie Wayne said, “Go ahead. Both of you dress warmly.”<br/><br/>“Mmhmm.”<br/><br/>Charlotte glanced at Charles Amos who had been sitting by Finn Clark the entire time.<br/><br/>Charles Amos immediately stood up and walked quickly to her side.<br/><br/>As she stood up, Harton Clark also stood up.<br/><br/>Charlotte turned her head to look at him and dropped three words, “Don’t follow.”<br/><br/>Harton Clark paused and looked at Charles Amos.<br/><br/>Charles Amos stared back at him, his eyes extremely determined. Between the men, they exchanged a look — one that signified their shared responsibility to protect a woman.<br/><br/>It was a look of a little man about to rise.<br/><br/>But only Charles Amos’ gaze was firm, and Harton Clark’s eyes were still somewhat flustered. That was distrust toward a little man.<br/><br/>And his own anxiety that couldn’t be settled.<br/><br/>Charlotte and Charles Amos put on their coats at the entrance and walked from the front courtyard to the backyard.<br/><br/>Charlotte held Charles Amos’ hand and asked after a while, “Do you prefer a younger sister or younger brother?”<br/><br/>“I thought it was twins?” Charles Amos looked up at her, “Grandma said there’s a possibility of having a boy and a girl. Can’t it be one younger brother and one younger sister?”<br/><br/>“If it’s one little brother and one little sister, who would you like?” Charlotte asked again.<br/><br/>“Can’t I like both?”<br/><br/>“You can.” Charlotte finished, and then asked again, “Are you unhappy?”<br/><br/>“No.” Charles Amos shook his head, “I like my younger brother and sister. I’m just a little scared.”<br/><br/>“Don’t be afraid,” Charlotte said, “I promise you, nothing will happen.”<br/><br/>Charles Amos tightened his grip on her hand, “Okay.”<br/><br/>“Have you thought of a name?” Charlotte asked, holding Charles Amos’ hand as they walked for a while.<br/><br/>“I have,” Charles Amos said, “I want to use the character ‘Huang’ with the ‘wang’ radical and the “xing” radical. Christopher Clark.”<br/><br/>Charlotte raised her eyebrows, “Let your fathers hurry up and take care of it. They should take care of it and then go to school.”<br/><br/>Charles Amos’s steps hesitated for a moment, “I don’t want to go.”<br/><br/>“You must go.”<br/><br/>Charles Amos furrowed his little brows, “Didn’t we say that we were going to discuss it?”<br/><br/>“The premise of that discussion is that you have to go to school first. If you really can’t adapt, then we’ll talk again,” Charlotte said with downcast eyes.<br/><br/>Seeing her determination, Charles Amos said, “Then which grade should I be in?”<br/><br/>“That depends on which grade will accept you,” Charlotte said lightly.<br/><br/>Charles Amos: “......Why does it seem so casual?”<br/><br/>Charlotte didn’t say anything, just continued to hold his hand and walk.<br/><br/>“Are you tired? Do you want to go back?” Charles Amos said, “Mr. Clark will be worried.”<br/><br/>“I’m not tired,” Charlotte said, “Let’s circle around this way and then go back.”<br/><br/>“Oh.” Charles Amos continued walking quietly beside her for a while.<br/><br/>Seeing his hesitant expression, Charlotte said, “If you want to see Wilton Edwards, just ask Second Brother Davis to take you. You don’t need to specifically tell me.”<br/><br/>Charles Amos, who was figured out, didn’t hide it any longer, “I want to go see him before the new year.”<br/><br/>“Mmhmm.”\t\t\t\t\t\t</div>", "images": {}, "success": true}