{"id": 608, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15047497.html", "title": "Chapter 605: 548: Trash", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 605: 548: Trash</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 605: Chapter 548: Trash<br/><br/>Clark Manor is so big, there were servants everywhere.<br/><br/>Seeing Charles Amos about to fall, all the nearby servants who happened to catch sight of this immediately ran towards him.<br/><br/>But when more than half of Charles’s body had already fallen over the railing, Aunt Cruz, faster than all the servants, managed to pull him back in time.<br/><br/>Because she was pulling Charles, Aunt Cruz accidentally pushed Morgan Mia.<br/><br/>“Charles, where did you hit?” Without bothering about anything else, Aunt Cruz wanted to check on his condition first.<br/><br/>But just as she bent down, she was slapped on her left cheek.<br/><br/>“What do you think you are! How dare you push me!” Morgan Mia yelled angrily.<br/><br/>Her slap was very forceful, Aunt Cruz’s cheek immediately swollen, and blood was seeping from the corner of her mouth.<br/><br/>“Grandma Cruz.” Charles angrily pushed Morgan Mia and glared at her, “And what exactly are you!”<br/><br/>“You...” Before Morgan Mia could finish her sentence, she heard hurried footsteps approaching.<br/><br/>She turned around and was greeted with a slap on her face.<br/><br/><br/><br/>A sharp clap that sliced through the air.<br/><br/>Lila Campbell’s slap too, was very forceful, causing Morgan Mia to stagger.<br/><br/>“Lila.” Worried Lila might harm the baby, Aunt Cruz immediately went over to hold her. Lila patted Aunt Cruz’s hand to reassure her, then let go.<br/><br/>Morgan Mia was stunned by the slap. She held her face, and after a moment, looked at Lila Campbell, “You dare to hit me!”<br/><br/>Lila Campbell stepped forward and gave her another slap from the other side.<br/><br/>This slap was even harsher.<br/><br/>Taken by surprise, Morgan Mia staggered again. As she regained her balance, she was about to fight back.<br/><br/>Alfie Ward caught the hand she raised.<br/><br/>As she raised her other hand, Lila Campbell, faster than Alfie, grabbed her wrist and forcefully yanked her to the side.<br/><br/>“Sister-in-law.”<br/><br/>“Lila.”<br/><br/>The force Lila Campbell used was so strong that Alfie, Aunt Cruz and Charles all were startled, fearing for her safety.<br/><br/>Lila Campbell dragged Morgan Mia directly to the railing by the river, and before she could resist, she forcefully pushed her into the river.<br/><br/>With a loud splash, Morgan Mia began to struggle in the water.<br/><br/>Although it’s April and the river has already thawed, the water was still chilly during the dozen degrees weather.<br/><br/>The river wasn’t deep, but Morgan Mia couldn’t get up from struggling and swallowed a few mouthfuls of water.<br/><br/>Lila Campbell watched her coldly.<br/><br/>The servants nearby were all scared.<br/><br/><br/><br/>Alfie Ward followed closely behind.<br/><br/><br/><br/>After walking a distance, Aunt Cruz nervously said, “Lila, are you okay? Do you feel uncomfortable anywhere?”<br/><br/>“I’m fine,” Charlotte Lane turned her head and looked at Aunt Cruz’s swollen face, “I’m sorry you had to go through all that, and that you had to suffer such an insult today.”<br/><br/>“All that is nothing,” Aunt Cruz said, “You should worry about your own health, do not get angry over this. Nothing is more important than your health.”<br/><br/>Charlotte Lane nodded, then turned to Charles Amos, “Did you hurt yourself anywhere?”<br/><br/>“I bumped my ribs a bit,” Charles said, “But I should be fine. She pushed me. And I was never going to hit her in the first place, but she suddenly came after me.”<br/><br/>“I saw it,” responded Charlotte Lane.<br/><br/>Charles Amos was silent for a moment, then took a few steps with them before he suddenly ran off.<br/><br/>“Charles!” Aunt Cruz shouted.<br/><br/>Charles didn’t reply, he just kept running.<br/><br/>Charlotte Lane stopped, watching Charles, then said after a moment, “Leave him be.”<br/><br/>“But I’m worried he’s hurt,” said Aunt Cruz.<br/><br/>“He’ll be alright,” Charlotte Lane assured her, “If he gets hurt, he knows where to find someone to apply medicine.”<br/><br/>Charlotte Lane returned to apply some medicine, leading Aunt Cruz.<br/><br/><br/><br/>Meanwhile, Charles had returned to the riverbank.<br/><br/>When he got there, Morgan Mia was already helped up, preparing to return home.<br/><br/>Her clothes were soaking wet, and she was shivering from the cold.<br/><br/>Upon seeing her, Charles timed his actions perfectly, managed to separate her from the people helping her, and pushed her back into the water.<br/><br/>Morgan Mia was quick to react, even in her shivering state she instinctively tried to pull Charles down with her.<br/><br/>But this time, Charles evaded in time.<br/><br/>Morgan Mia grabbed hold of a railing on the edge of the river, but Charles had a needle in his hand that stabbed her palm.<br/><br/>Morgan Mia’s reaction, after choking on water, was a little slow.<br/><br/>The pain forced her to loosen her grip and she fell back into the water.<br/><br/>Splash.<br/><br/>“Charles!” Harton Clark, who was accompanying Tom Wayne and Elina Clark, came over and just happened to see Charles pushing her.<br/><br/>A servant once again went in to save Morgan.<br/><br/>Knowing that someone was coming, Morgan Mia played possum, sinking again and choking on a few mouthfuls of water.<br/><br/>Charles watched her with cold eyes, flinging out the words, “Quit the charade.”<br/><br/>Then he stood by the riverside, waiting for Harton Clark and the others to arrive.\t\t\t\t\t\t</div>", "images": {}, "success": true}