{"id": 600, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15025305.html", "title": "Chapter 597: 540: Doing More Harm Than Good", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 597: 540: Doing More Harm Than Good</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 597: Chapter 540: Doing More Harm than Good<br/><br/>In the end, the Clark family and the Lane family decided that Kevin Clark would accompany Charlotte Lane to stay at the Lane’s house for a few days, after which Aunt Cruz would accompany her to the Clark Manor.<br/><br/>Since it was the elders’ intention, Charlotte Lane didn’t have any objections.<br/><br/>However, both William Lane and Kevin Clark were adamant about not allowing her into the laboratory.<br/><br/>The Clark family didn’t know about Charlotte’s physical condition, so they remained silent. After all, since the Lanes pampered their daughter, they wouldn’t dare to interject.<br/><br/>Everyone on the Lane’s side was aware of Charlotte’s physical condition.<br/><br/>She had initially had no chance of getting pregnant, but had suddenly become pregnant. Even though everything seemed fine now, they were still afraid she would encounter problems.<br/><br/>So, the Lane family didn’t say anything, but tacitly supported William Lane.<br/><br/>Seeing that none of the others were speaking up, Charlotte turned her gaze towards Old Master Lane.<br/><br/>Her grandfather would understand her.<br/><br/>But upon receiving her plea for help, Old Master Lane silently shifted his gaze, lowering his head to pick at his fingernails.<br/><br/>Charlotte Lane: “.......”<br/><br/><br/><br/>All alone, she had to face the world.<br/><br/>“Now... shouldn’t everyone be considering my feelings?” Charlotte looked at them and said.<br/><br/>Everyone was silent.<br/><br/>Charles Amos sat next to her and gave her a sympathetic look.<br/><br/>“What if...I become depressed?” Charlotte continued.<br/><br/>William Lane seemed to be loosening up a bit.<br/><br/>But Kevin Clark’s eyes quickly saw through her pretense.<br/><br/>Charlotte leaned back on the sofa, pulling her hand out of Kevin’s grasp, and said, “Fine.”<br/><br/>Kevin looked at his now-empty hand, wanted to grab her hand again, but Charlotte avoided it.<br/><br/>Kevin Clark: “......”<br/><br/>On their first night at the Lane family’s house.<br/><br/>In the study room, Charlotte Lane, Kevin Clark, William Lane, and Olivia Lane were gathered together.<br/><br/>Charlotte told William her idea about solving the problem of 319.<br/><br/>After listening, William asked, “You memorized so much data?”<br/><br/>“I was worried that Edward Kirsten would blow up the laboratory,” Charlotte said, showing no emotion as she drank some weirdly sour soup that Aunt Cruz had brewed for her. “First, try this method. It’s just a guess. The experiment might not work.”<br/><br/>Kevin said, “Theoretically, it should be possible.”<br/><br/>Olivia sat next to her, watching her drink, and curiously took a sip. It was so sour that her facial features twisted.<br/><br/><br/><br/>She was going to personally take Charlotte Lane to the research institute.<br/><br/>“Mom, what are you doing?” Kevin Clark looked at the people surrounding him in three layers.<br/><br/>“You dare to try fighting them,” Natalie Wayne said calmly.<br/><br/>Charlotte Lane stood beside Natalie Wayne and cast a sympathetic look at Kevin Clark.<br/><br/><br/><br/>Kevin Clark looked at Charlotte Lane without speaking, but his eyes were pitiful, fierce, and anxious.<br/><br/>“Kevin Clark, what you’re doing is considered confinement and a restriction of personal freedom. Be careful, I may file a complaint against you and send you in,” Natalie Wayne warned.<br/><br/>Elina Clark stepped back, and while she felt sorry for her son, she dared not speak up. She tried to minimize her presence so as not to be affected.<br/><br/>However, just as she had feared, she was still involved.<br/><br/>“You and your father have the same character! That broken gene of your father’s has skipped a generation and passed on to you!” Natalie Wayne yelled.<br/><br/>Elina Clark: “......”<br/><br/>Finn Clark accidentally laughed out loud while watching the scene.<br/><br/>Elina Clark immediately hit him in the leg with a cane.<br/><br/>Finn Clark limped away from her while gasping in pain.<br/><br/>Charles Amos watched coldly from the side.<br/><br/>Kevin Clark had a dark expression. Actually, he had planned to take Charlotte Lane to the laboratory today.<br/><br/>“I don’t think you are doing this for Charlotte’s sake,” Natalie Wayne said, getting angrier. “You’ve passed on your anxiety to her, restricting her freedom and leaving her with nothing to do all day. Can she be in a good mood? Can her emotions be stable? You are the most dangerous factor! Think about it at home, don’t follow us. We’re leaving.”<br/><br/>Kevin Clark watched Charlotte Lane turn away and leave, and instinctively wanted to follow. But Calvin Stewart thought he was going to fight and immediately squeezed into the crowd, grabbing him.<br/><br/><br/><br/>Although Calvin Stewart was his sister-in-law, in Kevin Clark’s eyes, she was half a mother.<br/><br/>She had taken care of him half of the time when he was a child.<br/><br/>So naturally, Kevin Clark respected and listened to her.<br/><br/>Kevin Clark watched as Charlotte Lane disappeared from his sight.<br/><br/>Calvin Stewart let the people surrounding them back off and held Kevin Clark’s wrist, fearing that he would run away. She patiently advised, “Kevin, relax. Look at our family, with so many people. None of us have ever had any problems during childbirth.”<br/><br/>After she said this, Kevin Clark couldn’t help but glance at Finn Clark, who was rubbing his leg, and Charles Amos, who was watching him rub his leg.<br/><br/>Calvin Stewart hesitated for a moment and quietly swallowed.<br/><br/>Finn Clark paused for a moment and said, “Harris Kirsten had health issues. She had trouble getting pregnant in the first place, and although she was closely monitored throughout her pregnancy and nothing happened, but...”<br/><br/>Not finishing his sentence, Kevin Clark removed Calvin Stewart’s hand from his wrist and turned to run outside.<br/><br/>Finn Clark and Calvin Stewart looked at each other. “Did I... say something wrong?”<br/><br/>With an expression of having made matters worse, Calvin Stewart said, “Did I... end up not helping?”\t\t\t\t\t\t</div>", "images": {}, "success": true}