{"id": 605, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15047491.html", "title": "Chapter 602: 545 Updated", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 602: 545 Updated</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 602: Chapter 545 Updated<br/><br/>After the success of the Elimination 319 potion research and animal experiments, it’s time to proceed with clinical trials.<br/><br/>After the second day of the Chinese Lunar New Year, Charlotte Lane spends her mornings at home and afternoons at the Research Institute.<br/><br/>On the sixth day of the Chinese Lunar New Year, Anisa Cooper brings John Collins and Emily Hill to visit Charlotte at Clark Manor.<br/><br/>Anisa and John have brought New Year’s gifts, while Emily, who drove her car, brought a load of mother and baby supplies.<br/><br/>When they arrived at the entrance to Clark Manor, five people from the Clark family helped to bring the stuff inside.<br/><br/>Charlotte came from the North Court, and upon entering the living room, she looked at the pile and asked Emily, “Isn’t it a bit early to prepare all these things?”<br/><br/>Emily greeted Harton Clark first, then replied, “Not early. Time flies; you’ll see.”<br/><br/>Charlotte thought to herself that she couldn’t wait for time to pass quickly.<br/><br/>So that everyone would stop revolving around her.<br/><br/>And Harton could be more settled.<br/><br/>“I’ve used all these things myself, and they’re very good,” Emily said.<br/><br/><br/><br/>“Thank you, Sister Emily,” Charlotte replied.<br/><br/>Today, Elina Clark and Tom Wayne were not at home, as they went to the Theatre Garden. Finn Clark was the only one in the front courtyard.<br/><br/>It took them a while to come from the North Court. Finn had already chatted with Anisa, John, and the others for a while.<br/><br/>“Lucia, Third Master, Happy New Year,” Anisa said.<br/><br/>“Happy New Year,” Charlotte replied, touching Anisa’s face.<br/><br/>John, still wearing a mask and no hat, with the scars on his face partially hidden by his hair, greeted, “Third Master, Dean Lane, Happy New Year.”<br/><br/>“Happy New Year,” Harton replied.<br/><br/>The group sat down, with the men talking together, and the women chatting amongst themselves.<br/><br/>After sitting down, Anisa shifted closer to Charlotte and glanced at her stomach, asking, “Lucia, did the check-up say you’re having twins?”<br/><br/>Charlotte looked at her.<br/><br/>She had only told her family about the twins, but no one else.<br/><br/>Without denying it, Anisa excitedly said, “So it is! Then we bought too few supplies.”<br/><br/>Emily was also surprised, “Really? Then we should have gotten more.”<br/><br/>“See, I told you. That temple is very efficacious,” Anisa said, “I prayed there devoutly, hoping that Lucia could have a pair of dragon and phoenix twins. It will definitely be dragon and phoenix twins.”<br/><br/>Charlotte smiled and said, “Thank you for the good wishes.”<br/><br/>Emily laughed and said, “Enough, it’s all thanks to Third Master’s prowess, doesn’t concern you.”<br/><br/>Anisa pursed her lips and whispered with a smile, “I think Lucia is more amazing.”<br/><br/>Charlotte nodded, “Good taste.”<br/><br/>Harton, chatting with John, overheard their conversation and smiled.<br/><br/><br/><br/>John said, “Anisa is too outgoing; sometimes her brain can’t keep up with her mouth.”<br/><br/>“Charlotte really likes her,” Harton replied.<br/><br/>John didn’t say anything more, and they talked about Ryan Easton’s matters.<br/><br/><br/><br/>Seeing her not speaking, Charlotte continued, “Everyone’s thinking is different, and their purposes are also different. This is just my personal opinion.”<br/><br/>Hill Dawson nodded: “But how do you plan to handle the fact that you’re not Daisy Zane?”<br/><br/>Charlotte Lane looked at the Lotus Pond in the distance and paused before saying, “We’ll see.”<br/><br/>...<br/><br/>After Anisa and the others left in the morning, Charlotte did not rest either, dealing with some Research Institute affairs.<br/><br/>In the afternoon, she went to the Research Institute and didn’t return to Clark Manor until past 10 PM.<br/><br/>After washing up and lying in bed, she received a message from Holt Lawrence.<br/><br/><br/><br/>Charlotte picked up her cell phone, and before opening Holt’s message,<br/><br/>Messages from Gael Easton, Luke, James Collins, and Robinson Scott came in one after the other.<br/><br/>On the other side, Kevin Clark’s phone also rang at the bedside table.<br/><br/>Charlotte opened Holt’s message.<br/><br/>[Nana, the Dark Web Killer Rankings have been updated.]<br/><br/>Other people also informed her of this matter.<br/><br/>When Kevin finished his shower and came out, he saw the person who was supposed to be in bed, but now at the bay window, looking at her computer.<br/><br/>He walked over, rubbing the top of her hair: “What’s wrong?”<br/><br/>“The Dark Web Killer Rankings have been updated.” Charlotte clicked a few times, went in, and had a look.<br/><br/>It indeed was updated.<br/><br/>The second-place person has been replaced.<br/><br/>And the first place... is the Pavilion Master of the Hundred Demons Pavilion.<br/><br/>As for Kevin... he’s like a hidden expert, never appearing on the hitman list.<br/><br/>Because he has four top assassins under his command. Thomas Firway, Yoshua and Edward, all on the list. Only they use codenames.<br/><br/>Moreover, one of them is ranked number one.<br/><br/>Before, it used to be Nameless, now it’s the Pavilion Master of the Hundred Demons.<br/><br/>The second place is a newcomer named James Flory.<br/><br/>How long has it been since a newcomer appeared on the hitman list?<br/><br/>No wonder everyone is so excited.<br/><br/>Kevin stood behind her, looking serious, “You’re giving up sleep just for this?”<br/><br/>Having said that, he closed the computer directly and carried her back to bed.<br/><br/>Charlotte lay in bed and closed her eyes.<br/><br/>Kevin stood beside the bed, watching her.<br/><br/>Sure enough, after a while, with her eyes closed, Charlotte said, “Aren’t you curious? A sudden newcomer might affect some situations.”<br/><br/>“It won’t affect us.” Kevin stood there for a while, eventually leaning down and giving her a gentle kiss, “Get a good night’s sleep. Otherwise, next time I’ll have to tie you up and bring you back from the Research Institute.”<br/><br/>Charlotte laughed but said nothing more.\t\t\t\t\t\t</div>", "images": {}, "success": true}