{"id": 601, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15025306.html", "title": "Chapter 598: 541: Strike, Revenge, Settling Scores", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 598: 541: Strike, Revenge, Settling Scores</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 598: Chapter 541: Strike, Revenge, Settling Scores<br/><br/>During these days at the Lane residence, Charlotte Lane had been experimenting according to her ideas, but things hadn’t been going smoothly.<br/><br/>She constantly adjusted the experimental methods based on William Lane’s daily feedback. But since she wasn’t on the scene and didn’t see the experiment’s reactions directly, her adjustments were always slightly off.<br/><br/>Now that she was at the laboratory, she finally saw the experiment herself.<br/><br/>When William saw her, he wasn’t surprised. He simply said, “You’ve already handled Arthur so soon?”<br/><br/>While at the Lane residence, Charlotte had secretly persuaded William to join her side.<br/><br/>Charlotte raised her eyebrows: “Taming him was no small feat.”<br/><br/>William smiled.<br/><br/>“Brother, Aunt Wayne is in the meeting room below. Can you take care of her?” Charlotte said.<br/><br/>William was taken aback: “So that’s how you came here.”<br/><br/>“Anyway, I’m here now.”<br/><br/>William laughed: “Alright, I’ll go down and take a look. You make sure to rest, or I’ll betray you very soon.”<br/><br/><br/><br/>“Mhm.”<br/><br/>After he left, Charlotte focused on her experiments.<br/><br/>In the meeting room downstairs, Arthur North had a long talk with Natalie Wayne and then with William Lane.<br/><br/>By lunchtime, Arthur came to the laboratory to call people for lunch while Natalie had gone home.<br/><br/>After that, Arthur no longer stopped Charlotte from coming to the lab.<br/><br/>He simply moved his laboratory to the same floor as her. He ran his experiment, and as soon as he looked up, he could see Charlotte.<br/><br/>He also closely monitored her time for finishing work and eating.<br/><br/>He would take her away as soon as the time came.<br/><br/>After Charlotte protested twice, her finishing work time changed from six o’clock to eight o’clock in the evening.<br/><br/>Aunt Cruz sent their lunch and dinner.<br/><br/>Charlotte had a good appetite most of the time, occasionally feeling nauseous, but she always enjoyed whatever she ate.<br/><br/>In particular, Aunt Cruz remembered what Charlotte didn’t eat when she was younger, making her favorite and nutritious meals. Since Arthur had lost weight and hadn’t regained it, she would also make an extra portion for him every time.<br/><br/>As for William, Charlotte and Arthur’s meals were more casual—there was always enough food for him as long as they made extra.<br/><br/>At 7:50 that night, Arthur entered Charlotte’s laboratory right on time.<br/><br/><br/><br/>At 11 o’clock, they laid down to bed on time.<br/><br/>Charlotte soon fell asleep amidst her experiments and data.<br/><br/>Arthur also slept for a while but woke up in the middle of the night. After waking up, he gently and slowly felt Charlotte’s pulse.<br/><br/>After feeling her pulse and finding nothing wrong, he was about to withdraw his hand when Charlotte suddenly grabbed his hand.<br/><br/>Arthur was taken aback and looked at Charlotte.<br/><br/>Charlotte opened her eyes, her gaze softened with sleepiness as she looked at him.<br/><br/>After looking at each other for a while, Charlotte turned over and glanced at the time on the head of the bed.<br/><br/>Past two o’clock...<br/><br/>“Third Uncle, if you keep this up, you’ll have kidney deficiency.”<br/><br/>Arthur couldn’t believe what he had heard, and was speechless for a moment.<br/><br/><br/><br/>He initially thought his disguise of being normal for so many days had been exposed, but he didn’t expect this little girl to say such a thing.<br/><br/>“Seriously,” Charlotte said, “This is the same principle as staying up late. If it goes on for too long, it’ll affect you.”<br/><br/>Arthur’s eyes grew more fierce bit by bit: “Little girl, do you feel like I can’t do anything, so you’re taking advantage of me?”<br/><br/>“Yes,” Charlotte admitted readily, “Third Uncle. If you keep this up, you won’t be up to it when the time comes.”<br/><br/>“Hiss—” Seeing her getting more worked up, Arthur pinched her chin and blocked her mouth.<br/><br/>All of Charlotte’s words were stifled in an instant.<br/><br/>Since learning about her pregnancy, Arthur restrained himself. Each kiss was gentle, fearing that it might spark something and make him uncomfortable in the end.<br/><br/>So today, he just wanted Charlotte to behave.<br/><br/>After kissing her for a while, he tried to pull away.<br/><br/>But as he moved back, Charlotte raised her arm to hook his neck and followed him.<br/><br/>Arthur stopped moving, stroking her head and kissing her soothingly for a while,<br/><br/>But soon, he found a guilty little hand touching him.<br/><br/>Arthur tried to pull away twice but failed. In the end, he propped up Charlotte’s chin with his finger, forcing her to raise her head. His breath was unstable, and he hoarsely asked, “What are you doing?”<br/><br/><br/><br/>“Retaliation,” Charlotte’s eyes had a shallow layer of mist, with her beautiful phoenix eyes tempting him. Her voice was cold and hoarse, “As for why I’m taking revenge, Third Master, think carefully about what you owe between us.”<br/><br/>...\t\t\t\t\t\t</div>", "images": {}, "success": true}