{"id": 603, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15047487.html", "title": "Chapter 600: 543: A Good Year To Celebrate", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 600: 543: A Good Year To Celebrate</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 600: Chapter 543: A Good Year to Celebrate<br/><br/>It was Charlotte Lane’s first Chinese New Year returning to the Lane family since getting married. Even though she was married, she still planned to celebrate the New Year with her family.<br/><br/>For the first time in his life, Kevin Clark was in the Imperial Capital but did not celebrate the New Year with the Clark family.<br/><br/>On December 29th, Charlotte Lane stayed up all night in the laboratory.<br/><br/>Kevin Clark stayed by her side, assisting her and keeping an eye on her all the time.<br/><br/>At this crucial time, Kevin didn’t forcibly take Charlotte back home.<br/><br/>Even if he took her back, Charlotte wouldn’t rest and the situation he faced would have been even more serious.<br/><br/>With Charlotte’s determined personality, if she were provoked, many consequences would be unbearable for Kevin.<br/><br/>Moreover, just one glance at her would earn a silent rebuke before he even uttered a word.<br/><br/>Kevin Clark quietly conducted experiments and helped out.<br/><br/>In the early morning around four, Charlotte Lane took a short rest on the recliner.<br/><br/>William Lane and Kevin Clark kept watch over the experiment with their team.<br/><br/><br/><br/>Charlotte woke up at six o’clock and continued working after that.<br/><br/>Breakfast was eaten in the corridor outside the laboratory. Afterward, they returned to the laboratory.<br/><br/>At ten o’clock in the morning, Old Master Lane, accompanied by five or six people, entered the Research Institute’s Experimental Tower.<br/><br/>Harry Anderson, who had just taken office as mayor in the Imperial Capital this year, visited the Lane family on New Year’s Eve morning to pay his respects to the retired old leader.<br/><br/>Harry Anderson chatted with the old leader at the Lane family for an hour, during which the old leader talked about the children who were still working hard at the Research Institute during the New Year’s holiday.<br/><br/>Harry Anderson got the old leader’s message and suggested they visit the Research Institute.<br/><br/>Old Master Lane went to the Research Institute with Harry Anderson immediately.<br/><br/>At 10:06, Old Master Lane and Harry Anderson arrived at Charlotte Lane’s laboratory.<br/><br/>Just as they reached the entrance without knocking, a sudden burst of applause and cheers came from inside.<br/><br/>The group outside was taken aback, and both Old Master Lane and Harry Anderson exchanged glances and stood still outside the door.<br/><br/>The cheers from the laboratory continued. Inside, twenty or so people clapped, cheered, laughed, wiped their tears, and hugged each other nearby.<br/><br/>Some also took the opportunity to relax and collapsed in their chairs without moving.<br/><br/>All their excitement turned into various forms of emotional catharsis, signifying their victory.<br/><br/>This excitement was not only due to the success of their research over the last few years but also because those who had been persecuted by the 319 experiment could finally receive help and live like normal people from now on.<br/><br/><br/><br/>Kevin Clark looked at Charlotte Lane.<br/><br/>And Harry Anderson... his eyes were filled with warmth as he looked at Charlotte Lane.<br/><br/>It seemed as if his ultimate goal for visiting the Lane Family today had been achieved.<br/><br/>“Dean Lane.” Harry Anderson smiled and greeted.<br/><br/>Charlotte Lane removed her mask and put it in her protective clothing pocket, “Mayor John, it’s been a while since we last met.”<br/><br/>Old Master Lane was taken aback.<br/><br/>Both Kevin Clark and William Lane looked at Charlotte Lane.<br/><br/>“Indeed, it’s been more than two years since we last met in Truro City,” said Harry Anderson.<br/><br/>“You know each other?” Old Master Lane asked.<br/><br/>Harry Anderson nodded: “Yes.”<br/><br/><br/><br/>As for how they knew each other, neither Charlotte Lane nor Harry Anderson offered any explanations.<br/><br/>But it was clear to see that Harry Anderson had a layer of affection for Charlotte Lane, as if treating her like his own daughter. The warmth and pride in his eyes couldn’t be concealed.<br/><br/>In order not to delay everyone’s return home for the new year, Harry Anderson didn’t stay long and went to the office with Charlotte Lane and the others.<br/><br/>After a brief inquiry into the institute’s situation and learning that Charlotte Lane hadn’t rested much the night before, everyone hurried back home.<br/><br/>On the way back, William Lane asked, “Wasn’t Harry Anderson supposed to transfer here the year before last? Why was it delayed for a year?”<br/><br/>“His son’s actions affected him, delaying it for a year,” Kevin Clark added a cushion behind Charlotte Lane’s waist, “Amelia Miles wanted to end their marriage, but John Anderson didn’t agree initially, so Amelia Miles reported Maple Elite Entertainment. Maple Elite Entertainment was investigated, and Harry Anderson was implicated.”<br/><br/>Charlotte Lane listened to his explanation, closed her eyes, and said nothing.<br/><br/>Old Master Lane could deeply relate to such matters.<br/><br/>“Now that he’s here, there won’t be any more issues for Maple Elite Entertainment,” said William Lane.<br/><br/>“With Harry Anderson’s personality, John Anderson wouldn’t dare to let anything happen to Maple Elite Entertainment,” Kevin Clark said, “It’s just that someone intentionally set them up. At that time, Amelia Miles was the person closest to John Anderson, so it was easy for her to sabotage the company. However... ”<br/><br/>“What?” William Lane asked.<br/><br/>“However, someone secretly helped Maple Elite Entertainment and resolved the crisis for them,” Kevin Clark looked at Charlotte Lane, “I was also paying attention to this matter at the time. But it’s strange how no one could find out anything about the person behind it. Isn’t it strange?”<br/><br/>William Lane and Old Master Lane both followed Kevin Clark’s gaze to look at Charlotte Lane.<br/><br/><br/><br/>Charlotte Lane maintained a calm expression, kept her eyes closed, and after a while, turned her head towards the window, leaving them with the back of her head.<br/><br/>Kevin Clark laughed, reached out, and touched the top of her hair.\t\t\t\t\t\t</div>", "images": {}, "success": true}