{"id": 606, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15047493.html", "title": "Chapter 603: 546: Unknown Hair", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 603: 546: Unknown Hair</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 603: Chapter 546: Unknown Hair<br/><br/>In March, the potion to eliminate 319 was named Rebirth. The Phase III clinical trial ended, entering the production stage. After that, they still needed to wait for review, authoritative department inspection...<br/><br/>Charlotte Lane’s work also became a bit easier, at least she could get off work on time now.<br/><br/>At this stage, besides Rebirth production matters, Charlotte Lane’s team was researching the things brought out from Edward’s Laboratory.<br/><br/>Although they couldn’t achieve the stage of immortality, both Drunken Life Grass and 319 had significant research value.<br/><br/>If used well, they would be of great help to some major diseases and complicated cases.<br/><br/>The things Kingsley Family researched for three generations were of great significance to human beings, but they didn’t use them properly. In order to achieve their own goals, they used human lives for experiments.<br/><br/>Charlotte was more than five months pregnant with twins, so her belly was bigger than a single child’s.<br/><br/>She was definitely tired, and her movements were not as agile as before. However, since she was only doing experiments now and didn’t have to travel between various continents to fight, it didn’t have much impact.<br/><br/>Harton Clark also hardly left her side.<br/><br/>From the time she found out she was pregnant, the two had been almost always together.<br/><br/>Harton Clark didn’t go anywhere, wherever Charlotte went, he would follow.<br/><br/><br/><br/>So, he hadn’t been to the Easton Group for a long time.<br/><br/>All matters were dealt with remotely.<br/><br/>Only when he had no choice but to go, Harton would go to Easton Group.<br/><br/>However, he would only go to Easton after making sure Charlotte was well taken care of every day.<br/><br/>Furthermore, he arranged for Thomas Firway, Aunt Cruz, William Lane, and Robinson Scott to watch over her at any time. Even then, he wasn’t very reassured and called to inquire every day.<br/><br/>“It feels so good to get money every day without doing anything,” Robinson Scott said while accompanying Charlotte in the laboratory.<br/><br/>“When haven’t you gotten money without doing anything?” Charlotte asked.<br/><br/>“It’s not the same. The money I had before came from my own industries,” Robinson said, “Now, this money comes without any effort. Brother Nine, your Third Master is incredible, giving me 10 million for accompanying you for one day. I really want to accompany you for the rest of my life.”<br/><br/>Looking at the experimental data, Charlotte said, “You can have half.”<br/><br/>“Brother Nine, why are you saving him money?” Robinson didn’t go near the experimental table and sat a little further away, “The Clarks have a lot of money, even if I really accompany you for the rest of my life, he can afford it.”<br/><br/>“His money has nothing to do with me splitting half with you, does it?” Charlotte said calmly, “Anyway, the money divided is his money.”<br/><br/>Robinson laughed, “It seems like there’s really nothing wrong with what you said. Harton Clark is already yours; Brother Nine wouldn’t even care about this amount of money.”<br/><br/>“I think every penny is good,” Charlotte said.<br/><br/>“That’s true,” Robinson agreed, “You’re a money-lover.”<br/><br/><br/><br/>The three adults suddenly exchanged glances.<br/><br/>Charlotte Lane looked at Charles Amos whose ears turned red as he lowered his head and raised the corner of her mouth, “I was wondering why on the first day of school, he had a steamed bun face as if he was going to blow up the school, but he was so active the next day.”<br/><br/>Harton Clark enjoyed the fun, and seeing Charles Amos’ little figure burying his head, he laughed so hard that his shoulders were shaking.<br/><br/>Charlotte Lane saw Charles Amos’ ears turn even redder, and she said nothing. She rubbed his hair’s top and said to Kevin Clark, “Sign him up for swimming classes.”<br/><br/>Kevin Clark raised his eyebrows, “Hmm.”<br/><br/>“What for?” asked Charles Amos softly.<br/><br/>“To save your wife when you grow up,” Charlotte Lane laughed.<br/><br/>Charles Amos understood and lowered his head, whispering, “I will save you first.”<br/><br/>Charlotte Lane rubbed his head again and said, “First of all...I can swim. Secondly...I have your Dad, Kevin.”<br/><br/><br/><br/>“Lastly, I won’t let your mom fall into the water,” Kevin Clark said.<br/><br/>Charlotte Lane looked at him and chuckled, “Impressive.”<br/><br/>Kevin Clark also smiled.<br/><br/>Just then, Aunt called them to eat. Charlotte Lane rubbed Charles Amos’ burning face again, “She’s quite pretty, and you have good taste. Go wash your hands and eat.”<br/><br/>Harton Clark stopped laughing and took him to wash his hands.<br/><br/>Charlotte Lane went to the other side’s washroom, and as soon as she entered, Kevin Clark followed her in.<br/><br/>“What are you doing?” Charlotte Lane glanced at him while washing her hands.<br/><br/>Kevin Clark waited for her to finish washing, then dried her hands for her and gently kissed her cheek, “Don’t you miss me?”<br/><br/>“No,” Charlotte Lane answered quickly.<br/><br/>Kevin Clark’s words had just fallen, and she had already answered.<br/><br/>“Tsk,” Kevin Clark held her chin and gently bit her lips, “Why are you so annoying?”<br/><br/>Charlotte Lane raised her eyebrows, and just as she was about to speak, she suddenly saw the hair on his shoulder.<br/><br/>She raised her hand and took the hair down. Upon leaving the black shirt, she realized that the hair was red and wavy.<br/><br/><br/><br/>And there was more than one strand.<br/><br/>Charlotte Lane took another strand down. Holding two strands of hair in her hand, she looked at Kevin Clark.<br/><br/>Under the contrast of Charlotte Lane’s fair wrist, the two red hair strands appeared particularly eye-catching.<br/><br/>“Kevin Clark.”\t\t\t\t\t\t</div>", "images": {}, "success": true}