{"id": 607, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15047495.html", "title": "Chapter 604: 547: Not Fragrant At All", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 604: 547: Not Fragrant At All</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 604: Chapter 547: Not Fragrant At All<br/><br/>After Kevin Clark came back, he took off his coat in the entryway, and the hair was on his shirt. He had no idea when it got there.<br/><br/>As he listened to Charlotte Lane calling his name softly, he broke out in a cold sweat in an instant.<br/><br/>“Little girl. I, I don’t know,” Kevin Clark seemed to be afraid that Charlotte Lane would leave, so he held her other hand first. “I’ve been in the office all day today, and I didn’t see anyone besides Juan Wright. Really. If you don’t believe me, go check Ryan Easton’s surveillance.”<br/><br/>Charlotte Lane looked at him without speaking.<br/><br/>“I really don’t know how there could be hair,” Kevin Clark’s expression at that moment was the epitome of helplessness, nervousness, and fear.<br/><br/>His ears roared, and the view in front of him shrank, until he could only see Charlotte Lane.<br/><br/>The restroom was spacious, but he felt the space was compressing, the surrounding air was gradually thinning, making it difficult for him to breathe.<br/><br/>“Don’t be angry, don’t get excited. Your health is important,” Kevin Clark said nervously. “Or hit me to vent your anger first.”<br/><br/>Charlotte Lane looked at him for a moment, then threw the hair in her hand into the trash can nearby and washed her hands again.<br/><br/>Kevin Clark stood beside her, not daring to breathe, with his hands sweating and his mind somewhat short-circuited.<br/><br/>He just stared blankly at her as she washed her hands.<br/><br/><br/><br/>After Charlotte Lane finished washing her hands, she dried them and looked at him again: “Kevin Clark, if you dare to do something that betrays me, I’ll make you the housekeeper in Clark Manor.”<br/><br/>“I won’t,” Kevin Clark looked at her seriously.<br/><br/>Charlotte Lane raised her eyebrows and looked at him as well, saying: “I trust you.”<br/><br/>Kevin Clark’s muscles relaxed a bit, followed by feeling drained of all energy, his fingertips trembling: “I’m sorry.”<br/><br/>Charlotte Lane held his hand: “Let’s go have dinner.”<br/><br/>...<br/><br/>Kevin Clark didn’t eat much for dinner, and after finishing, he went back to the North Court.<br/><br/>Charlotte Lane didn’t go with him, as she and Natalie Wayne had a chat in the front courtyard. So Kevin Clark went back first.<br/><br/>On the way back, Kevin Clark only wore a shirt, and threw his coat into the trash can outside. He called Juan Wright and asked him who he had met when he took his clothes.<br/><br/>Juan Wright thought for a moment and said: “Morgan Mia, we shared an elevator. She left from the first floor, and I went to the parking lot.”<br/><br/>“Why was she at the company?” Kevin Clark asked.<br/><br/>“She was hired by Human Resources,” Juan Wright said.<br/><br/>Kevin Clark wouldn’t interfere in the recruitment of non-important positions, and the Imperial Capital Branch had a manager who was specifically responsible for operations.<br/><br/>Kevin Clark was mostly in charge of the technical part.<br/><br/>He would only handle major events.<br/><br/>“Did she dye her hair?” Kevin Clark asked.<br/><br/>He hadn’t seen Morgan Mia at Clark Manor for quite some time, and he didn’t know if she had moved out or if she was still there but just hadn’t come across her.<br/><br/><br/><br/>...<br/><br/>Charlotte Lane didn’t ask about the hair incident afterwards.<br/><br/>She even gradually forgot about it.<br/><br/><br/><br/>In April, during Charlotte Lane’s prenatal check-up, a minor problem was found.<br/><br/>Then she was ordered to rest at home for a few days.<br/><br/>Since Ryan Easton was busy during this time, Kevin Clark couldn’t leave him.<br/><br/>To make it easier to protect Charlotte Lane, Kevin Clark transferred Alfie Ward from the M Continent and had him accompany her at home in the meantime.<br/><br/>When going out, Alfie Ward and Thomas Firway would protect her together.<br/><br/>After her nap, Charlotte Lane was bored. So she and Alfie Ward walked around Clark Manor.<br/><br/>When the two of them climbed the arch bridge, Charlotte Lane saw Charles Amos running over.<br/><br/>She grabbed him and said, “What day is today?”<br/><br/>Charles Amos looked at her and said, “Tuesday.”<br/><br/>“So... why are you at home at this time?”<br/><br/>Charles Amos’s small hand touched her belly, then laughed: “To tell you... it may not be good for fetal education.”<br/><br/>“Skipping class, Charles Amos, you have a promising future,” Charlotte Lane whispered.<br/><br/>“Hush,” Charles Amos’s index finger was pressed against his lips, “Don’t let my younger brothers and sisters hear. Just this once, I promise not to do it again. I have an urgent matter.”<br/><br/><br/><br/>As Charles Amos spoke, he gently let go of Charlotte Lane’s hand and ran off, shouting, “There won’t be a next time!”<br/><br/>Charlotte Lane watched his retreating figure, sneered, and immediately called Finn Clark to block him.<br/><br/>As she made the call, she watched Charles Amos run along the riverside under the bridge, telling Finn Clark where he might be going.<br/><br/>As she watched, a figure entered her line of sight.<br/><br/>Morgan Mia, whom she hadn’t seen for a long time.<br/><br/>With a head of red hair.<br/><br/>Charlotte Lane saw her red hair, and her eyes narrowed.<br/><br/>The next moment, the hurried Charles Amos and Morgan Mia collided.<br/><br/>Charles Amos immediately plunged towards the river.<br/><br/>Alfie Ward saw that Morgan Mia deliberately collided with Charles Amos and gave him a push.<br/><br/>Although it was subtle, she still saw it.<br/><br/>When Charlotte Lane saw Charles Amos falling, her pupils shrank, and she immediately walked towards him.<br/><br/>“Sister-in-law, slow down,” Alfie Ward caught up with her.\t\t\t\t\t\t</div>", "images": {}, "success": true}