{"id": 602, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15047484.html", "title": "Chapter 599: 542: Caring Too Much…", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 599: 542: Caring Too Much…</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 599: Chapter 542: Caring Too Much...<br/><br/>They had so many accounts to settle between them.<br/><br/>Kevin Clark held Charlotte Lane’s chin for a good while, and finally lifted the quilt to prepare to go to the restroom: “You go to sleep first.”<br/><br/>Charlotte Lane raised her eyebrows and smiled, then grabbed Kevin’s hand as he was getting up.<br/><br/>She pulled him back onto the bed in one go.<br/><br/>Kevin Clark looked at this mischievous person.<br/><br/>In the darkness, he could see the red corners of her eyes, like a fairy that could eat people at any time.<br/><br/>But the fairy had been eating vegetarian recently.<br/><br/>Charlotte Lane’s eyes were full of smiles as she looked at him: “Let me have an ice cream tomorrow, and I’ll let you go.”<br/><br/>Kevin Clark suddenly narrowed his eyes, the fairy suddenly wanted a half-open feast.<br/><br/>He returned to the bed, holding her head with his hands and kissed her.<br/><br/>This kiss was heavy with passion.<br/><br/><br/><br/>Charlotte Lane’s hand clutched the bathrobe on his shoulder.<br/><br/>But soon, Kevin Clark grabbed her hand and took it off his shoulder.<br/><br/>After pinching it twice in his hand, he guided her hand downward.<br/><br/>“Madam, you should check me regularly to see if I’m really empty,” Kevin Clark whispered in her ear.<br/><br/>Charlotte Lane: “......”<br/><br/>....<br/><br/>When Charlotte Lane was carried to the restroom to wash her hands, her wrists were sore and numb.<br/><br/>Her back was also covered in a thin layer of sweat.<br/><br/>Kevin Clark took off his slippers and let her put them on, stepping barefoot on the floor.<br/><br/>He helped her wash her hands while kissing her ear: “Are you behaving now?”<br/><br/>Charlotte Lane didn’t answer him and instead splashed water on his face with a quick motion.<br/><br/>“Still got a temper?” Kevin Clark dried her hands and asked, “Are you sleepy?”<br/><br/>“Not bad.”<br/><br/>“Take a bath?” Kevin Clark started to be restless as he spoke.<br/><br/>Feeling his fingers, Charlotte Lane was slightly stunned and instinctively leaned into his embrace. Her back stiffened for a moment: “Kevin Clark.”<br/><br/>Kevin Clark saw her ears quickly turn red through the mirror, and a gentle smile appeared in his eyes: “Wet. You’re sweating on your back too. Take a shower.”<br/><br/>Charlotte Lane stiffened for a while, then her fingertips curled up.<br/><br/>She grabbed Kevin Clark’s hand, first pushed and then kicked him out of the restroom.<br/><br/><br/><br/>“The film premiere on December 25...”<br/><br/>Before Morris could finish speaking, Charlotte interrupted, “I can’t go.”<br/><br/><br/><br/>“Why?” Morris was puzzled. “You’re the lead actress. You can’t just not show up at the premiere.”<br/><br/>“What about George Dunn?”<br/><br/>“You are the Female Lead,” Morris said.<br/><br/>“I’m pregnant,” Charlotte reminded him.<br/><br/>There was a pause: “Didn’t the prenatal check-ups show that everything was fine?”<br/><br/>“Yes, they are.” Charlotte said, “But I can’t work.”<br/><br/>“Huh?” Morris was silent for a moment: “What are you doing now?”<br/><br/>“In the Research Institute.”<br/><br/>“......” Morris gritted his teeth and said, “Isn’t working at the Research Institute still work?”<br/><br/>Amused by how frustrated Morris was, Charlotte laughed and then explained, “The Research Institute is quite busy lately, and there’s a lot to do at the end of the year. You and George will have to take care of the premiere.”<br/><br/>Morris was silent again before he spoke, “It’s kind of weird when you suddenly talk sense. I feel a bit guilty for raising my voice just now.”<br/><br/>“That was the point,” Charlotte said without mercy.<br/><br/>Morris: “......I don’t need to talk to you anymore!”<br/><br/><br/><br/>“Hang up, I’m busy.”<br/><br/>Charlotte didn’t show up at the premiere, and the next day she was criticized on hot search.<br/><br/>They said she was unprofessional, that she didn’t promote her show, that she had become arrogant, and now she looked down on her acting career.<br/><br/>They said once she became the Eldest Miss Lane, she forgot her old friends, and even Morris and George Dunn couldn’t get her to budge.<br/><br/>They claimed she used Morris and George for fame, and once she got it, she discarded them and pretended not to know them anymore.<br/><br/>Someone who claimed to be a close source even said that Morris and George went to the Lane Family to visit Charlotte, but they were driven out of the house before they could even enter. The gifts they brought were thrown out as well. After the gifts were scattered on the ground, the two had to clean up the mess themselves.<br/><br/>When Morris and George saw this post, they couldn’t help but laugh.<br/><br/>Just blackening Charlotte was one thing, but why did they have to make the two of them look so pathetic?<br/><br/>Reading the text alone made people feel heartbroken.<br/><br/>There were also some people who focused on the fact that Charlotte was not Daisy Zane. They asked why Charlotte wouldn’t come out and respond.<br/><br/>Holt Lawrence deliberately didn’t control the online messages, instead collecting and recording every ID that had slandered her. Then, he would pay them back one by one.<br/><br/>At this time, Charlotte was busy in the laboratory.<br/><br/>Progress had been made in the experiment, and it was at a critical moment. If successful... maybe before the New Year, they could research an elixir that could completely eliminate the effects of 319.<br/><br/>So Charlotte had been watching the experiment, and the entire laboratory was in a tense state...\t\t\t\t\t\t</div>", "images": {}, "success": true}