{"id": 609, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15047499.html", "title": "Chapter 606: 549: Can’T Count On This Father", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 606: 549: Can’T Count On This Father</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 606: Chapter 549: Can’t Count on This Father<br/><br/>Kevin Clark quickly learned about the incident at Clark Manor while he was at Ryan Easton, and he immediately left everything behind and returned home.<br/><br/>When he arrived home, he stepped into the Front Hall, and everyone there was startled.<br/><br/>Today, Theo Clark’s family was also there, and when they saw him return, no one spoke for a while.<br/><br/>Kevin Clark glanced around the Front Hall and then asked, “Where is she?”<br/><br/>“Why did you come back at this time?” Natalie Wayne asked.<br/><br/>Kevin Clark looked at her, his cold expression softened slightly, but he did not answer her.<br/><br/>Natalie Wayne cleared her throat and said, “She was sent to the hospital.”<br/><br/>In fact, after Natalie Wayne had given Morgan Mia a few injections and had her take some medicine, she would be fine.<br/><br/>But in order to save her life, Natalie Wayne had her sent to the hospital immediately after administering the injections.<br/><br/>Otherwise, his son would definitely kill someone when he returned home.<br/><br/>As soon as Morgan Mia was sent to the hospital, Kevin Clark arrived home.<br/><br/><br/><br/>Everyone in the Living Room was afraid that Kevin Clark would lose his temper.<br/><br/>Kevin Clark said nothing more and turned to leave.<br/><br/>As soon as he left, everyone in the Front Hall breathed a sigh of relief.<br/><br/>“Will Kevin go to the hospital now?” Calvin Stewart asked.<br/><br/>“He will definitely go to the North Court to see Lila Campbell first,” replied Natalie Wayne.<br/><br/>“There must have been a reason why Kevin suddenly expelled Morgan Mia from Ryan Easton and did not allow her to stay at home,” Elina Clark said. “Today, she suddenly pushed Casey Cannon and hit Megan Cruz. Megan Cruz’s status in the Lane Family and Lila’s heart are well-known. It’s like slapping Madam Lane in the face. Lila spared her life just to save face for our family.”<br/><br/>“I know,” Natalie Wayne replied.<br/><br/>“Let’s stay out of the young people’s affairs,” Elina added. “We’re not directly involved, so we don’t know the whole story. Let’s not ruin the harmony of the family because of it.”<br/><br/>“I understand,” Natalie Wayne replied.<br/><br/>...<br/><br/>Kevin Clark drove directly from Clark Manor to the North Court via the asphalt road.<br/><br/>When he arrived at the North Court, he found Lila Campbell in the study.<br/><br/>He entered the room.<br/><br/>Lila Campbell was sitting behind the desk, reading a book. Seeing him rush back, she raised her eyebrow and asked, “Who delivered the news so quickly?”<br/><br/>“Are you feeling unwell?” Kevin Clark walked over to her.<br/><br/>“No,” Lila Campbell said, “I felt quite relieved after hitting someone.”<br/><br/>Kevin Clark grabbed her wrist, checking her pulse.<br/><br/>When he finished, Lila Campbell said, “Aunt Wayne came over and checked on me. I’m fine.”<br/><br/>Seeing that her condition and mood were good, the gloom in Kevin Clark’s eyes finally dissipated, and he sighed in relief. He touched her face, bent over, and kissed her. Then he caught a glimpse of a shadow out of the corner of his eye.<br/><br/><br/><br/>He stood up and looked toward the entrance.<br/><br/><br/><br/>Kevin continued, “Mom, some people take advantage of your kindness and see it as their own ATM machine, a support for their capricious behavior.”<br/><br/>Still, Natalie did not speak.<br/><br/>“If her family comes to ask for her, let them meet with me,” Kevin said, “I have to go, I am a bit busy.”<br/><br/>Natalie responded softly, and then hung up the phone.<br/><br/>...<br/><br/>By May, Charlotte Lane had completed her half-year term as Dean. The families gathered again to cast their votes, and this time, the result was unanimous approval.<br/><br/>Charlotte Lane now held the position of Dean firmly.<br/><br/>After the votes were cast, the Rebirth Potion went on sale, available for free to all those who had been harmed by the 319 incident.<br/><br/>With a 95% success rate, only a small proportion could not be cured due to pre-existing organ problems, requiring further treatment and medication in a hospital.<br/><br/>After the launch, the production process of Rebirth and the list of participating researchers were disclosed.<br/><br/><br/><br/>The research had started years ago, from the first time 319 was discovered.<br/><br/>From then until now, everything had been carefully documented with a clear timeline.<br/><br/>Once this information was made public,<br/><br/>those who had previously criticized Charlotte online now had to face the painful slap of the truth.<br/><br/>While they were exposing Charlotte online, she was busy saving lives by making drugs, even while being pregnant.<br/><br/>Apologies flooded the internet once again.<br/><br/>This time, however, they were not so easy to let go.<br/><br/>Anyone who had ever posted derogatory comments about Charlotte online had their computers paralyzed and cellphones rendered unusable except for making calls.<br/><br/>Whenever they wanted to use any app, they had to input a specific sentence.<br/><br/>The input template read: [I am trash, I am a bastard, I am a big dumbass, I am not human. Charlotte Lane is the most beautiful and kind-hearted person in the world.]<br/><br/>Once they entered this sentence, it was automatically posted to their Facebook accounts and could not be deleted.<br/><br/>Only then would their cellphones return to normal functioning.<br/><br/>Worse yet, their phones would suddenly become paralyzed at random times each day, forcing them to enter the sentence and post it on Facebook again.<br/><br/>As people used their phones, they never knew when they would have to start cursing themselves.<br/><br/>Changing phones or SIM cards did not help.<br/><br/>The self-derogatory phrases would be updated every day, while the praise for Charlotte remained the same.<br/><br/>Many people called the police, but the hackers were too skilled to be caught.<br/><br/>When the police questioned Charlotte at Clark Manor, she denied any involvement.<br/><br/>Eventually, they decided some crazy fan must have been responsible.<br/><br/>Many people broke down over time, experiencing firsthand how it felt to be cursed at, especially by themselves.<br/><br/>Each day, they insulted themselves in new and creative ways.<br/><br/>Gradually, many of them began to offer sincere apologies...\t\t\t\t\t\t</div>", "images": {}, "success": true}