{"id": 604, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15047489.html", "title": "Chapter 601: 544: Bullying A Child", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 601: 544: Bullying A Child</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 601: Chapter 544: Bullying a Child<br/><br/>Kevin Clark and Charlotte Lane celebrated Chinese New Year at Lane Family’s home, and Charles Amos, who abandoned Finn Clark, also came to the Lane Family’s home.<br/><br/>On the first day of the Chinese lunar year, the younger generation received red envelopes.<br/><br/>The elders all received gifts.<br/><br/>As usual, Charlotte also received a gift from Charles Amos. This year it was a valuable brooch, and it’s unknown who he had bought it from.<br/><br/>It seems that Charles Amos’ funds will be tight for the next few months.<br/><br/>So, in this situation... Charlotte added insult to injury by taking all of his New Year’s money, as long as it’s cash.<br/><br/>She claimed that she would help him save it and give it back to him when he grows up.<br/><br/>Charles Amos stared with a pair of innocent big eyes, clearly saying: Do you think I believe you?<br/><br/>This year, Kevin Clark gave her a diamond bracelet with a total of twelve diamonds about one centimeter in diameter inlaid in series.<br/><br/>It’s almost the same as the diamond ring on her left hand, both are transparent ice blue.<br/><br/>Kevin Clark seemed to like her wearing ice-blue items.<br/><br/><br/><br/>Old Master Lane also gave Charlotte a longevity lock.<br/><br/>He said, “I hope it will bless Charlotte with peace and smooth sailing in the future.”<br/><br/>When William Lane was injured, Charlotte returned to the Lane Family.<br/><br/>Only that day, she saw the longevity lock she had been wearing since childhood held in the old master’s hand.<br/><br/>After that, she never saw it again.<br/><br/>Until Old Master Lane gave it to her again today.<br/><br/>In the evening, back in the room, Kevin Clark intertwined the chain of the longevity lock and the red rope around Charlotte’s neck, with the lock and the heart-shaped stone hanging together.<br/><br/>Charlotte heard Kevin Clark say that when she fell into the sea, Lane Clan sent many people to search for her. After a long time, they only found this longevity lock.<br/><br/>A month after she disappeared, the old master had a severe illness.<br/><br/>After that, he always held her longevity lock, looking forward to her return day by day.<br/><br/>“How come you look so different from when you were a child?” Kevin Clark said while glancing at the photo on the bedside table.<br/><br/>“If I looked the same as I did when I was a child, would Third Uncle be attracted to me when we first met in Truro City?” Charlotte supported her temples, leaning to watch him weave the necklace rope for her.<br/><br/>“You were very beautiful even when you were a child,” Kevin Clark said, “Also, there’s no Third Uncle here.”<br/><br/>“So that means there would be,” Charlotte’s eyes sparkled with a smile, “Uncle and niece...”<br/><br/>Kevin Clark suddenly looked up at her.<br/><br/>The fierceness in his eyes made Charlotte pause.<br/><br/>Kevin Clark said, “All I know is that little girl named Charlotte always called me Brother Arthur. Don’t know who your uncle is, stop recognizing relatives here.”<br/><br/>Charlotte laughed, her stunning beauty even when smiling brought a somewhat chilly feeling.<br/><br/><br/><br/>Her Teacher, who taught her traditional medicine and acupuncture, treated her very well, like his own daughter.<br/><br/>Her Teacher didn’t have any children of his own, only one apprentice, Natalie, and an adopted son.<br/><br/><br/><br/>This Morgan Mia was his adopted son’s granddaughter.<br/><br/>She was 27 years old and had come to Imperial Capital to develop her career.<br/><br/>She took the opportunity to pay a New Year’s visit to the Clark family and stayed here for a while.<br/><br/>Morgan looked clean and pure, with an obedient appearance. She smiled, and her eyes turned into crescents, “I know. I’ve seen her online. She’s my little aunt.”<br/><br/>“Hello,” Charlotte greeted politely.<br/><br/>“Hello,” Morgan looked at Arthur North and continued, “I haven’t wished my little uncle a happy new year. Uncle, Happy New Year.”<br/><br/>Arthur responded.<br/><br/>After chatting with them for a while, Morgan went to the restaurant to eat.<br/><br/>When Morgan entered the restaurant, Natalie asked Arthur, “Can you arrange for her to work at Ryan Easton after the New Year? Her major matches the one at your company.”<br/><br/>Arthur toyed with the ring on Charlotte’s hand, “Ryan Easton doesn’t hire people casually. I do have some vacancies in D Continent, I can arrange something for her there.”<br/><br/>“Wouldn’t D Continent be too chaotic?” Natalie Wayne asked, “She’s a young girl.”<br/><br/>Arthur didn’t speak, focusing on the ring instead.<br/><br/>After graduating from university, Morgan hadn’t worked and her family didn’t know what she was doing. For most of the time, she wasn’t home.<br/><br/><br/><br/>Still, every year, she would visit Clark Manor to pay her respects during the New Year.<br/><br/>This year, she finally told her family that she wanted to come to Imperial Capital to develop her career, find a job, and settle down.<br/><br/>Due to her Teacher’s relationship, Natalie had always been supportive of the Mia family.<br/><br/>This time when Morgan came to Imperial Capital, Natalie asked her what she wanted to do, but she said she hadn’t thought about it yet.<br/><br/>So Natalie had to help her find suitable work.<br/><br/>Seeing that Arthur had backed off, Natalie looked at Theo Clark, knowing it was useless to count on him, and then glanced at Finn Clark.<br/><br/>Finn said, “How about working part-time at my coffee shop?”<br/><br/>Natalie ignored him and looked at Hugo Clark.<br/><br/>Hugo hesitated for a moment and said, “I’ll find a position for her in the family company.”<br/><br/>“Hugo is reliable,” Natalie said with satisfaction, “This year, I will definitely find a wife for you.”<br/><br/>Hugo didn’t say anything.<br/><br/>His claim of having someone he liked wasn’t valid anymore.<br/><br/>No one believed him, thinking it was just an excuse.<br/><br/>Dragging Arthur into it would make everyone believe it was a joint excuse between the uncle and nephew.\t\t\t\t\t\t</div>", "images": {}, "success": true}