{"id": 616, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15047513.html", "title": "Chapter 613: 556: Thank You", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 613: 556: Thank You</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 613: Chapter 556: Thank you<br/><br/>As the full moon banquet was nearing its end, security from Doomsday Hotel went to find Charlotte Lane, as there was a woman outside who wanted to see her.<br/><br/>“What’s her name?” Kevin Clark asked.<br/><br/>“She said her surname is Zheng,” the security guard said. “She’s been lingering at the hotel entrance for a while. Our staff approached her, and she asked to see the young lady.”<br/><br/>Charlotte Lane and Kevin Clark exchanged glances: “I’ll take a look.”<br/><br/>“I’ll accompany you.”<br/><br/>Both went to the entrance.<br/><br/>The woman was standing with her back to the entrance. When she heard the footsteps, she turned to look at them.<br/><br/>After turning around, Charlotte Lane and Kevin Clark stopped to look at her.<br/><br/>The woman was wearing a long dress, with long hair over her shoulders, and a blue flower hairpin on her right ear. Upon seeing them, she smiled and said, “It’s been a long time since I last saw you two.”<br/><br/>Charlotte Lane and Kevin Clark looked at the woman in front of them.<br/><br/>Although they didn’t show it on their faces, both were somewhat nostalgic in their hearts.<br/><br/><br/><br/>It was the woman who was used 319 in the Spotlight Gala years ago and was bullied by those people.<br/><br/>At that time, Charlotte Lane promised her that she would definitely save her.<br/><br/>Charlotte Lane didn’t break her promise.<br/><br/>“Long time no see,” said Charlotte Lane.<br/><br/>Miss Sawyer said, “I really wanted to see you long before, but at that time you were pregnant, and I didn’t know where to find you. Today, I saw the news online and thought I’d try my luck here.”<br/><br/>“Let’s go upstairs and sit down,” said Charlotte Lane.<br/><br/>Miss Sawyer nodded.<br/><br/>They went upstairs and found a quiet place, and Kevin Clark left.<br/><br/>Sitting across from each other, Charlotte Lane asked, “Has your body fully recovered?”<br/><br/>“Yes,” Miss Sawyer said, “It’s completely healed. Thank you.”<br/><br/>Charlotte Lane shook her head.<br/><br/>“I really want to thank you,” Miss Sawyer said. “At that time, I didn’t want to live anymore, but you pulled me back. That’s why I can sit here now and still see the countless sceneries of this world.”<br/><br/>“There’s nothing you can’t get through,” Charlotte Lane said. “As long as you stay alive, things will always get better.”<br/><br/>“I believe that now,” Miss Sawyer said. “When I think back to what happened before, it feels like a dream. After waking up, it’s just a dream. Compared to my life, it doesn’t even account for a fraction of it. My good life shouldn’t be ruined by this little thing.”<br/><br/>Charlotte Lane looked at her, listening to her words, her fingers rubbing the table.<br/><br/><br/><br/>Charlotte Lane glanced at the slender fingers around Luke’s arm and asked, “Can we come in?”<br/><br/>“Yes,” Luke opened the door a little wider.<br/><br/>Only then did Kevin Clark see the girl grabbing Luke’s arm.<br/><br/>He was taken aback.<br/><br/>The girl’s appearance was very similar to Charlotte Lane’s.<br/><br/>She wasn’t as stunning as Charlotte Lane, nor did she have the cold demeanor.<br/><br/>The girl looked at them, her grip on Luke’s arm tightened, and her eyes seemed a little frightened.<br/><br/><br/><br/>Yet she just pursed her lips tightly, standing next to Luke and watching them without any excessive reaction.<br/><br/>Charlotte Lane glanced at her, held back her gaze for fear of scaring her.<br/><br/>It was indeed similar, even she herself thought they were alike.<br/><br/>It was because they looked alike that Edward Kirsten abducted and drove her insane.<br/><br/>Once inside the room, Kevin Clark and Charlotte Lane sat on the sofa.<br/><br/>Meanwhile, Luke took the girl back to the room.<br/><br/>Charlotte Lane sat thoughtfully as she heard Luke say, “Be good and stay here, count to one hundred and I’ll come back.”<br/><br/>“Okay,” the girl’s voice was very gentle and soft.<br/><br/>But, as soon as Luke turned around and was about to close the door, the girl suddenly spoke up quickly, “One hundred, I’m done counting.”<br/><br/>Luke paused as he was closing the door: “......”<br/><br/>Outside, Charlotte Lane raised her eyebrows.<br/><br/>Kevin Clark furrowed his brows, feeling something was off.<br/><br/>“Be good, I have something to discuss,” Luke said patiently. “I’ll take you to have cotton candy later.”<br/><br/><br/><br/>“Count to one hundred?” The girl asked.<br/><br/>“Count to three hundred,” Luke suddenly changed his mind.<br/><br/>The girl looked at him without saying a word.<br/><br/>“Three hundred. I’ll buy you two.” Luke added.<br/><br/>“Okay,” the girl agreed again.<br/><br/>That was when Luke successfully closed the door.\t\t\t\t\t\t</div>", "images": {}, "success": true}