{"id": 612, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15047505.html", "title": "Chapter 609 - 552: A Lifetime Promise", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 609 - 552: A Lifetime Promise</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 609: Chapter 552: A Lifetime Promise<br/><br/>Sophie Ortiz and Natalie Wayne each held a child in their arms.<br/><br/>Everyone gathered around, but there were too many people, so some of them couldn’t see.<br/><br/>Gael Easton hurriedly rushed over, pushing his way to the front, looking at the two children: “This Miss...no, Charlotte, she’s amazing, she had twins.”<br/><br/>Everyone was surrounding the children, leaving Kevin Clark and Charles Amos left standing at the entrance, feeling out of place.<br/><br/>The excitement belonged to them, but had nothing to do with those two.<br/><br/>“Is it normal to be this ugly?” William Lane suddenly asked, “Are we sure they’re supposed to look like this? Is there something wrong with them?”<br/><br/>As soon as he spoke, everyone suddenly fell silent for a moment.<br/><br/>Then Sophie Ortiz glared at him and exclaimed: “Get lost!”<br/><br/>Not satisfied with just scolding him, Andrew Lane also kicked him: “When you were little, your facial features were deformed. Did I ever call you ugly?”<br/><br/>William Lane was kicked, licked his lips, and said: “You never told me. Charlotte and Olivia were beautiful as babies, born looking good.”<br/><br/>Olivia Lane looked at the children and said: “Maybe they take after my brother, they’ll be handsome when they grow up.”<br/><br/>The children had been crying in the delivery room but stopped crying when they came out.<br/><br/>Joseph Allen gently touched the hand of the child in Natalie Wayne’s arms with his fingertip.<br/><br/>The child’s round little fingers were like smooth, round pearls.<br/><br/>“Bro, isn’t it a bit magical?” Austin Allen said.<br/><br/>“Yeah.” Joseph Allen replied.<br/><br/>Although the children were indeed ugly, everyone crowded around them, treating them like precious treasures from the delivery room to the hospital room.<br/><br/>Two hours later, Charlotte Lane came out of the delivery room.<br/><br/>Kevin Clark immediately went to her side.<br/><br/>Seeing Charlotte for the first time, Kevin felt all his organs return to their proper places.<br/><br/>He relaxed with a sigh, his senses returned, followed by a dull ache all over his body.<br/><br/>Powerlessness, fear, heartache...<br/><br/>“Little girl.” After Kevin Clark leaned down and kissed Charlotte, he couldn’t speak.<br/><br/>It seemed like all his emotions were stuck in his throat, unable to make a sound.<br/><br/>Charlotte reached up and gently touched his reddened eye corners: “It’s alright. I’m finally free.”<br/><br/>The tears that had been held back in his eyes flowed down upon Charlotte’s touch.<br/><br/>Kevin held tightly to Charlotte’s hand, not letting go even when they entered the hospital room.<br/><br/>Although the room was large, there were too many people. In the end, they had to split into three groups to enter and visit Charlotte.<br/><br/>“Where’s Charles Amos?” Charlotte had seen him when she came out, but hadn’t seen him since they got to the room.<br/><br/>Everyone in the room looked towards the entrance one by one.<br/><br/>It wasn’t until the people outside knew they were looking for Charles Amos that they called him in from where he was sitting in the corridor with Edward North.<br/><br/>“I’m here to see my godson and goddaughter.” Gael Easton said.<br/><br/>“Did I agree to that?” Charlotte Lane asked.<br/><br/>“It’s not up to you to agree to it.” Gael Easton rarely spoke softly, “Just now we’ve already established a bond, so you can’t decide.”<br/><br/>Charlotte Lane didn’t bother arguing with him and looked back at the other people in the ward, “You guys really can’t resist a lively event.”<br/><br/>“Of course we have to be present for such a big event.” Logan messed with Charles Amos’s hair and said, “I must fight for the godmother’s position.”<br/><br/>“Step back, it’s none of your business.” Robinson Scott said.<br/><br/>“Let’s fight it out, winner takes it.” Logan suggested.<br/><br/>“You think I’m afraid of you?” Robinson Scott rolled up his sleeves and said, “Let’s meet in the restroom later.”<br/><br/>Charlotte Lane chuckled.<br/><br/>Luke said, “This is a matter that concerns the heir to my Hundred Demons Pavilion. I must fight for a position as well.”<br/><br/>“There should be an order to these things.” Adrian Roberts said, “We were obviously here first. We should inherit Dark Radiance.”<br/><br/>“If it’s about who came first... it seems I was the first one.” Joseph Allen said.<br/><br/>Felix Baker said, “My foot stepped in before yours.”<br/><br/>“Why don’t you guys grow up?” Charlotte Lane interrupted them, “They just came into the world.”<br/><br/>“Charles Amos doesn’t even care about us.” Luke said, “We can only pick on the smaller ones.”<br/><br/>“You guys are shameless.” Gael Easton said, “You have no heart for children.”<br/><br/>Lane Family and Clark Family entered the ward, and Luke and the others moved to the side.<br/><br/>Old Master Lane sat down by the bed, his spirits high, appearing years younger. He looked at Charlotte Lane and Kevin Clark, “Have you decided on the names yet?”<br/><br/>“Do you have any suggestions, Grandpa?” Charlotte Lane asked.<br/><br/>“Names, of course, should have some significance from the parents.” Old Master Lane looked at Kevin Clark, “Kevin, any ideas?”<br/><br/>Charlotte Lane also looked at Kevin Clark.<br/><br/>Kevin Clark stroked her fingers and said, “Hugo Clark, Noah Clark.”<br/><br/>Charlotte Lane’s eyelashes fluttered, as she hadn’t come up with any names that night.<br/><br/>Once she mentioned it, he came up with the names.<br/><br/>“What do they mean?” Old Master Lane asked.<br/><br/>“Bryce’s radiant brilliance.” Kevin Clark said, “Like Casey Cannon and Ethan Clark, it also has the meaning of beautiful jade.”<br/><br/>Casey Cannon, who was mentioned, looked at the two children who had just been born a few hours ago and were in the same generation as him: “......”<br/><br/>At the sound of his own name, Charles Amos nodded with satisfaction.<br/><br/>Old Master Lane also nodded, “What about Isabella Lane?”<br/><br/>“Adorable and charming, a valuable promise.” Kevin Clark gazed down at Charlotte Lane, his expression tender.<br/><br/>More importantly, Kevin Clark made a lifelong promise to Charlotte Lane.<br/><br/>...&lt;/p\t\t\t\t\t\t</div>", "images": {}, "success": true}