{"id": 618, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15052377.html", "title": "Chapter 615: 558: Love Season", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 615: 558: Love Season</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 615: Chapter 558: Love Season<br/><br/>A few months after giving birth, Charlotte Lane and Kevin Clark brought their child back to the Lane Family for a while.<br/><br/>During their stay, Olivia Lane, who was on summer vacation, rarely stayed at home, and William Lane, who used to come home every day, suddenly seldom returned home as well.<br/><br/>Unusual behavior often signals big problems.<br/><br/>After staying at the Lane Family for a week, they happened to have a rest day at the Research Institute.<br/><br/>Kevin took Charlotte to the hospital for a physical checkup.<br/><br/>The examination results were excellent, and she had recovered very well after giving birth.<br/><br/>Only then did Kevin finally breathe a sigh of relief.<br/><br/>“Now that I’m alright, shouldn’t you also work on getting your weight back to normal?” Charlotte remarked.<br/><br/>“What’s wrong with this? Isn’t it good?” Kevin replied.<br/><br/>“At least you know. It doesn’t look good.” Charlotte said.<br/><br/>“You’re so straightforward.” Kevin said.<br/><br/><br/><br/>“Yeah, I could be even more blunt. Want to hear it?”<br/><br/>“Never mind. Let’s not.”<br/><br/>The two went to the Dance Association to deliver costumes for Sophie Ortiz.<br/><br/>They also watched the rehearsals at the Dance Association for a while. Stella Edwards’s leg had recovered well and she could participate in the performance.<br/><br/>This performance marked her return after her injury.<br/><br/>Charlotte chatted with her for a bit, and both of them tactfully avoided mentioning Edward Kirsten.<br/><br/>After more than an hour, Charlotte and Kevin left.<br/><br/>As they left the rehearsal building, a female student hurriedly ran towards them.<br/><br/>She almost bumped into Charlotte.<br/><br/>Kevin put his arm around Charlotte’s shoulder and pulled her towards him. Charlotte reached out and supported the girl’s arm.<br/><br/>The girl was startled, and as she apologized, she looked at Charlotte with panic.<br/><br/>When she saw Charlotte’s appearance, she clearly paused for a moment.<br/><br/>Charlotte slightly raised her eyebrows as well.<br/><br/>The girl apologized again before running into the building and disappearing around a corner.<br/><br/>Charlotte looked at the place where she disappeared.<br/><br/>Kevin asked, “Why? Do you know her?”<br/><br/>“Not really.” Charlotte looked at the spot for a while and then curved the corner of her mouth, “But...she seems to be my future sister-in-law.”<br/><br/>“Huh?” Kevin’s eyebrows were filled with curiosity, and he even began to regret not looking at the girl earlier, “What do you mean?”<br/><br/>“The perfume she was wearing was the same as my brother’s last night,” Charlotte said, “and the way she just looked at me.”<br/><br/><br/><br/>Kevin knew her sense of smell was very keen.<br/><br/>“She seems quite young,” Kevin said.<br/><br/>“Nineteen or twenty?” Charlotte said, “The winner of the dance competition the year before last.”<br/><br/>Kevin raised his eyebrows.<br/><br/><br/><br/>Not bad, just a dozen years older than her.<br/><br/>“It’s okay, my brother looks young,” Charlotte smiled.<br/><br/>...<br/><br/><br/><br/>Charlotte Lane knew she had guessed correctly. She glanced at Olivia Lane and then said, “Brother, she’s old enough, it’s her freedom to choose who she wants to date.”<br/><br/>William Lane looked at Charlotte Lane in disbelief, “You’re actually helping her.”<br/><br/>Olivia Lane pursed her lips and smiled.<br/><br/>“Still laughing!”<br/><br/>Charlotte Lane said, “Brother, are you planning to break them up?”<br/><br/>“I really want to,” William Lane gritted his teeth and said.<br/><br/>“Brother!” Olivia Lane raised her head and called him out.<br/><br/>“Look at you! Look at you! Look!” William Lane was furious and wanted to slap the table, but he was afraid of scaring Olivia Lane and didn’t do it, “Damn girl! Among men, there are so many! Imperial Capital University has plenty of outstanding men, but you have to find an older man!”<br/><br/>“Where’s the old?” Olivia Lane argued, “He, he’s only a year older than you.”<br/><br/>“You know he’s one year older than me!” William Lane’s mind buzzed, “He’s a whole generation older than you!”<br/><br/>Olivia Lane didn’t say anything.<br/><br/>Charlotte Lane didn’t say anything either as she watched the two of them.<br/><br/>Regarding this matter, she really didn’t have a firm stance, and her position was swaying from side to side.<br/><br/>But soon her position was tilted because she heard William Lane say, “You two are really driving me crazy. I don’t mind if you find someone older, but isn’t it too old! Older than me. The old men from the Clark Family are so attractive. Both sisters are running after them.”<br/><br/>Charlotte Lane: “...Let me correct you, Harton Clark is not older than you, he is one year younger than you.”<br/><br/>William Lane laughed angrily, “Yes. But his generation is older than mine.”<br/><br/>William Lane pointed at Olivia Lane, “You, find someone a year older than me.”<br/><br/>Then pointed to Charlotte Lane, “You, find someone a whole generation older than me. I really appreciate you two.”<br/><br/>“You’re welcome.” Olivia Lane whispered.<br/><br/>William Lane was about to explode from anger.<br/><br/>Charlotte Lane pursed her lips to hold back her laughter, and when William Lane was about to speak again, she slowly said, “We didn’t complain when you found us a twenty-year-old sister-in-law.”<br/><br/>The words at the tip of William Lane’s tongue suddenly got stuck.<br/><br/>Volcano-like rage instantly turned into a flickering little flame that could be blown out at any moment.<br/><br/>Olivia Lane’s eyes widened, and she looked at William Lane and Charlotte Lane with a gossip-filled expression.<br/><br/>“What? What? Which sister-in-law?” Olivia Lane was like a raccoon that can’t eat melons in a melon field.<br/><br/>William Lane pursed his lips and didn’t say anything as he looked at the two of them.<br/><br/>Still with a smile at the corner of her mouth, Charlotte Lane looked at William Lane, “Your sister-in-law is not only one generation younger than you.”<br/><br/>“Sister, have you seen her? Where did you meet her? Take me to see her. Is she beautiful? Is she pretty? What does she do?”<br/><br/>“Why do you have so many questions?” William Lane said.<br/><br/>Olivia Lane ignored him.<br/><br/>Charlotte Lane said, “At the Dance Association. She’s very beautiful.”<br/><br/>“Oh ho.” Olivia Lane looked at William Lane, “Brother, you’re pretty good.”<br/><br/>“We’re talking about you, not me,” William Lane said.<br/><br/>Charlotte Lane said, “If the little girl likes you, why can’t Olivia Lane like Hugo Clark?”<br/><br/>William Lane’s brows suddenly knitted, and he felt unhappy.<br/><br/>Mainly because his younger sister liked Hugo Clark.<br/><br/>The little girl did not like him.\t\t\t\t\t\t</div>", "images": {}, "success": true}