{"id": 613, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15047507.html", "title": "Chapter 610 - 553: Hanging An Ophthalmology Department", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 610 - 553: Hanging An Ophthalmology Department</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 610: Chapter 553: Hanging an Ophthalmology Department<br/><br/>Worried that Charlotte Lane would be tired after giving birth, everyone stayed in the ward for a while before leaving one after another.<br/><br/>Both the Clark and Lane families didn’t stay in the ward for too long, they accompanied Charlotte Lane for a while before leaving.<br/><br/>In the room, only Charlotte Lane, Kevin Clark, the two little ones, and Aunt Cruz who was looking after them were left.<br/><br/>Kevin Clark leaned in and kissed her forehead, saying softly, “Take a nap.”<br/><br/>“Go and see them,” Charlotte Lane said.<br/><br/>Finally, some color returned to Kevin Clark’s lips as the thin, crimson lips curved upwards, saying, “Okay.”<br/><br/>He got up to check on the children.<br/><br/>Charlotte Lane looked at his back and pulled a tissue from the side of the bed, wanting to wipe the sweat off her palms.<br/><br/>Their two hands had been tightly clasped together, sweaty but not letting go.<br/><br/>As she wiped her palms and was about to throw the tissue away, she caught sight of blood on the tissue. She paused and unfolded the tissue, only to see more bloodstains on it.<br/><br/>She checked her own hand, which was fine but had some bloodstains on it.<br/><br/>Then she looked at Kevin Clark.<br/><br/>If she was fine, then the one who was injured must be Kevin Clark.<br/><br/>Kevin Clark walked to the bedside of the newborns, looking at the two little ones. At first glance, they were really ugly, like two little aliens. But when Kevin Clark saw them, a sudden indescribable feeling welled up inside him.<br/><br/>He couldn’t help but feel affectionate towards the two of them.<br/><br/>His heart softening continuously, the gaze he gave them became all the more tender.<br/><br/>The bond between blood relatives was indeed magical; even though they had just met for the first time, Kevin Clark felt that he could do anything for them.<br/><br/>He reached out and gently touched their faces with his fingertips.<br/><br/>These were his and Charlotte Lane’s children<br/><br/>Kevin Clark looked at them and asked, “Which one is our daughter?”<br/><br/>“This one,” Aunt Cruz said.<br/><br/>“Who’s older?”<br/><br/>“Bryce Cannon is sixteen minutes older than Isabella Lane,” Aunt Cruz said.<br/><br/>Kevin Clark smiled slightly, gazing for a moment before saying, “Can I hold her?”<br/><br/>“Of course.” Aunt Cruz carefully picked up the baby and handed it to Kevin Clark, “Support her here, gently. Her body is still too soft. Place this hand here, yes, slowly.”<br/><br/>Kevin Clark held the baby very stiffly, and once settled in his arms, he dared not move. He looked at the baby by himself, then slowly walked over to Charlotte Lane with his baby, showing her proudly, “Take a look.”<br/><br/>Charlotte Lane glanced at his hand before looking at the little one.<br/><br/>“Look, my daughter is so beautiful. How can she be ugly?” Kevin Clark’s tone was not only serious but also prideful.<br/><br/>Fortunately, the features of the two little ones gradually took shape, becoming cuter, and Charlotte’s patience rose to a new level.<br/><br/>Of course, the main reason for this increase in patience was that Kevin took care of everything, so she didn’t have to worry about anything.<br/><br/>With Kevin, Aunt Cruz, and the maternity nurses, she didn’t have to do much of anything.<br/><br/>Many times, she felt like an outsider, watching them work.<br/><br/>A week later in the postpartum care center, Charlotte started to handle some research institute affairs and review some files sent by Siera Santiago.<br/><br/>That day, just after Siera left having sent the files, Charlotte received a message from an unknown person.<br/><br/>[Miss Lane, this is Willow Martin. I have a performance in three days, thank you for your previous guidance.]<br/><br/>A somewhat abrupt message.<br/><br/>It seemed as if there was more to say, but it wasn’t said, and in the end, she just expressed her thanks.<br/><br/>Charlotte looked at the message for a while and replied: [Aren’t you going to invite me to watch?]<br/><br/>[Of course I want to. I left a concert ticket for you, but the concert time is a bit inconvenient.]<br/><br/>Willow’s message was sent very quickly, and she even made a typo because of her excitement.<br/><br/>She quickly sent another message with correct text.<br/><br/>The whole internet knew about Charlotte’s childbirth, and everyone was speculating whether she gave birth to a boy or a girl.<br/><br/>But in order not to expose the two children to the camera lens,<br/><br/>Charlotte only posted on Catherine’s Facebook: [Everything is safe, don’t worry.]<br/><br/>Nothing else was revealed.<br/><br/>Even without revealing anything, everyone knew that she must be in her postpartum confinement period at this time.<br/><br/>So Willow also knew it was inconvenient for her.<br/><br/>Charlotte caught a glimpse of Kevin coming over and replied to the message: [Do you know Olivia Lane? Give the ticket to her.]<br/><br/>Willow attended Imperial Capital University, and Olivia Lane was a well-known figure there. Almost everyone knew her.<br/><br/>Willow replied: [Okay, I’ll give it to her in her dormitory at noon.]<br/><br/>She even knew the location of her dormitory.<br/><br/>“What are you doing?” Kevin came over and asked.<br/><br/>“Willow is giving me tickets to her concert,” Charlotte sent a message to Olivia, “I won’t be able to attend, so...let Master Flores take a look.”<br/><br/>Kevin raised his eyebrows: “Finding a successor for Master Flores?”<br/><br/>“It depends on Willow’s abilities,” Charlotte replied.<br/><br/>As for Willow’s pipa, it was indeed not polished when she first heard it, but Charlotte liked the feeling she played, so she gave some guidance.<br/><br/>As for her current skills? Whether or not she could catch the eye of Charlotte’s Master we would have to wait and see.\t\t\t\t\t\t</div>", "images": {}, "success": true}