{"id": 610, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15047501.html", "title": "Chapter 607 - 550: Third Master’S Waist", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 607 - 550: Third Master’S Waist</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 607: Chapter 550: Third Master’s Waist<br/><br/>[Every day is so exciting on the internet. It’s the first time I’ve seen anything like this where people are cursing themselves on Facebook.]<br/><br/>[The Eldest Daughter of the Lane Family is quite something.]<br/><br/>[The fans of the Eldest Daughter of the Lane Family are quite something.]<br/><br/>[This is more effective than Charlotte Lane’s fans arguing online.]<br/><br/>[They deserve to be scolded. They have nothing better to do than to hide behind the internet like mad dogs, cursing others. Seething with jealousy and incapable of doing anything.]<br/><br/>[Now who would dare to mess with Charlotte Lane.]<br/><br/>[I heard about a 15-year-old child who rage-quits a game as they cried.]<br/><br/>[May there be no more online exposé in the world.]<br/><br/>[Am I the only one who thinks that Charlotte Lane is terrifying? She doesn’t respond when she’s being cursed but strikes back suddenly. She can accurately locate every single person. This level of accuracy can pinpoint people’s homes and every place they go to.]<br/><br/>[That’s why it is best not to provoke her. This course of action is already considered merciful.]<br/><br/>...<br/><br/>After analyzing the situation online, those who cursed at Charlotte Lane became even more afraid and behaved themselves.<br/><br/>The great mask of the internet has been mercilessly torn off, leaving them completely exposed.<br/><br/>It’s as if they went to the Lane Family and the entrance of Clark Manor to curse others in person.<br/><br/>They scolded Charlotte Lane right in front of everyone, pointing at her directly.<br/><br/>Without the protection of the internet, everyone is afraid and deflated.<br/><br/>Charlotte Lane’s opinion of this whole incident can be summarized in two words: “Superficial”.<br/><br/>Doesn’t she have any other qualities besides her beauty?<br/><br/>It’s always the same sentence every day.<br/><br/>As for brown-nosing, after all these years, Holt Lawrence finally found the right direction.<br/><br/>Praising her in other ways didn’t work, but praising her beauty definitely did the trick.<br/><br/>...<br/><br/>In June, Charlotte Lane was eight months pregnant.<br/><br/>She often had trouble sleeping at night, increased trips to the restroom, difficulty breathing when lying down for too long, backache, and occasional swollen ankles.<br/><br/>Kevin Clark would wake up whenever she made the slightest movements at night, sometimes giving her back massages.<br/><br/>When she had trouble breathing lying down, he would have her lean on his chest and hold her while they slept.<br/><br/>Charlotte Lane gained nearly 20 pounds during her pregnancy, while Kevin Clark’s weight kept decreasing.<br/><br/>No matter how light her movements were, Kevin Clark would always wake up.<br/><br/>At 2 AM, Charlotte Lane had trouble breathing and decided to go to the balcony for some fresh air.<br/><br/>As soon as she moved, Kevin Clark woke up.<br/><br/>“What’s wrong?”<br/><br/>“Nothing,” Charlotte Lane replied, “You sleep. I just need some air.”<br/><br/>[I took a twenty-minute nap and dreamt about Third Master. Woke up with a pillow soaked in drool.]<br/><br/>[I get it now! Brook Sister is a real pervert! Huge pervert! She made the first move!]<br/><br/>[Thank you, Brook Sister, for broadening our horizons.]<br/><br/>[Third Master’s waist is like a lethal weapon.]<br/><br/>[Brook Sister is generous, always happy to share good things.]<br/><br/>[Not generous at all. She only let us have a glimpse and then enjoyed it all by herself!]<br/><br/>[Not only did she enjoy it, but she’s also pregnant now.]<br/><br/>[Help! What are you guys talking about! Look at what you’re saying! The entire comment section doesn’t have a belt on!]<br/><br/>[Oh my god, did you guys notice the size of these clothes? Professionals analyzed detailed data. Third Master’s figure...is amazing!]<br/><br/>[But Third Master seems to have lost a lot of weight.]<br/><br/>[I also noticed that Third Master has been losing weight since Brook Sister got pregnant.]<br/><br/>[What a good man. Rich, powerful, handsome, great figure, treats his wife well, and lives well.]<br/><br/>[Sister, how do you know?]<br/><br/>[With that waist, it’s absolutely good.]<br/><br/>[No, isn’t your focus off? Shouldn’t we be angry? Their actions are like flaunting their love. Isn’t that infuriating?]<br/><br/>[Furious! Very furious! They should be condemned! But given that waist, I forgive them.]<br/><br/>[Facing Third Master’s photo, I can’t get angry at all!]<br/><br/>...<br/><br/>Charlotte Lane took care of all the things that needed to be handled at the research institute yesterday.<br/><br/>Today, she stayed at home, preparing to go to the hospital.<br/><br/>As the due date approaches, people from the Clark and Lane families insisted that she go to the hospital.<br/><br/>She didn’t want to go, so Old Master Lane was going to pick her up personally.<br/><br/>He even actually went to the research institute to pick her up after work yesterday.<br/><br/>The closer the due date, the more anxious everyone becomes, even Charles Amos being visibly nervous. Only Charlotte Lane appears unbothered.<br/><br/>Kevin Clark was packing things in the cloakroom while Charlotte Lane was sitting on the sofa in the bedchamber, browsing the online comments.<br/><br/>As she was reading, she felt like she had thrown Kevin Clark into a nest of wolves and leopards, about to be devoured at any moment.<br/><br/>“Don’t keep looking at your phone. Radiation.” Kevin Clark said from the cloakroom.<br/><br/>Charlotte Lane put her phone aside and went to get the fruit tray.<br/><br/>Just as her fingertips touched the edge of the fruit tray, she suddenly furrowed her brows, followed by a warm sensation beneath her.<br/><br/>Charlotte Lane paused: “......”<br/><br/>“Kevin Clark.”<br/><br/>“What’s wrong?” Kevin asked, walking over.<br/><br/>Sitting on the sofa, Charlotte turned her head to look at Kevin and said in a tone that was as indifferent and helpless as possible, “Stop packing. Let’s just go to the hospital now.”\t\t\t\t\t\t</div>", "images": {}, "success": true}