{"id": 614, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15047509.html", "title": "Chapter 611: 554: James Flory", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 611: 554: James Flory</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 611: Chapter 554: James Flory<br/><br/>In the early hours around 1am, at the Postpartum Center, a faint cry was followed by an even louder one.<br/><br/>And then another cry joined in, even louder than the first.<br/><br/>As if competing with each other, the cries grew more and more intense.<br/><br/>Kevin Clark lay in bed, just about to gently pull his hand from Charlotte Lane’s neck, when she sat up.<br/><br/>Kevin Clark got up as well and kissed her, “You sleep, I’ll go check on them.”<br/><br/>“Let’s go together.” Charlotte Lane swept her hair back.<br/><br/>As the two got out of bed, the nanny was already changing the diapers. Aunt Cruz also came out.<br/><br/>Kevin Clark picked up his daughter after the diaper change, and Charlotte Lane picked up the other and said, “You all go to sleep. Aunt Cruz, you go rest.”<br/><br/>“I’ll stay with you.” Aunt Cruz replied.<br/><br/>“It’s fine,” Charlotte Lane said, “That’s how I took care of Charles Amos too, don’t worry.”<br/><br/>Upon mentioning this, Aunt Cruz’s heart ached. At that time, Charlotte Lane was still just a child herself, but she had been taking care of Charles Amos all along.<br/><br/><br/><br/>She waited until the children’s cries lessened a little before returning to her room to rest.<br/><br/>The nanny also returned to her room.<br/><br/>Kevin Clark and Charlotte Lane each held a child until both stopped crying before putting them back in their cribs.<br/><br/>“Do you think they’re still cute at this time?” Charlotte Lane asked quietly.<br/><br/>“Our children are of course adorable,” Kevin Clark replied as if his brain had been poisoned by emotion, “No matter what.”<br/><br/>Charlotte Lane: “......”<br/><br/>“Isabella Lane now looks more and more like you did when you were young,” Kevin Clark said softly as he looked at little Isabella Lane, “The first time I met you, you looked just about like this.”<br/><br/>Charlotte Lane looked at Kevin Clark.<br/><br/>“Of course, Madam is more beautiful than her,” Kevin Clark said as he looked at her.<br/><br/>Charlotte Lane smiled.<br/><br/>There was only one dim lamp in the room, making everything around them seem gentle and soft, warming their hearts.<br/><br/>Kevin Clark hugged Charlotte Lane and kissed her, “Let’s go to sleep.”<br/><br/>“Alright.”<br/><br/>As they held hands, ready to return to bed, Aunt Cruz came out of her room again.<br/><br/>Charlotte Lane looked at her, “Aunt Cruz, what’s wrong?”<br/><br/>“I can’t sleep,” Aunt Cruz looked at the two children, “I have to see them to be able to sleep peacefully.”<br/><br/>Kevin Clark and Charlotte Lane both smiled, and Charlotte Lane walked over to her. Just as she was about to speak, she suddenly heard a faint noise.<br/><br/>Her footsteps paused, and Kevin Clark’s expression suddenly became cold.<br/><br/>Aunt Cruz looked towards the direction of the balcony.<br/><br/><br/><br/>Their room was on the third floor, and there were guards in the periphery.<br/><br/>But if someone was skilled enough, it would not be impossible for them to sneak past the guards and enter.<br/><br/>Aunt Cruz turned her body towards the balcony.<br/><br/>Kevin Clark gently tapped Charlotte Lane’s hand twice and then let her go.<br/><br/><br/><br/>Three seconds later, Kevin Clark went forward and fought with the person who came in from the balcony. Aunt Cruz followed closely to help.<br/><br/>Aunt Cruz had grown up with Sophie Ortiz in the Ortiz Family since childhood. After Sophie Ortiz got married, she followed her to the Lane Family.<br/><br/>Having trained in martial arts since a young age, she used to be responsible for protecting Sophie Ortiz, and later Charlotte Lane and Olivia Lane.<br/><br/><br/><br/>Morgan Mia didn’t speak, but the look in her eyes answered Charlotte Lane’s question.<br/><br/>Yes, she had come to kill her.<br/><br/>“Because I married your beloved Kevin Clark?” Charlotte Lane said slowly, “Because Kevin Clark expelled you from Ryan Easton and threw you out of Clark Family and into the slums of F Continent because of me? Or do you think it’s because I blocked your way to marry into Clark Manor and enjoy Kevin Clark’s tenderness?”<br/><br/>Kevin Clark furrowed his brows.<br/><br/>Morgan Mia still didn’t speak, her usually obedient face perfect for deception, but when filled with hatred, it was covered in ferocity.<br/><br/>“How foolish.” Charlotte Lane mocked, “Out of thousands of paths, you chose a dead-end. Should I say you have a simple mind and an overdeveloped body? You’ll always think of solving problems violently.”<br/><br/>“You won’t be so smug for long, I’ll kill you sooner or later.” Morgan Mia finally spoke the first words of the day in a hoarse voice.<br/><br/>“Do you think you can leave here unharmed?”<br/><br/>Morgan Mia scoffed, “Why not?”<br/><br/>“Aside from everything else,” Charlotte Lane said, “even if you escaped today, do you think you can kill me?”<br/><br/>“Kevin Clark can’t protect you forever.” Morgan Mia said.<br/><br/>Charlotte Lane chuckled lightly and said unhurriedly, “Allow me to reintroduce myself: I am the Pavilion Master of Hundred Demons Pavilion, commanding six Ghost Kings of Hundred Demons Pavilion, and the eternal number one on the hitman rankings that you can never surpass.”<br/><br/>Revealing her identity... that meant the person before her eyes wouldn’t be able to leave alive.<br/><br/>Morgan Mia’s pupils suddenly narrowed: “What a joke, just because you say it doesn’t make it true! Impossible! That’s impossible!”<br/><br/>No one paid her any more attention.<br/><br/>She mumbled in disbelief for a while, then looked at the balcony and suddenly ran away through the window.<br/><br/>Charlotte Lane thought to herself: Finally, she left.<br/><br/>Kevin Clark glanced at Charlotte Lane and jumped out the window as well.<br/><br/>It wasn’t convenient to deal with her here, so he let her go outside and deal with her there.<br/><br/>“Lila, are you okay?” Aunt Cruz asked.<br/><br/>“I’m fine,” Charlotte Lane replied. “How are you?”<br/><br/>Aunt Cruz shook her head: “Third Master is too powerful. I feel like I mainly hit the air and even hindered him a bit.”<br/><br/>Charlotte Lane smiled and then looked at the needles on the shelf.<br/><br/>Aunt Cruz followed her gaze and reached to pull them out.<br/><br/>Charlotte Lane stopped her, “They might be poisoned.”<br/><br/>Aunt Cruz’s hand retracted, “Right, I forgot about it. Morgan Mia’s family knows medicine.”<br/><br/>Charlotte Lane found a pair of disposable gloves, carefully removed the needles, and stored them. She planned to research them later at the Research Institute.<br/><br/>Then she washed her hands and put the two children to bed with Aunt Cruz.<br/><br/>As soon as they fell asleep, Kevin Clark returned from the window.<br/><br/>Charlotte Lane glanced at Kevin Clark’s expression and asked, “Is it settled?”<br/><br/>“Yes,” Kevin Clark said, “Yoshua Archer is handling the follow-up matters.”<br/><br/>“Keep an eye on her power, don’t let it stir up any waves,” Charlotte Lane said.<br/><br/>“Okay.”<br/><br/>“Go take a shower and sleep,” Charlotte Lane told him.<br/><br/>“Okay.”<br/><br/>Kevin Clark went to take a shower, while Charlotte Lane gazed at the two children with a cold, enigmatic expression.<br/><br/>The newly emerging hitman on the Dark Web fell just like that.\t\t\t\t\t\t</div>", "images": {}, "success": true}