{"id": 615, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15047511.html", "title": "Chapter 612: 555: Full Moon Feast", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 612: 555: Full Moon Feast</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 612: Chapter 555: Full Moon Feast<br/><br/>Charlotte Lane held a full moon banquet for the two little ones at Doomsday Hotel three days after returning from the postpartum center.<br/><br/>Still, there was no news leak, yet the whole internet knew about it.<br/><br/>Because this time, all the luxury cars were heading to the Doomsday Hotel.<br/><br/>It’s not strange for luxury cars to enter and leave the Doomsday Hotel. After all, non-luxury cars cannot enter the hotel’s parking lot.<br/><br/>But within two hours, the traffic was so massive that it must be a big event.<br/><br/>Calculating the time... it was just right for the full moon banquet.<br/><br/>Internet users eagerly counted the days, speculating what had happened.<br/><br/>And unlike the day of the birth, there were more people today.<br/><br/>Firstly, some people brought their families, going one family after another. For example, Xavier Dominic’s family went as a family of three, with his uncle’s side also going as a family of three.<br/><br/>Robinson Scott’s fathers also came.<br/><br/>Secondly, some friends from both the Clark and Lane families also came.<br/><br/><br/><br/>Quite a few people from the research institute also came.<br/><br/>Besides, this full moon banquet was announced with invitations and a designated time.<br/><br/>Many people cleared this day and came early.<br/><br/>So there were many people.<br/><br/>The parking lot of the Doomsday Hotel was already large enough, but some people still had to park outside.<br/><br/>The discussion on the internet kept heating up.<br/><br/>Gradually, some people became restless and wanted to take advantage of the situation.<br/><br/>They even went to the vicinity of the Doomsday Hotel with cameras, intending to secretly film and make a profit.<br/><br/>Then... not only were the people in the opposite building taken out, but even the one hiding in the tree canopy was discovered.<br/><br/>However, on such a day, they were not humiliated.<br/><br/>Inside the Doomsday Hotel.<br/><br/>Gael Easton came and clamored to see his godson and goddaughter.<br/><br/>No one’s voice was louder than his, and it was only when he saw the children that his voice lowered.<br/><br/>“Let me see, how did my goddaughter become so pretty?” Gael Easton teased the child, “She’s much more beautiful than your mother.”<br/><br/>Charlotte Lane didn’t bother dealing with him.<br/><br/>“My godson... wow, even more handsome than Harton Clark.” Gael Easton said, “He must be a hundred times more handsome, right?”<br/><br/>“If there’s a problem with your eyes, go see a doctor.” Charlotte Lane replied.<br/><br/>Gael Easton glanced at her: “You can’t even stand a single compliment. You two, husband and wife... hmph. Not even let me have a photo, you guys are so stingy.”<br/><br/>“Lower your voice.” Charles Amos said, “You’re scaring the younger brother and sister.”<br/><br/><br/><br/>“Alright alright.” Gael Easton immediately lowered his voice.<br/><br/>After a while, Robinson Scott and Phoebe Turner came over. Robinson Scott looked at the two children and said, “I’ve come to see you guys again. Do you remember Auntie Robinson?”<br/><br/><br/><br/>Then long silence followed from Felix Baker, as the surrounding people looked at him without understanding.<br/><br/>In less than a minute, Felix Baker straightened out all the details. He squeezed out of the crowd to find Charlotte Lane.<br/><br/>At this time, Charlotte Lane was preparing to run away.<br/><br/>“You stop right there.”<br/><br/>Charlotte Lane didn’t stop. Felix Baker directly ran to block her way, staring at her.<br/><br/>“Everyone here works for me.” Charlotte Lane stated, “You better think carefully.”<br/><br/>Felix Baker was so angry that he was breathing heavily, looking as though he wanted to fight to the death with her, but in the end, he could only spit out four words: “Give me back my money!”<br/><br/>Charlotte Lane fell silent for a moment, then replied: “No.”<br/><br/><br/><br/>This “No” was cold, indifferent, and merciless.<br/><br/>Felix Baker was dumbstruck, hardly able to believe what he heard.<br/><br/>“You!”<br/><br/>Charlotte Lane stepped back, and Kevin Clark stepped forward to shield her behind him.<br/><br/>Felix Baker looked at Kevin Clark, his livid face changing colors constantly, but he didn’t dare to say a single word to him.<br/><br/>Charlotte Lane peeked at Felix Baker from behind Kevin Clark.<br/><br/>Seeing her indifferent face purposely provoking him, Felix Baker became even more furious: “You come out; we’ll settle this one-on-one.”<br/><br/>Kevin Clark touched Charlotte Lane’s face and gently pushed her head back behind him, then said to Felix Baker: “I’ll give you a 50% discount on the jade for the second half of the year based on the current price.”<br/><br/>Felix Baker’s anger dissipated instantly, and a smile immediately appeared on his face: “Alright, thank you, Third Master.”<br/><br/>Joseph Allen looked at them, a gentle smile on his face, his thoughts drifting far away.<br/><br/>He still remembered the first time he saw Shopie Easton.<br/><br/>While captivated by her extraordinary beauty, he was also shocked by the cold, lifeless aura surrounding her.<br/><br/>He didn’t know what the girl in front of him, who had disappeared for some time, had gone through. She was living and breathing, but she appeared devoid of any warmth or life.<br/><br/>The brokenness she exuded made others feel she could leave this world at any time.<br/><br/>The coldness, deathly silence, and sharpness in her eyes were terrifying.<br/><br/>He called her “Shopie Easton.”<br/><br/>And she told him her name was “Daisy Zane.”<br/><br/>He said, “Can I call you Lucia?”<br/><br/>She replied expressionlessly, “As you wish.”<br/><br/>Now, although Shopie Easton still looked cold and distant, putting a barrier between herself and others...<br/><br/>One could feel she had changed.<br/><br/>She had become mischievous, mature, and occasionally revealed a hint of cuteness. Her smiles were genuine.<br/><br/>Someone had pulled her back from the brink of despair.<br/><br/>Joseph Allen looked at Kevin Clark.<br/><br/>Not only had he pulled her back, but he had also melted the layers of ice wrapped around her heart, bit by bit.\t\t\t\t\t\t</div>", "images": {}, "success": true}