{"id": 619, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15052378.html", "title": "Chapter 616: 559: Plotting Against Me?", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 616: 559: Plotting Against Me?</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 616: Chapter 559: Plotting Against Me?<br/><br/>The three siblings had been in the study room for more than an hour, and aside from getting angry, William Lane felt suffocated. His sisters, however, seemed to be having a leisurely time making a spectacle of it all.<br/><br/>Dealing with Olivia Lane was one thing – a bit of intimidation, a few stern words, and she could be managed. But...<br/><br/>Charlotte Lane... she had never been afraid of him from childhood, and even ended up bullying him without resistance.<br/><br/>William Lane couldn’t deal with both of them, and left the study room with frustration.<br/><br/>Descending the stairs, he saw Kevin Clark sitting leisurely downstairs, sipping tea and listening to music, which made him even angrier.<br/><br/>Kevin Clark, noticing him coming down with a dark face, raised an eyebrow and amusingly commented, “The situation seems dire.”<br/><br/>William Lane stood at the top of the stairs, not wanting to say anything to Kevin Clark, let alone entertain his mockery.<br/><br/>Kevin Clark, enjoying the spectacle, asked him, “What has gotten you so riled up?”<br/><br/>“Ask your nephew.”William Lane replied.<br/><br/>Kevin Clark raised his eyebrows again, a smile playing on his face.<br/><br/>William Lane narrowed his eyes at him, “Kevin Clark, you knew about this, didn’t you?”<br/><br/><br/><br/>Kevin Clark simply took a sip of his tea.<br/><br/>William Lane paced around the staircase, clearly agitated. “Is your family trying to take over ours? You must have conspired in this. Damn it, I’m so pissed off. You may not have known about Lila Campbell’s identity at the beginning, and I can reluctantly understand that. But Hugo Clark... He knew everything about Amelie Quentin, and still had the guts to pursue her. What’s the difference between a brother’s sister and his own sister? How could he bring himself to make a move?”<br/><br/>“What is there to be angry about?” Kevin Clark replied calmly, “Hugo is outstanding. Can you find someone better than him?”<br/><br/>William Lane was left speechless. After a while, he pulled out his cell phone and called Hugo Clark, “Where are you?”<br/><br/>Kevin Clark could not hear the phone conversation, but he could tell whom William was calling.<br/><br/>Whatever was said on the other end of the call prompted William to say, “Meet me at the entrance of Dark Street.”<br/><br/>William owned a boxing ring in Dark Street. Only the few of them knew about this – even the Lane Family was unaware.<br/><br/>After he ended the call, he began to walk out.<br/><br/>Kevin Clark watched him leave, then put down his teacup and texted Charlotte Lane notifying her that he was leaving and immediately followed him out.<br/><br/>Hugo Clark was in for a beating he wouldn’t be able to evade.<br/><br/>But he couldn’t just watch his nephew get beaten up either.<br/><br/>...<br/><br/>No one knew what happened at the boxing ring.<br/><br/>By the time Olivia Lane realized they couldn’t find William, Charlotte Lane had managed to keep her by her side for almost three hours.<br/><br/>Olivia Lane could not reach Hugo Clark through his phone and asked Charlotte Lane to help locate him.<br/><br/>Charlotte Lane, without even lifting a finger, revealed Hugo Clark’s location.<br/><br/>He was at a certain clubhouse.<br/><br/>“Why is he there?” Olivia Lane was confused.<br/><br/>Charlotte Lane looked at her and said, “They were boxing for two hours. I guess they went drinking afterward.”<br/><br/><br/><br/>Tears welled up in Olivia Lane’s eyes upon hearing this. She cried, “Sister, you did this on purpose.”<br/><br/>“Yes,” Charlotte Lane admitted, “Once you show up, our brother won’t bear to see you upset and will stop fighting, thus his anger won’t be completely vented. It’s better to let him deal with it all at once and get it over with.”<br/><br/>“Sister,” Olivia Lane softly called out to her.<br/><br/>“Yes,” Charlotte Lane calmly responded, “I was a bit upset when I saw him kissing you too.”<br/><br/><br/><br/>Olivia Lane held her lips tightly, her eyes reddening, and remained silent.<br/><br/>Lila Campbell asked, “You were so afraid of him before, how come you suddenly started liking him?”<br/><br/><br/><br/>“He’s old-fashioned. There won’t be any issues.” Olivia Lane assured.<br/><br/>Charlotte Lane chuckled, the Clark family did indeed have strict discipline.<br/><br/>Especially when it came to boys and how they treated girls.<br/><br/>“But, what if he did try to force himself on me, Sis? What would you do?” Olivia Lane asked, clinging to her arm.<br/><br/>“I wouldn’t do anything.” Charlotte Lane said tonelessly, “I’ll just use the roses he gave me for fertilizer.”<br/><br/>Olivia Lane leaned her head on Charlotte Lane’s shoulder, clinging to her arm as she began to laugh.<br/><br/>...<br/><br/>When Charlotte Lane returned to her room, Kevin Clark had already finished his shower. He was sitting beside the bed, reading the messages on his phone.<br/><br/>Hearing her footsteps, Kevin Clark looked up at her.<br/><br/>Charlotte Lane surveyed the room before replying to him, “Where are the kids?”<br/><br/>“Uncle Lane and Aunt Lane took them to their room.” Kevin Clark extended his hand towards her.<br/><br/>Charlotte Lane stopped a meter away from him, “When did they take them?”<br/><br/>“About ten minutes ago.” Kevin Clark’s eyes, tinged with red from the wine, glimmered with a subtle hint of mischievousness, making him seem alluring.<br/><br/>“Kevin Clark.” Charlotte Lane scrutinized him, her voice catching slightly, “You don’t look like a good person right now.”<br/><br/>The smile in Kevin Clark’s eyes deepened. He reached out to grab Charlotte Lane’s hand, pulling her towards him. Holding her waist, he had her sit on his lap, “Don’t you miss me?”<br/><br/>“Just a reminder, we’re at my house.”<br/><br/>“Mm, I know.” Kevin Clark gently kissed her, “This is the place where you grew up.”<br/><br/>Charlotte Lane stared at him.<br/><br/>“Doesn’t that make it even more meaningful?”<br/><br/>Charlotte Lane: “......” How could it be meaningful? How could it possibly be meaningful?<br/><br/>Looking at her uncomprehending expression, Kevin Clark said gently, “The rooms are soundproof, my dear, so don’t be shy.”<br/><br/>Charlotte Lane chuckled, shaking Kevin Clark’s chin and saying, “Just don’t chicken out, Third Master.”<br/><br/>Kevin Clark laughed, then spun her around and pinned her to the bed.<br/><br/>Charlotte Lane held down his shoulders: “I haven’t taken a shower yet.”<br/><br/>“We could... take one later...”<br/><br/>A thin layer of sweat had developed on Charlotte Lane’s body. Kissed until her body went limp, her head throbbing and her eyes teeming slightly, all of her senses at this moment were about Kevin Clark.<br/><br/>Amid the blurriness, Kevin Clark suddenly got up, and her ears caught the sound of plastic crinkling.<br/><br/>Her consciousness cleared a bit. She glanced over at the bedside table, and noticed a package that had been opened, causing her forehead to twitch.<br/><br/>When did he buy it?<br/><br/>He came prepared.<br/><br/>Taking her for a medical check-up, moving the children away, even buying that thing...<br/><br/>“What are you thinking about?” Kevin Clark enquired breathlessly.<br/><br/>“I was thinking about how you had planned this all.” Charlotte Lane’s voice was hoarse.<br/><br/>Kevin Clark chuckled, kissing her forehead, eyelashes, eyes, and the tip of her nose: “How can this be considered scheming? Compared to my dear wife drugging me, this is nothing.”<br/><br/>“Bringing up the past.” Charlotte Lane’s voice was cold, but the teary layer in her beautiful phoenix eyes weakened her intimidating look.<br/><br/>“Yes.” Kevin Clark kissed her lips.\t\t\t\t\t\t</div>", "images": {}, "success": true}