{"id": 617, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15047515.html", "title": "Chapter 614: 557: Happiness Every Time", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 614: 557: Happiness Every Time</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 614: Chapter 557: Happiness Every Time<br/><br/>Charlotte knew Luke and Logan quite early.<br/><br/>Among the siblings, Logan looked somewhat fierce with prominent facial features and sometimes shaved his hair down to the scalp, giving off an aura of someone not to be messed with.<br/><br/>Although Luke also had sharp facial features, he always carried a smile at the corner of his mouth and his eyes were always gentle.<br/><br/>He looked like a gentle gentleman.<br/><br/>But Charlotte was well aware that Luke’s heart was hard and dark.<br/><br/>He always wore a smiling face, and his voice was forever gentle, but he was ruthless and quite impatient.<br/><br/>James Collins had taken quite a beating from him in the past, and now seeing him, he spoke very little.<br/><br/>His personality was completely opposite to his face.<br/><br/>But Luke was quite patient with this girl.<br/><br/>If Luke was facing James Collins at this point, he would have definitely beaten him up by now.<br/><br/>Luke came out and sat opposite Kevin Clark and Charlotte Lane.<br/><br/><br/><br/>Charlotte looked at him and asked, “How is she doing now?”<br/><br/>“Her condition is not bad, she doesn’t stare blankly or scream for long periods like before. She’s also not afraid of people anymore.” Luke said, “It’s just that... she’s not very smart.”<br/><br/>Charlotte didn’t need him to tell her that and asked, “What did the doctor say?”<br/><br/>“She was overly stimulated, her nervous system is in disorder, and she is somewhat mentally abnormal.” Luke continued, “So... she’s become very childlike. The doctor says... it’s hard to say whether she can recover.”<br/><br/>Charlotte was silent for a moment.<br/><br/>Kevin Clark looked at her, feeling a bit strange about Charlotte’s reaction.<br/><br/>“What’s the situation at her home?” Charlotte asked again.<br/><br/>“She has too many siblings, they don’t pay much attention to her.” Luke said, “They didn’t even look for her when she went missing, so it took some time to find her family.”<br/><br/>“Then her family...”<br/><br/>“They prefer boys over girls. They never really liked her. After they knew about her current state, they didn’t want her anymore.” Luke said, “So I brought her back.”<br/><br/>“How old is she now?”<br/><br/>“Twenty-five.”<br/><br/>“And her name?” Charlotte asked again.<br/><br/>“Leah Campbell.”<br/><br/><br/><br/>She was afraid that Charles would feel neglected.<br/><br/>Especially today, when the full moon banquet was held on a large scale, almost everyone was surrounding the two children and gave them so many gifts.<br/><br/>Charles had been beside the two little ones all along, so he knew everything about them.<br/><br/>Sophie Ortiz was worried that Charles would inevitably feel a gap.<br/><br/>So she accompanied Charles all day today.<br/><br/>Until she spoke to Charlotte and heard Charlotte say, “Mom, don’t worry. The things given to Ethan Clark and Noah Clark are left over for Charles. The sum of the two might not even be as much as what Charles got alone.”<br/><br/>Sophie Ortiz: “......”<br/><br/>“We will pay attention.” Charlotte added.<br/><br/>“That’s fine.” Sophie Ortiz said.<br/><br/><br/><br/>Then that night when they went home... Charlotte embezzled 200 dollars from Charles.<br/><br/>James Allen and the others all gave Charles red envelopes.<br/><br/>As for why they didn’t give gifts... Because Charles only likes money.<br/><br/>That night, Charles hid the money.<br/><br/>Charlotte used the pretext of visiting Charles before bedtime to take 200 dollars from the red envelope under his pillow.<br/><br/>Charles saw her hand reach under the pillow, and when it came out, it held 200 dollars.<br/><br/>That night... Charles felt his life was gloomy.<br/><br/>So much so that he slept particularly well that night.<br/><br/>The next day after breakfast, Charlotte went upstairs, and at the entrance of their bedchamber, she heard Charles, who should have been at school, talking to Ethan Clark and Noah Clark inside the room.<br/><br/>“Here are the red envelopes from brother.” Charles whispered, “I hope you guys grow up quickly.”<br/><br/>“It was originally a whole number, but last night mom took 200...” Charles sighed a little, “She’s just insincere. She must be happy spending my money, so she always takes my money. So these cash gifts are for you to keep so she can take them, and she’ll be happy each time she spends money...”<br/><br/>Charlotte listened outside and laughed, then personally took Charles to school and warned, “If you skip school again, I’ll send you to a boarding school.”<br/><br/>Charles pouted and got out of the car.<br/><br/><br/><br/>While Charlotte was turning the car around, she watched him chat and laugh with the girl from the ID photo as they entered the school together.<br/><br/>He even took something out of his backpack to give her.<br/><br/>Charlotte called them little rascals while taking photos of them and sending them to Kevin Clark and Edward North.\t\t\t\t\t\t</div>", "images": {}, "success": true}