{"id": 611, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15047503.html", "title": "Chapter 608 - 551: Dragon-Phoenix Twins", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 608 - 551: Dragon-Phoenix Twins</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 608: Chapter 551: Dragon-Phoenix Twins<br/><br/>Charlotte Lane sat on the sofa looking at Kevin Clark.<br/><br/>Upon hearing her, Kevin’s pupils dilated. Although he had rehearsed this scenario countless times in his mind, his brain still blanked for a moment, and his face turned slightly pale.<br/><br/>But he forced himself to calm down immediately.<br/><br/>He quickly took out his cell phone and unlocked it with trembling fingers. He had to try twice before succeeding, and then he called Thomas Firway.<br/><br/>“Drive the car to North Court, hurry!”<br/><br/>Upon hanging up, Kevin rushed to the cloakroom and grabbed two clothes, wrapping Charlotte in one and carefully lifting her up: “Does it hurt a lot?”<br/><br/>“It’s okay,” Charlotte replied with one arm around his neck, looking at his bloodless lips and stiff body. She couldn’t tell if she was giving birth or if he was.<br/><br/>Why was his reaction even bigger than hers?<br/><br/>Thomas Firway’s car arrived quickly.<br/><br/>Kevin put Charlotte in the car and buckled her seatbelt. Alfie Ward quickly got in as well.<br/><br/>“Drive fast, but steady,” Kevin told Thomas.<br/><br/>After glancing at Charlotte, Thomas started the car: “Yes, sir.”<br/><br/>As soon as the car started, Kevin called the hospital to let the doctors know they were on their way.<br/><br/>When he finished the call, Alfie asked, “Should we inform the family?”<br/><br/>“You handle it,” replied Kevin.<br/><br/>“Yes, sir.”<br/><br/>“Does it hurt?” Kevin held Charlotte’s hand.<br/><br/>Charlotte gripped his hand: “Try to stay calm.”<br/><br/>“I’m fine.”<br/><br/>“Take back your shaky voice and then say you’re fine.”<br/><br/>Kevin closed his mouth and said nothing.<br/><br/>When they arrived at the hospital, a group of doctors was waiting.<br/><br/>After examining Charlotte, they immediately wheeled her into the delivery room.<br/><br/>Kevin subconsciously wanted to go in with her.<br/><br/>“Stay there,” Charlotte suddenly said.<br/><br/>Kevin stopped: “Can’t I go in?”<br/><br/>The doctor looked at him: “Yes, husbands can go in for the delivery.”<br/><br/>Everyone online was watching the dynamics, looking forward to the arrival of the little ancestors of the Clark and Lane families.<br/><br/>Outside the delivery room, the crowd gradually grew, people stepping aside to make a way, all of them waiting quietly.<br/><br/>When Charles Amos arrived at the hospital, he ran inside. Coincidentally, James Collins and Damian Brown saw him at the entrance and called out to him twice, but he didn’t hear them and disappeared in a puff of smoke.<br/><br/>When he reached the outside of the delivery room, Charles Amos ran straight to Natalie Wayne’s side.<br/><br/>“How did you get here?” Natalie Wayne asked, surprised.<br/><br/>Charles Amos, drenched in sweat, had his hair sticking to his forehead, his little face flushed red, and was panting so hard he couldn’t speak clearly, “My mom...”<br/><br/>“It’s okay. Don’t be afraid.” Natalie Wayne wiped his sweat, “It should be over soon.”<br/><br/>Charles Amos’ eyes were red, he was scared, and he wanted to cry, but he didn’t dare to cry.<br/><br/>After Natalie finished wiping his sweat, he stood by her side for a while before moving on to stand next to Kevin Clark.<br/><br/>He called Kevin Clark’s name a couple of times, but there was no response. So he just stood next to him in silence.<br/><br/>One big and one small, they stood still, like two wooden stakes.<br/><br/>Meanwhile, Arthur North never got close; he stood in the farthest place, watching this scene all by himself.<br/><br/>He didn’t dare get closer; that place had memories he could never touch.<br/><br/>After a long time, the door to the delivery room opened.<br/><br/>Kevin Clark was the first to rush forward.<br/><br/>The Clarks and Lanes immediately crowded around.<br/><br/>Charles Amos squeezed his way to the front from the crowd.<br/><br/>One of the doctors, accompanied by two nurses, carried the babies out.<br/><br/>Seeing a group of people surrounding them outside, the nurse holding the babies instinctively retreated a step back, not knowing what had happened.<br/><br/>The doctor was also taken aback.<br/><br/>When he went in, there were only three people outside. How could there be such a large crowd gathered when he came out?<br/><br/>“Where’s my lady?” Kevin Clark grabbed the doctor’s arm.<br/><br/>In that instant, the doctor felt like his arm was going to break, “Mrs. Clark is fine; she’s doing well. She’ll be out in about two hours after being observed in the delivery room. The children are also very... ”<br/><br/>“Can I go in?” Kevin Clark interrupted him.<br/><br/>The doctor almost bit his tongue, swallowing hard and said, “But Mrs. Clark said not to let you in. She asked you to wait outside.”<br/><br/>Kevin Clark furrowed his brows and let go of the doctor’s arm.<br/><br/>Nobody noticed the blood on the doctor’s white lab coat sleeve.<br/><br/>The doctor continued, “The children are very healthy. One boy, weighing 2,800 grams, which is about five pounds and six ounces. The girl weighs 2,700 grams, about five pounds and five ounces...”\t\t\t\t\t\t</div>", "images": {}, "success": true}