{"id": 621, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15052380.html", "title": "Chapter 618: 560: The Big Wedding_2", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 618: 560: The Big Wedding_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 618: Chapter 560: The Big Wedding_2<br/><br/>Charlotte Lane wouldn’t change her mind.<br/><br/>The screenwriter award for Flynn Ninevara was collected on Catherine’s behalf by Morris.<br/><br/>George Dunn collected Daisy Zane’s Best Actress award on her behalf.<br/><br/>Both explained that she was unable to leave the laboratory. Everyone expressed their understanding.<br/><br/>Charlotte Lane stood motionless at the entrance of the laboratory for a long time when she saw the news online.<br/><br/>She stared at the name “Daisy Zane” on the trophy, unable to come to her senses for a long time.<br/><br/>The name Daisy Zane finally appeared in the Best Actress lineup.<br/><br/>Flynn Ninevara and Daisy Zane appeared together in the same movie and both won awards.<br/><br/>“Little girl,” Kevin Clark gently touched her face.<br/><br/>Charlotte Lane looked at Kevin Clark and regained her senses: “Shouldn’t I have dropped everything and gone to the awards ceremony last night?”<br/><br/>Kevin Clark touched her reddened eyes: “Last night, Lady Zane went.”<br/><br/><br/><br/>Charlotte Lane looked at him and laughed after a moment.<br/><br/>Kevin Clark always knew how to comfort her precisely.<br/><br/>Not appearing in person at the awards ceremony became Charlotte Lane’s regret.<br/><br/>Once she was less busy at the Research Institute, Charlotte Lane planned to write a new script and participate in another award show during her free time.<br/><br/>In November, “Hope” was nominated for the Golden Tiger Award again.<br/><br/>When Charlotte Lane received the news, she was thinking of a name for her female lead character, and then she named her character Jin Yin (Golden Tiger).<br/><br/>On December 29th, Charlotte Lane attended the awards ceremony.<br/><br/>Kevin Clark accompanied her and even went directly to the venue, sitting next to Charlotte Lane.<br/><br/><br/><br/>Charlotte Lane felt a sour swelling in her heart. She pinched her fingertips and turned her head to look at Kevin Clark.<br/><br/>Kevin Clark’s eyes were filled with tender laughter as he looked at her. It quickly soothed Charlotte Lane’s emotions.<br/><br/>She stood up, turned around, and bowed slightly.<br/><br/>Kevin Clark, Morris, and George Dunn all stood up.<br/><br/>As Charlotte Lane looked at them, Gentry Morris opened his arms as if to hug her.<br/><br/>However, the instant his arms opened, Kevin Clark’s gaze, filled with laughter as he watched Charlotte Lane, suddenly floated over.<br/><br/>The tender laughter instantly turned into a cold, sharp blade.<br/><br/>Feeling his life was threatened, Gentry Morris quickly dropped his hands and laughed awkwardly.<br/><br/>Those present who knew what had happened burst into laughter.<br/><br/><br/><br/>Not just the people at the scene, but even the netizens watching the live stream couldn’t help laughing.<br/><br/>[Third Master’s gaze is oppressive.]<br/><br/>[Third Master: Morris, you old fellow, you don’t want your hands.]<br/><br/>[Holy cow! Third Master’s change of expression, I’ve been killed through the screen.]<br/><br/>...<br/><br/>Charlotte Lane knew what had happened just by the speed at which Morris dropped his hand. She turned around to look at Kevin Clark.<br/><br/>Kevin Clark was still smiling tenderly at her.<br/><br/>George Dunn also laughed at this double standard of changing expressions.<br/><br/>Morris: “......”<br/><br/>Charlotte Lane comforted her brother and patted Morris’s arm. She then glanced at Kevin Clark and went on stage to accept the award.\t\t\t\t\t\t</div>", "images": {}, "success": true}