{"id": 627, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15097247.html", "title": "Chapter 624: Extra Episode 1", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 624: Extra Episode 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 624: Extra Episode 1<br/><br/>[Gossiping about the wedding guests.]<br/><br/>On the day after the big wedding, the hot search was still hanging online.<br/><br/>And somehow a photo leaked out.<br/><br/>It was a photo of the guest seats, showing two tables of guests, all very clear.<br/><br/>[Let’s start with the lady on the left side of the table, the first one in the photo with a somewhat exotic appearance. She is said to be a former young lady of Sutton Family in Imperial Capital. Now...it’s not clear exactly what she does. But friends from D Continent say...she’s quite influential there.]<br/><br/>[Next up is this Western-looking woman, the one with the slicked-back hairstyle, who looks like a real big shot. She’s the M Continent Chamber of Commerce Chairman. With countless wealth, she can be described as a walking stack of money.]<br/><br/>[This man with dyed pink hair turned grey now... this one, this one... branded clothes, luxury watches, limited edition cars. According to insiders, he was spotted three times, driving different cars every time, but with no identifiable background. The more mysterious, the bigger the boss.]<br/><br/>[This man with a slightly older age, who’s been mosaicked... Just think about Dark Street, think hard about Dark Street! No more talk, lest there be trouble.]<br/><br/>[And then there’s this gentlemanly Western man. From Mountain Sea Continent. Everyone can try to guess his identity, but he’s already considered quite high-ranking.]<br/><br/>[And then, this one... background unknown, but according to some insiders, he is with another powerful faction in the Mountain Sea Continent.]<br/><br/><br/><br/>[Lastly... this man with long hair, no need to analyze. You can search for the Monarch Dynasty of M Continent. But just search quietly, and it’s best not to make any remarks!]<br/><br/>...<br/><br/>This highly connected blogger made very accurate analyses of each guest.<br/><br/>The netizens were eagerly watching the drama unfold.<br/><br/>[It’s true that the friends of big bosses are all big bosses themselves.]<br/><br/>[No wonder they are all so extravagant.]<br/><br/>[Do I care about their background? I care about how they all look so good. Am I only attracted by money? Well, yes.]<br/><br/>[To be fair, that Chairman...is quite the vixen. Just asking quietly, is she lacking a girlfriend?]<br/><br/>[No offense, I just think that man with long hair looks really handsome.]<br/><br/>[I have no intention of marrying into the M Continent royal family, I just want to ask if he has a girlfriend. Since the blogger knows so much, he should be able to answer too.]<br/><br/>[Why show me a photo of the guests? I want to see the bride and groom.]<br/><br/>[It’s such a pity that there are no photos of Third Master and Brook Sister with their godlike appearance.]<br/><br/>[That’s right, I want to see photos, I want to see Brook Sister’s photos, I want to see Uncle’s photos!]<br/><br/>[Am I the only one concerned about the blogger’s identity? No one else managed to take photos of the wedding scene, only he did. And he knows so many details.]<br/><br/>...<br/><br/>Just as everyone was passionately discussing, the entire Weibo post and all the photos that were reposted were deleted.<br/><br/>[??????????]<br/><br/><br/><br/>Gael Easton: “......” This little brat, this whole family...<br/><br/>Gael Easton watched Charles Amos run away, then looked down at the two little ones beside him and spoke softly, “When you grow up, don’t learn from them.”<br/><br/>...<br/><br/><br/><br/>Charles Amos went to snitch, ran to the living room, and asked the housekeeper. He learned that Kevin Clark and Charlotte Lane hadn’t come out of the bedchamber yet. So, he grabbed two bottles of water and returned to the pavilion to find Gael Easton.<br/><br/>At half past ten, Holt Lawrence called, and Charlotte Lane finally woke up.<br/><br/>She reached for her phone and then pulled the quilt over her head, bringing the phone under the quilt as she answered.<br/><br/>“Nana, have you seen the news online?”<br/><br/>“What?” Charlotte Lane asked.<br/><br/>Holt Lawrence heard her voice and was silent for a moment.<br/><br/>This Third Master... was even better than he had imagined.<br/><br/>Last night was their wedding night, and he deliberately waited until half past ten to call today, but...<br/><br/>“Uh, that, um... ”<br/><br/>“What?” Charlotte Lane asked.<br/><br/>Kevin Clark saw her wake up and came over to pull her quilt down.<br/><br/>Charlotte Lane glanced at him, covered herself with the quilt again, and turned to face the other side.<br/><br/>Kevin Clark: “......”<br/><br/><br/><br/>Holt Lawrence said, “The wedding scene was photographed yesterday and posted online. Moreover, this person has given a detailed introduction to everyone in the photos.”<br/><br/>Charlotte Lane’s voice was filled with interest: “Really? And you couldn’t trace it?”<br/><br/>“I managed to,” Holt Lawrence said, “but the information I found is fake. I’m still investigating further. It feels like this person is challenging us.”<br/><br/>“Sounds interesting,” Charlotte Lane said.<br/><br/>“Nana, strangers can’t enter the Clark Manor,” Holt Lawrence said. “Could it be one of your relatives or friends?”<br/><br/>“This person could temporarily avoid your investigation, and the photos may not necessarily have been taken from the Clark Manor,” Charlotte Lane peeled off Kevin Clark’s hand that was touching her head through the quilt. “It’s possible they were hacked from someone’s phone.”<br/><br/>“True,” Holt Lawrence agreed. “But it seems that the other party just wants to challenge us and not offend us.”<br/><br/>“Keep looking into it, and we’ll talk when there’s news,” Charlotte Lane said.<br/><br/>After hanging up, Kevin Clark’s hand reached into the quilt and touched her face, “Why are you still angry?”<br/><br/>“Morning grumpiness,” Charlotte Lane replied softly.<br/><br/>Kevin Clark laughed, pulling her out of the quilt and tenderly kissing her, “Is it morning grumpiness or post-coital grumpiness?”<br/><br/>“Heh,” Charlotte Lane gripped Kevin Clark’s collar, her eyes fiery, “Let me go sleepless night after night again, and I’ll let you experience the danger of sleeping in separate rooms.”<br/><br/>Kevin Clark touched her face and spoke softly, “Alright, I won’t dare next time. I’ll control myself more.”\t\t\t\t\t\t</div>", "images": {}, "success": true}