{"id": 628, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15160452.html", "title": "Chapter 625: Extra Episode 2", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 625: Extra Episode 2</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 625: Extra Episode 2<br/><br/>After resting at home for half of the day after getting married, Charlotte Lane and Harton Clark went to the Research Institute.<br/><br/>They stayed there for more than a week before finally finding time to return home.<br/><br/>In the evening, when the nanny was about to give the two children a bath, Harton Clark also followed into the restroom.<br/><br/>Charlotte Lane originally wanted to help, but after seeing Charles Amos help, she just stood at the door for a while and then returned to the room.<br/><br/>Holt Lawrence sent her the investigation information.<br/><br/>Charlotte Lane read the message, thought for a while, grabbed a sticky note from her bedside table, wrote a few words, and then went to the cloakroom to change her clothes. She then put on a bag and left.<br/><br/>After Harton Clark finished giving the two children their baths and came out, he saw that the bedchamber was empty, except for the sticky note on the bedside lamp.<br/><br/>It read: [Going on a mission, at the Doomsday Hotel, be back in two hours, don’t worry.]<br/><br/>Harton Clark: “......” While he was giving the children a bath, his wife left him by herself to play.<br/><br/>After arriving at the Doomsday Hotel, Charlotte Lane requested the master control card from the manager and then entered the elevator to go to the desired room.<br/><br/><br/><br/>At the door of the room, she swiped the card directly to enter.<br/><br/>The light was still on inside.<br/><br/>She closed the door and Charlotte Lane strutted in.<br/><br/>She came to the living room, looked around, and then said, “Come out.”<br/><br/>The curtains on the balcony swayed, and soon, a woman rushed towards Charlotte Lane, dagger in hand.<br/><br/>Charlotte Lane dodged the dagger with ease and then fought with the woman.<br/><br/>Five minutes later, the woman was defeated.<br/><br/>Charlotte Lane kicked away the dagger from the woman’s hand, grabbed her wrist, pulled her to her side, pressed her knee against her abdomen, pulled her back, and then kicked her away.<br/><br/>The woman knocked over the floor lamp, rolled on the ground for a few times before stopping, clutching her abdomen, and staring at Charlotte Lane.<br/><br/>Charlotte Lane casually adjusted her clothes, then sat on a nearby stool and asked, “Had enough?”<br/><br/>It took the woman a while to speak: “Yes, I concede.”<br/><br/>Charlotte Lane smiled faintly and said, “Now, tell me, what do you want by deliberately drawing our attention?”<br/><br/>“It’s refreshing to deal with smart people. No need to beat around the bush.” The woman propped herself up against the wall and looked at Charlotte Lane.<br/><br/>“What do you do for a living? Intelligence?” Charlotte Lane asked, “You know so many people, you must travel between different continents and have dealt with many people.”<br/><br/><br/><br/>On the contrary, she smiled.<br/><br/>Her smile seemed to say they would eventually cooperate.<br/><br/>...<br/><br/>When Charlotte left the Doomsday Hotel, she saw Harton Clark’s car outside.<br/><br/>She left her own car in the parking lot and got into Harton’s.<br/><br/>“Is it settled?” Harton looked her up and down.<br/><br/>“Not really settled, just had a fight,” Charlotte said.<br/><br/>“What happened?”<br/><br/>Charlotte casually said: “Someone told me that men, after some time, would be attracted by the fragrance of wild flowers.”<br/><br/><br/><br/>Harton, who was about to start the car, slammed on the brakes.<br/><br/>He turned to her: “Who said that?”<br/><br/>Charlotte smiled and briefly explained the situation.<br/><br/>Harton started the car: “Want to cooperate?”<br/><br/>“No,” Charlotte said. “Setting aside the benefits, I don’t see the need to take risks for her. One Celestial Pivot is enough for domestic use.”<br/><br/>“She has other purposes.”<br/><br/>“Exactly,” Charlotte said. “She wants to strengthen herself, cooperate with me, and even draw me in. She’s deliberately staying at the Doomsday Hotel. I thought about it and then my brother came to mind.”<br/><br/>Harton chuckled, “Young Master Lane is quite popular with the ladies recently.”<br/><br/>“Holt Lawrence has checked her background, and it’s clean,” Charlotte said. “She seems smart at the moment. As for her character, it’s not easy to say.”<br/><br/>“What about the one from the Dance Association?” Harton asked.<br/><br/>“The girl from the Dance Association,” Charlotte said. “She has a simple background, coming from the countryside with two elder sisters and a younger brother. Raised in a family that values boys over girls. Dropped out of school before graduating from junior high. She’s only twenty this year and is now working at the Dance Association, earning money, and studying.”<br/><br/>Harton nodded.<br/><br/>“However... it seems she’s not interested in my brother.”<br/><br/><br/><br/>Harton laughed inappropriately.<br/><br/>“So... my future sister-in-law might still be casting her net,” Charlotte said.<br/><br/>Harton understood, the more people, the more hope for a sister-in-law.\t\t\t\t\t\t</div>", "images": {}, "success": true}