{"id": 623, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15057335.html", "title": "Chapter 620: 560: The Big Wedding_4", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 620: 560: The Big Wedding_4</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 620: Chapter 560: The Big Wedding_4<br/><br/>[So...do you think Grandma and Daisy eventually left because of the elixir?]<br/><br/>[It’s very likely, Brook Sister has been studying 319 from the very beginning and has been very persistent about it.]<br/><br/>...<br/><br/>While discussing online, Charlotte Lane, Kevin Clark, William Lane, Hugo Clark, Olivia Lane, Allonzo Hobson, Robinson Scott, Turner Daniel, Siera Santiago, and Charles Amos.<br/><br/>Everyone went to Cold Green Village together.<br/><br/>Originally, Charlotte Lane and Kevin Clark planned to take advantage of the New Year’s holiday to visit Cold Green Village when they were a bit more free.<br/><br/>But when they told the others, they all suddenly came on the day of departure.<br/><br/>William Lane said if they were going, they might as well all go together.<br/><br/>So, everyone went to Cold Green Village together.<br/><br/>They were excited on the way there, but once they arrived and saw the poverty of Cold Green Village, they were all a bit dumbfounded.<br/><br/>They had never encountered such poverty before in their lives.<br/><br/><br/><br/>“Sister, how long did you live here?” They were climbing the mountain, and Olivia Lane asked.<br/><br/>“Not too long,” Charlotte Lane said, “but I come back every year.”<br/><br/>At that time, Daisy Zane was her only ray of light, she desperately wanted to hold onto it, but in the end, it was gone.<br/><br/>So she suddenly closed herself off.<br/><br/>At that time, her heart was filled with hatred, and all she wanted was revenge. Once she had her revenge... she would go with them.<br/><br/>She used every means at her disposal, including taking advantage of Kevin Clark’s proximity to her.<br/><br/><br/><br/>Afterward, Turner Daniel and Siera Santiago bowed to Victoria Zane’s tomb.<br/><br/>Dean Yue asked the two of them to come and pay their respects to Victoria Zane before he left, so they both came along today.<br/><br/>After the two of them finished paying their respects, everyone else bowed together as well.<br/><br/>If it hadn’t been for Victoria Zane and her husband blowing up the Laboratory in the past and her providing the data,<br/><br/>Who knows when the research and production of the Rebirth elixir would have been completed. And when those persecuted by 319 would have been able to escape the torment and live normal lives.<br/><br/>And who knows how many people would have died back then.<br/><br/>So, Victoria Zane deserved this bow.<br/><br/>...<br/><br/>After coming down from the mountain, the weeds in their living quarters were cleaned again.<br/><br/>Charlotte Lane placed the trophies in the cabinet in the room.<br/><br/>After the cleanup, everyone chatted for a while and then left, leaving only Kevin Clark and Charlotte Lane behind.<br/><br/>With so many people, it was not only overwhelming but there was also no room for them to stay.<br/><br/><br/><br/>So they all left before it got dark.<br/><br/>“It’s so quiet now,” Kevin Clark said.<br/><br/>“Third Master, you’re going too far. You have people clean up the courtyard for you and then you complain they’re noisy,” Charlotte Lane said.<br/><br/>“It’s not noisy, it’s clamorous,” Kevin Clark replied.<br/><br/>Charlotte Lane touched the grown-up white orchid tree, “At this rate, in a few years, we can sit in its shade.”<br/><br/>“Yes,” Kevin Clark agreed, “We can have the house expanded, and by then, bring Casey Cannon, Bryce Cannon, and Isabella Lane to come over.”\t\t\t\t\t\t</div>", "images": {}, "success": true}