{"id": 626, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15097244.html", "title": "Chapter 623: 560: The Grand Wedding_7", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 623: 560: The Grand Wedding_7</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 623: Chapter 560: The Grand Wedding_7<br/><br/>Finally, they gave in and told the location of the shoes.<br/><br/>“Hurry up, Arthur.” Allonzo Hobson quickly handed her the shoes.<br/><br/>They left the room and respectfully served tea to Old Master Lane, the Andrew couple, and Aunt Cruz.<br/><br/>William Lane carried Charlotte Lane out of the Lane family home.<br/><br/>“Brother,” Charlotte suddenly spoke on William’s back, “so that’s why you never carried me when we were young.”<br/><br/>“Mm,” William’s eyes rimmed red, “thinking that one day I would carry you out for your wedding, I didn’t want to carry you at all.”<br/><br/>Charlotte smiled: “Fortunately... it’s not far away. I can often come back and see you frequently.”<br/><br/>“Why do I feel like you’re complimenting Harton Clark?” William said, “Are you saying that you married well?”<br/><br/>“Ah, you found out,” Charlotte laughed, “Didn’t I marry well?”<br/><br/>“Yes,” William nodded, “I’m very satisfied with it. Our Lila will always be happy.”<br/><br/><br/><br/>...<br/><br/>The wedding was held at Clark Manor.<br/><br/>So after leaving the Lane family home, they followed the planned route and circled half of Imperial Capital.<br/><br/>The atmosphere was festive everywhere they went, with an entourage of flowers, and luxury cars escorting them.<br/><br/>The procession of cars seemed endless.<br/><br/>From the entrance of Clark Manor to the wedding venue, the roads on either side were adorned with lotuses and roses.<br/><br/>Friends and relatives filled the seats on either side of the red carpet. Some seats were purposely left empty.<br/><br/><br/><br/>Charlotte stood in the room for a while, then turned and went downstairs to the courtyard.<br/><br/>Harton had drunk quite a lot of wine but was still sober; only the corners of his eyes were red.<br/><br/>He was eager to return to the room, but when he reached the courtyard and saw Charlotte dancing among the flowers, he stopped in his tracks.<br/><br/>Charlotte twirled among the blossoms, her eyes sparkling with laughter. Light on her feet, she slowly raised her hands above her head and spun.<br/><br/>She hadn’t yet removed her Phoenix Crown, and its tassels swayed gently with her movements.<br/><br/>She had taken off the long cloak over her wedding dress, revealing the lighter garments beneath, which fluttered in the night breeze.<br/><br/>The red wedding dress made Charlotte even more stunning and breathtaking.<br/><br/>Harton watched her for a moment before slowly approaching.<br/><br/>Seeing Harton approach, Charlotte stopped spinning, and her hands fell by her side.<br/><br/>At the moment her hands dropped, Harton reached out and caught them.<br/><br/><br/><br/>Charlotte stopped, her eyes infused with laughter as she looked at him.<br/><br/>Harton gazed at her for a while before kneeling on one knee and reverently kissing her hand...<br/><br/>Amidst the soft night breeze, the clear moonlight, blooming lotuses, and enchanting roses...<br/><br/>Surrounded by the swirling flowers, he kissed his entire world.<br/><br/>He vowed to hold her hand, journeying together toward their twilight years.<br/><br/>...<br/><br/>– The End –<br/><br/>September 4th, 2022<br/><br/>Full Moon Flower Festival\t\t\t\t\t\t</div>", "images": {}, "success": true}