{"id": 629, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15160459.html", "title": "Chapter 626: Extra Three: Ink Dot Plum Scent (Part One)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 626: Extra Three: Ink Dot Plum Scent (Part One)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 626: Extra Three: Ink Dot Plum Scent (Part One)<br/><br/>At six in the afternoon, William Lane parked the car at the entrance of the Dance Association.<br/><br/>He watched the people occasionally coming out, wearing their Dance Association practice uniforms. Gradually, a figure materialized in front of his eyes.<br/><br/>Five or six years ago, he had gone to a town on business.<br/><br/>Just as he was about to enter the police station, he collided with a young girl who seemed lost and disoriented coming out from inside.<br/><br/>He had noticed from a distance the figure emerging from inside, walking along the same line as him, so he moved aside. But to his surprise, the young girl had her head down and steadily deviated from her course, eventually bumping right into him.<br/><br/>Upon making contact with him, the documents in the girl’s hand scattered all over the ground. She seemed to snap back to reality, quickly stepping back a pace and said nervously with her head bowed, “Brother, I’m so sorry, I wasn’t paying attention...”<br/><br/>And as she spoke, she squatted down to pick up the things on the ground.<br/><br/>William Lane looked down, the first thing he saw were the canvas shoes on the girl’s feet. They were faded and discolored, the glue had come apart, but they were spotlessly clean.<br/><br/>After that, he noticed ordinary black skinny pants.<br/><br/>The girl was squatting down picking things up, he saw her wearing a white short sleeve that had been washed till its edges were frayed.<br/><br/><br/><br/>She had short hair, just enough to cover her ears.<br/><br/>While helping her pick up the papers, William Lane inadvertently saw his own hand holding a copy of the Household Register which read: Third Daughter, Harper Smith.<br/><br/>His initial reaction was, this family must really want a son.<br/><br/>The girl had finished picking up and discovered one more document in William Lane’s hand. She slowly extended her hand, lightly taking the paper, glanced at him and quickly averted her gaze. Her voice was very soft, and she seemed to have a cold, “Thank you, brother.”<br/><br/>Because she looked up, William Lane saw her face.<br/><br/>She looked very young.<br/><br/>Just by looking at her face and not her height, one would know she was still a child.<br/><br/>She had a pretty pair of doe-like eyes, and as if she had been crying not long ago, they were still reddish.<br/><br/>For some unknown reason, a wave of sympathy welled up in the gentlemanly Young Master Lane, prompting him to ask, “Did you achieve what you came here for?”<br/><br/>“Hmm.” The girl took the copy from his hand, stood up, and with a nasal voice said, “I wanted to change my name, but it’s too much trouble. They also need my parents here, otherwise they won’t do it.”<br/><br/>William Lane also stood up.<br/><br/>Harper Smith... The name of a daughter who was named in anticipation of a son.<br/><br/>The girl again bowed her head and said, “I’m sorry, brother.”<br/><br/>William Lane chuckled, his voice took on a warm note, “It’s okay. So, what do you plan to do?”<br/><br/>“I’ll come back tomorrow, the day after tomorrow, and continue coming.” The young girl declared defiantly, “Until they do it.”<br/><br/>William Lane raised his eyebrows.<br/><br/>The girl again said, “I’m sorry, brother, I have to go.”<br/><br/>And with that, she left.<br/><br/>William Lane watched her leave, and didn’t think much of it after that.<br/><br/><br/><br/>Until three days later, when he came again.<br/><br/>Upon leaving, he saw the young girl sitting on the steps eating corn.<br/><br/>This time, the documents in her hand were in a transparent bag. While munching on the sticky corn, she used the documents as a makeshift fan.<br/><br/>As William Lane was giving instructions to his assistant, his eyes inadvertently drifted towards her.<br/><br/><br/><br/>He truly didn’t give the matter any further thought.<br/><br/>Knowing it wouldn’t cause him any trouble, he decided to help just because he could.<br/><br/>To him, it was just a minor act of kindness, something he saw as doing a good deed for the day.<br/><br/>For a long time afterwards, as he was busy searching for his sister and dealing with another sister who was not attending school properly, he forgot about the young girl.<br/><br/>Until... four years later, at a Dance Association meeting.<br/><br/><br/><br/>His mother introduced him to a young girl who was crowned the champion of last year’s dance competition.<br/><br/>The eighteen-year-old young girl had grown taller, more open-minded, and even more beautiful.<br/><br/>She had also grown out her hair, styling it in a high ponytail.<br/><br/>All Dance Association members have such outstanding personalities.<br/><br/>Everyone was wearing gorgeous clothes and shiny accessories, except her, who dressed the simplest.<br/><br/>Yet, she was the most eye-catching one.<br/><br/>He remembered telling Sophie Ortiz in at that time,<br/><br/>Either truly be simple, or deliberately appeal to people’s attention.<br/><br/>She fulfilled both criteria.<br/><br/>She was genuinely simple, and she genuinely captured the attention of Young Master Lane.<br/><br/>Perhaps, in that moment, she even held his heart for a while.<br/><br/>...<br/><br/>As he was reflecting, William Lane saw a familiar figure exiting from the car.<br/><br/>He pulled out his cell phone and made a call to Amelia Smith, saying as soon as it connected, “The car is outside the entrance. Get in.”<br/><br/>From the Dance Association’s entrance, Amelia Smith turned her head and saw William Lane’s car. She hesitated and after a while, said, “Young Master Lane, I still have things to do.”<br/><br/>“I’ll give you a ride,” William Lane insisted.<br/><br/>“That won’t be necessary, I’ve already called a cab,” Amelia Smith declined politely.<br/><br/>William Lane went quiet for a bit before saying, “Amelia Smith, my mother will be here in five minutes. Would you prefer me to drag you into the car in front of my mother, or will you get in now by yourself?”<br/><br/>Amelia Smith: “......Young Master Lane...”<br/><br/>“Funny enough, my mother decided to come out early today,” William Lane interrupted her.<br/><br/>Amelia Smith stiffened, hearing greetings exchanged behind her with Sophie Ortiz.<br/><br/>And there was William Lane... she saw him getting out of the car!<br/><br/>Without giving it a second thought, Amelia Smith sprinted to William Lane’s car at a hundred-meter dash speed, opened the door, got in, shut the door, and then, leaning over as if trying to stay hidden from someone looking from outside the car window, she looked at William Lane and said, “Young Master Lane...”<br/><br/>“What should you call me?” William Lane, standing outside the car, looked at her.<br/><br/>Amelia Smith looked pitiful. Seeing that he showed no sign of leaving, she finally compromised, “Brother.”<br/><br/>William Lane snorted in amusement, got in the car, and fastened his seat belt, “Fasten your seat belt.”<br/><br/>Amelia Smith, crouching down like an ostrich trying to hide itself, bent her head low to fasten her seat belt, and then bent her body so low that she almost buried her face in her lap.<br/><br/>Fearing of being seen from the car window, she urged, “Hurry up and go. Teacher Ortiz is out. Leave, leave, leave, or we’ll be seen.”<br/><br/>William Lane looked at her and, smiling, started the car and drove away.\t\t\t\t\t\t</div>", "images": {}, "success": true}