{"id": 638, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15174147.html", "title": "Chapter 635: Extra Twelve: Ink Dot Plum Scent (Part Ten)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 635: Extra Twelve: Ink Dot Plum Scent (Part Ten)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 635: Extra Twelve: Ink Dot Plum Scent (Part Ten)<br/><br/>Over these two years since their reunion,<br/><br/>William Lane had clearly expressed his feelings for Amelia Smith.<br/><br/>However, after expressing his feelings, due to Amelia’s young age, her concerns, and her rejection,<br/><br/>William had mostly been a friend and an elder brother to her.<br/><br/>Their conversations were mostly superficial, and oftentimes, six out of ten sentences were sarcastic banter.<br/><br/>William, being more than ten years older, never bothered to give way to the young lady.<br/><br/>He even took advantage of the fact that she couldn’t do much to him, always seeking victory in verbal disputes.<br/><br/>Bullying the young girl.<br/><br/>They seldom had heart-to-heart talks like they did that night.<br/><br/>Amelia appeared to be a simple and innocent girl, but in fact, had many thoughts and concerns of her own.<br/><br/><br/><br/>However, once she faced William, her many concerns diminished to less than ten.<br/><br/>Especially when he was so gentle with her.<br/><br/>She would easily fall for him.<br/><br/>Therefore, until they went back to their rooms to sleep, she had believed every word of William’s and thought that there was something wrong with her own thoughts.<br/><br/>She felt hopeful about the future of their relationship.<br/><br/>But then, after a night’s sleep,<br/><br/>she woke up early in the morning and, while stretching her legs on the bed, she came to her senses.<br/><br/>Although William had the support of the Lane Family, his outstanding abilities were also obvious to all.<br/><br/>Not only did he have the family’s support, he even entered the Research Institute.<br/><br/>He would have been admirable even without his family background.<br/><br/>Moreover, his family background couldn’t be ignored.<br/><br/>With such a large family, many people were vying for the position of being the young master’s wife.<br/><br/>The future Lady Lane needed to be capable of upholding the entire family.<br/><br/>And Amelia wondered what she could do to maintain the family.<br/><br/>People may be equal, but their identities will never be.<br/><br/>To maintain a relationship under such long term inequality, how long could their feelings last?<br/><br/>Instead of eventually parting unhappily, Amelia thought that it might be better to never start at all, leaving the regret of loving each other but being unable to be together deep in their hearts.<br/><br/>In this way, whenever they thought of each other, they would always see the best versions of themselves.<br/><br/>As Amelia thought about this, she switched to stretching her other leg.<br/><br/><br/><br/>And moreover, she did not want any of it.<br/><br/>What about the Lane Family members?<br/><br/>Teacher Ortiz, Chief Lane, Charlotte Lane, Olivia Lane, and... the Lane Family’s Patriarch.<br/><br/>How could they have possibly agreed?<br/><br/><br/><br/>Any marriage would be inappropriate between unequal families.<br/><br/><br/><br/>Initially, she wanted to call Amelia Smith alone, but when she arrived at the Dance Association, she bumped into Sophie Ortiz.<br/><br/>“Huh? How come you’re here? Is Kevin not with you? Did you come by yourself?”<br/><br/>Charlotte raised her eyebrows: “Why are you looking for Kevin Clark when you see me?”<br/><br/><br/><br/>Sophie Ortiz laughed: “Without him accompanying you, I’m just a little curious. Anything up?”<br/><br/>“Just looking for someone.”<br/><br/>“Chloe Davis?”<br/><br/>“Amelia Smith.”<br/><br/>“How did you guys meet?” Sophie Ortiz asked curiously, “What’s up?”<br/><br/>“Having a heart-to-heart.”<br/><br/>Sophie Ortiz laughed and took her to find someone: “A heart-to-heart? You don’t sound familiar.”<br/><br/>“We will be familiar after talking.” Said Charlotte Lane, and then asked, “Mom, how is she?”<br/><br/>“Very good, I like her very much.” Sophie Ortiz said, “Not just because she’s an excellent dancer, she’s also very smart. She has great leadership skills. She can help me train people in dancing, making my life much easier.”<br/><br/>“Looks like you’re satisfied.”<br/><br/>Sophie Ortiz paused, and when she looked at Charlotte Lane, there seemed to be some excitement in her eyes: “What do you mean?”<br/><br/>Charlotte Lane just smiled and didn’t say anything.<br/><br/>“You... naughty girl.” Sophie Ortiz said, “So bad.”<br/><br/>Charlotte Lane just smiled.<br/><br/>“Just go inside.” Sophie Ortiz said, “I’ll find out sooner or later.”<br/><br/>...<br/><br/>The moment Amelia Smith saw Charlotte Lane, she thought it was finally here.<br/><br/>The plot to give her a billion dollars to leave William Lane had finally arrived.<br/><br/>And it arrived so fast.<br/><br/>It seemed she really should leave William Lane.<br/><br/>From the Dance Association to the Coffee Shop, Amelia Smith thought about where she should go, what should she do about school? What should she do in the future?<br/><br/>It wasn’t until she sat down at the coffee shop that she didn’t figure anything out.<br/><br/>“What would you like to drink?” Charlotte Lane said.<br/><br/>“Whatever is fine.” Amelia Smith looked suddenly nervous facing her.<br/><br/>Charlotte Lane glanced at her, then ordered two caramel macchiatos.<br/><br/>Because she thought Amelia Smith looked way too sweet.<br/><br/>“Miss Lane, what can I do for you?” Amelia Smith asked.<br/><br/>“I heard about your situation with my brother...”<br/><br/>“I don’t want the money, I’ll leave Young Master Lane.” Amelia Smith said before Charlotte finished her sentence.<br/><br/>Charlotte raised her eyebrow: “Why leave?”<br/><br/>“Huh?” Amelia Smith looked at her, her face full of surprise and doubt, “What do you mean? Didn’t you come here to tell me to leave him?”<br/><br/>“I just came to see you.” Charlotte Lane held back her laughter, her voice light, but she couldn’t help teasing her. “Just to see how cute my sister-in-law is.”\t\t\t\t\t\t</div>", "images": {}, "success": true}