{"id": 631, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15170398.html", "title": "Chapter 628: Extra Five: Ink Dot Plum Scent (Part Three)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 628: Extra Five: Ink Dot Plum Scent (Part Three)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 628: Extra Five: Ink Dot Plum Scent (Part Three)<br/><br/>Returning to the room.<br/><br/>Ashley Smith closed the door and leaned against it in the dark room, feeling her racing heartbeat and her gradually warm skin.<br/><br/>Night is best at hiding everything, and it is only in the night that she is truly herself.<br/><br/>Only then does she dare to open herself up and face her heart directly.<br/><br/>...<br/><br/>At 5 o’clock the next day, the door to the guest room opened, and Ashley’s head peeked out, looking left and right, seeing no one.<br/><br/>She quickly squatted down, came out of the room, quietly closed the door, and then walked to the railing, secretly looking at the living room downstairs.<br/><br/>No one.<br/><br/>Ashley Smith immediately got up and ran downstairs quickly.<br/><br/>Just as she was about to change her shoes at the entrance, the collar of her back was caught.<br/><br/><br/><br/>Ashley Smith stiffened and dared not move.<br/><br/>“What are you up to? Trying to run?” said William Lane.<br/><br/>Ashley Smith turned around with a smile, “How could I? I just have morning practice, so I want to go early.”<br/><br/>“Morning practice starts at seven o’clock, and it’s five o’clock now.” William Lane looked at her, observing her reaction.<br/><br/>“I... I... I’m just more diligent and hardworking.” Ashley Smith took a step back.<br/><br/>“If you’re so diligent, don’t work part-time anymore.” William Lane said, “Concentrate on practicing your dance.”<br/><br/>Ashley Smith’s mouth twitched, “If I don’t work, I’ll have to drink the northwest wind.”<br/><br/>Sophie Ortiz really liked her and was willing to take her with her during performances, but she had to go to school and didn’t have much time and energy. So she had fewer performances.<br/><br/>When there were no performances for the Dance Association, the monthly salary was only enough for her to rent a one-bedroom apartment of around fifty square meters near the Imperial Capital.<br/><br/>Food, clothing, and school fees all cost money. Without a part-time job, the northwest wind would eventually be drunk up by her one day.<br/><br/>William Lane looked at her.<br/><br/>Ashley Smith understood his meaning, “I don’t want your money. I can work with my own hands and feet and earn it myself. Once I graduate, I’ll have more time for performances, and I’ll be able to earn more.”<br/><br/>“I’ll send you to study abroad.” William Lane said, “I’ll go with you.”<br/><br/>“No.” Ashley Smith immediately refuted, “What I want, I will strive for myself. Besides, I don’t like foreign countries. I feel much safer in my own country.”<br/><br/>Regarding this matter, William Lane was really a bit out of tricks with her.<br/><br/>“I, I won’t go to the coffee shop anymore.” said Ashley Smith, “I will find a new job on my own. I don’t need your help. I can find one myself.”<br/><br/><br/><br/>“You’re not an adult yet.” Ashley Smith said.<br/><br/>“I am on my ID card.”<br/><br/>Her younger brother was three years younger than her, seventeen years old. But when he registered his residence, his age was mistakenly filled as one year older than his actual age.<br/><br/>Ashley Smith: “...... Are you tired?”<br/><br/>The boy shook his head, then took an envelope out of his pocket, “Sister, this is my salary last month, for you.”<br/><br/><br/><br/>Ashley Smith looked at the envelope and noticed a bit of bandage exposed on her brother’s wrist.<br/><br/>She frowned and grabbed his wrist, “How did you get hurt?”<br/><br/>“It’s nothing.” The boy pulled down his sleeve to cover it, “I just accidentally got hurt while working. It’s been taken care of, it’s fine, don’t worry.”<br/><br/>Ashley Smith pulled up his sleeve to take a look.<br/><br/>The bandage was wrapped very thickly, but she couldn’t see any injuries, “Are you really okay?”<br/><br/>“I’m fine,” the boy said, “It’s almost healed.”<br/><br/>Ashley Smith frowned, looking at the envelope again. It was thick, and there must be at least 20,000 yuan in it. “What kind of job are you doing? You earn so much in a month?”<br/><br/>“A construction site.” The boy pushed the envelope forward again, “Sister, take it.”<br/><br/>“No need, you keep it,” Ashley Smith let go of his wrist, “There are many things to buy for the start of school, and money is needed in many places. Consumption in the Imperial Capital is very high.”<br/><br/>“Sister...”<br/><br/>“Daniel, he is him, and you are you. The money is taken by him, and even if I return his favor, it has nothing to do with you,” Ashley Smith said, “There’s no need to be wronged for someone else.”<br/><br/>“Sister...”<br/><br/>“Alright. Have you eaten?” Ashley Smith pulled at his clothes and stuffed the money back into his pocket.<br/><br/><br/><br/>“I already ate.”<br/><br/>“Where are you staying?” Ashley Smith started to work part-time and make money in the town near their hometown since she was fourteen, so she hasn’t lived with them for many years. Although there is familiarity, there is more estrangement.<br/><br/>“I’m going back to the dormitory on site,” said Daniel Harrisonbless.<br/><br/>“Is it far? I’ll call a car for you.”<br/><br/>“No need, I have a friend nearby, I’ll go find him and go back with him,” said Daniel Harrisonbless.<br/><br/>“Hmm.”<br/><br/>Daniel Harrisonbless stood for a while, then said, “Sis, I’m leaving.”<br/><br/>“Hmm.” Ashley Smith said, then continued, “Daniel, be careful and take care of yourself. School is starting soon, focus on your studies.”<br/><br/>“I know, sis,” Daniel Harrisonbless smiled, “Don’t worry.”\t\t\t\t\t\t</div>", "images": {}, "success": true}