{"id": 637, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15174144.html", "title": "Chapter 634: Extra Eleven: Ink Dot Plum Scent (Part Nine)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 634: Extra Eleven: Ink Dot Plum Scent (Part Nine)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 634: Extra Eleven: Ink Dot Plum Scent (Part Nine)<br/><br/>The next day, William Lane had been waiting all day, but no one came to look for him.<br/><br/>Of course, he expected it.<br/><br/>Because he had someone deal with the vice principal’s supporter behind the scenes last night.<br/><br/>Now that vice principal was probably shivering at home.<br/><br/>So after work, William Lane went to his home to “visit” him.<br/><br/>He didn’t bring many people, and as soon as he entered the house, the man knelt before him with a thud.<br/><br/>“Young Master Lane, Young Master Lane, I was wrong, I was wrong.”<br/><br/>William Lane sat in a chair, his mouth slightly curled up: “You have a good informant, you found out so quickly?”<br/><br/>“I really made a mistake. I didn’t recognize a VIP. I didn’t know it was you. I didn’t know she was your woman.” The man wanted to pull on William Lane’s trouser leg but was kicked away by James Lane.<br/><br/>“She’s my wife.” William Lane corrected him.<br/><br/><br/><br/>The man hesitated, looking even more frightened. If it was just a woman, it wouldn’t be so bad, but if she were Mrs. Lane, he would be in deep trouble...<br/><br/>“You even wanted to film her with a camera?” William Lane said.<br/><br/>“I didn’t, I didn’t. It was a misunderstanding, all a misunderstanding.”<br/><br/>“A misunderstanding?” William Lane said softly, “What about the time you dragged her into the restroom at the training institution? Was that also a misunderstanding?”<br/><br/>“Young Master Lane, I was drunk that day. I was completely out of my mind.”<br/><br/>“Do you think that you can get away with hurting someone just by saying you were drunk? You were drunk, so why should someone else bear the consequences?” William Lane said, “If you have low self-control, admit it, don’t blame it on the alcohol. Did the alcohol coerce you into being vile?”<br/><br/>“Young Master Lane, I was wrong, I really made a mistake.” The man’s forehead was dripping with large beads of sweat, tears and snot flowing in abundance, “I didn’t know she was Mrs. Lane, I really didn’t know. If I had known, I wouldn’t have dared, even if I had a hundred guts.”<br/><br/>“So what? If she weren’t Mrs. Lane, you could bully her casually?” William Lane frowned.<br/><br/>“No, no, I’ll change, I will definitely change. Young Master Lane, I won’t dare to do it again, I really won’t.”<br/><br/>“You change? What use is it if you change? Does your change resolve everything for the people you’ve harmed? Will their physical and psychological pain just disappear? Do you think there would still be a future after hurting others?” As William Lane spoke, he stretched out his hand to James Lane.<br/><br/>James handed him the files.<br/><br/>William Lane looked at it for a while, then threw everything in the man’s face, “With these things, how many times could you die?”<br/><br/>The sharp pieces of paper cut through his already bruised face.<br/><br/>The man looked at the records of his crimes and said, “It’s not me, it’s not me. I didn’t do those things, it’s not me.”<br/><br/>“Whether it’s you or not, you can tell that to the police.” William Lane said.<br/><br/><br/><br/>“What to say?” Amelia Smith blinked her big eyes.<br/><br/>William Lane: “......I’ve been talking for a while, haven’t you been listening with your ears?”<br/><br/>“I listened.”<br/><br/>William Lane: “......” How more annoying than his sisters.<br/><br/>“I really don’t know what to say.” Amelia Smith blinked her clean and innocent eyes.<br/><br/>William Lane: “......”<br/><br/>“Why aren’t you talking either?” Amelia Smith asked.<br/><br/><br/><br/>“I...” William Lane let go of her and said with a deflated tone, “I don’t know what to say either.”<br/><br/>“I can work for you for free, without pay.” Amelia Smith said, “But now I don’t want to work for free. So I want to go elsewhere.”<br/><br/>“????”<br/><br/>William Lane had a bunch of question marks in his head, all tangled up together. After a while, he shook her little head: “What kind of magical thinking is this?”<br/><br/>Amelia Smith looked at him, and after a while, lowered her gaze: “Brother, you are standing too high, it’s something I can never catch up with. The only thing I can do is not depend on you. This is the only thing I can do in our relationship. It’s also the only thing that can make me feel some dignity.”<br/><br/>William Lane fell silent for a moment, then sat on the carpet and looked at her: “Amelia, you like your brother, don’t you?”<br/><br/>Amelia Smith didn’t say anything, but her eyes answered him.<br/><br/>Liking.<br/><br/>Very much.<br/><br/>Always.<br/><br/>William Lane smiled, leaned forward slightly, and kissed her lips.<br/><br/>Amelia Smith stiffened nervously as he approached, but didn’t dodge.<br/><br/>She greedily enjoyed a light and gentle kiss from William Lane.<br/><br/><br/><br/>“Amelia, we have always been equal. I like you, you like me,” William Lane touched her face, “You are excellent and intelligent. You have never bowed to fate and have been struggling against it since you were young, walking step by step to where you are now. You are constantly enriching, improving, and elevating yourself every day. In this way, you are much more dazzling than me.”<br/><br/>Amelia Smith looked at him.<br/><br/>“My current status, position, and wealth all stem from my family. Even what I have created is also based on my family background.” William Lane said, “So we are no different. We both rely on our abilities to create wealth and our future. The balance in your heart is not quite accurate.”<br/><br/>Amelia Smith had a blank look in her eyes, as if she was beginning to doubt her long-held perception.<br/><br/>It seems she was somewhat convinced by William Lane.<br/><br/>“I know, getting the marriage certificate was pushing you too hard,” William Lane said, “You are still very young, I thought about giving you time, letting you think slowly. But it has been two years. Your heart has been troubled by these things all this time. And when I asked if you like Ruben Wayne, you never denied it. I was really afraid you wouldn’t understand and ended up marrying someone else. So I didn’t want to wait any longer.”\t\t\t\t\t\t</div>", "images": {}, "success": true}