{"id": 632, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15170399.html", "title": "Chapter 629: Extra Six: Ink Dot Plum Scent (Part Four)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 629: Extra Six: Ink Dot Plum Scent (Part Four)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 629: Extra Six: Ink Dot Plum Scent (Part Four)<br/><br/>Only after William Lane saw Evan Smith leave did he drive to the entrance.<br/><br/>As a result, within a short time, he saw a boy coming out of the school and asking her for her contact information with his cell phone.<br/><br/>In his hurry, William almost crashed the car into the sidewalk.<br/><br/>But by the time he got out of the car, the boy who wanted her contact information was gone.<br/><br/>Not being able to personally cut off Amelia Smith’s peach blossoms, William was unhappy all the way.<br/><br/>He understood that even without Ruben Wayne, there would be thousands of other “Ruben Wayne’s.”<br/><br/>The young lady is in her prime, young, beautiful, hardworking, strong, confident, and resilient.<br/><br/>With a large number of good qualities, who wouldn’t be tempted, who wouldn’t like her?<br/><br/>Thinking about it, William suddenly had a terrible idea.<br/><br/>And he plans to execute it, so he makes a U-turn ahead.<br/><br/><br/><br/>Ever since Amelia got in the car, she had been filling out an information form, not paying attention to where they were going.<br/><br/>Since William picked her up, she would definitely return to his residence.<br/><br/>But since the road took such a long time, she looked up and saw outside the window: “Where are we? Where are we going?”<br/><br/>“To your residence,” William replied.<br/><br/>Amelia blinked her beautiful deer eyes. What’s going on? Is she finally free?<br/><br/>William drove without looking at her, but he also knew she was puzzled: “To get something.”<br/><br/>“What thing?”<br/><br/>“Household Register, ID card,” William said indifferently.<br/><br/>“Huh?” Amelia was puzzled and even a bit cautious.<br/><br/>William Lane made up some lies: “Tomorrow we’ll get a certificate for you, so you can pay less tuition.”<br/><br/>“Is that possible?” Amelia was still confused.<br/><br/>William continued to make up stories: “Yeah. It’s a new policy, internal news. We’ll get it done for you while there are fewer people who know about it, otherwise, you’ll have to wait in line.”<br/><br/>“Oh,” Amelia nodded, “okay then.”<br/><br/>Perhaps it was because William had helped her when she was in her teens.<br/><br/>Amelia had always trusted William unconditionally.<br/><br/>After picking up the household register and ID card, the two returned to William’s residence, crossing half of the city.<br/><br/>Amelia had taken a nap in the car, and when they got back to the villa and went to her room, she was still dazed.<br/><br/>After watching her go back to her room, William took her household register and ID card and went back to the study room.<br/><br/>Amelia is a very opinionated and resilient person. She accomplishes what she wants to do and doesn’t compromise in what she doesn’t want to do.<br/><br/><br/><br/>William was taken aback, frowning, “You dealt with her brother?”<br/><br/>“No. But... Initially, his face was covered, so we hit him too.”<br/><br/>Fortunately, the people at the boxing ring tonight were familiar with Evan since they had followed William, otherwise, they would have dealt with him as part of the gang.<br/><br/>William breathed a sigh of relief: “What happened?”<br/><br/>“It’s a foreign gang that’s been in the domestic scene for a while now, looking to swallow up the boxing ring, so there was a conflict tonight,” the other party said, “It seems that Lady Smith’s brother was short of money and quite capable, and got tricked into it.”<br/><br/>“How did it go?” William asked.<br/><br/>“They all have external injuries, but they may need some time to recover.”<br/><br/>William: “Okay, got it. Let him heal for now.”<br/><br/>...<br/><br/>The next morning, breakfast was made by William as usual.<br/><br/>Amelia’s silent assessment of Young Master Lane’s cooking skills in her heart was: Edible.<br/><br/>After breakfast, the two went out to the car.<br/><br/>Amelia thought he would take her to the Dance Association on his way.<br/><br/><br/><br/>However, he parked his car by Seventh Street and got a file bag from another car. After that, they seemed to be going the wrong way.<br/><br/>“Where are we going?” Amelia asked.<br/><br/>William said calmly, “Civil Affairs Bureau.”<br/><br/>“Ha?” Amelia thought she was having some problem with her ears or brain, “Where are we going?”<br/><br/>“Civil Affairs Bureau.”<br/><br/>“Go, what are we doing there?”<br/><br/>“To get the certificate.”<br/><br/>Amelia’s eyes widened: “What certificate?”<br/><br/>“Marriage certificate,” William answered patiently yet calmly.<br/><br/>“Who’s getting the marriage certificate?” Amelia asked again.<br/><br/>“The two of us,” William said, “You and me.”<br/><br/>Amelia was speechless. In her head, it felt like bees were buzzing incessantly. After a while, she said, “Are you crazy?”<br/><br/>“You’re old enough,” William said.<br/><br/>What does it mean when he says she’s old enough?<br/><br/>What does it mean that she’s old enough!<br/><br/>Feeling confused for a while, Amelia suddenly became somewhat agitated: “Young Master Lane, look at me, look at me, look at me carefully, do you know who I am? Do you know the gap between our statuses?”<br/><br/>“I am driving, and I can’t look at you,” William honestly didn’t look at her, focusing on driving instead, “But I know very well who you are.”\t\t\t\t\t\t</div>", "images": {}, "success": true}