{"id": 636, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15174141.html", "title": "Chapter 633: Extra Ten: Ink Dot Plum Scent (Part Eight)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 633: Extra Ten: Ink Dot Plum Scent (Part Eight)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 633: Extra Ten: Ink Dot Plum Scent (Part Eight)<br/><br/>Amelia didn’t even know what had happened, just that she was let go and immediately started running.<br/><br/>Behind her were sounds of fighting, muffled grunts, and half-muted screams.<br/><br/>She didn’t care, she just kept running.<br/><br/>But after only a few steps, she was wrapped around her waist and caught again.<br/><br/>Instinctively, she struggled again.<br/><br/>“Amelia, it’s me.”<br/><br/>Amelia stopped, then looked up at the person beside her: “Elder Brother.”<br/><br/>William Lane got a scratch on his neck from her nails: “It’s me.”<br/><br/>Amelia immediately grabbed his arm, tears streaming down her face uncontrollably: “I, I, my legs are weak.”<br/><br/>William looked at her swollen half of her face and disheveled hair. He held her waist tightly, making her lean into his embrace, stroking her head and said, “It’s fine now, don’t be afraid.”<br/><br/><br/><br/>Amelia leaned in his embrace for a while before suddenly looking up at the not-far-away scene.<br/><br/>The fighting sounds had stopped.<br/><br/>Everyone was on the ground, except for James Lane who was still standing.<br/><br/>Amelia’s breath was unsteady, and she spoke with a whimpering tone: “That fat guy... he’s the mastermind.”<br/><br/>“James,” William said, “that fat guy.”<br/><br/>“Yes.” James immediately got to work, focusing on belligerently beating the fat guy.<br/><br/>At first, there were a few yells, but after two punches, there was no sound.<br/><br/>William took off his coat and draped it over Amelia before picking her up horizontally.<br/><br/>Amelia’s tears fell, but her mind was somewhat clear: “Maybe we shouldn’t hit them anymore, we don’t want to cause trouble.”<br/><br/>“It’s fine,” William, holding Amelia, walked out.<br/><br/>After taking only a few steps, they heard the man’s muffled voice: “Do you know who I am? You...beat me like this, you’re in trouble. You won’t...last in the Imperial Capital... past tomorrow...”<br/><br/>Upon hearing this, James gave him an even more ruthless beat down.<br/><br/>William paused, his eyes cold as ice, and his tone colder: “James, let him go. I want to see who’s backing him.”<br/><br/>“Yes.” James stopped and stood aside.<br/><br/>“I’d like to see if I can make it past tomorrow.”<br/><br/>After saying that, William left with Amelia in his arms.<br/><br/>Once they were in the car, William checked Amelia’s injuries: “Where did they hurt you?”<br/><br/>Amelia sniffled: “No... they didn’t hurt me.”<br/><br/><br/><br/>Seeing the medicine box, Amelia said, “I can apply it myself.”<br/><br/><br/><br/>William didn’t respond, but instead dabbed some alcohol with a cotton swab and gently disinfected her wound.<br/><br/>After disinfecting, he carefully applied medicine to her injury, “The swelling will go down by tomorrow.”<br/><br/>Amelia’s gaze was lowered, not daring to look at him; “What about that man? Will he cause you trouble?”<br/><br/>“Do you know him?”<br/><br/>“He’s the vice principal of the training institution I work at,” Amelia whispered.<br/><br/>“Was this the first time?” William asked as he reached for her coat.<br/><br/>“A week ago, he got drunk at the training institution and dragged me into the restroom.” Amelia clung to her coat as she looked at him, “I can apply the medicine myself.”<br/><br/>“Then what happened?” William didn’t move.<br/><br/>“I fought him off in the restroom.”<br/><br/>William raised an eyebrow.<br/><br/>Amelia continued, “I copied the surveillance videos. If he causes trouble, we can report him.”<br/><br/>William rubbed her head, “He won’t cause any trouble. Tonight, not only will the person supporting him from behind be exposed, but information of his ancestors for 18 generations will appear on my desk.”<br/><br/>Amelia paused for a moment.<br/><br/><br/><br/>William moved her hand away from her coat, putting it on the torn inside clothing, and then took her coat off, “I’ll apply the medicine. Why are you always holding on to it? We’re married now, there’s no part of you I won’t see.”<br/><br/>Amelia’s clear eyes widened, and the redness on her ears spread to her neck.<br/><br/>As William applied medicine to her, he couldn’t help but smile at her reaction.<br/><br/>After applying the medicine, William placed a blanket over her from the sofa, and then said, “Amelia, tell me about these things in the future.”<br/><br/>“I’m sorry for causing you trouble.”<br/><br/>“You don’t have to apologize. You didn’t do anything wrong,” William spoke softly, “I should be the one apologizing for not protecting you well enough. And that man, he shouldn’t have bullied you. With one less person like him in the world, there’s more protection for girls. Lastly...this isn’t trouble, nothing about you is trouble.”<br/><br/>Amelia hadn’t expected him to say that and looked up at him.<br/><br/>“What’s wrong?”<br/><br/>“You’re different today,” Amelia said, “You used to rarely talk to me like this.”<br/><br/>William smiled, “It’s because you were frightened today. Another possibility is...the man in front of you has ulterior motives. He wants to numb you with words, and then...”<br/><br/>“You wouldn’t,” Amelia said.<br/><br/>“I would,” William replied, “I’m a certified person now, I can do a lot.”<br/><br/>Amelia looked at him and slowly scooted back.<br/><br/>William watched her cower, then stood up, walked over to her, and gently pinched her chin, “You like to make your own money and be independent with your career. You’re an independent individual, and I respect and support that. However, when you encounter situations like this, you need to tell me – even if you can handle it yourself. Just treat it as daily sharing. Otherwise, I won’t support you anymore, got it?”<br/><br/>“Oh.”\t\t\t\t\t\t</div>", "images": {}, "success": true}