{"id": 639, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15174150.html", "title": "Chapter 636: Extra Thirteen: Fragrance Of Ink-Spotted Plum (Eleven)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 636: Extra Thirteen: Fragrance Of Ink-Spotted Plum (Eleven)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 636: Extra Chapter Thirteen: Fragrance of Ink-spotted Plum (Eleven)<br/><br/>Upon hearing Charlotte Lane’s words, Amelia Smith’s face turned red instantly.<br/><br/>And seeing her flushed face, Charlotte only wanted to tease her more.<br/><br/>However, she restrained herself in the end.<br/><br/>“Actually, I have something to discuss with you,” Charlotte Lane said.<br/><br/>“What is it?” Amelia Smith asked, somewhat dumbfounded.<br/><br/>Charlotte Lane took out her cell phone, found some photos, and pushed the phone to Amelia Smith. “These are all your work, aren’t they?”<br/><br/>Amelia Smith didn’t touch her phone, but just glanced down at it.<br/><br/>Charlotte Lane saw her eyelashes quiver slightly.<br/><br/>The photo showed a jade stone carved with a phoenix.<br/><br/>The quality of the stone was very poor and cheap. However, the carving was extremely exquisite and detailed.<br/><br/><br/><br/>The phoenix seemed vivid, every single feather was incredibly lifelike.<br/><br/>Such a high level of craftsmanship wasn’t achievable without great skill.<br/><br/>Amelia Smith held her lips. “Miss Lane...”<br/><br/>“Don’t deny it, I’ve done my research,” Charlotte Lane said calmly.<br/><br/>Amelia Smith swallowed hard, and admitted with a nod, “My mom used to learn carving from a master. I started playing with carving knives as soon as I could remember. When I was just over seven, I began to carve some pieces to be sold for money.”<br/><br/>The real masters are among the common folk. The teacher was based in the countryside, but he was undoubtedly a very skilled carver.<br/><br/>The waiter brought over the coffee, and Amelia Smith showed her thanks.<br/><br/>Charlotte Lane stirred her coffee and said, “Why have you stopped doing it?”<br/><br/>Amelia Smith looked at her coffee in front of her and didn’t say a word.<br/><br/>“Don’t you like it?” Charlotte Lane asked.<br/><br/>“It’s not that I don’t like it,” Amelia Smith said, “It’s because of some family issues.”<br/><br/>Since it involved family matters, Charlotte Lane didn’t ask any more questions.<br/><br/>She knew a little about her story. Amelia’s father started gambling in recent years, squandering much of their family money.<br/><br/>Both of her sisters were forced into marriages in exchange for 200,000 dollars in betrothal money.<br/><br/>Her mother’s health had been poor for the past few years, possibly because she had had several abortions due to the birth of her children.<br/><br/><br/><br/>Seeing her reaction, Charlotte Lane knew that Roy Madison had said it.<br/><br/>She chuckled softly, “Yes. That’s also how my mom fell for my dad.”<br/><br/>After a pause, she added, “Of course, that’s how I fell for Harton Clark too.”<br/><br/>Amelia Smith’s cheek twitched uncontrollably several times.<br/><br/>“As long as you’re good-looking, that’s enough,” Charlotte Lane said, “If you want to work, then work. If you don’t want to work, then just be Mrs. Lane and focus on being beautiful.”<br/><br/>Amelia Smith really didn’t know what to say.<br/><br/>“As for carrying on the family line, if you want to give birth, then give birth. If you don’t want to, it’s also fine. That’s our family’s stance. Of course, the final decision lies with you and your husband.” Charlotte Lane said softly, “My parents said, if there’s someone who could inherit the Lane family fortune, then let them inherit it. If not, then donate it.”<br/><br/>Amelia Smith was completely dumbfounded.<br/><br/><br/><br/>This didn’t seem to match the family dynamics we see in TV shows and novels.<br/><br/>“Although I’m married, I still represent the opinion of the Lane family for the time being.” Charlotte Lane said, “These are the opinions on a family level, the rest... is for you and my brother to sort out.”<br/><br/>The two sat quietly for a while. Then Amelia Smith said, “Miss Lane, don’t you think I will be a great burden?”<br/><br/>Charlotte Lane looked at her.<br/><br/>“With regard to my family,” Amelia Smith clenched her fingers and said, “You must have learned about it. My dad could be a problem at any time.”<br/><br/>Charlotte Lane smiled and said, “If there were issues in my brother’s family, let’s say... my brothers and sisters were fighting over our family fortune, reaching the point where lives were at stake. If there was a constant threat to our lives, would you consider my brother a burden?”<br/><br/>Amelia Smith’s eyes widened slightly; she had never thought of this question before.<br/><br/>Because she knew that in the Lane family, the atmosphere was generally amicable, with the parents, children, and siblings all having a good relationship.<br/><br/>“That’s an unrealistic assumption.” Charlotte Lane continued, “Your brother barged into my brother’s territory and caused a fuss. His gang was set on taking my brother’s life. This could very well happen again in the future. You, as his weak spot, are in danger as well. Would you consider him a burden?”<br/><br/>Amelia Smith stared directly at her, but she answered very quickly, “No.”<br/><br/>After she finished speaking, she felt her thoughts were too exposed. Feeling somewhat embarrassed, she lowered her head.<br/><br/>“There you have it.”<br/><br/>Charlotte Lane’s phone buzzed. It was a message from Harton Clark.<br/><br/><br/><br/>He was asking whether she should return home or not.<br/><br/>Harton Clark had been increasingly clingy recently.<br/><br/>Charlotte Lane put away her phone and said, “Shall I drop you off at the Dance Association?”<br/><br/>“No, I’ll take a taxi to the school,” Amelia Smith said.<br/><br/>“Alright.”\t\t\t\t\t\t</div>", "images": {}, "success": true}