{"id": 633, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15170400.html", "title": "Chapter 630: Extra Seven: Ink Dot Plum Scent (Part Five)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 630: Extra Seven: Ink Dot Plum Scent (Part Five)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 630: Extra Seven: Ink Dot Plum Scent (Part Five)<br/><br/>Reaching the Civil Affairs Bureau Entrance, Amelia Smith tried to run as soon as the car stopped, but William Lane locked the car door, and her attempt was unsuccessful.<br/><br/>Unable to open the car door, Amelia gripped her seat belt and looked at William: “I won’t go in. If you drag me in there, I’ll shout and tell people inside that you’re forcing me, and then I’ll call the police on you.”<br/><br/>William smiled: “Alright, you can try.”<br/><br/>Amelia furrowed her brow, biting her lower lip: “Young Master Lane, what’s there to like about me? I have no prestigious background, no impressive education, no abilities...”<br/><br/>Amelia’s voice grew quieter.<br/><br/>Noticing no change in William’s tone, he said, “I like your face.”<br/><br/>Amelia was shocked: “How can you be so superficial?”<br/><br/>“Is there anything wrong with that?” William defended himself.<br/><br/>“I, I...” Amelia was speechless.<br/><br/>William continued: “Then tell me why you don’t like me?”<br/><br/><br/><br/>Amelia gripped her seatbelt, not knowing what to say.<br/><br/>“Why aren’t you saying anything?” William prompted.<br/><br/>Amelia looked down, thinking to herself: how could she tell him that he was too good for her?<br/><br/>“Amelia Smith...” William called her name again.<br/><br/>Suddenly, Amelia blurted out: “You are older.”<br/><br/>William felt as if he had been stabbed in the lung.<br/><br/>Amelia sneaked a glance at him and quickly looked away, not daring to speak.<br/><br/>There was a sudden moment of silence in the car. Amelia lowered her head, and saw William using his cell phone, seemingly chatting with someone.<br/><br/>After about a minute, William handed her his cell phone.<br/><br/>Amelia didn’t know why he was handing her his phone but took it anyway.<br/><br/>She saw a photo on the screen the moment she got the phone.<br/><br/>It was a photo of his younger brother. The image wasn’t very clear, as if it was taken from a surveillance camera, but she could still see his face covered in injuries.<br/><br/>He was curled up on the ground, wearing black clothes that didn’t show much, but there was blood on his neck and hands.<br/><br/>Amelia trembled at the sight.<br/><br/>“There’s more,” William, feeling utterly despicable, urged her to continue looking.<br/><br/>With trembling fingers, Amelia swiped to the next photos.<br/><br/>There were more images taken from different angles, even more horrifying than the first.<br/><br/><br/><br/>William Lane saw the viciousness and murderous intent in his eyes and raised his eyebrows.<br/><br/>However, the moment Daniel saw Amelia, the murderous intent in his eyes intensified, mixed with fear.<br/><br/>Ignoring the pain in his body, he got out of bed immediately. Due to the sudden movement, the IV needle was pulled out from his hand. The back of his hand was cut, the IV pad immediately dyed red, and blood dripped onto the floor.<br/><br/><br/><br/>“Daniel.”<br/><br/>Amelia immediately entered the room to help him.<br/><br/>With an injury to his abdomen, Daniel could not stand up straight but still pulled Amelia behind him first.<br/><br/>He didn’t know who William Lane was and wasn’t sure whose boxing ring it was last night.<br/><br/>However, anyone who could easily come and go from here and be so respectful to the person watching him must be related to last night’s events.<br/><br/>He stared at William Lane, “If you have a problem, come at me. It has nothing to do with her.”<br/><br/>William Lane smiled faintly.<br/><br/>Amelia helped him, “Daniel, I’m fine. You sit first.”<br/><br/>“Sister...”<br/><br/>“Sit first.” Amelia made him sit on the bed.<br/><br/>As Daniel sat on the bed, he looked at William Lane. “Sister, are you okay? Did he do anything to you? Did he bully you?”<br/><br/>“If I bullied her, what do you plan to do?” William Lane said softly.<br/><br/>Just about to get up, it seemed Daniel was itching to fight William Lane.<br/><br/><br/><br/>But Amelia held him back, “Don’t move. Just sit. I’m fine.”<br/><br/>Hearing his sister’s anger, Daniel didn’t dare move.<br/><br/>Amelia turned her head to look at William Lane.<br/><br/>William Lane smiled, “You two talk, I’ll go outside.”<br/><br/>As soon as he left, Daniel clutched Amelia’s hand, looking anxious. “Sister, did you make any deals with him to let me go? What did he do to you?”<br/><br/>Amelia looked at the blood flowing down his hand, “No, we’ve known each other for a long time. He helped me change my name. What happened to you? What on earth are you doing to yourself?”<br/><br/>With his head down, Daniel remained silent.<br/><br/>“I’ve said it before, he is him, you are you.” Amelia was very angry. “He didn’t take the money, but I would give it to him one day.”<br/><br/>“But all the money is for raising me.” Daniel whispered softly, his head down. “Big Sister and Second Sister were forced to marry for my sake. And you weren’t even allowed to study. You took up a part-time job to make money, and it was taken away.”<br/><br/>“So?” Amelia said, “You like this? You risk your life to make money? Everyone is raising you, but you’re risking your life as a joke! Can’t you live up to yourself, let alone others?”<br/><br/>“Sister.” Daniel tugged at Amelia’s clothes, “I was wrong, don’t be mad.”<br/><br/>Amelia pulled her hand away.<br/><br/>With his hand on his lap holding his pants, Daniel dared not speak...\t\t\t\t\t\t</div>", "images": {}, "success": true}