{"id": 635, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15170404.html", "title": "Chapter 632: Extra Nine: Ink Dot Plum Scent (Part Seven)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 632: Extra Nine: Ink Dot Plum Scent (Part Seven)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 632: Extra Nine: Ink Dot Plum Scent (Part Seven)<br/><br/>After the two got their marriage certificates, their relationship didn’t change much.<br/><br/>The only change was that Amelia Smith moved into the master bedroom, and when William Lane occasionally went home, he stayed in the guest room in the villa.<br/><br/>Amelia Smith studied and danced even harder than before, and took advantage of her free time to find a part-time job.<br/><br/>It was introduced by one of her classmates.<br/><br/>She worked at a self-study training institute. Because it was introduced by acquaintances, the working hours were very flexible and she only received payment based on the course fee.<br/><br/>With good luck, she had more free time and could take more classes and earn a decent amount of money.<br/><br/>In this regard, she did not let William Lane interfere, and he rarely intervened.<br/><br/>As long as it was safe, William Lane respected her work.<br/><br/>But in terms of work safety, there were always some people of low quality who were unsafe.<br/><br/>One day, after Amelia Smith finished her evening class at school, she went to the training institution to teach a pre-arranged class.<br/><br/><br/><br/>It was already 9 PM when the class was over.<br/><br/>William Lane was on a business trip, so James Lane had been picking her up these days.<br/><br/>As she was packing up her things to leave the classroom, she saw a man walking out of the restroom as soon as she reached the door.<br/><br/>He was the vice principal of the training institution.<br/><br/>Amelia Smith stopped and noticed that he had been drinking. She took a step back and said, “Vice Principal, good evening.”<br/><br/>The vice principal looked to be in his forties, quite tall, and somewhat overweight. He squinted his eyes and recognized Amelia, then smiled, “You’re that new one, called... Amelia Smith, right?”<br/><br/>“Yes.” Seeing him walk towards her, Amelia took another step back.<br/><br/>Noticing her wariness, the vice principal stopped and waved at her, “Amelia, I’m drunk. Can you come over and help me?”<br/><br/>Amelia didn’t move and took out her cell phone, “Let me call your family or assistant for you.”<br/><br/>“Are you still studying, Amelia?”<br/><br/>“Yes.” Amelia looked at him.<br/><br/>“So you have to study during the day and work at night, must be very tiring, right?”<br/><br/>“Well, everyone struggles.” Amelia smiled and continued, “Vice principal, give me your assistant’s mobile number, and I’ll call them to come pick you up. You don’t look very comfortable.”<br/><br/>Seeing Amelia’s reluctance, the vice principal stopped talking, “If I want to call them, I’d do it myself. I don’t need your help.”<br/><br/>He walked away after that.<br/><br/><br/><br/>As she slowly strolled through the school, passing by the little woods, two people suddenly rushed out. One of them grabbed her arm, while the other covered her mouth and dragged her in.<br/><br/>Both books fell to the ground.<br/><br/>The area of woods on campus was not small, and it was dark inside.<br/><br/>Sometimes couples would come here in the evening for dates.<br/><br/>But at this time of the year, with so many mosquitoes, few people would come here.<br/><br/>As Amelia was dragged in, she realized that there were more than ten people inside, including the vice principal.<br/><br/>“Weren’t you so tough? Why don’t you fight now?”<br/><br/><br/><br/>Amelia glared at him, then mustered her strength, and with a forceful jerk, shook off the two people holding her.<br/><br/>She tried to run out, while taking out her cell phone.<br/><br/>However, after only a few steps, she was caught again.<br/><br/>Another person grabbed her hair and pulled it.<br/><br/>Amelia managed to press the power button three times before her phone was snatched away and tossed out.<br/><br/>“Where are you running to? Do you think you can still get away?” The vice principal slapped her face.<br/><br/>Amelia spat a mouthful of blood-streaked saliva on his face, “You bastard, despicable scum.”<br/><br/>The man laughed, wiped the saliva off his face, and fiddled with the camera in his hand, sneering: “I want to see if your mouth will be so tough later.”<br/><br/>Looking at the camera in his hand, Amelia kept telling herself to stay calm, stay calm.<br/><br/>But her heart was beating too fast, and her legs couldn’t help but go weak.<br/><br/>The man saw her looking like that, and his smile became even creepier: “Strip her clothes off.”<br/><br/>The man holding Amelia immediately moved his hands onto her clothes.<br/><br/>She used all her strength to break free, kicking the man beside her and slapping another on the face.<br/><br/><br/><br/>After attacking them, she tried to run again, but was quickly pinned to a tree.<br/><br/>Her shoulder hit the tree, causing her to wince in pain. Her shirt collar had been torn open.<br/><br/>The night breeze hit her shoulders, followed by a disgusting touch.<br/><br/>In an instant, Amelia’s eyes reddened; nausea, fear, and despair filled her entire body. Tears involuntarily fell as she shouted, “Let go of me!”<br/><br/>“Now you know how to cry? Weren’t you so capable that night?” The man sneered, “Remember this woods well tonight, and think of me every time you pass by in the future...”<br/><br/>Amelia struggled again but couldn’t move. At that moment, she felt a gust of wind pass by, and the person pressing her was suddenly gone.<br/><br/>A heavy thud and groan followed.\t\t\t\t\t\t</div>", "images": {}, "success": true}