{"id": 634, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15170402.html", "title": "Chapter 631: Extra Eight: Ink Dot Plum Scent (Part Six)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 631: Extra Eight: Ink Dot Plum Scent (Part Six)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 631: Extra Eight: Ink Dot Plum Scent (Part Six)<br/><br/>Amelia Smith took a leave of absence from Dance Harmony School to spend the day at the hospital with Evan.<br/><br/>William Lane accompanied her for a while, but was soon driven away by her.<br/><br/>So he went to the Research Institute, and only came to pick her up after work.<br/><br/>The two had dinner outside, and then William Lane accompanied her to her living quarters to get her things.<br/><br/>“You should cancel your lease for this place,” William Lane helped her pack her things.<br/><br/>Amelia Smith thought for a moment and said, “Okay. I’ll talk to the landlord tomorrow.”<br/><br/>Back at the villa, Amelia Smith stood in the living room replying to a message, and in no time, William Lane had carried her luggage to the master bedroom.<br/><br/>When she went back to her room and did not see her stuff, she came out to look for it and William Lane directly pulled her into the master bedroom.<br/><br/>Amelia Smith looked at the spacious room and couldn’t help but ask: “What are you doing?”<br/><br/>“What am I doing?” William Lane said, “Going to sleep.”<br/><br/><br/><br/>“Sleep, sleep, sleep...” Amelia Smith suddenly stepped back and stammered, “No, no, I mean, you, me...”<br/><br/>“We’re married,” William Lane reminded her.<br/><br/>Amelia Smith’s eyes widened.<br/><br/>They were married.<br/><br/>So what?<br/><br/>So they had to sleep together?<br/><br/>Did this “sleep” have a deeper meaning than just sleeping, as she understood it?<br/><br/>Seeing her surprised look, William Lane found it amusing and took a step closer to her.<br/><br/>Amelia Smith immediately stepped back again, picking up something nearby to aim at William Lane.<br/><br/>William Lane looked at the statue in her hand and said slowly, “120,000.”<br/><br/>Amelia Smith’s eyes widened even more, and she carefully put it back down. She then tried to pick up another object, but heard William Lane say, “200,000.”<br/><br/>Amelia Smith reached for something else on the side.<br/><br/>William Lane walked closer slowly, “This one is cheaper, just over 90,000.”<br/><br/>Hehe.<br/><br/>Really fucking cheap.<br/><br/>Amelia Smith quietly withdrew her hand, cursing the capitalist for having so many expensive decorations in his house.<br/><br/>As she thought about it, she turned around and William Lane was already in front of her.<br/><br/>She instinctively took a step back, but there was nowhere else to go since the cabinet was already behind her, so she had to press herself against it.<br/><br/>William Lane took another step forward, their clothes touching.<br/><br/><br/><br/>Amelia Smith raised her hand to his shoulder, trying to put some distance between them, but it didn’t work well: “Young Master Lane...”<br/><br/><br/><br/>It seemed like he had let go of whatever had been weighing on his mind, feeling relaxed and glowing.<br/><br/>As soon as she saw him, Amelia Smith was so excited that she couldn’t even speak clearly.<br/><br/>She asked a senior, who was the person beside Teacher Ortiz.<br/><br/>The senior told her that he was William Lane, the eldest son of the Lane family, who would be the future housemaster of the Lane family.<br/><br/>Imperial Capital’s two big families, the Clark Family and the Lane Family.<br/><br/>If she was just an ordinary worker, she might not pay much attention to them.<br/><br/>But being in the Dance Association, she could feel their prestige.<br/><br/>When she learned that,<br/><br/>Amelia Smith felt a moment of loss.<br/><br/>She suddenly didn’t know why she had been so persistent in finding him and what she wanted to do.<br/><br/><br/><br/>She should have known long ago that they were not of the same world, and she couldn’t repay him for anything.<br/><br/>But to this man, she was just a small insert song in his life, and he had long forgotten about her.<br/><br/>So she didn’t go to him and secretly watched him from afar.<br/><br/>Bit by bit, she felt the gap between them that she could never cross, no matter how hard she tried.<br/><br/>Later, Sophie Ortiz introduced her son to them, the newcomers.<br/><br/>When William Lane looked at her, his eyes were completely those of a stranger.<br/><br/>She didn’t say anything either, treating him as a stranger, and called him “Young Master Lane”.<br/><br/>Then after the gathering that day, she was waiting for a taxi on the roadside, and William Lane’s car stopped in front of her.<br/><br/>As the car window went down and Amelia Smith saw his face, she clenched her bag tightly.<br/><br/>William Lane looked at her and smiled gently, “Lady Smith, are you waiting for a car? Let me give you a ride.”<br/><br/>Amelia felt that at that time, something good must have happened to William Lane, which made him so happy. She said, “I live far away, and it’s no trouble for Young Master Lane.”<br/><br/>“Lady Smith, I once helped someone,” William Lane said suddenly in a slow voice, “and later, that person forgot about me. Do you think that person is ungrateful? To be honest, I’m quite sad.”<br/><br/>“I didn’t forget,” Amelia blurted out, raising her voice a bit.<br/><br/>After she said that, she saw William Lane laughing and immediately lowered her head.<br/><br/>“So you’re blaming me for pretending not to know you just now?” William Lane continued.<br/><br/>“No,” Amelia didn’t dare to look at him.<br/><br/>“What should you call me then?” William Lane asked.<br/><br/>Amelia’s ears were burning, and after a moment, she whispered, “Elder Brother.”<br/><br/>Young Master Lane seemed satisfied, “Get in the car, and I’ll take you home.”<br/><br/>“I live too far away,” Amelia protested again, “I’ll just take a taxi.”<br/><br/>“My home is far away too,” William Lane said, “Get in and tell me how you’ve been doing these past few years.”<br/><br/>For William Lane, Amelia Smith felt that the fact that he remembered her was already very gratifying...\t\t\t\t\t\t</div>", "images": {}, "success": true}