{"id": 630, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15170397.html", "title": "Chapter 627: Extra Four: Ink Dot Plum Scent (Part Two)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 627: Extra Four: Ink Dot Plum Scent (Part Two)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 627: Extra Four: Ink Dot Plum Scent (Part Two)<br/><br/>“What are you afraid of?” William Lane laughed a bit.<br/><br/>“What are you laughing at?” Amelia Smith looked at him.<br/><br/>“It’s funny,” William Lane said, “My mom really likes you.”<br/><br/>Amelia Smith took her eyes off him and looked out the car window without speaking.<br/><br/>Of course she would like her as a student.<br/><br/>But as someone’s girlfriend, even just for fun. With her background, standing with William Lane... It’s bound to provoke others.<br/><br/>As Amelia Smith thought about this, she noticed the passing scenery didn’t seem right and turned to ask, “Where are we going?”<br/><br/>“Home.”<br/><br/>“I have to work,” Amelia Smith said, “Please, drop me off ahead and I’ll ride a bike there.”<br/><br/>William Lane didn’t stop the car.<br/><br/><br/><br/>“Young Master Lane.”<br/><br/>“Don’t go,” William Lane said.<br/><br/>“I have to make money,” Amelia Smith said.<br/><br/>William Lane glanced at her, seeing she was about to get angry, and asked, “Still at the coffee shop?”<br/><br/>“Yes,” Amelia Smith paused before saying, “Last time I went to the clubhouse, I was a substitute for a friend. I had a decent job there, what’s with the anger?”<br/><br/>“You had a decent job, but were the people there decent?” William Lane said.<br/><br/>“You went there too,” Amelia Smith said.<br/><br/>“I had business.”<br/><br/>“Everyone else had business too,” Amelia Smith said, “Besides, I’m not a child, can’t I protect myself from being bullied?”<br/><br/>“Tsk,” William Lane frowned, “Why do you always have so many reasons?”<br/><br/>Amelia Smith closed her mouth, her doe eyes blinked, and then she said, “I won’t go anymore.”<br/><br/>William Lane took her to the street where the coffee shop was located but didn’t go to the coffee shop itself, “I’ll pick you up tonight.”<br/><br/>Amelia Smith got out of the car first before saying, “No need. I can manage by myself.”<br/><br/>As she finished speaking, she didn’t give William Lane time to argue, she closed the car door and left.<br/><br/>William Lane: “......”<br/><br/>Despite what she said, after finishing his work, William Lane still came to pick her up.<br/><br/>He parked his car at the street corner and walked over to fetch her.<br/><br/>Upon reaching the entrance of the coffee shop, he had to wait outside for her.<br/><br/>According to Amelia Smith, his car, clothes, and disposition were not compatible with her part-time job.<br/><br/><br/><br/>So he was just a “disreputable” presence.<br/><br/>As he neared the entrance, William Lane sent her a message to let her know he was outside.<br/><br/><br/><br/>Amelia lowered her gaze, her fingers gently scratching the sofa.<br/><br/>William Lane took a deep breath: “Do I really disgust you that much? You don’t even give me a second glance despite me chasing you all day, yet you immediately like someone else.”<br/><br/>Amelia’s hands slowly clenched.<br/><br/>Seeing that she didn’t want to talk, William Lane stood in front of her for a while before sitting down on the other side of the sofa.<br/><br/>The two of them sat quietly at the ends of the sofa for a while, and then William Lane said, “Go rest.”<br/><br/>Amelia replied softly, got up to leave, and then quietly said, “You should rest early too.”<br/><br/>As she was about to leave, William Lane suddenly got up, walked over to her, and grabbed her wrist.<br/><br/>Then he sat down on the sofa, pulling Amelia onto his lap.<br/><br/><br/><br/>While Amelia was still in shock from the sudden fall, he pinched her face and kissed her.<br/><br/>Their lips touched softly, and a cold sensation traveled from her mouth to her brain.<br/><br/>Her face was squeezed tightly, her lips parted...<br/><br/>Amelia’s eyes widened in shock, as she became dumbfounded.<br/><br/>It was only when William Lane’s grip tightened around her waist that she snapped back to her senses and tried to push him away with her hands on his shoulders.<br/><br/>But William Lane was too strong and could not be pushed away.<br/><br/>Amelia’s remaining rationality made her struggle.<br/><br/>After struggling for a while, William Lane finally let go of her.<br/><br/>Amelia pushed him away, stood up immediately, her eyes red, breathing heavily, looking at him with unbelievable and somewhat pitiful incredulity.<br/><br/>William Lane leaned back on the sofa, his neatly dressed shirt wrinkled, his thin lips turning red, and the lust in his eyes burst forth without any concealment.<br/><br/>He looked up at Amelia.<br/><br/>“You’re not allowed to go to the coffee shop anymore. If you want to work, I’ll arrange it for you.” The hoarseness in William Lane’s voice was evident.<br/><br/>“I don’t need it.” Amelia’s voice was also hoarse, but she was on the verge of tears.<br/><br/>William Lane didn’t give in: “I’ll give you a choice. Either don’t go to the coffee shop, or go one more time tomorrow and never come out of this villa.”<br/><br/>“You...”<br/><br/>William Lane’s eyes grew darker.<br/><br/>“Bastard.” Amelia wiped her lips and turned to leave.<br/><br/>William Lane looked down and called, “James Lane.”<br/><br/>A man in black suddenly appeared at the entrance, blocking Amelia’s path.<br/><br/>“Get out of the way!”<br/><br/>James didn’t move.<br/><br/>Amelia tried pushing him a few times without success, eventually gave up, and returned to the living room, then went upstairs to her usual guest room.<br/><br/>When the room door closed, the living room fell silent.<br/><br/>William Lane sat in the living room for a long time before raising his hand to touch his own lips...\t\t\t\t\t\t</div>", "images": {}, "success": true}