{"id": 647, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15191889.html", "title": "Chapter 644 - 645: Side Story Twenty-Two: Inked Plum Fragrance (Twenty)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 644 - 645: Side Story Twenty-Two: Inked Plum Fragrance (Twenty)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 645: Side Story Twenty-two: Inked Plum Fragrance (Twenty)<br/><br/>Amelia Smith left the ward without seeing William Lane, she walked towards the elevator and saw William Lane walking back.<br/><br/>William Lane noticed her eyes were red and walked closer and hugged her.<br/><br/>Amelia struggled slightly: “There are people around.”<br/><br/>“Where are the people?” William Lane lightly kissed her face, “Besides, what’s wrong with hugging my own wife? Does it bother them?”<br/><br/>Amelia laughed: “You seem a bit childish.”<br/><br/>“Childish is good; it makes me look young so that others won’t think I’m old.”<br/><br/>“Who said you’re old?”<br/><br/>“Your young brother.” William Lane replied.<br/><br/>“Hmm?” Amelia raised her head to look at him, “Didn’t he leave?”<br/><br/>“He just left.” William Lane held her face and rubbed it, “He said if I don’t treat you well, he will find someone to get rid of me.”<br/><br/><br/><br/>Amelia’s mouth twitched: “Then what?”<br/><br/>“After that...” William Lane said, “I told him that all future assassination attempts will be on his head.”<br/><br/>“Is it that dangerous?” Amelia asked.<br/><br/>William Lane nodded.<br/><br/>“Can I still escape now?”<br/><br/>William Lane laughed: “It’s too late. You don’t have a chance to run anymore.”<br/><br/>Amelia smiled and leaned back on William Lane’s shoulder and rested for a while.<br/><br/>William Lane touched her head and let her rest for a while before saying, “Let’s go home.”<br/><br/>“Okay.”<br/><br/>William Lane went to hold her left hand, his gaze passed over her right arm and saw blood on her sleeve.<br/><br/>He immediately grabbed her right hand and rolled up her sleeve to look.<br/><br/>Blood had seeped through the wound, through the gauze, and onto her clothes.<br/><br/>William Lane frowned: “What happened?”<br/><br/>“I accidentally squeezed it just now.” Amelia said softly.<br/><br/>William Lane glanced at her and led her by the left hand upstairs to find the doctor: “Doesn’t it hurt? You were injured, and didn’t speak up. Do you plan to wait until we get home and then come back?”<br/><br/>Amelia pursed her lips: “I-I didn’t know that I was bleeding.”<br/><br/>“Don’t you know it hurts?” William Lane said seriously.<br/><br/>Amelia fell silent.<br/><br/><br/><br/>It wasn’t until a few minutes after William Lane had left that she slowly moved.<br/><br/>Then she stiffly walked to the bookshelf on the other side of the room.<br/><br/><br/><br/>She stood by the bookshelf, keeping her hands on her chest, feeling that every part of her body was hot.<br/><br/>But the place where her hands were covering seemed to be even hotter.<br/><br/>His kiss had landed there...<br/><br/>...<br/><br/>Amelia’s efficiency in the afternoon wasn’t high; for the first two hours, her mind was filled with William Lane and she couldn’t calm down.<br/><br/>Later on, she slowly started reading the book.<br/><br/>William Lane did not come back for dinner.<br/><br/>He had been busy at the company until after ten o’clock before he returned.<br/><br/>When he came back, Amelia was waiting for him in the living room.<br/><br/>“You’re back?” Amelia stood up, “Aunt made soup, want some?”<br/><br/>As soon as William Lane came back and saw her waiting in the living room, he felt less tired: “You were waiting for me?”<br/><br/>“Yes.”<br/><br/>William Lane leaned over and kissed her eyes: “Don’t wait for me in the future. Go to bed early.”<br/><br/><br/><br/>“When I go to work, I definitely won’t wait for you.” Amelia said.<br/><br/>“Then have a good rest these few days.” William Lane rubbed her hair, “You don’t have to wait for me.”<br/><br/>Amelia didn’t answer, and followed him inside: “Do you want to drink the soup? Aunt’s soup is delicious.”<br/><br/>“Alright.”<br/><br/>They both drank the soup together. William Lane went to the guestroom to take a shower, and Amelia helped Aunt clean up before going back to her room to prepare for bed.<br/><br/>Just as she was about to sleep, someone knocked on the door.<br/><br/>She got up to open the door and saw William Lane wearing a sleeping robe standing outside.<br/><br/>He had just taken a shower, dried his hair, and his body smelled of shower gel.<br/><br/>“What’s wrong?” Amelia asked.<br/><br/>William Lane smiled: “Come to sleep.”<br/><br/>“What?” Amelia froze and couldn’t believe what she had just heard, “Come what?”<br/><br/>“We, as a couple, have been separated for a long time. It’s time for us to sleep together.”<br/><br/>Amelia stared with wide eyes, unable to react, and even felt like running away.<br/><br/>Seeing her about to run, William Lane bent down, grabbed her waist, and carried her into the bedroom, kicking the door shut with his foot.\t\t\t\t\t\t</div>", "images": {}, "success": true}