{"id": 648, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15191892.html", "title": "Chapter 645 - 646: Side Story 23: Ink-Dot Plum Fragrance (21)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 645 - 646: Side Story 23: Ink-Dot Plum Fragrance (21)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 646: Side Story 23: Ink-Dot Plum Fragrance (21)<br/><br/>William Lane softly placed Amelia Smith on the bed, worried that she might strain her injured arm.<br/><br/>Amelia sat on the bed, looking at William in a daze.<br/><br/>William leaned over, looking at her with a smile in his eyes. “Is it okay if we sleep together?”<br/><br/>He forcefully entered the room but acted like a gentleman once inside, gently asking for her permission.<br/><br/>“But, but...”<br/><br/>“Amelia, we got married,” William interrupted. “It’s only right, rational, and legal for us to sleep together.”<br/><br/>Amelia, looking into his eyes, felt as if there were stars in them, gently intoxicating her. So, she inexplicably nodded her head.<br/><br/>William smiled, lifting the quilt on the other side to tuck her in.<br/><br/>However, Amelia stiffly resisted him.<br/><br/>William found it amusing and asked, “What’s wrong? You seem to be pushing yourself.”<br/><br/><br/><br/>“I, I’m not. I just don’t want to sleep yet. You sleep first. I’ll sleep later,” Amelia said, her eyes darting around.<br/><br/>William laughed, “What if I fall asleep and you run away?”<br/><br/>“I, I won’t run.”<br/><br/>“Do you think what you just said is credible?” William asked.<br/><br/>“Yes.”<br/><br/>William chuckled, picked her up horizontally, and tucked her into the blanket. Then he got into bed and held her in his arms.<br/><br/>Feeling the warmth of his skin, Amelia’s body became as stiff as a wooden plank.<br/><br/>William kissed her lips gently and placed her injured arm on his waist, softly saying, “Relax and sleep. I won’t do anything.”<br/><br/>Amelia responded softly and closed her eyes.<br/><br/>William looked at her trembling eyelashes for a while, then used the remote control by the head of the bed to turn off all the lights in the room.<br/><br/>As they plunged into darkness, Amelia slowly opened her eyes.<br/><br/>At this moment, she wasn’t sure if her fear of the dark was greater than the sense of safety that darkness could hide everything.<br/><br/>All she knew was that she was extremely tense, her body stiff with anxiety.<br/><br/>The distance between them was so close that she could hear William’s heartbeat and feel the heat of his body.<br/><br/><br/><br/>“I’m sorry,” William apologized. “I just wanted to know more about you. I looked into your school records.”<br/><br/>Amelia didn’t mind, “It doesn’t matter if you investigate me. I’m innocent.”<br/><br/>William gently caressed her hair.<br/><br/>“Having good elementary school grades doesn’t mean much. Everything you learn is simple,” Amelia said.<br/><br/>“Your middle school grades were also very good,” William said. “Your grades are still good now. Evan Smith scored 701 in the college entrance exam, making him the provincial champion in your province this year. If he can achieve that, you must be even more amazing.”<br/><br/>“My brother is very intelligent,” Amelia laughed. “Why do you sound so condescending?”<br/><br/>William chuckled, “It’s just that I resent him for wanting to get rid of me... You and your siblings have a good relationship.”<br/><br/>“My sisters and brothers get along well,” Amelia confirmed. “Maybe it’s because I took care of Evan more, and our ages were similar. He was the most directly affected by the unfair treatment I received. So, his feelings for me are deep, and he’s always trying to make up for it.”<br/><br/>“For now, I find him more bearable,” William said.<br/><br/>“Elder Brother, you can be quite childish,” Amelia teased.<br/><br/><br/><br/>“We can talk about something more mature,” William said, moving his arm from underneath her neck to touch her ear. “As long as you don’t run.”<br/><br/>“Um, let’s stay childish instead. Being childish is better,” Amelia said quickly.<br/><br/>William smiled, “So, what happened next? Why did you stop going to school?”<br/><br/>“My mother’s health was bad, and Max got into gambling. My two sisters got married, bringing in 200,000 dollars that Max squandered away,” Amelia explained. “Evan needed to go to school and live. I had to become the labor force.”<br/><br/>As for how Max caused a scene at school and forced her to stop attending, she left that part out.<br/><br/>“Later... The first thing I did after dropping out was to change my name,” Amelia continued. “Then, I met you, Elder Brother.”<br/><br/>“Did you get into trouble when you went home?” William asked.<br/><br/>“No, they only cared about Evan. As for me, as long as I could bring in money, they didn’t care what I did,” Amelia said nonchalantly.<br/><br/>William held her tighter, “Amelia, I’m sorry. I should’ve taken you back with me.”<br/><br/>During the time that Max was locked up here, he was beaten by James Lane and questioned about many things. He later reported the information to William.<br/><br/>William knew that not long after they had met when she was fourteen, Max tried to sell Amelia to pay off his debts.<br/><br/>“Elder Brother, if you had taken me back then, I would’ve thought you were a bad person,” Amelia said sincerely.<br/><br/>William: “......”<br/><br/><br/><br/>“I would’ve called the police when we were on our way,” Amelia added.<br/><br/>William was silent for a moment before rolling over and pinning her beneath him, “Call the police now.”\t\t\t\t\t\t</div>", "images": {}, "success": true}