{"id": 643, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15189496.html", "title": "Chapter 640 - 641: Extra Eighteen: Ink Dot Plum Scent (Sixteen)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 640 - 641: Extra Eighteen: Ink Dot Plum Scent (Sixteen)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 641: Extra Eighteen: Ink Dot Plum Scent (Sixteen)<br/><br/>Amelia Smith had minor injuries all over, aside from a serious wound on her arm and a concussion.<br/><br/>Her leg was caught in a crevice, but it was just a bruise, no serious harm.<br/><br/>Perhaps it was good fortune in misfortune.<br/><br/>However, because of the blood loss and concussion, she was unconscious for a day.<br/><br/>When Amelia woke up, the sky was just beginning to lighten.<br/><br/>She opened her eyes to the hospital ceiling, smelled the disinfectants, and stayed dazed for quite some time before realizing she was still alive.<br/><br/>And she was in a hospital.<br/><br/>She blinked and then shifted her eyes to the side.<br/><br/>William Lane was sitting on a chair beside the bed, elbows upon the bedside table, his head held up by his hand, fast asleep.<br/><br/>Amelia watched his closed eyes, his high-bridged nose, and his thin lips.<br/><br/>Her eyes slowly traced the details of William’s carefully refined face.<br/><br/>Suddenly, William opened his eyes.<br/><br/>Amelia instinctively averted her eyes, feeling embarrassed as if she had been caught peeking.<br/><br/>But William was too anxious to notice her facial expressions; he was relieved that she was awake, “Amelia, you’re awake? Since when? Do you feel uncomfortable anywhere? Does your wound hurt?”<br/><br/>“Just woke up, and I’m not uncomfortable.” Amelia spoke, her throat sounding a bit hoarse.<br/><br/>William got up, gently touched her face, and called over the doctor anyway.<br/><br/>The attending doctor came for a checkup and found no problems, which finally eased William’s mind somewhat.<br/><br/>He poured her a glass of water, inserted a straw, and brought it to her lips, “Drink some water.”<br/><br/>Amelia had a few sips.<br/><br/>William then sat back down in the chair, caressed Amelia’s right hand, “Does it hurt?”<br/><br/>Amelia looked at his bloodshot eyes, “It doesn’t hurt, I can’t feel anything.”<br/><br/>“The IV drip has a bit of painkillers, if you feel pain, they can increase the dose a bit, it won’t affect your body.” William softly explained.<br/><br/>“It doesn’t hurt.” Amelia looked at him, “Did you get hurt anywhere?”<br/><br/>Hearing his voice turn cold, Amelia Smith’s tears poured more heavily. She paused before saying, “I suddenly felt like telling it.”<br/><br/>“Amelia Smith, I want to hear the truth.” William Lane looked at her unwaveringly.<br/><br/>Amelia Smith tried to look away, but William Lane grasped her chin and forced her to look at him.<br/><br/>Unable to free herself, Amelia gave a sniffle, “I’m scared.”<br/><br/>“Scared of what?”<br/><br/>“Scared of death.”<br/><br/>William Lane didn’t quite understand.<br/><br/>Amelia choked back a sob, “Life is unpredictable. I fear death, because that means I won’t get to see you again. I fear death, because I haven’t had the chance to spend quality time with you or even tell you that I like you.”<br/><br/>William Lane’s eyelashes fluttered slightly, as he stood there, somewhat dazed.<br/><br/>“I don’t care anymore if you will always like me or whether I’m worthy of you.” Amelia choked out between sobs, struggling for breath, “But, but... I’m not as good as you think I am. I’ve been using your feelings for me to get close to you.”<br/><br/>William Lane pulled her into his arms, brushing away her tears with one hand and patting her back with the other to comfort her.<br/><br/>Amelia sniffed quietly, “Brother, will you hate me?”<br/><br/>“Why would I hate you?” William patted her back, “How do you know I didn’t deliberately bring up your brother’s issue, knowing that you would’ve gone into the Civil Affairs Bureau anyway.”<br/><br/>Amelia gave a soft whimper, sounding like a small kitten.<br/><br/>William Lane buried her face in his waist, letting her wet his clothes with her tears. He fondled her head, “Amelia, that’s not selfishness. It’s just that our little Amelia likes her elder brother. You can’t control yourself when you’re in love.”<br/><br/>“Also, Lady Smith, you need to get one thing straight. From start to finish, it has been me pursuing you and me insisting on keeping you by my side. If it wasn’t me wanting to see you, do you think... you could see me anyway?”<br/><br/>“No, I wouldn’t.” Amelia toughed through her tear-induced dizziness and somehow managed to answer his question.<br/><br/>A smile reached William Lane’s eyes, “There you go. Honesty is the best policy. What goes on in that head of yours all day? Is your mind built differently from mine?”<br/><br/>Amelia choked sobbed again.<br/><br/>William Lane took pity on her; he gently pulled her out from his hug and wiped away her tears and runny nose, then leaned down to her eye level and asked, “Do you like elder brother?”<br/><br/>“I do.” Amelia glanced at him before dropping her gaze again.<br/><br/>William Lane leaned in to kiss her tear-soaked eyes, “I like you too, very much... Amelia, our lifetime is going to be long; we will love each other all our lives. So, later on... don’t grow tired of your old big brother.”<br/><br/>Amelia shook her head, but after a couple times, she began to feel dizzy.<br/><br/>Noticing that, William Lane immediately steadied her head to keep her from moving, he held her against the bed, “Stop moving. Just rest for a bit.”<br/><br/>“Um.”\t\t\t\t\t\t</div>", "images": {}, "success": true}