{"id": 645, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15189501.html", "title": "Chapter 642 - 643: Extra Twenty: Ink Dot Plum Scent (Part Eighteen)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 642 - 643: Extra Twenty: Ink Dot Plum Scent (Part Eighteen)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 643: Extra Twenty: Ink Dot Plum Scent (Part Eighteen)<br/><br/>Knowing that Amelia Smith felt tense and unfamiliar in their presence.<br/><br/>Kevin Clark and Hugo Clark went to the hospital balcony, and William Lane took his meal to the balcony as well.<br/><br/>Only Charlotte Lane and her sister Olivia Lane were left chatting with Amelia Smith.<br/><br/>“Sister-in-law, how did you meet my brother? Was it at the Dance Association?” Olivia Lane asked curiously.<br/><br/>“No, we met a long time ago. He helped me with a favor,” Amelia Smith replied.<br/><br/>“A long time ago?” Olivia Lane exclaimed in surprise, “How old were you then?”<br/><br/>“Fourteen,” Amelia Smith answered honestly.<br/><br/>Charlotte Lane glanced at her.<br/><br/>“Fourteen!” Olivia Lane suddenly raised her voice, “Not even sixteen!”<br/><br/>William Lane, who was on the balcony, heard Olivia Lane’s shout: “.........”<br/><br/><br/><br/>Kevin Clark, who hadn’t married his wife yet, dared not speak and remained silent.<br/><br/>Arthur North, who had already married his wife, cast an accusing look at Kevin.<br/><br/>“I only met her when she was fourteen,” William Lane said softly.<br/><br/>Arthur North laughed lightly: “How old is the little girl now?”<br/><br/>“We’re on the same boat, why are you feeling superior?” William Lane said, “Seducing your niece.”<br/><br/>Arthur North said, “I didn’t threaten Lila to get the marriage certificate.”<br/><br/>William Lane: “.......”<br/><br/>Arthur North raised his eyebrows.<br/><br/>Fearing that Amelia Smith would get tired, they stayed for a while before leaving when William finished his meal.<br/><br/>William Lane accompanied them out of the ward. At the entrance of the ward, Charlotte Lane said, “Brother, I would like to have a chat with you alone.”<br/><br/>William Lane thought for a moment, probably knowing what she wanted to say. He followed her to the end of the corridor.<br/><br/>The remaining people waited outside the ward for the siblings.<br/><br/>“Brother, I bear some responsibility for her injury, I am sorry,” Charlotte Lane began immediately.<br/><br/>William Lane’s brows slightly furrowed.<br/><br/>“I know Bella Reid is in love with you, I failed to handle it well... ”<br/><br/>“But didn’t you have someone monitor her?” William Lane interrupted, “It’s her own malicious intention, and you were not responsible for her.”<br/><br/>Charlotte Lane paused for a moment before speaking, “Arthur North told you about it.”<br/><br/>William Lane nodded: “He told me this morning.”<br/><br/>Charlotte Lane: “......”<br/><br/><br/><br/>William Lane smiled and said, “Lila, this has nothing to do with you. As for her, she only exposed a couple of tables at the wedding. She wanted to work with you, and you didn’t agree. You have taught her a lesson, and that’s enough. We are not murderers, and we can’t just casually take someone’s life.”<br/><br/>Charlotte Lane, her hands in her pockets, leaned against the wall and looked at William Lane.<br/><br/><br/><br/>Amelia Smith turned to look at William Lane.<br/><br/>William Lane smiled at her like he was teasing a child.<br/><br/>Amelia Smith turned her gaze back and said: “Evan, he hasn’t bullied me, he hasn’t forced me, and he’s been good to me. We’ve got the certificate.”<br/><br/>After listening to her words, Evan Smith was unresponsive for nearly a minute.<br/><br/>Finally, he responded, his face pale and somewhat frightening: “Sister, you married him? Of your own volition?”<br/><br/>Amelia Smith nodded.<br/><br/>Evan Smith opened and closed his mouth, then suddenly said, “He’s so old! He...”<br/><br/>Amelia Smith: “!!!”<br/><br/><br/><br/>“How can he be happy about...”<br/><br/>His voice was too loud, and Amelia Smith quickly covered his mouth: “Lower your voice.”<br/><br/>Evan Smith stopped talking.<br/><br/>Amelia Smith let go of him and said, “He’s not old. He’s just a little older, but age is just a number. Why measure it by a number?”<br/><br/>“But...”<br/><br/>“We’re already married.” Amelia Smith interrupted him.<br/><br/>Evan Smith swallowed the words he wanted to say.<br/><br/>The siblings fell silent for a while, then Evan Smith asked, “Did he take care of Mom’s hospitalization?”<br/><br/>Amelia Smith nodded.<br/><br/>Ever since Evan arrived at the hospital, he felt something strange. He asked the doctor, but the doctor didn’t say anything.<br/><br/>He suspected if it was William Lane who did all these things.<br/><br/>Then, thinking about William Lane, he wondered if his sister was being bullied.<br/><br/>But the two had actually gotten their certificate.<br/><br/>With William Lane’s status, if it were just for fun, why get the certificate?<br/><br/>“Sister, do you like him?” Evan Smith asked.<br/><br/>Amelia Smith nodded again: “I like him. I’ve liked him for many years.”<br/><br/>Evan Smith looked at her, saw her expression, and knew she wasn’t lying. So he had nothing more to say.<br/><br/>After another moment of silence, he said, “Do you know where Dad is? Mom said she hasn’t seen him for several days.”<br/><br/>Amelia Smith’s face grew colder: “I know.”<br/><br/>Seeing her expression, Evan Smith suddenly became nervous: “Did he do something again?”<br/><br/>“Mmm.”<br/><br/>Evan Smith thought of William Lane, his whole body tense, and he swallowed hard: “He...”<br/><br/>“He’s at the place where I’m staying now.” Amelia Smith said, “I’ll talk to him, and then you can take him away.”<br/><br/>Evan Smith sighed with relief, and after a pause said: “Okay.”\t\t\t\t\t\t</div>", "images": {}, "success": true}