{"id": 640, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15176555.html", "title": "Chapter 637 - 638: Extra Fifteen: Ink Dot Plum Scent (Part Thirteen)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 637 - 638: Extra Fifteen: Ink Dot Plum Scent (Part Thirteen)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 638: Extra Fifteen: Ink Dot Plum Scent (Part Thirteen)<br/><br/>Amelia Smith brought her to the address provided by Max Smith, William Lane offered to drop her off.<br/><br/>She let James Lane drop her off at a supermarket entrance, went inside to buy some things, then walked to the inn.<br/><br/>When she arrived, Max Smith was waiting for her at the entrance.<br/><br/>As soon as he saw her, Max narrowed his eyes, then immediately welcomed her with a smile.<br/><br/>“Miss Amos.”<br/><br/>Max was dressed simply, in a short-sleeved black outfit. Although washed a bit whitish, the fabric was very good.<br/><br/>Over fifty years old, he had slight wrinkles on his face, but it was not difficult to see that he was very good-looking.<br/><br/>The entire family of six at Amelia’s home was very good-looking.<br/><br/>Max took the things from Amelia’s hand: “Are you tired?”<br/><br/>Amelia Smith looked at him and asked directly, “Where’s my mom?”<br/><br/><br/><br/>“Inside.” Max smiled, trying to be pleasing. “I’ll take you there.”<br/><br/>Amelia maintained some distance from him, not wanting to have too much conversation with him, and followed him into the hotel.<br/><br/>From the outside, the hotel did not appear to be too large, but once inside, it was quite spacious and looked clean.<br/><br/>In this area, it would cost about two or three hundred for a night.<br/><br/>Amelia looked around and followed Max into the elevator: “Does Evan Smith know you guys are here?”<br/><br/>“He knows; I’ve already told him. He helped us book this place.” Max responded with a smile.<br/><br/>Amelia glanced at him: “He didn’t come?”<br/><br/>“He said he has to do a part-time job during the day, and can only come after work in the evening.” Max lowered his stance.<br/><br/>Hearing his reply, Amelia watched as the elevator stopped on the 12th Tower, the elevator door opened.<br/><br/>“Miss Amos, we’re here.” Max took a step out, noticing she hadn’t moved, and called her name.<br/><br/>Amelia followed him out, then took out her cell phone and sent a message.<br/><br/>The corridor was narrow, with a carpet on the ground. Occasionally as they passed a room, they would smell smoke or hear loud conversations from inside the rooms.<br/><br/>Amelia followed him along a rather long path, turning a corner, all the way to the end of the corridor, before arriving at the room.<br/><br/>“It’s here.” Max said, taking out the room card.<br/><br/>With a beep, the room door was unlocked, and Max pushed it open.<br/><br/>Just as he pushed it open a crack, Amelia suddenly said: “Dad.”<br/><br/><br/><br/>Amelia Smith took a deep breath, exhaled slowly, then took a step back and walked out of the room.<br/><br/>The three men’s reflexes were quite sharp, and they immediately pursued her. Just as one man was about to grab Amelia Smith’s hand, a hand suddenly stretched out from outside the door and pushed his hand away.<br/><br/>Amelia Smith walked out of the room and stood in the corridor, glancing at Max Smith, who was lying on the ground against the wall, unconscious from James Lane’s efforts.<br/><br/>James Lane blocked the three men at the entrance of the room.<br/><br/>“What are you doing?” One man said coldly, “Don’t get in our way, you’ll suffer for it. Hurry up and...”<br/><br/><br/><br/>Before the word “scram” was uttered, the leading man suddenly stopped the talking man.<br/><br/>Then he looked at James Lane and said, “Big Brother Lane?”<br/><br/>The other two men’s eyes widened, and they immediately held their breaths.<br/><br/>James Lane was the chief thug under William Lane.<br/><br/>He used to be outside. After Amelia Smith came, William Lane gradually brought James Lane back.<br/><br/>Aside from managing his subordinates, James Lane’s main job now was to be responsible for Amelia Smith’s safety.<br/><br/>As for William Lane, he was rarely seen, and his reputation was little heard.<br/><br/>But with James Lane, many people on the street were terrified by the sound of his name.<br/><br/>They would all respectfully call him “Big Brother Lane.”<br/><br/>James Lane didn’t know the man in front of him but looked at him without saying anything.<br/><br/>“Big Brother Lane,” The man introduced, “We all work for Richie brother.”<br/><br/>James Lane knew his identity and said coldly, “That’s our Young Madam.”<br/><br/>Three faces showed panic, and their legs even began to weaken.<br/><br/><br/><br/>If one of William Lane’s thugs could be called Big Brother, what kind of character would William Lane be to make people willingly submit and be loyal.’<br/><br/>Moreover, this was the Lane Family of Imperial Capital.’<br/><br/>They couldn’t imagine what would have happened if they had touched her just now.’<br/><br/>“We, we didn’t do anything. Nothing at all.” The three men said while stepping back, “We didn’t even touch her. You can ask Mrs. Lane, we really didn’t. Big Brother Lane, we really didn’t know. It was her father, her father sent her here. He said she didn’t have a boyfriend, that’s why we came.”<br/><br/>James Lane walked in, intending to control them in the room and settle the matter.’<br/><br/>Amelia Smith caught on and said, “James Lane, let it go. Don’t make too much of a commotion.”<br/><br/>“Yes, sir.” James Lane replied.<br/><br/>“I’ll take care of the man who owes you.” James Lane’s voice was icy, even murderous as soon as he opened his mouth, “You guys scram back to the border immediately.”<br/><br/>“Yes, yes. We’ll leave right away. Don’t worry about the money, just forget it.” The three men bowed and nodded, lowering their heads, “Thank you Mrs. Lane, thank you Mrs. Lane.”<br/><br/>Amelia Smith’s face was pale, and it was as if her mind went blank for a moment, with nothing left...\t\t\t\t\t\t</div>", "images": {}, "success": true}