{"id": 641, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15185231.html", "title": "Chapter 638 - 639: Extra Sixteen: Ink Dot Plum Scent (Part Fourteen)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 638 - 639: Extra Sixteen: Ink Dot Plum Scent (Part Fourteen)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 639: Extra Sixteen: Ink Dot Plum Scent (Part Fourteen)<br/><br/>Leaving the inn, James Lane left Max Smith on the car.<br/><br/>“Lady Smith, please sit in the copilot seat.”<br/><br/>Amelia Smith shook her head without getting in the car: “There’s surveillance in the corridor.”<br/><br/>“It’s fine, I’ll have someone take care of it.” James Lane said.<br/><br/>“Could you help me find out if my mother has come over?” Amelia Smith said.<br/><br/>“Okay. I’ll have someone check immediately.”<br/><br/>“Let me know once you find out, I’ll just wander around here.” Amelia Smith said, “You can go back.”<br/><br/>James Lane sent a message for someone to investigate, and after looking at her, saw that she didn’t look well, hesitated for a moment: “I’ll take Lady Smith home.”<br/><br/>“I’m fine. Don’t worry.” Amelia Smith said.<br/><br/>“Okay.” After James Lane agreed, he got in the car and drove away.<br/><br/><br/><br/>Amelia Smith watched him leave and then went back into the inn to use the restroom.<br/><br/>Once she went in, she threw up.<br/><br/>Her stomach cramped, causing severe pain. After a while, when she couldn’t vomit anymore, Amelia Smith turned on the faucet and washed her face.<br/><br/>After washing her face, she raised her head to look at herself in the mirror.<br/><br/>Her face was so pale that she didn’t look alive, and her eyes were red. Water droplets hung on her face.<br/><br/>When Max Smith called her over, she became suspicious.<br/><br/>After all, he had done such a thing once before.<br/><br/>Moreover, when he saw her, he usually asked for money.<br/><br/>Just in case, she had James Lane take her there.<br/><br/>However, in the elevator, Max Smith lied.<br/><br/>Evan Smith’s arm hadn’t healed yet, he couldn’t work a part-time job.<br/><br/>Amelia Smith lowered her eyes, and after a while, she covered her eyes with her hand.<br/><br/>Her bloodless lips pursed tightly, stubbornly suppressing all the sounds in her throat...<br/><br/>James Lane didn’t go far on his side.<br/><br/>He parked the car and placed a call to William Lane, briefly explaining the situation.<br/><br/>He then kept an eye on Amelia Smith’s location.<br/><br/>Amelia Smith stayed in the restroom for a long time, and then began wandering around nearby.<br/><br/>James Lane followed her from a distance, not daring to drive too close.<br/><br/>The investigation results came back from his subordinate; Amelia Smith’s mother did come to Imperial Capital, also went to the hospital for a check-up, and was now waiting for a ward at the inn.<br/><br/><br/><br/>James Lane informed her about it.<br/><br/><br/><br/>It took her a long time to sit up and look at the person in the driver’s seat who was heavily wrapped up, not even showing a finger.<br/><br/>“Who are you? What do you want?”<br/><br/>The driver wore sunglasses, a mask, and a hat. It seemed as if they glanced at her from the rearview mirror before saying, “My name is Bella Reid. I want to kill you.”<br/><br/>Amelia’s pupils slightly contracted, and her heartbeat accelerated involuntarily. After a while, she asked, “Do I know you? Do we have a grudge against each other?”<br/><br/>“I know you. As for the grudge... it’s not exactly a grudge.” Bella replied, “It’s just that William Lane likes you too much. I need to make you disappear and make him forget about you.”<br/><br/>Amelia frowned, her bound hands moved behind her back. The ropes were tied too tight, causing her wrists to hurt and her palms to sweat from nervousness. She looked out the car window: “Where are you taking me?”<br/><br/>“To the moat.” Bella said, “By the time you’re discovered, you’ll be just another corpse at the bottom of the river.”<br/><br/>Amelia didn’t know how Bella could say such a thing with such nonchalance.<br/><br/>But she didn’t have the time to worry about others now.<br/><br/>She didn’t want to die; she needed to figure out a way to save herself.<br/><br/>Bella quickly saw through Amelia’s intentions and laughed lightly: “Don’t bother. You? You’re nothing without that pretty face. I don’t know why William Lane fell for you, let alone so obsessively.”<br/><br/><br/><br/>Amelia glared at her, her hands constantly twisting behind her, trying to break free from the ropes.<br/><br/>“Do you know why I’d rather kill you than advise you to leave him?” Bella asked.<br/><br/>Amelia ignored her.<br/><br/>Bella continued, “Because if you disappear, William Lane will forget about you sooner. And you... I don’t think you’d listen to advice and give up on William Lane. After all, with his background, you’d never let him go if you got ahold of him.”<br/><br/>Blood started to seep from Amelia’s wrists as the ropes chafed against her skin: “Even without me, William Lane would never like you. Do you think you can do this so covertly that no one will find out? It’s a joke, a self-righteous one. The position of the Lane family’s young madam might not fall to me, but it will never be you, either.”<br/><br/>Bella sneered and sped up the car.<br/><br/>With the sudden acceleration, Amelia lost her balance, and her head bumped against the car window...<br/><br/>She looked at the cars falling behind outside and leaned against the window without moving any further.<br/><br/>Her cell phone wasn’t with her, and this woman seemed to have made thorough preparations.<br/><br/>Amelia didn’t even know if they were aware she had been kidnapped.<br/><br/>The moat was outside the Imperial Capital, and at this speed, it wouldn’t take long to get there.<br/><br/>Due to her anxiety and fear of death, Amelia’s legs were trembling, her heartbeat was racing, and it felt like the air had become thinner.<br/><br/>Her nerves were stretched tight, and she was utterly exhausted.<br/><br/>She closed her eyes, trying to calm down and find a way out, but all she could think of was William Lane.<br/><br/>She thought about being independent and not depending on William Lane every day.<br/><br/>She wanted to maintain some dignity in this relationship with such a vast gap between them.<br/><br/>But in the end, whenever she encountered a crisis, William Lane was always the one who appeared by her side.<br/><br/>Whenever she faced any difficulty, all she could think of was him.<br/><br/>From the moment she changed her name, she had been relying on William Lane.<br/><br/>She tried to stay rational, fearing the day he would leave her, but she couldn’t control herself and greedily fell deeper into this relationship.\t\t\t\t\t\t</div>", "images": {}, "success": true}