{"id": 659, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15223146.html", "title": "Chapter 656 - 657: Side Story Thirty-Four: Ink-Dot Plum Fragrance (Thirty-Two)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 656 - 657: Side Story Thirty-Four: Ink-Dot Plum Fragrance (Thirty-Two)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 657: Side Story Thirty-Four: Ink-Dot Plum Fragrance (Thirty-Two)<br/><br/>It was not until the next morning that Sofia Smith awoke.<br/><br/>After waking up, her spirits were not very good. The main reason was her low mood, speaking little, and eating very little.<br/><br/>Amelia Smith and Eleanor Smith accompanied her for half a day. After eating a little lunch, she went back to sleep.<br/><br/>When she fell asleep, Amelia Smith and Eleanor Smith left the ward and went outside.<br/><br/>“What should we do?” Eleanor Smith asked, “Big sister has never been like this before.”<br/><br/>Amelia Smith remained silent without speaking.<br/><br/>The two sisters spoke outside for a while, and Amelia Smith said, “Second sister, you and brother-in-law still have to work, so go back tomorrow.”<br/><br/>“You don’t have time either,” Eleanor Smith replied, “It’s okay for both of us to take two days off from work.”<br/><br/>“Roy Madison has hired a caregiver who will take care of Big Sister’s diet and daily life, and he will come this afternoon,” Amelia Smith said.<br/><br/>Eleanor Smith nodded and patted Amelia’s shoulder, “Amelia, this man is really good, very attentive.”<br/><br/><br/><br/>Amelia Smith just smiled.<br/><br/>The two sisters chatted about Sofia’s condition outside for a while and then returned to the ward to accompany their big sister.<br/><br/>In the afternoon, when the caregiver came, Sofia Smith asked Amelia Smith and Eleanor Smith to go to the Turner house to collect some of her documents.<br/><br/>Roy Madison had left the night before, leaving James Lane behind.<br/><br/>So Amelia Smith asked James Lane to give them a ride.<br/><br/>Wherever Amelia Smith said they would go, James Lane would unhesitatingly take her there, regardless of whether the place was suitable for Amelia to visit.<br/><br/>He was only responsible for obeying orders.<br/><br/>So when Amelia Smith and Eleanor Smith opened the door to the Turner house, they were greeted by a courtyard full of... incapacitated people.<br/><br/>The dozens of bodyguards were all in the courtyard, with bruised noses and swollen faces. Each person’s mouth had been gagged, and their hands had been disabled, hanging limply by their sides.<br/><br/>Several men in black suits stood at the entrance of the courtyard, all of them guards from the Lane family.<br/><br/>Amelia Smith and Eleanor Smith were both taken aback.<br/><br/>Amelia Smith stared at the courtyard full of people for a while before asking, “What’s going on?”<br/><br/>James Lane closed the door and said calmly, “Young Master said they had hurt Madam’s hand, so he had broken all of their hands.”<br/><br/><br/><br/>“Oh.” Adam said casually, “You mean her miscarriage. She’s already been to the hospital, and the doctor said it’s nothing serious. Where is she? Why isn’t she home, and why are we all trapped here?”<br/><br/>Eleanor couldn’t believe her ears and stared at Adam in shock.<br/><br/>Amelia’s eyelashes trembled a few times, and she asked, “What do you mean, it’s nothing serious? She was in the hospital for a day and a night, just waking up this morning. She’s your wife, is this how you treat her?”<br/><br/>“Is it that serious?” Adam said, “It’s just a lost child, right? How could her body be so weak....”<br/><br/>“Go to hell!” Eleanor charged forward and slapped him, then grabbed his hair, pulling it down viciously.<br/><br/>The force of her blow also jolted James, who was standing between them.<br/><br/>Adam was in pain, yelping, “Mom! Mom! Mom! It hurts!”<br/><br/>Seeing her son being beaten, Mrs. Turner immediately rushed forward to hit Eleanor, “You little bitch! How dare you touch my son, I’ll kill you!”<br/><br/>But just as she lifted her hands, one was held by James and the other by Amelia.<br/><br/>James looked to Amelia.<br/><br/>Amelia let go.<br/><br/><br/><br/>With a single powerful move, James threw Mrs. Turner to the side.<br/><br/>Amelia also pulled Eleanor away.<br/><br/>Adam covered his head and quickly retreated, while Mrs. Turner wanted to rush forward and hit Eleanor again, but seeing her son released she went to hold him instead, “Son, does it hurt? Does It hurt?”<br/><br/>Eleanor still held a clump of hair in her hand, forcefully threw it towards Adam and said, “Stinking man! How dare you say you’re in pain? My sister was in much more pain in the hospital! How did I never notice before how lame you are! Spit! You worthless dog, you’re just wasting air!”<br/><br/>“That’s enough, Second Sister Davis,” Amelia pulled her, “Don’t stoop to their level.”<br/><br/>“My sister was really blind to have spent so many years with you.” Eleanor continued to curse, “What a useless thing! Waste! Trash!”<br/><br/>“Do you think we, the Turner Family, wanted her?” Mrs. Turner cursed back, “Other than that captivating face, what else does she know how to do? If not for Max Smith selling her to us, we wouldn’t have wanted her! She can’t even give birth to a child! We don’t even know where the money she has came from. We don’t even know if the miscarried child was from our Turner Family!”<br/><br/>“I’m gonna...” Eleanor paced around the living room, eventually picked up a flower pot from the corner and threw it at them.<br/><br/>The vase shattered with a loud crash, and the soil inside fell out.<br/><br/>Mrs. Turner ducked with Adam, narrowly avoiding being hit.<br/><br/>“I’ll kill you!” Eleanor still wanted to hit them.<br/><br/>Amelia held her back, “Second sister, let it go.”<br/><br/>At that moment, Harris Richie, who had been watching from the side, suddenly laughed.<br/><br/><br/><br/>His laughter was still as carefree and relaxed as ever, as if everyone had just performed a family drama for his amusement.\t\t\t\t\t\t</div>", "images": {}, "success": true}