{"id": 650, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15193671.html", "title": "Chapter 647 - 648: Side Story Twenty-Five: Ink-Dot Plum Fragrance (23)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 647 - 648: Side Story Twenty-Five: Ink-Dot Plum Fragrance (23)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 648: Side Story Twenty-Five: Ink-Dot Plum Fragrance (23)<br/><br/>Andrew Lane looked kindly at her, but there was some stiffness in his kindly expression.<br/><br/>This was also his first time meeting his daughter-in-law, and he was quite nervous, unlike when he met his son-in-law and only wanted to hit him.<br/><br/>Sophie Ortiz had been getting along with Amelia Smith for two years and always liked her, naturally happy to see her.<br/><br/>She grabbed Amelia’s hand and smiled, “Amelia, don’t be nervous, we just heard you were injured and came to see you.”<br/><br/>“Ah, yes, yes, don’t be nervous, don’t be nervous.” Andrew Lane kindly echoed.<br/><br/>Amelia’s pupils couldn’t help but widen. Why did they come here directly to see her? Did they know she was living here? And what about her relationship with Roy Madison...<br/><br/>“You asked for leave from the Dance Association, and it was Roy and I who asked.” Sophie Ortiz explained.<br/><br/>Amelia suddenly realized. That’s right, her leave could only have been requested by Roy Madison. It had been so many days, she hadn’t even thought about this issue.<br/><br/>“I, I...”<br/><br/>Sophie Ortiz pulled her towards the sofa: “We originally wanted to visit you in the hospital, but Roy said it wouldn’t be good for your recovery and wouldn’t let us go.”<br/><br/><br/><br/>Amelia stiffly followed Sophie to the sofa and sat down with her.<br/><br/>Another thunderbolt hit her head.<br/><br/>What?!<br/><br/>Is this how Roy Madison explained things to his family?!<br/><br/>What kind of image has he created for her in his home?!<br/><br/>“No, it’s not like that.” Amelia managed to make a well-behaved smile, “My brother was just joking. It was just a minor injury, and I’m sorry to have made Teacher Ortiz and Chief Lane worry.”<br/><br/>Upon hearing Amelia’s address to Roy Madison, Sophie raised her eyebrows slightly, “Call us uncle and aunt. Why are you being so polite?”<br/><br/>“Uncle, aunt.” Amelia obediently corrected herself.<br/><br/>Andrew Lane immediately responded.<br/><br/>Sophie grabbed her hand, “How’s your recovery? Roy said it was a concussion, you must be very careful with this and not neglect it. I was saying that you should stay in the hospital for a few more days, but you came back in just two days. Roy is really unreliable.”<br/><br/>“Teacher Ortiz... no, Aunt. The doctor said it was fine and that I could be discharged. That’s why we came back.” Amelia paused, then suddenly remembered something, “Uncle, aunt, what would you like to drink?”<br/><br/>Sophie held her shoulder and didn’t let her move, “No need to drink anything. You are still injured, just rest.”<br/><br/>“It’s okay, it’s already much better.” Amelia insisted, “I can go back to the Dance Association in a couple of days.”<br/><br/>“No need to rush.” Sophie held her right hand and carefully looked at the gauze wrapped around her arm, “You’ve been working without a break for the past two years, so just take advantage of these few days to rest.”<br/><br/>Amelia nodded in agreement.<br/><br/><br/><br/>“Do you have anything to take?” Sophie asked.<br/><br/>“No,” Amelia replied.<br/><br/>Sophie picked up the book Amelia had placed on the tea table and handed it to Andrew: “Take this book, so you don’t lose your place. There are many books at home, and you can read them whenever you want. Grandfather is at home, so if you have any questions, you can ask him.”<br/><br/>Amelia, feeling dizzy, was whisked away by Sophie and Andrew in less than twenty minutes and taken by car back to the Lane Family home.<br/><br/>When William Lane returned home from work, he saw Amelia and Christopher Clark sitting side by side under the flower shelf in the courtyard, each on a small stool, obediently sitting next to Old Master Lane while he lectured them.<br/><br/>William Lane was initially worried but decided to stand at a distance and watch for a while without intervening.<br/><br/>It wasn’t until a mosquito flew by his ear that he made his way over and called out to Old Master Lane: “Grandfather.”<br/><br/><br/><br/>Wearing reading glasses, Old Master Lane looked up at William upon hearing his voice and said, “Back already?”<br/><br/>“Yes,” William replied.<br/><br/>Seeing William, Amelia’s expression turned to that of someone who had just spotted their savior.<br/><br/>“Uncle,” Christopher Clark called out.<br/><br/>William first smiled at Amelia before turning to Christopher: “How did you end up here by yourself?”<br/><br/>Christopher replied, “I came from the Court Music Academy to visit my grandparents and great-grandfather. Auntie is helping me with my summer vacation homework.”<br/><br/>Amelia’s face turned red, and she glanced at William.<br/><br/>“Auntie? Fine, but what’s the meaning of ‘Little Auntie’?” William asked while pouring a cup of tea for Old Master Lane.<br/><br/>“It’s because Little Auntie is younger,” Christopher responded, “She’s less than ten years older than me.”<br/><br/>Old Master Lane sipped his tea, laughing gently.<br/><br/>Grinding his teeth, William said, “Did you get bored of ticking people off at home, so you came here to do the same?”<br/><br/>Christopher leaned into Old Master Lane and laughed.<br/><br/>Old Master Lane patted his face gently.<br/><br/><br/><br/>Amelia couldn’t help but laugh along with them.<br/><br/>William walked up behind her, pressing down on her head, “You’re laughing too.”<br/><br/>Amelia threw him a stealthy warning glance to stop being so hands-on in front of the elder family members.<br/><br/>“What? You’re being overbearing now, not allowing her to laugh?” Old Master Lane asked.<br/><br/>William let go of her head, sat down next to Amelia, feigning sadness, “Understood, I have no place in this home.”<br/><br/>Old Master Lane nodded gravely and said, “Yes, you have a clear understanding of yourself.”<br/><br/>Amelia and Christopher both burst into laughter.\t\t\t\t\t\t</div>", "images": {}, "success": true}