{"id": 656, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15209147.html", "title": "Chapter 653 - 654: Side Story Thirty-One: Ink-Dot Plum Fragrance (Twenty-Nine)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 653 - 654: Side Story Thirty-One: Ink-Dot Plum Fragrance (Twenty-Nine)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 654: Side Story Thirty-One: Ink-Dot Plum Fragrance (Twenty-Nine)<br/><br/>The Turner family lives in a village on the edge of Wakefield County, a twenty-minute drive away.<br/><br/>Christopher Willow is driving. As soon as they reach the entrance to their house, they stop the car,<br/><br/>The road at the entrance of the Turner house is full of cars, so they had to park at the intersection and walk to their home.<br/><br/>The Turner residence is a two-story Western-style building.<br/><br/>Once at the entrance, Eleanor Smith started knocking hard on the door.<br/><br/>Christopher Willow, not wanting her to hurt her hand, caught her hand and took over the task of knocking on the painted door for her.<br/><br/>Nearly two minutes later, the door was finally opened from inside.<br/><br/>It was Mrs. Turner who opened the door.<br/><br/>This woman, in her fifties, is somewhat overweight. Her hair is very black, her face has some wrinkles, she wears a gold necklace around her neck, and there is a gold bracelet on her wrist.<br/><br/>As soon as the door opened, the first thing Amelia Smith saw was this woman, and then she noticed the people in the courtyard.<br/><br/><br/><br/>There were three square tables in the courtyard, with about a dozen men seated. They were simply dressed, but by their physiques, they appeared to be bodyguards or some sort of muscle.<br/><br/>“Where is my sister!” Eleanor Smith yelled.<br/><br/>“You little girl, no respect for your elders! What are you yelling about!” Mrs. Turner replied.<br/><br/>Amelia Smith walked in directly, but Mrs. Turner immediately stopped her: “What are you doing?”<br/><br/>Amelia Smith looked at her, at the woman in front of her. This woman was full of malice and spite before, but now her face is full of redness, her eyes filled with endless conceit: “Can’t I come to my sister’s house?”<br/><br/>“When was this your sister’s house?” Mrs. Turner mocked.<br/><br/>“This house was built after my sister got married, this land was bought with my sister’s own money. For this house, my sister not only paid money but also worked hard.” Amelia Smith said coldly, “Why isn’t it my sister’s house?”<br/><br/>“Your sister bought it with her own money? Where did she get the money?” Mrs. Turner questioned, “She was bought by our family, where does she get money!”<br/><br/>“You’re talking nonsense!” Eleanor Smith swore.<br/><br/>Mrs. Turner ignored her and arrogantly said: “She’s been married for so many years and can’t even give birth to a child. Such a waste.”<br/><br/>“You’re going too far.” Eleanor Smith rushed forward as if to hit her, but Christopher Willow pulled her back.<br/><br/>Amelia Smith’s eyes became cold, she pushed Mrs. Turner aside with one hand and walked inside.<br/><br/>Mrs. Turner staggered to the side after being pushed by her. Christopher Willow held her in time, preventing her from falling down.<br/><br/>“Little bitch! Who told you to come in! It’s my house, can you come in if I don’t let you!” Mrs. Turner yelled, shaking off Christopher Willow’s hand.<br/><br/>She wanted to go into the courtyard but was pulled aside by Christopher Willow.<br/><br/>As soon as Amelia Smith stepped into the courtyard, all the men in the courtyard stood up at once and stared at her.<br/><br/>Amelia Smith glanced at them and continued to walk in.<br/><br/>About a dozen men came over and blocked her path.<br/><br/>Christopher Willow and Eleanor Smith hurried into the courtyard, standing in front of her for fear that she would be bullied.<br/><br/><br/><br/>Mrs. Turner quickly followed and stood across from them, pointing at them and saying: “Go ahead, come in. I’d like to see how you’re going to do it.”<br/><br/><br/><br/>“You damn bitch...” Eleanor Smith felt her heart tearing.<br/><br/>Christopher Willow timely held her back and covered her mouth.<br/><br/>Richie glanced at Eleanor Smith, her twisted psychology more excited. She suddenly laughed, laughed so happily, and laughed so casually: “Actually, she could have been well taken care of in the hospital. It was because you guys went there to make trouble, so... I had to bring her back. She is sleeping upstairs, you guys are causing such a big commotion, she hasn’t woken up.”<br/><br/>Eleanor Smith’s mouth was covered, and tears kept falling. Because she couldn’t speak, in the end, she bit Christopher Willow in the mouth.<br/><br/>Christopher Willow saw through the woman before his eyes, who was ruthless and even regarded other people’s lives as nothing, lawless.<br/><br/>This present situation is very unfavorable to them.<br/><br/>He was worried about Eleanor Smith, so he had to cover her mouth to prevent Richie from venting his anger on Eleanor Smith.<br/><br/>But while he held back Eleanor Smith, he forgot about Amelia Smith who had always been more stable than Eleanor.<br/><br/>Amelia Smith raised her hand and slapped Richie’s face.<br/><br/>Before Richie had reacted, Amelia caught her hair again, fiercely pulled her over, and choked her neck.<br/><br/><br/><br/>Richie was frightened and immediately held Amelia’s hand with both hands.<br/><br/>But Amelia Smith was crazier than her, the moment her hand held her neck, she used all her strength, wanted to kill her.<br/><br/>Mrs. Turner was scared and screamed.<br/><br/>A dozen bodyguards immediately surrounded them. The first reaction of Christopher Willow and Eleanor Smith was to protect Amelia Smith.<br/><br/>But facing a group of trained professional bodyguards, the two were quickly restrained.<br/><br/>Amelia Smith’s hand was pried open, Richie was rescued, holding her neck and looking at Amelia Smith, husked: “Beat her.”<br/><br/>“Amelia! Don’t touch her! Don’t touch her!” Eleanor Smith shouted.<br/><br/>Amelia Smith was surrounded, hit someone. Her hand was grabbed and twisted behind her. Another person pinched her face, causing her face to hurt.<br/><br/>She struggled once but couldn’t get away. When she wanted to struggle again, the person behind her suddenly let her go.<br/><br/>But the hand was quickly grabbed again.<br/><br/>She immediately turned around to hit someone, but her wrist was grabbed again.<br/><br/>William Lane looked at her flushed eyes and the red mark pinched on her fair little face.<br/><br/>“Brother?” Amelia Smith was stunned when she saw the person, then immediately plunged into William Lane’s arms, “Brother!”<br/><br/>William Lane held her, stroked her hair, and couldn’t utter a word out of heartache.<br/><br/>As it happens, his business trip was in the city center of this place. When Lila Campbell told him, he immediately rushed over and met Lila Campbell’s people at the entrance of the village.<br/><br/>His people and Lila Campbell’s people came in and rescued Christopher Willow and Eleanor Smith, and then directly pressed all the people in the courtyard to the ground, including Mrs. Turner and Richie.<br/><br/>Mrs. Turner kept screaming and was directly gagged.<br/><br/>When Amelia Smith saw William Lane, her fortitude collapsed and she sobbed, “My sister, my sister.”<br/><br/>“What?” William Lane didn’t hear her clearly.<br/><br/>“My elder sister, she, she...is upstairs. She...just had surgery.” Amelia Smith cried and said, “Save her, save her first.”<br/><br/>“Good, good.” William Lane’s eyes were cold enough to kill. He shouted, “James Lane, Sofia Smith is upstairs. Go upstairs and call for an ambulance.”<br/><br/>“Yes.”\t\t\t\t\t\t</div>", "images": {}, "success": true}