{"id": 651, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15199201.html", "title": "Chapter 648 - 649: Side Story 26: Ink-Dot Plum Fragrance (24)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 648 - 649: Side Story 26: Ink-Dot Plum Fragrance (24)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 649: Side Story 26: Ink-Dot Plum Fragrance (24)<br/><br/>“How come you’re back so soon?” Sophie Ortiz asked when she saw William Lane.<br/><br/>“I came back right after work.” William Lane brought some fruit to Amelia Smith, then turned to Sophie Ortiz and said, “You wish I’d come home to find no one around?”<br/><br/>Sophie Ortiz narrowed her eyes as her maternal patience was wearing thin.<br/><br/>William Lane quickly changed his tone, “It was James who told me. But... he only told me after I got off work. So, you all ganged up to trick me. And you too.”<br/><br/>William Lane looked at Amelia Smith.<br/><br/>Sophie Ortiz unceremoniously smacked William Lane on the head, “What’s the matter? Picking on people? How did we trick you? Say it if you dare.”<br/><br/>“Mom,” William Lane looked at Sophie Ortiz, “I’m all grown up now, and you still hit me on the head.”<br/><br/>“How old are you? You are over thirty.” Sophie Ortiz said, “I have to remind you of this.”<br/><br/>William Lane: “......”<br/><br/>Amelia Smith was holding her laughter on the side.<br/><br/><br/><br/>“Amelia, if he bullies you, just call me.” Sophie Ortiz looked at Amelia Smith, her tone turned gentle, “I’m going to help Aunt Cruz with cooking.”<br/><br/>“Aunt, I’ll help you.” Amelia Smith stood up.<br/><br/>“No need.” Sophie Ortiz said, “Your hand is still injured, Rest well. We have plenty of people at home, I just want to join the fun.”<br/><br/>After Sophie Ortiz left, William Lane gave Amelia Smith a kiss.<br/><br/>Amelia Smith quickly looked around. The living room was full of servants, but luckily no one was looking at them. She whispered, “What are you doing? Restrain yourself, there are people around.”<br/><br/>William Lane smiled and ruffled her hair, “Miss Amelia, enjoying yourself, huh?”<br/><br/>“Yes.” Amelia Smith said, “Grandpa and the uncles and aunts are all very kind to me.”<br/><br/>“Yeah, my status is falling drastically.” William Lane laughed, “I didn’t know my status in the family could be such low.”<br/><br/>“That’s because they love you, that’s why they are so kind to me.”<br/><br/>William Lane pinched her face, “It’s because you’re good, you’re outstanding, they like you.”<br/><br/>Amelia Smith loved the family atmosphere of the Lane family, it was something she had never experienced before and had fantasized about countless times.<br/><br/>In the evening, Amelia Smith and William Lane stayed at the Lane’s home.<br/><br/>When she went back to her room to take a bath, William Lane went with Old Master Lane to his room.<br/><br/><br/><br/>For the next few days, she remained calm and did not confront anyone who was making ill-bred remarks.<br/><br/>Until... she figured out who was leading the rumors and who they were following.<br/><br/>Amelia Smith pulled that person from the practice room to the bathroom in front of more than a dozen people.<br/><br/>They were both in the restroom for twenty minutes, when they came out, the other girl didn’t look any different on the outside, but she was crying.<br/><br/>And she was clearly afraid of Amelia Smith.<br/><br/>Also, when someone asked her if Amelia Smith had beaten her, she adamantly denied it.<br/><br/>Afterwards, this girl was good in front of Amelia Smith.<br/><br/>No one knew what had happened.<br/><br/>But they knew that after that, the distasteful words disappeared — at least no one dared to say them openly anymore.<br/><br/>Sophie Ortiz was curious and asked Amelia Smith what had happened in the bathroom.<br/><br/>In front of them, Amelia Smith was still obedient and soft-spoken and looked easy to bully. But she actually answered honestly, “I beat her up.”<br/><br/><br/><br/>At that time, William Lane, Lila, Harton Clark, and Amelie Quentin were all at home. Upon hearing her answer, they all looked at her simultaneously.<br/><br/>Amelia Smith held a cup of hot water in her hand, and spoke softly, “I did some research beforehand on where to hit her that would hurt but not physically harm her too much, and also scare her.”<br/><br/>The entire living room was silent.<br/><br/>Amelia Smith continued, “I also observed her personality and knew how to scare her most effectively. We’re just young girls, very easy to scare.”<br/><br/>William Lane chuckled.<br/><br/>Lila also smirked.<br/><br/>Amelie Quentin picked up a cup from the coffee table and clinked it against Amelia Smith’s, “Sister-in-law, cheers. So that’s your style. Your appearance doesn’t match your personality. I even thought I’d scare you if I spoke too loudly. Turns out my sister-in-law is also a veteran of the world.”<br/><br/>Amelia Smith laughed uncomfortably.<br/><br/>Sophie Ortiz gently patted Amelie Quentin on the head, “What a bunch of nonsense.”<br/><br/>Amelie Quentin pouted.<br/><br/>Andrew Lane said, “This is good. It prevents her from being bullied outside.”<br/><br/>“Right.” Sophie Ortiz agreed, “You can’t stand anyone’s bullying, just do your thing, and have your family back you up. If anything comes up, let William handle it.”<br/><br/>Amelia Smith’s heart warmed.<br/><br/><br/><br/>William Lane: “......” He couldn’t even remember the last time his mother called him “William.”\t\t\t\t\t\t</div>", "images": {}, "success": true}