{"id": 654, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15199205.html", "title": "Chapter 651 - 652: Side Story 29: Ink-Dot Plum Fragrance (27)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 651 - 652: Side Story 29: Ink-Dot Plum Fragrance (27)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 652: Side Story 29: Ink-Dot Plum Fragrance (27)<br/><br/>Amelia Smith didn’t have dinner and slept until the next day, after nine in the morning.<br/><br/>When she opened her eyes, she looked at her bright room, and her head was spinning. She didn’t know what year it was or what time it was.<br/><br/>Who is she, and where is she?<br/><br/>It took a while for her consciousness to catch up, and then she felt the chill on her leg.<br/><br/>Amelia suddenly sat up and saw William Lane sitting at the foot of the bed with his head down, then she fell back into the bed: “Ah.”<br/><br/>William heard her sigh and walked over to the head of the bed, putting the ointment and cotton swabs on the bedside table and sat on the bed. He pulled Amelia’s face out of the pillow, “What’s wrong?”<br/><br/>“My back hurts.” Amelia said, looking pitiful.<br/><br/>William’s hand reached into the blanket to massage her waist: “It’s so thin. I didn’t dare apply much force yesterday.”<br/><br/>Amelia couldn’t believe what she heard and stared at him in shock. After a moment of silence, she asked, trembling, “Say that again. Are you blaming me? Is it my fault? Did you use less force?”<br/><br/>William leaned down and kissed her, “My fault, all my fault. Don’t be mad.”<br/><br/><br/><br/>Amelia felt wronged.<br/><br/>William whispered gently, “I’ll be more gentle next time.”<br/><br/>“Really?”<br/><br/>William: “... I’ll try my best.”<br/><br/>Amelia turned her head away and ignored him. After a while, she asked, “What were you doing just now?”<br/><br/>“Applying the medicine.”<br/><br/>“What medicine?”<br/><br/>William massaged her waist slowly, “Medicine to reduce bruising. It will make the marks on your skin fade faster.”<br/><br/>“... Oh.”<br/><br/>“Are you hungry?” asked William.<br/><br/>“I don’t know.” Amelia laid on the bed and sunk her head back into the pillow, mumbling, “I can’t feel anything.”<br/><br/>“Don’t sleep anymore, eat something, and then sleep.” William propped up her face.<br/><br/>“Did you ask for leave for me?” Amelia asked.<br/><br/>“I asked for leave the day before yesterday,” William replied, “for three days.”<br/><br/>Amelia opened her eyes and looked at him, thinking she was giving him a fierce look: “Hmph!”<br/><br/><br/><br/>Amelia shook her head, “You be careful and come back soon.”<br/><br/>William sighed reluctantly, “Okay.”<br/><br/>Since Amelia lived in the old mansion, someone from the old mansion would pick her up and drop her off at the Dance Association and school with Sophie Ortiz.<br/><br/>So, William temporarily took James Lane away to deal with business matters in other places.<br/><br/>On the first night that Amelia slept alone at home, she could not fall asleep.<br/><br/>No matter how she tossed and turned, she couldn’t sleep.<br/><br/>It wasn’t until 2 AM that she fell asleep, but she woke up again, shortly before six o’clock. After washing and rinsing, Amelia accompanied the already awake Old Master Lane for a walk in the courtyard.<br/><br/>Then, Amelia had breakfast and went to the Dance Association with Sophie Ortiz.<br/><br/><br/><br/>There was a small performance, and Sophie wanted Amelia to join her.<br/><br/>Amelia hadn’t been on stage for a long time due to various reasons and had mainly been practicing.<br/><br/>This time, they were going to perform a repertoire they had rehearsed before.<br/><br/>Amelia had rehearsed with them but hadn’t been on stage with them.<br/><br/>When Sophie asked her this time, Amelia readily agreed.<br/><br/>But, as soon as she agreed, within ten minutes, Amelia received a phone call from her second sister.<br/><br/>The sisters stayed in touch regularly, but they rarely called each other.<br/><br/>So when Amelia saw her number at this time, she had a bad feeling.<br/><br/>Once she answered the call, Eleanor Smith cried, “Amelia, our eldest sister is in the hospital. She... I... I went to the hospital, and her in-laws wouldn’t let me see her. I can’t contact her either. I... I called the police, but they treated it as a family dispute and left shortly after.”<br/><br/>It took Amelia a moment to recover from the shock, leaning against a wall, “Which... which hospital is she in?”<br/><br/>“In... in that private hospital in Wakefield County,” Eleanor said through her tears, “I don’t know what to do? I don’t know how she is right now. But she... she’s in the maternity department. But... but she never told us anything.”<br/><br/>“Don’t worry, don’t worry. I’ll be right there,” Amelia said, while walking out of the house.<br/><br/>She hailed a taxi at the entrance, reported the destination, and left.<br/><br/><br/><br/>It wasn’t until ten to fifteen minutes after hanging up the phone that Amelia came to her senses, remembering to ask for leave from Sophie and telling her she had something going on, so she might need to ask for a few days off and wouldn’t be able to participate in the performance.<br/><br/>Sophie immediately gave her leave and was concerned about her, asking what had happened.<br/><br/>Amelia didn’t know the situation over there, so she just told Sophie that it had something to do with her family.<br/><br/>Sophie told Amelia to inform her if anything happened.<br/><br/>Amelia agreed. After hanging up the phone, she called the school to ask for leave as well.\t\t\t\t\t\t</div>", "images": {}, "success": true}