{"id": 655, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15209145.html", "title": "Chapter 652 - 653: Side Story Thirty: Ink-Dot Plum Fragrance (Twenty-Eight)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 652 - 653: Side Story Thirty: Ink-Dot Plum Fragrance (Twenty-Eight)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 653: Side Story Thirty: Ink-Dot Plum Fragrance (Twenty-Eight)<br/><br/>It takes over three hours to get from Imperial Capital to Wakefield County.<br/><br/>Amelia Smith went directly to the private hospital, got out of the car, and made a phone call to Eleanor Smith while walking in.<br/><br/>Just arriving at the great hall, the call hadn’t gone through yet, when Eleanor Smith saw her and rushed over.<br/><br/>Amelia Smith’s arm was grabbed, and she turned to see Eleanor Smith, with her eyes swollen from crying, “Second Sister.”<br/><br/>“Amelia...” Eleanor Smith burst into tears again upon seeing her and couldn’t speak.<br/><br/>A man behind her came running over a bit slower, and handed her a tissue, “Alright, stop crying.”<br/><br/>Amelia Smith looked at the man, “Brother-in-law.”<br/><br/>“Amelia,” Christopher Willow supported Eleanor Smith’s arm, leading her to the maternity inpatient department. “Let’s walk and talk.”<br/><br/>Amelia Smith, holding Eleanor Smith’s hand, asked, “Brother-in-law, what happened?”<br/><br/>“We don’t know the specifics,” Christopher said, “This morning, Eleanor received a call from Lily. Her voice was very weak, and she said she couldn’t keep the baby and asked Eleanor to come to this hospital quickly. But after she said that, she hung up, and when we tried to call back, her phone was off.”<br/><br/><br/><br/>Eleanor Smith tightly clutched Amelia Smith’s arm, too anxious and tearful to speak, so Christopher Willow told Amelia Smith instead.<br/><br/>“Since we couldn’t reach her by phone, Eleanor and I drove here right away. After we inquired at the reception, Lily was not at this hospital. Thinking that they might have gone to another hospital, we were about to leave when we saw her in-laws.” Christopher said, “Eleanor didn’t let me call out to them, she just followed them to the maternity ward.”<br/><br/>“And then?” Amelia Smith asked.<br/><br/>“There were many people in the corridor of the ward, and as her in-laws saw us, they started shouting, then suddenly many people surrounded us and prevented us from approaching,” Christopher Willow, a gentle man, always spoke slowly, even in such tense moments, his speech still wasn’t fast.<br/><br/>“Where did all these people come from? Are they bandits?” Amelia Smith said.<br/><br/>“Yes,” Christopher replied, “We caused a commotion outside the ward, but they were in greater numbers and we were quickly blocked off. Eleanor called the police right away.”<br/><br/>“But in the end, the matter was treated as a family dispute.” Eleanor Smith sobbed, “They simply mediated a little and then left. They also determined that the second floor was a trivial family matter. No matter how much I tried to explain, they didn’t listen and thought I was making a fuss. Amelia, what should we do?”<br/><br/>Amelia Smith held her hand, “Don’t panic, let’s first assess the situation.”<br/><br/>The three of them went to the inpatient department, and Amelia Smith asked, “When did she get pregnant? Why won’t her in-laws let us see her?”<br/><br/>“How could she say anything with her personality? She bears all the bad things on her own.” Eleanor Smith said, “Ever since that child didn’t make it, Lily hasn’t been pregnant, and her in-laws have always treated us like we owed them. I’m afraid they have some shady intentions.”<br/><br/>“Not letting us see Lily... The Turner family does not have the ability to find so many people,” Amelia Smith said, “They also don’t have that much money to make the hospital go to such lengths.”<br/><br/><br/><br/>Amelia Smith took a breath, wiped her eyes, and took out her cell phone: “I’ll try to find someone to help.”<br/><br/>“Who are you looking for?” Eleanor Smith asked, “Their background is not small, and the people inside the hospital have been bought. We don’t have money or power. The world always bullies honest people.”<br/><br/><br/><br/>Amelia Smith didn’t speak but turned around to make a phone call. She waited for a while and said, “Lila, did I bother you?”<br/><br/>Charlotte Lane was in the laboratory and immediately realized that something was wrong with Amelia’s voice. She quickly explained the experiment to Adam Turner and went out to answer the call: “What happened? Is something wrong?”<br/><br/>Amelia Smith quickly briefed Charlotte Lane on the situation: “William Lane is on a business trip. I can only trouble you. Can you help?”<br/><br/>“It’s not a trouble.” Charlotte Lane replied simply, “Give me your current location. Send me your sister’s cell phone number. And which floor your sister was staying in the inpatient department.”<br/><br/>“Alright.”<br/><br/>After Amelia Smith told her, Charlotte Lane didn’t hang up, she just said to wait for a moment.<br/><br/>In less than a minute, she heard the sound of typing on the keyboard from the phone, and Charlotte Lane’s voice sounded: “Who is with you at the moment.”<br/><br/>“My second sister and brother-in-law are here.” Amelia Smith said.<br/><br/>Eleanor Smith and Christopher Willow were watching her nervously, their eyes asking if there was any solution yet.<br/><br/>Amelia Smith nodded lightly.<br/><br/>“Is there anyone following you at home?” Charlotte Lane asked again.<br/><br/>“I took a taxi here.”<br/><br/>Charlotte Lane: “......”<br/><br/><br/><br/>After a few seconds of silence, Charlotte Lane said: “Found it. Indeed she came to this hospital. She left two hours ago.”<br/><br/>“Gone?” Amelia Smith asked.<br/><br/>“Yes.” Charlotte Lane said, “The cell phone locations of your brother-in-law Adam Turner and his parents show that they are at home. The road surveillance shows that... they should have gone home.”<br/><br/>“They went home.” Amelia Smith told Eleanor Smith and Christopher Willow.<br/><br/>The three quickly walked out.<br/><br/>“Lila, thank you.” Amelia Smith said.<br/><br/>“No need.” Charlotte Lane said, “Don’t be impulsive when you get there, protect yourself. I have some people near Wakefield County, and I’ve already asked them to come, forty minutes.”<br/><br/>“Alright.”\t\t\t\t\t\t</div>", "images": {}, "success": true}