{"id": 657, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15211100.html", "title": "Chapter 654 - 655: Side Story Thirty-Two: Ink-Dot Plum Fragrance (Thirty)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 654 - 655: Side Story Thirty-Two: Ink-Dot Plum Fragrance (Thirty)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 655: Side Story Thirty-Two: Ink-Dot Plum Fragrance (Thirty)<br/><br/>While waiting for the ambulance, Amelia Smith and Eleanor Smith went up to Sofia Smith’s room.<br/><br/>Sofia Smith was lying on the bed, receiving an IV drip, with no color in her face, and her breathing was very weak.<br/><br/>Amelia Smith called out to her a few times, but there was no response.<br/><br/>Eleanor Smith kept vigil by the bed, while Amelia Smith reported her older sister’s condition to William Lane.<br/><br/>William Lane stood outside the door without entering, and after understanding the situation, he made a phone call.<br/><br/>When he came back, he wiped away Amelia Smith’s tears and said, “I’ve contacted the medical team, a helicopter from Imperial Capital will arrive soon, don’t worry.”<br/><br/>Christopher Willow overheard his words and glanced at him.<br/><br/>Amelia Smith nodded, and as her head moved, the tears fell.<br/><br/>William Lane pulled her into his arms, gently stroking her head, “Don’t cry. Are you in pain anywhere? Your face, your hand, your arm? Did they hurt you?”<br/><br/>“No,” Amelia Smith said softly.<br/><br/><br/><br/>“Alright, don’t cry anymore. The ambulance is here,” William Lane said.<br/><br/>...<br/><br/>Arriving at the hospital, Sofia Smith was taken to the emergency rescue room. Within a few minutes, the Imperial Capital’s medical team arrived.<br/><br/>They greeted William Lane and then went inside.<br/><br/>More than an hour later, the rescue room door opened, and Amelia Smith and Eleanor Smith rushed over asking, “How is she?”<br/><br/>“She’s been bleeding a bit because of a miscarriage and the stress of the journey,” the doctor said, “Now the bleeding has stopped, and she’s out of danger.”<br/><br/>“Will this affect future pregnancies?” Eleanor Smith asked.<br/><br/>“Please be assured, proper recuperation won’t cause any problems.” The doctor finished speaking and then looked at William Lane.<br/><br/>William Lane introduced, “This is my wife, and this is her sister.”<br/><br/>“So this is Mrs. Lane.” The doctor said, “Don’t worry, we have professionals for later care, which won’t affect Miss Smith’s health.”<br/><br/>Eleanor Smith suddenly looked at William Lane, her swollen eyes staring at him in surprise.<br/><br/>William Lane saw her looking at him and nodded politely.<br/><br/>But Eleanor Smith didn’t divert her eyes, she kept staring at him.<br/><br/>Amelia Smith was still discussing the details with the doctor, totally unaware of them. Until William Lane pulled at Amelia Smith’s clothes and then Amelia looked at him, “What’s up?”<br/><br/>William Lane looked down at her and gave her a glance.<br/><br/>Amelia Smith didn’t catch on, she squeezed his hand and continued talking with the doctor.<br/><br/><br/><br/>“Hmm.”<br/><br/>William Lane and Christopher Willow walked away.<br/><br/>Amelia Smith returned to her room, and Eleanor Smith looked at her inspectively: “Seems happy.”<br/><br/>“Just trying to keep pace with you and brother-in-law. After all these years, brother-in-law is still so nice to you.” Amelia Smith said.<br/><br/>“Stop talking about me, let’s talk about you.” Eleanor Smith said, “What exactly is his family doing?”<br/><br/>Amelia Smith paused for a while and said: “Sis, you know Old Master Lane, right?”<br/><br/><br/><br/>“Which Old Master Lane?” Eleanor Smith asked.<br/><br/>“The Old Master Lane we used to see on the news when we were young.” After Amelia Smith finished, she whispered a name in her ear, and then said, “This is his grandson.”<br/><br/>“What?!”<br/><br/>“Sis, lower your voice.” Amelia Smith said.<br/><br/>“You ... you ...” Eleanor Smith covered her mouth, she stared at her in shock, “How ... Someway, you guys ended up together?”<br/><br/>Amelia Smith was silent for a while before she said: “Just.. a coincidence, perhaps, it was fate.”<br/><br/>Eleanor Smith had trouble getting over the reality that was in front of her. It took her a while before she grabbed Amelia Smith’s shoulder and shook her, saying, “Amelia, Amelia, I truly never saw it coming. I was already surprised enough when you got married. You despised marriage so much as a child. You gave me the idea that you were the type of person who’d rather be shot than forced to marry.”<br/><br/>Amelia Smith laughed a little and said: “So now I understand Sofia a little.”<br/><br/>Due to family reasons, Amelia Smith hated marriage since she was a child, she would rather be single than start a family.<br/><br/>Likewise, Sofia Smith, had similar thoughts regarding family.<br/><br/>She longed to have a family and wished to have a child.<br/><br/>She was desperate for a serene and blissful family, to compensate for her own deficiencies, she had been painstakingly managing her own family.<br/><br/>But the expected child was never there.<br/><br/><br/><br/>“I have no idea if Sofia will still think the same after all this.” Eleanor Smith said.<br/><br/>“We can’t abandon the life we want because of being victimized by a family of trash.” Amelia Smith said.<br/><br/>The two sisters were silent for a while looking at the person lying on the bed, and Eleanor Smith asked, “Does he treat you well?”<br/><br/>Amelia Smith looked at her and gave a nod.<br/><br/>Eleanor Smith chuckled and said, “Today’s grandeur speaks for itself. What about his family?”<br/><br/>“They’re also very nice.” Amelia Smith said.<br/><br/>Eleanor Smith nodded and said, “Amelia, nor me or your brother-in-law have a lot to offer, our ability to help you is limited. Remember, no matter what, no matter what happens in the future, you’ll always have us. We might not be able to offer you much, but rest assured, we’ll provide you shelter for life, you have a family.”<br/><br/>“Hmm.” Leaning on her shoulder, Amelia Smith said, “Second Sister Davis, I know.”\t\t\t\t\t\t</div>", "images": {}, "success": true}