{"id": 667, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15225835.html", "title": "Chapter 664 - 665: Extra Forty-Two Chen Years: This Child Is So Clingy.", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 664 - 665: Extra Forty-Two Chen Years: This Child Is So Clingy.</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 665: Extra Forty-Two Chen Years: This child is so clingy.<br/><br/>Kevin Clark had no choice but to sit down on a chair nearby.<br/><br/>Since he was small and afraid of hurting Charlotte Lane, he would find a place to sit down and hold her in his arms whenever she wanted him to hold her.<br/><br/>Old Master Lane placed little Lila in his arms. She immediately grabbed onto Kevin’s clothes, lying in his arms, staring at him with big eyes and smiling.<br/><br/>“Lila really likes Arthur,” said Tom Wayne with a smile.<br/><br/>“Yes, she always wants him to hold her when she sees him.” Old Master Lane laughed. “Maybe it’s their destined fate.”<br/><br/>Tom Wayne laughed.<br/><br/>As Kevin listened to their conversation, he looked down at the little thing in his arms: What kind of destined fate was this? A fate destined to babysit?<br/><br/>Thinking about it, Kevin’s mind began to wander.<br/><br/>Just at that moment, the little one in his arms suddenly nibbled on his face.<br/><br/>Old Master Lane, Tom Wayne, and William Lane were all watching, making them witnesses to the scene.<br/><br/><br/><br/>Kevin was startled and shook involuntarily.<br/><br/>Charlotte let go of him, smiling happily and her eyes full of innocence.<br/><br/>As for Kevin... his face covered in drool.<br/><br/>Tom Wayne... watched Kevin’s stunned expression and laughed so hard he couldn’t stand up straight.<br/><br/>Kevin was in a mess in the banquet hall: “......”<br/><br/>Seeing Tom Wayne laugh, Old Master Lane also laughed after a while.<br/><br/>William Lane, however, stared with a darkened face, full of resentment.<br/><br/>Everyone thought Charlotte had given him a peck on the cheek, but only Kevin knew that he had been nibbled on.<br/><br/>To be more precise, she seemed to have sucked on his face. Her small teeth even touched his skin, causing a little pain.<br/><br/>“Elder Brother,” Little Lila called.<br/><br/>William Lane handed Kevin a tissue paper, held Charlotte’s little hand, wiped the saliva from her mouth saying, “This is Uncle, I am your elder brother.”<br/><br/>“Elder Brother,” Little Lila still called.<br/><br/>William Lane: “...Uncle.”<br/><br/>“Elder Brother,” Little Lila insisted.<br/><br/>William Lane: “......”<br/><br/>...<br/><br/>Lila loved to stick to Kevin. Whenever he visited the Lane Family, she would ask him to hold her. Sometimes, he would hold her for a long time.<br/><br/>There were times when Little Lila would fall asleep in his arms.<br/><br/><br/><br/>Charlotte laughed and, after a while, said: “Elder Brother, I want to play on the swing.”<br/><br/>“Alright.” William jumped off the swing and pushed her on it.<br/><br/><br/><br/>Perhaps in response to Charlotte’s call, Arthur North came with his father to the Lane Family that night to deliver some things.<br/><br/>When he arrived, Charlotte was playing with toys upstairs with Aunt Cruz. Upon hearing Arthur’s arrival, she immediately ran downstairs.<br/><br/>“Brother Arthur!” Charlotte started calling from upstairs, then ran all the way down.<br/><br/>Arthur was sitting properly on the sofa, but stood up when he heard her voice.<br/><br/>Then he was pushed back onto the sofa by Charlotte’s hug.<br/><br/>Little Charlotte ran straight into Arthur’s arms and pushed him, who was standing next to the sofa, back into it.<br/><br/>Once Arthur was seated, she clumsily climbed onto his lap and sat in his embrace.<br/><br/>A small flame was burning in William Lane’s eyes.<br/><br/>Adults didn’t think there was anything wrong, used to the two children being close. Sophie Ortiz just reminded: “Charlotte, be careful, don’t hurt your Brother Arthur.”<br/><br/>Charlotte looked up at Arthur, her bright eyes asking if he was hurt.<br/><br/>Arthur, like a little adult, held her shoulder to keep her from falling and said to Sophie Ortiz: “Aunt Sophie, the sofa is soft, it’s okay.”<br/><br/>The adults chatted while the children sat nearby.<br/><br/>Charlotte looked at Arthur and said: “Brother Arthur, you haven’t been here for a long time. I missed you so much.”<br/><br/><br/><br/>William rolled his eyes.<br/><br/>“I’ve been practicing piano music recently, so I’ve been a bit busy.” Arthur said.<br/><br/>“Did you miss me?” Charlotte’s little voice was fragile.<br/><br/>Arthur didn’t say anything for a moment.<br/><br/>He watched as the little girl’s bright eyes lost their luster bit by bit, and the upward curve of her mouth began to sink, then immediately said: “Mhm.”<br/><br/>Charlotte’s heart was filled with light again: “Mhm means you missed me?”<br/><br/>“Mhm.”<br/><br/>Charlotte immediately smiled, rubbed her head against his shoulder, and suddenly said: “Brother Arthur, you smell so good, even better than before.”<br/><br/>“It’s Eaglewood.”<br/><br/>“Eaglewood?” Charlotte asked curiously, then sniffed him again after asking.<br/><br/>“Do you like it?” Arthur had long accepted the little girl who had forcefully stepped into his life, and had been getting used to her presence, used to having her around.<br/><br/>“Mhm.”<br/><br/>“I’ll bring some for you next time.” Arthur said.<br/><br/>“Okay, thank you, Brother Arthur.” Charlotte’s little head leaned back on his shoulder, and she listened to their conversation.\t\t\t\t\t\t</div>", "images": {}, "success": true}