{"id": 666, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15223158.html", "title": "Chapter 663 - 664: Extra Forty-One Chen Years: What'S So Interesting About Children?", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 663 - 664: Extra Forty-One Chen Years: What'S So Interesting About Children?</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 664: Extra Forty-one Chen Years: What’s so interesting about children?<br/><br/>“Arthur, what are you doing? Hurry up, or we’ll be late!” Natalie Wayne called from downstairs.<br/><br/>Six-year-old Kevin Clark, dressed in a suit vest and a white shirt, came downstairs at a leisurely pace.<br/><br/>Elina Clark, who was downstairs, wanted to urge him on, but when she saw his handsome appearance, she couldn’t bring herself to do so.<br/><br/>Among her three sons, the youngest one looked the most like his mother.<br/><br/>Although he’s not a daughter, his appearance always softened her temper when dealing with him.<br/><br/>When they reached the ground floor, Natalie Wayne helped him adjust his clothes: “Today is your niece’s full moon celebration, so we should go early and spend more time with her while there are fewer people.”<br/><br/>Six-year-old Kevin Clark had big eyes, and because of his young age, his tender skin always seemed pink around the corners of his eyes and his lips were rosy.<br/><br/>“Roy Madison’s sister?”<br/><br/>“Yes.” Natalie Wayne rubbed his little face, “Uncle Lane sent a photo, and your niece is so pretty. Don’t you want to see her?”<br/><br/>With an expressionless face, Kevin Clark touched his pinched face and said flatly, “What’s so nice about a child?”<br/><br/><br/><br/>“Children are lovely.”<br/><br/>“No matter how lovely, she won’t be lovelier than Lily Parker.” Kevin Clark said.<br/><br/>Natalie Wayne chuckled, “As expected of a close niece, you know how to protect her.”<br/><br/>“Let’s go.” Elina Clark said, “We’ll really be late if we don’t leave now.”<br/><br/>“Okay.” Natalie Wayne took Kevin Clark to the entryway, helped him put on his coat, and took him and Theo Clark’s family out of the house together.<br/><br/>When they arrived at the Doomsday Hotel, Natalie Wayne said after getting out of the car, “Arthur, hold hands with Hugo today. There will be a lot of people, so don’t get lost.”<br/><br/>Six-year-old Kevin Clark and eight-year-old Hugo Clark looked at each other.<br/><br/>Then, they both simultaneously hid their hands behind their backs.<br/><br/>Natalie Wayne, Calvin Stewart: “.......”<br/><br/>After entering the conference hall, the Clark family went upstairs to see the children first.<br/><br/>After the adults had seen the children and started chatting, the children crowded around the crib to look at the smaller child.<br/><br/>The little girl had very black hair, and her legs were kicking back and forth on the bed, while her arms also moved back and forth.<br/><br/>Her eyes were big and single-lidded, and it seemed like she was curiously looking at a place, yet it was also just a simple stare at a point.<br/><br/>Upon seeing her for the first time, a voice inside Kevin Clark’s head appeared: Tsk, this child...is even prettier than Lily Parker. Gaining an advantage over Roy Madison in something as simple as appearance.<br/><br/>“This is my little sister, Charlotte Lane.” William Lane introduced in an ostentatiously proud tone.<br/><br/><br/><br/>He couldn’t understand Old Master Lane and Andrew Lane’s eagerness to take care of this child.<br/><br/>Neither could he comprehend William Lane’s daily desire to hold his sister, get her bottle, and soothe her to sleep, among other things.<br/><br/>Even more shocking to him was that on the child’s first birthday celebration, she bit him.<br/><br/>At the birthday party that day, Kevin Clark stayed close to his mother.<br/><br/>Natalie Wayne and Elina Clark also stayed with Old Master Lane the entire time.<br/><br/>And Old Master Lane didn’t let Charlotte Lane get more than a meter away from him.<br/><br/>By this time, little Charlotte was almost walking, her hair had grown long, and she had big eyes and rosy lips. Her little milky white face was chubby, making her very beautiful and incredibly adorable.<br/><br/><br/><br/>William Lane was by her side, playing with her using toys, eliciting continuous giggles from her.<br/><br/>However...once Kevin Clark arrived and stood next to her, giving her a glance, Charlotte Lane stopped playing with William Lane, staring at Kevin Clark instead.<br/><br/>“Lila, look here, look here...” William Lane tried using the toy to distract her.<br/><br/>Charlotte Lane glanced at him, humoring him with a little smile before looking back at Kevin Clark.<br/><br/>Kevin Clark could feel her constantly staring at him, afraid she would want him to hold her. After a while, he moved, having Natalie Wayne block his view.<br/><br/>And then...three seconds later, Charlotte Lane cried.<br/><br/>Old Master Lane scooped her up in his arms before Andrew Lane could, asking, “What’s wrong? What’s wrong?”<br/><br/>Natalie Wayne also brought Kevin Clark over.<br/><br/>Charlotte Lane, whose tearless cries had subsided somewhat, looked at Kevin Clark, and after a moment, reached out to him.<br/><br/>Old Master Lane laughed, “What’s the matter? Don’t want Grandpa to hold you?”<br/><br/>Little Lila, now able to say a few simple words, mumbled unclearly, “Hold.”<br/><br/>“Do you want Uncle Kevin to hold you?” Old Master Lane asked again.<br/><br/>Little Lila reached out to him.<br/><br/><br/><br/>Kevin Clark did not move.<br/><br/>Little Lila was on the verge of crying again.<br/><br/>William Lane extended his hand to her, “Big brother will hold you.”<br/><br/>Charlotte Lane glanced at him, but immediately shifted her gaze back to Kevin Clark.<br/><br/>William Lane pursed his lips, his puffed-up face showing his displeasure. He didn’t want to play with Kevin Clark anymore.<br/><br/>Natalie Wayne laughed and pulled Kevin Clark’s hand, “Go and hold your little niece.”\t\t\t\t\t\t</div>", "images": {}, "success": true}