{"id": 661, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15223148.html", "title": "Chapter 658 - 659: Side Story Thirty-Six: Ink-Dot Plum Fragrance (Thirty-Four)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 658 - 659: Side Story Thirty-Six: Ink-Dot Plum Fragrance (Thirty-Four)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 659: Side Story Thirty-Six: Ink-Dot Plum Fragrance (Thirty-Four)<br/><br/>Before William Lane had a romantic relationship, many of his affairs were handled by James Lane.<br/><br/>Especially during the years when he was looking for Charlotte Lane, the domestic affairs were almost all handled by James Lane.<br/><br/>So many people in the domestic scene knew James Lane.<br/><br/>James Lane represented William Lane, and he represented the Imperial City Lane Family.<br/><br/>Those who knew or had seen James Lane had a certain status in any field, or at least had been in contact with people of a certain status.<br/><br/>Hedrick Skyler and Mr. Richie did not know James Lane at all, let alone William Lane.<br/><br/>So James Lane never paid any attention to them from the beginning.<br/><br/>Amelia Smith quickly returned after washing her hands.<br/><br/>William Lane opened the food box and handed it to Amelia Smith.<br/><br/>Amelia Smith held it with one hand, and used a small fork to pick up a piece of mango and handed it to Eleanor Smith.<br/><br/><br/><br/>Eleanor Smith looked at her wordlessly, with an expression that seemed to ask: How can you eat under such circumstances?<br/><br/>“Second Sister.”<br/><br/>“I’m not eating.”<br/><br/>Amelia Smith put it into her own mouth and chewed slowly.<br/><br/>“What? Is it your last supper?” Hedrick Skyler lit a cigarette and took a puff.<br/><br/>William Lane’s gaze moved away from Amelia Smith, all the gentleness disappeared, leaving only cold indifference. He looked at Hedrick Skyler and said, “Hedrick Skyler, do the people behind you know how arrogant you are?”<br/><br/>“Do you know who’s behind me?” Hedrick Skyler exhaled smoke, his eyes full of boundless arrogance.<br/><br/>“Enzo Thiago.” William Lane said indifferently.<br/><br/>Hedrick Skyler paused in his action of smoking, his pupils slightly contracted, and after a moment of stupefaction, he laughed and said, “You seem to have some skills.”<br/><br/>William Lane did not speak.<br/><br/>Hedrick Skyler laughed again, “But... having skills is useless. Kid, in this world, it’s all about background. Today, because you hurt my family, none of you will live.”<br/><br/>Harris Richie raised his chin arrogantly, looking at them.<br/><br/>“Kill them!” Mrs. Turner also raised her chin and mumbled with drool dripping from her mouth.<br/><br/>“Yes, yes, kill them.” Adam Turner also timidly pointed at them.<br/><br/>Amelia Smith glanced at them, unconcerned, and ate a grape.<br/><br/>Eleanor Smith: “.......”<br/><br/>“What kind of background can an Enzo Thiago have?” William Lane said indifferently.<br/><br/><br/><br/>The Turner family huddled together and escaped, occasionally getting some kicks in the process.<br/><br/>Harris Richie tried to help Hedrick Skyler and her father to the side, but the Lanes were very deliberate, occasionally hitting them and keeping them tied together.<br/><br/>“Brother.” Amelia Smith pulled at William Lane’s sleeve, “Don’t be angry.”<br/><br/>William Lane turned to look at her, and his eyes gradually softened, “It’s fine.”<br/><br/><br/><br/>“Or... you can kick them too.” Amelia Smith said.<br/><br/>“I don’t want to dirty my shoes.” William Lane smiled.<br/><br/>“Fair enough.”<br/><br/>Before long, Hedrick Skyler’s men were all defeated, controlled one by one. The entire courtyard was crowded with people, making it difficult to breathe.<br/><br/>James Lane could tell that William Lane was not satisfied, so after dealing with the others, he went to Hedrick Skyler and beat him up some more.<br/><br/>Mr. Richie tried to stop him.<br/><br/>James Lane beat him up too.<br/><br/>His fists fell on the most painful spots, but he spared their lives.<br/><br/>Harris Richie went from threatening and cursing at the beginning to begging for mercy at the end.<br/><br/>The Turner family huddled in the corner, scared out of their wits.<br/><br/>Eleanor Smith couldn’t bear to watch the scene anymore, so she turned around and plugged her ears.<br/><br/>She truly felt the horror of William Lane.<br/><br/>Without any effort, just an emotional fluctuation, he could take someone’s life.<br/><br/><br/><br/>Amelia Smith had never seen such a scene before either. She was frightened and tightly held the food box in her hand, her knuckles turning white.<br/><br/>But she didn’t avoid it.<br/><br/>Because she knew she needed to accept everything about William Lane, including his ruthlessness.<br/><br/>William Lane pulled her close to him and lifted his hand to cover her eyes, “Why do you watch if you’re scared?”<br/><br/>“I-I’m not scared.” Amelia Smith leaned back against him, seeking warmth, “I’m just a little... unaccustomed.”<br/><br/>“You don’t need to get used to it.” William Lane said, “Just don’t be afraid of your brother.”<br/><br/>“I won’t.” Amelia Smith replied quickly and firmly.<br/><br/>William Lane smiled and lowered his head to kiss her forehead.<br/><br/>After finishing with Hedrick Skyler, James Lane silently retreated to the side.<br/><br/>Mr. Richie lay on the ground, completely unconscious. Harris Richie sat beside him, crying non-stop.<br/><br/>After lying still for a while, Hedrick Skyler said, “Brother Thiago won’t let you get away with this. You guys, you guys will all pay a heavy price that you can’t bear. I, I won’t be able to go back tonight. Brother Thiago, Brother Thiago will definitely find me. Then, you guys, none of you will escape.”\t\t\t\t\t\t</div>", "images": {}, "success": true}