{"id": 668, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15225836.html", "title": "Chapter 665 - 666: Extra Forty-Three Chen Nian: Little Vinegar Spirit", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 665 - 666: Extra Forty-Three Chen Nian: Little Vinegar Spirit</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 666: Extra Forty-three Chen Nian: Little Vinegar Spirit<br/><br/>In July, the lotuses in Clark Manor were in full bloom.<br/><br/>At that time, the Clark Manor only had three acres of lotus flowers, but it already felt spacious and beautiful.<br/><br/>The houses in the North Court had not been built yet, and there were more exotic flowers, some medicinal herbs cultivated by Natalie Wayne, and some scenery.<br/><br/>Old Master Lane carried Lila Campbell to Clark Manor for a visit.<br/><br/>Elina Clark, Tom Wayne, and Harton Clark accompanied them to admire the lotus flowers by the Lotus Pond. Lila Campbell held Harton Clark’s hand all the time.<br/><br/>“Brother Arthur, there are goldfish!” Little Lila could only see the fish in the pond through the gaps in the railing, which was not even as high as her.<br/><br/>“Mmm.” Harton Clark replied. As he looked down, he saw a goldfish swimming away, startled by her voice.<br/><br/>“Ah! It ran away.” Lila’s voice was milkily crisp, with a hint of loss.<br/><br/>“They’ll run away when they hear noises.” Harton Clark explained.<br/><br/>“Then, I’ll be quieter.” Little Lila waited quietly for a while, but no fish came over. She pouted pitifully and looked at Harton Clark, pulling his hand and said, “Brother Arthur...”<br/><br/><br/><br/>Harton Clark pursed his lips lightly and then looked at the Clark Family member holding fish food not far away.<br/><br/>The family member quickly brought the fish food over, and Harton Clark took it and scattered some into the fish pond.<br/><br/>Soon, a swarm of goldfish came over and opened their mouths to eat the fish food.<br/><br/>“Wow, so many, so many goldfish.” Lila excitedly shook Harton Clark’s hand, “Brother Arthur is amazing.”<br/><br/>Harton Clark stood by the Lotus Pond without speaking.<br/><br/>He didn’t scatter much fish food, so the swarm dispersed soon after.<br/><br/>Lila Campbell watched the last goldfish swim away, then shook Harton Clark’s hand again.<br/><br/>Harton Clark then scattered some more fish food into the pond.<br/><br/>And so, Old Master Lane, Mr. &amp; Mrs. Clark, and Harton Clark chatted by the Lotus Pond for half an hour, while Harton Clark scattered fish food for half an hour.<br/><br/>Lila Campbell was so happy she couldn’t hold it in and even scared the fish that came to eat the fish food.<br/><br/>However, the next day, the Clark Family members fished a bunch of dead fish from this pond.<br/><br/>...<br/><br/>After admiring the lotus flowers on the Lotus Pond, everyone walked back.<br/><br/>Old Master Lane and Mr. &amp; Mrs. Clark got along well, and it was not Lila’s first time visiting Clark Manor.<br/><br/>However, she had never finished touring it before.<br/><br/>Each time she came, she would be very happy and excited, running around and looking at everything.<br/><br/>As several people walked back together, just like usual, the little girl’s hand tightly held Harton Clark’s fingers, as if afraid that if she loosened her grip, Harton Clark would run away.<br/><br/><br/><br/>...<br/><br/>Old Master Lane injured his leg while working years ago. He could walk fine, but running was impossible.<br/><br/>Lila ran fast, and Old Master Lane failed to catch up with her.<br/><br/><br/><br/>Fortunately, there were always people around Clark Manor, so he was not too worried.<br/><br/>Kevin soon caught up with him, exchanged a few words, then went after Lila.<br/><br/>Charlotte ran randomly, not caring where she went. The winding paths of Clark Manor could easily get her lost. While crossing an arch bridge, she tripped and fell to the ground.<br/><br/>“Ah!”<br/><br/>She landed on the floor, let out a small cry, then quickly got up, dusting her hands and trying to continue.<br/><br/>A Clark Manor staff member had seen her fall and rushed over, squatting in front of her: “Miss Lane, where did you fall? Does it hurt?”<br/><br/>Charlotte was still upset, so she just shook her head and continued walking onto the bridge.<br/><br/>Just then, Kevin ran over: “Lila.”<br/><br/>She stopped and looked at him.<br/><br/>Kevin walked up to her and looked down at her: “Why are you running? Uncle Lane couldn’t keep up.”<br/><br/>Charlotte looked up at him, pouting, her big eyes on him angrily, her little cheeks bulging with frustration.<br/><br/>“Are you mad?” Kevin squatted down to check her hands.<br/><br/>There were no scrapes, but her delicate little hands had turned red.<br/><br/><br/><br/>He frowned slightly.<br/><br/>“You didn’t pay attention to me and didn’t hold my hand.”<br/><br/>“When did I not pay attention to you?” Kevin rolled up her pants a bit and looked at her knee—it had turned red as well.<br/><br/>“I called you just now, but you ignored me,” Charlotte said, aggrieved, “I don’t like it.”<br/><br/>Kevin glanced at her and thought for a moment: “I’m sorry, I didn’t hear.”<br/><br/>Lila blinked her big eyes and remained silent.<br/><br/>“Does it hurt?”<br/><br/>“It hurts.” Charlotte hesitated for a moment before starting to fake cry. She seemed to compete with Lily, saying, “Brother Arthur, it hurts so much.”<br/><br/>Kevin: “......”<br/><br/>Charlotte cried and wrapped her arms around his neck, whispering softly, “Carry me...”<br/><br/>Kevin didn’t move.<br/><br/>Lila wasn’t satisfied and raised her voice, whining with tears in her voice: “Carry me.”<br/><br/>Kevin somewhat stiffly embraced her, patting her back...\t\t\t\t\t\t</div>", "images": {}, "success": true}