{"id": 662, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15223150.html", "title": "Chapter 659 - 660: Side Story Thirty-Seven: Ink-Dot Plum Fragrance (Thirty-Five)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 659 - 660: Side Story Thirty-Seven: Ink-Dot Plum Fragrance (Thirty-Five)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 660: Side Story Thirty-Seven: Ink-Dot Plum Fragrance (Thirty-Five)<br/><br/>Enzo Thiago didn’t wait for Evening to find Hedrick Skyler before coming. He came quickly, almost immediately after Hedrick was beaten, he arrived.<br/><br/>As he entered the courtyard, he saw the people all over the ground, and hesitated for a moment. Then he looked at William Lane and hurried in.<br/><br/>He had no interest in finding which person on the ground was Hedrick Skyler.<br/><br/>He walked straight towards William Lane, but when he was about to reach him, someone on the side grabbed the hem of Enzo’s pants.<br/><br/>“Brother Thiago, Brother Thiago...” Hedrick Skyler was lying on the ground, clutching the hem of Enzo’s pants tightly. “Brother Thiago, you’re finally here. Quick, avenge our brothers. Kill them! Kill them all!”<br/><br/>Enzo Thiago looked down at him, and it took him a moment to recognize that this person was Hedrick Skyler.<br/><br/>He stared at the man on the ground for a while, then forcefully pulled his pants out of his grip. But as soon as he did, someone grabbed his sleeve.<br/><br/>“Uncle Thiago, you must avenge my father and godfather.” Harris Richie suddenly looked towards Amelia Smith and William Lane, with maliciousness on his face. “It was them, they are the ones who beat my father and godfather. They don’t even care about you. They still attacked even after hearing your name.”<br/><br/>Enzo tried to pull his hand back but couldn’t.<br/><br/>Harris was holding him tightly, staring at Amelia Smith: “Are you not scared? Aren’t you great at fighting? Aren’t you arrogant? Come on, fight! Fight!”<br/><br/><br/><br/>Enzo violently pulled his hand back, pushing Harris aside: “Get lost!”<br/><br/>“Ah!” Harris Richie fell to the ground and immediately sat up, looking at Enzo Thiago in disbelief. “Uncle Thiago?”<br/><br/>Enzo Thiago glared at him, then kicked Hedrick Skyler before quickly walking up to William Lane. He smiled and respectfully said, “Young Master Lane.”<br/><br/>Harris suddenly looked at William Lane, his face full of shock.<br/><br/>Mr. Richie also looked over, Hedrick Skyler turned his head and after a while, he said, “Brother Thiago, you...why?”<br/><br/>William Lane’s expression was cold and intimidating: “Enzo Thiago, you really know how to get by, don’t you? I give you some resources and leave you a way out, is this how you repay me?”<br/><br/>“Young Master Lane, I didn’t, I didn’t.” Enzo Thiago stammered.<br/><br/>“You didn’t?” William Lane said softly: “Then, depending on the power of the Lane family, he even wants to drag my grandfather down with him. That’s quite an accomplishment.”<br/><br/>Harris stared, his entire body becoming numb.<br/><br/>The man in front of him was surnamed Lane. He was the young master of the Lane family.<br/><br/>He was the power they had been relying on behind the scenes.<br/><br/>Facing William Lane, Enzo Thiago’s legs shook, and cold sweat kept breaking out: “Young Master Lane, I didn’t.”<br/><br/><br/><br/>“Mhm, I know,” William Lane smiled. “I just want to hold you.”<br/><br/>Amelia Smith: “......”<br/><br/>William Lane carried her out the courtyard. After a few steps, Amelia suddenly remembered Eleanor Smith, who was still standing there with her ears covered: “Second Sister Davis, Second Sister!”<br/><br/>James Lane called to Eleanor Smith, and Eleanor finally reacted and followed Amelia Smith.<br/><br/>Seeing them leaving, Enzo Thiago immediately followed: “Young Master Lane! Young Master Lane, I know I was wrong. I will definitely keep a closer eye on them in the future. Please give me another chance. Young Master Lane...”<br/><br/>James Lane blocked his way.<br/><br/>“Big Brother Lane!” Enzo Thiago was sweating profusely. He saw that William Lane wasn’t paying him any attention and could only turn to James Lane. “Big Brother Lane, please help me beg for mercy.”<br/><br/>James Lane remained expressionless and coldly said, “You’ve crossed Young Master’s bottom line. Neither our Madam nor Old Master Lane should have been touched by you.”<br/><br/>Enzo Thiago stumbled back a step.<br/><br/>James Lane didn’t look at him again, and followed William Lane out of the courtyard.<br/><br/>When the courtyard door closed, Enzo Thiago was still unable to react.<br/><br/>He had already arrived in the county at noon, and it was James Lane who called him here.<br/><br/>Not long ago, he had received a message from James Lane to come.<br/><br/><br/><br/>But when he arrived, the news he received was that his second half of life was ruined.<br/><br/>“Uncle Thiago, Uncle Thiago, what should we do? What should we do?” Harris Richie sat on the ground, clutching Enzo Thiago’s pants leg, “What’s going to happen to us?”<br/><br/>Enzo Thiago looked at Harris Richie, kicked him away again, and kicked Hedrick Skyler as well: “All of you are a bunch of troublemakers!”<br/><br/>Hedrick Skyler curled up on the ground, unable to say a word, his groaning barely audible.<br/><br/>Harris Richie sat on the ground and cried.<br/><br/>Enzo Thiago said, “What’s going to happen? We will all wish we were dead! What a feat! Pissing off the Lane family! Where’s your brain?! Where’s your brain?! I told you to keep a low profile! Low profile! Is this how you keep a low profile for me?! You’re all insane! Totally insane!”<br/><br/>Enzo Thiago continued scolding, then leans down to slap Harris Richie again. With a crisp sound, Harris was knocked to the ground: “You can’t get enough, can you? It’s all because of you causing trouble!”<br/><br/>Harris’ face quickly swelled up. Her hair stuck to her face, and her face was covered in snot and tears.<br/><br/>She covered her face and lay on the ground in a pitiful state.<br/><br/>The Turner family huddled in the corner, watching the scene and trembling in fear, not daring to say a word.\t\t\t\t\t\t</div>", "images": {}, "success": true}