{"id": 669, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15233044.html", "title": "Chapter 666 - 667: Extra 44 - Aging: Becoming Brother Arthur'S Wife", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 666 - 667: Extra 44 - Aging: Becoming Brother Arthur'S Wife</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 667: Extra Chapter 44 – Aging: Becoming Brother Arthur’s Wife<br/><br/>At Clark Manor, after Charlotte fell, she chatted with Kevin Clark, and Old Master Lane, who was standing a little distance away, heard it all.<br/><br/>On their way back, inside the car, Old Master Lane held her little hand and asked her, “Charlotte, do you really like Arthur?”<br/><br/>“Yes, I like him very much.” Charlotte had a small water bottle hanging around her neck and was drinking from it through a straw, “Grandpa, do you like him too?”<br/><br/>“Grandpa likes him too.”<br/><br/>Charlotte smiled happily.<br/><br/>“Were you jealous today seeing Arthur close to someone else?” Old Master Lane gently asked.<br/><br/>“Yes.” Little Charlotte honestly said, “I like Brother Arthur, I only want him to play with me, and I don’t want him to play with anyone else.”<br/><br/>“But Arthur has his own circle of friends, not just you.” Old Master Lane said, “He has his own friends, family, and he has to accompany them, care for them, and play with them too.”<br/><br/>Charlotte looked at Old Master Lane with an unwilling face while sipping from her straw.<br/><br/>“To love someone is not to possess them.” Old Master Lane used the most understandable language for her to explain, “For example... If Arthur really likes you, and doesn’t let you play with Roy, only with him, would you be happy?”<br/><br/><br/><br/>Little Charlotte frowned, “I like playing with Brother.”<br/><br/>“What if you’re not allowed to play with your brother?”<br/><br/>“No way.” Charlotte said seriously.<br/><br/>“So... you also have to allow Arthur to play with others.” Old Master Lane said.<br/><br/>Charlotte still looked unwilling.<br/><br/>A classic case of allowing the officials to set fires but not allowing the common people to light lanterns.<br/><br/>I can play with others, but you... cannot!<br/><br/>Old Master Lane smiled at her little stubborn expression.<br/><br/>She’s still too young and doesn’t understand many things. He had no intention of rushing her to understand everything, just wanted to talk about it when it came to his mind.<br/><br/>He talked, and let her slowly understand things bit by bit.<br/><br/>There are so many truths and things in life that you can only understand and comprehend when you reach the right age and experience the corresponding events.<br/><br/>After finishing his thoughts, Old Master Lane teased her, “But Arthur will eventually get married and take a beautiful wife, he can’t always play with Charlotte, right?”<br/><br/>“Ah? Why does he need a wife?”<br/><br/>“Arthur will find someone he loves and marry her.”<br/><br/>Charlotte covered her little water bottle, looked at Old Master Lane, her big innocent eyes asked, “Does he really need a wife?”<br/><br/><br/><br/>But by the time Charlotte Lane was eight or nine years old, it seemed as if Kevin Clark had completely disappeared from her life.<br/><br/>She asked Old Master Lane, Andrew and his wife and William Lane, “Where did Brother Arthur go?”<br/><br/>They all said that something had happened at his home...<br/><br/>After a long time, she found out that the incident involved Kevin Clark’s second brother Davis.<br/><br/>As for Kevin Clark, many of his memories seemed to be sealed away.<br/><br/>There was a critical point in his life, and he left many things behind before that point...<br/><br/>Many names would come to his ears every year, but he wouldn’t pay too much attention to them.<br/><br/><br/><br/>Everyone seemed to be doing well, and there seemed to be nothing for him to worry about.<br/><br/>Until... the year he turned nineteen, when William Lane called him and said, “Lila is missing.”<br/><br/>He was still on the F Continent, in Ryan Easton.<br/><br/>And it was on the F Continent that Charlotte Lane went missing.<br/><br/>The Lane Family had a powerful presence on the F Continent. William Lane took Charlotte and his other sister for an outing, and they were attacked on the road. Charlotte fell into the sea.<br/><br/>By the time Kevin Clark received the message, Charlotte had already been missing for a day.<br/><br/>He took a group of people to search for her but couldn’t find her within three days.<br/><br/>The entire Lane Family came over. Old Master Lane seemed in good spirits at first, but as they failed to find Charlotte, he became sick and was hospitalized.<br/><br/>The Andrew couple aged more than a decade overnight, and Andrew’s hair turned gray in a matter of three days.<br/><br/>William Lane searched for Charlotte in the sea as if he were mad, mechanically eating and drinking, just so that he could keep up his strength in searching for her.<br/><br/>Kevin Clark continued the search for another week, but aside from a longevity lock, they found nothing.<br/><br/>He returned to Ryan Easton and locked himself in a room for a day.<br/><br/>He discovered that his memories of Charlotte Lane stopped at her age of four or five, and he knew that they had met later, but he couldn’t quite remember.<br/><br/><br/><br/>Such a beautiful and adorable little girl suddenly disappeared.<br/><br/>Before they came to the F Continent, William Lane had called him, saying that he would come to Ryan Easton to see him and would bring his two sisters along.<br/><br/>William Lane said that Charlotte insisted on seeing him, so he brought her along to visit.<br/><br/>He even warned him to behave himself and not flirt with his sister.<br/><br/>Locking himself in his room, Kevin Clark couldn’t describe his feelings. He felt as if he’d been flayed and had his bones removed, his strength drained.<br/><br/>He couldn’t remember when they last met. The meeting he had anticipated didn’t happen, and he didn’t know when their next meeting would be or whether it might be postponed indefinitely...\t\t\t\t\t\t</div>", "images": {}, "success": true}