{"id": 660, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15223147.html", "title": "Chapter 657 - 658: Extra Thirty-Five: Fragrance Of The Ink Plum (Thirty-Three)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 657 - 658: Extra Thirty-Five: Fragrance Of The Ink Plum (Thirty-Three)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 658: Extra Thirty-Five: Fragrance of the Ink Plum (Thirty-three)<br/><br/>Harris Richie sat on a far-off single seater sofa.<br/><br/>Her legs were crossed, her hair was a bit messy, rudimentarily tied up, and her skin looked unhealthy, quite pale. You could still see the purple hand marks left on her neck by Amelia Smith.<br/><br/>Even so, she emanated an air of complete ease, casualness, and laziness.<br/><br/>She didn’t seem to care about her current situation at all, even enjoying observing the spectacle they presented.<br/><br/>Eleanor Smith stopped speaking upon hearing her laughter.<br/><br/>Amelia Smith also looked at her.<br/><br/>Harris Richie kept laughing.<br/><br/>Eleanor Smith asked, “What are you laughing at?”<br/><br/>“Don’t you find it amusing?” Harris Richie replied, laughing, “It’s too funny.”<br/><br/>“You must have a problem,” Eleanor Smith said, “I suggest that you see a psychologist. It’s acceptable if you’re sick, but don’t hold up others.”<br/><br/><br/><br/>“Hold up others? Who have I held up?” Harris Richie replied with a laugh still on her face, “And what can you do even if I have held you up?”<br/><br/>Eleanor Smith was speechless, she had never encountered such audacious people before.<br/><br/>“Do you think there’s no one in this world who can control you?” Amelia Smith snapped.<br/><br/>Raising her eyebrows, Harris Richie looked at Amelia Smith with interest, “Younger sister, do you actually think you can do something to me by keeping me here for a few days? Do you dare to kill me?”<br/><br/>Amelia Smith fell silent.<br/><br/>Harris Richie chuckled: “I know that you have some power, which is why you confident enough to hold me here. But let me tell you, as long as I don’t die, you’ll never be able to do anything to me.”<br/><br/>“Is that so?” responded Amelia Smith in a cold voice.<br/><br/>“Of course.” Richie uncrossed her legs, leant back into the sofa and further explained, “Dear sister, some powers are far beyond your imagination. Your understanding and the world you see don’t support such insights.”<br/><br/>Amelia Smith’s eyebrows twitched slightly.<br/><br/>“There’re forces that people like you will never comprehend or witness.” Richie said, “The most you can do is to confine me here for a few days. These people of yours... will very soon meet a pathetic fate, far worse than those outside in the courtyard.”<br/><br/>“Kill her! The little slut!” Mrs. Turner cursed, “God knows which man she hooked up with to attract these wild men... ah!”<br/><br/>James Lane stood behind Amelia Smith all the while, indifferent and silent.<br/><br/>But hearing someone curse at Amelia Smith, he sprang into action, appearing next to Mrs. Turner in an instant, and with a quick move, dislocated her jaw.<br/><br/>Mrs. Turner gave out a horrific shriek, her mouth agape and letting out a monotonous sound, unable to articulate words.<br/><br/>Amelia Smith glanced at her before retracting her gaze and went upstairs with Eleanor Smith.<br/><br/><br/><br/>James Lane took out his phone to send a message.<br/><br/>Eleanor Smith whispered, “Amelia, their family seems to be very powerful. Will we be in danger?”<br/><br/>“No,” Amelia Smith said.<br/><br/>“But they have more people.”<br/><br/>“It’s okay,” Amelia Smith said, “James can take on ten at a time.”<br/><br/>“Is he that good?” Eleanor Smith looked towards James Lane.<br/><br/>James Lane also looked over, then nodded heavily, a hint of pride suddenly appeared on his usually expressionless face.<br/><br/><br/><br/>Eleanor Smith felt slightly relieved, raised her hand to give him a thumbs-up.<br/><br/>Hedrick Skyler and Mr. Richie swaggered over.<br/><br/>Seeing the two of them, Harris Richie, who had been on alert, detoured around Amelia Smith and immediately ran towards them: “Daddy, godfather.”<br/><br/>Seeing his daughter in that condition, Mr. Richie’s eyes welled up: “My dear, how did you end up like this? Daddy came too late, and you suffered.”<br/><br/>“Dad, I’m fine,” Harris Richie said with a smile.<br/><br/>The Turner family seeing this, immediately rushed to Hedrick Skyler and their group.<br/><br/>Mrs. Turner’s jaw was dislocated, and she kept drooling, but she was still talking.<br/><br/>She pointed at Amelia Smith and Eleanor Smith, slurred, “Them! It was them! They hit Harris! Kill them quickly!”<br/><br/>Hedrick Skyler looked at them, glaring, “Was it you who hit my god-daughter?”<br/><br/>James Lane looked at him: “What about it? What do you want to do?”<br/><br/>“What do I want?” Hedrick Skyler sneered, “I adore this girl. You dared to lay hands on her. Today, none of you will leave here.”<br/><br/>“You’re being rather presumptuous.” William Lane’s voice came from the entrance.<br/><br/>Everyone turned to look at William Lane.<br/><br/><br/><br/>Dressed in a neatly ironed suit with an upright figure and gentle yet cold countenance, William Lane walked into the yard with a square food box in hand, heading towards Amelia Smith.<br/><br/>Hedrick Skyler and Mr. Richie were observing him, impressed by his extraordinary temperament. For a moment, they exchanged a knowing look.<br/><br/>William Lane walked up to Amelia Smith as though no one else was there, handed her the food box, and said, “Fruit platter, want some?”<br/><br/>Amelia Smith smiled at him and said, “I’ll wash my hands first.”<br/><br/>“Sure.”<br/><br/>The crowd, “......???”<br/><br/>Are you really going to ignore us like that?\t\t\t\t\t\t</div>", "images": {}, "success": true}