{"id": 673, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15236668.html", "title": "Chapter 670 - 671: Extra Chapter Forty-Eight: Third Uncle, Are You Angry?", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 670 - 671: Extra Chapter Forty-Eight: Third Uncle, Are You Angry?</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 671: Extra Chapter Forty-Eight: Third Uncle, Are You Angry?<br/><br/>The crew had been focusing on filming Charlotte Lane these past few days.<br/><br/>While Charlotte Lane was filming, Kevin Clark was helping her carry items and waiting for her outside the shooting area.<br/><br/>This was usually Anisa Cooper’s job.<br/><br/>Now that Anisa Cooper was responsible for taking care of the kids, the two exchanged roles.<br/><br/>Although the food from the crew wasn’t good, Ethan Clark still had a lot of fun on set.<br/><br/>The place was big, there were many people, and even if the food wasn’t enough, Morris would secretly buy him additional food. All of his favourite dishes.<br/><br/>Both children were utterly spoiled.<br/><br/>Initially, Charlotte Lane didn’t pay him much attention.<br/><br/>But it wasn’t until she heard the phrase, “Let’s take one more shot of this scene,” coming out of the megaphone in Ethan Clark’s voice...<br/><br/>That she realized this little master was having the time of his life here.<br/><br/>From a distance of over ten meters away, as Charlotte Lane’s gaze swept towards him, Ethan Clark obediently handed back the megaphone to Morris.<br/><br/>Isabella Lane sat obediently on the side. Seeing her brother’s antics, she chuckled and said, “Brother, have some water.”<br/><br/>She handed Ethan a small cup of water.<br/><br/>Ethan talked a lot, and she was always worried that he’d get thirsty, so every time she drank water, she would also let Ethan have a drink.<br/><br/>Ethan was very obedient and accepted the water cup: “Thank you, sister.”<br/><br/>...<br/><br/>It’s been years since Charlotte Lane last acted, and though she put forward the script for this work, she was still rusty.<br/><br/>The first day of filming was not well coordinated with Morris and the progress was slow.<br/><br/>Otherwise, Ethan Clark wouldn’t have been able to mimic that phrase so well.<br/><br/>After dinner, several more scenes were filmed.<br/><br/>The plan was for Kevin Clark to take Ethan Clark and Isabella Lane home first, but both didn’t want to go, so they were left to their own devices.<br/><br/>By the time filming was over, Ethan Clark had fallen asleep in Morris’s arms. He had run around and shouted all day and was already tired.<br/><br/>Even the noisy filming site didn’t wake him up.<br/><br/>Morris was holding him in one hand, with a small blanket wrapped around him, and a megaphone in his other hand.<br/><br/>Whereas Anisa Cooper was holding Isabella Lane, watching the documentary “West River Corridor.”<br/><br/>The little girl watched very intently.<br/><br/>After the shooting was over, Charlotte Lane went to change her clothes, came back and saw Ethan Clark sleeping, and ruffled his hair.<br/><br/>“Be gentle,” Morris said.<br/><br/>By a strange coincidence, this was the same Alex Martin Ethan Clark had spoken about yesterday, a newcomer who admired Charlotte Lane a lot.<br/><br/>He had just debuted, and his popularity was skyrocketing. He had publicly admitted to the media that he liked Charlotte Lane very much, and 80 percent of the reason he entered the industry was because of her.<br/><br/>Arthur North had researched this person’s background overnight because of what his son had said.<br/><br/>“Brook sister, you’re leaving?” Alex Martin greeted.<br/><br/>Charlotte Lane hadn’t spent time reading the script, and she usually didn’t pay much attention to the circle. This time, she hadn’t been too conscious of which people Morris had used.<br/><br/>She only knew who the male and female leads were.<br/><br/>Almost all the others were newcomers, which she didn’t recognize at all.<br/><br/>She didn’t recognize the person in front of her either, but he’d spoken to her, so she nodded in response.<br/><br/>Then when Alex Martin wanted to say something else, he noticed Arthur North was staring at him, so he looked at him and politely said: “Third Master.”<br/><br/>Arthur North was just holding the child, looking at him plainly, but it sent a chill down his spine.<br/><br/>In the heat of summer, Anisa Cooper felt a chill, and when she looked up, she felt as if murder was in the air around Arthur North, she subconsciously moved aside a bit.<br/><br/>Arthur North did not respond, but instead said: “It’s getting late.”<br/><br/>The implication was that it was so late, it was inappropriate for him to try and continue the conversation after simply offering greetings.<br/><br/>Charlotte Lane glanced at Arthur North.<br/><br/>She quickly understood.<br/><br/>There were so many people on the set, both men and women greeting her, and he hadn’t cared at all, but he took issue with the man in front of them...<br/><br/>Seeing Arthur North’s attitude, Alex Martin remained calm, and extending his hand to Charlotte Lane said: “Brook sister, my name is Alex Martin, we have a few scenes together in a few days. If you have time... I would like to learn from you.”<br/><br/>Arthur North eyed his outstretched hand, his pupils dilating slightly.<br/><br/>Seeing Arthur North’s reaction, Charlotte Lane did not shake hands with Alex Martin. Rather, she elegantly consented a nod refusal, stating: “I have a tight schedule.”<br/><br/>Over the years, because she has been pampered by the Clarks and the Lanes, and also because of her children, Charlotte Lane’s temper has softened considerably. She has been trying to be more tactful, especially when dealing with people less familiar and younger than her.<br/><br/>“No problem, we can discuss on the set.” Alex Martin smiled, full of vitality, “I’ll let you go now.”<br/><br/>After he finished speaking, before leaving, he looked at Arthur North, nodded in greeting, then left.<br/><br/>Arthur North watched his retreating figure until Noah Clark called him, and then he turned his gaze back.<br/><br/>The moment he turned his head, he was met by Charlotte Lane’s gaze.<br/><br/>Charlotte lane smiled at him: “Third Uncle, are you in a bad mood?”<br/><br/>Arthur North smiled back at her: “If you keep doing this, I won’t be in a good mood.”<br/><br/>Charlotte Lane smiled and responded, “Brother Arthur, let’s go.”<br/><br/>Anisa Cooper lowered her head to conceal a chuckle.<br/><br/>Arthur North also smiled, holding Ethan Clark in one hand and gently guiding Charlotte Lane towards him with the other, he then gave her a peck, saying: “Let’s go.”\t\t\t\t\t\t</div>", "images": {}, "success": true}