{"id": 672, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15235111.html", "title": "Chapter 669 - 670: Extra 47: Small Daily Life", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 669 - 670: Extra 47: Small Daily Life</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 670: Extra 47: Small Daily Life<br/><br/>Knowing that Charlotte Lane was busy, Morris arranged more concentrated filming schedules for her.<br/><br/>After taking a break for a while, Charlotte had to go back to filming. At this time, Anisa Cooper called back.<br/><br/>During the many years Charlotte did not join the drama crew, Anisa took on half of the responsibilities in Hill Dawson’s studio, earning shares and mentoring many newcomers.<br/><br/>As an artist agent, she has a good reputation in the Imperial Capital.<br/><br/>Usually very busy, Charlotte did not expect to bring Anisa in. But she insisted on coming, even after turning down a lot of work.<br/><br/>Just now, she went to make work-related phone calls.<br/><br/>A few years ago, she and John Collins got their marriage certificates, but as they were too busy, they had not had any children.<br/><br/>Over the years, John had become Kevin Clark’s right-hand man.<br/><br/>He had picked up his interest and hobbies after being injured and considered himself lucky to have entered Ryan Easton.<br/><br/>With a few industrious years at Ryan Easton, he climbed the corporate ladder. First, because he loved his job, and second, because he wanted to give Anisa a better life.<br/><br/><br/><br/>Then one day, Kevin Clark threw a huge bomb at him, which caused his blood to boil.<br/><br/>Kevin told him about the research conducted by Ryan Easton and wanted him to participate. Later, Juan Wright took him to F Continent for some time.<br/><br/>The day John found out, he took an unprecedented day off from Kevin.<br/><br/>He thought he would only contribute to the nation’s economy for the rest of his life, but now he had the opportunity to contribute to border defense.<br/><br/>At the time, it was the coldest winter day; he wore a thin layer and excitedly wandered around the Imperial Capital.<br/><br/>He went home with a high fever and had to take two more sick days.<br/><br/>Anisa gave up some work to take care of him at home, seeing that he was still full of energy despite being sick; she felt he had something going on.<br/><br/>But when she asked, John didn’t tell her.<br/><br/>Kevin said it was confidential, so John kept it even from Anisa.<br/><br/>As a result, John had more frequent interactions with Kevin, occasionally bringing work to Clark Manor.<br/><br/>Anisa visited Charlotte Lane occasionally; although they didn’t communicate for work, Anisa would go see Charlotte whenever she had time.<br/><br/>More often, she went to see the two children.<br/><br/>So, Anisa and John were quite familiar with Clark Manor and naturally, very familiar with the two children.<br/><br/>Ethan Clark and Noah Clark also liked them.<br/><br/>When they came to the drama crew, Charlotte filmed while the two children stuck to Anisa, indulging her.<br/><br/><br/><br/>Harton Clark nodded, “I have to accompany Mommy.”<br/><br/>The makeup artist couldn’t help herself, and her eyebrows lightly furrowed.<br/><br/>What the hell!<br/><br/>What’s the matter with these two? Their daughter is only five years old, so cute and adorable, how can they be so heartless!<br/><br/>And! Why did she get to witness the couple’s sweet moments when she just came here to do the makeup!<br/><br/>Seeing that they wouldn’t go with her, Isabella Lane hesitated for a moment and then walked out of the Makeup Room holding the clothes.<br/><br/>Charlotte Lane looked at Harton Clark through the mirror, and they exchanged a glance, and Harton Clark still followed her out in the end.<br/><br/><br/><br/>There were many people in the drama crew, and they were afraid that their daughter might get lost too.<br/><br/>But Harton Clark only followed behind; the entire process was conducted by Isabella Lane herself and the costume and makeup teacher.<br/><br/>The little girl usually appeared shy, but she became braver once she entered the Costume Room, asking who was Aunt Leana and politely inquiring about the clothes.<br/><br/>Charlotte Lane didn’t try to hide the visit of the twins to the drama crew, and the news had already spread by noon, so the costume and makeup teacher naturally knew who she was.<br/><br/>Considering the face of Harton Clark and Charlotte Lane, she would definitely give her the clothes.<br/><br/>Moreover, the child was not only good-looking but also very polite.<br/><br/>The clothes would not be used later, so the teacher happily agreed to give them to her.<br/><br/>Harton Clark had been watching from the doorway, seeing his little daughter happy, and he was naturally happy as well.<br/><br/>What surprised him was that when she got the clothes, Isabella Lane found two pieces of chocolate in the small bag she had been carrying and gave them to the costume and makeup teacher.<br/><br/>To thank her.<br/><br/>The teacher looked at the brand of chocolate she was holding, she had seen it once, it was very expensive, these two pieces were worth much more than her clothes, so she declined to accept them.<br/><br/>But Isabella Lane stuffed them into her hands and ran away.<br/><br/>The teacher chased after her, only to run into Harton Clark.<br/><br/><br/><br/>“Third Master, these clothes are not worth much money, but this is too valuable.”<br/><br/>Harton Clark smiled and said, “Please accept it, it’s a child’s heart, many thanks.”<br/><br/>Facing Harton Clark, the teacher was so nervous that her mind went blank.<br/><br/>Later, when she tried the clothes on Charlotte Lane, she told her the same thing.<br/><br/>Charlotte Lane said the same thing as Harton Clark, word for word.<br/><br/>Moreover, the next day, Charlotte Lane gave the money for the dress to the Costume and Makeup Group.<br/><br/>She felt that after all, it was just two pieces of chocolate, and the missing items of the Costume and Makeup Group had to be replenished.\t\t\t\t\t\t</div>", "images": {}, "success": true}