{"id": 677, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15244212.html", "title": "Chapter 637: Extra Fourteen: Ink Dot Plum Scent (Part Twelve)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 637: Extra Fourteen: Ink Dot Plum Scent (Part Twelve)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 637: Extra Fourteen: Ink Dot Plum Scent (Part Twelve)<br/><br/>After finishing evening classes, Amelia was picked up by William.<br/><br/>On the way, Amelia never looked up and was engrossed in chatting with someone on her cell phone.<br/><br/>She didn’t even hear two out of the three sentences William spoke to her.<br/><br/>Upon returning home, seeing her change into shoes while standing at the entrance, still texting, Young Master Lane couldn’t bear it anymore.<br/><br/>William directly pulled the cell phone out of her hand.<br/><br/>“Give it back to me.” Amelia tried to snatch the phone back.<br/><br/>William raised the phone above his head.<br/><br/>Jumping twice, Amelia couldn’t reach the phone, she puffed her face in anger, “Give it to me!”<br/><br/>“Who are you talking to?” William asked.<br/><br/>Amelia looked at him, “It’s my privacy.”<br/><br/>William turned off the phone without looking at it and put it in his pocket, “I’ve confiscated it.”<br/><br/>Amelia wanted to get the phone from his pocket, but William grasped it firmly. She couldn’t pull it away after trying twice.<br/><br/>“Any more force and my pants will fall.” William said calmly.<br/><br/>Amelia immediately let go and stepped back.<br/><br/>“I was talking to Miss Lane.” Amelia confessed.<br/><br/>“Miss Lane?” William asked in confusion.<br/><br/>“Your sister.” Amelia said.<br/><br/>“Lila?”<br/><br/>Amelia nodded.<br/><br/>“How did you two get in touch?” William asked suspiciously, “Are you two plotting to trap me?”<br/><br/>“How could you think that of your sister?” Amelia asked.<br/><br/>William chuckled, “What were you two talking about?”<br/><br/>Amelia briefly told William about the conversation between her and Lila.<br/><br/>After listening, William said, “Why not do it? It’s a waste not to make money from Kevin.”<br/><br/>Amelia looked puzzled, “But that’s your sister’s money too.”<br/><br/>“My sister makes money, Kevin makes money.” William said, “It’s a win-win situation.”<br/><br/>Amelia ate a grape in silence.<br/><br/>William continued, “This has nothing to do with the money I make. I didn’t even know about the matter. Besides, you earned this opportunity yourself, it has nothing to do with me. Just like when you joined the Dance Association, we weren’t involved either.”<br/><br/>Amelia ate another grape, her right cheek bulging, “Really?”<br/><br/>After replying to William, Felix turned to Charlotte Lane to gossip: [Why is your brother in such a hurry to get married? I’ve been pushed three times to add money, and I’m almost feeling the heat.]<br/><br/>Charlotte replied: [You haven’t finished yet after three additional payments, and you still have the nerve to charge him more?]<br/><br/>Felix: [.......]<br/><br/>...<br/><br/>As expected, Amelia left early the next morning.<br/><br/>William didn’t attempt to stop her, for fear she would feel uncomfortable, and watched her sneaking away from his home gym window.<br/><br/>He even recorded a video with the intent to send it to her one day.<br/><br/>Since Amelia decided to work with Charlotte, she didn’t look for another job. All her spare time was spent in her room practicing carving.<br/><br/>It had been a long time since she had touched a carving knife.<br/><br/>A few days in, her fingers and the base of her thumb were cut.<br/><br/>She continued practicing with the band-aids on her hands.<br/><br/>William couldn’t bear to see her hurt anymore, but after several failed attempts to persuade her, he locked Amelia in her room and confiscated her carving knives.<br/><br/>The two failed to come to an agreement through the door.<br/><br/>Amelia simply ignored him.<br/><br/>Back in her room, she watched William leave the house from the balcony. Amelia then pulled out another box from under the bed, took out a new carving knife, and continued...<br/><br/>However, she did not continue for long.<br/><br/>After over half an hour, an unfamiliar call came in.<br/><br/>Although it was unfamiliar, the phone’s area code was her hometown.<br/><br/>Amelia hesitated for a moment before answering the call.<br/><br/>It was her father, Max Smith. As soon as she answered, his tone was full of flattery: “Amelia, what are you doing?”<br/><br/>Amelia touched the carving knife in her hand, her tone cold: “What’s the matter?”<br/><br/>“Your mother and I came to Imperial Capital,” Max said, “Your mother’s rheumatism flared up again, so we came to the hospital here. We saw a doctor this morning, and they said she needs to be hospitalized. We’re waiting for a ward and staying in a small inn. How about you... Do you want to come out for a meal together?”<br/><br/>“No,” Amelia replied, “Evan Smith is in Imperial Capital. If you need anything, find him.”<br/><br/>“Amelia!” Max shouted urgently, afraid she would hang up: “Your mother misses you very much. She’s been dreaming of you every night, crying out your name. You don’t have to see me, but please, see your mother.”<br/><br/>Amelia gripped the carving knife tightly, as the wound on her thumb reopened.<br/><br/>In her mind, she saw images of her mother teaching her to carve, frame by frame.<br/><br/>They were still on the phone, but no one spoke for a long time.<br/><br/>Finally, Amelia replied: “Where are you staying? I’ll come over.”<br/><br/>“Yes, yes.”\t\t\t\t\t\t</div>", "images": {}, "success": true}