{"id": 675, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15244210.html", "title": "Chapter 467: Chapter 410: Captured", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 467: Chapter 410: Captured</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 467: Chapter 410: Captured<br/><br/>In the car, Old Master Lane was like a curious child, looking here, peering there.<br/><br/>Seeing that the car is well-equipped, he finally pulled his gaze back and felt a little relieved.<br/><br/>“Miss, are you filming here?”<br/><br/>Anisa Cooper was secretly observing Old Master Lane, her breathing even lighter.<br/><br/>No wonder, her sister Lucia said that he knew her, but this old man did not recognize Lucia either.<br/><br/>It turns out that he is superior.<br/><br/>Even though he has retreated from that position, his prestige has not diminished.<br/><br/>Fortunately, Lucia recognized him right away, otherwise, they would be in real trouble.<br/><br/>Upon noticing that his hands had turned red from cold, Daisy Zane gave him a hand warmer, “Yes, I am filming.”<br/><br/>Old Master Lane cast down his eyes to look at the hand warmer. He could tell from the embroidery on its outside bag that it was made by Natalie Wayne, “Thank you, Miss.”<br/><br/>“It’s newly filled with charcoal, it might be a bit hot.” Daisy Zane warned.<br/><br/>“Okay.” Old Master Lane grasped the hand warmer, feeling that he had been recognized but did not reveal it.<br/><br/>He pretended not to recognize the lady before him.<br/><br/>By doing so... it might be easier for Lila.<br/><br/>When he previously mentioned having dinner together, he should have refused.<br/><br/>But... he couldn’t help it but selfishly wanted to spend more time with her, so he agreed immediately.<br/><br/>“Filming must be tough.” Old Master Lane said, “I saw online, often you have to work overnight and sometimes continuously without rest.”<br/><br/>“Not tiring.” Daisy Zane lowered her voice, making her sounds not so cold, “Most scenes are in the daytime, we get to rest at night.”<br/><br/>“That’s good. You are still young, don’t overuse your body.” The words of Old Master Lane were cautious. “Health is most important.”<br/><br/>“Uh-huh.”<br/><br/>When they arrived at the hotel and ordered their meals, Anisa Cooper made up an excuse and slipped away.<br/><br/>She dared not sit at the same table with Old Master Lane, it felt like sitting at the same table with the emperor.<br/><br/>She dared not.<br/><br/>She also worried that she might be overstepping her luck.<br/><br/>So she made up an excuse and ran off.<br/><br/>Daisy Zane also knew about her stiffness, so she did not keep her. Daisy gave her some money and asked her to take the driver to have a good meal.<br/><br/>Only two of them were left in the private room, the conversation during the meal was not much.<br/><br/>Old Master Lane was just being concerned about her work and her life.<br/><br/>This ranking, at his age. Daisy Zane thought that Olivia Lane might have used his account.<br/><br/>But after a round with him, she realized... he might have earned it by himself.<br/><br/>This event, was even more shocking to her than the Old Master Lane’s pretending to wander to the film set.<br/><br/>She suddenly thought that the news of a lady in her seventies winning five kills at three in the morning could be real.<br/><br/>Since then, it was as if they had agreed on it beforehand.<br/><br/>The number of times William Lane had visited the film set had noticeably increased.<br/><br/>Sometimes he came to visit her, bringing her food, clothes, things to use.<br/><br/>But each time he was in a hurry, leaving after a short stay.<br/><br/>Although he was careful each time, afraid that the media would take photos and affect Daisy Zane. And though he only stayed for a short while each time, he was still captured into a photo.<br/><br/>However... this photo did not circulate online, but ended up in the hands of Kevin Clark directly.<br/><br/>When Kevin Clark came out of the laboratory, he was about to call Daisy Zane. He opened his phone and saw a message from an unknown person.<br/><br/>He accepted the message.<br/><br/>Five photos, all of Daisy Zane and William Lane together.<br/><br/>In two of the photos, William Lane was seen handing Daisy Zane a dessert from a certain brand, and Daisy Zane was reaching out to take it.<br/><br/>The last three were of both chatting together.<br/><br/>William Lane had his eyes on Daisy Zane, and Daisy Zane was smiling at him.<br/><br/>Not a polite smile, but a sincere one that came from the heart.<br/><br/>When has the little girl ever smiled so sweetly at another man?<br/><br/>How did they get to know each other?<br/><br/>How close have they gotten?<br/><br/>Kevin Clark was thinking about these when the call from the unknown number came in.<br/><br/>He answered it directly.<br/><br/>“Third Master, have you seen the photos?” The person on the line was using the voice changer.<br/><br/>Kevin Clark was frosty and his voice turned cold: “Stop skirting around the issue.”<br/><br/>The other person laughed a little and said: “Daisy Zane is flirting with William Lane behind your back at the film set. Is a woman like this worth Third Master’s protection?”<br/><br/>“It’s not your place to comment on my wife.” Kevin Clark said coldly, “A tortoise who doesn’t even dare to use his true voice even has the guts to comment on my wife. Control your mouth. If I hear another word insulting her, I won’t let you get away with it, no matter who you are, no matter where you are.”<br/><br/>After he finished, Kevin Clark hung up the phone and sent the phone number to Juan Wright. He asked him to find out who this person is.<br/><br/>Then, he checked the time and continued to make a call to Daisy Zane.<br/><br/>“Little girl...”\t\t\t\t\t\t</div>", "images": {}, "success": true}