{"id": 682, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15244217.html", "title": "Chapter 642 - 642: Extra Nineteen: Ink Dot Plum Scent (Part Seventeen)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 642 - 642: Extra Nineteen: Ink Dot Plum Scent (Part Seventeen)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 642: Extra Nineteen: Ink Dot Plum Scent (Part Seventeen)<br/><br/>Amelia Smith was already somewhat weak. After waking up and crying for a while, she fell asleep again.<br/><br/>When she woke up again, it was already past noon.<br/><br/>“Awake?” William Lane touched her face.<br/><br/>Amelia’s eyes were a bit dry due to crying before falling asleep. She blinked, “Have you been here the whole time?”<br/><br/>“Mm.”<br/><br/>“How about the company and the research institute?” Amelia raised her left hand and touched her eyes. The IV needle had already been removed.<br/><br/>“They’re okay.” William Lane said, “Roy Madison and Harton Clark are at the research institute. My father is handling the company, and if he doesn’t want to, Lila Campbell can help as well.”<br/><br/>“Miss Lane is really busy.” Amelia commented.<br/><br/>William Lane smiled, “Do you want to eat something?”<br/><br/>“Yes,” Amelia said, “I’m a bit hungry now.”<br/><br/>William Lane sent a message to order food: “I’ve asked someone to buy it. Wait for a while.”<br/><br/>The food arrived quickly. Since Amelia had not eaten in a long time, they bought easily digestible meals.<br/><br/>The small table was set up on the bed, and Amelia sat up with her left hand holding a spoon, ready to eat some porridge.<br/><br/>Yet, her spoon was soon taken away by William Lane, as was the porridge.<br/><br/>William Lane scooped some porridge, blew on it, and brought it to her lips.<br/><br/>Amelia looked at him and slowly pursed her lips.<br/><br/>“What’s wrong? Do you think the porridge I’m feeding you is poisoned?” William Lane asked.<br/><br/>Amelia glanced at him and then at the porridge, “What if it is?”<br/><br/>William Lane was speechless, staring at her.<br/><br/>Amelia smiled, “I’ll eat by myself.”<br/><br/>“Hmph, no way.” William Lane said coldly and forcefully, “Open your mouth.”<br/><br/>With no other choice, Amelia obediently opened her mouth.<br/><br/>Young Master Lane was pleased after feeding her the porridge.<br/><br/>After eating a small bowl of porridge, Amelia couldn’t eat any more. William Lane tidied up and put away the food, lowered the small table, and poured her a glass of water.<br/><br/>Amelia held the glass in her left hand and took small sips, “Aren’t you eating?”<br/><br/>“In a while.” William Lane took out a small hairband from nowhere, “First, let me tie your hair.”<br/><br/>“Is it very messy?” Amelia asked.<br/><br/>“Not too messy.” William Lane said, “Just the normal mess.”<br/><br/>Amelia: “......”<br/><br/>“How can that be?” Olivia Lane looked up at Charlotte Lane, “I’m very smart.”<br/><br/>Charlotte Lane laughed lightly then looked at Amelia Smith, “What did the doctor say?”<br/><br/>” Just a mild concussion, I’ll be discharged from the hospital in two days,” Amelia Smith said, “Thank you, Miss Lane, for making the trip.”<br/><br/>“Just call me Charlotte,” Charlotte Lane touched Olivia’s face, “We are family, no need to be so polite.”<br/><br/>Olivia Lane watched Amelia Smith nod agreement.<br/><br/>Amelia felt a little embarrassed by Olivia’s stare and her face started to turn red.<br/><br/>Just then, William walked over and immediately covered Olivia’s eyes, “What are you doing? I already said you can’t look.”<br/><br/>Olivia Lane held William Lane’s wrist, “Brother, when did you become so stingy? Our sister-in-law is much more generous than you.”<br/><br/>Amelia Smith and William Lane exchanged a glance, then quickly looked down.<br/><br/>Charlotte Lane raised her eyebrows, a faint smile in her eyes.<br/><br/>“Sister-in-law, can you control my brother? He’s bullying me.” Olivia Lane cried out.<br/><br/>“No wonder you found a backer.” William Lane let her go.<br/><br/>Olivia Lane moved closer to the bed, gently holding Amelia Smith’s right hand. Her mission today was to help her brother woo a wife and let her feel the kindness of the Lane family, “One of my many strengths is knowing how to cling to powerful figures.”<br/><br/>“You’re quite pleased with yourself.” William Lane said.<br/><br/>Amelia Smith felt the warmth in her hand, her trembling eyelashes hinting at the warmth in her heart.<br/><br/>However, with the arrival of Kevin Clark and Hugo Clark, her warmth was immediately replaced by nervousness.<br/><br/>Hugo Clark was not a very expressive person and rarely smiled.<br/><br/>Kevin Clark had an intimidating appearance. Except when looking at Charlotte Lane tenderly, he seemed very distant when looking at others.<br/><br/>Noble and unapproachable, his aura was overwhelming.<br/><br/>William Lane introduced him.<br/><br/>Amelia Smith greeted them nervously, “Third Master, Young Master Clark.”<br/><br/>William Lane sat on the other side of the bed and touched Amelia’s head, “No need to be so polite with them. This one is my brother-in-law.”<br/><br/>Kevin Clark, considering that Amelia Smith was present, saved face for William Lane.<br/><br/>“As for him...” William Lane looked at Hugo Clark, “He’s my enemy.”<br/><br/>Hugo Clark: “......”<br/><br/>Olivia Lane ignored them and played with Amelia Smith’s hand.<br/><br/>Charlotte Lane and Kevin Clark both smiled slightly.<br/><br/>Amelia Smith’s eyes circled around, observing their reactions. She then looked at Olivia Lane.<br/><br/>Olivia Lane met her gaze with a pitiable and helpless look.<br/><br/>Amelia Smith smiled at her sympathetically.\t\t\t\t\t\t</div>", "images": {}, "success": true}