{"id": 687, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15244222.html", "title": "Chapter 647 - 647: Side Story Twenty-Four: Ink-Dot Plum Fragrance (22)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 647 - 647: Side Story Twenty-Four: Ink-Dot Plum Fragrance (22)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 647: Side Story Twenty-Four: Ink-Dot Plum Fragrance (22)<br/><br/>“What are you doing?” Like a frightened rabbit, Amelia Smith pressed her left hand against William Lane’s shoulder, trying to push him away. “You said you wouldn’t do anything.”<br/><br/>William Lane gently gripped her right wrist, preventing her right arm from moving.<br/><br/>“I also said that I would inform you in advance if I wanted to do something.” William Lane pinched her face, “I’m informing you now.”<br/><br/>“I don’t agree.”<br/><br/>“I said I would inform you, I didn’t say I needed your agreement.” William Lane laughed.<br/><br/>Amelia Smith: “...you, how can you be so shameless.”<br/><br/>“Teach you a lesson.” William Lane removed her hand from his shoulder and moved closer to her. “Don’t trust a man’s words.”<br/><br/>“You...”<br/><br/>William Lane’s hand went around to the back of her neck, supporting her as he kissed her, silencing her words.<br/><br/>Amelia Smith was too tense, her body limp, but the left hand gripping the quilt kept tightening.<br/><br/><br/><br/>Gradually, she could not breathe, as if drowning.<br/><br/>She let out a soft hum, and William Lane let her go, kissing her moist lips twice before burying his face in her neck.<br/><br/>One minute, two minutes passed. Amelia Smith listened to William Lane’s unsteady breathing, and gently moved her right wrist, which he still held. “Elder brother?”<br/><br/>“Hmm?” William Lane’s voice was hoarse, filled with heavy desire.<br/><br/>“You, you...” Amelia Smith swallowed nervously. “Aren’t you...going to continue?”<br/><br/>William Lane bit her neck lightly.<br/><br/>It wasn’t heavy, but Amelia Smith still let out a quiet cry.<br/><br/>William Lane kissed the place he had bitten again: “It’s not a safe day, and we don’t have anything prepared at home. If we continue, you might get pregnant.”<br/><br/>“I, I...” Amelia Smith wanted to hide herself again, but William Lane was pressing down on her, so she couldn’t hide. “How...how do you know?”<br/><br/>“We live together, how could I not know?” William Lane replied.<br/><br/>Amelia Smith’s eyes darted around in the darkness, remaining silent for a while before finally speaking: “Don’t you...want a child?”<br/><br/>“I just want to raise you.” William Lane propped himself up and kissed her. “When you want one, we can discuss it.”<br/><br/>Amelia Smith looked down: “Thank you, elder brother.”<br/><br/>“There’s nothing to thank me for.” William Lane got up, stood by the bed, and tied the belt of his sleeping robe.<br/><br/>“Where are you going?” Amelia asked.<br/><br/>“Taking a shower.” William Lane covered her with the quilt. “You sleep first.”<br/><br/><br/><br/>The sunlight outside was good, filling the room with a clean, bright scent.<br/><br/>Amelia Smith stared blankly for a moment before she reached out and felt for someone beside her, but there was no one there.<br/><br/>She propped herself up and looked all around the room, but there was no one in sight.<br/><br/>She then glanced at the time on the bedside table.<br/><br/>It was 9:30 already.<br/><br/><br/><br/>“...........”<br/><br/>Indeed, resting days were just a waste of time.<br/><br/>Amelia Smith sat up and noticed a sticky note affixed to the head of the bed, with a small red flower next to it.<br/><br/>The note read: [I am going to the Research Institute. Come downstairs for breakfast when you wake up. The small red flower is a reward for you. I hope Amelia Smith will be happier today than yesterday.]<br/><br/>Amelia Smith held the note for a while and picked up the flower, then she laughed.<br/><br/>Today was indeed better than yesterday.<br/><br/>Because of her arm injury, Amelia Smith was ordered by William Lane to rest at home, her carving knives, even the backup ones, were confiscated.<br/><br/>He even requested leave for her from the school.<br/><br/>Amelia Smith could only read at home to cushion her anxiety.<br/><br/>Not learning any new knowledge, not practicing skills, and not earning any money all caused her anxiety.<br/><br/>So, she sat at the railing on the second floor, stretching her legs while reading a book.<br/><br/>Life was supposed to be peaceful, but half an hour before lunch, Andrew Lane and Sophie Ortiz arrived.<br/><br/>Amelia Smith was sitting upstairs, stretching her legs while reading a book. After a while, she switched legs. As soon as she placed her leg over the other, she caught a glimpse of someone standing in the living room downstairs out of the corner of her eye.<br/><br/><br/><br/>She looked up from her book and stared harder at the figure.<br/><br/>Not knowing when they arrived, Andrew Lane and Sophie Ortiz stood in the living room, looking up at her.<br/><br/>For a brief moment, it was as if a bolt of lightning had struck her, cleaving her in two.<br/><br/>It seemed like zombies had eaten her brain, and all the air in her lungs was sucked out.<br/><br/>She stared at them wide-eyed for a moment, immediately put her leg down, stood up properly, and straightened her clothes.<br/><br/>She felt fortunate to have changed out of her pajamas after hesitating a few seconds when she woke up.<br/><br/>After composing herself, Amelia Smith snapped back to her senses, hurried downstairs, and almost tripped on her foot on the stairway.<br/><br/>“Slow down,” Sophie Ortiz said softly.<br/><br/>Amelia Smith stood obediently in front of Andrew Lane and Sophie Ortiz, bowed and said, “Chief Lane, Teacher Ortiz.”\t\t\t\t\t\t</div>", "images": {}, "success": true}