{"id": 680, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15244215.html", "title": "Chapter 640 - 640: Extra Seventeen: Ink Dot Plum Scent (Part Fifteen)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 640 - 640: Extra Seventeen: Ink Dot Plum Scent (Part Fifteen)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 640: Extra Seventeen: Ink Dot Plum Scent (Part Fifteen)<br/><br/>Amelia Smith leaned against the car window, her eyes shut and her face deathly pale. She tried hard to appear calm, not wanting to lose face, but her condition betrayed her.<br/><br/>She was terrified, fearing death and fearing that she would never see William Lane again.<br/><br/>Upon seeing her like this, Bella Reid snorted in derision, calling her “useless”.<br/><br/>Amelia carried on as if she didn’t hear her, not reacting at all.<br/><br/>A few minutes later, there were fewer vehicles on the road.<br/><br/>Amelia sat up and looked outside, her eyelashes drooping as she glanced at Bella in the driver’s seat.<br/><br/>But just as she was about to shift, Bella suddenly cursed under her breath, speeding up the car.<br/><br/>Amelia’s body jolted against her seat, but she quickly composed herself and turned to look back.<br/><br/>There were vehicles following them.<br/><br/>Their speed was also high, closing the distance only to have it widened again.<br/><br/><br/><br/>And it wasn’t just one car.<br/><br/>Amelia kept looking back, finally able to make out the license plate number of the car catching up to them. It was William Lane’s car.<br/><br/>Upon seeing that license plate number, Amelia’s heart tightened suddenly, tears she’d been holding back fell from her eyes.<br/><br/>She turned her head and wiped her tears on her shoulder.<br/><br/>By the time she tried to look back again, William’s car had already caught up.<br/><br/>Bang —<br/><br/>The car was hit, Bella turned the steering wheel, and quickly straightened the car again.<br/><br/>The car swayed, and inertia threw Amelia onto her seat, hitting her head.<br/><br/>Everything spun in front of her eyes, and it took her a moment to recover. She tried to struggle her way up, but the car was driving so erratically, swaying left and right. Her arms were still tied behind her back, so she couldn’t get up.<br/><br/>William wanted to force the car to stop, but worried for Amelia in the car, and the high speed they were traveling at, he didn’t dare to ram too hard.<br/><br/>He could only scrape against the car slightly.<br/><br/>But Bella was determined to shake him off.<br/><br/>Knowing that he didn’t dare to hit hard, she took advantage of a gap, accelerating away.<br/><br/>With the car no longer swaying, Amelia finally managed to sit up.<br/><br/>Her tied-up hair was completely disheveled.<br/><br/>Covered in sweat, she sat up on the back seat behind the driver, turned around, and saw William giving chase again.<br/><br/>She watched as the distance slowly closed, and just as William was about to catch up, she took her gaze away and sat upright.<br/><br/>Then she took a deep breath, and her hands, bound behind her back, forcefully raised up.<br/><br/><br/><br/>Amelia Smith laid motionless inside the car.<br/><br/><br/><br/>With red-rimmed eyes, William Lane dove into the car, kneeled on one leg on the seat, bent over and gently lifted Amelia Smith: “Amelia, Amelia.”<br/><br/>Amelia Smith’s forehead was scraped, and her face was bruised, her body was bloody everywhere. Hearing his voice, her eyelid moved and she weakly managed to open her eyes and say, “Brother.”<br/><br/>“It’s me.” Before William Lane had the chance to check her injuries, he just wanted to get her out of the car first. However, Amelia Smith’s leg was jammed between the copilot’s seat and the door.<br/><br/>The car’s roll had dented the door, somehow Amelia’s leg got trapped over there.<br/><br/>William Lane tried to move it but it was immobile.<br/><br/>At this moment, the Lane family’s people had arrived.<br/><br/>The road was sealed off, a safe distance was established and Bella Reid was captured.<br/><br/>James Lane ran over to them and pulled William Lane: “Young Master, the car is going to explode.”<br/><br/>“Get something!” William Lane shouted, “Pry that side open!”<br/><br/>James Lane immediately ordered his men to get something, “Young Master, I’ll pry the door open, you get out of here.”<br/><br/>William Lane ignored him, holding Amelia Smith, and soothingly patting her head: “It’s okay, don’t be afraid, don’t be scared.”<br/><br/>Amelia Smith slowly grabbed the corner of William Lane’s clothes with her left hand and weakly said, “Brother, brother, leave first.”<br/><br/>In the midst of his panic, noticing Amelia Smith’s fear, he gently kissed her forehead, “It’s alright, we’ll leave together.”<br/><br/><br/><br/>Amelia Smith’s consciousness was gradually becoming blurred, but she still tried her best to shake her head.<br/><br/>She wanted to say something and tried hard to talk, but no sound came out.<br/><br/>Tears kept falling from her eyes incessantly.<br/><br/>William Lane wiped her tears for her, “Amelia, it’s alright. Don’t sleep, hold on for just a little while, just a little while.”<br/><br/>The tools came, and James Lane started prying the door.<br/><br/>“One minute, James Lane, if it doesn’t open in one minute, you leave immediately,” William Lane suddenly commanded, “I command you!”<br/><br/>James Lane was stunned, for the first time he didn’t respond to William Lane’s words, and started prying the door.<br/><br/>Luckily the door didn’t take much effort to pry open.<br/><br/>“Young Master, let’s go!” James Lane instructed.<br/><br/>William Lane immediately carried Amelia Smith out of the car and began retreating to a safe distance while holding her.<br/><br/>Just as they had barely run a few steps, the car exploded.<br/><br/>Boom——<br/><br/>Jame Lane instinctively shielded William Lane from the explosion.<br/><br/>Reaching a safe distance, William Lane placed Amelia Smith onto a car that hadn’t been impacted, and then immediately pulled James Lane over to examine his back.<br/><br/>Seeing that he was alright, he didn’t utter a word, but got into the car.<br/><br/>James Lane also quickly got behind the wheel and drove to the hospital.\t\t\t\t\t\t</div>", "images": {}, "success": true}