{"id": 684, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15244219.html", "title": "Chapter 644 - 644: Extra Twenty-One: Ink Dot Plum Scent (Nineteen)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 644 - 644: Extra Twenty-One: Ink Dot Plum Scent (Nineteen)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 644: Extra Twenty-One: Ink Dot Plum Scent (Nineteen)<br/><br/>Amelia went to see Lily, but William Lane didn’t follow her in, he waited outside for her.<br/><br/>Daniel left, but after a while, he came back and looked at Roy Madison waiting by the entrance and said: “Let’s talk.”<br/><br/>Roy Madison looked up at him, feeling that this kid was really interesting: “What do you want to talk about?”<br/><br/>“Chat about you and my sister.” Daniel said.<br/><br/>“What if I don’t want to talk to you?” Roy said.<br/><br/>Daniel’s face darkened.<br/><br/>William Lane smiled and said, “Go over there and don’t disturb your sister.”<br/><br/>Daniel followed him.<br/><br/>Inside the ward, Amelia sat on a chair beside the bed.<br/><br/>Seeing Amelia, Lily sat on the bed and happily said: “Wang Di, your brother told me that you asked someone to get me a hospital bed.”<br/><br/><br/><br/>“Yes.” Amelia hasn’t been home for two or three years, but she sends Lily some money every two months.<br/><br/>Lily looked much older than Amelia remembered, possibly due to illness and torment, or maybe Max’s wastefulness, she aged quickly.<br/><br/>She was actually two or three years younger than Max, but now she seemed even older than him.<br/><br/>“How do you feel?” Amelia asked.<br/><br/>“The doctor prescribed a new type of elixir, it’s very effective.” Lily said, “He said that although it’s difficult to cure completely, proper care and medication won’t have too much impact on my body.”<br/><br/>“Yes.” Amelia said, “Take good care of yourself in the future.”<br/><br/>“I will.”<br/><br/>After not seeing each other for a long time, and recalling the past, they didn’t know what to say to each other.<br/><br/>After a moment of silence, Lily asked, “Wang Di, do you know what Daniel is doing in Imperial Capital?”<br/><br/>Amelia looked at her and paused for a moment: “I don’t know. We rarely talk.”<br/><br/><br/><br/>“Amelia...” Lily looked at her and said, “What do you mean?”<br/><br/>“Mom...” Amelia swallowed, trying to make her voice sound normal. “You and Max Smith gave birth to me, and no matter what, you raised me for thirteen years. I will repay the favor.”<br/><br/>“Amelia, why are you saying this?” Lily’s expression became more and more painful.<br/><br/>Amelia looked down and whispered, “When I was fourteen...Max Smith wanted to sell me off, and you knew about it.”<br/><br/><br/><br/>“I knew about it, but I stopped it, I really did.” Lily said, “You are my flesh and blood, how could I do such a thing?”<br/><br/>“But in the end, you consented.” Amelia’s voice trembled a bit, “I heard your conversation that night, and how else do you think I ran away the next day?”<br/><br/>“Amelia... I, I... ”<br/><br/>“I can understand your favoritism.” Amelia said, “You love your son, and for us, especially for me, the daughter who was born with so much disappointment, it’s natural to be unwanted. But...”<br/><br/>Amelia raised her hand and gently wiped the tears from her face, “I was only fourteen at the time. You sold me to that man, knowing what would happen to me? Even our neighbors, who watched me grow up, couldn’t bear to treat me like that.”<br/><br/>Lily suddenly covered her face and cried.<br/><br/>“This time you came to the Imperial Capital, Max Smith called me to your inn.” Amelia said.<br/><br/>Lily took her hand and looked at her, “I didn’t know about this time, I really didn’t know. Amelia, believe me, I really didn’t know.”<br/><br/>“I believe you.” Amelia said.<br/><br/>“Then where is Max Smith?”<br/><br/>“You’ll see him.” Amelia looked at Lily for a while and then wrote down a number for her using the pen and paper on the hospital bedside table, “You should cooperate with the doctors in the hospital. If you need anything, call me.”<br/><br/>When she finished, Amelia stood up.<br/><br/>Lily seemed to sense that Amelia might never see them again, so she immediately grabbed Amelia’s arm.<br/><br/><br/><br/>Her grip was right on the wound, and Amelia winced.<br/><br/>“Amelia! I was wrong, I was really wrong.” Lily tightened her grip, “I will make it up to you, I will make it up to you in the future.”<br/><br/>Amelia’s face turned a few shades paler, and she turned to look at her, “I’m past the point of needing to be made up for. I’ve grown up with too many times when I needed parental love, but you both ignored me. My only memory of you is when I was little, and you held me and taught me how to carve things. I was so happy, and every time I dreamed, I would dream about that moment. My mind was twisted, only remembering that scene, longing for it. But what was the purpose behind it? I was seven, and you made me carve things day and night because it could make money, and the money could buy new clothes for Evan Smith. He was four, and he had piles of new clothes, while at seven, I wore clothes that had been worn by my older sister and my second sister.”<br/><br/>Lily’s tears kept falling, and the hand that was holding Amelia’s arm slowly let go.<br/><br/>“If it hadn’t been for Grandma Skyler from our neighbor’s house, you guys wouldn’t even have wanted me to go to school.” Amelia suddenly felt that it was pointless to say these things and gently took a breath, “Our relationship can only be like this. I don’t expect anything from you, and you don’t expect anything from me. The most I can do is try to help financially, and that’s it.”\t\t\t\t\t\t</div>", "images": {}, "success": true}