{"id": 696, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15244231.html", "title": "Chapter 656 - 656: Side Story Thirty-Three: Ink-Dot Plum Fragrance (Thirty-One)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 656 - 656: Side Story Thirty-Three: Ink-Dot Plum Fragrance (Thirty-One)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 656: Side Story Thirty-Three: Ink-Dot Plum Fragrance (Thirty-One)<br/><br/>William Lane took Amelia Smith to apply the medicine.<br/><br/>After applying the medicine on her face, the doctor placed gauze on it.<br/><br/>Amelia Smith stared with her big eyes, with a small piece of gauze on each side of her face.<br/><br/>William Lane slowly applied the medicine on her hand, looked at her, and smiled.<br/><br/>“What are you laughing at?”<br/><br/>“I’m laughing because you’re adorable.” William Lane said.<br/><br/>Amelia Smith’s eyebrows twitched, and after a while, she asked, “Elder Brother, have you finished your business trip?”<br/><br/>“Yes, it’s all done.” William Lane said.<br/><br/>“You’re lying.” Amelia Smith said.<br/><br/>William Lane smiled, “The child has grown up, it’s not easy to fool anymore.”<br/><br/><br/><br/>Amelia Smith lightly kicked his leg, “I’m twenty now.”<br/><br/>“Yes, you’re twenty,” William Lane rubbed her wrist and said, “You’re a twenty-year-old child.”<br/><br/>“What if you haven’t finished?” Amelia Smith asked, “Lila has already asked someone to come, so why did you come yourself?”<br/><br/>“If it’s not finished, then we’ll deal with it next time.” William Lane said, “Remember to bring people from home when you go out, and let me know, okay?”<br/><br/>“Alright.” Amelia Smith said, “I was too anxious today, and my mind went blank, so I came here first.”<br/><br/>“With you like this, I’ll get scolded so much when I get home.” William Lane said.<br/><br/>“I’ll definitely be with my eldest sister here, so by the time I go back, it will all be fine.” Amelia Smith said.<br/><br/>William Lane clicked his tongue lightly.<br/><br/>“Hm?”<br/><br/>“I was planning to take you to the villa to stay for a couple of days.” William Lane admitted.<br/><br/>Amelia Smith was silent for a moment, then kicked him again with her foot.<br/><br/>William Lane moved forward, clamped her leg with his, and stopped her from moving. “Behave.”<br/><br/>“Oh.” Amelia Smith behaved for a while, watching William Lane gently massage her slightly swollen wrist and fingers. After a while, she whispered, “Elder brother, can you hold me, please?”<br/><br/>William Lane looked up at her, and as he did, Amelia Smith lowered her eyes, her ears flushed red.<br/><br/>William Lane smiled, leaned in, and held her on his lap, encircling her in his arms. First, he kissed her, then held her, massaging her wrist. “Were you frightened?”<br/><br/>Amelia Smith nodded obediently as she sat in his arms.<br/><br/>“Don’t be afraid,” William Lane said, “I’m here, there’s nothing to be afraid of.”<br/><br/><br/><br/>“The Richie Family is the richest family in Leicester City and has colluded with some dark forces,” James Lane reported, “In recent years, they have done many underhanded things secretly. And Harris Richie... has already been married three times.”<br/><br/>The four people looked at James Lane.<br/><br/>James Lane, like an emotionless robot, reported, “These three men all have one thing in common: they are very good looking and have no background.”<br/><br/>William Lane raised his eyebrows, “What about Adam Turner?”<br/><br/><br/><br/>“Adam Turner is also good looking,” Amelia Smith answered subconsciously.<br/><br/>William Lane turned to look at her, “Who’s not bad?”<br/><br/>Amelia met his gaze, “...You.”<br/><br/>“Am I just not bad?” William Lane asked again.<br/><br/>Amelia Smith glanced at Eleanor Smith and Christopher Willow, then held William Lane’s face with both hands, turning his head towards James Lane.<br/><br/>William Lane wanted to turn back.<br/><br/>Amelia Smith suddenly said, “Don’t turn back!”<br/><br/>Quite fierce.<br/><br/>William Lane chuckled, not turning back but looking at James Lane, “Continue.”<br/><br/>“Our people roughly asked Harris Richie. She seems to have some special preferences,” James Lane said, “She specifically picks men with no family background to marry, and once she gets tired of it, she divorces.”<br/><br/>Amelia Smith and Eleanor Smith both frowned.<br/><br/>“Based on what she said, she loves watching people’s emotions break down, so she loves stimulating people’s emotions,” James Lane continued, “She has used various means to stimulate a person’s emotions. It’s not the first time she has done something like this to Lady Smith.”<br/><br/>William Lane said, “I want substantial evidence.”<br/><br/><br/><br/>“Yes.”<br/><br/>“Take a closer look at the Richie Family.”<br/><br/>“Yes.”<br/><br/>“What about the guy named Adam Turner?” William Lane asked.<br/><br/>“He’s been at home,” James Lane said, “He locked himself in the room on the second floor.”<br/><br/>“Did he say anything?” Amelia Smith asked.<br/><br/>“Nope,” James Lane said, “When our people asked him, he kept saying he didn’t know and kept looking for his mother.”<br/><br/>“He can’t even talk without his mother,” Eleanor Smith said, “Eldest sister said he was honest. That’s not honest, that’s being an idiot.”<br/><br/>William Lane gave James Lane a look, and James Lane nodded, then left the room.<br/><br/>There was a moment of silence among the four people in the room, and then Eleanor Smith said, “This woman... is so perverted. The Turner Family is in big trouble with this kind of person.”<br/><br/>Amelia Smith looked at Sofia Smith, who was lying on the hospital bed, “Poor eldest sister and the child.”\t\t\t\t\t\t</div>", "images": {}, "success": true}