{"id": 691, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15244226.html", "title": "Chapter 651 - 651: Side Story Twenty-Eight: Ink Dot Plum Fragrance (Twenty-Six)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 651 - 651: Side Story Twenty-Eight: Ink Dot Plum Fragrance (Twenty-Six)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 651: Side Story Twenty-Eight: Ink Dot Plum Fragrance (Twenty-Six)<br/><br/>After being placed on the bed, Amelia Smith stared blankly at William Lane.<br/><br/>William Lane propped himself above her, moved closer, and kissed her eyes, “Why are you looking at me like this? Trying to provoke my guilt?”<br/><br/>“Really?” Amelia Smith asked.<br/><br/>“No,” William Lane turned off all the lights in the room, “I won’t feel guilty.”<br/><br/>In the darkness, all senses were infinitely magnified.<br/><br/>William Lane’s kiss landed on her lips, scorching and making her tremble.<br/><br/>William Lane sensed her tension and said softly, “Don’t be afraid. If you feel uncomfortable, tell me.”<br/><br/>Amelia Smith groped in the darkness to grasp William Lane’s hand; after holding his fingers, she mewled softly like a kitten, “Mm.”<br/><br/>......<br/><br/>William Lane exhausted all his patience and gentleness.<br/><br/><br/><br/>Fearing that Amelia Smith would be in pain, he took her to the bathroom after their struggles.<br/><br/>With red eyes, Amelia Smith clung to William Lane and refused to let go.<br/><br/>Finally, they both quickly rinsed together, then William Lane wrapped Amelia Smith in a bathrobe and brought her back to the guest room.<br/><br/>Once he placed her on the bed, Amelia Smith no longer clung to him.<br/><br/>She let go of him and burrowed into the quilt, refusing to come out.<br/><br/>William Lane found it amusing and touched her head through the quilt, “Does it hurt?”<br/><br/>“No,” Amelia Smith’s voice was small and muffled by the quilt.<br/><br/>“Are you uncomfortable?” William Lane asked.<br/><br/>“No,” Amelia Smith answered again.<br/><br/>“What’s wrong then?” William Lane, eyes dancing with laughter, “Oh, you’re shy.”<br/><br/>Movement came from within the quilt, and by William Lane’s judgment, Amelia Smith must have covered her ears.<br/><br/>Then, the shy and indignant voice of Amelia Smith came from inside the quilt, “Stop talking!”<br/><br/>“Come out first,” William Lane said, “It’s hot; do you plan to stay this way all night?”<br/><br/>Amelia Smith ignored him.<br/><br/>William Lane continued, “What, you plan to never see me again?”<br/><br/><br/><br/>William Lane didn’t let her go and brought her back to the master bedroom.<br/><br/>“I’m really not tired,” Amelia Smith said, “When have you ever seen me nap?”<br/><br/>William Lane nodded and stopped, cornering her at the entrance, looking down at her.<br/><br/>Amelia Smith pushed him with both hands, “What are you doing?”<br/><br/>“Are you really not tired?”<br/><br/>“Not tired.”<br/><br/>William Lane leaned closer, “Does it still hurt?”<br/><br/><br/><br/>Amelia Smith met his gaze for two seconds, then immediately raised both hands to cover her burning ears and face, “Why are you asking that!”<br/><br/>“Just a little worried.”<br/><br/>William Lane’s words were so sincere and concerned that Amelia Smith’s shyness faded a bit; she honestly said, “It doesn’t hurt.”<br/><br/>William Lane’s eyebrows slightly raised.<br/><br/>He knew Amelia Smith had no guard up against him.<br/><br/>As long as he wanted, he could hear any honest words from Amelia Smith’s mouth.<br/><br/>Even if it was something shy, she’d still say it.<br/><br/>William Lane looked down at her for a while, then lifted her and carried her to the bedroom.<br/><br/>“What are you doing?” Amelia Smith was confused.<br/><br/>William Lane kissed her ear and whispered two words gently, yet firmly.<br/><br/>“!!!!” Amelia Smith was surprised, “No, no, no, how... I just ate, I haven’t digested yet.”<br/><br/>“It’s been almost an hour since you ate, who are you trying to fool?” William Lane tossed her onto the bed.<br/><br/>Amelia Smith wanted to run, but William Lane held her legs down.<br/><br/><br/><br/>Amelia Smith looked at him, “You tricked me.”<br/><br/>“Yes,” William Lane admitted openly.<br/><br/>Amelia Smith was speechless, and after a while, she said, “I’ll never trust you again.”<br/><br/>“Try it,” William Lane nipped her lip.<br/><br/>...<br/><br/>From noon to evening, and from dawn until dusk.<br/><br/>Amelia Smith was carried out from the bathroom, lying on the bed, moving her fingertips slightly. She wanted to cry but felt that it would be too exhausting, so she closed her eyes and went to sleep straight away...\t\t\t\t\t\t</div>", "images": {}, "success": true}