{"id": 690, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15244225.html", "title": "Chapter 650 - 650: Side Story Twenty-Seven: Ink-Dot Plum Fragrance (Twenty-Five)", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 650 - 650: Side Story Twenty-Seven: Ink-Dot Plum Fragrance (Twenty-Five)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 650: Side Story Twenty-Seven: Ink-Dot Plum Fragrance (Twenty-Five)<br/><br/>After dinner, the family sat in the living room for a while before returning to their rooms.<br/><br/>William Lane had some matters to attend to, so he went to the study room.<br/><br/>An hour later, Amelia Smith came to knock on the door. She knocked three times, opened the door, and poked her head in.<br/><br/>William looked up, and after seeing her, he smiled first: “Not asleep yet?”<br/><br/>“Can I come in?” Amelia Smith asked.<br/><br/>“Come here,” William said.<br/><br/>Amelia Smith came in, closed the door gently, then walked to the desk and sat down across from William, “You’re not done yet?”<br/><br/>“Almost,” William responded, “Anything up?”<br/><br/>“Just a little thing.” Amelia Smith clutched the bank card in her hand.<br/><br/>“Hmm?”<br/><br/><br/><br/>Amelia Smith thought for a moment and said, “My mom has been discharged from the hospital, and her health is in good condition now. Thank you, brother. I went to the hospital yesterday to get the bill from the doctor. I know the doctor you helped me find and the connections you used can’t be repaid with money, but I can pay back the detailed fees on the bill. There are 20,000 here. I’ll give you back a part of it now. For the rest, I can pay it back slowly with interest. ”<br/><br/>William looked at her for a while, “Amelia... ”<br/><br/>“Elder brother, I’m not trying to sever ties with you or insist on separating everything between us.” Amelia Smith interrupted him, looking up at him with her bright eyes, “I just feel that this part of the money shouldn’t be your responsibility, even though this amount of money may not mean much to you.”<br/><br/>William looked into her eyes without speaking.<br/><br/>Amelia Smith continued, “If we had a good relationship, it wouldn’t matter if you paid the money. But we don’t. And not just in this case, I also don’t want you to be involved in any financial matters in the future. I want to take on it myself.”<br/><br/>William still did not speak.<br/><br/>Amelia Smith licked her lips, paused, and said, “Elder brother?”<br/><br/>William’s eyes moved, looking at her, “Why are you so far away from me?”<br/><br/>Amelia Smith blinked, confused, “???”<br/><br/>“Over here.”<br/><br/>“What are you going to do?” Amelia Smith asked.<br/><br/>“What can I do?” William said gently, “Come here, be closer to me.”<br/><br/>Amelia Smith got up, walked around the desk, and stood beside him.<br/><br/>William put his arm around her waist, made her sit on his lap, and kissed her on the cheek, “Now that you’ve given me the money, do you still have any for yourself?”<br/><br/><br/><br/>William said, “Take it. You decide how to use it. I’ll ask you if I need money.”<br/><br/>Amelia took the card, but she didn’t use any of the money on it, only used it to give William money.<br/><br/>William always had money, but whenever he needed to use it, he had to ask Amelia Smith first.<br/><br/>Even later when he collaborated with Kevin Clark on a project, they had almost reached an agreement, but in the end, William said, “I have no issue, but I need to consult my lady regarding the funds.”<br/><br/>After hearing this, Kevin Clark blacklisted all his contact information and ignored him for a week.<br/><br/>...<br/><br/>After living in the Lane family for two weeks, due to William’s ulterior motives, one night after Amelia Smith finished her evening classes at school, he took her back to his villa.<br/><br/>The whole Lane family, with Charlotte Lane and Kevin Clark coming back with their children every few days, was always lively.<br/><br/>But after returning to the villa, it felt especially quiet.<br/><br/>Amelia Smith stood in the entranceway, looking at the deserted living room, and didn’t want to go in.<br/><br/><br/><br/>“What’s wrong? Don’t recognize our home?” William squatted down to change her shoes.<br/><br/>Amelia Smith quickly squatted down as well, but William didn’t let her help.<br/><br/>Amelia Smith asked, “Why did we suddenly come back?”<br/><br/>“You don’t seem very happy about it,” William said.<br/><br/>“A little,” Amelia Smith admitted.<br/><br/>William smiled but didn’t say anything.<br/><br/>Amelia Smith had a late class that lasted until over nine o’clock, so when they got home, it was already past ten o’clock. The two went straight upstairs to rest after coming back.<br/><br/>Amelia Smith went to the master bedroom to take a bath, while William went straight to the guest room.<br/><br/>However, by the time Amelia Smith came out of the bath, William had already finished and was waiting for her at the bathroom door.<br/><br/>Amelia Smith was startled when she opened the door, “What are you doing here?”<br/><br/>William smiled warmly, then held her horizontally in his arms and walked into the bedroom, saying at the same time, “To answer the question you asked after coming home, why did we suddenly come back? Because I had ulterior motives and wanted to do something bad.”<br/><br/>Amelia Smith’s eyes widened, looking at him in surprise and anxiety.<br/><br/>William’s mouth curled up in a smile, “Of course, if you feel we can do it in the old mansion, we don’t have to come here.”<br/><br/><br/><br/>“No, we can’t! I can’t!” Amelia Smith gripped William’s bathrobe, her demeanor and strength as if she were about to fight him.<br/><br/>William smiled, “Alright, I understand.”\t\t\t\t\t\t</div>", "images": {}, "success": true}