{"id": 701, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15244236.html", "title": "Chapter 661 - 661: Side Story Thirty-Eight: Ink-Dot Plum Fragrance (Thirty-Six)", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 661 - 661: Side Story Thirty-Eight: Ink-Dot Plum Fragrance (Thirty-Six)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 661: Side Story Thirty-Eight: Ink-Dot Plum Fragrance (Thirty-Six)<br/><br/>Charlotte Lane stayed behind to deal with some follow-up matters, while William Lane drove Amelia Smith and her sister to the shopping mall to buy clothes for Sofia Smith.<br/><br/>After buying the clothes, they took the two of them back to the hospital.<br/><br/>When they arrived at the hospital, Sofia Smith had already woken up and was sitting up in bed.<br/><br/>The caregiver was chatting with her.<br/><br/>She replied intermittently.<br/><br/>Seeing Amelia Smith and the others, she said weakly, “You’re back?”<br/><br/>“Yeah.” Amelia Smith handed her the documents, “See if anything is missing?”<br/><br/>Sofia Smith took them and looked at the man behind Amelia Smith, holding some things.<br/><br/>William Lane put the things under the bed and looked at her: “Hello, my name is William Lane.”<br/><br/>Sofia Smith moved her pale lips: “Hello.”<br/><br/><br/><br/>After speaking, she still looked at him, her eyes slightly confused, as if asking: Who are you? And who do you have a relationship with here?<br/><br/>“Big sister.” Amelia Smith said, “He...”<br/><br/>William Lane looked at Amelia Smith, intending to hear how she would introduce himself.<br/><br/>“He...” Amelia Smith looked at him, “Sister, he is my brother-in-law, several years older than you.”<br/><br/>William Lane gritted his teeth, staring kindly at Amelia Smith.<br/><br/>Eleanor Smith chuckled.<br/><br/>Sofia Smith’s pupils shrank slightly. She was very surprised inside, but couldn’t muster the strength to be surprised. Her face was pale, as if there weren’t any huge emotional fluctuations. After a while, she looked at William Lane and asked, “Did you help Amelia change her name?”<br/><br/>William Lane pressed down on Amelia Smith’s little head, which was giggling, and told Sofia Smith, “Yes.”<br/><br/>“So it was you.” Sofia Smith’s eyes carried a faint smile.<br/><br/>“Hmm?” William Lane became a bit interested and asked, “It seems... there are some legends about me.”<br/><br/>Sofia Smith glanced at Amelia Smith, her lips slightly rising: “Amelia told me. She said there was a very handsome big brother who helped her, and she...”<br/><br/>“Sister!” Amelia Smith interrupted in time.<br/><br/>William Lane tilted his head, his hand wrapping around her neck, holding her mouth shut, and said to Sofia Smith, “Please continue.”<br/><br/>Amelia Smith tried to pull his hand down but couldn’t. She glared at her sister.<br/><br/>Sofia Smith simply ignored her gaze: “She said the big brother was very nice, and if there was a guy like him, she would still be willing to get married.”<br/><br/>William Lane’s eyelashes trembled slightly, and the laughter in his eyes spread slowly.<br/><br/><br/><br/>“I...” William Lane felt a little uncomfortable in his heart, grabbing her hand, “I had been abroad for those years and rarely came back.”<br/><br/>Amelia nodded, “But now we’ve met again, and we’re together.”<br/><br/>“Mm.” William Lane kissed her face.<br/><br/>Amelia felt his lips burning hot, and after a while, she moved.<br/><br/>William Lane immediately held her waist and whispered, “Don’t move.”<br/><br/>Amelia’s face flushed even more, her eyes fluttering aimlessly, “I, I’ll help you.”<br/><br/><br/><br/>William Lane raised his eyebrows, smiling at her, “How can you help?”<br/><br/>Amelia stared at him, her eyes filled with mist, her blush spreading to her neck, looking as if she was about to cry from embarrassment, but still gazing at William Lane. After a moment, her small hand clumsily fumbled for his belt.<br/><br/>William Lane held her hand, his breathing becoming more rapid, and his voice growing raspier, “Amelia. There’s no need, it’ll get better after a while.”<br/><br/>Amelia blinked her beautiful eyes, clear and innocent, yet stubborn, “Are you sure?”<br/><br/>William Lane: “......” He suddenly wavered in his heart.<br/><br/>Seeing he didn’t move, Amelia slowly withdrew her hand.<br/><br/>William Lane once again held her hand, his voice rushed, “It’s fake.”<br/><br/>And then he kissed Amelia Smith again.<br/><br/>...<br/><br/>When Sofia Smith recovered a bit, Amelia and Eleanor Smith both left.<br/><br/>William Lane left someone in Wakefield County to protect Sofia from the Turner family causing trouble.<br/><br/>Hedrick Skyler, Harris Richie, and Enzo Thiago were all arrested, but the Turner family was left untouched.<br/><br/>As for what would happen to the Turner family and what would happen between Sofia and Adam Turner, that was for Sofia to decide.<br/><br/><br/><br/>Back in Imperial Capital, Amelia began working on jade carving with Charlotte Lane during her spare time at school and at the Dance Association.<br/><br/>Charlotte was quite busy, so the two of them usually met in the evening.<br/><br/>Sometimes, they would work late into the night.<br/><br/>When that happened, Kevin Clark and William Lane would take them away one by one.<br/><br/>But there were also times when Kevin and William would not dare to make a move with just a glance from Charlotte.<br/><br/>Amelia was always obedient in front of William, and he could easily take her away.<br/><br/>However, Charlotte was much more authoritative; if she didn’t want to go, Kevin and William had no recourse.<br/><br/>So... whenever Charlotte was being stubborn, Kevin and William would play Rock Paper Scissors at the entrance. Whoever lost had to go in and fight...\t\t\t\t\t\t</div>", "images": {}, "success": true}