{"id": 709, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15244244.html", "title": "Chapter 669 - 669: Extra Forty-Six: Why Are You Becoming More And More Clingy?", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 669 - 669: Extra Forty-Six: Why Are You Becoming More And More Clingy?</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 669: Extra Chapter Forty-Six: Why are you becoming more and more clingy?<br/><br/>Ethan Clark and Noah Clark had already started kindergarten, but since it was the summer vacation, they only attended the Court Music Academy and Dance Association intermittently, spent some time practicing writing and arithmetic, and had nothing much else to do, living quite leisurely.<br/><br/>The next day, after Kevin Clark finished his early morning meeting and arranged everything, he went home to pick up these two children.<br/><br/>By the time he got home, someone had already packed their suitcases.<br/><br/>Christopher Clark helped them pack.<br/><br/>He was free at home today, so he conveniently packed their suitcases.<br/><br/>Christopher Clark had skipped a grade in junior high and was now a high school senior, essentially a young adult.<br/><br/>Except for the time when he was seven or eight years old and didn’t grow much, he shot up afterward, and now he’s almost six feet tall.<br/><br/>According to James Collins, it’s because Charlotte Lane stopped avoiding him, his mood improved, resulting in better nutrient absorption, hence his rapid growth.<br/><br/>His shoulder-length curly hair was no longer there, he had short hair since junior high, and as he grew older, the curls in his hair gradually straightened out.<br/><br/>Except for waking up in the morning with some curls, on usual days, after grooming, one could hardly see the curliness of his hair.<br/><br/><br/><br/>However, it’s still a little bit on the yellow side.<br/><br/>But because his skin is fair, he is particularly attractive.<br/><br/>His appearance is mostly similar to Kevin Clark and Edward North, and he looks even more like Kevin Clark.<br/><br/>But now that he’s grown up, some traces of Edward Kirsten could be seen in his brows and eyes.<br/><br/>This made Edward North very frustrated.<br/><br/>His son didn’t take after his wife at all, but inherited some aspects of Edward Kirsten’s appearance.<br/><br/>As soon as Kevin Clark walked into the front hall and saw him, he asked, “When did you come back?”<br/><br/>He had sent him to M Continent with James Collins to see Alozon Kirsten a few days ago.<br/><br/>Even though he was already in senior year and seemed like an adult, he was still underage and needed someone to accompany him whenever he traveled.<br/><br/>“Dad,” Christopher Clark greeted first after rising from the sofa, then answered his question, “I just got home an hour ago.”<br/><br/>Kevin Clark nodded, looked at Ethan Clark with a gloomy face and the very happy Noah Clark with their small suitcases, and then asked Christopher Clark, “How are they?”<br/><br/>By “they”, he naturally meant Alozon Kirsten and Robert Kirsten.<br/><br/>“They’re doing well.” Christopher Clark didn’t elaborate.<br/><br/>Kevin Clark nodded, not asking any further questions, “Did you pack their luggage?”<br/><br/>Christopher Clark nodded in agreement.<br/><br/>Ethan Clark glanced at Kevin Clark and muttered quietly, “Big brother is the best.”<br/><br/>The implication was that daddy was not as good as big brother.<br/><br/>Christopher Clark just smiled.<br/><br/>Kevin Clark ignored him and said to Christopher Clark, “We’re going to the drama crew, do you want to come?”<br/><br/><br/><br/>Christopher Clark looked at him and hesitated before saying, “Dad, after all these years, why are you becoming... more...” he didn’t finish his sentence, although Kevin Clark knew what he wanted to say, “What? You have any complaints?”<br/><br/>“I wouldn’t dare.” Christopher Clark said with a smile, “Not for now. I haven’t seen grandfather and grandmother since I got back, I’ll go see them first before I come over.”<br/><br/><br/><br/>His peck landed firmly on Kevin Clark’s hand instead.<br/><br/>&gt;This made him so mad that he kept wiping his mouth with a napkin.<br/><br/>Onlookers did not dare to get too close, but they watched from a distance and soon started to discuss in hushed voices.<br/><br/>“Third Master is still so handsome.”<br/><br/>“Such a loving couple—they’ve been together for so many years and they still look so much in love. That’s the kind of love I covet.”<br/><br/>“Ahh! They must kiss a lot in their daily life, it looks so natural. I don’t mind this kind of dog-food (public display of affection, PDFA) at all!”<br/><br/>“The sight of them standing together is too pleasing to the eye.”<br/><br/>“Their little prince and princess are so good-looking too.”<br/><br/><br/><br/>“This is my first time seeing the real Third Master, he’s even more suave and handsome than in pictures!”<br/><br/>...<br/><br/>Seeing their genuine surprise, Charlotte Lane’s eyes crinkled with laughter. “What brings you here so suddenly? Have you finished up at Ryan Easton’s place?”<br/><br/>“There are a few things left to be handled remotely.” Kevin Clark arranged for the children to stand properly, “Ethan missed you and kept insisting on coming over, so here we are.”<br/><br/>Ethan Clark’s mouth twitched at the side. He felt like he was being used as an excuse.<br/><br/>Charlotte Lane looked at him, knowing in her heart that he had probably done something again and was being punished. She decided to play along and tease him.<br/><br/>Ethan Clark immediately flashed a smile and nodded earnestly, “Yes, I missed you so much, Mother. I didn’t even sleep well last night.”<br/><br/>Although Ethan Clark always longed for freedom from Charlotte Lane’s exacting standards, as soon as he broke free, he would start to miss her.<br/><br/>Children always miss their mother.<br/><br/>Once, when he was having a great time at Allonzo Hobson’s place, he insisted that he wouldn’t go home.<br/><br/>Charlotte Lane decided to let him stay over.<br/><br/>Yet, the next morning Allonzo Hobson and Robinson Scott brought him back saying he had started looking for his mother early in the morning and had refused to eat anything.<br/><br/>In fact, Ethan had started missing her the night before but felt it was too late to kick up a fuss.<br/><br/>That day when he got back, he clung to Charlotte Lane all day, and then pondered over leaving after spending half the day with her.<br/><br/>All children are like that.<br/><br/>Charlotte Lane went along with his sentiment and looked at Kevin Clark, “So, only he missed me?”<br/><br/>Kevin Clark chuckled, “I missed you too, Madam.”<br/><br/>Ethan Clark shook his head and tried to send Charlotte Lane a warning look, only to have Kevin Clark hold down his head.<br/><br/>“Sister missed you too,” Ethan Clark, with his head still restrained, spoke up.<br/><br/>Noah Clark nodded and tried to get Charlotte Lane to pick her up, “Mother, carry.”<br/><br/>“In a little bit,” Charlotte Lane brushed her little face, “My clothes will get wrinkled. I will hold you after we finish shooting.”<br/><br/>Noah Clark obediently nodded and then touched Charlotte Lane’s clothes, “I like this. Can I keep it for when I grow up?”<br/><br/>“The clothes aren’t ours, but we can ask later,” Charlotte Lane’s voice was as cold as always, but contained a hint of warmth.<br/><br/>“Alright,” Noah Clark agreed happily.<br/><br/>But later on, though the wardrobe master did give Noah Clark the dress, it didn’t stay for long...\t\t\t\t\t\t</div>", "images": {}, "success": true}