{"id": 702, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15244237.html", "title": "Chapter 662 - 662: Side Story Thirty-Nine: Ink-Dot Plum Fragrance (Thirty-Seven)", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 662 - 662: Side Story Thirty-Nine: Ink-Dot Plum Fragrance (Thirty-Seven)</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 662: Side Story Thirty-Nine: Ink-Dot Plum Fragrance (Thirty-Seven)<br/><br/>As summer passed, the weather cooled down. Amelia Smith felt that it wasn’t long before winter arrived.<br/><br/>Sofia Smith’s health had fully recovered, and she went to her parents’ home for a while. She mentioned the divorce to the Turner family, but they kept refusing.<br/><br/>The Turner family of three would visit the Smiths almost once every two or three days, apologizing and saying nice things with a humble attitude.<br/><br/>Sofia locked her room door and refused to see them.<br/><br/>A few months passed without resolving the issue, and the Turner family eventually brought a sum of money to Max Smith.<br/><br/>As Max was about to accept the money, Sofia chased the Turners out with a broom in her hand.<br/><br/>Eleanor Smith visited home and learned about her elder sister’s situation, so she told Amelia about it.<br/><br/>Amelia discussed it with her elder sister and asked her to come to the Imperial Capital.<br/><br/>So, Sofia ended up in the Imperial Capital.<br/><br/>Amelia helped her rent an apartment and made sure she was settled in.<br/><br/><br/><br/>“Actually, there are many empty apartments available. There’s no need to rent one,” said William Lane, who was working late and wanted to eat noodles cooked by Amelia when he returned home.<br/><br/>So he accompanied Amelia in the kitchen while she cooked the noodles.<br/><br/>“Renting is more comfortable and carefree,” Amelia responded.<br/><br/>“You’re just being polite to me.” William said slowly, standing nearby.<br/><br/>“No one’s being polite to you.” Amelia didn’t look up from the noodles in the pot. “It’s my sister’s decision to live in the apartment. Even if it was my property, she might not want to live there.”<br/><br/>Amelia paused before saying, “Besides, I’ll buy my own house in the future. I’ll make big money and buy a big house.”<br/><br/>William smiled, “That’s good. I’ll stay home and take care of the kids while my wife supports me.”<br/><br/>Amelia suddenly smiled, “Not a bad proposal. You can be my little wife at home.”<br/><br/>William laughed and patted her head.<br/><br/>“My sister will also buy a big house,” Amelia said, “and find someone who truly loves her, so they can have a happy and warm home.”<br/><br/>“She will,” William agreed.<br/><br/>“It’s nice to think about our good lives in the future,” Amelia said with her eyes curved in a happy smile.<br/><br/>William leaned down and kissed her on the cheek. “What kind of job is your sister going to do when she arrives?”<br/><br/>“Probably something in the new media field,” Amelia responded. “She learns quickly and has seen the potential in it. It’ll be a great opportunity for her. Plus, Evan can help her during his spare time.”<br/><br/>“Does she need any help?” William asked.<br/><br/>Amelia looked at him with a pleasing smile, “Of course she’ll need help. Why wouldn’t we use such good connections?”<br/><br/>William also smiled, hugged her waist, and kissed her lips. “Just let me know whenever you need help.”<br/><br/>“Sure. I’ll share the profits with you when the time comes,” Amelia said.<br/><br/>William nodded, “It seems that my days as a little wife are not far away.”<br/><br/><br/><br/>William Lane stared back at him.<br/><br/>A few seconds later, Evan Smith admitted defeat, lowering his head and mumbling, “Brother-in-law.”<br/><br/>William Lane was happy, feeling refreshed.<br/><br/>Finally, someone younger than Amelia Smith called him brother-in-law.<br/><br/>...<br/><br/>This Chinese New Year, Amelia Smith had the most lively celebration in her life.<br/><br/>On the first day of the Chinese lunar year, she and William Lane went out to pay New Year visits.<br/><br/>On the second day, Charlotte Lane brought her children, making their home even more lively.<br/><br/>During these days of the Chinese New Year, William Lane also noticed that she was exceptionally happy, with a touch of childlike innocence in her joy.<br/><br/>At the end of February, a heavy snowfall occurred.<br/><br/>The entire Imperial Capital was covered in white.<br/><br/>Amelia Smith got up early intending to accompany Old Master Lane for a walk, but after washing and rinsing, she looked outside from the second floor and noticed that it was snowing.<br/><br/><br/><br/>Before William Lane came out, she had already run to the ground floor.<br/><br/>When William Lane went out, she had already rolled a snowball in the backyard.<br/><br/>William Lane quickly approached, pulled her up, dried her hands, put on gloves, a hat, and wrapped a scarf around her: “Aren’t you cold?”<br/><br/>“Not cold.” Amelia Smith’s half face was hidden under the scarf, leaving only her beautiful deer-like eyes exposed, sparkling.<br/><br/>“Your face is already red, and you still say you’re not cold.”<br/><br/>“I have a good constitution; I’m not cold.” Amelia Smith finished speaking and pulled William Lane further into the backyard, standing under a tree, “Brother, look, it’s blooming.”<br/><br/>White snow pressed on the branches, and a red plum blossom bloomed on the branch.<br/><br/>In the entire snowy world, it bloomed proudly.<br/><br/>“It turns out to be a plum blossom.” Amelia Smith said, “So beautiful.”<br/><br/>William Lane looked at her and smiled, “You didn’t know, did you?”<br/><br/>They had transplanted this tree in the spring. When Amelia Smith came to the old mansion, it was the end of summer, and all she saw was a tree with leaves. She didn’t pay too much attention to it at the time.<br/><br/>“When I saw it, it wasn’t flowering, so I couldn’t recognize it,” Amelia Smith honestly said. “I’ve only seen its flowers, not its leaves.”<br/><br/>“So you can recognize it when it blooms, but not when it doesn’t.” William Lane said.<br/><br/>Amelia Smith giggled, then suddenly took off her gloves and slipped her hand into William Lane’s clothes: “That’s right.”<br/><br/>William Lane shivered from her cold hand, but still held it firmly to warm it as Amelia tried to pull it out: “Still say you’re not cold?”<br/><br/>“Chilling.” Amelia Smith tried to pull her hand out.<br/><br/>William Lane held her hand firmly: “I have a good constitution; I’m not cold.”<br/><br/>Amelia Smith: “......”\t\t\t\t\t\t</div>", "images": {}, "success": true}