{"id": 714, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15244251.html", "title": "Chapter 674: Extra Fifty-One: The Older You Get, The More Spirited You Become.", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 674: Extra Fifty-One: The Older You Get, The More Spirited You Become.</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 674: Extra Fifty-one: The older you get, the more spirited you become.<br/><br/>Back at the hotel, swiping the card to open the door.<br/><br/>Once inside the room, Charlotte Lane noticed that the living room light was still off.<br/><br/>Usually, no matter where they were, if she was not home, Christopher Clark would always leave the living room light on, waiting for her to return.<br/><br/>Today, entering the room, it was completely dark.<br/><br/>As she slightly furrowed her brow, intending to gauge her surroundings, Arthur North suddenly wrapped his arms around her waist. With a swift motion, he pressed her against a wall and kissed her.<br/><br/>With her lips pried open, Charlotte Lane shivered slightly, clenching the clothes on Arthur North’s waist.<br/><br/>She held onto his clothes, trying to pull him away, but failed. After a while, she hummed lightly in protest.<br/><br/>“Arthur North...”<br/><br/>Arthur North gently bit her lips, he then drew back slightly and rested his forehead against hers.<br/><br/>There was no light in the room, complete darkness, only the moist warm breaths of each other.<br/><br/><br/><br/>Arthur North gently pecked her lips.<br/><br/>“The children...” Charlotte Lane tried to avoid him, but Arthur North held the back of her head, making her unable to move.<br/><br/>“I booked another room for them.” Arthur North caressed her face, kissing her cheek again.<br/><br/>“You...” Charlotte Lane felt a sense of danger from Arthur North.<br/><br/>A faint stern force was pressing onto her.<br/><br/>“Madam is too beautiful, it’s hard to resist,” said Arthur North, and he gave her eyes a kiss.<br/><br/>“Am I only beautiful today?” Charlotte Lane asked lightly.<br/><br/>“You’re beautiful every day. So, whenever you refuse me, I suffer,” Arthur North’s hand rubbed her waist. “Moreover, you are even more beautiful today, so captivating.”<br/><br/>Charlotte Lane chuckled lightly, “This isn’t the first time I dressed this way.”<br/><br/>“Last time, I wanted to, but those two kids were in the way.” Arthur North smiled.<br/><br/>“Well, you brought them here.”<br/><br/>“My fault.” Arthur North held Charlotte Lane against his neck and gently lifted her up, letting her legs wrap around his waist.<br/><br/>One hand supported her leg, the other held the back of her neck, kissing her delicately.<br/><br/>The ambiguity in the darkness began to intensify.<br/><br/>Arthur North, holding Charlotte Lane, walked a few steps. He inserted the hotel key card and turned on the light.<br/><br/>The whole room lit up.<br/><br/>Both Arthur North and Charlotte Lane closed their eyes uncomfortably.<br/><br/>When they opened their eyes again, a layer of mist was fogging Charlotte Lane’s eyes. Her face flushed, her thin lips swollen, stirring desire.<br/><br/>Arthur North gazed at her, his elongated pupils filled with desire. They were heating up, burning with a hint of red at the corners of his eyes.<br/><br/><br/><br/>He chuckled softly, carrying Charlotte Lane into the bedchamber.<br/><br/>He placed her on the bed and leaned over her.<br/><br/><br/><br/>The curtains in the room were slightly ajar.<br/><br/>When she opened her eyes, the first thing she saw was Kevin’s waist.<br/><br/>She observed him somewhat blankly for a while, then reached out to pinch him.<br/><br/>Kevin, resting on the head of the bed, a laptop on his lap and institute’s files in hand, helping Charlotte with her Research Institute affairs. Suddenly feeling a pinch at his waist, he gasped slightly.<br/><br/>As he turned his head, he caught a glimpse of Charlotte’s guilty hand and cold gaze.<br/><br/>Chuckling, Kevin touched her face, “Awake?”<br/><br/>Charlotte shrugged his hand away, closed her eyes and ignored him.<br/><br/>Kevin left the files and the computer on the bedside table and lay back. He held her in his arms and kissed her, “Little girl, do you know what you remind me of?”<br/><br/><br/><br/>Charlotte didn’t respond, but rubbed her head against his shoulder a bit.<br/><br/>“You’re particularly like a heartbreaker.” Kevin joked, “Can’t remember anything once you’re out of bed.”<br/><br/>Charlotte opened her mouth to bite his collarbone.<br/><br/>Kevin hugged her a little tighter, gently bit her earlobe, “Little girl, you’ve become fond of biting.”<br/><br/>Charlotte didn’t reply. She nestled in his arms for a while, then moved slightly, “Bathroom.”<br/><br/>“Alright.” Kevin slightly let her go, placing a peck on her eyes.<br/><br/>Charlotte got up, fastening the belt of her sleeping robe.<br/><br/>Last night Kevin had bathed her and dressed her in the sleeping robe. After a night’s sleep, the robe had loosened a bit.<br/><br/>After adjusting herself, she got off the bed.<br/><br/>After taking a few steps, she stood still in her tracks.<br/><br/>Kevin immediately got out of bed and walked over to her, “What’s wrong?”<br/><br/>Charlotte glanced at him, paused, and then said, “Nothing.”<br/><br/>Then she pressed her hand to her lower back and went into the bathroom.<br/><br/>Kevin watched as she rubbed her waist, his eyes flashed strangely.<br/><br/>He had been a bit over the top last night.<br/><br/>Once inside the bathroom, Charlotte locked the door. As she turned around to move inside, she noticed the torn cheongsam inside the laundry basket.<br/><br/>Instantly, a series of images flashed in her mind.<br/><br/>Last night, Kevin was particularly excited, probably due to some stimulus.<br/><br/>He used to show some restraint before, now he seemed increasingly ruthless.<br/><br/>Eventually, she couldn’t stand it anymore and tried to escape.<br/><br/>But she was pulled back in.<br/><br/>Charlotte threw a towel in the basket over the torn cheongsam.<br/><br/>This man...how come with age, he was becoming more vigorous.<br/><br/>Charlotte was yet to find out that Kevin was not just becoming more robust, but he had also developed a liking for ripping clothes...\t\t\t\t\t\t</div>", "images": {}, "success": true}