{"id": 719, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15253063.html", "title": "Chapter 679: Extra 56: Happy End Of Filming", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 679: Extra 56: Happy End Of Filming</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 679: Extra 56: Happy End of Filming<br/><br/>Charlotte Lane was shooting for another two days on the drama set, with just two more evening scenes left to film.<br/><br/>She went to the Research Institute during the day and returned to the film set in the evening.<br/><br/>She was running back and forth between the Institute and the film set, without time to go home.<br/><br/>The final night scene was a big one, and by the time they had finished, the sky was turning light.<br/><br/>Kevin Clark came to meet her, and George Dunn also showed up.<br/><br/>George Dunn had pretty much retired from the acting circle and gone home to inherit his family property.<br/><br/>He came over to see whether Charlotte Lane had wrapped things up today.<br/><br/>Director Morris was actually a little uncomfortable about Charlotte Lane wrapping up her scenes.<br/><br/>He didn’t know when they would work together again next time.<br/><br/>As a result, when George Dunn showed up, Director Morris suddenly felt even more emotional and got teary-eyed.<br/><br/><br/><br/>“Director Morris, acting like this, I would think you were possessed,” George taunted. “Where’s that vigor when scolding people?”<br/><br/>“Get lost.” Director Morris scolded him, “By the time you act again, you’ll have pretty much joined the “uncle” circle. What’s there to be happy about?”<br/><br/>“What’s wrong with the uncle circle? Uncles are even more charming,” George replied.<br/><br/>Director Morris glared at him and snorted, “We were supposed to make our way in the world together, but in the end, I’m the only one left. None of you are loyal.”<br/><br/>Charlotte looked at Director Morris for a while, and then asked the photographer nearby, “Did you get that?”<br/><br/>The photographer nodded: “Yes.”<br/><br/>“Mmm.” Charlotte Lane said, “Make sure to save it. After the movie is released, remember to share it.”<br/><br/>“Charlotte Lane, you’re being unreasonable now!” Director Morris’s already emotional state was instantly extinguished, and he immediately got fired up again.<br/><br/>Charlotte Lane raised her eyebrows, “So everyone can see just how ugly Director Morris looked when crying.”<br/><br/>“I...” Director Morris rolled up his sleeves, “We have to settle this issue once and for all today, or there will be no peace.”<br/><br/>Charlotte Lane stood beside Kevin Clark, eyeing Director Morris.<br/><br/>George grabbed Director Morris and laughed, “Calm down, calm down, you can’t beat her.”<br/><br/>“I...” Director Morris looked at George.<br/><br/>George Dunn nodded, “You really can’t beat her.”<br/><br/>Knowing when to back down, Director Morris straightened up and coughed lightly, “I won’t quarrel with you.”<br/><br/>Once their conversation was over, Kevin asked, “Want to go have breakfast together?”<br/><br/>“Sure.” George said.<br/><br/><br/><br/>“We can become more familiar with each other through more communication,” Alex smiled, “so I hope Brook Sister will give more opportunities for communication.”<br/><br/>Kevin’s face darkened, but he couldn’t speak up because Charlotte wouldn’t let him.<br/><br/>“No, thank you.” Charlotte said indifferently, “It’s better not to be too familiar. Then, when we have to fight due to different positions, it won’t be too hard. If I’m too familiar, I can’t control my strength well. If we’re not familiar... I can fight harder.”<br/><br/>Alex’s smile faltered.<br/><br/><br/><br/>But Kevin laughed.<br/><br/>Charlotte scratched the back of Kevin’s hand and looked at Alex, “We’re leaving now.”<br/><br/>She then looked at George and Director Morris, who had already joined George’s side, signaling them to leave.<br/><br/>George and Director Morris followed them out.<br/><br/>Alex stood in place, watching their retreating figures, and chuckled softly after a moment.<br/><br/>...<br/><br/>Kevin and Charlotte walked hand in hand at the front, followed by George and Director Morris.<br/><br/>After walking a few steps, George nudged Director Morris’s arm, “Who is that?”<br/><br/>“Alex Martin, a very promising newcomer.” Director Morris brushed the dust off his clothes, “He’s interested in Nana.”<br/><br/>George raised his eyebrows, “They’re all a bunch of irrational people. How many people have tried to woo these two over the years?”<br/><br/>“There’s always someone who thinks their feelings will become a problem, that they’ll get tired of each other,” Director Morris said helplessly, “and there’s always someone who thinks their charm can break up their family and take their place.”<br/><br/>George chuckled, “I don’t get it—why do their feelings grow stronger as the years go by? Holding hands even while walking after so many years.”<br/><br/>“You’ll understand when you meet someone you truly love,” Director Morris said.<br/><br/><br/><br/>“Why don’t you find someone?” George asked, “You’re already at that age; if you don’t hurry up, it’ll be too late in a few years.”<br/><br/>“Mind your own business,” Director Morris hit him, “Just go away, it’s you who won’t be able to.”<br/><br/>“Who won’t be able to?” Charlotte suddenly stopped and turned around to look at them.<br/><br/>Kevin cleared his throat softly.<br/><br/>Quickly, George and Director Morris pointed at each other, “Him.”<br/><br/>Charlotte looked at them indifferently and shook her head. Before she could say anything, Kevin hooked his arm around her neck and dragged her away.<br/><br/>George and Director Morris stood in place.<br/><br/>Director Morris furrowed his brow, “What did her expression just mean?”<br/><br/>George clenched his teeth, “I don’t know what it meant, but I feel insulted.”<br/><br/>“Me too.”<br/><br/>...\t\t\t\t\t\t</div>", "images": {}, "success": true}