{"id": 717, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15245969.html", "title": "Chapter 677: Extra 54: Little Bryce Cannon Catches A Cold", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 677: Extra 54: Little Bryce Cannon Catches A Cold</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 677: Extra Chapter 54: Little Bryce Cannon Catches a Cold<br/><br/>Little Ethan had caught a cold, and by dinnertime, it had worsened, with him continuing to cough.<br/><br/>Lila Campbell had two night scenes to film, so she let Harton Clark take the children back to the hotel first, leaving Anisa Cooper to accompany her.<br/><br/>By the time she finished filming, it was past eleven o’clock. When she returned, Ethan was sitting on the bed with his eyes red and swollen.<br/><br/>Harton was wiping his face with a washed towel.<br/><br/>“Mom.” Ethan brightened up a little when he saw Lila, reaching out for her to hug him.<br/><br/>Lila walked to Ethan’s bedside and asked, “Has it gotten worse?”<br/><br/>“No,” Harton gently replied, “It’s actually a bit better than at dinnertime, and he’s not coughing as much anymore. He just woke up from a nap, but because his nose was stuffy, he cried, wanting you.”<br/><br/>Lila looked at the pitiful child on the bed.<br/><br/>Ethan’s little face was flushed, his eyes red.<br/><br/>“Wait for me to wash my hands,” Lila said.<br/><br/><br/><br/>Ethan nodded.<br/><br/>After washing her hands, Lila picked him up and patted his back. “Does your throat still hurt?”<br/><br/>“It doesn’t hurt anymore.” Ethan’s voice was a bit stuffy. “I can’t breathe with my mouth shut.”<br/><br/>Harton chuckled.<br/><br/>“Then keep your mouth open,” Lila suggested.<br/><br/>Ethan responded, “But when I open my mouth, it drools.”<br/><br/>“That’s fine. I don’t mind,” Lila stroked his head. “Go to sleep.”<br/><br/>“Can I sleep with you tonight?” Ethan whispered shyly.<br/><br/>“Yes,” Lila answered. “Go to sleep.”<br/><br/>Lila stood holding him, gently patting his back.<br/><br/>Harton poured her a glass of water.<br/><br/>“You rest a while,” Lila said, freeing a hand to sip a bit of water.<br/><br/>When Ethan was sick, he tended to be rather demanding, so Harton had not been idle since their return.<br/><br/>He changed out of his soiled dress shirt and into his home clothes, as Ethan had coughed suddenly while taking medicine and spilled it on him.<br/><br/>Harton only had the chance to change after Ethan had taken a nap.<br/><br/>“I’m not tired,” Harton said, caressing her head before kissing her temple. “Don’t worry. It’s just a common cold, and he’ll be fine in a couple of days.”<br/><br/>Seeing him coughing on the film set, Harton had taken Ethan’s pulse and given him some traditional Chinese medicine to drink.<br/><br/>Lila nodded. “Where’s Bella?”<br/><br/>“I let her sleep with Casey,” Harton said. “I’m afraid she’d get infected.”<br/><br/><br/><br/>“Mm,” Lila agreed.<br/><br/><br/><br/>The “messy thing.”<br/><br/>Sure enough, as Charlotte had expected, Alex Martin stood outside the door with a gloomy face, not speaking for a while, just staring at Arthur.<br/><br/>Arthur’s gaze was relaxed but sharp as a blade, “Alex Martin, I don’t care about your relationship with M Continent or whose side you want to stand on; just don’t reach your hand into my home.”<br/><br/>Charlotte, who was in the room, raised her eyebrows slightly as she heard this sentence.<br/><br/>“Gael Easton is my wife’s friend and the godfather to our son and daughter,” Arthur said softly. “What makes you think you can touch that relationship and get Charlotte to stand on your side?”<br/><br/>Both men were on guard, confronting each other, and neither one yielded an inch.<br/><br/>After a while, Alex sneered, “So it turns out Third Master has been investigating me.”<br/><br/>“Alex Martin,” Arthur looked at him and said, “If not for your brother’s sake, do you think you could still be standing here?”<br/><br/>Alex’s eyes flashed slightly.<br/><br/>“Or perhaps you think you could challenge me and the Clark Family?” Arthur chuckled, “You’re welcome to try; I’ll keep you company anytime.”<br/><br/>Alex didn’t say anything.<br/><br/><br/><br/>Arthur said, “It’s already late; we need to rest.”<br/><br/>With that, he closed the room door.<br/><br/>Alex stared at the closed door, his expression dark. After a moment, he finally turned and left.<br/><br/>Arthur returned to the room and looked at Charlotte. He immediately smiled gently, “Going to bed?”<br/><br/>Charlotte nodded.<br/><br/>“Give him to me, you go wash up,” Arthur said softly, taking Ethan from her.<br/><br/>“Is Alex with M Continent people?” Charlotte asked.<br/><br/>Arthur nodded, “He’s meddling in Gael’s domestic affairs. It seems he intends to marry you away and have you join forces with him.”<br/><br/>He gritted his teeth as he spoke the last part.<br/><br/>Charlotte looked at him for a moment before kissing him gently on the corner of his lips.<br/><br/>Arthur felt better and smiled, “If they managed to win you over, Gael would lose a great source of support. Mainly, they’re afraid of you.”<br/><br/>Charlotte had no restrictions on the Mountain Sea Continent-front.<br/><br/>For years, the outside world didn’t know who the real master behind Hundred Demons Pavilion and Dark Radiance was.<br/><br/>But a few years ago, when an incident occurred on the Mountain Sea Continent, Charlotte resolved it, revealing a few clues to some people.<br/><br/>That made people more fearful of Charlotte.<br/><br/>“Alex’s brother...”<br/><br/>“We have some connections,” Arthur said, “But we almost never contact each other unless there’s business; that’s why I never mentioned it to you.”<br/><br/>Charlotte nodded.<br/><br/>Arthur continued, “His brother said that Alex is going through a rebellious phase again. The more you try to keep him away from someone, the closer he wants to get. Just wait until he gets a good beating someday.”<br/><br/>Charlotte raised her eyebrows, “Yes, he’s his real brother.”\t\t\t\t\t\t</div>", "images": {}, "success": true}