{"id": 718, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15245970.html", "title": "Chapter 678: Side Story 55: Bryce Cannon, Timid Yet Scared Of The Strong", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 678: Side Story 55: Bryce Cannon, Timid Yet Scared Of The Strong</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 678: Side Story 55: Bryce Cannon, Timid Yet Scared of the Strong<br/><br/>The next day, early morning.<br/><br/>Both Kevin Clark and Lila Campbell were still asleep, but Ethan Clark woke up first.<br/><br/>He slept in the middle, clutching Lila Campbell’s pajamas with his little hand.<br/><br/>Lila Campbell lay on Harton Clark’s arm, and Harton Clark’s other arm was draped over Lila Campbell’s waist.<br/><br/>With this position, there was space left in the middle for Ethan Clark, who slept comfortably.<br/><br/>After waking up, he glanced at his sleeping parents, then kicked Harton Clark’s legs.<br/><br/>The force wasn’t too strong, but Harton Clark opened his eyes immediately.<br/><br/>Father and son stared at each other for a few seconds before Ethan Clark smiled politely.<br/><br/>Harton Clark’s sleepy expression was tinged with a hint of a smile as he whispered, “Feeling better?”<br/><br/>Ethan Clark nodded in response.<br/><br/><br/><br/>As soon as he spoke, Lila Campbell woke up, touched his little face, and asked, “Nose not stuffy anymore?”<br/><br/>“Yes.” Ethan Clark rolled over and lay in Lila Campbell’s arms.<br/><br/>After only two seconds, Harton Clark got out of bed and picked Ethan Clark up.<br/><br/>Ethan Clark was suddenly hoisted into the air, his little legs flailing.<br/><br/>Harton Clark held him in one hand and touched Lila Campbell’s head with the other, “Sleep a bit more, it’s still early.”<br/><br/>“Mom, you sleep a little longer, I’m fine now.” Ethan Clark’s a voice was still a bit hoarse, but he sounded in good spirits.<br/><br/>“Mm.”<br/><br/>Harton Clark took Ethan Clark to wash and rinse.<br/><br/>When they finished washing, Lila Campbell also got up.<br/><br/>“Not going back to sleep?” Harton Clark asked.<br/><br/>“Can’t sleep.” Lila Campbell rubbed Ethan Clark’s head, messing up his hair again, making it look like a little bird’s nest.<br/><br/>Ethan Clark frowned as she did this.<br/><br/>“Go wash and rinse first.” After Harton Clark waited for her to let go, he began fixing his son’s hair again, “I’ll order breakfast.”<br/><br/>“Mm.”<br/><br/>While Lila Campbell was washing up, Christopher Clark brought Noah Clark over.<br/><br/>As soon as the door opened, Noah Clark dashed in and looked at Ethan Clark, “Elder brother, are you fine now?”<br/><br/>“I’m fine.” Ethan Clark held her hand and looked at Christopher Clark, “Brother, good morning.”<br/><br/>Christopher Clark touched his head, “You’re fine now?”<br/><br/>“Yes.”<br/><br/><br/><br/>“This hair... Mom’s handiwork?” Christopher Clark looked at his head.<br/><br/><br/><br/>She made all the icons on his phone’s desktop go black, causing them to spin in circles. They were still usable, but each icon spun like it was drunk.<br/><br/>It was dizzying to look at.<br/><br/>And she also deleted all her photos from his phone.<br/><br/>A few minutes later, Harton Clark’s call came, Charlotte Lane glanced at it, and coldly hung up.<br/><br/>Just as she wondered what kind of expression Harton Clark would have, a voice suddenly sounded from behind her.<br/><br/>Anisa Cooper, who was sitting next to her, was startled.<br/><br/>“Naughty girl, where are my son and daughter?”<br/><br/>It was the voice of Gael Easton.<br/><br/>Luckily it was in the Rest Area, otherwise with his loud voice, Morris would definitely have thrown him out.<br/><br/>“Mr. Easton.” Anisa stood up immediately and gave her seat to him.<br/><br/><br/><br/>Gael Easton sat casually and smiled at her, “Thank you, Naomi.”<br/><br/>Anisa smiled and went to find a small chair, sitting to the side and dealing with work.<br/><br/>“Naughty girl, that’s quite a reaction for my visit.” Gael Easton sat next to her, looking at her, “This outfit of yours... It’s pretty good-looking.”<br/><br/>Gael Easton was dressed in a light gray casual sportswear, with no change in his hairstyle, still having his long wolf-tail hair, just that the wolf tail was very long.<br/><br/>Without the strict suit, he actually looked much younger and energetic.<br/><br/>He appeared to be only around 25 or 26 years old.<br/><br/>About a year ago, he wanted to cut his hair short, but Noah Clark liked his long hair, so he never cut it.<br/><br/>“You’ve just been here two months ago. Not bothering you is already the biggest welcome I could give.” Charlotte Lane glanced at him and said softly, “Acting young at this age.”<br/><br/>“You wouldn’t understand, this is the trend.” Gael Easton looked around, “Where’s my son and daughter?”<br/><br/>“Who told you they were here?” Charlotte Lane asked.<br/><br/>“I went to your mother’s house first, saw Grandfather Lane, Uncle Lane, and the others.” Gael Easton crossed his legs casually, “then I went to Clark Manor, met Old Master Clark and Boss Wayne, how could I not know?”<br/><br/>“Well, it’s unlucky for you.” Charlotte Lane looked at her vibrating phone and said, “An hour ago, Harton Clark just took them away.”<br/><br/>“What?!” Gael Easton straightened up.<br/><br/>Charlotte Lane was used to his exaggerated reactions and slowly stabbed him with another knife, “By chance, you might have passed by them on some road segment.”<br/><br/>Gael Easton took a deep breath.<br/><br/>Charlotte Lane gave him another knife: “If you left Clark Manor a little later, you would have been able to wait for them.”<br/><br/>“I...” Before Gael Easton could say anything, seeing her hang up Harton Clark’s call, he suddenly smiled, “Oh, what’s going on? Had a fight?”<br/><br/>Listening to his gloating tone, Charlotte Lane glanced at him.<br/><br/>“What? A marital crisis?” Gael Easton was suddenly excited, “Perfect, I’m still short of a Princess Consort. You can marry me and my children will have a mother. Don’t worry, I’ll treat them well...Ouch!”<br/><br/>Charlotte Lane kicked him in the leg.<br/><br/>Gael Easton screamed, holding his leg, veins popping on his forehead, and in so much pain that he couldn’t speak. After a while, he looked at her, tremblingly pointed at her, and said, “You, wicked, woman!”\t\t\t\t\t\t</div>", "images": {}, "success": true}