{"id": 716, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15244257.html", "title": "Chapter 676: Extra 53: Fooling The Child", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 676: Extra 53: Fooling The Child</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 676: Extra Chapter 53: Fooling the Child<br/><br/>Charlotte Lane focused on her acting, while Kevin Clark stayed on the film set playing with the children.<br/><br/>For quite a while, the Clark Family had difficulty adapting to Kevin’s patience with the two children.<br/><br/>When the children were younger and more tiring, Kevin Clark took the majority of the care.<br/><br/>Everyone in the Clark Family knew it was because Kevin didn’t want Charlotte to get tired.<br/><br/>Having borne twins for ten months was already very exhausting. Since he couldn’t take her place in pregnancy, he took almost full responsibility for their care after they were born.<br/><br/>However, now that the children were past their most troublesome stage, the Clark family found it curious that Kevin’s patience with them remained unchanged.<br/><br/>After all... this was not the impression they had of Kevin.<br/><br/>All the Clark family members were slowly adapting, except for Christopher Clark who found it quite normal.<br/><br/>When he was young, Kevin was always kind to him.<br/><br/>Of course, his patience with Christopher was mostly to please his mother.<br/><br/><br/><br/>But he knew that Kevin genuinely liked him.<br/><br/>His father was a very sentimental man.<br/><br/>“What’s the plan in the next few days?” As Kevin played with the two little ones, he asked Christopher.<br/><br/>Christopher came back to his senses and looked at Kevin, “We’ll go to the Mountain Sea Continent in a week.”<br/><br/>“Is Second Brother Davis also going?”<br/><br/>“Yes, we’ll go together.” Christopher said.<br/><br/>When Finn Clark first came back, Kevin almost confined him to Clark Manor. He even had someone follow him when he went out, afraid he might run away again.<br/><br/>It was not until Edward Kirsten and the M Continent Laboratory were resolved that he regained his freedom.<br/><br/>Later, most of the matters concerning Dark Radiance in the Mountain Sea Continent were handed over to Finn.<br/><br/>Kevin Clark focused on the Research Institute and Easton Group, while Hugo Clark concentrated on managing their family business.<br/><br/>“Hugo...”<br/><br/>“Hmm?”<br/><br/>Kevin looked down as he rolled up Noah Clark’s sleeves, and said, “Choose something you enjoy and want to do, and focus on doing it well.”<br/><br/>Christopher’s eyelashes quivered slightly.<br/><br/>“Everything Charlotte and I have done, besides our necessary responsibilities, has been driven by our love and passion.” Kevin spoke slowly, “You don’t need to carry all the burdens.”<br/><br/>After a moment of silence, Christopher smiled and said, “Dad, I understand.”<br/><br/>“When I suggested that you take over Easton Group. If you didn’t like it, you could have refused,” Kevin said.<br/><br/>“I don’t dislike it,” Christopher answered, “But... please leave it to my younger siblings.”<br/><br/>“What’s for me?” Ethan Clark asked.<br/><br/><br/><br/>“Easton Group,” Christopher replied.<br/><br/>Ethan showed no interest and went back to playing with his toys, “I don’t want that. It’s not fun and it’s tiring.”<br/><br/>Christopher laughed lightly.<br/><br/>Kevin said, “Being excellent at one thing is enough; no need to be too strict with yourself.”<br/><br/><br/><br/>“Dad, I know my limits,” Christopher replied.<br/><br/>Kevin Clark nodded without saying anything else.<br/><br/>“Daddy, my hair has come loose,” Noah was drawing with her hand covered in paint. She accidentally got it on Kevin’s shirt sleeve.<br/><br/>A small white fingerprint was left on the black shirt, “Daddy, I’m sorry.”<br/><br/><br/><br/>Taking a step forward, Leah smiled, “Brook Sister, I’m Leah Joyce. We have a scene together later.”<br/><br/>Charlotte nodded, “Do you know each other?”<br/><br/>Before Kevin could say anything, Leah jumped in, “I heard that Third Master has a deep understanding of Peking opera, so I wanted to ask him for guidance.”<br/><br/>“Director Morris has invited a Peking opera actor to instruct,” Charlotte said, her voice faint, “He should have told you.”<br/><br/>Director Morris was very strict, and Leah should have been well aware of the detailed training before scenes like this were filmed.<br/><br/>Leah’s face flushed with embarrassment, which even her thick opera makeup couldn’t hide. She laughed and said, “I thought the instructor wasn’t on set today. Afraid that there might be problems later, I wanted to ask Third Master for guidance.”<br/><br/>Charlotte looked at her, and Leah lowered her gaze, unable to meet her indifferent yet proud eyes.<br/><br/>After a few seconds, Charlotte turned to Kevin and asked, “Does Third Master have time?”<br/><br/>Leah looked up at Kevin expectantly.<br/><br/>But Kevin didn’t look at her. His eyes were only on Charlotte, and he softly said, “No, I’m quite busy.”<br/><br/>Charlotte nodded, “My husband is quite busy.”<br/><br/>A joyful smile played upon Kevin Clark’s thin, crimson lips.<br/><br/>Hugo Clark also laughed. Showing their affection publicly in front of others, his parents were quite cunning.<br/><br/>Leah clenched her hand by her side and smiled, “Sorry for the disturbance.”<br/><br/>After saying that, she left.<br/><br/>Charlotte sat down on a chair, not paying any attention to Leah. Over the years, many people had approached Kevin, but she had grown used to it.<br/><br/>She glanced at teary-eyed Ethan Clark, “What’s the matter?”<br/><br/>Ethan sniffed.<br/><br/>“He seems to be catching a cold,” Kevin Clark reached out to touch Ethan’s little head, “He’s sneezed a few times.”<br/><br/>“Take them home tomorrow when you leave,” Charlotte suggested.<br/><br/>“Alright,” Kevin agreed.<br/><br/>Noah Clark listened to their conversation, and when they finished talking, she hesitated before approaching Charlotte.<br/><br/>Charlotte looked at her indecisive expression, “Do you have something to say?”<br/><br/>Noah nodded, hesitating a little, “Mom, the Cheongsam.”<br/><br/>The Cheongsam, which had been borrowed for a day, had still not been returned.<br/><br/>At the mention of “Cheongsam,” Charlotte’s face changed slightly, and the sound of fabric tearing from the previous night echoed in her ears.<br/><br/>After a brief pause, Charlotte grasped Noah’s shoulders and turned her to face Kevin Clark, speaking softly, “Go ask your dad.”<br/><br/>Hugo Clark sensed the atmosphere change slightly.<br/><br/>Noah looked at her father with innocent eyes.<br/><br/>As Kevin faced his daughter, he felt a surge of guilt. He glanced at Charlotte and then smiled, “Dad will have Uncle Allen make you an identical one that you can wear right now. Is that okay?”<br/><br/>“Huh?” Noah’s little face was bewildered.<br/><br/>“You have to wait till you grow up to wear that one, but a new one can be worn right away,” said Kevin, trying to please his child.<br/><br/>Charlotte pretended not to hear.<br/><br/>“An identical one?”<br/><br/>“Yes, identical,” Kevin confirmed.<br/><br/>“Alright,” Noah smiled, “Thank you, Dad.”<br/><br/>“You’re welcome,” Kevin replied.<br/><br/>Hugo, who had been listening, shook his head, thinking to himself, children are so easy to fool.\t\t\t\t\t\t</div>", "images": {}, "success": true}