{"id": 713, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15244249.html", "title": "Chapter 673: Extra 50: Child Grew Up", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 673: Extra 50: Child Grew Up</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 673: Extra Chapter 50: Child Grew Up<br/><br/>Charlotte Lane didn’t know much about Alex Martin, and she didn’t know him before.<br/><br/>It was also impossible for her to investigate everyone when joining the drama crew.<br/><br/>Although Kevin Clark had hostility towards Alex, he didn’t take any further action, so Charlotte didn’t take it to heart.<br/><br/>In the afternoon, the two had several confrontational scenes, and their overall cooperation was relatively smooth.<br/><br/>The script was set during the England period, and their scenes were in a casino. They faced off at the gambling table, and then... a fight broke out.<br/><br/>The fight scenes were rehearsed in advance, but during the shooting, Alex suddenly changed his move.<br/><br/>Because he changed his move, Charlotte’s move went out of balance, and she stumbled towards him.<br/><br/>Christopher Clark had been watching their confrontation all along, and when Alex changed his move, he immediately noticed and suddenly stood up and walked forward.<br/><br/>Charlotte’s body leaned forward, and Alex tried to help her according to his own thoughts.<br/><br/>But Charlotte managed to grab the table beside her and did not let Alex touch her. At the same time, she supported herself on the table with her right hand and kicked out with her left leg.<br/><br/><br/><br/>Alex did not expect her to regain her balance and kicked her leg. He immediately withdrew his hand and blocked her leg with his arm, but he still stumbled back a couple of steps.<br/><br/>When he regained his balance and looked at Charlotte again, he met her cold and piercing gaze.<br/><br/>Charlotte’s emotions in the show had always been on point, but her gaze at that moment exceeded the emotions in the script. It was not aimed at the character but at Alex himself.<br/><br/>Alex hesitated for a moment and then smiled warmly.<br/><br/>“Cut.” Morris shouted, “Let’s reshoot this scene.”<br/><br/>After Morris finished speaking, Alex walked towards Charlotte and said, “Brook Sister, I’m sorry, I forgot the move just now.”<br/><br/>Charlotte glanced at him indifferently and did not say anything.<br/><br/>Alex still continued to smile, appearing generous and gentle.<br/><br/>Christopher quickly walked over and handed Charlotte a tissue paper.<br/><br/>Charlotte took it and pressed the tissue paper on her right index finger.<br/><br/>Her right hand had supported a table with a wooden splinter, which had scratched her index finger.<br/><br/>Christopher had noticed it from a distance.<br/><br/>“Are you hurt?” Alex asked frowning, “Let me take a look...”<br/><br/>Before he could finish speaking, Christopher blocked Charlotte behind him, his voice gentle but sharp, “Mr. Martin, you looking at the wound won’t heal it.”<br/><br/>Alex slightly narrowed his eyes, and the look in his eyes cooled down.<br/><br/>Although Christopher was young, his aura was no less than his, “If you don’t want her to get hurt, Mr. Martin, you should be more dedicated.”<br/><br/>Others in the drama crew might not have noticed, but for professionals like Charlotte and Christopher, Alex’s little tricks were too crude.<br/><br/>Alex’s eyes were cold, but the corner of his mouth still curled up into a smile, “I don’t know what kind of relationship this young master has with Brook Sister.”<br/><br/>Christopher laughed, his eyebrows and eyes resembling Kevin Clark’s, “Mr. Martin, didn’t you check?”<br/><br/><br/><br/>Alex looked at him without saying anything.<br/><br/>Charlotte offhandedly pressed a little blood from her finger. Listening to Christopher’s words, she couldn’t help but laugh.<br/><br/>The child has really grown up.<br/><br/><br/><br/>“What I just said, changing the script and adding two more scenes for you, is it okay?” Morris asked.<br/><br/>Just now, Morris told her that he wanted to add two more scenes to the show, which would take place after the scenes she shot the day before yesterday.<br/><br/>So, the set design and costumes from the day before yesterday had to be restored.<br/><br/>“Is there enough budget for rebuilding the set design?” Charlotte asked.<br/><br/>“When was my budget ever enough?” Morris retorted.<br/><br/>Charlotte: “...then I have no problem.”<br/><br/><br/><br/>Indeed, as Morris said, adding those two scenes would make the characters more well-rounded.<br/><br/>“Alright,” Morris said, “We’ll shoot tomorrow night.”<br/><br/>“Okay.”<br/><br/>Charlotte took the children back, and the next day, when she came to shoot, she borrowed the cheongsam that the costume teacher had given her from Noah.<br/><br/>The extra scenes to be shot were just the ones with that costume.<br/><br/>During the day, they shot according to the original plan.<br/><br/>In the evening, they shot the two added scenes.<br/><br/>When the shooting was over, it was almost ten o’clock.<br/><br/>“Brook Sister, thank you for your hard work,” Kevin Clark came over with her computer, water cup, clothes, cell phone, and other things in his hand.<br/><br/>Charlotte looked at him and raised her eyebrows slightly, “When did you get here?”<br/><br/>“I’ve been here for more than ten minutes,” Kevin’s eyes were deeply looking at her, then he stepped forward, hugged her, and kissed her, “I missed you.”<br/><br/>Charlotte had a faint smile in her eyes, “I’ll change clothes and go back to the hotel.”<br/><br/>“Don’t change,” Kevin said, “You gave the clothes to Noah, just wear them back.”<br/><br/>Charlotte nodded and followed him out of the shooting location, “What about Christopher and the others?”<br/><br/>“I asked Anisa to take them home,” Kevin held her hand and pinched it, “Noah is sleepy.”<br/><br/>“When are you going back?”<br/><br/>“Lila, I just got here,” Kevin said.<br/><br/>“Can’t I ask just because you just arrived?”<br/><br/>“You can,” Kevin touched her right index finger again, “the day after tomorrow.”<br/><br/>As he finished speaking, he stopped and looked at her right index finger.<br/><br/>On the side of the index finger’s nail, there was a very fine cut that had already healed. If you didn’t pay attention, you wouldn’t even feel it.<br/><br/>“How did you do this?”<br/><br/>Charlotte replied indifferently, “I forgot.”<br/><br/>Kevin looked at her, his long, narrow eyes getting a bit fierce.<br/><br/>Charlotte faced his gaze for a while, then said softly, “I’m sleepy.”<br/><br/>Kevin: “......”<br/><br/>“Third Uncle...”<br/><br/>“Let’s go,” Kevin interrupted her decisively, “Go home and sleep.”\t\t\t\t\t\t</div>", "images": {}, "success": true}