{"id": 712, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15244247.html", "title": "Chapter 672 - 672: Extra Chapter 49: Would Chuinen Family Be Scared Of Clark Family?", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 672 - 672: Extra Chapter 49: Would Chuinen Family Be Scared Of Clark Family?</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 672: Extra Chapter 49: Would Chuinen Family be scared of Clark Family?<br/><br/>Both the Research Institute and Ryan Easton were busy, so Kevin Clark stayed with Charlotte Lane on the drama crew for one day before leaving.<br/><br/>He left on his own, while the two children stayed behind.<br/><br/>In his words, they stayed to protect Charlotte Lane.<br/><br/>Fortunately, the two kids were easy to deal with, and the drama crew and Anisa Cooper would tend to them. Christopher Clark came over before Kevin Clark left.<br/><br/>“Have some water.” After one scene, Charlotte Lane was having her makeup touched up. Christopher Clark went over and handed her water.<br/><br/>Charlotte took the water, drank a sip, and said, “Take the two little ones back this afternoon.”<br/><br/>Christopher Clark looked at her, his face full of confusion.<br/><br/>“I find it a bit annoying to have you all around all the time.” Charlotte Lane said indifferently.<br/><br/>Christopher Clark: “........I’ve been here for less than twelve hours.”<br/><br/>“I’ve been dealing with you for over a decade.” Charlotte Lane replied.<br/><br/>Christopher Clark looked at her, trying to stir up some guilt.<br/><br/>Charlotte Lane turned her back to him and ignored him as her makeup artist continued touching up her makeup.<br/><br/>Christopher Clark: “......”<br/><br/>Looking at her back, Christopher Clark lowered his head and smiled. He was about to go to her when he saw someone approaching, so he restrained his smile and looked at the newcomer.<br/><br/>Charlotte also heard the footsteps and looked up.<br/><br/>Alex Martin came over, his eyes landed on Charlotte, and he smiled gently, “Brook Sister, let’s have lunch together at noon and discuss the afternoon’s scenes.”<br/><br/>“We’ll have plenty of time to discuss during the afternoon shoot.” Charlotte Lane replied.<br/><br/>Alex Martin said, “Let’s just have lunch then.”<br/><br/>Christopher Clark raised an eyebrow slightly.<br/><br/>No wonder his father specifically told him to keep an eye on this guy named Alex Martin when he left.<br/><br/>“I already have plans for lunch.” Charlotte declined once again.<br/><br/>Alex Martin had a gentle smile on his face, but he clearly didn’t believe Charlotte’s words.<br/><br/>Christopher Clark stepped forward and looked at him, “I’m the one she has plans with for lunch.”<br/><br/>Alex Martin looked at Christopher Clark, his gaze lingered on his face for a moment, making an initial judgment about him. He looked a lot like Kevin Clark considering his young age: “What’s your name?”<br/><br/>“Charles Amos.” Christopher Clark shook hands with Alex Martin.<br/><br/>“Alex Martin.”<br/><br/>The two men shook hands and let go, but both had felt the calluses on each other’s hands.<br/><br/>Ethan laughed: “I think it’s good too. I made a lot over there. Once it dries, I’ll take them all home.”<br/><br/>“Alright,” Christopher said, “Make more, and have Dad load them in the pickup truck.”<br/><br/>Ethan’s eyes widened: “Are you sure Dad won’t hit me?”<br/><br/>“It’s fine,” Christopher gently wiped the mud off Ethan’s face, “If Dad lays a hand on you, I’ll take you and run.”<br/><br/>“Okay.”<br/><br/>“Let’s go wash up first, it’s almost time to eat,” Christopher said, “Where’s your sister?”<br/><br/>“Sister is helping me with the mud.”<br/><br/>Christopher’s mouth twitched.<br/><br/>My little princess is actually playing with mud!!<br/><br/>...<br/><br/>In the afternoon, the scenes were later, so Charlotte Lane and Anisa Cooper took the three kids out to eat.<br/><br/>After the meal, the five of them left.<br/><br/>Christopher held Isabella Clark, walking a little behind them.<br/><br/>Isabella took out two hairpins from her small bag: “Brother, which one looks good today?”<br/><br/>“This one,” Christopher held her with one hand while pointing to the hairpin with the other, “It matches today’s outfit.”<br/><br/>“Alright, I’ll wear this one,” Isabella smiled, “Uncle Morris got it for me. He bought me several, and today I brought out two.”<br/><br/>“So these two are the best-looking ones?” Christopher smiled.<br/><br/>Isabella covered his mouth: “Brother, be quiet. This is a gift from Uncle Morris.”<br/><br/>Christopher laughed: “I got it.”<br/><br/>Brother and sister chatted happily as they left.<br/><br/>The corridor quieted down, and the door to a private room was pushed open, and Alex Martin walked out.<br/><br/>He looked in the direction of the departing group, hesitated for a moment, and turned to the person next to him: “Did you find any information on that kid?”<br/><br/>“No,” the person beside him said, “Besides the people with the same name as Charles Amos, we couldn’t find any information.”<br/><br/>“What about the Clark Family?”<br/><br/>“All information from the Clark Family is unavailable, their systems are covered, and we can’t get in,” the person lowered his head, “We tried to force our way in, but we were traced back.”<br/><br/>Alex Martin laughed, “This person... is even more interesting than I thought.”<br/><br/>“Young Master, Charlotte Lane is married and has two children, and she is the Clark Family’s madam,” the person next to him continued, “Our family wouldn’t approve.”<br/><br/>“What’s wrong with being married and having children? Can’t the Chuinen Family support children? Does it hinder my love for her?” Alex Martin raised his eyebrows, “Are the Chuinen Family... afraid of the Clark Family?”\t\t\t\t\t\t</div>", "images": {}, "success": true}