{"id": 715, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15244254.html", "title": "Chapter 675: Extra 52: Feeling A Bit Scared Afterwards", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 675: Extra 52: Feeling A Bit Scared Afterwards</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 675: Extra Chapter 52: Feeling a Bit Scared Afterwards<br/><br/>Charlotte finished washing up and lay back down on the bed.<br/><br/>Arthur North rubbed her head, helped her turn over, and gently pressed his hand on her lower back.<br/><br/>Charlotte’s face buried in the pillow, she muffledly said after a while, “Brother Arthur...”<br/><br/>Arthur’s mood lifted, and he asked, “What’s up?”<br/><br/>“Shouldn’t we exercise some restraint?”<br/><br/>Arthur chuckled, “Has Sister Brook’s physical fitness declined a bit?”<br/><br/>“Don’t push me to hit you.”<br/><br/>“So we should do it more frequently.” Arthur smiled, spouting his flawed logic, “We’ll get used to it.”<br/><br/>Charlotte lifted her leg and gave him a kick.<br/><br/>Arthur didn’t get angry and leaned down to kiss her on the back of the neck, “Don’t be mad, I’ll be more gentle.”<br/><br/><br/><br/>“You can make it shorter next time.”<br/><br/>Arthur: “.........”<br/><br/>“Little girl, you’re making things difficult for me.” Arthur said slowly.<br/><br/>Charlotte didn’t want to deal with him.<br/><br/>After lying down for a while, she reached out to grab the files from the bedside table and lay on the bed reading them.<br/><br/>Arthur said, “The top five are from the Research Institute, and the bottom ones are their submitted papers.”<br/><br/>Over the past few years, Charlotte has mentored several doctoral students, these were their papers.<br/><br/>“I’ve briefly looked through the files; you can take a look at them too.” Arthur said, “I’ve already read the papers and pointed out the areas that need revision.”<br/><br/>From the very beginning of Charlotte’s students’ experiments and papers...<br/><br/>As long as Charlotte had read them, Arthur had too, so he knew them all quite well.<br/><br/>He also knew the demands Charlotte had on her students.<br/><br/>When Charlotte was very busy, these students would directly contact Arthur.<br/><br/>So far, their guidance in teaching students has never had any disagreements.<br/><br/>“Is this...” Charlotte looked at the file, “The project that the M Continent side wants to cooperate with?”<br/><br/>“Yes.”<br/><br/>A few years ago, Edward Kirsten collaborated with the M Continent Laboratory. Arthur solved Peter Qinke, who had harmed Dean Yue, but didn’t do much to the M Continent Laboratory on the surface.<br/><br/>On the surface, it was Gael Easton who used his power to perform a major reshuffle of the entire M Continent Laboratory.<br/><br/>But behind the scenes, it was Arthur’s doing.<br/><br/><br/><br/>Today when they saw him, they were especially affectionate.<br/><br/><br/><br/>Kevin Clark picked them up, one on each side.<br/><br/>Little Noah’s hand hugged his neck and kissed his face, “Daddy, I miss you so much.”<br/><br/>Ethan Clark seldom showed too much intimacy with Kevin Clark, at most just allowing him to hold him. He was a bit like Kevin Clark when he was young. However, he would say, “I miss you too. Did you miss us?”<br/><br/>Kevin Clark smiled and said, “Mmm. I did.”<br/><br/>Both little ones were happy.<br/><br/>Ethan Clark glanced at him, thinking: In such a short time, you were only thinking about my mom.<br/><br/>Feeling the gaze, Kevin Clark looked up at Ethan Clark.<br/><br/>Ethan Clark immediately smiled, “Dad, I... don’t really miss you.”<br/><br/>“No need for you to miss me,” Kevin Clark replied.<br/><br/>Ethan Clark smiled and sat down on a chair next to him.<br/><br/>After sitting down, he tilted his head to watch Kevin Clark chat with the two little ones.<br/><br/>While listening, his gaze unintentionally swept across Kevin Clark’s neck.<br/><br/>Suddenly, he saw a red mark under the collar of Kevin Clark’s black shirt.<br/><br/><br/><br/>Ethan Clark’s pupils shrank, and he immediately looked away, his ears turning red.<br/><br/>The red mark, though covered by the collar, could still be seen, showing the edge of a tooth mark.<br/><br/>Kevin Clark’s skin was fair, and it reddened easily when touched, let alone when bitten and broken.<br/><br/>Ethan Clark, with his ears as red as a pair of ears, looked straight ahead.<br/><br/>In all his years, he had never experienced such a thing.<br/><br/>He knew they had a good relationship... but he had never seen such a mark on them before.<br/><br/>He needed time to process it.<br/><br/>His... mom still had to work, and he didn’t know how to restrain himself a bit.<br/><br/>Meanwhile, Charlotte Lane, who was working, naturally saw the bite mark on Kevin Clark’s neck today as well.<br/><br/>But she couldn’t remember when she bit him.<br/><br/>She had no memory of it at all.<br/><br/>Kevin Clark had been too rough last night, and for a long time, she felt as if she was unconscious.<br/><br/>There was a period of time when her memory was blank.<br/><br/>Later, when she thought back, she was a bit scared.<br/><br/>It felt as if she had almost been broken by Kevin Clark’s hand...\t\t\t\t\t\t</div>", "images": {}, "success": true}