{"id": 723, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15258285.html", "title": "Chapter 683: Side Story 60: Third Master Gets Angry", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 683: Side Story 60: Third Master Gets Angry</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 683: Side Story 60: Third Master Gets Angry<br/><br/>When Kevin Clark and Charlotte Lane returned to Clark Manor, all of the women were at home, and the men had gone out searching for the missing child.<br/><br/>“Sister.” Olivia Lane approached Charlotte first when she arrived.<br/><br/>Charlotte’s expression was cold, but she still squeezed Olivia’s icy hand first.<br/><br/>Though her hand wasn’t much warmer.<br/><br/>“Lila, I’m sorry.” Natalie Wayne’s eyes were swollen from crying, “I didn’t watch Bryce properly. I let him go.”<br/><br/>“Mom, it’s not your fault. He ran away on his own.”<br/><br/>On their way back, Charlotte had already received some surveillance footage investigated by Holt Lawrence.<br/><br/>Bryce had snuck out of Clark Manor. There were people at the entrance, but he managed to dispatch them.<br/><br/>After leaving the manor grounds, he disappeared.<br/><br/>Holt only found some footage of Bryce’s leg or arm, and then he was gone.<br/><br/><br/><br/>The boy wasn’t big, but he managed to avoid every surveillance camera.<br/><br/>His whereabouts were still unknown.<br/><br/>They could only search the places he had been or might likely go.<br/><br/>“It was me, at noon...” Tom Wayne’s words were cut off by Elina Clark.<br/><br/>“I scolded him at noon.” She said, holding Tom’s hand.<br/><br/>Tom didn’t say anything and looked at Elina.<br/><br/>Kevin and Charlotte watched the two of them.<br/><br/>Elina said, “It’s my fault.”<br/><br/>Charlotte looked at them with a calm expression, “It’s his fault for not obeying. He deserves to be punished.”<br/><br/>Neither Elina nor Tom spoke again.<br/><br/>After a while, Juan Wright brought a computer over.<br/><br/>“Teacher.” He handed the computer to Charlotte.<br/><br/>Charlotte sat down to review the surveillance footage.<br/><br/>Kevin couldn’t sit still at home, so he went out to search too.<br/><br/>Olivia cradled Noah Clark and sat beside Charlotte.<br/><br/>Hugo didn’t come back to the house.<br/><br/>The entire Imperial Capital was locked down, and some roads were even closed. The Clarks were worried that Bryce had been kidnapped.<br/><br/>So they locked down the Imperial Capital and checked at all the intersections.<br/><br/>Hugo discovered something was wrong outside, so he went straight to find someone to help.<br/><br/><br/><br/>From sunset to past eleven o’clock at night.<br/><br/>Charlotte found a clue from the surveillance footage at a clothing store.<br/><br/>In the reflection on the store window glass, she spotted Bryce’s silhouette.<br/><br/><br/><br/>Kevin stayed silent.<br/><br/>“Speak,” Charlotte said softly.<br/><br/>Olivia Lane, standing aside, was somewhat scared.<br/><br/>Hugo took Noah from Charlotte’s arms, holding the child, and gently pulled Olivia towards him.<br/><br/>At this moment, Arthur North returned home.<br/><br/>He walked quickly with an urgent stride, his face gloomy, and his eyes crimson. As soon as he heard Charlotte speaking, he stopped at the entrance.<br/><br/><br/><br/>Hugo glanced at Arthur as he entered the living room, his heart shrinking a bit. His third uncle was angry.<br/><br/>Kevin nervously mumbled, “At noon, I didn’t like the green vegetables grandma gave me...”<br/><br/>“And then?” Charlotte asked.<br/><br/>An atmosphere of tension enveloped the entire living room, and nobody dared to approach. Natalie stepped forward but immediately got pulled back by Elina.<br/><br/>“I. I flipped the bowl over. It broke, and the food spilled.” Kevin’s voice grew even softer, “Grandma slapped my butt twice and made me stand in the corner as punishment.”<br/><br/>As soon as Kevin finished speaking and before Charlotte could respond, Arthur entered the front hall and picked Kevin up directly.<br/><br/>He didn’t say anything, didn’t look at anyone, just grabbed Kevin by the waistband of his pants, carried him up to the second floor, went into the study, closed the door, and locked it.<br/><br/>It was as if a gust of icy wind had frozen everyone in place.<br/><br/>Only when they heard Kevin’s miserable crying from upstairs did they snap out of their stupor.<br/><br/>Both Hardy Clark and Olivia trembled in fright.<br/><br/>Noah cried out of fear.<br/><br/>Charlotte’s pupils trembled slightly, and she stood up, her back to the upper floor.<br/><br/>Calvin Stewart and Natalie both reacted immediately by going upstairs. But when they reached the door of the study room and couldn’t open it, Natalie knocked on the door, “Arthur, Kevin is already terrified; don’t scare him anymore.”<br/><br/>“Third brother, he knows he’s wrong; please don’t hit him anymore,” Calvin Stewart pleaded as well.<br/><br/>But all that answered them was Kevin’s increasingly miserable crying.<br/><br/>Elina, being older with limited mobility, was slower going upstairs.<br/><br/>Leaning on his cane, he stood at the study room door, “Arthur North, open the door. He is so young; what does he know? Why are you beating him?”<br/><br/>Arthur didn’t open the door from the inside, and nobody dared to open from the outside.<br/><br/>No one in the Clark family dared to provoke him.<br/><br/>Kevin’s crying grew worse.<br/><br/>The three people upstairs looked down at Charlotte.<br/><br/>Charlotte continued to face away from the upper floor.<br/><br/>Hardy Clark looked upstairs, then walked up to Charlotte, “Auntie, please persuade Third Uncle.”<br/><br/>“Sister, please take a look,” Olivia also said, “Third Uncle will listen to you.”<br/><br/>Charlotte didn’t move but said softly, “He really needs more punishment. The first time he gets hit, he runs away from home, no one should spoil his bad habits.”<br/><br/>“Sister,” Olivia pulled Charlotte’s hand, “He is still so young.”<br/><br/>“He’s young, but he caused everyone to lose sleep for an entire night.” Charlotte squeezed Olivia’s hand tightly, her voice cold, “Without a beating, he won’t learn his lesson.”\t\t\t\t\t\t</div>", "images": {}, "success": true}