{"id": 728, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15263255.html", "title": "Chapter 688: Extra Sixty-Five", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 688: Extra Sixty-Five</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 688: Extra Sixty-five<br/><br/>At the end of the month, Gael Easton returned to the Imperial Capital.<br/><br/>But he only stayed for one day before leaving.<br/><br/>Luke met him on the way to the airport.<br/><br/>Gael was riding in the back seat with Ethan Clark and Noah Clark, and Luke sat in the front to ask for a small favor.<br/><br/>Kevin Clark and Charlotte Lane drove a separate car, following behind them.<br/><br/>At the airport, Gael leisurely walked towards the security checkpoint, holding the hands of the two little ones.<br/><br/>Luke didn’t go in, and Kevin and Charlotte didn’t approach either, just watching them from behind.<br/><br/>After a while, a foreigner came up to Gael and asked him something, to which Gael replied.<br/><br/>When the foreigner left, Noah looked at Gael with stars in his eyes: “Dad Easton, your English is so good.”<br/><br/>Gael smiled: “Is it possible that your Dad Easton is a native English speaker?”<br/><br/><br/><br/>Noah: “Huh?”<br/><br/>Ethan chimed in: “Then your Chinese is really good.”<br/><br/>Gael squatted down and looked at the two of them: “That’s all thanks to your mom.”<br/><br/>“Why?” Noah asked, touching his own hair.<br/><br/>“Because when I argue with your mom in English, she’d just reply, ‘I don’t understand,’ and ignore me,” Gael said, “Even though we have no communication problems in daily life, we just can’t communicate when we’re arguing.”<br/><br/>Ethan and Noah laughed.<br/><br/>“So, I had to learn Chinese to argue with her.” Gael patted their heads.<br/><br/>“Then why did you argue with mom?” Ethan asked.<br/><br/>“Uh...”<br/><br/>Charlotte walked over and whispered: “Our characters don’t match.”<br/><br/>“Would you argue if our characters don’t match?” Ethan looked up and asked.<br/><br/>“Not only would we argue, but we would also fight,” Charlotte replied.<br/><br/>“Don’t talk nonsense and teach the kids bad things,” Gael said.<br/><br/>“Hurry up and go through security,” Kevin said.<br/><br/>Gael checked the time and hugged the children one by one: “Dad Easton has to go. Next time I’ll definitely spend more time with you.”<br/><br/>“When is next time?” Noah asked, leaning on his shoulder.<br/><br/>“Next time...” Gael pondered for a moment, “I’ll try to make it sooner than later. Okay, I’m going now.”<br/><br/>He stood up and pushed the kids gently towards Kevin and Charlotte. Then he said to them, “There’s something you guys mentioned, once I’m done with it, I’ll have the prescription sent back to you.”<br/><br/>“Thanks,” said Kevin.<br/><br/><br/><br/>Gael raised an eyebrow and looked at Charlotte: “Couldn’t you be polite for once?”<br/><br/>Charlotte gave him a cold stare.<br/><br/>Gael: “...Fine, fine, it’s better that way. If you said anything, I’d think you were after my life.”<br/><br/>Charlotte squeezed Noah’s hand: “Say goodbye.”<br/><br/><br/><br/>Hearing her words, Ethan spoke first: “Goodbye, Dad Easton.”<br/><br/>Noah looked up at him, hesitated, and said, “Dad Easton...goodbye.”<br/><br/>As the last words came out, Noah’s mouth twitched, and he began to cry.<br/><br/>When he cried, Ethan’s eyes also turned red.<br/><br/>Gael’s heart trembled, and he immediately bent down to touch her face: “Baby, don’t cry, don’t cry. I’ll come back very soon.”<br/><br/>Then, Noah cried even harder, clinging to his clothes and pleading pitifully, “Can’t you not leave?”<br/><br/><br/><br/>“Mm.”<br/><br/>“I have a question,” Ethan said.<br/><br/>“Go ahead.”<br/><br/>“Why does mom always go alone, and you don’t go?” Ethan asked.<br/><br/>Arthur looked straight ahead, his expression a bit fierce, but his voice as gentle as ever: “Daddy doesn’t like him.”<br/><br/>“Then why doesn’t mom take me and sister along? Mm... we go to Cold Green Village with her.” Ethan asked again, “Neither sister nor I dislike him.”<br/><br/>“He doesn’t like you guys,” Arthur said.<br/><br/>“Why?” Ethan said, “No one has ever disliked us. Even if they don’t like me, they will definitely like my sister.”<br/><br/>Arthur ignored him.<br/><br/>After thinking for a while, Ethan had a sudden realization: “I understand now. That uncle doesn’t like dad, and we are implicated.”<br/><br/>Noah Clark sneaked a look at Arthur.<br/><br/>Arthur’s face was cold, and he gritted his teeth, not paying any attention to Ethan all the way.<br/><br/>When they reached the entrance of the kindergarten, he threw Ethan in and told the teacher, “He wants to eat spinach today, so please give him some more at noon.”<br/><br/>Ethan’s little face looked as if it had been struck by lightning.<br/><br/>The teacher happily praised Ethan, “Ethan, you’re so good today, I’ll definitely give you more at noon.”<br/><br/>Then Arthur left without looking back, ignoring Ethan’s hurried apologies and pleas.<br/><br/>...<br/><br/>Meanwhile, Charlotte drove and took Christopher to the cemetery.<br/><br/>After getting out of the car, Charlotte held a bouquet of flowers in her arms and looked at Christopher: “Are you sure you want to go?”<br/><br/>“Mm.” Christopher smiled, “It’s been so many years, I’m fine now.”<br/><br/>The weather was a bit cloudy today with a slight breeze, making it a little cold.<br/><br/>But as soon as Charlotte got out of the car, the sun came out. The sunlight fell on her body slowly.<br/><br/>She walked up the steps one by one, and after reaching the top, she walked inside and stopped in front of a tombstone.<br/><br/>Christopher followed her, and after stopping, he looked at the name on the tombstone.<br/><br/>Edward Kirsten.<br/><br/>His fingertips curled slightly.<br/><br/>Charlotte placed the flowers in front of the tomb and stood there for a while without saying anything.<br/><br/>It had been like this for years, she would make a trip to the cemetery each year before the Cold Clothes Festival, stand there for a while, and leave without saying anything.<br/><br/>“Do you want to spend some time alone here?” Charlotte asked.<br/><br/>Christopher looked at her, and after a moment, he nodded.<br/><br/>Charlotte walked back, and as she reached the steps, she encountered Stella Edwards coming up.<br/><br/>Stella was also holding a bouquet of flowers, and when she saw Charlotte, she hesitated slightly and then smiled, “Here to see him too?”<br/><br/>“Mm.” Charlotte replied, “Christopher is over there, let’s wait a while.”<br/><br/>“Okay.” Stella stood by her side and after a while said, “Help me out.”<br/><br/>“Hmm?”<br/><br/>“Stop letting Teacher always introduce me to blind date candidates,” Stella said with a smile.<br/><br/>Charlotte looked at her and after a while said, “Have you made up your mind?”<br/><br/>“Mm.” Stella nodded and looked into the distance, “In life, you really shouldn’t meet someone who amazes you so much.”<br/><br/>Charlotte looked at her and then looked into the distance as well, “All right, I’ll talk to my mom about it.”<br/><br/>Stella raised her lips in a smile: “Thanks.”\t\t\t\t\t\t</div>", "images": {}, "success": true}