{"id": 721, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15258283.html", "title": "Chapter 681: Side Story 58: Do You Even Deserve It?", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 681: Side Story 58: Do You Even Deserve It?</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 681: Side Story 58: Do you even deserve it?<br/><br/>Charlotte Lane and Kevin Clark arrived at the location where Christopher Clark was being held, and Thomas Firway and Holt Lawrence’s men had already surrounded the periphery.<br/><br/>Alex Martin’s men were inside.<br/><br/>Both sides confronted each other.<br/><br/>The place was a two-story banquet hall.<br/><br/>The material from Holt Lawrence showed that Alex Martin had bought this place just a month ago.<br/><br/>It was just purchased, freshly renovated, and not yet open for business.<br/><br/>Kevin Clark, Charlotte Lane, and Jade Wood got out of the car, and Thomas Firway came over immediately: “Third Master, Sister.”<br/><br/>Thomas Firway looked at Jade Wood for a moment.<br/><br/>Jade Wood immediately said: “Uncle Thomas Firway.”<br/><br/>Thomas Firway had met Jade Wood early on. He was responsible for driving Christopher Clark to and from school and often saw the two of them together.<br/><br/><br/><br/>Occasionally, when no one picked Jade up from her home, he would also give her a ride.<br/><br/>Thomas Firway nodded in response and then turned to Kevin Clark and Charlotte Lane: “Shall we make a move?”<br/><br/>As soon as his words fell, someone came out of the banquet hall.<br/><br/>He only stood inside the door and did not come out. He said to Charlotte Lane: “Miss Lane, our young master has invited you.”<br/><br/>Charlotte Lane glanced at him and then said to Thomas Firway: “You stay outside and take care of Jade Wood.”<br/><br/>Jade Wood moved her lips, wanting to say something, but not saying anything in the end. She stood next to Thomas Firway.<br/><br/>“Okay,” Thomas Firway agreed.<br/><br/>Kevin Clark and Charlotte Lane walked together into the banquet hall.<br/><br/>But Kevin Clark was stopped: “Third Master, our young master only invited Miss Lane.”<br/><br/>Kevin Clark looked up at him.<br/><br/>The man lost his polite smile as soon as he met Kevin Clark’s gaze. Within the next second, he felt a pain in his abdomen, and was directly kicked out by Kevin Clark.<br/><br/>The people in the banquet hall immediately made a move, ready to attack.<br/><br/>Thomas Firway’s people were ready to accompany them any time.<br/><br/>Kevin Clark and Charlotte Lane walked calmly into the banquet hall amidst the tense confrontation between the two sides, directly ascending to the second floor.<br/><br/>Second floor<br/><br/>Alex Martin sat at the round table, with tea on it, waiting for them with an easy-going demeanor: “Brook Sister, time was tight, so I only prepared some tea for you.”<br/><br/><br/><br/>Alex Martin barely avoided being hit.<br/><br/>At the same time, Christopher Clark’s hands came out of the handcuffs, and he knocked down the two people next to him with a kick and a punch.<br/><br/>The people guarding the second floor all rushed into the room, and Kevin Clark dealt with them one by one.<br/><br/>Christopher Clark went to help, but Kevin Clark pulled him back: “Stay put.”<br/><br/>“Dad, let me practice.” Christopher Clark grinned.<br/><br/>Kevin Clark glanced at him after knocking down the person in front of him: “Be careful.”<br/><br/><br/><br/>“Mm.”<br/><br/>Meanwhile, those who were confronting each other downstairs heard the commotion upstairs and started fighting as well.<br/><br/>Upstairs, Kevin Clark and his son blocked all the attackers, while Charlotte Lane dealt with Alex Martin alone.<br/><br/>Alex Martin had always thought his martial arts skills were excellent, and he had never encountered any worthy opponents during his years of wandering outside.<br/><br/>Especially since Charlotte Lane was a woman, how powerful could she be?<br/><br/>But when they actually engaged in a fight, he realized what a huge gap there was between their skills.<br/><br/>At first, he could still handle Charlotte Lane’s attacks.<br/><br/>But soon, he was being beaten one-sidedly.<br/><br/>Charlotte Lane kicked him out, and Alex Martin slammed into a nearby display shelf.<br/><br/>All the stuff on it fell one by one, the sound of shattering echoing in the room.<br/><br/>“Young Master...” Alex Martin’s men saw him being beaten and wanted to rush over.<br/><br/>But all of them were knocked down by Kevin Clark.<br/><br/>Charlotte Lane stood in front of Alex Martin, waiting for him to stand up.<br/><br/><br/><br/>Her cold expression was like that looking down on ants, and her voice chilled people to the core: “I didn’t hurt you to save face for your family. But you had the audacity to lay hands on my family. Do you think your family can afford the price?”<br/><br/>“Brook, Brook Sister.” Alex Martin slowly stood up, wiping the blood from his face, “Sister Brook, I just wanted to meet you.”<br/><br/>“You’re not worthy.” Charlotte Lane moved forward and attacked again.<br/><br/>Thomas Firway and Holt Lawrence’s men charged in, causing the Chuinen family’s combat power to plummet.<br/><br/>Kevin Clark handed the remaining few men to Christopher Clark and then joined Charlotte Lane in beating up Alex Martin.<br/><br/>As husband and wife fought together, their coordination was impeccable.<br/><br/>Alex Martin kept getting up, only to be beaten down again, until he finally couldn’t get up anymore...<br/><br/>It really lived up to what Daniel Martin had said, he was thoroughly beaten to death...\t\t\t\t\t\t</div>", "images": {}, "success": true}