{"id": 729, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15270341.html", "title": "Chapter 689: Extra 66: The Fairy Clan Who Are Not Human", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 689: Extra 66: The Fairy Clan Who Are Not Human</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 689: Extra Chapter 66: The Fairy Clan Who Are Not Human<br/><br/>On New Year’s Eve after lunch.<br/><br/>A sudden hotspot topic about Harton Clark appeared online.<br/><br/>Within a few minutes, it reached the top of the hotspot list.<br/><br/>The entries multiplied, all concerning Harton Clark.<br/><br/>[The Third Master of Clark Family cheating.]<br/><br/>[Third Master Clark having a late-night rendezvous with a celebrity at a hotel.]<br/><br/>[Harton Clark cheating with Catherine, an actor from the same drama crew.]<br/><br/>[Third Master Clark having an affair with a beautiful celebrity while on a business trip.]<br/><br/>[Harton Clark Leah Joyce.]<br/><br/>[Clark Family, Joyce Family.]<br/><br/><br/><br/>[Harton Clark’s cheating, conflict between Clark Family and Lane Family, the Imperial Capital may undergo major changes.]<br/><br/>....<br/><br/>New Year’s Eve, a time for family gatherings.<br/><br/>Yet on this day, families gathered to gossip.<br/><br/>Analyzing Harton Clark and Charlotte Lane, discussing how the Clark Family and the Lane Family would end up.<br/><br/>Analyzing the future development of the Imperial Capital.<br/><br/>Even some families had already secretly made plans, waiting and watching with bated breath.<br/><br/>The Hobson Family, Spotlight, Cloud Clothing and Rainbow Skirts were bombarded with phone calls, all using the excuse of New Year’s greetings, asking around about the authenticity of this news.<br/><br/>Austin’s law firm was no exception.<br/><br/>During the New Year’s celebrations, Austin had to turn off his phone.<br/><br/>Online, the uproar continued, with comments refreshing every second.<br/><br/>[Oh my god, how could this be possible? There’s no way my Third Master and my Brook Sister would be together.]<br/><br/>[I don’t believe it! No way! If this is true, how can I believe in love anymore?]<br/><br/>[You might as well believe it. The video is clear as day. Last night, that female celebrity went to knock on Harton Clark’s room door.]<br/><br/>[What does knocking on the door prove? Did you see her go in?]<br/><br/>[But this morning, the two of them left the hotel one after another. What could they have done staying the night together in a hotel?]<br/><br/><br/><br/>The other side supports Harton Clark, thinking that their relationship has long been broken and Harton Clark is in a normal relationship.<br/><br/>There are more than twice as many people supporting Charlotte Lane than supporting Harton Clark.<br/><br/>The two sides went from arguing to insulting each other.<br/><br/>During the New Year, they exchanged pleasantries.<br/><br/>...<br/><br/>The entire Clark family, except for Hardy Clark who was far away, was at home after lunch.<br/><br/><br/><br/>The main courtyard’s front hall was full of people.<br/><br/>Playing Go, Chess, Five in a Row, cards, chatting, watching TV series, sipping tea, making red lanterns...<br/><br/>Joking and laughing, the atmosphere was lively and lively.<br/><br/>Until Hardy Clark shared the online hotspot in the family group, the whole family quieted down, all holding their phones, tablets looking at the news online.<br/><br/>Elina Clark and Tom Wayne also had to wear reading glasses as they couldn’t see clearly.<br/><br/>The entire front hall suddenly fell silent for 5 minutes.<br/><br/>Then with a light cough from Elina Clark, everyone turned to look at Harton Clark and Charlotte Lane who were working on the sofa in the living room during the New Year.<br/><br/>The crowd looked at them, then drew back their eyes and carried on with their own things as if they hadn’t seen the news on the Internet.<br/><br/>The lively atmosphere resumed. It didn’t even suffer the slightest influence from this matter.<br/><br/>Harton Clark and Charlotte Lane opened the shared group on their computer and looked at the hot search.<br/><br/>Seeing the family’s indifferent response, Harton Clark sighed, “Ah – How do I feel like we are outsiders.”<br/><br/>Without lifting his head, Elina Clark said while playing chess, “Just speak for yourself. Don’t implicate our Lila. You may be an outsider, but my Lila is definitely not.”<br/><br/>Charlotte Lane laughed.<br/><br/><br/><br/>“Alright, daughter-in-law is close, son is distant,” Harton Clark said with a smile.<br/><br/>“Shut up and stop talking. You’re annoying. You’re disturbing my game,” Elina Clark said.<br/><br/>Harton Clark: “......”<br/><br/>Tom Wayne and Isabella Lane were making lanterns when they laughed at the conversation.<br/><br/>It’s not that they didn’t care, but the relationship between Harton and Charlotte was so good that the news seemed fake.<br/><br/>Indeed, Harton Clark wasn’t in the Imperial Capital a few days ago, but neither was Charlotte Lane.<br/><br/>They arrived home together around 11 o’clock this morning. Her daughter-in-law’s face still showed signs of sleepiness as if she was gradually regaining her spirit from a long journey.<br/><br/>As for her son...He had a look of contentment on his face. He looked just like a member of the enchanting Fairy Clan.\t\t\t\t\t\t</div>", "images": {}, "success": true}