{"id": 722, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15258284.html", "title": "Chapter 682: Extra 59: Ethan Clark Goes Missing", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 682: Extra 59: Ethan Clark Goes Missing</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 682: Extra Chapter 59: Ethan Clark Goes Missing<br/><br/>After the matter was resolved, Kevin Clark had Alex Martin sent to the hospital.<br/><br/>Then he made a phone call to Alex’s brother, Daniel Martin.<br/><br/>As soon as the call connected, Kevin said, “Your little brother kidnapped my son.”<br/><br/>Both Christopher Clark and Charlotte Lane looked at him upon hearing this.<br/><br/>On the other side, there was a choking sound, and after a while, Daniel cautiously asked, “Is Alex... still alive?”<br/><br/>“Barely,” Kevin replied, “I had someone throw him to the M Continent. You can go pick him up.”<br/><br/>After saying that, he hung up directly.<br/><br/>Thomas Firway was left to handle the aftermath.<br/><br/>Kevin and the others left the banquet hall.<br/><br/>As soon as they walked out, Jade Wood ran out and asked Christopher Clark, “Christopher, are you alright?”<br/><br/><br/><br/>“I’m fine.” Christopher looked surprised, “You came too?”<br/><br/>Jade nodded. She grabbed his arm, checking for any injuries.<br/><br/>Christopher swayed left and right from her pulling, laughing, “I’m really fine.”<br/><br/>Kevin and Charlotte watched the two of them.<br/><br/>Jade finally saw that he was unharmed and felt relieved. Only then did she notice Kevin and Charlotte nearby.<br/><br/>Her face instantly turned red.<br/><br/>Christopher looked at her blushing face and raised the corner of his mouth.<br/><br/>“Uncle Kevin, Sister Charlotte...” Jade whispered, “Are you injured?”<br/><br/>“No,” Charlotte shook her head.<br/><br/>The corner of Christopher’s mouth twitched.<br/><br/>Uncle Kevin? Sister Charlotte?<br/><br/>He glanced at his father and was met with a glare from Kevin.<br/><br/>Christopher laughed and said, “Mom and Dad, shall we...”<br/><br/>“Not going to have dinner together?” Charlotte asked, looking at Jade.<br/><br/>“Not today, Sister Charlotte,” Jade said gently, “I need to be back before dinner.”<br/><br/>“Some other time,” Christopher said, “We’ll do it another day.”<br/><br/>Jade: “......”<br/><br/>Charlotte glanced at him.<br/><br/>Christopher smiled and said, “Then we’ll be on our way.”<br/><br/><br/><br/>“You just want to take advantage of me.” Christopher tapped Jade’s head and walked a few steps forward quickly.<br/><br/>Jade stopped and shouted at his retreating back, “I told you! Don’t tap my head! I won’t grow taller!”<br/><br/>As soon as she finished speaking, Christopher ran off.<br/><br/>Jade immediately chased after him, “Stop! Let me tap back! Don’t run! Let me tap back, or I won’t grow taller!”<br/><br/>...<br/><br/>Kevin and Charlotte watched the two children leave.<br/><br/>Kevin patted Charlotte’s head, “Let’s go.”<br/><br/>Charlotte nodded.<br/><br/>As they sat in the car, buckling their seatbelts, Charlotte said, “You should talk to Christopher.”<br/><br/>Kevin looked at her and smiled, “Fine, we’ll talk when we get home tonight.”<br/><br/>Charlotte remained silent, lowering her head to text Holt Lawrence that everything was fine.<br/><br/>Kevin started the car, and just after driving less than a hundred meters, his phone rang again.<br/><br/><br/><br/>“Little girl...”<br/><br/>Charlotte took the phone out of his pocket and looked at it.<br/><br/>It was a call from Natalie Wayne.<br/><br/>“It’s mom’s call,” Charlotte said.<br/><br/>Kevin said, “Answer it.”<br/><br/>Charlotte answered the call and put it on speaker, “Mom, Kevin is driving.”<br/><br/>“Lila, Lila...” Natalie’s voice was very anxious and tearful.<br/><br/>Kevin and Charlotte exchanged glances, and Kevin immediately turned the car around, heading toward Clark Manor.<br/><br/>“Mom, what’s wrong?” Kevin asked in a deep voice.<br/><br/>“Arthur, Ethan is missing.” Natalie’s weeping grew heavier, “It’s been almost an hour since he left on his own before we found out that he wasn’t home. He threw away his locator at home and left. He’s not at the Lane’s either; your big brother has already locked down Imperial Capital and sent people out to search.”<br/><br/>Charlotte suddenly tensed her fingers, and her pupils trembled violently.<br/><br/>Kevin glanced at Charlotte first, then asked, “Are you sure he’s not at home?”<br/><br/>After all, Clark Manor was so large that it was very possible they hadn’t found him.<br/><br/>“We checked the surveillance and saw him sneaking out of the house on his own.” Natalie said, “We’re still checking the surveillance from the road intersections.”<br/><br/>“We’re on our way home, don’t worry too much.” Kevin said.<br/><br/>After hanging up the phone, Charlotte immediately called Holt Lawrence. She asked if Ethan had gone to his place, and told him to hurry to check and send people to search.<br/><br/>Kevin also made a call to send all his men in Imperial Capital out to search.<br/><br/>As soon as the Lane family heard someone was missing, everyone’s heart skipped a beat. No one could bear the word “missing,” and they immediately sent people out to search.\t\t\t\t\t\t</div>", "images": {}, "success": true}