{"id": 727, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15263250.html", "title": "Chapter 687: Extra Sixty-Four", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 687: Extra Sixty-Four</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 687: Extra Sixty-four<br/><br/>The group moved to the living room and settled down. Lila sat next to Old Master Lane and spoke to him for a bit before turning to the rest of them, asking, “Which time is it now?”<br/><br/>Everyone laughed and no one responded.<br/><br/>“My home is about to be emptied by you all,” said Lila.<br/><br/>Logan said, “Come on, Big Boss, you’re exaggerating.”<br/><br/>Andrew Lane also chuckled, “No problem, come often. We are happy to have you here.”<br/><br/>It wasn’t just the Lane family being polite. Lila’s friends were all exceptional young individuals whose presence made their home lively, which they naturally enjoyed.<br/><br/>“Isn’t it you guys who are exaggerating?” Lila said, glancing at the corner of the room filled with suitcases.<br/><br/>More than twenty oversized suitcases were neatly lined up there.<br/><br/>To make space for all those suitcases, Andrew Lane had even moved several potted plants from the house, leaving a large open space for their luggage.<br/><br/>The most extravagant instance was when Luke came in his private airplane and landed right on the Lane family’s heliport.<br/><br/><br/><br/>Every time they came over, Aunt Cruz would be busy for days, cooking delicious food and all sorts of items, not only for them to eat here but also for them to take away.<br/><br/>Then there was the substantial piece of land Old Master Lane had bought in Oxford City. Every harvest season, they would come to take away the produce in batches.<br/><br/>They all behaved like bandits.<br/><br/>Of course, it was mainly the group from the Mountain Sea Continent’s Hundred Demons Pavilion that were the culprits. Today was worse because of the extra company — Holt Lawrence, who normally spent his days in the Imperial Capital, had also joined them.<br/><br/>Adrian Roberts and James Cooper had followed them too.<br/><br/>Seeing them, Arthur North noticed the two sitting on the farthest end, looking down, as though they wished they could disappear on the spot.<br/><br/>They were brought here by James Collins. They had one expectation, but the reality turned out to be different.<br/><br/>Even so, Arthur paid them little mind and said nothing.<br/><br/>“It’s fine.” Aunt Cruz laughed, “I’ve been training my apprentice. The next time we come, we’ll bring even more stuff. It’s not tiring for me at all. It’s more lively when everyone is here.”<br/><br/>“Thank you, Aunt Cruz.” James Collins smiled and responded.<br/><br/>“See, see.” Logan held Noah Clark in her arms and said, “We’re popular. Right, Noah?”<br/><br/>“Right,” Noah obediently answered.<br/><br/>“Why is our little Noah Clark so adorable?” Logan pinched her little face, “Let your godmother give you a kiss.”<br/><br/>With a loud smacking noise, Logan gave Noah a playful kiss on her cheek.<br/><br/>Noah chuckled, Arthur looked on with an icy expression.<br/><br/>Logan glanced at Arthur, then looked back at Noah and laughed, “Oh, who would have thought our Big Boss looked so adorable as a kid, begging to be bullied. If I had known earlier, I would have come to China earlier and made little Lila cry.”<br/><br/>Noah Clark and Lila looked alike when they were younger, always visiting the Lane family, so naturally, they would have seen pictures of Lila as a child.<br/><br/><br/><br/>Logan: “......”<br/><br/>“It’s understandable if you can’t remember, since you have stolen so many things.” James Collins mumbled.<br/><br/>Logan tossed sunflower seed shells at James Collins: “Stop spouting nonsense.”<br/><br/>James Collins hid behind Holt Lawrence while blocking the seed shells with hand: “Sister, look at her, look at her.”<br/><br/><br/><br/>The elders watched them playfully, Charlotte Lane glanced at them without minding.<br/><br/>Charlotte Lane put some sweet snacks in front of Luke.<br/><br/>Luke turned towards Leah Campbell, sitting quietly next to him: “Want some?”<br/><br/>Leah Campbell nodded, and pointed at the mousse cake on the tea table.<br/><br/>Luke handed it to her: “Here.”<br/><br/>“Thank you.”<br/><br/>Leah Campbell has improved significantly over these years, she is no longer afraid of people and can stay with many people. However, She doesn’t talk much, she only feels comfortable communicating with Luke, and doesn’t speak much to others.<br/><br/>Luke didn’t just stay in the Mountain Sea Continent, often taking her around to play.<br/><br/>In Logan’s words, it was as if his brother had raised a daughter, and gave all his patience to her.<br/><br/>“I heard Gael Easton is in the country.” Luke said.<br/><br/>Harton Clark turned to look at him: “He’s in the country, but not in the Imperial Capital. Why? Do you need him for something?”<br/><br/>“Yes. I have a personal matter.” Luke answered.<br/><br/>Since it was a personal matter, Harton Clark didn’t ask much. He turned to look at Noah and Bryce Cannon.<br/><br/><br/><br/>Noah thought for a moment: “Gael Dad said he will bring some tasty food for us at the end of the month.”<br/><br/>“That’s good, he should enjoy his time in the country for a few days.” Old Master Lane said, then returned his gaze to Adrian Roberts and James Cooper, “You two, why are you sitting so far away? Come here, have some food.”<br/><br/>“Thank you, Old Master.” Adrian Roberts replied, “We are good here, having some food, having some food.”<br/><br/>“Don’t be so formal.” Old Master Lane said, “When you are here, I am the boss. I’ll back you up, no one can mess with you. Come again often, whenever you want.”<br/><br/>“Yes, yes.” Adrian and James cooperated with a laugh.<br/><br/>Old Master Lane smiled happily, then whispered to Harton Clark over Charlotte Lane, “I am the boss, right?”<br/><br/>“Yes, you are.” Harton Clark responded respectfully with a smile, “We all follow your lead.”<br/><br/>Old Master Lane laughed contentedly.<br/><br/>However, Charlotte Lane added mercilessly: “You’re the oldest, that’s true.”<br/><br/>Harton Clark chuckled.<br/><br/>Old Master Lane: “......”\t\t\t\t\t\t</div>", "images": {}, "success": true}