{"id": 724, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15258294.html", "title": "Chapter 684: Extra 61 \"I Was Wrong\"", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 684: Extra 61 \"I Was Wrong\"</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 684: Extra 61 “I was wrong”<br/><br/>“Dad, I’m wrong. I’m wrong! I know I’m wrong!”<br/><br/>Kevin Clark’s breathless shouts came from the study room.<br/><br/>Daisy clenched her fingers and went upstairs anyway.<br/><br/>“Olivia, please persuade Arthur. He’s still young...” Natalie Wayne hadn’t finished speaking when the door of the study room was opened from inside.<br/><br/>Ethan Clark ran out on his own.<br/><br/>He cried fiercely, holding up his two filthy little hands swollen badly. The red, swollen marks on them were obviously caused by the ruler.<br/><br/>“Mom.”<br/><br/>Seeing Daisy, Ethan’s crying became even fiercer.<br/><br/>He cried at the top of his throat.<br/><br/>Showing her his two hands as if telling on someone.<br/><br/><br/><br/>Tom Wayne and Calvin Stewart shed tears out of heartache, but neither of them moved.<br/><br/>Daisy hesitated for a moment and then picked him up.<br/><br/>Ethan leaned against her shoulder, crying so hard he could barely catch his breath. Daisy gently patted his back.<br/><br/>While he was crying upstairs, Noah Clark cried downstairs.<br/><br/>Olivia comforted him and glanced at the closed door of the study room. Then she said to Tom Wayne and the others, “Dad, Mom, Sister-in-law Wood, I’ll take him to wash up first.”<br/><br/>“I’ll go with you.”<br/><br/>Tom Wayne accompanied her to help Ethan take a bath and change his clothes. Then they put medicine on and bandaged his swollen hands.<br/><br/>Throughout the process, Ethan’s tears never stopped.<br/><br/>Arthur North was determined to teach him a lesson, not to the point of harming him but still quite heavy-handed.<br/><br/>Little children have tender skin, and during the bath, beads of blood seeped from the palms of his hands.<br/><br/>Applying medicine was also painful enough to make him cry.<br/><br/>Then Daisy pressed his hand and quickly applied the medicine.<br/><br/>About ten minutes later, the pain relief started working, and Ethan slowly stopped crying.<br/><br/>When the medicine was applied, everyone else who had gone to search for Ethan had returned.<br/><br/>Seeing Ethan’s beaten state, everyone was heartbroken.<br/><br/>But Theo Clark and the others believed that this was the real Arthur North, and only this Arthur North was normal.<br/><br/>The impact on Christopher Clark was huge, as he had never expected his father to be so heavy-handed towards his son.<br/><br/>Everyone had spent a sleepless night and, after returning, went back to catch up on sleep if they had nothing else to do.<br/><br/>Daisy and Christopher Clark also took the two kids back to North Court.<br/><br/><br/><br/>When Kevin Clark cried, Noah Clark cried too.<br/><br/>These two little ones had never experienced such hardship before. Now that they had calmed down, they fell asleep quickly.<br/><br/>Watching them sleep, Charlotte Lane touched their little faces and then gently got out of bed and left the room.<br/><br/>Outside the room, Christopher Clark had been waiting.<br/><br/>Seeing her come out, he asked, “Are they asleep?”<br/><br/>“Yes.”<br/><br/>“How’s Kevin Clark feeling?” Christopher Clark asked.<br/><br/>“He was just slapped a couple of times, how could anything be wrong?” said Charlotte Lane indifferently.<br/><br/>Christopher Clark’s mouth twitched twice: “He bled. Your eyes were red with pity just now. I saw it.”<br/><br/>Charlotte Lane looked at him.<br/><br/>Christopher Clark coughed lightly and after a moment, said with some relief, “Luckily, when I went to Truro City alone back then, my father was still pursuing you, and I hadn’t been accepted back into the Clark Family. Otherwise, I would have been too miserable.”<br/><br/>“I don’t mind giving you a belated experience now,” Charlotte Lane said coldly.<br/><br/><br/><br/>“There’s no need for that,” Christopher Clark laughed.<br/><br/>“Have you eaten?” Charlotte Lane asked.<br/><br/>“Yes,” said Christopher Clark, “Grandma saved you some food, but my father is still in the study and hasn’t come out.”<br/><br/>“Alright, you go sleep for a while too.”<br/><br/>“I’ll sleep with my younger brother and sister,” Christopher Clark said, worried that Kevin Clark might wake up and look for someone.<br/><br/>“As you wish.”<br/><br/>Charlotte Lane went to the Main Courtyard. Natalie Wayne had saved her some food and asked her to eat first.<br/><br/>Charlotte Lane glanced at the study and Natalie nodded. Elina Clark was humming and not talking.<br/><br/>He just knocked on the door, but there was no response. There was no respect for him as a father. He really spared the rod when raising his child.<br/><br/>“Did you lock it?” asked Charlotte Lane to Natalie Wayne.<br/><br/>“I don’t know, no one dared to open it,” whispered Natalie Wayne.<br/><br/>Elina Clark was even angrier upon hearing this. He didn’t even dare to open the door. He was ashamed of the degree to which he feared his son.<br/><br/>“I’ll go upstairs and eat with Arthur North,” said Charlotte Lane.<br/><br/>“Alright, you go check on him,” said Natalie Wayne, leading her to the kitchen. “This family really depends on you.”<br/><br/>Charlotte Lane smiled and lowered her head.<br/><br/>Elina Clark, upon hearing her words, couldn’t save face anymore, even his mustache trembling.<br/><br/>She was pointing this out to him with her words.<br/><br/>His glorious image was ruined by that b*stard Arthur North.\t\t\t\t\t\t</div>", "images": {}, "success": true}