{"id": 720, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15253064.html", "title": "Chapter 680: Extra Fifty-Seven: Christopher Clark Was Taken Away.", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 680: Extra Fifty-Seven: Christopher Clark Was Taken Away.</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 680: Extra Chapter Fifty-Seven: Christopher Clark was taken away.<br/><br/>After having breakfast with the drama crew, Charlotte Lane and Kevin Clark returned to the Clark Manor together.<br/><br/>After seeing Elina Clark and Natalie Wayne, and playing with the three children for a bit, Charlotte Lane went back to the North Court to catch up on her sleep.<br/><br/>She rested for half a day in the morning and went directly to the Research Institute in the afternoon.<br/><br/>For a while now, William Lane was always at the Research Institute. Today, he finalized his project and handed it over to Charlotte Lane.<br/><br/>Things would be much lighter afterwards, because Amelia Smith, who was pregnant, was nearing her due date, so he had to go back and be with her.<br/><br/>“Have you arranged everything for yourself? The work at sister-in-law’s...” Charlotte Lane asked.<br/><br/>At this, William Lane suddenly sighed.<br/><br/>Amelia Smith and her elder sister had established a self-media company which had grown quite big over the years and was becoming progressively busier.<br/><br/>They also had to balance their duties with the Dance Association and Charlotte Lane’s jade carvings.<br/><br/>Sometimes when she was busy, William Lane didn’t even get to see her.<br/><br/><br/><br/>When she was nearly eight months pregnant, William Lane went to the Dance Association to pick her up, only to find her dancing.<br/><br/>At the time, William Lane’s heart almost stopped.<br/><br/>Now, she was heavily pregnant, yet she was still running around everywhere.<br/><br/>And William Lane just couldn’t stop her.<br/><br/>“Brother, you needn’t worry too much,” Charlotte Lane comforted him, “She’s young and physically fit. You...might not understand young people very well.”<br/><br/>William Lane raised his hand and flicked her forehead: “What way is that to talk to your brother? I may be old, but I am quite fit.”<br/><br/>“Hmm, it shows,” Charlotte Lane looked him and said, “You’re trying to act young.”<br/><br/>William Lane: ” ........”<br/><br/>Charlotte Lane laughed lightly and said, “As for the Dance Association, mom won’t allow her to go there anymore. As to the rest... as long as you don’t get too tired, it should be fine. You don’t have to be too nervous.”<br/><br/>“She really isn’t going to the Dance Association anymore, but when she has free time, she takes her carving knife and carves things at home.” William Lane explained.<br/><br/>“This...is there a problem?” asked Charlotte Lane, confused.<br/><br/>“It impacts prenatal education,” William Lane stated, “You should see her aura when she takes the knife. I always feel like she wants to chop someone up.”<br/><br/>Ever since Amelia Smith picked up the craft of carving, she held a carving knife in her hand all year round, and her grip was very strong.<br/><br/>During the early stages of her sister’s career, some thugs came to their house to cause trouble.<br/><br/>By the time William Lane arrived on the scene, Amelia Smith had already pinned down all the hooligans.<br/><br/>And then, William Lane had his people violently beat up those hooligans.<br/><br/>The reason being they had turned his gentle wife into a brutal person, and he was somewhat shocked by that.<br/><br/><br/><br/>“Christopher can handle himself.” Kevin Clark continued, “Thomas Firway is also heading there with his team.”<br/><br/>“Yeah,” Charlotte Lane responded, “Holt Lawrence is also dispatching a team.”<br/><br/>The two then drove to East Street Avenue and picked up Jade Wood.<br/><br/><br/><br/>Jade Wood first saw Kevin Clark in the driver’s seat, immediately she cried out: “Uncle Clark.”<br/><br/>The young girl held a computer in her hand, dressed in simple casual wear, her youthful innocence full of vitality.<br/><br/>Just that her face turned somewhat red from panicking, as well as her eyes.<br/><br/>Kevin Clark glanced at her, then softened his expression, “Get in the car.”<br/><br/>Swiftly, Jade Wood opened the rear door and got in the car.<br/><br/>After getting into the car, she glanced at the car’s GPS location and then turned to Charlotte at the passenger’s seat: “Sister Charlotte.”<br/><br/>Charlotte Lane turned to look at her, nodded, “Don’t worry, Christopher’s going to be fine.”<br/><br/>Jade Wood nodded her head.<br/><br/>Kevin Clark frowned, then glanced at Charlotte Lane.<br/><br/>Why was she called Sister Charlotte by her, and yet he was addressed as Uncle Clark?<br/><br/>“Sister Charlotte,” Jade Wood spoke while tightly holding her computer, her voice gentle but somewhat hurried due to her anxiousness. “It appears like the people who took him belong to Alex<br/><br/>Martin. Alex Martin who is part of the same drama crew as yours. His family is based in Continent M.”<br/><br/>Charlotte Lane looked towards her, her gaze passing over the computer in her hands, asked interestedly, “Is there more?”<br/><br/><br/><br/>“That’s all I found.” Jade Wood clenched her fingers lightly, “I didn’t investigate further...”<br/><br/>Charlotte Lane raised her eyebrows, “Did you look up my number too?”<br/><br/>“No.” Jade Wood’s voice suddenly became quieter and she looked down, “Christopher told me. Also Uncle Clark’s number. He said if I couldn’t find him and there was an emergency, then I should contact you.”<br/><br/>“When did he tell you this?” Charlotte Lane asked again.<br/><br/>“On, On the first day of the Chinese lunar year.” Jade Wood stuttered.<br/><br/>Both of them are in senior three now, they haven’t seen each other for quite a few years.<br/><br/>This kid is really clever.<br/><br/>“Little girl...” Kevin Clark reminded her softly.<br/><br/>When Charlotte Lane saw the young girl getting shy, she diverts her gaze, sits properly and looked forward.<br/><br/>After a while, she said: “Third Master, your son has been kidnapped and yet you are in the mood for other things?”<br/><br/>Kevin Clark looked straight ahead, shifting gears, he snorted, “He better have been taken by force.”<br/><br/>Jade Wood sat at the back, watching the pair, “Is this the legendary...boss mentality?”\t\t\t\t\t\t</div>", "images": {}, "success": true}