{"id": 726, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15260758.html", "title": "Chapter 686: Extra Sixty-Three", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 686: Extra Sixty-Three</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 686: Extra Sixty-three<br/><br/>It was already noon by the time they had finished handling their matters.<br/><br/>Kevin Clark and Charlotte Lane returned to the North Court for lunch.<br/><br/>Originally, Emperor Winter Mansion was used as their wedding room.<br/><br/>Before the wedding, Kevin Clark had the entire Emperor Winter Mansion renovated. As Charlotte Lane liked the Clark Manor, the style changed dramatically, and it was completely redesigned according to the Clark Manor.<br/><br/>They even dug a lotus pond in the backyard. A large swath of roses was planted as well.<br/><br/>But Charlotte Lane still preferred the Clark Manor.<br/><br/>So after their marriage, they had been living in the Clark Manor.<br/><br/>When they were at home, most of the time was spent in the Main Courtyard having meals with Mr. &amp; Mrs. Clark and Finn Clark.<br/><br/>Sometimes, they would be in the North Court, just their family.<br/><br/>Today at noon, everyone seemed to be in tune. The Main Courtyard did not make lunch for their family, and the aunt in the North Court prepared lunch on schedule.<br/><br/><br/><br/>When Kevin Clark and Charlotte Lane got back. Noah Clark and Ethan Clark were already awake sitting on the living room sofa, with Christopher Clark playing with them.<br/><br/>As Kevin Clark walked into the living room, all three children looked over.<br/><br/>Ethan Clark rested his wrapped hands on his lap, took a glance at him and then hurriedly withdrew his gaze, looking down as if pretending to watch the toy on his lap.<br/><br/>Noah Clark also stared at Kevin Clark, with a touch of fear in her eyes.<br/><br/>Silence for a few seconds, it was quiet.<br/><br/>Charlotte Lane stood next to Kevin Clark, subtly signaling to Noah Clark with her eyes.<br/><br/>Noticing her signal, Noah Clark pursed her lips and then softly called, “Daddy.”<br/><br/>“Hmm,” Kevin Clark replied gently.<br/><br/>Seeing his response, Noah Clark happily ran over to him and looked up at him.<br/><br/>Kevin Clark was too tall, Noah Clark seemed like she would fall backward from craning her neck.<br/><br/>Kevin Clark leaned down and patted her little head, lifting her up, “When did you wake up?”<br/><br/>Noah Clark wrapped her arms around his neck, leaning on him and said, “Almost twenty minutes ago.”<br/><br/>While the father and daughter were chatting at the entrance, Ethan Clark sat on the sofa with his head lowered, occasionally sneakily glancing towards the entrance.<br/><br/>Seeing him like this, Charlotte Lane chuckled internally and then took Noah Clark from Kevin Clark’s arms, walking toward the dining room with her, “Let’s eat.”<br/><br/>Ethan Clark immediately jumped down from the sofa, following Charlotte Lane.<br/><br/>And sensing Kevin Clark walking behind him, Ethan Clark quickened his pace towards the dining room.<br/><br/>At the dining room and after sitting down, in a few seconds, Kevin Clark sat next to him.<br/><br/>Feeling the person beside him, Ethan Clark trembled slightly, his heart fluttering as he squirmed, sending a pleading look at Charlotte Lane.<br/><br/><br/><br/>Harton’s eyes softened slightly. “Eat.”<br/><br/>“Okay.” Ethan smiled, and his mood finally improved.<br/><br/><br/><br/>His dad still loved him.<br/><br/>Seeing his cheerful face, Charlotte slightly raised her eyebrows and exchanged a glance with Harton.<br/><br/>...<br/><br/>After the meal, Ethan went to the main courtyard to apologize to Natalie Wayne.<br/><br/>This matter was finally resolved.<br/><br/>However, Ethan’s little hands were in pain for several days. Every time his bandages were changed, he would grit his teeth, and his small face would contort. Nevertheless, he didn’t cry anymore.<br/><br/>For several days, Harton was the one feeding him.<br/><br/>No rift occurred between the father and son due to this incident; instead, their relationship improved, and Ethan’s picky eating habits got better.<br/><br/>Originally, on the day that Ethan ran away from home, their family was supposed to visit the Lane family, but the visit got delayed.<br/><br/>On the contrary, the Lane family visited the Clark residence several times because Ethan had almost been abducted and because he had been beaten.<br/><br/>After Ethan felt better, their family visited the Lane family.<br/><br/>In the years after their marriage, they had always divided their time living between the Clark and Lane residences.<br/><br/>Every so often, Harton and Charlotte would go to the Rose Garden, Emperor Winter Mansion, or Doomsday Hotel for some alone time.<br/><br/><br/><br/>Given that Amelia Smith’s due date was fast approaching, their staying at the Lane residence could be of help.<br/><br/>However, on the day they arrived at the Lane household...<br/><br/>The moment they walked through the front door, they saw a crowd of people.<br/><br/>Charlotte immediately stood outside their living room, not wanting to go in.<br/><br/>James Collins, Damian Brown, Logan, Luke along with Leah Campbell, including the always home-bound Holt Lawrence and...Adrian Roberts and James Cooper.<br/><br/>The crowd was chattering and laughing entertainly.<br/><br/>“Sis, you’re home.” James Collins saw Charlotte first.<br/><br/>The moment he spoke, everyone’s attention turned towards her, and they quickly gathered around her.<br/><br/>Logan and Damian each picked up a child to hold.<br/><br/>James Collins lightly patted Christopher’s shoulder.<br/><br/>“You’re already here, why are you still standing outside? Don’t act like a stranger.” Logan said to Charlotte.<br/><br/>“It seems like you’re not acting like a stranger.” Charlotte responded.<br/><br/>“I’m in my own home, there’s no reason to be a stranger.” Logan pinched Noah’s small face, “The big boss’s home is our home, the big boss’s parents are our parents.”<br/><br/>Charlotte glanced at her and couldn’t be bothered with her.\t\t\t\t\t\t</div>", "images": {}, "success": true}