{"id": 725, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15260757.html", "title": "Chapter 685: Extra Sixty-Two", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 685: Extra Sixty-Two</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 685: Extra Sixty-two<br/><br/>The door to the study room was not locked.<br/><br/>Charlotte Lane, with a meal in one hand, opened the door to the study room with the other.<br/><br/>Originally, this study was used by Elina Clark, but later because Ethan Clark frequented Clark Manor, almost all the things in this study were his.<br/><br/>Now the room was filled with smoke, making it hard to open one’s eyes.<br/><br/>Kevin Clark stood on the balcony, his back to the entrance, tall and straight. Hidden in the smoke, there was an indescribable sense of desolation around him.<br/><br/>The fierce aura around him hadn’t dissipated, his strong presence preventing anyone from approaching.<br/><br/>Charlotte put the meal on the desk and walked up to him, wrapping her arms around his waist from behind and leaning against his back.<br/><br/>Arthur North’s eyelashes trembled for a moment. He came to his senses and held her hand: “How’s Christopher doing?”<br/><br/>“He’s fine, he’s sleeping,” said Charlotte, smelling the eaglewood and tobacco scent on him.<br/><br/>After she spoke, a few seconds later, Arthur turned around and hugged her, his face buried in her neck and his arms holding her tightly.<br/><br/><br/><br/>He held her tightly like something precious he feared losing.<br/><br/>After a while, he whispered, “I’m sorry.”<br/><br/>“He ran away on his own. He deserved to be beaten.” Charlotte paused, “Are you heartbroken?”<br/><br/>Arthur didn’t reply.<br/><br/>“If he hadn’t been punished today for what he did yesterday, there might be even more heart-wrenching moments in the future,” Charlotte said softly.<br/><br/>Arthur hugged her even tighter.<br/><br/>Charlotte didn’t say anything more, allowing him to hold her in silence.<br/><br/>After a while, she moved her fingers and tickled him at the waist.<br/><br/>Arthur’s face was buried in her neck, and he laughed softly: “Little Girl.”<br/><br/>The warmth of his breath on her neck caused Charlotte to move a little and smile, “Let’s eat before it gets cold.”<br/><br/>“Mhm.”<br/><br/>The two of them ate in the study room and then went downstairs together.<br/><br/>Downstairs, Tom Wayne acted as usual, only Elina Clark didn’t give him a friendly look.<br/><br/>Arthur made a pot of tea to apologize. Elina Clark snorted, “Why did you hit that little child? Look at how much he cried, his throat is hoarse now.”<br/><br/>“My big brother and second brother, Davis, said that you used to treat them like this. I’m just following in your footsteps.” Arthur poured him a cup of tea.<br/><br/>Elina Clark was speechless, glaring at him.<br/><br/><br/><br/>Kevin Clark averted his gaze and paused before saying, “You can like someone, but I hope you won’t engage in puppy love.”<br/><br/>Christopher agreed: “I won’t.”<br/><br/>“No matter who you’re with in the future, I hope you can respect them.” Kevin Clark seriously advised, “After all, she’s a girl. Respect her opinions in everything and consider her feelings.”<br/><br/>“I understand,” Christopher replied earnestly.<br/><br/>“Think about your sister. If your sister met a scumbag...” Kevin Clark clenched his fist and his voice turned harsh, “How would you feel?”<br/><br/><br/><br/>Christopher frowned, a scumbag? He wanted to kill any man who dared to approach his sister.<br/><br/>“Don’t bully others,” Kevin Clark grew more annoyed as he thought about it.<br/><br/>“I understand,” Christopher’s expression was also quite poor.<br/><br/>After they both responded, the two sat in silence with dark expressions, looking like they wanted to kill someone.<br/><br/>At that moment, Kevin Clark’s expression looked like he was just short of sharpening a knife in preparation for ten or more years later.<br/><br/>It took a while for Christopher to ask, “Dad, is there anything else?”<br/><br/>Kevin Clark came back to reality and replied indifferently, “No.”<br/><br/>“Then I’ll leave first.”<br/><br/>“Okay.”<br/><br/>As Christopher walked out and opened the door to the study, Kevin Clark suddenly called out to him: “Christopher.”<br/><br/>“Yes?”<br/><br/>“Don’t intentionally walk on thin ice with Alex Martin in the future.” Kevin Clark said seriously, “We adults will handle our own affairs. At any time, your safety should be the priority.”<br/><br/>Christopher smiled: “I understand.”<br/><br/><br/><br/>“Go ahead.”<br/><br/>...<br/><br/>Neither Charlotte Lane nor Kevin Clark had time to rest and instead dealt with the man who took Ethan Clark with them.<br/><br/>This man had nothing to do with the abduction case Diego Giovanni was investigating.<br/><br/>However, there was a gang backing him, involved in some dirty deals.<br/><br/>After Kevin Clark questioned the man and found out what they were doing, he almost beat the man to death with his fists.<br/><br/>Finally, Charlotte Lane stopped him and he released his grip.<br/><br/>“Diego Giovanni is involved in the investigation, this person needs to be handed over to him.” Charlotte Lane informed him.<br/><br/>So, after finding the child and causing a conflict that left the man barely alive, Kevin and Charlotte handed him over to Diego Giovanni.<br/><br/>Both Kevin Clark and Charlotte Lane were prepared to assist in the investigation, and they wouldn’t be able to vent their anger until all the people behind the scene were caught.\t\t\t\t\t\t</div>", "images": {}, "success": true}