{"id": 731, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15270346.html", "title": "Chapter 691: Extra Sixty Eight: Wishing......", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 691: Extra Sixty Eight: Wishing......</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 691: Extra Sixty Eight: Wishing......<br/><br/>The news of “Kevin Clark’s infidelity” spread quickly.<br/><br/>As Charlotte Lane was checking the surveillance footage from Durham City Hotel, a storm broke out under Allonzo Hobson’s Facebook post.<br/><br/>This was due to a post he made five minutes earlier.<br/><br/>[Enough with the bickering, everyone. It’s time to celebrate the New Year. I’d bet my life on it. The sky might fall, but there’ll absolutely be no issue between Kevin Clark and my Brook Sister!!!]<br/><br/>The comments under the post accused him of shielding Kevin Clark.<br/><br/>Instead of a clarification post, it seemed more like Kevin Clark was indirectly admitting guilt.<br/><br/>However, Allonzo Hobson did not check his cellphone after he sent the post. Instead, he was busy changing his little girl’s outfits one by one, preparing her New Year outfit.<br/><br/>Clark Manor<br/><br/>Having obtained the surveillance footage, Charlotte Lane prepared to clarify the situation on Facebook.<br/><br/>Kevin Clark peeled an orange beside her, sampled it, then offered her a piece.<br/><br/><br/><br/>Having tasted it, Charlotte said lightly, “It’s quite sweet.”<br/><br/>Hearing those words, Ethan Clark, who was building Lego on a carpet, raised his head to look at Kevin Clark, “Dad, I want some too.”<br/><br/>Kevin Clark eyed his son. “Peel it yourself.”<br/><br/>Ethan looked at the orange in his hand, “...Alright.”<br/><br/>Charlotte Lane posted the surveillance footage from Durham City Hotel online.<br/><br/>The first clip showed her and Kevin Clark returning to their hotel room one after the other.<br/><br/><br/><br/>[Great, I can brag about this for the next thirty dumplings this year.]<br/><br/>[Those who want to eat this dog food on New Year’s, be my guest. I for one have had my fill.]<br/><br/>[Say what you will, but check out the footage at their room’s entrance. Look at how Kevin Clark looks like he hasn’t slept all night, and then see how exhausted Charlotte looks.]<br/><br/>[I feel sorry for Charlotte.]<br/><br/>[Felt sorry for Charlotte+1]<br/><br/>[But Charlotte, despite her tiredness, doesn’t look bad, does she?]<br/><br/>[What does that mean?]<br/><br/>[It means Third Master Clark is powerful!]<br/><br/>[Stupid couple, why would I feel sorry for them? Here, in the grand New Year’s celebration, me, a poor boy, am being pressured into getting married. Ahhh, I’m so moved I could cry.]<br/><br/>[Hahahaha. These two, their child isn’t even that young, but they’re still so sweet with each other.]<br/><br/>[What do you guys know? It’s a rare time for just the two of them.]<br/><br/>[Third Master Clark did transfer his assets. It’s all in Charlotte’s name now. Hahahaha.]<br/><br/>[Talk about feeling secure. If only this man could be mine.]<br/><br/><br/><br/>[Be careful or Charlotte will bash your head in.]<br/><br/>[What do you guys think Charlotte meant by that post? Assets and man are all mine. So aggressive and classy. So possessive.]<br/><br/>[Obviously she’s telling certain people to keep their distance. The man is mine, the assets are mine. You get nothing.]<br/><br/>[With Charlotte’s level of possessiveness, I must thank her for allowing us to catch a glimpse of Third Master Clark online and marvel at his handsome face.]\t\t\t\t\t\t</div>", "images": {}, "success": true}