{"id": 732, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15270352.html", "title": "Chapter 692_End - 692: Extra Sixty Eight: Wishing......_2", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 692_End - 692: Extra Sixty Eight: Wishing......_2</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 692: Extra Sixty Eight: Wishing......_2<br/><br/>[Do you think...from now on, many people will start trying to get close to Sister Brook, both men and women. After all, getting Third Master wouldn’t get them anything, but getting Sister Brook means they’ll never worry again for a lifetime.]<br/><br/>[Hahahaha, the Third Master must be wishing to murder someone right now.]<br/><br/>[Some people are the Third Master of the Clark Family, the Chairman of the Easton Group, and a professor at the Research Institute...but they might have to rely on their wife for pocket money.]<br/><br/>[Hahahaha, I can’t take it anymore, I have to go laugh under Uncle Clark’s Facebook.]<br/><br/>[Thank you, Uncle, for providing the happiness during the Chinese New Year.]<br/><br/>....<br/><br/>Some people went to Allonzo Hobson’s Facebook to delete comments and apologize, others went to Kevin Clark’s Facebook to laugh.<br/><br/>Allonzo Hobson was still picking out pretty clothes for his daughter, while Kevin Clark was sitting next to Charlotte Lane and looking at his own Facebook.<br/><br/>Why was he only being laughed at?<br/><br/>Lila found out the person who took photos of Leah in the corridor was another celebrity, her competitor for work.<br/><br/><br/><br/>Kevin looked at the computer and said, “She’s using you to create hype.”<br/><br/>Even if Leah didn’t enter Kevin’s room, her knocking on the door would have got her backlash. She definitely couldn’t work now, at least for the moment.<br/><br/>The direct beneficiary of this situation was her competitor.<br/><br/>The photographer was clever. Not only did they ruin Leah, but they also used Kevin and Lila to make the headlines.<br/><br/>Lila glanced at him, “Why do you say it’s not using you?”<br/><br/>“I’m not as popular as my wife,” Kevin said with a smile.<br/><br/>Lila laughed and said, “You handle the follow-up matters.”<br/><br/>“Okay,” Kevin agreed.<br/><br/>They couldn’t let themselves be used for no reason. To make matters worse, Leah might blame them, which was something they wouldn’t accept<br/><br/>“Let’s celebrate the New Year first,” Lila said.<br/><br/>“Yes, celebrate the New Year first,” Kevin agreed, touching the top of her head.<br/><br/>...<br/><br/>Clark Manor was decorated with red lanterns.<br/><br/>Fu characters, window decorations, many of them were cut by Tom Wayne and Calvin Stewart. Elina Clark, her father, and brothers wrote many Fu characters and couplets as well.<br/><br/>After the New Year’s Eve dinner, Enamel Cannon was outside with Olivia Lane and the children, playing with sparklers in the courtyard.<br/><br/>Kevin and Lila watched them from the corridor.<br/><br/>“Your nephew looks like a king of children,” Lila said, wearing the red cape Tom Wayne made for her this year.<br/><br/>Standing in the corridor, she looked like an ancient noble lady, elegant and aloof. Kevin, next to her, was dressed in a black robe. Like a person sketched with cinnabar ink, he was both alluring and ancient: “Isn’t he your nephew too?”<br/><br/>“No,” Lila said softly, “That’s my brother-in-law.”<br/><br/><br/><br/>Kevin chuckled.<br/><br/><br/><br/>Charlotte Lane said: “What are you doing here during the Chinese New Year?”<br/><br/>“Accompany my son and daughter.” Gael Easton walked up to her, glanced at Kevin Clark as a greeting, “We don’t celebrate the New Year in M Continent, but here it’s warm and lively.”<br/><br/>He then took out two red envelopes for Charlotte Lane, one big and one small, the big one about as big as A5 paper and very thick.<br/><br/>“Naughty girl, here’s your red envelope.”<br/><br/>Kevin Clark raised his eyebrows.<br/><br/>Charlotte Lane took it, felt the big red envelope, and looked at Gael Easton.<br/><br/>“The stuff you guys wanted.” Gael Easton said, “You guys take a look, I can’t understand it. I’ll go play with them.”<br/><br/>After saying that, he went to set off fireworks with Ethan Clark and Noah Clark.<br/><br/>Charlotte Lane put the wine glass on a stone bench next to her, opened the red envelope, and took out the contents.<br/><br/>Kevin Clark also looked over.<br/><br/><br/><br/>They were all precious prescriptions, mainly focused on Chinese herbal formulations.<br/><br/>There were treatments for common colds and complicated illnesses.<br/><br/>All of them were of great research significance.<br/><br/>Kevin Clark and Charlotte Lane looked on as purple fireworks suddenly exploded in the sky, casting a reflection on the prescriptions.<br/><br/>The two of them regained their composure.<br/><br/>“These are all treasures.” Kevin Clark sighed.<br/><br/>Charlotte Lane carefully put them away, returned them to the red envelope, and looked up at the colorful fireworks in the sky.<br/><br/>Kevin Clark looked at her, knowing what she was thinking.<br/><br/>These prescriptions would be a worthy tribute to their ancestors when they returned.<br/><br/>Maybe in the future, more and more complicated diseases could be cured.<br/><br/>He handed her the wine on the stone bench and said, “One day, there will be remedies for every disease.”<br/><br/>Charlotte Lane turned her head to look at him, took the wine, the reflection of each other in their eyes under the colorful fireworks, paused, and said, “What’s that saying?”<br/><br/>“Hmm?”<br/><br/>Charlotte Lane thought and said, “Prefer the medicine cabinet three feet dust...”<br/><br/>“But hope the world has no sick people.” Kevin Clark and Charlotte Lane said in unison.<br/><br/>They laughed at each other, clinked glasses, and looked up at the brilliant fireworks in the sky together.<br/><br/>“So, let’s wish for a world without pain and suffering.”<br/><br/>“Health and longevity.”<br/><br/>—The end of the extra story—<br/><br/>2022.12.15<br/><br/>The Best Actress’s Rich Husband – She’s Both Beautiful and Cool\t\t\t\t\t\t</div>", "images": {}, "success": true}