{"id": 730, "url": "https://www.novelhall.com/the-big-shots-movie-star-wife-is-beautiful-and-sassy-32225/15270342.html", "title": "Chapter 690: Extra 67: Knocking On The Door In The Late Night", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 690: Extra 67: Knocking On The Door In The Late Night</h1><div class=\"entry-content\" id=\"htmlContent\">\n<br/><br/>Chapter 690: Extra Chapter 67: Knocking on the Door in the Late Night<br/><br/>Actually, this scandal started a few days ago.<br/><br/>Before the New Year, Kevin Clark and Charlotte Lane took their children back to Cold Green Village.<br/><br/>A new room was built behind the original house on the mountain in Cold Green Village, for the children to live in.<br/><br/>In recent years, the conditions in Cold Green Village have improved. Water and electricity are now available, and stable enough for appliances.<br/><br/>The most significant change is that there is now signal, and Internet access.<br/><br/>Since the winter climate there is warmer this year, Kevin Clark and Charlotte Lane took their three children there for a visit.<br/><br/>In the past, they would take their children there for a day or two during spring and autumn.<br/><br/>This year, they took them there in winter as well, but only stayed for one night before leaving.<br/><br/>Charlotte had to deal with some urgent matters in Durham City, so she went ahead, and Kevin Clark took the children back to the Imperial Capital.<br/><br/>Then... Kevin Clark sent the children back to the Imperial Capital, and went back to Durham City.<br/><br/><br/><br/>This is the supposed business trip of Kevin Clark mentioned online.<br/><br/>In reality, he went to Durham City to find his wife and also to visit Hardy Clark.<br/><br/>Hardy Clark married into the Joyce Family in Durham City.<br/><br/>Actually, Durham City is not very far from the Imperial Capital. It only takes about an hour by airplane.<br/><br/>But, in the eyes of the Clark Family, anywhere outside the Imperial Capital is considered far away.<br/><br/>The Joyce Family is very prestigious in Durham City and has a huge family.<br/><br/>Just in time, the Joyce Family was holding a grand end-of-the-year celebration, with many important people from Durham City attending.<br/><br/>Knowing that Kevin Clark and Charlotte Lane were in Durham City, they sent them an invitation.<br/><br/>But that night, Charlotte Lane was a bit late due to work, and in order to support Hardy Clark, Kevin Clark went over first.<br/><br/>After all, he was in Durham City, and not attending might give people the impression that the Clark Family didn’t value Hardy Clark.<br/><br/>So he went over early and made quite an entrance.<br/><br/>It was around this time that he caught someone’s attention.<br/><br/>By the time Charlotte Lane arrived, the celebration was almost over. She met some people in the inner circle and chatted with Hardy Clark for a while.<br/><br/>After that, Hardy Clark took her to the hotel room, and the two chatted in the room for a long time.<br/><br/>Kevin Clark talked to Hardy Clark’s husband, and returned to the hotel room a bit late.<br/><br/>As they returned to the room one after another, and Charlotte Lane hadn’t shown herself, someone got curious.<br/><br/>Leah Joyce was also a member of this enormous family and attended the celebration.<br/><br/>She saw Kevin Clark and wanted to go over and say hello, but Kevin Clark was surrounded by the Joyce Family heads, elders, and the Old Master.<br/><br/>She couldn’t find an opportunity until the celebration was over.<br/><br/><br/><br/>Charlotte Lane went to open the door.<br/><br/>Leah Joyce was persistently knocking on the door outside. She had dressed up for so long and couldn’t waste her efforts.<br/><br/>Finally, she heard the door opening.<br/><br/>She was overjoyed, lifted her head, stuck out her chest, smiled, arranged her hair, and managed her expression.<br/><br/>But when the door opened, and she saw the person inside, her smile froze instantly, and the blood in her body seemed to cool down.<br/><br/>Charlotte Lane glanced at the sexy little dress on Leah’s body and the delicate makeup on her face, raising her eyebrows slightly, “May I help you, miss?”<br/><br/>Leah’s face was full of panic, looking at the faint red that hadn’t faded from the person’s face, her throat seemed to be strangled, and she couldn’t make a sound.<br/><br/>Charlotte Lane leaned against the door, makeup-free but more stunning than Leah’s makeup. Her half-dried hair was a bit fluffy.<br/><br/>She was coldly elegant and casual, her aura frosty.<br/><br/>As Leah didn’t speak, Charlotte Lane chuckled softly, “Miss Leah, you’re here to see Kevin Clark.”<br/><br/>“I, I need to see Third Master for something.” In a panic, Leah blurted out the words.<br/><br/>After saying it, she regretted it. She should have said she was knocking on the wrong door, but it was too late now.<br/><br/>“He’s not available right now.” Charlotte Lane said calmly.<br/><br/><br/><br/>Kevin Clark listened in the room: “......”<br/><br/>“It’s not an urgent matter. I won’t bother you anymore.” Leah hastily wanted to leave.<br/><br/>Charlotte Lane stopped her, “Leah.”<br/><br/>Leah’s shoulder trembled.<br/><br/>“I hope this is the last time.” Charlotte Lane said calmly, “For the sake of the Joyce Family’s face, I won’t pursue today’s matter. But some things don’t happen twice. Once more, no one can save you.”<br/><br/>Leah’s legs were like lead, unable to move.<br/><br/>“Moreover, do you think the Joyce Family would protect you when facing the Lane Family or the Clark Family?” Charlotte Lane said, “Keep your mind straight, and if you get close to Kevin Clark again, I will make you as miserable as possible.”<br/><br/>Her voice was soft and gentle, like a knife, stabbing into the heart’s nest, one stab at a time.<br/><br/>Leah didn’t dare to look at her, and she fled in panic, as if there was a demon chasing her behind.<br/><br/>Seeing her leave, Charlotte Lane closed the door and returned to the room.<br/><br/>Kevin Clark was waiting for her at the bedroom door. When she approached, he gently touched her face and said, “Are you mad?”<br/><br/>“There’s nothing to be mad about.” Charlotte Lane raised her eyebrows.<br/><br/>Kevin Clark looked at her, sighed lightly, and smiled, “I feel like I haven’t been taken seriously.”<br/><br/>“How do you want to be taken seriously?” Charlotte Lane looked up at him with a smile in her eyes, speaking softly and drawling out her words, “Brother Arthur.”<br/><br/>Kevin Clark embraced her waist, held her in his arms, and kissed her forehead, “Be cooperative tonight, and don’t curse.”<br/><br/>“We’ll see.” Charlotte Lane said.<br/><br/>Kevin Clark smiled, held her tightly, and kissed her again.\t\t\t\t\t\t</div>", "images": {}, "success": true}