{"id": 4, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14234362.html", "title": "Chapter 4 - Chapter 4: 004 Eighth Grade", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 4 - Chapter 4: 004 Eighth Grade</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4: 004 Eighth Grade<br/><br/>Translator: 549690339<br/><br/>Gu Yang asked, “What is the Heaven’s Chosen List?”<br/><br/>The several traders looked at him strangely, not believing that he didn’t even know about the Heaven’s Chosen List, which was commonly known to everyone.<br/><br/>However, Old Gao reacted faster, “The Heaven’s Chosen List records the young, powerful individuals who are twenty years old or younger and have reached at least the Second Grade. Those who manage to make the list are genuinely the favoured ones of this generation. Their future achievements are limitless.”<br/><br/>In other words, among those who are under twenty years old and at the Second Grade, Liu Zhe ranks ninth, which is quite impressive.<br/><br/>For someone like Gu Yang, he didn’t even qualify to be on the list.<br/><br/>Old Gao continued, “Speaking of our Ba County, indeed, it is a blessed place that has produced not only the ninth place on the Heaven’s Chosen List but also the thirteenth place on the Beauty List last year.”<br/><br/>After that, he voluntarily explained, “The Beauty List records all the world’s extraordinary beauties.”<br/><br/>Gu Yang didn’t need an explanation for that; he could guess it.<br/><br/>Old Yang from the side remarked, “There’s a saying that beauties have short lives, being on the Beauty List is not a good thing. If the Su family hadn’t produced a Su Qingzhen, they wouldn’t have caught the Liu family’s attention, resulting in their family’s destruction.”<br/><br/>Old Gao wondered, “Logically speaking, marrying a talent like Liu Zhe shouldn’t be humiliating for Su Qingzhen. Why didn’t she agree? That led to the destruction of her entire family.”<br/><br/>“Hmph, Liu Zhe has long been engaged to the Xue family, even if he had ten times the courage, he wouldn’t dare to pursue another woman. It’s said that the Liu family wanted to offer her to a certain big shot. They tried all kinds of methods, both hard and soft.”<br/><br/>“Who would have thought that Su Qingzhen would be so determined and strong-willed? She chose to die rather than submit. In the end, she was quietly sent out of Ba County by the Su family. The Liu family, frustrated and embarrassed, wiped out the entire Su family. Their actions were incredibly ruthless, absolutely chilling.”<br/><br/>As they talked about the destruction of the Su family, the expressions of the several traders darkened.<br/><br/>The Su family had been a respected family in Ba County for many years, and yet the Liu Family destroyed them just like that, demonstrating their domineering and unrestrained behavior.<br/><br/>They, even as individuals of some wealth with families under Ba County’s rule, didn’t feel a sense of safety.<br/><br/>Gu Yang changed the topic and asked about the notable individuals in the Liu family.<br/><br/>Old Gao said, “There are many, the Liu family has been thriving for several generations. In the youngest generation, besides Liu Zhe, there are several outstanding disciples.” He proceeded to list them one by one.<br/><br/>…<br/><br/>The conversation continued for over half an hour.<br/><br/>Although Gu Yang had learned quite a lot about the Liu family’s members, he still couldn’t determine who that youth in the hunting team was from the Liu family.<br/><br/>They had rested long enough, so the caravan continued on the road.<br/><br/>Gu Yang, leading the way at the front, once again activated the Life Simulator.<br/><br/>[Do you want to use the Life Simulator? Each use costs 20 coins.]<br/><br/>The price didn’t go up, thankfully there was one piece of good news.<br/><br/>“Yes.”<br/><br/>[When you are 22 years old, you became a Ninth Rank Martial Warrior and decided to venture out with the caravan. Along the way, you lost your way and failed to reach Wang Family’s Gutter.]<br/><br/>[Two months later, you followed the caravan and arrived in Phoenix City. With your outstanding skills, you attracted the attention of the Sheng Family and became a guard for them.]<br/><br/>[At the age of 27, under your guidance, the Sheng Family’s business territory expanded over the past five years. The head of the Sheng Family valued you, and in order to win you over, he passed on the high-level technique “Sun’s Red Technique” to you.]<br/><br/>[At the age of 30, you returned to the Liu Family Village, only to discover that the village had been destroyed eight years ago. You vowed revenge.]<br/><br/>[At the age of 35, you finally broke through and became an Eighth Grade Martial Warrior.]<br/><br/>[At the age of 36, the Sheng Family’s business attracted the attention of the Liu Family. The head of the Sheng Family was assassinated, and you were killed on the spot. You lived to the age of 36.]<br/><br/>After reading the simulation, Gu Yang looked a little upset.<br/><br/>Even if he managed to avoid that hunting team from the Liu family, the Liu Family Village still couldn’t avoid its fate of being massacred.<br/><br/>Why was this?<br/><br/>Why was the Liu family determined to wipe out Liu Family Village?<br/><br/>Gu Yang was utterly puzzled.<br/><br/>[The simulation has ended. You can keep one of the following items.]<br/><br/>[1. Your martial arts cultivation level at the age of thirty-six.]<br/><br/>[2. Your martial arts experience at the age of thirty-six.]<br/><br/>[3. Your life wisdom at the age of thirty-six.]<br/><br/>Gu Yang took a deep breath. Regardless, there were still gains from this simulation. At the very least, his cultivation had broken through. His strength could improve a great deal.<br/><br/>Now, his balance was sufficient for three more simulations.<br/><br/>He hoped to find a way to change this situation.<br/><br/>…<br/><br/>It wasn’t until Old Gao suggested a rest again that Gu Yang made an excuse, found an isolated spot nearby, activated the system, and said, “I choose one.”<br/><br/>Suddenly, he felt the True Qi inside his body expanding continuously. A terrifying heat spread out, as if it was burning inside him.<br/><br/>At the same time, a new technique appeared in his mind, which were the first two layers of the “Sun’s Red Technique”.<br/><br/>After a while, Gu Yang’s inner True Qi was completely converted into the power of the “Sun’s Red Technique”.<br/><br/>Before, he had practiced the “Xuan Yuan Method”, which was a Daoist technique and had no special attributes. There was no obstacle to switching to other techniques.<br/><br/>“So this is the Eighth Grade?”<br/><br/>Gu Yang felt the powerful True Qi within his body and was slightly moved.<br/><br/>Having moved up one level, the True Qi had increased by at least three to four times. After transforming into the fire attribute, the power had also improved significantly.<br/><br/>The gap between the two levels was surprisingly large.<br/><br/>Then, with a Second Grade Martial Warrior practicing a technique even higher than the “Sun’s Red Technique”, how strong would they be?<br/><br/>Gu Yang shook his head, casting aside that thought and considering his current predicament. “I don’t know if I can take on the Liu family’s hunting team with my current strength.”<br/><br/>Since he had just broken through, he decided to first solidify his new cultivation level and perform another simulation tomorrow.<br/><br/>…<br/><br/>When Gu Yang returned to the caravan, the traders could clearly sense that he was different, but they couldn’t put their finger on it.<br/><br/>They just felt that his oppressive aura had grown stronger.<br/><br/>These traders had practiced martial arts and while they didn’t manage to reach any Grade, their strength was quite impressive among common people.<br/><br/>Because of this oppressive aura, even Old Gao, who knew him best, didn’t dare to approach him.<br/><br/>Regardless of how imaginative they were, they wouldn’t have thought that in such a short time, Gu Yang had broken through a level and become an Eighth Grade Martial Warrior.<br/><br/>Gu Yang took the initiative to approach Old Gao and asked, “Would the Liu family send people into Lian Mountain?”<br/><br/>Old Gao shook his head, “The Liu Family probably wouldn’t think much of the profit from there. For them, the income from entering Lian Mountain to gather goods is too low. They have monopolized the fur and medicinal herbs business in Phoenix City, and more than seventy percent of the mountain’s products fall into the hands of the Liu family. Why would they take such a risk?”<br/><br/>Gu Yang then asked, “So, would the disciples of the Liu family come to Lian Mountain to hunt?”<br/><br/>Upon hearing his question, Old Gao froze for a moment before hastily asking, “Did you by any chance come across someone from the Liu family entering the mountain?”<br/><br/>Gu Yang replied, “I’m just asking casually.”<br/><br/>The transactions didn’t think he was just asking casually. They all started to worry.<br/><br/>If the Liu family really sent people into the mountain, it wouldn’t be good news for these traders who made money from the mountain’s goods.<br/><br/>No matter what business the Liu family set their eyes on, they would resort to any means to seize it and drive others out of the game.<br/><br/>Therefore, there is a saying among the merchants in Ba County, “Where the Liu family sets foot, not a blade of grass grows.”\t\t\t\t\t\t</div>", "images": {}, "success": true}