{"id": 7, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14234365.html", "title": "Chapter 7 - Chapter 7: 007 Another Way To Die", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 7 - Chapter 7: 007 Another Way To Die</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 7: 007 Another Way to Die<br/><br/>Translator: 549690339<br/><br/>Half an hour later, Gu Yang learned the details about the gang of bandits from that young man.<br/><br/>The young man’s last name was Zhang and his full name was Zhang Xiao Hai. Originally a village youth from Xiang County, he was sent to the blacksmith’s shop in the town as an apprentice at the age of eleven.<br/><br/>Half a year ago, Guoshan Feng’s gang took over the small town, robbing and killing indiscriminately. Zhang Xiao Hai escaped because he was working at the blacksmith’s shop. He was captured along with his master’s family.<br/><br/>Such outrages finally completely angered the authorities who sent out troops to surround and wipe them out.<br/><br/>Guoshan Feng’s gang was defeated, even the second-in-command was killed, hundreds of bandits were either killed or captured.<br/><br/>Only the leader and the third-in-command, sensing the situation was bad, took about thirty men and fled deep into the Lian Mountain. They fled all the way to this vicinity, taking over a village to settle in.<br/><br/>In the chaos, Zhang Xiao Hai’s master’s family were all killed, and he was taken here in a daze.<br/><br/>However, he was unwilling to become a bandit. The night before, while the gang was caught up in the leader’s celebration and were off guard, he escaped.<br/><br/>Last night, he heard a bandit say that a caravan was spotted nearby and they were planning to rob it.<br/><br/>Zhang Xiao Hai knew how these people operated and couldn’t bear it, so he came over to warn them. Little did he know, he would be treated like this.<br/><br/>When he reached this point, he was still somewhat furious.<br/><br/>Gu Yang neither affirmed nor denied his story, instead asked some key questions, “What is the cultivation level of Guoshan Feng, the leader?”<br/><br/>“Eighth Grade.”<br/><br/>“What weapon does he use?”<br/><br/>“Saber.”<br/><br/>“How many bandits are still with him?”<br/><br/>“A little over thirty. The rest are just captives tasked with things like feeding the horses.”<br/><br/>More than thirty bandits, half of them being archers.<br/><br/>In addition to an Eighth Grade martial artist.<br/><br/>Gu Yang was also not too sure about his chances.<br/><br/>Then, he asked the most critical question, “What happened to the treasure Guoshan Feng has stolen over the years?”<br/><br/>Zhang Xiao Hai said, “There is a large box. I saw it when we were retreating. Guoshan Feng only allows his most trusted people to carry it. It should contain the money he has stolen over the years.”<br/><br/>Gu Yang’s eyes lit up. A large box, even if it were all silver, should count in the thousands.<br/><br/>Well, even though it’s difficult, there’s always a way.<br/><br/>…<br/><br/>After talking with Zhang Xiao Hai, Gu Yang returned to the caravan.<br/><br/>The bodies had been handled, and Hell’s Messenger’s head was neatly removed and packaged.<br/><br/>Old Gao came over with a pile of things and respectfully said, “Young Master, these were found on those men.”<br/><br/>Gu Yang looked and saw quite a few pieces of silver and half a book, the pages all yellowed.<br/><br/>Old Gao said, “There are more than thirty taels in total. And this book, it was found on Hell’s Messenger. He valued it highly, keeping it on his person.”<br/><br/>Gu Yang took the silver pieces, considering it an unexpected windfall. Then he picked up that half of a book and skimmed through it.<br/><br/>It recorded a saber technique, which seemed profound in his eyes. He put it into his jacket.<br/><br/>Old Gao rubbed his hands and asked, “So, what should we do about the bows and weapons?”<br/><br/>If you were to say what was the most valuable thing left behind by these bandits, it would naturally be these eight bows, all top-ranking horn bows.<br/><br/>Gu Yang picked up a bow at random and tried to draw it, it had to be around thirty kilograms.<br/><br/>He asked, “What is the usual market price for a bow like this?”<br/><br/>Old Gao answered, “This is a thirty-kilogram bow. If taken to the black market, it will sell for at least fifty taels each.”<br/><br/>One bow was enough for one round of Simulated Life.<br/><br/>Gu Yang said, “I’ll sell them to you for twenty-five taels each.”<br/><br/>Old Gao and the other merchants were somewhat tempted. Such a good bow was always in high demand and there would be no worry of finding a buyer. If they took it back, they’d have a one hundred percent profit.<br/><br/>Eight bows would bring them a pure profit of two hundred taels, divided among them, each would get fifty taels.<br/><br/>“But we didn’t bring that much ready cash.”<br/><br/>“That’s okay, you can write an IOU, and pay me back later.”<br/><br/>Old Gao and the others were overjoyed and hurried to express their thanks.<br/><br/>To Gu Yang, keeping these bows was useless, it would just be a burden to carry, being able to cash them in was what mattered.<br/><br/>After all, this was an unexpected windfall.<br/><br/>“Also, we can’t go to Wangjiagou, it’s been occupied by Guoshan Feng.”<br/><br/>Upon hearing this, Old Gao and the others were taken aback.<br/><br/>If they hadn’t encountered Hell’s Messenger, they would have run directly into the bandits’ den.<br/><br/>Thinking about it, they all felt a lingering fear.<br/><br/>…<br/><br/>The merchants were discussing in one corner where to go next.<br/><br/>Gu Yang walked to the side on his own. After topping up, his balance was once again over fifty.<br/><br/>He could use the Simulator of Life again.<br/><br/>“At the age of twenty-two, you became an Eighth Grade martial artist. Following the caravan, you left Liu Village and encountered a gang of bandits on the road, you took action and dealt with them.”<br/><br/>“You headed to Wangjiagou, intending to deal with Guoshan Feng’s gang, but were overcome by him. At a critical moment, a group of people stormed in and you were able to escape amid the chaos.”<br/><br/>“You inadvertently entered a swamp, encountered a mysterious person, and were eaten. You died.”<br/><br/>What the hell?<br/><br/>Gu Yang never expected that this simulation would end so disastrous for him. He was actually eaten by someone.<br/><br/>A chill ran down his spine.<br/><br/>Was the swamp near Wangjiagou that dangerous?<br/><br/>After a while, he managed to push away this negative feeling and began to think.<br/><br/>This simulation was of value.<br/><br/>At least it let him know one thing: as he is now, he’s no match for Guoshan Feng.<br/><br/>Also, those who charged into Wangjiagou at the critical moment were likely the Liu family’s group.<br/><br/>In previous simulations, they always encountered the Liu family hunting team near Wangjiagou, this matched up.<br/><br/>Which meant the Liu family was also after Guoshan Feng.<br/><br/>After the Liu family dealt with Guoshan Feng, they passed through Liu village on their way back, and completely destroyed it.<br/><br/>The reason was still unclear.<br/><br/>Gu Yang’s situation was like assembling a jigsaw puzzle. By repeatedly using the simulator, he could reconstruct the actual events.<br/><br/>Now, he was very close to the truth.<br/><br/>“Simulation over, you can retain one of the following.”<br/><br/>“One: Martial arts realm at the age of twenty-two.”<br/><br/>“Two: Martial arts experience at the age of twenty-two.”<br/><br/>“Three: Wisdom of life at the age of twenty-two.”<br/><br/>It was time to choose again.<br/><br/>Gu Yang thought for a while and chose the second option.<br/><br/>Suddenly, a string of memories of a fight appeared in his mind.<br/><br/>These were the memories of fighting with Guoshan Feng in his simulated life, each and every move deeply imprinted in his mind.<br/><br/>Gu Yang finally understood why he had lost: it was the weapon!<br/><br/>In terms of real power, Guoshan Feng was just one notch above him. The reason he lost so badly was because his weapon was too poor.<br/><br/>The long saber used by the opponent was very sharp.<br/><br/>He was using Hell’s Messenger’s ghost head saber. Halfway through the fight, it was broken with a strike. That’s when he lost.<br/><br/>If he had a better weapon, he might not have lost.<br/><br/>At this moment, Old Gao and the others came over again, “We’ve discussed it, and we decided to go back the way we usually go.”<br/><br/>Gu Yang was rather impressed by them, despite encountering such dangers, they still had the courage to continue their business.<br/><br/>He said, “In that case, let’s part ways here.”<br/><br/>Old Gao handed him a bag of money, “This is one hundred taels, and this is the IOU. Sir, please find me in Phoenix City in Ba County.”<br/><br/>He left a detailed address.<br/><br/>Gu Yang’s eyes lit up, this money was extremely timely.\t\t\t\t\t\t</div>", "images": {}, "success": true}