{"id": 8, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14234366.html", "title": "Chapter 8 - Chapter 8: 008 Life Is So Difficult", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 8 - Chapter 8: 008 Life Is So Difficult</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 8: 008 Life is so difficult<br/><br/>Translator: 549690339<br/><br/>Before long, Old Gao and the rest walked away with the mules, leaving only Zhang Xiao Hai alone, following behind Gu Yang.<br/><br/>Gu Yang paid him no heed, finding a clean rock to sit cross-legged on and added money to the system.<br/><br/>In an instant, the balance of the system goes up to 105.<br/><br/>[Would you like to use the Life Simulator? One use costs 50 money.]<br/><br/>“Yes.”<br/><br/>[At the age of twenty-two, you became an Eighth Grade martial artist and left Liu Village with a trade caravan. Along the way, you encountered some mountain bandits, but you eliminated them with ease. After learning that the bandit hideout was in Wang Jia Gully, you decided to avoid going there.]<br/><br/>[Two months later, you went to Tianshui City in Xiang County, presenting the heads of the mountain bandits to the local government office to collect the reward. After refusing to accept the county official’s invitation to serve him, you used the eight hundred taels you got to open a fur shop and started doing business.]<br/><br/>[At the age of twenty-eight, your business expanded tremendously, and you became the richest man in Tianshui City. Your wealth ignited the jealousy of some people, and you faced various suppressions. To protect yourself, you married the daughter of Dong Xuan, a famous Sixth Grade expert in Tianshui City.]<br/><br/>[You didn’t dare to continue expanding your business. You maintained your status quo and focused on martial arts instead.]<br/><br/>[At the age of twenty-nine, you accepted Zhang Xiao Hai as your disciple, as he was always loyal and dedicated in his work.]<br/><br/>[At thirty, you learned about the massacre of Liu Village, but you had your own wife and children by then and dared not think of revenge against the powerful enemy.]<br/><br/>[At thirty five, you had mastered the three stances of the Nameless Blade Technique from a book you got from the bandits, which greatly increased your strength.]<br/><br/>[At thirty-six, your business encountered a crisis, forcing you to intervene and exposing your Saber Technique.]<br/><br/>[At thirty-seven, just as you felt the opportunity to break through, you discovered that you were poisoned. The poison was given by your father-in-law, who wanted to force you to reveal the origin of the three stances of the Saber Technique.]<br/><br/>[Even after you gave him the half-book containing the Saber Technique, he crippled your meridians, leaving you handicapped and your firm was taken over by his disciples.]<br/><br/>[The purge of your legitimate successors in the business followed, and a month later, Zhang Xiao Hai disappeared.]<br/><br/>[Eight years later, you died in extreme depression from severe illness. At your dying moments, Zhang Xiao Hai appeared before you with the head of Dong Xuan, declared, “Master, I have avenged you,” before he spat out blood and died.]<br/><br/>[You died at the age of forty-five.]<br/><br/>“…”<br/><br/>After reading the outcome of this simulation, Gu Yang didn’t know what to say.<br/><br/>It was more pitiful than the one before.<br/><br/>Being backstabbed by his father-in-law, losing his martial arts, and dying so miserably.<br/><br/>And his father-in-law did all these just for the three stances of the Saber Technique.<br/><br/>In the previous Simulated Life, he was also betrayed by a county official who had previously admired him.<br/><br/>Living peacefully in this world is really difficult.<br/><br/>To learn advanced martial skills, one has to sell oneself to others, and even then, you might be discarded at any moment.<br/><br/>Despite the danger of attracting the envy of others whenever one obtains success in commerce, he managed to form an alliance with a suitable candidate. However, because of a few saber techniques, even one’s father-in-law could plot against you and swallow your entire business.<br/><br/>The road is full of thorns, and a small mistake could lead to a fall into a deep abyss.<br/><br/>However, this Simulated Life was not entirely without benefits.<br/><br/>Gu Yang looked at Zhang Xiao Hai, who was standing not far away, seemingly scared and felt a warmth in his heart. Who would have thought that this kid was so loyal?<br/><br/>Moreover, his talent was very good, far superior to Gu Yang himself.<br/><br/>Gu Yang’s father-in-law, Dong Xuan was a sixth-grade master, and twenty-three years later, Zhang Xiao Hai could kill Dong Xuan. This meant that Zhang Xiao Hai must be at least at the sixth-grade realm.<br/><br/>After many simulations, passing over a hundred years, Gu Yang still hasn’t managed to touch the boundary of the seventh grade.<br/><br/>It really… depressed him.<br/><br/>[The simulation has ended, and you may retain one of the following.]<br/><br/>[First, the martial arts realm at the age of thirty-seven.]<br/><br/>[Second, the martial arts experience at the age of thirty-seven.]<br/><br/>[Third, the life wisdom at the age of thirty-seven.]<br/><br/>As Gu Yang saw the three options, he became tangled.<br/><br/>At the age of thirty-seven, it was the peak of his Simulated Life, with just a step away from reaching the seventh grade.<br/><br/>However, he had learned the Nameless Blade Technique, which was so unique that it even enticed the sixth-grade warrior, Dong Xuan, to treat his son-in-law with such vile methods. This is definitely not an ordinary technique.<br/><br/>Defeating Guo Shan Feng should not be difficult with these saber techniques.<br/><br/>After pondering for a moment, Gu Yang chose, “I pick one.”<br/><br/>His reasoning remained the same, realm is fundamental.<br/><br/>As long as he breaks into the seventh grade, a minor bandit like Guo Shan Feng won’t be a problem at all.<br/><br/>In a moment, his True Qi began to rise, increasing by more than a fold.<br/><br/>Gu Yang felt as if he touched a barrier. His True Qi has reached the limit of this realm and can no longer be increased even a little bit more.<br/><br/>Just a breakthrough opportunity away from entering the next realm.<br/><br/>However, such an opportunity is not that easy to come by. In this simulation, he spent nearly ten years just to find one opportunity.<br/><br/>If it weren’t for Dong Xuan suddenly poisoning him, he should have broken through.<br/><br/>“With my current strength, defeating Guo Shan Feng should not be a problem.”<br/><br/>Gu Yang thought to himself.<br/><br/>As his True Qi increased by a factor of two, his strength increased significantly. In the previous fight with Guo Shan Feng, the odds were fifty-fifty. Now, it should be at least seventy-thirty in his favor.<br/><br/>“One more time.”<br/><br/>Just to be safe, Gu Yang used his last chance.<br/><br/>[At the age of twenty-two, you became an eighth-grade martial artist and left Liu Village with a trade caravan. Along the way, you encountered some mountain bandits, but you eliminated them with ease. After learning that the bandit hideout was in Wang Jia Gully, you avoided going there.]<br/><br/>[Two months later, you went to Tianshui City in Xiang County with the heads of the mountain bandits to collect a reward from the government office. Later on, you were recognized for your exceptional skills and invited to join the Zheng family, where you received special training.]<br/><br/>[At twenty-five, you broke through to the seventh grade.]<br/><br/>[At thirty-five, failing to break through to the sixth grade, you were doubted by the Zheng family, gradually marginalized, and finally exiled to Tianshui City to serve as a functionary]<br/><br/>[At thirty-eight, a Zheng family disciple passing through Tianshui City got into big trouble for flirting with Cao Yiyi, ranked tenth on the Beauty List. One of Cao Yiyi’s followers came knocking on your door, wiped out everyone of the Zheng family in Tianshui City with a single sword, and you were stabbed in the throat with the second sword, killing you at the age of thirty-eight.]<br/><br/>Another way to die.<br/><br/>Why is it so difficult to live a peaceful life?<br/><br/>After reading his brief life, Gu Yang sighed inwardly, even joining a noble family, this road is not easy.<br/><br/>He ended up dying because of a useless noble son who dared to flirt with someone on the Beauty list. It’s bad enough that he sought death, but he had to drag him down, causing him to suffer such an unwarranted calamity.<br/><br/>[The simulation has ended, and you may retain one of the following.]<br/><br/>[First, the martial arts realm at the age of thirty-eight.]<br/><br/>[Second, the martial arts experience at the age of thirty-eight.]<br/><br/>[Third, the life wisdom at the age of thirty.]<br/><br/>Gu Yang didn’t hesitate, “Pick one.”\t\t\t\t\t\t</div>", "images": {}, "success": true}