{"id": 3, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14234361.html", "title": "Chapter 3 - Chapter 3: Tianjiao List 003", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3 - Chapter 3: Tianjiao List 003</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3: Tianjiao List 003<br/><br/>Translator: 549690339<br/><br/>After nightfall, Gu Yang, carrying a jar of wine, went to Liu Shitou’s house next door to invite him for a drink.<br/><br/>The wine was made by himself, and it had been exactly a year now.<br/><br/>After a few cups, Gu Yang said somewhat pensively, “Two years ago, had you not given me something to eat, I would have starved to death. This cup is for you.”<br/><br/>Liu Shitou drained the wine and said, “We all survive in the mountains. We should naturally help others when they are in trouble.”<br/><br/>“For you, it was a mere act of kindness. For me, it was life-saving grace.”<br/><br/>Speaking, Gu Yang took out a book and said, “This is the ‘Xuan Yuan Method’, although only the first layer is outlined, it’s enough for cultivation.”<br/><br/>Liu Shitou looked at the book, which was densely filled with characters, obviously handwritten by Gu Yang.<br/><br/>He filled another bowl of wine and drank it dry, burping, “I can’t read, though.”<br/><br/>“You could ask the village chief or hand it over to your son.”<br/><br/>The village chief was the only literate person in the village. Gu Yang had learned from him.<br/><br/>“Are you leaving?”<br/><br/>“Yes.”<br/><br/>Liu Shitou stopped talking, enjoying his wine in silence.<br/><br/>After a while, the jar of rice wine was almost empty. He drank the last bowl of wine and slammed the bowl on the table, saying hoarsely, “The outside world is perilous. Don’t die out there.”<br/><br/>Gu Yang laughed, “Don’t worry, I have a strong will to live.”<br/><br/>As he was leaving, he said to the room, “Take care.”<br/><br/>…<br/><br/>By early morning, the rain had already stopped.<br/><br/>Gu Yang arrived at the village entrance, where the caravan was ready to depart.<br/><br/>Speaking of a caravan, it was actually a mule train of a dozen or so mules. Old Gao, with a third of that, and the rest were owned by three other traveling merchants.<br/><br/>The Lian Mountain range was vast, with countless villages like Liu Family Village. The villagers lived by hunting and amassed countless animal skins every year.<br/><br/>Merchants merely needed to offer some cheap daily necessities, such as salt, to get the precious animal skins and medicinal materials in return.<br/><br/>Because of this, despite the numerous dangers in the mountains, fearless traveling merchants like Old Gao came punctually every year to buy goods.<br/><br/>Now, they even dared to open a new trade route through the dangerous area of Wang Family Gorge.<br/><br/>One had to say, they dared to take any risk for profit.<br/><br/>As soon as Gu Yang appeared, Old Gao came over with the other three merchants and greeted him.<br/><br/>“Young Master Gu, we discussed it yesterday. If you’re willing to accompany us to the Wang Family Gorge, we are willing to offer a hundred silver taels. We only have a small request that if we encounter any dangers, we hope you could assist us.”<br/><br/>Gu Yang looked at their humble appearance; they avoided mentioning the role of a guide and only talked about accompanying them, even proactively raising the fee to a hundred taels.<br/><br/>Thinking back to yesterday, when he asked for just twenty taels, Old Gao almost had a fit.<br/><br/>Comparing the two situations, the only difference was his status.<br/><br/>Yesterday, in their eyes, he was just an ordinary hunter from the deep mountains.<br/><br/>But now, they knew he was a ninth-rank martial artist and immediately became obsequious.<br/><br/>Gu Yang said, “Alright.”<br/><br/>Old Gao promptly handed over a money bag.<br/><br/>Gu Yang received it, noting how light it was. When he opened it, it turned out to be gold leaves, roughly one tael each.<br/><br/>It seemed that the gold to silver ratio in this world was around 100 to 1.<br/><br/>“Let’s go.”<br/><br/>Gu Yang pocketed the gold and set off with them.<br/><br/>…<br/><br/>[Top-up success. The current balance is 104.5.]<br/><br/>[Would you like to use the Life Simulator? Each use costs 20 gold.]<br/><br/>After receiving the money, Gu Yang topped up immediately and then chose ‘Yes’.<br/><br/>[At the age of 22, you became a ninth-rank martial artist and decided to venture out with the caravan. In Wang Family Gorge, you encountered a hunting party and were attacked. You managed to kill a few of them before being killed on the spot. You lived until the age of 22.]<br/><br/>What?!<br/><br/>Gu Yang looked at the result of this simulation, his eyes narrowing.<br/><br/>His strength was clearly much stronger than before. Why was it that he managed to escape last time, but got killed this time?<br/><br/>Moreover, he had been clever yesterday; he asked Old Gao to consider for a night, delaying the departure by a day.<br/><br/>Usually, Old Gao and his people wouldn’t spend the night in Liu Family Village.<br/><br/>Yet, he still ran into that hunting party.<br/><br/>Who exactly were they?<br/><br/>[The simulation ends. You can keep one of the following.]<br/><br/>[1. Your martial arts realm at the age of 22.]<br/><br/>[2. Your martial arts experience at the age of 22.]<br/><br/>[3. Your life wisdom at the age of 22.]<br/><br/>Without hesitation, Gu Yang chose the third.<br/><br/>From here to Wang Family Gorge, judging by the speed of the caravan, it would take about two to three days. The simulation showed that his time of death should be a few days later.<br/><br/>Picking the martial arts realm and experience would be meaningless.<br/><br/>As for this ‘life wisdom’, he wanted to see what it was all about.<br/><br/>The next moment, some fragments of memory appeared in Gu Yang’s mind.<br/><br/>He finally “saw” what the hunting party looked like. There were about ten riders in total. The leader was a young man, and the rest were his guards and subordinates.<br/><br/>Before he died, he asked, “Who are you guys?”<br/><br/>“Remember, Young Master of the Liu family.” The last thing he heard was an arrogant and domineering voice.<br/><br/>In the end, only four words remained in Gu Yang’s heart, “Cannot be resisted!”<br/><br/>So, this was the life wisdom he gained from this simulation?<br/><br/>…<br/><br/>“Young Master Gu, could we rest a bit?”<br/><br/>When the sun was high, Old Gao suggested taking a break.<br/><br/>Gu Yang didn’t mind at all. When they stopped, the cargo handlers in the caravan got busy immediately.<br/><br/>He took the opportunity to ask Old Gao, “Have you heard of the Liu family?”<br/><br/>Old Gao said, “In Ba County, who hasn’t heard of the Liu family? Even the county magistrate relies on the Liu family to secure his position.”<br/><br/>West of Lian Mountain was Ba County.<br/><br/>County was the administrative unit of this world, below the state level. Ba County was a county under Jiangzhou. Probably equivalent to a city at the prefecture level.<br/><br/>This Liu family was undoubtedly a local influential.<br/><br/>Gu Yang asked further, “What is Liu family’s reputation like?”<br/><br/>Old Gao smiled somewhat embarrassingly, “I wouldn’t dare to criticize the Liu family.”<br/><br/>“What’s there to be afraid of saying?”<br/><br/>Suddenly, a merchant nearby interjected, “If it weren’t for the Liu family monopolizing the market and squeezing us small merchants, we wouldn’t need to venture into the hazardous Lian Mountain for business.”<br/><br/>Gu Yang remembered the introduction earlier, this person was surnamed Yang.<br/><br/>The Yang merchant said with resentment, “In Ba County, all profitable businesses are monopolized by the Liu family. They are still not satisfied and have imposed heavy taxes on all trades in recent years. It’s said that they even collaborated with the county magistrate to frame other wealthy families and confiscated their properties.”<br/><br/>Clearly, he held a deep grudge against the Liu family.<br/><br/>Gu Yang asked, “What gives the Liu family this privilege?”<br/><br/>“Of course, it’s because of their prodigy, Liu Zhe, who ranks ninth on the Talents List. A second-grade martial artist at the age of 20, him entering the realm of Divine Power is just a matter of time.”<br/><br/>A twenty-year-old second-grade martial artist?<br/><br/>Gu Yang felt a chill on his scalp.<br/><br/>He was only ninth-grade now, and he had no idea how many times he would need to simulate with his ability to reach second-grade.<br/><br/>Such a high-level master was present in a mere family of a county.<br/><br/>Indeed, this world was far more dangerous than he imagined.\t\t\t\t\t\t</div>", "images": {}, "success": true}