{"id": 9, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14234367.html", "title": "Chapter 9 - Chapter 9: 009 Got Rich", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 9 - Chapter 9: 009 Got Rich</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 9: 009 Got Rich<br/><br/>Translator: 549690339<br/><br/>Zhang Xiao Hai crouched beside a big tree, watching a young man not much older than himself in the distance, and found him rather mysterious.<br/><br/>He had never seen a martial artist like him, who wore coarse linen clothes, patched up here and there, no different than a hunter in the mountains.<br/><br/>Before this, the martial artists he had met were either high-ranking, dressed in bright clothes and riding majestic horses like distinguished offspring, or they were terrible, murderous bandit heads like Guo Shanfeng, who kill without blinking an eye.<br/><br/>And that’s precisely why Zhang Xiao Hai felt a deep sense of familiarity.<br/><br/>When he lived in the village, his neighbour was a hunter who taught him many things.<br/><br/>That was why he had knelt down in the heat of the moment and had asked to become a disciple.<br/><br/>After being rejected, Zhang Xiao Hai had given up in his heart. He knew that this was his only chance to change his fate.<br/><br/>If he returned like this, he would either end up like his parents, farming for his entire life, or he would be sent by his parents to be an apprentice and let others boss him around.<br/><br/>However, due to his innate respect for martial artists, he didn’t dare to get too close and observed from afar.<br/><br/>Zhang Xiao Hai watched for a while then suddenly felt that the master had changed, but he couldn’t say exactly how.<br/><br/>At that moment, the master opened his eyes and turned to look in his direction.<br/><br/>Zhang Xiao Hai felt a cold glare, and his heart trembled with fright, his body stiffened there.<br/><br/>“Come over and lead the way.”<br/><br/>Following this, a calm voice rang in his ears.<br/><br/>Zhang Xiao Hai was a bit stunned, immediately followed by immense joy, he stood up quickly, and exclaimed excitedly, “Yes, sir.”<br/><br/>“My name is Gu Yang, not sir.”<br/><br/>“Yes.”<br/><br/>“Let’s go.”<br/><br/>…<br/><br/>Gu Yang did not plan to directly take Zhang Xiao Hai as his disciple.<br/><br/>In the game of simulated life, Zhang Xiao Hai proved to be truly loyal, risking his life to avenge him. But that was just in the game’s life.<br/><br/>Zhang Xiao Hai had become what he was because of his experience in that life.<br/><br/>At present, it’s safe to say he possesses decent qualities and is like unpolished jade. The question of what he’ll eventually grow into will depend on his teachings.<br/><br/>A necessary test must be given.<br/><br/>This is like teaching children; it wouldn’t be right to give them everything they want. No one knows what type of spoiled brats they might become.<br/><br/>…<br/><br/>Without the drag of mules or horses, the traveling speed of Gu Yang and Zhang Xiao Hai increased significantly.<br/><br/>Before the nightfall, they arrived near Wang’s Gully.<br/><br/>Gu Yang had been hunting nearby in the swamp before but never stepped into the village. The village people were infamous for their hostility towards outsiders.<br/><br/>He had a rough idea of its location.<br/><br/>Zhang Xiao Hai led the way and pointed out two covert sentry posts.<br/><br/>Gu Yang took care of them quietly.<br/><br/>Zhang Xiao Hai whispered, “All the old guards are at a lax post today because it’s the head bandit’s celebratory day. They have all gone to celebrate.”<br/><br/>“What about the villagers?”<br/><br/>“All killed.”<br/><br/>Gu Yang looked at the village under the moonlight. He saw it had a similar scale to Liu’s village. With a faint voice, he asked, “What about the children and women?”<br/><br/>Zhang Xiao Hai remembered the incident and turned pale as he said grimly, “All killed.”<br/><br/>With no expression on his face, Gu Yang said, “Inside, how many were like you, hadn’t stained their hands with the blood of villagers?”<br/><br/>“There’s another 13 like me, in tattered clothes, easy to identify.”<br/><br/>“Where does Guo Shanfeng live?”<br/><br/>“In the largest house right in the middle.”<br/><br/>Gu Yang clenched his Ghost Head Saber and headed inside, saying, “Wait for me here.”<br/><br/>Watching his fearless silhouette, Zhang Xiao Hai felt stirred. He softly reminded, “Sir, be careful.”<br/><br/>…<br/><br/>Rather than a village, Wang’s Gully was more like a stockade, surrounded by a few-meter-high earthen wall with only one entrance.<br/><br/>No wonder it was targeted by Guo Shanfeng; the location was perfect for a bandit’s lair.<br/><br/>Such a wall couldn’t stop a martial artist like Gu Yang. He leaped over the wall and snuck in quietly.<br/><br/>He moved towards the center of the village, encountering no one on his way. All the bandits seemed to have gone to celebrate.<br/><br/>After a while, he could hear the loud noises of drinking and playing games.<br/><br/>Gu Yang sneaked up and saw a few tables spread out in an open area with dozens of people drinking. Some people were serving at the side.<br/><br/>He looked at those people quietly while discerning which ones were bandits and which ones were victims from their attire.<br/><br/>Gu Yang then moved around the house, sneaked into the courtyard, and started searching for Guo Shanfeng’s treasure box.<br/><br/>Bandits like Guo Shanfeng wouldn’t trust anyone and would only keep their treasure box in their rooms.<br/><br/>As Gu Yang moved closer to the only room with light, he saw a young girl wiping her tears walking out. The door had just been pushed open when they bumped into each other. The young girl was about to cry out when she saw someone outside.<br/><br/>Gu Yang quickly covered her mouth with one hand and dragged her to a corner.<br/><br/>The girl was beautiful, with fair skin and dressed in what seemed like high-quality silk clothing. As he drew nearer to her, he could even smell a faint fragrance from her body.<br/><br/>This was the first girl he encountered since his arrival that fit his aesthetic standards.<br/><br/>The living conditions in Liu’s Village were harsh. The girls there were malnourished, and their skin turned dark from constant outdoor work. The clothes they wore had been patched up multiple times.<br/><br/>Under such conditions, it was impossible to find any beauties.<br/><br/>One of the main reasons why Gu Yang didn’t wish to marry was this.<br/><br/>He was unsure of the girl’s identity as he met her in the bandit’s hideout.<br/><br/>He whispered in her ear, “Don’t make a sound. I have questions for you. If it’s yes, nod your head. If it’s no, shake your head. Do you understand?”<br/><br/>The girl’s eyes widened with terror, her lashes still wet with tears, which made her look pitiful. She nodded hard at Gu Yang’s command.<br/><br/>“Do you know where Guo Shanfeng hid his treasure?”<br/><br/>The girl stared at him, bewildered.<br/><br/>Gu Yang frowned, “I asked you a question, do you know?”<br/><br/>The girl snapped out of her distraction and gave a quick nod.<br/><br/>“Which room? Show me.”<br/><br/>She pointed not to a room but to the well in the courtyard.<br/><br/>Hid it in the well?<br/><br/>Gu Yang didn’t let go of the girl, fearing she might scream and attract attention.<br/><br/>He dragged her to the well and peered into the pitch-black emptiness. All he could see was a bit of water gleaming in the bottom.<br/><br/>“If you lie to me, I’ll drop you in there.”<br/><br/>The girl shook her head frantically.<br/><br/>He jumped in with her in his arms, using one hand to grip the well’s side and slowly slide down. Soon, they fell into the water.<br/><br/>The chilly water was bone-piercing. The girl shivered uncontrollably as she touched the water.<br/><br/>The water in the well was only about a meter deep. Gu Yang soon touched the bottom and the box underneath.<br/><br/>He warned the girl, “Don’t make a sound.” And then he let go.<br/><br/>Keeping her mouth tightly shut, the girl refrained from making any noise.<br/><br/>Gu Yang reached for the box at the bottom of the well. He lifted it up, opened the system panel, and chose to recharge.<br/><br/>[Top-up successful, the current balance is 5325.5.]<br/><br/>Seeing this balance, he was overjoyed.<br/><br/>Now, he was rich!\t\t\t\t\t\t</div>", "images": {}, "success": true}