{"id": 1, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14234359.html", "title": "Chapter 1 - Chapter 1: 001 Life Simulator", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 1 - Chapter 1: 001 Life Simulator</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 1: 001 Life Simulator<br/><br/>Translator: 549690339<br/><br/>Early in the morning, the rain was drizzling down, enveloping the entire Liu Family Village in a veil of mist.<br/><br/>Under the eaves at the front of the house, Er Ya was sitting on a bamboo stool, supporting her chin with her hands, constantly gazing expectantly towards the alley entrance.<br/><br/>Finally, a tall figure appeared at the entrance of the alley.<br/><br/>Er Ya’s eyes lit up. She hopped down from the stool and excitedly called out, “Brother Gu Yang, it’s raining today so we’re not going into the mountains, right? Please continue the story of the Monkey King. What happened to him after he was trapped under the Five Finger Mountain?”<br/><br/>The man named Gu Yang looked up, his broad smile revealing pearly white teeth, “I’ll continue it next time when I have the chance. The trade caravan is here, I need to sell the mountain goods.”<br/><br/>Er Ya watched his retreating figure, her face flushing with anticipation, “Brother Gu Yang is so handsome, if only I could marry him someday…”<br/><br/>With that thought, she was simultaneously bashful and filled with sweetness.<br/><br/>She was eleven years old this year and according to village customs, she would be of marriageable age in two years.<br/><br/>…<br/><br/>Not long after Gu Yang left, he bumped into an enthusiastic elder woman who greeted him warmly, “Gu Yang, how about that girl I mentioned to you last time?”<br/><br/>“I tell you, that’s the most outstanding girl in the entire area – beautiful and virtuous. The number of people proposing marriage at her home has worn out their doorstep. She has her eyes on you, she said, no need for a dowry, just bring some cured meat as a token… ”<br/><br/>Gu Yang gave a wry smile at this enthusiastic woman, “Aunt Jiu, I’m used to a wandering life. Let’s not bother this young lady. Please help me reject her. I have to go get the mountain goods…”<br/><br/>With that, he quickly slipped away.<br/><br/>“Hey, hey, I haven’t finished speaking yet…”<br/><br/>…<br/><br/>…<br/><br/>After shaking off Aunt Jiu, Gu Yang finally breathed a sigh of relief.<br/><br/>The girl Aunt Jiu mentioned was only fourteen, but had already grown a pair of broad shoulders and a wide waist – a handful he could not handle.<br/><br/>Suddenly, he gave a bitter smile, “For a transmigrator to end up like this, it’s rather pitiful.”<br/><br/>He was hiding a grand secret; he wasn’t from this world, but from Earth. And, two years ago, he had transmigrated over.<br/><br/>Furthermore, it was a case of an unusual body possession.<br/><br/>Two years had passed, yet he hadn’t even managed to leave this starter village.<br/><br/>The village was known as the Liu Family Village, located deep within the mountains. One would have to travel for a full day and night just to reach the nearest market.<br/><br/>The villagers of the Liu Family Village had chosen to relocate to the vast mountains to escape exorbitant taxes and corvee labor.<br/><br/>When Gu Yang had first transmigrated, he appeared in nearby woods and nearly starved to death, if not for the villagers of Liu Family Village taking him in.<br/><br/>He’d been living here for two years, learning their language and survival skills like hunting and farming in order to adapt to this new world.<br/><br/>The village was cut off, so the amount of news he received was limited. Until now, he still only knew that this kingdom was called Great Zhou.<br/><br/>The Liu Family Village was located in Jiangzhou territory, within the Lian Mountain range.<br/><br/>Moreover, this world was filled with powerful figures who mastered extraordinary skills.<br/><br/>The most formidable hunter in the village was Liu Shitou, the very person who saved him. Liu Shitou could kill a leopard with a punch.<br/><br/>According to Liu Shitou, his skills were rudimentary and vastly inferior to those of the true experts of this world.<br/><br/>After countless pleas from Gu Yang, Liu Shitou agreed to teach him his family’s martial arts.<br/><br/>After nearly two years of practice, his body had merely grown stronger and more resilient. Gu Yang hadn’t sensed the ‘Qi’ that Liu Shitou mentioned.<br/><br/>Liu Shitou comforted him, saying that his slow progress was due to his advanced age and having missed the prime age for martial arts training.<br/><br/>However, Gu Yang knew that this was only partly true. His talent must also be exceptionally poor.<br/><br/>Without any unexpected opportunities, he could only dream of becoming a martial artist in this lifetime.<br/><br/>Nevertheless, Gu Yang hadn’t completely given up hope.<br/><br/>He had one last card to play.<br/><br/>When he transmigrated, a panel had also appeared before him, named the “Simulator of Life”.<br/><br/>This was likely his cheat ability.<br/><br/>However, this cheat had remained unusable. Each time he opened it, a notice would pop up stating “Insufficient balance, please top-up.”<br/><br/>He tried various ways to top-up, only to find that the only working method was using the currency of this world.<br/><br/>So far, he’d topped-up over eight-thousand Wen, equivalent to over eight taels of silver.<br/><br/>Gu Yang believed that as long as he kept up with the top-ups, there would inevitably come a time when he amasses enough to activate his cheat ability.<br/><br/>At this time, he finally reached his home.<br/><br/>…<br/><br/>In such a remote mountain village as the Liu Family Village, a caravan would come only once every few months to purchase furs, medicinal materials, and the like.<br/><br/>Gu Yang had gathered everything he’d saved over the past months and brought them over, the most valuable item being a complete piece of mink fur.<br/><br/>After a bout of haggling, he sold it all for just over two taels of silver.<br/><br/>This price was certainly a loss.<br/><br/>However, there was no choice — it was a buyer’s market.<br/><br/>If he didn’t sell to them, he’d have to go to the nearest market and resort to bartering. In these large mountains, no one used silver taels. These wandering merchants had only brought silver at his explicit request.<br/><br/>After selling his goods, Gu Yang returned home and closed the door.<br/><br/>He opened the system, took a deep breath, and selected “Recharge.”<br/><br/>The two taels of silver in his hand instantly disappeared into thin air.<br/><br/>[Recharge successful, current balance is 10.3.]<br/><br/>[Would you like to use the Life Simulator? Each use costs 10 credit points.]<br/><br/>Upon seeing this prompt, Gu Yang’s eyes started to moisten.<br/><br/>Two years later, he’d finally completed the primitive accumulation and saved enough to use the cheat.<br/><br/>He couldn’t wait any longer and pressed yes, “Yes!”<br/><br/>Suddenly, lines of text started to appear before his eyes.<br/><br/>[At twenty, you are stranded in the Liu Family Village and are taken in by villager Liu Shitou.]<br/><br/>[At twenty-two, you decide to follow a caravan and venture out. You encounter a hunting team on the road and are hunted. You jump into the river and narrowly escape with your life.]<br/><br/>[Severely injured, you are rescued by a merchant surnamed Wang. To repay him for saving your life, you work in his shop as an accountant for five years.]<br/><br/>[At twenty-seven, you save enough money to buy the “Xuan Yuan Method” and embark on the road of cultivation.]<br/><br/>[At thirty-seven, after ten years of practice, you finally achieve the first level and become a Ninth Rank martial artist.]<br/><br/>[At forty, your employer offends a seventh-grade martial artist who comes to kill him. You try to resist desperately, but are killed on the spot, ending your life.]<br/><br/>…<br/><br/>Is that it?<br/><br/>Gu Yang was somewhat speechless after reading it.<br/><br/>It took more than a decade to become the lowest rank of martial artist. His talent was appalling.<br/><br/>In other words, without this cheat, his life would remain just like this.<br/><br/>Could he be considered the worst transmigrator in this world?<br/><br/>[Simulation ended, you may retain one of the following items.]<br/><br/>[One, martial arts realm at forty.]<br/><br/>[Two, martial arts experience at forty.]<br/><br/>[Three, life wisdom at forty.]<br/><br/>Upon seeing this, Gu Yang was overjoyed.<br/><br/>Which meant he could immediately have the realm, martial arts experience, or life wisdom from the simulation when he was forty. He could choose one of the three.<br/><br/>What good fortune!<br/><br/>Without any hesitation, Gu Yang chose the first option.<br/><br/>For him at this moment, the most important thing was obviously the martial arts realm.<br/><br/>As the saying goes, practice martial arts without practicing skills, and all is for naught.<br/><br/>Power is the key.<br/><br/>In the next moment, Gu Yang felt a surge of heat circulating throughout his body. In his mind, the formula for the first level of the “Xuan Yuan Method” naturally floated up.<br/><br/>The True Qi in his body responded as naturally as if he had practiced for ten years.<br/><br/>He had officially become a Ninth Rank martial artist.<br/><br/>“Did I really make it?”<br/><br/>Gu Yang was still in disbelief as he threw a punch at the door frame. As the True Qi circulated, he heard a bang as his fist punched straight through the frame.<br/><br/>He looked at his unscathed hand and then at the hole, feeling a wave of grand emotions.<br/><br/>He knew that from this moment on, his days of hardship would become a thing of the past.\t\t\t\t\t\t</div>", "images": {}, "success": true}