{"id": 2, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14234360.html", "title": "Chapter 2 - Chapter 2: 002 Apology", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 2 - Chapter 2: 002 Apology</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 2: 002 Apology<br/><br/>Translator: 549690339<br/><br/>“The key is still to earn more money.”<br/><br/>After calming down, Gu Yang thought about the most crucial point.<br/><br/>This system, like those games from his previous life, requires money at every turn.<br/><br/>Only with money could he continue to simulate life.<br/><br/>However, now that he was a warrior and had the power, earning money would be much more comfortable than before; no longer a struggle.<br/><br/>He had to stalk in the mountains for several days just for that mink.<br/><br/>Gu Yang thought to himself, “It’s time to leave Liu Family village.”<br/><br/>Just then, a strapping figure walked over, “Gu Yang, are you alright? I heard some noise, I thought your house had collapsed.”<br/><br/>The visitor was none other than Liu Shitou, who had taken him in initially.<br/><br/>Gu Yang’s house was also built with his help. It was right next to his house.<br/><br/>Gu Yang said, “It’s nothing. I was just practicing.”<br/><br/>Liu Shitou’s gaze fell upon the hole on the doorframe showing a look of astonishment, “Is this… are you…?”<br/><br/>Gu Yang knew what he wanted to ask. He did not hide it and nodded, “Yes, I have cultivated true Qi.”<br/><br/>The cultivation of true Qi is a sign of entering a rank.<br/><br/>Liu Shitou was so shocked that he couldn’t speak.<br/><br/>The martial art his family passed down was, indeed, inferior. His father and grandfather had practiced their whole lives but could never cultivate true Qi.<br/><br/>In this life, Liu Shitou did not have any significant aspirations. After many years of practicing martial arts, he also longed to enter a ranked martial art level.<br/><br/>Now, Gu Yang had done it.<br/><br/>He sincerely felt happy for Gu Yang.<br/><br/>…<br/><br/>“Brother Gu.”<br/><br/>Suddenly, a middle-aged man came from outside. It was the merchant who had bought things from Gu Yang, “Brother Liu is also here, that’s perfect.”<br/><br/>Seeing him, Gu Yang was somewhat surprised, “Old Gao, what brings you here?”<br/><br/>“There is indeed something I want to discuss with you.” Old Gao laughed.<br/><br/>“Let’s talk inside.” Gu Yang invited him into the house.<br/><br/>Old Gao expressed his purpose directly, “This is the situation: we are planning to go to Wang Family ditch, and we would like to hire you to be our guide.”<br/><br/>Upon hearing the name ‘Wang Family Ditch’, Liu Shitou, who was standing by, turned pale.<br/><br/>Gu Yang was somewhat curious, “How do you know that I can find the way to Wang Family ditch?”<br/><br/>Wang Family Ditch, a swamp more than dozens of miles away, was filled with poisonous mist and miasma year-round, with many poisonous insects infesting, it was a dangerous place.<br/><br/>What’s strange is that there’s a village near there, where all the villagers’ surnames are Wang. This was the origin of the name ‘Wang Family Ditch’.<br/><br/>The village was very alienating to outsiders and barely had contact with the surrounding villages. It was very peculiar.<br/><br/>Old Gao laughed, “The mink fur you sold me belongs to the purple mink that is unique to Wang Family Ditch.”<br/><br/>Gu Yang said, “Wang Family Ditch is dangerous.”<br/><br/>Old Gao said, “If brother Gu is willing to be this guide, we are willing to pay two taels of silver as a reward.”<br/><br/>“In the whole Liu Family village, only he and I know how to get to Wang Family Ditch.” Gu Yang showed his white teeth, “You need to pay more.”<br/><br/>“How much do you want?”<br/><br/>“Twenty taels.”<br/><br/>“Impossible.” Old Gao almost jumped up.<br/><br/>This was plain robbery.<br/><br/>Gu Yang laughed, stretched out his finger, and poked a hole straight through the table.<br/><br/>A warrior?!<br/><br/>Upon seeing this, Old Gao couldn’t help but gasp. He couldn’t believe his eyes when he looked at Gu Yang, shaking his head in disbelief.<br/><br/>“I’ve been blind and offended you. I beg your pardon.”<br/><br/>He deeply bowed to Gu Yang, his tone reaching the utmost respect.<br/><br/>This swift change in attitude was somewhat unexpected to Gu Yang.<br/><br/>He displayed his power as a ranked warrior naturally to bargain. He didn’t expect that it would scare Old Gao that much.<br/><br/>It seemed the status of a warrior in this world was exceptionally high.<br/><br/>Gu Yang didn’t respond, Old Gao forehead began to sweat, he quickly untied his money bag, and presented it to him with both hands.<br/><br/>Instead of accepting it, Gu Yang asked, “What’s this about?”<br/><br/>“The market price of the purple mink fur should be thirty taels. Here are twenty taels, and eight taels are still missing; when I return, I’ll replenish it.” Old Gao felt a weight lift from his hand, his heart also followed.<br/><br/>He never imagined that this young man who hid in Liu Family village would be a warrior.<br/><br/>If he had known earlier, he wouldn’t have dared to offer that price.<br/><br/>But then, Old Gao also felt wronged. Who could predict that a distinguished warrior would lower himself so much?<br/><br/>If he had declared his identity early on, would there be such a thing?<br/><br/>This wasn’t over yet.<br/><br/>This wouldn’t go away easily without bleeding a lot one more time.<br/><br/>Thinking about this, Old Gao felt heartbroken.<br/><br/>At this moment, Gu Yang finally spoke up, “Twenty taels are enough; you also need to make a bit.”<br/><br/>Old Gao, hearing these words, almost couldn’t believe his ears. He was let off so easily, he excitedly said, “Thank you, you are magnanimous.”<br/><br/>“Alright, regarding the guide thing, go back and discuss it again.” Gu Yang waved his hand, letting him leave.<br/><br/>…<br/><br/>After Old Gao left, Liu Shitou also departed quickly.<br/><br/>Gu Yang weighed the money bag Old Gao had left and felt somewhat sentimental.<br/><br/>In the past, he had worked hard for two years to save up ten taels of silver.<br/><br/>Now, he just showed a bit of strength as a warrior, and people automatically offered up twenty taels, even fearing that he would not accept them.<br/><br/>The disparity was too big.<br/><br/>Gu Yang closed the door, opened the system page, “Top up.”<br/><br/>“Top up successful, current balance is 24.5.”<br/><br/>There were a total of 24 taels in this bag.<br/><br/>“Would you like to use the life simulator? Use it once at the cost of 20 coins.”<br/><br/>The price actually increased, doubled even.<br/><br/>Gu Yang felt a little pain and chose “Yes”.<br/><br/>“At twenty years old, you ended up in Liu Family village, being taken in by village Liu Shitou.”<br/><br/>“At twenty-two, you became a ninth rank warrior, decided to go out and try your luck with trade caravan. In Wang Family Ditch, you encountered a hunting team and were attacked. You were no match for them and escaped.”<br/><br/>“You returned to Liu Family village only to find the village massacred. All villagers were gone without exception and you swore revenge.”<br/><br/>“After leaving the mountain, you came to Phoenix City and joined a certain family, becoming a guard. Despite your strenuous cultivation for more than ten years, you were unable to break through to the eighth rank. Unable to hold back your desire for revenge, you found one of the culprits, and when you took action, you were killed by his guard. The end of your life was at thirty-seven years old.”<br/><br/>This time in simulation, his starting point was the ninth rank. The encounter was entirely different from the last time.<br/><br/>The only common thing was that he ran into that hunting team again.<br/><br/>Gu Yang’s expression went gloomy, “They even massacred Liu Family village!”<br/><br/>These two years, he had been living in the village and had deep feelings for the village.<br/><br/>He clenched his fist, now that he knows in advance, he will not let such a tragedy happen.<br/><br/>“The simulation is over, and you can keep one of the following items.”<br/><br/>“One, the martial arts realm at hit thirty-seven years old.”<br/><br/>“Two, the martial arts experience at hit thirty-seven years old.”<br/><br/>“Three, the life wisdom at hit thirty-seven years old.”<br/><br/>This time in simulation, he did not break through to the eighth rank.<br/><br/>So, Gu Yang chose the second item – martial arts experience.<br/><br/>After making the selection, numerous knowledge and experiences suddenly flooded into his mind: boxing, leg movements, sword techniques…various fighting skills.<br/><br/>These were all obtained from diligent cultivation during this life simulation.<br/><br/>Now, he could be considered a real ninth level warrior, with both the realm and corresponding power.\t\t\t\t\t\t</div>", "images": {}, "success": true}