{"id": 5, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14234363.html", "title": "Chapter 5 - Chapter 5: 005 No Money Left", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 5 - Chapter 5: 005 No Money Left</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 5: 005 No money left<br/><br/>Translator: 549690339<br/><br/>The village of Liu Family was very quiet at night, interrupted only by the occasional sound of dogs barking.<br/><br/>In a wooden house, a thin old man was sitting leisurely eating a plate of stir-fried soybeans. Suddenly, he looked outside the house with a vigilant gaze. “Who’s there?”<br/><br/>“It’s me.”<br/><br/>“Gu boy?”<br/><br/>Upon hearing this familiar voice, the old man got up to open the door and asked curiously, “Didn’t you already leave?”<br/><br/>The visitor was Gu Yang. He had rushed back to the Liu Family village overnight while the caravan was resting.<br/><br/>With his current strength, even the rugged mountain roads were as flat as a street for him.<br/><br/>It took him less than an hour to rush back to Liu Family village.<br/><br/>Gu Yang said solemnly, “Old man Liu, I need to talk to you.”<br/><br/>This old man was the village chief, commonly known as Old Liu. When he was young, he had experienced the outside world and he was the most knowledgeable person in the village. He was also the only literate person in the village.<br/><br/>In the past two years that Gu Yang had been in the Liu Family village, he had spent most of his time with Old Liu, mainly to learn to read and write.<br/><br/>Old Liu tossed two more fried beans into his mouth, chewing them with a loud crunch, and said, “It seems like it’s a big deal.”<br/><br/>Gu Yang said, “There is a group of ruthless thieves heading towards Liu Family village. You had better lead the villagers to evacuate to the mountains and hide.”<br/><br/>Old Liu, with his somewhat cloudy old eyes, stared at Gu Yang for a while, then he grabbed the last handful of stir-fried beans and threw them into his mouth. He stood up, picked up an old gong from the corner, went outside, and started to bang on it.<br/><br/>Gu Yang had thought it would be very difficult to persuade him. After all, just based on his word, he was asking the villagers to evacuate to the mountains, such a decision was not easy to make without hesitation.<br/><br/>Unexpectedly, Old Liu didn’t dispute it at all.<br/><br/>This trust moved him deeply.<br/><br/>…<br/><br/>When it was almost dawn, Gu Yang returned to where the caravan had stayed overnight.<br/><br/>Old Gao and the others knew that he had not been there last night, but no one dared to ask him where he had gone.<br/><br/>To them, it was already a bonus that he came back.<br/><br/>When the caravan was about to depart, Gu Yang finally had the time to access the system.<br/><br/>[Do you want to use the Life Simulator? One use requires 50 coins.]<br/><br/>The price has increased again!<br/><br/>“So, the cost of the simulator is related to my realm level. The higher my realm, the more expensive it is,” Gu Yang thought.<br/><br/>The last time the price increased was when he broke through to the Ninth Rank.<br/><br/>Now that he had broken through to the Eighth Grade, the price had increased again.<br/><br/>He took a deep breath and clicked on “Yes!”<br/><br/>[At the age of 22, you became an Eighth Rank martial artist, you followed a caravan to leave the Liu Family village. On the road, you encountered a group of bandits and defeated them, avoiding Wang Family Ravine.]<br/><br/>[One month later, you went to Phoenix City and won the appreciation of the prefect. You became a bodyguard for him.]<br/><br/>[At the age of 25, you visited Liu Family village again. You discovered that the village had been razed to the ground, and the villagers were killed off three years ago. You swore to find the killer and avenge them.]<br/><br/>[At the age of thirty, you find out that the murderers are from the Liu family. One day, the prefect hosted a banquet for an important person of the Liu family. He noticed the intent to murder in your heart. The next day, you were poisoned by the prefect and died. End of this life.]<br/><br/>After reading the simulation, Gu Yang’s heart sank.<br/><br/>This time, he did not provoke the Liu family’s hunting team and also let the villagers of the Liu Family village hide in the mountains in advance. But, he still couldn’t avoid the catastrophe.<br/><br/>Why did the Liu family have to destroy the Liu Family village?<br/><br/>If possible, he really didn’t want to provoke the formidable Liu family.<br/><br/>However, it seemed inevitable now.<br/><br/>In all his simulations, he was always killed by the Liu family. It was as if they were his fated nemesis.<br/><br/>[The simulation is over, you can keep one of the following.]<br/><br/>[One, the martial arts realm at the age of thirty.]<br/><br/>[Two, the martial arts experience at the age of thirty.]<br/><br/>[Three, the wisdom of life at the age of thirty.]<br/><br/>Without giving it much thought, Gu Yang chose two.<br/><br/>As long as his realm level did not increase, choosing martial arts experience was naturally the most cost-effective choice.<br/><br/>In an instant, countless martial techniques, sword techniques, fist techniques, body techniques, and so on flooded his mind. It all felt incredibly familiar, as if they were extensions of his own limbs.<br/><br/>These were the results of his eight years of hard training in this life simulation.<br/><br/>Now, he truly possessed the strength of an Eighth Rank martial artist.<br/><br/>Gu Yang checked his balance and found that he was left with only 15 coins. He was running out of money.<br/><br/>He still didn’t know whether his current capabilities would be enough to fight against the Liu family’s hunting team.<br/><br/>For safety’s sake, he wanted to do more simulations.<br/><br/>But what if he ran out of money?<br/><br/>He looked at Old Gao and the others, pondering if he should ask to borrow from them.<br/><br/>Suddenly, he felt someone approaching, and he yelled, “Who’s there?”<br/><br/>Old Gao and the others, both the merchants and the servants, reacted swiftly, drawing their weapons and scanning the surroundings vigilantly.<br/><br/>“I’m over here.”<br/><br/>Soon, one of the servants found the person’s hiding spot, and brandishing his weapon, he advanced and ordered, “Come out.”<br/><br/>“Don’t do anything rash. I don’t mean any harm.”<br/><br/>A raggedly dressed young man emerged from the shrubbery with his hands raised, shouting, “I came to warn you, ow!”<br/><br/>Before he could finish speaking, several servants swarmed him, twisted his arms behind his back, and tightly bound them with rope.<br/><br/>“Ouch, ouch… be gentle…”<br/><br/>In a short while, the young man was brought before Gu Yang, forced to kneel on the ground.<br/><br/>Everyone could tell that this young man wasn’t powerful.<br/><br/>However, Old Gao did not allow himself to be complacent and asked tersely, “Tell us, who are you and why are you sneaking around here?”<br/><br/>“Let me go!”<br/><br/>The young man’s face turned red as he struggled vigorously, “I came out of goodwill to warn you, and this is how you repay me?”<br/><br/>Old Gao said coldly, “Oh, you’re not talking? Fine then, cut off one of his hands and see if he talks.”<br/><br/>“Wait.”<br/><br/>At this moment, Gu Yang spoke up.<br/><br/>Old Gao stepped back and stopped talking.<br/><br/>Gu Yang said, “Untie him.”<br/><br/>The two servants behind the young man looked at Old Gao, and upon receiving a signal, they untied the young man.<br/><br/>Gu Yang asked, “You said you came specifically to warn us, what do you mean?”<br/><br/>The young man stood up, rubbed his shoulders, and said indignantly, “You guys are targeted by Over Mountain Wind. If you don’t want to die, run away now. Any later, and you are all going to die here.”<br/><br/>Upon hearing this, everyone’s faces changed drastically.<br/><br/>Even Gu Yang, who had never left Liu Family village, had heard of the infamous “Over Mountain Wind.”<br/><br/>This was a band of bandits active to the south of Lian Mountain, involved mainly in robberies and looting passing businessmen. They were extremely brutal in their methods, not only robbing money but also taking lives.<br/><br/>Those who crossed paths with “Over Mountain Wind” were all killed. Not a single soul survived to tell the tale.<br/><br/>That was the origin of the bandits’ name. “Over Mountain Wind” is a deadly poison, and anyone bitten would undoubtedly die. These bandits were as venomous as poisonous snakes.<br/><br/>Old Gao said excitedly, “Impossible, Over Mountain Wind mainly operates in Xiang County. Why would they come to Ba County?”<br/><br/>The young man sneered, “If you don’t believe me, you can wait and die here. I don’t want to die here.”<br/><br/>Old Gao ordered, “Stop, you think you can just leave without explaining?”<br/><br/>Just as he was speaking, a swishing sound was heard. An arrow shot out from one side, piercing the neck of one of the servants. He held his neck and fell on the ground in pain.<br/><br/>Upon observing this sudden event, everyone realized that they had indeed encountered bandits.\t\t\t\t\t\t</div>", "images": {}, "success": true}