{"id": 6, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14234364.html", "title": "Chapter 6 - Chapter 6: 006 Stop Talking Nonsense So Much", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 6 - Chapter 6: 006 Stop Talking Nonsense So Much</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 6: 006 Stop talking nonsense so much<br/><br/>Translator: 549690339<br/><br/>From the surrounding trees, seven or eight people emerged, each holding a bow, arrows nocked and aimed at the people in the open.<br/><br/>The one leading was a burly man, one of his ears severed, a horrific scar on his left cheek.<br/><br/>“Mountain Wind’s second chief, Hell’s Messenger!”<br/><br/>On seeing this man, Old Gao was terrified, his soul almost left his body.<br/><br/>Among the three chiefs of Mountain Wind, the boss and the third rarely showed up, but the feature of the second in command was well known to everyone.<br/><br/>He used to be a condemned criminal before joining Mountain Wind after escaping from prison. His wanted poster had even been posted in Ba County.<br/><br/>Mainly because Hell’s Messenger’s appearance was so recognizable, even those who haven’t seen his poster could identify him at first glance.<br/><br/>The other people identified this notorious bandit as well, turning pale with fear.<br/><br/>According to Hell’s Messenger’s murderous deeds, he would certainly kill them all.<br/><br/>It’s said that all three chiefs of Mountain Wind are Martial Artists of grade rank, these dozens of people were no match for these extremely evil bandits.<br/><br/>Moreover, the opponent had archers, poison arrows aimed at them.<br/><br/>Several caravan protectors, along with about ten others, stood still, afraid to move, fearing that any slight motion would make them live targets.<br/><br/>“Could it be… I’m going to die here today?”<br/><br/>Old Gao’s face turned deathly pale, his heart filled with despair.<br/><br/>Suddenly, he remembered Gu Yang beside him, and from within the despair, hope sprung.<br/><br/>On their side, there was also a Martial Artist of grade rank!<br/><br/>…<br/><br/>Hell’s Messenger held a conspicuous ghost-headed saber on his shoulder, yawning while cursing at the sight of only ten or so mules: “I got up before sunrise for this little stuff? Dammit, these few things are worth my personal visit?”<br/><br/>One of his men reassured him, “Second Chief, since we came in here, we haven’t made any business for two months. Even a mosquito is meat.”<br/><br/>Hell’s Messenger spit out a thick sputum, “Fine, just consider it a wedding gift for the boss.”<br/><br/>The man looked at the teenager who had brought the news and asked, “What should we do with this traitor?”<br/><br/>Hell’s Messenger growled: “Anyone who dares to betray our stronghold, catch him and hang him publicly.”<br/><br/>The teenager, who had been terrified, became indignant upon hearing Hell’s messenger’s words. He lifted up his neck and said: “I, Zhang Xiao Hai, come from an innocent family. I am forced to join you. I’m not a bandit.”<br/><br/>Hell’s Messenger watched him smirk, “I like your tough bones the most. I’ll break your bones one by one later to see if you can still be this hard——”<br/><br/>Before he could finish his words, Hell’s messenger’s face suddenly changed, he turned to his side, and a small stone with the strength and wind in it, flew past rubbing his face.<br/><br/>Whoosh whoosh whoosh…<br/><br/>Accompanied by several breaking sounds through the air, several nearby archers were hit and fell to their own blood without uttering a sound.<br/><br/>Of the nine bandits, only Hell’s Messenger remained standing.<br/><br/>This outright change caught everyone by surprise.<br/><br/>Old Gao and the others were first shocked, then overjoyed.<br/><br/>They were saved!<br/><br/>Their biggest worry was that Gu Yang would fear Mountain Wind and run away, leaving them all behind.<br/><br/>Most shocked was the teenager who was dumbfounded, looking at the young man beside him who was only a few years older than him. His attire was completely that of a mountain hunter, apart from being overly handsome.<br/><br/>Who would have thought that he was an expert of grade rank.<br/><br/>There were only over twenty bows in the Mountain Stronghold, and all who were designated as archers had extraordinary skills and had been with Mountain Wind for years.<br/><br/>With just one move, this man killed seven archers.<br/><br/>With such skills, he must be a highly graded expert.<br/><br/>…<br/><br/>“I must have underestimated him.”<br/><br/>Hell’s Messenger didn’t look at his dead subordinates, only glared at the young hunter, his face grim. “A small merchant convoy has hired a Martial Artist of grade rank. How peculiar.”<br/><br/>Gu Yang didn’t say anything, he simply drew a machete from his waist.<br/><br/>This was his first kill, but when he swung his machete, there was no shaking on his hand.<br/><br/>Even though he was an eighth-grade martial artist, he still felt a strong threat when several longbows targeted him.<br/><br/>Earlier, when the archers were distracted by the young man, he struck decisively.<br/><br/>Hell’s messenger gripped his ghost-headed saber in front of him, shouting, “State your name, my saber——”<br/><br/>Buzz!<br/><br/>Everyone only heard the vibration sound of the blade cutting the air.<br/><br/>The next moment, they saw a large amount of blood spurting from Hell’s Messenger’s throat, he fell with a heavy thud, his face full of disbelief. His mouth moved, and from his lip movement, it seemed like he wanted to ask: “Who are you, after all?”<br/><br/>Old Gao and others found it incredible as they looked at the body on the ground.<br/><br/>The renowned third chief of Mountain Wind was killed by a single strike?<br/><br/>They were just worried earlier, doubting if Gu Yang, despite his youth, could handle Hell’s Messenger.<br/><br/>Who knew that in a blink of an eye, Hell’s Messenger was already dead.<br/><br/>Gu Yang had only swung his machete once.<br/><br/>The way they looked at the young hunter had become a look of deep respect.<br/><br/>…<br/><br/>Gu Yang ignored the body on the ground, returned his machete to his waist.<br/><br/>After his arrival in this world, he had already prepared himself to kill. However, when the day actually came, he still felt somewhat uneasy.<br/><br/>“In this world, if you don’t kill others, they will kill you.”<br/><br/>He thought to himself.<br/><br/>The hidden weapon technique he used earlier, and the shocking sabre strike, were killing techniques control he had painstakingly practiced during his last life simulation.<br/><br/>It seems that he practiced these techniques in that life due to lack of enough strength, in order to take revenge for the Liu Family Village.<br/><br/>Gu Yang returned to the caravan and said: “Dispose of the body. Also, since we encountered bandits this time, you will have to pay more when we get back.”<br/><br/>“Yes.”<br/><br/>No one dared to say a word of refusal, If it wasn’t for Gu Yang, they would definitely all have died here. Even if they had to give more money, they were willingly to do so.<br/><br/>“By the way, both Xiang County and Ba County have placed bounties on Mountain Wind, the head of this third chief is worth a thousand silver.<br/><br/>Gu Yang paused for a moment, struggled for a few seconds, then said, “Cut off his head, preserve it with some lime, and take it back for reward.”<br/><br/>With one thousand silver coins, he could start twenty simulations.<br/><br/>What’s wrong with bringing a head with him? It was no big deal.<br/><br/>“You, come with me. I have something to ask you.” Gu Yang pointed at the teenager who had escaped from the stronghold of Mountain Wind and walked to the side.<br/><br/>The boy was still in shock from witnessing the killing of Hell’s Messenger, but he woke up at his call and followed him.<br/><br/>When they reached a place where no one was around, the teenager knelt down suddenly and said, “Please accept me as your disciple…”<br/><br/>Gu Yang lifted him up with one hand and said faintly, “I’m not taking on any disciples.”<br/><br/>The boy was swept away by his deep gaze and didn’t dare to say anything more.<br/><br/>“Tell me, who else is in Mountain Wind’s hideout?”<br/><br/>Yes, Gu Yang was so desperate that he had decided to take on these bandits.\t\t\t\t\t\t</div>", "images": {}, "success": true}