{"id": 19, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14235470.html", "title": "Chapter 19 - Chapter 19: 019 Passing On Skills", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 19 - Chapter 19: 019 Passing On Skills</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 19: 019 Passing on Skills<br/><br/>Translator: 549690339<br/><br/>After half an hour, Zhang Xiao Hai had disposed of all twelve bodies, and finally, from the luggage of horses, had found over a thousand taels of silver.<br/><br/>As expected from a young master from a prestigious household — traveling with a thousand taels of silver.<br/><br/>Gu Yang gladly accepted it, taking out a thousand taels to charge into the system. Then, taking all the horses and weapons, he walked in the opposite direction of Ba County.<br/><br/>Liu Nuo was directly related to the Liu family, and if people killed him, the Liu family could not sit idly by.<br/><br/>Ba County was under the control of the Liu family, so naturally the further away, the better.<br/><br/>The horses that Liu Nuo and others were riding were fine horses, selling for several hundred taels was not an issue. There were twelve horses here in total, worth at least thousands of taels.<br/><br/>Although the weapons could not fetch such a high price, every little bit helps.<br/><br/>Su Qingzhen and her maidservant Zhi Xing each rode a horse, as for Zhang Xiao Hai, who can’t ride a horse, he led the nine remaining horses from behind.<br/><br/>The mountain road was rough, and the horses, with their uneven pace, did not move quickly.<br/><br/>At first, Gu Yang was worried that in such mountain paths, if the horse’s feet were trapped in a hole, it would be ruined. To his surprise, it seemed as if these horses had eyes under their feet, always avoiding the potholes. They had unimpeded navigation on the mountain road.<br/><br/>It’s unknown what breed they are.<br/><br/>He marveled at this.<br/><br/>Later he thought that this was a world of martial arts, so it made sense.<br/><br/>You should know, in this world of martial arts, the sky’s the limit.<br/><br/>Although he is only at the sixth grade, one punch can break a tree that one person can embrace. A finger in the air can shatter a stone. In the army, he is more than capable of defying a hundred enemies.<br/><br/>So, how powerful must martial artists above the third rank be?<br/><br/>Not to mention, there are even more powerful divine realm fighters above.<br/><br/>In such a world, it is very normal for the horse breeds to be different than those on Earth.<br/><br/>At noon, Gu Yang and the others found an open space to rest and eat a little bit.<br/><br/>There were still many dry rations left on the horses left by the Liu family, so they didn’t have to worry about not having anything to eat.<br/><br/>Gu Yang sat on a stone, opened the system, and started a new simulation.<br/><br/>[At the age of twenty-two, you left the Liu family village and saved Su Qingzhen in King’s Ditch. You made a deal with her and promised to escort her to Pingzhou.]<br/><br/>[The next day, people from the Liu family chased you. You killed them all, leaving Lianshan with spoils of war.]<br/><br/>[Ten days later, you reached Tianshui City. After selling the spoils of war, you continued on your journey.]<br/><br/>[Half a month later, outside Elephant City, you were besieged by people sent by the Liu family. You and Zhang Xiao Hai were killed on the spot. You died at the age of twenty-two.]<br/><br/>After Gu Yang finished reading, his eyes narrowed; this simulation was surprisingly short.<br/><br/>In other words, less than a month later, he will be caught up by and killed by a high-ranking Ile from the Liu family.<br/><br/>“How did the people from the Liu family come so quickly?”<br/><br/>Gu Yang frowned. He had been mentally prepared for the Liu family to avenge Liu Nuo.<br/><br/>However, they were in the mountains, Liu Nuo and his men were all killed and buried. It should take the Liu family some time to confirm his death.<br/><br/>Suddenly, he heard a neigh from one of the horses. As he turned his head, he saw the brand on the horse’s rear, and immediately understood.<br/><br/>He cursed himself for being inattentive.<br/><br/>All of these horses were branded by the Liu family; anyone could tell how these horses came to be.<br/><br/>It must have been those who bought the horses who notified the Liu family.<br/><br/>After Gu Yang figured this out, he understood that these horses definitely couldn’t be brought to Tianshui City.<br/><br/>Thinking of the loss of a few thousand taels, he felt a heartache. [The simulation is over, and you can keep one of the following.] [One: Your martial arts realm at the age of twenty-two.] [Two: Your experience in martial arts at the age of twenty-two.]<br/><br/>[Three: Your life wisdom at the age of twenty-two.]<br/><br/>This time Gu Yang chose the second one.<br/><br/>He wanted to know how strong the killers sent by the Liu family were.<br/><br/>Instantly, a battle experience surfaced in his mind. The battle process was extremely short. He could only withstand up to three moves before being throat-sealed by a sword.<br/><br/>“At least fifth grade!”<br/><br/>Gu Yang could only conclude that, the opponent’s strength far exceeded the sixth grade, and it was at least of the fifth grade. It was also possible for it to be fourth grade.<br/><br/>He looked a bit serious.<br/><br/>Now, all his money had been spent and he couldn’t run the simulation anymore. He didn’t know when the Liu family’s pursuers would catch up. This made him feel insecure.<br/><br/>It seemed he needed to find ways to make some money.<br/><br/>Gu Yang thought about this and suddenly called to Zhang Xiao Hai, “Do you know about the Liu Family?”<br/><br/>Zhang Xiao Hai shook his head.<br/><br/>“What about the Zheng family?”<br/><br/>Zhang Xiao Hai nodded. The Zheng family was the biggest prestigious household in Elephant City, they could even be considered as regional kings.<br/><br/>“The Liu family is even more powerful than the Zheng family. The one I killed earlier was the son of the head of the Liu family. The Liu family will not stop until they’ve had their revenge. Once they discover that their son is dead, they will send experts to kill us.”<br/><br/>Gu Yang pointed out the terrible aspect of and said, “This matter has nothing to do with you. I can give you some money and you can go home.<br/><br/>Buy some farmland, you can live a peaceful life.”<br/><br/>Zhang Xiao Hai was anxious when he heard that. He knelt down with a thud,<br/><br/>“Young Master, please, don’t send me away.”<br/><br/>Gu Yang looked at him and said, “The Liu family is full of experts, and there are many people with strengths higher than mine. When the people from the Liu family come, I won’t be able to protect you.”<br/><br/>“I’m not afraid! Yesterday, it was the young master who saved my life. From that moment, my life became yours.”<br/><br/>“Did you think it through?”<br/><br/>Zhang Xiao Hai heavily kowtowed, saying, “I just ask that you allow me to stay by your side.”<br/><br/>“Okay, you can get up first.’<br/><br/>Gu Yang stopped talking. From now on, it would depend on his actions.<br/><br/>“Now I’ll teach you a set of mantras, listen carefully.” Saying this, he turned his head and beckoned to Zhi Xing, “Come over and listen.”<br/><br/>Zhi Xing had heard the conversation between the two, and of course know he was going to teach them martial arts. So she hurriedly shook her hands and said, “No, no, I can’t do that.”<br/><br/>“It’s not some profound technique. If you learn some, you will be able to protect your young lady in the future.”<br/><br/>Gu Yang said, and started to recite the mantra.<br/><br/>What he was teaching them was the first level of the “Xuan Yuan Method”. This is a very good introductory method, it’s middle-right, and balanced, and is an orthodox of the mysterious gate.<br/><br/>He didn’t control the volume. Not only could Zhang Xiao Hai and Zhi Xing hear, but Su Qingzhen could also hear clearly.<br/><br/>Zhang Xiao Hai naturally listened very carefully, and Zhi Xing was also moved by his words just now, so she carefully remembered the mantra.<br/><br/>Su Qingzhen hadn’t spoken since the incident this morning. She didn’t want to listen to those mantras, but the more she didn’t want to listen, the more the voice drilled into her ears.<br/><br/>Each word of the mantra flowed through her heart. Unconsciously, she subconsciously ran according to the mantra, and her body really formed a sense of energy, running freely inside, without encountering any obstacles.<br/><br/>When Gu Yang finished reciting the mantras, she had already completed one cycle of the exercise, breaking through a mystical point, and there was an additional true Qi in her dantian.<br/><br/>“This is —”<br/><br/>When Su Qingzhen reacted, she couldn’t believe it..\t\t\t\t\t\t</div>", "images": {}, "success": true}