{"id": 15, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14235446.html", "title": "Chapter 15 - Chapter 15: Survive At The Brink Of Death", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 15 - Chapter 15: Survive At The Brink Of Death</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 15: Survive at the brink of death<br/><br/>Translator: 549690339<br/><br/>It took Gu Yang a long time to completely digest all the martial arts experience.<br/><br/>Sixty years of accumulation, it was complex to the extreme. The mastery of saber technique, sword technique, and other martial skills, both in quality and quantity, exceeded the sum of all his previous simulations.<br/><br/>He looked outside the cave, the sky outside was already faintly bright.<br/><br/>A total of eight life simulations had taken up an entire night.<br/><br/>Gu Yang looked somewhat solemn.<br/><br/>The balance of the system was just over a thousand, and he could only conduct the last two simulations.<br/><br/>He tried all sorts of methods, and walked so many different paths of life, but still could not break through to the sixth grade.<br/><br/>It was really too difficult.<br/><br/>“It seems that it’s impossible to become a martial arts master by muddling along,” he mused.<br/><br/>In the world of martial arts, practicing skills alone is not enough; one must also cultivate one’s state of mind, especially at the threshold of the sixth grade.<br/><br/>Ninth Grade to Seventh Grade, they are lower ranks and belonged to the ranks of third-rate fighters.<br/><br/>Sixth Grade to Fourth Grade are the middle three grades and are considered second-rate masters.<br/><br/>From Third Grade and above, these are the top three grades and are regarded as top-notch masters.<br/><br/>The leap from the seventh grade to the sixth grade, and from the fourth grade to the third grade, are both critical points. It’s not that easy to break through.<br/><br/>“I’ll have to take some risks.”<br/><br/>Gu Yang steeled his heart and began the ninth simulation.<br/><br/>[At the age of twenty-two, you became a seventh-grade martial artist and left  the Liu Family village. In Wangjia Gully, you rescued Su Qingzhen from the Su Family, and promised to escort her to Ping County.]<br/><br/>[The next day, people from the Liu Family tracked you down. You alone with a single saber, in the blink of an eye, killed ten people. A sixth-grade martial artist from the Liu Family immediately took action. Ten rounds later, your chest was pierced by a sword. At a critical moment, you dodged the fatal vital points. You counterattacked with a sword and wounded the opponent.]<br/><br/>[At this moment, you finally broke through your inner demons and entered the realm of the sixth grade. Unfortunately, your injuries were too heavy, and you were still no match for your opponent. Five rounds later, you were pierced between your brows by a sword and died at the age of twenty-two.]<br/><br/>Finally, sixth grade!<br/><br/>Gu Yang let out a sigh of relief.<br/><br/>This time, he had confronted death and survived, facing the sixth-grade martial artist from the Liu Family who had left a psychological shadow on him with only the strength of the seventh grade.<br/><br/>This was no different from courting death.<br/><br/>If he had failed to break through, he would have wasted the opportunity for a simulation.<br/><br/>In that case, he could only give up the 30,000 taels reward and run away with Zhang Xiao Hai.<br/><br/>He would not do something as ridiculous as courting death. [The simulation is over, you can keep one of the following.]<br/><br/>[One, the martial arts realm at age twenty-two.]<br/><br/>[Two, martial arts experience at the age of twenty-two.] [Three, wisdom in life at the age of twenty-two.]<br/><br/>“I choose the first.<br/><br/>Suddenly, the True Qi in Gu Yang’s body exploded, just like a burning fire, opening all his acupoints one by one.<br/><br/>The little maid, Zhi Xing, who was sleeping soundly, felt a burning sensation in her palm, woke up in shock and instinctively withdrew her hand. She just remembered that it felt like holding a piece of red-hot iron.<br/><br/>When she opened her eyes, she saw nothing unusual.<br/><br/>Her lady’s hand was still clasped with the benefactor’s hand, and she was curled up against his side, sound asleep.<br/><br/>Looking at the benefactor again, his eyes were also closed, as if he was sleeping.<br/><br/>“What’s wrong?”<br/><br/>On the other hand, Zhang Xiao Hai, who was sleeping across from her, was awakened and asked cautiously.<br/><br/>“No… nothing…”<br/><br/>The little maid stammered, thinking it was her own illusion, “I… had a<br/><br/>nightmare.”<br/><br/>“As long as nothing’s wrong.”<br/><br/>Zhang Xiao Hai saw that it was almost daylight outside, stood up, and quietly walked outside.<br/><br/>In order to ensure the safety of her lady, Zhi Xing still sat by her side, looking at the two hands held together and remembered the night before when her hand was also held by that big hand. She blushed and closed her eyes, choosing not to think about it any more. Nor did she dare to put her hand back.<br/><br/>“Huh?”<br/><br/>It turned out it was Gu Yang. He couldn’t control his Sun’s Red True Qi when he was breaking through. He had been infusing True Qi into the two women beside him. At this moment, the output of True Qi was excessive.<br/><br/>The little maid was scalded and withdrew her hand.<br/><br/>But Su Qingzhen had no reaction at all.<br/><br/>Very soon, Gu Yang noticed something abnormal. His True Qi actually flowed through her hand and surged into her body.<br/><br/>Then, a cool aura flowed back from within her, which was exceptionally comfortable.<br/><br/>“What is that-<br/><br/>Although Gu Yang did not know what this cool aura was, he had an extremely rich martial arts experience. His intuition told him that this was not detrimental to him at all.<br/><br/>On the contrary, it was a good thing.<br/><br/>Little did he know, the “Sun’s Red Technique”, despite its extraordinary power, also had great flaws.<br/><br/>The cultivators of this technique yield extreme Yang Qi.<br/><br/>As the saying goes, “All yang is perishable”, the higher the realm, the greater the damage to the body, especially at the top three levels. There are dangers of autoimmolation.<br/><br/>Because of this, although this technique has a wide spread, no noble clansmen would cultivate it. It would only be transmitted to the guards and servants.<br/><br/>Reportedly, only those with special physical constitution can cultivate it to perfection.<br/><br/>However, such people are extremely rare.<br/><br/>Even so, for a commoner like Gu Yang who has no exceptional talent, the “Sun’s Red Technique” is already the most advanced technique that he is likely to obtain.<br/><br/>In Great Zhou, high-ranking techniques that can be cultivated up to the top three levels are all monopolized by great clans and sects. They are not divulged to non-core disciples.<br/><br/>It is more difficult for commoners to learn these techniques than to ascend to the heavens.<br/><br/>Gu Yang originally planned to resolve this issue after reaching the sixth grade.<br/><br/>Although it’s troublesome to convert his cultivation technique, it’s not an issue as long as there’s enough time.<br/><br/>Time was what he had aplenty of.<br/><br/>What was difficult was how to obtain a top-grade Yang attribute technique.<br/><br/>Now, Gu Yang accidentally stimulated the cool aura within Su Qingzhen’s body. This aura could neutralize the most arrogant part of his Sun’s Red True Qi, making his Qi less domineering but more tenacious.<br/><br/>After a few rounds of Qi flow, Gu Yang’s True Qi improved nearly twice as much as before, and the purity of the Qi was even more incomparable to before.<br/><br/>Gu Yang opened his eyes and looked at the woman beside him. She was still asleep. Her pure white face had two faint blushes, which were stunningly beautiful.<br/><br/>“Is this the harmony of Yin and Yang?”<br/><br/>He was certain that she had no True Qi on her body, which meant she had never practiced martial arts.<br/><br/>So, there was only one possibility, she had a special physique, with Yin Qi accumulated in her body. This should be the reason why she was born in a noble family but had never practiced martial arts.<br/><br/>At this moment, Su Qingzhen’s long eyelashes moved slightly, and she opened her eyes, and her eyes collided with his.<br/><br/>Only then did she realize that she had actually fallen asleep on this man and her hand had been held by him all night. She was instantly filled with both shyness and anger, causing her to jump up and pull her hand away.<br/><br/>“You–”<br/><br/>Su Qingzhen was flushed with anger pointing at him, wanting to scold him, but saw him turn his head away and close his eyes again, completely ignoring her.<br/><br/>For a moment, she felt aggrieved, and tears were about to spill from her eyes. All the benefits had been taken by him, but he was acting as if nothing had happened.<br/><br/>Seeing the situation going south, the little maid quickly said, “Miss, I’ll help you go wash your face.”<br/><br/>After that, pulling her lady up, they exited the cave..\t\t\t\t\t\t</div>", "images": {}, "success": true}