{"id": 12, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14235443.html", "title": "Chapter 12 - Chapter 12: 012 Earning Money Is Not Easy", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 12 - Chapter 12: 012 Earning Money Is Not Easy</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 12: 012 Earning money is not easy<br/><br/>Translator: 549690339<br/><br/>A moment later, Gu Yang had taken the two women to an open area beyond the swamp, setting them down.<br/><br/>With a skeptical look, he gazed at the two women, “Can you really produce thirty thousand taels? If you dare to deceive me, I’ll send you back to the village.”<br/><br/>Zhi Xing hurriedly replied, “How would I dare deceive you, my lord.”<br/><br/>In the moonlight, Su Qingzhen took her first real look at the man who had saved her from the mountain bandits.<br/><br/>He was dressed as a hunter, his hands full of calluses, his face marked by the elements.<br/><br/>But he was far from an ordinary hunter!<br/><br/>Because when he looked at her, there was no hint of fluctuation in his eyes.<br/><br/>Su Qingzhen had encountered men who regarded her beauty as nothing, such as Zheng Renjie just a moment ago.<br/><br/>But such men usually belonged to major families, accustomed to beauty, with grand ambitions, their determination unshakable by feminine wiles.<br/><br/>Or they were experienced, deeply calculating old foxes.<br/><br/>By all rights, a hunter from the mountains shouldn’t behave this way.<br/><br/>Moreover, the fact that he managed to kill the mountain bandit leader demonstrated his formidable strength.<br/><br/>More importantly, he seemed to know that the people who invaded the village were from the Liu family…<br/><br/>Su Qingzhen couldn’t quite figure out the man before her. Her mind churned with thoughts and she finally asked, “How did you know those men were from the Liu family?”<br/><br/>Seeing her confusion and the confrontational attitude, Gu Yang replied impatiently, “They’ll be after us soon, we don’t have much time.”<br/><br/>Upon hearing his discourteous response, Su Qingzhen felt a wave of annoyance – when had she ever been treated so rudely by a man before?<br/><br/>Even in the Liu family, on the surface, they were all courteous to her, never daring to show the slightest disrespect.<br/><br/>Later, when she was captured and brought to the bandit camp, even the uncouth bandit leader had been polite and respectful towards her before tonight.<br/><br/>She also recalled how, a moment ago, he had not hesitated to leave her behind when he realized the Liu family was coming.<br/><br/>Until Zhi Xing mentioned the thirty thousand taels, and he quickly returned.<br/><br/>Greed and boorishness!<br/><br/>In her mind, Su Qingzhen labelled the man with these two descriptors.<br/><br/>“My lady.”<br/><br/>Zhi Xing, knowing her mistress’s disposition, took hold of her sleeve and murmured softly, “If we are caught by the Liu family, we are finished…’<br/><br/>Reminded of the grudge against her parents, Su Qingzhen could only stifle her resentment. She turned around, took a bundle of papers from her clothes, and threw them into Zhi Xing’s hands.<br/><br/>Zhi Xing handed them to Gu Yang, “My lord, here are your thirty thousand taels in banknotes.”<br/><br/>Gu Yang took the banknotes, still warm from Su Qingzhen’s touch. He opened them to see seven or eight notes written on Four Streams Bank paper, ranging from ten thousand to several thousand. Altogether, it was indeed thirty thousand taels.<br/><br/>He tried to open up the system to recharge.<br/><br/>There was no response.<br/><br/>He looked at Su Qingzhen and said, “You’re not trying to fool me with a stack of counterfeit notes, are you?”<br/><br/>Su Qingzhen, seeing that he didn’t even recognize Four Streams Bank notes, disdainfully declined to speak to him.<br/><br/>Zhi Xing quickly explained, “Rest assured, my lord. Four Streams Bank is the largest bank in Great Zhou and has branches in every county. These banknotes were personally handed to the young lady by our master, there is absolutely no way they are counterfeit.”<br/><br/>Seeing her speak with such certainty, Gu Yang could only take her at her word for now and keep the banknotes.<br/><br/>“You can have this thirty thousand taels, but you must take us to Ping County.”<br/><br/>This time it was Su Qingzhen speaking.<br/><br/>That was an unfamiliar name.<br/><br/>Gu Yang asked, “Where is Ping County? And how far is it?”<br/><br/>Zhi Xing explained for her mistress, “My lord, Ba County is to the east of Jiangzhou, and Ping County is to the west. It’s about a thousand li. If we travel by water, we should get there in half a month.”<br/><br/>While it was a bit far, earning thirty thousand taels for a single trip seemed quite worthwhile.<br/><br/>Gu Yang agreed on the spot, “Okay, to the best of my ability, I can protect you.”<br/><br/>He didn’t make a solid promise, and if they encountered any situation beyond his control, then there would be nothing he could do.<br/><br/>Thirty thousand taels was not enough to risk his life over.<br/><br/>Su Qingzhen warned him, “Don’t think about abandoning us halfway and running off with the money. These banknotes are exclusive to my Su family.<br/><br/>They can only be redeemed with my signature. When we arrive in Ping County, I will personally go with you to Four Streams Bank to withdraw the silver.”<br/><br/>So these banknotes are more like a checkbook?<br/><br/>In any world, money wasn’t easy to come by.<br/><br/>In any world, money wasn’t easy to come by.<br/><br/>Thirty thousand taels was not a small sum.<br/><br/>He recalled a few days ago when he was just a hunter; it had taken him two years to save up ten taels of silver.<br/><br/>How many years would it take to save up thirty thousand taels?<br/><br/>Thinking in this way, he felt relieved.<br/><br/>Gu Yang went to rendezvous with Zhang Xiao Hai first.<br/><br/>“Young master, you’re back! Eh?”<br/><br/>Zhang Xiao Hai had been hiding in the same spot. Upon hearing the noise, he turned his head and saw Gu Yang. Just as he was about to celebrate, he noticed two women following behind. Under the cover of night, he couldn’t make out their appearances.<br/><br/>But there were only two women in the camp.<br/><br/>He naturally guessed the identities of these two women and was somewhat taken aback.<br/><br/>Does this mean that the mountain bandit leader was really killed by the young master?<br/><br/>Gu Yang didn’t waste any words: “We need to leave here immediately.”<br/><br/>Using the cover of night, the four of them left the swamp.<br/><br/>He remembered there were man-eating monsters lurking beyond the swamp and dared not venture in that direction.<br/><br/>With these three burdens with him, he was not confident about evading the surveillance of both the Liu and Zheng families.<br/><br/>Zhang Xiao Hai goes without saying, he did not practice martial arts.<br/><br/>The maidservant Zhi Xing had some training but didn’t even rank.<br/><br/>The young lady, who ranked thirteenth on the beauty list, was incapable of self-defense.<br/><br/>The Liu family certainly had a seventh-grade warrior, but whether they had a sixth-grade warrior was unknown.<br/><br/>As for Zheng Renjie of the Zheng family, his cultivation level was definitely above sixth grade.<br/><br/>Given Gu Yang’s current strength, if he were to encounter either of the groups, he could only flee, let alone protect them.<br/><br/>In less than an hour, Su Qingzhen suddenly yelped out, nearly falling to the ground as she twisted her foot. Despite being held up by her maid Zhi Xing, she refused to walk any further.<br/><br/>When Gu Yang agreed to this task, he had anticipated the journey wouldn’t be smooth. He figured that a pampered young lady like her probably hadn’t suffered much in her life.<br/><br/>Now it was late spring, and the mountain was exceptionally cold. The roads were tough and it was night.<br/><br/>Gu Yang had to find a nearby cave for rest and wait for daylight.<br/><br/>Anyway, he didn’t expect they could escape the Liu and Zheng families that easily.<br/><br/>The fact they could track down Wang Family Ravine proved they had an expert at trailing and tracking in their team. They would likely catch up by tomorrow at the latest.<br/><br/>Running was pointless, the only way to solve this problem was to deal with the two groups of people.<br/><br/>It was a perfect opportunity to increase his strength.<br/><br/>Gu Yang sat at the entrance of the cave and opened the life simulator.<br/><br/>[Do you wish to use the life simulator? One usage will consume five hundred money.]<br/><br/>“Yes..\t\t\t\t\t\t</div>", "images": {}, "success": true}