{"id": 14, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14235445.html", "title": "Chapter 14 - Chapter 14: 014 Seven Simulations", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 14 - Chapter 14: 014 Seven Simulations</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 14: 014 Seven Simulations<br/><br/>Translator: 549690339<br/><br/>“At twenty-two, you became a seventh grade Martial Artist and left Liu Family Village. In Wang Family Gully, you rescued Su Qingzhen from a mountain bandit. It was then that members of the Liu family tracked you down in Wang Family Gully. Not wishing to invite trouble, you departed on your own.”<br/><br/>“A month later, you arrived at the county seat, Elephant City in Xiang County. Within a few months, you began distinguishing yourself and won favour with the county governor who recommended you for a post as one of the city’s garrison commanders, responsible for ridding the city of thieves.”<br/><br/>“Over five years, you led your soldiers to wipe out all bandits within Xiang County. The county governor was promoted for this feat but did not take you along to the capital. Two months after the new governor took office, you were transferred and put in charge of guarding the granary.”<br/><br/>“You started to focus on refining your Martial Arts, but progress was slow. You felt like you had hit a bottleneck.”<br/><br/>“At thirty-five, a major flood hit Jiangzhou; after the disaster, the grains of the granaries which you were protecting disappeared without a trace. Seeing the situation was dire, you fought your way out of the county town and fell on the wrong side of the law.”<br/><br/>“You fled to Lian Mountain, leading a secluded life. However, you found your cultivation level couldn’t advance any further. One night, several years later, you were assaulted by a mysterious shadow and met an untimely death at the age of forty.”<br/><br/>A hint of worry flashed through Gu Yang’s eyes when he saw the result of this simulation.<br/><br/>The very thing he feared had happened – his aptitude was not strong, and he would inevitably hit a ceiling beyond which he couldn’t progress.<br/><br/>He hadn’t expected that day to come so soon.<br/><br/>He was only at grade seven now.<br/><br/>But of course, his quick encounter with the bottleneck was likely due to more than just his aptitude.<br/><br/>Gu Yang thought back to the simulation and remembered the shadow cast over his heart by the two sword strikes of that sixth-grade Martial Artist from the Liu family.<br/><br/>“Simulation ended. You may retain one of the following options.” “First, the martial arts realm you reached at the age of forty.”<br/><br/>“Second, the martial arts experience you gained by the age of forty.”<br/><br/>“Third, the wisdom you accumulated throughout your life by the time you were forty.”<br/><br/>He directly chose the first option.<br/><br/>A quantity of experience can provoke a qualitative change; he was sure that accumulating the experience from his repeated simulations would eventually lead him to break through to grade six.<br/><br/>Immediately, Gu Yang felt the True Qi within his body rapidly increasing, nearly doubling.<br/><br/>This was the accumulation of almost twenty years in this show, ‘Simulated<br/><br/>Life.’<br/><br/>“It seems joining the army is not a solution either.”<br/><br/>Gu Yang summarized the experience from this simulated life, and thought he had offended too many people and infringed upon too many people’s interests, which led to his downfall in the end.<br/><br/>Even the governor, who had once appreciated him, abandoned him.<br/><br/>Achieving something in this world is really hard.<br/><br/>In the final analysis, it was because his social status was too low and he didn’t have any backing.<br/><br/>With this realization, Gu Yang made a decision and began another round of simulation.<br/><br/>“…You arrived at Jiangzhou City and asked around for news of well-known martial arts masters; you soon identified a target and decided to ask the knife master, Shi Mingchuan, to be your teacher.”<br/><br/>“After half a year, Shi Mingchuan was moved by your sincerity and agreed to meet with you. He told you, however, that your aptitude was too mediocre to be his disciple and advised you not to squander your efforts; he recommended you join the Lin Family instead.”<br/><br/>“After much hesitation, you decided to heed Shi Mingchuan’s advice and with his recommendation, you joined the Lin Family as a guard.”<br/><br/>“For over ten years, despite rigorous training, you were unable to break through the bottleneck.”<br/><br/>“At the age of thirty-six, after the flood, chaos broke out all over Jiangzhou. Rioters broke into the city and amidst the melee, you were killed. You died at the age of thirty-six.”<br/><br/>This time, after practicing for over ten years, he still couldn’t break through the bottleneck.”<br/><br/>Gu Yang still chose the martial arts realm and his cultivation level was enhanced slightly. However, this increment was much less than last time.”<br/><br/>“Once more.”<br/><br/>“… You were killed by a passing young martial artist. You died at the age of thirty.”<br/><br/>“… You inadvertently exposed a murder plot and were silenced on the spot. You died at the age of thirty-two.”<br/><br/>. For unknown reasons, you offended someone and were poisoned to death.<br/><br/>You died at the age of twenty-seven.”<br/><br/>With each simulation, Gu Yang’s face grew more contorted with worry.<br/><br/>By the sixth attempt, his cultivation level barely increased at all – he had genuinely reached a standstill.<br/><br/>This implied that he had hit the peak at the seventh grade, and the next step forward would be grade six.<br/><br/>However, to him, this step was like a chasm in the sky.<br/><br/>In all his simulations, his had joined several of the strongest families in Jiangzhou, which ended correspondingly badly.<br/><br/>The main reason was that his cultivation level was too low and his aptitude too poor, so he couldn’t gain access to profound martial arts skills.<br/><br/>In the last simulation, he had even joined the army that sacked Jiangzhou; unfortunately, he was embroiled in an internal struggle and died a senseless death. ”<br/><br/>Gu Yang checked the system’s balance: he now had just over fifteen hundred liang left.<br/><br/>This much money could support three more simulations. “Seems like it’s time to switch strategies.”<br/><br/>He took a deep breath and started a new simulation.”<br/><br/>“At twenty-two, you left Lian Mountain and settled in a small city just outside the mountain.”<br/><br/>“At twenty-three, you began buying property, getting married, and having children. Within a few years, you married six wives.”<br/><br/>“At the age of thirty, you had thirteen children. With your diligent upbringing, two of your sons displayed great martial arts talent.”<br/><br/>“At the age of thirty-six, one of your children reached the grade level. Seeing the outbreak of a rebellion in Jiangzhou, you took your family to Lian Mountain to escape the chaos.”<br/><br/>“At the age of forty, the rebellion in Jiangzhou was suppressed. You took your family to settle in Tianshui City. In Tianshui City, you kept a low profile, focusing only on raising your family.”<br/><br/>“At the age of forty-three, your eldest son grew up, and you started arranging his marriage, establishing marriage alliances with other families in Tianshui City. The following year, your first grandson was born.” “At the age of fifty, you had more than twenty grandchildren.”<br/><br/>“Your two sons also ascended to the seventh grade and also began encountering bottlenecks. ”<br/><br/>“At the age of sixty, your twelfth grandson exhibited extraordinary martial arts talent at the age of fourteen. You personally took him to Tianmen Mountain to join the Tianmen Sect.”<br/><br/>“At the age of seventy, your grandson successfully broke through to the six grade and you finally learned from him the reason why you’ve been stuck at grade seven all these years. It was the ‘psychological demon’ you suffered from all those years ago. The only way to progress further was to overcome this demon.”<br/><br/>“At the age of eighty-two, your direct lineage had expanded to two hundred and fifty-six members. The highest cultivation level among them reached grade four. The Gu Family became the leading family in Tianshui City. One morning, you passed away with a smile, ending your life.”<br/><br/>Gu Yang took a deep breath when he finished reading.<br/><br/>Gone at the age of eighty-two, lived an uneventful life without any catastrophes or tribulations, leaving behind over two hundred descendants and even cultivated a fourth-grade martial artist….<br/><br/>It turned out that this was the correct way to live in this world.<br/><br/>The price was, however, that throughout his life, he couldn’t break through to the sixth grade.<br/><br/>“Simulation ended. You may retain one of the following options.” “First, the martial arts realm you reached at the age of sixty.”<br/><br/>“Second, the martial arts experience you gained by the age of eighty-two.”<br/><br/>“Third, the wisdom you accumulated throughout your life by the time you were eighty-two.”<br/><br/>Gu Yang was a bit surprised; this was the first time he was given choices for different ages.<br/><br/>In other words, the peak of his abilities was at the age of sixty, and after that, he began to decline?<br/><br/>This time, he chose the second option.”<br/><br/>The next moment, Gu Yang’s mind seemed to be crammed full of countless memories.”<br/><br/>These were all the various martial art techniques he had learned over the past sixty years in this simulation..”\t\t\t\t\t\t</div>", "images": {}, "success": true}