{"id": 17, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14235466.html", "title": "Chapter 17 - Chapter 17: 017 1 Go With You", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 17 - Chapter 17: 017 1 Go With You</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 17: 017 1 go with you<br/><br/>Translator: 549690339<br/><br/>Liu Nuo watched as two of his men were killed, and a hunter-looking man appeared to stand behind Su Qingzhen. The smile on his face froze.<br/><br/>He had just claimed that in the whole of Jiangzhou, no one dared to meddle in the affairs of the Liu family, yet someone had come to her rescue.<br/><br/>His expression darkened, he said coldly, “Ignorant fool. Kill him.”<br/><br/>Liu Nuo talked a lot, his goal was to shatter her faith and plunge her into the abyss of despair, implanting in her heart the idea that the Liu family was invincible.<br/><br/>In the future, even if she really was the favorite of the fifth prince, she would be fearful and dare not easily go against the Liu family.<br/><br/>Who could have expected that this strategy would be destroyed by a hunter who appeared out of nowhere, who even killed his men?<br/><br/>Just looking at Su Qingzhen’s expression, he knew that all those words were in vain.<br/><br/>Killing intent surged in Liu Nuo’s heart.<br/><br/>The eight men behind him spurred their horses over the brook and drew their weapons. Along with the neighing of horses, they rushed towards the hunter.<br/><br/>The morning sun shone down through the branches, casting a beam of chilly light from the blades.<br/><br/>Watching the eight knights charge towards Gu Yang, Su Qingzhen and her maid tightly held each other’s hand, their hearts leaping to their throats.<br/><br/>The next moment, all they saw was a flash of gold.<br/><br/>Blood splattered and the eight knights of the Liu family fell from their horses.<br/><br/>The thick smell of blood almost made Su Qingzhen vomit.<br/><br/>This was the first time she saw Gu Yang in action. She didn’t even see his moves. It seemed like there was just a flash and eight men were dead.<br/><br/>She had never seen a blade technique so fast, the killings so clean and decisive. Eight men died with a swing of his blade. This struck a heavy blow to her.<br/><br/>“Blood Killing Blade Method!”<br/><br/>A middle-aged man standing next to Liu Nuo recognized it immediately, his eyes showing increased seriousness, “Are you a military man?”<br/><br/>The Blood Killing Blade Method was usually passed down in the military, only to officers.<br/><br/>Either he is from the military…<br/><br/>Or he comes from a military family. Certainly not an ordinary hunter.<br/><br/>Military men are always tricky to deal with. One misstep could incur the wrath of a few formidable warriors within the military.<br/><br/>The man replied calmly, “So, are you scared?”<br/><br/>This time, Liu Nuo spoke, “Liu Nuo of the Liu family form Ba Country. May I ask your name?”<br/><br/>His attitude now was completely different from before.<br/><br/>The opponent had demonstrated substantial strength. The blade method he used was a secret one from the military. He had to proceed carefully and find out the opponent’s background.<br/><br/>“Gu Yang.”<br/><br/>Liu Nuo’s eyes narrowed, “Are you part of the Gu family in Yunzhou or in Divine City?”<br/><br/>In the world, the two most famous Gu families were in Yunzhou and Divine<br/><br/>City.<br/><br/>The Gu family in Yunzhou has lasted for a thousand years and is a distinguished family.<br/><br/>The Gu family in Divine City has numerous connections with the Gu Family in Yunzhou. They are one of the founding families of Great Zhou and hereditary Dukes of Wu’an. The current Duke of Wu’an is a renowned spear master.<br/><br/>Regardless of which, they were both entities that the Liu family would not dare to offend lightly.<br/><br/>However, the man did not respond. He instead said, “I’m taking these two women.”<br/><br/>Liu Nuo stared at him for a while and shook his head, “That won’t do, she’s the one the fifth prince wants.”<br/><br/>The man seemed to sigh, “There is nothing to discuss then.”<br/><br/>Liu Nuo was still a bit cautious. He said, “Why would you want to make enemies of the Liu family and the fifth prince just for a woman? There are plenty of women in the world. Don’t create trouble for yourself.”<br/><br/>“Start.”<br/><br/>Gu Yang didn’t bother to speak more.<br/><br/>There were indeed plenty of women, but the number of women who were willing to offer him thirty thousand taels was probably not more than one.<br/><br/>The moment Su Qingzhen heard Liu Nuo mention the fifth prince, her eyes were fixed on Gu Yang. Looking at him, there was not a hint of hesitation on his face. With his unyielding determination revealed in the words “Start,” her eyes started to blur, she could hardly see. She tightened her grip on Zhi Xing’s hand, not realizing how much it pained her maid.<br/><br/>“Uncle Zhang.”<br/><br/>Liu Nuo turned to the middle-aged man beside him and said solemnly, “I’ll leave it to you.”<br/><br/>The middle-aged man stepped forward, his long sword already unsheathed. Pointing at Gu Yang, he said, “Zhang Tong, permit me to experience your Blood Killing Blade Method.”<br/><br/>Gu Yang sensed the familiar aura emanating from this man and knew that he was the sixth grade martial artist who had left a psychological scar on him.<br/><br/>In his previous incarnation in Simulated Life, even when he overcame his inner demon and reached the sixth grade realm, he still could not defeat this man.<br/><br/>But now, after another cycle of Simulated Life, he had gained nearly ten years of arduous practice, learning the powerful Blood Killing Blade Method, he finally had the confidence to face him head-on.<br/><br/>“Stop!”<br/><br/>Just as a battle was about to ensue, a woman’s voice rang out.<br/><br/>The three men turned their heads. It was Su Qingzhen who had spoken. She pushed Zhi Xing in front of her and stepped forward, her voice somewhat hoarse, “Liu Nuo, I will go with you.” This statement caught everyone by surprise.<br/><br/>“Miss-<br/><br/>The servant girl, Zhi Xing, was shocked.<br/><br/>In the freezing wind, Su Qingzhen stood tall with her frail body. Without glancing at Gu Yang beside her, she insisted, “This matter concerns the Su family, it has nothing to do with outsiders.”<br/><br/>Liu Nuo was first stunned, then overjoyed, “If Miss Su could understand, it couldn’t be better.”<br/><br/>Zhang Tong, the sixth-grade martial artist, had his eyes fixed on her, his gaze somewhat complex. He could tell that Miss Su from the Su family did not want Gu Yang to risk his life for her.<br/><br/>One was willing to defy the Liu family and the fifth prince for the other.<br/><br/>The other was not willing to let him sacrifice his life, preferring to sacrifice herself.<br/><br/>This kind of affection touched even him, a man of ironclad determination.<br/><br/>“Miss–” The maid, Zhi Xing, tears streaming down her face, looked at her lady.<br/><br/>Su Qingzhen knew that too many people had died because of her. Her parents,<br/><br/>her entire family, they all died because of her.<br/><br/>She would shoulder her disaster.<br/><br/>She would take her own revenge!<br/><br/>Thinking of how he kept her warm the whole night, her heart ached unbearably. In a soft voice, she said, “Brother Gu, your kindness… in the next life…<br/><br/>“Idiot. ”<br/><br/>Just then, Gu Yang’s voice rang out, followed by a gust of wind.<br/><br/>With a loud crash, her ears hurt from the piercing sound.<br/><br/>When Su Qingzhen turned around, she saw that Gu Yang had already engaged with Zhang Tong. The gust swept across her face, nearly blinding her.<br/><br/>Her heart seemed to be tightly squeezed by a large hand, making it hard for her to breathe.<br/><br/>After a while, everything calmed down.<br/><br/>When she opened her eyes, she saw Gu Yang standing there, covered in blood. Her head buzzed at the sight and she almost fainted..\t\t\t\t\t\t</div>", "images": {}, "success": true}