{"id": 16, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14235464.html", "title": "Chapter 16 - Chapter 16: Stand Further Away", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 16 - Chapter 16: Stand Further Away</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 16: Stand further away<br/><br/>Translator: 549690339<br/><br/>Inside the cave, only Gu Yan was left alone. He opened the system again, and saw a prompt, “Insufficient balance, would you like to top up?<br/><br/>He had a little over 830 coins left. After advancing to the sixth grade, the price for a life simulation increased significantly.<br/><br/>This was a major inconvenience.<br/><br/>Despite his current strength, Gu Yan still lacked confidence in any confrontation with the sixth-grade martial artist from the Liu family. “So I should escape… wait a moment. I still have money.”<br/><br/>Just as he was about to give up, he remembered something. After defeating Gushan Feng, he discovered over a hundred coins in the room. Gu Yang quickly took out the coins and chose to top up.<br/><br/>“Top-up successful. Current balance 1001.”<br/><br/>“Would you like to use the life simulator? Each use costs 1000.”<br/><br/>He just had enough to use it once.<br/><br/>What luck.<br/><br/>A wave of relief washed over Gu Yang. He really didn’t want to miss out on this opportunity to earn thirty thousand coins. It would not be easy finding another opportunity like this in the future.<br/><br/>“Yes.”<br/><br/>“At the age of 22, you have already reached the sixth level as a martial artist. After leaving Liu Family village, you would save Su Qingzhen in the nearby town, Wanjiagou. You would bring her away from the village. Not wanting to be enemies with the Liu family, you would quietly leave the next morning with Liu Xiaohai.”<br/><br/>“A month later, you would arrive at Elephant city. You would be the talk of the town because of your sixth-grade strength. The various powers in the city would offer you olive branches. After considering, you would decide to accept the county magistrate’s invitation, and be recommended as the deputy leader of the city guard.”<br/><br/>“You would get the fourth level of the ‘Sun’s Red Technique’, as well as learning the military’s Blood Killing Blade Method.”<br/><br/>“You would become immersed in martial arts, searching for martial artists of the same realm to exchange knowledge with, losing more often than winning.<br/><br/>Your infamy for being a martial arts enthusiast would begin to spread.”<br/><br/>“At thirty, with the county magistrate being transferred, he planned to take you with him.”<br/><br/>“On the eve of leaving Elephant city, your colleagues would hold a banquet for you. During the feast, Su Qingzhen would suddenly barge in and kill you on the spot. You would die at the age of thirty.”<br/><br/>What the hell?<br/><br/>The last twist left Gu Yang dumbfounded. He had been through many death scenarios, including being abandoned by his master and being poisoned. But nothing was as outrageous as this time.<br/><br/>He was killed by Su Qingzhen?<br/><br/>At the time of his death, he was only thirty years old, just eight years into the future.<br/><br/>The current Su Qingzhen didn’t have any martial arts skills, but in eight years, she had enough strength to kill him with a single stroke. She had to be at least Fifth Grade, right?<br/><br/>So anyone, regardless of their qualifications, could crush him?<br/><br/>Moreover, Gu Yang had no grudges with Su Qingzhen.<br/><br/>On the contrary, he saved her from Gushan Feng, helping her retain her physical innocence. Gu Yang considered that a considerable favor.<br/><br/>Why would she want to kill him?<br/><br/>Baffled, Gu Yang wanted to ask the simulated Su Qingzhen eight years in the future: Why?<br/><br/>Could it be because she developed a deep hatred for him, just because he abandoned her to escape before the Liu family caught up?<br/><br/>Did she hate him to the point of wanting his life?<br/><br/>Gu Yang remained still for a while, eventually sighing, “Being a good guy is hard.”<br/><br/>“The simulation has ended. You can opt to keep one of the following.”<br/><br/>“Option one: Your martial arts realm at thirty.” “Option two: Your martial arts experience at thirty.”<br/><br/>“Option three: Your life wisdom at thirty.”<br/><br/>Without giving it much thought, Gu Yang chose option two.<br/><br/>The next moment, his mind was filled with knowledge of several formidable saber techniques and over a dozen experiences of fighting against various sixth-grade martial artists.<br/><br/>He then heard some noises nearby. The Liu family had caught up.<br/><br/>In such a critical moment, he didn’t move. Instead, he focused on digesting these pre-existing memories and experiences.<br/><br/>He had to face the sixth-grade martial artist from the Liu family in his best condition.<br/><br/>The Liu family put in a lot of effort to capture her. There wasn’t any immediate danger to her life.<br/><br/>“Miss Su, how’s your foot? Does it still hurt?”<br/><br/>Zhi Xing, the young maid aiding Su Qingzhen, asked this with concern as they walked towards a small river nearby.<br/><br/>Having been asked, Su Qingzhen realized that her foot was no longer in pain. After a bit of movement, she replied, “It seems to have healed.”<br/><br/>“Let me take a look.”<br/><br/>Zhi Xing crouched down to unfasten Su Qingzhen’s shoes. After making sure that there weren’t any signs of injuries such as swelling or redness, she relaxed.<br/><br/>Upon looking up, she saw a blank expression on Su Qingzhen’s face, and tried to reassure her, “Miss, it was a desperate situation last night. You don’t have to dwell on it.’<br/><br/>Before Su Qingzhen could respond, a voice suddenly interrupted, “Miss Su, we’ve finally found you. My master wishes to see you.”<br/><br/>Both women’s expressions quickly changed. They looked up and saw a man in black standing in front of them.<br/><br/>Zhi Xing instinctively shielded Su Qingzhen and loudly exclaimed, “Miss, run!”<br/><br/>However, another voice came from behind, “Don’t bother, you won’t be able to escape. Miss Su, please.”<br/><br/>Turning around, they saw a man in an identical black outfit.<br/><br/>“Don’t come any closer!”<br/><br/>Zhi Xing shouted as she guided Su Qingzhen to a tree, her face full of anxiety.<br/><br/>But, the two men insisted, “Miss Su, please comply with us. We don’t want to use force.’<br/><br/>At that moment, the sound of horse hoofs could be heard. Several horses appeared before them. Leading the way was a young man dressed in black fur. As soon as he saw them, his eyes glistened.<br/><br/>“Ranked 13th on the Beauty List – Ice Skin and Jade Bones. Truly a rare beauty in the world!”<br/><br/>Su Qingzhen’s face turned cold, her eyes showing deep-seated hatred. Her teeth clenched as she spat out, “Third Young Master of the Liu Family, Liu Nuo.”<br/><br/>Young Master Nuo seemed somewhat delighted, “It’s an honor that Miss Su knows my name.”<br/><br/>Su Qingzhen replied coldly, “Doesn’t your Liu family fear that when I eventually win the fifth prince’s favor, I would encourage him to destroy your Liu family?”<br/><br/>“Ha ha ha<br/><br/>Liu Nuo laughed loudly, replying confidently, “As long as my second brother is around, no one can touch the Liu family. The fifth prince won’t be an exception, even if he becomes emperor.”<br/><br/>Su Qingzhen fell silent.<br/><br/>Liu Nuo’s second brother, Liu Zhe, was a second-grade martial artist at the age of twenty, ranked ninth on the martial prodigy list. His master was a divine realm strength warrior and one of the top ten sword saints in the East Sea.<br/><br/>Would anyone dare to oppose him for Su Qingzhen?<br/><br/>Thinking about this, an image suddenly flashed through Su Qingzhen’s mind.<br/><br/>With a sardonic smile, Liu Nuo said, “All these words are just to buy time, aren’t they? You want to alert that seventh-grade martial artist who saved you from Gushan Feng. It’s a pity he hasn’t shown up even after such a long time. Where do you think he went? Did he run away by himself?”<br/><br/>On hearing his words, Su Qingzhen’s face turned ashen.<br/><br/>Liu Nuo didn’t rush and continued to speak deliberately, “Do you still want to wait? It’s better if you give up. Even the Lin family wouldn’t dare to oppose the Liu family for you, let alone in Jiangzhou.”<br/><br/>His voice was like a chilling gust of wind, dragging Su Qingzhen’s heart into a state of despair.<br/><br/>Whoo, whoo—<br/><br/>Suddenly, the two men in black, who were blocking Su Qingzhen and Zhi Xing from escaping, fell to the ground.<br/><br/>Another figure flashed, a silhouette not particularly tall appeared before Su Qingzhen’s eyes. That familiar and unceremonious voice echoed in her ears.<br/><br/>“Stand back.”<br/><br/>In this moment, her heart was completely filled by this figure..\t\t\t\t\t\t</div>", "images": {}, "success": true}