{"id": 18, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14235468.html", "title": "Chapter 18 - Chapter 18: 018 Thought Communication", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 18 - Chapter 18: 018 Thought Communication</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 18: 018 Thought Communication<br/><br/>Translator: 549690339<br/><br/>Among the people present, only Liu Nuo was able to clearly see the altercation between Gu Yang and Zhang Tong.<br/><br/>He himself had the strength of the seventh grade. Although he couldn’t compare to his brother, who was an anomaly, for his age and among the typical disciples of his noble family, he passed muster.<br/><br/>Normally, cultivation level would rapidly increase only after the age of 25 and reach its zenith after 40.<br/><br/>As for freaks like Liu Zhe, there were only nine in the whole world.<br/><br/>Gu Yang and Zhang Tong had only exchanged three moves before Zhang Tong was decapitated on the third.<br/><br/>Seeing this, Liu Nuo was so shocked that he left his horse, fleeing without hesitation.<br/><br/>Whoosh-<br/><br/>In mid-air, he suddenly felt a pain in his back. A powerful force slammed him into a nearby tree.<br/><br/>“No-I’<br/><br/>Lowering his head, he saw a knife impaling his body, pinning him to the tree. He let out a painful cry, beginning to struggle fiercely.<br/><br/>The more he struggled, the faster blood flowed.<br/><br/>Suddenly, he stopped moving.<br/><br/>Gu Yang, seeing Liu Nuo finally dead, felt an indescribable feeling rise within his heart.<br/><br/>Ever since he had started using the Simulated Life simulator, Liu Nuo and Zhang Tong had loomed over him like nightmares.<br/><br/>In almost every simulator run, Liu’s village couldn’t escape its destruction.<br/><br/>He was forced into this desperate situation, even risking trouble with a big problem like Su Qingzhen.<br/><br/>At least now he had accumulated enough power to completely eradicate this huge concern from his mind.<br/><br/>Gu Yang felt the entire weight lift from his heart. The stone on his mind had been unloaded, and his spirit was rejuvenated.<br/><br/>He thought to himself, “This must be what it feels like when your mind is finally clear.”<br/><br/>“Young master, are you alright?”<br/><br/>At this moment, Zhang Xiao Hai emerged from somewhere, rushing over to his side and asking anxiously.<br/><br/>Gu Yang knew he’d been hiding nearby. This kid was really quick-witted. As soon as he realized the situation was turning bad, he immediately hid without causing any trouble.<br/><br/>Lowering his head to glance at the sword wound on his right arm, he said, “I’m fine, it’s just a minor injury.”<br/><br/>The Blood Killing Blade Method was all about fighting for survival. Its main principle was to be ruthless, ruthless to the enemy and even more ruthless to oneself. All of its moves were life-or-death exchanges.<br/><br/>This was purely a deadly saber technique. Once a move was made, it was either the enemy died or I perished.<br/><br/>The secret to it was speed. As long as I was faster than you by a fraction, I could kill you.<br/><br/>If there was the slightest hesitation when attacking, you would end up dead.<br/><br/>Zhang Tong’s sword technique was also extraordinary. Gu Yang was only a notch stronger than him, but the counterattack just before death was absolutely terrifying.<br/><br/>Gu Yang was still stabbed in the arm and wounded.<br/><br/>He instructed, “Go, handle all those bodies. Remember to search their bodies for anything.”<br/><br/>Zhang Xiao Hai wanted to help him with his wound, but seeing the maid already tearing off a piece of cloth to bandage him, he wisely went to the side to deal with the bodies.<br/><br/>With his limited strength, all he could do was these menial tasks.<br/><br/>“Why are you crying? I’m not dead.”<br/><br/>Seeing the maid sobbing while bandaging him, her tears blinking back unrestrainedly, Gu Yang laughed.<br/><br/>Zhi Xing hearing his words, her face blanched instantly. “Master, please don’t say such ominous words. I was just scared…”<br/><br/>Gu Yang said, “From now on, don’t keep calling me Master. I’m only a few years older than you, call me Brother.”<br/><br/>Zhi Xing’s lips tightly pursed, she simply shook her head.<br/><br/>Gu Yang put on a stern face, “What, you don’t want to be my sister?”<br/><br/>“That’s not it…”<br/><br/>Seeing Gu Yang getting angry, Zhi Xing hurriedly explained, her voice weak, “I’m just a maid…”<br/><br/>Unmoved, Gu Yang said, “I’m just a hunter from the mountains with no parents, not much nobler than you.”<br/><br/>Zhi Xing looked at him and said seriously, “No, you are a great hero. To save Miss, you have offended the Liu family and the fifth prince…”<br/><br/>“Then you’re wrong.”<br/><br/>Gu Yang pointed out, “I only intervened because of the three thousand taels of silver. Since I haven’t received the money yet, of course, I can’t let her go with Liu Nuo. I’m not trying to be some damn hero.”<br/><br/>Zhi Xing softly said, “In my heart, you are a great hero.”<br/><br/>Seeing the conversation drifting off, Gu Yang firmly said, “Okay, if I tell you to call me something, you do it. If you don’t change how you address me, I’m going to get angry.”<br/><br/>Zhi Xing was finally unable to persist, gathering up her courage, she softly called him, “Brother Gu.”<br/><br/>“That’s right.”<br/><br/>Over this past couple of years in Liu village, he was well taken care of by Old Man Liu. That he was able to stay in the village was because Old Man Liu permitted it. Otherwise, in this world without family or skills, he would have either been starved to death or eaten by wild animals.<br/><br/>Old Man Liu had even taught him to read.<br/><br/>Since Zhi Xing was Old Man Liu’s granddaughter, of course, he would help where he could.<br/><br/>After all, it was hard for him not to feel amiable towards such understanding and obedient young girl.<br/><br/>Wasn’t she much more adorable than Su Qingzhen who always put on airs and sneered at him?<br/><br/>As Gu Yang was thinking this, he saw Su Qingzhen walking over. His smile suddenly disappeared. He said nonchalantly, “I’m sorry, you can’t be the Queen for now.”<br/><br/>With one sentence, Su Qingzhen, who had been anxiously thinking of a way to thank him, went pale with anger, “You- I’<br/><br/>Her eyes suddenly welled up. She could no longer hold back, turning around and running towards the nearby woods.<br/><br/>She ran quite a distance before suddenly stopping. She felt an incredible sense of unfairness. Finally, unable to hold back, she crouched down and burst into tears.<br/><br/>Seeing her lady running away suddenly, Zhi Xing became anxious. Although Gu Yang’s wound wasn’t fully bandaged, she didn’t dare to leave.<br/><br/>She hurriedly explained, “The words that the young lady said just now weren’t her true feelings. She was just… ‘<br/><br/>Before she could finish, Gu Yang said, “I know.”<br/><br/>He could of course guess why Su Qingzhen wanted to go with Liu Nuo just now.<br/><br/>To be honest, her decision to do so was quite unexpected.<br/><br/>It also made him view this woman in a new light.<br/><br/>However, Gu Yang always held grudges. Each time he remembered the time when Su Qingzhen, instead of being grateful, killed him in Simulated Life, he felt uncomfortable.<br/><br/>He found it really hard to be nice to this woman.<br/><br/>PS: I want to explain that the previous setting where one can only do two simulations a day has been scrapped. The previous context has been changed. Some clients and channels may not have updated, so this is a special note.<br/><br/>Finally, thank you to a few book friends for your rewards. Your support is my motivation..\t\t\t\t\t\t</div>", "images": {}, "success": true}