{"id": 13, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14235444.html", "title": "Chapter 13 - Chapter 13: 013 The Chief Culprit Behind The Destruction Of Liu Family Village", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 13 - Chapter 13: 013 The Chief Culprit Behind The Destruction Of Liu Family Village</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 13: 013 The Chief Culprit Behind the Destruction of Liu Family Village<br/><br/>Translator: 549690339<br/><br/>[At the age of twenty-two, you became a seventh grade martial artist and left Liu Village. In Wang Village, you rescued Su Qingzhen from a bandit in the mountains. At this time, the people of the Liu family chased after you to Wang Village, and you escaped with Su Qingzhen and a few others.]<br/><br/>[The next day, the people of the Liu family caught up to you. In a fierce battle, you killed four people from the Liu family, but eventually fell at the hands of a sixth-grade martial artist from the Liu family, dying at the age of twenty-two.]<br/><br/>As expected, the Liu family’s troop did include a sixth-grade martial artist.<br/><br/>Gu Yang opened his eyes. The outcome of this simulation was not surprising.<br/><br/>By now, he had basically figured out how to use the system: the direction of his Simulated Life was determined by his current thoughts.<br/><br/>So when he thought about testing the strength of the Liu family’s men, his Simulated Self would stay and fight them.<br/><br/>[Simulation ends. You can keep one of the following options.]<br/><br/>[One, your martial arts realm at age twenty-two.] [Two, your martial arts experience at age twenty-two.]<br/><br/>[Three, your life wisdom at age twenty-two.]<br/><br/>Gu Yang chose the second option.<br/><br/>Immediately, his mind was filled with the experience of a brutal fight.<br/><br/>Outnumbered, ten to one, he was initially dismissed by his opponents as a mere amuse to toy with.<br/><br/>It was only after he killed four men that the sixth-grade martial artist from the Liu family stepped in and, using just two strokes of his sword, broke through his defenses and pierced his heart. “Such a terrifying sword technique…”<br/><br/>Gu Yang thought to himself, shocked.<br/><br/>Those two sword strikes filled him with a sense of despair, as if no matter what he did, he couldn’t dodge the final lethal strike.<br/><br/>“Um… sir…”<br/><br/>As Gu Yang pondered how to counter those sword strikes, his maidservant spoke hesitantly, “It’s… too cold here. My mistress can’t stand it. I know there’s a village nearby. We can spend the night there.”<br/><br/>Is there a village nearby?<br/><br/>Gu Yang was no stranger to the area as he often hunted in these parts. He asked, “Where is the village you mentioned?”<br/><br/>“Keep heading south and you’ll find it. It’s Liu Village.”<br/><br/>Gu Yang immediately turned to her, his eyes narrowing in on the scared little maid who was huddled next to Su Qingzhen.<br/><br/>He finally understood why the Liu Village, despite being in a relatively secluded location, couldn’t escape the clutches of the Liu family.<br/><br/>It turned out that the little maid was the cause of all the trouble!<br/><br/>He had thought of many possibilities before, such as the village having treasures hidden in it or it being home to some enemy of the Liu family. Never did he expect that it was merely because this mistress and her maid wanted to seek refuge there.<br/><br/>True to the saying, beauty brings disaster. Disaster seemed to follow them wherever they went.<br/><br/>In Wang Village, the villagers were annihilated by bandits. In the mountain bandit’s den, the bandits too were wiped out in their entirety. Once they reached Liu Village, the whole village would suffer the same fate…<br/><br/>“Sir… what’s wrong?”<br/><br/>The maid was becoming increasingly nervous under his piercing gaze and finally gathered the courage to ask.<br/><br/>Gu Yang asked, “How do you know about that village?”<br/><br/>The maid explained, “My grandfather is the head of the village. I visited there when I was young.”<br/><br/>She was the village head’s granddaughter?<br/><br/>Gu Yang recalled the village head mentioning once that he had a daughter who was married and lived far away, seldom returning home.<br/><br/>He never would have expected that this little girl was the village head’s granddaughter.<br/><br/>“It’s quite a distance to the village, we may not make it before sunrise. She might not be able to endure such a long journey in her current state.”<br/><br/>Now that he understood the dilemma, Gu Yang naturally could not bring them to Liu Village and endanger the lives of the villagers.<br/><br/>“But… what about…”<br/><br/>The maid worriedly glanced at her mistress who was shivering from the cold, and stammered, “My mistress, she—” Gu Yang said, “Come sit next to me.”<br/><br/>“Mistress—”<br/><br/>Despite being exhausted from the terrible cold, Su Qingzhen gritted her teeth. She was only wearing a thin wedding dress and hadn’t eaten anything the whole day. After nearly an hour of walking through the cold wind, she was on the verge of passing out from hypothermia. But the idea of sitting next to a man was unacceptable, even if it meant freezing to death.<br/><br/>Gu Yang was amused. Even in such dire circumstances, she still insisted on maintaining her proud demeanor.<br/><br/>If it wasn’t for the consideration of the thirty thousand two reward, he wouldn’t have bothered helping.<br/><br/>He calmly said, “You might want to reconsider. If you freeze to death here, no one will be able to avenge your family.”<br/><br/>Su Qingzhen’s body stiffened.<br/><br/>Zhi Xing bunched up her strength and pulled her up to sit next to Gu Yang. She didn’t resist anymore.<br/><br/>For the sake of avenging her parents, she had to swallow her pride.<br/><br/>Forcefully seated next to a man, becoming overwhelmed by the smell of blood on him, she wanted to vomit. But she could only grit her teeth and endure it in silence.<br/><br/>Gu Yang said, “Give me your hands.”<br/><br/>Zhi Xing grasped her mistress’s hand and put it in his hand.<br/><br/>Gu Yang held both of their hands and activated the ChiYang Technique to transmit warmth to them.<br/><br/>Both women instantly felt a warm and comforting heat spreading from his calloused hand, permeating their bodies and instantly dispelling the icy chill. It was indescribably comfortable.<br/><br/>Su Qingzhen, who was already drowsy and weak, was overwhelmed by fatigue. Her eyelids grew heavier and heavier until she finally couldn’t resist it anymore, and she leaned her head on Gu Yang’s shoulder, falling asleep.<br/><br/>Across from them sat Zhang Xiao Hai, not so fortunate. He huddled alone in a corner, bracing against the wind and warming himself up by hugging his knees.<br/><br/>Fortunately, he acted smart right after Gu Yang had dealt with the few sentries. He peeled off their cotton clothes and put them on himself. Even in this weather, he didn’t feel the cold.<br/><br/>Although Zhang Xiao Hai was blind, he had heard their conversation and understood.<br/><br/>These two women were to become his future mentors.<br/><br/>In his heart, Zhang Xiao Hai had already regarded Gu Yang as his future master.<br/><br/>This martial artist might seem cold, but through his brief encounters with him, he had come to understand that Gu Yang was indeed a good person.<br/><br/>Compared to his previous iron-shop master who treated him as a servant, not even allowing him to eat his fill, Gu Yang was light-years better.<br/><br/>He was told to guide Gu Yang, but was asked to stay outside the village, saved from the dangers within. When it was time to leave, he was taken along.<br/><br/>Zhang Xiao Hai could feel that Gu Yang truly treated him as a person, not as a laborer, a hired helper, or a slave to be ordered around…<br/><br/>Even though Gu Yang had not formally accepted him yet, he believed in the saying: ‘Where there is sincerity, there is success.’ He would eventually be able to touch Gu Yang.<br/><br/>In his heart, he already regarded Gu Yang as his master.<br/><br/>Gu Yang was unaware of the others’ thoughts. He continued channeling warmth to the two women while resuming his simulations.<br/><br/>Knowing the reason why Liu Village was annihilated, he found the solution easy—just avoid leading the two women there and the tragedy would not occur.<br/><br/>He could finally lower one concern from his mind.<br/><br/>After testing the strength of the Liu family’s troop, the next step was to enhance his strength through the Life Simulator.<br/><br/>At minimum, he had to break through to the sixth grade and possess the full strength of a sixth-grade martial artist.<br/><br/>Right now, he had nine chances left for simulation..\t\t\t\t\t\t</div>", "images": {}, "success": true}