{"id": 11, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14234381.html", "title": "Chapter 11 - Chapter 11: 011 My Mistress Is Rich", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 11 - Chapter 11: 011 My Mistress Is Rich</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 11: 011 My Mistress is Rich<br/><br/>Translator: 549690339<br/><br/>A gust of mountain wind hesitated before letting out a cold chuckle, “So you want me to serve as your cattle and horse, huh? Fine, just don’t try to separate the brothers under my command. If you agree to those conditions, then my life is yours.”<br/><br/>“Deal.”<br/><br/>Zheng Renjie agreed without hesitation, his eyes untouched by the woman’s beauty from beginning to end as if it was all but a passing cloud.<br/><br/>The mountain wind immediately got down on one knee and said gruffly, “From now on, whatever you command, Gu Yang will cross a sea of flames if necessary.”<br/><br/>Zheng Renjie gave a satisfied smile and said, “Remember your words. Tomorrow morning, bring your men with you and wait for me outside the marshland.”<br/><br/>With that, he vanished into thin air.<br/><br/>Gu Yang felt a shadow flicker past him, turning his head to look, he could only catch sight of a white silhouette disappearing over the courtyard wall.<br/><br/>“Sixth grade—.”<br/><br/>Only a martial artist at or above the sixth grade could have such light footwork.<br/><br/>Such cultivation level at such a young age and a surname of Zheng. It was very likely that he was from the family Zheng he had once pledged his loyalty to in a previous simulation.<br/><br/>Coming it back to Zheng Renjie’s approach, Gu Yang had a very bad impression of the so-called noble families.<br/><br/>The way they took in ruthless killers under their wings without any mental strain all under the pretext of understanding the complexity of human nature. They were fully aware that women were brought in against their will yet they turned a blind eye to the harassment of the mountain wind and left.<br/><br/>What kind of ethical values did they hold?<br/><br/>One could only imagine what sort of education these scions of major families were subjected to.<br/><br/>“Who are you?”<br/><br/>At that moment, the mountain wind with the big blade in his hand bellowed fiercely, his face turned violent as he watched Gu Yang standing at the entrance.<br/><br/>The woman sitting on the edge of the bed felt her heart squeeze into chasmic depths when Zheng Renjie left. The sudden ray of hope was once again extinguished completely.<br/><br/>She could never have imagined that a member of the Zheng family, in order to win over a bandit chief, would dismiss her life and safety.<br/><br/>Just earlier, had the mountain wind not suppressed her with his True Qi, she wouldn’t have even been able to speak and reveal her identity. Now she was done for!<br/><br/>She was so immersed in her own despair that she had become oblivious to what the mountain wind was saying. Her mind was completely blank.<br/><br/>“The man who’s going to kill you.”<br/><br/>As Gu Yang lifted his Demon Head Saber, he replied coldly.<br/><br/>“Third brother!”<br/><br/>The Brutal Mountain Wind glanced at his Demon Head Saber, his eyes narrowed in shock, and roared, “What have you done to Third Brother?”<br/><br/>“You guess.”<br/><br/>The Brutal Mountain Wind’s eyes became even more rounded, boiling with killing intent. “I will hack you into a thousand pieces!”<br/><br/>Mit just a step forward, the ground under him shattered as he charged with a ferocity intending to cleave Gu Yang.<br/><br/>This guy possessed an innate, ruthless energy that feared no death. Faced with a stronger opponent, he could play beyond his own strength. It was his nature to be a fighter.<br/><br/>Gu Yang had already learned this from the previous Simulated Life.<br/><br/>Faced with the strong momentum of the man and his deadly blow, Gu Yang did not dodge or avoid it; he also retaliated with a horizontal slash.<br/><br/>Swoosh!<br/><br/>This blade was as swift as lightning.<br/><br/>The Brutal Mountain Wind felt coldness at his throat and a gust of wind sliced through. His ferocity was replaced with disbelief. He mumbled, “Seventh grade?”<br/><br/>A torrent of blood spurted out from his throat, and he collapsed with a loud bang, with a lingering look of regret and reluctance even after his death.<br/><br/>This ruthless criminal had put an end to his sinful life.<br/><br/>“Miss—”<br/><br/>The young girl, who had been hiding outside the door, burst into tears out of joy when she saw the infamous criminal finally dead. She rushed in, hugged her mistress and wept, “We are finally saved— she cried out loud.<br/><br/>Gu Yang ignored them. He began searching the room for spoils of war on his own.<br/><br/>“Zhi Xing?”<br/><br/>Just as Su Qingzhen submerged in despair, she was suddenly awakened by the cry of her maid. Afraid, she mentioned, “Why did you come? Leave quickly!” She didn’t want her sister-like maid to witness what was about to happen.<br/><br/>A breathless, “Miss, we…are saved…,” Zhi Xing was crying and narrated this to her, hugging her.<br/><br/>We’re saved?<br/><br/>For a moment, Su Qingzhen was clueless. She took a while to process this information and then repeated, “We’re saved?”<br/><br/>Zhi Xing wiped her tears away, “Yes, Miss, we’re saved. The wicked man is dead.”<br/><br/>Su Qingzhen turned and saw the corpse on the floor was indeed that of the Brutal Mountain Wind. She felt like she had been drained of her strength. Thinking of her ordeal these past few days, she couldn’t control her tears and began to cry like pearls falling from a string.<br/><br/>Gu Yang searched the room and even the body of the Brutal Mountain Wind.<br/><br/>His gains were not much, a little over a hundred liang. There were no combat techniques or secret methods on the corpse.<br/><br/>Just then, fighting noises came from outside.<br/><br/>Gu Yang had a thought, “Could it be the Liu family’s hunting team.”<br/><br/>He turned his gaze to the still crying pair of mistress and maid and suddenly many previously confusing things began to make sense.<br/><br/>The Liu family must have sent people to Lian Mountain for this woman.<br/><br/>The rumored Beauty List thirteenth rank holder, Su Qingzhen.<br/><br/>The traders had mentioned that the Liu family wished to present her to a senior official, but she ran away. In anger, they exterminated the entire Su family.<br/><br/>So, she escaped to Lian Mountain and the Liu family tracked her here.<br/><br/>Then she was kidnapped by the brutal mountain wind to Wangjiagou and then the Liu family followed suit. So that is why the Liu family’s hunting team appeared in Wangjiagou.<br/><br/>After coming to all these conclusions, Gu Yang warned, “The Liu family is coming. If you don’t leave now, you won’t be able to escape.”<br/><br/>As soon as they heard the words ‘Liu family’, the mistress and her maid, who were still immersed in survival euDhoria. were brought back to realitv.<br/><br/>Overhearing the fight outside, Su Qingzhen’s face changed. She said, “Not good! Zhi Xing, we must leave here quickly.”<br/><br/>Zhi Xing saw that Gu Yang was paying them no mind and was about to crawl out of the window. With the fighting sounds getting closer, Gu Yang had already climbed out of the window. In desperation, Zhi Xing had an idea and called out, “We are wealthy, we have thirty thousand liang!”<br/><br/>Swoosh!<br/><br/>A figure came back through the window and landed next to them. Without a word, Gu Yang grabbed both by the shoulders, smashed the window, and escaped the premises..\t\t\t\t\t\t</div>", "images": {}, "success": true}