{"id": 10, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14234370.html", "title": "Chapter 10 - Chapter 10: 010 Is This True Love?", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 10 - Chapter 10: 010 Is This True Love?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 10: 010 Is this true love?<br/><br/>Translator: 549690339<br/><br/>The treasure brought by the Mountain Wind was over five thousand taels, exceeding Gu Yang’s expectation.<br/><br/>This money is enough for him to run over a hundred simulations.<br/><br/>No, after his Realm breakthrough to seventh grade, the price is definitely going to rise.<br/><br/>Gu Yang opened the system to take a glimpse.<br/><br/>[Use the Life Simulator once, it will consume 500 coins.]<br/><br/>His eyelids twitched.<br/><br/>It’s a tenfold price increase.<br/><br/>Isn’t this a bit excessive?<br/><br/>Fortunately, his gains this time were substantial enough.<br/><br/>Five thousand taels, enough to carry out ten simulations. With continuous accumulation, it should be no problem to breakthrough into the sixth grade.<br/><br/>“Chatter… chatter…”<br/><br/>Suddenly, a chattering sound from teeth made Gu Yang come back to his senses.<br/><br/>He turned his head to see a pale young girl next to him, trembling uncontrollably. Clearly, she was freezing beyond her limits.<br/><br/>About to speak, he suddenly heard a groggy voice from above, “Beauty, I’m coming…” followed by a banging sound, a rude door opening.<br/><br/>The sight of this made the face of the young girl beside Gu Yang change dramatically. She looked at him pleadingly, “Young master… chatter… please…<br/><br/>please… save… save my… miss.”<br/><br/>From her reaction and what she just said, Gu Yang had a rough idea of the ongoing drama.<br/><br/>A lady from a prominent family along with her maid, had been captured by a gang of bandits and was forced into a fake marriage.<br/><br/>Indeed, pitiful people.<br/><br/>“Keep quiet.”<br/><br/>With one hand holding her arm and the other clinging to the well wall, Gu Yang climbed up like a gecko.<br/><br/>After landing on the ground, he saw the girl shivering from the cold. He placed his hand on her back and sent a wave of True Qi over.<br/><br/>The nearly frozen girl only felt warmth circulating throughout her body from her back, dispelling the coldness.<br/><br/>Gu Yang let go of his hand, picked up the ghost-faced blade, and headed towards the room.<br/><br/>In the room, a brutal voice rang out, “…You asked for a formal marriage, a grand palanquin, I did all that, what more do you want?”<br/><br/>Then, the sound of something smashing onto the ground.<br/><br/>Gu Yang came to the slightly opened door, saw two big red candles lit inside, he saw raggedly dressed groom with a full face of beard.<br/><br/>This man must be the ruthless bandit, Mountain Wind.<br/><br/>“Don’t push your luck. I’ve had enough of you. Dammit, I’ve always taken other women by force. When have I been like this with any of them…”<br/><br/>Gu Yang gently pushed the door open, finally seeing the woman inside.<br/><br/>A woman in a big red wedding robe. Illuminated by the red candlelight, she had a desperate yet beautiful face. A dagger in her hand was pressed against her neck, she spoke determinedly, “Even if I die, I will not marry a bandit.” So beautiful!<br/><br/>Gu Yang felt a flash in front of his eyes. This was the most beautiful and charismatic woman he had ever seen in his two lives. Her determined expression was heart-stirring.<br/><br/>No wonder even Mountain Wind, a ruthless blood-soaked bandit, found her mesmerizing.<br/><br/>“Stop!”<br/><br/>Mountain Wind saw the knife break her snow-white skin, bleeding a bit. He was shocked and panicked, “Don’t do this… I’ll stop being a bandit, is that okay?<br/><br/>Put down the knife, I promise anything.”<br/><br/>Gu Yang was also shocked by Mountain Wind’s almost begging expression.<br/><br/>Is this really the ruthless Mountain Wind who murders without blinking, even women and children?<br/><br/>Could this be the so-called true love?<br/><br/>The woman in the wedding robe said coldly, “Fine, I want you to die now.” On hearing this, Mountain Wind burst into a rage, “Do you hate me that much?” The woman’s gaze was sharp as a knife, “If you don’t die, then I will.”<br/><br/>“No, if I die, my third brother will certainly take you. I can’t let you fall into his hands.”<br/><br/>“Then before you die, kill all your underlings.”<br/><br/>“Those are my brothers, you want me to commit an atrocity – who’s there?” Mountain Wind suddenly yelled.<br/><br/>The next moment, there was a yelp, and the dagger in the woman’s hand had been snatched away by Mountain Wind.<br/><br/>This rough guy unexpectedly had some tricks.<br/><br/>Even Gu Yang almost thought he had been found, but it turned out that he was using a misdirection strategy to snatch the dagger out of her hand while she was distracted.<br/><br/>Mountain Wind looked at the wound on her neck, there was some distress in his eyes, and he spoke in a gentle voice, “I won’t let you die. Tonight, we’ll consummate our marriage. Once you bear my child, you’ll naturally follow me.”<br/><br/>The woman looked as pale as death, her lips trembled as she threatened, “If you dare to touch me, I will kill myself here tomorrow.”<br/><br/>Mountain Wind said affectionately, “I will stay by your side for 12 hours. I won’t let you commit suicide. If you refuse to eat, I will force you to drink soup… I won’t let you die.”<br/><br/>Hearing this, the woman was even more desperate, truly understanding the desperation of wanting to live but not being able to, and wanting to die but not being able to.<br/><br/>Suddenly, there was a flash in her hollow eyes.<br/><br/>A figure reflected in her pupils.<br/><br/>Suddenly, there was an extra person in the room.<br/><br/>“Clap clap clap…”<br/><br/>Three applauds abruptly rang out, greatly shocking Mountain Wind. As he turned around, he saw a young man in white, carrying a long sword on his back.<br/><br/>The young man commented, “Everyone says that Mountain Wind is a cold-blooded butcher. But who would have thought, you actually have a sentimental side. Loyal and infatuated.”<br/><br/>“Who are you?”<br/><br/>Moutain Wind felt bitter inside. This kind of demeanor was clearly some young master from a prominent family.<br/><br/>Gu Yang, standing outside the door, was also startled. He felt a shadow passing by his side, so fast that he couldn’t react.<br/><br/>The young man who suddenly appeared looked to be sixteen or seventeen, but he carried himself with an older air and posture.<br/><br/>But, if someone else was willing to rescue her, that would be better. He could save some energy and avoid getting blood on his hands.<br/><br/>After all, the most crucial treasure was already in his possession.<br/><br/>“Zheng Renjie!”<br/><br/>The young man in white spoke in a casual manner, but the arrogance inherent in his bones was impossible to hide.<br/><br/>Mountain Wind’s eyes narrowed, “Zheng family?”<br/><br/>The stunning woman sitting on the bed lit up with hopeful eyes. With her insight, she naturally saw that this young man’s strength far surpassed Mountain Wind’s.<br/><br/>And most importantly, the Zheng family was the top noble family in Xiang County. As Mountain Wind had committed countless crimes in Xiang County, this Zheng family disciple must have come to eradicate Mountain Wind.<br/><br/>She was about to cry out of relief.<br/><br/>Mountain wind turned around, stared deeply at the woman by the bed, then<br/><br/>turned back to face Zheng Renjie. He said calmly, “Let’s get started. I just hope you can spare my men, and treat her well. To this day, I’ve never touched her.”<br/><br/>“Alright!”<br/><br/>Zheng Renjie patted his hands together, “You’re indeed a man. From now on, you’ll follow me.”<br/><br/>This comment left the three people in the room almost unable to believe their ears..\t\t\t\t\t\t</div>", "images": {}, "success": true}