{"id": 29, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14254622.html", "title": "Chapter 29 - Chapter 29: 029 Is Here!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 29 - Chapter 29: 029 Is Here!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 29: 029 is here!<br/><br/>Translator: 549690339<br/><br/>In the early morning, when the first ray of sunlight penetrated through the window and illuminated the bed, Gu Yang suddenly opened his eyes and looked out the window, his brow furrowed, “Could it be the people from the Liu family have caught up? How did they get here so quickly?”<br/><br/>This was their fourth day since leaving Tianshui City. They spent last night in a small town, lodging at a local’s home.<br/><br/>Once they had left the Lian Mountain range, there were signs of human habitation everywhere, one village after another. No longer were they eating in the open and sleeping under the stars as they did before.<br/><br/>Just now, he had heard the sound of horse hooves entering the town and was instantly on alert.<br/><br/>According to the many simulations he had performed before, it would be a year before the Liu family knew that Su Qingzhen was in Ba County and sent people to fetch her.<br/><br/>And the swordsman dispatched by the Lin family should not have appeared until tomorrow.<br/><br/>Gu Yang was not too superstitious about the results of Simulated Life. After all, that was just a simulation, not divination.<br/><br/>Even if it were divination, the mindset before and after divination would be entirely different. Such changes in mindset would lead to different choices in many matters, thus creating a butterfly effect.<br/><br/>Taking his machete, he walked outside and saw Su Qingzhen seated on the ground practicing her cultivation. She was just finishing her exercise, expelling the impurities in her chest, which formed a white qi column.<br/><br/>“Ninth Rank?”<br/><br/>Gu Yang’s eyes condensed. This was precisely the characteristic of the “Xuan Yuan Method” when it reached the Ninth Rank.<br/><br/>In just a few short days, she had already broken through her cultivation rank.<br/><br/>Wasn’t this way too exaggerated?<br/><br/>It defied common sense.<br/><br/>Normally, no matter how talented one was, to reach a new cultivation rank required an accumulation process. True Qi wouldn’t be produced out of thin air. Even those from big clans had to go through numerous medicinal baths and consume elixirs, taking them about a year or two to reach a new cultivation rank when they first started practicing.<br/><br/>As for ordinary people without any resources, this process would be even longer.<br/><br/>Under his watchful eyes, it would have been impossible for Su Qingzhen to secretly consume an elixir.<br/><br/>“Could it be due to the Yin Qi in her body?”<br/><br/>Gu Yang, with his profound Martial Arts cultivation level, soon had a guess.<br/><br/>His True Qi, known as Reaching Yang, and her Xuan Yuan Qi, being the Extreme Yin, had created a mysterious reaction. The combination of the two not only brought great benefits to him, but the benefits she received were likely even greater.<br/><br/>“Her True Qi should all originate from the Xuan Yuan Qi in her body. After reacting with my Reaching Yang Qi, it was absorbed and refined by her body.<br/><br/>That’s why she could break through her cultivation rank in such a short time.”<br/><br/>Gu Yang felt that this should be very close to the truth.<br/><br/>“What the Liu family fancies must be her special constitution.”<br/><br/>A hint of joy appeared in Su Qingzhen’s eyes. As soon as she opened her eyes, she saw Gu Yang and quickly stood up.<br/><br/>“I will go out and take a look. You two stay here.”<br/><br/>After saying this, Gu Yang left the house.<br/><br/>Gu Yang went to find Zhang Xiao Hai and asked him to go out and find out what was going on.<br/><br/>Before long, Zhang Xiao Hai returned and informed him that it was a young master from the Zheng family out for some amusement.<br/><br/>So, it was the Zheng family.<br/><br/>Gu Yang had dealt with the Zheng family several times in his previous simulations.<br/><br/>In Ba County, the Zheng family was the leading family, their position comparable to that of the Liu family in Elephant County. Both were influential local forces with deep roots.<br/><br/>Such esteemed families typically had a Third Rank Martial Artist to back them up.<br/><br/>However, an ordinary young master would not have too many powerful experts by his side.<br/><br/>With Gu Yang’s current strength, there was no need to fear a noble young lad of this level. If he dared to act without thinking, he wouldn’t hesitate to teach him a lesson. As long as he didn’t maim or kill him, the Zheng family would most likely not send powerful experts for retaliation.<br/><br/>After they finished breakfast, Gu Yang and his group packed up and continued their journey.<br/><br/>At noon when they stopped to rest, they unexpectedly ran into the Zheng family procession. They had also hired a horse-drawn carriage and were followed by seven or eight horsemen.<br/><br/>However, neither party had any intention of exchanging pleasantries. When the people from the Zheng family passed by, they soon disappeared from sight.<br/><br/>After eating lunch, they set off again.<br/><br/>In the evening, they spent the night in another small town along the way. As before, they used silver to find lodging with a local family.<br/><br/>As it turned out, the people from the Zheng family were also spending the night in this town.<br/><br/>It seemed that their routes were the same.<br/><br/>A peaceful night passed by.<br/><br/>The next morning, Gu Yang and his group set off first.<br/><br/>Not long after they started, Gu Yang, who was inside the horse carriage, suddenly had a strange feeling and opened his eyes.<br/><br/>Simultaneously, the horse carriage stopped, and the voice of the coachman came from outside, “Young master, there is a man standing in the middle of the road, we can’t pass.”<br/><br/>Gu Yang lifted the cloth curtain to have a look and saw a man in grey standing not far ahead, wearing a straw hat and holding a sword. It appeared he had been waiting there for quite some time.<br/><br/>And so, the action begins!<br/><br/>Su Qingzhen saw the swordsman outside and her heart tightened involuntarily.<br/><br/>“I’ll be right back.”<br/><br/>Gu Yang said, lifted the carriage curtain, got out of the carriage, and walked towards the swordsman.<br/><br/>Not far behind, in the Zheng family’s horse carriage, sat an unkempt old man. He was holding a roast chicken in his hand, devouring it so enthusiastically that oil was streaming down his face.<br/><br/>Across from the old man sat a young man, summoning up an ingratiating smile, “Senior, is the roast chicken to your liking?”<br/><br/>Without pausing in his eating, the old man expressed his satisfaction, “Hmm, it still has the taste from ten years ago.”<br/><br/>“Could you provide some guidance then, senior?”<br/><br/>The old man stopped for a moment and said, “I never agreed to teach you anything. ”<br/><br/>“Yes, yes, I am willingly doing all these things for you, senior. If there is anything else you want to eat, just let me know,” said the young man. Judging from his clothing, he was clearly from a noble family. Yet he was very deferential toward this old man.<br/><br/>This young man’s name was Zheng Anyu, the legitimate son of the Zheng family. A year ago, he had received a piece of advice from the old man by chance and was able to break through his bottleneck. Since then, he had tried repeatedly but failed to find out the old man’s background. He knew that the old man was eccentric and had purposefully tried to get close.<br/><br/>However, the old man remained apathetic and indifferent to him.<br/><br/>Zheng Anyu was a tenacious person and served the old man as if he were his biological father.<br/><br/>After one year, he had finally become familiar with the old man. A few days ago, the old man mentioned that he missed some local cuisine, so he accompanied the old man to visit these remote towns and find the food he mentioned.<br/><br/>This was already the seventh place they had visited.<br/><br/>Just then, the horse carriage suddenly stopped.<br/><br/>Zheng Anyu asked, “What’s happening?”<br/><br/>The coachman outside responded, “The road ahead is blocked.”<br/><br/>He opened the window to check and saw that a horse carriage ahead was being held up by a swordsman. He said, “Senior, there’s an interesting spectacle ahead.”<br/><br/>The old man glanced at the scene and chuckled, “Best not to watch this spectacle. ”<br/><br/>Zheng Anyu’s heart jolted. He knew the old man would not make groundless remarks and asked, “Senior, do you recognize that man?” “I’ve met him once before, seems like his name is Zhou Qing.”<br/><br/>“Zhou Qing?”<br/><br/>Zheng Anyu felt the name was familiar and his face changed slightly, “The Zhou Qing from the Lin family?”<br/><br/>Zhou Qing was known as a lone swordsman with a Fifth Rank cultivation level. He was usually active in Elephant County. In reality, he was an undercover agent for the Lin family. Zhou Qing was renowned for his unmatched Wind<br/><br/>Thunder Sword Technique. Five years ago, he had killed a Fifth Rank Martial Artist, which earned him his fame.<br/><br/>Could he be coming at me?<br/><br/>Zheng Anyu’s first reaction was this, and he felt uneasy about it.<br/><br/>“Huh?”<br/><br/>Suddenly, the old man beside him exclaimed in surprise, his eyes fixed intently on the man who got down from the horse carriage in front..\t\t\t\t\t\t</div>", "images": {}, "success": true}