{"id": 20, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14254613.html", "title": "Chapter 20 - Chapter 20: Why Are You Treating Me This Way, 020?", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 20 - Chapter 20: Why Are You Treating Me This Way, 020?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 20: Why are you treating me this way, 020?<br/><br/>Translator: 549690339<br/><br/>“How is that even possible?”<br/><br/>After triple checking the faint but definitely real True Qi within her, Su Qingzhen was completely shocked.<br/><br/>She was born in the Su family, an old-established family in Ba County. Like any other small family in this kind of region, survival was tough and their welfare often depended on having at least one exceptional family member, whose success could sustain the family for decades.<br/><br/>Conversely, if no remarkable characters emerged for one or two generations, the family would soon decline.<br/><br/>The Liu family was a positive example. A single character, Liu Zhe, had propelled the Liu family to become the most prominent one in Jiangzhou.<br/><br/>On the other hand, the Su family was a negative example. Having once been illustrious, its absence of any standout characters for several generations led to its decline.<br/><br/>In this generation, they were left hanging on by a thread with only a fifth grade practitioner.<br/><br/>Considering their situation, the family no longer cared about gender and began training both boys and girls in Martial Arts from an early age.<br/><br/>The contemporary head of the family was Su Qingzhen’s father and she had been guided by him since she was a child.<br/><br/>However, regardless how hard she tried, she was unable to cultivate even a hint of True Qi.<br/><br/>All this time, she believed she was worthless and couldn’t cultivate Martial Arts.<br/><br/>All that changed two months ago. When she visited a temple outside of town, she encountered an old Daoist who was shocked upon meeting her. He claimed that she possessed the legendary Ice-Skin Jade-Bone constitution.<br/><br/>News of this spread fast.<br/><br/>Then, to her bewilderment, she found her name listed on the Beauty list, at the thirteenth position.<br/><br/>This unforeseen fame brought disaster to the Su family.<br/><br/>This so-called Ice-Skin Jade-Bone constitution caused Su Qingzhen innumerable misfortunes. Because of it, she had been unable to cultivate from a young age, being treated as a nobody by others.<br/><br/>Due to this, she was placed on the Beauty list, resulting in the calamity that led to the demise of her family and destruction of her home.<br/><br/>Now, she was somehow able to cultivate, and had actually formed her first strand of True Qi.<br/><br/>The problem which had troubled her for over a decade had inexplicably resolved itself?<br/><br/>Su Qingzhen was on the verge of tears due to her overflowing joy.<br/><br/>“Such natural talent—” observing Su Qingzhen’s True Qi circulation around her body, Gu Yang sighed when he saw the faint glow in her eyes after one complete rotation.<br/><br/>Having discovered the extremely cold Yin Qi in her meridians, he understood that under normal circumstances, it would be impossible for her to condense True Qi.<br/><br/>Unless a Third Rank expert used their True Qi to help her purge the Yin Qi from her meridians, she wouldn’t be able to cultivate Martial Arts like other people.<br/><br/>As it happened, last night, he stumbled upon neutralizing her Yin Qi using his Solar True Qi.<br/><br/>Therefore, her first attempt at cultivation today lead to her forming her first True Qi within a quarter of an hour.<br/><br/>Such innate talent was absolutely top-notch.<br/><br/>If he had such a talent, he reckoned he would have already reached the First<br/><br/>Rank.<br/><br/>Gu Yang felt a bit despondent when he thought of that.<br/><br/>Despite him simulating life several times, and training for more than one hundred years, he’d only barely managed to break through to the sixth grade. His natural talent was incomparably inferior.<br/><br/>An hour or so later, Gu Yang and his team set off again. This time, he decisively set most of the spare horses free, leaving only four. Everything that bore the Liu family’s insignia, including all of their weapons, was discarded as well.<br/><br/>Just like that, they traveled by day and made camp to rest at night. Ten days later, they finally left the mountains.<br/><br/>Before descending the mountain, Gu Yang had also released the four horses and abandoned everything else left behind by the Liu family members, including tents.<br/><br/>Afterwards, Gu Yang and his three companions only had their personal belongings left.<br/><br/>When they came down from the mountain, Gu Yang chose not to stay overnight in any village or market. Instead, they found a broken-down temple in the wilderness where they planned to spend the night.<br/><br/>Zhang Xiao Hai was very efficient, making a fire and cleaning up the temple. He gathered some straw and made a corner for everyone to rest in.<br/><br/>The four of them sat around the fire as Gu Yang continued to teach them Martial Arts.<br/><br/>Zhang Xiao Hai and Zhi Xing both had promising talents.<br/><br/>Zhi Xing had some basics, and with some guidance, she quickly got the hang of it.<br/><br/>Zhang Xiao Hai succeeded through sheer diligence. He saw Martial Arts as his only chance to change his destiny and practiced extremely rigorously.<br/><br/>But Su Qingzhen, who had the highest talent, faced some problems.<br/><br/>Ever since she realized she could cultivate, she was overjoyed. She finally saw a glimmer of hope for revenge.<br/><br/>However, her progress slowed down drastically in the following few days. What was even more horrifying was that the True Qi she had painstakingly cultivated seemed to be evaporating, bit by bit.<br/><br/>Two days ago, the last strand of True Qi in her body dissipated.<br/><br/>In a single night, she was back to square one.<br/><br/>Su Qingzhen was desperate and had no idea what to do, experiencing once again the hopelessness of being unable to cultivate.<br/><br/>Over those few days, she wrecked her brain for answers and speculated the real reason as to why she was suddenly able to cultivate.<br/><br/>It probably had something to do with that night when Gu Yang helped her circulate her Qi to fend off the cold.<br/><br/>She sat in the corner, stared at the wall reflecting Gu Yang’s tall figure, and listened as he meticulously explained each and every point of Xuan Yuan Method. Biting her lip, she finally made up her mind.<br/><br/>The night grew darker.<br/><br/>Zhang Xiao Hai was meditating alone in a corner.<br/><br/>Gu Yang was resting with his eyes closed when he heard a series of subtle teeth grinding noises. Slightly surprised, he couldn’t help but smile.<br/><br/>For so many days, this young lady hadn’t spoken a word to him. She was so stubborn.<br/><br/>Now, she finally couldn’t hold back anymore?<br/><br/>All these days, while he was teaching Zhang Xiao Hai and Zhi Xing Xuan Yuan Method, he never tried to exclude Su Qingzhen. He was waiting, just for this day.<br/><br/>“Miss, are you alright?”<br/><br/>Zhi Xing asked worriedly before screaming, “Brother Gu, something’s wrong.<br/><br/>Miss’ body is so cold, as cold as ice. You need to come and see.”<br/><br/>Gu Yang stood up and walked over at her words. Seeing Su Qingzhen huddled there, he reached out to touch her forehead and felt an icy-cold sensation.<br/><br/>With a serious expression, he said, “This is not good. The Yin coldness has invaded her body. If this continues, she’ll quickly lose body temperature and die. ”<br/><br/>Zhi Xing was immediately alarmed and asked anxiously, “What should we do then?”<br/><br/>“There’s only one solution to save her. We have to take off her clothes and I’ll hold her in my arms. Our skin needs to be in direct contact for me to circulate Xuan Yuan Method. By warming her up, we could possibly save her.”<br/><br/>“What? This…this…<br/><br/>Zhi Xing was dumbstruck after hearing this unconventional method.<br/><br/>“At such a time, why would you worry about such trivialities? Do you intend to just watch her freeze to death?”<br/><br/>Upon hearing his words, Zhi Xing clenched her teeth and said, “Fine.” She reached out to untie her Miss’ waistband.<br/><br/>Suddenly, a hand stopped her. It was Su Qingzhen’s. Zhi Xing exclaimed, “Miss, you’re finally awake!”<br/><br/>Su Qingzhen ignored her, gritting her teeth as she glared at Gu Yang.<br/><br/>She knew that he did it on purpose.<br/><br/>But Gu Yang didn’t look at her. He said, “Since she is awake, it means she’ll be alright.” He then walked back to his original place and sat down.<br/><br/>Su Qingzhen felt her eyes welling up with tears, her chest heaving rapidly.. She could no longer hold back her emotions and questioned, “Why…why are you doing this to me?”\t\t\t\t\t\t</div>", "images": {}, "success": true}