{"id": 28, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14254621.html", "title": "Chapter 28 - Chapter 28: 028 Is Really Crazy", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 28 - Chapter 28: 028 Is Really Crazy</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 28: 028 is really crazy<br/><br/>Translator: 549690339<br/><br/>“Thud, thud.”<br/><br/>At that moment, there was a knock on the door from the outside.<br/><br/>From the footsteps outside the door, Gu Yang knew it was the waiter, and he thought the timing was quite coincidental.<br/><br/>The small maid, Zhi Xing, who was in the outer room asked, “Who is it?” The voice of the waiter came from outside, “Sir, someone has delivered an invitation card, saying they wish to meet you.”<br/><br/>Zhi Xing opened the door, and sure enough it was the waiter, who handed over an invitation card.<br/><br/>An invitation card?<br/><br/>She was somewhat puzzled. After taking the invitation card, she handed over a few coins as a tip, sent the waiter away, and closed the door again.<br/><br/>She opened the card and exclaimed, “The Lin Family?”<br/><br/>In Jiangzhou, who doesn’t know the Lin family?<br/><br/>Zhi Xing, as Su Qingzhen’s personal maid, had also undergone professional training, and could recognize the emblem of the Lin family on the invitation.<br/><br/>No one would dare to impersonate this emblem.<br/><br/>But why would someone from the Lin family send Brother Gu an invitation?<br/><br/>When Su Qingzhen heard her words, she was also surprised. Her gaze swept across the invitation and sure enough, she saw the seal of the Lin family.<br/><br/>She remembered that Gu Yang just asked her about the Lin family. Could it be that he had already anticipated that someone from the Lin family would come to see him?<br/><br/>The two women looked at Gu Yang simultaneously.<br/><br/>All along, they found Gu Yang mysteriously exceptional. Now, someone from the Lin family had initiated sending an invitation to him.<br/><br/>This was the Lin family after all.<br/><br/>“Give it here.”<br/><br/>Gu Yang took the invitation from Zhi Xing’s hand, opened it and surely it was from Lin Zirui, saying he wanted to meet him.<br/><br/>This guy seemed quite modest and respectful. Given his status, sending an invitation already indicated his high regard for Gu Yang.<br/><br/>After Gu Yang refused him, he even sent someone to kill him, which further proved his consideration.<br/><br/>If he couldn’t be used, he was to be killed.<br/><br/>Gu Yang always found it strange, why would he see him as a threat? As the legitimate son of the Lin family, surely he isn’t so shortsighted?<br/><br/>“You guys stay here, I’ll be back soon.”<br/><br/>Gu Yang put away the invitation, gave a word of caution, and then left.<br/><br/>Lin Zirui was sixteen this year, with a handsome jade-like face and red lips. His genes were truly outstanding.<br/><br/>He didn’t purposely show off, but standing there alone, he couldn’t be ignored.<br/><br/>He only had a thin man by his side, who should be a guard, but his real level of cultivation was not discernible.<br/><br/>Gu Yang took the initiative to greet him, “Gu Yang at your service, greetings to the Seventh Young Master.”<br/><br/>Among the legitimate lineage of the Lin family, Lin Zirui was seventh.<br/><br/>“Seeing Mr. Gu’s saber technique today, I was delighted and took the liberty of visiting you. I hope you can forgive me.” Lin Zirui was without airs, young as he was, he carried a sense of nobility.<br/><br/>It was hard to see that this man could actually be so narrow-minded.<br/><br/>“My crude saber technique is not worth mentioning,” Gu Yang felt he had to be modest.<br/><br/>Lin Zirui asked, “Mr. Gu is being modest. The strike this afternoon already showed that you have a glimpse of the way of the saber. You certainly learned from a famous master. Can I ask where Mr. Gu learned his skills?”<br/><br/>“Just a country bumpkin with no sect, my saber technique is all self-taught.’ Gu Yang had originally planned to fabricate a mentor.<br/><br/>But on second thought, even doing so might not make him hesitate. If this raises his attention, and he sends a fourth-rank martial artist to kill him, it would be a self-defeating move.<br/><br/>Lin Zirui had his own guesses inside.<br/><br/>With his knowledge, naturally he wouldn’t mistake Gu Yang as coming from the well-known Gu family, which was known all over the world. Each great clan in the world has its unique martial arts inheritance.<br/><br/>Gu Yang’s strike had shown his basic level.<br/><br/>Even if he had a mentor, it was most likely because he had some connection with the military and learned some saber technique from a martial artist of the Wu family. The cultivation technique he practiced was nothing more than the “Sun’s Red Technique”.<br/><br/>His mentor was at the most a fourth-rank one.<br/><br/>Above the third rank in the world, whether it be large sects, or large families, they all come from prominent lineage.<br/><br/>The reason is simple. Almost all cultivation techniques that can be practiced to above the third-rank realm are mastered by large sects and families.<br/><br/>“Sun’s Red Technique” is an exception. Although this technique can be cultivated to above third rank, it’s extremely dangerous. Once it’s cultivated to the third rank, the yang force begins to lose control.<br/><br/>By the time it reaches the second grade, death is almost certain.<br/><br/>It is safe to say that the higher the cultivation, the faster the death.<br/><br/>Plus, Gu Yang’s behavior in the afternoon of extorting money from Dong Xuan further showed that his status could not be very high.<br/><br/>After Lin Zirui assessed the man in front of him, he issued an invitation directly, “Mr. Gu has such a talent for saber technique, it shouldn’t be buried.<br/><br/>Why don’t you join the Lin family and study the saber with me?”<br/><br/>Gu Yang could hear the sincerity in his tone, how much of it was acting, he wasn’t sure.<br/><br/>“Thank you for your kindness, Seventh Young Master. However, I am used to being a loner and can’t stand restrictions.”<br/><br/>Lin Zirui sighed, “That’s a pity.”<br/><br/>After leaving the inn, Lin Zirui’s face darkened and he said coldly, “A sixth-grade martial artist dares to refuse me, Ah Wu!”<br/><br/>“Yes!”<br/><br/>The cold and thin man behind him responded, “I’ll arrange it right away.”<br/><br/>Lin Zirui sneered, “A saber prodigy? Hmph.”<br/><br/>Soon, the figures of the two individuals disappeared into the night.<br/><br/>“He’s really decided to kill me.”<br/><br/>Gu Yang stood there, watching Lin Zirui’s departing figure, and thought to himself.<br/><br/>Although Lin Zirui hid it well, how could he conceal it from him?<br/><br/>Up to now, he has accumulated decades of martial arts experience, which includes not only swordsmanship, but also countless experiences of fighting against others.<br/><br/>In terms of combat experience, he could definitely boast of being enormously experienced.<br/><br/>Such an immature guy like Lin Zirui, no matter how he conceals it, once he has a murderous intent, can still be detected by him.<br/><br/>He must be insane.<br/><br/>The night passed without a word.<br/><br/>The next morning, Gu Yang hired a horse-drawn carriage, loaded the two empty boxes onto it, and set off as planned.<br/><br/>He did not leave overnight or take any remote routes.<br/><br/>Initially, he really had no intention to provoke the Lin family.<br/><br/>However, the numerous simulations of life made him understand one thing; no matter how cautious he was to avoid conflicts with others, there would always be unexpected situations that posed dangers.<br/><br/>Like this matter with Lin Zirui was purely an unwarranted disaster.<br/><br/>So, Gu Yang got over it, he won’t suppress his anger.<br/><br/>Besides, in the path of martial arts, if you’re always avoiding problems, you will eventually lose your sharpness and your mental state will gather dust. What needs to be faced has to be confronted bravely.<br/><br/>Although Lin Zirui couldn’t be killed now, he was still the legitimate son of the Lin family. Gu Yang wasn’t able to mess with a behemoth like the Lin family for now.<br/><br/>However, the swordsman sent by him, Gu Yang had no plans of letting go.<br/><br/>After he figured it out, he felt considerably relaxed. His mental cultivation had also improved somewhat.<br/><br/>Next, he was just waiting for the swordsman to appear.<br/><br/>Gu Yang took out his cleaver and started cultivating his intent..\t\t\t\t\t\t</div>", "images": {}, "success": true}