{"id": 27, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14254620.html", "title": "Chapter 27 - Chapter 27: 027 Fifth Grade", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 27 - Chapter 27: 027 Fifth Grade</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 27: 027 Fifth Grade<br/><br/>Translator: 549690339<br/><br/>“After you guys escaped Pingcheng, people from the Liu family caught up with you the next day. You were fleeing when a swordsman in white came by and fended off the people from the Liu family, saving you.”<br/><br/>“The white-clad swordsman’s name was Shen Baiyi, he was third on the Hidden Dragon List. He came to Jiangzhou to challenge Liu Zhe, who was ninth on the list of talented young people. He fell in love with Su Qingzhen at first sight and after learning of her experience, he wanted to bring her to the Liu family and seek justice for her.”<br/><br/>“After Su Qingzhen gracefully declined, you left Jiangzhou and began a nomadic life.’<br/><br/>“A month later, you heard the news that Shen Baiyi lost to Liu Zhe.”<br/><br/>“Half a year later, you got into a conflict in Shangzhou and were accidentally caught in a trap, suffering severe swelling. Su Qingzhen carried you to the Shen family. From Shen Baiyi, she asked for an antidote for the holy medicine Sky<br/><br/>King Dan.”<br/><br/>“After detoxification, you used the misfortune to gain stronger strength, breaking through to the Fifth Grade realm.”<br/><br/>“After you healed, you found a letter from Su Qingzhen saying that she has already repaid your grace, and you will no longer see each other.”<br/><br/>“You had nothing but to leave in disappointment.”<br/><br/>“A year later, people from the Liu family found you again and killed you. You were twenty-five years old.”<br/><br/>Finally, I have reached Fifth Grade!<br/><br/>Gu Yang was so excited.<br/><br/>It took six simulations to break through to the Fifth Grade. It was incredibly hard.<br/><br/>This simulated life only lasted three years, yet it was full of ups and downs. For the first time, I encountered a scenario where a high-level expert intervened to save the day.<br/><br/>Of course, Shen Baiyi must have stepped in because of Su Qingzhen.<br/><br/>Moreover, Su Qingzhen deserves credit for his successful breakthrough to the Fifth Grade this time.<br/><br/>Sky King Dan, the name itself suggests it is not just any common elixir.<br/><br/>“She actually went to Shen Baiyi to save me…”<br/><br/>Gu Yang was genuinely surprised. Without thinking, she must have paid a significant price for this Sky King Dan.”<br/><br/>He suddenly felt that this young lady was not that annoying.<br/><br/>At least, she distinguishes between rewards and punishments. “The simulation has ended, you can retain one of the following items.”<br/><br/>“One, the martial arts realm at the age of twenty-five.”<br/><br/>“Two, the martial arts experience at age twenty-five.” “Three, life wisdom at the age of twenty-five.”<br/><br/>“I choose the first.<br/><br/>Boom!<br/><br/>Gu Yang felt like his True Qi inside his body exploded and quickly inflated. This speed was much faster than any previous time.<br/><br/>Even the little maid caring for Su Qingzhen in the outer chamber was startled. She looked over with a hint of worry in her eyes.<br/><br/>It took a full quarter of an hour before Gu Yang’s True Qi calmed down and returned to his Dantian.<br/><br/>He opened his eyes, exhaled a foul breath, and retracted the brilliance in his eyes.”<br/><br/>“Fifth Grade!”<br/><br/>His True Qi increased several times than before.<br/><br/>There is a vast difference between martial arts realms in this world. The higher the level, the more so it is.<br/><br/>No wonder, in Simulated Life, when faced with a martial artist of higher realm, he had no ability to resist and was always decisively defeated<br/><br/>Every breakthrough in the realm is a completely different perspective.<br/><br/>Of course, breaking through a realm is not always a good thing.<br/><br/>It means that using the life simulator will increase in price.<br/><br/>Now, there are over 2,200 balances in the system.<br/><br/>“Do you want to use the Life Simulator? Use it once, costing 2000 gold.” Gu Yang saw this prompt, felt joy in his heart, and it only doubled the cost.<br/><br/>He chose “confirm” without hesitation.’<br/><br/>This world is too dangerous. He, as a transmigrator who’s being targeted by the World Will, who knows what kind of accidents he will encounter.<br/><br/>He has to seize every opportunity to enhance his strength.<br/><br/>“At the age of twenty-two, you are a Fifth Grade martial artist. After saving Su Qingzhen, you head to Tianshui City.”<br/><br/>“You design to extort Dong Xuan and obtain twelve thousand Liang. You leave Tianshui City overnight and from then on, you hide during the day and travel at night, sticking to remote mountain roads.”<br/><br/>“Two months later, you finally reach Pingjun. Su Qingzhen keeps her promise and brings you to the bank, exchanging three thousand Liang of silver notes.”<br/><br/>“A year later, you arrive at the heart of Great Zhou, the Divine City. You decide to join the Tianxin Martial Arts Hall. A month later, you pass the assessment and are accepted as a direct disciple by the master, ranking fifteenth and learning the ‘Duan Yue Knife Technique.”‘<br/><br/>“By the age of twenty-five, your ‘Duan Yue Knife Technique’ has slightly succeeded, and your name gradually begins to spread.”<br/><br/>“One day, Guo Taiping, the seventh on the list of talented individuals, comes to the martial arts hall, defeats the master in ten moves, and leaves. That night, the master dies from his severe injuries.”<br/><br/>“The night after the master’s death, you find someone has broken into the martial arts hall. When you go to check, you find the third senior sister, the sole daughter of the master, has been kidnapped. You catch up and are seriously injured by a palm strike from the mysterious strongman, but it also arouses the martial arts hall’s other experts, who each step in to interrupt.”<br/><br/>“In the end, the mysterious strongman is repelled and the third senior sister is successfully rescued. Touched by your life-saving grace, the third senior sister personally takes care of you without unwrapping your clothes, and your injuries gradually improve.”<br/><br/>“Afterwards, the third senior sister inherits the position as the hall’s master. For two years, the Tianxin Martial Arts Hall barely maintains, and disciples continue to leave, no longer as glorious as before.”<br/><br/>“One day, a royal decree from the Empress Dowager marries the third senior sister to the prince. The third senior sister dares not resist the decree and passes the position of the master to the second senior brother.”<br/><br/>“Then, you travel abroad and run into Liu Zhe on the road, who kills you with one sword. You died at the age of twenty-seven.’<br/><br/>This life simulation was much more exciting than before.<br/><br/>Gu Yang couldn’t help but sigh and in the end, he died in the hands of Liu Zhe, a Second Grade-powerful person.<br/><br/>Sure enough, after reaching a higher realm, the treatment is radically different.<br/><br/>Last time I joined Tianxin Martial Arts Hall as a common disciple. This time, I became a direct disciple of the master. Ranked fifteenth, meaning there are only fourteen direct disciples.<br/><br/>It’s not hard to imagine how rare this is.<br/><br/>At the same time, he learned a more powerful sabre technique, “Duan Yue Knife Technique”. Since it was taught by that master who is of Third Rank or above, it’s definitely not an ordinary sabre technique.<br/><br/>He was no longer ignored like a stray cat or dog, placing him in a major force, he could act as an elite disciple.<br/><br/>“The simulation has ended, you can retain one of the following items.”<br/><br/>“One, martial arts realm at the age of twenty-seven.”<br/><br/>“Two, martial arts experience at the age of twenty-seven.”<br/><br/>“Three, life wisdom at the age of twenty-seven.”<br/><br/>No need to think, just choose the second.”<br/><br/>The next moment, a vast amount of knowledge flooded into Gu Yang’s mind. The deepest part was “Duan Yue Knife Technique”, which was decisive and paired with his Pure Yang Qi, the power was unparalleled.<br/><br/>It took him nearly an hour to digest this knowledge and experience, turning it into his strength.<br/><br/>At this point, he had the strength of a Fifth Rank martial artist from inside out. PS: It’s the weekend, begging for ticket endorsements and monthly tickets..\t\t\t\t\t\t</div>", "images": {}, "success": true}