{"id": 22, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14254615.html", "title": "Chapter 22 - Chapter 22: 022 Bearing Insults And Heavy Loads", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 22 - Chapter 22: 022 Bearing Insults And Heavy Loads</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 22: 022 Bearing Insults and Heavy Loads<br/><br/>Translator: 549690339<br/><br/>Once they left Lian Mountain, Tianshui City was their next stop.<br/><br/>At noon, four people arrived outside Tianshui City, two men and two women. These were Gu Yang and his companions. Su Qingzhen and Zhi Xing were both extremely beautiful; to avoid attracting attention, they wore veils over their faces.<br/><br/>“Tianshui City!”<br/><br/>Looking at the three characters mounted above the city gate, Gu Yang had deep impressions of this city.<br/><br/>Once, in a game called Simulated Life, he had carved out a living here and became the richest man in the city…<br/><br/>Zhang Xiao Hai, who was standing at the side, asked, “Master, have you been here before?”<br/><br/>Gu Yang shook his head and said, “Let’s go.”<br/><br/>Entering the city, they were not examined too strictly; just a glance made it clear that they were not people to be trifled with.<br/><br/>The foursome headed to the largest inn in the city and ordered two rooms, one for Zhang Xiao Hai and the other for Gu Yang, Su Qingzhen, and Zhi Xing.<br/><br/>As Su Qingzhen was a maidservant, naturally, she had to share a room with her master.<br/><br/>And since Zhi Xing was Su Qingzhen’s maidservant, of course, she would stay with her mistress.<br/><br/>Gu Yang had arranged it intentionally that way, curious to see how long this young lady could put up with.<br/><br/>For the past ten days, the four of them had been camping in the mountains, it was about time they relaxed properly in a city environment.<br/><br/>Gu Yang sent Zhang Xiao Hai out to procure some daily necessities. When he returned to his room, he found Su Qingzhen organizing the bedding.<br/><br/>Zhi Xing muttered in a low voice, “Miss, let me do it—” Seeing him enter, she immediately held her tongue, turned her back, and refused to talk to him.<br/><br/>Ever since she found out that he wanted Su Qingzhen to be his servant, she had been angry and refused to interact with him for the entire journey. Sure had a temper.<br/><br/>Gu Yang went up to Su Qingzhen, noticing that she hung her head low, seeming resigned to her fate.<br/><br/>She had been so patient until now, not even protesting when he announced that she would have to share a room with him.<br/><br/>It did surprise him a bit.<br/><br/>Gu Yang extended his hand, took the jade hairpin from her head, and said, “I need to borrow this. Stay here and don’t wander off.”<br/><br/>With that, he turned around and left.<br/><br/>“Hey<br/><br/>Just when Zhi Xing was about to protest, Su Qingzhen pulled her back. In a hurry, she protested, “Miss, that hairpin is a keepsake from your mother…”<br/><br/>Su Qingzhen shook her head, “It’s just an object. It’s not important.”<br/><br/>“Miss, I’ll beg Brother Gu, I’ll be his maid instead. I can’t see you being mistreated.” Zhi Xing couldn’t bear to see her mistress humiliated.<br/><br/>Su Qingzhen said, “I have to survive, learn martial arts, and avenge my parents personally. At present, only he can help me, and I must bear the burden of shame.”<br/><br/>“Miss—<br/><br/>Zhi Xing’s eyes welled up with tears, feeling that her mistress had drastically changed. Previously, when she was abducted by bandits, she would rather die than submit.<br/><br/>Yet now, under Brother Gu’s mistreatment, she could endure it.<br/><br/>Miss used to be so proud; now she was reduced to being a servant for others.<br/><br/>Brother Gu was really too much.<br/><br/>Upon leaving the inn, Gu Yang asked some locals and found his way to a pawnshop.<br/><br/>He took out the jade hairpin and asked, “How much can I get for it?”<br/><br/>Inside the pawnshop was an old shopkeeper who glanced at the hairpin. Spotting that the owner was a hunter from out of town, he thought of swindling him, “This jade hairpin can fetch two taels of silver.”<br/><br/>“That’s too little. Nevermind.”<br/><br/>Upon hearing this, Gu Yang reached out and tried to take back the hairpin.<br/><br/>“Wait.”<br/><br/>The old shopkeeper grabbed his hand and smiled, “Young man, shall we talk more inside?”<br/><br/>Gu Yang also smiled, revealing his white teeth, and said, “Sure, why not?”<br/><br/>Once inside, the old shopkeeper ordered tea and asked, “May I ask, where did you get this hairpin?”<br/><br/>“It’s none of your business. Just tell me, how much is it worth?”<br/><br/>The old shopkeeper laughed, “Interestingly, our pawnshop has lost a few things a few days ago, one of which is this hairpin. If you were the thief, you wouldn’t be so stupid to pawn it at the same shop you stole it from. So, I’ll assume you picked it up somewhere. Here, take these two taels of silver, and we’ll take back the hairpin.”<br/><br/>He made it sound so real.<br/><br/>Gu Yang didn’t expect that they would fall into the trap so easily. He had prepared various tactics, but none was needed after all.<br/><br/>Apparently, they were so used to swindling outsiders that they had become quite skilled at it.<br/><br/>Gu Yang retorted, “Nonsense! This was part of my wife’s dowry. How can it possibly belong to your pawnshop? Give it back to me.”<br/><br/>The old shopkeeper’s face darkened and he barked, “You don’t know what’s good for you.”<br/><br/>Instantly, two burly men, clutching cudgels, appeared at the door.<br/><br/>“Seize him and take him to the local officials, accusing him of stealing an invaluable jade hairpin from our shop.”<br/><br/>“Yes, sir.”<br/><br/>The two strong men advanced aggressively, ready to capture Gu Yang. Looking at them, Gu Yang chuckled, “You guys really have a nerve.”<br/><br/>“Ouch!”<br/><br/>Before they knew it, he kicked them to the ground, rendering them unable to stand again.<br/><br/>The old shopkeeper was shocked.<br/><br/>Clang!<br/><br/>A knife was placed to his throat. The tea cup in his hand trembled and crashed to the floor.<br/><br/>A playful voice sounded next to his ear, “How should we settle this?”<br/><br/>The old shopkeeper could barely keep his cool; he knew he had messed with the wrong man.<br/><br/>He stuttered, “Mercy, good sir, let’s talk it over.”<br/><br/>“Good, that’s what you said, we should talk.”<br/><br/>Gu Yang stabbed the knife into the table and said, “Send someone to notify your boss. If he doesn’t come here within half an hour, I’ll pay him a visit.”<br/><br/>“Yes… yes…” The old shopkeeper didn’t dare disagree, and immediately sent someone to inform his boss.<br/><br/>Fifteen minutes later, Gu Yang was leisurely drinking tea with his legs crossed.<br/><br/>He borrowed the jade hairpin from Su Qingzhen with the intention to set a trap for the immoral merchants in the city.<br/><br/>He had no choice, he was penniless. Outright theft seemed inappropriate, so he thought of this plan to trick the unscrupulous businessmen.<br/><br/>And it turned out to be surprisingly successful.<br/><br/>“Who’s the thieving brat that dares to cause trouble in Tianshui City?”<br/><br/>Suddenly, a harsh voice rang out. A figure leapt in from outside, wielding a knife towards him.<br/><br/>The attacker was a Ninth Rank martial artist.<br/><br/>With a casual wave of his hand, Gu Yang swatted away the attacker.<br/><br/>The attacker felt an overpowering force hit him, sending him crashing against the wall. He felt weak all over, and his knife slipped from his grip and clattered to the ground.<br/><br/>“Miss!” the old shopkeeper cried out in alarm.<br/><br/>Gu Yang turned to look at the young woman, who appeared to be seventeen or eighteen, she was quite attractive.<br/><br/>“She must be the wife I married in that game of Simulated Life, right?”<br/><br/>The thought struck him as strange.<br/><br/>Yes, the owner of this pawnshop was the same man who had poisoned him in the Simulated Life game, who happened to be his father-in-law.<br/><br/>Even though all those events only happened in the game, he was a man who held grudges, and he had to settle this score.<br/><br/>“Jade!”<br/><br/>Just then, a rugged voice resounded, and a middle-aged man burst through the door.<br/><br/>The master had finally arrived..\t\t\t\t\t\t</div>", "images": {}, "success": true}