{"id": 24, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14254617.html", "title": "Chapter 24 - Chapter 24: 024 Top-Notch Aristocracy", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 24 - Chapter 24: 024 Top-Notch Aristocracy</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 24: 024 Top-notch Aristocracy<br/><br/>Translator: 549690339<br/><br/>An hour later, a few people carried in two large boxes.<br/><br/>Dong Xuan, drenched in sweat, said, “The time was too tight. I couldn’t gather enough cash. Here are eight thousand taels, and banknotes for four thousand taels. This is all my savings…”<br/><br/>“Fine. ”<br/><br/>Gu Yang did not make things difficult for him. He took the banknotes, hoisted the two large boxes, and left.<br/><br/>Tianshui City is a small city where all the ways to make money are monopolized by various forces. Dong Xuan is a martial artist with significant expenses, and this amount of money was enough to cripple him financially. He would have to sell many things to come up with it.<br/><br/>Having forked out such a large sum, he felt as if he had vented some grievance and his will to kill has diminished.<br/><br/>After all, Dong Xuan’s daughter and he were once husband and wife in Simulated Life. There was a bond between them.<br/><br/>The strike he delivered just now should have left a shadow in Dong Xuan’s mind. From now on, his martial arts would be cut off, and it would be difficult for him to progress further.<br/><br/>He had virtually killed the Dong Xuan’s martial arts life. That was punishment enough.<br/><br/>Gu Yang carried the two large wooden boxes through the city, catching everyone’s eye. However, no one dared to approach him, everyone kept their distance.<br/><br/>Anyone who could carry two such large boxes must be a martial artist; ordinary people naturally kept their distance.<br/><br/>After returning to the inn and going upstairs, he opened the system unnoticed and chose to recharge when no one was around.<br/><br/>[Recharge successful, current balance is 8217-4.]<br/><br/>Gu Yang felt a sense of security at seeing this balance. More than eight thousand taels were enough for eight simulations. With good luck, he may even be able to break through to Fifth Grade.<br/><br/>At that time, he would be confident in dealing with the assassins sent by the Liu family.<br/><br/>He returned to his room, shoved the two empty boxes into a corner, and sat by<br/><br/>the bed. Before he could say anything, Su Qingzhen came over with a basin of hot water, and handed him a washed towel.<br/><br/>Did she switch roles that fast?<br/><br/>Gu Yang was somewhat surprised and couldn’t help but marvel at the remarkable adaptability of humans.<br/><br/>Yesterday, she was still carrying the air of a lady. However, now she was serving him water willingly.<br/><br/>He took out the jade hairpin and put it back on her head, saying, “Returning it to its owner.”<br/><br/>Both Su Qingzhen and the other lady were curious how he had brought back two boxes but didn’t ask.<br/><br/>After Gu Yang washed his face, he said, “l will train for a while.”<br/><br/>Both Su Qingzhen exited the room afterwards.<br/><br/>[Would you like to use the Life Simulator? One use will consume 1000 points of money.]<br/><br/>“Yes.<br/><br/>[At the age of twenty-two, you have become a sixth- grade martial artist. After leaving Liu Family Village, you saved Su Qingzhen in Wangjiagou, and the next day, you killed all the people from the Liu family who pursued you.]<br/><br/>[Ten days later, you arrived in Tianshui City. You planned and extorted Dong Xuan, earning 12,000 taels.]<br/><br/>[Your act of defeating Dong Xuan with a single strike was witnessed by a member of the Lin family, Lin Zirui. He came to the inn that night, trying to woo you into joining the Lin family, which you refused.]<br/><br/>[Five days later, you encountered a swordsman on the road who challenged you. After three moves, you were killed on the spot, and he walked away. Died at the age of 22.]<br/><br/>Gu Yang was stunned after reading this.<br/><br/>This time, he died even faster than in the last simulation.<br/><br/>From where did this swordsman pop out?<br/><br/>He thought that after reaching the sixth grade, he would have some self-protection power. However, he still got randomly killed.<br/><br/>Last time, it was the people sent by the Liu family.<br/><br/>This time’s swordsman, who sent him?<br/><br/>“Could it be that Lin Zirui?”<br/><br/>Gu Yangs only variable in this simulation was that Lin Zirui from the Lin family wanted to recruit him, but he refused.<br/><br/>The Lin family was a prominent family in Jiangzhou that he had come across in many simulations.<br/><br/>“Damn, each member of these noble families is toxic. If you refuse their recruitment, they will resort to murder?”<br/><br/>He was shivering with annoyance. This world was too hostile to grassroot martial artists like him. If you don’t serve the noble families, they will try to kill you…<br/><br/>Wait, somethings not right. He didn’t encounter such a situation in many previous simulations.<br/><br/>Upon further thought, Gu Yang realized he had refused recruitment offers before but wasn’t killed.<br/><br/>“So, it means that Lin Zirui is particularly narrow-minded.”<br/><br/>He carefully recalled the scene at the pawnshop where he defeated Dong Xuan with a single strike. There were indeed two people at the door, an old and a young, both possessing grace and grandeur.<br/><br/>The younger one was probably Lin Zirui.<br/><br/>However, those two left swiftly back then and he didn’t really pay attention to them.<br/><br/>[The simulation is over. You may keep one of the following items:]<br/><br/>[1. Martial arts realm at the age of twenty-two] [2. Martial arts experience at the age of twenty-two]<br/><br/>[3. Life wisdom at the age of twenty-two”]<br/><br/>After thinking for a while, Gu Yang chose the third option this time.<br/><br/>Soon, an additional memory appeared in his mind, precisely the scene when Lin Zirui came to recruit him and when he was killed by the swordsman.<br/><br/>“Seems normal logically.”<br/><br/>From the memory, Lin Zirui carried himself with the grace of a noble house.<br/><br/>When rejected, he did not get angry but appeared somewhat regretful and left.<br/><br/>No one could have perceived his hidden intention to kill.<br/><br/>“Stay away from these noble families, as you never know when you might encounter a lunatic.’<br/><br/>This was the realization he had when he neared death in this simulated life.<br/><br/>The world was truly dangerous.<br/><br/>Gu Yang sighed again. Even with his sixth-grade power, he could still bring about deadly danger over a small matter.<br/><br/>He was still too weak.<br/><br/>A great sense of crisis loomed in his heart. He had to increase his strength quickly.<br/><br/>However, Gu Yang didn’t rush into the second simulation. Each simulation was precious and could not be wasted casually.<br/><br/>“Qingzhen.’!<br/><br/>He called Su Qingzhen and asked, “Do you know the Lin family?”<br/><br/>Surprised, Su Qingzhen asked, “Which Lin family?”<br/><br/>“Besides that Lin family, which other Lin family is there?”<br/><br/>Although Su Qingzhen did not understand why he was suddenly asking this, she still explained, “The Lin family is one of the top families in Jiangzhou, a branch of one of the ten families of the world, the Lin family. The family head is a First Rank fighter, ranking fifteenth in the First Rank list…”<br/><br/>She divulged everything she knew about the Lin family.<br/><br/>The Lin family was Jiangzhou’s top-tier family that countless people were in awe of. Studying personnel from Jiang family was a compulsory course for all forces in Jiangzhou.<br/><br/>Gu Yang listened very carefully and finally heard about Lin Zirui. He was a direct descendant of the Lin family, grandson of the current family head and had been an outstanding talent since childhood. He was personally taught by the family head.<br/><br/>This meant Lin Zirui was bound to be one of the core members of the Lin family in the future.<br/><br/>As for his specific cultivation level, Su Qingzhen did not know.<br/><br/>After hearing this, Gu Yang felt extremely troubled.<br/><br/>The Lin family was undoubtedly a behemoth, several notches stronger than the Liu family. They had at least two First Rank masters and several Second Grade ones.<br/><br/>They were top-tier families that dominated a state. However, how should he deal with Lin Zirui?\t\t\t\t\t\t</div>", "images": {}, "success": true}