{"id": 25, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14254618.html", "title": "Chapter 25 - Chapter 25: 025 Now It’S Your Turn", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 25 - Chapter 25: 025 Now It’S Your Turn</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 25: 025 Now it’s your turn<br/><br/>Translator: 549690339<br/><br/>“That’s enough, you may leave now.”<br/><br/>After getting a clear idea of the overall situation of the Su family, Gu Yang had a plan in mind and dismissed Su Qingzhen.<br/><br/>However, Su Qingzhen stood still, looking up at him. There was a sharper edge in her gaze as she said, “I’ve done what you asked me to do, now it’s your turn. ”<br/><br/>Gu Yang was momentarily taken aback before he laughed in response,<br/><br/>“Alright, take a seat on the bed.”<br/><br/>At this moment, Su Qingzhen seemed to revert back to the young lady of nobility she once was.<br/><br/>Without any hesitation, she took off her shoes and climbed onto the bed, sitting cross-legged across from him.<br/><br/>“Extend your hand.”<br/><br/>Following his instruction, Su Qingzhen extended her hand for him to hold.<br/><br/>The next moment, she felt a warm current flowing into her body which instantly dissolved the chilling energy that was clogging her meridians. The warm sensation felt as though it was melting her from within.<br/><br/>“He really is Third Rank!”<br/><br/>Su Qingzhen was shocked, validating the speculation she had in mind.<br/><br/>Since childhood, cold energy trapped in her meridians had made it impossible for her to enter the world of martial arts.<br/><br/>Her father had once invited a renowned physician for her, who stated that only a martial artist of Third Rank or above could forcibly disperse the cold energy in her meridians with their True Essence.<br/><br/>It was almost a proclamation that she’d never have a chance at martial arts in her life,<br/><br/>The Su family had already fallen, where could they possibly find a Third Rank martial artist?<br/><br/>From then on, Su Qingzhen gave up on the idea of practicing martial arts.<br/><br/>It wasn’t until ten days ago when she suddenly refined her first strand of True Qi, that she discovered the cold energy in her meridians had mysteriously disappeared.<br/><br/>Among those in her acquaintance, the only one who could possibly help her disperse this cold energy was Gu Yang.<br/><br/>She had suspected then that he was a Third Rank martial artist.<br/><br/>This was why Su Qingzhen, after a night of contemplation, had undergone a significant change in her attitude.<br/><br/>If Gu Yang was a Third Rank powerhouse, she might have a chance at revenge.<br/><br/>A Third Rank of such a young age, even if he weren’t as powerful as Liu Zhe, wouldn’t be too far off. His background must be extraordinary.<br/><br/>All one could say was, the Su family truly had fallen. The renowned physician they invited simply wasn’t of a high enough level. He didn’t know that she possessed an extremely rare body type known as Ice Physique and Jade Bones, and that there was more than one way to resolve her issue.<br/><br/>While Gu Yang was transferring his Pure Yang energy, he felt a cold sensation flow back, causing his blazing True Qi to become slightly more balanced.<br/><br/>As expected, the Yin Qi inside her body could make his Pure Yang Qi even more refined, greatly beneficial to his cultivation.<br/><br/>Admittedly, he had utilized some of his cunning so that she would cooperate obediently.<br/><br/>Of course, this whole process also brought significant benefits to her as well.<br/><br/>After circulating his energy throughout his body several times, Gu Yang ceased his cultivation, saying, “We’ll stop here for today.”<br/><br/>Upon opening her eyes, Su Qingzhen’s gaze shone with excitement. After descending from the bed, she bowed to him in gratitude. Once she stepped out of the room, she started her personal cultivation.<br/><br/>Soon after, she once again experienced the sensation of Qi, and quickly refined her first strand of True Qi.<br/><br/>The joy of regaining what she had lost moved her to tears.<br/><br/>She had paid a great price for the chance to practice martial arts.<br/><br/>In the inner room, Gu Yang began a new round of simulation.<br/><br/>“At the age of twenty-two, you had already become a sixth-grade martial artist. After leaving Liu Village, you saved Su Qingzhen at Wangs Ditch. The next day, people from the Liu family came pursuing you. You slaughtered them all.’<br/><br/>“Ten days later, you arrived in Tianshui City. You schemed to blackmail Dong Xuan, gaining twelve thousand taels.”<br/><br/>“On the night of the same day, Lin Zirui from the Lin family came to the inn wanting to pull you into his family. You agreed, but made a request to send someone to Ping prefecture. He agreed.”<br/><br/>“Leveraging the relationship with the Lin family, you sent Su Qingzhen to Ping prefecture a month later. She stayed true to her promise, took you to the bank, and exchanged a money order of thirty thousand taels.”<br/><br/>“During this month, you took advantage of the Yin energy within Su Qingzhen to transform your Pure Yang Qi into Pure Yang Essence, improving your abilities. After going to the Lin family, you received even more attention from Lin Zirui. Frequently exchanging viewpoints with you led to your exposure to many sophisticated saber techniques.”<br/><br/>“One year later, Lin Zirui advanced to Fifth Grade, surpassing you with his strength. He lost interest in you.”<br/><br/>“Three years later, you still couldn’t break through to Fifth Grade, and the Lin family had run out of patience with you. They sent you to be a steward in<br/><br/>Xiang County.”<br/><br/>“At the age of twenty-seven, Su Qingzhen, who hadn’t been heard from for years, showed up uninvited on your wedding day, openly injuring you and taking you away. She took you to a secluded forest outside the city where she forced you to serve as her attendant to wash away the humiliation of being made your maid.”<br/><br/>“As you were no match for her, you could only pretend to comply.”<br/><br/>“Su Qingzhen took you out of Xiang County, and half a month later, you encountered assassins on your journey. It was only then that you knew that the Liu family had revealed the truth about Liu Nuo’s death five years ago and had sent people to kill you.”<br/><br/>“You and Su Qingzhen fought back along the way, both of you getting seriously injured in the process.”<br/><br/>“Eventually, you escaped deep into the Lian Mountains and went to Wangs Ditch. You were caught up by the experts from the Liu family and, suddenly, a monster appeared, killing all of you.”<br/><br/>“You died while being only twenty-seven.”<br/><br/>Gu Yang felt somewhat melancholy as he went through this simulation.<br/><br/>In the simulated life, despite all kinds of compromises, he only managed to live for another five years, dying prematurely at the age of twenty-seven.<br/><br/>Having escaped the assassins from the Lin family, he then had those from the Liu family to deal with. It was simply too hard.<br/><br/>And that Su Qingzhen, holding onto her grudges so tightly that even after five years, not only did she disrupt his wedding, but she also forced him to be her attendant as a way of avenging the past.<br/><br/>Fortunately, he had a simulator.<br/><br/>Otherwise, it would be too stifling to live in this world.<br/><br/>“Simulated Life has concluded. You can only choose one of the following to keep.”<br/><br/>“One, your state of Martial Arts Realm at the age of twenty-seven.” “Two, your experience in martial arts at the age of twenty-seven.” “Three, your wisdom gained by the age of twenty-seven.”<br/><br/>This time, he chose the first option without a second thought.<br/><br/>After Gu Yang made his choice, the True Qi inside his body underwent a subtle transformation. The wild and fire-like Pure Yang Qi became much more balanced.<br/><br/>But, he could feel that its power was not diminished. Instead, it felt stronger and more enduring.<br/><br/>His Pure Yang Qi had been converted into Pure Yang Essence.<br/><br/>The total amount of Qi had also increased by nearly fifty percent.<br/><br/>It took five years to achieve just this small increase while Lin Zirui, on the other hand, was able to break through to the Fifth Grade in just one year.<br/><br/>And Su Qingzhen, from an ordinary person to surpassing his strength – all achieved in just five years.<br/><br/>Such talent is truly something to be envied.<br/><br/>Gu Yang studied this simulation carefully; although it was only a short introduction, he was able to infer several things.<br/><br/>For instance, Lin Zirui initially recruited him because of his outstanding talent. When he had refused, Lin had even contemplated killing him.<br/><br/>When he found out that his talent was ordinary, he dismissed him like worn-out shoes.<br/><br/>This was understandable since Gu Yangs current strength was essentially “cheated” – it wasn’t naturally acquired.<br/><br/>In the eyes of others, someone his age with such strength would certainly be regarded as a genius.<br/><br/>Also, Su Qingzhen, neither earlier nor later, had chosen to intervene just a few days before the Liu family’s assassins were due to arrive. She most likely had received information beforehand and had come specifically to save him.<br/><br/>Su Qingzhen still had some conscience left in her.<br/><br/>However, her behavior was still as arrogantly affectionate as ever..\t\t\t\t\t\t</div>", "images": {}, "success": true}