{"id": 21, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14254614.html", "title": "Chapter 21 - Chapter 21: 021, Have You Thought It Through?", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 21 - Chapter 21: 021, Have You Thought It Through?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 21: 021, have you thought it through?<br/><br/>Translator: 549690339<br/><br/>Gu Yang said with indifference, “Don’t you understand? In this world, nothing is a given. Whatever you want, you must be willing to pay the cost.”<br/><br/>Upon hearing his words, Su Qingzhen shivered, her face turned paler than ever.<br/><br/>Biting her lip tightly, she straightened up, vigorously wiped away her tears, and sneered bitterly, “So you’re no different from those bandits…”<br/><br/>“Haha!”<br/><br/>A light chuckle escaped from Gu Yang, “Although you are moderately pleasing to the eye, your self-righteousness and sense of entitlement, assuming that the world owes you, is nauseating. I don’t find you appealing.”<br/><br/>Never had Su Qingzhen thought he would speak like this. She felt a buzzing in her head, her gaze empty, her soul almost flew away from her, struggling to stand in her stupor.<br/><br/>Zhi Xing, who was standing nearby, quickly supported her. The sight of two people arguing made her extremely anxious and scared, and she almost broke down into tears.<br/><br/>On one side was her mistress,<br/><br/>And on other, Brother Gu whom she owed her life to and who had been very kind to her.<br/><br/>She had no idea what to do in this situation.<br/><br/>Gu Yang closed his eyes having finished his sentence.<br/><br/>In a corner of the ruins, Zhang Xiao Hai continued to practice without getting affected by the altercation.<br/><br/>Suddenly, a loud crackle broke the silence of the temple from the firepit.<br/><br/>The junior maid, seeing Gu Yang no longer speaking, heaved a sigh of relief, and helped her mistress Su Qingzhen to sit down. Seeing her bury her face on her knees in silence brought worry to her heart.<br/><br/>The night, then, quietly passed in such silence.<br/><br/>The light of dawn had barely risen when Zhang Xiao Hai woke up, intending to practice. However, he saw Su Qingzhen abruptly stand up and walk towards Gu<br/><br/>Yang.<br/><br/>“What is she trying to do?”<br/><br/>Curiosity arose in his heart.<br/><br/>When he first saw Miss Su’s real face, he was stunned. He never imagined there could be a woman of such beauty in the world, as if a fairy had descended from the heavens.<br/><br/>His limited imagination could only use the word ‘fairy’ to describe it.<br/><br/>He believed that this earthly fairy is his future martial aunt and he was respectful towards her. However, all along the way, she had never looked at him squarely.<br/><br/>It was not surprising, for these past few days she had given Gu Yang the same cold shoulder.<br/><br/>Zhang Xiao Hai was musing when he saw Su Qingzhen kneel down in front of<br/><br/>Gu Yang.<br/><br/>Was he seeing it wrong?<br/><br/>After rubbing his eyes for a clear view and confirming she was indeed kneeling, he was taken aback.<br/><br/>Hanging out with them these days, he figured out that this fairy-like young lady probably came from an affluent family. He had seen plenty with that kind of superior and condescending attitude.<br/><br/>Now, this lofty maiden, was kneeling before Gu Yang.<br/><br/>Had he not seen it with his own eyes, Zhang Xiao Hai wouldn’t have believed it. Subsequently, Gu Yang’s voice rang out, “What do you think you’re doing?”<br/><br/>“I want to learn martial arts!”<br/><br/>Although Su Qingzhen spoke softly, her tone held an unusual determination, “I know that you can help me. As long as I can become a martial artist, no matter what the conditions, I will… agree to them.”<br/><br/>Oh, it’s about martial arts!<br/><br/>Zhang Xiao Hai finally understood. Kneeling to beg for discipleship was not disgraceful. But having taken this many days to make up her mind, she really had lagged.<br/><br/>Wasting so much time.<br/><br/>Gu Yang asked her, “Are you sure?”<br/><br/>“I am!”<br/><br/>“All right. I can help you, on one condition—you have to be my servant.”<br/><br/>His servant?<br/><br/>Zhang Xiao Hai was taken aback on hearing Gu Yang’s condition.<br/><br/>He inevitably thought that Gu Yang would demand her body. He didn’t expect he would ask her only to be his servant.<br/><br/>Did Master not intend to grant her any status?<br/><br/>Zhang Xiao Hai took a cold breath when he thought of this.<br/><br/>Su Qingzhen lifted her head high and exclaimed, “What?”<br/><br/>“You heard me right, I want you to be my servant.” Gu Yang repeated, “Though Zhi Xing serves you, you’ll have to serve me similarly. Can you do that?”<br/><br/>Su Qingzhen stared at the man in front of her. Her chest was filled with humiliation, grievance, anger, and sadness.<br/><br/>She had already conceded to this extent, constantly lowering her bottom line. Yet, he continued to insult her.<br/><br/>Why does he treat me like this?<br/><br/>She gnashed her teeth, wanting to pounce on him and perish together.<br/><br/>“From now on, when I’m seated, you have to stand. When I’m eating, you have to serve me food. When I’m hot, you must wave the fan and when I’m cold, you have to help me dress…”<br/><br/>Gu Yang’s instructions kept pouring in.<br/><br/>“In exchange, I’ll help you deal with the Hidden Dangers inside your body, and teach you martial arts, without anything left out…”<br/><br/>Rest assured, during this period, I won’t touch you. Like I said, I’m not interested in you.” “Think it over, and when you’ve made up your mind, give me your answer.”<br/><br/>“No need to think.”<br/><br/>In her stupefaction, Su Qingzhen heard her voice, devoid of any fluctuations. “I agree.”<br/><br/>Seeing Su Qingzhen actually agreeing without hesitation, Gu Yang was taken aback.<br/><br/>To be honest, the condition he had proposed was just to make things difficult for her. He was waiting for Zhi Xing to plead for her, and then he could take the opportunity to change it to another condition.<br/><br/>Like asking several thousand taels as tuition, even if she couldn’t afford to pay now, she could write down an IOU.<br/><br/>This is called demanding a high price initially and then settling for less.<br/><br/>But little did he imagine, she actually agreed without bargaining.<br/><br/>Thus, Gu Yang was left bewildered.<br/><br/>For a moment, he didn’t know how to respond.<br/><br/>Zhang Xiao Hai, from the side, saw that Su Qingzhen had agreed and he was floored with admiration.<br/><br/>Only Brother Gu could be this mighty. He had tamed this majestic fairy-like maiden with just a few encounters, to the point where she agreed to being even a servant.<br/><br/>But, he just couldn’t figure out how Su Qingzhen, who was cold as ice yesterday, changed so much overnight. What kind of magic did his Master put on her?<br/><br/>“If only I could learn this skill from my Master,”<br/><br/>The possibility left a ray of hope in Zhang Xiao Hail s heart.<br/><br/>After a while, Gu Yang finally spoke up. They couldn’t keep this awkward silence forever, and said, “You can stand up now.”<br/><br/>As he said, Su Qingzhen stood up, still lowering her head.<br/><br/>Gu Yang saw her modest demeanour and knew that his words from the previous night must have been a big blow. Otherwise, she wouldn’t have changed so much overnight.<br/><br/>He felt a tinge of remorse. Perhaps, his words last night were a bit too harsh.<br/><br/>He said, “I want to wash and freshen up.”<br/><br/>Su Qingzhen turned and walked away. After a while, she returned with a basin of water, wringing a towel before handing it to him.<br/><br/>Seeing her expressionless face, Gu Yang taped, “Your reluctant demeanour is not befitting that of a serving maid.”<br/><br/>Su Qingzhen held the towel even tighter, dropping her head even lower. Sounding somewhat choked up, she replied, “I…l’m sorry.”<br/><br/>She isn’t getting angry at this?<br/><br/>Gu Yang started to feel a headache. What would he do with a maid like her? It was clear that this young lady was never going to be subservient..\t\t\t\t\t\t</div>", "images": {}, "success": true}