{"id": 23, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14254616.html", "title": "Chapter 23 - Chapter 23: 023 Instructions", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 23 - Chapter 23: 023 Instructions</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 23: 023 Instructions<br/><br/>Translator: 549690339<br/><br/>“Dong Xuan, a renowned swordsman in Tianshui City, arrived here over a decade ago. His origins are unknown, yet judging by his martial arts style, he likely hails from the Wu Family of Qingzhou.”<br/><br/>Outside the Dong residence, an old man and a young boy were discussing Dong Xuan.<br/><br/>Upon hearing this, the boy seemed surprised, “Eighteen years ago, that Wu<br/><br/>Family, one of the ten leading clans that were annihilated?”<br/><br/>The older man responded, “The Wu Family’s Sword Tomb was once a sacred place for swordsmanship. Even learning a little from it like Dong Xuan did could be beneficial for your Saber Technique. During your journey, besides observing the noble families’ martial arts, you should critically observe the ordinary martial artist’s skills. Only then can you learn from various sources.”<br/><br/>The boy suddenly understood, “No wonder the senior brought me here to Tianshui City.”<br/><br/>At that moment, the steward of the Dong Residence stepped out and said, “Apologies, gentlemen, but the master just left. There’s a disturbance at the pawnshop, and he has gone to deal with it.”<br/><br/>Having found out where the pawnshop is, the older man took leave.<br/><br/>The old and the young, moving swiftly, arrived at the main street. They saw a figure rushing ahead, displaying a formidable speed. He must be at the sixth-grade cultivation level.<br/><br/>It must be Dong Xuan, without a doubt.<br/><br/>The purpose of their visit was to observe Dong Xuan’s Saber Technique, so they followed him.<br/><br/>Soon, they arrived at the pawnshop.<br/><br/>Dong Xuan, looking rather anxious, rushed in immediately.<br/><br/>The old man and the boy stopped at the entrance.<br/><br/>“Jade!”<br/><br/>Seeing his daughter injured, Dong Xuan’s heart was filled with worry and anger, “Are you alright?”<br/><br/>The young girl, feeling weak and suffering from pain, nodded and said, “Father, I’m fine.<br/><br/>A rage simmered in Dong Xuan as he saw his daughter in pain. He glared at the young hunter and said, “You hurt my daughter gravely. If you don’t provide a satisfactory explanation today, you won’t be leaving this place.”<br/><br/>Over the years, he had always been kind to others, extending courtesy to fellow martial artists and hardly ever showing hostility. He was truly a man of great virtue.<br/><br/>However, his daughter was his weakness.<br/><br/>Despite having a few concubines over the years, he only had one daughter, whom he had cherished since her infancy.<br/><br/>Seeing his beloved daughter hurt, his heart filled with murderous intent.<br/><br/>Gu Yang sneered and grabbed a chopper from the table, saying indifferently, “This is my explanation!”<br/><br/>In the blink of an eye, he dashed to Dong Xuan and launched a direct attack.<br/><br/>Sixth grade?<br/><br/>Dong Xuan was shocked. He had never expected this seemingly ordinary hunter to be a sixth-grade martial artist.<br/><br/>He initially thought that the young man was at most at the Eighth or Ninth Grade in cultivation level.<br/><br/>His judgement was based on the man’s age.<br/><br/>Who could have imagined that such a young sixth-grade martial artist would appear in Tianshui City?<br/><br/>At this moment, Dong Xuan drew his sword impulsively without giving it a second thought.<br/><br/>Then in the next instant, his pupils dilated, and cold sweat trickled down his forehead.<br/><br/>This attack was unpredictable. He couldn’t even track the trajectory of the blade, let alone understand how to fend it off.<br/><br/>He’s done for!<br/><br/>He can’t block this attack!<br/><br/>No matter from which angle he tries to block, he won’t be able to stop this attack.<br/><br/>Dong Xuan, who had steeped himself in the Saber Technique for decades, hesitated at this moment, losing his will to fight.<br/><br/>To onlookers, he simply stood there, allowing the blade to descend upon his head.<br/><br/>Just when Dong Xuan thought he was about to die, the blade halted just a centimeter from his nose.<br/><br/>The sudden transition from extreme motion to extreme tranquility demonstrated impeccable control.<br/><br/>“Are you satisfied with my explanation now?”<br/><br/>Only after hearing these words did Dong Xuan jolt back to reality. His treasured sword clattered to the ground, and he collapsed in a heap.<br/><br/>In a hoarse voice, he said, “I have committed an offense against you, sir, and I deserve to die. I thank you for sparing my life… and for showing mercy to my daughter…”<br/><br/>“That’s impressive.”<br/><br/>The boy standing outside the door, who had been watching the fight the entire time, was awestruck. He asked excitedly, “What Saber Technique is this?”<br/><br/>The old man was also surprised, admiringly saying, “His attack was elusive, like a hanging antelope horn. He clearly has a talent for the Saber Technique. In this little city of Tianshui, such a character exists. If he survives, he might have a place in the Hidden Dragon List within a decade.”<br/><br/>The boy hadn’t expected such high praise from the old man.<br/><br/>The Hidden Dragon List only includes those martial artists under 30 years old, with only twenty places available. Those who make it to the list are the most outstanding young talents in the world.<br/><br/>The boy felt a bit unconvinced and responded, “Just based on that? His cultivation level is only at sixth grade. That’s a long way off from third rank.”<br/><br/>Making it onto the Hidden Dragon List without achieving third rank was unthinkable.<br/><br/>The old man gently stroked his beard, “Considering his age, this level of Saber Technique mastery marks him as a prodigy. You, currently, are not his match.<br/><br/>With such a talent, as long as his cultivation level matches, entering the<br/><br/>Hidden Dragon List will be no problem.”<br/><br/>The boy understood the old man’s discerning eye, but within him, he still felt a pinch of disrespect. He changed the topic and asked, “Senior, can you figure out his origins?”<br/><br/>After a moment’s deliberation, the old man responded, “Judging from his Saber Technique, it appears to have evolved from military swordplay. However, its foundation is definitely from the Wu Family’s school. He has managed to incorporate both, forging a unique path for himself.”<br/><br/>The boy questioned further, “Could it be that he’s a descendant of the Wu family?”<br/><br/>“Not necessarily. The Wu Family’s martial techniques were scattered into the martial arts world after their annihilation. There were not just a few who obtained the Wu Family’s Saber Technique.”<br/><br/>Gu Yang remained oblivious to the fact that the old man and the boy outside the door were discussing his background. Even though he saw the two figures at the entrance, he was unable to hear their voices.<br/><br/>At the moment, his focus was solely on Dong Xuan.<br/><br/>Dong Xuan’s reaction vividly embodied the essence of this world: the powerful command respect.<br/><br/>A moment ago, Dong Xuan, brimming with indisputable authority and murderous intent, had been brought to his knees and changed his attitude to extreme subservience after being defeated.<br/><br/>Gu Yang sheathed his sword and said, “Now, it’s your turn to give me an explanation.”<br/><br/>Dong Xuan nervously responded, “Sir, please tell me what you need.”<br/><br/>“I wanted to pawn a jade hairpin at your shop. However, your staff accused me of theft, intending to swindle my belongings. How should this matter be settled?”<br/><br/>After listening, Dong Xuan glared furiously at one of his stewards, wishing he could skin him alive.<br/><br/>He had never imagined that his servant would cause such a catastrophe.<br/><br/>The old steward, frightened by Dong Xuan’s venomous eyes, slumped to the ground in terror.<br/><br/>Barely suppressing his fury, Dong Xuan declared, “Due to my lax management, such an incident has occurred. I will certainly rectify this for you.” “Tell me, how do you plan to rectify this?”<br/><br/>Dong Xuan understood and asked, “May I ask what you require, sir?” Gu Yang held up a finger and replied, “Ten thousand taels, in silver, to be delivered to me today. We can then leave this matter behind..”\t\t\t\t\t\t</div>", "images": {}, "success": true}