{"id": 26, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14254619.html", "title": "Chapter 26 - Chapter 26: 026 Must Have Been Targeted", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 26 - Chapter 26: 026 Must Have Been Targeted</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 26: 026 must have been targeted<br/><br/>Translator: 549690339<br/><br/>Gu Yang gazed out into the room, seeing Su Qingzhen sitting cross-legged in a corner, concentrating on her cultivation. Judging by her appearance, she was deep in the meditation.<br/><br/>She truly didn’t waste a second, maximizing every moment.<br/><br/>With such high talents plus a hard-working spirit, it’s no wonder she improved so fast.<br/><br/>He withdrew his gaze and began another round of the simulation.<br/><br/>[At the age of 22, you are a sixth grade martial artist. After barricading Su Qingzhen in Wangjia Valley and wiping out the people of the Liu family, you proceeded to Tianshui City.]<br/><br/>[You devised a scheme to extort Dong Xuan, earning 12,000 silver taels. You left Tianshui City that night and started to travel the desolate mountain paths where few people tread.]<br/><br/>[Two months later, you both finally reached Ping County. Su Qingzhen kept her promise and took you to the money house to exchange the 30,000 silver notes.]<br/><br/>[Because of the incident with the Liu family, you decided to keep away from Jiangzhou.]<br/><br/>[A year later, you arrived at the heart of the Great Zhou – the Divine City.]<br/><br/>[Half a year later, after getting accustomed to the life in the Divine City, you decided to join the Tianxin Martial Academy. A month later, you passed the test and became an official disciple, learning Saber Technique from the academy master.]<br/><br/>[At the age of 25, your Saber Technique reached a new level. Among the many sixth grade disciples at the Tianxin Martial Academy, none were your match.]<br/><br/>[One day, Guo Taiping, seventh on the list of young talents, came to challenge your academy. After ten moves, he defeated the academy master and left mockingly. That same night, the academy master succumbed to his injuries.]<br/><br/>[With the death of the academy master, his only daughter mysteriously disappeared, and the Tianxin Martial Academy started to disintegrate. Most of the disciples switched to other academies. You noticed something unusual and decided to avoid the potential disputes by leaving the Divine City.]<br/><br/>[Not far from the Divine City, you encountered a youth from a noble family with sixth grade cultivation, specifically waiting to spar with you. After ten moves, you defeated him. Out of humiliation, his guards intervened and killed you. You died at the age of 25.]<br/><br/>Died at the age of twenty-five…<br/><br/>Gu Yang couldn’t help but shake his head at this outcome.<br/><br/>The Divine City otters more opportunities but it’s also danger-ridden. He only made a name for himself in a Martial Academy and it attracted the unreasonable young nobility. Unable to accept defeat, they had him killed by their guards.<br/><br/>What a disgrace to humanity.<br/><br/>Although Gu Yang didn’t know the full extent of Tianxin Martial Academy’s influence, the fact that someone from the young talent list came to challenge them meant that they must be a force of third rank or higher.<br/><br/>However, the Divine City’s affairs were too complicated. With the death of the academy master, the academy fell apart.<br/><br/>[Simulation ends, you can retain one of the following options.]<br/><br/>[One, Martial Arts realm at the age of 25.] [Two, Martial Arts experience at the age of 25.]<br/><br/>[Three, Life Wisdom at the age of 25.]<br/><br/>After some hesitation, Gu Yang chose the first option.<br/><br/>Although in this run of the simulation, his Saber Technique made significant advances—practically reaching a stage where he was unbeatable within the sixth grade—it was still more important to him to advance his realm.<br/><br/>Even though this time he only gained three more years of cultivation.<br/><br/>After a while, when his cultivation level had fully increased, his True Qi rose by about ten percent.<br/><br/>“It seems my strength is still too weak. Going to Divine City is too risky. One wrong step and I die. This time, let’s find a small place to live in seclusion. I refuse to believe that I can’t break through after decades of secluded meditation.”<br/><br/>With a change in his strategy, Gu Yang began a new round of simulation.<br/><br/>[At the age of 22, you are a sixth grade martial artist. After barricading Su Qingzhen in Wangjia Valley and wiping out the people of the Liu family, you proceeded to Tianshui City.]<br/><br/>[You devised a scheme to extort Dong Xuan, earning 12,000 silver taels. You left Tianshui City that night and started to travel the desolate mountain paths where few people tread.]<br/><br/>[Two months later, you both finally reached Ping County. Su Qingzhen kept her promise and took you to the money house to exchange the 30,000 silver notes.]<br/><br/>[Because of the incident with the Liu family, you decided to keep away from Jiangzhou.]<br/><br/>[A year later, you arrived at the westernmost point of the Great Zhou, Dingzhou, where you found a small city and settled down, focusing on cultivation.]<br/><br/>[At the age of 29, one night, the barbarians from the grasslands attacked the city. Caught in the upheaval, you were besieged and, after killing dozens of enemy soldiers, fell fatigued. You died at the age of 29.]<br/><br/>What the…?<br/><br/>Gu Yang was exasperated. He had thought that going further away from Jiangzhou would be better. But he ran so far that he ended up part of a war, and thus met his end.<br/><br/>“It seems like I’m having extraordinarily bad luck. So many simulations, no matter where I go, I encounter various mishaps.”<br/><br/>By this point, he began to sense that something was off.<br/><br/>Even if he’s out of luck, it shouldn’t be that he’s unlucky every single time, right?<br/><br/>Gu Yang considered himself a careful and cautious person, preferring to keep a low profile if it was possible. Boasting sixth-grade power, as long as he didn’t stir up any trouble and found a low-key place to live peacefully for the remainder of his life, it shouldn’t be that difficult.<br/><br/>I must have been targeted!<br/><br/>Perhaps, being a transmigrator and my status has drawn the hostilities of the World Will.<br/><br/>Such was Gu Yang’s guess.<br/><br/>[Simulation ends, you can retain one of the following options.]<br/><br/>[One, Martial Arts Realm at the age of 29.] [Two, Martial Arts experience at the age of 29.]<br/><br/>[Three, Life Wisdom at the age of 29.]<br/><br/>He chose the first again.<br/><br/>This time, his cultivation increased by another two-tenths.<br/><br/>“Let’s try it again.”<br/><br/>[ …You settled in a small city in the central part of Great Zhou, Zhongzhou, and focused on cultivating.]<br/><br/>[At the age of 28, one day, you crossed paths with Cao Yiyi, ranked tenth in the Beauty list. Due to slightly prolonged eye contact, you invoked her displeasure. Her male companion immediately attacked and you were killed. You died at the age of 28.]<br/><br/>“I was right.”<br/><br/>Gu Yang could now almost affirm that he was being targeted by the World Will. No matter how careful he was or how he avoided causing trouble, trouble always found him.<br/><br/>Such damn bad luck.<br/><br/>[Simulation ends, you can retain one of the following options.]<br/><br/>Gu Yang still chose the first option. His True Qi had a slight increase, though much less than the previous times.<br/><br/>He felt that he had reached the peak of the sixth grade.<br/><br/>“I only have three chances left.”<br/><br/>Gu Yang glanced at his remaining balance and began to contemplate how to make the best use of these last three simulations.<br/><br/>Choosing a place to live in seclusion was proving to be a dead end.<br/><br/>Since that was the case, then he should find a way that can quickly boost his strength.<br/><br/>After ruminating for a while, a thought suddenly flashed into his mind. He looked over at Su Qingzhen, who was cultivating in the corner, thinking, “How could I have forgotten about her?”<br/><br/>With a plan in mind, he began a new simulation.<br/><br/>[At the age of 22, you are a sixth grade martial artist. After barricading Su Qingzhen in Wangjia Valley and killing everyone from the Liu family, you proceeded to Tianshui City.]<br/><br/>[You devised a scheme to extort Dong Xuan, earning 12,000 silver taels. Leaving Tianshui City that same night, you began to travel secluded mountain paths where few people tread.]<br/><br/>[Two months later, you finally reached Ping County. Su Qingzhen kept her promise and took you to the money house to exchange the 30,000 silver notes.]<br/><br/>[You decided to stay in Ping County, utilizing Su Qingzhen’s special constitution for your cultivation. Your True Qi became even more refined.] [At 23, one night, an injured Su Qingzhen fled to your home. She was under the protection of the Qingxuan Sect, but was attacked by the people of the Liu family. During the disarray, she escaped. You took her and fled Ping City…. ]\t\t\t\t\t\t</div>", "images": {}, "success": true}