{"id": 35, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14254628.html", "title": "Chapter 35 - Chapter 35: 035 Treasure Map", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 35 - Chapter 35: 035 Treasure Map</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 35: 035 Treasure Map<br/><br/>Translator: 549690339<br/><br/>In Xiang County, at Ruyi Tower a grand banquet was underway. The star of the day was none other than the seventh son of the Lin family, Lin Zirui.<br/><br/>In the midst of the joyful feasting, abruptly, a follower approached Lin Zirui and spoke softly into his ear. A change came over his face.<br/><br/>Suddenly, the once lively attendees all fell silent and set down their wine glasses.<br/><br/>Lin Zirui quickly regained his composure, picking up a cup of wine, he said, “Let’s call it quits for today, I have some matters to attend to.”<br/><br/>After emptying the cup, he left his seat and departed.<br/><br/>Once outside the tavern, his expression immediately turned grim, “Zhou Qing was actually killed by that boy. How is this possible? Elder Wu said himself that Zhou Qing had a cultivation level of Sixth Grade.”<br/><br/>Elder Wu was from the Red Mansion in Divine City. Lists such as the First Rank List and the Hidden Dragon List all came from the Red Mansion. For a thousand years, there had never been any error.<br/><br/>This time Elder Wu came to Xiang County, it must have been for the newly promoted Second Grade of the Zheng family.<br/><br/>His observations were sharp, he certainly could not be mistaken.<br/><br/>The guard behind him responded, “According to the report, Zhou Qing was killed by a saber technique called Duanyue. He was killed with a single strike.”<br/><br/>“Tianxin Martial Arts Hall?”<br/><br/>Lin Zirui’s brows furrowed slightly, “Which one of them from Tianxin Martial Arts Hall came to Jiangzhou?”<br/><br/>“We did not receive any information about this before.”<br/><br/>Lin Zirui coldly said, “The Listening Wind Hall is becoming more and more useless.”<br/><br/>“Young master, please calm your anger.”<br/><br/>“Where is Gu Yang now? Where is he?”<br/><br/>“Ping County City, young master, do we need to send more people?”<br/><br/>Lin Zirui’s eyes were somewhat gloomy, “That’s my second brother’s territory. He despises others intruding on his turf. Consider him lucky.”<br/><br/>Though the Lin family was prosperous and powerful, the loss of Zhou Qing, a Fifth Grade, would surely warrant him a scolding.<br/><br/>Meanwhile, Gu Yang, with Ling Ling, had already left Ping County City overnight.<br/><br/>This time, they did not travel by carriage and didn’t carry much luggage. Traveling with light equipment, their speed increased tremendously.<br/><br/>His goal was Yuzhou in the neighboring region. He was supposed to exchange the thirty thousand two silver notes in Yuzhou City. Su Qingzhen had already given him the code and the seal for the exchange. With these, he should be able to cash in those notes.<br/><br/>Originally, Gu Yang wanted to go alone, but Ling Ling insisted on going with him, probably worried that he would run away.<br/><br/>He knew that even if he didn’t let her follow, she would definitely sneak after him, so he agreed to take her along.<br/><br/>As for Su Qingzhen and her maid, they had already gone to Qingxuan Sect.<br/><br/>As for Zhang Xiao Hai, Gu Yang gave him some silver and told him to find a place to settle down first.<br/><br/>Under the cover of night, two shadows leaped down the road, moving at a swift speed, as fast as if riding the wind and demonstrating the power of lightning.<br/><br/>“There is a broken temple ahead, let’s rest there for a while.”<br/><br/>Suddenly, the man in the party spoke.<br/><br/>These two, were none other than Gu Yang and Ling Ling who had been travelling for half of the night.<br/><br/>Such a swift journey had significantly drained his True Qi; he had already used up almost half of it.<br/><br/>Ling Ling still looked calm and unflustered. After stopping, she commented somewhat guiltily, “I’ve been traveling north and south with my father since I was a child, so my speed is a bit faster…”<br/><br/>“Mm, that’s very normal.”<br/><br/>Gu Yang followed her words, if she wanted to play this act, he would accompany her in this play.<br/><br/>After interacting for more than ten days, he also realized that this girl was a bit naive, she seemed to really believe that her clumsy acting skills had fooled him.<br/><br/>To put it bluntly, she was just lacking some common sense, she was not very worldly but seemed very knowledgeable, having a profound understanding of the various forces.<br/><br/>This confirmed his speculation that she came from a powerful family, dedicated to cultivation, too protected, lacked experience, and therefore lacked common sense.<br/><br/>Of course, she was not mindless. She showed a high level of vigilance.<br/><br/>After so many days, despite being with him all day and night, Gu Yang could not find any opportunity to launch a surprise attack.<br/><br/>“Huh?”<br/><br/>As the two were about to approach the broken temple, Ling Ling suddenly stopped as she nervously said, “There are people inside.”<br/><br/>Only then did Gu Yang notice that there was indeed some movement in the broken temple not far away, and he was somewhat ashamed. Her vigilance was indeed much stronger than his own.<br/><br/>He whispered, “Let’s go.”<br/><br/>He didn’t want to get involved in any trouble that might delay him from getting the money.<br/><br/>Ling Ling nodded, she had the same thought.<br/><br/>“Jiao, hand over the treasure map!”<br/><br/>Suddenly, a voice loud came from the direction of the broken temple.<br/><br/>With that, Gu Yang’s footsteps halted. He turned his head and suggested, “Maybe we should go over and take a look.”<br/><br/>Ling Ling nodded.<br/><br/>Considering her identity that of a maid, it was only natural for her to follow the young master’s orders.<br/><br/>And besides, there weren’t any real experts inside, Gu Yang alone was enough to handle it.<br/><br/>The two silently sneaked across.<br/><br/>Inside the broken temple, six armed men surrounded a young man drenched in blood. He was holding a knife with his right hand, with his left hand hanging limp. Obviously, he was seriously injured.<br/><br/>He leaned against the wall, his expression fierce, “If you want the treasure map, come and get it. Be warned though, a single treasure map may not be enough to be shared among all you lot.”<br/><br/>The faces of the six men grimaced.<br/><br/>One of them shouted, “Don’t listen to his nonsense. We need to kill him first, get the treasure map, retrieve the treasure of the Shadow Thief, and then we six can share it equally.”<br/><br/>Outside the temple, Gu Yang, who was peeping, asked in a whisper, “Who is the Shadow Thief? Is the treasure really worth it?”<br/><br/>“The Shadow thief was an infamous robber over a hundred years ago. He pulled off more than a dozen earthshaking thefts and operated freely for more than a decade without being caught. Until finally, he stole the unparalleled skill “Phoenix Dance Nine Heavens” from the Shen family which aroused the pursuit of the Shen family’s Divine Power Realm’s old monster. He was eventually killed outside Divine City.”<br/><br/>“During his time being pursued, he disseminated nine treasure maps claiming that the treasures he had stolen were buried in these nine locations. Among those treasures, was “Phoenix Dance Nine Heavens.”<br/><br/>A superb skill!<br/><br/>Gu Yang’s eyes suddenly lit up.<br/><br/>In this world, above the First Rank, there is still the Divine Power Realm. These powerful people are the rulers of this world.<br/><br/>Before this, in his numerous simulations, his realm was always too low, unreachable to that level.<br/><br/>But he knew that unique skills that could allow cultivators to reach the Divine Power Realm can indeed be called unparalleled.<br/><br/>The Shen family mentioned by Ling Ling undoubtedly referred to one of the nine families of the world. These nine powerful families each had a member of the Divine Power Realm overseeing their affairs.<br/><br/>At the same time, the voice of Ling Ling continued to come, “For more than a hundred years, every time the Shadow Thief’s treasure map appeared, it would cause a huge disturbance in the martial arts world. However, most of them were fakes. So far, only three treasure maps have been confirmed to be real.”<br/><br/>“As for the other treasure locations, whether they have been secretly dug up, no one knows. The authenticity of the current treasure map can’t be determined either.”<br/><br/>Gu Yang looked into the broken temple, the seven people inside all had cultivation levels below Fifth Rank.<br/><br/>If worse comes to worst, there was still the Fourth Grade Ling Ling here. Even if they were not opponents, there was still confidence to retreat in whole body.<br/><br/>This was an opportunity.<br/><br/>As for whether it was real or not, it was not very difficult for him to verify.<br/><br/>Suddenly, Ling Ling’s guarded voice came over, “This communication skill…<br/><br/>my father taught me…it is an essential technique for walking in the martial arts world…’<br/><br/>“Mm, that’s very reasonable.<br/><br/>Gu Yang gave her an affirmative look..\t\t\t\t\t\t</div>", "images": {}, "success": true}