{"id": 38, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14254635.html", "title": "Chapter 38 - Chapter 38: 038 Thirty-Two Thousand In Hand", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 38 - Chapter 38: 038 Thirty-Two Thousand In Hand</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 38: 038 Thirty-two thousand in hand<br/><br/>Translator: 549690339<br/><br/>Gu Yang said, “Previously I was always in the mountains, no one explained these things to me.”<br/><br/>Ling Ling held a strong curiosity about his master, but didn’t pryingly inquire further. She said, “Every woman evaluated and placed on the Beauty List possesses unique qualities.”<br/><br/>“Such as Frosty Skin and Jade Bone, it’s a unique constitution. Its last appearance goes few centuries back. Such individuals innately possess pure Yin Qi within their bodies, making them excellent Cultivation Furnaces to men who cultivate Yang attribute techniques.”<br/><br/>Gu Yang had an enlightening moment. So the Yin Qi inside Su Qingzhen had such implications.<br/><br/>“Any woman possessing the Frosty Skin and Jade Bone attribute is inherently blessed. Born with one foot already stepping into the Divine Power realm, as long as they can reach the First Rank, entering the Divine Power realm becomes a mere trifle.’<br/><br/>When Ling Ling said these words, a profound longing was evident in her tone.<br/><br/>To others, the Divine Power realm is undoubtedly a chasm hard to surmount, as hard as ascending to heaven. Countless gifted individuals get stuck at this juncture, their progress arrested at the First Rank for life.<br/><br/>People like this, who are born with one foot already stepping into the Divine<br/><br/>Power realm, seem to highlight Heaven’s unfairness.”<br/><br/>“So are you saying that I, in essence, took in a future Divine Power realm practitioner as a servant?”<br/><br/>An odd thought flashed across Gu Yang’s mind.<br/><br/>It does seem rather thrilling when put that way.<br/><br/>He then asked, “What about ‘Bewitchingly Charming’? What unique attribute does she possess to be ranked ahead of Frosty Skin and Jade Bone?”<br/><br/>Ling Ling said, “The ranks given on the Beauty List do not imply superiority or inferiority. Those ranked higher simply means they have been on the list longer.”<br/><br/>‘”Bewitchingly Charming’ refers to those born with captivating charm, possessing a natural power to beguile men, and easily capture a man’s heart.” Gu Yang understood; it essentially meant they carried an innate charm aura. Over a thousand years ago, a woman endowed with ‘Bewitchingly Charming’ was immensely talented and self-created a sect, the ‘Femme Fatale Heart Manual’. She transformed this charm into a formidable weapon, bewitching countless Martial Arts experts into risking their lives for her.”<br/><br/>“Their sect, the Femme Fatale Sect, would do everything they could to recruit<br/><br/>any woman with the ‘Bewitchingly Charming’ attribute whenever they appeared, sparking off bloody storms in the martial world.”<br/><br/>Gu Yang curiously inquired, “What about Cao Yiyi? Is she brave enough to swank around carelessly?”<br/><br/>Ling Ling replied, “A few years ago, after Cao Yi Yi was listed on the Beauty<br/><br/>List, her father, single-handedly and with a spear, stormed the Femme Fatale<br/><br/>Sect and massacred all of its members. He then set the whole place ablaze, effectively obliterating the sect.”<br/><br/>Gu Yang suddenly felt a tinge of relief. If he had carelessly killed Cao Yi Yi just now, wouldn’t he have a Divine Power realm practitioner brandishing a long spear chasing after him?<br/><br/>He became increasingly curious about the Beauty List, “What about the others on the Beauty List?”<br/><br/>“You’ll know about them eventually. I’m getting hungry now; let’s go find a place to eat.” Ling Ling diverted the topic.<br/><br/>Next, no more accidents occurred.<br/><br/>After a few days, Gu Yang and Ling Ling arrived at the Yuzhou city, a huge city with a population exceeding a million.<br/><br/>In this era, it was considered a major city bustling with crowds.<br/><br/>Gu Yang found an excuse to send Ling Ling away and went alone to the Four Sea Bank to withdraw the money. He planned to top it directly into the system and didn’t want her following along which would demand explanation.<br/><br/>He collected all the information; there were four branches just in Yuzhou city.<br/><br/>He took few thousand taels from each branch, took it several times, put it in a bundle, completely inconspicuous. As soon as he left, he topped up and no one was any wiser.<br/><br/>By the afternoon, Gu Yang had withdrawn all thirty thousand taels and made the deposit in the system.<br/><br/>Seeing the balance of thirty thousand in the system page, he felt extremely satisfied.<br/><br/>Justifying the great risk, he escorted Su Qingzhen to Pingjun.<br/><br/>This sum would be enough for fifteen simulations.<br/><br/>After finding Ling Ling at the prearranged location, Gu Yang left the bustling city of Yuzhou.<br/><br/>It was the territory of the Shen Family, belonging to Shen Baiyi, the wary character he had encountered in Simulated Life.<br/><br/>In these few days, Gu Yang not only journeyed but also heard Ling Ling relate many things, so he wasn’t left in the dark anymore.<br/><br/>The Shen Family, also one of the Nine Surnames, coincidentally the mother of the current Fifth Prince comes from a branch of the Shen Family.<br/><br/>As for Shen Baiyi, he was the young master of Shen Family, entered the Second Grade at the age of twenty-seven, and ranked third in the Hidden Dragon List.<br/><br/>Even if not as exceptional as Liu Zhe he was still a top-tier genius.<br/><br/>He’s the future ruler of the Shen Family and most likely has hopes of entering the Divine Power Realm.<br/><br/>A figure like this suddenly appeared in Pingjun a year later, supposedly ran into Su Qingzhen by chance- was it really by chance?<br/><br/>After leaving Yuzhou city, Gu Yang decided against spending the night in the wild, instead choosing to lodge for the night in a small town’s residence. “Do you wish to activate the Life Simulator? One use costs 2000 currency.”<br/><br/>Seeing this prompt, Gu Yang felt a bit excited. After almost half a month, he finally saw this prompt again. “Yes.”<br/><br/>“At twenty-two, you accompanied Ling Ling to Yuzhou city to exchange silver tickets. On your way, you encountered an unjust event and saved Jiao Shumo, earning a treasure map. But this was witnessed by Cao Yiyi, causing a confrontation.<br/><br/>“Next, you return to Pingjun City for intense cultivation.”<br/><br/>“At twenty-five, in the middle of the night, a mysterious expert arrives at your room. After confirming your name, the expert kills you. Ling Ling, residing in the same room, was too late to prevent it. You died at twenty-five.” Seeing his short-lived life, Gu Yang couldn’t help but sigh.<br/><br/>This was not simulating life, but rather various methods of dying.<br/><br/>Funny how he had changed his future only to be hunted by a mysterious expert three years later. He didn’t even know why the stranger wanted to kill him.<br/><br/>Ling Ling, with her own strength, was unable to prevent it, confirming that the assassin was a powerful expert above the Third Rank.<br/><br/>“Is it Cao Yi Yi seeking revenge? Assassins from Liu Family? Or someone sent by the Fifth Prince?”<br/><br/>Gu Yang thought for a while but didn’t get anywhere. The main issue was the lack of information.<br/><br/>He knew one thing; the assassin targeting him definitely was not Ling Ling’s enemy.<br/><br/>“The simulation is complete, and you may choose from among these possibilities.”<br/><br/>“First, Martial Arts realm at the age of twenty-five.” “Second, Martial Arts experience at the age of twenty-five.” “Third, life wisdom at the age of twenty-five.”<br/><br/>Gu Yang did not hesitate and immediately chose the first option.<br/><br/>Instantaneously, a massive stream of refined True Qi surged inside him, doubling his capacity.<br/><br/>“How come there’s so much?”<br/><br/>He was somewhat surprised. In just three years, his True Qi had increased twofold, the speed of which surpassed his expectation.<br/><br/>With this efficiency, it was a massive improvement compared to his earlier progress.<br/><br/>“Is it because of dual cultivating with Su Qingzhen, supplemented by Ling Ling’s Spirit Calming Incense?”<br/><br/>He had a hunch.<br/><br/>These days, his cultivation speed had accelerated dramatically. The chief contributor was the Ling Ling-provided Spirit Calming Incense that greatly improved meditation quality.<br/><br/>Of course, it wasn’t entirely due to her.<br/><br/>Huge credit also goes to the pure Yin Qi inside Su Qingzhen which greatly assisted his True Qi cultivation process.<br/><br/>In this simulation, he stayed in Pingjun city the entire time, with both women by his side. Thus, in just three years, his power increased so much.<br/><br/>Otherwise, relying solely on himself, even after ten or eight years of cultivation, he might not achieve these results.<br/><br/>Meanwhile, Ling Ling, who was resting in the room with her eyes shut, suddenly opened them and looked somewhat astounded at Gu Yang in the bed.<br/><br/>“Why did his cultivation suddenly surge?”<br/><br/>PS: This chapter is to compensate for the missed chapter yesterday..\t\t\t\t\t\t</div>", "images": {}, "success": true}