{"id": 34, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14254627.html", "title": "Chapter 34 - Chapter 34: 034 Ping County City", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 34 - Chapter 34: 034 Ping County City</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 34: 034 Ping County City<br/><br/>Translator: 549690339<br/><br/>Gu Yang was sitting cross-legged on the bed, eyes closed, with True Qi circulating within his body.<br/><br/>At his level of cultivation, he could use meditation as a substitute for sleep, entering a state similar to deep contemplation, which had an even better effect than sleep.<br/><br/>Moreover, in this state, he was extremely sensitive to his surroundings. Any movements, no matter how small, c114ould be sensed beforehand.<br/><br/>However, being a modern man, he was somewhat restless. Despite many years, he still hadn’t been able to truly calm his mind. Each practice session, it always took him a long time to enter a state of meditation.<br/><br/>This was one of the key reasons for the slow progress of his True Qi.<br/><br/>Up until now, he was unable to quickly enter a meditative state. Each time, it would take one or two hours, and the quality was not very good.<br/><br/>Today, however, he felt something different, as if he could faintly smell a unique fragrance through his nose. His mind rapidly calmed down and he entered the mysterious state.<br/><br/>When Zhang Xiao Hai got up from bed in the next room, Gu Yang naturally woke up. He felt better than ever, even the True Qi within his body had slightly increased.<br/><br/>The efficacy of tonight’s meditation was equivalent to a month’s worth of progress in the past.<br/><br/>“Is this the effect of high-quality meditation?”<br/><br/>He was astonished. Looking out, he saw Ling Ling waking up with a slight smile on her face.<br/><br/>Gu Yang responded with a small smile and then got up.<br/><br/>It was clear that this change didn’t occur without a cause, it must be her doing.<br/><br/>Such aromatics that could help people quickly enter a meditative state were high-grade, not something money could readily buy.<br/><br/>She had actually been willing to use it.<br/><br/>Gu Yang was even more curious about this woman.<br/><br/>Having an extra person in the group did not significantly impact the pace of their journey.<br/><br/>Following the previous route, Gu Yang traveled overland to Ping County. They encountered no further mishaps along the way.<br/><br/>After half a month, Ping County was finally within sight.<br/><br/>That day, Ling Ling found an excuse to venture out alone into the bustling streets. She eventually made her way through a small back alley and rendezvoused with a ragged old man.<br/><br/>The old man crouched on the ground, holding a bottle of wine. With a grin, he said, “Girl, you look successful.”<br/><br/>“Of course, it took just a minor ruse for me to infiltrate that man’s inner circle.” Ling Ling replied with a hint of pride.<br/><br/>“So, how is it? Didn’t Grandpa Dupe lead you wrong? His Pure Yang Qi is exceptionally pure. Once he reaches the Fourth Rank, it will aid you in cultivating the Extreme Yang True Gang.”<br/><br/>Ling Ling’s brows furrowed at his words, “I fear it won’t be that simple.” “What problems are there?”<br/><br/>“According to my observations over these few days, his cultivation progress is extremely slow. Even with my help, and even with dual cultivation with that woman of ice skin and jade bones, it will take at least ten years to break through to the Fourth Rank. It’s strange, how did he manage to reach the Fifth Rank with such aptitude?”<br/><br/>This was Ling Ling’s most perplexing question. Given Ge Yang’s current progress, there was absolutely no way he could have reached his current level of cultivation at such an age.<br/><br/>The old man said thoughtfully, “It seems that this man had some extraordinary experiences.”<br/><br/>“Indeed, saving a stunning woman of ice skin and jade bones from a bandit’s clutches is quite a feat of luck.”<br/><br/>Ling Ling had learned from Zhang Xiao Hai about how Gu Yang and Su<br/><br/>Qingzhen had come together.<br/><br/>With a hint of glee, she said, “I heard that Zhao Han practices the Burning Sky Art. The Liu family originally wanted to offer Su Qingzhen to him, who would have thought that it would end up benefiting this guy.”<br/><br/>Zhao Han was the fifth prince of the Great Zhou dynasty.<br/><br/>The old man’s tone grew grave “I’ve heard that Zhao Han is remarkably gifted, a Third Rank cultivator at only twenty years old. If he had gotten hold of that icy jade beauty, within twenty years, the Zhao Family would likely have another Divine Power Realm cultivator.”<br/><br/>“Now, Su Qingzhen’s body has already been merged with Gu Yang’s Extreme Yang Qi. If Zhao Han found out, he’d probably be angry enough to die.”<br/><br/>Pure Yang Qi places great importance on purity. Since Su Qingzhen has already engaged in dual cultivation with another person, even if Zhao Han were to seize her, he would not be able to cultivate Pure Yang.<br/><br/>Even the slightest flaw would prevent him from achieving the Divine Power Realm.<br/><br/>The old man warned, “The Zhao Family has always been narrow-minded. If they find out about this, they will certainly not let it go.”<br/><br/>“No matter how hard it gets, I’m not afraid. The days when I saw no hope were truly unbearable. Now that I’ve finally found a way, even if there are seas of flames and mountains of knives in front of me, I’ll wade through them.”<br/><br/>The old man sighed, “You’ve had a hard journey.”<br/><br/>Ping County Town, located on the westernmost side of Jiangzhou, once past it, it would be the Tong County of Yuzhou.<br/><br/>This was a large city, bustling with trade and commerce, a crucial passageway for entry and exit to Jiangzhou.<br/><br/>When Gu Yang’s carriage entered Ping County Town, it was already noon.<br/><br/>He suddenly announced, “We’re here.”<br/><br/>Su Qingzhen was slightly agitated, she lifted the curtain of the carriage to peek outside. Seeing the bustling streets, her eyes became slightly moist.<br/><br/>Few knew that the master of the Qingxuan Sect in Ping County Town was her mother’s own master.<br/><br/>Before she left, her mother told her to seek the Qingxuan Sect and that the sect master would assuredly protect her.<br/><br/>Now, after overcoming countless dangers, she had finally arrived in Ping County Town.<br/><br/>Hearing Gu Yang’s words, she knew what he meant, and replied, “I will keep my promise. Now, let’s go to Four Seas Bank to cash in those three thousand banknotes.”<br/><br/>Gu Yang instructed the driver, “Ask for directions to the nearest Four Sea<br/><br/>Bank.”<br/><br/>“Hold on.”<br/><br/>Suddenly, Ling Ling interjected, “Are the banknotes you brought from home?”<br/><br/>Su Qingzhen asked back, “Is there a problem?”<br/><br/>Ling Ling could feel her hostility towards her, but she replied with a smile, “Do you know who owns Four Sea Bank?”<br/><br/>“Who doesn’t know that the owner of Four Sea Bank is the richest family in the world, the Qian Family.”<br/><br/>Four Sea Bank had branches throughout the states of Great Zhou, even in each county, where money could be exchanged. It could be said it was the most powerful bank.<br/><br/>“Um. ”<br/><br/>Ling Ling shook her head, “The Qian Family only manages the bank. Its real owners are the current royal family, the Zhao Family. If you exchange large amounts of money here, you are essentially telling the fifth prince that we are here.”<br/><br/>Upon hearing this, Su Qingzhen’s face changed.<br/><br/>Gu Yang was also taken aback. No wonder the Liu Family’s people found Su Qingzhen’s whereabouts so quickly, it turned out to be like this.<br/><br/>In fact, although the Great Zhou is a united dynasty, the local areas were controlled by various noble families and sects. The farther it was from the central authority, the weaker its control.<br/><br/>Ping County Town was controlled by the Lin Family, the Liu Family could not reach here. In theory, the Liu Family should not have found Su Qingzhen so easily.<br/><br/>If this was the case, then it made sense.<br/><br/>Gu Yang quickly had a plan in his mind, saying, “Let’s find a place to settle down first.<br/><br/>The banknotes were still with him. As long as he knew the password, he could get the money in any other state. At most, he had to travel a bit farther. This was not a problem..\t\t\t\t\t\t</div>", "images": {}, "success": true}