{"id": 32, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14254625.html", "title": "Chapter 32 - Chapter 32: 032 Hidden Dangers Of Kung Fu Techniques", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 32 - Chapter 32: 032 Hidden Dangers Of Kung Fu Techniques</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 32: 032 Hidden Dangers of Kung Fu Techniques<br/><br/>Translator: 549690339<br/><br/>Gu Yang didn’t rush to start the second simulation, instead he fell into deep thought.<br/><br/>Why was this woman named Ling Ling so desperate to get close to him, and then forced him to marry her?<br/><br/>In the many previous simulations, this woman had never shown up. Her sudden appearance was unanticipated.<br/><br/>What was her real intention?<br/><br/>After they formalized the marriage, she left him a book, “Sun’s Red Technique,” then disappeared.<br/><br/>When his life was endangered, she risked everything to save him, eventually dying in the process.<br/><br/>All of it was confoundingly inexplicable.<br/><br/>Gu Yang really couldn’t figure it out.<br/><br/>One could say that this woman had been very compassionate and loyal. However, there must be some reason for her behavior, right? [Simulation completed, you can retain one of the following.]<br/><br/>[First, Martial Arts Realm at age twenty-three.]<br/><br/>[Second, Martial Arts experience at age twenty-three.]<br/><br/>[Third, Life wisdom at age twenty-three.]<br/><br/>Gu Yang hesitated for a moment when he saw these options popping up, but then he chose the second one.<br/><br/>The main reason was that the full “Sun’s Red Technique” was extremely important. Once he had it, he wouldn’t be bothered by the issue of martial arts techniques again, and it would be enough to cultivate him to the Third Rank or higher.<br/><br/>Once he made the decision, many memories appeared in his mind about various martial arts, including the full “Sun’s Red Technique”.<br/><br/>This technique astonishingly had nine layers, each corresponding to a Realm. Suggesting that this technique could lead to the First Rank Realm.<br/><br/>“However, this technique feels a little strange.”<br/><br/>Gu Yang was both ecstatic and worried.<br/><br/>This technique was extremely radical, especially from the seventh layer onwards. The different cultivation methods didn’t seem like legitimate techniques.<br/><br/>The seventh layer required the condensation of Heartfire. The method was to burn one’s own anger as fuel.<br/><br/>The practice involved continuously infuriating oneself, the angrier, the better.<br/><br/>The eighth layer got more peculiar, requiring the condensation of Yin Fire. The cultivation method was to reverse the cultivation of “Sun’s Red Technique”, transforming from extreme yang to extreme yin.<br/><br/>How was this different from suicide?<br/><br/>The ninth layer was simply ridiculous, demanding one to personally kill three First Rank experts as a practitioner, borrowing their life fire to reach the realm of the Sun’s Red Technique.<br/><br/>The eighth layer was just a Second Rank Realm. How could one think of killing a First Rank Expert? And not just one, but three at that.<br/><br/>“No wonder the faction I had sworn allegiance to passed “Sun’s Red Technique” on to me. So, it was a huge trap.”<br/><br/>Gu Yang finally understood.<br/><br/>This technique, when cultivated to the later stages, was simply inhumane. It was a wonder anyone could succeed.<br/><br/>“As if, this aggressive, dominant power of the Sun’s True Qi was from an evil martial arts technique.”<br/><br/>In his heart, he felt somewhat grateful. Good thing Su Qingzhen was there, using her body’s Profound Yin Qi, his Qi had become incredibly pure, solving a huge hidden danger.<br/><br/>“It seems I need to find a new technique.”<br/><br/>Gu Yang had made up his mind.<br/><br/>But this wouldn’t be an easy task, almost all advanced techniques were monopolized by noble families and sects, rarely teaching outsiders.<br/><br/>“I’ll give it a try.”<br/><br/>However, the first thing to do was to avoid Ling Ling. She was being hunted by a Third Rank expert—it was too risky.<br/><br/>He was a man targeted by the World Will, and she was supposed to be safe alone. But if she stayed with him, she would certainly be caught up in his bad luck.<br/><br/>Once Gu Yang made his decision, he started the next simulation.<br/><br/>[At twenty-two years old, you are a Fifth Grade Martial Artist in Tianshui City, where you have rejected Lin Zirui’s recruitment. On the fifth day after leaving Tianshui City, you run into a swordsman named Zhou Qing, whom you slay with a single stroke of your blade.]<br/><br/>[Next, you part ways with Su Qingzhen and rush day and night, travelling alone to Divine City.]<br/><br/>[A month later, you join the Tianxin Martial Academy, becoming a direct disciple of the head Cheng Tianxin.]<br/><br/>[After two months, a woman named Ling Ling joins the academy, becoming your junior sister. The two of you often spar with each other, making your saber technique progressively refine.]<br/><br/>[At twenty-five years old, Guo Taiping, ranked seventh on the list of heaven’s chosen, challenges the academy. Cheng Tianxin is defeated after twenty<br/><br/>[That night, a mysterious Third Rank expert breaks into the Academy and attacks Ling Ling. Cheng Tianxin, despite his serious injuries, fends off the Third Rank expert but then dies from his injuries.]<br/><br/>[The next night, another mysterious expert sneaks in, attempting to attack Cheng Tianxin’s daughter, Cheng Qing Yu, but is unsuccessful.]<br/><br/>[Subsequently, Cheng Qing Yu takes over as the head of the Academy. A year later, she breaks through to the Third Rank of Martial Arts, becoming the youngest Third Rank worldwide, which shocks the world.]<br/><br/>[Another year passes, and emissaries from the desert tribes arrive in Divine<br/><br/>City, asking for the hand of the Unparalleled Princess on behalf of their Khan.<br/><br/>Their warriors boast in Divine City, sending a young martial artist to challenge the top talents of Great Zhou. In half a month, they defeat seven Third Rankers in a row.]<br/><br/>[Under pressure, Cheng Qing Yu steps up to confront them, but is seriously injured in the process.]<br/><br/>[That very day, Ling Ling takes you and leaves Divine City. A few days later, pursuers suddenly appear. Ling Ling leads them away, parting ways with you, with a promise to meet up in Ping County.]<br/><br/>[A month later, just as you arrive in Ping County, Shen Baiyi suddenly appears in front of you, killing you on the spot at the age of twenty-six.]<br/><br/>“This Shen Baiyi sure isn’t a good person.”<br/><br/>Having seen the end, Gu Yang was not overly surprised by the outcome.<br/><br/>This Shen Baiyi was full of unneeded courtesies, a common thief at best. The unexpected events of the previous two simulations must have something to do with him.<br/><br/>“And also, why is this simulation different from the previous ones?”<br/><br/>What puzzled Gu Yang the most was the changes in Tianxin Martial Academy.<br/><br/>In the previous two simulations, the Master Cheng Tianxin could not withstand more than ten moves and died of severe injuries on the very night.<br/><br/>However, this time, he upheld twenty moves and even had some strength left to repel a Third Rank expert.<br/><br/>His abilities had obviously improved greatly compared to before.<br/><br/>The same went for his daughter Cheng Qing Yu. She had astonishingly broken through to the Third Rank and managed to hold up the flag of Tianxin Martial Academy.<br/><br/>What differed this time from the last two was merely Ling Ling’s addition.<br/><br/>Thus, it could be said that the progress of Cheng Tianxin and his daughter must be related to her in some way.<br/><br/>[Simulation completed, you can retain one of the following.]<br/><br/>[First, Martial Arts Realm at age twenty-six.] [Second, Martial Arts experience at age twenty-six.]<br/><br/>[Third, Life wisdom at age twenty-six.]<br/><br/>Gu Yang chose the first one this time, which represented the cultivation of four years.<br/><br/>The next moment, he felt a great increase in his internal Qi, at least by fifty percent. But, his Qi had become more violent than before, making him feel a burning sensation in his meridians.<br/><br/>The extremely pure Pure Yang Qi had turned back into Sun’s Qi.<br/><br/>Gu Yang doubted that his body would be able to withstand such violent Qi once he broke through to the Fourth Rank.<br/><br/>He called, “Qingzhen, come here.”<br/><br/>Su Qingzhen had already finished her cultivation for the day. She walked over at his request, climbed into bed with practiced ease, sat cross-legged across from him, and held his hand.<br/><br/>Soon, she felt Gu Yang’s Qi pour into her body. However, it felt a little different from the usual, a lot more aggressive, and there was a prickling sensation of pain.<br/><br/>She kept her eyes shut, forcing herself to endure it.<br/><br/>After a while, the stinging sensation faded, replaced with a warm sensation as if she was about to melt..\t\t\t\t\t\t</div>", "images": {}, "success": true}