{"id": 39, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14254636.html", "title": "Chapter 39 - Chapter 39: 039 Even A Mosquito Is Meat", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 39 - Chapter 39: 039 Even A Mosquito Is Meat</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 39: 039 Even a Mosquito is Meat<br/><br/>Translator: 549690339<br/><br/>“What’s going on?”<br/><br/>Ling Ling looked at Gu Yang on the bed in surprise. Why had his True Qi suddenly surged?<br/><br/>The two of them were in the same room, only a few meters apart. The darkness posed no hindrance for a Fourth Rank martial artist. Any movement Gu Yang made would not pass unnoticed by her.<br/><br/>Just now, Gu Yang was sitting there, practicing as usual, without swallowing any elixir.<br/><br/>Besides, what kind of elixir could increase a person’s cultivation level exponentially in such a short period of time?<br/><br/>Gu Yang, oblivious to Ling Ling’s thoughts, was summarising the experience he’d gained from the simulation.<br/><br/>He had initially planned to break through to the Fourth Rank in one go, but it now seemed a bit challenging. He would need to overcome a few obstacles before achieving a smooth breakthrough.<br/><br/>Fifteen simulations might seem like a lot, but they consumed rapidly during use.<br/><br/>Gu Yang decided to first verify the authenticity of the treasure.<br/><br/>“At the age of twenty-two, you went to Yuzhou city with Ling Ling. On the way, you saved Jiao Shumo and obtained a treasure map. However, you were spotted by Cao Yiyi, which led to a conflict.”<br/><br/>“After returning to Pingjun City, you spent several months and finally figured out the location marked on the treasure map.”<br/><br/>“When Ling Ling went home to pay respect to her deceased mother, you went to the location on the treasure map. It was an old residence inside Jiangzhou city. You snuck in at night, discovered the entrance, only to find Cao Yiyi had beaten you to it.”<br/><br/>“Cao Yiyi’s attendant defeated and captured you. You immediately apologized to Cao Yiyi and begged for mercy. However, she looked disgusted and ordered her attendant to kill you. You died at the age of twenty-two.” As expected, obtaining the treasure wouldn’t be easy.<br/><br/>He had to pass the hurdle named Cao Yiyi.<br/><br/>Her attendant was a Fourth Rank martial artist. If it wasn’t for his quick reaction today, he probably would have ended up like this.<br/><br/>Jiao Shumo had divulged the details about the treasure.<br/><br/>He couldn’t blame him for it, though. Cao Yiyi’s allure was not something a sheltered young man like him could resist.<br/><br/>“It seems that to pass this hurdle, I either need to break through to the Fourth<br/><br/>Rank, or I have to bring Ling Ling with me.”<br/><br/>“Simulation ends. You can retain one of the following.” “One, your Martial Arts Realm at the age of twenty-two.” “Two, your Martial Arts experience at the age of twenty-two.”<br/><br/>“Three, your life wisdom at the age of twenty-two.”<br/><br/>“I choose three.”<br/><br/>Only a few months had passed, so neither the realm nor the experience was of great value. He needed the exact location of the treasure more.<br/><br/>In the next moment, Gu Yang’s mind filled with a new memory, the exact location of the treasure.<br/><br/>The location was in Jiangzhou city, in a courtyard located in a bustling area.<br/><br/>The Shadow thief had audaciously hidden the treasure in the middle of a big city – a masterpiece of hiding in plain sight.<br/><br/>However, entering the treasure site wasn’t easy. The place was booby-trapped.<br/><br/>The last memory was of him being captured and seeing Cao Yiyi’s triumphant face. The moment he begged for mercy, her face changed.<br/><br/>“So you’re just a spineless coward.”<br/><br/>She immediately ordered her subordinate to kill him.<br/><br/>This Cao Yiyi is a freaking lunatic!<br/><br/>Such was the life wisdom he gleaned from his simulated life.<br/><br/>“Again!”<br/><br/>“At the age of twenty-two, you headed to Yuzhou city with Ling Ling. On the way, you saved Jiao Shumo, obtained a treasure map, but bumped into Cao Yiyi, leading to a confrontation.”<br/><br/>“After returning to Pingjun City, you immediately went to Jiangzhou city with Ling Ling to search for the treasure. When you found the entrance at the courtyard, Cao Yiyi suddenly appeared.”<br/><br/>“Ling Ling blocked Cao Yiyi’s attendant, and you were about to capture Cao Yiyi when suddenly another person appeared and controlled you with one move. It was a Third Rank master who shocked Ling Ling into retreat.”<br/><br/>“You fell into Cao Yiyi’s hands, knowing that begging for mercy was useless, you chose to remain silent and waited for death. But Cao Yiyi did not kill you; she sealed your cultivation level and took you into the treasure room to introduce you to the treasures.”<br/><br/>“From then on, Cao Yiyi kept you by her side, entering and exiting together with you. She spoke to you with a gentle voice, her words filled with love and affection, becoming a seemingly loving couple.”<br/><br/>“Half a year later, you, who had lost your cultivation, gradually could not resist Cao Yiyi’s seduction. One night, you lost control and tried to hold her, only to be pushed away. Cao Yiyi then drew her long sword and pierced your heart. You died at the age of twenty-three.”<br/><br/>Was this woman poisoned?<br/><br/>Gu Yang felt a slight toothache. This was more than just a typical psycho.<br/><br/>The most difficult part was that she had a Third Rank master by her side.<br/><br/>It made sense, though. Given that her father was a man of Divine Power realm, how could he send just a Fourth Rank martial artist to protect her?<br/><br/>The only gain from all this was the confirmation that the treasure was still there.<br/><br/>The problem was that he would need at least the strength of the Third Rank to obtain it.<br/><br/>“Simulation ends. You can retain one of the following.” “One, your Martial Arts Realm at the age of twenty-two.” “Two, your Martial Arts experience at the age of twenty-two.”<br/><br/>“Three, your life wisdom at the age of twenty-two.”<br/><br/>It makes no difference which one he chooses.<br/><br/>In the end, Gu Yang chose the first one. He didn’t want to retain the memory of being constantly tempted by Cao Yiyi, eventually losing control, and being killed by a sword thrust.<br/><br/>It was too tragic.<br/><br/>His True Qi increased a bit more.<br/><br/>All that could be said was that every bit counts.<br/><br/>“It’s happening again!”<br/><br/>In the room, Ling Ling once again sensed a slight increase in Gu Yang’s True Qi. The increase was minute and could barely be detected unless she was closely monitoring him.<br/><br/>But it was an abnormal increase nonetheless.<br/><br/>Anyone in training should progress incrementally, even if they took elixirs, it would only increase their cultivation level bit by bit. A sudden and abrupt surge, however, was highly unusual.<br/><br/>“What kind of secret is he hiding?”<br/><br/>Ling Ling was intensely curious. After thinking for a while, she could only come up with a few rare Divine Items that were said to elevate one’s cultivation rapidly.<br/><br/>But it didn’t make sense. If Gu Yang genuinely possessed such Divine Items, she would have noticed after spending all these days with him.<br/><br/>No wonder he, with such mediocre talent, could possess such a high realm at his age!<br/><br/>Ling Ling thought to herself while continuing her observation without revealing her emotions..\t\t\t\t\t\t</div>", "images": {}, "success": true}