{"id": 31, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14254624.html", "title": "Chapter 31 - Chapter 31: 031 Finally Received The Leading Role Treatment", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 31 - Chapter 31: 031 Finally Received The Leading Role Treatment</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 31: 031 Finally received the leading role treatment<br/><br/>Translator: 549690339<br/><br/>When Gu Yang arrived in Tianmu City, a sloppy old man was roasting a wild rabbit over a fire in a broken temple on a desolate hill a few miles outside the city.<br/><br/>Suddenly, a black figure quietly appeared in the broken temple, crouching next to the old man, and asked concernedly, “Grandpa Er, did that Zheng kid give you trouble?”<br/><br/>From the sound of her voice, it was a young woman.<br/><br/>The old man didn’t even lift his head, keeping his eyes on the roasted rabbit in front of him. “If even a little fellow like that will give me trouble, it would mean I have lived my age in vain.”<br/><br/>The woman let out a sigh of relief, “Grandpa Er, you were in such a hurry to find me, I thought something had happened.”<br/><br/>“Indeed, something has happened.”<br/><br/>The old man chuckled, saying, “I have encountered someone with Pure Yang<br/><br/>“Really?”<br/><br/>The woman’s tone was filled with surprise, “Where’s this person?”<br/><br/>In this world, those who cultivate with the extreme Yang True Qi are not rare, and many forces have similar techniques.<br/><br/>But those with Pure Yang Qi are extremely rare.<br/><br/>She and Grandpa Er had been searching for nearly ten years, traveling all over Great Zhou, even venturing far into the desert, westward, and the Eastern Sea Islands, but they couldn’t find a single person with Pure Yang Qi.<br/><br/>Pure Yang, the key is in the word ‘pure’, which is almost innate.<br/><br/>There are many types of Yang techniques in the world, but the True Qi cultivated by fleshly bodies will inevitably be tainted.<br/><br/>Unless it is the legendary Pure Yang Body. But this physical constitution is hard to find.<br/><br/>Now, Grandpa Er had finally found a person with Pure Yang Qi. How could she not be surprised?<br/><br/>Immediately after, she became anxious again, “What’s this person’s cultivation level? It’s not the Divine Power Realm, is it?”<br/><br/>Reaching the Divine Power Realm was as easy as shedding one’s mortal coil and returning to the innate, cultivating Pure Yang Qi.<br/><br/>The existence of the Divine Power Realm was meaningless to her.<br/><br/>The old man said with conviction, “I have not gone senile, the person seemed to be in his early twenties, with a Fifth Grade Cultivation Level.”<br/><br/>The woman was shocked, “Fifth Grade? How is that possible?”<br/><br/>The lower the realm, the poorer the purity of True Qi. It is almost impossible for someone in the Fifth Grade Realm to polish True Qi to the Pure Yang state.<br/><br/>The old man sighed, “This youngster is indeed blessed. If I’m not mistaken, he should be practicing the ‘Sun’s Red Technique’, and he is accompanied by a woman of icy skin and jade bones.”<br/><br/>“So that’s why Su Qingzhen is with him, I see.”<br/><br/>The woman realized.<br/><br/>Icy skin and jade bones is a pure yin constitution that comes once in hundreds of years.<br/><br/>This constitution is an excellent furnace for martial artists who practice extremely yang techniques like the ‘Sun’s Red Technique’ and the Great Sun True Method. It can transform their True Qi into Pure Yang.<br/><br/>That’s why Su Qingzhen was targeted as soon as she appeared on the Beauty list, which led to the destruction of her family and her disappearance. The woman said resentfully, “This Beauty list is really harmful. One day, I will tear down that Red Mansion.”<br/><br/>At this point, the old man saw the wild rabbit was finally roasted and tore off a piece, eating it happily, his mouth full of oil. He said while eating, “You better think about how to approach that man.”<br/><br/>“Don’t worry, I have a plan.” The woman confidently said.<br/><br/>Meanwhile, after Gu Yang finished charging, he returned directly to the inn and shut the door.<br/><br/>Su Qingzhen was still practicing, as if she was racing against time, while her maid Zhi Xing was guarding her as usual.<br/><br/>Gu Yang didn’t disturb them and entered the inner room. He sat down on the bed and opened the system.<br/><br/>[Do you want to use the Life Simulator? One use consumes 2000 money.]<br/><br/>“Yes.”<br/><br/>[At the age of twenty, you were already a Fifth Grade martial artist. In Tianshui<br/><br/>City, you rejected Lin Zirui’s invitation to join him. Five days after leaving Tianshui City, you encountered the swordsman Zhou Qing. You killed him with one stroke.]<br/><br/>[You took Su Qingzhen and continued onto Ping County. On the way, you met a pretty woman selling herself by the roadside to bury her father. You took one look and left.]<br/><br/>[Another day, you were in Tianqing City and a woman jumped onto the arena, proposing a martial contest for a marriage proposal. You didn’t even look and left directly.]<br/><br/>[Finally, you arrived at Ping County City. Su Qingzhen kept her promise and took you to the money house, exchanging for a bill of thirty thousand taels of silver. She then went to Qingxuan Sect. You settled down in Ping County City.]<br/><br/>[One night, a month later, a woman wearing night walking clothes broke into your yard and fainted in front of you. You found it suspicious, threw her out of the house, and then went back inside.]<br/><br/>[Another month passed, you planned to go back to Lian Mountain to visit the people of Liu Village. In the wilderness, you inadvertently saw a beautiful woman bathing in the river.]<br/><br/>[You were just about to leave when the woman, dressed in light gauze, appeared in front of you, a sword held at your throat. She gave you two options – either marry her or die under her sword.]<br/><br/>[This woman had a Fourth Grade cultivation level, you were no match for her and had to submit.]<br/><br/>[You and the woman named Ling Ling returned to Ping County City. After a simple wedding, you became husband and wife. That night, she left you with the complete technique of ‘Sun’s Red Technique’, saying that she was being hunted down by her enemies. To avoid implicating you, she had to leave your side. After breaking through to the Fourth Grade, she would come back for you. Then she disappeared.]<br/><br/>[At the age of twenty-three, one night, a wounded Su Qingzhen escaped to your house. Liu Family attacked Qingxuan Sect, and she managed to escape in the chaos. You took her to the Qingxuan Sect and killed all members of the Liu Family.]<br/><br/>[You took Su Qingzhen and survived Qingxuan Sect’s disciples and left Ping<br/><br/>County City. The next day, you unexpectedly encountered Shen Baiyi of the<br/><br/>Shen Family on the road. He voluntarily struck up a conversation with you.]<br/><br/>[After parting ways with Shen Baiyi, five days later, you encountered a lone bandit. After a fight, you were severely injured. Just in time, Shen Baiyi arrived and repelled the bandit, saving you all.]<br/><br/>[You were unconscious from serious injuries, Su Qingzhen was also not lightly injured, Shen Baiyi promised to heal you. With no other choice, you had to follow him to Xiang County. Shen Baiyi was going to challenge Liu Zhe.]<br/><br/>[After arriving in Xiang County, one night out of nowhere, you were attacked by an assassin. Just when you were about to be killed, your wife Ling Ling arrived in time and saved you, taking you away from there.]<br/><br/>[Ling Ling had thus exposed herself, a few days later, her enemy chased after her. It was a Third Rank powerhouse. You both had nowhere to escape and died in Yellow Springs. You died at the age of twenty-three.]<br/><br/>After reading the last line, Gu Yang couldn’t help but become stunned.<br/><br/>This simulation was considerably short, he only lived for twenty-three years, just one year.<br/><br/>Yet so many things have happened during that one year, more than any previous simulation.<br/><br/>Especially that Ling Ling. What was her deal?<br/><br/>She appeared out of nowhere and wanted to marry him out of the blue.<br/><br/>Could this be the legendary peach blossom luck?<br/><br/>This Ling Ling, of mysterious origin and with powerful strength, and even more formidable enemies…<br/><br/>This was indeed a treatment worthy of a protagonist.<br/><br/>Pity he doesn’t have the protagonist’s luck, with less-than-fortunate outcomes..\t\t\t\t\t\t</div>", "images": {}, "success": true}