{"id": 36, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14254630.html", "title": "Chapter 36 - Chapter 36: 036 Found It", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 36 - Chapter 36: 036 Found It</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 36: 036 Found it<br/><br/>Translator: 549690339<br/><br/>In the decaying temple, Jiao Shumo stared at the six men before him with a gaze filled with hatred, as if desiring nothing more than to drink their blood and flay their skin.<br/><br/>Before today, he had a happy and well-off family.<br/><br/>The Jiao family, in the town, was also a martial arts family. It had been passed down for more than two hundred years, with an ancestor who had once been a Third Rank martial artist. It was unclear why they had decided to settle in this small town.<br/><br/>By this generation, the Jiao family was mediocre at best, better off compared to others.<br/><br/>His father was of the sixth grade. Jiao Shumo himself was exceptionally gifted. Being only eighteen, he had already attained the seventh grade cultivation level. He was viewed as the hope for the family’s rejuvenation.<br/><br/>Until last night, everything was gone.<br/><br/>These six men, good friends of his father, were his house guests a few days ago. During last night, they accidentally discovered a secret room in the Jiao’s house, where a treasure map left by the ancestors was hidden.<br/><br/>It was this treasure map, that led to his family’s ruin.<br/><br/>His father discovered the secret room was opened and demanded the six men return the treasure map. The moment he took back the map, they attacked him, wounding him severely on the spot.<br/><br/>His father, despite severe injuries, managed to escape and handed him the treasure map, urging him to flee.<br/><br/>At this point, the six men caught up, his mother attempted to stop them and was killed on the spot.<br/><br/>Jiao Shumo fled, but they chased him down.<br/><br/>He was no match for the six men. The only reason they hadn’t killed him was because they wanted to force him to reveal the location of the treasure map.<br/><br/>“Want the treasure map? In your dreams!”<br/><br/>Jiao Shumo knew he was doomed, he didn’t want to endure their torture, without any hesitation, he moved his long sword towards his own neck.<br/><br/>“Stop!”<br/><br/>The faces of the six men all turned pale, and they cried out in alarm.<br/><br/>Just then, a figure appeared beside Jiao Shumo, grabbing the sword from his hand, saving him from death.<br/><br/>The six men all held a certain fear in their hearts towards this sudden appearance of a person.<br/><br/>The man had a piece of cloth covering his face, showing only his eyes. The clothes on his body were the most common type.<br/><br/>The problem was, no one saw how he appeared so suddenly, indicating his skills far surpassed theirs.<br/><br/>The most astounded was Jiao Shumo himself. He had resolved to die, but never expected that someone would appear out of nowhere and save him. He turned his head and saw a pair of eyes as calm as water.<br/><br/>“Do you hate them?”<br/><br/>A magnetic voice rang in his ears.<br/><br/>Hate? More than that.<br/><br/>“Give me the treasure map, and I’ll kill them all for you. How about it?” Upon hearing these words, Jiao Shumo without any hesitation said, “Alright.”<br/><br/>Before he agreed, the faces of the six men changed drastically, and they scattered to escape.<br/><br/>As soon as his words fell, the mysterious man beside him disappeared, pursuing them like a ghost. He dispatched each one with a single swing of his sword, and before they could even escape from the dilapidated temple, all six fell.<br/><br/>Then, the mysterious person reappeared by his side as if he hadn’t moved at all.<br/><br/>In merely a few breaths, the six men who had murdered his parents were laying dead in pools of their blood.<br/><br/>Jiao Shumo was in complete disbelief, unreceptive to the reality.<br/><br/>“I’ve killed the people. Where is the thing?”<br/><br/>Only when the mysterious man’s voice reached his ears, was he jolted back into reality. He knelt down quickly and said, “You’ve avenged a great enmity for me. This kindness and virtue, I will never forget.”<br/><br/>“This was just a transaction. Give me what I want and we’re square.”<br/><br/>Jiao Shumo raised his head hesitantly and said, “I threw the thing into the lake. If we want to find it, I am afraid we will have to put in some effort.”<br/><br/>“Lead the way.”<br/><br/>The lake Jiao Shumo spoke of was not far outside the town.<br/><br/>By the time the two arrived at the lake, it was already daylight.<br/><br/>“It’s here. I will go and find it.” Jiao Shumo found the place where he threw the treasure map. He took off his outer clothes and dived into the water.<br/><br/>Gu Yang stood by the lake waiting, looking at the lake’s surface.<br/><br/>This young man was not very powerful. He was not worried about any tricks. He could afford to wait this little while.<br/><br/>Just then, he heard footsteps not far behind him. In a flash, he hid behind a tree by the lake.<br/><br/>A delicate voice came from a distance, “Young Master Liu, is this the Fairy Lake you were talking about? It doesn’t look very special.”<br/><br/>“Miss Cao, you may not know. This Fairy Lake has a beautiful legend..<br/><br/>Following that, there was the sound of rapid hoofbeats. The anxious voice of another man came, “Miss Cao, why did you leave without saying goodbye? Was it Liu Ze who forcefully took you away?<br/><br/>The delicate voice said, “Young Master Liu, what should we do? He’s catching up.”<br/><br/>“Don’t worry. As long as I’m here, no one can hurt you.” The previous man said, raising his voice, “Zhang An, Miss Cao has already rejected you numerous times, why do you still pester her?”<br/><br/>“Rubbish! It must be you who has schemed. Liu Ze, leave right now, else don’t blame me for being rude.”<br/><br/>“Humph, do you really think I’m afraid of you?”<br/><br/>Then, there was the sound of weapons clashing.<br/><br/>Gu Yang frowned. He stumbled upon a classic love triangle. Judging from the sounds of their fight, both men were at the seventh grade of cultivation.<br/><br/>Soon, with a scream, a winner was decided amongst the two.<br/><br/>“They’ve actually caused a death.”<br/><br/>Gu Yang’s eyebrows furrowed deeper. Although he couldn’t see from his location, he could hear the sound of a weapon piercing flesh, probably a fatal blow to the abdomen.<br/><br/>“Miss Cao, I’ve killed this… He won’t bother you ever again…”<br/><br/>This voice belonged to Liu Ze, apparently the victor. His voice trembled slightly, either out of excitement or fear.<br/><br/>The previous woman’s voice turned icy cold, “Zhang An was your friend from childhood. Today you ruthlessly killed him for me. This type of merciless and unrighteous act is disgusting. Get out, I never want to see you again.”<br/><br/>Liu Ze said in disbelief, “Cao…Miss, I… I did it for you…”<br/><br/>“Today you can kill a good friend for me. What makes you think you won’t kill me for another woman in the future?”<br/><br/>“How could I possibly do that? My feelings for you are as clear as the sun and the moon…”<br/><br/>“How can you prove it?”<br/><br/>“Miss Cao, I… I wish I could cut open my chest to show you my heart…”<br/><br/>“Alright, cut open your chest now and I’ll believe you.<br/><br/>“Huh?”<br/><br/>“What, you don’t want to? Let me help you.”<br/><br/>A piercing sound.<br/><br/>“Really ugly. ”<br/><br/>At the end, the woman’s disdainful voice.<br/><br/>Then, there was silence.<br/><br/>Gu Yang, hiding behind the tree, was stunned after hearing these conversations. He never thought that the situation would end like this.<br/><br/>The genre has suddenly changed from melodramatic romance to thrilling mystery.<br/><br/>The change was too sudden and intense. He was taken aback.<br/><br/>Just then, a splashing sound was heard. Jiao Shumo’s head emerged from the water as he excitedly said, “I’ve found it..”\t\t\t\t\t\t</div>", "images": {}, "success": true}