{"id": 30, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14254623.html", "title": "Chapter 30 - Chapter 30: 030 The Number One Martial Academy In The World", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 30 - Chapter 30: 030 The Number One Martial Academy In The World</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 30: 030 The Number One Martial Academy in the World<br/><br/>Translator: 549690339<br/><br/>Zheng Anyu instantly noticed the oddity of the elderly man, and hurriedly asked, “What’s wrong, sir?”<br/><br/>The elder continued to munch on the roast chicken in hand, mumbling something under his breath, “Fifth Grade.”<br/><br/>Fifth Grade?<br/><br/>Overwhelmed by surprise, Zheng Anyu followed the elderly man’s gaze and saw a young man who seemed entirely unremarkable stepping down from a coach carriage in front of them. Could he really have a Fifth Grade Cultivation Level?<br/><br/>The man looked to be in his early twenties.<br/><br/>At this age, with such a cultivation level, he would certainly be a core disciple of some noble house or sect.<br/><br/>Even within Zheng’s family, there was no one of his generation who stood out as much.<br/><br/>The presence of such a person in Xiang County was no small matter.<br/><br/>Why hadn’t he received any news in advance?<br/><br/>Zheng Anyu closely observed the man and found no clue about his origins, neither in the carriage he arrived in nor the clothes he wore.<br/><br/>Usually, descendants of noble families and sect disciples will carry distinctive objects or symbols when they travel for training, making their conduct somewhat easier.<br/><br/>However, this young man bore no such markings. His origins remained a mystery.<br/><br/>“Zhou Qing is here for him!”<br/><br/>Zheng Anyu understood at the same time, feeling somewhat uneasy.<br/><br/>He finally understood what the old man meant when he said it was better not to watch the spectacle unfolding before them.<br/><br/>The Lin Family sent Zhou Qing to kill this unknown Fifth Grade Martial Artist, surely not wanting anyone to know about it. Now, however, he had witnessed it unexpectedly.<br/><br/>Would they try to silence him too?<br/><br/>Thinking this, Zheng Anyu’s heart began to dread.<br/><br/>However, knowing that he had a senior by his side, he managed to calm down.<br/><br/>“With the elder here, there should be no danger.”<br/><br/>“Fifth Grade?”<br/><br/>After descending from the carriage, Gu Yang began to stride towards Zhou Qing. Sensing Gu Yang’s aura, Zhou Qing raised his head slightly, sounding surprised.<br/><br/>According to the information he received, his target is supposed to have a Sixth Grade Cultivation Level.<br/><br/>Without offering any response, Gu Yang simply drew a knife in silence.<br/><br/>It was a common woodcutting knife, with only the blade having been polished shiny. Several small notches could be seen.<br/><br/>He looked at Gu Yang, identical to the image he saw, confirming he got the<br/><br/>right man. He opened his mouth and asked, “You plan to fight with that knife?”<br/><br/>“It’s enough to kill you.”<br/><br/>No sooner had he spoken than the man’s aura abruptly shifted, and a slash came heading towards him.<br/><br/>Instantly, all Zhou Qing could see was the blade before his eyes, nothing else mattered.<br/><br/>This is—<br/><br/>His eyes narrowed as a look of horror flashed across his face.<br/><br/>Blade Intent!<br/><br/>An unparalleled Blade Intent crashed against his spirit, overpowering his mind with an irresistible sense of fear.<br/><br/>By the time Zhou Qing gathered his senses, the blade was already before his eyes.<br/><br/>Blood sprayed forth.<br/><br/>His own sword had barely left the sheath.<br/><br/>With a thud, Zhou Qing fell to the ground, his vision overwhelmed with a vivid crimson. His last sight was of the young man shaking the blood off his blade before abruptly turning to head back towards the carriage.<br/><br/>Zhou Qing opened his mouth as if trying to say something, but not a sound came out. A moment later, he drifted into endless darkness.<br/><br/>Inside the Zheng family’s carriage, Zheng Anyu was dumbfounded. He had witnessed the youth strike down Zhou Qing as though it were child’s play.<br/><br/>For a moment, he thought he was hallucinating.<br/><br/>Zhou Qing, a covert agent of the Lin Family based in Xiang County, was a thorn in the side of the Zheng family, tasked with carrying out tasks that could not be seen in the light of day. The Zheng family had previously attempts to kill him, despite paying a heavy price to hire a solo Fifth Grade Martial Artist, but had still been defeated by Zhou Qing.<br/><br/>Zhou Qing was not to be underestimated. None of the Fifth Grade members of the Zheng family felt they could handle him.<br/><br/>As for the Fourth Grade members, there were only a few in the Zheng family. If they made a move, the Lin family would undoubtedly find out, leading to even more trouble.<br/><br/>Such a thorn in the Zheng family’s side was now slashed down by a single blade!<br/><br/>Zheng Anyu stared at Zhou Qing’s body, lying in a pool of blood, and once he was sure Zhou Qing was dead, he swallowed hard.<br/><br/>“S… Sir, what was that… Saber Technique?”<br/><br/>The old man beside him trembled as he handled his roast chicken, dripping chicken oil onto his clothes without noticing. After a while, he murmured,<br/><br/>“Duan Yue Knife Technique.”<br/><br/>Duan Yue Knife Technique?<br/><br/>Zheng Anyu carefully recalled, and finally gasped out the words, “Tianxin Martial Arts Hall!”<br/><br/>Tianxin Martial Arts Hall, known as the world’s number one Martial Academy.<br/><br/>The legendary journey of its headmaster, Cheng Tianxin, was well known. Starting from a humble background, he cultivated the “Xuan Yuan Method” and achieved the Second Rank Realm.<br/><br/>After achieving fame, Cheng chose not to align with any power, instead founding the Tianxin Martial Arts Hall. He did not care about his disciples’ backgrounds but only selected based on talent. As long as they had talent, they could learn advanced methods in his academy.<br/><br/>In twenty years, Cheng successfully cultivated three Third Rank Martial<br/><br/>Artists, nearly ten of the Fourth Rank, and countless Fifth and Sixth Ranks.<br/><br/>To countless children of poor families, Tianxin Martial Arts Hall was undoubtedly a sacred place for Martial Arts.<br/><br/>Jiangzhou was quite far from Divine City. Zheng Anyu had only heard about this world’s number one Martial Arts Hall.<br/><br/>As far as he knew, there had not been a disciple of the Tianxin Martial Arts Hall who had ever traveled to Xiang County.<br/><br/>Zheng Anyu was in a quandary about whether to step forward or not.<br/><br/>Most disciples of Tianxin Martial Arts Hall came from low-ranking families and were known for their hostility towards nobles.<br/><br/>While he was hesitating, someone from the carriage in front of him got down, buried the body of Zhou Qing by the roadside, and then proceeded on his journey.<br/><br/>“I guess I better not,” he finally decided.<br/><br/>Zheng Anyu didn’t want to get involved in any struggle between the Tianxin Martial Arts Hall and the Lin Family. Both forces were way above his family’s level.<br/><br/>That night, the Zheng family arrived in a small town. To avoid the disciple from Tianxin Martial Arts Hall, they deliberately slowed down their pace.<br/><br/>Zheng Anyu finalized the arrangements and personally served food to the elder in the carriage. When he opened the coach’s door, the elder was nowhere to be found.<br/><br/>On the seat, only a torn piece of fabric remained bearing hastily written words.<br/><br/>He sighed, realizing that the elder had left them after all.<br/><br/>Moreover, he had a feeling that the elder had probably gone after that disciple from Tianxin Martial Arts Hall.<br/><br/>In the end, as he looked at the piece of cloth, he thought to himself, “At least it’s not a total loss.”<br/><br/>Just a few miles away was a bustling city named Tianmu City.<br/><br/>Gu Yang and his group had arrived there in the evening. After settling Su Qingzhi and the others, he went to the Four Sea Bank in the city alone, to transform the four thousand taels worth silver note he got from Dong Xuan into actual silver.<br/><br/>He also presented the silver notes he got from Su Qingzhi, only to be informed that those could only be exchanged with the corresponding password.<br/><br/>So, Su Qingzhi did not lie to him.<br/><br/>After getting the money, Gu Yang found a secluded spot and transferred the money into his system. Seeing his balance increase to over four thousand, he felt a sense of security.<br/><br/>With money, he could become stronger.<br/><br/>Now, he could simulate his life twice more and reach a higher level of strength.<br/><br/>PS: Requesting recommendation votes on Monday..\t\t\t\t\t\t</div>", "images": {}, "success": true}