{"id": 37, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14254632.html", "title": "Chapter 37 - Chapter 37: 037 Thousand Charms And Hundred Beauties", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 37 - Chapter 37: 037 Thousand Charms And Hundred Beauties</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 37: 037 Thousand Charms and Hundred Beauties<br/><br/>Translator: 549690339<br/><br/>“Someone is coming, quickly toss me the thing.”<br/><br/>Gu Yang said to Jiao Shumo, who was in the water.<br/><br/>“Okay.”<br/><br/>Jiao Shumo threw the soaked treasure map towards the shore.<br/><br/>After Gu Yang caught it, he opened it and looked at it. The map was made of some kind of hide. It depicted some landscapes, and at the bottom, there was a peculiar mark.<br/><br/>The map seemed rather old.<br/><br/>On the way here, Jiao Shumo had mentioned that before this, he had not known about this treasure map in his family. He only learned about it from the six men who had murdered his father, who said it was one of the nine treasure maps left behind by the Shadow thief.<br/><br/>Gu Yang tucked the treasure map into his chest.<br/><br/>At this point, two figures appeared by the lake, a man and a woman.<br/><br/>The woman questioned, “What are you two sneakily doing here?”<br/><br/>Gu Yang turned his head around and saw a young girl dressed in pink, his heart was involuntarily amazed.<br/><br/>Among all the women he had encountered, only Su Qingzhen could rival her in beauty.<br/><br/>But they had markedly different temperaments.<br/><br/>Su Qingzhen was cold, giving off an inaccessible aura.<br/><br/>The one in front of him was soft and charming, her every movement, every frown and smile, possessed an indescribable allure, stirring his primal inclinations.<br/><br/>“Could she be an enchantress from the demon sect?”<br/><br/>Gu Yang felt a strange stirring in his heart and immediately felt alarmed.<br/><br/>He left a remark, “I take my leave.” and was about to depart.<br/><br/>The girl saw that he was disregarding her, which annoyed her. She ordered,<br/><br/>“Ah Fu, don’t let him escape.”<br/><br/>The man in grey clothes behind her immediately lunged at Gu Yang with astonishing speed.<br/><br/>Fourth rank!<br/><br/>Gu Yang instantly gauged his opponent’s strength and was taken aback. Determined not to get embroiled in a close quarters fight, he twisted around and flung out the long knife in his hand, targeting the girl.<br/><br/>Whoosh!<br/><br/>Upon seeing the path of the flying knife, the colour drained from the man in grey’s face. In mid-air, he twisted his body and threw something at it.<br/><br/>With a metallic clang.<br/><br/>After being hit by the object, the knife changed its trajectory and flew past the girl by a hairsbreadth, embedding itself in a large tree behind her.<br/><br/>Throughout this process, the girl did not react. Only when the grey-clothed man landed next to her did she seem to become aware of just how close she had come to death.<br/><br/>Her face turned as white as a sheet, and she pointed with a trembling hand at the knife firmly lodged in the tree trunk. “He…he dared to…” If Ah Fu had reacted even a moment slower, she would be dead.<br/><br/>The masked man had ruthlessly tried to kill her.<br/><br/>The man in grey fell to his knees in terror, “Miss, Ah Fu was inadequate in his duties. Please punish me.”<br/><br/>With that delay, the masked man was long gone.<br/><br/>The girl suddenly looked at Jiao Shumo in the lake and ordered, “Bring him up here.”<br/><br/>Since the girl appeared, Jiao Shumo was stupefied, so much that he forgot to leave the chilly lake water.<br/><br/>Having grown up in a small town, he had never seen such beautiful women, she seemed like a celestial fairy, and momentarily, he couldn’t help but gaze at her in amazement.<br/><br/>When he saw her facing the danger, his heart tightened, his body breaking out into a cold sweat.<br/><br/>Right now, seeing the girl looking at him, and even talking to him, he hurriedly replied, “I will come up by myself.”<br/><br/>He flipped himself and crawled onto the shore.<br/><br/>The girl saw the young man gazing at her infatuatedly. She was accustomed to such glances, so her face softened, and she asked, “Who was that man just now?”<br/><br/>Jiao Shumo saw the girl’s gentle demeanor and was somewhat flattered. “I don’t know, I don’t recognize him either.”<br/><br/>The girl’s expression turned cold, “You’re lying. I clearly saw you hand him something. How could you not know him?”<br/><br/>Seeing the girl seemingly angry, Jiao Shumo was anxious and quickly clarified,<br/><br/>“I truly don’t know him. Last night he saved my life but didn’t leave his name.”<br/><br/>“So what was it that you handed him just now?”<br/><br/>“Well…”<br/><br/>“Are you unwilling to tell me even this much?”<br/><br/>Jiao Shumo had never been subject to such a sweet and gentle voice. He felt his bones becoming weak, and in an impulse, he blurted out, “It was a treasure map passed down in my family.”<br/><br/>The girl’s eyes lit up slightly, “A treasure map? Can you elaborate further, Sir?”<br/><br/>Jiao Shumo explained the whole story and then drew a copy of the treasure map for her.<br/><br/>He had a perfect memory, remembering the map as if it were etched into his mind.<br/><br/>After getting the copy of the treasure map, the girl turned to her attendant and said, “Let’s go.”<br/><br/>Seeing her about to leave, Jiao Shumo felt an intense sense of loss, “Miss, where are you going?”<br/><br/>The girl replied coldly, “What does it matter to you?”<br/><br/>Jiao Shumo was stunned. He hadn’t expected her to change so quickly. Just a moment ago, she was engaging in pleasant conversation with him, and now she had changed face.<br/><br/>“The man saved your life, and you turn around and betray him. Such ingrates should keep their distance from me.” After the girl finished, she left. Jiao Shumo stood there dumbstruck as if he had been struck by lightning.<br/><br/>“Phew-<br/><br/>On the other side, Gu Yang had already run quite far. Seeing that no one pursued him, he finally sighed in relief.<br/><br/>It’s a good thing that he could run fast. Otherwise, it would have been more trouble. He shouted out, “Ling Ling?”<br/><br/>“I’m here.”<br/><br/>A figure jumped out from the side, it was Ling Ling, who wore a mask.<br/><br/>The two had previously agreed that Gu Yang would show himself while she would remain hidden, providing support from the side.<br/><br/>Gu Yang asked, “Who was that woman just now? She even had a fourth-ranking bodyguard?”<br/><br/>Ling Ling replied, “Her surname is Cao. She’s astoundingly beautiful. She should be Cao Yiyi, ranked tenth on the Beauty list.”<br/><br/>Gu Gu Yang had a deep impression of this name, having died twice in the Simulated Life due to her.<br/><br/>“Who is she?”<br/><br/>“She’s the daughter the-ranked Cao family, one of the top ten clans. She’s the only child of the Spear Saint.”<br/><br/>Gu Yang was shocked, “A child of a Divine Power realm powerhouse?”<br/><br/>Although he didn’t know who the Spear Saint was, anyone given the title “saint” would undoubtedly be a powerhouse in the Divine Power realm. So, this person’s background was seriously formidable.<br/><br/>Ling Ling warned, “Exactly. This girl is quirky, narrow-minded, and since you’ve offended her, she probably won’t let you off easily.”<br/><br/>Gu Yang thought about how Cao Yiyi acted. It was not only that she was quirky, she was downright mentally disturbed.<br/><br/>Stirring up trouble with such a crazy woman was just bad luck.<br/><br/>It seemed that, as always, good things didn’t come easy. Finally, when he managed to get a hold of a treasure map, he still encountered more trouble.<br/><br/>Fortunately, he had the foresight to mask his face. As long as he stayed out of sight, he shouldn’t be recognized.<br/><br/>Gu Yang suddenly thought of something, “You said ‘Charming beyond measure’ earlier. Was that her nickname?”<br/><br/>Ling Ling nodded, “Each woman who makes it onto the Beauty list is given a nickname. For example, Su Qingzhen who is ranked thirteenth, her nickname is ‘Icy skin, jade-like bone’.”<br/><br/>Gu Yang thought of the Xuan Yin energy in Su Qingzhen’s body, he had a hunch, “Does this nickname have any special significance?”<br/><br/>Unable to hold back anymore, Ling Ling inquired, “Why don’t you even know such basic knowledge?”\t\t\t\t\t\t</div>", "images": {}, "success": true}