{"id": 33, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14254626.html", "title": "Chapter 33 - Chapter 33: 033 Surrendering In A Deceptive Manner", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 33 - Chapter 33: 033 Surrendering In A Deceptive Manner</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 33: 033 Surrendering in a deceptive manner<br/><br/>Translator: 549690339<br/><br/>Three days later, around dusk, as the carriage was nearing a small town, a sudden bout of crying could be heard from the roadside.<br/><br/>The carriage came to a halt accordingly, Zhang Xiao Hai, who was driving from the outside, spoke, “Young Master, the road is blocked by someone.”<br/><br/>Gu Yang, engrossed in a book, frowned upon the interruption and wondered to himself, “Could it be her?”<br/><br/>He put the book down and peered beyond the curtain of the carriage to see a woman dressed in mourning clothes kneeling next to a corpse on the road ahead. There were four characters written on the ground: “Sell oneself for a father’s burial.<br/><br/>The woman was extremely beautiful, not quite at the level of Su Qingzhen, but nonetheless, a rare beauty.<br/><br/>Someone of her looks showing up here in the middle of nowhere to sell herself for a father’s burial, anyone would find that suspicious.<br/><br/>Zhang Xiao Hai quietly voiced his doubts, “Young Master, there might be something wrong with this woman.”<br/><br/>Even Zhang Xiao Hai could perceive something was off — who was she trying to fool?<br/><br/>Gu Yang nodded his head, then stepped out of the carriage and walked towards the woman, asking, “What is your name?”<br/><br/>The woman raised her head revealing a tear-streaked face with delicate skin, and sobbed, “1- I am Ling Ling. My father passed away unexpectedly from illness. I have spent it all on his medical treatment and now…l can’t even afford a decent burial…”<br/><br/>Her crying seemed somewhat insincere.<br/><br/>Inwardly, Gu Yang sneered, yet he played along and sighed, “Such a pitiful situation. Xiao Hai, go to town tomorrow and buy a casket and bury him. May his soul rest in peace.”<br/><br/>Zhang Xiao Hai seemed to have some reservations, but said nothing and simply replied, “Yes.”<br/><br/>Ling Ling prostrated herself in gratitude and sobbed, “Thank you, kind sir, for your great kindness and philanthropy, I won’t forget it for the rest of my life.”<br/><br/>Gu Yang replied, “It’s merely a helping hand, no need to overthink it. Do you have any other relatives, miss?”<br/><br/>Ling Ling replied sorrowfully, “No, I am unfortunate. There’s no one else left in my family.”<br/><br/>That final sentence seemed sincere.<br/><br/>Gu Yang took out a bag of silver from his pocket, saying, “Take this money, go back home and start a small business.”<br/><br/>At this, Ling Ling pleaded, “Kind sir, please let me stick with you, I have nowhere else to go…”<br/><br/>After some initial hesitations, Gu Yang agreed, “Very well, you can stay with me as a maid.”<br/><br/>In the carriage, both Su Qingzhen and the servants listened to the exchange, somewhat taken aback.<br/><br/>They couldn’t help but recall the first time they’d met with Gu Yang — he was brusque towards them from the start.<br/><br/>He had abruptly dragged them into a well without showing the slightest bit of chivalry towards women.<br/><br/>Even after he saved Su Qingzhen, the moment he saw danger, he would abandon them without hesitation.<br/><br/>Now, in the case of this suspicious woman selling herself for a father’s burial, not only did he willingly assist with the burial of her father, he even generously provided her money.<br/><br/>The difference in treatment between them was too stark to comprehend.<br/><br/>At this point, Gu Yang had already brought Ling Ling over and introduced her, “This is Qingzhen, she is my maid. This is Zhi Xing, Qingzhen’s servant. This is<br/><br/>Ling Ling, she is my new maid.”<br/><br/>Ling Ling bowed politely to Su Qingzhen, “I look forward to learning from you, sister Qingzhen.”<br/><br/>Su Qingzhen coldly returned the gesture.<br/><br/>The carriage wasn’t very big. It was fine with three people, but with an additional person, it was somewhat cramped. Nevertheless, it wasn’t a big problem.<br/><br/>The carriage continued its journey while Zhang Xiao Hai stayed behind, carrying the body of Ling Ling’s “father”.<br/><br/>Upon reaching the small town, as usual, they found a household to lodge at for the night.<br/><br/>Zhang Xiao Hai left the corpse at a charitable burial ground.<br/><br/>With an addition to their team, the atmosphere became odd. Whether it was Zhang Xiao Hai or Su Qingzhen and her servant, they all held deep caution towards Ling Ling, the girl with an uncertain origin.<br/><br/>They all failed to understand why the normally indifferent Gu Yang treated Ling Ling differently.<br/><br/>The only possible explanation was that Gu Yang was captivated by her beauty.<br/><br/>Zhang Xiao Hai wanted to advise Gu Yang, but didn’t know how to begin. He felt conflicted and could only covertly watch Ling Ling’s every move, always on the alert.<br/><br/>During their evening wash, the junior maid Zhi Xing seized the opportunity to pull her mistress Su Qingzhen aside, anxiously saying, “Miss, that Ling Ling’s behavior is very strange. I fear she means to get close to Brother Gu for ill intentions. We have to find a way to warn him.”<br/><br/>Although she was still angry at Gu Yang for wanting her mistress to become his servant, faced with this situation, she couldn’t help but worry about him.<br/><br/>Su Qingzhen, expressionless, replied, “Even if he’s being played by that woman, he deserves it for being led by his desires!”<br/><br/>Having said that, she turned and walked away, leaving Zhi Xing without a chance to retort.<br/><br/>Zhi Xing stomped her feet in frustration.<br/><br/>Finally, she had to do it by herself. Taking advantage of Ling Ling not being in the room, she approached Gu Yang and warned, “Brother Gu, that Ling Ling is quite suspicious. Please be careful.”<br/><br/>Gu Yang responded with a smile, “I thought you weren’t going to speak to me anymore.”<br/><br/>This girl remained stubborn. Ever since Su Qingzhen became his servant, she hadn’t voluntarily spoken to him.<br/><br/>In a rush, Zhi Xing said, “What if she poses a danger to you…”<br/><br/>Rest assured, she means me no harm.” Gu Yang reassured her.<br/><br/>At least, not in the short term.<br/><br/>If Gu Yang had a choice, he would want to stay as far away from Ling Ling as possible. The problem was, he couldn’t avoid her.<br/><br/>The previous simulation had already proven that even if he fled to Divine City and joined the Tianxin Martial Arts Hall, Ling Ling would still manage to find him like a stubborn ghost.<br/><br/>He was neither able to defeat her nor avoid her, what else could he do?<br/><br/>If he didn’t take her in this time, the next time there might be a martial arts competition for suitors, the time after that, she might pretend to be chased by enemies. And the time after that, she might just force him to comply.<br/><br/>Rather than waiting for such situations, when she aims a sword at his throat and forces him into marriage, it was better to indulge her from the start and play along with her drama.<br/><br/>At least for now, she’s technically a maid and she has to serve him.<br/><br/>As for her motives, he would find out someday.<br/><br/>What Gu Yang needed right now was time. His priority was to reach Ping County. Once he received the thirty thousand silvers, he could make fifteen simulations. If everything went smoothly, he could break through to the Fourth Grade Realm and he would no longer need to fear her.<br/><br/>For now, he would just have to maintain a facade.<br/><br/>That very night, another woman joined Gu Yang’s room.<br/><br/>Ling Ling asserted her presence, “I am your maid, naturally I should stay in the same room as you, just like them, right?”<br/><br/>Gu Yang was utterly confused. Judging by Ling Ling’s age, she should be under twenty, and with a Cultivation Level at the Fourth Grade, she was undoubtedly a martial arts prodigy who would receive priority cultivation in any influential force.<br/><br/>Why would she willingly serve as a maid to someone at Fifth Grade Cultivation Level like him?<br/><br/>“Could it be that she knows about the fact that I am a transmigrator?” Gu Yang thought to himself..\t\t\t\t\t\t</div>", "images": {}, "success": true}