{"id": 40, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14254637.html", "title": "Chapter 40 - Chapter 40: 040 Can Your Body Withstand It?", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 40 - Chapter 40: 040 Can Your Body Withstand It?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 40: 040 Can your body withstand it?<br/><br/>Translator: 549690339<br/><br/>Gu Yang was certain that the treasure map was authentic and the treasures were still hidden. However, without ranking at Third Grade level, there was no way he could deal with Cao Yiyi.<br/><br/>Third Grade…<br/><br/>Now he only had twelve chances left to use the simulation, reaching the Fourth<br/><br/>Grade would be nice.<br/><br/>“No worries, there’s still time.”<br/><br/>He comforted himself with this thought.<br/><br/>In the previous simulation, Cao Yiyi had waited for several months, obviously laying a trap for him.<br/><br/>With a few months’ time, as long as he could make enough money, advancing to Third Grade wouldn’t be a problem.<br/><br/>Remember, just a month ago, he was merely an ordinary person. Now, he had already reached the Fifth Grade. Isn’t such rapid progress shocking?<br/><br/>Keep going.<br/><br/>[At twenty-two years old, you took Ling Ling to Yuzhou. On the way, you saved Jiao Shumo and obtained a treasure map. However, you bumped into Cao Yiyi and a conflict ensued.]<br/><br/>[After returning to Pingjun City, you immersed yourself in training.]<br/><br/>[Two years later, you forcibly took Su Qingzhen from the Qingxuan Sect and hid away in the Lian Mountain range with Ling Ling, deciding to live in seclusion.]<br/><br/>[Three years later, one night, a monster suddenly appeared and attacked you. Su Qingzhen was killed on the spot and you, even with Ling Ling’s help, were no match for the monster as you were defeated one after another. You lived until you were twenty-seven.]<br/><br/>Once again, it was that monster!<br/><br/>Seeing the outcome of this simulation, Gu Yang furrowed his brows.<br/><br/>This monster probably was the one from the swamp behind the Wang Family’s Gully. It had already killed him several times.<br/><br/>However, compared to staying in Pingjun, he had two more years to live.<br/><br/>That meant two more years to improve his powers. [Simulation ended, you can keep one of the following items.] [One, Martial Arts Realm at the age of twenty-seven.] [Two, Martial Arts experience at the age of twenty-seven.]<br/><br/>[Three, Life wisdom at the age of twenty-seven.]<br/><br/>“I choose one.”<br/><br/>“Here we go again!”<br/><br/>Ling Ling in the room once again felt True Qi in Gu Yang’s body skyrocket, the overflow of aura allowed her to clearly sense it.<br/><br/>Although she couldn’t estimate how much his power had increased exactly, such abnormal occurrences happening thrice in a row changed her initial astonishment to fear.<br/><br/>She knew that something unusual must have happened to Gu Yang.<br/><br/>With her knowledge, she was unable to explain this occurrence.<br/><br/>Maybe, she needed to consult her grandfather.<br/><br/>As Ling Ling was thinking, after a while, she once again felt Gu Yang’s aura skyrocket and swallowed subconsciously.<br/><br/>Her heart couldn’t help but race. “Can his body withstand this continual increase?”<br/><br/>Gu Yang went through another simulation. This time, he chose to reside in a small town near Tianshui City.<br/><br/>But he still died at the age of twenty-seven, because Ling Ling’s nemesis came knocking.<br/><br/>This time, after preserving the Martial Arts Realm of twenty-seven years old, the True Qi in his body reached a limit, arriving at the peak of Fifth Grade. Next was breaking the limit and stepping into the Fourth Grade Realm.<br/><br/>This was the hardest part.<br/><br/>Gu Yang decided it was enough for the day.<br/><br/>Just using the simulation five times overnight was quite taxing on his mind. He decided to take a rest and fully absorb these gains.<br/><br/>Ling Ling in the room saw him finally quietening down, but she couldn’t sleep anymore. One question kept running through her mind, what had happened to him?<br/><br/>The next morning when Gu Yang woke up, he was surprised to see Ling Ling looking at him differently.<br/><br/>Although she usually didn’t express it clearly, she occasionally showed a hint of contempt. That was the attitude a martial artist has towards those weaker than them.<br/><br/>But now, he could clearly feel her gaze had turned solemn.<br/><br/>Gu Yang knew that she definitely had discovered the abrupt increase in his strengths.<br/><br/>That was something he couldn’t hide.<br/><br/>Ling Ling wasn’t like Su Qingzhen, her abilities were still superior to his, and she could easily notice anything unusual.<br/><br/>Pretending to be ignorant as usual, Gu Yang finished breakfast and set off with her.<br/><br/>In ‘Simulated Life’, he had lived and died with Ling Ling so many times. Most of the time, she was inseparable from him.<br/><br/>He had some degree of trust in her.<br/><br/>On the way, Gu Yang suddenly asked a question, “Once we’re back in Pingjun<br/><br/>City, what can we do to make money?”<br/><br/>Ling Ling casually replied, “Find a trading house. As long as you are willing to protect them, they will naturally reward you with silver.”<br/><br/>“One can only earn about one or two thousand taels per year this way. Isn’t there any other way to make more money?”<br/><br/>“How much do you want?”<br/><br/>“The more the better.”<br/><br/>“What do you need so much money for? Do you know that money is the most useless thing in this world?”<br/><br/>To me, money is the most useful thing.<br/><br/>He didn’t express the last sentence. That was his biggest secret.<br/><br/>He continued to ponder.<br/><br/>As the saying goes, one can only become rich through windfall profits. The deal with Su Qingzhen was like this, and so was the treasure map.<br/><br/>If not, finding a corrupt businessman like when he was in Tianshui City and extorting him could be a good choice too. It wouldn’t be dangerous.<br/><br/>Ling Ling suddenly said, “In fact, if you can win over Cao Yiyi, even getting mountains of gold and oceans of silver wouldn’t be difficult.”<br/><br/>“That crazy woman? Maybe not.”<br/><br/>Gu Yang didn’t feel he was that desperate yet.<br/><br/>It’s better to keep a distance from a woman who is sweet one second and then stabs you in the heart the next.<br/><br/>He decided not to beat around the bush anymore, “Do you have money? Can you lend me 100,000 taels? I will pay you back 150,000 after one year.”<br/><br/>Ling Ling was taken aback, she hadn’t expected such an odd request from him. She shook her head, “I only have seventeen taels and three coins of silver on me, and you were the one who gave them to me.”<br/><br/>Hearing her words which didn’t sound like evasion, Gu Yang gave up this idea.<br/><br/>“Or, should we borrow from Qingxuan Sect?”<br/><br/>Subsequently, he turned his mind to Qingxuan Sect.<br/><br/>The Qingxuan Sect was a significant influence in Pingjun City and should be able to come up with tens of thousands of taels.<br/><br/>That night, Gu Yang and Co. returned to Pingjun City, which saved them an entire day’s journey compared to the time it took to get there.<br/><br/>With his tremendous increase in strength, his speed naturally improved quite a bit.<br/><br/>Zhang Xiao Hai had rented a courtyard, cleaned inside and out, purchased all the necessary items, and made it readily habitable.<br/><br/>Having lived in a thatched house for two years since crossing over, living conditions were quite poor. But now, they could finally live in a decent house.<br/><br/>Gu Yang bathed and changed into a new set of clothes, then returned to his room and sat down on his bed.<br/><br/>[Use the Life Simulator? One use will cost 2000 coins.]<br/><br/>“Yes.. “\t\t\t\t\t\t</div>", "images": {}, "success": true}