{"id": 44, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14261113.html", "title": "Chapter 44 - Chapter 44: 044 You Dare To Make Such A Demand?", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 44 - Chapter 44: 044 You Dare To Make Such A Demand?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 44: 044 You dare to make such a demand?<br/><br/>Translator: 549690339<br/><br/>“Dissipate your accumulated power and start your cultivation from scratch!”<br/><br/>Ling Ling said these words seriously.<br/><br/>Gu Yang was taken aback, he hadn’t expected her to propose such a preposterous solution. Was she joking?<br/><br/>Who would be willing to dissipate all the power they’ve painstakingly cultivated and start from the beginning?<br/><br/>Ling Ling continued, “This matter is also related to the favor I’ve asked you for.’<br/><br/>Oh right, she had initially said she had a request for him. The topic had surprisingly rotated to this point, he almost forgot.<br/><br/>Gu Yang wanted to hear her explanation, “Speak.”<br/><br/>Ling Ling explained, “I practice a peerless cultivation technique from Daoism, known as ‘Extreme Yang True Gang.’ Only women can practice this technique. However, once reaching the Fourth Rank, they hit a major hurdle. If I can’t breakthrough, I will be stuck at the Fourth Rank forever.”<br/><br/>The plot was finally coming to light. She, a Fourth Rank cultivator, was willing to defer to him, a Fifth Grade. He had always wondered why, but now she was finally revealing the mystery.<br/><br/>“After reaching the Fourth Rank in the ‘Extreme Yang True Gang,’ one needs to find a Fourth Rank warrior who cultivates Pure Yang Qi, and transfer all their Pure Yang Qi to them. This acts like fuel, allowing them to complete cultivation and breakthrough to the Third Rank Realm.”<br/><br/>Gu Yang really wanted to ask her, do you think I’m an idiot?<br/><br/>If it weren’t for her unwavering support during many simulations, he would have lost his patience.<br/><br/>She wanted him to transfer all his power to her to help her break through to the Third Rank…<br/><br/>How dare she even ask this of him?<br/><br/>He couldn’t help but laughed, “You are quite straightforward.”<br/><br/>Ling Ling calmly said, “You must willingly cooperate for this to work. If you are unwilling, I can’t force you.”<br/><br/>“Do you honestly believe that some sugar-coated words would convince me to give you all the power I’ve painstakingly cultivated? There is no such good deal in this world.”<br/><br/>Ling Ling met his gaze with clear eyes, “If you agree to help me, I will teach you a peerless cultivation technique and do everything in my power to help you reach the Third Rank Realm.”<br/><br/>She paused, then continued, “You can also make any request of me. As long as it’s within my capability, I will agree.”<br/><br/>Gu Yang lost interest in continuing the conversation and dismissed her, “You may leave. I am tired.”<br/><br/>Ling Ling seemed somewhat downcast. After a slight bow, she left the room.<br/><br/>Of course, Gu Yang would never consider her proposal. For others, switching to a Yang attribute cultivation technique might be extremely difficult. But for him, who possesses a life simulator, it wasn’t impossible. As long as he continuously simulates, one day, he will find a way.<br/><br/>Firstly, he needed to gather enough silver.<br/><br/>However, for a Fourth Rank warrior, there were plenty of ways to make money.<br/><br/>Gu Yang called over Zhang Xiao Hai and asked him to go out and gather information on the situation of various businesses of all sizes in the Ping county city. He also wanted to find out if there were any bandits or thieves nearby.<br/><br/>In the following days, he stayed at home, familiarizing himself with the Fourth Rank cultivation level.<br/><br/>Just as he was preparing to go out and make some money, Daoist Priestess<br/><br/>Jingyu paid another visit. But this time, she came alone without Su Qingzhen. Gu Yang was a bit puzzled, “What brings you here, Sect Leader?”<br/><br/>Daoist Priestess Jingyu didn’t seem to be in good condition. Knitting her brows, she sighed and said, “To be honest, the Qingxuan Sect has encountered some trouble. I came to ask for your assistance.”<br/><br/>“Oh?” Gu Yang’s eyes lit up. Wasn’t this a money-making opportunity delivered right to his door?<br/><br/>He asked, “What kind of trouble is it?”<br/><br/>“To put it mildly, it’s unfortunate…”<br/><br/>As it turned out, the Qingxuan Sect had already transformed its main business into accepting daughters from wealthy families as disciples and teaching them martial arts.<br/><br/>The Qingxuan Sect’s members were all female, so the city of Ping county was happy to send their daughters to join.<br/><br/>Those who were reluctant to send their daughters to the Qingxuan Sect would hire a member from the Sect to teach at home, similar to hiring a tutor.<br/><br/>But, the problem arose from this.<br/><br/>One female disciple had, during her teaching at a family’s home, struck up a relationship with the man of the house and the two of them eventually eloped.<br/><br/>The woman of the house soon discovered her husband’s disappearance. Quickly discerning the reason, she angrily confronted the Qingxuan Sect, demanding an explanation.<br/><br/>This woman was very influential, her father was a Fourth Rank warrior, a notable expert in the city of Ping county.<br/><br/>The Fourth Rank warrior only had one daughter who he cherished, leading to her spoilt nature. Even her husband was courted by her family.<br/><br/>Now that the woman’s husband has run away with a female disciple from the Qingxuan Sect, it was hard for her to swallow this. She caused a ruckus at the Qingxuan Sect, stubbornly demanding an explanation.<br/><br/>She threatened to burn down the Qingxuan Sect if they didn’t find her husband within three days.<br/><br/>Jingyu had no other choice but to send people to find the eloping disciple, but it was hardly an easy task in such a vast population.<br/><br/>On the other hand, she sought help and tried to leverage contacts, hoping they could persuade the other party to back down. However, everyone she turned to avoided her.<br/><br/>The person she was dealing with was a Fourth Rank warrior with a notoriously bad temper. After losing such a huge asset, how could he easily let it go? Going to plead for the Qingxuan Sect at this time would be asking for humiliation.<br/><br/>Out of options, Jing Yu decided to try her luck with Gu Yang.<br/><br/>After hearing her story, Gu Yang asked, “What kind of background does this<br/><br/>Fourth Rank warrior have?”<br/><br/>Jing Yu replied, “His background is quite legendary. He came from a commoner background, joined the army, performed meritoriously, and developed his martial arts skills. However, when his commanding officer was imprisoned for a crime, he became disillusioned and resigned from the army to return to his hometown. He married in Ping county city and only had a daughter.”<br/><br/>So he had a military background but now he didn’t have any backing due to his commanding officer’s imprisonment.<br/><br/>Gu Yang mulled over it in his mind, thinking that the job could be done.<br/><br/>Jing Yu bowed and said, “I respectfully ask for your help, sir.”<br/><br/>Gu Yang replied, “I am willing to help you, except I have a problem that needs to be addressed myself.”<br/><br/>“Please tell me, I won’t refuse to help you.”<br/><br/>“I need silver.”<br/><br/>Without saying anything further, Jing Yu took out several silver bills from her bosom. “Here is 15,000 taels. All of the Qingxuan Sect’s savings over the years are in here. Please accept it.”<br/><br/>Obviously, she had already inquired about his preferences from Su Qingzhen beforehand and was well prepared.<br/><br/>Impressive!<br/><br/>Gu Yang praised silently in his heart. He did not haggle over the price and accepted it, giving Su Qingzhen’s relationship with him some credit.<br/><br/>He took the silver bills, observed the words ‘redeemable upon seeing the bill’ written on them, and a smile crossed his face, “Leave this matter to me. Give me that man’s address. I’ll pay him a visit tomorrow morning.”<br/><br/>Seeing that he had accepted the payment, Jing Yu felt relieved and said, “Thank you for your help.”<br/><br/>After sending Jing Yu away, Gu Yang went to an exchange shop to convert the silver bills into 15,000 taels of silver, and immediately recharged that amount into his account.<br/><br/>The balance in his system had now reached 19,000.<br/><br/>[Do you want to use the life simulator? Using it once costs 5000.]<br/><br/>PS: Racing for the new book list, please support with recommendation tickets and monthly tickets. Also, sincere thanks to a few readers for their tips..\t\t\t\t\t\t</div>", "images": {}, "success": true}