{"id": 46, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14261115.html", "title": "Chapter 46 - Chapter 46: 046 Heavenly Origin Godslayer Technique", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 46 - Chapter 46: 046 Heavenly Origin Godslayer Technique</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 46: 046 Heavenly Origin Godslayer Technique<br/><br/>Translator: 549690339<br/><br/>[ …After transferring your Pure Yang Qi to Ling Ling, she started secluded training.]<br/><br/>[In losing all your cultivation level, you had to switch to cultivating “Phoenix<br/><br/>Dance Nine Heavens,” beginning anew at the Ninth Rank.]<br/><br/>[Three months later, Ling Ling broke through to third rank. After exiting retreat, true to her promise, she taught you the unique martial art, “Heavenly Elemental God Slaying Art”. Since then, you have been engrossed in your training.]<br/><br/>[Five years later, you reached the peak of the ninth rank and initiated your first Nirvana. That year, Ling Ling advanced to the second rank.]<br/><br/>[After another five years, you managed to step into the Eighth Realm. The same year, Su Qingzhen advanced to the Third Rank.]<br/><br/>[Eight years later, you reached the peak of the Eighth Realm and underwent your Second Nirvana. Meanwhile, Su Qingzhen advanced to Second Grade, Ling Ling began to attack the Divine Power realm, but a few First Rank experts appeared and surrounded her for a kill. You were also affected, died on the spot at the age of forty.]<br/><br/>When Gu Yang saw the outcome of this simulation, he still didn’t feel satisfied.<br/><br/>Ling Ling still had a conscience, she hadn’t forsaken him after she got what she wanted.<br/><br/>This simulation was quite brief, which implies that he didn’t encounter any major incidents. Being protected by a third-rank master, it’s natural to concentrate on cultivation.<br/><br/>Only, the speed of this cultivation was extremely slow.<br/><br/>It took eighteen years just to complete Second Nirvana.<br/><br/>Ling Ling had already started to attack the Divine Power realm, and even Su Qingzhen had already reached the Second rank.<br/><br/>By this calculation, it’s estimated that it would take hundreds of years to cultivate “Phoenix Dance Nine Heavens” to the First-rank realm, right?<br/><br/>As expected, when the aptitude is lacking, forcefully cultivating such unique martial art would only bring self-inflicted hardships. [Simulation ends, you can keep one of the following.] [One, your martial arts realm at the age of forty.] [Two, your martial art experience at the age of forty.]<br/><br/>[Three, your life wisdom at the age of forty.]<br/><br/>Gu Yang chose number two.<br/><br/>Suddenly, within his mind, a terrifying Blade Intent resonating with destruction and killing emerged.<br/><br/>The moment this Blade Intent appeared, his consciousness became blank and he almost thought he was dead.<br/><br/>“This is—<br/><br/>Outside the door, Ling Ling, who was full of doubts, narrowed her eyes. She was extremely shocked and sensed a terrifying Blade Intent that vanished in a flash, but it was not any weaker than the imposing ones from earlier.<br/><br/>“Another unique martial art?”<br/><br/>She was somewhat stupefied.<br/><br/>What kind of origin does he have to receive the inheritance of two unique martial arts?<br/><br/>In this world, only a few families, the royal family, and some big sects possess martial arts of this level…<br/><br/>Moreover, she felt a sense of familiarity with that Blade Intent.<br/><br/>“Isn’t this a demon technique?”<br/><br/>Gu Yang was studying the “Heavenly Elemental God Slaying Art” he obtained from Ling Ling, and he couldn’t help but question this.<br/><br/>What he received was only the first layer.<br/><br/>This technique was even more bizarre than the “Sun’s Red Technique”. The method of cultivation was to comprehend the Blade Intent and nurture it. The way to nurture Blade Intent was to kill.<br/><br/>Every person he killed would serve as fuel for the Blade Intent.<br/><br/>The higher the cultivation level of the person killed, the better the effect. As the Blade Intent gradually strengthens, his own cultivation level would naturally advance too.<br/><br/>Without a doubt, this was pure killing saber technique. As long as you killed continuously, you could endlessly increase your strength.<br/><br/>Of course, cultivating this saber technique was more dangerous than the Sun’s Red Technique. If one was careless, one could be corrupted by the Blade Intent, turning into a killing machine who only knew to kill.<br/><br/>“It’s too dangerous. Such a saber technique, if it could not be leveled up, better not to level up.”<br/><br/>Gu Yang shook his head as he watched.<br/><br/>Compared to “Phoenix Dance Nine Heavens”, it was way better though it would take much time since it was safe. Time for him was not an issue at all.<br/><br/>“Now only one simulation remains, there’s no hurry to change the cultivation method.”<br/><br/>Once he switched to “Phoenix Dance Nine Heavens” , his strength would regress to Ninth Rank. That would make him too weak, with no sense of security at all.<br/><br/>Before he decided to switch, he needed to amass a huge sum of money first. Only with money could he utilize the Simulator to swiftly pass through this weak period.<br/><br/>He must accumulate at least a hundred thousand taels.<br/><br/>“Now it’s time to deal with the troubles of the Qingxuan Sect.”<br/><br/>Gu Yang quickly made up his mind, he opened the simulator once again and used up the last remaining opportunity.<br/><br/>[At the age of twenty-two, you are now a fourth-rank martial artist. You arrived at Ping Province City along with Su Qingzhen and Ling Ling. Encountering trouble with the Qingxuan Sect, you solved it and received a treasure map from the Shadow Thief.]<br/><br/>[Following that, you took Ling Ling and Su Qingzhen to Divine City to join<br/><br/>Tianxin Martial Arts Hall and became a direct disciple of Cheng Tianxin.]<br/><br/>[At the age of twenty-five, Guo Taiping, 7th on the genius list, stormed the hall, Cheng Tianxin was defeated.]<br/><br/>[On the night of the same day, a mysterious third-rank martial artist barged in and attacked Ling Ling. Cheng Tianxin fought him off despite suffering severe injuries, later he succumbed to these injuries and passed away.]<br/><br/>[Subsequently, Ling ling left, her whereabouts unknown.]<br/><br/>[On the next night, another mysterious power entered the hall, but was chased away by the disciples of the martial academy.]<br/><br/>[Later, Cheng Qingyu succeeded as the Academy Head. A year later, she broke through to the third rank, stabilizing the declining situation of the martial academy.]<br/><br/>[Another year later, a delegation from the Hu tribe of the desert arrived at<br/><br/>Divine City, sending a third-rank juvenile to challenge the talents of the Great Zhou. In half a month, he defeated seven third-rank individuals. Cheng Qingyu took the stage but was defeated and severely injured, leading to failed Martial Arts.]<br/><br/>[On the same night, a mysterious third-rank expert broke into your house. After ten moves, you executed a do-or-die saber technique which took off one of the attacker’s fingers. You then died due to exhaustion at the age of twenty-six.]<br/><br/>“The depth of Divine City’s waters indeed is too deep.”<br/><br/>Gu Yang remarked. Even though he already was a fourth-rank, this simulation’s ending was almost identical to the one before. He couldn’t affect the big picture.<br/><br/>Cheng Tianxin still died and Cheng Qing still lost to the Hu’s powerful young man.<br/><br/>However, it wasn’t all in vain.<br/><br/>In the end, he faced off against a third-rank expert and managed to wound the attacker before being killed.<br/><br/>This demonstrated his Saber Technique had greatly improved over the previous simulation.<br/><br/>He chose to go to the Tianxin Martial Arts Hall, wishing for Cheng Tianxin to guide his Saber Technique.<br/><br/>Although he had realized the Blade Intent at fifth rank, as soon as he broke through to the fourth rank, his Saber Technique started to lag behind.<br/><br/>Now, he finally managed to cover the deficiency. [Simulation ends, you can keep one of the following.] [One, your martial arts realm at the age of twenty-six.] [Two, your martial art experience at the age of twenty-six.] [Three, your life wisdom at the age of twenty-six.]<br/><br/>Gu Yang chose the second one without any hesitation.<br/><br/>In his mind, countless Tricks and Deeper Meaning of Saber Technique immediately surfaced. It took a mere moment to absorb more than four years of accumulation.<br/><br/>With his eyes opened, a glint of fighting spirit appeared in his eyes.<br/><br/>“This will do. Tomorrow I can test the Saber.”<br/><br/>Gu Yang reached for the saber next to him. This was a new Refined Steel Blade he bought after arriving at Ping Province City. The blade cost a hundred taels of silver.<br/><br/>Tomorrow, he needs to confront the fourth-rank martial artist. Eventually, a battle will be inevitable. He will get a chance to test his current saber technique level.<br/><br/>PS:This chapter compensates for the one missing from yesterday..\t\t\t\t\t\t</div>", "images": {}, "success": true}