{"id": 45, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14261114.html", "title": "Chapter 45 - Chapter 45: 045 Unparalleled Skill Method", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 45 - Chapter 45: 045 Unparalleled Skill Method</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 45: 045 unparalleled skill method<br/><br/>Translator: 549690339<br/><br/>“So expensive.”<br/><br/>Upon seeing the price had risen to five thousand, Gu Yang felt as if he was losing something. Five thousand, an ordinary household would never earn this much in a lifetime.<br/><br/>At the same time, he felt somewhat relieved that the price hadn’t increased even more.<br/><br/>He dreaded if it had propelled directly above ten thousand.<br/><br/>Now, he had more than nineteen thousand, hence making three more Simulations was possible.<br/><br/>Gu Yang returned home and promptly launched the Simulated Life.<br/><br/>[At twenty-two, you have become a Fourth-Rank martial artist. Accompanied by Su Qingzhen and Ling Ling, you arrived at Ping County Town. In a plight, the Qingxuan Sect sought your help. You decided to help willingly.]<br/><br/>[The following day, you went with Ling Ling to talk things through with the unsettled. You successfully persuaded them to cease the fight and make appropriate amends.]<br/><br/>[As a token of thanks, Daoist Priestess Jingyu presented you with a treasure map. It’s one of the nine treasure maps left behind by the Shadow thief’s master.]<br/><br/>[After months of studying the map, you speculated that the treasure was likely in Yuzhou. Along with Ling Ling, you journeyed there, and found the manor holding the treasure. Through many turnovers, it has now become a secondary residence for Shen Baiyi, where he stays to immerse himself in cultivation.]<br/><br/>[One night, you tricked Shen Baiyi to leave the manor, infiltrated the compound, and finally found the secret chamber containing the treasure. Within it was just a jade slip. When you reached out to touch it, an unexpected change occurred, and you acquired “Phoenix Dance Nine Heavens”.]<br/><br/>[The change in the secret chamber alarmed the guards of the manor. You were discovered. As you were about to breakout, Shen Baiyi suddenly appeared and killed you. You lived only up to twenty-two years old.]<br/><br/>Having seen this brief life, Gu Yang felt an inexplicable surprise.<br/><br/>“Phoenix Dance Nine Heavens”, the very same martial skill that Ling Ling spoke about before. It was stolen from the Shen Family by the Shadow thief, sparking a chase from a practitioner of Divine Power from the Shen Family.<br/><br/>To his surprise, the Shadow thief hid this martial skill right under the nose of the Shen Family.<br/><br/>This Shadow thief truly had a cheeky move.<br/><br/>Although the length of this simulated life was short, gaining a peerless martial skill was definitely worth it.<br/><br/>[Simulation is over. You can choose to retain one of the following.]<br/><br/>[One, Martial arts realm at the age of twenty-two.] [Two, Martial arts experience at the age of twenty-two.]<br/><br/>[Three, Life wisdom at the age of twenty-two.]<br/><br/>It goes without saying, obviously, he chose the second option.<br/><br/>All of a sudden, an image of a phoenix covered in red flames appeared in Gu Yang’s mind. It was soaring in the sky, leaving him totally astounded.<br/><br/>Outside, Ling Ling was worried. Even after laying her cards, Gu Yang was acting oblivious these days, she did not know how to persuade him.<br/><br/>Suddenly, her heart tugged. She stood up abruptly, looking in shock towards Gu Yang’s direction.<br/><br/>Just now, she sensed an extremely powerful aura sweeping over, originating from Gu Yang’s room.<br/><br/>Was it a Divine Power?<br/><br/>No, it didn’t seem right. It felt even more terrifying than a Divine Power.<br/><br/>An unbelievable thought flashed over her mind, ‘Could it be a Celestial Being, perhaps?’<br/><br/>No, it cannot be.<br/><br/>Celestial Beings, only existed in folklore, and had not been seen in the earthly world for years.<br/><br/>Ling Ling denied this idea. Suddenly, an idea struck her like a dart, “Could it be… the inheritance of a peerless martial skill?”<br/><br/>The “Extreme Yang True Gang” that she practiced was the supreme divine skill of the Dao Sect. Every time she inherited the skill, a formidable aura appeared in her mind.<br/><br/>But how did Gu Yang have the inheritance of a peerless martial skill?<br/><br/>Recalling the inexplicable events surrounding Gu Yang over these past few days, she grew more distressed. If he now even had a divine peerless skill, what chips could she tempt him with?<br/><br/>“I have hit the jackpot!”<br/><br/>On the other side, after assimilating all the experience, Gu Yang felt an indescribable joy.<br/><br/>This “Phoenix Dance Nine Heavens”, was actually a method of the fire attribute. There were no obstacles for him to correct a Fire Attribute.<br/><br/>The only pity was that he only acquired the first seven levels of the skill. That is to say, he could only cultivate to the Third Rank.<br/><br/>If he wanted the subsequent martial skill, he would have to make a trip to Yuzhou to retrieve the jade slip.<br/><br/>As Gu Yang thought of that, his face put on a peculiar expression, “However, Ling Ling’s luck is quite extraordinary. Could she be the one destined for great fortune?”<br/><br/>To cultivate “Phoenix Dance Nine Heavens”, which has an even stranger approach than “Sun’s Red Technique”, the first step is to disperse the personal attainments.<br/><br/>Moreover, with each breakthrough in a realm, one needs to discard the skill and reconstruct it. This is Nirvana.<br/><br/>After nine times of Nirvana, one can be reborn from the flames, break through to Divine Power, and cultivate the body of the Heavenly Phoenix.<br/><br/>If it were someone else, seeing such stringent conditions, would surely shrink back.<br/><br/>A human’s prime is just over a decade. Once over forty, one starts declining. This martial skill, which needs nine dissolutions and reconstructions, is not something one just plays around with.<br/><br/>This is a peerless martial skill, the requirement for the purity of the skill is extreme. Even with high talents, cultivation wouldn’t progress fast.<br/><br/>In the end, one would most likely have spent half a lifetime, neither excelling or outdoing.<br/><br/>But this issue for Gu Yang, wasn’t much of a problem at all, the one thing he didn’t lack was time.<br/><br/>Most importantly, this martial skill, would not encounter any bottlenecks. After reaching the cap of Ninth Rank, directly achieve Nirvana, and reconstruction would break through to Eighth Grade without any obstacles.<br/><br/>This mere point was enough to shake Gu Yang’s heart.<br/><br/>What he was most worried about was that his talent might fail in reaching the requirements. After touch ceiling, it would be impossible to break through to the next realm.<br/><br/>Like the imminent looming chasm to reach the Third Rank.<br/><br/>Even if he crossed this step, a larger challenge awaited – the Divine Power.<br/><br/>With this martial skill, this issue was resolved head-on.<br/><br/>Gu Yang has decided to revise to this “Phoenix Dance Nine Heavens.” As for this strength now, naturally couldn’t be wasted. Rather, it must be bestowed to Ling Ling.<br/><br/>“I ought to give her a sound charge, once she breaks through to the Third Rank, earning money will be a piece of cake for her…”<br/><br/>He was already calculating in his heart, how much would be appropriate.<br/><br/>The question is, how much is a Third Rank martial artist worth?<br/><br/>Would one million be too much?<br/><br/>[Would you like to use the Life Simulator? Each use consumes 5000 gold.] Gu Yang thought for a moment and launched another Simulation.<br/><br/>Just to be safe, he wanted to see if Ling Ling would keep her word after he transferred his cultivation to her.<br/><br/>[At twenty-two, you have become a Fourth – Rank martial artist. Accompanied by Su Qingzhen and Ling Ling, you arrived at Ping County Town. In a plight, the Qingxuan Sect sought your help. You decided to help willingly.]<br/><br/>[The following day, you went with Ling Ling to talk things through with the unsettled. You successfully persuaded them to cease the fight and make appropriate amends.]<br/><br/>[As a token of thanks, Daoist Priestess Jingyu presented you with a treasure map. It’s one of the nine treasure maps left behind by the Shadow thief’s master.]<br/><br/>[Later, by fulfilling Ling Ling’s wishes, you gave all your Pure Yang Qi to her, assisting her in progressing to the Third Rank realm…. ]\t\t\t\t\t\t</div>", "images": {}, "success": true}