{"id": 49, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297816.html", "title": "Chapter 49 - Chapter 49: She Gave Too Much.", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 49 - Chapter 49: She Gave Too Much.</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 49: She gave too much.<br/><br/>Translator: 549690339<br/><br/>The news of the defeat of the Gale Spear, Tian Fei, at the hands of a young martial artist quickly spread throughout Ping County City, instantly becoming the most sensational news.<br/><br/>Tian Fei, a venerable Fourth Rank expert in Ping County City, had made his name for twenty years. With his iron spear, he was rarely bested.<br/><br/>Now, out of nowhere, a young man has emerged and managed to defeat him in one fell swoop.<br/><br/>Rumors suggested that this young man was barely over twenty.<br/><br/>Soon, the name Gu Yang reverberated throughout Ping County City.<br/><br/>People in every street and alley were guessing about his background.<br/><br/>The most speculated were of course the two Gu families.<br/><br/>A four-rank martial artist in his early twenties must come from a prominent family, or a disciple of a major sect.<br/><br/>Soon, news came out that this man had risen to defend the Qingxuan Sect.<br/><br/>The news of Tian Fei’s son-in-law eloping with a disciple of the Qingxuan Sect had long been spread.<br/><br/>In the past few days, Tian Fei’s daughter has been causing a commotion at the Qingxuan Sect every day, which had already spread widely.<br/><br/>Unexpectedly, the Qingxuan Sect was able to bring out such a young expert.<br/><br/>The ordinary people had limited sources of information and merely discussed it passionately.<br/><br/>While the major powers have already received accurate news by the evening of that day.<br/><br/>In Ping County City, the three main forces were the County Governor, representing the Imperial Court,<br/><br/>the Dragon Tiger Gang, backed by the second son of the Lin Family, Lin Zisheng, and the Fang Family, noble descendants and local snakes of the county. These three powers had different stances towards Gu Yang, whose origin was unknown.<br/><br/>The County Governor was pleased to see his success, even considering to draw him over. It would be best if this man could face off against the Fang Family and the Dragon Tiger Gang. Then, he could seize more power from these two factions.<br/><br/>The Dragon Tiger Gang and the Fang Family, on the other hand, were vigilant. They both received the news that this young man named Gu Yang, after defeating Tian Fei, planned to take over the Tian’s trading company and warehouses.<br/><br/>This implies that they intended to settle in Ping County City.<br/><br/>This struck their sensitive nerves.<br/><br/>This young man named Gu Yang was not the same as Tian Fei.<br/><br/>By the time Tian Fei came to Ping County, he was already of age and without any backing. As far as the Fang Family was concerned, he didn’t pose a threat.<br/><br/>The strength of Gu Yang himself was not a big deal. The key point was which force was behind him?<br/><br/>This was what the Dragon Tiger Gang and the Fang Family were most worried about.<br/><br/>While the Dragon Tiger Gang and the Fang Family were discussing about Gu Yang, they suddenly received a message. Gu Yang sent someone over, saying he had some business to discuss.<br/><br/>When they understood the intention of the person sent by Gu Yang, they realized he was seeking money.<br/><br/>That was easy, as money was not of concern to them.<br/><br/>A day later, Gu Yang held a banquet in the largest tavern in Ping County City, hosting an unprecedented auction for this era. The auction was for the ownership of the Tian Family’s trading company and warehouses.<br/><br/>These three powers showed some respect by sending their closest aids.<br/><br/>The County Governor sent over a scholar official.<br/><br/>The Dragon Tiger Gang sent over a Deputy Leader.<br/><br/>The Fang Family also sent over a chief shopkeeper.<br/><br/>In the end, the Tian Family’s trading company and warehouses were bought by the Fang Family for fifty thousand taels, declaring the end of this auction.<br/><br/>Many people came to watch the fun. For this unseen-before auction, it became the talk of the town after meals.<br/><br/>“Rumors have it that the Fang Family and the Dragon Tiger Gang share a close relationship. It seems to be true.”<br/><br/>Gu Yang felt somewhat helpless after receiving the fifty thousand taels.<br/><br/>If there was a loss, then yes, there was a slight loss. The trading company of the Tian Family could earn several tens of thousands of taels a year.<br/><br/>However, it was unrealistic to expect a high selling price.<br/><br/>The ones who dared to bid were only those three. With only a few years in office, the County Governor would naturally not invest in assets here.<br/><br/>The ones who would really bid were the Dragon Tiger Gang and Fang Family.<br/><br/>However, the two families made hardly any competition. As soon as the Fang Family bid fifty thousand taels, the Dragon Tiger Gang stopped bidding.<br/><br/>Although there was a bit of loss, the immediate access to fifty thousand taels resolved his urgent need.<br/><br/>With fifty thousand taels, he could carry out ten simulations.<br/><br/>Ling Ling, who was sitting by the side, said, “Now the Fang Family is led by a woman, who is Lin Zisheng’s lover. Their relationship is far beyond ordinary.”<br/><br/>“Really, that’s news.”<br/><br/>Gu Yang then understood. These two families were almost one, so expecting them to fight fiercely was unrealistic.<br/><br/>“Ever since the head of the Fang Family failed in his attempt to break through to the Divine Power Realm and died ten years ago, they have been in decline. At present, there is only one Second Rank and two Third Ranks left, all of whom are already getting old. Among the younger generation, there are no outstanding characters. Hence, they had no choice but to attach themselves to the Lin Family.”<br/><br/>“In reality, the rise and fall of noble families are inevitable. How many thousand-year-old nobilities have been buried in the dust of history?” A trace of desolation was discernable in Ling Ling’s tone.<br/><br/>Seeing her like this, Gu Yang knew that her inner feelings were touched. He was curious about her background, but this involved private matters, so he didn’t ask more.<br/><br/>When the two of them returned home, Daoist Priestess Jingyu was already waiting there.<br/><br/>“Thank you, young master, for your assistance.”<br/><br/>She had come specially to express her thanks, “This is an heirloom from my master. It is said to be one of the treasure maps of the Shadow thief. I present it to you as a token of my gratitude.”<br/><br/>“You’re too polite, Priestess.” Gu Yang did not refuse and accepted it.<br/><br/>This treasure map was one of the nine maps left by the Shadow thief, the most precious among them, hiding the Shen Family’s unrivaled martial arts technique “Phoenix Dance Nine Heavens”.<br/><br/>Daoist Priestess Jingyu wanted to correct his address to her, as she was a Daoist, not a nun.<br/><br/>After Gu Yang stored the treasure map away, he asked, “Does Priestess have any other business?”<br/><br/>“Then, this humble Daoist will take her leave first.”<br/><br/>Daoist Priestess Jingyu stood up and gave a bow, feeling that the misaddress was insignificant.<br/><br/>Once she left, Ling Ling said, “You seem to have a destiny with the treasure of the Shadow thief.”<br/><br/>“Such benefits are not so easy to obtain.”<br/><br/>Gu Yang remembered not long ago, getting a treasure map and consequently attracting the crazy woman, Cao Yiyi.<br/><br/>This map would surely make him an enemy to death with the Shen Family.<br/><br/>If he managed to learn the “Phoenix Dance Nine Heavens”, the Shen Family would certainly send assassins after him.<br/><br/>That’s why he needed to save up enough money.<br/><br/>Fifty thousand taels was far from enough.<br/><br/>At this thought, Gu Yang made up his mind, “What you mentioned last time, I can agree to. However, in addition to what you have promised, I have one more condition.”<br/><br/>Ling Ling’s expression became serious when she heard his words, “Tell me!”<br/><br/>Gu Yang said, “I want a million taels of silver. As long as you bring the money in front of me, I will give you all my martial arts skills. This will help you breakthrough to the Third Rank realm.”<br/><br/>“Are you serious?” “A gentleman’s word.”<br/><br/>“Agree!”<br/><br/>Ling Ling agreed without hesitation. She has waited for this moment for too long. Even willing to serve as Gu Yang’s handmaiden.<br/><br/>The day she confided in Gu Yang, she made a resolution to be ready to pay any price.<br/><br/>Now, he finally relaxed his conditions. Let it be a million taels, or even going through fire and water, she wouldn’t even furrow her brows.<br/><br/>At last, she saw the dawn of her revenge.<br/><br/>The next day, Ling Ling left.<br/><br/>Gu Yang was looking forward to the day she would return. No matter how she managed to get the million taels, it would even be enough to break through to the First Rank.<br/><br/>He quietly left Ping County and went to a nearby city. He exchanged the fifty thousand taels bit by bit and deposited them into his system.<br/><br/>After withdrawing all the money, he returned to Ping County the same day.<br/><br/>Even Zhang Xiao Hai had no idea where he had gone or what he had done.<br/><br/>At night, cool as water<br/><br/>Gu Yang was in his room, flipping through a book. He knew too little about this world, so he would read whenever he had time.<br/><br/>However, he could only read, the ancient text was a little strenuous for him to understand.<br/><br/>“Who?”<br/><br/>Suddenly, he turned his head alertly, his hand already clutching the hilt of his sword.<br/><br/>A woman’s voice came from outside the door, “I hope you don’t mind my late visit.”<br/><br/>“I do not accept those who lurk around.”<br/><br/>“My lady has come to discuss a big business deal with you.”<br/><br/>With a creak.<br/><br/>Gu Yang opened the door, and outside stood a woman in a black robe with a cloak on her head. When she raised her head, she revealed a delicate face.<br/><br/>“Speak, what business?”<br/><br/>“Is this how you treat your guests?”<br/><br/>“What I hate the most are those who act mysteriously.”<br/><br/>The woman’s smile disappeared from her face, “I want to hire you to kill someone. The reward is fifty thousand taels.”<br/><br/>“Not interested,” Gu Yang replied, ready to close the door.<br/><br/>The woman said, “One hundred thousand taels.”<br/><br/>Gu Yang paused while closing the door, his eyelids twitched slightly.<br/><br/>Goodness, it doubled just like that. She must be wealthy.<br/><br/>He said solemnly, “Too little.”<br/><br/>The woman gritted her teeth, saying, “One hundred and fifty thousand. That’s all I can afford.”<br/><br/>Gu Yang opened the door and said, “Come in and talk.”<br/><br/>He actually did not want to get involved in this mess, but the amount she offered was too much.<br/><br/>My goodness, one hundred and fifty thousand taels, enough for thirty simulations.<br/><br/>This was an offer he couldn’t resist.<br/><br/>PS: I’m a bit stuck on this, but as always, I’ll make up for it tomorrow morning. I don’t have a copy, so I hope you all understand..\t\t\t\t\t\t</div>", "images": {}, "success": true}