{"id": 41, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14254638.html", "title": "Chapter 41 - Chapter 41: 041 Turns Out I’M A Swordsmanship Genius", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 41 - Chapter 41: 041 Turns Out I’M A Swordsmanship Genius</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 41: 041 Turns Out I’m a Swordsmanship Genius<br/><br/>Translator: 549690339<br/><br/>“[At the age of twenty-two, you, accompanied by Ling Ling, journey to Yuzhou City. On the way, you save Jiao Shumo and receive a treasure map. However, you’re discovered by Cao Yiyi, leading to a conflict.]”<br/><br/>“[You take Su Qingzhen and Ling Ling to Divine City, joining Tianxin Martial Arts Hall.]”<br/><br/>“[Two years later, Su Qingzhen’s identity is discovered, and days later, a mysterious powerful opponent kills you. You died at the age of twenty-four.]”<br/><br/>“[You and Ling Ling set off for the Divine City and join the Tianxin Martial Arts Hall.]”<br/><br/>“[Struggling to make a breakthrough, you seek advice from Cheng Tianxin, who suggests you find the opportunity to break through in battle. As a result, you challenge others at every turn.]”<br/><br/>“[One year later, in a spar, you were killed. You died at the age of twenty-four.]”<br/><br/>“C …During a face-off with a disciple of the Yan Family, you accidentally kill him, only to be killed by an expert of the Yan Family. You died at the age of twenty-five.]”<br/><br/>“[…Your fame grew too great, inciting the dissatisfaction of a disciple from the Lin Family. They sent an expert to assassinate you, bringing your life to an end at the age of twenty-seven.]”<br/><br/>“C …You were murdered by the Shen Family. You died at the age of twenty-eight.]”<br/><br/>After seven simulations without reaching forth grade, Gu Yang’s face nearly turned green.<br/><br/>If it weren’t for the Simulated Life, his life would have been utterly tragic. Even with a fifth-grade cultivation level, he’d have been killed on the streets just a few years later.<br/><br/>The longest he survived was until twenty-eight years old.<br/><br/>After seven simulations, he chose to keep his martial arts experience as the post-simulation rewards.<br/><br/>He had truly reached the peak of the fifth grade. Whether in terms of actual strength or his mastery of saber techniques, he had reached a level that others found hard to match.<br/><br/>He was invincible among those at the fifth grade.<br/><br/>In the later simulations, his death was due to his overwhelming fame and lack of a powerful backer. Jealous noble families sent experts to kill him.<br/><br/>These noble families did not abide by the martial code and sent third rank experts to eliminate him, leaving him with no chance to escape.<br/><br/>“This can’t continue. There are fewer and fewer fifth-grade martial artists who can withstand my three strikes, they can’t put any pressure on me,” Gu Yang realized the problem.<br/><br/>The powerful fifth-grade martial artists were all key cultivation targets of major forces. Gu Yang was unable to even meet them, let alone spar with them.<br/><br/>He had no influential family background, no prestigious mentor. No one considered him a threat.<br/><br/>Even if he joined Tianxin Martial Academy, in a place like Divine City, a second-grader like Cheng Tianxin did not carry much weight among the noble families, thus proving useless.<br/><br/>Gu Yang gritted his teeth, “It looks like I’ll have to take some risks!”<br/><br/>His simulation attempts were limited; he was originally unwilling to take risks. However, after failing the first seven times, it was clear that continuing as before would not lead to a breakthrough.<br/><br/>Changes had to be made.<br/><br/>Just as during his last breakthrough from the seventh grade to the sixth, he had to take on higher-ranked opponents and find the opportunity to break through in life-or-death situations.<br/><br/>“So, who should I choose?”<br/><br/>A thought struck Gu Yang, and he came up with an excellent candidate.<br/><br/>“Would you like to use the Life Simulator? Each use will consume 2000 gold coins.”<br/><br/>“Yes.”<br/><br/>“[At the age of twenty-two, you and Ling Ling journey to Yuzhou City. On the way, you rescue Jiao Shumo and obtain a treasure map, but you’re discovered by Cao Yiyi, resulting in a confrontation.]”<br/><br/>“[After returning to Pingjun City, you go alone to Jiangzhou City to search for the treasure. You just found the entrance when you were unexpectedly confronted by Cao Yiyi.]”<br/><br/>“[You and her servant engage in a fierce battle, and after some moves, they begin to take you seriously and use their ultimate technique. Under the immense pressure, you struggle to keep up. After three moves, your True Qi inside is exhausted, and you face imminent death under his saber. However, at this moment, you comprehend a Nameless Blade Technique. As you are pierced by the saber, you plunge your own blade into his chest, dying together. You died at twenty-two years old.]”<br/><br/>Gu Yang was stunned by this outcome.<br/><br/>He hadn’t broken through to the fourth grade, but he died along with a fourth-grade martial artist.<br/><br/>He really didn’t know whether to be frustrated or pleased.<br/><br/>He was already strong enough to kill opponents of a higher grade, yet he couldn’t break through.<br/><br/>Was it because his talent was lacking or because his understanding of saber techniques was too good?<br/><br/>The Nameless Blade Technique was copied from the incomplete blade manual he had obtained from the third boss of Guoshanfeng. The manual recorded three blade techniques in total.<br/><br/>Gu Yang had always thought he had mastered these three techniques, but once he learned the “Duan Yue Knife Technique”, he barely used the previous ones and almost forgot about them.<br/><br/>Surprisingly, at a critical moment, he managed to kill a fourth-grade martial artist using one of the three techniques.<br/><br/>It seemed that he had only scratch the surface of these three techniques.<br/><br/>“[The simulation is over, and you can keep one of the following.]” “[One, your martial arts realm at twenty-two years old.]” “[Two, your martial arts experience at twenty-two years old.]”<br/><br/>“[Three, your life wisdom at twenty-two years old.]”<br/><br/>There was no need for consideration. He chose the second option immediately.<br/><br/>Suddenly, Gu Yang felt as if something had exploded in his brain, and he entered a mysterious state. A sense of invincibility welled up in his heart, as if no matter how strong the enemy, he could defeat them with a single blade.<br/><br/>This was an invincible belief, shaped by countless victories against martial arts practitioners of the same realm in the previous simulations.<br/><br/>Gu Yang finally understood what he had comprehended. It was… Blade Intent. The three-form Nameless Blade Technique had actually touched upon the realm of blade intent.<br/><br/>The understanding of one’s own blade intent or sword intent was usually achieved by martial artists of the third grade or above.<br/><br/>He was still at the fifth grade, far from the third, but he had already comprehended the blade intent.<br/><br/>Gu Yang was shocked, “Turns out, I’m a saber technique prodigy!” This was something he had never expected.<br/><br/>Of course, what was most important was that in the previous seven simulations, he had challenged martial artists of the same realm everywhere and, through the accumulation of countless victories, he had developed an invincible belief, allowing him to comprehend this blade technique. “What is the origin of these three saber techniques?”<br/><br/>Gu Yang took out the incomplete blade manual from his bag, and started reviewing it again.<br/><br/>Why was such a formidable saber technique in the hands of an unremarkable martial artist like the third boss of Guoshanfeng?<br/><br/>Even the “Duan Yue Knife Technique” did not cover the realm of blade intent.<br/><br/>The answer to this question was likely to remain a mystery.<br/><br/>Examining the manual again, Gu Yang had a completely different feeling than before, and developed a completely new perspective on saber techniques.<br/><br/>He was so engrossed that he lost track of time.<br/><br/>He was jolted awake by a knock on the door and realized that it was already daylight.<br/><br/>He held the incomplete blade manual in his hand, a sensation of joy welled up in his heart.<br/><br/>He had gained a lot during this one night, almost rebuilding his understanding of the saber technique, elevating it to a higher level..\t\t\t\t\t\t</div>", "images": {}, "success": true}