{"id": 42, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14254639.html", "title": "Chapter 42 - Chapter 42: 042 Fourth Rank", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 42 - Chapter 42: 042 Fourth Rank</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 42: 042 Fourth Rank<br/><br/>Translator: 549690339<br/><br/>“Young Master, Miss Su has arrived and she brought an elder with her.” The one knocking from outside was Zhang Xiao Hai, who spoke to Gu Yang.<br/><br/>Gu Yang replied, “I’ll be right there.”<br/><br/>If Su Qingzhen brought someone with her, it must be someone from the Qingxuan Sect. He had to stay here temporarily, so he naturally wanted to get along well with them to make things easier in the future.<br/><br/>He had learned a lot about the Qingxuan Sect from Ling Ling.<br/><br/>Decades ago, a Daoist priestess arrived in the city of Pingjun and established the Qingxuan House. She was a Third Rank power and it was rumored she was from the Dao Sect.<br/><br/>The initial intention of establishing the Qingxuan House was to provide shelter for orphaned and destitute women. Any woman who arrived at the Qingxuan House could receive protection. Later, the priestess also taught these women martial arts.<br/><br/>When the numbers increased, it naturally formed a Sect — the Qingxuan Sect, which consisted purely of women.<br/><br/>After the priestess’ death, there weren’t any notable martial artists in the Qingxuan Sect. The subsequent Sect Leader only had the strength of the Fifth Grade.<br/><br/>Over time, the initial intention evolved. To maintain the expenses of the Sect, they took in daughters from wealthy families as disciples.<br/><br/>However, even though the tiger was dead, its influence was still evident. The Qingxuan Sect was considered a branch of the Dao Sect. As it didn’t threaten any of the other forces in Pingjun City, no one dared to provoke them.<br/><br/>Gu Yang stored away the fragmented blade manual, got dressed, and with Ling Ling in tow, went to meet Su Qingzhen and the Qingxuan Sect representative.<br/><br/>“I am Daoist Priestess Jingyu, the Head of the Qingxuan Sect. It is a pleasure to meet you, Young Master Gu.”<br/><br/>The incoming guest was a middle-aged Daoist priestess. She appeared kind and amiable, showing no sharpness of a warrior, and gave a deep bow, “We are grateful for your protection of lingzhen on our journey to the Pingjun City.”<br/><br/>To Gu Yang’s surprise, her demeanor was extremely humble. Even with his thick skin, he couldn’t help but feel a bit embarrassed, “It was merely a small effort, Priestess, there’s no need for such decorum.’<br/><br/>After all, he had charged them for it.<br/><br/>In reality, Priestess Jingyu had learned from Su Qingzhen that he was a Third Rank power, which was why she exhibited such an attitude.<br/><br/>Jingyu then spoke again, “About the Qingzhen’s affairs within the Qingxuan Sect, we hope Young Master Gu can keep it a secret. From now on, she will be known as Qingqing within the Sect. The only one who knows her true identity is myself.”<br/><br/>“Of course,” Gu Yang replied, “However, I need to see her every two days to treat her illness. I hope it won’t be inconvenient?”<br/><br/>Su Qingzhen, who had been averting her eyes and not uttering a word, blushed at his words and seemed a bit flustered.<br/><br/>Priestess Jingyu nodded solemnly, “Qingzhen has told me about this issue. However, it may be slightly inconvenient for her to leave the Sect. Could we trouble Young Master Gu to visit the Qingxuan Sect for her treatment?”<br/><br/>“Sure.”<br/><br/>After discussing their official business, Priestess Jingyu and Su Qingzhen departed.<br/><br/>Gu Yang didn’t bring up the topic of making money. It wasn’t something urgent and he thought it would be more appropriate to mention collaborating on profit-making ventures once they got better acquainted.<br/><br/>Without waiting for breakfast, he retreated to his room. Sensing that his condition was good, he planned to use his remaining two simulations in one go to see if he could break through to the Fourth Rank.<br/><br/>[At twenty-two years old, you and Ling Ling travel to Yuzhou City, saving Jiao Shumo along the way and obtain a treasure map. However, you were spotted by<br/><br/>Cao Yiyi, leading to a confrontation.]<br/><br/>[Upon returning to Pingjun City, you devoted yourself to cultivation.]<br/><br/>[Three years later, one night when you were cultivating, you sensed impending danger and naturally broke through to the Fourth Rank. Moments later, a mysterious expert appeared.]<br/><br/>[You and Ling Ling joined forces to face the enemy but were still outmatched. In a desperate situation, Ling Ling used a forbidden technique to defeat the expert, but she herself was critically injured and passed away without being able to say a word.]<br/><br/>[Struggling to suppress your grief, you rushed to the Qingxuan Sect only to witness Su Qingzhen stabbing herself in the chest. Out of anger, you slaughtered all the assassins.]<br/><br/>[After burying them, you proceeded to Divine City, joined the Tianxin Martial<br/><br/>Arts, honed your blade techniques day and night, vowing to avenge them.]<br/><br/>[A month later, Guo Taiping issued a challenge. Cheng Tianxin was defeated Qingyu, but you foiled the attempt.]<br/><br/>[At night, a mysterious individual entered, attempting to kidnap Cheng<br/><br/>Qingyu, but you foiled the attempt.]<br/><br/>[Cheng Qingyu assumed the position of the head of Tianxin Martial Academy and managed to sustain the Martial Academy for two years. One day, the<br/><br/>Empress Dowager issued an imperial decree to bestow her to the Crown Prince.<br/><br/>Unable to disobey, she passed the position to the Second Senior Brother.]<br/><br/>[Afterward, you traveled around and were treated as a distinguished guest wherever you went. Being all alone, you managed to stay out of trouble.] [Five years later, you encountered Cao Yiyi again. Recognizing you, she ordered her attendant to attack you. But in three strikes, you defeated her servant and left triumphantly.]<br/><br/>[Half a year later, Cao Yiyi found you again, this time bringing along a Third Rank expert. You were no match and was forced to use all your strength but ultimately died in battle at the age of thirty-three.]<br/><br/>I’ve finally reached the Fourth Rank!<br/><br/>Gu Yang was overcome with excitement.<br/><br/>It was a tough journey.<br/><br/>It took a total of fourteen simulations, filled with hardships and relentless perseverance, to finally break through.<br/><br/>Moreover, this time he didn’t break through at the brink of death and even lived for another seven or eight years afterward.<br/><br/>[The simulation has ended. You may keep one of the following items.]<br/><br/>[One, the martial arts realm at the age of thirty-three.]<br/><br/>[Two, the martial arts experience at the age of thirty-three.]<br/><br/>[Three, the wisdom of life at the age of thirty-three.]<br/><br/>Is there any need to question this? He chose option one right away.<br/><br/>An equally fiery breath erupted from within him, like a ball of fire. His True Qi was rapidly rising, and his typically pure True Qi became extremely volatile.<br/><br/>Gu Yang felt as if his meridians were about to burst. Besieged by intense pain, a strange feeling of savagery rose in his heart, prompting him to destroy everything around him.<br/><br/>“What is this…”<br/><br/>Outside the house, Ling Ling was having her meal when she suddenly sensed a wild breath. Her face shifted slightly as she abruptly stood up and vanished instantly.<br/><br/>Zhang Xiao Hai, who was sitting beside her, was left dumbfounded. He had no idea that Ling Ling knew martial arts.<br/><br/>Ling Ling barged into the room and saw Gu Yang sitting on the bed while feeling the incredible heat emanating from him, causing her to gasp involuntarily.<br/><br/>He has already broken through to the Fourth Rank!<br/><br/>How is this even possible?<br/><br/>Her mind was spinning. Based on her original estimation, with his talent, it would take him at least ten years to reach the Fourth Rank.<br/><br/>Two nights ago, Gu Yang’s power had increased drastically which utterly stunned her. Now, he had advanced to the Fourth Rank in one fell swoop.<br/><br/>How did he manage to do it?<br/><br/>“This is not good!”<br/><br/>It didn’t take long for Ling Ling to realize something was amiss. Gu Yang’s cultivation had risen too quickly and his True Qi had turned into Red Sun’s True Qi. Now, there were signs that it was spiraling out of control.<br/><br/>“Sun’s Red Technique” is a nefarious technique. Once it reached the Fourth Rank, there’s a risk of demonized cultivation state, where the volatile True Qi burns the cultivator alive.<br/><br/>Without any hesitation, Ling Ling turned around and left.<br/><br/>At this point, there was only one person who could save him.<br/><br/>Su Qingzhen!<br/><br/>PS: It’s Monday, please vote and support! Thank you..\t\t\t\t\t\t</div>", "images": {}, "success": true}