{"id": 43, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14254640.html", "title": "Chapter 43 - Chapter 43: 043 Four Great Sacred Lands", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 43 - Chapter 43: 043 Four Great Sacred Lands</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 43: 043 Four Great Sacred Lands<br/><br/>Translator: 549690339<br/><br/>Inside a simple carriage, Daoist Priestess Jingyu and Su Qingzhen, who was wearing a veil, were discussing Mr. Gu Yang.<br/><br/>Su Qingzhen asked, “Ancestral Master, can you discern his origin?”<br/><br/>Daoist Priestess Jingyu was her mother’s master; in terms of lineage, she was her ancestral master.<br/><br/>Daoist Priestess Jingyu said, “This Mr. Gu, is unlikely to come from a prominent family; he shows no signs of manners. However, this gentleman has an extraordinary demeanor and is refreshing to converse with; he doesn’t act superior, he is indeed an approachable person.”<br/><br/>Having originally come from the demimonde and having seen many men, becoming the leader of the Qingxuan Sect and managing the Sect up until now, she had inevitably interacted with various forces around Pingjun City and had a keen eye for people.<br/><br/>Suddenly, the carriage door was flung open from outside, a woman reached in, grabbed Su Qingzhen, and said, “I need to borrow her.” She then picked her up, and jumped off the carriage.<br/><br/>Daoist Priestess Jingyu was shocked to her core as she recognized the woman who had taken Qingzhen, it was the same maid who was standing behind Mr.<br/><br/>She hadn’t detected her presence when she landed on the carriage. This meant that this maid was far more powerful than her.<br/><br/>It’s highly possible she is at the Fourth Rank!<br/><br/>Such a young individual at Fourth Rank, even in high-ranking families like the Nine Surnames, is also a key training target. All this while being a maid?<br/><br/>What exactly is Mr. Gut s background?<br/><br/>Daoist Priestess Jingyu felt a deep sense of mystery.<br/><br/>A moment later, Gu Yang was controlling his explosive True Qi that was on the brink of running wild, taken aback internally, “Training the ‘Sun’s Red Technique’ to the sixth level has such a huge hidden danger!”<br/><br/>Just now, he felt like he was on the verge of entering a demonized cultivation state.<br/><br/>This technique, practiced to this extent, had reached its limit.<br/><br/>If he continued practicing, he would lose his life in no time.<br/><br/>Finding a completely new technique became an urgent matter.<br/><br/>“There are only over four thousand left in the system now, I wonder how much it increases to after reaching the Fourth Rank.”<br/><br/>What Gu Yang was most concerned about, was this matter; he opened the system to take a glance.<br/><br/>[Insufficient balance, would you like to recharge?] As expected, the balance was not enough.<br/><br/>He had to go and make some money!<br/><br/>Just as Gu Yang was worrying, he suddenly heard a noise. Looking up, he saw Ling Ling bring Su Qingzhen into the house. He was first taken aback, then overjoyed.<br/><br/>This was great, saving him a special trip to the Qingxuan Sect.<br/><br/>The True Qi in his body was teetering on the edge of chaos, and the only one who could remove this hidden danger was Su Qingzhen.<br/><br/>When Ling Ling returned to the room and saw Gu Yang suppressing the volatile True Qi, she heaved a sigh of relief, silently left Su Qingzhen behind, and left the room, closing the door behind her.<br/><br/>Su Qingzhen was still in shock. She had long suspected that Ling Ling was skilled in martial arts, but she never envisioned her to be so powerful that she would take her away before her master could react.<br/><br/>Along the way, Ling Ling pulled her along as swift as lightning, so fast she couldn’t see the scenery on the side of the road. In just a few breaths, they were back at Gu Yang’s house.<br/><br/>“Come here.”<br/><br/>She lifted her head to see Gu Yang sitting on the bed, calling her over.<br/><br/>She was all too familiar with this scene; Gu Yang wanted her to practice technique with him.<br/><br/>The difference was, it used to be at night, but now it was broad daylight.<br/><br/>Despite her confusion, Su Qingzhen obediently walked over and sat in front of Gu Yang, placing her hand in his.<br/><br/>The next moment, an unprecedented surge of heat entered her body, akin to a ball of burning flame, scorching her meridians.<br/><br/>Finally, she understood why Ling Ling had hurriedly brought her back; it turned out to be an issue with Gu Yang’s True Qi.<br/><br/>As the heir of a martial arts family, she had been immersed in martial arts since childhood and had some understanding of it.<br/><br/>Balance was the most important aspect of martial arts, and Gu Yang’s True Qi was clearly out of balance.<br/><br/>This was a very dangerous thing.<br/><br/>Su Qingzhen grit her teeth and endured the pain as intense as being engulfed in flames.<br/><br/>Shortly after, a surge of profound Yin energy began to gush out from her body, gradually grinding away the raging energy until it became peaceful.<br/><br/>After an unknown amount of time, Gu Yang circulated the True Qi for several cycles, the ‘Sun’s Red Technique’ True Qi was as if it had been refined, void of any wild energy, and instead, immensely pure.<br/><br/>He opened his eyes and saw Su Qingzhen sitting opposite him, her forehead covered in layers of tiny sweat, and her face indicating pain. He raised his hand, used his sleeve to wipe the sweat off her brow.<br/><br/>After a while, Su Qingzhen exhaled a deep breath, opened her eyes to his gentle gaze, her heart thumped and she quickly averted her eyes.<br/><br/>Gu Yang, with his appealing voice rang in her ears, “Thank you for your hard work this time.”<br/><br/>Su Qingzhen got off the bed, put on her shoes, stood up as if intending to leave, paused, said “I have leveled up” and left in a hurry.<br/><br/>Already at Eighth Grade so soon?<br/><br/>It’s no wonder she is naturally half a step into the Divine Power realm, this progress was so quick.<br/><br/>From the time she became Ninth Rank to now, it’s only been half a month.<br/><br/>Gu Yang said to Ling Ling outside, “Send her back.”<br/><br/>Ling Ling outside responded, “Okay.”<br/><br/>After a while, Ling Ling was back. She entered the room and closed the door behind her.<br/><br/>Gu Yang was still pondering where to get some money, when he saw Ling Ling walk up to him, looking serious in a way he had never seen before, and said curiously, “What’s the matter?”<br/><br/>Ling Ling solemnly said, “There is indeed a matter, I need your help.”<br/><br/>Finally going to lay down her cards?<br/><br/>Gu Yang became interested, got up from the bed, sat in a chair, and said, “Sit down and tell me.”<br/><br/>Ling Ling firmly said, “Your situation is extremely dangerous.”<br/><br/>“How so?”<br/><br/>“Do you know the origins of the ‘Sun’s Red Technique’?”<br/><br/>“Pleased to hear the details”, Gu Yang poured her a glass of water.<br/><br/>Ling Ling said, “The ‘Sun’s Red Technique’ is widespread, but few people know that this technique originates from one of the Four Great Sacred Lands, the<br/><br/>Third Saint Sect.”<br/><br/>Gu Yang interrupted her, “Four Great Sacred Lands? What’s that, I’ve never heard of it?”<br/><br/>“The Four Great Sacred Lands are the oldest four sects in the world. They existed thousands of years ago, aloof from worldly affairs, and have not been involved for years. It is rumored that in each of these Four Great Sacred Lands, a Celestial Being resides.”<br/><br/>“Celestial Being?” Gu Yang heard another new term.<br/><br/>“The Divine Power realm is not the apex of martial arts, beyond the Divine<br/><br/>Power realm, is the Celestial Being realm, which are like godlike existences.”<br/><br/>Gu Yang felt like he had unlocked a new map, and his future path seemed to be even longer.<br/><br/>“You continue.”<br/><br/>“Among the Four Great Sacred Lands, the Third Saint Sect behaves most eccentrically, and is nearly unrighteous. The sect’s techniques are also quite peculiar. Many people doubt that the Third Saint Sect propagated the ‘Sun’s Red Technique’ with ill intentions.”<br/><br/>“Historically, once a person cultivates this technique to the Third Rank, they either become mad and die, or mysteriously disappear. Therefore, children from big families and disciples of sects will never touch this technique.”<br/><br/>“Although you have Su Qingzhen’s icy body to remove this hidden danger, once you break through to the Third Rank, you may encounter disaster.”<br/><br/>After hearing her words, Gu Yang’s expression remained unchanged, he asked,<br/><br/>“So, do you have a way to help me remove this hidden danger?”<br/><br/>Ling Ling said, “Yes..”\t\t\t\t\t\t</div>", "images": {}, "success": true}