{"id": 48, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297815.html", "title": "Chapter 48 - Chapter 48: 048 You’Re In Trouble Now", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 48 - Chapter 48: 048 You’Re In Trouble Now</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 48: 048 You’re in trouble now<br/><br/>Translator: 549690339<br/><br/>The young woman in white watched the retreating figure of the young man, her chest rising and falling rapidly. Her hand was on the hilt of her sword, and several times she wanted to draw it, but she couldn’t.<br/><br/>When the man’s figure disappeared, she let go of her hand, her forehead was covered in sweat, and her lips were pale.<br/><br/>The old man next to her was watching all of this, his heart sinking.<br/><br/>Her condition was worse than he had thought; she did not even have the courage to draw her sword.<br/><br/>It seemed that he was not mistaken. The young man just now used the Wu family’s secret skill, ‘God Destroyer Nine Styles’. This technique was designed to break a martial artist’s Daoist heart using saber intent.<br/><br/>Ever since the extermination of the Wu family over a decade ago, this saber technique had been lost. Unexpectedly, it resurfaced today.<br/><br/>Moreover, the saber intent of this technique was mastered by a fourth-rank martial artist.<br/><br/>Generally speaking, only martial artists of the third rank or above can master saber intent.<br/><br/>In ancient times, martial artists from the third rank to the first rank were referred to as the Spiritual Refining Realm.<br/><br/>Only a handful of martial artists who have been stuck at the fourth rank for years, unable to break into the third rank, are able to comprehend saber intent at the fourth rank.<br/><br/>The young man just now seemed to be in his early twenties. His saber talent was rare.<br/><br/>“Could he be a descendent of the Wu family?” the old man speculated.<br/><br/>A family like the Wu family that had a lineage going back for over a thousand years would not easily be eradicated. It would be normal for one or two descendants to remain.<br/><br/>“Why, of all skills, is it the ‘God Destroyer Nine Styles’?”<br/><br/>The old man was extremely anxious. The technique that the young woman was cultivating placed heavy emphasis on her Daoist heart. Encountering a skill like ‘God Destroyer Nine Styles’, specifically designed to break the Daoist heart, one could easily imagine the consequences.<br/><br/>On the other hand, Gu Yang, in high spirits, left the Tian family estate with Ling Ling.<br/><br/>This time, he had accomplished three feats in one move. Firstly, he helped the Qingxuan Sect eliminate trouble, earning him 15,000 taels and one treasure map.<br/><br/>Secondly, he took over Tian Fei’s trade business and warehouse. Given the scale, Tian’s business was considered one of the top five in the region, and conservatively, would yield an annual income of tens of thousands of taels.<br/><br/>Lastly, he used this opportunity to intimidate Ling Ling.<br/><br/>Times have changed. His strength was now above hers and could not be taken lightly.<br/><br/>From Ling Ling’s shocked and expressionless face, Gu Yang knew that his display was a success.<br/><br/>Of course, Gu Yang was not aware that his sword strike had inadvertently hurt someone else.<br/><br/>Nearing home, Ling Ling finally spoke up, her voice slightly hoarse, “Where did you learn this saber technique?”<br/><br/>“From a bandit. I accidentally got a fragmented saber technique book with only three moves,” Gu Yang didn’t bother to hide it from her.<br/><br/>Ling Ling was silence for a moment then suddenly said, “You’re in trouble.”<br/><br/>Gu Yang was surprised, “Trouble?”<br/><br/>“Of the two people earlier, one of them is a close disciple of the master of the Sword Palace, the sixth place holder on the Beauty List, Xu Ruomei. She is cultivating, ‘Dust Sword Technique’—an exclusive secret skill of the Sword<br/><br/>Palace.”<br/><br/>Gu Yang had heard of the Sword Palace – it was one of the strongest sects in the world and a sacred place many swordsmen aspired to.<br/><br/>A close disciple of the Sword Palace’s master had a high status indeed.<br/><br/>“And that means…?”<br/><br/>Ling Ling elaborated, “The ‘Dust Sword Technique’ emphasizes cultivation of the Daoist heart. In order to unlock its full potential, one needs to experience the myriad aspects of worldly life, immerse oneself in earthly affairs with a pure heart, and ultimately cut off worldly ties in order to achieve the realm of divine power.”<br/><br/>“However, if one’s Daoist heart is disturbed and shattered before the technique is fully mastered, they risk either stunted martial arts growth or complete cultivation destruction.”<br/><br/>“Your saber strike earlier shattered her Daoist heart.”<br/><br/>“Are you serious?”<br/><br/>Gu Yang was shocked, “I didn’t intentionally target her. Can her Daoist heart be shattered so easily? Is it as fragile as glass?”<br/><br/>Ling Ling heard a strange term and asked, “Glass heart? What is that?”<br/><br/>She didn’t know about glass?<br/><br/>Gu Yang had an idea. Now that he thought about it, he had never seen any glass products since he transmigrated.<br/><br/>He suddenly saw a road to wealth. Glass manufacture is definitely an essential skill for a transmigrator…<br/><br/>No, now is not the time to think about this.<br/><br/>It’s the Sword Palace we’re talking about, a giant entity even more formidable than the Lin family that dominates Jiangzhou. The Sword Palace’s master himself is a cultivator in the Divine Power Realm.<br/><br/>Disabling his close disciple is a big grudge indeed.<br/><br/>Gu Yang asked half in hope, “Is there any way to rectify this?”<br/><br/>“Yes, you can allow her to kill you. This would naturally help her rebuild her Daoist heart, and further improve her cultivation.”<br/><br/>In Gu Yang’s eyes flickered a murderous intent, “Or else, find a deserted location and do in both of them.”<br/><br/>Ling Ling said solemnly, “The old man with Xu Ruomei is a second-grade Sword Slave.”<br/><br/>Second grade…<br/><br/>Never mind, he probably wouldn’t be able to block even one of the man’s sword strikes.<br/><br/>It made sense, too. With a disciple of the Sword Palace master herself going on walks without anyone to protect her? That would be unreasonable. Gu Yang was somewhat shocked, “A second-grade cultivator is a Sword Slave?”<br/><br/>Ling Ling explained, “In the Sword Palace, disciples who remain in the second-rank after fifty years of age can only stay if they decide to become Sword Slaves, serving the Sacred Sword in the palace for life.”<br/><br/>“Of course, you don’t have to worry too much. As long as Xu Ruomei is alive, the Sword Slave won’t attack you. She will handle this matter herself.”<br/><br/>Gu Yang understood what she meant, “So you’re saying, if Xu Ruomei dies, he will take action to get rid of me?”<br/><br/>“Not only would he kill you, but he would also kill your entire family.”<br/><br/>Ling Ling’s words shattered his last bit of hope.<br/><br/>It seemed that the world did not have those famous, rule-abiding sects from the novels.<br/><br/>This was indeed an unprovoked disaster.<br/><br/>Gu Yang couldn’t help but sigh, knowing he had gotten himself into yet another mess.<br/><br/>Counting with his fingers, he had cultivated a handful of enemies within a month of leaving his home. The Liu family, the fifth prince, the Shen family, and now the Sword Palace…<br/><br/>Compared to the others, Liu family seemed to be the weakest.<br/><br/>Therefore, a life simulator is not omnipotent.<br/><br/>In the last simulation, he and Ling Ling teamed up to easily deal with Tian Fei. This situation did not occur at all.<br/><br/>But this time, his strength had increased significantly and he was eager to show off his strongest saber intent. But who knew that it would bring him such a big trouble.<br/><br/>A single variable completely altered the trajectory of his future.<br/><br/>This was a lesson indeed.<br/><br/>After Gu Yang got home, he called over Zhang Xiao Hai, “Contact the Fang Family and the Heavenly Dragon Gang to see if they have any interest in Tian’s trade business and warehouse.”<br/><br/>Zhang Xiao Hai was taken aback and asked for clarification, “Ah? Young Master, you mean…”<br/><br/>“Starting tomorrow, Tian’s trade business and warehouse will be under my control. I plan to sell them.”<br/><br/>Gu Yang originally planned to keep the trade business for a steady income stream. But now, things have changed and his immediate need to increase his power had him resorting to cashing in..\t\t\t\t\t\t</div>", "images": {}, "success": true}