{"id": 47, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297814.html", "title": "Chapter 47 - Chapter 47: 047 That Knife", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 47 - Chapter 47: 047 That Knife</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 47: 047 That Knife<br/><br/>Translator: 549690339<br/><br/>In the early morning, a horse carriage entered the town of Ping County.<br/><br/>Outside the carriage, an old man with a goatee said, “Young Master, we have arrived at Ping County.”<br/><br/>Inside the carriage sat a handsome youth, unparalleled in beauty, dressed in a pristine white robe. He exuded a razor-sharp aura, akin to an unsheathed sword.<br/><br/>“Are there any skilled fighters in this county?”<br/><br/>The voice, cold and clear, clearly belonged to a woman dressed as a man.<br/><br/>The goateed old man replied, “The Fang Family, the respected clan of the county, has a few Third Rank fighters. But, most of them have grown complacent through years of privilege, and haven’t sparred with anyone for many years. Only two have considerable skills, but they are currently secluded in their cultivation, I doubt we’ll get to meet them.”<br/><br/>“Furthermore, the second son of the Lin Family has established a gang here, with two very strong Third Rank followers. But, the Lin’s second son is notoriously frivolous, behaving without restraint. It’s better for you not to cross paths with him, to avoid trouble.”<br/><br/>The “Young Master” inside the carriage neither agreed nor disagreed, waiting for him to continue.<br/><br/>She knew, the old man wouldn’t bring her to Ping County without a reason.<br/><br/>Sure enough, the old man continued, “Apart from this, there’s another skilled Third Rank warrior, Tian Fei. He was originally a guerilla under the command of Marquis Wu An. Over twenty years ago, after Wu An was imprisoned, he left the military heartbroken and has been living in Ping County ever since.”<br/><br/>The “Young Master” inside the carriage reacted subtly, “If he was under Wu An, how proficient is he with Wu An’s Overlord Spear?”<br/><br/>Wu An, one of the powerful figures who shook the world two decades ago, was infamous for his Overlord Spear technique. Nearly invincible, he stood third on the First Rank list.<br/><br/>Her purpose for traveling was to test the martial artists around the world, to use it as a stepping stone to reach the Third Rank Realm.<br/><br/>Over the past half year, the opponents she encountered had greatly disappointed her. None of the so-called experts could even withstand her three sword strikes.<br/><br/>She hoped that this Tian Fei could surprise her.<br/><br/>In no time, the carriage stopped outside of Tian’s residence. There stood a man and a woman at the entrance calling out, “We, the late learners, have come to pay a visit to senior Tian.”<br/><br/>Their voices echoed from afar, displaying their profound skills.<br/><br/>The “Young Master” in the carriage deduced that the man was a Third Rank based on his voice. His tone didn’t sound like a friendly visit – it suggested trouble.<br/><br/>“Someone beat us to it.”<br/><br/>Her curiosity piqued, she asked, “Uncle Wu, who is this person?”<br/><br/>The goateed old man also found it puzzling, “I can’t tell, but he appears to be in his early twenties. I haven’t heard of such talent in Ping County.”<br/><br/>Third Rank warriors don’t just grow on trees, sprung out of nowhere.<br/><br/>At this moment, a voice as loud as a gong rang out, “Good, I’m quite interested in seeing what kind of young hero dares to shout outside my residence.”<br/><br/>The door opened from the inside.<br/><br/>The pair walked in. The goateed old man said, “Young Master<br/><br/>“Let’s go take a look.”<br/><br/>The “Young Master” in white pushed the carriage door open and stepped out. She detected the tension between the two and thought and opportunity to observe a real fight.<br/><br/>The old man with the goatee followed her into the Tian residence.<br/><br/>Tian’s servants who mistaken all four people as being together, didn’t try to stop them.<br/><br/>In no time, they saw Tian Fei standing in their courtyard, dressed in black, hands behind his back. His gaze was sharp like an eagle’s, scanning the four guests.<br/><br/>When he saw the “Young Master” in white, his gaze lingered a moment longer and his brows slightly furrowed.<br/><br/>Such grace and demeanor could only come from a prominent family upbringing.<br/><br/>Finally, Tian Fei stared at the heroic man in front of him and said coldly, “Did you come for the Qingxuan Sect?”<br/><br/>The man replied, “Correct.”<br/><br/>“Then you can leave now.” He spoke harshly, leaving no room for negotiation.<br/><br/>“Very well, we’ll let our actions do the talking, as is customary in the martial arts world.”<br/><br/>Tian Fei stared at him and said, “Young man, your cultivation was not easy to attain. Don’t ruin your life by trying to show off.”<br/><br/>This was both an admonishment and a warning.<br/><br/>The young man seemed to pay no mind and said, “Actually, assisting Qingxuan Sect is secondary. Mainly, I’m a bit tight on funds and I’ve been eyeing your business and warehouse.”<br/><br/>Tian Fei gave a cold look but instead of getting angry, he laughed, “Ha, it seems you consider me a fat sheep.”<br/><br/>“In a fight, there should always be some stakes. If I win, your business and warehouse are mine. If you win, I’ll give you one hundred thousand taels of silver. ”<br/><br/>“Fine!”<br/><br/>With a shout, Tian Fei grabbed a long spear next to him and sprung into the air. The spear in his hand transformed into a Poison Dragon and lunged at his opponent.<br/><br/>“What a great Overlord Spear technique!”<br/><br/>When the “Young Master” in white saw this spear, her eyes lit up.<br/><br/>After spending such a long time, she finally encountered a worthy opponent. This spear technique put tremendous pressure on her, exactly what she needed right now.<br/><br/>A sense of excitement surged within her as she contemplated how she would respond to this spear attack.<br/><br/>The spear was fast, deadly, and extremely tricky. In an instant, it was right in front of the young man.<br/><br/>At this moment, the young man finally drew his blade.<br/><br/>Huum!<br/><br/>In a flash, the mind of the “Young Master” in white was blank, as though a slow but irresistible blade was looming in front of her. Her body was stiff, and she couldn’t think of any way to counter it.<br/><br/>She didn’t even have the courage to draw her sword, and could only watch helplessly as the blade descended.<br/><br/>“Blade Intent!”<br/><br/>The pupils of the old man with the goatee constricted. He exclaimed, “Not good!”<br/><br/>At such a close distance, the “Young Master” next to him was also influenced by this Blade Intent.<br/><br/>He hastily slapped the “Young Master” in white on her shoulder.<br/><br/>Awakening from her stupor, her body broke out in a cold sweat, almost as if<br/><br/>she had collapsed. She barely held herself up.<br/><br/>Seeing her in this condition, the old man with the goatee held his breath, as she had been affected by the Blade Intent and her Daoist Heart had been struck.<br/><br/>This could be trouble!<br/><br/>With a clatter,<br/><br/>The iron spear in Tian Fei’s hand fell to the ground. He looked at the knife blade hovering inches from his forehead, his face pale and his eyes dim, aging him several years in seconds.<br/><br/>This blow had not only shattered his spear skills, but it had nearly destroyed his decades of cultivation.<br/><br/>He croaked, “Why didn’t you kill me?”<br/><br/>The young man replied, “You were advising me earlier, you’re not a bad person.” Then, he put his knife back.<br/><br/>“Tell your daughter to stop making trouble at the Qingxuan Sect, and prepare your business and warehouse. I’ll come to collect them tomorrow.” Afterwards, he turned and left.<br/><br/>Tian Fei looked complicatedly at his back and struggled to speak, “May I know your name?”<br/><br/>“My name is Gu Yang, and I welcome you to seek revenge at any time.”<br/><br/>Revenge?<br/><br/>Tian Fei gave a bitter laugh. After the blow he’d just endured, his martial arts had been severed. Revenge was out of the question.<br/><br/>P.S.: Another chapter is coming, but it might be late. Probably after midnight. For those who can’t wait, you can continue to read it tomorrow morning..\t\t\t\t\t\t</div>", "images": {}, "success": true}