{"id": 57, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297824.html", "title": "Chapter 57 - Chapter 57: 057 Hidden Dragon List Number Seven", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 57 - Chapter 57: 057 Hidden Dragon List Number Seven</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 57: 057 Hidden Dragon List Number Seven<br/><br/>Translator: 549690339<br/><br/>With a slightly nervous feeling in his heart, Gu Yang opened the system again. [Do you want to use the Life Simulator? Each use consumes 20,000 money.]<br/><br/>Looking at the enormity of the 20,000 figure, his heart twitched. It quadruple the original price, it really was inhuman.<br/><br/>His current balance of 180,000 left him just nine attempts for simulation.<br/><br/>Fortunately, he anticipated this, he quickly calmed down, closed the system, closed his eyes and began to familiarize himself with the True Essence inside his body.<br/><br/>Moving from Fourth Rank to Third Rank is a qualitative change. His original True Qi had turned into True Essence, which felt completely different from before.<br/><br/>At this moment, an idea suddenly appeared in Gu Yang’s mind. “I am too strong!”<br/><br/>He felt that his strength had increased more than tenfold compared to when he was at the Fourth Rank.<br/><br/>By the time the carriage returned home, Gu Yang could freely control the True Essence in his body as he wished.<br/><br/>It was already late at night.<br/><br/>He got off the carriage, and in a blink of an eye, he appeared in front of Xu Ruomei’s room, pushed open the door and saw that she was sitting on the bed with a pale face, struggling to hold on.<br/><br/>The Prohibition Bracelet specifically designed to prohibit those above the Third Rank. Even though she, a Fourth Rank was practicing a world-shattering technique and her mana surpassed those of the average Fourth Rank, she wouldn’t be able to resist it.<br/><br/>Gu Yang walked over, placed one hand on the Prohibition Bracelet, and began to pour his True Essence into it. After a while, once it had absorbed enough True Essence, it finally quieted down.<br/><br/>This Prohibition Bracelet was like a living thing, it would activate periodically every day, and wouldn’t stop until it had absorbed enough True Essence. These days, without his help, Xu Ruomei would probably have injured her foundation.<br/><br/>“You…”<br/><br/>Although Xu Ruomei’s True Qi was sealed, she was still alert, her gaze at Gu Yang filled with surprise.<br/><br/>The current Gu Yang gave her a completely different feeling, a kind of unprecedented oppressive feeling.<br/><br/>She was very familiar with this oppressive feeling, it was exclusive to those above the Third Rank who have condensed their own martial arts will.<br/><br/>He had actually reached the Third Rank?<br/><br/>And his True Essence had changed. It was not the Pure Yang Qi he had before, it had become like a flame, and there was a bit of spirituality in it, as though he had the same span of mana as those of the Divine Power Realm.<br/><br/>In just one day of not seeing him, why had such a huge change occurred in him?<br/><br/>Xu Ruomei simply couldn’t understand it.<br/><br/>“Rest well.”<br/><br/>Leaving behind a sentence, Gu Yang turned around and left.<br/><br/>His attitude towards Xu Ruomei had unknowingly changed.<br/><br/>In today’s 24 simulations, at the very end, it was always Xu Ruomei who saved him at the risk of her life, which had somewhat changed his opinion of her.<br/><br/>Despite her previous reprehensible actions, she was still a person with feelings and integrity before cutting off her worldly connections.<br/><br/>It could only be said that the Dust Sword Technique she practiced was too inhuman.<br/><br/>After Gu Yang returned to his room and closed the door, he suddenly glanced out the window and muttered to himself, “As expected…”<br/><br/>He felt a sense of being spied upon when he came back this time. When he entered Xu Ruomei’s room, this feeling became even clearer.<br/><br/>He even captured the general position of the opponent.<br/><br/>The strong man who was lurking nearby was obviously the Sword Slave associated with Xu Ruomei.<br/><br/>This person had already come a long time ago, but had no intention of rescuing<br/><br/>Xu Ruomei. He allowed her to suffer from the torment of the Prohibition<br/><br/>Bracelet, and he stayed in the house of his, one could even say, mortal enemy.<br/><br/>From this cold and ruthless method, one could see what kind of Sect the Sword<br/><br/>Palace was.<br/><br/>“Second Grade…”<br/><br/>Gu Yang touched the steel saber beside him with his hand, feeling eager to test it.<br/><br/>He was very eager to test the power of this unparalleled technique “Phoenix<br/><br/>Dance Nine Heavens”, and whether he could fight a Second Grade.<br/><br/>Soon, however, he suppressed this impulse.<br/><br/>“Now is not the time.”<br/><br/>Gu Yang said to himself in his heart, then let go of the saber in his hand.<br/><br/>He was only at the Third Rank realm now, the means at his disposal, his saber technique martial arts, were all at the Fourth Rank level. He obviously couldn’t fight against a Second Grade.<br/><br/>He activated the system again.<br/><br/>[Do you want to use the Life Simulator? Each use consumes 20,000 money.]<br/><br/>With each use costing 20,000, he felt a pang of pain.<br/><br/>“Yes.”<br/><br/>[Age 22, you have reached the Third Rank level of cultivation, have ascended the Hidden Dragon List, ranked seventh, and are known throughout the world.]<br/><br/>[One day, the third beast of the Mei Mountain Six Beasts came to take revenge, but before he could enter the door, he was killed by the city guards, and an invitation to a banquet sent by the Prefect was handed over.]<br/><br/>[On another day, the eldest son of the Lin Family came to apologize in person, gave you the key to the Prohibition Bracelet and offered you many gifts, implicitly probing your Sect lineage.]<br/><br/>[Half a month later, you took Su Qingzhen and left for the Divine City, bidding farewell to Xu Ruomei who had recovered her cultivation.]<br/><br/>[You planned to join the Tianxin Martial Academy. However, Cheng Tianxin didn’t want to accept you as a disciple and instead referred to you as a fellow disciple. Every day, he would discuss saber technique with you. Your saber technique improved significantly.]<br/><br/>[Two months later, you received a letter from Ling Ling, in which she said that her enemy was in the Divine City and it was not convenient to go there, so he would wait in the town for you.]<br/><br/>[One year later, Su Qingzhen’s identity was exposed. A mysterious strongman sneaked in and wanted to kidnap her, but you killed him on the spot.]<br/><br/>[Another year and a half later, Guo Taiping, ranked seventh on the Prodigy List, visited your academy. Cheng Tianxin couldn’t defeat him and as he was about to make a killing move, you stepped in to save him, forcing Guo Taiping back with a single slash of your saber, but you got injured in the heart by a sword.]<br/><br/>[Half a month later, while Cheng Tianxin was in recovery, he was poisoned to death. There was a mass outcry in the Tianxin Martial Academy. Amidst the chaos, Cheng Qingyu mysteriously disappeared and the Tianxin Martial<br/><br/>Academy broke up.]<br/><br/>[Later, you quietly left the Divine City with Su Qingzhen. A strong man suddenly came to kidnap Su Qingzhen. Xu Ruomei happened to appear and drove off the enemy.]<br/><br/>[Xu Ruomei escorted you back to your town and for several years, your injuries didn’t fully heal.]<br/><br/>[One day, Ling Ling broke through to the Second Grade and challenged Guo Taiping. After several dozen moves, she killed him on the spot.]<br/><br/>[A few years later, you were focused on your saber technique, but one day, you suddenly died of mental exhaustion, at the age of thirty.] After reading about this life, Gu Yang couldn’t help but frown.<br/><br/>What the hell was this Hidden Dragon List?<br/><br/>From the looks of it, he had just broken through to the Third Rank and got listed on the Hidden Dragon List. And then, after a few days, both the Fang and Lin Families received the news.<br/><br/>How did the person who compiled the list know about his breakthrough?<br/><br/>Gu Yang was very puzzled inside. He isn’t a high-profile person and he hasn’t told anyone about his breakthrough yet.<br/><br/>Xu Ruomei probably already saw it just now, could it be that she leaked it? [The simulation has ended, you can keep one of the following items.] [One, the Martial Arts Realm when you were 25-years-old.] [Two, the Martial Arts experience when you were 30-years-old.]<br/><br/>[Three, the Life Wisdom when you were 30-years-old.]<br/><br/>The discrepancy in years for cultivation level and experience appears again.<br/><br/>This made sense, 25-years-old was his peak. Afterwards, due to injuries, his state wasn’t good. The system automatically selected the cultivation during his peak period.<br/><br/>Without any hesitation, Gu Yang chose the second option.<br/><br/>This time, he chose to go to the Tianxin Martial Academy to practice saber technique.<br/><br/>From the results, against Guo Taiping, a world-class prodigy of the Second Grade, he was still not a match.<br/><br/>PS: Happy New Year to you all on New Year’s Eve. I wish you all prosperity in the New Year..\t\t\t\t\t\t</div>", "images": {}, "success": true}