{"id": 55, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297822.html", "title": "Chapter 55 - Chapter 55: 055 Is She Serious?", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 55 - Chapter 55: 055 Is She Serious?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 55: 055 Is she serious?<br/><br/>Translator: 549690339<br/><br/>“Why is she here?”<br/><br/>Ling Ling was extremely surprised when she found Xu Ruomei at home,<br/><br/>That day, she had witnessed Gu Yang tearing Xu Ruomei’s Daoist Heart with a single blade strike. Ordinarily, when the two met, there bound to be a fight, even to the death.<br/><br/>Then, Ling Ling saw the silver bracelet on her hand. She narrowed her eyes, “An Essence Lock Bracelet?”<br/><br/>Xu Ruomei was actually fitted with an Essence Lock Bracelet!<br/><br/>She turned her head towards Gu Yang, her face filled with astonishment.<br/><br/>Could it be that you did this?<br/><br/>Gu Yang shook his head and said, “It was done by Lin Zisheng. I just happened to save her. I couldn’t just abandon her, could I?”<br/><br/>Could something like this happen?<br/><br/>Ling Ling was somewhat taken aback. In just a few days of her absence, such an absurd thing had happened.<br/><br/>The favoured disciple of the eminent Sword Palace had fallen to this state. She was ultimately saved by her mortal enemy. Who knew what she must be feeling right now?<br/><br/>The Xu Ruomei right now is no longer sharp as she was during their last encounter. A trace of softness can be seen in her every bit. Where is the elegant air of the aloof female swordsman from before?<br/><br/>Gu Yang said, “Don’t bother about her. You just focus on healing. Once you are completely healed, I can transfer power to you.”<br/><br/>“So about the money…”<br/><br/>“You can owe it first, no rush. If you feel embarrassed, adding interest is fine with me.”<br/><br/>“Okay.” Ling Ling nodded solemnly.<br/><br/>Time passed quickly, and ten days have passed in the blink of an eye.<br/><br/>During this period, Gu Yang went out once more, exchanging all the 110,000 silver notes brought back by Ling Ling into actual silver, and used it to recharge the system.<br/><br/>Suddenly, the balance of the system broke through 300,000.<br/><br/>That means, he can simulate a maximum of sixty times.<br/><br/>This time, he must cultivate the “Phoenix Dance Nine Heavens” to the Third Rank Realm, no matter what.<br/><br/>Ling Ling’s injuries were completely healed. To avoid being disturbed, the two left the city and came to a mountain peak in the suburbs and chose a deserted cave.<br/><br/>She spoke solemnly, “I will first teach you a chant. Memorise it well and ensure that there are no mistakes.”<br/><br/>This was a chant for the power transfer technique. As to how to transfer Gu Yang’s True Qi into her body, this process required the cooperation of both parties with all their heart. If there was even a slight mistake, it could potentially be life-threatening for both.<br/><br/>No wonder she didn’t force it. It wasn’t that she was kind, but it won’t work.<br/><br/>Gu Yang had unravelled a doubt in his heart. Only if he willingly cooperates would there be a chance of success.<br/><br/>After he had memorised this chant, the power transfer began.<br/><br/>The two sat facing each other with their palms pressed together. Gu Yang slowly transferred his True Qi, thread by thread, into her body.<br/><br/>The whole process was extremely slow.<br/><br/>“Extreme Yang True Gang” is a technique that is extremely Yang and hard in the world, which can only be cultivated by females.<br/><br/>This method is too overbearing and Yang. If a male cultivates it, he will only end up blowing himself up and dying.<br/><br/>A female’s physique is Yin and can form a balance. It will not let the True Qi be so violent that it cannot be controlled.<br/><br/>Because of this, the cultivated True Qi lacks the intent of the Extreme Yang and can only be cultivated to the Fourth Rank Realm at most.<br/><br/>That is why it requires the Pure Yang Qi of a Fourth-Rank Martial Arts practitioner to supplement her with that point of Extreme Yang’s intent, cultivate Gang Qi, and thereby break through to the Third Rank Realm.<br/><br/>It was precisely because of such stringent conditions that, since ancient times, very few women could cultivate this technique. Before this, only two people had succeeded.<br/><br/>Now, Ling Ling was the third.<br/><br/>As Gu Yang’s Pure Yang Qi continuously poured in, Ling Ling felt her True Qi escalating within her body.<br/><br/>She didn’t know how long it took, but she suddenly opened her eyes. A blazing glow shot from her eyes, immense True Essence burst from her body, and she levitated in mid-air.<br/><br/>She finally cultivated the “Extreme Yang True Gang” and stepped into the Third Rank Realm.<br/><br/>Ling Ling took a deep breath and landed again.<br/><br/>Now, what she needed to do was to stabilize her realm.<br/><br/>She Dushed her hand forward. and a gentle force sent Gu Yang. who was in front of her, out of the cave. Then, she struck a blow, causing the cave entrance to collapse.<br/><br/>Gu Yang heard Ling Ling’s voice, “I will begin my retreat now. I will find you in three months.”<br/><br/>This was what they had agreed upon beforehand.<br/><br/>Gu Yang stood up. At this time, his body was empty, and he didn’t have a single trace of Qi remaining. The unprecedented sense of weakness made him instinctively feel unease.<br/><br/>However, he still had his physique. This physique was built upon years of training and repeated tempering. At least he wasn’t completely back to square one.<br/><br/>As he came down the mountain, a carriage was parked on the roadside, with Zhang Xiao Hai waiting there.<br/><br/>“To the city.”<br/><br/>After Gu Yang got on the carriage, he opened the system and initiated the first simulation.<br/><br/>“Do you want to use the Life Simulator? It costs 5,000 each time.”<br/><br/>Well, it seems that there was no loophole in this system. Although his cultivation had been lost, it still calculated according to the Fourth Rank Realm.<br/><br/>“Yes.”<br/><br/>“… You help Ling Ling to reach the Third Rank, lost all your cultivation, and start recultivating ‘Phoenix Dance Nine Heavens’. Without your help, Xu<br/><br/>Ruomei’s condition gradually worsened.”<br/><br/>“One day, one of the six evils of Mei Mountain, the third, came to seek revenge.<br/><br/>Zhang Xiao Hai fought hard to gain time for you and Xu Ruomei.”<br/><br/>“After the person killed Zhang Xiao Hai, he came after you again. Xu Ruomei was seriously injured in order to save you. At the critical moment, the expert from the Fang Family arrived and killed that villain.”<br/><br/>“The next day, the key to the Essence Lock Bracelet was sent over by the Lin Family. Xu Ruomei unlocked the Essence Lock Bracelet, recovered her cultivation, and her injuries were gradually healing, but she was still reluctant to leave.”<br/><br/>“Two months later, Ling Ling came out of her retreat and you announced your engagement to her.”<br/><br/>“On your wedding day, Xu Ruomei left in gloom.”<br/><br/>“Four years later, you reached the top of the Ninth Rank and began your first<br/><br/>Nirvana.”<br/><br/>“After another five years, you reached the Eighth Rank Realm.”<br/><br/>“Eight years later, you arrived at the peak of the Eighth Rank and started the second Nirvana. In the same year, Ling Ling began to attack the Divine Power Realm. On that day, several First Rank experts appeared and surrounded Ling<br/><br/>Ling. At the critical moment, Xu Ruomei suddenly appeared and rescued you.”<br/><br/>“A few days later, a First Rank expert chased after you and seriously injured you. Angered, Xu Ruomei stepped into the First Rank Realm and sliced the First Ranker with her sword.”<br/><br/>“Your injuries were severe and beyond help. Xu Ruomei still took you back to Sword Palace and begged her mentor to save your life. But he refused. The next day, you died from your wounds at the age of forty.”<br/><br/>Gu Yang looked over the simulated life that appeared this time, and he was a bit stunned.<br/><br/>Looking at this, Xu Ruomei’s feelings for him were genuine.<br/><br/>Indeed, what one cannot get is always the best.<br/><br/>This time, he didn’t end up with her, and she’d been hung up about it ever since, even risking her life to save him when he was forty years old.<br/><br/>Gu Yang was curious about the follow-up to this simulation. Would Xu Ruomei break away from her sect because of his death?<br/><br/>It’s such a pity that every time he simulates, it stops at his death and he can’t see how things develop afterward.<br/><br/>“The simulation is over. You can keep one of the following items.”<br/><br/>“1. Martial Arts Realm at the age of forty.” “2. Martial Arts experience at the age of forty.”<br/><br/>“3. Life wisdom at the age of forty.”<br/><br/>There’s no need to think about it. Of course, he would choose the first one.<br/><br/>The next moment, Gu Yang felt a rush of flames surge in his body. It was a power more terrifying and powerful than the Red Sun True Qi, but it wouldn’t do any harm to his body.<br/><br/>However, this Qi was too weak.<br/><br/>In the simulation, he had just undergone the second Nirvana and returned to the cultivation of the Ninth Rank.<br/><br/>PS: The weekend is here, seeking monthly and recommendation tickets..\t\t\t\t\t\t</div>", "images": {}, "success": true}