{"id": 53, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297820.html", "title": "Chapter 53 - Chapter 53: 053 Anger Out Of Shame", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 53 - Chapter 53: 053 Anger Out Of Shame</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 53: 053 Anger out of shame<br/><br/>Translator: 549690339<br/><br/>The night was murky, but neither Gu Yang nor Xu Ruomei noticed that on the roof, a pair of eyes had been watching them all along.<br/><br/>Only when Gu Yang had left for Qingxuan Sect did the figure descend to the yard, standing in front of the window, he glanced at Xu Ruomei inside the room, stroking his chin with a thoughtful look in his eyes.<br/><br/>This man was the sword slave by Xu Ruomei’s side, and also her guardian in the ways of the Dao.<br/><br/>Even back at the Lin Family’s residence, he had arrived when Gu Yang saved Xu Ruomei, but he had not revealed his presence.<br/><br/>He had followed them all the way here, hearing all their conversations, without showing any hint of appearing to the rescue.<br/><br/>Neither Gu Yang nor Xu Ruomei had noticed his presence.<br/><br/>The art that he used to conceal his presence was the secret art of the Sword Palace, the Hidden Sword Art, to prevent his discovery by others.<br/><br/>The old man was a guardian, not a nanny.<br/><br/>Only when Xu Ruomei’s life was threatened would he take action.<br/><br/>Whether Xu Ruomei’s Daoist heart was broken by Gu Yang’s sword, or when she was captured by Lin Zisheng’s men and eventually saved by Gu Yang, she was not in mortal danger.<br/><br/>Therefore, he did not intervene.<br/><br/>Xu Ruomei was cultivating a sword technique from among the five great sword scriptures of the Sword Palace, the most special one, the “Dust Sword<br/><br/>Technique”.<br/><br/>This sword technique had not been mastered by anyone for a long time. The last person to have mastered this technique was five hundred years ago, and it was close to being lost to the world.<br/><br/>This sword technique requires one to first experience the trials and vicissitudes of the human world and then sever one’s ties with it with a stroke of the sword, forgetting about the world, thereby entering the realm of divine power.<br/><br/>There are very few people who chose this sword technique among the successors of the Sword Palace, because it is too difficult to detach oneself from the world completely.<br/><br/>Forgetting the world, not only requires one to forget love but also resentment. Since ancient times, how many people could achieve this?<br/><br/>Until Xu Ruomei appeared, she was included in the beauty list, evaluated as a solitary orchid in an empty valley.<br/><br/>This is a special physique, not only having excellent qualifications, but also possessing a tranquil state of mind, treating everything indifferently, without lingering thoughts.<br/><br/>It is said that in ancient times, this is a natural Daoist seed.<br/><br/>Such a physique and state of mind are naturally the best choice for cultivating the “Dust Sword Technique”.<br/><br/>In the beginning, Xu Ruomei indeed made rapid progress, but when she reached the Fourth Rank, she could no longer make a breakthrough. The reason was that her temperament was too cold, and after she left the mountain to travel, she could not integrate into this mundane world.<br/><br/>Now, her Daoist heart was broken, and her cultivation was blocked by the Sealing Bracelet, and she encountered a man who wasn’t afraid of the Sword Palace and was not bewitched by her beauty.<br/><br/>Having lost all reliance, she was helplessly weak, unprecedentedly so, and in such a predicament, her state of mind was bound to change.<br/><br/>It is very likely that this will be her opportunity to engage with the world.<br/><br/>Therefore, the old man not only did not intend to stop her, he even looked forward to its success.<br/><br/>The Sword Palace has been waiting for the mastery of the “Dust Sword Technique” for too long.<br/><br/>The next day, Zhang Xiao Hai got up only to find out that there was one more person in the house, and he couldn’t help but be stunned.<br/><br/>Gu Yang explained, “Her name is Miss Lan, and she needs to stay here for a while.’<br/><br/>In order to avoid attracting attention, he used a pseudonym.<br/><br/>It would be troublesome if Lin Zisheng knew that Xu Ruomei was saved by him.<br/><br/>Zhang Xiao Hai immediately understood, saying, “She is the new maid that young master has collected, right?”<br/><br/>He knew of the young master’s habits. The maids he collected were all stunning beauties. This girl Lan, surely, must be as beautiful as a celestial being.<br/><br/>“…Not this time,” Gu Yang replied.<br/><br/>Upon hearing this, Zhang Xiao Hai became even more serious about this girl<br/><br/>Lan, “Then she must be the future mistress.”<br/><br/>Gu Yang retorted irritably, “Don’t you have anything else in your brain?”<br/><br/>“Young master, don’t be angry.”<br/><br/>Zhang Xiao Hai quickly apologized when he saw Gu Yang getting angry.<br/><br/>At this moment, another visitor arrived.<br/><br/>It was still the same person as yesterday who handed another envelope to Gu Yang, which again contained a banknote worth 75,000 liang.<br/><br/>Inside there was also a note, written in delicate handwriting, “Young master is indeed a man of his word.”<br/><br/>Gu Yang put the banknote away securely. In order to earn these 150,000 liang, he now had a ticking time bomb by his side.<br/><br/>“Forget it, let’s simulate once first and see.”<br/><br/>With 75,000 liang in hand, he finally made up his mind to spend 5,000 liang for a simulation to see when this time bomb, Xu Ruomei, would explode.<br/><br/>“At the age of 22, you are a Fourth Rank martial artist. In Ping County, you defeated Tian Fei with a single stroke, making your name known throughout the city. In the night, Xue E pays a visit, asking you to assassinate Lin Ge.”<br/><br/>“The next day, you went to the Lin residence. By accident, while attempting to kill Lin Ge, you rescued Xu Ruomei, whose cultivation was sealed. Having no choice, you brought her back home.”<br/><br/>“The Sword Slave didn’t appear for a longtime. As you spend day and night with Xu Ruomei, you find that she seems to have developed feelings for you.”<br/><br/>“Three months later, the key to the sealing bracelet was sent over by the Lin<br/><br/>Family. As the seal on Xu Ruomei’s bracelet unlocked, she entered the Third<br/><br/>Rank realm immediately.”<br/><br/>“The next year, Ling Ling returned with a million liang. As per your promise, you used all of your cultivation to help her enter the Third Rank. You began to cultivate “Phoenix Dance Nine Heavens” again.”<br/><br/>“The same year, Xu Ruomei broke through to Second Rank, stormed the Lin residence, and with a single sword stroke beheaded Lin Zisheng. After returning, she asked you, are you willing to marry her?”<br/><br/>“After your wedding, the next year Xu Ruomei bore you a daughter. Not long after, she entered the First Rank realm.”<br/><br/>“Three years later one day, Xu Ruomei left without a trace, leaving you and your daughter, and disappeared from the face of the earth. At this time, you had just reached the peak of Ninth Rank and began your first nirvana.” “Five years later, you successfully reached the Eighth Rank realm.”<br/><br/>“Eight years after that, you reached the peak of Eighth Rank for your second nirvana. Ling Ling began to break through to the Divine Power realm. Several First Rank strong individuals appeared and killed her. You were also affected by the assault and died on the spot. Your age was 40.”<br/><br/>As Gu Yang finished this simulation, he was dumbfounded. What kind of fairy tale setup is this?<br/><br/>Xu Ruomei fell in love with me?<br/><br/>And she actively asked to marry me?<br/><br/>And then, even gave birth to a daughter for me?<br/><br/>But then, she abandoned her husband and daughter and disappeared without a trace…<br/><br/>What’s going on?<br/><br/>This is simply nonsensical.<br/><br/>“The simulation has ended; you can keep one of the following.”<br/><br/>“One, The Martial Arts realm at the age of forty.” “Two, The Martial Arts experience at the age of forty.”<br/><br/>“Three, The life wisdom at the age of forty.”<br/><br/>Only when these three options jumped out in front of his eyes did Gu Yang come back to his senses, and he irrationally chose the third option.<br/><br/>Suddenly, many memory fragments appeared in his mind. The most profound ones were naturally from when Xu Ruomei suddenly left and disappeared, leaving him in confusion.<br/><br/>Then there was the fierce battle when several First Rank cultivators encircled and attempted to kill Ling Ling.<br/><br/>At that time, Ling Ling simply couldn’t protect him. He was immediately killed by the shockwave of a single strike.<br/><br/>“Stay away from lousy women.”<br/><br/>This was the life wisdom left by the forty-year-old Gu Yang from this simulation.<br/><br/>Admittedly, Xu Ruomei’s behavior was indeed characteristic of a treacherous woman.<br/><br/>PS: This is the first update today, there will be another one around 12, please support with your recommendations and monthly votes..\t\t\t\t\t\t</div>", "images": {}, "success": true}