{"id": 56, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297823.html", "title": "Chapter 56 - Chapter 56: 056 Third Rank", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 56 - Chapter 56: 056 Third Rank</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 56: 056 Third Rank<br/><br/>Translator: 549690339<br/><br/>Up front driving the carriage, Zhang Xiao Hai suddenly felt a wave of heat coming from behind. He couldn’t help but glance over his shoulder at the carriage. He was puzzled. What was the young master doing?<br/><br/>Cultivating?<br/><br/>He had no idea that Gu Yang had given up his own cultivation level just to save Ling Ling. This matter was extremely confidential, only the two of them knew about it, and no one else was told.<br/><br/>However, Zhang Xiao Hai did not ask any questions, instead he focused on driving.<br/><br/>He was still new to driving, so he didn’t dare be distracted.<br/><br/>In the carriage, Gu Yang was calculating the time needed to practice the “Phoenix Dance Nine Heavens” techniques.<br/><br/>Practicing to reach the peak of the Ninth Rank would take five years.<br/><br/>After the rebirth through Nirvana, he would have to start over from Ninth Rank to reach the Eighth Grade, which would still take five years. And then it would take eight years to reach the peak of the Eighth Grade. After that, the Second Nirvana will take place.<br/><br/>In total, during the eighteen years of time, he underwent two nirvana’s, each time returning his True Qi to zero, leaving him at only the Ninth Rank in terms of his cultivation level.<br/><br/>To reach Seventh Grade, it would take another thirteen years, and even then, he didn’t know how long it would take to reach the peak of the Seventh Grade…<br/><br/>After calculating all of these, he realized that it would take hundreds of years to reach the First Rank, even under optimal conditions.<br/><br/>“This can’t possibly be a Daoist cultivation method, can it?”<br/><br/>Gu Yang highly doubted that this method was intended for humans to cultivate.<br/><br/>Even beings with extremely high talent levels like Liu Zhe constantly face odds that make reaching the First Rank within their lifetime a major question mark.<br/><br/>Given his existing Fourth Rank Realm and advanced Martial Arts cultivation, and the assistance of the excellent Cultivation Furnace in Su Qingzhen, even then, his rate of progress was slow.<br/><br/>If it weren’t for his special ability, he would have never chosen a cultivation method with a seemingly impossible path to success.<br/><br/>Gu Yang started the second simulation.<br/><br/>[ …Thirteen years later, you breakthrough to the Seventh Grade Realm. Five years later, Ling Ling makes a breakthrough into the Divine Power Realm, but she was besieged by several First Ranks…you died, aged forty.]<br/><br/>[ …Eight years later, you reach the peak of the Seventh Grade, and you start the Third Nirvana…you died, aged forty.]<br/><br/>After numerous simulations, Gu Yang died every time at the age of forty.<br/><br/>Whenever Ling Ling was on the brink of breaking through into the Divine Power Realm, a few First Rank powerhouses would appear on time and kill him.<br/><br/>He had also tried not to be together with Ling Ling on that day, but each time he would still be pursued and killed by a First Rank powerhouse, regardless of his cultivation level at the moment.<br/><br/>And every single time, Xu Ruomei would appear on time.<br/><br/>Sometimes, he would be killed on the spot.<br/><br/>On other occasions, he would be gravely injured, and then Xu Ruomei would take him back to the Sword Palace for help, only to receive cold rejection every time.<br/><br/>It seemed almost like a gate to the underworld.<br/><br/>Gu Yang knew that even if he too reached the First Rank, he would probably not be able to escape this fate.<br/><br/>The opponent didn’t abide by any martial arts ethics and would launch a siege by several First Rank fighters right off the bat.<br/><br/>The only way to break free from this situation was for him to step into the Divine Power Realm, where he could naturally eliminate all those First Rank fighters.<br/><br/>He wasn’t sure how long it was.<br/><br/>Gu Yang watched the nearly identical scenes over and over, until his eyes almost grew tired.<br/><br/>Moreover, after each simulation, his cultivation level was not the same, it kept fluctuating.<br/><br/>One moment, he was at Sixth Grade, the next he would drop back to the Ninth Grade. It was a strange feeling.<br/><br/>Just when Gu Yang was about to grow numb, a prompt appeared, [ …you broke through to the Third Rank Realm, four years later, Ling Ling tries to breakthrough into the Divine Power Realm…]<br/><br/>When his eyes caught the phrase “Third Rank”, his heart leaped. Upon a closer look, it indeed was Third Rank.<br/><br/>“Finally reached Third Rank.”<br/><br/>Oh, the thrill in his heart.<br/><br/>What was this, the how many-eth simulation?<br/><br/>Right, this was the twenty-fourth, adding up to a total span of four hundred and thirty-two years. And he had just reached the Third Rank.<br/><br/>Was this truly a human cultivation method?<br/><br/>If one cultivates this, can they become immortal?<br/><br/>Gu Yang started to doubt his life a bit.<br/><br/>Just cultivating from Fourth Grade to the peak of the Fourth Grade took a staggering fifty years.<br/><br/>From Ninth Grade to the peak of the Ninth Grade required five years.<br/><br/>From Eighth Grade to the peak of the Eighth Grade took eight years.<br/><br/>From Seventh Grade to the peak of the Seventh Grade took thirteen years.<br/><br/>From Sixth Grade to the peak of the Sixth Grade took twenty years.<br/><br/>From Fifth Grade to the peak of the Fifth Grade took thirty years.<br/><br/>From Fourth Grade to the peak of the Fourth Grade took fifty years.<br/><br/>Once at Third Grade and above, will it take hundreds of years?<br/><br/>The thought itself was terrifying.<br/><br/>Of course, he also realized that apart from the difficulty of this method, the major reason was his lack of innate talent. [Simulation over, you can choose to keep one of the following.]<br/><br/>[One, Martial Arts Realm at the age of forty.] [Two, Martial Arts experience at the age of forty.]<br/><br/>[Three, Life wisdom at the age of forty.]<br/><br/>“I choose one.”<br/><br/>Bang!<br/><br/>The next instant, Gu Yang felt an explosion in his consciousness. Flames appeared out of thin air, which coalesced into a Phoenix bathed in fire in just a few moments.<br/><br/>Qi that felt like fire surged out of his pores, and it felt as if he was enveloped in fire.<br/><br/>The intangible fire-like True Qi gradually materialized and almost set the carriage on fire.<br/><br/>This was the symbol of advancing to the Third Rank, the coalescing of True Essence!<br/><br/>In ancient times, from Third Rank to First, they were also called True Essence Realm.<br/><br/>True Essence could pierce through metal with a simple gesture. It rendered the martial artist as a great weapon who could kill heavily armored soldiers with a wave of a hand on the battlefield. Only when the True Essence runs out, can a common soldier resist them.<br/><br/>Of course, even a First Rank martial artist’s True Essence was not infinite. No one would be foolish enough to directly confront an entire well-trained army.<br/><br/>If they were to be surrounded by thousands of fearless soldiers, even a First Rank master would likely meet their end.<br/><br/>Upon reaching the Third Rank, they could already be called powerhouses in the Great Zhou.<br/><br/>Gu Yang, with a thought, retracted his True Essence, narrowly avoiding setting the carriage on fire.<br/><br/>“Young Master, are you alright?”<br/><br/>The disturbance this time was too big and gave Zhang Xiao Hai a scare; he thought something had happened.<br/><br/>“I’m fine, keep driving.”<br/><br/>Gu Yang replied and shifted his attention to the small fiery Phoenix in his consciousness. He could clearly feel its existence.<br/><br/>“Is this the Original Spirit?”<br/><br/>He was extremely curious.<br/><br/>According to “Phoenix Dance Nine Heavens,” once you reach the Third Rank, your Martial Spirit will manifest. This must be what it’s referring to.<br/><br/>Yet, it seemed more like the Original Spirit mentioned in novels he had read in his previous life.<br/><br/>Perhaps, once one reaches the Divine Power Realm, it won’t be much different from practicing Daoist cultivation.<br/><br/>Gu Yang mused, feeling a surge of excitement.<br/><br/>PS: It’s Monday, and it just passed midnight, so it’s the thirtieth year. Let me first wish you all a Happy New Year. Please vote for me and give me monthly tickets. In the end, thank you to all the friends who rewarded me. Your support is my motivation to write..\t\t\t\t\t\t</div>", "images": {}, "success": true}