{"id": 54, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297821.html", "title": "Chapter 54 - Chapter 54: 054 Will Suffer Consequences Later.", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 54 - Chapter 54: 054 Will Suffer Consequences Later.</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 54: 054 will suffer consequences later.<br/><br/>Translator: 549690339<br/><br/>When Gu Yang saw Xu Ruomei again, his gaze was as serene as an ancient well.<br/><br/>He had figured it out. This woman was merely using him as a tool for her practice.<br/><br/>Her cultivation required her to live life as an ordinary person would: getting married, having children. It was just his luck that he was involved in this phase.<br/><br/>Once her cultivation period ended, she would sever all earthly attachments, reach the realm of Divine Power, and simply walk away without any remorse. The martial techniques of this world were certainly a complex and divergent bunch.<br/><br/>Could the “Dust Sword technique” truly be a demonic martial art?<br/><br/>But that was not all.<br/><br/>What truly chilled his heart was that by the end of their journey, when he died, Xu Ruomei was nowhere to be found. However, she had already ascended to the realm of Divine Power. If she had any vestiges of affection left, wouldn’t she have saved him from his untimely demise?<br/><br/>This woman was ruthless and devoid of any compassion.<br/><br/>Now that Gu Yang had recognized this deception for what it was, he would naturally avoid falling into it again.<br/><br/>He was increasingly realizing the impermanence of life. In his last simulation, Xu Ruomei had chosen to die with him just to kill him.<br/><br/>This time around, however, she was willingly agreeing to marry him.<br/><br/>The dissimilar outcomes were all due to his decision to go to another city and exchange the silver note, which only led to a slight delay in his mission to assassinate Lin Ge.<br/><br/>Having understood the future course of events, Gu Yang now knew how to deal with Xu Ruomei.<br/><br/>At the very least, she would not die because of the Element Sealing Bracelet.<br/><br/>Furthermore, Lin Zisheng had ceased causing troubles. Given that the Lin Family had sent over the key later, they must have discovered that Xu Ruomei had been hiding here.<br/><br/>Three months later, when she received the keys, she broke through to the third rank.<br/><br/>He had three more months left.<br/><br/>In this world, strength ruled above all. As long as his cultivation level surpassed hers, she would have no power over him.<br/><br/>Xu Ruomei was oblivious to Gu Yang’s change in disposition. Throughout her life, she had never felt as defeated and helpless as she felt during those times.<br/><br/>After losing her cultivation level, the usually aloof her was plagued by a sense of hopelessness and weakness.<br/><br/>Unbeknownst to her, she began to rely on the man who had shattered her Daoist Heart and who had saved her life. This was a sentiment she had never experienced before.<br/><br/>As Gu Yang sat facing her, infusing True Qi into the bracelet, sunlight streamed in through the window, illuminating his face and making it glisten.<br/><br/>A short while later, he abruptly finished his practice and then left the room without uttering a single word.<br/><br/>Watching Gu Yang’s retreating figure, Xu Ruomei was filled with a faint sense of melancholy.<br/><br/>All these emotions were new to her.<br/><br/>She abruptly understood how she was going to immerse herself back into the earthly realm.<br/><br/>“Brother Gu”.<br/><br/>When Gu Yang stepped out of Xu Ruomei’s room, he saw a familiar face. It was the young servant Zhi Xing. Seeing her cheery expression made him feel better instantly.<br/><br/>“What brings you here?” he asked her.<br/><br/>“The young mistress sent me to buy some cloth. I dropped by to visit Brother Gu on my way,” Zhi Xing replied, holding a basket. “These are meat crisps. I made them myself. Try some.”<br/><br/>Once they moved to the city, those past discomforts were slowly fading away.<br/><br/>Gu Yang accepted the basket with a hearty laugh and asked her, “So, are you enjoying your time with the Qingxuan Sect?”<br/><br/>“Oh, it’s great! Everyone there has been so nice,” Zhi Xing answered enthusiastically before abruptly freezing and staring past Gu Yang.<br/><br/>A woman of exceptional beauty had just walked out from behind him.<br/><br/>This was the first time she had met someone who could match her mistress’s grace and refinement.<br/><br/>More importantly, this woman was coming out from Gu Yang’s private chambers.<br/><br/>“Uh… Brother Gu, who’s this?” Zhi Xing asked.<br/><br/>Gu Yang hadn’t expected Xu Ruomei to come out. He introduced her saying, “This is Miss Lan.”<br/><br/>Zhi Xing fell silent after hearing his response.<br/><br/>She sat there for a while before getting up to leave.<br/><br/>Zhang Xiao Hai stood up to see her off.<br/><br/>As they reached the gate, Zhi Xing finally asked, “Who is… Miss Lan exactly?” “Well…” Zhang Xiao Hai was at a loss for words.<br/><br/>Seeing his hesitation, Zhi Xing understood the situation. She stomped her foot in aggravation. “Then, what should be done about our young mistress?”<br/><br/>Zhang Xiao Hai had no choice but to say, “Relationships aren’t a matter of first come, first served. It all comes down to who Guy Yang places his faith and love in. Your young mistress may have been with him through thick and thin, but that doesn’t necessarily mean she would win his favor. So, if someone got there first, whose fault is that?”<br/><br/>“What?”<br/><br/>Zhi Xing was so outraged her eyes welled up with tears. “Our young mistress would never share her husband with another woman! She won’t be a part of his delusional dreams!”<br/><br/>After finishing her statement, she ran, crying, to a parked carriage by the road.<br/><br/>Watching her retreating figure, Zhang Xiao Hai shook his head helplessly. With Gu Yang’s propensity for attracting females throughout his journey so far, the number of women by his side would only increase. Not to mention Miss Lan, there was still Ling Ling.<br/><br/>And she couldn’t accept this currently?<br/><br/>The future was bound to be tougher for her.<br/><br/>And just as he had thought, Miss Lan was indeed as stunning as a celestial immortal, not inferior to Miss Su in any way.<br/><br/>Gu Yang was completely unaware that in the eyes of others, he was slowly turning into a heartless womanizer. After returning to his room, he wrote a letter and placed it under a large stone outside the city at Ten Miles Pavilion.<br/><br/>This was the method of communication he had agreed upon with Ling Ling. If there was any urgnet matter, he would reach out to her using this approach.<br/><br/>It was clear that Ling Ling wasn’t alone and that she had assistance, but they had yet to reveal themselves.<br/><br/>The next day, when Gu Yang visited the large stone, the letter had disappeared, just as he expected.<br/><br/>He had written that letter to summon Ling Ling back to his side, so she could put aside whatever work she was doing.<br/><br/>According to his simulations, Ling Ling would only be able to procure one million taels in a year and three months.<br/><br/>Gu Yang couldn’t wait that long. Currently, he had an available balance of nearly one hundred and ninety thousand taels, which allowed him to perform thirty-eight simulations.<br/><br/>If he could manage to live till the age of forty in each simulation, that should be more than enough for him to reach the third rank.<br/><br/>Reaching the second rank might still be a bit difficult because he didn’t know how much the simulations would cost once he hit the third rank.<br/><br/>But the third rank was sufficient for now. As long as he reached the third rank, he could handle almost all the problems he was currently facing without any difficulty.<br/><br/>Back in Jiangzhou city, there was a treasure hidden by the Shadow Thief, waiting for him to discover. The wealth hidden there should be vast.<br/><br/>Once Gu Yang confirmed that the letter was sent, all he had to do was to wait patiently.<br/><br/>In the meantime, a rather minor incident occurred. Every three days, he would visit the Qingxuan Sect to practice with Su Qingzhi. For some reason, her attitude towards him had become exceedingly cold and aloof.<br/><br/>He had no idea what he had done to offend her.<br/><br/>But that did not affect him in any way. The only reason he visited her was to practice his martial arts techniques.<br/><br/>A dozen or so days quickly passed.<br/><br/>On one particular night, Ling Ling finally returned, albeit with conspicuous traces of injury and in a state of disarray.<br/><br/>“Here’s a hundred and eleven thousand, three hundred taels. You’re still owed eight hundred and eighty-seven thousand, seven hundred taels.”<br/><br/>She handed over a stack of bills, containing various denominations from several different banks.<br/><br/>Gu Yang could probably guess where these banknotes came from and a warmth spread through his heart.<br/><br/>She indeed never failed to give him relief..\t\t\t\t\t\t</div>", "images": {}, "success": true}