{"id": 50, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297817.html", "title": "Chapter 50 - Chapter 50: 050 1 Just Want To Make Money", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 50 - Chapter 50: 050 1 Just Want To Make Money</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 50: 050 1 just want to make money<br/><br/>Translator: 549690339<br/><br/>“Who are you planning to kill?”<br/><br/>Gu Yang went straight to the point after entering the room.<br/><br/>The woman, seeing that he was not one for small talk, responded, “The head of the Fang Family, Lin Ge, a Fourth Rank, adept in the use of poison.”<br/><br/>This choice did not surprise Gu Yang too much.<br/><br/>If she was willing to pay one hundred and fifty thousand taels, naturally the target wouldn’t be average. At least she was not asking him to kill Lin Zisheng or someone of Second Grade from the Fang Family. In that case, he would have to send her away directly.<br/><br/>A Fourth Rank. This could be a good business deal.<br/><br/>Without changing his expression, Gu Yang said, “I’m afraid I can’t help you with this. If I kill the head of the Fang Family, I won’t be able to bear their revenge. ”<br/><br/>The woman took off her straw hat, revealing her long hair that cascaded down like a black waterfall, and introduced herself, “Let me introduce myself, my name is Xue E. I am currently managing the Fang Family in place of my deceased husband.”<br/><br/>Gu Yang was surprised. The woman in front of him was indeed the wife of the former head of the Fang Family, the person who had a say in the family affairs, and allegedly, the lover of the second son of the Lin Family.<br/><br/>This woman was no simple matter. She came from an ordinary wealthy family. The former head of the Fang Family, who was exceptionally talented, had insisted on taking her as his wife.<br/><br/>Then, at quite the tender age, she was left a widow, yet managed to suppress many of the family’s elders and disciples. Despite being a woman, she became the person steering the Fang Family.<br/><br/>He initially thought she was able to suppress the people of the Fang Family by clinging to the second son of the Lin Family.<br/><br/>However, it didn’t seem that way.<br/><br/>She had actually secretly come to him, wanting to spend one hundred and fifty thousand taels to kill the head of her household.<br/><br/>That was no small sum of money.<br/><br/>With a sigh, Xue E said, “You may wonder why I plan to kill the head of my own household. In fact, Lin Ge is a spy that Lin Zisheng placed in our family. He is eroding the foundation of the Fang Family step by step. If we don’t eliminate him now, our family’s centuries-old foundation will be undermined.”<br/><br/>“We in the Fang Family have long wanted to kill this mongrel. If you are willing to eliminate him, our family will cover up for you.”<br/><br/>After listening to her, Gu Yang thought to himself, “What a mess.” “Aren’t you afraid that I could turn around and snitch to Dragon Tiger Gang?”<br/><br/>Xue E responded sadly, “In the end, it is no more than a life-and-death struggle with Lin Zisheng.”<br/><br/>Gu Yang was tapping the table lightly with his fingers, seemingly contemplating. In fact, he had already opened the system.<br/><br/>Whether or not he could take this job depended on how dangerous it was.<br/><br/>Using the life simulator to simulate once would make everything clear.<br/><br/>The cost he would spend stood only at five thousand taels, yet the profits could reach up to one hundred and fifty thousand. This deal was worth considering.<br/><br/>Seeing that Gu Yang seemed to be thinking, Xue E did not disturb him and quietly waited on the side.<br/><br/>She looked at the overly young man in front of her, possessing immense strength, yet reserved and mature, different from any talented martial artist she had seen before.<br/><br/>Her deceased husband was the most outstanding genius in the history of the Fang Family. A First Rank at thirty, he was no less than those towering figures.<br/><br/>Unfortunately, he ultimately failed to take that step.<br/><br/>If her husband were still alive, how could the Fang Family have fallen into such a predicament?<br/><br/>She felt a bit dejected.<br/><br/>At this moment, Gu Yang stopped tapping the table and said, “I agree to your request, but I need half the deposit in advance. Whether it is successful in the end, the deposit will not be refunded.”<br/><br/>“Agreed.”<br/><br/>Xue E was a decisive woman and agreed immediately, “By tomorrow morning, the silver note will be delivered to your residence.”<br/><br/>Once the negotiations were settled, she left the place.<br/><br/>Upon leaving the courtyard, an old woman emerged from the shadows, “Madam, did he agree?”<br/><br/>Xue E nodded, but her face showed no signs of relief.<br/><br/>“Are you worried that he will break his promise?”<br/><br/>She shook her head, “Even if he doesn’t make a move, we will. This visit was just a test. If it works, that’s great, if not, it won’t affect our plans.”<br/><br/>Ever since she learned that Gu Yang had defeated Tian Fei for the sake of wealth, she had developed this idea. If she could use money to solve the problem of Lin Ge, it would be the best.<br/><br/>She did not put all of her hopes on this unfamiliar young martial artist.<br/><br/>The old woman seemed to be worried, “Is it too hasty to take action now? As for the young master…”<br/><br/>“We don’t have time.”<br/><br/>Xue E interrupted her, “After Lin Zisheng obtained that object, his strength has grown by leaps and bounds. In a short period of time, he will succeed in reaching the First Rank. By that time, it will be the end of the Fang Family.<br/><br/>Now is our only chance.”<br/><br/>With that, she sneered, “Lin Zisheng is infatuated and actually dares to covet the protege of the Sword Palace’s master. The people of the Sword Palace are very protective of their own. If he fails to win her over, the protege will probably confront him later on. But if he succeeds, death is imminent. I’m afraid that the entire Lin Family will face a calamity.”<br/><br/>“No matter what, the Lin Family will not allow him to behave recklessly. And this is an opportunity we cannot miss.”<br/><br/>The old woman said nothing, having seemingly been persuaded by the arguments presented.<br/><br/>After sending off Xue E, Gu Yang looked at the system simulation.<br/><br/>[At the age of twenty-two, you have become a Fourth Rank martial artist. You came to Ping County City with Su Qingzhen and Ling Ling, defeated Tian Fei with one strike, becoming famous throughout Ping County.]<br/><br/>[During the night, Xue E of the Fang Family paid a visit. She wanted you to kill the head of the family, Lin Ge, offering one hundred and fifty thousand taels as a reward. You agreed.]<br/><br/>[Several days later, you sneaked into the residence of Lin Ge and killed him.]<br/><br/>[The following night, Xue E, true to her words, gave you the one hundred and fifty thousand taels in silver notes.]<br/><br/>[Half a year later, Xu Ruomei, who was at your doorstep, challenged you. She used a forbidden technique to forcibly advance to the Third Rank and killed you, dying from severe injuries in the process. You passed away at the age of twenty-three.]<br/><br/>From the outcome, after he killed Lin Ge, neither the Fang Family nor Lin Zisheng initiated any retaliation against him.<br/><br/>At least, not within half a year’s time.<br/><br/>Then, half a year later, he was killed by Xu Ruomei, who ranked sixth on the Beauty List.<br/><br/>Gu Yang had supposedly severed her Daoist Heart with a single stroke. How could she forcibly advance to the Third Rank? This made no sense at all.<br/><br/>Gu Yang now realized, whenever he obtained some good fortune, he would encounter enormous trouble.<br/><br/>After earning three thousand taels from Su Qingzhen, he offended the Liu Family and the fifth prince, subsequently being pursued countless times.<br/><br/>After obtaining a treasure map from the Shadow Thief, he angered Cao Yiyi, who became relentless in her pursuit.<br/><br/>After defeating Tian Fei, earning sixty-five thousand taels, combined with another treasure map, he inexplicably offended Xu Ruomei, a Sword Palace disciple, and irrevocably became enemies with her.<br/><br/>This was clearly a targeting him deliberately.<br/><br/>If he killed Lin Ge, there was no need for further guessing, he was bound to offend Lin Zisheng.<br/><br/>Everyone was not to be treated as fools. If Lin Ge was suddenly assassinated, it would be strange if they did not suspect him.<br/><br/>This Lin Zisheng, was a Second Rank powerhouse.<br/><br/>Despite these circumstances, Gu Yang decided to take this job. One hundred and fifty thousand taels, it was just too tempting.<br/><br/>He had long since come to terms with it. Even if he did nothing and offended no one, he would still inexplicably encounter trouble and mysteriously meet his end<br/><br/>As long as the job would earn him money, and wouldn’t instantly attract a deadly calamity, he would undertake it.<br/><br/>And as for the trouble it would bring, regardless of whether it was half a year later, as long as he had enough money, it wouldn’t be difficult to advance to the First Rank a few months later.<br/><br/>The key was to make money.<br/><br/>PS: This chapter makes up for the one from yesterday..\t\t\t\t\t\t</div>", "images": {}, "success": true}