{"id": 59, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297826.html", "title": "Chapter 59 - Chapter 59: 059 Collaborate Again", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 59 - Chapter 59: 059 Collaborate Again</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 59: 059 Collaborate Again<br/><br/>Translator: 549690339<br/><br/>The next day, after Gu Yang had helped Xu Ruomei share the absorption power of the Locking Bracelet of Origin, he didn’t leave immediately but asked, “Who was responsible for making those rankings?”<br/><br/>Xu Ruomei was somewhat surprised. These days, he would leave right after transferring his True Qi, never more than necessary, his attitude quite aloof.<br/><br/>It wasn’t until yesterday that his attitude finally began to change.<br/><br/>And now, he even initiated a conversation with her. She was somewhat delighted and said, “The Grandmaster List, Heaven’s Favorites List, Hidden<br/><br/>Dragon List, etc., that circulate these days, all originate from a Red Mansion.” “Red Mansion?”<br/><br/>“This mysterious Red Mansion is situated in Divine City. Its history predates even the nine influential families. According to some records from the Sword Palace, the Red Mansion began creating these rankings over a thousand years ago. It is said that the master of the Red Mansion has never left it. This is a power as mysterious as the Four Great Sacred Lands.”<br/><br/>Gu Yang found this explanation hard to believe. “Logically speaking, to be able to create such rankings that encompass all the powerful individuals in the world, they must have an enormous information network. Over a thousand years, wouldn’t the organization be bloated to an outrageous extent? How could they maintain secrecy?”<br/><br/>Xu Ruomei shook her head, “Inside the Red Mansion, there are at most a dozen people. There are only twelve people responsible for gathering information.”<br/><br/>Gu Yang was doubtful, “With just these twelve people, how accurate could the rankings they produce be?”<br/><br/>“It is rumored that the Red Mansion can determine the realms of all martial artists in Great Zhou due to a divine item from the ancient times. However, no one has seen it, and no one knows if this rumor is true or false.<br/><br/>A divine item?<br/><br/>Gu Yang imagined the power of this divine item and thought to himself, isn’t this just a magic treasure?<br/><br/>And it wasn’t just an ordinary magic treasure, at the very least it must be a spiritual treasure.<br/><br/>I bet this world has an absurdly high power limit. Once you cultivate to a certain realm, there’s no difference from immortality.<br/><br/>But he still had another question, “Why would they make these rankings and make them public? Merely to stir up trouble?”<br/><br/>Xu Ruomei said, “No one knows their intention. The Red Mansion has offended countless people with its actions. But over a thousand years, it has still managed to stand firmly within Divine City. There were even powerful individuals who infiltrated the mansion in an attempt to reason with the owner, but none of them ever came out.<br/><br/>No wonder it could compete with the Four Great Sacred Lands, not even those in the Divine Realm could force out the owner of the Red Mansion.<br/><br/>Gu Yang made a mental note of the Red Mansion.<br/><br/>Suddenly, Xu Ruomei asked, “Have you made it onto the Hidden Dragon List?” His sudden interest in the rankings must not be without reason.<br/><br/>Gu Yang sighed, “Yes, I am sure to face endless trouble in the future. This Red<br/><br/>Mansion really causes people trouble.”<br/><br/>Not to mention anything else, the person he bumped off to seventh place would certainly not accept it and would seek him out to settle the score.<br/><br/>And then there would be others of the third rank who want to make a name for themselves and challenge him to a match.<br/><br/>When the time comes, if he goes too far and injures or kills someone, he will offend the power behind them.<br/><br/>If he goes too easy and ends the match prematurely, the more his fame spreads, the more people will come to challenge him. It would be unbearably annoying anyway.<br/><br/>Regardless of how he handles it, it would be a hassle.<br/><br/>Gu Yang suddenly thought of Su Qingzhi. One could say it was her ascension to the Beauty List that led to the ruin of her family and her current predicament.<br/><br/>If anyone should hate the Red Mansion, it should be her, right?<br/><br/>Knock, knock.<br/><br/>At this moment, there was a knock on the door. “A guest has arrived.” Gu Yang stood up to make his leave.<br/><br/>Entering the living room, Gu Yang saw the distinguished guest.<br/><br/>Hidden under a black cloak, the guest only took off their hat upon seeing him.<br/><br/>It was Xue E, the current head of the Fang Family. She bowed respectfully,<br/><br/>“Congratulations on your ascent to the seventh spot on the Hidden Dragon List.<br/><br/>No doubt Divine Power awaits you in the future.”<br/><br/>“Your information network is quite impressive.”<br/><br/>Gu Yang was somewhat surprised. He had just broken through to the third rank yesterday, and by today, even the Fang Family knew about it. He didn’t know where they got their information from.<br/><br/>“The update of the Hidden Dragon List is a significant event. In one day, news about you has spread across the Great Zhou. Your reputation is wide-reaching now.” Xue E adopted a humble posture, the exact opposite from the last time they met.<br/><br/>Seeing that he was unmoved by the flattery, she got straight to the point, “May I ask why you have summoned me?”<br/><br/>This time, Zhang Xiao Hai went to the Fang Family residence, and Gu Yang had sent for her.<br/><br/>Gu Yang said straightforwardly, “I enjoyed our previous cooperation. Therefore, I wish to cooperate with you again.”<br/><br/>“I would like to hear the details.”<br/><br/>“I can help you and the Fang Family get rid of Lin Zisheng’s control.”<br/><br/>These casually uttered words shook Xue E to her core. She looked up abruptly, her gaze uncertain.<br/><br/>She never expected Gu Yang to say something like this.<br/><br/>Where was he getting his confidence?<br/><br/>The Lin Family, although only one of the branches of the nine prominent Lin clans, was formidable. Moreover, Lin Zisheng, the Lin family’s second son, had a Second Grade cultivation level. Where did Gu Yang, who only had a Third Rank cultivation level, get the confidence to get rid of him, regardless of any backing?<br/><br/>Of course, based on their previous interaction, she didn’t think Gu Yang was a cocky fool; he must have something to rely on.<br/><br/>Xu Ruomei quickly composed herself and asked the most crucial question, “What kind of price will the Fang Family and I have to pay?”<br/><br/>“I have no interest in you or the Fang Family. I won’t involve myself in the affairs of the Fang Family, and I won’t plant anyone in your midst either.”<br/><br/>As Gu Yang said this, he observed the change in Xu Ruomei’s expression and concluded, “I only want money.”<br/><br/>Xue E asked in a deep voice, “How much do you want?”<br/><br/>“That would depend on what the Fang Family is worth to you in your heart.” Gu Yang barely smiled. Now, with the decision-making power in his hands, it was natural for him to await her offer.<br/><br/>“Take your time, we’re not in a hurry, you can think about it slowly. I will give you two days to consider. It all depends on your sincerity.”<br/><br/>Xue E looked indecisive, then clenched her teeth and said, “Can you really take care of Lin Zisheng and the Lin Family behind him?”<br/><br/>Speaking of the Second Grade, the Fang Family had several of them too. Killing Lin Zisheng was not impossible, but the Lin Family behind him was the actual behemoth that made them fearful.<br/><br/>If Gu Yang could really settle with the Lin Family and not interfere in Fang Family matters, she would willingly pay any amount.<br/><br/>Gu Yang smiled, “I can get the job done first, and collect the money afterwards.<br/><br/>Xue E didn’t say anything else and bowed her head, “I will take my leave now.” Her attitude was even humbler now.<br/><br/>Seeing her like this, Gu Yang knew that this business deal was almost settled. He just wasn’t sure how much money this powerful family like the Fang Family could offer.<br/><br/>PS: Still updating on the first day of the New Year. It’s the beginning of the month, so please vote for us and recommend us..\t\t\t\t\t\t</div>", "images": {}, "success": true}