{"id": 52, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297819.html", "title": "Chapter 52 - Chapter 52: Trouble 052", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 52 - Chapter 52: Trouble 052</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 52: Trouble 052<br/><br/>Translator: 549690339<br/><br/>Gu Yang walked over and helped Xu Ruomei up.<br/><br/>“I don’t need your help.”<br/><br/>After Xu Ruomei got up, she wanted to shake his hand off, but she didn’t have the strength to do so.<br/><br/>She didn’t want to owe this man any more favors.<br/><br/>Gu Yang said irritably, “You think I enjoy helping you? If the Sword Palace hadn’t been so domineering, I wouldn’t even bother about your life and death.<br/><br/>If you want to die, don’t involve me.”<br/><br/>If he left her here and she died, the Sword Palace would definitely hold him accountable.<br/><br/>Xue E might hide it from the Lin family, because the Lin family wished to absorb the Fang family. However, she would undoubtedly not cover for him with the Sword Palace.<br/><br/>At this moment, there were footsteps outside.<br/><br/>“Silence.”<br/><br/>Gu Yang grabbed Xu Ruomei’s arm, jumped over the wall, and disappeared into the night.<br/><br/>Right after he had left, those who arrived discovered Lin Ge lying in a pool of blood. Instantly, the entire Lin residence was thrown into chaos.<br/><br/>Gu Yang took Xu Ruomei home, dropped her in the courtyard, and she almost fell the moment he let go of his hand.<br/><br/>Something’s not right!<br/><br/>Gu Yang took a closer look and noticed her face was devoid of color and her body temperature was constantly dropping – she was getting weaker and weaker.<br/><br/>He rolled up her sleeve at the wrist and saw a silver bracelet clinging tightly to her skin, emitting a sinister glow under the moonlight.<br/><br/>As soon as his fingers touched it, he felt the True Qi in his body being tugged and drawn into the bracelet.<br/><br/>“What is this thing?” Gu Yang exclaimed in surprise.<br/><br/>“The Essence Sealing Bracelet… made especially to seal off… the True Essence of a Third Rank Martial Artist or above…” Xu Ruomei managed to say, panting a little.<br/><br/>No wonder she couldn’t bear it; she was only Fourth Rank.<br/><br/>But it seemed; not only did this thing absorb True Qi, but also life force.<br/><br/>Otherwise, she wouldn’t be this weak.<br/><br/>Martial artists had extremely tough bodies, far stronger than ordinary people.<br/><br/>“It needs to be unlocked as soon as possible. You’re not going to hold up much longer.” Gu Yang said in a deep voice.<br/><br/>“Lin Zisheng… should have… the key…”<br/><br/>He was joking right? Lin Zisheng was Second Grade, Gu Yang certainly couldn’t mess with him.<br/><br/>He asked, “What about your Sword Slave?”<br/><br/>“He’s… tied up by Lin Zisheng”<br/><br/>“Otherwise, I’ll take you back to Sword Palace. Your master should know how to unlock the Essence Sealing Bracelet.”<br/><br/>Xu Ruomei’s voice was weak, but her attitude was firm, “The Sword Palace…<br/><br/>has its rules. You can’t return to the mountain until you reach the Third Rank!”<br/><br/>“What sort of nonsensical rule is that? Is it more important than your life?<br/><br/>You… You’re going to die if this continues.” “Don’t insult my Sword Palace.”<br/><br/>Xu Ruomei’s gaze turned extremely serious.<br/><br/>Okay, a person brainwashed by a sect.<br/><br/>Tired of arguing, Gu Yang simply dumped her in the room where Ling Ling used to stay.<br/><br/>“Just as I thought, earning 150,000 taels is not easy. I knew I would run into trouble.”<br/><br/>This truly was a hot potato. He couldn’t just let her die here.<br/><br/>After a moment of thought, Gu Yang decided to pay a visit to the Qingxuan Sect. Perhaps, they might know how to unlock the Essence Sealing Bracelet.<br/><br/>“An Essence Sealing Bracelet?”<br/><br/>Daoist Priestess Jingyu didn’t expect Gu Yang to visit her in the middle of the night to ask about this. She said, “This is an Abnormal Treasure handed down from the ancient times. Even a First Rank powerhouse would have their True Essence sealed off and would not be able to free themselves.”<br/><br/>“In this world, there are only a handful of Essence Sealing Bracelets. To unlock it, there are only two methods – One is to use the key. The other is for a Divine Power Stage powerhouse to use their own Mana to burst it open, and then naturally unlock it.”<br/><br/>“Wait, a Fourth Rank Martial Artist is locked by the Essence Sealing Bracelet?<br/><br/>That’s dangerous. The only way is to find someone to help, actively infuse True<br/><br/>Qi into it, and share the absorption force produced by the Essence Sealing Bracelet.”<br/><br/>After hearing this, Gu Yang took his leave right away, “Thank you for the guidance, Priestess.”<br/><br/>The round trip took less than an hour. When Gu Yang got back, Xu Ruomei was in even worse condition.<br/><br/>He suddenly thought of a problem. According to the simulation from yesterday, she wasn’t in danger if he hadn’t saved her today.<br/><br/>After all, she was still very much alive and kicking when she came to seek revenge six months later.<br/><br/>“Could it be that by saving her, I actually harmed her?”<br/><br/>Gu Yang couldn’t help but ponder this question.<br/><br/>However, he didn’t hesitate in his actions. He placed his hand on the Essence Sealing Bracelet, and immediately felt a terrifying suction force, which quickly absorbed most of his True Qi.<br/><br/>He let go of his hand, sat cross-legged on the bed, and started to meditate and recover his depleted True Qi.<br/><br/>The long night finally passed.<br/><br/>Gu Yang opened his eyes to find Xu Ruomei awake. Her complexion had improved a lot, and she no longer looked as pale as before. Gu Yang let out a sigh of relief.<br/><br/>It seemed; she wasn’t going to die for the time being.<br/><br/>Xu Ruomei looked at him with a complicated gaze. She moved her lips as if she wanted to say something, but, in the end, she remained silent.<br/><br/>“Stay here for the time being. Leave when your Sword Slave finds you.”<br/><br/>Xu Ruomei corrected him, “He’s my Senior Uncle.”<br/><br/>“Don’t forget, you owe me twice now. If you want to repay me, it’s quite simple. Just give me money.” Gu Yang emphasized again.<br/><br/>PS: I know this chapter is a bit short. It’s because it’s getting late. I’ll make up for the missing length in the next chapter..\t\t\t\t\t\t</div>", "images": {}, "success": true}