{"id": 51, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297818.html", "title": "Chapter 51 - Chapter 51: 051 Lock Bangle", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 51 - Chapter 51: 051 Lock Bangle</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 51: 051 Lock Bangle<br/><br/>Translator: 549690339<br/><br/>Early the next morning, a rather ordinary-looking man came to seek an audience with Gu Yang. He claimed that his master had sent him to deliver something.<br/><br/>With these words, he handed an envelope to Gu Yang.<br/><br/>Inside the envelope was a stack of silver notes amounting to seventy-five thousand taels.<br/><br/>There was also a map of Ping County City, with Lin Ge’s residence clearly marked on it, along with a detailed schedule of his usual outings.<br/><br/>In addition to that, there was a portrait of Lin Ge.<br/><br/>After Gu Yang checked everything, he said, “Tell your master to wait for the news tonight.”<br/><br/>After the man left, he quietly left Ping County City again.<br/><br/>This time, he went to other cities and visited three different ones before he successfully exchanged all seventy-five thousand taels.<br/><br/>After topping up, the system balance reached more than one hundred and nineteen thousand.<br/><br/>This unprecedented number made him feel particularly secure.<br/><br/>After killing Lin Ge tonight, the remaining seventy-five thousand taels will bring his total balance to approximately two hundred thousand.<br/><br/>Two hundred thousand, enough for forty simulations.<br/><br/>Assuming that he could live for ten years in each simulation, forty simulations would equal four hundred years.<br/><br/>With such a long time period, it should be enough to practice “Phoenix Dance Nine Heavens” up to Third Rank, right?<br/><br/>The prerequisite was to handle Xu Ruomei, who was going to seek revenge half a year later.<br/><br/>The thought of this gave Gu Yang a headache.<br/><br/>When he parted ways with Ling Ling, he certainly didn’t anticipate the variable of Xu Ruomei, which completely upset his plans.<br/><br/>He originally thought of having Ling Ling earn more money. If she could really bring in a million taels, he estimated he could break through to the First Rank, or even reach the Divine Power realm.<br/><br/>Man proposes, God disposes.<br/><br/>Now, he could only let Ling Ling come back early.<br/><br/>By the time Gu Yang returned to Ping County City, it was already late at night. Instead of going home, he headed directly to the Lin mansion.<br/><br/>In no time, he was outside a courtyard.<br/><br/>According to Lin Ge’s usual schedule, he should be home by this time.<br/><br/>Gu Yang entered the courtyard, bypassed the servants in the mansion, and headed straight for the main house.<br/><br/>If possible, he didn’t want to harm the innocent.<br/><br/>Killing people like Lin Ge wasn’t a big deal, but if he could avoid killing the servants in the mansion, it was better not to.<br/><br/>The courtyard was not very big. The layout was similar to where he lived, so he quickly found the main house.<br/><br/>In order to succeed in one strike, Gu Yang used a stealth technique he got from a simulation. He held his breath, closed his pores, and even slowed his heartbeat, making his body temperature similar to the environment.<br/><br/>After reaching the Fourth Rank, one’s spiritual sense becomes extremely sensitive. Only this method would possibly fool the enemy.<br/><br/>When Gu Yang came to the door of the main house, his intuition told him there was no one inside.<br/><br/>“He’s not in the house.”<br/><br/>He frowned. Was he going to have to catch a servant and ask?<br/><br/>Just then, there was a sound of footsteps outside.<br/><br/>Gu Yang hid behind a pillar and looked in the direction of the sound. He saw a sedan chair being carried in and then inside the house.<br/><br/>The one leading the group looked quite like the man in the painting. It should be Lin Ge, his target for the mission.<br/><br/>Who was in the sedan chair?<br/><br/>Gu Yang distinctly heard a heartbeat coming from the sedan chair and began to speculate.<br/><br/>Soon, the bearers left, and Lin Ge closed the door.<br/><br/>“Miss Xu, I’m sorry.”<br/><br/>This was Lin Ge’s voice from inside the house.<br/><br/>Surname Xu, could it be her?<br/><br/>Gu Yang thought of someone but then thought it unlikely. There was a Second Rank Sword Slave by her side, so how could she possibly be forcibly brought here?<br/><br/>Immediately after, a cold voice sounded, “Get your dirty hands off.” “Miss Xu, rest a while. The young master should be back soon.”<br/><br/>“If it’s not… you can’t take my sword.”<br/><br/>“Miss, you should rest. This Yin Yuan bracelet, even a First Rank martial artist can’t break it. Don’t waste your energy.”<br/><br/>After Lin Ge finished speaking, there was a creaking sound as he pushed the door open.<br/><br/>Suddenly, his pupils constricted as a sharp edge flashed before his eyes.<br/><br/>Bad news—<br/><br/>Just as this thought flashed across his mind, the next moment, he felt a cold sensation at his throat, and his body lightened as he collapsed to the ground, dead without knowing why.<br/><br/>Gu Yang achieved a quick kill and looked at the body on the ground.<br/><br/>This was too easy.<br/><br/>He was nowhere near as tough as Tian Fei.<br/><br/>That night, Gu Yang brought along a sword, specifically so people wouldn’t suspect him.<br/><br/>Of course, how effective this would be, he couldn’t say.<br/><br/>“Master Uncle?”<br/><br/>Inside the house came the same cold voice as before.<br/><br/>Gu Yang stepped over the corpse, walked into the room, and saw a familiar face.<br/><br/>It really was her.<br/><br/>It was Xu Ruomei, whom he had met once before. She was still dressed in white but looked a little dishevelled with dust on her clothes and her hair a bit messy.<br/><br/>She didn’t have the same sharp temperament as during their last encounter and appeared somewhat weak.<br/><br/>“Everyone says that Lin Zisheng is lustful, but I didn’t expect him to be bold enough to even lay hands on a disciple of the Sword Palace!”<br/><br/>Gu Yang had figured out what had happened.<br/><br/>However, why hadn’t this happened in yesterday’s simulation?<br/><br/>He was puzzled. Logically speaking, if he saved Xu Ruomei in the simulation, he would definitely remember.<br/><br/>“Could it be that it was simply because I went out of town to get the silver, thus delaying the time?”<br/><br/>In the simulation, he naturally didn’t need to convert the silver notes into silver ingots. Therefore, the time to kill Lin Ge would definitely be earlier.<br/><br/>Such a small time difference, yet it led to this situation. One could only say that everything is uncertain in this world.<br/><br/>“It’s you!”<br/><br/>Inside the house, Xu Ruomei also saw Gu Yang and recognized him immediately.<br/><br/>Although Gu Yang had his face covered, she could instantly recognize him, even if he turned into ash.<br/><br/>Gu Yang said, “It appears you’ve run into some trouble.”<br/><br/>“You—<br/><br/>Xu Ruomei’s gaze was complicated. She had been captured by Lin Ge and her cultivation had greatly declined after her Daoist Heart was broken.<br/><br/>In the face of danger, Gu Yang was the one who saved her.<br/><br/>Gu Yang hastened to say, “No need to thank me, I didn’t specifically come to rescue you. I came to kill him.”<br/><br/>Upon hearing his words, Xu Ruomei turned a shade paler and said, “The fact that you saved me is true. I will certainly repay this kindness in the future.” “If you want to repay me, it’s simple. Just give me money. Do you have money?”<br/><br/>Xu Ruomei was taken aback and then reached into her bosom to throw a bag at him.<br/><br/>Gu Yang opened it to see quite a few golden beads and leaves worth one to two thousand taels. He looked disappointed, “Is your life only worth this much?”<br/><br/>Xu Ruomei gritted her teeth and said, “Consider me indebted to you. Next time,<br/><br/>I will definitely repay you with money.”<br/><br/>“Hope you follow through with your words.”<br/><br/>Gu Yang did not give any good expression to this potential enemy. If it weren’t for her powerful Divine Power Realm mentor, he would have killed her on the spot without wasting words. “Let’s go, I’ll take you out of here.”<br/><br/>“No need, I can go by myself—<br/><br/>As Xu Ruomei tried to stand up, she suddenly lost her balance and fell to the ground.<br/><br/>Gu Yang was taken aback. A Fourth Rank martial artist falling on flat ground was just outrageous.<br/><br/>His gaze fell on the silver bracelet on Xu Ruomei’s wrist.<br/><br/>Earlier, he heard Lin Ge mention that it was a Yuan Locking bracelet.<br/><br/>Could it be because of this bracelet?<br/><br/>PS: There’s another chapter coming after twelve midnight..\t\t\t\t\t\t</div>", "images": {}, "success": true}