{"id": 58, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297825.html", "title": "Chapter 58 - Chapter 58: 058 Making The World Move", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 58 - Chapter 58: 058 Making The World Move</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 58: 058 Making the World Move<br/><br/>Translator: 549690339<br/><br/>In Divine City, thousands of kilometers away from Jiangzhou, there was rain in the early morning.<br/><br/>Outside the gate of the martial arts academy stood a wooden board, its surface paint almost entirely peeled off from exposure to the wind and sun over the years.<br/><br/>Pasted on the board in a row were red sheets of paper, each inscribed with a name.<br/><br/>Some offers had not been replaced for a long time and had almost completely faded.<br/><br/>Suddenly, two oil-paper umbrellas walked over from a distance. The newcomers, an old man and a young man, were both armed, obviously martial artists.<br/><br/>The two stood in front of the board, and the younger man stared in disbelief at what stood before him. “Is this the legendary Heaven’s List?”<br/><br/>Stroking his beard, the old man glanced at the various listings on the board and smiled, “When I first came here, I was even more surprised than you.”<br/><br/>On this board were several lists lauded throughout Jianghu: the Grandmaster List, First Rank List, Heaven’s Chosen List, Hidden Dragon List, and Beauty list…<br/><br/>All lists were from there.<br/><br/>It is said that these lists have been around for over a thousand years and their accuracy has been proven over countless years.<br/><br/>Looking upon the red paper on the board, the youth realized that each name listed was of a famous strongman. The stark contrast numbed his spirits.<br/><br/>The old man mused, “For us martial artists, it would not be a waste of our lives to leave our names on this list.”<br/><br/>The young man couldn’t help but imagine how glorious it would be one day if his name could appear on one of these lists. His blood boiled at the mere thought.<br/><br/>However, judging from the faded condition of the red paper, it appeared that the Beauty List was the newest, and even that was nearly a year old.<br/><br/>The oldest list naturally would be the Grandmaster List, ranked only by peerless strongmen of Divine Power Realm. It had not been replaced in many years.<br/><br/>As they were busy talking, an old man came over, limping, with one hand holding an umbrella and the other a bucket. Tucked under his arm was a red sheet of paper.<br/><br/>Rush.<br/><br/>The old man suddenly tore a list from the board.<br/><br/>“What are you doing—”<br/><br/>The youth, having just accepted the disparity between the legendary list and the shabby reality, was enraged at the sight of someone daring to deface the list. His words were cut short as the older man beside him covered his mouth.<br/><br/>With an excited look on his face, the older man said, “Shut up, this is the one who changes the list. There’s been a change in the ranking.”<br/><br/>What?<br/><br/>The youth was stunned, unable to comprehend how a lame old man could be the one in charge of changing the list.<br/><br/>Wait, what did he just say? The list was changed?<br/><br/>Bolting upright, the youth realized that the torn off list had been the Hidden Dragon List.<br/><br/>The Hidden Dragon List ranked the highest cultivators under the age of thirty, listing only the top twenty.<br/><br/>All those on the list were at least of the Third Rank.<br/><br/>The top five were even of the Second Grade.<br/><br/>All those listed on the Hidden Dragon List were the most outstanding martial talents of their generation. Even though they weren’t as dazzling as the figures on the Heaven’s Chosen List, they weren’t far behind.<br/><br/>As it turned out, the number of strongmen of the Divine Power Realm that came from the Hidden Dragon List was higher than those arising from the Heaven’s Chosen List.<br/><br/>If his memory served him well, it had been over a year since the last change in the Hidden Dragon list.<br/><br/>In Jianghu, of all the lists, three garnered the most attention: the Beauty List, the Heaven’s Chosen List, and the Hidden Dragon List.<br/><br/>Astonishing beauty was loved by all, but it was as hard as ascending to heaven to catch even a glimpse of them.<br/><br/>The people on the Heaven’s Chosen List were known for their legendary prowess, but they were rarely ever seen in Jianghu, having secluded themselves for rigorous cultivation. All that remains of them are legends.<br/><br/>Only those on the Hidden Dragon List were quite active. There were often tales of their exploits, making it the hottest list.<br/><br/>The youth was well versed in the people on the Hidden Dragon List. The twenty people who ranked had not yet reached the age of thirty.<br/><br/>That is to say, the change in the list was not due to someone reaching the age limit, but instead there had been a newcomer who had surpassed those already listed and ascended to the Hidden Dragon List.<br/><br/>Her heart pounded with the thrill of the unexpected news, his eyes never leaving the lame old man changing the board, eager to see the newcomer in the rankings.<br/><br/>But that old man moved at a snail’s pace. He deliberated as he lifted the brush, smearing paste over the old listing before attaching the new one.<br/><br/>Both the young and old anxiously took a step forward. Their gaze shifted to the very bottom of the list, checking each familiar name. All the names were moved down by one place.<br/><br/>By the time they reached the tenth place, they were astounded to see the same name that previously ranked ninth.<br/><br/>The two could not put into words the shock they felt.<br/><br/>On his first appearance, he had shot straight into the top ten. How could this be possible?<br/><br/>Finally, they reached the seventh-ranked name on the list. “Seventh place, Gu Yang, from Jiangzhou.”<br/><br/>Eight simple words sent waves of shock through their hearts.<br/><br/>Generally, the Hidden Dragon List specifies which family or sect they are from.<br/><br/>They had never seen such a brief description before.<br/><br/>This implied that the Red Mansion, which issued the list, knew little about this person, even his origins.<br/><br/>This is too mysterious.<br/><br/>The rain gradually stopped, and another person came to the list board. After noticing the change in the ranking, he took a quick glance and hurried off.<br/><br/>Before long, more and more people gathered before the list.<br/><br/>And the news of the change in the Hidden Dragon List and the name Gu Yang started to spread. In no time at all, the news would reach every corner of Jianghu.<br/><br/>In Ping County town, the first to receive the news was the Prefecture, as the imperial court’s reports were always the fastest.<br/><br/>“Gu Yang?”<br/><br/>When Prefect Wu Huai saw that the newcomer to the Hidden Dragon List was this name, his gaze sharpened before sliding down again to see that it indeed originated from Jiangzhou.<br/><br/>Could it be him?<br/><br/>Gu Yang’s defeat of Tian Fei with one stroke just a month ago was still fresh in Wu Huai’s memory.<br/><br/>But wasn’t he just a Fourth Rank?<br/><br/>How did he suddenly become Third Rank and ascend as the seventh on the Hidden Dragon List!<br/><br/>The gulf between the Third and Fourth Rank was just a gap in the realm, but their weight was worlds apart.<br/><br/>Being seventh on the Hidden Dragon List implied boundless potential, ensuring he would achieve First Rank and even had the potential of reaching the Divine Power Realm.<br/><br/>He hurriedly summoned his most trusted clerk over to deliberate.<br/><br/>The second to receive the news was the Fang Family. Despite its decline over the years, it still retained its robust information network.<br/><br/>“Seventh on the Hidden Dragon List?”<br/><br/>When Xue E saw the news, she was left dumbfounded. Her immediate reaction was, “Could it be someone else with the same name and surname?”<br/><br/>Standing beside her was the old crone who shook her head, “Unlikely.”<br/><br/>Similarly named people were common, but equally named people with such high cultivation were almost impossible.<br/><br/>Furthermore, the Hidden Dragon List clearly stated that Gu Yang was from Jiangzhou. How could there be so many coincidences?<br/><br/>Xue E swallowed hard, “The last time I saw him, he was clearly only a Fourth Rank. Could he have… advanced to Third Rank and ascended to the seventh place of the Hidden Dragon List?”<br/><br/>The crone said solemnly, “What he cultivates in is likely very unusual.” “You mean to say, an unparalleled divine technique?”<br/><br/>PS: Thanks, everyone, for your votes. Starting tomorrow, I have to prepare more chapters, hoping for a mass release when I come online..\t\t\t\t\t\t</div>", "images": {}, "success": true}