{"id": 61, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297828.html", "title": "Chapter 61 - Chapter 61: 061 God Annihilation Nine Styles", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 61 - Chapter 61: 061 God Annihilation Nine Styles</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 61: 061 God Annihilation Nine Styles<br/><br/>Translator: 549690339<br/><br/>Upon hearing Gu Yang mention the Fang Family, Lin Zihua’s gaze wavered slightly, and he asked, “Is this what Miss Xu means?”<br/><br/>There are a total of seventeen counties under Jiangzhou, Ping County is one of the five large counties. How could the Lin Family easily give up such a territory?<br/><br/>Gu Yang smiled faintly and brought up a completely unrelated matter. “On my way to Ping County, a swordsman named Zhou Qing stopped my carriage and even attacked me. But, I killed him with one strike. Mr. Lin, do you know the origins of this Zhou Qing?”<br/><br/>Lin Zihua nodded, “This man is a lone swordsman from Xiang County. He actually offended Brother Gu, he indeed deserved to die.”<br/><br/>From his face, Gu Yang couldn’t see any abnormalities. He couldn’t help but inwardly praise Lin Zihua for being as shrewd as expected from a successor of a big family.<br/><br/>If he didn’t already know that Zhou Qing was a man of the Lin Family, he might have been deceived by him.<br/><br/>He said, “Actually, I am a wandering individual. I can’t stay in one place for too long. I will leave Ping County in one to three years, at most.”<br/><br/>This statement revealed that he had no intention of settling down in Ping County, and he would leave in a few years.<br/><br/>Lin Zihua said with some regret, “How good it would be if Brother Gu could settle here for a long time, so that we could often discuss martial arts together. ”<br/><br/>Hypocrisy!<br/><br/>Gu Yang smiled without speaking, thinking to himself that he should keep his interactions with Lin Zihua to a minimum in the future, since he seemed to never speak the truth.<br/><br/>Lin Zihua pondered for a moment, then said, “As to the matter of the Fang Family, I’m afraid it’s not within my power to decide. After all, this has always been my younger brother’s territory. If I interfere, he will be discontent.”<br/><br/>The implication was that the Lin Family would not interfere in the affairs of Ping County. But, whether Gu Yang could acquire Ping County would depend on if he can handle Lin Zisheng.<br/><br/>This man was not even forty, yet he had such cunning and crafty ways, evidently unwilling to suffer any loss.<br/><br/>The fate of both Ping County and the Fang Family was decided within a few words between these two men.<br/><br/>Xue E, who was listening from behind the screen, was so nervous that she was clutching her sleeves tightly- She was both frightened and excited after hearing the two men’s conversation. However, when they started to talk about other topics, she lost interest.<br/><br/>Finally, Lin Zihua took his leave. Besides negotiating about Ping County and the Fang Family, he also tried to subtly probe Gu Yang’s lineage and origins.<br/><br/>Of course, his main purpose for this visit was to apologize to Xu Ruomei and present the key to the Lock Yuan Bracelet.<br/><br/>Gu Yang sent Zhang Xiao Hai to bring Xu Ruomei. She didn’t intend to see Lin Zihua, but she accepted the key.<br/><br/>Lin Zihua obviously knew that he had offended her severely this time, and the matter wouldn’t be settled so easily. But there was nothing he could do. When facing a top-tier power like Sword Palace, even the Lin Family couldn’t afford to offend them.<br/><br/>Since it was Lin Zisheng who caused the trouble, he could bear the consequences himself.<br/><br/>This was the purpose of his visit: to clarify his stance and distance himself from Lin Zisheng.<br/><br/>After Lin Zihua left, Xue E came out and ceremoniously paid respects, “Five hundred thousand liang will be delivered tomorrow.”<br/><br/>For the Fang Family, the scariest part about Lin Zisheng was not his cultivation level, but the backing of the Lin Family behind him.<br/><br/>Now, Lin Zihua, the future head of the Lin family, stated that the Lin Family would no longer interfere in the Fang Family’s matters. With only Lin Zisheng and the Dragon Tiger Gang remaining, things became much easier to handle.<br/><br/>What a cunning move!<br/><br/>Gu Yang inwardly praised, having chosen to cooperate with her and refused Fang Kaihui’s temptation of half of the Fang Family’s wealth was indeed not in vain.<br/><br/>Once Lin Zihua left Gu Mansion, he got into a luxurious carriage and started to ponder deeply.<br/><br/>At this moment, a voice sounded from outside, “The head of the Listening<br/><br/>Wind Hall greets the eldest young master.”<br/><br/>He asked, “In Zhou Qing’s last operation, who gave him the order?” The person outside answered, “It was the seventh young master.”<br/><br/>“Why did the seventh young master send Zhou Qing to kill him?” Lin Zihua furrowed his brows. The seventh young master was not a fool, why would he send a Fifth Grade to kill a Third Rank?<br/><br/>He ordered, “Send a letter to the seventh young master to find out what exactly happened.”<br/><br/>“Yes.”<br/><br/>“Have the investigations about Gu Yang’s background revealed anything?” “Not yet, we only know that this person first appeared in Tianshui City,<br/><br/>accompanied by three people, two females and one male. The two females both wore veils and were called his maids.”<br/><br/>Lin Zihua thought about it, “Tianshui City, could they have come from Lian Mountain?”<br/><br/>“Another thing, after arriving in Ping County, the two females left his side. A few days ago, one of the girls arrived in a carriage from the Qingxuan Sect.”<br/><br/>“Check their identities at Qingxuan Sect.”<br/><br/>“Yes.”<br/><br/>Lin Zihua coldly ordered, “Also, send a message to the Dragon Tiger Sect telling my second brother that Gu Yang is interested in Ping County.”<br/><br/>If he wants Ping County, let’s see if he has the ability.<br/><br/>“Yes.”<br/><br/>On the other hand, after returning to his room, Gu Yang was pondering over something. “What will happen next?”<br/><br/>Every time he got some benefits, he would encounter some major trouble.<br/><br/>This time, he had made over two million liang from the Fang Family. What trouble would he run into next?<br/><br/>“Would you like to use the Life Simulator? Each use costs 20,000 gold coins.”<br/><br/>“Yes.”<br/><br/>The system’s balance was instantly deducted by 20,000, leaving only 140,000.<br/><br/>“At the age of 22, you have reached the Third Rank and are the seventh on the<br/><br/>Hidden Dragon List, gaining fame throughout the world. You empathized with<br/><br/>Xue E’s situation and decided to help the Fang Family break free from the Lin<br/><br/>Family’s control, receiving his promise during a negotiation.”<br/><br/>“A few days later, a mysterious Second Grade powerhouse suddenly launched a sneak attack, severely injuring you. Fortunately, Xu Ruomei bought some time for you, allowing you to escape.”<br/><br/>“Afterwards, you were pursued and attacked repeatedly. Your enemies attempted to capture you alive without killing you, giving you several opportunities to escape. In the end, you were assisted by a mysterious old man, who helped treat your injuries and escape.”<br/><br/>“Under the guidance of the mysterious old man, you practiced vigorously for several months, greatly advancing your saber technique. Just as your enemies were closing in again, you managed to escape after a series of battles over the course of half a year. Eventually, you grasped another move of the ‘God Destroyer Nine Styles’.”<br/><br/>“Finally, you had your last battle with your enemies and ended up mutually killing each other with the ‘God Destroyer Nine Styles’. You died at the age of<br/><br/>Abruptly, an unknown Second Grade powerhouse has emerged, hellbent on killing him.<br/><br/>Gu Yang was no longer surprised. Every time he made a large sum of money, he would attract deadly trouble.<br/><br/>What surprised him was that he could actually encounter a mysterious old man who saved his life and even taught him saber techniques.<br/><br/>He didn’t expect to have such good treatment.<br/><br/>“The simulation has ended. You can choose to retain one of the following.”<br/><br/>“One, the martial arts realm at the age of 23.”<br/><br/>“Two, the martial arts experience at the age of 23.” “Three, the life wisdom at the age of 23.”<br/><br/>Without a doubt, he would choose the second option.<br/><br/>He could execute the newly comprehended ‘God Destroyer Nine Styles’ to slay a Second Grade. Although he died himself.<br/><br/>That was defeating an opponent who surpassed him! PS: I’ll make up for the missing chapter tomorrow..\t\t\t\t\t\t</div>", "images": {}, "success": true}