{"id": 69, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297836.html", "title": "Chapter 69 - Chapter 69: What Does 069 Eat?", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 69 - Chapter 69: What Does 069 Eat?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 69: What does 069 eat?<br/><br/>Translator: 549690339<br/><br/>In a moment, Chu Xiyue had regained consciousness and found herself lying on the ground. Her True Essence was scattered within her body, her internal organs were damaged, and she was in a state of serious injury.<br/><br/>The power of that single slash was utterly terrifying!<br/><br/>When she thought of that slash, her heart still trembled slightly.<br/><br/>Suddenly, she heard footsteps approaching. She lifted her head slightly and saw that the man was already next to her, looking down at her with cold, ruthless eyes radiating naked killing intent.<br/><br/>In an instant, her heart was seized by the fear of death, and a chill rushed straight to her soul.<br/><br/>At this moment, her treasured sword had disappeared, and she didn’t have even a bit of strength to resist. She was completely at their mercy.<br/><br/>Just as Chu Xiyue thought that death was about to arrive, an indifferent voice echoed in her ears, “Who are you?”<br/><br/>“Chu Xiyue.”<br/><br/>As she spoke, a heavy smell of blood rushed into her nostrils, tearing at her wounds and causing a severe pain that rendered her face even paler.<br/><br/>The man stared at her intently with piercing eyes, and asked again, “You weren’t sent by Lin Zihua?”<br/><br/>Lin Zihua?<br/><br/>Chu Xiyue’s breathing became more hurried, she felt humiliated, “He’s just a nobody, he’s not worth… cough…” Before she could finish, she broke into a violent cough.<br/><br/>From this woman’s reaction, Gu Yang realized that he had made a mistake.<br/><br/>He indeed had the intention to kill just now, but after seeing her appearance and demeanor, which were in no way inferior to Su Qingzhen and Xu Ruomei, he sensed that she was unlikely to be sent by Lin Zihua.<br/><br/>She was much younger than Lin Zihua and already had Second Grade cultivation. It was clear that she was a figure among the top five in the Hidden Dragon List.<br/><br/>In terms of potential, she far surpassed Lin Zihua. How could she be someone he could order around?<br/><br/>“Fortunately, I asked one more question,” Gu Yang sighed in relief. Such a character must certainly come from a powerful faction, and if he really killed her, her elders might come after him the following day with blades.<br/><br/>To nurture such an outstanding disciple, the teacher must be at least a First Rank, right?<br/><br/>It’s good that she’s not dead, he would not have to worry about her elders seeking revenge immediately.<br/><br/>Gu Yang did not regret injuring these two people.<br/><br/>In the situation just now, he only had one chance for a slash. The safest course of action when two Second Grade individuals suddenly appeared was to take<br/><br/>both of them down.<br/><br/>Otherwise, if these two turned out to be his enemies, then after his single slash, he wouldn’t even have a chance to flee.<br/><br/>He wasn’t about to gamble with his life.<br/><br/>Even if he accidentally injured two promising young Second Grade individuals, there was nothing more to say about it.<br/><br/>They were just unlucky.<br/><br/>Gu Yang sheathed his blade and said, “My name is Gu Yang, if you want revenge, come find me anytime.”<br/><br/>If these two were from the Lin Family, killing them wouldn’t matter. Regardless, given the current situation, there was already a complete breakdown of relations between him and the Lin Family.<br/><br/>Since they did not come from the Lin family, then let it be.<br/><br/>He didn’t kill them, nor did he attempt to explain further. What’s done was done, there was no need for any explanations.<br/><br/>Chu Xiyue watched as Gu Yang decisively turned and left without giving her a second glance. She gritted her teeth, struggling to get up and said, “In half a month, Chu Xiyue will certainly avenge this slash!”<br/><br/>Gu Yang didn’t turn his head, he picked up Xu Ruomei from the ground and headed towards the back yard.<br/><br/>Zhang Xiao Hai was very smart, he ran far away as soon as he appeared, and due to his low level of cultivation, he was not affected by Gu Yang’s Blade Intent attack.<br/><br/>Gu Yang took him along and left the courtyard where he had lived for nearly a month. He headed for the Qingxuan Sect, planning to pick up Su Qingzhen and leave Jiangzhou behind.<br/><br/>To him now, the Lin Family was an absolute behemoth. They had at least two First Rank masters and possibly even one at the Divine Power realm.<br/><br/>Gu Yang had a clear understanding of his own strength. He could hold his own against Second Grade individuals, but defeating them would be very difficult, let alone killing them.<br/><br/>The Blade Intent which he had nurtured for more than twenty years in the simulator couldn’t be used as a regular weapon. It could only be used as a trump card.<br/><br/>If he couldn’t defeat them, naturally, he had to make a strategic retreat.<br/><br/>He would return when his strength was sufficient.<br/><br/>This wasn’t embarrassing.<br/><br/>In the Qingxuan Sect, within a small courtyard, Su Qingzhen was practicing swordsmanship. Seeing Gu Yang scaling the wall and entering, she thought it was strange since Gu Yang would usually come over in the evening to practice with her.<br/><br/>Suddenly, she saw a strange woman in Gu Yang’s arms. Her face changed immediately, she said coldly, “What are you doing here?”<br/><br/>Gu Yang replied, “We can’t stay in Jiangzhou any longer, gather your things, we need to leave immediately.”<br/><br/>Su Qingzhen’s expression was icy, “Why should I follow you?”<br/><br/>“I’ve fallen out with the Lin Family. Your identity can’t be hidden from them. If we don’t leave now, it’ll be too late,” Gu Yang said.<br/><br/>Upon hearing the word ‘Lin Family’, Su Qingzhen’s face changed, but she was still too proud to relent. She turned her back and said, “I don’t need your help. Even if I die here, it has nothing to do with you…”<br/><br/>Before she could finish, she was hit on the back of her neck by Gu Yang and fell limply into his arms, unconsciously.<br/><br/>Zhi Xing, the maidservant beside her, was somewhat at a loss seeing this scene.<br/><br/>“What are you waiting for? Hurry up and pack, just take some money and valuables,” said Gu Yang, holding one woman in each arm and turning to Zhi Xing.<br/><br/>“Oh. ”<br/><br/>Only then did Zhi Xing react, and she hurriedly went inside. Not long after, she came out with two bundles.<br/><br/>Then, Gu Yang wrote a letter and handed it to Daoist Priestess Jingyu of the Qingxuan Sect, asking her to pass it on to Xue E of the Fang Family.<br/><br/>The contents of the letter asked the Fang Family to take care of the Qingxuan Sect.<br/><br/>As for the remaining one and a half million taels they had agreed upon, Gu Yang did not mention them.<br/><br/>The Lin Family had already sent people after him, the previous agreement would likely no longer be honored. Naturally, he didn’t feel right taking that money.<br/><br/>He would consider the fifty thousand taels he had previously taken a favor he owed the Fang Family, one that he would repay another day.<br/><br/>“What, he’s dead?”<br/><br/>In Jiangzhou city, shortly after Lin Zihua returned to the Lin Mansion, he received a report from Listening Wind Hall and his expression changed, “Was it the Sword Slave accompanying Xu Ruomei who made the move?”<br/><br/>The person reporting was from the Listening Wind Hall, who swallowed hard before difficultly spitting out, “The message says that Patron Mo… died at the hands of… Gu Yang.”<br/><br/>For a moment, Lin Zihua thought his hearing was playing tricks on him and that he had heard it wrong.<br/><br/>“What did you say?”<br/><br/>The man from Listening Wind Hall said tremulously, “My lord, this is what the report said.” As he spoke, he presented a slip of paper.<br/><br/>Lin Zihua took it and saw that it indeed stated that MO Yu had been killed instantly by Gu Yang. At that time, also present were Chu Xiyue and Wu Xingyun who were also affected and seriously injured.<br/><br/>In other words, did Gu Yang, who had just broken through to the Third Rank, defeated three Second Rank individuals single-handedly?<br/><br/>This was absolutely preposterous!<br/><br/>“What does the Listening Wind Hall eat? How dare they concoct such an absurd report?”<br/><br/>Blinded by anger, Lin Zihua kicked out, sending the man in front of him flying several meters. The man looked as though he had breathed his last.<br/><br/>Lin Zihua’s face twisted and his hand trembled slightly. His surface anger could not conceal the fear in his heart..\t\t\t\t\t\t</div>", "images": {}, "success": true}