{"id": 64, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297831.html", "title": "Chapter 64 - Chapter 64: Determined To Succeed", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 64 - Chapter 64: Determined To Succeed</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 64: Determined to Succeed<br/><br/>Translator: 549690339<br/><br/>Gu Yang asked, “Miss Xu, the Locking Bracelet has been removed. What are your plans for the future?”<br/><br/>“Thank you, Brother Gu, for your hospitality these past few days. After a couple of days, I’ll leave and continue my travels,” Xu Ruomei subtly changed her address.<br/><br/>Unconsciously, their relationship began to subtly change. “What about you, Brother Gu? Are you planning to stay in Ping county city?”<br/><br/>There seemed to be a hint of expectation in her eyes.<br/><br/>For her, this question was already pushing her to her limit.<br/><br/>Gu Yang understood her hidden hopes, but he chose not to respond, “I don’t think I can stay here much longer. The road of the Jianghu is long; we will inevitably meet again.”<br/><br/>A hint of disappointment surfaced in Xu Ruomei’s heart. This thought, which she couldn’t explain to others, disturbed her tranquil heart. She carefully controlled her emotions.<br/><br/>Before leaving, she suddenly said, “It would be wise to keep some distance from your maid.”<br/><br/>Gu Yang smiled lightly, “Thank you for the warning.”<br/><br/>It seemed Xu Ruomei had figured out Ling Ling’s identity.<br/><br/>However, he didn’t ask.<br/><br/>After all, there was no need to. Seeing how many First Rank powerhouses had come to stop Ling Ling as she tried to break through to the Divine Power realm, he could only imagine how troublesome the burdens she bore must be.<br/><br/>Anyway, his plate of troubles was already full. Leaving aside other matters, once the news that he was cultivating the “Phoenix Dance Nine Heavens” technique spread, it would be a disaster.<br/><br/>Shen Family would certainly send someone to retrieve it.<br/><br/>This family was one of the strongest forces in Great Zhou, known as one of the prestigious nine surnames, and had a Divine Power realm expert overlooking their affairs.<br/><br/>No matter how big Ling Ling’s trouble was, it couldn’t be bigger than this, could it?<br/><br/>As long as it was not an imminent problem, it could be postponed.<br/><br/>Ling Ling’s trouble, which would only come eighteen years later, could be placed at the end of the priority list. He didn’t even want to think about it.<br/><br/>Well, he would cross the bridge when he got there.<br/><br/>After Xu Ruomei left, Gu Yang once again opened the system.<br/><br/>“At the age of twenty-two, you have reached the Third Rank in Cultivation Level and are ranked seventh on the Hidden Dragon List, making your name known far and wide. Sympathetic to Xue E’s plight, you decided to help the<br/><br/>Fang Family break free from the Lin Family’s control. After negotiating with<br/><br/>Lin Zihua, you secured his promise.”<br/><br/>“The following day, sensing danger, you quietly left on your own. Afterwards, you incognito yourself in a small mountain village and lived as a hunter, with nobody knowing the fact that you were once a Third-Rank warrior.”<br/><br/>“Three years later, a gang of bandits intruded into the mountain village and slaughtered the villagers, with you the only one who managed to escape. You did not avenge them, but chose to continue living incognito.”<br/><br/>“One day, you encountered a frightened horse. When it stopped before you, the lady of a prominent family riding it believed that you saved her and took you back to the Villa, assigning you to take care of her horse.”<br/><br/>“Two years later, the lady of the prominent family, unsatisfied with the arranged marriage at home, ran away on a horse. You were implicated and had to flee from the villa.’<br/><br/>“One day, you met Cao Yiyi. She took a liking to you and forced you to become her driver. From then on, you drove the carriage for her, wandering aimlessly with her while she sought the man she resented.”<br/><br/>“During the journey, Cao Yiyi attracted attention wherever she went, with the thrill of playing with those men infatuated with her providing her amusement.”<br/><br/>“Three years later, Cao Yiyi finally provoked a First Rank powerhouse whose only son she killed. In the midst of his rage, he sought vengeance. You seized the opportunity of Cao Yiyi’s moment of panic and left overnight.”<br/><br/>“One day, you met Xu Ruomei, who had already reached the Second Grade and had killed Lin Zisheng with her sword. She was standing by the river, seemingly melancholic. You did not reveal yourself and quietly left.”<br/><br/>“Again you hid in a small mountain village. A year later, Ling Ling came to the door and passed on the ‘Heavenly Elemental God Slaying Art’ to you. You did not ask her to stay, and she just left.”<br/><br/>“Another year later, Ling Ling returned and told you that Su Qingzhen and Zhang Xiao Hai were killed by Shen Baiyi. You did not say anything, and she<br/><br/>left.’<br/><br/>“Five years later, Ling Ling showed up again, telling you the news that Xu Ruomei, after reaching First Rank, had failed her ‘sword severing mortal world’ attempt and died. You again said nothing, and she left.”<br/><br/>“Another three years later, Ling Ling came again, telling you that she had topped the First Rank list. Then she left.”<br/><br/>“Since then, Ling Ling never showed up again.”<br/><br/>“Ten years later, a sudden change occurred in the village. During a duel between two Divine Power realm individuals, you became involved and lost your life, dying at fifty years old.”<br/><br/>Seeing his fate in this simulation, Gu Yang was somewhat speechless.<br/><br/>Even when he lived so cautiously, he could still die due to an accident. It was just ridiculous.<br/><br/>Originally, he thought he could live longer, but he unexpectedly suffered a calamity brought about by a battle between two Divine Power realm individuals.<br/><br/>He was certain that this was a conscious move by the World Consciousness.<br/><br/>With Third-Rank power and never initiating any fights, running away upon sensing danger… even so, he only survived till fifty.<br/><br/>This lifetime was filled with desperation as almost everyone he was close to had died.<br/><br/>During this simulation, he was mainly honing his Blade Intent.<br/><br/>“The simulation has ended, you can choose to retain one of the following.”<br/><br/>“One, your Martial Arts Realm at fifty years old.” “Two, Martial Arts experience at the age of fifty.”<br/><br/>“Three, Life Wisdom at fifty.”<br/><br/>“I choose two”.<br/><br/>At the next moment, Gu Yang felt as if a sharp, chilling killing intent was about to burst from his heart. It was the Blade Intent that had been nurtured for nearly thirty years.<br/><br/>The main goal of this simulation was for this Blade Intent.<br/><br/>Using the Hidden Knife Style, he had stowed away this move for twenty-eight whole years!<br/><br/>Now, he waited for that Second Rank to make a move.<br/><br/>At this moment, several hundred miles away from Ping county city, Lin Zihua was meditating in a carriage when the lord of the Listening Wind Hall came to report, “Young master, there’s something odd about Gu Yang.”<br/><br/>Without opening his eyes, Lin Zihua faintly replied, “Speak.”<br/><br/>“According to the Seventh Young Master, when he met Gu Yang in Tianshui city a little over a month ago, Gu Yang was only at the Sixth Rank.”<br/><br/>“Did the Seventh make a mistake?”<br/><br/>“Elder Wu from the Red Mansion was present at the time, and he personally confirmed it.’<br/><br/>Lin Zihua opened his eyes, a frightening gleam in his gaze, “In just over a month, he advanced from the Sixth Rank to the Third Rank. What secrets does this man hold?”<br/><br/>“Moreover, we have determined the identities of the two women with Gu Yang.<br/><br/>They are Su Qingzhen, ranked thirteenth on the Beauty List, and her maid.”<br/><br/>“Beauty List…”<br/><br/>Lin Zihua pondered for a moment, then ordered, “Send a message to MO Yu and tell him to apprehend Gu Yang and bring him to me. I want to see what secrets he’s hiding.”<br/><br/>“Yes.”<br/><br/>MO Yu was a servant of the Lin Family, a Second-Rank practitioner. Only in very important matters would someone of his stature be dispatched.<br/><br/>By sending MO Yu, it was clear Lin Zihua was resolved to get Gu Yang.<br/><br/>PS: This is the second-to-last update for the 3rd, making up for it, asking for a monthly ticket..\t\t\t\t\t\t</div>", "images": {}, "success": true}