{"id": 62, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297829.html", "title": "Chapter 62 - Chapter 62: 062 Can ‘T Hold On Any Longer", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 62 - Chapter 62: 062 Can ‘T Hold On Any Longer</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 62: 062 Can ‘t hold on any longer<br/><br/>Translator: 549690339<br/><br/>“Self-sacrifice Form!”<br/><br/>Gu Yang opened his eyes, his gaze filled with a potent murderous intent. But, after a while, this murderous air gradually diminished, returning to normalcy.<br/><br/>He just inherited the martial arts experience from this life simulation, mastering the second form of the “God Destroyer Nine Styles”.<br/><br/>Finally, he understood why, in the simulation, he could die alongside a second -grade warrior.<br/><br/>This was a saber technique inherently designed for mutual destruction.<br/><br/>The Self-sacrifice Form channels one’s martial arts will, crystallizing the killer’s intent to the extreme to kill enemies.<br/><br/>To put it another way, it first kills oneself, then the enemy.<br/><br/>This is a killing method similar to the Heavenly Demon Disintegration, only used as a last resort.<br/><br/>If he remembered correctly, Ling Ling also used a similar craft in one simulation, forcibly raising her realm to kill the enemy.<br/><br/>The form Gu Yang mastered before was called the Jade Breaking Form, which exerted blade intent to oppress the enemy by competing with the martial arts will. Despite his easy defeat of Tian Fei last time.<br/><br/>If he encountered an opponent with a stronger martial arts intention, he would lose miserably.<br/><br/>From these two saber techniques, one could deduce that the “God Destroyer Nine Styles” is a very extreme saber technique. Either kill the enemy swiftly and cleanly, or be killed swiftly and freely, or commit mutual suicide swiftly and cleanly.<br/><br/>Anyway, the Self-sacrifice Form could be considered a powerful hidden reserve.<br/><br/>Of course, Gu Yang’s gains were not limited to this.<br/><br/>His saber technique reached a new realm. As for how strong he is now, he had to find someone to compare with to know.<br/><br/>“I wonder who that mysterious old man is and why he helped me.”<br/><br/>Gu Yang could not help but think of the old man who pointed out his saber technique in the simulation. He wondered if he would still meet him in the next simulation.<br/><br/>After being mentored by the old man for several months, his sword skills have advanced by leaps and bounds. The old man must be a peerless master. Regrettably, he didn’t know the old man’s name, nor how to find him in the future.<br/><br/>It was quite a pity.<br/><br/>At this moment, Gu Yang felt a movement in his heart and looked towards a direction. He sensed a sharp aura, like a sharp sword drawn from its sheath.<br/><br/>Over there lived Xu Ruomei. After unlocking the seal of the Yuan Bracelet, her cultivation level was finally restored.<br/><br/>Speaking of her, Gu Yang thought of the Sword Slave who was always nearby.<br/><br/>This Sword Slave was of the second-grade cultivation level.<br/><br/>Perhaps, he could make use of him…<br/><br/>A moment later, Xu Ruomei’s aura subsided, and Gu Yang closed his eyes, intended to digest the gains from this simulation.<br/><br/>Early the next morning, as it was just getting light, a group of people arrived outside the Gu Mansion.<br/><br/>Zhang Xiao Hai opened the door and saw that the people outside were carrying boxes, blocking the road.<br/><br/>Only after questioning did he find out that these were goods sent by the Fang Family.<br/><br/>He did not dare to make the decision and asked them to wait while he went to inform Gu Yang.<br/><br/>Gu Yang had already heard the commotion and came out. Without waiting for him to speak, he said, “Have them move the things to the west wing.”<br/><br/>“Yes.”<br/><br/>Zhang Xiao Hai responded and went to direct the people.<br/><br/>Inside these large boxes were silver coins.<br/><br/>How much is fifty thousand taels?<br/><br/>Twenty-five tons.<br/><br/>If piled up, it would be just over two cubic meters.<br/><br/>If divided into smaller pieces and placed in boxes, each box would contain ten thousand taels, totalling fifty boxes, nearly filling the west wing.<br/><br/>After all fifty boxes had been moved into the wing, Gu Yang did not check the detailed amount and let the people from the Fang Family leave.<br/><br/>Then, he dismissed Zhang Xiao Hai and closed the room door, feeling a sense of being spied on, which had faded a lot.<br/><br/>Actually, when his rank on the Hidden Dragon List was revealed, the feeling of being watched had weakened a lot.<br/><br/>The Sword Slave did not brazenly lurk and spy on him like before.<br/><br/>After Gu Yang confirmed everything was fine, he began to recharge the system.<br/><br/>As for whether this would arouse suspicion, he didn’t care anymore.<br/><br/>In this simulation, suddenly a second-grade expert appeared, tried to capture him and pursued him for a whole year. He could guess the opponent’s intention.<br/><br/>Who sent this person, he also knew very well.<br/><br/>The eldest son of the Lin Family just left, and immediately a second-grade person came to chase him down. If it wasn’t the eldest son’s doing, who else could it be?<br/><br/>Or perhaps, his own realm had advanced too rapidly, attracting trouble.<br/><br/>When he encountered Lin Zirui in Tianshui City, it was just over a month ago, back when he had only a sixth-grade cultivation level.<br/><br/>At that time, the people around Lin Zirui must have been high-level practitioners, it was quite normal for them to see through his realm.<br/><br/>In just over a month, he jumped from sixth-grade to third-grade. It’s not surprising that Lin Zihua was tempted.<br/><br/>The key point is, Lin Zihua had seen him in a previous simulation and did not show any interest. As the eldest son of the Lin Family, he would have definitely investigated him.<br/><br/>But this time, he sent someone.<br/><br/>If there was any difference between the two times, it would be that Gu Yang had spoken up to protect the Fang Family.<br/><br/>This undoubtedly touched upon the interests of the Lin Family.<br/><br/>This Lin Zihua, though he appeared cultured and refined, was in fact, a petty and vengeful man.<br/><br/>Gu Yang was actually prepared for this from the moment he ranked on the Hidden Dragon List. Others aren’t blind or stupid, they would surely find out about his rapid progress.<br/><br/>That’s why he hated the Red Mansion so much.<br/><br/>Originally, he could continue to stay put.<br/><br/>But now, he had been exposed by the Hidden Dragon List, and could no longer hide.<br/><br/>What Gu Yang needed to do was to strengthen his power as quickly as possible.<br/><br/>As long as he was strong enough, what did it matter if his secret was revealed?<br/><br/>Which of those in the divine realm didn’t have any secrets or opportunities? Who would dare target them?<br/><br/>Next, he opened each box, recharged it and then closed the box again.<br/><br/>After all these were done, he opened the system and saw that the balance exceeded twelve million.<br/><br/>A sense of joy arose spontaneously in Gu Yang’s heart. With this money, he could undergo another thirty-two simulations.<br/><br/>Next month when another fifty thousand will be deposited, the balance will then surpass a million.<br/><br/>The precondition is that there will be a next month.<br/><br/>A few days later, the second grade warrior would kill him.<br/><br/>Although he had already practiced “Self-sacrifice Form”, the end would be nothing more than mutual annihilation.<br/><br/>How could he pass this trial?<br/><br/>When Gu Yang walked out of the west wing, he contemplated this problem, and gradually, an idea came to his mind.<br/><br/>Returning to his room, he started another simulation.<br/><br/>[At the age of twenty-two, you have reached the third-grade cultivation level and are ranked seventh on the Hidden Dragon List, making your name known to all. You empathize with Xue Er’s plight and decide to help the Fang Family break away from the Lin Family’s control. You negotiate with Lin Zihua and gain his promise.]<br/><br/>[The next day, you take Su Qingzhen and quietly leave Pingjun City for Divine City. You enter the Tianxin Martial Institute. Cheng Tianxin learns about your purpose and insists on not taking you as a disciple, but as a junior master. You became a junior master of the Tianxin Martial Institute…]<br/><br/>PS: This is a make-up for yesterday’s chapter..\t\t\t\t\t\t</div>", "images": {}, "success": true}