{"id": 65, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297832.html", "title": "Chapter 65 - Chapter 65: 065 Bustling Pingjun City", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 65 - Chapter 65: 065 Bustling Pingjun City</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 65: 065 Bustling Pingjun City<br/><br/>Translator: 549690339<br/><br/>“Elder Wii?”<br/><br/>Outside Pingjun City, Lin Zirui, riding a white horse, suddenly spotted a familiar figure and cried out in surprise.<br/><br/>Not far away, an elder in black, also on horseback, pulled on his reins and turned his head, saying, “Why, it’s Young Master Lin.”<br/><br/>Lin Zirui, with a few of his men, hurried after him, excitedly saying, “I didn’t expect to run into you here, Elder. Where are you off to?”<br/><br/>Elder Wu gave a faint smile, saying, “The same place as you.”<br/><br/>It was then that Lin Zirui realized that Elder Wu’s job was to observe the martial artists on the major lists. Now that a Gu Yang had appeared, he naturally had to verify it.<br/><br/>He eagerly asked, “Elder, didn’t you witness last time, that Gu Yang was clearly at the sixth grade cultivation level? Surely there can’t be a mistake?”<br/><br/>A few days earlier, when he learned of the new Hidden Dragon List, and saw that the seventh rank had this newcomer from Jiangzhou, Gu Yang, he initially thought it was a case of mistaken identity.<br/><br/>It wasn’t until the day before yesterday when he received a message from his older brother asking what task he had sent Zhou Qing on, that he realized something was off.<br/><br/>Zhou Qing was only a fifth grade, not important enough to merit his brother’s inquiry.<br/><br/>Upon asking Listening Wind Hall, he found out that the Gu Yang who had just ascended to the seventh rank of Hidden Dragon List was indeed the same Gu Yang they had encountered before.<br/><br/>He found it hard to believe and couldn’t sit still any longer, hence he rushed to Pingjun City overnight.<br/><br/>He wanted to see for himself whether this person was indeed the Gu Yang he had met in Tianshui City.<br/><br/>As for the fact that he had sent Zhou Qing to assassinate Gu Yang, he didn’t think much of it.<br/><br/>After all, this was Jiangzhou, and he doubted that Gu Yang would dare to touch him.<br/><br/>What’s more, his elder brother was there.<br/><br/>His elder brother’s cultivation was at Second Grade.<br/><br/>Since he happened to meet Elder Wu at this time, he quickly sought confirmation from him.<br/><br/>Elder Wu just shook his head, “There are always some strange skills and methods in this world that can be used to disguise one’s cultivation level.”<br/><br/>He was naturally very confident in his own accuracy, his unique ability allowed him to discern the real cultivation level of others. Ever since his appointment as the inspector, he had never been wrong.<br/><br/>However, he knew more than anyone else that the Hidden Dragon List could not be wrong.<br/><br/>So either he had misjudged last time,<br/><br/>Or Gu Yang had crossed three realms in just over a month, breaking through from the sixth grade to the third grade.<br/><br/>No matter which it was, it would be a major matter. Elder Wu, for his part, was determined to verify Gu Yang’s status once again.<br/><br/>Since the two ran into each other and had the same destination, they decided to travel together.<br/><br/>In a short time, they arrived at the gate of Pingjun City.<br/><br/>Suddenly, a horse galloped from behind and quickly overtook them, rushing into the city.<br/><br/>Lin Zirui noticed that the man’s horse was pure white and exceptionally majestic, clearly an exceptional breed of horse, indicating that man was no ordinary individual, and asked, “Elder Wu, do you recognize this man?”<br/><br/>Elder Wu took only a glance and identified the man, “The current eighth place holder on the Hidden Dragon List, Cao Xu.”<br/><br/>So it was him.<br/><br/>Lin Zirui realized that Cao Xu was originally ranked seventh on the Hidden Dragon List, but after Gu Yang made it onto the list, he was bumped down to eighth rank, and presumably had a bone to pick.<br/><br/>His visit to Pingjun City was likely to challenge Gu Yang.<br/><br/>Lin Zirui remembered hearing that a girl from the Cao family was causing trouble all over Jiangzhou; it appeared that Cao Xu was responsible for protecting her.<br/><br/>The mighty eighth-ranked on the Hidden Dragon List was reduced to a henchman for a capricious young lady.<br/><br/>What a pity. But, that’s the price for being a branch member of the Cao family.<br/><br/>Now, there’s going to be a good show to watch.<br/><br/>Lin Zirui was excited at the prospect of witnessing a showdown between the seventh and eighth ranks of the Hidden Dragon List.<br/><br/>Such a battle among martial artists of this level was rare.<br/><br/>He asked, “Elder Wu, who do you think would win if the two of them fought?”<br/><br/>“Hard to say.”<br/><br/>Elder Wu said, “Cao Xu broke through to the third grade five years ago, two years ago he got on the Hidden Dragon List, and has climbed steadily to seventh place. Gu Yang, on the other hand, ascended to seventh place overnight. Comparing their strengths, Gu Yang would naturally rank higher, but in terms of experience, Cao Xu might have an edge. Any difference between the two would be minor. Who will win, can only be determined by a battle.”<br/><br/>His analysis made sense, mainly because he knew so little about Gu Yang. He had seen Gu Yang in action once before, but it was uncertain whether that was Gu Yang’s true strength.<br/><br/>As they spoke, they entered the city gates. From a distance, they saw that Cao Xu had slowed down and respectfully followed behind a horse carriage, not daring to overtake it.<br/><br/>Lin Zirui was surprised, “Who is in that carriage, to command such respect from Cao Xu?”<br/><br/>“It’s the Chu family’s carriage.”<br/><br/>Elder Wu said, “If I’m not mistaken, the person in the carriage should be Chu<br/><br/>Xiyue, the first-ranked on the Hidden Dragon list.”<br/><br/>Upon hearing that name, Lin Zirui was somewhat shaken, “The ninth-ranked on the Beauty list, the incomparably elegant Chu Xiyue? She’s actually come to Jiangzhou!”<br/><br/>Considering her, it was no surprise that Cao Xu yielded.<br/><br/>Of the twenty people on the Hidden Dragon list, only three are women. Chu Xiyue, being a woman, holds the top position on the list by outperforming a legion of men.<br/><br/>In addition to her being the ninth on the Beauty List, her legendary status was magnified.<br/><br/>It was said that she broke into the second grade when she was twenty-one, which is why she didn’t make it onto the Peerless List. However, her talents were no inferior to any of the nine chosen ones currently.<br/><br/>After making it onto the Hidden Dragon List, she challenged everyone who ranked before her and none were a match for her.<br/><br/>In the end, Red Mansion made an exception and listed her as the first on the Hidden Dragon List, setting a record for the fastest to top the list.<br/><br/>A year ago, she challenged Chen Heng, the eighth-ranked on the Peerless List, and it ended in a stalemate. This proved that her strength was no less than the world’s exceptional talents.<br/><br/>Such a personage had come to Jiangzhou, and he had no prior knowledge of it.<br/><br/>Elder Wu said, “I’ve heard that Qin family offered the Bright Moon Sabre as a betrothal gift to marry Chu Xiyue, and Chu family has agreed. However, she publicly proclaimed that anyone who wants to marry her must surpass her.<br/><br/>Unfortunately, the prince of the Qin family is probably not worthy in her eyes.<br/><br/>So, she ran away from home.”<br/><br/>Lin Zirui was stunned, “When did this happen?” Such significant news went unheard of until now.<br/><br/>“Just a few days ago.”<br/><br/>Lin Zisi couldn’t help but exclaim, how well-informed was the Red Mansion indeed.<br/><br/>This was a heavy-weight news, the Qin and Chu families were both among the top nine families in the world, and once were mortal enemies.<br/><br/>The Bright Moon Sabre was originally Chu family’s treasure and was later seized by Qin family.<br/><br/>Now, Qin family using Bright Moon Sabre as the betrothal gift was something that Chu family couldn’t refuse.<br/><br/>A marriage alliance between the Qin and Chu family might potentially change the landscape of Great Zhou.<br/><br/>Lin Zirui didn’t expect to encounter three individuals from the Hidden Dragon List during his single trip to Pingjun City.<br/><br/>No, there should be a fourth.<br/><br/>Since Chu Xiyue was there, that other person must be around too.<br/><br/>He looked closely and soon spotted a man on horseback with a long sword on his back.<br/><br/>This man was likely the second-ranked on the Hidden Dragon List, Wu<br/><br/>Xingyun.<br/><br/>Things were about to get very interesting indeed..\t\t\t\t\t\t</div>", "images": {}, "success": true}