{"id": 68, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297835.html", "title": "Chapter 68 - Chapter 68: 068 Eliminate Future Troubles", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 68 - Chapter 68: 068 Eliminate Future Troubles</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 68: 068 Eliminate Future Troubles<br/><br/>Translator: 549690339<br/><br/>To Chu Xiyue’s surprise, she found herself in a dangerous crisis because of a spontaneous decision.<br/><br/>She had heard that Gu Yang, who had just made it to the seventh rank on the Hidden Dragon List, was in Pingjun City. On a whim, she decided to pay this bravo a visit, who had directly dropped into the seventh position after his first appearance on the list.<br/><br/>Even when she and Wu Xinyun first made it onto the Hidden Dragon List, they were barely in the top ten.<br/><br/>Wu Xingyun climbed up gradually.<br/><br/>And she fought her way up.<br/><br/>It was unheard of for someone like Gu Yang to debut directly in seventh place prior to this event.<br/><br/>Earlier, while she was in the carriage, she sensed the aura of a Second-Grade expert. Out of curiosity, she left her carriage to check it out.<br/><br/>But who would have thought that the moment she stepped into the courtyard, she would be targeted with Blade Intent.<br/><br/>The Blade Intent was hidden and dormant, yet it brought her unprecedented pressure.<br/><br/>Her intuition told her that this Blade Intent was incredibly dangerous. What astonished her even more was that the source of this Blade Intent was the young man.<br/><br/>If her guess was correct, this man must be the master of this place, Gu Yang.<br/><br/>Wasn’t he a Third Rank?<br/><br/>So why does his Blade Intent seem more terrifying than a First-Rank master?<br/><br/>Though surprised, Chu Xiyue was extremely experienced in real combat and maintained her composure. She stood in place, pushing her True Essence to its limit, playing defensively in anticipation of a sudden thunderous strike.<br/><br/>And Wu Xingyun behind her, was responded in the same way.<br/><br/>Just like that, due to their arrival, the tense situation, which was on the verge of sparking off, had fallen into a bizarre balance.<br/><br/>“What a pity!”<br/><br/>Gu Yang had his hand on the hilt of his sword, suppressing the impulse to draw it, waiting for the perfect moment until Xu Ruomei appeared and walked towards him.<br/><br/>With a sigh in his heart, no longer hesitating, he drew his sword.<br/><br/>The Blade Intent, which had been nurtured for twenty-eight years, finally bloomed between heaven and earth.<br/><br/>In an instant, it seemed as though the weather changed.<br/><br/>The terrifying Blade Intent swallowed up all the light. All the spectators were plunged into darkness, and all they could see was a streak of sword light.<br/><br/>“Yu’er, you have such a talent. It seems that the prosperity of the MO Family will depend on you…”<br/><br/>“Yu’er, the MO Family’s ancestral cultivation skill can only reach the Fourth<br/><br/>Rank at most…”<br/><br/>“Yu’er, are you really going to join the Lin Family? Isn’t that the same as marrying into the family? If you dare to go, I won’t consider you as my son!”<br/><br/>“Yu’er… If you hadn’t been born into the MO Family… You wouldn’t have suffered so much…..<br/><br/>MO Yu’s consciousness became fragmented, and the last scene before his death, where his father holding his hand and speaking with bloodshot tears, was froze.<br/><br/>Immediately after, he sank into eternal darkness.<br/><br/>Until his death, he didn’t have the chance to draw his sword.<br/><br/>Chu Xiyue and Wu Xingyun, who were a little bit farther away, sprayed out a mouthful of blood and collapsed to the ground, unconscious.<br/><br/>Besides them, everyone else in the arena also fell.<br/><br/>The only ones who managed to stay conscious were the Sword Slave who had come to rescue Xu Ruomei, and Wudong and Cao Xu, who watched the war from afar.<br/><br/>The rest of them all fainted.<br/><br/>The power of this single slash was beyond belief.<br/><br/>It killed a Second-Grade on the spot, seriously injured two more Second-Grades, and caused varying degrees of injury to the warriors around them.<br/><br/>After making the slash, Gu Yang felt as if he had been drained of all his strength.<br/><br/>The slash was exhaustive to him, nearly draining him of his spirit and energy to the point he could barely hold onto his sword.<br/><br/>At this moment, he couldn’t even walk up and deliver a finishing blow.<br/><br/>His eyes swept over the Sword Slave.<br/><br/>The Sword Slave’s eyelids twitched, bowing to Gu Yang and turning to leave.<br/><br/>The earth-shattering slash earned him this respect.<br/><br/>He knew that he wouldn’t be able to handle that slash, and if he had to face it head-on, he would undoubtedly die.<br/><br/>The way of martial arts only respects strength.<br/><br/>Gu Yang’s one slash won him their respect.<br/><br/>As for the other two people who remained conscious, they were both dumbfounded.<br/><br/>The power of this slash well surpassed the limits of their imagination.<br/><br/>A Third-Rank managed to defeat three Second-Ranks with one slash!<br/><br/>This spectacle was too shocking. If they hadn’t seen it with their own eyes, they would have never believed it.<br/><br/>Since ancient times, those who managed to overcome ranks and defeat higher-ranking opponents were considered legendary.<br/><br/>The last one to achieve such a feat was Qin Wu, four hundred years ago, who was invincible and established one of the top ten clans in the world with his own power.<br/><br/>Now, Gu Yang, facing three opponents alone, slashed one Second-Grade and severely wounded two others. This was almost mythical.<br/><br/>At this moment, Wuldong and Cao Xu looked at Gu Yang, who was standing in the courtyard, and thought: Is Great Zhou about to witness the rise of a second Qin wu?<br/><br/>Suddenly, a ghost-like figure appeared. It was the old woman that had been accompanying Xue E. She had been startled by the disturbance and had rushed over.<br/><br/>Seeing the scene before her, she was somewhat stunned. Suddenly, her eyes caught sight of something and she stared at MO Yu’s corpse in shock, as a tidal wave of emotions welled up within her. It was MO Yu of the Lin Family!<br/><br/>Had he died?<br/><br/>Who killed him?<br/><br/>The shock in the old woman’s heart was indescribable.<br/><br/>Some years ago, MO Yu had come to Pingjun City and visited the Fang Family.<br/><br/>He sparred with her and another Second-rank, ultimately defeating them both.<br/><br/>That humiliation made Fang Family dare not to defy the Lin Family.<br/><br/>The Lin Family had only sent one follower, yet he was strong enough to crush Fang Family. How could they dare to say no?<br/><br/>Now, this formidable follower of the Lin Family was dead.<br/><br/>Who was capable of killing him?<br/><br/>The old woman’s gaze fell on the only standing figure in the courtyard, Gu Yang, and a ridiculous idea came up in her mind – could he have been the one to do it?<br/><br/>When Gu Yang saw the old woman appear, his heart tightened. In his current state, he was at his worst and had no capacity to defend himself.<br/><br/>Indeed, he hadn’t anticipated the enormous consumption from that slash, and the slow recovery.<br/><br/>Without hesitation, he opened the system and a prompt appeared in front of him: “Simulation completed, you can keep one of the following options.”<br/><br/>“First, Martial Arts Realm at the age of forty.” “Second, Martial Arts experience at the age of forty.”<br/><br/>“Third, Life Wisdom at the age of forty.”<br/><br/>Before the battle, Gu Yang had prepared and completed a simulation, yet he held onto the reward and didn’t claim it right away, waiting for this moment.<br/><br/>“I choose the first”<br/><br/>Immediately, a surging wave of True Essence emerged within him, restoring his depleted energy back to peak condition in a flash.<br/><br/>“It really works!”<br/><br/>Gu Yang was certain.<br/><br/>He had suspected that once the reward was claimed, it would overwrite his current condition. No matter how much his strength was depleted, he could recover instantly to his prime.<br/><br/>Now, he confirmed that this method worked.<br/><br/>It could definitely be used as a trump card.<br/><br/>The first thing Gu Yang did after recovery was to walk towards the two severely injured Second -Ranks and deliver a blow to eliminate potential threats.<br/><br/>PS: Regarding getting on the bookshelf, it will be almost two weeks later. As for updating after the bookshelf, it depends on how much buffer there is recently..\t\t\t\t\t\t</div>", "images": {}, "success": true}