{"id": 63, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297830.html", "title": "Chapter 63 - Chapter 63: I Fear The Sudden Quietness Of The Air", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 63 - Chapter 63: I Fear The Sudden Quietness Of The Air</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 63: I fear the sudden quietness of the air<br/><br/>Translator: 549690339<br/><br/>[A month later, while you were away, you were ambushed by a Second Grade powerhouse. You exchanged dozens of moves with him without falling behind.<br/><br/>Your fight attracted the attention of a commander of the Imperial Guard. When he arrived, the Second Grade powerhouse was scared away.]<br/><br/>[This battle made your name resound throughout Divine City.]<br/><br/>[Half a month later, Luo Peiyuan, who ranked sixth on the Hidden Dragon List, came to challenge you. Under the watchful eyes of the public, you defeated him in just ten moves. From then on, you were known as the top person in the Third Rank.]<br/><br/>[One month later, the fifth prince sent someone with a challenge letter, wanting to fight you. You initially wanted to decline, but that night, Cheng Tianxin took you to see a prominent figure. This figure said that as long as you could defeat the fifth prince in the martial arts fight, he would give you the complete secret scrolls of “God Destroyer Nine Styles”.]<br/><br/>[After some consideration, you agreed.]<br/><br/>[A month later, you and the fifth prince Zhao Han competed at the Tianxin<br/><br/>Martial Arts Hall. After a dozen moves, Zhao Han hit you with the Jade Breaking Style from “God Destroyer Nine Styles”. Left with no choice, you repelled with the Jade Breaking Form and defeated him in one move, shattering his martial arts spirit.]<br/><br/>[You obtained the complete scrolls of “God Destroyer Nine Styles”, but offended the royal family. To avoid implicating the Tianxin Martial Arts Hall, you left Divine City. On the road, you encountered a First Rank powerhouse. You used a deadly move, shattered his protective Gang Qi, and died from exhaustion later. You were 23 years old then.]<br/><br/>After reading about this experience, Gu Yang furrowed his brow, “This path is also not feasible.’<br/><br/>The capital city is too complex, he thought. His strength was stronger than ever before, but he was being gradually dragged into a vortex of conflict, eventually drowned by it.<br/><br/>For someone like him, with no background, heading to the capital city without absolute strength was practically a suicide mission.<br/><br/>It’s very possible that the stronger you are, the quicker you die.<br/><br/>In the past, when he hadn’t reached the Third Rank yet, he was able to train his Saber Technique at the Tianxin Martial Arts Hall for several years.<br/><br/>[Simulation ends, you can retain one of the following.]<br/><br/>[One, your martial arts realm at the age of 23.]<br/><br/>[Two, your martial arts experience at the age of 23.]<br/><br/>Three, your wisdom of life at the age of 23.]<br/><br/>Naturally he chose the second option – the complete set of “God Destroyer Nine Styles” that he had risked his life to earn in this simulation.<br/><br/>The next moment, six extra saber forms emerged in Gu Yang’s mind, corresponding with the three forms he had learned previously.<br/><br/>In reality, he had mastered the fourth form, Jade Breaking, and the fifth form, Life-taking.<br/><br/>Besides, he remembered the details of the three battles he was in – the confrontation with the Second Grade powerhouse, the battle against Luo Peiyuan, who ranked sixth on the Hidden Dragon List, and lastly, the battle against the fifth prince, Zhao Han.<br/><br/>Leaving aside the Second Grade powerhouse, Luo Peiyuan had a higher cultivation level than him.<br/><br/>On the Hidden Dragon List, the top five were all Second Grade cultivators, while the sixth-ranked Luo Peiyuan was at the peak of the Third Rank. Although his punches were extraordinarily powerful, he was nowhere near a match for Gu Yang.<br/><br/>If it had been a fight to the death, Gu Yang could have taken his life within three saber cuts.<br/><br/>Instead, it was the fifth prince, Zhao Han, whose strength surpassed Luo Peiyuan. His true essence was like the Great Sun True Fire, infinite in power and comparable to Gu Yang’s “Phoenix Dance Nine Heavens” true essence.<br/><br/>Zhao Han also used a saber, and each of his moves was sophisticated to the point that it strained Gu Yang to deal with him.<br/><br/>However, in terms of swordsmanship cultivation, Gu Yang was still superior. Once Zhao Han used “God Destroyer Nine Styles”, his downfall was sealed.<br/><br/>Under such circumstances, if Gu Yang had hesitated, he would have been the one crippled.<br/><br/>A strange emotion welled up in Gu Yang’s heart.<br/><br/>A little over a month ago, he agreed to escort Su Qingzhen to Ping City for 30,000 taels. He was only at Eighth Grade then, and the Liu family and the fifth prince were inconceivable entities to him.<br/><br/>Yet in just over a month, the once-unreachable fifth prince was no longer his match.<br/><br/>Even the universally acclaimed prodigy, Liu Zhe, wouldn’t necessarily outstrip him.<br/><br/>Unknowingly, he had reached such a high level.<br/><br/>It really was like a dream.<br/><br/>A few specks of dust seemed to be brushed off Gu Yang’s soul, making it more nimble.<br/><br/>Suddenly, he had a moment of realization and comprehended the first move of “God Destroyer Nine Styles” — Hidden Knife Style.<br/><br/>The so-called Hidden Knife was about retracting all sharp edges.<br/><br/>It did so in order to emanate an even dazzling light at the moment of unsheathing.<br/><br/>This was also a kind of charging method; the longer you store energy, the more amazing the power of the knife when it comes out.<br/><br/>Gu Yang closed his eyes. After a moment, his inner true essence began to converge. The intimidating aura he had been emitting unconsciously disappeared without a trace. He seemed no different from any ordinary person.<br/><br/>He marveled at this profound saber technique.<br/><br/>Just then, the door banged open. A graceful figure stormed in – Xu Ruomei.<br/><br/>Her sword was already unsheathed and she was emanating killing intention.<br/><br/>As she walked in and saw Gu Yang sitting on the bed, she staggered to a stop, looking surprised.<br/><br/>With a thought, Gu Yang guessed why she had barged in. She must have noticed his sudden lack of aura and, thinking something had happened to him, had rushed in to help. As a result, she was frozen in place.<br/><br/>The thing you fear most is when the air suddenly becomes silent.<br/><br/>Perhaps Xu Ruomei had never experienced such an awkward moment in her life. For a moment, she maintained her pose, unsure of how to react.<br/><br/>“Your timing is perfect.”<br/><br/>Gu Yang felt thankful for her concern and broke the ice, “I have something to ask you.”<br/><br/>Xu Ruomei’s face reddened slightly as she sheathed her sword. Her tone was complex as she said, “I didn’t expect your saber technique to have reached such a level.”<br/><br/>She came from a famous family. Although she practiced swordsmanship, all paths of martial arts ultimately led to the same destination.<br/><br/>In Sword Palace, there was also a technique like the Hidden Sword Style. Hence, she immediately guessed the level of Gu Yang’s saber technique.<br/><br/>Sword Palace never lacked geniuses. In fact, anyone who could get into Sword Palace was a genius.<br/><br/>But at Gu Yang’s age, only the eldest senior brother in Sword Palace could have reached such a level with their sword technique.<br/><br/>Gu Yang smiled and remained silent, thinking, You have no idea what lengths I have gone to achieve today’s level of saber technique.<br/><br/>He put forward his main point, “Do you know about Tianxin Martial Arts Hall?”<br/><br/>Xu Ruomei nodded, “My eldest senior brother has once said that Cheng Tianxin is an extraordinary person.”<br/><br/>“Then do you know who he is affiliated with?”<br/><br/>Gu Yang’s recent simulation had unlocked a new character.<br/><br/>He wanted to know who the dignified person Cheng Tianxin had taken him to see was.<br/><br/>In the future, he would definitely return to the Divine City scenario. If he understood these details, he would know how to act.<br/><br/>Xu Ruomei said, “It’s said that Cheng Tianxin once received great favor from Princess Chang.”<br/><br/>It turned out to be Princess Chang, indeed a big shot. It seemed like she had a fallout with the fifth prince, which is why she had arranged for him to cripple the fifth prince.<br/><br/>Gu Yang then asked, “What kind of person is this Princess Chang?”<br/><br/>Xu Ruomei shook her head, “I’m not sure. My master once said that until you reach First Rank, don’t go to Divine City.”<br/><br/>Gu Yang was somewhat disappointed. From her look, she seemed to be someone fully devoted to martial arts.<br/><br/>At this moment, he missed Ling Ling terribly.<br/><br/>Ling Ling was well-informed about all the major forces, and she unquestionably knew about the situation in Divine City.<br/><br/>PS: This is the first update today. Another one will be posted at 12 0’clock..\t\t\t\t\t\t</div>", "images": {}, "success": true}