{"id": 60, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297827.html", "title": "Chapter 60 - Chapter 60: 060 1 Want Two Million", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 60 - Chapter 60: 060 1 Want Two Million</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 60: 060 1 want two million<br/><br/>Translator: 549690339<br/><br/>The next day, a man claiming to be the future head of the Fang Family paid a visit.<br/><br/>Out of curiosity, Gu Yang met him. The man was in his early thirties, claimed to be Fang Kaihui, a member of the main line of the Fang Family.<br/><br/>As soon as they met, Fang Kaihui began to talk eloquently, “I am the head of the Fang Family, and now I am here to negotiate a cooperation with you on behalf of the family. As long as you help us deal with Lin Zisheng and the Lin Family, we are willing to bestow half of our family property…”<br/><br/>“Hold on.”<br/><br/>Gu Yang interrupted him, “Does Xue E know about our meeting?”<br/><br/>Contempt flickered in Fang Kaihui’s eyes as he replied, “This is my family’s business. Although she is my brother’s widow, she has not been faithful and cavorts with other men. She is not fit to manage our family business.”<br/><br/>Gu Yang immediately lost interest in continuing the conversation and gave his order to dismiss the guest, “You may leave now.”<br/><br/>“What?”<br/><br/>Fang Kaihui was a little taken aback, not at all expecting such a response after offering such a sincere deal. He asked, “Why is that?”<br/><br/>Gu Yang replied coldly, “If the Fang Family is made up of ungrateful people like you, who dump allies once they are no longer needed, I am not interested. If you want to talk, send Xue E here.”<br/><br/>Fang Kaihui’s face turned red with shame and indignation but he dared not advocate any further and left with a turn of his sleeve.<br/><br/>By the afternoon, Xue E arrived, looking somewhat worn out. A bitter smile surfaced on her face, “I’ve made a fool of myself.”<br/><br/>After her husband’s death, two members had succeeded as family head, both mysteriously died within a month. The Fang Family plunged into turmoil.<br/><br/>Lin Zisheng pursued relentlessly, even going so far as to directly approach them, intending to absorb the Fang Family’s power.<br/><br/>Despite Lin Zisheng’s reputation, none of the young masters from the Fang Family dared to oppose him. It was her, a mere woman, who stood up to him from a standpoint of justice and saved the Fang Family at the last minute. These years, Lin Zisheng had adopted a new strategy, slowly devouring the Fang Family. The Fang Family members feigned ignorance and did not even have the courage to resist.<br/><br/>If not for her mediation, the Fang Family would have been engulfed by Lin Zisheng a long time ago.<br/><br/>Now that there is a chance to break free from Lin Zisheng’s claws, Fang Kaihui, a member of the Fang Family, can’t wait to cast her aside and, asserting himself as the Family head, he came to negotiate cooperation with Gu Yang.<br/><br/>Gu Yang could imagine how hard it must have been for her to manage such a large family being a woman who had married into it and carrying such a reputation. He said, “Every household has its own difficulties, I understand.”<br/><br/>There was a thin sheen of tears in Xue E’s eyes, which wasn’t pretend. She had heard of Fang Kaihui’s unsuccessful visit to Gu Yang earlier in the morning. She was grateful to the man in front of her.<br/><br/>If Gu Yang had also given her up, she would lose all her standing in the Fang Family.<br/><br/>Even though she had managed to turn the tide in the Fang Family’s most difficult times and preserved the centuries-old base of the Fang Family.<br/><br/>Nevertheless, she also caused the Fang Family’s reputation to suffer. Once the crisis was resolved, the Fang Family would certainly not tolerate her.<br/><br/>It was Gu Yang’s statement that had forced the Fang Family to continue acknowledging her status.<br/><br/>“After discussing with the elder members of our family, we’re willing to offer five hundred thousand liang, which is all we possess right now. We have spent a lot of accumulated wealth over these years to resist Lin Zisheng’s encroachment. ”<br/><br/>Xue E sincerely stated.<br/><br/>While expressing her gratitude, she still had to strive for the best interests of the Fang family.<br/><br/>Gu Yang, unmoved, asked, “Do you know what price Fang Kaihui was calling for? Half of Fang Family’s assets.”<br/><br/>Xue E’s gaze faltered, a bitter taste filling her heart. This Fang Kaihui, despite being of the Fang Family’s main line, was willing to offer such conditions to reclaim power.<br/><br/>Just like a child who sells grandfather’s land without any guilt.<br/><br/>This was the base of the Fang Family that had been accumulated over hundreds of years, and he was willing to give away half of it just like that.<br/><br/>This was just like having a traitor on your team. Gu Yang put up two fingers, “Two million liang.”<br/><br/>“This—”<br/><br/>Xue E, completely knocked off balance by his previous statement, didn’t even have the energy to bargain.<br/><br/>All she could do was complain, “I’m afraid we can’t accumulate that much cash in a short period of time. Otherwise, we could give you land and shops…”<br/><br/>“I only want cash.”<br/><br/>Gu Yang did not give her any room for negotiation. A family as large as the Fang Family would not possibly be unable to afford two million liang.<br/><br/>Apart from anything else, they have no idea how many farmlands they own. The Fang family is the largest landlord in Pingjun, and just the annual rent alone is a huge income.<br/><br/>“How about this, first pay me five hundred thousand liang, another five hundred thousand in a month. Then six months later, pay the remaining one million two hundred thousand.”<br/><br/>Gu Yang did lower his demand.<br/><br/>The extra two hundred thousand, of course, was interest.<br/><br/>Upon hearing this condition, Xue E heaved a sigh of relief, as it was practically an extension of six months. She could probably meet this condition if she tried.<br/><br/>“Also, going forward, I want an annual dividend, let’s say one hundred thousand for now.”<br/><br/>Gu Yang made another request.<br/><br/>If he helped the Fang Family deal with Lin Zisheng, it would appear to outsiders that he was the protector of the Fang Family and in the future, the Fang Family would definitely act under his name.<br/><br/>Of course, he would charge for it, just like a protection fee.<br/><br/>“Agreed.”<br/><br/>Without giving it a thought, Xue E agreed instantly. Although one hundred thousand liang was not a small amount, if it meant keeping the Fang Family unharmed, what was a little money?<br/><br/>At this moment, Zhang Xiao Hai came over with a visiting card in hand, “Sir, someone outside is seeking an audience. He comes with quite an entourage.”<br/><br/>Gu Yang took the visiting card from him and a smile appeared on his face as he flipped it open. What a coincidence.<br/><br/>When Xue E saw the card, her expression changed slightly.<br/><br/>The emblem on the card was exclusive to the Lin Family, and only core members of the Lin Family could use it.<br/><br/>A core member of the Lin Family was here to see Gu Yang.<br/><br/>Gu Yang told her, “You may retreat behind the screen.”<br/><br/>Xue E hid behind the screen, unconsciously held her breath. Soon, a clear voice sounded, “Lin Zihua of the Lin Family pays an inappropriate visit. I apologize for any inconvenience to Brother Gu.”<br/><br/>She internally gasped. Lin Zihua, the eldest son of the Lin Family and future head of household.<br/><br/>It was said that Lin Zisheng was exiled to Pingjun because he wanted to compete with this older brother.<br/><br/>This was a core member of the Lin Family.<br/><br/>What shocked her even more was his equal tone of voice when speaking with<br/><br/>Gu Yang.<br/><br/>Just who was Gu Yang, really?<br/><br/>Meanwhile, the conversation outside continued, “My reckless younger brother committed an unthinkable act. I assure you, I will sort it out for Miss Xu.”<br/><br/>Miss xu?<br/><br/>Suddenly, a lightning thought struck Xue E. Could it be…?<br/><br/>Gu Yang replied, “You should be saying this to Miss Xu.”<br/><br/>“I am too embarrassed to face Miss Xu, therefore would you kindly relay this to her on my behalf.”<br/><br/>“I can relay the message, but Lin Zihua should know that disciples of Sword<br/><br/>Palace always avenge their wrongs.”<br/><br/>Lin Zihua sighed, “Is there no room for negotiation?”<br/><br/>“The moment Lin Zisheng put the Lock Yuan Bracelet on her hand, he should have known what the consequences would be.”<br/><br/>Lin Zihua fell silent.<br/><br/>“Of course, Miss Xu’s character is such that she does not vent her anger on others.”<br/><br/>“Please do convey this message for me.”<br/><br/>Suddenly, Gu Yang changed the topic, “Is Brother Lin aware of the situation with the Fang Family?”<br/><br/>Upon hearing this, Xue E’s heart skipped a beat.<br/><br/>She finally understood why Gu Yang was so confident that he could handle Lin Zisheng and the Lin Family.<br/><br/>His relationship with that disciple of the Sword Palace was extraordinary..\t\t\t\t\t\t</div>", "images": {}, "success": true}