{"id": 66, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297833.html", "title": "Chapter 66 - Chapter 66: 066 Nightmare", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 66 - Chapter 66: 066 Nightmare</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 66: 066 Nightmare<br/><br/>Translator: 549690339<br/><br/>“Number one on the Hidden Dragon List?”<br/><br/>While Lin Zirui and old master Wu were discussing this, not far behind them, an aged man in a blue robe walked leisurely along, overhearing their conversation.<br/><br/>Looking ahead, he saw the emblem of the Chu Family on a carriage.<br/><br/>His eyes deepened, and he recollected his past, when he was a young man with prodigious talent. Before he was twenty, he had reached the Fourth Grade of cultivation and was in the running to be on the Hidden Dragon List.<br/><br/>Unfortunately, the martial arts techniques that he practiced were too basic. After reaching the Fourth Grade, he had remained stagnant for nearly a decade, all the while watching helplessly as the lesser talented disciples from well-bred families surpassed him.<br/><br/>Later, he joined the Lin Family and managed to learn a more profound martial arts technique, which enabled him to easily break through to the Third Grade. Furthermore, he married a woman from a branch of the Lin Family and rose to the rank of an honorary family member.<br/><br/>After breaking through to the Second Grade, he swiftly became one of the Lin Family’s high-ranking retainers. This was the highest position that a person of a non-Lin Family member could attain.<br/><br/>He knew that that was the farthest he could reach.<br/><br/>The methods provided by the Lin Family to reach the First Rank were too difficult and the conditions were very harsh; there was almost no possibility of success.<br/><br/>Originally, with his talent, he should not have been limited to this.<br/><br/>He was not inferior to others; it was only because of his common birth. His humble beginnings determined the height he could reach – nothing beyond the Second Grade.<br/><br/>The Lin Family would never allow a non-member to break through to the First Rank, thereby posing a threat to the Lin Family members.<br/><br/>While these thoughts flashed by in the mind of the man in the blue robe, they did not affect his pace at all. He began to ponder what kind of impact the appearance of these people would have on his mission.<br/><br/>Chu Xiyue ranked first on the Hidden Dragon List, with a Second Grade cultivation level. Since she debuted, she had challenged dozens of people and had never been defeated.<br/><br/>Then there was Wu Xingyun, ranked second on the Hidden Dragon List. Rumor has it that after losing to Chu Xiyue, he became her follower, constantly following her around.<br/><br/>If Chu Xivue was here, he would undoubtedly be right by her side.<br/><br/>His decades of cultivation had allowed him to reach the peak of the Second Grade. His sword technique had been honed to the flawless state. Among those in the Second Grade, he was nearly invincible.<br/><br/>If it was only one person, he might not mind it, but if two people joined forces, it would be a bit tricky.<br/><br/>As for the rest of the people, he barely gave them a thought.<br/><br/>That includes the target of this trip, Gu Yang, ranked seventh on the Hidden Dragon List, who only had a Third -Grade cultivation level and whose capture was assured.<br/><br/>Originally, the only person he needed to guard against would have been Xu Ruomei’s Sword Slave.<br/><br/>However, the situation had changed, two additional people at the Second Grade had arrived.<br/><br/>“A quick battle is in order.”<br/><br/>The man in the blue robe, who is also the Lin Family’s high-ranking retainer MO Yu, dashed into a small alley beside him and sped up towards his destination.<br/><br/>Lin Zirui and old master Wu remained oblivious to his presence.<br/><br/>“This is the place.”<br/><br/>At this moment, a burly man arrived in front of the Gu Mansion, holding a large ring-headed blade in his hand. With a hard kick, he kicked the door open and shouted, “Thief, return my brother’s life.”<br/><br/>This shout was like a sudden thunder on a quiet field, sending a shockvvave far and wide.<br/><br/>The first person to arrive was Zhang Xiao Hai. Seeing the intruder, he was both startled and furious, “Who dares to cause trouble here!”<br/><br/>The man roared, “I am Zhang Jin, third of the Six Heroes of Meishan. You have murdered my brothers and stolen our money. Today, I am here for revenge. Get ready to die!”<br/><br/>Without another word, he prepared to strike.<br/><br/>This man had a Fifth Grade cultivation level. Zhang Xiao Hai, who hasn’t reached the Ninth Grade yet, was no match for him.<br/><br/>Just as Zhang Xiao Hai was about to be hit, a loud shout echoed from outside the gate, “Six Villains of Meishan, you actually dared to cause trouble in Pingjun City. You really know not the fear of death.”<br/><br/>Zhang Jin felt the threat behind him, performed a somersault, and jumped aside. He guarded the gate cautiously, preventing any ambush.<br/><br/>The person who spoke was dressed in a uniform, none other than the deputy leader of the city’s military.<br/><br/>Zhang Jin looked at him, his eyes filled with caution, “I have no intention of causing trouble in Pingjun City. I’ll leave once my revenge is done. If you stay out of it, I’ll owe you one.”<br/><br/>The deputy leader laughed as if he heard a joke, “You ran here for revenge without finding out who lives here?”<br/><br/>A mere man of Fifth Grade cultivation level daring to shout about revenge in the home of a powerful person ranked seventh on the Hidden Dragon List was unheard of.<br/><br/>Zhang Jin called out fiercely, “Whoever dares to kill my brother will be buried by me.”<br/><br/>Just as the two were at each other’s throats, a calm voice rang out, “You’ve finally arrived.”<br/><br/>Only then did the two notice an additional figure standing in the courtyard, a man clothed in a blue robe.<br/><br/>The moment they saw this man, both Zhang Jin and the deputy leader felt a chill down their spine, paralyzed as if they could not move.<br/><br/>A warrior of Third Grade or above!<br/><br/>Without any attempt to cover his cultivation level, the man in the blue robe exuded an overwhelming aura, making it hard for the two of them to even breathe.<br/><br/>The figure was none other than MO Yu. Not even sparing a glance at the two minor figures beside him, he looked into the house, slightly surprised, “You knew I was coming?”<br/><br/>While he spoke, a young man came out from the house. The man exuded no aura or sharpness, blending seamlessly into the surroundings, and looking very ordinary.<br/><br/>MO Yu’s eyes hardened, his warrior intuition made him feel a thread of threat.<br/><br/>“You’re Gu Yang?”<br/><br/>“Yes, I am.”<br/><br/>Speaking, Gu Yang glanced at Zhang Jin beside him, and instantly understood how the third of the Meishan Six Heroes had tracked him down.<br/><br/>It seemed Ling Ling had brought this trouble; the money she had robbed probably contained a share of the Meishan Six Heroes group. It was only that she did not clean up carefully but left a trail for people to find.<br/><br/>This gang member posed no threat to him, but in a certain simulation, he caused quite a bit of trouble.<br/><br/>“You—”<br/><br/>MO Yu saw Gu Yang become distracted while he was speaking, his gaze turning icy, yet just as he began to voice his thoughts, he suddenly felt an intense Blade Intent lock onto him.<br/><br/>The source of this Blade Intent was the young man standing before him.<br/><br/>His pupils constricted, and his heart pounded.<br/><br/>How is this possible?<br/><br/>Gu Yang’s hand gripped the hilt of his blade but did not draw the blade immediately.<br/><br/>Because he sensed several auras rapidly closing in, among which two of them were undoubtedly Second Grade.<br/><br/>Had the Lin Family actually dispatched three Second Grade cultivators for this task?<br/><br/>This posed a considerable threat to him.<br/><br/>With his current strength, he could deal with one Second Grade warrior, but not two. He feared he couldn’t even escape.<br/><br/>And this blade stroke of his could only be performed once.<br/><br/>Gu Yang made a decision instantly.<br/><br/>Wait for those two to arrive and deal with them all at once!<br/><br/>After being locked by the Blade Intent, MO Yu’s True Essence revolved to its utmost extent, forming a terrifying force around his body.<br/><br/>When the full force of the Second Grade True Essence was in operation, it was overwhelming to the point that the nearby Zhang Jin of the Fifth Grade and the deputy leader almost spat out blood.<br/><br/>“Second Grade!”<br/><br/>Zhang Jin realized the rank of the old man and almost wet his pants out of fear.<br/><br/>If this old man was a Second Grade, then what rank was that young man?<br/><br/>He admitted to himself that he was a moron to have run here seeking revenge…<br/><br/>He was about to cry.<br/><br/>But with the current situation, even if he wanted to run, he couldn’t.<br/><br/>Right at this moment, two shadowy figures appeared in the courtyard. After entering the territory shrouded by the Blade Intent, both were shocked, instantly halting their movement and exploding their True Essences. The three terrible forces were nearly tearing the air apart.<br/><br/>“Two more have arrived…”<br/><br/>Zhang Jin felt his heart sink, certain that he must be having a nightmare..\t\t\t\t\t\t</div>", "images": {}, "success": true}