{"id": 67, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297834.html", "title": "Chapter 67 - Chapter 67: Do Not", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 67 - Chapter 67: Do Not</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 67: Do not<br/><br/>Translator: 549690339<br/><br/>“This is—<br/><br/>In the room, Xu Ruomei, who was currently meditating in silence, felt a sudden shock in her heart. She detected a familiar Blade Intent that had grown in strength many times over compared to before.<br/><br/>It was the very same Blade Intent that had shattered the state of mind she had while mastering her Dust Sword Technique not long ago.<br/><br/>Now, this Blade Intent was accompanied by an intense killing intent, along with a relentless determination.<br/><br/>“Not good!”<br/><br/>Xu Ruomei felt a tremendous shock in her heart. She realized that he must have encountered an extraordinarily formidable enemy and was forced into a dead end, leading to the release of such a Blade Intent.<br/><br/>The very next moment, she sensed an overpowering aura bearing down on her.<br/><br/>Second Grade!<br/><br/>Her gaze flickered slightly, and she abruptly sprang into action, reaching towards the treasured sword next to her, ready to smash through the window. Suddenly, a powerful force pushed against her, effectively forcing her back.<br/><br/>A woman’s voice rang out, “Miss Xu, please stay in the room.”<br/><br/>Third Grade!<br/><br/>The True Qi inside Xu Ruomei began to surge. She quickly discerned the strength of the person outside and her gaze chilled, “The Lin Family?”<br/><br/>In Ping County, the only ones who could dispatch a Second Grade to kill Gu Yang and send a Third Grade to stop her were the Fang Family and the Lin Family.<br/><br/>The Fang Family is currently in a partnership with Gu Yang and would not turn hostile at this time.<br/><br/>Hence, it could only be the Lin Family.<br/><br/>The person outside the door said, “Qiu Yuhu of the Dragon Tiger Gang pays his respects to Miss Xu.”<br/><br/>Within Lin Zisheng’s Dragon Tiger Gang, there was one ‘dragon’ and one ‘tiger’, each being Third Grade. This Qiu Yuhu was indeed the renowned Tiger of the city.<br/><br/>Then, Xu Ruomei sensed the arrival of two more Second Grades. Their formidable auras were not weaker than the one encountered before.<br/><br/>The Lin Family was really laying down their cards, actually dispatching three Second Grades to deal with Gu Yang.<br/><br/>Gu Yang was only Third Grade, how was he supposed to cope?<br/><br/>Xu Ruomei was on edge, the treasured sword in her hand was already unsheathed. She shouted, “Out of my way.”<br/><br/>Becoming one with her sword, she targeted the person outside the window with the first move of her Dust Sword Technique, Rolling Dust!<br/><br/>In an instant, lingering sword intent enveloped and locked onto the person outside the window.<br/><br/>Qiu Yuhu felt as though the scenery around changed, and the person before her eyes turned into Lin Zisheng. Feelings of tenderness flooded her heart, leaving no room for any combat intent.<br/><br/>Not right!<br/><br/>She was, after all, a Third Grade powerhouse and quickly realized what was happening, but it was already too late. Xu Ruomei had vanished without a trace.<br/><br/>She was horrified, what kind of sword technique was this?<br/><br/>If the sword had been thrusted her way while she was in a trance, she would have been unable to evade it and would have died on the spot.<br/><br/>This Sword Palace’s sword technique is really eerie, capable of playing her without her realizing it.<br/><br/>Xu Ruomei wasn’t actually aiming to kill Qiu Yuhu, she had just comprehended the sword intent of Rolling Dust and couldn’t control it freely yet.<br/><br/>She was too worried about Gu Yang’s wellbeing and didn’t want to get entangled with Qiu Yuhu.<br/><br/>Within a few swift movements, Xu Ruomei had already arrived in the courtyard and saw the four people in the standoff: Gu Yang and three Second Grade powerhouses.<br/><br/>In addition, there were two martial artists standing motionlessly like statues in the middle, adding to the atmosphere of a duel.<br/><br/>On the rooftops opposite, there were also a few people watching the battle.<br/><br/>This scene somewhat exceeded Xu Ruomei’s expectations.<br/><br/>The three Second Grades had already gathered their True Essence to the fullest, clearly preparing for battle, but they had yet to make their move. She didn’t overthink it and walked towards Gu Yang without hesitation.<br/><br/>Xu Ruomei absolutely couldn’t allow Gu Yang to die here.<br/><br/>She still owed him two favours.<br/><br/>“Stop!”<br/><br/>Suddenly, a stern voice rang out, and a figure appeared as if of ghost, it was the Sword Slave who had been waiting nearby.<br/><br/>Among those present, only those of Third Grade and above knew how dangerous the situation was.<br/><br/>Even though it seemed as if a three-way standoff was taking place, they were, in fact, in the midst of a contest of martial willpower.<br/><br/>Gu Yang, a Third Grade, was on par with three Second Grade people. This was already astonishing.<br/><br/>If he did not see it with his own eyes, he would never believe that such a thing is possible.<br/><br/>The Sword Palace and the Wu Family’s Blade Tomb were known as the holy lands of swordsmanship and blade theory respectively, and there had been an undercurrent of rivalry between them.<br/><br/>It was evident that Gu Yang had nurtured a Blade Intent far superior to his own abilities using the Hidden Knife Style.<br/><br/>But this boy was only a few years old? How could he have nourished such a terrifying Blade Intent?<br/><br/>While he was still in shock, he saw Xu Ruomei breaking into the dueling area, this sudden turn of events was too horrendous.<br/><br/>Her action undoubtedly disrupted the balance among the four fighters, setting off this powder keg. The resulting force was something that even he could not withstand.<br/><br/>“Hidden Knife Style!”<br/><br/>On the nearest rooftop, Elder Wu arrived just in time to see the scene and couldn’t help but suck in a breath of cold air.<br/><br/>He could tell at a glance that the Gu Yang in front of him was indeed the same person he had previously met.<br/><br/>This man’s cultivation level was indeed Third Grade.<br/><br/>Of course, this was not important anymore.<br/><br/>Nothing was more shocking than the current scene, where Gu Yang, a mere Third Grade, had three Second Grades on edge and immobile.<br/><br/>These three Second Grades were very well-known.<br/><br/>MO Yu, the Lin Family’s retainer. A man of exceptional talent who could have reached First Rank, but his unfortunate background kept him serving the Lin Family.<br/><br/>Chu Xiyue, the number one on the Hidden Dragon List. Ever since her debut, she had fought numerous battles, big and small, without a single loss.<br/><br/>Wu Xingyun, the second on the Hidden Dragon List. A bastard son of King Jinghai and a graduate of the Martial Arts Academy, he was known as the second most talented student in the history of the academy.<br/><br/>These three fighters could usually outperform any other Second Grades. Yet, they were now being suppressed by a Third Grade.<br/><br/>Lin Zirui whose cultivation level was too low to comprehend was confused by this unusual standoff, “Elder Wu, why would Chu Xiyue and Wu Xingyun want to help Gu Yang?”<br/><br/>He truly couldn’t figure out why Chu Xiyue and Wu Xingyun were preparing to make a move.<br/><br/>In his view, the one these two should be targeting was, of course, the retainer, MO Yu. He naturally believed that they were here to rescue Gu Yang. Elder Wu responded, “They have no choice<br/><br/>Clearly, these two were considered enemies by Gu Yang after entering the courtyard and locked under his Blade Intent, thus they had no choice but to face him in battle.<br/><br/>As for the reason why Gu Yang did not make a move.<br/><br/>Elder Wu had a vague guess in his heart, he was aiming to slay all three fighters in one sweep, but Chu Xiyue and Wu Xingyun were positioned too far away, he did not have full confidence, leading to the current standoff.<br/><br/>A Third Grade planning to wipe out three Second Grades simultaneously was so crazy that even Elder Wu felt it was insane.<br/><br/>Yet, this was the most reasonable assumption.<br/><br/>Otherwise, there was no way to explain why Gu Yang waited without taking action.<br/><br/>He wanted to pressure the others until they could no longer withstand it and took the initiative to attack. Only then, could he find the best opportunity.<br/><br/>As Elder Wu was speaking, another variable arose; Xu Ruomei walked out and intruded into the stand-off created by the martial intent of both sides.<br/><br/>This immediately disrupted the balance.<br/><br/>A shocking change occurred.<br/><br/>For a moment, everyone in the area felt their vision black out and all they saw was a flash of a blade.<br/><br/>That blade was drawn.<br/><br/>PS: It’s the weekend again, I appreciate your monthly votes..\t\t\t\t\t\t</div>", "images": {}, "success": true}