{"id": 76, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297848.html", "title": "Chapter 76 - Chapter 76: 076 800,000", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 76 - Chapter 76: 076 800,000</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 76: 076 800,000<br/><br/>Translator: 549690339<br/><br/>“How much for these four?”<br/><br/>Gu Yang took out the four pieces he just got. As for the Phoenix Feather Knife, he planned to keep it for use. It wasn’t easy to get a handy weapon.<br/><br/>Cao Yiyi felt cheated and intentionally quoted a low price, “These are stolen goods. I can only offer up to 400,000 taels.”<br/><br/>Well, well, offering only forty percent of the price.<br/><br/>Gu Yang immediately agreed, “Deal. The items are yours, give me the money.”<br/><br/>As long as he could immediately turn them into cash, 400,000 taels was not bad. Even if they were valuable, if he couldn’t sell them, they were as good as junk to him.<br/><br/>Frankly, in a few months, 400,000 taels would probably be worthless to him.<br/><br/>Just like when he first left Liu Village, one hundred taels was a fortune. Now, what is a mere one hundred taels to him?<br/><br/>Seeing that he agreed without hesitation, Cao Yiyi felt stifled.<br/><br/>Ever since she met this man, she hadn’t been able to take any advantage of him; she was always on the losing end.<br/><br/>She rolled her eyes and had an idea, “I don’t have that much money on me right now.”<br/><br/>Gu Yang’s eyes turned cold, he said coolly, “Are you playing with me?”<br/><br/>Under his gaze, Cao Yiyi felt her legs soften, her heart pounding fiercely.<br/><br/>For a moment, she really feared that he would kill her.<br/><br/>Her throat tightened, she stuttered, “Who…who would carry so much money on them? I’ll get it tomorrow… Okay?”<br/><br/>Gu Yang looked at the pleading in her eyes and didn’t know what to say.<br/><br/>Is this the so-called masochist?<br/><br/>His bit of killing intent earlier was real.<br/><br/>The more he mastered the Blade Intent, the easier it was for him to expose his killing intent. Ordinary martial artists of lower ranks, if not frightened into paralysis on the spot, would definitely have strong determination.<br/><br/>Her reaction left him at a loss for words.<br/><br/>Gu Yang expressionlessly took back the four items, saying, “I don’t have time.”<br/><br/>This city is Jiangzhou, the stronghold of the Lin family. It was dangerous enough to come and take this treasure. If Cao Yiyi spread the word, the first-class experts of the Lin family would come right away, and he would have no chance to escape.<br/><br/>“600,000!”<br/><br/>Cao Yiyi suddenly increased her bid, seeing Gu Yang walk away without looking back, she yelled, “800,000!”<br/><br/>Cao Xu at the side had been stunned, completely unable to understand his lady’s actions.<br/><br/>Gu Yang was trying to leave, but she was doing everything to hold him back. It was already great luck that he was not holding a grudge. Why provoke him?<br/><br/>“800,000.”<br/><br/>Gu Yang finally stopped, closed his eyes, and opened the system for a simulation.<br/><br/>Reluctantly, she was offering way too much.<br/><br/>With this money, he could break through to second grade. By then, even if a first-class expert from Lin family showed up, he would have the confidence to negotiate, not having to rely on a woman and get involved in the marriage arrangement between the Chu and Qin families.<br/><br/>However, this was provided that Cao Yiyi didn’t play any tricks, and this act would not attract her father’s attention.<br/><br/>A moment later, Gu Yang opened his eyes. From the simulation results, he already had the answer and planned accordingly.<br/><br/>He turned around and said, “800,000, within three days. If you can’t bring the money, bear the consequences yourself.”<br/><br/>Then he whispered to Cao Xu, “Wait in Luo City. Don’t worry, I won’t harm her life.” After that, he grabbed Cao Yiyi’s arm and disappeared from the spot. Cao Xu watched the two disappear, feeling on the verge of tears.<br/><br/>He had warned her not to provoke Gu Yang, and now she had been taken away by him.<br/><br/>If anything happened to her, he would be doomed.<br/><br/>“What should I do?”<br/><br/>A fierce struggle was going on in Cao Xu’s mind.<br/><br/>The best way, of course, was to inform his master immediately, and his master would send people to rescue her.<br/><br/>But by doing so, he would be labeled as incompetent in protection, would his master trust him in the future?<br/><br/>Gu Yang had said he wouldn’t endanger her life…<br/><br/>As long as he kept his promise and returned Cao Yiyi to Luo City, no one would know she had been kidnapped.<br/><br/>Knowing Cao Yiyi, she wouldn’t tell her father.<br/><br/>After a moment, Cao Xu made his decision.<br/><br/>With another person, Gu Yang’s speed was not decreased and he quickly left Jiangzhou City.<br/><br/>According to the simulation results, kidnapping Cao Yiyi could secure him the 800,000 taels smoothly. And it also wouldn’t attract the Cao family’s experts.<br/><br/>However, it would leave a lingering problem.<br/><br/>But compared with the trouble caused by Chu Xiyue, this wasn’t much of an issue.<br/><br/>With his current strength, as long as Cao Yiyi didn’t summon her father, she couldn’t pose any threat to him.<br/><br/>Of course, in several simulations, he died because of her, so naturally, he wouldn’t be friendly towards her.<br/><br/>By the break of dawn, they had already left the jurisdiction of Jiangzhou, arriving at the neighboring Luo Prefecture.<br/><br/>Luo Prefecture neighbored Jiangzhou and Yuzhou, which was Chu’s territory.<br/><br/>The two arrived at Linfeng City, found an inn.<br/><br/>After a night’s journey, Gu Yang’s speed was faster than a horse’s. Cao Yiyi was almost frozen stiff, her face was pale and lips dry and cracked. Clearly, she had suffered a great deal.<br/><br/>Although she had a father at the Divine Power stage, her own cultivation was weak, only at the ninth rank. She couldn’t withstand the cold wind.<br/><br/>Cao Yiyi regained her senses after eating a bowl of steaming noodles.<br/><br/>Having never suffered such hardships before, she glared resentfully at Gu Yang across the table, wishing she could tear him apart.<br/><br/>Gu Yang ignored her gaze, leisurely took a sip of tea and said, “Once you’re done eating, go get the money.”<br/><br/>Cao Yiyi glared at him for a while, then gritted her teeth and made a request, “I want to bathe, and change into new clothes.”<br/><br/>Before Gu Yang could respond, someone interfered, “Miss, do you need help?”<br/><br/>The moment Gu Yang and Cao Yiyi entered the pub, they drew everyone’s attention.<br/><br/>Given Cao Yiyi’s beauty, it was normal to attract attention.<br/><br/>The atmosphere between the man and the woman was full of tension, naturally it would stir people’s imagination.<br/><br/>The man trying to “heroically save the beauty” was a dashing young man, holding a long sword, clearly a prominent figure.<br/><br/>Suddenly, the whole pub fell silent, waiting for the show to start.<br/><br/>“Scram!”<br/><br/>Cao Yiyi had initially been holding back many grievances and anger, not daring to vent it on Gu Yang. This man had unfortunately chosen the wrong time to interfere, she yelled, “Who asked you to meddle? You, trying to be a hero? Check yourself in the mirror, you’re a hideous beast!”<br/><br/>The young man’s face instantly turned purplish, he never imagined his well-intentioned question would earn him such humiliation. Those waiting to see a good drama in the pub were also stunned.<br/><br/>The plot was different from what they had imagined.<br/><br/>“Let’s go.”<br/><br/>At that moment, the man who had been sitting at the same table with the celestial beauty stood up and left. She followed, her face full of grievance.<br/><br/>With the two leaving, the pub exploded, everyone moved to speculate what the relationship between them was..\t\t\t\t\t\t</div>", "images": {}, "success": true}