{"id": 73, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297842.html", "title": "Chapter 73 - Chapter 73: 073 Peak Of The Third Rank", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 73 - Chapter 73: 073 Peak Of The Third Rank</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 73: 073 Peak of the Third Rank<br/><br/>Translator: 549690339<br/><br/>[ …Several months later, news swept through the world that the Chu and Qin families were forming an alliance by marriage.]<br/><br/>[One day, Chu Xiyue’s mother sought you out, asking you to leave her daughter and promising you the Chu family’s protection in return. After much deliberation, you agreed. Afterwards, you and Su Qingzhen retreated into the Chu family’s Forbidden Land to focus on your cultivation.]<br/><br/>[Seven years later, Chu Xiyue appeared unexpectedly before you, now at the peak of First Rank strength. Seeing you, she lashed out like an enemy, thrusting her sword towards you as you awaited death with eyes shut. Su Qingzhen stood in front of you, but the sword energy bypassed her and pierced your heart, killing you. You died at the age of thirty.]<br/><br/>Gu Yang, upon seeing the final outcome, felt a deep sigh well up within him.<br/><br/>Having betrayed his feelings once, he had gained at least ten years in return.<br/><br/>Who could have foreseen that the Chu family would form a marital alliance with the Qin family?<br/><br/>Xu Ruomei had told him that the Chu and Qin families were once sworn enemies, with the Qin family even seizing the priceless heirloom of the Chu family.<br/><br/>Yet, the Chu family willingly married their daughter into the Qin family. Their spinelessness was truly shocking.<br/><br/>Under such circumstances, had he refused to leave Chu Xiyue, he would have instantly turned both the Chu and Qin families into his enemies, leading to an even more horrifying fate.<br/><br/>This damned fate truly left him no path to live on.<br/><br/>In the end, being killed by Chu Xiyue’s sword was nothing much to protest. [Simulation complete, you may choose to retain one of the following:]<br/><br/>[Option 1: Your Martial Arts Realm at the age of thirty.] [Option 2: Your Martial Arts experience at the age of thirty.] [Option 3: The wisdom of life you achieved by the age of thirty.]<br/><br/>Gu Yang naturally chose the first option.<br/><br/>This time, his True Essence had noticeably surged, increasing by nearly fifty percent.<br/><br/>A hard-won achievement indeed.<br/><br/>“Again. ”<br/><br/>Having found a method to survive for seven years, Gu Yang didn’t hesitate and continued using the same approach for the simulations.<br/><br/>So Gu Yang continued simulating, over and over again.<br/><br/>[ …Five years later, you finally cultivated to the peak of Third Rank.]<br/><br/>[Two more years later, Chu Xiyue confronts you, kills you, and you die at age thirty.]<br/><br/>Finally, he had reached the peak of Third Rank.<br/><br/>On his fourteenth simulation, he finally saw the prompt indicating he had achieved the peak of Third Rank, and breathed a sigh of relief.<br/><br/>Roughly calculating, it had taken him nearly a hundred years to progress from Third Rank to the peak of Third Rank.<br/><br/>And this was with Su Qingzhen by his side. Without her, it would likely have taken even longer.<br/><br/>[Simulation complete, you may choose one of the following:]<br/><br/>Gu Yang chose the first option. The next moment, he could feel his internal True Essence reaching a limit. At any moment, he could undergo Nirvana, disperse his power, and start anew. Afterward, he could directly cultivate to Second Rank, with no further bottlenecks until then.<br/><br/>He supressed this urge.<br/><br/>Currently, his balance rested at 220,000, allowing him to simulate only eleven more times. If he started over, he wouldn’t even reach Third Rank, let alone Second Rank.<br/><br/>Therefore, he could not undergo Nirvana at this moment.<br/><br/>The most crucial task at present was to gather funds.<br/><br/>As for where to procure them, he already had a plan in mind.<br/><br/>Gu Yang carried out seventeen simulations in one go, alarming Xu Ruomei who had been watching by the side. Her gaze shifted from shock to horror.<br/><br/>At such close distance, she clearly felt Gu Yang’s True Essence surge after every while.<br/><br/>Moreover, this surge appeared over ten times consecutively.<br/><br/>This completely disrupted her understanding of things. She couldn’t understand what was happening to Gu Yang.<br/><br/>Suddenly, Su Qingzhen from the other side opened her eyes, swept her gaze across Xu Ruomei’s shocked face, and smirked.<br/><br/>She currently possessed seventh grade cultivation. At such close proximity, she naturally felt the changes in Gu Yang’s True Essence as well.<br/><br/>However, she was long accustomed to such sights. She had spent the longest time by Gu Yang’s side and witnessed all sorts of incredible phenomena concerning him. Even if he declared that he was a First Rank expert at that moment, she wouldn’t find it surprising in the slightest.<br/><br/>Su Qingzhen sneered at the Sword Palace disciple’s shocked expression before closing her eyes again.<br/><br/>One daybreak came and everyone woke up, Xu Ruomei didn’t question Gu Yang about what had happened the previous night. She felt that it was undoubtedly a profound secret.<br/><br/>One simply couldn’t ask about secrets that relate to someone’s cultivation practice.<br/><br/>After breakfast, Gu Yang suddenly announced, “We won’t travel today. I have something to take care of. I will be back in two days. You all wait here for me.” Having said that, he disappeared before anyone could react.<br/><br/>Only Xu Ruomei and Su Qingzhen were left, looking at each other in confusion.<br/><br/>In preparation for this journey, Gu Yang had spent 20 ,ooo the previous night to carry out another simulation. Only after confirming that nothing would go wrong did he set out with a reassured mind.<br/><br/>With no time to lose, he activated his lightness martial arts and rushed towards Jiangzhou city.<br/><br/>He took an isolated path, avoiding any human contact in case he was discovered.<br/><br/>Just before nightfall, he finally arrived at Jiangzhou city. He infiltrated the city walls without alerting anyone.<br/><br/>A moment later, Gu Yang arrived at a grand house in the busiest part of Jiangzhou city.<br/><br/>This was where the Shadow thief’s treasure was located.<br/><br/>The previous time, the treasure map given by Jiao Shumo had led him here, making him infuriate Cao Yiyi. Since then, the Crazy Girl had had her eyes on him.<br/><br/>No one knew how, but Cao Yiyi managed to get the treasure’s location from Jiao Shumo as well. She arrived earlier and was waiting for him to walk right into her trap.<br/><br/>Gu Yang now finally possessed enough power to claim this treasure.<br/><br/>He went up to the gate, pushed lightly, and with a flicker of True Essence, the bolt came undone. He stepped into the courtyard.<br/><br/>Upon coming towards a rear courtyard, he heard the sound of a clap, followed by a voice filled with joy, “You’ve finally arrived. It was no small wait.”<br/><br/>A young girl emerged from the house, holding a lantern. Illuminated by its glow, she was stunningly beautiful. Behind her was a man dressed in grey — none other than the Fourth Rank warrior named Ah Fu.<br/><br/>Gu Yang bowed slightly and said, “Last time, I offended you due to dire circumstances. I hope you can forgive me.”<br/><br/>The Cao family was one of the nine noble families, and this Crazy Girl was the daughter of a cultivator with Divine Power. It was only fitting that he fulfilled all necessary courtesies.<br/><br/>Cao Yiyi scoffed and said triumphantly, “It’s too late to beg for mercy now. Last time, you almost killed me. No one has ever dared to raise a hand against me like that. I’ve pondered for days about how to torture you when you arrive to satisfy my vengeance.”<br/><br/>Gu Yang sighed and said, “It seems we cannot end this peacefully today.”<br/><br/>“What do you think?”<br/><br/>Cao Yiyi smiled faintly, and instructed her bodyguard, “Ah Fu, capture him.<br/><br/>Remember, we need him alive.”<br/><br/>“Yes.”<br/><br/>The grey-clothed man stepped forward. This time, he was extremely serious.<br/><br/>Last time, due to his carelessness, he had almost gotten the Young Miss injured. That was a disgraceful humiliation for him. This time, he absolutely could not afford any more mistakes.<br/><br/>His hand had just grasped the hilt of his blade when he saw the young man before him point a finger at him.<br/><br/>Not good!<br/><br/>Just as a warning flashed in Ah Fu’s heart, he felt a stifling pressure on his chest and instantly lost consciousness.<br/><br/>Third Rank?<br/><br/>Right before losing consciousness, his mind was filled with utter shock.<br/><br/>The smirking face of Cao Yiyi had turned ashen..\t\t\t\t\t\t</div>", "images": {}, "success": true}