{"id": 77, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297850.html", "title": "Chapter 77 - Chapter 77: 077 Something Went Wrong Again", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 77 - Chapter 77: 077 Something Went Wrong Again</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 77: 077 something went wrong again<br/><br/>Translator: 549690339<br/><br/>There are currently six major sects, and nine powerful families in Great Zhou.<br/><br/>They are the most powerful forces in Great Zhou, and each of these forces have their own large-scale businesses that trade across states, earning massive amounts of money each year.<br/><br/>Among these businesses, a few have can operate across states, somewhat like Tesla, monopolizing the market.<br/><br/>The Cao family’s Tianxia Business Association is one of them. Their silk is sold throughout Great Zhou and its quality is unparalleled, attracting countless customers.<br/><br/>Although Luo Prefecture is the Chu Family’s stronghold, the Tianxia Business Association has also set up several stores here, named Jinxiu Pavilion.<br/><br/>One of them is in Linfeng City.<br/><br/>Linfeng City, the third largest city in Luo Prefecture, is located by the grand canal and is bustling with commerce.<br/><br/>Cao Yiyi and Gu Yang walked into the bustling Jinxiu Pavilion, took out a token, and said, “Bring the shopkeeper to me,” before striding to the inner room.<br/><br/>Sometime later, a savvy middle-aged man hurried over. After seeing Cao Yiyi in person, he had no doubts, and knelt down immediately, “This humble one, Yan Xing, pays respect to the young mistress.”<br/><br/>Tea was served quickly. Cao Yiyi did not even glance at the shopkeeper. She lifted the tea cup, lightly removing the froth. With her red lips parting slightly, she asked, “How much money is currently in Jinxiu Pavilion’s account?”<br/><br/>“Young mistress, in total there are fifty-three thousand four hundred seventy taels…”<br/><br/>“Take out fifty thousand taels, I have a use for it.”<br/><br/>Upon hearing this, Yan Xing broke out in cold sweat, and hastily said, “But…”<br/><br/>“Hmm?”<br/><br/>Cao Yiyi paused, placed the teacup back, glanced over, and said indifferently, “I don’t want to repeat myself.”<br/><br/>Yan Xing’s lips moved several times, but in the end he said, “Yes.”<br/><br/>Gu Yang, who had been observing quietly, pitied Yan Xing. To encounter this young mistress was truly a stroke of bad luck.<br/><br/>In several simulation missions, he had pledged allegiance to noble families. His situation was not too different from Yan Xing’s.<br/><br/>Sometime later, Yan Xing brought over a stack of silver notes, placed them in a small sandalwood box, and handed them to Cao Yiyi.<br/><br/>Without counting them, Cao Yiyi took them, and said, “The silver needles from<br/><br/>Beishan are not from the correct month. Don’t serve them to guests in the future.’<br/><br/>After that, she stood up and left.<br/><br/>What she referred to was the tea she had been served. She didn’t drink a single sip of it.<br/><br/>Yan Xing was unable to speak, and he went as far as the entrance to send her off, watching the man vanish from her side.<br/><br/>Next, Gu Yang and Cao Yiyi visited other Jinxiu Pavilions in Luo Prefecture and withdrew all the money from the accounts.<br/><br/>The largest sum taken was fifty-eight thousand taels, originally intended to be submitted as profit to the business the following month.<br/><br/>Now, it was all Gu Yang’s.<br/><br/>In total, they acquired seventy five thousand taels.<br/><br/>There were only a few shops in Luo Prefecture, almost all the liquid assets on the accounts had been taken by them. To have obtained such an amount was indeed a pleasant surprise.<br/><br/>Then, Gu Yang left Cao Yiyi at the Jinxiu Pavilion in Luo Prefecture.<br/><br/>As for how he did it, naturally, he simply knocked her unconscious. He instructed the people at Jinxiu Pavilion to watch her carefully, as Cao Xu would soon come to Luo Prefecture City.<br/><br/>Afterwards, Gu Yang disappeared after taking the money.<br/><br/>Su Qingzhen and the others were still waiting for him. He had said he would return in two days, and now it was the fourth day. If he didn’t return, they would surely begin to worry.<br/><br/>On his return journey, he delayed for a day, visiting the Four Sea Bank in the cities along the way, exchanging the silver notes for gold and silver, and recharged it into the system.<br/><br/>After all the silver notes were converted, the balance in his system reached a total of nine hundred and thirty-thousand.<br/><br/>Gu Yang traveled overnight, and early the next day, he finally returned to the camp.<br/><br/>“Where is everyone?”<br/><br/>Upon arrival, he didn’t see Su Qingzhen and the others, and his heart skipped a beat.<br/><br/>An accident must have happened.<br/><br/>Judging from the traces on the ground, they should not have been gone for long, as there were many footprints and some bloodstains.<br/><br/>Not far away, there were long wheel tracks.<br/><br/>Gu Yang’s expression turned somewhat solemn.<br/><br/>Although he had not had a long interaction in reality with Su Qingzhen and the others, in numerous simulations, most of the time, they had proven themselves capable of surviving life-and-death situations.<br/><br/>In his mind, he had already regarded them as companions.<br/><br/>“I delayed for three more days, and an accident really happened.”<br/><br/>He was somewhat angry.<br/><br/>In the last simulation, he had brought Cao Yiyi to join Su Qingzhen and the others. In the end, although they successfully raised thirty thousand taels, Cao Yiyi caused a great deal of trouble along the way.<br/><br/>She had angered Su Qingzhen, which resulted in Shen Baiyi’s appearance.<br/><br/>Then, Shen Baiyi discovered that he practiced “Phoenix Dance Nine Heavens,<br/><br/>Afterwards, a First Rank from Shen family came and pursued him for several months. He had no escape and had to fight desperately with the First Rank.<br/><br/>Therefore, Gu Yang did not bring Cao Yiyi back with him. He took her to get money first.<br/><br/>Unfortunately, the delay of three days resulted in an accident.<br/><br/>Although, after he obtained seventy-five thousand taels from Cao Yiyi, he was mentally prepared for great trouble.<br/><br/>He didn’t expect, however, that Su Qingzhen and the others would be the ones in trouble.<br/><br/>Who could it be?<br/><br/>Had the First Rank from Lin Family followed them?<br/><br/>Or was it someone else?<br/><br/>Gu Yang did not rush to track them down. First, he carefully observed the surroundings to confirm there were no notes or secret codes. He then left the area and found a secluded place nearby, sat cross-legged, and opened the Life<br/><br/>Simulator.<br/><br/>It would be easier to find people using the system.<br/><br/>[At the age of 22, you’ve reached the third rank cultivation level, defeated three second grade fighters with a single stroke, climbed to the top of the Hidden Dragon List, and became famous. You left Pingjun City with Su Qingzhen and<br/><br/>Xu Ruomei and along the way, you separately went to retrieve the Shadow Thief’s treasure. When you came back, you found that Su Qingzhen and the others had disappeared. You followed the tracks and quickly discovered the enemy.]<br/><br/>[As soon as you approached, you were discovered. The one who initiated the attack was Liu Zhe, the ninth member on the Heavenly Prodigies List. You fought for dozens of rounds without determining the victor, and then another<br/><br/>Second Grade joined the battle.]<br/><br/>[You were soon at a disadvantage against the two of them. After a dozen or so moves, you were cornered and had to use a deadly technique, severely injuring<br/><br/>Liu Zhe while dying on the spot yourself. You lived until 22.]<br/><br/>It turned out to be the Liu Family!<br/><br/>Once Gu Yang figured out who it was, he felt more at ease. At least Su Qingzhen and the others should not be in danger.<br/><br/>The fact that the Heavenly Prodigy, Liu Zhe, personally came to capture them, surely meant that it wasn’t done out of anger and with the intent of killing.<br/><br/>Zhang Xiao Hai and Zhi Xing should also be safe. If they’d been killed, it would have been impossible for the Liu family to also take away the bodies.<br/><br/>As for Xu Ruomei, she was a disciple of the master of the Sword Palace. Even if Liu Zhe had one hundred times more courage, he wouldn’t dare exercise any misconduct against her.<br/><br/>Now that he knew where they were, things could be handled.<br/><br/>When he broke through to the Second Grade, the old and new grudges could be resolved together.<br/><br/>After Gu Yang chose the reward for this simulation, he started another simulation, aiming for the Second Grade realm..\t\t\t\t\t\t</div>", "images": {}, "success": true}