{"id": 74, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297844.html", "title": "Chapter 74 - Chapter 74: 074 Treasure In Hand", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 74 - Chapter 74: 074 Treasure In Hand</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 74: 074 Treasure in Hand<br/><br/>Translator: 549690339<br/><br/>True Essence!<br/><br/>Third Rank?<br/><br/>Cao Yiyi has limited prowess, but she comes from a reputable family that is rich in knowledge and experience; hence, she is no stranger to martial studies. When she saw the man across from her, landing a single hit from midair that rendered Ah Fu unconscious, her face changed. The skill he used was clearly True Essence, which supposedly can only be owned by a Third Rank warrior or above.<br/><br/>This fact was beyond her expectations.<br/><br/>According to Ah Fu, during their encounter in Yuzhou half a month ago, this man was merely Fifth Grade.<br/><br/>Could it be that he was concealing his true strength at the time?<br/><br/>Cao Yiyi felt astonished and doubtful, but she never considered the possibility of mistaking somebody else for him.<br/><br/>She was naturally gifted with the ability to recognize someone solely by their eyes. Once seen, never forgotten.<br/><br/>Last time, the man had a veil on his face, but as soon he made his appearance this time, she recognized him at once. This was the man who had almost killed her.<br/><br/>“Interesting.”<br/><br/>Suddenly, Cao Yiyi’s eyes brightened. She said excitedly, “You were hiding your prowess last time, weren’t you? You obviously possess the cultivation of a Third Rank, yet you chose to evade Ah Fu instead of fighting him. That one hit was intentional, wasn’t it? Trying to scare me off as some minor punishment?”<br/><br/>Gu Yang really wanted to tell her that she was overthinking.<br/><br/>“You didn’t want to provoke me, did you? However, this time, you didn’t hide your true strength and chose to act.”<br/><br/>Cao Yiyi was growing increasingly smug, her demeanor resembling someone who had seen through another’s intentions. “I believe that this shadow thief’s treasure must be very important to you, isn’t it?”<br/><br/>This mad woman was actually quite intelligent. Although her guess wasn’t entirely correct, it wasn’t entirely her fault. After all, anyone would find it hard to believe that he had advanced from Fifth Grade to Third Rank in a span of only half a month.<br/><br/>Unwilling to engage in more nonsense with her, Gu Yang was about to knock her out.<br/><br/>At that moment, a figure appeared behind Cao Yiyi – his aura was strong, suggesting that he might be the third rank master protecting her.<br/><br/>This explained Cao Yiyi’s unwavering confidence, and why she didn’t panic even after identifying Gu Yang as a Third Rank.<br/><br/>The individual who appeared behind Cao Yiyi was a young man – Cao Xu.<br/><br/>At the age of twenty-seven, he held the seventh place in the Hidden Dragon<br/><br/>List. Just a few days prior, however, he was pushed down to the eighth place. By talent, Cao Xu was undoubtedly the top prospect of the Cao family’s current generation.<br/><br/>The awkward part was that he came from a collateral branch of the Cao family and managed to outshine the main branch. To protect himself, he had to align himself with a strong person within the Cao family.<br/><br/>He chose to align himself with the patriarch of the Cao family – Cao Yiyi’s father, the Spear Saint, who was a divine power realm master. As the Spear Saint only had one offspring, Cao Xu’s rise would not threaten Cao Yiyi’s position. In fact, he could even be a supporter for her.<br/><br/>Thus, Cao Xu became the nominal disciple of the Spear Saint.<br/><br/>After Cao Yiyi left the family, she journeyed about with just one Fourth Rank protector and run into trouble everywhere. Worried that his master’s precious daughter would get into some mishap, Cao Xu trailed behind her to clean up her mess.<br/><br/>But there was nothing he could do.<br/><br/>This young lady would not even listen to her own father’s words, let alone regard him as her senior brother.<br/><br/>He felt that she didn’t see him as a senior brother, but merely as a servant who could be ordered around.<br/><br/>Even so, Cao Xu still had to protect her. If anything were to happen to her, it would be the end of him.<br/><br/>Notwithstanding, he was seventh on the Hidden Dragon List, well, eighth now.<br/><br/>Being ordered around daily by a young girl was quite damaging to his dignity. Therefore, he usually refrained from appearing in front of her.<br/><br/>It wasn’t until just now, when Cao Xu sensed something amiss, that he hurried over.<br/><br/>He was extremely angry. Who was this audacious man who dared to lay a hand on the Miss of the Cao family?<br/><br/>However, when Cao Xu arrived at the scene and saw the man in front of Cao Yiyi, he was astonished. How could it be him?<br/><br/>His boiling anger was instantly extinguished by a bucket of cold water. A chill permeated his back, rushing up to his forehead, sending a tingling sensation through his scalp.<br/><br/>When Cao Yiyi saw that he had arrived, she commanded, “Cao Xu, capture him.”<br/><br/>Cao Xu was number seven on the Hidden Dragon List, and with guidance from their father, his power was rather formidable. Among all the Third Rank fighters in the Cao family, not a single one could best him.<br/><br/>In the entire Great Zhou, even among the third ranks, he was one of the very best.<br/><br/>Capturing a regular Third Rank opponent should be a piece of cake for him, right?<br/><br/>However, contrary to expectations, Cao Xu did not make a move. Instead, he bowed and said, “This humble Cao Xu has the pleasure of meeting Mr. Gu.”<br/><br/>Cao Yiyi turned her head in surprise. Seeing the humble demeanor of Cao Xu, she was somewhat flabbergasted.<br/><br/>Although she thought that her father’s disciple acted too fawning and servile in front of her, she had never seen him show such humility in front of a stranger.<br/><br/>It was as if he were not facing a third rank, but a revered and formidable figure instead.<br/><br/>At that point, she sensed that something was amiss.<br/><br/>“Oh, it’s you.”<br/><br/>Gu Yang had felt some familiarity with this man, and as soon he started speaking, he remembered that during his battle with the Second Grade from the Lin Family a few days ago, Cao Xu had been among the bystanders.<br/><br/>“Cao Xu, I remember you now, you were the former seventh place holder on the Hidden Dragon List. You were in Pingjun City that day, presumably to challenge me, weren’t you?”<br/><br/>Upon hearing this, Cao Xu shuddered, hurrying to say, “Dare not, dare not, I am entirely convinced.”<br/><br/>This was an individual who had defeated Chu Xiyue and Wu Xingyun with just one blow; he was, undoubtedly, the most powerful contender on the Hidden Dragon List.<br/><br/>Having personally witnessed that infamous one-hitter, Cao Xu lacked even the courage to unsheathe his sword in front of Gu Yang.<br/><br/>“Are you Gu Yang?”<br/><br/>At that moment, Cao Yiyi raised her voice and asked, her countenance rather excited. “The one who ranked seventh on the Hidden Dragon List a little while ago, the Gu Yang who defeated three Second Grade warriors with a single blow three days ago?”<br/><br/>Wait, why are you so excited? We’re on opposite sides!<br/><br/>Gu Yang reckoned this woman must be mental.<br/><br/>Right then, Cao Xu spoke, “Mr. Gu, if my junior sister offended you in any way, it wasn’t intentional. I beg for your understanding. Please consider the relationship I share with my master; do not bear a grudge against her.” This was a smart move, a good opportunity to make peace.<br/><br/>Gu Yang secretly commended him for that and said, “I came here for the Shadow thief’s treasure.’<br/><br/>“The Shadow thief’s treasure?”<br/><br/>Cao Xu was momentarily taken aback. He hadn’t known about this treasure in advance hinting that it wasn’t there.<br/><br/>Cao Yiyi’s eyes rolled then, announcing, “The Shadow thief’s treasure was found by me first. There’s a sense of order in everything – first come, first serve. How about this? We split it in half.”<br/><br/>“Alright.’<br/><br/>Gu Yang agreed straight away.<br/><br/>So far, everything was going as Simulated.<br/><br/>Getting half of the treasure wasn’t bad either. After all, Cao Yiyi’s background was too strong. If she was willing to take a step back, then that was excellent. He couldn’t kill her off, right? That would just invite her father, leading to a high-cost situation.<br/><br/>Cao Xu, who was standing to the side, saw the negotiation conclude just like that and felt immensely relieved.<br/><br/>Subsequently, Cao Yiyi led Gu Yang to the location of the treasure.<br/><br/>Gu Yang wasn’t worried about her orchestrating any tricky plan. According to last night’s simulation, after he got to the treasure room and took the things, he successfully left without any mishap occurring.<br/><br/>Once inside the underground chamber, Cao Yiyi announced, “The stuff’s right here. There are nine items in total. Each one’s a priceless treasure. You tell me, how should we divide them?”<br/><br/>Gu Yang looked at the items lying on the table and was utterly stunned.<br/><br/>He hadn’t realized that the so-called treasure consisted of nine items. The simulation had mentioned that he got half the treasure, valued at millions, but it hadn’t specified that they were all collectibles and works of art.<br/><br/>At that moment, he became aware of a serious problem – how to monetize these?\t\t\t\t\t\t</div>", "images": {}, "success": true}