{"id": 71, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297838.html", "title": "Chapter 71 - Chapter 71: 071 Inheritance", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 71 - Chapter 71: 071 Inheritance</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 71: 071 Inheritance<br/><br/>Translator: 549690339<br/><br/>As the night deepened, Su Qingzhen and Xu Ruomei were already asleep, with only Zhang Xiao Hai still awake, vigilantly sitting guard.<br/><br/>Appearing as though he was meditating with his eyes closed, Gu Yang had actually discreetly opened the Life Simulator.<br/><br/>To reach the Divine Power Realm, he first needed to solve the problem of martial arts techniques. He only had the first seven layers of the “Phoenix<br/><br/>Dance Nine Heavens”.<br/><br/>First, he needed to pay a visit to Shen Baiyi to get this technique.<br/><br/>By the way, he also wanted to assess his fortune and misfortune.<br/><br/>This time, he had killed the Second Grade representative sent by the Lin Family and had severely injured Chu Xiyue. He didn’t know what kind of changes this would lead to.<br/><br/>Gu Yang first checked his balance. He had 580,000 left, barely enough for twenty-nine simulations.<br/><br/>All because of Lin Zihua. He made more than a million from the Fang Family go down the drain.<br/><br/>This grudge was firmly in place now.<br/><br/>[Do you want to use the Life Simulator? Using it once will consume 20,000 coins.]<br/><br/>“Yes.”<br/><br/>[At the age of twenty-two, you possess the strength of the Third Rank and have reached the seventh place on the Hidden Dragon List. In Pingjun City, you defeated three Second Grade martial artists with a single sword stroke, making your name known throughout the world and earning the title of the first person in the Third Rank.]<br/><br/>[You left Pingjun City with Su Qingzhen and Xu Ruomei. Ten days later, a First Rank powerhouse caught up with you. In your moment of danger, Chu Xiyue arrived and strongly intimidated the First Rank powerhouse, who temporarily retreated.]<br/><br/>[After that, Chu Xiyue challenged you. A hundred moves later, you barely won by one. You two agreed to fight again in a month. After this, she followed you around.]<br/><br/>[One month later, you sparred again. After a hundred and fifty moves, you won by one again.]<br/><br/>[Three months later, you had a third match. Three hundred moves later, it ended in a draw.]<br/><br/>[Half a year later, during the fourth bout, after two hundred and fifty moves, you lost. You two agreed to battle again once you reached the Second Rank. After this, Chu Xiyue moved on.]<br/><br/>[That same night, you left alone, heading to Yuzhou. Inside Shen Baiyi’s mansion, you entered the Shadow Thief’s Treasure Trove, reactivated the jade slip, and obtained the eighth level of the “Phoenix Dance Nine Heavens”.]<br/><br/>[Shen Baiyi was alerted and rushed over. You had a fierce battle, defeated him, and escaped with the jade slip.]<br/><br/>[Several months later, you hid in a mountain, contemplating the “Phoenix Dance Nine Heavens”. Suddenly, a finger tapped on your forehead, and you died. You were twenty-three.]<br/><br/>After watching this short life, Gu Yang wasn’t very surprised.<br/><br/>The First Rank coming to kill him must have been from the Lin Family. It was meant as a preventive measure, to kill him before he grew up.<br/><br/>What surprised him was that Chu Xiyue saved him, just for another match with him.<br/><br/>She was only Second Grade, but she managed to make the First Grade retreat.<br/><br/>This showed the weight of the Chu Family.<br/><br/>From then on, Chu Xiyue had been with him, and the First Rank from the Lin Family hadn’t dared to attack him. In total, he had a whole year.<br/><br/>In other words, as long as he could deal with the number one on the Hidden Dragon List in the coming year, he could ensure his own safety.<br/><br/>And the one who finally killed him was probably someone from the Shen Family. Maybe the individual from the Divine Power Realm of the Shen Family took action himself.<br/><br/>But it didn’t matter, as he already obtained what he wanted: the eighth level of the “Phoenix Dance Nine Heavens”.<br/><br/>[The simulation is over, you can keep one of the following.] [1. The Martial Arts Realm at the age of twenty-three.]<br/><br/>The Martial Arts experience at the age of twenty-three.]<br/><br/>The life wisdom at the age of twenty-three.]<br/><br/>“I choose the second one.”<br/><br/>The next moment, in Gu Yang’s consciousness, a phoenix bathed in red flames once again emerged. Countless martial arts techniques were transmitted from it.<br/><br/>“Huh?”<br/><br/>Xu Ruomei, who was meditating nearby, suddenly woke up, looking at Gu Yang across from her with surprise.<br/><br/>This was clearly the kind of movement that would happen when someone received the inheritance of a peerless martial art technique.<br/><br/>The “Dust Sword Technique” she practised, was a peerless martial art. It did not rely on text, but was directly passed on through a sword intent.<br/><br/>The sword intent came from a divine sword called the Dust Sword. She just had to break through to the Divine Power Realm, and she would be able to draw out the divine sword.<br/><br/>In the Sword Palace, there had always been five Sword Masters. Now only the Dust Sword had no master.<br/><br/>The peerless martial arts of other sects and noble clans were also passed down in this way.<br/><br/>However, to accept the inheritance in this wild and uninhabited place was a bit too rash.<br/><br/>The divine intention being emitted from Gu Yang’s body was of the fire attribute and had a sense of divinity.<br/><br/>An idea came to Xu Ruomei, “Could it be… that technique?”<br/><br/>The “Phoenix Dance Nine Heavens” of the Shen family that had been lost for nearly a hundred years. It was said that every generation of the Shen Family had people practising this technique, but so far, no one had ever cultivated it to the First Rank Realm, let alone the Divine Power Realm.<br/><br/>Moreover, those of the Shen Family who had practised the “Phoenix Dance Nine Heavens” throughout the generations have never travelled outside, so not many people have seen the power of this technique.<br/><br/>Unexpectedly, this technique fell into Gu Yang’s hands. Furthermore, he had already cultivated it to the Third Rank Realm at such a young age.<br/><br/>If the people of the Shen Family knew about this, it would likely be a major disaster.<br/><br/>With this thought, Xu Ruomei’s eyebrows furrowed slightly. She instinctively glanced at Su Qingzhen and her servant nearby. Seeing them still asleep, oblivious to what had happened, she somewhat relaxed her guard.<br/><br/>These two were too weak, from that they could not perceive the divine intention.<br/><br/>“So that’s why she’s here.”<br/><br/>Finally, she understood why Gu Yang insisted on taking that woman with him.<br/><br/>For a practitioner of a fire attribute technique, this woman’s icy jade-like skin was an invaluable cultivation furnace. Perhaps her contribution also had a role to play in Gu Yang’s rapid progress.<br/><br/>A moment later, the divine intention disappeared, and Xu Ruomei closed her eyes again, as if nothing had happened.<br/><br/>Crack!<br/><br/>A crackling sound came from the burning fire.<br/><br/>From a rock not far away, the alert Zhang Xiao Hai looked over. Seeing nothing happen, he turned back to continue his guard duty.<br/><br/>Gu Yang had obtained the eighth level of the “Phoenix Dance Nine Heavens”. He could finally begin the assault on the Second Rank Realm.<br/><br/>He just didn’t know how much time it would take to cultivate to the peak of the Third Rank.<br/><br/>His current balance was 560,000, meaning he could perform twenty-eight simulations.<br/><br/>But there was one problem. This technique required the accumulation of time. But in half a month, a First Rank powerhouse would come to kill him.<br/><br/>So, he had to resolve this trouble first.<br/><br/>This time, even if he went to Divine City, the Tianxin Martial Arts Hall wouldn’t be able to protect him. After all, Cheng Tianxin was only Second Grade. If the First Rank from the Lin family went to kill him, Cheng Tianxin wouldn’t be able to withstand it.<br/><br/>He needed to find another way.<br/><br/>After a moment’s thought, Gu Yang had an idea, so he opened the Life Simulator.<br/><br/>[Do you want to use the Life Simulator? Using it once will consume 20,000 coins.]<br/><br/>“Yes.”<br/><br/>PS: It’s Monday, please vote..\t\t\t\t\t\t</div>", "images": {}, "success": true}