{"id": 70, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297837.html", "title": "Chapter 70 - Chapter 70: What Is Divine Power Realm?", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 70 - Chapter 70: What Is Divine Power Realm?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 70: What is Divine Power Realm?<br/><br/>Translator: 549690339<br/><br/>“Elder Wii?”<br/><br/>Upon seeing Elder Wu, Chu Xiyue was surprised, “Why are you here?”<br/><br/>Elder Wu seemed somewhat melancholic, “It’s a series of fortunate coincidences. How are your injuries?”<br/><br/>“I won’t die.”<br/><br/>Chu Xiyue had regained some of her True Essence at this moment and wasn’t as pitiful as before, “Does Elder Wu have any knowledge about this man’s origins?”<br/><br/>Elder Wu shook his head, “This person seems to have emerged out of thin air. Up till now, I haven’t been able to uncover his lineage.”<br/><br/>Given Elder Wu’s insight, it was likely he could identify the man’s cultivation technique and martial arts.”<br/><br/>Elder Wu hesitated slightly before disclosing, “If I am not mistaken, the saber technique he just used is the first move, Hidden Knife Style, from ‘God<br/><br/>Destroyer Nine Styles’ of the Wu Family.”<br/><br/>However, he did not discuss Gu Yang’s cultivation technique.<br/><br/>Chu Xiyue naturally knew about ‘God Destroyer Nine Styles’, a renowned saber technique of the Wu Family, but since the Wu Family’s destruction, that technique hadn’t reappeared in the martial arts world.<br/><br/>She speculated, somewhat incredulously, “How long would he have to cultivate to wield such power with this single strike?”<br/><br/>Without at least a decade, it would be impossible to cultivate such terrifying power.<br/><br/>The man only seemed to be in his early twenties?<br/><br/>Elder Wu again shook his head, “There are certain oddities about this man.”<br/><br/>Not long ago, he had witnessed Gu Yang’s strike which would normally nullify any cultivation of the Blade Intent.<br/><br/>Could it be that, within a mere month, Gu Yang had cultivated such a terrifying Blade Intent?<br/><br/>There were indeed bizarre peculiarities about this man, enough to make even the experienced Elder Wu hesitate to make presumptions.<br/><br/>Furthermore, he didn’t mention anything involving this man’s secrets.<br/><br/>It’s common knowledge that the lord of the Red Mansion never leaves the mansion. But for them, the patrolling officers, even if they were killed, nobody would avenge them.<br/><br/>So as a means of survival against those above the Third Rank, they adopt the idiom ‘avoid trouble when possible’.<br/><br/>At this moment, Wu Xingyun finally woke up, yet he lay there, stunned and speechless for a long time.<br/><br/>After seeing his condition, Elder Wu understood that he had received a tremendous blow.<br/><br/>Wu Xingyun’s father, King Jinghai, is the top First Rank, the number one below the Divine Power Realm.<br/><br/>As a minor son, he was neglected and couldn’t practice martial arts due to his birth mother’s jealousy and alienation.<br/><br/>It was until his mother died when he turned thirteen, that he left the Jinghai Mansion for the Divine City. After joining the martial arts academy, he exhibited astonishing talent, and shot to fame. Within ten years, he reached the top of the Hidden Dragon List.<br/><br/>Both father and son occupied the top of two separate lists and were celebrated as a unique occurrence throughout the generations, becoming the talk of the town.<br/><br/>That was until Chu Xiyue emerged and defeated him, forcing him down to second on the Hidden Dragon List.<br/><br/>There was no shame in losing to Chu Xiyue. She was simply stronger, nothing more to it.<br/><br/>But now, facing defeat at the hands of a Third-Rank martial artist, was something he found hard to accept being an extremely proud man.<br/><br/>Wu Xingyun’s lifelong ambition was to top the First Rank List and surpass his father.<br/><br/>Therefore, he found this failure particularly hard to accept.<br/><br/>If he couldn’t even defeat a Third -Rank, how could he consider challenging his First-Rank undefeated father?<br/><br/>Night fell, and a thin, new moon hung high.<br/><br/>In the woods, by a bonfire, Gu Yang and the others were roasting game.<br/><br/>After she woke up, Su Qingzhi refrained from throwing tantrums, instead choosing to remain silent and ignoring both Xu Ruomei and Gu Yang.<br/><br/>Xu Ruomei woke up a bit earlier, but her condition had significantly deteriorated.<br/><br/>Although the Blade Intent was not directed at her, at such a close distance, she was still affected. Her initially shattered Daoist Heart, was nearly completely destroyed under the influence of the Blade Intent.<br/><br/>Now, with her cultivation level completely obliterated, she was essentially imperiled.<br/><br/>That was why Gu Yang was keeping her with him. After all, she had intended to stand with him during the altercation which resulted in this outcome. He feared that, given the Sword Palace’s track record, she, being crippled now, would face an uncertain fate upon her return.<br/><br/>Feeling guilty, Gu Yang decided not to mention this incident again to avoid rubbing salt into her wounds. He changed the topic, “Do you know anything about Chu Xiyue?”<br/><br/>Xu Ruomei responded, “Chu Xiyue is the first place on the Hidden Dragon List, ranked ninth on the Beauty List for her transcendent beauty and a member of<br/><br/>Chu Family.”<br/><br/>First place on the Hidden Dragon List?<br/><br/>Gu Yang felt a headache brewing, knowing his cover was completely blown.<br/><br/>If blame could be placed, it would be on the system. Every simulation it presented only included a brief introduction of a person’s life experiences. Unimportant details would not be mentioned.<br/><br/>The simulation didn’t inform him, for instance, the Second Ranks dispatched by Lin Zihua would attract so many onlookers. If he had known, he wouldn’t have made such a big blunder.<br/><br/>He asked again, “What formidable talent does the Chu Family possess?”<br/><br/>“The leader of the family is Chu Lianxing, her mother. She is tenth on the First Rank list. They have a few more First Ranks but they rarely show themselves and outsiders know little about them.” She didn’t mention the Second Ranks.<br/><br/>“What about the Divine Power Realm?”<br/><br/>“At least two. One is an unspecified ancestor of the Chu Family. The other is<br/><br/>Chu Mei, who became a Divine Power 150 years ago and is likely in the Mana<br/><br/>Realm. ”<br/><br/>Two Divine Powers. The power behind these big families was indeed immeasurable.<br/><br/>Gu Yang inquired again, “How is power evaluated beyond the Divine Power Realm?”<br/><br/>Xu Ruomei readily provided him with the information, “The Divine Power<br/><br/>Realm is divided into three realms: Golden Body, Mana, and Unleaking.”<br/><br/>“Once the Golden Body is achieved, one becomes impervious to all evils, invincible to ordinary weapons, and possesses the strength of a dragon elephant. From then on, no martial artist from the Human Realm poses a threat to him.”<br/><br/>“Beyond the Golden Body, one needs to practice Mana. From then on, they can manipulate the Vitality of heaven and earth for their own use, using various incredible means, almost like an immortal.”<br/><br/>“When the Mana is practiced to its extreme, and the Mana body is unified, the Unleaking Body is accomplished. From then on, one possesses an incredibly long lifespan. Therefore, this state is also known as the Longevity Realm.”<br/><br/>Gu Yang’s eyes brightened up, “In other words, once the Unleaking Realm is reached, one can achieve longevity?”<br/><br/>Xu Ruomei replied, “In reality, ‘longevity’ is an exaggeration. But, if one manages to survive over a thousand years in a special environment, there would be nothing astonishing about it.”<br/><br/>A lifespan spanning a millennium.<br/><br/>Gu Yang did a mental calculation. At present, he was a Third Rank and was precisely five realms away from the Unleaking Realm.<br/><br/>The other three listened to Gu Yang and Xu Ruomei’s conversation, without any intention of avoiding them.<br/><br/>As Su Qingzhi and the others listened to the conversation, they all felt incredibly envious. To live for over a thousand years was equivalent to being an immortal.<br/><br/>PS: It’s Monday again, I need your votes..\t\t\t\t\t\t</div>", "images": {}, "success": true}