{"id": 79, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297854.html", "title": "Chapter 79 - Chapter 79: 079 First On The Hidden Dragon List", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 79 - Chapter 79: 079 First On The Hidden Dragon List</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 79: 079 First on the Hidden Dragon List<br/><br/>Translator: 549690339<br/><br/>Gu Yang invoked his True Essence, concentrating it in his palm — an incredible heat radiated, emitting like an invisible fire.<br/><br/>His True Essence now possessed the properties of fire, increasing its power several times over.<br/><br/>In this Simulation, having only recently broken through and without upgrading his saber technique, he was able to exchange a few moves with a<br/><br/>First Rank expert. It was evident how significantly his strength had improved.<br/><br/>After reaching the Second Grade, the technique of “Phoenix Dance Nine Heavens” finally demonstrated the true power of this unparalleled method.<br/><br/>Gu Yang withdrew his True Essence and took a deep breath, opening the system with some heaviness.<br/><br/>[ Would you like to use the Life Simulator? It will consume 100 ,ooo coins for one use. ]<br/><br/>A hundred thousand coins!<br/><br/>Seeing this number, he couldn’t help but clutch his chest, finding it hard to breathe.<br/><br/>This broken system really wasn’t humane!<br/><br/>In other words, his current balance of 630,000 would only allow six simulations.<br/><br/>All the circulating funds from Cao Yiyi’s Jinxiu Pavilion branches in a single state amounted to only 750,000 – just enough for seven simulations.<br/><br/>Where would he get money in the future?<br/><br/>Unless he robbed one of the nine families in the world, it would probably be a challenge to gather enough money for the breakthrough to Divine Power.<br/><br/>Forget it, don’t think about this for now.<br/><br/>Try another simulation, upgrade the saber technique, and rescue Su Qingzhi and the others first.<br/><br/>Gu Yang gritted his teeth and spat out the word “yes”.<br/><br/>Divine City.<br/><br/>The continuous rain had finally stopped. As dawn broke, the morning sun started to rise above the mountains.<br/><br/>A rare break to enjoy beautiful weather.<br/><br/>Outside the Martial Arts Academy, two energetic men arrived—one in a blue robe, the other in black. They stood at the entrance, awaiting the opening of the academy doors.<br/><br/>The man in black looked at the Academy’s gate and reminisced, “When Great Zhou’s founder established the Martial Arts Academy, he personally managed it, with several founding generals as instructors. Disciples of humble origin from all over the world flocked to join. It was a glorious sight. Who would have thought that after just a few hundred years, it would fall into such disrepair.”<br/><br/>Turning his head, he asked, “Brother Qin, why did you choose to come to the<br/><br/>Martial Arts Academy instead of the Literature Academy during your visit to Divine City?”<br/><br/>Known as Brother Qin, he was a person of great importance, Qin Shang—the heir of the Qin Family and ranked fourth on the Hidden Dragon List.<br/><br/>Looking towards the direction of the Martial Arts Academy, Qin Shang said, “Years ago, the Academy Head gave my father some pointers. Before I left, my father specifically instructed me to pay a visit to the Academy Head when I arrived. ”<br/><br/>“I see.”<br/><br/>The man in black was also of high significance—the legitimate first son of the Gu family in Divine City, Gu Yunfei, who was ranked twentieth on the Hidden Dragon List.<br/><br/>Years ago, the two formed an instant bond upon meeting and became close friends.<br/><br/>This time, with Qin Shang visiting Divine City, Gu Yunfei, as the host, naturally kept him company.<br/><br/>Out of the blue, Gu Yunfei looked towards an unassuming list on the opposite side and laughed, “I’ve heard that the marriage between Brother Qin and Miss Chu is imminent. Allow me to offer my early congratulations.”<br/><br/>The news of Oin Shang’s proposal to Chu Xiyue of the Chu Family with the Bright Moon Sabre as the betrothal gift had already spread far and wide.<br/><br/>Upon hearing him mention Chu Xiyue, Qin Shang’s face twitched slightly.<br/><br/>The healed wound on his face seemed to throb with a dull pain.<br/><br/>A year ago, this woman, who was ranked lower than him, challenged him and left a scar on his face after dozens of moves.<br/><br/>He had actually lost to a woman who ranked several places lower than him.<br/><br/>This incident had always been viewed by him as a great humiliation.<br/><br/>Never did Qin Shang imagine that his father would want him to marry this woman.<br/><br/>Deep down, he was resistant to the idea.<br/><br/>But, it was the wish of their ancestor, and he couldn’t say no.<br/><br/>No one in the Qin family could defy the ancestor’s commands, not even his father.<br/><br/>No matter how reluctant he was, he had to marry her.<br/><br/>At that moment, a figure appeared on the opposite road, limping towards them.<br/><br/>Gu Yunfei expressed his surprise, “The list has been changed today.”<br/><br/>“A change in the list?”<br/><br/>Qin Shang, following his gaze, saw a limping old man.<br/><br/>Gu Yunfei explained, “This is the man who is responsible for changing the lists. His presence signifies that there has been a change. However, I wonder which list has seen this change.”<br/><br/>No matter which ranking list experiences a change, it is a significant event.<br/><br/>The last time there was a change was half a month ago when a man named Gu Yang suddenly appeared at the seventh place on the Hidden Dragon List, becoming the hottest topic in Divine City recently.<br/><br/>It just so happened that this man carried the surname Gu, and Gu Yunfei had heard more than once people discussing whether Gu Yang was a bastard of the Gu family that was abandoned.<br/><br/>An old man walked up to the Hidden Dragon List, removed the board that had been put up less than half a month ago, slathered it with glue, and posted a new board.<br/><br/>Both Qin Shang and Gu Yunfei were slightly surprised, “The Hidden Dragon List again?”<br/><br/>A moment later, the old man finally finished posting the new board and left with his bucket.<br/><br/>Qin and Gu looked at the board closely, and suddenly both of their eyes shrank and shock registered on their faces.<br/><br/>Gu Yunfei exclaimed, “How could it be him?”<br/><br/>The reason for their shock was because the ranks on the list were unbelievably surprising.<br/><br/>The first rank on the list had been replaced with another name other than Chu Xiyue.<br/><br/>And now the top name on the list was none other than Gu Yang, who had just recently joined the list.<br/><br/>Gu Yang, Third Rank, Jiangzhou.<br/><br/>Both of them looked at each other unconsciously, seeing the horror in each other’s eyes.<br/><br/>For a moment, none of them spoke, the atmosphere became somewhat strange.<br/><br/>Gu Yunfei swallowed, “Could…could it be a mistake?”<br/><br/>This Gu Yang, not more than half a month since he made it onto the Hidden Dragon List and instantly took seventh place, was already a shocking event. Now, he had taken the top spot.<br/><br/>Anyone’s first reaction would be disbelief.<br/><br/>He’s just Third Rank in his cultivation, how could he possibly rank first?<br/><br/>Gu Yunfei’s first reaction was, could it be a mistake?<br/><br/>Qin Shang fixated on the name, murmuring, “What do you think? This list has been there for a thousand years and has never made a mistake.”<br/><br/>Gu Yunfei thought carefully. Indeed, he has never heard that the Red Mansion would get the list wrong.<br/><br/>He mumbled, “But how could this be possible?”<br/><br/>A third-ranked martial artist taking the top spot on the Hidden Dragon List, such a thing has never happened before.<br/><br/>Qin Shang responded harshly, “Have you forgotten? How did Gu Xiyue make it to the top back then?”<br/><br/>Gu Yunfei realized something and gasped, blurting out, “Are you saying that he actually defeated that witch?”<br/><br/>In private, many people called Chu Xiyue the witch.<br/><br/>She never spared anyone’s face. Two years ago, she challenged all the men who were ahead of her one by one, defeating them all and causing them great humiliation. She wasn’t disliked by just one or two people. Naturally, her reputation didn’t fare well.<br/><br/>Qin Shang did not know the real answer. He recalled his battle with Chu Xiyue a year ago. Even now, he still lacked the confidence to win against her from a year ago, let alone now.<br/><br/>Now, could the powerful Chu Xiyue be defeated by a third-ranked martial artist?<br/><br/>He couldn’t imagine it.<br/><br/>At that moment, a few people gathered in front of the list and began to argue fiercely.<br/><br/>A third-ranked martial artist taking the top spot on the Hidden Dragon List was too explosive.<br/><br/>They all said that it must be a mistake on the list, perhaps it happened during copying.<br/><br/>Amid the confusion, the old man appeared again with his bucket.<br/><br/>“Why is he coming back?”<br/><br/>Qin Shang and Gu Yunfei exchanged glances again.<br/><br/>The old man again walked to the Hidden Dragon List, removed the board he had just put up, and pasted another one again.<br/><br/>Everyone was eager to see it.<br/><br/>Gu Yang’s name was still at the top of the list. The only change was his cultivation rank, which had been updated from Third Rank to Second Rank.<br/><br/>Gu Yunfei visibly relaxed, saying, “I knew it, it must have been a mistake with the list.”<br/><br/>After he finished speaking, he felt that something was not right again. This Gu Yang had just broken through to the Second Rank, so why could he take the top spot at the list?<br/><br/>Those who were originally ranked in the top five had all been at the Second<br/><br/>Rank for at least one or two years. What merits did he have to be ranked first?<br/><br/>Just then, a figure landed behind Qin Shang and reported, “Young master, something big happened.”<br/><br/>Qin Shang said, “Speak.”<br/><br/>“Five days ago, in Ping County, Jiangzhou, Gu Yang, who ranked seventh on the<br/><br/>Hidden Dragon List, defeated three Second Ranks with one move. MO Yu from Lin family died on the spot, while Chu Xiyue and Wu Xingyun were seriously injured.”<br/><br/>The news left both of them speechless.<br/><br/>Defeating three Second Rank martial artists in one move, including Chu Xiyue and Wu Xingyun, the first and second strongest on the Hidden Dragon List, was this even true?\t\t\t\t\t\t</div>", "images": {}, "success": true}