{"id": 78, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297852.html", "title": "Chapter 78 - Chapter 78: 078 Second Grade", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 78 - Chapter 78: 078 Second Grade</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 78: 078 Second Grade<br/><br/>Translator: 549690339<br/><br/>[ …you discover that Su Qingzhen and the others have gone missing. You proceed to Pingjun City and find Chu Xiyue who is still recovering from her injuries, seeking her assistance. She readily agrees and also brings along Wu<br/><br/>Xingyun.]<br/><br/>[The three of you catch up to the Liu family’s convoy. After an intense battle, you successfully rescue Su Qingzhen, Xu Ruomei, and the others unscathed.<br/><br/>Only Zhang Xiao Hai sustains serious injuries.]<br/><br/>[Afterwards, you and Chu Xiyue travel together, discussing Martial Arts along the way. Several days later, a First Rank member from the Lin Family arrives in pursuit and is driven away by Chu Xiyue.]<br/><br/>[Once Chu Xiyue recovers from her injuries, she formally challenges you, urging you not to hold back. After twenty moves, she is defeated by you.]<br/><br/>[In the following year, you spar three times, and each time Chu Xiyue is defeated. The last time she loses to you, she announces her intention to return home to get married. Seeing your lack of response, she leaves dejectedly.]<br/><br/>[Later, Wu Xingyun invites you to Divine City to join the Martial Arts Academy. You agree, and take Su Qingzhen along, bidding goodbye to Xu Ruomei, and head to Divine City.]<br/><br/>[With Wu Xingyun’s introduction, you meet the dean of the Martial Arts Academy, earn his recognition, and become one of the professors in the academy. This allows you to freely observe the academy’s secret manuals.]<br/><br/>[After that, you and Su Qingzhen reside in the academy where you teach disciples while cultivating your Martial Arts.]<br/><br/>[Five years later, the dean of the academy gets caught up in a treason case because he opposes the reigning empress and is thus imprisoned. Several other professors are implicated, and you are among the detained.]<br/><br/>[You are unwilling to be captured without a fight and attempt to escape with Su Qingzhen, but a First Rank expert strikes you down on the spot, violently ending your life at the age of twenty-eight.]<br/><br/>Having finished viewing this simulation of life, Gu Yang finally lay to rest his remaining concerns.<br/><br/>Su Qingzhen and Xu Ruomei were indeed safe and sound.<br/><br/>Moreover, this simulation triggered a new character. Thanks to Wu Xingyun’s recommendation, he joined the academy and spent five peaceful years there.<br/><br/>This additional option was an unexpected joy for him.<br/><br/>Although it was only five years, it was still a good experience.<br/><br/>This simulation primarily aimed to confirm the safety of Su Qingzhen and the others.<br/><br/>[Simulation ended. You can choose to keep one ot the following rewards.]<br/><br/>[One, Martial Arts Realm at twenty-eight years old.] [Two, Martial Arts Experience at twenty-eight years old.] [Three, Life Wisdom at the age of twenty-eight.]<br/><br/>Gu Yang immediately chose Martial Arts Experience.<br/><br/>He was already at the pinnacle of Third Rank, choosing the realm had no meaning since he would have to start all over again after his next Nirvana.<br/><br/>The next moment, his mind was filled with more comprehension about Martial Arts.<br/><br/>The rewards of this simulation were far greater than he had expected.<br/><br/>Before this, he had haphazardly learned a little here and there without a systematic approach. Even learning the unrivaled skill “Phoenix Dance Nine Heavens” didn’t bring any substantial changes.<br/><br/>Until now, after joining the academy, he finally had the chance to systematically sort out what he had learned about Martial Arts.<br/><br/>The five years helped him gain a deeper understanding of Martial Arts.<br/><br/>Consequently, he gained a deeper knowledge of the unrivaled skill “Phoenix Dance Nine Heavens”.<br/><br/>The potential benefits were considerable.<br/><br/>Gu Yang couldn’t help but feel curious about the dean of the academy. This person’s Martial Arts level was apparently very advanced.<br/><br/>The academy, which Xu Ruomei had mentioned a few days ago, was an institution established by the Great Zhou official to nurture talents.<br/><br/>The Great Zhou’s founding emperor had initially set up the Literary and Martial Arts Academies with the intention of breaking the monopoly of the prominent families and sects, in order to cultivate talents for the court.<br/><br/>Now, more than four hundred years later, the Literary Academy has separated from the court and has become one of the six major sects. The Martial Arts Academy, however, has been languishing and barely kept alive, with little presence.<br/><br/>The status of the two could be said to be vastly different.<br/><br/>It wasn’t until recent years that the Martial Arts Academy once again caught the public eye because of Wu Xingyun.<br/><br/>Of course, a grasshopper that’s starved to death is still bigger than a horse. No matter how impoverished the Martial Arts Academy was, it could still afford to shelter a Third Rank individual like him. Unfortunately, in the end, it was dragged into court disputes and became a casualty of politics.<br/><br/>These thoughts flashed through Gu Yang’s mind and were quickly cast aside as he started another simulation.<br/><br/>[ …After you realize that Su Qingzhen and the others have gone missing, you return to Pingjun City and wait for Ling Ling to come out of seclusion. Under her protection, you begin your Nirvana.]<br/><br/>[From then on, Ling Ling takes you into hiding.]<br/><br/>[Five years later. you have advanced to the Eighth Grade.]<br/><br/>[Another eight years, you have advanced to the Seventh Grade.]<br/><br/>[Another five years, Ling Ling reaches the top of the First Rank list, preparing to break into the Divine Power Realm. She attracts the siege of several First Rank experts. You are affected by the fight and die in the process, dying at the age of forty.]<br/><br/>When Gu Yang sees this, he discovers something magical. Why is it that when he is with Ling Ling, he is able to stay safe until she cultivates to the peak of the First Rank and prepares to break into the Divine Power Realm, and only then is surrounded and killed?<br/><br/>It appears that her ability to escape is indeed strong.<br/><br/>After receiving his reward, Gu Yang starts another simulation.<br/><br/>So it went. He continued the simulations until finally, on the thirteenth round, there was a change.<br/><br/>[ …One day, ten years later, you feel something in your heart. True Essence bursts forth from your body, transforming into a phoenix. After soaring in the sky for two rounds, it dives back into your body. You successfully step into the Second Rank Realm.]<br/><br/>[Eight years later, Ling Ling prepares to break through to the Divine Power Realm. She gets surrounded and attacked by several First Rank experts, and you barely hold off one of them. In the end, the heavily wounded Ling Ling forcefully breaks into the Divine Power Realm. She kills the several First Rank experts but also burns herself out and dies.]<br/><br/>[Subsequently, you hear the words ‘evils of the Wu Family’ and you too explode and die, passing away at the age of forty.]<br/><br/>Seeing the results of this simulation, Gu Yang felt somewhat excited.<br/><br/>He finally reached the Second Rank.<br/><br/>It was truly too hard. Adding up the time, he must have cultivated for nearly four to five hundred years, and only then did he reach the Second Rank. [Simulation ended. You can choose to keep one of the following rewards.]<br/><br/>[One, Martial Arts Realm at forty years old.] [Two, Martial Arts Experience at forty years old.]<br/><br/>[Three, Life Wisdom at the age of forty.]<br/><br/>“I choose the first one.<br/><br/>Rumble!<br/><br/>Gu Yang felt his True Essence bubbling up in an instant. The little phoenix in his consciousness unexpectedly emerged from his body, sucking in all of his True Essence.<br/><br/>A phoenix, the size of a fist, emerged from his forehead. With a vertical ascent into the sky and a clear cry, it spread its wings to fly. After soaring twice, its body grew several times larger then it once again entered his forehead.<br/><br/>“Ahh<br/><br/>Gu Yang cried out, his entire body was wrapped in roaring flames, turning him into a fiery silhouette.<br/><br/>After a while, the flames extinguished, and everything on his body had been burnt to crisps. The only thing left unscathed was the Phoenix Feather Knife.<br/><br/>Gu Yang opened his eyes, looked at his hands, and saw that his skin was smooth. Even the small scars that had been there before had vanished.<br/><br/>He felt that the condition of his body was better than ever, as if he had been reborn.<br/><br/>He suddenly thought of the first level of the Divine Power Realm called the Golden Body.<br/><br/>At the second grade, the “Phoenix Dance Nine Heavens” began laying a solid foundation for the Divine Power Realm. No wonder it was considered an unrivaled skill.<br/><br/>PS: I will confirm again that the book will be placed on the shelves next Friday. After that, the update speed will definitely increase, at least 6000 words per day, and strive to reach 7000, 8000, or 9000 words..\t\t\t\t\t\t</div>", "images": {}, "success": true}