{"id": 72, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297840.html", "title": "Chapter 72 - Chapter 72: 072 Plan B", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 72 - Chapter 72: 072 Plan B</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 72: 072 Plan B<br/><br/>Translator: 549690339<br/><br/>[At the age of twenty-two, you possess the power of the Third Rank, ascending to the seventh spot on the Hidden Dragon List. In Pingjun City, you defeated three Second-Rank individuals with a single blow, spreading your name far and wide as the number one individual of the Third Rank.]<br/><br/>[After entrusting Su Qingzhen and Xu Ruomei to Ling Ling, you retreat alone to the southernmost seaside of Great Zhou, living in seclusion under a false name as you painstakingly cultivated your abilities.]<br/><br/>[Three years later, a group of people stormed into your home and attacked you without provocation. Killing several of them in retaliation, you drove the rest away before moving away from this place.]<br/><br/>[Since then, numerous people have sought to kill you, suspecting that you were in possession of the inheritance of a Divine Power practitioner that was supposedly hidden on the mountain where you resided. Their suspicions arose from the fact that the alleged treasure had vanished.]<br/><br/>[A month later, a First-Rank powerhouse finally catches up with you. Knowing that you couldn’t escape, you used up all your strength in a fight to death, ultimately dying at the age of twenty-five.]<br/><br/>Gu Yang once again felt a deep sense of malice from the World Will.<br/><br/>His random choice of a retreat location turned out to be where a Divine Power practitioner had supposedly hidden their inheritance.<br/><br/>To gain possession of that inheritance, even a First-Rank expert was led to act against him.<br/><br/>It appeared that this path was truly impassable. Even though he had reached the Third Rank with strength comparable to the Second Rank, he would face disaster within a few years.<br/><br/>[Simulation ends. You can choose to keep one of the following:] [One, your martial arts realm at the age of twenty-five.] [Two, your martial arts experience at the age of twenty-five.]<br/><br/>[Three, your life wisdom at the age of twenty-five.]<br/><br/>Gu Yang naturally chose the first option. For his “Phoenix Dance Nine<br/><br/>Heavens,” only through such accumulation could he achieve a breakthrough.<br/><br/>The increase in power gained through three years of intense cultivation was minimal.<br/><br/>It can’t be ignored that without Su Qingzhen by his side, his cultivation progress was vastly slower.<br/><br/>He began to appreciate the value of her intrinsic Ice Muscle Jade Bone.<br/><br/>“It seems, I have to find another way.”<br/><br/>After some pondering, Gu Yang decided to find a backer.<br/><br/>The Tianxin Martial Arts Hall was no longer an option, but there were many other forces in Great Zhou.<br/><br/>“I’ll consult with Xu Ruomei tomorrow and plan accordingly.”<br/><br/>Thought Gu Yang.<br/><br/>Each simulation opportunity is precious and can’t be used for trial and error. It would be wiser to figure out the most reliable force first.<br/><br/>Into the late night, Gu Yang let Zhang Xiao Hai go to bed and he took over the night watch.<br/><br/>The night passed without any conversation. As the new day dawned, Xu Ruomei awoke.<br/><br/>Gu Yang wasted no time, “If I want to join some power, which one do you think is most reliable?”<br/><br/>Xu Ruomei pondered for a moment before responding, “The Great Zhou court.” Her answer caught Gu Yang off guard, “Why?”<br/><br/>“Apart from the mysterious Four Great Sacred Lands, the strongest forces are the Six Great Sects, the Nine Great Clans, and the Great Zhou court.’<br/><br/>“The Six Great Sects typically don’t accept disciples who joined halfway. Even if they do, they wouldn’t treat you as one of their own. As for the Nine Great Clans, serving them would ruin your future. Only the Great Zhou court could possibly accept you.”<br/><br/>“Don’t underestimate Great Zhou. The strongest force in the world, apart from the mysterious Four Great Sacred Lands, is the Great Zhou court. Eighteen years ago, the Wu Family, a large influential family, was annihilated by the court in just one night. From then on, the Ten Great Clans became the Nine Great Clans.’<br/><br/>This got Gu Yang thinking. Indeed, the Great Zhou court was the ruler of this country. It held power over all other forces in the country, making it undoubtedly stronger than any of them. He considered it as an alternative plan.<br/><br/>However, it remained only an option. He remembered too well the cruel and heartless nature of these politicians. They had no qualms about betraying their subordinates, not much better than nobles.<br/><br/>He asked, “Who in the Great Zhou court is worth serving?”<br/><br/>Xu Ruomei shook her head, “There are countless factions in the Great Zhou court and my understanding is limited. If we’re talking about the most influential figures, there are three: Luo Wang, the Lord of the State, and Jinghai Wang.”<br/><br/>Gu Yang noted down these three names, intending to attempt communication with them in the future.<br/><br/>Next, he asked Xu Ruomei about the Six Great Sects and Nine Great Clans, finally gaining a basic understanding of Great Zhou’s major powers.<br/><br/>After breakfast, the group continued their journey.<br/><br/>Intentionally avoiding Yuzhou, Gu Yang decided to head south towards<br/><br/>Wanzhou.<br/><br/>They chose to travel through desolate paths. However, due to the inexperienced Zhang Xiao Hai and Zhi Xing, coupled with Xu Ruomei who lost all her cultivation, they inevitably left many traces behind. It was only a matter of time before any competent trackers found them.<br/><br/>Another day passed in the blink of an eye.<br/><br/>When night fell, Gu Yang sat by the fire, continuing with another simulation.<br/><br/>[ …You bring Su Qingzhen to seek refuge in Luo Wang’s estate but are turned away.]<br/><br/>[Then you go to Divine City to serve the Lord of the State. Instead, the Lord’s son takes a fancy to Su Qingzhen. You fall into a trap and are hunted down by the guards of the Duke’s mansion. You and Su Qingzhen manage to escape Divine City after facing numerous dangers.]<br/><br/>[On the road to Dongzhou, you are caught up with by a First-Rank powerhouse from the Lin Family and are killed in the ensuing battle, dying at the age of twenty-three.]<br/><br/>Gu Yang looked at the conclusion of this simulation without too much disappointment, as he had anticipated this.<br/><br/>Without any connections, seeking shelter from these powerful figures would not be that easy.<br/><br/>Not to mention he had Su Qingzhen with him. As the saying goes, ‘a beautiful woman is often a source of trouble.’ The more beautiful the woman, the more likely it was to bring significant trouble.<br/><br/>It seemed that it would likely be the same outcome if he went to Jinghai Wang.<br/><br/>[Simulation ends. You can choose to keep one of the following:] [One, your martial arts realm at the age of twenty-three.] [Two, your martial arts experience at the age of twenty-three.]<br/><br/>[Three, your life wisdom at the age of twenty-three.]<br/><br/>Gu Yang chose the first option.<br/><br/>Every little bit counts.<br/><br/>He then began a new round of simulation, this time, choosing Plan B.<br/><br/>[ …You leave Pingjun City with Su Qingzhen and Xu Ruomei. Half a month later, a First-Rank powerhouse catches up with you. At the critical moment, Chu Xiyue comes to your aid, intimidating the First-Rank powerhouse into temporary retreat.]<br/><br/>[Afterwards, Chu Xiyue challenges you. You accept and manage to gain the upper hand after fifty moves. You agree to another match in a month.]<br/><br/>[From then on, Chu Xiyue follows you. Along the way, both of you discuss martial arts and validate each other’s martial knowledge. Gradually, you develop feelings for each other.]<br/><br/>[A month later, during your rematch, Chu Xiyue uses a desperate sword technique after eighty moves. You don’t have the heart to hurt her and end up severely wounded by her strike.]<br/><br/>[After this, Chu Xiyue stays by your side day and night, helping you heal your injuries. From that point on, both of you enjoy your time in each other’s company….\t\t\t\t\t\t</div>", "images": {}, "success": true}