{"id": 80, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297856.html", "title": "Chapter 80 - Chapter 80: Liu Zhe 080", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 80 - Chapter 80: Liu Zhe 080</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 80: Liu Zhe 080<br/><br/>Translator: 549690339<br/><br/>[At twenty-two, you’ve already reached the Second Grade Realm, standing at the top of the Hidden Dragon List, your name has shaken the heavens.]<br/><br/>[You went to Jiangzhou City to find the Shadow Thief’s treasure, discovered that Su Qingzhen and others were missing. Suspecting the Liu family to be responsible, you went to Ba County, asking for help from Chu Xiyue and Wu<br/><br/>Xingyun.]<br/><br/>[The three of you combined forces and rescued Su Qingzhen and the others.] [Later, Chu Xiyue and you traveled together. After several days, a First Rank member of the Lin Family arrived, but was driven away by Chu Xiyue.]<br/><br/>[After Chu Xiyue had recovered from her injuries, she challenged you and lost to your saber within ten moves. In the following sessions, she lost to you every time.]<br/><br/>[A year later, she said goodbye to you, and left gracefully.]<br/><br/>[Wu Xingyun invited you to go to Divine City, and you agreed. With his introduction, you successfully joined the Martial Academy, becoming a professor.]<br/><br/>[Five years later, the Dean of the Martial Academy was implicated in palace infighting and thrown into prison. Several professors were caught in the crossfire, and you were also on the arrest list.]<br/><br/>[Unwilling to be captured, you and Su Qingzhen decided to leave Divine City. Qi Liancheng, the commander of the internal guards, pursued you and eventually forced you into a battle. After fifty moves, you lost to him. Showing appreciation for your talent, he didn’t kill you but instead gave you two options: death or working for the internal guards.]<br/><br/>[You became a member of the internal guards, codenamed Phoenix. You were granted an audience with the current Empress and received a mission to change your name and disguise yourself to infiltrate the Literati Academy. Su Qingzhen, held as a hostage, was kept in the palace.]<br/><br/>[With the help of an imperial doctor, you had facial reconstruction surgery. In a secluded place, you received guidance from a Saber Saint, and after a year of arduous training, you mastered three more styles of “God Destroyer Nine Styles”. Your saber skills improved significantly.]<br/><br/>[Afterwards, you went to the Literati Academy, disguised as a swordsman returning from a distant sea, and successfully joined the academy.]<br/><br/>[Through your exceptional strength, within a year, you became a figure of significant influence in the academy.]<br/><br/>[One day, you finally received a mission to defeat Ye Lingbo, the Chief of the Literati Academy. As long as you completed this task, they would allow you and Su Qingzhen to leave.]<br/><br/>[An opportunity quickly arose, and you didn’t hesitate to take it. After a few moves, you realised that the opponent’s strength was even greater than yours. However, the opponent’s moves were deadly, not allowing you respite. You were in a bind and, in a crucial moment, you let out the strongest slash you’d ever performed in your life, inflicting him with severe injuries. You were killed, deceased at the age of thirty.]<br/><br/>After going through this life, Gu Yang felt heartbroken.<br/><br/>He had spent a hundred thousand taels, but only managed to live until the age of thirty.<br/><br/>In reality, with his current strength, he was fully capable of taking Su Qingzhen and hiding away with Ling Ling, and would have been able to live for at least forty years.<br/><br/>However, upon weighing his options, he felt that he could learn much more at the Martial Academy.<br/><br/>Isolating oneself could limit one’s achievements. The vast arsenal of the Martial Academy was much more useful to him.<br/><br/>Not to mention, this time there was an unexpected surprise of receiving guidance from a Saber Saint for a whole year. He was able to learn three more styles of the “God Destroyer Nine Styles”<br/><br/>Later, he spent a year at one of the six major factions, the Literati Academy.<br/><br/>It wasn’t a complete loss.<br/><br/>That’s what Gu Yang told himself to reassure him.<br/><br/>As for the Chief disciple of the Literati Academy, Ye Lingbo, she is ranked third in the Genius List and is the youngest of the current nine geniuses, only sixteen years old.<br/><br/>At the same time, she is the third on the Beauty List, and is known as the Fairy Descended from Heaven.<br/><br/>According to Xu Ruomei, there are rumors that this girl might be the reincarnation of an ancient female celestial being, possessing the figure of a celestial.<br/><br/>It’s no wonder that the Empress wanted to use him to get rid of this world-class genius, the Fairy Descended from Heaven.<br/><br/>After Gu Yang’s cultivation level had reached Second Grade, he qualified to be involved in these high-level struggles. Unfortunately, in the eyes of these major figures, he was still just a pawn.<br/><br/>[The simulation is over. You can keep one of the following:] [One, the martial arts realm achieved at the age of thirty.] [Two, the martial arts experience acquired by the age of thirty.]<br/><br/>[Three, the life wisdom gained by the age of thirty.]<br/><br/>“I choose Two.”<br/><br/>As soon as Gu Yang’s voice fell, his mind was flooded with all sorts of insights and experiences about martial arts, immersing him deeply inside them, not able to extract himself.<br/><br/>Gu Yang spent half a day before letting out a long sigh, his eyes exuding a hint of joy.<br/><br/>Feeling his strength taking a leap instantly was wonderful.<br/><br/>The biggest gain of course was guidance from the Saber Saint.<br/><br/>Those referred to as Saints were surely strong individuals within the Realm of Divine Power. That year’s time allowed his saber technique to level up, understanding three more styles from the “God Destroyer Nine Styles”.<br/><br/>“It’s time to save her.”<br/><br/>Gu Yang stood up, holding the Phoenix Feather Knife in his hand, and left.<br/><br/>Hundreds of miles away, two horse-drawn carriages were bumping along on the road. There were also seven or eight knights surrounding the carriages.<br/><br/>From the roadside, anyone with discerning eyes could recognize that this was the Liu family’s convoy from Ba County.<br/><br/>The Liu family from Ba County was originally just a county-level noble family. However, ever since it had given rise to the genius Liu Zhe, its influence had grown steadily and even pursued the Lin Family in power.<br/><br/>For keen observers, it was clear that the Lin Family, as the overlord of<br/><br/>Jiangzhou, was no longer able to suppress the Liu family. By the time Liu Zhe grows up, whether Jiangzhou will still be under the surname Lin remained to be seen.<br/><br/>Of course, the Lin Family was not to be trifled with. The main family was one of the Nine Surnames, and who would emerge victorious was still undecided.<br/><br/>Given the luxury of these two carriages, the people sitting inside them must be important figures from the Liu family.<br/><br/>They were not wrong. Sitting in one of the carriages was indeed the genius Liu Zhe from the Liu family.<br/><br/>Liu Zhe, with his handsome features and extraordinary aura, was dressed in silk and brocade like a nobleman.<br/><br/>With a slight humph, he spoke somewhat reluctantly, “Uncle is so muddled!”<br/><br/>Sitting across from him was an elder. Upon hearing his words, he lowered his head, not daring to retort.<br/><br/>The uncle Liu Zhe mentioned was the head of the Liu family.<br/><br/>And the elder was the major steward of the Liu family, he naturally dared not discuss the head of the family.<br/><br/>“There are many ways to make Su Qingzhen willingly serve the fifth prince, but uncle chose the most stupid one. The situation has become irreparable.”<br/><br/>Liu Zhe was quite unhappy with this matter.<br/><br/>Previously, he had been devoted to his martial arts training under his master’s guidance in the Eastern Sea. It wasn’t till last month that he received permission to venture out and travel around.<br/><br/>His first stop was his home, the Liu family. When he arrived home, he heard about Su Qingzhen’s situation.<br/><br/>By his judgement, coercing Su Qingzhen had failed, and as a result they murdered her entire family. This was simply beyond comprehension.<br/><br/>Did they actually believe that in this world, having a strong family background granted them the freedom to do anything they wanted?<br/><br/>There will always be someone stronger and with a bigger background.<br/><br/>Not understanding such simple reasoning, how could they dream of challenging the Lin Family? Are they just not afraid of dying fast enough?<br/><br/>Liu Zhe continued, “Now, Su Qingzhen is connected to Gu Yang, who is seventh on the Hidden Dragon List. This man appeared mysteriously, entering the list directly at the seventh spot, he is definitely not simple. The only solution now is to use Su Qingzhen as bait, lure him here, kill him to remove future threats.”<br/><br/>“After eliminating this man, send Xu Ruomei away. Then also kill Su Qingzhen. ”<br/><br/>Liu Zhe’s tone was very calm as if he were speaking about something very ordinary.<br/><br/>The steward’s lips moved, he seemed about to say something, but was silenced by Liu Zhe’s cold gaze. A chill ran through his body, and he found himself unable to speak..\t\t\t\t\t\t</div>", "images": {}, "success": true}