{"id": 85, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297866.html", "title": "Chapter 85 - Chapter 85: 085 Not Worth Worrying About", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 85 - Chapter 85: 085 Not Worth Worrying About</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 85: 085 Not worth worrying about<br/><br/>Translator: 549690339<br/><br/>“So formidable.”<br/><br/>Wu Xingyun, who was watching the fighters from the sidelines, was still in awe from the breathtaking confrontation between Gu Yang and Liu Zhe. He was carefully analyzing Gu Yang’s Saber Technique and Liu Zhe’s Sword Technique.<br/><br/>At this moment, he realized just how vast the gap was between him and the two of them.<br/><br/>They were all from the Second Grade, yet the strength they wielded was on completely different levels.<br/><br/>Though he had been defeated by Chu Xiyue, he felt confident that he would surpass her given another chance.<br/><br/>However, Gu Yang’s saber and Liu Zhe’s sword… even after five years, he was doubtful he could withstand them.<br/><br/>Wu Xingyun murmurs to himself, “Is this the strength of the prodigies of this<br/><br/>era?”<br/><br/>He remembered when he had first topped the Hidden Dragon List and dreamt of rivaling those on the Prodigy List.<br/><br/>So, he had asked the dean how he compared to those prodigies on the list.<br/><br/>The dean had asked him two questions in response.<br/><br/>The first one was, did he cultivate an unrivaled technique?<br/><br/>He had shaken his head.<br/><br/>Second question, did he master an unrivaled sword technique?<br/><br/>He had shaken his head again.<br/><br/>The dean had elaborated that setting the Prodigious List members’ age limit to twenty for a reason.<br/><br/>Those who practised ordinary techniques could not reach the Second Grade before the age of twenty, regardless of their innate talent. Their bodies hadn’t fully matured yet and hence wouldn’t be able to withstand the power of the Second Grade.<br/><br/>To achieve the Second Grade before twenty, you must practice an unrivaled technique.<br/><br/>These unrivaled techniques, all passed down since ancient times, were aimed at the Celestial Being realm. Each of them was remarkable, constantly transforming the physique during cultivation.<br/><br/>It was for this reason that human physical limitations could be overcome, and the Second Grade could be achieved before the age of twenty.<br/><br/>These individuals were undeniably the pride of the Heavens. The mysteriousness of their techniques and the strength of their power were incomparable to others in the same realm.<br/><br/>In his martial arts academy, there were similarly esoteric methods inherited.<br/><br/>They were left behind by the founding emperor of Great Zhou, totaling two. But in the more than four hundred years since then, no one from the academy has made it into the Prodigy List.<br/><br/>This showed just how difficult it was to cultivate an unrivaled skill to the Second Grade realm before the age of twenty.<br/><br/>Typically, only those with extraordinarily compatible physique for the technique and top-notch talent could become prodigies.<br/><br/>Unfortunately, Wu Xingyun was born in an era overflowing with prodigies.<br/><br/>Nine prodigies of his time, an extraordinarily rare occurrence.<br/><br/>Typically, only two or three prodigies would grace a generation on the list.<br/><br/>At times, only one.<br/><br/>And sometimes, not even one.<br/><br/>Having nine spots on the Prodigious List only occurred once before, five hundred years ago at the end of the previous era, during the tumultuous period of great warfare.<br/><br/>“Prodigies, so what!”<br/><br/>Having understood the gap between himself and the prodigious Liu Zhe, Wu Xingyun’s heart surged with defiance instead.<br/><br/>He shifted his hot gaze towards Gu Yang not far away.<br/><br/>Gu Yang, too, had come from the Hidden Dragon List and was capable of defeating a pride of the heavens like Liu Zhe.<br/><br/>If he could do it, why couldn’t he?<br/><br/>“A sword breaks through a thousand waves!”<br/><br/>“God- Slaying Knife! ”<br/><br/>Chu Xiyue was equally shocked by the spectacle, stirring up a hint of unwillingness within her.<br/><br/>Her Chu Family, too, had martial skills that could rival both of these, the Bright Moon Sabre and Shadow Moon Sword Technique.<br/><br/>Yet, her mother had never taught her, claiming that she lacked the power to learn them.<br/><br/>If she could master either skill, she might be able to contest with the two men.<br/><br/>Determined, Chu Xiyue communicated telepathically, “Auntie, this time when we go back, I want to request mother to teach me the Shadow Moon Sword Technique.”<br/><br/>To her surprise, her aunt sighed in response, “Xiyue, it’s not that your mother is unwilling to teach you, but she can’t. The Bright Moon Sabre has been lost and our ancestor is in seclusion. Even if you want to learn, there’s no way to start.”<br/><br/>Chu Xiyue was taken aback.<br/><br/>She knew of the heirloom Bright Moon Sabre being seized by the Qin family.<br/><br/>During her challenge to Qin Shang, she was ruthless, purely to vent this anger.<br/><br/>Who would’ve guessed that after the loss of Bright Moon Sabre, the Chu family’s strongest sabre and sword techniques’ lineage became disjointed. Only after their ancestor comes out of seclusion could they continue teaching.<br/><br/>She finally understood why her mother didn’t forcefully reject the Qin family’s proposal for marriage.<br/><br/>Because, the Qin family’s gift for the marriage bid was none other than the Bright Moon Sabre.<br/><br/>This sabre was vital to the Chu family.<br/><br/>With this realization, her mind was in turmoil.<br/><br/>After crying for a while, Su Qingzhen finally stopped. She stood up, facing the direction of Ba County, knelt down and bowed a few times as a tribute to the dozens of spirits of the Su family in the heavens.<br/><br/>After getting up, she walked over to Gu Yang’s side and said, “We can go now.”<br/><br/>Gu Yang could clearly sense that she had changed somewhat. It seems that after personally slaying an enemy, some of the hatred deep in her heart had been dispersed.<br/><br/>He said, “Now is not the time to deal with the Liu family. That woman is very formidable.”<br/><br/>Killing one member of the Liu family would suffice for now. Were he to storm into the Liu family and slaughter all its members, Liu Zhe might go crazy. If that woman named Lan Shu intervened, the consequences would be unimaginable.<br/><br/>Vengeance is not to be rushed.<br/><br/>Su Qingzhen nodded and softly said, “I’ll listen to you.”<br/><br/>Gu Yang let her climb onto the carriage first, then turned to Chu Xiyue and Wu Xingyun and said, “Miss Chu, Brother Wu, thank you for lending me your aid. Where are you two headed next? If you don’t mind, would you like to travel together? I have much to learn from both of you.”<br/><br/>Wu Xingyun immediately laughed, “I’ve been awaiting this opportunity.”<br/><br/>Chu Xiyue also nodded in agreement.<br/><br/>As evening approached, two figures coolly drifted in.<br/><br/>One unremarkable middle-aged man looked at the beheaded Liu Cheng with an extremely serious expression, “Even Liu Zhe is not his match. That lad, if he isn’t taken care of promptly, will become a serious threat to the Lin family in the future. Second Elder, this task will require your personal intervention.”<br/><br/>Next to him was a poised middle-aged man in white. With three wisps of a beard hanging from his chin, he exuded an extraordinarily impressive aura. He contemptuously sneered, “Just a Second Grade practitioner. Hardly a cause for concern. ”<br/><br/>Both of these men were important members of the Lin Family.<br/><br/>The first one was the master of Listening Wind Hall, primarily responsible for intelligence work.<br/><br/>The latter was the Second Elder of the Lin family, a First Rank practitioner, he held a lofty status in the Lin family.<br/><br/>This time, Lin Zihua, the oldest son of the Lin family, had specifically called him out, which demonstrated just how strongly he desired to kill Gu Yang. Lin Zihua was very clear that as soon as he had sent MO Yu to kill Gu Yang, he<br/><br/>and Gu Yang became sworn enemies.<br/><br/>Gu Yang had practiced the “God Destroyer Nine Styles”.<br/><br/>The Wu family was known for avenging every slight and grudge. Anyone who offended a member of the Wu family was pursued relentlessly, as relentless as a rabid dog.<br/><br/>This disposition of members of the Wu family had a lot to do with the techniques they cultivated.<br/><br/>Since Gu Yang has practiced the Wu Family’s knife technique, there’s the risk he might act like previous members of the Wu family.<br/><br/>Lin Zihua didn’t want to take that risk and decided it would be simpler to just have Gu Yang killed.<br/><br/>“You can return home. Wait for the good news from me. Within three days, I will take his life.” Before the Second Elder’s words even fell, he disappeared from the scene, following the traces of the carriage.<br/><br/>The Master of the Listening Wind Hall wanted to say something, but it was already too late.<br/><br/>PS: It’s Monday, requesting monthly votes..\t\t\t\t\t\t</div>", "images": {}, "success": true}