{"id": 86, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297868.html", "title": "Chapter 86 - Chapter 86: Is She Very Rich?", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 86 - Chapter 86: Is She Very Rich?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 86: Is she very rich?<br/><br/>Translator: 549690339<br/><br/>Lin Liang, with an ancient longsword on his back, dressed in white, stepped on tree branches. He strode at a distance of more than ten meters as if he were walking on air, making him look like an Immortal.<br/><br/>From afar, he saw a carriage on the official road ahead, the cart bore the emblem of the Liu family. It must be undoubtedly the target of this trip.<br/><br/>A faint smile surfaced on his face, “It doesn’t seem like I have to make much effort. ”<br/><br/>It had been many years since he last took action. People might have forgotten that there is a Shadowless Sword in the Lin family.<br/><br/>Shadowless Sword, that’s what he is known as.<br/><br/>After stepping into the First Rank realm, he then received this elegant name.<br/><br/>All these years, he has been sitting in his family stronghold, rarely taking action.<br/><br/>It had been a full twenty years, and this was the first time he had taken a task.<br/><br/>The person he was supposed to kill was just someone who had just broken through the Second Grade.<br/><br/>But the target’s another identity made him more interested.<br/><br/>Number one on the Hidden Dragon List!<br/><br/>The thought of killing the number one on the Hidden Dragon List with his own hands was quite exciting.<br/><br/>As the carriage came into view, Lin Liang was about to leap over to it.<br/><br/>“Get lost!”<br/><br/>Suddenly, a voice exploded in his ears, nearly scattering the True Essence inside his body. His feet lost their footing, his body fell, and he stumbled solidly onto the ground.<br/><br/>A formidable First Rank expert embarrassingly fell flat on his face like a dog eating dirt.<br/><br/>Lin Liang’s body bounced up in an instant. With a whoosh, he turned and fled at a speed several times faster than before.<br/><br/>At the front of the carriage, Gu Yang and his group were riding their horses and chatting enthusiastically.<br/><br/>Suddenly, Gu Yang turned his head and looked back in the direction where Lin Liang had fallen.<br/><br/>Naturally, Chu Xiyue and the others also heard the commotion, but they were not interested in those irrelevant matters and continued the conversation, “Brother Gu’s words just now truly enlightened me.”<br/><br/>Wu Xingyun also sighed, “I couldn’t imagine that Brother Gu also has such an achievement in Sword Techniques.”<br/><br/>“Just a bit.”<br/><br/>Gu Yang humbly said.<br/><br/>Even though they were of the same Second Grade realm, in terms of martial arts attainment, he was far superior to the two individuals in front of him, it was an accumulation of years.<br/><br/>The problems that Chu Xiyue and Wu Xingyun had encountered before, he had also encountered them. With a little guidance, he was able to solve their doubts.<br/><br/>This was a way of reciprocating their kindness.<br/><br/>If Chu Xiyue hadn’t been following him, he wouldn’t have been as relaxed as he was now. He would’ve been chased around by that First Rank from the Lin family.<br/><br/>Half a month later, Gu Yang and his group changed their route to water travel, hired a boat, and drifted downstream.<br/><br/>Since his arrival into this world, Gu Yang rarely spent such a leisurely half month. He took his time, discussing martial arts with Chu Xiyue and Wu Xingyun during the day, and appreciated the scenery along the way.<br/><br/>At night, he would practice with Su Qingzhen.<br/><br/>Surrounded by three stunning beauties, life was quite pleasant.<br/><br/>Unfortunately, this peaceful life was soon disrupted.<br/><br/>A few days later, at night.<br/><br/>Gu Yang was practicing with Su Qingzhen in the room.<br/><br/>The two sat on the bed, their palms touching. After his True Essence rotated in Su Qingzhen’s body, it returned to his body.<br/><br/>Such a practice yielded a very weak result for him.<br/><br/>After reaching the Second Grade, his True Essence wanted to improve, but it required years to do so.<br/><br/>But for Su Qingzhen, the benefits were enormous.<br/><br/>Suddenly, her True Qi boiled up inside her body, breaking through several meridians one after another. She had astonishingly broken through to the sixth-grade realm.<br/><br/>Gu Yang withdrew his hands, looked at her, and felt an indescribable envy.<br/><br/>Her aptitude was quite unbelievable.<br/><br/>He calculated it. From the time she started cultivating until now, it had only been a little over a month. She went from being an ordinary person to a sixth-grade cultivator.<br/><br/>This speed was simply horrifying.<br/><br/>Of course, he has contributed a lot to her rapid progress.<br/><br/>The higher Gu Yang’s realm, the greater the benefits Su Qingzhen accrues when they cultivate together.<br/><br/>Just as he was thinking about this, he suddenly heard shouts of killing from not far away. Feeling somewhat puzzled, he left the room and came onto the deck.<br/><br/>They had rented a large houseboat, which had a lot of space for them to live in.<br/><br/>Wu Xingyun had come down earlier and was looking at the river in the distance. There was a boat on fire, and the shouts of killing were coming from that direction.<br/><br/>Gu Yang had seen that boat during the day. It seemed to be a merchant ship. To his surprise, the noise on the other side was clearly indicating that three Second Grade fighters were battling.<br/><br/>It was strange. On a merchant ship, three second-grade individuals were gathered.<br/><br/>He asked, “Brother Wu, is this a robbery or a revenge killing?”<br/><br/>Wu Xingyun’s expression was somewhat solemn as he whispered, “Two of them are high-ranked military officials.”<br/><br/>Military?<br/><br/>Gu Yang became more curious.<br/><br/>In the Great Zhou, the military is a unique force and rarely gets involved in disputes in the martial arts world. Whoever had provoked the military officials to take action, the person on that ship must certainly not be of a simple identity.<br/><br/>Of course, he had no intention of meddling in other people’s business.<br/><br/>And neither did Wu Xingyun.<br/><br/>Most of the students graduating from the Martial Academy join the military. Not forgetting his father, the King of Jinghai, is a bigwig in the military.<br/><br/>At this time, Chu Xiyue also came out and looked at the burning ship and said, “The people on that ship could likely be the young mistress from the Qian family.”<br/><br/>The expression on Wu Xingyun’s face changed, “You mean, the young legitimate daughter of the Qian family?”<br/><br/>The Qian family is not one of the nine prominent families, but in terms of reputation, it is in no way less than these nine families.<br/><br/>This is the richest family in the world, saying that their wealth could rival a country wouldn’t be an exaggeration.<br/><br/>“The Qian family have had a small population for several generations. In this generation, only one girl is left in the direct line of descent. Two months ago, the wealthy man of the Qian family passed away. Unexpectedly, someone sprang up from somewhere claiming to be an illegitimate son of the Qian family, even securing the backing of many people, and started taking over the<br/><br/>Four Sea Bank.”<br/><br/>Chu Xiyue’s voice in the river wind was somewhat cold.<br/><br/>“The young mistress from the Qian family has been in Jingzhou for several years. Upon hearing the bad news, she naturally wanted to return to Zhongzhou to take back the Four Sea Bank.”<br/><br/>Gu Yang suddenly said, “I heard that the true master of Four Sea Bank was the imperial household, and the Qian family merely managed it on their behalf. Is this true?”<br/><br/>Wu Xingyun wryly smiled, “That’s why this matter necessarily involves the power struggle within the royal family. Apart from the imperial family, who else could mobilise high-ranking military officials?”<br/><br/>Gu Yang asked again. “Why does this Miss Qian only have second-grade martial artists as her guards? Doesn’t the Qian family have first-grade experts?”<br/><br/>Wu Xingyun said, “It is not strange. First-grade experts are too conspicuous. If she was accompanied by first-grade experts, it would be equivalent to announcing to everyone that she is returning to Zhongzhou to dispute the control of Four Sea Bank.”<br/><br/>“She probably wanted to be discreet, but her whereabouts still got leaked…”<br/><br/>Chu Xiyue sighed, “Four Sea Bank is the purse of the imperial household. The man behind the scenes, who knows for how long he has been plotting, will he tolerate her messing the situation up?”<br/><br/>This matter was too deep.<br/><br/>Gu Yang asked one last question, “Is this Miss Qian very rich?”<br/><br/>Wu Xingyun said, “It’s more than just rich. This Miss Qian has built a fleet of ships in Jingzhou over the years, trading across the ocea. One trip could yield hundreds of thousands in profit.”<br/><br/>Gu Yang suddenly jumped and said, “I’ll be back soon.”<br/><br/>Chu Xiyue and the others were stunned as they watched him fly towards the ship.. They had the same thought, he can’t be serious, can he?\t\t\t\t\t\t</div>", "images": {}, "success": true}