{"id": 88, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297872.html", "title": "Chapter 88 - Chapter 88: 088 Successful", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 88 - Chapter 88: 088 Successful</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 88: 088 Successful<br/><br/>Translator: 549690339<br/><br/>“Who are these two?”<br/><br/>Gu Yang looked at the two guards next to Qian Xiyun, he was more curious about them.<br/><br/>Qian Xiyun said, “They are both my companions.”<br/><br/>The woman stained with blood saluted, “Tianxin Martial Academy, Cheng Xue.” As expected, she was a disciple of Tianxin Martial Arts Hall.<br/><br/>Gu Yang predicted this when he saw her using the Saber Technique earlier. He smiled and said, “So you are indeed Master Cheng’s student.”<br/><br/>Although he had never met Cheng Tianxin in reality, he had interacted with him several times in the simulation and was very familiar with him.<br/><br/>To his surprise, Cheng Tianxin had already trained a Second Grade student.<br/><br/>Thinking this way, if Cheng Xue would have died here according to the original historical course, leading to Cheng Tianxin’s death in a few years, the Tianxin Martial Hall would soon disintegrate due to lack of leadership.<br/><br/>Thinking of this, Gu Yang was in a great mood.<br/><br/>In many simulations, he gained many benefits from the Tianxin Martial Hall, and Cheng Tianxin was also quite kind to him. Saving Cheng Xue can be regarded as a return to Tianxin Martial hall.<br/><br/>Cheng Xue asked, “Master Gu, do you know my adoptive father?”<br/><br/>Gu Yang said, “We have never met, but we have had a deep spiritual connection. ”<br/><br/>Cheng Xue detected the kindness in his tone, and her originally serious expression softened a bit.<br/><br/>Gu Yang looked at the other one in the black robe, finally seeing her face clearly. She was obviously of a different race, with an unusually white skin, blue pupils, a high nose, from under the hat, a strand of golden hair was exposed.<br/><br/>Unexpectedly, she is a white person.<br/><br/>Seeing a blonde, blue-eyed white person in this world was indeed a rare occurrence.<br/><br/>She spoke in broken Great Zhou language, “My name is… Lily.”<br/><br/>Qian Xiyun next to her explained, “Lily comes from across the ocean, from the distant Xiti Continent.”<br/><br/>Gu Yang couldn’t help but say, “Was she using magic just now?”<br/><br/>Lily seemed to understand his words, her face changed slightly, and she corrected, “I am a magician, what I use is legitimate magic.”<br/><br/>Gu Yang suddenly felt that the map of this world might be much larger than he had imagined. The power system was not limited to just martial arts.<br/><br/>At this moment, the painting boat was approaching and was ten meters away.<br/><br/>“Let’s go.”<br/><br/>Gu Yang returned to the painting boat with the three of them and settled them in an empty room.<br/><br/>“Sorry, I brought people to the boat without your consent.”<br/><br/>Gu Yang returned to the deck, expressing his apologies to Chu Xiyue and Wu<br/><br/>Xingyun.<br/><br/>Chu Xiyue didn’t mind, she said, “Brother Gu, you have your reasons.”<br/><br/>She was not the type to willingly take on trouble, but that did not mean she was afraid of trouble.<br/><br/>The relationship between the nine households and the royal family was very subtle, if given a chance, any family would be more than happy to take a stand against the royal family.<br/><br/>The same was true the other way around.<br/><br/>Wu Xingyun joked, “Brother Gu, are you interested in Miss Qian? I see that Miss Qian is dignified and generous, indeed a good match.”<br/><br/>A warmth filled Gu Yang’s heart, these two were truly understanding, truly good people to make friends with.<br/><br/>Wu Xingyun’s words, however, stirred something in his heart. If he were to become a son-in-law of the Qian family, would he not have to worry about money in the future?<br/><br/>Seeing that he did not refute, Chu Xiyue and Wu Xingyun were both surprised. They wanted to advise him, but in the end they said nothing.<br/><br/>The Qian family was too involved.<br/><br/>The god of wealth from the Qian family couldn’t hold on to his direct lineage in his own lifetime. They all died mysteriously and eventually only Qian Xiyun, a woman, was left.<br/><br/>Later, she managed to save the only remaining bloodline by sending the only granddaughter to Jingzhou thousands of miles away.<br/><br/>Now, the god of wealth is dead, and Qian Xiyun wants to fight for the Four Sea Bank in Zhongzhou city. This is no different from courting death.<br/><br/>Even a Second Grade like Gu Yang can’t protect her, let alone the Divine Power Realm.<br/><br/>The Qian family is not without a Divine Power Realm.<br/><br/>Others are avoiding such whirlpools out of fear.<br/><br/>If Gu Yang is determined, the end will not be good.<br/><br/>It was late at night when Gu Yang returned to his room and finally had the opportunity to check the results of the simulation.<br/><br/>“…You are traveling with Chu Xiyue and others, taking a boat on Luo River, you encounter Qian Xiyun’s boat being attacked, you save her, she writes a promissory note for three million teals. You agree to escort her to Zhongzhou.”<br/><br/>“Several days later, you take Qian Xiyun and Lily to the shore. Along the way, you travel during the night and rest during the day. After half a month, you finally arrive in Zhongzhou.”<br/><br/>“At the gate of Zhongzhou city, you were attacked by a First Rank powerful person. You manage to block three moves before you were overwhelmed and trying to escape, a First Rank powerful person from the Qian family arrives in time and repels the opponent.”<br/><br/>“Later, Lily, the magician from another continent, mistakenly identifies you as a saint and insists on following you.”<br/><br/>“After Qian Xiyun safely arrives at her mansion, she fulfills her promise and hands you a seal, along with a transfer contract. She sells a branch in Jingzhou and more than a dozen ships worth three million teals.”<br/><br/>“Later, you leave Zhongzhou with Lily and return to Luo River to meet up with<br/><br/>Chu Xiyue and others. Then, you change your course and head to Jingzhou.”<br/><br/>“A month later, you arrive at Jingzhou. After two months of operation, you auction off the branch and earn three million five hundred thousand teals.”<br/><br/>“Wu Xingyun and Jinghai King reconcile. You also become a guest of the royal household.”<br/><br/>“Ten months later, Chu Xiyue says goodbye to you and leaves.”<br/><br/>“You stay in Jingzhou, give Jinghai king some business advice, and the royal family reaps great benefits. Jinghai King takes you seriously, knows your dedication to martial arts, and introduces you to an old man. Under his guidance, your Saber Technique improves.”<br/><br/>“Eight years later, Xi Tianyi, who was second in the Divine Power List, challenges Jinghai King. After a battle, both of them enter the Divine Power Realm. Suddenly, a mysterious Divine Power Realm expert appears and kills them with overwhelming strength.”<br/><br/>“Wu Xingyun inherits the throne of Jinghai King, a general under his command rebels, and you are trapped in the army, unable to break through. Eventually, you die of exhaustion at the age of thirty-one.”<br/><br/>After reading it, Gu Yang knew what he was up against.<br/><br/>At least, the trip to escort Qian Xiyun was safe. In the end, he successfully received three million five hundred thousand teals, fifty thousand more than what she promised.<br/><br/>Although he went through some twists and turns.<br/><br/>Moreover, he also facilitated the reconciliation between Wu Xingyun and his father Jinghai King, gained the attention of this number one powerful person in the Divine Power List, received the protection of Jinghai king’s mansion, and successfully survived for eight years.<br/><br/>This Wu Xingyun was indeed his lucky charm. “The simulation is over, you can keep one of the following items.”<br/><br/>“One, martial arts realm at the age of thirty-one.” “Two, martial arts experience at the age of thirty-one.”<br/><br/>“Three, life wisdom at the age of thirty-one.”<br/><br/>Gu Yang thought about it carefully, and finally chose the second.<br/><br/>At this time, battle experience is more important.<br/><br/>PS: This is the first time I finished the second chapter so early, celebrations, and request for monthly votes..\t\t\t\t\t\t</div>", "images": {}, "success": true}