{"id": 82, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297860.html", "title": "Chapter 82 - Chapter 82: 082 What Is Your Relationship?", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 82 - Chapter 82: 082 What Is Your Relationship?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 82: 082 What is your relationship?<br/><br/>Translator: 549690339<br/><br/>In a villa outside Ping County city, Chu Xiyue was standing in a courtyard under a phoenix tree, draped in a white cloak, looking at the distant mountains with a furrowed brow.<br/><br/>Her ever-present sword was not in her hands.<br/><br/>After a long while, a hint of confusion flashed across her eyes as she mumbled,<br/><br/>“Aunt, how do I counter that strike?”<br/><br/>Behind her stood a woman in a black cloak, who had seemingly appeared out of nowhere.<br/><br/>The woman said indifferently, “You must find the answer yourself.”<br/><br/>As she said this, she vanished into thin air.<br/><br/>Soon after, the sound of a breaking wind echoed through, and a man landed in the courtyard, standing not far off, and said with a bow, “Miss Chu, I apologize for my intrusion.”<br/><br/>“You?”<br/><br/>With a sharp glance, Chu Xiyue instinctively reached for her sword but found nothing.<br/><br/>It was then that she realized she hadn’t brought her sword with her today.<br/><br/>The man was none other than Gu Yang, who had dealt her a severe blow a few days prior.<br/><br/>Over the past few days, while nursing her wounds, she pondered how she might counter that strike.<br/><br/>But she was still without a clue.<br/><br/>Now that this man suddenly appeared before her, she could not help but reveal her hostility, “What do you want?”<br/><br/>Gu Yang said, “I came here to ask you a favor.”<br/><br/>“A favor?”<br/><br/>Chu Xiyue was stunned, she never expected him to say something like that.<br/><br/>A few days ago, he had brutally injured her without rhyme or reason. Despite such grudge, he came to her and asked for her help.<br/><br/>Instinctively she asked, “What favor?”<br/><br/>Gu Yang said, “Some of my friends have been held captive by Liu Zhe from the Liu family. I am unable to deal with this situation by myself, so I need your help. ”<br/><br/>In the end, he chose to ask Chu Xiyue for assistance.<br/><br/>With his current strength, he didn’t need to fear Liu Zhe, the unknown Second<br/><br/>Grade.<br/><br/>However, he didn’t want to complicate matters. During the previous simulation, Su Qingzhen and the others were successfully rescued with the help of Chu Xiyue and Wu Xingyun.<br/><br/>So, he decided to follow the same path as the simulation.<br/><br/>Otherwise, going in alone might trigger unpredictable variables.<br/><br/>He had fallen into such traps more than once before, and this time he was determined to learn his lesson.<br/><br/>After all, the safety of Su Qingzhen and the others was of utmost importance.<br/><br/>Chu Xiyue had a strange feeling.<br/><br/>If someone she had defeated came to ask her for help, she would have ignored them outright.<br/><br/>However, the man before her had recently dealt her, her first-ever defeat. His decision to reach out to her was a form of recognition.<br/><br/>She agreed without a second thought, “Alright!”<br/><br/>“How can I miss such an occasion.”<br/><br/>At this point, a bright voice came from the doorway, it was Wu Xingyun. He had come to find Chu Xiyue and had overheard their conversation, thus he volunteered himself.<br/><br/>As for whether assisting Gu Yang would offend Liu Zhe, neither of them cared.<br/><br/>These proud talents always belittled the Hidden Dragon List. This was a perfect opportunity to gauge the strength of Liu Zhe.<br/><br/>Gu Yang hadn’t expected them to agree so quickly. He had prepared a lot of excuses, but they became unnecessary.<br/><br/>The two were too naive, no wonder they had become friends and traveled together in the simulation.<br/><br/>Indeed, they were trustworthy allies.<br/><br/>Next, Gu Yang set off with them.<br/><br/>In the meanwhile, the Liu family.<br/><br/>A shadow flashed past and climbed onto Liu Zhe’s carriage.<br/><br/>Immediately sensing the presence, Liu Zhe said, “Uncle three, why are you here?”<br/><br/>The man was Liu Cheng, the third-ranked in the Liu family and a Second Grade powerhouse whose strength outmatched even the family head. He bore a terrifying scar on his forehead that made him look dreadful.<br/><br/>His voice was croaky, “Your second brother is worried for you, so he sent me.”<br/><br/>Liu Zhe knew his third uncle was a man of few words. He understood that his second uncle had surely heard the rumor of Gu Yang defeating three Second<br/><br/>Grades with a single strike and had dispatched the third uncle out of concern.<br/><br/>He smiled, “Your concern is unwarranted. That Gu Yang is but a Third Ranker. Although I don’t know how he managed to unleash that shocking strike, he must have paid a hefty price. Perhaps even shaking his foundation, he wouldn’t be able to recover in a year and a half.”<br/><br/>To bring out a power far beyond oneself naturally requires a proportional sacrifice.<br/><br/>Such moves existed in the East Sea Gate too.<br/><br/>Liu Cheng nodded, keeping his silence.<br/><br/>Just then, the sudden sound of slashing and thumping human bodies echoed from outside.<br/><br/>“Who’s there?”<br/><br/>Immediately, Liu Zhe burst through the carriage’s rooftop and leapt out, only to see all his guards thrown off their horses, clearly dead.<br/><br/>He fixed his eyes on the three figures next to the adjacent carriage, his gaze deepened.<br/><br/>Although he had not met these three before, judging by the unparalleled beauty of the woman among them, he had a pretty good guess of her identity. Among the present Jiangzhou ladies of comparable elegance, the only one was Chu Xiyue.<br/><br/>The man in black standing next to her was most likely Wu Xingyun, who was always seen with Chu Xiyue.<br/><br/>As for the last man…<br/><br/>A name slipped from Liu Zhe’s mouth, “Gu Yang?”<br/><br/>The man spoke, “It has been said that the Liu family’s prodigy is extraordinarily clever – a well-deserved reputation indeed.”<br/><br/>A sense of dread hung over Liu Zhe; he could have never thought that these three would team up together.<br/><br/>He didn’t mind Gu Yang alone, or even Wu Xingyun added to the mix.<br/><br/>But Chu Xiyue was going to be the future head of the Chu family, one of the nine great families.<br/><br/>Weren’t Gu Yang supposed to have injured these two?<br/><br/>Why were they together now?<br/><br/>Although Liu Zhe was surprised, he kept his calm, turned towards Chu Xiyue, and asked, “This must be Miss Chu, I’m afraid I do not see any cause for our confrontation, may I understand your intention?”<br/><br/>Chu Xiyue calmly responded, “I had thought of learning from your sword technique for a while now. As I was injured, I couldn’t. Today I can witness your duel with Gu Yang, my wish has been fulfilled.”<br/><br/>Liu Zhe understood that as long as he had a fair duel with Gu Yang, she wouldn’t intervene.<br/><br/>He looked at Gu Yang, cracked a smile, and said, “Brother Gu, you indeed keep illustrious company. You’re close to Immortal Xu from the Sword Palace and you’ve befriend Miss Chu. Yet, I’m intrigued as to your relationship with Su<br/><br/>Qingzhen? Why would you stand up for her?”<br/><br/>PS: This chapter is to make up for the lack of one yesterday..\t\t\t\t\t\t</div>", "images": {}, "success": true}