{"id": 81, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297858.html", "title": "Chapter 81 - Chapter 81: How Difficult It Is", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 81 - Chapter 81: How Difficult It Is</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 81: How Difficult It Is<br/><br/>Translator: 549690339<br/><br/>Ultimately, the Liu family’s chief steward couldn’t resist asking a question,<br/><br/>“Young Master, that Gu Yang’s history is unknown, what if he also has a Divine Power behind him .<br/><br/>Liu Zhe responded indifferently, “Then he needs to be eliminated even more. Once enmity has developed, we absolutely cannot be tied down. We must annihilate him with lei-like decisiveness. Let my mentor deal with any influence seeking revenge from behind him.”<br/><br/>“Otherwise, when he progresses to Second Grade, and even First Rank, eliminating him will become much harder. The support from the forces behind him will grow even stronger.”<br/><br/>Liu Zhe had learned this firsthand under the tutelage of the Sword Saint of the East Sea Gate.<br/><br/>He had shown exceptional talents when he was still under Third Rank, yet he hadn’t held a high position in the sect and had not even met his mentor.<br/><br/>Talent is just talent until it is actualized; until then, it is insignificant.”<br/><br/>Back then, if he had been accidentally killed, his mentor would not have waged war for his sake, let alone taken personal action for his revenge.”<br/><br/>Nevertheless, his rise was like a bamboo shoot after a rainstorm, reaching Third Rank, then Second Grade. His position thus improved, and he received personal guidance from his mentor, becoming the disciple given the most attention in the sect.<br/><br/>Now, he has officially been named the successor by his mentor.<br/><br/>Even if he offended someone of Divine Power, his mentor would shield him.<br/><br/>Gu Yang’s master might think similarly, even though he is only at Third Rank. If he were killed, even if the force behind him were angered, they would have to consider whether it’s worth catching a tiger by the tail with the East Sea<br/><br/>Sword Saint for the sake of a deceased disciple.”<br/><br/>However, in the future, if this man achieves Second Grade or even First Rank and gains the attention of the forces behind him, eliminating him then will not be so easy.”<br/><br/>Just as he was contemplating this, a soft voice came from outside the carriage, “Junior Brother, the guy you’ve provoked, isn’t that simple.”<br/><br/>“Second Sister?”<br/><br/>Hearing the voice, Liu Zhe became more respectful, asking, “Why are you here?”<br/><br/>The soft voice responded, “If the old man hadn’t asked me to check on you, I wouldn’t have bothered.”<br/><br/>The ‘old man’ she was referring to was naturally their mentor.”<br/><br/>Liu Zhe did not react to her disrespectful address.<br/><br/>Even in the presence of her mentor, this Second Sister would call him ‘old man’, and he would tolerate it.”<br/><br/>It just showed how special her status was in his eyes.<br/><br/>At the same time, the Second Sister was incredibly powerful, so he dared not show any disrespect towards her.”<br/><br/>He asked, “Sister, do you know Gu Yang’s background?”<br/><br/>The Second Sister was primarily responsible for external intelligence. Though the members of their East Sea Gate rarely left their territory, they still needed to know what was happening in the outside world. They couldn’t play deaf and blind.”<br/><br/>“No. But I’ve heard about another matter. You probably got the news from the Lin Family, that’s how you knew where these people were hiding, right?”<br/><br/>The soft voice outside said, “Did the Lin Family tell you that a few days ago, they sent a Second Grade to arrest this man?” Liu Zhe shook his head and said, “No.”<br/><br/>“Can you guess the result?”<br/><br/>“Please tell me, Sister.”<br/><br/>The voice outside became a little more severe, and said,”That day, by coincidence, Chu Xiyue and Wu Xingyun were also in Pingjun City and arrived at Gu Yang’s residence at the same time as the Second Grade from the Lin Family. Subsequently, this man’s Blade Intent locked onto the three of them, and with one slash, two of the three Second Grades were seriously injured and one was killed.”<br/><br/>Hearing this, Liu Zhe’s eyes narrowed.<br/><br/>He naturally knew Chu Xiyue and Wu Xingyun, especially Chu Xiyue, who had once challenged the eighth-placed Chen Heng and it was said that their battle had ended in a draw.”<br/><br/>This woman’s strength was definitely not weak.”<br/><br/>Gu Yang, with only a Third Rank cultivation level, had used a single slash to defeat three Second Grades. This record was shocking.<br/><br/>But if the information came from his Second Sister, it surely couldn’t be false.”<br/><br/>The Second Sister outside sighed, “Tsk, defeating three Second Grades with a single slash, not even I have such capability. If Gu Yang can still summon such a slash, our junior brother might have to fall on the spot.”<br/><br/>“Thank you, Sister, for the warning.”<br/><br/>Liu Zhe sincerely thanked her.”<br/><br/>Though ordinarily, Gu Yang would certainly pay a hefty price for releasing such a powerful slash, it is always better to be cautious.”<br/><br/>Who knew what other cards this man held?”<br/><br/>In Liu Zhe’s mind, the threat level of this man had been raised to the highest.<br/><br/>“A simple ‘thank you’ will do?”<br/><br/>“I owe Second Sister a favor.’<br/><br/>“That’s more like it.”<br/><br/>After finishing, the soft voice outside disappeared.<br/><br/>Meanwhile, inside another carriage, Su Qingzhen, Xu Ruomei, and the little servant Zhi Xing sat, their freedom not restricted.”<br/><br/>The carriage was shaking gently, the three women looked different as they were lost in their own thoughts.<br/><br/>Suddenly, Su Qingzhen quietly said, “Thank you.”<br/><br/>This was the first time she had taken the initiative to speak to Xu Ruomei.”<br/><br/>It was also the first exchange between them.”<br/><br/>This morning, when Liu Zhe and his men suddenly appeared, they were initially going to kill her. If not for Xu Ruomei’s intervention, she and Zhi Xing would both be dead by now.”<br/><br/>This was a life-saving kindness. No matter how much Su Qingzhen disliked the woman in front of her, she had to accept this act.”<br/><br/>However, Xu Ruomei shook her head, a hint of worry in her eyes, “Liu Zhe’s desire to kill you is too strong, I can stop him once, but I won’t be able to stop him the second time.”<br/><br/>Su Qingzhen gave a sorrowful smile, “Life and death are predestined. If I’m destined to die at the hands of the Liu family, I can’t blame anyone else.”<br/><br/>The little servant Zhi Xing, seeing the state her mistress was in, held her hand and whispered, “Young Mistress, Brother Gu will definitely come to save us.”<br/><br/>Out of the three women, she was the weakest, yet had the most faith in Gu<br/><br/>Yang.”<br/><br/>Xu Ruomei wanted to say something but decided against it. In the end, she sighed quietly, not wanting to shatter her last hope.”<br/><br/>Everyone knows about the reputation of the Sword Saint from the East Sea, but they do not know that besides the gifted Liu Zhe, in the East Sea Gate founded by him, he has two other disciples, both of First Rank.”<br/><br/>Liu Zhe was appointed successor by the East Sea Sword Saint and anytime he ventured out before reaching First Rank, a Tao protector would always accompany him.”<br/><br/>Even if Gu Yang had the strength of a Second Grade top warrior, how easy could it be for him to rescue them?”<br/><br/>The gap between the Second Grade and First Rank is a chasm that’s hard to cross.”<br/><br/>First Rank, that is the true pinnacle of the human realm.”<br/><br/>She hogesda would rather hope for Gu Yang not to come and save them.”<br/><br/>But she couldn’t say these words out loud.”<br/><br/>Su Qingzhen didn’t speak again, she just clasped her hands together and lowered her head, lost in her own thoughts.”<br/><br/>Outside the carriage, Zhang Xiao Hai was tied up and carried on a horse, walking slowly next to the carriage. He felt like his stomach was turning over, and in his mind, he cursed the ancestors of the Liu family.”<br/><br/>“Wait for the young master to come, he will tie you all up, make you all vomit up last night’s meal…\t\t\t\t\t\t</div>", "images": {}, "success": true}