{"id": 83, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297862.html", "title": "Chapter 83 - Chapter 83: 083 Bet", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 83 - Chapter 83: 083 Bet</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 83: 083 Bet<br/><br/>Translator: 549690339<br/><br/>“It’s Brother Gu!”<br/><br/>In the carriage, the maid Zhi Xing, upon hearing the commotion outside, excitedly grabbed Su Qingzhi’s hand.<br/><br/>Sure enough, Liu Zhe’s voice was cold as ice, “Gu Yang?”<br/><br/>Su Qingzhi suddenly raised her head, her eyes reddening as she clutched Zhi Xing’s hand in return.<br/><br/>Zhi Xing could feel her hand cold, devoid of warmth.<br/><br/>Xu Ruomei, who was sitting next to them, looked slightly taken aback, she hadn’t expected Gu Yang to catch up.<br/><br/>He had walked into the trap voluntarily!<br/><br/>Her heart was full of anxiety, worrying about Gu Yang’s safety.<br/><br/>Then, they heard Liu Zhe asking, “I presume this must be Miss Chu?”<br/><br/>Miss Chu?<br/><br/>The three women in the carriage realized that Gu Yang didn’t come alone there was a Miss Chu with him.<br/><br/>Chu…<br/><br/>Could it be that Chu?<br/><br/>All three women thought of Chu Xiyue, who had ranked first on the Hidden Dragon List.<br/><br/>Only someone like Miss Chu would have made Liu Zhe so defensive.<br/><br/>But, why was she with Gu Yang?<br/><br/>Under normal circumstances, there should be a conflict between the pair if they met again.<br/><br/>By the carriage, the ropes binding Zhang Xiao Hai’s hands and feet had been cut, he was massaging his wrists and ankles. He marveled at the beauty not far away, “No wonder he’s a man of noble birth, he’s always accompanied by stunning beauties wherever he goes.”<br/><br/>Just then, Liu Zhe suddenly asked, “… What’s your relationship with Su<br/><br/>Qingzhi? Why are you stepping in for her?”<br/><br/>Zhang Xiao Hai thought it was bad; this guy was up to no good, deliberately asking such a question, setting traps for the young master.<br/><br/>No matter how he answered, this question would be very disadvantageous for the young master.<br/><br/>In the carriage, both Xu Ruomei and Su Qingzhi’s expressions tightened and their hands clutched each other as they awaited Gu Yang’s reply.<br/><br/>A moment later, they heard Gu Yang answering casually, “She paid me thirty thousand taels, and I promised to protect her.”<br/><br/>Xu Ruomei was shocked, it was an answer she hadn’t anticipated. She looked at Su Qingzhi across from her, and noticed her complexion had turned pale.<br/><br/>She suddenly realized that what Gu Yang said might be the truth.<br/><br/>Everyone else, apart from the two concerned, naturally didn’t believe it.<br/><br/>Liu Zhe even took it as an insult.<br/><br/>No one would believe that Gu Yang would become an enemy of Liu Zhe for a mere thirty thousand taels.<br/><br/>Hearing Gu’s dismissive reply, Liu Zhe, who usually carried a calm demeanor, couldn’t help feeling a surge of anger. He was, after all, a proud son of heaven who had demonstrated his exceptional talent since learning martial arts and was subsequently taken in by the Sword Saint of the East Sea.<br/><br/>Later, at the age of nineteen, he ascended to Second Grade, rising through the ranks to become the disciple of the Sword Saint of the East Sea.<br/><br/>In his life, things had been smooth sailing and he had never faced any setbacks. Whenever he ventured out, everyone he met treated him with the utmost respect.<br/><br/>Nobody had ever disrespected him like this before.<br/><br/>Liu Zhe sneered, “If that’s the case, I’d be willing to pay three hundred thousand taels for her life. Gu, what do you say?”<br/><br/>Gu Yang replied, “Your Liu family is wealthy. Only offering three hundred thousand is a bit stingy. How about this, if your Liu family offers all of its assets, I might consider it.”<br/><br/>“Although my Liu family is not particularly prestigious, it’s not something just anyone can take a piece of. You’re not qualified.”<br/><br/>“How about a wager? Either way, a fight between us is inevitable. If I win, your family’s wealth is mine. If you win, you can do as you please with me.”<br/><br/>“Hahaha…”<br/><br/>Liu Zhe laughed out of anger, “Fine, let me experience your prowess then.”<br/><br/>With that, he drew his sword, a sword named the Purple Star, a gift bestowed by his master.<br/><br/>His sword radiated a dim purple light, flickering like falling stars, too dazzling to look at directly<br/><br/>With sword in hand, Liu Zhe’s aura changed instantaneously. His sword spirit was restrained yet palpable, displaying a grandmaster’s temperament.<br/><br/>Chu Xiyue, also being a sword practitioner, took the scene seriously upon seeing Liu Zhe’s threatening aura.<br/><br/>This man’s strength was definitely not inferior to Chen Heng, who was ranked eighth on the Exceptional Talent List.<br/><br/>Everyone had heard the rumors that she fought Chen Heng without a clear winner. In reality, she knew very well that Chen Heng hadn’t used all his strength, which was more like a concession.<br/><br/>The style of the Chen family had always been like this, they didn’t like offending people and always left room for face-saving.<br/><br/>In terms of strength, she was far inferior to Chen Heng.<br/><br/>Therefore, since then, she hadn’t challenged anyone on the talent list, refusing to do something humiliating.<br/><br/>Liu Zhe seemed to be no less powerful than Chen Heng. Those who made it to the talent list were indeed extraordinary.<br/><br/>If he was practicing the Wave-breaking Sword Technique of the Sword Saint of the East Sea based on his sword spirit, it would be extremely spectacular.<br/><br/>Decades ago, the Sword Saint of the East Sea made a name for himself using this technique, becoming one of the ten most famous swords in the world.<br/><br/>Chu Xiyue thought, “I wonder how he will respond.”<br/><br/>Frankly, she hadn’t completely gauged Gu Yang’s strength. His previous attack was certainly strong, but it definitely wasn’t a regular move.<br/><br/>If Gu Yang could unleash such a saber technique at will, it would overturn the theory of martial arts and his name would surely go down in history.<br/><br/>She was looking forward to seeing his real strength.<br/><br/>At that moment, Gu Yang turned to her and said, “Would Miss Chu be a witness?”<br/><br/>She nodded, “Sure.”<br/><br/>Then, Gu Yang drew a knife. The blade was pitch-black and looked quite strange.<br/><br/>He held the blade in front of him, as firm as a mountain, staring at Liu Zhe across from him, he said one word, “Please.”<br/><br/>At this moment, his cultivation level was completely exposed.<br/><br/>“Second Grade?” “Second Grade?”<br/><br/>Both Chu Xiyue and Wu Xingyun were shocked.<br/><br/>He’s Second Grade? No wonder he dared to challenge Liu Zhe!<br/><br/>“What kind of saber technique is this?”<br/><br/>Chu Xiyue noticed that Gu Yang held the saber in front of him. The simple move gave a sensation of being impregnable, which was somewhat alarming.<br/><br/>Then, she heard a voice buzzing in her ear, “It’s the Wu Family’s ‘God Destroyer Nine Styles’, the third style, catch saber… ‘<br/><br/>Before the sentence was finished, a shocking sword spirit attacked, stabbing at her forehead.<br/><br/>Good sword technique!<br/><br/>Her eyes brightened, finally witnessing the famous sword technique of the Sword Saint of the East Sea.<br/><br/>The Wave-breaking Sword Technique had only one move, “A sword breaks through a thousand waves!”<br/><br/>Although it had only one move, the technique was focused on intention, not movement. Facing different ‘waves’, the sword movements naturally changed.<br/><br/>It could be said to have one move yet contain countless moves.<br/><br/>Back then, the Sword Saint of the East Sea made a name for himself in the world with this sword, successfully earning his reputation as a Sword Saint.<br/><br/>The reputation was indeed deserved.<br/><br/>As soon as Chu Xiyue saw it, she knew she wouldn’t withstand this sword strike.<br/><br/>She studied the changes in Liu Zhe’s sword movement closely, feeling as if she was in the midst of a vast sea, on the verge of being drowned, almost lost in his sword spirit.<br/><br/>Just then, an indescribable force split the sea all around her.<br/><br/>Chu Xiyue only felt a flash of black light before her eyes, followed by a loud bang that made her ears ache.<br/><br/>When she looked again, she saw Liu Zhe spewing blood and flying backwards.<br/><br/>She was somewhat dumbstruck. Was he defeated just like that?<br/><br/>PS: There’s one more chapter coming up later..\t\t\t\t\t\t</div>", "images": {}, "success": true}