{"id": 89, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297874.html", "title": "Chapter 89 - Chapter 89: 089 Holy Messenger", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 89 - Chapter 89: 089 Holy Messenger</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 89: 089 Holy Messenger<br/><br/>Translator: 549690339<br/><br/>The night deepened.<br/><br/>Gu Yang was ready to rest when suddenly, he heard a knock on the door.<br/><br/>“Brother Gu.”<br/><br/>Recognizing the voice, it was Chu Xiyue.<br/><br/>He opened the door and saw her carrying two jugs of wine, inviting him to have a drink outside. He gladly accepted.<br/><br/>At the bow of the ship, the two leaned against the railing, drinking and chatting.<br/><br/>In the sky, the moonlight flowed like water, reflecting on the river surface, twinkling with rippling light.<br/><br/>The ship was silent, the chatty water sound adding tranquility to the scene.<br/><br/>Gu Yang looked at Chu Xiyue in front of him. The white robe she wore made her fair skin glow enchantingly against the darkness of the night, a sight to behold.<br/><br/>In such an atmosphere, he too couldn’t help but feel moved.<br/><br/>He finally knew why she was given a title that means ‘unmatched beauty’.<br/><br/>Chu Xiyue’s radiant gaze locked onto the man in front of her, she lifted her jug of wine, clinked it against his, and took a gulp, a faint blush soon appeared on her cheeks.<br/><br/>The faint scent of wine filled Gu Yang’s nose, mixed with her unique aroma, causing him to feel slightly tipsy after just one sip.<br/><br/>“Brother Gu, do you know the origins of the Qian Family?”<br/><br/>In the gentle breeze, Chu Xiyue’s whisper-like voice resonated.<br/><br/>Gu Yang sobered up a little, finally realizing her purpose for coming to him. He shook his head and replied, “I do not.”<br/><br/>“The ancestors of the Qian family were stewards of Great Zhou. That’s why they’ve managed the imperial treasury. For over four hundred years, this stewardship has been passed down through generations. They’re deeply trusted by the royal family.”<br/><br/>In other words, the Qian Family served as a stooge for the royals. In feudal terms, they were domestic servants.<br/><br/>The so-called trust is quite unreliable, especially over a span of four hundred years, trust all but disappears.<br/><br/>Gu Yang thought to himself but didn’t interrupt and quietly listened to her story.<br/><br/>“Until the time of the Qian family’s previous head, a remarkable person emerged who was acclaimed by the world as the God of Wealth. This led the Qian family’s business to unprecedented heights.”<br/><br/>“If that were all, the royal family wouldn’t particularly care. However, a son of the God of Wealth made it onto the Tianjiao List, and this was forty years ago.” Upon hearing this, Gu Yang began to understand.<br/><br/>No matter how much money the Qian family made, there would be no threat to the royal family, they’d still be their cash-cow.<br/><br/>However, when the Qian family produced a Tianjiao, the situation dramatically changed.<br/><br/>To be placed on the Tianjiao List means there’s hope of attaining divine power.<br/><br/>Should the Qian family produce a person of divine power, they would become hard to control.<br/><br/>Chu Xiyue continued, “A few years later, that Tianjiao of the Qian Family was challenged by another Tianjiao and died in battle. After that, descendants of the Qian family died mysteriously. In the end, only Qian Xiyun was left.”<br/><br/>Gu Yang couldn’t help but admire the ruthlessness of the royal family – the moment signs showed that the loyal dog might bite, they acted swiftly and mercilessly.<br/><br/>This method of eliminating the Tianjiao seemed quite familiar.<br/><br/>In a previous simulation, the queen tried to use him to eliminate the chief disciple of the Academy in the same way.<br/><br/>After so many years, the same methods were still in use.<br/><br/>“The God of Wealth of the Qian family sent his only granddaughter to Jingzhou, thousands of miles away. Only then she was able to survive. This was a tacit understanding between the Qian family and the royal family. The Qian family would no longer interfere with the Four Sea Bank in return for their bloodline to be spared.”<br/><br/>“Qian Xiyun would’ve been safe if she stayed in Jingzhou. But what she’s venturing into now…it’s incredibly dangerous…”<br/><br/>Before she could finish, an indignant voice interrupted from the side, “My grandpa died unjustly. No matter how dangerous, I’m going to seek justice for him.’<br/><br/>Gu Yang and Chu Xiyue both were startled.<br/><br/>With their abilities, they hadn’t realized that someone had been eavesdropping!<br/><br/>About a few meters away, two figures abruptly appeared. It was Qian Xiyun and the mage named Lily.<br/><br/>Gu Yang quickly reacted, realising this was Lily’s spell, something like invisibility. It was surprising that it could deceive his senses.<br/><br/>A flicker of surprise flashed in Chu Xiyue’s eyes, “A mage from another continent?”<br/><br/>Lily lifted her skirt, performed a curtsy, and corrected her, “My name is Lily. I’m a sorcerer.”<br/><br/>Chu Xiyue’s understanding of the foreign continent was limited and she was unclear on the difference between a sorcerer and a mage. She nodded slightly, and didn’t ask any more questions.<br/><br/>She had come to find Gu Yang in middle of the night to have a drink, mainly to dissuade him from getting involved in the affairs of the Qian family. Who knew she would end up running into the parties involved, which made the situation a bit awkward.<br/><br/>After Qian Xiyun finished her speech, she first performed a curtsy, apologizing, “I’m sorry for eavesdropping on your conversation.”<br/><br/>Chu Xiyue said, “Considering your current situation, it’s quite normal for you to be wary of us.”<br/><br/>Qian Xiyun turned to Gu Yang, “My situation is as Miss Chu stated, dangerously precarious. On the journey, countless people have tried to take my life. Brother Gu, if you wish to withdraw, I wouldn’t bear any grudge. However, should the news of my death spread, I fear you might not get what you desire.”<br/><br/>Gu Yang felt her words were correct. If her trade company’s owner dies, the company left in Jingzhou could either be acquired by other powers or divided among her subordinates. How could it possibly fall into his hands?<br/><br/>He spoke out loud, “Since I promised to accompany you once, I won’t go back on my word. You should go back and rest.”<br/><br/>Qian Xiyun didn’t say anything more, performed another curtsy, and left with Lily.<br/><br/>Gu Yang turned to Chu Xiyue, “I understand what you mean. I will accompany her to Zhongzhou on this trip, and then I will withdraw.”<br/><br/>Hearing him speak in this manner, Chu Xiyue didn’t try to persuade him anymore and picked up the wine pot.<br/><br/>The two touched their pots together, and drained the wine in one gulp.<br/><br/>All was understood without words.<br/><br/>Two days later.<br/><br/>Covered by the dark night, Lily took out a black crystal ball. She silently chanted a spell, moments later, an invisible force enveloped her, Gu Yang and Qian Xiyun, their figures disappeared into thin air.<br/><br/>With the aid of the Invisibility Technique, Gu Yang led them off the painting boat silentlv and reached the shore.<br/><br/>As for Cheng Xue, she stayed on the painting boat to recover from her injuries.<br/><br/>This was mainly because Lily’s Invisibility Technique could only cover three people.<br/><br/>That was why Qian Xiyun only brought two people along. She had planned to return to Zhongzhou suddenly to catch others off guard.<br/><br/>Who knew they would still run into an ambush.<br/><br/>This means there is a traitor among Qian Xiyun’s people.<br/><br/>Gu Yang had considered this, and Qian Xiyun, being the one concerned, naturally wouldn’t have overlooked it.<br/><br/>However, judging from the way Cheng Xue fought desperately on the boat, she probably wasn’t the traitor.<br/><br/>Lily was even less likely.<br/><br/>Only until they were a hundred miles away did Lily remove the Invisibility Technique.<br/><br/>All the way, it was Gu Yang who led them.<br/><br/>He suggested taking a break to rest for a while. Judging from Lily’s condition, the exertion of performing the Invisibility Technique was immense.<br/><br/>Gu Yang also sat down on the ground to meditate and adjust his breath.<br/><br/>Moments later, a hot flame wrapped around his body, seemingly tangible.<br/><br/>Qian Xiyun was astonished to see this. She herself was a Fifth-Grade cultivator and had been instructed by famous teachers, so she knew exactly what this was.<br/><br/>His True Essence was on the verge of becoming tangible, comparable to the Gang Qi of a First Rank strongman.<br/><br/>No doubt, what he was cultivating was an unrivalled technique.<br/><br/>No wonder he was able to become number one on the Hidden Dragon List.<br/><br/>Given his age, if he were a year or two younger, he would surely have made it to the List of Promising Individuals.<br/><br/>Lily next to her started trembling uncontrollably, stuttering,<br/><br/>Then, with a thump, she fell to her knees.<br/><br/>Seeing Lily’s reaction, Qian Xiyun was taken aback.<br/><br/>Her trading company did business with people from the West Bank Continent. She was well-versed in the languages of different regions and recognized the sound of the syllables Lily had just uttered.. It meant “Angel”!\t\t\t\t\t\t</div>", "images": {}, "success": true}