{"id": 84, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297864.html", "title": "Chapter 84 - Chapter 84: 084 Blood Blade Enemy", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 84 - Chapter 84: 084 Blood Blade Enemy</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 84: 084 Blood Blade Enemy<br/><br/>Translator: 549690339<br/><br/>“A sword breaks through a thousand waves!”<br/><br/>Liu Zhe had studied this sword stance for five years, not fully grasping its true essence until he had broken through to the Second Grade level. Only then could he utilize this powerful technique.<br/><br/>After that, he officially became the successor to his master’s legacy.<br/><br/>In the past, his master had utilized this single move to defeat powerful practitioners across the world, eventually stepping into the Divine Power realm to create a legend of his own.<br/><br/>When he emerged from his seclusion, he was ambitious and determined to follow in the footsteps of his master, creating a legend of his own.<br/><br/>Unfortunately, his first opponent was Gu Yang.<br/><br/>The astonishing slash, against all odds, struck at the weakest point in his swordmanship.<br/><br/>This was a weakness that he had never noticed before!<br/><br/>The essence of “A sword breaks through a thousand waves” was to find the weaknesses within an opponent’s techniques and exploit them.<br/><br/>Now, he was defeated in the very method he mastered.<br/><br/>Spurt!<br/><br/>A surge of Blade Intent pierced through his body, causing Liu Zhe to spit out a mouthful of blood, leaving his mind a blank abyss. He could not accept the reality of losing to a single strike.<br/><br/>The next moment.<br/><br/>A beam of Blade Intent entered his vision. He was engulfed by fear of death.<br/><br/>Suddenly, two slender white fingers extended from the side and firmly gripped onto the blade, preventing it from advancing any further.<br/><br/>Liu Zhe, who narrowly escaped death, gasped for breath, frightened to the extreme.<br/><br/>He was just a trifling moment away from losing his life.<br/><br/>Coughing up a mouthful of blood, he weakly said, “Than… Thank you, senior…<br/><br/>sister…”<br/><br/>The one who saved his life in this critical moment was his second senior sister.<br/><br/>After striking down Liu Zhe with a single strike, Gu Yang decisively aimed the following slash at his head.<br/><br/>Until two fingers gripped his Phoenix Feather Knife, a figure appeared out of nowhere, catching his blade barehanded.<br/><br/>His True Essence was like a mud ox entering the sea, unable to withstand the force. His mighty Phoenix Feather Knife was clamped between two spring onion-like fingers, unable to move an inch.<br/><br/>First Rank!<br/><br/>And not an ordinary First Ranker.<br/><br/>Gu Yang knew he had encountered an extremely formidable opponent. Without hesitation, he let go of the Phoenix Feather Knife and backed away to create distance.<br/><br/>The person who had caught his fatal blow was a woman, dressed in a lake-green long dress. A red mole was located between her brows, displaying a sense of laziness unique to mature women.<br/><br/>She slightly opened her red lips, her voice carrying a touch of huskiness, “Your Saber Technique isn’t bad, but your killing intent is a bit heavy.” While saying these words, she casually pocketed the Phoenix Feather Knife, showing no intention of returning it.<br/><br/>Seeing this made Gu Yang jump. The Phoenix Feather Knife was worth 200,000.<br/><br/>He asked in a deep voice, “May I ask your name, miss?”<br/><br/>The woman glanced at him with interest, and asked in an interesting tone, “What, you are unwilling to admit defeat and want to take revenge in the future?”<br/><br/>Gu Yang responded evenly, “I just want to know, how do we count the duel just now? Or does the miss intend to bully the weak?”<br/><br/>“Hehe, I have always done things my way and never care about others’ opinions. Even if I were to kill you, what of it?” The woman said, her eyes flashing a dangerous aura.<br/><br/>At this moment, everyone present felt threatened.<br/><br/>It was an instinct for martial artists.<br/><br/>Regardless, Gu Yang remained unmoved and said casually, “If miss had wanted to kill me, you would’ve done so already. If I’m not mistaken, you’re using me as his sharpening stone, right?”<br/><br/>He was certain. This certainty came from the system.<br/><br/>So far, he had been acting based on the experience from the previous simulation.<br/><br/>That meant, he had also encountered this woman in the simulation, and she had not killed him.<br/><br/>Therefore, she wouldn’t kill him in reality either.<br/><br/>The woman’s eyes flickered with an unusual glow, and a charming smile tugged at the corners of her lips, “You’re quite bold. Gu Yang, right? I’ll remember you. If you want your knife back, come find me in the East Sea.<br/><br/>Remember, my name is Lan Shu.”<br/><br/>With that, she vanished on the spot.<br/><br/>Gu Yang couldn’t even track her movements.<br/><br/>That meant, he had also encountered this woman in the simulation, and she had not killed him.<br/><br/>However, she had just swallowed his knife.<br/><br/>He made a mental note of this.<br/><br/>Just then, a figure grabbed Liu Zhe off the ground and attempted to escape. It was Liu Cheng, seeing the situation and attempting to flee.<br/><br/>“Trying to run?”<br/><br/>Gu Yang sneered. In a flash, he had caught up to Liu Cheng.<br/><br/>“Zhe, run!”<br/><br/>Realizing he couldn’t escape, Liu Cheng threw Liu Zhe ahead and turned to face Gu Yang, stabbing his sword towards him in a do-or-die manner.<br/><br/>While Gu Yang was mid-air, he casually snapped off a tree branch and quickly pressed it to Liu Cheng’s chest.<br/><br/>In his eyes, Liu Cheng’s swordsmanship was too mediocre and couldn’t be compared with Liu Zhe. He only needed one move.<br/><br/>The move he was using now was the same one he used to defeat Liu Zhe, the third move of the “God Destroyer Nine Styles”, the Slash-Severing Technique.<br/><br/>This move was specifically designed to counter any moves or techniques, adjusting itself to changing circumstances. This move seeks an opening in the opponent’s defense at the moment they make a move and counters it.<br/><br/>It shared the same principles as the Wave-breaking Sword Technique.<br/><br/>In order to master this move, one must have a profound understanding of various saber and sword techniques. Thanks to the simulator, he had a vast amount of Martial Arts experience that most people could only dream of, which allowed him to master it.<br/><br/>Once he had mastered this move, he could easily defeat those weaker than him in a single stroke.<br/><br/>Liu Cheng immediately spat out a mouthful of blood and slumped over.<br/><br/>His face was ashen. Gu Yang’s attack had disrupted his Qi, causing him to lose all his True Essence and the ability to fight back.<br/><br/>“Uncle…”<br/><br/>From not far away, seeing this, Liu Zhe could only grit his teeth in anger.<br/><br/>As Gu Yang turned to look at him, his eyes were cold as if to say, you’re next.<br/><br/>Since Lan Shu had left, it indicated that she had made her stance clear. Liu Zhe was not to be killed, and she wasn’t bothered about anything else.<br/><br/>Therefore, he boldly made his move.<br/><br/>If Liu Zhe couldn’t be killed, it didn’t mean that the people around him were off-limits, right?<br/><br/>Lan Shu’s absence indicated that his guess was correct.<br/><br/>Liu Cheng glared at Gu Yang with resentment in his eyes, gasping for breath, “Zhe… will definitely… avenge me…”<br/><br/>Ignoring his words, Gu Yang dragged him to the chariot in front of Su Qingzhi, saying, “I’m leaving this to you.”<br/><br/>Early on, Su Qingzhi recognized Liu Cheng. He was the third man in the Liu family and their hitman – all the dirty work was done by him.<br/><br/>It was probably him who destroyed her family.<br/><br/>Seeing their mortal enemy before their eyes deepened their hatred.<br/><br/>Without hesitation, Su Qingzhi drew her short sword and charged at Liu Cheng.<br/><br/>She hacked his throat repeatedly, and his blood splashed all over her face. Unsatisfied after numerous slashes, she continued her assault…<br/><br/>In no time at all, his neck was almost severed, connected only by a sliver of skin. His head drooped down, dead beyond any doubt.<br/><br/>Su Qingzhi finally stopped and fell to the ground, bursting into sobs.<br/><br/>Gu Yang didn’t speak, allowing her to vent her sorrows.<br/><br/>PS: It’s Monday again, please vote..\t\t\t\t\t\t</div>", "images": {}, "success": true}