{"id": 87, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297870.html", "title": "Chapter 87 - Chapter 87: 087 Name Of A Person, Shadow Of A Tree", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 87 - Chapter 87: 087 Name Of A Person, Shadow Of A Tree</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 87: 087 Name of a person, shadow of a tree<br/><br/>Translator: 549690339<br/><br/>These days, Gu Yang’s life has been comfortable but he hasn’t forgotten about the crisis.<br/><br/>Chu Xiyue would not always travel with him. At most, she would leave after one year. At that time, no one would stop the First Rank from the Lin Family.<br/><br/>He only had a balance of 530,000 left, which would only be enough for five simulations, and he definitely wouldn’t be able to break through to the First<br/><br/>Rank.<br/><br/>Hence, he had been contemplating on how to amass a large fortune.<br/><br/>While discussing martial arts with Chu Xiyue, he also inquired about the affairs of the various major forces.<br/><br/>Now, he had finally encountered an excellent opportunity.<br/><br/>The Qian Family, the richest family in the world.<br/><br/>The only legitimate daughter of the Qian family was currently under attack.<br/><br/>Was there a better opportunity than this?<br/><br/>Gu Yang immediately opened the system, spent 100,000, and initiated a simulation.<br/><br/>These days, he had been digesting the gains from his previous simulation and did not use the simulator.<br/><br/>In the blink of an eye, the simulated result was out.<br/><br/>He only got a glimpse of it, saw the words that he had successfully rescued Qian Xiyun and lived for a few more years, and felt assured.<br/><br/>As long as it did not immediately bring about lethal danger, it was not a trouble to him.<br/><br/>As the saying goes, fortune favors the bold.<br/><br/>His demand for silver was too high right now. To break through to the First Rank, he estimated that it would not be possible without several million.<br/><br/>Even the likes of the Liu family and Fang Family might not be able to gather so much silver even if they emptied their coffers.<br/><br/>Unless, he could rob the Lin Family.<br/><br/>But he wasn’t capable of doing that.<br/><br/>Now that the legitimate daughter of the Qian Family was in trouble, it was indeed a heaven-sent opportunity.<br/><br/>Gu Yang leaped over thirty meters, then his body began to fall. He touched the surface of the water with his foot, and then leaped again. In a few leaps, he had reached the bow of the ship.<br/><br/>“Huh, Break Mountain Saber Technique?”<br/><br/>He saw the three Second Grades in the chaotic battle. The woman who was being besieged was using the Break Mountain Saber Technique, and she had practiced this saber technique to the point of mastery.<br/><br/>She was in imminent danger under the siege of the two Second Grades. She had several injuries and was covered in blood, but she was stubbornly blocking these two.<br/><br/>Behind her, there was a person covered in black, holding a black crystal ball in his hand, and erecting a black light screen.<br/><br/>Next to them, two Third Rank fighters were chopping the light screen with their knives but could not break this thin light shield.<br/><br/>“What the hell is this?”<br/><br/>Gu Yang looked at it with curiosity.<br/><br/>This light screen looked like a legendary Gang Qi protective shield, which can only be performed by First Rank Peak martial artists.<br/><br/>However, if that black-robed man was a First Rank Peak, he could easily kill those two Third Rank martial artists. He wouldn’t allow them to be so disrespectful.<br/><br/>Every time the two Third Rank Fighters made a slash, the black-robed man trembled, indicating that he couldn’t hold on for long.<br/><br/>Out of curiosity, Gu Yang couldn’t help but take a closer look and wondered what kind of power system it was.<br/><br/>Gu Yang’s appearance attracted the attention of both sides, especially for those who were hidden. Seeing that the other side was about to break, but a master suddenly appeared, they were naturally on high alert.<br/><br/>One of them warned in a hoarse voice, “I advise you not to be nosy, so as to avoid getting into trouble.”<br/><br/>Gu Yang ignored him and instead turned to look at the injured woman who was behind the black light shield.<br/><br/>The woman was dressed in plain clothes, with a white flower on her head. She was quite pretty, but her face expressed some bitterness and pain. He asked, “Are you Miss Qian of the Qian Family?”<br/><br/>The woman looked up at him, and said solemnly, “Yes, that’s me.”<br/><br/>“I want to make a deal with you. I will save your life, but you have to pay.”<br/><br/>“How much do you want?”<br/><br/>Gu Yang smiled, if she agreed without asking, that would be a problem.<br/><br/>He said, “Three million silver, cash. To be paid in full within three months.”<br/><br/>The woman agreed without hesitation, “Deal!”<br/><br/>While the two of them were talking, the frenzied attack of the two Second Grades changed, becoming more fierce.<br/><br/>The besieged woman was already at the end of her tether and could barely hold off one of them. The other one’s knife was flashing towards her neck like lightning.<br/><br/>It looked like she was about to lose her life.<br/><br/>In the next moment, Gu Yang had already made his move. Covering a distance of more than twenty meters in the blink of an eye, the long knife in his hand was already out of the sheath.<br/><br/>Ever since the woman named Lan Shu had taken the Phoenix Feather Knife, he had bought this knife on the road.<br/><br/>Hum!<br/><br/>As soon as the knife was out of the sheath, a formidable killing intent instantly enveloped the two of them.<br/><br/>The eyes of the two Second Grade martial artists contracted.<br/><br/>They both had extremely rich combat experience. As soon as this man made his move, they knew they were no match for him.<br/><br/>“Withdraw!”<br/><br/>Without any hesitation, the two of them jumped into the river and backed away rapidly.<br/><br/>The other two Third Ranks that were trying hard to break the light screen also reacted very quickly and jumped into the river.<br/><br/>Gu Yang didn’t pursue them and returned the knife to its sheath.<br/><br/>Killing these four wasn’t difficult, but there was no need.<br/><br/>Xu Ruomei once said, men of the army are always extremely united. If they could avoid causing trouble, then they should avoid causing trouble.<br/><br/>Killing them would have no benefits to him.<br/><br/>His deal with Miss Qian was only to save her life, not to kill anyone.<br/><br/>After the four attackers had retreated, Qian Xiyun loosened up and said to the black-robed man in front of her, “Lily, stop.”<br/><br/>The light screen above her head suddenly disappeared. The black-robed man almost collapsed on the ground, showing that maintaining this light screen was also a great burden for her.<br/><br/>Qian Xiyun walked up to Gu Yang, saluted formally, and said, “Thank you for saving my life.”<br/><br/>The man said, “Well, I’ll need Miss Qian to write an IOU.”<br/><br/>Qian Xiyun paused slightly, then nodded, took out a white silk handkerchief she was carrying with her, bit her finger, and wrote an IOU: “I owe three million in silver, to be repaid within three months. Borrower, Qian Xiyun.” In the end, she took out a seal and stamped it carefully on it.<br/><br/>Gu Yang took the handkerchief and saw its content, and was very satisfied.<br/><br/>True to her businessman nature, she was quite meticulous about things. Qian Xiyun then said, “I hope you can escort us to Zhongzhou.”<br/><br/>Gu Yang had anticipated that she would make such a request. The two guards beside her were badly injured. Under such circumstances, it would be a miracle if they made it back to Zhongzhou.<br/><br/>He opened the system again and checked. In the simulation, he had successfully taken her to Zhongzhou and received three million, then said, “Alright.”<br/><br/>Gu Yang said, looking in the direction of the painting boat about a hundred meters away, “Tell the boatman to bring the boat over.”<br/><br/>His voice travelled far. Soon, the painting boat turned and started heading this way.<br/><br/>Seeing that Gu Yang agreed without proposing other conditions, Qian Xiyun started to develop a small liking for him. She asked, “May I know your name,<br/><br/>“Gu Yang.”<br/><br/>Qian Xiyun was taken aback, “It turns out to be Mr. Gu who is the first on the Hidden Dragon List and defeated Liu Zhe in one stroke. Xiyun has been inconsiderate.”<br/><br/>In the past half a month, the news of Gu Yang being the first on the Hidden Dragon List, defeating Liu Zhe in one stroke, the ninth talent on the list, had already spread throughout Great Zhou, making it the most sensational event at the moment.<br/><br/>Just as a man’s name says much about him, so does his shadow. After Gu Yang mentioned his own name, the attitude of Qian Xiyun and the Second Grade martial artist had completely changed.<br/><br/>PS: I had nothing to do in the morning, so I wrote a chapter, the update is ahead of time..\t\t\t\t\t\t</div>", "images": {}, "success": true}