{"id": 96, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297888.html", "title": "Chapter 96 - Chapter 96: 096 Decapitating The First Rank (Fourth Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 96 - Chapter 96: 096 Decapitating The First Rank (Fourth Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 96: 096 Decapitating the First Rank (Fourth Update)<br/><br/>Translator: 549690339<br/><br/>Xing Kun burned all his energy, spirit, and vigor, transforming them into Gang Qi, which he funneled into the imperial treasure sword in his hand.<br/><br/>On the sword, a blood-red Gang Qi emerged.<br/><br/>The final move of “Blood Battle Saber Technique”, Blood Battle Eight Directions.<br/><br/>In an instant, his state reached the pinnacle of his life, once again targeting Gu<br/><br/>Yang.<br/><br/>“Die!”<br/><br/>In the next moment, the sword in his hand, unhesitatingly cleaved towards Gu Yang.<br/><br/>He burned his lifetime cultivation, life, and spirit to forge this one strike.<br/><br/>Before the sword arrived, Gu Yang was wafted over by a strong scent of blood. That terrifying killing intent, almost materializing, tightly pressed over his head.<br/><br/>His heart could not help but swell with a trace of anger.<br/><br/>He did not know why this person harbored such a deep killing intent towards him, and a dignified First Rank would hesitate to use a forbidden technique that led to mutual destruction.<br/><br/>This was simply unimaginable.<br/><br/>However, it wouldn’t be so easy to kill him.<br/><br/>At a matter of life and death, Gu Yang no longer held anything back. The True Essence within his body was circulating at its extreme. Around his body, a layer of red flame sprouted, much like Protective Gang Qi.<br/><br/>The vitality of heaven and earth from all around crazily surged into his body, which he channeled into his sword.<br/><br/>Soon after, his long sword in hand burst forth with an extremely blinding radiance.<br/><br/>At this moment, Xing Kun’s sword had already reached above his head.<br/><br/>The long sword in Gu Yang’s hand met it head-on.<br/><br/>Clang!<br/><br/>Suddenly, a flash burst in the air, the blinding brilliance almost blinded the eyes of the onlookers.<br/><br/>The terrifying shockwave swept in all directions.<br/><br/>The solid iron gate nearby was destroyed in an instant, producing two deep marks on the wall.<br/><br/>The ground trembled once.<br/><br/>For a moment, sand and rocks flew around, numerous dust kicked up, blocking everyone’s line of sight.<br/><br/>Is he dead?<br/><br/>This earth-shattering collision left the people at the scene dazzled and breathless.<br/><br/>Such a brief yet brutal combat was rare.<br/><br/>When reaching the First Rank Realm, normally, when hands are exchanged, one would first test the opponent’s strength, not starting off with a killer move.<br/><br/>Even more, when engaging in a combat between First Ranks, even if one side is at a disadvantage, if they intend to run away, it is extremely difficult for the other to complete a kill.<br/><br/>Unless the gap in strength between the two sides is too large.<br/><br/>However, no First Rank powerhouse would be foolish enough to challenge those whose strengths far surpass their own.<br/><br/>In all of Great Zhou, it has been several years since a First Rank powerhouse has been killed in combat.<br/><br/>The last time was five years ago when a First Rank powerhouse of the military was surrounded and killed on the battlefield by several Barbarian powerhouses.<br/><br/>Since the Wu Family incident eighteen years ago, where so many died, all the families have been scared. At the First Rank level, disputes are rare.<br/><br/>Like today, when Xing Kun, a First Rank, would use a forbidden technique leading to mutual destruction, just to kill a Second Grade martial artist, it was so rare it was incomprehensible.<br/><br/>What the audience was most concerned about was, did Gu Yang die or not?<br/><br/>Chen Shilin was watching, his face turned somewhat pale, his eyes still affected by the sudden flash just now, all he could see was a white shadow. His hand uncontrollably pressed on the hilt of his sword, trembling slightly.<br/><br/>He could not block that slash.<br/><br/>If he was facing that slash, his death would be certain).<br/><br/>Is this the so-called first stage of the First Rank mentioned by Elder Wu?<br/><br/>The slash of Xing Kun shattered his pride and self-satisfaction brought about by becoming the youngest First Rank in the world.<br/><br/>A while later, his vision recovered. He finally saw the outcome of the battle, his breath hitched, hardly daring to believe what he was seeing.<br/><br/>Elder Wu sat nearby, his eyes tightly closed, blood flowing from the corners of his eyes, his expression somewhat pained.<br/><br/>Just now, he was watching their fight directly, pushing his eye technique to the extreme, but he saw something that he shouldn’t have, his eyes severely damaged, and his eye technique, which he had painstakingly trained for several decades, was ruined.<br/><br/>He murmured to himself, “So that’s how it is…”<br/><br/>As for the outcome of the battle, he already knew it.<br/><br/>The Cao family carriage parked by the roadside was not affected at all.<br/><br/>Cao Yiyi’s eyes were wide open. Although protected by Ru Qin’s Gang Qi, she remained unharmed.<br/><br/>However, when she saw that blood-like sword cleaved towards Gu Yang, a terrified expression flashed across her face. She opened her mouth, wanting to say something, but it was already too late.<br/><br/>Then, she couldn’t see anything.<br/><br/>Her face became pale and she suddenly screamed, looking frantic, “Why didn’t you save him? Why?”<br/><br/>Ru Qin sat there, looking out the carriage window, her expression filled with deep shock and fear. Startled by Cao Yiyi’s outburst, she turned to look at her. Observing her in this state, she felt somewhat worried.<br/><br/>She spoke softly, “He’s not dead.” “What?” Cao Yiyi was taken aback.<br/><br/>“Look.”<br/><br/>Ru Qin pointed outside.<br/><br/>Cao Yiyi looked out the carriage window.<br/><br/>At this time, the dust in the sky had dispersed. She could vaguely see a figure standing there. It was Gu Yang, he was still moving, stepping towards the side.<br/><br/>“Thank goodness…”<br/><br/>Cao Yiyi’s eyes moistened, she murmured, “I knew you wouldn’t die so easily.<br/><br/>Even if you had to die, you could only die at my hands…”<br/><br/>Her voice was gentle yet carried a touch of madness, which sent chills down one’s spine.<br/><br/>Ru Qin couldn’t help but shudder.<br/><br/>Indeed, there were not many sane people in the Cao family.<br/><br/>She asked, “His True Essence must be depleted by now, shall we capture him?”<br/><br/>Cao Yiyi unexpectedly refused, whispering, “If we capture him now, he will not submit. I want to wait until he recovers, and defeat him personally, shattering all his pride and confidence…”<br/><br/>Ru Qin’s expression changed abruptly upon hearing her words, “Yi Yi, you…”<br/><br/>Cao Yiyi chuckled, “My father is such a ruthless and heartless man, even capable of ruthlessly murdering my mother. Yet, he dotes on me beyond measure. Isn’t it because he wants me to willingly become the vessel for that thing? I agree, it will surely make Father very happy, won’t it?”<br/><br/>Ru Qin blankly stared at her, with a mix of indescribable emotions welling up inside her.<br/><br/>She could naturally guess some of her master’s plans, but over the years, she fostered certain feelings for the young girl standing in front of her.<br/><br/>She knew very well how dangerous that thing was.<br/><br/>To carry its power, a slight mistake could spell complete annihilation of the body and soul.<br/><br/>Up in the tavern, Lin Liang was completely stunned, his eyes tightly closed, with tears brimming at the corners of his eyes.<br/><br/>The power of that saber strike was beyond his imagination.<br/><br/>Even from such a distance, it made him feel the threat of death.<br/><br/>To confront such a strike, even his uncle, perhaps, wouldn’t be able to resist.<br/><br/>His uncle was exactly the first master of the Lin family in Jiangzhou.<br/><br/>“He must be dead, right?”<br/><br/>After the initial terror, Lin Liang remembered the main issue.<br/><br/>At this moment, his vision restored, and he squinted through the thick smoke. His heart jolted, seeing the figure gradually moving, his mouth went dry.<br/><br/>He was still alive?<br/><br/>How could this…<br/><br/>How is it possible?<br/><br/>Lin Liang could hardly believe his eyes.<br/><br/>Without a doubt, anyone would be dead under that strike.<br/><br/>However, Gu Yang survived that attack and even managed to stay alive.<br/><br/>Could it be, he, a mere Second Grade, was even stronger than him, a First-Rank?<br/><br/>No, absolutely impossible.<br/><br/>He must have some secret lifesaving item on him.<br/><br/>Lin Liang quickly found an excuse.<br/><br/>Suddenly, he noticed that Gu Yang’s steps were faltering. An audacious idea sprang up in his mind.<br/><br/>“Having endured that strike, he must have exhausted his last bits of energy. If I were to strike now, he would be doomed…’<br/><br/>As Lin Liang thought about this, his heart pounded.<br/><br/>This was a once in a lifetime opportunity!<br/><br/>He was about to draw his sword, when he saw Gu Yang suddenly stopped and seemed to look in his direction.<br/><br/>In an instant, Lin Liang’s heart nearly stopped.<br/><br/>“No, taking advantage of others’ vulnerabilities is not what a person of my caliber should do.”<br/><br/>Lin Liang withdrew his hand, lifted his cup of wine, drained it in one gulp, but his hand continued shaking uncontrollably.<br/><br/>Then, he turned to leave, and his figure soon disappeared.<br/><br/>On the other side, Gu Yang withdrew his gaze.<br/><br/>He had just sensed a somewhat familiar killing intent, so he turned his head and looked around.<br/><br/>It seemed he had scared that person off.<br/><br/>He was not bothered.<br/><br/>Gu Yang appeared to be in a pitiful state, covered in blood, with heavy wounds.<br/><br/>The power of that strike was too powerful. It exceeded the carrying capacity of his swallowing technique, resulting in severe internal injuries.<br/><br/>However, his mortal body was incredibly formidable by this point, and such injuries could not endanger his life.<br/><br/>What was even worse was that his True Essence was completely drained, reaching exhaustion.<br/><br/>Luckily, he had a ready plan.<br/><br/>Since he knew he would meet a First-Rank powerhouse upon entering the city, he naturally performed a Simulation in advance.<br/><br/>After the battle, he immediately claimed the reward, and the True Essence inside him recovered immediately.<br/><br/>However, his injuries were still present.<br/><br/>This confirmed another fact; claiming rewards from the system couldn’t restore injuries.<br/><br/>Gu Yang’s appearance of weakness was all an act, just to see if anyone would take advantage of the situation.<br/><br/>He walked to the First-Rank powerhouse, whose body and head lay apart.<br/><br/>The swallowing technique was a martial art of the Divine Power realm, surpassing the scope of ordinary martial arts, its power growing with the strength of the opponent.<br/><br/>He absorbed nearly a third of the force from the opponent’s strike and combined it with his True Essence. It instantly broke his opponent’s saber technique and beheaded him with a single strike.<br/><br/>Among the ones present, only two could clearly view the situation of the battle.<br/><br/>One was Elder Wu, and the other was Ru Qin.<br/><br/>The shock they received was also the greatest.<br/><br/>At this moment, Gu Yang looked at the corpse of the First-Rank powerhouse, shook his head, and muttered, “What a nut job!”<br/><br/>He could only interpret this incident as the deep malignance of the World Will.<br/><br/>Just because he had stolen nearly a million taels of silver from the Four Sea Bank, this First-Rank powerhouse bizarrely went manic and insisted on killing him.<br/><br/>Anyway, it wasn’t the first or second time he had encountered such matters.<br/><br/>Gu Yang looked at Lily and Qian Xiyun standing not far away and said, “Let’s leave, I’ll escort you to the Qian Residence.”<br/><br/>Thanks to Lily’s protection, Qian Xiyun hadn’t suffered any injuries. However, she hadn’t entirely recovered from the shock of Gu Yang beheading a First-Rank warrior. Hearing his words, she involuntarily swallowed, her eyes filled with deep reverence.<br/><br/>To chop down a First-Rank powerhouse while being at the Second Grade.<br/><br/>How outrageous could this be?<br/><br/>PS: Four chapters, I tried my best. About eleven thousand words. Tomorrow’s updates are as follows: one chapter before noon, one chapter before six in the evening, and one chapter before midnight. Lastly, asking for your monthly<br/><br/>tickets..\t\t\t\t\t\t</div>", "images": {}, "success": true}