{"id": 98, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297892.html", "title": "Chapter 98 - Chapter 98: 098 Deal Completed (Second Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 98 - Chapter 98: 098 Deal Completed (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 98: 098 Deal Completed (Second Update)<br/><br/>Translator: 549690339<br/><br/>“Money?”<br/><br/>Even with her three hundred years of experience, Asura Sword Saint was taken aback by Gu Yang’s request.<br/><br/>He did not ask for secret divine techniques, divine weapons nor any miraculous elixirs.<br/><br/>She would have understood if he desired beauty, but he asked for money.<br/><br/>With his capabilities, wasn’t money something he could acquire at will?<br/><br/>However, her surprise only lasted for a moment before she instructed someone outside, “Bing Yao, bring all of the title deeds.”<br/><br/>“Yes,” came a voice from outside.<br/><br/>Judging by the voice, it was the same lady clad in white that they saw earlier, so her name was Bing Yao.<br/><br/>After a while, the lady in white came over, holding an exquisite redwood box. She presented it to the old woman and left.<br/><br/>The old woman said, “This box contains the title deeds to the lands around Yan Dong Lake, along with some shares in various ventures, and large-denomination banknotes. See if that’s enough.”<br/><br/>Gu Yang didn’t hesitate, opening the box to find several large-value banknotes, each note valued at one hundred thousand taels, for a total of seven hundred thousand taels.<br/><br/>There were also title deeds to the lands surrounding Yan Dong Lake and shares in several businesses.<br/><br/>The old woman added, “How much you can get from the deeds and shares depends on your own capabilities.”<br/><br/>Gu Yang immediately agreed.<br/><br/>He was someone who knew how to read the situation. At this point, if he had rejected the offer, he would likely never be able to leave this room alive.<br/><br/>No matter how weak the seemingly dying old woman was, she was a Sword Saint. Even with her final breath, she was not to be underestimated.<br/><br/>Either way, he would end up agreeing to it. Getting such a deal was an unexpected bonus.<br/><br/>All of a sudden, the old woman let out a few coughs and visibly weakened. She handed Gu Yang a jade slip and weakly said, “This is the legacy of ‘Asura Sword Technique.’ I’ll give it to you as well. Wait for me outside. I have something to say to Meng Ling…”<br/><br/>Gu Yang received the jade slip, bowed, and left the decaying room.<br/><br/>Once outside, he felt an inexplicable heaviness in his heart.<br/><br/>No matter how powerful or invincible a Sword Saint you are, you can’t resist the passage of time; everyone ages in the end.<br/><br/>“Unless, one can reach the Unleaking Realm.”<br/><br/>Upon reaching the Unleaking Realm, one’s lifespan would extend by a thousand years.<br/><br/>Beyond that was the Celestial Being realm, promising an even longer life.<br/><br/>But with his talents, it was impossible to reach the Celestial Being realm on his own. He would still need the system.<br/><br/>Therefore, he must try all possible means to earn more money.<br/><br/>Not long after, Gu Yang left Lake Heart Island to return to his previous location. When he met Qian Xiyun, he took out the title deeds and shares, asking, “Miss Qian, can you help me estimate how much these are worth?”<br/><br/>Qian Xiyun took the deeds and shares, surprised at the sight, but didn’t dare to question him. She only said, “Yan Dong Lake was given to the Sword Saint by the government back in the day, I doubt anyone would dare to buy it.”<br/><br/>Gu Yang contemplated telling her that the Asura Sword Saint was near her end but ultimately chose not to, and instead he just nodded to acknowledge her comment.<br/><br/>Qian Xiyun continued, “These five shares are quite old. Three of the companies have already gone bankrupt. Only these two are still thriving, and each share is worth no less than a million taels.”<br/><br/>Upon hearing how valuable the shares were, he felt gratified.<br/><br/>This transaction was definitely worthwhile, netting him two million seven hundred thousand taels. For that, all he needed to do was to take care of one more disciple of Asura Sword Saint. He already had a number of dependents, so one more wouldn’t make a difference.<br/><br/>He said, “It seems I’ll need to stay in Zhongzhou for a few more days.”<br/><br/>After waiting for approximately half an hour, Asura Sword Saint’s two disciples finally appeared. Both were clad in white.<br/><br/>The elder disciple, Bing Yao, was as cold as ice, while the younger one, Meng Ling, seemed naive and carefree.<br/><br/>About twelve or thirteen years old, she was still a bit childish, with a pair of lively eyes that scanned the three of them before finally stopping on Gu Yang.<br/><br/>“You must be Gu Yang. My master said that you’d be my guardian from now on.<br/><br/>My name is Han Mengling. You can call me Ling’er.”<br/><br/>The first impression Gu Yang had of her was quite good; she didn’t seem hard to get along with. He flashed a friendly smile. “Hello.”<br/><br/>After looking Gu Yang over, Han Mengling asked, “Don’t you use any weapons?”<br/><br/>“I use a saber.”<br/><br/>The saber that Gu Yang used had been destroyed earlier, unable to withstand the immense flow of his True Essence.<br/><br/>Han Mengling eagerly suggested, “What about your saber technique? Can we have a friendly spar?”<br/><br/>“What is that, a horse? I’ve never seen one before.’ “Why does that woman have blue eyes? She looks so strange.”<br/><br/>“So many people, look, that person is so fat…”<br/><br/>Gu Yang hadn’t expected this fellow to be so chatty, extremely curious about everything along the way, acting as if he hadn’t seen the world before, chattering nonstop.<br/><br/>On the other hand, her senior sister was as cold as ice, not saying a word the entire journey.<br/><br/>The characters of these two sisters were completely at different extremes.<br/><br/>BV the time Gu Yang and his friends arrived outside the Qian residence, a tall and handsome man had already been waiting there; he was none other than the illegitimate son of the Qian family who had emerged from who knew where, Qian Xiuyang.<br/><br/>“Little sister, you must have had a tiring journey. I heard that you encountered danger at the city gate, are you okay?”<br/><br/>“Thank you for your concern…”<br/><br/>The two “siblings” who had never met before, staged a dramatic reunion as brother and sister.<br/><br/>Qian Xiuyang bowed to Bing Yao, “Greetings, Miss Yu.”<br/><br/>Yu Bing Yao nodded slightly as acknowledgement of the greeting.<br/><br/>Qian Xiuyang turned his head and politely said to Gu Yang, “Glad to meet you, Master Gu. It’s an honour to receive such a distinguished guest.”<br/><br/>“You’re too kind, Master Qian.” Gu Yang also politely replied.<br/><br/>Han Mengling, who was standing behind him, whispered, “This man is really handsome.”<br/><br/>Qian Xiuyang looked at her and asked, “And who might this be?”<br/><br/>Han Mengling rolled her eyes, “What’s it to you?”<br/><br/>Qian Xiuyang was taken aback.<br/><br/>She muttered to herself, “Master said that handsome men always have ulterior motives.”<br/><br/>Gu Yang couldn’t help but laugh, and after laughing, felt that something was wrong, as if he was being subtly insulted.<br/><br/>They settled down in the Qian residence; Qian Xiyun and Yu Bing Yao stayed in one courtyard.<br/><br/>Gu Yang, Lily and Han Mengling stayed together. The two courtyards were not far apart, so they could keep an eye out for each other.<br/><br/>In the following few days, Gu Yang sought help from Qian Xiyun to contact the shareholders of the two firms, intending to sell off his shares.<br/><br/>However, the progress was unsatisfactory. Many of them simply avoided meeting him.<br/><br/>It was clear that the majority did not think highly of Qian Xiyun, or rather, they didn’t want to get involved in the Qian family’s struggles.<br/><br/>This was quite troublesome. If he was unable to sell the shares, these two certificates would be worthless.<br/><br/>Gu Yang didn’t want to waste too much time on this matter.<br/><br/>Zhongzhou was now a whirlpool, and the Qian family was at its center. If he stayed there for too long, he would eventually get sucked in, which was not what he wanted.<br/><br/>Just as he was thinking about whether he should give up on this two million taels, a servant from the Qian family reported that someone was seeking an audience.<br/><br/>These past few days, countless people sought to meet him, all admiring his strength.<br/><br/>It seemed that overnight, he had become the idol of countless young warriors in Zhongzhou City.<br/><br/>The battle at the city gate had spread, and the legendary event that Gu Yang had beheaded a First Rank with a single blow had made him the object of countless people’s admiration.<br/><br/>However, no one who could make the Qian family’s people pass on the message had appeared before.<br/><br/>Out of curiosity, Gu Yang took the visiting card and became even more curious when he looked at it.<br/><br/>The visitor was actually a famous courtesan, the top courtesan in Zhongzhou City, Yuan Zhen Zhen.<br/><br/>Zhongzhou was the most commercial city in Great Zhou, and it had produced countless wealthy businessmen. Because of its commercial prosperity, the entertainment industry had also flourished.<br/><br/>Its status was similar to that of the Qinhuai River in ancient times from a previous world.<br/><br/>The selection of the top courtesan was an annual grand event in Zhongzhou City, which attracted numerous wealthy businessmen to spend big money.<br/><br/>The top courtesan selected every year naturally garnered the pursuit of countless people. Many wanted to see her but failed to.<br/><br/>Now, such a top courtesan had taken the initiative to visit Gu Yang.<br/><br/>This matter, no matter how you look at it, seemed strange.<br/><br/>Gu Yang said, “Please invite Miss Yuan over.”<br/><br/>PS: The next chapter will be published before twelve o’clock. And, continuing to ask for monthly votes..\t\t\t\t\t\t</div>", "images": {}, "success": true}