{"id": 91, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297878.html", "title": "Chapter 91 - Chapter 91: 091 Seventh Style", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 91 - Chapter 91: 091 Seventh Style</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 91: 091 Seventh Style<br/><br/>Translator: 549690339<br/><br/>On the bank of Luo River, amidst a small grove of trees, two shadowy figures, one tall, one short, were closely observing a boat on the river, discussing amongst themselves.<br/><br/>These two people were Lin Liang, the Second Elder of the Lin Family, and Lin Qiming, the leader of the Listening Wind Hall in the Lin Family.<br/><br/>Lin Liang, still standing aloof, hands folded behind him, asked, “Did you find out anything?”<br/><br/>Lin Qiming excitedly responded, “The Second Elder mentioned that there was a woman on the boat that day with Second Grade cultivation level and uses the Earth-Splitting Saber Technique. That can only be Cheng Xue, the second disciple of Tianxin Martial Arts Hall. Rumor has it, she is now acting as a bodyguard for Miss Qian of the Qian family.”<br/><br/>“Miss Qian?”<br/><br/>Second Elder Lin Liang’s eyes lit up, “No wonder, I was wondering why those two assassins were using military martial arts techniques. Haha, that kid is definitely done for now, daring to get involved with the Qian family.”<br/><br/>Upon saying this, his face suddenly changed, “Not good, he must have quietly left the boat already. I was wondering why I hadn’t seen him on the deck these past few days.”<br/><br/>Ever since he was driven away by that mysterious First Rank powerhouse the last time, he changed his strategy and began to follow from a distance.<br/><br/>He had guessed that the mysterious First Rank person must be Chu Xiyue’s protector.<br/><br/>So, he had been waiting, waiting for the day the kid separates from Gu Xi.<br/><br/>Now, he finally had his chance.<br/><br/>Although he didn’t know how the kid managed to deceive him, he trusted his intuition that the kid had indeed left with Miss Qian.<br/><br/>“This time, his end is near.”<br/><br/>Lin Liang sneered and took to the air. In a few jumps, he had disappeared.<br/><br/>Since they were with Miss Qian, they must be heading to Zhongzhou.<br/><br/>Watching him confidently leave, Lin Qiming, leader of the Listening Wind Hall suddenly remembered how the last time, he boasted that he would capture the kid in three days, and what ended up happening…<br/><br/>For some reason, he had a bad feeling about it.<br/><br/>After ten days, Lin Liang, clad in a wide-brimmed hat, finally arrived outside Zhongzhou City. He rented a private room in a tavern near the city gate, the window of which had a perfect view of the city entrance.<br/><br/>If Gu Yang came in through this gate, he wouldn’t escape his eyes.<br/><br/>Lin Liang’s ears weren’t idle either. He listened to the idle chat of the other guests in the tavern for a while before losing interest.<br/><br/>People outside were discussing a mysterious thief named “One Plum,” who had already stolen from several of the Four Sea Bank’s vaults, causing heavy losses.<br/><br/>Zhongzhou happened to be the main base of the Four Seas Bank, hence the robbery was causing such a sensation.<br/><br/>Lin Liang had no interest in the affairs of the Four Seas Bank. His heart was set on only one thing, and that was to complete his mission.<br/><br/>At the same time, Gu Yang and his companions had also arrived at Zhongzhou, about two hundred miles away from Zhongzhou City.<br/><br/>Just before nightfall, they settled down in a town.<br/><br/>Before they entered the inn, Lily looked at him questioning with her eyes. Should they take action tonight?<br/><br/>Gu Yang subtly shook his head to indicate that they wouldn’t be acting tonight, and a flash of disappointment flickered in her striking blue eyes.<br/><br/>Could she be getting addicted to stealing now?<br/><br/>Once in the room, he opened the system and saw the balance. There was a total of 1.5 million.<br/><br/>This was his earnings for the past fortnight.<br/><br/>He couldn’t help but sigh, making money was not easy. He and Lily had robbed seven Four Sea Banks branches only to earn close to one million liang.<br/><br/>Then, two days ago when they targeted another Four Seas Bank, the gold and silver in the vault had been moved, and only a few thousand liang remained.<br/><br/>It has to be said, the Four Sea Bank’s response was pretty quick. They had taken countermeasures so quickly.<br/><br/>Gu Yang considered that they were almost at Zhongzhou City. Who knew if the Four Sea Bank would arrange for any powerhouses in the nearby branches? So he temporarily gave up on this money-making route.<br/><br/>Tomorrow, they would reach Zhongzhou City.<br/><br/>According to the last simulation, they would be ambushed by a First Rank powerhouse outside Zhongzhou City gate, then saved by another First Rank powerhouse just in time.<br/><br/>However, after Gu Yang had robbed so many Four Sea Banks along the way, according to his experience, it was likely to trigger a butterfly effect.<br/><br/>Whether that First Rank powerhouse from the Qian Family will appear in time tomorrow is still questionable.<br/><br/>He must rely on himself.<br/><br/>[Would you like to use the Life Simulator? Using it once costs 100,000 gold coins.]<br/><br/>“Yes!”<br/><br/>[At twenty-two, you already were a Second Grade Martial Artist, topping the Hidden Dragon List, you defeated Liu Zhe, the ninth on the Tianjiao List, gaining fame far and wide.]<br/><br/>[After saving Qian Xiyun, you quietly headed to Zhongzhou with her and Lily.<br/><br/>When you were only a short distance from Zhongzhou City, you asked Qian<br/><br/>Xiyun for your reward and then left.]<br/><br/>[Half a month later, you met Chu Xiyue and heard the news of Qian Xiyun’s death.]<br/><br/>[A month later, you arrived at Jingzhou to find that Qian Xiyun’s firm had collapsed.]<br/><br/>[Wu Xingyun and King Jinghai’s resentments were resolved, and you become a special guest of the royal court.]<br/><br/>[Nine months later, Chu Xiyue bid you farewell and left.]<br/><br/>[Thereafter, you remained in Jinghai Palace to quietly level up your cultivation.]<br/><br/>[Seven years later, you bid farewell to Wu Xingyun and left Jingzhou with Su Qingzhen and others to meet Ling Ling, and continue practicing cultivation in a secluded place.]<br/><br/>[A year later, you heard that King Jinghai had died, and after Wu Xingyun succeeded the throne, he was overthrown in a rebellion and died in the chaos.]<br/><br/>[The same year, you learned the way of wizard cultivation from Lily, who had learned to speak the Great Zhou language.]<br/><br/>[For the following nine years, you used the Art of Meditation of the Wizards to find a way to channel the vitality of heaven and earth into your body, and successfully mastered the seventh technique of the ‘God-Slaying Knife’.]<br/><br/>[One day, during Ling Ling’s breakthrough to reach Divine Power Realm, she was ambushed by several First Rank powerhouses. You held one of them back, while Su Qingzhen and Lily barely managed to hold another one back, buying Ling Ling enough time to successfully break into the Divine Power Realm and kill all the First Rank powerhouses.]<br/><br/>[Suddenly, a gigantic palm appeared in the sky, pressing down on you. Ling Ling appeared in front of you, blocking this fatal attack. With a loud boom, both you and Ling Ling were killed on the spot at the age of 40.]<br/><br/>Gu Yang was not surprised by the outcome.<br/><br/>Recalling the fate of King Jinghai and Xi Tianyi, it seemed that behind the scenes of this world, a powerful force was specifically hunting those who had just broken into the Divine Power Realm.<br/><br/>Which group wielded this hidden power?<br/><br/>“So it seems, in this world, without a powerful support, even if you could break through to the Divine Power Realm, you can easily be killed off by someone, regardless of reason or fairness.”<br/><br/>Gu Yang felt that he should plan ahead too.<br/><br/>Otherwise, he wouldn’t even need to break through to the Divine Power Realm.<br/><br/>[Simulation over, you may keep one of the following.] [One, your Martial Realm at the age of forty.]<br/><br/>[Two, your Martial Arts experience at the age of forty.] [Three, your wisdom about life at the age of forty.]<br/><br/>This time, he again chose two.<br/><br/>With the seventh technique of the ‘God-Slaying Knife’, he had been able to hold off a First Rank powerhouse, indicating the potency of this move.<br/><br/>PS: Seeking monthly votes..\t\t\t\t\t\t</div>", "images": {}, "success": true}