{"id": 97, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297890.html", "title": "Chapter 97 - Chapter 97: 097 Asura Sword Saint (First Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 97 - Chapter 97: 097 Asura Sword Saint (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 97: 097 Asura Sword Saint (First update)<br/><br/>Translator: 549690339<br/><br/>“Useless!”<br/><br/>In a luxurious mansion, a plump middle-aged man squeezed these words through his teeth, his face becoming extremely gloomy.<br/><br/>A First Rank had been killed on the spot by a Second Grade youngster.<br/><br/>This had completely disgraced the internal guards.<br/><br/>From the shadow behind him, a chilly voice spoke, “They’re nearing Yan Dong<br/><br/>Lake. Do we need the other two bosses to intercept them?”<br/><br/>Three major bosses from the internal guards had come this time, and Xing Kun was dead. The other two, if they joined forces, surely could stop them.<br/><br/>Master Zhuang’s eyelids drooped as he thought for a moment, suppressing his anger, and slowly shook his head, “This youngster’s background is definitely not simple; it is not wise to create such a strong enemy for the empress. Let’s observe changes and figure out his attitude first.”<br/><br/>A Second Grade being able to kill a First Rank powerhouse on the spot was an unimaginable event.<br/><br/>Master Zhuang had a good understanding of Xing Kun’s strength and because of this, he was more aware of how terrifying the abilities of the young man named Gu Yang could be.<br/><br/>Anyone would be wary. Where did such a formidable genius warrior come from?<br/><br/>His eyes half-closed, a hint of brilliance flashed across them, “Use all available manpower to investigate this person. I want to know everything about him.”<br/><br/>“Yes,”<br/><br/>The man in the shadow responded and then was silent.<br/><br/>Yan Dong Lake, a scenic place within Zhongzhou City, had somehow become a forbidden land over time, prohibiting anyone from approaching casually.<br/><br/>All of Zhongzhou knew that a Sword Saint resided here, a Divine Power Rank pinnacle warrior who hovered high above ordinary beings.<br/><br/>At this moment, Gu Yang had arrived at Yan Dong Lake led by Qian Xiyun. On the way, they encountered no enemies.<br/><br/>Gu Yang finally understood where Qian Xiyun’s confidence to contend for the Four Sea Bank against a mysterious illegitimate child of the Qian family came from.<br/><br/>It turned out she was acquainted with a Sword Saint.<br/><br/>The Asura Sword Saint, a famed killer over two centuries ago, was reputed to draw blood whenever he unsheathed his sword and often slaughtered entire families, which was why he was given the name Asura. It was also said that he once killed an important figure from the Shen family and had been pursued by the Divine Power Rank of the Shen family to the ends of the earth.<br/><br/>Latterly, after entering the Divine Power Realm, battles between him and the Shen family’s Divine Power rank occurred several times. Only after the Shen family suffered some losses did they stop bothering him.<br/><br/>After the Asura Sword Saint reached the Divine Power Realm, he secluded himself. Over time, his deeds gradually became legends.<br/><br/>Gu Yang was surprised that the Shen family’s backer was this notoriously bloodthirsty Sword Saint.<br/><br/>He wondered how the Qian family had connected with him.<br/><br/>However, Gu Yang thought if Qian Xiyun assumed that the Sword Saint would be a reliable support, she was probably heading for disappointment.<br/><br/>If this Sword Saint were truly reliable, how could the Qian family have come to such a state?<br/><br/>Qian Xiyun came to the lakeside, knelt down with a thump, held aloft an ancient jade amulet with both hands, and loudly said, “Descendant of the Qian family, seeking audience with the Sword Saint!”<br/><br/>A few moments later, a figure clothed in white flew over the lake, like walking in the air, crossing a distance of several tens of meters in a blink to land on the shore.<br/><br/>That’s a young woman in white, appearing rather young, but with a cold demeanor akin to an ice block, giving off an unwelcoming vibe.<br/><br/>Her gaze fell on the jade amulet in Qian Xiyun’s hand, she lightly said, “In the past, my master was gravely injured. The kindness of Qian’s ancestor saved his life. The master had gifted this jade amulet to his savior, offering to fulfill three requests. Now there is only one left. Speak your request.”<br/><br/>Only then did Gu Yang learn that there was such a past event between the Qian family and the Asura Sword Saint.<br/><br/>More surprisingly, this bloodthirsty Sword Saint turned out to be a grateful person.<br/><br/>Qian Xiyun said, “I would like to ask the Sword Saint to help in recapturing the Qian family’s foundation.”<br/><br/>The expression of the white-clothed woman didn’t change, she replied, “My master is incapable of this.”<br/><br/>Qian Xiyun turned pale, she then changed her request, “Then I humbly ask the<br/><br/>Sword Saint to lend me a helping hand.”<br/><br/>The woman in white stared at her for a while, then said, “One year, I can protect you for one year.”<br/><br/>“Thank you, ”<br/><br/>Qian Xiyun clenched her teeth and agreed.<br/><br/>She dared not hope too much.<br/><br/>Though one year was short, still a lot could be done.<br/><br/>Next, the woman in white turned to look at Gu Yang. In her icy eyes, a strange light shone, “You are strong.”<br/><br/>Gu Yang humbly replied, “You flatter me.”<br/><br/>This woman was a disciple of the Asura Sword Saint. Just standing there, she gave him a very dangerous feeling.<br/><br/>Her power far surpassed that of the First Rank he encountered before.<br/><br/>The woman in white said, “The Master wishes to see you.”<br/><br/>Gu Yang was stunned, he didn’t expect that the Asura Sword Saint wanted to see him.<br/><br/>Having spoken, the woman in white, taking the lead, leapt up, her toes lightly touching the lake’s surface as she drifted towards a small island at the heart of the lake.<br/><br/>Gu Yang didn’t hesitate much and followed her.<br/><br/>A blessing or a curse, one cannot hide from a curse.<br/><br/>Being a divine powerhouse, if she really wanted to harm him, he wouldn’t be able to escape.<br/><br/>There was a mansion on Lake Heart Island, based on the architecture, it has been there for quite some time.<br/><br/>Gu Yang followed behind the woman in white, heading towards the largest building, feeling somewhat apprehensive. This was his first time meeting a divine powerhouse in reality.<br/><br/>In simulations, every encounter with a divine powerhouse ended badly, often dying without even seeing their true face.<br/><br/>The woman in white stopped in front of a door, reporting respectfully, “Master,<br/><br/>I have brought the person.”<br/><br/>“Let him in.”<br/><br/>An aged voice came from inside.<br/><br/>The door creaked open while the woman in white said,<br/><br/>There was not a hint of light in the room.<br/><br/>When Gu Yang stepped in, he felt a cold gloom.<br/><br/>Finally, he could see the person in the room, an old woman with white hair, frail body, cloudy eyes, and a rotting aura emanating from her, all indicating<br/><br/>that her life was nearing its end.<br/><br/>No matter how he tried, Gu Yang couldn’t associate this decrepit old woman who was about to die with the famous Sword Saint Asura.<br/><br/>He was greatly struck, his heart filled with an unspeakable shock.<br/><br/>Even the once invincible divine powerhouses and the Sword Saint who had the world bowing down to them, cannot withstand the onslaught of time.<br/><br/>Recognizing his shock, the old woman said lightly, “Even a divine power stand is a mortal. When reached the state of Mana, their lifespan is just about 300 years.”<br/><br/>Gu Yang finally came out of his shock, paying his respects, “Junior Gu Yang, greet the senior.”<br/><br/>Even though this old woman appeared to die at any moment, she was still a divine powerhouse. He dared not be complacent.<br/><br/>At this point, he finally understood many things.<br/><br/>Why Qian’s family has fallen to this state, because, this Asura Sword Saint was about to die, no longer able to protect Qian’s family.<br/><br/>“Aren’t you from the Shen family?”<br/><br/>Gu Yang felt a jolt in his heart, “Junior’s surname is Gu, naturally not from the Shen family.”<br/><br/>“I was just curious to see what kind of person can cultivate ‘Phoenix Dance Nine Heavens’ to the Second Grade peak.”<br/><br/>The old woman spoke in a somewhat mocking tone, “The Shen family treasures this skill as a treasure, each generation, picks the most outstanding disciples to cultivate this skill, but no one has been able to cultivate it to First Rank.”<br/><br/>“If the undying old man from Shen family knew about your existence, he would probably vomit blood from anger.”<br/><br/>Gu Yang had already anticipated that his skill would one day be discovered by someone.<br/><br/>Luckily, this Sword Saint before him held a grudge against the Shen family, otherwise, he would be in trouble.<br/><br/>He cupped his hands together, “I request senior to keep it a secret for me.” The old woman suddenly asked, “Do you know why I wanted to see you?”<br/><br/>“Please instruct me.”<br/><br/>“I want to make a deal with you.”<br/><br/>The old woman said without waiting for his question, “I’m about to die, the only thing I can’t let go of is my little disciple. I want her to follow you, to protect her for a few years. As long as you agree, I can pass on a divine secret skill to you.”<br/><br/>Gu Yang thought it odd, “Why doesn’t the senior entrust her to the woman outside, whose strength is far beyond mine?”<br/><br/>“She’s about to get involved in the Qian family’s affairs, destined to face life and death trials, following her could be even more dangerous.”<br/><br/>That’s not necessarily the case.<br/><br/>The trouble Gu Yang carried is not a lesser burden than Qian Xiyun’s.<br/><br/>He asked another question, “Why choose me?”<br/><br/>The old woman said, “You showed commitment by killing an imperial guard for Qian Xiyun’s matter. That is a man who can keep his promise.”<br/><br/>Truly a Sword Saint, with insight.<br/><br/>Gu Yang silently praised in his heart.<br/><br/>The old woman continued, “As long as you agree, no matter what you want, as long as I have it, you can ask for it.”<br/><br/>Gu Yang was moved, instinctively blurting out, “I want money!”<br/><br/>PS: Continue to ask for monthly tickets, still 300 short..\t\t\t\t\t\t</div>", "images": {}, "success": true}