{"id": 93, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297882.html", "title": "Chapter 93 - Chapter 93: 093 Why Is It Him Again? (Seeking First Subscriptions, Seeking Monthly Tickets)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 93 - Chapter 93: 093 Why Is It Him Again? (Seeking First Subscriptions, Seeking Monthly Tickets)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 93: 093 Why is it him again? (Seeking first subscriptions, seeking monthly tickets)<br/><br/>Translator: 549690339<br/><br/>The next morning, when Gu Yang saw Qian Xiyun and Lily, they looked at him with strange eyes.<br/><br/>Qian Xiyun wanted to speak but stopped, as if she wanted to ask something, yet dared not ask. There was a distinct awe in her attitude towards him.<br/><br/>Compared to Gu Yang, her cultivation level wasn’t high, but she lived next to him, separated by a wall, so she could sense any movements from his side.<br/><br/>Last night, at intervals, she could distinctly feel Gu Yang’s True Essence increasing bit by bit. The oppressive momentum that came from him almost suffocated her,<br/><br/>Eleven times in total.<br/><br/>This was terrifying!<br/><br/>As a result, she didn’t get a good rest the entire night.<br/><br/>She had no idea what had happened to Gu Yang that made his power skyrocket overnight.<br/><br/>Considering the shocking matters he had done since he made his debut<br/><br/>She felt that his background was becoming more and more mysterious.<br/><br/>As for Lily, she was both excited and awed. As a sorcerer, she had extremely strong Divine Sense, and understood the changes in Gu Yang even more thoroughly.<br/><br/>In her eyes, this was the awakening of the Phoenix bloodline within the Saint’s body.<br/><br/>The power of the lofty Phoenix God Flame, she had once sensed from the God statue during her promotion to an eighth rank sorcerer, she wouldn’t be mistaken.<br/><br/>The Saint Lord must be sent by the Gods to the human realm. Once his power fully revived, they would use pure God Flame to cleanse this filthy world.<br/><br/>Gu Yang was used to such gaze already.<br/><br/>He knew that when True Essence increased, there would definitely be movement, something he couldn’t control.<br/><br/>Su Qingzhen, Ling Ling, Xu Ruomei had all reacted similar ways, he had gotten used to it.<br/><br/>In any case, as long as his power rose fast enough, even if this matter was exposed, there would be no problems.<br/><br/>“Let’s go.”<br/><br/>He called out and was the first to walk out of the inn.<br/><br/>Qian Xiyun and Lily hurriedly followed, mounted their horses and headed for Zhongzhou City.<br/><br/>Half a day later, they were already within sight of Zhongzhou City.<br/><br/>“Brother Gu, let’s stop for a while.”<br/><br/>Suddenly, Qian Xiyun abruptly stopped her horse.<br/><br/>Gu Yang also stopped and asked, “What’s wrong?”<br/><br/>Qian Xiyun took out two things from her bosom and said, “Frankly, I can’t produce three million taels of silver. This is the transfer agreement of my trading firm in Jingzhou, and this is the seal of the president of the firm. From now on, you will be the owner of this firm.”<br/><br/>“When you go to Jingzhou, look for the head steward of the firm, Yu Shaokang. He will assist you in managing this firm. How you handle it in the future depends on you, Brother Gu. This firm is also worth three to five million taels.” Gu Yang didn’t stand on ceremony with her and accepted the two items.<br/><br/>Qian Xiyun went on, “When we get to Zhongzhou City, if there’s any danger, you may leave at will, Brother Gu. Don’t take risks for my sake.”<br/><br/>Gu Yang looked into her eyes and smiled, “Don’t worry, I value my own life very much and won’t risk it for others.”<br/><br/>Qian Xiyun then turned to Lily, “Once we reach Zhongzhou City, follow Master<br/><br/>Gu. You’ve been helping me for two years. I am the one who owes you a favor.”<br/><br/>Lily held her hand, her face tinged with sadness, and just said two words, “Take care. ” “Let’s go.”<br/><br/>Qian Xiyun tugged her reins, taking the lead towards the city gate.<br/><br/>From the look of it, she had already foreseen the dangers of this trip, yet proceeded without any hesitation. She did not wish to get others involved.<br/><br/>Gu Yang felt some admiration for her in his heart.<br/><br/>There are indeed good people in this world.<br/><br/>Zhongzhou City gate.<br/><br/>A man in his thirties, riding a majestic snow-white horse, was casually walking alongside an elderly man riding a green donkey.<br/><br/>The young man was laughing and asking the old man, “Elder Wu, how do you rate my strength compared to those on the First Rank List?”<br/><br/>The old man riding the green donkey was none other than the investigator from the Red Mansion, Elder Wu. He had come all the way to Pingzhou for inspection since he left Ping County.<br/><br/>Until a few days ago, when he encountered this sticky lad. No matter how he tried to shake him off, the lad stuck to him, insisting he give an evaluation.<br/><br/>How should one appraise him?<br/><br/>This young man’s name is Chen Shilin, a member of the Chen family, one of the nine most distinguished families in the world.<br/><br/>He is currently the youngest First Rank in the world.<br/><br/>He ascended to the First Rank at the age of thirty-one and is now only thirty-three years old.<br/><br/>However, his luck was not always so good. At twenty-one, he was still a Second Grade and thus had no chance to be listed on the Heavenly Genius List.<br/><br/>On the Hidden Dragon List, he was constantly suppressed. From the age of twenty-one to thirty, for a total of nine years, he was always ranked second.<br/><br/>Then, at the age of thirty-one, he achieved the First Rank, surpassing those who used to rank above him and leaving them behind.<br/><br/>Elder Wu helplessly said, “With your talent, if you weren’t in such a rush for quick success, you will certainly have the opportunity to ascend to the First Rank List in the future.”<br/><br/>Chen Shilin was still not satisfied, “What you’re saying is, I am still far behind those on the First Rank List?”<br/><br/>Elder Wu, besieged and unwilling to appease him with false words that might discredit his reputation, finally asked, “Do you want the truth?”<br/><br/>“Of course.”<br/><br/>Elder Wu said, “Among those of the First Rank, there can still be a vast difference in strength. According to one’s strength, they can roughly be divided into four categories.”<br/><br/>“First, ordinary First Ranks whose cultivation methods can only bring them up to First Rank at most. Their learned martial skills also have nothing exceptional. This category also includes those who have just broken through to First Rank.”<br/><br/>“Second, the strong ones among the First Rank who cultivate techniques reaching above the realm of Divine Power. Their martial skills are also quite formidable.”<br/><br/>“Third, the peak of First Rank whose cultivation level has already reached the pinnacle state. The martial skills they’ve cultivated have reached a transcendental level.”<br/><br/>“Fourth, those unparalleled warriors on the First Rank List.”<br/><br/>After Chen Shilin heard his words, his smile faded, and after a moment, he asked, “Why are the people on the First Rank List higher than at the peak of First Rank?”<br/><br/>Elder Wu replied, “The warriors on the First Rank List are cultivating supreme techniques. These divine techniques, mostly passed down from ancient times, have various unique characteristics once mastered. Their combat power is much stronger than those at the peak of First Rank.”<br/><br/>“However, there are pros and cons. For those who cultivate supreme techniques, it is even more difficult to break through to the realm of Divine Power. Look at the First Rank List. It hasn’t changed in ten years. The last time someone on the First Rank List broke through to the realm of Divine Power was twenty years ago.”<br/><br/>Chen Shilin felt as if he had been doused with a bucket of cold water and was a little dejected.<br/><br/>He broke through to First Rank two years ago, according to Elder Wu’s classification, he is still in the first category, mainly because his cultivation level is shallow. He is still a long way from the First Rank List.<br/><br/>Alas, when will he be able to ascend to the First Rank List at this rate?<br/><br/>No, whether he can get on the First Rank List is also a question.<br/><br/>Although he is practicing the supreme technique that is passed down in his family, he took a shortcut during the practice and was able to break through to First Rank so quickly.<br/><br/>With this thought, he felt his life was a bit dull and gloomy.<br/><br/>Does he have no relationship with the top of the list in this life?<br/><br/>As Elder Wu was saying this, he noticed that there was a First Rank in the vicinity, pointing to him, he said, “That is Xing Kun, a member of the internal guards and originating from the military. He has been a First Rank for ten years. His cultivation is the most common ‘Mixed Yuan Skill’ in the military. His ‘Blood Battle Saber Technique’ has also reached a transcendental level. He still belongs to the first category.”<br/><br/>Next, he noticed another individual, pointed to the window of the opposite tavern and said, “That is Lin Liang, the Second Elder of the Lin family. He has been a First Rank for twenty years. Although he cultivates the Lin family’s ‘Sea of Bitterness True Skill’ and the ‘Shadowless Swordsmanship’, due to his limited talent, he has only touched the edge of the second category.”<br/><br/>At this time, Elder Wu’s old habit resurfaced, entering his advisory state. With a shift in thought, he turned his head toward the city gate and saw a carriage bearing the Cao family’s emblem.<br/><br/>He clearly sensed a formidable power sitting in the carriage.<br/><br/>He solemnly said, “The person in the carriage should be Ru Qin from the Cao family, she is the personal maid of the Spear God, her cultivation level is close to the peak of First Rank, in a few more years, she’ll definitely reach the third category.”<br/><br/>As Elder Wu said this, he suddenly realized something was wrong.<br/><br/>Why are there so many First ranks from different forces appearing in Zhongzhou City?<br/><br/>Chen Shilin of the Chen family, Lin Liang of the Lin family in Jiangzhou, Ru Qin of the Cao family…<br/><br/>Plus Xing Kun from the internal guards, all gathering here at the gate of Zhongzhou City.<br/><br/>First rank fighters are all pillars of major forces. Generally speaking, unless there is a major event, they seldom venture into the world.<br/><br/>For First Ranks, cultivation is the most important thing.<br/><br/>A strong premonition suddenly came over Elder Wu. Something major was bound to happen here!<br/><br/>Suddenly, the sound of horse hooves came from outside the city gate.<br/><br/>He turned his head towards the city gate, and soon three people leading horses a man and two women, all of whom he didn’t recognize — came in.<br/><br/>“It’s him!”<br/><br/>Using his unique ability to recognize people, Elder Wu immediately identified the leading man as Gu Yang, whom he had only parted from a month ago.<br/><br/>PS: The next chapter will come before three o’clock. Votes for this month are appreciated..\t\t\t\t\t\t</div>", "images": {}, "success": true}