{"id": 90, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297876.html", "title": "Chapter 90 - Chapter 90: 090 Million Dollar Reward", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 90 - Chapter 90: 090 Million Dollar Reward</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 90: 090 Million Dollar Reward<br/><br/>Translator: 549690339<br/><br/>Gu Yang opened his eyes, looking at a devout Lily kneeling on the ground, he asked, “What is it that you’re doing?”<br/><br/>Lily was clearly a little excited, jabbering in a strange language.<br/><br/>He turned to Qian Xiyun who was standing dumbstruck on the side, asking,<br/><br/>“Can you understand what she’s saying?”<br/><br/>Qian Xiyun looked at him with a peculiar gaze, swallowed, and said, “She seems to mistake you for some kind of ‘holy messenger’ of a sect called the Divine Bird Society. She wants you to return to the West Bank Continent to save their believers or something.”<br/><br/>Upon hearing that, she couldn’t help but ask, “Brother Gu, have you ever been to the West Bank Continent?”<br/><br/>“I haven’t.”<br/><br/>Gu Yang shook his head. He knew the problem likely traced back to his cultivation of the “Phoenix Dance Nine Heavens” technique.<br/><br/>As for this Divine Bird Society, it was probably the Phoenix Society. Qian Xiyun’s translation was slightly off.<br/><br/>He learned from the simulation that Lily had mistaken him for a holy messenger, so he decided to expose his True Essence, and sure enough, she bowed immediately.<br/><br/>He said to Lily, “Get up.”<br/><br/>She only then rose from the ground, her face respectful.<br/><br/>Gu Yang spoke, “I am not some holy messenger, you have mistaken me for someone else.”<br/><br/>However, Lily shook her head, continuing to jabber in her unintelligible language, interspersed with a few phrases in Great Zhou.<br/><br/>Gu Yang kind of understood, she seemed convinced it was him.<br/><br/>He tried to ask her a few questions, attempting to gain a clear understanding of a shaman’s cultivation methods.<br/><br/>Unluckily, due to the language barrier, communication was too difficult.<br/><br/>Qian Xiyun was equally helpless. Regarding the language of the West Bank Continent, she could only manage daily communication. When it came to professional terms, she was equally at a loss.<br/><br/>All Gu Yang could somewhat understand was the concept of ‘meditation.’<br/><br/>It seemed like they could only fully comprehend a shaman’s cultivation method once Lily had thoroughly learned the Great Zhou language.<br/><br/>Qian Xiyun said, “Actually, there are several shamans and mages in Jingzhou who come from the West Bank Continent. There are also a few priests. Their cultivation methods are drastically different from those of Great Zhou. They generally gain magic through meditation and communication with gods or the will of heaven and earth.”<br/><br/>In her words, she didn’t seem particularly impressed with that kind of cultivation method.<br/><br/>The martial arts of Great Zhou always involve introspection. It’s normal not to think highly of methods that involve seeking power from gods.<br/><br/>Gu Yang then asked Lily another question, “Why did you come to Great Zhou?”<br/><br/>Lily just began jabbering once more.<br/><br/>Qian Xiyun translated, “She said, she came here to look for a lost holy scripture.”<br/><br/>A holy scripture?<br/><br/>Couldn’t it be the “Phoenix Dance Nine Heavens” technique, could it?<br/><br/>Just as this thought flashed across his mind, Gu Yang dismissed it.<br/><br/>The “Phoenix Dance Nine Heavens” technique, although mysterious, is a legitimate martial arts technique. It couldn’t possibly originate from a foreign land.<br/><br/>When he further asked where that holy scripture had been lost, Lily shook her head to indicate she didn’t know.<br/><br/>If she didn’t even know where it was, they could only rely on luck now.<br/><br/>Feeling fairly rested, the three of them continued on their way.<br/><br/>This time around, Gu Yang easily gained a little sidekick, though Qian Xiyun did not seem bothered at all.<br/><br/>Afterward, Lily used a disguise spell, altering their appearance. They went into a town and bought three horses to speed up their journey.<br/><br/>In this way, they didn’t have to worry about revealing their identities and they could also gather some information.<br/><br/>Three days later, they arrived at a ferry crossing and saw a tea house by the roadside. Feeling thirsty, they stopped to order three cups of tea.<br/><br/>Conversations from two people in the martial arts world could be heard nearby.<br/><br/>“…Have you heard? The tenth beauty on the Beauty List, Miss Cao of the Cao family, has offered a reward of a million taels for the whereabouts of a man.”<br/><br/>Gu Yang’s action of taking a sip of water paused, his gaze flickering towards the two men.<br/><br/>“Tsk, tsk, truly worthy of being one of the nine prominent families. A start-up reward of a million taels, what a big spender! I wonder if that man is her enemy or her lover.”<br/><br/>“Definitely an enemy. I heard that Cao Yi Yi is quite flirtatious, with countless lovers. She wouldn’t be so hung up on one man…”<br/><br/>“Hush, be quiet. Are you seeking death? If you’re overheard by someone from the Cao family, aren’t you inviting trouble?”<br/><br/>“It’s my mistake…”<br/><br/>“I think that Miss Cao is most likely playing with people. If she really wants to find someone, why doesn’t she give a name or description? How would anyone go about searching?”<br/><br/>“Well, not necessarily. One million taels of silver, all piled up in a courtyard in Bingzhou city…”<br/><br/>Listening up to this point, Gu Yang knew what Cao Yi Yi was planning.<br/><br/>She was spreading rumors, solely to lure him into seeking her out.<br/><br/>She was quite clever, she had quickly found his soft spot – money.<br/><br/>One million taels.<br/><br/>Gu Yang was rather moved, however, since she dared to put out the bait, there must be a trap set. If he really went there, it would be like throwing himself into a trap.<br/><br/>Nevertheless, he made sure to note this down.<br/><br/>Once he was powerful enough, it wouldn’t be too late to take the money.<br/><br/>Following a brief rest, the three continued on their way.<br/><br/>By now, they had left Luo Prefecture and reached Bingzhou.<br/><br/>That night, they rented a room in a city.<br/><br/>At the hour of the Rat, two figures sneaked out of the inn, it was Gu Yang and Lily, clad in black robes.<br/><br/>“Let’s go.”<br/><br/>With a wave of his hand, Lily used the invisibility technique and they vanished without a trace.<br/><br/>Moments later, the invisible Gu Yang and Lily arrived at the Four Sea Bank in the city and jumped straight in.<br/><br/>In no time, they found the vault where the gold and silver were kept and didn’t alert anyone along the way.<br/><br/>Lily cast a spell and opened the vault.<br/><br/>Once they entered, Gu Yang transferred all the gold and silver into the system. His balance, which had only been 430,000, suddenly increased to 570,000.<br/><br/>A full 120,000 taels.<br/><br/>Lily watched, somewhat startled, as the gold and silver disappeared into thin air.<br/><br/>That move possessed no fluctuations of any magical technique.<br/><br/>She thought it was a native magic of Great Zhou, so she didn’t think much of it.<br/><br/>In her mind, it was perfectly normal for a holy messenger to know spells.<br/><br/>Just before he left, Gu Yang wrote a line on the wall, “Borrowing some gold and silver from your vault,” and signed it “Plum Blossom.”<br/><br/>The entire operation didn’t take ten minutes and went very smoothly.<br/><br/>Gu Yang felt exhilarated as he left the bank.<br/><br/>The day he discovered Lily could use an invisibility spell, he had entertained the idea of using it to steal money from bank vaults.<br/><br/>He deliberately exposed his True Essence that day as he had pre-planned everything.<br/><br/>Experience proved that her spell, although a little fancy and not really useful in battles, it was indeed magical in other ways.<br/><br/>While Gu Yang lacked money before, he had never contemplated robbing a bank.<br/><br/>Firstly, he didn’t want to harm too many innocent people.<br/><br/>Secondly, such an act would draw too much attention. In no time, everyone would know that he could make money vanish into thin air, arousing suspicion.<br/><br/>Such a deed had too low a return for its high risks.<br/><br/>But now that he had Lily’s cooperation, it was different. Stealing the silver from the vault would not alert a soul.<br/><br/>Finally, Gu Yang cautioned, “This matter cannot be revealed to anyone, including Miss Qian.”<br/><br/>Lily understood this sentence and nodded solemnly.<br/><br/>PS: Continuing to ask for monthly tickets..\t\t\t\t\t\t</div>", "images": {}, "success": true}