{"id": 92, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297880.html", "title": "Chapter 92 - Chapter 92: 092 Second Grade Peak", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 92 - Chapter 92: 092 Second Grade Peak</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 92: 092 Second Grade Peak<br/><br/>Translator: 549690339<br/><br/>The time turned back several days.<br/><br/>Outside Bingzhou city, there was a manor. Inside the pavilion located in the middle of the lake in the manor, a girl dressed in a tender yellow long dress sat on a long rattan chair, resting her head on her arm. Her black hair fell naturally, accentuating her skin as white as congealed lard.<br/><br/>She was barefoot, hanging in the air, gently swinging. Her fingers unconsciously picked at the rattan chair and before long, she’d picked out a gap.<br/><br/>Just then, a person came to report, saying that someone had come to claim a reward.<br/><br/>The girl didn’t wait for him to finish speaking and impatiently said, “Send the person away.”<br/><br/>The servant went to execute her order.<br/><br/>Behind the girl, a beautiful woman appeared out of nowhere and said, “Yi Yi, you should have had enough of your tantrum by now. The family head has complained to me.”<br/><br/>Although she was accusing the girl, her tone was quite indulgent.<br/><br/>This girl in yellow was Cao Yiyi. She didn’t care and said, “So what if I drew more than a million taels? What’s the big deal about it? My dear little nephew is truly overreacting.”<br/><br/>The “dear little nephew” she spoke of was actually the head of the Cao family.<br/><br/>Her father was a strong person who had reached the level of divine power. She was born after he reached it, hence she had a peculiar standing. The current head of the Cao family had to call her auntie.<br/><br/>The beautiful woman was helpless. She was just a servant to the young lady’s father and couldn’t control this young lady.<br/><br/>Cao Yiyi asked, “Aunt Zhiqin, how is the inquiry going?”<br/><br/>This Aunt Zhiqin was responsible for intelligence in the family, and was the most informed.<br/><br/>Zhiqin said, “This Gu Yang is really bold and reckless. He even dares to meddle in the Qian family’s affairs. On Luo River, he rescued Qian Xiyun from a few assassins.”<br/><br/>Cao Yiyi suddenly asked, “Is this Qian Xiyun beautiful?”<br/><br/>“I’ve seen her once. She can’t be considered extremely beautiful.”<br/><br/>“How does she compare to me?”<br/><br/>Zhiqin looked at her charming and naturally born beautiful appearance, and sighed admiringly, “Naturally, she is far inferior.”<br/><br/>This was her genuine opinion. As for the looks, those who can get into the beauty list are unique beauties.<br/><br/>Cao Yiyi muttered, “Then why does he ignore me and pay more attention to those lowly women?”<br/><br/>Looking at her in this state, Zhiqin advised, “He doesn’t know the value of a gem. You shouldn’t get angry for such a man.”<br/><br/>“No, I want to see what this Miss Qian looks like.”<br/><br/>After Cao Yiyi finished speaking, she stood up and said, “Aunt Zhiqin, take me to Zhongzhou City.”<br/><br/>Zhiqin wanted to discourage her but seeing her stubborn appearance, she softened and couldn’t bear to refuse her request.<br/><br/>In Zhongzhou, a certain manor.<br/><br/>“Chief Zhuang, going by the timing, my sister should be arriving soon.”<br/><br/>In the hall, a tall and handsome man communicated to a well-fed middle-aged man sitting in the main seat.<br/><br/>This gentleman was Qian Xiuyang, the new person in charge of the Four Sea Bank, the illegitimate son of the Qian family who was wandering outside. In his early thirties, he became the head of the Qian family, the world’s richest<br/><br/>family, an overnight success.<br/><br/>The stout middle-aged man sitting in the main seat, was the deputy chief of the royal household department, representing the royal family, specially responsible for supervising the Qian family.<br/><br/>Chief Zhuang said indifferently, “A little girl can’t stir up any waves, there’s no need to worry.”<br/><br/>Qian Xiuyang’s eyes became sharp, “I heard that my sister could survive until now because that person spoke up.”<br/><br/>Chief Zhuang’s expression stiffened.<br/><br/>The atmosphere instantly became serious.<br/><br/>The reason why the Qian family was able to expand the Four Sea Bank to this extent was due to the support of a divine power cultivator.<br/><br/>Qian Xiuyang naturally didn’t care about a little girl, but he had to care about the attitude of that divine power cultivator.<br/><br/>If that person chooses to support his illegitimate sister, even the people in the palace will have to step back.<br/><br/>Chief Zhuang’s hostile gaze flashed by and returned to his harmless appearance. He casually said, “Do you think, without his tacit approval, the finance god would have died so coincidentally?”<br/><br/>Qian Xiuyang bowed slightly and said, “I see, thank you Chief Zhuang for clearing my confusion.”<br/><br/>After speaking, he took his leave.<br/><br/>As soon as he left, Chief Zhuang murmured to himself, “Tell Xing Kun, if that little girl and that reckless boy really dare to come to Zhongzhou City, kill them. ”<br/><br/>“Yes. ”<br/><br/>From the shadows, a voice emerged.<br/><br/>When Chief Zhuang came to Zhongzhou City, he brought along three first-rankers from the internal guard, to suppress the possible opposition that might emerge from the Four Sea Bank.<br/><br/>Xing Kun was one of these first-rankers.<br/><br/>In his opinion, a second-grade kid, even if he’s the first-ranked in the Hidden Dragon List, if he dares come here, Xing Kun is more than enough to handle them.<br/><br/>As for Qian Xiyun, she could be completely disregarded.<br/><br/>Inside the inn, Gu Yang continued.<br/><br/>He had just made a small fortune and was about to convert this money into actual strength through simulation.<br/><br/>[ … When Ling Ling prepares to make a breakthrough into the divine power realm, you, along with Su Qingzhen, Lily, and others, set sail on a large ship. A month later, you encounter a battle between two divine power cultivators, due to which the ship is destroyed and all the people on board die. Final age: forty] Okay, he somehow managed to live for an extra month.<br/><br/>[ … When Ling Ling prepares to make a breakthrough into the divine power realm, you, along with Su Qingzhen, Lily, and others, set sail on a large ship. Two months later, you encounter a battle between two divine power cultivators, due to which the ship is destroyed and all the people on board die.<br/><br/>Final age: forty]<br/><br/>What? I knew I changed the route, so how did I encounter them again?<br/><br/>It’s not right, the timing of the encounter is different. It was a month after sailing last time.<br/><br/>This time, it is two months after starting the journey.<br/><br/>Could it be that they fought that battle for over a month?<br/><br/>Gu Yang was frustrated.<br/><br/>[ … When Ling Ling prepares to make a breakthrough into the divine power realm, you, along with Su Qingzhen, Lily and others, hide on a remote island. Half a year later, the volcano under the island erupts engulfing the island and you die. Final age: forty-one]<br/><br/>Well, finally broke the forty-year-old curse, successfully lived until forty-one.<br/><br/>So, Gu Yang simulated over and over again, attempting to find a way to survive after Ling Ling’s death.<br/><br/>He did a simulation eleven times. The longest time he could survive was just an additional year.<br/><br/>It was really difficult.<br/><br/>Gu Yang gritted his teeth and said, “Again, I don’t believe it.”<br/><br/>[ … Your cultivation level reaches the peak of the second grade…]<br/><br/>[ … When Ling Ling prepares to make a breakthrough into the divine power realm, you, along with Su Qingzhen, Lily and others, go to the Chu family and seek protection from Chu Xiyue. Soon after, Qin Shang, who has already reached the first rank, personally strikes and kills you. Final age: forty] As expected, that path won’t work.<br/><br/>Chu Xiyue might consider past relations, but Qin Shang would never tolerate him.<br/><br/>wait!<br/><br/>Gu Yang suddenly realized something, he looked closely and his heart was thrilled.<br/><br/>Finally, it’s the peak of the second grade!<br/><br/>After reaching the peak of the second grade, would the first grade be far behind?<br/><br/>Gu Yang finally had enough confidence to face the first ranker tomorrow.<br/><br/>PS: The book will go on shelves tomorrow at noon. How many chapters I can update would depend on how many chapters I can write..\t\t\t\t\t\t</div>", "images": {}, "success": true}