{"id": 95, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297886.html", "title": "Chapter 95 - Chapter 95: 095 What Grudges And Resentments (Third Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 95 - Chapter 95: 095 What Grudges And Resentments (Third Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 95: 095 What Grudges and Resentments (Third Update)<br/><br/>Translator: 549690339<br/><br/>Inside the private room of the restaurant, Lin Liang was observing the city gate when he suddenly sensed an astonishing murderous intent that made his hair stand on end, so much so that he nearly drew his sword in response.<br/><br/>However, he quickly realized that this murderous aura was not aimed at him.<br/><br/>“Are there such formidable individuals within Zhongzhou City?”<br/><br/>Lin Liang was still somewhat incredulous.<br/><br/>Zhongzhou is indeed the Qian family’s territory.<br/><br/>However, the Qian family is dwindling in number, and their God of Wealth has also passed away. There were no longer any renowned First Rank strongmen.<br/><br/>He had no idea where this unknown expert comes from.<br/><br/>“But it hardly compares to the one from the Chu family,” he thought.<br/><br/>Lin Liang picked up the wine cup on the table and took another sip.<br/><br/>Shortly after, he felt another formidable aura, carrying a heart-palpitating power, as if it was drawing strength from Heaven and Earth.<br/><br/>He twitched his hand, failing to secure the cup, which fell to the floor and shattered.<br/><br/>“Di… Di… Divine Power?”<br/><br/>Lin Liang was almost scared out of his wits.<br/><br/>This method of harnessing the vitality of Heaven and Earth for personal use is the signature of someone in the Divine Power Realm!<br/><br/>A short distance away, a Divine Power realm master seemed to be about to make a move.<br/><br/>In such close proximity, if he were to be caught in the backlash, he would undoubtedly die.<br/><br/>His shock was far from trivial and he almost turned to flee on the SD0t.<br/><br/>“Hold on!”<br/><br/>But he abruptly came to his senses.<br/><br/>If it were truly a master in the Divine Power realm, wouldn’t there be more commotion?<br/><br/>The aura emitted alone would be enough to leave him wheezing for breath.<br/><br/>Lin Liang once accompanied the head of the family to pay respects to the family ancestors and had the good fortune to meet a Divine Power realm elder. Just one glance from the elder had left his legs wobbly, almost unable to stand firm.<br/><br/>With growing suspicion, Lin Liang turned his gaze towards the source of the mighty aura.<br/><br/>He noticed a youth standing at the city gate, holding a saber in his hand, his aura dominant and unrestrained, stirring the vitality between Heaven and Earth without any wind.<br/><br/>When he saw this, Lin Liang’s eyes bulged, and his mind buzzed.<br/><br/>“Why is it him?”<br/><br/>Although he had never met this youth, he had seen his portrait and had this person’s image deeply etched in his mind.<br/><br/>At a glance, Lin Liang recognized that this youth was the person he had always wanted to kill – Gu Yang.<br/><br/>However, how did he become so powerful?<br/><br/>I thought he was only Second Grade, wasn’t he?<br/><br/>But the youth in front of him even made Lin Liang, a First Rank powerhouse, feel a surge of palpitations.<br/><br/>A warrior’s instinct told him that the other party was extremely dangerous.<br/><br/>“Hmph, he’s just bluffing. A mere Second Grade… Wait till I get my sword… I’ll show him how to send him to his maker!”<br/><br/>As a First Rank strongman, Lin Liang’s pride prohibited him from retreating. He stood up, ready to unsheathe his sword.<br/><br/>Just then, he sensed that the aura of the First Rank person he had felt earlier was actually entwining with Gu Yang’s aura. For a moment, they seemed evenly matched.<br/><br/>“Huh?”<br/><br/>Lin Liang’s eyes lit up.<br/><br/>So, it turned out that the target of the First Rank individual was also Gu Yang.<br/><br/>Overjoyed, he thought, “Excellent, I’ll just be an idle spectator and watch the fight!”<br/><br/>Lin Liang retracted his own aura and quietly observed the situation.<br/><br/>“This is<br/><br/>When Chen Shilin felt the heart-shaking aura emanating from Gu Yang’s body, his pupils constricted, and his expression was somewhat terrified.<br/><br/>Coming from a family with a profound knowledge of martial arts, he naturally knew what this was.<br/><br/>A Second Grade individual had actually managed to master the technique that only a strong person in the Divine Power Realm could grasp.<br/><br/>This was something that even his extraordinarily talented younger brother had not accomplished.<br/><br/>So, who exactly is he?<br/><br/>Even the elder Wuo at his side gasped, “Heavens… he’s actually managed to master this technique as well!”<br/><br/>Having seen Gu Yang in action, he knew that he practiced the “God Destroyer Nine Styles” and naturally guessed which technique Gu Yang had mastered.<br/><br/>The seventh technique, Heaven Swallowing!<br/><br/>The last three techniques of this saber technique could only be mastered upon reaching the Divine Power realm.<br/><br/>Some highly talented individuals could master it at the peak of First Rank, like those on the First Rank list, each of whom had mastered one or two unique techniques.<br/><br/>However, it was unheard of for a Second Grade martial artist to master such a high-level saber technique.<br/><br/>Old Wuo felt that all his half-life experience was useless against Gu Yang. He realized that this person could not be judged by ordinary standards.<br/><br/>“Could it be, this youth is from one of those special places?” In Wu Lao’s heart, a similar thought crossed his mind.<br/><br/>But he dared not delve into it.<br/><br/>If it really were so, the world might fall into chaos once again.<br/><br/>Inside the carriage.<br/><br/>Cao Yi Yi finally saw the figure standing alone at the city gate, He was facing a powerful First Rank individual with no fear, his aura was extremely arrogant.<br/><br/>She could only feel her heart pounding, then suddenly grabbed Ru Qin’s hand, “Aunt Qin, I’ve changed my mind. Wait until he’s half dead before you save him. I want to take my own revenge, Aunt Qin? ‘<br/><br/>Cao Yi Yi turned her head in surprise when she didn’t respond, only to find that she was looking shocked.<br/><br/>“Aunt Qin, what’s the matter with you?”<br/><br/>Cao Yi Yi had never seen such an expression on Aunt Qin’s face, and asked her with some concern.<br/><br/>Ru Qin took a deep breath and said with a complex look in her eyes, “He might not need me to save him.”<br/><br/>Cao Yi Yi was somewhat stunned, “What do you mean?”<br/><br/>Ru Qin said seriously, “Listen to me, from now on, don’t provoke him.” Cao Yi Yi looked at her, somewhat clueless.<br/><br/>Like an experienced hunter, Xing Kun is patient even though his heart is boiling with killing intent.<br/><br/>Knowing that this person has an extraordinary origin, his power must be exceptional.<br/><br/>The descendants of the Holy Land are not that easy to kill, right?<br/><br/>He has only one chance.<br/><br/>He’s waiting for the other party to reveal their weakness. Then strike them with a thunderous blow to finish them off.<br/><br/>Gu Yang saw his opponent’s intentions; he should not be led by the nose and passively take a beating. That’s not his style.<br/><br/>He gave a warning to Qian Xiyun and Lily beside him, then his True Essence inside his body suddenly erupted.<br/><br/>The moment he made a move, it was the strongest one, the seventh technique of “God Destroyer Nine Styles”, the Sky-swallowing technique!<br/><br/>He had only managed to practice this move by simulating the cultivation method of the sorcerer.<br/><br/>The so-called Sky-swallowing technique is about absorbing all the power around him for his use, even some of the opponent’s power can be absorbed and used for himself.<br/><br/>Using this technique, he can mobilize the vitality of heaven and earth, just like a person with Divine Power.<br/><br/>The First Rank individual wished to oppress him with power, forming a cage with his powerful Divine Sense to drain his spirit slowly.<br/><br/>He would respond tit-for-tat, using the strongest technique to shatter the opponent’s plan.<br/><br/>“Damn!”<br/><br/>When the vitality of heaven and earth was stirred up, Xing Kun’s killing intent was shattered instantly, and he couldn’t pinpoint Gu Yang anymore.<br/><br/>He realized things were going wrong, if the other party wanted to escape, he wouldn’t get another chance to kill him.<br/><br/>In an instant, countless thoughts flashed through Xing Kun’s mind.<br/><br/>He thought of the scene when Wu Anhou surrendered…<br/><br/>He thought of the entire city mourning when the former emperor died…<br/><br/>He thought of when Wu Family was exterminated, the whole Yunzhou was reduced to a wasteland, with millions of casualties and countless displaced people…<br/><br/>He thought of the arrogance of the Barbarians on the plains when they invaded, as if there were no people in their way…<br/><br/>Eventually, all these thoughts turned into an indomitable killing intent in his heart.<br/><br/>“Marquis, till next life!”<br/><br/>Xing Kun silently muttered a sentence, and the imperial gift, the Treasure Sword in his hand was unsheathed, at the same time, his aura kept surging, and the Gang Yuan in his body kept mounting.<br/><br/>This is a saber technique that Wu Anhou imparted to him, Gambler’s Ruin!<br/><br/>Every subordinate of Wu Anhou, when facing a desperate situation, will use this technique, so the enemy too will perish with him.<br/><br/>In order to kill Gu Yang, he was even ready to sacrifice his own life.<br/><br/>The change in Xing Kun immediately caught the attention of several people on the scene.<br/><br/>Everyone watching was shocked.<br/><br/>“This—Gambler’s Ruin?”<br/><br/>Chen Shilin was taken aback and completely dumbfounded.<br/><br/>He couldn’t figure out why this first rank of Nei Wei wanted to end his own life so much.<br/><br/>To kill a second grade, he even resorted to Gambler’s Ruin.<br/><br/>Could there be a deep hatred between the two?<br/><br/>Wu Lao had a somewhat complex expression.<br/><br/>As he had always been in the Divine City, he knew about the integrity of Xing Kun and could more or less guess his intentions.<br/><br/>He could help but sigh, “What a pity-”<br/><br/>PS: The next update will be out before twelve o’clock, seeking monthly tickets..\t\t\t\t\t\t</div>", "images": {}, "success": true}