{"id": 99, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297894.html", "title": "Chapter 99 - Chapter 99: 099 Ancient Fairy Gate Map (Third Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 99 - Chapter 99: 099 Ancient Fairy Gate Map (Third Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 99: 099 Ancient Fairy Gate Map (Third Update)<br/><br/>Translator: 549690339<br/><br/>It was still the same luxurious mansion.<br/><br/>A wealthy middle-aged man sat in his grand master’s chair, flipping through an intelligence report. The content was not long, and he quickly finished reading.<br/><br/>His brow furrowed, “After all this investigation only this much has been found?”<br/><br/>The shadow was silent.<br/><br/>The middle-aged man rubbed his forehead hard, seemingly talking to himself,<br/><br/>“The first appearance was in Tianshui City, by the Lian Mountain…Lian<br/><br/>Mountain…”<br/><br/>Suddenly his hand paused, and he said, “send someone to investigate everything about Lian Mountain.”<br/><br/>This time, a response came from the shadow. “Yes.”<br/><br/>The middle-aged man continued to murmur, “Su Qingzhen, Xu Ruomei, Chu Xiyue… It seems this person has a fondness for beauty; this will make things easier…”<br/><br/>Quickly, a plan formed in his mind.<br/><br/>That night, within the Zhongzhou City, the most popular geisha Yuan Zhen Zhen went to the Qian Mansion, requesting to see Gu Yang.<br/><br/>Yuan Zhen Zhen, originally belonged to the entertainment department of Divine City. Later, she was bought by a brothel in Zhongzhou with a hefty price and became the top billing star. Even at this year’s Geisha Contest, she was the undisputed champion.<br/><br/>No one knew her real identity – a spy of the Secret Service.<br/><br/>Originally, she was banished to the entertainment department as a punishment. If not for the arrangements of the secret service, how could she be released by the entertainment department?<br/><br/>Spies like her were scattered to various parts of the world by the Secret Service to monitor all activities.<br/><br/>Yuan Zhen Zhen, draped in a cloak, removed it only after entering the drawing room, revealing her true appearance.<br/><br/>When Gu Yang saw the actual person behind the famous geisha, he was somewhat disappointed.<br/><br/>Even though she was beautiful and had an exceptional demeanor, her appeal fell somewhat short when compared to the women listed on the ‘Beauty List’.<br/><br/>Without a doubt, the ‘Beauty List’ was the epitome of female charm in this world.<br/><br/>Among the women he had seen, those on the ‘Beauty List’ were truly unmatched.<br/><br/>The geisha before him was beautiful indeed. However, compared to Su Qingzhen, she lacked pride; compared to Cao Yiyi, she lacked a certain charm; and compared to Xu Ruomei, she lacked coldness. Compared to Chu Xiyue, she lacked sensuality.<br/><br/>Of course, Gu Yang didn’t show his thoughts on his face and curiously asked,<br/><br/>“Miss Yuan, I wonder what brings you here?”<br/><br/>Having been trained from a young age in a place like the entertainment department and now living in a brothel Yuan Zhen Zhen had become adept at reading men.<br/><br/>The moment she met this man’s gaze, she quickly sensed that he had no interest in her.<br/><br/>She was immensely surprised. Wasn’t it said that this man had a fondness for beauty?<br/><br/>With this new realization, her face remained expressionless as she politely bowed, “Actually, I am here on behalf of someone else to ask you a few questions.”<br/><br/>She abandoned her usual charm and directly stated her intention.<br/><br/>In the past, she had encountered men who had ignored her beauty. In such cases using coquettish charm would only create dislike.<br/><br/>Just as expected, Gu Yang’s interest was piqued when he heard her. He asked in response, “May I know on whose behalf you are here?”<br/><br/>Yuan Zhen Zhen seemed to be in a difficult position and said, “Please don’t make things difficult for me.”<br/><br/>“Alright, I won’t ask.”<br/><br/>“Is Sir truly planning to wade into the muddy waters of the Qian family?”<br/><br/>Upon hearing this, Gu Yang was able to guess who had sent her and thought to himself, so they finally made a move.<br/><br/>He asked with a grin, “Are you here to mediate, Miss?”<br/><br/>“I am merely a woman of the street, and I don’t have such qualification, I am simply here to test the waters.”<br/><br/>Gu Yang thought she was quite clever to openly state her mission. He asked in return, “What do you think?”<br/><br/>“These past few days, Miss Qian has been repeatedly meeting people from two trading firms. It seems she is interested in their shares. I boldly guess, she is working for you, isn’t she?”<br/><br/>Gu Yang applauded, “You are clever.”<br/><br/>He didn’t deny it. Qian Xiyun’s actions couldn’t be hidden. This world wasn’t short of smart people; it wasn’t surprising someone would figure out her actions.<br/><br/>Seizing this moment, Yuan Zhen Zhen said, “If sir is willing to leave Zhongzhou City, I am willing to mediate on your behalf and ensure that you receive a fair price.”<br/><br/>Gu Yang shook his head, “That isn’t enough. Miss Qian and I… we’ve faced life and death together.”<br/><br/>“What does Sir mean?” “You need to pay more!”<br/><br/>“He wants money?”<br/><br/>Back in that luxurious mansion, the middle-aged man was surprised after getting Yuan Zhen Zhen’s report.<br/><br/>In his perception, this was almost like giving him an exit.<br/><br/>To a warrior, money was useless.<br/><br/>However, this seemingly insignificant matter had become a thorny issue.<br/><br/>The reason why a certain person from the palace ventured to launch an action against the Qian family while the Sword Saint was still alive was for the money in the Four Sea Bank. The filial branches of Four Sea Bank were spread throughout the Great Zhou empire and their vaults were filled with a tremendous amount of money. It was an unimaginably huge sum.<br/><br/>Originally, the empress intended to withdraw a portion of the bank reserves. But the old man resisted it relentlessly, showcasing a stoic resistance.<br/><br/>That was his path to doom.<br/><br/>Now, both the Qian Family and the Four Sea Bank had fallen into the hands of the Secret Service. The reserves belonging to the Qian family and the Zhongzhou branch of the Four Sea Bank were transferred out.<br/><br/>In other words, he didn’t have money at his disposal now.<br/><br/>How was he going to satisfy Gu Yang’s demands?<br/><br/>Such a headache.<br/><br/>The Empress has just given instructions, asking him not to entangle himself further with Gu Yang, lest important matters be disrupted.<br/><br/>It seems that even the Empress is somewhat wary of this man.<br/><br/>He muttered quietly, “It looks like I can only find another way to make money…”<br/><br/>Zhongzhou City may lack in many things, but wealthy people are plenty.<br/><br/>Two days later, Gu Yang sold his shares in those two firms, netting a total of three million taels.<br/><br/>He had never been as wealthy as he was now, and his mood was excellent.<br/><br/>By cashing out all these taels and selling off Qian Xiyun’s firm, he would have more than enough to reach the First Rank.<br/><br/>Miss Yuan is indeed reliable in her work.”<br/><br/>Upon receiving the money, Gu Yang highly praised Yuan Zhen Zhen’s efficiency.<br/><br/>The shares, originally worth two million taels, sold for three million taels. This premium surely demonstrated the sincerity of the power behind her.<br/><br/>Yuan Zhen Zhen stated, “I hope the master will keep his promise.”<br/><br/>Gu Yang smiled, saying, “Rest assured, inform those behind you that I will be leaving tonight.”<br/><br/>He had no intention of staying in Zhongzhou City for long.<br/><br/>Over these days, seeing Qian Xiyun running into walls everywhere, he suspected she could hardly combat his cheap elder brother.<br/><br/>Given Qian Xiyun’s character, she would hardly give up the struggle, and it was sure to get more intense in the future.<br/><br/>Gu Yang didn’t want to get involved.<br/><br/>His connection with Qian Xiyun was, after all, just worth three million taels.<br/><br/>Just as Gu Yang was about to leave, he suddenly heard Yuan Zhen Zhen suggest, “I wish to make a private deal with the master.”<br/><br/>He asked with interest, “What deal?”<br/><br/>Yuan Zhen Zhen took out something from her person and stated, “This is a map, a family heirloom, passed down from the ancient times. My father spent over a decade and consulted countless books before finally locating the place signified on the map. According to my father’s speculation, this should be the dwelling of a clan from an ancient Immortal Sect.”<br/><br/>An ancient Immortal Sect’s dwelling?<br/><br/>Gu Yang was genuinely interested, but what he was more curious about was,<br/><br/>“What do you wish to exchange this map for?”<br/><br/>Yuan Zhen Zhen stated, “I have a younger brother who works as a lowly servant in the Martial Academy of Divine City. I only ask that the master take him away from Divine City, liberate him from his servant’s status, and teach him a martial art for self-defense. With that, I would be content.”<br/><br/>“Weren’t you afraid that I would take the item and disregard your brother?”<br/><br/>“Master brought Miss Qian from her home to Zhongzhou City, and his righteous act of killing Xing Kun, a First Rank, has already been spread throughout the world. I have faith in the master.”<br/><br/>So it turns out that having a high reputation has its benefits.<br/><br/>Gu Yang stated, “Alright, I’ll assist with this. What’s your brother’s name?”<br/><br/>For him, this wasn’t a difficult task.<br/><br/>After all, he had to go to the Divine City anyway.<br/><br/>“Thank you, master, his name is Yuan An. He went to the Academy five years ago. There’s a red birthmark on his left arm.” After speaking, she handed the map to Gu Yang.<br/><br/>True to his word, Gu Yang left Zhongzhou City that day with Lily and Han Mengling. The three of them each rode a horse, vanishing into the royal road.<br/><br/>With his departure, many people in Zhongzhou City let out a sigh of relief.<br/><br/>As was the usual practice on the return journey, Gu Yang kept changing his banknotes into taels and recharging them into the system.<br/><br/>However, this time, he felt something was wrong.<br/><br/>Four Sea Bank seemed to be starting to run out of taels.<br/><br/>When he wanted to change several tens of thousands of taels, the bank manager said he would have to wait a couple of days.<br/><br/>Almost every bank was like this. There was a problem.<br/><br/>After ten days, he went to more than a dozen places and was only able to exchange more than six hundred thousand taels.<br/><br/>“That doesn’t make sense. Including my previous exchanges and the money I stole earlier, it’s only a few million taels. I couldn’t have cleaned out Four Sea<br/><br/>Bank, could I?”<br/><br/>Gu Yang felt there was a problem.<br/><br/>He suspected that the more likely cause was the internal struggle in the Qian family.<br/><br/>At this, Gu Yang couldn’t sit still. If Four Sea Bank were to collapse, these banknotes would become worthless.<br/><br/>He was not in a hurry to meet up with Chu Xiyue and the others. He took some detours, visited more banks, and completed the exchange of three million seven hundred thousand taels in banknotes into cash, and recharged them into the system after spending a month.<br/><br/>The balance in the system reached the figure of three million nine hundred thousand.<br/><br/>Still, Gu Yang was a bit worried, “I didn’t expect that I’d start suffering from a shortage of money before reaching the First Rank. It seems that in the future when collecting money, it’s better to take cash instead of banknotes.”<br/><br/>With a sufficient balance, that night, Gu Yang took a bath, burned incense, activated the Simulator, and planned to strive for the First Rank Realm in one go.<br/><br/>[Do you want to use the Life Simulator? Use it once, consume 100,000 money.]<br/><br/>“Yes.”<br/><br/>[At twenty-two, you are already Second Grade in Cultivation Level. In Zhongzhou City, you kill Xing Kun, a First Rank, with a single stroke of your sword, shocking the world. You are hailed as the top person at the Second Grade.]<br/><br/>[A month later, Yi Yi, ranked first on the list of Heavenly Prodigies, challenges you. After more than a dozen moves, your opponent is on the verge of death by your sword. At the border of life and death, he breaks through to the First Rank Realm, executes the unique skill of the Heavenly Saint Gate, and kills you on the spot at the age of twenty-two.]<br/><br/>PS: Some people asked for progress updates. Well, the average subscription just passed six thousand. Thanks for everyone’s subscription support. Also, thanks to the brothers who tipped, and of course, thank you to those who voted with monthly passes.<br/><br/>Three updates will continue tomorrow, same time. Lastly, please give your monthly votes..\t\t\t\t\t\t</div>", "images": {}, "success": true}