{"id": 103, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297902.html", "title": "Chapter 103 - Chapter 103: 103 A Smooth Path (Request For Monthly Tickets)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 103 - Chapter 103: 103 A Smooth Path (Request For Monthly Tickets)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 103: 103 A Smooth Path (Request for Monthly Tickets)<br/><br/>Translator: 549690339<br/><br/>Under the night sky a crescent moon hung like a hook, its image distorted as it reflected on the calm river surface.<br/><br/>The boat quietly drifted downstream.<br/><br/>In a certain room, Chu Xiyue suddenly woke up from her meditation, her gaze shifting towards a particular direction in bewilderment.<br/><br/>Just now, she felt Gu Yang’s aura rapidly weakened.<br/><br/>Her heart lurched, and she abruptly stood up, preparing to inspect the situation.<br/><br/>At this moment, a hand landed on her shoulder.<br/><br/>“Don’t, he’s cultivating.”<br/><br/>Recognizing her aunt’s voice, Chu Xiyue paused, “Cultivating?”<br/><br/>“He is practising the Shen Family’s “Phoenix Dance Nine Heavens”.”<br/><br/>Chu Xiyue replied, “The legendary martial skill stolen by the Shadow thief a century ago? I can’t believe he managed to obtain it. But, why is he in such a state? Could he be demonized?”<br/><br/>The voice in the dark said, “No. ‘Phoenix Dance Nine Heavens’ is an extremely special martial prowess. Every time you break through a realm, you must go through a rebirth and start your training from scratch.”<br/><br/>“What?”<br/><br/>Chu Xiyue muttered in bewilderment, “So, you are telling me to reach the first rank, one has to start over nine times?”<br/><br/>She had never heard of such a method before.<br/><br/>“Exactly, moreover, it’s extremely slow to cultivate this martial technique. Over one thousand years, only the most outstanding disciples of the Shen Family had the chance to cultivate this technique. Yet no one has ever cultivated it to the first rank.”<br/><br/>“I can’t wait to see the look on the face of that old monster from the Shen Family when he learns that a stranger in his twenties has cultivated this technique to the second grade. He’d have a heart attack.”<br/><br/>Her tone was full of schadenfreude.<br/><br/>Chu Xiyue finally understood, “So Brother Gu has gone through a rebirth?”<br/><br/>“Right, after going through a rebirth, his cultivation level will revert back to ninth grade—wait, no, why is he in the sixth grade?”<br/><br/>The shadowy figure spoke, suddenly exclaiming in surprise.<br/><br/>In the same breath, the aura in the adjacent room started growing again.<br/><br/>This time, the figure in the dark was thoroughly baffled, “Fifth grade? How is this possible?”<br/><br/>From Gu Yang’s rebirth to him returning to the fifth grade, it only took a few breaths.<br/><br/>No one in this world could cultivate at such a rapid speed.<br/><br/>While she was still in awe, the aura over there started to surge again.<br/><br/>Almost every few breaths, it ascended a grade.<br/><br/>The room was entirely silent; the only sounds left were two heavy breaths.<br/><br/>Fourth Grade…<br/><br/>Third Rank…<br/><br/>Second Grade…<br/><br/>When Gu Yang broke through to the second grade again, the woman in the shadow was completely paralyzed.<br/><br/>After a bit, his aura reached a peak.<br/><br/>Boom!<br/><br/>In every person’s sight on the boat, there emerged a soaring phoenix bathed in red flame.<br/><br/>This spectacle was so stunning that all the boatmen thought they had seen a divine creature, each falling to their knees, not daring to move.<br/><br/>Only Chu Xiyue, Wu Xingyun, Xu Ruomei, and those coming from major powers understood what this vision meant.<br/><br/>This phoenix was the manifestation of Gu Yang’s martial arts will. Its appearance signified his official entry into the first rank realm.<br/><br/>Wu Xingyun was shocked, “First rank!”<br/><br/>Xu Ruomei was confused, “First rank?”<br/><br/>Han Mengling muttered to herself, “First rank—”<br/><br/>Lily was incredibly excited, “%&amp;*# …”<br/><br/>“He reached the first rank …”<br/><br/>After the spectacle had faded, Chu Xiyue whispered in the room.<br/><br/>In the shadow, her aunt Chu Yinxing was too shocked to speak.<br/><br/>He’s reached the first rank?<br/><br/>Wasn’t it said that no one could ever cultivate “Phoenix Dance Nine Heavens” to the first rank?<br/><br/>Were all the heirs of the Shen Family good for nothing?<br/><br/>What she found most unacceptable was that his martial will was already so refined, as if it had taken on a life of its own, indicating a solid foundation. It would be a smooth journey for him when he reached the Divine Power realm in the future.<br/><br/>Chu Yinxing had been in the first rank for more than ten years, yet she had not managed to refine her martial will to such an extent.<br/><br/>She has been stuck at her current bottleneck for several years now.<br/><br/>If she can’t break through this bottleneck, her cultivation level might never progress again in her lifetime.<br/><br/>Therefore, seeing a Second Grade cultivator easily advanced to the First Rank, then surpass her, the enormous blow was indescribable.<br/><br/>Chu Yinxing knew clearly that even though Gu Yang’s strength still fell short when compared to hers at present, given some time for him to cultivate his attributed energy, surpassing her would simply be a matter of time.<br/><br/>The one who felt devastated was not only Chu Yinxing.<br/><br/>Chu Xiyue and Wu Xingyun were the ones who felt the most hit.<br/><br/>When they first encountered Gu Yang two months ago, he was just at the Third Rank, yet with a single stroke, defeated both of them, almost leaving a shadow on their hearts.<br/><br/>In just a few days, Gu Yang had broken through to Second Grade.<br/><br/>This could still be understood as the result of his previous accumulation.<br/><br/>Now, in less than two months, Gu Yang had already stepped into the First Rank realm.<br/><br/>Such a rate of cultivation was simply like a legend.<br/><br/>Not to mention them, even those prodigies listed in the Hidden Dragon List, the one who stayed the longest, ranking first, Yi Yi, has been on the list for ten years.<br/><br/>The Hidden Dragon List is the most special among many rankings. Although it has age restrictions, it would not disqualify even if the age limit is exceeded.<br/><br/>There are only two circumstances leading to disqualification from the list, one is breakthrough to the divine realm, and the other is death.<br/><br/>The rankings in the Hidden Dragon List are arranged in the order of listing, and once listed, the ranking will not change unless someone is disqualified from the list.<br/><br/>If someone can’t break through to the divine realm for a long time, they can stay on the list for decades.<br/><br/>Ten years ago, when Yi Yi was listed, he was in the Second Grade, and now, he is still in the Second Grade.<br/><br/>Many legendary techniques, the higher the realm, the harder it is to break through. Similarly, once the breakthrough is made, the foundation is even stronger.<br/><br/>Just because of this, Gu Yang, in only two months, moved from Third Rank, skipping Second Grade, directly into First Rank. This was truly shocking to hear.<br/><br/>Aboard the boat, many people feel as if they are in a dream, hardly believing it is real.<br/><br/>Among all the people, Su Qingzhen and Zhang Xiao Hai were the calmest ones. The two longest-serving members of Gu Yang’s team merely opened their eyes to take a glance when they noticed the commotion, then continued with their cultivation.<br/><br/>This kind of thing, after all, is not a first for them.<br/><br/>It is just a simple maneuver.<br/><br/>…<br/><br/>When the Phoenix flew back into Gu Yang’s body, he slowly opened his eyes, a horrifying light gleaming in his pupils.<br/><br/>“Is this the First Rank?”<br/><br/>As he looked down at his own palm, he saw a clump of True Essence condensing in the palm of his hand, sensing the terrifying power within.<br/><br/>After reaching the First Rank, the True Essence in the body transforms into attributed energy, truly becoming an invincible force able to even destroy refined steel.<br/><br/>Reaching this state, one can truly be referred to as a formidable human weapon. Even when faced with armies armored from head to toe, no one can block until the True Essence has been exhausted.<br/><br/>If one really wanted to escape, an ordinary army simply would not be able to stop him.<br/><br/>The true power of the First Rank goes beyond this.<br/><br/>Without even lifting his head, Gu Yang could clearly perceive the situation within several meters around him, even if a mosquito flew past from behind, he could sense it immediately.<br/><br/>He had a feeling that the space within several meters around him was his domain, which he could control at will.<br/><br/>Gu Yang closed his fist, and his person had already calmed down.<br/><br/>“Just like that, it’s not enough,” he thought to himself.<br/><br/>He opened the system again and a prompt popped up.[Do you want to use the life simulator, one use will cost 500000 coins.]<br/><br/>500 thousand!<br/><br/>Gu Yang took in a sharp breath.<br/><br/>This is absurd, this is only the First Rank, wouldn’t it cost millions if he reached the divine realm?<br/><br/>At this rate, thinking about reaching the Celestial Being realm, probably all the precious metals in the world wouldn’t be enough for him to use.<br/><br/>Right now, his remaining balance is only 600 thousand, enough for just one use.<br/><br/>He sighed, saying, “Yes.”<br/><br/>Actually, he didn’t have a choice. With his current strength, naturally, he isn’t afraid of that Yi Yi.<br/><br/>The key is the person in the divine realm behind Yi Yi. If they were to interfere, then it would really be a problem.<br/><br/>[Twenty-two years old, you have reached the First Rank realm, ranked first in the Hidden Dragon List, shocking the world.]<br/><br/>[You bid farewell to Chu Xiyue and others, and with Su Qingzhen and Lily going to Divine City to join the Imperial Guard, you become the deputy commander of the Imperial Guard.]<br/><br/>[Afterward, you wander around Divine City, seeking to spar with others, to hone your saber technique. Often visiting the Sword Saint for advice, your mastery of the saber technique is progressing day by day.]<br/><br/>[Eight years later, a rebellion broke out in Jiangzhou, and you were ordered to suppress it…]<br/><br/>PS: Still short of two hundred monthly votes, brothers, charge!\t\t\t\t\t\t</div>", "images": {}, "success": true}