{"id": 104, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297904.html", "title": "Chapter 104 - Chapter 104: 104 Cross Over This Threshold", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 104 - Chapter 104: 104 Cross Over This Threshold</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 104: 104 Cross over this threshold<br/><br/>Translator: 549690339<br/><br/>“…One year later, you finally faced the rebel army in a decisive battle. You and Su Qingzhen joined forces, killed the bandit leader on the spot, and quelled the rebellion.”<br/><br/>“You performed a great meritorious service and was titled as the Duke of Pingjiang and became the chief of the Imperial Guard.”<br/><br/>“Nine years later, you received an order to lead four first-rank martial artists to hunt down Ling Ling, the top of the first-rank list.”<br/><br/>“On the way, you and Su Qingzhen launched a surprise attack and killed all four first-rankers, then rushed to join Ling Ling.”<br/><br/>“Ling Ling began to breakthrough to the Celestial Being realm. Just as success was in sight, a sudden change occurred. A Celestial Being strongman arrived. You and Su Qingzhen teamed up to block him.”<br/><br/>“Moments later, Ling Ling officially entered the Celestial Being realm, repelling the strongman. Then, you three retreated.”<br/><br/>“The same year, the Qin family launched a military campaign against Great Zhou. The situation was quite unfavorable. When they were about to attack Divine City, Luo Wang, the Sea-steadying God Needle of Great Zhou, appeared and started a earth-shattering battle with the ancestor Qin Wu of Qin family.”<br/><br/>“Both Qin Wu and Luo Wang had entered the Celestial Being realm. The intense battle sent the world into chaos. Suddenly, two more celestial beings joined the battle.”<br/><br/>“Under the final strike of the four Celestial Beings, an ancient seal was shaken and opened a passage to another world. From then on, the Star Luo Sect from that Hollow World began to invade in large numbers.”<br/><br/>“You, Su Qingzhen, and Ling Ling hid on a small island in the East Sea. Ten years later, Su Qingzhen reached the Celestial Being realm, drawing the attention of disciples from the Star Luo Sect. You were chased and eventually caught. In the ensuing battle, you all perished on the spot at the age of fifty.”<br/><br/>It was not easy to surpass forty and live to fifty.<br/><br/>Gu Yang felt somewhat relieved.<br/><br/>However, what on earth was the Star Luo Sect?<br/><br/>Hollow World…<br/><br/>What happened to the promised world of martial arts?<br/><br/>The plot has suddenly changed.<br/><br/>Even four Celestial Beings could not stop the Star Luo Sect? How strong is this sect?<br/><br/>Gu Yang couldn’t speculate much useful information from this simulation.<br/><br/>Never mind, he wouldn’t think about it anymore.<br/><br/>Anyway, that is something that would happen almost twenty years from now.<br/><br/>“The simulation has ended. You can retain one of the following.”<br/><br/>“First, your martial arts realm at the age of fifty.”<br/><br/>“Second, your martial arts experience at the age of fifty.”<br/><br/>“Third, your life wisdom at the age of fifty.”<br/><br/>Without hesitation, Gu Yang chose the second.<br/><br/>This simulation was to hone his saber technique.<br/><br/>Joining the Imperial Guard was for the same purpose. The queen could arrange for him to learn from a Celestial Being. Divine City had many first-rankers, and with the identity of Vice Chief of the Imperial Guards, he could spar with them without worry of foul play.<br/><br/>Even though the secret realm in Tianzhu Mountain was nice and safe, he and Su Qingzhen were the only two there, and their progress in Saber Technique was limited when working in isolation.<br/><br/>The next moment, countless martial arts moves and combat experiences emerged out of thin air in Gu Yang’s mind.<br/><br/>He was completely immersed in the ocean of martial arts knowledge and entered a state of self-immersion.<br/><br/>The gains this time far exceeded his imagination.<br/><br/>When he was part of the Imperial Guard, he sparred with many first-rank strongmen. Even after leaving the Imperial Guard, he still had Ling Ling, a Celestial Being, by his side.<br/><br/>For twenty-eight years, his saber technique had transformed and reached a new level.<br/><br/>Gu Yang closed himself off for precisely three days.<br/><br/>In the houseboat, no one disturbed him. Even when people spoke, they instinctively lowered their voices for fear of disturbing him.<br/><br/>In Divine City, the continuous rain had finally cleared up.<br/><br/>Early in the morning, two young men with impressive auras appeared outside the Martial Arts Academy.<br/><br/>These were Qin Shang, the son of the Qin family, and Gu Yunfei, a member of the Gu family in Divine City.<br/><br/>Seeing a number of people standing by the leaderboard, they said, “These people are probably gathering information and news.”<br/><br/>Gu Yunfei explained, “Over the past few months, the leaderboard has changed several times. Some people, bored beyond belief, have sent their servants to keep watch. If there’s any change, news would reach them immediately.”<br/><br/>Qin Shang nodded in understanding, “I see.”<br/><br/>Gu Yunfei laughed, “They’re wasting their efforts. Typically, the leaderboard only changes every one or two years. However, recently there’s been a freak event: the leaderboard has changed three times in just a few months.”<br/><br/>Speaking of this ‘freak’, Qin Shang’s expression became complex.<br/><br/>Being of Second Grade and slicing a First Rank!<br/><br/>The news, when it arrived in Divine City a month ago, caused an uproar.<br/><br/>When Qin Shang first heard about it, his first reaction was disbelief.<br/><br/>Currently at the peak of the Second Grade and cultivating an inherited legendary technique, he considered his strength to be nearing the peak of the Second Grade.<br/><br/>He knew very well how much of a gap there was between the Second Grade and the First Rank.<br/><br/>Above the Second Grade was the First Rank!<br/><br/>Only his family’s ancestor had such a record.<br/><br/>But who was his family’s ancestor? He was at the peak of the Divine Power realm, a being who had half a foot in the Celestial Being realm.<br/><br/>Could he be compared to ordinary people?<br/><br/>With the return of Elder Wu from the Red Mansion to the Divine City, the details of that battle had finally spread.<br/><br/>Even Qin Shang had to believe it. The Red Mansion had a remarkable reputation. If Elder Wu had seen it with his own eyes, it could not be false.<br/><br/>Only then did he realize how ridiculous his previous thoughts were, and how far he was from reaching the limit of the Second Grade.<br/><br/>However, no matter how he thought about it, he couldn’t understand how Gu Yang, while at the Second Grade realm, had mastered a Saber Technique of the Divine Power realm level?<br/><br/>Lately, the name Gu Yang had been frequently brought up in front of Qin Shang, each time making him feel somewhat uncomfortable.<br/><br/>Gu Yunfei noticed the gloomy expression on his face and, realizing his slip of the tongue, quickly changed the subject, “Brother Qin, you are leaving the Divine City so soon, why not stay a bit longer?”<br/><br/>Gu Yunfei naturally knew why Qin Shang detested Gu Yang so much.<br/><br/>Lately, there were rumors that Chu Xiyue and Gu Yang had been sailing together, appearing like a pair of lovers.<br/><br/>As Chu Xiyue’s fiance, it would be a surprise if Qin Shang didn’t harbor resentment towards Gu Yang.<br/><br/>Qin Shang replied, “My father has matters to attend to, so I must return home.”<br/><br/>This trip, he had come to bid farewell to the Dean of the Martial Arts Institute. Upon arrival, he visited the Dean first, and now, he had made it a point to bid him farewell.<br/><br/>It was clear the Dean held a great position in his heart.<br/><br/>Both of them were having a casual chat when they suddenly heard a commotion. They instinctively looked towards the rankings list and saw a familiar old man limping over.<br/><br/>It was the old man who was responsible for changing the rankings list, carrying a new list under his arm.<br/><br/>Simultaneously, both of them had the same thought in their minds, ‘Could it be that the list is being updated again?’<br/><br/>Next, they saw the old man walk to the Hidden Dragon List.<br/><br/>It was the Hidden Dragon List again!<br/><br/>Gu Yunfei subconsciously said, “Could it possibly be him?”<br/><br/>“Absolutely impossible.”<br/><br/>Qin Shang reflexively responded.<br/><br/>A change in the Hidden Dragon List meant either someone’s ranking had risen, that someone had elevated in their cultivation level or that they had died.<br/><br/>The latter was already first, and as for improving his cultivation level, no one thought in that direction. How long had it been since he broke into the Second Grade?<br/><br/>Unless, he had died!<br/><br/>Both their eyes were locked on the limping old man, watching as he slowly removed the old list, put on a new layer of paste, and finally, affixed the new list.<br/><br/>With their keen vision, they could clearly see the characters on the list from over ten meters away and quickly scanned it.<br/><br/>“Eh, the rankings haven’t changed——Hiss——”<br/><br/>Gu Yunfei spoke and suddenly drew in a sharp breath.<br/><br/>On the list, the rankings had not changed at all.<br/><br/>The only change was that Gu Yang, who was at the top, had advanced to the First Rank.<br/><br/>First Rank?<br/><br/>He had reached First Rank?<br/><br/>Qin Shang stared at that list unremittingly. Those two characters, “First Rank”, were so glaring. Suddenly, his mind went blank.<br/><br/>In the end, his myriad thoughts condensed into one question— how was this possible?<br/><br/>At the heart of the Divine City, the core of the Great Zhou’s rule, the Imperial Palace.<br/><br/>The Divine City was so named because of the existence of this palace.<br/><br/>As recorded in history, this place has always been the location of the palaces of successive dynasties, the true center of imperial power.<br/><br/>Wuji Temple was one of the main halls in the palace.<br/><br/>Next to it was a warm pavilion called the Fengxi Pavilion, where the Empress handled daily affairs.<br/><br/>A long string of pearl curtains separated the interior from the outside world.<br/><br/>Behind the pearl curtain, a figure of majestic grace was seated on a soft couch. She opened a note in her hand, glanced at it, casually crumbled it into dust, and after a moment, let out a weary sigh, “First Rank ah…”<br/><br/>PS: We’re still 100 votes short, begging for your monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}