{"id": 102, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297900.html", "title": "Chapter 102 - Chapter 102: 102 First Rank (Seeking Monthly Tickets)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 102 - Chapter 102: 102 First Rank (Seeking Monthly Tickets)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 102: 102 First Rank (Seeking Monthly Tickets)<br/><br/>Translator: 549690339<br/><br/>“You’ve just entered the outskirts of the Yin Ruins, when you encounter a deranged man who mutters something unintelligibly and suddenly attacks you. You die at the age of twenty-two.”<br/><br/>Deathly ground ranked first among the five deadliest places; it’s not a joke.<br/><br/>After seeing this result, Gu Yang had no choice but to change his goal and start the simulation again.<br/><br/>“…You encounter a terrifying beast and are torn to pieces. You die at the age of twenty-two.”<br/><br/>“… You trigger a prohibition, instantly turning into dust. You die at the age of twenty-two.”<br/><br/>“… You are trapped inside forbidden grounds, find no way out, and starve to death after a few months. You die at the age of twenty-two.”<br/><br/>“… You are struck and killed by a falling meteorite. You die at the age of twenty-two.”<br/><br/>“… As soon as you approach the tomb of the sword, a blade intent comes from the sky and kills you. You die at the age of twenty-two.”<br/><br/>…<br/><br/>Gu Yang felt numb. He had tried simulating five times, and each time he died in peculiar ways.<br/><br/>These forbidden lands were indeed very dangerous.<br/><br/>By the sixth time, he stared at the prompt asking “Would you like to use the Life Simulator?” but didn’t make a selection.<br/><br/>Gu Yang had a premonition that the other forbidden lands were just as dangerous.<br/><br/>This path probably wasn’t going to work out.<br/><br/>“What should I do now?”<br/><br/>He glanced at his balance of 2.4 million.<br/><br/>At this moment, he felt as if he was in a desperate situation.<br/><br/>“I can’t find refuge anywhere and there are enemies all around. Finding a place where a divine power realm can’t sense me is hard.”<br/><br/>Gu Yang sighed and carefully pondered over the resources at his disposal.<br/><br/>That’s right!<br/><br/>Suddenly, he remembered something and took out a silky handkerchief still fragrant from his bosom.<br/><br/>This handkerchief was a gift from Yuan Zhen Zhen, the courtesan at Zhongzhou City. She claimed that it was a map marking the location of an ancient immortal sect.<br/><br/>When he got it, he stuffed it casually into his bosom without giving it much thought.<br/><br/>He didn’t doubt the authenticity of the map; he just didn’t feel powerful enough, so he didn’t plan on exploring the sect anytime soon.<br/><br/>“Perhaps, I can give it a try.”<br/><br/>Gu Yang unfolded the handkerchief and carefully examined it.<br/><br/>The map had been recently drawn on the handkerchief, likely copied from Yuan Zhen Zhen’s memory, and indicated the location of the sect.<br/><br/>“This place is in Jiangzhou, specifically Tianzhu Mountain outside Jiangzhou City…”<br/><br/>Gu Yang committed the map to his memory. After making sure there was no error, he once again accessed the system.<br/><br/>“Do you want to use the Life Simulator? It costs 100,000 money per use.”<br/><br/>“Yes.”<br/><br/>“At the age of twenty-two, you are already a Second Grade martial artist, ranking first on the Hidden Dragon List, killing a First Rank with a single strike, and you’re recognized as the top among the Second Grade.”<br/><br/>“After reuniting with Chu Xiyue and others in Luo River, you bid them farewell the next day and travel alone to Jiangzhou. A few days later, you arrive at Tianzhu Mountain.”<br/><br/>“You reach the main peak of Tianzhu Mountain and, using the couplet from the map, you bypass the mountain peak’s prohibition and enter a secret realm.”<br/><br/>“You explore the secret realm and gradually discover that there are many powerful creatures here that don’t attack you spontaneously.”<br/><br/>“After a month, you found a cave dwelling. Despite using all methods, you couldn’t open the gate and had to give up.”<br/><br/>“You started to find a way out of the secret realm. After a month, you failed and decided to undergo Nirvana, reducing your cultivation level to the Nineth Rank.”<br/><br/>“You cultivated in the secret realm, eating fruits from the forest when you were hungry and drinking spring water from the mountain when you were thirsty. Days turned into years.”<br/><br/>“Four years later, you advanced to the Eighth Grade realm.”<br/><br/>“Another six years passed, and you advanced to the Seventh Grade realm.”<br/><br/>“Another ten years passed, and you advanced to the Sixth Grade realm.”<br/><br/>“A month later, a crack suddenly appeared in the sky, and a person broke into the secret realm, discovered you, and killed you with a casual sword strike. You die at the age of forty-three.”<br/><br/>Success!<br/><br/>Gu Yang felt ecstatic.<br/><br/>It turns out that there’s no such thing as an impossible path to take.<br/><br/>The map Yuan Zhen Zhen gave him was real, and it indeed led to an ancient mystical realm of the Immortal Sect. Even the Divine Power of the Heavenly Saint Sect couldn’t find that realm.<br/><br/>Moreover, he survived for twenty-one full years within it.<br/><br/>That was three years longer than when he was with Ling Ling.<br/><br/>For him, the place was undoubtedly a treasure spot.<br/><br/>And Gu Yang’s cultivation speed in the mystical realm was much faster than outside.<br/><br/>Originally, advancing from the Nineth to the Eighth grade took five years; now it only took four.<br/><br/>Originally, advancing from the Eighth to the Seventh grade took eight years; now it only took six.<br/><br/>That was a bit faster.<br/><br/>This was all before Su Qingzhi had joined him.<br/><br/>Perhaps because the vitality within the mystical realm was plentiful or because the fruits he ate weren’t ordinary, his cultivation in the realm was faster.<br/><br/>Overall, it was a great place for cultivation.<br/><br/>“The simulation ends now. You can choose to retain one of the following.”<br/><br/>“First, martial arts realm at forty-three years old.”<br/><br/>“Second, martial arts experience at forty-three years old.”<br/><br/>“Third, life wisdom at forty-three years old.”<br/><br/>“I choose the first.”<br/><br/>The next moment, Gu Yang felt as if the vast True Essence within him collapsed, his cultivation level rapidly decreasing.<br/><br/>A tremendous feeling of weakness gave him a strong sense of insecurity.<br/><br/>He took a deep breath, suppressed his unease, opened the system, and continued the simulation.<br/><br/>“…You take Su Qingzhi with you to Jiangzhou, arrive at Tianzhu Mountain, bypass the prohibition, and enter the secret realm where you both settle down.”<br/><br/>“After that, you and Su Qingzhi focus on cultivation.”<br/><br/>“Sixteen years later, you advance to the Fifth Grade realm.”<br/><br/>“Four years later, one day a crack appears in the sky, a person breaks into the realm, discovers you both, and with a casual wave of a sword, kills you both. You die at the age of forty-three.”<br/><br/>Good, Fifth Grade now.<br/><br/>Let’s do this again.<br/><br/>Next, Gu Yang went through the simulation time after time. After the ninth time, he finally returned to the Second Grade realm.<br/><br/>Having regained his powerful strength, he felt a sense of stability he had never experienced before.<br/><br/>After losing this strength and training to regain it, that is a kind of tempering in and of itself, isn’t it?<br/><br/>Practising this “Phoenix Dance Nine Heavens”, having to go through it nine times, is a bit concerning indeed.<br/><br/>Next will be the First Rank, just a matter of time now.<br/><br/>Gu Yang didn’t delay, continuing with the simulations.<br/><br/>The tenth time, the eleventh time…<br/><br/>Until the sixteenth time.<br/><br/>[…You and Su Qingzhen cultivate in the Secret Realm.]<br/><br/>[Nineteen years later, one day, Su Qingzhen advanced to the First Rank realm, inadvertently opening the door of that cave dwelling and entering it. She obtained the legacy of the “Ice Soul Divine Light Sword” and an Ice Soul Divine Sword.]<br/><br/>[Another year later, one day, a person broke into the Secret Realm and found that the cave dwelling was opened. They targeted both of you, and you and Su Qingzhen fought together, but you were no match for the opponent. You died on the battlefield at the age of 43.]<br/><br/>She actually advanced to the First Rank before me.<br/><br/>Gu Yang was startled,<br/><br/>You know, what Su Qingzhen is cultivating is the most ordinary “Xuan Yuan Method”. It only took her nineteen years to cultivate to the First Rank. Such talent is really a defiance of the heavens.<br/><br/>Undeniably, she is the rumored seed of cultivation from ancient times.<br/><br/>Of course, it was inseparable from his assistance.<br/><br/>If it wasn’t for his daily cultivation with her, she wouldn’t have advanced to the First Rank so quickly.<br/><br/>[Simulation ends, you can keep one of the following.]<br/><br/>[One, Martial Arts realm at the age of 43.]<br/><br/>[Two, Martial Arts experience at the age of 43.]<br/><br/>[Three, life wisdom at the age of 43.]<br/><br/>This time, Gu Yang hesitated for a moment, first glanced at his remaining balance which was 800,000 and gritting his teeth he thought, let’s see how your fortune is.<br/><br/>He said, “I choose two.”<br/><br/>A moment later, a legacy appeared in his mind, precisely the “Ice Soul Divine Light Sword”.<br/><br/>Gu Yang breathed a sigh of relief.<br/><br/>His bet was that Su Qingzhen would pass his legacy to him.<br/><br/>Otherwise, this simulation would be a sheer waste.<br/><br/>“Ice Soul Divine Light Sword”, a peerless Divine Power that directly points to the Celestial Being realm, and what’s more important, it matches Su Qingzhen’s constitution exceptionally well.<br/><br/>That’s probably why she was able to open that cave dwelling.<br/><br/>In the future, Gu Yang can pass this sword technique back to Su Qingzhen, her cultivation speed will definitely be faster.<br/><br/>If she can advance to the Divine Power realm sooner, that would be even better. Another powerful fist… no, a helper.<br/><br/>Next, Gu Yang initiated the seventeenth simulation.<br/><br/>[…You and Su Qingzhen got to the Secret Realm and began to cultivate earnestly.]<br/><br/>[You passed the “Ice Soul Divine Light Sword” to Su Qingzhen, ten years later, she advanced to the First Rank realm. Opened the cave dwelling and took out the Ice Soul Divine Sword.]<br/><br/>[Another ten years, one day, someone broke into the Secret Realm, found the cave dwelling opened, and targeted you both. Su Qingzhen fought with him, not falling behind. Suddenly, the person changed targets and attacked you. Concerned for your safety, Su Qingzhen let down her guard and was killed by a sword strike. You died, at the age of 43.]<br/><br/>Seeing the last sentence, Gu Yang felt indescribable awkwardness.<br/><br/>At the end, he actually became the one holding them back.<br/><br/>The once passive Su Qingzhen, twenty years later, became so fierce, even facing a Celestial Being realm opponent without losing ground.<br/><br/>By that time, she must have been not far from the Divine Power realm.<br/><br/>How the tables have turned in just twenty years!<br/><br/>[Simulation ends, you can keep one of the following.]<br/><br/>This time, no need to consider, just choose one directly.<br/><br/>Gu Yang’s True Essence increased once again, this time surpassing the previous one by a large margin.<br/><br/>He had a feeling that he would reach First Rank very soon.<br/><br/>It seems that after Su Qingzhen’s cultivation surpasses his, he can benefit greatly too.<br/><br/>“Let’s go again.”<br/><br/>The eighteenth simulation.<br/><br/>[…Fifteen years later, you advanced to the First Rank realm…]<br/><br/>[…You died at the age of 43.]<br/><br/>Gu Yang only saw that one sentence, his heart was exceptionally excited.<br/><br/>Finally , the First Rank.<br/><br/>It really wasn’t easy.<br/><br/>This could be said as the toughest one yet, he was almost chased down by Yi Yi, the top genius on the list.<br/><br/>If it weren’t for the map that Yuan Zhen Zhen gave him, he almost had nowhere to go.<br/><br/>Now, everything is in the past.<br/><br/>[Simulation ends, you can keep one of the following.]<br/><br/>[One, Martial Arts realm at the age of 43.]<br/><br/>[Two, Martial Arts experience at the age of 43.]<br/><br/>[Three, life wisdom at the age of 43.]<br/><br/>Gu Yang without hesitation, “I choose one.”<br/><br/>First Rank, here I come!<br/><br/>PS: Looking at the monthly ticket list, only 500 votes differ from the sixth place. It is said that the top six in the new book monthly ticket list can get a bonus of 5000. With only seven days left before the end of this month, I hope everyone can lend me a helping hand.\t\t\t\t\t\t</div>", "images": {}, "success": true}