{"id": 109, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14300033.html", "title": "Chapter 109 - Chapter 109: 109 I Am Scared", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 109 - Chapter 109: 109 I Am Scared</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 109: 109 I am scared<br/><br/>Translator: 549690339<br/><br/>In a certain town in Ba County.<br/><br/>A courtyard, originally belonging to the Liu family, was now empty. Blood spots remained on the ground yet there were no corpses in sight. The things in the house were fairly tidy, and it didn’t look like it had been plundered.<br/><br/>Gu Yang found it strange, but didn’t bother wondering what had transpired here. So, he decided to stay here for the night.<br/><br/>In reality, many of the Liu family members were scattered throughout various towns in Ba County. It would not be feasible to kill them all, and he didn’t want to waste his time and effort.<br/><br/>He needed to quickly head towards Jingzhou, to take over Qian Xiyun’s business. That was the priority.<br/><br/>If Qian Xiyun didn’t manage to hold out in Zhongzhou and died, then over three million taels would be wasted.<br/><br/>After nightfall.<br/><br/>In a small courtyard, Chu Xiyue, garbed in a light dress, was sitting in front of a bronze mirror, combing her long hair, her eyes reflective in the mirror as she pondered something.<br/><br/>“You should return home now.”<br/><br/>Suddenly, Choi’s voice, Chu Yinxing, resounded in the quiet yard.<br/><br/>Chu Xiyue showed no reaction and continued combing her hair.<br/><br/>“Your mother already knows that you’ve mobilized the family’s forces to kill the Liu family.”<br/><br/>Chu Xiyue’s action paused for a moment, and then said slowly, “As the future family head, do I need to ask my mother to kill a few minions?”<br/><br/>Chu Yinxing asked in a deep voice, “Who are you trying to kill off the remaining members of the Liu family for?”<br/><br/>“You’ve been traveling with Wu Xingyun for more than a year, and you’ve never done such a thing for him.”<br/><br/>“Xiyue, don’t forget, you’re engaged to the Qin Family.”<br/><br/>Chu Xiyue replied with defiance in her eyes, “And if I refuse to marry?”<br/><br/>Chu Yinxing sighed silently, “The ancestor has already decided and accepted the proposal.”<br/><br/>Chu Xiyue’s face instantly lost color.<br/><br/>“You should know about the ancestor’s temper. If she finds out that you rejected the Qin family for a man…” Chu Yinxing finished her sentence abruptly.<br/><br/>Knock, knock—<br/><br/>“Miss Chu.”<br/><br/>Gu Yang’s voice echoed from outside.<br/><br/>Chu Xiyue put down her comb, put on a coat, and went outside to open the door.<br/><br/>Gu Yang stood outside, holding two bottles of wine in his hands. He asked, “Do you want to have a drink?”<br/><br/>“Sure.”<br/><br/>The two of them sat at a stone table in the yard.<br/><br/>Gu Yang felt today’s Chu Xiyue was very different from normal, no longer carrying her usual arrogance and sharpness, she seemed particularly fragile.<br/><br/>He could roughly guess what was going on.<br/><br/>Her troubles most likely revolved around her arranged marriage with the Qin family. According to the results of the simulations, she was ultimately unable to resist the family’s arrangements.<br/><br/>This was awkward.<br/><br/>Initially, Gu Yang had come to find her to inquire about King Jinghai. Now, considering her current mood, it was not a good time to ask.<br/><br/>After clinking their cups together, they drank some wine.<br/><br/>Gu Yang was unsure how to start the conversation.<br/><br/>However, Chu Xiyue spoke first, “Do you know about the origins of the Qin family?”<br/><br/>Gu Yang shook his head.<br/><br/>“Five hundred years ago, when the Qin Dynasty collapsed, brave men pressed in from all sides. Eventually, the Zhao family emerged as the strongest and seized control. After the fall of Qin, a prince emerged. With his cultivation level bordering on divine, he rose to prominence within decades. Even the numerous divine cultivators of the Great Zhou couldn’t compare with him.”<br/><br/>“However, The Zhao family already controlled everything. This person had several failed assassination attempts in the Divine City. He then renamed himself Qin Wu, adopted the surname of the Qin Dynasty, and established the Qin family.”<br/><br/>“At that time, a crucial member of our Chu family was a general under the Great Zhou dynasty. He died under Qin Wu’s Bright Moon Sabre. Our ancestor sought vengeance but was terribly beaten and even had the Bright Moon Sabre snatched away.”<br/><br/>Upon hearing this, Gu Yang couldn’t help but exclaim about the formidable character of Qin Wu.<br/><br/>So, the grievances between the Qin and Chu families started from this.<br/><br/>Chu Xiyue continued, “Since I was a child, I swore that I would trample the Qin family in the future, retrieve the Bright Moon Sabre, and wash away the disgrace of our family…”<br/><br/>Upon saying this, she downed her glass in one go, her face showing the depths of her bitterness.<br/><br/>Gu Yang couldn’t help but sigh.<br/><br/>Looking at the eventual outcome, once Chu Xiyue was married off to the Qin family, the Chu family would lose face.<br/><br/>The Chu family was sure to become the laughingstock of the world.<br/><br/>This also showed that the Bright Moon Sabre was of great importance to the Chu family.<br/><br/>Gu Yang didn’t know how to console her. This was not a situation where he, an outsider, should have intervened.<br/><br/>Half a moment later.<br/><br/>Chu Xiyue finished a pot of wine and stood up to take her leave, “I apologize for my inappropriate conduct after drinking, Brother Gu must have found it amusing.”<br/><br/>“No matter.”<br/><br/>“Tomorrow, I will be leaving. I bid you farewell in advance, Brother Gu. Take care.” Having said that, she gracefully left.<br/><br/>Watching her retreating figure, Gu Yang was left stunned.<br/><br/>That wasn’t supposed to happen.<br/><br/>“There must be a problem somewhere again.”<br/><br/>Returning to his own small yard, Gu Yang realized that something must have gone wrong due to the butterfly effect after his actions against the Liu family.<br/><br/>According to the past few simulations, Chu Xiyue should have accompanied him to Jingzhou, and would only leave about a year later.<br/><br/>However, this time the flapping of butterfly wings had unexpectedly affected Chu Xiyue, which was completely out of his consideration.<br/><br/>How could his extermination of the Liu family affect Chu Xiyue?<br/><br/>Their relationship couldn’t even be linked with the proverbial eight-pole stick.<br/><br/>But, Gu Yang knew very well that every time he made a fortune, it would attract trouble.<br/><br/>And this time was probably no exception.<br/><br/>Just as he opened the system, he heard footsteps outside.<br/><br/>It was Su Qingzhi.<br/><br/>The door was pushed open from the outside with a creak.<br/><br/>Su Qingzhi came in carrying a basin, from which white steam arose.<br/><br/>She walked straight to the bed, put the basin down to the ground, squatted down and began helping Gu Yang take off his boots.<br/><br/>Gu Yang said, “There’s no need for this, you’re no longer my maid.”<br/><br/>Su Qingzhi didn’t say a word, she also took off his other boot, letting her actions speak for her.<br/><br/>Then, she placed his feet into the basin and started washing them with a towel.<br/><br/>As Gu Yang felt her fingers scrubbing between his toes, a sensation both pleasant and ticklish spread, reminding him of their first meeting. He chuckled, “A few months ago, on Lian Mountain, I could not have dreamed that you’d be washing my feet.”<br/><br/>Even during the time when she officially served as his maid, he had not this treatment.<br/><br/>Su Qingzhi suddenly stopped what she was doing.<br/><br/>With a few splashes, tears fell into the basin of water.<br/><br/>Gu Yang softly said, “I told you, there’s no need for you to do these things.”<br/><br/>“I swore that whoever helped me take revenge for my family, I would serve him like an ox or a horse for life.”<br/><br/>Su Qingzhi pressed her face against his knee, her voice choked with emotion, “Brother Gu, I know I am weak, these are the only things I can do for you, don’t despise me…”<br/><br/>Gu Yang felt slightly moved.<br/><br/>For her to be able to say such words, it must have taken a lot of courage.<br/><br/>He raised her chin, looked at her tear-streaked face and said, “Who says these are the only things you can do?”<br/><br/>Feeling extremely embarrassed, Su Qingzhi’s face flushed a deep red. Holding tightly onto his pants, she stammered, “B…Brother Gu… I… I’m scared…”<br/><br/>“There’s nothing to be afraid of, it’s just training. Today, I will teach you a technique. Be diligent in practicing it. In a few years, you’ll be able to help me.”<br/><br/>“Huh?”<br/><br/>“Get up. Listen carefully…”<br/><br/>Gu Yang then imparted her the first layer of the technique of the ‘Ice Soul Mysterious Light Sword’ that he had obtained from the Secret Realm.<br/><br/>More than an hour later, Su Qingzhi sat cross-legged at the foot of the bed and started practicing.<br/><br/>Seeing her like this, Gu Yang was quite pleased.<br/><br/>With her aptitude, she should be able to succeed in practicing quickly. This technique was in perfect harmony with her physique. According to the simulations, she should be able to reach the First Rank within ten years.<br/><br/>Gu Yang let her practice in the room, closed his eyes and opened the system.<br/><br/>[Would you like to use the Life Simulator? Use it once for a cost of 500,000 gold.]<br/><br/>“Yes.”<br/><br/>[At the age of 22, you have attained the first rank in cultivation and have made a name for yourself across the world. You killed Liu Zhe in Ba County and wiped out the entire Liu Family.]<br/><br/>[The next day, Chu Xiyue parted ways with you and floated away.]<br/><br/>[Half a month later, you were attacked by a First Rank powerhouse. After intense fighting, knowing that you were no match, you managed to escape…]<br/><br/>PS: Today’s first update came a bit late, couldn’t help it. The weather is too cold to get up in the morning, why wouldn’t it be late? Please vote for support.\t\t\t\t\t\t</div>", "images": {}, "success": true}