{"id": 101, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297898.html", "title": "Chapter 101 - Chapter 101: 101 Five Dangerous Places (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 101 - Chapter 101: 101 Five Dangerous Places (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 101: 101 Five Dangerous Places (Second Update)<br/><br/>Translator: 549690339<br/><br/>[ …you confessed your feelings to Chu Xiyue, and soon, you both were spending sweet moments under the moon…]<br/><br/>[A month later, Yi Yi, ranked first on the Idol’s Parade, appeared and challenged you… You died at the age of twenty-two.]<br/><br/>As expected, that doesn’t work.<br/><br/>After seeing the results of this simulation, Gu Yang couldn’t help but sigh.<br/><br/>Last time, when the First Rank from the Lin Family almost caught up with him, something frightened him and he ran away. At that time, Gu Yang suspected that there was a First Rank from the Chu Family nearby, likely Chu Xiyue’s protector.<br/><br/>It has to be said, the protectors of these core disciples from major forces are all cruel-hearted and impartial. They don’t care about anyone’s life or death except for their own disciples.<br/><br/>Even if it’s their disciple’s lover.<br/><br/>To be more precise, for the First Rank of the Chu family, he would rather Chu Xiyue’s lover Die sooner.<br/><br/>After all, there’s an engagement between Chu Xiyue and the Qin Family.<br/><br/>This path doesn’t work.<br/><br/>[ …you, along with Chu Xiyue and others, rushed to Jingzhou at the fastest speed. While planning for Wu Xingyun’s meeting with the King of Jingzhou, Yi Yi, the number one person on the Idol’s Parade, appears… You died at age twenty-two.]<br/><br/>Unfortunately, there is not enough time.<br/><br/>The path of seeking protection from King Jingzhou doesn’t work either.<br/><br/>[ …you go to Divine City and actively contact the interior guard and, in exchange for joining them, you seek their protection…]<br/><br/>[Two years later, while you were carrying out a mission, Yi Yi, ranked first on the Idol’s Parade, appeared before you… You died at the age of twenty-two.]<br/><br/>With the power of the royal family, he could only survive for two more years.<br/><br/>And, for Gu Yang, surviving these two years is meaningless. Will the interior guard still protect him after his nirvana and when his power has dropped?<br/><br/>The answer is no.<br/><br/>So this path doesn’t work either.<br/><br/>[ …you brought Han Mengling and Lily back to Zhongzhou City to meet with the<br/><br/>Asura Sword Saint. Upon reaching Yan Dong Lake, you found her as a corpse.]<br/><br/>[You take out the “Asura Sword Technique” to understand it, but you can’t grasp it. You ask Han Mengling for advice, only to learn she hasn’t practiced the technique and you have to figure it out yourself.]<br/><br/>[A month later, Yi Yi, the number one on the Idol’s Parade shows up in front of you… You died at the age of twenty-two.]<br/><br/>The Asura Sword Saint actually died this quickly. Gu Yang was thinking if he could get her assistance.<br/><br/>Why is it so difficult to find a patron?<br/><br/>Looks like he must try a different approach.<br/><br/>[ …After converging with Chu Xiyue and others, you said goodbye to Chu Xiyue. You and Su Qingzhen and the other ladies went to Jingzhou, took a ship and left Great Zhou.]<br/><br/>[Several months later, a figure fell from the sky, it was Yi Yi from the Idol’s Parade… You died at the age of twenty-two.]<br/><br/>Does this also not work?<br/><br/>Seeing how Yi Yi appeared had left Gu Yang dumbfounded.<br/><br/>Running off to the open sea and your adversary still can arrive from the sky, how can this be?<br/><br/>But he could be certain of one thing. The reason Yi Yi could locate him was because a Divine Power ranked powerhouse was assisting him.<br/><br/>Otherwise, a person of First Rank couldn’t fly. Even if they knew where Gu Yang was, it wouldn’t be possible for them to chase him out to sea.<br/><br/>Gu Yang felt a heaviness in his heart. Could it be that there really would be no escape?<br/><br/>“No, even beings with Divine Power are not omnipotent. Joining the interior guard allows them to hesitate, drawing it out until two years later, just to give them an opportunity.”<br/><br/>“So, I just need to go to a place where even those with Divine Power can’t find.”<br/><br/>As Gu Yang’s thoughts reached this point, a succession of realization flooded his mind.<br/><br/>Soon, he had a plan.<br/><br/>For instance, attempting to travel to those famous Forbidden Lands. There has to be a place where not even Divine Power beings could perceive.<br/><br/>He glanced at the system balance, he had just enough for thirty more simulations.<br/><br/>The next morning, Gu Yang took Lily and Han Mengling and abandoned their horses. Each holding a lady’s hand, they hurried in the direction of Luo Prefecture.<br/><br/>Lily and Han Mengling were both puzzled by his sense of urgency but didn’t have a chance to ask why.<br/><br/>Along the way, Gu Yang pushed his speed to the extreme, akin to the wind racing against electricity.<br/><br/>Two days later, they arrived at Luo River. They spent half a day locating their houseboat on the river, successfully regrouping with Chu Xiyue and her companions.<br/><br/>Chu Xiyue and the others found it strange to see Gu Yang bring back Lily and an additional innocent and delightful little girl.<br/><br/>Without waiting for them to enquire, Gu Yang arranged for Lily and Han Mengling to have their rooms, then pulled Chu Xiyue and Wu Xingyun to one side, inquiring about the forbidden lands in Great Zhou; places even those at Divine Power realm dare not approach easily.<br/><br/>“Forbidden Lands?”<br/><br/>Wu Xingyun curiously asked, “Why does Brother Gu ask about this?”<br/><br/>Seeing Gu Yang’s apparent urgency, Chu Xiyue chimed in, “If we’re talking about places where even Divine Power realm disciples dare not tread, there are only five infamous ones.”<br/><br/>“The first is Yin Ruins located in the core of Great Zhou. Rumour has it that it’s the vein of a ancient emperor. A great war turned the area into ruins, rendering it a dead zone.”<br/><br/>“The second is the Valley of Dead Souls, located at the far west of Great Zhou. A year-round black death aura shrouds it, even disciples who are at the Divine Power realm will be contaminated if they stay there for too long. Rumour has it that the main branch of the Heavenly Corpse Sect of the Six Big Sects resides there.”<br/><br/>“The third is the Ghost Sea, located on the coast of the southern sea. From ancient times, not a single person that entered had made it out alive. No one knows what lies therein.”<br/><br/>“The fourth is Thunder Cliff, located at the far eastern tip. It’s said that the cliffs are continuously struck with thunder with not a single strand of grass thriving within a hundred miles. Humans who dare to approach doom themselves to be electrocuted, even those at the Divine Power realm would be too overwhelmed to handle.”<br/><br/>“The fifth is the Divine Abyss, the most mysterious of the deadly lands. It doesn’t have a fixed location and can appear anywhere. Once you fall into it, you’ll never be able to get out.”<br/><br/>After hearing, Gu Yang felt that out of these five deadly lands, only Yin Ruins were somewhat liveable. The other four lands either led to near-certain death or nobody knew where they were located at all.<br/><br/>He asked, “Are there any other places?”<br/><br/>Wu Xingyun named a few other places. Although they weren’t as dangerous as the notorious five, they were all recorded in Wuyuan Academy’s scriptures.<br/><br/>Gu Yang memorised each name.<br/><br/>Finally, Wu Xingyun smiled, “Actually, there are two other places: the Tomb of Wu’s Swords and the Sword Palace. These two places were once regarded as forbidden lands. Later, they were claimed by Wu and Sword Palace.” Gu Yang’s interest was piqued, “What’s so special about these two places?”<br/><br/>Wu Xingyun said, “Rumours have it that Tomb of Wu’s Swords and Sword Palace are forbidden areas left by ancient fairy doors. Each individual who enters them will have to endure a test. Whoever passes the test may acquire a divine weapon. However, should one fail, it spells certain death.<br/><br/>Unfortunately,outsiders are barred from entering these two places.”<br/><br/>Gu Yang asked, “Wasn’t the Wu Family exterminated? Who has claimed the Tomb of Wu’s Swords now?”<br/><br/>“It should be some strong person from the royal family,” Wu Xingyun replied.<br/><br/>Gu Yang has finally heard from others that the Wu Family was exterminated by the royal family, and he didn’t find it surprising at all.<br/><br/>There were very few institutes in the world who have the ability to exterminate the Wu Family. It wasn’t difficult to guess who it could be.<br/><br/>And Ling Ling was a survivor of the Wu Family.<br/><br/>During a previous simulation, Ling Ling barely succeeded at attempting the Divine Power realm. An unknown Divine Power realm force strangled Ling Ling behind the scenes and left behind a comment, “A descendant of the Wu family”, which was clear evidence.<br/><br/>Also, the martial art method she gave him, “Heavenly Elemental God Slaying Art”, belonged to the Wu Family, which was another piece of evidence.<br/><br/>Curious, Gu Yang asked, “Back then, why did the royal family want to exterminate the Wu Family?”<br/><br/>Spending so much time together, Wu Xingyun has long understood that Gu Yang lacks common sense in many areas and wasn’t surprised when Gu Yang asked such questions. He said, “Because a Divine Power realm expert from the Wu Family killed the Great Zhou Emperor and wiped out his dozens of children, over a hundred concubines, everyone was killed.”<br/><br/>Over a hundred concubines?<br/><br/>Good heavens, can he even manage?<br/><br/>Gu Yang’s focus was drawn to a strange place.<br/><br/>Wu Xingyun continued, “When this happened, the world was shocked. After Luo Wang supported the new emperor into power, he led many powerful people from the court, stormed Bingzhou where the Wu Family was, and leveled the Wu Family’s estate. The war was so ferocious that the heavens and earth lost colours, and there was darkness in broad daylight. In the end, the Divine Power realm expert of the Wu Family was killed on the spot and the ten surnames of the world reduced to the nine surnames.”<br/><br/>“Hold on, this Luo Wang, he could kill a Unleaking Realm powerhouse?”<br/><br/>Gu Yang was very surprised.<br/><br/>He remembered Xu Ruomei once said that behind each of the nine surnames of the world, rests the old monsters of the Unleaking Realm.<br/><br/>The Wu Family, who could stand in line with the nine surnames, must have been the same.<br/><br/>“If it weren’t for Luo Wang dominating the world, how could the Zhao Family possibly maintain stability in this world? They would have been overthrown long ago,” Wu Xingyun sighed.<br/><br/>So it seems, not only are the numbers of the royal family far above the major forces, even their high-end strength is also the most top-notch. No wonder they could be the master of this world.<br/><br/>Only in this way would it be justifiable. How could one establish a great empire without absolute power, in such a high martial world?<br/><br/>Wu Xingyun continued, “However, there are rumours that Luo Wang has touched the threshold of the Celestial Being realm and is undergoing secluded cultivation, not bothering about worldly matters. It is due to this that the barbarians on the prairie have begun to stir.”<br/><br/>Gu Yang wanted to ask again, but suddenly he realized he came to ask about the forbidden areas of Great Zhou. He inadvertently shifted the focus of the topic.<br/><br/>He hurriedly returned the topic to the forbidden lands.<br/><br/>After a long conversation, he gradually developed some ideas in his mind.<br/><br/>At nightfall, Gu Yang sat in his room, opened the system, and started another simulation.<br/><br/>[ …You left Luo River alone, traveled to the heart of Great Zhou, and came to<br/><br/>Yin Ruins … ]<br/><br/>PS: The next chapter is due before twelve, still 50 monthly tickets short.. Rush!\t\t\t\t\t\t</div>", "images": {}, "success": true}