{"id": 108, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14300032.html", "title": "Chapter 108 - Chapter 108: 108 Is Still Too Kind-Hearted", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 108 - Chapter 108: 108 Is Still Too Kind-Hearted</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 108: 108 is still too kind-hearted<br/><br/>Translator: 549690339<br/><br/>The aura around Lan Shu was incredibly terrifying; the force of it even managed to slightly affect Chu Xiyue and Su Qingzhen standing behind Gu Yang, causing their hearts to pound anxiously.<br/><br/>Just as they thought this fearsome woman was about to strike, her aura suddenly receded and she became seemingly nonchalant.<br/><br/>She said, “I’m curious, where does your confidence come from? You should know, your half-baked ‘God Destroyer Nine Styles’ can’t touch me.”<br/><br/>Her tone suggested that she wasn’t impressed by Gu Yang’s previous ruthless move.<br/><br/>To some extent, Gu Yang’s ‘God Destroyer Nine Styles’ was indeed unorthodox, since he had not cultivated the ‘Heavenly Elemental God Slaying Art’. However, not everyone at First Rank has the right to say that.<br/><br/>Gu Yang could feel that Lan Shu’s cultivation level far surpassed his. If they were to fight, he would be at a great disadvantage.<br/><br/>However, since she didn’t directly attack, it seems unlikely that she would.<br/><br/>To be honest, he hadn’t expected to be able to kill Liu Zhe on this trip.<br/><br/>But when Liu Zhe’s posture was so perfect, he reflexively struck.<br/><br/>Gu Yang gave a faint smile, “Why don’t you guess?”<br/><br/>“Forget it, it doesn’t concern me.”<br/><br/>Lan Shu reverted to her previous indifferent stance, saying, “In any case, there will be someone to settle the scores with you. Good luck.”<br/><br/>“Wait a moment.”<br/><br/>Seeing her about to leave, Gu Yang called out to her, “Miss, you borrowed my knife last time. Shouldn’t you return it now?”<br/><br/>Lan Shu touched the Phoenix Feather Knife in her hand, her eyes somewhat reluctant. In the end, she flung the knife over to him and left. She didn’t even give a glance to the members of the Liu family present.<br/><br/>Gu Yang caught the Phoenix Feather Knife; gaining back what he had lost made him quite happy.<br/><br/>This knife is worth two hundred thousand after all.<br/><br/>He was right. This woman hadn’t taken Liu Zhe seriously and was cautious, so she wouldn’t act rashly.<br/><br/>The last time Gu Yang had faced her, he had noticed this. Lan Shu didn’t even attack him even though he was only at the second grade.<br/><br/>The so-called magnanimity of the strong, is pure nonsense.<br/><br/>So far, none of the martial artists he had met had this so-called magnanimity of the strong.<br/><br/>Gu Yang preferred to believe that she was being cautious.<br/><br/>Back then, the only one who could have possibly made her cautious was the First Rank accompanying Chu Xiyue.<br/><br/>So, he had brought Chu Xiyue on purpose, and her presence served more than just as a witness.<br/><br/>As he suspected, he was right.<br/><br/>After Liu Zhe’s death, Lan Shu didn’t make a move, she even returned the Phoenix Feather Knife.<br/><br/>Next, Gu Yang looked at the members of the Liu family present, contemplating how to deal with them.<br/><br/>At this point, Liu Hai woke up and seeing the body of Liu Zhe, he let out a mournful cry. Struggling to kneel before Gu Yang, he said, “Master Gu, I am willing to offer up all my assets, as long as you spare the others of the Liu family.”<br/><br/>Addressing Miss Su, he said, “The order to annihilate the Su family was given by us three brothers, and the one who executed it was my youngest brother. It had nothing to do with anyone else. If you want revenge, kill me.”<br/><br/>Having said that, he closed his eyes, ready to accept his fate.<br/><br/>Su Qingzhen gripped the handle of her sword tightly, her chest heaving rapidly. The thought of this day, when she could personally take her revenge, had permeated her every moment for the past several months.<br/><br/>Now, that day had finally arrived.<br/><br/>A gentle voice then echoed in her ears, “If you want them dead, let them all accompany the Su family to the grave.”<br/><br/>Upon hearing these words, the faces of the Liu family members present changed drastically.<br/><br/>One particularly hot-tempered one yelled, “Kill us if you dare, who’s afraid -”<br/><br/>Bang!<br/><br/>Before he could finish his words, a hole had been blown in his forehead, with red and white fluid leaking out.<br/><br/>Whoosh, whoosh, whoosh….<br/><br/>Nearly at the same time, several figures tried to flee in all directions.<br/><br/>Zzzzt, zzzzt, zzzzt….<br/><br/>Several sounds of air ripping apart were heard, and those figures fell from the sky, their bodies splattered with blood, collapsed on the ground, and didn’t move again.<br/><br/>This sight made all the Liu family members present terrified, and they dared not move.<br/><br/>During this whole process, Gu Yang did not turn his head, he kept looking at Su Qingzhen, in her eyes, he saw a hint of hesitation and mercy.<br/><br/>He understood, and turning to Liu Hai and Liu Yang, he said, “You and you, write down separately the names of the people who were involved in the massacre of the Su family that day. If there’s a single name that doesn’t match, they all die.”<br/><br/>Gu Yang casually pointed to a servant, instructing him to fetch paper and pen.<br/><br/>Once the pen and paper arrived, Liu Hai and Liu Yang began to write names down with a wooden expression on the ground.<br/><br/>The atmosphere at the scene felt like it had frozen solid.<br/><br/>Each name written by the two elderly men signified the end of a life.<br/><br/>“I’ll fight you to the death!”<br/><br/>Finally, someone couldn’t take it anymore and charged at Gu Yang like a madman.<br/><br/>He had only taken two steps when a bloody hole appeared in his forehead.<br/><br/>At this moment, the seemingly empty streets were actually filled with hidden spectators who had come to monitor the situation. The look of the scene told them that the Liu family was finished this time, and they couldn’t help but feel excited.<br/><br/>Over the years, the Liu family had offended too many people. Everyone had been outraged but dared not speak out. Now that they saw the Liu family’s misfortune, it was genuinely satisfying.<br/><br/>Once Liu Hai and Liu Yang’s list was written, Gu Yang found the steward of the Liu Mansion and had him identify the people named on that list. Then he proceeded to slaughter anyone who was still present.<br/><br/>A moment later, nearly a quarter of the Liu family members present had become corpses.<br/><br/>After Gu Yang had killed whom he needed to kill, he said to Liu Hai, “Tell me where the Liu family’s silver is hidden, and I’ll spare these people.”<br/><br/>Finally, some luster returned to Liu Hai’s hollow eyes. In a hoarse voice, he said, “Fine.”<br/><br/>He whispered a few locations to him.<br/><br/>Gu Yang didn’t rush to verify his words. Instead, he turned to Su Qingzhen and said, “It’s your turn.”<br/><br/>Su Qingzhen drew out her sword and stepped forward, killing one for each count. By her own hand, she avenged the blood feud for her family.<br/><br/>Gu Yang kept his word and let the remaining members of the Liu family leave. Then he entered the Liu Mansion and went to the locations Liu Hai had mentioned to collect all the silver that the Liu family had hidden over the years.<br/><br/>At three locations, they were all deep dug cellars, each one was filled with a lot of gold and silver.<br/><br/>One was in Liu Mansion, and the other two were in the Liu family’s other houses and country estates.<br/><br/>Gu Yang took all this money and in total, he had gained 2.3 million liang of silver, which was a fortune.<br/><br/>After this, he also took all the silver from the Liu family’s shops in Ba County, adding another few hundred thousand liang to his account.<br/><br/>What was left were shops and deeds that were difficult to dispose of. He did not have the time to deal with them, so he took them with him.<br/><br/>The next day, Gu Yang and his group left Ba County for their next destination.<br/><br/>…<br/><br/>“Brother Gu is still too kind-hearted in some ways.”<br/><br/>After hearing about Gu Yang’s actions in dealing with the Liu family, Wu Xingyun couldn’t help but sigh.<br/><br/>Gu Yang just smiled and remained silent. After all, he had grown up on Earth. To this day, he still couldn’t look at human lives in the same indifferent way as the martial artists of this world.<br/><br/>Chu Xiyue, who was next to him, changed the topic and steered the conversation back to Martial Arts.<br/><br/>At this moment, several dozen miles outside of Ba County, a group of people were fleeing for their lives. There were women and children, and at the front were several men, all of a fifth or sixth-grade cultivation level, and they were all members of the Liu family.<br/><br/>They had luckily escaped with their lives. After leaving Ba County, they fled helter-skelter, fearing that Gu Yang might change his mind and come after them.<br/><br/>This night, everyone was terrified.<br/><br/>At this moment, they finally stopped to rest. Reflecting on their current situation, everyone’s morale was incredibly low.<br/><br/>Just a day ago, their Liu family had been prestigious and dominant. Living a life of luxury.<br/><br/>But overnight, the Liu family was finished.<br/><br/>Liu Zhe was dead, and the family heads Liu Hai and Liu Yang were also dead.<br/><br/>They were all scared and panicky like stray dogs.<br/><br/>Suddenly, one of the leading men spoke out in rage, gritting his teeth and saying, “If I don’t get revenge, I swear I’m no human!”<br/><br/>Just at this moment, a cold voice spoke up, “You can’t even protect your lives, and you’re thinking about revenge?”<br/><br/>The Liu family was stunned by this, the man who had just made the outburst almost jumped up, “Who’s there?”<br/><br/>A group of masked men leaped out from the nearby woods, surrounding them from all sides.<br/><br/>The members of the Liu family asked in fear, “What do you want to do?”<br/><br/>“Kill!”<br/><br/>The masked men did not waste words with them; they charged up and started to kill anyone they saw.<br/><br/>Among them, the most potent member of the Liu family recognized the martial arts the masked men were using. His face was filled with rage and disbelief, “Chu Family——Why——”<br/><br/>The leading masked man cut off his head with a single stroke. Upon confirming that no one from the Liu family had survived, he sheathed his sword and said, “We can report back to the young lady now.”<br/><br/>Then, these masked men disappeared without a trace, leaving only a field of corpses behind.<br/><br/>PS: Rolling for votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}