{"id": 105, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297906.html", "title": "Chapter 105 - Chapter 105: Debt Collection (Third Update, Seeking Monthly Tickets)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 105 - Chapter 105: Debt Collection (Third Update, Seeking Monthly Tickets)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 105: Debt Collection (Third Update, Seeking Monthly Tickets)<br/><br/>Translator: 549690339<br/><br/>Three days later, Gu Yang finally stepped out of his room.<br/><br/>As he opened the door, he bumped into the little maidservant, Zhi Xing. Her face was full of surprise as she exclaimed, “Brother Gu, you finally ended your retreat.”<br/><br/>Gu Yang was in high spirits, he patted her head and asked, “Is there anything to eat? I’m starving.”<br/><br/>“I’ll make some right away.”<br/><br/>Zhi Xing hastily left. After taking a few steps, she paused, looked back and said, “Miss has been worried about you these past few days.”<br/><br/>Gu Yang gave a warm smile, thinking about how Su Qingzhen, during many simulation training sessions, followed him unconditionally, sharing life and death. Such fellowship was truly rare.<br/><br/>In the beginning, he did have a bad impression of this young lady. In a particular simulation, he even died at the end of her sword.<br/><br/>However, after experiencing so many things and countless simulations, she had always been by his side.<br/><br/>In Gu Yang’s heart, she was already considered a companion.<br/><br/>He thought to himself, “It’s time to repay her for her kindness.”<br/><br/>As he walked out of the cabin, he caught sight of Chu Xiyue and Wu Xingyun.<br/><br/>“Congratulations, Brother Gu!”<br/><br/>Chu Xiyue and Wu Xingyun both greeted him with clenched fists, expressing their sincere congratulations.<br/><br/>Breaking through to the First Rank meant stepping into the top-ranking league in the world.<br/><br/>In this era where few divine power cultivators were born, First Rank was the top-level strength in the Human Realm, capable of ruling the world.<br/><br/>If a single force could recruit one additional First Rank, it would be a cause for celebration. Usually, they would host a grand feast to announce it to the world.<br/><br/>Gu Yang returned the greeting and laughed, “I just took a step ahead and I believe, you all will soon catch up.”<br/><br/>The end of Gu Yang’s retreat was a joyous occasion.<br/><br/>Zhi Xing and Zhang Xiao Hai quickly prepared a feast and set up a table on the deck.<br/><br/>Everyone on the ship came out and gathered together to celebrate Gu Yang’s breakthrough to a First Rank master.<br/><br/>Gu Yang scanned over everyone present: Chu Xiyue, Wu Xingyun, Xu Ruomei, Su Qingzhen, Lily, Han Mengling.<br/><br/>Excluding Han Mengling, everyone else at the table was a companion with whom he had shared mixed feelings during his simulations.<br/><br/>Zhi Xing and Zhang Xiao Hai were responsible for pouring the wine.<br/><br/>Unfortunately, Ling Ling wasn’t present.<br/><br/>Consider it a small regret.<br/><br/>Gu Yang lifted his cup, proposing a toast, and everyone drank.<br/><br/>The atmosphere at the table was harmonious.<br/><br/>However, the women present weren’t exactly on friendly terms, especially Chu Xiyue, Xu Ruomei, and Su Qingzhen. There was an underlying rivalry amongst the top-ranked women of the Beauty List.<br/><br/>Gu Yang was initially worried that these three might end up fighting each other in his absence.<br/><br/>Thankfully, they respected him, and there were no such incidents.<br/><br/>It had been relatively peaceful for over a month.<br/><br/>Now, they were all seated at the same table, sharing a drink, which already indicated progress.<br/><br/>Gu Yang didn’t expect them to put their prejudices aside and become best friends.<br/><br/>His past life experience told him not to meddle in women’s affairs.<br/><br/>After three rounds of drinking, Gu Yang said, “Next, I plan to change course for Jiangzhou. It’s time to settle the score with the Liu family.”<br/><br/>Su Qingzhen looked shocked. She quickly turned to face him, her eyes welling up with tears.<br/><br/>All along, they had been moving in the opposite direction of Jiangzhou.<br/><br/>To go to Jiangzhou meant turning back.<br/><br/>Chu Xiyue and Wu Xingyun naturally had no objections.<br/><br/>Jiangzhou, Ba County, Phoenix City.<br/><br/>Inside a restaurant, Yang Deli was drinking with a few other people. As they were enjoying their drinks, he overheard someone at another table mentioning the name ‘Gu Yang’.<br/><br/>In the past two months, Gu Yang’s name had been mentioned frequently in teahouses and restaurants, with his fame skyrocketing.<br/><br/>Whether it was defeating three Second Grades warriors while he was still Third Rank, or slaying a First Rank plane when he was Second Rank, or breaking through to First Rank in just two months…<br/><br/>Each incident was legendary.<br/><br/>However, everyone intentionally ignored one incident, his confrontation with Liu Zhe.<br/><br/>Phoenix City was Liu family’s territory, Liu Zhe was the face of the Liu family. At least, publically no one dared to mention that event.<br/><br/>Suddenly, someone from the same table called out, “Old Yang, you mentioned last time that you knew Gu Yang. Is it true?”<br/><br/>Feeling tipsy, Yang Deli responded loudly, “I do know a martial artist named Gu Yang. He is actually the lifesaver of Old Yang.”<br/><br/>His proclamation attracted everyone’s attention in the restaurant.<br/><br/>Someone delved deeper, asking “Is it true, or are you making it up?”<br/><br/>Enjoying the attention, Yang Deli boasted, “Would I make something like this up? I was with Old Gao and Old Zhang, we went into Lian Mountain to collect herbs and hired a young hunter from a place called Liu village as our guide…”<br/><br/>“… On the way to Wangjia Gorge, guess what?”<br/><br/>“We ran into the third leader of the Mountain Wind Gang, Hell’s Messenger. We thought we were definitely done for, but then, that hunter stepped in. The infamous Hell’s Messenger was no match for him…”<br/><br/>As Yang Deli was talking enthusiastically, suddenly, there was a commotion at the tavern entrance.<br/><br/>“Move, everyone move–”<br/><br/>Two bruisers brashly shoved people aside in the tavern, clearing a path. Then, a young noble stepped in, walked straight up to Yang Deli, and fixed him with a cold stare. “You say you know Gu Yang?”<br/><br/>The whole tavern was so silent you could hear a pin drop.<br/><br/>Everyone recognized the young noble—it was the sixth son of the Liu family, known for his ruthless dominance.<br/><br/>Yang Deli was so frightened that his intoxication vanished immediately. Upon hearing the sixth son’s question, his face turned white as a sheet. He stuttered, “Si…Sixth young master…listen to me… The Gu Yang I know is not that Gu Yang…they…they’re not the same person…”<br/><br/>At that moment, he deeply regretted drawing attention to himself by mentioning his connection to Gu Yang.<br/><br/>Gu Yang had defeated Liu Zhe. This was undoubtedly a great disgrace to the Liu family. Their pride and joy had been bested by someone on the Hidden Dragon List.<br/><br/>If the Liu family couldn’t handle that Gu Yang, how easy it would be for them to turn on him instead?<br/><br/>He felt like he had run headlong into the barrel of a gun.<br/><br/>Yang Deli was scared out of his wits, to the point where he could barely speak.<br/><br/>Liu Wei reached out and slapped his cheek in a threatening manner, saying, “Do you know, I absolutely despise hearing that name. You’ve mentioned it not once or twice, but thrice… You really have some nerve.”<br/><br/>Suddenly, a voice came from outside. “What’s wrong with the name Gu Yang?”<br/><br/>Liu Wei swung around in fury. “Who? Who dares to interfere in my business?”<br/><br/>Everyone in the tavern held their breath, trying to avoid his gaze, afraid it was they who had spoken out.<br/><br/>Soon, the people at the entrance of the tavern parted, revealing a man, an obvious outsider.<br/><br/>When Yang Deli saw the man outside, he felt both fear and joy.<br/><br/>The man outside the door was the Gu Yang who had saved his life and the lives of the several merchants from Hell’s Messenger a few months prior.<br/><br/>His joy came from reuniting with his savior.<br/><br/>His fear came from realizing his savior had recklessly offended the sixth son of the Liu family.<br/><br/>Never had Yang Deli linked this life-saving noble to the Gu Yang on the Hidden Dragon List.<br/><br/>The number one on the Hidden Dragon List was far out of his reach. No matter how wild his imagination, he would never have connected the two.<br/><br/>Liu Wei, ranked sixth in the Liu family, was the grandson of Liu Cheng, who had been killed by Su Qingzhen.<br/><br/>After Liu Cheng’s death, Liu Wei had lost a powerful backer. His life became difficult from there on, and he was always in a foul mood.<br/><br/>Just now, while standing outside the tavern, he had heard someone bragging about knowing Gu Yang. Anger flared up in his heart.<br/><br/>Were it not for Gu Yang, his grandfather wouldn’t have died. If his grandfather hadn’t died, he wouldn’t have fallen to his current circumstances.<br/><br/>So Liu Wei stormed into the tavern, hoping to take out his anger on someone.<br/><br/>Now, hearing someone daring to interfere, he was like oil poured over a fire.<br/><br/>The man outside the door smiled, revealing eight teeth, and said, “My name is Gu Yang.”<br/><br/>“Why would you choose such an unlucky name!”<br/><br/>Hearing this name, Liu Wei’s murderous intent boiled over. It was as if the person in front of him was the great enemy of the Liu family. “Then you can go to hell!”<br/><br/>He drew his sword with a furious shout.<br/><br/>Suddenly, the man named Gu Yang outside the door pointed a finger.<br/><br/>Clang!<br/><br/>Liu Wei only felt a surge of sheer strength. His hand was in excruciating pain and he nearly dropped his sword.<br/><br/>With a loud clang, his treasured sword broke in half and one half fell to the ground.<br/><br/>He looked at the man outside stupefied, his face full of fear, as if he’d just seen a ghost.<br/><br/>Seeing this scene, everyone in the tavern was stunned, as if they were in a dream.<br/><br/>Phoenix City is a small place without any powerful characters. A sixth-rank like Liu Wei was already considered an expert.<br/><br/>The ability to break a sword with a single finger from a distance of seven or eight meters was something they had only heard of in legends.<br/><br/>The most shocked of all was Yang Deli.<br/><br/>Just a moment ago, he was worried for his savior. But in the blink of an eye, Gu Yang displayed skill that only existed in legends.<br/><br/>Gu Yang approached him with a smile, “Old Yang, long time no see.”<br/><br/>His smile was as friendly as it had been before.<br/><br/>Yang Deli was so moved, he couldn’t speak. “Gu… Master Gu…”<br/><br/>Gu Yang pulled out an IOU and said, “I’m here to collect a debt. Please settle this.”<br/><br/>“What?”<br/><br/>PS: We’ve reached the sixth chapter. Looking back, we’re less than 200 votes behind the fifth chapter. Maybe we can get another 200 votes?\t\t\t\t\t\t</div>", "images": {}, "success": true}