{"id": 106, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297908.html", "title": "Chapter 106 - Chapter 106: Extremely Cunning And Slippery", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 106 - Chapter 106: Extremely Cunning And Slippery</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 106: Extremely cunning and slippery<br/><br/>Translator: 549690339<br/><br/>Ba County City, Liu Family Residence.<br/><br/>Inside a study, two elder men sit facing each other, looking towards the direction of the back mountain, an obvious worry etched on their faces.<br/><br/>“Ever since Zhe lost to that man, he’s locked himself in the back mountain. It’s been two months already, nothing bad has happened, right?”<br/><br/>The two old men were none other than the most important figures of the Liu family in the present, Liu Hai and Liu Yang. They were brothers with Liu Cheng, who had been killed by Su Qingzhen. Together, they were known as the Three Heroes of the Liu family.<br/><br/>The one speaking was the second brother, Liu Yang. Liu Zhe was his very own grandson.<br/><br/>Two months ago, Liu Zhe returned to the Liu family alone. He didn’t utter a single word, instead, he secluded himself on the back mountain.<br/><br/>Only after some days, they found out about Liu Zhe’s defeat and their youngest brother’s unfortunate demise at the same place.<br/><br/>That alone was shocking enough.<br/><br/>One month ago, they heard rumors that Gu Yang, the top-ranked fighter on the Hidden Dragon List, had openly executed a First Rank in Zhongzhou City.<br/><br/>The news sent a bone-chilling fear throughout their beings.<br/><br/>The Liu family had actually incurred the wrath of such a formidable enemy!<br/><br/>And all of this was connected to that calamity of the Su family.<br/><br/>Often, it is said that a beauty brings disaster, and the two brothers were experiencing the truth of this saying firsthand.<br/><br/>They regretted not killing her on the spot due to their temporary greed. It has turned into such a massive catastrophe.<br/><br/>But alas, it was too late for regrets.<br/><br/>Liu Hai seemed slightly calmer as he comforted, “No need to worry, brother. When has Zhe ever let us down?”<br/><br/>Liu Yang didn’t say anything but worry filled his eyes.<br/><br/>Ever since Liu Zhe was accepted as a disciple by the Sword Saint of the Eastern Sea, his name entered the list of gifted youth, making him the greatest hope for the rise of the Liu family. If he were to be utterly disheartened by this setback, it would be disastrous for the Liu family.<br/><br/>“Emergency!”<br/><br/>Suddenly, an alarmed voice echoed from outside.<br/><br/>Recognizing the voice of his son, Liu Hai frowned and reprimanded, “Stop shouting, uphold the dignity!”<br/><br/>That’s when the door was rushed open and a middle-aged man rushed in, saying fearfully, “Father, someone has come to attack. Uncle has been killed by a single strike…”<br/><br/>“What?”<br/><br/>Liu Hai and Liu Yang’s expressions changed instantly.<br/><br/>The third elder, the only one in the second generation of the Liu family who had reached the Third Rank, was just slightly inferior to them. He had been killed in a single strike.<br/><br/>The invader must be at least Second Grade!<br/><br/>Such a ruthless strike definitely came from an enemy of the Liu family.<br/><br/>Liu Hai and Liu Yang looked at each other, fear reflecting in each other’s eyes.<br/><br/>They thought of a name simultaneously.<br/><br/>Liu Hai, having weathered many storms, gripped the shoulders of his son and ordered harshly, “Immediately go inform Zhe in the back mountain to leave for the Eastern Sea. He shouldn’t return unless he reaches Divine Power Realm.”<br/><br/>“Ha?”<br/><br/>The middle-aged man was startled by his father’s stern expression.<br/><br/>“What are you waiting for? Go. Whether the Liu family can withstand this crisis depends on you.”<br/><br/>“Oh, ok.”<br/><br/>The middle-aged man finally snapped back to reality and rushed out.<br/><br/>Taking a deep breath, Liu Hai said, “Let’s go meet with the number one on the Hidden Dragon List.”<br/><br/>He was clear that this was a life and death crisis for the Liu family.<br/><br/>However, as long as Liu Zhe was alive, the opponents would still hesitate.<br/><br/>Even if the entire Liu family died here today, Liu Zhe had to be protected. If he survived, the Liu family couldn’t be extinguished.<br/><br/>Gu Yang arrived at Phoenix City yesterday. On a whim, he remembered the traders who took him away from Liu Family Village owing him money — though a small amount, it was still money.<br/><br/>He happened to run into Old Yang, rescued him on the way, and collected the repayment of a total of sixty-five taels.<br/><br/>Then, with one of the Liu family’s disciples, they raided the Liu family and the trading house, acquiring more than thirty thousand taels.<br/><br/>This money wasn’t even enough to use the Simulation once.<br/><br/>Today, Gu Yang came straight to Ba County City, the stronghold of the Liu family.<br/><br/>He only brought Chu Xiyue and Su Qingzhen with him, reducing the number of people not to manifest as bullying the Liu family.<br/><br/>One was a witness, the other a victim.<br/><br/>When Gu Yang arrived at the gate of Liu mansion and stated his purpose to the gatekeeper, “I came to collect a debt.”<br/><br/>A sarcastic laughter emanated from beside him, “Daring to act wildly in the Liu family, you are truly tired of living.”<br/><br/>Gu Yang glanced at the scoffing two middle-aged men returning from outside. Seeing their luxurious attire, he knew they were significant figures of the Liu family.<br/><br/>Just as he was about to speak, he heard one of them coldly ordering, “Break his legs, and throw him out.”<br/><br/>Immediately, two fierce thugs began to approach him.<br/><br/>Gu Yang could only blame Chu Xiyue and Su Qingzhen, whose faces were hidden behind veils. They were too strikingly beautiful and didn’t enjoy being watched so they covered their faces as they entered the city.<br/><br/>Otherwise, the people of Liu family would surely speak more politely.<br/><br/>Before the thugs could draw close, they suddenly stiffened and fell to the ground.<br/><br/>The middle-aged men realized their mistake. Soon, they felt a chill run down their throats as a blade was placed on their necks.<br/><br/>The man, standing in front of him, said somewhat impatiently, “Why can’t you let me finish speaking?”<br/><br/>Instantly, beads of sweat formed on their foreheads, their eyes filled with shock and fear.<br/><br/>He was also a Third Rank in cultivation level. From a young age, he had hardly ever met an equal, and he had never submitted to anyone but his nephew.<br/><br/>Now, he realized that he had met an extremely terrifying opponent.<br/><br/>He didn’t even see the other’s shadow. The blade was held to his neck, and he couldn’t react at all.<br/><br/>He trembled and said, “Anc…Acestor… spare my life…”<br/><br/>Just then, a bone-chilling voice reached his ears, “Kill him.”<br/><br/>Ssssh-<br/><br/>The next moment, he felt a chill in his throat, heard the sound of blood spraying from his vessels, and a mist of blood clouded his vision.<br/><br/>Clutching his neck with one hand, he turned his head towards the direction of the sound and saw a veiled woman, her eyes revealing an intense hatred.<br/><br/>It’s you<br/><br/>He recognized those eyes. He opened his mouth to speak, but he could only emit a raspy sound from his throat, constantly coughing up blood.<br/><br/>If only I had known…<br/><br/>If only I had known…<br/><br/>His eyes wide open with anger, he died with eyes wide open.<br/><br/>…<br/><br/>This scene stunned all the members of the Liu family present.<br/><br/>Gu Yang said, “Bring out the person in charge of the Liu family.”<br/><br/>The remaining middle-aged man ran away in fear, and the others who were merely guards and servants stood far away, not daring to come near.<br/><br/>If even their Third Master could be killed with one slash, how could they stand a chance?<br/><br/>After a while, two old men stepped forward.<br/><br/>Upon arrival, the leading old man bowed and said, “I am Liu Hai, the head of the Liu family, and I pay my respects to Young Master Gu.”<br/><br/>When Su Qingzhen saw these two men, the color of hatred in her eyes intensified. These two old villains were the masterminds behind the extermination of her family.<br/><br/>The others in the Liu family were merely their minions.<br/><br/>She wished she could rush up and butcher these two men.<br/><br/>But the last shred of rationality in her brain restrained her.<br/><br/>Su Qingzhen knew that Gu Yang probably couldn’t afford to provoke a Divine Power realm cultivator right now.<br/><br/>If they killed these two old villains now, Gu Yang and Liu Zhe would become sworn enemies. If Liu Zhe’s master were to stand up for his disciple, he would be in danger.<br/><br/>This enmity could be avenged later.<br/><br/>Killing one of the Liu family’s Third Masters was also a form of preliminary justice.<br/><br/>Today, Gu Yang was here to exact revenge for her. Everything would be up to him.<br/><br/>Chu Xiyue, who was standing on the side, was surprised to see that Su Qingzhen was able to restrain her hatred.<br/><br/>She naturally saw that this woman and Gu Yang shared an extraordinarily special relationship.<br/><br/>Thanks to her special Ice and Jade Skin, she was technically Gu Yang’s Dao Companion.<br/><br/>However, their cultivation levels were worlds apart. Rather than saying Gu Yang was making use of her for cultivation, it was better to say that he was aiding her with her cultivation.<br/><br/>“The world is not only made up of Ice and Jade Skin that could cultivate with ‘Phoenix Dance Nine Heavens’!”<br/><br/>Chu Xiyue thought regretfully.<br/><br/>If not for the engagement with the Qin Family…<br/><br/>Thinking of this, she shook her head, not daring to think further.<br/><br/>Gu Yang, oblivious to the thoughts of the two women behind him, noticed the head of the Liu Family had come forward and said, “Two months ago, I had a duel with Liu Zhe of your family. We made a wager that if I won, all of the Liu family’s property would be mine.”<br/><br/>As soon as these words came out, there was an uproar among the Liu family’s members.<br/><br/>Only Liu Hai and Liu Yang, who had obviously been through much, remained composed.<br/><br/>Gu Yang continued, “Miss Chu behind me is the witness. If that is not enough, I can call in Wu Xingyun, he was there on the day.”<br/><br/>“No need.”<br/><br/>Liu Hai bent even lower, speaking in a hoarse voice, “My Liu Family is willing to accept the loss from this wager. I will gather the members of the Liu Family and leave Ba County within two days, without taking a single piece of property.”<br/><br/>Suddenly, a deafening silence surrounded them.<br/><br/>Seeing that he agreed so easily, Gu Yang was very surprised. This old ghost actually had the resolve to make such a painful decision.<br/><br/>Originally, he anticipated the Liu Family would surely refuse. Once the Liu Family dared to resist, they would all be killed, and Liu Zhe would have nothing to say about it.<br/><br/>Now, the Liu family agreeing so quickly, he couldn’t find an opportunity to act.<br/><br/>After all, Gu Yang was admittedly somewhat apprehensive of Lan Shu, the woman beside Liu Zhe.<br/><br/>He had just attained the First Rank, his skills were still shallow, and he was not entirely confident in facing that woman.<br/><br/>Just then, a long howl echoed from the backyard.<br/><br/>“Gu – Yang!”<br/><br/>A voice with a full intent to fight exploded in the air. It was Liu Zhe!<br/><br/>Upon hearing that voice, the expressions of Liu Hai and Liu Yang changed dramatically.<br/><br/>PS: Please continue to give me monthly votes. I’m only a few votes short of fifth place.\t\t\t\t\t\t</div>", "images": {}, "success": true}