{"id": 100, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297896.html", "title": "Chapter 100 - Chapter 100: Don’T Talk About Martial Virtues 100 Times", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 100 - Chapter 100: Don’T Talk About Martial Virtues 100 Times</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 100: Don’t talk about martial virtues 100 times<br/><br/>Translator: 549690339<br/><br/>For the first simulation, Gu Yang planned to take a kind of divination, to see what kind of trouble he might encounter after reaping so many benefits.<br/><br/>Well, he indeed ran into a fellow who seemed to be the protagonist of this world.<br/><br/>The number one on the Pride List, who broke through against all odds in the midst of battle, and counterkilled him.<br/><br/>Isn’t this a perfect example of protagonist’s halo?<br/><br/>Yi Yi, ranked second, hailing from the Heavenly Saint Sect.<br/><br/>This is all the information Xu Ruomei knows about this person, she doesn’t even know the person’s gender. You can say this person is extremely mysterious.<br/><br/>If it wasn’t for this person’s name on the Pride List, Great Zhou would not have known that within the Heavenly Saint Sect, there exists such a remarkably talented individual.<br/><br/>The Heavenly Saint Sect, one of the six major sects, is also the most mysterious one among them.<br/><br/>This sect is known by everyone, it can freely parade itself with the nine most famous surnames.<br/><br/>However, if you were to ask about any significant accomplishments of this sect, there seem to be none.<br/><br/>No one knows the location of the Heavenly Saint Sect’s gate and very few talk about this sect’s disciples in the world.<br/><br/>Even Xu Ruomei, the heir of the Sword Palace, is not clear about what the Heavenly Saint Sect actually is.<br/><br/>It seems that the only proof of the existence of this sect are the First Rank List and the Pride List.<br/><br/>Nearly every generation, there are names of disciples from the Heavenly Saint Sect appearing on the First Rank List and Pride List.<br/><br/>As if, this sect only exists on these lists.<br/><br/>Who would have thought that a month later, Yi Yi, the first on the Pride List who had never been seen in the martial world, would actually challenge him.<br/><br/>“Oh what a burden fame is.”<br/><br/>Gu Yang sighed. He has become the top ranked Second Grade. Even the extremely mysterious heir of the Heavenly Saint Sect got alarmed.<br/><br/>That number one on the Pride List challenges him, it is clear that he views him as a stepping stone to break through to First Rank.<br/><br/>Such geniuses, even if they just break through to First Rank, their strength would far surpass Xing Kun, who is in the Imperial Guard. [Simulation ends, you can keep one of the following.] [1. Twenty-two-year-old martial arts realm.] [2. Twenty-two-year-old martial arts experience.]<br/><br/>[3. Twenty-two-year-old wisdom of life.]<br/><br/>Without thinking much, Gu Yang chose 2.<br/><br/>Immediately, he was bestowed with a new set of experiences about battles in his mind.<br/><br/>The battle was extremely fierce. The opponent’s True Essence was formidable, the Sword Technique was profound, which were not inferior to his own.<br/><br/>It was on the seventeenth move that he managed to suppress the opponent with his “Swallowing the Heaven” technique, and was about to kill the opponent on the spot.<br/><br/>The opponent suddenly erupted an immense power, astonishingly breaking his “Swallowing the Heaven” technique, and counterattacked him.<br/><br/>He shook his head in frustration, “This is unreasonable.”<br/><br/>The counterattack under such circumstances was simply preposterous.<br/><br/>After Yi Yi broke through to the First Rank, the Sword Technique he used should be of the same level as “God Destroyer Nine Styles”.<br/><br/>More importantly, upon reaching First Rank, his True Essence was deeper than Gu Yang’s and the internal martial arts he practiced matched his Sword Technique even better, making his power much stronger.<br/><br/>When Gu Yang practiced “God Destroyer Nine Styles”, he used the True Essence of “Phoenix Dance Nine Heavens” to motivate him. It was not a matching technique, so there was a loss in power.<br/><br/>It’s no surprise that he couldn’t beat him.<br/><br/>The matched technique of “God Destroyer Nine Styles” is the “Heavenly Elemental God Slaying Art”.<br/><br/>However, this technique is too mysterious and seems unfair upon first glance. He doesn’t intend to learn it.<br/><br/>“I wonder if there is any matching technique in ‘Phoenix Dance Nine Heavens’.” Gu Yang thought to himself.<br/><br/>After pondering for a moment, he had an idea and opened the simulator again.<br/><br/>[ …You quietly travelled to Yuzhou alone, sneaked into Shen Baiyi’s villa, got the jade slip, and acquired the inheritance of ‘Phoenix Dance Nine Heavens’. At the same time, you alerted Shen Baiyi.]<br/><br/>[After killing Shen Baiyi, you eliminated all the people in the manor and then left.]<br/><br/>[Half a month later, Yi Yi, the number one on the Pride List, appeared before you and challenged you. In a fierce battle, Yi Yi broke through to the First Rank realm on the battlefield, and killed you on the spot, ending your life at the age of twenty-two.]<br/><br/>It’s him again?<br/><br/>Gu Yang has clearly separated from Chu Xiyue and the others and ran into Yuzhou, but he still bumped into Yi Yi.<br/><br/>How did this person find him?<br/><br/>[Simulation ended, you may keep one of the following.]<br/><br/>[1. Your martial arts realm at the age of 22.] [2. Your martial arts experience at the age of 22.]<br/><br/>[3. Your life wisdom at the age of 22.]<br/><br/>Without much consideration, he immediately chose option two.<br/><br/>As a result, the ninth level cultivation method of “Phoenix Dance Nine Heavens” appeared in Gu Yang’s mind, and he could directly cultivate to the Divine Power Realm.<br/><br/>Unfortunately, the ninth level cultivation method didn’t have any martial techniques.<br/><br/>In addition, he had the memory of two battles, the one where he killed Shen Baiyi and the other one was his confrontation with Yi Yi.<br/><br/>This fight with Yi Yi was completely different from the previous one.<br/><br/>Gu Yang only used nine moves to corner Yi Yi, but in the end, Yi Yi had a breakthrough, reaching the First Rank Realm during the battle.<br/><br/>Obviously, this was not a rare event.<br/><br/>Yi Yi’s accumulation was already incredibly profound, and he was just one step away from breaking through to the First Rank. His battle with Gu Yang was that needed trigger.<br/><br/>“In this case, if I undergo rebirth, he wouldn’t dare to trouble me.”<br/><br/>With this thought in mind, Gu Yang initiated the third simulation.<br/><br/>[ …You found a deserted place and started your rebirth. Your cultivation level turned back to the Ninth Rank. A month later, Yi Yi, the number one on the Pride List, appeared in front of you. Without saying a word, he drew his sword and killed you. You died at the age of 22.]<br/><br/>You’ve got to be kidding me, he killed me for this?<br/><br/>Gu Yang was distraught. Yi Yi, despite being the top on the Pride List, apparently had no grace of a martial arts master, ruthlessly killing even a Ninth Rank cultivator.<br/><br/>This was out of line.<br/><br/>Moreover, it seemed that Yi Yi had some unique tracking skills, hiding was pointless.<br/><br/>If he couldn’t beat him or escape him, he was stuck in a pinch.<br/><br/>[Simulation ended, you may keep one of the following.]<br/><br/>Choosing option one was out of the question. If he became the Ninth Rank again, he wouldn’t have any chance of fighting back at all.<br/><br/>Option two was unnecessary too. Would he really want another memory of being killed by a single strike?<br/><br/>Thus, Gu Yang chose the third option.<br/><br/>The next moment, he had a memory of seeing Yi Yi, clearly hearing him utter a few words before unsheathing his sword, “Phoenix Dance Nine Heavens?” Clearly, Yi Yi had recognized the technique he was using for cultivation.<br/><br/>From the surprise in his tone, it seemed that he knew about this technique.<br/><br/>Could his determination to kill be related to this technique?<br/><br/>In the end, the final thought in the simulated version of him before he died was, “This guy has no respect for martial arts principles!”<br/><br/>Gu Yang pondered for a bit before starting the simulator once more.<br/><br/>[ …You returned to Ping County and found Ling Ling, who hadn’t left her retreat yet. You told her about the trouble you’ve encountered. She left her retreat early to face the strong enemy with you.]<br/><br/>[Half a year later, Yi Yi, the number one on the Pride List, found both of you. After a fierce battle, he broke through in the midst of fight, killing you. You died at the age of 23.]<br/><br/>Upon seeing this, Gu Yang couldn’t help but gasp in shock.<br/><br/>He was in deep trouble now.<br/><br/>Even Ling Ling’s ability to evade danger couldn’t shake off Yi Yi’s pursuit.<br/><br/>They only managed to hide away for half a year before being found.<br/><br/>The key was that this guy could have a breakthrough in every fight, rendering him almost unbeatable.<br/><br/>For the first time, Gu Yang encountered such a formidable opponent.<br/><br/>The main problem was the limited time he had. Even if he brought Ling Ling along, they could only hide themselves for half a year. If he used up all his chances, it would add up to just over a decade.<br/><br/>He needed to come up with another solution.<br/><br/>He racked his brain, pondering on a countermeasure.<br/><br/>PS: Chapter 100, let’s celebrate with confetti. We are about a hundred and fifty votes away from the Monthly Ticket Chart. I hope for your support..\t\t\t\t\t\t</div>", "images": {}, "success": true}