{"id": 107, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14297910.html", "title": "Chapter 107 - Chapter 107: 107 You Are Brave!", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 107 - Chapter 107: 107 You Are Brave!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 107: 107 You are brave!<br/><br/>Translator: 549690339<br/><br/>On the mountaintop of the back hill, Liu Zhe sat stiffly on a rock, holding the treasured sword gifted to him by his master while staring intently ahead, engaged in deep thought.<br/><br/>He had maintained this posture for a very long time.<br/><br/>Ever since he was defeated by Gu Yang, he returned home to the Liu family and remained in this state.<br/><br/>He had been contemplating how to break Gu Yang’s saber technique.<br/><br/>In his mind, he repeatedly recalled every detail of their previous conflict.<br/><br/>Boom!<br/><br/>He seemed to be transported back to an eastern sea island, where towering waves filled his vision and his master’s teachings rang in his ears again.<br/><br/>In that moment, Gu Yang’s saber technique overlapped with the massive waves before him.<br/><br/>Clang!<br/><br/>For the first time in two months, Liu Zhe unsheathed his sword, the blade slicing through the waves and breaking Gu Yang’s technique!<br/><br/>He opened his eyes and let out a resounding howl, expressing his exhilaration.<br/><br/>He had finally broken Gu Yang’s saber technique!<br/><br/>He managed to hone the “A sword breaks through a thousand waves” sword technique to a new level, reaching the second stage.<br/><br/>When Liu Zhe opened his eyes, he saw a man collapsed on the ground, his face full of terror. It was Fifth Uncle.<br/><br/>He gently sheathed his sword, asking, “What happened?”<br/><br/>The man rushed to respond, “Somebody has launched an attack. Your father sent me to inform you to leave Liu Mansion and return to the Eastern Sea immediately.”<br/><br/>Liu Zhe, being as smart as he is, immediately figured that Gu Yang must have come for him.<br/><br/>“Hahaha…” He laughed heartily. “I was worrying about where to find him, yet he came to me.”<br/><br/>“Gu—Yang!” Liu Zhe shouted, his voice full of battle intent, an open challenge to his opponent.<br/><br/>With a swoosh, Liu Zhe had disappeared from sight.<br/><br/>Seeing him moving in the direction of the Liu Mansion, the middle-aged man’s face turned pale. This was not good!<br/><br/>But there was no way he could catch up with Liu Zhe’s swift pace. His complexion changed many times before he finally made his move—running off in the opposite direction of Liu’s Mansion.<br/><br/>…<br/><br/>Inside the Liu Mansion, many people had heard that someone was causing trouble and were filled with righteous indignation, rushing to the main gate.<br/><br/>Then, they saw the corpse of a third uncle lying on the ground. Everyone was furious.<br/><br/>Who dares to commit murder in the Liu family?<br/><br/>Over the years, it’s always been the Liu family doing the killing. When had anyone ever attacked them directly?<br/><br/>When they heard the man outside who came to cause trouble mention that he wanted to fight with Liu Zhe, the gambling stake was all of the Liu family’s assets—all of the Liu family present fell eerily silent.<br/><br/>Finally, they realized who the man was.<br/><br/>The number-one ranked Gu Yang on the Hidden Dragon List, a First-Rank power!<br/><br/>This was a First-Rank power—their Liu family’s pride and joy, the prototype Qilin, had been defeated by him.<br/><br/>But what he wanted was all the Liu family’s assets? This was plain bullying!<br/><br/>“We, the Liu family, are willing to accept a lost bet. I will gather all the Liu family disciples to leave Ba County within two days, without taking any assets with us.”<br/><br/>When they heard the family leader’s words, they could hardly believe their ears.<br/><br/>Would they just hand over the Liu family’s hundred-year-old foundation just like that?<br/><br/>The crowd boiled with anger, frustration, and resistance, but in respect to the family leader’s authority as well as the invincible prestige of the enemy, they dared not voice their disagreement.<br/><br/>At this moment, a furious roar like thunder sounded from the back hill.<br/><br/>“Gu—Yang!”<br/><br/>It was Liu Zhe!<br/><br/>He had finally come out.<br/><br/>The Liu family’s estate was instantly filled with cheering.<br/><br/>Their savior had finally arrived.<br/><br/>But only Liu Hai and Liu Yang’s faces turned deathly white as fear gripped them. As they were about to speak and warn him, they felt an overwhelming aura. It pressed on them until they couldn’t move or speak.<br/><br/>They saw a smug smile spread across Gu Yang’s face.<br/><br/>The two seasoned old men, who had experienced countless storms, now felt a chill creeping into their hands and feet, their hearts filled with dread.<br/><br/>During Liu Zhe’s seclusion, they had strictly forbidden anyone from disturbing him.<br/><br/>That was why he wasn’t aware that Gu Yang had broken through to First Rank.<br/><br/>If he attacked Gu Yang, the consequences were beyond their imagination.<br/><br/>As Liu Zhe appeared before them, Liu Yang’s face turned blood-red. Breaking free from the invisible Gang Qi constraint, he mustered all his strength to roar, “Zhe, run…”<br/><br/>Whoosh—<br/><br/>Liu Zhe was beyond the reach of anyone’s words at this point. Aside from Gu Yang, no one else mattered in his eyes.<br/><br/>Being defeated under Gu Yang’s blade was his life’s greatest humiliation. Only this man’s blood could cleanse it!<br/><br/>Liu Zhe hovered in the air, a sword in hand, his presence as impressive as the blazing sun high in the sky.<br/><br/>With a voice resonating like booming spring thunder, he shouted, “Take my strike!”<br/><br/>In an instant, a sky-filling sword aura poured toward Gu Yang, causing even the sun and the moon to change their hues.<br/><br/>The Liu family below, never having seen such a sword technique, watched with their hearts trembling and their minds intoxicated, completely mesmerized.<br/><br/>Gu Yang lifted his head, looking at Liu Zhe in mid-air, his eyes filled with admiration.<br/><br/>Compared to two months ago, the Sword Technique used by Liu Zhe was the same, but it had undergone drastic changes. Even if it were Gu Yang before he understood the Devouring Heaven Style, he might not have been able to break through this sword strike.<br/><br/>As expected of a generation’s genius, in only two months’ time, his Sword Technique had improved to another level.<br/><br/>Out of respect, Gu Yang decided to use his most powerful Saber Technique, the eight skill from the just acquired “God Destroyer Nine Styles”.<br/><br/>His hand gripping the hilt of his blade.<br/><br/>Suddenly, everyone present felt as though the world had lost all its color, leaving only black and white.<br/><br/>The cheering ceased.<br/><br/>A look of puzzlement flashed across everyone’s faces.<br/><br/>Even Liu Hai and Liu Yang, two third rankers, felt their fear and despair vanishing like smoke in the wind. Decades of persistence suddenly seemed meaningless.<br/><br/>Both men felt something was terribly wrong, yet were unable to control it. Quickly, their minds became as still as a dead pool, undisturbed by ripples.<br/><br/>It seemed as if nothing in the world could stir a ripple in their hearts.<br/><br/>Liu Zhe in mid-air had his ardent fighting spirit in his heart rapidly retreating, like the dwindling of warmth in a cold wind.<br/><br/>Correspondingly, his overwhelming sword strike, dwindled, becoming weaker and weaker.<br/><br/>A strong sense of unease surged in his mind, wanting to mobilize the fighting spirit in his heart. But in a blink of an eye, it disintegrated like ice and tiles.<br/><br/>As if waking from a dream, Liu Zhe vaguely thought, “Where am I? What am I doing?”<br/><br/>“Stop!”<br/><br/>Right then, a stern voice sounded.<br/><br/>It’s Second senior sister!<br/><br/>Liu Zhe recognized the voice. The next moment, he felt a pain in his chest. Looking down, he saw a blade had punctured his chest.<br/><br/>In the face of the intense threat of death, he finally broke free from the influence of that invisible force, regaining his senses and vision.<br/><br/>Then he felt the pain. It was bone-deep and excruciating.<br/><br/>“Ah—”<br/><br/>He grabbed at the blade, blood oozing from the corners of his mouth. As he stared at Gu Yang, he asked, word by word, “What kind of Saber Technique is this?”<br/><br/>Gu Yang said, “Unfeeling Style!”<br/><br/>The eighth style of “God Destroyer Nine Styles”, Unfeeling Style.<br/><br/>This was what he comprehended during the previous simulation in twenty-eight years’ time.<br/><br/>This move, capable of temporarily severing others’ feelings and desires, rendered their hearts still like a calm body of water, unable to muster even a hint of fighting spirit, and unaware of the coming danger even at the point of death.<br/><br/>This Saber Technique was indeed terrifying beyond measure.<br/><br/>“Such a… Unfeeling… Style…”<br/><br/>Liu Zhe squeezed out these words between his teeth, his eyes flashing with unwillingness and resentment…<br/><br/>Quickly, his eyes lost their light.<br/><br/>A once-prodigy had met with an untimely death.<br/><br/>“No—”<br/><br/>Liu Hai on the ground came back to his senses at this sight. Seeing Liu Zhe was pierced through the heart with a blade, he let out a scream of utter despair, spat out a mouthful of blood, and lost consciousness on the spot.<br/><br/>Everything was over.<br/><br/>With the death of Liu, the Liu family’s hope, all his life’s striving, scheming, and calculations had all gone down the drain.<br/><br/>Unable to bear this blow, he fell unconscious on the spot.<br/><br/>“You’ve got guts!”<br/><br/>A figure appeared next to Liu Zhe. Looking at his lifeless body, she was filled with rage, radiating a terrifying aura.<br/><br/>The woman was indeed Liu Zhe’s second senior sister, Lan Shu. She arrived as soon as she sensed something was wrong, but it was one step too late.<br/><br/>Looking at the man opposite, she stated coldly, “Are you not afraid of death?”<br/><br/>Gu Yang felt an intense killing intent locking onto him. However, his face remained unchanged as he replied, “If I die, then I die.”<br/><br/>PS: The second update, seeking monthly votes. Well, I’m fifth right now, how about trying to catch up with the fourth? I’m still 2200 votes short.\t\t\t\t\t\t</div>", "images": {}, "success": true}