{"id": 112, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14302271.html", "title": "Chapter 112 - Chapter 112: 112 I Don’T Want", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 112 - Chapter 112: 112 I Don’T Want</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 112: 112 I don’t want<br/><br/>Translator: 549690339<br/><br/>Gu Yang had been preoccupied with so many matters recently that this was his first time genuinely looking at the young girl Han Mengling.<br/><br/>What was the secret that this Asura Sword Saint, who had entrusted his disciple to him with a reward of more than two million taels, held?<br/><br/>In the simulation, Su Qingzhen, who possesses an ice-like skin and jade-like bone constitution and the ancient cultivation seed, had cultivated the “Ice Soul Profound Light Sword” that was highly compatible with her constitution, but it took her more than twenty years to achieve Divine Power.<br/><br/>However, it only took Han Mengling eleven years.<br/><br/>He would not believe to death that she didn’t carry a secret.<br/><br/>Han Mengling, noticing his gaze, blinked her eyes at him, revealing a sweet smile.<br/><br/>Gu Yang returned her a smile, and finally took his eyes off her.<br/><br/>There’s always more time in the future, he would have the chance to figure out her secret later.<br/><br/>“Congratulations to Brother Gu for the great progress in your cultivation.”<br/><br/>Sitting next to him, Wu Xingyun picked up his tea cup, “I offer you this tea in place of wine, wishing Brother Gu to step into the realm of Divine Power soon.”<br/><br/>This moment, everyone at the table turned their gaze towards them.<br/><br/>Gu Yang knew he couldn’t hide his restlessness from last night from them, so he also picked up his tea cup, clinked it with Xingyun’s, and smiled, “I take your auspicious words.”<br/><br/>He was just about to drain the tea from his cup.<br/><br/>But Wu Xingyun suddenly grabbed his hand, saying in front of everyone, “Xiyue is leaving, is Brother Gu not going to do anything?”<br/><br/>Gu Yang was taken aback; he didn’t expect him to ask such a question publicly.<br/><br/>Seeing his serious expression, if his answer today doesn’t satisfy him, they might become estranged.<br/><br/>Instantly, he felt the atmosphere around them becoming tense.<br/><br/>Even Su Qingzhen, who had been in a daze, raised her head to look at him.<br/><br/>Gu Yang frowning slightly, was about to respond when the sound of footsteps arrived, breaking the stalemate.<br/><br/>Here comes the principal.<br/><br/>“Brothers Gu and Wu.”<br/><br/>Chu Xiyue, wearing a purple cloak, regained her former heroic posture. As if she hadn’t noticed the tense atmosphere between the two men, she said, “I’m leaving, came to say goodbye.”<br/><br/>Looking at her, Wu Xingyun suddenly sighed, looking somewhat deflated.<br/><br/>Chu Xiyue acknowledged the others present and then turned to leave.<br/><br/>“Let me accompany you.”<br/><br/>Gu Yang caught up with her.<br/><br/>Chu Xiyue did not refuse.<br/><br/>The two walked side by side in silence.<br/><br/>As they reached the gate, they could see a fine chestnut horse waiting there.<br/><br/>Finally, Gu Yang broke the silence, “Why are you in such a hurry to leave?”<br/><br/>At that moment, a wave of fragrance swept over them. Numerous precious flowers were blooming in competition alongside the road.<br/><br/>Chu Xiyue reached out to pick the most gorgeous red peony and pinned it to her temple. She gave a slight smile and said, “You don’t have to take Wu Xingyun’s words to heart. To me, my lifelong wish is to elevate the Chu Family above the other eight families. Nothing else matters.”<br/><br/>Gu Yang watched her smile, making the surrounding flowers seem bleak in comparison, becoming a backdrop to her beauty. He was momentarily moved and blurted out, “If you don’t want to get married, I can help you.”<br/><br/>Staring at him, Chu Xiyue’s eyes welled up with tears. A complex smile appeared on her face, a mixture of joy, sweetness, loss, and sorrow.<br/><br/>Eventually, it all turned into a sigh, “I don’t want to get married. I don’t want to retrieve the family heirloom in such a humiliating manner. However, it’s hard to defy the ancestral command.”<br/><br/>Having said that, she unpinned the peony from her temple, placed it into Gu Yang’s hand, and bid him farewell. Then she leapt onto the horse outside the gate, flicked the reins, and galloped away.<br/><br/>Watching her retreating figure, her purple cloak flapping high, the dust kicked up by the horse’s hooves clearly reflected a few teardrops.<br/><br/>It seemed that she indeed did not want to get married into the Qin Family.<br/><br/>He thought about the times they had shared, she had helped him a lot.<br/><br/>If it were not for her, there would have been several unsolvable situations that could have killed him.<br/><br/>Note that when he first met Chu Xiyue, they had a great disagreement, but when he asked for her help later, she kindly agreed without considering their past grudges.<br/><br/>In total, Gu Yang owed her a significant favor.<br/><br/>The Qin Family–<br/><br/>Last night, Chu Xiyue deliberately mentioned the Qin Family to him, wasn’t it a warning?<br/><br/>Among the nine major families, the patriarch of the Chu Family was not a match for Qin Wu, showing how strong he was.<br/><br/>Though the Qin Family was founded later, its power was definitely in the top tier among the nine families.<br/><br/>Moreover, after eighteen years, Qin Wu had already become a Celestial Being. Even if he hadn’t reached that Realm yet, he must be very close.<br/><br/>There was only one more year left.<br/><br/>According to previous simulations, Chu Xiyue should be married off a year from now.<br/><br/>One year…<br/><br/>Gu Yang solemnly gazed at the direction where Chu Xiyue disappeared and said, “When the time comes, if I have enough power, I will definitely rescue you from the flames.”<br/><br/>Jingzhou, Sword Mountain.<br/><br/>“Young master, slow down, wait for me.”<br/><br/>At the foot of the mountain, a chubby middle-aged man was chasing a twelve or thirteen-year-old boy in brocade clothes.<br/><br/>The boy was agile, climbing the steep cliff face using both hands and feet, without slowing down.<br/><br/>“Young master, don’t go up, it’s dangerous there.”<br/><br/>The middle-aged man beneath yelled a few times, but the boy climbing the cliff ignored him.<br/><br/>Helpless, the man had no choice but to follow him, asking as they went, “Young master, why are you climbing up there?”<br/><br/>While exerting all his force climbing, the boy explained, “There’s a legendary Divine Sword at the top of Sword Mountain. I want to retrieve it and give it to my mother as a birthday present.”<br/><br/>“Young master, isn’t this reckless? If the Madam finds out, she’ll enforce family discipline.”<br/><br/>The boy didn’t care about his words. After climbing for half a day and seeing the mountain peak ahead, his spirit was completely refreshed. Suddenly, several shadows swept past him, surpassing him and flying to the top of the mountain.<br/><br/>He panicked and sped up his climb.<br/><br/>“Is this the legendary Divine Sword?”<br/><br/>A girl was curiously looking at the Sword stuck on a rock, covered in rust and barely retaining its form.<br/><br/>This girl was Han Mengling.<br/><br/>Wu Xingyun, standing next to her, also stared at the rusty sword and nodded, “Yes, according to records, this sword has been stuck here for over a thousand years. Over the centuries countless people have tried to pull it out, but no one has succeeded. Even those of the Divine Power realm are no exception.”<br/><br/>It has been ten days since Chu Xiyue left.<br/><br/>In these ten days, they hurried to their destination and finally entered the Jingzhou territory.<br/><br/>They happened to pass by Sword Mountain. During a rest, Wu Xingyun mentioned the Divine Sword that had been on top of Sword Mountain for a thousand years. Han Mengling was curious and wanted to take a look.<br/><br/>Before, Gu Yang would have ignored her, but ever since he discovered the secrets she held, his attitude naturally changed. He brought everyone to see for themselves.<br/><br/>Feeling enthusiastic, Han Mengling asked, “Can I try it?”<br/><br/>Wu Xingyun nodded, “Of course.”<br/><br/>However, Han Mengling knew who was really in charge and looked towards Gu Yang.<br/><br/>Gu Yang cast a glance at a strange man sitting on a rock. The man was in tattered clothes, sitting still like a corpse at first glance.<br/><br/>But in fact, he was a powerful warrior.<br/><br/>A First Rank.<br/><br/>The man had been sitting there for a while, clearly interested in the Divine Sword.<br/><br/>Gu Yang nodded in agreement.<br/><br/>The girl walked forward, grabbed the rusty hilt of the sword, and pulled hard.<br/><br/>“It won’t budge…”<br/><br/>Despite using all her strength, the sword didn’t move at all, leaving her somewhat discouraged.<br/><br/>Throughout the process, the strange man didn’t move or react at all.<br/><br/>Afterward, Su Qingzhen and a few others also tried their luck out of curiosity. Unsurprisingly, none of them could pull it out either.<br/><br/>Only Gu Yang, Wu Xingyun, and Xu Ruomei hadn’t tried.<br/><br/>“Why don’t you try it, Brother Gu?” Wu Xingyun asked. He and Xu Ruomei had tried on their previous visit.<br/><br/>Gu Yang shook his head and said, “No need.”<br/><br/>He understood his limits well. This sword had been stuck here for a thousand years. Even Divine Power realm individuals couldn’t pull it out, so there was no use in him wasting his strength.<br/><br/>As he prepared to leave, the young boy finally climbed up. Seeing a group of people gathered around the Divine Sword, with one girl who looked like a servant trying to pull it out, he shouted, “Stop, let go of my Divine Sword!”<br/><br/>PS: asking for monthly votes as always.\t\t\t\t\t\t</div>", "images": {}, "success": true}