{"id": 117, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14302287.html", "title": "Chapter 117 - Chapter 117: 117 Riding The Tiger, Hard To Get Off", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 117 - Chapter 117: 117 Riding The Tiger, Hard To Get Off</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 117: 117 Riding the tiger, hard to get off<br/><br/>Translator: 549690339<br/><br/>“Madam, we have arrived at Juyang City.”<br/><br/>Outside the city, a handmaid named Spring Peach whispered to Pei Qianlan from another luxurious carriage.<br/><br/>She was absent-mindedly stroking a snow-white long sword in her hand, and simply responded when she heard the words.<br/><br/>Spring Peach was somewhat worried. Ever since her mistress was injured and woke up three days ago, she had been very out of spirits. According to the doctor, her Original Spirit had been wounded.<br/><br/>Moreover, the prince had been unconscious all along.<br/><br/>On the same night, she made a decisive decision, immediately set off, and prepared to rush back to Jingzhou City to find a divine doctor for treatment.<br/><br/>Jianyang City dispatched a team of guards to escort them, and even sent two First Rank powerhouses to escort them.<br/><br/>Within the borders of Jingzhou, all forces had to depend on the breath of King Jinghai. Those two First Rank powerhouses, one from the military and one from a noble family, had been doing their best along the way.<br/><br/>The attack on King Jinghai’s queen and prince on Sword Mountain, even causing the death of their accompanied First Rank powerhouse, was an earth-shattering event. Many people couldn’t sleep at night due to this.<br/><br/>If King Jinghai were to blame somebody, many people would lose their heads.<br/><br/>Pei Qianlan suddenly asked, “Has Little Dragon woken up?”<br/><br/>“Not yet.”<br/><br/>She sighed, looking at the Jade Star Sword in her hand, she felt languid, with an unshakeable fatigue, even holding her beloved sword didn’t lift up her spirits.<br/><br/>The injury this time had affected her original essence, and she hadn’t felt so weak in a long time.<br/><br/>Suddenly, the carriage stopped.<br/><br/>Someone reported from the outside, “The city gate is blocked.”<br/><br/>Spring Peach asked, “What happened?”<br/><br/>“It is said that Guo Taiping has come to challenge Zhang Feifan, and many people have come to watch.”<br/><br/>“The sixth-ranked Guo Taiping of the Heavenly Pride List? And who is Zhang Feifan?”<br/><br/>“He is a Second Grade from Juyang City. It is said to be very powerful, claiming to have survived ten moves under a First Rank.”<br/><br/>Spring Peach sneered, “Huh, saying that Guo Taiping only chooses easy targets. This proves it.”<br/><br/>Since last year, Guo Taiping begun to travel around, challenging Second Grade warriors everywhere, obviously accumulating experience to break through the First Rank Realm.<br/><br/>For many noble disciples, this was a common practice. Guo Taiping wasn’t the first and wouldn’t be the last.<br/><br/>However, Spring Peach was concerned about the injuries of the queen and prince at this moment, seeing the city gate being blocked and their journey was delayed, she naturally felt unhappy.<br/><br/>Spring Peach ordered sternly, “You go ahead, disperse the crowd and continue our journey.”<br/><br/>As the queen’s handmaiden, there were times when she could give orders on behalf of the queen.<br/><br/>“Yes.”<br/><br/>The carriage continued its journey.<br/><br/>“Why are you so scared then?”<br/><br/>Seeing the simple-looking young man shivering, Gu Yang found it even more strange. He had absolutely no recollection of this man.<br/><br/>As they spoke, Guo Taiping’s carriage had arrived. The coachman didn’t intend to slow down at all, and even took out a long whip, lashing it towards them.<br/><br/>Gu Yang’s eyebrows furrowed, these noble disciples really didn’t attach any importance to people’s lives.<br/><br/>Bang!<br/><br/>The whip hit something invisible about a meter behind Feng Tianci, met an invisible barrier.<br/><br/>The coachman felt his long whip tremble, the whip shattered inch by inch, an irresistible force came forward, hitting his chest.<br/><br/>“Splat—”<br/><br/>He spat out blood on the spot, his body flew backward, crashing through the wooden boards of the carriage, and tumbled inside.<br/><br/>The four steeds seemed to sense danger, they all reared at once, and dared not go forward.<br/><br/>The carriage, driven by inertia, continued to move forward, and the four horses pulled it over.<br/><br/>This sudden turn of events left all the spectators dumbfounded.<br/><br/>Guo Taiping’s carriage was actually overturned by someone, making this prodigy the laughingstock.<br/><br/>Who was so daring to actually make a move against Guo Taiping?<br/><br/>Those who were knowledgeable knew that the attack just now was an invisible Gang Qi, which meant that the person who made the move was definitely a First Rank powerhouse.<br/><br/>A figure flew out from the carriage and landed on the ground.<br/><br/>He was dressed in white, standing tall and straight, with a handsome face, extremely pleasing to the eye. However, his face was now ashen, and he looked coldly at a man not far away, chillingly asking, “Who are you?”<br/><br/>This man was Guo Taiping.<br/><br/>In the world, there are many First Rank warriors, but only a few dare to take a shot at him.<br/><br/>In Jingzhou, there are even fewer. Even the Jinghai Royal Mansion would not want to make an enemy of the Guo Family.<br/><br/>At this time, Pei Qianlan’s carriage had already entered the city gate. Driven by a dozen or so guards, many people at the city gate had already dispersed.<br/><br/>However, a tipped-over carriage blocked the way ahead.<br/><br/>The carriage stopped once again.<br/><br/>This time, Spring Peach got angry, pushed open the carriage door, and asked in a huff, “What happened again… Eh, it’s Master Gu!”<br/><br/>At first, she was filled with anger, but the moment she saw the figure ahead, her tone changed into surprise and delight.<br/><br/>Inside the carriage, as tiredness crept up on Pei Qianlan and she was about to fall asleep, the words “Master Gu” jolted her awake. She lifter her head and right then, Spring Peach turned her head around with an excited look, saying, “Shifu, quick, look, that’s Master Gu.”<br/><br/>Pei Qianlan leaned over to look outside and her eyes locked onto a figure.<br/><br/>It was him!<br/><br/>The scene from three days ago flickered before her eyes again when she lost consciousness.<br/><br/>There was also the face she saw in her foggy consciousness…<br/><br/>Remembering what he did to her, Pei Qianlan blushed with embarrassment.<br/><br/>Spring Peach quickly figured out the situation and said in a flurry, “Oh no, it seems that Master Gu is having a conflict with Guo Taiping. Shifu, what should we do? Should we help him?”<br/><br/>“No.”<br/><br/>Pei Qianlan instinctively tried to avoid the situation, blurting out the words.<br/><br/>“But…”<br/><br/>“Let’s… let’s watch first.”<br/><br/>Pei Qianlan knew she was making an ill-judged decision, after all, he had saved her and Little Dragon.<br/><br/>“He was saving me at that time.” She told herself so.<br/><br/>Yet, she still didn’t want to face this man.<br/><br/>“Gu Yang.”<br/><br/>On hearing this name, Guo Taiping fell silent.<br/><br/>He never imagined meeting this person in a minor place like Juyang City.<br/><br/>He was ranked among the Heavenly Talents, and he always looked down upon those on the Hidden Dragon List. Even the number one on the Hidden Dragon List meant nothing to him.<br/><br/>But, this man named Gu Yang, was an exception.<br/><br/>Because, he was a First Rank warrior in his twenties.<br/><br/>Guo Taiping, more than anyone, knew what this meant.<br/><br/>It’s been three years since he reached the Second Grade realm, and there’s still no sign of reaching the First Rank.<br/><br/>His elders once predicted that it would take him at least five years to reach the First Rank realm. By then, he would be over thirty.<br/><br/>Aside from this, there were rumors about Gu Yang being the successor of one of the Four Sacred Lands.<br/><br/>As proud as Guo Taiping was, he had to tread cautiously around these four Sacred Lands.<br/><br/>However, if he backed out now, where would he put his face as one of the Heavenly Talents?<br/><br/>He found himself in a bit of a spot.<br/><br/>At this time, Guo Taiping felt something in his heart and looked up.<br/><br/>On the other side of the street, a tall figure walked slowly. This man wore plain clothes, straw sandals, and held an old long sword in his hand. As soon as he appeared, he attracted everyone’s attention.<br/><br/>He looked ordinary but had a pair of unforgettable eyes.<br/><br/>Although he was dressed plainly, he emanated a rare quality, making him look dazzling.<br/><br/>Guo Taiping was stunned. He had never seen such a character before, and a hint of jealousy rose in his heart.<br/><br/>Even he paled in comparison to this man.<br/><br/>The tall man stopped, and with a somewhat awkward voice said, “Yi Yi challenges.”<br/><br/>PS: Three shifts for monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}