{"id": 119, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14302293.html", "title": "Chapter 119 - Chapter 119: Skyfire Annihilation 119", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 119 - Chapter 119: Skyfire Annihilation 119</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 119: Skyfire Annihilation 119<br/><br/>Translator: 549690339<br/><br/>“This is…”<br/><br/>The hitherto ignored Guo Taiping suddenly felt a strange sense of dread. His instinct as a martial artist made him smell the scent of death.<br/><br/>His body felt a creeping chill, unable to bear the horrifying pressure. His body swayed, and he found himself withdrawing thirty meters away.<br/><br/>After he had steadied himself, his face was painfully hot.<br/><br/>He, the world’s pride, didn’t even dare to confront Gu Yang, the top of the Hidden Dragon List.<br/><br/>If this were to get out, where would he hide his face?<br/><br/>Guo Taiping subconsciously glanced around, seeing that most of the crowd had dissipated, with only a few people left. No one had noticed his abhorrent behavior, and his heart eased.<br/><br/>The next second, his face turned ugly once more.<br/><br/>He, the world’s pride, was actually being ignored by others.<br/><br/>In contrast, Yi Yi, who was also on the Heavenly Saint List, faced Gu Yang’s First Rank pressure and managed to bear it.<br/><br/>The gap between them was clear.<br/><br/>The Heavenly Saint List is different from other lists. The ranking doesn’t have anything to do with one’s strength or realm. Whoever makes it onto the list first is ranked higher.<br/><br/>Yi Yi being ranked first only meant that he had been a Second Grade for a longer time. It didn’t mean his strength was greater than anyone else on the Heavenly Saint List.<br/><br/>Guo Taiping had never considered himself inferior to anyone else on the Heavenly Saint List.<br/><br/>Until now, when he finally realized the gap between him and Yi Yi.<br/><br/>Boom!<br/><br/>At that moment, a white True Essence erupted from Yi Yi’s body, forming a layer of Protective Gang Qi. Subsequently, his entire aura began soaring, and he could vaguely contend with Gu Yang.<br/><br/>“This–”<br/><br/>Guo Taiping was greatly shocked, tasting bitterness in his mouth. “First Rank!”<br/><br/>Under the immense pressure from Gu Yang, Yi Yi had successfully entered the First Rank Realm.<br/><br/>This implied he was already one step ahead of everyone else on the Heavenly Saint List.<br/><br/>At this moment, Guo Taiping acutely realized that he had been left behind by these two.<br/><br/>“First Rank!”<br/><br/>The First Rank martial artist responsible for the carriage’s security changed expression, losing his voice.<br/><br/>Yi Yi had actually had a breakthrough in the middle of battle, stepping into the First Rank Realm. As soon as he had the breakthrough, the range of his Protective Gang Qi was so vast, showing the depth of his accumulation.<br/><br/>Those who could make it to the Heavenly Saint List were all cultivating exceptional methods. After reaching First Rank, they started to demonstrate their power. As soon as there was a breakthrough, their strength surpassed that of ordinary First Rank powers.<br/><br/>Upon hearing the words, Spring Peach in the carriage was anxious again, “He’s also First Rank now? Can Young Master Gu handle it?”<br/><br/>The First Rank martial artist didn’t answer. He didn’t know either. Both of these young men were currently the most stunning talents in the world. Having First Rank at just over twenty years old was something unthinkable in the past.<br/><br/>Now, two such people had appeared, and they were both cultivating exceptional methods.<br/><br/>Between these two, it was possible for either to emerge victorious.<br/><br/>At this moment, Pei Qianlan in the carriage spoke, “General Pan, Young Master Gu once saved the Crown Prince’s life. If he is in danger, I hope you can do your utmost to save him.”<br/><br/>Upon hearing this, the countenance of General Pan, that First Rank martial artist outside, became solemn, answering, “I will do my utmost to protect Young Master Gu’s life.”<br/><br/>His attitude towards Gu Yang took a sudden turn.<br/><br/>Saving the Crown Prince’s life, he was a benefactor of the entire Jinghai royal house.<br/><br/>On the other side, Su Qingzhen and the others were somewhat nervous seeing Yi Yi break into the First Rank.<br/><br/>Lily even took out the crystal ball, ready to use magic to support any time.<br/><br/>When Yi Yi stepped into the First Rank, between his inhales and exhales, it seemed as if a fog was being formed. He stared at Gu Yang on the other side, his eyes filled with strong fighting intent.<br/><br/>He had spent more than twenty years in obscurity, always following his master in the mountains for cultivation, content with solitude and not mingling with the mortal world.<br/><br/>Finally, he had found an opponent of sufficient weight.<br/><br/>He knew it was time for him to come into the world and asked his master for permission.<br/><br/>The master agreed and brought him before Gu Yang.<br/><br/>After more than twenty years of obscurity, he finally reached the First Rank Realm in this moment.<br/><br/>According to the rules of the sect, he would now begin to close off from the world until he reached the Divine Realm.<br/><br/>This was his first battle in the world before attaining divine power.<br/><br/>And it would be his last.<br/><br/>He would not waste such an opportunity. Today, he would declare to the world that he, Yi Yi, is the strongest man of the future, stepping over Gu Yang’s bones.<br/><br/>Yi Yi said, “Take my sword!”<br/><br/>Immediately, a grand sword intent pierced the sky. The air trembled in response, contending with the terrifying Blade Intent emanating from Gu Yang.<br/><br/>“The Mountain River Sword Technique?”<br/><br/>On the second floor of a roadside tavern, Gao Fan was lurking there, nibbling on some leftover roast chicken on the table while watching the battle unfolding outside. When Yi Yi made his move, he recognized the origin of the sword technique.<br/><br/>This was the very sword technique that the Mountain River Sword Saint had made his name with and the reason behind his reputation.<br/><br/>What is Yi Yi’s relationship with the Mountain River Sword Saint?<br/><br/>Gao Fan was very curious.<br/><br/>Previously, he had never heard of any connection between the Mountain River Sword Saint and the Heavenly Saint Sect.<br/><br/>“Mountains and rivers, forever and ever!”<br/><br/>Yi Yi, with his sword, transformed into a rainbow and flew towards Gu Yang.<br/><br/>In front of the audience, it seemed as if a grand drawing of mountains and rivers had unfolded. For a moment, their souls were shaken.<br/><br/>The minds of the two First Rank warriors next to the carriage were involuntarily seized, and they were filled with a feeling of powerlessness. In the face of this grand Blade Intent, they felt so insignificant and did not dare to resist.<br/><br/>Not only these two First Rank individuals, but other people as well, were deeply astonished by this dazzling move. They were plunged deeply into shock.<br/><br/>This move had transcended the realm of the human world, it was a sword move of Divine Power Realm level.<br/><br/>“Is that all?”<br/><br/>Suddenly, a faint voice rang in everyone’s ears, instantly awakening them from their stupor.<br/><br/>In the next moment, a flame rose into the sky.<br/><br/>Everyone saw Skyfire raining down from heaven, burning everything before their eyes to ashes.<br/><br/>“Skyfire Annihilation!”<br/><br/>On the second floor of the tavern, the chicken leg in Gao Fan’s hand slipped to the floor as he mumbled, “It is indeed ‘Shenxiao Six Annihilation’.”<br/><br/>A big question loomed in his mind. This Gu Yang, not only had mastered the “God Destroyer Nine Styles”, but could also perform “Shenxiao Six Annihilation”. Where did he come from?<br/><br/>These two Saber Techniques derived from two different sacred places, but he had mastered both of them…<br/><br/>Gao Fan was completely confused. He felt that this man was shrouded in deep mystery, and his background was unfathomable.<br/><br/>At the start, Gu Yang used the first move of “Shenxiao Six Annihilation” – Skyfire Annihilation.<br/><br/>This move was simply tailored for him. His True Qi was capable to bring out the maximum force of this Saber Technique.<br/><br/>This was also the grand gift he prepared for Yi Yi.<br/><br/>Boom!<br/><br/>The omnipresent Skyfire burned everything. The shattered mountains and rivers vanished, and Yi Yi’s real body was revealed.<br/><br/>Under the red light of the flame, the shock and disbelief in Yi Yi’s eyes were brought to light.<br/><br/>“How is this possible?”<br/><br/>It was merely a matter of a few weeks since Gu Yang had promoted to the First Rank, even if his True Essence was deeper, it was extremely limited.<br/><br/>The art he had practiced, as far as the richness of True Essence was concerned, was known as “First Breath of Heaven” and could be considered the best in the world.<br/><br/>The “Mountain River Sword Technique” he was practicing, had achieved the true intent of this move, and its power was extraordinary.<br/><br/>His master once told him, once he reached the First Rank, anyone below the third level of the First Rank would not be able to withstand his sword.<br/><br/>Why?<br/><br/>Why was Gu Yang’s True Essence even deeper than his own?<br/><br/>Why was his Saber Technique stronger than his own?<br/><br/>It was clear that he had only reached the First Rank less than a month before him.<br/><br/>Yi Yi’s Blade Intent was shattered. The Protective Gang Qi was instantly broken. Among shock and despair, the red fire had swept over him, swallowing him up.<br/><br/>“He lost?”<br/><br/>Under the red light of the fire, Guo Taiping’s face was full of deep shock, and a hint of confusion.<br/><br/>Whether it was Yi Yi’s sword technique or Gu Yang’s Saber Technique, both had completely exceeded his wildest imaginations, making him feel profoundly powerless.<br/><br/>Over the course of the year, the confidence he had built by challenging Second Grade warriors everywhere, at this moment, collapsed completely.<br/><br/>In front of these two men, his proudly held realm and sword technique seemed so insignificant, not worth mentioning.<br/><br/>In his mind, he was constantly haunted by Gu Yang’s slash. No matter how much he thought, he could not think of a solution, and only death awaited him.<br/><br/>The color on Guo Taiping’s face alternated between green and white, suddenly he spat out a mouthful of blood, and his whole body wilted.<br/><br/>PS: Request for monthly vote.\t\t\t\t\t\t</div>", "images": {}, "success": true}