{"id": 116, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14302284.html", "title": "Chapter 116 - Chapter 116: Do You Know Me?", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 116 - Chapter 116: Do You Know Me?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 116: Do you know me?<br/><br/>Translator: 549690339<br/><br/>At night, Gu Yang and the others settled down in an inn at a small town.<br/><br/>In their room, after helping Su Qingzhen enter the profound state of cultivation, Gu Yang opened the system and glanced at his balance; it was one million and hundred ten thousand.<br/><br/>He bit his teeth and initiated a simulation.<br/><br/>There was problem with the saber technique “God Destroyer Nine Styles”; he urgently needed a new saber technique, one without negative effects.<br/><br/>“At 22 years old, you are a first-rank martial artist, ranked first on the Hidden Dragon List, your fame shaken the world after slaying a first-rank practitioner with your saber.”<br/><br/>“You saved the son of Jingzhou’s king when you were in Jingzhou city, the next day you secretly left with Su Qingzhen. Several days later, Yi Yi, who was ranked first in the Sky Pride List, appeared in front of you, challenging you.”<br/><br/>“After a few moves, Yi Yi advanced into the first-rank realm but was still defeated by you. You let him go.”<br/><br/>“Right at that moment, a first-rank practitioner that had long been lurking nearby, suddenly attacked. You were greatly exhausted and believed that you could not defend yourself. As your last resort, you used the God Destroyer style to kill him but fainted on the spot.”<br/><br/>“After you woke up, you sensed something wrong with your condition. Carrying Su Qingzhen, you both sped towards the Divine City.”<br/><br/>“You joined the internal guards and became the vice-captain while learning the ‘Devastating Heaven Six Destroyer’.”<br/><br/>“Henceforth, you and Su Qingzhen devoted yourself entirely to cultivation.”<br/><br/>“Eighteen years later, you were ordered to lead people to assassinate Ling Ling. On the way, you and Su Qingzhen killed several first-rank subordinates. Later you went to join with Ling Ling.”<br/><br/>“Ling Ling successfully entered the realm of Divine Power. A mana realm power holder descended, slapping down a palm. You all were on the brink of being shattered to pieces when you brandished the God Destroyer style and smote his giant hand. Ling Ling took the opportunity to escape with you.”<br/><br/>“When you woke up again, you found yourself possessed by a terrible entity. In the end, you saw a blindingly bright sword light, and you died at the age of forty-five.”<br/><br/>After reading the last line, Gu Yang’s gaze narrowed. Just as he suspected, there was indeed a problem with the God Destroyer style.<br/><br/>Although the power of this move was incredibly strong, by the end, it could even sever the palm of a mana realm power holder single-handedly.<br/><br/>However, the problem was that after the execution of this move, he would end up being possessed by a high-dimensional being. It was no different from being dead.<br/><br/>By the time his consciousness returned, it was already five years later and was killed as soon as he opened his eyes.<br/><br/>He had no idea what had happened in these five years.<br/><br/>“Simulation finished, you can retain one among the following items.”<br/><br/>“One, the martial arts realm of when you were forty years old.”<br/><br/>“Two, the martial arts experience of when you were forty years old.”<br/><br/>“Three, the life wisdom of your forty-five years old self.”<br/><br/>It seems that the system didn’t regard him as himself after being possessed by a higher-dimensional being at forty.<br/><br/>He really wanted to choose the third option out of urge but he held back due to the low balance.<br/><br/>“I choose the second option.”<br/><br/>In the next moment, countless memories and knowledge flooded his brain which included the saber technique “Devastating Heaven Six Destroyer”.<br/><br/>This was a saber technique that was not inferior to “God Destroyer Nine Styles”.<br/><br/>The empress was truly brilliant. An outstanding saber technique, just simply handed over.<br/><br/>Gu Yang silently commended her in his heart. She truly had a knack for playing big.<br/><br/>Three days later, a master and disciple duo appeared outside Juyang City, one fat and one thin. They were Gao Fan and Feng Tianci.<br/><br/>“Master, why is the check at this city so strict?”<br/><br/>“How would I know?”<br/><br/>“I’ve heard people discussing that the Crown Prince in Sword Mountain was assaulted, could it be that day…”<br/><br/>Gao Fan interrupted him irritably, “If you don’t speak, no one would think you’re a mute.”<br/><br/>Suddenly, Feng Tianci seemed to have noticed something terrifying and lowered his head immediately. Grabbing Gao Fan’s sleeve, he stuttered, “Master, look over there, that person…”<br/><br/>Seeing that, Gao Fan too recognized who it was. It was the same man who had mastered the God Destroyer Nine Styles.<br/><br/>Unexpectedly, he ran into him here.<br/><br/>It seemed that he was also targeting Jingzhou City.<br/><br/>While Gao Fan was pondering, his gaze subtly swept across the few people on his side. When his eyes met Su Qingzhen, a his eyes sparkled.<br/><br/>Seeing Xu Ruomei next, he furrowed his eyebrows.<br/><br/>Lastly, when his eyes scanned over Han Mengling, his pupils contracted slightly.<br/><br/>Suddenly, someone shouted, “Look! It’s Guo Taiping, the sixth one in the Sky Pride List!”<br/><br/>The surrounding crowd instantly burst in excitement and rushed over in an attempt to catch a glimpse of this overwhelmingly talented individual.<br/><br/>The teacher and disciple pair Gao Fan and Feng Tianci were pushed around and separated in an instant.<br/><br/>Suddenly, Feng Tianci noticed a seven or eight-year-old girl being trampled that she fell to the ground, crying in pain due to the trampling.<br/><br/>He could not help but feel furious. His body shot up into the air and landed beside the little girl. He knocked away the people who were about to step on her which caused a commotion around them.<br/><br/>“Are you okay?”<br/><br/>Just as Feng Tianci was about to help the little girl up, he looked up and saw a familiar face which made him pause.<br/><br/>The person standing in front of him was the terrifyingly strong individual who had appeared three days ago near Sword Mountain.<br/><br/>“Do you know me?”<br/><br/>Gu Yang noticed the girl falling just now and wanted to help her up, but someone beat him to it.<br/><br/>The helper was a naïve-looking young man who seemed to be around seventeen or eighteen. Dressed simply and depicted a farmer’s appearance with his tanned skin and the big bundle on his back.<br/><br/>However, surprisingly, his cultivation level was not low, even reaching the fourth rank realm.<br/><br/>_With his age and this level of cultivation, his talent was exceptionally high._<br/><br/>What’s even more precious was that this young kid was chivalrous.<br/><br/>Every martial artist that Gu Yang had encountered didn’t even come close to being chivalrous.<br/><br/>He was curious about which family this young man belonged to.<br/><br/>Even more curious was the fact that as soon as this kid saw him, his face took on a terrified expression which he failed to hide. So, he asked him.<br/><br/>Upon hearing this question, Feng Tianci jolted and shook his head violently. He was too nervous to even speak.<br/><br/>At this moment, a luxurious carriage drove into the city gate, pulled by four precious steeds. It was the vehicle of Guo Taiping, who was the sixth on the Sky Pride List.<br/><br/>He was from Guo Family, one of the nine prestigious families and was an undisputed chosen son of heaven.<br/><br/>He has always been very ostentatious. No matter where he went, he always rode in this carriage, pulled by four prized steeds. Out of everyone in the world, he was the only one who did this.<br/><br/>As soon as anyone saw this carriage, they knew he had arrived and it always caused a great sensation.<br/><br/>_This was the chosen son of heaven. A sight common people may not get to see in their entire life._<br/><br/>Even the coachman who was riding the carriage was a third-rank martial artist.<br/><br/>As the carriage drove into the city gate, people automatically made way. However, they started following the carriage, hoping to see the real face of this prestigious prodigy.<br/><br/>Suddenly, a couple of people stood in the middle of the road, blocking the passage with no intention of stepping aside.<br/><br/>Soon, the carriage approached them. The coachman, without any hesitation, picked up a ten-feet-long whip and lashed it towards the people blocking the way.<br/><br/>PS: There will be another chapter later, it’ll be after twelve o’clock.\t\t\t\t\t\t</div>", "images": {}, "success": true}