{"id": 115, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14302281.html", "title": "Chapter 115 - Chapter 115: 115 Righteousness Transcends The Heavens", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 115 - Chapter 115: 115 Righteousness Transcends The Heavens</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 115: 115 Righteousness Transcends the Heavens<br/><br/>Translator: 549690339<br/><br/>Gu Yang was somewhat shocked as he watched Meng Ping, who had lost all signs of life, collapse to the ground.<br/><br/>This strike, completely unreasonable, disregarding technique and unrelated to strength, silently and invisibly severed the opponent’s original spirit, extinguishing their life.<br/><br/>Who could defend against such saber technique below the Divine Power realm?<br/><br/>The next moment, he felt darkness before his eyes as if a portion of his consciousness had been drawn out. The severe pain originating from his soul caused him to tremble uncontrollably.<br/><br/>A moment later, Gu Yang managed to recover from that intense pain, still feeling somewhat dizzy.<br/><br/>“How could this be?”<br/><br/>He looked at the Phoenix Feather Knife in his hand, profoundly shocked.<br/><br/>The feeling just now was as if a part of his soul had been snatched away by some unknown entity.<br/><br/>There’s something wrong with this saber technique!<br/><br/>In the future, he’d have to ask Ling Ling for clarification.<br/><br/>He thought, still feeling a lingering fear.<br/><br/>Before that, he must never use this saber technique again.<br/><br/>A moment later, Gu Yang finally recovered, glancing at the Prince of Jingzhou he was holding. As he observed, he couldn’t help but frown.<br/><br/>The youngster’s condition was worrisome. He seemed to have fallen into a strange state; his body temperature was extraordinarily high, his heartbeat extremely fast. A regular person in this state would certainly be close to death.<br/><br/>But his vitality was extremely vigorous.<br/><br/>All these changes appear to have been caused by the Divine Sword in his hand.<br/><br/>Gu Yang dared not rashly remove the Divine Sword from his hand. In case he miscalculates and turns what was supposed to be a favor into vengeful resentment for killing his son.<br/><br/>“There’s one more.”<br/><br/>By the time he had dashed to the woman caught in the ripple of his soul-destroying technique, her condition seemed even worse. Her heartbeat and breathing were barely perceptible, she was on the brink of death.<br/><br/>Gu Yang inwardly sighed, “What rotten luck.”<br/><br/>This woman must have come for the Prince of Jingzhou, judging by how she addressed him. Both of their statuses were far from ordinary.<br/><br/>Considering her age, she looked a little younger than Wu Xingyun. She was probably the prince’s sister.<br/><br/>“Great, now I’ll be accused of murder.”<br/><br/>Gu Yang knelt down and touched her chest with his fingertip, injecting a stream of True Essence.<br/><br/>In an instant, her heartbeat strengthened somewhat.<br/><br/>This was a resuscitation technique he learned from a simulation, using True Essence to stimulate the heart, much like a pacemaker on Earth.<br/><br/>After so many simulations, the martial arts experience he inherited was not all about fighting and killing; he also knew quite a bit about the medical field.<br/><br/>With a hint of joy, he thought to himself, “There might still be hope.”<br/><br/>Subsequently, Gu Yang picked the woman up and left.<br/><br/>He needed to find an undisturbed place to save these people.<br/><br/>The commotion they’d caused could possibly attract others to this location.<br/><br/>After Gu Yang left with the people, Gao Fan, who was hiding in the nearby forest, walked out, holding his unconscious apprentice. Looking at the direction Gu Yang left, his expression was filled with worry.<br/><br/>“The Soul-chopping Technique has found a new successor…”<br/><br/>Suddenly, he chuckled bitterly, “But what does it have to do with me?” He then left with his apprentice.<br/><br/>After a moment, a horse-drawn carriage rushed in, and the woman driving it repeatedly cried, “Madam…Prince…”<br/><br/>But received no response.<br/><br/>In a cave, Gu Yang placed the Prince of Jingzhou on a dry spot, then focused on treating the woman.<br/><br/>He neither had any medicine nor silver needles, so he could only rely on the most familiar method—resuscitation.<br/><br/>Stimulating the heart with True Essence, which functioned as a pacemaker.<br/><br/>Then introducing True Essence like artificial respiration.<br/><br/>According to his experience from the simulations, such methods were highly effective and had saved lives of people at death’s door several times.<br/><br/>Of course, whether he could save this woman or not, he didn’t have much confidence.<br/><br/>After all, she suffered trauma on a consciousness level.<br/><br/>Even if she was brought back to life, she might end up as a vegetable.<br/><br/>Gu Yang was just doing his part.<br/><br/>A few minutes later, the woman’s heartbeat stabilized, and she again began to breathe autonomously.<br/><br/>Her eyelids fluttered open, then dropped weakly.<br/><br/>“Finally, she’s been brought back to life.”<br/><br/>Gu Yang sighed in relief.<br/><br/>With one hand on her back, he slowly infused True Essence, stimulating the functions of her organs.<br/><br/>His True Essence was of the Pure Yang kind, exceptionally suitable for saving lives.<br/><br/>“Ah!”<br/><br/>Pei Qianlan was jolted awake, sitting upright; her head ached as if it might burst from internal pressure, the pain was so severe it nearly took her breath away.<br/><br/>“Mistress, are you alright?”<br/><br/>A hand reached out from the side to support her, asking anxiously.<br/><br/>It took her a while.<br/><br/>Only then did she manage to catch her breath, and with some difficulty, she opened her eyes. Seeing the maidservant, Spring Peach, by her side, she asked weakly, “Where’s Little Dragon?”<br/><br/>Spring Peach said, “The young master is fine; he is in another room, Autumn Moon is taking care of him.”<br/><br/>Pei Qianlan let out a sigh of relief. But quickly, she felt something wasn’t right, and asked, “Where am I?”<br/><br/>“This is a villa in Jianyang City. Mistress, take some rest, the doctor said you are weak and need good rest for a while.”<br/><br/>By this time, the pain in her head had completely subsided. Finally remembering what happened before, she said somewhat blankly, “How did I get here? I remember, someone was going to harm Little Dragon; I was about to save him when I suddenly fainted….”<br/><br/>“It was young master Gu who saved you and the young master.”<br/><br/>“Young master Gu?”<br/><br/>Pei Qianlan had a vague image of a face in her mind.<br/><br/>“Gu Yang, the young master who ranked first in the Hidden Dragon List, the youngest First Rank in the world, has slain the heaven’s chosen ones.” When Spring Peach mentioned this young master Gu, her eyes seemed to be shining.<br/><br/>Everywhere today, Gu Yang’s reputation is soaring. No one could match him, and countless people talked interestingly about his legendary deeds.<br/><br/>Jingzhou is located at the very south of Great Zhou; the various feats of Gu Yang have already spread there.<br/><br/>In modern words, he is now the top influencer in Great Zhou, with countless wild fans, and Spring Peach is clearly one of them.<br/><br/>“Gu Yang?”<br/><br/>Pei Qianlan was feeling a bit confused, and asked, “What happened exactly?”<br/><br/>Spring Peach recounted the whole incident.<br/><br/>The process was not complicated; she, driving the carriage, was so anxious as she couldn’t find anyone around even after a long search.<br/><br/>Then Gu Yang appeared with the mistress and the young master, saying that he was passing by and happened to see some villains trying to harm them, so he saved them casually.<br/><br/>“…Master Gu said he had important matters to attend to and left after leaving the mistress and the young master in my care. Distributing grace without expecting reciprocation; Master Gu truly has the demeanor of a gentleman.”<br/><br/>Spring Peach said with an excited expression.<br/><br/>Pei Qianlan, however, felt something was not right.<br/><br/>She remembered that it didn’t take her much time to find Little Dragon, then she fainted.<br/><br/>Spring Peach, however, said that she had been searching for a long time before she ran into Gu Yang.<br/><br/>So, where had Gu Yang taken her and Little Dragon during the time she was unconscious?<br/><br/>Several images flashed through Pei Qianlan’s mind, her heart feeling as if it were gripped tightly, her face turning deathly pale.<br/><br/>“Glad to have accomplished my mission.”<br/><br/>On the other hand, after Gu Yang had handed the prince and princess of Jinghai over to the lady driving the horse carriage, he went to join Su Qingzhen and the others. These words were addressed to Wu Xingyun.<br/><br/>He knew that Wu Xingyun probably still had some emotional entanglements with these two “siblings” of the same mother, so he did not bring them over, an approach that was out of sight and out of mind.<br/><br/>Of course, only he knew how much of this was due to embarrassment.<br/><br/>Wu Xingyun performed a grand ceremony of thanks, “Thank you.”<br/><br/>Gu Yang helped him up, saying, “Don’t be so formal with me.”<br/><br/>However, he couldn’t help but sigh. Surely Wu Xingyun would never know that it was his request to save the “brother” from a different mother that resulted in a complete change to the future.<br/><br/>According to the original course of events, after pulling out the Divine Sword, the prince of Jinghai was supposed to die by Meng Ping’s hand.<br/><br/>The subsequent father, the king of Jinghai, in his grief, reconciled with Wu Xingyun. Later, he even bequeathed the throne to Wu Xingyun.<br/><br/>Now, the young prince is alive and has obtained a Divine Sword, his future destiny is undoubtedly soaring.<br/><br/>The king of Jinghai might have a change of heart towards Wu Xingyun.<br/><br/>The sequence of these changes was simply due to Han Mengling’s suggestion to go to Sword Mountain for a changing view and his agreement just out of curiosity about her antics.<br/><br/>Such a minor change ended up changing the fate of three, no, four people.<br/><br/>Meng Ping; the brother and sister who originally would have died at the hand of Meng Ping; and Wu Xingyun.<br/><br/>Gu Yang sighed a little.<br/><br/>However, he will never be a loser.<br/><br/>He had saved the king of Jinghai’s son and daughter; he certainly couldn’t have done so without some kind of reciprocation, right?<br/><br/>Two million for the son, a fifty percent discount for the daughter, one million. An accumulated three million doesn’t seem unreasonably high, does it?<br/><br/>PS: The first update is here, asking for monthly tickets. The next update will be before nine.\t\t\t\t\t\t</div>", "images": {}, "success": true}