{"id": 118, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14302290.html", "title": "Chapter 118 - Chapter 118: 118 Divine Firmament Six Extinctions", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 118 - Chapter 118: 118 Divine Firmament Six Extinctions</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 118: 118 Divine Firmament Six Extinctions<br/><br/>Translator: 549690339<br/><br/>Yi Yi?<br/><br/>When they heard his name, everyone present was shocked.<br/><br/>So, he was the enigmatic one, the man no one had ever met before, who only existed on the Heavenly Talent List, the Yi Yi!<br/><br/>And he was actually in Juyang City today.<br/><br/>Almost everyone present turned their gaze towards Gu Yang in an instant.<br/><br/>As soon as Yi Yi stated his name, those with sharp minds guessed that he was definitely here for Gu Yang.<br/><br/>As for Guo Taiping, he was completely overlooked by everyone.<br/><br/>Although Guo Taiping hailed from the Guo Family, one of the nine most influential families, and ranked sixth on the Heavenly Talent List, his reputation and legend could not compare to the youngest First Rank and Yi Yi at the top of the list, either in fame or legend.<br/><br/>Despite being first on the Hidden Dragon List, Gu Yang’s record was too legendary as he slew a First Rank as a Second Grade, defeated heavenly prodigies, and climbed into the First Rank within an extremely short period of time.<br/><br/>Without a doubt, he was the most outstanding figure of this era, and even the ones on the Heavenly Talent List paled in comparison to him.<br/><br/>Yi Yi, the top-ranking individual of the Heavenly Talent List, might be the only one who could barely compare to him.<br/><br/>Yi Yi was too enigmatic. He made it onto the Heavenly Talent List eight years ago and became its leader.<br/><br/>No one had met him, nor did anyone know what kind of cultivation method he was practicing, just an enigma known only to be on the Heavenly Talent List.<br/><br/>It was this mystery that cloaked him in a unique aura.<br/><br/>Today, he appeared in front of everyone for the first time, showing up in front of Gu Yang and issuing a challenge.<br/><br/>These were the two most outstanding youth of the present times.<br/><br/>They were about to decide who was the most distinguished among the younger generation.<br/><br/>This battle was destined to become legendary.<br/><br/>“Damn it!”<br/><br/>The completely overlooked Guo Taiping realized he had become nothing more than a foil, no, not even a foil. His heart was filled with rage.<br/><br/>The future head of the prestigious Guo Family, a peerless genius, was being ignored like this?<br/><br/>He wished he could summon his Sixth Uncle to come out and chop the two men in front of him to feed the dogs.<br/><br/>“The first on the Heavenly Talent List, Yi Yi? He actually wants to challenge Young Master Gu, can…can Young Master Gu handle it?”<br/><br/>Inside the carriage stuck at the back, Spring Peach started to worry when she heard what the man had said.<br/><br/>Outside, a First Rank guard said quietly, “Gu Yang is a First Rank, while Yi Yi is only a Second Rank.”<br/><br/>Only then did Spring Peach come to her senses. Yes, Yi Yi was only a Second Rank after all.<br/><br/>She was extremely puzzled. “Where does he get the confidence to challenge Young Master Gu?”<br/><br/>The First Rank expert outside said, “If I’m not mistaken, he wants to use Gu Yang to break his own limits and step into the First Rank Realm.”<br/><br/>For the ones on the Heavenly Talent List, it was difficult to breakthrough to the First Rank as well and would require more than a decade of accumulation.<br/><br/>Freaks like Gu Yang were rare in a thousand years and naturally caused a great shock.<br/><br/>To speed up the breakthrough, they needed an opponent strong enough to stimulate their potential in life-and-death situations and step into the First Rank.<br/><br/>That being said, this method was extremely risky and a slight mistake could cost them their lives.<br/><br/>The fact that Yi Yi dared to come showed his immense confidence.<br/><br/>“Spring Peach was outraged, “He dares to use Young Master Gu as a stepping stone, this is outrageous! Isn’t he afraid that Young Master Gu might kill him?”<br/><br/>The First Rank mentioned, “Yi Yi is a disciple of the Heavenly Saint Sect.”<br/><br/>The Heavenly Saint Sect, one of the Six Major Sects and the most mysterious among them. It rarely saw disciples coming to the world, but every generation had disciples making it to the Heavenly Talent List, and then climbing up to the Guru List.<br/><br/>The Guru List contained all those in the Divine Power Realm.<br/><br/>This meant that every generation of the Heavenly Saint Sect was producing Divine Power Realm cultivators.<br/><br/>Such a rate of producing successful disciples was something no other sect could achieve.<br/><br/>However, about every hundred years, one of the Divine Power Realm disciples of the Heavenly Saint Sect would vanish from the Guru List.<br/><br/>The Heavenly Saint Sect had many individuals of divine power realm. They appeared on the List of Prodigies, then on the List of Sect Masters, and finally disappeared from the Sect Masters List, without ever revealing themselves in the martial world.<br/><br/>There was a reason why people called this sect the “sect that existed only on the lists”.<br/><br/>However, there were still disciples from the Heavenly Saint Sect who left their marks in the human realm.<br/><br/>In history, two disciples of the Heavenly Saint sect were killed during their journeys in the martial world. Not long after, the killers were annihilated overnight.<br/><br/>The ones who struck, were the ones in the divine power realm.<br/><br/>Since then, no one dared to touch the disciples of the Heavenly Saint Sect.<br/><br/>Inside the carriage, Pei Qianlan listening to the conversation of the two, couldn’t help but worry. That Yi Yi, daring to challenge, he must have some confidence…<br/><br/>Thinking of this, her hands clutching the corner of her clothes tightened.<br/><br/>In the crowd, Gao Fan, staring at Yi Yi, his brows slightly furrowed, seemed somewhat puzzled.<br/><br/>Then, with a quick glance, seeing his naive disciple still standing there in shock, he sighed, was this silly boy waiting to die by not escaping?<br/><br/>The shockwaves from the fight between these two could take his life.<br/><br/>At this moment, Gu Yang was seen pushing Feng Tianci to the side. He leapt and carried the little girl who fell, landing more than ten metres away.<br/><br/>This was somewhat unexpected for Gao Fan. It was rumored that Gu Yang had a bloodthirsty temperament with a heart to kill.<br/><br/>That day, he clearly promised to spare the Liu Family, but later reneged on his promise, wiping out all members of the Liu family, leaving no survivors.<br/><br/>It seems that rumours can’t be trusted.<br/><br/>On the other side, Su Qingzhen and others stood afar. They knew very well that they couldn’t help in any way, the most important thing was not to drag them down.<br/><br/>“Yi Yi!”<br/><br/>Wu Xingyun, looking at the figure not far away, felt a mix of emotions. There was a time when this man was his target.<br/><br/>Anyone who had ever topped the Hidden Dragon List once dreamt of overpowering all the figures in the List of Prodigies, to prove they were second to none.<br/><br/>He had, and so had Chu Xiyue.<br/><br/>And Yi Yi, at the top of the List of Prodigies, was without a doubt the ultimate target.<br/><br/>Now, he could finally witness this battle between the top of the Hidden Dragon List and the List of Prodigies with his own eyes.<br/><br/>Perhaps today, he could witness history being made, seeing Gu Yang, the legacy wish of every number one on the Hidden Dragon List – defeating the number one on the List of the Prodigies.<br/><br/>Now, Wu Xingyun has absolute trust in Gu Yang’s strength.<br/><br/>When he was at the second grade, he could kill a first-ranker. Let alone after achieving the first rank, his strength has improved tremendously.<br/><br/>After pushing the young man next to him away, Gu Yang remained silent, gripping his Phoenix Feather Knife, a glint of killing intent in his eyes.<br/><br/>Yi Yi had killed him so many times in the simulator. Even though it was only a simulator, the money used was real.<br/><br/>He made him waste so much money.<br/><br/>Now, it was finally time to settle the score.<br/><br/>As the killing intent on him spread, the entire city gate fell deadly silent.<br/><br/>Everyone felt a terrifying aura surging, making their hair stand on end.<br/><br/>“Huh?”<br/><br/>Wu Xingyun and Xu Ruomei, who were most familiar with Gu Yang, were shocked. The momentum he wielded, was definitely not his usual “God Destroyer Nine Styles”.<br/><br/>What he used was another saber technique, its power seemed to be even greater than God Destroyer Nine Styles.<br/><br/>“This is…”<br/><br/>Gao Fan, hidden in the crowd, was shocked to the core, his heart stirred with amazement, “‘Godly Destruction of Six Heavens’? How could he know that person’s ‘Godly Destruction of Six Heavens’?”\t\t\t\t\t\t</div>", "images": {}, "success": true}