{"id": 114, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14302278.html", "title": "Chapter 114 - Chapter 114: 114 God-Destroying Style (Third Update, Seeking Monthly Tickets)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 114 - Chapter 114: 114 God-Destroying Style (Third Update, Seeking Monthly Tickets)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 114: 114 God-Destroying Style (Third Update, Seeking Monthly Tickets)<br/><br/>Translator: 549690339<br/><br/>High noon, two horsemen riding side by side, one fat and one thin. The fat one is a middle-aged man with a pale complexion, and the slim one is a dark-skinned young man.<br/><br/>The horses they are riding are also very thin, and they trot very slowly.<br/><br/>The young man, wiping his sweat, couldn’t help but ask, “Master, how far is it to Jingzhou City?”<br/><br/>The middle-aged man replied, “Almost there, another day’s journey, and we’ll arrive.”<br/><br/>“Master, I still don’t understand. What does the birthday of Jinghai Princess have to do with us? Why are we going so far to give her a gift?”<br/><br/>“You fool, she is Jinghai Princess, showing her favor would guarantee us a good life in the future.”<br/><br/>“Our Jade Door Sect is in such a shambles, what can we give to curry favor with a princess? Don’t think I don’t know that you sold the property our sect had to scrape together travel expenses.”<br/><br/>“What do you know? For this trip, I have brought out the most precious treasure of our sect. I heard that the princess has a fondness for swords. Offering her this sword will surely win her favor.”<br/><br/>That rusty old sword? Her favoring that would be a true oddity.<br/><br/>Feng Tianci couldn’t help but ridicule in his heart.<br/><br/>He regrets so much now. When he was young, he listened to this man’s nonsense and took him as his master.<br/><br/>Jade Door Sect is so impoverished now that he has to go out to earn money to support the whole sect, let alone to live a life of luxury.<br/><br/>If only he hadn’t been so naive back then.<br/><br/>“Suppose, just suppose, the princess doesn’t like this sword, then what will we do?”<br/><br/>“Then you’ll just have to go to the docks and do a laborer’s work to earn back our travel expenses.”<br/><br/>Seeing his master looking unfazed, Feng Tianci cursed him a hundred times in his heart.<br/><br/>After a while.<br/><br/>He eventually asked him out of annoyance, “What kind of person is this princess really?”<br/><br/>Gao Fan, the middle-aged man, suddenly perked up, “This princess, is no ordinary woman, originally ranked the fifth on the Hidden Dragon List, now, the sixth …”<br/><br/>“Wait.”<br/><br/>“She’s not even thirty yet?” queried Feng Tianci.<br/><br/>“Of course, or else how would she be on the Hidden Dragon List.”<br/><br/>“Jinghai King has been king for almost thirty years, hasn’t he?”<br/><br/>“This you don’t know, this princess is Jinghai King’s second wife. Speaking of this, we have to mention Wu Xingyun, currently ranked third on the Hidden Dragon List.”<br/><br/>Gao Fan started to babble on energetically when it came to gossip.<br/><br/>“Wu Xingyun’s mother, was once a maidservant of Jinghai King. Later, when the king’s first wife died. Wu Xingyun had already shown extraordinary talent. By rights, Jinghai King should have married his mother.”<br/><br/>“However, Jinghai King married this new princess who was even younger than Wu Xingyun. Not long after, Wu Xingyun’s mother also died. Since then, he has had a falling-out with the Jinghai King and went to Divine City alone to join the Martial Academy.”<br/><br/>Feng Tianci was dumbfounded.<br/><br/>He never expected such a melodramatic story. Even more so, that this pair of “mother-son” duo is both on the Hidden Dragon List with the son ranking ahead of the “mother”.<br/><br/>Gao Fan elaborated, “People say that Jinghai King committed a foolish act by choosing a woman over a gifted son.”<br/><br/>Feng Tianci asked, “Wasn’t it a foolish act?”<br/><br/>Gao Fan shook his head vigorously, “Throughout history, heroes have been stymied by beauty. This princess is listed in the Beauty list, Red Mansion’s critique praised her innate beauty. Moreover, her father was once a close comrade of Jinghai King. Jinghai King, a man of such stature, marrying her despite criticism, shows her charm …”<br/><br/>This was the first time Feng Tianci heard about Jinghai King’s scandalous past, and his opinion of this top-ranker on the First Rank list changed drastically.<br/><br/>Captivated by sensual pleasure, how could he be a hero?<br/><br/>“Huh?”<br/><br/>Suddenly, Gao Fan exclaimed.<br/><br/>“What’s wrong?”<br/><br/>Feng Tianci followed his gaze and gasped. There, not too far away, a mountain peak lit up with a halo that shot straight to the sky.<br/><br/>He stammered, “What… what is that?”<br/><br/>Gao Fan shook his head solemnly.<br/><br/>Just then, the ground shook and the mountain peak began to collapse and disintegrate.<br/><br/>The horses they were riding on were startled and they nearly tumbled off.<br/><br/>After finally getting the horse under control, Feng Tianci swallowed hard, “Mas…Master…”<br/><br/>“Don’t talk, run.”<br/><br/>Gao Fan decisively yanked the reins, turned the horse around, and dashed off.<br/><br/>Feng Tianci hurriedly followed suit.<br/><br/>They hadn’t run far when the two horses suddenly stumbled and fell, foaming at the mouth, they were clearly not going to make it.<br/><br/>The master and pupil abandoned their horses without a word and ran into a nearby dense forest.<br/><br/>Just as they entered, they heard a whooshing sound above them.<br/><br/>“Hand over the Divine Sword!”<br/><br/>A voice that sent chills down people’s spine rang out.<br/><br/>Feng Tianci was terrified. From the formidable air surrounding the two people outside, he had concluded that their strength was incredibly potent. And it was even tied to some Divine Sword.<br/><br/>If they were discovered, there’s a high chance that they would be killed to ensure silence.<br/><br/>Gao Fan put his finger to his lips, signaling him to stay quiet.<br/><br/>Following that, there was the sound of a sneer. A man was chopped in half at the waist, the scene was incredibly bloody.<br/><br/>Whoosh—<br/><br/>In the blink of an eye, another man appeared, carrying a young boy who was unconscious. The boy was clearly holding a sword in his hand, but the view was indistinct from the distance.<br/><br/>The harsh and grating voice rose again, “Why meddle in things that are none of your concern?”<br/><br/>The man holding the boy replied, “I had no choice, I owe someone a favor.”<br/><br/>“Hypocrite! Whatever your goal may be. Those who dare to obstruct me will die!”<br/><br/>“Meng Ping, the Divine Sword on Sword Cliff…”<br/><br/>Upon hearing his master’s mumbling, Feng Tianci’s heart jumped to his throat, fearing they might be discovered by the two powerful individuals outside.<br/><br/>Then, the male voice said, “I’ll use you to test this slash.”<br/><br/>Before the words could even fade, Feng Tianci felt as if time had stopped, his consciousness sluggish.<br/><br/>His master, within his field of vision, pupils dilating slowly, facial expressions incredibly calm, his lips parted slightly, “God… Destroyer… Style——”<br/><br/>Once the word “Style” was heard, his head buzzed and he blacked out, fainting on the spot.<br/><br/>Gao Fan supported his disciple, looking at the man outside with an extremely complex expression.<br/><br/>The last style of the “God Destroyer Nine Styles” reappeared in the human realm.<br/><br/>After a moment, he let out a long sigh of relief.<br/><br/>Luckily, it was not the “Heavenly Elemental God Slaying Art,” otherwise…<br/><br/>What Gu Yang used was indeed the final style of the “God Destroyer Nine Styles”, the Godslayer Style.<br/><br/>He had only recently mastered this style. Even though he had understood the moves previously, his cultivation level had limited him from executing them.<br/><br/>But now, his power had escalated, enabling him to perform this style.<br/><br/>It was great to use Meng Ping to test the power of this move.<br/><br/>This was also his confidence to chase after them.<br/><br/>An indescribable bizarre Blade Intent burst forth, with Meng Ping being the first to bear the brunt.<br/><br/>On his previously rigid face, a hint of terror appeared.<br/><br/>“Is this——”<br/><br/>Meng Ping opened his mouth, only uttering two words, the man stiffened there as if time had freeze.<br/><br/>His pair of eyes became blank, the light in his pupils dimming gradually.<br/><br/>“Little Dragon——”<br/><br/>Suddenly, a figure came flying from not far away, accompanied with a panicked cry.<br/><br/>At last, she saw the youth in the arms of the man nearby, then charged towards them.<br/><br/>Her speed was incredibly fast, quickly closing the gap of thirty meters.<br/><br/>However, all of a sudden, she felt a startling fright in her heart, as if her mind was frozen.<br/><br/>In her consciousness, a gigantic knife came slashing from the sky.<br/><br/>Before this knife, she appeared small and helpless, only able to watch as the knife fell upon her.<br/><br/>Her eyes momentarily lost their luster, and with a thud, she fell from mid-air.<br/><br/>“Damn it!”<br/><br/>Upon seeing the white figure, Gu Yang knew that something was amiss.<br/><br/>This strike, recently mastered, had not reached the level where he could easily control it.<br/><br/>If he forcefully retracted it, he might get severely injured, if not killed.<br/><br/>Without hesitation, Gu Yang let the blade fall.<br/><br/>The closest, Meng Ping, had completely dimmed eyes, toppling onto the ground.<br/><br/>His consciousness was completely erased by the slash, leaving his body as an empty shell, death was an understatement.<br/><br/>PS: I’m going to the hospital tomorrow morning to pick up some Chinese medicine, so the update will have to wait till the afternoon, perhaps before four. Since I started, I’ve been updating three times each day. That’s pretty diligent of me, right? Since it’s almost the end of the month, please drop some monthly votes in support.\t\t\t\t\t\t</div>", "images": {}, "success": true}