{"id": 110, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14302269.html", "title": "Chapter 110 - Chapter 110: Extreme Divine Skill Of 110 Days", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 110 - Chapter 110: Extreme Divine Skill Of 110 Days</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 110: Extreme Divine Skill of 110 Days<br/><br/>Translator: 549690339<br/><br/>[…You run away, but can never shake off your pursuers. Several times, you’re caught and injured. Unbeknownst to you, you escape into Lian Mountain.]<br/><br/>[Deep in Lian Mountain, you are caught once again and in the midst of a fierce battle. Suddenly, a gust of cold wind rises, and a dark shadow lunges towards you. In the chaos, you realize that the shadow seems wary of your True Essence. Just as you try to break away from the battle, the First Rank fighter holds you back.]<br/><br/>[In the chaos, you realize that the shadow’s power is extremely corrosive, a nightmare for any warrior. If the battle continues, you and the other warrior will certainly die, drained of all energy. So you propose a joint effort. If not, no one will be able to leave alive.]<br/><br/>[You two join forces and manage to suppress the shadow.]<br/><br/>[Eventually, the First Rank fighter holds back the shadow with all his might, and you unleash an attack that obliterates the shadow.]<br/><br/>[The next moment, the First Rank fighter catches you off-guard with a sudden attack, leaving you seriously injured. At the critical moment, an odd power within you erupts into a cloud of dark mist surrounding the First Rank fighter. A surge of copious True Essence enters your body.]<br/><br/>[When the dark mist disperses, the First Rank fighter has turned into a desiccated corpse. You sit down and spend half a month assimilating the absorbed True Essence.]<br/><br/>[In you, a new consciousness appears, calling itself the Heavenly Extreme Taoist. It claims to have bestowed on you the Heavenly Extreme Divine Art, a technique capable of absorbing the True Essence of other martial artists for your own use. It is said to be the supreme art ever existed.]<br/><br/>[You know this consciousness must have been that shadow earlier, so you suppress it at the deepest part of your sea of consciousness.]<br/><br/>[Several days later, you join up with others, including Su Qingzhen.]<br/><br/>[You discover that you can’t control the evil thoughts surfacing in your mind. On your way to Jingzhou, you can’t help but bring several women around you into your room.]<br/><br/>[Just before arriving at Jingzhou, Yi Yi, number one on the Genius List, appears before you. A murderous impulse arises within you, and you kill him on the spot with a decisive stroke.]<br/><br/>[Days later, word of your practice of “Phoenix Dance Nine Heavens” spreads throughout the world, attracting a First Rank expert of the Shen Family. You stand no chance against him and suffer heavy injuries, but seize an opportunity to drain his power using the Heavenly Extreme Divine Art.]<br/><br/>[Your power drastically increases, the desire in your heart runs wild, and you start hunting down First Rank fighters, absorbing their power with the Heavenly Extreme Divine Art.]<br/><br/>[Several months later, your cultivation level reaches the pinnacle of First Rank. You set your sights on Jinghai King, planning to use him to ascend into the Divine Power Realm. However, before you can act, you are besieged by several First Rank fighters of Jingzhou.]<br/><br/>[You absorb all of them but are on the verge of crossing that final step when a Sword Saint appears and cuts you down with a single stroke. You die at the age of twenty-three.]<br/><br/>After reviewing this simulation, Gu Yang can’t help but exclaim about the new ways he continues to die. Being killed by a Sword Saint, though, at least gives him some fame.<br/><br/>So, the shadow in Lian Mountain was that terrifying?<br/><br/>In several of his previous simulations, he had encountered a shadowy creature in Lian Mountain that devoured him alive.<br/><br/>Even by joining forces with another First Rank fighter, they barely managed to kill the creature. But then, it cleverly parasitized him and ended up corrupting him instead.<br/><br/>How could he, a model youth growing up in the new society, possibly do something as vile as plundering others’ power?<br/><br/>It definitely was because he got corrupted.<br/><br/>[Simulation ending. You may keep one of the following items.]<br/><br/>[One, your martial arts realm at the age of twenty-three.]<br/><br/>[Two, your martial arts experience at the age of twenty-three.]<br/><br/>[Three, your life wisdom at the age of twenty-three.]<br/><br/>Looking at these three options, Gu Yang feels torn for the first time.<br/><br/>That’s the pinnacle of First Rank! He doesn’t know how many more years of cultivation and how many more simulations it will take for him to reach that realm.<br/><br/>What a pity.<br/><br/>He must have abandoned “Phoenix Dance Nine Heavens” in the simulation and started practicing the power-absorbing Heavenly Extreme Divine Art.<br/><br/>To practice “Phoenix Dance Nine Heavens”, he had used at least nine simulations and finally reached the First Rank realm. Abandoning it now in favour of another practice would mean he had gone mad.<br/><br/>Not to mention that the so-called Heavenly Extreme Divine Art has such a powerful negative effect.<br/><br/>If he had wanted to practice something like that, wouldn’t he have been better off choosing the “Heavenly Elemental God Slaying Art” right from the start?<br/><br/>Gu Yang has a suspicion that if he chooses the first option, that weird consciousness might reappear in him.<br/><br/>“I choose the second option.”<br/><br/>Suddenly, his mind is flooded with vast and complex knowledge, including the method of absorbing others’ power.<br/><br/>After taking a look, Gu Yang chuckles, “Huh, what a bullshit Heavenly Extreme Divine Art, it’s nothing but a lie.”<br/><br/>The so-called Heavenly Extreme Divine Art is actually the dark mist residing within him.<br/><br/>There were no heart method or cultivation ways involved. Whenever he wanted to absorb someone’s power, he would use his mental power to activate it, and a dark fog would surge forward and cover the person. After absorbing the person’s power, it would be transformed into his True Essence.<br/><br/>The entire process was under the control of an eerie consciousness dwelling within him.<br/><br/>“This creature is at least a Divine Realm existence. But I don’t know what its origins are.”<br/><br/>Gu Yang retained the martial arts experience from this simulation and also learned some details of this eery entity.<br/><br/>The reason he was possessed by it was because while killing it that day, he used the Devouring Heaven Technique, giving the creature an opportunity to sneak into his body. Unable to exorcise it, he was gradually corroded by it<br/><br/>Gu Yang looked at Su Qingzhen, who was sitting at the foot of the bed, and sensed that the temperature around her had dropped somewhat, an indication that her cultivation was going well.<br/><br/>“Once more.”<br/><br/>He had already figured out a countermeasure.<br/><br/>The First Rank who wanted him dead didn’t have stronger Sword Techniques than him, he relied solely on his deeper power.<br/><br/>Dealing with this person wouldn’t be difficult as long as he elevated his cultivation level.<br/><br/>[At 22 years old, you are First Rank cultivation, and your fame has spread across the world. You killed Liu Zhe in Ba County, exterminating the Liu family.]<br/><br/>[The next day, Chu Xiyue bid you goodbye and left.]<br/><br/>[Later, you took Su Qingzhen and went to find Ling Ling, bringing them both into the Secret Realm within Tianzhu Mountain to hide.]<br/><br/>[You devotedly cultivated there.]<br/><br/>[Five years later, Ling Ling advanced to First Rank.]<br/><br/>[Three years later, Su Qingzhen also advanced to First Rank. She opened the prohibition of the cave mansion and obtained the Ice Soul Divine Sword.]<br/><br/>[Seven more years pass, and Ling Ling broke through to the Divine Realm, breaking the prohibition of the Secret Realm and returning to Tianzhu Mountain.]<br/><br/>[Ling Ling was determined to enter the Sword Tomb and retrieve the Divine Sword that her family had been protecting for generations. You all sneaked into the Sword Tomb and faced various trials. As you smashed through the final barrier, the sky shook and a Blade Intent soared into the sky from within, piercing the heavens.]<br/><br/>[Suddenly, a gigantic hand stretched out from the Tomb, killing Ling Ling with a palm attack and seizing that Divine Sword. Under the terrifying power, the entire Sword Tomb was destroyed. You were affected and died on the spot, aged 37.]<br/><br/>After seeing the ending, Gu Yang felt heartbroken, struggling to breathe. He had lived thirteen years less than before. Thirteen years!<br/><br/>Now, he had to spend 500,000 taels for each simulation. Every year was extremely precious, and in many situations, he didn’t even live as long as thirteen years in a single simulation.<br/><br/>He felt like he had lost a fortune.<br/><br/>But at least he now knew that there was an incredibly terrifying being within the Sword Tomb.<br/><br/>Ling Ling was already at the Divine Realm, yet she was still killed by a slap. How high could the cultivation of the person inside be?<br/><br/>Mana Realm? Or the Unleaking Realm?<br/><br/>Could this person be Luo Wang, the Sea Stabilizing Divine Needle from Great Zhou?<br/><br/>Many guesses flickered in Gu Yang’s mind.<br/><br/>[Simulation has ended. You can retain one of the following options.]<br/><br/>[One: Martial Arts Realm at the age of 37.]<br/><br/>[Two: Martial Arts experience at the age of 37.]<br/><br/>[Three: Life wisdom at the age of 37.]<br/><br/>He immediately chose the first option.<br/><br/>Very quickly, he experienced the delight of his True Essence surging powerfully.<br/><br/>“It’s not enough, once more.”<br/><br/>Gu Yang activated the system again.<br/><br/>PS: Still asking for monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}