{"id": 113, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14302272.html", "title": "Chapter 113 - Chapter 113: Hand Over The 113 Divine Swords.", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 113 - Chapter 113: Hand Over The 113 Divine Swords.</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 113: Hand over the 113 Divine Swords.<br/><br/>Translator: 549690339<br/><br/>Wu Xingyun saw that Gu Yang’s attention was on that weird-looking man. He whispered, “That man’s name is Meng Ping. He was a renowned swordsman who once dominated the northern regions. But over a decade ago, he was defeated by the North Mountain Sword Saint, who was only at the First Rank realm at that time. Since then, he has been scouring the globe for divine weapons.”<br/><br/>“A decade ago, even after the North Mountain Sword Saint had achieved the realm of Divine Power, this man came to Sword Mountain and has been sitting here ever since, never leaving. It seems like he’s been trying to comprehend the mystery of this Divine Sword. However, he has never harmed anyone, so there’s no need to worry.”<br/><br/>Only then did Gu Yang understand the backstory of the weird man. He asked, “Which power or Sect does he come from?”<br/><br/>“A minor Sect. So far, he is the only one from that Sect who has reached the First Rank.”<br/><br/>Well, despite having produced a First Rrank, it was still considered a minor Sect.<br/><br/>It seems that aside from the noble Nine Clans and Six Major Sects, there was no such thing as a major Sect.<br/><br/>Gu Yang felt some sympathy for the man. He knew all too well the pains of not having access to high-level martial arts techniques.<br/><br/>If there were alternatives available, why would a First Rank powerhouse sit still and wither away for ten years?<br/><br/>As they were discussing this—<br/><br/>“Stop!”<br/><br/>A thunderous shout startled the young servant girl, Zhi Xing, causing her to let go of the sword hilt and retreat a step.<br/><br/>Moved by curiosity, she had stepped forward to touch it.<br/><br/>The embroidered-robed youth sprang forward in an instant, snapping at Gu Yang and the others in a harsh tone, “The Divine Sword is mine. Nobody is allowed to touch it!”<br/><br/>Gu Yang found it amusing. It’d been a while since he saw someone so oblivious and arrogant. He was just about to respond when his expression suddenly hardened.<br/><br/>He noticed a somewhat chubby figure silently appearing behind the youth. It was a First Rank powerhouse.<br/><br/>Having a First Rank powerhouse as an attendant suggested the youth was of high status.<br/><br/>Gu Yang was here for a profit, not trouble. He smiled sarcastically, “If you can pull it out, then it’s yours.”<br/><br/>The elegantly dressed youth snorted, “I – the Young Master – will certainly pull it out.”<br/><br/>With that, he turned around, rolled up his sleeves, and grasped the sword hilt.<br/><br/>When Gu Yang heard the youth’s self-designation, a thought twitched in his mind. He studied the youth further and noticed a resemblance with a certain person, leading him to guess the youth’s identity.<br/><br/>He turned to look at Wu Xingyun, whose expression was complex, confirming his guess.<br/><br/>This youth was the son of the King of Jingzhou.<br/><br/>Looking at his age, he must be Wu Xingyun’s younger half-brother.<br/><br/>Gu Yang only knew that Wu Xingyun was an illegitimate child of the King of Jingzhou, who ran away from home and ended up in the Divine City by himself, joining the martial arts institute.<br/><br/>As for the reasons why Wu Xingyun had run away from home, he was not clear on the details.<br/><br/>The young man in the embroidered clothes crouched down in a horse stance, tightly gripping the hilt of the sword and shouting forcefully, “Rise!”<br/><br/>In that moment, the ground began to shake.<br/><br/>Everyone present, including the First Rank powerhouse behind the youth, wore a face of disbelief.<br/><br/>The source of the shaking ground was exactly where the sword in the youth’s hand was located.<br/><br/>Gu Yang wore a strange expression as he looked at the youth, an odd thought flashing through his mind.<br/><br/>What was this?<br/><br/>Wasn’t it said that even a Divine Power couldn’t lift this sword?<br/><br/>Could it be that this boy is the fabled ‘Child of Destiny’?<br/><br/>That would raise a question.<br/><br/>In the previous simulations, why did Wu Xingyun inherit the throne following the death of the King of Jingzhou?<br/><br/>As the ground shook more intensely, an eye-dazzling radiance suddenly shone from the rusty sword.<br/><br/>Having lain beneath the stone for a thousand years, it revealed its true power for the first time.<br/><br/>The youth in the embroidered robe, trembling all over with his eyes shut tightly, a twisted expression on his face and veins showing on his forehead, was clearly exerting all the strength he could muster.<br/><br/>The Divine Sword was being pulled out inch by inch. Its light grew ever brighter, almost soaring into the sky, completely engulfing the youth.<br/><br/>“Ah——”<br/><br/>The youth emitted a roar.<br/><br/>Finally, he managed to completely pull out the sword.<br/><br/>There was a thunderous, deafening sound.<br/><br/>As the ground shook violently, the stone hill collapsed.<br/><br/>Gu Yang cried out, “Lily!”<br/><br/>Lily reacted instantly. Taking out the crystal ball, she quickly chanted a spell. A force field immediately enveloped the group present.<br/><br/>Everyone felt lighter instantly, as if they were feathers, starting to drift downwards.<br/><br/>The Feather Fall Spell!<br/><br/>“How dare you!”<br/><br/>Just then, an enraged shout came from not too far away.<br/><br/>Then, came an astonishing surge of sword energy, followed by various sounds of air being torn apart, and an astonishing force, sending a myriad of crushed stones sweeping toward Gu Yang and his group, affecting them as well.<br/><br/>Gu Yang lifted his hand and pushed forward, an invisible air wall instantly appeared in front of him, blocking all the incoming crushed stones.<br/><br/>“Brother Gu!”<br/><br/>Suddenly, Wu Xingyun grabbed his hand, pleading in his eyes.<br/><br/>Without extra words, Gu Yang could guess what he wanted to say, and asked, “Are you sure?”<br/><br/>Wu Xingyun said, “No matter what, he is my younger brother.”<br/><br/>“Alright.”<br/><br/>Gu Yang stopped talking, and turned towards Lily and said, “Take them to a safe place, I will return shortly.”<br/><br/>After finishing, he unsheathes the Phoenix Feather Knife, his body already bounding into the air.<br/><br/>After a short moment, Gu Yang found the brawling parties, who had fought from the mountain to the ground, with one chasing, and one fleeing.<br/><br/>From afar, he saw the crown prince of Jinghai being carried on the shoulder of the middle-aged man, blood smeared all over the man, evidently he had sustained significant injuries.<br/><br/>The prince was clearly unconscious, tightly clutching the legendary Divine Sword in his hand.<br/><br/>Close behind, Meng Ping was in relentless pursuit.<br/><br/>“Hand over the Divine Sword.”<br/><br/>His voice was hoarse and unpleasing, portraying an icy murderous intent.<br/><br/>As though sensing someone chasing behind him, the man suddenly erupted in amazing sword intent, as the sword slipped from his grasp transforming into a rainbow sword, shooting forth.<br/><br/>Sensing danger, the middle-aged man knew he had no escape, suddenly tossed the prince from his shoulder, and turned to face the incoming sword.<br/><br/>Swish!<br/><br/>The sword in his hand instantaneously broke into two parts, the sword rainbow with unspent momentum, sliced him across the waist into two, instantly killing him.<br/><br/>At this moment, Gu Yang finally arrived, he caught the falling prince mid-air, and turned his head towards the unkempt and beggar-like man.<br/><br/>Meng Ping used a grating metal-like voice and said, “Why meddle in others’ affairs?”<br/><br/>Gu Yang replied, “I have no choice, owing someone a favor.”<br/><br/>Of course, it wasn’t only because of Wu Xingyun’s situation.<br/><br/>For his trip to Jingzhou, he planned to sell Qian Xiyun’s business for a good price. If he could establish a relationship with the Jinghai Prince, many things would be much easier.<br/><br/>Besides, after saving this young lad, could the Jinghai Prince not express his gratitude?<br/><br/>On account of Wu Xingyun, a discount at the most, asking for two million wasn’t excessive, right?<br/><br/>Gu Yang was thoroughly considering this in his mind.<br/><br/>Meng Ping saw through his insincerity at a glance and coldly said, “Hypocrite! No matter what your intentions are, anyone who dares to stop me will die!”<br/><br/>The sword made a round before returning to his hand again.<br/><br/>With the sword in his hand, the murderous intent in his eyes grew increasingly stronger.<br/><br/>On the other side, Lily and the rest finally landed on the ground, staring at the stone mountain, which was nearly a thousand meters tall, now completely vanished, leaving them somewhat shocked.<br/><br/>This time, if not for Lily’s magic, under such disaster, they would have had no chance of survival.<br/><br/>Gu Yang only had two hands, how many people could he save?<br/><br/>The maid Zhi Xing worriedly said, “Will Brother Gu be okay?”<br/><br/>Upon hearing her words, everyone’s faces filled with concern.<br/><br/>Just now, Wu Xingyun had mentioned that Meng Ping already had First Rank strength over a decade ago, by now who knows how strong he might have become.<br/><br/>Han Mengling stated quietly, “If it’s two against one, even if they can’t defeat him, they should be able to escape, right?”<br/><br/>Just then, a luxurious carriage rushed from not too far away. The horses pulling the carriage were all pure white, without a single impure hair, they were exquisitely magnificent and considered among the best in the world.<br/><br/>Despite there being no road here, the carriage continued to move unperturbed.<br/><br/>Seeing the carriage, Wu Xingyun’s expression drastically changed.<br/><br/>Shortly, the carriage stopped beside them, the woman driving the carriage, dressed as a maid, asked, “Have you seen the prince of my house?”<br/><br/>Zhang Xiao Hai reacted the fastest and said, “Someone is trying to kill your prince, go save him—”<br/><br/>Before he could finish speaking, the roof of the carriage was punctured and a white figure took off, disappearing in a blink of an eye.<br/><br/>“Our young master— well, he has already gone to the rescue.”<br/><br/>Upon seeing this, the carriage’s maid cried anxiously, “My lady, wait for me.” She whipped the carriage and hurriedly chased after.<br/><br/>PS: Why the chapter was late. There was a conflict, I got sidetracked and read news for two hours. But that’s it, please vote for the month.\t\t\t\t\t\t</div>", "images": {}, "success": true}