{"id": 111, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14302270.html", "title": "Chapter 111 - Chapter 111: Just Be A Bit More Cautious (Asking For Monthly Ticket)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 111 - Chapter 111: Just Be A Bit More Cautious (Asking For Monthly Ticket)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 111: Just be a bit more cautious (Asking for monthly ticket)<br/><br/>Translator: 549690339<br/><br/>“At twenty-two, you had already achieved First Rank in cultivation level and your fame echoed across the world. You murdered Liu Zhe in Ba County, annihilating the entire Liu family.”<br/><br/>“The next day, Chu Xiyue bid you farewell and departed.”<br/><br/>“Afterward, you led Su Qingzhen, Xu Ruomei, Lily, and Han Mengling to Tianzhu Mountain and entered the Secret Realm.”<br/><br/>“Eight years later, Su Qingzhen reached First Rank, lifted the prohibition from the cave mansion, and acquired the Ice Soul Divine Sword.”<br/><br/>“Another year passed, and Xu Ruomei reached First Rank.”<br/><br/>“Two years later, Han Mengling demonstrated Divine Power, and with a loud laugh, she broke the prohibition of the Secret Realm and vanished.”<br/><br/>“You took this opportunity to leave the Secret Realm and rendezvous with Ling Ling.”<br/><br/>“Seven years later, Ling Ling attempted to reach the Divine Power Realm and was besieged by several First Rank beings. You, Su Qingzhen, and Xu Ruomei, held off those First Rank beings, allowing Ling Ling to successfully break through to the Divine Power Realm.”<br/><br/>“Just then, a powerful being in the Mana Realm rushed over, intending to kill you. At the critical moment, a sword from beyond the sky came slashing down, blocking the Mana Realm powerhouse, and Ling Ling seized the chance to flee with you.”<br/><br/>“Once this matter was settled, Xu Ruomei bid you farewell, stepped forward, and demonstrated Divine Power before returning to the Sword Palace.”<br/><br/>“Soon afterward, Qin Wu led troops to attack Great Zhou. Four celestial beings engaged in a fierce battle, opening a channel to a certain cave heaven, and the Star Luo Gate launched a massive invasion.”<br/><br/>“You headed to Jingzhou, found a large ship, and set sail.”<br/><br/>“Two months later, you encountered two beings in the Divine Power Realm involved in a fierce fight on the open sea. The ship’s crew suffered heavy casualties due to the ensuing chaos. You lost your bearings at sea and, a month later, drifted onto a strange continent.”<br/><br/>“You decided to settle on this continent, you found a place to live in seclusion and concentrated on cultivation.”<br/><br/>“Five years later, Su Qingzhen entered the Divine Power Realm. By then, you had inquired about the general situation of this continent and discovered that there were only three beings in the Divine Power Realm. You decided to stop laying low and claimed a territory.”<br/><br/>“Three years later, several large ships from Great Zhou landed on the continent. Upon contact, you found out that they were the Great Zhou royal family escaping calamity. Ling Ling, upon learning their identities, immediately attacked.”<br/><br/>“A great battle ensued. You were captured by the enemy’s scheme, and Ling Ling and Su Qingzhen, reluctant to harm you as you were their hostage, were forced to cease their attack.”<br/><br/>“Half a month later, several Star Luo Sect beings with Divine Power arrived and attacked without asking any questions. Against their will, Ling Ling and Su Qingzhen fought back.”<br/><br/>“After a great battle, they united and annihilated all the disciples from the Star Luo Sect. The Great Zhou royal family suffered heavy losses, and Ling Ling and Su Qingzhen were both severely injured. The queen of Great Zhou released you, and then, she took her people and set sail into the vast sea on the only remaining large ship.”<br/><br/>“After this battle, Ling Ling no longer possessed the desire for revenge. After the two women had recovered from their injuries, they left the continent on a large ship they had built over the years.”<br/><br/>“Several months later, one night, a shadow appeared in the sea and swallowed the large ship. You died at the age of forty-nine.”<br/><br/>After reading this, Gu Yang was shocked.<br/><br/>What on earth was Han Mengling playing at?<br/><br/>She had actually ascended to the Divine Power Realm in just ten years.<br/><br/>Her current cultivation level is only sixth-grade; given her age, her talent is quite remarkable.<br/><br/>However, reaching the Divine Power Realm in just ten years sounds a bit exaggerated.<br/><br/>It turns out she was the one with the highest talent within their group.<br/><br/>And then there’s Xu Ruomei, who somehow, mysteriously recovered her power, reaching First Rank nine years later.<br/><br/>This had never been mentioned in previous simulations.<br/><br/>“Could it be because of that Secret Realm?”<br/><br/>After much pondering, Gu Yang could only attribute it to this reason.<br/><br/>Previously, he had never considered taking Xu Ruomei, Lily, and Han Mengling into the Secret Realm.<br/><br/>To put it bluntly, he just didn’t trust them enough.<br/><br/>It was only this time, now that he had reached First Rank and had enough strength, that he decided to bring them along.<br/><br/>Who would have thought each of them would surprise him this much?<br/><br/>The only normal one seemed to be Lily.<br/><br/>The subsequent developments also completely caught him off guard.<br/><br/>Even the Great Zhou royal family had fled overseas; it seemed the entire Great Zhou couldn’t handle the Star Luo Sect.<br/><br/>The nine major families and the six major sects probably didn’t fare well either.<br/><br/>He wasn’t sure how the four legendary Sacred Lands fared.<br/><br/>“What a pity. The simulation’s information was too brief and even if he had chosen wisdom, he would not be able to inherit memory. Otherwise, using the foresight ability, he could establish himself in an invincible position.”<br/><br/>Gu Yang thought with some regret.<br/><br/>Now, he only knew that eighteen years later, Qin Wu, who had achieved the status of a Celestial Being, would rise in rebellion against the Great Zhou, leading to the opening of the parallel channel and a massive invasion by the Star Luo Sect.<br/><br/>He was completely in the dark about the background and strength of this Star Luo Sect.<br/><br/>“Also, this death really came out of nowhere.”<br/><br/>Gu Yang looked at the final outcome and felt a bit dismayed.<br/><br/>He survived the pursuit of the mana realm expert who was hunting Ling Ling, endured the war with the Great Zhou, and even the pursuit of the experts from the Star Luo Sect. But after going out to sea, he died inexplicably without even knowing how he died.<br/><br/>Could it be the legendary Ghost Sea, one of the five most dangerous places?<br/><br/>[Simulation ends, you can choose to keep one of the following items.]<br/><br/>[One, your martial arts realm at age forty-nine.]<br/><br/>[Two, your martial arts experience at age forty-nine.]<br/><br/>[Three, your life wisdom at age forty-nine.]<br/><br/>This time, he didn’t need to think about it and directly chose one.<br/><br/>Gu Yang once again experienced the joy of a sudden increase in his cultivation level, with his True Essence increasing by nearly twenty percent.<br/><br/>It was truly a great surprise.<br/><br/>Don’t underestimate this twenty percent. With his current cultivation level, his True Essence has reached its peak. Twenty percent was even greater than the total amount of True Essence most Second Grade practitioners had.<br/><br/>With a thought, he figured out why the increase was so great this time.<br/><br/>Because Su Qingzhi had reached the Divine Power Realm, their dual cultivation brought him immense benefits.<br/><br/>It seemed that her icy jade body had far more potential than just reaching the Divine Power Realm.<br/><br/>Gu Yang glanced at Su Qingzhi who was sitting at the end of the bed, a gratified smile appeared on his face.<br/><br/>He didn’t save the wrong person after all.<br/><br/>He didn’t continue the simulation but started to regulate his breath and experience his new power.<br/><br/>Early the next morning, before dawn, the maid, Zhi Xing, came to Gu Yang’s courtyard and peered inside.<br/><br/>Her mistress hadn’t returned all night, which made her anxious.<br/><br/>What if her mistress couldn’t restrain herself? What then?<br/><br/>How could she just be with him without any official status?<br/><br/>At least they should have an official marriage ceremony …<br/><br/>Finally, the door opened from the inside. Zhi Xing saw her mistress stepping out with a preoccupied expression, she hurried over anxiously, “Miss, are you okay?”<br/><br/>“What could possibly be wrong with me?” Su Qingzhi answered casually while immersing herself in the technique Gu Yang had shared with her.<br/><br/>This technique was far more profound than the “Xuan Yuan Method”, it fascinated her and she got lost in it.<br/><br/>As she was saying this, she moved towards the exterior.<br/><br/>Zhi Xing watched her manner, anxiously stamping her feet. How could she ask about ‘that’ matter?<br/><br/>This little maid was really worried about her mistress.<br/><br/>Soon enough, everyone woke up and gathered to have breakfast.<br/><br/>Only Chu Xiyue hadn’t arrived yet.<br/><br/>During the meal, Zhi Xing noticed that Gu Yang was constantly staring at Han Mengling, completely ignoring her mistress, which almost pissed her off.<br/><br/>Just got the girl and already eyeing other women?<br/><br/>Moreover, how old was that little girl?<br/><br/>Brother Gu was really too much!<br/><br/>Zhi Xing turned to look at her mistress, only to see her sitting there in a daze, completely unaware of Gu Yang’s actions, which made her even more upset.<br/><br/>Miss, please be more attentive!<br/><br/>PS: I’m almost caught up, please support me with monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}