{"id": 120, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14302296.html", "title": "Chapter 120 - Chapter 120: 120 Shadow Hall", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 120 - Chapter 120: 120 Shadow Hall</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 120: 120 Shadow Hall<br/><br/>Translator: 549690339<br/><br/>“So powerful!”<br/><br/>In the carriage, Pei Qianlan was astonished by Gu Yang’s sword strike.<br/><br/>Since childhood, she has been obsessed with the Sword Technique and has earned a reputation as a “Sword Fanatic” over the years. She has attained great achievements in the field of swordplay.<br/><br/>Yi Yi’s sword move surpassed her imagination. A martial artist who had just broken through to the First Rank could actually produce a Divine Power level sword technique.<br/><br/>However, when Gu Yang’s saber swung out, it shattered Yi Yi’s majestic Blade Intent into fragments.<br/><br/>The Skyfire, descending from the heavens like a savage wildfire, incinerated everything in its path.<br/><br/>A certain doubt in Pei Qianlan’s heart also vanished with the smoke.<br/><br/>She vaguely remembered the scene from three days ago, and had suspected that she was wounded by Gu Yang’s Blade Intent at the time.<br/><br/>But after seeing that strike from Gu Yang today, she quickly dismissed this suspicion.<br/><br/>The two Blade Intents were completely different.<br/><br/>Perhaps some top-tier First Rank powerhouses could handle two different Blade Intents, but Gu Yang was only a few years old. Even if he were a prodigy, mastering one Blade Intent was extremely impressive.<br/><br/>The one who wounded her that day must have been the criminal named Meng Ping.<br/><br/>Pei Qianlan watched as Yi Yi was sent flying with a terrifying wound on his chest, incredibly deep. She was a bit shocked at Gu Yang’s merciless attack.<br/><br/>If the strike had gone any deeper, it could have taken Yi Yi’s life.<br/><br/>Even as it was, his injuries were severe.<br/><br/>Huh?<br/><br/>Suddenly, Pei Qianlan sensed something was wrong.<br/><br/>Yi Yi’s body was flying further and further away, showing no signs of stopping. It was instead accelerating as though propelled by some invisible force. Flying higher and higher, he quickly passed over the city walls until he vanished from sight.<br/><br/>This uncanny scene left everyone present stunned.<br/><br/>Outside the carriage, General Pan took a deep breath, “Divine Power Realm!”<br/><br/>Upon hearing this, Pei Qianlan realized, indeed, only a powerhouse in the Divine Power Realm could do this.<br/><br/>It must be Yi Yi’s mentor, a senior of the Heavenly Saint Sect in the Divine Power Realm!<br/><br/>Thinking that a Divine Power realm powerhouse was nearby gave Pei Qianlan goosebumps.<br/><br/>If that Divine Power realm powerhouse from the Heavenly Saint Sect had retaliated in anger, there would be no way for Gu Yang to resist.<br/><br/>Gu Yang was the saviour of her and Little Dragon. It was only natural for her to worry about him.<br/><br/>“He didn’t make a move?”<br/><br/>On the second floor of the tavern, Gao Fan quietly let out a sigh of relief.<br/><br/>They say that Divine Power realm disciples at the Heavenly Saint Sect are extremely protective, yet a disciple was seriously hurt under their watch, and still, they didn’t retaliate.<br/><br/>It turns out, rumors can’t be trusted.<br/><br/>“What kind of Saber Technique is that?”<br/><br/>On the other side, Wu Xingyun was astonished.<br/><br/>This was the first time Wu Xingyun had seen Gu Yang make a move since breaking through to the First Rank.<br/><br/>Even though he knew his strength must be formidable based on that, he was deeply shocked after seeing Gu Yang’s strike.<br/><br/>However, what shocked him was that Gu Yang did not use “God Destroyer Nine Styles”, but used a different Saber Technique instead, one that he could not recognize.<br/><br/>Xu Ruomei muttered beside him, “Sky Annihilation Six Extinction.”<br/><br/>Upon hearing this name, Wu Xingyun could no longer remain composed. He exclaimed, “What?”<br/><br/>Seeing the reactions of the two, Su Qingzhen and Han Mengling were puzzled and asked, “Is there something wrong with this Saber Technique?”<br/><br/>Wu Xingyun stared at Gu Yang in the ring as if he had not heard their words. All he thought in his heart was that the rumors were true…<br/><br/>Xu Ruomei took a deep breath to suppress her emotions and said in a deep voice, “Over twenty years ago, a woman emerged, unbeatable by countless experts with a single Saber Technique. She is the successor of the sacred land, Blue Sky Palace. And the Saber Technique she used was ‘Sky Annihilation Six Extinction.’<br/><br/>Turning to look at Gu Yang, Su Qingzhen murmured to herself, “So, Brother Gu really is a disciple of a Sacred Land?”<br/><br/>If the previous rumors that Gu Yang was a disciple of Four Great Sacred Lands were just rumors, then him using a secret Saber Technique of a Sacred Land now was undeniable proof.<br/><br/>However, neither Su Qingzhen nor Han Mengling could truly understand the significance of being a disciple of a Sacred Land.<br/><br/>Only disciples of major sects like Wu Xingyun and Xu Ruomei truly understood what the Four Sacred Lands represented.<br/><br/>Suddenly, Su Qingzhen noticed a faint shadow appearing behind Gu Yang. Shocked, she was about to warn Gu Yang, but it was already too late.<br/><br/>“Die!”<br/><br/>Qin Yuan’s eyes locked onto Gu Yang, who was close at hand. His long-hidden killing intent exploded out as he thrust his thin short sword towards Gu Yang’s back.<br/><br/>He was 70% sure that this strike would hit its mark.<br/><br/>He had lain in ambush near Gu Yang for two days, finally finding this perfect opportunity, determined to kill with one strike.<br/><br/>As long as he could kill this man, he would accumulate enough merits to enter the Ancestral Hall and receive the guidance of the ancestors.<br/><br/>Qin Yuan was the deputy leader of the Shadow Hall of the Qin Family.<br/><br/>Shadow Hall was established by the Qin Family, specializing in intelligence and assassinations.<br/><br/>He was the most formidable assassin in Shadow Hall, never missing his targets prior to this.<br/><br/>This time, the order came directly from the family head.<br/><br/>He had no idea why the family head wanted to assassinate this young man named Gu Yang, nor did he ever ask why.<br/><br/>He owed a great debt to the Qin family, a debt too vast even if he were willing to be cut to pieces.<br/><br/>However, when Qin Yuan saw his target, he had an intuition that this young man’s strength was terrifying and not weaker than his own.<br/><br/>So, he didn’t act rashly, but lurked on the side.<br/><br/>He had a special way of hiding his aura, rendering those below the Divine Power Realm absolutely unable to detect his presence.<br/><br/>These two days, Qin Yuan had been waiting for an opportunity.<br/><br/>Now, he finally had it.<br/><br/>Gu Yang’s blade had an unbelievable power, but it was sure to drain his energy greatly. After just defeating an enemy and letting down his guard, this was a golden opportunity.<br/><br/>Qin Yuan made his move decisively!<br/><br/>….<br/><br/>“I’ve been waiting for you.”<br/><br/>Gu Yang had known even during the Simulation that after defeating Yi Yi, the mysterious First-Rank expert would make a move. He had been prepared.<br/><br/>When his opponent was within ten meters of him, he noticed and launched a long accumulated strike.<br/><br/>When Qin Yuan discovered that Gu Yang’s Protective Gang Qi still existed around him, his heart was startled.<br/><br/>How is that possible?<br/><br/>That was a blade technique of Divine Power realm. After executing one strike, how could he still retain such strong True Essence within his body?<br/><br/>Hadn’t he just recently broken through to the First Rank?<br/><br/>Qin Yuan’s shock only lasted a moment, and there was no pause in the blade in his hand.<br/><br/>For an assassin, there can never be any hesitation.<br/><br/>The next moment, what met him was a pitch-black saber.<br/><br/>This was the second surprise.<br/><br/>No matter how Qin Yuan pondered, he couldn’t comprehend how his reaction was so quick, as if he had known in advance about his assassination attempt.<br/><br/>The original ambush had unexpectedly turned into a head-on confrontation.<br/><br/>If Gu Yang was in his peak condition, he wouldn’t stand a chance.<br/><br/>The strike just witnessed was of earth-shattering power, surely something he couldn’t withstand.<br/><br/>However, at this moment, after Gu Yang executed that blade strike, how much strength could he possibly have left?<br/><br/>Qin Yuan still had forty percent assurance.<br/><br/>Blood Shadow Saber Technique, a strike guaranteed to draw blood, it was a blade technique known for its oddity and excelling at defeating the strong as the weak.<br/><br/>In a flash, his pupils turned a deep red, and his True Essence surged bizarrely, surpassing his previous limit.<br/><br/>The blade’s speed increased yet again, under the sunlight, leaving a dark red afterimage.<br/><br/>This was the profound principle of Blood Shadow Saber Technique, confusing the opponent with an afterimage when striking. It only takes a moment to slash the opponent’s throat and kill with one strike.<br/><br/>He had assassinated two First-Ranks with this saber technique.<br/><br/>Buzz!<br/><br/>Qin Yuan suddenly felt a darkness in front of him, a sharp blade intent that seemed to split his consciousness in half.<br/><br/>With a sound of tearing, his blade intent, the blade in his hand, the hand holding the blade, and him…<br/><br/>His whole being got split in half.<br/><br/>On the side, a contemptuous voice sounded, “What a fanciful mess.”<br/><br/>Break Mountain Style!<br/><br/>This was the last thought in Qin Yuan’s mind before he fell into the endless darkness.<br/><br/>This strike was the sixth style of God Destroyer Nine Styles, Break Mountain Style, which espoused the momentum of splitting a mountain with one strike.<br/><br/>With one blade, Gu Yang split the First-Rank powerhouse who attempted the ambush in half, finally resolving the problem that had troubled him several times in the Simulation.<br/><br/>Now that felt better.<br/><br/>PS: The third update, seeking monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}