{"id": 121, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14302299.html", "title": "Chapter 121 - Chapter 121: Make Every Minute Count", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 121 - Chapter 121: Make Every Minute Count</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 121: Make every minute count<br/><br/>Translator: 549690339<br/><br/>Gu Yang settled two troubles at once, feeling relieved. He set off with Su Qingzhen and the others.<br/><br/>They found an inn to stay in and heard many people discussing the recent battle at the city gate.<br/><br/>However, in this world, there were no mobile phones or computers, so people in the inn didn’t know that the man who had just entered was the protagonist of the battle they were discussing.<br/><br/>Just after Gu Yang settled in, a maid with exceptional temperament came for a visit, saying that her master invited them to the prefect’s mansion.<br/><br/>He declined politely though.<br/><br/>Back at the city gate, he noticed the carriage. Without guessing, he knew who this maid’s master was — the prince and princess of Jinghai.<br/><br/>Gu Yang had to consider Wu Xingyun’s feelings.<br/><br/>Of course, he also had his own intentions. In this way, he could create an image of being generous without expecting anything in return, which would make the Jinghai Mansion pay more attention to him.<br/><br/>Several days later, they finally arrived at Jingzhou City.<br/><br/>This was the largest and most bustling city Gu Yang had seen in this world. Just the city gate was several times larger than other prefecture cities, with pedestrian and carts lining up to get in.<br/><br/>Once in the city, the streets were bustling even more.<br/><br/>Besides, there were many foreigners who looked and dressed differently from the people of Great Zhou.<br/><br/>Reportedly, Jingzhou City was second largest in Great Zhou, second only to Divine City, with a population exceeding one million. It belonged to a super city in this era.<br/><br/>Jingzhou was located in the southernmost region of Great Zhou.<br/><br/>Jingzhou City was at the mouth of the Jiang River, the largest river in Jingzhou, and it had the largest seaport in Great Zhou. Countless goods were shipped abroad through here.<br/><br/>Every year, many foreign traders came here to do business.<br/><br/>Xu Ruomei suddenly sighed, “Jinghai King is indeed a remarkable man, he managed to turn the historically barren Jingzhou into such a bustling place in just a few decades.”<br/><br/>Gu Yang finally remembered the question he wanted to ask a few days ago, “What kind of person is this Jinghai King?”<br/><br/>When you reach someone else’s territory, you need to understand their character.<br/><br/>Xu Ruomei said, “He is ranked first in Martial Arts proficiency on the First Rank list. In terms of achievement, he is the first person since the founding of Great Zhou to be made a foreign king. In terms of governance, turning Jingzhou, originally a barren frontier land, into a prosperous city can be considered quite an achievement.”<br/><br/>It was evident that she admired Jinghai King greatly.<br/><br/>Of course, he was indeed a remarkable figure.<br/><br/>Then Xu Ruomei began to tell the remarkable life story of Jinghai King.<br/><br/>Jingzhou has been rife with pirates for centuries. When Great Zhou was first established, they would send strongmen to wipe them out, but after a decade or so, new pirates would emerge.<br/><br/>Over time, the court stopped caring. It was time-consuming, labor-intensive, and without any benefit.<br/><br/>Decades ago,, a Pirate King emerged in Jingzhou, who subdued all the pirates and established an order. Any merchant ship entering or leaving this sea area had to pay him protection money.<br/><br/>All the forces in Jingzhou had to submit to the Pirate King’s tyranny.<br/><br/>At this time, a young man from a coastal fishing family emerged, leading a dozen of his fellow villagers to resist the Pirate King.<br/><br/>In just ten years, the Pirate King’s forces on land collapsed and he had to retreat to the sea.<br/><br/>The young man caught the attention of the Governor of Jingzhou and climbed higher up the ranks through his military achievements. He eventually became the Naval Commander, the second-highest authority in Jingzhou, earning great prestige.<br/><br/>Two years later, with both internal and external cooperation, he broke into the Pirate King’s lair, killed him in one fell swoop, and seized a lot of treasures.<br/><br/>In the following years, he wiped out the Pirate King’s remaining forces one by one, becoming the actual ruler of Jingzhou and this sea area. Both his prestige and power surpassed that of the previous Pirate King.<br/><br/>Coincidentally, at that time, the Emperor of Great Zhou passed away. After the annihilation of the Wu Family, the court was weakened. To appease him, they made him the Jinghai King.<br/><br/>When Gu Yang heard this, he felt a bit strange. He didn’t understand this move.<br/><br/>If they saw him as a threat, they had numerous ways. The most straightforward one would be to relocate him to the center, away from Jingzhou. It would then be easy to control him.<br/><br/>Instead, they chose the most foolish method, appointing him as a king. Isn’t that just letting him legitimately be the king of Jingzhou? Even if he didn’t have ambitions originally, he would now have them.<br/><br/>No matter how he looked at it, there seemed to be a problem. There must be some unknown inside story.<br/><br/>While they were discussing the deeds of Jinghai King, Gu Yang suddenly stopped in front of a merchant’s house, looked up, and saw the sign — “Qian’s Merchant House”.<br/><br/>Finally, they were at the right place.<br/><br/>“Three million five hundred thousand, here I come.”<br/><br/>He walked into the merchant house and said to the approaching clerk, “Get your head clerk for me.”<br/><br/>Zhu Lin was thirty years old, the youngest head clerk in Jingzhou City. No one dared to underestimate him because he had so quickly made a newly established merchant house thrive.<br/><br/>He even established sales channels in the West Bank Continent.<br/><br/>You should know, the West Bank Continent was the most remote and dangerous shipping route. But also the most profitable, as each trip could make dozens of times profit.<br/><br/>The rapid success of the Qian Merchant House in Jingzhou City was because of this.<br/><br/>All the traders in Jingzhou City knew not to underestimate this young head clerk and his even younger female owner.<br/><br/>Currently, it was the busiest time of the year for the merchant house. When Zhu Lin heard that someone was looking for him, he didn’t intend to see them right away as he had a pile of work at hand.<br/><br/>“Head clerk, you might want to see this one.”<br/><br/>Zhu Lin put down what he was doing and looked up.<br/><br/>The person who spoke was someone he trusted dearly, someone rarely wrong due to his mature character.<br/><br/>“Alright.”<br/><br/>“May I know why you are here to see me?”<br/><br/>Zhu Lin met a young man in his early twenties. He was a bit puzzled but remained respectful.<br/><br/>“My name is Gu Yang.”<br/><br/>The young man took out two items.<br/><br/>Zhu Lin recognized the name and when he saw what the man took out, his eyes narrowed. The seal was the owner’s. She never parted with it. Why is it in this man’s hands?<br/><br/>Gu Yang then handed him a paper, “You will understand once you read this.”<br/><br/>Zhu Lin had seen his fair share of storms but once he finished reading the transfer agreement, his head buzzed. The owner was transferring the merchant house to this man?<br/><br/>“Is it clear?”<br/><br/>Zhu Lin, an extraordinary person himself, took a deep breath, stood up, and bowed, “Clear. I, Zhu Lin, head clerk of Qian’s Merchant House, greet the new owner.”<br/><br/>Seeing his cooperation, Gu Yang felt pleased as he had saved himself quite a bit of effort. He then asked, “I want to know, how much money can be withdrawn from the merchant house without affecting its daily operations?”<br/><br/>Zhu Lin’s face was somewhat gloomy. The new owner wanted to withdraw money from the merchant house right from the start. Would the merchant house be successfully operated?<br/><br/>Regardless, he gave a number, “Two hundred thousand taels.”<br/><br/>Gu Yang frowned, “That’s it?”<br/><br/>“Last year, the merchant house just bought four large ships and a lot of money has been used to buy bulk goods which will be shipped next month…”<br/><br/>“When is the next payment due?”<br/><br/>“At least ten months from now.”<br/><br/>After listening, Gu Yang gave up this idea. Ten months was too long. He was in a rush.<br/><br/>It seemed that the only choice was to sell this merchant house.<br/><br/>He said, “You know a lot of people in Jingzhou City. Do you know any merchant house that can afford to buy this place?”<br/><br/>“What?”<br/><br/>Zhu Lin changed his complexion, “You want to sell this merchant house?”\t\t\t\t\t\t</div>", "images": {}, "success": true}