{"id": 126, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310279.html", "title": "Chapter 126 - Chapter 126: 126 Pure Body (Third Update, Asking For Monthly Ticket)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 126 - Chapter 126: 126 Pure Body (Third Update, Asking For Monthly Ticket)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 126: 126 Pure Body (Third update, asking for monthly ticket)<br/><br/>Translator: 549690339<br/><br/>[At the age of twenty-two, you have attained First Rank Cultivation Level; in Juyang City, you defeated Yi Yi, the first on the list of talents, gaining renown worldwide.]<br/><br/>[After you arrived in Jingzhou City, you were invited to the palace of Jinghai King and discovered several First Rank experts there, intending to rob the Divine Sword. At the critical moment, you drew your sword to help. Using the power of your ‘God-killing’ technique, you repelled the enemies and saved the life of the prince.]<br/><br/>[You became a benefactor of Jinghai King’s palace.]<br/><br/>[Jinghai King returned to the palace, utilized the Divine Sword, and successfully stepped into the Divine Power Realm. That day, a mysterious mana realm powerhouse appeared intending to attack him. A sword intention flew out from the city, slashing and injuring him.]<br/><br/>[Two years later, you accompanied Jinghai King on a campaign, going to Dragon Gate Island, and killed Lei Hao, the divine rank powerhouse on the island, thus gaining control of the Dragon Washing Pond.]<br/><br/>[Jinghai King brought you to the Dragon Washing Pond, allowing you to cultivate in this blessed land.]<br/><br/>[One year later, you understood the second form of “Divine Celestial Six Annihilation”. The energy in the Dragon Washing Pond was exhausted.]<br/><br/>[You broke the barrier, returned to Jingzhou, found Jingzhou in chaos, and learned that Jinghai King was killed. The casualties were severe, and several southern states fell into rebellion.]<br/><br/>[You were about to retreat to the secret realm within Zhushan, when the Son of the Church of Red Venerate appeared before you, bearing a grudge against you for their past defeat. You noticed he had already entered the Divine Power Realm, but after unleashing the strongest blow of your life, you were killed on the spot at the age of twenty-five.]<br/><br/>Gu Yang finished this round of simulations and nearly blurted a curse.<br/><br/>He was dead at twenty-five!<br/><br/>Five hundred thousand life points in exchange for just three short years.<br/><br/>He was practically bleeding inside his heart.<br/><br/>The only consolation was that he had managed to learn the second form of “Divine Celestial Six Annihilation”, so it wasn’t a total loss.<br/><br/>Moreover, he now knew who these people were – the Son of the Red Venerate Sect.<br/><br/>One of the six major factions, known for their rebellion. Every hundred years or so, they could always be counted on to cause trouble.<br/><br/>However, they never succeeded. They were either wiped out by imperial armies or ended up offending someone they shouldn’t have and were killed outright.<br/><br/>Last time, the Red Venerate Sect’s rebellion was suppressed by the Lord of the State who was also known as the Sword Saint of the Country.<br/><br/>The faction seemed to exist solely for the heroes of the era to gather achievements, stepping stones for others to make a name for themselves.<br/><br/>However, when it came to cruelty, the Red Venerate Sect was undoubtedly ranked number one among the six major factions. Every time they started a rebellion, they would ravage several states.<br/><br/>Over the millennium, many medium and small clans fell to the Red Venerate Sect.<br/><br/>Each time this force emerged, it would trigger a storm of blood and violence, and it was common for several Gods to fall.<br/><br/>A Son of their sect would become a divine realm a few years later. Not to mention their leader.<br/><br/>They were truly not to be trifled with.<br/><br/>[The simulation ends, and you can retain one of the following items:]<br/><br/>[One, your martial arts realm at the age of twenty-five.]<br/><br/>[Two, your martial arts experience at the age of twenty-five.]<br/><br/>[Three, your wisdom at the age of twenty-five.]<br/><br/>Gu Yang decisively chose the second option.<br/><br/>Suddenly, a vast thunderbolt appeared in his mind, and the True Essence within his body began to go wild as a destructive force spread out.<br/><br/>“Divine Celestial Six Annihilation”, Second Form: Thunderbolt Annihilation!<br/><br/>“This is bad!”<br/><br/>Gu Yang realized that his True Essence was not sufficient to unleash this power. If he forced it out, he could die even before his enemy.<br/><br/>He realized that it must have been because, in the simulation, after his body was transformed by the Dragon Washing Pond, he could unleash this technique.<br/><br/>For his current self, this technique was too powerful to handle. His body couldn’t withstand such a violent force.<br/><br/>Gu Yang immediately controlled the destructive thunderbolt in his mind, calming it down, and his True Essence returned to normal.<br/><br/>Just at this moment, a terrible killing intent locked onto him.<br/><br/>The source of the killing intent was the black-robed man who had just easily defeated the First Rank expert in the palace. He had suddenly set his sight on Gu Yang.<br/><br/>“There’s no other way.”<br/><br/>Gu Yang clenched his teeth and decisively used his last chance at simulation.<br/><br/>At this point, he didn’t have time to hesitate.<br/><br/>[…You drew your sword in aid, scaring off the black-robed man with a life-for-life stance, saving the prince’s life again.]<br/><br/>[You became a great benefactor of Jinghai King’s palace.]<br/><br/>[Jinghai King rushed back to the palace on hearing the news, utilizing the Divine Sword to step into the Divine Power Realm…]<br/><br/>[Two years later, you followed Jinghai King’s army to Dragon Gate Island and killed Lei Hao…]<br/><br/>[…You drew on the Dragon Washing Pond, greatly enhancing your physique.]<br/><br/>[Ten months later, you broke through, took Su Qingzhi and others, and went to the secret realm of Tianzhu Mountain.]<br/><br/>[Twenty-eight years later, a great battle broke out in the outside world. The entrance to the secret realm was destroyed. You escaped, but were soon discovered by a disciple of Wanxiang Gate, chased by a mana realm expert and killed on the South Seas’ shore at the age of fifty-three.]<br/><br/>Gu Yang swiftly skimmed through the contents of this simulation. Seeing that he finally ended at fifty-three years old, he let out a sigh of relief.<br/><br/>He had managed to preemptively avoid many risks, achieving maximum benefits in the process.<br/><br/>[Simulation ended, you can retain one of the following.]<br/><br/>[One, martial arts realm at the age of fifty-three.]<br/><br/>[Two, martial arts experience at the age of fifty-three.]<br/><br/>[Three, life wisdom at the age of fifty-three.]<br/><br/>“Choose one.”<br/><br/>Boom!<br/><br/>This time, he felt as if every inch of his body was being torn apart by an invisible force. The sudden and unexpected pain almost caused him to scream out loud.<br/><br/>Gu Yang felt as if he had been repeatedly run over by a ten-wheel truck. With his muscles and bones shattered into fragments, he was in unimaginable pain.<br/><br/>After extreme pain was a kind of indescribable itch. His shattered body healed automatically, and the agonizing itch made him feel like he was in a state between heaven and hell.<br/><br/>By this time, Pei Qianlan had already struggled out of his embrace, standing to the side. Watching his face twisted in pain, she was anxious but had no idea of what to do.<br/><br/>She had no idea what was happening to Gu Yang.<br/><br/>He would become incredibly ghastly, then his aura would surge massively, showing extreme pain.<br/><br/>She wanted to help but didn’t know how, leaving her anxious on the side.<br/><br/>“What is”<br/><br/>The man in the black robe was about to strike, but again sensed changes in Gu Yang’s body. His eyes narrowed, and he was shocked to his core.<br/><br/>An immaculate body!<br/><br/>Gu Yang was actually forming his Immaculate Body at this moment.<br/><br/>With the black-robed man’s knowledge, he naturally knew what the changes in Gu Yang’s body meant.<br/><br/>But how could this be possible?<br/><br/>Those at the peak of the First Rank who wish to step into becoming Divine Beings must continuously temper their mortal bodies until they transform into the Immaculate Body.<br/><br/>This is a challenge every aspiring Divine Being has to overcome, and it is also the toughest one.<br/><br/>Countless First Rank practitioners have been stuck at this step, unable to cultivate their mortal bodies to a dust-free and immaculate state even after decades.<br/><br/>How long has Gu Yang been at First Rank? Even with his profound cultivation and mysterious techniques, he’s still far from the peak of the First Rank. How could he possibly cultivate an Immaculate Body?<br/><br/>According to rumors, there are a few abnormal treasures in the world that can help people shed their mundane shackles and return to their innate state.<br/><br/>Such treasures exist within their sect.<br/><br/>In addition, other large sects and the nine Great Clans also possess similar treasures. This is a significant reason why these powerful factions can continue to endure.<br/><br/>However, these treasures are extremely rare, so rare that it may not be possible to form even one in a hundred years. This is why the number of Divine Beings is so limited.<br/><br/>If he could snatch away that Divine Sword this time, he might be able to receive his master’s reward and get the opportunity to shed his mundane shell.<br/><br/>However, even if Gu Yang had such treasures, it still wouldn’t be possible for him to instantly form an Immaculate Body. It isn’t like the legendary ancient Immortal Elixir.<br/><br/>For a moment, the man in the black robe wondered if he had misseen anything.<br/><br/>Yet, this brief moment of hesitation provided Gu Yang with an opportunity.<br/><br/>When all the pain and itch disappeared, Gu Yang felt better than ever before. The hidden injuries he previously had, and the unnoticeable diseases, all healed.<br/><br/>Moreover, he seemed to even awaken some “superpowers”.<br/><br/>He could control the growth of his hair and nails, whether to speed it up or slow it down.<br/><br/>His injuries could also heal faster.<br/><br/>Now, he felt like he had become a “superhuman”. He can control nearly every aspect of his body up to a hundred percent— bones, viscera, blood vessels, lymph system, and even hormones!<br/><br/>Gu Yang had a feeling that he was only a step away from reaching the Divine Being Realm.<br/><br/>However, it was merely a feeling. The seemingly close distance required a long time to cross.<br/><br/>Because he had cultivated the “Phoenix Dance Nine Heavens”, reaching the peak of First Rank would require rebirth from ashes and starting over to step through that gate.<br/><br/>Gu Yang looked at the man in the black robe not far away and smiled faintly, “I’m ready, are you?”<br/><br/>PS: Forty minutes left. Brothers with monthly tickets, please vote now.\t\t\t\t\t\t</div>", "images": {}, "success": true}