{"id": 125, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310278.html", "title": "Chapter 125 - Chapter 125: 125 Red Venerate Religion", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 125 - Chapter 125: 125 Red Venerate Religion</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 125: 125 Red Venerate Religion<br/><br/>Translator: 549690339<br/><br/>Seeing the woman in his arms spaced out with a dazed look, as if she were frightened silly, Gu Yang couldn’t help but say in his mind, “Such mental strength, she’s even worse than Qingzhi.”<br/><br/>Back in the day… No, that’s not right, it was just a few months ago. Su Qingzhen was captured by mountain bandits but was still able to play along with them. Compared to this woman, Qingzhi is both brave and resourceful.<br/><br/>Indeed, one can only understand a person through comparison.<br/><br/>After a short moment of confusion, Pei Qianlan finally realized what had happend. He had mistaken her for the daughter of Jinghai King.<br/><br/>She barely moved her mouth, as if to explain something. However, before she could speak, she seemed to think of something and swallowed her words.<br/><br/>Resting her cheek on his chest, she heard his strong heartbeat and felt a sense of security she had never experienced before.<br/><br/>At this moment, Pei Qianlan closed her eyes and temporarily forgot about avenging her parents’ death, about everything else.<br/><br/>She only wished that this journey would never come to an end, that she could continue down this path forever.<br/><br/>Boom!<br/><br/>In front of the prince’s bedroom, a figure broke through the door, causing a pit to form in the tiled floor.<br/><br/>The person inside the pit stood up, wiped off the blood at the corner of his mouth, and stared at the person outside the courtyard in astonishment, exclaiming, “Red Flame Divine Power, are you the Saint Child of the Red Venerate Sect?”<br/><br/>The man outside the courtyard was covered in a black robe, revealing only a pair of enchanting eyes. He said in a deep voice, “Your training by the Jinghai King is indeed commendable. You’ve forced me to use the Red Flame Divine Power, you should be proud.”<br/><br/>Seeing his confession, Xiao Yue’s heart sank more and more.<br/><br/>The Red Venerate Sect is one of the six major sects, infamous for stirring up rebellions and waging wars every hundred years or so.<br/><br/>Despite being suppressed every time, they always resurge within decades, proving impossible to eradicate.<br/><br/>This sect acts recklessly, not caring about the consequences. Regardless of whether it belongs to one of the nine great families, or any of the Five Major Sects, anyone they target is subject to slaughter.<br/><br/>The last rebellion of the Red Venerate Sect happened seventy years ago, and it originated precisely in Jingzhou.<br/><br/>Back then, the imperial court slaughtered the entire sect in order to eradicate them completely, nearly wiping out the whole population of Jingzhou.<br/><br/>The present population of Jingzhou has been replenished by immigrants from other regions.<br/><br/>Now, after only seventy years, the Red Venerate Sect has reappeared, attacking the Jinghai King’s mansion, and what’s more, it’s the Saint Child himself who’s taken action.<br/><br/>In the Red Venerate Sect, the Saint Child ranks among the top five, and the Red Flame Divine Power is their signature technique.<br/><br/>The man in the black robe before her has already reached the peak of the First Rank, and is ominously close to the First Rank list. His power is so immense that even a joint attack from her and Feng Ziyuan would not suffice.<br/><br/>Now that King is not present in the mansion, there’s no one left to resist.<br/><br/>The Saint Child said, “Today, I have come for that Divine Sword. If you hand it over, I can spare your lives.”<br/><br/>Upon hearing his words, Xiao Yue knew it wouldn’t end well. Using her spear for support, she stood up with much difficulty, placed the long spear horizontally in front of her, and said, word by word, “Impossible!”<br/><br/>Ever since the prince returned, he had been unconscious.<br/><br/>She had specifically invited the old master to take a look. He said that the reason why the prince was unconscious was due to the sword. Whether this was a blessing or a curse remained unknown.<br/><br/>But there was one thing. The divine sword could not be forcibly taken away from the prince’s hand, otherwise, his life would be in danger.<br/><br/>The Saint Child of the Red Venerate Sect wanted to steal that sword, which would mean taking the prince’s life.<br/><br/>Xiao Yue, in this moment, had no other option than to fight to the death.<br/><br/>The man in the black robe retorted with a cold voice, “Then, die.”<br/><br/>His aura changed at that moment, and a terrifying force surged into the sky.<br/><br/>Since his identity had already been exposed, he no longer had to hide his true strength and used all his might.<br/><br/>Without moving his body, he threw a punch in the air.<br/><br/>The air itself seemed to have been set on fire.<br/><br/>Xiao Yue felt an extremely horrifying high temperature flooding towards her, like an invisible flame.<br/><br/>“Ha!”<br/><br/>She gave a loud shout, gathering the last bit of her True Essence, and lunged with the spear in her hand.<br/><br/>Crack——<br/><br/>The silver spear that had accompanied her for twenty years shattered inch by inch. In an instant, she was ignited and turned into a flaming ball.<br/><br/>“So vicious!”<br/><br/>At this time, Gu Yang, who just arrived, saw the First Rank warrior guarding the door being turned into a pile of flames from afar, causing him to be somewhat shocked.<br/><br/>The strength of the man in the black robe was unlike anything he had ever seen.<br/><br/>None of the First Rank individuals he had met before could compare to this man.<br/><br/>Even he wasn’t sure he could beat this man.<br/><br/>No wonder he ended up seriously injured in the simulation.<br/><br/>You should know that he has a killer move like Destroying God, but he didn’t use it at all.<br/><br/>“However, why does this guy’s True Essence feel so familiar?”<br/><br/>Gu Yang found it strange, but soon realized, “Isn’t this the Sun’s Red Technique? No, it’s much stronger than Sun’s Red Technique. Could it be an upgraded version of Sun’s Red Technique?”<br/><br/>Before the Third Rank, he had been practicing the “Sun’s Red Technique”, so he was extremely familiar with this method. That’s how he could identify that the method practiced by the man in the black robe was extremely similar to the Sun’s Red Technique.<br/><br/>“So, the Sun’s Red Technique is just a castrated version. What that man is practicing is the complete version.”<br/><br/>Gu Yang had a feeling of sudden realization.<br/><br/>At this time, Feng Xiaoxiao, the woman trailing him, was catching up. Although she was a bit mad, her strength was not to be underestimated, it was only her moves that were a bit lacking.<br/><br/>One against two…<br/><br/>No, looking at another guard of the mansion who could not hold on much longer. That would be one against three, and he could not hold on.<br/><br/>Even so, Gu Yang was not panicked at all and calmly opened the system.<br/><br/>Since he can’t beat him for the time being, he should enhance his power first.<br/><br/>[Do you want to use the Life Simulator? Use it once, it costs 500,000 gold coins.]<br/><br/>“Yes.”<br/><br/>At this moment, the man in the black robe also noticed Gu Yang’s arrival, but he didn’t pay much attention to it, his target was the Divine Sword.<br/><br/>The leader had said that no matter what, the sword could not fall into Wu Tianqi’s hands. Otherwise, he would become a great enemy of their Sect, obstructing their grand scheme.<br/><br/>For this reason, even the Paladin Elder was dispatched to stop the Emperor’s Supreme Swordsaint in the city.<br/><br/>Otherwise, the few of them could not even block a single strike from him.<br/><br/>He was determined to obtain that Divine Sword. Anybody who stood in his way would be killed without hesitation.<br/><br/>Even if it was Gu Yang, who had a rumored heritage from the saintly domain, the kill would remain the same.<br/><br/>The man in the black robe had already locked on the owner of the Divine Sword, Wu Tianqi’s son. As he stepped inside, he suddenly felt a terrifying sense of doom from behind.<br/><br/>“What was that?”<br/><br/>The man in the black robe quickly turned his head and looked squarely at the source of the aura, the man who had just arrived.<br/><br/>If not surprising, this man should be the disciple from the saintly domain rumored in the sect, Gu Yang.<br/><br/>Originally, he didn’t pay much attention to Gu Yang, a novice who’d just had a breakthrough in the First Rank. Even if he inherited a divine heritage, so what?<br/><br/>The gap in cultivation level was clear.<br/><br/>He practiced the “Red Flame Divine Skill”, which was also a peerless technique. He considered himself not inferior to those on the First-Rank list. What was lacking was his personal power, which would be increased in a few years, and then he would be confident of joining the First-Rank list.<br/><br/>Compared to him, Gu Yang’s power was at least twenty years behind. This kind of gap is not something a talent can easily close.<br/><br/>But the aura emanating from Gu Yang at this time was making him feel threatened as well.<br/><br/>How was this possible?<br/><br/>He really couldn’t understand.<br/><br/>Suddenly, an intense desire to kill filled the mind of the man in the black robe.<br/><br/>His instinct told him that this Gu Yang posed an even greater threat than Wu Tianqi. If he did not remove him now, he would become a major enemy of the Sect!<br/><br/>PS: Continuing to seek monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}