{"id": 122, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14302302.html", "title": "Chapter 122 - Chapter 122: 122 Divine Power", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 122 - Chapter 122: 122 Divine Power</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 122: 122 Divine Power<br/><br/>Translator: 549690339<br/><br/>Gu Yang was at a loss in Jingzhou City and handed over the sale of the trading firm to Zhu Lin, the chief steward. It’s best to leave professional matters to professionals.<br/><br/>Qian Xiyun mentioned that this chief steward is a trustworthy person.<br/><br/>So, apart from the second day, when he gathered the managers of Qian’s trading firm and announced that he was now the new owner, he stayed in Qian Xiyun’s old courtyard.<br/><br/>Qian Xiyun’s houses and shops in Jingzhou naturally became his.<br/><br/>The courtyard was spacious, more than enough for them to live in. The servants and staff were all already there, which was very convenient.<br/><br/>Every day, Gu Yang practiced his skills, read books and discussed matters of the Jianghu with Wu Xingyun and Xu Ruomei – mainly on the Nine Great Names and Six Great Sects.<br/><br/>Such leisurely days passed by, only five days in all.<br/><br/>On the morning of the sixth day, people were lined up outside the gate, sending in box after box, almost filling the entire courtyard.<br/><br/>Such a large-scale event naturally attracted countless spectators who stood in the distance discussing and speculating about the newcomer who moved into the Qian Residence.<br/><br/>Most residents in this area are wealthy and have keen eyes. They quickly recognized that those sending gifts were from the Jinghai Royal Residence.<br/><br/>The fact that the Jinghai Royal Residence was sending gifts in such a high-profile manner indicated that the person living inside must have an extraordinary background.<br/><br/>Soon, some well-informed people found out that the person living inside was Gu Yang, ranked first on the Hidden Dragon List, who saved the prince’s life on the road.<br/><br/>In recent months, Gu Yang’s reputation has soared. His battle with Yi Yi, the top-ranked prodigy in Juyang City, has been widely publicized.<br/><br/>The discussion outside became even more heated in an instant.<br/><br/>Gu Yang looked at the boxes of gifts piled up in the courtyard. A steward from the royal family stood there, reading out what was inside each box as they were brought in.<br/><br/>Summarized in one sentence, they were all rare and extraordinary treasures.<br/><br/>He wanted to tell the royal steward that perhaps they could just convert all these gifts into silver.<br/><br/>After all, he would have to sell these gifts later, which seemed like a waste of time.<br/><br/>But out of courtesy, he didn’t voice this thought.<br/><br/>After all, the Jinghai Royal Residence was truly generous.<br/><br/>Earlier, Gu Yang had someone call the steward from the trading firm to estimate how much all these gifts were worth.<br/><br/>The steward quietly replied that just the gifts in the courtyard alone were worth about four to five hundred thousand taels. There was more to come, and generally, the later the gift, the more valuable it was.<br/><br/>Gu Yang was in high spirits; it seemed that his risk-taking to save the prince and princess was not in vain.<br/><br/>As expected of the lord of Jingzhou, he indeed does things with style.<br/><br/>Finally, the royal steward finished reading the long list of gifts and then issued an invitation: the queen would host a banquet in the royal residence that evening in honor of Gu Yang.<br/><br/>This time, Gu Yang didn’t refuse and agreed to attend.<br/><br/>It was finally time to reap the rewards.<br/><br/>As soon as the steward left, Gu Yang had another steward from the trading firm estimate the value of the gifts and then sell them.<br/><br/>He thought it would be difficult to sell them off, but by the afternoon, a steward came to report that all the items were sold, and they had made eight hundred and eighty thousand taels.<br/><br/>This gave Gu Yang a new understanding of the city’s commercial prosperity.<br/><br/>Nearly a million taels worth of items, all luxury goods, were sold in just one morning.<br/><br/>Without wasting any more words, he asked them to convert the banknotes into gold and bring them to his residence.<br/><br/>By nightfall, the gold had been delivered.<br/><br/>Gu Yang credited the gold to his system. His balance was now one million and six hundred thousand taels.<br/><br/>Before, he only had over sixty thousand left. He withdrew two hundred thousand from the account of Qian’s trading firm, adding this to the eight hundred and eighty thousand taels he now had, equaled exactly one million and six hundred thousand.<br/><br/>At night, many places in Jingzhou City were still brightly lit.<br/><br/>In a dark alley, two figures, one fat and one thin, appeared stealthily.<br/><br/>The thinner figure whispered, “Master, where are we going?”<br/><br/>The other replied, “We’re visiting an old acquaintance.”<br/><br/>These two were exactly the master and disciple from the Jade Door Sect, Gao Fan and Feng Tianci.<br/><br/>“Why didn’t they come during the day?”<br/><br/>“It wouldn’t have been convenient.”<br/><br/>While talking, Gao Fan took his disciple and climbed over a wall to enter the yard.<br/><br/>As soon as he landed, his steps halted, and he froze on the spot.<br/><br/>Feng Tianci, following behind, couldn’t help but shiver from a sudden chill, speaking up, “Master, do you feel something strange about this place?”<br/><br/>He lifted his head and saw a person standing on a tree in the yard, shrouded in darkness and only a silhouette could be made out.<br/><br/>For some reason, upon seeing this figure, Feng Tianci felt a chill run down his spine, his heart pounding uncontrollably.<br/><br/>Just as his heartbeat accelerated to the brink of explosion, Gao Fan stepped in front of him, causing the weird sensation to disappear.<br/><br/>However, Tianci’s fear didn’t lessen in the slightest. He stood still and dared not even breathe.<br/><br/>“A god-like person who has sealed his own cultivation level? Interesting.”<br/><br/>Suddenly, a voice as sharp as a knife sounded in his ears. Each word felt like a strike to his heart.<br/><br/>From inside the house, an old man’s voice echoed, “Who are you?”<br/><br/>The previous voice responded, “It doesn’t matter who I am. As long as you don’t step out of this yard tonight, everything will be fine.”<br/><br/>“Do you really think that my sword can’t cut you down?”<br/><br/>“The name of Emperor’s Supreme Sword Saint is indeed well known. But, 18 years ago, was it not difficult to bear Wu Da’s blow? These years, you’ve been hiding in Jingzhou City, relying on Wu Tianqi’s dragon energy to heal. If you act recklessly, although I won’t be able to withstand your sword, you won’t be able to suppress your injuries either. So, why bother?”<br/><br/>The person in the house went silent for a while before asking, “Your target is that sword, isn’t it?”<br/><br/>“Correct.”<br/><br/>“Only those with dragon blood can wield that sword.”<br/><br/>“The Sword Saint doesn’t need to worry about that.”<br/><br/>Then, there was a long silence.<br/><br/>Gao Fan, who blocked Feng Tianci, didn’t utter a single word, wishing he had never come.<br/><br/>They thought that coming at night wouldn’t attract attention, but who knew they would encounter a cultivator standing guard here? They’re really out of luck.<br/><br/>And all of this, because of one sword.<br/><br/>Gao Fan recalled that day when Gu Yang was holding a sword in the young man’s hand.<br/><br/>Considering the recent rumors about Sword Mountain collapsing and the Divine Sword, which had been embedded in Sword Cliff for almost a thousand years, disappearing, he guessed the truth.<br/><br/>That Divine Sword had attracted a cultivator.<br/><br/>At this moment, within the city, Gu Yang was walking alone under the moonlight, arriving at the gate of the King’s Mansion. Using the invitation in his hand, he was quickly escorted in.<br/><br/>The mansion was vast, someone leading him through the premises with a lantern in hand.<br/><br/>Halfway through, Gu Yang felt that something was odd. The atmosphere in the mansion was heavy and oppressive, he even smelled blood.<br/><br/>“Seriously?”<br/><br/>He seemed disappointed, as trouble arose just after receiving over a million taels.<br/><br/>And it wasn’t ordinary trouble.<br/><br/>This was the King’s Mansion, Jinghai King, who was the first ranker, known as the number one under the divine god level.<br/><br/>Those who dared to kill here were definitely not ordinary people.<br/><br/>“Should I leave?”<br/><br/>Gu Yang had this thought, and then opened up the system.<br/><br/>[Do you want to use the Life Simulator, using it once will cost 500,000 gold.]<br/><br/>“Yes.”<br/><br/>First, let’s use the simulator to predict the odds.\t\t\t\t\t\t</div>", "images": {}, "success": true}