{"id": 123, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14302306.html", "title": "Chapter 123 - Chapter 123: 123 Let Me Stab Twice", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 123 - Chapter 123: 123 Let Me Stab Twice</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 123: 123 let me stab twice<br/><br/>Translator: 549690339<br/><br/>[At age twenty-two, you’ve reached the First Rank cultivation level. In Juyang City, you’ve defeated Yi Yi, the number one on the Heavenly Pride List, making your name ring throughout the world.]<br/><br/>[After you arrived in Jingzhou City, you were invited to King Jin’s mansion. You discovered several assassins had sneaked into the mansion intending to assassinate the crown prince. You drew your sword to help, but you were overpowered and seriously injured. Fortunately, an expert from the city arrived in time, and you managed to stay alive, but Queen and the Crown Prince of Jingzhou were killed on the spot.]<br/><br/>[After recovering from your injuries, you received a letter from King Jin.]<br/><br/>[Five years later, at your suggestion, King Jing staged a fake death and gave the throne to Wu Xingyun. However, one of his generals was not satisfied and led a rebellion. King Jing revealed himself, capturing all the rebels at once.]<br/><br/>[Four years later, Xi Tianyi, ranked second on the First Rank List, challenged King Jing. In the fierce battle, both of them stepped into the Divine Power Realm. Suddenly, a mysterious individual from the Mana Realm appeared, intending to kill both. But a sword flew from the sky and drove him away.]<br/><br/>[Nine years later, Ling Ling, under the protection of King Jing, successfully stepped into the Divine Power Realm.]<br/><br/>[The same year, Qin Wu declared a war on Zhou. Four Celestial Beings fought, breaking the space passage, leading to a massive invasion by the Star Luo Sect.]<br/><br/>[You, Ling Ling, and others, went into hiding in a secret realm in Tianzhu Mountain. Together, you killed a Divine Power Realm cultivator who had claimed that secret realm for himself. Afterwards, you cultivated in that secret realm.]<br/><br/>[Eight years later, Su Qingzhen successfully reached the Divine Power Realm.]<br/><br/>[Five years later, a grand battle broke out in the outside world. The entrance to the secret realm was destroyed, and the secret realm was exposed to the world. Protected by Ling Ling and Su Qingzhen, you escaped from there.]<br/><br/>[You learnt that several years ago, another ancient prohibition was broken, revealing a passage to a separate world. Wanxiang Gate reappeared in the world, competing with Star Luo Sect for control over this part of the world.]<br/><br/>[You were quickly discovered by disciples of Wanxiang Gate and chased by a cultivator of the Mana Realm. A few months later, with nowhere to flee, you were killed on the Eastern Sea Coast. You died at the age of fifty-three.]<br/><br/>When Gu Yang read the first few lines, he felt a sense of relief. Although this journey was fraught with dangers, at least he survived.<br/><br/>Latterly he received King Jing’s trust and favor, which proved the venture worthwhile.<br/><br/>The story continued to develop as expected after that.<br/><br/>Until…<br/><br/>What the heck is the Wanxiang Gate?<br/><br/>Gu Yang was truly distressed for this world. The Star Luo Sect had already caused enough calamity, and in just a few years, the Wanxiang Gate surfaced. Could this land withstand such heavy blows?<br/><br/>This Wanxiang Gate didn’t seem to be a positive force, hunting martial artists from this world without hesitation.<br/><br/>They wouldn’t even let anyone escape.<br/><br/>Gu Yang felt that his path to immortality was just too difficult. In just thirty years, so many dangerous enemies had appeared, leaving him no place to hide.<br/><br/>[Simulation ends, you can keep one of the following:]<br/><br/>[One, your martial arts realm at the age of fifty-three.]<br/><br/>[Two, your martial arts experience at the age of fifty-three.]<br/><br/>[Three, your life wisdom at the age of fifty-three.]<br/><br/>Gu Yang hesitated for a few seconds and then decided to choose the first option. The progress made in thirty-one years should be significant enough to greatly boost his strength.<br/><br/>The servant leading the way suddenly had a sinking feeling, swiftly turning around to see Gu Yang’s True Essence erupting with terrifying pressure. The servant almost knelt from the intensity.<br/><br/>Just then, a loud rumble echoed from the mansion, and two strong presences clashed.<br/><br/>The servant froze momentarily before his face turned to fear. He screamed, “Attack—”<br/><br/>He left Gu Yang quickly, scrambling away to alert others.<br/><br/>A woman’s voice suddenly sounded from the side, “Are you Gu Yang?”<br/><br/>Gu Yang circulated his surging True Essence, which had increased by thirty percent more than the last time.<br/><br/>He turned to see a tall woman standing on the wall. She was holding a pair of short blades and looked quite young.<br/><br/>The woman on the wall looked down at him with a slight smile, “They say you’re a once-in-a-lifetime genius. Let’s see how many of my blades you can block.”<br/><br/>Feeling a sense of danger emanating from her, Gu Yang asked her grimly, “Who are you?”<br/><br/>The woman said, “Remember this, my name is Feng Xiaoxiao.”<br/><br/>Gu Yang thought for a moment. Her name was not on any list.<br/><br/>At this time, an intense battle broke out again within the mansion’s inner courtyard.<br/><br/>Two First Rank cultivators.<br/><br/>Adding the one in front of him, that makes at least three.<br/><br/>This was far from an ordinary power.<br/><br/>A typical provincial family, like the Lin Family from Jiangzhou, has just two or three of the First Rank in their family.<br/><br/>The forces who can dispatch three First Rank individuals at once, apart from the Nine Surnames and Six Major Sects, would only be a few families.<br/><br/>Which family could it be, after all?<br/><br/>What is their purpose?<br/><br/>Suddenly, a flash of insight crossed Gu Yang’s mind: the sword drawn by the Prince of Jinghai!<br/><br/>That Divine Sword, which even those at the Divine Power Realm couldn’t draw, was bound to attract the covetous eyes of others; it’s only normal.<br/><br/>He suddenly saw the light.<br/><br/>“Don’t worry, I won’t kill you. At most, I’ll just stab you a couple of times. You are a disciple from the sacred land, and the master doesn’t allow me to kill.”<br/><br/>As Feng Xiaoxiao spoke, her eyes were glowing, seemingly imagining how wonderful it would be to stab the man in front of her.<br/><br/>Gu Yang’s figure flickered and vanished on the spot.<br/><br/>Feng Xiaoxiao, standing on top of the wall, saw his ghost-like movements and became even more excited, saying, “Don’t run.”<br/><br/>Turning her head, she once again caught his figure and gave chase.<br/><br/>Boom!<br/><br/>As the battle broke out in the backyard of Jing King Mansion, many servants were stupefied. Those closer scattered and fled, while those further away were also terrified.<br/><br/>Only one inconspicuous groom’s eyes flashed with a sharp light that didn’t match his appearance. Taking advantage of the chaos, he headed towards the inner courtyard.<br/><br/>His real name was Jin Yu, and he was an assassin.<br/><br/>It took him three years to infiltrate the Jing King’s Mansion. Now, after waiting for one year, he was waiting for an opportunity to approach the target of his assassination.<br/><br/>Finally, his once-in-a-lifetime opportunity had arrived.<br/><br/>The King of Jinghai was not at the mansion.<br/><br/>The chief steward was already dead.<br/><br/>The other two First Rank members of the mansion were held up by the intruders.<br/><br/>At this moment, there was no one left in the mansion who could stop him.<br/><br/>Even so, Jin Yu was not the slightest bit careless, and his body almost completely merged into the darkness.<br/><br/>Inside the mansion, people were terrified, and all the experts had rushed to the backyard, so no one noticed him hiding in the shadows.<br/><br/>He knew the layout of the mansion like the back of his hand. After several twists and turns, he finally arrived at his target’s residence.<br/><br/>An anxious voice came from inside, “Madam, don’t go, it’s too dangerous.”<br/><br/>“No, Little Dragon is over there. I can’t rest easy.”<br/><br/>“Lord Xiao and Lord Deng are there. They will surely protect the young master.”<br/><br/>Inside the courtyard, Spring Peach was desperately trying to stop the lady when a man suddenly appeared before them. Judging by his attire, he looked like a low-ranked servant in the mansion.<br/><br/>He was standing there, blocking the gate to the courtyard. He looked up at them, his face expressionless.<br/><br/>Spring Peach felt her heart jolt and instinctively shielded the lady behind her, “Who are you?”<br/><br/>“Pei Qianlan!”<br/><br/>Jin Yu said the queen’s name word by word, taking out an object, “The master asked me to ask you, do you remember this?”<br/><br/>Upon seeing the object in his hand, Pei Qianlan’s face changed dramatically, “You are from… the Lei faction?”<br/><br/>Jin Yu smiled faintly, “Pei Qingdong dared to betray the old master. The master said he would exterminate his entire family, spare none. Do you really think Wu Tianqi can protect you?”<br/><br/>PS: It’s the 28th, the last day of the month. If you have monthly passes, go ahead and vote. We’ve been overtaken!\t\t\t\t\t\t</div>", "images": {}, "success": true}