{"id": 124, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310277.html", "title": "Chapter 124 - Chapter 124: What Is He Saying?", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 124 - Chapter 124: What Is He Saying?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 124: What is he saying?<br/><br/>Translator: 549690339<br/><br/>Upon hearing the offender disparage her father, Pei Qianlan became furious, retorting, “If your master really had guts, he wouldn’t keep hiding on Dragon Gate Island. Would he dare to come ashore?”<br/><br/>With an expressionless face, Jin Yu responded, “Once the master’s divine skill is perfected, he will personally come to Jingzhou City, kill that meddlesome Emperor’s Supreme Sword Saint and decapitate Wu Tianqi to mourn our deceased master. Unfortunately, you won’t be around to see that day.”<br/><br/>His tone became somewhat eerie as he continued, “Right now, Wu Tianqi is in seclusion on Heavenly Dragon Mountain. Xiao Yue and Deng Ziyuan are too busy with their own problems. Who do you think can come to your rescue?”<br/><br/>Clang!<br/><br/>Pei Qianlan pushed Spring Peach aside and said somewhat resignedly, “Then let’s get this started.”<br/><br/>She knew the chances of survival were slim with her current predicament.<br/><br/>The man in front of her might not seem conspicuous, but he radiated an extremely dangerous aura. A chilling intent to kill firmly locked onto her, leaving her with no room to retreat.<br/><br/>At this point, her only option was to stake her life on the sword in her hand!<br/><br/>Jin Yu, however, was not in a rush to act. He said, “The master once commanded that we must not kill you easily. That would be too kind. He wants you to experience all kinds of torture, so you’ll beg for death but won’t able to die…”<br/><br/>His voice was chillingly cold, as if it carried with it the icy air from the underworld.<br/><br/>Hearing this, Spring Peach shuddered, “You’re such a…”.<br/><br/>Before she could finish, she was struck, spat out blood, fainted, and collapsed onto the ground.<br/><br/>First Rank!<br/><br/>Seeing this scene, Pei Qianlan felt a shiver run down her spine.<br/><br/>The man before her is a First Rank powerhouse.<br/><br/>Seeing him dressed as a servant of the royal mansion, she knew that he must have been lurking in the mansion for a long time, carefully planning just to kill her.<br/><br/>If he was Second Grade, she might stand a chance.<br/><br/>Facing a First Rank opponent, she knew she had no chance.<br/><br/>She is not Gu Yang; she does not have the ability to defeat opponents of higher ranks.<br/><br/>In her mind, Pei Qianlan couldn’t help but think of the gruesome state her parents and brother were in at the time of their deaths.<br/><br/>That man’s cruelty and intense hatred for her father. He’s definitely the type to do as he says.<br/><br/>“Father, forgive your unfilial daughter.”<br/><br/>“Prince, I’ll repay your kindness in my next life.”<br/><br/>With these thoughts, she held the blade to her neck, ready to kill herself.<br/><br/>However, no matter how hard she tried, the sword in her hand wouldn’t budge.<br/><br/>Pei Qianlan opened her eyes to find Jin Yu had somehow made his way in front of her, holding the blade with two fingers.<br/><br/>A sinister smile spread across his face, “Want to die? Not so easy.”<br/><br/>Infuriated, Pei Qianlan used all her strength to swing at his chest. Before she could touch him, his Protective Gang Qi left her arm numb.<br/><br/>Her True Essence within was nearly shattered.<br/><br/>A person ranked fifth on the Hidden Dragon List and a Second Grade was simply like a toddler before a First Rank powerhouse, without any ability to resist at all.<br/><br/>“Just wait. I’ll strip off your clothes and let all the servants in the royal mansion appreciate how fascinating the body of the famous Jinghai Princess, who’s included in the Beauty List, is.”<br/><br/>Jin Yu’s venomous remarks struck Pei Qianlan as a sharp arrow, draining all color from her face. She was horror-struck.<br/><br/>To her, it was worse than death itself.<br/><br/>When the time comes, not only her reputation would be ruined, but also that of the Jinghai King.<br/><br/>At this moment, Pei Qianlan truly understood the meaning of ‘desire to live, desire to die but unable to’.<br/><br/>Looking at her desperate and helpless state, Jin Yu licked his lips, satisfied, “If the master could see you now, he’d be thrilled. Remember, this is the price your father has to pay for betraying our old master. Kneel down and repent to the old master, I might consider giving you a swift death.”<br/><br/>“Hey, haven’t you heard that villains die because they talk too much?”<br/><br/>Just then, a sudden voice echoed.<br/><br/>The smug smile on Jin Yu’s face froze as he turned around and saw an additional figure behind him.<br/><br/>To be precise, there were two of them. Not far away, another shadow was swiftly moving towards them.<br/><br/>It was a young man, handsome and heroic. His eyes were bright but subdued, blending him in with his surroundings.<br/><br/>Alarms were ringing in Jin Yu’s heart. He did not sense this person’s approach at all, indicating that his strength was likely not inferior to his own.<br/><br/>Was there another First Rank in the Jinghai King’s Residence?<br/><br/>The King of Jinghai had been secluding himself over the years. There were supposed to be only three First Ranks in the King’s Residence. The butler had already died, leaving only Xiao Yue and Deng Ziyuan.<br/><br/>Where did this one come from?<br/><br/>“Master Gu”<br/><br/>When Pei Qianlan recognized the man, it was like she was falling into hell and suddenly saw a ray of light from the Human Realm. This light swept away all the surrounding demons, and tears welled up in her eyes.<br/><br/>In the simulation, Gu Yang knew that the Jinghai Princess and Prince were in danger. Naturally, he was reluctant to waste time, rescuing them was the priority.<br/><br/>He had gone through so much trouble to save the Jinghai King’s son and daughter last time. If they died now, wouldn’t that have been a wasted effort?<br/><br/>This time, if he rescued the Princess as well, wouldn’t the Jinghai King have to thank him properly?<br/><br/>He used a technique known as “Transforming Shadows”, which he learned in a simulation at the martial arts academy. It was perfect for a complex environment like the King’s Residence, leaving the crazed woman behind in the dust.<br/><br/>As soon as he arrived in the backyard, he suddenly sensed a familiar aura not far away.<br/><br/>“Is it her? Is she also in danger?”<br/><br/>He recognized her as the daughter of the Jinghai King, whom he had accidentally injured the last time on Sword Mountain.<br/><br/>Without hesitating much, Gu Yang chose to save her first.<br/><br/>After all, there were two First-Ranks over there, and they couldn’t decide the outcome of the fight right away.<br/><br/>Furthermore, he only just managed to save her life previously. If she were to die now, wouldn’t the previous rescue have been in vain?<br/><br/>As soon as he arrived at the courtyard, he heard a lewd man threatening her. He could not stop himself from interrupting, “Haven’t you heard that villains often die mid-monologue?”<br/><br/>With pursuers on his tail, he wasted no time and quickly closed the distance. Grasping the handle of his sword, his aura transformed.<br/><br/>What a terrifying Blade Intent!<br/><br/>Jin Yu’s face changed, the immense pressure made him realize that he had met the most formidable opponent in his life. He could no longer afford to worry about Pei Qianlan behind him, all his concentration was focused on the formidable enemy in front of him.<br/><br/>Gu Yang drew his blade, and a brilliant glow erupted from the darkness. Whether it was Pei Qianlan, Jin Yu, who was facing this blow head-on, or Feng Xiaoxiao, who was chasing from behind, all were briefly blinded by the shine of the blade.<br/><br/>In an instant, it seemed as though space itself had been sliced in two.<br/><br/>This blade strike was so fast it defied description.<br/><br/>The dazzling blade glare was reflected in Jin Yu’s pupils. He froze, his mouth agape, as if he wanted to say something.<br/><br/>Swish!<br/><br/>Suddenly, a massive amount of blood sprayed from his neck, and his head fell to the ground, rolling to Pei Qianlan’s feet.<br/><br/>The second form of the God Slayer Nine Styles, Drawing the Sword!<br/><br/>Not far away, Feng Xiaoxiao watched the strike, her eyes practically gleaming with admiration. “Great sword technique, you’re worthy of me using that move. Don’t run away.”<br/><br/>On the other side, Gu Yang had already scooped Pei Qianlan up and started running, cursing inwardly, “crazy.”<br/><br/>To the woman in his arms, he said, “Tell me, where are your brother and mother?”<br/><br/>“Huh?”<br/><br/>Upon hearing his words, Pei Qianlan was completely flabbergasted.<br/><br/>My brother and mother?<br/><br/>What is he talking about?<br/><br/>PS: Last day of the month, asking for monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}