{"id": 128, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310281.html", "title": "Chapter 128 - Chapter 128: 128 Human Emperor Sword", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 128 - Chapter 128: 128 Human Emperor Sword</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 128: 128 Human Emperor Sword<br/><br/>Translator: 549690339<br/><br/>In that small courtyard, Feng Tianci saw a lightning bolt in the sky that tore through the darkness before his eyes, its blazing, incandescent light was so dazzling.<br/><br/>Through this light, he could see the figure in the tree clearly. He was shrouded in a black robe, concealing his features.<br/><br/>Embroidered on his robe was a red flame pattern, which seemed to be stitched with an unusual thread. At first glance, it appeared like a real flame, burning furiously.<br/><br/>Inside the room, an old voice said, “What an impressive Lightning Annihilation, the descendant of the Blue Sky Palace has reappeared. You’ve chosen a rather inopportune time indeed.”<br/><br/>“Hmph!”<br/><br/>Following a cold huff, the figure in the tree vanished into thin air.<br/><br/>In the end, the old man inside the room did not make a move.<br/><br/>A gust of wind blew into the courtyard, rustling the leaves of the tree.<br/><br/>At this moment, Feng Tianci felt the pressure around him easing off, and his legs grew soft. He nearly collapsed onto the ground, gasping for breath, and felt as if he had survived a calamity.<br/><br/>He tried to stand up, but couldn’t gather even a trace of True Qi. He had no idea when all his True Qi had been depleted.<br/><br/>Gao Fan paid no attention to his disciple lying on the ground. Looking towards the direction where the lightning had struck, he spoke in a complex tone, “He has made faster progress than that woman from twenty years ago.”<br/><br/>In the room, the Emperor’s Supreme Sword Saint questioned, “Do you truly believe this person is a descendant from the Blue Sky Palace?”<br/><br/>The Blue Sky Palace, one of the legendary Four Great Sacred Lands.<br/><br/>The founder of the Dao Sect, one of the Six Major Sects, was merely a nominal disciple of the Blue Sky Palace back in his day.<br/><br/>For most people, the existence of the Four Great Sacred Lands is so utterly elusive that no one knows their locations. The fleeting appearances of disciples from these Sacred Lands often leave no traces behind.<br/><br/>Neither the founder of the Dao Sect nor the woman from twenty years ago have many who’ve seen their true visage. All that remains are legends. The truth of these legends is anybody’s guess.<br/><br/>The voice of the Emperor’s Supreme Sword Saint reverberated from within the room, “Even that woman from twenty years ago has never admitted that she is a descendant of the Blue Sky Palace.”<br/><br/>Gao Fan looked surprised, as the Emperor’s Supreme Sword Saint had a deep[-]rooted relationship with that woman. Thus, his words could be trusted.<br/><br/>If that woman was not a disciple of the Blue Sky Palace, it would be terrifying. This would mean she had duped the previous emperor of the Great Zhou, the Wu Family, and even the entire realm.<br/><br/>After all, the queen consort of the founding emperor of the Great Zhou was said to be a descendant of the Blue Sky Palace. The royal family of the Great Zhou always took pride in their connection with the Blue Sky Palace.<br/><br/>Without this association, how could the previous emperor of the Great Zhou have trusted that woman so deeply?<br/><br/>And the Emperor’s Supreme Sword Saint, who was originally dedicated to the service of the royal family…<br/><br/>In the end, the Wu Family was annihilated, and a Longevity realm practitioner fell.<br/><br/>The Great Zhou lost a Sword Saint, several Divine Power cultivators, and countless lesser martial artists.<br/><br/>The factions that participated in that battle also suffered heavy losses…<br/><br/>The more Gao Fan thought about it, the more alarmed he became.<br/><br/>However, the Emperor’s Supreme Sword Saint’s tone was somewhat indifferent, “Don’t forget, the Phoenix Dance Nine Heavens technique originated from the Shen Family. You know better than me about the origins of the Shen Family. If he really is from the Blue Sky Palace, he would not practice this technique.”<br/><br/>Gao Fan fell into deep thought.<br/><br/>After a while, the Emperor’s Supreme Sword Saint finally asked him the purpose of his visit, “Why have you come to me?”<br/><br/>Only then did Gao Fan remember his real task, and he said solemnly, “Recently it’s been circulating in the Jianghu that all the treasures of the Xia Dynasty, including the legendary Human Emperor Sword, were hidden in a secret realm when the dynasty fell eight hundred years ago. The location of this secret realm and the method to unlock it are supposedly hidden within a treasure map.”<br/><br/>“The Human Emperor Sword?”<br/><br/>With a loud bang, the door to the room was pushed open, and the old man inside stepped out.<br/><br/>“What?”<br/><br/>As the body fell, Gu Yang gave a startled gasp. The body was not that of the Saint Child, but of a guard from the royal mansion.<br/><br/>“What kind of movement technique is this?”<br/><br/>He had clearly targeted the Saint Child, yet in the final moment, the latter had swapped places with a guard from the royal mansion.<br/><br/>The speed was so fast that it even deceived him. It could be said to be extremely strange.<br/><br/>It was no wonder that the Red Venerate Sect was one of the Six Major Sects. It could not be underestimated.<br/><br/>This was the first time he had ever seen an exchange places technique.<br/><br/>At this moment, a cold voice from afar conveyed a message, “This gift of a blade will be repaid in the future.”<br/><br/>Gu Yang didn’t care. No matter how harsh his words, it couldn’t cover up the fact that he had fled like a house in ruins.<br/><br/>If they meet again next time, he would end it with one stroke.<br/><br/>What he needed to be more wary of were the Divine Power realm experts from the Red Venerate Sect.<br/><br/>With each of the Nine Great Families having Longevity realm powerhouses present, the Six Major Sects were recognized as powers at the same level. At the very least, they would have several Divine Power level practitioners as well.<br/><br/>Gu Yang glanced to the side and noticed that the woman he had just saved was gone. He wasn’t sure where she had run off to.<br/><br/>As expected, these ladies from prestigious families didn’t understand gratitude. He had saved her twice, and she hadn’t even thanked him once.<br/><br/>She wasn’t even comparable to Qingzhi.<br/><br/>“Thank you, Lord Gu, for your rescue. The royal mansion is deeply grateful,” uttered Deng Ziyuan, who was lightly injured, as he assisted the critically wounded Xiao Yue over to express their sincere thanks.<br/><br/>If it hadn’t been for Gu Yang today, their own deaths would have been insignificant. However, if anything had happened to the Crown Prince, they couldn’t bear such a grave blame.<br/><br/>The gratitude of the two was beyond words.<br/><br/>Even Xiao Yue, with severe burns all over her body, forced herself to come over.<br/><br/>There were still people in the royal mansion who understood manners.<br/><br/>Gu Yang replied with a smile, “It was nothing more than a helping hand. Are the queen and the Crown Prince alright?”<br/><br/>Deng Ziyuan replied, “The princess and the prince are inside, but the prince has not awakened yet and cannot personally thank you.”<br/><br/>“That’s fine.”<br/><br/>Gu Yang had already discovered that the prince’s coma was the result of the Divine Sword. In his haste to hand over the prince to the carriage maid, he felt it was a hot potato.<br/><br/>Just as expected, after so many days he still had not woken up.<br/><br/>“I won’t disturb them today, just arrange a place for me to stay.” Gu Yang courteously offered to stay.<br/><br/>Instead of allowing the followers of Red Venerate to strike back, it was better to guard here. Once the Prince of Jinghai returned, he would not have to worry.<br/><br/>He had worked so hard to save the prince and in doing so, had used up his last two simulations. Before receiving his reward, how could he leave?<br/><br/>Deng Ziyuan had been worried about this, hearing him offer to stay made him even more grateful, “I will arrange it immediately.”<br/><br/>Gu Yang couldn’t resist saying, “You should take her to get medical attention right away, she looks like she won’t last much longer.”<br/><br/>In the palace, as Pei Qianlan watched Gu Yang being led away by the butler, her hanging heart finally landed. For some reason, she didn’t want him to know her true identity.<br/><br/>If he had asked to see the princess just now, she wouldn’t have known what to do.<br/><br/>Her hand moved away from her chest, she took a deep breath and walked inside.<br/><br/>After a dozen steps, she became the dignified and elegant princess again.<br/><br/>“Your highness.”<br/><br/>Several maids guarding the entrance saw her and bowed.<br/><br/>Pei Qianlan asked, “Is Little Dragon alright?”<br/><br/>Maid Autumn Moon replied, “He is fine, Auntie Mo is currently with him.”<br/><br/>“Open the door.”<br/><br/>After the door opened, she walked in and saw her son lying comatose, her heart filled with great worry.<br/><br/>He had been in a coma for nearly ten days.<br/><br/>Mo Feiyan, standing on one side, did not skimp on etiquette, “Greetings, princess. What about the enemy outside?”<br/><br/>“They’ve been repelled.”<br/><br/>Upon hearing this reply, Mo Feiyan let out a sigh of relief, then she felt a sense of fear towards Gu Yang’s strength.<br/><br/>Within the palace now there were two first-rank individuals, Xiao Yue and Deng Ziyuan. Having been through many battles and personally instructed by the prince, their strength was not weak.<br/><br/>The two of them couldn’t stop the enemies tonight, but Gu Yang alone repelled them. How strong must he be?<br/><br/>She composed herself and asked again, “When will the prince return? If Little Dragon continues like this, I’m afraid things won’t look good.”<br/><br/>Hearing mention of the prince caused Pei Qianlan to momentarily become lost in thought.<br/><br/>Yes, she was a married woman, the princess of Jinghai Palace!<br/><br/>Her fist clenched suddenly, her nails digging deep into her palm.<br/><br/>Mo Feiyan noticed something off about her and immediately assumed the worst, “What’s wrong? Did something unexpected happen to the prince?”<br/><br/>Pei Qianlan snapped back to reality, stating, “I’ve sent someone to notify the prince. He should be back in a few days.”<br/><br/>“That’s good.”<br/><br/>After a few more words, Pei Qianlan took her leave.<br/><br/>With such a big incident happening today, she needed to pacify the servants of the palace to prevent any rumors from spreading.<br/><br/>Having been a princess for almost eight years, she was well-trained in handling such matters.<br/><br/>By the time she had calmed down all the servants, it was already midnight.<br/><br/>The deputy with a broken arm came to report, “Master Gu has been settled in Chun Song Courtyard, so he can protect the lady and the prince.”<br/><br/>The Chun Song Courtyard was located between the princess’s and the prince’s quarters.<br/><br/>“Hmm. How’s your injury?”<br/><br/>“It’s just a minor wound. It’s nothing. You’ve been busy all night, you should go back and rest.”<br/><br/>“Madam!”<br/><br/>At that moment, Spring Peach rushed in from outside, tears streaming down her face as soon as she saw Pei Qianlan, “You’re safe, thank heaven!”<br/><br/>She had just woken up from unconsciousness, heard about the enemy’s retreat, and rushed over immediately. Seeing the princess unharmed, she was filled with overwhelming emotion.<br/><br/>“Let’s go, back to the palace.”<br/><br/>Pei Qianlan didn’t want her to leak out anything about the assassin and hurriedly led her away.<br/><br/>The deputy wanted to send someone to protect her, but she refused.<br/><br/>In the palace now, two first-rank individuals had been injured. The remaining second-rank individuals were all less capable than her. If there was a real danger, she didn’t know who would be protecting who.<br/><br/>Spring Peach holding the lantern walked in front. After a while, they arrived at Chun Song Courtyard.<br/><br/>Pei Qianlan looked at the courtyard, her eyes a bit dim.<br/><br/>“Are you here to thank me?”<br/><br/>Suddenly, a familiar voice teased.<br/><br/>Pei Qianlan got a shock, seeing a figure emerging from the darkness, tall and slender. If it wasn’t Gu Yang, who else could it be?<br/><br/>PS: Some have asked about the difference between sixth and seventh place for the new book monthly ticket, well, it’s just a loss of 2500 in cash (gritting teeth). And then asking for monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}