{"id": 129, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310282.html", "title": "Chapter 129 - Chapter 129: Day 129: Late Evening (Third Update, Asking For Monthly Ticket)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 129 - Chapter 129: Day 129: Late Evening (Third Update, Asking For Monthly Ticket)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 129: Day 129: Late Evening (Third update, asking for monthly ticket)<br/><br/>Translator: 549690339<br/><br/>Gu Yang did not rest, but sat in the courtyard, enjoying the moon while digesting his gains from the two simulation sessions today.<br/><br/>The greatest gain from these two trials was undoubtedly the preliminary tempering of his Pure Body.<br/><br/>Unexpectedly, Dragon Gate Island still housed such treasures.<br/><br/>The first stage of the Divine Realm is called the Golden Body realm. It demonstrates the importance of tempering the mortal body. Only by first training the Pure Body can one withstand the violent surges of heavenly and earthly vitality after bridging heaven and earth. This then forms the foundation for the Golden Body.<br/><br/>Now, he had preliminarily tempered the Pure Body, laying a solid foundation for his future breakthrough to the Divine Realm, which would be smoother.<br/><br/>This wasn’t all – there were immediate benefits as well.<br/><br/>The Pure Body provided a tremendous boost to one’s combat power.<br/><br/>While Gu Yang was contemplating this, he heard familiar footstep approaching and got up. He walked outside and teased, “Did you come here specifically to thank me?”<br/><br/>The woman outside was, indeed, startled.<br/><br/>However, before she could speak, the maid behind her that was clearly excited, called out, “Master Gu—”<br/><br/>Glancing over, Gu Yang recognized the maid as the one that had been driving the carriage that day and replied, “Hello.”<br/><br/>Spring Peach, the maid, proceeded to voice her elation, “I heard that you have once again saved the lady and the young master…”<br/><br/>Gu Yang had grown tired of hearing such words of thanks. The two first rank individuals, the steward, the escorts on the road, the maiden and servants serving in the courtyard, all had been thanking him.<br/><br/>Only this woman in front of him had not said a word of thanks once.<br/><br/>Gu Yang remarked, “Just that, some people don’t seem to care that much.”<br/><br/>“Huh?”<br/><br/>Upon these words, Spring Peach was a little flustered, thinking that Gu Yang had been disdained while in the residence and was offended.<br/><br/>“Spring Peach!”<br/><br/>The lady’s stern voice frightened the maid, who was not used to hearing such a tone from her mistress.<br/><br/>Prompted by this, she stepped back and remained silent.<br/><br/>Pei Qianlan paid Gu Yang a courteous bow and replied, “I will forever be grateful for the two instances where you saved my life, Master.”<br/><br/>Upon seeing her mistress act this way, Spring Peach was completely taken off guard. Her astonishment intensified when the lantern’s flame reflected a certain radiance in her mistress’s eyes that she had never seen before.<br/><br/>The color drained from Spring Peach’s face, replaced by fear.<br/><br/>She realized that the ritual performed by her mistress was one of an unmarried woman, not of a married woman.<br/><br/>Also, she referred to herself as a little girl…<br/><br/>Spring Peach was Pei Qianlan’s head maid, she held a high status among the servants. Although Peach wasn’t exceptionally clever, she dealt with the infighting amongst the servants and had learned to read people’s intentions herself.<br/><br/>Her mistress’s intentions were clear to her.<br/><br/>What to do?<br/><br/>Now, Spring Peach was genuinely panicked. This was a major dilemma.<br/><br/>Unbeknownst to Gu Yang, he was oblivious of these noble etiquettes; seeing her respectful attitude, he decided to make things easier for her, saying, “Actually, your strength is not bad, you just lack the experience of facing other opponents…”<br/><br/>“Mistress… it’s getting late, we should return,” Spring Peach nervously cut off Gu Yang and reminded.<br/><br/>Upon hearing this address, Pei Qianlan first felt relieved, and then her face burned. She knew that she had been exposed by her personal maid.<br/><br/>She bowed again in respect before bidding Gu Yang farewell.<br/><br/>On the way back, Spring Peach was full of turmoil, several times wishing to speak but stopping herself.<br/><br/>Pei Qianlan only broke the silence after returning to her room, “Do not mention today’s events to anyone. I am aware of my status and will never embarrass the royal household…<br/><br/>Spring Peach looked at her mistress’s calm face and felt a pang of heartache, murmuring, “My lady…”<br/><br/>No one knew better than Peach how the queen, her mistress, has lived these past few years.<br/><br/>Ever since their wedding, the prince has never set foot in their chambers, not even on their wedding night.<br/><br/>Regardless, in other people’s eyes, she was the princess consort. As long as she carries this title, her actions would represent the entire Jinghai royal residence.<br/><br/>It was truly a tough life for her…<br/><br/>In a blink of an eye, five days passed.<br/><br/>Gu Yang remained in the royal residence. He had already arranged for the people there to send a message to Su Qingzhen and the others to calm their worries about his absence.<br/><br/>Not entirely because of Wu Xingyun’s resentment, but to avoid any danger, he has not asked them to accompany him.<br/><br/>On the sixth day, Gu Yang finally received some good news.<br/><br/>The Qian family business has found a willing buyer. The total sale came up to 5 million taels.<br/><br/>This was even 1.5 million more than their initial estimate.<br/><br/>Indeed, it’s good to stand in the shade of a big tree. Now, everyone in Jingzhou City knows he’s the lifesaver of the Prince of Jinghai, so they dare not casually lower the price.<br/><br/>Maybe, the buyer might even pay more than the asking price.<br/><br/>An extra one million five hundred thousand out of nowhere, equivalent to three additional simulations.<br/><br/>This is truly a windfall.<br/><br/>Next, the transaction had to be settled.<br/><br/>Gu Yang found a place near the royal palace to conduct the transaction with the buyer. After half a day, he finally completed this five-million-tael transaction.<br/><br/>He requested the buyer to pay in gold, a total of fifty thousand taels.<br/><br/>Currently, the government’s gold-to-silver ratio was one hundred to one.<br/><br/>With the help of the palace guards, he moved these fifty thousand taels of gold into his residence.<br/><br/>As soon as Gu Yang and others left, he immediately deposited all the gold, and his balance quickly turned into five million. He felt confident in an instant.<br/><br/>This money is enough for him to conduct ten more simulations, which could increase his strength by one or two levels.<br/><br/>Indeed, money is the courage of a hero, this saying is absolutely correct.<br/><br/>As for the sudden disappearance of these gold pieces causing suspicion, he did not mind. At his level, he no longer worried about such small troubles.<br/><br/>So what if others find out?<br/><br/>Next, he just had to wait for the return of the King of Jinghai, and see if he could give him a surprise.<br/><br/>The King of Jinghai is indeed generous. The Dragon Pool at Dragon Gate Island, which can refine a pure body, was given to him for his use.<br/><br/>Obviously, this was to repay him for saving his son and daughter twice.<br/><br/>Gu Yang opened the system, ready to have one simulation first.<br/><br/>Based on past experience, getting such a large sum of money would definitely cause a great deal of trouble.<br/><br/>At this moment, he felt something in his heart, quickly grabbed the Phoenix Feather Knife nearby, and asked, “Who is it?”<br/><br/>A woman’s voice came from outside, “The Cao family, Ru Qin, seeking to meet Young Master Gu.”<br/><br/>The Cao family?<br/><br/>So it’s her.<br/><br/>Gu Yang just felt that this person’s aura was somewhat familiar. When she announced her name, he finally remembered. He had encountered her in Zhongzhou City. She was with Cao Yiyi at the time. She must be a senior member of the Cao family.<br/><br/>Although they didn’t meet face to face, he remembered the fluctuations of her True Essence.<br/><br/>After all, she is a First Rank.<br/><br/>But why did she come to Jingzhou to see him?<br/><br/>Whether it was her appearance in Jingzhou or her use of the word “seeking,” both were quite peculiar.<br/><br/>Gu Yang was curious, so he opened the door.<br/><br/>Outside the door was a woman. It was hard to determine her age, she could be in her twenties, or in her thirties or forties. After reaching First Rank, guessing one’s true age becomes difficult.<br/><br/>He got straight to the point and asked, “What’s the matter?”<br/><br/>Ru Qin looked at Gu Yang in front of her, her feelings were mixed.<br/><br/>She still remembered that last time in Zhongzhou, he was just a Second Grade, and in less than two months, he had entered First Rank, keeping pace with her.<br/><br/>Quickly, she adjusted her mood, and got down to business, “I’m here this time to ask Young Master Gu to save Yi Yi.”<br/><br/>What the hell?<br/><br/>Gu Yang thought there was a problem with his ears.<br/><br/>She traveled a long distance to Jingzhou, just to get him to save Cao Yiyi?<br/><br/>This situation was just too ridiculous.<br/><br/>Why on earth would she think that he would be willing to save people?<br/><br/>And why would she think that he would be able to save Cao Yiyi?<br/><br/>There is quite a bit of history between him and Cao Yiyi, to Cao Yiyi, he could even be considered an enemy.<br/><br/>“I apologize…”<br/><br/>“If the young master is willing to help, the Cao family is prepared to give two million taels as a reward.”<br/><br/>“…I’m afraid…<br/><br/>“Three million taels!”<br/><br/>“I can’t…”<br/><br/>“Five million, that’s the most the Cao family can offer.”<br/><br/>“Actually, I have quite a close relationship with Miss Cao, let me think about it.”<br/><br/>PS: Triple release, seeking monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}