{"id": 127, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310280.html", "title": "Chapter 127 - Chapter 127: 127 Thunder Punishment", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 127 - Chapter 127: 127 Thunder Punishment</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 127: 127 Thunder Punishment<br/><br/>Translator: 549690339<br/><br/>In a small courtyard several streets away from the royal palace, eerie silence prevailed.<br/><br/>Feng Tianci was finding it hard to bear this oppressive atmosphere. He felt suffocated, but forced himself to endure. He’d been standing for so long that his muscles were stiffening.<br/><br/>Just as he began to think that this deadly silence would persist until the end of time, the silhouette in the tree made a slight movement, seemingly looking towards the left.<br/><br/>Feng Tianci felt as if the air, which had almost become solid, was finally shattered. He released a long silent sigh of relief. If it had continued this way, he suspected he might asphyxiate.<br/><br/>At this moment, the old voice inside the house rang out again, “It seems, you’ve miscalculated.”<br/><br/>“Phoenix Dance Nine Heavens? The Shen Family?”<br/><br/>The voice of the figure in the tree still sounded extremely unpleasant, sharp enough to pierce eardrums.<br/><br/>Gao Fan also looked in that direction. Although he sensed nothing, he had a hunch that it had to be that man disrupting the situation again.<br/><br/>That young man named Gu Yang, whom even he couldn’t see through.<br/><br/>With this man present, he would surely give the Red Venerate a surprise.<br/><br/>The moment Gao Fan saw the figure in the tree, he recognized his identity – a member of the Red Venerate.<br/><br/>Based on the opponent’s reaction, the Red Venerate had only sent this one Divine Power level man to seize the Divine Sword from the royal palace, the rest were all of the First Rank.<br/><br/>The figure in the tree ceased speaking, and once again the yard returned to silence.<br/><br/>In the royal palace, inside the Crown Prince’s chamber.<br/><br/>A woman stood by the bed, sword in hand, her face full of anxiety. She glanced back now and then, checking whether the prince had shown any signs of waking up. She was incredibly worried.<br/><br/>Especially when the outside gate was broken, she was so frightened that she almost jumped.<br/><br/>After a while, however, no enemies broke in.<br/><br/>Suddenly, Autumn Moon, the maid guard outside, cheered, “It’s Young Master Gu, Young Master Gu is here.”<br/><br/>Gu Yang is here?<br/><br/>Of course, the woman knew whom Autumn Moon referred to as Young Master Gu – Gu Yang, who had ranked first on the Hidden Dragon List and defeated the top of the Heavenly Chosen List. He was currently the youngest person to reach the First Rank.<br/><br/>Moreover, he had once saved her nephew’s life.<br/><br/>However, hearing this name, there was not a hint of happiness on the woman’s face; instead, it was even graver.<br/><br/>Her name was Mo Feiyan, the biological sister of the late Jinghai Princess, and the prince’s aunt.<br/><br/>When the Mo Family received news of their daughter’s death and the Jinghai Prince had taken a new princess, they sent her to look after her nephew.<br/><br/>In simpler terms, they were wary that this nephew’s position would become unstable.<br/><br/>Back in the day, the Jinghai Prince had managed to drive the Pirate King’s forces out of Jingzhou, and the Mo Family had played a big role. They could not tolerate any threats to the prince’s position.<br/><br/>Fortunately, so many years had passed, and Pei Qianlan hadn’t given birth to a single child.<br/><br/>From what Mo Feiyan knew, the prince had never spent a night with Pei Qianlan. Even on their wedding night, it was the same.<br/><br/>This woman posed no threat.<br/><br/>Yet, that didn’t mean her nephew’s position was completely secure.<br/><br/>Don’t forget, the prince also had an illegitimate son who used to be the first on the Hidden Dragon List.<br/><br/>Wu Xingyun was the most formidable competitor to her nephew.<br/><br/>In the past, he either stayed in Divine City or became Chu Xiyue’s follower, so it didn’t matter much.<br/><br/>Now, he had come to Jingzhou.<br/><br/>This rang an alarm for Mo Feiyan.<br/><br/>And Gu Yang, journeying alongside Wu Xingyun, evidently had a deep relationship with him.<br/><br/>Although he saved Little Dragon, he would have sided with Wu Xingyun, which wouldn’t be good for the Mo Family.<br/><br/>However, during this critical time, with enemies at the gate, the stronger Gu Yang is, the better. If those enemies break in and slaughter them, everything else is moot.<br/><br/>Mo Feiyan was in a great dilemma – she hoped Gu Yang would kill all those outside, yet hoped he would not be too strong. She was extremely conflicted.<br/><br/>Outside the prince’s chamber.<br/><br/>Feng Xiaoxiao, who had finally caught up, was livid to see that Gu Yang only regarded Tang Rui as a worthy opponent, ignoring her completely. For a moment, she felt as if her lungs were about to burst.<br/><br/>She roared, “Your opponent is me!”<br/><br/>Her aura surged dramatically, and she threw out two short blades. They turned into two light-blue, flying arc-shaped lights hurtling towards Gu Yang.<br/><br/>Without giving them a glance, Gu Yang leapt into the air, successfully evading Feng Xiaoxiao’s lock, causing the flying arcs to lose their target. They crashed into the wall, penetrating it, and disappeared in the blink of an eye.<br/><br/>Crack—<br/><br/>As Gu Yang hovered in midair, there were faint explosions in the air around him.<br/><br/>His pupils turned a pale purple, and a palpitation-inducing fluctuation radiated in all directions.<br/><br/>The prime recipients were the people in the courtyard.<br/><br/>Regardless of whether it was friends or foes, Pei Qianlan or Feng Ziyan, who was barely holding on, or Xiao Yue, who was severely injured on the ground, all of them were terrified. Their martial artist’s intuition gave them the fear of impending disaster.<br/><br/>The follower of the Red Venerate cult who was furiously attacking Feng Ziyan suddenly stopped, retreated to one side, and stared at the man in mid-air as if facing a powerful enemy.<br/><br/>Feng Xiaoxiao, who had just lost control was fuming with rage. Overwhelmed by Gu Yang’s aura, her face finally changed, revealing a slight fear and a hint of excitement.<br/><br/>“How strong, how did you train? How can you be so powerful?”<br/><br/>In the field, Tang Rui, the Holy Son of the Red Venerate cult who had borne the brunt of the pressure, was shocked when he sensed the destructive aura overhead.<br/><br/>The Divine Sky Six Destroyer!<br/><br/>Moreover, it was the Thunder Punisher!<br/><br/>Tang Rui was stunned by Gu Yang for the third time.<br/><br/>Just what the hell is this creature! He hasn’t even reached the Divine Power realm, yet he can master such a high-level technique.<br/><br/>Is there any room left for others to live?<br/><br/>Although Tang Rui had mastered a killing move at the Divine Power level, it was nothing compared to the Thunder Punisher.<br/><br/>The Thunder Punisher was the perfect counter to his “Red Flame Divine Skill”.<br/><br/>Under this move, his strength could, at most, be exerted to eighty percent.<br/><br/>This was the peerless saber technique passed down by the Holy Land of Blue Sky Palace. Unless he could practice the supreme sword technique recorded in the Holy Scripture, he had no chance of breaking this move.<br/><br/>The Red Venerate cult wasn’t to blame for having outdated information. Currently, only a few people knew that Gu Yang knew the Divine Sky Six Destroyer. For various reasons, they kept this information to themselves.<br/><br/>Therefore, very few people knew about this.<br/><br/>In another courtyard.<br/><br/>Feng Tianci suddenly felt a little apprehensive, as if there was a terrifying threat from a distance.<br/><br/>“The Divine Sky Six Destroyer!”<br/><br/>Someone on the tree said, and the tree slightly shook, showing the speaker was far from calm.<br/><br/>The old voice in the house then echoed, “Do you think you can come and go as you please here?”<br/><br/>There was a hint of murderous intent in his words.<br/><br/>The hair all over Feng Tianci’s body stood up, and he froze in place, holding his breath. He felt as if countless swords were pointing at him and any movement could turn him into a sieve.<br/><br/>This was too terrifying!<br/><br/>The tree in the courtyard was shaking even more violently now.<br/><br/>Outside, a gust of wind blew in, but it suddenly disappeared without a trace upon reaching the courtyard.<br/><br/>In the entire Jinghai Palace, everyone felt a sense of impending doom.<br/><br/>From powerful martial artists to servants who didn’t know martial arts, all of them looked up at the sky and trembled as if Armageddon had arrived.<br/><br/>“Run!”<br/><br/>Realizing the hopelessness, Tang Rui didn’t hesitate any longer. He turned into a shadow and vanished into thin air.<br/><br/>The other First Rank individual also moved quickly, disappearing in the blink of an eye.<br/><br/>Even the crazed Feng Xiaoxiao, when faced with life or death, made the rational choice to escape.<br/><br/>Didn’t she see that even Tang Rui had run away? She alone could not withstand Gu Yang’s strike.<br/><br/>Every move of the Divine Sky Six Destroyer carried destructive power.<br/><br/>Especially the move Thunder Punisher, which contained the power of heavenly thunder, could not be blocked by any Protective Gang Qi. If she didn’t leave now, she would be electrocuted to a charred corpse.<br/><br/>“Want to escape?”<br/><br/>Gu Yang gave a cold snort and slashed his saber.<br/><br/>Boom!<br/><br/>A thunderclap sounded in the sky.<br/><br/>A blade of light imbued with lightning tore through space and in an instant, shot out dozens of meters. It hit a figure.<br/><br/>With a series of crackling sounds, the terrifying lightning swallowed the figure.<br/><br/>Without even a grunt, the person became a corpse and fell straight down to the ground.<br/><br/>PS: Last night, in the last ten minutes, some readers overtook with a Silver Union, and my rank dropped to seventh. I almost coughed up blood. Please support with monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}