{"id": 135, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310328.html", "title": "Chapter 135 - Chapter 135: 135 First Rank List (Third Update Asking For Monthly Tickets)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 135 - Chapter 135: 135 First Rank List (Third Update Asking For Monthly Tickets)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 135: 135 First Rank List (Third update asking for monthly tickets)<br/><br/>Translator: 549690339<br/><br/>The early morning in Divine City was suddenly disturbed by a light rainfall.<br/><br/>The tranquil dawn was interrupted by the sound of clattering hooves. Soon after, a luxurious carriage appeared at the end of the road, only stopping when it reached the gates of the Martial Arts Academy.<br/><br/>The two horses pulling the carriage were majestic. They had golden hair and protruding foreheads that made it seem like they had horns.<br/><br/>This was the legendary Dragon Horse, a vehicle only the royal family had the privilege to ride.<br/><br/>A carriage drawn by Dragon Horses could only mean that a member of the royalty was inside.<br/><br/>“Your Highness, we have arrived at the Martial Arts Academy.”<br/><br/>The carriage door opened, and a man in black was the first to step out—it was Gu Yunfei, the eldest legitimate son of the Gu Family. An attendant held a large umbrella to shield him from the rain.<br/><br/>After him, a man dressed in bright yellow robes also disembarked. With his star-like eyes and high brows, he had an intimidating presence. A flaming red circle about the size of a fingernail on his forehead added a fearsome aura to his countenance.<br/><br/>This individual was none other than the fifth prince, Zhao Han.<br/><br/>This was his first visit to the Martial Arts Academy. Surveying the imposing gates of the academy, he expressed his surprise, “I heard that the academy has fallen from grace. I didn’t expect it to still have such an imposing presence.”<br/><br/>The academy’s gates were quite grand, comparable to those of the major government offices in Divine City.<br/><br/>Gu Yunfei responded, “The founding Emperor must have had high expectations for the academy. It’s a pity that times have changed, and the academy has fallen into such a state.”<br/><br/>“Yes. Both academies established by the founding Emperor have deviated from their original purpose.”<br/><br/>Gu Yunfei asked, “Your Highness, what information have you come to the academy to research?”<br/><br/>Honestly, he didn’t want to get too close to the fifth prince. However, he could not refuse this time and just wanted to finish the task swiftly to avoid being embroiled in the palace’s power struggles.<br/><br/>The current Emperor had been in poor health for a long time, and because of certain reasons, he had not yet appointed a Crown Prince. As the Emperor’s health continued to decline, the power struggles between the princes became increasingly fierce.<br/><br/>This fifth prince in front of him had no shortage of supporters.<br/><br/>For years, the Gu Family had adopted a low-profile policy, never wishing to be involved in the power struggles of the royal family.<br/><br/>“I plan to review some information about the Xia Dynasty,” the fifth prince answered.<br/><br/>The Xia Dynasty?<br/><br/>Gu Yunfei’s mind jolted as he thought of a recent rumor.<br/><br/>However, he didn’t show any reaction on his face. He asked, “Why not research in the Scholar Academy?”<br/><br/>With a smile, the fifth prince answered, “The founding Emperor collected books from all over the world and placed them in the Scholar Academy. But few people know that he had all those books copied and stored in the Martial Arts Academy. Every book in the Scholar Academy is also present here.”<br/><br/>“I see.”<br/><br/>Gu Yunfei genuinely didn’t know this.<br/><br/>Just as they were about to enter the academy, the fifth prince suddenly asked, “Is that the person responsible for updating the rankings?”<br/><br/>Gu Yunfei turned his head and saw an old man hobbling towards them. “Indeed, it is.”<br/><br/>He was shocked. Despite being only of Third Rank, the fifth prince had detected the old man’s presence before he did.<br/><br/>According to the rules of the Red Mansion, neither the royal family nor the court officials appear on its list. As a result, most people didn’t know how many experts were in the royal family or the court.<br/><br/>However, the Jinghai Princess was an exception. To the public, he was neither part of the royal family nor part of the Great Zhou court. Instead, he seemed like a warlord who maintained his own troops.<br/><br/>The Red Mansion included him on the First Rank list, which showed the court’s attitude towards him.<br/><br/>On the other hand, the fifth prince was a legitimate member of the royal family. Gu Yunfei only knew that he had a Cultivation Level of Third Rank, but his exact strength and position in the Hidden Dragon List remained a mystery.<br/><br/>Looking intrigued, the fifth prince said, “Since we’re here, let’s see if there have been any changes to the rank.”<br/><br/>Gu Yunfei saw no reason to refuse.<br/><br/>Soon, they saw the old man approach the Hidden Dragon List.<br/><br/>Could it be the Hidden Dragon List again?<br/><br/>In recent months, the Hidden Dragon List had been updated several times.<br/><br/>This time, the change couldn’t possibly be due to that man again, could it?<br/><br/>As Gu Yunfei watched, the old man swiftly posted the new list. When he took a closer look, he was taken aback.<br/><br/>Gu Yang still held the first position and had not advanced to the Divine Power realm.<br/><br/>The change was in the second position. Chu Xiyue was knocked down to third place by Pei Qianlan, who was previously fifth. And next to her name, the rank “First” was written clearly!<br/><br/>Two first rankers had appeared on the Hidden Dragon List at the same time!<br/><br/>Pei Qianlan was someone he was naturally familiar with—the wife of Jinghai Princess, ranked first on the First Rank List, and also the seventh on the Beauty List, Pei Qianlan, known for her natural beauty.<br/><br/>The fifth prince standing beside him let out a sound of admiration, “They say that natural beauty is also a kind of special physique, possessors of which often have sharp intellect. If such a person awakens their abilities, they can master any martial arts skill quickly and efficiently. It seems that the Jinghai Princess’s wife has just had an awakening.”<br/><br/>“Your Highness, your extensive knowledge is admirable,” Gu Yunfei said in flattery.<br/><br/>While the two of them were talking, they saw the elder didn’t leave but walked over to the First Rank List, tearing down the faded list pinned on it.<br/><br/>Both of their gazes became fixated and their expressions turned serious.<br/><br/>The First Rank List was also being replaced!<br/><br/>The weight of the First Rank List was incomparable to the Genius List and the Hidden Dragon List.<br/><br/>Those who could list on the First Rank List were the absolute strongest masters below the Divine Power realm. In an era where few were in the Divine Power realm, every master on the First Rank List wielded significant power.<br/><br/>In Great Zhou, if one wanted to know how the top warriors of various forces rank, one simply needed to look at the First Rank List. The more people a force had on the list, the stronger its power.<br/><br/>Just like the current first place on the First Rank List, the Princess of Jinghai, she used her own power to absolutely dominate the Jingzhou, creating a powerful force.<br/><br/>If changes occurred on the First Rank List, it wasn’t a small matter. It could potentially have a profound impact.<br/><br/>Both of them stopped talking, staring intently at the elder’s every move.<br/><br/>Finally, the elder pasted the new list up.<br/><br/>There were in total thirty spots on the First Rank List.<br/><br/>When Gu Yunfei saw the name in the thirtieth spot, his mind buzzed.<br/><br/>Gu Yang?<br/><br/>No, no, no, it must be an illusion!<br/><br/>His heart throbbed uncontrollably, he steadied his mind and looked again more carefully.<br/><br/>Thirtieth place, Gu Yang, unknown sect, from Jiangzhou, twenty-two years old.<br/><br/>Is it really him?<br/><br/>Gu Yunfei was completely dumbfounded, he felt like something must have gone wrong with the world.<br/><br/>How is this possible?<br/><br/>How long has he been in the First Rank?<br/><br/>One month?<br/><br/>No, it’s twenty-five days.<br/><br/>Less than a month.<br/><br/>He actually made it onto the First Rank List?<br/><br/>What kind of joke is this?<br/><br/>It’s no exaggeration to say that the gap between a newcomer in the First Rank and the First Rank List is much larger than the gap between the Ninth Rank and the Second Rank.<br/><br/>Entering the First Rank List in a month, such a thing had never happened before.<br/><br/>No, even the names of those on the Hidden Dragon List appearing on the First Rank List was an incredibly strange event in itself.<br/><br/>There must have been a mistake somewhere.<br/><br/>The people responsible for copying the list in the Red Mansion must have gotten the names wrong, right?<br/><br/>On the other hand, the reaction of the fifth prince, Zhao Han, was no better than his. His face was full of disbelief and shock, even mixed with a trace of confusion and anger.<br/><br/>He had heard Gu Yang’s name many times already.<br/><br/>To him, this was a person that he wanted to kill to stave off his anger.<br/><br/>Initially, when he heard about the emergence of a woman with jade-like bones in Jiangzhou, he was overjoyed. He was cultivating the Great Sun True Method, and a woman with jade-like bones was the perfect Cultivation Furnace.<br/><br/>He wanted to send someone to bring the woman over, but who knew that the Liu family would meddle, not only failing to accomplish the task but completely botching it. The woman’s whereabouts were lost.<br/><br/>When he heard about the woman again, he found out that she had already been taken. He was so angry that he almost stamped his foot in frustration.<br/><br/>Gu Yang’s name made it onto his hit list.<br/><br/>If he didn’t kill Gu Yang, he couldn’t quell his anger.<br/><br/>But every time he tried to find out about Gu Yang’s whereabouts and prepared to send someone to eliminate him, he kept hearing about Gu Yang’s amazing deeds. His cultivation level went from Third Rank, to Second Rank, and then to First Rank. Such a speed of cultivation was unheard of.<br/><br/>Now, Gu Yang had made it onto the First Rank List.<br/><br/>Even if he was in the last place, he was still a supreme master.<br/><br/>At this moment, he finally realized in despair that Gu Yang was no longer someone he could kill.<br/><br/>There was no one at such a level of power by his side!<br/><br/>PS: The third update, asking for monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}