{"id": 138, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310337.html", "title": "Chapter 138 - Chapter 138: 138 Shen Ao Approaches", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 138 - Chapter 138: 138 Shen Ao Approaches</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 138: 138 Shen Ao Approaches<br/><br/>Translator: 549690339<br/><br/>The Princess?<br/><br/>At this title, Gu Yang was utterly taken aback. He turned to look at Pei Qianlan, and seeing her not denying it, he was dumbfounded.<br/><br/>Could she really be the Princess Consort to the King of Jinghai?<br/><br/>How could she be so young?<br/><br/>Only then did he realize the extent of the blunder he had unwittingly committed.<br/><br/>He had mistaken the Princess for a County Princess…<br/><br/>If this got out, he would be widely ridiculed.<br/><br/>The crux of the matter was that he had been caught red-handed.<br/><br/>Having a private meeting with the Princess Consort of Jinghai was a grave accusation.<br/><br/>As a man, few could tolerate having a ‘green hat’ on their head, let alone a powerful figure like the King of Jinghai who ruled over the region.<br/><br/>If this reached his ears, they would become enemies in no time.<br/><br/>Guilt surged up in Gu Yang’s heart when he thought of this. He glared at the woman who was still shouting loudly.<br/><br/>This woman was too malicious. She didn’t just want to put the Princess in danger, she also wanted to make him fall out with the King of Jinghai.<br/><br/>Mo Feiyan trembled under Gu Yang’s gaze. A chill ran through her, her hands and feet felt cold, her face filled with panic. Fearfully, she asked, “What are you going to do? Murder to silence me?”<br/><br/>Gu Yang made no move to kill her.<br/><br/>His relationship with the Princess was above board. If he killed Mo Feiyan now, it would look suspicious. Once the King of Jinghai arrived, he would clarify the misunderstanding, and then settle the score with her later.<br/><br/>In a situation like this, it would seem as if he’s guilty whether or not he’s at fault.<br/><br/>Even if he managed to explain himself, there would definitely still be a knot in the King’s heart. Being as close as they were before would now be difficult.<br/><br/>Being a man himself, he understood this mindset very well.<br/><br/>Facing such a situation, all he could do was accept his bad luck. After all, he jumped to conclusions. If he had asked one more question then, he wouldn’t be in such an embarrassing situation.<br/><br/>Pei Qianlan completely disregarded Mo Feiyan. Her eyes remained on Gu Yang. Seeing that his face showed only shock and frustration, but no signs of disappointment, she couldn’t help but feel a pang of despair.<br/><br/>She was incredibly smart and had already inferred from Gu Yang’s reaction that he held no romantic feelings for her.<br/><br/>Thinking about how she had spent her days and nights worrying over him, becoming all haggard and lost…<br/><br/>It now seemed incredibly foolish.<br/><br/>She stood there, hands and feet gradually turning cold.<br/><br/>“What a lively event!”<br/><br/>A completely unexpected voice rang out from the side.<br/><br/>Gu Yang was startled and turned his head only to see a solitary figure perched on the wall. The man was hidden in the darkness, as if he didn’t exist.<br/><br/>He hadn’t even noticed when the man had arrived.<br/><br/>With a somewhat serious tone, he uttered the name, “Shen Ao?”<br/><br/>“So you know me?”<br/><br/>A trace of surprise shone in the eyes of the figure on the wall. This was indeed Shen Ao of the Shen Family. His status was higher than even the family head’s. He had once been on the First Rank list, and he was one of the top-ranked experts in the world.<br/><br/>He had originally secluded himself to make a breakthrough into the Divine Power realm, impelled by a command, he had left his seclusion early to undertake this mission in Jingzhou.<br/><br/>As arrogant as his name suggested, Shen Ao was annoyed when he found out that his target, not even in his thirties, was of the First Rank. He had been dispatched to take care of such a person.<br/><br/>It was like using a butcher knife to kill a chicken.<br/><br/>Regardless of Gu Yang’s illustrious battle record – that Second Grade cut down First Rank, that he was first on the Hidden Dragon List, and that he had defeated the top talent…<br/><br/>In face of absolute strength, all these were in vain.<br/><br/>Only those at the peak of the First Rank could catch his eye.<br/><br/>He had no regard at all for a small fry who had been in First Rank for only a few months.<br/><br/>Shen Ao arrived in Jingzhou City, found out that Gu Yang lived in the palace of the King of Jinghai, and just arrived like that.<br/><br/>He was not aware of the news of the King of Jinghai’s arrival. After all, nobody knew that the King of Jinghai had returned. The palace had just encountered a crisis and was still on high alert. The news had yet to spread.<br/><br/>However, even if Shen Ao knew that King Jinghai was in the palace, he was confident that he could capture Gu Yang and leave safely.<br/><br/>At night when there was the moon, his power was at least 10% stronger than in the daytime, he also had a variety of stealth art. He was confident he could escape even if he couldn’t win.<br/><br/>Earlier, he just happened to be passing by and heard the name “Gu Yang,” so he came over. He recognized Gu Yang as soon as he saw him.<br/><br/>The portraits of Gu Yang had already been drawn by the spies of all the major forces.<br/><br/>They didn’t give him a chance to play the fool at all.<br/><br/>After Shen Ao finished asking his question, he didn’t give him another chance to answer. He said, “Hand over the ‘Phoenix Dance Nine Heavens’, and I can leave you an intact corpse.”<br/><br/>“Shen Ao?”<br/><br/>Pei Qianlan, in her moment of sorrow, was startled when she heard this name.<br/><br/>Having been queen for so many years, she was more than just a figurehead. Over these years, with King Jinghai constantly cultivating in seclusion and the crown prince still young, she managed all the affairs of the royal household.<br/><br/>Although King Jinghai’s influence was confined to Jingzhou, knowledge about powerful forces like the nine great families was essential. Among them, the First Rank warriors of each family were of grave importance.<br/><br/>Brief information of Shen Ao flashed through her mind. He was the only individual who survived from the previous generation of the Shen family. He once secured the last place in the First Rank List, only to be surpassed by others. He had been cultivating in seclusion for many years.<br/><br/>The Shen family operated under Gu-worship (parasitic worms) mode, where each generation would have to choose a final victor.<br/><br/>There was only one exception to this – when someone from each generation achieved the Divine Power, the remainder could survive.<br/><br/>Shen Ao was the survivor of the previous generation.<br/><br/>Under such a brutal cultivation model, those who remained till the end were always the most cunning and powerful.<br/><br/>Shen Ao being the only survivor of his generation confirmed his incredible strength besides good fortune.<br/><br/>Last time when Pei Qianlan saw Gu Yang fight, she knew clearly that his power wouldn’t be a match for Shen Ao who had the strength of First Rank.<br/><br/>While “God Xiao Six Extinction” was indeed powerful, among the warriors in First Rank, who did not have Divine Power Stage moves?<br/><br/>At this moment, she saw Gu Yang draw his ink-black blade. His action was his response.<br/><br/>Shen Ao chuckled coldly, and the sky suddenly dimmed.<br/><br/>In an instant, all the light was gone. The moonlight in the sky, the lantern’s flame, everything around became pitch dark.<br/><br/>Pei Qianlan, being a First Rank practitioner with the ability to generate internal light in her empty room, could see only the purest black no matter how wide she opened her eyes.<br/><br/>The next moment, she could hear nothing. The sound of the wind, the chirping of insects in the yard, the breaths of the people nearby, the heartbeats…all vanished.<br/><br/>Even her own heartbeat became inaudible.<br/><br/>At this moment, she had become blind and deaf.<br/><br/>“Gu Yang”<br/><br/>She opened her mouth and shouted loudly.<br/><br/>She used all her force to shout, but it didn’t seem to produce any sound at all.<br/><br/>Unable to see or hear anything, terror magnified itself within her heart.<br/><br/>The image of Gu Yang falling dead on the scene flashed through Pei Qianlan’s mind and she couldn’t hold herself anymore.<br/><br/>“No”<br/><br/>She drew out her sword; the True Essence from within her body crazily poured into the Rhinoceros Sword she held, at its limit, she disregarded everything and continued encouraging the flow of True Essence.<br/><br/>All of a sudden, a faint Sword Light lit up, but it was very weak.<br/><br/>It was just like her fate: her parents had died tragically, her enemy was way too strong. One wave of his hand signalled countless people to chase her to death. For her, this arch-enemy was as terrifying as the darkness before her, leaving her no chances to fight back.<br/><br/>After entering the palace, at least she found a place to settle down. However, she knew it was not where belonged.<br/><br/>It’s not until Gu Yang’s appearance that there was finally a glimmer of light in her life.<br/><br/>He always managed to show up when she was most desperate, and he became the light of her life.<br/><br/>And right now, she realized that the palace had become another sort of darkness that made her incapable of resistance.<br/><br/>At this critical moment of life and death, Pei Qianlan finally let go of all her hesitations and put all of her strength into the Rhinoceros Sword, striking towards the darkness.<br/><br/>In a flash, a weak but extremely bright Sword Light pierced through the darkness before her eyes.<br/><br/>Even though she just opened up a small hole,<br/><br/>After Pei Qianlan made that strike, she was exhausted. Relying on that Sword Light’s shine, she caught sight of a familiar figure and shouted with all her strength, “Run away!”<br/><br/>PS: The third update, begging for monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}