{"id": 131, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310316.html", "title": "Chapter 131 - Chapter 131: 131 Celestial Being", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 131 - Chapter 131: 131 Celestial Being</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 131: 131 Celestial Being<br/><br/>Translator: 549690339<br/><br/>“The seal on the Phoenix Feather Knife?”<br/><br/>Upon hearing this, Gu Yang perked up. He picked up the Phoenix Feather Knife in his hand and asked, “You know this knife?”<br/><br/>Gao Fan didn’t answer directly, instead, he changed the topic, “Young Master, do you know that the divine weapons in the world are divided into different grades? Just like within the First Rank, there are still differences in power.”<br/><br/>Seeing him speaking eloquently, Gu Yang laughed, “Oh, how would you rank me within the First Rank?”<br/><br/>“Within the First Rank, according to combat power, it can be divided into five levels. The lowest is those who have just entered the First Rank.”<br/><br/>“The second level is those who have been in the First Rank for many years.”<br/><br/>“Above them are those at the pinnacle of the First Rank.”<br/><br/>“Beyond that are the last twenty on the First Rank List.”<br/><br/>“At the top are the top ten on the First Rank List.”<br/><br/>“There is a clear difference in combat power between these five levels. Of course, this is a general estimatation and there may be some discrepancies within each level.”<br/><br/>After he finished speaking, he began to evaluate Gu Yang’s strength, “Of course, geniuses like Young Master and Yi Yi, who have just entered the First Rank and can grasp the techniques of the Divine Power Realm, have combat power far beyond the first level.”<br/><br/>“Young Master’s current strength is roughly around the third level.”<br/><br/>Gu Yang’s gaze toward him changed slightly. He applied this method to the First Rank warriors he had met before, and indeed, things became clearer.<br/><br/>For example, Xing Kun and that member of the Lin Family who died at his hand were within the first level.<br/><br/>Yi Yi, who just broke through, the assassin from Juyang City, and the two guards from Jinghai Royal Mansion, are on the second level.<br/><br/>The First Rank alongside Chu Xiyue, Ru Qin from the Cao family, and the Holy Child of Red Venerate, belong to the third level.<br/><br/>And next, the one sent by the Shen Family, should belong to the fourth level.<br/><br/>Heh, the Shen Family really values him, they actually sent a strong warrior from the First Rank List to hunt him down.<br/><br/>“I’ve learned a lot.”<br/><br/>Gu Yang gave a salute, this Gao Fan, who could make such a detailed division of the First Rank Realm, was no ordinary person.<br/><br/>Even those from prestigious families like Xu Ruomei and Wu Xingyun didn’t know about this.<br/><br/>Of course, this was because their realm hadn’t reached that point, so they didn’t need to know.<br/><br/>But this information was very important to him, so he could clearly understand the place of his own strength, and the direction he should be working toward.<br/><br/>Gao Fan narrowed his eyes, seeming quite satisfied, and continued, “The reason why there is such a huge gap between the same rank is due to the cultivation method, the foundation one builds for themselves, and the level of martial arts techniques they master.”<br/><br/>“Most of these First Rank fighters have no chance to reach the Divine Power Realm. Only the people on the First Rank List have a glimmer of hope. The Young Master is different. You are practicing a peerless cultivation method and have just cultivated the Immaculate Body, reaching the Divine Power Realm is almost a natural progression.”<br/><br/>Gu Yang was even more surprised. Could this man see all this?<br/><br/>Then, Gao Fan brought the conversation back, ” Divine weapons are the same. There are a total of twenty-one top divine weapons in the world. Ten of them are swords. Can you guess which ten, Young Master?”<br/><br/>A thought struck Gu Yang, “Are you talking about the ten Sword Saints?”<br/><br/>There are a total of ten Sword Saints in Great Zhou, all in the Divine Power Realm.<br/><br/>Their backgrounds varied greatly, the vast majority of them did not belong to the six sects or nine great clans. Even many came from humble backgrounds, which was quite a fascinating thing.<br/><br/>The reason they’re called Sword Saints is because their sword techniques have reached an unfathomable level, invincible in the world.<br/><br/>But in the same era, having ten Sword Saints, the title seems a bit too common.<br/><br/>“Correct.”<br/><br/>Gao Fan nodded, “The reason why they are known as Sword Saints is precisely because the swords in their hands are supreme divine weapons that have been passed down from ancient times. With a divine weapon in hand, they can battle ancient beings in the Unleaking Realm even when they are merely in the Mana Realm.”<br/><br/>Gu Yang could hear a hint of envy in his tone.<br/><br/>He also realized that the reason why so many Sword Saints exist was not just because of their extraordinary swordsmanship, but more importantly, the swords in their hands.<br/><br/>“The title of Sword Saint is also related to the sword they hold. The sword in the hands of Asura Sword Saint, for example, is indeed the divine weapon Asura. The State-protecting Sword Saint holds the State-protecting Divine Sword…”<br/><br/>Upon hearing this, a thought suddenly struck Gu Yang. In that secret realm on Tianzhu Mountain, there is an Ice Soul Divine Sword. If Su Qingzhen reaches the Divine Power Realm in the future, would she also be called the Ice Soul Sword Saint?<br/><br/>At this moment, Gao Fan finally returned to the original topic, “The Phoenix Feather Knife in Young Master’s hand used to be the heirloom of the Gu Family in the Divine City, and it is also a top-tier divine weapon. With this knife, an ancestor of the Gu family once established an invincible reputation and almost made the Gu family one of the top eleven families in the world.”<br/><br/>“Unfortunately, he offended a Celestial Being and ended up grievously injured with the Phoenix Feather Knife sealed. From then on, the Phoenix Feather Knife became a mere piece of iron and could no longer show its sharpness.”<br/><br/>Gu Yang didn’t expect that there was such a story behind this Phoenix Feather Knife.<br/><br/>He said, “Since it was sealed by a Celestial Being, I guess it would be as difficult as ascending to heaven to break the seal, right?”<br/><br/>Gao Fan first shook his head, then nodded and said, “It is hard to say, it could be difficult or not.”<br/><br/>“What do you mean?”<br/><br/>“The one to tie the bell must untie it. If we want to break the seal on this Phoenix Feather Knife, we need to find the one who sealed it in the first place.”<br/><br/>That’s a Celestial Being! It is not an exaggeration to say that it is currently sitting at the top of the food chain in this world.<br/><br/>He was merely a first rank, how could he ask for help?<br/><br/>It was like a commoner coming to him and asking him to repair a knife he had previously broken. Not to mention whether he could meet him, even if he did, would he consider such a request?<br/><br/>If one were crueler, they might even slay this person on the spot.<br/><br/>It seemed Gao Fan could see Gu Yang’s dissatisfaction. He explained, “That celestial being is in Divine City. If you want to meet him, you just need to fulfill a condition. Furthermore, if you want him to act, you just need to help him complete a task.”<br/><br/>At this point, he stopped speaking and did not continue.<br/><br/>Gu Yang understood his intention and turned to Feng Tianci beside him and asked, “What method do you practice? What weapon do you use?”<br/><br/>Ever since Feng Tianci had entered the room, he had been extremely nervous. Seeing his normally carefree master talking to Gu Yang, assessing a first rank powerhouse, had left him stunned.<br/><br/>Now, hearing Gu Yang’s question, he quickly became nervous again, “I am… practicing the Mixed Yuan Skill and using… the saber.”<br/><br/>Gu Yang smiled and said, “In that case, how about I teach you ‘Mixed Yuan Ultimate Skill’?”<br/><br/>Upon hearing this, Feng Tianci was filled with joy, as if a pie had just fallen from heaven.<br/><br/>The “Mixed Yuan Skill” was similar to “Xuan Yuan Method”, both were basic techniques. It was said to be passed down from the Dao Sect, and this technique could only be cultivated to the fourth level at most.<br/><br/>However, the “Mixed Yuan Ultimate Skill” was the upgraded version of “Mixed Yuan Skill”, a genuine transmission from Dao Sect that directly targets the realm of divine power. It could be considered the most suitable for him.<br/><br/>Seeing his disciple standing there dumbfounded, Gao Fan laughed and scolded, “Why don’t you thank Master Gu quickly.”<br/><br/>Feng Tianci quickly knelt and thanked, “Thank you, Master Gu, for transmitting your skills.”<br/><br/>After so many simulations, Gu Yang had mastered many techniques of this level. He asked again, “As for saber techniques, which one do you want to learn?”<br/><br/>Feng Tianci was already somewhat dazzled and another pie hit him on the head, leaving him unsure what to say out of exhilaration.<br/><br/>Seeing his unambitious appearance, Gao Fan became irate, “Master Gu is asking you, hurry up and answer.”<br/><br/>After being scolded by his master, Feng Tianci seemed to be enlightened, “I would like to learn the ‘God Destroyer Nine Styles’!”<br/><br/>This kid, has quite the ambition.<br/><br/>The “God Destroyer Nine Styles” was second only to “Divine Thunder Six Destructions” among the many saber techniques he had mastered.<br/><br/>Gu Yang laughed and said, “I can pass you the first six forms. The last three are too dangerous, you should stop learning.”<br/><br/>This time, without his master’s reminder, Feng Tianci knelt, “Thank you, Master Gu.”<br/><br/>Gu Yang said, “You stay here these days. I’ll teach you the ‘Mixed Yuan Ultimate Skill’ and the first form of the ‘God Destroyer Nine Styles’. Once you master the first form, come to find me. I’ll teach you the second form.”<br/><br/>The implication being, he shouldn’t stick around him.<br/><br/>Firstly, Gu Yang didn’t have that much energy.<br/><br/>And secondly, staying by his side would be dangerous.<br/><br/>“Yes.”<br/><br/>After Feng Tianci finished speaking, he stood up from the ground and stood behind his master.<br/><br/>Gao Fan clasped his hands in admiration, “Master Gu is virtuous.”<br/><br/>This was genuinely from the bottom of his heart. When he took on this disciple, it was just convenient.<br/><br/>Who knew that this little guy would be so stupid, yet his talent was incredibly high. He cultivated the basic “Mixed Yuan Skill” to the realm of the fourth rank within just ten years.<br/><br/>This was awkward, since he didn’t have the “Mixed Yuan Ultimate Skill” and there was no way he could pass on his own technique.<br/><br/>Before Gao Fan set out to Jingzhou this time, besides looking for the Emperor’s Supreme Sword Saint, he also had the intention of finding a new master for this foolish disciple.<br/><br/>Initially, he planned to entrust him to the Emperor’s Supreme Sword Saint, but unfortunately, he was rejected.<br/><br/>So, he came to find Gu Yang.<br/><br/>To his surprise, Gu Yang gave him such a big surprise. The “Mixed Yuan Ultimate Skill” was only available in the dao sect and the royal family.<br/><br/>This was the most suitable skill for Tianci, and with this skill, it wouldn’t be long before he could break through to the third rank. In the future, it wouldn’t be difficult for him to make the Hidden Dragon List.<br/><br/>Gu Yang restricting the matter to a single transaction was even more to his liking.<br/><br/>Honestly, if he could, Gao Fan wouldn’t want his foolish disciple to have too much to do with Gu Yang.<br/><br/>Such a relationship was the best.<br/><br/>Gao Fan said, “Master Gu, you only need to go to the Divine City and solve the difficult problem hanging in front of the Star Picking Pavilion of the Academy. You can then get the audience of the celestial being. At that time, he will ask you to do something. As long as you do it successfully, you can make a request from him.”<br/><br/>In other words, there was a celestial being in the Academy of the Divine City?<br/><br/>Gu Yang felt like he had learned an incredible secret. It was no wonder the Academy was regarded as the head of the six sects. They were indeed impressive.<br/><br/>Gao Fan felt that exchanging one piece of information for one technique and one sword technique was too advantageous, so he revealed another piece of information, “Master, you need to be careful with the Shen family. If they learn about your cultivation method, they won’t give up.”<br/><br/>“As it happens, tell me about the Shen family.”<br/><br/>PS: The second update requires monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}