{"id": 132, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310319.html", "title": "Chapter 132 - Chapter 132: 132 Ling Ling Returns", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 132 - Chapter 132: 132 Ling Ling Returns</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 132: 132 Ling Ling Returns<br/><br/>Translator: 549690339<br/><br/>“The Shen Family”<br/><br/>Gao Fan couldn’t help but ponder. His expression became more serious, “Among the nine major clans, including the extinct Wu Family, there’s not a single simple one.”<br/><br/>He still can’t shake the fear from his memory of the battle against the Wu Family.<br/><br/>“The Shen Family’s Divine Power realm won’t easily make a move. There are three people you need to be careful of.”<br/><br/>“Clan leader Shen Po, who is the fifth on the First Rank List, an astoundingly powerful person. If he makes a move, with your current strength, there’s absolutely no chance for survival.”<br/><br/>“Shen Ao, Shen Po’s uncle, was once ranked thirtieth on the First Rank List. Though he was later pushed out of the list, he still possesses the equivalent strength of being at the bottom of the First Rank List.”<br/><br/>“Shen Yan, Shen Po’s younger sister, is also at the peak of the First Rank. These three are the Shen family’s strongest forces below the level of the Divine Power Realm.”<br/><br/>After hearing this, Gu Yang guessed that the one coming from the Shen Family would probably be Shen Ao. Possessing the strength equivalent to the bottom of the First Rank List made it normal for Gu Yang not to be able to defeat him in their last simulated fight.<br/><br/>Even so, with King Jinghai shielding him, not even Shen Po’s arrival would be a concern.<br/><br/>However, the crucial point is the Divine Power realm of Shen Family.<br/><br/>So, he asked, “Why do you say the Divine Power realm of Shen’s family won’t easily make a move?”<br/><br/>“The Shen Family has its enemies too.”<br/><br/>Gao Fan sighed clamingly and said, “In this world, no matter how high one’s cultivation is, there are always people stronger than you. Even if you become a Celestial Being, you can’t necessarily do anything you want.”<br/><br/>It could be seen that he said these words with deep feelings.<br/><br/>After this conversation with Gao Fan, Gu Yang roughly understood the situation.<br/><br/>…<br/><br/>In the afternoon, while Gu Yang was discussing Martial Arts with Gao Fan, another visitor arrived.<br/><br/>“Young Master.”<br/><br/>Zhang Xiao Hai came in under the guidance of a servant.<br/><br/>Seeing that someone came, Gu Yang called Feng Tianci over. After introducing them to each other, he said, “Starting today, I will teach you the Mixed Yuan Ultimate Skill.”<br/><br/>Whether teaching one or two, it’s still teaching. So, he asked the palace staff to bring Zhang Xiao Hai over.<br/><br/>Finally, Zhang Xiao Hai had broken through to the Ninth Rank. Although he couldn’t compare to Gu Yang and Su Qingzhen in terms of speed, by the normal standards, he was definitely a remarkable Martial Arts talent.<br/><br/>Zhang Xiao Hai was practically weeping with joy. He knelt down and said, “Thank you, Young Master.”<br/><br/>After following Gu Yang for so long, he was finally getting what he wished for.<br/><br/>Gu Yang helped him up, saying, “Learn diligently.”<br/><br/>Although he was satisfied with Zhang Xiao Hai, he did not mention the matter of accepting him as a disciple. It wasn’t because he was unwilling, but because he couldn’t.<br/><br/>His fame had grown too much, and the enemies he provoked were all at the First Rank. If Zhang Xiao Hai became his disciple, he would definitely become a target.<br/><br/>Moreover, it was foreseeable that his enemies would soon include the Divine Power realm. Of this, little Ninth-Rank Zhang Xiao Hai would lose control.<br/><br/>When he reaches the Third Rank, then we can speak of taking in disciples.<br/><br/>Zhang Xiao Hai and Feng Tianci were about the same age, but there was a vast difference in their abilities. One was at the Ninth Rank and one was at the Fourth Rank,<br/><br/>However, as Feng Tianci was quite simple-minded, he did not look down on Zhang Xiao Hai because of this. The two got along well.<br/><br/>After a few days, once Gu Yang had taught them the “Mixed Yuan Ultimate Skill” and the first technique of “God Destroyer Nine Styles”, Feng Tianci and his disciples readily departed.<br/><br/>To be honest, he was a bit reluctant. These past few days, besides teaching the two kids, he had learned a lot from his discussions about Martial Arts with Gao Fan.<br/><br/>This Gao Fan, although completely devoid of cultivation, possessed an insight into Martial Arts that was unfathomably deep, deserving of the title Martial Arts Grandmaster.<br/><br/>Gu Yang was curious. Such a character could never be an ordinary person. However, since he had not mentioned it, it wasn’t appropriate for Gu Yang to pry.<br/><br/>Once everyone had left, he could finally feel at ease and opened the system to start the simulation.<br/><br/>He felt suspicious of Gao Fan and his apprentices, mainly because Gao Fan’s depth was unfathomable, giving him a feeling of profound mystery.<br/><br/>It was precisely because of such defenses that he was unwilling to use the system in front of Gao Fan.<br/><br/>Just then, someone knocked on the door again. It was still a palace servant, “Young Master Gu, someone is seeking an audience.”<br/><br/>Again?<br/><br/>At this moment, Gu Yang had no desire to meet anyone else and declined flat out, “No seeing.”<br/><br/>“Yes.”<br/><br/>The servant acknowledged and was about to leave.<br/><br/>Zhang Xiao Hai, however, was more alert and stepped forward asking, “Did the person mention their name?”<br/><br/>“The lady said her name was Ling Ling.”<br/><br/>In the room, just as Gu Yang, who was about to start the simulation, heard this name, he immediately stepped out and said, “Wait a moment, please bring her in.”<br/><br/>Ling Ling finally came out of seclusion.<br/><br/>After calculating, she had been in seclusion for over three months since breaking through to the Third Rank.<br/><br/>He hadn’t seen her for several months and missed her quite a bit.<br/><br/>Soon, Ling Ling in a yellow dress appeared in his vision, followed by several people carrying several large boxes<br/><br/>Ling Ling looked at him with an unusually complex gaze, as if she had a thousand words to say. But when she came up to him, she simply said, “Pleased to see you, Young Master.”<br/><br/>After coming out of seclusion, she heard from her grandfather about the heroic deeds of Gu Yang during these times and was shocked beyond words.<br/><br/>Were it not for the fact that she knew her grandfather would never lie to her, she would never have believed it.<br/><br/>The fact that she could break through to the Third Rank and cultivate the Extreme Yang True Gang was all thanks to Gu Yang. Half of the True Essence in her body was due to his help.<br/><br/>Logically, Gu Yang should have reverted to being an ordinary man without any cultivation.<br/><br/>Then he indeed lost all his cultivation. Ling Ling was positive about this.<br/><br/>Why was it that after she came out, Gu Yang had already become First Rank?<br/><br/>What exactly did she miss these three months?<br/><br/>Ling Ling racked her brains trying to figure it out but still had no idea.<br/><br/>Throughout her journey, she listened to the people discussing the legendary deeds of Gu Yang every day – including his promotion to first place on the Hidden Dragon List, his defeat of the First Rank while being only Second Rank himself, his breakthrough from the Third Rank to First Rank in more than a month, his defeat of the number one on the Sky Pride List ending their winning streak…<br/><br/>Every bit of these stories, one after the other, gave her a strong sense of unreality.<br/><br/>Ling Ling really wanted to rush over to Gu Yang and ask him what was going on.<br/><br/>Even her grandfather was incredulous.<br/><br/>In the eyes of others, Gu Yang had risen from Third Rank to First Rank in the span of several months. Only she knew that he had gone from being an ordinary man with no cultivation to the First Rank.<br/><br/>Such a speed of cultivation was simply like a myth.<br/><br/>She even suspected for a while that Gu Yang was not the one she knew.<br/><br/>At this moment, Ling Ling stood in front of Gu Yang, sensibly feeling the immeasurable cultivation coming from him. Finally, she could confirm that all the rumors were true.<br/><br/>The Gu Yang from the rumors was indeed standing in front of her.<br/><br/>Just then, two big hands grasped her shoulders and pulled her into a broad chest. Her ears turned bright red, and she subconsciously wanted to push him away, but Gu Yang’s happy voice rang by her ears, “You are finally here.”<br/><br/>Something soft inside Ling Ling was touched; she dropped her hands, allowing him to hold her, but her ears only grew hotter.<br/><br/>Soon, Gu Yang released her and asked, “What are these?”<br/><br/>Ling Ling looked at him for a while, noticing no anomalies in his expression. A hint of disappointment settled in her heart as she said softly, “Ten thousand pieces of gold.”<br/><br/>Only then did Gu Yang remember the agreement he had with her. He had given up all his abilities to her, and in exchange, she was supposed to provide him one million silver pieces.<br/><br/>Later, there was a slight unexpected incident, and she only managed to get a hold of one hundred and ten thousand, putting the rest on credit.<br/><br/>Unexpectedly, after coming out of seclusion, she immediately worked on finding the money.<br/><br/>Ten thousand pieces of gold, the exact equivalent of one million silver pieces.<br/><br/>As expected, she keeps her promises.<br/><br/>What Gu Yang admired most was indeed this trait of hers.<br/><br/>PS: Third update, seeking monthly ticket support.\t\t\t\t\t\t</div>", "images": {}, "success": true}