{"id": 137, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310334.html", "title": "Chapter 137 - Chapter 137: Caught In Adultery", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 137 - Chapter 137: Caught In Adultery</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 137: Caught in Adultery<br/><br/>Translator: 549690339<br/><br/>Jingzhou City was bustling, the streets were filled with carriages and pedestrians, everyone bustling about, making for a lively scene.<br/><br/>In Wu Xingyun’s memories, the city seven years ago wasn’t half as prosperous as it is now. However, he still found traces of the old days thanks to some familiar buildings and shops along the way.<br/><br/>Soon, he left the city and headed for a mountain outside the city.<br/><br/>Carrying a basket filled with incense paper and candles, he walked towards a location he remembered.<br/><br/>Before long, he found a stone staircase and ascended it. The once desolate mountaintop had completely transformed and was obviously well maintained now.<br/><br/>A hint of cold mockery crossed Wu Xingyun’s face as he had some sense of what had happened.<br/><br/>Soon, he had arrived at a grave.<br/><br/>However, it was completely different from when he had last left. The grave had been renovated. It was completely built according to the standards of a prince’s grave.<br/><br/>The tombstone read: The grave of Lady Zhang, the wife of the Prince of Jinghai.<br/><br/>This was indeed the grave of his mother.<br/><br/>“Who goes there?”<br/><br/>All of a sudden, someone noticed him. After an initial yell, the voice was filled with excitement. “Yo…Young Master! Is it really you?”<br/><br/>Wu Xingyun turned his head and recognized the old man. With a hint of pleasant surprise, he asked, “Jin Bo? What are you doing here?”<br/><br/>Jin Bo was a gardener in the mansion who had watched him grow up since he was a child. His mother had immense respect for this old man because he had once saved her life.<br/><br/>“Young Master, you’ve finally returned,” Jin Bo said, overcome with emotion as he tightly grasped Wu Xingyun’s hand, unwilling to let it go.<br/><br/>Seven years had passed and the two of them had a lot to catch up on.<br/><br/>Wu Xingyun first went to pay his respects to his mother’s grave before heading to a thatched cottage not far away.<br/><br/>Surprised, Wu Xingyun asked, “Jin Bo, do you live here?”<br/><br/>The old man said, “I have no children, and I’m old. I didn’t want to bother others, so I built this hut here to guard Madam’s grave.”<br/><br/>“Jin Bo…”<br/><br/>“Young Master, there’s something I must tell you.”<br/><br/>Jin Bo’s expression turned serious, “In truth, you’ve been misunderstanding the prince all these years.”<br/><br/>Spring Peach returned to the Princess’s chamber with her mind in turmoil.<br/><br/>She dared not tell Gu Yang the truth, yet she also couldn’t refuse his request to forward a message.<br/><br/>What if she refused, and Young Master Gu went directly to the madam? The situation would be even more difficult to clean up.<br/><br/>Left in a dilemma, she didn’t know what to do.<br/><br/>Fortunately, the princess stayed in the Sword Pavilion all day and only came out when it was almost dark.<br/><br/>So preoccupied was Spring Peach with her concerns, she did not notice that the princess was not holding her usual Star Jade Sword; it was a different sword.<br/><br/>Not until dinner did Spring Peach’s absentmindedness cause her to accidentally drop a bowl – something that had never happened before.<br/><br/>Pei Qianlan, who was still absorbed in the intricate details of the Spirit Rhinoceros Sword Method, finally noticed something was off and asked curiously, “Spring Peach, what’s the matter with you today?”<br/><br/>“No… nothing.”<br/><br/>Seeing her behaving like this, Pei Qianlan knew something was up and put down her bowl, “Just say it, what’s going on?”<br/><br/>“It’s… Prince returning, I was joyful…”<br/><br/>“Liar!”<br/><br/>Seeing that she couldn’t hide it anymore, Spring Peach confessed, “It’s… It’s Young Master Gu…”<br/><br/>“What happened to him?” Pei Qianlan asked anxiously.<br/><br/>“He… He wants to arrange a meeting with the madam…”<br/><br/>Pei Qianlan was rendered speechless.<br/><br/>After a while, seeing that she hadn’t reacted, Spring Peach cautiously reminded her, “The prince has already returned to the mansion.”<br/><br/>Long after, Pei Qianlan faintly said, “I know.”<br/><br/>Seeing her like this, Spring Peach felt heartbroken but could do nothing.<br/><br/>All she could say was, life sure plays tricks.<br/><br/>Meanwhile, in the crown prince’s chamber.<br/><br/>The Prince of Jinghai had been inside for most of the day.<br/><br/>The others were waiting outside in anxiety.<br/><br/>All of a sudden, a maid came. Mo Feiyan recognized her as one of her own and saw her gesturing secretively. She knew there must be something important and walked out to listen.<br/><br/>After the maid whispered a few words in her ear, Mo Feiyan’s eyes lit up, “Really?”<br/><br/>“Absolutely,” the maid affirmed.<br/><br/>“Good, keep a close watch…”<br/><br/>Mo Feiyan made arrangements quickly, full of excitement.<br/><br/>In no time, she came back to the entrance of the chamber, patiently waiting for an opportunity.<br/><br/>Night fell.<br/><br/>After dinner, Pei Qianlan returned to her room and requested not to be disturbed.<br/><br/>Soon after, however, Spring Peach realized something was amiss. She approached the door and knocked, “Madam?”<br/><br/>She called several times, but there was no response.<br/><br/>Oh no!<br/><br/>A chill ran down Spring Peach’s spine – she had a bad feeling about this.<br/><br/>The madam had gone to her secret meeting, even keeping her in the dark.<br/><br/>On a dark and windy night like this, a man and a woman alone together…<br/><br/>If anything were to happen, the consequences would be unthinkable.<br/><br/>If His Highness were not around, that would be one thing; she could somehow cover it up.<br/><br/>But this was happening right under His Highness’s watchful eyes…<br/><br/>They were all mad!<br/><br/>Spring Peach was frantic with worry but dared not alarm others.<br/><br/>She stomped her foot angrily and found an excuse to have people keep a watch here. Then she hurriedly left, her only hope now was that the madam could stop herself in time. Otherwise, not only would she damage her own reputation, but also Gu Yang’s, and even His Highness would lose face.<br/><br/>“Madam, you must control yourself…”<br/><br/>Outside the Jing Sea Mansion, in a narrow alley lay an empty mansion.<br/><br/>Gu Yang didn’t know who owned it, but he was just temporarily using it, the owner probably wouldn’t mind.<br/><br/>He stood in the courtyard with his hands behind his back, staring up at the bright moon in the sky, considering his next move.<br/><br/>The root of the problem was still money.<br/><br/>His need for wealth was growing, with expenditures running into the millions. There were already very few individuals or powers that could produce such sums.<br/><br/>Unless he resorted to extreme methods, like raiding the homes of all the rich merchants in Jingzhou City, that would solve all problems.<br/><br/>Unfortunately, even if he had the ruthlessness to do that, the King of Jing Sea wouldn’t allow it.<br/><br/>Moreover, there was a Sword Saint in the city. He couldn’t beat him in a short amount of time.<br/><br/>So, this plan couldn’t proceed.<br/><br/>As for other places, he wouldn’t think about them for now. Once he left Jingzhou, the head of the Shen Family would come looking for trouble.<br/><br/>He couldn’t help but sigh, “Alas, making money is getting harder and harder.”<br/><br/>It seems that he still needed to apply the scientific knowledge he had learned on Earth…<br/><br/>As Gu Yang was contemplating, he saw a figure float into the courtyard from outside. The ethereal bearing, overwhelmingly beautiful, like a fairy under the moonlight.<br/><br/>It was Pei Qianlan. Her face was veiled, and she wore a light green long dress. As she landed, she took off her veil, revealing a flawless face.<br/><br/>A trace of apprehension flickered in her eyes, adding a few hints of charm.<br/><br/>Ever since Gu Yang left Lian Mountain, he had never lacked beauties. He had encountered several stunning women from the Beauty List, and Su Qingzhen and Xu Ruomei were always in his sight, raising his aesthetic threshold.<br/><br/>Seeing the woman in front of him now, his heart sped up a bit.<br/><br/>She was different from Su Qingzhen. She carried a mature charm, which only a mature woman could omit.<br/><br/>She should be a few years older than Qingzhen, at least in her twenties.<br/><br/>Gu Yang had a sudden thought: at that age, was she already married?<br/><br/>At this moment, Pei Qianlan spoke, “Why did you arrange to meet so late at night, Master Gu? What’s the matter?”<br/><br/>“Oh.”<br/><br/>Gu Yang snapped out of his thoughts and turned to the matter at hand, “I have a question for you.”<br/><br/>A sense of relief washed over Pei Qianlan, interspersed with a hint of disappointment. She asked, “What is it?”<br/><br/>“Why did Wu Xingyun leave home back then? Do you know what’s the inside story?”<br/><br/>Pei Qianlan’s face changed instantly.<br/><br/>Of course she knew.<br/><br/>Some might even say that she was the reason for Wu Xingyun’s fallout with His Highness.<br/><br/>Seeing her reaction, Gu Yang thought, could it be related to her?<br/><br/>Just as he was about to speak, his brows furrowed.<br/><br/>A shadow flew over the wall. It was Spring Peach. Seeing both of them standing in the courtyard, fully clothed, she heaved a sigh of relief. Thankfully, she arrived in time.<br/><br/>“Miss, it’s time to go back. The prince is awake. You should go see him,” she said. She had heard that the prince was awake when she just came out and felt even more anxious. After several days of unconsciousness, the prince was finally awake. If the princess didn’t visit him immediately, it may arouse suspicion.<br/><br/>Just then, several shadows leaped over the wall.<br/><br/>The one in the lead was a woman, a triumphant smirk plastered on her face. “Madam, what brings you sneaking around here? Oh, Master Gu is here, too,” she said loudly. “Are you two… having a secret rendezvous?”<br/><br/>Her voice was so loud that it carried far and wide, clearly intending to create a scene.<br/><br/>Spring Peach’s face turned pale, she was horrified, regretting, she had guessed that Mo Feiyan and the others must have followed her here.<br/><br/>Things were done for now!<br/><br/>PS: Second update, seeking monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}