{"id": 134, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310325.html", "title": "Chapter 134 - Chapter 134: 134 Rhinoceros Sword", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 134 - Chapter 134: 134 Rhinoceros Sword</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 134: 134 Rhinoceros Sword<br/><br/>Translator: 549690339<br/><br/>Boom!<br/><br/>Above the Jinghai Prince’s Mansion, suddenly a bolt of lightning shattered the black night, agitating a crackle of thunder that awakened many from their sleep.<br/><br/>Afterwards, several streaks of lightning crossed, illuminating the exterior as if it were daytime.<br/><br/>In the consort’s chamber, the already restless Pei Qianlan put on her dress and stood in front of the window. Watching multiple strikes of lightning strike down from the sky, she felt the goosebumps rise, instinctively feeling a sense of fear.<br/><br/>Suddenly, she noticed something amiss. The positions those bolts of lightning hit, wasn’t that Chun Song Courtyard?<br/><br/>He’s not in danger, is he?<br/><br/>Should she go and look?<br/><br/>However, the guards outside …<br/><br/>At that moment, Pei Qianlan’s mind was buzzing with thoughts, all knotted up with worry.<br/><br/>Outside Jingzhou City, on a mountain, a master and disciple were spending the night in a rundown temple within the mountains.<br/><br/>With the first crash of thunder, Gao Fan suddenly awoke. Standing up, he looked in the direction of Jingzhou City, his expression somewhat shocked. “Is this… someone is attempting to break through to the Divine Power Realm?”<br/><br/>This kind of lightning, gave him a strong sense of familiarity. It was clearly a celestial change caused by attempting to break through to the Divine Power Realm.<br/><br/>“No, the disturbance is too small.”<br/><br/>Mumbling to himself, Gao Fan’s eyebrows furrowed even further.<br/><br/>If there truly was someone in Jingzhou City attempting to break through to the Divine Power Realm, the commotion wouldn’t be this small; the range of heavenly thunder, would at least be ten times larger.<br/><br/>So, what’s happening?<br/><br/>He was left in bewilderment.<br/><br/>“Master, what’s wrong?”<br/><br/>Feng Tianci, who had also been woken up by the noise, walked over while rubbing his eyes and asked.<br/><br/>Gao Fan shook his head without saying a word.<br/><br/>Following his gaze, Feng Tianci noticed some flashes of lightning and commented, “There is thunder; could it be about to rain?”<br/><br/>He was a bit worried because they hadn’t brought an umbrella, which would certainly delay their journey. If they were delayed on the road, even the money set aside for their return trip would not be enough.<br/><br/>Soon, he noticed something was amiss and said in surprise, “Eh, why are there no clouds?”<br/><br/>Although there was lightning in the sky, he couldn’t see any dark clouds.<br/><br/>This was indeed peculiar.<br/><br/>…<br/><br/>Inside Jingzhou City, in a small courtyard, a somewhat haggard figure appeared under the eaves, silently watching the lightning in the sky.<br/><br/>Under the illumination of the lightning, one could see the black scar on his face, extending all the way down his neck. Swirling around it was a dark energy, almost like a living entity.<br/><br/>“Gu Yang…”<br/><br/>Faintly, as if one was muttering to oneself, it was unclear whether it was a question or an exclamation.<br/><br/>Meanwhile, hundreds of miles away, in a rarely visited valley, thick, sticky black smoke enveloped the valley’s surroundings.<br/><br/>Suddenly, the valley shook a bit, and a shadow emerged from the black smoke. Clearly a human silhouette, it looked towards Jingzhou City, sniffed a bit.<br/><br/>“Divine Power? This seems off, strange…”<br/><br/>The black smoke churned a few times, then quickly quieted down. Apparently, after judging it wasn’t a Divine Power Realm, it lost interest.<br/><br/>…<br/><br/>Finally, the lightning nestled in the sky above Jinghai Prince’s Mansion dispersed, restoring tranquility.<br/><br/>Inside Chun Song Courtyard, Gu Yang finished his transformation, opening his eyes to behold a world that seemed to change entirely.<br/><br/>He felt as though he had gained an additional pair of “eyes,” capable of seeing the distribution and flow of Vitality between heaven and earth, an entirely distinct point of view.<br/><br/>Through this perspective, walls and other objects no longer presented any obstacle.<br/><br/>Clearly, the light-yellow form standing outside the door was undoubtedly Zhang Xiao Hai.<br/><br/>Further away, there were five close-to-red human forms, the patrolling mansion guards.<br/><br/>Even further, at a distance, were two brightly glowing red human forms; undoubtedly the two First Rank Martial Artists of the mansion, Xiao Yue and Deng Ziyuan.<br/><br/>With such perspective, Gu Yang could overlook all the inhabitants of the mansion. He could even judge people’s Cultivation Level through the color and brightness of their Vitality.<br/><br/>Now it finally had the flavor of cultivating the path of immortality.<br/><br/>“This truly is a world of cultivators. Did they think they could fool me by simply adopting the skin of martial arts?”<br/><br/>After a while, he began to feel tired, understanding that using this perspective would consume his own spirit, so he switched his perspective back to normal.<br/><br/>At this moment, a knock sounded from outside, and Zhang Xiao Hai’s voice asked, “Young Master, is everything okay?”<br/><br/>“What’s wrong?”<br/><br/>“The princess’s side has sent someone to inquire. They were worried that the heavenly thunder has startled the young master.”<br/><br/>“Tell them, I’m okay.”<br/><br/>“Yes.”<br/><br/>Zhang Xiao Hai replied and then did not disturb any further.<br/><br/>Gu Yang sat and began revolving energy within the body.<br/><br/>“I have already formed a primordial body, and yet I am still not at the peak of the first rank.”<br/><br/>He found the “Phoenix Dance Nine Heavens” technique to be increasingly peculiar.<br/><br/>While cultivating and using introspection, he finally discovered something.<br/><br/>Most of the vitality from heaven and earth, which he drew within himself and transformed into True Essence, completely disappeared without a trace while revolving Qi.<br/><br/>In the end, only one-tenth of the True Essence remained.<br/><br/>This discovery greatly shocked him.<br/><br/>No wonder cultivating this technique was so unusually slow—there was such a huge pitfall.<br/><br/>Through the storms over the past few months, Gu Yang, though shocked, was not panicked. He quickly regained his composure.<br/><br/>The pressing matter was to figure out where those disappearing True Essence went.<br/><br/>He took a deep breath, closed his eyes, and began repeatedly revolving Qi.<br/><br/>Eventually, he discovered the culprit that had been siphoning his True Essence.<br/><br/>It was the flaming phoenix in his consciousness, the manifestation of his own Martial Will.<br/><br/>Gu Yang’s eyes held an ominous glow, “So, it means that each time I am reborn, the True Essence is absorbed by you?”<br/><br/>In his consciousness, the phoenix, drenched in flames, continued to majestically soar.<br/><br/>At last, he could only sigh.<br/><br/>This creature was a manifestation of his Martial Will. Essentially, they were one entity.<br/><br/>He couldn’t possibly discard it, as that would be akin to suicide.<br/><br/>“I hope that when I enter the Divine Power Realm, you will display your worth.”<br/><br/>Upon entering the Divine Power Realm, Martial Will transforms into a Divine Power Seed.<br/><br/>After achieving Divine Power, martial artists could then master a Divine Power, the source of which was the Divine Power Seed.<br/><br/>Generally speaking, the stronger the Martial Will cultivated at the first rank, the more powerful the Divine Power brokered in the Divine Power Realm would be.<br/><br/>Gu Yang’s Martial Will had absorbed so much True Essence—who knew what kind of Divine Power he would awaken when he entered the Divine Power Realm.<br/><br/>At present, he still had 1.1 million in balance, enough for two simulations.<br/><br/>However, he didn’t continue, opting to save some money for emergencies.<br/><br/>He felt that even if he utilized these two simulations, he most likely would not reach the peak of the first rank.<br/><br/>The strength he currently possessed should be sufficient to deal with Shen Ao.<br/><br/>Gu Yang placed the Phoenix Feather Knife on his lap, preparing himself for the impending battle.<br/><br/>Inside the Princess’s sleeping quarters.<br/><br/>Pei Qianlan stood by the window, gazing in the direction of Chun Song Courtyard, her features shadowed by an indelible worry.<br/><br/>Spring Peach walked forward and whispered, “Ma’am, I’ve sent someone to inquire at Chun Song Courtyard—Master Gu is safe and sound.”<br/><br/>Pei Qianlan relaxed, wanted to speak, but didn’t know what to say.<br/><br/>Spring Peach added, “Ma’am, it’s windy by the window. Let’s go inside.”<br/><br/>Pei Qianlan shook her head, “Let’s go to the Sword Pavilion.”<br/><br/>Every time her mood was troubled, she would go to the Sword Pavilion to look at the famous swords she had collected. This released some of her pent-up feelings.<br/><br/>The so-called Sword Pavilion was located behind the sleeping quarters—her place for storing swords.<br/><br/>Over the years, as her reputation as a sword fanatic spread, those who wished to ingratiate themselves with the Jinghai Royal Residence would take great pains to find some famous swords to gift her.<br/><br/>The small Sword Pavilion now held over ten swords, all prestigious weapons including some from deceased Divine Power Realm experts.<br/><br/>Spring Peach did not follow her in; the princess never allowed anyone inside the Sword Pavilion—not even her.<br/><br/>This was Pei Qianlan’s private domain.<br/><br/>As she looked at the ten-plus swords displayed in the room and with her heart in turmoil, she casually picked up a sword and began to clean it with a handkerchief.<br/><br/>Like usual, she cleaned each sword, but her mood didn’t calm down. It got even more chaotic.<br/><br/>When she picked up the last sword to clean, it suddenly hummed and started to vibrate slightly.<br/><br/>Pei Qianlan was startled, and then, the sword in her hand vibrated more violently and suddenly burst forth with a dazzling radiance.<br/><br/>The next moment, she felt an attack of terrifying sword intent that blanked her mind.<br/><br/>After an unknown amount of time, Pei Qianlan finally regained consciousness. Staring at the completely altered sword in her hand, she was utterly shocked.<br/><br/>“Is this a legendary divine weapon?”<br/><br/>This sword, which she had found in the royal residence’s arsenal, had been a well-made weapon, just a little ordinary in appearance. She liked it, so she moved it into the Sword Pavilion.<br/><br/>Now, it had finally revealed its dazzling, legendary glory.<br/><br/>Pei Qianlan had never imagined that this was a legendary divine weapon nesting an exceptional inheritance—the Spirit Rhinoceros Sword Method.<br/><br/>Under the tempering of this sword intent, she had stepped into the first-rank Cultivation Level in one fell swoop.<br/><br/>PS: The second update asking for monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}