{"id": 133, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310322.html", "title": "Chapter 133 - Chapter 133: 133 Innate Physique", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 133 - Chapter 133: 133 Innate Physique</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 133: 133 Innate Physique<br/><br/>Translator: 549690339<br/><br/>That day, Gu Yang held a banquet in the courtyard to welcome Ling Ling’s return.<br/><br/>Only the two of them were present at the banquet, and Zhang Xiao Hai tactfully did not come to disturb them.<br/><br/>Ling Ling picked up her wine cup, toasted him, seeming to have made some kind of decision, and said, “There is something, I need to tell you.”<br/><br/>By this time, it was evening, and candles were lit in the room. Under the glow of the candles, her eyes seemed filled with brilliant starlight.<br/><br/>Gu Yang put down his wine glass, “Go ahead.”<br/><br/>“Actually, my last name is not Ling.”<br/><br/>Ling Ling said quietly, “My real last name is Wu. I had to change my name to avoid attention.”<br/><br/>Gu Yang laughed, “So, you should be Wu Lingling, ranked fifth on the Beauty List, the one known for her heavenly beauty.”<br/><br/>Ling Ling, no, Wu Lingling, noticing that he seemed not surprised at all, paused, “You, did you already know?”<br/><br/>“Actually, it wasn’t hard to guess.”<br/><br/>Gu Yang certainly wouldn’t admit that he learned about her origin during a simulation.<br/><br/>Once he knew she came from the Wu Family, and there happened to be a Wu Lingling on the Beauty List, it was naturally easy to put the pieces together.<br/><br/>She was too honest. Even when changing her name, she didn’t do it thoroughly enough.<br/><br/>However, Gu Yang was somewhat curious, “Your current appearance, it’s been altered, right?”<br/><br/>Ling Ling nodded, pulling out a pendant from her collar. It was a round bead about the size of a fingernail, emitting a faint purple glow, “This is an Illusion Spirit Bead, it can change one’s appearance. Even someone in the Divine Power Realm can’t see through it.”<br/><br/>Then she explained, “An Illusion Spirit Bead can only be used once. Once it’s removed, it will lose its effect forever…”<br/><br/>Meaning that she can’t show him her true face yet. It wasn’t time for her to reveal her identity publicly.<br/><br/>Gu Yang expressed understanding, “No problem, there will be chances in the future.”<br/><br/>He asked again, “Should I call you Wu Lingling or Ling Ling?”<br/><br/>Ling Ling’s eyes were full of emotion, she softly replied, “In front of you, I am always Ling Ling.”<br/><br/>Hearing this, Gu Yang realized that she meant their relationship wouldn’t change even if her identity did.<br/><br/>He picked up his wine glass and filled hers.<br/><br/>As Ling Ling picked up her wine glass and drank it all in one gulp, she could feel the burning sensation and a trace of bitterness. She said, “From now on, I can’t always be by your side.”<br/><br/>Gu Yang was slightly taken aback.<br/><br/>“My name, Wu Lingling, has shown up on the Hidden Dragon List.”<br/><br/>He understood immediately.<br/><br/>The enemies of the Wu Family from the past would definitely not sit idly by when they see an heir of the Wu Family on the Hidden Dragon List. They will surely send people to eliminate the threat.<br/><br/>Her enemies were not ordinary people.<br/><br/>His current reputation was too high. Every move he made was under the watchful eyes of the public. If Ling Ling stayed by his side, she would easily be exposed, which was not beneficial to either him or her.<br/><br/>The banquet that was originally meant to welcome her had turned into a farewell feast.<br/><br/>A sense of melancholy emerged in Gu Yang’s heart.<br/><br/>That night, Ling Ling left.<br/><br/>Gu Yang did not try to keep her. He knew that if he spoke, she would stay.<br/><br/>However, there is no goodbye-less feast in life.<br/><br/>Even with Su Qingzhen , the one who had the closest relationship with him, it might be possible to part ways due to certain changes.<br/><br/>Life is unpredictable. Big sausage wrap… Ah, shoot!<br/><br/>Gu Yang shook his head, discarding all the unruly thoughts, and first loaded the 10,000 gold pieces Ling Ling had brought into the system.<br/><br/>Suddenly, the system balance became 560,000.<br/><br/>[Do you want to use the Life Simulator? Use it once, consume 500,000 gold.]<br/><br/>Finally, there were no disturbances this time.<br/><br/>“Yes.”<br/><br/>[At the age of 22, you are already of First Rank cultivation. After defeating Yi Yi, your fame has spread throughout the world.]<br/><br/>[You foiled the plot of the Red Venerate in the Jingzhou royal palace, saving the princess and the prince and were regarded as a benefactor by the royal court.]<br/><br/>[Several days later, the king of Jingzhou returned to the palace, and Shen Ao from the Shen Family came to reclaim the Divine Technique “Phoenix Dance Nine Heavens”. At the critical moment, the king appeared and injured him severely.]<br/><br/>[Soon, the king of Jingzhou stepped into the Divine Power Realm with the help of the Divine Sword. You stayed in the palace and focused on cultivation.]<br/><br/>[A year later, a practitioner from the Shen Family rushed to Jingzhou City, a Sword Saint appeared in the city and frightened him off.]<br/><br/>[Another year, you and the king of Jingzhou set out on a campaign, flattening Dragon Gate Island and occupying the Dragon Washing Pond on the island.]<br/><br/>[Jinghai King gives you the Dragon Washing Pond, enabling you to train in this blessed land and dramatically improve your physique.]<br/><br/>[Ten months later, you break through and emerge. With Su Qingzhen and others, you head towards the Secret Realm on Tianzhu Mountain.]<br/><br/>[Twenty-eight years later, a celestial war breaks out, destroying the entrance of the Secret Realm…]<br/><br/>[You are killed by a Mana Realm follower of Wanxiang Gate, aged fifty-three.]<br/><br/>After reading this, Gu Yang breathed a sigh of relief.<br/><br/>Thankfully, Jinghai King was strong enough to withstand the Shen Family.<br/><br/>Indeed, it’s always a good idea to lean on the mighty for support while cultivating.<br/><br/>Moreover, a Sword Saint had been living with anonymity in Jingzhou City. The same one who had guided his sword technique during the previous simulation. He must be a Divine Power Realm professional.<br/><br/>Unbelievably, that turned out to be a Sword Saint.<br/><br/>According to Gao Fan, a Sword Saint achieves sainthood due to their unmatched battle prowess. Below the Unleaking Realm, none can withstand their might.<br/><br/>Except for that old monster of the Shen Family, the rest of the Divine Power Realm professionals wouldn’t stand a chance against this Sword Saint.<br/><br/>The appointment of Jinghai King as a non-royal king seems justified, considering the support of a Sword Saint.<br/><br/>Gu Yang survived the hunting of the Shen Family by riding on Jinghai King’s momentum. Once the storm had passed, he hid in the Secret Realm of Tianzhu Mountain, unreachable to all. Perfect.<br/><br/>[Simulation over. You can keep one of the following items.]<br/><br/>“I choose the first one.”<br/><br/>Gu Yang once again experienced the agony of having his marrow washed, but it was much lighter than the previous time, not that unbearable.<br/><br/>A moment later, he was soaking wet but there was a satisfied smile on his face.<br/><br/>This simulation yielded a vast harvest.<br/><br/>He could feel a significant improvement in his physique. The Dragon Washing Pond proved to be a real treasure, as it greatly benefits physical cultivation.<br/><br/>Moreover, his True Essence increased by nearly 20%.<br/><br/>One simulation had allowed him to make another leap forward in his strength.<br/><br/>If he met the Saint of Red Venerate now, he wouldn’t let him escape again.<br/><br/>With determination in his eyes, Gu Yang said, “Again!”<br/><br/>Since he found the most fruitful path, his mission was to repeat it continuously.<br/><br/>After numerous simulations, Gu Yang’s physique kept getting stronger; though the rate of improvement was getting smaller, when accumulated, the overall improvement was substantial.<br/><br/>Until the ninth simulation.<br/><br/>[…ten months later, you developed an innate body.]<br/><br/>[You break through and go to the Secret Realm of Tianzhu Mountain. In twenty-eight years, you accumulate an innate Qi.]<br/><br/>[…Using that innate Qi, you resist the attack of a Mana Realm powerhouse… You die at the age of fifty-three.]<br/><br/>An innate body?<br/><br/>Gu Yang noticed a change in this simulation. He developed something called an innate body.<br/><br/>The name alone suggested it was no ordinary thing, but there was no one to ask right now.<br/><br/>Honestly, his physique had been improving with every simulation. By the eighth time, he felt like a superhero.<br/><br/>Just with the power of his physical body, without using his True Essence, he could thrash some of the weaker First Rank individuals.<br/><br/>Now, he had developed an innate body.<br/><br/>This seemed like a qualitative change resulting from quantitative changes.<br/><br/>Besides, that innate Qi was capable of resisting an attack from a Mana Realm practitioner!<br/><br/>This was absurd because that was a Mana Realm professional, the first level in the Divine Power Realm following the Golden Body level.<br/><br/>Regrettably, he used up that innate Qi during the simulation.<br/><br/>It pained him to think how wasteful it was. Had he preserved it, he would have had a huge hidden strength.<br/><br/>[Simulation over. You can keep one of the following items.]<br/><br/>[One, martial arts realm at fifty-three.]<br/><br/>[Two, martial arts experience at fifty-three.]<br/><br/>[Three, life wisdom at fifty-three.]<br/><br/>“I choose the first one.”<br/><br/>PS: The first update request for monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}