{"id": 139, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310340.html", "title": "Chapter 139 - Chapter 139: 139 Taiyou Moon Devouring Technique", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 139 - Chapter 139: 139 Taiyou Moon Devouring Technique</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 139: 139 Taiyou Moon Devouring Technique<br/><br/>Translator: 549690339<br/><br/>When Gu Yang found himself plunged into darkness, he did not panic. Soon, his hearing was also stripped from him, making him as if a deaf and blind man, yet his expression remained calm, utterly unflustered.<br/><br/>Gao Fan had mentioned that the Shen Family had a unique and mystical technique passed down—The Taiyou Moon Devouring Technique. This technique had the ability to create an environment of sheer darkness, stripping enemies of their sight and hearing.<br/><br/>Those from the Shen Family who practiced this technique could blend into the darkness, making it impossible to pinpoint their locations.<br/><br/>Especially during nighttime, it was essentially their home turf. They could strike or retreat at will, making it extremely hard to deal with.<br/><br/>If Gu Yang had faced Shen Ao before yesterday, he would have found it quite troublesome.<br/><br/>But now<br/><br/>He just changed his perspective, and he could “see” Shen Ao’s location.<br/><br/>The energy within this man’s body was starkly different from all those he had met, shockingly black in color. This was certainly no ordinary technique he cultivated with.<br/><br/>Just as Gu Yang prepared to make his move and surprise Shen Ao, a burst of white energy exploded from the side. It was Pei Qianlan.<br/><br/>He was taken aback, “What is she doing? Is she seeking death?”<br/><br/>She had only just broken through to First Rank, her strength not even on par with the First Rank guards in the palace. Yet she was now displaying a power ten times stronger than her own, evidently using a forbidden technique that supposedly drained one’s life-force.<br/><br/>Can’t be serious, right?<br/><br/>The target is me, not you.<br/><br/>Gu Yang really couldn’t understand why she was so desperate.<br/><br/>In the darkness, a radiant sword light shone brightly, then faded in the blink of an eye, akin to a transient blossom.<br/><br/>“Escape quickly!”<br/><br/>In that split second, Gu Yang thought he could hear her shout. Then, the world turned silent again.<br/><br/>He watched as her life force dimmed, his heart slightly moved.<br/><br/>Turns out, she was trying to save him!<br/><br/>This was the first time Gu Yang came across such a resolute person, who after being saved by him, was willing to stake her life to repay the favor.<br/><br/>He looked in Shen Ao’s direction, a thick killing intent flashing in his eyes.<br/><br/>“Darkness engulfs all light!”<br/><br/>Shen Ao was extremely cunning. Even when facing one who had just broken through to the First Rank, he would be relentless, attacking with all his might, holding nothing back.<br/><br/>After all, this area belonged to Jinghai Princess. A swift battle was needed to prevent unforeseen circumstances.<br/><br/>He exerted his power to absorb all light around him, creating a dark domain, and sealed off everyone’s hearing with his Martial Arts. He was preparing to strike Gu Yang.<br/><br/>The woman risked her life with a sword strike and actually made a crack in his created darkness.<br/><br/>“What kind of sword technique is this?”<br/><br/>Shen Ao had traveled across the world in his youth and witnessed the martial arts of various sects and powers, but he had never seen the sword technique of the Jinghai Princess.<br/><br/>This ability to break through his created darkness was far from ordinary. If she were at the peak of First Rank, she would certainly be a formidable opponent for him.<br/><br/>Just as a killing intent surged within Shen Ao, a violent wind attacked him.<br/><br/>A punch was heading straight towards his chest.<br/><br/>It was Gu Yang!<br/><br/>Shen Ao had no idea when he had gotten so close.<br/><br/>Shen Ao was surprised, yet he was quick to react and shifted his position, reappearing ten meters away.<br/><br/>“How did he know my location?”<br/><br/>“It must be luck——”<br/><br/>The next moment, Gu Yang was charging at him again, punching accurately towards him in the same manner.<br/><br/>Shen Ao narrowed his eyes.<br/><br/>One could be a coincidence, yet accurately finding his location a second time was certainly not a coincidence anymore.<br/><br/>“He managed to see through my technique!”<br/><br/>Killing intent surged in Shen Ao’s heart.<br/><br/>The ability to create absolute darkness and to merge his body into the darkness, these were the foundations on which he based his domination. If someone were to break it, he would lose half his strength.<br/><br/>“This man must die!”<br/><br/>Now, for him, killing Gu Yang had become more important than reclaiming his technique.<br/><br/>This time, Shen Ao did not dodge. He mobilized all True Essence in his body and punched towards him, planning to kill Gu Yang on the spot with absolute power.<br/><br/>Though the Taiyou Moon Devouring Technique was not renowned for its power, with his cultivation at the peak of First Rank, would it not be effortless to kill a rookie who had just broken through to the First Rank?<br/><br/>“Die!”<br/><br/>When Shen Ao made his move, he used Shen family’s secret technique, Star Shattering Fist.<br/><br/>Boom!<br/><br/>The two forces clashed head-on.<br/><br/>The killing intent on Shen Ao’s face instantly turned into shock.<br/><br/>He felt an irresistible force coming at him. With an unparalleled momentum, it shattered him instantly.<br/><br/>How—how is this possible?<br/><br/>This punch completely stunned him on the spot.<br/><br/>Wasn’t it said that this kid had just advanced to the First Rank?<br/><br/>Why is his True Essence so profound? Only slightly inferior to his own.<br/><br/>What’s more terrifying is the strength in his Mortal Body, so horrifying that he once thought he had run into a powerhouse in the Golden Body realm.<br/><br/>What kind of monster is this?<br/><br/>The punch, still full of momentum, landed squarely on Shen Ao’s chest, causing him to vomit blood on the spot.<br/><br/>If it weren’t for his ability to submerge himself in darkness and use his special techniques to deflect most of the punch’s power, he would have certainly been severely injured.<br/><br/>“Run!”<br/><br/>At this moment, Shen Ao has cursed the one in charge of the intelligence report in his heart and swore to give them a lesson once he gets back.<br/><br/>He even suspected that all of this was his nephew’s trap, aimed at killing him off.<br/><br/>Suddenly, another forceful punch came from behind.<br/><br/>“Impossible!”<br/><br/>Fear and trepidation filled his heart. At this moment, he was fully immersed in the darkness, moving three times faster than usual. How could he possibly be caught up with him?<br/><br/>There was no time to think anymore. He could only turn around and forcefully take the punch.<br/><br/>Bang!<br/><br/>Instantly, the terrifying force blasted him away, slamming him into the surrounding wall.<br/><br/>At this point, the darkness shrouding the entire courtyard dispersed. Silver moonlight danced from the sky, and the lanterns in the hands of Mo Feiyan’s subordinates slowly regained their flames.<br/><br/>Everyone at the scene regained their sight and hearing, each having the sense of surviving a calamity.<br/><br/>Being stripped of sight and hearing was too terrifying; one wouldn’t even know how they died in such a state.<br/><br/>While they were still shaken, they heard the sound of battle. Turning their heads, they saw two people battling it out.<br/><br/>Mo Feiyan only took one look, her gaze becoming vacant.<br/><br/>The fight in front of her didn’t resemble one between First Rank powerhouses at all but looked more like that of lower-level martial artists; every punch was landing on the flesh.<br/><br/>“Is that… Shen Ao?”<br/><br/>Mo Feiyan looked at the man in black clothes being beaten, vomiting blood and flying backward under Gu Yang’s fist, as helpless as a dying dog. Her mind buzzed.<br/><br/>That was Shen Ao, a renowned powerhouse of the Shen Family, a master who had once topped the First Rank leaderboard. In front of Gu Yang, he had no strength to fight back.<br/><br/>She glanced at Gu Yang’s murderous face and trembled. Suddenly, she felt a trace of regret.<br/><br/>Could they really afford to offend such a man who could beat a top powerhouse as if he were beating a dog?<br/><br/>She had personally experienced how terrifying Shen Ao’s strength was.<br/><br/>Now, Gu Yang, who had easily beaten Shen Ao to the brink of death, how strong would he be?<br/><br/>At this moment, Gu Yang walked over to the fallen Shen Ao, stepped down, and with a squelching sound, burst Shen Ao’s head.<br/><br/>Mo Feiyan watched, chilled to the bone, her hands and feet ice-cold.<br/><br/>A top powerhouse died right in front of her, as easily as child’s play.<br/><br/>Suddenly, Gu Yang turned his head to look at her, the chilling look in his eyes scaring her half out of her wits. She nearly collapsed on the spot.<br/><br/>However, Gu Yang did not attack her.<br/><br/>He walked over to Pei Qianlan, helping her up, put one hand on her back, and sent his True Essence into her body.<br/><br/>Pei Qianlan’s situation was pretty dire. Her True Essence was depleted, her vital energy seriously drained, and she was hanging on just by a thread.<br/><br/>Just then, a tall figure descended from the sky.<br/><br/>“Your Highness!”<br/><br/>Mo Feiyan saw the figure and cried out in relief as if she had seen her savior.<br/><br/>With him here, they would certainly be safe.<br/><br/>The person who came was indeed the Jinghai Prince. He had no expression on his face, waved his hand signaling Mo Feiyan and the others to leave.<br/><br/>Then, he walked straight over to Pei Qianlan, took out an Elixir and said to Spring Peach, “Feed her this.”<br/><br/>By now, Spring Peach had already cried herself into a mess. Upon hearing the command, she took the Elixir and stuffed it into Pei Qianlan’s mouth.<br/><br/>The elixir melted the moment it touched her tongue. After a short while, a slightly rosy hue returned to her pale face.<br/><br/>While Gu Yang’s hand was still on her back, he could clearly sense that she was no longer in danger, so he let go of her.<br/><br/>Jinghai Prince said to him, “Come with me.”<br/><br/>Gu Yang sighed inwardly, what had to come eventually would come.<br/><br/>PS: The first update is asking for votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}