{"id": 136, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310331.html", "title": "Chapter 136 - Chapter 136: You Are Too Brave, Aren’T You?", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 136 - Chapter 136: You Are Too Brave, Aren’T You?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 136: You are too brave, aren’t you?<br/><br/>Translator: 549690339<br/><br/>As soon as Pei Qianlan had just broken through to First Rank, Gu Yang noticed it. The changes in the earth’s vitality were too obvious, and he felt them without needing to pay attention closely.<br/><br/>Amidst it, an eccentric sword intent, filled with lingering sorrow, was also present.<br/><br/>“It’s the inheritance of a peerless technique!” exclaimed Gu Yang.<br/><br/>He was familiar with this kind of fluctuation, as he had received several peerless techniques himself and could immediately recognize it.<br/><br/>In the simulation he underwent, when he inherited the “Ice Soul Profound Ray Sword”, he had felt the same kind of sword intent.<br/><br/>However, this sword intent completely differed from the “Ice Soul Profound Ray Sword”.<br/><br/>“It’s actually her.”<br/><br/>Gu Yang recognized the one who had inherited the sword intent and broke through to the First Rank. It was the one he had saved twice… Who was it again?<br/><br/>It then dawned on him that he had forgotten to ask her name.<br/><br/>Since she was the princess, he decided to call her Lady of the County for the time being.<br/><br/>Why did she happen to inherit a legacy that could dramatically increase her cultivation level and directly break through the realm?<br/><br/>“Why am I not so fortunate?” Gu Yang questioned.<br/><br/>Gu Yang seriously suspected that the Jinghai King’s ancestors must have been buried in a feng shui treasure land. The fortune of his entire family was astonishingly good.<br/><br/>The Jinghai King himself rose from humble beginnings to become the first King of Great Zhou with a different surname, an inspiring journey.<br/><br/>His two sons, one was a martial arts genius and the other casually pulled out a divine sword which even those in the Divine Power realm couldn’t. Even his daughter got an inheritance and directly entered the First Rank realm.<br/><br/>Compared to this family, his own experiences were truly miserable.<br/><br/>Meanwhile, about a hundred miles away from Jingzhou, on a hilltop, two figures stood hundreds of meters apart, locked in a standoff.<br/><br/>One of them was extremely tall, wearing silver armor and holding a giant sword which shimmered under the moonlight. His mere presence was intimidating.<br/><br/>He spoke in a deep voice, “Lei Hao, you’re just a False Gold Body, it’s enough to deal with other First Ranks, but in front of me you are nothing.”<br/><br/>This man was the world-famous Jinghai King, the top on the First Rank list.<br/><br/>On the opposite side was a man enveloped in lightning, with messy hair, a bare upper body, holding a purple hammer in his hand, and his eyes glowing purple. He was a horrifying sight.<br/><br/>This man was the island’s Lei Hao.<br/><br/>He grunted, “Hmph, Wu Tianqi, you’re only relying on your dragon power. Wait for a few years, when my realm is stable, I will personally cut you down in revenge for killing my father.”<br/><br/>Jinghai King countered, “Don’t assume that I don’t know, you used the Dragon Washing Pond to forcibly build a Gold Body. But if your foundation is not solid, it’s all in vain. You can’t even defeat a First Rank like me, yet you dare to claim yourself as a Divine Power Realm? It’s truly ridiculous.”<br/><br/>Lei Hao, with wounded pride, retorted, “Wu Tianqi, let’s see if you’re still this smug when you return to Jingzhou City. I’ll take some interest now, and settle the rest in three years.”<br/><br/>After saying this, the lightning around him flashed and he flew up into the sky and disappeared.<br/><br/>The Jinghai King watched him leave without hesitation and felt a sinking feeling in his heart.<br/><br/>Days ago, he received an urgent message from Jingzhou City stating that something had happened in the palace. He immediately left to return, but bumped into Lei Hao halfway.<br/><br/>They had been fighting on and off for days without making any progress.<br/><br/>Lei Hao seemed to intentionally hold him up.<br/><br/>With several days passed, what’s the situation in the palace?<br/><br/>He dared not think about it.<br/><br/>Logically, with the elder’s presence, nothing should happen in Jingzhou City.<br/><br/>But, the words Lei Hao just said made him can’t help but worry.<br/><br/>Before dawn, an anxious Jinghai King finally returned to Jingzhou City. When he arrived back at the palace, his eyes first looked towards the direction of Chun Song Courtyard.<br/><br/>He noticed that an incredibly powerful expert was lurking within the palace.<br/><br/>At that moment, several guards spotted him, overjoyed they saluted, “Greetings, Your Highness.”<br/><br/>“Where’s Yinglong?”<br/><br/>“The Crown Prince is safe, only, he has not yet woken up.”<br/><br/>“And the queen?”<br/><br/>“The queen is also safe.”<br/><br/>At this point, he finally put down his worries, “What happened a few days ago?”<br/><br/>The guards followed him, walking and talking, and recounted the assassination attempt on the Crown Prince that happened a few nights ago. Everyone broke out in a cold sweat at the dangerous parts of the story.<br/><br/>“The Red Venerate Sect!”<br/><br/>A murderous aude flashed in the king’s eyes. Dared to attack the palace while he was away, he would remember this.<br/><br/>“Where is that Gu Yang staying?”<br/><br/>“In Chun Song Courtyard.”<br/><br/>He immediately turned towards Chun Song Courtyard.<br/><br/>As Jinghai King reached the entrance of the courtyard, the door squeaked open revealing a young man dressed in green. His eyes were full of profundity and his temperament was ethereal.<br/><br/>With just one look, his heart shuddered.<br/><br/>Over the years, he had always been in seclusion, focusing on cultivation. Therefore, he was completely unaware of the emergence of Gu Yang in the martial arts world.<br/><br/>To his surprise, this gentleman Gu was remarkably young.<br/><br/>Even more astonishing to the Jinghai King was that despite the young man’s seemingly frail physique, he could sense the terrifying power bound within him.<br/><br/>Even if it wasn’t as powerful as his natural dragon force, it was not far behind.<br/><br/>Just a while ago, Gu Yang was meditating when he suddenly felt a terrifying power entering the palace. Changing his perspective, he saw a dazzling blue light.<br/><br/>As soon as the opponent entered the palace, the radiation they produced disrupted the vitality of the heavens and the earth within a few kilometers.<br/><br/>This kind of power is more than ten times stronger than the two First Ranks in the palace.<br/><br/>Gu Yang knew that this person must be the master of the palace, the well-known king of Jing Hai.<br/><br/>He was originally heading in the direction of the crown prince, but halfway, he suddenly turned around and headed towards him.<br/><br/>When he was about to arrive, Gu Yang went out to greet him to show respect.<br/><br/>As soon as he opened the door, he saw a giant man over two meters tall, like a tower, wearing silver armor, with a huge sword as wide as a door panel in his hand.<br/><br/>Just standing there, he gives people a sense of formidable and domineering aura.<br/><br/>Not to mention, the enormous body contained an extremely terrifying power.<br/><br/>Everyone says that Jing Hai’s king is gifted, born with divine power. Seeing him today is indeed extraordinary.<br/><br/>On the contrary, his two sons and one daughter were all quite normal in appearance.<br/><br/>Gu Yang took the initiative to salute, “I am Gu Yang , I have met King Jing Hai.”<br/><br/>“No need.”<br/><br/>King Jing Hai extended his hand, holding him up, and said, “You have saved my son twice, and you are my benefactor. If anyone should salute, it is me who should salute you.”<br/><br/>Gu Yang saw that he spoke very frankly, and secretly praised him in his heart, he sure is a generous person. No wonder he has so many followers.<br/><br/>Just the fact that he returned to the palace, and instead of going to see his unconscious son first, he came to express his gratitude to the benefactor who saved his son, his behavior would certainly move anyone to tears. They might even bow down in gratitude.<br/><br/>“You flatter me, my lord.”<br/><br/>“It’s too formal to call me lord. If you don’t mind, just call me Brother Wu.”<br/><br/>This King Jing Hai, he must have some social anxiety. He starts calling each other brothers right away, without any royal demeanor.<br/><br/>He said, “I have a great friendship with Wu Xingyun, Brother Wu…”<br/><br/>With the relationship he has with Wu Xingyun, he definitely cannot treat King Jing Hai as a brother.<br/><br/>King Jing Hai laughed heartily, becoming even more delighted, and said, “Let’s not concern ourselves with that. Brother Gu, you must stay here for a few more days, and let’s have a drink.”<br/><br/>Seeing his firm attitude, Gu Yang could only reluctantly agree, “Brother Wu, don’t bother about me. You should go and see the crown prince first.”<br/><br/>“Okay.”<br/><br/>Indeed, King Jing Hai’s heart is with his son, he is not the fussy type and immediately turned around and left.<br/><br/>After people left, Zhang Xiaohai said with some worry, “What if Wu hears about this?”<br/><br/>“Don’t worry, he actually has deep feelings towards Jing Hai Mansion. As long as we find out what’s been bothering him, he and his father will reconcile sooner or later.”<br/><br/>Gu Yang is very confident about this.<br/><br/>Last time Wu Xingyun asked him to save his half brother, it was obvious.<br/><br/>Wu Xingyun is a very proud person, and he would actually ask him for help. It shows how much he cares about this brother of his.<br/><br/>Moreover, there were several simulations in the past, where the father and son had repaired their relationship.<br/><br/>The key now is to find out what Wu Xingyun’s grudge against his father is.<br/><br/>However, it wouldn’t be appropriate to ask the two parties concerned about this matter.<br/><br/>The servants in the palace probably wouldn’t dare to gossip.<br/><br/>Gu Yang didn’t know many people in Jingzhou City either——that’s right, he could ask her!<br/><br/>Suddenly, he thought of an extremely suitable candidate.<br/><br/>Just then, Gu Yang sensed that the power inside King Jing Hai was rapidly fading away, likely due to handling the Divine Sword obtained from Sword Mountain.<br/><br/>He didn’t need to worry about this, according to the deduced result, King Jing Hai would not only successfully solve the trouble brought by the Divine Sword, but his cultivation level would also greatly increase, entering the realm of Divine Power, and becoming a more formidable force.<br/><br/>Gu Yang found a servant of the palace, and asked, “Is there a maiden named Spring Peach in the palace?”<br/><br/>He was worried that King Jing Hai might misinterpret his intentions, so he didn’t mention anything about seeing the princess.<br/><br/>If King Jing Hai thought he had intentions toward his daughter, that would be troublesome.<br/><br/>So, he talked in circles and decided to find the maid who was in charge of the princess first.<br/><br/>The servant asked, “Why do you want to find Miss Spring Peach, Master Gu?”<br/><br/>“You go and pass a message, tell her to come and meet me.”<br/><br/>“Yes.”<br/><br/>When Spring Peach received the message, saying that Master Gu wanted to see her, her heart pounded, and she couldn’t help but wonder, what does he want?<br/><br/>It was obvious that Master Gu specifically asked someone to call her over, it must be because of the lady.<br/><br/>What to do?<br/><br/>What to do?<br/><br/>The lord has come back, this kind of thing, if the lord finds out, the consequences…<br/><br/>Thinking of this, Spring Peach turned pale.<br/><br/>After hesitating for a long time, she found an excuse, hid it from the lady, and quietly went to Chun Song Courtyard.<br/><br/>After seeing Master Gu, his first sentence was, “I want to see your lady, you arrange it.”<br/><br/>As expected…<br/><br/>He wanted to have a secret meeting with the lady, he’s too bold!<br/><br/>PS: One more and please give me monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}