{"id": 130, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310313.html", "title": "Chapter 130 - Chapter 130: 130 Phoenix Feather Knife’S Seal", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 130 - Chapter 130: 130 Phoenix Feather Knife’S Seal</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 130: 130 Phoenix Feather Knife’s Seal<br/><br/>Translator: 549690339<br/><br/>Ru Qin left as swiftly as she came — silently and without notice.<br/><br/>Gu Yang couldn’t help but sigh, in this high martial world. Even if one held high positions, without enough strength, there was no sense of security at all.<br/><br/>Places like Jinghai King’s Mansion, even for the somewhat stronger First Rank, were free to come and go as they pleased.<br/><br/>The Mansion was too large. They only had two First Rank, one of whom was severely injured and had to protect the queen and crown prince. Indeed, they could hardly keep the whole Mansion under control.<br/><br/>He did not reject the condition proposed by the Cao family outright, but said he would ponder over it.<br/><br/>Even though it looked like a trap from any angle.<br/><br/>Because there weren’t many opportunities to earn five million at once.<br/><br/>In the whole of Great Zhou, there weren’t many families who could afford to pay five million in cash. And even fewer willing to spend so much to lure him, hardly a few families.<br/><br/>Only the nine surnames that had been inherited for hundreds to thousands of years could be so extravagant.<br/><br/>As to whether it was a trap or not, a simulation would answer that.<br/><br/>Spending 500,000 to confirm a deal worth five million was still acceptable.<br/><br/>Gu Yang promptly opened the system.<br/><br/>[Would you like to use the Life Simulator? It uses 500,000 coins each time.]<br/><br/>“Yes.”<br/><br/>[At the age of 22, you have already achieved First Rank cultivation level, defeated Yi Yi who was the first on the prodigy list, and your name shook the whole world.]<br/><br/>[You went to Jinghai King’s Mansion for an appointment, thwarted the conspiracy of Red Venerate Sect, and saved the queen and crown prince of Jinghai King. You are regarded as a benefactor by the Mansion.]<br/><br/>[A few days after, Jinghai King returned to their Mansion. At the same time, the Shen Family sent a First Rank powerhouse, trying to retrieve “Phoenix Dance Nine Heavens”, you are not an opponent, at a critical moment, Jinghai King arrived, and one punch severely injured him.]<br/><br/>[Later, you agreed to the conditions of the Cao family, followed Ru Qin to Ningzhou. As you were nearing the Cao family’s residence, the head of the Shen Family caught up with you. Just when you were about to be caught, a Divine Power of the Cao family took action and repelled him.]<br/><br/>[You saw the living corpse that Cao Yiyi had become. Because she could not bear the power of an abnormal treasure, she fell into a deep sleep.]<br/><br/>[Cao Yiyi’s father used an abnormal technique, allowing your consciousness to enter that abnormal treasure, and awaken Cao Yiyi’s spirit.]<br/><br/>[A few months later, your Original Spirit is exhausted and you die at the age of twenty-two.]<br/><br/>After Gu Yang finished reading, his first thought was that these five million were indeed not easy to earn.<br/><br/>However, Ru Qin did not lie, Cao Yiyi indeed seemed close to death. The reason they sought him out, he guessed, was to stimulate her through him.<br/><br/>However, this method of saving people is too dangerous. Unsurprisingly, he died swiftly and cleanly.<br/><br/>There was another thing, the Shen Family would soon find out that he was cultivating the “Phoenix Dance Nine Heavens” technique. They sent over a First Rank powerhouse, a really strong one.<br/><br/>After failing once, even the head of the Shen Family took action. This person was ranked fifth in the First Rank list.<br/><br/>This crisis inevitably came to pass.<br/><br/>Needless to say, it must have been the doing of the Red Venerate Sect.<br/><br/>This simulation was originally to scout ahead, knowing in advance what risks there were, so as to know how to avoid them. It was a necessary expense, unavoidable.<br/><br/>Though this was his reasoning, he still felt a pang in his heart.<br/><br/>Earning money was hard for him, wasn’t it?<br/><br/>Every time, he bet his life on it.<br/><br/>And just like that, he lost five hundred thousand.<br/><br/>[Simulation is over, you could choose one of the following to keep.]<br/><br/>[One, the martial arts realm at the age of 22.]<br/><br/>[Two, the martial arts experience at the age of 22.]<br/><br/>[Three, the wisdom of life at the age of 22.]<br/><br/>Gu Yang’s gaze scanned the first two options. The increase in cultivation level in just a few months could be negligible, and there was no way he could have practiced any formidable saber techniques.<br/><br/>“I’ll choose three.”<br/><br/>Then, several more memories appeared in Gu Yang’s mind.<br/><br/>First, he was confronted with a middle-aged man. Despite being only First Rank in cultivation level, Gu Yang was so oppressed by his aura alone that he could hardly move. He was about to use the God’s Devastating Six Extinctions technique when he was hit and sent flying.<br/><br/>The fifth-ranked strength in the First Rank was so formidable!<br/><br/>The second memory was also of a middle-aged man, but he could not remember this man’s appearance at all. In front of this man, he was as powerless as a baby, to be played with at will.<br/><br/>From meeting Cao Yiyi to his consciousness entering the abnormal treasure, he was not in control of anything. He didn’t even have the chance to say no.<br/><br/>When he died in the simulation, he had only one revelation, “Stay away from this Divine Power Realm.”<br/><br/>A moment later, Gu Yang pulled out of those two memories, took a deep breath and calmed himself.<br/><br/>There was a sense of regret in his heart. It seemed that the five million he expected to earn was now out of reach.<br/><br/>Cao Yiyi’s father is obviously not an ordinary Divine Power Realm cultivator, at least, he is of the Mana Realm.<br/><br/>If he really went to the Cao family, his fate would no longer be under his control.<br/><br/>When he reaches the Mana Realm, won’t earning money be easy? Why would he need to go to the Cao family and strike a deal with the tiger?<br/><br/>The Cao family is one of the Nine Great Families, and behind them is a formidable old monster from the Unleaking Realm. Not someone to be trifled with.<br/><br/>Thinking of this, Gu Yang put out the thought of doing this deal.<br/><br/>He did not continue with the simulation. As the saying goes, to know one’s enemy and oneself, he would first inquire about the Shen family’s background to plan accordingly.<br/><br/>Just as he was thinking about this, another person arrived.<br/><br/>This time, it was a servant from the mansion, reporting that someone was asking to see him.<br/><br/>Feng Tianci stood outside the majestic and imposing gate of the Prince Jinghai’s Mansion, so nervous that he didn’t know where to put his hands.<br/><br/>This was the Prince Jinghai’s Mansion, whether being the First Rank on the list or the only different-sex prince in Great Zhou, these two identities were too lofty for him.<br/><br/>He nervously tugged at his master’s sleeve and said uneasily, “Master, maybe we should just give up. How could someone like Gu Yang meet us…”<br/><br/>At that moment, the person who had gone to inform of their arrival came back out and said, “Young Master Gu has agreed to meet. Follow me.”<br/><br/>Feng Tianci was stunned. He actually agreed to meet with him and his master?<br/><br/>The voice of Gao Fan echoed in his ear, “What are you waiting for? Let’s go.”<br/><br/>Startled, he snapped back to reality and quickly caught up.<br/><br/>Once inside the mansion and seeing the grand courtyard, Feng Tianci became even more uneasy, tugging at Gao Fan’s sleeve, he whispered, “Master, why are we here to see Gu Yang?”<br/><br/>Gao Fan whispered back, “Naturally, to make a connection.”<br/><br/>Feng Tianci wanted to accuse him of wishful thinking, but remembering their encounter at that small courtyard that night, he swallowed the words that were on the tip of his tongue.<br/><br/>The fact that his master knew a Sword Saint was still incredible to him.<br/><br/>These past few years, his master had been incredibly unreliable. This sudden change still felt a little unnatural to him.<br/><br/>In the past few days, he couldn’t help but think, could his master be an unassuming peerless expert?<br/><br/>But every time he saw his master’s laid-back demeanor, it was hard to equate him with a peerless expert.<br/><br/>When Gu Yang saw the two of them, he was also taken aback.<br/><br/>Turns out, it was a misunderstanding.<br/><br/>However, he had a favorable impression of this young man. It was rare to come across such a simple and righteous martial artist.<br/><br/>He smiled and said, “So it’s you. I forgot to ask your name last time.”<br/><br/>Feng Tianci was no longer as fearful of Gu Yang as before, but facing a First Rank expert, he was still very nervous, “I am Feng Tianci of Jade Door Sect, pleased to meet you, and this is my master, Gao Fan.”<br/><br/>Gu Yang looked at Gao Fan and found it strange, “Mr. Gao seems to have no cultivation at all, yet he can cultivate such an excellent disciple.”<br/><br/>Gao Fan sighed, “I suffered a severe injury in the past and lost all my cultivation. All I can do now is hide and teach my disciple.”<br/><br/>Feeling that Gao Fan was a man with a story, Gu Yang asked, “I was wondering what brought you two here today?”<br/><br/>Gao Fan said, “To be honest, I no longer have anything I can teach this disciple of mine. It’s a pity for him to waste his time with me. His talent is quite good, so I was hoping you could give him some advice.”<br/><br/>Feng Tianci, who was standing beside them, never thought that his master would say such a thing, “Master, you…”<br/><br/>“Let me finish.”<br/><br/>Gao Fan signaled him to be patient, then continued, “I have nothing of value, except that I have a knack for obtaining information. If you agree to guide my disciple, I would tell you how to unseal the Phoenix Feather Knife.”<br/><br/>PS: First update, please vote.\t\t\t\t\t\t</div>", "images": {}, "success": true}