{"id": 140, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310343.html", "title": "Chapter 140 - Chapter 140: Unfaithful And Fickle", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 140 - Chapter 140: Unfaithful And Fickle</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 140: Unfaithful and fickle<br/><br/>Translator: 549690339<br/><br/>Gu Yang followed King Jinghai, heading towards a courtyard at the back.<br/><br/>Eventually, King Jinghai came to a stop, turned around and looked at him with a peculiar gaze.<br/><br/>Feeling somewhat edgy under his stare, Gu Yang endeavored to explain. “Actually, all of this has been a misunderstanding, I always thought…”<br/><br/>“A man’s actions need no explanations!”<br/><br/>King Jinghai cut him off. “Since you and Qianlan have mutual affection, I will naturally see you two be together.”<br/><br/>Gu Yang was dumbfounded and wondered if he was having hearing issues.<br/><br/>Even the most magnanimous person must have boundaries. Could he really give his own wife to someone else?<br/><br/>He didn’t save King Jinghai, only his son.<br/><br/>That’s not how you repay a favor.<br/><br/>Gu Yang really wanted to ask if he had another name, Li Tanhua?<br/><br/>King Jinghai continued speaking, “Brother Gu might not know this, but Qianlan is the daughter of my sworn brother. I have always treated her as my daughter…”<br/><br/>This left Gu Yang speechless.<br/><br/>There was such a melodramatic twist to this story. It should be called, “I married my sworn brother’s daughter.”<br/><br/>“… Years ago, in order to overthrow Lei Wanhai, my sworn brother tarnished his reputation by pretending to be a pirate. After enduring many hardships for nearly ten years, he finally earned Lei Wanhai’s trust. Eventually, he was able to break Lei Wanhai’s Golden Body, which allowed me to kill him, thus eradicating the pirates that had plagued Jingzhou for decades.”<br/><br/>Speaking of the past, King Jinghai couldn’t help but sigh.<br/><br/>Gu Yang knew quite well that he was talking about the famous battle in which he annihilated the Pirate King.<br/><br/>So, this Pirate King was a Divine Power realm cultivator.<br/><br/>The queen’s father was the key to killing the Pirate King.<br/><br/>No wonder the King Jinghai was so reputable. Being a First Rank cultivator and still being capable of killing a Divine Power realm expert, even if the latter’s Golden Body was broken, was indeed an extraordinary feat given the huge difference in cultivation levels.<br/><br/>From this, one could infer his formidable strength.<br/><br/>King Jinghai continued, “Unfortunately, we failed to completely eliminate this threat. Lei Wanhai had a son named Lei Hao who was not on the island at that time, which left a potential problem. Eight years ago, Lei Hao accomplished his Golden Body and came to Jingzhou City. He killed my sworn brother’s family, leaving only Qianlan.”<br/><br/>His voice took on a tragic tone when he spoke of the massacre that happened that year.<br/><br/>“At that time, empowered by his Golden Body, Lei Hao issued a kill-on-sight order in Jingzhou. Anyone who dared to shelter Qianlan would be exterminated; anyone who killed her and went to Dragon Gate Island would obtain an unparalleled Divine Power.”<br/><br/>“Even my subordinates were advising me not to provoke Lei Hao. Some even secretly planned to kill Qianlan.”<br/><br/>Gu Yang could imagine the scene. Having achieved Divine Power, Lei Hao was far more daunting than King Jinghai who was merely a First Rank cultivator.<br/><br/>Even his subordinates were becoming unstable.<br/><br/>In the eyes of others, going up against a Divine Power realm expert for the sake of a woman was extremely unwise.<br/><br/>Those who wanted to assassinate Pei Qianlan could very well be his most loyal followers.<br/><br/>King Jinghai continued, “Qianlan didn’t want to bring trouble to me, so she ran away. How could I just stand by and watch while my sworn brother’s only remaining bloodline were killed? I had no choice but to marry her, so she could stay peacefully in the palace, and also to dissuade the thoughts of my subordinates.”<br/><br/>Gu Yang didn’t expect such a twisted backstory.<br/><br/>That Lei Hao must be the owner of Dragon Washing Pond in Simulation, wasn’t he?<br/><br/>“When I married her, I was compelled by circumstances. In my heart, I’ve always treated her as a daughter. Now that she has someone she loves, I feel extremely glad. I hope, Brother Gu, you will treat her well in the future…”<br/><br/>“Hold on!”<br/><br/>Upon hearing such words, Gu Yang felt he needed to clarify, “You’ve misunderstood, in reality I don’t have such romantic feelings towards the queen.”<br/><br/>King Jinghai glared at him, slowly saying, “Just now, Qianlan risked her life for you, and managed to make that slash. Clearly, she is deeply in love with you. How can you say such disloyal and ungrateful words?”<br/><br/>Gu Yang shook his head and seriously said, “Brother Wu, you’re mistaken. It’s because I once saved her, she was merely returning the favor. The Queen is indeed a rare woman in this world.”<br/><br/>Seeing him with a sincere expression, King Jinghai started doubting his previous judgement, “If that’s the case, have I really made a mistake?”<br/><br/>Gu Yang then continued, “However, it was for my sake that she got badly hurt. If there’s anything I could do to help, just let me know. As long as it is within my capability, I won’t refuse.”<br/><br/>Pei Qianlan’s injury was severe, her life force had been seriously depleted and it certainly wouldn’t be easy to restore. Even if she didn’t lose her cultivation level, she would likely be stuck at First Rank for the rest of her life.<br/><br/>The cost was indeed heavy.<br/><br/>When King Jinghai thought of Pei Qianlan’s injury, he also felt rather helpless. “To restore her to her former state, the only option is the Dragon Washing Pond on the Island of Ten Thousand Dragons. However, that place is now being occupied by Lei Hao. Killing him, even with our combined forces, would be extremely difficult.”<br/><br/>A Divine Power Realm individual isn’t so easy to kill.<br/><br/>Although Lei Hao has not fully entered the Divine Power Realm, his Golden Body has already been accomplished. King Jinghai has no confidence of defeating him.<br/><br/>He was only able to kill Lei Wanhai in the past due to a perfect combination of timing, geographical and human conditions, along with a bit of luck. From the very start, his Golden Body was broken, that’s why he succeeded in one battle.<br/><br/>Lei Hao wasn’t a fool, so it would be impossible for him to repeat his father’s mistakes.<br/><br/>Gu Yang suddenly realized. Yes, the Dragon Washing Pond has the effect of complete transformation, which would be most suitable for curing Pei Qianlan’s injuries.<br/><br/>As for that Divine Power realm Lei Hao, he didn’t pose a significant problem.<br/><br/>He advised, “The Divine Sword that Shizi drew from the Sword Mountain possesses some mystic characteristics. Brother Wu, you should study it thoroughly, perhaps it could yield some rewards.”<br/><br/>King Jinghai glanced at him in surprise.<br/><br/>In fact, when he had taken the sword from his son’s hands moments ago, he gained an inheritance from it.<br/><br/>Moreover, he knew the origin of the sword and understood why, for a thousand years, no one was able to draw this sword.<br/><br/>The sword, named the Azure Dragon Sword, can only be drawn by those with the dragon bloodline.<br/><br/>Since childhood, he awakened the dragon bloodline and was born with dragon power. Because of this, he had always been invincible among peers within the same realm.<br/><br/>That was the very reason why he had been unable to break through to the Divine Power Realm.<br/><br/>His Cultivation Level and accumulations were already sufficient. Despite numerous years of seclusion, he still could not find the opportunity to breakthrough.<br/><br/>It wasn’t until just now, when he received the inheritance from the Azure Dragon Sword, that he finally found the method for breakthrough.<br/><br/>If not for sensing that an accident occurred here, he would have immediately secluded himself to impact the Divine Power Realm.<br/><br/>It’s really ironic. This Divine Sword has always been within Jingzhou’s territory, embedded on top of Sword Mountain. Yet, he never once thought of trying to draw it. Otherwise, he wouldn’t have wasted so many years.<br/><br/>In the end, it was his son who drew the sword and brought it before him.<br/><br/>Gu Yang went on, “Brother Wu, I have a favor to ask.”<br/><br/>Seeing his seriousness, King Jinghai also responded gravely, “Whatever it may be, feel free to speak.”<br/><br/>“I need money, a lot of money.”<br/><br/>King Jinghai was rather amused, thinking that Gu Yang had a serious matter to discuss. Who knew it was merely for something as worldly as money.<br/><br/>For him, money really wasn’t an issue at all.<br/><br/>Laughing, he said, “That’s easy to handle. Tomorrow, go find Qianlan and tell her how much money you need.”<br/><br/>Seeing King Jinghai’s nonchalant response, Gu Yang emphasized once more, “I need a lot of money.”<br/><br/>Seeing Gu Yang serious insistence, King Jinghai wasted no more words. He took out a jade token from his bosom and said, “Take this and go to the treasury. You can access any wealth within the king’s mansion.”<br/><br/>Gu Yang received the token with a bitter smile.<br/><br/>He knew that King Jinghai was not one to bother with mundane affairs. It was likely that the King is even unaware of the extent of his wealth.<br/><br/>He decided to directly seek out Pei Qianlan tomorrow and see what she had to say.<br/><br/>“Brother, having killed Shen Ao, the Shen family won’t let this issue rest. I need to enter seclusion for a period of time. You must be very careful. If you encounter a danger, take this token and head to the innermost house in the East Ancient Alley. There, someone will protect you.”<br/><br/>Gu Yang replied, “Understood.”<br/><br/>“Please take care of Qianlan for me,” said King Jinghai as he vanished into thin air.<br/><br/>Gu Yang knew that the King still wanted him to end up with his wife. However, Gu Yang was honest and open, and thus had nothing to hide.<br/><br/>He walked outside towards the courtyard where he was earlier. What greeted him were two pairs of worried eyes.<br/><br/>After Pei Qianlan took the Dan pill, she quickly woke up. Hearing that the King had come and taken Gu Yang away, she became anxious immediately.<br/><br/>What she feared most was Gu Yang having a conflict with the King, as she would not know what to do then.<br/><br/>How could Gu Yang possibly stand a chance against the King?<br/><br/>She struggled, wanting to go to the King and explain that it all had nothing to do with Gu Yang, and that she was just fancifully dreaming…<br/><br/>But she was firmly held back by Spring Peach.<br/><br/>Just then, Gu Yang walked out from inside, looking perfectly fine without any injuries. However, the King was nowhere in sight.<br/><br/>Relieved yet fearful, Spring Peach swallowed, asking, “Where’s the King?”<br/><br/>“He left.”<br/><br/>Spring Peach was at a loss, “Just like that… he left? Did he say… anything else?”<br/><br/>Gu Yang laughed, “There was a minor misunderstanding, which has been cleared up.”<br/><br/>Pei Qianlan finally asked, “What… did you say to the King?”<br/><br/>Gu Yang, remembering King Jinghai’s words about entrusting Qianlan to him, and considering it inappropriate to mention it as it could be easily misunderstood as flirting, simply said, “It was just a minor misunderstanding. The King, being broad-minded, didn’t take it to heart.”<br/><br/>He changed the topic to the main issue at hand, “By the way, how much silver is there in the King’s mansion?”<br/><br/>Pei Qianlan, slightly disappointed, said, “Probably several million taels, but Spring Peach would know better.”<br/><br/>The maid, Spring Peach, who was standing aside, spoke up, “Together, gold and silver amount to over seven million taels, not including various jewels, antiques, calligraphy and painting.”<br/><br/>Gu Yang’s eyes lit up. As expected of King Jinghai’s mansion. It was really too wealthy.<br/><br/>PS: I want to share some achievements with you all. My average subscription has already exceeded ten thousand. Thank you to all my subscribing brothers. Here, I ask for monthly votes again.\t\t\t\t\t\t</div>", "images": {}, "success": true}