{"id": 146, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310361.html", "title": "Chapter 146 - Chapter 146: 146 Tianwen Nine Swords", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 146 - Chapter 146: 146 Tianwen Nine Swords</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 146: 146 Tianwen Nine Swords<br/><br/>Translator: 549690339<br/><br/>When the phoenix bathed in fire flew out of Gu Yang’s body and soared within the room, everyone in Qian’s Mansion felt its presence.<br/><br/>In a nearby courtyard, Wu Xingyun was sitting by a pond, drinking heavily, looking somewhat dejected.<br/><br/>Ever since he returned from paying respects to his deceased mother outside the city a few days ago, he had been drinking away his sorrows daily. However, with his current cultivation level, just drinking ordinary alcohol couldn’t numb his nerves.<br/><br/>He couldn’t even get drunk.<br/><br/>Suddenly, he raised his head, looking in Gu Yang’s direction, his expression extremely shocked.<br/><br/>He murmured, “Divine Power?”<br/><br/>The pressure he felt just now clearly came from the Divine Power Realm.<br/><br/>No, that’s not right.<br/><br/>It’s too weak.<br/><br/>If it was really from the Divine Power Realm, the energy should be at least ten times greater.<br/><br/>“Brother Gu’s strength has actually reached this level.”<br/><br/>In Wu Xingyun’s heart at this moment, there was only admiration.<br/><br/>He had a premonition that Gu Yang might step into the Divine Power Realm soon, and he felt honored to witness this legend first-hand.<br/><br/>Inside the mansion, Xu Ruomei, Su Qingzhi, Lily, Han Mengling and others also felt the movement. However, they were not overly shocked.<br/><br/>This event had happened more than once or twice already.<br/><br/>Only, the impact was much greater this time.<br/><br/>Especially for Su Qingzhi, even if Gu Yang were to break through into the Divine Power Realm tomorrow, she wouldn’t be surprised.<br/><br/>Outside the Qian mansion, in an alleyway, there was a small eatery where an old man was sitting, gnawing on a chicken leg. Suddenly, he froze, quickly turned his head towards the direction of Qian’s Mansion, his eyes revealing shock. He didn’t even notice that he had dropped his chicken leg on the table.<br/><br/>A moment later, he unconsciously licked his lips and murmured, “He has actually cultivated the ‘Phoenix Dance Nine Heavens’ to this level  ”<br/><br/>With the changing expression on the old man’s face, he seemed to have made some decision. He wiped his mouth with his sleeve, stood up, and called, “Check, please.”<br/><br/>The phoenix finally returned to Gu Yang’s body, his body seemed to be enveloped in flames. This was the result of his True Essence being abundant to the limit, naturally forming a layer of Protective Gang Qi.<br/><br/>With a thought, the Gang Qi around his body disappeared.<br/><br/>He was hoping to continue meditating to consolidate his realm when he heard Zhang Xiao Hai’s footsteps outside. The steps stopped in the courtyard as if hesitating.<br/><br/>Gu Yang asked, “What’s the matter?”<br/><br/>It was then Zhang Xiao Hai reported, “Young Master, there is an old man outside claiming to be Ling Ling’s grandfather and wants to meet you.”<br/><br/>Ling Ling’s grandfather?<br/><br/>Gu Yang was a little confused, as he had never heard Ling Ling mention that she had a grandfather before.<br/><br/>“Let him in.”<br/><br/>No matter what, it would be best to meet him first.<br/><br/>“Yes, sir.”<br/><br/>Soon, Zhang Xiao Hai led an elderly man into the room. He appeared disheveled, his clothes looking as though they hadn’t been changed for quite some time, his hair was half white, and his beard unkempt. He completely looked like a sloppy old man.<br/><br/>However, Gu Yang’s heart tightened. With one look, he could tell that the old man’s body harbored an incredibly terrifying power, much stronger than his pre-established power.<br/><br/>“Golden Body?”<br/><br/>He stealthily shifted his view and saw a faint energy source. It was weak, as if it was at end of its life and could disappear at any moment, inferior to even an average person.<br/><br/>This situation was extremely strange.<br/><br/>Gu Yang didn’t dare to slack off and asked respectfully, “May I know how to address the senior?”<br/><br/>The old man had been watching Gu Yang ever since he entered and said with a sigh, “A few months ago, when I first saw you, you were only at the Fifth Grade, and now you’ve reached the peak of First Rank, even achieving an immaculate body, just one step away from the Divine Power Realm.”<br/><br/>Gu Yang asked in surprise, “Senior has met me before?”<br/><br/>“On the day you killed Zhou Qing, I was present.” [Refer to Chapter 29]<br/><br/>Gu Yang recollected for a bit and suddenly realized, “Senior was in Zheng family’s carriage then?”<br/><br/>“Indeed.”<br/><br/>The old man said, “After I discovered you possessed the Pure Yang Qi, I informed Ling and that’s how you came to meet.”<br/><br/>So that’s how it was.<br/><br/>Gu Yang finally understood the cause and effect. So, this man played the role of a matchmaker between him and Ling Ling.<br/><br/>The old man continued, “My name is Wu Er, Ling calls me Second Grandfather.”<br/><br/>“I am wondering, is there any reason why the elder is here?”<br/><br/>Wu Er said, “The God Destroyer Nine Styles is not suitable for you; I have a saber technique that fits quite well with your cultivation. Do you dare to learn it?”<br/><br/>Gu Yang was surprised inside.<br/><br/>This was something that he had never simulated before.<br/><br/>It seemed like his reaching the pinnacle of the First Rank had triggered a new plot development.<br/><br/>Wu Er continued, “You should think it over clearly. Now that you know about Ling Ling’s origin, you should also guess who I am. I have enemies all over the world. If you learn my saber technique, you may very well get involved.”<br/><br/>“I am willing to learn.”<br/><br/>Bullshit, why would he refuse such a golden opportunity given to him on a silver platter?<br/><br/>No matter what the saber technique was, he would learn it first and make decisions afterward.<br/><br/>As for the enemies of the Wu Family, based on his relationship with Ling Ling, he would never sit idly by if she were in danger. It was only a matter of time before he would have to confront them anyway.<br/><br/>“Good.”<br/><br/>As Wu Er said this, his stomach suddenly grumbled.<br/><br/>Gu Yang immediately called out, “Xiao Hai, arrange for a feast right away, the faster, the better.”<br/><br/>The feast was set up in the courtyard. Wu Er ate rapidly and messily, devouring half of the table’s food in a short while.<br/><br/>Gu Yang sat by his side and could feel that after Wu Er had eaten, his internal energy had increased slightly.<br/><br/>It was clear that he was using this method to extend his life.<br/><br/>Finally, after Wu Er had finished all the food, he picked up a cup of wine, drained it all in one gulp, and sighed with satisfaction, “It’s been a long time since I had such a satisfying meal.”<br/><br/>The way he looked at Gu Yang had become much friendlier.<br/><br/>He somehow produced a toothpick and while cleaning his teeth said, “Do you know the origin of the Shen Family?”<br/><br/>Gu Yang shook his head.<br/><br/>Wu Er snorted contemptuously, “Hmph, that old man Gao always says half of what he knows and keeps the other half to himself. However, he doesn’t tell you the most important thing.”<br/><br/>“Does the elder know Gao Fan?”<br/><br/>Gu Yang was surprised. His conversation with Gao Fan had been overheard by this old man.<br/><br/>“Let’s not talk about him for now.”<br/><br/>Wu Er didn’t want to talk about this man. He carried on with his explanation about the Shen Family, “That old geezer of the Shen Family was originally a minor disciple in the Three Sage Sect. He was sent into the secular world, surely on a mission.”<br/><br/>“However, the Shen Family hasn’t made any major moves in nearly a thousand years. I guess the mission of the Shen Family is most likely related to ‘Phoenix Dance Nine Heavens’.”<br/><br/>The Three Sage Sect?<br/><br/>When Gu Yang heard him mention this sect, he realized that he might be talking about a secret known by very few people.<br/><br/>The old geezer of the Shen Family he was talking about should be the Unleaking Realm practitioner of the Shen Family. He was just a minor disciple in the Three Sage Sect?<br/><br/>“Phoenix Dance Nine Heavens”?<br/><br/>He asked, “Why do you say that?”<br/><br/>Wu Er said, “The Shen Family has another technique, the ‘Taiyou Moon Devouring Technique’. Almost every disciple of the Shen Family practices this technique.”<br/><br/>“But in every generation, the Shen Family selects the most talented disciple to practice ‘Phoenix Dance Nine Heavens’. For a thousand years, they have never stopped, even though no one has ever reached the First Rank. Yet the Shen Family still insists on doing this. This is extremely abnormal.”<br/><br/>“This technique ‘Phoenix Dance Nine Heavens’ may contain a great secret.”<br/><br/>When Wu Er talked about this, his tone was particularly serious.<br/><br/>“Since you have practiced the ‘God Destroyer Nine Styles’ to the ninth style, you should have noticed that there is something wrong with this sword art.”<br/><br/>Gu Yang was shocked. He knew that he was perhaps about to touch one of the biggest secrets of this world. He asked, “What’s wrong with it?”<br/><br/>Wu Er said, “The Wu Family’s ‘Heavenly Elemental God Slaying Art’ and ‘God Destroyer Nine Styles’ both come from Red Bright Heaven. Our ancestors found out long ago that these two techniques contained great hidden dangers. The higher the cultivation level, the greater the danger. Even he, in the end, could only suppress it with the Tomb of Swords  ”<br/><br/>“I didn’t expect you to have mastered the ‘God Destroyer Nine Styles’ in such a short time. Fortunately, you haven’t reached the Godslayer Realm yet, so the problem isn’t too severe.”<br/><br/>Gu Yang was somewhat excited. A new copy of the world was revealing its mysterious corners to him.<br/><br/>Red Bright Heaven is also one among the legendary Four Great Sacred Lands.<br/><br/>So, the World’s Nine Surnames very likely originated from the Four Great Sacred Lands.<br/><br/>Then, what about the Six Great Sects?<br/><br/>And the Imperial Family?<br/><br/>Gu Yang’s mind started to wander with imagination.<br/><br/>Wu Er continued, “Our ancestors went to great lengths to find another Ghastly Moon Devouring Technique for me. I’ve spent my entire life to master a new saber technique, known as the ‘Heavenly Inquiry Nine Knives’. I originally wanted to provide it to the Wu Family as an inheritable legacy, but who knows…”<br/><br/>“Today, I will pass this saber technique onto you. How well you can learn is up to you.”<br/><br/>PS: Second update, looking for a monthly ticket.\t\t\t\t\t\t</div>", "images": {}, "success": true}