{"id": 147, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310364.html", "title": "Chapter 147 - Chapter 147: 147 This, Is It Accomplished? (Third Update Asking For Monthly Tickets)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 147 - Chapter 147: 147 This, Is It Accomplished? (Third Update Asking For Monthly Tickets)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 147: 147 This, is it accomplished? (Third update asking for monthly tickets)<br/><br/>Translator: 549690339<br/><br/>“The power of ‘Godslayer Six Annihilation’ is peerless, it’s the unique skill of Blue Sky Palace, and it’s even stronger than the ‘Taiyou Moon Devouring Technique’ and ‘Heavenly Elemental God Slaying Art’.”<br/><br/>Wu Er transitioned into teaching mode, and this somewhat slouchy old man finally took on the demeanor of a first-generation grandmaster.<br/><br/>“However, your cultivation level is not yet high enough, and you need to charge up before you can launch an attack. You can easily crush opponents weaker than you, but if you face opponents of equal strength, let alone enemies stronger than you, they will not give you the opportunity to use this saber technique at all.”<br/><br/>Gu Yang nodded. He naturally knew the weakness of this saber technique, that its charging process was too long.<br/><br/>In fact, since his debut, he had never encountered anyone in reality who was truly stronger than him. Not even those of comparable strength.<br/><br/>Even when he was Third Rank and encountered Second Rank experts dispatched by the Lin Family, his strength still crushed theirs in the simulator after his many years of saber training. Details are given in Chapter 68.<br/><br/>As his realm climbed higher, his progress was sure to slow. It was a bit difficult to continue crushing his opponents like before.<br/><br/>If ‘Heavenly Inquiry Nine Knives’, as the old man said, really is this strong, it couldn’t be any better.<br/><br/>Wu Er continued, “I can’t transfer the Blade Intent to you right now, you can only comprehend it by yourself. This will definitely take a considerable amount of time, I will stay here during this period, listen carefully  ”<br/><br/>It took Wu Er two days to finish explaining just the first strike.<br/><br/>Without the Blade Intent to inherit, he had to start from scratch. It was described as a saber technique, but in fact, it was an entire complex system.<br/><br/>He broke it down thoroughly, explained each concept, and demonstrated it at the same time.<br/><br/>However, the language alone was too abstract. Gu Yang felt as if he understood, yet he didn’t fully understand.<br/><br/>It was like studying advanced mathematics. The past supreme arts he had learned were all about using formulas directly. As long as he could apply them flexibly, it was enough.<br/><br/>Now, he had to thoroughly understand the entire derivation process.<br/><br/>The most troublesome part was that many of the theorems and ideas in it were completely different from the saber techniques he had learned before. He almost had to start learning from scratch.<br/><br/>Over this period of two days, Gu Yang felt dizzy and bloated. He felt like he had learned a lot, yet everything was in chaos.<br/><br/>In the evening, he couldn’t resist and opened the system.<br/><br/>“This is too inefficient.”<br/><br/>[Do you want to use the Life Simulator? One use consumes 500,000gold.]<br/><br/>“Yes.”<br/><br/>[At the age of twenty-two, you are already at the pinnacle of First Rank, ranking tenth on the First Rank list, a feat that has shaken the world.]<br/><br/>[Wu Er takes the initiative to find you and teaches you ‘Heavenly Inquiry Nine Knives’].<br/><br/>[A few days later, King Jinghai makes a breakthrough to the Divine Power realm. A Golden Body realm powerhouse tries to ambush you, but is injured by Huangfude’s sword and retreats.]<br/><br/>[A year later, three Divine Power realm powerhouses arrive together, two of them hold off Huangfude and King Jinghai, and the other kidnaps you.]<br/><br/>[Two years later, you are taken to a secret realm and forced to cultivate day and night.]<br/><br/>[Twenty years later, due to slow progress, you are executed. Just before your death, you comprehend the first strike of ‘Heavenly Inquiry Nine Knives’. You are forty-five years old at the time of death.]<br/><br/>What the hell?<br/><br/>Gu Yang was dumbfounded.<br/><br/>Three Divine Power realm powerhouses got together to capture him, isn’t that an overestimation of his worth!?<br/><br/>He is just a First Rank, do they really need to put so much effort into catching him?<br/><br/>Looking at the content of the simulation, that Divine Power realm powerhouse who had kidnapped him to a secret realm just wanted him to cultivate day and night. In the end, it was because he was progressing too slowly that he was executed.<br/><br/>“So they captured me for the purpose of making me practice ‘Phoenix Dance Nine Heavens’?”<br/><br/>After Gu Yang figured out the logical relationship, he couldn’t help but sigh.<br/><br/>That was right indeed, as Wu Er had pointed it out, ‘Phoenix Dance Nine Heavens’ was a pitfall.<br/><br/>That secret realm should be one of the Four Great Sacred Lands in the legend, the Three Saint’s Gate, right?<br/><br/>In this world, there are pitfalls everywhere. A small mistake, and one could easily fall into them and die.<br/><br/>However, there is a problem.<br/><br/>Why, over so many years, has the Unleaking Realm powerholder of the Shen Family chosen the most talented descendants to practice this technique? He can’t possibly be deliberately plotting against his own descendants, right?<br/><br/>There might be something fishy going on.<br/><br/>[Simulation ends, you can retain one of the following items.]<br/><br/>[One, martial arts realm at the age of forty-five.]<br/><br/>[Second, the martial arts experience at the age of forty-five.]<br/><br/>[Third, the wisdom of life at the age of forty-five.]<br/><br/>“I’ll choose second.”<br/><br/>Suddenly, his mind was flooded with an enormous amount of intricate knowledge, among which, he also discerned an extremely profound blade intent.<br/><br/>As it turned out, his understanding of saber techniques far exceeded his own innate talent. In twenty-three years, he went from knowing nothing to mastering the first knife of the “Heavenly Inquiry Nine Knives”.<br/><br/>Gu Yang sat cross-legged in the room, digesting the blade intent he had just obtained.<br/><br/>He sat like this for a whole day.<br/><br/>Wu Er casually sat in the courtyard for a day, clearly showing no intent to hurry him up.<br/><br/>He was currently living quite a leisurely life, with meals and clothes always at the ready, and all sorts of food always available on the nearby table. As soon as he finished eating, new food would be served up.<br/><br/>Zhang Xiao Hai had arranged things very thoughtfully. He was quite satisfied. With some free time today, he even offered some guidance.<br/><br/>“You’re quite talented, lad. If you consistently keep your feet on the ground, you’ll definitely achieve something in the future.”<br/><br/>Wu Er genuinely liked this insightful young man, so he couldn’t help but advise, “Remember, the likes of Little Gu Yang   throughout history, or at least since the middle ages, are truly one of a kind. Even in the past thousand years, even those who have achieved the status of a Celestial Being, no one has cultivated as fast as he has. You must not compare yourself to him.”<br/><br/>Zhang Xiao Hai respectfully replied, “I will bear the elder’s words in mind.”<br/><br/>While they were talking, Gu Yang finally stepped out of the room.<br/><br/>By now, it was already dark, and just as Wu Er was about to speak, his expression suddenly changed and he looked up at the sky.<br/><br/>Gu Yang also swiftly noticed that the vitality of heaven and earth was suddenly becoming violent, and the source was coming from Jing Hai Prince’s Mansion.<br/><br/>It’s here!<br/><br/>The Prince of Jing Hai is finally making his breakthrough to the Divine Power realm.<br/><br/>In the sky, streaks of lightning were brewing.<br/><br/>All around, the wind was blowing and the clouds were surging.<br/><br/>Wu Er couldn’t help but marvel, “I didn’t expect this world to still have the bloodline of the Dragon Clan.”<br/><br/>Gu Yang was intrigued and asked, “Senior’s meaning is that the Prince of Jing Hai carries the blood of the Dragon Clan?”<br/><br/>“Correct. During the middle ages, the royals of the Xia Dynasty hunted the bloodlines of the Monster Race for a thousand years. Logically speaking, high-ranking bloodline like the Dragon Clan should have gone extinct long ago.”<br/><br/>Gu Yang looked at the increasing lightning in the sky and felt something was wrong, asking, “This  breaking through to the Divine Power realm, he wouldn’t have to go through a divine tribulation, would he?”<br/><br/>Wu Er couldn’t help but laugh, “Unless one is reaching the Celestial Being realm, who would be eligible for a divine tribulation? This is merely because Wu Tianqi’s accumulation is too profound, causing the change in the celestial phenomenon. There’s nothing to worry about.”<br/><br/>Gu Yang nodded, his eyes never leaving the direction of the prince’s mansion.<br/><br/>This was a rare opportunity to observe how others broke through to the Divine Power realm. It would give him a better understanding for when he did it himself.<br/><br/>Wu Er couldn’t help but add, “The bloodline of the Dragon Clan is indeed blessed. Coupled with the heritage of the real Dragon Clan, his future achievements will be limitless.”<br/><br/>Boom!<br/><br/>At last, the first bolt of lightning from the sky struck down; the thick lightning illuminating the entire night sky, accompanied by a deafening roar.<br/><br/>This bolt of lightning seemed like a signal, causing one bolt after another to strike down from the sky, reminiscent of silver snakes dancing chaotically.<br/><br/>This spectacle was far more exaggerative than when Gu Yang used the “Godly Sky Six Extinguish” Lightning Punisher.<br/><br/>Meanwhile, Gu Yang “saw” a burst of blue light exploding within the prince’s mansion, constantly expanding, the light becoming more and more dazzling.<br/><br/>Eventually, Gu Yang dared not directly look at the blue light as it caused his eyes to sting.<br/><br/>Is this the True Essence of a Divine Power realm expert?<br/><br/>That’s too exaggerated, right?<br/><br/>He had previously tried to secretly view the Sword Saint from this perspective, but he was unable to see anything, as if he was shielded.<br/><br/>At this moment, Gu Yang felt a terrifying aura locking onto him. Instantaneously he felt his hairs stand on end.<br/><br/>In this crisis, his instinct caused him to pull out his Phoenix Feather Knife. With the blade intent bursting forth, he was able to escape the locking aura.<br/><br/>“Huh?”<br/><br/>Wu Er looked at him in surprise, his mouth slightly agape, looking somewhat dazed.<br/><br/>Did he actually manage to cultivate it just like that?<br/><br/>PS: The third update requires monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}