{"id": 142, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310349.html", "title": "Chapter 142 - Chapter 142: 142 Nether Sect", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 142 - Chapter 142: 142 Nether Sect</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 142: 142 Nether Sect<br/><br/>Translator: 549690339<br/><br/>[Do you want to use the Life Simulator? It will consume 500,000 gold for each use.]<br/><br/>“Yes.”<br/><br/>[At the age of 22, you’re a First Rank cultivator, and hold the top spot on the Hidden Dragon List. You defeated Yi Yi, the top fighter on the list of prodigious talents, winning swaths of fame across the world.]<br/><br/>[You saved the queen and the prince of Jinghai King, resulting in his friendship. Both of you address each other as brothers ever since.]<br/><br/>[The First Rank powerhouse of the Shen Family, Shen Ao, has appeared and you killed him on the spot.]<br/><br/>[A few days later, as Jinghai King seeks to breakthrough to the Divine Power Realm, a Mana Realm expert abruptly attacks. A Sword Light from the city intercepts the attack. Suddenly, another Golden Body Realm powerhouse emerges dealing a severe blow to Jinghai King.]<br/><br/>[Subsequently, the Golden Body Realm powerhouse appears before you, killing you instantly, and leaves. You die at the age of 22.]<br/><br/>Here it comes!<br/><br/>Gu Yang was already mentally prepared. When he saw that Jinghai King was striving for the Divine Power Realm, he didn’t feel surprised at the unforeseen event.<br/><br/>The Mana Realm powerhouse is an old acquaintance. He would always appear when Jinghai King tries to reach the Divine Power realm, and then be blocked by the Sword Saint in Jingzhou City.<br/><br/>The problem is with the Golden Body Realm powerhouse, who made an appearance for the first time.<br/><br/>If he didn’t guess wrongly, there’s a high probability he’s from the Shen Family. The variable caused by his killing of Shen Ao.<br/><br/>Well, this Shen Family really doesn’t play by the rules.<br/><br/>Typically speaking, shouldn’t they have first sent the fifth of the First Rank, Shen Po, over? This time, they directly sent a Divine Power Realm expert, leaving no room for survival.<br/><br/>However, Gu Yang also has a question, wasn’t it said that the Sword Saint is invincible below the Unleaking Realm? How can the one in Jingzhou City be so weak that he couldn’t stop the additional Golden Body Realm expert?<br/><br/>[Simulation ends, you are allowed to keep one of the following.]<br/><br/>[One, Martial Arts Realm when you were 22.]<br/><br/>[Two, Martial Arts experience when you were 22.]<br/><br/>[Three, Life Wisdom when you were 22.]<br/><br/>“Choose Two.”<br/><br/>Immediately, a short span of memory flooded Gu Yang’s mind, a gigantic fist growing larger before his eyes, and then, everything before him went black, and he knew nothing more.<br/><br/>“How terrifying!”<br/><br/>From this piece of memory, he finally got to witness the might of a Divine Power Realm powerhouse. To a First Rank cultivator, it was simply a brutal crushing force. His current self couldn’t even fight back.<br/><br/>Gu Yang didn’t rush into the next simulation, instead, he began to ponder on how to break the deadlock before him.<br/><br/>[  As Jinghai King strives for the Divine Power realm, you take a token to East Ancient Alley to seek the protection of the Sword Saint.]<br/><br/>[Jinghai King dies on the spot under the attack of two Divine Power Realm powerhouses.]<br/><br/>[Half a month later, you follow the Sword Saint to depart for the Divine City, searching for the treasure left behind by the Xia Dynasty hundreds of years ago.]<br/><br/>[In a month, an ambush by a Golden Body Realm powerhouse in a chaotic fight over the treasure map leads to your death on the spot, at the ripe age of twenty-two.]<br/><br/>On seeing this, Gu Yang heaved a sigh of relief.<br/><br/>Following that Sword Saint doesn’t work, as he’s aiming to discover the so-called treasure of the Xia Dynasty. Being involved in such a whirlpool is too risky.<br/><br/>He’s aware of the Xia Dynasty, a dynasty before the Qin Dynasty, and it has been a thousand years since its existence.<br/><br/>According to the historical records, it was an extremely powerful dynasty, more potent than both the later Great Qin and Great Zhou Dynasties.<br/><br/>The Xia Dynasty only had one emperor during its reign, that was Xia Emperor. The dynasty fell with his death.<br/><br/>Xia Emperor reigned for a thousand years, spanning across the Middle Ages.<br/><br/>Although not explicitly mentioned in historical records, this Xia Emperor was unquestionably a powerhouse of the Unleaking Realm, or perhaps even a Celestial Being.<br/><br/>How such an undisputed emperor died is ambiguously written in the history books, simply noting, “One day, Xia Emperor fell.”<br/><br/>There are numerous legends about the Xia Dynasty, the most legendary of them all pertains to the eventual location of the Human Emperor’s Sword – the pair sword of the Xia Emperor.<br/><br/>After the death of the Xia Emperor, this symbol of imperial power disappeared without a trace, with its whereabouts unknown till today.<br/><br/>It’s said that the Human Emperor’s Sword represents the legal authority and luck of the Xia Dynasty. Whoever obtains it shall become the ruler of the world.<br/><br/>Aside from this, there are various other legends about the treasure left by the Xia Dynasty.<br/><br/>The treasure in Divine City, intriguing enough to move the Sword Saint of Jingzhou City, certainly has no ordinary origin.<br/><br/>The person who ambushed him at the end was most likely Shen’s powerhouse.<br/><br/>A dignified Divine Power Realm powerhouse, stooping to ambush a First Rank martial artist, is utterly shameless.<br/><br/>This type of person is the most dangerous.<br/><br/>The issue is, Gu Yang’s power is still not up to par with the opponent’s.<br/><br/>How to deal with this?<br/><br/>[Simulation ends, you can retain one of the following from your base.]<br/><br/>[1, the martial arts realm at the age of twenty-two.]<br/><br/>[2, the martial arts experience at the age of twenty-two.]<br/><br/>[3, the wisdom of life at the age of twenty.]<br/><br/>After a moment’s hesitation, he chose the second option.<br/><br/>Immediately, his mind was filled with a tremendous amount of knowledge and experience.<br/><br/>During the simulation, he followed the Sword Saint for a few months and received a lot of guidance indeed.<br/><br/>[   You immediately set off for Tianzhu Mountain, but were killed halfway there by an expert in the Golden Body realm. You died at the age of twenty-two.]<br/><br/>Gu Yang’s expression became serious as even this route was not viable.<br/><br/>Once targeted by a Divine Power realm expert, it seemed impossible to escape. No matter where he fled to, he would be pursued.<br/><br/>The same happened last time when Yi Yi from the Heavenly Saint Sect challenged him to a duel. Even at sea, he was tracked down.<br/><br/>Now, his biggest escape route had been cut off. How was he to resolve this predicament?<br/><br/>He had wasted three simulation opportunities, gaining nothing in return. It pained Gu Yang as he had worked hard to earn that money.<br/><br/>He quickly made a decision, informed Su Qingzhen, and left.<br/><br/>Donggu Alley was located in the center of Jingzhou City and belonged to the old city.<br/><br/>Over the years, Jingzhou City had expanded its size by more than tenfold. The contrast between the newly built districts and the old city was stark, with completely different architectural styles.<br/><br/>The old city gave the impression of chaos and narrowness.<br/><br/>Donggu Alley was an exception inhabited typically by the affluent.<br/><br/>Gu Yang came alone to this inconspicuous alley, arriving at the last courtyard. He knocked on the door and spoke in a clear voice, “Junior Gu Yang, seeking an audience with the senior.”<br/><br/>From inside, an aged voice responded, “Enter.”<br/><br/>He pushed the door and entered. Within the courtyard was an imposing, regal old man sitting in a pavilion, exuding a noble air just like a prince.<br/><br/>Such a demeanor made him seem more like a prince than Jinghai Wang.<br/><br/>“I respectfully greet you, senior.”<br/><br/>Before a Sword Saint, Gu Yang displayed enough respect.<br/><br/>The old man pointed to the stone bench opposite him, saying, “Sit.”<br/><br/>Gu Yang respectfully complied.<br/><br/>The old man observed him, a hint of appreciation flashed in his eyes, “To have such cultivation at such a young age, even Qin Wu in his prime may not match you.”<br/><br/>“Senior, you flatter me,” Gu Yang modestly responded. When others praised him in such a manner, he felt no emotion. No one knew the sacrifices he had made to attain his current strength.<br/><br/>There was nothing worth boasting about. If his aptitude had been a little better, he would have reached the Divine Power realm by now.<br/><br/>The old man was making tea. As the water boiled, he brewed a pot and poured a cup for Gu Yang, saying, “Why did you seek out this old man?”<br/><br/>Gu Yang replied, “There’s something this junior doesn’t understand and wanted to ask the senior.”<br/><br/>“Speak.”<br/><br/>“I’ve heard that few in today’s realm achieve the Divine Power realm. Why is that?”<br/><br/>The old man paused, not answering his question directly. Instead, he asked, “Have you ever heard of Nether Sect?”<br/><br/>Gu Yang nodded, “I have. One of the six major sects, an enemy of Dao Sect. I heard that a century ago, the sect was nearly destroyed by the head of Dao Sect and has been in hiding ever since.”<br/><br/>The old man said, “That’s part of it. While the Nether Sect leader was killed in that battle, his two disciples escaped.”<br/><br/>“These two must have found some sort of opportunity. In less than a hundred years, they broke through to the Unleaking realm and mastered a unique corpse-refining technique.”<br/><br/>“Eighteen years ago, during the imperial family’s assault on the Wu Family, the two appeared at the crucial moment. Many were attacked, even Luo Wang almost suffered a great loss.”<br/><br/>“They stole the corpse of the Unleaking warrior from the Wu Family, refined it into a war corpse, along with several in the Mana realm and a dozen in the Golden Body realm. From then on, no power in the world could stand against them.”<br/><br/>“Since then, those in the Nether Sect have been hunting down solo Divine Power experts, capturing and refining them into war corpses. Many have fallen victim to them. As a result, the Divine Power realm experts rarely leave their sects now, preventing the Nether Sect from exploiting the situation.”<br/><br/>Gu Yang was surprised to learn the full story.<br/><br/>Apparently, in his simulations, that person attempting to attack Jinghai Wang must have been from the Nether Sect.<br/><br/>The old man continued, “People from the Nether Sect only target those in the Divine Power realm and never harm those below it. It’s normal for you not to have heard this.”<br/><br/>PS: The first update, looking for monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}