{"id": 148, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310367.html", "title": "Chapter 148 - Chapter 148: 148 Only A Sword Can Block It", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 148 - Chapter 148: 148 Only A Sword Can Block It</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 148: 148 Only a sword can block it<br/><br/>Translator: 549690339<br/><br/>Night had fallen outside Jingzhou City, where two figures were hurrying on their way.<br/><br/>They walked side by side, seemingly slow but in reality very fast – they were evidently high-level martial artists.<br/><br/>The older of the two spoke solemnly, “Remember, no matter who you were, what grudges or connections you had before, once you become an Inspector of the Red Mansion, you must let it all go.”<br/><br/>“From now on, you shall have no part in the affairs of the martial world, you must not intervene in any matter. Even if your father’s killer stands before you, you must not lay a hand on him. If you defy this rule, you will be immediately expelled.”<br/><br/>The middle-aged man beside him responded woodenly, “Yes.”<br/><br/>The Red Mansion is an extremely unique organization with higher standing than others.<br/><br/>However, due to the Red Mansion’s master’s indifference to worldly affairs and its stringent rules, very few people are willing to join the Red Mansion.<br/><br/>In fact, aside from a few, most Inspectors of the Red Mansion joined because they had no other choice but sought refuge in the Mansion, becoming Inspectors, at the cost of their freedom.<br/><br/>The middle-aged man before them is a new recruit in the Red Mansion. His expression is indifferent, resembling a walking corpse.<br/><br/>The old man’s surname is Gu, he is one of the oldest Inspectors in the Red Mansion.<br/><br/>This time, he was sent to Jingzhou in order to ascertain why Wu Tianqi, Jingzhou’s King, had suddenly increased his cultivation level drastically.<br/><br/>The second reason was to confirm whether Gu Yang was indeed from a sacred place.<br/><br/>This verdict is crucial for the Red Mansion.<br/><br/>Thus, he came himself.<br/><br/>The middle-aged man beside him was a new recruit who had recently joined the Red Mansion, this being his first time executing an inspection. He was brought along personally by Gu.<br/><br/>“Boom!”<br/><br/>Suddenly, a thunderbolt struck down not far from Jingzhou City.<br/><br/>Gu’s expression tightened, “It’s starting so soon, let’s go!”<br/><br/>He increased his speed to the maximum, almost morphing into a shadow as he bolted towards Jingzhou City.<br/><br/>The middle-aged man behind him remained silent, but didn’t lag at all.<br/><br/>In no time, the two had arrived under Jingzhou City.<br/><br/>The guards at the ten-meter tall city wall couldn’t stop them at all. They vaulted the wall, the gatekeepers didn’t even notice. All their attention was absorbed by the bizarre spectacle in the sky.<br/><br/>The wind rose and thunder rumbled in the darkened world!<br/><br/>Under such circumstances, experienced martial artists would know what was happening – someone was attempting to enter the Divine Power Realm. Without a doubt, that person could only be the king of Jingzhou.<br/><br/>Was this ruler of Jingzhou finally taking that step forward?<br/><br/>Gu and the middle-aged man raced across rooftops, the closer they got to the lightning-lit area, the more they could distinctly feel a frightening aura gathering.<br/><br/>“Such profound accumulation.”<br/><br/>A hint of admiration appeared in Gu’s eyes, “Once he breaks through to the Divine Power Realm, he will likely reach the second level of the Golden Body Realm in a few years.”<br/><br/>The Divine Power Realm is divided into three mini-realms, Golden Body, Mana, and Unleaking.<br/><br/>Each mini-realm is again divided into three levels.<br/><br/>It could be said, the Divine Power Realm varies greatly from person to person in its manifestation.<br/><br/>With such deep cultivation like Jinghai King’s, once he enters the Golden Body Realm, he could progress rapidly and perhaps reach the Mana Realm in a few decades.<br/><br/>The middle-aged man behind him looked towards the direction of the royal palace. For once, his wooden eyes held a hint of spirit.<br/><br/>At that moment, a terrifying aura exploded from somewhere else.<br/><br/>Gu was immediately taken aback, “That’s a Golden Body Realm powerhouse!”<br/><br/>However, to his surprise, the intended target of this Golden Body Realm person wasn’t Jinghai king but someone else.<br/><br/>His eyes suddenly flashed with a faint purple glow as he gazed in that direction. From afar, he could see a phoenix bathed in red flames.<br/><br/>“Gu Yang!”<br/><br/>Gu instantly recognized the identity of that person.<br/><br/>After Lao Wu returned to the Divine City, he had informed him about Gu Yang’s practice of the blade technique “Phoenix Dance Nine Heavens”.<br/><br/>Instantly, the identity of this Golden Body Realm person was clear as day.<br/><br/>The youngest Divine Power Realm warrior of the Shen Family, and at the first level of the Golden Body Realm, Shen Luo. He was the cousin of Shen Ao who was killed by Gu Yang’s blade not long ago.<br/><br/>“It seems that the blade technique ‘Phoenix Dance Nine Heavens’ is indeed extremely important to the Shen Family. Shen Luo is even risking the danger of being ambushed by the Nether Sect, just to snatch back this blade technique.”<br/><br/>Having been an Inspector with the Red Mansion for decades, Gu was very familiar with the circumstances of all the major powers.<br/><br/>“Will he take action?”<br/><br/>Gu glanced in another direction.<br/><br/>He knew that the once unrivaled Emperor’s Supreme Sword Saint, who was the leading official in the royal offerings twenty years ago, had been residing in Jingzhou City for the past few years, borrowing King Jinghai’s dragon vein energy to suppress his injuries.<br/><br/>With this Sword Saint present, Shen Luo, who was only at the first level of the Golden Body Realm, simply did not stand a chance.<br/><br/>Just at that moment, from Gu Yang’s location, an indescribable surge of blade intent shot up towards the sky.<br/><br/>“This is——”<br/><br/>Gu Lao suddenly turned his head, his pupils constricting instantly as shock ripples through his heart, “Wu Shengtian’s ‘Nine Heavens Inquiry Blade’? His saber technique has been handed down? How is this possible?”<br/><br/>“Huh?”<br/><br/>Seizing the opportunity when King Jinghai was attempting to breach into the Divine Power Realm, Shen Luo suddenly made a move; he used his mana to lock onto Gu Yang, thinking it would be an effortless capture.<br/><br/>As a cultivator of the Divine Power Realm, dealing with a mere First Rank should be no trouble at all.<br/><br/>Yet in the next moment, a Blade Intent severed his mana lock.<br/><br/>The First Rank kid managed to break free from his mana lock.<br/><br/>“Interesting!”<br/><br/>Shen Luo licked his lips, “Let’s see what’s so surprising about this ‘Phoenix Dance Nine Heavens’ you’ve cultivated.”<br/><br/>Every disciple of the Shen Family was curious about the ‘Phoenix Dance Nine Heavens’. If the patriarch held it in such high regard, it must have extraordinary features.<br/><br/>Now, someone has finally cultivated this technique to the peak of the First Rank. Moreover, that person is not a member of the Shen Family. This was undoubtedly ironic.<br/><br/>After his surprise attack failed, Shen Luo revealed himself and reached Gu Yang with a single leap, covering miles of distance.<br/><br/>His form, like a bullet, delivered a straightforward and unadorned punch.<br/><br/>A golden fist kept enlarging in front of Gu Yang’s eyes.<br/><br/>The pressure it brought left one breathless.<br/><br/>He felt his cells trembling, a dread that only rose when faced with death.<br/><br/>The power of this punch far exceeded his expectations.<br/><br/>There was nowhere to hide, nowhere to evade.<br/><br/>Other than taking it head-on, he had no other choice.<br/><br/>Is this the power of the Divine Power Realm?<br/><br/>At this moment of life and death, Gu Yang completely forgot about Wu Er beside him and the Sword Saint in the East Ancient Alley.<br/><br/>His adrenaline surged, reaching an unprecedented level of focus.<br/><br/>In his eyes, there was only that one fist.<br/><br/>How could he possibly break that punch?<br/><br/>Like sensing danger, the phoenix in Gu Yang’s mind let out a clear scream.<br/><br/>Boom!<br/><br/>Gu Yang felt an endless influx of True Essence into his body. His True Essence swelled nearly ten times its original size in an instant, and a red flame emerged from his body.<br/><br/>A phantom image of a phoenix was formed above his head.<br/><br/>Gu Yang channeled all his strength into the Phoenix Feather Knife in his hand, reaching a peak state in an instant.<br/><br/>‘Nine Heavens Inquiry Blade’, first move, The Beginning of Chaos!<br/><br/>“This”<br/><br/>Not far away, both Gu Lao and the middle-aged man were stunned for a moment.<br/><br/>How could a First Rank Peak possibly possess such formidable power?<br/><br/>At this moment, Gu Yang’s vigor was nearly comparable to Shen Luo in the first stage of the Golden Body.<br/><br/>No matter how worldly Gu Lao was, he had never heard of such a thing.<br/><br/>Logically speaking, even if a First Rank Peak were to stake his life on a decisive move, it would still be difficult to shake the Divine Power Realm.<br/><br/>The scene before them completely overturned the two men’s perception.<br/><br/>“Huh?”<br/><br/>On the other side, in the small courtyard of East Ancient Alley, the sword that was about to be swung suddenly froze for a split second.<br/><br/>Huangfude’s face flashed an unnatural deep red hue. Oblivious to this, he was staring fixedly in Gu Yang’s direction.<br/><br/>This young man had given him one surprise after another.<br/><br/>Resisting a cultivator of the Divine Power Realm with only the cultivation of First Rank Peak.<br/><br/>He was curious to see how far this young man could go.<br/><br/>Inside Qian Mansion, Wu Er had already slipped away the moment Shen Luo locked onto Gu Yang. He also grabbed a bottle of wine along the way and hid nearby to watch the show.<br/><br/>When he saw Gu Yang’s outburst, he almost choked on his wine and was dumbfounded.<br/><br/>“No wonder that old geezer from the Shen family values this technique so much  ”<br/><br/>PS: First update, looking for monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}