{"id": 141, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310346.html", "title": "Chapter 141 - Chapter 141: Chapter 141: Is The Young Master Short Of Money? (Third Update, Asking For Monthly Tickets)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 141 - Chapter 141: Chapter 141: Is The Young Master Short Of Money? (Third Update, Asking For Monthly Tickets)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 141: Chapter 141: Is the young master short of money? (Third update, asking for monthly tickets)<br/><br/>Translator: 549690339<br/><br/>Gu Yang asked again, “How much cash silver can be withdrawn at most without affecting the daily operation of the royal mansion?”<br/><br/>Since Prince Jinghai was so generous, he would not be so unreasonable as to drain all the mansion’s money. There ought to be some left to cover daily expenses.<br/><br/>Such a large royal household indeed has a significant monthly expenditure.<br/><br/>Spring Peach didn’t know why he asked this, but she silently calculated in her mind, and gave her answer, “Approximately five million can be withdrawn. May I ask why my young master asks this?”<br/><br/>The amount satisfied Gu Yang, “Good, I will need Miss Spring Peach’s help tomorrow to withdraw that five million taels.”<br/><br/>Spring Peach was surprised and stammered, “Gu  Master Gu, this  such a large  amount, I  I can’t withdraw  ”<br/><br/>In the mansion, there is a system. Anything less than ten thousand, she can withdraw at will. But several million taels are in a separate vault. The key is divided into four parts: the princess consort and three accountants each keep a part, and all four parts combined can open the vault.<br/><br/>Not to mention her, even the princess consort needs a command from the prince, if she wants to withdraw such a large sum of silver.<br/><br/>Gu Yang took out the token that Prince Jinghai gave him earlier, “How about with this?”<br/><br/>Seeing the token, Spring Peach’s eyes widened in disbelief.<br/><br/>This was the jade token the prince carried with him. With this token, one can relay his commands. They wouldn’t hesitate to obey, whether to withdraw money or command the city’s defense army.<br/><br/>This important token was given to Master Gu by the prince.<br/><br/>This<br/><br/>This was completely unlike what she had thought.<br/><br/>Previously, she had worried that the prince, due to the princess consort’s affair, would become enemies with Master Gu. However, the prince gave him his jade token.<br/><br/>This showed the prince’s trust in him.<br/><br/>Pei Qianlan, who was by her side, was also stunned. She couldn’t figure out why the prince would give the jade token to Gu Yang.<br/><br/>They just couldn’t understand men’s friendships.<br/><br/>Seeing her reaction, Gu Yang asked with a frown, “Can’t it be done?”<br/><br/>“No no no  it can  ”<br/><br/>Spring Peach hurriedly answered, but the more she spoke, the more flustered she became, “What I mean is, it can be withdrawn. You can withdraw as much as you want.”<br/><br/>It seemed that Prince Jinghai hadn’t been bluffing him.<br/><br/>Gu Yang nodded and said, “Alright, come find me tomorrow morning.”<br/><br/>After discussing the business, he escorted them back to the royal mansion. He did not stop until they reached the entrance of their sleeping quarters.<br/><br/>“Oh, right.”<br/><br/>Before parting, Gu Yang remembered something and said to Pei Qianlan, “I’ve guessed the answer to the question I asked you. And I understand, it’s not your fault.”<br/><br/>After saying that, he left.<br/><br/>Looking at his retreating figure, Pei Qianlan’s eyes became moist.<br/><br/>Although others tried to hide from her what happened with Wu Xingyun, a paper can’t cover the fire, and she still heard some rumors.<br/><br/>As a result, many elders in the mansion resented her, and she was unpopular. Moreover, the prince was rarely present at the mansion.<br/><br/>On the surface, she was the lady of the mansion, but in reality, she could only command a few maids in her courtyard. For anything else, she had to consult with several stewards.<br/><br/>If the stewards didn’t cooperate, she couldn’t do anything in the mansion.<br/><br/>Put plainly, she was just a figurehead.<br/><br/>Early the next morning, Spring Peach came over and accompanied Gu Yang to the accounting room.<br/><br/>He finally saw the power of the jade token he held: as soon as he revealed it, everyone immediately took out their keys, opened the vault, and carried out boxes of gold and silver.<br/><br/>No one questioned his identity, nor did they question why he needed to withdraw so much money.<br/><br/>Gu Yang had the gold and silver transferred to his house. The mansion sent a group of guards to lead the way, causing a stir and discussion among the people on the street.<br/><br/>After a busy morning, all the silver was finally transferred. Once the amount was confirmed, the people from the mansion promptly left.<br/><br/>Unlike them, Spring Peach stayed behind.<br/><br/>“Is there anything else?”<br/><br/>Gu Yang wanted to hurry back and charge all that silver into his system, looking forward to sending her away as soon as possible.<br/><br/>Seeing that there was no one else around, Spring Peach whispered, “Do you lack silver, my lord?”<br/><br/>“Yes, I do.”<br/><br/>“Master   She asked this servant to relay a message that if you are in need, the Pei family still has some wealth left, you can take it freely.” Spring Peach originally wanted to say “my mistress”, but changed her words to “her” when it came to actually saying it.<br/><br/>Gu Yang shook his head and said, “How could I accept the princess’s money?”<br/><br/>He is a man of principle. He did save Pei Qianlan in the past, but she repaid him last night when she unsheathed her sword.<br/><br/>The first time didn’t count as she was injured by him and it was only right that he helped her.<br/><br/>Now he owed her nothing, so why should he accept her money?<br/><br/>Spring Peach said, “The assets of the Pei family, when sold, and added to her savings over the years, should amount to around ten million taels.”<br/><br/>Ten   million?<br/><br/>Gu Yang was astounded. What a surprise, she was actually fabulously wealthy.<br/><br/>Even the savings in the royal mansion amounted to a little over seven million taels, her worth exceeded ten million taels.<br/><br/>Indeed, appearances can be deceiving.<br/><br/>After Spring Peach finished speaking, she took out a red wooden box from her bosom, saying, “This contains her savings over the years, amounting to two million taels, all dividends from the businesses under the Pei family’s name. In half a month at most, the shares of those businesses should be fully sold off. I will bring the money to you then.”<br/><br/>Gulp.<br/><br/>Gu Yang instinctively swallowed.<br/><br/>Ten million taels, equivalent to twenty times the amount used in cultivation simulation.<br/><br/>Combined with the five million taels he had now, he would have thirty rounds of cultivation simulations. Reaching the peak of the First Rank would definitely not be a problem.<br/><br/>Gu Yang reached out confidently to take the wooden box, saying, “If the princess has any orders in the future, even through fire and water, I will never refuse.”<br/><br/>He had initially intended to refuse, but the amount she offered was just too large.<br/><br/>Upon hearing his words, Spring Peach said quietly, “I can only hope that you will not let down her goodwill.” After speaking, she bowed and left.<br/><br/>Gu Yang looked at the delicately made red wooden box in his hand, with a faint fragrance to it.<br/><br/>Even if he was slow, by now, he could not possibly fail to guess at Pei Qianlan’s feelings for him.<br/><br/>If one were to say that she desperately drew her sword last night to repay him for saving her life<br/><br/>Now, handing over her entire fortune and selling off her family assets just to give him all the money   If he were to say that she was repaying a debt of gratitude, he wouldn’t believe it himself.<br/><br/>But why?<br/><br/>Gu Yang was stumped. He had only met Pei Qianlan a couple of times, how could she have developed feelings for him?<br/><br/>It was puzzling indeed.<br/><br/>“This is a bit of a problem now.”<br/><br/>Just yesterday he was promising Prince Jinghai that there was nothing between him and the Princess. Given the current situation, how was he going to explain things?<br/><br/>While Gu Yang was pondering, he returned to his courtyard to see Xu Ruomei practicing her sword skills.<br/><br/>Despite having completely lost her cultivation level, she had never slacked off in her training. This was a habit formed over a decade and could not be changed.<br/><br/>“Gu Yang, you’re back.”<br/><br/>Xu Ruomei saw him and stopped, her face flushed and beads of sweat at the tip of her nose. In her clear and bright eyes, his reflection could be seen.<br/><br/>A thought struck Gu Yang and he suddenly asked, “Ruomei, do you like me?”<br/><br/>“What   What nonsense are you talking about?”<br/><br/>Xu Ruomei’s face turned beet red, she seemed so embarrassed that she turned and ran away.<br/><br/>Gu Yang stood where he was, looking up at the sky, thinking about the women he had met since leaving Liu Family Village. Su Qingzhen, Ling Ling, Xu Ruomei, Chu Xiyue, Pei Qianlan…<br/><br/>He wasn’t sure about Chu Xiyue, but the rest seemed to have at least some degree of affection for him.<br/><br/>He couldn’t help touching his face, murmuring to himself, “So, it turns out that I’m quite charming? Could it be that my charm was sealed when I was on Earth?”<br/><br/>[Recharge successful, your current balance is six million and ten thousand.]<br/><br/>After topping up, Gu Yang looked at the balance, feeling pleased. Once he exchanged those two million taels, he would have over eight million in total.<br/><br/>Then, he could aim to reach the peak of the First Rank in one go. Even if Shen Po, the head of the Shen family came, he would have the confidence to fight him.<br/><br/>PS: Third update, looking for monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}