{"id": 144, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310355.html", "title": "Chapter 144 - Chapter 144: 144 First Rank Peak (Third Update Asking For Monthly Tickets)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 144 - Chapter 144: 144 First Rank Peak (Third Update Asking For Monthly Tickets)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 144: 144 First Rank Peak (Third update asking for monthly tickets)<br/><br/>Translator: 549690339<br/><br/>After about half a day, the Sword Saint finally descended from the sky and landed in the yard. He said, “Within a few months, that disciple of the Nether Sect won’t come again.”<br/><br/>Gu Yang gave a polite bow and solemnly said, “Thanks to your intervention, elder.”<br/><br/>This was heartfelt appreciation. It was because of the Sword Saint’s intervention, attacking and injuring the powerfully-maned disciple of the Nether Sect, that Gu Yang’s dead-end was broken.<br/><br/>If the Sword Saint didn’t heed his plea, he would be helpless.<br/><br/>Therefore, he was incredibly grateful.<br/><br/>Perhaps the other person did not realize that his intervention just saved Gu Yang’s life.<br/><br/>Now, all Gu Yang needed to do was wait for Jing Haiwang to break through.<br/><br/>Only the golden-bodied disciple of the Shen family was left, who couldn’t cause any more trouble.<br/><br/>With the matter concluded, he took his leave.<br/><br/>Huangfude suddenly said, “Young friend, if you have spare time, you can come here and join me for a cup of tea.”<br/><br/>Before this, his attitude towards Gu Yang had been for the sake of Jing Haiwang’s face. Now, he was truly seeing the young man in a new light.<br/><br/>“Yes.”<br/><br/>Gu Yang was naturally happy to make friends with the Sword Saint. Even though he had injuries, he was incomparable to an ordinary Divine Realm cultivator.<br/><br/>After leaving the unassuming courtyard, the gloom in Gu Yang’s heart was swept away, a deadly situation was just solved like that.<br/><br/>Having only used the simulator four times, one could say efficiency was incredibly high.<br/><br/>He remembered how he had been killed countless times by Yi Yi in the simulator in the past, to find a solution.<br/><br/>Conveniently, on the way back, he made a detour to the money tree and cashed all the two million silver tickets given to him by Pei Qianlan.<br/><br/>The bank told him it would take two days to gather such a large amount.<br/><br/>Gu Yang could only wait two more days.<br/><br/>Even in a city like Jingzhou, known for its thriving commerce, it would still take the largest bank two days to gather two million silver coins.<br/><br/>One could imagine how hard it was to manage the physical silver coins.<br/><br/>He thought about the Xia Dynasty treasure again<br/><br/>Right!<br/><br/>Thinking of the treasure, Gu Yang naturally thought of the pirates, after all, he would often watch Pirate King when he was young.<br/><br/>Wasn’t the father of Lei Hao of Dragon Gate Island a Pirate King?<br/><br/>Since he was a Pirate King, it was normal for him to leave a large amount of treasure after his death.<br/><br/>Pirates are always looting, naturally, they wouldn’t put the looted money in the bank, and certainly not all their money in their lair.<br/><br/>As the son of the Pirate King, most of that wealth must have been inherited by Lei Hao.<br/><br/>This was a road to riches.<br/><br/>Gu Yang’s eyes sparkled.<br/><br/>After Jing Haiwang breaks through to the Divine Realm, he’d find an opportunity to persuade him to make an early attack on Dragon Gate Island; not only to avenge Pei Qianlan’s parents but also to quickly treat Pei Qianlan’s injuries.<br/><br/>This was a trifecta of good fortune.<br/><br/>After two days, Gu Yang went to the bank and exchanged over two million taels of silver for physical silver; a portion in gold and a part in silver, and hired people to carry it back to the mansion.<br/><br/>After the people left, he loaded all the money into the system, and the balance became six hundred and thirty thousand.<br/><br/>Just as Gu Yang was about to start the simulation, he suddenly heard footsteps outside. His heart moved, and he stood up, opened the door, and walked out.<br/><br/>He saw Xu Ruomei in a white dress gracefully approaching from outside, her hands behind her back, her eyes downcast, not daring to look at him. Her shy demeanor held a different kind of charm.<br/><br/>She stopped in front of him, seeming to finally muster the courage to take out the object hidden behind her, handed it to him, and whispered, “I’m giving this to you.”<br/><br/>After saying this, her ears were flushed red, and she turned and ran.<br/><br/>Gu Yang watched her floating figure, stunned, “When did she recover her cultivation?”<br/><br/>When he had seen her last time, she had no trace of True Essence in her body.<br/><br/>In just two days, she had amazingly recovered to the sixth-grade cultivator level.<br/><br/>“Could it be, the question I asked her that day?”<br/><br/>Gu Yang didn’t know how to feel about this. With the evil sword technique she was cultivating, the higher her cultivation, the closer she was to severing her ties with the mortal world.<br/><br/>He lowered his gaze to the object in his hand. It was a sachet, finely embroidered and filled with various fragrant herbs. Among them, there was also a strand of hair.<br/><br/>She was expressing her feelings through actions.<br/><br/>Gu Yang muttered to himself, “You asked for this.”<br/><br/>To be honest, he had thought about persuading Xu Ruomei to switch to a different cultivation technique but had always hesitated.<br/><br/>Their relationship being as it is, persuading her to change her cultivation technique would be somewhat akin to betrayal. He felt he was not entitled to that extreme measure.<br/><br/>Now, it was too late. Her cultivation level had begun to recover, it was pointless now to convince her to change her cultivation technique.<br/><br/>Gu Yang sighed, put away the sachet, returned to his room, and turned on the system.<br/><br/>[Would you want to use the Life Simulator? Each offer uses up 500,000 coins.]<br/><br/>“Yes.”<br/><br/>[   Days later, Wang Jinghai broke into the divine power realm, a powerful cultivator of the Golden Body realm made an attempt to launch a surprise attack and was surprised and repelled by a sword brought down from heaven.]<br/><br/>[Two months later, Wang Jinghai led his troops to Dragon Gate Island. After a fierce battle, Lei Hao was killed on the spot. Pei Qianlan, using Dragon Washing Pond, healed her injuries, and further improved her strength.]<br/><br/>[Two years later, you quietly took Su Qingzhi, Xu Ruomei, Pei Qianlan, and others to Tianzhu Mountain to enter a secret realm.]<br/><br/>[  ]<br/><br/>[Twenty-eight years later, a large-scale battle between Celestial Beings broke out in the outside world. The entrance to the secret realm was exposed, forcing you to leave the realm. You were then pursued by a Mana realm cultivator from the Wanxiang Gate. By this time, all three women had achieved the Golden Body realm, protecting you while you fled.]<br/><br/>[Another year later, several divine power cultivators from the Wanxiang Gate arrived. All of you were killed in the battle, you lived till the age of fifty-four.]<br/><br/>A wave of happiness rose in Gu Yang’s heart. He lived a year longer than before, that was a gain.<br/><br/>Being able to live a year longer was thanks to the addition of Pei Qianlan. All three women had achieved the Golden Body realm. Together, they could keep a mana realm cultivator at bay. Their strength, in the end, attracted several divine power realm cultivators to attack.<br/><br/>This proved that they were all exceptionally talented, it was a pity they did not have enough time. Otherwise, the world would have had three more female sword saints.<br/><br/>[Simulation complete, you can keep one of the following]<br/><br/>Gu Yang directly chose one.<br/><br/>Following this, the simulation was repeated until he reached the seventh simulation.<br/><br/>[  you reach the pinnacle of the First Rank  ]<br/><br/>[   lived till the age of fifty-four.]<br/><br/>Seeing the phrase “Pinnacle of First Rank”, Gu Yang was startled.<br/><br/>Finally, I’ve reached the pinnacle of the First Rank!<br/><br/>It was strange, he didn’t feel too exhilarated; possibly because it had taken too much time, so much that he had grown numb to it.<br/><br/>He’d lost count, after reaching the First Rank, how many simulations he’d run or how many years of cultivation power he’d accumulated.<br/><br/>[Simulation complete, you can choose to keep one of the following:]<br/><br/>[One, the Martial Arts Realm at fifty-four years old.]<br/><br/>[Two, the Martial Arts experience at fifty-four years old.]<br/><br/>[Three, life wisdom at fifty-four years old.]<br/><br/>“I choose one.”<br/><br/>In an instant, Gu Yang felt the phoenix in his mind come alive. It soared, circling over his head, giving a clear cry, and freely soaring in the air.<br/><br/>Deep down, he felt that if he were to undergo Nirvana this time, an unprecedented transformation would take place.<br/><br/>Gu Yang suppressed his impulse.<br/><br/>Now, was not the right time.<br/><br/>The remaining balance of his system was only 230,000. With only four simulations, it was far from enough.<br/><br/>At the very least, he needed to wait until Pei Qianlan’s money was in place and he had obtained the wealth from Dragon Gate Island. Only then would it be sufficient.<br/><br/>Simultaneously, in a secret realm far away from Jingzhou City, an immense palace sat. In the backyard, there stood a gigantic tree that reached from the earth to the heavens. It had jade-like transparent branches and emitted a life force so strong it was as if it was at its peak.<br/><br/>Suddenly, an overwhelmingly powerful voice echoed, “Master, it’s the master’s scent.”<br/><br/>The voice was brimming with excitement.<br/><br/>“Bring him!”<br/><br/>From the outside, a green figure flew in and respectfully bowed, “Greetings, Sir.”<br/><br/>The amplified voice instructed, “Go to the human realm, find Shen Yun, and bring back that one who has cultivated ‘Phoenix Dance Nine Heavens’. Remember, bring him back alive.”<br/><br/>“Yes.”<br/><br/>The green figure disappeared promptly.<br/><br/>PS: It’s the weekend, seeking monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}