{"id": 143, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310352.html", "title": "Chapter 143 - Chapter 143: Method Of Breaking The Game 143", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 143 - Chapter 143: Method Of Breaking The Game 143</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 143: Method of Breaking the Game 143<br/><br/>Translator: 549690339<br/><br/>“No wonder even Xu Ruomei’s Wu Xingyun didn’t know this. They are far from reaching the Divine Power realm in cultivation, so there’s no need for them to know and add unnecessary worries.”<br/><br/>Gu Yang thought to himself, another question arose, “Why would the Nether Sect want to cultivate so many undead at the Divine Power realm?”<br/><br/>The old man calmly said, “What do you think is the ultimate pursuit for a powerful being in the Unleaking realm?”<br/><br/>Gu Yang understood. The goal of any martial artist is to reach higher realms.<br/><br/>Just like himself, toiling to make money for the sake of attempting to break into Divine Power realm.<br/><br/>Just like the Sword Saint in front of him, who also aimed to break into the Unleaking realm.<br/><br/>Those two powerful beings in the Unleaking realm from Nether Sect, despite all these years, didn’t come out to dominate the world, so their goal must have been to break into the Celestial Being realm.<br/><br/>This is indeed very difficult.<br/><br/>The trouble with the Shen Family was already making him distressed, and now there’s an even more terrifying Nether Sect.<br/><br/>While Gu Yang was sighing, a thought suddenly arose in his mind, “Senior, since all beings in the Divine Power realm are currently in hibernation. Do you think it’s possible that the people from the Nether Sect would wait like a sitting duck, guarding in Jingzhou, then make a move to attack as soon as they detect any sign of breakthrough from the Prince?”<br/><br/>This was almost certain. During the previous simulation, the Prince of Jingzhou broke into the Divine Power realm after several years, through a duel with the second-ranked person on the First Rank list, and a powerful being at the Mana realm from Nether Sect appeared right on time. This couldn’t possibly be a coincidence.<br/><br/>There was only one possibility, that this powerful being from the Nether Sect had been keeping guard nearby, waiting for the day when Jingzhou’s Prince broke through.<br/><br/>Moreover, this powerful being from the Mana realm was very patient, having waited for so many years. It was clear that they were determined to get Jingzhou’s Prince, and they aimed at the Divine Power realm Jingzhou’s Prince.<br/><br/>Jingzhou’s Prince, as the first-ranked person on the First Rank list, was too noticeable.<br/><br/>Another detail is that during the previous simulation, when Jingzhou’s Prince broke through after several years, the Sword Saint did not take action.<br/><br/>This implies that once he went to the Divine City in search of the Xia Dynasty’s treasure, he never returned.<br/><br/>The old man said, “It’s not impossible.”<br/><br/>Gu Yang saw a light at the end of the tunnel, and asked, “Senior, where do you think that person from the Nether Sect might be hiding?”<br/><br/>The old man smiled, “Are you planning to proactively attack and kill the Nether Sect members hiding nearby?”<br/><br/>“Do you see any problem with that, senior?”<br/><br/>The old man calmly spoke, “I won’t lie, my body is injured, I can only wield two swords at most. If the person who comes is at the Mana realm, we won’t be able to keep him at bay. Furthermore, I won’t be able to take action again for a month.”<br/><br/>Gu Yang was surprised, the old man was even revealing this, it wasn’t an ordinary trust.<br/><br/>When the old man caught sight of his surprise, he smiled, “Since the token ended up with you, it proves that you are someone Wu’s kid trusts.”<br/><br/>So that’s it.<br/><br/>Gu Yang finally understood. It looked like the jade token was a token of trust between them.<br/><br/>He spoke, “Senior, you may not know. The Prince has already started his retreat after obtaining the divine sword. He should be able to start attempting to break into the Divine Power realm in three to five days.”<br/><br/>“Oh?”<br/><br/>The old man’s eyes lit up. He scrutinized Gu Yang for a while, and started contemplating deeply. He slowly spoke, “If the person from the Nether Sect is at the Mana realm, the place he hides in shouldn’t exceed three hundred miles. Any farther, and he won’t be able to make it in time.”<br/><br/>In other words, within the radius of three hundred miles, such a large range, how should they find a hidden Divine Power realm expert?<br/><br/>Gu Yang asked, “Senior, do you have a way to locate that person?”<br/><br/>“I do have a method, but it requires your cooperation.”<br/><br/>“Please do explain, senior.”<br/><br/>“If you unleash the Thunder Judgment again, it will certainly alarm them. As soon as that person reveals his aura, I will be able to pinpoint his location.”<br/><br/>“Thunder Judgement?”<br/><br/>The old man explained, “When using this move, the commotion is somewhat similar to that of attempting to break through into the Divine Power realm.”<br/><br/>Gu Yang then understood. He spoke up, “Please wait a moment, Senior. I will be back shortly.”<br/><br/>After that, he left the small courtyard.<br/><br/>When he returned to his place, Gu Yang opened the system and ran a simulation, using it to predict the outcome of his journey.<br/><br/>The Sword Saint was inscrutable, he was worried about being found out if he used the simulator there, so he made up an excuse to leave.<br/><br/>A moment later<br/><br/>A glimmer of delight flashed in Gu Yang’s eyes. This time, it’s settled.<br/><br/>Half an hour later,<br/><br/>Huangfude saw Gu Yang again and felt that he was a bit different from before, he couldn’t help but take another look.<br/><br/>“His True Essence has become profound!”<br/><br/>This judgement sent a shock through his heart.<br/><br/>He has cultivated to this level now and hardly anything can stir his heart. But the matter before him was too strange and had already exceeded his comprehension.<br/><br/>In just half an hour, the True Essence of this young man in front of him has increased by nearly ten percent.<br/><br/>This was simply beyond comprehension.<br/><br/>Or could it be that his vision had become so blurred that he could even mistake the cultivation level of a First Rank warrior?<br/><br/>Gu Yang felt uneasy under his gaze, he knew that it must be because he had seen the sudden increase in his cultivation level.<br/><br/>He regretted it a bit. Had he known earlier, he would not have accepted the reward from the simulator.<br/><br/>However, he just couldn’t resist it. Like when he was on Earth, seeing a notification popping up on WeChat, he couldn’t resist opening it and checking the message.<br/><br/>He forced himself to ask, “Senior, what’s wrong?”<br/><br/>Huangfude took a deep look at him and said, “We can start now.”<br/><br/>He did not ask any more questions, everyone has their own secrets. No matter how shocking the secret of this young man’s surge in True Essence is to him, it is meaningless.<br/><br/>“Okay.”<br/><br/>Gu Yang didn’t waste any more words. He picked up the Phoenix Feather Knife, and a crackling sound came from his side. His eyes seemed to be covered with a gleaming purple light, and he emitted a destructive aura.<br/><br/>Huangfude was taken aback by what he saw, the power of this move was more than doubled from a few days ago.<br/><br/>This means that either he had held back that night.<br/><br/>Or his strength has more than doubled in just a few days.<br/><br/>Even the few bizarre figures in history, such as Qin Wu from the Qin Family and that woman from the academy who appeared twenty years ago, their cultivation levels have never improved as rapidly.<br/><br/>This young man must be hiding a huge secret.<br/><br/>Could it be, he is reincarnated from a great ancient power?<br/><br/>Huangfude’s heart jumped, even a Celestial Being does not possess the ability to reincarnate.<br/><br/>But in ancient times, there were beings above the realm of Celestial Beings, who were like real immortals and buddhas, possessing various incredible Divine Powers and Immortal Methods.<br/><br/>Such beings like these, even after thousands of years have passed, may not necessarily disappear. They might possess the ability to reincarnate.<br/><br/>Huangfude thought of this and felt a bit more cautious towards the young man in front of him.<br/><br/>At this moment, Gu Yang’s momentum had reached its peak, and there were sudden bursts of thunder in the sky. The sound echoed throughout Jingzhou City, startling many people.<br/><br/>Hundreds of miles away, in a seldom-visited valley, even during the daylight, a dense black mist filled the surrounding area.<br/><br/>Suddenly, the black mist swirled, a shadow reached out from it and made a puzzled sound, “Hmm? This aura again   Hmph!”<br/><br/>Then, the black shadow retracted, and everything returned to tranquility.<br/><br/>“I’ve found him.”<br/><br/>At the same time, a sharp light flashed in Huangfude’s eyes. He rose into the sky and, with a swish, flew away, disappearing into the horizon.<br/><br/>Gu Yang was full of admiration. Isn’t this pretty much the same as an immortal?<br/><br/>He wondered when he could reach such a realm.<br/><br/>He sat in the pavilion, waiting patiently.<br/><br/>He had simulated the situation earlier and already knew the result, so he was not worried at all.<br/><br/>“I wonder if there is any gold or silver in the treasure of the Xia Dynasty.”<br/><br/>Gu Yang couldn’t help but think of the treasure of the Xia Dynasty when he was idle.<br/><br/>Of course, it was just a thought.<br/><br/>The value of the treasure, which made this Sword Saint run errands, was as self-evident as the number of people above the Divine Power realm who were eyeing it.<br/><br/>During that simulation, this Sword Saint was caught in a melee, and he was killed by the Shen Family’s Divine Power realm in a surprise attack.<br/><br/>PS: Second update, seeking monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}