{"id": 149, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310370.html", "title": "Chapter 149 - Chapter 149: 149 A Single Strike Breaks The Golden Body", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 149 - Chapter 149: 149 A Single Strike Breaks The Golden Body</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 149: 149 A Single Strike Breaks the Golden Body<br/><br/>Translator: 549690339<br/><br/>“What?”<br/><br/>Shen Luo looked at the huge phoenix phantom at the top of Gu Yang’s head, felt the unbelievably massive True Essence around him, and his mind trembled.<br/><br/>This was simply unheard of, unseen before.<br/><br/>That power was even greater than his.<br/><br/>This boy was just a First Rank. Even if he had already developed an untainted body, he should not be able to hold such a huge power.<br/><br/>“Is this the secret of the ‘Phoenix Dance Nine Heavens’?”<br/><br/>A brutal smile flashed across Shen Luo’s face.<br/><br/>If he thought he could challenge him in this way, it would be too naive.<br/><br/>Let me let you know what Divine Power is!<br/><br/>Giant Strength Divine Power!<br/><br/>Suddenly, it seemed as if space itself had collapsed, and the force on his fist increased several times.<br/><br/>Under the terrifying pressure, a vacuum seemed to be formed in front of him.<br/><br/>Not far away, Gu Yang’s body was violently oscillating with red flames.<br/><br/>Even though the fist hadn’t arrived yet, the Protective Gang Qi around his body had almost been penetrated.<br/><br/>These were Divine Powers only strong beings in the Divine Realm could master. After reaching the Golden Body Realm, not only were they immune to weapons, but they also awakened the Giant Strength Divine Power, possessing the strength of deities once used.<br/><br/>To the martial artist in the Mortal Realm, Divine Power is no different from that of celestial beings.<br/><br/>Gu Yang suddenly felt the pressure increase manifold, that dreadful force, not even close yet, almost shattered his Protective Gang Qi.<br/><br/>It’s still not enough!<br/><br/>Again!<br/><br/>The phantom of the phoenix above his head lifted its head and let out a phoenix cry that resonated through heaven and earth, and then, a greater force rushed over.<br/><br/>At this moment, all the True Essence that the phoenix had devoured during his daily cultivation, and all the Cultivation Level that had disappeared during the eight rebirths from Nirvana, were all fed back.<br/><br/>This power seemed to be endless.<br/><br/>Gu Yang stared at his enemy in front of him, and hacked out with the Phoenix Feather Knife in his hand.<br/><br/>This slash contained the power that he had accumulated over countless simulations, almost a thousand years of hard work.<br/><br/>“Heavenly Inquiry Nine Knives” first knife, when the heaven and earth were still undifferentiated, who was it who cut through the chaos?<br/><br/>I will cut it with one slash!<br/><br/>“Hiss”<br/><br/>Not far away, Wu Er, seeing the slash that Gu Yang had swung out, unconsciously opened his mouth, inhaling a breath of cold air.<br/><br/>Just three days of time, and without the legacy of Blade Intent, this boy not only grasped the Blade Intent itself but also completely mastered this slash.<br/><br/>What kind of monster is this?<br/><br/>He randomly scratched his messy beard while his other hand had pulled out a beard without realizing it.<br/><br/>Eastern Ancient Alley.<br/><br/>“Heavenly Inquiry Nine Knives?”<br/><br/>Huangfude also recognized this slash at last, and his pupils contracted.<br/><br/>Back then, he hadn’t fought with Wu Shengtian, but he was well-known for the Saber Technique he had created, which was like a thunderbolt piercing his ears.<br/><br/>He had also considered this second-ranked person from the Wu Family as a formidable enemy.<br/><br/>It was said that this Wu Shengtian was stunningly bright, even surpassing his ancestors. He combined the strengths of all families and created himself a “Heavenly Inquiry Nine Knives”. With just three slashes, he had already won unbeatable praise throughout the world.<br/><br/>Later, he broke through to the Unleaking Realm, and was considered the person most likely to achieve the status of a Celestial Being after the one in the academy.<br/><br/>The Wu Family of that year was undoubtedly the head of the top ten families in the world, with two persons in the Unleaking Realm.<br/><br/>But, he did not appear in that great war.<br/><br/>It was said that a Celestial Being intervened and eliminated him.<br/><br/>If not, it was still uncertain who would have won in that battle.<br/><br/>How does Gu Yang have this person’s saber technique legacy?<br/><br/>“It’s still rising!”<br/><br/>On the other side, Gu Lao swallowed somewhat difficultly. Under his vision, he could see that Gu Yang’s power at this time was all coming from the phoenix phantom above his head.<br/><br/>Though it was only True Essence, when the magnitude of the True Essence reached a certain level, it was extremely terrifying.<br/><br/>“What exactly is that phantom? An Original Spirit left by a great power in ancient times? Or some abnormal treasure?”<br/><br/>Even with his experience, he couldn’t see the origin of that phoenix phantom.<br/><br/>As for the possibility that this power was cultivated by Gu Yang himself, he also just thought about it and immediately denied it.<br/><br/>How old is Gu Yang? Even if he had started training from the womb, how could he possibly amass such enormous strength?<br/><br/>The Mortal Realm is a mere fleshly existence, no matter how talented one is, the amount of True Qi that one can condense is limited. This is the case even for those legendary cultivators.<br/><br/>This vast amount of True Essence would take at least hundreds of years to cultivate. No one can achieve this.<br/><br/>The moment of victory or defeat is imminent now.<br/><br/>Can Gu Yang, a First Rank peak, withstand a punch from a cultivator at the first level of the Golden Body?<br/><br/>Even Gu Lao is unable to predict the outcome of this battle.<br/><br/>“Break!”<br/><br/>The moment his fist came into contact with the blade, Shen Luo’s confident smile suddenly froze.<br/><br/>He was feeling a long-lost pain!<br/><br/>That slash actually broke through his Golden Body, injured his fist, and still had momentum to spare, as if it could split his arm open.<br/><br/>“How is this possible?”<br/><br/>Shocked and furious, his face was filled with disbelief.<br/><br/>He was actually wounded by a little brat in the Mortal Realm!<br/><br/>It had been many years since anyone had been able to injure him since he achieved the Golden Body.<br/><br/>And yet now, he was wounded by a First Rank martial artist.<br/><br/>“What kind of saber technique is this?”<br/><br/>Even in his extreme fury, Shen Luo still remained calm. He didn’t dare to retaliate with brute force against that strike, he quickly retreated instead.<br/><br/>Whoosh!<br/><br/>His whole body seemed to defy inertia. In the next moment, he was already more than a dozen meters away at a greater speed.<br/><br/>This was another divine power he had mastered, the Wind Control Divine Power. It allowed him to travel through the air.<br/><br/>After Shen Luo escaped the range of the blade, he looked down at his bleeding fist. The blade had cut into his hand between his middle finger and ring finger, the wound was several inches deep.<br/><br/>At the wound, there was no blood flowing out, it was as if a flame was continuously burning, causing bone-deep pain.<br/><br/>He looked up at Gu Yang, his eyes filled with deep-seated killing intent, and a voice seemed to squeeze out from his teeth, “Impressive!”<br/><br/>“The Golden Body has been broken—”<br/><br/>Gu Lao glanced at the wound on Shen Luo’s hand, he was momentarily stunned, his voice even wavered slightly.<br/><br/>A First Rank martial artist actually managed to break through a divine power realm strongman’s Golden Body.<br/><br/>Had he not seen it with his own eyes, he really would not have believed it.<br/><br/>In the ancient times, even a First Rank person was just a mortal. Only when one reached the Divine Power did they step onto the path of cultivation. There is a vast difference between these two realms, as vast as the difference between mortals and immortal beings.<br/><br/>For a mortal to injure an immortal is but a pipe dream.<br/><br/>Today, however, he had seen with his own eyes that a mortal, had broken through the Golden Body of a divine power realm strongman and injured him.<br/><br/>Shen Luo was a true divine power realm practitioner, and he was from the prestigious Shen Family who practiced unrivaled techniques. He was incomparable to Lei Hao from Dragon Gate Island, who merely had a Golden Body and no realm comprehension.<br/><br/>The middle-aged man standing beside Gu Lao was also deeply shocked, a hint of surprise gradually emerged in his eyes.<br/><br/>“What a brilliant Heavenly Inquiry Nine Knives!”<br/><br/>In the small courtyard of Donggu Alley, Huangfude praised admirably.<br/><br/>From that one strike alone, one could see the deep level of mastery of Wu Shengtian’s blade technique.<br/><br/>Sadly, he didn’t have the opportunity to cross swords with him back in the day.<br/><br/>“What a pity!”<br/><br/>Not far away, Wu Er couldn’t help but slap his thigh, his face filled with regret.<br/><br/>If Gu Yang’s control was a little more refined, that slash could definitely have severed the opponent’s hand.<br/><br/>But he knew that this kid had tried his best. That power had already exceeded the limit of what his body could handle. To be able to execute that slash was already quite impressive.<br/><br/>It was like a child swinging a giant hammer, suddenly wielding power beyond his limit. A lack of control could lead to disaster.<br/><br/>He would be lucky not to get himself killed, let alone killing others.<br/><br/>“A First Rank managed to injure a divine power realm practitioner. This achievement will most probably go down in history.”<br/><br/>Wu Er praised with admiration.<br/><br/>This kind of event, even those few who had stepped into the realm of Celestial Beings over the past thousand years, hadn’t achieved.<br/><br/>Not to mention Qin Wu, who was the best at overcoming the strong with the weak and had unparalleled combat talents, he didn’t have such a record either.<br/><br/>Not considering the middle ages, this kid was definitely the first in a thousand years.<br/><br/>Wondering how far this kid will grow in the future, perhaps the Wu Family’s great vengeance could really fall onto him.<br/><br/>PS: The second update, seeking monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}