{"id": 145, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310358.html", "title": "Chapter 145 - Chapter 145: 145, Is It Him Again?", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 145 - Chapter 145: 145, Is It Him Again?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 145: 145, is it him again?<br/><br/>Translator: 549690339<br/><br/>In Divine City, it was a rare day of good weather, and the sun rose early.<br/><br/>The normally deserted entrance to the Martial Arts Academy today was unusually bustling. Luxury carriages were parked on the vacant lot outside, indicating that the day’s arrivals were all wealthy or noble.<br/><br/>Today was the biennial grand examination of the Martial Arts Academy. Numerous academy disciples would undergo three days of assessment to determine the top ten, who would then be conferred with the title of Martial Scholar.<br/><br/>During the time of the founder of Great Zhou, there had been immense emphasis on the grand examination of the Martial Arts Academy. For each examination, he would personally appear, and after the top ten Martial Scholars were decided, he would receive them personally.<br/><br/>That was the most brilliant era of the Martial Academy. Scholars from humble backgrounds throughout the nation prided themselves on being admitted to the Academy.<br/><br/>However, the Martial Academy fell into decline afterwards, and the grand examination was increasingly overlooked, even neglected.<br/><br/>Nevertheless, this tradition in the Martial Academy was still continued.<br/><br/>This year’s grand examination attracted many high-ranking officials and nobles. The most stunned ones were the disciples of the Martial Academy.<br/><br/>Such a lively scene was something that the Martial Academy had not experienced for many years.<br/><br/>The disciples were guessing left and right about the reason these individuals had come to attend the ceremony.<br/><br/>However, the instructors of the Martial Academy knew in their hearts that all these people had come for Princess Chang.<br/><br/>Just two days ago, Princess Chang suddenly had someone send a letter stating that she would host the competition at the Martial Academy.<br/><br/>Divine City was not short of well-informed individuals, many caught wind of this quickly, and all gathered at the Martial Academy on this day.<br/><br/>Unlike the disciples’ excitement, the instructors of the Martial Academy were all filled with worry.<br/><br/>The Martial Academy had always practiced caution, not getting involved in the power struggles of the court.<br/><br/>This was the key to the Martial Academy’s survival.<br/><br/>Now, Princess Chang’s move undoubtedly brought the academy into the limelight. In the eyes of others, it was as if the academy had branded itself with Princess Chang’s faction.<br/><br/>The most troublesome part was that they could not refuse at all.<br/><br/>From now on, the Academy would perhaps be forced into the struggle between Princess Chang and that person in the palace.<br/><br/>This was the sorrow of the weak who didn’t even have the space for a choice.<br/><br/>At the end of the road, a Phoenix palanquin slowly drove in, guarded by fully armored escorts from front to rear. It was the vehicle of Princess Chang.<br/><br/>A group of people appeared at the gate of the Martial Academy to welcome Princess Chang’s arrival.<br/><br/>Inside the Phoenix Palanquin.<br/><br/>Gu Yunfei sat on a brocade stool, eyes poised, appearing calm but his palms were already sweating.<br/><br/>In front of him was a curtain, behind which sat a tall figure, who, at such proximity, imposed immense pressure on him.<br/><br/>This pressure didn’t come from the status or noble lineage of the opposite party. These meant nothing to a second-grade martial artist.<br/><br/>“The rumors are indeed true. Princess Chang has really reached the Divine Power Realm!”<br/><br/>When Gu Yunfei first saw Princess Chang, he was shocked by the immense pressure that emanated from her body.<br/><br/>This was clearly the suppression of the Divine Power Realm.<br/><br/>No wonder Princess Chang had been so assertive these past years. It turned out she had such a strong foundation.<br/><br/>While Gu Yunfei was thinking about this, he did not dare to reveal any of it on the surface.<br/><br/>Because there had always been rumors about the royal family’s cultivation techniques.<br/><br/>The cultivation method practiced by the royal family progressed rapidly but also had great side effects. Each of the emperors in the history of Great Zhou, starting from the founder, had great character flaws.<br/><br/>For example, the founder of Great Zhou became extremely suspicious in his old age, inciting several purges, almost exterminating all his meritorious officials.<br/><br/>Then there was the late emperor, extremely lascivious, taking in thousands of concubines, indulging in nightly feasts, and even daring to violate the wife and daughter of the Unleaking elder of the Wu Family.<br/><br/>Of the many generations of emperors of Great Zhou, the only relatively normal one was the current emperor. Sadly, he had always been unhealthy and had an ambitious empress as well as a sister who was unwilling to take a back seat.<br/><br/>The current Great Zhou was in political chaos, with the empress and Princess Chang fighting against each other, and several princes showing off their divine powers to compete for the position of the crown prince.<br/><br/>Gu’s family absolutely did not want to be drawn into such a whirlpool.<br/><br/>However, like the Martial Academy, Gu Yunfei also had no room to refuse in front of Princess Chang.<br/><br/>When Princess Chang sent someone to invite him, he was 100% unwilling, but he still came.<br/><br/>After getting in the carriage, Princess Chang did not utter a word.<br/><br/>Just when Gu Yunfei thought that she would remain silent throughout, she finally spoke, “I hear that you and Qin Shang are close friends.”<br/><br/>Her voice was very calm, making it difficult to guess her intention.<br/><br/>Gu Yunfei braved himself to reply, “Yes.”<br/><br/>“In the future, before you make friends, ask the elders of your family for their opinion.”<br/><br/>Gu Yunfei’s heart jumped. This was equivalent to a warning, telling him not to get too close to Qin Shang, “I will heed the advice of Princess Chang.”<br/><br/>Suddenly, the atmosphere in the carriage eased.<br/><br/>Princess Chang then asked, “How is your grand uncle?”<br/><br/>Here it comes!<br/><br/>Gu Yunfei knew, of course, that both the previous fifth prince and now Princess Chang were targeting his grand uncle.<br/><br/>Lately, there were rumors swirling around Divine City that his great-uncle was about to break into the Realm of Mana.<br/><br/>The ones they were truly trying to win over, was his very great-uncle.<br/><br/>“Thank you for your concern, Princess Chang. My great-uncle is perfectly well.”<br/><br/>Just then, the carriage came to a halt.<br/><br/>They had arrived at the Martial Academy.<br/><br/>Gu Yunfei finally took a sigh of relief.<br/><br/>From outside, respectful voices could be heard, “Greetings, Princess Chang!”<br/><br/>As Gu Yunfei stepped out of the carriage, he saw many people standing outside the Martial Academy, many of whom were rumored to be part of the ‘Princess Faction’. In addition to them, there was also faculty from the academy.<br/><br/>Princess Chang descended from the carriage and said, “At ease.”<br/><br/>Suddenly, she turned her head to the side as she seemed to have noticed something.<br/><br/>Gu Yunfei also turned his head following her gaze, to see a hobbling figure appear at the end of the street.<br/><br/>The Ranking Board had been changed again?<br/><br/>A bizarre feeling arose in his heart.<br/><br/>How many times had this happened?<br/><br/>Over the past few months, he had visited the Martial Academy several times, and each time, he had encountered changes on the Ranking Board.<br/><br/>And the first time the changes happened, they were all related to that man.<br/><br/>It couldn’t be him again this time, could it?<br/><br/>Princess Chang remarked, “These past few months, changes on the Ranking Board indeed have been quite frequent. Yunfei, is this Gu Yang really unrelated your Gu Family?”<br/><br/>Gu Yunfei responded with a bitter smile, “I made a special inquiry to my grandfather, and the Gu Family indeed doesn’t have this person.”<br/><br/>“But I heard that your Gu Family’s Phoenix Feather Knife is now in Gu Yang’s possession.”<br/><br/>Upon hearing this, Gu Yunfei’s heart leaped to his throat.<br/><br/>The Phoenix Feather Knife was the Gu Family’s most precious treasure. Very significant to the Gu Family. Later, the Phoenix Feather Knife was stolen by the Shadow Thief, and it’s been a hundred years since then.<br/><br/>He didn’t expect to learn about the whereabouts of his family’s treasure today from Princess Chang, that it was in the hands of this Gu Yang.<br/><br/>He wished he could rush back home immediately to inform his family elders and verify the truth of this matter.<br/><br/>After subtly revealing the whereabouts of the Phoenix Feather Knife to Gu Yunfei, Princess Chang simply looked over at the old man responsible for changing the Ranking Board not far away, as if she didn’t have a care in the world.<br/><br/>Changing the Ranking Board at the Red Mansion wasn’t something that happened often. As it was her first time seeing it, she felt somewhat curious and decided to watch.<br/><br/>If she didn’t move, naturally, no one else would move either.<br/><br/>At a distance, the old man seemed completely unaware of the onlookers that included the current Princess Chang, and carried on with his lackadaisical movements.<br/><br/>He walked over to the First Rank Board and tore off the list that had just recently been put up.<br/><br/>The First Rank Board.<br/><br/>Even Princess Chang’s originally relaxed expression turned a bit more solemn.<br/><br/>Over the years, the Nether Sect had been hunting down the Divine Power Realm practitioners that were out alone. Unless they had absolute confidence in their own strength, or had incredibly important matters, Divine Power Realm practitioners would not easily show themselves.<br/><br/>Under this backdrop, the people on the First Rank Board became of particular importance and at times, a decisive force.<br/><br/>To Princess Chang, a First Rank Martial Artist was far more useful than a Divine Power Realm practitioner.<br/><br/>Changes on the First-Rank Board was something every power structure had to treat seriously.<br/><br/>Just like not long ago, when Gu Yang made it onto the First Rank Board and caused a huge stir.<br/><br/>All the major powers listed this legendary young man as their primary focus and devoted a lot of manpower and resources to investigate his origins.<br/><br/>Princess Chang was no exception. Otherwise, how could she have known about the Phoenix Feather Knife being in Gu Yang’s possession?<br/><br/>Finally, the old man pasted the list back up and left with his bucket.<br/><br/>Princess Chang took a closer look. Her eyes suddenly radiated an intimidating light. Everyone present felt a terrifying pressure; those with lower Cultivation Levels almost collapsed on the ground.<br/><br/>As Gu Yunfei was the closest, he was taken completely off guard. His vision went dark, his chest felt stuffy, as if he could vomit blood.<br/><br/>Fortunately, the pressure appeared quickly and disappeared just as swiftly.<br/><br/>Gu Yunfei disregarded his own injuries and looked at the First Rank Board.<br/><br/>He knew that something must have happened for Princess Chang to lose her composure.<br/><br/>Upon glancing at the board, he sucked in a cold breath.<br/><br/>Only one thought crossed his mind: It can’t really be him!<br/><br/>He saw on the First Rank Board, the tenth name, Gu Yang, sect unknown, from Jiangzhou.<br/><br/>The rest of the people present also saw the newly replaced First Rank Board. The scene fell into an eerie silence.<br/><br/>PS: First chapter, voting for monthly tickets appreciated.\t\t\t\t\t\t</div>", "images": {}, "success": true}