{"id": 151, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310376.html", "title": "Chapter 151 - Chapter 151: 151 Million Images Of The Universe", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 151 - Chapter 151: 151 Million Images Of The Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 151: 151 Million Images of the Universe<br/><br/>Translator: 549690339<br/><br/>“Young Master”<br/><br/>Suddenly, Zhang Xiao Hai rushed in from outside, seemingly with an urgent matter. He had just crossed the courtyard gate when he noticed Gu Yang holding the hand of a strange woman, causing him to halt in surprise.<br/><br/>He was in trouble.<br/><br/>Well aware that he had interrupted Gu Yang’s romantic moment, he turned to leave.<br/><br/>Gu Yang naturally let go of Pei Qianlan’s hand and called him back, “What’s the matter?”<br/><br/>Zhang Xiao Hai lowered his head, doing his best not to look at the strange woman, and said, “A message just arrived from the royal palace. The queen of King Jinghai has passed away due to illness.”<br/><br/>Gu Yang was taken aback, and he glanced towards Pei Qianlan. She had already put her veil back on. When she felt his gaze, she seemed to flinch and lowered her head.<br/><br/>He turned his head to Zhang Xiao Hai and said one sentence, “I understand.”<br/><br/>Zhang Xiao Hai tactfully left them alone, and stayed outside. He couldn’t help but admire in his heart that Gu Yang as always was involved with celestial beauty wherever he went.<br/><br/>Even though it was just a brief glance before, the exceptional appearance of that woman had left a deep impression on him.<br/><br/>She wasn’t inferior in any way to Miss Su or Miss Xu. Each had their own unique charm.<br/><br/>Just as Zhang Xiao Hai had started to move away, he saw the maid, Zhi Xing, approaching with a basket. He quickly stopped her, “The Young Master is in the middle of training. It’s not appropriate to disturb him right now.”<br/><br/>Zhi Xing replied, “I have brought some osmanthus cakes that the young lady made. She asked me to let Brother Gu try them. I will leave as soon as I deliver them.”<br/><br/>Zhang Xiao Hai still obstructed her way, “Better give them to me.”<br/><br/>“What do you mean?”<br/><br/>Zhi Xing was a little angry. She had always had a bad impression of this guy. Last time in Pingjun City, he had slandered Gu Yang which had made the young lady sad for a long time.<br/><br/>“Why don’t you come back later?”<br/><br/>Zhang Xiao Hai was dutifully fulfilling his responsibilities. The Young Master was having a tryst with another woman. He couldn’t let this little girl interrupt them.<br/><br/>“Hmph!”<br/><br/>Zhi Xing gave him a angry glare, snorted, then turned around and left.<br/><br/>Zhang Xiao Hai stayed where he was to avoid any further interruptions.<br/><br/>Back in the yard, Gu Yang looked at Pei Qianlan and asked, “Why did you do this?”<br/><br/>After a while, Pei Qianlan quietly said, “I am no longer worthy of being the queen of Jinghai king’s residence.”<br/><br/>She had another man in her heart so remaining as the queen in the palace was an agonizing predicament for her.<br/><br/>Since she knew she wasn’t in Gu Yang’s heart, she felt disheartened. She faked her own death to escape from the royal palace, and after repaying Gu Yang, she was now alone and wandering in the world.<br/><br/>Gu Yang didn’t know what to say. What a foolish woman.<br/><br/>He called out towards Zhang Xiao Hai, “Xiao Hai.”<br/><br/>Zhang Xiao Hai hurried over, “Young Master, what can I do for you?”<br/><br/>Gu Yang instructed, ” Arrange a courtyard for her.”<br/><br/>Zhang Xiao Hai was taken aback as he thought this was just a tryst. He hadn’t expected Gu Yang to bring her home so soon. Was he playing too dangerously?<br/><br/>Feeling a bit conflicted, he asked, “Should we inform Miss Su and Miss Xu?”<br/><br/>Could it be that the young master couldn’t see the sparks flying between Miss Su and Miss Xu?<br/><br/>Although they seldom engage with each other, the subtle tension was evident when they sat together. He was anxious for the Young Master.<br/><br/>Now with another addition, Zhang Xiao Hai was truly worried there would be a conflict.<br/><br/>Before Gu Yang could answer, Pei Qianlan started speaking, “I have heard a lot about Jade Bone and Yuguilan of the Beauty list. I have long admired them both.”<br/><br/>Gu Yang replied, “Great, tonight, I will introduce you all.”<br/><br/>Seeing Gu Yang’s calm demeanor, Zhang Xiao Hai felt an increasing respect for him. He was indeed bold and confident.<br/><br/>After Zhang Xiao Hai guided Pei Qinlan away, Gu Yang held back the thought of how to explain to Jinghai King. What’s done was done. There was nothing worth worrying about. When the time comes, he would genuinely apologize to him.<br/><br/>Next, Gu Yang converted all the cash in the yard into the system, the balance becoming nine hundred and thirty million. This was the highest amount he had ever had.<br/><br/>According to his calculations, after 18 simulations and the subsequent Nirvana cycle, he would be able to reach the First Rank again.<br/><br/>At his current status, there wasn’t a significant difference between a simple First Rank or reaching the top of the First Rank.<br/><br/>[Would you like to use the simulator? Using it once will cost 500,000 coins.]<br/><br/>“Yes.”<br/><br/>[At the age of twenty-two, you have reached the pinnacle of the First Rank. You broke Shen Luo’s Golden Body with a single blow, shaking the world. You are known as the top of the First Rank world.]<br/><br/>[One month later, the “Gun God” from the Cao family captured you and took you to Ningzhou. There you met Cao Yiyi, who had become a living dead.]<br/><br/>[The “Gun God” used a special technique, allowing your consciousness to enter the Abnormal Treasure, and awaken Cao Yiyi’s godly consciousness.]<br/><br/>[A month later, you were successful in awakening Cao Yiyi. The Cao family wanted to kill you to keep it quiet, but at the crucial moment, Cao Yiyi used an Abnormal Treasure to transport you both to a hidden world.]<br/><br/>[In this strange world, with Cao Yiyi’s Divine Power, you gradually established a foothold. You learned that this place was called the “Wanxiang Dongtian”, a practice field of a super sect known as the Wanxiang Gate.]<br/><br/>[You settled in a remote area. The next year, you started your Nirvana cycle. Three years later, you returned to Eighth Grade.]<br/><br/>“In five more years, you will return to the Seventh Grade.”<br/><br/>“Then, ten years later, you return to the Sixth Grade.”<br/><br/>“After seven more years, on a particular day, the world drastically changes. You come to find that the way to the Wanxiang Heaven’s Gate from the outside world becomes accessible, initiating an invasion from the Wanxiang Gate.”<br/><br/>“After another eight years, you return to the Fifth Grade.”<br/><br/>“Five years later, on one day, the sky gets pierced. A lady dressed in white invades the Wanxiang Heaven’s Gate, throwing the world into chaos, stars hanging upside down. You were affected by this war and died at the age of sixty-two.”<br/><br/>Wanxiang Heaven’s Gate?<br/><br/>Gu Yang hadn’t expected that this simulation would transport him into the Wanxiang Gate’s den.<br/><br/>When he saw the gunmaster from the Cao family appear and capture him, he thought it was the end.<br/><br/>Who would have thought, this time he would end up saving Cao Yiyi’s life.<br/><br/>And then, in turn, Cao Yiyi saved him. She transformed from an insignificant martial artist to a powerful being with Divine Power.<br/><br/>And then, she took him to the Wanxiang Heaven’s gate.<br/><br/>Judging from this, the spatial channel between Great Zhou and Wanxiang Heaven’s gate must have been established by the Cao family.<br/><br/>And finally, who was the woman in white who destroyed the Wanxiang Heaven’s Gate?<br/><br/>The information contained in this simulation was overwhelming. It was too much for him to digest in an instant.<br/><br/>“The simulation has ended, and you can retain one of the following.”<br/><br/>“One, the martial arts level when you were sixty-two.”<br/><br/>“Two, the martial arts experience when you were sixty-two.”<br/><br/>“Three, the wisdom of life when you were sixty-two.”<br/><br/>“Choose the first one.”<br/><br/>Instantly, his True Essence disappeared as his Cultivation Level kept regressing.<br/><br/>Just when the True Essence inside of him had completely vanished, suddenly the phoenix shimmered above his head. A streak of red flame ignited within his body.<br/><br/>In a blink of an eye, he had transformed into a man of fire.<br/><br/>Under the burning flame, his flesh and bones underwent astonishing transformations.<br/><br/>It was only after half an hour that the flames gradually extinguished.<br/><br/>Upon opening his eyes, Gu Yang’s body gleamed like coloured glaze.<br/><br/>“Is this  the Golden Body?”<br/><br/>Feeling his body’s transformation, he was somewhat shocked.<br/><br/>Under the flame’s combustion, his Mortal Body underwent a metamorphic change, akin to forming a Golden Body.<br/><br/>Gu Yang had anticipated a unique change upon his final rebirth.<br/><br/>But he hadn’t expected it could make him congeal a Golden Body early on.<br/><br/>No, to be precise, he had only started to congeal a Golden Body. As of now, he had only acquired the traits of a Golden Body, it wasn’t a complete one yet.<br/><br/>Apart from that, the True Qi in his body had also reached its maximum point. Compared with his time at the Fifth Grade, it was now ten times stronger.<br/><br/>The ultimate martial arts technique that he had used for the last rebirth had finally exhibited its deserved power.<br/><br/>At this moment, although his Cultivation Level was only at the Fifth Grade, if he were to fight, an ordinary First Rank warrior might not be his match.<br/><br/>“Again.”<br/><br/>Gu Yang opened the system again and started a new round of simulation.<br/><br/>” You take Su Qingzhen, Xu Ruomei, and Pei Qianlan and the others to Mount Tianzhu, entering that secret realm.”<br/><br/>“After fifteen years, you return to the Fourth Grade.”<br/><br/>“And then another fifteen years, there is a great battle between Celestials in the outer world, and the entrance to the Secret Realm gets exposed. You all exit the Secret Realm…”<br/><br/>”  A few Divine Power fighters from the Ten Thousand Saint Gate arrive, you all die in battle, at the age of fifty-four.”<br/><br/>After viewing this simulation, Gu Yang breathed a sigh of relief.<br/><br/>He was a bit concerned that the three Divine Power fighters from the Shen family would find their way to the Secret Realm.<br/><br/>But it seems that even these guys from the sacred plains aren’t all-powerful. If he hides in the Secret Realm, they might not be able to locate him.<br/><br/>This essentially means he has increased his odds of survival.<br/><br/>“The simulation has ended, and you can retain one of the following.”<br/><br/>“I choose the first one.”<br/><br/>Rumble!<br/><br/>The phantom of the phoenix appeared again, and Gu Yang’s body was once again engulfed in roaring flames.<br/><br/>PS: Seeking monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}