{"id": 158, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310397.html", "title": "Chapter 158 - Chapter 158: 158 Divine City, Divine City", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 158 - Chapter 158: 158 Divine City, Divine City</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 158: 158 Divine City, Divine City<br/><br/>Translator: 549690339<br/><br/>As night fell, a bonfire was lit beside the waterfall.<br/><br/>Standing on a massive rock, Gu Yang raised his head looking at the boundless starry sky, pondering his next plan.<br/><br/>He felt as if he was just a step away from the Divine Power Realm.<br/><br/>But he knew clearly, this was just an illusion. As for how long it took to cross this one step, it’s unknown.<br/><br/>He still needed money, at least several million.<br/><br/>The crisis was imminent. If nothing unexpected happened, in a month or rather in just over twenty days, Cao Yiyi’s father, the gun god would come looking for him.<br/><br/>The Sword Saint of the East Ancient Alley was injured, he would not be able to withstand this man.<br/><br/>Definitely, he could not stay in Jingzhou.<br/><br/>King Jing Hai was quite loyal, there was no need to involve him.<br/><br/>Besides, even if he managed to escape this crisis, there was a bigger one later. In a year, it was very likely that a strongman from the Sacred Land in the Divine Power Realm would come for him.<br/><br/>Gu Yang knew that he was just a hardworking man, he shouldn’t be thinking of settling down peacefully.<br/><br/>In fact, there was another path. He could take Pei Qianlan and Su Qingzhi and hide in the Secret Realm of Tianzhu Mountain, where they could have a peaceful life for thirty years.<br/><br/>Yet, that was akin to waiting for death. After thirty years, when Star Luo Sect and Wanxiang Gate arrived, all that awaited him was death.<br/><br/>Upon thinking of this, he no longer hesitated and opened the system.<br/><br/>[Do you want to use the Life Simulator? It costs 500,000 gold to use once.]<br/><br/>“Yes.”<br/><br/>[At 22, you have reached the peak First Rank, topped the First Rank list, and shocked the world.]<br/><br/>[You killed Lei Hao on Dragon Gate Island and took over the island.]<br/><br/>[Several days later, you took Su Qingzhi and others to Tianzhu Mountain, sending them into the Secret Realm, and left alone to look for Ling Ling.]<br/><br/>[You went to the Lin family in Jiangzhou to settle the account with them, forcing out a Golden Body Realm member they had hidden. After a fierce battle, you defeated him. Finally, the Lin family conceded and offered their family treasure.]<br/><br/>[In the secret vault of the Lin family, you discovered a treasure map hidden in a painting. After having Wu Er identify it, you confirmed it was a treasure map from the Xia Dynasty over a thousand years ago. The location of the treasure is the Divine City.]<br/><br/>[You went to the Divine City and looked through data at the Martial Academy for two months, finally determining the location of the treasure, it was in the Altar of Heaven.]<br/><br/>[You went to the Literary Institute, to the highest floor of Star Picking Pavilion where you saw the difficult question proposed by the Celestial Being from the institute which was a sword technique. The condition was that if anyone below the Divine Power Realm could comprehend this sword, it would be deemed as completed.]<br/><br/>[You spent several months in Star Picking Pavilion trying to comprehend, naturally you were unable to comprehend this sword technique, and inevitably gave up.]<br/><br/>[Afterwards, you were courted by all sides. You eventually decided to join the Capital Guard and became the deputy commander, getting the chance to enter the Huaqing Pool for Temper.]<br/><br/>[Two months later, the royal family held a heaven-worshipping ceremony. Due to the emperor’s poor health, the ceremony was presided over by the queen. You were responsible for safeguarding the queen, thus had the chance to enter the Altar of Heaven.]<br/><br/>[During the worship ceremony, the crown prince and several ministers suddenly confronted the queen. It quickly escalated into chaos. Almost ten Divine Power Realm strongmen appeared, someone took advantage of the disorder to open the Secret Realm in the middle of the altar. It was filled with countless gold and silver jewels, and a Divine Sword.]<br/><br/>[Beside the Divine Sword sat a tall figure. The man suddenly came back to life, killing all the Divine Power Realm strongmen who had entered the Secret Realm.]<br/><br/>[Then, the strongman guarding the treasure pulled out the Divine Sword and killed his way out. No one could be his match.]<br/><br/>[You protected the queen and escaped from the Altar of Heaven, returning to the palace.]<br/><br/>[That strongman pursued all the way to the palace, and was finally killed by several powerful men in the palace.]<br/><br/>[After this, you gained even more trust from the queen.]<br/><br/>[Several months later, the queen sent you to deliver a letter, but you were captured by a Mana Realm strongman as soon as you left the Divine City.]<br/><br/>[More than a year later, you were taken to a certain Secret Realm and underwent arduous cultivation day and night.]<br/><br/>[Forty years later, still unable to break through to the Divine Power Realm, you were taken to a colossal Divine Tree. You were drained of all your blood and died, aged sixty-four.]<br/><br/>Gu Yang was rather surprised after reading this simulation.<br/><br/>Cao Yiyi’s father surprisingly did not appear afterwards. From the look of it, Ling Ling really was his lucky star.<br/><br/>Going to the Lin family to settle the score was part of his plan.<br/><br/>The Lin family had tried to kill him several times, how could he let it go easily?<br/><br/>If no one came up with several million taels for atonement, this matter would not be over.<br/><br/>Unexpectedly, he obtained a treasure map of the Xia Dynasty from the secret vault of the Lin family.<br/><br/>It must be the same treasure that the previous Sword Saint was trying to find.<br/><br/>In the Secret Realm where the treasure was hidden, there was actually a man hidden. The Xia Dynasty had perished a thousand years ago, this meant, the person hiding in the Secret Realm must be at least in the Unleaking Realm. Otherwise, he would not have survived until now.<br/><br/>In the end, this strongman of the Unleaking Realm was killed in the palace.<br/><br/>Though the royal family was said to be declining, they could still easily kill a strongman of the Unleaking Realm.<br/><br/>However, in the end, he was still captured by a strongman from that Sacred Land.<br/><br/>No need to guess, it must have been the empress who betrayed him.<br/><br/>It once again proved the phrase, in this world, you can’t rely on anyone but yourself.<br/><br/>[Simulation ends, you can keep one of the following.]<br/><br/>[1. Martial Arts Realm at the age of 64.]<br/><br/>[2. Martial Art experience at the age of 64.]<br/><br/>[3. Wisdom of life at the age of 64.]<br/><br/>“Choose number one.”<br/><br/>What is most important now is to break through to the Divine Power Realm, a culmination of forty years.<br/><br/>Suddenly, the True Essence inside Gu Yang grew rapidly, bringing him a bit closer to the Divine Power Realm.<br/><br/>When he opened his eyes, he saw shock in Pei Qianlan’s eyes.<br/><br/>This was her first time encountering such a drastic surge in Gu Yang’s cultivation level, and it shocked her.<br/><br/>Just now, Gu Yang’s momentum suddenly burst out, and she almost thought another enemy had appeared and half-drew her Rhinoceros Sword.<br/><br/>Then, she could sense his True Essence rapidly inflating.<br/><br/>Pei Qianlan wondered if he was about to directly enter the Divine Power Realm and attain his Golden Body.<br/><br/>The three women, Su Qingzhi, stayed in the cave for three full days. When they came out, Gu Yang could distinctly feel that they had changed.<br/><br/>Su Qingzhi had astonishingly broken through to the Third Rank Realm, while Xu Ruomei’s cultivation level had also returned to the Third Rank.<br/><br/>As for Lily, she clearly benefitted the most. Her aura has become unfathomably profound, equivalent to the First Rank.<br/><br/>“It’s time to go.”<br/><br/>Without any delay, Gu Yang led them off the island.<br/><br/>The boat Su Qingzhi and the others had chartered was still there, as people were watching over it. Zhang Xiao Hai, Han Mengling, and the maid Zhi Xing were all there.<br/><br/>As for the one Gu Yang had hired before, it had long since disappeared.<br/><br/>Two days later, they finally returned to the shore, not even entering Jingzhou City, and left directly.<br/><br/>Ten days later, Gu Yang left Tianzhu Mountain alone.<br/><br/>This was his first time really travelling alone since leaving Liu Village. Even before he left Lian Mountain, he was always accompanied by Su Qingzhi, Zhi Xing, and Zhang Xiao Hai, the three burdens.<br/><br/>Lately, the number of people around him had increased even more.<br/><br/>At this moment, Gu Yang felt both relief and reluctance in his heart, along with a bit of sentimentality.<br/><br/>Despite his feelings, he resolutely left them all in the Secret Realm.<br/><br/>This was no child’s play.<br/><br/>The enemies he now faced were all in the Divine Power Realm, including formidable opponents like the Gun God, and he would soon be drawn into the cruel power struggle within the royal family.<br/><br/>Having them by his side was too dangerous and benefited no one.<br/><br/>It was better to let them cultivate well in the Secret Realm and step into the Divine Power Realm as soon as possible.<br/><br/>Besides, once he broke through to the Divine Power Realm, he could go back to see them.<br/><br/>While Gu Yang was on the move, someone suddenly patted his shoulder. He was startled and turned around, only then letting out a sigh of relief.<br/><br/>The person was Wu Er.<br/><br/>He seemed rather curious, “How come you’re alone this time? Where are your beloved women?”<br/><br/>Gu Yang pretended not to hear his jests and asked, “Senior, why did you disappear without saying goodbye last time?”<br/><br/>Wu Er replied, “Two annoying flies suddenly came along, and this old man didn’t want to meet them, so I had to hide.”<br/><br/>“Come, let this old man continue teaching you the second strike of ‘Heavenly Inquiry Nine Knives’.”<br/><br/>“No need to rush that.”<br/><br/>Gu Yang said, “I have something else to do.”<br/><br/>“What is it?”<br/><br/>“Settling a score with the Lin Family.”<br/><br/>PS: Asking for monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}