{"id": 154, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310385.html", "title": "Chapter 154 - Chapter 154: 154 Are You Lei Hao?", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 154 - Chapter 154: 154 Are You Lei Hao?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 154: 154 Are you Lei Hao?<br/><br/>Translator: 549690339<br/><br/>At the entrance of Jinghai Prince Mansion, two huge white lanterns hung, and everyone in the mansion wore black armbands. In their expressions, however, a shade of sorrow could be perceived.<br/><br/>Some of the guests that came to mourn found it a bit strange. It wasn’t until they reached the mourning hall did they see the crown prince draped in mourning clothes, crying his heart out, evidently grief-stricken to the core.<br/><br/>Many people knew that the crown prince had always been on good terms with the princess consort. Despite the fact that she was not his birth mother. Now it seemed, the rumors were indeed true.<br/><br/>In reality, many people harbored some doubts about the death of the princess consort.<br/><br/>It was too sudden. She had just been selling her dowry in large quantities, and then news of her sudden death was reported.<br/><br/>Most importantly, some well-informed individuals knew that after selling her dowry, the over seven million taels of silver she received were all sent to the Qian Residence.<br/><br/>This was too easy to provoke speculation in others.<br/><br/>However, no one discussed this matter, they didn’t dare to, not even privately.<br/><br/>Once Jinghai Prince broke through to the Divine Power Realm, he would have a lifespan of three hundred years, ruling over Jingzhou for a very long time. Who would dare wag their tongues?<br/><br/>Such matters could only be kept to oneself.<br/><br/>Similarly, there were very few people who harbored even greater doubts in their hearts.<br/><br/>The biggest families in Jingzhou all had agents stationed in Divine City. At the beginning of each month, they copied down those lists and sent them back via pigeon mail. In one night, the messages could reach Jingzhou.<br/><br/>Today happened to be the beginning of the month. In the morning, several families had just received messages from Divine City.<br/><br/>The most explosive news, of course, was about Gu Yang topping the First Rank list.<br/><br/>This was perhaps the fastest and youngest top of the First Rank list since its inception.<br/><br/>Besides this, there was one more matter that left them puzzled. The name of Princess Consort Pei Qianlan still appeared on the Beauty List.<br/><br/>Logically, at the time when the lists were copied in Divine City, she had already been dead for two days.<br/><br/>This issue was too eerie, hence even fewer people dared to talk about it.<br/><br/>No matter if she was really dead or still alive. When the Jinghai Prince Mansion declared her dead, then she must be dead.<br/><br/>In the vast ocean.<br/><br/>Gu Yang turned his head to look at the person who had jumped onto the ship, an old man, bearing a square face and exuding an air of authority. The clothes he wore were of an indiscernible material, suggesting a quite extraordinary origin.<br/><br/>Considering his cultivation level, he was right at the peak of First Rank.<br/><br/>This man was not one of the two First Ranks who had been monitoring him nearby.<br/><br/>Gu Yang said, “I’m afraid we’re not headed the same way.”<br/><br/>The old man flashed a slight smile, “Isn’t this ship heading to Dragon Gate Island? I just happen to be going the same way.”<br/><br/>Before Gu Yang could refuse, he added, “Don’t worry, I won’t ride your ship for free. How about I teach you a saber technique as compensation?”<br/><br/>Seeing the old man’s demeanor, despite his grumpiness, his actions embodied a chivalrous spirit, quite different from those martial artists who bully others by flaunting their power, Gu Yang said, “If it’s along the way, then let’s travel together. As for the compensation, no need.”<br/><br/>He was currently using the Hidden Knife Style to conceal his cultivation level, so this old man in front of him certainly could not see through it.<br/><br/>He asked, “May I know what is the purpose of your visit to Dragon Gate Island?”<br/><br/>Considering the old man’s age, it wasn’t a loss to address him as a senior.<br/><br/>He mainly wanted to probe for information on this old man’s connection with Lei Hao.<br/><br/>The old man said, “Taking a hot spring bath.”<br/><br/>Hot spring bath?<br/><br/>Gu Yang wanted to ask more, but the old man yawned and said, “When you get old, even a little movement tires you out. Can you offer me a room to rest?”<br/><br/>Gu Yang of course had no objection, the ship was large, there were plenty of vacant rooms.<br/><br/>Dragon Gate Island was quite far off, and the large ship had sailed for several days before it arrived.<br/><br/>However, the ship owner was unwilling to dock the ship, instead, they lowered a small boat, letting them row themselves to the island.<br/><br/>In fact, if it weren’t for Gu Yang offering a large sum of money, they would not have found anyone willing to go to Dragon Gate Island.<br/><br/>Everyone in Jingzhou City knew that Dragon Gate Island housed the son of the previous Pirate King, a strong man in the Divine Power Realm.<br/><br/>Bringing the ship to this position was already the limit.<br/><br/>Gu Yang did not make things difficult for them and was about to get someone to call for the old man in the room.<br/><br/>The old man who had traveled with them had already stretched his waist and come out. For the past few days, he hadn’t stepped out of his room, completely motionless, as if he was genuinely asleep.<br/><br/>He had obviously heard their conversation, without saying a word, he jumped onto the small boat.<br/><br/>Gu Yang also pulled Pei Qianlan to jump down, rowing the small boat, heading towards Dragon Gate Island.<br/><br/>The old man was leaning at the stern of the ship, his eyes closed in a nap.<br/><br/>In the early morning, a layer of mist shrouded Dragon Gate Island.<br/><br/>On the shore, Lei Hao was standing there with a group of subordinates, as if waiting for someone.<br/><br/>Not far behind, a young man whispered to a middle-aged man next to him, “Brother Shen, who is the boss waiting for? Whoever it is, they’re important enough to have the boss personally welcome them on the shore.”<br/><br/>The middle-aged man, Shen Nine, quietly said, “An old predecessor. The boss owes his achievement of the Golden Body to that predecessor’s guidance. Pay attention and be respectful to that predecessor. If not, the boss will skin you alive.”<br/><br/>When he mentioned that predecessor, his heart still trembled with lingering fear.<br/><br/>Shen Nine had been with Lei Hao the longest.<br/><br/>After the death of the old master, he hid on this island with Lei Hao. Although Lei Hao also had a First Rank cultivation level, it didn’t even qualify him for the First Rank list. He was no match for Wu Tianqi, the first on the First Rank list.<br/><br/>Even Lei Hao himself did not hold any hope for revenge.<br/><br/>That was until one day when an old man suddenly appeared on the island.<br/><br/>They thought he was an assassin sent by Wu Tianqi, naturally, they struck first.<br/><br/>Anyway, with just a wave of the old man’s hand, Shen Nine knew nothing more.<br/><br/>When he woke up, he found that everyone else was dead, except for him and Lei Hao.<br/><br/>The old man had already disappeared.<br/><br/>Just when Shen Nine was feeling lucky to be alive, he noticed that Lei Hao’s cultivation began to skyrocket, and in a few years, even formed a Golden Body.<br/><br/>This was so mysterious that it took a year after the old man visited the island again for Shen Nine to learn that Lei Hao’s progress was due to the old man’s guidance.<br/><br/>Shen Nine couldn’t imagine what methods the old man could have used to help Lei Hao form the Golden Body in just a few years.<br/><br/>The old predecessor had visited the island twice before, both times five years apart and on the same day.<br/><br/>Unless something unexpected occurred, the predecessor would once again visit the island today.<br/><br/>“He’s here! Quiet!”<br/><br/>Suddenly, Lei Hao shouted.<br/><br/>Immediately, everyone shut up and dared not make a sound.<br/><br/>Shen Nine looked carefully and faintly saw a small boat on the sea.<br/><br/>This predecessor’s way of visiting the island this time was different from before.<br/><br/>Just as he was thinking, suddenly, a figure leaped from the boat, crossing hundreds of meters in one jump to land on the shore. It was a young man, holding a girl in his arms. His gaze fell on Lei Hao and he asked, “Are you Lei Hao?”<br/><br/>This sudden change caught everyone by surprise.<br/><br/>The newcomer was Gu Yang. From a distance, he noticed a group of people waiting on the shore. He thought that his whereabouts had been betrayed by the boatman. After all, the reputation of a Divine Power expert was scary enough.<br/><br/>So he no longer hid himself, picked up Pei Qianlan, jumped and landed on the shore. His gaze swept over the crowd and landed on the imposing man at the front, “Are you Lei Hao?”<br/><br/>Gu Yang had a strange expression on his face.<br/><br/>From another perspective, he could clearly see a ball of lightning within the man’s body. However, the brightness of the lightning was not at all what a Divine Power expert should have.<br/><br/>He had seen several Divine Power experts.<br/><br/>The one from the Shen family who made it to the Golden Body stage had a dark light in his body, just like a black hole.<br/><br/>The newly advanced King of Jingzhou had a green light in his body, dazzling like a sun.<br/><br/>As for the Sword Saint, he couldn’t see through him at all.<br/><br/>The Lei Hao in front of him was far inferior compared to them.<br/><br/>Gu Yang couldn’t help but ask a question, “Are you really a Divine Power stage?”<br/><br/>Lei Hao looked at the man and woman who descended from the sky and was momentarily stunned.<br/><br/>With his vision, he could naturally see that this young pair came on the same boat with that predecessor. When he heard the young man’s rude words, he felt a surge of anger.<br/><br/>However, not clear about this pair’s relationship with the predecessor, he didn’t dare act rashly.<br/><br/>When the young man asked another question, “Are you really a Divine Power stage?” Lei Hao became furious and shouted, “You’re asking for death!”<br/><br/>That question was his Achilles heel!<br/><br/>PS: It’s the tenth day, asking for monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}