{"id": 153, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310382.html", "title": "Chapter 153 - Chapter 153: 153 Sure Enough, It’S Him!", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 153 - Chapter 153: 153 Sure Enough, It’S Him!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 153: 153 Sure enough, it’s him!<br/><br/>Translator: 549690339<br/><br/>Divine City, outside the Martial Academy.<br/><br/>Princess Chang’s phoenix carriage arrived once again. After ten days, the grand competition had finally ended, and the ten martial scholars had been determined. Today was the day to grant them their titles, and she naturally had to be present. Otherwise, her presence on the opening day would have been in vain.<br/><br/>With the decline of the Martial Academy, the so-called martial scholars had become insignificant in officialdom, though they still held some use in the military.<br/><br/>However, with the support of a major figure like Princess Chang, the weight of this title was not the same.<br/><br/>This time, she again invited Gu Yunfei to accompany her.<br/><br/>Today, she was delayed by some matters and had arrived a bit late.<br/><br/>At the entrance of the Martial Academy, a group of people was respectfully waiting for Princess Chang.<br/><br/>Inside the carriage, Princess Chang was flipping through a dossier, with her hand supporting her chin, her eyes thoughtful.<br/><br/>This dossier, which had just been delivered to her in the morning, had detailed information about Gu Yang.<br/><br/>“Lian Mountain…”<br/><br/>Gu Yang first appeared at Lian Mountain. It was an unremarkable range in Jiangzhou.<br/><br/>The dossier also attached a particular piece of information that could not help but spur certain thoughts.<br/><br/>A hundred years ago, Heavenly Extreme Taoist, the then Dao Sect figure, was killed at Lian Mountain by an individual from the Literary Academy.<br/><br/>Since then, the Dao Sect, once the leader of the six major sects, had been severely damaged and hadn’t recovered to this day.<br/><br/>In the following hundred years, the Dao Sect had been extinct in the martial arts world.<br/><br/>If it weren’t for a Dao Sect representative on the Grandmaster’s board, everyone would have thought this sect already extinct.<br/><br/>From this dossier, it was challenging to figure out Gu Yang’s origins.<br/><br/>The things he knew were too diverse. “Phoenix Dance Nine Heavens” of Shen Family, possibly obtained from the treasure of the Shadow Thief.<br/><br/>Then there’s “God Destroyer Nine Styles” of the Wu Family, this was a bit strange. Today, Wu Family only had Wu Lingling left, and given her age, she definitely did not know any saber techniques. Although there are some techniques scattered throughout the martial world, only in the royal family does complete inheritance exist.<br/><br/>How did he learn it?<br/><br/>The most puzzling thing is the “Six Heavenly Annihilations”.<br/><br/>As for the rumors that Gu Yang was a disciple of Blue Sky Palace, she sneered at them because she knew that the Blue Sky Palace never took in male disciples.<br/><br/>So, the question is, how did he get this Saber technique’s legacy?<br/><br/>There were only three places in the world where one could inherit the “Six Heavenly Annihilations”; one was the Blue Sky Palace, and the second was the royal palace<br/><br/>“Could it be… that woman?”<br/><br/>A deep murderous intent flashed in Princess Chang’s eyes.<br/><br/>Sitting across the curtain, Gu Yunfei only felt a wave of chill rocking him to his core. His heartbeat almost stopped.<br/><br/>Soon, that chills disappeared without a trace.<br/><br/>Gu Yunfei swallowed, a lingering fear in his heart, and his back already drenched in sweat.<br/><br/>Princess Chang did not pay attention to the frightened Gu Yunfei; she was still thinking about that woman.<br/><br/>Twenty years ago, because of that woman, her father and mother were brutally murdered by Wu Da.<br/><br/>She was the youngest daughter of the late emperor and was very spoiled. At that time, she contracted a severe illness and was kept in the palace, thus escaping the tragedy. She did not end up dying in the hunting ground together with her hundred-plus older brothers and sisters.<br/><br/>When it came to that woman, she harbored an intense hatred.<br/><br/>However, after her father died, this woman disappeared. There was only a name left on the master list.<br/><br/>Could this Gu Yang be sent by that woman?<br/><br/>As Princess Chang was thinking, she suddenly heard some commotion. “The First Rank list has changed again, could it be that Gu Yang again?”<br/><br/>These words immediately brought her thoughts back.<br/><br/>The First Rank list has changed?<br/><br/>She lifted the curtain and looked. Her gaze penetrated a distance of several hundred meters and went through the crowd, seeing an old man changing the list.<br/><br/>Could it really be him?<br/><br/>Rationality told her that after being on the First Rank list, it was impossible to have such a significant rise in just ten days.<br/><br/>But thinking about Gu Yang’s incredible past records, she wavered.<br/><br/>Finally, the old man finished changing the names.<br/><br/>However, her vision was blocked, and she couldn’t see the names on the list.<br/><br/>“It’s Prince Jinghai, the first ranker has changed.”<br/><br/>There was an uproar in the crowd.<br/><br/>Someone exclaimed in shock, “Prince Jinghai’s name has disappeared, has he achieved Divine Power?”<br/><br/>“Maybe he has fallen?”<br/><br/>Hearing the discussions, Princess Chang couldn’t help but concentrate her gaze.<br/><br/>From her perspective, she naturally hopes for the best if King Jinghai died. That way, the court could reclaim Jingzhou without lifting a finger.<br/><br/>At present, Jingzhou City has become the largest city after Divine City.<br/><br/>And then there’s the benefits of sea transport<br/><br/>These benefits are too tempting for anyone to resist.<br/><br/>However, she also understands very clearly that as long as the Emperor’s Supreme Sword Saint is around, King Jinghai will not die so easily.<br/><br/>Even if the Nether Sect makes a move, it’s hard to resist a single blow from the Emperor’s Supreme Sword Saint.<br/><br/>The Nether Sect is dangerous, but only to those in the Golden Body Realm.<br/><br/>Once you reach the Mana Realm, even if you encounter a disciple of the Nether Sect, you could retreat unharmed.<br/><br/>For peerless powerhouses like the Emperor’s Supreme Sword Saint, unless those two old monsters from Nether Sect in the Unleaking Realm make a move, anyone else is just courting death.<br/><br/>Therefore, it is more likely that King Jinghai will successfully step into the Divine Power Realm.<br/><br/>This is a huge bad news for the court. It will be even more difficult to deal with him in the future.<br/><br/>Princess Chang’s expression became somewhat gloomy.<br/><br/>Just then, there was a stir from the other side, “Why have they come again? Didn’t they just switch out?”<br/><br/>She looked again and saw that the old man who had replaced the list had returned with a new list and was still walking in front of the First Rank list, tearing off the list that had just been posted.<br/><br/>She couldn’t help but be taken aback, not understanding what had happened.<br/><br/>Gu Yunfei on the side also couldn’t help but look out, as the carriage moved a bit closer now.<br/><br/>For some reason, he felt a sense of familiarity with this scene.<br/><br/>Last time, he and Qin Shang had also encountered such a thing when they came together.<br/><br/>His heart was thumping, and he had a premonition, “Could it be  no way ”<br/><br/>Soon, the old man had replaced the list.<br/><br/>Suddenly, all the people standing in front of the list fell into a deathly silence.<br/><br/>Everyone seemed to be trapped by a mysterious force, standing there, no one spoke.<br/><br/>This abnormal scene made Gu Yunfei’s scalp explode.<br/><br/>Finally, he caught a glimpse of the first line of the list from the crowd, which read: “First place, Gu Yang, Sect unknown, from Jiangzhou”.<br/><br/>It was indeed him!<br/><br/>First Rank<br/><br/>At this moment, Gu Yunfei had a sense of everything proceeding as expected in his heart.<br/><br/>“First on the First Rank List!”<br/><br/>Behind a gauze curtain, Princess Chang muttered to herself.<br/><br/>With a bang, the armrest of the seat suddenly turned into dust. She was completely unaware of her own loss of composure.<br/><br/>In Jingzhou City, the largest port of The Great Zhou, a large ship set sail for the sea.<br/><br/>On the deck at the bow of the ship, a man and a woman stood against the wind, looking at the boundless blue ocean.<br/><br/>The woman, wearing a veil, said with a worried face, “Master Gu, we should consider this matter carefully and go back first ”<br/><br/>These two people were no other than Gu Yang and Pei Qianlan.<br/><br/>Early this morning, Gu Yang had taken her out and sailed the boat out to sea.<br/><br/>Only then did she know that his words yesterday were serious. He really wanted to go to Dragon Gate Island to avenge her. Anxious, she wanted to persuade him to go back.<br/><br/>Gu Yang smiled and said, “Since I dare to go, I must be confident. You just relax.”<br/><br/>However, how could Pei Qianlan be at ease?<br/><br/>Ever since her parents were killed, Lei Hao, the Divine Power Realm powerhouse, has become her lifelong nightmare that she cannot shake off.<br/><br/>Her relatives, from uncle, aunt, to uncle, aunt  all wanted to kill her for their happiness. They were afraid of being implicated by her.<br/><br/>During that time, all the people she was familiar with, her loved ones, either avoided her like a viper or participated in her chase.<br/><br/>All of this was due to the threat from Lei Hao, the strong man in the Divine Power Realm.<br/><br/>Pei Qianlan was genuinely terrified of Lei Hao.<br/><br/>But at this time, she saw Gu Yang’s determination, and she knew that he had made up his mind. The words in her mouth were all swallowed back. She stretched out her hand into his palm, and the fear and worry in her heart gradually disappeared, finally becoming peaceful.<br/><br/>At most, it’s just a death.<br/><br/>Suddenly, a figure leaped from the shore and landed lightly on the boat, saying, “I need a ride, hope you two don’t mind?”\t\t\t\t\t\t</div>", "images": {}, "success": true}