{"id": 150, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310373.html", "title": "Chapter 150 - Chapter 150: Chapter 150: Young Master, Please Respect Yourself (Third Update, Asking For Monthly Tickets)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 150 - Chapter 150: Chapter 150: Young Master, Please Respect Yourself (Third Update, Asking For Monthly Tickets)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 150: Chapter 150: Young Master, Please Respect Yourself (Third update, asking for monthly tickets)<br/><br/>Translator: 549690339<br/><br/>Gu Yang stood in front of him, confronting Shen Luo not far away. The phoenix’s illusion above his head became solid and tangible.<br/><br/>“I will remember that slash.”<br/><br/>However, Shen Luo left a sentence behind, jumped up and quickly disappeared into the night.<br/><br/>Gu Yang was surprised. Shen Luo was just showing his murderous intent, he assumed that this Golden Body Realm powerful person will fight to the death with him. Surprisingly, he just left without any further exception.<br/><br/>Confirming that the other party had already left, he felt a little relieved, but then his head started to buzz.<br/><br/>The slash just now was his limit. His spirit was nearly exhausted, and he couldn’t launch the second slash at all.<br/><br/>His realm is still too low after all.<br/><br/>However, he was not at a loss with such a big gain today.<br/><br/>Gu Yang finally understood the mystery of the “Phoenix Dance Nine Heavens” technique.<br/><br/>It turns out that the vast majority of the True Essence he has worked hard to cultivate over the years is just temporarily stored in that phoenix, not swallowed up. When needed, he could allow the True Essence to return to its origin.<br/><br/>However, the most crucial part was missing in that jade slip of inheritance – how to recall the True Essence temporarily stored in that phoenix.<br/><br/>If it weren’t for his simulation this time, and learning the first move of “Heavenly Inquiry Nine Knives”, and comprehending the method of using True Essence at the moment of life and death, he would probably only discover this secret when he reached the Divine Power Realm.<br/><br/>Indeed, this technique is extremely profound.<br/><br/>At the Mortal Realm, the physical flesh body can contain only a limited amount of True Essence. This technique is innovative. When it reaches the First Rank, it allows the cultivator to have dozens of times more True Essence than the martial artists in the same realm. It could be said that it stands on unbeatable ground.<br/><br/>However, this is just the simplest benefit.<br/><br/>The most crucial thing is to lay an unmatched solid foundation during the Mortal Realm.<br/><br/>Once he breaks through to the Divine Power Realm, his True Essence will be much more solid than others, several times more, or even tens of times more.<br/><br/>After Gu Yang understood, he felt that so many previous simulations were worth it.<br/><br/>On the other side, Shen Luo had already left Jingzhou City.<br/><br/>His expression was extremely gloomy. It’s not just because he was wounded by Gu Yang’s slash.<br/><br/>Why didn’t anyone tell him before he came that a Mana Realm powerhouse was hidden in Jingzhou City?<br/><br/>Shen Luo just stopped because he sensed a terrible sword intent, which made him feel a great danger.<br/><br/>His intuition told him that if he didn’t leave, he might not be able to leave at all.<br/><br/>He could only suppress his anger, let go of Gu Yang, and decisively leave.<br/><br/>“Who exactly is plotting against me?”<br/><br/>Shen Luo had a cold gaze, thinking about several candidates in his family. It seemed that everyone was suspicious.<br/><br/>The Shen Family’s parasite cultivation model, although it has the strict order of the ancestors, strictly prohibits internal fighting after reaching the Divine Power Realm.<br/><br/>However, the defence against their own kind has been ingrained. If there’s a chance to harm the clan in secret, no one will be soft-handed.<br/><br/>If they were in his shoes, they would do so without hesitation as well.<br/><br/>Just this time, he was the one being set up.<br/><br/>What was thought to be a simple task turned out to be full of incidents and surprises.<br/><br/>Shen Luo decided to return to his family and report to his ancestors.<br/><br/>The injury on his hand was enough to explain to the ancestor.<br/><br/>Shortly after, in the sky above the Jinghai King’s Mansion, the thunder finally ceased.<br/><br/>The overpowering aura also converged.<br/><br/>Everything seemed to calm down.<br/><br/>Everyone in Jingzhou City knew that the King of Jingzhou had taken the most important step and became a strong Divine Power Realm, becoming an immortal and god-like figure from now on.<br/><br/>That night, countless people were overjoyed.<br/><br/>For the people of Jingzhou, the stronger the King of Jinghai, the more stable Jingzhou will naturally be.<br/><br/>At the Qian Residence.<br/><br/>Gu Yang saluted in the direction of Jinghai King’s Mansion, considering it as a congratulations to him.<br/><br/>This hurdle, finally passed.<br/><br/>It was not easy.<br/><br/>Honestly, he was quite worried about accidents happening halfway, but fortunately, everything went smoothly.<br/><br/>For the Divine Power Realm, the most vulnerable moment is when they are in the process of making a breakthrough.<br/><br/>Once successfully breaking through, condensing a Golden Body, one would not be so easy to deal with. Even if they were only starting into the realm of Divine Power, they would become extremely difficult to handle.<br/><br/>What is the Golden Body realm?<br/><br/>One that can withstand hits, be immune to blades and spears, and be impervious to water and fire. Moreover, they awaken Divine Powers, such as Titanic Power, and Wind Controlling Power. If one is determined to escape, it is not so easy to catch up with them.<br/><br/>The True Essence of a First-Rank expert striking the body of someone in the Golden Body realm is as ineffective as scratching an itch.<br/><br/>Even ordinary divine weapons find it difficult to break open the Golden Body.<br/><br/>It can be said that upon reaching the Golden Body realm, your survival ability becomes extremely strong.<br/><br/>If two cultivators of the Golden Body realm were to fight, it would be normal to continue for several months.<br/><br/>Even in the Mana realm, killing someone in the Golden Body realm can only be achieved through grinding their defenses down gradually.<br/><br/>The reason why a Sword Saint can be invincible and be respectfully referred to as “Sword Saint” is due to his peerless divine weapon, which is capable of breaking open the Golden Body of a Divine Power realm expert.<br/><br/>Why is the Nether Sect so terrifying, making everyone avoid the experts of the Divine Power realm? It is precisely because they have the means to defeat the Golden Body.<br/><br/>As soon as cultivators in the Golden Body realm encounter disciples of the Nether Sect, they can’t even escape and end up being transformed into evil corpses.<br/><br/>Now that King Jinghai has achieved Divine Power, he has sufficient strength to protect himself.<br/><br/>“Where is Elder?”<br/><br/>Gu Yang turned his head and found Wu Er was no longer there. Once again looking around, he couldn’t find him in the mansion, so he asked Zhang Xiao Hai.<br/><br/>Zhang Xiao Hai said, “Elder said he would be gone for a few days and told the Young Master not to look for him. He will naturally come back after a while.”<br/><br/>He left so suddenly?<br/><br/>Gu Yang had a thought in his heart. Looking eastward, he could see two dazzling light groups, one white and the other green, clearly belonging to two First Rank martial artists. He had never seen them before.<br/><br/>Could it be because of these two?<br/><br/>“Understood.”<br/><br/>He nodded, said nothing more, and went back to his room to rest.<br/><br/>Half a month passed in a blink of an eye.<br/><br/>Gu Yang rarely had such leisure time, and no one came to disturb him, except for the two unknown First Rank martial artists who were always lurking nearby.<br/><br/>The Golden Body realm expert from the Shen family had not appeared again.<br/><br/>He practiced his skills every day, read books, ate with the women of his household, connected emotionally with them, and found time to tutor Su Qingzhen, Han Mengling and Zhang Xiao Hai.<br/><br/>If possible, he wished for his days to continue like this.<br/><br/>However, this was impossible.<br/><br/>Gu Yang never forgot that after a year, three experts in Divine Power realm would come to take him away, forcing him to cultivate in a secret realm.<br/><br/>One early morning, a noise once again disrupted Gu Yang’s peaceful life.<br/><br/>A group of people carrying one big box after another entered the yard Gu Yang was in.<br/><br/>The leader was Spring Peach, who had brought the gold and silver proceeds from selling Pei Qianlan’s property.<br/><br/>A total of more than seven million taels, the largest amount of money he had received so far.<br/><br/>When Gu Yang saw this money, he knew his leisurely life had come to an end.<br/><br/>Pei Qianlan had really sent over more than seven million taels, adding to the previous two million, it was nearly ten million taels.<br/><br/>The favor was too great.<br/><br/>Once all the porters left, the hooded Pei Qianlan, wearing a white cloak, finally appeared. She walked respectfully from the courtyard and gave a polite bow saying, “Young Master, I am unable to repay the two times you have saved my life. Upon hearing that you needed money, I took the liberty of sending it. The only things I can do for you are these. Also, please take care in the future.”<br/><br/>After speaking, she gave another bow and turned to leave.<br/><br/>This time she was clearly coming to bid him farewell.<br/><br/>Gu Yang reached out and grabbed her sleeve.<br/><br/>Pei Qianlan didn’t turn around. In a low voice she said, “Young Master, please be mindful.”<br/><br/>“Actually, when we were on Sword Mountain, the one who injured you was me. Therefore, the first incident doesn’t count.”<br/><br/>Pei Qianlan’s shoulder quivered a bit, seeming to want to turn around, but then she resisted the urge.<br/><br/>“That night, you almost gave your life to save me. This makes us even.”<br/><br/>“You brought so much money, for which I am immensely grateful. I am not someone who likes to owe others favors.”<br/><br/>At this point, Gu Yang placed his hand on her shoulder, turned her around, held her soft hand and said, “Tomorrow, we’ll go to Dragon Gate Island and I’ll help you take your revenge.”<br/><br/>Pei Qianlan’s eyes were already red and tears rolled down her cheeks.<br/><br/>PS: The third update, please vote for it.\t\t\t\t\t\t</div>", "images": {}, "success": true}