{"id": 155, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310388.html", "title": "Chapter 155 - Chapter 155: 155 I Won’T Accept", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 155 - Chapter 155: 155 I Won’T Accept</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 155: 155 I won’t accept<br/><br/>Translator: 549690339<br/><br/>“You’re courting death.”<br/><br/>With a stern shout, Lei Hao’s hair stood on end, surrounded by countless bolts of lightning, his eyes emitting a purple glow. He looked as if the god of thunder himself had descended to Earth.<br/><br/>Every time his subordinates saw him demonstrate his immense power, they couldn’t help but feel a deep reverence. Such power was nearly godlike.<br/><br/>Among those present, Shen Nine was with the highest cultivation level. As he watched Lei Hao ascend from the ground, feelings of shock and an indescribable emotion coalesced within him.<br/><br/>If he hadn’t passed out that year, perhaps, the great opportunity could have been his.<br/><br/>After all, his cultivation level was higher than Lei Hao’s at the time. Because he had been at the forefront, he took the brunt of the impact which caused him to lose consciousness.<br/><br/>Lei Hao, who stood behind him, faced a lesser impact and remained conscious. As a result, misfortune turned into a blessing and he ended up receiving the great opportunity.<br/><br/>Every time Shen Nine thought about how he missed such an opportunity, his heart ached as if gnawed by a poisonous snake.<br/><br/>Pei Qianlan wrapped her arm around Gu Yang’s waist again, not looking at their common enemy. At this moment, resentment, vengeance, none of it mattered to her.<br/><br/>All she wished for was him to remain safe and unharmed.<br/><br/>A large hand was firmly pressed against her back, the man’s deep voice whispering in her ear, “Watch me avenge you.”<br/><br/>A comforting warmth subsequently enveloped her entirely.<br/><br/>She was so familiar with this feeling that it brought her peace.<br/><br/>Seeing Lei Hao’s explosive power, surrounded by lightning and with a giant copper hammer in hand, Gu Yang realized he had finally shown some signs of using Divine Power.<br/><br/>He removed the Phoenix Feather Knife scampered around him with red flames and said, “Prepare to receive my blow!”<br/><br/>The first move of “Six Heavenly Extinguishers”, Skyfire Annihilation!<br/><br/>He didn’t need to build up his force; he simply struck with his blade.<br/><br/>Across him, Lei Hao raised his copper hammer intending to smash this presumptuous youngster only to sense a destructive aura locking onto him the next moment.<br/><br/>Divine Power?<br/><br/>A might this terrifying wasn’t something a warrior from the Mortal Realm could possess.<br/><br/>Lei Hao had a chilling realization, wishing he could slap himself for his rash actions.<br/><br/>Bearing in mind this was the same person who had come with the senior, why did he act recklessly, provoking the guy himself?<br/><br/>“Senior ”<br/><br/>He tried to speak in his defense, but it was too late. The threatening aura of the blade was already upon him.<br/><br/>For the second time in his life, Lei Hao could sense the proximity of death.<br/><br/>There was no escape from his impending fate.<br/><br/>No –<br/><br/>With his life hanging by a thread, he was forced to harness all his remaining strength. The giant hammer in his hand shone brightly with electric light, prepared to confront the threatening intent of the blade.<br/><br/>In the next instant, a burst of flame engulfed him entirely.<br/><br/>On the sea surface, a ship was leisurely drifting. An old man, who was dozing off, suddenly let out a gasp and opened his eyes, directing his gaze at the imposing Gu Yang.<br/><br/>His expression turned oddly fascinated as he muttered to himself, “The power of the Demon Emperor  how interesting.”<br/><br/>“Aaaahh -”<br/><br/>A chilling scream echoed from within the ball of fire.<br/><br/>Those nearby were stupefied, their eyes wide and unblinking.<br/><br/>Their boss, who had descended like the god of thunder, had been defeated so easily, seemingly unable to put up any resistance.<br/><br/>They all shared Lei Hao’s doubt. Who was this man?<br/><br/>Could it be that Prince Jinghai had come for retribution?<br/><br/>The inhabitants of the island were not ignorant of the news about Prince Jinghai’s breakthrough to the Divine Power Realm.<br/><br/>However, Prince Jinghai didn’t look like this, did he?<br/><br/>Besides, it was common knowledge that Prince Jinghai wielded a giant sword called the Spirit Sword, not a knife.<br/><br/>None of the henchmen attempted to flee.<br/><br/>They all understood, fleeing from a Divine Power Realm expert was impossible.<br/><br/>In their eyes, the only person who could defeat their boss with a single stroke was someone in the Divine Power Realm.<br/><br/>Finally, the fire subsided to reveal Lei Hao’s actual form.<br/><br/>His giant hammer was split in two. From his left shoulder to his thigh extended a large wound, where flames still flickered.<br/><br/>That one stroke had dealt him a heavy blow.<br/><br/>Suddenly, Lei Hao, who was vomiting blood, fell to his knees, lowering his head. “I surrender, elder, please spare my life.”<br/><br/>His heart filled with bitterness, but he knew that he was no match for the man standing in front of him.<br/><br/>If you can’t win, beg for mercy – that was the survival philosophy of a pirate. A real man knew when to compromise. As long as he could save his life, anything could be negotiated.<br/><br/>In his eyes, the man standing before him was surely at the Divine Power realm. Despite his youthful appearance, his actual age definitely far surpassed his own. Addressing him as elder could not be wrong.<br/><br/>Lei Hao was aware of his own limitations. Although he had forged a Golden Body, he hadn’t actually achieved a breakthrough to the next realm. He could only bully First Rank fighters.<br/><br/>He was unable to slay Wu Tianqi, who hadn’t even reached the Divine Power state, clarified his power.<br/><br/>He proclaimed that he was at the Divine Power realm externally to intimidate others.<br/><br/>He talked about it so much, even he believed it, and completely forgot that he only had a False Gold Body.<br/><br/>He was clear, facing a true Divine Power realm expert, he was not a match.<br/><br/>The pirates of Dragon Gate Island, apparently revered Lei Hao as a God, were shocked to see him fall on his knees and begging for mercy. Many faiths collapsed instantly.<br/><br/>The majority of them had come here to follow this divine-powered expert Lei Hao, hoping that one day they could catch his eye and fly to heavens.<br/><br/>At this moment, many dreams were shattered.<br/><br/>..<br/><br/>Gu Yang was surprised to see that Lei Hao wasn’t killed by the stroke of his blade.<br/><br/>The power of “Six Vanishing Heavens” was infinite, and with his current strength, no First Rank fighter would be able to withstand a sword stroke.<br/><br/>Even the previous Jing Hai Wang could not handle it.<br/><br/>Lei Hao was able to stand firm after being slashed, proving his Golden Body was genuine.<br/><br/>Gu Yang suddenly thought of the Dragon Washing Pond on Dragon Gate Island.<br/><br/>It seemed that this scoundrel forged his Golden Body rely on the Dragon Washing Pond.<br/><br/>God knows how much pond water he had used up.<br/><br/>What a waste!<br/><br/>Gu Yang didn’t rush to get rid of him but chose to take off Pei Qianlan’s veil and ask Lei Hao, “Who is she?”<br/><br/>After hearing this, Lei Hao lifted his head. As he moved, his wound ached, the pain piercing deep into the bone.<br/><br/>When he saw the woman in the man’s arms clearly, his facial expression changed dramatically. He blurted out, “It’s  It’s you?”<br/><br/>At a glance, he recognized her, the daughter of the traitor who betrayed his father, Pei Qianlan.<br/><br/>For him, the traitor was more hateful than Wu Tianqi who killed his father.<br/><br/>Those who win are kings, and those who lose are Swift. No matter what means Wu Tianqi used, his win characterized his competence.<br/><br/>However, that traitor, who was disloyal and unkind, deserved death more.<br/><br/>As a result, upon achieving his Golden Body, the first person he sought out was the traitor. He directly dispersed his mortal body and ashes, not enough to prove his hatred.<br/><br/>He annihilated the entire Pei family, save for the daughter, who was rescued by Wu Tianqi.<br/><br/>Now, the daughter of the traitor appeared in front of him again, with a Divine Power realm expert alongside her.<br/><br/>At this moment, Lei Hao finally understood everything.<br/><br/>He made a huge mistake.<br/><br/>The Divine Power expert here was taking revenge for Pei Qianlan.<br/><br/>Lei Hao roared out, “I don’t accept this!”<br/><br/>His eyes were bloodshot, and he let out a roar like a wild beast. “Who are you? Why are you standing up for her?”<br/><br/>“My name is Gu Yang.”<br/><br/>Gu Yang held Pei Qianlan’s hand, letting her grip the handle of the Phoenix Feather Knife, both hands over hers. He whispered in her ear, “For your family’s revenge.”<br/><br/>As he spoke, a bolt of lightning fell from the sky.<br/><br/>A streak of lightning slashed towards Lei Hao.<br/><br/>Gu Yang?<br/><br/>With a loud bang, Lei Hao’s face showed an astonished color with his hearing the name Gu Yang.<br/><br/>That name, even in his overseas refuge, wasn’t unheard of.<br/><br/>Was he Gu Yang?<br/><br/>How could that be?<br/><br/>Could he be at the Divine Power realm?<br/><br/>The next moment, the lightning engulfed him.<br/><br/>He felt a chill at his throat, and his vision spun for what felt like several rounds. He thumped to the ground headfirst. The last thing he saw was his decapitated body, turning into ashes under the lightning.<br/><br/>Then, he descended into endless darkness.<br/><br/>PS: Continuing to request votes for the monthly poll.\t\t\t\t\t\t</div>", "images": {}, "success": true}