{"id": 157, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310394.html", "title": "Chapter 157 - Chapter 157: 157 It’S Not What You Think", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 157 - Chapter 157: 157 It’S Not What You Think</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 157: 157 It’s not what you think<br/><br/>Translator: 549690339<br/><br/>In a flash, two days had passed.<br/><br/>On Dragon Gate Island, in the center of the island, there was a massive pond in front of a waterfall.<br/><br/>On the shore, there was a smooth giant rock on which Gu Yang was sitting cross-legged. As he breathed, the phantom phoenix above his head became more and more substantial, the brightness in its slender eyes ever increasing.<br/><br/>After several cycles of cultivating, it was time for him to end his session and the phantom phoenix above his head disappeared.<br/><br/>Gu Yang opened his eyes. He could feel that something inside him had altered, making it easier for him to control his True Essence.<br/><br/>“Is it because of the Phoenix’s gallbladder?”<br/><br/>When he gets back, he needs to ask Lily what exactly is that Phoenix’s gall.<br/><br/>It was rather worrisome to think about the drop of blood that had been injected into him.<br/><br/>The old man didn’t seem to have any malicious intent, but he still needed to figure out what that thing was and if there were any side effects.<br/><br/>Next, Gu Yang looked at the gigantic, round white cocoon in front of him, which was actually transformed by Pei Qianlan.<br/><br/>That day, a thick mist spouted from her mouth and nose, quickly enveloping her completely and gradually thickening until it solidified into this form.<br/><br/>All Gu Yang could do was stand guard next to her, a watch that had now lasted two days.n<br/><br/>Through other means, he can continuously monitor her vital signs.<br/><br/>Pei Qianlan’s vital signs were becoming weaker and weaker, as if she had entered a hibernation state, fostering some strange metamorphosis inside her.<br/><br/>Gu Yang could feel that her vitality was steadily growing stronger.<br/><br/>Apparently, she had gained enormous benefits from the ordeal.<br/><br/>At that moment, a pure white light inside the cocoon started to brighten as Pei Qianlan’s power began to awaken.<br/><br/>“Brother Gu—”<br/><br/>Suddenly, a voice echoed through the sky from far away.<br/><br/>“Brother Gu!”<br/><br/>At first, the voice was distant but by the second call, it was already at Dragon Gate Island, moving at an extreme speed.<br/><br/>Pop!<br/><br/>The cocoon in front of Gu Yang opened up, revealing Pei Qianlan inside. Her clothing didn’t exist anymore, covered no longer by a stitch of fabric, her hands clung to her chest and embarrassment prevented her from raising her head.<br/><br/>Damn it!<br/><br/>He could hear the whooshing sound of the person approaching; he swiftly removed his outer garment and draped it over Pei Qianlan.<br/><br/>“Brother Gu—”<br/><br/>A figure landed on the ground. It was King Jinghai, who, upon seeing the scene before him froze, his voice abruptly cut off.<br/><br/>Pei Qianlan recognized the man by his voice; her face turned deathly white from the shame and embarrassment, making her wish the ground would swallow her whole.<br/><br/>Gu Yang prided himself on his thick skin, but even he was embarrassed to such an extent that he wished he could bury his foot in the ground.<br/><br/>“King Wuda, listen—it’s not what ” He tried to explain.<br/><br/>King Jinghai turned away, saying, “Such is the great desire of human relationships, and I, as your elder, can understand. But Brother Gu, hear me now. I have always regarded Qianlan as my own daughter. If you dare to hurt her in the future, I will not let you off.”<br/><br/>With that, he took off into the sky and disappeared over the horizon.<br/><br/>He came and left quickly.<br/><br/>It really isn’t what you think.<br/><br/>Gu Yang felt as though an iron pot had fallen from the sky onto him. The worst part was that he was unable to explain. Anyone who saw the scene would mistake it for something else.<br/><br/>He won’t be able to face King Jinghai ever again.<br/><br/>He had solemnly vowed that he didn’t have feelings for Pei Qianlan, yet turned around and ran off with her. To top it all off, they were “caught in the act.” Although it was entirely not what it seemed, from the outsider’s point of view, it was just as it appeared.<br/><br/>“What kind of person have I become?”<br/><br/>He was completely despondent.<br/><br/>“Gu  Lord Gu ”<br/><br/>Suddenly, Pei Qianlan, hiding behind him, timidly tugged at his clothes and spoke.<br/><br/>Gu Yang turned to look at her, she was only wearing a thin coat, and her legs were still bare. It wasn’t appropriate to be seen like this, so he decided to remove his pants as well.<br/><br/>Pei Qianlan’s face turned red as a beetroot, nervous and shy, “You  what  what are you trying to do?”<br/><br/>What on earth were they thinking?<br/><br/>Gu Yang felt exhausted. Quickly removing his pants and top, he tossed them at her, “Put these on.”<br/><br/>And so, wearing only his boxershorts, he ran to the camp to get a clean set of clothes to put on.<br/><br/>There was no one in the camp, everyone must have left the island.<br/><br/>When he arrived, he saw several small boats parked on the dock. There would be no problem returning to the continent.<br/><br/>When Gu Yang returned to the waterfall, Pei Qianlan had already changed into his clothes, which were quite large for her. The spaciousness of the outfit made the sleeves and pants too long, so they could only be rolled up.<br/><br/>She tied up her long hair with a strip of cloth. This style could not conceal her beauty at all, but rather it added a unique charm to her appearance.<br/><br/>She was indeed a natural beauty.<br/><br/>Gu Yang was stunned at the sight.<br/><br/>Pei Qianlan saw him staring at her. Her heart was filled with both shyness and joy as she played with the tie of the clothing. She whispered, “What are you looking at?”<br/><br/>Gu Yang exclaimed, “If I introduce you to my classmates on Earth, they would surely be so envious.”<br/><br/>Even though Pei Qianlan didn’t know exactly what place Earth was, she got the idea from his words, which sweetened her heart.<br/><br/>“Let’s go and check out the Dragon Washing Pond,” he said.<br/><br/>Back on Earth, he was the only single guy in his dorm, which often made him the target of his friends’ teasing. A sense of nostalgia swept over him.<br/><br/>However, he quickly pulled himself out from that mood.<br/><br/>The Dragon Washing Pond was of immeasurable value for the mortal realm, despite the mysterious elder’s disregard for it.<br/><br/>Lei Hao probably attained his Golden Body by using it.<br/><br/>Gu Yang also benefited a lot from the Dragon Washing Pond, as he finally tempered his innate body after countless simulations.<br/><br/>The credit goes greatly to his innate body for his current tremendous strength.<br/><br/>It didn’t take Gu Yang long to locate the Dragon Washing Pond, which was situated behind the waterfall inside a large cave.<br/><br/>The pure white pool water was filled with astonishing energy.<br/><br/>“My injuries are completely healed, so I don’t need this anymore. You should use it,” Pei Qianlan said.<br/><br/>The drop of liquid tossed out by the elder was likely the true water of the Dragon Washing Pond. Not only did it completely restore her depleted foundation, but it also helped her consolidate her innate body.<br/><br/>For her, the path to the realm of divine power was no longer obstructed.<br/><br/>This was the true definition of a naturally gifted treasure.<br/><br/>She indeed did not need the water here.<br/><br/>Gu Yang shook his head. “This is no longer useful to me. Let’s go.”<br/><br/>“Where to?”<br/><br/>“To wait outside.”<br/><br/>Soon, Pei Qianlan realized who Gu Yang was waiting for.<br/><br/>A boat appeared on the sea, and soon several people flew over; they were Lily, Su Qingzhen and Xu Ruomei.<br/><br/>Gu Yang hadn’t foreseen this using his predictive abilities or the simulator. He was down to his last simulation and wouldn’t impulsively use it like last time.<br/><br/>It had to be saved for a crucial moment.<br/><br/>He had made a guess.<br/><br/>King Jinghai, who should have been in seclusion to consolidate his cultivation level, had made a special trip to Dragon Gate Island to find him. This must be because Su Qingzhen and the others had sought help from the palace.<br/><br/>When Gu Yang had left, Su Qingzhen and Xu Ruomei were still feuding. He had told Zhang Xiao Hai he would be going to Dragon Gate Island and would return in a few days or two weeks at the most.<br/><br/>Yet, it was only two days later, and she had already gone to King Jinghai for help.<br/><br/>She really didn’t have any faith in him at all.<br/><br/>“They’re here,” he said.<br/><br/>After Lily brought them to the ground, Gu Yang spoke first before they could, saying “Follow me,” then leapt up to lead the way, not giving them a chance to speak.<br/><br/>Seeing that Gu Yang was safe and sound, Su Qingzhen and Xu Ruomei finally let out a sigh of relief.<br/><br/>But upon seeing that Pei Qianlan was wearing Gu Yang’s clothes, they were overwhelmed with bitterness.<br/><br/>Seeing no response from them, Lily once again performed a spell, leading them into the air after Gu Yang.<br/><br/>Shortly after, they arrived at a waterfall.<br/><br/>Gu Yang led them through the waterfall and disappeared from sight.<br/><br/>Lily also followed him in. Inside was a cave leading to a small pool in its deepest part.<br/><br/>He said, “This is the Dragon Washing Pond. Go in and soak yourselves. The benefits you gain would depend on yourselves.”<br/><br/>After he finished speaking, Gu Yang left with Pei Qianlan.<br/><br/>PS: The first update, seeking the monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}