{"id": 156, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310391.html", "title": "Chapter 156 - Chapter 156: 156 Dragon Washing Pond", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 156 - Chapter 156: 156 Dragon Washing Pond</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 156: 156 Dragon Washing Pond<br/><br/>Translator: 549690339<br/><br/>Pei Qianlan watched as Lei Hao’s head was chopped off, rolling on the ground a few times before coming to a stop. His eyes bulged out in a look of death as if his last wish hadn’t come true.<br/><br/>His remaining body turned into dust and was scattered in the wind.<br/><br/>Her eyes reddened instantly. Lei Hao had done the same thing to her father many years ago—grinding his bones to dust.<br/><br/>She raised her head to the sky, tears streaming down her cheeks. She murmured, “Father, mother  your daughter has avenged your deaths ”<br/><br/>Gu Yang stepped back, allowing her to vent her emotions. He turned to Lei Hao’s subordinates and asked, “Where is the treasure Lei Hao left behind?”<br/><br/>Under his oppressive gaze, the present ones were shivering like leaves. When they heard his question, they were struck dumb.<br/><br/>The treasure?<br/><br/>For a moment, they thought they had heard wrong.<br/><br/>Could it be that this unparalleled powerhouse was actually interested in the gold and silver that Lei Hao left behind?<br/><br/>Shen Nine reacted the fastest, saying, “It’s all in the stockade.”<br/><br/>Gu Yang said, “Take me there.”<br/><br/>There was a stockade on the island. Rather than a stockade, it was more like a small town, filled not just with Lei Hao’s subordinates but also many ordinary individuals.<br/><br/>Most likely, they were kidnapped by Lei Hao and his men. The ordinary people looked gaunt and ragged, showcasing Lei Hao’s group’s cold indifference towards them.<br/><br/>Guided by someone, Gu Yang quickly found the treasure Lei Hao had left behind.<br/><br/>“Just this little?”<br/><br/>He looked suspiciously at Shen Nine, who had guided him here.<br/><br/>Going by his estimates, the treasure was worth no more than several hundreds of thousands taels.<br/><br/>Lei Hao was the son of a pirate king. Was this all he had?<br/><br/>Shen Nine shrank under his gaze, kneeled, and said, “Your honor, Dragon Gate Island is off the beaten track, and Lei Hao was often too indulged in his cultivation to bother plundering earning money. All these treasures were amassed by our previous lord, that’s all that’s left after so many years  ”<br/><br/>Even someone at the level of Divine Power was so poor.<br/><br/>Gu Yang grumbled quietly. Turning to the man who had led him to the treasure, he said, “Thank you.”<br/><br/>Shen Nine was suddenly overjoyed, but before he could utter a word, he shuddered violently. He fell to the ground, blood oozing from his seven orifices, and died.<br/><br/>Gu Yang didn’t spare a glance at the fallen corpse. First, he withdrew several hundreds of taels of silver, then, transferred all the remaining gold and silver into the system. His balance amounted to ninety-three thousand.<br/><br/>Gu Yang was a man of clear rewards and punishments. The thanks were for the man helping him save time by leading him to the treasure.<br/><br/>As for the reason for him to kill, the man needed to die.<br/><br/>Not only him, but the other thirty or so bandits outside wouldn’t be spared either.<br/><br/>Unbeknownst to himself, Gu Yang’s heart had hardened. Killing no longer weighed on his mind like before.<br/><br/>Gu Yang collected the remaining gems and jewels from the ground, stuffing them into a cloth bag. Coupled with the silver, he left along with Pei Qianlan, leaving behind a ground full of corpses.<br/><br/>With his current strength, he didn’t even have to lift a finger to kill the Mortal Realm martial artists. One quake of True Essence was enough to kill a person from afar.<br/><br/>When Gu Yang went outside, he called over the commoners and found a leader among them. He told them that Lei Hao and his gang were dead and they were now free. He then gave them a few hundred taels.<br/><br/>As for their future, it was up to them to decide.<br/><br/>Then Gu Yang took Pei Qianlan and left, planning to find the Dragon Washing Pond. Not far from there, he ran into the elderly man from the ship.<br/><br/>He asked, “Didn’t the senior say he wanted to go to the hot spring?”<br/><br/>The elderly man smiled and said, “Yes, I came to ask the young brother for help. I am too old to deal with that beast.”<br/><br/>Gu Yang questioned, “Beast?”<br/><br/>The elderly man replied, “Yes, there’s a strange snake guarding the hot spring, it’s extremely formidable. If you’re willing to help me drive it away, I can do you a favor.”<br/><br/>Something felt off to Gu Yang. He looked closely at the elder again and confirmed that he was indeed at the peak of the First Rank.<br/><br/>The elderly man had experienced his strength, yet he behaved so casually, as though he was not afraid at all.<br/><br/>What was he depending on?<br/><br/>Gu Yang had not previously taken the elderly man seriously. But now, he was finally on alert and asked, “What kind of favor?”<br/><br/>The elderly man raised his hand.<br/><br/>Suddenly, something flew out of Gu Yang’s embrace. He gasped in surprise.<br/><br/>With his current strength, his Protective Gang Qi had been involuntarily activated. Yet the man was able to effortlessly take something from him without making a sound.<br/><br/>This meant that if the man had malicious intentions, Gu Yang would have been attacked before he even realized it.<br/><br/>What flew out was the Phoenix gall that Lily had given him.<br/><br/>The elder pointed his finger directly at the Phoenix gall. The outer crystal shattered instantly, and a drop of crimson blood flew out, penetrating into Gu Yang’s forehead.<br/><br/>Throughout this process, Gu Yang couldn’t react at all, he could only watch as the drop of blood passed and seeped into his forehead.<br/><br/>He subconsciously touched his forehead, his eyes on the elder had completely changed.<br/><br/>Having such an unbelievable skill, he is surely a greatly powerful man.<br/><br/>Gu Yang said hoarsely, “Why is the elder playing such a joke on me?”<br/><br/>“In the future, you will thank me.”<br/><br/>Not knowing what the elder was thinking, the smile on his face broadened and he seemed extremely happy.<br/><br/>Gu Yang turned his gaze inward, that drop of blood seemed to have melted into his body.<br/><br/>He could feel his body undergoing some changes, but whether for better or worse, for now he couldn’t tell.<br/><br/>After finishing laughing, the elder finally said, “Let’s go, now it’s your turn to help me.”<br/><br/>Gu Yang was not panicked. If the elder had any malice towards him, he would have died already. Since he didn’t kill him, but used this technique on him, he must want something.<br/><br/>He has the simulator, no matter what the elder’s intentions are, he is always capable of finding a solution.<br/><br/>“Yes”.<br/><br/>At this time, he only needed to cooperate.<br/><br/>Gu Yang and his two companions arrived at the center of the island, where there was a tall mountain. The most eye-catching feature was a waterfall hundreds of meters high, looking extremely spectacular.<br/><br/>The elder said, “This is the Dragon Gate. It was originally thousands of meters high, but later the top was cut off by a sword, and only this part is left.”<br/><br/>“Once you pass this gate, you can reach the true Dragon Washing Pond. The pool below is only a drop of Thunder Dragon blood, which is somewhat useful for those in the mortal realm.”<br/><br/>While the elder was speaking, he led the two people into the air, and in an instant, they were several kilometers high.<br/><br/>“When you see that snake, cut it with a Thunder Annihilation strike.”<br/><br/>“Okay.”<br/><br/>This was Gu Yang’s first time reaching such a high altitude, he was somewhat nervous and subconsciously held the Phoenix Feather Knife tightly.<br/><br/>Suddenly, a huge gate opened before their eyes.<br/><br/>“Roar!”<br/><br/>At the same time, a huge shadow rushed over.<br/><br/>Without any hesitation, Gu Yang gathered all his strength and immediately unleashed the Thunder Annihilation. Countless lightning flashes illuminated the true form of that huge shadow.<br/><br/>It was clearly a flood dragon, with a high bulge on its forehead, growing dragon horns.<br/><br/>The snake body was hundreds of meters long, and the thick snake body was as enormous as a mammoth.<br/><br/>In front of it, Gu Yang seemed so insignificant.<br/><br/>He was taken aback, was this the beast the elder spoke of?<br/><br/>Can I really handle this?<br/><br/>While he was thinking, the scales on the enormous snake seemed to shiver. Its huge, purple, vertical pupils shrunk, and it was so frightened it fled.<br/><br/>“It soon will undergo a Thunder Tribulation. Thunder Annihilation is precisely its nemesis.” The elder’s voice reached his ears.<br/><br/>Gu Yang turned to look, and saw that the elder had disappeared, the huge portal was slowly closing.<br/><br/>He must have entered the Dragon Gate.<br/><br/>Just when the portal was about to close completely, a droplet of crystal liquid flew out, and penetrated Pei Qianlan’s forehead.<br/><br/>“This is what you deserve”<br/><br/>Then, the portal disappeared, and the voice stopped abruptly.<br/><br/>“Ah”<br/><br/>Pei Qianlan let out a scream of extreme pain. From her mouth and nose, a large amount of white mist gushed out, enveloping her.<br/><br/>Gu Yang saw that there was a strange energy in her body that was constantly transforming her body.<br/><br/>He too had experienced this. It was a rebirth.<br/><br/>For her, this was undoubtedly a tremendous opportunity.<br/><br/>PS: The third update, asking for monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}