{"id": 159, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310400.html", "title": "Chapter 159 - Chapter 159: The 159Th Eldest Son Has Been Captured", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 159 - Chapter 159: The 159Th Eldest Son Has Been Captured</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 159: The 159th eldest son has been captured<br/><br/>Translator: 549690339<br/><br/>“The Lin Family from Jiangzhou?”<br/><br/>On hearing this, Wu Er said irritably, “Are you getting ahead of yourself? The Lin Family of Jiangzhou is a branch of the Lin Family. Not just anyone can afford to provoke them. You – ”<br/><br/>As he spoke, something caught in his throat, his eyes fixed on Gu Yang. His eyeballs nearly burst from their sockets as if he had seen a ghost, “You you the Golden Body?”<br/><br/>It was only now that he noticed something different about Gu Yang. He looked more closely – good lord, it was indeed the Golden Body!<br/><br/>Even with all his wisdom and experience, Wu Er was dumbfounded by such an unbelievable incident.<br/><br/>Gu Yang’s cultivation speed was continually shattering his understanding.<br/><br/>He had already overestimated Gu Yang as much as possible. He simply couldn’t fathom how this kid had managed to cultivate the Golden Body in less than a month.<br/><br/>Unable to contain himself, Wu Er asked, “You can’t possibly be a reincarnation of an ancient grandmaster, can you?”<br/><br/>Gu Yang laughed and said, “If I say I am, how would you react?”<br/><br/>“Well, obviously I would cling to your coattails.”<br/><br/>Making a joke, Wu Er moved the conversation along and mused, “You are already halfway to reaching the Divine Power realm. You probably do stand a chance against the Lin Family of Jiangzhou. If confronted with a Golden Body, even if you can’t match them, you should have no difficulty escaping.”<br/><br/>The Lin Family of Jiangzhou, as a branch of one of the nine great families, had sole control over a state. Of course, it would not be so simple.<br/><br/>Wu Er’s words implied that he suspected that the Lin Family of Jiangzhou likely has a Golden Body realm powerhouse.<br/><br/>“I heard that the Lin family has always kept a low profile, never involving themselves in the affairs of the martial world or the politics of the court.”<br/><br/>Gu Yang felt that it was necessary to know more about the Lin Family.<br/><br/>Wu Er snorted, “That’s now. Over four hundred years ago, the Lin family was the head of the nine great families and acted with total domination ”<br/><br/>Elsewhere, an old man and a young woman were also discussing the Lin Family.<br/><br/>The young woman, dressed as a man, exuded a strong feminine aura from her brows and eyelashes. Anyone who wasn’t blind could tell she was a woman.<br/><br/>She was riding a divine horse with golden fur and said, “The Lin Family has long been declining. For hundreds of years, they’ve been like a turtle retracting its head into its shell, stuck in Ningzhou, not producing any remarkable figures. Let’s not even mention this branch family in Jiangzhou. What’s so good about going there? We should quickly go to Jingzhou and find that Gu Yang.”<br/><br/>Riding a black horse beside her was an old man dressed in green. With his white, beardless face, completely white hair and eyebrows, and frail body, the old man’s voice was high-pitched.<br/><br/>“You’re not aware, princess. In the previous dynasty, the Lin Family was the leader of the nine great families. Because the Lin Family once produced a Celestial Being, they were the only nobility in the nine great families to have done so ”<br/><br/>The princess said, “I know that. It was exactly due to that Celestial Being from the Lin Family that the Qin Dynasty collapsed. This allowed our Zhao Family to take advantage of the chaos and seize power, establishing a foundation of hundreds of years.”<br/><br/>“Correct. After the death of that Celestial Being from the Lin Family, they shut their doors to the outside world. Until a hundred years ago, a Lin descendant came to Jiangzhou and founded this branch. It’s quite mysterious.”<br/><br/>“The Jiangzhou Lin Family received part of the Lin Family’s true teachings. After all, they’re a family that produced a Celestial Being. Their martial arts must have unique features.”<br/><br/>“Besides, about Gu Yang  there are rumors that he has already left Jingzhou. As for where he has gone, we have yet to find out. Why not go to the Lin Family first and see for ourselves?”<br/><br/>Upon hearing that Gu Yang’s whereabouts were unknown, the princess couldn’t help but feel disappointed. She had finally persuaded her father to let her leave the Divine City on this trip, intending to find Gu Yang and challenge him.<br/><br/>Who would have thought that as soon as she arrived in Jiangzhou, Gu Yang had disappeared?<br/><br/>Her enthusiasm faded. She reluctantly nodded and said, “Alright.”<br/><br/>In Jiangzhou City, at the Lin Family residence.<br/><br/>“Zhao Yu  the third princess?”<br/><br/>Upon seeing the name on the card, Lin Youliang couldn’t help but feel a headache.<br/><br/>Even though the card only showed her name without mentioning her status as a princess, it was obvious that the card was from the royal family. It was clear that the holder was the famous third princess.<br/><br/>The current emperor has a total of seven sons and three daughters.<br/><br/>Among them, the third princess is the youngest. The previous queen died in childbirth after giving birth to her.<br/><br/>It is said that the third princess is the emperor’s favorite. Even the royal secret tradition of the Zhao family, the “Dragon Emperor Extreme Path,” which has always been passed down to sons and not daughters, was exceptionally given to this daughter.<br/><br/>Although the major lists of the Red Mansion do not record members of the royal family,<br/><br/>Every major power has its own sources of information. It was rumored that the cultivation level of the Third Princess surpassed all princes and had reached First Rank Peak status.<br/><br/>At her age, she can be considered the first person in the royal family in two hundred years.<br/><br/>With all the resources of the world at the royal family’s disposal, combined with the secrets they inherited from the inscrutable palace in the Divine City, their cultivation speed is incomparable to others given the vast amount of resources they possess.<br/><br/>Not to mention a once-in-a-century prodigy like the Third Princess.<br/><br/>At such a tender age, she has already reached First Rank Peak status, a feat only the royal family can achieve.<br/><br/>Other forces would not squander so many resources on one person as it would just be too wasteful.<br/><br/>“Why has she come to Jiangzhou?”<br/><br/>This person of noble and powerful status turning up unannounced on their turf certainly wasn’t for any good reason.<br/><br/>As head of the family, Lin Youliang, however reluctantly, had to receive her personally.<br/><br/>Moreover, he needed to put on a grand and formal reception, he couldn’t afford any lapses in protocol.<br/><br/>A princess must be respected nonetheless.<br/><br/>This Third Princess was known for her independence and unique style. It was said that she once stormed into Red Mansion out of anger of not being included in the Beauty List, eventually forcing the owner to add her name.<br/><br/>It just goes to show how willful she can be.<br/><br/>“Where is Zi Hua?”<br/><br/>Lin Youliang inquired about his eldest son.<br/><br/>A man who looked like a housekeeper replied, “It seems that there was some problem at the bank. The eldest son took some people to handle it.”<br/><br/>“Send someone to retrieve him.”<br/><br/>When Lin Youliang led his people to the front gate, he saw the Third Princess from the rumours, who was only accompanied by a eunuch.<br/><br/>“We greet the Third Princess.” Lin Youliang and his group prepared to pay their respects.<br/><br/>“Alright.”<br/><br/>Zhao Yu said impatiently, “I am here today under the identity of Zhao Yu, there’s no need for these formalities.”<br/><br/>Despite her dissent, Lin Youliang maintained his respectful demeanor, “What can we do for Miss Zhao who graced our humble home with her presence?”<br/><br/>Just as Zhao Yu was about to speak, a galloping horse suddenly made its appearance, allowing itself into the scene.<br/><br/>The knight on the horse was vomiting blood and saying, “Something bad has happened the young master is in danger ” After speaking, the man toppled down from the horse and was clearly not going to survive.<br/><br/>This sudden and unexpected incident perked up Zhao Yu’s spirit.<br/><br/>She had seen enough of these old foxes like Lin Youliang. Even if she was to request to witness Lin Family’s martial arts, at most they would send someone pretending to put up a show and then admits defeat, denying her the chance to see their true uniqueness.<br/><br/>She can’t be too aggressive. When she left, her father cautions her repeatedly not to overpower others, and not to provoke the members of the six major sects and the nine prominent families.<br/><br/>Hence, she was not initially that interested. But now with this sudden event, her interest was piqued.<br/><br/>She wonders who would dare to strike at the eldest son of the Lin Family,<br/><br/>Naturally, the Lin Family wouldn’t let this go without a fight, there might be a chance to see their secret and unique martial arts after all.<br/><br/>This could really become interesting.<br/><br/>Lin Youliang was both shocked and angry. To have such an incident happen during the Third Princess’ visit, it was like a slap on his face, and it stung furiously.<br/><br/>Who would dare to hurt his son?<br/><br/>PS: I hope that all of you take care of your gallbladders, don’t be like me, with acute inflammation, vomiting out bile, squirming in pain on the hospital bed, if it weren’t for the doctor giving me a shot of strong painkillers, you guys would only be offering me your condolences now\t\t\t\t\t\t</div>", "images": {}, "success": true}