{"id": 152, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310379.html", "title": "Chapter 152 - Chapter 152: 152 Phoenix Gallbladder", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 152 - Chapter 152: 152 Phoenix Gallbladder</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 152: 152 Phoenix Gallbladder<br/><br/>Translator: 549690339<br/><br/>Half an hour later, the red flames all over Gu Yang’s body finally dissipated.<br/><br/>The luminous glow on his skin became even more apparent. This indicated that under the tempering of the flames, he drew even nearer to the Golden Body.<br/><br/>“No wonder this cultivation method, up until the Divine Power realm, would never encounter a bottleneck. So, all the previous rebirths were preparation for now.”<br/><br/>The last rebirth, from the Ninth Rank to the First Rank, would involve a tempering of the body each time, and when the First Rank peak was reached, the Golden Body could be formed. Entering the Divine Power realm after that would be as easy as flipping a hand.<br/><br/>This was essentially spreading the difficulty of breaking through to the Divine Power realm through regular cultivation.<br/><br/>Surely a genius idea.<br/><br/>The problem was, aside from him, there’s probably nobody who could cultivate this method to the Divine Power realm in their lifetimes.<br/><br/>No matter how extraordinary the talent, without a few hundred years of life span, it’s impossible to complete the cultivation.<br/><br/>Suddenly, Gu Yang thought of a possibility, “Unless this cultivation method was not meant for humans who have less than a hundred years of life span.”<br/><br/>On the surface, this looks like a world of Martial Arts.<br/><br/>But that’s actually an illusion. Just look at the Divine Power realm behind, and the higher Celestial Being realm, one could see that this is actually a world of fantasy martial arts.<br/><br/>While the Dragon Clan bloodline had emerged, it would also make sense for there to be some long-lived species.<br/><br/>“Continue.”<br/><br/>Just like before, Gu Yang simulated again and again.<br/><br/>Each time he broke through a realm, the phantom of the Phoenix would appear, bursting into red flames, tempering his mortal body, transforming him step by step towards the Golden Body realm.<br/><br/>At the tenth simulation<br/><br/>[ You have re-entered the First Rank ]<br/><br/>[ You turn fifty-three in the end.]<br/><br/>Finally returned to the First Rank!<br/><br/>By this time, night had fallen, and red flames ignited again inside Gu Yang.<br/><br/>This time, it lasted longer and was more intense than before.<br/><br/>What was magical was that, with such a large fire, his clothes, the wooden bed underneath him, and the entire house wasn’t ignited by the flames.<br/><br/>Gu Yang was in a mysterious state, with the fire burning his whole body, refining his physique bit by bit. Yet he didn’t feel any pain at all.<br/><br/>He himself was already an innate body and had already experienced such pain once before. This greatly accelerated the process.<br/><br/>When everything calmed down, Gu Yang opened his eyes, a golden light shining in his pupils. His skin gleamed with a golden glow.<br/><br/>He clenched his fists, feeling the surging power within his body. He knew he was only one step away from the completion of the Golden Body.<br/><br/>“Again.”<br/><br/>By this time, he had forgotten about everything else, entering a state of complete self-forgetfulness.<br/><br/>His balance remains three million three hundred thousand.<br/><br/>In one go, Gu Yang used up all six chances for simulation.<br/><br/>When the sixth simulation ended, and Gu Yang was unable to make another breakthrough, a tinge of regret shadowed his face, “I’m still a bit off.”<br/><br/>Moreover, he clearly felt that his progress was slowing. After the simulation, there was no surge of True Essence like before, as if he was back to where he started.<br/><br/>“It seems that I used up too much True Essence that day, and there’s no stock left in the Phoenix body,” he figured out the problem rather quickly.<br/><br/>That day, he was ambushed by the Golden Body Realm individual from the Shen Family, and he had drawn a lot of True Essence from the Phoenix body to block the opponent’s fist.<br/><br/>The depleted True Essence wouldn’t naturally recover.<br/><br/>This was also slowing down his cultivation speed.<br/><br/>“But, this is already enough.”<br/><br/>Confidence shone from Gu Yang’s eyes.<br/><br/>At this point, his body had strengthened unimaginably compared to before his reformation – it wouldn’t be an exaggeration to describe him as being half a step into the Golden Body stage.<br/><br/>The True Essence within him had also strengthened more than tenfold.<br/><br/>If the Shen Family’s Golden Body Realm individual came again, he is confident to fight against them.<br/><br/>Gu Yang stood up, drawing back his aura, patted his clothes, and walked out the door.<br/><br/>In the courtyard were Su Qingzhen and Xu Ruomei. They were obviously worried due to the loud disturbance, so they all came over.<br/><br/>Upon seeing Gu Yang emerge, everyone breathed a sigh of relief.<br/><br/>Before they could ask, Gu Yang said, “I’m a bit hungry. Xiao Hai, go get some food for me. Have you eaten yet?”<br/><br/>“I’m on it,” replied Zhang Xiao Hai as he dashes off to prepare the food.<br/><br/>Gu Yang’s eyes grazed over Su Qingzhen, Xu Ruomei, and Pei Qianlan, noticing the peculiar atmosphere among them, and said, “In fact, allow me to introduce ”<br/><br/>Xu Ruomei responded indifferently, “Pei Qianlan, the 7th on the Beauty List, naturally beautiful, a well-known Queen of Jinghai, I already know her.”<br/><br/>She bluntly revealed Pei Qianlan’s identity.<br/><br/>Gu Yang instinctively looked at Wu Xingyun and noticed that he wasn’t surprised at all, as if he had already known about Pei Qianlan’s identity.<br/><br/>Without uttering a word, he turned around and left.<br/><br/>On the other hand, Su Qingzhen looked at him incredulously, her face flushed. She stammered, “You  you ”<br/><br/>But after stuttering for a long time, she couldn’t manage to say anything and stomped her feet, turning around to run away.<br/><br/>“Miss,” called Zhi Xing, the maid, as she quickly followed her.<br/><br/>Xu Ruomei also turned and left in a different direction.<br/><br/>Only Lily, the foreign sorceress, and Han Mengling, the disciple of the Asura Sword Saint, remained, watching the spectacle unfold with confused expressions.<br/><br/>Pei Qianlan asked softly, “Aren’t you going to follow her?”<br/><br/>Gu Yang shook his head, “No. I need to rest and gather my strength for tomorrow’s battle.”<br/><br/>“Actually “, Pei Qianlan began to reply, thinking she should persuade him.<br/><br/>“Saint!”<br/><br/>At that moment, Lily couldn’t hold back anymore and knelt in front of Gu Yang. She babbled anxiously in her language, using a few words of the Great Zhou language.<br/><br/>Despite guessing, Gu Yang still could not understand what she was trying to convey.<br/><br/>Pei Qianlan, who grew up in Jingzhou City and could understand some of the West Bank Continent’s language, reminded him, “It seems that she wants to give you something.”<br/><br/>Then, Lily took out a crystal ball, held it in her hands, and began to recite a long spell with a solemn expression.<br/><br/>Gu Yang felt a strange fluctuation. Suddenly, the crystal ball split open, and a red crystal flew out, floating in the air.<br/><br/>The crack in the crystal ball disappeared immediately. Lily lifted the red crystal with both hands, holding it above her head with an almost reverent posture, offering it to Gu Yang.<br/><br/>“For me?”<br/><br/>Curiously, Gu Yang reached out and squeezed the red crystal. As soon as he touched it, he immediately felt a sense of kinship.<br/><br/>He couldn’t help but marvel as he inspected the crystal. It was prism-shaped, about the size of a fist. Initially pure light red, it became more intense as he held it, eventually turning into a dark crimson.<br/><br/>He asked, “What is this?”<br/><br/>Lily respectfully muttered a word, entirely incomprehensible.<br/><br/>Pei Qianlan beside helped translate, “It appears to be a sacred artifact of their organization, something about a god bird’s gall.”<br/><br/>Phoenix gall?<br/><br/>Gu Yang thought for a moment and accepted the item. His intuition told him that this crystal would be very useful. He thought to study it further in the future.<br/><br/>“When you have time, teach her some of the Great Zhou’s language,” he instructed.<br/><br/>“Okay,” Pei Qianlan agreed.<br/><br/>Lily, seemingly understanding them, said to Pei Qianlan, “My name is Lily, and I am a sorceress.”<br/><br/>That was the most fluent Great Zhou language she had spoken.<br/><br/>As night fell, Gu Yang, with two flagons of wine, came to Wu Xingyun’s courtyard.<br/><br/>Wu Xingyun was sitting in the pavilion with a sword on his lap. Gone was his dejection from the past few days, he now appeared as sharp as a drawn sword.<br/><br/>He wasn’t surprised by Gu Yang’s arrival. Accepting a jug of wine, he took a sip and said, “Brother Gu, I have decided to depart.”<br/><br/>Gu Yang paused, then took a big gulp of his wine, asking, “Where are you planning to go?”<br/><br/>“I have long wanted to explore the world. Now, I have finally made up my mind.”<br/><br/>Wu Xingyun looked at Gu Yang, showing a peaceful smile, “I made a vow at my mother’s grave that during my lifetime, I must surpass him. Now, he has reached the Divine Power realm. If I don’t make significant progress quickly, I will be left farther and farther behind.”<br/><br/>Gu Yang, left with thousands of unsaid words, could only say one thing, “Safe travels.”<br/><br/>“I will heed your good words, Brother Gu,” replied Wu Xingyun.<br/><br/>PS: Second update of the day, asking for monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}