{"id": 163, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14315142.html", "title": "Chapter 163 - Chapter 163 163 Settled By A Single Word (Third Update, Asking For Monthly Tickets)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 163 - Chapter 163 163 Settled By A Single Word (Third Update, Asking For Monthly Tickets)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 163 163 Settled by a Single Word (Third update, asking for monthly tickets)<br/><br/>Translator: 549690339<br/><br/>“Five million taels, I’m afraid I can’t make do at the moment…”<br/><br/>Lin Youliang said, trembling slightly.<br/><br/>When he assumed leadership of the Lin family, they had already established themselves in Jiangzhou, and everything had been relatively peaceful. Even when there were some disturbances, they never shook the Lin family’s foundation.<br/><br/>But now, he was facing a life-and-death crisis and a wrong move would lead to the complete destruction of the great Lin family. He couldn’t help but feel terrified.<br/><br/>Even before he finished speaking, beads of sweat were already welling up on his forehead.<br/><br/>“Oh?”<br/><br/>Gu Yang looked at him expressionlessly.<br/><br/>Lin Youliang’s voice was trembling, “Now is the time to stock up on raw silk and tea leaves. The majority of the money at hand has already gone towards these two commodities…”<br/><br/>Gu Yang said, “Such a big bank. Can’t even get your hands on five million taels?”<br/><br/>“Yes… it’s true. There has been a cash shortage in several nearby states so far this year… It is said that the imperial family withdrew a large amount of money from the Four Sea Bank… Many merchants have started to only accept cash.”<br/><br/>Was there such thing?<br/><br/>Gu Yang was slightly surprised, but he didn’t doubt Lin Youliang’s words.<br/><br/>For a family like the Lin family, money was not a valued resource. If they could pay to avoid disaster, they would be more than happy to do so.<br/><br/>He contemplated that this cash shortage was likely related to him as well.<br/><br/>Ever since he left Lian Mountain, he had no idea how many taels he had charged to his system in just a few months. He estimated it was probably several tens of millions of taels, which would definitely have some impact.<br/><br/>However, what was the royal family doing with all the money withdrawn from the Four Sea Bank?<br/><br/>Competing with me for business?<br/><br/>It seems that it is necessary to visit the Divine City after all.<br/><br/>The Four Sea Bank was spread throughout the world, and no one could match its amount of money. The royal family withdrew a massive amount of money from the Four Sea Bank.<br/><br/>All that money must have been sent to the Divine City.<br/><br/>Later, when he found out the location of the deposits, he would take them all at once.<br/><br/>While Gu Yang was considering this plan, Lin Youliang dared not breathe. Steadying his nerve he continued, “For now, we can muster a maximum of 2 million taels…”<br/><br/>“That little?” Gu Yang was slightly dissatisfied. It was hard work to win this fight, and this was all he could earn. It was the Golden Body Realm after all, the bones were so hard, his Phoenix Feather knife almost went blunt.<br/><br/>Lin Youliang immediately fell to the ground and cried loudly, “The Lin Family is willing to offer our secret treasury to you.”<br/><br/>Gu Yang stroked his chin and spoke with some difficulty, “Alright then.”<br/><br/>In the simulation, he found the Xia Dynasty treasure map in the Lin family’s secret treasury.<br/><br/>Unfortunately, it was of no use, as there were copies of this treasure map.<br/><br/>Furthermore, there was a strong Unleaking Realm guardian at that treasure spot. Attempting to steal it would be equivalent to suicide.<br/><br/>Well, having half a loaf is better than none, especially considering the circumstance.<br/><br/>Gu Yang’s time was precious, and he had no time for waiting for the Lin family to raise the money.<br/><br/>If he did not go to the Divine City now, he expected that Cao Yiyi’s divine shooter father would soon catch up to him.<br/><br/>“Wait.”<br/><br/>Just as Gu Yang was about to move the Lin family forward, a woman jumped out. It was the cross-dressing girl.<br/><br/>Indeed, he was destined to be followed by calamities from which he could not escape.<br/><br/>He couldn’t help but sigh in his heart.<br/><br/>The young woman’s appearance and spirit were so outstanding, in no way inferior to Su Qingzhen and Xu Ruomei. Without a doubt, she must be on the Beauty List.<br/><br/>How many was this now?<br/><br/>Gu Yang really didn’t want to deal with such troubles. However, glancing at the elderly person next to him, he decided to give him some face and asked coldly, “What is it?”<br/><br/>The woman asked seriously, “Gu Yang, can you teach me the ‘God Destroyer Six Styles’?”<br/><br/>Why are these women so brazen, making such demands on their first meeting?<br/><br/>Did they really believe they could do whatever they wanted with a Divine Power Realm follower by their side?<br/><br/>Gu Yang couldn’t even be bothered to look at her again, he tossed a single word, “No,” and turned to leave.<br/><br/>“I’ll give five million taels.”<br/><br/>The woman’s resounding voice echoed from behind.<br/><br/>Gu Yang paused mid-step and coldly said, “Do you know what the ‘God Destroyer Six Styles’ is? It’s a saber technique whose power can destroy the heavens and the earth, passed down from one of the Four Great Sacred Lands…”<br/><br/>“Eight million taels!” The woman promptly raised the price.<br/><br/>“Humph.”<br/><br/>Gu Yang snorted, “When you can get your hands on that amount of cash then come to find me.”<br/><br/>“It’s a deal.”<br/><br/>Zhao Yu, the third princess from behind, clenched her fists, her eyes filled with determination.<br/><br/>“Who is she?”<br/><br/>Upon leaving the bank, Gu Yang asked Lin Youliang.<br/><br/>“The current third princess.”<br/><br/>Lin Youliang was somewhat distracted as he answered.<br/><br/>What had he just heard?<br/><br/>Eight million taels for the ‘Shenxiao Six Demise’ saber technique?<br/><br/>And judging by Gu Yang’s reaction, it seemed plausible!<br/><br/>From the sidelines, he was tempted to ask, ‘Can I buy it too?’<br/><br/>In the end, his remaining sanity prevailed, holding back the question.<br/><br/>Gu Yang knew exactly who it was – Zhao Yu, the eighth beauty on the Beauty List.<br/><br/>Rumors claimed that in order to make it onto the Beauty List, she stormed the Red Mansion and forced the owner to put her name on the list, an arrogantly dominant princess.<br/><br/>Reportedly, she is the emperor’s most favored daughter who might be able to come up with eight million.<br/><br/>Well, this turns out to be a profitable business deal!<br/><br/>If word were to spread that anyone could learn advanced saber techniques like ‘God Destroyer Nine Styles’, ‘Shenxiao Six Demise’, etc, from him for money. Plenty of people would line up to pay for it.<br/><br/>Gu Yang’s horizons were instantly broadened.<br/><br/>Waiting for people to willingly offer money is obviously better than struggling in battles to secure five million.<br/><br/>However, he would need to wait until he breaks through to the Divine Power realm and fully learns the ‘Heavenly Inquiry Nine Knives’.<br/><br/>At present, techniques like ‘God Destroyer Nine Styles’ and ‘Shenxiao Six Demise’ are still of great use to him, and he should not casually disseminate them.<br/><br/>Before long, they arrived at the old mansion of the Lin Family.<br/><br/>The so-called secret vault was located behind the Ancestral Hall of Lin Family- a place holding precious items the family had acquired over the years.<br/><br/>The vault contained rare and unique treasures as well as divine weapons, rare herbs, and even a piece of mysterious meteoric iron.<br/><br/>Without any pretense, Gu Yang packed up all the items in the secret vault into three large boxes.<br/><br/>Finally, he took out the only painting in the vault and asked, “Where did this painting come from?”<br/><br/>Lin Youliang watched as Gu Yang emptied out all the items. His heart bled; these treasures accumulated by the Lin family over the past hundred years, priceless items money can’t buy, were being taken away. Not even their own disciples were not allowed to use them.<br/><br/>Now, Gu Yang had taken everything away. It felt as if a knife was cutting off his flesh piece by piece.<br/><br/>Nevertheless, when Gu Yang asked, he dared not hold back the answer, “It was found in an ancient tomb. It was initially determined to be an item from the Xia Dynasty.”<br/><br/>“Why is this painting placed in the vault? What’s so special about it?”<br/><br/>Gu Yang was curious. He couldn’t see anything special about the painting.<br/><br/>Lin Youliang honestly answered, “I had it appraised, and the person portrayed in the painting might possibly be a princess from the end of the Xia Dynasty. The person buried in that tomb could be a prince. That tomb is rather strange. Even First Rank Martial Artists have been trapped there…”<br/><br/>Gu Yang understood. The Lin Family intended to raid that ancient tomb.<br/><br/>According to historical records, the dynasty before Great Zhou was Qin, and before that was the Xia Dynasty.<br/><br/>Using periodic milestones as measures, the Xia Dynasty was categorized as mid-antique, entirely different from the Qin and Zhou Dynasty.<br/><br/>The historical books he had read didn’t offer explanations as to why it was classified this way.<br/><br/>However, the Xia Dynasty was indeed different from the Qin and Zhou. From beginning to end, the Xia Dynasty had only one emperor who ruled for a thousand years.<br/><br/>Without any exaggeration, he suppressed the whole era with his single-handed power.<br/><br/>With such an emperor, the feature of the Xia Dynasty was bound to be quite unlike the present era.<br/><br/>So the question arose, what relation did the prince who was buried in that tomb have with the Xia Emperor?<br/><br/>Father and son, grandfather and grandson, or…<br/><br/>Well, being a prince during the Xia Dynasty meant a prince forever. With the Xia Emperor ruling, generations of descendants would have perished unseen.<br/><br/>Gu Yang asked, “Where is the location of that tomb?”<br/><br/>Lin Youliang disclosed the location.<br/><br/>“Now, our debts are settled.”<br/><br/>That very night, Gu Yang, driving a carriage laden with three boxes filled with items taken from the Lin Family vaults, bid goodbye to them and leisurely drove out of the city gate.<br/><br/>Regarding the two million taels, he had already transferred it into his system for safekeeping.<br/><br/>Lin Youliang only felt relief when his scout reported that the plague had finally left. It felt like a narrow escape from death.<br/><br/>He was relieved from the core, “Fortunately, that secret wasn’t discovered.”<br/><br/>Outside the city gate, as Gu Yang was driving his carriage, he was thinking, “What the devil is underneath Lin Family’s mansion? It’s at least Mana Realm level, right?”<br/><br/>As soon as he stepped into the Lin residence, he had sensed something strange. By changing his perspective, he found that, hundreds of meters underground, an extremely terrifying energy source was lurking. It was much stronger than Shen Luo and Lin Yimo, the Golden Body Realm martial artists he’d encountered before.<br/><br/>He speculated that it must be someone of Mana Realm.<br/><br/>But this had been beyond his capabilities, he knew about it, but chose to ignore it.<br/><br/>He was just after the money. As for what secrets lay beneath the Lin Family’s home, how did that relate to him?<br/><br/>Gu Yang was not a busybody. Once the money was in hand, he’d leave immediately.<br/><br/>As for the treasures from Lin Family’s vaults, he would be able to sell some in the Divine City.<br/><br/>He ripped open the painting and found a hidden treasure map inside.<br/><br/>“What’s this?”<br/><br/>Suddenly, Wu Er’s voice echoed beside him.<br/><br/>This senior truly had an ability to appear and disappear mysteriously.<br/><br/>PS: Third update, seeking monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}