{"id": 162, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310409.html", "title": "Chapter 162 - Chapter 162 How Great It Would Be If It Were Like This Earlier.", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 162 - Chapter 162 How Great It Would Be If It Were Like This Earlier.</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 162 How great it would be if it were like this earlier.<br/><br/>Translator: 549690339<br/><br/>“Good lad.”<br/><br/>Outside of Jiangzhou City, on top of the mountain, Wu Er slapped his thigh, his white beard all perked up. He grabbed a jug of liquor from beside him, guzzling several mouthfuls.<br/><br/>“He genuinely has a bit of my elegance when I was testing my sword skills against the world.”<br/><br/>He completely forgot that he was swearing at this boy moments before.<br/><br/>To be honest, at first impression, he could only say that Gu Yang was just average.<br/><br/>He himself was an unparalleled genius, all kinds of prodigies, in his eyes, were nothing. Not to mention that at that time, Gu Yang was not even at the First Rank.<br/><br/>Not until Ling Ling successfully broke through the Third Rank, attained the Extreme Yang True Gang. Only after Wu Er heard of Gu Yang’s glorious achievements over the past three months did he slightly change his view.<br/><br/>Even so, it only explained that this boy had extraordinary encounters and extraordinary talent.<br/><br/>What truly moved him, made him want to pass on the Heavenly Inquiry Nine Knives to Gu Yang, was the day Gu Yang reached the peak of the First Rank.<br/><br/>At that moment, he finally saw a glimmer of hope from Gu Yang. A glimmer of hope to break free from fate.<br/><br/>That’s why he passed on the Heavenly Inquiry Nine Knives to Gu Yang.<br/><br/>And at the risk of revealing his identity, he stopped Cao Kunpeng here to help Gu Yang turn the tide.<br/><br/>Just now, Gu Yang’s move with the sabre seemed to tell Wu Er that it was all worth it.<br/><br/>Before reaching the Divine Power realm, he could battle against the Golden Body realm without falling behind, how powerful would he be once he crossed that threshold?<br/><br/>Thinking of this, Wu Er picked up the jug of liquor and took a hearty gulp, “Ling Ling really has an eye for talent.”<br/><br/>“It’s my turn.”<br/><br/>Gu Yang broke through the opponent’s move with one stroke, feeling triumphant.<br/><br/>Using the same “God Destroyer Nine Styles,” the power he unleashed increased more than tenfold.<br/><br/>While he spoke, a burst of flames ignited on the Phoenix Feather Knife, spreading a destructive aura.<br/><br/>“Six Extinctions of the Divine Sky?”<br/><br/>Lin Yimo’s face changed, not daring to let him gather his strength. His longsword shot out, transforming into a long river of stars, taking the initiative to attack.<br/><br/>Even the old man standing in front of Princess Zhao Yu’s expression had become serious, no longer arrogant. A purplish Gang Qi wall appeared in front of him, protecting the princess.<br/><br/>“Is this the ‘Six Extinctions of the Divine Sky’?”<br/><br/>Princess Zhao Yu looked a bit shocked. This purely destructive power fascinated her.<br/><br/>Her eyes were filled with jealousy and hatred.<br/><br/>For years, she has begged her father several times, but that evil woman never gave the technique to her.<br/><br/>That evil woman must be wary of her talent and did not dare to pass on this technique.<br/><br/>How hateful!<br/><br/>“Star River Inversion!”<br/><br/>Lin Yimo used his last resort, in an instant, Heaven and Earth inverted, space reversed.<br/><br/>The flames on the Phoenix Feather Knife lost balance immediately. Before it was fully formed, it went out of control and turned into a large area of flame.<br/><br/>“As expected of someone in the Divine Power realm, he can even extinguish the Skyfire.”<br/><br/>Gu Yang was a little surprised.<br/><br/>After all, the power of this move was too strong, but his control was not enough, that’s why it was easily affected.<br/><br/>Indeed, in the Divine Power realm, a move is not stronger the better, if the control is not enough, it can easily be attacked, risking capsizing in a gutter.<br/><br/>Any Divine Power practitioner is a true genius, never to be underestimated.<br/><br/>In the blink of an eye, the Star River was above his head, inverting down.<br/><br/>Gu Yang’s eyes flashed, in a flash, a Blade Intent piercing through the Star River.<br/><br/>“Heavenly Inquiry Nine Knives,” Chaos Begins!<br/><br/>After a month, he used this move again, and it was a different scene altogether.<br/><br/>The inverted Heaven and Earth, the reversed space, and the Star River hanging above his head, all shattered under this move.<br/><br/>With a crunch.<br/><br/>The sword made a mournful cry and broke apart.<br/><br/>“Star Scatter!”<br/><br/>Lin Yimo spurted out blood on the spot.<br/><br/>The destruction of the divine weapon implied that his sword intent had been broken.<br/><br/>The residual knife intent still going strong, hitting him right in the center of his forehead.<br/><br/>Smack!<br/><br/>Something seemed to shatter; a deep knife mark appeared on Lin Yimo’s brow, and blood gushed out.<br/><br/>“Defeated…defeated?”<br/><br/>Third Princess Zhao Yu could hardly believe her eyes. The man with the golden body, was actually broken open by Gu Yang’s single strike!<br/><br/>A first-rank Godslayer?<br/><br/>There was no precedent for such a bizarre occurrence throughout history.<br/><br/>It felt as though her head was buzzing, chaotic. Looking at the young man standing there, appearing invincible, was a massive shock to her spirit.<br/><br/>How did he do it?<br/><br/>The old man blocking her narrowed his gaze.<br/><br/>That swing of his sword was truly intimidating; even he might not be able to resist it.<br/><br/>The emergence of a young man like him in Great Zhou would assuredly lead to turbulence in the future.<br/><br/>Smack!<br/><br/>Outside of Jiangzhou city, Wu Er let go of his hand, causing the wine pot to drop and shatter, though he seemed indifferent to it.<br/><br/>There was a dull look in his eyes, “No way?”<br/><br/>Lin Yimo was not just anyone. He came from the Lin Family and practiced the “Star River Sword Technique”, which was Lin Family’s orthodox cultivation. He had been in the Golden Body state for decades and had profound cultivation skills.<br/><br/>Yet Gu Yang could break his golden body with a single strike.<br/><br/>It was beyond his imagination.<br/><br/>His original plan was to let this youngster fight with the Golden Body state, allowing him to gain some valuable insight into its strength.<br/><br/>But he never expected that the boy would only take three strikes to defeat Lin Yimo decisively and break his golden body with one strike.<br/><br/>Isn’t this incredibly overpowered?<br/><br/>What would happen when he steps into the Divine Power realm?<br/><br/>“Ah”<br/><br/>The feeling of Lin Yimo’s golden body being broken was as if he had been tortured by thousands of stabs and cuts. He let out a painful scream.<br/><br/>He was defeated, defeated under the blade of a first-rank warrior.<br/><br/>This harsh reality was even more unbearable than his physical pain.<br/><br/>At this moment, a pitch-black knife appeared in front of him.<br/><br/>Lin Yimo looked up and saw the young man’s condescending gaze. He screamed, “You’ve won, kill me now!”<br/><br/>Gu Yang smiled faintly, “Why would I kill you? I only want this.”<br/><br/>He pulled out the IOU again, threw it in front of him, and said, “Now, can you pay me back?”<br/><br/>Lin Yimo looked down and saw ‘five million liangs owed’ written on the note, disbelief flashing in his eyes, “You came after the Lin Family… just for this… five million liangs?”<br/><br/>He ended up in such a predicament just for these insignificant five million liangs, it was indeed ridiculous.<br/><br/>Gu Yang said, “Yes, what, they didn’t tell you?”<br/><br/>Lin Yimo, in a state of shock and anger, spat out a mouthful of blood and fainted.<br/><br/>Gu Yang raised his voice, “All the members of the Lin Family, if you don’t show up, I’m going to kill someone.”<br/><br/>“Stop”<br/><br/>At this moment, Lin Youliang finally rushed in. There was no trace of his previous calmness, his face was pale, his eyes filled with terror. He knelt down in front of Gu Yang, lowering his head, “Please spare us under your blade, our Lin Family admits… defeat.”<br/><br/>Gu Yang then put away his knife, saying, “How nice it would be if you had acted like this sooner, instead of causing chaos and harm.”<br/><br/>Lin Youliang’s lips trembled a few times, and he almost vomited old blood.<br/><br/>But now, the situation was such that he had no choice but to bear with whatever was said.<br/><br/>With his elder defeated, there was no one in the Lin Family who could stand against this man. A single mishap could mean their downfall.<br/><br/>The foundations of a family that had been established over a hundred years, simply couldn’t be ruined in his hands.<br/><br/>Gu Yang said, “Five million liangs in cash, bring it out, and I’ll leave immediately.”<br/><br/>PS: Asking for monthly votes for the second update.\t\t\t\t\t\t</div>", "images": {}, "success": true}