{"id": 165, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14315144.html", "title": "Chapter 165 - Chapter 165 165 There Is Hope This Time", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 165 - Chapter 165 165 There Is Hope This Time</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 165 165 There is hope this time<br/><br/>Translator: 549690339<br/><br/>“Master, there’s no more path, what do we do?”<br/><br/>On the shore, two human figures appeared, each carrying a person on their shoulders. The younger man said anxiously, “They’re about to catch up with us.”<br/><br/>“You fool, hurry up and jump into the river, do you see that ship? Swim over there.”<br/><br/>“But… ”<br/><br/>“No buts, if you don’t jump now, it will be too late.”<br/><br/>Having said that, there was a splash, and someone jumped into the water.<br/><br/>Soon, there was another splash, and the other person had also jumped into the water.<br/><br/>A moment later.<br/><br/>The master and disciple had swam to the side of the ship, silently boarded it without alerting anyone.<br/><br/>They had just come out of the water and landed on the deck, without leaving a single droplet of water, demonstrating that they were both martial arts experts.<br/><br/>Each of them carried a person and stealthily entered the cabin, finding an unoccupied room and laying the people down.<br/><br/>Finally in a safe place, the young man was still somewhat worried, “Master, what if we are found out?”<br/><br/>The other man said irritably, “I’ve told you not to meddle in other people’s business, but you just wouldn’t listen. That was Guo Taiping, the direct descendant of the nine great families, a figure on the Pride of Heaven List. Now, we might lose our lives too.”<br/><br/>The young man said somewhat awkwardly, “Since we’ve taken their money to protect them, we naturally can’t ignore their plight. Besides, what’s so great about Pride of Heaven? He was scared off by Brother Gu.”<br/><br/>This pair of master and disciple was none other than Gao Fan and Feng Tianci.<br/><br/>After departing from Jingzhou, they headed north, planning to go to Divine City.<br/><br/>On the way, they ran out of provisions and reluctantly ended up as bodyguards for hire. Unexpectedly, just before reaching Divine City, the family they were protecting for some reason attracted the attention of Guo Taiping, the Pride of Heaven, and was killed.<br/><br/>Feng Tianci could not stand idly and managed to rescue two people in the chaos and pulled his master along to flee.<br/><br/>Guo Taiping dispatched a Third Rank martial artist in pursuit.<br/><br/>While Gao Fan complained, he helped to carry a person, ran fast, and didn’t slow down.<br/><br/>In their haste, they arrived at the river and having no other route, they chose to jump into the river, finally taking shelter on this ship.<br/><br/>Gao Fan sneered, “Wait until you have strength like Gu Yang, then talk big. I think you have your eyes on this little girl, right? You’re so lecherous, for a pretty face, you’re willing to drag your master into water.”<br/><br/>Feng Tianci flushed, “Disciple absolutely does not harbor such obscene thoughts, Master, you must not slander me.”<br/><br/>Gao Fan was so amused by his silly disciple.<br/><br/>It was his fault for educating this disciple from a young age to be honest and upright, to be a kind-hearted man.<br/><br/>As a result, this silly boy actually took it all to heart and had been practicing this belief from childhood to adulthood.<br/><br/>In this dog-eat-dog world, this kind of character was bound to suffer.<br/><br/>Just then, there was a sudden boom, and a terrifying aura erupted.<br/><br/>Feng Tianci nearly collapsed under an invisible force. He clenched his teeth and somehow managed to withstand it, shivering, bones creaking.<br/><br/>Just when he nearly ran out of breath, the terrifying aura suddenly disappeared without a trace.<br/><br/>With the pressure lifted, he almost collapsed.<br/><br/>“Master… just now… was that… the Divine Power Realm?”<br/><br/>Feng Tianci’s face was pale, his eyes filled with fear.<br/><br/>That aura felt so close, right on this ship!<br/><br/>They had actually landed on a ship with a Divine Power Realm expert.<br/><br/>Gao Fan’s gaze was slightly surprised, thinking his disciple was making incredible progress, he had actually managed to endure under such pressure.<br/><br/>Along the way, his disciple’s cultivation had been advancing by leaps and bounds, breaking through to the Third Rank, and there were no signs of slowing down.<br/><br/>He said, “Don’t you feel that aura was somewhat familiar?”<br/><br/>“Familiar?”<br/><br/>Feng Tianci was initially confused, suddenly had a flash of insight and blurted out, “Brother Gu!”<br/><br/>He finally remembered, that aura did feel familiar, clearly it was Brother Gu’s True Essence.<br/><br/>But compared to two months ago, Brother Gu’s aura was countless times stronger.<br/><br/>“Is it really Brother Gu?”<br/><br/>He still found it hard to believe.<br/><br/>Gao Fan said, “Didn’t you hear a few days ago that Gu Yang defeated a first stage Golden Body expert of the Lin Family in Jiangzhou?”<br/><br/>Despite his calm appearance, he was actually quite shocked in his heart.<br/><br/>In just two short months, Gu Yang’s strength had undergone earth-shattering changes, defeating a Divine Power Realm expert with his First Rank power.<br/><br/>Truth be told, when he first heard the rumor, his first reaction was disbelief.<br/><br/>How long had it been since he parted ways with Gu Yang?<br/><br/>Just two months, even if he had been consuming divine elixirs, progress couldn’t be this fast, right?<br/><br/>Not to mention Gu Yang had defeated a Golden Body Realm expert before reaching the Divine Power Realm, that was even more ridiculous.<br/><br/>Rumors in the martial arts world often exaggerate things.<br/><br/>It wasn’t until this moment, when Gao Fan personally experienced the strength of Gu Yang, did he realize that he truly possessed such prowess.<br/><br/>Moreover, Gu Yang indeed hadn’t broken through to the Divine Power realm.<br/><br/>Yet, his strength was more formidable than those in the Divine Power realm without reaching it.<br/><br/>Gao Fan felt his previous understanding was completely toppled.<br/><br/>“We are saved!”<br/><br/>After Feng Tianci’s initial shock, he wept with joy.<br/><br/>With Brother Gu here, there was nothing to worry about. What should he consider about Guo Taiping?<br/><br/>It was indeed an escape from death’s grasp.<br/><br/>He thought Brother Gu was his benefactor. After getting guidance for a few days, he broke through to the Third Rank smoothly before long.<br/><br/>Now, when he felt there was no way out, Brother Gu, like a miracle, appeared in front of him.<br/><br/>With excitement, he said, “Teacher, let’s go greet Brother Gu.”<br/><br/>“Not so fast.” Gao Fan held him back, gesturing him not to be reckless.<br/><br/>Not far away, a deep voice rang out, “Congratulations to Master Gu on your progress. I am here on behalf of the Lord of the State to invite you to be a guest at Duke’s mansion.”<br/><br/>Only then did Feng Tianci realize why his teacher stopped him.<br/><br/>The Lord of the State had actually sent someone here in advance to invite Brother Gu to the Duke’s mansion.<br/><br/>The Lord of the State is currently a representative of the military. He once quelled the rebellion of the Red Venerate, and as an elder of four dynasties, he wields significant power in the court. He himself is the renowned Sword Saint of the State, and the previous leader of the Red Venerate was slain by his sword.<br/><br/>Gu Yang’s voice echoed, “Thank you for the kindness of the Lord of the State. Once I reach Divine City, I will surely pay a visit. However, it’s not convenient at the moment, so I won’t invite you on board.”<br/><br/>The person outside still spoke politely, “Then I will not disturb you any longer.”<br/><br/>Then he left.<br/><br/>“Everyone says that Brother Gu, with his First Rank cultivation, broke through Divine Power with a sword. Lai didn’t believe it before, but today, I have no choice but to believe it.”<br/><br/>Then, a hearty voice echoed over the river.<br/><br/>Feng Tianci looked at Gao Fan and asked quietly, “Who is he?”<br/><br/>Gao Fan replied, “The commander of the internal guards, Lai Baocheng, Golden Body second stage.”<br/><br/>The internal guards?<br/><br/>Feng Tianci was stunned.<br/><br/>He had long heard of the notorious reputation of the internal guards.<br/><br/>Over the years, countless tales of the internal guards leaked out. Everyone knew they were the sharpest claws of the queen, used specifically to uproot all opposition.<br/><br/>Ten years ago, the internal guards exposed a big treason case, sweeping up several cabinet elders, implicating tens of thousands of people, countless officials were caught, only leading to rolling heads and blood-soaked Divine City.<br/><br/>Since then, the woman in the palace began her first step towards power.<br/><br/>Over the past decade, the internal guards threw multiple big prisons into chaos, killing countless people.<br/><br/>The name of the internal guards, well known throughout Great Zhou, was famous enough to make children stop crying at night.<br/><br/>The leader of the internal guards, a true big shot, came personally to greet Brother Gu.<br/><br/>What a grand occasion!<br/><br/>Feng Tianci could not help but feel excited as well.<br/><br/>Gu Yang replied, “I am truly humbled by Commander Lai’s presence.”<br/><br/>Lai Baocheng, from across the river, got straight to the point, “I am here to ask Brother Gu, would you like to join the internal guards? As for the terms, we can negotiate.”<br/><br/>“Thank you for Commander Lai’s kindness, but I still need some time to consider. I will give you an answer in a month.”<br/><br/>“Good, I will be waiting for you in Divine City.”<br/><br/>Lai Baocheng was straightforward and left as soon as he finished speaking.<br/><br/>Again, tranquility returned to the surface of the river.<br/><br/>In the boat, Feng Tianci felt a yearning deep in his heart, wondering when he could be as glamorous as Brother Gu and attract both the Lord of the State and the internal guards.<br/><br/>Just then, he sensed something amiss, a suffocating pressure was approaching.<br/><br/>An extremely pleasing voice came from outside, “I’ve long heard of Brother Gu’s speed in advancing his cultivation, unparalleled from ancient times till now. Seeing it today really opened my eyes.”<br/><br/>Feng Tianci subconsciously looked towards Gao Fan.<br/><br/>Understanding, Gao Fan said softly, “It’s Princess Chang!”<br/><br/>Feng Tianci was even more shocked, the rumored Princess Chang actually came to see Brother Gu herself.<br/><br/>This was truly…<br/><br/>He did not know how to describe his shock.<br/><br/>PS: Second update, begging for monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}