{"id": 169, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14315149.html", "title": "Chapter 169 - Chapter 169 169 The Overall Situation Is Paramount (Third Update, Asking For Monthly Tickets)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 169 - Chapter 169 169 The Overall Situation Is Paramount (Third Update, Asking For Monthly Tickets)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 169 169 The Overall Situation is Paramount (Third update, asking for monthly tickets)<br/><br/>Translator: 549690339<br/><br/>“Cheng Tianxin’s strength, which is pretty good amongst the Second Grade, is perfect for me to practice with.”<br/><br/>Inside a luxurious carriage, Guo Taiping is building momentum, one hand petting his long sword.<br/><br/>He’s an extraordinary genius, the next head of the Guo Family, attracting attention wherever he goes. Coming to Divine City this time, without a reasonable excuse, would easily make others suspicious.<br/><br/>So, he’s found a very legitimate reason.<br/><br/>To challenge Cheng Tianxin of the Tianxin Martial Arts Hall!<br/><br/>Cheng Tianxin has built a considerable reputation, not to be underestimated; his strength also tops among the Second Grade.<br/><br/>However, Guo Taiping has made significant progress after witnessing the confrontation between Gu Yang and Yi Yi, which gave him the confidence to challenge Cheng Tianxin.<br/><br/>Before coming, he had thoroughly inquired about Cheng Tianxin’s background.<br/><br/>Cheng Tianxin comes from a humble background, without any mentorship, reached the Second Grade Realm through practicing “Xuan Yuan Method,” and created several subtle saber techniques with a few incomplete moves.<br/><br/>Even after achieving fame, he didn’t pledge allegiance to any other powers but established the Tianxin Martial Arts Hall.<br/><br/>This talent and mindset are incomparable.<br/><br/>This is one reason why Guo Taiping chose to challenge Cheng Tianxin. Among the civilians, Cheng Tianxin has a huge reputation. Guo Taiping has heard ordinary people discussing him, even referring to Cheng Tianxin as a grandmaster.<br/><br/>A Second Grade, worthy of that title?<br/><br/>Grandmaster is a term of respect for the powerful in the Divine Power Realm.<br/><br/>Today, he intends to trample this Cheng Tianxin, who is regarded as a “Grandmaster” by countless civilians, under his feet.<br/><br/>A cold smile appears at the corner of Guo Taiping’s mouth, his fighting spirit gradually elevating to its peak.<br/><br/>Just at this moment, the carriage stops abruptly.<br/><br/>His eyebrows furrowed. This interruption is rather annoying.<br/><br/>“What happened?”<br/><br/>The coachman answers quietly, “Master, there is a carriage blocking our path ahead.”<br/><br/>Guo Taiping impatiently says, “Move it away.”<br/><br/>“Yes.”<br/><br/>The coachman agrees then yells, “Quickly move, do you know whose carriage this is?”<br/><br/>The other party stubbornly replies, “Well, do you know, whose carriage this is?”<br/><br/>Guo Taiping seems to find this voice familiar but can’t recall where he heard it before.<br/><br/>At this point, there were quite a few people following Guo Taiping’s carriage. Unlike other places, once the citizens of Divine City heard that the sixth on the Proud Warrior List, Guo Taiping, is going to challenge the Tianxin Martial Arts Hall, they all came to watch.<br/><br/>Of course, those who dare to join this Second Grade warrior’s excitement party are exceptionally talented and brave.<br/><br/>Seeing a carriage coming from the opposite direction showing no sign of giving way, it stirs up more excitement.<br/><br/>Words carry weight in the world, but what place is Divine City?<br/><br/>Walking down the street, it’s quite possible to bump into a few officials of the Third Grade or martial artists of the Second Grade and higher.<br/><br/>A future family master from the Guo Family means pretty much nothing. His title as the sixth on the Proud Warrior List is somewhat rarer.<br/><br/>It’s unclear who sits in the other carriage. The carriage bears no distinguishable signs, so naturally, one can’t discern its history.<br/><br/>However, judging by the frightened look on the face of the coachman of that carriage, it’s unlikely he’s from a prominent family.<br/><br/>For the prestigious families in Divine City, stepping out with such a coachman would utterly disgrace them.<br/><br/>Must be some country bumpkin from the outside.<br/><br/>“Well, do you know, whose carriage this is?”<br/><br/>When Feng Tianci shouts these words, he feels incredibly nervous.<br/><br/>The person in the opposite carriage is Guo Taiping, a dignified future family master and the proud son of heaven. Yesterday, he and his master were chased by Guo Taiping’s men for dozens of miles, nearly costing them their lives.<br/><br/>Now, facing him directly, he’s naturally very nervous.<br/><br/>He can’t help but look at Gu Yang.<br/><br/>Gu Yang gives him an encouraging look, implying he’s doing a good job.<br/><br/>Earlier, he was already annoyed when he heard that Guo Taiping was going to challenge the Tianxin Martial Arts Hall.<br/><br/>There was a time when he joined Tianxin Martial Arts Hall, but not long after, Guo Taiping came to challenge him, severely injuring the master and causing the dissolution of the Tianxin Martial Arts Hall.<br/><br/>Last time in Juyang City in Jingzhou, he didn’t take action on this guy, demonstrating remarkable restraint, primarily to avoid making too many enemies.<br/><br/>However, why does this guy always have to provoke the Tianxin Martial Arts Hall?<br/><br/>This time, he even started the challenge several years earlier.<br/><br/>Gu Yang, after so many simulations, hasn’t encountered many good people. Cheng Tianxin definitely counts as one of them. Several times he helped him escape death and even taught him saber techniques without reservation.<br/><br/>The first superior saber technique he learned was the “Duan Yue Knife Technique” taught by Cheng Tianxin.<br/><br/>He never forgot these relationships.<br/><br/>Therefore, after Gu Yang learned that Guo Taiping was coming to challenge the martial arts hall again, he chose to wait for him on this crucial path.<br/><br/>Guo Taiping, as Gu Yang had seen him before, never seemed the type to heed advice. Gu Yang didn’t want to waste his breath on him and was prepared to take a tough stance.<br/><br/>“Ignorant fool!”<br/><br/>The carriage driver from the Guo Family whipped his horses to increase their speed, driving the carriage directly at Gu Yang.<br/><br/>The horses pulling their carriage were divine steeds of the highest quality. Gu Yang’s horse, on the other hand, was a common nag. If they charged, even the sight of them could scare his horse half to death.<br/><br/>“Awesome!”<br/><br/>The surrounding crowd, relishing the spectacle, cheered them on.<br/><br/>Suddenly, everyone’s voices were cut off as if by some unseen force, forming a dead silence.<br/><br/>“Oh no!”<br/><br/>Inside the carriage, Guo Taiping felt a premonition of danger.<br/><br/>The next moment, his carriage was thrown into the air, falling apart instantly with a loud crash.<br/><br/>An incredibly terrifying force collided with his chest.<br/><br/>“Agh”<br/><br/>Guo Taiping vomited blood on the spot, having sustained severe internal injuries.<br/><br/>Divine Power!<br/><br/>He was shocked beyond belief. Only a cultivator of the Divine Power Realm possessed such might.<br/><br/>The person riding in the opposite carriage was a potent figure of the Divine Power Realm.<br/><br/>Dammit, weren’t people of the Divine Power Realm not supposed to show themselves casually in public?<br/><br/>Why did he encounter one on his first day?<br/><br/>The onlookers felt as if their throats had been constricted by an invisible force. Watching the instantaneous destruction of the Guo Family’s carriage and Guo Taiping being thrown out, hitting a wall and looking utterly pitiful—they were rendered speechless.<br/><br/>They knew that the inconspicuous carriage carried a top cultivator of the Divine Power Realm!<br/><br/>Everyone fell silent, afraid to even breathe, let alone make a noise.<br/><br/>The citizens of Divine City were, after all, experienced, and they knew just how terrifying a cultivator of the Divine Power Realm could be.<br/><br/>At this point, the carriage calmly came to a halt. The window slid open, revealing a young face looking disdainfully at Guo Taiping lying on the ground before closing the door and driving away.<br/><br/>Seeing this, the already pale Guo Taiping’s face flushed red, contorting as he squeezed the name out through gritted teeth, “Gu Yang”.<br/><br/>Hearing this name, the crowd exploded in gasps and murmurs.<br/><br/>Could that be Gu Yang?<br/><br/>The Gu Yang who’s the first in history to sit atop both the Hidden Dragon List and the First Rank List?<br/><br/>The Gu Yang who’s jumped from Third Rank to First Rank in less than half a year?<br/><br/>The Gu Yang who, despite being only a First Rank, could fracture the Golden Body with his saber?<br/><br/>When news of Gu Yang’s appearance in Divine City spread, the entire city was abuzz.<br/><br/>“I must kill him, I must kill him…”<br/><br/>Guo Taiping was nearly driven to madness, struggling to control his murderous intent and call out to his uncle.<br/><br/>However, a lingering sense of rationality held him back.<br/><br/>A voice in his heart kept reminding him to focus on the bigger picture.<br/><br/>This visit to Divine City was for the Human Emperor Sword!<br/><br/>Upon recalling the Human Emperor Sword, his heated mind seemed to be doused with cold water, restoring some semblance of sanity.<br/><br/>He clenched his teeth so hard that he tasted blood.<br/><br/>“One day, I’ll make sure you have no place to be buried!”<br/><br/>Guo Taiping drew his sword and slashed the carriage driver standing in front of him into two halves, the spattering blood making his face even more savage.<br/><br/>This spectacle frightened most of the onlookers. Such a gruesome sight was rarely seen.<br/><br/>After killing the driver, Guo Taiping turned and left.<br/><br/>As he was heavily injured and humiliated, there was no mood left in him to challenge the Tianxin Martial Arts Hall. It was more important for him to recuperate.<br/><br/>P.S.: Third chapter, seeking monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}