{"id": 168, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14315147.html", "title": "Chapter 168 - Chapter 168 168 Tianxin Martial Arts Hall", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 168 - Chapter 168 168 Tianxin Martial Arts Hall</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 168 168 Tianxin Martial Arts Hall<br/><br/>Translator: 549690339<br/><br/>[… Thirty-two years later, a great war broke out between the Celestial Beings in the outside world and the entrance to the Secret Realm was destroyed. This Secret Realm was then exposed to the world. You left the Secret Realm and were pursued by the Wanxiang Gate with their mana realm power.]<br/><br/>[At a critical moment, you used the Divine Phoenix Manual, transformed into a Phoenix, and escaped with several women.]<br/><br/>[After escaping this continent and reaching the ocean, you found an uninhabited island to settle in. Due to extreme exhaustion, you fell unconscious.]<br/><br/>[A month later, you regained consciousness. You found yourself in a new Secret Realm, the Star Sea, one of the Four Great Sacred Lands. Many warriors from Great Zhou were also hiding here. The leaders here are from two major families, the Chen and Lin families.]<br/><br/>[You rested and healed your wounds in the Star Sea, and twelve years later, another Celestial Being arose in the Chen family. At the same time, news came from the outside world that the Wanxiang Cave Heaven was destroyed and Wanxiang Gate suffered heavy losses. The two major families decided to seize this opportunity to counterattack.]<br/><br/>[You, with your exceptional strength, were also among the attacking forces.]<br/><br/>[Two years later, you encountered an Unleaking Realm strongman from Star Luo Sect and you were eventually killed by him. You passed away at the age of sixty-four.]<br/><br/>After Gu Yang finished reading the content of this simulation, his eyes brightened.<br/><br/>This “Nine Heavens Divine Method” really has something extraordinary to it. Achieving transformation into a Phoenix offers remarkable speed, enough to outrun even the mana realm experts. Truly, a top-tier escape methodology.<br/><br/>After escaping the manna realm expert of the Wanxiang Gate, a new subplot was successfully started.<br/><br/>He, along with Su Qingzhen and others, entered the Star Sea, one of the Four Great Sacred Lands. There, it should be a Secret Realm.<br/><br/>About the two major families hiding there, it seems that the invasion of Star Luo Sect and Wanxiang Gate did not wipe out the upper echelons of Great Zhou completely.<br/><br/>Likewise, they could counterattack later.<br/><br/>He knew about the collapse of Wanxiang Cave Heaven, where a white-robed woman alone slew her way to Wanxiang Cave Heaven and fought fiercely with the experts of Wanxiang Gate. Eventually, the whole Cave Heaven world was destroyed.<br/><br/>Such a blow would severely deplete the vitality of the Wanxiang Gate even if it did not annihilate them completely.<br/><br/>However, he was unsure of the result of this counterattack.<br/><br/>The information was too scarce to predict the outcome.<br/><br/>[Simulation over, you can retain one of the following options.]<br/><br/>[One, the martial arts realm at the age of sixty-four.]<br/><br/>[Two, the martial arts experience at the age of sixty-four.]<br/><br/>[Three, the life wisdom at the age of sixty-four.]<br/><br/>“I choose one.”<br/><br/>After Gu Yang said this, he felt something was off.<br/><br/>He initiated the simulation simply to master those two forms of Heavenly Inquiry Nine Knives, but in two consecutive simulations, he chose exactly the martial arts realm.<br/><br/>He had no other choice. The allure of the Phoenix Transformation from the “Nine Heavens Divine Method” was just too strong.<br/><br/>Once he mastered this extraordinary skill, even if he comes across mana realm experts, he will still have a chance to survive.<br/><br/>Boom!<br/><br/>He felt a majestic will descending upon him. In his mind, the Phoenix in flames emitted an extremely joyful chirp.<br/><br/>His consciousness kept elevating, as if fusing with the majestic will.<br/><br/>In an instant, countless pieces of knowledge transferred to him from that will.<br/><br/>Simultaneously, his body was set ablaze, and under the power of the flames, it underwent earth-shattering changes.<br/><br/>“This tastes good… Master, this food… must be expensive, right…”<br/><br/>In the cabin, Feng Tianci and his apprentice Gao Fan were wolfing down the food on the table, all of which were meat and fish.<br/><br/>On their journey, they did have meat, but it simply could not compare to this feast.<br/><br/>Halfway through the meal, Feng Tianci felt a bit guilty.<br/><br/>“It’s not your money, quick—”<br/><br/>While speaking, both of them felt a surging will coming from one side. They vaguely heard a heart-shaking chirp.<br/><br/>Both the master and the apprentice looked at each other, they could see the shock in each other’s eyes.<br/><br/>Feng Tianci asked shakily, “What is that?”<br/><br/>“It should be a transmission of an unparalleled skill.”<br/><br/>Gao Fan answered, and then continued eating.<br/><br/>Who cares about the unparalleled skill? The chicken leg in his hand was much more appetizing.<br/><br/>Feng Tianci stared enviously at his master for a moment. Seeing his master finish off the whole roast chicken, leaving only the bones, he suddenly felt anxious, “Leave some for me…”<br/><br/>In another room, the young girl from the Xiahou family was still crying. Suddenly sensing the surging will, she raised her head hastily. Her eyes, red and swollen from crying, flashed with astonishment.<br/><br/>“He indeed possesses the royal bloodline of the Xia Dynasty!”<br/><br/>If she had any doubts before, there was none left now.<br/><br/>The one who could obtain recognition from the Imperial Seal and the transmission of “Nine Heavens Divine Method” inside it was the proof. Moreover, his bloodline was extremely pure.<br/><br/>Had he been in the Xia Dynasty, what he was doing at the moment would have been tantamount to inheriting the royal title of King Qi.<br/><br/>“Father, your daughter has finally found that person…”<br/><br/>Unfortunately, her father would never be able to witness it.<br/><br/>Reflecting on this, the girl’s sadness deepened.<br/><br/>A full half an hour later, everything finally calmed down.<br/><br/>Gu Yang opened his eyes, and they seemed to burn with a pair of flames.<br/><br/>He clenched his fist, feeling the violent power contained within his body and finding it hard to believe.<br/><br/>The gains this time were far beyond his imagination.<br/><br/>After forming the “Divine Phoenix Manual”, his mortal body significantly improved yet again, with the strength nearly doubling. His mortal body’s might was in no way inferior to the genuine Golden Body Realm.<br/><br/>The “Divine Phoenix Manual” and “Phoenix Dance Nine Heavens” were harmoniously compatible, giving the impression of having a common origin. Yet, one focused on physical refinement, the other focused on Mana.<br/><br/>However,<br/><br/>“Even when my strength has reached this level, I still haven’t reached the Divine Power realm?”<br/><br/>Gu Yang was somewhat surprised. Was “Phoenix Dance Nine Heavens” really so stubborn that without reaching its standards, achieving it would be impossible? There was no room for negotiation.<br/><br/>He closed his eyes again, reflecting on his gains.<br/><br/>Of course, the most important thing was the “Divine Phoenix Manual” in “Nine Heavens Divine Method.” This technique was incredibly mystical. Now, he only needs a thought to transform into a phoenix and wield a portion of divine power.<br/><br/>For instance, the Phoenix Divine Flame and the Spatial Teleportation Divine Power.<br/><br/>However, wielding these divine powers consumed an immense amount of energy.<br/><br/>At present, he had only reached the first level, enabling him to sustain the transformation for a quarter of an hour. But if he wielded any divine power, it could only be maintained for thirty breaths’ time.<br/><br/>Moreover, this “Divine Phoenix Manual”, advancing to the second level, was nearly impossible.<br/><br/>To practice this technique, the essence blood of a phoenix is required. Where would he get the essence blood of a phoenix?<br/><br/>Gu Yang now understood why the bloodlines of the Monster Race had been hunted and exterminated in the era of Xia Dynasty.<br/><br/>Most likely, during the Xia Dynasty, many cultivation techniques required the essence blood of the Monster Race.<br/><br/>Take for instance this “Nine Heavens Divine Method”, “Divine Phoenix Manual” was merely one part. The other eight all corresponded to a different Divine Beast.<br/><br/>In the past, there were nine royalty titles in the hands of Xia imperial family. Each person would grasp the inheritance of one specific technique.<br/><br/>Perfecting to the highest realm, they could transform into true Divine Beasts.<br/><br/>Only the Xia Emperor, who simultaneously cultivated in all Nine Techniques, implying that he combined the strengths of nine Divine Beasts. Who among his peers would be his match? It was simply invincible.<br/><br/>No wonder he could use his own strength to rule the world for a thousand years.<br/><br/>The next day, at noon, they finally arrived at the Divine City.<br/><br/>After Gu Yang disembarked, he hired two horse-drawn carriages. He and Gao Fan occupied one, while the Xiahou siblings occupied the other. They slowly progressed into the Divine City.<br/><br/>Upon seeing the massive city gate, he began to understand why it was referred to as the Divine City.<br/><br/>The city wall soared hundreds of meters high. Each city gate spaced more than twenty meters wide and over fifty meters tall. Upon first glance, one might think they had arrived in the land of giants.<br/><br/>In the presence of such a large city gate, anyone would naturally feel insignificant.<br/><br/>Gu Yang found it hard to imagine that such a tall city wall had stood for two thousand years.<br/><br/>This was not Earth, and the destructive power of Divine Power realm practitioners was extremely terrifying. Forget about stone this thick; even if it were a corresponding volume of steel.<br/><br/>From the Xia Dynasty to the present, two transfers of power had taken place. Let alone the Divine Power realm, there must have been Celestial Being realm practitioners who battled fiercely in the Divine City, yet they failed to damage the city gate and walls.<br/><br/>This city, filled with so many legends.<br/><br/>Feng Tianci on the side was even more dumbstruck.<br/><br/>Once they entered the Divine City, the buildings inside finally began to look normal.<br/><br/>In this city, apart from wider major roads, it wasn’t much livelier than Jingzhou City in terms of hustle and bustle.<br/><br/>Feng Tianci asked, “Brother Gu, where should we go next?”<br/><br/>Gu Yang was reading a book about Divine City and replied, “Tianxin Martial Arts Hall.”<br/><br/>“The number one martial academy in the world!”<br/><br/>Feng Tianci’s eyes brightened instantly. He had long heard of Tianxin Martial Arts Hall and had always yearned to see it. After learning about the experiences of the master of Tianxin Martial Arts Hall, he viewed him as an idol.<br/><br/>“Brother Gu, do you know the master of Tianxin Martial Arts Hall?”<br/><br/>More than just know him,<br/><br/>Gu Yang answered, “We’ve been acquainted for a long time.”<br/><br/>At that moment, there’s a sudden shout from outside, “Guo Taiping is going to challenge Tianxin Martial Arts Hall!”\t\t\t\t\t\t</div>", "images": {}, "success": true}