{"id": 161, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310406.html", "title": "Chapter 161 - Chapter 161 Battle 161: Golden Body", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 161 - Chapter 161 Battle 161: Golden Body</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 161 Battle 161: Golden Body<br/><br/>Translator: 549690339<br/><br/>Outside Jiangzhou City, atop a mountain, Wu Er was sitting on a huge rock at the peak, holding a roast chicken in his hand, devouring it heartily,<br/><br/>After finishing the meat, he carelessly threw the chicken bones into the sky.<br/><br/>In the sky, a shadow descended.<br/><br/>The person had not yet arrived, but the sound came first.<br/><br/>“Who’s pranking me in such a way?”<br/><br/>The shadow came down, a tall man dressed in a black robe with a hawk-bill nose. His pair of eyes exuded an intimidating light. When he saw Wu Er, his eyes suddenly changed, “Elder Wu?”<br/><br/>Wu Er tossed the chicken bones on the ground, rubbed his hands on his clothes, turned around and said, “I’m surprised you still remember me.”<br/><br/>Upon seeing his face, the man bowed in respect, “I’ve always remembered your guidance, elder.”<br/><br/>Wu Er laughed, “It’s been many years, I’m surprised you still remember.”<br/><br/>“I heard that you were captured by the Red Moon Great Saint of the Three Saints Gate years ago, I didn’t expect, elder, that you actually managed to escape from that Great Saint’s clutches.”<br/><br/>The mention of “Red Moon Great Saint” caused Wu Er’s face to twitch, he chuckled, “I have been lucky to survive. One of these days, I must settle the score with that witch.”<br/><br/>The man asked, “Did elder come here specifically to wait for me?”<br/><br/>“Indeed.”<br/><br/>“For Gu Yang?”<br/><br/>“He and Ling Ling are in love, I don’t want my only descendent to become a widow at such a young age.”<br/><br/>The man laughed heartily, “That’s interesting, my daughter Yi Yi is also deeply in love with that young man. She insists on marrying no one but him, and is so lovesick that she’s fallen ill. I came this time to kidnap him and bring him to see my daughter.”<br/><br/>Wu Er chuckled, “Although I’m getting old, my eyes are still clear. I can guess what you’re scheming, so you don’t have to sugar-coat it with such words.”<br/><br/>The man’s smile faded, “Since elder has guessed it, you must know that this matter involves our path as cultivators and is absolutely not negotiable.”<br/><br/>Wu Er said, “If I’m not mistaken, you’re still a bit unripe. Why not wait a few more months? By that time, Gu Yang will step into the Divine Power Realm, I will personally bring him to visit the Cao family.”<br/><br/>“Then I will wait at home for elder.”<br/><br/>Without another word, the man took to the sky and vanished into the horizon.<br/><br/>Leaving Wu Er standing there, he couldn’t help but curse under his breath, “This damn kid, daring to provoke any woman, one of these days, he’ll be ruined by a woman.”<br/><br/>No matter how much he cursed, he still looked towards Jiangzhou City. Lest that damn kid be killed by that Golden Body realm cultivator, wasting all his hard work.<br/><br/>Elsewhere, the man in the black robe was flying through the sky, but a large question lingered in his mind, “How did he deceive the Red Mansion?”<br/><br/>Wu Shengtian, a Grand Master listed in the ranking, his name disappeared from the ranking eighteen years ago. Everyone thought he had fallen. Who knew that this man, who should have been dead, appeared before him today.<br/><br/>Thinking about Wu Shengtian’s current state, he had a guess in his mind, “A living dead man?”<br/><br/>He suddenly changed his mind, not because he was wary of his opponent, but solely because Wu Shengtian managed to escape from the grasp of the Red Moon Great Saint.<br/><br/>Perhaps, he might learn some information about the Red Moon Great Saint from Wu Shengtian in the future.<br/><br/>At that thought, he couldn’t help but touch his chest, feeling the presence of a covert foreign energy. It was the sword hanging over each member of the Cao family.<br/><br/>“Three Saints Gate!”<br/><br/>He muttered the name, his eyes releasing a cold beyond bone chilling.<br/><br/>Within Jiangzhou City.<br/><br/>Within Lin Money House, Lin Yimo looked at the young man before him and finally let go of his suppressed killing intention.<br/><br/>He had kindly advised, but this kid had failed to appreciate it.<br/><br/>He is a superior cultivator of the Divine Power Realm, transcended from the mortal world. In the ancient times, he could be called a Cultivator, on the path to eternal life.<br/><br/>Any other First Rank would have been slapped to death for showing any disrespect to him.<br/><br/>He was always restrained, just because he considered this kid’s background.<br/><br/>But this kid was aggressive and didn’t take him seriously at all.<br/><br/>His patience had finally run out.<br/><br/>Lin Yimo coldly said, “Ignorant of the ways of the world.”<br/><br/>Buzz!<br/><br/>A sword flew out from his wide sleeve, the violent vibration turned it into tiny stars, enveloping Gu Yang.<br/><br/>“It’s the Star River Sword Technique!”<br/><br/>Princess Zhao Yu’s eyes lit up. This was the Lin Family’s orthodoxy. She hadn’t expected this Golden Body cultivator from the Lin Family of Jiangzhou to know it.<br/><br/>The elder beside her subtly stepped forward, shielding her body, his hands curled in his sleeves as he eyed the two engaged in the arena.<br/><br/>As for Lin Youliang and the rest of the Lin Family, they had already retreated, fearing the collateral damage.<br/><br/>Gu Yang suddenly felt restrained by an imposing sword intent. In the midst of a galaxy of stars before him, he couldn’t discern which star was the true form of his opponent’s sword.<br/><br/>“Impressive sword technique!”<br/><br/>This is true Divine Power, even Lei Hao can’t match up.<br/><br/>The oppressiveness induced by the man before him even surpassed that of the Divine Power expert in the Shen Family.<br/><br/>Gu Yang unsheathed the Phoenix Feather Knife, remaining still.<br/><br/>“God Destroyer Nine Styles”, Parry-Saber style!<br/><br/>Under his opponent’s tremendous sword intent, he remained as unyielding as a rocky reef, constantly battered by waves yet standing firm.<br/><br/>Watching the two fall into a standoff, Princess Zhao Yu, third in line to the throne, wore an incredulous expression, “He’s actually able to contend with a Divine Power realm expert, how is this possible?”<br/><br/>She had utmost confidence in her own ability and in her view, those on the First Rank were merely those who have been cultivating longer than her, decayed bones in tombs, nothing to be afraid of.<br/><br/>Even Jinghai Wang, previously top of the First Rank, she never sets her eyes on them.<br/><br/>The only person she respected was the recently emerged Gu Yang.<br/><br/>The reason was simple; he was around the same age as her, only a person like him was worthy to be her opponent.<br/><br/>She journeyed from the Divine City this time specifically to find Gu Yang and challenge him.<br/><br/>However, no matter how confident Princess Zhao Yu was of her own abilities, she would never have believed that she could contend with a Golden Body Realm powerhouse.<br/><br/>There is a huge gap separating the Mortal Realm and the Divine Power Realm, they are on completely different levels.<br/><br/>One Golden Body, an invincible position.<br/><br/>Moreover, the Giant Strength Divine Power, the Wind Controlling Divine Power…<br/><br/>It’s impossible to fight.<br/><br/>Even if, by some unknown method, Gu Yang had managed to condense his Golden Body in advance, it would still be fundamentally different from a true Golden Body Realm.<br/><br/>She didn’t think she could break the “Falling Stars like Rain” technique of the Golden Body Realm expert in the Lin Family, even being able to resist a few strokes would be questionable.<br/><br/>On the other hand, Gu Yang, though restrained by sword intent, was able to contend with it, and even has the upper hand in the battle.<br/><br/>Such ability had long surpassed the scope of First Rank Martial Artists.<br/><br/>She mumbled to herself, “Is this really First Rank?”<br/><br/>The elder standing in front of her didn’t answer, his heart was as shocked as hers.<br/><br/>He had lived so many years, and he had never seen or even heard of such a First Ranker.<br/><br/>Even the Celestial Being in the academy did not have the ability to rival a Golden Body Realm when he was in the First Rank.<br/><br/>“Pearls as mere grains of rice!”<br/><br/>With a cold snort from Lin Yimo, the sky suddenly darkened, and countless stars fell.<br/><br/>Each falling star was a stream of sword intent.<br/><br/>An overwhelming amount of sword intent was about to engulf Gu Yang.<br/><br/>In the next moment, a plain and unadorned blade light twinkled in the darkness, shattering the falling stars wherever it went.<br/><br/>The blade light grew brighter and brighter, flying towards the dark sky against a shower of stars, shattering the space with overwhelming force.<br/><br/>The sky was void of stars, and a sword was revealed at last.<br/><br/>Ding!<br/><br/>The knife-light harshly slashed against the sword, creating an earth-shaking noise.<br/><br/>The long sword seemed to issue a tragic wail, and was flung away.<br/><br/>A twinge of discomfort flashed across Lin Yimo’s eyes. Extending his hand, the long sword returned to him with a whoosh, vibrating constantly in his hand.<br/><br/>“Impressive saber technique.”<br/><br/>As he looked at Gu Yang again, his face was filled with a deadly intent.<br/><br/>At that moment, he finally considered the young man before him an equal opponent.<br/><br/>PS: First chapter, seeking monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}