{"id": 167, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14315146.html", "title": "Chapter 167 - Chapter 167 167 Divine Law Of The Nine Heavens", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 167 - Chapter 167 167 Divine Law Of The Nine Heavens</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 167 167 Divine Law of the Nine Heavens<br/><br/>Translator: 549690339<br/><br/>A few dozen miles from the canal, a dozen or so carriages were parked by the roadside, surrounded by a similar number of guards.<br/><br/>In the largest carriage at the front, several night pearls were embedded in the carriage walls, emitting a soft glow.<br/><br/>Inside, Guo Taiping held a book in his hand, which he was flipping through.<br/><br/>On a small table in front of him, an ancient map was laid out, displaying a series of bizarre characters.<br/><br/>The book he held was snatched from Xiahou Shuwen. It was a compilation of golden text annotations that the Xiahou family had been organising for generations. It contained more than a thousand golden characters, which was comparable to those kept in the Academy of Letters and the Academy of Martial Studies.<br/><br/>The map was a treasure map he had accidentally obtained. He instantly recognized the golden characters written on it and remained vigilant.<br/><br/>After returning to his clan, he had specialists appraise the map. Both the material and the paint used on the map dated back over a thousand years, which unquestionably indicated that it came from the Xia Dynasty.<br/><br/>Most importantly, the clan members skilled in deciphering golden text figured out part of the map which revealed a secret of epic proportions— the whereabouts of the Human Emperor’s Sword.<br/><br/>The Human Emperor’s Sword is arguably the most famous divine weapon amongst the human race. A veritable Emperor’s blade.<br/><br/>Both the ancient Human Emperor and the Xia Emperor of the middle ages brandished this sword to create awe-inspiring achievements, proving unrivaled under the heavens.<br/><br/>Guo Taiping naturally regarded it as a treasure beyond measure. This was undoubtedly a monumental opportunity.<br/><br/>Upon finding out that the Xiahou family had the greatest expertise in interpreting golden text in the world, Guo Taiping immediately paid them a visit to seize their annotations of the golden text. After obtaining the annotations, he annihilated the Xiahou family.<br/><br/>This move was ruthless to the extreme.<br/><br/>Because when Guo Taiping obtained this map, the person was actively reproducing it, meaning the map had already been disseminated.<br/><br/>As such, he decided to nip things at the bud to prevent others from investigating further.<br/><br/>By doing so, he would be the first one with a chance at finding the Human Emperor’s Sword.<br/><br/>With the thousand-year-old essence of the Xiahou family in his grasp, Guo Taiping quickly translated all the golden text on the map. Even if a few characters were missing, it wouldn’t make much of a difference.<br/><br/>“King Qi’s mansion? Where is that?”<br/><br/>Guo Taiping finally pinpointed the location of the Human Emperor’s Sword on the map, but came across another problem. Where was the former home of King Qi a thousand years ago now located?<br/><br/>Suddenly, he felt a certain degree of regret. He shouldn’t have killed so rapidly, that old man might have known the location.<br/><br/>But that old man had the nerve to strike at him, nearly injuring him.<br/><br/>“Young master.”<br/><br/>At this point, his subordinate, who had been dispatched to eliminate the two who had escaped, had returned. He reported from outside, “They’ve entered a ship. It’s Gu Yang’s ship…”<br/><br/>“Gu Yang?”<br/><br/>Upon hearing Gu Yang’s name, Guo Taiping’s face darkened, and he uttered resentfully, “Again, him. He’s like a ghost that won’t go away.”<br/><br/>In the Juyang City of Jingzhou, it was Gu Yang who had subjected him to unprecedented humiliation.<br/><br/>The subordinate outside continued, “Nearby, there’s also the Deputy Steward of the Duke of the State, the Commandant of the Inner Guards Lai Baocheng, and the esteemed Princess Chang… they all came together to court favor with Gu Yang…”<br/><br/>Hearing this, Guo Taiping’s face turned even more ashen.<br/><br/>The most sensational news in the world now was the rumor of Gu Yang defeating the Lin family’s Divine Power Lin Yimo in Jiangzhou City with a knife.<br/><br/>In his heart, he sneered at this, not believing the rumors at all.<br/><br/>First Rank Godslayer?<br/><br/>What nonsense were they talking about?<br/><br/>Surely, it was only the ignorant who would take such rumors seriously.<br/><br/>“Your subordinate failed in my duty. Please punish me, young master.”<br/><br/>Guo Taiping coldly said, “You are penalized three months’ salary.”<br/><br/>Although he was furious, he did not vent his anger on his subordinates. He just symbolically fined some salary.<br/><br/>Being raised as the future patriarch, he was taught from a young age to clearly distinguish rewards and punishments in order to garner loyalty from his subordinates.<br/><br/>You couldn’t just kill them like he did to other people.<br/><br/>Thinking about Gu Yang being nearby made him uncomfortable; he ordered, “Get the horses, we’re leaving for Divine City tonight.”<br/><br/>He told himself, “Hmpf, the important thing is to find the Human Emperor’s Sword first. I’ll settle this score later.”<br/><br/>Elsewhere, on a large ship sailing along the canal.<br/><br/>Gu Yang activated his True Essence, forming an air barrier that completely separated him from the outside.<br/><br/>After unknowingly leaking secrets before, his sense of confidentiality had greatly increased.<br/><br/>The girl looked at the man in front of her, her expression a mixture of fear and an indescribable feeling. She stuttered, “In the Xia Dynasty, every member of the royal family has a royal seal like this representing their royal identity. You… you can activate this seal, which… which proves that you have…the bloodline of the Xia Dynasty’s royal family…”<br/><br/>What a load of crap!<br/><br/>Gu Yang found it amusing. He was from Earth, a descendant of the Yan Huang lineage. How could he possibly have the bloodline of the royal family of the Xia Dynasty in this world? Was this some kind of joke?<br/><br/>Apparently, the force that caused this reaction from the seal was the True Qi within his body.<br/><br/>Simply put, it was caused by the cultivation method “Phoenix Dance Nine Heavens”.<br/><br/>So, it turned out that this cultivation method was related to the Xia Dynasty.<br/><br/>Curious, Gu Yang asked, “Can you understand the text on it?”<br/><br/>Seeing his gaze, the young girl hesitated but then nodded timidly.<br/><br/>“Translate it.”<br/><br/>Gu Yang input True Qi and the text above the seal was fully revealed.<br/><br/>The girl whispered, “The emperor’s seventh son, Xia Jun, is named King of Qi, forever ruling over the land of Qi Province. Thus, it is decreed!”<br/><br/>Qi Province, it seemed like the land of the Guo Family.<br/><br/>Gu Yang then asked, “Apart from proving the identity of the royal family, does this have any other function?”<br/><br/>The girl nodded, “According to my grandfather’s study, there should be the legacy of the Xia Emperor in this seal, the ‘Nine Heavens Divine Method’.”<br/><br/>Upon hearing this, Gu Yang was even more interested. The Xia Emperor was a formidable character who dominated this world for a thousand years, and his cultivation method must be top-notch. “How do I obtain the legacy inside of it?”<br/><br/>The girl shook her head, indicating that she was not sure.<br/><br/>Moving slightly, Gu Yang pocketed the seal and said, “You can rest here for now. Don’t worry, you’re safe here. Guo Taiping doesn’t dare to act wildly in my territory.”<br/><br/>After saying that, he turned and left.<br/><br/>The young girl seemed to want to say something but didn’t end up saying it. Turning her head to look at her still unconscious elder brother, the thought of the gruesome affair that occurred earlier made her cry uncontrollably.<br/><br/>When Gu Yang stepped outside, he greeted Gao Fan and his student before returning to his room to play with the seal for a while.<br/><br/>In the previous simulation, he did not obtain this seal. Otherwise, it would have been mentioned in the simulation.<br/><br/>Upon careful consideration, he had a rough idea.<br/><br/>It must be that after receiving the system’s reward, his power skyrocketed, attracting Gao Fan and his student.<br/><br/>Along the way, he kept a very low profile. Because Wu Er was by his side, he always hid his essence using the Hidden Knife Style.<br/><br/>If it weren’t for the sudden surge in his cultivation level from the simulation, he certainly would not have attracted Gao Fan and his student.<br/><br/>Coming to this realization, Gu Yang became grave.<br/><br/>This meant that as his power increased, even a minor action could have a huge impact on reality, and the butterfly effect would become more serious.<br/><br/>From now on, the results of his simulations could only serve as a reference. Otherwise, there could be huge surprises waiting for him at any moment.<br/><br/>Gu Yang stored the seal and opened the system.<br/><br/>After all, he wasn’t of the Xia Emperor’s bloodline; he was simply a counterfeit. Who knows if the Xia Emperor had left any prohibitions in this seal.<br/><br/>To be safe, he should do another simulation.<br/><br/>“You’re twenty-two years old and have reached the peak of the First Rank, only one step away from forming a Golden Body…”<br/><br/>“You obtain the Nine Provinces Seal of the Xia Dynasty’s royal family before reaching Divine City. Using the True Qi from ‘Phoenix Dance Nine Heavens’, you activate the seal and get the ‘Divine Phoenix Manual’ from ‘Nine Heavens Divine Method’.”<br/><br/>“Several days later, you arrive at Divine City, join the Imperial Guard as a vice-commander, and get the opportunity to refine in Huaqing Pool twice.”<br/><br/>“Months later, a person with a mana boundary appears in front of you, you activate the ‘Divine Phoenix Manual’, transform into a phoenix, and manage to escape.”<br/><br/>“You flee to Tianzhu Mountain, enter the Secret Realm, and meet up with Su Qingzhen and the others.”<br/><br/>“After that, you concentrate on cultivating in the Secret Realm.”<br/><br/>PS: First update, asking for monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}