{"id": 160, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14310403.html", "title": "Chapter 160 - Chapter 160: Please Have The Great-Uncle Take Action", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 160 - Chapter 160: Please Have The Great-Uncle Take Action</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 160: Please have the great-uncle take action<br/><br/>Translator: 549690339<br/><br/>Jiangzhou City, the stronghold of the Lin Family and the Lin Family Bank, is the most influential bank in Jiangzhou.<br/><br/>Anyone who does business within Jiangzhou usually deposits their money in the Lin Family Bank, purely out of respect for the Lins.<br/><br/>Therefore, in Jiangzhou City, the Lin Family Bank seems to be much busier than the Four Sea Bank.<br/><br/>The bank is the most profitable business for the Lin family. It is now controlled by their eldest son, Lin Zihua, indicating that he has been chosen as the future head of the family.<br/><br/>Half an hour ago, Lin Zihua suddenly received a message that someone was causing trouble at the Lin’s Bank, presenting an IOU for five million taels of silver, demanding repayment.<br/><br/>The name of the debtor was Lin Zihua himself.<br/><br/>Lin Zihua laughed cynically in extreme anger. Someone dared to cross the Lins, they were truly seeking their own doom.<br/><br/>He immediately gathered his men and stormed towards the bank.<br/><br/>The bank is the Lin family’s moneybag. If this incident is not handled with a thunderous approach, it will severely undermine the credibility of the bank.<br/><br/>Therefore, he had to intervene as quickly as possible and resolve the issue.<br/><br/>“Brother Lin, long time no see.”<br/><br/>When Lin Zihua arrived at the bank with his men, he was shocked to see the man in the hall and hear that familiar voice.<br/><br/>Wasn’t he supposed to be in Jingzhou?<br/><br/>The thought flashed across his mind, and he immediately chose to run for his life.<br/><br/>The visitor was indeed Gu Yang!<br/><br/>As the first rank on the First Rank List, he was no match for him, neither would his father.<br/><br/>Running away was his only chance of survival!<br/><br/>Boom, boom, boom .<br/><br/>His men were sent flying. He didn’t even see how the blows were delivered. In the next moment, Gu Yang appeared in front of him.<br/><br/>He felt utterly despairing at that moment.<br/><br/>Faced with that smiling face, he didn’t even have the courage to fight back.<br/><br/>How did it come to this?<br/><br/>In a short instant, Lin Zihua recalled past events, unable to comprehend how things had escalated so much in just a few months.<br/><br/>He’d discovered Gu Yang’s secret back then and sent a Second Grade powerhouse to capture him, but the attempt had been unsuccessful.<br/><br/>Even his father’s attempted assassinations by a First Rank powerhouse had been unsuccessful.<br/><br/>Lin Zihua justified his own actions, believing his father would approve of his decisive decision-making too.<br/><br/>However, within a few months, there were constant reports of Gu Yang slaying a First Rank with his Second Grade power.<br/><br/>Soon after, he had broken through the First Rank and topped the Hidden Dragon List.<br/><br/>Some time later, Gu Yang had even defeated Yi Yi, first on the Genius List.<br/><br/>Next, he appeared on the First Rank List.<br/><br/>Half a month ago, he had even jumped to the first place on the First Rank List.<br/><br/>It was all like a dream.<br/><br/>A nightmare Lin Zihua would never wish to recall.<br/><br/>He couldn’t understand what had happened to the world.<br/><br/>And now, Gu Yang had finally come knocking at his door.<br/><br/>He always knew this day would come.<br/><br/>But he did not expect it to come so soon.<br/><br/>Hasn’t he been in Jingzhou all this while?<br/><br/>Amid the multitude of thoughts that flashed through Lin Zihua’s mind, he finally managed a bitter smile, “What do you want?”<br/><br/>Since he had fallen into the enemy’s hands, he had to bow down.<br/><br/>Gu Yang commended, “Brother Lin is quite understanding.” He placed the IOU in front of him saying, “Just pay this amount and we can put an end to our feud.”<br/><br/>Lin Zihua bowed his head, it was indeed an IOU, stating that Lin Zihua of Jiangzhou owed five million taels of silver exactly.<br/><br/>“Impossible!”<br/><br/>He was taken aback with anger, and upon seeing Gu Yang’s smirking gaze, he felt like a bucket of cold water was poured over him. He reluctantly said, “The Lin family simply doesn’t have these much silver coins.”<br/><br/>Gu Yang said, “You do not have the right to bargain. If you can’t handle it, wait for the person who can.”<br/><br/>He had noticed earlier that someone had sneaked out, surely to inform others.<br/><br/>All he needed to do now was wait here.<br/><br/>Lin Zihua felt despair, knowing there could be no good outcome out of today’s situation.<br/><br/>He had caused such a scenario today by the decision to hunt down Gu Yang back then.<br/><br/>He had drawn such a fearsome enemy to his family, not even his father could protect him<br/><br/>Before long, Gu Yang felt a group of people rushing towards him, several among whom were First Rank martial artists.<br/><br/>With a swoosh, several people stormed in.<br/><br/>The one leading the way was a middle-aged man with an extraordinary demeanor and a First Rank peak cultivation level. He was likely the head of the Lin Family. He opened his mouth and asked, “Who might you be? What has my boy done to offend you?”<br/><br/>Gu Yang, however, was paying more attention to a woman dressed in men’s clothes at the back. Her True Essence was so enormous that it reached an extreme point. From another perspective, it was a golden radiance.<br/><br/>The vastness of her True Essence was on par with Jinghai king before his breakthrough.<br/><br/>Who is this woman?<br/><br/>There are no women among the top five ranks in the First Rank list.<br/><br/>Gu Yang was rather curious about the woman’s identity, but he quickly took back his gaze and looked at the middle-aged man in front of him, “Who I am is not important. I’m here today to collect a debt.”<br/><br/>Having said that, he flung the IOU over.<br/><br/>Lin Youliang took it and looked at it, his face showed no change as he said, “So you are Gu Yang?”<br/><br/>Upon hearing the name Gu Yang, Princess Zhao Yu, who had been standing at the back, instantly brightened up. It’s true that when one prizes a horse’s bone its every pace turns up in their journey.<br/><br/>She could hardly wait to challenge Gu Yang.<br/><br/>Suddenly, however, an elderly man next to her grabbed her sleeve and shook his head.<br/><br/>Zhao Yu looked at the solemn face of the old man and asked in a low voice, “Grandpa Gu, what’s wrong?”<br/><br/>The old man said, “You’re no match for him.”<br/><br/>Zhao Yu was unconvinced, “How do you know if we haven’t fought yet?”<br/><br/>“You’ll see in a bit.”<br/><br/>Zhao Yu knew that without Grandpa Gu’s consent, she wouldn’t be able to make a move. She stamped her foot in anger, but there was nothing she could do about it.<br/><br/>Gu Yang laughed, “It seems you are well aware of what he’s done. That’s good. Give me the money today, and we’ll call it even.”<br/><br/>Lin Youliang laughed, “If you want these five million, let’s see if you have the ability to get it. I’ll ask my great uncle to make a move.”<br/><br/>The few people behind him echoed in unison, “Ask the great uncle to make a move!”<br/><br/>Their voices rang far and wide, as if they were trying to raise the roof, echoing throughout Jiangzhou City.<br/><br/>“Great uncle?”<br/><br/>Princess Zhao Yu’s face changed a bit, “Could it be ”<br/><br/>The old man by her side was not surprised at all, seeming to have known all along that there was such a person behind the Lin Family.<br/><br/>Kaboom!<br/><br/>From outside came a thunderous noise and a figure broke in, landing in front of Lin Youliang. This was a middle-aged man with a handsome face and sharp eyes.<br/><br/>Finally, his gaze fell on Gu Yang, a trace of surprise in his eyes, “Golden Body?”<br/><br/>As soon as these words came out, the faces of everyone present changed dramatically.<br/><br/>Could it be that Gu Yang has already broken through to the Divine Power realm?<br/><br/>This middle-aged man was the very seahorse pin that the Lin Family of Jiangzhou relied on, a strong cultivator in the Divine Power realm. He had been in seclusion for many years.<br/><br/>When Lin Youliang learned that Gu Yang had topped the First Rank list, he personally went to see his great uncle and informed the family of a formidable enemy they could not handle. He asked his great uncle to take action when the time came.<br/><br/>This was a precaution.<br/><br/>However, Lin Youliang and his men never expected Gu Yang to have condensed his Golden Body already.<br/><br/>It had just been a few days, and he’d crossed that insurmountable chasm?<br/><br/>Princess Zhao Yu was also greatly surprised, “He has a Golden Body?”<br/><br/>The elder next to her said, “Just a little more.”<br/><br/>Just a little more, what does that mean?<br/><br/>Princess Zhao Yu was stunned when she heard the cultivator from the Lin Family say in wonder, “You’ve achieved the Golden Body before reaching Divine Power. Your aptitude and encounter are among the rarest I have ever seen. However, you’re still not my opponent right now. Withdraw.”<br/><br/>The Princess was baffled, “Achieve Golden Body before reaching Divine Power?”<br/><br/>Is there such a thing?<br/><br/>Gu Yang remained calm and unfazed, “Whether I am a match or not, we won’t know until we fight. Are you afraid by any chance?”<br/><br/>The middle-aged man said, “Young man, don’t try to gain the advantage by talking. I just think that you are young, and it’s not easy to cultivate, I hate to see you fall here. If you insist on this, don’t blame me for not showing mercy.”<br/><br/>Gu Yang laughed, “If you’re going to make a move, just do it already, and stop babbling.”<br/><br/>PS: Only two updates today. Will return to three updates tomorrow.\t\t\t\t\t\t</div>", "images": {}, "success": true}