{"id": 164, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14315143.html", "title": "Chapter 164 - Chapter 164 The Origin Of The Four Great Sacred Lands", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 164 - Chapter 164 The Origin Of The Four Great Sacred Lands</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 164 The Origin of the Four Great Sacred Lands<br/><br/>Translator: 549690339<br/><br/>“Treasure map.”<br/><br/>Without turning his head, Gu Yang replied and spread out the thin, cicada-wing-like silk paper on which a map was drawn.<br/><br/>The map was very simplistic, mainly full of text. The characters used differed greatly from those used in Great Zhou, making them incomprehensible.<br/><br/>“Oh, this is the golden text of the Xia Dynasty.”<br/><br/>Wu Er, standing nearby, said with some surprise, “A treasure left by the royal family of the Xia Dynasty? That’s a good find. Where did you get it from?”<br/><br/>Gu Yang turned and asked, “Elder, do you recognize the characters on there?”<br/><br/>Wu Er took the treasure map, expressing his interest, “Golden text is a special script reserved for the royal family of the Xia Dynasty. It’s said to be an ancient celestial seal. During the Xia Dynasty, only members of the royal family were qualified to learn it.”<br/><br/>“Unfortunately, when Emperor Xia perished, he summoned all the royal family, who all died out in the end. The whole of Divine City was almost utterly destroyed, countless classics perished, and this golden text was lost along with them. It can now only be found in some ancient tombs of the Xia royal family.”<br/><br/>As he said this, he carefully examined it, “Divine City… Heaven… Human Emperor…”<br/><br/>Upon saying this, he looked surprised, “Could it be, this treasure map contains the location of the Human Emperor’s Sword?”<br/><br/>Gu Yang took the opportunity to ask, “What is the Human Emperor’s Sword?”<br/><br/>Wu Er’s expression became serious, “According to legend, in the distant ancient times, various races thrived on this continent, and humans were but a weak race. Until the emergence of the Human Emperor, who, with the Human Emperor’s Sword, led the human race to become the masters of this world. He was revered as the Human Emperor by all humans. The Human Emperor’s Sword, imbued with the fate of the human race, is the finest divine weapon in the human race. ”<br/><br/>“Emperor Xia opened a millennium dynasty with this sword. Until the fall of Emperor Xia, the whereabouts of the Human Emperor’s Sword has been unknown for nearly a thousand years.”<br/><br/>This story was very familiar to him.<br/><br/>Gu Yang was not particularly interested in the Human Emperor’s Sword; he was more interested in the gold and silver treasures in the cache.<br/><br/>What intrigued him more was something else, “Elder, how exactly did Emperor Xia die?”<br/><br/>Wu Er’s eyes had yet to leave the treasure map, he was clearly very interested in the Human Emperor’s Sword. He mentioned, “The cultivation level of Emperor Xia at that time had reached the limit of celestial beings. He tried to defy the heavens and ascend to the fairyland, but he incurred divine punishment. As a result, he opened four spatial gates…”<br/><br/>Upon hearing this, Gu Yang was stunned, “Behind those four spatial gates, could they lead to different paradises?”<br/><br/>Wu Er turned around, a strange smile on his face, “You guessed it right.”<br/><br/>Even though he did not continue, Gu Yang had already guessed the dreadful truth.<br/><br/>So, the so-called Four Great Sacred Lands, like the Star Luo Sect and Wanxiang Gate that emerged decades later, are all invaders.<br/><br/>This world, damn it, has been invaded by forces from outside for over a thousand years.<br/><br/>Such a thought was indeed horrifying.<br/><br/>After a while, seeing that he couldn’t study anything further, Wu Er handed the treasure map back to Gu Yang and said, “If you want to decipher the golden text here, you’ll have to visit the literary and martial academies. There are people there who specialize in researching the golden text.”<br/><br/>“Hmm.’<br/><br/>Gu Yang was somewhat absent-minded. He had already located the treasure and knew that a group of divine power realm powerhouses were covetously eying this treasure. This included a Sword Saint. Naturally, he didn’t want to waste too much time on it.<br/><br/>He put away the treasure map and instead asked about another matter, “Elder, do you know about the challenging question at the top floor of the Star Picking Pavilion in the literary academy?”<br/><br/>Wu Er’s gaze became strange, “Why, you wish to take that person from the literary academy as your master?”<br/><br/>Without trying to hide anything, Gu replied, “I heard Phoenix Feather Knife’s seal was set by the Celestial Being at the literary academy. To lift the seal, I must find him…”<br/><br/>“It must have been that old boy with the surname Gao who gave you this bad advice. He really is hitting the wrong note.”<br/><br/>Wu Er blew his beard and stared, “Don’t listen to him. That person from the literary academy… Basically, if you don’t want to join him, don’t try to solve the problem at the Star Picking Pavilion.”<br/><br/>Seeing him hesitating to speak out, Gu Yang guessed that there must be some unspeakable inside information.<br/><br/>He speculated there was probably another big pitfall.<br/><br/>Wu Er continued, “Also, you should be careful with the Gu family when you go to Divine City. In recent years, a rising star emerged from the Gu family. It won’t be long before he breaks through to the mana realm. By then, he will surely demand the Phoenix Feather Knife from you… Forget it, when I’m free someday, I will get you another treasure sword.”<br/><br/>“Now, I will teach you the second move of the ‘Heavenly Inquiry Nine Knives’. Listen carefully…”<br/><br/>Wu Er was quite impulsive and immediately began to impart saber technique.<br/><br/>The journey from Jiangzhou to Divine City would traverse at least five provinces, a significantly long distance.<br/><br/>Gu Yang had been worried that Cao Yiyi’s Gun God father would chase them, so he wanted to get to Divine City as soon as possible. However, Wu Er told him not to worry, as the trouble had been resolved.<br/><br/>He was surprised, he had not expected Wu Er to have such a staggering reputation that even the Gun God had to give face.<br/><br/>Considering the nickname “Gun God”, it’s clear that Cao Yiyi’s father is a powerful figure on par with the Sword Saint.<br/><br/>In that case, Gu Yang calmed down and studied saber technique with Wu Er.<br/><br/>Later, they switched to traveling by boat, using a canal that led straight to the Divine City. It was more convenient on the boat.<br/><br/>In the blink of an eye, more than ten days had passed.<br/><br/>Wu Er almost forced the saber technique into him haphazardly without caring whether he could digest it.<br/><br/>Over these ten plus days, he finished imparting two saber techniques.<br/><br/>This night, Wu Er called Gu Yang to the deck and said, “Alright, I’ve taught you almost everything I can teach. What is to come depends on your own efforts.”<br/><br/>Gu Yang had a hunch, “Elder, are you leaving?”<br/><br/>“Hmm. I’m afraid I can no longer set foot in Divine City in this lifetime. From now on, you’ll have to rely on yourself. Remember, don’t be too aggressive in doing things. There are always people beyond people, and heavens beyond the heaven. Even if you reach the level of a celestial being, you will still be confined within a small courtyard…”<br/><br/>Gu Yang noticed that something was off in his words and promptly interrupted him, saying, “When will you teach me the remaining six saber techniques?”<br/><br/>“The last six moves of the saber technique, you will have to figure them out on your own.”<br/><br/>Having finished saying that, Wu Er suddenly jumped into the water.<br/><br/>Gu Yang didn’t chase after him, but instead wore a puzzled look. What did his words mean?<br/><br/>Soon, he could no longer sense Wu Er’s presence, whispering, “Take care, elder.”<br/><br/>This was the first person he had met in reality who was willing to share all his knowledge since he traveled to this world.<br/><br/>He didn’t say it out loud, but he considered this old man his master in his heart.<br/><br/>Having a master was wonderful, someone who could shield him from mortal trouble once, and guide him in his saber technique.<br/><br/>This was the first time Gu Yang has received such treatment.<br/><br/>A pity, they had to part in the end.<br/><br/>Turning around, looking in the direction of the Divine City, he said in his heart, “Divine City, here I come.”<br/><br/>He visited this ancient city with thousands of years of history many times in the simulation, but he always met with a bad end.<br/><br/>Now, he was finally on his way to the Divine City, to step onto the biggest stage in this world.<br/><br/>[Would you like to use the Life Simulator? One use will consume 500,000 gold.]<br/><br/>Inside the room, Gu Yang activated the system.<br/><br/>Ever since leaving Jiangzhou, this was the first time he initiated the simulation.<br/><br/>“Yes.”<br/><br/>[At the age of twenty-two, you have reached the peak of the First Rank, just one step away from forming the Golden Body. After defeating Lin Yimo, who was at the first level of the Golden Body realm in the Jiangzhou city, you shocked the world and became known as the number one below the Divine Power Realm.]<br/><br/>[You head to the Divine City and immediately attract attention from all sides. Finally, you join the internal defense force, becoming a deputy commander and earning the opportunity to temper your body in the Huaqing Pool twice.]<br/><br/>[Two months later, the royal family holds a sky-worshipping ceremony. The emperor’s health was not up to par, so the Empress took over. You were put in charge of protecting the Empress.]<br/><br/>[During the sky-worshipping ceremony, the Crown Prince and several ministers suddenly revolted. Very quickly, it turned into a huge brawl. You escaped with the Empress. At a critical moment, a number of highly skilled fighters from within the palace appeared and quelled the rebellion.]<br/><br/>[Impressed by your performance, the Empress wanted to betroth the Third Princess to you, but you delicately declined. The Third Princess was furious when she found out, and had a powerful being in the Mana realm severely wound you.]<br/><br/>[Several months later, a powerful being in the Mana realm appeared in front of you and captured you.]<br/><br/>[Over a year later, you were brought to a secret realm, where you cultivated day and night.]<br/><br/>[Forty years later, you were unable to break through to the Divine Power realm. Under a gigantic Divine Tree, you were bled dry and died at the age of sixty-four.]<br/><br/>After reading the results of this simulation, Gu Yang couldn’t help but be stunned.<br/><br/>Something was not right, what about Xia Dynasty’s treasure?<br/><br/>Why, during this sky-worshipping ceremony, did nobody open that treasure?<br/><br/>He didn’t understand this development.<br/><br/>Where did the changes occur?<br/><br/>Hold on!<br/><br/>Suddenly, Gu Yang had a revelation.<br/><br/>The major changes were mainly two: the first was that he didn’t go to the Military College to check information, and the second was that he didn’t go to the lovely Star Picking Attic at the Literature College to study the celestial problem left by the Celestial Being.<br/><br/>Oh damn, does this mean that the exposure of the Xia Dynasty’s treasure in the last simulation was all my doing?<br/><br/>The more Gu Yang thought about it, the more likely it seemed.<br/><br/>He was too famous. Nothing he did could escape the watchful eyes of those with ulterior motives. It would not be difficult to investigate what information he looked at and deduce what he was looking for…<br/><br/>Of course, it could also be that a powerful Unleaking Realm practitioner was hiding in the Military College who had the power to see and hear everything. He could have found out the secret of the treasure map without him noticing.<br/><br/>Gu Yang realized that he let his guard down during the last simulation. He carelessly revealed such critical information and ended up attracting over a dozen Divine Power Realm practitioners.<br/><br/>Suddenly, he had an idea.<br/><br/>If that was the case, that means, if he were to manage things properly, he could completely monopolize that treasure.<br/><br/>Gu Yang’s eyes shone bright.<br/><br/>[The simulation has ended. You can choose to keep one of the following.]<br/><br/>[One. Your Martial Arts Realm at the age of sixty-four.]<br/><br/>[Two. Your Martial Arts experience at the age of sixty-four.]<br/><br/>[Three. Your life wisdom at the age of sixty-four.]<br/><br/>Originally, Gu Yang wanted to choose the second option. He opened this simulation just so he could practice the second and third moves of the “Heavenly Inquiry Nine Knives”.<br/><br/>However, he changed his mind.<br/><br/>“I choose one.”<br/><br/>PS: First update, asking for monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}