{"id": 166, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14315145.html", "title": "Chapter 166 - Chapter 166 This Thing Is Destined For Me", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 166 - Chapter 166 This Thing Is Destined For Me</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 166  This thing is destined for me<br/><br/>Translator: 549690339<br/><br/>“Another Divine Power cultivator!”<br/><br/>Gu Yang felt some emotion, Divine City was truly unique. In other places, meeting a Divine Power cultivator would be hard. Now, he had not even entered Divine City, yet he had already encountered two Divine Power cultivators.<br/><br/>Regardless of whether it was Lai Baocheng encountered earlier or this woman, their cultivation levels were far beyond that of Lin Yimo from the Lin Family.<br/><br/>This palace?<br/><br/>Hearing the self-designation of the woman, Gu Yang could not help but furrow his brows.<br/><br/>Near Divine City, a woman bold enough to use such a title must definitely come from the royal palace.<br/><br/>Finally unable to sit still, he rose, pushed the door open, and looked up, only to see a woman dressed in palace attire levitating in the air. Under the moonlight, she appeared as ethereal as a fairy.<br/><br/>The palace-dressed woman was clad in an innate aura of nobility, somewhat similar to Princess Zhao Yu, yet with a character completely different, more mature, more composed, and each move she made radiated killing intent.<br/><br/>“Gu Yang pays his respects to Princess Chang.”<br/><br/>He performed a bow.<br/><br/>This person was indeed Princess Chang, the Emperor’s own sister, Princess Zhao Yu’s aunt, the owner of the Long Autumn Palace, and the only woman above the imperial court who could match the Empress in influence.<br/><br/>“You’re even younger than I imagined. Outsiders all say you’re a Saint’s disciple, are you?”<br/><br/>So direct, huh?<br/><br/>Gu Yang didn’t expect Princess Chang to be so blunt, directly asking about other people’s secrets. He responded, “As long as Your Highness believes I am, then I am.”<br/><br/>“Crafty one.”<br/><br/>Princess Chang stretched out her slender finger and tapped his forehead.<br/><br/>Gu Yang did not dodge, nor did he activate his True Qi to resist. He allowed her finger to tap his forehead, calmly meeting her gaze.<br/><br/>Of course he could be calm. He had just undergone a simulation. It did not mention Princess Chang attacking him, so he knew there was no danger.<br/><br/>A trace of surprise flashed through Princess Chang’s eyes, and the corner of her mouth twitched into a smile. “You’re pretty bold, aren’t you afraid I could pierce your brain with one finger?”<br/><br/>Gu Yang countered, “Would Your Highness do that?”<br/><br/>The smile on Princess Chang’s face deepened, “You’re really interesting, come with me. You can state your terms.”<br/><br/>“Any terms?”<br/><br/>Gu Yang spoke somewhat defiantly. He had a rough idea of Princess Chang’s character and guessed she would fall for this.<br/><br/>“Hahaha…”<br/><br/>Princess Chang suddenly burst into hearty laughter. She seemed uninhibited, which coming from her status, could be considered improper. However, it added a touch of charm to her.<br/><br/>“There are many men who want to serve in my court, but you’re the first one to say it in front of me.”<br/><br/>That’s not what I meant!<br/><br/>Upon hearing her words, Gu Yang was filled with question marks.<br/><br/>Should he say her self-perception is too good, or did his previous sentence create this misunderstanding?<br/><br/>It couldn’t be.<br/><br/>Wasn’t that just normal bargaining?<br/><br/>“Too bad, you’re too weak. Want to be my man? You at least have to reach the Mana Realm. Wait till you’ve become the Sword God, then you can come find me.”<br/><br/>Gu Yang planned to clarify, but seeing the smile on her face, he swallowed his explanation.<br/><br/>At this moment, if he said he didn’t mean it like that, he suspected she would become furiously embarrassed and kill him on the spot.<br/><br/>After saying this, Princess Chang flew into the sky. In the blink of an eye, she returned to the bank, looked back, smiled at him, and slipped back into her carriage.<br/><br/>“What should I say, are the women in this world too naive?”<br/><br/>Gu Yang sighed inwardly, creating such a misunderstanding made him feel the need to rethink his approach.<br/><br/>In the end, this place was similar to Earth’s ancient times, conservative in nature and filled with feudal etiquette. Even female warriors in this world would have a hard time escaping the influence of these values.<br/><br/>He suddenly realized, Su Qingzhen, Ling Ling, Xu Ruomei, Chu Xiyue, Pei Qianlan, were they just like that? From his casual actions, had he given them the wrong hint, leading them to mistakenly believe he was interested in them…<br/><br/>With this, everything that he was puzzled about before suddenly made sense.<br/><br/>With his handsome and casually elegant demeanor and amazing martial arts skills, it wouldn’t be a surprise if any woman misunderstood his intentions and fell for him.<br/><br/>If blame had to be assigned, it would rest on his irresistible charm.<br/><br/>Gu Yang was shocked, “Turns out, I am the actual scoundrel?”<br/><br/>No, he must behave with caution in the future, especially in front of women, beautiful women at that.<br/><br/>He silently warned himself, looked up to see that no one else was around, walked towards a door not too far away and knocked, “Senior Gao, Tianci, open the door.”<br/><br/>Gu Yang had long sensed the presence of these two; in the same boat, always whispering in hushed tones- it was hard not to notice.<br/><br/>Meeting them here was fate.<br/><br/>The door opened with a creak, Feng Tianci’s face was filled with excitement, “Brother Gu, I didn’t expect to meet you here.”<br/><br/>Seeing that Feng Tianci had broken into the Third Rank, Gu Yang felt somewhat relieved. Considering Feng as his half-apprentice, he approved, “Not bad, you’ve reached the Third Rank.”<br/><br/>“Compared to you, Brother Gu, my little progress is not worth mentioning.”<br/><br/>Gu Yang cast his gaze inside at two people, a man and a woman, lying unconscious. The man appeared to be in his thirties, and the girl was around fourteen or fifteen. “Who are these two?” he asked.<br/><br/>Gao Fan, standing at the side, said, “Children of Xiahou Shuwen. Guo Taiping stole the Golden Text Dictionaries written by Xiahou Shuwen. After succeeding, he silenced them for good. This silly little fellow couldn’t bear to see injustice and saved them.”<br/><br/>Gu Yang asked in surprise, “Golden Text Dictionaries?”<br/><br/>Gao Fan replied, “The Xiahou family was once a prestigious world family, descendants researching the Xia Dynasty’s Golden Text, and compiled a Golden Text Dictionary, the family heirloom. Sadly, it was because of this that their family met its demise.”<br/><br/>This was like a pillow arriving just as he was getting sleepy.<br/><br/>Gu Yang was just thinking about how to dodge those people in Divine City and translate the text from the treasure map, and here were two experts delivered to him.<br/><br/>He asked, “Being the children of Xiahou Shuwen, they must understand the Golden Text too, right?”<br/><br/>“Xiahou Shuwen once said that his daughter is a genius in this field with a profound understanding of the Golden Text.”<br/><br/>Gu Yang looked at the young girl, noticing she was unconscious, and began to channel some True Qi into her.<br/><br/>Just then, something strange happened. Something inside the girl’s clothing sort of jumped.<br/><br/>That object quickly flew out from the collar of her dress. It was a cylindrical piece of white jade about the thickness of a little finger, tied with a golden thread and worn around the girl’s neck.<br/><br/>This piece of white jade emitted a purple glow. Within the glow, a few lines of complex text were projected that resembled the Golden Text.<br/><br/>What was happening?<br/><br/>Gu Yang found it strange and withdrew his True Qi. Immediately, the text vanished from the jade piece, the glow faded, and the jade piece fell again.<br/><br/>As he again channeled True Qi into her, the jade flew up and displayed text.<br/><br/>At this moment, the unconscious girl groaned, fluttered her eyes open, and was greeted by this bizarre scene. She opened her eyes wide in disbelief.<br/><br/>Gu Yang felt that there was something unusual about this piece of jade. He beckoned with his hand, the golden thread snapped, and the jade moved into his palm.<br/><br/>Gao Fan and Feng Tianci at his side too were amazed.<br/><br/>“Master, that jade piece seemed to react to Brother Gu’s True Qi. What’s going on?”<br/><br/>Gao Fan, as if considering something, furrowed his eyebrows and said, “Perhaps, she will know.”<br/><br/>He was referring to the young girl from the Xiahou family.<br/><br/>The girl had just come out of her shock and quickly said, “Give it back to me…” However, her body was restrained by an invisible force, unable to move.<br/><br/>Gu Yang said, “You see, this piece and I are destined to be.”<br/><br/>The girl instinctually tried to argue back, but upon seeing the jade piece in his hand, emitting a purple glow, and displaying characters, she choked and was left speechless.<br/><br/>As soon as she looked at the text, her face gradually changed, and looking at Gu Yang, her eyes showed a hint of alarm.<br/><br/>Gu Yang took back his True Qi, and the jade reverted to its original form.<br/><br/>“Tell me, what on earth is this?”<br/><br/>The girl’s face changed several times, bit her lip, and finally unable to resist, glanced at Gao Fan and his apprentice Feng Tianci.<br/><br/>Gao Fan immediately said, “I’m hungry, let’s get something to eat.” Saying this, he pulled his apprentice and left the room, closing the door conveniently.<br/><br/>Gu Yang said, “Now, you can say.”<br/><br/>The girl’s lips moved slightly, she whispered, “It’s a seal that represents a certain status…”<br/><br/>PS: The third update, begging for a monthly pass.\t\t\t\t\t\t</div>", "images": {}, "success": true}