{"id": 172, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14315155.html", "title": "Chapter 172 - Chapter 172 172 I Also Have A Treasure Map", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 172 - Chapter 172 172 I Also Have A Treasure Map</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 172 172 I also have a treasure map<br/><br/>Translator: 549690339<br/><br/>While chatting with Cheng Qingyu, Gu Yang beckoned to the Xiahou siblings, indicating for them to come over.<br/><br/>When they approached, the little girl wisely kept her mouth shut.<br/><br/>“It appears that your injuries have almost healed,” Gu Yang said.<br/><br/>The siblings fell to their knees, “We are extremely grateful for Gu Yang’s life-saving grace. We have nothing to offer in return and are willing to serve as your bondservants.”<br/><br/>Looking at the siblings kneeling on the ground, Gu Yang felt a headache coming on. He didn’t want to tread on the same path from before. “Actually, the ones who saved you were Senior Gao and his disciple. If you want to thank someone, thank them instead,” he said.<br/><br/>With a wave of his hand, the siblings were lifted up by an invisible force and landed about ten meters away.<br/><br/>His meaning was clear – he did not want to accept them into his service.<br/><br/>Seeing this, Cheng Qingyu was flabbergasted and looked at Gu Yang with newfound awe and reverence. She asked softly, “Brother Gu, have you achieved Divine Power yet?”<br/><br/>“Not yet.”<br/><br/>This level of divine power and still not in the Divine Realm?<br/><br/>Cheng Qingyu couldn’t imagine the power a true master of the Divine Realm would possess.<br/><br/>At this point, the Xiahou girl came running back over and offered a book from her bosom, “Please accept this.”<br/><br/>This time, Gu Yang didn’t refuse, and he took the book from her.<br/><br/>The girl bowed deeply before departing.<br/><br/>Gu Yang flipped through the book, noting the entirely golden text and detailed annotations.<br/><br/>This was the hard work of the Xiahou family, passed down over a dozen generations.<br/><br/>This was exactly what he needed. With this book, he would be able to translate the text on his treasure map, uncovering the way to open the Secret Realm.<br/><br/>That evening, a clear whistle emanated from the courtyard where Cheng Tianxin resided.<br/><br/>Through another perspective, Gu Yang could clearly see his True Essence skyrocket and become purer. Cheng Tianxin had successfully broken through to the First Rank.<br/><br/>“This youngster has talent, comprehension and determination, all he lacked was opportunity,” Gu Yang mused.<br/><br/>Gao Fan and his disciple, Feng Tianci, were also awakened and joined them. In a somewhat weary tone, Gao Fan remarked, “This means that from now on he will be a thorn in the side of many…”<br/><br/>Feng Tianci replied indignantly, “Are people in power going to make things difficult for him just because he opened a Martial Academy?”<br/><br/>In response, Gao Fan said, “My boy, you truly don’t understand the dangers of human nature. To those noble children, the sight of the once-oppressed turning the tides is utterly unacceptable…”<br/><br/>After lecturing his disciple, Gao Fan turned to Gu Yang and brought up the main issue at hand, “Today, did the Xiahou siblings give you a book annotated in golden text?”<br/><br/>“Yes.”<br/><br/>“Could I borrow it for a bit?”<br/><br/>Intrigued, Gu Yang asked, “What would Senior Gao need with the golden text annotations?”<br/><br/>Looking around to make sure no one was paying attention, Gao Fan leaned in and said quietly, “To be frank, I unintentionally obtained a treasure map from the Xia Dynasty, but unfortunately, I don’t know how to read the Golden Text.”<br/><br/>A treasure map from the Xia Dynasty?<br/><br/>Gu Yang felt strange in his heart. Could his treasure map and Gao Fan’s be the same, by any chance?<br/><br/>Gao Fan said, “Don’t worry, I won’t simply borrow it. I’ll share the treasure with you.”<br/><br/>“Alright,” Gu Yang agreed.<br/><br/>Gu Yang followed Gao Fan and his disciple to their quarters. Once inside and the doors were closed, Gao Fan removed a folded silk map from his shoe and spread it out on the table.<br/><br/>As Gu Yang looked at this peculiar map, he grew more curious.<br/><br/>Gao Fan’s map was somewhat different from his own. The terrain seemed similar, but the text was entirely different.<br/><br/>There were actually two treasure maps from the Xia Dynasty.<br/><br/>Keeping his surprise hidden, he handed Gao Fan the book and asked, “How did senior obtain this treasure map?”<br/><br/>“I stole it from someone.”<br/><br/>As Gao Fan talked, he began to browse the book. With the golden text annotations in hand, he started translating the text on the map.<br/><br/>“Rumour has it that when the Xia Dynasty fell, a prince hid the majority of the empire’s wealth and the Human Emperor’s Sword in a Secret Realm within Divine City. This treasure map marks the location of that place and details how to open it.”<br/><br/>The Human Emperor’s Sword, again?<br/><br/>Gu Yang furrowed his brows, sensing that things weren’t so simple.<br/><br/>The question was, which map was real?<br/><br/>Based on his simulation, the map he had should be the real one. After successfully opening the Secret Realm, there was indeed a Divine Sword inside and even a strong master from the Unleaking Realm guarding it.<br/><br/>However, it does not necessarily mean that Gao Fan’s version is fake.<br/><br/>Perhaps, the methods to open the secret realm on both maps are valid.<br/><br/>Suddenly, Gu Yang remembered, “Senior, did you tell that Sword Saint about the treasure when you last went to Jingzhou City?”<br/><br/>“Yes, I was hoping to recruit him as a helper, but unfortunately, Wu Tianqi has already broken through to the Divine Power realm. He no longer needs the Human Emperor Sword,” Gao Fan sounded rather regretful.<br/><br/>If Huangfude is willing to help, the chances of obtaining the Human Emperor Sword would be much higher.<br/><br/>Even if he is injured, his strength is incomparable to those of ordinary Mana Realm.<br/><br/>Gu Yang had finally connected all the clues.<br/><br/>In that previous simulation, King Jinghai was killed, forcing the Sword Saint out of desperation to head to Divine City to claim the Human Emperor Sword.<br/><br/>Furthermore, it was likely that the treasure map Gao Fan held had been circulated, attracting over a ten Divine Power realm practitioners to seek it.<br/><br/>If each Divine Power realm practitioner represented a different power, that would suggest everyone from these powers holds a copy of the treasure map.<br/><br/>Given Gu Yang’s vast experience, this situation indeed made him suspicious – if there were no tricks being played behind, that would be the real surprise.<br/><br/>“I’ve got it!”<br/><br/>A quarter of an hour later, Gao Fan had finally translated the golden text on the map and joyfully announced, “The location of the secret realm is in the residence of King Qi.”<br/><br/>Upon hearing this, Gu Yang had a clear understanding.<br/><br/>The map in Gao Fan’s hand was a fake.<br/><br/>He remembered the true entrance to the treasure was in the Heavenly Altar, a heavily guarded Imperial spot where even flies would struggle to enter uninvited.<br/><br/>However, the residence of King Qi, that was indeed a coincidence.<br/><br/>The seal he got from that Xiahou girl was from King Qi himself.<br/><br/>He had received the legacy within the seal, which effectively made him King Qi now.<br/><br/>Gao Fan excitedly added, “Now, we just need to find the location of the King Qi Residence.”<br/><br/>Gu Yang couldn’t help but caution, “Senior, are you so sure that this treasure map is genuine?”<br/><br/>Gao Fan shrugged, “The Human Emperor Sword is of great importance, even with just a one percent chance, I have to try.”<br/><br/>Having spoken, he folded back the treasure map, carefully tucked it back into his shoe sole, and announced, “I’ll go find out the location of the King Qi Residence from the era of the Xia Dynasty. Tianci, you stay here.”<br/><br/>Then he left.<br/><br/>For the next few days, Gao Fan was nowhere to be found, which had Feng Tianci worried sick.<br/><br/>After Cheng Tianxin had reached the First Rank,he went into closed cultivation to solidify his realm.<br/><br/>Meanwhile, Gu Yang translated the golden text from his copy of the treasure map, which indeed mentioned that the entrance to the secret realm was within the Heavenly Altar.<br/><br/>The method to open it was also listed.<br/><br/>The problem now was how to sneak into the Heavenly Altar, unknowingly open the portal to the secret realm, and finally shift all the gold and silver from the secret realm without alerting the Unleaking Realm expert?<br/><br/>​​It seemed like an impossible task to complete.<br/><br/>The day before the banquet at the Duke’s residence, Cheng Xue came to his quarters with her men, each carrying a box of gold and silver, and announced, “Young Master Gu, we’ve completed our mission. All those items have been sold, earning us three million one hundred thousand taels of silver. It’s all here.”<br/><br/>Gu Yang was thrilled at the news – over three million taels was a thirst-quenching amount.<br/><br/>After moving into the Tianxin Martial Arts Hall, he had requested Cheng Xue to sell the items they had collected from the Lin Family’s secret warehouse.<br/><br/>Cheng Xue had indeed put in significant efforts. In the past few days, she had been busy handling the sales and had finally managed to sell everything.<br/><br/>Thanks to Tianxin Martial Arts Hall’s extensive network in Divine City, the items were sold at good prices.<br/><br/>Gu Yang spoke, “Miss Cheng, thank you for your efforts.”<br/><br/>After seeing Cheng Xue off, he was about to proceed to convert all his gold and silver into currency when Gao Fan walked in. Immediately entering, he stated, “I found it. King Qi residence is the present Duke’s residence.”<br/><br/>Really?<br/><br/>The more Gu Yang thought about it, the more he felt that this was brimming with the scent of conspiracy.<br/><br/>All of this was just too coincidental.<br/><br/>Tomorrow is the Duke’s sixtieth birthday, for which he will invite members from all over Divine City. Coincidentally, the entrance to the secret realm stated on the treasure map was known to be in the Duke’s residence.<br/><br/>Are all these merely coincidences?<br/><br/>He didn’t believe it one bit.<br/><br/>Gu Yang had a hunch that tomorrow’s visit to the Duke’s residence would be quite lively.<br/><br/>PS: Third update, votes for the next month are appreciated.\t\t\t\t\t\t</div>", "images": {}, "success": true}