{"id": 173, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14343918.html", "title": "Chapter 173 - Chapter 173 What Does 173 Represent?", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 173 - Chapter 173 What Does 173 Represent?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 173 What does 173 represent?<br/><br/>Translator: 549690339<br/><br/>Several miles away from Divine City, there was a mountain known as Dragon Head Mountain, named so due to its shape resembling a dragon’s head.<br/><br/>In a canyon on the mountain, a figure silently descended and after looking around, he said contentedly, “This is the place.”<br/><br/>Then, he found a stone to sit on.<br/><br/>This person was Gu Yang. That afternoon, he had learned from Gao Fan that the Duchy Residence was once the residence of King Qi during the Xia Dynasty, and smelled the strong scent of conspiracy.<br/><br/>Since he knew the Duchy Residence was a dangerous place, he naturally had to make preparations in advance.<br/><br/>First, a simulation to predict the outcome of tomorrow’s trip.<br/><br/>Gu Yang knew there were hidden and dangerous powerful beings within Divine City, including those at the Celestial Being realm. so he didn’t want to carry out the simulation in Divine City. He left the city and came to this mountain miles away.<br/><br/>[Do you want to use the life simulator? Each use consumes 500,000 coins.]<br/><br/>“Yes.”<br/><br/>[At twenty-two, you have reached the peak of First Rank, just one step away from achieving a Golden Body. Your defeat of Lin Yimo from the Lin Family, who is at the Golden Body realm, in Jiangzhou city, has shocked the world.]<br/><br/>[You went to Divine City and on a certain day, you went to the Duchy Residence for the Duchy’s birthday. At the feast, an unexpected event occurred and the entrance to a Secret Realm was opened by someone. Almost a dozen Divine Power realm cultivators rushed into the Secret Realm simultaneously. Soon after, the Secret Realm closed itself.]<br/><br/>[While you were observing the chaos, the Duchy Residence was suddenly sealed off. Five cultivators at the Divine Power realm arrived and immediately launched an attack, intending to kill everyone present.]<br/><br/>[At the critical moment, two royal bodyguards from the Empress’s side took action, along with two Divine Power realm cultivators. You were also forced to take action, barely fending off the five enemies.]<br/><br/>[A devastating battle ensued. Both royal bodyguards sacrificed their lives. Eventually, the lockdown of the Duchy Residence was broken, and reinforcements quickly arrived. The five enemies retreated.]<br/><br/>[This battle resulted in heavy casualties among the guests, and the dozen or so Divine Power realm cultivators trapped in the Secret Realm couldn’t be rescued. Attempts to open the realm using the treasure map were unsuccessful.]<br/><br/>[You were severely injured and stayed in the Duchy Residence to recuperate. The second daughter often visited you out of gratitude for saving her father, and you two often discussed martial arts.]<br/><br/>[Your performance earned the approval of the Empress, who personally tried to win you over. You agreed to her offer of ten million taels and joined the guard after recovering.]<br/><br/>[A year later, the steppe people sent a messenger to Divine City to propose marriage to the peerless princess. After being rejected, they launched a large-scale invasion into Great Zhou.]<br/><br/>[Not long afterward, the Red Venerate Church staged a rebellion.]<br/><br/>[You remained in Divine City the whole time, responsible for protecting the Empress.]<br/><br/>[Five years later, Pei Qianlan stepped into the Divine Power realm and came to meet you in Divine City.]<br/><br/>[Three years after that, Su Qingzhen also reached the Divine Power realm and came to Divine City.]<br/><br/>[Nine years later, Qin Wu led his troops to attack Zhou, marching all the way to the outskirts of Divine City. King Luo took action, resulting in a battle between Celestial Beings.]<br/><br/>[Amid the chaos, a powerful being from the Mana realm appeared in front of you, only to be injured by a Mana realm protector beside the Empress and fled in fear.]<br/><br/>[The Celestial Being battle outside of Divine City broke the ancient prohibition, opening the entrance to the Star Luo Pocket Universe. Soon after, a Celestial Being flew out from within the Star Luo Pocket Universe and killed King Luo while Qin Wu barely escaped when they were both seriously injured.]<br/><br/>[Later, dozens of cultivators in the Divine Power realm flew out from the Star Luo Pocket Universe, intending to occupy Divine City. But at the critical moment, a Celestial Being from the College made a move and killed half of the disciples of Star Luo Sect. The Celestial Being from Star Luo Sect retaliated, sparking off a fierce battle within Divine City.]<br/><br/>[In the end, the royal family activated an ancient prohibition, suppressing the Celestial Being from Star Luo Sect deep beneath the royal palace. Not long after, the Celestial Being from the College also passed away.]<br/><br/>[Afterward, Star Luo Sect laid siege to and sealed off Divine City.]<br/><br/>[Five years later, Divine City could not hold on any longer. Led by the royal family of Great Zhou, they launched a breakout attempt. In the fierce war, you were targeted by a powerful cultivator in the Unleaking Realm and were killed on the spot. You died at the age of forty-five.]<br/><br/>After reading this, Gu Yang couldn’t help but sigh. He felt shocked about the major events that Divine City would go through in the next twenty years.<br/><br/>According to the results, two Celestial Beings fell, one was severely injured, and one was suppressed.<br/><br/>As for those cultivators in the Divine Power realm, it goes without saying, countless had died.<br/><br/>As for the final breakout, how many could escape?<br/><br/>He remembered that once during a simulation, he met the royal family of Great Zhou who had escaped overseas. Even dealing with Su Qingzhen and Ling Ling, the newly promoted Divine power realm cultivators, was quite difficult.<br/><br/>It was truly tragic.<br/><br/>Lost in his thoughts, Gu Yang returned his attention back to tomorrow’s trip to the Duchy Residence.<br/><br/>Looking at the results, this was undoubtedly a conspiracy, with one objective being to lock those powerful beings who coveted the Human Emperor Sword, into the Secret Realm.<br/><br/>The second was to kill all guests in the Duchy Residence.<br/><br/>This tactic was indeed extremely ruthless.<br/><br/>They could destroy a group of divine power realm combatants, catching all high-ranking officials in one fell swoop.<br/><br/>If they could succeed in the end, all the major forces would suffer losses. The worst hit would be the court and the royal family, their losses would be devastating.<br/><br/>The Empress also attended the banquet that day.<br/><br/>Unfortunately for them, they encountered me.<br/><br/>As Gu Yang pondered, he suddenly remembered something, “No, that’s not right.”<br/><br/>In a few prior simulations, the Empress survived and lived for several decades.<br/><br/>This means that even without him, this conspiracy would ultimately not succeed.<br/><br/>Of course, it’s also possible that the Empress had special means to protect her life, which is why she managed to survive.<br/><br/>This simulation held too much information, yet many details were missing. He only had fragments of information and could only guess.<br/><br/>“How nice it would be if there was an option to acquire all the memories within this simulation,” Gu Yang muttered.<br/><br/>He didn’t know how many times he had harbored this wish. If it were so, why would he need to make guesses like now?<br/><br/>However, one thing was certain.<br/><br/>The Empress wasn’t so ruthless. In this simulation, she didn’t betray him again. Clearly, she acknowledged his deeds at the national husband’s mansion.<br/><br/>More than that, she allowed him to stay by her side, not letting him leave Divine City.<br/><br/>The mana realm powerhouse from some holy land had no opportunity to make a move. It wasn’t until the celestial war decades later that they had the opportunity to attack, but the Empress’s guards thwarted it.<br/><br/>Of course, this indirectly resulted in him living nearly twenty years less.<br/><br/>If he had not stayed in Divine City, he could have lived into his sixties. He lost almost twenty years of his life.<br/><br/>What a loss.<br/><br/>[Simulation ends. You can retain one of the following options.]<br/><br/>[One, martial arts realm at 45 years old.]<br/><br/>[Two, martial arts experience at 45 years old.]<br/><br/>[Three, life wisdom at 45 years old.]<br/><br/>This time, he made a tough decision and chose the second option.<br/><br/>Suddenly, a flood of memories poured into his mind, including his combat experiences. The most impressive ones were the impending battle at the national husband’s mansion, and the breakout battle before his death.<br/><br/>There were also various martial arts experiences. The most significant were the two techniques of the “Heavenly Inquiry Nine Knives”.<br/><br/>His talent in saber techniques didn’t disappoint. After more than two decades, he finally mastered these two techniques.<br/><br/>Gu Yang sat in place for two hours, until it was dark before he was able to digest these experiences barely.<br/><br/>Having newly mastered the two techniques of the “Heavenly Inquiry Nine Knives,” he was more confident about tomorrow’s battle.<br/><br/>Still, this wasn’t enough.<br/><br/>What if he overperforms and becomes the enemy’s primary target?<br/><br/>The fate of the Empress’s two guardians served as a sobering example.<br/><br/>The five divine realm powerhouses certainly had stronger capabilities than their opponents.<br/><br/>Gu Yang initiated another simulation.<br/><br/>[…You obtained the “Divine Phoenix Manual” from the “Nine Heavens Divine Method” within that seal, leading to a substantial increase in your cultivation level, and you adequately refined the seal.]<br/><br/>[You go to the national husband’s mansion to celebrate his birthday, with the seal, you find a residual prohibition underground. You were about to explore, but an anomaly occurred, and an entrance to a secret realm appeared out of thin air.]<br/><br/>[Over a dozen divine power realm combatants rushed into the secret realm, then the secret realm entrance closed and the national husband’s mansion was sealed, and five divine realm combatants appeared…]<br/><br/>[…After this battle, you won the favor of the Empress, who then decreed her sister as your wife.]<br/><br/>[You didn’t want to accept it, so you left Divine City. On the way, you were caught by a mana realm powerhouse. You activated the Divine Phoenix Manual, turned into a phoenix about to fly away, but a red rope wrapped around your leg, no matter how much you struggled, you couldn’t break free…]<br/><br/>PS: The first update, asking for monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}