{"id": 177, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14343926.html", "title": "Chapter 177 - Chapter 177 Demon Suppression Tower", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 177 - Chapter 177 Demon Suppression Tower</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 177 Demon Suppression Tower<br/><br/>Translator: 549690339<br/><br/>The reason why Gu Yang was so sure, and could hold back even at the last moment, was that he guessed there must be a Divine Power Realm master in the Lord’s mansion.<br/><br/>The Empress in the Lord’s mansion, Ye Lingbo, and Guo Taiping, had all survived several years into the future.<br/><br/>Not to mention the Empress, Ye Lingbo, the chief disciple of the literary institute, had once followed the Empress’s order to challenge this third-ranked genius in a simulation. The time was several years later.<br/><br/>According to the original progress of time, Guo Taiping would challenge Cheng Tianxin a few years later.<br/><br/>From these signs, he inferred that the people in the Lord’s mansion must be unharmed from all dangers in this trip.<br/><br/>Even if he did not make a move, someone naturally would.<br/><br/>However, Gu Yang really did not expect that the fifth Divine Power Realm master in the Lord’s mansion would be Sister Su, whom Cheng Qingyu had mentioned in his speech. That is the current Empress’s younger sister.<br/><br/>How old was she?<br/><br/>The Empress entered the palace ten years ago, and she was at most twenty-five or twenty-six years old.<br/><br/>Her little sister, should not be older than twenty-five years.<br/><br/>A Divine Power Realm master at twenty-five years old, this was simply ridiculous.<br/><br/>Moreover, the weapon she used was a red string, which reminded him of some not so pleasant memories.<br/><br/>Could the Mana Realm master who had tied him up with a red string in a previous simulation have anything to do with her?<br/><br/>“This woman is too scheming. In the previous simulation, she just watched as I was severely injured. Now, it’s your turn to take the hit.”<br/><br/>Gu Yang smirked, with a touch of schadenfreude.<br/><br/>In the sky, the man in the black cloak holding the Godslayer Sword was carelessly tangled up in the red string. The terrifying aura on him instantly disappeared, as though his cultivation had been sealed. He started to fall.<br/><br/>“Marriage Rope? It´s someone from Blue Sky Palace!”<br/><br/>The man handling an intangible sword had the upper hand, and when he saw what was happening on the side, his facial expression changed suddenly.<br/><br/>The Marriage Rope was an ancient abnormal treasure. It had a pleasant name, but its power was extraordinary. Once entangled by it, all one’s cultivation would be sealed, and one could do nothing about it.<br/><br/>It was said that in ancient times, if a female immortal took a liking to a male immortal, she would tie him up with the Marriage Rope and bring him back to her cave to marry. That was the origin of its name.<br/><br/>This kind of abnormal treasure had long been lost, and only the disciples of Blue Sky Palace had ever used it.<br/><br/>The man in the black cloak who was bound by the Marriage Rope was falling continuously when suddenly a bizarre purplish-red glimmer lit up in his eyes.<br/><br/>For a moment, the thoughts of everyone present seemed to freeze as if they had turned into ice.<br/><br/>“No good!”<br/><br/>Gu Yang, who was behind the rockery, could not help but lose his smile. He was very familiar with this strange fluctuation.<br/><br/>It was the ninth style of the “God Destroyer Nine Styles,” the God Destroyer Style!<br/><br/>This style was extremely bizarre and completely unreasonable. Once swung, it would directly annihilate the Original Spirit.<br/><br/>He had used it once and noticed something wrong with this move. To this day, he still dared not use it again.<br/><br/>The man in the black robe had even learned this move.<br/><br/>At this moment, an annoyed voice rang out in his ear, “If you don’t make a move, everyone will die here! You’ll not be able to escape either.”<br/><br/>Apparently, the Empress’s sister had already found him out.<br/><br/>Gu Yang didn’t need her remind, he had already leaped up, fully activated his True Essence, raised his Phoenix Feather Knife, and used the first style of “Heavenly Inquiry Nine Knives,” the Beginning of Chaos!<br/><br/>His target was not the man in black cloak, but the light curtain in the sky.<br/><br/>As long as he could break the light curtain, the strong men inside Divine City should be able to quickly discover what was happening here and come to the rescue.<br/><br/>If the people from the Red Venerate Sect wanted to survive in Divine City, the only thing they could do was retreat.<br/><br/>The black-robed man’s “God Destroyer Style” affected everyone present, regardless of whether they were friends or foes.<br/><br/>The nearest palace expert holding a bronze candlestick was the first to bear the brunt. His mental state was seriously affected. The point of the green flame on the candlestick flickered and was on the verge of going out.<br/><br/>He bit his tongue, his face flashed with an abnormal blush, and the candlelight finally stabilized.<br/><br/>But, it was too late.<br/><br/>When the candle flickered, the Red Sun was still unable to move, but a trace of black light flashed in his eyes. A strand of his hair flew out.<br/><br/>The strand of hair swelled in the wind and transformed into a massive black tower that moved to envelop Gu Yang.<br/><br/>Gu Yang felt a terrifying suction force, his body involuntarily propelled towards the enormous tower.<br/><br/>What the heck is this thing?<br/><br/>He was taken aback, unable to break free. In a flash of realization, he gritted his teeth, his hands did not stop their motion. He slashed out at the air with his sword.<br/><br/>Right at that moment, he felt a tightness around his foot. He looked down and saw a red thread wound around his ankle.<br/><br/>Whoosh.<br/><br/>Gu Yang didn’t even have time to observe the result of his slash – his vision went black, and he couldn’t see anything.<br/><br/>After a feeling of weightlessness, Gu Yang’s vision returned, and he once again felt the presence of gravity. He was rapidly descending.<br/><br/>He quickly surveyed his surroundings. It was a vast space, desolate, devoid of any signs of life.<br/><br/>On the ground, numerous ruined buildings and various strange objects were scattered around. The most abundant thing was the skeletal remains of corpses.<br/><br/>Thud.<br/><br/>Gu Yang finally landed, extremely alert, “What kind of hellish place is this?”<br/><br/>There was air here, as well as the existence of vitality, no different from the outside world. However, the space’s range was limited. Despite the limited light, he still noticed the apparent boundary.<br/><br/>Behind him, a woman’s voice sounded, “This is the first level of the Demon Suppression Tower.”<br/><br/>Gu Yang turned around to see a woman in a light purple dress. Although he was accustomed to seeing breathtaking beauty, this woman in front of him was stunning beyond anything he had seen before. A phrase instantly sprung to his mind – devastatingly beautiful.<br/><br/>On the Beauty list, there were thirteen people. However, the first and the second places were blank, each only holding a codename.<br/><br/>Second place was—devastatingly beautiful.<br/><br/>Gu Yang had a premonition that this woman before him was the unnamed devastating beauty on the Beauty list.<br/><br/>She was also the younger sister of the queen, the Elder Sister Su mentioned by Cheng Qingyu.<br/><br/>He asked her with some confusion, “Why did you come in with me?”<br/><br/>He wouldn’t believe that she was brought in because she wanted to save him.<br/><br/>This woman had chosen to follow him into this place of her own accord.<br/><br/>As if she hadn’t heard his question, the woman continued speaking, “The Demon Suppression Tower was originally the sacred treasure of the Dao Sect…<br/><br/>“After decades, the leader of the Red Venerate Sect, wielding the Demon Suppression Tower, suppressed dozens of divine power realm masters… finally, the remaining Dao Sect disciple took control of the Demon Suppression Tower.”<br/><br/>“The Demon Suppression Tower has nine layers. To escape, you must reach the top. To survive, reach the ninth floor before the Red Sun leaves Divine City.”<br/><br/>When the woman got to here, her brow furrowed at Gu Yang scratching around on the ground, “Are you listening to me?”<br/><br/>Gu Yang pulled something from the ground, blew off the dust, revealing a golden gleam. It was a gold bar, weighing about fifty taels.<br/><br/>His eyes seemed to be shining, “Why is there gold in the Demon Suppression Tower?”<br/><br/>The woman was somewhat angry that he was paying attention to such a trivial matter at such a moment, and said patiently, “The previous Red Venerate leader used the Demon Suppression Tower to contain entire cities. The people were offered sacrifices to the Red Sun, but their belongings were left behind. We should go.”<br/><br/>“You go first. I’ll be there in a minute.”<br/><br/>Gu Yang completely ignored her and continued collecting money.<br/><br/>“You-”<br/><br/>The woman felt that this man was simply unreasonable. At such a critical juncture, he cared about worldly possessions. She left without further ado.<br/><br/>Left behind, Gu Yang quickly pulled out a sizeable pile of gold and silver. He was delighted, “I’ve hit the jackpot.”<br/><br/>He opened his system interface, elected to recharge, and at once, the remaining balance began to jump, five digits, six digits, seven digits…<br/><br/>Finally, when it reached eight digits, it stopped.\t\t\t\t\t\t</div>", "images": {}, "success": true}