{"id": 171, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14315153.html", "title": "Chapter 171 - Chapter 171 171 State Prime Minister’S Mansion", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 171 - Chapter 171 171 State Prime Minister’S Mansion</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 171 171 State Prime Minister’s Mansion<br/><br/>Translator: 549690339<br/><br/>Divine City, Guo Residence.<br/><br/>Guo Taiping sat in the room with a sword resting on his knee. After two days of meditating, his volatile emotions finally calmed down.<br/><br/>He opened his eyes, a dim purple light flashed in them. Compared to two days ago, his aura had changed significantly. He had astonishingly broken through to the First Rank realm.<br/><br/>“Well done.”<br/><br/>A sound of approval echoed in his ear, it was the voice of his third uncle, “You have nurtured your Mind Demon.”<br/><br/>Guo Taiping’s expression was somber. Given the choice, he would never want that man to be his Mind Demon.<br/><br/>All the nine surnames in the world, including the extinct Wu Family, have their unmatched secret techniques known to everyone.<br/><br/>But only the Guo Family’s secret technique always remained a mystery, with very few people knowing about it.<br/><br/>The Guo Family’s secret cultivation technique is called “Overbearing Heart of Mind Demon.” Its cultivation method is incredibly bizarre.<br/><br/>Once cultivators who practice this technique are defeated by someone, the victor becomes their Mind Demon.<br/><br/>Once a Mind Demon is created, it continues tormenting the cultivator day and night.<br/><br/>The cultivator draws strength from this pain. The deeper the Mind Demon, the more pain it inflicts, and consequently, the quicker the power increases.<br/><br/>Under the influence of the Mind Demon, their intent to kill their enemy gets stronger over time. If they can successfully kill their enemy, they shall gain enlightenment and greatly increase their power.<br/><br/>If they are unable to kill their target, they will either die by their hand or succumb to the torment of the Mind Demon, dying in madness.<br/><br/>This technique brings huge rewards as well as enormous risks.<br/><br/>To outsiders, the Guo Family is fascinating, cultivating at a rapid pace, and everyone who reaches the Divine Power realm is extremely young.<br/><br/>But who knows that all these are achieved at the risk of their lives?<br/><br/>Every member of the Guo Family lives life on a tightrope, a small misstep can lead to a catastrophic fall.<br/><br/>This results in the Guo Family’s cautious demeanor. They do not easily offend others, but once they bear a grudge, they are determined to fight to the death.<br/><br/>Originally, Guo Taiping had planned a safe path for himself. When selecting opponents, he was very cautious, choosing those whose cultivation level was not much higher than his own and did not have a strong backing.<br/><br/>In this way, even if he was defeated by his opponent, his own cultivation level would surpass theirs in no time, allowing him to kill them, breaking the hold of the Mind Demon.<br/><br/>Then, he would find the next opponent.<br/><br/>Guo Taiping’s cultivation level was in fact in a rapidly growing phase, therefore he didn’t need to use this extreme method to enhance his power.<br/><br/>At this rate, within a year or two, he would be able to break through to the First Rank.<br/><br/>But to his surprise, Gu Yang appeared out of nowhere and shattered all his plans.<br/><br/>Now, he had no choice. Gu Yang’s attack had created a Mind Demon in him, and although this led to his breakthrough to the First Rank within a short span of two days.<br/><br/>The consequence is that it was a life and death situation between him and Gu Yang.<br/><br/>Guo Taiping turned extremely somber thinking about it.<br/><br/>He was very clear about the gap in strength between himself and Gu Yang. The attack two days ago made it clear that Gu Yang’s strength was close to what people say – enough to slay the Golden Body.<br/><br/>“Damn it, why did you have to provoke me?”<br/><br/>Guo Taiping’s heart was filled anger and he felt extremely wronged.<br/><br/>Unconsciously, his Mind Demon was already taking hold.<br/><br/>Knock, knock.<br/><br/>The sound of knocking on the door jolted him to reality. He composed himself and said, “Come in.”<br/><br/>The person who entered was Guo Family’s intelligence chief stationed in Divine City; an inconspicuous middle-aged man. “Young master, we have found the location of King Qi’s throne during the Xia Dynasty.”<br/><br/>Guo Taiping was pleasantly surprised, “Where is it?”<br/><br/>“The Minister’s Residence!”<br/><br/>The Minister’s Residence?<br/><br/>Guo Taiping’s eyes narrowed.<br/><br/>Divine City is unlike any other place. There are many people, even he cannot afford to offend.<br/><br/>At the very top of that list would be the two women.<br/><br/>The Empress and Princess Chang.<br/><br/>The Minister’s Residence is the Empress’s natal family. Although they have retained a low-profile, rarely meddling in court matters, if someone were to cause trouble there, will that powerful woman let it go?<br/><br/>The royal family of Great Zhou is undeniably the most powerful family in the world.<br/><br/>Eighteen years ago, the Wu Family was very strong, and even though it had two Unleaking Realm practitioners, they were exterminated when called for.<br/><br/>The middle-aged man continued, “Coincidentally, the Minister will celebrate his sixtieth birthday in ten days. All the families in Divine City will receive invitations. You can use the occasion to infiltrate.”<br/><br/>Guo Taiping gripped his sword tightly and said, “Let’s figure out how to proceed.”<br/><br/>He was determined to get his hands on the sword of the Human Emperor, no matter what, even if it meant offending the Empress.<br/><br/>At the back courtyard of Tianxin Martial Arts Hall, Gu Yang was discussing the “Duan Yue Knife Technique” with Cheng Tianxin.<br/><br/>“Brother Cheng, if I’m not wrong, this saber technique is a simplified version derived from the ‘God Destroyer Nine Styles’, specifically the Break Mountain Style.”<br/><br/>“Indeed, back then, I only acquired a fragment of a technique and pondered over it for a long time. From it I understood the ‘Duan Yue Knife Technique’. Unfortunately, up to now, I have not been able to restore this technique, which is quite disappointing.”<br/><br/>In two days, the two of them had already grown to feel like old acquaintances, each possessing a sense of wishing to have met earlier. Neither of them were the kind to stand on ceremony, so their addresses to each other had become quite casual.<br/><br/>“This saber technique is best learned gradually, starting from the first move, which is the Hidden Knife Style…”<br/><br/>Gu Yang did not withhold any information and prepared to directly pass on the first of the “God Destroyer Nine Styles” to Cheng Tianxin.<br/><br/>“Wait”<br/><br/>Cheng Tianxin interrupted him, saying with a serious face, “No reward without merit…”<br/><br/>“Brother Cheng!”<br/><br/>Gu Yang spoke with great solemnity, “This saber technique is not to be given to you. The martial arts resources in this world, the top-notch methods and skills, are all monopolized by the great sects and clans. Ordinary people have no chance of advancing. Only you, who are not confined by the views of Sects and Clans, are able to accept many disciples and spread the knowledge you have accumulated.”<br/><br/>“I have long been used to living freely and idly, I do not wish to mislead disciples. Entrusting you with this saber technique is my way of doing my part.”<br/><br/>Cheng Tianxin was taken aback. He did not expect him to say such things, and in the end, he did not say anything else but respectfully saluted him.<br/><br/>In the following few days, Gu Yang transmitted all of the “God Destroyer Nine Styles” to Cheng Tianxin, in addition to that, he also passed on the Pre-celestial Mysterious Origin Technique, which is an advanced version of the “Xuan Yuan Method”.<br/><br/>With this technique, Cheng Tianxin might have the chance to break through to the Divine Power Realm.<br/><br/>After completing the transmission of the techniques, Gu Yang prepared to leave.<br/><br/>Who knows, after listening to the “Pre-celestial Mysterious Origin Technique”, Cheng Tianxin suddenly sat down cross-legged and started practicing right away. From this posture, he seems to be preparing to break through to First Rank.<br/><br/>He has accumulated enough experience, the only thing he was missing was an appropriate technique.<br/><br/>It can’t be helped, this old Cheng has a bit of stubbornness, refusing even a saber technique that was offered on a silver platter.<br/><br/>Of course, it is because of this character, that he enjoys such a large reputation today.<br/><br/>Gu Yang stepped out of the courtyard and closed the door. He saw the Xiahou siblings standing at a distance, want to come over but dare not approach.<br/><br/>As he was about to wave his hand to beckon them over, a figure sprinted over with a basket in her hand and asked, “Brother Gu, where’s my father?”<br/><br/>It was Cheng Qingyu, the little girl, blinking her big eyes at him.<br/><br/>Gu Yang corrected her, “You should call me Uncle Gu.”<br/><br/>Cheng Qingyu lifted up her head and said, “No, don’t think I don’t know, you’re only a few years older than me. Don’t try to take advantage of me.”<br/><br/>Gu Yang did not continue arguing with her and asked, “Where did you learn this body technique from?”<br/><br/>This little girl’s cultivation level is barely Fifth Grade, but her body technique is exceptionally extraordinary, incredibly fast. It feels even more advanced than his “Transforming Shadows”.<br/><br/>“Elder Sister Su taught me.”<br/><br/>“Who’s Elder Sister Su?”<br/><br/>“Her house is right behind ours, separated by just one wall. I used to climb over the wall to play with Elder Sister Su when I was little,” she replied.<br/><br/>Gu Yang pondered for a while but still couldn’t think of a well-known young woman surnamed Su.<br/><br/>It can only be said that Divine City is a place full of hidden dragons and crouching tigers, where experts are everywhere.<br/><br/>At that moment, Cheng Xue walked in from the outside, “Mr. Gu, emissaries from the residence of the Emperor’s Father-in-law have just delivered an invitation, asking you to attend his sixtieth birthday celebration five days from now,” she said.<br/><br/>Having said that, she handed over a gilt invitation card.<br/><br/>“Emperor’s Father-in-law’s residence?”<br/><br/>Gu Yang took it, read over it, and fell into contemplation.<br/><br/>The Emperor’s Father-in-law is the Emperor’s wife’s father. It seems they are looking for an excuse, trying to draw me over to their side through this event.<br/><br/>Cheng Xue said, “The Emperor’s Father-in-law loves lively events. Every time he celebrates his birthday, he will invite families from all over Divine City, and it should be the same this year.”<br/><br/>So, that’s how it is.<br/><br/>“Then please convey to the one who brought this message that, five days later, I shall certainly attend the celebration.”<br/><br/>Gu Yang is more inclined to join the Queen’s faction for two reasons. Firstly, she is quite generous and secondly, and most importantly, she is the winner.<br/><br/>In the simulation, thirty years later, at the time of the invasion by Star Luo Sect, she still held power in her hands.<br/><br/>This is enough to prove that in the court struggle, no one can defeat her.<br/><br/>He is not in a hurry to declare his stance now, as it is to raise his value. If he were to agree too easily, how would he negotiate terms?<br/><br/>At the very least, a demand of ten million silver might be a start.<br/><br/>It depends on whether this consistently generous Empress is willing to part with that sum.<br/><br/>After Cheng Xue had left, Cheng Qingyu suddenly pulled at his sleeve and said, “Do you know where the Emperor’s Father-in-law’s residence is?”<br/><br/>“Where?”<br/><br/>“It’s Elder Sister Su’s home.”<br/><br/>A stir raised within Gu Yang’s heart, “The Elder Sister Su you referred to is?”<br/><br/>“Of course, she’s the daughter of the Emperor’s Father-in-law. I’ve heard the servants in the Emperor’s Father-in-law’s residence all call her the Second Young Lady. Guess who’s the Eldest Young Lady?”<br/><br/>Gu Yang saw her conceited expression, just like a little sister, which softened his smile a bit and he asked, “Who?”<br/><br/>“You’re so dumb, of course, it’s our present Queen!”<br/><br/>PS: Second update, seeking monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}