{"id": 174, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14343920.html", "title": "Chapter 174 - Chapter 174 174 The First Seal", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 174 - Chapter 174 174 The First Seal</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 174 174 The First Seal<br/><br/>Translator: 549690339<br/><br/>[You were bound and brought back to Divine City, confined in the deepest level of the sky prison, charged with resisting the emperor’s order.]<br/><br/>[At the deepest level of the sky prison, strong ancient Prohibitions are in place which seal off the True Essence of martial practitioners. Relying on your formidable physical strength, you become the dominating power within the prison. You meet several remarkable figures and unexpectedly obtain another prince’s seal of the Xia Dynasty from one of the prison guards.]<br/><br/>[From the seal, you acquired the “Divine Ape Technique” from the Nine Heavens Divine Method.]<br/><br/>[Five years later, you finally mastered the Divine Ape Technique, and your power greatly increased.]<br/><br/>[In the next year, a newcomer arrives at the sky prison, the Dean of the Martial Arts Academy.]<br/><br/>[Three years later, another divine-level powerful being in the prison finds you to discuss the details of a prison break. You decide to join them. Six months later, you and a few other divine-level prisoners join forces to tunnel through one of the walls, creating an exit.]<br/><br/>[A terrifying aura then emerges from the hole, causing it to expand. A colossal white claw reaches through, tears the hole wider, and a monstrous mouth appears, swallowing all present. You die at the age of thirty-one.]<br/><br/>After reading all this, Gu Yang feels much enlightened.<br/><br/>Just because he refused the queen’s decree of marriage, they became so hostile as to confine him to the deepest level of the sky prison for eleven years straight.<br/><br/>This is undeniably tyrannical.<br/><br/>The saying ‘Serving a ruler is perilous like serving a tiger’ definitely rings true in his case.<br/><br/>“Why did I refuse it?”<br/><br/>Gu Yang took a moment to carefully consider.<br/><br/>In a simulation, unless one knows the plot in advance and decides how to act, it is impossible to control how emergent events will be dealt with.<br/><br/>But still, his actions in the simulation reflect his own motivations.<br/><br/>The guess is quite straightforward. His original plan was to keep a safe distance from the queen during this simulation and be ready to leave at any time, even if it means being captured by someone from a sacred land and forced into harsh cultivation. At least, then he could live longer.<br/><br/>He must have refused the marriage for the same reason. If he were to wed the queen’s sister and then run away, that would be quite irresponsible.<br/><br/>Had he known this in advance, he would rather have accepted the marriage.<br/><br/>After all, it’s just a simulation. It doesn’t make a difference who he marries.<br/><br/>Alas, his life ended more tragically even before he could turn thirty-two.<br/><br/>What on earth had they unleashed from beneath the sky prison? A monstrous mouth that swallowed several divine-level practitioners in one gulp.<br/><br/>This Divine City is too dangerous. Not only does it have a passage to the world of the hollow heavens, but it also has such horrific beasts lurking beneath the sky prison.<br/><br/>[After the simulation ends, you can retain only one of the following.]<br/><br/>[One, your Martial Arts Realm when you were thirty-one.]<br/><br/>[Two, your martial arts experience when you were thirty-one.]<br/><br/>[Three, your wisdom of life when you were thirty-one.]<br/><br/>“I choose the first option.”<br/><br/>Suddenly, a wild and unruly will, as forceful as a towering golden ape, materialized in Gu Yang’s mind.<br/><br/>Following this, an explosive surge of strength erupted within him, causing his body to expand rapidly and tear through his attire. He transformed into a giant over three meters tall.<br/><br/>“Divine Ape Technique” from the “Nine Heavens Divine Method”!<br/><br/>At the same time, his True Essence started to increase rapidly.<br/><br/>The progress of the second technique, “Divine Phoenix Manual”, also advanced a notch.<br/><br/>Opening his eyes, Gu Yang managed to suppress the savagery that had briefly overwhelmed him and returned to his original form. He looked down and found his skin had become glossy smooth, leaving him somewhat speechless.<br/><br/>No matter, no one saw him.<br/><br/>A wave of excitement flashed across his face. His physical body had ascended to new heights after successfully practicing the first level of the “Divine Ape Technique”.<br/><br/>As expected, there are nine parts in total to the “Nine Heavens Divine Method”, and practicing them all concurrently results in a cumulative strengthening effect on the physical body.<br/><br/>Now that he had mastered the Divine Ape Technique, his physical strength had probably surpassed that of a first-tier Golden Body practitioner.<br/><br/>What level of strength could he reach if he mastered all nine techniques?<br/><br/>Gu Yang looked forward to the future, deciding to keep an eye out to collect as many of these seals as possible.<br/><br/>The divine ability bestowed by mastering the Divine Ape Technique is a surging strength. Just reaching the first level unlocked a power rivalling a Golden Body’s divine strength.<br/><br/>“My mastering the Divine Ape Technique proves that the seal contains a drop of Divine Ape’s Essence Blood. And I guess that’s probably the only drop it has. Once it’s used, it’s gone.”<br/><br/>Gu Yang took out the seal from King Qi, guessing that it must contain a drop of the Divine Phoenix’s Essence Blood as well.<br/><br/>Thinking of this, a satisfied smile emerged on his face.<br/><br/>The system’s value was truly demonstrated in this simulation. Both times, he obtained the seal’s heritage and Essence Blood during the simulation.<br/><br/>This suggests that in reality, the Essence Blood should still be present within the seal in his hand and the one held by the prison guard.<br/><br/>Gu Yang could potentially utilize the simulation to constantly acquire the Divine Phoenix and Divine Ape’s Essence Blood and cultivate them to the greatest extent.<br/><br/>This simulation has already proven this method to be viable. He unknowingly absorbed the Essence Blood of the Divine Phoenix contained within the seal, advancing his progress in mastering the second level of the “Divine Phoenix Manual”. It would be entirely possible to accomplish this with a few more tries.<br/><br/>Let’s do it again!<br/><br/>Gu Yang opened the simulation system again and started a new round of simulation.<br/><br/>This time, he already knew the perfect strategy to clear the level, allowing for maximization of his cultivation results.<br/><br/>In Divine City, outside the Lord of the State’s private residence, there was a bustling scene with a stream of carriages and horses, and guests like clouds.<br/><br/>The servants of the Lord of the State’s residence were already proficient in handling such scenes and everything was organized.<br/><br/>Gu Yunfei, accompanied by his uncle, rode in a carriage to the Lord of the State’s residence.<br/><br/>He was attending on his father’s behalf to wish the Lord of the State a happy birthday.<br/><br/>“Our Gu Family and the Su Family both served under the emperor’s banner as generals in the past. Later, they were both bestowed the title of Marquis. A few hundred years ago, our two families were indeed once close.”<br/><br/>In the carriage, the uncle seemed a bit sentimental, “Later, the Su Family gradually declined while our Gu Family flourished day by day. We gradually lost contact. Unexpectedly, after several hundred years, the Su Family’s luck turned for the better and they produced such an amazing woman, heh, they had a sudden reversal of fortune. Now, we all have to flatter this ignorant and distracted Lord of the State.”<br/><br/>The tone of his words expressed his disdain for the Lord of the State.<br/><br/>Gu Yunfei naturally knew about this history. The rise of the Su family was an event that happened just a decade ago.<br/><br/>Ten years ago, who knew who Su Jingyao was? Neither literate nor martial, in Divine City, he was just an average joe.<br/><br/>Now, everyone in Divine City is competing to visit the Su family residence to wish this Fifth Grade elderly martial artist a happy birthday.<br/><br/>All this was because he has a good daughter.<br/><br/>Gu Yunfei thought of the Empress and felt a little apprehensive.<br/><br/>He has heard that when this woman first entered the palace as a common court lady, she quickly captivated the Emperor and made him go against public opinion to make her the Empress. It could be said that she rose to the top in a single step.<br/><br/>Before long, the Emperor fell seriously ill and was bedridden. All the imperial decrees were issued by her, which drew opposition from the court ministers.<br/><br/>Later, this woman demonstrated her ability to manipulate situations at will. She first established an internal guard, used a treason case as a starting point, and sent all those who opposed her to prison, thoroughly cleansing the court.<br/><br/>At that time, no one could have imagined that this woman’s methods could be so ruthless.<br/><br/>After a few years of purging, she had grasped real power, and everyone in the court had become her people.<br/><br/>Nowadays, the only one who could contend with her was Princess Chang, who was of royal blood.<br/><br/>Before long, the carriage stopped.<br/><br/>Gu Yunfei alighted from the carriage and looked at the luxurious mansion ahead. This place was originally a royal garden that was given to the Lord of the State by the Empress, who is his daughter.<br/><br/>In the whole Divine City, there are very few residences of this caliber. The rest were either inhabited by princes or other Lords of the State.<br/><br/>Su Jingyao, a Fifth Grade martial artist who didn’t even originally have an official rank, what capabilities did he have to live here?<br/><br/>Like Gu Yunfei’s clan uncle, there were many individuals, families, and larger clans who looked down on Su Jingyao.<br/><br/>In their eyes, the Su Family was nothing more than a nouveau riche. If it weren’t for the fact that they had produced an empress, no one would have given them a second look.<br/><br/>However, no matter how much they disdained the Su Family in their hearts, they would never show it outwardly.<br/><br/>No one wanted to offend that woman.<br/><br/>After Gu Yunfei and his clan uncle entered the gates, he suddenly thought, “That person is also in Divine City, I wonder if he will show up today.”<br/><br/>Just as he was pondering this, he heard an announcement from outside the gate, “The eldest son of the Guo family is here to wish you a Happy Birthday.”<br/><br/>He found it strange. Guo Taiping actually came?<br/><br/>The relationships between the nine families and the royal family were delicate. Almost none of them held official posts in the court. According to logic, a person like Guo Taiping shouldn’t need to curry favor with the Su Family.<br/><br/>Soon, there was another announcement, “The eldest son of Gao Family has arrived to wish you a Happy Birthday!”<br/><br/>Gu Yunfei was even more puzzled. The Gao Family was also one of the nine major families of the realm.<br/><br/>Next, another announcement rang out, “The chief disciple from the Academy has come to wish you a Happy Birthday!”<br/><br/>This time, Gu Yunfei was taken aback, “What, she actually came too?”<br/><br/>The chief disciple of the Academy, Ye Lingbo, who was ranked third on the Celestial Talent Ranking, was known for her extraordinary talent and stunning beauty. She was the youngest chief disciple in the history of the Academy. Furthermore, there was a rumor that she was a reincarnation of an ancient, powerful entity.<br/><br/>What on earth was happening today?<br/><br/>Even if Gu Yunfei was slow, he could tell that today was somewhat out of the ordinary.<br/><br/>Suddenly, the announcer’s voice from outside the gate turned extremely excited, “The fifth prince has arrived to wish you a Happy Birthday.”<br/><br/>Gu Yunfei was startled, even the fifth prince had come.<br/><br/>You must know that as the Emperor’s health deteriorated, the relationship between the Empress and several princes became increasingly delicate. It was somewhat of an unspoken agreement that neither side would interfere with the other.<br/><br/>This was seriously too abnormal.<br/><br/>“The… The Princess Chang has arrived to wish you a Happy Birthday!”<br/><br/>Hiss<br/><br/>Gu Yunfei couldn’t help inhaling a breath of chilly air.<br/><br/>PS: Second update, asking for monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}