{"id": 176, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14343924.html", "title": "Chapter 176 - Chapter 176: Who Has More Patience", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 176 - Chapter 176: Who Has More Patience</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 176: Who Has More Patience<br/><br/>Translator: 549690339<br/><br/>When a spatial rift appeared in the sky, Guo Taiping was incredulously excited. The entrance to the Secret Realm was finally open.<br/><br/>It seemed that the treasure map was indeed genuine.<br/><br/>It was as if he could see the Sword of the Human Emperor waving at him.<br/><br/>But at that moment, more than a dozen formidable auras erupted nearby. They were undoubtedly from powerful entities in the Divine Power realm.<br/><br/>Damn it!<br/><br/>This completely took him by surprise. Inside the Duke’s mansion, there were actually more than a dozen entities in the Divine Power realm.<br/><br/>He was instantly alarmed. “Third uncle!”<br/><br/>The “Third Uncle” beside him didn’t wait for him to speak. With a swish, he rushed into the Secret Realm.<br/><br/>Guo Taiping was desperate to follow him, but the remaining rationality allowed him to suppress this impulse.<br/><br/>With so many entities in the Divine Power realm present, if he entered the Secret Realm, he would not only be unable to lend a helping hand but would also become a burden to his third uncle.<br/><br/>Just as he was thinking about this, more than a dozen figures closely followed his third uncle and flew into the entrance of the Secret Realm.<br/><br/>Gao Songwei of the Gao Family, Zhou Zongye of the Literary Academy, Hou Jiyuan of the Inner Guards, Gan Zilin of the Lord of the State’s mansion, Princess Chang…<br/><br/>Guo Taiping recognized several entities in the Divine Power realm at a glance. Among them were Gao Songwei and Zhou Zongye, both of whom were in the Mana realm.<br/><br/>His complexion turned pale at once.<br/><br/>His third uncle was only at the second level of the Golden Body. How could he contend with two entities in the Mana realm?<br/><br/>At this moment, he was somewhat regretful. He should have reported this to the ancestor earlier.<br/><br/>It wasn’t that the Guo Family didn’t have entities in the Mana realm. It was just that he had harbored some selfish desires, wanting to monopolize the Sword of the Human Emperor, so he only brought his closest third uncle along.<br/><br/>Who knew that the Gao Family and the Literary Academy would disregard Martial Arts and directly sent out the powerful entities in the Mana realm?<br/><br/>Guo Taiping had considered that the treasure map might be leaked, but he had not expected it to be so thoroughly leaked. These dozen-odd Divine Power entities almost all hailed from different forces.<br/><br/>By this time, he began to sense that something was amiss.<br/><br/>Logically speaking, anyone who got a treasure map would definitely think of monopolizing it. Why would they announce it widely and let so many people know about it?<br/><br/>Just as he was thinking about this, the entrance to the Secret Realm suddenly closed on its own and disappeared.<br/><br/>“How can this be?”<br/><br/>This unexpected change greatly surprised Guo Taiping. He had not instructed the entrance to close.<br/><br/>The methods to open and close the entrance to the Secret Realm were all recorded on that treasure map.<br/><br/>Just at this moment, a layer of black light appeared in the sky, enveloping the entire Duke’s mansion.<br/><br/>“Hahaha…”<br/><br/>A man in a black robe appeared, laughing wildly. “With a little bit of trickery from me, I eliminated seventeen Divine Power entities, fifteen Golden Bodies, and two Mana… Hahaha…”<br/><br/>The Red Venerate Sect!<br/><br/>The Mana realm!<br/><br/>For a moment, Guo Taiping felt as though he had fallen into an ice cave.<br/><br/>By now, how could he not understand that he had been tricked?<br/><br/>The so-called treasure of the Xia Dynasty, the Secret Realm hiding the Sword of the Human Emperor, they were all false. All of this was a scheme by the Red Venerate Sect, aimed at trapping and killing the Divine Power entities of the major forces.<br/><br/>His third uncle was likely in great danger this time.<br/><br/>In the sky, the man in the black robe said, “I am called Red Sun. Today, I have come to take your miserable lives.”<br/><br/>In front of him, a ball of crimson flame condensed, and a terrifying high temperature began to spread.<br/><br/>It was the “Red Flame Divine Skill”, one of the signature techniques of the Red Venerate Sect.<br/><br/>The man in the black robe was a powerful entity in the Mana realm. A full strike from him could reduce the entire Duke’s mansion to a flat ground.<br/><br/>Guo Taiping could feel the destructive power of the crimson flame, and a sense of despair rose in his heart.<br/><br/>He finally understood that the Red Venerate Sect had laid such a large trap, not only to kill a few Divine Power entities but also to wipe out all the high officials and nobles of the court.<br/><br/>Today was the 60th birthday of the Duke. Almost all the high officials were here, including the Empress and Princess Chang. If these people were all to die here, the Great Zhou government would likely collapse.<br/><br/>With the Red Venerate sect launching a rebellion in various places, the world would immediately be plunged into chaos.<br/><br/>Guo Taiping was extremely unwilling, “Could it be… I am going to die here today?”<br/><br/>Suddenly, two figures silently appeared behind the man in the black robe.<br/><br/>One of them held an ancient bronze candle holder, with only a short white candle left on it. A green flame was lit at the wick of the candle.<br/><br/>An eerie green light appeared on the man named Red Sun and immobilized him on the spot.<br/><br/>The other person held a spindle and stabbed it at the black light curtain.<br/><br/>This sudden change caught everyone off guard.<br/><br/>No one had expected that there would still be two powerful entities in the Divine Power realm present.<br/><br/>Guo Taiping instantly recognized the attire of these two men. They were from the palace and must be in charge of protecting the Empress.<br/><br/>Just as one of the palace experts was about to break open the light curtain, he suddenly dodged. With a hiss, a spray of blood spattered from his shoulder, and in the blood, the shape of a sword could be seen.<br/><br/>“The Invisibility Sword?”<br/><br/>Guo Taiping blurted out.<br/><br/>The owner of this sword is even more famous, the Shadowless Sword Saint. He is the earliest to be known as a sword saint among the ten contemporary sword saints, and he is also the oldest. This person has not appeared in the world for decades, and many people have believed that he has died.<br/><br/>Unexpectedly, the Invisibility Sword reappears today, and it is somehow mixed up with the Red Venerate Sect.<br/><br/>A man in white appeared, chuckled, and said, “Quick response.”<br/><br/>The wounded elite of the Imperial Household sternly said, “The successor of the Invisibility Sword?”<br/><br/>This person could not possibly be the Shadowless Sword Saint, otherwise, that one sword just now would have killed him without a doubt, and even the people present would have been slain by that sword.<br/><br/>The man in front of them only had the first level of the Golden Body cultivation.<br/><br/>During their conversation, a black shadow and a red shadow attacked the Imperial elite who held the bronze candleholder.<br/><br/>Almost at the same time, a white sword intent and a blue sword intent clashed with the shadows.<br/><br/>The use changes that happened continuously were bewildering as one after another strong man of the Divine Power realm appeared on the stage, and accidents occurred frequently. In the sky, six of the Divine Power realm strongmen were embroiled in a melee fight.<br/><br/>And two others were locked in a stalemate.<br/><br/>The emotions of the people below fluctuated dramatically.<br/><br/>Anyone with discerning eyes could see that the key to the current situation was on that elite of the Imperial Household who held the candleholder. It was him who used the abnormal treasure to pin down this Mana realm strongman, Red Sun.<br/><br/>Otherwise, all the people present would have long been corpses.<br/><br/>On their side, all four were just at the Golden Body level, even if combined, they could not stop Red Sun.<br/><br/>“Hehe, at last, do I have to be the one to do it?”<br/><br/>Accompanied by a hoarse voice, another figure in a black robe appeared.<br/><br/>This time, everyone in the Duke’s mansion felt a sinking feeling.<br/><br/>Another Divine Power realm strongman from the Red Venerate Sect.<br/><br/>They were done for.<br/><br/>Who could stop him?<br/><br/>Despair filled many people’s hearts.<br/><br/>“Gu Yang!”<br/><br/>Gu Yunfei suddenly thought of a name in his mind. If he were here, perhaps there would still be hope.<br/><br/>The question is, did he come at all?<br/><br/>“Aren’t you going to act yet? If the abnormality here is discovered by the palace, it will be too late.” One of them from the Red Venerate Sect urged.<br/><br/>The last to appear black-robed man sneered, “You don’t need to teach me what to do.”<br/><br/>Although he said so, he pulled out the saber from his hands. The whole saber was red, with a hint of evil. He lifted the saber and swung at the elite of the Imperial Household who held the candle holder.<br/><br/>“The Godslayer?”<br/><br/>Guo Taiping seeing the saber in the hand of the mysterious black-robed man, he exclaimed in surprise.<br/><br/>The Godslayer, it was an unparalleled divine weapon in the hands of Wu Da, the ancestor of the Wu Family. Coupled with his cultivation method “Heavenly Elemental God Slaying Art”, God knows how many men at the Divine Power realm died under his saber.<br/><br/>After Wu Da’s death, this Godslayer should have been in the royal family.<br/><br/>Who was this black-robed man anyway?<br/><br/>Not far away, behind a rockery.<br/><br/>Gu Yang was staring at the black-robed man in the sky with a strange familiar feeling.<br/><br/>It was not until the other side drawn his saber that he suddenly realized, “God Destroyer Nine Styles”!<br/><br/>The saber technique this person cultivated turned out to be “God Destroyer Nine Styles”.<br/><br/>“Who is this person? What does he have to do with Ling Ling?”<br/><br/>He was very curious, but he had no intention to make a move.<br/><br/>He was waiting.<br/><br/>He believed that someone was more anxious than he was.<br/><br/>Just as the Godslayer of the black-robed man in the sky was about to kill the Imperial Household elite, a red thread flew out and tightly bound the black-robed man.<br/><br/>“It turns out to be her!”<br/><br/>Gu Yang suddenly looked at a courtyard not far away, he was greatly surprised.\t\t\t\t\t\t</div>", "images": {}, "success": true}