{"id": 170, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14315151.html", "title": "Chapter 170 - Chapter 170 170 Cheng Tianxin", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 170 - Chapter 170 170 Cheng Tianxin</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 170 170 Cheng Tianxin<br/><br/>Translator: 549690339<br/><br/>In Tianxin Martial Arts Hall, the disciples followed their senior’s lead, practising the movements methodically, creating an atmosphere that seemed normal but was very different from usual.<br/><br/>The usually stern seniors appear absent-minded, failing to notice even if the disciples below performed poorly.<br/><br/>While those training continued to punch, they listened carefully to the noise from the gate.<br/><br/>The news that Guo Taiping, the sixth on the Pride List, was set to challenge the master of the hall had spread. Although they continued to train under the strict orders of their seniors, their minds were elsewhere.<br/><br/>Some were excited, looking forward to witnessing such a significant event. Duels between Second Grade fighters are rare even in Divine City.<br/><br/>Some were worried. Guo Taiping, a prodigy from a prestigious family, must be confident and prepared to challenge the master of the hall. But what if the master lost?<br/><br/>The many disciples at the training ground had various thoughts in mind.<br/><br/>Inside the Zhengxin Hall, the atmosphere was serious.<br/><br/>The three disciples of Cheng Tianxin were all present, their faces exceptionally solemn.<br/><br/>Having higher cultivation levels and broader experience, they were aware how formidable the disciples from prestigious families were, practicing supreme methods.<br/><br/>They could not compete with those of the same realm.<br/><br/>Moreover, the one to challenge this time was a prodigy like Guo Taiping.<br/><br/>Finally, the third disciple Cheng Xue could not sit still any longer. She abruptly stood up, walked to the door behind, and said to the inside, “Father, allow me to take this fight!”<br/><br/>The door creaked open, and an unremarkable middle-aged man walked out. His features were ordinary; he was in coarse clothes, rough hands and feet, and tanned skin. He looked just like a simple farmer.<br/><br/>This man was Cheng Tianxin, the master of the famous Tianxin Martial Arts Hall among the commoners.<br/><br/>He looked calm, confident without any anxiety despite the looming formidable adversary.<br/><br/>He shook his head, “You are no match for Guo Taiping.”<br/><br/>“But father…”<br/><br/>Even as the anxious Cheng Xue was about to continue, Cheng Tianxin patted her hand, saying, “What’s meant to happen will happen. Even if you beat Guo Taiping today, who will fight for me if Li Taiping or Zhang Taiping comes next time? Enough, no more arguments.”<br/><br/>Having said this, Cheng Tianxin, seeing his daughter absent, asked, “Where’s Qingyu? I have something to tell her.”<br/><br/>“She was here just now—Oh no!” Cheng Xue suddenly looked alarmed.<br/><br/>Cheng Tianxin’s face changed too. He knew his daughter too well; where else could she be if not here at this hour?<br/><br/>“Sir…we’ve arrived,”<br/><br/>The carriage stopped, and the coachman stuttered, fearing the powerful warrior sitting in the carriage, he had just watched Guo Taiping’s carriage disintegrate in thin air.<br/><br/>Gu Yang pushed open the carriage door and stepped out.<br/><br/>Tianxin Martial Arts Hall, deemed the top martial academy in the world, was located at the end of a remote street within a lower-class civilian area, all with low houses. The front of the hall was ordinary, just like a regular house.<br/><br/>Even the inscription on the plaque was merely decent without any sense of aesthetic.<br/><br/>As Gu Yang was examining the martial academy, suddenly, a figure appeared before him, pointing at him, asking, “Are you Guo Taiping?”<br/><br/>The figure was a girl, around twelve or thirteen, in a green dress, her eyes clear and teeth white. Now she looked stern and hostile.<br/><br/>Gu Yang anticipated her identity. He recalled from the simulation that Cheng Tianxin had a daughter, and she was very young.<br/><br/>Before he could respond, the girl asked rapidly, “Why are you challenging my dad? Does our Tianxin Martial Arts Hall have a grudge against you? My dad just wants to provide a path to learn martial arts for the poor. Can’t you noble disciples stand it? Do you insist on annihilating us?”<br/><br/>Gu Yang found it amusing. Cheng Tianxin’s daughter was so young and brash.<br/><br/>Thankfully she bumped into him instead of the ruthless Guo Taiping. Otherwise, she would be in danger.<br/><br/>“Silence!”<br/><br/>Along with the reprimand, a figure blocked the girl. It was a middle-aged man in coarse clothes, not tall but exuding a profound aura.<br/><br/>This must be the master of Tianxin Martial Arts Hall, Cheng Tianxin.<br/><br/>On first glance, Cheng Tianxin looked nothing like the character in Gu Yang’s imagination.<br/><br/>Upon closer inspection, it seemed fitting for Cheng Tianxin to appear this way.<br/><br/>Gu Yang, with a different perspective, noted his True Essence was pure white and decent in quantity, but remarkably pure.<br/><br/>Cheng Tianxin gave a slight bow, “Please forgive my ignorant daughter.”<br/><br/>His daughter behind him protested, “Dad, I didn’t say anything wrong.”<br/><br/>Just then, Cheng Xue arrived, standing by the girl’s side, pulling her to stop talking, but was shocked as she recognized the man before her, exclaiming, “Mr. Gu?”<br/><br/>“Mr. Gu?”<br/><br/>Cheng Tianxin had been puzzled; judging by this man’s demeanor, he didn’t seem like a disciple of a prestigious family. How could Guo Taiping ride in such a plain carriage?<br/><br/>Cheng Xue excitedly asserted, “It’s Gu Yang, Mr. Gu.”<br/><br/>“What?”<br/><br/>“What?”<br/><br/>Father and daughter, Cheng Tianxin, exclaimed in unison.<br/><br/>In recent years, no, for the past decade, Gu Yang has arguably been the most talked-about figure.<br/><br/>Ever since he ranked on the Hidden Dragon List a few months ago, discussions about him have become increasingly prevalent.<br/><br/>His deeds are extraordinary, one after another, continuously astonishing everyone.<br/><br/>Not too long ago, rumors spread about Gu Yang beating the Lin family’s Divine Power-level fighter in Jiangzhou City, propelling his reputation to its peak.<br/><br/>His experiences are unbelievable, bordering on the mythical.<br/><br/>These incidents are so extraordinary that you can’t help but believe them. Among them, the ranking released by Red Mansion, it is impossible to be false.<br/><br/>The credibility established by Red Mansion over a thousand years has deeply rooted in people’s hearts.<br/><br/>Now, this legendary figure had actually arrived at the Tianxin Martial Arts Hall.<br/><br/>Cheng Tianxin hurriedly apologized, “I didn’t recognize you, Mr. Gu. I apologize for my daughter’s rudeness. I hope you won’t take offense.”<br/><br/>Gu Yang smiled and said, “Master Cheng, no need for formalities. Your daughter is lively and straightforward, I find her very adorable.”<br/><br/>By now, Cheng Qingyu had abandoned her previous insolence, realizing she had mistaken the person, she hid behind her father with some embarrassment on her face.<br/><br/>“Mr. Gu, you didn’t mention your visit to Divine City beforehand.”<br/><br/>Cheng Xue, who had always been grateful to her savior, said.<br/><br/>Gu Yang laughed, “Well, I’m here now. As I don’t know anyone in Divine City, I hope to stay a few days here.”<br/><br/>Cheng Xue was overjoyed and couldn’t wait to agree. With Gu Yang here, it would certainly deter Guo Taiping.<br/><br/>However, she held back and looked towards her adoptive father.<br/><br/>Cheng Tianxin sighed hesitantly, “I’m afraid we might have some inconveniences today. How about this, Xue, why don’t you let Mr. Gu stay at your place for a few days?”<br/><br/>Cheng Xue inwardly felt bitter, she knew that her adoptive father would not let Gu Yang stay at the martial arts hall at a time like this.<br/><br/>“Oh? What does Master Cheng have going on today?” Gu Yang asked.<br/><br/>Peeking out from behind her father, Cheng Qingyu blurted, “A jerk is coming to challenge our martial arts hall…”<br/><br/>“Qingyu!”<br/><br/>Before she could finish her sentence, she was silenced by a sharp look from her father. She stuck her tongue out in response, daring not to say more.<br/><br/>“Is the one who’s coming to challenge the hall Guo Taiping?” Gu Yang asked.<br/><br/>Cheng Tianxin replied, “Yes, it is.”<br/><br/>Gu Yang laughed, “I’m afraid he won’t make it today.”<br/><br/>“Why is that?” Cheng Tianxin and the rest were puzzled.<br/><br/>Before Gu Yang could say anything, Feng Tianci, who was standing behind him, couldn’t help but say, “On our way here, we blocked Guo Taiping’s path. He tried to act unruly until Brother Gu taught him a lesson. I reckon he’s too ashamed to show up.”<br/><br/>After hearing this, Cheng Tianxin and the others were stunned.<br/><br/>Both Cheng Xue and Cheng Qingyu were overjoyed.<br/><br/>Cheng Tianxin’s expression, however, was somewhat complicated. Looking at Gu Yang, he could only accept this favor, “Mr. Gu, please come in.”<br/><br/>Upon entering the gate, there was a large martial arts practice field with dozens of disciples divided into small groups, practicing their martial arts.<br/><br/>Seeing the two carriages moving in, these disciples were intrigued.<br/><br/>After waiting for a long time, Guo Taiping hadn’t arrived, but now these few people had. They couldn’t help but wonder who these new arrivals were.<br/><br/>By the time they were eating lunch, someone with reliable information found out that the guests who had visited the martial academy in the morning were led by none other than Gu Yang.<br/><br/>This created an even bigger stir than when they had heard that Guo Taiping was going to challenge Master Cheng.<br/><br/>This was Gu Yang!<br/><br/>The man who had defeated the top-ranked pride of the First Rank list, alleged to have overcome the Divine Power Realm, an unparalleled figure throughout history.<br/><br/>In terms of reputation, Guo Taiping wasn’t even worthy of being his shoeshiner.<br/><br/>So Gu Yang had come to Tianxin Martial Arts Hall. At this point, all the disciples at the academy felt an immense pride.<br/><br/>No one was in the mood to practice martial arts anymore, everyone wanted to meet Gu Yang.<br/><br/>Many people were regretting not having taken a closer look when the carriages passed the martial arts field in the morning, thus missing the opportunity to see the face of this unparalleled genius.<br/><br/>Later, they found out that Guo Taiping had bumped into Gu Yang on the way and was severely injured by Gu Yang with one palm strike.<br/><br/>No wonder Guo Taiping hadn’t shown up yet, so that’s what happened.<br/><br/>So much for being supreme, he’s just plain foolish—did he consider Divine City just any other place? He wanted to act tyrannically, well, he’s now kicked an iron plate. Serves him right!<br/><br/>PS: The first update, seeking monthly vote.\t\t\t\t\t\t</div>", "images": {}, "success": true}