{"id": 175, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14343922.html", "title": "Chapter 175 - Chapter 175: 175 I’M Here To Take Your Lives", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 175 - Chapter 175: 175 I’M Here To Take Your Lives</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 175: 175 I’m here to take your lives<br/><br/>Translator: 549690339<br/><br/>Princess Chang’s arrival not only stunned Gu Yunfei but also shocked the entire Duke’s mansion when the news spread.<br/><br/>Ever since five years ago, when the Princess was anointed by the Emperor as master of the Long Autumn Palace, she had been entitled to establish her residence and office, rapidly gathering a group of talents around her.<br/><br/>The Queen’s way of conducting affairs was bound to offend many. Therefore, when Princess Chang set up her office, all of the Queen’s opponents rushed to support her.<br/><br/>As the Emperor’s younger sister, Princess Chang was clearly presented by the royal family to compete against the Queen, serving to balance her power.<br/><br/>The relationship between these two women is highly tense, even if it’s not exactly bitter enemies.<br/><br/>In Divine City, even three-year-old children knew that Princess Chang and the Queen were mortal enemies, who would either engage in verbal quarrels or spitefully insult each other when they met.<br/><br/>Now, surprisingly, Princess Chang had arrived at the Duke’s mansion on his birthday anniversary.<br/><br/>The first reaction of everyone upon hearing this news was – could she be here to provoke the Queen?<br/><br/>So far, the struggle between Princess Chang and the Queen has been on a latent scale.<br/><br/>Clear-headed people could see that the Queen was very restrained, knowing that it was hard to completely overthrow Princess Chang. She refrained from any minor tricks and strived to maintain her grace and dignity.<br/><br/>The same was the case with Princess Chang. She realized she couldn’t shake the Queen’s position any time soon, so she refrained from any rash actions, while attracting more support and waiting for an opportunity.<br/><br/>The saying goes, “A king doesn’t see another king.”<br/><br/>Now that Princess Chang had arrived at the Queen’s father’s mansion, claiming she was here to celebrate his birthday would naturally meet disbelief.<br/><br/>The arrival of this heavyweight guest immediately turned the entire Duke’s mansion into a turmoil.<br/><br/>The birthday star, Duke Su Jingyao, had to personally greet her with his staff.<br/><br/>Despite being the Emperor’s father-in-law and considered a senior, he still had to kneel before Princess Chang. According to the hierarchy of heaven, Earth, prince, parents, and teacher, the prince comes first, and Princess Chang represented the prince’s authority.<br/><br/>While everyone was stunned by Princess Chang’s arrival, Gu Yang arrived at the Duke’s mansion. He first returned to the Tianxin Martial Arts Hall to change into a new outfit.<br/><br/>The servants at the Duke’s mansion were so surprised that they forgot to announce his arrival.<br/><br/>As soon as Gu Yang entered, he heard that Princess Chang had come and was somewhat surprised, “Is she here for that treasure, too?”<br/><br/>He suddenly remembered that in several simulations, Princess Chang basically did not show up.<br/><br/>Could it be that she ultimately got trapped in that secret realm?<br/><br/>As Gu Yang pondered, he gripped the seal of King Qi in his hand.<br/><br/>This seal was a sort like a magic treasure. He had learned the method of refining it during the simulation and had since refined it.<br/><br/>Now, through this seal, he sensed a prohibition. It was the same prohibition mentioned in a previous simulation.<br/><br/>It should be noted that the Xia Dynasty had been extinct for two thousand years, and this King Qi mansion had undergone countless renovations. Still, a prohibition remained.<br/><br/>Maybe there’s a treasure hidden inside.<br/><br/>Gu Yang walked towards the prohibition.<br/><br/>Whether it was the visiting guests or the servants of the mansion, no one recognized him. He moved around freely, and no one paid him any attention.<br/><br/>Soon, he reached the backyard where the fewer people were.<br/><br/>Ordinary guests wouldn’t come to the backyard, and the servants were all helping out in the front yard. This made things a lot easier.<br/><br/>As he was approaching the courtyard where the prohibition was, he suddenly heard a familiar voice, “Elder Sister Su, why haven’t you gotten married yet?”<br/><br/>Gu Yang’s brows furrowed, “She’s here too.”<br/><br/>The speaker was Cheng Tianxin’s daughter, Cheng Qingyu.<br/><br/>He had instructed her to stay at the martial academy and not to go anywhere, but she didn’t listen at all.<br/><br/>This rebellious girl with too many ideas was really worrying.<br/><br/>Then, another young woman’s voice came, “Why are you suddenly interested in this? Are you in your spring? Tell me, who’s the guy you’re interested in?”<br/><br/>“I’m not telling you…”<br/><br/>Then, there was a burst of laughter and frolicking.<br/><br/>This woman must be the Queen’s sister.<br/><br/>Gu Yang recalled a simulation when the Queen insisted on arranging a marriage between him and this sister. On second thought, it was better to keep his distance.<br/><br/>As he was about to leave, he felt someone approaching.<br/><br/>With a flash, he hid behind a nearby rockery.<br/><br/>On the other side, the two playful women in the courtyard suddenly quieted down.<br/><br/>After a few breaths, two figures appeared in the courtyard. One of them whispered in a low voice, “Uncle San, I think this is the place.”<br/><br/>Gu Yang didn’t need to look up from behind the rockery to recognize this familiar face, Guo Taiping.<br/><br/>The person next to Guo Taiping was a Divine Power cultivator. Although he hid his cultivation level, Gu Yang could clearly see from his perspective how powerful his body was, far stronger than that of Lin Yimo from the Lin Family.<br/><br/>This was a formidable practitioner with a Golden Body Level Two.<br/><br/>Gu Yang was somewhat surprised, “This guy has a Golden Body Level Two practitioner following him. Even after I beat him up, he still held his anger. He’s quite unusual.”<br/><br/>A few days ago, if he had faced this Golden Body Level Two practitioner, he would likely not have won.<br/><br/>Absolute Golden Body Level Two, his mortal body was almost as invincible as the diamond, even with the sophistication of Heavenly Inquiry Nine Knives, with his True Essence, it was difficult to harm the opponent in the slightest way.<br/><br/>Guo Taiping was hiding his strength, clearly all for this treasure; or rather, for the rumored sword of the Human Emperor inside the treasure.<br/><br/>Gu Yang wondered what expression he would have when he found out later that the so-called “Sword of the Human Emperor” was just a conspiracy.<br/><br/>He was somewhat intolerant in his heart.<br/><br/>“Third Uncle, we need to hurry, things are too unusual today; Gao Minghai, the fifth prince, Ye Lingbo, even Princess Chang came. Their goal might be the same as ours.”<br/><br/>A gloom hung on Guo Taiping’s face. He had invested significant effort to find this place. While he is on the brink of success, suddenly so many competitors appeared.<br/><br/>The Gao family, the fifth prince, the academy, Princess Chang…<br/><br/>There wasn’t a single one here easy to mess with.<br/><br/>Especially Princess Chang—this being Divine City—the royal family’s stronghold, could call in several Divine Power Realm experts at any time. If she was also here for the Sword of the Human Emperor, he would have no chance at all.<br/><br/>That “Third Uncle” said, “There are two people over there.”<br/><br/>“Never mind them. Let’s start now,” Guo Taiping urged anxiously.<br/><br/>The Third Uncle did not hide his cultivation any longer; an unparalleled power surged into the sky, and he shouted, “Open the door!”<br/><br/>A crack unexpectedly appeared in the sky.<br/><br/>“It’s open!”<br/><br/>Guo Taiping was overjoyed.<br/><br/>When that Divine Power expert of the Guo Family exploded with energy, everyone in the Duke’s mansion, whether host or guest, was shocked.<br/><br/>There was actually a Divine Power Realm expert taking action in the Duke’s mansion.<br/><br/>“What happened?”<br/><br/>Gu Yunfei, who was chatting leisurely with a disciple from a noble family, had his expression change dramatically. As he hastily looked over, he was even more taken aback.<br/><br/>He saw a crack in the sky that was gradually expanding into a gateway, indicating another world over there.<br/><br/>It was a Secret Realm!<br/><br/>At that moment, dozens of silhouettes simultaneously flew up towards the gateway in the sky.<br/><br/>Space Control Divine Power!<br/><br/>Divine Power Realm!<br/><br/>As many as dozens of Divine Power Realm experts.<br/><br/>Gu Yunfei felt a shiver run down his spine.<br/><br/>Normally, it would be hard to even meet one Divine Power Realm expert, but today, in Duke’s mansion, more than a dozen had appeared at once.<br/><br/>What kind of treasures could be in that Secret Realm that could attract so many Divine Power Realm experts?<br/><br/>As many as dozens, perhaps almost half of the Divine Power Realm experts in Divine City had come.<br/><br/>Gu Yunfei even saw Princess Chang among them.<br/><br/>As expected, he knew that Princess Chang didn’t visit the Duke’s mansion for no reason, she must have had a scheme.<br/><br/>Gu Yunfei realized that there must be some earth-shattering treasure in that Secret Realm to move the hearts of so many Divine Power Realm experts.<br/><br/>What if these Divine Power Realm experts quarrel over the treasure and start fighting..<br/><br/>Thinking about this, he couldn’t sit still and prepared to flee.<br/><br/>In the blink of an eye, those dozens of Divine Power Realm experts had already flown into the Secret Realm.<br/><br/>Suddenly, the entrance to the Secret Realm closed abruptly, and the crack disappeared completely.<br/><br/>“What’s going on?”<br/><br/>Just as Gu Yunfei was shocked, he saw the sky suddenly darken.<br/><br/>“Hahaha….”<br/><br/>A burst of laughter rang out, and a man in a black robe appeared in the sky, triumphantly saying, “With a little bit of cunning, I have wiped out seventeen Divine Power Realm experts, fifteen Golden Body experts, and two Mana users… Hahaha….”<br/><br/>Ma… Mana realm?<br/><br/>Gu Yunfei realized that the other party used Mana to seal the entire Duke’s mansion and couldn’t help but feel a dropping sensation in his heart.<br/><br/>Upon hearing the other party’s words, he was even more shocked.<br/><br/>Those dozens of Divine Power Realm experts were actually ambushed?<br/><br/>“No good. It’s the Red Venerate Cult…”<br/><br/>Suddenly, a cry of surprise rang out from the crowd, someone had recognized the strength of the man in the sky.<br/><br/>“I am Red Sun. Today, I have come to take all your wretched lives!”<br/><br/>PS: The third update asks for monthly ticket.\t\t\t\t\t\t</div>", "images": {}, "success": true}