{"id": 179, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15131959.html", "title": "Chapter 179 - Chapter 179 Has It Broken Through?", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 179 - Chapter 179 Has It Broken Through?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 179 Has it broken through?<br/><br/>Translator: 549690339<br/><br/>Skyfire Annihilation!<br/><br/>In the sky, a sea of fire descended, reducing a soul monster of the first tier Golden Body realm into ashes while it wailed in sorrow.<br/><br/>Su Ningyan landed slowly from the sky, with a somewhat solemn expression on her face.<br/><br/>The soul monsters at the first level actually possess the strength of the first level of Golden Body realm.<br/><br/>This was utterly beyond her anticipation.<br/><br/>Originally, she had thought that after the one from the Literature Academy seriously injured Chiming Sky, its control over the Demon Suppression Tower would decrease and it would not exert too much power here.<br/><br/>Who would have thought that the first level was guarded by a soul monster of the first tier Golden Body realm.<br/><br/>The so-called soul monsters are peculiar products of the Chiming Sky.<br/><br/>For a warrior, Chiming Sky is undoubtedly a demon cave. Once one’s Original Spirit is corrupted by the demon aura of Chiming Sky, they will turn into a soul monster without consciousness, completely controlled by the entity of Chiming Sky.<br/><br/>The soul monster she just annihilated was once a warrior of the first tier Golden Body realm.<br/><br/>Luckily, this Demon Suppression Tower is the national treasure of the human race, specifically designed to suppress demonic beasts. Humans inside it will not be suppressed. If something else replaced it, the beast’s strength would be greatly suppressed. Defeating a Soul Monster would become even more challenging.<br/><br/>The one from Chiming Sky wants to completely refine the Demon Suppression Tower. It will not be something that can be accomplished in just over a hundred years.<br/><br/>Su Ningyan felt that she might have been misguided this time.<br/><br/>She was willing to take the risk, seizing this once-in-a-millennium opportunity, and actively followed Gu Yang into the Demon Suppression Tower. Naturally, she had great plans.<br/><br/>However, meeting a soul monster of the first tier Golden Body realm at the first level, she anticipated that the soul monsters guarding the upper levels would only become stronger.<br/><br/>Based on her own strength, it might be very difficult to break out of the ninth level of the Demon Suppression Tower.<br/><br/>“Even if I join forces with that guy, I’m afraid it’s not likely.”<br/><br/>Su Ningyan had a rough estimate of his strength from Gu Yang’s sword moves earlier. It seemed slightly inferior to hers. Combined, they probably still couldn’t break through the tower.<br/><br/>Even if she loses hope about this journey, she is still unwilling to give up; since she’s already here, she naturally wants to give it her best shot.<br/><br/>She entered the magic array in the middle. As soon as she stepped in, she felt something and suddenly turned to look back.<br/><br/>There was a flash of black light.<br/><br/>She had arrived at the second level, where the surroundings were still as grey as before, giving a very oppressive feeling.<br/><br/>“Just now, was that…?”<br/><br/>There was some astonishment in Su Ningyan’s eyes, but unfortunately, in the Demon Suppression Tower, one can only ascend, not descend. After reaching the second level, one can no longer return to the first.<br/><br/>She suppressed the doubts in her heart and walked forward without any delay towards the towering mountain in the distance.<br/><br/>[Recharge failed!]<br/><br/>As Gu Yang was approaching the mountain, he found some gold and silver and wanted to recharge, but this prompt popped up.<br/><br/>What’s going on?<br/><br/>He felt a sudden unease in his heart, a sense of impending doom.<br/><br/>With a slight exertion of force in his hand, he left a fingerprint on the silver ingot, confirming that it was indeed silver.<br/><br/>He opened the system and saw a completely different prompt, [Would you like to use the Life Simulator? Each use consumes one unit of energy.]<br/><br/>[Current energy level is zero, please collect energy as soon as possible.]<br/><br/>Gu Yang couldn’t help but gasp.<br/><br/>This is bad.<br/><br/>This means that gold and silver are now useless to him.<br/><br/>Now, if he wants to perform a simulation, energy is required.<br/><br/>But what is this energy?<br/><br/>How can he collect this energy?<br/><br/>There’s not even a hint.<br/><br/>“After reaching the Divine Power realm, you really changed the currency. You really are something.”<br/><br/>Gu Yang had speculated that after reaching the Divine Power realm, the price for a single simulation would increase. He’d also considered that it might switch to something else.<br/><br/>For him, naturally, it would be better to continue using gold and silver. Even if the price increased somewhat, he could afford it.<br/><br/>Great Zhou is so vast, and the reserves of gold and silver are considerable. At worst, he would overthrow Great Zhou, establish his own country and issue banknotes.<br/><br/>This would be better than the current situation, where it switched to “energy” and he doesn’t even know what that is.<br/><br/>While thinking, Gu Yang had already climbed onto the peak of the mountain.<br/><br/>“Huh?”<br/><br/>For some reason, after entering the range of the mountain, he felt that the True Essence within his body had been somewhat suppressed.<br/><br/>“Demon Suppression Tower, damn it, are you treating me as a demon beast?”<br/><br/>He quickly guessed the reason.<br/><br/>After breaking through to the realm of Divine Power, due to the two martial techniques, “Phoenix Dance Nine Heavens” and “Divine Phoenix Manual”, he had awakened some of the Phoenix’s bloodlines. Detected by the Demon Suppression Tower, he was, therefore, constrained by the demon suppression measure.<br/><br/>“A Phoenix is a divine beast, you know.”<br/><br/>Gu Yang commented sarcastically. Seeing nothing atop the peak, it must have been Miss Su Er who disposed of the soul monster guarding the passage. He, then, walked into the diagram in the center.<br/><br/>As soon as he stepped in, he felt dizzy and in the blink of an eye, he was already on the second level.<br/><br/>He curiously glanced around, the environment on the second floor was similar to that of the first, but the area seemed to be smaller.<br/><br/>Not far away, there was another towering peak, which was the entrance to the third floor.<br/><br/>Before long, he was at the peak yet again. Without the soul monster to guard, he went straight to the third level.<br/><br/>…<br/><br/>Just like this, Gu Yang made his way up to the fourth level, and suddenly things felt different.<br/><br/>The oppressive force, material-like, the feeling of being rejected by the world, made him feel somewhat uneasy.<br/><br/>Boom!<br/><br/>In the distance, on the peak, a flash of lightning lit up.<br/><br/>“Thunderbolt Annihilation?”<br/><br/>Gu Yang immediately recognized the origin of this lightning and wasn’t surprised.<br/><br/>At that time, his “Six Extensions of the Divine Sky” were passed down directly from the queen. This Miss Su, being the queen’s sister, it was normal that she would know this saber technique.<br/><br/>“Such formidable strength.”<br/><br/>He couldn’t help but exclaim, although the other party is only in the first stage of the Golden Body realm, her strength greatly surpassed that of Lin Yimo from Jiangzhou City.<br/><br/>“She must be the true disciple of the Blue Sky Palace.”<br/><br/>The thunderbolt, combined with the most rigid Yang’s annihilating force, was surprisingly unable to harm the enemy.<br/><br/>Gu Yang frowned, “Is this power…?”<br/><br/>The one fighting against Miss Su should be the soul monster guarding this level. Its power gave him a sense of familiarity.<br/><br/>Very much like the terrifying presence he felt the first time he used the God Destroyer technique.<br/><br/>“So, the Wu Family is related to that person from Chi Ming Tian.”<br/><br/>Gu Yang finally understood many things. It was highly likely that the Wu Family and Chi Ming Tian were connected. Perhaps, “Heavenly Elemental God Slaying Art” and “God Destroyer Nine Styles” both originated from Chi Ming Tian.<br/><br/>He also understood why Wu Er and Ling Ling, although they both have direct bloodline relationship with the Wu Family, had not practiced the martial techniques passed down by the family.<br/><br/>One created “Nine Heavenly Questions and Blade”. One transformed the martial technique of the Dao Sect’s “Extreme Yang True Gang”.<br/><br/>This seemed to be measures to break away from the controls by that person from Chi Ming Tian.<br/><br/>With this thought, the extermination of the Wu Family might not be that simple.<br/><br/>While processing all this, Gu Yang acted swiftly. Using his Space Control Divine power, he flew at an extremely fast speed to the peak and finally clearly saw what the soul monster looked like.<br/><br/>From appearances, it still retained a human form. However, it was not using the True Essence for power but rather a kind of grayish-white flame that gave people a dangerous feeling of dirtiness and corruption.<br/><br/>The energy within its body was much more massive compared to that Golden Body second stage individual around Guo Taiping back then.<br/><br/>Moreover, the grayish-white flame it manipulated seemed to be extremely restrained against the True Essence used by martial artists.<br/><br/>Although Miss Su was only one realm lower, her True Essence was more than ten times less, she was completely suppressed. If the fight continued, defeat was inevitable.<br/><br/>Without further ado, Gu Yang drew out the Phoenix Feather Knife and struck with a slash.<br/><br/>“Six Extensions of the Divine Sky”, Skyfire Incineration!<br/><br/>“It’s over!”<br/><br/>Su Ningyan’s Thunderbolt Annihilation was effortlessly blocked by the soul monster, causing her heart to sink. She knew that there was no way she would pass this level.<br/><br/>The difference was too vast. The soul monster of the Golden Body’s second stage was far stronger than she had imagined.<br/><br/>“This time, not only didn’t I succeed, but I also lost my forces. The loss is too great.”<br/><br/>She couldn’t help but give a bitter smile, knowing that success was impossible, she was about to use her techniques to leave this Demon Suppression Tower.<br/><br/>At this moment, a familiar and powerful presence was approaching rapidly.<br/><br/>“Is it him?”<br/><br/>“How is this possible?”<br/><br/>Su Ningyan was shocked. That presence was clearly that of the Divine Power Realm!<br/><br/>She suddenly turned her head and saw that it was indeed Gu Yang, with perfect presence, indeed in the Divine Power Realm.<br/><br/>Her heart was riddled with shockwaves.<br/><br/>Just a while ago, he was not in the Divine Power Realm.<br/><br/>In just less than half an hour, he has broken through?<br/><br/>PS: Asking for monthly votes for the first update.\t\t\t\t\t\t</div>", "images": {}, "success": true}