{"id": 178, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/14343928.html", "title": "Chapter 178 - Chapter 178 Divine Power!", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 178 - Chapter 178 Divine Power!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 178 Divine Power!<br/><br/>Translator: 549690339<br/><br/>“Over ten million?”<br/><br/>Gu Yang’s eyes widened as he saw the balance.<br/><br/>How could it be so much?<br/><br/>Suddenly, it dawned on him with a slap to his thigh. “Could it be that when I recharged earlier, the system converted all the gold and silver around here into value?”<br/><br/>The system’s recharge mechanism required proof that the gold and silver were his. If there were others around, only the gold and silver in his hands could be recharged. If it was placed on the ground and selected, the system wouldn’t respond.<br/><br/>If no one was around, he could carry out batch recharging.<br/><br/>When the amount of money was too large, he would use this method of batch recharge, else he would become tired from manually recharging each piece.<br/><br/>However, before this, recharging was always done in a room. As long as there were no other people in the room, batch recharging was possible.<br/><br/>Recharging in such an open space was a first for him.<br/><br/>It seemed that as long as there was no one around, the system would automatically identify all the gold and silver as his, regardless of whether he was indoors or outdoors.<br/><br/>This was the first time Gu Yang realized this. It was really convenient and saved him a lot of effort.<br/><br/>Otherwise, it would take a lot of time to dig up all the gold and silver in such a large area.<br/><br/>This also showed that the woman must have gone far. Perhaps, she had already ascended to the second floor.<br/><br/>Without hesitation, Gu Yang sat down, opening the system.<br/><br/>He could feel that he was very close to the Divine Power Realm and could break through at any time. Now that his balance was over ten million, it should be enough for more than twenty simulations.<br/><br/>“At the age of twenty-two, you are already at the peak of the First Rank, one step away from forging a Golden Body. Your defeat of Lin Yimo, who was at the first stage of the Golden Body, in Jiangzhou City, shook the world.”<br/><br/>“You went to Divine City and encountered an accident when visiting Guozhang Mansion for a birthday celebration. You and Miss Su Er were trapped in the Demon Suppression Tower.”<br/><br/>“You defeated the Soul Monster guarding the tower and ascended floor by floor. You stopped on the fourth floor. Using Miss Su Er’s Abnormal Treasure, you evaded the Soul Monster’s repeated searches.”<br/><br/>“A year later, one day, you found that Miss Su Er was missing. You could only practice alone in the Demon Suppression Tower, hoping that one day, you could pass the fourth level.”<br/><br/>“Eight years later, using the Phoenix essence blood in the seal, you trained the “Divine Phoenix Manual” to the second level. One day, you discovered a Mana Realm powerhouse. With a single stroke, you killed the Soul Monster guarding the pass and seized the opportunity to ascend to the fifth level, the sixth level,…until the ninth level.”<br/><br/>“You and the Mana Realm powerhouse broke out of the Demon Suppression Tower and finally saw daylight again. Outside was a battlefield with several Divine Power Realm practitioners in combat, and the surrounding area was blocked by mana. You were forced to join the battle.”<br/><br/>“In the end, the successor of the Godslayer blade used the Godslayer style, a terrifying will descended, and you couldn’t resist it, leading to your death at the age of thirty-one.”<br/><br/>After Gu Yang finished reading the content of this simulation, he was quite satisfied with surviving for nine years.<br/><br/>There were two key points, one was that the Demon Suppression Tower was not very dangerous, he was able to stay there for nine years on his own.<br/><br/>The second was the major battle nine years later, likely the downfall of the Red Venerate. It was too dangerous for him now; it would be best not to get involved.<br/><br/>“The simulation is complete, and you can retain one of the following items.”<br/><br/>“One, the martial arts realm at the age of thirty-one.”<br/><br/>“Two, the martial arts experience at the age of thirty-one.”<br/><br/>“Three, life wisdom at the age of thirty-one.”<br/><br/>“I choose one.”<br/><br/>After Gu Yang made his choice, the fire phoenix in his mind swelled once again and he experienced the tempering of the Divine Fire. This was the second level of the “Divine Phoenix Manual”.<br/><br/>However, the amount of True Essence increased was less.<br/><br/>“Again.”<br/><br/>“…you discovered a Mana Realm powerhouse appearing on the fourth level, but you ignored him and continued to practice.”<br/><br/>“Half a year later, a terrifying will swept through the Demon Suppression Tower. You were found, and a force pulled you uncontrollably into a large mouth. You died prematurely at the age of thirty-two.”<br/><br/>As expected, staying in the Demon Suppression Tower was not safe, and in the end, he was eaten by someone.<br/><br/>That terrifying being was probably the behind-the-scenes mastermind of the Red Venerate, or that being of Red Ming sky. The creature was so monstrous that it ate people.<br/><br/>“The simulation has ended, and you can retain one of the following items.”<br/><br/>After that, Gu Yang continued with one simulation after another.<br/><br/>He was trapped in the Demon Suppression Tower, with no room to choose or struggle. At the most, he could only survive for ten years.<br/><br/>By the sixth simulation, his “Divine Phoenix Manual” had broken through to the third level.<br/><br/>Then, he and Miss Su finally made it to the fifth floor.<br/><br/>Unfortunately, it was of no use; he still died ten years later.<br/><br/>By the fourteenth time, Gu Yang’s “Divine Phoenix Manual” had broken through to the fourth layer. Afterwards, they managed to charge into the sixth layer.<br/><br/>He tried to follow the strong Mana Realm cultivator that left the Demon Suppression Tower, but he likewise died in that great battle.<br/><br/>The twentieth time.<br/><br/>[…Five years later, you are consummate in your practice, stepping into the Divine Power Realm, achieving the Golden Body.]<br/><br/>[Two years later, after solidifying your realm, you finally made it out of the Demon Suppression Tower with nothing but your own strength. Running the “Divine Phoenix Manual”, you transformed into a phoenix and fled.]<br/><br/>[You went to Tianzhu Mountain and entered the secret realm to meet up with Su Qingzhen and others for arduous cultivation.]<br/><br/>[Twenty-four years later, a great battle breaks out in the outside world, and the secret realm entrance is destroyed…]<br/><br/>[Depending on the Divine Phoenix Manual, you evaded multiple assassination attempts, always on the run. Three years later, you met Chu Xiyue and followed her to the Blue Sky Palace.]<br/><br/>[Nine years later, news of the destruction of Wanxiang palace reached you. Blue Sky Palace lead a retaliatory attack. You, along with Su Qingzhen and others, also joined the expedition.]<br/><br/>[Three years later, you were targeted by an Unleaking Realm expert from Wanxiang Gate and, in the end, with no means of escape, you died in battle at the age of sixty-five.]<br/><br/>Finally obtained the Divine Power!<br/><br/>When Gu Yang saw those words, he could hardly believe it. He looked at it again, and indeed, he had obtained the Divine Power.<br/><br/>He couldn’t help but heave a sigh, it truly wasn’t easy.<br/><br/>For this day, he didn’t know how many times he had to simulate.<br/><br/>He even suspected that there was something wrong with this method and that it was impossible to cultivate it to the Divine Power realm.<br/><br/>Now, all his skepticism and worries were gone like smoke in the wind.<br/><br/>He had broken through to the Divine Power Realm.<br/><br/>He didn’t care at all about the content that followed.<br/><br/>[The simulation ends and you can keep one of the following rewards:]<br/><br/>[One, the martial arts realm at the age of sixty-five.]<br/><br/>[Two, the martial arts experience at the age of sixty-five.]<br/><br/>[Three, the wisdom of life at the age of sixty-five.]<br/><br/>Gu Yang said excitedly, “I’ll choose the first one!”<br/><br/>Boom!<br/><br/>In an instant, a huge phoenix flew out of his mind.<br/><br/>When he cultivated the Divine Phoenix Manual to the third layer, it changed into this form, truly resembling a divine bird.<br/><br/>The fiery red flames surrounded his body in layers, wrapping him and the phoenix together. Gradually, the flames extinguished, leaving only a large red egg.<br/><br/>At this moment, Gu Yang entered a profound and indescribable state. A marvelous power, as if welling up from the depths of his veins, induced an incredible transformation in his body.<br/><br/>His True Essence was constantly sublimated, becoming flame-like.<br/><br/>In his mind, he received some extremely ancient lineage knowledge, originating from an ancient lineage.<br/><br/>Unfortunately, some of the knowledge was too much to grasp, so he couldn’t discern it.<br/><br/>He understood that it was due to his weak bloodline.<br/><br/>After who-knows-how-long, everything calmed down.<br/><br/>Gu Yang felt something and, with a movement, the surrounding shells around him shattered and disappeared into nothingness.<br/><br/>He opened his eyes, and two balls of red flame flickered in his eyes.<br/><br/>“Super Strength Divine Power!”<br/><br/>He clenched his fist, feeling an unprecedented powerful force. It felt as if he could tear the emptiness apart with a single punch.<br/><br/>“Space Control Divine Power!”<br/><br/>With a thought, his body floated and whisked off, freely flying around in the air.<br/><br/>Both of these Divine Powers are powers anyone could master once breaking through to the Divine Power Realm.<br/><br/>Gu Yang slapped open his palm, in it a small clump of flame with a shocking temperature.<br/><br/>All his True Essence had transformed into this kind of flame, its might was considerably powerful.<br/><br/>Gu Yang closed his fingers and the red flame disappeared at once. “It’s time to leave.”<br/><br/>PS: Getting the Divine Power! I suppose asking for votes then isn’t too much to ask!\t\t\t\t\t\t</div>", "images": {}, "success": true}