{"id": 186, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15131973.html", "title": "Chapter 186 - Chapter 186: I’M Sorry I’M Powerless To Help", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 186 - Chapter 186: I’M Sorry I’M Powerless To Help</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 186: I’m sorry I’m powerless to help<br/><br/>Translator: 549690339<br/><br/>In the rear hall of the Taiji Palace, a sudden bout of violent coughing emerged.<br/><br/>“Your Majesty, please take care of your dragon health.”<br/><br/>In the hall, several eunuchs knelt on the ground, almost pleadingly said.<br/><br/>The one lying on the dragon bed was the owner of this colossal empire, the Supreme Emperor.<br/><br/>At this moment, he was merely a middle-aged man sick in bed. Upon hearing the news of his sister’s danger, he became agitated, coughing violently.<br/><br/>As the cough persisted, it led to coughing up blood.<br/><br/>The eunuch caring for him at the side was horrified and yelled out, “Call for the imperial doctor immediately.”<br/><br/>Suddenly, the Emperor grabbed his wrist, panting heavily said, “Summon … summon Lord of the State immediately!”<br/><br/>“Your Majesty….”<br/><br/>“Go.”<br/><br/>“Yes!”<br/><br/>On the other side, inside the Qi Feng Pavilion.<br/><br/>A dignified figure sat at the table, holding a brush, reviewing memoranda.<br/><br/>“My Lady, Commander Lai has arrived.” Outside the bead curtain, a servant reported in a low voice.<br/><br/>“Tell him to come in.”<br/><br/>In a short while, Lai Baocheng, the commander of the Imperial Guard, entered. He performed a formal bow through the bead curtain, saying, “My Lady, it’s been confirmed that the sponsor in the Duke’s mansion left Divine City a month ago and his whereabouts are unknown.”<br/><br/>The woman behind the bead curtain didn’t lift her head, asking, “What about the Lord of the State?”<br/><br/>“According to the report, his internal injuries flared up half a month ago, and he has been resting ever since.”<br/><br/>The woman scoffed, “So you’re saying, such a massive event took place, and there wasn’t any reaction from the entire Duke’s mansion, merely a coincidence?”<br/><br/>Lai Baocheng knelt on the ground, “I have failed in my duties, and put you in danger, please punish me, my lady.”<br/><br/>As the leader of the Imperial Guard, such a major event occurred right under his watch, he was undoubtedly responsible.<br/><br/>The woman said calmly, “Draft a decree, the Imperial Guard Commander Lai Baocheng performed duties ineffectively, reducing his rank and dismissing his titles, penalize three years’ salary, demote him to Deputy Commander, and he will have the chance to make up for his errors.”<br/><br/>Lai Baocheng bowed his head, “Thank you for your grace, my Lady.”<br/><br/>“Within three days, remove all the Red Venerate spies in Divine City.”<br/><br/>“Yes.”<br/><br/>After Lai Baocheng finished speaking, he exited.<br/><br/>Once he left Qi Feng Pavilion, his whole person was filled with an aura of killing intent, ready to cause trouble for the Red Venerate.<br/><br/>For him, this was entirely an unexpected disaster.<br/><br/>In Divine City, with such a presence from the academy, as well as the Lord of the State, no one would have thought that the new leader of the Red Venerate would dare to cause trouble in Divine City and successfully pull off such a massive coup.<br/><br/>Two powerhouses of the Celestial Being realm, Gao Weisong from the Gao family, Zhou Zongye from the academy, the Princess Chang, along with fourteen practitioners of the Divine Power realm, all trapped in an unknown secret realm.<br/><br/>Both golden bodies in the palace trying to protect the queen, also died tragically on the spot.<br/><br/>Thinking about this, Lai Baocheng was still somewhat terrified.<br/><br/>Two beings from the mana realm!<br/><br/>The new leader of the Red Venerate is cruel in his methods, deep in his plans, daring in his actions – it’s unimaginable.<br/><br/>This is the Divine City, home to a Celestial Being, and a Sword Saint.<br/><br/>However, thinking about it, the one from the academy has been holed up there for decades, some say he is challenging a higher realm.<br/><br/>Others say he has been severely injured and is in recovery.<br/><br/>No matter the case, it’s a fact that this Celestial Being has not shown his hand in decades.<br/><br/>As for the Lord of the State, he was injured during a battle with the Red Venerate years ago. Periodically his injury flares up, necessitating recuperation.<br/><br/>Under these two, the number of powerhouses in the mana realm in Divine City is small.<br/><br/>Zhou Zongye of the academy is one, there is also a mysterious sponsor in the Duke’s mansion.<br/><br/>Aside from these, there are some in the palace, but those powerhouses in the palace’s mana realm have never left the palace.<br/><br/>As for the mana realm powerhouses who tried to chase and kill the Red Sun that day, he didn’t even know they existed beforehand.<br/><br/>Regarding the various families in Divine City, it is not that none of them are in the mana realm, just that they are not in Divine City.<br/><br/>Powerhouses in the mana realm do not input mana into the Divine City. This has been an unwritten rule for a long time.<br/><br/>This is related to a great change in the Divine City two hundred years ago.<br/><br/>Only establishments as powerful as the academy, and people such as the Lord of the State granted special privilege by The Emperor, are exceptions.<br/><br/>Unexpectedly, this allowed the Red Venerate to exploit a loophole.<br/><br/>Inside the Qi Feng Pavilion, the Empress of the Great Zhou was still reviewing her memoranda.<br/><br/>Suddenly, a line of words appeared on the bronze mirror on the table, “Emperor summons Lord of the State to the palace.”<br/><br/>After a glance, the Empress ignored it.<br/><br/>The Lord of the State was such a scaredy-cat, he definitely would not dare come into the palace, at most he would send his son.<br/><br/>As for the Emperor’s purpose in summoning the Lord of the State, the reason could be easily guessed. It is, of course, for his sister.<br/><br/>The queen, thinking of this, suddenly paused in her actions. She set down the royal brush in her hands, stood up and walked to the window, looking out the night sky.<br/><br/>After a long silence, it seemed like she had made a decision.<br/><br/>She returned to the table, picked up a pen and wrote a note. She stuck it on the copper mirror, and the words on the note disappeared out of thin air.<br/><br/>After doing all these, she continued to review her notes.<br/><br/>Inside the Tianxin Martial Arts Hall.<br/><br/>Gu Yang opened his eyes, his brow slightly furrowed. He said, “There is no technique beyond the Celestial Being realm.”<br/><br/>In the simulation, he had obtained all the techniques of the “Phoenix Dance Nine Heavens”, but only up to the Divine Power realm, including the Golden Body realm, Mana realm, and Unleaking realm. There were no techniques for the Celestial Being realm.<br/><br/>That means he can only cultivate up to the Unleaking realm.<br/><br/>The techniques beyond the Celestial Being realm, they must be exclusive to the Three Holy Sects.<br/><br/>It seemed that he wouldn’t be able to avoid this sect. He would have to go there eventually.<br/><br/>But, that would have to wait until later.<br/><br/>Gu Yang started concentrating on the technique of the Golden Body realm, thinking, “Finally, no more iterations of Nirvana required.”<br/><br/>Once the “Phoenix Dance Nine Heavens” reaches the Golden Body realm, like other techniques, it refines the mortal body. By the third level, the body is condensed into the body of a Celestial Phoenix.<br/><br/>However, when cultivating it, one needs the aid of foreign objects.<br/><br/>Most preferably various Spirit Fires to temper the body, such as Ami True Fire, Sun True Fire, Earth Pulse True Fire and so on. With the assistance of these Spirit Fires, cultivation would move at the speed of a thousand miles in a day, and one could quickly condense into a Celestial Phoenix body.<br/><br/>If there is no Spirit Fire, one can only temper their body with their True Essence, but the pace of cultivation would be extremely slow.<br/><br/>Gu Yang felt somewhat troubled as he read, “Where can I find these Spirit Fires?”<br/><br/>Just from their names, they don’t seem like common things. Presumably, the Earth Pulse True Fire might be a bit easier to find.<br/><br/>Just as he was thinking, someone knocked on the door.<br/><br/>“Brother Gu!”<br/><br/>It was the anxious voice of Feng Tianci.<br/><br/>Gu Yang walked over to open the door, asking, “What’s the matter?”<br/><br/>Tianci was pale and looked distraught. Seeing him, he looked as if he had seen a savior, “My master… he’s missing.”<br/><br/>Gu Yang was taken aback. Couldn’t be, right?<br/><br/>Earlier in the day, he hadn’t seen Gao Fan enter the entrance of the Secret Realm.<br/><br/>He comforted, “Don’t panic, take your time and tell me what happened exactly.”<br/><br/>Feng Tianci said, “This morning, master said he had some business to attend to and asked me to stay here. He specifically told me that if he didn’t come back by evening, it means something has happened. He instructed me to find you, Brother Gu…”<br/><br/>Hearing this, Gu Yang immediately understood that the old chap must have also entered the Secret Realm. He didn’t know how he did it, but he even deceived everyone else’s eyes and ears.<br/><br/>Moreover, Gao Fan must have sensed that something was not right, hence he left such instructions for his disciple before departing.<br/><br/>This Senior Gao, he thinks too highly of him.<br/><br/>Even if he wanted to save them, he didn’t know how to do it.<br/><br/>He didn’t know the method to open the Secret Realm, and only the Red Sun probably knew about it in this world<br/><br/>It seemed that Feng Tianci saw his difficulties and pleaded, “Brother Gu, you must save my master.”<br/><br/>“I’ll do my best.”<br/><br/>That’s all Gu Yang could say right now.<br/><br/>At this moment, someone came outside the door again. A crisp voice rang out, “Gu Yang.”<br/><br/>In the entire Tianxin Martial Academy, the only one who dared to call him by his full name was Cheng Tianxin’s precious daughter.<br/><br/>The courtyard door is pushed open, the voice comes in before the person, “Miss Su wants to see you.”<br/><br/>Cheng Qingyu brought in the second miss of the Su Family.<br/><br/>Oh, she has the nerve to come and find me?<br/><br/>Seeing this woman, Gu Yang’s expression turned cold. He looked at Cheng Qingyu and said, “Knock before you enter next time.”<br/><br/>“Ah?”<br/><br/>Cheng Qingyu looked flustered and a little wronged, “I-”<br/><br/>Su Ningyan stepped in front of Cheng Qingyu and said, “I have overstepped my boundaries. I shouldn’t have had her bring me here at this time. I apologize.”<br/><br/>Gu Yang looked at her as if just noticing her, and asked coldly, “What does Miss Su intend to do by visiting late at night?”<br/><br/>Su Ningyan seeing his reaction, turned to Cheng Qingyu, “You go back first.”<br/><br/>“Ok.”<br/><br/>Cheng Qingyu reluctantly left the courtyard.<br/><br/>Then, Su Ningyan looked at Feng Tianci, making him uncomfortable, and he too Excused himself.<br/><br/>In the courtyard, only Su Ningyan and Gu Yang were left.<br/><br/>Su Ningyan finally declared her intention, “I would like to ask Mr. Gu to take action and rescue Princess Chang and others who are trapped in the Secret Realm.”<br/><br/>Gu Yang directly refused, “Sorry, I’m afraid I’m powerless to help. Please go back.”\t\t\t\t\t\t</div>", "images": {}, "success": true}