{"id": 180, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15131961.html", "title": "Chapter 180 - Chapter 180 Want To Steal My Kills?", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 180 - Chapter 180 Want To Steal My Kills?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 180 Want to steal my kills?<br/><br/>Translator: 549690339<br/><br/>Skyfire Annihilation!<br/><br/>Before Su Ningyan’s eyes, it was as if a blazing sun had appeared, so bright that it made her eyes squeeze shut. The terrifying temperature curled her hair and filled the air with the scent of charring.<br/><br/>“Is this the first level Golden Body?”<br/><br/>She was profoundly shocked.<br/><br/>In Gu Yang’s hands, the power of this move far exceeded expectations.<br/><br/>The soul monster with a level two Golden Body seemed to sense danger, its grey flames now burning fiercely.<br/><br/>In the next instant, boom!<br/><br/>The Skyfire descended, instantly engulfing the level two Golden Body demon.<br/><br/>The grey flames, as if encountering its nemesis, were silently extinguished upon contact with the fiery-red Skyfire.<br/><br/>When the flames receded, all was calm. The demon had vanished without a trace.<br/><br/>Just like that, it was annihilated into ashes and smoke with a single move!<br/><br/>“How is this possible?”<br/><br/>Su Ningyan’s eyes narrowed, shocked for the third time.<br/><br/>This demon was as powerful as a Level Two Golden Body, so how was it so easily defeated?<br/><br/>When you reach the Divine Power Realm, there are no mediocrities. Each person’s practice is remarkable, whether in terms of temperament or understanding, they are all the best of their time.<br/><br/>The gap within the same realm won’t be huge, unlike in the First Rank, where a single realm could differentiate five levels of strength.<br/><br/>Even if one has been in the Golden Body realm for over a decade, defeating a newcomer is easy, but killing them is extremely difficult.<br/><br/>If the realms are not the same, the difference in power is as vast as a chasm.<br/><br/>To challenge someone beyond your realm, you’d need to wield an unsurpassed divine weapon.<br/><br/>Items of such caliber, there are only a dozen or so throughout Great Zhou, almost all of them in the hands of mana Realm powerhouses.<br/><br/>The Phoenix Feather Knife in Gu Yang’s hand was also an unsurpassable divine weapon once, but after being sealed, it was only a piece of mundane iron. It did nothing to boost his power.<br/><br/>Right after he broke through to the Divine Power realm, he wiped out a level two Golden Body demon with a single blow.<br/><br/>This was beyond her comprehension.<br/><br/>“No, his True Essence… actually possesses the characteristics of Mana!”<br/><br/>Su Ningyan, with her extraordinary experience, quickly discovered the key point, and it startled her.<br/><br/>Mana and True Essence are fundamentally different.<br/><br/>When you reach the Mana Realm, you can control the environment, possess nearly cataclysmic power—it’s like ascending to the status of a God.<br/><br/>To let the True Essence have some characteristics of Mana in the Golden Body realm!<br/><br/>Only the legendary ancient sects with their powerful cultivation methods could accomplish that.<br/><br/>“Phoenix Dance Nine Heavens” was of this caliber.<br/><br/>After Gu Yang dispatched the demon with a single blow, his expression changed slightly. A pop-up suddenly appeared before his eyes, [You have gained one unit of energy. You currently have 1 unit of energy.]<br/><br/>He was truly caught off guard.<br/><br/>He had originally assumed that he would need to find some sort of spirit stone filled with spiritual power.<br/><br/>He never thought he could gain the energy necessary for an additional simulation by simply destroying a soul monster.<br/><br/>No, it should be a Divine Power Realm demon!<br/><br/>Gu Yang quickly calculated in his mind. This was the fourth floor, there were still five more above. A minimum of five more energy units could be gained.<br/><br/>He was delighted. The Demon Suppression Tower was indeed his lucky break!<br/><br/>He excitedly approached the magic array in the center that led to the next floor and turned to the woman, saying, “Come on, what are you waiting for?”<br/><br/>Su Ningyan came back to her senses, her expression complex as she followed after him.<br/><br/>By the time they reached the fifth floor, Su Ningyan was just about to speak, when Gu Yang suddenly sped off towards a nearby mountain.<br/><br/>She could only swallow the words she was about to say and did not follow him. Instead, she took out a one-inch-long sword tip from her bosom and held it in her palm.<br/><br/>Then, she closed her eyes and began to sense its vibrations.<br/><br/>After a moment, Su Ningyan put away the item with a disappointed look, “It’s not on this floor.”<br/><br/>She had decided to take a risk and enter the Demon Suppression Tower this time in search of a particular item—a treasure that was immensely important to her.<br/><br/>As it was not on this floor, she could only continue moving upwards.<br/><br/>She hoped that Gu Yang could vanquish the demon on this floor.<br/><br/>Right now, he was the only one she could count on.<br/><br/>With every rising level in the Demon Suppression Tower, the strength of the guards became more potent.<br/><br/>Based on her experiences in the first three levels, the soul monster of the fifth level would be several times stronger than on the fourth floor.<br/><br/>Boom!<br/><br/>As she was thinking, she saw a bright fire blaze up on the mountaintop and immediately disappear in an instant.<br/><br/>“Is it…over?”<br/><br/>Su Ningyan could no longer sense the soul monster, her expression froze.<br/><br/>In just a few moments, she arrived at the mountaintop, where there was not a soul in sight. Gu Yang had already gone through the array first, ascending to the next level.<br/><br/>Gazing at the residual traces on the ground, she was somewhat in awe.<br/><br/>This kind of strength was beyond her expectations.<br/><br/>Simultaneously, a glimmer of hope arose in her heart.<br/><br/>As one ascends to the higher levels…<br/><br/>Upon reaching the sixth floor, Su Ningyan pulled out the sword-tip once again and closed her eyes to sense its presence.<br/><br/>After a while, she revealed a look of disappointment again.<br/><br/>This level still didn’t have it.<br/><br/>That thing must be located above the seventh floor.<br/><br/>At the summit, a bright fire blazed up once again and then fell silent.<br/><br/>The battle was resolved in the same swift fashion.<br/><br/>Yet Su Ningyan’s expression did not depict any relief.<br/><br/>The first three floors of the Demon Suppression Tower contained soul monsters of the first rank Golden Body.<br/><br/>From the fourth to the sixth floor, the second rank.<br/><br/>Above the seventh floor, there were inevitably the third rank ones.<br/><br/>No matter how strong Gu Yang was, could he possibly overcome enemies two realms higher than him?<br/><br/>The environment on the seventh floor seemed even more oppressive.<br/><br/>As Su Ningyan opened her eyes, she couldn’t help but display some disappointment. It still wasn’t there.<br/><br/>It looked like that thing was either on the eighth floor or the ninth.<br/><br/>She couldn’t help looking towards the mountain peak, even though she knew it was impossible, her heart was still filled with a slight hope.<br/><br/>The battle over there had already started, waves of red fires glowing brightly like sprinkling fireworks.<br/><br/>On the other side, there were white flames blocking the red ones. It wasn’t like the lower soul monsters who would break upon contact.<br/><br/>It really was a third rank Golden Body!<br/><br/>Even the last glimmer of luck in Su Ningyan’s heart was doused out.<br/><br/>She was someone who could pick up and let go with equal ease and did not let the feelings of regret trouble her for too long.<br/><br/>“This boy has immense potential, it would be a pity if he died here.”<br/><br/>She flew towards the mountain peak at the fastest speed, proclaiming, “I’m here to assist you.” A red rope flew out of her hand, forming a huge net in the air, aiming to trap the soul monster.<br/><br/>Although Su Ningyan could not compete with the soul monster, using the red thread to stall for a moment was no problem.<br/><br/>She only needed to hold it for a moment, create some distance, then she could use her methods to escape with Gu Yang.<br/><br/>Gu Yang was passionately wielding his True Essence, he hadn’t experienced such a thrilling fight in quite some time. The earlier three soul monsters were too weak to even receive a single hit from him.<br/><br/>Finally, he encountered a worthy opponent for an exhilarating battle.<br/><br/>Ever since he had stepped out into the world, most of his opponents were dealt with in one swift strike. He had never had a back-and-forth battle like this, it lacked excitement.<br/><br/>As the battle was raging on, that woman suddenly intervened.<br/><br/>Gu Yang glared at her dissatisfied, was she trying to steal his kill?<br/><br/>He made no more reservations and used Skyfire Annihilation once again.<br/><br/>A streak of an extreme sword aura flew out, hitting the soul monster’s head at its core.<br/><br/>With a sizzling sound.<br/><br/>It split into two halves, and shortly after, a red flame lit up, swallowing up the two halves of the soul monster, which, in a blink of an eye, vanished into thin air.<br/><br/>He sheathed his sword, walked towards the arrays in the center and disappeared without leaving a trace behind.<br/><br/>Leaving behind Su Ningyan in complete shock.\t\t\t\t\t\t</div>", "images": {}, "success": true}