{"id": 182, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15131965.html", "title": "Chapter 182 - Chapter 182: Cui’Er, Go!", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 182 - Chapter 182: Cui’Er, Go!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 182: Cui’er, go!<br/><br/>Translator: 549690339<br/><br/>At this moment, outside Divine City, a shocking battle was happening.<br/><br/>Two powerful beings at the Mana realm were indeed fighting fiercely, even the mountains outside the city were flattened.<br/><br/>A red and blue light entwined with each other, occasionally with startlingly loud explosions.<br/><br/>At this moment, the city gate of Divine City was tightly closed.<br/><br/>Luckily, the tall city wall blocked the aftershocks of the fight. Otherwise, countless people would have been killed by the aftershocks.<br/><br/>Quite a few people stood on the city wall, witnessing this rare battle at the Mana realm.<br/><br/>Since the Wu Family battle eighteen years ago, the Nether Sect had grown bigger, hunting down the solitary warriors at the Divine Power realm, so sighting Divine Power realm warriors was rare.<br/><br/>The last time there was a battle amongst the Mana realm warriors was over a decade ago.<br/><br/>Those daring to observe the fight from the city walls under the Mana aftershocks were at least Golden Body realm warriors, or were under their protection.<br/><br/>Gu Yunfei was also on the wall. Standing in front of him was his granduncle.<br/><br/>Though he couldn’t see the true bodies of the two Mana realm warriors, he was still amazed.<br/><br/>A sword flattening a mountain top!<br/><br/>A punch causing the ground to collapse!<br/><br/>This was an absolutely godlike power.<br/><br/>One of the warriors at the Mana realm in the fight was Red Sun from the Red Venerate Sect.<br/><br/>Just moments ago, when in the Prime Minister’s Mansion, Gu Yang slashed through Red Sun’s Mana Barrier. Within a few breaths, several Divine Power realm warriors arrived.<br/><br/>Seeing the tide turn against them, the Red Venerate Sect scattered and fled.<br/><br/>Red Sun, who was immobilized, was a step late, eventually chased down by the Mana realm warrior from the palace.<br/><br/>The queen, in order to save her sister, commanded him to make a deadly move. From the city to the outside, where he reached, it was like a natural disaster, resulting in countless casualties.<br/><br/>After a while, Gu Yunfei’s granduncle appeared, chasing with him, allowing him the fortune of witnessing this epic battle.<br/><br/>Even him, he could tell Red Sun was at a disadvantage, suppressed by the palace’s high-level warrior.<br/><br/>Boom!<br/><br/>Suddenly, an extremely dazzling ball of light lit up, instantly collapsing the blue mana.<br/><br/>Gu Yunfei felt as though the sunrise was blinding him, forcing him to close his eyes.<br/><br/>“If you want to die, I’ll grant your wish.”<br/><br/>The murderous voice of Red Sun echoed throughout Divine City.<br/><br/>A moment later, the light faded, revealing his figure, a large black tower loomed over his head, growing larger.<br/><br/>“Demon Suppression Tower!”<br/><br/>Gu Yunfei was shocked.<br/><br/>Just at the Prime Minister’s Mansion, Red Sun had used the Demon Suppression Tower to trap Gu Yang and Miss Su Er.<br/><br/>Only now, this Dao Sect treasure revealed its true form.<br/><br/>It was rumored that the founder of the Dao Sect had suppressed a Demon Saint who was a Celestial Being with the Demon Suppression Tower, thus establishing his prestige.<br/><br/>The previous head of the Red Venerate Sect was invincible with this treasure, even the peerless warriors at the Unleaking Realm couldn’t handle him.<br/><br/>The moment Red Sun took out the Demon Suppression Tower, his momentum became completely different.<br/><br/>The warrior from the Palace at the Mana realm also showed her figure. She was a beautiful middle-aged woman dressed in palace attire, with a red mole between her eyebrows like blood.<br/><br/>Her face solemn, she turned her hand and a bronze candelabra was there, the same Abnormal Treasure that had bound Red Sun at the Prime Minister’s Mansion.<br/><br/>However, the candle on the candelabrum had burnt down completely.<br/><br/>On the city wall, Gu Yunfei was gasping for breath, crushed by the stern atmosphere.<br/><br/>He was well aware that both of the warriors had unleashed their respective trump cards, preparing to determine the final victor.<br/><br/>Just then, an anomaly occurred.<br/><br/>At the top of the Demon Suppression Tower, a light flashed, and two figures flew out.<br/><br/>“Gu Yang?”<br/><br/>Gu Yunfei recognized one of the figures and blurted out.<br/><br/>He had managed to escape from the Demon Suppression Tower.<br/><br/>His granduncle, who was standing in front of him, heard this name. His glance swept over the figure with the knife in haste, and his eyes sparkled sharply.<br/><br/>The knife was the Phoenix Feather Knife that the Gu Family had lost a hundred years ago.<br/><br/>Even though the Phoenix Feather Knife had been sealed, it held a special significance for the Gu Family.<br/><br/>“How is this possible?”<br/><br/>Red Sun looked at the man and woman fleeing from the Demon Suppression Tower, his eyes narrowed.<br/><br/>No one knew better than him about the situation inside the Demon Suppression Tower. Starting from the seventh floor, all the way to the ninth, were all Soul Monsters at the third stage of the Golden Body.<br/><br/>Within the Soul Monsters was True Demon Qi, something that the True Essence of warriors specially restrained, so it was impossible to get past without having a cultivation level at the Mana realm.<br/><br/>One of them hadn’t even reached Divine Power level yet, while the other was at the first level of the Golden Body. How could they escape from the Demon Suppression Tower?<br/><br/>Red Sun sensed what was inside the Demon Suppression Tower and was both shocked and angry.<br/><br/>All the Soul Monsters inside were gone!<br/><br/>Those were Soul Monsters crafted by the Demon Saint with his True Demon Qi, they had all been killed.<br/><br/>Without the Soul Monsters guarding it, the Demon Suppression Tower would lose half of its effectiveness. Even if people were trapped inside, they could quickly escape.<br/><br/>The God Venerate had granted him the Demon Suppression Tower so he could capture Golden Body level warriors and offer them as sacrifices to the Red Sun.<br/><br/>Now that the tower had lost its power, how would he explain it to the God Venerate?<br/><br/>Fearing the severe consequences of angering the God Venerate, Red Sun’s desire to kill intensified. He roared, “You will pay!”<br/><br/>The surrounding dread-inducing mana transformed into crimson flames and swept over the man and woman like a giant wave.<br/><br/>“Ningyan!”<br/><br/>The beautiful woman saw Su Ningyan and felt a weight lift off her heart. Then she saw Red Sun’s near-madness and his reckless use of his mana source, and her face paled slightly.<br/><br/>Even she had to briefly evade the all-out assault from a mana realm being.<br/><br/>She tossed out a red rope, lassoed Su Ningyan’s wrist, and pulled her to her side.<br/><br/>In a flash, she had disappeared.<br/><br/>Only Gu Yang was left behind, standing alone in the face of a full-blown blow from a mana realm expert.<br/><br/>On top of the city wall, the watching Divine Power Beings turned pale and retreated one after another.<br/><br/>Red Sun’s attack was world-endingly powerful that even those who were some distance away felt the enormous threat and hastily took cover behind the city walls.<br/><br/>Only the elder from the Gu Family, Gu Yunfei, stayed where he was. Naturally, Gu Yunfei also couldn’t flee.<br/><br/>Watching the tiny figure confronting the wave of mana, he was caught in a complex wave of emotion.<br/><br/>This time, it was almost certain Gu Yang would die.<br/><br/>Not even a third rank Golden Body-level cultivator could survive the full force of a Mana realm hit, let alone Gu Yang, who hadn’t reached the Divine Power rank.<br/><br/>Would such a prodigy really perish here?<br/><br/>He surprisingly found himself feeling a profound regret.<br/><br/>“So heartless, so ungrateful,” Gu Yang muttered. That Miss Su Er had just up and left him behind.<br/><br/>His face, however, showed no surprise.<br/><br/>Since he knew the Demon Suppression Tower’s current master was a Mana realm powerhouse, he naturally hadn’t just blundered out into the open.<br/><br/>Before coming out, he had run a simulation.<br/><br/>Therefore, he had expected the circumstances outside.<br/><br/>“Cui’er, attack!” he shouted.<br/><br/>The small blue bird perched on his shoulder flapped its wings in response and flew toward the flame-like wave of mana.<br/><br/>Its minuscule form in front of the terrifying wave of mana was insignificant, like a droplet of water.”<br/><br/>Opening its beak, it took a mighty gulp. Space in front of it warped to form a huge vortex like a funnel.<br/><br/>The terrifying flame was sucked into the vortex as soon as it touched the edge of the funnel and disappeared into the little bird’s mouth.<br/><br/>In the blink of an eye, the terrifying mana vanished without a trace, utterly drained.<br/><br/>“Belch”<br/><br/>The little blue bird let out a long, satisfied burp, opened its mouth, and spewed a breath of flame. It mumbled to itself, “So distasteful…”<br/><br/>The scene fell silent.<br/><br/>Everyone, whether it was the Divine Power Being from the Gu Family who remained where he was or the people who had retreated behind the city walls, wore expressions of shock.<br/><br/>An all-out attack from a Mana realm expert had just been swallowed by a little bird.<br/><br/>They would never have believed it had they not seen it with their own eyes.<br/><br/>What sort of creature was that little blue bird?<br/><br/>“He didn’t die?”<br/><br/>Gu Yunfei looked over at Gu Yang in astonishment.<br/><br/>This was incredible!<br/><br/>At that moment, he finally believed that Gu Yang must be the Child of Destiny. No matter what traps he faced, he could always easily sidestep them.<br/><br/>Such a person completely defied logic.<br/><br/>At this point, if Gu Yang retaliated and killed the Red Sun, he wouldn’t be surprised at all.<br/><br/>Red Sun, not too far away, was looking at the little blue bird in disbelief, as if he had just seen a ghost. Quickly, he put away the Demon Suppression Tower, and in a flash, he had disappeared.<br/><br/>He had actually been scared off.<br/><br/>The attack he had just unleashed had consumed a tremendous amount of his vital essence. It was the most potent attack he had ever released in his life, and it was swallowed by a little blue bird.<br/><br/>Swallowed, can you believe it?<br/><br/>No wonder he was left cold.<br/><br/>As soon as he disappeared, the blue bird in the air began to falter and suddenly plummeted.<br/><br/>Gu Yang reached out to catch it, cradled it in his hand, and praised, “Well done.”<br/><br/>PS: The first update, asking for votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}