{"id": 189, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15131979.html", "title": "Chapter 189 - Chapter 189: 189 Third Knife", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 189 - Chapter 189: 189 Third Knife</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 189: 189 Third Knife<br/><br/>Translator: 549690339<br/><br/>Gu Yang followed an elder maid to the Lord of the State’s residence. Until others at the residence referred to her, he only then came to know that the maid beside him was Nurse Qi.<br/><br/>All along the way, she never uttered a word, and her attitude was very cold, behaving as if she wanted to keep others at a distance.<br/><br/>However, her age did not seem that big, probably only about thirty or forty.<br/><br/>After reaching the Divine Power Realm, the aging process would become extremely slow with a lifespan of 200 years. From her appearance, it was difficult to determine her real age.<br/><br/>Perhaps she was already one or two hundred years old.<br/><br/>As Gu Yang thought, he already reached the courtyard, seeing a group of powerhouses in the Divine Power Realm.<br/><br/>As soon as he walked past the moon gate, dozens of gazes were simultaneously cast over.<br/><br/>The power of their gazes, carrying substance, gave him tremendous pressure, many of them filled with malice.<br/><br/>He glanced around, most of them were unfamiliar faces, but there was one person he did recognize, Guo Taiping.<br/><br/>This guy was still here.<br/><br/>And his murderous intent was the thickest of all.<br/><br/>Gu Yang did not recognize any of the others present. Just as he was contemplating how to break the ice, Nurse Qi finally spoke, “Please, could Mister Wang point out the location of the Secret Realm for us?”<br/><br/>Wang Yuanzhuo was surprised and delighted at her words. “Does Nurse Qi have a way?”<br/><br/>This Nurse Qi was indeed famous in Divine City.<br/><br/>Years ago, when the queen was purging high-ranking officials from the court, some of the departmental officials were not easy to deal with as some of them were cultivators in the Divine Power Realm.<br/><br/>Whenever they encountered someone from the Divine Power Realm, it was Nurse Qi who took action, arresting them and throwing them into the heavenly prison.<br/><br/>It could be said that she was the sharpest knife under the queen’s control.<br/><br/>Of course, everyone in the Divine City now knows that there is also a mana realm powerhouse beside the queen.<br/><br/>Being in the same third-layer Golden Body realm, Wang Yuanzhuo’s attitude was quite courteous.<br/><br/>Nurse Qi said, “That would depend on Young Master Gu’s capabilities.”<br/><br/>In an instant, all eyes were once again on Gu Yang standing next to her. The gazes held doubt, scrutiny, fear, murderous intent …<br/><br/>As if recalling something, Wang Yuanzhuo said excitedly, “Could it be that you have mastered the third form of the ‘Heavenly Inquiry Nine Knives’?”<br/><br/>Upon hearing this, many of the people present looked at Gu Yang with even more hostility.<br/><br/>During the destruction of the Wu Family years ago, many of those present had personally participated, and they held a deep grudge for the extermination of the Wu Family. Hearing that Gu Yang had received Wu Shengtian’s legacy now, it was natural for them to fear him.<br/><br/>‘Heavenly Inquiry Nine Knives’ was not renowned, but the major powers all knew just how terrifying Wu Shengtian was in his prime.<br/><br/>After Wu Shengtian had fully mastered his Blade Dao, he challenged the truly world-class powerhouses of their time. He never made more than three strikes in each match.<br/><br/>If it were not for the intervention of the Celestial Being who killed him, the outcome of the war with the Wu Family would have been quite uncertain.<br/><br/>Gu Yang nodded and said, “I hope Mister Wang can shield me.”<br/><br/>On his journey here, he had already run a simulation once. Among the people present, he knew that only Wang Yuanzhuo was reliable.<br/><br/>Wang Yuanzhuo was astute and naturally understood that after Gu Yang’s relationship with the Wu Family had been revealed, some people present might intend to harm him. He said, “Alright.”<br/><br/>He stood beside Gu Yang, pointed towards the sky, and said, “If my calculations are correct, that spot should be the weakest point of the Secret Realm’s entrance.”<br/><br/>Gu Yang stared at the position pointed by Wang Yuanzhuo, gripped the Phoenix Feather Knife, and said through voice transmission, “Some accidents may occur later on, Mister Wang, please be careful.”<br/><br/>As soon as he finished speaking, a terrifying Blade Intent burst forth from him.<br/><br/>“Heavenly Inquiry Nine Knives”, the third form: Engulfing All Under Heaven!<br/><br/>Under the vastness of the universe, infinite and unending, how could one reach to the other side of space?<br/><br/>This strike from Gu Yang destroyed a void, breaking some prohibition hidden within the void.<br/><br/>The sky seemed as if it had been cut open by a corner, revealing another world beyond it.<br/><br/>“It worked!”<br/><br/>Everyone present, whether they harbored ill feelings toward Gu Yang or not, were excited.<br/><br/>This meant that there was hope for the people trapped in the Secret Realm.<br/><br/>Such a reversal of fortune!<br/><br/>When the scholar from the academy, along with the Lord of the State, both declared their helplessness, they felt that the chances of those trapped in the realm surviving were extremely slim.<br/><br/>To their surprise, a newly advanced Golden Body cultivator managed to slash open an entrance to the Secret Realm.<br/><br/>Even Guo Taiping, who held the deepest murderous intent towards Gu Yang, couldn’t help but feel a touch of gratitude.<br/><br/>It was indeed a narrow escape from death.<br/><br/>As long as his third uncle returned safely, all would be well.<br/><br/>After the void was cleaved, a chain reaction quickly occurred, and the gap continuously collapsed, eventually revealing the situation inside.<br/><br/>Suddenly, a terrifying aura emanated from the gap.<br/><br/>All those present, including those in the Divine Power Realm, felt a fear deep within, as if they had encountered their mortal enemy.<br/><br/>“An Unleaking Realm monster from the Monster Race?”<br/><br/>The color drained from the face of Wang Yuanzhuo standing beside Gu Yang.<br/><br/>In Great Zhou, the Monster Race had disappeared without a trace a thousand years ago.<br/><br/>Unexpectedly, an Unleaking Realm monster from this race still existed in the Secret Realm. If it were to break out, the consequences were unthinkable.<br/><br/>Upon hearing his words, many people couldn’t help but gasp in fright.<br/><br/>The Monster Race and humans were natural enemies. The monsters fed on humans, and humans hunted monsters to extract their bloodline. Once they encountered each other, it was a battle to the death.<br/><br/>Whoosh! Whoosh!<br/><br/>Several people in the Divine Power Realm fled without hesitation, and like a chain reaction, within a blink of an eye, more than half the people had left.<br/><br/>Out of the more than twenty people in the Divine Power Realm, less than ten remained in the end.<br/><br/>Even Nurse Qi had run away.<br/><br/>Those who stayed were those with deep connections to the ones trapped in the Secret Realm.<br/><br/>Gu Yang did not run, not that he did not want to, but because he could not.<br/><br/>The moment he broke open the space, he was locked on to by a terrifying pressure from the Unleaking Realm monster in the Secret Realm.<br/><br/>As the gap in space continued to collapse, one could finally see the situation inside the Secret Realm.<br/><br/>There was a giant Turtle Beast, with a man in its mouth, it bit down, tearing off half of the man’s body and began to chew.<br/><br/>“Uncle…!”<br/><br/>Guo Taiping did not run, and saw this scene, his eyes red with anger, he let out a mournful shriek.<br/><br/>The one torn in half was his uncle.<br/><br/>Witnessing his uncle being eaten by the giant Turtle Beast, he was heartbroken.<br/><br/>He had thought that they had escaped death, but in the end, his uncle could not escape dying, and in such a tragic manner, dying right in front of him.<br/><br/>A person with double layers of the Golden Body, was actually eaten by a Monster Beast.<br/><br/>In the Secret Realm, only five or six people were struggling to survive. This Unleaking Realm Monster Beast was terrifying, all of them together were no match for it.<br/><br/>If it weren’t for the fact that it was huge and somewhat clumsy, they wouldn’t have been able to hold on this long.<br/><br/>Suddenly, they saw the space crack open, their hearts filled with both shock and delight. This was a true escape from death.<br/><br/>At the same time, they all felt relieved.<br/><br/>Although they did not know why the terrifying Turtle Beast was distracted, how could they miss this fleeting opportunity? Everyone ran towards the gap.<br/><br/>Finally, the Guo Family member who was in the Golden body realm was the most unlucky, he was a moment too slow, and was left behind by the Turtle Beast, the others all escaped, totaling five people, including the two in the Mana Realm.<br/><br/>“Run quickly.”<br/><br/>After escaping from the brink of death, the others did not stay at all, like scared birds, they instantly fled the Lord of the State’s mansion.<br/><br/>The only ones who stayed were Zhou Zongye, the vice-principal of the academy, and Wang Yuanzhuo, who had stayed beside Gu Yang the whole time.<br/><br/>“Where’s Princess Chang?”<br/><br/>A palace maid threw out a shrill scream.<br/><br/>Out of those who just left the Secret Realm, Princess Chang was not among them.<br/><br/>This meant that she might have already died inside.<br/><br/>Seeing this, Zhou Zongye knew that it was this young man who had saved them, without hesitating, he immediately took action, using his mana to temporarily seal the spatial gap.<br/><br/>At this moment, Gu Yang felt a sense of relief, finally breaking free from that killing pressure.<br/><br/>Zhou Zongye said, “You better get out of here fast.”<br/><br/>Instead of running, Gu Yang rushed into the Secret Realm.<br/><br/>This action greatly surprised Zhou Zongye and Wang Yuanzhuo, both of them were extremely puzzled as to why he was seeking his own death.<br/><br/>Of course, Gu Yang was not looking to die. He was going for another piece of the Nine States Seal.<br/><br/>In the simulation earlier, he found a piece of the Nine States Seal in the Secret Realm.<br/><br/>After the Secret Realm was sliced open by his blade, it would not be long before it completely collapsed. If he didn’t find the Nine States Seal before the Secret Realm collapsed completely, he would never find it again.\t\t\t\t\t\t</div>", "images": {}, "success": true}