{"id": 181, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15131963.html", "title": "Chapter 181 - Chapter 181: Master", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 181 - Chapter 181: Master</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 181:  Master<br/><br/>Translator: 549690339<br/><br/>Eighth floor of the Demon Suppression Tower.<br/><br/>Su Ningyan felt the sword tip in her palm vibrate slightly, her heart filled with joy, she opened her eyes and exclaimed, “Found it!”<br/><br/>With a swish, she flew in a certain direction.<br/><br/>There were several large bone skeletons in this place, these enormous bones were left by monster beasts, the size of their bodies implied that their cultivation level was at least Divine Power or higher.<br/><br/>Before long, Su Ningyan stopped, waved her hand intending to move the skeleton below, but to her surprise, when her True Essence touched it, it vanished without a trace.<br/><br/>The skeleton didn’t budge an inch.<br/><br/>“Impervious to all forces, the Celestial Being realm!”<br/><br/>She looked at the giant skeleton beneath her, her expression slightly trembling.<br/><br/>There was a Celestial Being realm monster beast that had died here.<br/><br/>“This must be the last Great Sage of the Monster Race, the Divine Rooster Great Sage.”<br/><br/>Rumor had it that the last Great Sage of the Monster Race was killed by the Nameless Taoist of the Dao Sect.<br/><br/>This Great Sage of the Monster Race, originally a brocade rooster, experienced numerous fortuitous encounters, achieved the Celestial Being realm, and became the last Great Sage of the Monster Race.<br/><br/>After the death of the grand enemy, the Xia Emperor, this Great Sage attempted to lead the Monster Race back to the world, but was captured by the Nameless Taoist with the Demon Suppression Tower and ultimately died within the Tower.<br/><br/>Who knows how many years it has been dead for, the skeleton it left behind actually possesses the quality of being impervious to all forces.<br/><br/>“If we could use this corpse’s bones to make some weapons…”<br/><br/>This thought flashed through Su Ningyan’s mind.<br/><br/>Of course, it was just a fleeting thought, this was the Great Sage of the Monster Race, even if one had a peerless divine weapon at hand, it would be impossible to even slice a single bone.<br/><br/>She landed on the ground, following the sensation from the sword tip, walked inside the skeleton, and finally saw a sword stuck in the ground, emitting a faint green glow right now.<br/><br/>“The Blue Sky Sword!”<br/><br/>Su Ningyan was overjoyed, she had finally found it.<br/><br/>Next to the sword, there was a human skeleton, one hand still gripping the sword hilt, kneeling on one knee, the skull facing upward, it seems he died with a sense of strong resentment.<br/><br/>“Yun Chang, you thought that hiding inside the Demon Suppression Tower, no one would be able to find you?”<br/><br/>“You calculated everything, but didn’t expect the Demon Suppression Tower would fall into the hands of Red Venerate of the Skyfire Heaven. Your calculations all turned into nothing but illusions.”<br/><br/>Su Ningyan walked over, while speaking to the skeleton, she pried open the phalanx bones gripping the sword hilt.<br/><br/>The skeleton clung too tightly in its lifetime, when she exerted force, she broke all the bones in one go.<br/><br/>She gripped the sword hilt and pulled the sword out.<br/><br/>“Who dares to disturb my solitary cultivation?”<br/><br/>Suddenly, an old and indignant voice sounded.<br/><br/>This sudden shock was no small matter to Su Ningyan.<br/><br/>This was the eighth floor of the Demon Suppression Tower, there were actually living beings here?<br/><br/>At the very least, he or she was at the third tier of the Golden Body realm, otherwise, it would be impossible to come here.<br/><br/>The destiny string had already flown out, shielding her body.<br/><br/>Finally, she saw who was talking, and her gaze slightly intensified.<br/><br/>It turned out to be a small, green bird, about the size of a baby’s fist, stopping on that skeleton, its black eyes staring at her intently.<br/><br/>Although Su Ningyan didn’t sense any threat from this little bird, she didn’t dare to let her guard down.<br/><br/>A talking bird appearing on the eighth floor of the Demon Suppression Tower, what does this signify?<br/><br/>It was at least a being in the Mana realm.<br/><br/>The Demon Suppression Tower was created to suppress the Monster Race and had a natural suppression effect on them.<br/><br/>Monster beasts on the eighth floor of the Demon Suppression Tower would have their strength suppressed by 80%.<br/><br/>Not to mention, that Red Venerate from Skyfire Heaven, whether against humans or Monster Race, he absolutely didn’t show mercy. The fact that it could survive was a strange thing in itself.<br/><br/>“Huh?”<br/><br/>Suddenly, the Little Green Bird turned its tiny head, exclaimed in surprise, “Master…”<br/><br/>With a swish, its body disappeared out of thin air.<br/><br/>Su Ningyan didn’t even see how it left, instantly breaking out in a cold sweat.<br/><br/>“Master? Could it be…”<br/><br/>She quickly stored the Blue Sky Sword and then rose into the air, flying towards the mountain peak.<br/><br/>“Master, why have you become like this?”<br/><br/>At the top of the mountain, Gu Yang was engaged in fierce battle with a Soul Monster, when suddenly a crisp voice sounded from the side, startling him.<br/><br/>He turned his head to look and saw a small green bird, about the size of a sparrow, its feathers incredibly beautiful.<br/><br/>Damn it!<br/><br/>What kind of monster is this?<br/><br/>He was taken aback, nearly slashing the bird with his sword.<br/><br/>A talking bird is in any case, eerie.<br/><br/>This moment of distraction almost cost him a hit from a sword.<br/><br/>The Soul Monster here is much stronger than the previous one. He dared not to let his guard down and quickly put some distance between them.<br/><br/>The Soul Monster stopped; it couldn’t leave the range of the mountain peak.<br/><br/>The little bird still followed him with an anxious tone, “Master, how did you become this weak?”<br/><br/>Gu Yang looked at the talking bird. Seeing that it called him master and had no intention of attacking, he still did not let his guard down.<br/><br/>“I am not your master. You got the wrong person.”<br/><br/>Such things could not be taken lightly. One may hide for a while, but not forever. When it found the truth, wouldn’t it slaughter him?<br/><br/>“It’s over, it’s over. Master must have had complications during his last Nirvana. He doesn’t even recognize me anymore.” The Blue Bird fluttered its wings, appearing in a frenzy.<br/><br/>Nirvana?<br/><br/>Hearing this, Gu Yang understood. The bird recognized him as its master because he had received some of the Phoenix bloodline when he broke through to the Divine Power realm.<br/><br/>“I say it again, I am not your master. And, are you… from the Monster Race?”<br/><br/>“I am ” The Little Green Bird suddenly halted, frantically saying, “Master, I seem to have forgotten a lot of things. It’s over, it’s over. Who am I? What is my name? Where am I?”<br/><br/>Looking at it being so tiny, Gu Yang thought, perhaps its brain capacity wasn’t big enough.<br/><br/>“Whoever you are, stop following me.”<br/><br/>At this moment, he noticed Su Ningyan flying over with a sword in her hand. He suddenly realized.<br/><br/>This Green Bird was summoned by her.<br/><br/>He was puzzled. The simulation last time clearly didn’t mention this weird little bird. Why did it suddenly appear this time?<br/><br/>Gu Yang flew towards the peak once again, using the Skyfire Extermination skill to decisively kill the Soul Monster.<br/><br/>He realized earlier that his fire is the nemesis of Soul Monsters, as long as he uses the Skyfire Extermination, he can easily dispose of it.<br/><br/>He stepped into the formation.<br/><br/>“Master, wait for me.” The little green bird swiftly flew onto Gu Yang’s shoulder, getting teleported to the ninth floor with him.<br/><br/>Upon seeing Gu Yang easily taking down a Soul Monster at the Golden Body stage third level, Su Ningyan had become numb. She immediately followed suit and entered the formation.<br/><br/>Upon reaching the ninth floor, Su Ningyan saw Gu Yang chasing the little green bird with a knife, but he wasn’t even able to touch a feather.<br/><br/>“Master, are you playing with me?” The Little Green Bird dodged while laughing cheerfully.<br/><br/>Gu Yang seemed genuinely annoyed and a layer of red flame appeared around him.<br/><br/>The little green bird suddenly inhaled sharply, slurping all the flames into its mouth. “Burp”, it let out a satisfied burp.<br/><br/>The Little Green Bird excitedly fluttered its wings,” Master, it’s delicious, I want more…”<br/><br/>Gu Yang silently sheathed his Phoenix Feather Knife and turned away.<br/><br/>The little green bird landed on his shoulder, “Master, give me more…”<br/><br/>A little bird acting spoiled to Gu Yang, no matter how you look, it is bizarre.<br/><br/>Without a word, Su Ningyan followed, her gaze sweeping over Gu Yang’s back.<br/><br/>Who exactly is Gu Yang, that a mysteriously unpredictable little bird would call him master?<br/><br/>His identity became even more enigmatic.<br/><br/>Still guarding the ninth floor was a Soul Monster at the Golden Body stage third level, only it was much stronger than the one on the eighth floor.<br/><br/>“Shut up.”<br/><br/>At last, Gu Yang could not bear the incessant chatter from the Green Bird on his shoulder and scolded it.<br/><br/>“Oh.”<br/><br/>At long last, it shut its mouth.<br/><br/>The world finally became quiet.<br/><br/>Just as Gu Yang was letting out a sigh of relief, barely two seconds later, it spoke again, “Master, are you finally willing to acknowledge me?”<br/><br/>“Master, help me name myself. I have forgotten my previous name.”<br/><br/>“Master, that thing looks disgusting. It is ugly to look at and stinks.”<br/><br/>“Master…”<br/><br/>Skyfire Extermination!<br/><br/>Gu Yang raised his hand and launched an incantation, all the True Essence inside his body surged out, transforming into a sea of red flames, fiercely falling onto the Soul Monster.<br/><br/>Go to hell!<br/><br/>PS: Third update, asking for monthly ticket.\t\t\t\t\t\t</div>", "images": {}, "success": true}