{"id": 188, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15131977.html", "title": "Chapter 188 - Chapter 188: 188 Kyushu Print", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 188 - Chapter 188: 188 Kyushu Print</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 188: 188 Kyushu Print<br/><br/>Translator: 549690339<br/><br/>At the same time, underneath the Qi Feng Pavilion, there was a massive underground palace. On top of it, there were several large glowing beads that illuminated the entire area as bright as daytime.<br/><br/>In the middle of the palace, there was a huge bronze cauldron engraved with intricate, ancient patterns and inscriptions.<br/><br/>Inside this large cauldron, a light blue flame was burning.<br/><br/>A sword, with an apparent crack at the tip, floated above the cauldron. Beneath the light blue flame, there was no change in the sword’s body.<br/><br/>Sitting next to the bronze cauldron was Su Ningyan, whose hands were placed on the cauldron. She channeled her True Essence into the cauldron, maintaining the flame inside it.<br/><br/>It was evident that she was utilizing the flame from the bronze cauldron to repair the Blue Sky Sword she had acquired from the Demon Suppression Tower.<br/><br/>Soon, Su Ningyan began to sweat.<br/><br/>Suddenly, footsteps echoed. A middle-aged, beautiful woman entered the hall and sat down next to the bronze cauldron, placing her hands on it.<br/><br/>The flame in the bronze cauldron flared up, and its color became lighter. The intensity of the flame had increased significantly.<br/><br/>Su Ningyan withdrew her True Essence, sat in place, and began to meditate to regain her energy for a moment before she recovered.<br/><br/>She asked, “How did the discussion go?”<br/><br/>The middle-aged beautiful woman answered, “She wants you to marry that young man.”<br/><br/>Upon hearing this, Su Ningyan’s face changed slightly, and she frowned, “What is she trying to do?”<br/><br/>First, she decided to rescue those trapped in the Secret Realm who had reached the Divine Power realm. Now, she wanted Su Ningyan to be married to Gu Yang.<br/><br/>What was her true game plan?<br/><br/>The middle-aged woman stated, “You should know more about that than me. Don’t blame me for not reminding you, the young man has a deep connection with the Three Saints Sect. Try not to get too involved with him.”<br/><br/>Su Ningyan clarified, “I have absolutely no personal feelings for Gu Yang. She made this decision on her own.”<br/><br/>“Whether you do or not, only you know. From today, I will focus on the repair of the Blue Sky Sword. You should take care of yourself,” the middle-aged woman finished, closing her eyes.<br/><br/>Su Ningyan silently bowed and exited the grand hall.<br/><br/>Climbing a flight of stairs, it wasn’t long before a door appeared overhead.<br/><br/>The sound of a discussion was heard from above, she involuntarily stopped in her tracks.<br/><br/>“Saving Princess Chang and company?”<br/><br/>Just as Gu Yang expected, the empress indeed proposed this requirement. He stated, “The Empress undervalues me quite a lot, even the Divine Power realm experts of Divine City can’t do it. I’ve only recently made a breakthrough; I don’t possess such capability.”<br/><br/>The woman behind the bead curtain calmly stated, “Since you have mastered Wu Shengtian’s Heavenly Inquiry Nine Knives, naturally you have such ability.”<br/><br/>Heavenly Inquiry Nine Knives?<br/><br/>A thought struck Gu Yang’s mind; the third attack in this Saber Technique. If he can train it to cut through space, he might actually pull it off.<br/><br/>Continuing on, the Empress said, “If you are willing to help, you can pose any request to me. Regardless of whether it’s accomplished or not, I can satisfy your request.”<br/><br/>This deal is indeed reasonable.<br/><br/>Gu Yang contemplated for a moment, quickly making up his mind. He asked, “Does the Empress know that a thousand years ago, the nine princes of the Xia Dynasty each had a seal bestowed upon them by the Xia Emperor?”<br/><br/>“You must be talking about the Jiuzhou seal. Coincidentally, the palace has one.”<br/><br/>They actually have one?<br/><br/>Gu Yang was somewhat delighted. He only mentioned it to give it a shot, but he didn’t expect the palace to have one in its possession.<br/><br/>“I want that.”<br/><br/>“Someone, bring my command, go to the inner storehouse, and fetch out the Jiuzhou seal.”<br/><br/>In no time, a eunuch fetched a seal and placed it into Gu Yang’s hand.<br/><br/>The Empress asked, “Is this the item you requested?”<br/><br/>Gu Yang held the seal in his hand, a mysterious affinity building. He nodded and confirmed, “Indeed.”<br/><br/>“Then I will entrust you with the matter concerning the Secret Realm.”<br/><br/>“I’ll do my best.” Gu Yang didn’t promise anything definitively.<br/><br/>The Empress assigned a eunuch to accompany Gu Yang to the Duke’s mansion.<br/><br/>After Gu Yang left, Su Ningyan emerged and faced the sovereign of the harem, her gaze somewhat sharp. Coldly, she asked, “What are you trying to do?”<br/><br/>Facing her interrogation, the Empress wasn’t angered. She smiled and responded, “You should be getting married. I found a suitable husband for you, you should be thanking me.”<br/><br/>Su Ningyan sneered, “Does it seems like you’re the one falling love? Hmph, I warned you not to practice the Zhao Family’s Dragon Emperor Extreme Path. This technique has a huge flaw, yet you wouldn’t listen…”<br/><br/>The Empress laughed and said, “My dear sister, rest assured, I won’t fight you for a man. You heard it just now, he asked for the Jiuzhou seal, an excellent artifact created by the Xia Emperor. With all nine seals, one can reactivate the Jiuzhou grand formation.”<br/><br/>“For a thousand years, countless people have studied the Jiuzhou seal, unable to decipher its secret. It’s said that only the bloodline of the Xia Emperor can activate the Jiuzhou seal. This Gu Yang is mysterious, who knows, he could be of the Xia Emperor’s bloodline.”<br/><br/>“As a descendant of the Xia Emperor, he shares the same goal as you. What’s wrong with becoming Dao companions?”<br/><br/>Su Ningyan retorted coldly, “My affairs are none of your business. If there’s a next time, don’t say I didn’t warn you.”<br/><br/>Having said her piece, she turned and left.<br/><br/>In the Qi Feng Pavilion, only the Empress remained. A cold smile appeared at the corner of her mouth as she spoke to herself, “My dear sister, with your constant concern for the big picture, how can you compete with me?”<br/><br/>Inside the Duke’s mansion, twenty-odd experts at the Divine Power realm gathered together, discussing in pairs and trios about rescuing their loved ones.<br/><br/>A full day had passed since the incident occurred, and despite their lengthy discussions, no one had presented a viable rescue plan.<br/><br/>Without the activation of a certain method, forcefully opening the entrance to a Secret Realm was easier said than done?<br/><br/>For the vast majority of martial artists, the Secret Realm was a blind spot in their knowledge.<br/><br/>Even the most learned professors from the Academy who devoted their careers to researching the Secret Realm couldn’t find a solution.<br/><br/>Everyone realized that the chances of rescuing those trapped in the Secret Realm were extremely slim.<br/><br/>Moreover, among the trapped were two powerful beings at the Mana stage. It would be wiser to pin hopes on them breaking out of the Secret Realm themselves.<br/><br/>Professor Wang Yuanzhuo from the Academy, his face heavy with anxiety, said, “This is no average Secret Realm. It is almost like a tunnel to an alternative universe. Most likely, it was created by a powerful individual of the ancient Hollow Void realm, thus it cannot be cracked by brute force—not even at the Mana stage. The only ones capable are those who have mastered the Law of Space.”<br/><br/>He was a Golden Body triple-stage expert with the highest Cultivation Level among those present, as well as an expert in studying the Secret Realm.<br/><br/>The martial arts of today followed the traditions of the ancient practice of Qi refinement, focused on gradual progress. Divine Power stage was like the foundation building phase while the true understanding of “The Way” wouldn’t begin until reaching the Celestial Being realm.<br/><br/>The cultivation system was distinct from the one in the Xia Dynasty, where they could borrow the bloodline power of the Monster Race. From the Divine Power stage, they could already comprehend various divine abilities.<br/><br/>In terms of diversity in battle skills, the current Divine Power stage couldn’t even come close to comparing with that of the Xia Dynasty.<br/><br/>Someone then said, “Elder Wang, couldn’t we ask your Academy’s Headmaster for help?”<br/><br/>The one who spoke was Gao Minghai, the eldest son of the Gao family.<br/><br/>The Gao family had a Mana stage expert trapped in the Secret Realm, an unbearable loss for them. Gao Minghai was thus desperate for a solution.<br/><br/>Suddenly, many people chimed in, “Yes, we should request the Headmaster of the Academy to take action.”<br/><br/>The headmaster of the Academy was a celestial being and possibly the only one in Divine City who might be able to break into the Secret Realm.<br/><br/>Among those who echoed this sentiment was Guo Taiping.<br/><br/>The fact that his uncle was trapped in the Secret Realm made even a one in ten-thousand chance worth pursuing.<br/><br/>“Everyone, listen to me.”<br/><br/>As soon as Wang Yuanzhuo started speaking, all voices fell silent. He spoke with a touch of sorrow, “The deputy headmaster from our Academy is also trapped in the Secret Realm. The Headmaster is not unwilling to help, but rather incapable.”<br/><br/>Upon hearing his words, everyone went silent.<br/><br/>The atmosphere turned incredibly heavy.<br/><br/>All in all, seventeen people were trapped in the Secret Realm.<br/><br/>All present at the meeting were close friends and family of those seventeen.<br/><br/>Wang Yuanzhuo’s words effectively sounded a death knell for their loved ones, leading many to despair.<br/><br/>For the vast majority of powers, losing a Divine Power stage was a crippling blow, akin to the sky falling down.<br/><br/>Just as the atmosphere became overwhelmingly oppressive, a voice came from the entrance, “The Crown Prince of the Duke of the State has arrived.”<br/><br/>Hope immediately flickered in many eyes.<br/><br/>Indeed, they still had the Duke of the State, maybe he would have a way.<br/><br/>Compared to the Headmaster of the Academy, who remained in seclusion for decades, the Duke of the State was the true stabilizing presence in Divine City.<br/><br/>Soon, a dominating figure walked in. It was the Crown Prince of the Duke of the State.<br/><br/>A lady-in-waiting, filled with an imposing air, asked, “Where is the Duke, Crown Prince? Princess Chang’s life hangs in the balance, why has the Duke not shown up yet?”<br/><br/>The maidservant was from Princess Chang’s palace, and had kept silent before because the Divine Power stage individuals present weren’t court officials and wouldn’t respect a simple maidservant.<br/><br/>Upon seeing the Crown Prince, she finally found an outlet for her frustration. “If something happens to Princess Chang, can the Duke bear the responsibility?”<br/><br/>Being reproached as soon as he arrived, the Crown Prince’s expression turned cold. He responded, “My father’s old injury has flared up and he’s in seclusion. Regarding this matter, our house is powerless.”<br/><br/>After speaking, he turned around and left.<br/><br/>His words effectively extinguished the last glimmer of hope for those present.<br/><br/>In the crowd, Guo Taiping felt as if his mind buzzed loudly.<br/><br/>He knew that he was finished. His reckless actions leading to his uncle’s death was enough to lose the trust of his family, marking the end of his standing.<br/><br/>He would lose everything he possessed.<br/><br/>Just then, another announcement came from the doorway, “Nurse Qi and Gu Yang have arrived.”<br/><br/>Gu Yang?<br/><br/>On hearing this name, Guo Taiping felt an uncontrollable surge of murderous intent.<br/><br/>This was a natural reaction from the devil in his heart.<br/><br/>Very quickly, he suppressed the murderous intent with his powerful reason, and a suspicion was born in his mind, “What is he doing here?”<br/><br/>Nurse Qi was a trusted aide to the Empress, at the Golden Body triple stage. Why would Gu Yang arrive at the Duke’s mansion with her?<br/><br/>PS: Seeking monthly tickets for the first update.\t\t\t\t\t\t</div>", "images": {}, "success": true}