{"id": 185, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15131971.html", "title": "Chapter 185 - Chapter 185: 185 I Will Not Sell Myself", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 185 - Chapter 185: 185 I Will Not Sell Myself</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 185: 185 I will not sell myself<br/><br/>Translator: 549690339<br/><br/>No time left?<br/><br/>Gu Yang was intrigued by Ye Lingbo’s words and asked, “What do you mean?”<br/><br/>Ye Lingbo’s expression was somewhat serious, completely unlike when talking about love. She said, “Does Brother Gu know, that this world is about to face a big catastrophe!”<br/><br/>“Oh?”<br/><br/>Gu Yang was somewhat surprised, looking at her with a changed gaze.<br/><br/>He was too aware of any major future events.<br/><br/>In a decade, Star Luo Sect invades, and in twenty years, Wanxiang Gate comes again. For this world, it’s undoubtedly a huge disaster.<br/><br/>The question is, is this the crisis she refers to?<br/><br/>He asked, “What kind of catastrophe will it be?”<br/><br/>Ye Lingbo didn’t answer directly but asked another question, “Does Brother Gu know when the Four Great Sacred Lands appeared?”<br/><br/>“I don’t know.”<br/><br/>Ye Lingbo said, “A professor at the academy has searched through all history books, folk tales, and some litterateurs’ travel notes, discovering that the earliest rumors about the Four Great Sacred Lands were in early Qin Dynasty.”<br/><br/>“In all the documents of Xia Dynasty, there exist no records about the Four Great Sacred Lands.”<br/><br/>“Not just the Four Great Sacred Lands, but even Red Mansion, and the phrase ‘Nine Noble Clans’ only emerged after the Qin Dynasty.”<br/><br/>“Moreover, the Nine Noble Clans, including the royal family of the Qin Dynasty, have intricate ties with the Four Great Sacred Lands.”<br/><br/>“Most professors at the academy believe that the death of the Xia Emperor is related to the Four Great Sacred Lands. The extinction of the Xia dynasty suggests that the civilization of this world was already destroyed.”<br/><br/>“The martial arts system of today was all passed down from the Four Great Sacred Lands. It’s more similar to ancient Qi refining practices.”<br/><br/>“In the Xia Dynasty, the focus was mainly on body refining. However, this method of cultivation has been extinct.”<br/><br/>“One can imagine, in the Xia Dynasty, the martial artists must have been eradicated, otherwise, there would certainly have been a legacy.”<br/><br/>Ye Lingbo’s tone was very calm, but Gu Yang was stunned as he listened.<br/><br/>From the seal of King Qi, he obtained the “Nine Heavens Divine Method”, so he naturally knew what she was saying was the truth.<br/><br/>This method was indeed very different from the martial arts methods from today.<br/><br/>He had guessed that the Four Great Sacred Lands were likely invaders, but he had not thought deeply about the tremendous slaughter they had caused to this world.<br/><br/>No wonder there are so few records about the Xia Dynasty.<br/><br/>No wonder history books regard the Xia Dynasty as the middle ancient times.<br/><br/>The emergence of the Four Great Sacred Lands, for this world’s civilization, was a watershed that marked the beginning of a brand-new era.<br/><br/>After a while, Gu Yang asked, “So, how did the Four Great Sacred Lands come to this world?”<br/><br/>Ye Lingbo said, “This matter is related to the catastrophe I mentioned earlier. The president once said that this world contains some prohibitions left by the ancient times.”<br/><br/>“Some of these prohibitions are used to seal the Spatial Gates. A thousand years ago, the prohibitions loosened, the Spatial Gates opened and led to different worlds. These are the later Four Great Sacred Lands.”<br/><br/>“Now, a thousand years have passed. The president discovered that near the Divine City, a few ancient restrictions are loosening and may fail at any time. When that happens, the demise of the Xia Dynasty a thousand years ago will certainly be repeated.”<br/><br/>Gu Yang didn’t expect that the celestial being at the academy had indeed foreseen the invasions of Star Luo Sect and the Wanxiang Gate. Quite impressive indeed.<br/><br/>However, “What does this have to do with you wanting to become my Dao Companion?”<br/><br/>She’s been talking a lot, but still has not addressed the main topic.<br/><br/>“Your innate mortal body can convert the celestial energy in my body into innate energy. With the innate energy, I can quickly advance into the Celestial Being realm. To deal with the future crisis.”<br/><br/>Ye Lingbo finally revealed the true reason.<br/><br/>So she’s after my innate mortal body!<br/><br/>Gu Yang asked, “What’s the advantage for me?”<br/><br/>Ye Lingbo shook her head, “The celestial energy will place a tremendous burden on your innate mortal body. However, once I achieve the Celestial Being realm, I can naturally help you…”<br/><br/>“If you’re just trying to paint a rosy picture, forget it.”<br/><br/>Gu Yang lost his interest in listening and said, “Miss Ye, please return.”<br/><br/>She’s kidding, daring to make such a request for something that doesn’t benefit him.<br/><br/>Where does she get her confidence from?<br/><br/>As for Star Luo Sect and Wanxiang Gate, by the time they arrive, it will already be a decade or two later. By then, he probably would have already become a Celestial Being.<br/><br/>After Ye Lingbo left, Gu Yang sat in the courtyard and activated the system.<br/><br/>Earlier, in the Demon Suppression Tower, he had conducted a simulation.<br/><br/>[…You killed a disciple of the Nether Sect.]<br/><br/>[Half a month later, a powerful being at the Mana realm assassinated you, bringing your life to an end at the age of twenty-two.]<br/><br/>Gu Yang gazed at the last sentence, deep in thought.<br/><br/>Whom did this powerful being at the Mana realm belong to?<br/><br/>He went through the list of possible enemies. The most probable ones were the Red Venerate Sect and the Shen Family.<br/><br/>Both possessed the motive and the power to assassinate him.<br/><br/>“It seems… I need to find a powerful backer after all.”<br/><br/>Although he was now at the Divine Power realm, if a powerful being at the mana realm decided to ambush him, he would still be incapable of stopping it.<br/><br/>He could only conduct the simulation seven times. Breaking through to the Mana realm seemed unrealistic at this point.<br/><br/>The only solution left to escape this deadly fate was to find a powerful backer.<br/><br/>In Divine City, he didn’t have many options.<br/><br/>The Academy was out of the question. Ye Lingbo was lusting for his body, and to seek backing from the Academy, he would probably have to sell his body.<br/><br/>After careful consideration, his only option seemed to be the Empress.<br/><br/>Although her sister was unfeeling and heartless, the Empress herself was quite righteous.<br/><br/>[Simulation over. You can retain one of the following items.]<br/><br/>[1. The martial arts realm of yours at age twenty-two.]<br/><br/>[2. The martial arts experience of yours at age twenty-two.]<br/><br/>[3. The life wisdom of yours at age twenty-two.]<br/><br/>“I choose the second option.”<br/><br/>Gu Yang casually made a choice, after which a memory of a battle appeared in his mind.<br/><br/>While he was cultivating, he suddenly felt something wrong, and when he looked up, everything turned pitch black. Then, he had no more recollections.<br/><br/>“It’s the Shen Family!”<br/><br/>He was an old opponent of the Shen Family, and had faced off against their First Rank and Golden Body realm members before.<br/><br/>From this snippet of memory, he could tell that the person behind the attack was a powerful being at the Mana realm from the Shen Family.<br/><br/>A person at the mighty Mana realm, resorting to ambushing a rookie of the Golden Body realm, was truly shameless.<br/><br/>Gu Yang activated the system once again.<br/><br/>[Do you want to use the life simulator? Using it once will consume one unit of energy.]<br/><br/>“Yes.”<br/><br/>[At the age of twenty-two, you achieved the Golden Body, becoming the youngest one at the Divine Power realm. You made the Red Sun, the leader of the Red Venerate Sect, retreat outside the Divine City, and killed a disciple of the Nether Sect, sending shockwaves across the world.]<br/><br/>[The next day, you went to Yuzhou and found a jade slip in Shen Baiyi’s private residence. From it, you gained the inheritance of “Phoenix Dance Nine Heavens”.]<br/><br/>[Before you left Yuzhou, a powerful being at the Mana realm caught up with you. You launched the “Divine Phoenix Manual”, transformed into a phoenix, and fled to Tianzhu Mountain, entering a Secret Realm.]<br/><br/>[A few days later, the entrance to the Secret Realm was forcibly breached by someone, and you were killed on the spot. Your life ended at the age of twenty-two.]<br/><br/>This is outrageous!<br/><br/>Even after fleeing to the Secret Realm, he was found and his retreat was forcefully breached. How could that even be justified?<br/><br/>Gu Yang was a little frustrated, as this was equivalent to his last escape route being cut off.<br/><br/>But, thinking about it, he must have left too obvious a trail that allowed the individual from the Shen Family at the Mana realm to know that he had last disappeared at Tianzhu Mountain. Hence, they deduced that he must have hidden in the Secret Realm and managed to find him.<br/><br/>In other words, hiding in a Secret Realm wasn’t absolutely safe.<br/><br/>He’d have to learn from this lesson the next time around.<br/><br/>[Simulation over. You can retain one of the following items.]<br/><br/>“I pick the second one.”<br/><br/>PS: I need monthly votes for the first update.\t\t\t\t\t\t</div>", "images": {}, "success": true}