{"id": 184, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15131969.html", "title": "Chapter 184 - Chapter 184: 184 I Am Not A Frivolous Person (The Third Update, Monthly Ticket Needed)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 184 - Chapter 184: 184 I Am Not A Frivolous Person (The Third Update, Monthly Ticket Needed)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 184: 184 I am not a frivolous person (The third update, monthly ticket needed)<br/><br/>Translator: 549690339<br/><br/>Boom!<br/><br/>The four severed bodies suddenly exploded, and countless sticky black clouds burst open, rushing toward Gu Yang, completely obstructing his view.<br/><br/>Gu Yang did not dare to underestimate them. Gao Fan had warned him about the methods of the Nether Sect, and the malicious aura of these bodies was the most potent poison for those in the Golden Body realm. If infected, the consequences would be unthinkable.<br/><br/>He made no more reservations and released his True Essence. The red flames incinerated the black clouds.<br/><br/>When the black clouds disappeared, the figure of the Nether Sect disciple was gone.<br/><br/>“Trying to run?”<br/><br/>Gu Yang sneered, then darted in a certain direction in pursuit.<br/><br/>He had just slashed four bodies without gaining any energy.<br/><br/>He had fought here for quite some time, only for it to be in vain. How could he bear this?<br/><br/>The Red Venerate disciple of the Chi Zun sect was at the Mana realm, which he was not able to kill yet, so he could do nothing when they fled.<br/><br/>But, he couldn’t let this Nether Sect disciple escape.<br/><br/>“Escaped…? Escaped?”<br/><br/>Gu Yunfei was taken aback, “Uncle, didn’t you say that the guy from the Nether Sect is in the second stage of the Golden Body Realm?”<br/><br/>Gu Qingchuan was silent, looking in the direction where Gu Yang disappeared, sighing deeply after a while.<br/><br/>He knew that the chance of getting the Phoenix Feather Knife back from Gu Yang had become extremely slim.<br/><br/>The man had just broken through to Divine Power, yet he was able to scare off a second-order Golden Body disciple of the Nether Sect.<br/><br/>What’s worse, he kept revealing unexpected trump cards one after another.<br/><br/>Like that Blue Bird, it could swallow the Mana of powerfighters, which was unheard of before.<br/><br/>Who knows what other means he still has hidden?<br/><br/>Gu Qingchuan suddenly made up his mind that once he returned, he would no longer care about the Phoenix Feather Knife and would devote himself to retreat. Until he broke through to the Mana realm, he would not leave.<br/><br/>“Let’s go!”<br/><br/>After this thought, he carried Gu Yunfei and flew back to the city without hesitation.<br/><br/>“Damn, how could there be such a terrifying Golden Body Realm one? It’s simply against the natural order.”<br/><br/>Tens of miles away, Shang Qinglin felt like he had an unfortunate encounter with such an unreasonable person.<br/><br/>The malicious aura had no effect on that boy, which left him at a loss.<br/><br/>He was very clear that his Cultivation Level was bestowed by his master, and it was slightly shorter compared to those who were genuinely at the second stage of the Golden Body Realm.<br/><br/>He dared to hunt the Golden Body Realm practitioners.<br/><br/>One was relying on the malicious aura that specifically restrains those in the Golden Body Realm.<br/><br/>The second was relying on his four malicious corpses.<br/><br/>These four malicious corpses had been refined in the Black Soul Valley. Although they lost their original True Essence after their death, their Mortal Bodies had been further refined, comparable to the second stage of the Golden Body Realm.<br/><br/>With these two advantages, he could gain the upper hand against practitioners at the first and even second stage of the Golden Body Realm.<br/><br/>However, today, he encountered a freak like Gu Yang.<br/><br/>The boy’s True Essence was as powerful as Mana, capable of annihilating the malicious aura.<br/><br/>His saber technique was extremely horrifying, cutting the four malicious corpses in half with a single slash.<br/><br/>That was equivalent to a Golden Body at the second stage, yet under his saber, it was like cutting through tofu.<br/><br/>Where’s the justice in that?<br/><br/>Shang Qinglin almost wet his pants out of fright.<br/><br/>He was also only at the second stage of the Golden Body Realm, so he couldn’t withstand that boy’s single slash either.<br/><br/>Just now, he had feigned a retreat to deceive the enemy and made it seem like he was getting ready for a desperate fight, but in reality, he slipped away.<br/><br/>Shang Qinglin thought fearfully, “This boy will inevitably become a great enemy of my sect. I must return to the Black Soul Valley and report it to my master -”<br/><br/>Just as he was thinking, he looked up and froze.<br/><br/>There in front of him was Gu Yang, who remarked, “You run pretty fast.”<br/><br/>“Spare me, sir…”<br/><br/>Shang Qinglin felt weak in the knees and knelt down to beg for mercy.<br/><br/>Gu Yang was taken aback; he had never seen such a spineless warrior.<br/><br/>Let alone the fact that this was a Divine Power Realm strong man, his Cultivation Level was even higher than his own.<br/><br/>Could it be that he wanted to dull his vigilance and look for a chance to counterattack?<br/><br/>Gu Yang stared at him and asked, “Why do you think I will spare you?”<br/><br/>“I know a big secret of the Nether Sect. If you spare my life, I will tell you everything honestly.”<br/><br/>“I’m not interested in the secrets of the Nether Sect.”<br/><br/>“Young Master, it’s a secret to ascending to Celestial Being!”<br/><br/>“Celestial Being?”<br/><br/>Gu Yang looked him up and down, laughed coldly, and said, “Even you know the secret of ascending to Celestial Being?”<br/><br/>Seeing his disbelief, Shang Qinglin became anxious, “It’s true, I swear, if I deceive the young master, let me be struck by nine thunderbolts, and die horribly.”<br/><br/>Gu Yang didn’t believe such things. He slowly raised the Phoenix Feather Knife in his hands.<br/><br/>Shang Qinglin felt his murderous intent. In the terror of death, he disregarded everything else and hurriedly said, “In the Black Soul Valley, there’s a corpse of a Celestial Being. All you need to do is to refine this corpse into an evil corpse, then use the reincarnation method to attach your Original Spirit to the evil corpse, and you can accomplish—”<br/><br/>Shh!<br/><br/>Gu Yang beheaded him with a single strike.<br/><br/>[You have obtained two units of energy. Your current energy quantity is: seven.]<br/><br/>Huh?<br/><br/>It’s two units of energy.<br/><br/>His eyes brightened, he didn’t expect that killing a martial artist from the Golden Body Realm Second Level could gain him two units of energy.<br/><br/>During the Demon Suppression Tower times, whether it was a Soul Monster of the Golden Body Second Level or the Golden Body Third Level, there was only one unit of energy. What triggers the system’s mechanism is still unclear.<br/><br/>Anyway, it’s a good thing.<br/><br/>Wonder if killing a martial artist from the Golden Body Third Level will gain more energy?<br/><br/>“No no no, how can I harbour such evil thoughts?”<br/><br/>Gu Yang reminded himself inwardly, warning himself, “If this continues, sooner or later I will become a big demon who kills innocents. Unless, someone wants to kill me, and I am forced to fight back in self-defense. That would be justified.”<br/><br/>He looked at the corpse on the ground, contemplating the man’s words earlier.<br/><br/>There’s a corpse of a Celestial Being in the Black Soul Valley.<br/><br/>If he remembers correctly, Black Soul Valley is a dead place, it seems that the Nether Sect has already occupied this place.<br/><br/>So, the two Unleaking Realm powerhouses from the Nether Sect must have encountered fortuitous opportunities in the Black Soul Valley, allowing them to make a breakthrough.<br/><br/>Those two oldies had been in a closed state for years, only to refine the Celestial Being’s corpse, hoping to step into the Celestial Being Realm in just one magic stroke.<br/><br/>This disciple of the Nether Sect, he wanted to move him by such a secret, it’s just laughable.<br/><br/>Gu Yang could take a prosperous path, yet he chose to take this wicked path. Is he stupid?<br/><br/>He casually dug a hole, buried the corpse, and then flew towards Divine City.<br/><br/>When Gu Yang returned to Tianxin Martial Arts Hall, he didn’t alarm anyone.<br/><br/>As he walked into the courtyard, he was surprised to find that someone was already waiting at the entrance.<br/><br/>It was a woman, dressed in a moon-white robe, with an ethereal temperament, looking so beautiful as if unaffected by the mortal world. Standing there, she looks like a deity.<br/><br/>Seeing this woman, a phrase flashed in Gu Yang’s mind – “A fairy descending to the mortal world!”<br/><br/>Ranked third on the Beauty List, chief disciple of the Literature Academy, Ye Lingbo.<br/><br/>What does she want from me?<br/><br/>Gu Yang found it rather peculiar.<br/><br/>At this moment, Ye Lingbo sensed his presence, turned around, and greeted him, “Ye Lingbo from the Literature Academy greets Brother Gu.”<br/><br/>“Hello there. Please come in.”<br/><br/>Out of politeness, Gu Yang invited her in, and sat down in front of the stone table in the yard.<br/><br/>He couldn’t help but glance towards the back. The government house over there—so lively.<br/><br/>At least twenty Divine Power Realm, even more than the ones in the morning.<br/><br/>Gu Yang brewed some tea and directly asked, “I wonder why Fairy Ye came to see me?”<br/><br/>Ye Lingbo looked at him with clear eyes and revealed the purpose of her visit, “I want to invite Brother Gu to be my Dao Companion.”<br/><br/>Gu Yang nearly spit out his mouthful of tea.<br/><br/>Looking at her serious face, she did not seem to be joking at all.<br/><br/>Of course, from the vibe she gave, she didn’t look like a person who would joke.<br/><br/>He couldn’t help but touch his face, “Turns out, I am so attractive?”<br/><br/>First, it was Princess Chang, who started flirting after exchanging just a few words.<br/><br/>In the simulation, Miss Su Er was also madly in love with him.<br/><br/>Now, Ye Lingbo is over the top, she wants to become his Dao Companion at the first meeting.<br/><br/>If this isn’t attractiveness, then what is it?<br/><br/>Gu Yang solemnly said, “I am not a promiscuous person.”<br/><br/>Wanting to become his Dao Companion right off the bat, what kind of person does she think he is?<br/><br/>Ye Lingbo replied, “I know, this is a bit abrupt. However, we don’t have time.”<br/><br/>PS: It’s Monday again, asking for monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}