{"id": 187, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15131975.html", "title": "Chapter 187 - Chapter 187: Queen 187", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 187 - Chapter 187: Queen 187</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 187: Queen 187<br/><br/>Translator: 549690339<br/><br/>Being extremely brilliant, Su Ningyan observed Gu Yang’s cold demeanor this time, and quickly guessed the reasons behind it.<br/><br/>During their time in the Demon Suppression Tower, although he was also cold, he didn’t display such a distant attitude, as if keeping her a thousand miles away.<br/><br/>There must be some discontent in his heart towards her.<br/><br/>She bowed slightly, softly saying, “Mister Gu, I haven’t yet thanked you for saving my life. If not for you, I fear I might not have been able to escape from the Demon Suppression Tower.”<br/><br/>However, Gu Yang did not react at all, indifferently uttering, “There is no need for thanks, I simply saved myself.”<br/><br/>“Today, outside the city, my master grew overly concerned about my safety and left you alone to face the Red Sun. I have been extremely worried. Only when I heard that you demonstrated your divine power, driving back the Red Sun, my fears were finally laid to rest.”<br/><br/>“Are you finished?”<br/><br/>Gu Yang asked, “If you’re done, you may leave.”<br/><br/>Seeing his immovable attitude, Su Ningyan realized that continuing the conversation would be futile and with a sigh, she turned around and left.<br/><br/>Gu Yang did not dwell on this matter. After returning to his room, he began his first practice session after reaching the Divine Power Realm.<br/><br/>The night passed without words.<br/><br/>The next morning, when the first ray of sunlight fell into the courtyard, Gu Yang opened his eyes and shook his head inwardly.<br/><br/>After reaching the Golden Body Realm, cultivation had become slower than before.<br/><br/>It seemed that without the help of Spirit Fire, he had no idea when he would be able to reach the second level of the Golden Body Realm. The essence of this cultivation technique was quite grinding.<br/><br/>Thinking this, Gu Yang did not hesitate and ordered someone to fetch Cheng Xue.<br/><br/>“I need your help with something.”<br/><br/>Cheng Xue did not waste any words, firmly saying, “You just need to command, sir.”<br/><br/>“Help me find the jailer responsible for guarding the lowest level of the Sky Prison. He possesses an item just like this.” Gu Yang took out King Qi’s seal to show her.<br/><br/>During a Simulation, he had been locked up in the lowest level of the Sky Prison, where he obtained another seal from a jailer, which contained the inheritance of the “Divine Ape Technique.”<br/><br/>The cultivation of “Phoenix Dance Nine Heavens” was too slow. It would be best to have another option.<br/><br/>Examining the item carefully, Cheng Xue returned it to him.<br/><br/>“Purchase the item from the jailer. Keep this matter discreet and do not let anyone know about it until it’s in our hands.”<br/><br/>“I understand,” said Cheng Xue, and she left.<br/><br/>Gu Yang admired her straightforward and efficient style. Leaving this matter to her, he felt assured.<br/><br/>In the afternoon while Gu Yang was awaiting the return of Cheng Xue, he was visited by an unexpected person.<br/><br/>The visitor only said one sentence, “Follow me to the imperial palace.”<br/><br/>So Gu Yang obediently followed.<br/><br/>The visitor was none other than the Mana Realm expert who had battled the Red Sun outside the city the day before – Su Ningyan’s master.<br/><br/>Probably someone who had imprisoned him in the Sky Prison during one of the Simulations.<br/><br/>Even if he were to use the “Divine Phoenix Manual” to transform into a Phoenix, he wouldn’t be able to escape.<br/><br/>When dealing with such characters, it was best to cooperate.<br/><br/>Gu Yang was truly surprised that this Mana Realm expert would personally come to fetch him and take him to the palace – it seemed that he was to meet the Empress.<br/><br/>This made him very curious.<br/><br/>“Could it really be because of the matter Su Ningyan came to plead with me about last night?”<br/><br/>Gu Yang was quite bewildered. Whether it was Princess Chang or the Vice President of the Institute, both were in conflict with the Empress. Wouldn’t their deaths in the Secret Realm be beneficial?<br/><br/>Moreover, what made her think that he would be capable of rescuing them?<br/><br/>Before long, they arrived at the imperial palace.<br/><br/>It was a vast and ancient structure; its outer walls bore the markings of time.<br/><br/>This palace was at the heart of Divine City. It was due to the existence of this palace that Divine City earned its name.<br/><br/>Whether it was the Qin Dynasty or the Xia Dynasty that existed a thousand years ago, this site had served as the imperial palace for more than two thousand years.<br/><br/>It was a symbol of imperial power.<br/><br/>Under the guidance of the middle-aged beauty, Gu Yang stepped through the palace gates.<br/><br/>Instantly, he felt an invisible force field suppress all his True Essence. When he tried to mobilize his True Essence, it refused to move.<br/><br/>This left him a bit shaken. Although he had heard rumors about this from Wu Er, only after personally experiencing it did he truly understand its terror.<br/><br/>Legend had it that within the territory of the palace, an ancient Prohibition existed that prevented the use of one’s True Essence. Not even Celestial Beings were exempted.<br/><br/>Another feature of the palace was that any martial artist that managed to stay inside the palace for three years would adapt to the force field, rendering it unable to suppress their True Essence.<br/><br/>This unique property of the palace maximized the advantage of the home field.<br/><br/>Back in the day, an unparalleled Unleaking Realm powerhouse from the Wu Family only dared to strike when the emperor left the imperial palace for hunting.<br/><br/>If that emperor was in the palace, he had no chance at all.<br/><br/>The uniqueness of the imperial palace lies far beyond this.<br/><br/>Wu Er once mentioned that there were three special Qi currents within the palace. A single Qi current could birth an Unleaking Realm powerhouse.<br/><br/>In other words, there are at least three Unleaking Realm masters guarding this place.<br/><br/>Of course, cultivators who utilize these Qi currents will face extreme restrictions. Once they leave the palace, their cultivation level will rapidly decline to the point of total loss and subsequent death.<br/><br/>That’s the price to pay for taking shortcuts.<br/><br/>This explains why in a previous Simulation, the Unleaking Realm powerhouse guarding the Sword of the Human Emperor was surrounded and slain upon entering the palace.<br/><br/>Three against one, plus the home-field advantage, his death was far from unjust.<br/><br/>It’s no surprise that the royal line has managed to hold true power for hundreds of years without being overthrown.<br/><br/>Even if the last emperor died unnaturally and a prince without any cultivation level ascended the throne, the imperial authority remained stable.<br/><br/>Truthfully, Gu Yang felt quite uncomfortable with the suppression of his True Essence. It felt as if he were shackled.<br/><br/>At last, he was led to a palace named Da Ming Palace, a side hall called Qi Feng Pavilion.<br/><br/>After the introductions, Gu Yang finally saw the most powerful woman in the current court. Although she was separated by a beaded curtain, he could vaguely see her silhouette.<br/><br/>He couldn’t help but remember her extraordinary history. She came from a declining noble family, entered the palace at a young age, and soon won the emperor’s favor. Within a few years, she was promoted to queen.<br/><br/>Her ability to hold great power was closely linked to the emperor’s frequent illness.<br/><br/>The emperor, who is largely overlooked, also has a legendary history.<br/><br/>It is said that when he was young, he entered a Demonized Cultivation State during a training session and became a waste. He was the son the late emperor detested the most.<br/><br/>Originally, he was unable to ascend to the throne.<br/><br/>Who knew that Wu Da singlehandedly slaughtered his father, the emperor, all his fathers wives, and his numerous siblings.<br/><br/>He became the only surviving prince and naturally inherited the throne.<br/><br/>Of all the children the late emperor had, only the son he hated the most, and his beloved youngest daughter survived.<br/><br/>“Gu Yang, your attack yesterday broke the Mana barrier, saving not only me but also everyone present,” a pleasant and soothing voice interrupted Gu Yang’s thoughts. “I have decided to award you five hundred thousand taels of gold…”<br/><br/>“Wait!”<br/><br/>Gu Yang hurriedly interrupted her.<br/><br/>It has to be said, the queen’s investigation was very detailed; she even discovered his love for money.<br/><br/>But that was in the past.<br/><br/>He couldn’t use money to recharge anymore, what use did he have for so much gold?<br/><br/>He spoke righteously, “I’ve heard that the court is facing financial difficulties recently. It’s better to use this gold for state affairs.”<br/><br/>He had heard this piece of news from Cheng Xue.<br/><br/>The queen took control of the Four Sea Bank, intending to use its funds to fill the fiscal deficit of the court.<br/><br/>This wasn’t a secret in the Divine City.<br/><br/>“Oh?”<br/><br/>The queen seemed surprised, “How rare for you to be concerned about state affairs. Alright, if that’s the case—”<br/><br/>She hesitated, “I have decided to marry you to my sister—”<br/><br/>What?!<br/><br/>“No,” Gu Yang blurted out.<br/><br/>The queen’s tone instantly hardened, “Why, do you think my sister is not good enough for you?”<br/><br/>The royal prison!<br/><br/>Gu Yang immediately remembered the fate that awaited those who refused the imperial marriage in the Simulation, and quickly said, “To be honest, I already have someone in my heart.”<br/><br/>“I see.”<br/><br/>The queen’s tone softened, “No harm. It’s common for a real man to have a few spouses. I don’t mind letting my sister be a concubine.”<br/><br/>Wait, what?!<br/><br/>Would it be right to betray your own sister like this?<br/><br/>Gu Yang wanted to say that he did mind, but he remained silent.<br/><br/>He realized now that this woman was bent on becoming his aunt-in-law, using such means to tie him to her boat, and she would not allow him to refuse.<br/><br/>This woman, who had tidied up all the ministers opposing her and taken control of everything in such a short time, was not without reason. She was ruthless, willing to sacrifice her own sister to tie him to her side.<br/><br/>Forget it, as soon as he gets through the disaster that is the Shen Family, he could just run away. Did she really think she could bind him like this?<br/><br/>For now, he would endure a little bit of disadvantage.<br/><br/>PS: Third update, asking for monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}