{"id": 183, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15131967.html", "title": "Chapter 183 - Chapter 183: Nether Sect 183", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 183 - Chapter 183: Nether Sect 183</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 183: Nether Sect 183<br/><br/>Translator: 549690339<br/><br/>“It’s over.”<br/><br/>Upon seeing Red Sun fleeing in defeat, a feeling that Gu Yunfei couldn’t quite put into words welled up inside him.<br/><br/>Ever since he witnessed Gu Yang entering Hidden Dragon List months ago, he had been following his legendary journey with great interest.<br/><br/>Today was the first time he had met Gu Yang in person, and he did not disappoint. Not only had he shattered the conspiracy of the Red Venerate, but he also managed to escape from the Demon Suppression Tower.<br/><br/>Lastly, he used an odd bird that had frightened away a practitioner at the Realm of Mana.<br/><br/>Even his life was saved by Gu Yang.<br/><br/>Not just him, everyone in the residence of the emperor’s wife today owes Gu Yang a debt of gratitude.<br/><br/>“Uncle?”<br/><br/>Gu Yunfei noticed that his great-uncle seemed to have no intention of leaving. Just as he was becoming puzzled, he sensed a terrifying presence that made his heart jump.<br/><br/>Sudden changes appeared!<br/><br/>Four figures emerged suddenly from the ground, surrounding Gu Yang from four directions.<br/><br/>These four people showed no signs of life, and their expressions were stiff. Their eyes were bloody red, but their breath was extremely terrifying. It was clear that they had reached the Golden Body Realm.<br/><br/>“What the hell are these things?”<br/><br/>Gu Yunfei was extremely shocked. These four people gave him an eerie feeling and he instinctively felt frightened.<br/><br/>The figure at the front, his great-uncle, said indifferently, “Those are Evil Corpses, the people from the Nether Sect are here as expected.”<br/><br/>Not just him, even the Divine Realm practitioners at the city wall appeared to have no intention of leaving. It seemed like they had anticipated the arrival of the Nether Sect from the beginning.<br/><br/>Everyone present had their own thoughts. No one spoke, waiting to see how Gu Yang would respond.<br/><br/>“I’ve been waiting for you.”<br/><br/>Gu Yang lifted his head and looked above him.<br/><br/>There was another person above, wearing a black cloak, with pale skin, thick dark circles under his eyes, and was skinny like a skeleton, looking extremely creepy.<br/><br/>This man looked at Gu Yang, and his eyes were emitting a green light. He appeared as if he was looking at a rare treasure. Blood flowed onto his pale face and he excitedly said in his hoarse voice, “An Innate Body! This time I’ve picked up a treasure, it wasn’t a waste waiting outside the Divine City for years, hahaha…”<br/><br/>“Innate Body?”<br/><br/>The practitioners at the Divine Realm present had not heard this term before. However, it must be extremely precious to make a disciple of the Nether Sect so excited.<br/><br/>Could it be the secret behind Gu Yang’s rapid cultivation progress?<br/><br/>Only Ye Lingbo was shocked when she heard those four words.<br/><br/>She grabbed the sleeve of the teacher in front of her and whispered, “Master, save him, please!”<br/><br/>The professor of the Academy turned to look at her, sighed, and said “That disciple of Nether Sect is at second level of the Golden Body Realm, not to mention the additional four corpses at first level, I’m no match.”<br/><br/>This professor was just at first level of Golden Body Realm.<br/><br/>It’s not that the Academy doesn’t have any stronger individuals, but they all went to the residence of the emperor’s wife to rescue the Vice Dean.<br/><br/>The vice-dean of the Academy, who was also a Mana Realm powerhouse, had been trapped in the Secret Realm.<br/><br/>Hearing this, Ye Lingbo couldn’t help but feel depressed.<br/><br/>The professor consoled her, saying, “But you need not worry. Someone will definitely take action.”<br/><br/>Ye Lingbo was somewhat puzzled. She had been engrossed in her cultivation for years, focusing solely on her training and paying little attention to the outside world. She was only vaguely familiar with the name Gu Yang.<br/><br/>Nevertheless, she trusted her teacher’s judgment.<br/><br/>The person the professor of the Academy was alluding to was indeed Gu Qingchuan. Among the people present, his cultivation level was the highest.<br/><br/>The Gu family’s treasured sword, the Treasure Sword, was currently in Gu Yang’s possession.<br/><br/>Given Gu family’s style, they wouldn’t likely demand it back forcefully.<br/><br/>So, now was the best opportunity. All they had to do was save Gu Yang, and there was no doubt that he would return the Treasure Sword.<br/><br/>Gu Qingchuan did indeed harbor this thought. He was waiting for the best opportunity to take action.<br/><br/>He was deemed the most outstanding talent in the Gu family after their ancestor. He was at the third level of Golden Body, just a step away from the Mana Realm.<br/><br/>Ever since he found out about the whereabouts of the family’s ancestral treasure, the Phoenix Feather Knife that was stolen a hundred years ago, there had been several discussions within the Gu family about how to retrieve the Phoenix Feather Knife.<br/><br/>Until now, no decision had been reached.<br/><br/>This matter was extremely delicate. Gu Yang’s background was a mystery. If they offended him, it might bring disaster to the Gu family.<br/><br/>If force wouldn’t work, then persuasion must be attempted.<br/><br/>Now was a once-in-a-lifetime opportunity.<br/><br/>Gu Qingchuan was ready to take action.<br/><br/>“Good eye.”<br/><br/>Gu Yang was a bit surprised; this was the first time someone had recognized that he possessed the Innate Body.<br/><br/>Even Wu Er and Gao Fan, those two mysterious old guys, hadn’t figured it out.<br/><br/>The Nether Sect, indeed, is not to be underestimated.<br/><br/>However, the other party’s gaze made his scalp tingle.<br/><br/>Might this damn person be some sort of pervert?<br/><br/>Feeling uneasy all over, Gu Yang drew his Phoenix Feather Knife, a surge of crimson fire shot up to the sky, and instantly broke through the pervasive black fog around him.<br/><br/>“Divine Power?”<br/><br/>Gu Yunfei was shocked by the overwhelming aura that he felt.<br/><br/>Just a short while ago, he hadn’t reached the realm of Divine Power yet.<br/><br/>Had he finally attained Divine Power after visiting the Demon Suppression Tower?<br/><br/>Gu Yunfei didn’t know what to say. For some, the chasm to achieving Divine Power seemed non-existent, they could break through it as if it were as easy as eating or drinking.<br/><br/>He suddenly remembered a fact. Gu Yang was only twenty-two years old.<br/><br/>Twenty-two years old and already in the realm of Divine Power!<br/><br/>He swallowed hard. Gu Yang might possibly be the youngest to have reached the realm of Divine Power since the rankings were established.<br/><br/>The previous record holder was Qin Wu, the ancestor of the Qin Family. He stepped into the realm of Divine Power at twenty-eight, earning the reputation as the most gifted in a millennium.<br/><br/>Now that record had been shortened to twenty-two years.<br/><br/>When Gu Yunfei thought of himself, who was already twenty-four and still far from First Rank, let alone Divine Power, he felt a sense of despair.<br/><br/>Those in attendance who were at the realm of Divine Power had already realized that Gu Yang had reached this level. They were still surprised at this moment.<br/><br/>The solidity of this young man’s True Essence was beyond comprehension, far from being a novice in the realm. Even those who had been in the realm of Divine Power for decades paled in comparison.<br/><br/>“How did this kid cultivate?”<br/><br/>“Huh?”<br/><br/>A disciple of the Nether Sect, Shang Qinglin, felt a sense of unease in his heart. Gu Yang’s True Essence somehow managed to block his omnipotent corpse energy.<br/><br/>Their Nether Sect’s ability to move unhindered in the world, striking fear into the hearts of countless others in the realm of Divine Power, relied on their use of this corpse energy.<br/><br/>This was the black fog that permeated the surroundings.<br/><br/>This corpse energy specialized in attacking the mortal body. Once it made contact with skin, the body would be infected, limiting movement, and ultimately causing loss of mobility.<br/><br/>Furthermore, the corpse energy was pervasive. It was very difficult to disperse it with True Essence alone.<br/><br/>Only those in the Mana Realm could stand fearless against the corpse energy.<br/><br/>Earlier, Shang Qinglin had spoken at length, wary of that strange Blue Bird while hoping to silently infect it with his corpse energy.<br/><br/>Who knew that Gu Yang’s True Essence would prove to be the nemesis of the corpse energy, burning as fiercely as fire.<br/><br/>“Kill!”<br/><br/>Seeing his plan thwarted, Shang Qinglin gave a stern yell and launched his attack.<br/><br/>The four corpse creations of the Golden Body Realm immediately sprang into action, all attacking Gu Yang at once.<br/><br/>After becoming corpse creations, their speed had taken on a ghostlike quality.<br/><br/>But no matter how fast they were, they weren’t faster than Gu Yang’s sword.<br/><br/>The first strike of the Heavenly Inquiry Nine Knives, Chaos Unleashed!<br/><br/>Presently, as he executed this move, its power surged more than tenfold.<br/><br/>It was only after he reached the realm of Divine Power that he was able to truly harness the might of this saber technique.<br/><br/>As he swung his saber, it was as if he was opening up the heavens and the earth!<br/><br/>Everyone present felt as if they were enveloped by the flash of his blade. There seemed to be nowhere to hide, nowhere to evade.<br/><br/>Several people instinctively drew their weapons, hoping to defend against it.<br/><br/>Even Gu Qingchuan, who was the most advanced in the cultivation level present, nearly drew out his blade.<br/><br/>As the light of the saber faded, many people’s backs were soaked in cold sweat. The way they looked at Gu Yang had completely changed—it was as if they were looking at a ghost.<br/><br/>Had he truly just broken through to Divine Power Realm?<br/><br/>Gu Qingchuan’s hand was on the hilt of his blade. As he looked at Gu Yang, a storm raged in his heart.<br/><br/>Even with that swing, he wasn’t entirely sure that he could have blocked it.<br/><br/>Part of this was undoubtedly due to the Heavenly Inquiry Nine Knives, an unmatched saber technique in the world. However, it also proved that Gu Yang’s strength was incomparable to that of a regular cultivator in the first realm of the Golden Body.<br/><br/>“No”<br/><br/>On the other end, Shang Qinglin groaned at the sight of Gu Yang splitting all of his corpse creations in half with a single swing. His heart ached as if it were bleeding.<br/><br/>Out of the four corpse creations, three were rewarded to him by his master after a battle eighteen years ago.<br/><br/>In all these years, he had only managed to acquire one more corpse creation.<br/><br/>He never expected that a novice Golden Body Realm cultivator would be able to destroy his corpse creations with a single swing of his blade.<br/><br/>“I will kill you!”\t\t\t\t\t\t</div>", "images": {}, "success": true}