{"id": 198, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15131997.html", "title": "Chapter 198 - Chapter 198: Catch A 198 In The Act", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 198 - Chapter 198: Catch A 198 In The Act</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 198: Catch a 198 in the act<br/><br/>Translator: 549690339<br/><br/>“Why would she mistake me for her father?”<br/><br/>Gu Yang held the girl in his arms, looking as if she had exerted herself too much and had fallen asleep. One of her hands still clung tightly to his shirt, as if afraid that he would suddenly leave.<br/><br/>He had the feeling that things were not as simple as they seemed.<br/><br/>It couldn’t be just because he had practiced the “Phoenix Dance Nine Heavens” and the “Divine Phoenix Manual” that she foolishly mistook him for her father, could it?<br/><br/>That birdlike creature might possibly make that mistake. But the girl in his arms was a powerful practitioner at the mana realm. She couldn’t possibly lack even that bare minimum of discernment.<br/><br/>He suspected that it was very likely related to that mysterious old man on Dragon Gate Island.<br/><br/>He remembered that after the old man had shot the drop of liquid from the phoenix gall into his forehead, he had said: “You will thank me in the future.”<br/><br/>That mysterious old man was unfathomably cryptic.<br/><br/>So much so, that Gu Yang even suspected the man might have been a Celestial Being. A person of such caliber would not act without aim.<br/><br/>Could it be that the drop of liquid in the phoenix gall possesses some special properties?<br/><br/>He had the feeling that he had been drawn into a huge conspiracy.<br/><br/>“Forget it, let’s leave here first.”<br/><br/>Gu Yang picked up the sword on the ground, glanced around and saw there was nothing of value nearby, activated King Qi’s seal, and a magic array once again appeared beneath his feet.<br/><br/>In the blink of an eye, Gu Yang was back in the original boudoir. He saw Miss Su Er and Ye Lingbo were also there.<br/><br/>This embarrassed him a great deal.<br/><br/>He showed an embarrassed but polite smile on his face: “What a coincidence, you guys are here too.”<br/><br/>Both women looked simultaneously at the girl in his arms, asking, “Who is she?” “What kind of person is she?”<br/><br/>Would you believe me if I said she is my daughter?<br/><br/>Gu Yang changed the subject, “I picked her up down there.”<br/><br/>Suddenly, Ye Lingbo’s gaze sharpened, “A member of the Monster Race?”<br/><br/>Upon hearing this, Miss Su Er took a closer look and indeed detected a faint non-human aura. After a moment of pondering, she said, “It seems she is a member of the Monster Race that was imprisoned by the royal family of the Xia Dynasty. The only ones who could have survived till now are the Longevity Race within the Monster Race.”<br/><br/>The Monster Race was extraordinarily blessed, especially some of their most powerful bloodlines, which were born with great power and lengthy lifespans. These were what the Longevity Race was.<br/><br/>Ye Lingbo recognized her bloodline’s aura and said, “It’s a Phoenix.”<br/><br/>Miss Su Er nodded, confirming her judgement. This place used to be the residence of King Qi, who had inherited the “Divine Phoenix Manual.” It was normal for a member of the Monster Race with Phoenix bloodline to be held captive in his house.<br/><br/>Gu Yang admired how they had deduced the girl’s origins in just a few words.<br/><br/>Ye Lingbo reminded him, “The Monster Race despises the Xia Emperor the most. As you’ve practiced the ‘Nine Heavens Divine Method,’ you’ll definitely be seen as an enemy by them.”<br/><br/>“She has survived for a thousand years and is at least at the level of Mana Realm. Keeping her by your side is too dangerous. It’s better to kill her and take her essence blood. If Brother Gu can’t bear to do it, I can.”<br/><br/>Gu Yang quickly said, “No need, thank you for your kindness, Miss Ye.”<br/><br/>Since Ye Lingbo didn’t press the matter further. She suddenly looked at him and exclaimed: “The second stage of the Golden Body?”<br/><br/>The attention was all on the girl in his arms just now. Only at this time did they realize that he had actually advanced to the second stage of the Golden Body, which startled them.<br/><br/>Miss Su Er took a closer look and indeed, his cultivation level had already reached the second stage of the Golden Body.<br/><br/>This speed of cultivation was simply unbelievable.<br/><br/>His breakthrough to the Divine Power realm was only three days ago.<br/><br/>Now, he had broken through again.<br/><br/>Was he still human?<br/><br/>Suddenly, she remembered a rumor that Gu Yang was the reincarnation of a great power from ancient times, and that’s why his speed of cultivation was faster than usual.<br/><br/>Initially, she thought this rumor was very absurd.<br/><br/>Now, she felt it might be possible. Otherwise, why would his breakthroughs seem as easy as eating and drinking? This was no longer something that could be explained by talent.<br/><br/>Other Divine Power realm cultivators would spend eight to ten years to break through a minor realm, and that would be considered fast.<br/><br/>Yet Gu Yang had only used three days!<br/><br/>Three days was far from enough for others to consolidate their realm.<br/><br/>Gu Yang nodded, “Yes, I have something else to do, I’ll go first.”<br/><br/>After saying that, he quickly slipped away.<br/><br/>When Gu Yang returned to the Tianxin Martial Academy next door, Gao Fan was still in his courtyard, studying the Wutu Divine Cauldron.<br/><br/>He was almost obsessed with this divine cauldron, not leaving it since he returned three days ago.<br/><br/>He didn’t react at all as Gu Yang passed by him.<br/><br/>Gu Yang went back into the room, laid the girl in his arms on the bed, gently pried open her hand gripping his clothes, then left the room.<br/><br/>He opened the system, claiming the reward from the last simulation.<br/><br/>He suddenly had a wild thought at the three options, “If I choose option one, will my cultivation level regress to the first level of the Golden Body?”<br/><br/>Of course, it was just a thought. He wouldn’t do something so suicidal.<br/><br/>“I choose option two.”<br/><br/>An enormous amount of martial arts experience suddenly filled Gu Yang’s mind.<br/><br/>It took him more than half an hour to completely digest all these experiences.<br/><br/>Although he only lived for ten years in this simulation, it was the most rewarding one so far.<br/><br/>He was very surprised.<br/><br/>However, after careful thought, he realized he and Ye Lingbo stayed hidden in the Secret Realm for eight years, until she broke through to the Celestial Being realm. During this time, her continuous guidance naturally led to immense gains.<br/><br/>Gu Yang immediately started another simulation.<br/><br/>This time, having obtained several energy cells from the Long Autumn Palace and the Premier’s Mansion, he had ample energy. He wanted to see what changes would be brought about by the addition of a “daughter”.<br/><br/>“At the age of twenty-two, you have reached the second level of the Golden Body, shaking the world.”<br/><br/>“In a certain prohibition, you saved Xi Huang, who mistook you as her father and followed you.”<br/><br/>“Two months later, the Cao family sent a mana realm powerhouse to bring you back to their family. Xi Huang, who had restored her cultivation, fought with divine power and repelled him.”<br/><br/>“Half a year later, the Shen family’s patriarch led two mana realm powerhouses to capture you and Xi Huang.”<br/><br/>“Two months later, you were taken to a cave world. From then onwards, you were forced to input True Essence into a stone every day.”<br/><br/>“Five years later, your essence nearly depleted, you were killed along with Xi Huang for your essence blood. You died at the age of twenty-eight.”<br/><br/>Just as he thought, the difficulty level had increased.<br/><br/>Gu Yang knew that with every breakthrough in his cultivation level, the enemies he encountered would grow stronger.<br/><br/>This time, not only did the patriarch of the Shen family personally appear, he also brought along two mana realm powerhouses. The renowned strength of one of the Nine Great Clans was indeed extraordinary!<br/><br/>Such a force was simply unstoppable without the intervention of the Dean of the Academy.<br/><br/>No doubt, it was the appearance of that “daughter” that caused the Shen family to make such a grand move.<br/><br/>The oppression from the Three Holy Sect also became fiercer. Last time, he managed to hold on for ten years, but this time, he could only hold out for five years. After killing him, they even extracted his essence blood.<br/><br/>They really didn’t leave any room for survival.<br/><br/>“Simulation ends. You can keep one of the following rewards.”<br/><br/>“One, the martial arts realm at the age of twenty-three.”<br/><br/>“Two, the martial arts experience at the age of twenty-eight.”<br/><br/>“Three, the wisdom of life at the age of twenty-eight.”<br/><br/>No need to even consider option one, he chose option two directly.<br/><br/>Gu Yang’s mind was once again filled with countless martial arts experiences.<br/><br/>“Let’s go again.”<br/><br/>“At the age of twenty-two…”<br/><br/>“Two months later, a mana realm powerhouse from the Cao family comes to take you to the Cao family. You successfully awaken Cao Yiyi.”<br/><br/>“As soon as Cao Yiyi awakens, she takes you through the void to the Wanxiang Cave Heaven. She then destroys the abnormal treasure, making it impossible for you to leave.”<br/><br/>“You find a place to settle down, and two years later, disciples from the Wanxiang Gate try to take you back to the Sect. You fight your way out.”<br/><br/>“With Cao Yiyi’s capability, you hide and run. Ten years later, you are finally surrounded by several mana realm powerhouses from Wanxiang Gate. With nowhere to escape, you are finally captured.”<br/><br/>“You are taken to the Wanxiang Gate and interrogated. Afterward, your cultivation is sealed and you are locked up in the Black Prison.”<br/><br/>“Two years later, a riot breaks out in the Black Prison. You perish in the chaos, at the age of thirty-four.”<br/><br/>This time, he still couldn’t escape the fate of being brought into the Wanxiang Cave Heaven.<br/><br/>It seemed that it was intentional on Cao Yiyi’s part.<br/><br/>But why was he found by the Wanxiang Gate this time?<br/><br/>PS: It’s the 25th, remember to cast your monthly vote if you have one.\t\t\t\t\t\t</div>", "images": {}, "success": true}