{"id": 193, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15131987.html", "title": "Chapter 193 - Chapter 193: 193 Kidnapping The Bride", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 193 - Chapter 193: 193 Kidnapping The Bride</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 193: 193 Kidnapping the Bride<br/><br/>Translator: 549690339<br/><br/>After leaving the State Affairs Council, Princess Chang got into her carriage and took out a white porcelain bottle from her bosom. As she uncorked the bottle, an overwhelming wave of Spirit Qi spread out.<br/><br/>As she inhaled, a droplet of red liquid flew out of the bottle and fell into her mouth.<br/><br/>In an instant, some color returned to her pallid face.<br/><br/>She was severely injured in the Secret Realm by the mana of a dragon turtle. If it were not for her solid foundation, that assault could have easily taken her life.<br/><br/>Thanks to Gu Yang constantly transferring his True Essence to her, protecting her vital energy, she was able to hold on and save her life.<br/><br/>Even so, her injuries were severe. It would take several months for her to fully recover.<br/><br/>It was not easy to withstand an attack from a warrior of the Unleaking Realm.<br/><br/>The blood she ingested was the Essence Blood of the ancient Divine Beast, Bai Zhe, which had miraculous healing effects. No matter how grievous the injury, as long as there was a breath left in the body, it could bring one back to life.<br/><br/>By the time the carriage entered the palace doors, her injuries had already healed significantly, and some of the True Essence within her body had recovered.<br/><br/>Princess Chang headed directly towards Taiji Palace, to meet her royal brother.<br/><br/>Inside the Taiji Palace…<br/><br/>The emperor, uncharacteristically, wore his dragon robe and sat on the dragon throne. In one hand, he gripped the ancestral sword of the emperor, and in the other, he held the imperial jade seal, his demeanor formidable.<br/><br/>“Royal Brother…”<br/><br/>The moment Princess Chang walked into the Taiji Palace, she thought she saw her father.<br/><br/>She had always looked down on her weak royal brother, only resenting that she was not born male, otherwise, he would not have been the one to assume the throne.<br/><br/>The present state of Great Zhou, its decline, is due to this royal brother’s mistakes.<br/><br/>But in saying that, she bore some of the responsibility too.<br/><br/>These years, she had been focused on cultivation and paid no mind to worldly matters. Only when she achieved the Divine Power did she come out to find that the throne of Great Zhou was controlled by a woman.<br/><br/>On one hand, there was disappointment; on the other, she made a stand, defending the royal power.<br/><br/>It wasn’t until now that she saw her royal brother had, without hesitation, activated the grand formation to save her.<br/><br/>Others might not know, but she is well aware that once the grand formation is activated, one of the Qi veins in the palace will dry up, requiring a hundred years for recovery.<br/><br/>The Unleaking Realm expert who guards that Qi vein will also perish.<br/><br/>Activating the formation once will cause the loss of an Unleaking Realm warrior.<br/><br/>The cost is too high.<br/><br/>Princess Chang looked at her royal brother on the dragon throne, her feelings were complicated.<br/><br/>Seeing her safe return, the emperor was overjoyed, “I am glad you are safe.” After that, his whole person sagged as though deflating, his vitality seemed to fade.<br/><br/>Just now, it seemed as if he was spending his last bit of energy.<br/><br/>An attendant swiftly handed him an elixir, which he consumed.<br/><br/>Princess Chang moved her lips and said in a somewhat hoarse voice, “Royal Brother, take care of your health.”<br/><br/>The emperor coughed a few times, waved his hand, and said, “It’s just an old condition, it’s nothing. My Jade, don’t take risks moving forward. In future days, I will need you to support my useless sons.”<br/><br/>Seeing him steadying, Princess Chang sighed with relief. His words seemed like he was preparing for his own demise, which made her frown. Unwilling to continue with this topic, she changed the subject, “Royal Brother, I have a request.”<br/><br/>“Oh? What is it? Just say it.”<br/><br/>The emperor was curious, his sister had always been haughty and never asked him for anything.<br/><br/>“I ask for you to arrange a marriage for me.”<br/><br/>“You have fallen in love? That’s wonderful!” The emperor excitedly slapped his thigh. He coughed violently due to the over-excitement.<br/><br/>When he finally caught his breath, he said, “I approve.”<br/><br/>Princess Chang wanted to say something else, but suddenly she seemed to hear something. Her face changed and she said, “Royal Brother, I have some matters to attend to. Please excuse me.”<br/><br/>After saying that, she abruptly turned around and left.<br/><br/>After she left, the smile on the emperor’s face vanished. He extended a hand and quietly said, “Help me back to bed.”<br/><br/>“Yes.”<br/><br/>With the eunuch’s help, the emperor lay back down in bed and quickly fell asleep.<br/><br/>The entire resting chamber became so quiet that one could hear a pin drop.<br/><br/>Princess Chang stepped out of the Taiji Palace and marched toward the palace maid, asking furiously, “Is what you just said all true? Is she really going to marry her sister off to Gu Yang?”<br/><br/>“Absolutely. The envoy bearing the decree should be arriving at the Tianxin Martial Academy soon.”<br/><br/>The palace maid, who had served Princess Chang since her childhood, was trusted implicitly. After hearing the news, she immediately reported it to her in a special manner.<br/><br/>Princess Chang snorted coldly, “Without the decree of the inner cabinet, it won’t count.”<br/><br/>She had eyes and ears in the inner cabinet. Nothing about any decree could escape her.<br/><br/>The so-called decree of betrothal, which had not yet received the approval of the inner cabinet, could not be considered a decree according to procedure.<br/><br/>…<br/><br/>When Princess Chang arrived at the Tianxin Martial Academy, the eunuch had just finished reading the decree and was about to hand it to Gu Yang. She immediately shouted, “Wait.”<br/><br/>This stunned everyone present.<br/><br/>No one anticipated that there would be someone preventing Gu Yang from receiving the decree.<br/><br/>People hiding in the neighboring location looking at the awakening event spotted a woman of extraordinary beauty.<br/><br/>“What a disaster.”<br/><br/>Gao Fan, seeing that it was Princess Chang who had arrived, couldn’t help exclaiming.<br/><br/>He had witnessed the flirtatious exchanges between Princess Chang and Gu Yang at the national uncle’s residence just a while back.<br/><br/>This fellow seemed to attract females everywhere he went. It was the same in Jingzhou City, where several women circled him, with three of them from the Beauty List.<br/><br/>Now, he had only been in Divine City for a few days, and he had attracted both Princess Chang and the queen’s sister.<br/><br/>Let’s see how he will handle this.<br/><br/>“Isn’t that Princess Chang?”<br/><br/>The several people besides were also taken aback. Although they had not met Princess Chang before, they could guess her identity from her garments.<br/><br/>They were extremely puzzled about what Princess Chang was doing here.<br/><br/>Soon, they found out.<br/><br/>The eunuch in charge of announcing the imperial decree turned his head, and was surprised to see Princess Chang, “Your Highness, you…”<br/><br/>Princess Chang didn’t bother to exchange pleasantries with him. She snatched the decree from his hands, took a look, and said, “There is no imperial seal on it. This decree doesn’t count.” Saying this, she tore it to pieces immediately.<br/><br/>Everyone was stunned by this act.<br/><br/>The eunuch turned pale as he witnessed the destruction of the decree—it was issued by the queen herself. Princess Chang had publicly destroyed it, was she intending to fall out with the queen?<br/><br/>The others were equally shocked. It was no secret to the whole Divine City that Princess Chang and the queen were not on good terms. But both sides had been very restrained.<br/><br/>However, now that Princess Chang had publicly destroyed the queen’s decree, it was tantamount to slapping her in the face. Would the queen tolerate this?<br/><br/>Something massive had just occurred, and now it seemed that Princess Chang was going to war with the queen. When one wave subsided, another wave followed.<br/><br/>Then they heard Princess Chang say, “Gu Yang is mine. Whoever dares to covet him, don’t blame me for being impolite!”<br/><br/>Upon hearing her remark, everyone was dumbstruck.<br/><br/>It turned out she was here to claim her groom?<br/><br/>Princess Chang was fighting over a man with the queen’s sister.<br/><br/>This was sensational news.<br/><br/>Holy shit!<br/><br/>In Gu Yang’s mind, it felt as if ten thousand alpacas were running past.<br/><br/>Although he had some premonitions when this woman appeared, he was still stunned when she uttered those words.<br/><br/>He was reflecting on what exactly he had done.<br/><br/>One was the queen, the most powerful woman in Great Zhou, who insisted on marrying her sister to him.<br/><br/>The other was Princess Chang, the most noble woman in Great Zhou, who didn’t hesitate to fall out with the queen to marry him.<br/><br/>In the end, Gu Yang could only put it down to his damned charm.<br/><br/>PS: Third update, ask for orders.\t\t\t\t\t\t</div>", "images": {}, "success": true}