{"id": 194, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15131989.html", "title": "Chapter 194 - Chapter 194: 194 Two Divine Weapons", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 194 - Chapter 194: 194 Two Divine Weapons</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 194: 194 Two Divine Weapons<br/><br/>Translator: 549690339<br/><br/>In the end, the envoys sent by the Empress had to leave sheepishly. Against the powerful Princess Chang, they were left with no recourse but to report back to the palace.<br/><br/>However, what they brought was left behind.<br/><br/>Throughout the process, Gu Yang didn’t utter a word; he didn’t want to put himself at the risk of getting burnt.<br/><br/>In such a situation, regardless of what he said, it was possible to incur the hostility of those involved. One wrong move might risk offending people.<br/><br/>Worse still, he could end up offending both sides, leading them to bear a grudge against him out of affection. What a loss that would be.<br/><br/>The lady from the palace and the current Princess Chang both seemed to show signs of obsessive characters.<br/><br/>One insisted that he marry her sister upon their first meeting.<br/><br/>The other, after being saved by him, wanted to marry him. Earlier, she had claimed that any man who wished to be hers must reach the Unleaking Realm. Yet, she seemed to have voided this condition so quickly.<br/><br/>When everyone else had left, leaving him alone with Princess Chang, he finally spoke, “I am grateful for your deep affection, Your Highness, but I already have someone in my heart.”<br/><br/>Princess Chang asked, “Is the one you’re talking about that servant’s sister?”<br/><br/>Using true essence, Gu Yang secluded the surroundings to prevent anyone from eavesdropping. She didn’t hide her hostility towards the Empress in the least.<br/><br/>“No.”<br/><br/>“Then, is it Su Qingzhen? Xu Ruomei from the Sword Palace? Chu Xiyue from the Chu family? Or perhaps, the queen of Prince Jinghai?”<br/><br/>Good heavens, she’d named all the women in his life except Ling Ling. It seemed she’d thoroughly investigated him.<br/><br/>Gu Yang steeled himself and simply owned up. “You already know that there are so many women by my side, Your Highness. You should understand what kind of man I am. A hedonistic man like me isn’t one you can control. It’d be better to keep your distance, so you won’t get hurt in the future.”<br/><br/>“Good!”<br/><br/>A glimmer of admiration flashed in Princess Chang’s eyes. She clapped her hands in approval. “Just as I thought, the man I’ve taken interest in has gumption. Had you tried your best to distance yourself from those women, I would think less of you.”<br/><br/>“Rest assured, I have no intention of competing with them for a man. Only one thing is off-limits. You can marry anyone, but you absolutely must not marry that servant’s sister.”<br/><br/>Gu Yang was unsure of what to say in response, his eyes shifting towards the divine weapons placed next to him.<br/><br/>Princess Chang saw through his thoughts immediately. “You can keep those. After today, the whole Divine City will know that you are my man. I’d like to see if she dares to steal you from me right in front of everyone.”<br/><br/>Such a statement could be interpreted in different ways.<br/><br/>But indeed, considering her interference, the empress likely wouldn’t bring up the matter of marriage anymore. Doing so risked making the royal family a laughingstock.<br/><br/>However, this would also mean that his plan to align with the empress would be ruined.<br/><br/>Gu Yang voiced his difficulties. “To tell you the truth, I have a grudge against the Shen Family. They sent a mana-realm assassin after me. In a few days, they will likely come to kill me.”<br/><br/>“The Shen Family? It must be because of the ‘Phoenix Dance Nine Heavens,’ right?”<br/><br/>After a brief pause, Princess Chang replied, “I see, leave it to me. Wait a couple of days.”<br/><br/>With that, she turned around and left without any hesitation.<br/><br/>Gu Yang was slightly taken aback. From the sound of it, could she handle the Shen Family?<br/><br/>Whatever the case, he’d find out in a couple of days.<br/><br/>No sooner had Princess Chang left than Cheng Xue returned, having successfully acquired the Nine Provinces Seal, “Mission accomplished.”<br/><br/>Gu Yang took the seal with pleasure, praising, “Well done.”<br/><br/>Just then, Cheng Xue caught sight of the two divine weapons in his hand and, taken aback, exclaimed, “The Chasing Light Sword and the Shadow Chaser Sword?”<br/><br/>“You recognize these swords?” Gu Yang asked casually.<br/><br/>“These are a pair of famous divine weapons. Several decades ago, an extraordinarily loving couple each wielded one of these swords. When paired, they ranked first and second on the First Rank List. Their tales have been widely circulated. Sadly, none of their descendants lived up to their legacy. After the couple passed away, these divine weapons were sold off.”<br/><br/>From Cheng Xue’s story, it seemed the Empress had given him these divine weapons as a symbol of her good intentions.<br/><br/>As Gu Yang mulled over this, a prompt finally appeared, [Energy source detected, do you want to charge?]<br/><br/>His eyes lit up. If the weapons of this caliber could be used as energy sources, he couldn’t ask for more.<br/><br/>Cheng Xue bid him farewell shortly afterwards.<br/><br/>Gu Yang didn’t rush to charge the swords with energy. Instead, he first extracted the sword techniques within.<br/><br/>All divine weapons carried with them corresponding sword techniques.<br/><br/>The more powerful the divine weapon, the profound the sword technique it contained.<br/><br/>These two swords, the Chasing Light Sword and the Shadow Chaser Sword, are naturally inferior to the peerless divine weapons in the hands of the top ten Sword Saints. However, the sword techniques they contain are by no means mediocre, at least they belong to the Divine Power Realm.<br/><br/>Even if he doesn’t need them, he can give them to Cheng Tianxin. It would be a pity if such profound sword techniques were lost.<br/><br/>[Energy source detected, charge up?]<br/><br/>This time, Gu Yang directly chose “Yes.”<br/><br/>The sword in his hand vanished like before when he charged gold and silver.<br/><br/>[Charging successful, obtained one unit of energy, current energy quantity is five.]<br/><br/>Seeing the words “charging successful,” Gu Yang was overjoyed, as if he’d found a new direction in life.<br/><br/>Such a divine weapon could charge one unit of energy.<br/><br/>He wondered how many units of energy those ten unparalleled divine weapons could generate.<br/><br/>Gu Yang suddenly remembered that when he dealt with the treasures he got from the Lin Family’s secret vault, there seemed to be a divine weapon.<br/><br/>The divine weapons of this world, the vast majority of them, should be in the hands of these aristocratic families.<br/><br/>In the future, he would have to find a way from them.<br/><br/>Next, Gu Yang charged another divine weapon into the system, once again obtaining one unit of energy.<br/><br/>Meanwhile, in the Qi Feng Pavilion of the royal palace.<br/><br/>The queen heard about Princess Chang meddling in the marriage she had arranged for Gu Yang. She raised her eyebrows and said jokingly, “I didn’t expect that the proud Princess Yuzhu would also have feelings for a man.”<br/><br/>Nurse Qi, who was standing by, asked, “Your Majesty, how do we deal with this?”<br/><br/>“Deal with it? Should everyone watch and see how I quarrel with my sister over a man for Princess Chang’s sake? Let this matter pass.”<br/><br/>“Doesn’t this encourage her arrogance? If she continues to oppose you in everything, you can’t always give in.”<br/><br/>“It doesn’t matter. She’s the emperor’s most beloved sister. It’s only right that I give in a bit more.” The queen said indifferently, it was hard to figure out her true intentions.<br/><br/>She then said, “Go on my behalf to visit the emperor. I heard, he spit blood again.”<br/><br/>“Yes.” Nurse Qi exited the room.<br/><br/>The queen was left alone. She looked at the memorial in front of her, her eyes deep.<br/><br/>Today, too many things happened. Compared to the marriage, it was no longer significant. She had more important things to deal with.<br/><br/>She murmured, “Emperor, what are you really planning?”<br/><br/>Meanwhile, at the Long Autumn Palace.<br/><br/>Princess Chang returned to her chamber, dismissed everyone, and her expression suddenly turned serious. “Hmph, I almost died in the palace of the state uncle.”<br/><br/>A gloomy voice came, “It happened so suddenly that even if I had acted, I couldn’t have saved you.”<br/><br/>“If you hadn’t assured me that there was no problem with the treasure map, I wouldn’t have been tricked!”<br/><br/>After a while, the voice said again, “The map is indeed from a thousand years ago. Perhaps, the words were added later. There must be experts in the Red Venerate Sect. Even I was fooled. However, it was not a loss for you. You found a perfect gentleman.”<br/><br/>Princess Chang coldly said, “He is now being hunted by the Shen Family. As long as you can solve this problem, I can forget about what happened.”<br/><br/>After a while, the eerie voice said, “Agreed.”<br/><br/>Then, peace was restored in the chambers.<br/><br/>Princess Chang closed her eyes, started her energy circulation to treat her injuries.<br/><br/>Inside the Tianxin Martial Arts Hall, Gu Yang opened the system. With two units of energy gained, he could now confidently use the Simulator.<br/><br/>[Do you want to use Life Simulator? Each use costs one unit of energy.]<br/><br/>“Yes.”<br/><br/>[At the age of twenty-two, you have reached the first level of the Golden Body…]<br/><br/>[You have obtained the legacy from the Nine States Manual, practiced to the first level of the Divine Tiger Manual and Divine Turtle Manual…]<br/><br/>PS: The first update asking for monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}