{"id": 190, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15131981.html", "title": "Chapter 190 - Chapter 190: There Really Is A Treasure At 190", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 190 - Chapter 190: There Really Is A Treasure At 190</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 190: There really is a treasure at 190<br/><br/>Translator: 549690339<br/><br/>“Immediately evacuate everyone from the Guozhangfu.”<br/><br/>Zhou Zongye acted decisively, telling Wang Yuanzhuo. After Wang left, he stayed alone in the area, desperately trying to replenish the expended mana.<br/><br/>By now, the young man had flown out of sight, followed closely by the Turtle Beast, both of which were no longer visible.<br/><br/>Zhou Zongye’s face was serious. If an Unleaking Realm monster were to appear in the Divine City, countless people would die.<br/><br/>The best he could do at the moment was to evacuate the people nearby in order to minimize casualties.<br/><br/>In the Divine City, only the imperial palace possessed an Unleaking Realm expert. To kill this Unleaking Realm monster, they would need to lure it towards the palace.<br/><br/>But that was easier said than done.<br/><br/>After reaching the Unleaking Realm, even the most unperceptive monster would be imbued with wisdom, no less intelligent than a human.<br/><br/>What he was most worried about was if this monster were to alarm his mentor, the repercussions would be unimaginable.<br/><br/>Zhou Zongye’s heart was heavy.<br/><br/>Suddenly, he thought of the young man who had dashed into the Secret Realm and wondered why he would take such a risk.<br/><br/>“Senior Gao!”<br/><br/>After entering the Secret Realm, Gu Yang began to shout at the top of his lungs.<br/><br/>Behind him, the Turtle Beast pursued him mercilessly, as if it bore a deep grudge against him.<br/><br/>It went without saying that this was all because he had cultivated the “Nine Heavens Divine Method”, thus attracting such hatred.<br/><br/>This Secret Realm was likely bestowed to King Qi back in the day, and this Turtle Beast was probably captured by King Qi to extract its essence blood.<br/><br/>A cultivation method like the “Nine Heavens Divine Method” which required the essence blood of monsters, was doomed to initiate a death feud with the Monster Race.<br/><br/>The Turtle Beast might have assumed Gu Yang as a descendant of the Xia Emperor, an offspring of its enemy, hence, it naturally sought to kill him.<br/><br/>“Senior Gao!”<br/><br/>This Secret Realm was huge and boundless, crammed with lush vegetation and small animals. It had formed a complete ecosystem and still brimmed with life after being isolated from the outside world for a thousand years.<br/><br/>“Stop shouting!”<br/><br/>Suddenly, from a distance, Gao Fan’s irate voice rang out, “How did you manage to lead that thing here? Hurry up and go!”<br/><br/>Upon hearing this, Gu Yang immediately ascertained Gao Fan’s location and said, “Don’t worry, it can’t catch up with me.”<br/><br/>After saying this, he utilized the “Divine Phoenix Manual”, transformed into a Phoenix, and his speed proliferated, swooping away and disappearing in an instant.<br/><br/>“Roaaar!”<br/><br/>The Turtle Beast bellowed, hopping mad with frustration when Gu Yang disappeared, yet it didn’t concede and continued to move forward in pursuit.<br/><br/>Within no time, Gu Yang had already travelled hundreds of miles. He retracted the surrounding flames, reverted back to his human form, and landed on the ground.<br/><br/>Beneath him, Gao Fan watched in utter amazement, “The ‘Nine Heavens Divine Method’? Are you a descendant of the Xia Emperor?”<br/><br/>Aside from Gao Fan, there was one more person lying on the ground, Princess Chang.<br/><br/>“We should leave right away.”<br/><br/>Gu Yang, without any explanation, picked up Princess Chang from the ground and started to move quickly.<br/><br/>Gao Fan also realized that it was not the time for questions and quickly followed suit.<br/><br/>Gu Yang said, “Start the invisibility method quickly, the beast is about to catch up.”<br/><br/>Gritting his teeth, Gao Fan took out a charm and lit it with an anguished expression. Suddenly, an invisible wave enveloped the three of them and they disappeared without a trace.<br/><br/>A moment later, the Unleaking Realm Turtle Beast arrived at their previously location, only to discover that the targets were gone. Frustrated, it opened its mouth and unleashed a series of deep blue mana strikes on the ground.<br/><br/>The undergrowth blew up one after the other.<br/><br/>In the blink of an eye, the surroundings had been completely leveled by the Turtle Beast.<br/><br/>Tens of miles away, upon hearing the sound of explosions from behind, Gu Yang finally breathed a sigh of relief.<br/><br/>“My Divine Concealment Charm…”<br/><br/>Meanwhile, Gao Fan was still heartbroken over the used charm, lamenting, “That was the last one.”<br/><br/>It was a life-saving tool for him. Initially, he had three, but now all of them were used up in order to retrieve the Imperial Sword, which turned out to be a futile effort.<br/><br/>This was clearly a case of stealing a chicken without scraping a single grain of rice.<br/><br/>Gu Yang ignored his laments, looked at Princess Chang in his arms, and remarked, “You really have the devil’s own luck.”<br/><br/>Keeping one hand on Princess Chang’s back, he continued to transfer True Essence into her.<br/><br/>Princess Chang was heavily injured and barely breathing.<br/><br/>In the simulation, Gu Yang had been a step late. By the time he found Gao Fan, Princess Chang had already passed away with Gao Fan in poor condition himself.<br/><br/>Gu Yang saved her without any ulterior motives. Later, when he would negotiate with her for the Nine States Seal, it would seem natural.<br/><br/>Yes, the Nine States Seal was on her.<br/><br/>Gu Yang whispered, “Senior Gao, this Secret Realm is about to collapse soon. We need to leave as soon as possible.”<br/><br/>“No rush.”<br/><br/>Upon hearing this, Gao Fan quickly said, “I have found the treasure trove.”<br/><br/>Although this Secret Realm is actually a trap set by the Red Venerate and there does not exist the Human Emperor’s Sword, there is indeed a treasure hiding place in this Realm.<br/><br/>Is there still a treasure here?<br/><br/>Gu Yang was stunned for a moment.<br/><br/>There was no mention of this in the Simulation.<br/><br/>Also, in the Simulation, Gao Fan was seriously injured. Exactly how was he injured?<br/><br/>Gao Fan said, “The Concealing Symbol lasts for half an hour. We have plenty of time.”<br/><br/>He had lost three Concealing Symbols, so he must make up for it from somewhere else.<br/><br/>Gu Yang was convinced. Anyway, this Secret Realm would not collapse that quickly. It wasn’t a problem to hang in there for half an hour.<br/><br/>Before long, they arrived at the treasure trove that Gao Fan mentioned, which was a palace.<br/><br/>Even before Gu Yang approached, he felt the lethality everywhere in the palace. Obviously, there was a very strong prohibition at the entrance.<br/><br/>He finally understood how Gao Fan was injured in the Simulation.<br/><br/>He was evidently trying to forcibly enter the palace, and was injured by the prohibition above.<br/><br/>Gao Fan also sensed it and hesitated. Wanting to give up but feeling unwilling, he said, “The prohibition here is a bit tricky. Gu Yang, do you have a solution?”<br/><br/>Do I have any solutions?<br/><br/>Just as Gu Yang was about to shake his head, a thought struck him. He took out the seal of King Qi, and a red glow lit up on the seal. Accompanied by thunderous rumbling, the palace gate automatically opened.<br/><br/>It actually worked.<br/><br/>He had just thought that this palace should belong to King Qi. Maybe using the seal could open it.<br/><br/>And indeed, it opened upon trying.<br/><br/>Once the gate was opened, the prohibition above naturally disappeared.<br/><br/>Gao Fan was both surprised and delighted. “Gu Yang, you truly are my lucky star. Let’s go and see what treasures are inside.”<br/><br/>The two walked through the palace gate.<br/><br/>Inside was a grand hall, empty, with a huge bronze tripod in the middle. Besides that, there was nothing else.<br/><br/>Seeing the giant tripod, Gao Fan’s eyes nearly popped out, and he excitingly said, “Nine Divine Ding?”<br/><br/>He rushed forward and circled the giant tripod, becoming even more excited. “It really is the Nine Divine Ding…”<br/><br/>Recalling, Gu Yang seemed to have seen the record about the Nine Divine Ding in a history book.<br/><br/>This thing was said to have been handed down from ancient times. According to the books, this Nine Divine Ding is a symbol of imperial power. The Xia Dynasty had one, which was later taken by the Qin Dynasty.<br/><br/>After the Qin Dynasty collapsed, it fell into the hands of the Zhou Dynasty, staying around in the Altar of Heaven.<br/><br/>Not understanding, he asked, “Senior Gao, wasn’t it said that the Nine Divine Ding is in the Altar of Heaven? It is used by the royal family for worshiping heaven.”<br/><br/>Gao Fan, looking infatuatedly at the patterns on the giant tripod, replied, “The Nine Divine Ding originally had nine pieces. They were cast by Emperor Fu as the successor of the Human Emperor to suppress the fate of the Human Race. In total, there are nine. The one in the Altar of Heaven is just one of them.”<br/><br/>So that’s how it was.<br/><br/>Gu Yang asked again, “What’s special about this Nine Divine Ding?”<br/><br/>“This Nine Divine Ding is a supreme artifact, corresponding to the Yin Yang Five Elements Universe. When the nine tripods are gathered together, a peerless formation can be set up. In ancient times, Emperor Fu established the everlasting dominance of the Human Race by setting up this formation.”<br/><br/>“It’s a pity that later the Nine Divine Ding were all lost. The Xia Emperor only found one piece, which is the one at the Altar of Heaven.”<br/><br/>“If I’m not mistaken, this tripod is the Earthly Divine Ding.”<br/><br/>After hearing all this, Gu Yang understood a bit.<br/><br/>He guessed that after King Qi of the Xia Dynasty got this tripod, he secretly hid it here and did not dare to take it out till his death.<br/><br/>This thing is a symbol of imperial power. Naturally, he wouldn’t dare to let the Xia Emperor know about it. Otherwise, he would definitely have a tragic end.<br/><br/>As a result, this tripod had been left here for over a thousand years. If it weren’t for Gao Fan discovering this place, the final fate of this Nine Divine Ding would have been to get lost in the crevices of space forever following the collapse of the space.<br/><br/>Gu Yang said, “We’re running out of time. Quickly take this Ding and let’s leave.”<br/><br/>Gao Fan, who was initially overjoyed, all of a sudden seemed to have thought of something. His entire body felt like it was struck by lightning; his face turned pale.<br/><br/>The quick change of expression caught Gu Yang by surprise. “What’s wrong?” he asked.<br/><br/>Looking rather disoriented, Gao Fan said, “We can’t take it.”<br/><br/>“What do you mean?”<br/><br/>“Artifacts like the Nine Divine Ding have special activation codes. Without knowing the codes, we can’t move it an inch with our cultivation level. In such a short period of time, how could we decipher the codes on it?”<br/><br/>The idea of having such an artifact in front of his eyes but being unable to take it away almost suffocated Gao Fan with heartache.<br/><br/>After hearing this, Gu Yang gave it some thought, and felt that it was worth a try. He asked, “Where are these activation codes?”<br/><br/>Even though he didn’t have any hope, Gao Fan still told him the method.<br/><br/>Gu Yang set Princess Chang aside, then according to what he was told, placed both his palms on the giant tripod. Soon, he felt an ancient and long-lasting will from the tripod body. A set of mantras appeared in his mind, which was not long, but extremely profound.<br/><br/>Then, he activated the extractor.<br/><br/>[Use the Life Simulator? Using it once will consume one square of energy.]<br/><br/>“Yes.”<br/><br/>PS: The third update. Please vote for the monthly ticket.\t\t\t\t\t\t</div>", "images": {}, "success": true}