{"id": 195, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15131991.html", "title": "Chapter 195 - Chapter 195: 195 Unparalleled Divine Weapon", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 195 - Chapter 195: 195 Unparalleled Divine Weapon</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 195: 195 Unparalleled Divine Weapon<br/><br/>Translator: 549690339<br/><br/>[You have cultivated the second layer of “Divine Ape Technique”.]<br/><br/>[You moved into the academy, frequently discussing martial arts with Zhou Zongye, and perusing the academy’s collection of books.]<br/><br/>[Two years later, Nether Sect launched a massive assault, with two celestial beings besieging the academy. During this conflict, the Academy’s dean perished, Luo Wang arrived in time, and all the invading members of the Nether Sect were slaughtered.]<br/><br/>[You went to the imperial palace, seeking the protection of the empress.]<br/><br/>[One month later, an upheaval took place in the imperial palace. The empress passed away, a powerhouse in the Unleaking realm emerged and killed you, ending your life at the age of twenty-four.]<br/><br/>Really?<br/><br/>How did the empress die this time?<br/><br/>Gu Yang felt a significant discrepancy. The butterfly effect he had caused was having an increasingly significant impact on the future, rendering the timeline unrecognizable.<br/><br/>“Could it be Princess Chang’s doing?”<br/><br/>If there was any major change from the previous timeline, it was that he had saved Princess Chang’s life. Given her animosity towards the empress, she indeed had every reason to kill her.<br/><br/>“But why was I also killed?”<br/><br/>Could it be unrequited love that led to hatred?<br/><br/>With such scant information, it was truly difficult for him to make an accurate judgment.<br/><br/>[Simulation ended, you can select one of the following to keep.]<br/><br/>“I choose the first.”<br/><br/>Gu Yang’s body began to undergo drastic changes, an aura of absolute killing intent surged towards the sky, as he transformed into a white tiger.<br/><br/>A moment later, his aura changed again, permeating a cold atmosphere, he transformed into a Divine Beast that combined the features of a snake and a tortoise.<br/><br/>Finally, he transformed into a giant ape, even larger than the previous giant.<br/><br/>After a while, he changed back to his original form, feeling the changes in his body. His strength and the toughness of his mortal body had both amplified almost two-fold.<br/><br/>This was somewhat incredible to him.<br/><br/>His body perfectly fused the essence blood of four different Divine Beasts without any conflict.<br/><br/>Keep in mind, his body contained both the fire attribute Phoenix blood and the water attribute Black Tortoise blood. These two were inherently incompatible, yet in his body, a perfect balance was formed.<br/><br/>“The Nine Heavens Divine Method”, this technique was truly peak powerful.<br/><br/>If he could incorporate the essence blood of nine different Divine Beasts, to what degree would his mortal body become?<br/><br/>In the following days, the entire Divine City was still discussing the major event that had taken place. Although the incident had passed, it had far-reaching implications.<br/><br/>The number of powerhouses in the Divine Power Realm that entered the Secret Realm was seventeen, but only six managed to escape.<br/><br/>The death of eleven Divine Power Realm experts naturally led to some reshuffling of forces.<br/><br/>For top-tier forces, the death of one Divine Power realm expert might not cripple them. But for many noble families, it was a catastrophic event.<br/><br/>In addition to the dragon turtle that escaped from the Secret Realm that day, there was the large formation activated by the imperial palace.<br/><br/>For most citizens of Divine City, these were major unprecedented events.<br/><br/>Only the incident where the previous emperor and many consorts, princes, and nobles were killed twenty odd years ago could compare with this one.<br/><br/>At the same time, one topic that the common people enjoyed discussing was Princess Chang stealing her younger sister – the empress’s fiancé, who was none other than Gu Yang, the popular star of the day. This had added a touch of legend to the scandalous news.<br/><br/>However, none of these had any effect on Gu Yang.<br/><br/>In these few days, he had been staying in the courtyard, turning a deaf ear to the matters outside.<br/><br/>Until this day, the arrival of Princess Chang disrupted his peaceful life.<br/><br/>“The Shen family stated they will not pursue the matter, but they demand you return that technique to them.”<br/><br/>This was indeed good news.<br/><br/>Gu Yang pondered for a moment and thought it didn’t matter if he returned this technique to them. After all, he didn’t need it anymore. He didn’t believe that anyone else in this world could cultivate this technique except him.<br/><br/>He took out a pen and paper, wrote the location of the “Phoenix Dance Nine Heavens” on it, handed it to Princess Chang, and said, “That thing is at the location mentioned on this paper.”<br/><br/>Princess Chang took the paper, looked him up and down with some surprise, and said, “Why is your mortal body so powerful? You’re clearly only in the first layer of the Golden Body, but you’re not inferior to the second layer.”<br/><br/>“This is the breath of the Monster Race. Have you awakened the Monster Race’s bloodline?”<br/><br/>“No, it’s the ‘Nine Heavens Divine Method’! You actually have the Xia Emperor’s bloodline!”<br/><br/>Princess Chang quickly guessed the truth, and the way she looked at him suddenly changed. She suddenly grabbed his hand and said, “You come with me.”<br/><br/>Gu Yang asked, “Where to?”<br/><br/>“Long Autumn Palace.”<br/><br/>Long Autumn Palace is not far from the imperial palace. It used to be a royal villa, but a few years ago it was given to Princess Chang.<br/><br/>Considering it’s a palace, the scale is naturally extremely impressive. It’s even larger than the mansion of a national prefect.<br/><br/>Gu Yang shared a ride with Princess Chang.<br/><br/>He didn’t quite understand actually. They both could fly – why did they need to go by carriage? Not only was it slow, but there was also heavy traffic on the road.<br/><br/>However, as a guest, he wouldn’t object to the host’s preference. If Princess Chang chose to travel by carriage, he would accompany her.<br/><br/>Upon arriving at Long Autumn Palace, the two got off the carriage and walked inside.<br/><br/>Princess Chang was in high spirits and asked, “Do you know what this place was during the reign of the Xia Dynasty?”<br/><br/>“I don’t.”<br/><br/>“It used to be King Wei’s mansion.” Princess Chang revealed the answer. “The Xia Emperor had eight sons and one daughter in his life. They are the origin of the nine royal titles in the Xia Dynasty.”<br/><br/>“Among them, the only daughter was given the title of King Wei. The Nine Provinces Seal I gave you a few days ago is King Wei’s seal.”<br/><br/>After listening to her explanation, Gu Yang somewhat understood why she brought him to the Long Autumn Palace. He asked, “Is there another treasure hidden here?”<br/><br/>“There’s no treasure, I just need you to help open a door.”<br/><br/>It wasn’t long before Gu Yang saw that door.<br/><br/>Princess Chang led him to a basement, which was right beneath her sleeping quarters.<br/><br/>The basement was extremely spacious and seemed to have a formation engraved on the floor. As soon as he entered, he felt that it was different from the outside. The air was filled with some kind of special energy.<br/><br/>Gu Yang had an intuition – cultivation in this place would obviously be faster than the outside world. It was indeed a cultivation treasure ground.<br/><br/>That door was located at the very back of the basement.<br/><br/>Upon looking at the door, Gu Yang instinctively felt a sense of danger.<br/><br/>This reminded him of the prohibition on the entrance of the palace where he found the Nine Divine Ding in the Secret Realm. It seemed to be somewhat similar to this.<br/><br/>Suddenly, he had a thought. When he was at the national prefect’s mansion, by using King Qi’s seal, he had sensed a prohibition beneath the ground. Could it be like this place – a secret chamber?<br/><br/>At this moment, Princess Chang said, “There’s an old prohibition on this door that’s hard to break. The thing inside is very important to me, can you help me open it?”<br/><br/>Gu Yang replied, “I’ll give it a try.”<br/><br/>He took out the seal of King Wei, activated the Divine Turtle Manual, and easily refined it. A deep blue light appeared, and the door was spontaneously opened.<br/><br/>Immediately, a terrifying surge of evil energy burst out from inside.<br/><br/>Both of them reacted quickly, using their True Essence to protect their bodies and block the evil energy.<br/><br/>The evil energy dissipated quickly.<br/><br/>Somehow, Gu Yang had an ominous feeling.<br/><br/>That evil energy gave him a sense of familiarity.<br/><br/>It seemed to be related to the terrifying existence that had come with the final move of the “God Destroyer Nine Styles”.<br/><br/>Behind the door lay a skeleton, completely black, kneeled down on one knee and holding a long sword in its hand.<br/><br/>That skeleton, surprisingly, radiated a powerful pressure, which was even stronger than the Unleaking Realm Dragon Turtle he encountered in the Secret Realm.<br/><br/>Gu Yang was shocked, “Could it be… a Celestial Being Realm?”<br/><br/>Princess Chang had already stepped in, knelt in front of the skeleton, and said, “I, Zhao Mingzhu, prostrate myself before my elder. I swear to help you in avenging your death. Kindly bestow upon me the Long Autumn Sword!”<br/><br/>With that, she kowtowed three times to the skeleton.<br/><br/>The sword in the skeleton’s hand suddenly emitted a faint blue light and, with a hum, it flew to Princess Chang’s front on its own.<br/><br/>“A peerless divine weapon?”<br/><br/>At a glance, Gu Yang knew that this sentient sword was the stuff of legends. It was said that all ten of the peerless divine weapons held by the Sword Saints were sentient.<br/><br/>It’s indeed not on the same level as any ordinary divine weapon.<br/><br/>He wondered how much energy it could give if it were charged into the system.<br/><br/>Seemingly sensing Gu Yang’s malicious gaze, the Long Autumn Sword hummed and started to tremble.\t\t\t\t\t\t</div>", "images": {}, "success": true}