{"id": 196, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15131993.html", "title": "Chapter 196 - Chapter 196: Hasn’T Miss 196 Suffered Enough Because Of You?", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 196 - Chapter 196: Hasn’T Miss 196 Suffered Enough Because Of You?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 196: Hasn’t Miss 196 suffered enough because of you?<br/><br/>Translator: 549690339<br/><br/>“Truly teeming with spiritual essence.”<br/><br/>Upon seeing the sword reacting to his gaze, Gu Yang found it even more fascinating.<br/><br/>However, he didn’t intend to snatch the sword from Princess Chang. Instead, he looked towards the skeleton on the ground, curious about the powerful aura emanating from it.<br/><br/>He went over, reaching out to touch the blackened bones, feeling an inexplicable sense of familiarity, as if it was a response from his bloodline.<br/><br/>“It must be the ‘Divine Turtle Manual’, this person must be King Wei.”<br/><br/>Dead for over a thousand years, only the skeleton remaining, yet still exerting such tremendous pressure. One could only wonder how powerful he must have been in life.<br/><br/>Gu Yang couldn’t help but sigh. Such powerful beings were all dead, showing just how strong the Four Great Sacred Lands were.<br/><br/>Just as he was thinking, a prompt suddenly popped up,[Energy Source Found, Recharge?]<br/><br/>Is this even possible?<br/><br/>“Yes.”<br/><br/>The skeleton vanished in a blink of an eye.<br/><br/>[Recharge successful, received three units of energy. Current energy balance: eight units.]<br/><br/>Gu Yang was pleased. A mere skeleton awarded three units of energy, equivalent to three divine weapons.<br/><br/>Not bad at all.<br/><br/>He had found another energy source, making his path suddenly wider.<br/><br/>Compared to slaying Divine Power Realm powerhouses or acquiring divine weapons, the bodies of the powerful should be the easiest to obtain with the least risk involved.<br/><br/>“Hmm, it seems I need to learn some grave-robbing skills.”<br/><br/>No, it’s probably too late to learn now.<br/><br/>Gu Yang remembered that on this road, he had a powerful competitor— the Nether Sect.<br/><br/>The Nether Sect hunted Golden Body Realm experts everywhere to refine corpses into nefarious zombies.<br/><br/>They definitely wouldn’t pass up such a resource. Presumably, they had already excavated all the known graves.<br/><br/>Speaking of which, a disciple of the Nether Sect once mentioned that there was a Celestial Being’s corpse in Black Soul Valley. He wondered how many units of energy it would charge.<br/><br/>“What happened?”<br/><br/>At that moment, Princess Chang noticed that the skeleton had vanished out of thin air, and she was taken aback.<br/><br/>Gu Yang blinked and said, “I have no idea. It just disappeared all of a sudden.”<br/><br/>Princess Chang looked around suspiciously. She guessed he had done something but did not delve deeper. Everyone had their secrets, and prying into the secret of others was rude.<br/><br/>“Gu Yang, I need to go into seclusion for a while.”<br/><br/>“I understand.”<br/><br/>Gu Yang nodded. She just acquired a peerless divine weapon and needed to get accustomed to it. Even for the sword technique inherited within the divine weapon alone, it would take quite some time to master.<br/><br/>Princess Chang looked at him, suddenly grasped his robe, pulled him to her, stood on her tiptoes, and gently kissed his lips. She giggled and said, “Don’t forget me.”<br/><br/>Having said that, she disappeared without a trace.<br/><br/>Having crossed over to this world, Gu Yang had never met such a bold and assertive woman. Her faint fragrance still lingered around his nose.<br/><br/>Darn, can’t believe she flirted and ran.<br/><br/>But it was indeed quite stimulating.<br/><br/>After Gu Yang and Princess Chang left, an extremely faint dark shadow suddenly materialized in the basement, transforming from the malevolent energy that slipped out when the door opened.<br/><br/>The shadow flew towards the entrance, slipping out through the gap under the door.<br/><br/>Once outside, it ascended into the air, seemingly guided by something, and flew in a certain direction.<br/><br/>Suddenly, it stopped, changed directions, and swiftly headed for the royal palace.<br/><br/>The secret realm breach at the Guo’s residence had completely disappeared, but there was still a group of people fervently discussing in the yard.<br/><br/>These were students from the academy<br/><br/>The professor leading these students was Wang Yuanzhuo.<br/><br/>Ye Lingbo was also there. She was a bona fide genius, ranked first in every subject in the academy. She outclassed everyone in all fields.<br/><br/>The secret realms existing in the world today were all passed down from ancient times. According to the academy scholars’ research across generations, all secret realms were man-made.<br/><br/>However, the method of creating secret realms had been lost.<br/><br/>Even their dean didn’t possess this ability.<br/><br/>It was said that one must step above Celestial Beings, reaching the Hollow Void Realm, and master the Way of Space to open up a new space.<br/><br/>But after the collapse of the ancient mystical era, no beings of the Hollow Void Realm had appeared.<br/><br/>Even a person like the Xia Emperor failed in his attempt to break through into the Hollow Void Realm.<br/><br/>Now, with a Secret Realm on the brink of collapse, Wang Yuanzhuo and his group naturally wouldn’t miss this opportunity.<br/><br/>Over the past few days, they had been staying here, observing the collapse of the Secret Realm and benefited greatly.<br/><br/>With a twinge of regret, Wang Yuanzhuo said, “If the dean were here, he might have been able to decipher the mystery of the space. It’s such a pity.”<br/><br/>Ye Lingbo was sitting on the ground with his eyes closed, calculating incessantly in his mind.<br/><br/>Suddenly, he opened his eyes and turned his gaze to the direction of the door.<br/><br/>“Senior sister, have you discovered something?”<br/><br/>The other students immediately came over and crowded around to ask.<br/><br/>Ye Lingbo said, “Gu Yang is coming.”<br/><br/>Gu Yang is coming?<br/><br/>Is it related to her calculations?<br/><br/>The fellow disciples were somewhat at a loss.<br/><br/>…<br/><br/>“How dare you come looking for Miss!”<br/><br/>Gu Yang once again came to the state office. As soon as he entered the door, a young maid blocked him, with a very menacing look on her face.<br/><br/>He had no impression of this maid, but from the looks of her, she was probably the maid of Miss Su Er. He said, “I am not here to see your mistress.”<br/><br/>The maid, furious, said, “You are not welcomed here. Please leave.”<br/><br/>Just a few days ago, the Empress had ordered a royal marriage. The news of Princess Chang, who had usurped the fiancé of another, had already spread throughout the Divine City and would soon spread throughout the whole Great Zhou.<br/><br/>Her mistress had now become the laughingstock of the entire Divine City.<br/><br/>She grew up with her mistress since she was a child and can be considered as sisters. So, upon hearing that Gu Yang had arrived, she exploded. He even dared to come to the state office!<br/><br/>Hasn’t he harmed the mistress enough?<br/><br/>Without considering her own safety, she came running to stop him.<br/><br/>“Ruyi, you must not be reckless!”<br/><br/>From one side, Miss Su Er walked out and rebuked her maid for her rudeness.<br/><br/>The maid pleaded anxiously, “Miss…”<br/><br/>“Shut up, apologize to Mr. Gu immediately.” Miss Su Er’s tone was severe, “Mr. Gu is our family’s benefactor. Without him, who knows how many people would have died here.”<br/><br/>And with that, she apologized to Gu Yang, “I’m sorry for my maid’s rudeness. I will make sure she is severely punished.”<br/><br/>Encountering her, Gu Yang felt somewhat awkward, saying, “I came to check on the Secret Realm.”<br/><br/>“Please, sir.”<br/><br/>Miss Su Er did not intend to accompany him.<br/><br/>Without saying more, Gu Yang left on his own.<br/><br/>As Miss Su Er watched his retreating figure, she slightly furrowed her eyebrows, thinking, exactly how many ‘Nine Heavens Divine Methods’ has he practiced so far?<br/><br/>…<br/><br/>Meanwhile, Gu Yang, while making his way inside, opened up the system. For precaution, it’s better to carry out a Simulation, just in case there’s danger.<br/><br/>[Would you like to use the Life Simulator? Using it once consumes one energy unit.]<br/><br/>“Yes.”<br/><br/>[At the age of twenty-two, you…]<br/><br/>[In the national palace, you opened a Prohibition underground with the seal of King Qi and discovered a frozen woman. Unable to awaken her, you took away a divine weapon.]<br/><br/>[You moved into the academy and practiced with Ye Lingbo…]<br/><br/>[Two years later, Nether Sect invaded…]<br/><br/>[You took Ye Lingbo to the Altar of Heaven Worship, opened the Secret Realm, and let loose a powerful Unleaking Realm character. At that moment, the ancestor of Shen Family and a Mana Realm character arrived. They staged a spectacular battle against that Unleaking Realm powerhouse.]<br/><br/>[You took Ye Lingbo and hid in the Secret Realm. And closed the Secret Realm.]<br/><br/>[Eight years later, Ye Lingbo stepped into the Celestial Being Realm. You came out of the Secret Realm to find the Divine City taken over by the Star Luo Sect. You were spotted and hunted down.]<br/><br/>[Under the attack from several Celestial Beings, you both died in battle at age thirty-two.]<br/><br/>Well, Star Luo Sect has already emerged ahead of time.<br/><br/>The timeline of the future of this world is now completely messed up.<br/><br/>But, there was still some gain from this Simulation.<br/><br/>First, the Prohibition he is going to activate is not dangerous.<br/><br/>Second, Star Luo Sect possesses quite a few Celestial Beings.<br/><br/>PS: Third update, please vote.\t\t\t\t\t\t</div>", "images": {}, "success": true}