{"id": 191, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15131984.html", "title": "Chapter 191 - Chapter 191: Completely Unrecognizable", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 191 - Chapter 191: Completely Unrecognizable</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 191: Completely unrecognizable<br/><br/>Translator: 549690339<br/><br/>“At twenty-two, you broke through to the Divine Power Realm and achieved the first level of the Golden Body. Outside of Divine City, you caught the attention of Red Venerate’s leader, Red Sun, and killed Shang Qinglin, a disciple of the Nether Sect. Becoming the youngest Divine Power practitioner in the world, you astounded everyone.”<br/><br/>“You used the third strike of the Heavenly Inquiry Nine Knives to break through the void, save several people, and then infiltrate the Secret Realm to rescue Princess Chang and Gao Fan. You found a Nine Divine Tripod, but were unable to bring it out of the Secret Realm.”<br/><br/>“After the dragon tortoise escaped from the Secret Realm, it was startled by a wisp of breath and fled from Divine City.”<br/><br/>“Grateful for your help, Princess Chang gifted you with the Nine Provinces Stamp.”<br/><br/>“You received the legacy within the Nine Provinces Stamp, gaining the Divine Tiger Manual and the Divine Turtle Manual.”<br/><br/>“You decided to form a Dao partnership with Ye Lingbo, hiding in the academy to cultivate with her.”<br/><br/>“A month later, Ye Lingbo broke through to the Divine Power Realm.”<br/><br/>“After two years, Ye Lingbo made the breakthrough into the Mana Realm.”<br/><br/>“One day, the Nether Sect launched a major attack with two Celestial Beings, besieging the academy. The Dean of the Academy was forced to intervene, killing one Celestial Being but dying soon after. At the critical juncture, Luo Wang arrived and killed the other Celestial Being from the Nether Sect.”<br/><br/>“In this battle, Ye Lingbo was seriously injured. Vice Dean Zhou Zongye fell.”<br/><br/>“One day, the founder of the Shen Family arrived and captured you. A year later, you were brought into a separate world and forced to transfer your true essence into a stone every day.”<br/><br/>“After ten years, your Vitality was on the verge of depletion. One day, in the separate world, Ye Lingbo came alone with her sword. She faced off against two Celestial Beings in a shocking battle. Finally, she managed to rescue you.”<br/><br/>“One year later, you died at the age of thirty-five.”<br/><br/>Gu Yang had a headache when he saw the results of this simulation.<br/><br/>There was another variable, the Nether Sect had two additional Celestial Beings two years later who attacked the academy, causing the Celestial Being of the academy to fall.<br/><br/>This was outrageous.<br/><br/>If the Celestial Being from the academy died, the outcome of the incoming battle with the Star Luo Sect might be changed. Could Divine City hold on for that many years?<br/><br/>Was it because he joined the academy that caused such a disaster?<br/><br/>And then there was Ye Lingbo, with such exaggerated talent, she became a Celestial Being in just over ten years. Alone, she stormed the Three-Holy-Door, fighting off two enemies and successfully rescuing him.”<br/><br/>She was fierce.<br/><br/>Unfortunately, she arrived too late. His body had been drained for a full ten years and he didn’t last long after that.<br/><br/>“The simulation is over, you can choose to keep one of the following.”<br/><br/>“One, your Martial Arts Realm when you were twenty-five.”<br/><br/>“Two, your Martial Arts experience when you were thirty-five.”<br/><br/>“Three, your life wisdom when you were thirty-five.”<br/><br/>It happened yet again. In the simulation, although he died at 35, he could only retain the Martial Arts Realm he had achieved at the age of 25.”<br/><br/>This meant that throughout those ten years, his cultivation had been declining.”<br/><br/>The reward of the simulation usually corresponds to the peak year.”<br/><br/>The Three Holy Doors exploited him ruthlessly, squeezing him dry.”<br/><br/>“I choose the second.”<br/><br/>Immediately, countless pieces of martial arts experience filled Gu Yang’s mind.”<br/><br/>The most important were the “Divine Tiger Manual” and the “Divine Turtle Manual” from the “Nine Heavens Divine Method”.<br/><br/>The Divine Tiger Manual focused on cultivation of the White Tiger among the four sacred beasts, primarily dealing with slaughter.”<br/><br/>The Divine Turtle Manual corresponded to the Black Tortoise.<br/><br/>However, without the essence blood, even knowing the method of cultivation wouldn’t be much use.”<br/><br/>Apart from that, there was the method for activating the Earth God’s Tripod. The esoteric methods that he had fully comprehended and practiced diligently for more than ten years were now mastered to perfection.”<br/><br/>Gu Yang opened his eyes, a small smile on his face.<br/><br/>“Shrink!”<br/><br/>He mobilized his true essence and applied the method of metamorphosis, and the massive tripod quickly started to shrink.”<br/><br/>Gao Fan, who was extremely upset on the side, was struggling intensely.<br/><br/>After sealing his cultivation, he was no longer able to use any mana. Even after learning the method of operation, it was useless.”<br/><br/>But there was a Nine Divine Tripod right in front of him, and the Secret Realm space was about to collapse.”<br/><br/>He had only two choices.”<br/><br/>One, watch as the treasure of the human race disappeared with the collapse of space.”<br/><br/>The second, unlock his seal, take a chance to see if he could take control of the treasure before the Secret Realm collapsed.”<br/><br/>Suddenly, Gao Fan’s eyes flashed with determination, “If I don’t go to hell, who will?”<br/><br/>He must not let this treasure disappear. If so, he would be the sinner of the human race.”<br/><br/>“Gu Yang…”<br/><br/>He looked up, about to delegate some tasks. When he looked up, he was stunned. His mouth half-opened and his eyes widened.”<br/><br/>He saw the huge tripod shrinking rapidly, from two feet high, in the blink of an eye, it was only several feet high and still shrinking.”<br/><br/>Finally, the original two-feet high tripod became less than a foot high, small enough to fit in the palm of Gu Yang’s hand.”<br/><br/>Gu Yang put away the small tripod and said, “Okay, let’s go.”<br/><br/>“You… you… how…”<br/><br/>Gao Fan was speechless, his mind thoroughly confused.<br/><br/>How did he do it?<br/><br/>This kind of treasure usually has extremely profound laws to operate it – it’s almost as complex as some unparalleled divine skills.<br/><br/>The Nine Divine Cauldrons have been passed down since ancient times. The techniques to use them are different from today’s martial arts and will therefore be even harder to learn.<br/><br/>Even Gao Fan himself wasn’t very confident that he could master the basic understanding in such a short period of time.<br/><br/>But Gu Yang had not only managed to master it in this brief time, but also reached so far into the profound depths.<br/><br/>To be able to change its form, he at least had to train to the third level, right?<br/><br/>The first level – transferable.<br/><br/>The second level – cultivable via the essence of heaven and earth gathered by the Divine Cauldron.<br/><br/>It is only at the third level that it can change its form: growing larger, smaller, according to one’s will.<br/><br/>As for going beyond that, using it to fight enemies is not possible at the Divine Power realm. Without reaching the Celestial Being realm, there simply isn’t enough mana to stimulate such a high-level artifact.<br/><br/>Just as he had mentally prepared a response, Gu Yang had already reached the third level, capable of freely altering the form of the Nine Divine Cauldrons.<br/><br/>Isn’t this exaggeration?<br/><br/>Before Gao Fan could ask a question, Gu Yang pulled him along with Princess Chang, flying at the fastest speed toward the exit.<br/><br/>From a far distance, they could see the Dragon Turtle guarding a gap. Its mana spread to the surroundings, sealing the exit to the outside world, clearly waiting for a target to appear.<br/><br/>The bulk of the Dragon Turtle seemed to have reduced in size, obviously changing form.<br/><br/>This beast could be cunning.<br/><br/>Gu Yang stopped outside the range of the barrier formed by the mana. At this moment, the effect of Concealing Charm’s still in place, and the Dragon Turtle had not discovered them.<br/><br/>“Damn, it’s blocking the exit. It might not be possible to leave,”<br/><br/>Gao Fan came out of his trance and, seeing the situation ahead, couldn’t help but say worryingly.<br/><br/>If the Dragon Turtle is an Unleaking realm and uses mana, it is impossible not to alert it.<br/><br/>“No hurry, let’s wait a bit.”<br/><br/>Gu Yang didn’t seem worried.<br/><br/>During the previous two simulations, he had safely left the secret realm. Meaning, this time, it should be mostly safe with a slight scare.<br/><br/>Gao Fan wasn’t aware of his confidence, somewhat speechless.<br/><br/>In his view, waiting here was not as good as going back and hiding.<br/><br/>Otherwise, if the Concealing Charm fails and the Dragon Turtle discovers them, it could be very dangerous. The change in the beast’s form seemed to have made it less clumsy and probably harder to deal with.<br/><br/>While he was thinking, the aura on the Dragon Turtle suddenly surged. It looked towards the outside, let out a mixed roar of shock and anger, and dashed out. In the blink of an eye, it disappeared into the horizon.<br/><br/>What just happened?<br/><br/>That change was so abrupt, Gao Fan was caught off guard. He turned to look at Gu Yang and saw him smiling, which made him feel that this young man was more mysterious than he thought.<br/><br/>With the obstacle gone, the three of them finally escaped from the Secret Realm.<br/><br/>Once outside, Gao Fan then understood what had just happened. At the Royal Palace, a dragon-shaped aura ascended into the sky, countless golden lights scattered down, and a breathtaking breath enveloped most of Divine City.<br/><br/>In surprise, he exclaimed, “The Extreme Dragon Emperor Formation?”<br/><br/>This was a terrifying formation in the palace. Once activated, even Celestial Beings would retreat in fear.<br/><br/>It’s said that, so far, it had only been activated twice. Once during the fall of the Xia Dynasty.<br/><br/>The second time was when Qin Dynasty fell.<br/><br/>One can say that this formation is the Palace’s last line of defence. Once activated, it signifies that the Palace is at a life and death juncture.<br/><br/>Gao Fan couldn’t believe what he was saying, “Did Zhao Yi go crazy?”<br/><br/>Zhao Yi was the name of the current emperor.<br/><br/>The only one who could order the activation of that big palace formation was this emperor.<br/><br/>He actually activated this formation to save his sister.<br/><br/>No wonder the Dragon Turtle was scared off. If it didn’t run, it wouldn’t be able to escape.<br/><br/>Seeing the dragon-shaped aura in the sky, Gu Yang felt a chill in his heart, and couldn’t help but swallow.<br/><br/>It must be the formation that suppressed one of the Celestial Beings from Star Luo Sect in one of the simulations.<br/><br/>Indeed, it’s terrifying.<br/><br/>I wonder what kind of price it has to pay for activating such a formation.<br/><br/>If it can’t be activated, that would be a lot of fun.<br/><br/>Gu Yang always felt that although they managed to rescue Princess Chang and others this time, the future has become unrecognizable and has taken a different path.<br/><br/>Not to mention anything else, just in the Divine City alone, when Star Luo Sect invades, it probably won’t last past the first wave.<br/><br/>With the increase of his realm and the enhancement of his strength, the greater his disturbance to the future.<br/><br/>As Gu Yang was thinking, Princess Chang, who was in his arms, finally came out of her faint with her beautiful eyes staring at his face.<br/><br/>PS: First update, asking for monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}