{"id": 199, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15131999.html", "title": "Chapter 199 - Chapter 199: 199 Is Not What You Think It Is", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 199 - Chapter 199: 199 Is Not What You Think It Is</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 199: 199 is not what you think it is<br/><br/>Translator: 549690339<br/><br/>“Could it be that it happened because I’ve reached the Divine Power Realm?”<br/><br/>The only difference Gu Yang found through comparing it with the previous simulation was that his cultivation level had changed.<br/><br/>This was quite possible.<br/><br/>It seemed this path was no longer viable.<br/><br/>[Simulation completed, you can keep one of the following.]<br/><br/>[First, the martial arts realm at the age of thirty-two.]<br/><br/>[Second, the martial arts experience at the age of thirty-four.]<br/><br/>[Third, life wisdom at the age of thirty-four.]<br/><br/>“I choose the first option.”<br/><br/>Suddenly, the power within Gu began to swell, once again transforming him into a White Tiger, followed by a Black Tortoise.<br/><br/>He had advanced to the second level in both the Divine Tiger Manual and the Divine Turtle Manual.<br/><br/>His mortal body strength surged yet again.<br/><br/>When Gu Yang opened his eyes, he saw Gao Fan staring at him in shock.<br/><br/>He asked, “What’s wrong?”<br/><br/>Gao Fan stammered, “Did you… achieve the second layer of the Golden Body?”<br/><br/>Even with his extensive knowledge and experience, Gao Fan was startled.<br/><br/>He was initially in the yard studying the Wu Earth Divine Cauldron when the commotion in the house caught his attention. Initially opting to ignore it, he quickly realised something was wrong.<br/><br/>This was clearly the power of the second layer of the Golden Body.<br/><br/>Gao Fan’s shock was no small matter: abandoning the Wu Earth Divine Cauldron, he rushed to verify his suspicion.<br/><br/>Gu Yang, watching her shocked expression and feeling quite pleased, calmly said, “I got some luck and finally made a breakthrough.”<br/><br/>“You”<br/><br/>Gao Fan appeared conflicted, hesitating before finally seeming to make a decision, “Is the Jiuzhou seal very important to you?”<br/><br/>“It’s important.”<br/><br/>“Wait for my news,” Gao Fan said before heading out, a final message reaching Gu Yang, “Take care of Tianci for me.”<br/><br/>Gu Yang thought to himself, Old Gao sure knows how to get things done efficiently, with zero hesitation.<br/><br/>At that moment, footsteps rang out from outside. Cheng Qingyu’s voice echoed from afar, “This isn’t good.”<br/><br/>When she reached the courtyard door, she paused, knocking forcefully.<br/><br/>After being scolded by him once, Cheng Qingyu had made it a habit to knock on the door before seeking him out.<br/><br/>Gu Yang said, “Come in.”<br/><br/>Cheng Qingyu rushed in, her face filled with distress, “Brother Gu, Lin Ruo Xi from the Lin Family has arrived in Divine City, claiming to settle scores with you. You need to hide.”<br/><br/>The Lin family?<br/><br/>Gu Yang knew that she was referring to one of the Top Nine Families in the world – the Lin family.<br/><br/>He wasn’t surprised. From the moment he decided to oppose the Lin family, he had prepared for the possibility of their retaliation.<br/><br/>No matter what, he had single-handedly taken down the Lin branch in Jiangzhou. Was the Lin family not concerned about their reputation?<br/><br/>He asked, “Who is this Lin Ruo Xi?”<br/><br/>He didn’t recognize the name; he had never heard it before.<br/><br/>“Twenty years ago, she ranked first in the First Rank List. After reaching the Divine Power Realm, she secluded herself to practice intensely. Apparently, she is now at the third level of the Golden Body. After exiting her seclusion recently, she announced that she would challenge Chen Wen Yuan of the Chen family. However, after learning about the events in Jiangzhou involving the Lin family, she declared that she would come after you. She will arrive in Divine City soon.”<br/><br/>A third constellation Golden Body was indeed a bit tricky.<br/><br/>However, this person was not mentioned in the simulation, so likely, he had avoided this encounter.<br/><br/>For Lin Ruo Xi, challenging the Chen family was a bigger deal.<br/><br/>Gu Yang had heard about the grudges between the Lin and Chen families.<br/><br/>The Lin family was once very influential, even more dominant than the current Qin family.<br/><br/>This family had once produced a Celestial Being – the only one among the world’s top families.<br/><br/>The Lin and Chen families had a profound connection and were initially on very good terms. However, during the chaotic late Qin dynasty, the Lin family’s Celestial Being was killed in a war against the royal family of the Qin Dynasty.<br/><br/>In that battle, the Lin family was on the verge of total annihilation.<br/><br/>It is said that when the Lin family sought help from the Chen family, the Chen family turned a blind eye. From then on, the two families became sworn enemies.<br/><br/>For centuries, the Lin family had been very low-key, not getting involved in the feuds of other families. But one thing remained – almost every generation of the Lin family went to challenge the disciples of the Chen family.<br/><br/>This had almost become a tradition in the Lin family. Victory brought glory, while defeat brought shame.<br/><br/>Compared to a mortal enemy, Gu Yang’s matter could be put aside for now.<br/><br/>Gu Yang nodded, “I understand.”<br/><br/>This time, he decided to meet this Lin Ruo Xi.<br/><br/>Given that she hails from the Lin Family and is in the third phase of the Golden Body Realm, the weapon she uses must be divine, right?<br/><br/>Seeing his nonchalant attitude, Cheng Qingyu became anxious, “Elder Sister Su had said that Lin Ruo Xi practices the Lin Family’s direct lineage Divine Technique, originated from the Star Sea. There’s no way it’s inferior to your Phoenix Dance Nine Heavens.”<br/><br/>“Don’t worry, I have it under control.”<br/><br/>Naturally, Gu Yang wouldn’t underestimate her. A family that had produced a Celestial Being, could their technique be bad?<br/><br/>“Father.”<br/><br/>At this time, Xi Huang walked out, leaning against the door frame. She appeared frail as a willow in the wind, but her eyes were fixated on Cheng Qingyu as she asked, “Who is she?”<br/><br/>Her tone hinted at an unmistakable hostility.<br/><br/>“Father?”<br/><br/>Hearing this address, Cheng Qingyu was shocked. She looked at Gu Yang, then at the young girl, her mouth shaped into an ‘O’.<br/><br/>Gu Yang was about to explain, but then deemed it unnecessary. Perhaps it’s better if others misunderstand.<br/><br/>His attraction to the opposite sex had always brought him trouble. Having a daughter could help him avoid many problems.<br/><br/>In his heart, he congratulated himself, “I’m simply too clever.”<br/><br/>He laughed and said, “She’s the owner of this place, her name is Cheng Qingyu.”<br/><br/>Xi Huang stared at Cheng Qingyu for a while. Various expressions crossing her face, finally, she couldn’t help but say, “Father, if you wish to take her as a wife, could I not call her mother? She’s too young.”<br/><br/>This statement made Cheng Qingyu turn bright red in embarrassment. She covered her face and left.<br/><br/>Gu Yang felt like asking, which eye of hers saw my interest in her?<br/><br/>However, seeing her pitiful expression, he decided to speak in a softer tone, “It’s not what you think…”<br/><br/>At his words, Xi Huang’s face turned white. She said in a trembling voice, “Father, do you intend to abandon her after having your fun? What if she gets pregnant and the child grows up without a father, just like me?”<br/><br/>Her imagination was truly impressive.<br/><br/>He hadn’t done anything at all, and yet in her mouth, he was already a scoundrel who got a woman pregnant and then left her high and dry.<br/><br/>Just how vile was her father?<br/><br/>From her words, it seemed her mother was abandoned and she grew up without a father.<br/><br/>Gu Yang suddenly thought, had she never met that scumbag father of hers? She was so excited to see him because she lacked a father’s love from a young age.<br/><br/>He wanted to say something, but he felt the more he tried to explain, the guiltier it would make him look.<br/><br/>So what he intended to say turned into, “You’re very weak right now, you should go back and rest.”<br/><br/>At the same time, outside Divine City, two riders—one ahead, one behind—came from afar. They stopped when they reached a mound. The rider in front reined in his horse.<br/><br/>He was a young man, with sword-like eyebrows and starry eyes, dressed in blue robes, exuded an extraordinary aura. His lips curved in reminiscence, “Divine City, it’s been a while.”<br/><br/>“Had senior been to Divine City before?”<br/><br/>The rider behind was a young man, exuding an air of august majesty. If Gu Yang were here, he would recognize this man as Jiao Shumo, who had once given him the Shadow Thief Treasure Map.<br/><br/>The young man in front replied, “That was many years ago.”<br/><br/>Jiao Shumo asked again, “So, senior came to Divine City this time to…”<br/><br/>“Find someone.”<br/><br/>This young man was none other than Lin Ruo Xi from the Lin Family. He originally had no plans to come to Divine City until he happened to hear about Lin Yimo’s defeat by Gu Yang, a First Rank Martial Artist from the Jiangzhou Lin Family. He was greatly surprised.<br/><br/>After hearing various tales about Gu Yang’s feats, he became intensely interested in him.<br/><br/>Especially when he heard that Gu Yang had broken through to the Divine Power Realm a few days ago, he decided to meet this peerless genius.<br/><br/>After all, he had to pass through Divine City anyway.<br/><br/>On his way, he met this young man whose manners resonated with him. Respectful and polite, they journeyed together, with Lin Ruo Xi occasionally giving him pointers.<br/><br/>“Let’s go.”<br/><br/>Lin Ruo Xi gave the reins a shake and quickly entered the gate of Divine City.<br/><br/>Jiao Shumo followed closely behind.<br/><br/>PS: Here’s the third update, please vote if you’re enjoying the story.\t\t\t\t\t\t</div>", "images": {}, "success": true}