{"id": 197, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15131995.html", "title": "Chapter 197 - Chapter 197: 197 Golden Body Level 2", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 197 - Chapter 197: 197 Golden Body Level 2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 197: 197 Golden Body Level 2<br/><br/>Translator: 549690339<br/><br/>“Simulation finalized; you can choose to retain one of the following options.”<br/><br/>“One, the martial arts realm you reached at thirty-two years old.”<br/><br/>“Two, the martial arts experience you accumulated up until being thirty-two years old.”<br/><br/>“Three, the wisdom acquired throughout your life until the age of thirty-two.”<br/><br/>Gu Yang didn’t make a choice and temporarily put it aside. Too many people were around, he’d decide when he got back to Tianxin Martial Arts Hall.<br/><br/>Before long, they arrived at the courtyard.<br/><br/>There were more than a dozen people in the courtyard, all dressed in moon-white robes.<br/><br/>Wang Yuanzhuo greeted Gu Yang warmly, “Master Gu.”<br/><br/>That day, it was thanks to Gu Yang that Vice President Zhou Zongye was saved. The entire Scholars Institute owed him a debt of gratitude.<br/><br/>“Professor Wang, you guys proceed with your work, I’m just having a look around,” Gu Yang said with a smile. Feeling an unusual gaze, he turned to see Ye Lingbo.<br/><br/>This maiden isn’t bad; she’s worth making friends with.<br/><br/>He remembered the last time in the simulation, after she ascended to a Celestial Being, she bravely stormed the Three Sacred Gates and rescued him.<br/><br/>His smile grew warmer. He nodded at her, extending a greeting.<br/><br/>In the courtyard, the rest of the Scholars Institute disciples were eyeing him curiously. They were all familiar with the name Gu Yang – universally recognized within the younger generation as the number one talent.<br/><br/>“What’s so special about this man that he can even suppress our Senior Sister Ye?”, they wondered, seeing nothing out of the ordinary.<br/><br/>Gu Yang didn’t pay much attention to their gazes. He strolled around the courtyard, feigning interest in the surroundings. Seeing no one looking, he sneaked into a small courtyard nearby.<br/><br/>He held the seal of King Qi in his hand and could clearly sense the position of a forbidden area.<br/><br/>Passing through the courtyard, he entered a room. Finally, he pushed open a door to find a woman’s boudoir.<br/><br/>By the look of it, it should be Miss Su Er’s room.<br/><br/>What a coincidence, the forbidden area was right under that room.<br/><br/>“How do I get down there?” Gu Yang wondered, just as the seal in his hand lit up and a complicated magic array sparked under his feet.<br/><br/>Next moment, whoosh, he disappeared from the room.<br/><br/>“What is”<br/><br/>Outside, Wang Yuanzhuo and Ye Lingbo felt something together. They turned to look at the small courtyard, astonished. With a whoosh, a figure flew to the courtyard.<br/><br/>They both recognized the figure as Miss Su Er, the queen’s younger sister.<br/><br/>Previously, Miss Su Er had kept a low profile, almost invisible. No person knew her name.<br/><br/>But now, no one could ignore her presence. A twenty-something Celestial immortal, enough to make any so-called geniuses envious.<br/><br/>People were increasingly mentioning her and Gu Yang as the Twin Jewels of Great Zhou.<br/><br/>The most curious thing was, no one knew her lineage or the martial arts she practiced.<br/><br/>She was a mystery.<br/><br/>While Wang Yuanzhuo was still hesitant, Ye Lingbo took a step ahead.<br/><br/>As they reached the spot where Gu Yang’s aura had vanished, Su Ningyan shook her head signaling she didn’t know.<br/><br/>Both women stopped talking and waited in place.<br/><br/>That fluctuation just now, it was like the legendary teleportation array.<br/><br/>This kind of array was a long-lost art, only surviving in ancient legends.<br/><br/>They all wondered what tricks Gu Yang was playing.<br/><br/>Gu Yang only felt a flash before his eyes and then found himself in an underground palace.<br/><br/>It looked a bit similar to the underground chamber in Long Autumn Palace.<br/><br/>He took a deep breath, sensing a more active vitality than outside. Practicing here would yield twice the result for half the effort.<br/><br/>At the far end of the underground palace was a door, the same kind he had seen before.<br/><br/>Gu Yang skillfully used King Qi’s seal to open the door and a gust of cold air rushed out revealing a crystal coffin with a figure.<br/><br/>In that coffin was a woman, dressed in palace attire, as beautiful as a Celestial Immortal with a distinct aura.<br/><br/>In the lady’s hand was a sword, the divine weapon mentioned during the simulation.<br/><br/>He changed his angle to get a better look. The woman had no signs of life left – she must have been dead for many years now.<br/><br/>“Please pardon my intrusion.”<br/><br/>He said softly, placing his hand on the crystal coffin.<br/><br/>Shortly, a prompt appeared before his eyes, “Power source detected, charge up?”<br/><br/>“So, it does work.” Gu Yang felt confident that the crystal coffin was not ordinary. He took a chance and it indeed provided charge.<br/><br/>He silently praised his cleverness.<br/><br/>“Yes.”<br/><br/>“Charging successful, received two units of energy. Current energy is: nine units.”<br/><br/>The coffin vanished and the woman’s body along with the sword fell to the ground.<br/><br/>Next, he placed his hand on the woman’s body, thinking it would be a waste to leave this body unused.<br/><br/>“Power source detected, charge up?”<br/><br/>“Yes.”<br/><br/>[Successful Energy Added, Acquired One Unit of Energy, Current Energy Value: Ten Units.]<br/><br/>“What’s going on?”<br/><br/>Gu Yang noticed that the woman was still calmly lying in front of him and had not disappeared. He was taken aback.<br/><br/>At that moment, the woman’s long eyelashes quivered. She opened her eyes, their gazes met, but her eyes were filled with confusion.<br/><br/>What the hell was happening?<br/><br/>Wasn’t she dead?<br/><br/>For a moment, Gu Yang thought she was playing dead and almost broke into a cold sweat.<br/><br/>On second thought, so what if she was playing dead? Regardless if she’s a zombie or a ghost, he could defeat her with one slap.<br/><br/>He still hadn’t fully adjusted to the idea.<br/><br/>Gu Yang changed his view and noticed that inside her body, a ball of red flames was becoming more and more vigorous. In a blink of an eye, it became as dazzling as the sun.<br/><br/>“Oh my, why does this power feel so familiar?”<br/><br/>He was startled, and at this moment, the confusion in the woman’s eyes disappeared. She regained her consciousness, looked extremely surprised, and blurted out, “Father!”<br/><br/>As she spoke, she wrapped her arms around his neck, crying with joy, “You’ve finally come back… sniffles…”<br/><br/>Gu Yang was dumbfounded.<br/><br/>Just a moment ago, he was mistaken as the master by the Little Green Bird.<br/><br/>Now, he was mistaken as the father by this woman.<br/><br/>This was too exciting.<br/><br/>The woman in front of him, the red flame inside her body and his True Essence were indeed extremely similar; they were from the same source.<br/><br/>If his guess was correct, she was likely a member of the Monster Race, possessing the bloodline of the Phoenix.<br/><br/>That was why she recognized him as her father.<br/><br/>The thing is, he wasn’t. He was only twenty-two years old, where would he get such a big daughter?<br/><br/>What’s scarier was that her realm was extremely high, at least the Mana Realm. Perhaps she had been dormant for too long, or was injured, her strength hadn’t fully recovered.<br/><br/>What if she realizes her mistake later and finds out that she mistook the person? That would be really fun to watch.<br/><br/>Gu Yang hurriedly pushed her away and said sternly, “Um, Miss, you’ve mistaken me for someone else.”<br/><br/>The woman was somewhat startled and looked at him. Her tears started flowing down like broken pearls. She cried sadly, “Father… Don’t you want me anymore?”<br/><br/>“Stop!”<br/><br/>Gu Yang shouted in a low voice.<br/><br/>The woman forced herself to stop crying.<br/><br/>He said solemnly, “Miss, take a good look at me, my face. And this body, a genuine human body. How could I possibly be your father? Wake up.”<br/><br/>The woman wiped her tears and said timidly, “But, you are my father.”<br/><br/>“What’s the proof? How can you prove that I am your father?”<br/><br/>Without saying a word, the woman picked up a sword from the ground, made a cut on her wrist, and blood gushed out. Instead of landing on the ground, the blood suspended in mid-air.<br/><br/>Gu Yang was stupefied by this. There was no need for her to harm herself just because of a few words, was there?<br/><br/>The blood was like a flame, constantly condensing and compressing. Finally, it condensed into a droplet.<br/><br/>With a swoosh, that droplet of blood slipped into his brow.<br/><br/>Gu Yang didn’t have time to react, all he felt was a loud crash in his head.<br/><br/>This feeling, somewhat familiar.<br/><br/>He suddenly remembered meeting a mysterious powerful person on Dragon Gate Island. After crushing the phoenix’s gall, that droplet of liquid also slipped into his brow.<br/><br/>He suddenly understood, this was a droplet of Phoenix’s Essence Blood. It wasn’t the normal Essence Blood found in King Qi’s seal, but the Essence Blood that encompassed the Phoenix’s origin.<br/><br/>In an instant, Gu Yang’s body was on fire, transformed into a phoenix. Power inside his body was getting stronger and stronger, quickly reaching its limit.<br/><br/>A moment later, he broke through the limit. Everything suddenly became clear, and he stepped into a whole new world.<br/><br/>After what seemed like ages, everything returned to normal.<br/><br/>Gu Yang opened his eyes, feeling an unprecedented strong power filling his body.<br/><br/>He had actually broken through to the second level of Golden Body.<br/><br/>“Did I just break through?”<br/><br/>He couldn’t believe it.<br/><br/>This was the fastest and easiest breakthrough since he embarked on the path of cultivation.<br/><br/>Gu Yang looked at the woman in front of him. She seemed extremely weak, her body had changed. Initially, she seemed like a woman in her twenties, but now, she looked like a girl of fifteen or sixteen.<br/><br/>Obviously, that droplet of Essence Blood had taken a great toll on her.<br/><br/>Seeing her body swaying, about to fall, Gu Yang subconsciously steadied her.<br/><br/>The young girl cried, “Father, you can’t not recognize me…”<br/><br/>Gu Yang was at a loss for words and remained silent in the end.<br/><br/>What could he say?<br/><br/>She had already been like this. It seemed like he had no choice but to acknowledge that he is her father.<br/><br/>He couldn’t possibly get a benefit, wipe his mouth, and pretend not to know her. That would be too despicable.<br/><br/>Who would’ve thought that he would also experience the joy of fatherhood one day.<br/><br/>He got such a big and filial daughter for nothing.<br/><br/>PS: I am now a father, please give me your monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}