{"id": 192, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15131985.html", "title": "Chapter 192 - Chapter 192: 192 Granting Marriage", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 192 - Chapter 192: 192 Granting Marriage</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 192: 192 Granting Marriage<br/><br/>Translator: 549690339<br/><br/>Gu Yang lowered his head to see Princess Chang staring intently at him, her eyes as gentle as water. He immediately showed an awkward but polite smile, and said, “You’re awake.”<br/><br/>“You’re fine.”<br/><br/>Her lips were pale, somewhat cracked. The moment she opened her mouth, her voice was weak, devoid of the dominance she embodied during their previous encounter.<br/><br/>With those words, she broke free from Gu Yang’s arms, took off a pendant from around her neck and forced it into his hand, while gently scratching his palm.<br/><br/>“I will come back for you.”<br/><br/>Princess Chang left him with a charming smile, then turned around and left.<br/><br/>A palace maid who had been waiting nearby draped a red cloak over her.<br/><br/>Suddenly, she transformed back to the original, haughty princess and instructed, “To the palace.”<br/><br/>Gu Yang lowered his head and saw in his hand a seal of the Nine States, which still carried her body heat.<br/><br/>Once he got the seal from the jailer in the celestial prison, he would have four seals.<br/><br/>If he could collect them all, he would obtain the complete inheritance of the “Nine Heavens Divine Method”, possess the power of nine divine beasts. The very thought thrilled him.<br/><br/>“The favour of saving my life, I, Zhou, will remember in my heart.”<br/><br/>At that moment, Zhou Zongye walked over and thanked him solemnly.<br/><br/>Gu Yang was not polite either, he held his hands out in thanks, “There’s nothing more for me here, I’ll go home first. If I ever have a chance, I’ll visit you for tea at the literary academy.”<br/><br/>Zhou Zongye responded, “I will sweep the couch to wait for you.”<br/><br/>This old Zhou, he is not bad, just a bit old-fashioned.<br/><br/>Gu Yang thought to himself, then returned to the neighbouring Tianxin Martial Arts Hall with Gao Fan.<br/><br/>“Master…”<br/><br/>Feng Tianci had been waiting there already, seeing Gao Fan, his eyes reddened instantly, “You’re finally back…”<br/><br/>Gao Fan said annoyingly, “I’m not dead yet, don’t mourn here, go go go.” And chased his disciple away.<br/><br/>Once they were back in the courtyard, Gao Fan said, “In this trip, I owe it to you. Without you, I would have really ended up.”<br/><br/>“It’s not like I specifically went to save you.”<br/><br/>Gu Yang pulled out the Nine Divine Cauldron and placed it on the table, and started examining it carefully.<br/><br/>Although he spoke carelessly, he owed a big favour. Gao Fan was not the kind of person who would not return a favour, said, “I know the whereabouts of a Nine States seal.”<br/><br/>“Where is it?”<br/><br/>Gu Yang looked up at him.<br/><br/>“The Gao Family’s secret vault.”<br/><br/>The Gao Family?<br/><br/>One of the nine surnames in the country, based in the north. So far, Gu Yang has had dealings with several major families, but has never encountered anyone from the Gao Family.<br/><br/>In fact, he had long suspected if Gao Fan had any connections with the Gao Family.<br/><br/>Now that Gao Fan had said so, it was almost an indirect admission of his relationship with the Gao family.<br/><br/>If he wasn’t from the Gao Family, how could he know there was a Nine States seal in the Gao Family’s secret vault?<br/><br/>Gu Yang asked, “Can you get it?”<br/><br/>“To the Gao Family, I’m already dead.”<br/><br/>This became difficult. This concerned one of the nine surnames in the world, which has Unleaking realm powerhouses to guard. To infiltrate their secret vault and get the seal, the power of the Unleaking realm is at least required.<br/><br/>Gu Yang wasn’t going to give up and asked, “So you can’t think of a way?”<br/><br/>Gao Fan slapped his thigh, “I got it. I have a great-granddaughter, who is exceptionally talented and is also on the Beauty list. If you can hook up with her, have her take out the Nine State Seal and give it to you.”<br/><br/>Gu Yang gave him a sideways glance, seriously doubting if he is taking advantage of him.<br/><br/>This old rogue.<br/><br/>He changed the topic and asked, “What’s the use of this Wu Earth Divine Cauldron?”<br/><br/>“It can gather the purest earth element from the world. With it, martial artists who practice the earth attribute technique can increase their cultivation speed by several, even up to ten times. Once they reach the Mana realm, the benefits are endless.”<br/><br/>Gu Yang was somewhat disappointed. In other words, this toy is of no use to him for now.<br/><br/>He practices the fire attribute technique.<br/><br/>If he could get his hands on a divine cauldron of the fire attribute, that would be good.<br/><br/>Gao Fan added, “This is just the basic function, once you reach the Celestial Being realm, you can use it as a weapon, its power is infinite.”<br/><br/>But that was a question for the future.<br/><br/>Gu Yang was toying with the divine cauldron in his hands when suddenly a prompt popped up in front of him, “Energy source detected, would you like to charge?”<br/><br/>Seeing this prompt, he was momentarily stunned, instinctively looked at the divine cauldron in his hand.<br/><br/>Then he was overjoyed, this thing can actually be used to recharge his energy?<br/><br/>He nearly couldn’t resist, and almost recharged it.<br/><br/>Stay calm!<br/><br/>This is the Nine Divine Ding, an ancient artifact.<br/><br/>He’d better keep it for now. He still has four units of energy left. When he’s at his wits’ end, it wouldn’t be late to recharge.<br/><br/>Gu Yang stored the Divine Ding and took out a Jiuzhou Seal.<br/><br/>After a while, another prompt popped up in front of him, [Energy source detected, recharge now?]<br/><br/>Sure enough, it could be done.<br/><br/>Apparently, such artifacts can serve as energy sources.<br/><br/>He had found another way to recharge, how awesome.<br/><br/>“I wonder if this would work?”<br/><br/>Gu Yang switched to the Phoenix Feather Knife.<br/><br/>Shortly after, a prompt appeared, [Sealed energy source detected, recharge now?]<br/><br/>He was even more convinced that divine weapons could also serve as energy sources.<br/><br/>By this calculation, he had quite a few things on him that could be used for recharging.<br/><br/>Originally, he was somewhat anxious with only four units of energy left. Now, he felt much calmer.<br/><br/>If all else fails, he could always charge the Phoenix Feather Knife.<br/><br/>But he wondered, how many units of energy does the Phoenix Feather Knife hold?<br/><br/>At this time, the abnormal phenomenon in the sky finally disappeared, and the terrifying pressure also dissipated along with it.<br/><br/>Obviously, Princess Chang had already arrived at the palace, and the Emperor, knowing his sister was safe, stopped the formation.<br/><br/>Suddenly, Gu Yang asked a question, “Why are there so few mana realm powerhouses in Divine City? Just one Red Sun from the Red Venerate Sect caused chaos in Divine City.”<br/><br/>Gao Fan sneered, “It’s all due to the Zhao Family’s own sins. Two hundred years ago, the Zhao Family had a mad Emperor who always thought people wanted to harm him. To eliminate potential threats, he set up a trap and killed several mana realm powerhouses, causing great turbulence.”<br/><br/>“From then on, powerhouses in the mana realm of all families would not stay in Divine City, so as to avoid having another madman from the Zhao Family.”<br/><br/>“Originally, the Zhao Family had master warriors insiders and three great devotees outside, enough to protect the safety of Divine City. However, eighteen years ago, in the battle with the Wu Family, two of the three great devotees died and one was injured. The Zhao Family lost a major force. That’s what led to the current situation.”<br/><br/>So, such things happened.<br/><br/>Isn’t that paranoid?<br/><br/>Why does the Zhao Family produce so many eccentric Emperors? The fact that Great Zhou could last for five hundred years is indeed impressive.<br/><br/>Gu Yang felt emotional.<br/><br/>“Brother Gu!”<br/><br/>Suddenly, Cheng Qingyu’s voice came from outside the door, and she appeared at the door, then suddenly stopped, retreated outside and gave a knock before coming in.<br/><br/>“Someone from the palace is here, and they brought many, many things. You’d better see it for yourself.”<br/><br/>As Gu Yang looked outside, indeed, there were many, many items. Judging from this grandeur, it was even more exaggerated than when the King of Jinghai gifted presents during his visit to Jingzhou. A long line of people had formed outside.<br/><br/>An eunuch in a shrill voice said, “Gu Yang, receive the decree.” He opened a royal decree and began to read it out loud.<br/><br/>Gu Yang stood there to receive the decree. Once reaching the Divine Power realm, one doesn’t need to kneel down. This custom started from the Qin Dynasty and was also continued in Great Zhou.<br/><br/>The content of the decree was to grant him and Miss Su of the Su Family a marriage, letting them choose a date for the wedding.<br/><br/>In addition, there were a lot of rewards, among them, a mansion, two divine weapons, as well as all kinds of gold, silver, jewels, silks and satins. There were too many items, only the most important ones were mentioned.<br/><br/>“Congratulations to Master Gu, congratulations to Master Gu.”<br/><br/>The eunuch offered his warm congrats with a smiling face.<br/><br/>Gu Yang did not expect the Empress’ actions to be so fast, and it was obvious she had planned this beforehand.<br/><br/>He’d guess the moment he stepped out of the palace, the gift delivery people were already ready to leave.<br/><br/>Next door, Gao Fan and Cheng Tianxin’s several personal discipline students were watching the drama unfold. Upon hearing the content of the decree, they were somewhat surprised.<br/><br/>The Empress actually wanted to marry her sister to Gu Yang.<br/><br/>This was not a trivial matter.<br/><br/>The news of several great powers in Divine City wanting to win over Gu Yang had long been spread.<br/><br/>Now it seemed like the Empress had taken the first step. Once her sister marries Gu Yang, wouldn’t they be part of the same family?<br/><br/>The key point was, would Gu Yang accept it?<br/><br/>Before Gu Yang could react, a loud shout came from outside, “Wait.”<br/><br/>PS: Seeking monthly votes for the second update.\t\t\t\t\t\t</div>", "images": {}, "success": true}