{"id": 208, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132016.html", "title": "Chapter 208 - Chapter 208: 208 Celestial Beings", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 208 - Chapter 208: 208 Celestial Beings</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 208: 208 Celestial Beings<br/><br/>Translator: 549690339<br/><br/>Star Plucking Tower, is the tallest building in the academy, with a total of nine floors.<br/><br/>Each floor contains various puzzles involving a wide range of topics from medicine, divination, to astronomy, it covers almost everything.<br/><br/>These puzzles are proposed either by professors or students.<br/><br/>The disciples of the academy take pride in solving the puzzles of the Star Plucking Tower.<br/><br/>Once a puzzle is solved, the solver’s fame spreads throughout the academy.<br/><br/>Ye Lingbo’s status as the top disciple, is not just because she has the highest cultivation level, but also because she has solved the most puzzles in the Star Plucking Tower.<br/><br/>On the ninth floor of the Star Plucking Tower, there is a puzzle set by the dean that has been hanging there since the founding of the tower; no one has been able to solve it for hundreds of years.<br/><br/>At this moment, Gu Yang has arrived at the ninth floor of the Star Plucking Tower and is about to meet one of the most legendary characters of the past thousand years, the dean of the academy.<br/><br/>The dean of the academy, surnamed Ren, was born into an ordinary bureaucratic family in Qin Dynasty. He later voluntarily joined the camp of the Great Zhou Taizu.<br/><br/>It is said that at the time of the founding of the Great Zhou, he only had the cultivation level of Golden Body Stage One, which among all the nobles and marquises was considered to be at the very bottom; he was not remarkable.<br/><br/>The reason he was able to serve as the dean of the academy was because among all the civil servants, he had the highest cultivation level. Among all the military generals, he had the highest literacy.<br/><br/>As a result, he was appointed dean of the academy by the Great Zhou Taizu.<br/><br/>For the next hundred years, he kept a low profile, not participating in court disputes, but instead dedicated himself to teaching in the academy.<br/><br/>Until the death of the Great Zhou’s Taizu, when there was a great upheaval in the palace and a terrifyingly powerful being descended.<br/><br/>The Divine City was on the brink of danger when a sword light came from the academy, repelling the terrifyingly powerful figure.<br/><br/>Only then did people realize that the seemingly insignificant dean of the academy was actually a Celestial Being, whose one action had managed to turn the tide.<br/><br/>From then on, the dean of the academy became a legend.<br/><br/>Since the fall of the Xia Dynasty, he was the second person to become a Celestial Being.<br/><br/>No one knows how this seemingly mediocre dean managed to cross the Mana realm and the Unleaking Realm to achieve the status of a Celestial Being in just a short hundred years.<br/><br/>Even more mysteriously, no one knows what techniques he practices.<br/><br/>Even Wu Er does not know.<br/><br/>This Celestial Being seldom shows himself and rarely takes action. Wu Er only knows of three instances.<br/><br/>The first was four hundred years ago, at the time of the death of the Great Zhou’s Taizu.<br/><br/>The other one was when Dao Sect was on the brink of annihilation.<br/><br/>Both times, the opponent was the same person, the one from the Red Bright Heaven.<br/><br/>The last time was against the powerful Unleaking Realm expert from the Gu family.<br/><br/>Strictly speaking, that didn’t count as taking action, because he didn’t even lift a finger, and the one from the Gu family had already lost.<br/><br/>As Gu Yang was thinking, a door suddenly appeared out of nowhere in front of him.<br/><br/>Zhou Zongye next to him said, “Go in, the dean is waiting for you.”<br/><br/>Gu Yang calmly walked in. In the simulation, he had met this dean before, so there was no danger.<br/><br/>Behind the door was a Secret Realm, lush with vegetation. One could even hear the sounds of birds chirping and insects humming, which indicated that this massive Secret Realm had formed its own unique ecosystem.<br/><br/>There was a small courtyard ahead.<br/><br/>The door was open.<br/><br/>Gu Yang walked up and saw a middle-aged man in a green robe in the courtyard.<br/><br/>He was lying on a recliner, holding a book in his hands. His feet were resting on a stool and he was gently shaking them.<br/><br/>This reclusive, ordinary-looking powerhouse, one of the very few in the human realm, didn’t exhibit any intimidating characteristics common amongst strong figures.<br/><br/>If Gu Yang had to describe him, he would probably say, “the epitome of simplicity and genuine authenticity.”<br/><br/>“Sit.”<br/><br/>The middle-aged man spoke without taking his eyes off the book; his attention was completely focused on it.<br/><br/>Out of the corner of his eye, Gu Yang glanced at the book cover, but could only make out three characters: Legendary Swordsmen.<br/><br/>Um, it seemed, probably, could be, a novel by its title?<br/><br/>A supreme expert at the Celestial Being realm, casually lying in the courtyard reading a novel?<br/><br/>He had thought about the impressive scene meeting the dean would be.<br/><br/>But he never expected to encounter such a laid-back dean. For a moment, he didn’t know what to say.<br/><br/>“You want to kill Zhao Yu?”<br/><br/>The dean’s voice interrupted his thoughts all of a sudden.<br/><br/>Gu Yang hurriedly nodded, “Yes.”<br/><br/>Zhao Yu is the name of the current emperor.<br/><br/>“And how do you plan to kill him?”<br/><br/>“Well, I suppose with a knife.”<br/><br/>“Your knife can’t kill people.”<br/><br/>Just as Gu Yang was about to respond, the Phoenix Feather Knife in his hand vibrated, flew up on its own, and hovered in midair.<br/><br/>The dark color on the blade slowly faded away.<br/><br/>In an instant, the blackness had completely faded, revealing its original sharpness.<br/><br/>When the Phoenix Feather Knife fell back into his hand, Gu Yang felt a connection, as if he was connected by blood to the knife.<br/><br/>He felt somewhat elated, “Thank you, Dean.”<br/><br/>Throughout the whole process, the dean did not lift his hand, saying, “Alright, go.”<br/><br/>“There is something else I want to report.”<br/><br/>“Speak.”<br/><br/>“Soon, the Nether Sect will launch a large-scale attack…”<br/><br/>The dean flipped a page of the novel in his hand, his eyes never leaving the book, waited until he finished speaking, and responded, “It must be that Dragon Turtle, this is a bit tricky.”<br/><br/>He didn’t ask Gu Yang why he knew these things, he directly asked, “Can you do me a favor?”<br/><br/>“Dean, please say.”<br/><br/>“Go with Ling Bo, find someone.”<br/><br/>“Alright.”<br/><br/>“Don’t continue training before you get the general outline of the Extreme Yang True Gang.”<br/><br/>“General outline?”<br/><br/>Gu Yang was shocked, so there’s a general outline of this Cultivation Method?<br/><br/>From his point of view, only when you get the general outline can you learn this Cultivation Method.<br/><br/>He quickly asked, “Dean, do you know where the general outline is?”<br/><br/>“The Imperial Jade Seal.”<br/><br/>Right!<br/><br/>The inheritance of the Nine Law Mantras is contained in the nine pieces of the Nine Provinces Seal.<br/><br/>So the general outline is naturally in the Imperial Jade Seal.<br/><br/>After the extinction of the Xia Dynasty, the Imperial Jade Seal was obtained by the Qin Dynasty. After the Qin Dynasty fell, it fell into the hands of the Zhou Family.<br/><br/>Well, there’s another reason to kill the emperor.<br/><br/>Gu Yang still felt a little uneasy, “What if Chi Ming Tian makes a move?”<br/><br/>“If the sky collapses, there will be tall ones holding it.”<br/><br/>Alright, since you say so, I won’t worry unnecessarily.<br/><br/>Gu Yang was just about to say goodbye, suddenly his vision blurred, and he had returned to the Star Picking Tower.<br/><br/>“Call Ling Bo over, she knows how to find that person.” The voice of the dean rang in his ear.<br/><br/>Soon, Zhou Zongye fetched Ye Lingbo.<br/><br/>She stood next to Gu Yang and said, “Give me your hand.”<br/><br/>Gu Yang did as he was told and held her hand. A faint blue light shone from her brow, illuminating the space in front of them, causing ripples in it.<br/><br/>Then, he was pulled through the space by Ye Lingbo.<br/><br/>After a brief dizziness, the two had arrived on a beach.<br/><br/>Gu Yang stepped on the soft sand, clearly feeling that the environment here was completely different from Great Zhou. If he had to describe, it was flourishing and full of life.<br/><br/>He asked, “What place is this?”<br/><br/>Ye Lingbo was a bit weaker and said, “Water Moon Cave Sky.”<br/><br/>Indeed, it’s a Cave Sky World.<br/><br/>“Is there a Sect here called the Water Moon Sect?”<br/><br/>Ye Lingbo was a bit surprised, “How do you know?”<br/><br/>“Just guessing.”<br/><br/>Indeed, there is one. How many Cave Sky Worlds are connected in this world?<br/><br/>However, in the Simulation, there was no sign of a Sect called Water Moon Sect invading Great Zhou.<br/><br/>At least, he didn’t find it.<br/><br/>Gu Yang asked about the real issue, “Who are we looking for?”<br/><br/>Ye Lingbo answered, “The head of the Dao Sect.”<br/><br/>Turns out it’s the head of the Dao Sect, one of the six Sects. He is actually hiding in this Cave Sky World.<br/><br/>According to Wu Er, the Dao Sect was almost destroyed by Chi Ming Tian, and only one successor was left. It must’ve been saved by the dean.<br/><br/>Speaking of which, there must be some relationship between Ling Ling and the Dao Sect, otherwise how could she get the inheritance of the Dao Sect’s supreme method, the Extreme Yang True Gang?<br/><br/>Wu Er didn’t mention what the relationship between Ling Ling and Dao Sect was.<br/><br/>He curiously asked, “Why does the dean of the Dao Sect have to hide here?”<br/><br/>This is a strong person of the Unleaking Realm. If he stays at the academy, even if the Nether Sect attacks, it wouldn’t be a total defeat.<br/><br/>Ye Lingbo said, “She is in the peak of the Unleaking Realm, and is trying to break through to the Celestial Being Realm.”<br/><br/>Gu Yang was moved by this. He remembered the previous simulations when Ye Lingbo reached the peak of the Unleaking Realm, she would leave the Secret Realm to look for an opportunity to break through. Perhaps this has to do with some secret.<br/><br/>He asked, “Can’t it be done outside?”<br/><br/>“No.”<br/><br/>“Why?”<br/><br/>“Because, the Way of Heaven is dead.”<br/><br/>PS: Thirdly, I ask for the monthly pass.\t\t\t\t\t\t</div>", "images": {}, "success": true}