{"id": 205, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132010.html", "title": "Chapter 205 - Chapter 205: 205 Human Realm Purgatory", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 205 - Chapter 205: 205 Human Realm Purgatory</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 205: 205 Human Realm Purgatory<br/><br/>Translator: 549690339<br/><br/>When Gu Yang arrived at the residence of Minister of State, the gatekeeper he had seen before was still there.<br/><br/>Before he could knock, the gatekeeper rushed to open the door and announced his arrival, causing quite a stir.<br/><br/>To be honest, if it was possible, Gu Yang would rather not come here again. After the engagement incident, it always felt awkward to see Miss Su Er.<br/><br/>However, he had no other choice this time.<br/><br/>The imperial palace was a no-go. That was the emperor’s home turf. Once inside, his True Essence would be suppressed, and he could only endure any blows thrown his way.<br/><br/>If the emperor decided to hole up inside the palace, relying on the suppressive force within and the three Unleaking Realm guards, he was practically invincible.<br/><br/>Even if a Celestial Being entered, they might not be able to kill him.<br/><br/>Therefore, to eliminate the Emperor, he had to rely on the Empress.<br/><br/>Gu Yang had no choice but to seek Miss Su Er, asking her to remind the Empress.<br/><br/>He believed in the Empress’s abilities; he speculated that once alerted, she would not fall victim to the Emperor easily.<br/><br/>Either way, it was going to be a thrilling marital battle in the future.<br/><br/>During his visit to the Minister of State’s residence, Gu Yang received the highest honors. Even the Minister and his wife personally welcomed him and treated him as a distinguished guest.<br/><br/>Firstly, he had saved the Minister’s life.<br/><br/>Secondly, he had just defeated Lin Ruo Xi, who was at the Golden Body triple realm.<br/><br/>Just because of the second point alone, the previous unpleasantness seemed insignificant.<br/><br/>This Minister of State truly was an interesting character — unlike other high-ranking officials who put on airs, he was warm without being ingratiating, which sat well with Gu Yang.<br/><br/>When the Minister learned that Gu Yang had come to see his daughter, he didn’t mind either and even sent someone to inform her.<br/><br/>After a while, Miss Su Er arrived, and the Minister tactfully found an excuse to leave, leaving them alone to talk.<br/><br/>Gu Yang cut to the chase, “What kind of person is the present Emperor?”<br/><br/>Su Ningyan was taken aback for a moment, then shook her head, “I’ve only met him a few times. He seems to be a very kind person, but his health is failing.”<br/><br/>When speaking of the Emperor, there was no reverence in her tone. It was as if she was evaluating an ordinary person. This was the self-confidence of a Divine Power realm expert.<br/><br/>Gu Yang said, “I heard he’s so weak that he has to stay in bed, and had no choice but to entrust all state affairs to the Empress.”<br/><br/>“What exactly are you trying to say?” Su Ningyan asked bluntly.<br/><br/>Gu Yang said, “Have you heard of the Heavenly Extreme Divine Method?”<br/><br/>“It’s a mysterious technique created by the Heavenly Extreme Taoist. It allows one to absorb other people’s skills, essence, and even their source for personal use.”<br/><br/>Su Ningyan was knowledgeable about the Heavenly Extreme Taoist from her investigations on Gu Yang’s origins. Especially since he first appeared in Lian Mountain.<br/><br/>Gu Yang didn’t continue the topic. After talking a bit more, he took his leave.<br/><br/>After he left, Su Ningyan fell into deep thought.<br/><br/>Imperial Palace, Qi Feng Pavilion.<br/><br/>The Empress was sitting at a table, reading through the official documents. Ever since the Red Venerate Sect publicly re-emerged, the reports from the various regions had increased.<br/><br/>Among them, there were signs of instability in many remote regions.<br/><br/>Historically, whenever the Red Venerate Sect started causing trouble, there would be unrest. She had to prepare in advance.<br/><br/>Suddenly, the bronze mirror on her desk lit up, displaying lines of text.<br/><br/>At the sight of the words “Heavenly Extreme Divine Method? The Emperor?”, the Empress paused, “Summon Lai Baocheng.”<br/><br/>Truthfully, when the Emperor activated the great formation of the palace a few days ago, she had felt that something was amiss.<br/><br/>However, as there were no abnormalities from the Emperor’s side these days thereafter, she had let her guard down.<br/><br/>Now that she received the alert, she instinctively felt danger. She couldn’t help but take it seriously.<br/><br/>Regardless, it was necessary to investigate.<br/><br/>After Gu Yang had warned Miss Su Er, he returned to Tianxin Martial Arts Hall, activated the system, and resumed the simulation.<br/><br/>In the end, personal strength was what mattered most. As long as he became strong enough, no threats could scare him.<br/><br/>[At 22, you’ve advanced to the second tier of the Golden Body and defeated Lin Ruo Xi at the Martial Academy gate, causing a sensation throughout the world.]<br/><br/>[You leave Divine City with Ye Ling Bo, proceeding to Tianzhu Mountain, and enter the Secret Realm to cultivate.]<br/><br/>[Eight years later, Ye Lingbo reached the peak of the Unleaking Realm and for the purpose of assaulting the Celestial Being realm, he left the Secret Realm in search of an opportunity to break through.]<br/><br/>[Three years later, the entrance to the Secret Realm abruptly collapsed. You were forced to leave the Secret Realm and discovered that the Human Realm had become a purgatory. As soon as you emerged, you were besieged by countless Ghostly Beings.]<br/><br/>[A year later, you were attacked by several Ghostly Beings at the Mana Realm, and fell on the battlefield, at the age of 36.]<br/><br/>What is happening here?<br/><br/>The Human Realm has turned into purgatory, and Ghostly Beings are rampant. Is it Cthulhu?<br/><br/>This situation is even more terrifying than the invasion of the Star Luo Sect and Wanxiang Gate.<br/><br/>The question is, how did it end up like this?<br/><br/>Where are the Four Great Sacred Lands?<br/><br/>What about Luo Wang? How about Qin Wu? Where is Ye Lingbo?<br/><br/>“Did I somehow ruin this world?”<br/><br/>Gu Yang felt an inexplicable concern.<br/><br/>Upon reflection, he decided that everything had primarily to do with the emperor. The key was the Heavenly Extreme mystical power and most importantly, the hidden mastermind behind the scenes, Chi Mingtian!<br/><br/>The one who swayed the Heavenly Extreme Taoist was Chi Mingtian itself.<br/><br/>The one who passed “God Destroyer Nine Styles” and “Heavenly Elemental God Slaying Art” to the Wu Family was also Chi Mingtian.<br/><br/>The one who incited the Red Venerate to rebel and stir up battles in the world was still Chi Mingtian.<br/><br/>No matter whether it’s the Heavenly Extreme mystical power or the God Destroyer Nine Styles, none were proper techniques, reflecting a sense of evil.<br/><br/>Chi Mingtian is clearly no good.<br/><br/>There’s a high probability that it single-handedly turned the Human Realm into a purgatory.<br/><br/>In other words, the Empress was unable to overcome the Emperor.<br/><br/>[Simulation ends, you can keep one of the following.]<br/><br/>[1. The Martial Arts realm at the age of thirty-six.]<br/><br/>[2. The Martial Arts experience at the age of thirty-six.]<br/><br/>[3. The life wisdom at the age of thirty-six.]<br/><br/>“I choose the first.”<br/><br/>Immediately, Gu Yang was enveloped in a layer of blazing flames, transforming into a Phoenix once more.<br/><br/>The fourth level of the “Divine Phoenix Manual” was complete!<br/><br/>Following that, he also transformed into a White Tiger and a Black Tortoise.<br/><br/>“Divine Tiger Manual” and the “Divine Turtle Manual” also reached the second level.<br/><br/>When everything quieted down, he opened his eyes and saw Xi Huang standing in front of him, her eyes filled with shock.<br/><br/>Gu Yang sighed inwardly, knowing that he could not hide it. The “Nine Heavens Divine Method” is the technique of Xia Emperor, she was bound to recognize it.<br/><br/>Just as he was about to speak, Xi Huang exclaimed, “Father, why have you chosen to fuse so many bloodlines? The consequences would be unthinkable if a conflict occurred.”<br/><br/>“Daughter, I know you’re trying to follow the Xia Emperor’s path and merge the bloodlines of nine divine beasts in order to break through the Celestial Being realm’s limitation, but that’s too dangerous. Although the Xia Emperor was born extraordinary, he has nine Original Spirits which allowed him to master this technique. You, father, even though you have the ability to undergo ‘Niepan’, it’s not worth taking such a risk for it.”<br/><br/>Gu Yang was stupefied. He genuinely hadn’t thought about this, “Why does the Xia Emperor have nine Original Spirits?”<br/><br/>“Some claim that he is the offspring of an ancient mythical beast with nine heads. Others speculate that he cultivated some sort of ancient Divine Power. This is precisely why he was able to wield the power of nine divine beasts in one body, and be invincible in the world.”<br/><br/>So in other words, none of these powerful techniques isn’t without its flaws.<br/><br/>Gu Yang felt that he needed to understand more about the Xia Emperor, therefore it was necessary to avoid being led astray by this technique.<br/><br/>However, so far, he hasn’t felt any conflict from several bloodline powers.<br/><br/>With the overlap of four bloodline powers, the strength of his Mortal Body had reached a frightening level that even the Golden Body of the third realm could not be matched with him.<br/><br/>There’s no need to worry about this issue in a short time.<br/><br/>The more pressing issue is how to deal with that emperor.<br/><br/>If this person is not dealt with, the entire Human Realm will become purgatory in a decade or so, and no one will survive.<br/><br/>After sending Xi Huang away, Gu Yang opened the system again and initiated another simulation.<br/><br/>[At the age of 22…]<br/><br/>[You travel to Star Picking Pavilion and request to meet the college director. After being granted an audience, you informed the director about the impending attack by the Nether Sect…]<br/><br/>PS: It’s the 28th, only a few days left. If you have any monthly tickets left, hurry and vote. If not used, they will expire.\t\t\t\t\t\t</div>", "images": {}, "success": true}