{"id": 209, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132018.html", "title": "Chapter 209 - Chapter 209: 209 Another Practice System", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 209 - Chapter 209: 209 Another Practice System</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 209: 209 Another Practice System<br/><br/>Translator: 549690339<br/><br/>The Way of Heaven is dead?<br/><br/>Gu Yang didn’t quite understand, but he was greatly shocked, and asked, “What do you mean?”<br/><br/>Ye Lingbo said, “Think carefully about it, and you’ll understand.”<br/><br/>Gu Yang could only temporarily suppress this question, and asked, “Now, where do we find people?”<br/><br/>“I don’t know.”<br/><br/>“You don’t know?”<br/><br/>“The Cave World is vast, searching will have to be gradual. Let’s first find a place where there are people, and inquire about news.”<br/><br/>“Alright.”<br/><br/>Gu Yang had already sensed people, he grabbed her hand, and soared into the sky.<br/><br/>Outside Huang Family Town, a disheveled Daoist was walking towards a dilapidated temple outside the town, followed at a distance by a yellow-faced child.<br/><br/>“Huang Si, it’s getting dark, don’t go.” A girl of the same age followed him, a bit scared, and grabbed him.<br/><br/>“If you’re scared, you can go back first.”<br/><br/>The yellow-faced child shook her hand off and ran off quickly.<br/><br/>Seeing his receding figure, the girl stamped her feet in anxiety and ran back to inform Huang Si’s family.<br/><br/>Huang Si’s full name is Huang Yongkang, he’s nine years old this year, and his family is among the well-off in the town, owning a shop.<br/><br/>Since childhood, he had been extremely fascinated with the tales of sword immortals and strange events, dreaming that one day he will encounter an immortal and achieve immortality.<br/><br/>Today, he met a slovenly Daoist, saw him use magic with his own eyes, realized that his chance at immortality had come, and thus followed him.<br/><br/>Unconsciously, it was already dark.<br/><br/>Huang Yongkang was indeed bold. As it got more secluded around and the day turned to night, this child was not scared at all.<br/><br/>Speaking of the disheveled Daoist, he came to a ruined temple, abruptly stopping and said in stern tone, “Zhu Shun, if you are wise, give up the Moonlight Sword, otherwise, you won’t leave here today.”<br/><br/>From within the temple, a hearty voice echoed, “I was wondering who it was, so it’s Crow Daoist. Just on your own, you want to seize the Moonlight Sword, I’m afraid you are not yet qualified.”<br/><br/>“What if you add me?”<br/><br/>An old woman walked out from the woods, with a green snake coiled around her shoulder. Its tongue flicking, a pair of green eyes. Huang Yongkang, who was hiding on the side, shivered with fear.<br/><br/>Inside the temple, the hearty voice said, “It turns out to be Poison Granny. I didn’t expect to meet two evil experts in the wild.”<br/><br/>“And me too.”<br/><br/>A delicate voice followed, and a woman draped in gauze walked out. Her body was graceful, while the essential parts were slightly visible.<br/><br/>Huang Yongkang, who was innocent, was so excited that his face turned red, and he quickly looked away.<br/><br/>“Even the Peach Blossom Fairy is here. It seems that it’s inevitable today. Just want to ask, how do you three plan to divide the Moonlight Sword?” said the man in the dilapidated temple, his voice growing heavier with each word.<br/><br/>As these words fell, the faces of the three outside changed.<br/><br/>Crow Daoist shouted, “Don’t waste time. Do it.”<br/><br/>Immediately, a flock of black crows flew out from the woods and flew towards the temple.<br/><br/>The other two also moved. The old woman took off a black pouch, and when she flicked it, a black snake as thick as a bucket appeared and moved towards the temple.<br/><br/>The woman took out a fan and with a flick, a pink mist rolled up and spread towards the temple.<br/><br/>Suddenly, a golden light appeared like a giant bell, covering the temple.<br/><br/>The black crows, the black giant snake, and the pink mist were all blocked outside.<br/><br/>The Crow Daoist sneered, “How long can this Diamond Bell Shield hold up?”<br/><br/>He pinched a spell, and the flock of black crows all opened their mouths and spat out a flame. The golden light wobbled under the heat.<br/><br/>“What are you two waiting for? If you don’t make a move, are you planning to let others take advantage?”<br/><br/>Poison Granny snorted coldly, and without any noticeable movement, the giant snake opened its mouth and spat out poison. Touching the golden light, it immediately corroded a big hole.<br/><br/>“Brother Crow really has a manly spirit, it tickles me.”<br/><br/>The Peach Blossom Fairy giggled, took out a talisman, pinched a spell, and threw it.<br/><br/>Boom!<br/><br/>A thunderbolt appeared out of thin air and struck the Diamond Bell Shield. With a loud noise, it broke apart.<br/><br/>Huang Yongkang on the side was dumbstruck and excited.<br/><br/>Those tales were indeed true, magic really does exist.<br/><br/>Only, these people who used magic, were somewhat different from his imagination.<br/><br/>At this moment, up in the sky, Gu Yang was holding Ye Lingbo, attentively observing the magic duel of the group below.<br/><br/>He had expected the cultivation system in the Dongtian world to differ significantly from that of Great Zhou, but he never anticipated such a massive difference.<br/><br/>This experience was a true eye-opener for him.<br/><br/>The four individuals duelling magic below possessed energy equivalent to that of a Fourth or Fifth Rank martial artist.<br/><br/>However, the power they wielded was by no means weak.<br/><br/>Whether it was the flock of crows, the giant snake, or the lightning bolt, all had killing power superior to the ordinary First Rank martial artist.<br/><br/>And that Vajra cover was tougher than a steel plate.<br/><br/>Whether it was a crow that could breathe fire, a bag that could hold a giant snake, or a Fu talisman that could store a lightening bolt, he had never seen such feats in Great Zhou.<br/><br/>This cultivation system was closer to an immortal cultivator’s.<br/><br/>The cultivator’s internal True Essence was weak, but it could trigger force that exceeded his own by ten times, or even dozens of times.<br/><br/>That thought was indeed terrifying.<br/><br/>Even if the sealed Phoenix Feather Knife was unsealed, it could not possibly offer him such tremendous amplification; a multiplier of two or three-fold was already considered an unrivalled divine weapon.<br/><br/>Gu Yang could feel that the vitality of the world was unusually active while the people below were duelling, clearly resonating with the world’s atmosphere in some way and mobilizing the forces of nature.<br/><br/>Wasn’t this a feature of the Mana Realm?<br/><br/>Gu Yang became increasingly intrigued by the cultivation system of this world.<br/><br/>Just then, the situation of the battle below changed.<br/><br/>After the Vajra cover was shattered, the ruined temple underwent a violent explosion. Immediately, a shadow shot into the sky, riding on the wind.<br/><br/>This person’s cultivation level was equivalent to a Third Rank martial artist, yet he could fly. This revelation was yet another eye-opener for Gu Yang.<br/><br/>At this point, Zhu Shun, who had just escaped from the ruined temple at the cost of self-destruction of his magical tools, looked up. By the light of the explosion, he saw a man and a woman hanging in the air. His face drained of color, “Foundation Establishment Stage?”<br/><br/>Despair filled his heart.<br/><br/>Originally, he was confident that the three people below could not catch up to him with his Wind-Riding Talisman.<br/><br/>But to his surprise, a powerful cultivator at the Foundation Establishment Stage was lurking in the sky.<br/><br/>Now, his situation could only be described as being unable to sprout wings and fly away.<br/><br/>He was a lone cultivator and had braved countless dangers throughout his cultivation journey.<br/><br/>After reaching the seventh level of qi refining, he had made no further progress. For a full decade, he had been seeking opportunities everywhere, to no avail.<br/><br/>Now, he finally obtained a significant stroke of luck. With the Moonlight Sword, he could acquire an authentic sword manual from a prestigious sect.<br/><br/>He was not willing to give up!<br/><br/>Thinking of this, Zhu Shun’s face twisted, “Die!”<br/><br/>He threw out a red ball about the size of a pigeon’s egg.<br/><br/>This was his final life-saving measure, the Sky Thunder Seed. Although it looked small, once detonated, it could produce an attack on par with the full strength of a cultivator in the peak of the Foundation Establishment Stage. If used in a sneak attack, even a Golden Core expert would be injured.<br/><br/>The Sky Thunder Seed flew straight toward the man and woman.<br/><br/>Zhu Shun was overjoyed in his heart, realizing that he had encountered tenderfoots who dared to let the Sky Thunder Seed approach them. At this moment, they were surely doomed…<br/><br/>Just as the Sky Thunder Seed was about to explode, an invisible force squeezed it. Before it could fully explode, it was extinguished and vanished into thin air.<br/><br/>“This”<br/><br/>Zhu Shun’s face went blank.<br/><br/>How could this be possible?<br/><br/>That person didn’t use any magic, yet he used his True Essence to confine the explosion of the Sky Thunder Seed to a minimal range.<br/><br/>Was this something a human could do?<br/><br/>“Sky Thunder Seed!”<br/><br/>The three below were also knowledgeable; they were already taken aback by the duo’s display. When Zhu Shun took out that thing, they broke out in a cold sweat.<br/><br/>That Zhu Shun even possessed such a terrifying thing. If it were used against them, the outcome would be unimaginable.<br/><br/>In the end, the man in the sky simply extinguished the Sky Thunder Seed, leaving them stunned. They stood still, not daring to move.<br/><br/>Cold sweat soaked their clothes.<br/><br/>PS: It’s the 29th, seeking monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}