{"id": 201, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132003.html", "title": "Chapter 201 - Chapter 201: 201 You Are Gu Yang?", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 201 - Chapter 201: 201 You Are Gu Yang?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 201: 201 You are Gu Yang?<br/><br/>Translator: 549690339<br/><br/>Not far away, a luxurious carriage was racing towards them.<br/><br/>“Your Highness, let’s return to the palace first. If the emperor knew that you returned to Beijing without paying respects, he would be angry.” Inside the carriage, an old man advised. His voice was sharp and thin, clearly an eunuch.<br/><br/>The one dubbed as “Your Highness” was none other than Zhao Yu, the third princess of the current dynasty. She sat there, as if she hadn’t heard the old man’s words, lost in her thoughts and nonresponsive.<br/><br/>The old man sighed inwardly. Ever since two days ago, when the third princess heard that Gu Yang had reached the Divine Power Realm, she had been like this.<br/><br/>The princess was always arrogant from a young age and regarded her aunt as her role model. She intended to make all the men in the world bow down to her.<br/><br/>Before she met Gu Yang, she did not regard anyone of her age group as her equal, including Ye Lingbo from Wen Institute, the rumored reincarnation of an ancient powerful figure, she was absolutely confident.<br/><br/>A short while ago in Jiangzhou, she personally witnessed Gu Yang defeat Lin Yimo, another in the Divine Power Realm, and she received her first setback.<br/><br/>However, that setback did not crush her. On the contrary, it ignited her fighting spirit. She resolved to break through to Divine Power Realm as soon as possible and to achieve a stronger cultivation level than Gu Yang’s.<br/><br/>To her dismay, she heard the news less than a month later. Gu Yang had already advanced to Divine Power Realm first.<br/><br/>This delivered a massive blow to the third princess. Not only was she weaker than him, but now even her cultivation level was inferior to his.<br/><br/>Originally, the third princess had planned to travel around in search of a breakthrough opportunity.<br/><br/>Now that this happened, she did not have the mood anymore. She let the old man escort her, and flew back to Divine City.<br/><br/>The first thing she did after she arrived at the Divine City was to visit the Martial Arts Institute.<br/><br/>The third princess had had many teachers, but she truly regarded only one person as her master, who was the dean of the Martial Arts Institute.<br/><br/>Whenever she faced difficulties in martial arts, she would go to the dean for advice.<br/><br/>This time was no exception.<br/><br/>The old man knew that she was suffering from self-doubt after experiencing such a large setback for the first time. Someone needed to guide her.<br/><br/>Suddenly, there was the sound of horse hooves behind them.<br/><br/>He suddenly felt a surge of fear.<br/><br/>There were clearly two sets of hoof beats outside, yet he sensed only one person’s presence. There was no one on the other horse. Anyone who could trick his perception must be a terrifyingly powerful warrior.<br/><br/>“Senior, what is that place ahead?”<br/><br/>“Martial Arts Institute.”<br/><br/>The two of them sped past the carriage during their conversation.<br/><br/>The old man quietly lifted a corner of the curtain and looked out. When he saw the side profile of that man, he recognized who it was. His face changed, “It’s him!”<br/><br/>Lin Ruo Xi was a standout figure twenty years ago. He was once ranked first on the First-Rank list, and his fame was no less than that of King Jing Hai at the time.<br/><br/>In just a short span of twenty years, he had already advanced to the third level of the Golden Body Realm. He truly was an extraordinary prodigy.<br/><br/>The old man held a critical position in the palace and was always responsible for intelligence work. Although he was not part of the government, he still kept abreast of important intelligence.<br/><br/>A few days ago, Lin Ruo Xi suddenly left seclusion and sent a challenge letter to Chen Wen Yuan of the Chen family.<br/><br/>He also knew that Lin Ruo Xi was ambushed by a third-level Golden Body disciple of the Nether Sect on the way.<br/><br/>However, the Nether Sect disciple had his entire corpse destroyed and had to flee in shame.<br/><br/>From this, one could catch a glimpse of this man’s strength.<br/><br/>He heard that Lin Ruo Xi had also received guidance from the dean of the Martial Arts Institute when he was younger. He was likely here to pay a visit to the dean.<br/><br/>In a short while, Lin Ruo Xi had already arrived at the entrance of the Martial Arts Institute. He pulled on the reins and stopped his horse, then he looked towards the leaderboard in the distance with a sharp gaze.<br/><br/>Naturally he was looking at the Master’s List. It was as if he wanted to memorize every single name on it.<br/><br/>The Golden Body realm was merely the starting point of the Divine Power Realm. Only when one reached the Mana Realm, could they embark on the path to immortality.<br/><br/>The twenty individuals on the Master’s List were top existences in the Mana Realm. They were also his future targets.<br/><br/>This list had remained the same for the past twenty years.<br/><br/>Twenty years ago, when he was on the First-Rank list, the same twenty people were also on the Master’s List.<br/><br/>Suddenly, he heard a familiar name, “Who on earth is this ninth person on the Talent list, Jiao Shumo? It seems like I have never heard of him before.”<br/><br/>“Looking at the explanation above, he is from Yuzhou. Could it be that like Liu Zhe, he also comes from an influential local family?”<br/><br/>Lin Ruo Xi gave Jiao Shumo, who was behind him, a glance. The ones he took note of definitely wouldn’t be ordinary people. At a tender age, he had already achieved First-Rank cultivation level.<br/><br/>Even at his prime, he was slightly inferior. Such a prodigy aroused his fondness for talents, especially after learning about his background.<br/><br/>He said, “My family has strict rules, and I cannot take you as my disciple. However, if you wish, you may join the Martial Arts Institute. The dean is knowledgeable in both celestial and human knowledge. Under his guidance, your future achievements will not be inferior to mine.”<br/><br/>“Of course, you can also join the Wen Institute. The environment there for studying martial arts is excellent. It’s also a good choice.”<br/><br/>Jiao Shumo gratefully said, “Thank you for your guidance, senior. Let me think about it.”<br/><br/>Lin Ruo Xi nodded. Just when he was about to enter the Institute, he suddenly sensed something. He turned around and looked, then his eyes lit up.<br/><br/>“Jiao Shumo?”<br/><br/>Gu Yang had yet to snap out of his shock from the title of “Most Handsome Man in the World” when he heard a familiar name.<br/><br/>Very quickly, he remembered that innocent young man whose family was destroyed because of the treasure map of the Shadow thief.<br/><br/>Number nine on the Heavenly Pride List?<br/><br/>Gu Yang looked at the Heavenly Pride List. The list was new and indeed, at the ninth place, it was written: Jiao Shumo, 18 years old, First Rank cultivation level, from Yuzhou.<br/><br/>He was from Yuzhou, and his age matches. This Jiao Shumo could very possibly be the young man he encountered half a year ago.<br/><br/>But, how could he be First Rank?<br/><br/>Gu Yang remembered very clearly that his cultivation level was rather insignificant at the time.<br/><br/>Surprisingly, in just half a year, he had made it to First Rank.<br/><br/>Who would have thought?<br/><br/>Could it be, that this boy is actually the protagonist of this world?<br/><br/>As Gu Yang was thinking, something familiar caught the corner of his eye. He looked closely, and the more he saw, the more familiar it seemed. Wasn’t that Jiao Shumo?<br/><br/>What a coincidence.<br/><br/>Should he say hello?<br/><br/>He glanced again at the man beside Jiao Shumo. On this glance, his eyes narrowed in surprise.<br/><br/>Golden Body Realm?<br/><br/>From the man’s aura, Gu Yang felt an oppressive force, equal to that of Nurse Qi, who possessed a threefold Golden Body.<br/><br/>At that moment, the man also turned to look at him, his aura locking onto Gu Yang in an instant.<br/><br/>“Gu Yang!”<br/><br/>Lin Ruo Xi recognized the young man on the carriage as soon as he saw him.<br/><br/>The Lin family has its own intelligence group, and a sketch of Gu Yang was sent to him much earlier.<br/><br/>“Golden Body Second Stage?”<br/><br/>Lin Ruo Xi was able to instantly determine Gu Yang’s true realm, a look of shock crossing his face.<br/><br/>Hadn’t he just broken through to the Golden Body Realm a few days ago?<br/><br/>How was he already at the second stage?<br/><br/>Even with Lin Ruo Xi’s calm manner, a moment of astonishment flickered across his eyes.<br/><br/>After he broke through to the Golden Body Realm himself, it took him five years to break through to the second stage. He was quite proud of this achievement, considering that it ranks him among the top five in the Chen family’s generations.<br/><br/>Yet someone was able to breakthrough to the second stage in just a few days.<br/><br/>How was this possible?<br/><br/>“Gu Yang?”<br/><br/>Hearing this widely recognized name, Jiao Shumo who was by the side immediately turned to look. On seeing who it was, he was utterly surprised.<br/><br/>This… is Gu Yang?<br/><br/>The man before him seemed incredibly familiar.<br/><br/>Although, the man had most of his face covered at that time, he recognized him at first sight.<br/><br/>This was the mysterious man who helped him take revenge on the murderers that slaughtered his family.<br/><br/>Jiao Shumo never thought that the man who saved his life and helped him seek revenge was the famously renowned Gu Yang.<br/><br/>“Gu Yang?”<br/><br/>At this moment, the luxurious carriage also arrived. Upon hearing the name, the Thirteenth Princess in the carriage was jolted awake, she immediately pulled back the window curtain and looked out.<br/><br/>Indeed, she saw Gu Yang sitting in a carriage.<br/><br/>“Golden Body Second Stage?”<br/><br/>Following that, the voice rang out again, imbued with a sense of disbelief.<br/><br/>What?<br/><br/>The Thirteenth Princess narrowed her eyes, turning to the elderly man beside her in surprise, stammering, “Is… this… true?”<br/><br/>The elderly man was also taken aback. Although he was unable to discern Gu Yang’s true cultivation level, since Lin Ruo Xi was the one to say it, there would be no falsehood.<br/><br/>Presumably, Gu Yang truly was in the second stage of the Golden Body Realm.<br/><br/>But, this was simply unthinkable.\t\t\t\t\t\t</div>", "images": {}, "success": true}