{"id": 200, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132001.html", "title": "Chapter 200 - Chapter 200: 200 Tianji Pavilion", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 200 - Chapter 200: 200 Tianji Pavilion</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 200: 200 Tianji Pavilion<br/><br/>Translator: 549690339<br/><br/>“Has it really been a thousand years?”<br/><br/>In an ordinary carriage, Xi Huang cautiously lifted a corner of the curtain, peering out. She was still finding it hard to accept this fact.<br/><br/>For her, it seemed as if she had just taken a nap.<br/><br/>But when she woke up, she discovered that a thousand years had passed in the outside world.<br/><br/>This was too unbelievable. She needed time to process this fact.<br/><br/>Suddenly, her gaze met with a passerby. She immediately let go of the curtain and leaned closer to Gu Yang, as if seeking some sense of security.<br/><br/>She seemed to have forgotten that she had a cultivation level of the Mana Realm, and she could wipe out a large group of the ordinary people outside with a mere breath.<br/><br/>Gu Yang felt a bit sorry for her. She was somewhat fearful of strangers or to be precise, she didn’t dare to go to places with many people.<br/><br/>He had originally wanted to take her out for a stroll, but before they could even step outside, seeing the students of the Tianxin Martial Academy practicing martial arts made her feel terrified.<br/><br/>Perhaps her prolonged confinement had given her a psychological fear of human beings.<br/><br/>So, he found a carriage and after the outside view was blocked, she was a bit more courageous.<br/><br/>“Yes, a thousand years have passed since the fall of the Xia Dynasty and then the Qin Dynasty took control, now it’s the Zhou Dynasty.”<br/><br/>Gu Yang explained the current world situation to her. “Times have changed. Nowadays, warriors practice Martial Arts. They no longer need the Essence Blood of the Monster Race. The Monster Race will not face the same imminent threat as they did in the Xia Dynasty. I even met a fellow with dragon blood who has achieved the title of king in Zhou Dynasty.”<br/><br/>“Really? No one will come to capture me anymore?” Xi Huang’s eyes lit up.<br/><br/>Gu Yang was about to say yes when the thought of her identity being exposed and the patriarch of the Shen Family coming personally to capture her caused him to swallow his words. He revised his statement, “The precondition is, not to reveal your identity. Unless absolutely necessary, avoid conflicts.”<br/><br/>“Okay.” Xi Huang nodded vigorously.<br/><br/>“Were you captured by King Qi?”<br/><br/>Upon hearing King Qi’s name, a look of fear and anger flashed across Xi Huang’s eyes. She clenched Gu Yang’s garment corner tightly and began to narrate her background.<br/><br/>Her mother was a human from a noble family who had an illicit relationship and gave birth to Xi Huang. This brought shame to the family and as a result, mother and daughter were ostracized.<br/><br/>As her bloodline continued to awaken, her origin also could no longer be concealed. In the end, her identity was uncovered, and her mother was killed for protecting her. She was then sent to King Qi’s mansion.<br/><br/>Since then, she had been locked up.<br/><br/>King Qi did not treat her poorly. On the contrary, he fed her all kinds of Spirit Fruits and Elixirs to accelerate the awakening of her bloodline. Because of this, she was able to quickly reach the Mana Realm.<br/><br/>She clearly understood her fate. The moment she reached the Unleaking Realm, King Qi would continuously harvest her Essence Blood.<br/><br/>“…My mother died because of that scoundrel. How could I allow him to have his way?”<br/><br/>As she spoke, Xi Huang’s voice became resentful and it was clear that she harbored extreme hatred for King Qi. “I found an opportunity to end myself. When I woke up, I saw you.”<br/><br/>Listening to her story, Gu Yang could basically understand what had happened.<br/><br/>That King Qi clearly didn’t want her to just die like that. He used some method to put her into a false death state and then froze her.<br/><br/>A thousand years later, when he opened the crystal coffin and recharged the object that caused her false death, she resurrected.<br/><br/>Well, in the simulation, he didn’t have a system and couldn’t wake her up.<br/><br/>That’s the cause and effect of the whole affair.<br/><br/>Gu Yang noticed that there were fewer and fewer pedestrians on the road and asked the coachman, “Where are we now?”<br/><br/>“Young Master, the Martial Academy is just ahead. Do you want to turn back?”<br/><br/>The Martial Academy?<br/><br/>He became intrigued, “I heard that the First Rank List, the Beauty List, etc., are located just opposite the main gate of the Martial Academy?”<br/><br/>“That’s correct.”<br/><br/>“Let’s go, let’s take a look.”<br/><br/>Gu Yang had always been interested in these lists. Now that the Martial Academy was nearby, obviously, he could not miss the opportunity to see them.<br/><br/>He asked Xi Huang, “In the Xia Dynasty, were there any First Rank List, Beauty List, etc.?”<br/><br/>“I’ve never heard of them.” Xi Huang said. “There were only the Divine Weapon Spectrum and Beauty Spectrum.”<br/><br/>“The Divine Weapon Spectrum?”<br/><br/>“The Divine Weapon Spectrum lists the most powerful Divine Weapons in the world. There are a total of forty-nine of them. The first one is the Human Emperor Sword. As for the Beauty Spectrum, it lists the most outstanding beauties.”<br/><br/>This Master List and the Beauty List are eerily similar to the modern ones, just with different names.<br/><br/>Gu Yang asked, “Who published these Divine Weapon List and Beauty List?”<br/><br/>“Tianji Pavilion. It is said that the master of Tianji Pavilion holds the divine book and knows countless secrets. He’s also the Xia Emperor’s most trusted subject.”<br/><br/>Gu Yang had a strong suspicion that today’s Red Mansion was the Tianji Pavilion of the Xia Dynasty.<br/><br/>As they were talking, the carriage stopped, and the coachman said, “We’re here.”<br/><br/>Gu Yang lifted the curtain and saw an ordinary wooden noticeboard, quite old, with some of its paint peeling off.<br/><br/>There were several lists posted on it, printed on ordinary red paper. A few of them were so old that the color had almost completely faded away.<br/><br/>The first list Gu Yang looked at was the oldest and was at the front, the Master List.<br/><br/>The Master List only included those with Mana. Ranked first was Chen Yuanqing of the Chen Family.<br/><br/>This man was the top in the Mana realm; it wouldn’t be an overstatement to call him the strongest among those below the Unleaking Realm.<br/><br/>The list had a total of twenty people, almost all of them from the Nine Great Surnames and Six Major Sects.<br/><br/>Only one person was not from these fifteen major forces, and he was an old acquaintance, the Sword Saint of the East Sea, who ranked last.<br/><br/>Of course, the Master List only ranked personal cultivation levels, not counting the enhancements from divine weapons.<br/><br/>It meant that if it came to a real fight, the Sword Saint of the East Sea wouldn’t necessarily lose to the nineteen people ranked ahead of him.<br/><br/>Next to it was the First Rank List. The list was brand new, clearly just replaced.<br/><br/>After he broke through to the Divine Power Realm, his name had been removed from the First Rank List and the Hidden Dragon List.<br/><br/>The current number one on the First Rank List was someone he hadn’t considered before – Pei Qianlan.<br/><br/>She actually became the number one on the First Rank List?<br/><br/>The pace of her progress was simply too fast.<br/><br/>She had broken through to the First Rank only two months ago.<br/><br/>Gu Yang was surprised, and suddenly, he heard chatter from the crowd gathered around the list.<br/><br/>“I wonder how exactly handsome Gu Yang is, to make the Jinghai Princess, Princess Chang, and Miss Su Er all fall for him. Such ladies man, truly enviable!”<br/><br/>“I also heard that the icy beauty Su Qingzhen, and the solitary Xu Ruomei, and the shy Chu Xiyue from the Beauty List all have close ties with him.”<br/><br/>“He truly deserves the title of ‘prettiest man in the world,’ able to win the hearts of so many beauties.”<br/><br/>What the hell?<br/><br/>The prettiest man in the world?<br/><br/>Gu Yang was stunned, “Are…are they talking about me?”<br/><br/>Just a few days without stepping out, and he suddenly had this title?<br/><br/>This was too ridiculous!<br/><br/>The people in front of the list were discussing amongst themselves, completely unaware that the person in question was right behind them.<br/><br/>Actually, this list had been changed a few days ago, but the shock it caused was unprecedented.<br/><br/>Gu Yang had been on the First Rank List for just over two months, then stepped into the Divine Power Realm and attained a Golden Body. His feats caused a sensation like never before.<br/><br/>He broke countless records: the youngest Divine Power Realm practitioner in a thousand years, shortest time from the First Rank to the Divine Power Realm.<br/><br/>Pei Qianlan topping the First Rank List also drew much attention.<br/><br/>Not long ago, there were rumors that the Jinghai Princess had passed away due to illness, and then she appeared at the top of the First Rank List.<br/><br/>Soon after, rumors about Gu Yang and the Jinghai Princess started circulating.<br/><br/>Such gossip always traveled the fastest.<br/><br/>Plus, the incident from two days ago, when Princess Chang tore up the royal marriage decree from the Queen for Gu Yang.<br/><br/>Now, he had become the idol of countless men, and the title ‘prettiest man in the world,’ was gaining traction.<br/><br/>PS: The first update seeks your votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}