{"id": 206, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132012.html", "title": "Chapter 206 - Chapter 206: 206, You’Re Useless.", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 206 - Chapter 206: 206, You’Re Useless.</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 206: 206, you’re useless.<br/><br/>Translator: 549690339<br/><br/>[… You were entrusted by the Academy Dean along with Ye Lingbo to journey to a cave world in search of a person. After a month of trials and tribulations, you found that person and returned to the Academy together.]<br/><br/>[Two months later, that person, alone with a sword, went to the Black Soul Valley, wiping out the Nether Sect.]<br/><br/>[After returning to the Divine City, he stormed into the palace, beginning a great battle with the Emperor, but ultimately lost and fled from the palace. Just as the Emperor was preparing to pursue, a show of sword intent came from the Academy, killing the Emperor.]<br/><br/>[At the same time, two powerhouses of the Unleaking realm showed up, opening up a spatial passage, and an ominous intent descended upon the Academy, sparking an epic battle.]<br/><br/>[At the critical moment, Luo Wang arrived but was still no match. In the end, the Academy Dean fell, Luo Wang was heavily injured, and the entire Divine City was corrupted by the demonic aura from another dimension, causing countless deaths and injuries.]<br/><br/>[You took advantage of the chaos and with Ye Lingbo and Xi Huang and others, opened the Secret Realm entrance of the Sacrificial Heavenly Altar, releasing one of the Unleaking realm powerhouses and hid within it.]<br/><br/>[Eight years later, Ye Lingbo reached the peak of Unleaking realm and decided to leave the Secret Realm in search of an opportunity to break through to the Celestial Being realm.]<br/><br/>[Another five years later, the Secret Realm entrance was forcibly opened, and a fearful intent attacked, you died at the age of thirty-five.]<br/><br/>After completing this simulation, Gu Yang frowned deeply.<br/><br/>As he had predicted, the reason the human realm had turned into a purgatory was because of that individual from ChiMing Heaven.<br/><br/>However, that individual was too powerful, going against two at the same time and still emerging victorious. Despite two Celestial Beings, one was killed and the other injured.<br/><br/>It seemed that just the Academy Dean and Luo Wang were not enough. They needed to align with more powerhouses to stop him.<br/><br/>[The simulation has ended, you can choose between one of the following.]<br/><br/>[First, martial arts level at the age of thirty-five.]<br/><br/>[Second, martial arts experience at the age of thirty-five.]<br/><br/>[Third, wisdom of life at the age of thirty-five.]<br/><br/>“I choose the first.”<br/><br/>“The source of all this lies with the Emperor.”<br/><br/>Gu Yang pondered the whole incident carefully, identifying the crucial point.<br/><br/>That person from ChiMing Heaven, having been in this world for a thousand years, why did he never make a move on the Divine City?<br/><br/>He must have had some concerns.<br/><br/>The first was probably the Academy Dean.<br/><br/>The second was most likely the formation of the royal palace.<br/><br/>During the battle with the Xia Emperor in the past, he might have suffered due to this formation.<br/><br/>The Emperor learned the Heavenly Art and was controlled by him, suddenly removing a major threat.<br/><br/>When the Academy Dean decided to take action and kill the Emperor, he had no more scruples and brazenly fought. He successfully defeated two powerful enemies in one swoop.<br/><br/>This cunning character had been plotting for this day for a long time without anyone knowing.<br/><br/>Another important point was, who were those two Unleaking realm powerhouses who opened the spatial passage?<br/><br/>In the world, there were just over a dozen Unleaking realm powerhouses, it was impossible for two more to suddenly appear out of nowhere. He wondered which two had become his henchmen.<br/><br/>Gu Yang thought about it and concluded that the key to stopping the impending apocalypse was to remove the Emperor in the shortest possible time so they could not destroy the formation within the palace.<br/><br/>“I’ll have to do it myself since the Queen is ineffective.”<br/><br/>Suddenly, he felt something was wrong. As a transmigrator, he was bothered about the end of the world.<br/><br/>Shouldn’t that be the job of the child of this plane?<br/><br/>Gu Yang thought of Jiao Shumo who he had met outside the Martial Academy and concluded that he wasn’t the child of the plane either.<br/><br/>“Whatever, it’s all for our survival.”<br/><br/>Shaking his head, he went out again.<br/><br/>The next day, Gu Yang took Xi Huang and left the Divine City, returning to the mountain where they had previously cultivated.<br/><br/>“What’s so urgent that you’ve been looking for me, kid?”<br/><br/>As soon as he landed, he heard Wu Er’s familiar voice.<br/><br/>Wu Er was behind a large rock, roasting a goat. The dripping fat on the hot charcoal emitted a delicious fragrance.<br/><br/>“Huh?”<br/><br/>Suddenly, his gaze shifted from the roasting goat to Xi Huang, he was surprised and said, “A divine beast with Phoenix blood, not bad, kid, where did you abduct her from?”<br/><br/>Gu Yang turned to Xi Huang and said, “You stand guard over there, don’t let anyone get close.”<br/><br/>“Yes, father,” Xi Huang obediently walked away.<br/><br/>“Father?”<br/><br/>Wu Er’s gaze got extremely strange.<br/><br/>Gu Yang shook his head, without explaining, said, “I’m looking for you, senior, for a very important matter.”<br/><br/>When he parted ways with Wu Er, they had agreed on the way to contact. Go to a certain shop, order a specific number of certain products, leave an address. Wu Er will come to see him.<br/><br/>Although the Wu Family was exterminated, there were still some old people around who could pass the message without any problem.<br/><br/>When Wu Er saw his seriousness, he asked, “What’s the matter?”<br/><br/>“I want to know about that one from the Red Venerate…”<br/><br/>Wu Er’s face changed drastically, making a silence gesture, looking up at the sky, looking tense.<br/><br/>Moments later, he let out a sigh of relief and warned, “Never mention those three words.”<br/><br/>“Once you reach the Unleaking Realm, you possess the ability to see from the sky and hear from the ground. And once you reach the Celestial Being realm, the range is vast enough to cover an entire city. People like that one, whose realm is above the Celestial Being, anyone who mentions his name will have a heart felt sense of sensation. His location will then be locked.”<br/><br/>Isn’t that just like the Western Gods in novels, where one can’t mention their name directly?<br/><br/>Gu Yang nodded, indicating he understood, “Senior, do you know a lot about it?”<br/><br/>Wu Er stared at the bonfire below and said, “Since you have perfected the ‘God Destroyer Nine Styles’, you should have guessed. That’s right, my Wu Family has a deep lineage with it.”<br/><br/>He recounted the events of his Wu Family’s ancestors a thousand years ago, “Our ancestors from the Wu Family were originally guards in the Leaning King’s mansion during the Xia Dynasty. They were discovered by the King because they fell in love with the Princess.”<br/><br/>“The Leaning King cut off the limbs of our ancestor and threw him to the chaotic burial mound outside the Divine City. Just when he was on the verge of dying, it appeared. Our ancestor sold his soul for the chance to be reborn. Then he became the most loyal dog to it.”<br/><br/>“Later, the Xia Emperor died, the Xia Dynasty collapsed and the ancestor attained his heart’s desire.”<br/><br/>“It can be said that without it, there would be no Wu Family.”<br/><br/>Gu Yang touched his chin and asked, “So you mean, the Wu Family has the bloodline of the Xia Emperor?”<br/><br/>Wu Er didn’t expect that to be his point of interest, but he nodded and confirmed, “That’s right.”<br/><br/>He asked, “Do you know about the Nine-Zhou Seal?”<br/><br/>“The Nine-Zhou Seal of the Leaning King was originally in the Wu Family secret vault, but it should have been taken away by the Zhao Family.”<br/><br/>Gu Yang felt a burst of disbelief in his heart!<br/><br/>The Nine-Zhou Seal that the Empress gave him last time was not the Leaning King’s.<br/><br/>That means, she has more than one Nine-Zhou Seal in her hand. There’s at least one more, the Leaning King’s Seal.<br/><br/>As expected, one cannot trust the mouth of a woman.<br/><br/>Wu Er asked, “Why do you ask?”<br/><br/>Gu Yang set aside the matter for the moment and said seriously, “I suspect that the Emperor has also been corrupted by it.”<br/><br/>“What?”<br/><br/>Wu Er’s face changed drastically, he clearly understood the seriousness of this matter.<br/><br/>Gu Yan asked, “Senior, are you able to take action now?”<br/><br/>Wu Er shook his head seriously, “I am now just a living dead, with just a breath left.”<br/><br/>Gu Yang wasn’t too disappointed, as he had guessed this already. Otherwise, if Wu Er still had his strength, he would not have stood idly by when Ling Ling was killed in the previous simulation.<br/><br/>He had asked this just to confirm.<br/><br/>“Apart from the Wu Family, which other forces does it command?”<br/><br/>“Red Venerate Sect, Gao Family, and Cao Family.”<br/><br/>Gu Yang was shocked.<br/><br/>One of the six factions, two of the nine major families. It encompassed three of the strongest forces in the world. This was too formidable. Plus, with an emperor, it would be difficult for any family to compete.<br/><br/>On his side, counting everyone including the literary institute, Luo Wang, and an Unleaking realm power, that was it.<br/><br/>The Gao Family and the Cao Family, this was really beyond his expectations. He had some relationship with both families.<br/><br/>Gao Fan must come from the Gao Family, as well as Cao Yiyi’s father, the Gun God.<br/><br/>He asked, “What about Gao Fan?”<br/><br/>Wu Er said, “He was unwilling to be controlled by it, sealing his cultivation level, and avoiding worldly matters all these years. He only knows how to avoid constantly, truly a mouse.”<br/><br/>When Gu Yang thought about how Gao Fan had created the “Heavenly Inquiry Nine Knives”, it was probably to oppose that being from the Red Venerate. He indeed had the qualification to say such words.<br/><br/>“By the way, I’ve mastered the first three techniques of the ‘Heavenly Inquiry Nine Knives’, when would you teach me the fourth technique?”<br/><br/>PS: Asking for monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}