{"id": 207, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132014.html", "title": "Chapter 207 - Chapter 207: 207 Secret", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 207 - Chapter 207: 207 Secret</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 207: 207 Secret<br/><br/>Translator: 549690339<br/><br/>Zt<br/><br/>At this moment, a burning scent diffused.<br/><br/>“My roasted lamb!”<br/><br/>Wu Er cried miserably, quickly turned the roast, only to see a piece had already been charred. He took a knife and cut off the burnt part.<br/><br/>At the same time, he said, “There’s no fourth move.”<br/><br/>Gu Yang suddenly had a bad premonition, “What do you mean?”<br/><br/>“I mean, there are only three moves. I’ve already taught you all of them.”<br/><br/>“You promised me ‘Heavenly Inquiry Nine Knives’, and now you’re telling me there are only three knives. Are you messing with me?”<br/><br/>Wu Er laughed awkwardly and said, “When I first created this saber technique, indeed I intended to complete nine moves. But, something happened when I reached the third move. However, these three moves are enough for you to reach the Unleaking realm.”<br/><br/>“As for the Celestial Being realm, it’s up to you. The remaining six moves, you’ll have to create them yourself.”<br/><br/>Gu Yang chuckled. Wu Er still seemed to be enticing him with dreams.<br/><br/>As it turned out, his boast that no one could withstand his three moves was based on the fact that he only knew three moves in the first place.<br/><br/>Wu Er quickly changed the subject, “To deal with it, you can only seek help from the Chen, Chu, and Lin families. Neither the Blue Sky Palace behind the Chu Family nor the Star Sea behind the Chen and Lin Families will let the world be destroyed.”<br/><br/>The Blue Sky Palace and the Star Sea, like Red Clear Heaven, are among the Four Great Sacred Lands.<br/><br/>From Wu Er’s mouth, Gu Yang finally learned about the relationship between the nine prominent families of the world and the Four Great Sacred Lands.<br/><br/>The Chu family is backed by the Blue Sky Palace.<br/><br/>The Chen and Lin families are supported by the Star Sea.<br/><br/>The Gao and Cao families, along with the already eradicated Wu Family, have Red Clear Heaven behind them.<br/><br/>The remaining four families, the Shen, Guo, Luo, and Qin, are most likely related to the Three Holy Gates.<br/><br/>Gu Yang asked again, “What about the Three Holy Gates?”<br/><br/>“Do you know why it’s called the Three Holy Gates?”<br/><br/>“Because the gates harbor three old monsters?”<br/><br/>“The Celestial Being realm of the Monster Race is commonly referred to as the Demon Saint. The three saints in the gate belong to the Monster Race, they do not care about the affairs of the human world.”<br/><br/>So, there are three Celestial Beings in just one sacred land.<br/><br/>Gu Yang felt a shiver down his spine. In the simulation, when Ye Lingbo entered the Three Holy Gates to save him, there were already two Celestial Beings present, which were quite formidable.<br/><br/>Unexpectedly, there was a third one.<br/><br/>However, his feud with the Three Holy Gates is not something to be worried about right now.<br/><br/>He suggested, “Why don’t you make a trip to contact these three families?”<br/><br/>“I can’t.”<br/><br/>Wu Er shook his head like a wobble doll, “I’m on bad terms with them. If I were to actually go there, before I could even open my mouth to speak, they would cut me down.”<br/><br/>Gu Yang could roughly guess what he meant by ‘bad terms’.<br/><br/>When he wanted to test his saber technique in the past, who could he turn to?<br/><br/>There were only so many people at the Unleaking realm.<br/><br/>No wonder none of the families defended the Wu Family when they were under attack. It seemed that Wu Er had offended too many people, and everyone was waiting for the Wu Family to face their downfall.<br/><br/>Gu Yang pondered for a moment. The Chu Family had once sent assassins to kill him,so their impression of him was pretty bad.<br/><br/>Although he had a good relationship with Chu Xiyue, she was about to be married off, and her level of cultivation was too low to be of any help.<br/><br/>As for the Lin Family, he had just defeated Lin Ruo Xi, and stepped all over their family honour. It would be strange if they paid any heed to him now.<br/><br/>All that’s left was the Chen family.<br/><br/>But the problem was, he didn’t know anyone from the Chen family at all.<br/><br/>It seemed that the College would have to step in.<br/><br/>Gu Yang had a plan forming in his mind.<br/><br/>He asked the last question, ” Elder, can you get us some divine weapons?”<br/><br/>“Divine Weapons?”<br/><br/>Wu Er spoke irritably,”There are plenty in the Tomb of Swords, dare you go?”<br/><br/>Gu Yang thought of a simulation where a horrifying existence was lurking at the bottom of the Tomb of Swords. Out of curiosity, he asked,”Who is occupying the Tomb of Swords now?”<br/><br/>Wu Er angrily retorted, “One of the Demon Saints from the Three Holy Gates. That despicable woman coveted my Wu Family’s Tomb of Swords and joined forces with Red Clear Heaven. If not for that, would my Wu Family have suffered such a miserable defeat?”<br/><br/>This was a completely unexpected answer.<br/><br/>Gu Yang had always thought that the Tomb of Swords was either in the hands of the Zhao Family, or that person from Red Clear Heaven.<br/><br/>As it turned out, it was controlled by the seemingly unrelated Three Holy Gates.<br/><br/>He was confused and asked, “Isn’t it said that all of this is related to the heir of the Blue Sky Palace?”<br/><br/>“Do you think that the one responsible for the Six Divisions of God Annihilation is the heir of the Blue Sky Palace?”<br/><br/>Wu Er smirked, “At the end of the Qin Dynasty, there indeed appeared an heir of the Blue Sky Palace, who claimed to be pursuing a defector. Later, he was killed by Zhao Tiansheng, and the God’s Annihilation Six Divisions fell into the hands of the Zhao family.”<br/><br/>Gu Yang knew that Zhao Tiansheng was the name of the founder of Great Zhou.<br/><br/>No wonder the Empress possesses the techniques of God’s Annihilation Six Divisions, so this is how she obtained them.<br/><br/>“Then, why didn’t the Blue Sky Palace seek revenge against the Zhao Family?”<br/><br/>“The Blue Sky Palace is different from the other three families; they rarely intervene in mortal affairs. The same goes for the Chu family’s way of doing things.”<br/><br/>Gu Yang and Wu Er chatted for a while, and from him, he learned many secrets about the Four Great Sacred Lands and the Nine Families of the world.<br/><br/>Such matters could only be known by someone at Wu Er’s level of significance.<br/><br/>These pieces of information were very important to Gu Yang and could save him many failed simulation attempts.<br/><br/>When Gu Yang and Xi Huang returned to the Divine City, they didn’t go back to the Tianxin Martial Arts Hall, but went to the academy instead.<br/><br/>This time, he had timed his visit precisely to coincide with the end of lessons, and without any obstruction, he went directly to see the Vice Principal Zhou Zongye.<br/><br/>Gu Yang’s arrival at the academy caused a stir, countless students came out, vying to catch a glimpse of the world’s most beautiful man.<br/><br/>“Such grace, such demeanor, is truly rare and unparalleled in the world.”<br/><br/>“Yes, he doesn’t have the arrogance of some so-called young masters from prestigious families. He’s much nicer to look at.”<br/><br/>“What a charming and elegant gentleman, no wonder he could win the hearts of Princess Chang and Miss Su Er.”<br/><br/>Gu Yang listened attentively, looked at the academy students around him, and nodded secretly. As expected from the leader of the Six Major Sects, they have a discerning eye.<br/><br/>Vice Principal Zhou Zongye received the news and came out to greet him.<br/><br/>“Principal Zhou, I have come to invite you for tea.”<br/><br/>“Please come in.”<br/><br/>Once they arrived at the small courtyard where Zhou Zongye lived, it instantly became quiet.<br/><br/>In the yard, there was a brand-new tea table with the equally new tea tray and tea set. After he sat down, he meticulously began to prepare the tea.<br/><br/>After the tea was prepared, Zhou Zongye made a inviting gesture, “Give it a try.”<br/><br/>Gu Yang lifted the teacup and took a sip, then praised, “Excellent tea.”<br/><br/>Zhou Zongye saw that he didn’t say anything else, and felt somewhat disappointed.<br/><br/>Last time, after Gu Yang mentioned that he would come for tea, Zhou made special preparations.<br/><br/>He was not much of a tea drinker, so he had specially procured tea utensils and tea leaves.<br/><br/>The tea was taken from a professor who was obsessed with tea, and he also read several books about tea. He had anticipated talking about tea classics when Gu Yang visited.<br/><br/>But after tasting, Gu Yang just commented, “Good tea”, leaving Zhou unsure of how to continue the conversation.<br/><br/>Gu Yang said, “Actually, this time, there is a matter I wish to discuss with Principal Zhou.”<br/><br/>“What is it?”<br/><br/>“I intend to kill the Emperor and hope your academy can assist me.”<br/><br/>“What?”<br/><br/>Zhou Zongye was taken aback, he looked up and saw Gu Yang wasn’t joking, and his expression became serious, “Why?”<br/><br/>Gu Yang told him about the Emperor practicing the Extreme Heavenly Divine Technique.<br/><br/>“Extreme Heavenly Divine Technique?”<br/><br/>Zhou Zongye suddenly stood up, realizing the gravity of the situation, he paced around the courtyard a few times, took a deep breath and said, “You wait for me here, I’ll be right back.”<br/><br/>With that, he rushed out of the courtyard.<br/><br/>Gu Yang knew that he must have gone to report to the academy’s principal.<br/><br/>To kill the Emperor was not a decision he, as the vice-principal, could make.<br/><br/>That’s the Emperor of Great Zhou, hidden in the palace, even if they mobilized the full power of the academy, they might not be able to kill him.<br/><br/>If the grand formation in the palace could still be activated, even Celestial Beings could be suppressed.<br/><br/>Gu Yang poured a cup of tea for Xi Huang and waited patiently.<br/><br/>After half an hour, Zhou Zongye returned, saying, “The principal wants to see you.”<br/><br/>Gu Yang perked up, finally he was going to meet the legendary figure who stood at the pinnacle of this world. He straightened his clothes, turned to Xi Huang and said, “Wait for me here, I’ll be right back.”<br/><br/>“Alright, father.” Xi Huang nodded solemnly.<br/><br/>“Let’s go.”<br/><br/>Gu Yang followed Zhou Zongye to the Star Picking Pavilion.\t\t\t\t\t\t</div>", "images": {}, "success": true}