{"id": 202, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132005.html", "title": "Chapter 202 - Chapter 202: 202 You Lost", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 202 - Chapter 202: 202 You Lost</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 202: 202 You lost<br/><br/>Translator: 549690339<br/><br/>“Lin Ruo Xi?”<br/><br/>Gu Yang also guessed the identity of the man, saying, “I didn’t expect you to come all this way. Since that’s the case, draw your sword.”<br/><br/>As he said this, he patted Xi Huang’s hand next to him, signaled her to keep hidden, and flew out.<br/><br/>He stirred up quite the commotion with his words.<br/><br/>The people present were all responsible for gathering information. They were naturally familiar with the name Lin Ruo Xi—a main descendant of the Lin Family and one with the Third Level of the Golden Body Realm.<br/><br/>Gu Yang was openly challenging him.<br/><br/>Inside the carriage, the three princesses and the old man’s first reaction was, “Has he gone mad?”<br/><br/>What arrogance!<br/><br/>Although Gu Yang had defeated Lin Yimo of the Golden Body Realm while he was at First Rank.<br/><br/>However, Lin Yimo was just a branch member of the Lin Family, incomparable to a direct descendant like Lin Ruo Xi.<br/><br/>The Lin Family’s Heavenly Gang True Law, a top-notch skill recognized worldwide, once produced a Celestial Being.<br/><br/>Lin Ruo Xi’s strength was not comparable to the average mana realm powerhouse.<br/><br/>Even with Gu Yang’s exceptional talent and superb Saber Technique, there was a gap in their cultivation realms; how could he possibly be a match for Lin Ruo Xi?<br/><br/>That was also the thought of other people present.<br/><br/>“Hahaha …”<br/><br/>Lin Ruo Xi felt underestimated but was not angry. Instead, he laughed and said, “You’re more interesting than I thought. Such confidence is impressive, indeed.”<br/><br/>Scratching his head, he said with some annoyance, “If I accept this fight, I fear others would say that I’m a bully. If I don’t, you might think I’m scared of you.”<br/><br/>“Right.”<br/><br/>Suddenly, he clapped his hands, saying, “You gave my cousin in Jiangzhou quite a miserable time. It’s only reasonable that I, as his nephew, avenge him.”<br/><br/>Having found a reasonable excuse to fight, Lin Ruo Xi drew his sword from its sheath, and a surge of Sword Intent shot up into the sky.<br/><br/>In an instant, the sky darkened, the sun lost its light, and a starry sky appeared.<br/><br/>The Zhou Tian Xingchen Sword Method!<br/><br/>Under the star-studded sky, he appeared as a star god, his grand voice resonating far, “You didn’t kill that day; today, I won’t kill you either. After this sword, I hope you will learn not to be so arrogantly ignorant. Remember, there are always higher skies to soar to and better people to meet!”<br/><br/>“Wait!”<br/><br/>Seeing him about to attack, Gu Yang interrupted.<br/><br/>Lin Ruo Xi smirked, saying, “What? Want to beg for mercy?”<br/><br/>“What’s the name of your sword?”<br/><br/>“Heavenly Pivot Sword, why, any issues?”<br/><br/>“I just think it’s meaningless to just fight. Why not spice it up a bit?”<br/><br/>Surprise flashed across Lin Ruo Xi’s face. “Are you serious?”<br/><br/>Inside the carriage, the third princess and the old man exchanged glances, a hint of doubt creeping into their minds.<br/><br/>Could it be that Gu Yang was truly confident?<br/><br/>Although reason told them it was impossible, they couldn’t help but be affected by his confidence.<br/><br/>Everyone understood what Gu Yang’s words meant: he had taken a liking to Lin Ruo Xi’s sword.<br/><br/>Such certainty and the plainness of his words exuded unparalleled confidence and dominance, leaving people deeply moved.<br/><br/>Gu Yang said, “My Phoenix Feather Knife is a divine weapon, albeit sealed. But I’ve always used this knife. Why not use this knife and the sword in your hand as an extra stake?”<br/><br/>Lin Ruo Xi stared at him for a moment, then opened his lips to utter a single word, “Fine!”<br/><br/>Finally, Gu Yang’s words stirred a hint of anger within him. He said coldly, “Draw your weapon!”<br/><br/>The True Essence inside Gu Yang burst out, a Blade Intent shot into the sky, instantly piercing through the starry sky above. The sunlight came down once again, illuminating him and making him shine brightly.<br/><br/>Thus, an amazing scene appeared on the field.<br/><br/>One side was day, the other night, a clear distinction between the two.<br/><br/>A gravity of weight added to Lin Ruo Xi’s eyes. The formidable strength of the opponent’s Blade Intent exceeded his imagination, imposing immense pressure on him.<br/><br/>At this moment, he finally considered the young man before him a worthy adversary.<br/><br/>Regardless of one’s Realm, strength was what truly mattered.<br/><br/>Gu Yang’s display of power forced him to take the situation seriously.<br/><br/>“No wonder this kid is so arrogant. If I had his kind of strength, I’d be ten times more haughty than him.”<br/><br/>Inside the martial arts school, a few people were watching the battle. The one speaking was a short, fat middle-aged man with a drunken nose who held a bottle of wine in his hand.<br/><br/>These people were all instructors at the martial arts school. As soon as there was a commotion outside, they rushed to the scene.<br/><br/>However, they showed no intention of intervening.<br/><br/>It wasn’t that they didn’t want to, but that they lacked the power to do so.<br/><br/>In the entire martial arts school, apart from the principal, not one had reached the threefold Golden Body state. The strongest among them had only acquired a twofold Golden Body state. How could they intervene in the battle outside?<br/><br/>The only one with the strength to intervene was the principal, who had vowed not to fight with anyone unless they were a Celestial Being.<br/><br/>As the hosts of this place, they could do nothing but stand and watch.<br/><br/>Their only hope was that the two people outside wouldn’t destroy the martial arts school.<br/><br/>At this moment, they were astounded by the power displayed by Gu Yang.<br/><br/>He appeared to be at the twofold Golden Body state, but the robustness of his True Essence and the powerful Blade Intent were not inferior to Lin Ruo Xi, who was at the threefold Golden Body state.<br/><br/>Some instructors exclaimed in disbelief.<br/><br/>They couldn’t imagine how he had trained this way.<br/><br/>“It is the bloodline of the Divine Phoenix!”<br/><br/>Suddenly, a man in a blue robe appeared. He looked at Gu Yang outside the courtyard with a puzzled expression. “Strange, he’s clearly human. Why does he have the Phoenix bloodline?”<br/><br/>“Principal!”<br/><br/>The instructors hurriedly bowed in salute.<br/><br/>Only the man with the drunken nose didn’t move. He continued to drink his wine nonchalantly. “There are many strange things in this world. Some people even practice the ancient Divine Power of externalizing a Dharma Appearance. What’s so big about this?”<br/><br/>Just as the principal was about to speak, he saw seven stars in the sky burst into dazzling light. A terrifying power made his face change slightly. “Seven stars eclipsing the sun!”<br/><br/>This was a lethal move in the Lin Family’s Zhou Tian Xingchen Sword Method.<br/><br/>Since a calamity that almost annihilated the Lin Family 500 years ago, this sword technique had not reemerged in the world.<br/><br/>Even he had only read about it in some ancient records.<br/><br/>The seven stars were the Big Dipper.<br/><br/>Lin Ruo Xi drew down the light of the seven stars and gathered them in the Heavenly Pivot Sword in his hand. He turned them into a Sword Light that slashed towards Gu Yang.<br/><br/>Any words would fall pale and weak under this Sword Light.<br/><br/>Everyone in the scene was blinded. They could neither see nor sense anything.<br/><br/>Everything was stripped away under this sword, leaving them devoid of any perception.<br/><br/>Inside the carriage behind them, Xi Huang felt a chill down her spine as she sensed a great threat. She almost couldn’t hold back from making a move.<br/><br/>Just then, a flash of saber light appeared in the void.<br/><br/>Wherever the saber light passed, the dazzling light dissipated.<br/><br/>Gu Yang made his move.<br/><br/>The second move of Heavenly Inquiry Nine Knives, Saber Defines the Universe!<br/><br/>The Sword Light seemed to freeze, then shattered bit by bit. The cracks spread to the starry sky above. Whether it was the dark night or the starlight, everything shattered.<br/><br/>Spit!<br/><br/>The moment the Sword Intent was shattered, Lin Ruo Xi spit out a mouthful of blood on the spot. His face was pale to the extreme. He looked at his trembling hand in disbelief, unable to accept that he had been defeated.<br/><br/>He was defeated under the saber of a person at the twofold Golden Body state.<br/><br/>The scene fell silent. Whether it was the Third Princess in the carriage or the people who were watching the spectacle by the leaderboard, or the instructors in the martial arts school, they were all dumbfounded, unable to speak a word.<br/><br/>Only Gu Yang’s calm voice could be heard, “You lost.”\t\t\t\t\t\t</div>", "images": {}, "success": true}