{"id": 204, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132009.html", "title": "Chapter 204 - Chapter 204: Emperor 204", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 204 - Chapter 204: Emperor 204</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 204: Emperor 204<br/><br/>Translator: 549690339<br/><br/>[… Vice Principal Zhou Zongye of the literature academy intervened, stopping the mana realm of the Cao family.]<br/><br/>[Another half year later, the empress suddenly summoned you into the palace. You arrive at the palace and meet a man dressed in a dragon robe, who transformed into a shadow and pounced on you. You die, at the age of twenty-three.]<br/><br/>The content of this simulation was quite brief.<br/><br/>“The emperor?”<br/><br/>Gu Yang didn’t expect that he would be killed by the emperor, who had very little presence.<br/><br/>In so many previous simulations, the emperor had never appeared.<br/><br/>Unexpectedly, the first time he appeared, he gave him such a big surprise.<br/><br/>It seems that the emperor, who was legendary for entering a demonized cultivation state during his childhood and couldn’t practice cultivation, was also not simple.<br/><br/>Even in the palace, where his true essence was suppressed, based on his strength of his mortal body, it would be difficult to kill him without the cultivation level of the mana realm.<br/><br/>This emperor, possessing such cultivation, still managed to deceive everyone in the world.<br/><br/>“So, the previous simulation suggested that the empress’s death was his doing.”<br/><br/>Gu Yang thought back to the emperor poisoning the empress after he saved Princess Chang. The key to it should lie with Princess Chang.<br/><br/>Previously, in the timeline where Princess Chang died, the emperor didn’t cause any troubles.<br/><br/>So why, in this simulation, did the emperor suddenly attempt to kill him?<br/><br/>The only change was that he defeated Lin Ruo Xi. But how did that affect the emperor?<br/><br/>[The simulation ends, and you can retain one of the following options.]<br/><br/>[One, the martial arts realm at the age of twenty-three.]<br/><br/>[Two, the martial art experience at the age of twenty-three.]<br/><br/>[Three, the life wisdom at the age of twenty-three.]<br/><br/>Gu Yang thought for a moment and chose the third option.<br/><br/>Immediately, a memory appeared in his mind. In the Qi Feng Pavilion, on the empress’s seat, sat a middle-aged man in a dragon robe, emanating a charming aura.<br/><br/>The next moment, the middle-aged man transformed into a black shadow and lunged at him. His vision went black, and he knew nothing more.<br/><br/>The last thought in his mind was, “The palace is too dangerous; one mustn’t go casually.”<br/><br/>“Heavenly Extreme Divine Technique!”<br/><br/>After re-experiencing the scene of his death, Gu Yang was taken aback.<br/><br/>The technique used by the emperor was the same as the one used by the creature who claimed to be the Heavenly Extreme Taoist at Lian Mountain.<br/><br/>In one of the previous simulations, he was possessed by the Heavenly Extreme Taoist and learned the Heavenly Extreme Divine Technique. The martial art experience was still there, so he recognized it at once.<br/><br/>How does the emperor know the Heavenly Extreme Divine Technique?<br/><br/>Could it be that he was possessed by the Heavenly Extreme Taoist?<br/><br/>How did the Heavenly Extreme Taoist, who was far away at Lian Mountain, get all the way to Divine City?<br/><br/>With his usual deeds, wouldn’t he massacre his way to Divine City? It’s impossible that there wouldn’t be any news about it.<br/><br/>All Gu Yang had were questions.<br/><br/>This was indeed no trivial matter. He had been possessed by the Heavenly Extreme Taoist in the simulation, and he knew how terrifying the Heavenly Extreme Divine Technique was.<br/><br/>The emperor managed to reach the mana realm level in such a short time. God knows how many people’s powers he had absorbed.<br/><br/>The palace was full of powerful martial artists, even a few at the Unleaking Realm.<br/><br/>It’s possible that the emperor could advance directly into the Celestial Being realm through them. Then who in the world could stop him?<br/><br/>This was extremely dangerous.<br/><br/>Gu Yang felt uneasy as he thought about a ticking bomb in the palace. He told Xi Huang and then left.<br/><br/>The Divine City houses two academies—the literature academy to the east and the martial arts academy to the west.<br/><br/>Compared to the already declining martial arts academy, the literature academy is thriving today.<br/><br/>Two hundred years ago, the literature academy broke away from the court and became independent.<br/><br/>The root cause was the very emperor who had a persecution complex, who had the deputy dean of the academy killed at the time.<br/><br/>The deputy dean was the dean’s favored student, destined to inherit his mantle. Yet, he was ambushed and murdered by the despot. The dean, in his fury, declared the academy independent.<br/><br/>Subsequently, the emperor was forced to abdicate, passing the throne to his son. Not long after, he passed away in depression.<br/><br/>In the history of the Zhou Dynasty, he was the only emperor to have been forced off the throne.<br/><br/>The loss of the academy’s support marked the turning point from prosperity to decline for the Zhou Dynasty.<br/><br/>From then on, the Great Zhou Dynasty began to decline.<br/><br/>The academy continued being the holy land that all the poor but talented disciples yearned for. Every spring, tens of thousands of young people from all over the country would come with the hope of being admitted.<br/><br/>When Gu Yang arrived at the academy, looking at the gate, which looked exactly like the Martial Arts School, he felt it was not quite befitting the academy’s reputation.<br/><br/>The academy, recognized as the leader among the six major sects, has a very positive image. They admit a new generation of disciples every year, disregarding their origin, and do not just look at their aptitude for martial arts. Anyone who can pass the admission test can become a disciple of the academy.<br/><br/>In reality, it is a place to foster scholars, with martial arts being only a sideline.<br/><br/>It can only be said that the dean is quite extraordinary. Being a mere scholar, he has actually reached the pinnacle of martial arts in the world.<br/><br/>A once proper academy, has now become a major martial arts sect.<br/><br/>Just as Gu Yang was about to enter, he was stopped. “Classes are in session now. Please come back after the afternoon session,” a voice said.<br/><br/>The gatekeeper was an old man, seemingly unimpressive, but his cultivation level was Second Grade.<br/><br/>“My name is Gu Yang, I’m looking for Principal Zhou, could you please notify him?” He said politely.<br/><br/>“Principal Zhou is conducting a class right now and is likely too busy to see you.”<br/><br/>The old man seemed not to have heard his name and did not intend to make any exceptions.<br/><br/>Gu Yang was helpless and prepared to leave.<br/><br/>“Brother Gu?”<br/><br/>Suddenly, a familiar voice called out.<br/><br/>He turned his head to see that it was Ye Lingbo. She spoke to the old gatekeeper and came out of the gate, saying, “The academy has rules. During classes, no one is allowed to enter and cause disturbance. I cannot violate it, and I cannot take you inside, Brother Gu.”<br/><br/>Gu Yang said, “If it is a rule, it should be adhered to.”<br/><br/>“Are you here to see Principal Zhou, Brother Gu?”<br/><br/>“Yes, I have some questions to ask. It’s the same if I ask you. Have you ever heard of the Heavenly Extreme Taoist?”<br/><br/>Ye Lingbo nodded and said, “A hundred years ago, a traitor of the Dao Sect, under the bewitchment of the respectable Chi Ming Tian, betrayed his sect and was ultimately suppressed by the Sect Leader of the Dao Sect. It was precisely that disturbance that significantly weakened the Dao Sect, and gave that respectable individual the opportunity to nearly wipe out the Dao Sect.”<br/><br/>Gu Yang initially wanted to ask her for help in gathering some information. Who would have thought that she was so well-informed about the affairs of the Heavenly Extreme Taoist? She said, “This is not the place to talk. Let’s find a quiet place and take our time talking.”<br/><br/>Not far away, inside a private room of a restaurant, Gu Yang began his inquiry.<br/><br/>He asked, “What was the Heavenly Extreme Taoist’s cultivation level back then?”<br/><br/>“He was originally in the Mana realm, but he was stuck and unable to break through. Seeing that his life was drawing to an end, he secretly turned to Chi Ming Tian. Although his talent was mediocre, his comprehension was exceptional. He combined the Taiyou Moon Devouring Technique with the Dao Sect’s practice to create a deviant technique. It could devour other people’s strength and life force to enhance himself.”<br/><br/>“After he practiced this technique, he went crazy and turned against his fellow sect members. He quickly broke through to the Unleaking Realm. He thought he could challenge the Sect Leader of the Dao Sect. After losing and being seriously injured, he fled from the Dao Sect and began to wreak havoc in the world, no one knows how many martial artists he devoured.”<br/><br/>“A few years later, the Heavenly Extreme Taoist had reached the peak of the Unleaking Realm and challenged the Sect Leader of the Dao Sect again, attempting to devour him and break through to the Celestial Being realm.”<br/><br/>“In the end, the Sect Leader of the Dao Sect defeated the Heavenly Extreme Taoist. However, he found that he couldn’t kill him completely. The only option was to divide him into five parts and suppress them separately. As for where they were suppressed, only the Sect Leader of the Dao Sect would know.”<br/><br/>When Gu Yang heard this, he finally understood.<br/><br/>So, the Heavenly Extreme Taoist in Lian Mountain was only a part of the original person.<br/><br/>The one the emperor got was probably another part.<br/><br/>Gu Yang asked, “Is there any way to suppress this Heavenly Extreme Divine Technique?”<br/><br/>At his words, Ye Lingbo’s expression changed slightly. “Brother Gu, have you found someone practicing this Heavenly Extreme Divine Technique?”<br/><br/>“Right now, it’s just a suspicion.” Gu Yang did not tell her the truth. Her cultivation level was too low, and getting involved would be of no benefit to her.<br/><br/>Ye Lingbo spoke in a somewhat serious tone, “The Heavenly Extreme Divine Technique is very formidable. Although it seems deviant, it’s a true method of the Dao Sect and does not fear flames or thunders. Back in the day, several major forces dispatched people to hunt down the Heavenly Extreme Taoist, but to no avail. Instead, they suffered significant losses.”<br/><br/>“Only the Dao Sect’s supreme ultimate technique, the Extreme Yang True Gang, can slightly counter it. Perhaps, the Divine Thunder Six Destruction can suppress it a bit, too.”\t\t\t\t\t\t</div>", "images": {}, "success": true}