{"id": 203, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132007.html", "title": "Chapter 203 - Chapter 203: 203 Spirit Tools", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 203 - Chapter 203: 203 Spirit Tools</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 203: 203 Spirit Tools<br/><br/>Translator: 549690339<br/><br/>“You’ve lost!”<br/><br/>Gu Yang’s words struck Lin Ruo Xi like a heavy hammer, causing him to cough up another mouthful of blood.<br/><br/>“Such remarkable Heavenly Inquiry Nine Knives!”<br/><br/>He squeezed these words out through gritted teeth, turned around and flew into the sky, his back figure looking utterly defeated.<br/><br/>The Heavenly Pivot Sword remained on the spot and slowly flew towards Gu Yang.<br/><br/>This was the stake between them. Lin Ruo Xi had lost, and the Heavenly Pivot Sword now belonged to Gu Yang.<br/><br/>Gu Yang seized the Heavenly Pivot Sword. It trembled slightly in his grip, as if trying to escape from his hand and follow its master.<br/><br/>This kind of spirit was incomparable to the Long Autumn Sword of Princess Chang, but it was far superior to the two swords Chasing Light and Shadow Chaser gifted by the Empress.<br/><br/>At least it was worth several units of energy.<br/><br/>He suddenly realized that this was a great way to get rich.<br/><br/>More importantly, there wasn’t much risk involved.<br/><br/>Lin Ruo Xi, despite being at a higher realm, lost to him. He would be too embarrassed to complaint to his family and ask the strong members of his family to stand up for him.<br/><br/>Even if he had no shame, the Lin family couldn’t afford such a disgrace.<br/><br/>Gu Yang returned to his carriage and, under the watchful eyes of the crowd, turned it around and left gracefully.<br/><br/>In the martial academy, an instructor murmured, “The Heavenly Inquiry Nine Knives, as expected, lives up to its reputation!”<br/><br/>They could all see that Gu Yang’s attack was a perfect counter to Lin Ruo Xi’s Seven Stars Solar Eclipse, hence Lin Ruo Xi’s resounding defeat.<br/><br/>However, the man with a bulbous red nose disagreed, “No matter how powerful the saber technique, it all comes down to the individual. In my opinion, in terms of true essence and saber technique, Gu Yang surpasses Lin Ruo Xi. Isn’t his victory expected?”<br/><br/>The others were left speechless.<br/><br/>They could not disagree with this point. They just instinctively thought that Lin Ruo Xi, being at a higher realm, would have lost because of the reputation of the Heavenly Inquiry Nine Knives.<br/><br/>They had a hard time accepting that Gu Yang, at the second tier of the Golden Body realm, could outclass Lin Ruo Xi at the third tier in every aspect. It entirely went against their understanding.<br/><br/>An instructor couldn’t help but ask, “Headmaster, why is Gu Yang’s strength so abnormal? Is it just because he has the divine beast’s bloodline?”<br/><br/>The headmaster replied, “If I’m not mistaken, he possesses several secret techniques.”<br/><br/>He didn’t elaborate on which ones.<br/><br/>The instructors naturally didn’t dare to ask further, but they couldn’t help but feel curious. They really wanted to invite Gu Yang to the academy and learn from him.<br/><br/>However, knowing that Gu Yang had once saved the dean of the literature academy and had an unusual relationship with them, they didn’t think he would be interested in the martial academy.<br/><br/>“This is the target you’ve set for me? Are you hoping for my quick death?”<br/><br/>At the entrance, Jiao Shumo watched the departing carriage in a gloomy mood, speaking in a voice only he could hear.<br/><br/>In his mind, a cold voice emerged, “This man possesses an unusually substantial original source, far surpassing an ordinary Golden Body Realm. If you can swallow him, you will certainly break through to the Mana Realm.”<br/><br/>Jiao Shumo sneered, “Do you think you can defeat him?”<br/><br/>“As long as I can find the other half of my body, I can recover thirty percent of my power. Killing him would be as easy as flipping my hand.”<br/><br/>“I’ve heard enough of that. Didn’t you say that once we reached Divine City, you could sense the location of your other half? Where is it now?”<br/><br/>“I’ve sensed it. It’s over there.”<br/><br/>“Over there?”<br/><br/>Jiao Shumo looked in the direction indicated, without hesitation, whipped his horse around and galloped off.<br/><br/>In the carriage, Gu Yang was examining the Heavenly Pivot Sword in his hand.<br/><br/>The sword was full of character and resisted his true essence. He was unable to infuse his true essence into it, and naturally couldn’t obtain the sword technique inheritance contained within.<br/><br/>Seeing this, Xi Huang couldn’t help saying, “Father, this is a Spirit Tool. You must gradually erase the previous owner’s imprint before you can fully utilize it.”<br/><br/>“So, there are ranks among magical weapons.”<br/><br/>Gu Yang felt that he had learned something new. Before, no one had ever explained the different levels of Godly Weapons to him.<br/><br/>After speaking, he couldn’t help but worry that asking such a basic question could make her suspicious of his identity.<br/><br/>Soon, he found that he was overthinking. Xi Huang showed no reaction and patiently explained, “The most common are Magical Tools, like my Qingping Sword. It doesn’t require refining and anyone who obtains it can use it. Its full power can be unleashed at the Golden Body Realm.”<br/><br/>“Above Magical Tools are Spirit Tools. They contain a spirit that recognizes its master once refined and is wholly loyal. If you want it to recognize a new master, you need to erase the previous master’s imprint first. Otherwise, it won’t work.”<br/><br/>“Like this Heavenly Pivot Sword. You have to reach the Longevity Realm to fully harness its power.”<br/><br/>“Above Spirit Tools, there are Magic Treasures. As far as I know, the use of them is only possible when one reaches the Celestial Being Realm. I have never seen one myself,” she said.<br/><br/>“Furthermore, there are Divine Treasures. The Human Emperor’s Sword held by the Xia Emperor, it is considered a Divine Treasure.”<br/><br/>“If you were ever to come across the Human Emperor’s Sword, Father, be cautious. This sword embodies the destiny of the human race and inherently suppresses our monster race.”<br/><br/>“Two of our past Monster Emperors have met their end under this sword.”<br/><br/>After hearing this, Gu Yang now had a clearer understanding.<br/><br/>The Shadow Chaser given to him by the Empress previously is considered a Magical Tool.<br/><br/>The Heavenly Pivot Sword is a Spirit Tool, and the Long Autumn Sword most likely is as well, but it’s a higher-ranked Spirit Tool.<br/><br/>As for Magic Treasures, he was uncertain if the Nine State Seal could be considered as one.<br/><br/>As for the Nine Divine Cauldrons, they most likely would be considered Divine Treasures, considering that they were forged by the second Human Emperor.<br/><br/>[Energy source detected. Shall we proceed with charging?]<br/><br/>“Yes.”<br/><br/>The Heavenly Pivot Sword in his hand vanished into thin air.<br/><br/>[Charging Complete. You have gained five energy cells. Your current number is: Thirteen Cells.]<br/><br/>As expected of a Spirit Tool, five energy cells are equivalent to five Chasing Light Swords.<br/><br/>Xi Huang looked surprised at the disappearance of the Spirit Tool, but she didn’t ask any questions.<br/><br/>In her view, there was nothing her father could not do, so the fact that he possessed such an ability was not surprising.<br/><br/>The events of today were only a minor incident for Gu Yang.<br/><br/>Following this, he continued to narrate to Xi Huang about the changes that occurred in the thousand years following the downfall of the Xia dynasty. Meanwhile, he asked her questions about her time in the Xia dynasty.<br/><br/>Xi Huang was like a living fossil.<br/><br/>Regrettably, she was raised in a major family and was confined to King Qi’s residence before reaching adulthood. Her experience and knowledge were limited. Her knowledge of the Xia dynasty was acquired from the stories she heard as a child.<br/><br/>Despite this, she was still the most well-informed individual regarding the Xia dynasty.<br/><br/>After all, documents regarding the Xia dynasty were few and far between, and the records in history books were excessively brief.<br/><br/>Gu Yang was able to obtain firsthand information about the Xia dynasty from her.<br/><br/>Such as the Tianji Pavilion in the Xia dynasty.<br/><br/>At that time, there were only four Sword Saints.<br/><br/>And the Xia dynasty’s five major families and four major sects.<br/><br/>Interestingly, three of the surnames among the Xia dynasty’s five major families are present in the current Nine Surnames of the world.<br/><br/>The two sects from that era that still exist today are the Sword Palace and the Dao sect.<br/><br/>However, the difference then was that both the four Sword Saints and the five major families and four sects were all under the command of the Xia dynasty.<br/><br/>During the Xia dynasty, there were ten Celestial Beings in total. Apart from the Xia Emperor, the nine princes were all beings in the Celestial Being Realm.<br/><br/>The ten Celestial Beings, who suppressed the world, allowed no forces to disobey the Xia Emperor’s will.<br/><br/>However, even such a powerful Xia Dynasty ultimately collapsed.<br/><br/>Gu Yang felt a tinge of regret; when the Xia Dynasty fell, Xi Huang was already in deep slumber, unaware of how the Xia Dynasty had been brought down.<br/><br/>If she had, they would have a rough idea of the strength of the Four Great Sacred Lands.<br/><br/>Now, they could only guess.<br/><br/>Of course, there was another way; those ancient families and sects that have been passed down from the Xia Dynasty would have experienced that war. Maybe even took part in it.<br/><br/>The carriage roamed around outside for half a day, finally returning to the Tianxin Martial Academy as it was getting dark.<br/><br/>Gu Yang advised Xi Huang to rest in her room. Her prior act of forming a droplet of essence blood had harmed her origin. Coupled with her thousand-year slumber, she needed a good rest and recuperation.<br/><br/>He went out into the outer room and opened the system.<br/><br/>Every time he gained new energy, he would simulate once. This had almost become a habit.<br/><br/>[You are now twenty-two years old, an individual of the second layer of the Golden Body. You defeated Lin Ruo Xi, who is at the third layer of the Golden Body, outside the Academy, shocking everyone.]<br/><br/>[Two months later, a magic realm expert from the Cao family will come to visit…]<br/><br/>PS: The end of the month is fast approaching. If you have any more monthly tickets, please cast your sacred and solemn vote.\t\t\t\t\t\t</div>", "images": {}, "success": true}