{"id": 219, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132039.html", "title": "Chapter 219 - Chapter 219: 219 Kills", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 219 - Chapter 219: 219 Kills</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 219: 219 Kills<br/><br/>Translator: 549690339<br/><br/>“Would you like to use the Life Simulator? Each use will consume four energy slots.”<br/><br/>Gu Yang does not hesitate and murmurs, “Yes.”<br/><br/>Lines of text appear before his eyes. He glimpses the words ‘kill Emperor Zhao Yi’ and is instantly resolute. He dismisses the rest of the content.<br/><br/>“Simulation complete, you can keep one of the following.”<br/><br/>“I choose the first one.”<br/><br/>Immediately, the True Essence within Gu Yang surges again. The depleted Phoenix source within him also recovers greatly.<br/><br/>At this time, the constantly changing black fog starts to calm down. After a hair-raising noise of chewing, the black fog returns to the body of the Emperor.<br/><br/>His power is expanding continuously and in a blink of an eye, it has crossed that threshold to the realm of Divine Power.<br/><br/>Golden Body one-fold, two-fold, three-fold…<br/><br/>Finally, he enters the realm of Mana!<br/><br/>The dragon-robed Zhao Yi is floating in the air. All around him, the Vitality of the heaven and earth is continually converging.<br/><br/>Finally, he opens his eyes – a sensation of unprecedented strength makes him enthralled.<br/><br/>This is the power he had once dreamed of!<br/><br/>Now, it feels like the whole world is in his own hands. Wherever his eyes go, it is his Domain.<br/><br/>Zhao Yi turns his head, looking at the person who dares to offend his dignity. His lips part slightly and he speaks, “The Emperor sentences you to death!”<br/><br/>Meanwhile, Gu Yang has arrived next to the dragon throne, holding the National Jade Seal in his hand.<br/><br/>The moment his hand touches this seal, the dragon engraved on it seems to come alive, rising into the air, and transforming into a Golden Dragon, soaring the sky.<br/><br/>In a twinkle, the invisible force that was suppressing his True Essence disappeared.<br/><br/>Meanwhile, inside Gu Yang’s head, several points of light light up, connected by invisible threads that crisscross each other, forming a gigantic array.<br/><br/>This array, whose range is unknown, stretches upwards into the void.<br/><br/>On the other hand, it connects to unknown places deep underground.<br/><br/>This discovery shocks him.<br/><br/>The entire palace is merely an eye of a large array.<br/><br/>And this jade seal is the core of the array eye of the palace.<br/><br/>With his strength, he can’t push the power of this large array.<br/><br/>All he can do is constrain someone’s power within the scope of the palace.<br/><br/>Gu Yang looks at Emperor Zhao Yi. His gaze pierces through his body, seeing the Taoist shadow behind him and coldly declares, “You should not have come here.”<br/><br/>The Phoenix Feather Knife in his hand bursts into a raging flame.<br/><br/>God Extermination, Skyfire Incineration!<br/><br/>Suddenly, Zhao Yi feels the power within him being suppressed by an invisible force. It’s as if he has been knocked down the abyss just when he flew to the cloud.<br/><br/>Just a second ago, he was feeling great, wanting to crush the insignificant man before his eyes. The next moment, the invincible power he just acquired disappeared.<br/><br/>Behind him, a figure gets peeled off, continually warping and changing like a monster, desperately trying to flee the Great Hall.<br/><br/>Under the influence of the palace’s power field, its power is rapidly fading.<br/><br/>This is the power of the Heavenly Extreme Taoist who possessed the Emperor and sensing danger, he immediately leaves the Emperor behind.<br/><br/>Before he could escape from the Great Hall, Skyfire descends.<br/><br/>“No”<br/><br/>The black shadow screams, as if piercing through one’s eardrum. The next second, the figure is engulfed by the flames.<br/><br/>Hiss<br/><br/>Within this spooky scream, the shadow disintegrates under the flames of the Skyfire and is completely obliterated.<br/><br/>The power of the Heavenly Extreme Taoist is destroyed!<br/><br/>Elsewhere, after losing the power of the Heavenly Extreme Taoist, Emperor Zhao Yi grows incredibly weak and stands there trembling, like an elderly man close to his death.<br/><br/>He looks crazed, stumbling after the black shadow pleading, “My… my power, don’t run…”<br/><br/>“No”<br/><br/>Seeing the black shadow getting burnt into ashes under the Skyfire, he despairs, tripping over something and falling to the ground, bleeding heavily from his head.<br/><br/>Outside the Great Hall, a figure walks in.<br/><br/>Zhao Yi sees the figure, his eyes lighting up, he murmers, “Ning… Yian, you didn’t die…”<br/><br/>He stretches out his hand, as if wanting to grab the figure.<br/><br/>The person doesn’t pause, passing him by.<br/><br/>“Ning Yian!”<br/><br/>His hand falls helplessly, he draws his last breath.<br/><br/>It has finally ended.<br/><br/>Looking at the extinguishing life force of Emperor Zhao Yi, Gu Yang feels somewhat conflicted.<br/><br/>In truth, the Emperor was also a pitiful person.<br/><br/>At the end of his life, he called out the empress’s name and even mistook Miss Su Er for the empress. He could be deemed a lovesick fool.<br/><br/>Prior to the emperor’s demise, it was Miss Su Er who appeared in the Great Hall.<br/><br/>She directly walked over to the body of the empress. Looking at her sister’s remains, her expression was extremely complex.<br/><br/>Seeing her grief-stricken state, Gu Yang felt helpless. All he could say was, “Condolences.”<br/><br/>Miss Su Er had no reaction. She crouched down, gripping the empress’s corpse.<br/><br/>The empress’s body then started to dissipate and eventually transformed into a pearl, which flew into the brow of Miss Su Er in a flash.<br/><br/>What the hell?<br/><br/>This change was completely beyond Gu Yang’s expectation.<br/><br/>A living person, had turned into a pearl.<br/><br/>Next, Miss Su Er’s momentum kept escalating, and her True Essence was surging.<br/><br/>“This…”<br/><br/>Gu Yang watched as she swiftly broke through to the second level of Golden Body. A moment later, she broke through to the third level…<br/><br/>She advanced vigorously, and finally, innumerable vitality of Heaven and Earth began to converge towards her.<br/><br/>After she achieved the Mana Realm, it finally stopped.<br/><br/>“Chi Pearl, external incarnation!”<br/><br/>In the Great Hall, the experienced old minister said with a miserable smile, “So it turns out that the empress of Great Zhou was just an external incarnation of someone else. What a good strategy, playing the world at your fingers.”<br/><br/>Chi Pearl?<br/><br/>External incarnation?<br/><br/>Gu Yang finally understood.<br/><br/>So Miss Su Er was the empress, and the empress was Miss Su Er. These two people, one was the original body, the other was an incarnation.<br/><br/>Holy crap<br/><br/>What a game they played.<br/><br/>Just as Gu Yang was thinking, he suddenly altered his face and looked upwards.<br/><br/>He instantly transformed into a silhouette and appeared outside the Great Hall, seeing a large black vortex forming in the sky.<br/><br/>At the center of the vortex, a giant face protruded from within.<br/><br/>A chaotic and evil aura emanated from the vortex as it expanded, causing one’s heart to palpitate.<br/><br/>The Heavenly Venerable of the Red Bright Heaven!<br/><br/>The incredibly wicked being who wanted to turn the human realm into purgatory, the greatest adversary of all humanity.<br/><br/>If it arrives at the Divine City, with Dean Wen being dead, it won’t be long before humanity faces an unprecedented calamity.<br/><br/>Gu Yang held the Imperial Seal in his hand, crazily channeling all his True Essence into it.<br/><br/>In an instant, the entire palace began to respond. A golden dragon flew out from the seal, whirling around in the sky, and the array was about to be activated.<br/><br/>Up in the sky, the vortex momentarily halted.<br/><br/>That giant face, composed of black energy and non-human, looked at him.<br/><br/>Gu Yang boldly glared back.<br/><br/>On the other side, an immense sword intent was ready to be unleashed.<br/><br/>The giant face opened its mouth and spat out two words, “Gu Yang!”<br/><br/>The vicious voice echoed in the sky, as if it could stir up the most primal hatred and killing intent in people’s hearts.<br/><br/>The face slowly retracted.<br/><br/>The vortex in the sky slowly disappeared, restoring tranquility.<br/><br/>“That was close!”<br/><br/>Gu Yang wiped away some cold sweat. Just now, his True Essence was almost depleted; he was far from activating the array.<br/><br/>If that Heavenly Venerable had descended despite everything, he would have been unable to activate the array.<br/><br/>Luckily, he managed to frighten the enemy away with mere show of strength.<br/><br/>With this, he had truly saved the world.<br/><br/>Of course, more importantly, he had saved himself.<br/><br/>Looking at the Imperial Seal in his hand, Gu Yang wanted to take it away.<br/><br/>This Imperial Seal was an Abnormal Treasure. With it, he could be unrestricted in the palace.<br/><br/>Wonder how many units of energy it is worth?<br/><br/>The God-Slaying Knife was a Magic Treasure, worth twenty units of energy.<br/><br/>This Imperial Seal, the core of the palace array, surely had a worth significantly greater than that of the God-Slaying Knife.<br/><br/>Gu Yang was strongly tempted to exchange it for energy.<br/><br/>However, in the end, he restrained himself. It wasn’t time yet, as it was the key to confront that Heavenly Venerable.<br/><br/>Having obtained the mandate of the “Nine Heavens Divine Method”, he tossed the seal back into the Great Hall, saying, “You owe me a favor.”<br/><br/>Having said that, he turned around and left.<br/><br/>“Did I forget something?”<br/><br/>When Gu Yang was about to leave the palace, a thought flashed across his mind.<br/><br/>“Right, Senior Wen!”\t\t\t\t\t\t</div>", "images": {}, "success": true}