{"id": 212, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132025.html", "title": "Chapter 212 - Chapter 212: 212 Golden Core Slash", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 212 - Chapter 212: 212 Golden Core Slash</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 212: 212 Golden Core Slash<br/><br/>Translator: 549690339<br/><br/>“Moonlight Sword!”<br/><br/>The gazes of the other Golden Core cultivators present shifted, becoming somewhat different.<br/><br/>Twenty years ago, the matter of the Moonlight Sword and the Zhang Family was a heated issue, drawing competition from many sides.<br/><br/>In the end, that Zhang Family disciple was taken in by the Ancient River Sword Sect, and the Moonlight Sword also fell to the Ancient River Sword Sect, thus calming down the matter.<br/><br/>Now, once again a ripple has begun, the Moonlight Sword has fallen into another’s hand.<br/><br/>At this moment, many in the audience are growing restless.<br/><br/>The Moonlight Sword is connected to the whereabouts of a Magic Treasure; even old Nascent Soul monsters would be moved, let alone them.<br/><br/>However, even though they are moved, no one dares to act rashly.<br/><br/>The person in question is a true disciple of the Ancient River Sword Sect, practicing authentic Xuan Gate swordsmanship. Even though he is only in the initial Golden Core stage, he is not someone they, who deviate from the Orthodoxy, could contend with.<br/><br/>In this world, there are only twelve orthodox Xuan Gate methods that can directly lead to the God Transformation Stage out of the Four Major Orthodoxies.<br/><br/>The rest are side doors, far from being able to compare with orthodox disciples.<br/><br/>“That person is as good as dead.”<br/><br/>Not far away, both Huang Yongkang and an elder softly spoke.<br/><br/>“Li Shang broke through to the Golden Core stage five years ago, and he practices one of the Twelve Authentic Methods of the Xuan Gate, the Green Primordial Method. His Spirit Tool, the Green Primordial Sword, is unpredictable along with the Green Primordial Sword Incantation.”<br/><br/>“Among the side doors, only those few at the peak of Golden Core could fight against him.”<br/><br/>Not to mention, that person is merely at the Foundation Establishment Stage, how could he withstand a slash from Li Shang?<br/><br/>Huang Yongkang is no longer the ignorant child from half a month ago, and he began to aspire to the Four Major Orthodoxies.<br/><br/>However, he could not help but worry for the man.<br/><br/>If it were not for the man giving him an introductory cultivation manual, he would not have the chance he has now, and would not have truly stepped on the path of cultivation.<br/><br/>Hum!<br/><br/>Gu Yang drew his Phoenix Feather Knife, and for the first time since it had been sealed, its true edge was revealed.<br/><br/>Instantly, the oppressive aura is chopped apart.<br/><br/>However, he does not retreat but advances instead, his True Essence erupting. A killing intent has already locked on to his opponent.<br/><br/>If he were in Great Zhou, meeting a cultivator at the Mana Stage, he would naturally turn around and run. A typical Mana cultivator could never catch up to him.<br/><br/>But, in this Moon Water realm, those cultivators’ flying sequentials are extremely sophisticated.<br/><br/>Especially the Sword Sequential, its speed is beyond belief.<br/><br/>Most importantly, Gu Yang has already uncovered a weakness of Moon Water cultivators – their strong offense but weak defense.<br/><br/>Cultivators in this world indeed possess far more destructive power than martial artists.<br/><br/>However, they also have a weakness. Casting a spell requires a process, the cultivator uses their own True Essence to stir the power of heaven and earth.<br/><br/>No matter how brief this process is, they cannot skip this step.<br/><br/>This is their fatal weakness.<br/><br/>Gu Yang has always taken cultivators as hypothetical enemies, and he has already come to a conclusion in his heart.<br/><br/>When facing an enemy whose power does not differ much from his, if he allows a certain distance to develop, he will lose.<br/><br/>But if he can get close, then without a doubt, his opponent is bound to die!<br/><br/>At this moment, the opponent is no more than fifty meters away from him, which falls right within his attack range.<br/><br/>“Heavenly Inquiry Nine Knives,” the Third Move – Momentum Engulfing the Universe!<br/><br/>Gu Yang is aware that what he is facing is a cultivator equivalent to the Mana Stage, thus he unleashes his strongest technique immediately.<br/><br/>“Magic Treasure!”<br/><br/>The faces of the Golden Core Stage cultivators nearby changed greatly as they saw the Phoenix Feather Knife in Gu Yang’s hand, and they exclaimed in surprise.<br/><br/>The unfamiliar Foundation Establishment Stage youngster before their eyes actually owns a Magic Treasure.<br/><br/>All four of them had their greedy desires ignited and their eyes turned red in an instant.<br/><br/>This was a Magic Treasure!<br/><br/>If they had a Magic Treasure, why should they fear a true disciple like Li Shang?<br/><br/>Once they reach the peak of the Golden Core Stage, they could even contend with old Nascent Soul monsters if they had a Magic Treasure.<br/><br/>The reason why the Six Evil Sects could establish their Sects under the eyes of the Four Major Orthodoxies was that each of these six Sects possessed a Magic Treasure.<br/><br/>If they were able to snatch this Magic Treasure, then in the future, once they achieve Nascent Soul, they might be able to establish their own Sect as well.<br/><br/>“Magic Treasure!”<br/><br/>Li Shang was also greatly surprised and then overjoyed.<br/><br/>My opportunity has arrived!<br/><br/>Even for an orthodox sect like the Ancient River Sword Sect, the number of Magic Treasures in the Sect would not exceed ten.<br/><br/>Only when they reach Nascent Soul would they be allowed to control a Magic Treasure.<br/><br/>Now, a puny cultivator at the Foundation Establishment Stage actually has a Magic Treasure in his hand. It’s as if a child is flaunting gold in a bustling marketplace.<br/><br/>The power of a Magic Treasure is infinite, a mere Foundation Establishment cultivator simply does not have the ability to bring out its full strength.<br/><br/>This should be his fortune.<br/><br/>The next moment, a murderous intent creeps over him unnoticed.<br/><br/>When the blade light strikes, crossing space to slash just before him in the blink of an eye, he is shocked, the prior look of joy in his face freezing.<br/><br/>“What saber technique is this?”<br/><br/>He’s never seen or heard of a saber technique that defies spatial comprehension.<br/><br/>Bang, bang, bang!<br/><br/>Three protective spells around his body could not withstand the blade at all and shattered in an instant.<br/><br/>This is bad!<br/><br/>In the blink of an eye, he found himself in an extremely dangerous situation.<br/><br/>At the verge of life and death, Li Shang burst out with unprecedented potential. A Sword Light flew out from his Golden Core, narrowly blocking the deadly Blade Intent.<br/><br/>“Pfft…”<br/><br/>He retched, coughing up a mouthful of blood.<br/><br/>Holding onto his Life Essence Magic Treasure while suffering from the horrific Blade Intent struck a significant blow to his spirit and mind.<br/><br/>Nearly simultaneously, a figure appeared in front of him.<br/><br/>“No”<br/><br/>Fear reflected intensely in Li Shang’s eyes. A flash of Blade Intent swept past him, slicing him in half.<br/><br/>Immediately after, the terrifying Blade Intent erupted into countless sabers, grinding his body into dust and creating a blood mist.<br/><br/>A green Sword Light tried to escape, but it was tightly clutched by a hand.<br/><br/>The Golden Core, fell!<br/><br/>The scene fell deathly silent.<br/><br/>Four Golden Core stage powerhouses stood rooted to the spot, unable to believe what they had just witnessed.<br/><br/>Everything happened too quickly, so quickly that none of those present could react to it.<br/><br/>A Golden Core stage cultivator, a legitimate member of the Xuanmen orthodoxy, was killed and reduced to ashes in a flash.<br/><br/>To everyone’s surprise, Li Shang didn’t even have the time to use his Spirit Tools before his death!<br/><br/>Even more stunning was the fact that the killer — a fledgling cultivator at his Foundation Establishment Stage.<br/><br/>How could this be possible?<br/><br/>The ruthless and efficient killing method sent chills down their spines.<br/><br/>Off to the side, an elder watched as Li Shang transformed into a cloud of blood mist. His mouth hung open in stunned silence.<br/><br/>Huang Yongkang was so excited he could’ve jumped for joy.<br/><br/>Even though he couldn’t see the whole process clearly, he could tell that the uncle who had helped him had won.<br/><br/>Being a child, he naturally sided with Gu Yang.<br/><br/>Gu Yang didn’t expect he’d so easily eliminate a high-powered Magic-cultivator.<br/><br/>It was even easier than he imagined.<br/><br/>The bodies of these cultivators were indeed too weak, only slightly stronger than a First Rank martial artist.<br/><br/>As soon as they got close, they stood no chance against his blade.<br/><br/>Even if he didn’t use the Phoenix Feather Knife, a formidable divine weapon, a simple punch could blow up their bodies.<br/><br/>If the enemy had been someone from Great Zhou at the level of a Magic Stage, he wouldn’t have had any chance at all.<br/><br/>But of course, if the person hadn’t been so contemptuous or arrogant by initiating a distant attack and using the flying sword, he would’ve simply been kited around.<br/><br/>Both cultivation systems have their pros and cons, it’s up to who can better seize the opportunity.<br/><br/>[Energy detected, would you like to recharge?]<br/><br/>“Yes.”<br/><br/>[Recharge successful. 7 units of energy obtained. Current balance: 40 units.]<br/><br/>Surprisingly, there were seven units of energy. This flying sword was even more advanced than the Heavenly Pivot Sword of Lin Ruo Xi.<br/><br/>Gu Yang turned to look at the other four Golden Core stage strongmen, baring his teeth in a smile, “Anyone else want my Phoenix Feather Knife?”<br/><br/>After witnessing Gu Yang’s unpredictable means, fear coursed through the hearts of the four Golden Core cultivators as they did not dare to act rashly.<br/><br/>One of them braved a hoarse voice to say, “The young are always the most heroic. You have impressive skills. May I know your name?”<br/><br/>A thought struck Gu Yang’s mind, and he avoided revealing his real name, “Gu One Saber.”<br/><br/>“Master… Uncle!”<br/><br/>At this moment, the remaining disciples of the Ancient River Sword Sect finally reacted. A woman called out in grief, looking at Gu Yang with eyes full of hatred.<br/><br/>“All disciples listen to my command — form a formation, kill this intruder, and avenge our Master Uncle!”<br/><br/>Clang, clang, clang<br/><br/>Several disciples from the Ancient River Sect drew their swords, preparing to set up a Sword Formation.<br/><br/>Gu Yang frowned and suddenly disappeared from where he stood. With a swish, he appeared among the disciples of the Ancient River Sword Sect.<br/><br/>Pfft, pfft<br/><br/>With a punch for each disciple, he killed them all effortlessly, as though they were mere chickens.<br/><br/>The six real disciples of the Ancient River Sword Sect exploded into clouds of blood mist.<br/><br/>The four Golden Core stage powerhouses watching nearby were inevitably somewhat chilled.<br/><br/>These were real disciples of the Ancient River Sword Sect, beings who could march unopposed in this realm. Even the Left Dao’s six sects, would not dare to provoke them lightly.<br/><br/>The Four Major Orthodoxies were extremely protective of their own, anyone who dared to kill their real disciples would have their entire sect wiped out in response.<br/><br/>Where on earth did this killer star come from, who kills seven disciples of the Ancient River Sword Sect in one go? It’s like poking a hole in the sky.<br/><br/>But the man named Gu One Saber casually collects the magic tools of the Ancient River Sword Sect’s disciples and saunters away.<br/><br/>The four Golden Core stage cultivators stared at each other. In the end, no one chased after him.<br/><br/>With such a murderous figure, who knows what kind of terrifying power he hides?<br/><br/>Magic treasures are enticing for sure, but you have to be alive to take them.<br/><br/>In comparison, they cherished their lives even more.<br/><br/>Nearby, a jade pendant happened to fall next to Huang Yongkang. He picked it up and saw that it was an exquisitely carved dragon jade pendant with some blood on it.<br/><br/>He didn’t know which unfortunate egg of the Ancient River Sword Sect it belonged to.<br/><br/>He casually stuffed it into his pocket.<br/><br/>What he picked up, naturally belonged to him.<br/><br/>PS: It turns out it’s double monthly tickets, oh my Buddha, please support with your monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}