{"id": 213, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132027.html", "title": "Chapter 213 - Chapter 213: 213 Dao Sect Leader", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 213 - Chapter 213: 213 Dao Sect Leader</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 213: 213 Dao Sect Leader<br/><br/>Translator: 549690339<br/><br/>“Run!”<br/><br/>Gu Yang came back to meet Ye Lingbo, grabbed her hand, and started running.<br/><br/>From his experience, Gu knew the people he killed on No Return Mountain were of high stature. Their sect’s masters would be coming after him soon.<br/><br/>He could guess as much even without using Simulation.<br/><br/>The loot this time was enormous, plus the six Magical Tools he got last, brought his energy reserve up to forty-six grids.<br/><br/>It has been a long time since he was this well-off.<br/><br/>Although Ye Lingbo had no idea what was happening, she understood from his urgent tone that the situation was serious. She didn’t ask any questions and followed him.<br/><br/>The pair deliberately sought out quiet, unpopulated places, flying low and keeping a low profile.<br/><br/>After a day and a night, they had already gone over a thousand kilometers.<br/><br/>Finally, they found a place to rest.<br/><br/>Gu Yang opened the system and started a Simulation to predict their fortunes.<br/><br/>“At the age of twenty-two, you have reached the second level of Golden Body. You entered the Water Moon World and killed a cultivator in the initial Golden Core stage on No Return Mountain.”<br/><br/>“Three days later, a Nascent Soul stage powerhouse tracks you down. Using the ‘Divine Phoenix Manual,’ you escape with Ye Lingbo. Unfortunately, you are quickly caught again.”<br/><br/>“Ten days later, you are surrounded by four Nascent Soul stage powerhouses who set up a Sword Formation. At a critical moment, Sword Light comes from the sky, breaking the Sword Formation. You seize the opportunity to escape.”<br/><br/>“Two days later, you find the Dao Sect and leave the Water Moon World.”<br/><br/>“On your own, you quietly leave Divine City. On the way, you encounter a Mana stage powerhouse from the Nether Sect. You are surrounded by two undead creatures of Mana stage, and are eventually killed. You die at the age of twenty-two.”<br/><br/>So it was the Nether Sect.<br/><br/>Gu Yang was somewhat surprised by the cause of his death this time.<br/><br/>He thought that it might be the Shen Family, Cao Family, or even the Lin Family. But, as it turned out, it was the Nether Sect.<br/><br/>To be honest, Gu Yang always thought that this power, which had allegedly suppressed the world for more than a decade, was overrated.<br/><br/>The last time he encountered a second-level Golden Body disciple, he found him weak.<br/><br/>Latterly, the supreme power members of all the major forces weren’t hidden anymore. Like Lin Ruo Xi.<br/><br/>Now, it seems that the Nether Sect indeed had strong members.<br/><br/>A Mana stage powerhouse, plus two Mana stage undead creatures, he could not handle that.<br/><br/>He was chased by Nascent Soul stage powerhouses in the Water Moon World for over ten days before being trapped.<br/><br/>Back in Great Zhou, a Mana stage opponent with two undead creatures left him helpless.<br/><br/>It could only be said that every creature has its predator.<br/><br/>Speaking of which, who was it that saved them at a critical moment with a sword that broke the Sword Formation?<br/><br/>“Simulation ending, you can keep one of the following.”<br/><br/>“I choose number two.”<br/><br/>Suddenly, several battle memories appeared in Gu Yang’s mind.<br/><br/>A few confrontations with Nascent Soul stage powerhouses, and also the battle with the Mana stage powerhouse from the Nether Sect.<br/><br/>A moment later, he opened his eyes, “That kind of miasma energy is surprisingly difficult to deal with.”<br/><br/>During the last encounter with the Nether Sect, their Golden Body disciple was completely suppressed by his True Essence and couldn’t fight back at all.<br/><br/>This time, however, when he faced their Mana stage powerhouse, his True Essence was greatly suppressed and he was beaten without any ability to fight back.<br/><br/>It seems that suppression and being suppressed depend on the level of cultivation.<br/><br/>When his cultivation was higher, he could suppress them.<br/><br/>If they had higher cultivation, he ended up being suppressed.<br/><br/>Since Gu Yang avoided a catastrophe in the Water Moon World, he did not run another Simulation to avoid unexpected incidents.<br/><br/>As expected, three days later, he sensed a strong breath approaching rapidly from far away.<br/><br/>Without wasting a word, he activated the ‘Divine Phoenix Manual,’ transformed into a Phoenix, and escaped with Ye Lingbo.<br/><br/>Thirteen days later, four Nascent Soul stage powerhouses from the Ancient River Sword Sect arrived just to hunt down a junior in the Foundation Establishment Stage.<br/><br/>When the news spread, people were shocked at the extravagant measure taken by the Ancient River Sword Sect. There were also those who ridiculed them for such bullying, saying they had lost all the dignity of the Four Major Orthodoxies.<br/><br/>In the end, the four Nascent Soul stage powerhouses formed a Sword Formation, finally trapping that annoying kid. They were just about to capture him and take him back to their sect.<br/><br/>All of a sudden, a dazzling Sword Light came from outside the sky. The grand formation set up by the four Nascent Soul stage powerhouses was instantly broken.<br/><br/>The two people trapped inside once again transformed into a Phoenix. In the blink of an eye, they disappeared.<br/><br/>This time, the four Nascent Soul Stage powerhouses did not pursue any further.<br/><br/>Because, they recognized the origin of that sword light, the person they needed to protect, how could they possibly kill him?<br/><br/>Unless, the founder personally took action.<br/><br/>However, disturbing the founder over a minor Foundation Establishment Stage cultivator was something they couldn’t face.<br/><br/>All four of the Nascent Soul stage old monsters knew, this time the Ancient River Sword Sect had really lost face.<br/><br/>After this incident, the name of Gu One Saber, spread throughout the entire Water Moon World.<br/><br/>A mere Foundation Establishment Stage cultivator, able to escape the pursuit of four Nascent Soul stage old monsters, is nothing short of legendary.<br/><br/>Two days passed, as usual, Gu Yang and Ye Lingbo spent the night in a cave.<br/><br/>Early in the morning, it started to rain outside.<br/><br/>Gu Yang sat at the cave entrance and breathed a sigh of relief.<br/><br/>It seems, everything is the same as in the simulation, today, they should be able to find the leader of the Dao Sect.<br/><br/>He looked at Ye Lingbo, who was meditating not far away, and suddenly interrupted, “What exactly is your relationship with this pocket world?”<br/><br/>That day, the mysterious powerhouse that saved them was probably there for her.<br/><br/>Ye Lingbo opened her eyes and shook her head, “I don’t know either.”<br/><br/>“Ever since I can remember, I have been in the academy. Some people say that I am a reincarnation of an ancient power. I don’t know whether I am or not.”<br/><br/>“All I know is that my current cultivation level is the result of my own hard cultivation.”<br/><br/>“All my knowledge is learned from books. I haven’t awakened any inherent wisdom, nor have I received any method inheritance.”<br/><br/>“If there is anything special about me, it’s only the Immortal Spirit Qi within my body.”<br/><br/>“However, to me, that seems more like a restriction. If it wasn’t for this Immortal Spirit Qi, I would have entered the realm of Divine Power a long time ago.”<br/><br/>Gu Yang nodded, indicating understanding.<br/><br/>She is only at First Rank cultivation level, the principal wouldn’t tell her too many things.<br/><br/>Knowing too much is not always a good thing.<br/><br/>Ye Lingbo added, “However, this pocket world gives me a very familiar feeling. Maybe it really has something to do with me.”<br/><br/>Suddenly Gu Yang said seriously, “You said last time you wanted to form a Dao Companion bond with me, do you still hold to that?”<br/><br/>Ye Lingbo nodded solemnly.<br/><br/>Gu Yang took a deep breath, braced himself, and asked a question that could have made him a target of public criticism on Earth, “Then you wouldn’t mind, if I have others by my side…”<br/><br/>Just then, a figure appeared out of thin air outside the cave, saying, “Did Principal Ren send you?”<br/><br/>Gu Yang was startled and looked over, seeing a Taoist nun dressed in a wide Daoist robe without being able to discern her exact age.<br/><br/>At first glance, she seemed like a kind old lady.<br/><br/>A closer look revealed her to be a middle-aged woman.<br/><br/>But upon careful examination, her appearance was incredibly youthful.<br/><br/>The drastic contrast between her appearance and aura left a unique impression.<br/><br/>Ye Lingbo quickly stood up, “Academy disciple Ye Lingbo, greets the Head of the Academy!”<br/><br/>Gu Yang also followed suit, “Junior Gu Yang, greets the Head.”<br/><br/>The Taoist nun’s gaze swept over them, lingering on Gu Yang for a few extra seconds, asking, “What happened?”<br/><br/>Gu Yang replied, “The principal asked us to find senior.”<br/><br/>“Then let’s go.” The Taoist nun nodded, not asking further.<br/><br/>Ye Lingbo pinched her eyebrow, a ripple appeared in front of her.<br/><br/>The three of them stepped through the ripple, disappearing without a trace.<br/><br/>“Father!”<br/><br/>As soon as Gu Yang returned to the Star Picking Pavilion, he heard Xi Huang’s excited voice and a small figure pounced into his arms.<br/><br/>He gently patted her back.<br/><br/>He knew, he had been gone for a month, she must have been worried sick.<br/><br/>“Principal Zhou, senior, the junior will take me leave first, and will return tomorrow.”<br/><br/>He took Xi Huang and left the academy.<br/><br/>Back at the Tianxin Martial Academy, after coaxing Xi Huang away, Gu Yang was alone in his room. He opened the system, looked at the 44 squares of energy, and took a deep breath.<br/><br/>He would soon be fighting a tough battle, he had to increase his strength.<br/><br/>“Do you want to use the Life Simulator? Use once, consuming two units of energy.”<br/><br/>“Yes.”\t\t\t\t\t\t</div>", "images": {}, "success": true}