{"id": 214, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132029.html", "title": "Chapter 214 - Chapter 214: 214 Golden Body Three Layers", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 214 - Chapter 214: 214 Golden Body Three Layers</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 214: 214 Golden Body Three Layers<br/><br/>Translator: 549690339<br/><br/>“At the age of twenty-two, you have reached the Second Layer of the Golden Body…”<br/><br/>“You and the Dao Sect Master infiltrated the imperial palace to assassinate the emperor, but failed and escaped.”<br/><br/>“You were pursued by two mages in the Mana Realm until you reached the Altar of Heaven offering. You opened the Secret Realm there, and hid inside when an Unleaking Realm warrior emerged closing the entrance of the Secret Realm.”<br/><br/>“Two days later, you emerged from the Secret Realm, the battle was already over.”<br/><br/>“The Principal of the Academy perished in this battle. Lord Luo obtained the Sword of the Human Emperor, assumed control of Divine City, and installed a new emperor.”<br/><br/>“The Queen died, Miss Su Er died, Xi Huang died, Ye Lingbo died.”<br/><br/>“The Dao Sect Master returned to the Water Moon Cave Heaven. You alone hid back in the Secret Realm at the Altar of Heaven, and devoted yourself to training.”<br/><br/>“Ten years later, the entrance to the Secret Realm collapsed. A terrifying will invaded, and you died at the age of thirty-two.”<br/><br/>Too tragic.<br/><br/>Although Divine City was eventually saved, so many people had died.<br/><br/>Lord Luo turned out to be the final winner.<br/><br/>Unfortunately, Red Ming Tian returned not long after. Lord Luo, despite wielding the Sword of the Human Emperor, failed to hold out this time.”<br/><br/>It’s not easy to get back on track when the situation has deteriorated to this extent.”<br/><br/>Regardless, he managed to buy himself ten years, which was no small feat.”<br/><br/>Gu Yang glanced at his remaining balance. He had forty-two units of energy left, enough for twenty-one more simulations.”<br/><br/>“The simulation is complete, you can choose to retain one of the following.”<br/><br/>“One, your Martial Arts realm at the age of thirty-two.”<br/><br/>“Two, your Martial Arts experience at the age of thirty-two.”<br/><br/>“Three, your life wisdom at the age of thirty-two.”<br/><br/>“I choose the first one.”<br/><br/>“Again!”<br/><br/>Gu Yang initiated another simulation.<br/><br/>Again and again, his Cultivation Level kept rising.<br/><br/>Five times, ten times, fifteen times…<br/><br/>But his realm had been unable to break through.<br/><br/>The “Divine Phoenix Manual”, on the other hand, had broken through to the fifth layer, and the other three had broken through to the fourth layer respectively.”<br/><br/>Gu Yang knew that the upcoming battle would be exceptionally perilous. He had to seize every opportunity to boost his own strength.<br/><br/>As for possible Hidden Dangers, he chose to ignore them for now. He would cross that bridge after overcoming this hurdle.”<br/><br/>He was out of options. Whether he left Divine City or stayed put, both paths led to certain death.”<br/><br/>The only chance was to get rid of the Emperor before he went mad.”<br/><br/>Being a hero and such was just a joke.”<br/><br/>He was actually just trying to survive.”<br/><br/>Gu Yang could probably guess why it was so difficult to break through this time.”<br/><br/>Once he reached the Divine Power Realm, his natural aptitude was no longer an issue, and his progress could definitely not be described as slow.”<br/><br/>His upper limit had been raised.”<br/><br/>A typical Golden Body Realm warrior might have a limit of one hundred True Essence. His limit, at the same level, was five hundred, or even more.”<br/><br/>That was why he, at the Second Layer of the Golden Body, had a True Essence equivalent to a Third Layer warrior. The reason behind this was the Phoenix bloodline within him.”<br/><br/>The bloodline of this ancient divine beast had increased his upper limit.”<br/><br/>Even after the twentieth attempt, he still didn’t break through.”<br/><br/>However<br/><br/>“I’m close!”<br/><br/>Gu Yang could feel that he was about to reach his limit.”<br/><br/>Without any hesitation, he used his last chance for simulation.”<br/><br/>“…you have broken through to the Third Layer of the Golden Body…”<br/><br/>“…you died at the age of thirty-two.”<br/><br/>He had finally reached the Third Layer of the Golden Body!<br/><br/>This breakthrough might not have come quickly, but for him, it was crucial.”<br/><br/>He finally had the ability to break the deadlock.”<br/><br/>“The simulation is complete, you can choose to retain one of the following.”<br/><br/>“I choose the first one.”<br/><br/>Rumble!<br/><br/>The True Essence within Gu Yang surged upwards, a red flame soared into the sky, and once again, he transformed into a Phoenix.”<br/><br/>At the same time, his consciousness delved deeper, and a deluge of ancient and profound knowledge flowed into his mind.”<br/><br/>Most of it was fragmented and beyond his comprehension.<br/><br/>In the end, he could only accept a very minimal part.”<br/><br/>A moment later, he opened his eyes, the flames around him returned into his body, and he returned to his human form.”<br/><br/>The body of the Phoenix was complete!<br/><br/>At this moment, he possessed a body comparable to that of a divine beast and he had also inherited two divine powers of the Phoenix.<br/><br/>Firstly, the divine fire, where his True Essence was completely transformed into something like spirit fire, making its power a couple of grades higher than True Essence.<br/><br/>Secondly, longevity, where he now had a lifespan surpassing a thousand years, comparable to those in the Unleaking Realm.<br/><br/>As Gu Yang broke through to the third level of the Golden Body, the commotion was massive. Within Divine City, everyone in the Divine Power Realm could sense it.<br/><br/>The closest, Su Ningyan, looked at the neighboring Tianxin Martial Academy with complex emotions.<br/><br/>She felt like he was leaving her far behind.<br/><br/>At the same time, people from the Academy of Literature, Academy of Martial Arts, the Duke’s Mansion, and all the major powers, even the royal palace, countless eyes were looking in that direction.<br/><br/>However, the feelings of everyone present differed greatly…<br/><br/>Gu Yang got up and pushed the door to go outside. There were quite a few people in the courtyard, brothers like Cheng Xue, Cheng Qingyu, Xi Huang, Feng Tianci had all come.<br/><br/>All of them showed eager excitement.<br/><br/>They didn’t know why they were so excited, perhaps it was because they knew they were witnessing the birth of a legend.<br/><br/>Feng Tianci, his face flushed with excitement, asked, “Brother Gu, have you made a breakthrough again?”<br/><br/>Gu Yang nodded and said, “I’m taking a little trip.”<br/><br/>As he finished speaking, he had already disappeared on the spot.<br/><br/>Those remaining in the courtyard didn’t know how to describe their feelings.<br/><br/>Gu Yang didn’t use the main door to the Duke’s Mansion this time. He hopped over the wall to enter, so as to avoid causing a stir and dealing with a whole bunch of formalities would have been troublesome.<br/><br/>He entered the courtyard of Miss Su Er.<br/><br/>“What do you need?”<br/><br/>Su Ningyan, who was standing there in front of a rosebush, looking at the beautiful flowers, did not even turn her head as she asked.<br/><br/>Gu Yang said, “I want to borrow a spirit tool.”<br/><br/>Su Ningyan took off a green hairpin from her hair, threw it over, and said, “You owe me a favor.”<br/><br/>Gu Yang took the hairpin and, seeing that it was indeed a spirit tool, could not help but sigh. She was a real rich woman.<br/><br/>She could take out a spirit tool from her person at any time.<br/><br/>Unlike the people in the Academy of Literature, Zhou Zongye who was the vice principal, even as a powerful being in the Mana Realm, he only used a magical tool. It was rather pitiful.<br/><br/>Hence, he had only chosen to borrow from Miss Su Er.<br/><br/>He had no choice; the things on his person were all too valuable. The Phoenix Feather Knife after unsealing had become a magic treasure.<br/><br/>There were only about a dozen items of this level known so far.<br/><br/>And more importantly, this knife could increase the power of his saber technique by a notch. To use it to recharge would be too wasteful.<br/><br/>As for the Nine State Seals, they were even more important. If he destroyed one, he couldn’t complete the “Nine Heavens Divine Method”.<br/><br/>Using the Nine Divine Ding to recharge would invite a lightning strike.<br/><br/>Gu Yang returned to Tianxin Martial Academy, recharged this hairpin and got five grids of energy.<br/><br/>[Would you like to use the Life Simulator? Using it once will consume four grids of energy.]<br/><br/>Four grids!<br/><br/>This meant that each simulation would consume almost one spirit tool, or four magical tools, or kill off four martial artists in the Divine Power Realm…<br/><br/>What about when he reaches the Mana Realm?<br/><br/>Gu Yang shook his head, not willing to think about it.<br/><br/>“Yes.”<br/><br/>He directly initiated the simulation.<br/><br/>[Twenty-two years old…]<br/><br/>[You left Divine City alone and encountered a powerful person in the Mana Realm from the Nether Sect. After a round with him, you transformed into a phoenix and left calmly.]<br/><br/>[After successfully escaping from the Nether Sect, you headed to the Secret Realm on Tianzhu Mountain and reunited with Su Qingzhen and the others. ]<br/><br/>[Eleven years later, you are at the peak of the entrance to the Secret Realm. The human realm has turned into a purgatory. The moment you came out, you were attacked by countless ghostly beings.]<br/><br/>[You fled for two years and were finally rescued and taken to the Star Sea Haven.]<br/><br/>[Five years later, a major war erupted outside. The Star Luo Sect opened the path to the human realm and faced the ghostly beings in a great battle.]<br/><br/>[When the powerful ones in the Star Sea got the news, they decided to join hands with the Star Luo Sect.]<br/><br/>[The war stalled for three years, the path to the Wanxiang Haven opened, and the Wanxiang Gate also joined the war.]<br/><br/>[After the joining of the three forces, the scale of victory finally began to tilt towards the human side.]<br/><br/>[Five years later, during the final battle in Divine City that caused the heavens to collapse and the earth to crack, you were attacked by several ghostly beings in Unleaking Realm and eventually perished. You died at forty-eight.]<br/><br/>It turned out that Star Luo Sect and Wanxiang Gate actually joined hands with Great Zhou.<br/><br/>Gu Yang felt that this simulation really had a sense of black humor.<br/><br/>[Simulation concluded, you may keep one of the following items.]<br/><br/>[First, the martial arts realm at forty-eight.]<br/><br/>[Second, the martial arts experience at forty-eight.]<br/><br/>[Third, wisdom of life at forty-eight.]<br/><br/>“I choose the second.”<br/><br/>PS: The third chapter asks for monthly passes.\t\t\t\t\t\t</div>", "images": {}, "success": true}