{"id": 217, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132035.html", "title": "Chapter 217 - Chapter 217: 217 Wild Men", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 217 - Chapter 217: 217 Wild Men</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 217: 217 Wild Men<br/><br/>Translator: 549690339<br/><br/>Within Chengtian Palace, the fifth prince, Zhao Han, was feeling very conflicted at the moment.<br/><br/>On one hand, he was happy. With the emperor’s appearance, the woman could no longer monopolize the court.<br/><br/>Compared to that woman, his father, who had a soft spot for flattery, was much easier to deal with.<br/><br/>As long as he could win the emperor’s favor, his chances of inheriting the throne would greatly increase.<br/><br/>As the legitimate eldest son, he had an unparalleled advantage in this respect.<br/><br/>After all, the emperor was a man of nostalgia and he had once been deeply in love with Zhao Han’s mother.<br/><br/>If it were not for that woman’s appearance, the position of the Crown Prince would have been set in stone to be his. What else could anyone else do about it?<br/><br/>But now, only the second and third princes had the qualifications to compete for the throne with him.<br/><br/>They were originally illegitimate sons, but were older than him and had a higher cultivation level. Plus, with the appearance of that woman, they had gained such an opportunity.<br/><br/>Of course, the main reason was the death of his older brother.<br/><br/>The eldest prince, who shared the same mother with him, was the undeniable choice for prince. But when their mother passed away, his elder brother followed.<br/><br/>This incident was a huge blow to the emperor, causing his health to fail. Finally, that woman took advantage of his weakness and struck.<br/><br/>On the other hand, he was somewhat worried.<br/><br/>Looking at the emperor now, his health was clearly much better.<br/><br/>If the emperor completely recovered, he wondered how many years the emperor would live. He didn’t know when he would finally ascend to the throne.<br/><br/>Lost in these complex feelings, Zhao Han had barely listened to the minister’s words.<br/><br/>Finally, the minister finished speaking and withdrew.<br/><br/>The court was again enveloped in silence.<br/><br/>At this time, no one dared to speak lightly.<br/><br/>The ministers did not dare to speak, and the three princes didn’t know what to say.<br/><br/>And the Empress, well, she couldn’t just speak out either. After all, she was the empress, the wife must not outshine the husband.<br/><br/>She actually anticipated the emperor’s appearance.<br/><br/>Ever since she found out that the emperor might have practiced the “Heavenly Extreme Divine Skill”, she guessed that this day would come.<br/><br/>At this moment, upon seeing the emperor for the first time, she knew that the present Zhao Yi was not the same as before.<br/><br/>However, she truly had no way to change this.<br/><br/>Zhao Yi was the emperor of the Great Zhou, no matter how weak he was, as long as he remained in the palace, no one could kill him.<br/><br/>Since the beginning of the former dynasty, through two dynasties and thousands of years, there had been people who wanted to assassinate the emperor in the palace, but none had ever succeeded.<br/><br/>The Xia Emperor died outside Divine City.<br/><br/>The last emperor of the Qin Dynasty was killed by a multitude of powerful individuals who stormed the palace after Divine City was conquered.<br/><br/>Although she was the empress, she could not command the three strongest individuals in the Unleaking Realm in the palace—correction, there were only two left now.<br/><br/>These two only obeyed the emperor’s orders.<br/><br/>With these two around, no matter who came to the palace, they could not cause any upheaval.<br/><br/>Even if she wanted to kill the emperor, as soon as she moves, she would probably become a corpse immediately.<br/><br/>Even if she asked for her sister’s master, that Mana Realm power, it would make no difference.<br/><br/>In the face of absolute power, no amount of plotting makes a difference.<br/><br/>All she could do was help Gu Yang infiltrate the palace.<br/><br/>She hoped that this man, who had repeatedly created miracles, could once again work his magic.<br/><br/>At this moment, Zhao Yi broke the silence, “The Empress has been managing state affairs on my behalf for the past few years, and it must have been hard. Now, I have recovered, the Empress can enjoy a peaceful life in the palace.”<br/><br/>His words dropped like a huge stone into a lake, causing ripples.<br/><br/>None of the people present were fools. They all understood the hidden meaning: The Emperor wished to take back the power the Empress held.<br/><br/>The Great Hall was so quiet you could hear a pin drop. Everyone was holding their breath.<br/><br/>Everyone realized that a great change was about to occur in the Great Zhou court.<br/><br/>Even the three princes and several royalists were in shock at the emperor’s resoluteness.<br/><br/>The emperor today seemed like a completely different person.<br/><br/>In the past, the emperor was always indecisive, considering this and that. He often couldn’t make up his mind about things. Even after a decision was made, he would often change his mind overnight.<br/><br/>Now, after a decade, on his first day back in court, he had taken away the Empress’s power and sent her back to the inner palace.<br/><br/>The staunch supporters of the Empress were all sweating profusely, as if sitting on pins and needles.<br/><br/>For the past ten years, the Empress had undergone numerous purges of the court, replacing them with those willing to listen to her, and finally gained complete control of the court.<br/><br/>The cabinet, the six departments, most of these high officials, were essentially all raised by the queen. They could only follow her lead.<br/><br/>Now, the emperor wants to regain control of politics, what will these loyal followers of the queen do?<br/><br/>If the emperor dislikes them, once they fall out of favor, it would be akin to everyone pushing when the wall has fallen.<br/><br/>The Queen stood up, saying, “Thank you, Your Majesty, for understanding. It feels as though a thousand pounds have been lifted from my shoulders. In the future, with your majesty ruling the country, the Great Zhou will undoubtedly prosper and the people shall live in peace.”<br/><br/>Those present were shocked. They didn’t expect her to give up her power so easily.<br/><br/>This didn’t fit her style at all.<br/><br/>This woman was steely enough to put those inconvenient officials in jail when she initially had no foundation, causing a great uproar.<br/><br/>Since then, she has maintained a firm grip on power.<br/><br/>Now, with one word from the emperor, she readily retreats to the inner palace without even offering resistance, it’s too abnormal.<br/><br/>Zhao Yi stared at her. Seeing her submissive appearance, his heart felt extremely pleased. He reached out to grab her hand.<br/><br/>The Queen calmly took a step back, avoiding his hand and said, “Then, I will take my leave first.”<br/><br/>Zhao Yi was furious to see her evade him, “Did I tell you to leave?”<br/><br/>At this moment, everyone felt something was wrong.<br/><br/>The emperor was generally soft-spoken and had never lost his temper in public.<br/><br/>Moreover, publicly losing his temper at the Queen was unprecedented.<br/><br/>Today’s events were far too abnormal.<br/><br/>The queen stood still, asked, “Is there anything else His Majesty would like to command?”<br/><br/>“I order you to come here,” the emperor patted the empty spot next to him, signaling for her to sit beside him.<br/><br/>This frivolous gesture left everyone astounded.<br/><br/>This was the Chengtian Palace, making such almost flirtatious remarks in front of the court officials was unheard of.<br/><br/>Finally, the Queen replied calmly, “Your Majesty, please restrain yourself.”<br/><br/>She dares to reject me!<br/><br/>Fury surged in Zhao Yi’s chest. The words that had been lingering in his mind came bursting out, “You lowly woman, I’ve given my all to you. Elevated you from an insignificant palace maid to the Empress, the ‘Mother of the World.’<br/><br/>“Whatever you desired, I bestowed upon you, even taught you the ‘Dragon Emperor Extreme Path’ which was unprecedented. I even let you rule politics. Which queen in history could ever compare to you?”<br/><br/>“But you, how do you treat me? Let me restrain myself?”<br/><br/>“Speak, is it only that wild man that is in your heart? For this wild man, you do not even permit me to touch you.”<br/><br/>Upon hearing his accusations, everyone present intake a sharp breath.<br/><br/>Such an allegation was far too severe.<br/><br/>A queen, the wife of the emperor, seeing a wild man?<br/><br/>And this matter was accused by the emperor himself in front of all his subjects.<br/><br/>Even though emperors in the history of Great Zhou have been somewhat unusual, this type of scandal was absolutely unheard of.<br/><br/>The queen was finished!<br/><br/>Everyone came to this realization.<br/><br/>When the emperor publicly makes such claims, all that awaits the queen is an endless abyss of doom.<br/><br/>The queen’s loyal supporters were now feeling like they had fallen into a bitter pit of ice.<br/><br/>With the downfall of the queen, would they ever live peacefully?<br/><br/>The moment those coveting their positions see their downfall, they will seize the chance to eliminate them.<br/><br/>The queen’s face changed dramatically, looking at the twisted expression on the emperor’s face, it felt so unfamiliar.<br/><br/>In the end, she couldn’t avoid this calamity.<br/><br/>When she entered the palace all those years ago, she had already been prepared.<br/><br/>She let out a mournful smile, “To prove my innocence, there is no stone left unturned but death.”<br/><br/>She took off one of her hairpins, pressed it against her neck, sighed in her heart, “My foolish little sister, you have won.”<br/><br/>PS: It’s already April 1st, looking forward to your votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}