{"id": 211, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132022.html", "title": "Chapter 211 - Chapter 211: 211 Won In Mahjong", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 211 - Chapter 211: 211 Won In Mahjong</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 211: 211 won in mahjong<br/><br/>Translator: 549690339<br/><br/>Gu Yang, persuaded by stubborn disbelief, decided to simulate once more.<br/><br/>[22 years old…]<br/><br/>[You left Ye Lingbo behind and found a place to hide and cultivate on your own.]<br/><br/>[Half a year later, you began to explore the world, only to encounter a Golden Core stage cultivator who wants to kill you without giving any explanation. You used the Divine Phoenix Technique to escape.]<br/><br/>[Two years later, you were constantly pursued. One day, a Nascent Soul stage cultivator used a magic treasure to trap you and took you back to his sect.]<br/><br/>[You were subjected to soul-extracting and spirit-refining torture and died in agony at the age of twenty-five.]<br/><br/>How ruthless!<br/><br/>Seeing the outcome of this simulation, Gu Yang began to understand why Ye Lingbo didn’t want him to stay here.<br/><br/>The cultivation technique he practiced was completely different from those of this world. If discovered by high-ranking cultivators here, he would be hunted down.<br/><br/>Golden Core is not enough, Nascent Soul is the next level.<br/><br/>Without sufficient power, staying in this world is equivalent to seeking death.<br/><br/>In fact, his previous experience in the Myriad Manifestation Cave World during the simulation had already made the problem evident.<br/><br/>Now, he confirmed this point.<br/><br/>[Simulation ends. You can retain one of the following.]<br/><br/>Gu Yang chose the first option, resulting in a slight improvement in his power.<br/><br/>With regards to the “Nine Heavens Divine Method”, he took heed of the Dean’s advice, deciding not to practice it for the time being until he had obtained the general outline.<br/><br/>Ye Lingbo, who had been meditating beside him, seemed to sense something, opened her eyes and looked at him with a hint of surprise.<br/><br/>Soon, she closed her eyes again and continued her cultivation.<br/><br/>Elsewhere, a group of young men and women were discussing No Return Mountain by a large river.<br/><br/>One of the girls asked, “Master Uncle, is it true that there are relics left behind by an old Nascent Soul monster on No Return Mountain?”<br/><br/>The man affectionately called ‘Master Uncle’ wore a strand of beard and carried a sword on his back. He exuded an extraordinary demeanor, evidently a powerful Golden Core stage cultivator.<br/><br/>“Hundreds of years ago, an old Nascent Soul monster indeed secluded himself on No Return Mountain, calling himself the Forgetful Sword Immortal, his cultivation unfathomable. Few have heard of him as he seldom revealed himself to the world.”<br/><br/>The girl’s eyes sparkled, “If there truly are relics left by the old Nascent Soul Monster, then this is our opportunity. I want to see if those independent cultivators dare to compete with our Ancient River Sword Sect.”<br/><br/>The Ancient River Sword Sect is one of the four great reputable sects in the Lunar Water Cave World.<br/><br/>The young men and women present are all real disciples of the Ancient River Sword Sect. Despite their youth, they have attained Foundation Establishment stage and are naturally arrogant, looking down on solo cultivators.<br/><br/>Their journey is meant for gaining experience.<br/><br/>The Golden Core stage male named Li Shang is responsible for their safety.<br/><br/>Li Shang said, “Don’t forget, our primary objective is to retrieve Junior Brother Zhang’s Moonlight Sword. According to the Crow Daoist, the Moonlight Sword was taken by a man and a woman. We have been following their tracks all the way here and must remain vigilant.”<br/><br/>The earlier girl said, “Master Uncle, the news of the relics left by the Nascent Soul monster on No Return Mountain has spread far and wide. If that pair of man and woman are nearby, they might be tempted. We could try our luck.”<br/><br/>After some thought, Li Shang found her argument reasonable and agreed to it by nodding his head.<br/><br/>The next day, Gu Yang left Ye Lingbo behind and went to No Return Mountain alone.<br/><br/>With a cave of a powerful Nascent Soul stage cultivator involved, many solo cultivators must be gathered there. There was no need to risk her safety.<br/><br/>Gu Yang flew all the way, seeing a treasure light shooting up into the sky from afar.<br/><br/>Only then did he understand why the news had spread. This bright beam could be seen clearly from hundreds of miles away at night.<br/><br/>This was exactly what he wanted, “the more people, the better.”<br/><br/>Gu Yang quickened his pace without concealing his figure.<br/><br/>Just as he was about to reach No Return Mountain, a dark light flew towards him like lightning, striking him down.<br/><br/>“Got you!”<br/><br/>A man in a black cloak jumped out from the side, laughing triumphantly, “Ha ha, I’m in luck today, bumping into a chick—ugh!”<br/><br/>Before he could finish his words, he suffered a heavy blow, spat out a mouthful of blood, and screamed, “My magical tools—”<br/><br/>His heart-connected magical tools were unexpectedly destroyed, subjecting him to backlash, and he was severely injured in an instant.<br/><br/>Not far away, under a mound of earth, an old man was quietly instructing his newly accepted disciple, “See? That man possesses Foundation Establishment stage cultivation, but still fell for an ambush. This world is perilous, one must always be cautious…”<br/><br/>Before he could finish, he saw the assailant grievously wounded and vomiting blood.<br/><br/>The old man was dumbfounded.<br/><br/>Then, the head of the man in the black cloak mysteriously exploded, and he died right then and there.<br/><br/>The young man who had been struck down earlier landed next to the corpse and began rifling through its belongings.<br/><br/>Watching the man’s proficient actions, the old man felt somewhat numb.<br/><br/>A phrase inexplicably popped up in his mind: the most skilled hunters often appear as prey.<br/><br/>At this moment, his disciple exclaimed, “I recognize him! He’s the one who killed those people that night and gave me the ‘Minor Celestial Circuit’.”<br/><br/>The child turned out to be Huang Yongkang, the child with the yellow face.<br/><br/>The elder was shocked, the Moonlight Sword was in that person’s possession?<br/><br/>Meanwhile, after Gu Yang took down the surprise attacker, he found three magical tools on him. After recharging, he received four units of energy. Indeed, an excellent start.<br/><br/>This man in the black robe was truly sinister; rather than competing for the Nascent Soul’s treasure, he was hiding here to ambush others.<br/><br/>It looked like at least three people had fallen into his hands.<br/><br/>He glanced at a certain place, a bit surprised to run into the child from that night here.<br/><br/>Keep in mind, this place is at least a thousand kilometers away from that small town.<br/><br/>Seeing that the person nearby didn’t have much aura of bloodthirst, Gu Yang let him go.<br/><br/>He was not the kind to randomly kill innocents, killing those cultivators covered in bloodshed was his way of upholding justice. It did not give him any mental burden whatsoever.<br/><br/>Of course, it was no problem for him to collect some rewards while executing justice, right?<br/><br/>He took off into the sky, continuing his hunting journey.<br/><br/>From another direction, few disciples from the Ancient River Sword Sect also arrived at No Return Mountain. Seeing their sword light from a distance, all the lone cultivators fled away.<br/><br/>Even the cultivators assigned to guard the mountain path didn’t dare to obstruct them.<br/><br/>The leading man was clearly a Golden Core realm expert; no one there could resist even one of his sword strikes.<br/><br/>In no time, the Ancient River Sword Sect and others reached the entrance of the cave dwelling.<br/><br/>Three other groups were present.<br/><br/>Li Shang glanced around, roughly discerned the origins of the three sides. They were all from the so-called Six Outlying Sects, and the most powerful among them were just Golden Core realm, unworthy of his concern.<br/><br/>He belonged to a legitimate sect, those Golden Core cultivators from those secondary sects were not even fit to carry his shoes. Even if they all attacked together, they wouldn’t be a match for him.<br/><br/>However, there was no need to start a battle now.<br/><br/>Because the main door of the cave dwelling was tightly closed.<br/><br/>Looking at the situation, none of the three sides had been able to open the gate.<br/><br/>Li Shang was collecting detailed information on the gate but didn’t attempt to open it himself.<br/><br/>After all, it was a cave dwelling of an old Nascent Soul cultivator, the prohibitions on it were incredibly daunting. Without the method to open the entrance, brute force would not work unless one was a Nascent Soul realm cultivator.<br/><br/>The main goal of his journey was to retrieve his Junior Brother Zhang’s Moonlight Sword.<br/><br/>This spirit tool was of great importance and must not be lost in the wild.<br/><br/>I wonder if that man and woman will come?<br/><br/>“This time, we’re really going to hit the jackpot!”<br/><br/>Gu Yang made a round around No Return Mountain, taking down five people who tried to ambush him and obtained a total of fifteen magical tools.<br/><br/>After recharging them into the system, the energy reached thirty units.<br/><br/>No wonder the protagonists in novels loved killing and seizing treasures, it’s a super fast way to earn resources.<br/><br/>No, I am executing justice on behalf of Heaven.<br/><br/>Yes, executing justice on behalf of Heaven!<br/><br/>Those people were steeped in bloodshed, killing them was serving justice for the people.<br/><br/>Gu Yang looked around for a while longer, but no one else came forward. Thus, he headed towards No Return Mountain.<br/><br/>“Stop!”<br/><br/>Suddenly, a man jumped out in front, wielding a magical tool.<br/><br/>Seeing that the man was steeped in a heavy aura of mass murder, Gu Yang lifted his hand, slashed him into two, and casually picked up his magical tool. He then directly recharged it into his system.<br/><br/>Thirty-one units!<br/><br/>He flew toward the place where the treasure light was rising, taking down two more people on the way.<br/><br/>The energy counter reached thirty-three units.<br/><br/>This time, it was indeed a great windfall.<br/><br/>Gu Yang finally stopped when he saw the cave dwelling inlaid in the mountain with its doors tightly closed.<br/><br/>What was critical was the four groups of people standing next to it.<br/><br/>He could not help but be startled, “So many Mana realm giants!”<br/><br/>Among those present, there were actually five Mana realm beings. According to this world’s realm classification, they should be at the Golden Core stage.<br/><br/>I can’t beat them, better retreat.<br/><br/>Gu Yang immediately considered retreating. He had already made a decent profit today, it made sense to quit while he was ahead and avoid the risk.<br/><br/>“Wait!”<br/><br/>Suddenly, the strongest Golden Core realm expert among them spoke up.<br/><br/>At the same time, Gu Yang was locked in his sword intent. That man said coldly, “Hand over the Moonlight Sword, I will spare your life!”<br/><br/>Moonlight Sword?<br/><br/>Sorry, I’ve already recharged that into my system.<br/><br/>PS: It’s the 30th, with only two days left, I am asking for your monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}