{"id": 218, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132037.html", "title": "Chapter 218 - Chapter 218: 218 War Mana", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 218 - Chapter 218: 218 War Mana</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 218: 218 War Mana<br/><br/>Translator: 549690339<br/><br/>When Gu Yang and the Dao Sect’s master Wen Jue arrived at Chengtian Palace, they didn’t alarm anyone and entered the Great Hall directly.<br/><br/>They arrived just in time to see the Empress slit her own throat with a jade hairpin, blood splattering across the Great Hall.<br/><br/>“Why did she commit suicide?”<br/><br/>Upon seeing this, Gu Yang was stunned.<br/><br/>From another perspective, he could clearly “see” that her life was rapidly fading away, and in a blink of an eye, she had turned into a corpse.<br/><br/>The Empress is indeed dead?<br/><br/>He found it hard to believe that the mysterious Empress, who always had the last laugh in all his previous simulations, had died so easily.<br/><br/>“No”<br/><br/>Zhao Yi’s head buzzed, his eyes nearly bursting out of their sockets. He reached out to stop her, but it was already too late.<br/><br/>All he held was a dead body.<br/><br/>The ministers in the Great Hall were all shocked to the extreme point, as if in a dream.<br/><br/>They simply couldn’t believe that the Empress, who had dominated the court for nearly a decade, had died just like that.<br/><br/>“Attack!”<br/><br/>At the same time, Wen Jue gave the signal, pulled out her sword, and charged at the Emperor.<br/><br/>Boom!<br/><br/>The instant she made her move, two terrifying auras descended onto Chengtian Palace, crashing into her.<br/><br/>“Come on!”<br/><br/>Wen Jue showed no fear. Above her head, a Tai Chi pattern appeared, repelling the palace’s force field and restoring her full mana. Her Unleaking Realm cultivation level burst out without any reservation.<br/><br/>The numerous ministers on the scene were nearly hit by the overwhelming pressure, with those at lower cultivation levels fainting instantly.<br/><br/>“Un…leaking…realm!”<br/><br/>A few ministers with higher cultivation levels were utterly horrified in their hearts.<br/><br/>For the first time in five hundred years, a powerful being of the Unleaking Realm had invaded the palace.<br/><br/>Could it be that the events from twenty years ago were about to repeat themselves?<br/><br/>Just then, two rays of light, one red and one blue, enveloped them.<br/><br/>With a flash of light, the terrifying powerhouse disappeared, already been teleported away.<br/><br/>“It was those two who made the move.”<br/><br/>The few elderly ministers who were still conscious, along with the three princes, felt the pressure lighten and a sense of relief as if they had escaped death.<br/><br/>Thank goodness, the two guardians of the palace had taken action. Otherwise, there would have been no survivors in the Great Hall today.<br/><br/>Yet, the crisis was far from over. The assassin was not alone.<br/><br/>“Gu Yang?”<br/><br/>The fifth prince was the first to recognise the identity of the other assassin and uttered in shock.<br/><br/>Hearing this name, the others present felt like they were plunging into an abyss.<br/><br/>Gu Yang, with his Golden Body at the third level, could easily kill them with his physical strength alone, even if his True Essence was suppressed.<br/><br/>Just then, a figure stood in front of the Emperor, holding a knife in his hand and a blade of grass between his teeth.<br/><br/>He extended his mana, firmly pinning Gu Yang in place.<br/><br/>“It’s Uncle!”<br/><br/>The fifth prince recognised the man and was simultaneously surprised and delighted, his heart filled with intense excitement.<br/><br/>His ally had finally arrived.<br/><br/>With the support of his uncle at the Mana Realm, he now had a strong and powerful supporter.<br/><br/>The man who arrived was indeed Pan Chen. He had been at Chengtian Palace for some time, watching everything unfold but had not revealed himself until now.<br/><br/>Only when the Emperor was in danger did he suddenly take action and restrained the assassin.<br/><br/>Pan Chen eyed the man not far away and said, “So you’re Gu Yang? I have heard of you. You’re indeed a once-in-a-millennium exceptional genius. The strength of your body even surpasses mine.”<br/><br/>“If we were outside, I’m not sure I could kill you. Unfortunately, you came to the palace to find death.”<br/><br/>“Is there anything you regret not accomplishing?”<br/><br/>Gu Yang felt as if a mountain was pressing down on him, rendering his struggles futile.<br/><br/>He stared at the man opposite him and said, “So this is what you look like.”<br/><br/>In the simulations, every time he attempted to assassinate the Emperor, he was stopped by a powerful Mana Realm cultivator and was ultimately unsuccessful.<br/><br/>Now, he finally saw what this Mana Realm powerhouse looked like.<br/><br/>He wasn’t an eunuch after all.<br/><br/>So this is what you look like?<br/><br/>Upon hearing these words, Pan Chen was somewhat baffled and the next moment, his expression slightly changed.<br/><br/>Boom!<br/><br/>Gu Yang’s figure began to swell, and the mana cage Pan Chen had set up was suddenly broken.<br/><br/>How is this possible?<br/><br/>In the blink of an eye, Gu Yang had turned into a massive yellow ape standing one zhang tall, his eyes filled with brutality.<br/><br/>The fourth level of the Divine Ape Technique!<br/><br/>The moment he transformed into the giant ape, the jade seal next to the dragon throne vibrated fiercely, emitting a golden glow.<br/><br/>Immediately, Gu Yang felt the ubiquitous suppression on him disappear, and the True Essence that had been suppressed returned to his body.<br/><br/>He raised his hand and slapped it towards Pan Chen.<br/><br/>“It’s the ‘Nine Heavens Divine Method’!”<br/><br/>An old minister cried out in surprise.<br/><br/>This renowned peerless divine technique, which had been lost for a thousand years, had reappeared in the world today.<br/><br/>A few others sensed Gu Yang’s violent power and felt an eerie fear deep in their hearts.<br/><br/>It was as if they faced a primal fear, like a human facing a natural predator.<br/><br/>The three princes retreated continuously, until they reached the side of their father, the Emperor.<br/><br/>The moment the giant ape moved, Pan Chen’s expression changed once again, and finally, he drew his sword.<br/><br/>That was horrifying power, capable of dispersing his mana with physical strength alone.<br/><br/>A Great Ape that Pierces the Heavens!<br/><br/>One of the most top-notched divine beasts legend ever spoke of, possessed infinite strength, its punch could destroy a star, and its foot could step through a continent.<br/><br/>The Golden Body Stage in the realm of the Divine Power came specifically from a part of the “Nine Heavens Divine Method”, the “Divine Ape Technique”.<br/><br/>At this moment, the giant ape transformed by Gu Yang had already far surpassed the limit reachable by the Golden Body Stage.<br/><br/>With a palm strike, space seemed to be collapsing under the pressure. Pan Chen’s mana was also annihilated.<br/><br/>This is pure power.<br/><br/>In different circumstances, Pan Chen could avoid this force.<br/><br/>But at this moment, the Emperor was behind him.<br/><br/>He had no choice but to take the strike head-on.<br/><br/>The moment the sword was unsheathed, it carried a blade of black light.<br/><br/>Hum!<br/><br/>Gu Yang felt a moment of stagnation in his mind, his palm faintly felt a pricking pain.<br/><br/>A rare divine weapon?<br/><br/>His heart shook.<br/><br/>Upon transforming into the divine ape, his body became immensely strong, even mana couldn’t harm him, but this did not include the rare divine weapon.<br/><br/>Gu Yang quickly retreated, staring at the uniquely-shaped, pitch-black knife in his hand, he said word by word, “The God-Slaying Knife?”<br/><br/>That knife gave him an extremely familiar feeling as if it was closely related to the “God Destroyer Nine Styles”.<br/><br/>Saying this, his body transformed again, and in the blink of an eye, he became a phoenix with bright red flames burning on its feathers.<br/><br/>The fifth stage of the “Divine Phoenix Manual”!<br/><br/>The phoenix opened its beak and breathed out golden flame.<br/><br/>The Phoenix Divine Flame!<br/><br/>“Opportunity has come, why are you not acting yet? What are you waiting for?”<br/><br/>Zhao Yi’s was overwhelmed with countless voices in his mind, he felt like his head was about to explode.<br/><br/>“Father, what’s wrong with you?” A concerned voice came from his side.<br/><br/>It was his fifth son.<br/><br/>Zhao Yi, clutching his head, roared, “Don’t come over!”<br/><br/>“Father, you—”<br/><br/>Before he could finish his sentence, he was swallowed by a big, bloody mouth which emerged from a black mist oozing out of Zhao Yi’s mouth.<br/><br/>Caught off guard, he was swallowed in an instant.<br/><br/>The other two princes were stunned by what they had seen.<br/><br/>Too many unimaginable things had happened today, but nothing was scarier than this.<br/><br/>The Emperor had actually “eaten” his younger brother.<br/><br/>Amid a harrowing crunching sound, the Emperor turned his head around, staring deadly at them with his blood-red eyes.<br/><br/>“Don’t”<br/><br/>In that instant, the two were scared out of their wits and turned to flee.<br/><br/>Two clumps of black mist shot out from Zhao Yi, wrapping the two of them and in the blink of an eye, only their outfits remained.<br/><br/>All three princes of Great Zhou, annihilated.<br/><br/>The two black mists returned to Zhao Yi and he felt a surge of strength elevate to the peak of First Rank.<br/><br/>The ministers who witnessed this nearby, were shocked beyond words.<br/><br/>The Emperor had become a monster.<br/><br/>He unleashed yet another clump of black mist towards Pan Chen.<br/><br/>The ministers cried out, “Watch out!”<br/><br/>Pan Chen felt the sudden death of his nephew and immediately after that, two more died while the Emperor’s strength soared exponentially.<br/><br/>In the short span of a breath, the Emperor transformed from an average individual with no cultivation to someone who possessed a cultivation level at the pinnacle of First Rank.<br/><br/>This was beyond belief.<br/><br/>However, all of Pan Chen’s attention was on Gu Yang; he could not be distracted.<br/><br/>At this moment, Gu Yang transformed into a Phoenix and breathed out a cluster of golden flames that brought an unprecedented threat to him.<br/><br/>If he was distracted, it would be his death.<br/><br/>“God Destroyer Nine Styles”, Seventh Style: Sky-Devouring!<br/><br/>With a swing of his knife, a black vortex appeared in front of him, much like a black hole devouring the vitality of heaven and earth.<br/><br/>With his cultivation level in the Mana stage, and the God-Slaying Knife in hand, the power of this style was a thousand times stronger than when Gu Yang had used it.<br/><br/>The all-consuming cluster of golden flames was about to be sucked into the black vortex.<br/><br/>In an instant, the God-Slaying Knife turned red hot, as if it was going to melt.<br/><br/>A golden flame erupted from Pan Chen’s body. His outfit along with his hair was instantly incinerated, and his skin turned pitch black.<br/><br/>At the cost of his injury, he finally received the Phoenix Divine Flame.<br/><br/>On the other hand, Gu Yang could no longer maintain the Phoenix’s form, and reverted back to human form.<br/><br/>The Phoenix Divine Flame had depleted all his internal energy from the Phoenix Bloodline, and it would take decades for it to recover.<br/><br/>Just as Gu Yang was getting ready to take advantage of his opponent’s injury, he saw a black mist enveloping the latter from behind.<br/><br/>It was Zhao Yi!<br/><br/>He seized the opportunity when the Mana stage warrior was severely injured and used the Heavenly Extreme power to seize his magic and cultivation level.<br/><br/>Gu Yang’s true essence was suppressed again and he was unable to transform into a Phoenix.<br/><br/>Whether it’s the Divine Ape, Divine Tiger, or Divine Tortoise, none of these transformations can destroy the Heavenly Extreme Taoist’s power.<br/><br/>The only thing that can restrain the Heavenly Extreme Taoist is the flame of the Phoenix.<br/><br/>In the black mist, intense expansion and contraction were taking place, as if it could rupture at any moment. Obviously, there was a struggle going on between them.<br/><br/>Crack! Suddenly, the God-Slaying Knife fell to the ground.<br/><br/>In a flash, Gu Yang rushed forward and picked up the God-Slaying Knife.<br/><br/>[Energy source detected, do you want to charge?]<br/><br/>“Yes.”<br/><br/>[Recharge successful, 20 units of energy obtained, current balance, 20 units.]<br/><br/>PS: The first update, please vote!\t\t\t\t\t\t</div>", "images": {}, "success": true}