{"id": 210, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132020.html", "title": "Chapter 210 - Chapter 210: 210 This Is A Treasure", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 210 - Chapter 210: 210 This Is A Treasure</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 210: 210 This is a treasure<br/><br/>Translator: 549690339<br/><br/>Huang Yongkang, hiding behind a large tree, had his head lifted, looking at the man and woman resembling exiled immortals, his eyes as wide as saucers, his heart so excited he almost wanted to yell outloud.<br/><br/>This was the image of an Immortal Cultivator in his mind.<br/><br/>Compared to these two people, those from earlier were simply like demons and monsters.<br/><br/>At this moment, the man in the sky spoke, “Where is this place?”<br/><br/>On the ground, the Peach Blossom Fairy replied sweetly, “Esteemed elder, this place is the boundary of Wuyou mountain.”<br/><br/>The man in the sky looked over at her, asking, “And what is this ‘Wuyou’ mountain?”<br/><br/>“Wuyou mountain is one of the six sects of the left path. The master of the mountain is a hermit named Wuyou who has reached the Nascent Soul Cultivation Level.”<br/><br/>“Thank you for your explanation.”<br/><br/>“Esteemed elder, we are all independent cultivators with no intentions of offending you. We will take our leave now.”<br/><br/>However, the man in the sky shook his head, “The lot of you have such a heavy aura of blood, your hands stained in blood. Now that you’ve run into me, consider yourselves unlucky.”<br/><br/>Upon hearing his words, the expressions on the faces of the Peach Blossom Fairy, the Crow Daoist, and the Poison Granny changed drastically. Before they could even react, their bodies collapsed into clouds of blood with loud thuds.<br/><br/>Witnessing this scene, Zhu Shun felt a chill nipping at his hands and feet.<br/><br/>He couldn’t figure out what trick the other party had used to eliminate the three in an instant, leaving them with no time to react.<br/><br/>“Huh?”<br/><br/>In the sky, Gu Yang noticed something odd. The soul of the Crow Daoist vanished just before his Mortal Body was destroyed, as if it had transferred elsewhere.<br/><br/>Not quite at the Divine Power realm, yet he is capable of such a technique. He couldn’t help but admire.<br/><br/>The cultivation system of this world truly is extraordinary.<br/><br/>He didn’t plan on striking again. He was just casually dealing with things.<br/><br/>To tell the truth, during his time in Great Zhou, he had never seen such a murderous aura on a person. This was his first time.<br/><br/>He immediately saw that this aura was the result of wantonly killing.<br/><br/>This is the difference between two worlds. Thinking about what Ye Lingbo had said earlier about the Way of Heaven in the outer world being dead, he began to grasp the concept of the Way of Heaven.<br/><br/>What surprised Gu Yang even more was that the language used in this cave-heaven world was extremely similar to that used in Great Zhou. Although there are some differences in pronunciation and grammar, it did not hinder communication at all.<br/><br/>This discovery seeded a certain thought in his mind.<br/><br/>Gu Yang dealt with the group of crows and the giant snake, and then turned his attention to the last person.<br/><br/>Zhu Shun trembled all over and quickly said, “Junior has never killed innocent people…”<br/><br/>“But, just now you wanted to kill me.”<br/><br/>Gu Yang flicked a finger, instantly a bloody hole appeared in his forehead, the light in his eyes dimmed, and his body fell to the ground with a thud, smashed into a lump of meat.<br/><br/>Throughout the whole process, Ye Lingbo didn’t say a word, just let him handle it.<br/><br/>After landing on the ground, Gu Yang beckoned, and things inside the four corpses flew into his hand on their own.<br/><br/>Among them was a sword, which should have been the Moonlight Sword they were fighting over.<br/><br/>He tried to infuse his True Essence into it but failed.<br/><br/>It turned out to be a Spirit Tool!<br/><br/>He was overjoyed.<br/><br/>[Energy Source Detected. Do you want to charge?]<br/><br/>“Yes.”<br/><br/>The four items in his hand vanished.<br/><br/>[Charging Successful. Earned Eight Energy Units. Current Energy Units: Seventeen.]<br/><br/>Eight energy units!<br/><br/>Gu Yang’s eyes lit up, in addition to the Moonlight Sword, there were actually three other Magical Tools.<br/><br/>One was the Crow Daoist’s bronze flute.<br/><br/>One was the Peach Blossom Fairy’s fan.<br/><br/>And the bag from the Poison Granny that contained the giant snake.<br/><br/>Three cultivators of only the Fourth Rank, and each had a Magical Tool. Does this mean that every cultivator in this world is supposed to own a Magical Tool?<br/><br/>He made a fortune this time!<br/><br/>Gu Yang realized that this was an enormous opportunity.<br/><br/>Remember, in Great Zhou, divine weapons are scarce and are basically in the hands of the great families and prestigious sects.<br/><br/>Even for someone like Lin Ruo Xi, who was a key figure, she only had one Spirit Tool.<br/><br/>In this world, even minor figures with Fourth Rank Cultivation have Magical Tools.<br/><br/>This was like a treasure trove for him.<br/><br/>Just then, a boy around ten years old ran out from the side and fell to his knees, pleading, “I beg you, Immortal, to take me as your disciple.”<br/><br/>Gu Yang sized up the boy, surprised at his boldness.<br/><br/>He had noticed this boy quite early, at first thinking he was one of Crow Daoist’s apprentices. Now it seems unlikely, there’s no Cultivation Level on him.<br/><br/>Gu Yang laughed, “I don’t have time to teach disciples.”<br/><br/>He picked out a book from those in his hand that he got from Zhu Shun, tossed it over and said, “Whether you can practice anything depends on your own fate.”<br/><br/>Of the miscellaneous Cultivators, only Zhu Shun’s cultivation technique was somewhat orthodox.<br/><br/>Having said this, Gu Yang took Ye Lingbo and rose into the air, disappearing in the blink of an eye.<br/><br/>Holding the book in his hand, Huang Yongkang opened it to see and noticed many characters he didn’t recognize, so he tucked it into his coat. Next, he searched the corpses again and got some gold and silver.<br/><br/>“Xiao Si…”<br/><br/>Just then, he vaguely heard someone yelling. He stuffed the gold and silver into his pocket, sniffed out the source of the voice, and went after it, responding, “I’m here.”<br/><br/>“Found him!”<br/><br/>Instantly, voices erupted in excitement.<br/><br/>“What did they mean by ‘Foundation Establishment Stage’ just now?”<br/><br/>Elsewhere, Gu Yang asked Ye Lingbo.<br/><br/>“This is the way realms were classified in ancient times. They are Qi Refinement, Foundation Establishment, Golden Core, Nascent Soul, and Ascension.”<br/><br/>“Qi Refinement ranges from Ninth Rank to First Rank, Foundation Establishment is the Golden Body realm, Golden Core is the Mana realm, Nascent Soul is the Unleaking realm, and Ascension is the Celestial Being.”<br/><br/>Sure enough, this did not surprise him.<br/><br/>Gu Yang then asked, “Are there any beings stronger than Ascended ones here?”<br/><br/>Ye Lingbo answered, “Above Ascension is the Hollow Void. A single world can’t spawn a Hollow Void realm powerhouse unless it has survived from ancient times.”<br/><br/>Gu Yang keenly perceived the implications in her words, “So, are you saying that for cultivation today, the Celestial Being realm is the peak?”<br/><br/>Ye Lingbo responded, “Not necessarily, the universe is vast and if it’s not possible in this world, you can always go to other worlds. There’s always a way out.”<br/><br/>Gu Yang temporarily set the topic aside. His cultivation level was still far from Celestial Being realm. Instead of worrying about it, he might as well think about how to kill the Emperor.<br/><br/>For the next half a month, Gu Yang and Ye Lingbo were searching for the Dao Sect’s leader.<br/><br/>It was then that he realized how vast a single world could be.<br/><br/>It was a whole continent, not smaller in size than the territory of the Great Zhou Dynasty.<br/><br/>They also had a kingdom, but the power of the royal family was far less compared to the Zhao family of the Zhou Dynasty.<br/><br/>In the world of cultivation, the monarchy basically had no effect.<br/><br/>Besides the six left paths, there were four great orthodox sects, the strongest being the Water Moon Sect, but no single sect dominated all the others.<br/><br/>Gu Yang was not in a hurry. According to the simulation results, they should find the leader of the Dao Sect in a month’s time. However, some twists and turns were expected.<br/><br/>On the way, he met a left path practitioner whose blood energy was strong, equivalent to a First Rank martial artist.<br/><br/>Such people, with the blood of so many ordinary people on their hands, deserved to die.<br/><br/>Gu Yang directly killed him and obtained two magical tools in the process.<br/><br/>His energy increased by two, reaching a total of nineteen.<br/><br/>He was rather enjoying this; not only was he able to rid the world of evil, but he also managed to gain energy in the process.<br/><br/>What’s more, Gu Yang learned from that straying practitioner that not far from their current location, on No Return Mountain, a cave dweller had appeared, said to be left by a Nascent Soul expert after his death.<br/><br/>This news must have spread already, many wanderers would definitely come seeking fortunes.<br/><br/>Naturally, Gu Yang would not let this opportunity slip by. After asking for the location of No Return Mountain, he set off in that direction.<br/><br/>That night, Gu Yang and Ye Lingbo found a cave to spend the night in.<br/><br/>He activated the system, opting for a simulation to be on the safe side.<br/><br/>“At twenty-two, you’ve achieved the second stage of the Golden Body realm, defeating Lin Ruo Xi and shocking the world.”<br/><br/>“You and Ye Lingbo enter the Water Moon Realm, going through hardships, finally finding the Dao Sect’s leader. You wish to stay in this world, but Ye Lingbo forcefully removes you.”<br/><br/>“With the help of the Empress, you and the Dao Sect’s leader infiltrate the palace to assassinate the Emperor. The attempt fails, and you escape the palace.”<br/><br/>“The Emperor devours all the strong beings in the palace, reaching the peak of the Unleaking realm, forcibly activating the palace’s large formation intending to deal with the Dean of the Literature Institute.”<br/><br/>“Several Unleaking realm powerhouses appear in the Divine City, leading to a massive battle.”<br/><br/>“Luo Wang arrives, blasts the Emperor out of the palace, the Dao Sect leader takes action, suppressing the Emperor.”<br/><br/>“You are surrounded and attacked by several Mana realm powerhouses, outnumbered, you die in battle, at the age of twenty-two.”<br/><br/>After reading this simulation, Gu Yang took a deep breath.<br/><br/>Is this the price of saving the world?<br/><br/>Being a hero really doesn’t end well.<br/><br/>Saved the Dean, thwarted the arrival of a celestial being in the Divine City.<br/><br/>In the end, he was made a scapegoat.<br/><br/>Where could he go for justice?<br/><br/>And yet, why didn’t Ye Lingbo let him stay in this world?<br/><br/>Gu Yang looked towards Ye Lingbo, who was meditating nearby, feeling somewhat puzzled.<br/><br/>Originally, he planned to stay here and see how long he could. Maybe he could use it as an escape route.<br/><br/>Surprisingly, Ye Lingbo didn’t give him the chance.<br/><br/>“Simulation over, you may retain one of the following.”<br/><br/>“Firstly, the Martial Arts realm you achieved at twenty-two.”<br/><br/>“Secondly, the Martial Arts experience you gained at twenty-two.”<br/><br/>“Lastly, the wisdom you gained from life at twenty-two.”<br/><br/>“I choose three.”<br/><br/>He wanted to see which Mana realm powerhouses held such deep grudges against him, daring to join forces to take him down.<br/><br/>Suddenly, many memories flooded into his mind.<br/><br/>It was the scene of the three Mana realm beings surrounding him.<br/><br/>The Cao Family!<br/><br/>The Gao Family!<br/><br/>And a palace maid!<br/><br/>These three mana realm beings joined forces against him without regard for martial etiquette, looking like they would not stop until he was dead.<br/><br/>What was key, was that not a single person came to his aid.<br/><br/>If it was just one Mana realm being, he could still find a way to escape.<br/><br/>But facing three Mana realm powerhouses, he was practically a sitting duck. It wasn’t long before he was beaten to death.<br/><br/>Lastly, there was one phrase left in his mind, “Being a hero never ends well.”<br/><br/>It truly was tragic.<br/><br/>PS: Let’s keep aiming for monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}