{"id": 216, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132033.html", "title": "Chapter 216 - Chapter 216: 216 Supreme", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 216 - Chapter 216: 216 Supreme</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 216: 216 Supreme<br/><br/>Translator: 549690339<br/><br/>Dawn broke.<br/><br/>Zhao Yi called over one of the servant girls and said, “Change my clothes for me.”<br/><br/>Soon, one of them carried over a dragon robe and helped him put it on.<br/><br/>Donning the dragon robe once again filled him with the sense of power that came with life and death at his command, and also the heavy burden on his shoulders.<br/><br/>For a moment, he seemed to be transported back to that night eighteen years earlier.<br/><br/>A group of court officials stormed into his imperial residence, promptly bowing before him in unison.<br/><br/>He had never experienced such a spectacle before and it terrified him.<br/><br/>Back then, he was the least valued among many princes.<br/><br/>That one time, the emperor took all the other sons hunting, but left him out.<br/><br/>He was well aware that he was not favored by his own father, and as such preferred to avoid being seen in his father’s presence.<br/><br/>He originally thought that he would live his entire life without gaining any notoriety.<br/><br/>Little did he know, fate had a big joke in store for him.<br/><br/>On that night, his father, and all his brothers died. He became the only heir to the throne.<br/><br/>He was practically carried into the imperial palace.<br/><br/>A few days later, he was enthroned as the emperor.<br/><br/>The first time he put on the dragon robe, he was mostly terrified, feeling as if he was carrying a thousand pounds of weight on his shoulders.<br/><br/>At the same time, he was worried that the five hundred years of the Zhao family’s rule would collapse under his reign,<br/><br/>And feared Wu Da, the famously rebellious man, would storm the imperial palace and behead him.<br/><br/>During his first year on the throne, he was scared to death and treaded lightly.<br/><br/>Not until he exterminated the entire Wu Ni family, was he finally able to lay down the worries that had kept him on edge.<br/><br/>In the following six years, he dedicated himself to governing the state, but the condition of the country progressively worsened.<br/><br/>Distressed and battered by the death of the empress, his weak body completely fell apart.<br/><br/>It was then he met the most special woman in his life.<br/><br/>He adored her like a man infatuated with love, so much that he quickly elevated her to the position of empress.<br/><br/>Due to his physical condition, he couldn’t grant his empress the experience of a normal woman. Because of this, he doubled his attentiveness to her.<br/><br/>He was even willing to share his supreme power as emperor with her.<br/><br/>Moreover, she did exceptionally well, managing the state affairs meticulously.<br/><br/>However, he noticed that the empress’ visits to him became less and less frequent…<br/><br/>“When did the empress last visit me?”<br/><br/>Zhao Yi momentarily lost his thoughts.<br/><br/>It was two months ago when, while discussing Gu Yang, he noticed a flash of curiosity in the empress’s eyes…<br/><br/>A sharp pain pricked his heart.<br/><br/>In his mind, a gloomy voice echoed, “That wretched woman is fickle as water. You’ve given everything to her, but she has another man in her heart. Perhaps, they’ve already desecrated your royal bed in the very palace…”<br/><br/>“Shut up!”<br/><br/>Zhao Yi’s expression distorted, like a wounded beast.<br/><br/>“We deserve to die!”<br/><br/>The several maidens and eunuchs next to him were so frightened that they threw themselves on the ground, shivering.<br/><br/>In his mind, the tantalizing voice continued, “If you devour them, you can possess the power you’ve always dreamed of. Then you can strip away everything you’ve bestowed upon that woman, kill that other man, let her cry and beg for your forgiveness…”<br/><br/>Zhao Yi’s breathing became heavier and heavier as an image of the empress crying and begging for his forgiveness appeared before his eyes, causing a faint sense of pleasure.<br/><br/>Power!<br/><br/>Yes, I need power!<br/><br/>The moment this thought was conceived, it spread like wildfire, occupying his entire mind.<br/><br/>Finally, he stretched out his hand and pressed it onto the head of the nearest eunuch. A surge of dark energy appeared behind him, transformed into a giant mouth, and swallowed the eunuch whole. The two beside him were also not spared.<br/><br/>Zhao Yi felt a surge of power flood into him, an unprecedented feeling of strength.<br/><br/>In the blink of an eye, the three eunuchs were completely gone, only their clothes remaining in their place.<br/><br/>“Not enough, still not enough!”<br/><br/>Zhao Yi’s face flushed. The feeling of such tremendous power was irresistible to him.<br/><br/>He needed even greater power!<br/><br/>In Chengtian Palace, the dragon throne in the center was vacant, with a smaller chair beside it where the empress sat.<br/><br/>Below, dozens of court officials stood in two rows.<br/><br/>In the front row, were three men wearing python robes, the princes who were qualified to participate in politics.<br/><br/>This was a decree issued by the emperor a year ago.<br/><br/>Everyone is well aware that this was to groom successors. It would all depend on who performed better.<br/><br/>At this time, a minister was presenting a report. The main topic was the rebellion of the Red Venerate cult.<br/><br/>“Greetings to His Majesty.”<br/><br/>Suddenly, a cry of surprise came from the side.<br/><br/>Everyone turned their heads to see the Emperor, in his dragon robe, step out. His face was rosy and his steps were firm. He looked as if he had already healed from his sickness.<br/><br/>The Great Hall immediately fell silent.<br/><br/>The Emperor’s appearance was beyond everyone’s expectations.<br/><br/>What was even more shocking was that the Emperor, who was rumoured to have little time left, seemed to have fully recovered.<br/><br/>This created a huge impact on everyone present.<br/><br/>Even the politically savvy old ministers didn’t know how to react.<br/><br/>The only one who reacted normally was the Empress. With a calm facade, she broke the silence, “Your Majesty, why are you here?”<br/><br/>Zhao Yi stared at the woman in front of him, who was as gentle as water and couldn’t hide the joy in her eyes. His heart softened.<br/><br/>The voice echoed in his mind again, reminding him, “Have you forgotten how she treated you?”<br/><br/>In an instant, his heart hardened. He replied coldly, “I haven’t attended the court for a long time. I wanted to see what it has turned into.”<br/><br/>Finishing his words, seeing the startled look on the Empress’s face, he felt a sense of delight.<br/><br/>Zhao Yi sat on the dragon chair, his gaze sweeping over the courtiers below him.<br/><br/>“Greetings, your Majesty, may your reign last forever!”<br/><br/>One of the princes was sharp and was the first to kneel down.<br/><br/>In an instant, everyone in the Great Hall knelt down.<br/><br/>Zhao Yi watched this familiar yet strange scene, everyone bowing down to him, he could determine their life or death with a word.<br/><br/>This supreme power was only more appealing and intoxicating once he lost it.<br/><br/>“Rise.”<br/><br/>With a wave of his hand, the courtiers stood up.<br/><br/>“Carry on.”<br/><br/>After Zhao Yi finished speaking, the courtier who was just reporting to him looked at the Empress for a reaction. Zhao Yi was furious at this, but his face remained impassive.<br/><br/>With the Empress’s indication, the minister continued his report.<br/><br/>However, the atmosphere in the Great Hall was completely different from before.<br/><br/>The dozens of courtiers present had different feelings about the Emperor’s appearance.<br/><br/>Those who were overjoyed were in favour of the Emperor.<br/><br/>Those who feared were staunch opponents.<br/><br/>Those who were both shocked and delighted were supporters for several princes.<br/><br/>The Emperor’s appearance completely disturbed the balance of the court of Great Zhou.<br/><br/>On the other side, Gu Yang and the master of Dao Sect, Wen Jue, led by two palace eunuchs, arrived at Taiji Palace only to find it empty.<br/><br/>The eunuch told them that the Emperor had gone to Chengtian Palace to hold court.<br/><br/>“It must be him!”<br/><br/>Wen Jue, who had been silent, sniffed the air, detecting a particular scent. A killing intent appeared in her eyes.<br/><br/>The Heavenly Extreme Taoist was the biggest traitor of the Dao Sect. Because of him, the Dao Sect almost met its doom.<br/><br/>Wen Jue’s master was killed by the Heavenly Extreme Taoist.<br/><br/>Gu Yang asked, “Do you have any assurance, Elder?”<br/><br/>“Do all that human can, leave the result to fate.”<br/><br/>Well, that’s to say, she didn’t have much confidence.<br/><br/>The home-field advantage of the imperial palace was too great. Even a peak expert of the Unleaking Realm like Wen Jue couldn’t unleash much of her power under its pressure.<br/><br/>“Let’s go.”<br/><br/>As Wen Jue was about to leave.<br/><br/>“Wait.”<br/><br/>Gu Yang stopped her. He entered the palace, found a basement, where Jiao Shumo, who was on his last breath, was detained.<br/><br/>“You sure have a hard life.”<br/><br/>He sighed.<br/><br/>After sensing Jiao Shumo’s existence, he connected the dots.<br/><br/>Clearly, Jiao Shumo must have been overtaken by a part of the Heavenly Extreme Taoist, which is why his Cultivation Level made such rapid progress.<br/><br/>Then, he came to the Divine City, got attracted by the scent emitted from the Emperor, and tried to steal his Heavenly Extreme Divine Power but only ended up facilitating him instead.<br/><br/>That is to say, the Emperor now had at least two parts of the Heavenly Extreme Taoist’s remaining power. No wonder he was so strong.<br/><br/>However, it was amazing that Jiao Shumo could still be alive right now. He was indeed blessed with extraordinary luck.<br/><br/>Jiao Shumo, who had been trapped for over a month, looked up when he heard noise, saw it was Gu Yang, his last bit of spirit revived, “Save… save… me…”<br/><br/>Gu Yang took out his water pouch and some rations and threw them down to him, saying, “Take care.”<br/><br/>Having said that, he turned and left.<br/><br/>PS: Seeking votes on the last day of March.\t\t\t\t\t\t</div>", "images": {}, "success": true}