{"id": 215, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132031.html", "title": "Chapter 215 - Chapter 215: 215 She Can’T", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 215 - Chapter 215: 215 She Can’T</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 215: 215 She can’t<br/><br/>Translator: 549690339<br/><br/>Early in the morning, as the gates of the Divine City just opened, a caravan entered the city.<br/><br/>In the last horse-drawn carriage, a man in grey yawned, grabbed his side sword, and disembarked from the carriage.<br/><br/>“Finally back.”<br/><br/>A piece of grass clung to the corner of his mouth. He gazed at the street before him, his eyes carrying a hint of nostalgia.<br/><br/>The man wandered off along the road and quickly disappeared into the crowd.<br/><br/>The people in the caravan didn’t even notice his departure.<br/><br/>Guangxing Tower, a renowned tavern in the Divine City.<br/><br/>Gu Yunfei was on the second floor’s private room, dining and chatting with a few friends.<br/><br/>“I heard Gu Yang has had another breakthrough, he is now at the third level of Golden Body.”<br/><br/>“Really?”<br/><br/>“Of course, it’s true. My grandfather told me himself. Last night, the whole Divine City felt his Divine Power Realm.”<br/><br/>The topic was still revolving around that man.<br/><br/>His victory against Lin Ruo Xi, who was at the third level of Golden Body even though he was only at the second level, was still hot news. Now, there was even more explosive news.<br/><br/>The friends were amazed at the rapid progress of that man.<br/><br/>“It’s only been a few days, and he’s already at the third level of the Golden Body.”<br/><br/>“They always say Ye Ling Bo of the literature institute is a reincarnation of an ancient power, but I think, this man is more of a celestial immortal. To cultivate at such speed, how could it be possible for a human?”<br/><br/>“Yes, at this rate, I wouldn’t be surprised if he reached the level of Celestial Being soon.”<br/><br/>Gu Yunfei listened to his friends’ discussion, without any ripples in his heart, instead, he felt like laughing a little.<br/><br/>He remembered two months ago, they were discussing about that man here, they were dissatisfied and disgruntled.<br/><br/>Now, everyone had accepted it, their tone only held amazement.<br/><br/>That man had already reached a height that they could not touch in just two months.<br/><br/>So high that they couldn’t even feel jealous.<br/><br/>Indeed, Gu Yunfei himself was the same.<br/><br/>Yesterday, he heard about Gu Yang’s breakthrough from an elder. Other than an exclamation, he had no other thoughts.<br/><br/>Gu Yunfei sat by the window, looking at the pedestrians outside, wondering with his qualifications, could he reach the third level of the Golden Body in this lifetime?<br/><br/>While thinking, he caught a glimpse of a somewhat familiar figure.<br/><br/>“Huh?”<br/><br/>As if sensing his gaze, the figure turned his head.<br/><br/>As their eyes met, the man smiled faintly and quickly disappeared into the crowd without slowing his pace.<br/><br/>Gu Yunfei, however, was suddenly taken aback, “It’s him!”<br/><br/>This man has returned to the Divine City!<br/><br/>“Brother Yunfei, what’s the matter?” one of them noticed Gu Yunfei’s unusual expression and asked him.<br/><br/>“I just remembered that I have something to attend to at home. I will take my leave first.”<br/><br/>Gu Yunfei hurriedly got up and left.<br/><br/>The return of that man to the Divine City was a big deal. He had to get back home and inform his father so they could react accordingly.<br/><br/>The man’s name was Pan Chen, the maternal uncle of the late Emperor, and thus the great-uncle of the current princes.<br/><br/>Over twenty years ago, after breaking through to the Mana Realm, he left the Divine City to cultivate in a secluded place.<br/><br/>Now that he was back at this crucial juncture, breaking the rule that those who had reached the Mana Realm would not step into Divine Power, regardless of his purpose, it meant that the Divine City was about to face another upheaval.<br/><br/>There were rumors that the Emperor, struggling with his ailing body, had forcibly activated the array mechanism in the palace when Princess Chang was in danger—his health deteriorated further as a result.<br/><br/>At this time, Pan Chen’s return to the Divine City seemed to be a message to support the princes.<br/><br/>Any excess caution isn’t unjustified in the matters related to the throne.<br/><br/>Pan Chen is the most outstanding person in the Pan family for the past two hundred years. He was once at the top of the Tianjiao ranking, entering the Divine Power Realm at age thirty.<br/><br/>Not even fifty, he had already broken through to the Mana Realm.<br/><br/>Such a rate of progression warranted him to be called an unparalleled genius. His future in attaining the Unleaking Realm was promising.<br/><br/>Such a character, nobody could ignore his existence.<br/><br/>After returning to Divine City, Pan Chen did not return to the Pan household, nor did he go to see the princes. He went straight to the palace.<br/><br/>“Halt!”<br/><br/>Before he could walk closer to the palace gate, a sentry shouted sternly.<br/><br/>He didn’t speak, just pulled out a token.<br/><br/>The faces of the guards changed immediately, ensuring there was no mistake, they let him pass, not even removing the knife from his body.<br/><br/>Pan Chen entered the palace, unaffected by the energy field.<br/><br/>That was the function of the token, a magical tool bestowed by the emperor. Once refined, it allowed free passage into the palace, unaffected by the power of the big array.<br/><br/>Such a token could only be used once. Once refined, if someone else’s True Essence was injected into it, it would self-destruct.<br/><br/>The method of making these tokens had long been lost.<br/><br/>This one was the last one hidden in the inner treasury, obtained from the treasury of the previous dynasty.<br/><br/>The fact that the emperor had given such a token to Pan Chen showed how much he trusted him.<br/><br/>Soon, Pan Chen arrived in the Taiji Palace and saw the current emperor whose body still appeared weak with a pale complexion, but looked better than before.<br/><br/>At a glance, Pan Chen could tell that his health was much improved. Although he was still somewhat weak, he was no longer bedridden as before.<br/><br/>He said, “Congratulations on your recovery, Your Majesty.”<br/><br/>A slight smile came across the emperor’s face, “Now that you’re back, I can rest assured.”<br/><br/>“What do you require of me, Your Majesty?”<br/><br/>“I haven’t been at court for a long time, so long that many ministers have almost forgotten my existence.” The Emperor sat on the dragon chair, his vitality still somewhat insufficient.<br/><br/>“Tomorrow, accompany me to court.”<br/><br/>Pan Chen immediately understood and replied, “Yes.”<br/><br/>For these years, although he had been in seclusion, every once in a while, he was able to receive news from his family and had a sense of the government’s affairs.<br/><br/>Previously, due to the ill health of the emperor, he was obliged to entrust the government to that woman.<br/><br/>Now that his health was greatly improved and it was appropriate to take back the power, he had summoned him back to prevent any mishaps.<br/><br/>Having understood, Pan Chen excused himself.<br/><br/>After Pan Chen left, the emperor watched his retreating figure, as if talking to himself, “What about him?”<br/><br/>“Training in the ‘Heavenly Light Divine Skill’, mana pure, a great supplement.” A voice that was drooling with anticipation rang in his mind.<br/><br/>The emperor mumbled, “That’s a realm of mana, can you do it?”<br/><br/>“If you want to be sure to succeed, you have to start with your closest kin. Blood ties are the only way to ignore the gap between realms. Make a one-hit success, such as, your sister.”<br/><br/>Struggle flashed across the emperor’s eyes, “No, not her.”<br/><br/>“Then, it could only be your son….”<br/><br/>The emperor let out a painful roar, “No”<br/><br/>In the empty palace, a beast-like gasp echoed.<br/><br/>In Tianxin Martial Arts Hall, Gu Yang sat cross-legged on the bed, continuously injecting his True Essence into the Phoenix Feather Knife.<br/><br/>The Phoenix Feather Knife regained its edge after the seal was removed, finally restoring the sharpness of this peerless divine weapon.<br/><br/>However, he was far from unleashing the true power of this divine weapon.<br/><br/>This was a magical treasure. It wasn’t something that could be fully refined in a short period of time.<br/><br/>In the past, his cultivation level was too low, and the progress was less than one-tenth after a month in the Water Moon Cave Sky.<br/><br/>Now, after his breakthrough, his strength had greatly improved, and the refinement progress had sped up.<br/><br/>He who wants to do a good job, must first sharpen his tools.<br/><br/>Weapons were very important. Before the big fight, Gu Yang would try to refine as much as he could.<br/><br/>Before he knew it, a day and night had passed.<br/><br/>Gu Yang finally retracted his True Essence, looking at the Phoenix Feather Knife in his hand, about 30% of it had been refined. When used, the power should be able to be increased by a few percentages.<br/><br/>“Time’s up.”<br/><br/>Suddenly, the voice of Miss Su Er rang in his ears.<br/><br/>He sheathed the Phoenix Feather Knife, stood up, changed into a guard’s outfit, and left the room.<br/><br/>He quietly left the Tianxin Martial Arts Hall without disturbing anyone.<br/><br/>Outside, he saw Wen Jue, the headmaster of the Dao Sect, who had also changed into a palace maid’s outfit.<br/><br/>Gu Yang almost didn’t recognize her. After a change of clothes, her temperament completely changed. Just like a normal palace maid, there were no flaws to be seen.<br/><br/>He couldn’t help but give her a thumbs up, silently praising her professionalism.<br/><br/>The palace could be described as a dragon’s lair or tiger’s den, with three in the Unleaking Realm, an unknown number in the Mana Realm, plus the strength of the field within the palace which repressed their True Essence.<br/><br/>This fight was going to be tough.<br/><br/>He held the Phoenix Feather Knife tightly in his hand as if it were connected by blood. With determination in his heart, he said, “Let’s go.”\t\t\t\t\t\t</div>", "images": {}, "success": true}