{"id": 225, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132052.html", "title": "Chapter 225 - Chapter 225: Chapter 225: Refining The Soul", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 225 - Chapter 225: Chapter 225: Refining The Soul</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 225: Chapter 225: Refining the Soul<br/><br/>Translator: 549690339<br/><br/>No matter the reason, the plan to cultivate in this Cave Heaven was apparently a bust.<br/><br/>Gu Yang could only think of other ways and seemed to be left with only one choice.<br/><br/>He opened the system and once again initiated the simulation.<br/><br/>[Twenty-two years old…]<br/><br/>[You, along with Xi Huang, go to Tianzhu Mountain and enter the Secret Realm to meet up with Su Qingzhen and others. There, you devote yourselves to diligent cultivation.]<br/><br/>[You cultivate the first layer of the “Divine Dragon Manual” from the “Nine Heavens Divine Method”.]<br/><br/>[Five years later, Xi Huang fully recovers her cultivation level.]<br/><br/>[Another five years, Xi Huang reaches the triple peak of her Mana. One day, the Secret Realm suddenly collapses. You all leave the Secret Realm, and a giant skull appears in the sky.]<br/><br/>[Xi Huang steps forward, intercepts the other party, giving you all the chance to escape.]<br/><br/>[You flee to the Divine City. Five years later, Qin Wu mobilizes troops to attack Zhou, fighting all the way to the outskirts of Divine City. Luo Wang steps forward. Celestials wage war, accidentally breaking the ancient prohibition, leading to a large-scale invasion by the Star Luo Sect.]<br/><br/>[In the chaos of battle, a large hand appears behind you, dragging you into eternal darkness. You die at the age of thirty-seven.]<br/><br/>Huh?<br/><br/>That’s not right.<br/><br/>Gu Yang remembers that in the last simulation, he also took Xi Huang to the Secret Realm of Tianzhu Mountain, but there was no notification of her fully recovering her cultivation level.<br/><br/>This time, however, she suddenly advanced to the triple peak of her Mana all at once, blocking even that Celestial of the Red Dawn World, which allowed him to escape with his life.<br/><br/>“Could it be that she gained something in this mansion?”<br/><br/>As he was thinking this, he sensed a strange fluctuation outside, and Xi Huang’s aura vanished into thin air.<br/><br/>Gu Yang’s figure flashed, carrying him outside the courtyard to the spot where Xi Huang stood just now.<br/><br/>“Seems like it’s a prohibition.”<br/><br/>Just like the one in the Gu family mansion that imprisoned Xi Huang, once activated, one would be teleported away.<br/><br/>Gu Yang observed for a while, but didn’t find anything.<br/><br/>“This should be a kind of opportunity for her.”<br/><br/>Thinking this, he returns to his room.<br/><br/>[Simulation completed, you can retain one of the following items.]<br/><br/>[One, Martial Arts realm at the age of 37.]<br/><br/>[Two, Martial Arts experience at the age of 37.]<br/><br/>[Three, life wisdom at the age of 37.]<br/><br/>“I choose one.”<br/><br/>Suddenly, Gu Yang’s True Essence began to surge.<br/><br/>In another courtyard within the mansion.<br/><br/>Luo Yulong was looking at a piece of information. It was sent by Luo Tiancheng and contained information about Gu Yang.<br/><br/>The more he read, the more puzzled he was. He thought to himself, was Tiancheng just trying to make fun of him?<br/><br/>The information listed was truly too absurd.<br/><br/>It wrote that, half a year ago, Gu Yang only had fourth-tier cultivation.<br/><br/>This was absolutely ridiculous.<br/><br/>In half a year, from the fourth tier to the third level of the Golden Body.<br/><br/>Could this Gu Yang be a reincarnated Immortal from ancient times?<br/><br/>Just at this moment, Luo Yulong’s face changed drastically, he abruptly turned his head to look in the direction of Gu Yang’s residence, his expression becoming extremely colourful.<br/><br/>Could it really be a reincarnated ancient Immortal?<br/><br/>He unconsciously swallowed his saliva with a gulp.<br/><br/>The “Divine Dragon Manual” is based on the divine Azure Dragon.<br/><br/>As of now, the four legendary creatures—Vermilion Bird, White Tiger, Azure Dragon, Black Tortoise—are all gathered.<br/><br/>From that jade seal of the monarchy, Gu Yang has already obtained the general outline of the “Nine Heavens Divine Method”.<br/><br/>Finally, he knows how to control the power of the nine great divine beasts with one person’s strength.<br/><br/>Simply put, it’s about transforming the power of these nine divine beasts into external bodies of his own.<br/><br/>Generally, practicing to manifest external bodies requires several rare divine items, like the Chi Pearl that Su Ningyan used.<br/><br/>The “Nine Heavens Divine Method” takes an ingenious approach using the essence blood of divine beasts as the core. Once the method is cultivated to the sixth layer and forms a Nascent Soul, one can refine it into an external body.<br/><br/>Of course, this places extremely high demands on the practitioner’s Original Spirit.<br/><br/>The stronger the Original Spirit, the more external bodies one can control.<br/><br/>If one tries to cultivate multiple methods without a sufficiently powerful Original Spirit, the final consequence is that the divine beast bodies would become uncontrollable and may even bite back.<br/><br/>The general outline of the “Nine Heavens Divine Method” is divided into two chapters.<br/><br/>The “God Refining Chapter” for strengthening the Original Spirit.<br/><br/>And the “Deity Commanding Chapter” which is for controlling the divine beast avatars.<br/><br/>The content of the “God Refining Chapter” is not particularly difficult, but it clearly states that there is no shortcut to strengthening the Original Spirit.<br/><br/>The level of one’s talent does not affect the speed of cultivation, which remains extremely slow regardless and requires a long period of accumulation.<br/><br/>Approximately ten years is needed to form one external body.<br/><br/>Another twenty years for the second one.<br/><br/>Forty years for the third one.<br/><br/>Which is to say, the more external bodies one wants to form, the more time one needs to spend.<br/><br/>So, in order to condense nine external bodies, one needs over 5000 years of time.<br/><br/>Five thousand years is enough to cultivate an entire civilization.<br/><br/>For others, this number was beyond reach.<br/><br/>Even in the Unleaking realm, one would only have a lifespan of a little over a thousand years.<br/><br/>Even at the Celestial Being realm, one may still not live that long.<br/><br/>But Gu Yang had a simulator.<br/><br/>This technique was tailor-made for him.<br/><br/>As long as he continuously simulated, he would eventually be able to practice the “God Refining Chapter” to the ninth level.<br/><br/>In this simulation, Gu Yang’s “God Refining Chapter” had reached the first level.<br/><br/>And his “Divine Phoenix Manual,” was not far from the sixth level, condensing the nascent soul.<br/><br/>For the other four manuals, the progress of “Divine Ape Technique,” “Divine Tiger Manual,” and “Divine Turtle Manual” was at the fourth level. Only the “Divine Dragon Manual” was just practiced and still at the first level.<br/><br/>“Again!”<br/><br/>Gu Yang started the simulator again.<br/><br/>He performed nine simulations in one breath.<br/><br/>This time, he did not act impulsively like last time and left ten energy cells for emergency.<br/><br/>From the nine simulations, he gained immensely.<br/><br/>His cultivation level was close to the peak of the third level of the Golden Body.<br/><br/>The “Divine Ape Technique,” “Divine Tiger Manual,” and “Divine Turtle Manual” all broke through to the fourth level.<br/><br/>The “Divine Dragon Manual” reached the third level.<br/><br/>And the “God Refining Chapter” also broke through to the fourth level.<br/><br/>This meant that the strength of his Original Spirit was more than four times stronger than before.<br/><br/>“I’m too strong!”<br/><br/>Gu Yang felt a surge of unprecedented power within him, greatly increasing his sense of security.<br/><br/>On the other side, Luo Yulong was sitting there, sweat rolling down his forehead, his expression stunned.<br/><br/>Ten times!<br/><br/>A full ten times!<br/><br/>Is this still a human?<br/><br/>After who knows how long.<br/><br/>Knock Knock.<br/><br/>There was a knock from outside, a voice requested, “Ancestor, Tiancheng requests to see you.”<br/><br/>Luo Yulong finally woke from his trance and said, “Enter.”<br/><br/>“We just received the latest intelligence from Divine City, about Gu…”<br/><br/>“Shut up.”<br/><br/>Seeing him about to mention that name, Luo Yulong was so shocked that he almost jumped up, and sternly ordered.<br/><br/>Luo Tiancheng was taken aback, “An…Ancestor?”<br/><br/>“Hand it over.”<br/><br/>Luo Yulong also realized that his reaction was overly intense, but unwilling to explain, he took the intelligence and dismissed the person.<br/><br/>Opening the paper, he saw the words written on it, “Slayed the King in the Palace, suspected to be involved with the Queen…”<br/><br/>His eyelid twitched.<br/><br/>Killing a king within the palace!<br/><br/>This is something that even Wu Da from the past could not do.<br/><br/>Too terrifying.<br/><br/>In his heart, he began to harbor a deep sense of fear towards this man whose cultivation level was below his own.<br/><br/>Unknowingly, it was already evening.<br/><br/>Gu Yang was still meditating, familiarizing himself with his skyrocketing cultivation level.<br/><br/>Suddenly, he opened his eyes.<br/><br/>Xi Huang was back!<br/><br/>As she walked through the door, she looked different, not as weak as before.<br/><br/>She was now bursting with vitality.<br/><br/>However, her face still had traces of tears.<br/><br/>Gu Yang asked in concern, “Are you alright?”<br/><br/>Xi Huang’s eyes turned red automatically, “It’s the treasured legacy that my mother left behind, the drop of essence blood you gave her.”<br/><br/>So that’s what it was.<br/><br/>Gu Yang didn’t want to continue this topic, and said, “Rest well, we have things to do tomorrow.”<br/><br/>The next morning, Gu Yang and Xi Huang left Jade Luo Mansion and set off for Tianfang Mountain.<br/><br/>Tianfang Mountain was only a hundred kilometers away. The two of them flew over and arrived quickly.<br/><br/>Xi Huang led the way to a valley in the mountain and said, “This is the place.”<br/><br/>Gu Yang took out two talismans, handed one to her, and reminded, “The pocket dimension here is very dangerous. No matter what you see later, do not attack recklessly.”<br/><br/>Seeing him speak so solemnly, Xi Huang quickly nodded.<br/><br/>Gu Yang took out the crystal pendant, holding her hand, he infused it with his True Essence.<br/><br/>An invisible force burst from the pendant, pulling him into another space.<br/><br/>The two of them just vanished into thin air.\t\t\t\t\t\t</div>", "images": {}, "success": true}