{"id": 223, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132047.html", "title": "Chapter 223 - Chapter 223: 223 Mana Slash (Third Update, Requesting Monthly Ticket)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 223 - Chapter 223: 223 Mana Slash (Third Update, Requesting Monthly Ticket)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 223: 223 Mana Slash (Third update, requesting monthly ticket)<br/><br/>Translator: 549690339<br/><br/>Wu Er moved at a speed that was not inferior to the three Divine Power Realm experts in the sky.<br/><br/>However, he had lost the ability to fly and could only helplessly watch from afar. He couldn’t assist them and could only worry on the sidelines.<br/><br/>Nevertheless, he was once a practitioner of the Unleaking Realm, and his Divine Power to perceive everything was still intact. He could see what was happening above and hear their conversation.<br/><br/>“All this for a divine weapon?”<br/><br/>Wu Er felt a sense of absurdity. Had this kid lost his mind due to poverty?<br/><br/>In terms of divine weapons, the Wu Family was not lacking. If there was anything abundant within their Saber Tomb, it was divine weapons.<br/><br/>Because of this, he never thought divine weapons were particularly valuable.<br/><br/>He simply couldn’t understand why Gu Yang would risk himself for a single divine weapon.<br/><br/>At that moment, a Mana Realm corpse charged towards Gu Yang, which made Wu Er break out in cold sweat.<br/><br/>“Something’s not right!”<br/><br/>Wu Er, after all, used to be an expert of the Unleaking Realm. His keen insights quickly noticed something amiss, “Why is his True Essence so strong?”<br/><br/>There’s a huge gap between the Mana Realm and the Golden Body Realm.<br/><br/>This gap was called Mana!<br/><br/>In the Golden Body Realm, they still cultivated True Essence in their bodies.<br/><br/>Once they reached the Mana Realm, True Essence is transformed into Mana, marking a qualitative change.<br/><br/>If the True Essence of the Golden Body Realm could melt iron, then the Mana of the Mana Realm could pulverize a lump of iron. The difference in power is more than tenfold.<br/><br/>Furthermore, the Mana of the Mana Realm possess a certain level of spirituality. On some level, they can manipulate elements, performing miracles only heard of in legends.<br/><br/>The difference between the Golden Body Realm and the Mana Realm is akin to the difference between the Golden Body Realm and a Mortal Realm martial artist.<br/><br/>The difference is that practitioners of the Golden Body Realm possess an almost indestructible body. Purely relying on Mana, it is not easy to kill a Golden Body Realm practitioner.<br/><br/>However, there are always exceptions.<br/><br/>If encountered with an outstanding Divine Weapon, even the most formidable Golden Body could not withstand it.<br/><br/>There was also the Nether Sect where their deadly Necrotic Energy was overly toxic and corrosive that it could even corrode a Golden Body.<br/><br/>Among the Divine Power practitioners, what they feared most about the Nether Sect is precisely this.<br/><br/>At this time, however, Wu Er observed that Gu Yang’s True Essence also possessed a spirituality similar to Mana.<br/><br/>“He is clearly not in the Mana Realm, so why …”<br/><br/>In the sky, a blaze of fire erupted, causing his eyes to sting. He instantly became blind.<br/><br/>All he could sense was a destructive aura descending from the sky.<br/><br/>Skyfire Annihilation!<br/><br/>The might of Gu Yang’s attack was at least ten fold or a hundred fold stronger than before. He finally revealed a hint of world-destroying power, even breaking Wu Er’s Divine Perception.<br/><br/>Wu Er gasped for breath.<br/><br/>In the next moment, he saw a corpse fall from the sky.<br/><br/>He had a blank look on his face, his mouth slightly opened, muttering, “Impressive kid …”<br/><br/>Killing a Mana Realm zombie with a single slash, has this kid’s power reached such a level?<br/><br/>“Are you Gu Yang?”<br/><br/>Ding Fei felt the destructive flame at close range. His Mana seemed to sense an arch-nemesis, making him feel a chill running down the spine.<br/><br/>He was taken aback and finally realized that the Third-level Golden Body Realm youngster before him was his long-awaited target —— Gu Yang.<br/><br/>However, this kid’s strength far exceeded his imagination.<br/><br/>He was only at the Third-level Golden Body Realm, so how could he be so powerful?<br/><br/>Even he himself couldn’t kill a zombie with a single strike.<br/><br/>“Extraordinary divine weapon!”<br/><br/>Ding Fei noticed the saber in Gu Yang’s hand and suddenly understood, cursing inwardly.<br/><br/>Why didn’t anyone tell him that Gu Yang possessed an extraordinary divine weapon?<br/><br/>“It’s your turn now!”<br/><br/>Gu Yang turned to Ding Fei, his gaze cold. He raised the Phoenix Feather Knife, using the saber technique he just learned from his last simulation.<br/><br/>There was a loud boom.<br/><br/>In the sky, there was a startling thunderclap.<br/><br/>Third move of the “Six Annihilations”, Silence of Heaven and Earth!<br/><br/>When the Phoenix Feather Knife fell, it seemed to infuriate the entire world. Ground dragons whirled, and thunderbolts fell from the sky.<br/><br/>Locked onto by this force, Ding Fei felt alarm bells ringing in his heart. At this moment, he felt the threat of death.<br/><br/>“Escape!”<br/><br/>He didn’t hesitate and turned to flee.<br/><br/>However, he was horrified to discover that his Mana was rapidly draining away.<br/><br/>Once the Mana left his body, it would vanish without a trace.<br/><br/>In the blink of an eye, he had already lost a third of his Mana.<br/><br/>Shocked, Ding Fei hastily retracted his Mana. He instantly lost the ability to hover in the air and began to fall.<br/><br/>In the blink of an eye, Gu Yang’s blade had already reached the top of his head.<br/><br/>Ding Fei was terrified out of his wits, mana surging wildly within his body, attempting to resist that fatal strike, as he screamed, “Please, mercy”<br/><br/>Swish!<br/><br/>The Phoenix Feather Knife cut through his thick, ink-like mana, and sliced him in half.<br/><br/>The Mana/cultivator, fallen!<br/><br/>“Wha”<br/><br/>As Gu Yang made his move, Luo Yulong seized the opportunity to accelerate, escaping far away. It wasn’t until a peculiar fluctuation attacked him from behind, which quickened his mana consumption several times, that he realized something was amiss.<br/><br/>Turned his head to look back.<br/><br/>With a mere glance, he was dumbfounded.<br/><br/>He saw the youngster who had just achieved the third stage Golden Body Realm, striking down the nether sect’s strongman who had been chasing him to the ends of the earth, with just one stroke.<br/><br/>How could this be possible?<br/><br/>Luo Yulong felt an intense surrealism, even suspecting that he might be hallucinating.<br/><br/>A Golden Body cutting down a Mana practitioner?<br/><br/>His mind was in a whirl of confusion.<br/><br/>At that moment, the young man glanced at him, that gaze sent a chill down his spine.<br/><br/>“Where do you think you’re going?”<br/><br/>This question caused a chill to rush from Luo Yulong’s back straight to his brain. He forced a stiff smile onto his face, “Tha… thank you for saving me. I have no way to repay you, but would like to present you with this divine sword that I carry with me.”<br/><br/>At this critical moment, he finally remembered the promise he made earlier and hastily tossed his sword over.<br/><br/>Although this sword had been with him for over a hundred years, what did it matter compared to his life?<br/><br/>At this moment, he suddenly felt that this world was so unfamiliar.<br/><br/>How could Great Zhou change so much while he was simply in seclusion for a few decades?<br/><br/>First, the Nether Sect ruthlessly hunted him down.<br/><br/>Then, this sort of monster appeared.<br/><br/>If being in the Golden Body Realm and killing a Mana practitioner doesn’t make someone a monster, what does?<br/><br/>“No, I must hurry to those ruins and retrieve that unparalleled divine weapon. Then, I’ll return home and seclude myself until I break through to the Longevity Realm. I cannot afford to leave seclusion until then.”<br/><br/>Luo Yulong had made up his mind.<br/><br/>At that moment, the young man asked, “May I ask your name, sir?”<br/><br/>“I am Luo Yulong.”<br/><br/>The young man’s eyes lit up, “Are you from the Luo Family in Qi Province?”<br/><br/>For some reason, Luo Yulong had a bad premonition, but he had no choice but to respond, “Indeed, I am.”<br/><br/>The young man then smiled, “I’ve long heard of the Luo Family’s reputation. It’s a pleasure meeting you. Since we’ve hit it off so well, why not invite me to the Luo Family for a get-together?”<br/><br/>“Huh?”<br/><br/>Can this really be happening?<br/><br/>In the sky, three figures were flying towards the Qi Province.<br/><br/>The three were none other than Gu Yang, Xi Huang, and Luo Yulong.<br/><br/>As for Wu Er, he had disappeared earlier.<br/><br/>Wu Er had always been elusive, so Gu Yang didn’t need to worry about him. Taking Xi Huang along, they travelled in a carriage, following Luo Yulong, heading towards Qi Province.<br/><br/>With Luo Yulong, a local, leading the way, they had no obstructions on the way to Qi province.<br/><br/>By the time they arrived, they could naturally enter that secluded world without anyone noticing.<br/><br/>Gu Yang couldn’t help but praise his own cleverness.<br/><br/>Meanwhile, Luo Yulong was feeling uncomfortable.<br/><br/>Gu Yang took the initiative to suggest that he should invite him to his home. This was the first time Luo Yulong had ever encountered such a thing.<br/><br/>The key was, Luo Yulong felt extremely reluctant in his heart, but he did not dare to refuse.<br/><br/>That strike was horrifying.<br/><br/>Gu Yang managed to kill the nether sect’s powerhouse with a single stroke, Luo Yulong didn’t believe he could withstand such a blow himself.<br/><br/>The six-stage divine power was terrifying indeed.<br/><br/>Who exactly was this young man?<br/><br/>Daring to ask, Luo Yulong asked, “May I ask your name, sir?”<br/><br/>“Gu Yang.”<br/><br/>The surname Gu, and wielding the Phoenix Feather Knife.<br/><br/>The Gu family of Divine City actually produced such a terrifying figure.<br/><br/>Luo Yulong immediately misunderstood. After he came out of seclusion, his mind was set on retrieving the divine weapon from the ruins. He chose to travel through remote areas and had not heard of Gu Yang’s fame.<br/><br/>PS: Alright, the third chapter, asking for monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}