{"id": 226, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132054.html", "title": "Chapter 226 - Chapter 226: 226 Yellow Springs Cave Heaven (Third Update, Requesting Monthly Ticket)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 226 - Chapter 226: 226 Yellow Springs Cave Heaven (Third Update, Requesting Monthly Ticket)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 226: 226 Yellow Springs Cave Heaven (Third update, requesting monthly ticket)<br/><br/>Translator: 549690339<br/><br/>Yellow Springs Heavenly Cave!<br/><br/>Hundreds of miles away from Muhuang City, outside the Hei Ming Valley.<br/><br/>The sky was gloomy, shrouding the entire valley in a layer of haze.<br/><br/>The surrounding area was eerily quiet, akin to a land of the dead.<br/><br/>A man in a gray robe was crawling on the ground, inch by inch.<br/><br/>He was very careful, afraid to make the slightest sound.<br/><br/>Suddenly, a gust of wind blew by, chilling to the bone. A whistling sound was heard as it passed the valley, extremely eerie.<br/><br/>The man lay there, not daring to move. Big beads of sweat formed on his forehead.<br/><br/>After a while, the whistling wind finally stopped.<br/><br/>He breathed a sigh of relief and continued to move forward.<br/><br/>After a while, he crawled to a plant.<br/><br/>“Moon Heart Grass, medium level of contamination!”<br/><br/>Excitement gleamed in his eyes.<br/><br/>This Moon Heart Grass, if taken to the Herb Hall, could be exchanged for at least ten low-grade Spirit Stones.<br/><br/>Indeed, only a place like Hei Ming Valley can still have such valuable spiritual plants.<br/><br/>The forest within a hundred miles of Muhuang City had long been scavenged by people.<br/><br/>With ten low-grade Spirit Stones, he can gather the materials and attempt to draw a spirit talisman.<br/><br/>Once successful in producing the spirit talisman, he could make a living by selling them, no need to venture into the wild risking his life anymore.<br/><br/>The man was named Wei Hu, a resident of Muhuang City, with a cultivation level of the eighth stage of Qi Refining.<br/><br/>His father was a fairly well-known talisman maker who ventured out of the city to find some materials a year ago but never returned.<br/><br/>After his father disappeared, he, as the eldest son, had to bear the burdens of the family.<br/><br/>“I must hurry up.”<br/><br/>Wei Hu touched the camouflage talisman in his bosom. It could maintain for a maximum of five hours. Before that, he must return to the city. Otherwise, he would undoubtedly die.<br/><br/>He took out a small hoe and carefully dug up the soil.<br/><br/>He dug slowly, careful not to damage the roots underneath.<br/><br/>The more intact the root system of Moon Heart Grass, the more valuable it is.<br/><br/>After half an hour, he finally managed to uproot the Moon Heart Grass intact.<br/><br/>Wei Hu took out a wooden box, put the Moon Heart Grass in it, and as he raised his head, the smile on his face froze.<br/><br/>Right in front of him, a human head was floating in midair, leisurely flying towards him.<br/><br/>The head was slowly rotating, exposing a crying face.<br/><br/>“Golden Core level!”<br/><br/>Upon seeing that the floating head was the size of a washbasin, Wei Hu’s mind buzzed and for a moment, he felt chilled to the bone.<br/><br/>The camouflage talisman on him couldn’t deceive the Golden Core level strange creature.<br/><br/>Suddenly, the crying face stopped, turned slowly towards him, stopping its crying and staring straight at him.<br/><br/>It was over!<br/><br/>Wei Hu’s mind went blank.<br/><br/>Bang!<br/><br/>Just then, a figure descended from the sky, landing a foot on that floating head.<br/><br/>With a squelching sound, that Golden Core level strange thing burst open like foam and disappeared without a trace.<br/><br/>Wei Hu looked up in astonishment, seeing a man and a woman, immaculate in appearance, bearing an ethereal aura, just like immortals.<br/><br/>His mouth half open, his shocked expression was even more exaggerated than when he saw the strange creature.<br/><br/>Then the man spoke, “Hello, we have lost our way. Could you please guide us to the city?”<br/><br/>Wei Hu still had a dazed look on his face, and hadn’t heard a word he said.<br/><br/>The woman whispered, “Did he get scared silly?”<br/><br/>At this point, Wei Hu finally spoke, stuttering, “Are…are you immortals?”<br/><br/>Are there immortals in this world?<br/><br/>If asked before, Wei Hu would have scoffed at this question.<br/><br/>If there really were immortals in this world, why would they let the human realm become such a hell?<br/><br/>But now, he was shaken.<br/><br/>In his eyes, this pair of man and woman were just like the legendary immortals, completely without a trace of contamination.<br/><br/>You must know, even the guardian of Muhuang City, the Nascent Soul level Old Man Muhuang, had turned half his body into a monster under the contamination of the strange creature.<br/><br/>Now, he looked more like a demon rather than a cultivator.<br/><br/>The man in front of him was able to crush the Golden Core level strange creature with one foot. His cultivation level must be at least at the Nascent Soul level or above, yet he was not contaminated at all.<br/><br/>Other than immortals, he couldn’t find any other explanations.<br/><br/>Two hours later, they finally arrived back at Muhuang City.<br/><br/>Upon entering the city gates, Wei Hu presented his identity card to the guard for verification.<br/><br/>Pointing to the man and woman behind him, the guard asked, “And who are they?”<br/><br/>Quickly responding, Wei Hu said, “They are my father’s good friends. I vouch for them.”<br/><br/>The guard took out a bronze mirror and scanned both individuals. He exclaimed in surprise, “No pollution? Could the mirror be broken?”<br/><br/>As he turned the mirror towards Wei Hu, a thick black mist appeared on the mirror.<br/><br/>“Moderate pollution. It’s not broken,” he mumbled.<br/><br/>The guard cast a suspicious look at the pair.<br/><br/>In his long tenure as a city guard, he had never encountered anyone without any pollution. Even the most ordinary people without cultivation levels had at least slight pollution.<br/><br/>There was something fishy about these two.<br/><br/>If something is amiss, it is most likely evil!<br/><br/>Unable to make a decision, he promptly reported to his superiors.<br/><br/>Soon, the high-ranking officers of Muhuang City were alerted.<br/><br/>“What a nuisance.”<br/><br/>The man and woman who had descended from the sky to save Wei Hu were none other than Gu Yang and Xi Huang.<br/><br/>Upon entering this world, Gu Yang almost thought he had fallen into a cesspool.<br/><br/>The air was rife with a stench.<br/><br/>What was more terrifying was that the essence of heaven and earth here was toxic.<br/><br/>With one single breath, a strange poison started to corrode his true essence.<br/><br/>Although it was immediately incinerated by his true essence, being in such an environment gave him a strong sense of unease.<br/><br/>After this, he held his breath. He didn’t need to breathe at his current cultivation level. However, without breathing, his true essence consumption couldn’t be replenished. With each usage, he lost a little more.<br/><br/>Gu Yang finally understood why his cultivation level declined instead of improving after spending ten years here in the simulation.<br/><br/>Surviving such a horrifying place without being poisoned was already considered quite lucky.<br/><br/>“What on earth happened to this world?”<br/><br/>He found it hard to imagine what could’ve caused the world to become like this.<br/><br/>At that moment, he wanted to retreat.<br/><br/>Until he saw a Ghostly Being. It was truly bizarre.<br/><br/>He stomped on the Ghostly Being, terminated it with his true essence, and gained two units of energy.<br/><br/>Well, delightful!<br/><br/>What followed after was just a matter of course.<br/><br/>Gu Yang had the person who they saved lead them to the nearest city.<br/><br/>Interestingly, the language in this world was very similar to that of Great Zhou. They were essentially the same language.<br/><br/>But then, they were stopped at the city gate.<br/><br/>The reason was simple; they had no pollution. This was too abnormal.<br/><br/>As if two phoenixes had suddenly appeared among a flock of ordinary chickens, naturally attracting attention.<br/><br/>Soon, an old man enshrouded in a black robe appeared before them.<br/><br/>Upon seeing the man, Gu Yang almost drew his Phoenix Feather Knife to attack.<br/><br/>The chaotic and mad energy emanating from him nearly matched that of the Ghostly Beings,<br/><br/>The only difference was that he retained his sanity.<br/><br/>Was this fellow a human or a ghost?<br/><br/>Gu Yang was amazed that someone with such chaotic and mad energy could still be alive.<br/><br/>When the man caught sight of Gu Yang and Xi Huang, his eyes flickered with complex emotions. Suddenly, something poked out from under his robe.<br/><br/>With a ripping sound, his robe was torn apart. A green insect, as thick as a child’s arm and filled with sharp fangs in its mouth, appeared.<br/><br/>“Steward Han has lost control!”<br/><br/>Someone screamed out, causing people around to run in panic.<br/><br/>Gu Yang also drew his Phoenix Feather Knife, ready to fight.<br/><br/>But then he saw the man swing his blade and sever the green insect from his body. Greenish goo oozed from the wound, creating a hissing sound as it hit the ground, producing a large amount of smoke.<br/><br/>Opening his mouth, he spewed out a gust of fire, cauterizing the wound amidst the smell of burning flesh, finally stopping the goo from seeping out.<br/><br/>After doing all this, the old man acted nonchalantly and said, “I’ve certainly given you two a fright. Elder Mu wishes to meet with both of you, please follow me.”<br/><br/>Xi Huang instinctively took a step back. The scene had indeed given her a scare.<br/><br/>Gu Yang also felt his scalp tingling. Was this really not a demon?<br/><br/>“Please lead the way.”<br/><br/>PS: It’s the third update, asking for monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}