{"id": 228, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132057.html", "title": "Chapter 228 - Chapter 228: 228 He Can’T Die", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 228 - Chapter 228: 228 He Can’T Die</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 228: 228 He can’t die<br/><br/>Translator: 549690339<br/><br/>Huangmu City, City Lord Mansion.<br/><br/>In that empty grand hall, Daoist Muhuang was engrossed in the book he held in his hands.<br/><br/>After completing a page, he would lower his head, lick his tongue, and flip to the next page.<br/><br/>“Senior, the two of them have left the city,” suddenly, a faint voice of Steward Han sounded, “Six people followed them out, including Xue Yong and Zheng Mingxin.”<br/><br/>“Hmm.”<br/><br/>Daoist Muhuang responded, indicating his awareness, yet his eyes didn’t deviate from the book.<br/><br/>Steward Han reminded again, “Are we not going to intervene?”<br/><br/>“Are you worried about those two from Great Zhou? That doesn’t sound like you.”<br/><br/>After a long pause, Steward Han sighed, murmuring, “I almost forgot that I am a human, until I saw them. As I age, I can’t bear to see beautiful things getting destroyed.”<br/><br/>At last, Daoist Muhuang looked up and glanced at him, then comforted,” If you had maintained this frame of mind ten years ago, you would have a hope for reaching the Nascent Soul.”<br/><br/>Steward Han had long given up hope. His severe level of pollution could send him out-of-control anytime now.<br/><br/>Reaching the Nascent Soul stage was out of question, he wasn’t even certain how many days he could live.<br/><br/>He asked again, “Are we really not going to intervene?”<br/><br/>Daoist Muhuang sighed, “Since Luo Daoist friend was polluted, the grotesque creature he transformed into is about to awaken. At this time, Huangmu City cannot afford to lose much of its strength.”<br/><br/>Steward Han didn’t say anything further, silently exiting the place.<br/><br/>Daoist Muhuang looked in the direction of the city gate, his heart repeating two words, “Great Zhou—”<br/><br/>As Steward Han left the grand hall, beneath his black robe, a monstrous energy coiled crazily, as though countless creatures were about to fly out from within.<br/><br/>The guards nearby, seeing his state, immediately prepared for battle, surrounding him with magical tools.<br/><br/>This was a clear sign that he was on the verge of losing control.<br/><br/>Once a cultivator like Steward Han lost control, it would cause enormous damage to the Huangmu City.<br/><br/>The best course of action was prevention, to eradicate him completely, from his mortal body to his original spirit before he lost control.<br/><br/>However, just as the head guard was about to give the command to attack, the raging energy beneath Steward Han’s black robe suddenly calmed down.<br/><br/>He had miraculously drawn himself back from the edge of out-of-control, stabilizing his condition once more.<br/><br/>The guards surrounding him were taken aback, but then saw Steward Han raising his head, his gaze sweeping over them, causing a cold chill in their hearts. Hurriedly, they made way for him.<br/><br/>Steward Han didn’t say a single word and directly left.<br/><br/>After leaving the City Lord Mansion, Steward Han left Huangmu City. Channeling his precious True Essence, he flew speedily in a certain direction.<br/><br/>About half an hour later, he finally caught up.<br/><br/>“Is there a reason you all are following me?”<br/><br/>From a distance, he heard that sunny voice, sighing inwardly with relief.<br/><br/>It was the voice that made his cold, frozen heart beat once more.<br/><br/>That was the feeling of being alive that he had long forgotten.<br/><br/>How beautiful it was to be alive.<br/><br/>He would not allow the master of that voice to be harmed.<br/><br/>No matter who it was, he wouldn’t allow it.<br/><br/>Following that was a sly voice, “Hand over all your belongings.”<br/><br/>“The elixirs, Magic Treasures, secret cultivation techniques, all of it,” another voice demanded.<br/><br/>“And leave the woman next to you,” a third man added greedily.<br/><br/>These three people, Steward Han knew them, they were all Golden Core cultivators of infamous reputation from Huangmu City, all extremely heavily polluted.<br/><br/>All of the remaining Golden Core cultivators within Huangmu City, barring the two who were in closed-door cultivation, had all come here.<br/><br/>“Han Feng, do you also want a share of the spoils?”<br/><br/>Now, the highest-level Golden Core among them, Xue Yong, was the first to recognize his arrival. His tone harbored quite a bit of fear.<br/><br/>Steward Han coldly enunciated, “Leave this place, or die.”<br/><br/>These words sent the three Golden Core cultivators into a frenzy.<br/><br/>“Han Feng, don’t think because you are in the advanced Golden Core stage we are afraid of you.”<br/><br/>“Are you trying to keep all the goods for yourself? Aren’t you afraid of overeating?”<br/><br/>“Dare to compete with me for a woman, kill him.”<br/><br/>Gu Yang observed these three irascible Golden Core cultivators, feeling increasingly fearful of this world.<br/><br/>The three of them could hardly control their emotions, their eyes filled with all sorts of greedy desires.<br/><br/>In the language of this world, their souls had been polluted.<br/><br/>This was the most terrifying part of these grotesque creatures.<br/><br/>The toxins in the world’s vital energies would merely contaminate the mortal body and True Essence.<br/><br/>However, these grotesque creatures could pollute a cultivator’s soul and original spirit.<br/><br/>It was somewhat similar to a fictitious Cthulhu Evil God on Earth.<br/><br/>Luckily, the bizarre creatures in this world weren’t so powerful that they were invincible. As long as one was strong enough, they could be defeated.<br/><br/>Gu Yang had slain one before.<br/><br/>At this moment, Steward Han made his move without a word.<br/><br/>He threw out a grey gourd, and a sword light spurted from its mouth, twisting and slicing one man in half at the waist.<br/><br/>The man let out a piercing scream, “The Immortal-Slaying Gourd? Han Feng, have you no fear of death?”<br/><br/>“His True Essence can only emit one sword aura at most. Quickly, kill him!”<br/><br/>“How dare you compete with me for a woman, die!”<br/><br/>The two remaining people, shocked and furious, unleashed their techniques and attacked Han Feng.<br/><br/>“Magic Treasure?”<br/><br/>Gu Yang was startled by the power of the gourd. In an instant, he yelled, “Don’t you dare steal my kill!”<br/><br/>Having said this, the Phoenix Feather Knife was drawn.<br/><br/>The second move of the “Six Annihilation of God”, Thunder Punishment!<br/><br/>Rumble!<br/><br/>Three thunderbolts fell from the sky.<br/><br/>“What?”<br/><br/>Zheng Mingxin sensed a heart-wrenching atmosphere, abruptly turning to look at the Foundation Establishment Stage youth.<br/><br/>In the next moment, a thunderbolt fell, engulfing him.<br/><br/>Under the upright and imposing power, he was instantly turned into ashes.<br/><br/>Lei… Lei method?”<br/><br/>Not far away, three Foundation Establishment Stage cultivators were so surprised that they were stupefied.<br/><br/>The Foundation Establishment Stage youth had summoned three thunderbolts and instantly killed three Golden Core Stage powers.<br/><br/>They felt as if they were dreaming. Some even thought the pollution they’d suffered was so severe that they were hallucinating.<br/><br/>The three Golden Core powerhouses were quite famous in Muhuang City.<br/><br/>But they were annihilated by a boy at the Foundation Establishment Stage.<br/><br/>“Run!”<br/><br/>Suddenly, one of them turned to run.<br/><br/>The other two finally reacted and quickly ran away. They regretted not having more legs for running faster.<br/><br/>Could such a terrifying existence be something they could compete with?<br/><br/>In the field, only Han Feng was left, holding the gourd in his hand with a somewhat vacant expression.<br/><br/>This shocking scene nearly made him lose control.<br/><br/>Foundation Establishment cut Golden Core, and it happened within seconds.<br/><br/>If one didn’t know better, they might think that the one who had just made a move was a Nascent Soul Stage power.<br/><br/>“You…”<br/><br/>He swallowed hard, his gaze falling on the knife in Gu Yang’s hand, “Magic Treasure!”<br/><br/>Gu Yang put away the Phoenix Feather Knife and said, “Yours isn’t too bad either.”<br/><br/>He did not attack Han Feng because the latter didn’t carry any murderous intent.<br/><br/>It was a bit unbelievable, but it seemed that this man was here specifically to help him.<br/><br/>He asked with some confusion, “Why are you helping me?”<br/><br/>Han Feng put away his gourd, his rigid face showing no expression, “You shouldn’t die.”<br/><br/>Although his response sounded a bit awkward, he was probably trying to show goodwill, right?<br/><br/>Gu Yang thought for a moment and explained, “I don’t have any Elixirs, nor any spare Magic Treasures.”<br/><br/>“I know.”<br/><br/>Han Feng said in a dull tone, “Six hundred years ago, my master and I went to Great Zhou, or rather, it was called Great Qin at the time. Do you know what kind of place that was?”<br/><br/>Gu Yang was taken aback, “What? You’ve been to Great Zhou?”<br/><br/>“My sect possesses an ancient teleportation array. While studying it, my master and I accidentally activated it. We were transported to Great Qin, where we travelled for ten years before returning here.”<br/><br/>Han Feng began to recount an event he had never disclosed to anyone before.<br/><br/>“What happened after that?”<br/><br/>“During the day of the sun’s fall, my master was the first to be contaminated. He almost wiped out the entire sect. The ancient teleportation array was destroyed during the battles.”<br/><br/>So that’s how it was. Indeed, if that teleportation array still existed, he could have escaped to Great Zhou instead of staying in this dangerous world.<br/><br/>As Gu Yang was thinking this, something suddenly seemed off, “Aren’t you at the Golden Core Stage? How have you managed to live for six hundred years?”<br/><br/>Golden Core Stage, the corresponding mana state, typically has a lifespan of only three hundred years.<br/><br/>Han Feng explained, “Golden Core Stage cultivators originally have a lifespan of a thousand years. But after the sun fell, no one has lived to see their natural end.”\t\t\t\t\t\t</div>", "images": {}, "success": true}