{"id": 227, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132056.html", "title": "Chapter 227 - Chapter 227: 227 Daoist Muhuang", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 227 - Chapter 227: 227 Daoist Muhuang</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 227: 227 Daoist Muhuang<br/><br/>Translator: 549690339<br/><br/>Gu Yang and his companion followed behind Steward Han, maintaining a certain distance.<br/><br/>The cultivator whose body seemed like it might spawn a monster at any moment had a cultivation level of the Mana Realm.<br/><br/>Through another perspective, Gu Yang could see that his internal energy was violent and chaotic, as if it could explode at any moment, yet sustained a strange balance.<br/><br/>It seemed more sinister than the energy of the corpses refined by the Nether Sect.<br/><br/>If they had encountered this creature in the wild, Gu Yang would have drawn his sword and killed it without hesitation.<br/><br/>Once inside the city, Gu Yang looked around.<br/><br/>The houses were very old, with broken parts hastily repaired.<br/><br/>There were many simple huts made of wood and thatch, looking disordered and resembling a slum.<br/><br/>The pedestrians on the street, ordinary individuals without cultivation, seemed normal.<br/><br/>However, the cultivators, from their looks to their mental states, gave off a very eerie impression.<br/><br/>The higher their cultivation, the more abnormal they appeared.<br/><br/>There were those with multiple eyes, three legs, tentacles growing from their bodies, and most absurdly, someone with a boar’s head, complete with tusks, on top of their own….<br/><br/>This style was overwhelmingly sinister.<br/><br/>Yet, strangely enough, the other pedestrians seemed oblivious to it all.<br/><br/>What kind of world was this?<br/><br/>If not for Gu Yang’s prior simulation, which indicated a ten-year-long, danger-free existence here, he would have turned and left immediately.<br/><br/>Eventually, Steward Han led them to the largest structure in the city.<br/><br/>It seemed that it used to be a government building, the entrance still guarded by a half-remaining stone lion.<br/><br/>Once inside, they quickly arrived in front of a door.<br/><br/>“Please come in.”<br/><br/>Steward Han paused and gestured for them to enter, “Elder Mu is inside.”<br/><br/>Gu Yang pushed the door open to reveal an empty Great Hall. At the back of the hall, against the wall, sat a “person”.<br/><br/>Half of this “person’s” body was a monster, covered in black-red scales, with a sharp claw for a left hand and half of his face contorted hideously.<br/><br/>A sword was embedded into the left side of his chest, pinning him against the wall.<br/><br/>The right half of the “person’s” body, however, maintained a human appearance, that of a middle-aged man.<br/><br/>He was holding a book in his right hand, reading it.<br/><br/>This half-human, half-monster appearance was eerie to the extreme.<br/><br/>“Esteemed guests, your arrival brings me great joy.”<br/><br/>The “person” put down his book at the sound of the door opening, his voice steady, “My health confines me and prevents me from properly welcoming you. Please forgive me.”<br/><br/>Seeing his courteous manner and clear eyes, Gu Yang couldn’t help but admire him.<br/><br/>Despite being in such a grotesque state, he still managed to maintain optimism, which was something an ordinary person couldn’t achieve.<br/><br/>This “person’s” cultivation level had already reached the Unleaking Realm. His internal energy was starkly different from others, half black, half white, clearly delineated.<br/><br/>Clearly, he had used some special secret method to isolate the contaminated portion of his body.<br/><br/>Gu Yang bowed and said, “Gu Yang greets the Daoist.”<br/><br/>“This humble one is Muhuang. I apologize for the modest conditions.”<br/><br/>That “person” looked at Gu Yang and Xi Huang, his eyes brimming with envy. “Seeing you two Daoists, I can’t help but recall past events.”<br/><br/>Gu Yang asked, “Daoist, may I know why you summoned us here?”<br/><br/>“I wouldn’t dare order you. I am merely presuming. Are you two by any chance from Great Zhou?”<br/><br/>His words alarmed Gu Yang. The Daoist actually knew of Great Zhou.<br/><br/>Seeing Gu Yang’s surprise, Daoist Muhuang seemed pleased, his face revealing a slight smile. However, his face was so repulsive it made one’s skin crawl.<br/><br/>“Please, Daoist, there is no need to be nervous. About a hundred years ago, another Daoist visited Muhuang City. From him, I learned of Great Zhou.”<br/><br/>To think, someone had visited this pocket world before.<br/><br/>Gu Yang curiously asked, “Who was that person?”<br/><br/>“The Frosty Radiance Sword!”<br/><br/>Suddenly, Xi Huang, who had been silent until then, spoke.<br/><br/>Ever since she entered, she had been eyeing the sword stuck in Daoist Muhuang’s half-monstrous body. Finally, she confirmed that it was indeed the Luo Family’s legendary divine weapon.<br/><br/>Daoist Muhuang laughed, “Since you recognize the Frosty Radiance sword, I assume you knew Luo Daoist from over a hundred years ago.”<br/><br/>Xi Huang asked, “Was his name Luo Dongyue?”<br/><br/>“No, he introduced himself as Luo Kun.”<br/><br/>Xi Huang simply nodded, and then didn’t speak again.<br/><br/>By this time, Gu Yang had already begun to form some theories in his mind.<br/><br/>In the past, the Luo Family had a figure at the peak of the Unleaking Realm, who discovered the existence of this pocket dimension and decided to try to break through to the Celestial Being realm here.<br/><br/>But why did this Frost Flower Sword end up here?<br/><br/>If he didn’t understand, he would just ask. “Why is this sword in your possession, Elder?”<br/><br/>This was a divine weapon. That Luo Kun… surely he wouldn’t just hand over a family heirloom like this.<br/><br/>Daoist Muhuang replied, “Luo Daoist already passed away, leaving behind only this divine weapon.”<br/><br/>“What?”<br/><br/>Gu Yang was taken aback. Had he guessed wrong?<br/><br/>Daoist Muhuang explained, “At that time, Luo Daoist used an abnormal treasure to forcefully open a passageway to this Yellow Springs dimension. That abnormal treasure shattered in the process.”<br/><br/>“He was unable to return to the Great Zhou. After just twenty years, his mind and original spirit were completely corrupted, and he died in madness. A real pity.”<br/><br/>Gu Yang was looking at the sword that was currently lodged in Daoist Muhuang’s chest. He asked the most critical question, “Why has this world become like this?”<br/><br/>“I don’t know.”<br/><br/>Daoist Muhuang sighed, “Five hundred years ago, everything was normal. Then one day, the sun fell into the abyss. Since then, the world’s vitality has changed dramatically and strange creatures began to appear.”<br/><br/>“At that time, my cultivation level was quite low, so I wasn’t aware of what had happened.”<br/><br/>“Ever since then, this world has become more and more polluted, and the number of strange creatures has increased. We cultivators have slowly transformed into this bizarre, neither human nor ghostly state.”<br/><br/>“As the vitality of heaven and earth has been contaminated, the higher a cultivator’s level, the more severe the corruption within their bodies.”<br/><br/>“Daoist friend, try to conserve your true essence as much as possible. Once exhausted, absorbing vitality will lead to contamination.”<br/><br/>Gu Yang could hardly imagine what kind of catastrophe this world must have endured to become the way it is now.<br/><br/>A pocket dimension should typically contain Celestial Beings.<br/><br/>Thinking about a disaster that not even a Celestial Being can stop is truly terrifying.<br/><br/>Daoist Muhuang asked, “What do you plan to do next?”<br/><br/>Gu Yang naturally wouldn’t reveal that he had the key to entering and exiting this world. He cautiously replied, “We’ll figure it out step by step.”<br/><br/>“Why not stay with me?”<br/><br/>Gu Yang declined, “No need, we have our own place.”<br/><br/>Daoist Muhuang didn’t insist. He nodded and said, “That’s fine, if you need any assistance, feel free to ask.”<br/><br/>“Actually, we do need something.”<br/><br/>“Please, tell me.”<br/><br/>“We’re unfamiliar with this world. Could you help us find a mentor who understands it?”<br/><br/>“That’s easy to arrange.”<br/><br/>“Thank you.”<br/><br/>“Now that you are in Muhuang City, we should help each other like family. Also, unless it’s necessary, I suggest you two don’t leave Muhuang City to avoid any accidents.”<br/><br/>It was not until the next day that Gu Yang and Xi Huang bid their farewells and left.<br/><br/>After spending a day there, Gu Yang had gained a basic understanding of the surroundings of Muhuang City, and a plan began to form in his mind.<br/><br/>They couldn’t stay in this world for long. They must leave before their True Essence was depleted.<br/><br/>If they were contaminated, who knew what the consequences would be.<br/><br/>Before their True Essence ran out, they should kill as many of these strange creatures as possible.<br/><br/>Although this world was not suitable for cultivation, it was teeming with these weird creatures. Killing them was an ideal way of gathering energy.<br/><br/>Gu Yang was somewhat wary of Daoist Muhuang. The eerie, neither human nor ghostly appearance of the man made it hard for him to trust him completely.<br/><br/>He visited Wei Hu’s house to learn more about Muhuang City and its surroundings.<br/><br/>Weigh Hu, who dared to go outside the city alone to dig for things, must be familiar with the area. He would know where the stranger creatures were more frequent.<br/><br/>After another day, Gu Yang and Xi Huang prepared to leave the city and hunt those weird creatures.<br/><br/>As soon as they set foot outside, several figures immediately started to follow them.<br/><br/>“Three in the Golden Body realm, three in the Mana realm. You just have to deal with the three in the Golden Body realm.”<br/><br/>Gu Yang said to Xi Huang beside him.<br/><br/>As they say, an innocent man commits no crime, but carrying a jade does. It was not surprising at all that they attracted attention since they were clearly outsiders.<br/><br/>That’s why Daoist Muhuang advised him not to leave Muhuang City that day. His warning was indeed out of goodwill.\t\t\t\t\t\t</div>", "images": {}, "success": true}