{"id": 229, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132059.html", "title": "Chapter 229 - Chapter 229: 229 How Are You Here? (Third Update, Asking For Monthly Tickets)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 229 - Chapter 229: 229 How Are You Here? (Third Update, Asking For Monthly Tickets)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 229: 229 How are you here? (Third update, asking for monthly tickets)<br/><br/>Translator: 549690339<br/><br/>A lifespan of over a thousand years in the Golden Core stage?<br/><br/>That’s quite a difference. In Mortal Arts, it’s reduced by two thirds.<br/><br/>Gu Yang didn’t expect such a big difference in life span.<br/><br/>But upon reflection, the mana realm of a martial artist is indeed stronger than a Golden Core cultivator.<br/><br/>In the cultivator’s world, martial artists of the same level are not easily defeated, let alone completely overpowered.<br/><br/>On the other hand, if a Golden Core cultivator went to the Great Zhou, it’s uncertain whether they could win against a Golden Body cultivator, let alone someone in the Mana Realm.<br/><br/>Martial artists sacrifice lifespan to enhance their physical bodies.<br/><br/>Thinking about it this way, it seemed balanced.<br/><br/>Gu Yang didn’t care too much about lifespan. After simulating so many times, only once did he die of old age in the Mortal Realm.<br/><br/>Except for that time, he always died by unnatural causes. Even the longest lifespan is useless.<br/><br/>By the time he reaches the Celestial Being realm and is able to defeat any enemy, he won’t have to worry about lifespan anymore.<br/><br/>“It’s not wise to stay here for too long,” Han Feng suddenly advised.<br/><br/>“Let’s go then.”<br/><br/>Gu Yang decided to take the advice of the expert. He set off with Xi Huang, leaving the place.<br/><br/>Shortly after they left, heads from all directions started to pop up, searching for something.<br/><br/>The mouths of these heads opened and closed. Some were crying, some were laughing madly, some were contorted with an array of expressions. It was extremely eerie.<br/><br/>“Strange creatures are very sensitive to True Essence,” Han Feng explained on the way. “Once they sense it, surrounding creatures swarm over. Many Nascent Soul masters died like this.”<br/><br/>“Thanks for the information.”<br/><br/>Gu Yang expressed his gratitude. This man, in such a situation, was still helping others. It was admirable.<br/><br/>You cannot judge a book by its cover.<br/><br/>“I still have things to deal with, we should part ways here.”<br/><br/>Han Feng remained expressionless and asked, “Will we see each other again?”<br/><br/>Gu Yang thought for a moment and told the truth, “I will return to Muhuang City.”<br/><br/>“Good, take care.” Han Feng stopped and watched the two leave.<br/><br/>“He is a good man indeed.”<br/><br/>Gu Yang couldn’t help but remark.<br/><br/>Xi Huang asked, “Where are we going next?”<br/><br/>“First, let’s find out more about this place, then we will return.”<br/><br/>Gu Yang said while turning on the system.<br/><br/>Earlier, he had only killed two Golden Core cultivators, obtaining twenty units of energy.<br/><br/>That is to say, killing a Golden Core cultivator gives ten units of energy.<br/><br/>Regrettably, the three of them didn’t even leave behind a single Spirit Tool. They were too poor.<br/><br/>Now, his balance stood at thirty-two units.<br/><br/>[Do you want to use the Life Simulator? One use costs four energy units.]<br/><br/>“Yes.”<br/><br/>[At the age of 22, you have reached the third level of the Golden Body cultivation. You enter the Yellow Springs and discover that it is not suitable for cultivation, so you leave immediately.]<br/><br/>[On the way back with Xi Huang, you are ambushed by a second-stage Mana Realm master. You suffer minor injuries and escape using the “Divine Phoenix Manual”.]<br/><br/>[On the way, you discover that Chu Xiyue is being pursued and decide to help. You have a significant fight before driving off the enemy.]<br/><br/>[Chu Xiyue is seriously injured. You plan to take her back to Chu Family. On your way, you encounter a third-stage Mana Realm master from Qin Family. He attacks without any preamble and you are killed on the spot at the age of 22.]<br/><br/>Chu Xiyue was in trouble.<br/><br/>Gu Yang found it strange that those who chased her must be at least in the Mana Realm, otherwise, they couldn’t escape from him.<br/><br/>A Mana Realm master personally trying to kill a Mortal Realm martial artist was odd.<br/><br/>Could it be that they wanted to sabotage the Qin and Chu Families’ marriage alliance?<br/><br/>Could the union of two Mortal Realm martial artists affect the grand scheme of things?<br/><br/>Gu Yang remembered that in previous simulations, Chu Xiyue survived for many years. She should be fine.<br/><br/>But you never know.<br/><br/>After all, that was a previous timeline. His actions as a butterfly could have already significantly changed the future. Anything could happen.<br/><br/>[Simulation over, you can keep one of the following…]<br/><br/>Gu Yang didn’t make a choice; he directly closed the system.<br/><br/>Next, Gu Yang, along with Xi Huang, began to officially hunt down and kill the monstrous creatures.<br/><br/>They each wore a camouflage charm that deceived the creatures’ senses. Upon getting close without the creatures noticing, they would use Phoenix’s True Fire to reduce the creatures to ashes before they could react.<br/><br/>For safety, Gu Yang changed locations after each kill.<br/><br/>Each creature killed provided energy ranging from one to three points.<br/><br/>In less than half a day, he had already taken down over ten creatures.<br/><br/>This reminded him of the joy he used to feel when “grinding” in video games. Even though there were no experience points, the sight of energy gained from killing the creatures brought him joy and satisfaction he hadn’t felt in a long time.<br/><br/>As evening approached, they discovered a large creature.<br/><br/>“Unleaking Realm!”<br/><br/>When Gu Yang saw the creature’s enormous, floating head bearing a sorrowful, pained expression, his heart clenched in an indescribable suffocation even from a distance.<br/><br/>He subtly shook his head to Xi Huang, indicating that they should retreat.<br/><br/>They weren’t ready to handle a creature of this level just yet.<br/><br/>Just then, the Unleaking Realm creature suddenly turned towards them.<br/><br/>“Has it spotted us?”<br/><br/>As Gu Yang was about to escape with Xi Huang, he noticed the bewildered look on the huge face, which then turned into an expression of ultimate fear. The creature turned and fled in an instant.<br/><br/>What just happened?<br/><br/>Of all the creatures he had encountered, he had never seen one whose expression could change, especially not to one of fear.<br/><br/>He turned around and saw an old man walking towards them.<br/><br/>What a coincidence, he had met this man before.<br/><br/>“Elder?”<br/><br/>Gu Yang was stunned. What was this man doing here?<br/><br/>The elder’s tall figure and square face gave off an air of authority. Though his clothing looked ordinary, its material was anything but.<br/><br/>This was the mysterious elder he had met on Dragon Gate Island, who had injected the liquid from inside the Phoenix Gallbladder into his forehead and had given Pei Qianlan a drop of Dragon Washing Pond water, helping her reborn anew.<br/><br/>Spotting Gu Yang, the old man appeared surprised, “So it’s you.”<br/><br/>Then he carefully observed him, shaking his head in wonder. “Your luck, truly extraordinary. You’re nearing the Mana Realm so quickly. Very impressive.”<br/><br/>“Thanks to your help, Elder.”<br/><br/>Gu Yang formally expressed his gratitude.<br/><br/>“Your achievements today have little to do with that drop of blood.”<br/><br/>The old man looked pleased. “Just as well you’re here, help me with something. Don’t worry, it’s not dangerous.”<br/><br/>“Just say the word, Elder.”<br/><br/>Gu Yang was now completely unable to gauge just how powerful this old man was, especially after he terrified and chased off an Unleaking Realm creature. It was clear just how formidable he was.<br/><br/>What confused him was why the Simulator didn’t mention this encounter with the elder?<br/><br/>He had planned to engage the system for a simulation.<br/><br/>But a prompt popped up, stating that he could not commence simulation until he claimed the pending reward.<br/><br/>So, Gu Yang decided to claim the reward.<br/><br/>[Warning: this action carries the risk of exposing the existence of the Simulator, operation restricted.]<br/><br/>Now he was genuinely startled.<br/><br/>He had never seen this kind of warning before.<br/><br/>He surreptitiously glanced at the old man, raising his danger level to the highest rank.<br/><br/>The system was even cautious about this old man’s capabilities.<br/><br/>The old man said, “Come with me.”<br/><br/>Gu Yang followed him, along with Xi Huang.<br/><br/>The old man walked unhurriedly, and the monstrous creatures they encountered en route avoided them, as if they were facing archenemies.<br/><br/>Gu Yang noticed that the elder was heading towards the Wanji Forest.<br/><br/>This was the most dangerous place near Muhuang City.<br/><br/>The man who had given him the map had once told him that this place was a death trap, where even Golden Core Realm cultivators would surely die. It was marked as a forbidden land.<br/><br/>He even suspected that the peak Unleaking Realm creature was hiding there.<br/><br/>Once they entered the forest, it was eerily silent, with no sound to be heard.<br/><br/>Even their footsteps mysteriously vanished.<br/><br/>The trees in the forest were all a gloomy gray, which at a first glance, seemed as if they had been painted on.<br/><br/>Gu Yang stuck close to the old man, fearing he might get left behind.<br/><br/>The feeling in this forest was oppressively uncomfortable, setting his heart racing in anxiety.<br/><br/>PS: Third update, seeking monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}