{"id": 221, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132043.html", "title": "Chapter 221 - Chapter 221: 221 Returning Things To Their Rightful Owner", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 221 - Chapter 221: 221 Returning Things To Their Rightful Owner</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 221: 221 Returning Things to Their Rightful Owner<br/><br/>Translator: 549690339<br/><br/>The Duke’s mansion, in the Everlasting Hall.<br/><br/>Humming<br/><br/>In the center of the hall, a sword is enshrined. The sword radiates a purple aura and is enveloped in a cloud of mist. Within the mist, thousands of miles of landscape can be seen – this is the state-ruling Sword, tying the fate of the nation to its destiny.<br/><br/>At this moment, the purple aura on the sword splits open, revealing a startling blood stain. The thousand-mile landscape within it seems to be distorting as if it may collapse at any moment.<br/><br/>The sword constantly trembles, crying out with sorrow.<br/><br/>A hefty, elderly man dressed in brocade sits nearby, continuously channeling his Mana into the state-ruling Sword in vain.<br/><br/>Outside the Everlasting Hall, a figure stands in mid-air, dressed in Daoist robes, hair pinned up, with a simple long sword strapped to his back.<br/><br/>The old man finally speaks, his voice echoing out, “Leader Wen, why are you blocking my doorstep?”<br/><br/>The person outside is none other than Wen Jue, the leader of the Dao Sect. She draws the sword from her back and swings it forth.<br/><br/>A deep sword mark appears on the ground in front of the mansion’s gates.<br/><br/>She speaks calmly, “In ten days seek beyond these gates, and die!”<br/><br/>In the Everlasting Hall, there is no response for a long time. The only sound is that of the sword’s cry, growing louder and louder.<br/><br/>Outside the Divine City, a horse carriage races along the official road.<br/><br/>In the carriage, Gu Yang studies the Nine Provinces Seal he’s just acquired—the fifth one he’s collected<br/><br/>If his guess is correct, this should be the one from the Wu Family that originally belonged to King Liang.<br/><br/>He takes out a bag from his bosom and places the seal along with the four other ones, tucking them away safely.<br/><br/>Then, he opens the system, pulling up the content of the last simulation.<br/><br/>[At the age of twenty-two, you have reached the third level of the Golden Body.]<br/><br/>[You and Wen Jue infiltrated the palace, killing the clone of Heavenly Extreme Taoist, resulting in the death of the emperor.]<br/><br/>[After the incident, you left the Divine City with Xi Huang, heading to Tianzhu Mountain to meet up with Su Qingzhen and others. You all went through rigorous cultivation in the Secret Realm.]<br/><br/>[Ten years later, the Secret Realm suddenly collapsed. You all were swallowed by a giant skull that appeared out of nowhere in the void. You died at the age of thirty-two.]<br/><br/>It seems that one from the Bright Sky has targeted him.<br/><br/>Gu Yang didn’t seem surprised, only puzzled; how was he located?<br/><br/>He was discovered almost immediately upon returning to the main plane.<br/><br/>Could it be that an identifying mark of some sort was placed on him?<br/><br/>At this moment, the system has sixteen energy squares left, which can perform four simulations.<br/><br/>On one side, there’s the future pursuit by that person from the Bright Sky.<br/><br/>On the other side, there’s the looming threat of being hunted down by the Lord of the State.<br/><br/>What should be his next move, then?<br/><br/>All of a sudden, the horse carriage comes to a halt.<br/><br/>The voice of the coachman rings out, “Young Master, someone is stopping the carriage up ahead.”<br/><br/>This coachman is a disciple of the Tianxin Martial Arts Hall with a cultivation level of fourth grade. Originally a coachman, he voluntarily offered to drive the carriage for Gu Yang.<br/><br/>A hint of anticipation flickers in Gu Yang’s mind. He already has a guess as to who the person might be, “Invite him up.”<br/><br/>The carriage door opens, and an old man steps in, each of his hands holding a jug of wine, his face flushed with a rosy glow. “Good lad, you’ve avenged me. Today, let’s drink to our heart’s content.”<br/><br/>The man is none other than Wu Er.<br/><br/>The destruction of the Wu Family was ordered by this emperor; the grudge he holds is ocean-deep.<br/><br/>Now that Gu Yang has killed the emperor, naturally, Wu Er is delighted.<br/><br/>Gu Yang finds it a bit bizarre; his information sources are incredibly efficient. “How did you find out?”, he asks.<br/><br/>Wu Er bursts into laughter, “Haha, claiming that he died of illness, three princes and five ministers died of overwhelming grief. Who are they trying to fool? I knew it must’ve been you who did it.”<br/><br/>So, it was just a conjecture.<br/><br/>Gu Yang takes the wine jug, clinks it against Wu Er’s, and takes a sip.<br/><br/>The two of them sip their wine for a while before he speaks, “I’ve offended quite a few people; that person from Bright Sky, the Lord of the State, and also the Shen Family. I’m thinking of hiding somewhere for a while, preferably in some Cave Heaven.”<br/><br/>“Cave Heaven?”<br/><br/>Wu Er’s expression turns much more serious, “Do you know how dangerous a strange Cave Heaven can be?”<br/><br/>“In this world, the Way of Heaven has died. There will be no more people who can reach the Celestial Being realm.”<br/><br/>“But a Cave Heaven is different, as it is a complete world. It has given birth to its own Way of Heaven. If it has a complete lineage, then the number of Celestial Beings could be many more than in the Great Zhou.”<br/><br/>“Since the Xia Dynasty, numerous peak-Unleaking Realm cultivators have died attempting to penetrate some Cave-heaven worlds in order to make a breakthrough to the Celestial Being realm. Let alone you,”<br/><br/>Gu Yang managed to glean some vital information from those words.<br/><br/>After the Xia Dynasty, this world could no longer give birth to any Celestial Being realm powerhouses.<br/><br/>That is to say, all the Celestial Beings who made a breakthrough during this period have their own Cave-heaven worlds.<br/><br/>In the one thousand years after the Xia Dynasty, only three Celestial Beings have emerged.<br/><br/>One from the Lin Family, one from the academy, and Luo Wang.<br/><br/>In addition to this, there is the Qin Family’s ancestor, who will make a breakthrough in a decade or so.<br/><br/>And then there’s the one related to Cao Yiyi – the All-Encompassing Cave-heaven.<br/><br/>Just these six, that are known of<br/><br/>“Don’t think your rapid progress in cultivation has made you invincible. Whether it’s a Celestial Being or even a Mana realm cultivator, you’re no match.”<br/><br/>Wu Er furrowed his brows and caviled, thinking that Gu Yang had got quite swelled, which was surely not a good thing.<br/><br/>Once inflated, one would lose sight of oneself, and eventually attract disaster.<br/><br/>Especially when they have numerous enemies like they do, they should tread carefully.<br/><br/>“Don’t talk about my father like that!”<br/><br/>At this point, Xi Huang who had remained silent till now in the coach couldn’t hold back anymore, she was getting a bit miffed at the old man.<br/><br/>Wu Er, taken aback, rotated his suspicious gaze from one to another, asking in response, “Father?”<br/><br/>With his ability, he naturally discerned the woman’s actual cultivation level.<br/><br/>Initially, he thought that she was the newest woman Gu Yang had charmed. But, the moment she called him “father”, he nearly spit out his drink.<br/><br/>What the hell?!<br/><br/>Gu Yang’s probably not even as old as your fingernail, and you’re calling him father?<br/><br/>She’s a peerless powerhouse in the triple heaven of the Mana realm. Given her cultivation level, she must at least be a hundred or two hundred years old.<br/><br/>Gu Yang cleared his throat and said, “It’s a long story.”<br/><br/>He turned to Xi Huang and said, “Old Wu didn’t mean anything bad.”<br/><br/>“Oh.”<br/><br/>Xi Huang obediently responded and stopped glaring at Wu Er, “Actually, I know the entrance to a Cave-heaven world.”<br/><br/>Gu Yang’s eyes lit up, “Oh, where?”<br/><br/>“Qi Province, Tianfang Mountain.”<br/><br/>Xi Huang removed a crystal pendant from her body, “This, was handed over by you to mother. She took good care of it until her death. Before she died, she gave it to me.”<br/><br/>And with that, she handed over the crystal pendant to Gu Yang, “Mother mentioned, this is a key to open a Cave-heaven world. Now, it yields to its original owner.”<br/><br/>Gu Yang gazed at the pendant in his hand, having mixed feelings.<br/><br/>The link between him and Xi Huang’s father was getting more entangled. He didn’t know how it would end in the future.<br/><br/>He asked, “Have you been to that Cave-heaven world?”<br/><br/>Xi Huang shook her head, “Mother had been there. She advised it was extremely dangerous, and no one should go unless they’ve reached the Longevity Realm.”<br/><br/>At this moment, Wu Er interjected, “If I remember correctly, Tianfang City is just outside Qi Province City. That happens to be Luo family’s territory.”<br/><br/>Luo Family?<br/><br/>If he remembers correctly, they’re under the Three Holy Gates.<br/><br/>Indeed, a little troublesome.<br/><br/>Xi Huang’s face suddenly changed, “Luo Family?”<br/><br/>Seeing her reaction, Gu Yang thought there was no way it could be a coincidence?<br/><br/>Noticing Xi Huang pale, he patted her hand to comfort her, “It’s been a thousand years. Those from the Luo family back then have now all turned into bones. All that remains are their descendants. Let bygones be bygones.”<br/><br/>Xi Huang leaned her head against his arm and slowly nodded.<br/><br/>On the side, Wu Er found the scene very strange, a great powerhouse of the triple heaven of the Mana realm, acting like a little girl next to the youngster in the Golden Body realm.<br/><br/>This sight was too odd.<br/><br/>Suddenly, his face changed as he turned around abruptly to look, saying, “Nether Sect, Mana realm, Gu Yang, run fast!”<br/><br/>A smile surfaced on Gu Yang’s face, “I’ve been waiting for him this half a day. Finally, he arrives. Huh, why is there another?”<br/><br/>PS: This is today’s first update, asking for monthly passes.\t\t\t\t\t\t</div>", "images": {}, "success": true}