{"id": 224, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132049.html", "title": "Chapter 224 - Chapter 224: 224 Entering The Heavenly Cave", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 224 - Chapter 224: 224 Entering The Heavenly Cave</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 224: 224 Entering the Heavenly Cave<br/><br/>Translator: 549690339<br/><br/>While chatting with Luo Yulong, Gu Yang was tallying up the gains from this trip.<br/><br/>Two corpses at the Mana realm, together worth ten energy points.<br/><br/>Killing that Nether Sect disciple at the first level of the Mana Realm, he obtained ten energy points.<br/><br/>Seized a magical tool and a spiritual tool from him, together worth eight points of energy.<br/><br/>Lastly, Luo Yulong’s spiritual tool, worth ten points of energy.<br/><br/>Added up, that was thirty-eight points.<br/><br/>Indeed, “no sudden wealth, no riches; no night grass, no fat horse.”<br/><br/>Killing and looting felt like the true shortcut to accumulating wealth.<br/><br/>Gu Yang’s energy had reached fifty-four points, enough for thirteen simulations with some left over.<br/><br/>Thirteen simulations could take his power to a higher level.<br/><br/>If he could find the legendary Spirit Fire, breaking into the Mana realm might not be impossible.<br/><br/>Qi Province, during the Xia Dynasty, was the fief of King Qi.<br/><br/>Consequently, when Xi Huang’s identity was discovered, she was presented to the King Qi.<br/><br/>Perhaps it was this event that catapulted the Luo Family into prominence. Later, they pledged allegiance to the Three Sages Gate. Seizing the opportunity when the Xia Dynasty collapsed, they became one of the most affluent families today.<br/><br/>Located outside the city of Qi Province is Jade Luo Mountain, where Luo Yulong’s mansion stands.<br/><br/>“Brother Gu, please.”<br/><br/>Returning to his own territory, Luo Yulong managed to regain his confidence, returning to his aristocratic demeanor in front of Gu Yang, although there was a hint of pretension in his ingratiating manner.<br/><br/>Gu Yang looked at the mansion built upon the mountain veiled in mist, appearing like a mystical paradise.<br/><br/>The mansion seemed to have a history of several hundred years. The wear and tear could still be seen between the brick walls and the tiles.<br/><br/>The depth of this thousand-year-old world was truly extraordinary.<br/><br/>Suddenly, he noticed Xi Huang’s unusual expression, her lost soul-like demeanor. Her hand was ice cold when he grabbed it, he quickly sent a thread of True Essence into her.<br/><br/>Xi Huang’s body jolted as her consciousness returned. Wiping away the tears on her face, she clutched tightly onto Gu Yang’s clothes.<br/><br/>Luo Yulong, who was standing aside, noticed the duo’s reactions, confused.<br/><br/>Who is this woman? Why did she react like this upon arriving here?<br/><br/>Something wasn’t right. His heart on guard, he recalled how Gu Yang had forcefully made him invite them to the Luo Family. There must be something going on.<br/><br/>Luo Yulong’s mind was rapidly turning, yet he remained calm and collected on the surface, appearing like a gracious host, introducing the history of the mansion to them.<br/><br/>“This Jade Luo Mansion was built during the Xia Dynasty, and it has more than a thousand years of history. Look at that tree, it was planted when the mansion was first built, it’s over a thousand years old too.”<br/><br/>Upon hearing this, Gu Yang immediately understood why Xi Huang was behaving so unusually.<br/><br/>She must have been here before.<br/><br/>A thousand years had passed since she woke up. The world had changed drastically. Upon seeing this familiar place, she must have been reminded of the past.<br/><br/>He said, “We’ve been on the road for so long, I’m a bit tired. Brother Luo, could you arrange a place for us to rest a bit?”<br/><br/>This request perfectly suited Luo Yulong. He called his housekeeper to arrange accommodations for Gu Yang and Xi Huang.<br/><br/>After bidding farewell to the peculiar pair, he returned to his courtyard and sat on an armchair, regaining the momentum fitting of someone in the Mana realm.<br/><br/>He ordered, “Summon Tiancheng.”<br/><br/>Luo Tiancheng, a member of his junior generation, currently in charge of intelligence within the Luo Family.<br/><br/>Luo Yulong still felt uneasy. He wanted to investigate the origins of the woman accompanying Gu Yang.<br/><br/>“Are you alright?”<br/><br/>In a quiet courtyard, after everyone else had left, Gu Yang asked.<br/><br/>Xi Huang stood by the courtyard wall, stroking the blue bricks gently and said sorrowfully, “This was where my mother and I used to live. It’s been a thousand years, and it’s almost exactly as I remember.”<br/><br/>So that’s how it was.<br/><br/>Gu Yang patted her shoulder, not knowing how to comfort her.<br/><br/>Xi Huang said quietly, “Father, let me be alone for a while, please.”<br/><br/>“Alright.”<br/><br/>Gu Yang entered the room and opened the system.<br/><br/>[Do you wish to use the Life Simulator? Each use consumes four cells of energy.]<br/><br/>“Yes.”<br/><br/>[At the age of twenty-two, you’re already at the third level of the Golden Body. After killing Heavenly Extreme Taoist’s avatar, the emperor dies. Celestial Beings regard you as the killer of the monarch.]<br/><br/>[You and Xi Huang left Divine City. On the way, you saved Luo Yulong and killed Ding Fei, Nether Sect’s Mana Realm practitioner.]<br/><br/>[You were invited to visit the Luo Family in Qi Province.]<br/><br/>[The next day, you and Xi Huang went to Tianfang Mountain and entered a cavernous world. You were attacked by ghostly beings. You fought while retreating, escaping to a city.]<br/><br/>[The accumulation of ghostly beings outside the city increased. A few days later, a ghostly being from the Unleaking Realm broke the prohibition and entered the city.]<br/><br/>[You fought your way through with Xi Huang, making it to the exit. You activated the secret realm and escaped. Countless ghostly beings followed. Killing ensued everywhere.]<br/><br/>[Just as Qi Province City was about to be destroyed, the Luo Family Ancestor was alarmed and tried to suppress the ghostly being, battling it fiercely. Suddenly, a powerful Unleaking Realm practitioner appeared and severely injured the Luo Family Ancestor.]<br/><br/>[The ghostly being swallowed the Luo Family Ancestor and evolved, forcibly opening the entrance to the cavernous world. Immediately, countless ghostly beings appeared in the human world.]<br/><br/>[You and Xi Huang escaped in the chaos. A month later, a ghostly being from the Celestial Being Realm appeared and killed you. You died at the age of twenty-two.]<br/><br/>That cavern world is indeed very dangerous.<br/><br/>The ghostly beings dominated the realm, similar to the situation in the Red Bright Sky.<br/><br/>As soon as they entered, they encountered a ghostly being from the Unleaking Realm. After swallowing the Luo Family Ancestor, it quickly broke through to the Celestial Being Realm.<br/><br/>This is, once again, a world-destroying rhythm.<br/><br/>[Simulation ends, you may retain one of the following.]<br/><br/>[First, the Martial Arts realm at the age of twenty-two.]<br/><br/>[Second, the Martial Arts experience at the age of twenty-two.]<br/><br/>[Third, the wisdom of life at the age of twenty-two.]<br/><br/>“I choose the second option.”<br/><br/>Suddenly, memories of multiple battles appeared in Gu Yang’s mind. His opponents were all ghostly beings.<br/><br/>“Such a strange technique.”<br/><br/>He frowned, the ghostly beings in the cavernous world were different from the ones in the Red Bright Sky.<br/><br/>Ghostly beings are extremely disgusting, just looking at them induces physical discomfort.Moreover, they have no form, physical attacks are ineffective against them. Once possessed by them, one’s mind will be polluted, eventually leading to madness, turning into a monster.<br/><br/>Only True Essence could handle them. Gu Yang’s Phoenix Fire was their nemesis. However, there were too many ghostly beings, he alone couldn’t kill them all.<br/><br/>Considering the magnitude of the disaster these creatures could bring to the human world is terrifying.<br/><br/>Ordinary people, except those in the Divine Power Realm, are helpless against them and can only await their deaths.<br/><br/>For humans, ghostly beings from this cavernous world are even more terrifying than those from the Red Bright Sky.<br/><br/>“There must be a way.”<br/><br/>Gu Yang had no intention of giving up. During this simulation, in that city, he learned a camouflage technique that used a symbol. When attached to the body, it could deceive the ghostly beings outdoors.<br/><br/>Using this method, after entering the cavernous world, they would not alert the ghostly beings.<br/><br/>The camouflage symbol was not complicated. With Divine Power, one could easily create it.<br/><br/>“Let’s try one more time.”<br/><br/>[…You entered the cavernous world, used the prepared camouflage symbol, and quietly approached the nearest city.]<br/><br/>[In the city, you devoted yourself to learning various symbol creation methods and formation techniques.]<br/><br/>[Five years later, countless ghostly beings attacked the city. The city’s prohibition was instantly destroyed. A Celestial Being Realm ghostly being rushed into the city, and you died at the age of twenty-seven.]<br/><br/>Why is there suddenly a celestial being realm?<br/><br/>Gu Yang could only sigh at his bad luck. It seemed that the big guy was only one step away from the Celestial Being Realm, and it was not solely because he swallowed Luo Family Ancestor that he was able to break through.<br/><br/>[The simulation ends; you may keep one of the following.]<br/><br/>[First, Martial Arts realm at twenty-two.]<br/><br/>[Second, Martial Arts experience at twenty-seven.]<br/><br/>[Third, life wisdom at twenty-seven.]<br/><br/>“What the hell?”<br/><br/>Gu Yang thought he had read it wrong. But again, it wasn’t a mistake. The first item indeed stated the Martial Arts realm at twenty-two.<br/><br/>He was certainly twenty-seven years old at death. Why would it be the realm at twenty-two?<br/><br/>Is it possible that he made no progress at all in those five years?<br/><br/>Wrong, it should be said that his cultivation level regressed.<br/><br/>What is happening?<br/><br/>PS: The first update, please vote for the monthly ticket.\t\t\t\t\t\t</div>", "images": {}, "success": true}