{"id": 222, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132045.html", "title": "Chapter 222 - Chapter 222: Do You Need Help?", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 222 - Chapter 222: Do You Need Help?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 222: Do you need help?<br/><br/>Translator: 549690339<br/><br/>In the sky, a giant bird formed of mana streaked across the horizon at an unbelievable speed.<br/><br/>Three dark shadows doggedly pursued it from behind, progressively closing the gap.<br/><br/>A gloomy voice arose, “Give up your futile struggle, there’s no escape for you.”<br/><br/>The mana-formed giant bird was the transformation of a man.<br/><br/>At the moment, he was frantically channeling his mana, even depleting his source of power, but was still unable to widen the distance. The pursuers from behind loomed closer.<br/><br/>His heart sank continuously, knowing if things continued this way, he would eventually be caught.<br/><br/>“I’m in trouble this time!”<br/><br/>The man’s name was Luo Yulong, of the Luo Family, with his cultivation at the first level of the mana realm.<br/><br/>Decades ago, he unexpectedly discovered a set of ruins where a divine weapon of unparalleled potency resided. At that time, he was only at the third level of the golden body, lacking the sufficient strength, and hence had to abandon the ruins.<br/><br/>Five years ago, he finally progressed into the mana realm.<br/><br/>After five years of strengthening his cultivation level, he had finally decided to leave the Qi Province alone two days ago.<br/><br/>He planned to return to the ruins to retrieve that unparalleled divine weapon.<br/><br/>This was his opportunity and naturally, he couldn’t report it to his family. Otherwise, in the end, the divine weapon would never fall into his hands.<br/><br/>This was a divine weapon of unmatched strength, and the entire Luo Family only had one, kept in the hands of the ancestor.<br/><br/>Once he had the divine weapon, within a few years, he could become the eleventh Sword Saint of the world.<br/><br/>However, Luo Yulong didn’t anticipate encountering a disciple of the Nether Sect in the mana realm.<br/><br/>The opponent was unreasonable, using deadly attacks from the start and even using two corpse puppets, also in the mana realm.<br/><br/>Fighting against three, if it weren’t for his own trump card, he would have been eliminated in the first wave of attack.<br/><br/>After barely managing to escape, the enemy kept relentlessly pursuing him.<br/><br/>He was both shocked and angry, had the Nether Sect gone mad?<br/><br/>As far as he remembered, there were no substantial grudges between the Luo Family and the Nether Sect.<br/><br/>He had never even interacted with anyone from the Nether Sect before, so why were they hell-bent on killing him?<br/><br/>Wasn’t the Nether Sect afraid of retaliation from the Luo Family?<br/><br/>These past several decades, Luo Yulong had been in seclusion to cultivate diligently.<br/><br/>This time he set out, quietly leaving without alarming anyone. He didn’t know about the recent rise of the Nether Sect or their widespread hunting of cultivators in the divine power realm.<br/><br/>Not far away, on the official road, a horse pulling a carriage suddenly reared in fright.<br/><br/>The coachman channeled his True Qi to steady the horse, preventing the carriage from tipping over.<br/><br/>Immediately after, a figure leapt into the air from the carriage, flying out.<br/><br/>“Gu Yang!”<br/><br/>Wu Er was shocked to see him not fleeing, but instead, actively advancing towards the people from the Nether Sect, and this put him in utmost terror.<br/><br/>Frustrated, he stomped his foot and scolded Xi Huang who was standing by, “Why didn’t you stop him?”<br/><br/>Xi Huang replied earnestly, “My father has his own reasons for his actions.”<br/><br/>“You…”<br/><br/>Wu Er was almost driven mad with anger, one crazy, one fool.<br/><br/>That was someone in the mana realm!<br/><br/>Within the Nether Sect, there were only three disciples in the mana realm. Thanks to a battle from eighteen years ago, each one had at least one corpse puppet in the mana realm.<br/><br/>Even though the person in the mana realm was only at the first level, along with the two corpse puppets, an ordinary practitioner at the first level of the mana realm stood no chance.<br/><br/>Even if Gu Yang were to ally with Luo Yulong, who was being hunted, they wouldn’t stand much chance of winning.<br/><br/>He said angrily, “If you don’t go help now, get ready to collect his corpse.”<br/><br/>With that, he had already disembarked from the carriage.<br/><br/>Xi Huang had always been unable to see through the true strength of this old man. His words made her feel a bit anxious, so she took to the air and chased after Gu Yang.<br/><br/>She thought to herself, “I will help my father in the fight.”<br/><br/>…<br/><br/>“Do you need help?”<br/><br/>Just as Luo Yulong was contemplating his escape strategy, an unexpected voice rang out.<br/><br/>His heart leaping with joy, he turned to look, but was instantly doused by a bucket of cold water.<br/><br/>The newcomer was only at the third level of the Golden Body. With this level of strength, he couldn’t even stall the enemy momentarily.<br/><br/>“Yes!”<br/><br/>Luo Yulong blurted out immediately.<br/><br/>Even if it could only buy a moment, it could afford him a chance to escape.<br/><br/>Considering the newcomer’s flying speed, his strength must be extraordinary.<br/><br/>“Do you have a divine weapon?” the man continued to question.<br/><br/>Luo Yulong was initially taken back and then instantly enraged.<br/><br/>A mere Golden Body realm dare to seize the opportunity to rob him of his divine weapon. This was a blatant disregard for life and death.<br/><br/>“Hahaha, what a nerve.”<br/><br/>The powerhouse from Nether Sect behind him, controlling a zombie-like creature, flew toward the audacious child.<br/><br/>Ding Fei, one of the three Mana realm disciples of the Nether Sect, held the second highest position in the sect, just below the two sect masters.<br/><br/>Originally, he and two elder martial brothers assisted their masters in refining two Celestial Being corpses.<br/><br/>Until over a month ago, his master ordered him to Divine City to kill a martial artist named Gu Yang in the Golden Body Realm.<br/><br/>He naturally did not dare to enter Divine City. Not to mention the Celestial Being, even the Lord of the State could easily kill him.<br/><br/>Therefore, he had been waiting around the Divine City during this time.<br/><br/>Initially, Ding Fei didn’t understand why his master would send him to kill a Golden Body Realm minor figure.<br/><br/>Only after hearing the deeds of the youth named Gu Yang, did he realize that his master was indeed visionary.<br/><br/>The kid was a once-in-a-thousand-year prodigy who was monstrously talented.<br/><br/>In just over two months, he had broken through from the First Rank to the third level of the Golden Body Realm.<br/><br/>Bursting through realms was as simple as eating and drinking to him.<br/><br/>Kn<br/><br/>This speed already rivaled that of Qin Wu, who had been acclaimed as the number one prodigy of all time.<br/><br/>But compared to Gu Yang, it was far from enough.<br/><br/>Moreover, the martial arts that this person practiced were the “Phoenix Dance Nine Heavens”, a Pure Yang cultivation technique.<br/><br/>If this person were allowed to grow, he would become a great enemy to the Nether Sect.<br/><br/>Of course, while Ding Fei’s primary target was Gu Yang, it didn’t stop him from taking some side actions.<br/><br/>Encountering a solitary martial artist in the early stage of the Mana realm was like a pie from the sky.<br/><br/>He did not hesitate to make his move.<br/><br/>No matter which of the nine great families or six main sects that person belonged to, he would kill without a doubt.<br/><br/>There was only one exception, and those were disciples from the Academian Institute.<br/><br/>Besides that, Nether Sect fears no one.<br/><br/>Unexpectedly, Luo Yulong managed to break through his siege and escape.<br/><br/>As he pursued Luo Yulong, and Divine City came into view, he grew anxious.<br/><br/>If Luo Yulong escaped into Divine City, all his previous efforts would have been wasted.<br/><br/>He wasn’t willing to let the rich reward, which was on the tip of his tongue, simply fly away. He sped up, determined to kill Luo Yulong before he entered Divine City.<br/><br/>Just at this moment, a man in the third level of the Golden Body realm suddenly appeared and seemed to want to help.<br/><br/>Ding Fei was amused. Where did this audacious youngster come from?<br/><br/>But, out of caution, he sent a zombie to kill the youngster first.<br/><br/>“Huh?”<br/><br/>Unexpectedly, the zombie missed.<br/><br/>Looking at the youngster, he started to regard him more seriously.<br/><br/>The zombie was a Martial Realm cultivator before death. After death, its Martial Will diminished. But after refinement by deathly qi, its mortal body became even more powerful, to the point where it was difficult to harm it even with divine weapons.<br/><br/>Its speed and strength, were far beyond that in life.<br/><br/>Plus, all its Mana was converted to death qi, which could contaminate the Mana of martial artists.<br/><br/>Overall, its strength only slightly declined compared to when it was alive.<br/><br/>With its strength, dealing with a Golden Body realm should have been effortless.<br/><br/>This person dared to interfere. He did seem to have some weight to his actions.<br/><br/>At this time, Luo Yulong also realised that he had underestimated this youngster in the Golden Body Realm. Just seeing the speed at which he could keep up with him showed that this person was far from ordinary.<br/><br/>The man, while leading the zombie, asked, “Have you considered? A divine weapon in exchange for your life, you wouldn’t be losing out.”<br/><br/>“Okay!”<br/><br/>In the blink of an eye, Luo Yulong agreed.<br/><br/>“A promise is a promise.”<br/><br/>The man laughed loudly, revealing his white teeth, drew his blade, and slashed at the pursuing zombie.<br/><br/>For an instant, Luo Yulong felt as if Skyfire had descended, the destructive Blade Intent making his heart tremble.<br/><br/>He exclaimed in surprise, “Destruction of the Divine Skies!”\t\t\t\t\t\t</div>", "images": {}, "success": true}