{"id": 220, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132041.html", "title": "Chapter 220 - Chapter 220: 220 Strange Ending (Third Release Looking For Monthly Ticket)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 220 - Chapter 220: 220 Strange Ending (Third Release Looking For Monthly Ticket)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 220: 220 Strange Ending (Third Release Looking for Monthly Ticket)<br/><br/>Translator: 549690339<br/><br/>Inside the Chengtian Palace, Liu Hongyu, the Minister of the Ministry of Revenue, woke up mysteriously, opening his eyes dazedly. Realizing suddenly what had just happened, he bolted up.<br/><br/>The assassin?!<br/><br/>As he turned to look, he saw a body laying on the ground, causing his heart to shudder.<br/><br/>His legs went weak, and he almost fell to his knees.<br/><br/>The Emperor… is dead!<br/><br/>It was then that a familiar voice rang out, “The Emperor passed away because of an uncontrollable illness. The second, third and fifth princes are overwhelmed with grief. Some other senior officials couldn’t bear the shock and followed the Emperor to the afterlife…”<br/><br/>Is this…the Empress?<br/><br/>Startled, Liu Hongyu looked up, and saw the Empress standing next to the throne, very much alive and only in different clothes.<br/><br/>What’s going on?<br/><br/>He was dumbfounded.<br/><br/>Just now, he had witnessed the Empress committing suicide.<br/><br/>Not just him, everyone in the court had seen it.<br/><br/>Yet now, she had come back from the dead.<br/><br/>The contents of her words were even more terrifying.<br/><br/>Wasn’t there an assassin just now?<br/><br/>Gu Yang, and another man attempted to kill the Emperor.<br/><br/>And yet, they said the Emperor died of illness?<br/><br/>The princes too, they have passed away?<br/><br/>What on earth happened while he was unconscious?<br/><br/>Liu Hongyu turned around, noticing how many of his colleagues held looks of horror as well.<br/><br/>“…Which of the princes do you think should succeed to the throne?”<br/><br/>The entire Chengtian Palace fell silent.<br/><br/>No one dared to speak. The atmosphere had become oppressively tense.<br/><br/>The happenings of today were too strange. One wrong word in such a setting could lead to irreversible consequences.<br/><br/>After a moment, the Empress called out, “Minister Liu, you speak.”<br/><br/>Liu Yicheng, the head of the cabinet, was the first to pledge loyalty to the Empress.<br/><br/>He stepped forward, bowing his head, and cautiously said, “In my opinion, the Eighth Prince is young and intelligent, generous and kind. He is fit for the position.”<br/><br/>“Minister Sun.”<br/><br/>The Empress then named another person, who happened to be the junior minister.<br/><br/>“I second that.”<br/><br/>“Minister Wang?”<br/><br/>“I second that!”<br/><br/>Amidst the chorus of agreements, the Great Zhou dynasty welcomed its sixteenth Emperor, the thirteen-year-old Eighth Prince.<br/><br/>The present Empress was promoted to Empress Dowager and began to rule from behind a curtain.<br/><br/>As for the matter of the Empress resurrecting from death, of Gu Yang’s attempted assassination and all such peculiarity, it was all ignored by everyone.<br/><br/>All the officials chose to believe it all was just an illusion.<br/><br/>“Oh right, Senior Wen.”<br/><br/>As soon as Gu Yang left the palace gate, he finally remembered Wen Jue, the Head of the Dao Sect. He wondered how she was doing.<br/><br/>Suddenly, a figure appeared next to him. It was Wen Jue, her aura somewhat dim.<br/><br/>He asked, “Senior, are you okay?”<br/><br/>Wen Jue’s voice was icy cold, “If it hadn’t been within the palace, they couldn’t have blocked my five swords with their combined forces.”<br/><br/>He understood. She must have had a hard time against the two in the Unleaking Realm.<br/><br/>He changed the subject, “I have successfully destroyed the power of the Heavenly Extreme Taoist, as ordered.”<br/><br/>Wen Jue looked at him, her eyes softening a bit, “You did well.”<br/><br/>Gu Yang really wanted to say, could you give me something substantial? What’s the use of just praising me?<br/><br/>Suddenly, he remembered something, “Senior, do you know Wu Lingling?”<br/><br/>Wen Jue’s eyes shifted, “What happened to her?”<br/><br/>“She has mastered the ‘Extreme Yang True Gang.’”<br/><br/>“She did well.”<br/><br/>Couldn’t she find another way to praise someone?<br/><br/>Gu Yang couldn’t help but grumble internally.<br/><br/>“You should leave Divine City.” Suddenly, Wen Jue said.<br/><br/>“Why?”<br/><br/>“You could be said to be responsible for the death of the Emperor, the Sword of the State will not let you go.”<br/><br/>The Sword of the State?<br/><br/>Gu Yang noticed that what she said was the Sword of the State, not the Sword Saint of the State.<br/><br/>“The Sword of the State is an exceptionally special artifact.”<br/><br/>Inside the Wen Academy, Ye Lingbo held a book in his hand, reading it and explaining the story of the Sword of the State to Gu Yang.<br/><br/>“After the founding emperor of the Qin dynasty established his reign, he always regretted not finding the Sword of the Human Emperor, so he gathered the power of the world, spending a hundred years attempting to recreate the Human Emperor’s Sword.”<br/><br/>“Naturally, he failed. However, although he could not forge a divine artifact, he did create an exceptional divine weapon. That is the Sword of the State.”<br/><br/>“Nowadays, all the unique divine weapons that are passed down in the world originate from ancient times. Only this Sword of the State was forged in recent decades.”<br/><br/>“The founding emperor of the Qin dynasty, in an effort to forge this sword, imbued it with some sort of secret technique that infused the national fate of Divine State into the sword. This sword, once completed, was connected to the national fate of the Qin dynasty.”<br/><br/>“Afterwards, the Sword of the State was granted to a prince by the founding emperor. From then on, the prosperity of the Qin dynasty increased, and the power of the Sword of the State also became more potent. As the national fate of Qin was affected, so was the Sword of the State.”<br/><br/>“In the year the Qin dynasty was destroyed, the Sword of the State also shattered. It was later offered to the Heavenly Gods by the founding emperor of Great Zhou, nurtured for two hundred years with the national fate of Great Zhou, before the broken sword was reborn.”<br/><br/>“By a fortunate coincidence, this sword was obtained by the Lord of the State. With this sword, he performed many meritorious services, leading to his title as the Lord of the State.”<br/><br/>“If one were to say who among the world was most loyal to the royal family of Great Zhou, it would undoubtedly be the Lord of the State.”<br/><br/>“When the former emperor was killed by Wu Da, the Sword of the State mourned for three days. Despite his unhealed injuries, the Lord of the State joined the battle to eliminate the Wu family. This resulted in his injuries worsening, leaving him unable to recover for the following decade.”<br/><br/>After hearing this, Gu Yang was somewhat speechless.<br/><br/>He was actually being targeted by a sword.<br/><br/>The Sword of the State was an exceptional divine weapon.<br/><br/>The Lord of the State himself was at the peak of the Mana realm. Even with his injuries unhealed, it would be more than enough to kill him.<br/><br/>Why hadn’t anyone told him about this risk when he killed an emperor?<br/><br/>With this, his plans were completely upset.<br/><br/>Boom<br/><br/>Suddenly, a bell rang from the direction of the palace, followed by continuous ringing from different parts of Divine City.<br/><br/>When all the bells rang in unison!<br/><br/>The emperor has died!<br/><br/>Ye Lingbo abruptly turned his head and looked at Gu Yang, “Did you kill the emperor?”<br/><br/>“If I didn’t kill him, everyone in Divine City would die.”<br/><br/>Gu Yang stood up, saying, “I have to go. Until we meet again.”<br/><br/>After that, he left in a carefree manner.<br/><br/>Ye Lingbo watched his retreating figure, his eyes full of complexities.<br/><br/>At night, a horse carriage left Divine City.<br/><br/>As it approached Ten Miles Pavilion, the carriage came to a stop.<br/><br/>The road ahead was blocked.<br/><br/>The carriage door opened, and Gu Yang alighted from the carriage to see two men blocking the way, both at the divine power cultivation level.<br/><br/>The two men paid respects and said, “Young Master Gu, our master has invited you.”<br/><br/>Gu Yang moved towards the pavilion and saw a figure sitting inside. He asked, “Should I address you as the Empress, or as Miss Su Er?”<br/><br/>The woman turned around, looking into his eyes. The silvery moonlight illuminates her face giving her an extra bit of softness.<br/><br/>She said, “My name is Su Ningyan.”<br/><br/>“So, the marriage you bestowed upon me that day, you actually wanted to marry me. Why?”<br/><br/>Su Ningyan gestured for him to sit, “Please, sit.”<br/><br/>Gu Yang didn’t hesitate to take a seat.<br/><br/>Su Ningyan poured him a glass of wine, and as she spoke, “When I was young, I accidentally ventured into a Secret Realm, where I acquired a method for the divine power of external incarnation, as well as a dragon pearl.”<br/><br/>“However, when I was practicing this divine power method, something went wrong. A few years ago, my incarnation began to lose control due to the special environment of the palace, to the point where it tried to reverse the master-servant relationship.”<br/><br/>“Over these years, she fought with me openly and secretly, and you were just one of her chess pieces.”<br/><br/>“If she didn’t dare to leave the imperial palace, I might not be able to defeat her. It was rather a twist of fate. Her death turned out to be my advantage.”<br/><br/>“If I had died, all of my possessions would have been inherited by her.”<br/><br/>Gu Yang listened, engrossed.<br/><br/>If one cultivated an external incarnation and absorbed it into your body after its death, it would bring about a significant leap in your cultivation level. This would make leveling up effortless.”<br/><br/>Su Ningyan saw through his thoughts, she shook her head and said, “The reason why I was able to break through to the Mana realm is all thanks to the dragon pearl. The pearl comes from a Celestial dragon and contains vast amounts of dragon essence.”<br/><br/>So that’s how it is.<br/><br/>Gu Yang asked again, “You’ve been waiting here specifically to tell me this?”<br/><br/>Su Ningyan took something out and placed it on the stone table.<br/><br/>It was a piece of the Jiuzhou seal.<br/><br/>“You should need this.”<br/><br/>Gu Yang was stunned. He reached out and took the Jiuzhou seal, which still retained her warmth.<br/><br/>“Thank you.”<br/><br/>He truly needed it.<br/><br/>Su Ningyan gazed at him, “I just don’t want to be in anybody’s debt.”<br/><br/>“A Jiuzhou seal for a royal jade seal, am I not at a loss?”<br/><br/>“What I owe you, I will repay someday.”<br/><br/>“I’ll remember that.”<br/><br/>Gu Yang stood up, preparing to leave.<br/><br/>“Take care!”<br/><br/>PS: I need monthly votes. If I don’t post the third update in the chapter title, some people will think I’m lacking updates.\t\t\t\t\t\t</div>", "images": {}, "success": true}