{"id": 238, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132077.html", "title": "Chapter 238 - Chapter 238: 238 Are You Stupid? (Third Update, Asking For Monthly Tickets)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 238 - Chapter 238: 238 Are You Stupid? (Third Update, Asking For Monthly Tickets)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 238: 238 Are you stupid? (Third update, asking for monthly tickets)<br/><br/>Translator: 549690339<br/><br/>“Gu Yang!”<br/><br/>Incredibly, Shen Guang, although sliced in half, was not dead, and there wasn’t even any blood flowing from his wounds.<br/><br/>He was still clutching his divine weapon in his hand and spoke with extreme rage, “Damn it, you actually dare to hurt me!”<br/><br/>“If it weren’t for Gao Mingze mediating, I would have already marched into the Divine City to kill you…”<br/><br/>Gu Yang was surprised to see that after suffering such a fatal injury, Shen Guang was still alright, his vitality was comparable to that of a cockroach.<br/><br/>This also confirmed his speculation, the cultivation technique practiced by the Shen family was problematic, and when one reached the Mana realm, they became an inhuman existence.<br/><br/>Gao Mingze?<br/><br/>It turned out that he was the man Princess Chang entrusted to negotiate with the Shen family. If his surname was Gao, he must be from the Gao family.<br/><br/>Princess Chang actually had a relationship with the Gao family.<br/><br/>Gu Yang locked his gaze on him and said indifferently, “You shouldn’t have laid hands on her.”<br/><br/>Shen Guang looked at him as if he was a lunatic and said angrily, “All for this woman? A woman who is about to get married? Are you ready to make an enemy of my Shen family?”<br/><br/>One always needs a reason to kill.<br/><br/>Gu Yang muttered to himself, raised the Phoenix Feather Knife and crimson flames coiled around the blade.<br/><br/>He asked the final question, “Why did you want to kill her?”<br/><br/>The world darkened.<br/><br/>Shen Guang’s furious complexion was just to bide for time.<br/><br/>That strike almost cost him his life and caused great damage.<br/><br/>Biding his time, he finally recovered some strength and used the Taiyou Moon Devouring Technique to merge into the darkness and made a desperate attempt to escape.<br/><br/>The few people at the scene saw a ball of flame rising, completely dispelling the darkness. Shen Guang’s bisected body was quickly turned to ashes in the flames.<br/><br/>It was the first time Chu Xiyue and Chu Yinxing had witnessed the Saber Technique: God Destroyer. Its devastating power shook them to their core and they could hardly control themselves.<br/><br/>Lu Yunshan, who was seriously wounded by Shen Guang’s ambush, was also shocked as he watched the young man easily kill Shen Guang with overwhelming strength in just two moves.<br/><br/>The Shen family’s Taiyou Moon Devouring Technique was extremely tricky, never directly confronting the enemy, always opting for sneak attacks and fleeing when outmatched. Their speed was astonishingly quick and very hard to keep up with.<br/><br/>Often times, even with a superior cultivation level, one couldn’t handle the people from Shen family.<br/><br/>Yet this young man easily killed Shen Guang.<br/><br/>If it were him, could he have blocked those two strikes?<br/><br/>When Lu Yunshan thought of this, his heart filled with bitterness. He had no chance of winning the Seven Lives Heavenly Pill even if Shen Guang was not here. There was no chance of winning from the beginning.<br/><br/>At this moment, the young man seized the divine weapon left on the battlefield, turned his head and looked at Lu Yunshan, saying, “Give me a reason not to kill you.”<br/><br/>Lu Yunshan looked up and saw the murderous intent teeming in his eyes but forcefully restrained.<br/><br/>An intuition struck him. This man seemed to be looking for a legitimate reason to kill him.<br/><br/>In an instant, an idea flashed in his mind. He took something out of his bosom and said, “This is the key to the Cold Palace. How about using it to exchange for my life?”<br/><br/>The man, known as Gu Yang, stared at the key in his hand for a few seconds.<br/><br/>Those were the most agonizing seconds of Lu Yunshan’s life. Life and death hinged on a single thought from the other party.<br/><br/>Even if Gu Yang took his possessions and still killed him, he would be helpless.<br/><br/>“Deal.”<br/><br/>In reality, Gu Yang was pondering, what was the Cold Palace? Was it on the moon?<br/><br/>He was just trying to find a reason to kill Lu Yunshan.<br/><br/>They had no grudges against each other and his cultivation was on the Righteous Path. Killing him for his actions towards Chu Xiyue seemed a bit excessive.<br/><br/>He was already miserable enough, losing his elixir and his divine weapon while being severely injured himself.<br/><br/>Gu Yang couldn’t help but feel compassionate, so after taking the jade pendant, he let Lu Yunshan leave.<br/><br/>After Lu Yunshan flew a long distance away, he suddenly sent a voice message, “There is a Demon Saint guarding the Cold Palace.” Saying this, he disappeared into thin air.<br/><br/>A Demon Saint was a Celestial Being realm powerhouse of the Monster Race.<br/><br/>Watching Lu Yunshan’s departing figure, Gu Yang thought that he was actually quite a good person.<br/><br/>“Gu Yang-”<br/><br/>Chu Xiyue walked up to him, about to ask why he was here.<br/><br/>“Father.”<br/><br/>Suddenly, a silhouette descended from the sky, landing next to Gu Yang.<br/><br/>Father?<br/><br/>This address made Chu Xiyue momentarily frozen.<br/><br/>She looked at the girl in front of her, who was probably about sixteen or seventeen, incredibly beautiful, with an innate nobility about her.<br/><br/>What shocked her even more was this girl’s cultivation level, it was unfathomably deep, shockingly akin to Divine Power realm.<br/><br/>When did such a figure emerge from Great Zhou?<br/><br/>Seeing her reaction, Gu Yang didn’t know how to explain either. All he could say was, “This is not the place to talk, let’s go.”<br/><br/>This was Luo family’s territory. Such a big incident had occurred, the Luo family would definitely respond.<br/><br/>It would be better to slip away quickly.<br/><br/>On the other side, in a private room of the restaurant.<br/><br/>Tian Zheyu was still immersed in shock, mumbling, “Master Shen, is there really someone in this world who can cross from First Rank to Mana realm in just three months?”<br/><br/>Master Shen was staring in the direction where Gu Yang had left, saying, “Isn’t there a living example right in front of us?”<br/><br/>Tian Zheyu asked uncertainly, “How did he do it?”<br/><br/>“In this world, there are always people who can’t be measured by conventional wisdom. Lin Tianyi, the Dean of the Literature Academy, Luo Wang aren’t they the same? This world clearly can’t produce strong people of the Celestial Being realm, yet they have achieved it.”<br/><br/>“Qin Wu, who nearly overturned the Great Zhou royal family single-handedly. Another Gu Yang, what’s so surprising about it?”<br/><br/>The truth was right, but Tian Zheyu still found it hard to accept.<br/><br/>After a long while, he calmed himself down and recalled a matter, “Why did Shen Guang want to kill Chu Xiyue?”<br/><br/>Chu Xiyue was nothing more than First Rank. The Shen family had actually sent a Mana Realm assassin to kill her. This was too unusual.<br/><br/>Master Shen said, “Many years ago, Shen Zhou was defeated by Qin Wu several times and has always seen him as an enemy. This alliance between Qin and Chu is said to have been personally instructed by Qin Wu.”<br/><br/>“Someone like Qin Wu would never meddle in the marriage of his descendants for no reason. He also used the Bright Moon Sabre, such a divine weapon, as a dowry. He must have a purpose.”<br/><br/>“Perhaps, Shen Zhou guessed Qin Wu’s plot and resolved to offend the Chu family, just to kill Chu Xiyue.”<br/><br/>Tian Zheyu knew that Shen Zhou was the most outstanding figure under the ancestor of the Shen family and was expected to reach the Unleaking realm.<br/><br/>Because the ancestor of the Shen family had always been in seclusion, Shen Zhou was actually the one making decisions for the Shen family.<br/><br/>And Qin Wu, was already at the peak of the Unleaking realm, what he was plotting was likely to breakthrough to the Celestial Being realm.<br/><br/>Once Qin Wu breaks through to the Celestial Being realm, who could stop him?<br/><br/>When Tian Zheyu thought of this, he couldn’t help but feel worried. The Barbarians of the grasslands were already gearing up for action, coupled with a Qin Wu who had always wanted to overthrow Great Zhou, it seemed there would be chaos in the world.<br/><br/>Daybreak.<br/><br/>Gu Yang and Xi Huang, along with three women from the Chu family, finally crossed Qi Province and entered the territory of Zhongzhou.<br/><br/>They found a place where Gu Yang helped Chu Mei dissipate the sword energy in her body. It was a meticulous task, and it took him half a day to finish.<br/><br/>“Thank you. It’s fortunate you were there.”<br/><br/>Chu Xiyue finally found an opportunity to thank Gu Yang.<br/><br/>Gu Yang laughed, “It was just a coincidental encounter.”<br/><br/>“Here, take this.” Chu Xiyue handed over a red box.<br/><br/>“What is this?”<br/><br/>On the box, there was a charm pasted, the force of its prohibition wasn’t completely dissipated.<br/><br/>Nowadays, the art of rune was long lost. The item either came from an ancient dwelling left from antiquity or from a cave heaven world.<br/><br/>Chu Xiyue said, “This is the Seven Lives Restoration Pill. It can prolong life by three hundred years. If it hadn’t been for you, this item would have been taken by the Shen family. It should belong to you.”<br/><br/>Gu Yang was stunned. A divine pill that could extend life by three hundred years, she was just giving it to him?<br/><br/>He looked at the woman in front of him and wanted to ask, are you a fool?<br/><br/>Even if she didn’t mention this matter, surely he wouldn’t tried to claim it from her, would he?<br/><br/>PS: As usual, asking for monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}