{"id": 230, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132061.html", "title": "Chapter 230 - Chapter 230: 230 Corpses", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 230 - Chapter 230: 230 Corpses</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 230: 230 corpses<br/><br/>Translator: 549690339<br/><br/>Gu Yang quietly opened the system, and a prompt appeared before his eyes.<br/><br/>[Simulation ended. You may keep one of the following items.]<br/><br/>He hadn’t claimed the reward from the end of the last simulation. Only after claiming it will he be able to initiate a new simulation.<br/><br/>“Choose two.”<br/><br/>Suddenly, he had memories of three more battles in his mind.<br/><br/>Suddenly, the elder walking ahead turned around, looking at him with a somewhat doubtful look in his eyes.<br/><br/>Gu Yang asked, “Senior, what’s wrong?”<br/><br/>The elder looked around once more, shook his head and said, “Be careful, something’s off here.”<br/><br/>“Oh.”<br/><br/>Gu Yang’s heart finally relaxed. He thought his secret had been discovered.<br/><br/>He didn’t have time to process those battle experiences and directly initiated a new simulation.<br/><br/>[At the age of twenty-two, you have already reached the Golden Body Third Layer. You travel to the Yellow Springs Hollow Void and encounter a mysterious old man.]<br/><br/>[You follow the mysterious old man to a secret area. After you fend off a group of Blood Bats, the old man answers a question for you then disappears.]<br/><br/>[You and Xi Huang leave the Yellow Springs Hollow Void…]<br/><br/>[You head to the secret realm of Tianzhu Mountain and immerse yourselves in intense cultivation.]<br/><br/>[Nine years later, you leave the secret realm and head to Divine City. You go to the Literature Academy, enter the Water Moon Hollow Void. Soon after, people from the Ancient River Sword Sect come looking for trouble, and are killed by Xi Huang.]<br/><br/>[Three years later, a Celestial Being takes action. Xi Huang is defeated and suppressed. Everyone is killed in the battle, dying at the age of thirty-four.]<br/><br/>Having seen the result of this simulation, Gu Yang could finally relax. There was no imminent danger this time.<br/><br/>However, in the end, the old man didn’t give him anything. He merely answered a question for him.<br/><br/>He had thought that he could use the simulator to receive benefits repeatedly.<br/><br/>It turned out, he was overthinking.<br/><br/>The memories from the simulation cannot be brought back.<br/><br/>Gu Yang put all these messy thoughts aside and began to think about what question to ask next.<br/><br/>He was filled with doubts, so which one should he ask?<br/><br/>Finally, the elder leading the way stopped and said, “In a moment, we will encounter a swarm of Blood Bats. The Phoenix is their natural enemy. Just chase them away.”<br/><br/>Gu Yang replied, “Alright.”<br/><br/>The elder waved his hand down, and a whirlpool appeared on the ground.<br/><br/>“Let’s go.”<br/><br/>He was the first to jump in.<br/><br/>Gu Yang, holding Xi Huang, jumped in as well.<br/><br/>As they continuously fell downwards, everything around them was pitch-black. There was no light at all, and even his senses ceased to function,<br/><br/>He couldn’t sense the old man’s presence. He couldn’t even sense Xi Huang, who was so close to him.<br/><br/>Only the hand gripping his tightly let him know she was right beside him.<br/><br/>After what felt like an eternity, Gu Yang saw a flash of light, and all his senses returned.<br/><br/>He turned his head to look at Xi Huang. Seeing that her face was a little pale, it was clear that she had been startled.<br/><br/>He patted her hand to comfort her.<br/><br/>Then, he started to survey their surroundings.<br/><br/>This was a vast space with bare rock walls on both sides, giving the impression they were underground.<br/><br/>The air was dry, and the temperature was very high, probably seventy to eighty degrees.<br/><br/>Just as he was thinking, a blood-red shadow appeared from the end of his sightline. Behind it, a large group of blood-red shadows.<br/><br/>Blood Bats!<br/><br/>“Mana realm!”<br/><br/>Gu Yang was taken aback.<br/><br/>Those Blood Bats surprisingly possessed Mana realm level cultivation. There were at least a hundred of them in the swarm. When they gathered together, it produced a terrifying fluctuation.<br/><br/>Gu Yang did not dare to neglect. He activated the “Divine Phoenix Manual”, transforming himself into a Phoenix.<br/><br/>Instantaneously, a blazing red flame lit up the entire space, bringing a holy and bright atmosphere.<br/><br/>The swarm of Blood Bats in the distance entered a huge turmoil. They fled with a speed much faster than when they had arrived, disappearing in the blink of an eye.<br/><br/>Gu Yang returned to his human form and said, “Mission accomplished.”<br/><br/>The elder stroked his beard, speaking with satisfaction, “Not bad. I currently have no possessions to give. As it is, I can answer a question in your mind.”<br/><br/>After a moment’s thought, Gu Yang asked, “How should I go about dealing with the one in the Red Bright Heavens?”<br/><br/>The old man shook his head and said, “Without reaching the Celestial Being realm, you can’t possibly be its match.”<br/><br/>“To annihilate it, you must first destroy Red Sun. However, without reaching the Hollow Void realm, don’t even think about it.”<br/><br/>“There’s one way, if you could get the Human Emperor Sword, you could restrain it. Back then, it was severely injured under the Human Emperor Sword.”<br/><br/>“Also, it planted a coordinate in you. No matter where you run, you can’t escape its tracking. If you want to get rid of it, you can go to the College of Divine City and learn the sword technique of that Celestial Being, which can sever that connection.”<br/><br/>“It wouldn’t easily leave Red Sun with its main body. It can only project its power into the Human Realm through transformations. Once all its transformations are severed, it couldn’t project its power anymore.”<br/><br/>After finishing his words, the old man’s figure disappeared on the spot.<br/><br/>“Young man, walk up and you can leave here. Let’s meet again if we’re destined.”<br/><br/>A coordinate?<br/><br/>Gu Yang was shocked, recalling the terrifying will he sensed when he had used the last move of the “God Destroyer Nine Styles”.<br/><br/>Presumably, the coordinate planted on him was also planted at that time.<br/><br/>No wonder in these simulations, even when he hid in the Secret Realm of Tianzhu Mountain, he would be discovered by the one from Red Sun.<br/><br/>This information is all extremely valuable.<br/><br/>He finally understood a bit about that one from Red Sun.<br/><br/>He also knew how to deal with it now.<br/><br/>Once he kills all its transformations in the Human Realm, it would become a toothless tiger.<br/><br/>The method it uses to project transformations should be similar to the techniques of “God Destroyer Nine Styles” and “Heavenly Elemental God Slaying Art”.<br/><br/>From what he knew, the Wu family that had already been destroyed.<br/><br/>The Gao family, Cao family, the Red Venerate sect, and the Heavenly Extreme Taoist.<br/><br/>Including two of the nine great families, one of the six major factions. And an old monster that is still alive after death.<br/><br/>Such power, it’s absurdly strong.<br/><br/>It’s hard to say whether there are other transformations hiding in the dark.<br/><br/>Gu Yang felt the responsibility was heavy and the road was long.<br/><br/>It seems that the first step is to go to the College, learn the dean’s sword technique, and sever the coordinate on him.<br/><br/>Then, figure out a way to get the Human Emperor Sword.<br/><br/>Once he has enough power, he will destroy those families. To cut off the tentacles of that one from Red Sun reaching into the Human Realm.<br/><br/>Gu Yang had made up his mind and said to Xi Huang, “Let’s go.”<br/><br/>Xi Huang, however, didn’t move. She pointed to the other side and said, “Father, I feel something is calling me over there.”<br/><br/>Gu Yang looked in the direction she was pointing, which was going down. He didn’t feel anything.<br/><br/>But, he knew her, if it wasn’t something very important, she wouldn’t have said it. Hence, he said, “Let’s go and see.”<br/><br/>Gu Yang and her went down all the way and walked for half an hour.<br/><br/>The temperature in the air kept getting higher, but it didn’t hinder them at all.<br/><br/>This place seemed like an underground cave, with countless diverging openings.<br/><br/>Xi Huang suddenly turned to a narrow passage. The further inside, the narrower it got. At the end, only one person could pass.<br/><br/>Her speed also kept getting faster.<br/><br/>Finally, she stopped.<br/><br/>It was the end, on the ground was a corpse. At first glance, it was the corpse of a monster, but it had a human hand.<br/><br/>Clearly, it was a cultivator who had lost control and transformed into a monster. No one knows how he died here.<br/><br/>In that hand, a jade pendant was gripped, emitting a hazy white light.<br/><br/>Xi Huang extended her hand and took the jade pendant, saying somewhat sorrowfully, “This is the Divine Heart Pendant, the treasure of the Luo Family. Every heir of the Luo Family would have their wisdom unlocked with the Divine Heart Pendant by the clan leader when they turned one. I never expected to find it here.”<br/><br/>It turned out to be the treasure of the Luo Family, no wonder she was summoned.<br/><br/>Looking at it, it’s at least a Spirit Tool.<br/><br/>I wonder how many units of energy it’s worth…<br/><br/>Gu Yang quickly abandoned this thought, turning to look at the corpse, “Is he your… ” he suddenly choked on his words, unsure of how to refer to her relationship with the strong Unleaking realm expert from the Luo Family.<br/><br/>In terms of seniority, she was possibly the highest in the Luo Family. Everyone in the Luo Family would at least have to call her great-aunt, right? Any higher level and he wouldn’t know how to address her.<br/><br/>Xi Huang shook her head, “He’s not.”<br/><br/>“Anyway, we can’t let his body be thrown away here.” Gu Yang stepped forward, placing his hand on the corpse.<br/><br/>[Energy source detected, recharge?]<br/><br/>“Yes.”<br/><br/>[Recharge successful, 25 units of energy acquired.]<br/><br/>PS: Back from grave-sweeping, that’s why it’s late. There’ll still be two chapters tonight as usual, begging for monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}