{"id": 237, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132075.html", "title": "Chapter 237 - Chapter 237: 237 Made A Move", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 237 - Chapter 237: 237 Made A Move</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 237: 237 Made a Move<br/><br/>Translator: 549690339<br/><br/>“Shen Guang!”<br/><br/>Lu Yunshan emitted a deafening cry, filled with extreme fury and resentment.<br/><br/>He never expected that he would be ambushed, receiving severe injuries; not to mention that the unparalleled divine weapon he had just acquired was also taken away.<br/><br/>The man who ambushed him was someone he recognized: named Shen Guang, originated from the Shen Family, and was from his generation.<br/><br/>Back then, he was ranked first on the Prodigious List, and Shen Guang was second.<br/><br/>Later on, he became the top of the First Rank List, and Shen Guang was still second.<br/><br/>The two of them had never crossed blades, but they had met face-to-face once.<br/><br/>In the end, it was Shen Guang, the one he had always overshadowed, who delivered a fatal blow at a critical moment, leading to his complete downfall.<br/><br/>His heart was filled with hatred.<br/><br/>If it had been a fair fight, Shen Guang might not have been his match.<br/><br/>Shen Guang had already gripped the sword in his hand, the blade itself was still buzzing, seemingly trying to free itself from his grasp.<br/><br/>A mass of dark mana enveloped the blade, suppressing it.<br/><br/>At this moment, he revealed his figure: a thin physique with skin so pale it was abnormal, and a pair of bloody red pupils.<br/><br/>There was an evil smile on his face, “Lu Yunshan, back then, you constantly overshadowed me. Did you ever think that one day, you would fall at my hands…”<br/><br/>“Ha, ha, ha…”<br/><br/>Shen Guang burst out into an uncontrollable laughter, delighting in his triumph.<br/><br/>Back then, if he wasn’t cautious of Lu Yunshan’s background, he would have long wanted to kill this man who was always overshadowing him.<br/><br/>Until today, he had finally avenged the grudge in his heart.<br/><br/>Having eliminated his enemy, and obtaining a peerless divine weapon, of course, he had every reason to celebrate.<br/><br/>“Shen Guang?”<br/><br/>From a not-so-distant tavern, Tian Zheyu instinctively glanced at Elder Shen, who was squinting his eyes as if asleep.<br/><br/>However, having spent years in his company, Tian Zheyu could instantly tell that he was faking it.<br/><br/>In the Red Mansion, Tian Zheyu was aware of every inspector’s background. Only Elder Shen’s record was completely blank. Even he couldn’t find any trace of Elder Shen’s origin.<br/><br/>Elder Shen’s surname was Shen. Naturally, the most probable explanation was that he came from the Shen Family.<br/><br/>Before this, Tian Zheyu always felt that it couldn’t be that simple.<br/><br/>Now it seems, it is highly possible that he belongs to the Shen Family.<br/><br/>Taking into account the Shen Family’s harsh mechanism of fostering successors, it was quite normal for someone to flee.<br/><br/>Based on the time Elder Shen entered the Red Mansion, he was likely of the same generation as Shen Guang.<br/><br/>Upon realizing this, Tian Zheyu became restless, “Elder Shen, perhaps, we should leave first.”<br/><br/>If Shen Guang found Elder Shen, there was bound to be a fight to the death.<br/><br/>However, Elder Shen only shook his head, appearing completely unaffected.<br/><br/>Tian Zheyu had a load of questions, but didn’t ask knowing it would be of no use.<br/><br/>On the other side, Chu Mei, under Lu Yunshan’s sword, had her short sword split in half. A deep wound was on her chest where blood was gushing out.<br/><br/>That blow had almost cut her in half.<br/><br/>Chu Xiyue and Chu Yinxing were originally planning to escape during the chaos, but such an unexpected change occurred.<br/><br/>Though Lu Yunshan was severely injured from the ambush, the mana barrier in the courtyard was still present due to Shen Guang’s intervention.<br/><br/>Not only did Shen Guang trap Lu Yunshan, but he also trapped all three of them inside.<br/><br/>“Grandma!”<br/><br/>Chu Xiyue went to inspect Chu Mei’s injuries. As soon as her hand reached out, she felt a sharp pain. The residual Blade Intent nearly severed her fingertip.<br/><br/>This was the terrifying power of a mana realm expert. The mana residue in the wound was extremely difficult to eliminate.<br/><br/>Currently, Chu Mei was using all of her remaining mana to resist the Blade Intent. She could not even utter a word, let alone move.<br/><br/>Her injuries were severe. If they did not return to treat it promptly, it could potentially damage her vitality.<br/><br/>With this in mind, Chu Xiyue could no longer sit still. She looked up at Shen Guang, still laughing uproariously, and shouted, “Senior Shen, this feud is between you and Lu Yushan, please let us leave.”<br/><br/>Upon hearing her words, Shen Guang finally paused and looked down at her. A hint of mockery showed in his red eyes, “I’m curious, what exactly did you take from Lu Yushan? That he chased you all the way to Luo Family’s territory? That Chu Mei was willing to risk her life?”<br/><br/>“It’s just a technique scroll.”<br/><br/>Chu Xiyue said, “The Shen Family and Chu Family both belong to one of the nine great families. Sharing this technique with you all is no harm. However, my grandma is seriously injured, she needs to return for treatment immediately.”<br/><br/>“Liar,” Shen Guang said coldly, “Fine, if I kill you, I can naturally search it.”<br/><br/>Chu Xiyue could feel the killer intent coming from her opponent, her heart sank and she coldly replied, “Dare you kill me? Are you trying to provoke a full-scale war between our two families?”<br/><br/>Over the past thousand years, an unwritten rule has been established among the nine grand families: The strong shall not bully the weak.<br/><br/>Within the same realm, any disputes that cause one to be defeated or even killed, should not provoke revenge.<br/><br/>However, retaliation would be inevitable if the strong resort to bullying the weak.<br/><br/>Eventually, these disputes often escalate into wars between two grand families.<br/><br/>Such incidents have happened before. The outcome usually sees both sides left wounded and weakened.<br/><br/>Though the Chu Family might have declined somewhat, even a powerful family like the Qin Family wouldn’t dare to annihilate them. How could they sit back and allow themselves to be bullied?<br/><br/>A sinister smile flashed across Shen Guang’s face, “I’ll make it clear to you; my sole purpose of this trip is to kill you. As long as all of you are dead, people will only assume that Lu Yunshan was behind it.”<br/><br/>“What?”<br/><br/>Chu Xiyue was greatly shocked.<br/><br/>Shen Guang had successfully suppressed the defiance of the divine weapon in his hand, aiming it at Chu Xiyue.<br/><br/>He had spent all this time waiting for this moment to fully subdue the divine weapon.<br/><br/>If he was to frame Lu Yunshan, naturally, he could not use the Shen Family’s techniques.<br/><br/>This attack was Lu Yunshan’s signature sword technique, and even though he had only mastered the basics, it was more than enough to kill a First Rank warrior.<br/><br/>“Who do you wish to kill?”<br/><br/>Just then, a cold voice rang out from above. The barrier of mana was shattered.<br/><br/>An intimidating blade intent came sweeping from behind!<br/><br/>“The Mana Realm!”<br/><br/>Shen Guang felt a chill up his back. In a blink of an eye, he has disappeared into the darkness.<br/><br/>Chu Xiyue, who was locked down by the sword intent, faced a powerful figure from the Mana Realm and thought she was surely doomed.<br/><br/>When she heard the familiar voice next to her ears, her mind buzzed. She looked up and saw the familiar figure, staring at him in a daze.<br/><br/>“Gu Yang?”<br/><br/>Chu Yinxing, who was beside her, was shocked to see the man.<br/><br/>She never expected to reunite with Gu Yang under such circumstances.<br/><br/>For the past six months, no matter where she and Chu Xiyue traveled, they could always hear legends about him, from slaying the Golden Body as a First Rank, to breaking through to the Golden Body, and then to the first, second, third layer of the Golden Body …<br/><br/>His cultivation progress was unbelievably fast.<br/><br/>She had her doubts, suspecting these were just exaggerated claims and rumors. However, when multiple sources from other families also validated the claims, she had to believe.<br/><br/>Now, seeing with her own eyes how he forced Shen Guang – a powerful figure from the Mana Realm – to retreat, she realised the heights this man had reached.<br/><br/>Suddenly, she remembered something, and her face changed.<br/><br/>Gu Yang was only at the third layer of the Golden Body, how could he possibly be a match for Shen Guang?<br/><br/>Chu Xiyue next to her also came to this realization and said urgently, “Run, he’s in the Mana Realm, you’re not his match…”<br/><br/>Gu Yang in the sky, looked down at her, gave her a faint smile, and his Phoenix Feather Knife started to glow.<br/><br/>Anenergy that was more potent than Lu Yunshan’s just now, suddenly erupted from Gu Yang.<br/><br/>Then, the Phoenix Feather Knife whistled through the air, slashing in a certain direction.<br/><br/>Sky-questioning Nine Slashes, the third move, Power Devours the Universe!<br/><br/>“Ah”<br/><br/>In the next moment, accompanied by a scream, a figure staggered out of the darkness. It was Shen Guang, who was now slashed in half.<br/><br/>Chu Xiyue and Chu Yinxing were bewildered.<br/><br/>Shen Guang, who was in the Mana Realm, had been cut in half by Gu Yang in one blow?<br/><br/>“What?”<br/><br/>At the other end, in a private room at the tavern, Tian Zheyu could not believe what he saw and almost jumped out of his seat.<br/><br/>When this man initially appeared, he was clueless about his identity until Chu Yinxing called out the name ‘Gu Yang’.<br/><br/>He then realized that the man was none other than the most talked about prodigy of their time.<br/><br/>Even in the grasslands, he had heard rumors about Gu Yang.<br/><br/>As he often corresponded with the Red Mansion, he was well-informed about Gu Yang’s exploits.<br/><br/>However, the strength Gu Yang was displaying, was undoubtedly of the Mana Realm.<br/><br/>“When did he manage to break through to the Mana Realm?”\t\t\t\t\t\t</div>", "images": {}, "success": true}