{"id": 239, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132080.html", "title": "Chapter 239 - Chapter 239: 239 Potential Dangers", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 239 - Chapter 239: 239 Potential Dangers</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 239: 239 Potential Dangers<br/><br/>The problem is, this thing, is of no use to Gu Yang.<br/><br/>He has conducted simulations for at least hundreds of times, and only once did he pass away of old age, which was when his cultivation level was extremely low.<br/><br/>Now, he could say he has enemies all over the world. If he wants to live until the end of his natural life span, he must be invincible in this world.<br/><br/>If so, he would at least be at the Celestial Being realm, possessing a life span of thousands of years.<br/><br/>By the time his strength reaches that level, whether or not this longevity elixir will still be useful is a question mark.<br/><br/>Gu Yang opened the system, took a look at the remaining balance, and there were only forty-eight energy units left.<br/><br/>After killing Shen Guang just now, he gained twenty energy units.<br/><br/>Shen Guang’s remaining glove provided him with ten energy units after recharging.<br/><br/>Now, it can be confirmed that killing a first-stage mana cultivator provides ten energy units, and a second-stage mana cultivator provides twenty.<br/><br/>As for the sword, he kept it.<br/><br/>Peerless divine weapons are extremely rare and charging with them is too wasteful.<br/><br/>Last time, he recharged using the God-Slaying Knife and only obtained twenty energy units. Even if this sword is of a higher level than the average divine weapon, it can at most generate dozens of energy units.<br/><br/>It would be better to save it for Xi Huang to use. Once her strength is fully restored with the added power of this sword, she could challenge those from the Unleaking Realm.<br/><br/>“Do you want to use the Life Simulator? It consumes ten units of energy for each use.”<br/><br/>“Yes.”<br/><br/>No matter what, this is a divine pill passed down from ancient times. Maybe it has some special effects.<br/><br/>Gu Yang decided to give it a try.<br/><br/>“At twenty-two years old, you are a first-stage mana cultivator. You killed Shen Guang, a second-stage mana cultivator, in Mountain Terrace City and obtained the divine weapon, the Wanshu Sword. You rescued Gu Xiyue.”<br/><br/>“Gu Xiyue gave you the Seven Lives Tonic Pill. You both separated, and you headed to the secret realm of Tianzhu Mountain. After taking the pill and assimilating its power…”<br/><br/>“Two years later, a powerful original spirit was born in your body, forcefully seizing your body. You died at the age of twenty-four.”<br/><br/>Seizure?<br/><br/>Looking at the box in front of him, Gu Yang’s face suddenly changed.<br/><br/>He cultivated mana and had trained the fifth layer of the “God Refining Chapter” of the Nine Heavens Divine Method. His original spirit was at least five times stronger than those of other mana cultivators, yet it was easily seized.<br/><br/>Clearly, a terrifyingly powerful old monster was hidden within this Seven Lives Tonic Pill.<br/><br/>When he first took the elixir, he didn’t notice anything unusual, and it was hidden in his body until it erupted two years later, suddenly seizing his body.<br/><br/>That old monster was almost certainly at the Celestial Being realm.<br/><br/>“What’s wrong?”<br/><br/>Seeing Gu Yang’s facial expression change drastically into one of extreme vigilance, Chu Xiyue hurriedly asked.<br/><br/>Gu Yang responded, “Let her hold on to this for now. Come with me, I have something to tell you.”<br/><br/>Seeing his solemn demeanor, Chu Xiyue knew he must have discovered something. She handed the box containing the Seven Lives Tonic Pill to her aunt. Then, she followed Gu Yang outside.<br/><br/>They didn’t stop until they were a few kilometers away.<br/><br/>Gu Yang then set up two layers of mana barriers to prevent their conversation from being heard before he said, “There’s something wrong with the Seven Lives Tonic Pill.”<br/><br/>“What?”<br/><br/>Chu Xiyue’s face changed, “Could it be…is the pill fake?”<br/><br/>“The pill might not be fake. Just that, there’s an original spirit hidden inside, once you take it, that spirit will seize the body without the person knowing.”<br/><br/>Chu Xiyue gasped, realizing the danger. Previously, she planned to offer the pill to her ancestor. Imagine if her ancestor didn’t detect the problem with the pill and took it…<br/><br/>If something were to happen to the ancestor, it would be a catastrophic blow to the Chu Family.<br/><br/>She’d be beyond redemption.<br/><br/>Fortunately, she brought the pill to Gu Yang for inspection, and he discovered the problem in time. Otherwise, the consequences would be unimaginable.<br/><br/>Gu Yang said, “Take the pill back, maybe your ancestor knows how to remove the hidden original spirit within.”<br/><br/>“I understand now.”<br/><br/>Chu Xiyue nodded, looking at him with a softer gaze, “This time, we really have you to thank.”<br/><br/>After a while, when Gu Yang returned to the cave, Chu Mei had already woken up and expressed her gratitude, “Words can’t express my gratitude for the great favor you’ve done. If you ever need my help in the future, I will face any hardships required.”<br/><br/>Gu Yang modestly replied, “Senior, you’re over-praising me. By the way, have you ever heard of Guanghan Immortal Palace?”<br/><br/>“I dare not accept the title of ‘senior’.”<br/><br/>Chu Mei did not dare to act presumptiously. In Great Zhou, it was always ‘the victor is the king’, unless they were from the same family or sect. Seniority was determined by the cultivation level.<br/><br/>Gu Yang’s realm was the same as hers, and his strength exceeded hers by far. Judging their relationship by peers, she was already reaching high. How could she regard him as a junior?<br/><br/>“Guanghan Immortal Palace, I once read about it in an ancient book. In ancient times, there were three great immortal palaces: Taiyi Immortal Palace, Guanghan Immortal Palace, and Yao Chi Immortal Palace.”<br/><br/>“The master of Guanghan Immortal Palace was the Lady of the Moon, one of the most powerful beings in ancient times.”<br/><br/>Gu Yang was very curious about the matter of ancient times and asked, “It is said that there were numerous strong people in the ancient times, and there were beings superior to Celestial Beings. Where did those great powers of the ancient times go?”<br/><br/>Chu Mei shook her head and said, “Only a few records have been passed down from ancient times, there are only fragments of information about that era left. As to what happened in ancient times that caused all these great powers to disappear, even my family’s ancestor doesn’t know.”<br/><br/>“One can only guess that there must have been a tremendous catastrophe that caused countless great powers to fall. The rules of this world have changed, and the Way of Heaven has died. Afterwards, martial arts rose, but this world could no longer give birth to Celestial Beings.”<br/><br/>Chu Mei was articulate and exhaustive.<br/><br/>Gu Yang took the opportunity to ask her many questions and gained a great deal of knowledge.<br/><br/>Not until nightfall did he and Chu Xiyue part ways. He left with Xi Huang.<br/><br/>According to previous simulations, a practitioner from the Qin Family with a third-tier mana cultivation would arrive to assist them soon; he didn’t want to have any contact with members of the Qin Family.<br/><br/>As for how Chu Xiyue would deal with the elixir, he wasn’t concerned. After all, he wasn’t going to carry such a dangerous thing with him.<br/><br/>Two days later, a carriage slowly traveled along the official road towards Zhongzhou City.<br/><br/>In the carriage were Gu Yang and Xi Huang.<br/><br/>These two days, he had been organizing the knowledge he had gained during this period of time.<br/><br/>Starting from the fight in the Imperial Palace, he had been rushing without stop, with various incidents happening successively, leaving him no time to breathe.<br/><br/>After bidding farewell to Chu Xiyue, he was finally able to slow down and reflect.<br/><br/>After breaking through to the Mana realm, he felt a bit more confident due to the most imminent danger of being chased by the Lord of the State, owner of the Guangzheng Sword.<br/><br/>Now that the Phoenix Feather Knife had been unsealed, even if he came across the Lord of the State, it would be possible for him to escape, even if he couldn’t win. The Lord of the State was only in the Mana realm and still wounded.<br/><br/>The other danger, the one from Red Venerate Heaven, wasn’t too worrisome either since he was in a different world. It wouldn’t be easy for him to cross over just to kill Gu Yang.<br/><br/>As long as a Celestial Being wasn’t personally pursuing him, he still had hope of escaping.<br/><br/>That day, he had run 25 simulations in one go. Besides making a breakthrough in his realm, he also made other gains.<br/><br/>The “Divine Phoenix Manual”, “Divine Ape Technique”, Divine Tiger Manual, and Divine Turtle Manual of the “Nine Heavens Divine Method” had all reached the fifth level, and even the Divine Dragon Manual had reached the fourth level.<br/><br/>The God Refining Chapter had also reached the fifth level. It should be enough if all five of them break through to the sixth level and conjure avatars.<br/><br/>Now, the question is: Where should he go next?<br/><br/>“I’m suffocating…”<br/><br/>Just then, a familiar voice sounded. A pouch tied around Xi Huang’s waist was moving violently.<br/><br/>With a rustling sound, the cloth bag broke open and a little green bird flew out.<br/><br/>It was the mysterious little green bird they had encountered in the Demon Suppression Tower.<br/><br/>During the last encounter outside the Divine City, it had swallowed the mana of Red Venerates and then fell into a coma.<br/><br/>Gu Yang often encountered enemies and was afraid that he might accidentally crush it to death one day. So, he let Xi Huang carry it. She put it in a bag and hung it around her waist.<br/><br/>“Cui’er, you are finally awake.”<br/><br/>Gu Yang was very happy to see it lively and energetic again. To tell the truth, he had always been worried that it would never wake up.<br/><br/>The little green bird flew onto Gu Yang’s shoulder and with surprise, it said, “Master, you picked up another wench? Why does she have your smell on her? Did you impregnate her?”\t\t\t\t\t\t</div>", "images": {}, "success": true}