{"id": 232, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132065.html", "title": "Chapter 232 - Chapter 232: Doomsday Crisis 232 (Third Update, Seeking Monthly Ticket)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 232 - Chapter 232: Doomsday Crisis 232 (Third Update, Seeking Monthly Ticket)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 232: Doomsday Crisis 232 (Third update, seeking monthly ticket)<br/><br/>Translator: 549690339<br/><br/>Luo Yulong spoke loudly, “Look, they are coming out.”<br/><br/>Seated inside the hut, Luo Yaowu lifted his head to look. His gaze was as sharp as lightning, he coldly ordered, “Go, take those two into custody.”<br/><br/>Luo Yulong sighed bitterly in his heart, not daring to go and risk his life. He said in a low voice, “I…I can’t defeat them.”<br/><br/>“Useless!”<br/><br/>Luo Yaowu looked at him dismissively. His great-nephew had exceptional talent, but he was as timid as a mouse.<br/><br/>If not for this, his achievements would not be so limited.<br/><br/>Once, the Luo Family had high hopes for him, but his performance was disappointingly timid.<br/><br/>Even advancing to the Mana Realm did not give him any courage.<br/><br/>Luo Yaowu rebuked sternly, “This is Tianfang Mountain, our Luo family’s territory. Why are we afraid of a Golden Body Realm individual and another whose Mana Realm has been compromised?”<br/><br/>Luo Yulong, sweating profusely, lowered his head, not daring to reply.<br/><br/>His great-uncle, grew up during the Luo family’s most glorious era. At that time, the Luo family had two Unleaking Realm experts and was on par with the flourishing Wu Family.<br/><br/>He is the direct grandson of the Unleaking Realm expert who got lost in the secret realm. He has always held himself in high esteem.<br/><br/>Later, his grandfather disappeared without a trace.<br/><br/>Without this pinnacle existence, the Luo family slid from its peak and could no longer compete with the Wu family. With the family’s sworn enemy slowly closing in, the Luo family had kept a low profile for two hundred years.<br/><br/>Eighteen years ago, the Luo family did not participate in the battle with the Wu family.<br/><br/>For someone like Luo Yaowu who experienced the Luo family’s most glorious era, he deeply valued the family’s reputation.<br/><br/>“Watch carefully.”<br/><br/>Luo Yaowu raised his hand, and beams of light emerged from the ground, extending upwards before converging together.<br/><br/>It was a prohibition that the Luo family had set up on Tianfang Mountain, named Heaven and Earth Net, and it took two hundred years to establish.<br/><br/>This was a unique formation created by the Luo family. Most ancient formations had become obsolete; few remained functional.<br/><br/>An ancestor of the Luo family created the “Heaven and Earth Net” by combining the few formations still in existence.<br/><br/>The formation was very powerful and could isolate a Mana Realm powerhouse.<br/><br/>The downside was that this formation could only be activated by a Mana Realm power.<br/><br/>As soon as Luo Yaowu made his move, he entrapped the two of them.<br/><br/>He yelled, “Tell me, how did you enter that secret realm? If you tell me, I can spare your lives.”<br/><br/>His goal for guarding this place personally these few days was just that.<br/><br/>As long as he obtained the method to enter the Secret Realm, he could go in, find his grandfather, and make the Luo family glorious again!<br/><br/>Luo Yaowu always believed that with his grandfather’s strength and the two supreme treasures he carried, even facing a Celestial Being, he would be able to come out unharmed.<br/><br/>Therefore, his grandfather must be trapped somewhere or have lost his way out of the Secret Realm.<br/><br/>Just at this moment, another shadow flew out from the void, directly breaking through the Heaven and Earth Net. Its momentum remained undiminished as it flew towards Luo Yaowu.<br/><br/>“What?”<br/><br/>Luo Yaowu was surprised. What was that thing that could escape the Heaven and Earth Net?<br/><br/>Upon closer inspection, the shadow was twisting and quickly transformed into a human head, its face full of resentment and hatred.<br/><br/>In a flash, he felt his head buzzing.<br/><br/>The repression, anger, and resentment he had suppressed over the years exploded like a volcano in his chest, and his eyes instantly turned red.<br/><br/>His originally handsome face became horribly twisted as veins bulged all over.<br/><br/>“Kill!”<br/><br/>Luo Yaowu gripped his sword tightly and slashed towards that human head!<br/><br/>After all, he was a powerhouse at the second layer of the Mana Realm. Despite being influenced, he still retained his rationality.<br/><br/>Dark Yin Sword Technique!<br/><br/>As soon as he made his move, he used the Luo family’s secret technique.<br/><br/>A warrior’s intuition made him sense a great danger. He considered that head a formidable enemy, utilizing all his life’s Mana in this sword strike.<br/><br/>The silent sword strike struck the head squarely.<br/><br/>Under Dark Yin Sword Intent, the opponent’s Mana, and Mortal Body could be effectively sealed.<br/><br/>The next moment, a horrifying realization flashed across Luo Yaowu’s red eyes.<br/><br/>His sword had passed directly through the head, as if he had cut through the air.<br/><br/>“How could this happen?”<br/><br/>Caught off guard and horrified, he tried to retreat to dodge, but it was too late. The head rushed straight into his chest.<br/><br/>Luo Yaowu’s body froze suddenly and began to shake involuntarily. His head drooped, and a hoarse sound came from his throat.<br/><br/>A few yards away, Luo Yulong, who had watched the entire process, was flabbergasted.<br/><br/>One moment, he was elated that his great-uncle had captured Gu Yang, and the next, a monumental calamity had struck.<br/><br/>His great-uncle had been ambushed.<br/><br/>He swallowed hard, and cautiously asked, “Great uncle… are you alright?”<br/><br/>Luo Yaowu did not react.<br/><br/>Instinct told Luo Yulong that something was terribly wrong with his great-uncle. He quietly retreated to put some distance between them. If not for the fear of being punished by his family later, he would have turned tail and run in an instant.<br/><br/>“This is bad.”<br/><br/>Watching the whole process, Gu Yang felt a sudden pang of alarm.<br/><br/>He didn’t expect that the Unleaking Realm creature had come to Great Zhou.<br/><br/>This spelled disaster.<br/><br/>He had firsthand experience of the horror of the creature. The most terrifying thing about it was its infectiousness, which was far worse than any virus.<br/><br/>One monster was a source of infection. If it wasn’t eradicated in time, it wouldn’t take long for it to turn everyone in the world into copies of itself.<br/><br/>The current state of Yellow Springs was the future of this world.<br/><br/>Worse yet, the creature that had come out of the realm was from the Unleaking Realm.<br/><br/>His only consolation was that only a small fraction had followed. Otherwise, he would have no choice but to turn and flee.<br/><br/>The bad news was that the first one to be infected was a powerful practitioner at the second level of the Mana Realm.<br/><br/>In a previous simulation, he and Xi Huang had combined forces. But even then, they were no match for the foe. They barely escaped but were still injured.<br/><br/>Once this person was transformed into a monster, it would be even harder to deal with.<br/><br/>Gu Yang shouted, “If you don’t want the entire Luo Family to be wiped out, go and call for help now.”<br/><br/>Having said that, he ignored Luo Yulong and opened the system.<br/><br/>If he didn’t wipe the creature out on the spot, the entire Luo Family would be infected, beyond redemption.<br/><br/>This was almost certain. The Luo Family was oblivious to the horror of the monstrous creature and wouldn’t take it seriously at first.<br/><br/>By the time they took notice, it would be too late.<br/><br/>The mess he had made, he had to clean up himself.<br/><br/>Otherwise, it wouldn’t be long before this world became like the Yellow Springs. He wouldn’t survive much longer, either.<br/><br/>Sigh, all he wanted was to cultivate in peace. Why was he continuously encountering global catastrophes?<br/><br/>He didn’t want to play the role of world savior, but he ended up being forced into business.<br/><br/>[Do you want to use the Life Simulator? Using it once will consume four energy blocks.]<br/><br/>“Yes.”<br/><br/>[At the age of twenty-two, you have reached level three of the Golden Body. When you left Yellow Springs, a creature escaped and infected Luo Yaowu. You and Xi Huang barely managed to hold it back.]<br/><br/>[At a critical moment, another Mana Realm practitioner from the Luo Family arrived, and seriously injured you and Xi Huang. You both died at the age of twenty-two.]<br/><br/>Sure enough, he couldn’t win.<br/><br/>His current strength enabled him to barely intimidate the Mana Realm practitioners of the Nether Sect, or launch a sneak attack against the strange creature. But against a warrior at the second level of the Mana Realm, his strength was still inadequate.<br/><br/>[Simulation terminated. You may keep one of the following items.]<br/><br/>“I choose two.”<br/><br/>Suddenly, Gu Yang’s mind was filled with the memory of a battle.<br/><br/>Transformed into a monster, Luo Yaowu’s strength increased greatly, but his battle skills deteriorated a lot. That’s why he and Xi Huang could entangle him.<br/><br/>If another Mana Realm practitioner were to help, they might be able to annihilate it.<br/><br/>But would the Luo Family members come to Luo Yaowu’s aid or help him, a stranger?<br/><br/>The answer was obvious.<br/><br/>In the end, he could only rely on himself. It would be good enough if the Luo Family members didn’t drag him down.<br/><br/>Let’s do it again.<br/><br/>[At the age of twenty-two…]<br/><br/>[You took Xi Huang and fled, heading to Tianzhu Mountain Secret Realm to cultivate in seclusion.]<br/><br/>[Five years later, Xi Huang fully recovered her strength. One day, the secret realm collapsed and you two left. You witnessed a great battle between two Celestial Beings and a creature. At a critical moment, a giant head appeared in the sky…]<br/><br/>PS: Begging for monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}