{"id": 236, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132074.html", "title": "Chapter 236 - Chapter 236: 236 Immortal Palace Of The Broad Cold", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 236 - Chapter 236: 236 Immortal Palace Of The Broad Cold</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 236: 236 Immortal Palace of the Broad Cold<br/><br/>Translator: 549690339<br/><br/>Inside the room, Xi Huang sensed a piercing and unrivaled sword intent rising into the sky. Startled, she walked out and asked, “Father, has the Luo Family come after us?”<br/><br/>Gu Yang looked up at a distant tiny figure and patted the Phoenix Feather Knife to calm its restlessness.<br/><br/>After the sword intent appeared, the Phoenix Feather Knife seemed to be stimulated, vibrating on its own as if wanting to compete with its opponent.<br/><br/>He shook his head, “No.”<br/><br/>Xi Huang still felt somewhat worried, “Mountain Terrace City is a stronghold of Qi Province. The appearance of such a powerful figure will not be ignored by the Luo Family. Father, we should leave.”<br/><br/>She wasn’t particularly worried about her father’s safety, as she believed more in Gu Yang’s strength than anyone else.<br/><br/>However, deep down, she didn’t want her father to have a conflict with the Luo Family.<br/><br/>No matter what, she bore half of the Luo Family’s bloodline.<br/><br/>Even though the Luo Family had betrayed her and her mother all those years ago, it’d been over a thousand years now. Those who had betrayed them were probably already turned to dust.<br/><br/>With those people dead, she could let go of her resentment. Although she was reluctant to acknowledge the Luo Family, she still felt a slight kindred warmth.<br/><br/>Gu Yang said, “The person being pursued is a friend of mine. I cannot stand by.”<br/><br/>Seeing his expression, Xi Huang had a hunch that this friend must have an extraordinary relationship with him.<br/><br/>But why hasn’t he made a move yet?<br/><br/>Although she was perplexed, she didn’t ask.<br/><br/>Her father must have his reasons for his actions.<br/><br/>At that moment, the man’s voice rang out again, “Hand it over in ten breaths!”<br/><br/>This is my final warning.<br/><br/>Gu Yang still showed no intent to intervene. He pacified the restless Phoenix Feather Knife while patiently waiting for the right moment.<br/><br/>“Lu Yunshan, with a mana level of two and was defeated by Chen Hao of Chen Family one hundred and twenty years ago. Since then, he returned to Qingzhou to seclude himself and has not been heard from.”<br/><br/>Inside a tavern in the city, two individuals sat in a private room, discussing Lu Yunshan.<br/><br/>The one speaking was a man in his thirties who knew Lu Yunshan’s life story, “It was after that defeat that Chen Hao began his meteoric rise. In just a few decades, he broke through to the third level of mana and ranked tenth on the List of Masters.”<br/><br/>“However, there is no record of him possessing a divine weapon. Master Shen, what do you think?”<br/><br/>Sitting across from him was an ordinary-looking elderly man, half-closed eyes as though he was dozing off.<br/><br/>The man called out repeatedly, “Master Shen, Master Shen…”<br/><br/>It was then the old man woke up. Rubbing his eyes, he yawned, “What? Oh, the divine weapon. It must have come into his possession recently and hasn’t been fully refined yet.”<br/><br/>These two men were both from the Red Mansion.<br/><br/>The man was called Tian Zheyu, an official disciple of the master of the Red Mansion.<br/><br/>The old man’s surname was Shen. He was the oldest inspector and the only one in the Divine Power realm.<br/><br/>They spent most of the year scrutinizing the realities of the Barbarian powerhouses in the prairies.<br/><br/>A few days ago, a significant change had occurred in the prairie. Unable to stay there, they had to return to Great Zhou and were passing through Mountain Terrace City today.<br/><br/>Unexpectedly, they came across this situation.<br/><br/>The list issued by the Red Mansion only included the people of Great Zhou. Foreigners, including powerhouses from the prairie, were not included.<br/><br/>Tian Zheyu remarked with surprise, “Without fully refining a divine weapon, he dared to come to Qi Province. Isn’t he afraid the Luo Family will snatch it from him?”<br/><br/>A divine weapon was already enough for an Unleaking Realm cultivator to take action.<br/><br/>Lu Yunshan’s move was extremely risky.<br/><br/>Master Shen’s eyelids began to droop again. Indistinctly, he said, “Well then, that thing must be very important to him.”<br/><br/>“What could it be?”<br/><br/>Tian Zheyu was very curious, what could make Lu Yunshan, a careful man like him, risk the danger of his divine weapon being snatched just to pursue it personally?<br/><br/>“Mui Er?”<br/><br/>Chu Mei was under immense pressure. Lu Yunshan’s mana had sealed off the entire courtyard.<br/><br/>She, on the other hand, felt a chilling cold from the sword intent locked onto her.<br/><br/>It was a lethal threat.<br/><br/>This was the deterrence of a divine weapon. Regardless of how formidable your golden body or how profound your mana, you would appear fragile under the edge of a divine weapon.<br/><br/>Amongst those in the Mana Realm, naturally, the strongest are those on the List of Masters.<br/><br/>And yet, the universally acknowledged most formidable fighters were the ten Sword Saints!<br/><br/>Among the ten Sword Saints, nine of them could not even make the List of Masters, but it did not diminish their invincible renown. This was because they each held an extraordinary divine weapon in their hands.<br/><br/>The Lu Yunshan standing before her, of course, fell far short of the Sword Saints, but he was still not someone she could handle.<br/><br/>Chu Mei did not waste words, a single utterance of “Yue’er” had already asked everything that needed to be asked.<br/><br/>Chu Xiyue replied, “An Elixir that can extend life by three hundred years!”<br/><br/>Chu Mei was deeply shocked, naturally knowing just how precious an elixir that could extend life was.<br/><br/>Such an elixir had long since been lost, and no one could refine it anymore. Only occasionally would one or two be found in ancient ruins.<br/><br/>Every appearance would cause a bloody carnage.<br/><br/>There was once, even a fierce battle broke out among the Unleaking Realm experts.<br/><br/>Thinking of her ancestor, Chu Mei’s fighting spirit blazed in her eyes instantly, and she had already grabbed a dagger.<br/><br/>Without needing more words, Chu Xiyue and Chu Yinxing already knew what they had to do.<br/><br/>With a sense of aura, Lu Yunshan already knew Chu Mei’s choice, and the last hope in his heart evaporated.<br/><br/>The murderous intent in his heart boiled, and he coldly said, “So be it, then die.”<br/><br/>The divine weapon in his hand shone brightly, as if piercing the dome of the sky, and an illusion of an Immortal Palace appeared in the sky.<br/><br/>Inside the Immortal Palace, an apparition of a figure seemed to appear, brandishing a sword. A stream of sword intent came from the Immortal Palace, being sacred and cold just like the moonlight.<br/><br/>People all across Mountain Terrace City saw the celestial phenomenon. Countless people thought it was a manifestation of divinity and knelt to the ground.<br/><br/>At this moment, in the tavern, the sleepy old Shen suddenly opened his eyes, a spark of brilliance shooting out from his murky old eyes, “Guanghan Immortal Palace? So, the inheritance he got was from this sect…”<br/><br/>Tian Zheyu beside him was dazzled and astonishedly said, “One of the three great ancient Immortal Palaces, Guanghan Immortal Palace?”<br/><br/>Old Shen said, “It’s recorded in the ancient books that Guanghan Immortal Palace is best at refining the elixir of immortality. It seems that what Lu Yunshan wants to fight for is likely the life-extending elixir.”<br/><br/>A life-extending elixir?<br/><br/>Tian Zheyu’s heart thumped, involuntarily thinking of his teacher, his breathing became rushed, “Old Shen…”<br/><br/>Old Shen gazed at him. His gaze seemed as though it could pierce one’s heart, and he shook his head, saying, “I want to live a few more years. I can’t afford to offend any of these people.”<br/><br/>Tian Zheyu was extremely unwilling, but he also knew that with his strength, he had no chance of getting the elixir.<br/><br/>Meeting but not able to ask for this rare elixir gave him a heart-wrenching feeling that was unbearable.<br/><br/>No, just now Old Shen said these people…Could it be that…<br/><br/>Just then, there was a sudden turn of events.<br/><br/>The world before his eyes suddenly darkened, and Tian Zheyu could not see anything. Even his five senses were stripped away. He became both blind and deaf.<br/><br/>His heart jolted violently.<br/><br/>It was the Taiyou Moon Devouring Technique.<br/><br/>The Shen Family!<br/><br/>Meanwhile, in the inn.<br/><br/>Xi Huang felt the world before her darkened, and her five senses stolen. She was shocked, and then, she felt her hand being held by a warm, large hand.<br/><br/>She breathed a sigh of relief, with her father by her side, she was not afraid of any danger.<br/><br/>Gu Yang thought to himself, “So it’s the Shen Family.”<br/><br/>Earlier on, he had already detected that there was an expert in Mana nearby, with a very concealed aura, still, he managed to discover them.<br/><br/>However, he couldn’t pinpoint their exact location and didn’t know who they were.<br/><br/>Out of caution, he waited for that person to show themselves before making a move.<br/><br/>As it turned out, it was their old nemesis, an expert in Mana from the Shen Family, at least of the Second Layer.<br/><br/>He thought to himself, “Could they have come for me?”<br/><br/>Through another view, he saw clearly a shadow shooting towards Lu Yunshan in the sky.<br/><br/>What followed was, that extraordinary divine weapon blossoming into a clear radiance, which miraculously dispelled the darkness.<br/><br/>With a crisp sound, a withered hand penetrated Lu Yunshan’s chest.<br/><br/>“Hehe…this divine weapon is mine now!”\t\t\t\t\t\t</div>", "images": {}, "success": true}