{"id": 231, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132063.html", "title": "Chapter 231 - Chapter 231: 231 Harvest", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 231 - Chapter 231: 231 Harvest</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 231: 231 Harvest<br/><br/>Translator: 549690339<br/><br/>“Eh, there are characters here.”<br/><br/>Xi Huang didn’t find it strange when she saw the corpse vanished out of thin air. It wasn’t the first time Gu Yang had done something like this in front of her.<br/><br/>After the corpse disappeared, numerous tiny characters were engraved on the rock below.<br/><br/>The font size was incredibly small, resembling micro-carving. It was easy to overlook in such dim conditions.<br/><br/>Xi Huang, with her careful observation, discovered the anomaly.<br/><br/>Gu Yang scrutinized it carefully. Just by looking at the first line, he was stunned.<br/><br/>“I am known as Daoist Muhuang, from Jinsan Sect…”<br/><br/>Daoist Muhuang?<br/><br/>These inscriptions should have been left by the corpse before it died, and it claimed to be Daoist Muhuang?<br/><br/>In that case, who was the one in Muhuang City?<br/><br/>Gu Yang found it somewhat eerie and continued reading.<br/><br/>The script gave a brief introduction to his life. After the Day of Fall, he established Muhuang City, provided shelter to many cultivators and civilians, and built a large ancient formation inherited from the ancient times, to resist the supernatural creatures.<br/><br/>Later, he met a warrior from another world named Luo Kun. The two of them discussed martial arts and became close friends.<br/><br/>Soon after, Luo Kun left Muhuang City and returned after a decade, inviting him to explore the Forest of Wanji together.<br/><br/>After reaching this cave, the two of them bypassed the colony of blood bats and found a treasure left by an ancient immortal.<br/><br/>Then, Luo Kun betrayed him…<br/><br/>The script turned extremely messy here, with no further continuation.<br/><br/>After reading it, Gu Yang fell into deep thought.<br/><br/>Which of the two Daoist Muhuangs were real?<br/><br/>Suddenly, he forcefully rubbed out the characters on the ground with his foot and said, “Let’s go.”<br/><br/>Whether real or fake, seeking verification from Daoist Muhuang was not an option.<br/><br/>Daoist Muhuang was a powerful being in the Unleaking realm. To outrightly expose his secret was virtually suicidal.<br/><br/>Anyway, he would just need to be extra cautious when facing him in the future.<br/><br/>As for the treasure left by the ancient immortal mentioned above, Gu Yang did not take it too seriously. If what was written was true, the treasure must have been taken by Luo Kun.<br/><br/>If it was false, then there was even less reason to care.<br/><br/>Along the way, Gu Yang and Xi Huang didn’t encounter any danger. A few scattered blood bats fled when they sensed their presence.<br/><br/>He wanted to kill one for testing, but couldn’t even catch up with one.<br/><br/>Finally, they returned to the surface and continued hunting the isolated supernatural creatures around them.<br/><br/>After one day, the mana realm creatures within a hundred miles of Muhuang City were almost entirely hunted by him.<br/><br/>The remaining energy of Gu Yang reached sixty units.<br/><br/>By rough calculation, he had killed more than forty creatures.<br/><br/>It was terrifying thinking about it, in such a small area, there were forty mana-enriched supernatural creatures. For Muhuang City to endure until now was truly remarkable.<br/><br/>Xi Huang finally couldn’t help but ask, “Father, there are too many of these creatures, is it necessary to risk this?”<br/><br/>Although they were effortlessly killing isolated creatures, once they gathered, they would only have one option – to flee in a panic.<br/><br/>In her view, doing such a dangerous and laborious unrewarding task was too risky.<br/><br/>With a deep compassion in his voice, Gu Yang responded, “I killed three mana realm monsters, even though it was against my will, but it greatly weakened Muhuang City’s strength. If the hundreds of thousands of people in the city died as a result, I would be uneasy. If I can eliminate one more supernatural creature, Muhuang city can be a bit safer.”<br/><br/>Xi Huang’s eyes gleamed with admiration as she said passionately, “Father…”<br/><br/>Just then, Gu Yang felt a chill run down his spine. Without the slightest hesitation, he transformed into a phoenix, picked up Xi Huang and fled.<br/><br/>The next moment, an enormous head dropped down from the sky. Its face was full of resentment, opening and closing its mouth as if it was saying, “Die, die, all of you die!”<br/><br/>It chased in the direction where Gu Yang disappeared, its speed in no way inferior to the phoenix Gu Yang had transformed into.<br/><br/>Meanwhile, in Muhuang City, at the city lord’s mansion.<br/><br/>In the empty Great Hall, Daoist Muhuang, who was reading a book, suddenly lifted his head, a solemn expression on half of his face, “How did it wake up early?”<br/><br/>Not just it, all the people in Muhuang city, from cultivators to ordinary people, felt a strong sense of resentment in their hearts.<br/><br/>Some people, who were on the edge, lost control immediately.<br/><br/>Thunderous noises echoed from all corners of the city.<br/><br/>Tens of people turned into monsters and began killing people.<br/><br/>Many others managed to keep control but could not suppress the resentment in their hearts, leading to violent outbreaks.<br/><br/>The whole of Muhuang City was plunged into chaos.<br/><br/>Suddenly, a dreary light shone, enveloping the entire city, instantly isolating the terrifying contamination.<br/><br/>Then, the city’s Enforcement Team sprang into action, cooperating with other cultivators to suppress the out-of-control monsters.<br/><br/>Slowly, tranquility was restored to the city.<br/><br/>When the chaos was over, the survivors began to retrieve bodies, repair the destroyed houses, their faces numb as they mechanically carried out these actions.<br/><br/>Only those of a younger age were seen lying on the corpses of their loved ones, crying.<br/><br/>Meanwhile, Gu Yang, with Xi Huang, eventually arrived at the Black Abyss Valley.<br/><br/>Behind him, an enormous shadow was rapidly closing in. Even before it reached him, he felt his mind filled with disturbing thoughts, as if a nameless fire filled his chest.<br/><br/>Dammit, it’s still chasing me!<br/><br/>I’ll cut you down!<br/><br/>With rage surging in his heart, he threatened to turn back and kill his pursuer, yet he kept his speed unabated.<br/><br/>Xi Huang, on his back, was less affected. She took out a crystal pendant and poured mana into it.<br/><br/>Immediately, a ripple appeared in the space ahead. With a swift movement, the two of them passed through the portal and vanished.<br/><br/>The next second, the giant shadow arrived.<br/><br/>The ripple in space had not completely disappeared when it collided with it, abruptly squeezing half of its head inside.<br/><br/>Just then, the ripple disappeared, and with it, the half of the head also vanished into thin air.<br/><br/>The creature writhed in madness, continuously thrashing its head against the ground.<br/><br/>With each collision, a huge pit formed in the ground.<br/><br/>Before long, a massive, nearly bottomless pit appeared on the ground.<br/><br/>The missing part of the giant head finally regenerated, but its body had noticeably shrunk.<br/><br/>When the slamming sound ceased, the giant head didn’t emerge from the bottom of the sinkhole again.<br/><br/>Tianfang Mountain.<br/><br/>In a newly built hut, a man dressed in a snow-white robe was sitting, his long hair cascading down his back, and he was studying a jade carving in his hand.<br/><br/>By his side, four breathtakingly beautiful women were attending to him.<br/><br/>Outside the hut, Luo Yulong was standing, explaining, “Great Uncle, I really didn’t know that those two people were headed to Tianfang Mountain …”<br/><br/>The man inside the hut said indifferently, “They were brought to Qi Province by you. If not for that, how could they swagger into Tianfang Mountain?”<br/><br/>Despair filled Luo Yulong’s heart as he mentally cursed Gu Yang.<br/><br/>He had known from the start that this man forcibly coming to the Luo Family meant trouble.<br/><br/>He hadn’t expected, however, that the man’s target was Tianfang Mountain.<br/><br/>Tianfang Mountain was the Forbidden Land of the Luo Family. Now, it was being guarded by his Great Uncle.<br/><br/>Who would have thought that someone would break into it? And the key thing was that once those two entered the perimeter of Tianfang Mountain, they disappeared without a trace.<br/><br/>What did that signify?<br/><br/>As a key member of the Luo Family, Luo Yulong naturally knew what Tianfang Mountain meant to his family.<br/><br/>Two hundred years ago, a cultivator of the Luo Family reached the peak of the Unleaking Realm. From ancient records, it was learned that there was a passage to a parallel world on Tianfang Mountain.<br/><br/>So, making huge efforts, an Upper Ancient Abnormal Treasure called the Breaking Sky Shuttle was procured, successfully allowing the cultivator to enter that parallel world.<br/><br/>Who knew, the peak cultivator of the Unleaking Realm never returned.<br/><br/>This was a massive loss for the Luo Family.<br/><br/>Since then, Tianfang Mountain had become the Luo Family’s Forbidden Land, guarded by a cultivator of the Mana Realm.<br/><br/>Now, someone had intruded into Tianfang Mountain and possibly entered the parallel world.<br/><br/>And those two people were the ones he had brought back to Qi Province.<br/><br/>Luo Yulong knew he was in trouble this time. His Great Uncle was known for not showing mercy.<br/><br/>The crux was, he was inferior to his Great Uncle in both cultivation level and seniority, leaving him no choice but to accept the reprimand.<br/><br/>He, a cultivator of the Mana Realm, had to endure this!<br/><br/>Such was the hatred in his heart.<br/><br/>Just at that moment, Luo Yulong sensed a peculiar fluctuation. Turning around, he saw an unusual ripple in the space, and two figures flew out from it.<br/><br/>PS: Second update, seeking monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}