{"id": 234, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132070.html", "title": "Chapter 234 - Chapter 234: 234 Seven Lives Heaven-Mending Pill", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 234 - Chapter 234: 234 Seven Lives Heaven-Mending Pill</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 234: 234 Seven Lives Heaven-Mending Pill<br/><br/>Translator: 549690339<br/><br/>Well, another one on the list.<br/><br/>Upon hearing the killing intent from the voice behind him, Gu Yang sighed. But, it didn’t concern him much.<br/><br/>As the saying goes, when you’re too far in debt, you just stop worrying.<br/><br/>He has enough enemies already, he doesn’t mind adding the Luo Family to the list.<br/><br/>Anyway, the Luo Family are just the henchmen of the Three Holy Sects, and given his relationship with them, a confrontation was inevitable anyway.<br/><br/>After covering a distance of a few hundred kilometers, Gu Yang finally came to a stop and reverted back to his human form.<br/><br/>“Father, where are we going next?” Xi Huang asked.<br/><br/>“First, let’s find a place to stay.”<br/><br/>Gu Yang gazed around and noticed a city to the south, “Let’s go there.”<br/><br/>The two flew towards the city and landed at the base of a mountain outside it. They then walked in to avoid causing a stir.<br/><br/>He mainly needed to buy some clothes.<br/><br/>During his sudden breakthrough, while transforming into a phoenix, his clothes had burst apart. Now he was purely relying on mana to create an illusion of clothes. It felt weird and the consumption was too high.<br/><br/>The greatest change that occurred at the realm of mana was that True Essence transformed into mana. Not only did it increase in power, but more importantly, mana gained a spirituality. It could do many things that could not be done before.<br/><br/>For instance, using mana to create clothes which appeared almost like normal clothes.<br/><br/>It could also freely change its properties. If you want fire, it can create flames. If you want ice, it can create ice cubes.<br/><br/>Mana could form a shield that was uncompromisingly solid. It could also turn into the softest thing in the world, containing all things.<br/><br/>Mana could develop into countless incredible means. To the common people, it didn’t seem much different from immortality.<br/><br/>If one had sufficiently profound mana, manipulating the wind and weather, moving mountains and filling the sea would not be difficult.<br/><br/>The mana realm was also divided into three levels, each level being a tribulation.<br/><br/>What is a tribulation?<br/><br/>After the golden body was fully formed, what one needed to do was to enhance the Original Spirit. Upon reaching a certain limit, one would have to open the heavenly gate and step into a higher level.<br/><br/>With each tribulation overcome, the connection between the Original Spirit and the universe became tighter, allowing for the easier manipulation of the universe’s vitality.<br/><br/>Although Gu Yang had just entered the first tribulation, his Original Spirit was incomparably strong, coupled with profound mana.<br/><br/>The rich accumulation of many years past had finally transformed into tangible strength. Effortlessly he slain that strange creature and the monster transformed by a second tribulation strongman.<br/><br/>Gu Yang checked into an inn and asked the innkeeper’s boy to help him buy clothes.<br/><br/>Xi Huang had not fully recovered. She had used a lot of mana to break through the prohibition earlier and needed to rest.<br/><br/>He too needed to sort out the gains from this experience.<br/><br/>Upon checking the system, he discovered that only eighteen units of energy remained.<br/><br/>This meant he had performed eighteen simulations total.<br/><br/>Without the help of the Spirit Fire, practicing was a slow process.<br/><br/>The content of the previous simulations was more or less the same. It was evident that at this later stage, a slight increase in strength didn’t bring about any significant changes to the overall situation.<br/><br/>[Would you like to use the Simulator? Each use consumes ten units of energy.]<br/><br/>The price had gone up, increased by two and a half times.<br/><br/>Gu Yang had a headache.<br/><br/>This meant that a single simulation would require charging ten ordinary Magical Tools or two ordinary Spirit Tools.<br/><br/>He seriously doubted that even if he robbed all the Spirit Tools and Magical Tools in the Great Zhou Dynasty, it would still not be enough for him to break through to the Unleaking Realm let alone the Celestial Being realm.<br/><br/>“I must get more energy from the Pocket Dimension World.”<br/><br/>Gu Yang pondered in his heart.<br/><br/>Inside the Water Moon Pocket Dimension World, there were more Magical Tools resources than in the Great Zhou Dynasty. Nearly everyone in the Divine Power realm had a Spirit Tool. Even many Cultivators in the Elixir realm had many Magical Tools.<br/><br/>However, he was currently being hunted by the Ancient River Sword Sect, a super sect with a Celestial Being reigning over it.<br/><br/>The more crucial point was, this sect totally disregarded martial ethics. They sent four strongmen, equivalent to Unleaking Realm, to hunt him, a Golden Body cultivator. It was too dangerous. It’s better not to go for the time being.<br/><br/>The Yellow Springs Pocket Dimension World also seemed good. That place had countless strange creatures and with his current strength, he could easily “grind monsters”.<br/><br/>However, that Unleaking Realm strange creature might still be nearby. If he really went there, it would be a suicide.<br/><br/>That was a peak Unleaking Realm strange creature, he was absolutely not a match for it now.<br/><br/>“Both Pocket Dimension Worlds are not an option, should I seek out Cao Yiyi?”<br/><br/>Gu Yang felt worried.<br/><br/>Other than these two cave heavens, the only other one he could think of was Wànxiàng Cave Heaven.<br/><br/>The problem was, could going to Cao’s family, who were lapdogs of ChiMing, be tantamount to throwing oneself into the net?<br/><br/>Just because ChiMing didn’t show up before doesn’t mean it wouldn’t this time.<br/><br/>Moreover, Cao Yiyi was not quite sane, and every time she took him into the Wànxiàng Cave Heaven, she destroyed the key.<br/><br/>The Wànxiàng Cave Heaven may be even more dangerous than Shuiyue Cave Heaven.<br/><br/>“Huh?”<br/><br/>While Gu Yang was thinking about his next move, he felt a somewhat familiar aura.<br/><br/>“It’s her?”<br/><br/>He immediately recognized that this was the aura of Chu Xiyue’s First Rank bodyguard.<br/><br/>Previously, this person had always hidden in the dark and never showed up. But once, he revealed a whiff of his aura, which scared away a First Rank bodyguard of the Lin Family.<br/><br/>Gu Yang remembered.<br/><br/>He felt a little surprised, “Xiyue is also in this city.”<br/><br/>Since this guard was here, Chu Xiyue must be here too.<br/><br/>In a previous simulation, Chu Xiyue had been attacked. He had been worried about where to find her, but now she was right here.<br/><br/>What a stroke of luck.<br/><br/>However, Gu Yang didn’t rush to meet her immediately, but decided to protect her from the shadows to avoid alarming any potential enemies.<br/><br/>“Aunt, what’s wrong?”<br/><br/>In a house located halfway across the city, Chu Xiyue, wearing a black cloak and a face veil, saw her aunt’s change in expression and asked nervously.<br/><br/>Chu Yinxing shook her head with a serious expression, “It should not be people from Yunshan Sect.”<br/><br/>Chu Xiyue remained silent for a while, took something out of her bosom, and solemnly gave it to her, saying, “Aunt, the Yunshan Sect’s target is me. I’ll lead them away. You take this thing to Luo Prefecture…”<br/><br/>“I refuse.”<br/><br/>Chu Yinxing said firmly without leaving any room for bargaining.<br/><br/>Chu Xiyue anxiously said, “Yunshan Sect has a Mana Double Sky expert, we can’t escape from them. You have a slim chance if you go alone. Given my status, they won’t dare do anything to me.”<br/><br/>“My only mission is to protect you.”<br/><br/>“Aunt, you should know how important this thing is to our ancestor.”<br/><br/>“No means no. I’ve already sent the message out. It won’t be long before reinforcements arrive.”<br/><br/>Chu Xiyue was so anxious that she stomped her foot, “No matter how fast the message is delivered, it cannot be faster than Yunshan Sect.”<br/><br/>Regardless of what Chu Xiyue said, Chu Yinxing was impervious to her words and finally simply closed her eyes to rest.<br/><br/>Chu Xiyue had no choice but to give up helplessly.<br/><br/>She also knew that the chance for her aunt to escape alone was not great either.<br/><br/>Yunshan Sect, as one of the strongest sects under the six major ones, dominates Qingzhou.<br/><br/>There is a Mana Double Sky expert in the sect, not just anyone dares to provoke this sect.<br/><br/>Qingzhou is located in the northwest of Great Zhou and is remote. The disciples of Yunshan Sect rarely leave Qingzhou, so it could be said that they live in a confined area.<br/><br/>Ever since Chu Xiyue separated from Gu Yang six months ago, she has been wandering around, heading north. Last month, she arrived in Qingzhou.<br/><br/>By accident, she stumbled into a Secret Realm. By a stroke of luck, she opened the cave mansion in the Secret Realm and got a pill named “Seven Life Revitalising Pill”.<br/><br/>According to the book in the cave mansion, this pill can help cultivators above the Divine Power realm to extend their lifespan by three hundred years.<br/><br/>When Chu Xiyue got this pill, she treated it like a priceless treasure.<br/><br/>She knew that the ancestor had lived for over a thousand years and his lifespan, as a cultivator in the Unleaking Realm, was almost at its end.<br/><br/>That was the main reason why the family agreed to the Qin family’s marriage proposal.<br/><br/>The Bright Moon Sabre was of great importance to the ancestor, so the Chu Family had no choice.<br/><br/>Now, she had an ancient divine elixir that could extend lifespan, things were different. Maybe this could make the ancestor retract his edict.<br/><br/>However, she was eventually discovered by the people of Yunshan Sect.<br/><br/>After leaving the Secret Realm, she and her aunt fled to Qi Province, but they still couldn’t make sure they could escape the pursuit of Yunshan Sect.\t\t\t\t\t\t</div>", "images": {}, "success": true}