{"id": 235, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132072.html", "title": "Chapter 235 - Chapter 235: Dire Competition 235 (Third Update, Seeking Monthly Ticket)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 235 - Chapter 235: Dire Competition 235 (Third Update, Seeking Monthly Ticket)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 235: Dire Competition 235 (Third update, seeking monthly ticket)<br/><br/>Translator: 549690339<br/><br/>The boundary between Qi Province and Qing Province was home to a city known as East Moon City.<br/><br/>A few key figures from the Cloud Mountain Sect were standing respectfully outside the city, seemingly waiting for someone.<br/><br/>In the moonlight, a figure descended from the sky.<br/><br/>Including the Sect Leader of the Cloud Mountain Sect, everyone bowed down, “Greetings, Ancestor Master!”<br/><br/>The newcomer was dressed in a green robe, his temples touched with frost, giving off the look of a middle-aged man. A trace of unmeltable gloom between his brows imbued him with a sense of vicissitude.<br/><br/>This man was none other than the founder of the Cloud Mountain Sect, Lu Yunshan.<br/><br/>All the people present were his disciples and grand-disciples.<br/><br/>Lu Yunshan held a sword in his hand, its aura piercing the sky. A look of pain flashed across the faces of the attendees, some of whom could not bear the power of the sword.<br/><br/>It was a peerless divine weapon which had just been fetched from a secret realm.<br/><br/>It was for this divine weapon that they had allowed a wily woman to steal a bottle of elixir and escape.<br/><br/>Afterward, Lu Yunshan stayed in the secret realm, intending to refine this peerless divine weapon.<br/><br/>Initially, they had thought that a mere First-Rank martial artist could never escape.<br/><br/>Who would have known, seven First-Rank martial artists actually lost track of her.<br/><br/>They were simply good-for-nothings.<br/><br/>It was only when Lu Yunshan received their reports that he found out that what was stolen was an elixir capable of prolonging life for three hundred years. Instantly unsettled, he abandoned the refining of the divine weapon and rushed over.<br/><br/>He was already two hundred and fifty years old, with only fifty years of life left.<br/><br/>If he had known just how precious the elixir was, he undoubtedly would have gone after it first, so how could a First-Rank martial artist have gotten it instead?<br/><br/>Unfortunately, there is no medicine for regret in this world.<br/><br/>However, they cannot escape!<br/><br/>Lu Yunshan’s expression was as cold as ice as he asked, “Where are they?”<br/><br/>The Sect Leader answered sweating profusely, “After entering Qi Province, those two have been heading east, they should be in Mountain Terrace City by now.”<br/><br/>Lu Yunshan did not hurry off but asked another question, “Did you find out their identities?”<br/><br/>“From her True Essence, the martial arts techniques she used, and her age, it should be Chu Xiyue from the Chu Family.”<br/><br/>The Sect Leader knew that his Ancestor Master had been in seclusion for many years and volunteered additional information, “Not long ago, the Qin Family proposed a marriage alliance to the Chu Family. This Chu Xiyue is engaged to the Qin Family’s son.”<br/><br/>Lu Yunshan’s expression tightened, and he understood the seriousness of the matter.<br/><br/>He was well aware of the terror of the nine major families.<br/><br/>Back in the day, he had a fortunate encounter when he was young and topped both the Prodigy list and the First-Rank list at a tender age. He achieved Golden Body status at thirty.<br/><br/>At a hundred, he stepped into the Mana Realm.<br/><br/>At that time, he was proud of his talent and looked down upon the world, not paying the nine major families any mind.<br/><br/>Until one day when he clashed with a little-known Mana Realm practitioner from the Chen Family. Just three moves into the fight, he was miserably defeated. His Dao Companion died on the spot while trying to save him.<br/><br/>After that time, he realized how great the gap was between him and the disciples from those top-tier families.<br/><br/>But by then, it was too late for regrets.<br/><br/>From then on, the Cloud Mountain Sect included a new rule; to avoid conflicts with the nine major families and the six major Sects.<br/><br/>This was the survival rule of a small sect; to stay within their own small piece of territory and live peacefully.<br/><br/>Unexpectedly, the one who had stolen the Seven Lives Restorative Elixir this time turned out to be Chu Xiyue, the most outstanding direct heiress from the Chu Family and the betrothed of the Qin Family’s son.<br/><br/>If not handled properly, this matter involving two major families could result in the sect’s downfall.<br/><br/>Lu Yunshan tightly held the divine weapon in his hand, a murderous intent flashed in his eyes. He rose into the air and disappeared into the night sky.<br/><br/>The direction he’d headed was towards Mountain Terrace City.<br/><br/>Lu Yunshan came from a humble background. He didn’t have a master, didn’t join any influence, founded the Cloud Mountain Sect, and had a difficult journey.<br/><br/>No one understood better than him how important opportunity was.<br/><br/>Without that fortuitous encounter during his youth, there would have been no way he could have achieved what he did today.<br/><br/>That stroke of fortune was exchanged for his life.<br/><br/>The path of cultivation is about seizing that one opportunity.<br/><br/>He had had two incredible opportunities in his lifetime.<br/><br/>He seized one and went from being a poor disciple with no hope in martial arts to topping the Prodigy list and even stepping into the Divine Power Realm.<br/><br/>He lost one, suffered a major setback, and his Dao Companion died as a result.<br/><br/>Now, another tremendous opportunity was laid before him.<br/><br/>If successful, he could extend his life by three hundred years, having ample time to advance into the Unleaking Realm.<br/><br/>If he failed, he would offend both the Chu and Qin Families, and his entire Cloud Mountain Sect would be eradicated from the world.<br/><br/>Lu Yunshan decided to make one last attempt.<br/><br/>Under the cover of the dark, bewildering night,<br/><br/>Chu Xiyue stood in the courtyard, looking desolately up to the crescent moon in the sky.<br/><br/>She knew she was caught in a dead end.<br/><br/>Jingzhou was too close, while Luo Prefecture was too far away.<br/><br/>Even though she already broke through to the First Rank Realm, evading the hunt of Divine Power Realm was impossible.<br/><br/>Her best bet was to hide within the city, blend into the crowd – making it more difficult to be discovered.<br/><br/>Out in the open, no matter where she hid, she would not escape the eyes of those in the Divine Power Realm.<br/><br/>This was a secret base of the Chu family, primarily used for gathering intel on the Luo Family. They chose to hide here and await the family’s rescue.<br/><br/>The choice of this city was because it lied within the Luo Family’s territory.<br/><br/>Anyway, they intended to muddy the waters as much as they could, buying themselves additional time.<br/><br/>Chu Xiyue trailed her fingers over the vial in her pocket.<br/><br/>If they could hold out until the family’s rescue troops come, she could return to her family and present the Seven Lives Revitalizing Pill to the ancestors, then she could beg her…<br/><br/>Suddenly, came Chu Yinxing’s distant voice, “You should know that even if you submit the elixir to the ancestor, she won’t revoke the marriage decree. Your marriage into the Qin family is a foregone conclusion.”<br/><br/>Chu Xiyue fell silent.<br/><br/>“He has been merrymaking along the road, flirting with the Jinghai Princess in Jingzhou. Upon reaching the Divine City, he has the Princess Chang and the Queen’s younger sister pining over him, with the Queen herself linked to his name… Such a man, he is not worth it!”<br/><br/>Chu Yinxing’s speech dripped with disappointment.<br/><br/>Chu Xiyue continued to gaze at the moon, calmly speaking, “Grandmother once said that no man in this world is worthy of trust. I didn’t understand back then, but now I do. Grandma must have been hurt in love.”<br/><br/>“After father passed on, mother was always depressed, often washing her face with tears. I’ve seen all of these when I was young.”<br/><br/>“You, my auntie, refuse to marry even now. Isn’t it because you’ve someone in your heart?”<br/><br/>“Maybe, this is the fate of us women in the Chu Family.”<br/><br/>Chu Yinxing fell silent.<br/><br/>Chu Xiyue took a deep breath and said, “I know, he killed the emperor, and the National Protectorate’s Sword won’t let him off. How could he possibly contend against a Sword Saint? What I ask of Grandma is only to spare his life…”<br/><br/>“Fool!”<br/><br/>Suddenly, a faint voice echoed from above.<br/><br/>Chu Xiyue was startled, lifting her head, her face brightened with joy at the sight of the newcomer, “Second Grandmother!”<br/><br/>In the sky, a figure was floating, Second Grandmother Chu Mei, with her cultivation level reaching the First Heavenly Layer.<br/><br/>Her surprisingly swift arrival caught them off guard.<br/><br/>Chu Xiyue asked, “How did you get here so fast?”<br/><br/>Chu Mei slowly descended, answering, “I was just in Qi Province, taking care of some matters. Your temerity is something else, daring to steal from a Mana Realm expert.”<br/><br/>On the way, she received news and already knew about the full story.<br/><br/>While the report did not specify what was stolen, she knew that whatever made Chu Xiyue activate the highest level rescue signal couldn’t be a small matter.<br/><br/>At that moment, the three of them sensed an astonishing sword intent fast approaching.<br/><br/>Chu Mei’s face changed, “He’s very fast.”<br/><br/>In a blink of an eye, a figure appeared above the courtyard, his icy voice echoed, “Hand over the item and I’ll pretend that nothing happened. Otherwise, don’t blame me for my merciless blade.”<br/><br/>With that, he unsheathed his sword, a silver sword intent soaring up, reaching for the sky.<br/><br/>Below, both Chu Xiyue’s and Chu Yinxing’s swords started trembling. Their faces turned pale and blood seeped from the corners of their mouths, already injured by the domineering sword intent.<br/><br/>“An unparalleled divine weapon?”<br/><br/>Chu Mei’s face darkened.<br/><br/>She was familiar with Lu Yunshan, despite being one level below him in terms of cultivation, she still had confidence that she would protect Chu Xiyue and help them escape.<br/><br/>However, with an unparalleled divine weapon in Lu Yunshan’s hands, things would be different.<br/><br/>PS: Third release, seeking monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}