{"id": 233, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132067.html", "title": "Chapter 233 - Chapter 233: 233 Mana Realm", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 233 - Chapter 233: 233 Mana Realm</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 233: 233 Mana Realm<br/><br/>Translator: 549690339<br/><br/>[…The giant skull soared towards the monster, swallowing it whole before vanishing. The two Celestial Beings also left.]<br/><br/>[You discovered that all over Great Zhou monsters were wreaking havoc. You, with the aid of disguise symbols, went in search of survivors everywhere. In six months, you rescued dozens of people, and finally met with people from the Star Sea.]<br/><br/>[After you entered the pocket universe, you passed on a few symbol techniques such as the disguise symbol to others.]<br/><br/>[Five years later, the Star Sea gathered all the powerful ones at and above the Mana realm, and marched towards Great Zhou to hunt the monsters. You and Xi Huang, both joined the expedition.]<br/><br/>[Over ten years, you annihilated countless monsters. At last, a monster at the Celestial Being level emerged. In the great war, you were specifically targeted and fell on the spot, dying at the age of thirty-seven.]<br/><br/>Indeed, a single monster almost turned Great Zhou into a realm of death. Subsequently, even Celestial Being level monsters appeared.<br/><br/>If it wasn’t for the Four Great Sacred Lands, Great Zhou would probably have been destroyed.<br/><br/>The pocket universe of the Four Great Sacred Lands served as a strategic depth, allowing the surviving warriors of Great Zhou to preserve their vitality.<br/><br/>Even Chi Mingtian, who was dedicated to destroying Great Zhou, had to join hands with others. This shows just how great a threat these monsters posed.<br/><br/>Whether they could win in the end was really hard to tell.<br/><br/>Gu Yang didn’t even know how strong the Celestial Beings from the Four Great Sacred Lands were.<br/><br/>[Simulation ends, you can keep one of the following options.]<br/><br/>[One, your martial arts realm at the age of thirty-seven.]<br/><br/>[Two, your martial arts experience at the age of thirty-seven.]<br/><br/>[Three, your wisdom of life at the age of thirty-seven.]<br/><br/>“I choose one.”<br/><br/>Gu Yang knew the urgency of the situation, didn’t hesitate at all, and immediately launched the second simulation.<br/><br/>Next, he barely checked the content, and kept using the simulations one after another.<br/><br/>They were trapped in the prohibition, while Xi Huang was attacking desperately, trying to break the prohibition.<br/><br/>However, the prohibition was very tough. Xi Huang’s strength had already recovered to the first level of Mana realm, but she was still unable to break the prohibition in a short time.<br/><br/>She couldn’t even take the opportunity to strike down the Mana realm creature that was being corrupted.<br/><br/>Gu Yang needed powerful strength before the enemy completely lost control.<br/><br/>At least, he needed to reach the Mana realm!<br/><br/>Luo Yulong could tell that something was very wrong with Luo Yaowu.<br/><br/>He seemed to be in extreme pain, with violent mana exploding all around. The newly built hut vanished instantly.<br/><br/>His four beloved maids were blasted to death by the violent Mana, leaving no traces behind.<br/><br/>Luo Yulong was so scared that he didn’t dare to approach, but didn’t dare to run either.<br/><br/>He really was in a dilemma whether to stay or leave.<br/><br/>As for Gu Yang’s words, he simply ignored them.<br/><br/>If he really escaped, he would be seen as running from battle. If Luo Yaowu was killed by Gu Yang, he would be torn into pieces by the elders after the incident.<br/><br/>Suddenly, Luo Yulong looked towards Gu Yang and saw his aura continuously rising.<br/><br/>“Here it comes again!”<br/><br/>A few days ago, at Jade Luo Mansion, he felt Gu Yang’s True Essence rising explosively nine times in succession.<br/><br/>At that time, he was starting to have doubts about his own existence.<br/><br/>Now, was even more exaggerated.<br/><br/>Gu Yang’s strength was climbing continuously, as if there was no limit to his growth.<br/><br/>Bang!<br/><br/>Suddenly, a giant whirlpool appeared in the sky, stirring the Vitality within a radius of a hundred miles.<br/><br/>“Mana”<br/><br/>Luo Yulong watched the giant whirlpool with a dull expression.<br/><br/>Such a scene was all too familiar to him.<br/><br/>He had experienced it when he broke through to the Mana realm.<br/><br/>The formation of Mana when stepping from Golden Body realm to Mana realm would stir the Vitality of Heaven and Earth. The deeper the cultivation, the more Vitality will be affected.<br/><br/>When he broke through, there was just a tiny whirlpool above his head, affecting the Vitality only within a few miles range.<br/><br/>The sight of a huge whirlpool forming in the sky, stirring up the Vitality of Heaven and Earth within hundreds of miles, was unheard of.<br/><br/>Does that mean his cultivation at the entry level of Mana realm was tens of times weaker than Gu Yang’s?<br/><br/>According to the records in their clan, the maximum range of Vitality affected when breaking through to Mana realm was fifty miles.<br/><br/>Later on, this ancestor became the second Unleaking Realm in the family, who truly had the potential of a Celestial Being.<br/><br/>Yet, he still couldn’t compare to Gu Yang.<br/><br/>What was more frightening was that this range was still expanding.<br/><br/>At this moment, Gu Yang hadn’t truly taken that step yet, as the True Essence within his body was still growing rapidly, and had not reached its limit.<br/><br/>In the sky, the whirlpool was getting bigger and bigger, affecting more and more Vitality of Heaven and Earth.<br/><br/>[…You have stepped into the Mana Realm!]<br/><br/>After what felt like countless simulations, Gu Yang noticed the appearance of such a prompt in the simulations, his heart shook.<br/><br/>Finally, it’s here!<br/><br/>“Simulation ends, you can retain one of the following.”<br/><br/>“Choose one.”<br/><br/>Gu Yang sensed an indescribable power bursting out of his body.<br/><br/>Every muscle, every bone, down to the smallest cell in his body, was undergoing a revolutionary transformation.<br/><br/>Previously, he turned into a phoenix, actually transformed by the inner Phoenix’s fire and, in essence, wore a shell of a Phoenix.<br/><br/>Until this moment, reaching a peak in his cultivation level, the Phoenix bloodline within him underwent a metamorphosis, a metamorphosis akin to a complete rebirth.<br/><br/>Gu Yang felt a bone-deep pain.<br/><br/>Followed by an indescribable itch, like countless ants nibbling inside his body.<br/><br/>This was nothing short of inhuman torment.<br/><br/>Moments later, his body mutated, instantly transforming into a true phoenix.<br/><br/>The transformation into Phoenix was complete!<br/><br/>A blaze of crimson ignited from the magnificent and noble feathers. Instantly, it burned through the prohibition, creating a hole.<br/><br/>Gu Yang could feel a ancient and primeval power continually surging within him.<br/><br/>This was the legacy from the Phoenix bloodline.<br/><br/>The flames on his body grew more and more intense, and the trapping Sky Net seemed to melt like snow, disappearing without a trace.<br/><br/>“Father”<br/><br/>Xi Huang, soaked in the flame at one side, felt as if she had returned to the womb.<br/><br/>Seeing him display the Phoenix true body, she was too excited to contain herself.<br/><br/>Although she had reached the Triple Sky of the Mana Realm, she still could not transform into the Phoenix true body due to the issue of her bloodline.<br/><br/>Meanwhile, Luo Yaowu was also undergoing a mutation.<br/><br/>Two giant black paws stretched out from his back, followed by two shorter paws.<br/><br/>In the blink of an eye, a giant black spider tore through the flesh and burrowed out from Luo Yaowu’s body.<br/><br/>Finally, only a head remained floating there, a face still holding a residue of fury.<br/><br/>The head kept swelling until its diameter exceeded ten meters, becoming incredibly large.<br/><br/>Seeing the entire process of his mutation, Luo Yulong turned pale.<br/><br/>His second great uncle had turned into a monster.<br/><br/>Suddenly, the giant head turned around, its bulging angry eyes looking at him.<br/><br/>An unknown fury rushed from his chest to his forehead.<br/><br/>Why did Luo Yaowu dare yell at me?<br/><br/>Why should I risk my life for this family?<br/><br/>Why should I stay in this dangerous place?<br/><br/>Luo Yulong’s anger broke through the dam of rationality, with a swish, he turned around and fled, disappearing quickly.<br/><br/>The giant head roared and was about to give chase, but it bumped into an invisible barrier and rebounded back.<br/><br/>It turned its head to look at Gu Yang in the distance, the veins on its face bulging out.<br/><br/>By this time, Gu Yang had turned back into his human form, dressed in clothes condensed out of mana, holding a Phoenix Feather Knife in his hand, his gaze frosty, “This is not a place where you can run wild!”<br/><br/>The first move of the Six Annihilation Divine Thunder, Skyfire Annihilates!<br/><br/>The blade was drawn, and the Skyfire descended!<br/><br/>After reaching the Mana Realm, the power of this first move had undergone an earth-shattering change.<br/><br/>The true Skyfire had fallen, crashing from the sky, landed squarely on the ghastly creature.<br/><br/>Under such destructive power, the creature let out a sharp, mournful scream, being burned to ashes.<br/><br/>Within the range of the Skyfire, everything was turned to dust.<br/><br/>“Stop!”<br/><br/>Just then, an angry voice rolled in from the distance.<br/><br/>A formidable aura, like a bolt of lightning, was rapidly flying this way.<br/><br/>Triple Sky of the Mana Realm!<br/><br/>Gu Yang did not hesitate at all and moved to strike the second blow.<br/><br/>The second move of Six Annihilation Divine Thunder, Thunder Eliminates!<br/><br/>In the sky, a thick purple thunderbolt fell, crashing into that black spider creature.<br/><br/>The next moment, a blinding light flared up.<br/><br/>Swoosh!<br/><br/>The figure finally arrived, leaving a huge pit where it was, Luo Yaowu’s presence could no longer be sensed.<br/><br/>The perpetrator had turned into a Phoenix, disappearing into the horizon, at an unbelievable speed.<br/><br/>“Whoever you are, I swear to shatter you into pieces!”<br/><br/>PS: First update, seeking monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}