{"id": 249, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132098.html", "title": "Chapter 249 - Chapter 249: 249 Oppression From Celestial Being", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 249 - Chapter 249: 249 Oppression From Celestial Being</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 249: 249 Oppression from Celestial Being<br/><br/>“Is Qu Tianshu planning to act like a scared turtle? Why doesn’t he dare to come out and fight me!”<br/><br/>No sooner did Gu Yang and Xi Huang emerge from the lake than they heard a resounding voice arriving from afar, echoing throughout the whole sky and forming a reverb in the valley.<br/><br/>Could it really be someone here to challenge the East Sun Sword Saint?<br/><br/>He was somewhat curious. Qu Tianshu was indeed the name of the East Sun Sword Saint.<br/><br/>Around the world, the number of people who have the qualifications to challenge the East Sun Sword Saint could be counted on one’s fingers. He wondered who this challenger might be.<br/><br/>However, where had the East Sun Sword Saint gone?<br/><br/>On a second thought, Gu Yang wondered, “Could he be in Golden Court Cave-Heaven?”<br/><br/>Even if he was in a deep period of isolation, when someone knocks at his door, he should show up.<br/><br/>Unless, he was not in Linbin City at all.<br/><br/>There is a high possibility that he is inside Golden Court Cave-Heaven.<br/><br/>Even his disciple, Lan Shu, knew how to enter the Golden Court Cave-Heaven, so there’s no reason he didn’t know, right?<br/><br/>The more Gu Yang thought about it, the more probable it seemed. The other day, when he ran into Lan Shu, it was very likely that she was going to see her master.<br/><br/>At that moment, the blue bird popped its head out from within his arms, calling out excitedly, “Master, it’s the East Yang Sword.”<br/><br/>So, it was the East Yang Sword Saint.<br/><br/>Upon hearing his words, Gu Yang instantly understood.<br/><br/>The grudge between the East Yang Sword Saint and the East Sun Sword Saint can be traced back to their titles, simply because there is an “east” in both their names, they became rivals.<br/><br/>Later, they had a competition at the coast of the Eastern Sea. It was said to be very sensational back then, a duel between two Sword Saints.<br/><br/>Ultimately, the East Sun Sword Saint won by a move, establishing his position as the foremost of the Ten Sword Saints.<br/><br/>After that battle, the East Yang Sword Saint disappeared without a trace.<br/><br/>Now, more than a hundred years have passed, and the East Yang Sword Saint has surprisingly returned to challenge the East Sun Sword Saint again.<br/><br/>This battle should be very exciting to watch.<br/><br/>Seeing that Gu Yang had no reaction, the blue bird hastily said, “Master, the East Yang Sword, don’t you remember?”<br/><br/>Gu Yang wondered, “What’s the problem with the East Yang Sword?”<br/><br/>“Back in the day, your nephew, the White Tiger Demon Saint, was murdered by a scheme initiated by members of the East Yang Faction. His bones were refined into a Magic Treasure.”<br/><br/>The blue bird reminded him, “You once swore to exterminate the East Yang Faction. If you see one, kill one; if you see two, kill them both.”<br/><br/>That was a vow made by your master, what does it have to do with me?<br/><br/>Gu Yang coughed lightly and said, “So much time has passed, the East Yang Faction has long since disappeared into the dust of history. Just because this person has the East Yang Sword, it does not mean he is a successor to the East Yang Faction.”<br/><br/>Why would he purposefully provoke a Sword Saint?<br/><br/>Even though the East Yang Sword Saint was only a three-tier mana realm cultivator, if he truly went into battle, even Gu Yang and the Manifestation of the Divine Ape combined might not necessarily be his match.<br/><br/>The Sky General of Golden Court was said to be in the Unleaking Realm, but his actual combat methods were pitifully few. Once Gu Yang got close, he would only be at his mercy.<br/><br/>Simply put, his tactics naturally suppressed the Sky General, but not the East Yang Sword Saint. No matter how tough the skin and flesh of the Divine Ape Manifestation was, it couldn’t withstand the edge of the peerless divine weapon.<br/><br/>If he could elevate the strength of the Divine Ape Manifestation to the three-tier mana realm, he might be able to put up a fight.<br/><br/>“Let’s go.”<br/><br/>Without hesitation, Gu Yang left that place.<br/><br/>“Father, where are we going?”<br/><br/>After leaving Liangzhou, Xi Huang couldn’t help but ask.<br/><br/>“Tianzhu Mountain.”<br/><br/>It had been a long time since Gu Yang last saw Su Qingzhi and the others. To be honest, he missed them a bit and was also a little worried.<br/><br/>The future direction of Great Zhou has long been altered beyond recognition by him. Who knows if there would be any unexpected incidents?<br/><br/>Among them, the strongest one was Pei Qianlan, who was merely First Rank.<br/><br/>He wanted Xi Huang to stay there to recover his strength and protect them at the same time.<br/><br/>Xi Huang asked, “What is that place?”<br/><br/>“You will know when we get there.”<br/><br/>From Liangzhou to Jiangzhou, nearly spanning half of Great Zhou, a distance of tens of thousands of miles.<br/><br/>With their strength, they couldn’t fly there in one go. The mana at the mana realm was not inexhaustible.<br/><br/>During a rest stop along the way, Gu Yang opened the system and conducted a routine simulation as usual.<br/><br/>Every time he obtained a large amount of energy, there was bound to be trouble. So, he wanted to predict the fortunes and misfortunes in advance.<br/><br/>“At twenty-two, you have reached the first level of mana. You killed Shen Guang, who was at the second level of mana, and your name shook the world.”<br/><br/>“You leave Liangzhou, and a few days later, you encounter three Mana Realm cultivators from the Shen Family. After a great battle, Xi Huang falls on the spot, and you, severely wounded, escape to Divine City.”<br/><br/>“[In ten days, several Unleaking Realm powerhouses appeared in the Divine City, a shocking battle ensued, a huge skull flashed in the sky and a door of time-space opened. A hand emerged and seized you, dragging you back into the time-space door.]<br/><br/>[You were taken to a cave world, where you were forced by a Celestial Being to inject mana into a stone egg.]<br/><br/>[Half a year later, you died of depletion, at the age of twenty-three.]<br/><br/>It’s Shen Family again!<br/><br/>Gu Yang was not particularly surprised, as he had just killed a Shen family powerhouse in the Mana realm. It was only natural that they would want to take revenge on him.<br/><br/>However, it turned out that a battle of the Celestial Beings’ level occurred because of him.<br/><br/>This time, not only did the one from Chi Mingtian appear, but also a powerhouse from the Three Saints Gate personally took action and captured him.<br/><br/>Teamed up with the Three Saints Gate and Chi Mingtian, even the entire Divine City combined couldn’t stop them.<br/><br/>Looking at it now, the reason the Three Saints Gate captured him was probably to resurrect the ancient Divine Beast Phoenix, which is the actual master of Blue Bird and the real father of Xi Huang.<br/><br/>Whether they succeeded or not, he was drained entirely in the end.<br/><br/>[End of simulation, you can keep one of the following items.]<br/><br/>[One, your martial arts realm at the age of twenty-three.]<br/><br/>[Two, your martial arts experience at the age of twenty-three.]<br/><br/>[Three, your life wisdom at the age of twenty-three.]<br/><br/>“Choose one.”<br/><br/>There was no need to consider this, he now possessed five Nine State Seals and a drop of the Divine Ape’s essence blood. Each simulation made the “Nine Heavens Divine Method” more profound.<br/><br/>When the other four Divine Methods also break through to the sixth layer, he would have the embodiment of five Mana Realm Divine Beasts. At that time, he would have the confidence to fight with Unleaking Realm beings.<br/><br/>A mere half-year’s cultivation wouldn’t significantly boost Gu Yang’s strength.<br/><br/>Neither Xi Huang nor Blue Bird found this unusual, they had seen stuff like this too often.<br/><br/>Gu Yang gave them a glance, couldn’t help but grumble in his mind.<br/><br/>About the Three Saints Gate matter, he definitely couldn’t ask Blue Bird. Even though it’s blind and has mistaken him for someone else, the one from the Three Saints Gate isn’t blind.<br/><br/>What would Blue Bird and Xi Huang’s reactions be if they found out he was a fraud?<br/><br/>This is a difficult pass.<br/><br/>Gu Yang started the second simulation.<br/><br/>[… You divert midway to the Divine City, you go to the Wen Academy, convince Ye Lingbo, and enter the Lunar Water Cave World.]<br/><br/>[You cultivate hard.]<br/><br/>[Two years later, Wen Jue begins her assault on the Celestial Being realm and is assassinated by two Celestial Beings. Wen Jue falls in the great battle.]<br/><br/>[Another half year later, a person appears before you, captures you, and takes you away from the Lunar Water Cave World.]<br/><br/>[You were taken to another cave world and were forced to inject mana into a stone egg.]<br/><br/>[Half a year later, you died of depletion, at the age of twenty-five.]<br/><br/>Entering the Lunar Water Cave World isn’t going to work.<br/><br/>The Celestial Being from the Three Saints Gate is much more troublesome than the one from Chi Mingtian.<br/><br/>Chi Mingtian’s Celestial Being, his real body’s in Chi Mingtian, only conveys power through his puppet in Great Zhou.<br/><br/>The Celestial Being from the Three Saints Gate, however, could personally descend upon them, leaving no place to run.<br/><br/>Furthermore, Wen Jue, the head of Dao Sect, was eliminated while assaulting the Celestial Being realm.<br/><br/>Most likely she was killed by a Celestial Being within the Lunar Water Cave World.<br/><br/>With her death, Gu Yang seemed to have lost a backer.<br/><br/>[End of simulation, you can keep one of the following items.]<br/><br/>Gu Yang still chose the first one.<br/><br/>“One more.”<br/><br/>The third simulation.<br/><br/>[…You go back to Liangzhou and enter the Golden Court Cave World.]<br/><br/>[You hide in that deep pit and focus on your cultivation.]<br/><br/>[Three years later, that monkey breaks the amnesty of Sky King, steps into the realm of Celestial Being and suddenly attacks you. You die at the age of twenty-five.]<br/><br/>Wow, it turns on a dime.<br/><br/>Gu Yang shakes his head, this path isn’t going to work either.<br/><br/>The Golden Court Cave world is extremely dangerous, there’s nowhere to go aside from that pit, as he could be found by Xuan Zhen Sky King at any time.<br/><br/>He suddenly realized that he seemed to have run out of options.\t\t\t\t\t\t</div>", "images": {}, "success": true}