{"id": 248, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132097.html", "title": "Chapter 248 - Chapter 248: 248 Kills", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 248 - Chapter 248: 248 Kills</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 248: 248 kills<br/><br/>Meanwhile, Lingyun War General, who was locked in a battle with Ziyang Heavenly General, had part of her attention on the situation unfolding with Azure Moon Sky General.<br/><br/>Given her position, she couldn’t just run away. But she wasn’t planning on fighting a losing battle either.<br/><br/>If she could stall a two-on-one fight, even for a moment, she would have fulfilled her duty.<br/><br/>If she could risk taking some minor injuries, all the better, as it would provide her with an explanation to the Sky King.<br/><br/>They were all celestial beings of the same rank. They knew each other’s tricks all too well.<br/><br/>She couldn’t outlast Ziyang Heavenly General in a one-on-one fight.<br/><br/>However, it was also impossible for Ziyang Heavenly General to defeat her.<br/><br/>Even in a two-on-one scenario, as long as she was careful not to get caught in the crossfire, it wouldn’t be easy for the two of them to kill her.<br/><br/>Lingyun War General resolved to fight and retreat at the same time when Azure Moon Sky General dealt with the person before joining the fight, thus ensuring her survival.<br/><br/>Her subordinates had already gone to get reinforcements. As long as she could delay for an hour or two, the crisis could be resolved on its own.<br/><br/>However, what she saw left her in shock.<br/><br/>Azure Moon Sky General was being brutally beaten by two Golden Core stage cultivators, a scene of utter disgrace.<br/><br/>One of them, a Golden Core stage human cultivator, was wielding a knife, managed to splice a crack in the divine shimmer protecting Azure Moon.<br/><br/>The other, a Golden Core stage Monster Ape, endured the Power of Exorcising Evil with its mortal body and with a single slap, almost broke Azure Moon’s divine shimmer.<br/><br/>She had never seen such a combat strategy. It was simply too violent; it filled her with shock and fear.<br/><br/>They were celestial beings and usually possessed an aloof demeanor. Even in battle, they defeated their enemies by casting magic. With a flick of their sleeves, the enemies would disappear into ashes. How could they physically fight like mortal beings?<br/><br/>What shocked her most was that the two beating Azure Moon Sky General were only at the Golden Core stage.<br/><br/>In the Golden Court, the hierarchy among celestial beings was extremely strict.<br/><br/>The saying “a higher rank can crush you” was not an exaggeration at all.<br/><br/>A higher rank signified overwhelming power that could easily crush lower-ranking beings, who couldn’t even put up a fight.<br/><br/>Since the establishment of the Golden Court, there had never been a case of a lower rank overcoming a superior.<br/><br/>A human could never stand a chance against a divine being of Earth element, even if they held the same title.<br/><br/>Let alone Steele coercing a Sky General. That was a sheer impossibility.<br/><br/>The situation before her eyes completely subverted Lingyun’s understanding. While she was distracted, she nearly got hit by a magic spell.<br/><br/>Boom!<br/><br/>Azure Moon Sky General was hit by the Monster Ape and slammed into Lingyun Peak like a shooting star, nearly going all the way through the mountain.<br/><br/>A massive gap formed on the mountain peak. Countless rocks collapsed.<br/><br/>Azure Moon was lodged within the stones, the golden shimmer around him much more subdued.<br/><br/>That slap from the Monster Ape had almost scattered his divine protection.<br/><br/>Suddenly, his golden light flared significantly, the mountain exploded violently.<br/><br/>In the sky, a golden light beam fell on Azure Moon, with a horrifying surge of power radiating from his body.<br/><br/>He looked up and roared loudly, “You’re all going to die!”<br/><br/>When had he ever been subjected to such humiliation?<br/><br/>Shockingly, two Golden Core stage cultivators had relentlessly beaten him to the point where his divine protection had almost collapsed. He was infinitely disgraced.<br/><br/>Azure Moon, born into the royal family of Golden Court, was the grand-nephew of Xuan Zhen Sky King.<br/><br/>Thanks to this connection, his ascent was meteoric, taking a smooth ride to the position of Sky General. He had never encountered any setbacks.<br/><br/>Today, however, he had suffered greatly in the hands of these two Golden Core stage cultivators.<br/><br/>He was furious, willing to do anything to kill these two.<br/><br/>“He’s gone mad, actually using the origin energy of the Golden Court!”<br/><br/>Seeing the falling starlight, Lingyun was astonished.<br/><br/>All the celestial beings derived their power from the Golden Court; the higher the rank, the greater the power obtained.<br/><br/>All celestial beings received fixed amounts of power from Golden Court.<br/><br/>However, there were exceptions.<br/><br/>Once a celestial being becomes a Sky General, they could utilize the origin energy of the Golden Court.<br/><br/>But this would mean that for the next few years, they would not be able to gain any power from the Golden Court.<br/><br/>It was as if they were using up several years’ quota all at once, which would grant them extraordinary power in the short term.<br/><br/>But the consequences were severe; without access to power from the Golden Court for the next few years, they would be virtually incapacitated.<br/><br/>This was a last resort for Sky Generals, a life-saving measure only used when they were cornered.<br/><br/>At this moment, Azure Moon Sky General had clearly lost his composure.<br/><br/>Once Lingyun got over the shock, she was ecstatic.<br/><br/>In this way, even if Azure Moon Sky General eliminated the two Golden Core stage juniors, he would essentially be rendered useless, no longer a threat.<br/><br/>The only remaining enemy would be Ziyang Heavenly General, whom she could certainly keep at bay until the reinforcements arrived. His death would then be certain.<br/><br/>If she could manage to kill a Sky General and snatch his pardon, she would have achieved a great feat.<br/><br/>Quite the turn of tides. A moment ago, she was only concerned about protecting herself. Now, she found herself planning a counterattack.<br/><br/>All thanks to those two Golden Core stage juniors.<br/><br/>At this point, Lingyun hoped they could hold on as long as possible. She quickly maneuvered and began her counterattack.<br/><br/>Ziyang Heavenly General was also dumbfounded. He hadn’t expected that Azure Moon, being caught off guard, would suffer such a humiliation, and even resort to using the source power of the Golden Court.<br/><br/>What a waste!<br/><br/>He grumbled internally.<br/><br/>A dignified Sky General was being humiliated by two mere Golden Core stage cultivators. It was an absolute disgrace to the Sky Generals.<br/><br/>Yet, he couldn’t just abandon Azure Moon and run.<br/><br/>Azure Moon had some familial ties with the Sky King. If he were to die here and Ziyang made it back alone, he would face a dire outcome.<br/><br/>Frustrated, Ziyang felt the pressure mounting. Lingyun War General was counterattacking.<br/><br/>He yelled out in anger, “Kill them quickly!”<br/><br/>“Damn it!”<br/><br/>Seeing that Unleaking Realm powerhouse’s intensified strength, Gu Yang cursed under his breath.<br/><br/>At this point, he had no choice but to go all out.<br/><br/>In the sky, a layer of dark clouds quickly formed, with torrents of lightning roiling within like serpents.<br/><br/>Azure Moon Sky General was about to unleash his most powerful spell to annihilate those two annoying beings.<br/><br/>However, executing this magic required a bit of time.<br/><br/>Currently, the divine shimmer around him was many times stronger than before, strong enough to withstand a full-force attack from a divine being of Earth element.<br/><br/>Those two insignificant Golden Core stage cultivators couldn’t possibly break this divine light.<br/><br/>This magic was called Sky Execution and Earth Obliteration!<br/><br/>Gu Yang floated in the air, raising his Phoenix Feather Knife high up, his eyes icy cold, devoid of any emotion.<br/><br/>A bizarre wave spread in all directions.<br/><br/>The sky cleared up, with the thunder disappearing and the clouds dispersing.<br/><br/>“What is this magic?”<br/><br/>Azure Moon was in the middle of casting his magic, but was interrupted by that bizarre wave. He was astonished, as if he was experiencing the pressure of a Sky King.<br/><br/>Soon after, the mana within him was rapidly dissipating.<br/><br/>Even the protective divine glow dimmed.<br/><br/>The enhancing forces that he had just obtained from the Golden Court had dissipated by half in an instant.<br/><br/>“A Sky King?”<br/><br/>For a moment, Qingyue was so frightened that his heart and courage were shattered.<br/><br/>He felt as if he was facing a Sky King.<br/><br/>‘Divine Annihilation’, the fourth style, Celestial Decay!<br/><br/>Gu Yang used this lethal saber technique that he had not yet fully mastered. This move was extremely mysterious. Once executed, it could strip away an opponent’s mana, submitting them into the disaster of Celestial Decay.<br/><br/>Although he hadn’t fully learned this move, he could only strip away their mana. As for letting them fall into the disaster of Celestial Decay, he was not capable of doing that yet.<br/><br/>However, it was enough!<br/><br/>A golden shadow lunged toward Qingyue, who was suspended in mid-air, catching him, it was the Divine Ape’s incarnation.<br/><br/>“Roar!”<br/><br/>The Divine Ape, with one hand on the head and one on the foot, let out a startling roar and yanked hard.<br/><br/>“No!”<br/><br/>Qingyue completely lost his capacity to defend and could only let out a desperate scream.<br/><br/>With a crisp sound, his protective divine light shattered around him.<br/><br/>A ripping sound –<br/><br/>Blood sprayed out, and Qingyue’s body was torn in half, his organs spilling to the ground.<br/><br/>Regrettably, a Sky General fell victim on the spot.<br/><br/>Thud Thud Thud –<br/><br/>The enraged Divine Ape pounded on its chest, as if boasting of its victory.<br/><br/>At this moment, a golden light rapidly congealed over the corpse of the Qingyue Sky General, ready to fly away.<br/><br/>The Divine Ape, quick to react, reached out and caught it.<br/><br/>As the golden light darted left and right in the palm of his hand, how could it escape his grip?<br/><br/>“Dead?”<br/><br/>“Dead!”<br/><br/>The fight between the Ziyang Heavenly General and the Lingyun War General was, indeed, lively, but both were paying attention to the battle unfolding elsewhere.<br/><br/>When they saw Qingyue, the Sky General, being ripped in half by the monstrous ape, they were both stunned.<br/><br/>The next moment, Ziyang Heavenly General turned and fled, taking the brunt of a magic attack, dimming his protective divine glow significantly. However, he successfully escaped from the Lingyun Divine General and frantically fled in the direction from which he had come.<br/><br/>What kind of monster was this?<br/><br/>Qingyue, who had borrowed the original Star Power from the Golden Court, was actually killed.<br/><br/>If he stayed here any longer, he was sure to be on a path to death.<br/><br/>The scene just now, with Qingyue being torn apart alive, had chilled his courage. He wished he could have been born with more legs to run as fast as he could.<br/><br/>The Lingyun War General was also shocked, her face drained of color; she even forgot to pursue the fleeing Ziyang Heavenly General.<br/><br/>At this point, she dared not regard the man and the monster before her as mere Golden Core juniors.<br/><br/>If they could kill Qingyue, the Sky General, they could undoubtedly kill her too.<br/><br/>In her eyes, these two – one man, one monster – were much more terrifying than Qingyue and Ziyang put together.<br/><br/>She took a defensive position, ready to escape at any time.<br/><br/>Fortunately, the other side merely glanced at her before leaving, disappearing in the blink of an eye.<br/><br/>Lingyun released a sigh of relief as she looked at these two killers leaving. With Qingyue’s corpse torn in half in front of her, she was still frightened.<br/><br/>About half an hour later.<br/><br/>A golden light flew from the sky, in the blink of an eye it was by her side.<br/><br/>The reinforcements had finally arrived.<br/><br/>Lingyun hurried forward to greet him, “I greet you, Wencheng Sky General.”<br/><br/>The one who arrived was an Earthly General, a rank higher than her. He was dressed like a scholar, the Wencheng Sky General himself. Seeing only her, he asked, “Where is the enemy?”<br/><br/>“One is dead, one has run away.”<br/><br/>Wencheng Sky General looked at her in disbelief, “Weren’t the opponents two Human Generals? You managed to kill one with outnumbered odds?”<br/><br/>“It wasn’t me.” Lingyun quickly explained, “It was two cultivators. One human, the other from the Monster Race.”<br/><br/>“Cultivators?”<br/><br/>Wencheng Sky General’s eyes narrowed, “Are there Nascent Soul cultivators within Wanjiang Country?”<br/><br/>Lingyun swallowed, finding it somewhat hard to say, “They are not of the Nascent Soul Stage, both are in the Golden Core Stage.”<br/><br/>Wencheng Sky General looked at her for a moment, his gaze turning icy, “Are you trying to deceive this God?”<br/><br/>“I dare not!”<br/><br/>Lingyun quickly bowed, her mouth slightly bitter.<br/><br/>To tell the truth, if she hadn’t witnessed it herself, she would also never believe, that such absurd things would happen.<br/><br/>She then recounted the events that had just happened, precisely as they unfolded.<br/><br/>Elsewhere, Gu Yang and Xi Huang had already escaped a great distance. The incarnation of the Divine Ape had been retracted back into his body.<br/><br/>He said solemnly, “We have to leave the Golden Court.”<br/><br/>The power system of this world and the level of combat seemed a bit shabby, but some magic was also quite mysterious.<br/><br/>He had clearly escaped from those Unleaking Realm powerhouses before, but two days later, they had managed to catch up. They obviously had special tracking techniques.<br/><br/>This time, he killed an Unleaking Realm powerhouse. He was worried that the Celestial Being would personally come to kill him.<br/><br/>That Celestial Being, who could very well know some kind of space-transferal magic.<br/><br/>In the simulation, the other party had suddenly appeared inside the pit where the corpse of the Divine Ape was located.<br/><br/>Once targeted by such a person, there’s no escape.<br/><br/>Xi Huang naturally had no objections and nodded in agreement.<br/><br/>Gu Yang activated the Divine Phoenix Technique, transforming into a Phoenix, carrying Xi Huang, and flying to Heavenly Gang Mountain at the fastest speed.<br/><br/>In less than half a day, they reached Heavenly Gang Mountain.<br/><br/>Gu Yang returned to human form, and together with Xi Huang, they landed and approached the entrance to the cavern, which led to the pool.<br/><br/>[Energy source detected, recharge?]<br/><br/>He had been holding on to the badge of Qingyue Sky General, and now chose to charge it.<br/><br/>[Successful recharge, 100 units of energy obtained, current balance 118 units.]<br/><br/>A hundred units!<br/><br/>Worthy of an Unleaking Realm powerhouse!<br/><br/>Gu Yang was impressed, and holding Xi Huang, jumped into the pool.<br/><br/>Just moments later, a vortex appeared in the sky above Heavenly Gang Mountain, and a figure stepped out of it, eventually arriving at the cave entrance.<br/><br/>She stared at the deep cave, her face changing several times, apparently fearful of what lay beyond the entrance.<br/><br/>In the end, she turned around, stepped back into the vortex, and disappeared.<br/><br/>Heavenly Gang Mountain once again returned to its peaceful state.<br/><br/>PS: A big chapter of 3800 words, ask for a monthly ticket.\t\t\t\t\t\t</div>", "images": {}, "success": true}