{"id": 247, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132095.html", "title": "Chapter 247 - Chapter 247: 247 Battle Sky Marshal", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 247 - Chapter 247: 247 Battle Sky Marshal</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 247: 247 Battle Sky Marshal<br/><br/>Hundreds of miles away, two streaks of golden light cut through the sky like a couple of shooting stars. These were the very two Divine Generals who besieged Heavenly Gang Mountain that day.<br/><br/>“He’s on the move, and he’s incredibly fast. Could he have discovered us?”<br/><br/>The Ziyang Heavenly General communicated telepathically.<br/><br/>Both of them were human Nascent Souls, possessing the Divine Power of a Thousand-mile Sight. Nothing within a thousand miles could escape their eyes.<br/><br/>They were the only ones who had faced the man who had killed two Star Ambassadors. Naturally, the task of pursuing him fell to them.<br/><br/>The Blue Moon Heavenly General coldly stated, “He can’t escape.”<br/><br/>His tone was filled with a piercing murderous intent.<br/><br/>Initially, they had eradicated Heavenly Gang Mountain on this mission, which would have been a great achievement to present to the Sky King.<br/><br/>However, because of that cultivator, he lost his two most significant subordinates, and upon returning to the Golden Court, he endured the Sky King’s punishment.<br/><br/>Unless he tore that man to pieces, he couldn’t quench the vengeance in his heart.<br/><br/>Ziyang Heavenly General, being more level-headed, cautioned, “We are about to enter the territory of Wanjiang Country. We must be careful.”<br/><br/>The Golden Court Heaven of today was divided into three nations.<br/><br/>Their Golden Court Country was the orthodox and boasted the most Heavenly Generals, the widest territory, and the greatest strength.<br/><br/>Wanjiang Country, backed by the Wanjiang Sky King and possessing a piece of the Golden Emperor’s Jade Book, could also confer immortal positions. Although its strength couldn’t match that of Golden Court Country, it had no shortage of Heavenly Generals.<br/><br/>If the two of them were to enter the territory of Wanjiang Country and be discovered, they would definitely be besieged by numerous Heavenly Generals, and the consequences would be dire.<br/><br/>At this moment, the Blue Moon Heavenly General had been blinded by hatred and couldn’t heed the warning. He retorted, “It’s just a Golden Core cultivator. I could crush him with one hand. Why should we fear?”<br/><br/>Ziyang Heavenly General remained silent.<br/><br/>He was merely being cautious and giving a warning. In reality, he also didn’t take that cultivator seriously.<br/><br/>For the Sky King to send them, two Heavenly Generals, after a small fry in the Golden Core Realm was somewhat overkill.<br/><br/>The duo increased their speed again, slowly closing the distance with their target.<br/><br/>“Damn, those two Heavenly Generals are catching up.”<br/><br/>Blue Bird finally sensed the presence of the two Heavenly Generals. Its tone turned extremely anxious.<br/><br/>Gu Yang did not say anything. With one hand, he pulled Xi Huang, flying forward at maximum speed.<br/><br/>When the two streaks of golden light from behind reached within fifty miles, a towering mountain peak came into view from a distance.<br/><br/>“We’re here!”<br/><br/>Upon spotting the peak, Gu Yang was certain in his heart.<br/><br/>In his last simulation, it was at such a towering mountain peak that he managed to shake off the chase of two Unleaking Realm Powerhouses.<br/><br/>As long as he lured them over, he could get some assistance.<br/><br/>Behind him, the two Heavenly Generals noticed the mountain peak and frowned instinctively.<br/><br/>Ziyang communicated through telepathy, “The kid actually ran to Lingyun Peak. If Lingyun takes action, I’ll block her. You kill the boy. A swift battle ends swiftly.”<br/><br/>They had already entered the territory of Wanjiang Country.<br/><br/>Neither of them could believe that the kid was actually able to run all the way to this place.<br/><br/>The resident of Lingyun Peak was a Heavenly General from Wanjiang Country. They were unsure whether the kid stumbled upon this place by accident or if this was his plan all along.<br/><br/>Facing a formidable opponent of the same level, he had no choice but to be cautious.<br/><br/>“Halt!”<br/><br/>In what felt like an instant, the four, being one bird, one pursued and two pursuers, were near Lingyun Peak. Suddenly, an overwhelming voice resounded.<br/><br/>A streak of golden light shot out, calling out, “Blue Moon, Ziyang, do you want to start a war between the two nations?”<br/><br/>The one who showed up was none other than Lingyun, Heavenly General of Wanjiang Country.<br/><br/>In the present Golden Court Heaven, where three powers coexisted, countless battles had been fought over the past thousand years, but no one could outlast the other.<br/><br/>In the end, even the three Sky Kings grew annoyed and entered a stalemate.<br/><br/>This state of affairs had held for almost a hundred years.<br/><br/>Although occasional minor frictions occurred, there was no more fighting between the Heavenly Generals.<br/><br/>Considering that now two Heavenly Generals from Golden Court Country had unexpectedly trespassed into the territory of Wanjiang Country, it was no wonder she was alarmed.<br/><br/>Since they were equal in rank, Lingyun, forced to take on two opponents simultaneously, naturally felt an immense pressure.<br/><br/>However, she couldn’t avoid the battle. A Heavenly General’s duty was to protect their territory. She couldn’t flee without a fight and risk the Sky King’s punishment afterward.<br/><br/>Ziyang retorted, “We have no intention of starting a war. We just want to kill those two cultivators and then we will leave immediately.”<br/><br/>As he spoke, the two sides were within a mere twenty miles of each other.<br/><br/>Seeing that the other party had no intention of stopping, the Lingyun Divine General didn’t hesitate and released a golden light toward the two.<br/><br/>She didn’t believe a single word coming from the Ziyang Heavenly General.<br/><br/>If they were allowed to approach and suddenly launched a sneak attack, it would be impossible to escape.<br/><br/>The Lingyun Divine General was very clear, given the slightest opportunity, they would certainly seize the chance to kill her.<br/><br/>The sentiment was mutual.<br/><br/>For the three nations, killing the opponent’s deity and acquiring an imperial edict not only weakened the opponent’s power, but also strengthened their own.<br/><br/>Because of this, there was absolutely no trust between the deities of the three nations.<br/><br/>The Ziyang Heavenly General expected this outcome and released a golden light to block the attack from the Lingyun War General.<br/><br/>Meanwhile, the Qingyue Sky King continued to pursue their goal—they suddenly dropped in altitude and landed on Heavenly Gang Mountain.<br/><br/>“You can’t escape, give me your life!”<br/><br/>The Qingyue Sky King roared, raising his hand and releasing a golden light. With a loud bang, it hit the Golden Core cultivator directly, knocking him down.<br/><br/>Having succeeded in his strike, he was somewhat surprised, “Huh, he’s not dead?”<br/><br/>This attack was a celestial general-level magic. Even Nascent Soul level cultivators would be injured if they were hit by it.<br/><br/>This kid really had some tricks up his sleeve.<br/><br/>“Not good!”<br/><br/>Suddenly, he found that the opponent was continuously going underground, his complexion changed instantly.<br/><br/>The man intended to escape underground.<br/><br/>Qingyue hurriedly pursued him, when he was close to the ground, a gust of wind hit him head-on.<br/><br/>“What is this?”<br/><br/>He was taken aback, before him was a furry giant hand. Its golden hair, shining with golden light in the sun.<br/><br/>Where did this beast come from?<br/><br/>Without thinking, Qingyue shot out a golden light, hitting the chest of the giant beast and sending it flying.<br/><br/>Now he could finally see clearly—it was a huge golden ape, over three meters tall, but its movements were incredibly agile.<br/><br/>After being hit, the ape bounced from the ground and rushed at him once more.<br/><br/>His eyes nearly popped out of his head.<br/><br/>It had been hit by his magic, yet it was unharmed.<br/><br/>How was that possible?<br/><br/>After becoming a celestial general, one could master many spells, but the most powerful one was this golden light, also known as the Power of Exorcising Evil.<br/><br/>Other spells were either not powerful enough, or required too much time to prepare.<br/><br/>Right now, the fight was taking place in mere moments, where was there time for him to prepare a powerful spell?<br/><br/>It was said that over a thousand years ago, the celestial beings in the Golden Court all had corresponding Spirit Tool Magic Treasures, which were extremely powerful.<br/><br/>However, after the battle a thousand years ago, the Spirit Tools Magic Treasures were all taken by the cultivators of the Xia Dynasty.<br/><br/>Nowadays, very few people have Spirit Tools or Magic Treasures. Only those who have made significant contributions could possibly be granted one.<br/><br/>Of course, Qingyue did not have one.<br/><br/>At that moment, facing this terrifying beast up close, he was a bit flustered and he released another wave of golden light.<br/><br/>The Power of Exorcising Evil, which could be activated as soon as he thought of it, was faster than lightning. The golden ape could not dodge it and was hit again.<br/><br/>This time, Qingyue saw blood at the corner of its mouth and felt a bit relieved. It seemed that after a few more hits, he could kill it.<br/><br/>Just then, he felt a chill on his back, a chill that went straight to his forehead.<br/><br/>A knife suddenly appeared behind him.<br/><br/>“It’s him!”<br/><br/>Qingyue couldn’t believe that the Golden Core boy who had dodged underground would appear behind him at this moment.<br/><br/>Just now, he was so focused on the golden ape in front of him that he failed to notice when the boy moved behind him.<br/><br/>Crack!<br/><br/>His Protective Golden Light barely blocked the knife, but a crack appeared.<br/><br/>Qingyue was horrified, this Protective Divine Light, impervious to all laws, difficult to hurt by Spirit Tools, capable of withstanding three Power of Exorcising Evil attacks, was a celestial general’s life-saving technique.<br/><br/>Yet it was nearly broken by a Golden Core boy.<br/><br/>“Dammit!”<br/><br/>Qingyue gritted his teeth, about to retaliate, when suddenly a big fluffy hand appeared in front of him and pushed him down.<br/><br/>PS: Third update, please vote for the monthly ticket.\t\t\t\t\t\t</div>", "images": {}, "success": true}