{"id": 246, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132093.html", "title": "Chapter 246 - Chapter 246: 246 The First Incarnation", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 246 - Chapter 246: 246 The First Incarnation</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 246: 246 The First Incarnation<br/><br/>“The master is finally about to unseal himself again!”<br/><br/>The Blue Bird fluttered its wings, exclaiming excitedly.<br/><br/>In its view, Gu Yang would experience a sudden surge in his cultivation level every now and then, as if he was unsealing himself.<br/><br/>However, how is this energy signature related to the Divine Ape?<br/><br/>“When did the master start practicing the ‘Nine Heavens Divine Method’?”<br/><br/>It was greatly shocked at heart.<br/><br/>As an ancient divine beast, it had its own pride, possessing the ancient heritage in its bloodline, and mastered the pinnacle divine powers in the world.<br/><br/>Compared to this, humans were just fast bloomers. In terms of foundation and history, they could hardly compete with the Monster Race.<br/><br/>No being of the Monster Race would cultivate using human techniques.<br/><br/>The master took a step no being of the Monster Race would ever take. He chose to practice the cultivation methods of the human race, and he was successful.<br/><br/>The Blue Bird’s eyes moistened.<br/><br/>The master had paid too much for the great revival of the Monster Race.<br/><br/>Next, the aura on Gu Yang surged several times.<br/><br/>By the sixth time, the momentum on his body reached a peak.<br/><br/>Suddenly, a golden phantom flew out of his forehead, continuously enlarging until it transformed into a golden-haired monkey, emanating a violent aura.<br/><br/>The incarnation of the Divine Ape was a success!<br/><br/>‘Divine Ape Technique’, sixth stage – Condense an incarnation equivalent to the Mana realm.<br/><br/>At this point, Gu Yang entered a peculiar state where he could multitask, controlling the ape incarnation while still maintaining full control of his body.<br/><br/>The power within the Divine Ape incarnation was so violent it stirred a strong impulse in his heart to shatter the mountain.<br/><br/>“So strong!”<br/><br/>Gu Yang felt that the strength of this Divine Ape incarnation was not inferior to his own.<br/><br/>In the future battles, the main body and the incarnation would fight together, their minds linked. It wouldn’t be as simple as one plus one equals two.<br/><br/>A moment later, Gu Yang retracted the incarnation, which finally transformed into a monkey tattoo on his arm.<br/><br/>“Master, how did you learn Xia Emperor’s ‘Nine Heavens Divine Method’?” The Blue Bird finally found the opportunity to voice its question.<br/><br/>It remembered, before the rise of the Xia Emperor, the master had already completed his final reincarnation.<br/><br/>Gu Yang didn’t know how to explain, so he changed the topic, “Underneath us, there is a body of a Divine Ape.”<br/><br/>The Blue Bird was successfully distracted, “Not surprising. Among the Monster Race, there were also some traitors who willingly served humans. Among them was one Divine Ape, this one should be its descendant.”<br/><br/>“Let’s go, take a look.”<br/><br/>Gu Yang leapt down, continuing to fall.<br/><br/>After falling nearly a hundred kilometers, he finally reached the ground.<br/><br/>Below was a vast space. The first thing Gu Yang saw was a huge body, over a hundred meters tall, with a large opening in its chest.<br/><br/>It was definitely the body of the Celestial Being Realm Divine Ape.<br/><br/>“I am honored by the visit of two esteemed guests.”<br/><br/>Suddenly, a voice began to sound abruptly.<br/><br/>Gu Yang was surprised. There were actually people here?<br/><br/>Someone who could hide from his perception must be at least in the Unleaking Realm.<br/><br/>He looked towards the source of the sound and saw a “person” sitting on top of the ape’s body.<br/><br/>No, that was clearly an ape. It was holding a piece of purple crystal and sitting cross-legged. At first glance, it really looked like a person.<br/><br/>The ape spoke with fascination, “I actually sensed the same kind of energy from you. That’s really rare.”<br/><br/>At this moment, the Blue Bird suddenly shouted, “Master, don’t be afraid of it. It wanted to forcibly crack the seal of the Sky King, but hadn’t been to the Golden Court to accept the canonization, and suffered a backlash. It can’t move now.”<br/><br/>“Surely it doesn’t know that to lift the Sky King’s seal, one needs to go to the Golden Court, announce to Heaven and Earth, get officially canonized and only then acquire the position of Sky King.”<br/><br/>The ape let out a sigh, “This bird is not simple. If I knew this, I wouldn’t have ended up in this state.”<br/><br/>After listening to their conversation, Gu Yang suddenly understood.<br/><br/>No wonder that after luring the two Celestial soldiers here, he was able to kill them.<br/><br/>Moreover, the Celestial Being acting personally was due to the Sky King’s amnesty, right?<br/><br/>If we were to get this Sky King’s amnesty, we could quickly cultivate a Celestial Being realm fighter, anyone would be tempted.<br/><br/>As Gu Yang thought about the consequences of this leak, he felt terrified.<br/><br/>If such a thing appeared in Great Zhou, there would immediately be chaos everywhere, all Unleaking Realm experts would scramble for it. Even Celestial Beings would be unable to resist.<br/><br/>The ape said, “I see both of you are cultivators, this amnesty is useless to you. Why not become friends? You keep the secret for me, and I can give you a drop of the Divine Ape’s Essence Blood.”<br/><br/>Gu Yang was actually more interested in that corpse, but he knew that the other party would definitely not agree.<br/><br/>The Little Green Bird quietly reminded, “Master, it’s already halfway into the Nascent Soul realm, it’s better not to upset it.”<br/><br/>A powerful opponent close to the Celestial Being realm, Gu Yang plus the incarnation of the Divine Ape, they would definitely lose.<br/><br/>Once they upset, while the other party will surely pay a huge price, there is also a high probability dey may kill him.<br/><br/>It’s not worth it for just a corpse.<br/><br/>“Okay.”<br/><br/>Gu Yang agreed to this condition.<br/><br/>After receiving the Essence Blood, Gu Yang carefully preserved it and made a vow not to reveal the matter of the Sky King’s amnesty.<br/><br/>Then, he didn’t immediately leave and asked, “How did this Divine Ape die?”<br/><br/>No one is more aware than him of the immense strength of a Divine Beast.<br/><br/>The combined strength of a Celestial Being realm Divine Ape with the power bestowed by the Golden Court amnesty, how strong would that be?<br/><br/>Gu Yang was very curious about who could slay such a powerful being.<br/><br/>Could it be a powerful entity rumored to be beyond Celestial Beings?<br/><br/>The ape said, “You’re not from this world, are you?”<br/><br/>“Correct.”<br/><br/>Gu Yang agreed straightforwardly. They were so different from people in this world from head to toe, they wouldn’t be able to hide from such a powerful being.<br/><br/>“The Sky King was killed by an alien power. Over a thousand years ago, a group of cultivators claiming to be from the Xia Dynasty came to this world. They burned, killed and looted wherever they went.”<br/><br/>“At that time, the Golden Court had six Sky Kings, and the Sky King was the most powerful. The six Sky Kings fought a bitter battle with that group of Xia Dynasty cultivators. In the end, five of the Sky Kings died.”<br/><br/>“That group of Xia Dynasty cultivators invaded the Golden Court and stole a Nine Suns amnesty and split the Gold Emperor’s jade book into three parts. Since then, Golden Court has been split into three.”<br/><br/>Gu Yang recalled a rumor that the King of Liang during the Xia Dynasty once discovered an ancient ruin and obtained an Abnormal Treasure.<br/><br/>This must be the matter in question.<br/><br/>This King of Liang was rather bold, killing five Celestial Being realm powerhouses and even breaching the Golden Court.<br/><br/>If just a King of Liang had such strength, how powerful the Xia Emperor must be?<br/><br/>Gu Yang felt he might have greatly underestimated the strength of the Xia Dynasty.<br/><br/>If that’s the case, then the strength of the Four Great Sacred Lands should be reassessed.<br/><br/>Especially that Chiming Tian.<br/><br/>Gu Yang and the Green Bird left the pit and returned to the surface, finding several more people outside the cave.<br/><br/>The girl’s brother and several other villagers.<br/><br/>The girl’s brother was standing there dazed with a swollen face, while the other strong villagers were trembling on their knees.<br/><br/>Obviously, they already knew about the girl becoming the Mountain Goddess.<br/><br/>Gu Yang didn’t plan to get involved in this matter. After leaving the cave, he flew away with Xi Huang.<br/><br/>He hadn’t forgotten that there were two Unleaking Realm powerhouses on their way and needed to hurry to leave.<br/><br/>After six simulations, no matter which direction he fled in, the two men could always catch up. They clearly had special tracking skills.<br/><br/>If he couldn’t escape, he would have to face a battle.<br/><br/>Gu Yang needs to find a suitable battlefield.<br/><br/>Facing two opponents with one, he has no confidence, what’s needed now is to create an opportunity to face one. The Divine Ape incarnation he just assembled will give his opponent a big surprise.\t\t\t\t\t\t</div>", "images": {}, "success": true}