{"id": 243, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132087.html", "title": "Chapter 243 - Chapter 243: Star Killer 243", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 243 - Chapter 243: Star Killer 243</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 243: Star Killer 243<br/><br/>You can understand it that way.<br/><br/>Gu Yang thought this way, but he didn’t delay, and said, “Let’s go quickly.”<br/><br/>After leaving the cave, they could see from a distance, three people in the sky battling, shaking the earth with each strike.<br/><br/>Boom!<br/><br/>Not too far away, a ray of golden light fell on top of a mountain, followed by a loud noise, causing the entire mountain to begin crumbling.<br/><br/>This kind of devastating power was very rare among warriors.<br/><br/>Warriors trained from a young age, mastering complete control over their own strength. It was this habit formed since childhood that even when reaching the realm of Mana, they rarely squander their power like this.<br/><br/>If a strong person at the Divine Power stage allowed the aftermath of his strike to crumble a mountain, he would probably be laughed at. How weak must his control power be?<br/><br/>For warriors, if their attack doesn’t hit the opponent, no matter how powerful their strength is, it’s useless.<br/><br/>Of course, this also has to do with the warriors’ overall low volume of Mana.<br/><br/>Under equivalent realms, a warrior at the Mana realm has probably only one-tenth the Mana volume of a cultivator at the Golden Core stage.<br/><br/>Those three in the sky battling were at least equivalent to the cultivation level of the Unleaking realm.<br/><br/>Looking at the situation, it was a two-versus-one fight.<br/><br/>The one being besieged was obviously at a disadvantage and being beaten down.<br/><br/>At this moment, Blue Bird exclaimed in surprise, “Huh, Golden Court and Heavenly Gang Manor are actually fighting each other. That’s really rare.”<br/><br/>“Let’s go.”<br/><br/>Gu Yang sensed that two of them battling in the sky had turned their gaze downwards. Instantly feeling tremendous pressure, he took Xi Huang and ran.<br/><br/>In the sky, one of the golden armored generals shouted orders, “Tianwei Star, Tianjiu Star, go and capture those two.”<br/><br/>“Yes.”<br/><br/>Not far away, two figures covered in silver light responded and flew towards them.<br/><br/>“Master, be careful. We’re being chased. They’re two Star Messengers, one of the Thirty-Six Heavenly Gangs.”<br/><br/>Blue Bird yelled.<br/><br/>Gu Yang didn’t need to turn his head to sense the two enormous forces tracking them at high speed.<br/><br/>Their power level was comparable to the Third Heaven of the Mana Realm, but their total volume of Mana was astronomical.<br/><br/>He had encountered a Third Heaven of the Mana Realm before, that guy from the Luo family. Compared to these two, his Mana was only about one-tenth.<br/><br/>The two of them spared no effort to escape at the fastest speed in one direction.<br/><br/>The two silver lights were hot on their heels, not slowing down in the least.<br/><br/>After a quarter of an hour, Gu Yang saw that they couldn’t shake off the two chasing them. He knew that if he didn’t deal with these two, it would be trouble when the two powerful cultivators from the Unleaking Realm catch up after defeating their enemies.<br/><br/>Thinking of this, he suddenly stopped, turned around, and said to the two behind him, “If you two are willing to let us go, I can offer this Magic Treasure.”<br/><br/>As he spoke, he took out the sword he obtained from Lu Yunshan.<br/><br/>The two figures were enveloped in beams of silver light, making it impossible to see them clearly.<br/><br/>Upon hearing the word “Magic Treasure”, both of them stopped, paying rapt attention to the sword in his hand. The silver light on their body intensified.<br/><br/>The two looked at each other, one of them said, “Okay, toss that Magic Treasure over here first.”<br/><br/>Without hesitation, Gu Yang threw the sword out.<br/><br/>The other person laughed wildly, “Naive, even if we kill you, the Magic Treasure will still be ours!” As he said it, he immediately lunged.<br/><br/>However, Gu Yang was faster. A trace of Blade Intent was already in front of him.<br/><br/>Gu Yang needed just one chance to get close to them.<br/><br/>When their attention was drawn by the Magic Treasure and unwittingly stepped within Gu Yang’s fifty-meter range, their fate was sealed.<br/><br/>Sky-Querying Nine-Slashes, first strike, Emergence of Chaos!<br/><br/>Tianwei Star never expected that a person’s speed could be faster than a Magic Treasure. His thoughts just started, and his magic hadn’t yet formed when the blade slashed onto his protective light barrier.<br/><br/>Chi!<br/><br/>The Phoenix Feather Knife effortlessly broke through the silver light, beheading the man inside, while the violent Blade Intent pulverized his head.<br/><br/>Meanwhile, the other guy’s attention was all on the Magic Treasure, on guard for any possible trick. The moment he was distracted, his companion was killed.<br/><br/>In an instant, he was so shocked that his soul nearly scattered. He turned to escape, but just as the thought came, a streak of Blade Intent had already arrived.<br/><br/>“No”<br/><br/>He had never seen this method of combat before.<br/><br/>Who would wield a magic treasure like a weapon, using it to slash people like a warrior in the mortal realm?<br/><br/>The divine luminescence protecting his body, capable of blocking spirit tools, was torn like paper. The next moment, he knew nothing else, plunged into eternal darkness.<br/><br/>Two powerhouses comparable to the third layer of the Mana Realm lost their lives in such a muddled manner. It was the extreme of frustration.<br/><br/>With their strength, if they had played their advantages, Gu Yang would not have been their match at all.<br/><br/>They were only easily killed by Gu Yang because of momentary greed and carelessness, plus they had never encountered such an attack method before.<br/><br/>Blue Bird cheered, “Master is mighty!”<br/><br/>After killing the two men, Gu Yang felt strange that the system didn’t prompt him about gaining energy.<br/><br/>What’s going on?<br/><br/>Just as he was puzzled, he saw two rays of light flying out from the corpses of the two men, about to fly away.<br/><br/>Blue Bird hurriedly said, “Quickly stop them, those are the Golden Orders conferred by the Golden Court.”<br/><br/>Gu Yang didn’t need it to remind him, with a swipe of his hand, he grabbed the two rays of light.<br/><br/>Two golden tokens were in his hand, struggling left and right, trying to break free.<br/><br/>[Energy source detected, recharge?]<br/><br/>So that’s what it is, these things were the energy cores of the two men.<br/><br/>“Yes.”<br/><br/>[Recharge successful, received sixty blocks of energy, current balance seventy-eight blocks.]<br/><br/>Sixty blocks?<br/><br/>Gu Yang was delighted, this gamble was worth it.<br/><br/>It seemed, killing one in the third layer of Mana Realm would give thirty blocks of energy.<br/><br/>Ten blocks for the first layer, twenty blocks for the second layer, I wonder how much energy an Unleaking Realm is worth?<br/><br/>Blue Bird urged, “Let’s go quickly, or those two Heavenly Generals will catch up with us.”<br/><br/>Gu Yang knew it was referring to the two powerful beings of the Unleaking Realm, didn’t delay, scoured the two men’s belongings, and left the scene.<br/><br/>“What?”<br/><br/>Elsewhere, the Qingyue Heavenly General sensed that he had lost contact with his two subordinates, his heart quaking as he turned to look in that direction.<br/><br/>The Ziyang Heavenly General next to him noticed his abnormality and asked, “Brother Qingyue, what’s wrong?”<br/><br/>At this point, the battle was nearly over, they had suppressed the enemy together, leaving him no chance to turn the table.<br/><br/>Qingyue Heavenly General’s expression was extremely ugly, he gritted his teeth, “Tianweixing and Tianjiuxing are dead!”<br/><br/>Ziyang Heavenly General was shocked, “How could this happen? Those two, they are clearly only in the early stage of the Golden Core. They can’t possibly be opponents of the two Stellar Generals.”<br/><br/>“No matter who it is, if they dare to kill my subordinates, I will tear them to pieces.”<br/><br/>Qingyue Heavenly General had lost two Stellar Generals, he was incredibly hurt.<br/><br/>You have to understand that among the entire Golden Court, there are only thirty-six Stellar Generals.<br/><br/>He had made countless feats and was awarded two Stellar general golden orders by the Sky King. Because of this, he was top-tier among all the Heavenly Generals.<br/><br/>Now, his two most capable subordinates were dead. It was like chopping off his left and right arm. How could he not be furious?<br/><br/>Ziyang Heavenly General couldn’t help but feel sympathy, advised, “This time, we caught the old immortal and broke through the Heavenly Gang Mountain. We made great achievements. If we ask the Sky King, maybe we can get a conferment.”<br/><br/>“Hahahaha…”<br/><br/>Suddenly, an old man locked by two iron chains laughed wildly, “You don’t know what you’ve done. For the selfish desires of Sky King Xuan Zhen, she destroyed Heavenly Gang Mountain. The Golden Court will surely be destroyed by her in the future…”<br/><br/>With that, a Nascent Soul flew out of his eyebrows, and a terrifying power exploded!<br/><br/>“Not good!”<br/><br/>The faces of the two Heavenly Generals changed greatly, frantically escaping.<br/><br/>Gu Yang, who had run far away, sensed a destructive power coming from a distance. He was a bit surprised and looked back.<br/><br/>Blue Bird said with a lingering fear, “The Nascent Soul self-detonated, thankfully we ran fast, otherwise, we would definitely be dead.”<br/><br/>Gu Yang said, “You seem to be very familiar with the power system of this world.”<br/><br/>“Of course, back in the day, I led the Monster Race army and fought hundreds of battles with the Golden Court.” Blue Bird immediately began to talk enthusiastically.\t\t\t\t\t\t</div>", "images": {}, "success": true}