{"id": 244, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132089.html", "title": "Chapter 244 - Chapter 244: 244 Golden Court System", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 244 - Chapter 244: 244 Golden Court System</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 244: 244 Golden Court System<br/><br/>Gu Yang didn’t know whether it was boasting or speaking truthfully. Regardless of its glorious past, it was now just an insignificant Little Green Bird.<br/><br/>“You just mentioned the term ‘Star Envoy’ and ‘Sky King.’ What are these things?”<br/><br/>The Blue Bird perched on his shoulder and said while grooming its feathers mussed by the wind, “When the Gold Emperor established the Golden Court, he created a celestial system.”<br/><br/>“This system allows a mortal to ascend to a godly rank through the conferment of power, thereby possessing the strength corresponding to the godly position.”<br/><br/>“The two tokens we mentioned earlier are Remarkable Golden Orders. The position assigned is that of a ‘Star Envoy.’ Once someone has this, they can quickly confer the rank of the Golden Core phase to a cultivator.”<br/><br/>Gu Yang was somewhat surprised, they even had such a system?<br/><br/>These hole-in-the-sky worlds, they were pretty fancy.<br/><br/>As long as you receive amnesty, you don’t need to cultivate, and you can obtain great power.<br/><br/>If the warriors of the Great Zhou knew about this way of acquiring power, they would surely be driven mad.<br/><br/>Even he felt a little unfair in his heart.<br/><br/>He’s cultivated so hard to achieve his current level, he’s experienced so many hardships and paid such a heavy price. It’s like he’d walked on thorns every step of the way.<br/><br/>What about those two Star Envoys? They merely received the conferment, and they possessed power greater than his.<br/><br/>Thinking about this, it’s really annoying.<br/><br/>The Blue Bird continued to speak, “Of course, it’s impossible to reach heaven in one step. Even if a mortal obtained the title of Star Envoy, they wouldn’t be able to inherit the godly position of the Star Envoy. If they tried to use it forcefully, it would be tantamount to seeking death.”<br/><br/>“Even in the celestial system, each step must be taken gradually. Start with being conferred as the lowest level land god, this rank is equivalent to the Qi Refining stage.”<br/><br/>“The second rank is the mountain god, equivalent to the peak phase of Qi Refining.”<br/><br/>“The third is the City God, equivalent to the Foundation Establishment Stage. These three ranks are called the ‘Earthly Deities,’ they aren’t really considered gods. These are also the most commonly seen ranks.”<br/><br/>“Upon reaching the fourth rank, one becomes a ‘Star Envoy,’ holding the power of Golden Core Stage. There are common Star Envoys, Earth Evading envoys, and Heavenly Gang envoys. Representing different phases of the Golden Core; beginning, middle, and advanced.”<br/><br/>“The fifth rank is the ‘Heavenly General’, corresponding to the Nascent Soul stage. They are divided into Heaven Elemental General, Earth Elemental General, Human Elemental General. The pair we encountered earlier were Human Elemental Generals.”<br/><br/>“The sixth rank is called the ‘Sky King’, corresponding to the God Transformation stage.”<br/><br/>Gu Yang, engrossed in the explanation, noticed the bird had suddenly stopped and asked, “What’s next?”<br/><br/>“I can’t remember what comes next.”<br/><br/>It’s always like this, forgetting crucial details.<br/><br/>Gu Yang was resigned.<br/><br/>However, upon thinking about it, there probably weren’t any stronger beings in this hole-in-the-sky world. Otherwise, it would already have been unified.<br/><br/>In the simulation, he knew that the current Golden Court was split into three, led by three powerful beings in the Celestial Being realm.<br/><br/>These three had been fighting brutally with each other, each wanting to take out the other two.<br/><br/>He also knew that the two Unleaking Realm beings they encountered earlier were under the command of Sky King Xuan Zhen.<br/><br/>This Sky King Xuan Zhen, who occupied the Divine City, had the most powerful influence.<br/><br/>In general, with this situation, one either survives to the end or dies first.<br/><br/>Meanwhile, at the Golden Court Imperial Capital.<br/><br/>Above the clouds, the Immortal Palace could vaguely be seen, the dwelling place of the Golden Court.<br/><br/>On the sixth level of the Golden Court, a silhouette sat in the middle of the throne that represented authority, enveloped in a purple glow. His face couldn’t be seen clearly.<br/><br/>In front of the silhouette, there was a giant jade page floating in the air, illuminated by several dots of light.<br/><br/>Suddenly, two of the lights dimmed.<br/><br/>“Star of Destiny, Star of Doom…”<br/><br/>The figure murmered the things these two dimmed lights represented.<br/><br/>He could accept the loss of two Heavenly Gang Star Envoys.<br/><br/>As long as he could retrieve the thing on Heavenly Gang Mountain, it would be worthwhile even if those two Heavenly Generals died.<br/><br/>Just at this moment, the jade page again showed changes as the two names were completely erased, leaving no trace.<br/><br/>“What?”<br/><br/>The man in the purple light quickly stood up, the whole space shook as a result, showing how shocked he was.<br/><br/>A complete disappearance of the names on the jade page had never happened before.<br/><br/>Normally, after a god conferred by the Remarkable Golden Order died, there would be two outcomes.<br/><br/>One, the Golden Order would fly back on its own.<br/><br/>Two, the Golden Order would be taken by someone else and given to another person.<br/><br/>Regardless of which one, the power of the godly rank itself would not disappear, it would just transfer to someone else.<br/><br/>But now, the names of the Star of Destiny and Star of Doom had completely disappeared, which meant that the Golden Court had permanently lost the power of these two godly positions.<br/><br/>“What the hell happened?”<br/><br/>The figure in the purple light was extremely angered, this was an incident that could shake the foundation of the Golden Court.<br/><br/>Her power came directly from the Golden Court. She couldn’t tolerate anything that could prove harmful to it.<br/><br/>With a wave of her hand, a mirror of light appeared in front of her. She sent a message through it saying, “Qing Yue, Zi Yang, hurry back!”<br/><br/>Gu Yang and Xi Huang flew for two whole days and nights before they finally stopped. They had run so far, those two celestial generals should not be able to catch them now.<br/><br/>Such frantic travelling had greatly exhausted them. He was already somewhat fatigued, let alone Xi Huang, who hadn’t fully recovered her strength.<br/><br/>“Let’s find somewhere to rest and learn about the situation in this world,” he suggested.<br/><br/>With two previous experiences travelling through pocket worlds, he considered himself a veteran in this regard.<br/><br/>Xi Huang and the Blue Bird naturally had no objections.<br/><br/>Gu Yang sensed an unusual power and wondered, “What’s that?”<br/><br/>The Blue Bird explained, “It’s a wild earth deity.”<br/><br/>“There are wild earth deities?” he asked in surprise.<br/><br/>“Of course, this pocket world has been influenced by the Golden Court, causing some changes to the world’s rules.”<br/><br/>Suddenly, Xi Huang questioned, “What are those people doing?”<br/><br/>“Why don’t we go take a look and find out,” Gu Yang proposed.<br/><br/>In Liu village, a group of people noisily carried a bridal litter toward a mountain.<br/><br/>However, despite sending off a bride, there was not an ounce of joy on their faces. Their expressions and eyes were filled with nothing but numbness.<br/><br/>“Stop!”<br/><br/>Suddenly, a raggedy-dressed youth rushed from behind them in a frenzy of urgency and anger, “Put down my sister…”<br/><br/>Just as the youth was about to rush into the group, he was grabbed by several burly men.<br/><br/>“Let me go…”<br/><br/>Despite the young man’s desperate struggles, he couldn’t break free from the men’s firm grip. He was pinned to the ground, his hands bound behind his back.<br/><br/>All he could do was watch as the wedding sedan-chair gradually moved out of sight. Consumed by fervent rage and deep sorrow, tears blurred his vision.<br/><br/>“Behave yourself.”<br/><br/>“Your sister marrying the mountain god is a blessing for her.”<br/><br/>“Don’t you care about your own life? What if you upset the mountain god, can you bear the consequences?”<br/><br/>The burly men scolded the young boy.<br/><br/>At that moment, an elderly man with white hair approached and coldly said to the youth, “Stone, this is fate. Your sister drew that chosen stick. Last year it was Old Eight’s daughter, this year…it’s your sister…”<br/><br/>“No, the one who drew that cursed stick was your granddaughter…why did you bypass me and send off my sister to die…” the youth shouted hysterically.<br/><br/>The old man’s eyes grew colder, “Drag him away. Don’t let him disturb the mountain god.”<br/><br/>The burly men then bound the boy, and dragged him away.<br/><br/>Everything returned to silence once more.<br/><br/>The wedding procession quickly reached the top of the mountain.<br/><br/>Upon reaching the entrance of a cave, a few strong men put down the bridal litter.<br/><br/>A table was set up, and butchery fresh livestock were laid out on it.<br/><br/>The old man knelt down, knocked his head on the ground a few times, and loudly said, “The Great Mountain God, your bride and sacrificial offerings have all arrived. Please bless us with favorable weather for the upcoming year…”<br/><br/>During his speech, a heavy breathing sound echoed from within the cave.<br/><br/>The old man was so startled that he couldn’t lift his head and stuttered, “I…will now take my leave…”<br/><br/>Rushing to his feet, he quickly left the sight as if escaping.<br/><br/>The others followed suit and ran away even faster.<br/><br/>Thus, only the bridal litter and the offerings were left behind in their original place.<br/><br/>In the bridal litter, a young girl dressed in red, her hands and feet tied, and mouth covered, her face covered in tear streaks. She appeared to be just twelve or thirteen years old.<br/><br/>She heard heavy footsteps and became even more terrified, with tears streaming down her face.<br/><br/>The footsteps stopped outside her sedan-chair, and the curtain was lifted, revealing a giant dog’s head. It stared at her with greedy eyes and said in human speech, “Young lady, you look so beautiful.”<br/><br/>The sight almost scared the girl unconscious.<br/><br/>PS: Here is the third update, please vote for the monthly ticket.\t\t\t\t\t\t</div>", "images": {}, "success": true}