{"id": 245, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132091.html", "title": "Chapter 245 - Chapter 245: 245 Divine Ape Of Heaven", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 245 - Chapter 245: 245 Divine Ape Of Heaven</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 245: 245 Divine Ape of Heaven<br/><br/>“Master, you’re worse than a dog. Others go straight at it while you dawdle…”<br/><br/>Blue Bird became insolent upon seeing the scene below, but before it could finish speaking, Gu Yang seized it.<br/><br/>This creature was becoming increasingly presumptuous.<br/><br/>This time, Gu Yang decided to put it in solitary confinement for a day, as a lesson.<br/><br/>The so-called solitary confinement meant using mana to lock it up, preventing it from speaking.<br/><br/>At this time, the next to him, Xi Huang, watched the giant bodied, dog-headed humanoid stretch its hand into the carriage. Unable to bear it, she waved her hand, her mana scattered everywhere, blasting the monster away.<br/><br/>This was the first time she took action without Gu Yang’s directive.<br/><br/>Before, no matter what kind of enemy they encountered, she stood aside. If Gu Yang didn’t move, she wouldn’t take the initiative.<br/><br/>To Gu Yang’s delight, this change was a good one.<br/><br/>In his view, Xi Huang was too quiet and introverted, unlike a martial artist of the mana realm.<br/><br/>This kind of temperament may be suitable for a lady of nobility among mortals, but she was not.<br/><br/>In the not too distant future, Great Zhou will definitely plunge into chaos. The stronger the martial artist, the greater the challenges they will face. Gu Yang couldn’t always have her by his side, there would come a day when she would have to face powerful enemies alone.<br/><br/>“Who dares to ambush this immortal?”<br/><br/>The dog-headed humanoid staggered to its feet from the ground, its eyes turning red with anger. It bared its snowy white fangs and let out a deep roar.<br/><br/>Suddenly, a woman appeared in front of it.<br/><br/>It was stupefied. It had never seen such a beautiful woman. Its mouth opened wide, saliva dripping from the corner of its mouth, its breath became heavy and a certain indescribable part started to expand…<br/><br/>Then its head burst open abruptly, scattering a mix of red and white all over the ground.<br/><br/>Gu Yang, surprised by the bloody scene, saw her kill for the first time, and the means were so violent. He could only say that there were some violent genes from the Monster Race hidden within her.<br/><br/>Xi Huang was also stunned, her face slightly pale. She turned her head away, not daring to look at the corpse.<br/><br/>Just now, murder was a moment of indignation. After the reaction, she felt a little overwhelmed.<br/><br/>At this moment, a faint white light ball formed from the headless body of the dog-headed humanoid and it tried to flee. It had just flown a few meters when it froze in mid-air.<br/><br/>From within the light ball, a faint voice said, “High Immortal, please spare me…”<br/><br/>It could actually speak.<br/><br/>Gu Yang found it curious. With a wave of his hand, the white light ball flew automatically into his palm.<br/><br/>The light ball contained a very special energy. Obviously, this was the power source that allowed the dog-headed humanoid to become an earth deity.<br/><br/>He said, “How did you become an earth deity? Tell me everything.”<br/><br/>“Little one will tell…”<br/><br/>The light ball spilled everything like beans.<br/><br/>Turns out, it was originally a hunting dog kept by a hunter of the Liu Family Village. More than ten years ago, it encountered a bear with its owner in the mountains, where the hunter died on the spot.<br/><br/>It was also injured. With the death of its owner, it immediately ran off with its tail between its legs. While running desperately, it crawled into a cave and lost so much blood that it lost its mobility.<br/><br/>Just as it was about to pass out, it unintentionally swallowed something. Then it came back to life.<br/><br/>Since then, it began to undergo incredible changes. Its body kept growing larger and its mind grew smarter.<br/><br/>One day, it even comprehended magic on its own.<br/><br/>With this supernatural power, it became a mountain god in the eyes of the villagers.<br/><br/>Gu Yang looked towards a cave not far away. According to its confessions, that cave was where it acquired its power.<br/><br/>“High Immortal, I have told you everything, please spare me…”<br/><br/>Its voice grew weaker and weaker until it suddenly lost all sound.<br/><br/>Gu Yang had not made a move; its soul had dispersed on its own. Only the white light ball remained.<br/><br/>After the dog-headed humanoid’s consciousness disappeared, the energy in the sphere became extremely pure. It was somewhat similar to the forces of the two Star Envoys he previously met, yet different.<br/><br/>He was rather curious about the power of the earth deity.<br/><br/>This light sphere was too low graded. It wasn’t even enough to recharge energy.<br/><br/>“Are… are you immortals?”<br/><br/>Suddenly, a timid voice came from behind him.<br/><br/>Gu Yang turned his head and saw a half-grown girl in a red dress. Her face was pale, and she looked malnourished. She was standing there holding the sedan, stains of tears still on her face, but she gathered the courage to look at them.<br/><br/>She sure had guts.<br/><br/>Gu Yang could generally guess what had happened. The ignorant villagers offered her to the “mountain god”, under the pretext of her “marrying” the “mountain god”, her fate must be miserable.<br/><br/>The dog-headed humanoid, over three meters tall and as robust as an ox. The girl was thin as a bamboo stick, that scene, just thinking about it was horrifying.<br/><br/>Having experienced such a terrifying thing, this girl had not been scared stupid, her courage was truly commendable.<br/><br/>The girl knelt down and kowtow, “Thank you two immortals for saving me.”<br/><br/>After bowing, she said, “My brother is still looking for me, I have to go back.” She wanted to leave after she finished speaking.<br/><br/>“Wait.”<br/><br/>Gu Yang called her to stop, “If you go back like this, how would you explain this to the villagers?”<br/><br/>“I…”<br/><br/>“Believe it or not, if you go back to the village now, you will immediately be tied up and brought back here. If they found its corpse, perhaps, they will burn you alive.”<br/><br/>The girl turned pale with fright.<br/><br/>Gu Yang was not trying to scare her. Considering the ignorance of these villagers, anything could happen in their fear.<br/><br/>He asked with a tempting voice, “Little girl, would you like to become a mountain deity? At that time, you will have the power to protect your brother and your family.”<br/><br/>“Mountain… deity… me?”<br/><br/>The girl pointed at herself, speaking incredulously.<br/><br/>“Yes, but there is a risk to this. If you can’t bear the power of a mountain deity, you will die right on the spot. Are you willing to take that gamble?”<br/><br/>*Gulp*<br/><br/>The girl swallowed, making this life-altering decision, she nodded her head firmly, “I am willing!”<br/><br/>Gu Yang transferred a slightly smaller white light ball into the girl’s brow, while carefully observing the changes in her body.<br/><br/>As soon as the light ball entered her body, incredible transformations began to occur.<br/><br/>The change started from the brain, as if it was merging with her consciousness.<br/><br/>Then, the remaining energy began to transform her body. In the end, only about a quarter of the light ball’s energy remained.<br/><br/>Finally, the girl’s condition stabilized.<br/><br/>The entire process took about half an hour.<br/><br/>In Gu Yang’s heart, he exclaimed, “In just half an hour, I’ve created a First Rank martial artist!”<br/><br/>Probably, there’s no faster way than this.<br/><br/>In the Great Zhou, so many martial artists have been practicing hard for decades, and they still can’t reach the third rank, let alone the first rank. 99.99% of martial artists can’t even touch the edge of it.<br/><br/>If they knew that an undernourished little girl became a First Rank in half an hour, wouldn’t they go crazy?<br/><br/>Gu Yang was now more and more curious about the ancient times, each Human Emperor was more extraordinary than the last.<br/><br/>So, where did this brilliant Gold Emperor run off to?<br/><br/>Noticing that the girl hadn’t come back to her senses, Gu Yang said to Xi Huang, “You watch over her, I’ll go inside and have a look.”<br/><br/>Xi Huang warned, “Be careful.”<br/><br/>Gu Yang nodded and walked into the cave.<br/><br/>The entrance to the cave was small, but the space inside was quite spacious.<br/><br/>He noticed the walls were unusually smooth, and judging by the shape of the space, it didn’t seem like it was naturally formed.<br/><br/>The cave was deep, and Gu Yang kept walking until he reached the end where he found a pitch-black pit. With even his eyes, he couldn’t see how deep the pit was.<br/><br/>“It’s the aura of the Monster Race.”<br/><br/>Suddenly, the Blue Bird once again broke free from his mana restriction, and whispered, “At least a Demon Saint level.”<br/><br/>Gu Yang’s heart shivered, a Demon Saint was equivalent to the Celestial Being realm.<br/><br/>Despite not sensing anything, he still cautiously opened the system to conduct a simulation.<br/><br/>“At twenty-two years of age, you are already at the first level of Mana. You entered the Golden Court and defeated two Star Messengers.”<br/><br/>“You found the corpse of a Celestial Being from the Monster Race in a cave and obtained a drop of Essence Blood from a Divine Ape.”<br/><br/>“Several days after leaving the cave, you were pursued and tried to be killed by two Heavenly Generals.”<br/><br/>“You and Xi Huang lured the two generals into the cave and killed them.”<br/><br/>“This fight, however, attracted a powerful Celestial Being realm expert to break into the cave and kill you on the spot at the age of twenty-two.”<br/><br/>The future has changed again!<br/><br/>Gu Yang was a little headache, the simulation before entering the Golden Court had been needless to say thrilling, staying in this cave for several years and leaving safely in the end.<br/><br/>Now, it has attracted the pursuit and attempted murder of two Heavenly Generals.<br/><br/>Two Unleaking Realm powerhouses, they really value him.<br/><br/>Gu Yang knows, it’s mostly because he recharged those two Gold Orders.<br/><br/>Because in the previous simulation, he also killed those two Star Messengers. But he hadn’t attracted pursuit from the Heavenly Generals.<br/><br/>What made Gu Yang more curious was what secrets were hidden at the bottom of this pit? He was actually able to set up a plan to kill two Unleaking Realm practitioners there.<br/><br/>Those were Unleaking Realm practitioners, he couldn’t defeat a single one now. But he was able to kill two there.<br/><br/>In the end, it even attracted the intervention of a Celestial Being Realm powerhouse.<br/><br/>“Simulation is over, you can keep one of the following items.”<br/><br/>“One, the martial arts realm at the age of twenty-two.”<br/><br/>“Two, the martial arts experience at the age of twenty-two.”<br/><br/>“Three, the wisdom of life at the age of twenty-two.”<br/><br/>“I choose one.”<br/><br/>Gu Yang chose this option mainly because the Essence Blood from the Divine Ape was hard to come by.<br/><br/>Suddenly, he felt a wild surge of power explode from within him, his body began to expand, transforming into a massive ape.<br/><br/>The progress of the “Divine Ape Technique” had advanced significantly.<br/><br/>He had a feeling that he would soon be able to condense the Divine Ape avatar and break through to the sixth level.<br/><br/>Upon reaching the sixth level, he’d have an avatar with the realm of Mana, which was a Divine Ape from ancient times. Ordinary Mana realm foes would not be a match for him.<br/><br/>“Again!”<br/><br/>Without hesitation, Gu Yang initiated the second simulation.<br/><br/>PS: First update, need monthly support.\t\t\t\t\t\t</div>", "images": {}, "success": true}