{"id": 242, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132086.html", "title": "Chapter 242 - Chapter 242: 242 Seek Revenge For The Grievances", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 242 - Chapter 242: 242 Seek Revenge For The Grievances</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 242: 242 Seek Revenge for the Grievances<br/><br/>Liangzhou, located on the Eastern Sea Coast, bordered Jinzhou to the south and Yunzhou to the north. With flourishing trade and travel, it has been one of the most important states in the Central Plains since ancient times.<br/><br/>On a main road, Gu Yang and Xi Huang were galloping on their horses to Linbin City.<br/><br/>Several hundred miles away from Golden Court Mountain, they descended from the sky, reined in their cultivation levels, and chose to ride to Golden Court Mountain.<br/><br/>The Golden Court Mountain is just outside Linbin City.<br/><br/>And in Linbin City, there is a powerful sect—East Sea Gate.<br/><br/>Gu Yang didn’t want to make waves, and decided to enter the village quietly.<br/><br/>After all, he had had confrontations with East Sea Gate before.<br/><br/>If he would be recognized, he would inevitably stir up trouble again.<br/><br/>The East Sun Sword Saint was recognized as the first of the ten Sword Saints, and some people believed that he was the most powerful person below the Unleaking Realm.<br/><br/>Because, he was the only person among the ten Sword Saints who had defeated another Sword Saint.<br/><br/>All along their journey, Gu Yang and Xi Huang encountered many young people with long swords in hand and bags on their backs, traveling in groups to Linbin City.<br/><br/>The sight was quite spectacular.<br/><br/>Among the warriors he had encountered before, most of them used swords, regardless of their cultivation level.<br/><br/>But now, every warrior they met was a swordsman, which was truly unprecedented.<br/><br/>All of these young swordsmen with bags on their backs were en route to join the East Sea Gate.<br/><br/>This reflected how popular the East Sun Sword Saint was in Liangzhou.<br/><br/>As the only one carrying a knife, Gu Yang stood out from the crowd and was quite conspicuous.<br/><br/>Young people on the road cast curious eyes at them.<br/><br/>However, nobody caused trouble.<br/><br/>By the time night fell, they finally arrived at Golden Court Mountain.<br/><br/>The pair reached the foot of the mountain.<br/><br/>Xi Huang looked up at the towering, and seemingly endless mountain range, and said, “Liangzhou was given to the King of Liang by the Emperor. It is said that the King of Liang discovered an ancient ruin here and obtained a mighty abnormal treasure. His power is paramount amongst the nine princes.”<br/><br/>At that moment, the Blue Bird couldn’t hold back its excitement and burst out of a small bag, saying, “The Golden Court was established by the third generation Human Emperor in ancient times. He claimed himself the Gold Emperor, hoping to unite all realms and become their common ruler. Hmph, such a pipe dream.”<br/><br/>Gu Yang was quite interested in ancient matters and asked, “What happened next?”<br/><br/>“Later, um, I don’t remember.”<br/><br/>The Blue Bird had only regained a portion of its memories, in bits and pieces. It would occasionally recall one or two events from ancient times, but each time Gu Yang tried to inquire further, it would say it had forgotten.<br/><br/>Gu Yang had become used to this and said gravely, “Just don’t forget the entrance to the Golden Court.”<br/><br/>The Blue Bird said with embarrassment, “No way, I remember it clearly.”<br/><br/>After finishing, it flapped its wings and led the way in front.<br/><br/>At Linbin City, the mood at the East Sea Gate was rather tense.<br/><br/>Three months ago, they received a challenge letter aiming at their master.<br/><br/>The person who set down the challenge was Xue Dongyang.<br/><br/>This name represented an unparalleled powerhouse—the East Sun Sword Saint.<br/><br/>A hundred years ago, the East Sun Sword Saint lost to their master in a duel.<br/><br/>It was that duel that established the invincible reputation of their master.<br/><br/>Since then, the East Sun Sword Saint had disappeared without a trace, as though he had gone missing, never to be seen again.<br/><br/>Who could have imagined that a hundred years later, he would reappear and challenge the East Sea Gate again.<br/><br/>Three months had passed.<br/><br/>In three days, it would be time for the duel against the East Sun Sword Saint.<br/><br/>All the disciples of the East Sea Gate had absolute confidence in their master.<br/><br/>However, their master was not present.<br/><br/>Half a year ago, the master went into seclusion, but the East Sea Gate kept this information secret from the outside world, thus no one knew about this.<br/><br/>The sect’s third-ranked disciple went to look for the master, but has yet to report back.<br/><br/>Everyone at the East Sea Gate was as antsy as ants on a hot skillet.<br/><br/>“Junior sister, I’m afraid we will have to trouble you again this time,” said Fu Jianfei, the senior brother of the East Sun Sword Saint, with a serious face to junior sister Lan Shu.<br/><br/>Lan Shu, as always, was lazy, her gaze slipping over him as she asked, “Are you sure you want me to go?”<br/><br/>“At the moment, only you can find the master,” Jian Fei said, bowing slightly to her, “The reputation of the East Sea Gate for a hundred years is in your hands, Junior Sister.”<br/><br/>Lan Shu chuckled, “Hope you won’t regret this.”<br/><br/>After ending her sentence, she vanished from sight.<br/><br/>A bitter smile slipped over Fu Jianfei’s face.<br/><br/>He was well aware of Lan Shu’s background, and thus knew that letting her go might be releasing a tiger back to the mountain.<br/><br/>Despite this, he was out of options.<br/><br/>As the senior brother, he had to hold down the fort at the sect and couldn’t leave. Thus, he had to entrust it to her.<br/><br/>And only her could find the master within three days.<br/><br/>He remembered twenty years ago when the master brought a little girl back from that pocket world. Since then, he had another junior sister…<br/><br/>Traveling through Golden Court Mountain, the two humans and the Blue Bird were moving through a valley.<br/><br/>Suddenly, the Blue Bird, who was leading the way in front, said in human speech, “There’s someone!”<br/><br/>“Shush.”<br/><br/>Gu Yang covered its mouth and whispered, “Follow her.”<br/><br/>They had been roaming Golden Court Mountain for half the night already, yet the Blue Bird hadn’t located the entrance.<br/><br/>The Blue Bird had stayed in the Demon Suppression Tower for God knows how many years, the topography of the Golden Court Mountain had changed and the vegetation even more so.<br/><br/>It eventually hesitated and admitted that it could not recognize the path.<br/><br/>Gu Yang knew long ago that it was unreliable, but he was not discouraged.<br/><br/>On the way, he had already simulated once and successfully entered the Golden Court.<br/><br/>However, the guide was not this unreliable creature, but another person.<br/><br/>Here comes that person.<br/><br/>That person was an old acquaintance, Lan Shu, a disciple of the East Sun Sword Saint.<br/><br/>She was only of the First Rank in terms of cultivation level. Gu Yang and Xi Huang followed her, unnoticed by her.<br/><br/>Lan Shu displayed her agile skills, jumping around like an elf in the mountain.<br/><br/>Soon, she entered a very hidden valley.<br/><br/>In the valley was a lake, standing in front of the lake, her face was complex; it seemed to be agitated, timid, and also longing.<br/><br/>“Why don’t you jump?”<br/><br/>Suddenly, a voice sounded by her side, like a thunderbolt, making her heart tremble with fear.<br/><br/>She turned and saw a familiar face and couldn’t help but exclaim, “It’s you?”<br/><br/>Gu Yang!<br/><br/>This man, whom she had only met twice, left a profound impression on her.<br/><br/>She still remembered the first time they saw each other, he was only of the Second Grade.<br/><br/>Now, only half a year has passed, and he has reached a realm she could only look up to.<br/><br/>The Mana Realm!<br/><br/>Her master, who was acclaimed as the first person below the Unleaking Realm, had practiced for two hundred years, but he was only at the Mana Realm.<br/><br/>Lan Shu never imagined that she would encounter this man here.<br/><br/>Seeing the shocked look on Lan Shu’s face, Gu Yang found it quite amusing.<br/><br/>He still remembered the feeling of great pressure when he first met her.<br/><br/>Now, he was in the Mana Realm, and she was still in the First Rank Realm; he could easily kill her with a finger.<br/><br/>Gu Yang reached out and tore off a pendant from her neck.<br/><br/>“Wait…”<br/><br/>Lan Shu’s face changed drastically, and she tried to stop him.<br/><br/>Gu Yang said, “If you want this back, find me in Divine City a month from now.”<br/><br/>With that, he and Xi Huang had already jumped into the lake and disappeared.<br/><br/>He was the kind of person who remembered grudges; initially, Lan Shu had forcibly taken his Phoenix Feather Knife, now, he was simply repaying her in kind.<br/><br/>Lan Shu stomped her foot and quickly jumped into the lake.<br/><br/>As soon as Gu Yang and Xi Huang entered the lake, they felt the world spinning. When they surfaced again, they saw a different sky.<br/><br/>This lake was indeed the entrance to the Golden Court.<br/><br/>Now, they had arrived at the Golden Court.<br/><br/>The two rose from the water, their bodies completely dry. At the Mana Realm, repelling water was the simplest task.<br/><br/>Gu Yang observed the surrounding environment, they were in a vast cavern.<br/><br/>There was a deep sword mark on the stone wall in front of them.<br/><br/>Looking at the sword mark, he said, “Excellent sword technique.”<br/><br/>“So refreshing!”<br/><br/>At this moment, the Blue Bird finally broke free from Gu Yang’s mana restraint, flapping its wings excitedly. “This is the taste of freedom.”<br/><br/>Gu Yang did not pay any attention to it and turned to Lan Shu, who had just surfaced, and said, “If you don’t want to die, you’d better not go to the capital.”<br/><br/>After that, he left with Xi Huang.<br/><br/>Lan Shu watched as Gu Yang disappeared into thin air, and her annoyance reached its peak.<br/><br/>The pendant was extremely important to her, proving her identity. Now that Gu Yang had taken it away, she could no longer prove her heritage.<br/><br/>Also, what did he mean by his last words?<br/><br/>Don’t go to the capital?<br/><br/>“Master, I understand, you want to propagate your noble lineage everywhere, breed descendants, to achieve the great revival of the Monsters Race, aren’t you?”<br/><br/>The Blue Bird suddenly said excitedly, “But Master, if you fancy any human female, just go straight for it. It’s far more efficient that way… ”<br/><br/>Unable to bear it any longer, Gu Yang reached out and restrained it with his mana again.<br/><br/>Finally, the world was peaceful again.<br/><br/>The two quickly flew out of the long cave and came to the entrance, where they stopped.<br/><br/>At the entrance of the cave, there was a layer of white light, and someone had set up a prohibition.<br/><br/>On the ground, there were quite a few skeletons.<br/><br/>Among them, one corpse had not yet decomposed, it appears to be a recent death.<br/><br/>It seemed that all of these were people who had inadvertently come to the Golden Court through the lake. In the end, they were all trapped and died here.<br/><br/>At this time, the Blue Bird broke free from his mana restraint again and shouted, “I’m suffocating, Master, how could you treat me like this?”<br/><br/>“Huh?”<br/><br/>Suddenly, it noticed the entrance prohibition and exclaimed, “The Tiangang Hunwu Formation? No way, this formation is still in effect?”<br/><br/>“The Gold Emperor has fallen for so many years, hasn’t the Tiangang Sect been destroyed yet?”<br/><br/>“Damn it, Master, without the cultivation level of a Celestial Being, it’s hard to break this formation. Maybe we should pull out for now. If the old ghost from the Tiangang Sect is still alive, we’re in danger.”<br/><br/>“Waiting until the Master’s cultivation is restored, we can conquer this cave.”<br/><br/>Gu Yang said, “No need, just wait a while longer.”<br/><br/>Wait a while?<br/><br/>Could it be that the formation will open on its own?<br/><br/>Just as the Blue Bird was puzzled, suddenly, the ground shook violently, and after a tremor, the prohibition at the entrance indeed disappeared.<br/><br/>It was shocked, “Master, when did you learn the Zi Wei divine calculation?”\t\t\t\t\t\t</div>", "images": {}, "success": true}