{"id": 240, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132081.html", "title": "Chapter 240 - Chapter 240: 240 Revenge Served", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 240 - Chapter 240: 240 Revenge Served</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 240: 240 Revenge Served<br/><br/>“That’s nonsense.”<br/><br/>Gu Yang saw that the guy was talking nonsense as soon as he woke up, and he slapped him.<br/><br/>However, it dodged with agility and flew higher with its wings flapping, shouting, “The master is throwing a tantrum.”<br/><br/>Gu Yang was slightly astonished, the slap may have seemed casual, but it wasn’t easy to dodge.<br/><br/>With his level of cultivation, even a casual slap contained profound martial arts skills, blocking all its escape routes.<br/><br/>Yet the little green bird managed to easily evade it.<br/><br/>Gu Yang shifted his perspective and noticed a bundle of green flames within the blue bird. The small bundle was packed with incredibly high energy.<br/><br/>A creature that survived in the Demon Suppression Tower was indeed extraordinary.<br/><br/>Xili Huang, sitting opposite him, turned red at the blue bird’s words, and involuntarily said, “Father, this bird hasn’t transformed into its human form yet, but it can talk, it must have inherited the bloodline of a monster emperor.”<br/><br/>The blue bird stopped at the window, looked at her, then at Gu Yang, stammered in surprise, “Father? Master, have you really impregnated a human female?”<br/><br/>Before Gu Yang could respond, Xi Huang already erupted, “Don’t talk about my mother like that.”<br/><br/>“Wow, so fierce.”<br/><br/>Gu Yang snapped, “If you continue with your nonsense, I will throw you out.”<br/><br/>“What is a train? A burning carriage?”<br/><br/>While they were talking, they arrived at Zhongzhou City.<br/><br/>As soon as they entered the city gate, the carriage suddenly came to a halt.<br/><br/>The coachman stammered, “Sir… someone is stopping the carriage…”<br/><br/>Gu Yang looked out the window and saw a large crowd of people. The leader was a plump man with a feminine manner, a eunuch, who was clearly at the Golden Body level of cultivation.<br/><br/>It was said that the eunuchs of the inner court all practiced the “Lotus Treasure Mirror”.<br/><br/>Surprisingly, even after reaching the Golden Body stage, he was still a eunuch. This cultivation method was indeed bizarre.<br/><br/>There was also a familiar face among the crowd, Qian Xiyun.<br/><br/>“Greetings, Young Master Gu.”<br/><br/>The crowd bowed to him respectfully.<br/><br/>They were all waiting for him here.<br/><br/>“You don’t need to be so formal.”<br/><br/>Gu Yang stepped down from the carriage and asked, “You all waited for me here. Is there something you wanted to see me about?”<br/><br/>The eunuch of the Golden Body stage stepped forward and said, “My name is Zhuang Dezhong, I am here to greet the young master.”<br/><br/>“Ordered by whom?”<br/><br/>“You will understand once you see this.”<br/><br/>Zhuang Dezhong handed over an item.<br/><br/>Gu Yang looked at it. It was a thin piece of silk paper with a line of writing, “Zhuang Dezhong is my man.” It was signed with a “Su” character, and the stamp was the Imperial Jade Seal.<br/><br/>It was Su Ningyan.<br/><br/>He said, “She really has her sources.”<br/><br/>Zhuang Dezhong said, “A banquet has been prepared for the young master. Please, this way.”<br/><br/>“No need for the banquet, find me a quiet place to stay.”<br/><br/>Knowing that this man was Su Ningyan’s man, Gu Yang didn’t bother to be polite with him.<br/><br/>Then, like stars surrounding the moon, the group surrounded this ordinary carriage and marched into the city.<br/><br/>The coachman was terrified by the situation and almost forgot how to drive. He was scared witless the entire way.<br/><br/>“Brother Gu.”<br/><br/>Qian Xiyun rode a horse alongside the carriage and called out.<br/><br/>The others, including Zhuang Dezhong, kept their distance and did not disturb them.<br/><br/>Gu Yang smiled and said, “We haven’t seen each other for half a year. You look a little thinner. How is the Four Sea Bank going?”<br/><br/>Qian Xiyun looked at him with a complicated expression, “I have regained control of the Four Sea Bank. Qian Xiuyang is dead. The murderer who secretly harmed my grandfather has also been killed by me. Those who betrayed my grandfather have all been driven out of the Four Sea Bank.”<br/><br/>Gu Yang was first taken aback, then he said, “Congratulations.”<br/><br/>Qian Xiyun quietly said, “Thank you.”<br/><br/>Back then, she left everything in Jingzhou City and returned to the Four Sea Bank with the intention to avenge her grandfather.<br/><br/>Now, she had accomplished it.<br/><br/>However, she felt no joy in avenging her family.<br/><br/>She knew, all of this, was a command by the real puppet master. To benefit, precisely, the man before her.<br/><br/>Such circumstances were absurdly ridiculous.<br/><br/>In the past six months, she had been striving for control of the Four Sea Bank, but had found herself hitting walls at every turn. It seemed as though she was about to fall into a hopeless situation. Then, a shocking turn of events changed everything, flipping the tables completely.<br/><br/>Qian Xiuyang committed suicide, confessing to the poisoning of her grandfather in a suicide note.<br/><br/>The old men of the bank, who had once avoided her, one after another came to see her, claiming they wanted to support her in controlling the bank.<br/><br/>Next, the person who poisoned her grandfather was captured.<br/><br/>Everything happened so quickly that she could hardly react in time.<br/><br/>However, Qian Xiyun was not a fool. She knew that there had to be more profound reasons behind everything that had happened.<br/><br/>Soon, the news of the emperor’s death spread. At the same time, two shocking rumors also circulated.<br/><br/>The first one was that the emperor was killed by Gu Yang.<br/><br/>The second was that Gu Yang had an illicit affair with the empress.<br/><br/>Upon hearing these two rumors, Qian Xiyun suddenly understood everything.<br/><br/>All these turnarounds happened so fast, only because she was acquainted with Gu Yang.<br/><br/>Once she realized this, she didn’t feel the joy of avenging her huge grudge. Instead, she felt more aggrieved.<br/><br/>She knew, regarding the death of her grandfather, the real puppet master behind the scenes was the empress, the current empress dowager.<br/><br/>From this point, it was clear that the woman who held the world in her hands didn’t regard her at all.<br/><br/>This complete disregard was hard for Qian Xiyun to accept.<br/><br/>But what could she do about it?<br/><br/>How could she compete with that woman?<br/><br/>Gu Yang could see the desolation in Qian Xiyun’s heart, so he changed the topic, “Where is Yu Bing Yao?”<br/><br/>Yu Bing Yao, the disciple of the Asura Sword Saint, was also the inheritor of the supreme divine weapon, the Asura Sword.<br/><br/>After the Asura Sword Saint passed away, she stayed by Qian Xiyun’s side.<br/><br/>The expression on Qian Xiyun’s face dimmed, “She died.”<br/><br/>Gu Yang sighed, but he didn’t find it surprising.<br/><br/>A diligent man has no guilt, but he who possesses a precious object is guilty. Yu Bing Yao was originally only at the First Rank, but she carried the supreme divine weapon. It was only normal that she would have been targeted.<br/><br/>He asked, “Who killed her?”<br/><br/>“I don’t know, the one who made the move was a Divine Power warrior. Everything happened so quickly that before I could react, she was already dead.”<br/><br/>It could have been anyone.<br/><br/>Gu Yang didn’t intend to take revenge for Yu Bing Yao, he just thought that it was a pity for an extraordinary divine weapon to fall into someone else’s hands.<br/><br/>In a short while, the carriage drove into a mansion.<br/><br/>Qian Xiyun excused herself immediately, and everyone else also left.<br/><br/>Even Zhuang Dezhong was sent away by Gu Yang.<br/><br/>He planned to stay here for a few days to completely refine the Phoenix Feather Knife.<br/><br/>As a servant led him to his quarters, he met a familiar person the moment he stepped through the door.<br/><br/>A beautiful woman bowed her head to greet him, “It’s been a long time, Master.”<br/><br/>“Yuan Zhen Zhen!”<br/><br/>At a glance, Gu Yang recognized the woman before him as the famous courtesan Yuan Zhen Zhen. He was surprised, “What are you doing here?”<br/><br/>It was the map she had given him half a year ago that recorded the Secret Realm of Tianzhu Mountain, which had saved him from danger several times.<br/><br/>He always remembered that, and on this trip to Zhongzhou City, he planned to stop by to get her and bring her to Divine City to reunite with her brother.<br/><br/>Yuan Zhen Zhen replied respectfully, “Chief Zhuang brought me here. He had already redeemed me and asked me to serve the master of the mansion. I never expected it to be you, sir.”<br/><br/>Gu Yang couldn’t help but sigh, Zhuang Dezhong really was thorough in his arrangements.<br/><br/>Back then, he had only met Yuan Zhen Zhen once. Zhuang Dezhong had considered this, and arranged for her to be sent here in advance.<br/><br/>This eunuch really was different, taking care of people meticulously in every way.<br/><br/>Yuan Zhen Zhen seemed hesitant to say something.<br/><br/>Gu Yang knew what she wanted to ask, “I’ve arranged for your brother to be freed from his status as a menial worker. Now, he is a formal disciple in the Martial Arts Academy.”<br/><br/>This matter was taken care of by Cheng Xue. As far as she was concerned, it was a trivial matter and there was no need for him to intervene.<br/><br/>Upon hearing this, Yuan Zhen Zhen dropped to her knees, so moved that she shed tears, “I will never forget the kindness you’ve shown me, sir.”<br/><br/>“There’s no need for that. The map you gave me back then was a great help. Once matters here are settled, I’ll take you to Divine City to meet your brother.”\t\t\t\t\t\t</div>", "images": {}, "success": true}