{"id": 241, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132084.html", "title": "Chapter 241 - Chapter 241: 241 Golden Court Cave", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 241 - Chapter 241: 241 Golden Court Cave</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 241: 241 Golden Court Cave<br/><br/>Heaven (Third update, request for monthly votes)<br/><br/>In the courtyard, Gu Yang was sitting on the ground, his hands clutching the Phoenix Feather Knife, continuously infusing it with mana.<br/><br/>Refining a peerless divine weapon, the first step was to erase the traces of previous owners that were left within it.<br/><br/>The previous owner of the Phoenix Feather Knife had been dead for many years, and given that the Phoenix Feather Knife had been sealed for over a century, the imprint left by its former owner was removed without too much effort.<br/><br/>Next, he must leave his own imprint within the blade.<br/><br/>There was no quick way to accomplish this; it required ceaselessly channeling mana and nurturing the blade slowly over time.<br/><br/>The blue bird flew over from somewhere and perched on his shoulder. Its dark, shining little eyes stared at the Phoenix Feather Knife, and it spoke in surprise, “Master, there is your aura on this blade.”<br/><br/>“I remember now, you were once snipped off a phoenix tail feather by that mad woman from Yao Chi. This blade was forged from your feather, wasn’t it?”<br/><br/>Gu Yang ignored it, focusing on refining the divine weapon.<br/><br/>However, he could indeed feel a strong affinity with the weapon during the refining process. It was quite smooth.<br/><br/>The blue bird continued to chat away, continuing, “But Master, your tastes have declined significantly. You used to only be interested in top-tier fairies, and now, you can stoop as low as mortal women…”<br/><br/>“Shut up.”<br/><br/>Gu Yang had had enough of its chatter.<br/><br/>He wondered how this creature, with its incessant talking and lack of boundaries, had managed to not get killed by its “master”.<br/><br/>Not wanting to hear it blabber on, Gu Yang shifted topics and asked, “Did you recall something from the past upon waking this time?”<br/><br/>“How did you know, Master?”<br/><br/>Don’t you have any self-awareness at all?<br/><br/>Gu Yang then asked, “Do you remember where the entrance to the Hidden World is?”<br/><br/>The blue bird began to flutter excitedly, “Master, are you preparing to conquer the Hidden Worlds and restore the glory of our Monster Race? I’ve been waiting a long time for this moment. Which Hidden World do you intend to attack?”<br/><br/>If I knew, would I need to ask you?<br/><br/>Gu Yang’s facial expression was unchanging as he replied, “I don’t remember where any of the Hidden Worlds are. Do you?”<br/><br/>“Oh, I forgot. After your last rebirth, you lost all memory of the past.”<br/><br/>The blue bird lowered its head in thought for a while, before replying, “I remember one, the Golden Court Hidden World.”<br/><br/>“Where is it?”<br/><br/>“Liangzhou, Golden Court Mountain.”<br/><br/>Gu Yang gave a pleased nod and asked, “Do you know the method of entering this Hidden World?”<br/><br/>“Of course, I know where the entrance is.”<br/><br/>“Good.”<br/><br/>Gu Yang spent seven days in Zhongzhou City, and on the seventh day…<br/><br/>The Phoenix Feather Knife suddenly let out a great burst of radiant light, and a beam of fiery light shot straight into the sky. A cloud of thick, dark cloud gathered in the sky, within which thunderbolts brewed.<br/><br/>“Success!”<br/><br/>Gu Yang rose, laughing loudly.<br/><br/>After seven sleepless days and nights, he finally managed to leave his imprint in the core of the Phoenix Feather Knife, fully refining it to completion.<br/><br/>With that, he had finally gained full control over this peerless divine weapon.<br/><br/>At the same time, he inherited a powerful saber technique, the “Xuan Yang Demon Slaying Art,” from the blade.<br/><br/>As suggested by its name, this was a saber technique created specifically for slaying demons.<br/><br/>Ironically, at its core, this blade was imbued with the power of a powerful demon. The person who created this blade must have deep resentment towards the Monster Race.<br/><br/>For Gu Yang, this saber technique could serve merely as a reference.<br/><br/>The Monster Race had basically disappeared from the mainland now. He suspected that only the blue bird that was flying circles above him and Xi Huang, who had half Monster Race bloodline, remained.<br/><br/>The blue bird flew towards Gu Yang, hovering above his head and excitedly suggested, “Master, you have finally completed your task. Let us go conquer the Golden Court Hidden World!”<br/><br/>Suddenly, the bird cried out in surprise, “Oops! That’s bad…”<br/><br/>Immediately afterward, it dove into his arms, scurrying inside his clothes, trembling in fear.<br/><br/>Feeling a foreboding sensation, Gu Yang turned to hear a familiar voice, “Gu Yang!”<br/><br/>He turned back around, only to see a new figure wearing a robe – it was Wen Jue, headmaster of the Dao Sect. He asked in surprise, “Senior, why are you here?”<br/><br/>Wen Jue said, “I’ve been waiting for you for two days. Come with me.”<br/><br/>“Where to?”<br/><br/>“The Black Soul Valley.”<br/><br/>Black Soul Valley? Isn’t that the territory of the Nether Sect?<br/><br/>This is too sudden.<br/><br/>Gu Yang had no mental preparation at all.<br/><br/>Although, he was ordered by the dean of the academy to go to the Watermoon Cave Heaven to find Wen Jue, specifically to deal with the Nether Sect.<br/><br/>However, she didn’t ask him to join during the last simulation.<br/><br/>Quickly, Gu Yang reacted, this is a great opportunity to earn energy.<br/><br/>In the Black Soul Valley, there lies a Celestial Being’s corpse, which alone is worth countless energy.<br/><br/>There are also the numerous undead and disciples in the Nether Sect, all of which are sources of energy.<br/><br/>And those two Unleaking Realm leaders of the sect, even if he couldn’t kill them, their bodies alone should be worth a lot of energy.<br/><br/>Thinking about this, Gu Yang’s eyes grew brighter and brighter, asking, “When do we go?”<br/><br/>“Now.”<br/><br/>“Please wait a moment, senior. I need to make some arrangements.”<br/><br/>Gu Yang found the steward of this courtyard and asked him to notify Zhuang Dezhong to send someone to escort Yuan Zhen Zhen to the Tianxin Martial Arts Hall in the Divine City. He also wrote a letter to Cheng Xue explaining the situation.<br/><br/>After handling this matter, he activated the system.<br/><br/>Although Wen Jue managed to eliminate the Nether Sect in the previous simulation, the Nether Sect had two individuals who had reached the peak of the Unleaking Realm. What if something unexpected happened?<br/><br/>He had to simulate it to see if there were any dangers this time.<br/><br/>[At twenty-two, you have reached the first Heaven of Mana, killed Shen Guang, who was at the second Heaven of mana, causing your fame to reverberate throughout the world.]<br/><br/>[You and Wen Jue headed for the Black Soul Valley and invaded the Nether Sect. Just when you were about to exterminate the Nether Sect, a powerful Unleaking Realm figure suddenly appeared. Three Unleaking Realm figures joined forces, severely injuring Wen Jue.]<br/><br/>[You escaped to the depths of the Black Soul Valley with Wen Jue. After shaking off the pursuers, you were lost in it.]<br/><br/>[Half a year later, you and Wen Jue unwittingly entered a peculiar world.]<br/><br/>[Thirty years later, that world collapsed, and you died with her, at the age of fifty-two.]<br/><br/>As expected, the future timeline has changed. An unexpected event has occurred.<br/><br/>Who could this suddenly appearing Unleaking Realm figure belong to?<br/><br/>The first one Gu Yang thought of was one from the Red Bright Heaven.<br/><br/>They must have guessed that Wen Jue’s next target would be the Nether Sect, so they sent someone to eliminate Wen Jue, who was a powerful Unleaking Realm expert.<br/><br/>“How am I supposed to counter this move?”<br/><br/>Gu Yang thought for a moment, and decided to find Wen Jue.<br/><br/>“Find help?”<br/><br/>Upon hearing Gu Yang’s suggestion, Wen Jue shook her head, “Beside you, I don’t see any other help.”<br/><br/>She originally planned to challenge the Black Soul Valley alone and overthrow the Nether Sect. On her way over, hearing that Gu Yang has broken through to the realm of Mana, she detoured to find him.<br/><br/>Previously, it was merely that Gu Yang’s strength was not sufficient. Having one more helper would share some of the pressure.<br/><br/>It’s not that she doesn’t want to find help. She just can’t.<br/><br/>Gu Yang said, “You can go and find the Dean. The one from Red Bright Heaven surely knows that you are back and will definitely target you specifically. Only by taking you out, they will have various ways to deal with the Dean.”<br/><br/>“If they are a bit smart, they will definitely take advantage of your fight with the Nether Sect to ambush you. No matter how strong you are, can you withstand several Unleaking Realm opponents?”<br/><br/>“No rush to eliminate the Nether Sect. You can first go back to the Divine City and discuss with the Dean. I have some errands to run. In a month, I’ll come to the Divine City to find you. How does that sound?”<br/><br/>Staring at him for several seconds, Wen Jue finally nodded, “Fine.”<br/><br/>As soon as she finished speaking, she disappeared. Her arrival was sudden, just like her departure.<br/><br/>Gu Yang admired this kind of swift and vigorous style.<br/><br/>As soon as Wen Jue left, the Little Green Bird that had been hiding in his arms carefully poked it head out, asked tentatively, “Is she gone?”<br/><br/>“She’s gone.”<br/><br/>Seeing it scared like this, Gu Yang couldn’t help laughing. He had finally found this little guy’s weakness. In the future, he would have a way to teach it a lesson.<br/><br/>“Terrified me. Master, why are you staring at me like this?”<br/><br/>“Nothing, let’s go. Off to Liangzhou.”<br/><br/>Gu Yang summoned Xi Huang, brought the Little Green Bird, and immediately took to the skies. They left Zhongzhou City and flew towards Liangzhou.<br/><br/>Their target was, the Golden Court Cave Heaven at the Golden Court Mountain.<br/><br/>PS: It’s the weekend, please vote with your monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}