{"id": 258, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132118.html", "title": "Chapter 258 - Chapter 258: 258 Sword Of Yao Light", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 258 - Chapter 258: 258 Sword Of Yao Light</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 258: 258 Sword of Yao Light<br/><br/>The Ancient River Sword Sect is located at the source of the Lijiang River, where there’s an Ancient Sword Mountain.<br/><br/>At the peak of the Cold Avoidance Peak, within a cave dwelling.<br/><br/>An elderly man with white hair and beard was cultivating, a splendid blue flying sword was hovering in front of him.<br/><br/>He was continuously infusing his mana into the sword. The mana merged with the flying sword and, after a moment, was churned back.<br/><br/>In this manner, cycling over and over, accumulating day and night, eventually reaching a mutual understanding with the flying sword.<br/><br/>The elder is the master of the Cold Avoidance Peak, one of the nine Nascent Soul elders of the Ancient River Sword Sect, who wields the Cold Avoidance Sword.<br/><br/>Suddenly, a jade pendant in his chest snapped open with a ‘pop’.<br/><br/>The elder, master of the Cold Avoidance Mountain, grimaced, gritted his teeth and said, “They’ve finally revealed themselves.”<br/><br/>He wrapped his mana around him, pulled back the flying sword into his body, and was now outside the Cold Avoidance Peak.<br/><br/>He turned into a flying rainbow and in a moment, had already reached another peak, Moon Rainbow Peak.<br/><br/>The master of Cold Avoidance Mountain arrived at the cave dwelling at the top of the peak and communicated telepathically, “Junior sister, I need to borrow the Xuan Light Cover.”<br/><br/>From within the cave dwelling, a female cultivator’s voice responded, “Senior brother, why go to such lengths?”<br/><br/>“Junior sister, you know that I have a single grandson. I wished for him to inherit my mantle, but he died at the hands of that murderer. If I do not shred him to pieces, the hatred in my heart will not be quelled.”<br/><br/>“Ah, the person that the Water Moon Sect wishes to protect, wouldn’t be so easily killed, would they? Senior brother, do not let hatred cloud your eyes.”<br/><br/>“I understand your fear of bringing calamity upon our sect, however, why should our Ancient River Sword Sect fear the Water Moon Sect? Regardless of whether you lend me the Xuan Light Cover or not, I am determined to go.”<br/><br/>The cave dwelling fell silent.<br/><br/>The door opened, a ray of light flew out, it was the magic treasure the Xuan Light Cover.<br/><br/>The master of the Cold Avoidance Mountain was elated, took the Xuan Light Cover, and said, “Thank you junior sister.”<br/><br/>With this magic treasure, killing that Foundation Establishment Stage brat would be as easy as flipping his hand.<br/><br/>Outside Huang Family Town, beside a ruined temple.<br/><br/>The space there was still in place, in front of Ye Lingbo, that sword had finally solidified.<br/><br/>Opening her eyes, she felt somewhat exhausted, but her eyes were full of joy.<br/><br/>“The Sword of Yao Light!”<br/><br/>Gu Yang murmured in his heart. He remembered mentioning in the simulation that she had acquired a magic treasure, the Sword of Yao Light. So this was how she had obtained it.<br/><br/>A magic treasure!<br/><br/>Currently, the magic treasures he had seen were the two nine God Ding. With his current strength, he couldn’t even refine them.<br/><br/>I wonder how much energy this sword is worth?<br/><br/>He couldn’t help but feel envious.<br/><br/>Perhaps his gaze was too frightening, the Sword of Yao Light shivered slightly, turned into a stream of light and dived into Ye Lingbo’s body.<br/><br/>Immediately, a ray of light emanated from her body, and her aura was steadily rising.<br/><br/>This sensation, Gu Yang can say that he is quite familiar with it now.<br/><br/>He finally understood how people felt when they saw his own True Essence drastically increase.<br/><br/>“Others gain magic treasures and directly advance. I get a magic treasure and still have to spend simulation time, practicing the method of fate manipulation for many years, before I can keep it. Really, the disparity in treatment is too large.”<br/><br/>He couldn’t help but sigh.<br/><br/>With the feedback from the Sword of Yao Light, Ye Lingbo’s cultivation level skyrocketed, within an eye blink, she was already at the peak of the First Rank.<br/><br/>Then, she directly stepped into the Divine Power realm.<br/><br/>Golden body achieved!<br/><br/>All was quiet once again.<br/><br/>Ye Lingbo opened her eyes, which were filled with a hint of joy, as she spoke, “Thank you. If it wasn’t for you eliminating that Nascent Soul, I would have had to reach the Unleaking Realm before I could retrieve this Sword of Yao Light.”<br/><br/>“With this, I’ve saved two years of hard work. Moreover…” As she was saying this, she stopped.<br/><br/>Gu Yang knew what she wanted to say and laughed, “With it, you no longer need me to help you transform the power of the Immortal Elements.”<br/><br/>The Immortal Elements within Ye Lingbo were a more advanced form of power than mana.<br/><br/>Her wanting him as a Dao companion was precisely because she valued his congenital body’s ability to convert the power of the Immortal Elements into congenital qi for her cultivation.<br/><br/>The Sword of Yao Light was a magic treasure and could likewise realize this function, but with even greater efficiency.<br/><br/>Now it seems that the legend saying that she was a successor of a great ancient power must be true.<br/><br/>This Sword of Yao Light recognized her as its master without any refining required.<br/><br/>There’s only one possibility, she was originally its master.<br/><br/>Furthermore, her past life had a close relationship with this Water Moon Celestial Cave.<br/><br/>Last time, they were pursued by four Nascent Soul cultivators, and someone came to their rescue.<br/><br/>Now, the magic treasure that she used in her past life, has also been found here.<br/><br/>Maybe, the Wood God Ding was also hers.<br/><br/>However, once the magic treasure came to his hand, naturally it didn’t make sense to spit it out. Let’s consider it as his labor fee.<br/><br/>“I am greatly indebted to you for saving my life.”<br/><br/>Just as Gu Yang and Ye Lingbo stepped outside, the pale-faced teenager bowed deeply to them.<br/><br/>He smiled and said, “I didn’t realize it before, but you are blessed, young man. In just a few short months, your power has increased so much.”<br/><br/>“I am grateful for the teachings you bestowed upon me. If not for the book you gave me, I would still be an ignorant child. In my heart, I always regard you as my mentor.”<br/><br/>“Stop, I have no intention of accepting any disciples.” Gu Yang saw through the slick nature of this boy and rejected him straight away.<br/><br/>He still preferred disciples like Zhang Xiao Hai and Feng Tianci.<br/><br/>Though rejected, Huang Yongkang was not upset. He said, “I have nothing to give in return. If there is anything I can do to help you, please don’t hesitate to ask.”<br/><br/>Gu Yang was about to send him away, but then something came to his mind. He asked, “Are you familiar with the six sects of the Left Path?”<br/><br/>“Of course, I’ve had dealings with all six sects of the Left Path.”<br/><br/>“Which one is the closest?”<br/><br/>“The Mountain of Forgetfulness, it is about two thousand miles from here.”<br/><br/>“Tell me about the important figures of the Mountain of Forgetfulness.”<br/><br/>Huang Yongkang got excited upon hearing this, “Are you planning to inconvenience the Mountain of Forgetfulness? That’s great. The disciples of that mountain are evil and ruthless killers.”<br/><br/>“In order to refine their demon weapons, they even massacred an entire city, killing tens of thousands of people. They captured countless wronged spirits and confined them in spirit banners, giving them no chance of rebirth.”<br/><br/>“Those so-called righteous paths are unwilling to provoke this great enemy, the Ancestor of Forgetfulness, and simply allow him to commit atrocities.”<br/><br/>“The Ancestor of Forgetfulness has a High Nascent Soul cultivation level, one of the masters of the Left Path, and is very hard to deal with.”<br/><br/>“Under his command, he has eight main disciples. The eldest disciple is in the Early Nascent Soul stage, the remaining seven are all in the Golden Core stage. The rest are all insignificant.”<br/><br/>Two at the Unleaking Stage and seven at the Mana Stage.<br/><br/>This force, even in Great Zhou among the nine families and six sects, would rank high.<br/><br/>Gu Yang’s reason for coming to Water Moon Cave this time was to harvest as much energy as he could in the shortest possible time.<br/><br/>The individual cultivators are very scattered, so naturally it is better to choose those sects to start with.<br/><br/>The four great sects are too powerful, just for example the Ancient River Sword Sect can casually produce four Nascent Souls. He couldn’t possibly provoke them.<br/><br/>So he set his sights on the six sects of the Left Path. Of course, these six sects couldn’t be compared with the four great sects.<br/><br/>Moreover, according to his previous understanding, the Six Sects of the Left path are evil, and he wouldn’t feel any guilt in killing them.<br/><br/>Looking at it now, they’re not easy to deal with either.<br/><br/>Especially that Ancestor of Forgetfulness, a master at the high Nascent Soul stage, who would definitely be an unbeatable opponent.<br/><br/>But Gu Yang was not planning to annihilate the Mountain of Forgetfulness, he just wanted to loot and then run away.<br/><br/>After making up his mind, he said to the pale-faced youth, “Be my guide.”<br/><br/>Huang Yongkang immediately beamed with joy, “I am more than happy to serve you.”<br/><br/>He had past grievances with the Mountain of Forgetfulness. Now, hearing that this powerful benefactor was about to confront the Mountain of Forgetfulness, even if he had to bring his own food, he would go along with it.<br/><br/>Huang Yongkang went home. Since he’s leaving, he naturally had to tell his parents. If he suddenly disappeared again, his parents wouldn’t be able to take it.<br/><br/>Gu Yang took this opportunity to ask Ye Lingbo, “Are you really the reincarnation of an ancient Immortal?”<br/><br/>They were now Dao companions, so he felt he had the right to ask.<br/><br/>Ye Lingbo shook her head, “I don’t know if I am or not, but when I saw the Wood God Ding just now, I really did suddenly remember the existence of the Sword of Yao Light.”<br/><br/>“Then do you have any other memories of your previous life?”<br/><br/>“No.”<br/><br/>Gu Yang recalled what happened with Chu Xiyue in the simulation in the Immortal Palace. He was worried that Ye Lingbo might also experience an awakening of past memories and would not recognize him afterward.<br/><br/>He didn’t ask anymore, instead he opened up the system interface and started a new simulation.<br/><br/>[At22 years of age, you have reached the second tier of Mana, and startled the world by slaying Shen Zhou, who was on the third tier.]<br/><br/>[You have traveled to the Divine City and entered the Water Moon Cave together with Ye Ling Bo, where you killed a Nascent Soul and obtained the Wood God Ding. Ye Ling Bo retrieved her spiritual treasure, the Sword of Yao Light. The spirit treasure recognized its master on its own, and she stepped into the Divine Power realm.]<br/><br/>[You head towards the Mountain of Forgetfulness and kill the disciples of the Mountain.]<br/><br/>[Several days later, the Mountain of Forgetfulness lays a trap. A Nascent Soul and five Golden Cores surround you. You display great power and kill all five Golden Cores.]<br/><br/>[Before that Nascent Soul could die, he injured you with his Magic Treasure. At this moment, a Nascent Soul staged a surprise attack, using a Magic Treasure to trap you at once.]<br/><br/>[You held on for one day, and were eventually killed by a thrust through your heart by a flying sword. You were 22.]<br/><br/>As expected, apart from the Ancestor of Forgetfulness on the Mountain of Forgetfulness, the others were nothing to worry about.<br/><br/>The key question was, who was that Nascent Soul that appeared at the end?<br/><br/>Judging by the description, it didn’t sound like the Ancestor of Forgetfulness.<br/><br/>Could it be someone from the Ancient River Sword Sect?<br/><br/>This old fellow was despicable enough to launch a surprise attack on him while he was recuperating after a battle.<br/><br/>In order to deal with him, he even used a magical treasure designed to trap people, it seemed he had premeditated to kill him.<br/><br/>[The simulation ends, you can choose to keep one of the following items.]<br/><br/>“I choose the second one.”\t\t\t\t\t\t</div>", "images": {}, "success": true}