{"id": 250, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132100.html", "title": "Chapter 250 - Chapter 250: 250 Mana Double Heaven", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 250 - Chapter 250: 250 Mana Double Heaven</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 250: 250 Mana Double Heaven<br/><br/>“What should I do to break this deadlock?”<br/><br/>Gu Yang sunk into deep thought.<br/><br/>Yellow Springs?<br/><br/>No, it’s too far away, even further than going to Jiangzhou. Most importantly, it isn’t a place for cultivation. In a simulation, you can’t gain energy, so going there would be useless.<br/><br/>Cao Yiyi?<br/><br/>That’s also a no-go. The Cao family is subordinate to one of the celestial beings in the Red Sky. Going to the Cao family would be like walking into a trap.<br/><br/>Now, I only have seven simulations left. They are precious and cannot be used carelessly. I must come up with a better way.<br/><br/>Gu Yang goes through everything he can think of.<br/><br/>Ah, this!<br/><br/>Suddenly, a light bulb goes off in his head as he thinks of something.<br/><br/>He pulls out a jade pendant from his pocket, which is the key to the Guanghan Immortal Palace that he had gotten from Lu Yunshan.<br/><br/>The Guanghan Immortal Palace, one of the three great Immortal Palaces of the ancient times. Perhaps it could stop the celestial being of the Three Saints’ Gate.<br/><br/>The only problem was that he had no idea where the Guanghan Immortal Palace was located.<br/><br/>When in doubt, ask Cui’er.<br/><br/>“Do you know where Guanghan Immortal Palace is?”<br/><br/>The Blue Bird, which was dozing off with its head drooping, suddenly woke up and said, “Of course, back then, I always used to visit the Guanghan Immortal Palace. It was more pleasant to be around than the hypocrites of Taiyi Immortal Palace and the pretentious people of Yao Chi Immortal Palace…”<br/><br/>Gu Yang, not interested in its bragging, asked the critical question, “Where’s the entrance to Guanghan Immortal Palace?”<br/><br/>“Qiong Yu Mountain, which should be located in Luo Prefecture. But you can’t enter without a disciple of the Guanghan Immortal Palace…”<br/><br/>Luo Prefecture is actually Chu family territory and borders Jiangzhou.<br/><br/>“Great.”<br/><br/>Knowing the address, Gu Yang opened the system and initiated another simulation.<br/><br/>[…Taking Xi Huang with you, you transformed into a Phoenix and flew at full speed to Luo Prefecture. Upon reaching Qiong Yu Mountain, you used the jade pendant to unlock the grand entrance of Guanghan Immortal Palace.]<br/><br/>[The moment the grand gate was opened, it created such a disturbance that it attracted a Unleaking realm strong accomplished cultivator. Almost at the same time as you, they also entered the Immortal Palace. After that, the gate was closed again.]<br/><br/>[Your arrival alerted a monster beast guarding the gate. It engaged in a fierce battle with the accomplished cultivator.]<br/><br/>[You took the opportunity to venture deeper into the Immortal Palace. Many parts of the palace were in ruins. You headed towards the only intact palace hall. Unable to open the door, you could only stay outside.]<br/><br/>[Several days later, the fierce battle between the accomplished cultivator and the monster beast ended. The monster beast was slain right on the spot, while the accomplished cultivator also suffered severe injuries. It was then that you discovered this cultivator was the ancestor of Chu Family.]<br/><br/>[She proposed a deal to you – if you would bring Chu Xiyue into Guanghan Immortal Palace, she would be willing to transfer her remaining power to you.]<br/><br/>[You agreed. The Chu Family ancestor used “Bright Moon in the Sky” to transfer her mana into your body. Her life quickly faded away.]<br/><br/>[It took five years to digest and integrate all the mana transferred to you into your own body. Your martial prowess increased significantly.]<br/><br/>[Another five years passed. Suddenly, the True Essence in your body went out of control and you died due to a demonized cultivation state.]<br/><br/>So the Guanghan Immortal Palace was indeed a way out.<br/><br/>In there, even the Celestial Being from the Three Saints’ Gate couldn’t get in; eventually, he lived for the next ten years.<br/><br/>However, what the hell happened with the demonized cultivation state at the end?<br/><br/>Could it be that the power transferred by the old ancestor of the Chu Family was problematic?<br/><br/>Gu Yang was initially overjoyed, but after seeing the final outcome, he couldn’t help but feel apprehensive about it.<br/><br/>This was the first time he had encountered such a situation in all his countless simulations. He actually ended up dying in a demonized cultivation state.<br/><br/>[Simulation finished. You can keep one of the following items.]<br/><br/>[First, the cultivation level of martial arts at the age of thirty-two.]<br/><br/>[Second, the martial arts experience at the age of thirty-two.]<br/><br/>[Third, life wisdom at the age of thirty-two.]<br/><br/>Gu Yang was in a bit of a dilemma.<br/><br/>If he chooses the first option, what if he ends up in a demonized cultivation state and dies just like in the simulation?<br/><br/>After much thought, he decided it’s best to be cautious.<br/><br/>“I choose the second option.”<br/><br/>Suddenly, numerous martial arts experiences filled his mind.<br/><br/>Soon after, Gu Yang initiated another simulation.<br/><br/>This time, he wanted to figure out what exactly caused the demonized cultivation state.<br/><br/>[…You took five years to fully digest and absorb all the mana.]<br/><br/>[Afterward, you used the key to open the gate, stepped out for a while, and returned after half a year. You went to the Qin Family to look for Chu Xiyue and was about to take her away. Suddenly, a fist descended from the sky and killed you on the spot. You died at the age of twenty-seven.]<br/><br/>This really is too hard.<br/><br/>Gu Yang felt a sense of frustration.<br/><br/>Initially, he wanted to verify whether due to him not fulfilling his promise of bringing Chu Xiyue to Guanghan Immortal Palace, he ended up in a demonized cultivation state.<br/><br/>But who would’ve thought? Qin Wu didn’t discuss martial ethics at all. Without saying a word, he killed him.<br/><br/>In the Qin Family, the only one capable of killing him instantly, must indeed be the old ancestor of the Qin Family.<br/><br/>The third simulation.<br/><br/>[…You sneaked into the Chu family and took Chu Xiyue away. You went to the Qiong Yu Mountain, using the jade pendant to open the door to Guanghan Immortal Palace.]<br/><br/>[The moment you opened the door, it drew in the old ancestor of the Chu family who entered the Immortal Palace with you.]<br/><br/>[The ancestor of Chu Family battled with the door-guarding monster beast, and both perished. Before dying, she transferred her remaining power to Chu Xiyue, helping her advance into the realm of Divine Power.]<br/><br/>[You two proceeded to the only intact hall in Guanghan Immortal Palace. Chu Xiyue was successful in pushing the door open and entered the hall.]<br/><br/>[You endured hardship as you cultivated within Guanghan Immortal Palace.]<br/><br/>[Three years later, Chu Xiyue stepped into the Mana Realm.]<br/><br/>[After another five years, Chu Xiyue advanced into the Unleaking Realm.]<br/><br/>[Another ten years passed, and Chu Xiyue became a Celestial Being. Then, she killed you with a single sword strike. You died at the age of forty.]<br/><br/>What kind of development is this?<br/><br/>This completely left Gu Yang confounded.<br/><br/>Chu Xiyue advanced to the Celestial Being realm in a short span of eighteen years, and that was simply against nature’s course.<br/><br/>Her talent was even more outrageous than Ye Ling Bo’s.<br/><br/>What’s even more outrageous is, why would she want to kill him after advancing to the Celestial Being realm?<br/><br/>Gu Yang really couldn’t understand.<br/><br/>Could it be that he had done something in the Immortal Palace that would infuriate both gods and mortals alike?<br/><br/>That doesn’t seem right either.<br/><br/>If he really did something indescribable to Chu Xiyue, she would surely have been willing, right?<br/><br/>There must be something wrong here.<br/><br/>Considering Chu Xiyue’s unusually fast cultivation speed this time.<br/><br/>Gu Yang made a daring guess that it was entirely possible that the moment she stepped into the Celestial Being realm, an ancient power within the Immortal Palace took possession of her.<br/><br/>Chu Xiyue’s alias on the Beauty list is Shy Flower under the Sealed Moon. Perhaps this name is not randomly chosen after all.<br/><br/>It is further evidenced by Qin Wu, who did not hesitate to use the Bright Moon Sabre as a betrothal gift, to marry her into the Qin Family.<br/><br/>This was enough to prove that she certainly had some special attributes.<br/><br/>[Simulation ends, you can choose to retain one of the following.]<br/><br/>[Option one, martial arts realm at the age of forty.]<br/><br/>[Option two, martial arts experience at the age of forty.]<br/><br/>[Option three, life wisdom at the age of forty.]<br/><br/>No matter what the outcome, this simulation had indeed provided him with an ideal escape route.<br/><br/>This time, he could finally choose with peace of mind, “I choose one.”<br/><br/>[… You and Chu Xiyue cultivated diligently in the Immortal Palace, and after pledging to spend the rest of your lives together, you officially married.]<br/><br/>[Twenty years later, Chu Xiyue advanced to the Celestial Being realm and killed you with a single sword strike when you were forty-two.]<br/><br/>Even after they were married, she dared to kill him.<br/><br/>Gu Yang could be sure that something must have happened when Chu Xiyue broke through to the Celestial Being realm.<br/><br/>However, being able to extend the timeline by two more years could be regarded as a positive, right?<br/><br/>[… You and Chu Xiyue pledged to heaven and earth and officially got married.]<br/><br/>[Two years later, Chu Xiyue gave birth to a daughter, named Gu Xi.]<br/><br/>[Ten years later, Gu Xi advanced into the Golden Body realm.]<br/><br/>[After another five years, Gu Xi advanced to the Mana realm.]<br/><br/>[Another eight years later, Gu Xi achieved celestial status and with a wave of her hand, you were sent out of the Immortal Palace.]<br/><br/>[Back to Great Zhou, you encountered a siege from the strong fighters of the Star Luo Sect. A year later, you died at the hand of a Celestial Being, aged forty-eight.]<br/><br/>This unexpected event had once again caught Gu Yang by surprise.<br/><br/>He had thought that having a child might delay the inevitable future by a few more years. Moreover, Chu Xiyue might spare his life for the sake of their child.<br/><br/>However, that ancient power played a sneaky move by possessing their daughter.<br/><br/>And in the end, that traitor expelled them from the Immortal Palace.<br/><br/>At least, the timeline had returned to its original trajectory, back to the future where Star Luo Sect invaded.<br/><br/>Moreover, he now had six more years. So, his goal was achieved.<br/><br/>[… You and Chu Xiyue pledged to heaven and earth and officially got married.]<br/><br/>[Two years later, Chu Xiyue gave birth to a daughter named Gu Xi.]<br/><br/>[Another year later, Chu Xiyue gave birth to a son.]<br/><br/>[Five years after that, Chu Xiyue gave birth to two more girls and one boy.]<br/><br/>[… Seventeen years later, Gu Xi advanced to the Celestial Being realm. She pulled out an immortal sword in the void. Suddenly, a golden light fell from above the palace and you died at the age of forty-seven.]<br/><br/>This time, Gu Xi did not kick them out.<br/><br/>Gu Yang’s plan had succeeded.<br/><br/>As a modern person, he was well aware of the significant impact of the family environment on a child.<br/><br/>His plan was to have more children, giving Gu Xi more warmth from family since childhood.<br/><br/>The plan was successful, but unfortunately, the subsequent development was something he had not expected.<br/><br/>What the hell was that golden light?<br/><br/>Couldn’t they just let him grow without any disturbance for a few years?<br/><br/>Gu Yang felt a little tired.<br/><br/>Gu Yang opened the system again. At this point, his balance was down to twenty-eight. He only had two more simulations left.<br/><br/>Suddenly, he heard the chirping sound of the Blue Bird next to his ear, “Master, you are about to reach the second layer of the Mana realm.”<br/><br/>He glanced at the Blue Bird and suddenly asked, “Who exactly destroyed the Immortal Palace?”<br/><br/>The Blue Bird replied, “I can’t remember.”<br/><br/>Just as expected, it couldn’t be relied on.<br/><br/>Gu Yang looked at Xi Huang, who was holding the divine weapon from Lu Yunshan.<br/><br/>This divine weapon was not compatible with her cultivation method, and up till now, she had only refined a small part of it.<br/><br/>“Forget it, this is a divine weapon, using it to top up would be too wasteful.”<br/><br/>Even if it tops up a few tens of points, it would still be a drop in the bucket.<br/><br/>To get past the current predicament, he needed to at least reach the Unleaking realm. A single sword wouldn’t solve this problem.<br/><br/>Now, he was first going to enhance his cultivation level, and then figure out a solution.<br/><br/>Gu Yang initiated the simulation again.<br/><br/>A moment later, a scarlet flame surged from inside his body, and a terrifying aura shot up to the sky.<br/><br/>Second level in the Mana realm!<br/><br/>PS: Seeking monthly tickets for the third update.\t\t\t\t\t\t</div>", "images": {}, "success": true}