{"id": 252, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132105.html", "title": "Chapter 252 - Chapter 252: Arrogant", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 252 - Chapter 252: Arrogant</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 252: Arrogant<br/><br/>“Dear disciple, how about this sword technique from your master?”<br/><br/>On the official road, an old man dressed in grey was wielding a long and straight tree branch in his hand, briskly cutting off a foxtail grass at the roadside, and showing off to a young man next to him with a satisfied expression.<br/><br/>The young man next to him remained silent, with no expression on his face. He ignored him and walked forward.<br/><br/>The young man was Wu Xingyun, who left Gu Yang half a year ago and has been wandering around.<br/><br/>The old man couldn’t resist shaking his head and sighing, “The world is declining. Back in the day, when I was young, I risked my life to sneak a peek at others practicing their sword technique to learn a trick or two. You younger folks really do not appreciate the good conditions you have.”<br/><br/>Wu Xingyun couldn’t help but retort, “Senior, please stop teasing this junior. I already have a master, so I can’t really acknowledge you as my master.”<br/><br/>The old man shook his head vigorously, “Your master is not fit to teach you. What sort of sword technique is he teaching you? It’s totally misleading. I will teach you the unparalleled sword technique.”<br/><br/>Unparalleled sword technique?<br/><br/>Wu Xingyun snickered to himself. Was it that careless swinging of branches like a child?<br/><br/>He deeply regretted his decision to meddle.<br/><br/>A month ago, he saw an old man drunk and fallen by the roadside. He didn’t bear to see him freeze to death and hence brought him to an inn.<br/><br/>When the old man sobered up, he even ordered a table of food.<br/><br/>Unexpectedly, the old man then started sticking to him, claiming that he was a promising talent and insisting on taking him as a disciple.<br/><br/>Wu Xingyun thought he was delirious and left after rejecting him.<br/><br/>However, to his amazement, the old man easily followed him.<br/><br/>It was then that he realised that the seemingly down-and-out old man was actually a powerful Divine Power Realm practitioner.<br/><br/>Originally, having a Divine Power Realm practitioner as a master could be considered a good opportunity.<br/><br/>However, the old man refused to reveal his identity or origins, and the sword technique he taught seemed like child’s play.<br/><br/>Wu Xingyun knew that this expert was just making fun of him. Despite feeling angry, there was nothing he could do.<br/><br/>He could not defeat him or escape from him.<br/><br/>So, he had no choice but to play along with the old man.<br/><br/>It has been a whole month, and the old man showed no sign of giving up and persisted in following him.<br/><br/>Wu Xingyun became increasingly alert. A mighty Divine Power Realm practitioner who kept acting like a fool must have a big plan.<br/><br/>Either he was plotting against his father,<br/><br/>Or he wanted to conspire against Brother Gu.<br/><br/>He has seen the evil and cunning nature of the martial arts world.<br/><br/>Just then, Wu Xingyun suddenly felt the hairs on his body stand. It was as if a terrifying entity was approaching.<br/><br/>He abruptly looked up and saw three figures flying in the sky towards them.<br/><br/>Divine Power Realm!<br/><br/>The ability to fly is a characteristic of the Divine Power Realm.<br/><br/>The person in front was running away, while the two behind were chasing him.<br/><br/>“Pretty lady, you can’t escape. Just surrender obediently. If you are willing to be mine, I won’t turn you into an undead…” an indecent voice sounded.<br/><br/>Undead?<br/><br/>Nether Sect?<br/><br/>Wu Xingyun was horrified.<br/><br/>Over the past six months, he had encountered quite a few incidents. From someone with insider information, he learned about the Nether Sect.<br/><br/>To his surprise, he encountered someone who seemed to be from the Nether Sect today, chasing and killing a Divine Power Realm practitioner.<br/><br/>When the three individuals in the air got a bit closer, Wu Xingyun recognized the clothing of the woman in front, and his heart startled, “She is a disciple of the Literary Academy!”<br/><br/>“Humph, you have no gratitude.”<br/><br/>The disciple of the Nether Sect, seeing that the woman in front remained silent, became angry, “Then you can die.”<br/><br/>After speaking, he punched out, and a black fist flew out, hitting the woman’s back directly.<br/><br/>The woman’s protective True Essence was instantly shattered. She spat out blood and fell from the sky.<br/><br/>Watching this scene, Wu Xingyun’s heart tightened. He turned his head to look at the old man beside him and said, “Senior…”<br/><br/>The old man, stroking his beard, leisurely replied, “If you are willing to acknowledge me as your master, I will make a move.”<br/><br/>Wu Xingyun immediately knelt down, “Master, please accept your disciple’s bow.”<br/><br/>“Good!”<br/><br/>The old man gave a hearty laugh, seeming extremely pleased. He swung the long and straight tree branch in his hand towards the sky.<br/><br/>Wu Xingyun looked up to see the heads of the two men in the air fall, and they immediately lost their breath.<br/><br/>Just like that, they died?<br/><br/>Shock filled his eyes.<br/><br/>Wasn’t it said that the people of the Nether Sect were more powerful than martial artists of the same realm?<br/><br/>With the old man’s casual move just now, he used the same technique he had used earlier to cut off the foxtail grass by the roadside.<br/><br/>The more casual it seemed, the more it indicated the old man’s unfathomable strength.<br/><br/>“Dear disciple, how about this sword technique from your master?”<br/><br/>The old man had a look of ostentation on his face.<br/><br/>Wu Xingyun swallowed subconsciously. He realized that this old man was not just an ordinary Divine Power Realm practitioner.<br/><br/>Right, that disciple from the Literary Academy!<br/><br/>He suddenly remembered the injured woman and was about to go over to find her when he saw a figure swiftly pass by the side. It was the woman in the clothing of the Literary Academy.<br/><br/>The woman paid her respects to the old man, “Thank you, senior. I am Yan Wenjun. May I know your name?”<br/><br/>Upon hearing the name Yan Wenjun, Wu Xingyun felt as thunderstruck. She was the first rank among the disciples of the previous generation.<br/><br/>He didn’t expect that she had already advanced to the Divine Power Realm so quickly.<br/><br/>The old man stood with his back towards her, giving her only an aloof silhouette, “If you want to thank someone, thank my disciple.”<br/><br/>Yan Wenjun looked towards Wu Xingyun.<br/><br/>“Wu Xingyun pays his respects to Professor Yan.”<br/><br/>After disciples of the literary academy break through to the Divine Power realm, they automatically advance to the rank of professor.<br/><br/>He tenderly asked her, “Your injury isn’t too severe, is it?”<br/><br/>Even he could tell something was wrong with Yan Wenjun, her face having taken on a bleak complexion. It was clear the blow she had taken hadn’t been light.<br/><br/>“It’s fine.”<br/><br/>As Yan Wenjun spoke, her eyebrows suddenly furrowed, a flash of darkness appeared on her face causing her lips to turn black.<br/><br/>The old man then spoke up, “Blood Fiend Techniques of the Nether Sect are specifically designed to break the Golden Body. If she doesn’t quickly rid her body of the Blood Fiend, her end will come shortly.”<br/><br/>“This”<br/><br/>Wu Xingyun felt a pang in his heart. The sight of Yan Wenjun trembling uncontrollably confirmed the old man’s words. He gritted his teeth and said, “Master, please save her.”<br/><br/>It rolled off the tongue much easier calling him Master this time around.<br/><br/>The old man said, “Foolish boy, many people in this world are ungrateful. Even if you save her, she might not appreciate it. Moreover, what’s your relationship with her? What reason do you have to save her?”<br/><br/>Wu Xingyun wasn’t a fool and could hear the implication, “What would it take for you to save her?”<br/><br/>“Unless, she marries you and becomes a part of our family. I would naturally save her then.”<br/><br/>“You”<br/><br/>Furious, Wu Xingyun shot to his feet and yelled, “I am not the kind to take advantage of someone’s peril!”<br/><br/>The old man sneered, “You’re high and mighty. I didn’t cultivate my powers just to save someone who has nothing to do with me.”<br/><br/>Whether you want to save her or not, that’s up to you to decide. She doesn’t have much time left.”<br/><br/>Wu Xingyun found himself in a dilemma.<br/><br/>If he saves her, he could be accused of taking advantage of the situation.<br/><br/>But if he doesn’t, should he just watch her die?<br/><br/>At that moment, Yan Wenjun spoke, “If Mister Wu wouldn’t mind my modest appearance, I would like to marry you.”<br/><br/>Wu Xingyun was stupefied. He looked at her clear eyes and suddenly understood. Given the urgent situation, he said, “Fine, I’ll marry her. Quickly save her.”<br/><br/>The old man turned and looked at Yan Wenjun, asking, “Have you thought this through?”<br/><br/>Yan Wenjun solemnly nodded, “I have.”<br/><br/>“Are you sure?”<br/><br/>“I am certain.”<br/><br/>“Very well.”<br/><br/>With a wave of the old man’s sleeve, strands of black mist flew out from behind Yan Wenjun and dispersed with the wind.<br/><br/>After a moment, the dark aura on Yan Wenjun’s face vanished, restoring her complexion to its former radiance.<br/><br/>“Thank you, elder, for your life-saving kindness.”<br/><br/>Yan Wenjun deeply bowed.<br/><br/>She knew, the old man standing before her must have a cultivation level of at least the third tier of Mana. He was a genuine peerless master.<br/><br/>She had speculated about his identity.<br/><br/>Suddenly, the old man’s face transformed. He looked up towards the sky in the south, his expression was as grave as it could be.<br/><br/>This was the first time Wu Xingyun had seen him in such a serious state. He knew something major was happening and followed his gaze.<br/><br/>There was nothing in that direction but empty sky.<br/><br/>Just as he was pondering, three figures appeared out of nowhere.<br/><br/>Yan Wenjun by his side let out a shocked cry, “Mana realm practitioners from the Shen Family!”<br/><br/>But Wu Xingyun’s heart skipped a beat. Mana practitioners from the Shen Family… could it be…<br/><br/>A sonorous voice thundered through the air, “Gu Yang, why aren’t you running?”<br/><br/>They were indeed here for Gu Yang!<br/><br/>As he turned his head, he saw another silhouette in the opposite sky. Despite being far away, he recognized him at once. It was Gu Yang.<br/><br/>This is bad!<br/><br/>Against the might of three mana practitioners, Gu Yang was surely in grave danger.<br/><br/>Frantically, Wu Xingyun turned to the old man and pleaded, “Master, Gu Yang is my close friend. Please help him.”<br/><br/>The old man looked at him, sighing, “Two of them are third tier Mana practitioners, while the third is of the second tier. Even if I stepped in, I’m afraid it wouldn’t help.”<br/><br/>A sinking feeling overcame Wu Xingyun. If even this immensely powerful old man was unwilling to intervene, how could Gu Yang handle it alone?<br/><br/>Meanwhile, Yan Wenjun was watching the four figures in the sky with undivided attention.<br/><br/>A fight between four Mana practitioners was a rare opportunity indeed.<br/><br/>The name Gu Yang was one she had heard all too often recently. In just six months, he had jumped from First Rank to the Mana Realm, crossing the Golden Body Realm on the way.<br/><br/>How would such a terrifyingly talented individual handle three Mana practitioners?<br/><br/>Gu Yang in the sky slowly drew his sword, saying, “Why should I run? The Shen Family has tried to kill me over and over again. Today, it’s time for payback. Are you going to attack all at once, or one at a time?”<br/><br/>He’s so arrogant!<br/><br/>A thought crossed Yan Wenjun’s mind.<br/><br/>Despite facing three opponents whose powers exceeded his own, he was still boasting.<br/><br/>How could he be so confident?<br/><br/>The old man beside her said, “That kid is even more arrogant than I was. What a pity—”<br/><br/>He shook his head, though it was unclear what he found regrettable.<br/><br/>Wu Xingyun thought to himself, Brother Gu was still the same as ever, never retreating in the face of powerful enemies.<br/><br/>And similarly, he had never lost.<br/><br/>Not even once.\t\t\t\t\t\t</div>", "images": {}, "success": true}