{"id": 256, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132114.html", "title": "Chapter 256 - Chapter 256: 256 Don’T Misunderstand (Third Update Seeking Monthly Tickets)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 256 - Chapter 256: 256 Don’T Misunderstand (Third Update Seeking Monthly Tickets)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 256: 256 Don’t Misunderstand (Third Update Seeking Monthly Tickets)<br/><br/>“It seems something has happened up ahead?”<br/><br/>Wu Xingyun was escorting Yan Wenjun to the Literary Institute. She had been struck by a punch from a disciple of the Nether Sect. Despite the purging of the Blood Demon, her injuries still haven’t fully recovered. She appeared somewhat weak.<br/><br/>As they approached the institute, they saw a large crowd gathering at the entrance.<br/><br/>After listening for a moment, he was dumbstruck.<br/><br/>Princess Chang and Pei Qianlan were arguing, two Divine Power realm powerhouses were quarreling in the middle of the street.<br/><br/>Brother Gu truly has troubles!<br/><br/>He couldn’t help but sigh.<br/><br/>Yan Wenjun on his side was also somewhat shocked.<br/><br/>Princess Chang was of the same generation as her; gifted and superior to her. Several years ago, she had already reached the Divine Power realm.<br/><br/>The other woman, named Pei Qianlan, was the one he ran into at the city gate. She was even more powerful. Although she was ten years younger, she had already stepped into the Divine Power realm.<br/><br/>These two peerless talents were actually quarreling over a man out of jealousy.<br/><br/>The two of them, in the midst of their argument, looked like they were about to start fighting.<br/><br/>“Stop!”<br/><br/>How could Yan Wenjun let them start fighting at the entrance of the Literary Institute? She couldn’t help but shout.<br/><br/>“Stop!”<br/><br/>At almost the same time, another voice rang out.<br/><br/>A figure appeared out of thin air.<br/><br/>Yan Wenjun recognized the person. It was Vice-Principal Zhou. She relaxed. With the Vice-Principal present, a fight shouldn’t break out.<br/><br/>“Both of you, follow me in.”<br/><br/>Zhou Zongye helped the two women off the carriage. He also took the time to glance at Yan Wenjun and frown, “Wenjun, you’re hurt?”<br/><br/>“Greetings, Vice-Principal.”<br/><br/>“You can join us.”<br/><br/>There were too many onlookers. This wasn’t the place to talk.<br/><br/>Zhou Zongye led Princess Chang and Pei Qianlan into the Literary Institute.<br/><br/>Yan Wenjun grabbed Wu Xingyun’s sleeve, took him with her, and followed behind.<br/><br/>Wu Xingyun was somewhat surprised as he looked at her, but he didn’t resist and let her pull him along.<br/><br/>This was the first time Wu Xingyun had entered the Literary Institute in his life.<br/><br/>There had been little interaction between the Martial Institute and the Literary Institute. Their disciples rarely mingled.<br/><br/>With his cultivation level, he could tell that Zhou Zongye had forcefully suppressed the two women who were ready to explode with his mana.<br/><br/>Otherwise, they would have definitely started fighting.<br/><br/>Before long, they arrived at a courtyard.<br/><br/>Zhou Zongye’s gaze swept over Wu Xingyun, somewhat confused, “Who is this?”<br/><br/>Yan Wenjun candidly stated, “His name is Wu Xingyun. He is my husband.”<br/><br/>At these words, both Zhou Zongye and Wu Xingyun were stupefied.<br/><br/>Upon hearing the words “Wu Xingyun”, Pei Qianlan’s face changed slightly.<br/><br/>Why is he here?<br/><br/>Her relationship with Wu Xingyun was frankly quite awkward. Among all people, he was one of the last she wanted to encounter.<br/><br/>“Hmph!”<br/><br/>Having been at a disadvantage in the argument, Princess Chang let out a mocking smile. She had found her opponent’s weakness. If she could speak at this time, she would have launched a counterattack.<br/><br/>Apparently, she had figured out the real identity of the woman in front of her.<br/><br/>Zhou Zongye finally did not ask further, after all, this was Yan Wenjun’s personal matter.<br/><br/>He turned to look at the other two women, feeling somewhat headache. This kind of thing was indeed not easy to handle.<br/><br/>But he couldn’t just ignore it.<br/><br/>Who could deny that Gu Yang was the man who had saved his life?<br/><br/>If they started fighting, no matter who got hurt, he wouldn’t know how to explain to Gu Yang.<br/><br/>He said, “The two of you were arguing at the entrance of the Literary Institute, about to pull out your swords. Have you ever thought about the position this puts Brother Gu in?”<br/><br/>At this moment, Princess Chang felt she could speak again, blurted out, “Pei Qianlan, in front of your son, admit your affair with another man ——”<br/><br/>Before she could finish her sentence, her mouth was sealed by mana again.<br/><br/>Zhou Zongye’s face darkened.<br/><br/>Not just him, the impact of that sentence was too wide.<br/><br/>Pei Qianlan, Wu Xingyun, and Yan Wenjun who had just admitted her relationship with Wu Xingyun, all wore unpleasant expressions.<br/><br/>The matter of being married to the Jinghai Princess was Pei Qianlan’s Achilles’ heel.<br/><br/>Not to mention, the son of Jinghai Prince was right here, legally her “son,” along with a daughter-in-law.<br/><br/>The stab was ruthless, and she no longer had the confidence she’d shown when confronting Princess Chang head-on.<br/><br/>There was an awkward silence in the courtyard.<br/><br/>Zhou Zongye knew he couldn’t resolve the situation.<br/><br/>This kind of matter could only be dealt with by Gu Yang himself.<br/><br/>Suddenly, Zhou Zongye felt a surge of intuition. Overjoyed, he said, “Gu Yang is back. I’ll take you to meet him.”<br/><br/>He felt as if a huge burden had been lifted off his shoulders. Thank heavens Gu Yang had returned just in time.<br/><br/>Otherwise, he really wouldn’t know how to handle this situation.<br/><br/>He was quite reluctant to get involved with this messy affair.<br/><br/>In addition, Zhou Zongye used a magic spell to hide the aura of the two women from Gu Yang.<br/><br/>He was young once and knew exactly how flamboyant young men would react to a situation like this.<br/><br/>If Gu Yang discovered the two women, he might just bolt.<br/><br/>Therefore, they needed to take him by surprise and give him no chance to escape.<br/><br/>Zhou Zongye led the two women away.<br/><br/>“Let’s see what’s going on.” Yan Wenjun, pulling Wu Xingyun along, followed behind them.<br/><br/>Wu Xingyun hesitated, “Isn’t this improper?”<br/><br/>“I just want to see how your good friend handles a situation like this.”<br/><br/>After a while, Zhou Zongye arrived at another courtyard. Gu Yang was there, in addition to Ye Lingbo.<br/><br/>The voices of their conversation could be heard coming from inside.<br/><br/>Gu Yang said, “Is the matter you asked me about last time settled?”<br/><br/>“Settled!”<br/><br/>“Great, then from today onwards, we’re Dao companions.”<br/><br/>Zhou Zongye stopped in his tracks, his heart pounding. He subconsciously turned around to see the two women behind him turning pale.<br/><br/>Brother Gu, I can’t help you now!<br/><br/>Yan Wenjun, following behind them, had a cold smirk on his face.<br/><br/>Wu Xingyun’s scalp tingled. Now he was really not sure how Gu Yang was going to handle this.<br/><br/>In this almost frozen silence, Gu Yang’s voice continued, “Let’s go.”<br/><br/>“Where to?”<br/><br/>“Into the cave…”<br/><br/>Then, there was no more sound from inside.<br/><br/>Wu Xingyun felt like his head was about to explode, what woman could endure hearing such words?<br/><br/>“Let’s go.”<br/><br/>Yan Wenjun didn’t want to stay any longer and pulled him away.<br/><br/>At the scene, an extremely embarrassed Zhou Zongye was left with the two disheartened women.<br/><br/>Zhou Zongye swallowed nervously, saying, “They’re probably just going to the realm within the heavenly cave. Please don’t misunderstand.”<br/><br/>Saying this, he released the suppressing aura over them.<br/><br/>Princess Chang’s eyes were slightly red. Her voice was as cold as ice, “Ye Lingbo!”<br/><br/>Pei Qianlan was on the verge of tears, “It was supposed to be me…”<br/><br/>What a disaster!<br/><br/>Zhou Zongye felt as if two massive weights were on his head, and he had no idea how to manage the situation.<br/><br/>Meanwhile, Gu Yang took Ye Lingbo’s hand and hurried as fast as he could to the Star Picking Tower.<br/><br/>Time was of the essence, and he didn’t want to waste a single second.<br/><br/>Bringing Ye Lingbo along was a precaution.<br/><br/>The last time they entered the Water Moon Cave Heaven, it was only because of the help of a mysterious, powerful individual that they were able to escape the encirclement of four Nascent Soul stage powerhouses.<br/><br/>The mysterious powerhouse was undoubtedly trying to help Ye Lingbo.<br/><br/>Without a proper reason, Ye Lingbo wouldn’t join him in entering the Water Moon Cave Heaven again.<br/><br/>So, just this once, he had to compromise and agree to become her Dao companion.<br/><br/>With his current cultivation level, he could adequately handle the Immortal Element within her body.<br/><br/>Soon, Gu Yang and Ye Lingbo arrived at the top level of the Star Picking Tower.<br/><br/>Ye Lingbo opened the entrance to the realm within the heavenly cave, and they both slipped inside.<br/><br/>PS: We’ve reached the middle of the month, please give some monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}