{"id": 254, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132109.html", "title": "Chapter 254 - Chapter 254: It Seems To Make Sense", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 254 - Chapter 254: It Seems To Make Sense</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 254: It seems to make sense<br/><br/>“Lord Emperor, spare my life!”<br/><br/>The man in the black robe flew out hundreds of miles. Seeing Gu Yang getting closer and closer, he was so terrified that his soul was scattered. He suddenly stopped and kneeled on the ground to beg for mercy.<br/><br/>Gu Yang stopped a thousand meters away from him, locked him with his Blade Intent. Finally, he confirmed that it seemed he had genuinely given up resistance. He couldn’t help but be somewhat speechless.<br/><br/>You are a mage of triple Mana strength, your power is even above mine. How can you be so cowardly?<br/><br/>We haven’t even started fighting yet, and you’re already begging for mercy.<br/><br/>Gu Yang had never encountered such a spineless warrior.<br/><br/>However, since the opponent had surrendered, he wasn’t in a rush to kill him. Instead, he could interrogate him for some details.<br/><br/>“Who are you?”<br/><br/>The person before him made him feel completely different from the other two from the Shen Family. His Mana was peculiar, unlike that of a human.<br/><br/>“I am a humble servant, Jin Feng. I have heard of your great reputation, my Lord. I did not mean to offend you. It was just an order from my master, and I could not resist. Please, spare my life.”<br/><br/>The robed man was kowtowing like pounding garlic.<br/><br/>From his appellations, it seemed he knew something about the situation.<br/><br/>Gu Yang said, “Take off your robe.”<br/><br/>The man in the black robe immediately took off his robe, revealing his true guise.<br/><br/>He was a very young-looking man with silver hair, quite handsome. But the cringing look in his eyes and his ingratiating smile made him seem a bit sleazy.<br/><br/>Gu Yang spoke, “Tell me, what does your master plan when she sent you to capture me?”<br/><br/>Jin Feng divulged everything he knew.<br/><br/>Finally, Gu Yang managed to learn something about the Three Sages Gate from him.<br/><br/>This man’s master is Saint Chaoyang, the eldest among the three sages. She had sent him to capture Gu Yang for a sacrifice.<br/><br/>Unfortunately, this creature’s knowledge was limited.<br/><br/>His original form was a squirrel, and five hundred years ago, he obtained enlightenment from Saint Chaoyang and evolved wisdom.<br/><br/>Since then, he has always stayed inside the Cave Heaven World, never leaving nor engaging in battles. He had zero combat experience.<br/><br/>The saint hadn’t told him many things.<br/><br/>Whether he truly didn’t know or merely chose not to tell was unclear.<br/><br/>“That’s all I know. Please, spare me…” Jin Feng continued to plead for mercy.<br/><br/>Upon hearing the information Jin Feng divulged, Gu Yang began to contemplate how to deal with this guy.<br/><br/>Very soon, he had an idea.<br/><br/>He asked, “Do you want to live?”<br/><br/>“Yes.” Jin Feng nodded emphatically.<br/><br/>“Good. From now on, whether there’s any action from the Shen Family or Saint Chaoyang, you must keep me informed.”<br/><br/>“This…”<br/><br/>Jin Feng was almost scared stiff, stuttering, “If the Saint… finds out, she will… kill me.”<br/><br/>He truly is as timid as a mouse.<br/><br/>Since Gu Yang had decided to send him back to the Three Sages Gate as a mole, he naturally needed him to work for him willingly, so he started persuading him, “Do you know the relationship between Chaoyang and me?”<br/><br/>Jin Feng cautiously said, “You are the master of the Saint.”<br/><br/>“Chaoyang is misguided; she mistake a stone for me. I will visit her in the future and clarify this confusion. Since you regard her as your master, can you stand by and watch her harm her own master?”<br/><br/>“This…”<br/><br/>Jin Feng was at a loss for words, seeming to think that it made a lot of sense.<br/><br/>But he felt that something was not quite right.<br/><br/>Gu Yang didn’t give him time to think, “You are preventing her from making a mistake. Even though she finds out in the future, she would probably thank you instead of blaming you.”<br/><br/>Jin Feng swallowed, saying, “From now on, I will follow the command of the Emperor.”<br/><br/>“Good. This is a talisman specifically for conveying messages. If anything happens, notify me immediately.”<br/><br/>Seeing him so cooperative, Gu Yang was quite satisfied and produced a few talismans.<br/><br/>This was a method of creating talismans that he learned from the Yellow Springs Cave World. It could transmit messages to a specific person thousands of miles away.<br/><br/>“I am a person who clearly distinguishes between rewards and punishments. If you do your job well for me, you will be rewarded in the future. But if you harbour any ill intentions, I will make you regret living in this world.”<br/><br/>After giving Jin Feng a stern warning, Gu Yang let him go.<br/><br/>Killing him could earn thirty energy points.<br/><br/>However, Gu Yang felt that if he could turn him, it would be more beneficial.<br/><br/>In the Three Sages Gate, Saint Chaoyang had more than just him as a subordinate. He had seen several Unleaking Realm practitioners.<br/><br/>Killing him would risk having a stronger Unleaking Realm opponent, which would indeed be more difficult to deal with.<br/><br/>Having such a useless ally could buy him some time.<br/><br/>As for him being an informant, it was just a bonus.<br/><br/>Gu Yang had a Simulator, which could simulate the future, so whether he got information or not didn’t matter.<br/><br/>He took out the Spirit Tools he had just seized from the two Mana Realm experts of the Shen Family, and directly chose to recharge.<br/><br/>“Recharge successful. Acquired 15 grid of energy. Current balance: 83.”<br/><br/>“Recharge successful. Acquired 15 grid of energy. Current balance: 98.”<br/><br/>With this battle, he eliminated two enemies and harvested eighty energy points. It was a bountiful harvest.<br/><br/>Gu Yang didn’t look back at Wu Xingyun. He was in enough trouble already and didn’t want to involve others.<br/><br/>He flew on while opening the system. As per usual, he began a simulation.<br/><br/>[At age 22, you are at the second heaven of mana. You killed Shen Zhou, who was at the third heaven of mana, which shocked the world.]<br/><br/>[Two days later, you received a message from Jin Feng. Shen Yun, the ancestor of the Shen Family, is preparing to hunt you down personally.]<br/><br/>[You sent Xi Huang to Tianzhu Mountain, and you headed to Luo Prefecture. As soon as you arrived at the Chu Family, Shen Yun showed up. You found Chu Xiyue and escaped with her to Qiong Yu Mountain and opened the door of the Immortal Palace.]<br/><br/>[The Chu Family’s ancestor and Shen Yun broke into the Immortal Palace together. In a three-sided battle with the gate-keeping monster beast, Shen Yun survived to the end. You also died in the battle, aged just 22.]<br/><br/>Shen Yun!<br/><br/>As expected, after fighting his subordinates, their boss comes for him.<br/><br/>From the outcome of the battle, it seemed that the Chu Family’s ancestor was no match for Shen Yun.<br/><br/>There were rumors that when the Chu Family’s ancestor fought against Qin Wu, not only was the Bright Moon Sabre stolen, but she also suffered severe injuries. Her strength must have been greatly affected.<br/><br/>[Simulation end…]<br/><br/>After Gu Yang collected the rewards, he didn’t start another simulation.<br/><br/>Now that he knew who his enemy was going to be, he roughly knew how to deal with it.<br/><br/>Soon, Gu Yang returned to where he had started and met up with Xi Huang.<br/><br/>Without any unnecessary chatter, he said, “We’re going back to Divine City.”<br/><br/>Divine City.<br/><br/>A green donkey slowly approached the end of the official road, making a series of clear bell sounds.<br/><br/>A woman sat on the donkey, wearing a jade-colored long dress, half of her face veiled, and a long sword slung by her side.<br/><br/>Although her face was not visible, everyone could tell from her stunning figure that she was of unparalleled beauty.<br/><br/>People were attracted by the woman and looked at her one after another. Many men were smitten at first sight.<br/><br/>The woman’s eyes and eyebrows were the only visible parts of her face. Her eyebrows resembled distant mountains, and her eyes were like autumn waters.<br/><br/>However, an indescribable melancholy lingered between her eyebrows.<br/><br/>As she lifted her head, she gazed at the most magnificent city wall in the world, murmuring to herself, “So this is Divine City?”<br/><br/>“Yes, this is indeed Divine City.”<br/><br/>A voice interrupted from beside her.<br/><br/>A handsome young man approached, looking at her with burning eyes, “Miss, it seems you are here for the first time. Are you visiting relatives or friends?”<br/><br/>The woman didn’t even glance at him. She nudged the donkey with the back of her foot to increase its speed towards the city gate.<br/><br/>The young man was disappointed, but he wasn’t ready to give up. He followed her and called out, “Miss, my house is in Divine City. I am very familiar with the place and can guide you around…”<br/><br/>“No need, I’m here to find my husband.” The woman responded without looking back.<br/><br/>Her husband?<br/><br/>The young man’s face changed color, but he didn’t stop. He was about to say something else.<br/><br/>Suddenly, he stumbled over something and fell face-first to the ground, prompting laughter from the onlookers.<br/><br/>Not far away, a man and a woman witnessed this scene.<br/><br/>Suddenly, the man said, “Divine Power?”<br/><br/>This man was Wu Xingyun and the woman next to him was Yan Wenjun.<br/><br/>Their newly acknowledged master was nowhere to be seen.<br/><br/>This morning, they had witnessed Gu Yang’s battle where he single-handedly killed two Shen Family’s mana realm powerhouses.<br/><br/>Afterward, the old man brought them to Divine City as fast as possible. When they reached the outskirts of the city, he said he had something to attend to and left them behind.<br/><br/>Yan Wenjun couldn’t help but exclaim, “When did Great Zhou produce such a young divine realm powerhouse?”<br/><br/>She had traveled the world ten years ago and reached the Divine Realm three years before.<br/><br/>Given her age, she was undisputedly the foremost amongst the younger generation.<br/><br/>When she had solidified her realm and emerged, she found the world had changed so much that she almost didn’t recognize it.<br/><br/>First there was Gu Yang.<br/><br/>And now, there was another excessively young divine realm power.<br/><br/>From Yan Wenjun’s perspective, the woman they were observing was at least ten years younger than herself.<br/><br/>“It’s her!”<br/><br/>At this point, Wu Xingyun finally recognized who the woman was and his expression became extremely complex.<br/><br/>When he saw her silhouette from afar, he found it familiar, but couldn’t recall who she was at first.<br/><br/>Not until Yan Wenjun’s remark did he think of a rumor he had heard a few days ago and immediately deduced the woman’s identity.<br/><br/>Seeing his odd expression, Yan Wenjun asked, “Do you know her?”<br/><br/>Do I know her?<br/><br/>Wu Xingyun, thinking about his intricate past with the woman, was at a loss for words.<br/><br/>How should he explain? That she was once his stepmother, but eloped with his best friend?\t\t\t\t\t\t</div>", "images": {}, "success": true}