{"id": 253, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132107.html", "title": "Chapter 253 - Chapter 253: What Just Happened In 253?", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 253 - Chapter 253: What Just Happened In 253?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 253: What just happened in 253?<br/><br/>“Begin!”<br/><br/>Seeing Gu Yang, the man in black cloak couldn’t help but be stunned. For an instant, he thought the Celestial Being had returned.<br/><br/>“Phoenix Dance Nine Heavens”, this technique was left by the Celestial Being when he was undergoing rebirth, claiming that this method would be disseminated. Once someone could cultivate this technique to the divine power realm, they could be apprehended and their power transferred to the Celestial Being.<br/><br/>They have returned to this world for more than a millennium, but to this day, only one person has cultivated this techniques to the divine power realm.<br/><br/>Unexpectedly, after cultivating this method, this human possessed the same aura and power as the Celestial Being.<br/><br/>If he didn’t know the truth, he might mistakenly think that the person in front of him was the Celestial Being!<br/><br/>The man in black cloak, looking at the human in front of him, felt a surge of anger rise in his heart.<br/><br/>In his opinion, this human was blaspheming the Celestial Being!<br/><br/>If not for the Holy Lord’s order to capture alive, he would have wished to kill this person on the spot.<br/><br/>At his command, Shen Zhou and Shen Yi took action simultaneously.<br/><br/>Immediately, the sky darkened.<br/><br/>Just now it was cloudless with the sun shining bright, but in the blink of an eye, darkness had swept across the land.<br/><br/>The three people below could only see darkness before their eyes, unable to see anything.<br/><br/>The Shen Family’s Taiyou Moon Devouring Technique was extremely difficult to contend with, even the old man with a high cultivation level had no solution against them.<br/><br/>The key was, the old man didn’t have his sword. The branch he held was just ordinary. Though it was long and straight, it wasn’t really feasible to use it against a tri-sky mana powerhouse.<br/><br/>If it were another tri-sky mana powerhouse, he should be capable of protecting Gu Yang and escaping.<br/><br/>Against the Shen Family, he was powerless. As long as the opponent dispatched one person to hold him, the other two were enough to kill Gu Yang ten times over.<br/><br/>“The same old tricks again.”<br/><br/>Gu Yang and the Shen Family were longtime adversaries too, from first rank, to golden body realm, to mana realm, they had crossed swords.<br/><br/>The person in front of him, one’s strength was similar to Shen Guang, not a concern.<br/><br/>The other was a tri-sky mana powerhouse, it should be Shen Zhou of the Shen Family who was closest to reaching the Unleaking Realm.<br/><br/>This person was powerful, making him feel threatened.<br/><br/>But there was no fear in Gu Yang’s eyes, as he raised his Phoenix Feather Knife high.<br/><br/>I’ve even killed people in the Unleaking realm. What do I have to fear from a tri-sky mana powerhouse?<br/><br/>The fourth move of “Shenxiao Six Ruination”: Mortal’s Decay!<br/><br/>This saber technique was the exact counter for the Shen family’s Taiyou Moon Devouring Technique.<br/><br/>Where the blade intent reaches, darkness is pushed back.<br/><br/>“This is”<br/><br/>Down below, the old man perceived a blade intent that was immensely familiar, a hint of awe and fear flashed across his face.<br/><br/>It’s indeed the Mortal’s Decy!<br/><br/>This blade technique that shouldn’t exist in the world, after twenty years, had once again appeared in the human realm.<br/><br/>The other two beside him had too low cultivation levels. When they sensed the blade intent, their minds went blank and they didn’t understand what it was.<br/><br/>“What?”<br/><br/>Shen Zhou was now in front of Gu Yang, reaching out to grab him.<br/><br/>However, an undescribable wave spread out, his mana was unexpectedly melting like ice, the darkness dissolved, and his figure appeared on the spot.<br/><br/>What kind of power is this?<br/><br/>Before that wave hit him, he had a chilling premonition and tried to dodge subconsciously.<br/><br/>But it was too late.<br/><br/>In an instant, Shen Zhou felt a piercing cold moisture sweeping over him, his internal mana was rapidly dissipating, and he was horrified.<br/><br/>Behind Gu Yang, the figure of Shen Yi was almost simultaneously forced out from the darkness.<br/><br/>His cultivation was lower, and he fared even worse, the mana inside his body almost completely dissipated and his face turned white out of fear.<br/><br/>All along, his Taiyou Moon Devouring Technique was almost invincible.<br/><br/>This was the first time someone broke his technique so easily.<br/><br/>Moreover, in a way he couldn’t comprehend.<br/><br/>What kind of ghost blade technique is this?<br/><br/>“Something’s not right!”<br/><br/>Shen Zhou had experienced the war-torn years during the end of the Qin era and had fought with a powerhouse like Qin Wu. His experience was extremely rich.<br/><br/>Just from the flow of Qi, he detected that Gu Yang’s sword had not been fully consummated yet; it lacked the final changes that could truly take lives.<br/><br/>There’s still a chance!<br/><br/>Shen Zhou reacted instantly, forcibly severing the connection between his internal mana and the world.<br/><br/>This was already nearly an Unleaking Realm maneuver.<br/><br/>The rate his mana was dissipating slowed down significantly.<br/><br/>As long as he could withstand until the power of this technique passed, he would be fine.<br/><br/>Now Gu Yang’s cultivation was at the dual-sky mana realm, which was a step up from when he killed Shen Guang.<br/><br/>However, it was still one level lower compared to him.<br/><br/>With six hundred years of cultivation, Shen Zhou’s internal mana had reached the peak that the mana realm could achieve.<br/><br/>In a battle of attrition, Gu Yang was definitely not his match.<br/><br/>This blade technique was so terrifying that the consumption must be immense.<br/><br/>A cold smile surfaced on the corner of Shen Zhou’s mouth.<br/><br/>Just at this moment, he saw a golden figure flying out from Gu Yang’s brow, rapidly growing in size, and in the blink of an eye, it transformed into a gold giant ape.<br/><br/>The smile on his face froze.<br/><br/>That was actually a mana realm demon ape!<br/><br/>A second Original Spirit?<br/><br/>An external manifestation?<br/><br/>“Nine Heavens Divine Method”?<br/><br/>“How could this happen?”<br/><br/>Shen Zhou watched the gigantic furry hand swing down, an unwilling roar resonated in his heart.<br/><br/>He had lived for six hundred years, experienced the war chaos of the late Qin Dynasty, obliterated all competitors within the Shen Family, and his cultivation level was second only to the ancestor.<br/><br/>Even Qin Wu hadn’t been able to kill him.<br/><br/>He was just one step away from the Unleaking Realm.<br/><br/>He only needed to wait for either Shen Guang or Shen Yi to break through to the third level of Mana, and he could cross that threshold and reach the Unleaking Realm.<br/><br/>Now, he was going to die at the hands of someone in the second Realm of Mana.<br/><br/>He was unwilling—<br/><br/>Splat!<br/><br/>The Divine Ape slapped him into a pulp.<br/><br/>The Divine Ape was an ancient divine beast, whose physical strength reached unimaginable heights. Even the divine light protective layer of the Unleaking realm could be cracked by its slap.<br/><br/>Even other divine beasts couldn’t withstand its palm.<br/><br/>let alone Shen Zhou of the third realm of Mana.<br/><br/>The manifested Divine Ape, eyes red with slaughter, took down one after another, and two of the Shen Family’s Mana realm powerhouses were thus annihilated.<br/><br/>The old man below watched with his mouth agape, his expression stunned.<br/><br/>A powerhouse of the third Mana realm just died like that?<br/><br/>It was as if he was watching a child’s play.<br/><br/>It gave him a strong sense of unreality.<br/><br/>Even in his peak period, killing Shen Zhou would not be an easy task.<br/><br/>Although Shen Zhou never made it on the Master’s List, the uniqueness of the Taiyou Moon Devouring Technique made him the most difficult to deal with among all the unbeatable powerhouses of the third Mana realm.<br/><br/>Nowadays, whether it was the few from Four Great Sacred Lands or the two Celestial Beings from Great Zhou, they seldom appeared.<br/><br/>The same was true for those in the Unleaking Realm.<br/><br/>They were like strategic weapons, not to be easily wielded unless absolutely necessary.<br/><br/>Twenty years ago, Wu Da made his move, causing most of the world’s powers to be involved. The impact of this event continues to this day.<br/><br/>For the most part, the powerhouses of the Third Mana Realm were the world’s top fighters, known as the unparalleled elites.<br/><br/>The Nine Families, the Six Sects, and all other forces. The more third Mana realm powerhouses in a certain family, the stronger that family is.<br/><br/>Now, led by the Qin Family among the Nine Families, in addition to Qin Wu’s own unparalleled strength, the three top powerhouses of the Qin Family also play a significant role.<br/><br/>As for the Academy, though touted as the leader of the Six Sects, it’s more about its influence.<br/><br/>The actual strongest power still lies with the Sword Palace.<br/><br/>There are three people on the Master’s List.<br/><br/>It’s just that the Sword Palace has always been low-key, rarely getting involved in worldly matters, so their presence isn’t as significant.<br/><br/>The Shen Family only had Shen Zhou as a top powerhouse, and his death is a loss the Shen Family can hardly bear.<br/><br/>The old man’s mind was in a mess, and for a moment, he didn’t know how to react.<br/><br/>At this point, the Blade Intent dissipated.<br/><br/>Wu Xingyun and Yan Wenjun also swiftly came back to their senses and looked around. They saw Gu Yang standing there in perfect health, with a golden-haired giant ape three meters tall by his side.<br/><br/>The two powerhouses of the Shen Family’s Mana realm were nowhere to be seen.<br/><br/>What happened?<br/><br/>What just happened?<br/><br/>Both Wu Xingyun and Yan Wenjun were somewhat baffled. In just a blink of an eye, they felt like they had missed something important.<br/><br/>[Received thirty units of energy, current balance forty-eight.]<br/><br/>[Received twenty units of energy, current balance sixty-eight.]<br/><br/>Gu Yang was in high spirits when he saw such a prompt after killing the two Mana Realm powerhouses of the Shen Family.<br/><br/>Previously, in many simulations, the Shen Family had given him a lot of trouble, wasting many of his simulation chances.<br/><br/>Now, by taking down the two Mana Realm powerhouses of the Shen Family, he felt a sense of revenge.<br/><br/>He took the two Spirit Tools left at the scene and didn’t rush to recharge them. He glanced down at a certain place.<br/><br/>He had spotted Wu Xingyun’s whereabouts earlier, but unfortunately, he didn’t have time to greet him.<br/><br/>Swoosh, Gu Yang’s figure disappeared from its original place, chasing after the man in the black robe.<br/><br/>The man in the black robe turned and fled as soon as he killed the two people from the Shen Family.<br/><br/>How could Gu Yang let him escape? He immediately gave chase.<br/><br/>“What in the world just happened?”<br/><br/>Wu Xingyun saw that Gu Yang was actually chasing after the powerhouse of the Mana Realm, and felt somewhat confused. He felt like there was a gap in the plot, and it was the most important part.<br/><br/>He couldn’t help but ask the man next to him, who he had just acknowledged as his master.<br/><br/>Yan Wenjun also had the same doubt. In fact, she had an inkling of what might have happened, but it was so incredible that she hardly dared to believe it.<br/><br/>The old man looked at the two of them and said with a somewhat disinterested tone, “He killed both Shen Zhou and Shen Yi.”<br/><br/>Killed them?<br/><br/>Wu Xingyun and Yan Wenjun looked at each other, shock visible in their eyes.<br/><br/>He really lived up to his reputation!<br/><br/>PS: Looking for the third update, please vote monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}