{"id": 255, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132111.html", "title": "Chapter 255 - Chapter 255: 255 Asura Fields", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 255 - Chapter 255: 255 Asura Fields</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 255: 255 Asura Fields<br/><br/>The front of Tianxin Martial Hall was bustling with activity, exceedingly lively.<br/><br/>It just so happened to be the day of recruitment at the martial hall, and the number of people who came to register had increased tenfold compared to before.<br/><br/>The news of Cheng Tianxin breaking through to the First Rank had already spread throughout Divine City.<br/><br/>From a commoner, he became a generational Grandmaster.<br/><br/>What’s more, the whole world knows that Cheng Tianxin has an inseparable relationship with Gu Yang.<br/><br/>Therefore, countless people in Divine City want to enter Tianxin Martial Hall and are almost fighting over a slot.<br/><br/>Suddenly, the originally bustling entrance of the martial hall became much quieter.<br/><br/>As if silence was contagious, in a short while, it was so quiet at the entrance that you could hear a pin drop.<br/><br/>Ding Dong Dong…<br/><br/>With a crisp ringing sound, a green donkey slowly walked to the door. Sitting on the donkey was a beautiful and mysterious woman in a green dress, who had a special power that makes people dare not breathe heavily.<br/><br/>The woman looked up at the plaque of Tianxin Martial Hall.<br/><br/>After confirming that this was the right place, she got down from her donkey and led it by the reins towards the entrance.<br/><br/>At the entrance, the crowd automatically cleared a path.<br/><br/>She walked up to a disciple of Tianxin Martial Hall and politely asked, “Is Gu Yang here?”<br/><br/>The disciple was somewhat at a loss, “Ah?”<br/><br/>A hint of shyness flashed in the woman’s eyes, “I am his… wife, please inform him.”<br/><br/>Gu Yang’s wife?<br/><br/>The crowd immediately boiled over.<br/><br/>Regarding Gu Yang, besides his incredible cultivation speed and various records of defeating the strong as the weak, crossing realms to kill enemies like cutting melons and vegetables, what makes people talk the most is the rumors of his relationship with the Princess Chang and the two sisters of the Empress.<br/><br/>This is why he is called the most beautiful man in the world.<br/><br/>Now, a woman claiming to be Gu Yang’s wife has come to Tianxin Martial Hall.<br/><br/>This news is too explosive.<br/><br/>Before long, Cheng Tianxin received the news and came out personally to greet her. Following him were his daughter Cheng Qingyu and his adopted daughter Cheng Xue.<br/><br/>To be honest, Cheng Tianxin was a little confused when he heard about this. Gu Yang never said that he had a wife.<br/><br/>Of course, he had already heard about Gu Yang’s romantic adventures along the way.<br/><br/>Most likely, it is another romantic debt.<br/><br/>He dared not neglect it and came out in person.<br/><br/>Gu Yang had done a great favor to him, regardless of whether the woman’s words were true or false, he would treat her well.<br/><br/>“I am Cheng Tianxin, the master of the martial hall. Miss, please come in.”<br/><br/>Cheng Tianxin briefly introduced himself and led the woman in.<br/><br/>Once they reached the backyard, he finally asked, “May I know your name, miss?”<br/><br/>“My last name is Pei.” The woman seemed unwilling to reveal her first name.<br/><br/>Cheng Qingyu’s eyes lit up at her side, blurting out, “Are you Pei Qianlan? Have you really broken through to the Divine Power realm?”<br/><br/>The two biggest pieces of news in Divine City a few days ago.<br/><br/>One is that Gu Yang broke through to the Mana realm in Qi Province and killed Shen Guang, a double heavenly power expert of the Shen family on the spot.<br/><br/>Once again proving that when he reached the Divine Power realm in Divine City, he could still cross realms to kill enemies.<br/><br/>The second piece of news is that Pei Qianlan, who is number one on the First Rank List, her name disappeared.<br/><br/>But her name is still on the Beauty list.<br/><br/>This means that she did not die, but broke through to the Divine Power realm!<br/><br/>From the time she made it on the First Rank List to breaking through into the Divine Power realm, she only spent two months. Her progress could almost match Gu Yang’s.<br/><br/>This further pushed Gu Yang’s fame to the peak.<br/><br/>Everyone should know that Pei Qianlan is already famous.<br/><br/>When she was still the Jinghai Princess, she was only fifth on the Hidden Dragon List, and was several years older than Chu Xiyue and Wu Xingyun, who were then first and second on the list.<br/><br/>Her potential was not considered top-tier.<br/><br/>Not until she eloped with Gu Yang did her cultivation make rapid progress, and in a few short months, she broke through to the First Rank, jumping to the top of the Hidden Dragon List.<br/><br/>And then, she became number one on the First Rank List.<br/><br/>Now, she has broken through to the Divine Power realm.<br/><br/>It’s almost like she has followed the same path as Gu Yang.<br/><br/>Now, the hottest topic in the entire Divine City is why Pei Qianlan had such a drastic change after meeting with Gu Yang.<br/><br/>Some people say that Gu Yang is the protagonist of this era, possessing opportunities unimaginable to others. Pei Qianlan benefited greatly from being with him.<br/><br/>Others say that Gu Yang has an elixir, a pill that can completely change a person.<br/><br/>The most outrageous claim is that Gu Yang is proficient in dual cultivation techniques, and Pei Qianlan’s cultivation skyrocketed after cultivating with him.<br/><br/>These people obviously read too many novels.<br/><br/>Regardless, Pei Qianlan’s fame has already resonated throughout Great Zhou.<br/><br/>Many young women regard her as an idol.<br/><br/>Cheng Qingyu is one of them, so when she heard that the blue-clothed woman claimed her last name was Pei, she excitedly yelled out.<br/><br/>Pei Qianlan was somewhat embarrassed when her identity was directly exposed, but luckily her face was hidden behind a veil, so no one could see her flushed face.<br/><br/>“Brother Gu is not in the Divine City at the moment,” Cheng Tianxin quickly changed the topic to save her.<br/><br/>Pei Qianlan asked, “Then where has he gone?”<br/><br/>“I am not sure, he did not tell me,” Cheng Tianxin replied.<br/><br/>“Oh.”<br/><br/>Pei Qianlan was a bit disappointed.<br/><br/>Half a year ago, Gu Yang had practically tricked her into that secret realm, then claimed he had some business to take care of and left them all behind, setting out on his own.<br/><br/>Ten days ago, she finally broke into the Divine Power Realm and forcefully opened the exit, leaving the secret realm.<br/><br/>On her way to the Divine City, in order to ensure her safety, she purchased a donkey rather than flying. She rode this donkey all the way to the Divine City.<br/><br/>Along the way, she heard many rumors about Gu Yang.<br/><br/>The most troubling to her were the scandals about him, Princess Chang, and the queen. In particular, the rumor that Gu Yang murdered the emperor for the queen.<br/><br/>Pei Qianlan knew that he was fully capable of such actions.<br/><br/>She had also heard that Gu Yang had left the Divine City, but she was at a loss as to where to look for him and decided to go to the Divine City to inquire.<br/><br/>“Miss Pei,” Cheng Tianxin hesitated for a moment with the address, but he still went with the term ‘Miss’, “Brother Gu has offended many people in the Divine City.”<br/><br/>“Given your close relationship with Brother Gu, I’m afraid those people may pose a threat to you. The literary institute would be a safer place to go. Brother Gu has a strong relationship with Principal Zhou, so he might know Brother Gu’s current whereabouts.”<br/><br/>His words were very tactful.<br/><br/>In reality, in the Divine City, the only one who can be considered an enemy of Gu Yang is the Lord of the State.<br/><br/>To the Lord of the State, Gu Yang, being a regicide is an inevitable target for eradication.<br/><br/>The Lord of the State would naturally not target a woman who has just broken into the Divine Power Realm, but his subordinates might not be so scrupulous.<br/><br/>And in the Divine City, only the Empress Dowager and literary institute can protect Pei Qianlan.<br/><br/>Pei Qianlan said, “Thank you for the reminder, Dean.”<br/><br/>Pei Qianlan is a sensible person. She bid farewell to Cheng Tianxin on the spot and headed to the literary institute.<br/><br/>Cheng Qingyu volunteered to guide her there.<br/><br/>To avoid alarming those at the front entrance, Cheng Tianxin arranged a carriage for her to leave from the back door.<br/><br/>“Sister Pei, how did you meet Brother Gu?”<br/><br/>“How did you achieve Divine Power so quickly? Everyone is saying that Brother Gu gave you an elixir, is it true?”<br/><br/>Along the way, Cheng Qingyu chirped non-stop with questions.<br/><br/>Pei Qianlan was also quite fond of this vivacious and beautiful girl who made herself at home, and the two chatted the entire way.<br/><br/>Before they knew it, they had arrived at the gate of the literary institute.<br/><br/>Suddenly, the carriage came to a halt.<br/><br/>The carriage driver reported, “Miss, the carriage can’t get past.”<br/><br/>Unable to pass?<br/><br/>Pei Qianlan and Cheng Qingyu pushed open the carriage window, looking forward, they saw an extremely luxurious carriage blocking the way.<br/><br/>Cheng Qingyu was surprised, “It’s Princess Chang’s carriage!”<br/><br/>Then, a condescending voice sounded, “I heard someone was pretending to be Gu Yang’s wife, in this world, there are truly some shameless women.”<br/><br/>This was undisguised public provocation!<br/><br/>At this point, it was school dismissal time, there were many people at the entrance of the Institute who recognized Princess Chang’s carriage.<br/><br/>This carriage had been parked here for quite some time, which had puzzled onlookers. But now, upon hearing Princess Chang’s words, they were all stunned.<br/><br/>Pei Qianlan was almost furious, but she refused to lose her composure in front of a potential rival, speaking coldly, “Gu Yang and I have already pledged ourselves to each other for eternity. It’s hardly the place of any hussy to interfere.”<br/><br/>At this, the crowd slowly began to realize what was happening and it instantly caused an uproar.<br/><br/>Princess Chang was having a public showdown with another woman out of jealousy.<br/><br/>This was truly the sight that people most enjoyed watching.<br/><br/>“How absurd. He has never mentioned having a wife to me. It appears you are deluding yourself, daydreaming.”<br/><br/>“Ha! There is much you do not know. For instance, Gu Yang has several wives. If you wish to join us, you will have to be the fifth, and in future, you will have to pour tea and bow for me.”<br/><br/>The moment these words came out, everyone present was shocked.<br/><br/>These were harsh words, how could Princess Chang possibly tolerate them?<br/><br/>Boom!<br/><br/>A strong surge of mana erupted skyward, Princess Chang furiously replying, “You insolent woman, how dare you insult me like this?”<br/><br/>On the other side, Pei Qianlan did not back down. A steady stream of sword intent defused the suppression, replying, “What, can’t take it? You’re so jealous, how could Gu Yang fancy you?”\t\t\t\t\t\t</div>", "images": {}, "success": true}