{"id": 259, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132120.html", "title": "Chapter 259 - Chapter 259: 259 Phoenix Reincarnation (Third Update, Asking For Monthly Ticket)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 259 - Chapter 259: 259 Phoenix Reincarnation (Third Update, Asking For Monthly Ticket)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 259: 259 Phoenix Reincarnation (Third update, asking for monthly ticket)<br/><br/>In the simulation, after battling with the disciples from Wuyou Mountain, he managed to take down a cultivator in the Unleaking realm, scoring a hundred points.<br/><br/>Estimated another hundred points or so from defeating seven cultivators in the Mana realm.<br/><br/>Cultivators at this level usually have a magic treasure and seven spirit tools, so a hundred points for this seems fair.<br/><br/>Plus the points from the ordinary disciples he defeated a few days ago, taking into account roughly a few dozen points, it should be no problem.<br/><br/>Gu Yang made a quick calculation and was momentarily taken aback.<br/><br/>All added up, it was at least four hundred points.<br/><br/>If he managed to take down the next Unleaking realm cultivator, it would be another hundred points, and two more magic treasures.<br/><br/>This would make a total of five to six hundred points.<br/><br/>DONE!<br/><br/>After pulling this off, it should be enough for him to break through to the third layer of the Mana realm.<br/><br/>However, to eliminate the Unleaking realm cultivator from the Ancient River Sword Sect, at the very least, he needed to possess the capability to escape.<br/><br/>His current strength was not quite sufficient yet.<br/><br/>Gu Yang did not hesitate and opened the system. He glanced at his remaining balance—98 points.<br/><br/>“Use the Life Simulator? Each use consumes 20 energy points.”<br/><br/>“Yes.”<br/><br/>“You left Shuiyue Cave Heaven with Ye Lingbo…”<br/><br/>“You hid in the palace, received a token from the Empress Dowager, and since then, the prohibition in the palace did not affect you. You’ve been cultivating hard in the palace.”<br/><br/>“Ten days later, several Unleaking realm powers appeared in Divine City and started a great battle. An enormous skull appeared in the sky. A Celestial Being barged into the palace.”<br/><br/>“The Empress Dowager activated the palace’s great formation. Luo Wang appeared and jointly forced the Celestial Being to retreat. Eventually, the enemy retreated.”<br/><br/>“Ten years later, Qin Wu raised the banner of rebellion, launched a military campaign against Zhou, and killed all the way to Divine City. Luo Wang appeared again, blocking Qin Wu.”<br/><br/>“At the same time, several Unleaking realm cultivators killed their way into Divine City. Above the Academy, a massive skull appeared. Once again, the Celestial Being attacked the palace.”<br/><br/>“The Empress Dowager re-activated the formation and held off the Celestial Being.”<br/><br/>“At the critical moment, the outside battle broke the ancient prohibitions, creating a spatial passageway. A Celestial Being from the Star Luo Sect emerged.”<br/><br/>“Soon after, several Celestial Beings from Star Luo Sect arrived. That Celestial Being who invaded the palace retreated.”<br/><br/>“In that battle, the Dean of the Academy fell, Luo Wang fell, and Qin Wu was seriously injured. Divine City was besieged.”<br/><br/>“Three years later, several Celestial Beings from Star Luo Sect broke the grand formation of Divine City. Amid the fierce battle, you encountered several perils but were saved by the Shen Family patriarch every time.”<br/><br/>“In the end, the three Great Sages from San Shengmen captured and took you away.”<br/><br/>“You were brought to a certain place, forced to pour your mana into that stone egg. A year later, you died due to exhausted sources at the age of 36.”<br/><br/>Indeed, the palace’s grand formation was resilient in being able to hold off a Celestial Being.<br/><br/>Su Ningyan was indeed trustworthy. She did not hesitate to activate the palace’s grand formation during perilous times.<br/><br/>Activating the grand formation definitely came with great costs.<br/><br/>For him, Su Ningyan even dared to resist Celestial Beings, a truly commendable loyalty.<br/><br/>Moreover, it had already delayed things for an additional thirteen years, which was not bad.<br/><br/>Gu Yang was quite content.<br/><br/>As for why Shen Yun did not go to the Guanghan Immortal Palace, it was simply because Shen Yun was no fool.<br/><br/>After a long delay in Divine City, if he intended to rush to Luo Prefecture at such a time, he would definitely be caught halfway.<br/><br/>Upon reaching the Unleaking realm, one would possess divine powers that could see and hear across vast distances. Within a thousand miles, no one could escape Shen Yun’s pursuit.<br/><br/>“The simulation is over, you can keep one of the following”<br/><br/>“One, your martial arts realm at age 35.”<br/><br/>“Two, your martial arts experience at age 36.”<br/><br/>“Three, your life wisdom at age 36.”<br/><br/>“I choose one.”<br/><br/>With a major battle imminent, Gu Yang used up the remaining three chances for simulation.<br/><br/>In the last simulation, a new change emerged.<br/><br/>“You’ve advanced to the sixth level of the ‘Divine Phoenix Manual’, condensing a Phoenix Avatar…”<br/><br/>Gu Yang was overjoyed. At last, the ‘Divine Phoenix Manual’ had reached the sixth level.<br/><br/>With the addition of a Phoenix Avatar, his strength had significantly increased. It was enough to give a big surprise to the Unleaking realm powerhouse from Ancient River Sword Sect.<br/><br/>After Gu Yang claimed his reward, an anomaly stirred again in the sky as a Phoenix materialized amidst the flames.<br/><br/>At this point, Huang Yongkang had just bid farewell to his parents and left the town. Then, far away, he saw the anomaly in the sky, and was shocked.<br/><br/>How could there be a Phoenix Divine Beast here?<br/><br/>In Shuiyue Cave Heaven, the Monster Race was not uncommon. Among the six unorthodox sects, many belonged to the Monster Race.<br/><br/>Apparently, there existed a kingdom of the Monster Race on the far-eastern islands. However, they seldomly came to the mainlands.<br/><br/>Phoenix, being an ancient divine beast, was nearly invincible within the same realm.<br/><br/>Powerful beings in the Four Major Orthodoxies liked to domesticate divine beasts, using them as mounts or to guard the sect’s gate.<br/><br/>The Phoenix in front of them was only in the Golden Core stage.<br/><br/>If the news spread, it would probably attract numerous Nascent Soul realm powerhouses to vie for it.<br/><br/>“This senior is really high-profile.”<br/><br/>Huang Yongkang realized that the Phoenix must be related to the senior. Maybe it was his mount.<br/><br/>He was even more curious about the origins of the senior. Even in this world, including the Water Moon Sect, there should not be such an impressive figure.<br/><br/>Where did he come from?<br/><br/>By the time Huang Yongkang arrived at the broken temple, the Phoenix had already disappeared. He didn’t ask questions. Urged by Gu Yang, he immediately led the way.<br/><br/>The destination was Worry-free Mountain.<br/><br/>Worry-free Mountain was not originally called as such. One day, Worry-Free Patriarch chose this place as the Sect’s location. From then on, it became Worry-Free Mountain.<br/><br/>What it was called before held no importance to anyone.<br/><br/>Well, there was one person who cared.<br/><br/>“This place used to be called Baoping Mountain.”<br/><br/>Jiang Chu’er’s expression was somewhat gloomy when she said this.<br/><br/>For hundreds of years, Baoping Mountain was Jiang Family’s territory, until one day, disaster struck. The Worry-Free Patriarch tormented every member of the Jiang Family for ten days and nights, turning them all into resentful spirits, forever trapped within his Ten Thousand Souls Banner, never to be reincarnated.<br/><br/>Jiang Chu’er’s grandfather was the only survivor of the Jiang Family.<br/><br/>For years, her grandfather pleaded with the Four Major Orthodoxies to take justice for the Jiang Family.<br/><br/>But he couldn’t even get through their doors, let alone persuade them to help.<br/><br/>Over the years, Jiang Chu’er had seen clearly that these orthodox Sects didn’t care about the life and death of others.<br/><br/>If she wanted revenge, she had to rely on herself.<br/><br/>Next to Jiang Chu’er was a handsome man looking worried, “Sister Chu’er, Worry-Free Mountain is filled with powerhouses. Even the Four Major Orthodoxies can’t do anything about it. It’s too dangerous for you to go alone. If discovered, the consequences are unthinkable.”<br/><br/>But Jiang Chu’er had made up her mind, “The Worry-Free old thief is not at the Sect right now. This is a perfect opportunity. I have to take this risk. I have to find the family heirloom that grandfather spoke of. Only then will I have the hope of revenge in this life.”<br/><br/>“But…”<br/><br/>“If you’re afraid, you can leave first.”<br/><br/>“Sister Chu’er, how can I let you face the danger alone. Fine, even if it is a path of thorns and fire, I will accompany you.”<br/><br/>“Brother Lin Yi!”<br/><br/>“What a loving couple.”<br/><br/>Suddenly, a cold voice rang out.<br/><br/>The two, who were indulging in their affection, were startled and turned to see a man in black standing on a large rock.<br/><br/>“Yan Yi!”<br/><br/>Jiang Chu’er’s face turned pale when she saw his face.<br/><br/>Yan Yi, the seventh disciple of Worry-Free patriarch, in the early stage of his Golden Core cultivation, was cruel and cunning, wielding a Soul Devouring Whip, notorious for his ruthlessness.<br/><br/>Why was he here?<br/><br/>Jiang Chu’er was only in the late stage of the Foundation Establishment.<br/><br/>The only reason she dared to sneak into Worry-Free Mountain was because of a Spirit Tool capable of hiding her presence, fooling Golden Core cultivators.<br/><br/>But who would have thought that she’d bump into Yan Yi before she even got up the mountain.<br/><br/>She was in deep trouble now!<br/><br/>Just then, she heard a thump. Lin Yi’s voice of fear rang out, “Senior Yan, I bear no ill will towards Worry-Free Mountain. It was her. She forced me to come…”<br/><br/>Jiang Chu’er looked at the man who had just now vowed to live and die with her. Now, like a dog, he was kneeling on the ground begging Yan Yi for mercy. Her body shook with anger, nearly spitting out a mouthful of blood.<br/><br/>Yan Yi chuckled, “Such shamelessness. This is the face of the Orthodox Sect, no better than the disciples of our Unorthodox Six Sects.”<br/><br/>Lin Yi, a disciple of Pine Mountain Sect, was indeed part of an Orthodox Sect.<br/><br/>“Yes, yes, I’m disgraceful…”<br/><br/>Yan Yi didn’t kill him and said, “You can scram now.”<br/><br/>The Pine Mountain Sect was not weak in itself and had close ties with the Water Moon Palace, one of the Four Major Orthodoxies. There was no need to make an enemy of the Pine Mountain Sect.<br/><br/>The only reason the Unorthodox Six Sects managed to survive was by never offending disciples of the Four Major Orthodoxies.<br/><br/>Lin Yi, like a man pardoned from death, crawled away hastily.<br/><br/>Yan Yi looked at Jiang Chu’er, greed flashing in his eyes, “You just said that your Jiang Family has a family heirloom magic treasure still on the mountain…”<br/><br/>“Over my dead body!”<br/><br/>Jiang Chu’er would never let her family’s magic treasure fall into the hands of the Worry-Free patriarch’s disciples. She was about to end her life when she suddenly found she couldn’t move.<br/><br/>Yan Yi laughed, “Want to kill yourself? You have to ask me first. Now, I give you two choices. One, you lead me to the magic treasure and I’ll spare your life.”<br/><br/>“Two, I’ll make you experience the torment of living death until you can’t bear it anymore and lead me to the magic treasure.”<br/><br/>Jiang Chu’er felt completely hopeless.<br/><br/>The last hope of revenge for her family was about to be extinguished.<br/><br/>Suddenly, a sudden voice rang out, “You have a third choice. Give me the magic treasure and I’ll kill him for you.”<br/><br/>At that moment, Jiang Chu’er realised that she could move again, and was both startled and overjoyed.<br/><br/>She turned her head and saw two men and a woman who had silently appeared by her side.<br/><br/>“You’re courting death!”<br/><br/>Yan Yi was also shocked. As he was about to make a move, he suddenly felt a terrifying pressure that immobilized him. He couldn’t move at all.<br/><br/>Fear overwhelmed him.<br/><br/>Just by using his mana, the stranger had completely restrained him,<br/><br/>“Didn’t you see that I was doing business? Bug off.” The front man casually waved his sleeve and Yan Yi was swept aside.<br/><br/>He smiled and said, “How about it? If you agree, I’ll kill him right now.”<br/><br/>Jiang Chu’er didn’t hesitate to nod her head, “I agree.”<br/><br/>splurt!<br/><br/>Yan Yi’s head exploded in an instant.<br/><br/>PS: Given the fact that I’ve been typing till 1 AM, please cast a few monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}