{"id": 251, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132103.html", "title": "Chapter 251 - Chapter 251: 251 Forget Righteousness Upon Seeing Benefits", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 251 - Chapter 251: 251 Forget Righteousness Upon Seeing Benefits</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 251: 251 Forget righteousness upon seeing benefits<br/><br/>Outside the city of Yuzhou, there is a Thousand Stars Mountain, and the ancient home of the Shen Family is located right there.<br/><br/>This ancestral home has been there for more than a thousand years, and only the direct descendants of the Shen Family have the privilege to live there.<br/><br/>On this day, the Shen Family’s old house was extraordinarily lively, with many people standing at the entrance waiting.<br/><br/>Before long, a horse-drawn carriage arrived and stopped at the entrance.<br/><br/>A man in white, Shen Baiyi, dismounted from the carriage.<br/><br/>“Greetings to the young lord,” the crowd at the entrance saluted almost in unison.<br/><br/>With a proud smile on his face, Shen Baiyi stepped through the main gate of the Shen Family Mansion.<br/><br/>He was already twenty-eight years old, and according to the family’s decision, he was officially pronounced the heir of the Shen Family, the future patriarch.<br/><br/>Just as he was basking in self-satisfaction, he suddenly overhears a discussion not far away, “Can’t even enter the top ten on the Hidden Dragon List, I wonder why he’s so proud.”<br/><br/>“Yeah, the Shen Family has never had such a useless heir.”<br/><br/>“I will definitely replace him in ten years.”<br/><br/>The smile on Shen Baiyi’s face stiffened, and anger surged in his heart, though he didn’t explode.<br/><br/>The Shen Family has its own rules. No matter how competition amongst peers stirred, it was absolutely forbidden to target those younger.<br/><br/>He recognized those who were gossiping, each one about ten years younger than him, though they were of the same generation. Their realms were far apart, and they all belonged to another faction within the Shen Family.<br/><br/>Moreover, what they said was true, leaving him no reason to get angry.<br/><br/>But, could this be blamed on him?<br/><br/>More than half a year ago, he was the young and promising candidate ranked third on the Hidden Dragon List, just behind Chu Xiyue and Wu Xingyun.<br/><br/>Until Gu Yang came along, forcing him down to the fourth place. From then on, geniuses appeared as if they were springing up like water from a geyser.<br/><br/>Pei Qianlan, for instance, suddenly rose to the first place, followed by the appearance of Wu Lingling, then Xu Ruomei, and finally, even Su Qingzhen managed to surpass him.<br/><br/>What more, people like Han Mengling and Feng Tianci, whose names he had never heard before, also surpassed him.<br/><br/>And just like that, he was squeezed out of the top ten.<br/><br/>What was even more frightening was the terrifyingly high cultivation levels of these people.<br/><br/>The top five in the Hidden Dragon List were now all of the First Rank.<br/><br/>The ranks six to eleven were all Second Grade.<br/><br/>He barely made it to the eleventh place.<br/><br/>The martial artists of this generation were really intense.<br/><br/>You should know that, in the past, having a First Rank on the Hidden Dragon List was a major event that shocked everyone, occurring roughly once every hundred years or so.<br/><br/>But now, five First Rank powerhouses had appeared all at once. This was unprecedented.<br/><br/>Even on the list of prodigies, there were only two First Ranks.<br/><br/>Shen Baiyi felt unjust. With his cultivation level, if he were placed in any other generation of the Hidden Dragon List, he wouldn’t fall out of the top five.<br/><br/>Who could have thought that he would face such a group of freaks?<br/><br/>Speaking of which, all of this was caused by that Gu Yang.<br/><br/>Ever since Gu Yang topped the Hidden Dragon List, the world seemed to have become a bit abnormal.<br/><br/>Those who were ranked high on the Hidden Dragon List all had ties with him.<br/><br/>Pei Qianlan, who ranked first, had eloped with him.<br/><br/>The second-ranked Gu Xiyue, and the third-ranked Wu Xingyun, both had significant connections with him.<br/><br/>The fourth-ranked Han Mengling was allegedly the disciple of the Sword Saint, who later passed her to him.<br/><br/>Not to mention the fifth-ranked Su Qingzhi, who was his lover.<br/><br/>Going further down the list, even Xu Ruomei, and Feng Tianci were all related to Gu Yang.<br/><br/>This was just absurd.<br/><br/>Shen Baiyi felt a tinge of jealousy in his heart. What if he had gotten to know Gu Yang a bit earlier?<br/><br/>If he had become acquainted with Gu Yang a few months ago, and become familiar with him, he might already be a First Rank by now.<br/><br/>Boom!<br/><br/>As he was thinking this, a melodious bell sound suddenly rang from the backyard.<br/><br/>Suddenly, the entire Shen Mansion fell silent.<br/><br/>“This is —”<br/><br/>Shen Baiyi’s heart shuddered, he turned his head towards the backyard in disbelief, “The bronze bell, it actually rang.”<br/><br/>Outside the Shen Family’s ancestral hall, there was a huge bronze bell. Rumor had it that this bell had existed more than a thousand years ago.<br/><br/>However, from when he was a child until now, he had never seen anyone ring this bell.<br/><br/>When he was a child, he had specifically asked his father about it.<br/><br/>His father said that ever since the bell was placed there, it had never rung.<br/><br/>If one day, the bell were to ring, it would signify a major event had occurred.<br/><br/>Shen Baiyi originally thought that the bell would never ring, but unexpectedly, it started ringing all of a sudden.<br/><br/>Boom!<br/><br/>Another chime.<br/><br/>Boom, Boom…<br/><br/>After nine successive bell rings, several figures flew from the horizon. The Shen Family’s several Divine Power Realm experts had all arrived.<br/><br/>This was the first time Shen Baiyi had seen so many Divine Power Realm experts gathered in one place.<br/><br/>He hadn’t even known that the Shen Family had so many Divine Power Realm experts.<br/><br/>“What exactly happened?”<br/><br/>“What on earth happened?”<br/><br/>This question also emerged in Shen Zhou’s mind.<br/><br/>He possesses a triple mana realm cultivation level and, as the number two person in the Shen Family, naturally knows what it means when that bell chimes.<br/><br/>The Three Saints Sect, had sent an edict!<br/><br/>The bronze bell is a magical tool that requires a special technique to ring. The technique is only known to the disciples of the Three Saints Sect.<br/><br/>Years ago, the family’s ancestors told him that if the copper bell ever began to ring, it meant that a messenger from the Three Saints Sect had arrived.<br/><br/>In one thousand years, this was the first time this bell had rung.<br/><br/>“Could it be that the Grand Master already knows about that matter?”<br/><br/>As Shen Zhou thought of this, his respect for the Grand Master grew even more profound.<br/><br/>In the past, the ancestor was merely a servant in the Three Saints Sect, yet due to his efficiency, he was favored by the Grand Master, who dispatched him to Great Zhou and imparted the mysterious technique, hence, the formation of the Shen family as known today.<br/><br/>It could be said that everything the Shen family possesses was bestowed by the Grand Master.<br/><br/>That includes the cultivation level of the ancestor.<br/><br/>In a short while, several adepts from the area who were at the Divine Power Realm rushed over, descending into the courtyard.<br/><br/>“Fifth Uncle, why did the bell ring? Could it be…”<br/><br/>The one who had asked the question was Shen Zhou’s nephew, Shen Yi, whose cultivation level was at the second level of the Mana realm. He was only second to Shen Zhou in terms of power and hadn’t shown himself for many years.<br/><br/>Shen Yi and Shen Guang, both had the same Mana Realm Level Two cultivation level. They had been competing and hiding from each other for many years and no one knew their whereabouts.<br/><br/>Not long ago, Shen Zhou sent Shen Guang to assassinate Chu Xiyue. However, there’s been no message from him till now.<br/><br/>Shen Zhou replied, “Indeed, an edict from the Grand Master has arrived and will be here soon.”<br/><br/>Upon hearing this, the expressions of several adepts present in the divine realm became solemn.<br/><br/>After a while, Shen Yi again asked, “Where is Shen Guang? Why isn’t he here?”<br/><br/>“He’s not in Yuzhou.”<br/><br/>At this point, an operative responsible for intelligence who was also in the Divine Power Realm spoke up, “Fifth Uncle, we just received information about Shen Guang and I wanted to report it to you.”<br/><br/>“Go on.”<br/><br/>“A few days ago, Shen Guang was killed by Gu Yang in Qi Province.”<br/><br/>What?<br/><br/>Shen Zhou’s face drastically changed, “How is that possible?”<br/><br/>Shen Guang was in the Mana Realm Level Two. Gu Yang was merely in the Golden Body Third Level. Even if he had mastered the “Shenxiao Six Swords” saber technique that restrained the “Taiyou Moon Devouring Technique”, it was still impossible for him to kill Shen Guang.<br/><br/>“At that time, Gu Yang had already broken through to the Mana Realm!”<br/><br/>Upon hearing this, the entire courtyard fell silent.<br/><br/>The fact that Gu Yang was cultivating the “Phoenix Dance Nine Heavens” had long been spread throughout the Shen Family.<br/><br/>For over a thousand years, generations of the Shen Family have practiced this technique, but not a single one succeeded in reaching the First Rank.<br/><br/>Yet, an outsider who had stolen this technique showed a meteoric rise. In just half a year, he progressed from the First Rank to the Golden Body and now he had stepped into the Mana Realm.<br/><br/>Every member of the Shen family felt somewhat belittled.<br/><br/>How come there is such a big gap among humans?<br/><br/>Just then, Shen Zhou sensed something and looked up. He saw an unexpected silhouette appearing in the sky and felt a shock in his heart.<br/><br/>When did this person appear? He was completely oblivious!<br/><br/>This was a person covered in a black cloak, only revealing a pair of eyes. Emitting a strange aura all over, he pulled out a token and asked with a hoarse voice, “Do you recognize this token?”<br/><br/>Upon seeing the token, Shen Zhou immediately knelt down, “Shen Zhou greets the envoys of the Holy Gate.”<br/><br/>The rest of the people present also knelt down when they saw this, choruing, “Greetings to the envoys of the Holy Gate.”<br/><br/>The man in black responded, “I am Li Xue. The Grand Master has ordered to capture the one who has cultivated the ‘Phoenix Dance Nine Heavens’ alive and send him to the Holy Gate.”<br/><br/>Shen Zhou replied, “The person in question is named Gu Yang and his cultivation level is in the Mana Realm. Moreover, he has mastered the Shenxiao Six Swords saber technique which is tough to deal with.”<br/><br/>The man in black asked, “Where is Shen Yun?”<br/><br/>“The ancestor is currently not with the family.”<br/><br/>“Notify him immediately. You, and you, come with me to capture that person.”<br/><br/>The two people pointed out by the man in black were Shen Zhou and Shen Yi. Among the people present, these two had the highest cultivation level.<br/><br/>“Yes.”<br/><br/>Shen Zhou and Shen Yi replied together, then flew away with the man in black.<br/><br/>On the other hand, Gu Yang, who had just broken through, was planning to send Xi Huang and the Blue Bird away, “I just remembered that I have something to take care of. You guys go ahead to Tianzhu Mountain and wait for me.”<br/><br/>Blue Bird cried out, “Master, don’t leave me.”<br/><br/>Xi Huang also had a reluctant look on her face and didn’t want to separate from him.<br/><br/>With a stern face, Gu Yang said, “Do as you are told. I’ll come find you guys once I’m done with my business.”<br/><br/>“Alright.”<br/><br/>Xi Huang reluctantly agreed.<br/><br/>Blue Bird wanted to say something more, but Gu Yang had already flown away before it could. It flapped its wings as if to follow, but it gave up after flying just a short distance and came back, pouting.<br/><br/>All the while, it muttered to itself, “Master must be going to see his lover. He finds us annoying and ditches us when he sees color. How disloyal, tsk!”\t\t\t\t\t\t</div>", "images": {}, "success": true}