{"id": 262, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132126.html", "title": "Chapter 262 - Chapter 262: How To Deal When You Can’T Win? (Third Update, Asking For Monthly Tickets)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 262 - Chapter 262: How To Deal When You Can’T Win? (Third Update, Asking For Monthly Tickets)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 262: How to Deal When You Can’t Win? (Third update, asking for monthly tickets)<br/><br/>“Over there.”<br/><br/>Thousand miles away, in the sky, an elderly man dressed in green stopped. He took out a compass, quickly located his target, and transformed into a green ray of light, heading in that direction.<br/><br/>The elderly man was none other than the Master of Bitter Cold Mountain of the Ancient River Sword Sect.<br/><br/>His beloved grandson, Li Shang, was murdered on No Return Mountain on that day.<br/><br/>This grandson was the only one in the family who inherited his mantle, while the rest were disappointments. Thus, his death stirred an intense rage in him.<br/><br/>He had placed a special technique on his grandson that would curse anyone who dared to kill him.<br/><br/>This curse was extremely subtle, but it could last for a long time.<br/><br/>As long as the curse still existed, even if the murderer ran to the ends of the earth, the Master of Bitter Cold Mountain would be able to track him down.<br/><br/>Unbelievably, the murderer could transform into a phoenix. Before he could reach the culprit, he flew away and even he himself failed to catch him.<br/><br/>Later, he mobilized several connections and invited three of his fellow sect members to join in pursuit of the killer.<br/><br/>However, just as they were about to succeed, a member of the Water Moon Sect swooped in and saved their target. After that, the murderer vanished without a trace, and even the compass in his hand couldn’t locate him.<br/><br/>It was as if he no longer existed in this world.<br/><br/>But as of yesterday, the Master of Bitter Cold Mountain suddenly sensed his presence again and discovered the whereabouts of the scoundrel. He then borrowed the Profound Light Shield from his sister and started the pursuit.<br/><br/>He was no longer far away from the killer.<br/><br/>A distance of over a thousand miles, to a Nascent Soul cultivator, wasn’t far at all.<br/><br/>In no time, the Master of Bitter Cold Mountain had reached Worry-Free Mountain.<br/><br/>(“He is actually at Worry-Free Mountain.”)<br/><br/>A sense of solemnity crept through his features.<br/><br/>The Old Ancestor of Worry-Free Mountain was a giant of non-orthodoxy, at the late stage of the Nascent Soul. His cultivation level was one level higher than the master’s. Rumor has it, he possessed an extremely powerful magic treasure.<br/><br/>If a real fight were to break out, the master was not 100% confident that he would win.<br/><br/>The Master of Bitter Cold Mountain was only at mid-stage Nascent Soul, and he had only one Bitter Cold Sword and the Profound Light Shield. However, he wasn’t here to pick a fight with the Old Ancestor of Worry-Free Mountain.<br/><br/>Rushing into Worry-Free Mountain rashly might attract misunderstanding.<br/><br/>While he was hesitating, he saw a black light flashing from afar. That was clearly a Nascent Soul, being chased in panic.<br/><br/>The Master of Bitter Cold Mountain was stunned, quickly recognizing that the Nascent Soul was Master Yuanzhou, the first disciple of the Old Ancestor of Worry-Free Mountain, who was in the early stage of Nascent Soul.<br/><br/>“Who forced his Nascent Soul out of him?”<br/><br/>He was somewhat astonished as there seemed to be a huge change in Worry-Free Mountain.<br/><br/>A Nascent Soul was the strongest part of a Nascent Soul cultivator. When used to control a magic treasure, it could unleash unparalleled power.<br/><br/>At the same time, it was also the cultivator’s weakest point which could be fatally threatened by various things, such as the Thunder Technique, evil sect’s spirit tools that specifically damage Nascent Souls, and so on.<br/><br/>Once the Nascent Soul was forced out, it meant that the cultivator had been driven into a desperate situation.<br/><br/>Who on Worry-Free Mountain could force Yuanzhou into such a predicament?<br/><br/>At that moment, the Master of Bitter Cold Mountain felt his heart pounding. A<br/><br/>blade light that transcended spatial distance came hunting down, striking the Nascent Soul of Yuanzhou.<br/><br/>His Nascent Soul did not even have the chance to squeak before being wiped out by the blade light.<br/><br/>Only a pitch-black stick was left behind.<br/><br/>“Is it him?”<br/><br/>The Master of Bitter Cold Mountain’s heart jolted, and he couldn’t help but draw a cold breath.<br/><br/>He had pursued that man all over the world before and knew very well what the man was capable of. Seeing that blade light, he knew it must have come from him.<br/><br/>“He’s already at the middle Golden Core stage!”<br/><br/>Just a few months ago, that man was only at Foundation Establishment stage.<br/><br/>Now, he was already at the middle Golden Core stage. Such speed was simply inconceivable.<br/><br/>What’s more terrifying was that he managed to kill Yuanzhou, who was at the early Nascent Soul stage.<br/><br/>Although Yuanzhou was a non-orthodox cultivator who practised unique arts and was far from mainstreamisms, no matter how you put it, he was still a Nascent Soul cultivator.<br/><br/>And he was killed by a middle-stage Golden Core cultivator.<br/><br/>This was simply too mind-boggling.<br/><br/>At this moment, the figure he had been longing for, whom he deeply despised, appeared in the Master of Bitter Cold Mountain’s sight. The figure had taken away the magic treasure left by Yuanzhou.<br/><br/>The man looked at him and smiled instead of running away, “You’re finally here.”<br/><br/>A thunderous sound echoed as the Master of Bitter Cold Mountain unleashed the Profound Light Shield without hesitation. Black curtains instantly spread out, covering radius of hundreds of miles.<br/><br/>The Profound Light Shield was a defensive magic treasure, which ordinary magic treasures and flying swords could not cut through.<br/><br/>During a battle, if the Profound Light Shield was used to shield oneself, one would be in an invincible position.<br/><br/>However, he did the opposite, using the Profound Light Shield like a prohibition, spreading it to its maximum range. No matter how fast the youngster was, he could not be faster than the Profound Light Shield.<br/><br/>Yet, this time, he miscalculated, as the other party had no intention of running at all.<br/><br/>“There’s no escape this time,”<br/><br/>The Master of Bitter Cold Mountain said coldly, “Today, I’ll make sure you have no way to heaven and no door to earth.”<br/><br/>The Profound Light Shield had hedged in both of them, leaving no room for escape.<br/><br/>Gu Yang looked at the light curtain extending over a hundred miles and finally understood why he was killed in the simulation.<br/><br/>This magic treasure was quite interesting.<br/><br/>He couldn’t help asking, “Is it just because I killed one of your disciples? Isn’t it unnecessary for a Nascent Soul old monster like you to hunt me down?”<br/><br/>“He’s my grandson.”<br/><br/>Got it.<br/><br/>Without wasting any more words, Gu Yang launched the attack directly.<br/><br/>Master of Mount Avoid-Cold had already summoned his Avoid-Cold Sword and, using his life-long cultivation, transformed it into a sword like a rainbow, heading straight for Gu Yang.<br/><br/>In an instant, Gu Yang was left on the defensive.<br/><br/>For the first time in his life, he found himself at a disadvantage in a real battle.<br/><br/>He finally understood the strength of the cultivators in this world. A flying sword, maneuvering through complex arcs, each strike was aimed at his weakest point.<br/><br/>At this moment, the sword technique displayed by the Master of Mount Avoid-Cold was not inferior to those from the Great Zhou sword masters.<br/><br/>This was representative of his world’s cultivation power cap.<br/><br/>Gu Yang had no choice but to guard his gates, struggling to keep up.<br/><br/>Just as the battle was in full swing, Ye Lingbo and two others finally arrived.<br/><br/>“Middle stages of Nascent Soul?”<br/><br/>“Frost Sword Technique! Ancient River Sword Sect?”<br/><br/>Huang Yongkang and Jiang Chu’er exclaimed in surprise at the same time.<br/><br/>However, Ye Lingbo was watching very attentively, engrossed in the intricate swordplay between the two opponents.<br/><br/>The path of cultivation, in the end, leads to the same place.<br/><br/>The flying sword technique used by the Master of Mount Avoid-Cold embodied the essence of Martial Arts. Moreover, because it was a sword control technique, the form was more free, and the variations of the moves were more numerous.<br/><br/>Such a high-level battle was a rare opportunity to encounter.<br/><br/>Ye Lingbo watched with continuous amazement, clearly gaining a lot from the experience.<br/><br/>The other two, although they were at the same realm, couldn’t comprehend the battle and could only make out that Gu Yang was at a disadvantage.<br/><br/>At this time, Huang Yongkang couldn’t help but mutter to himself, what on earth was Elder Gu doing? Why wasn’t he using his full power?<br/><br/>In his view, Elder Gu couldn’t possibly be at the Golden Core stage, he must be a Nascent Soul in disguise.<br/><br/>Otherwise, how could he be so casual in slaying Nascent Souls?<br/><br/>Seeing Gu Yang under pressure, he couldn’t help but get nervous.<br/><br/>Gu Yang was almost out of breath being suppressed by the spinning flying sword. As the saying goes, prolonged defense ensured a defeat. He was certainly going to lose if this went on.<br/><br/>This battle was very frustrating. Martial artists were really at a disadvantage against sword cultivators.<br/><br/>After distancing himself from the enemy, the opponent could strike him down with a mere point of his finger,<br/><br/>yet, he could not even touch a hair of his enemy.<br/><br/>“What a great sword technique!”<br/><br/>He shouted, finally making his move. With a fierce blow, he knocked away the flying sword.<br/><br/>At that moment, two rays of light, one gold and one red, sped out from between his brows, heading straight for his opponent.<br/><br/>Just before, when Gu Yang had observed the Master of Mount Avoid-Cold’s aura, he had already withdrawn his two avatars.<br/><br/>The purpose was to surprise the enemy.<br/><br/>As expected, the Master of Mount Avoid-Cold was taken by surprise to see two divine beasts appear suddenly. He hastily withdrew his flying sword and merged with it, turning into a rainbow sword, quickly increasing the distance between them.<br/><br/>He had thoroughly investigated the details of how his grandson was killed that day. After replaying the event, he understood how his grandson died.<br/><br/>How on earth would he give Gu Yang a chance to engage in close combat?<br/><br/>As long as he maintained his distance, he would have absolute control.<br/><br/>This was the advantage of the cultivators. They could fight or flee as they wished, once they had enough distance from their enemies.<br/><br/>In this way, the two sides fell into a stalemate.<br/><br/>The Master of Mount Avoid-Cold was absolutely determined to escape, and the two divine beasts were really helpless against him.<br/><br/>After all, there was a difference of one entire realm and one smaller realm, the difference in strength was too great.<br/><br/>Gu Yang finally got a moment to breathe, but he didn’t make any move against the protective shield. Instead, he opened the Simulator. It wouldn’t be a mistake to make a prediction when the situation reached a deadlock, right?<br/><br/>[At the age of twenty-two, you are already at the second stratum of Mana. You and Ye Lingbo enter Water Moon Heavenly Cave. On Mount Forgetting Worries, you slayed seven disciples of Elder Forgetting Worries.]<br/><br/>[Later, you were blocked by the Master of Mount Avoid-Cold, from the Ancient River Sword Sect. After a fierce battle that lasted for two days and nights, Elder Forgetting Worries appeared suddenly and killed you. You passed away at the age of twenty-two.]<br/><br/>This battle actually goes on for two days and nights.<br/><br/>Gu Yang was shocked at heart. Doesn’t this make his title, Gu One Saber, sound like a joke?<br/><br/>Plainly put, he and the Master of Mount Avoid-Cold were of equal strength.<br/><br/>Had Elder Forgetting Worries not appeared, they would have kept on fighting indefinitely.<br/><br/>[Simulation ends, you can keep one of the following.]<br/><br/>[One, twenty-two-year-old Martial arts realm.]<br/><br/>[Two, twenty-two-year-old Martial arts experience.]<br/><br/>[Three, twenty-two-year-old life wisdom.]<br/><br/>“I choose two.”<br/><br/>In an instant, Gu Yang’s mind filled with the experience of the battle with the Master of Mount Avoid-Cold.<br/><br/>Suddenly, he felt a greater likelihood of victory.<br/><br/>This meant that he was already familiar with the opponent’s moves, while the opponent did not know much about him.<br/><br/>This alone was a huge advantage.<br/><br/>If used correctly, it could give him a great surprise.<br/><br/>However, it was still not enough.<br/><br/>Gu Yang started the simulation once again.<br/><br/>[… You make a full-blown attack, break the prohibition on the mysterious light shield, turn into a phoenix, and escape with Ye Lingbo and the others. At the cost of losing two avatars, you finally get away with your life.]<br/><br/>[You leave the Water Moon Heavenly Cave and return to the College. You hide in the palace to cultivate with undivided attention.]<br/><br/>[From the sixth Nine States Seal, you obtain the “Divine Candle Technique” and master the first level.]<br/><br/>[You accidentally discover that the Wood God Ding can neutralize the poison on the poison rod, so you plant it in God Ding…]<br/><br/>PS: Third update, request for monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}