{"id": 264, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132130.html", "title": "Chapter 264 - Chapter 264: 264 Sky Ruins", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 264 - Chapter 264: 264 Sky Ruins</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 264: 264 Sky Ruins<br/><br/>Ancient Sword Mountain, within the Ancestral Hall, a sudden mournful clash of swords echoed.<br/><br/>Instantly, every disciple of the Ancient River Sword Sect felt their swords quiver.<br/><br/>“The united cry of ten thousand swords! Which peak master has died?”<br/><br/>“My God, a catastrophic event is about to happen?”<br/><br/>“Our nine peak masters are all in their prime. How could one of them suddenly die? Could it be…”<br/><br/>“No matter who it is, anyone who dares to kill the peak master of our Ancient River Sword Sect is destined to die!”<br/><br/>It was not only the regular disciples who were agitated. In the Ancestral Hall, peak masters from every faction gathered, and sitting at the primary position was the sect leader of the Ancient River Sword Sect.<br/><br/>The sorrowful cry had come from the sword representing Bihant Peak.<br/><br/>A peak master, a cultivator at the Nascent Soul stage, had been murdered. When was the last time such a thing happened?<br/><br/>The Ancient River Sword Sect’s high-ranking members were all furious.<br/><br/>Director of Moon Rainbow Peak, who had the best relationship with the Bihant Peak master, reacted the most vehemently.<br/><br/>She could not believe that her elder martial brother, who had borrowed the Xuan Light Shield from her just the day before, had died. She was overwhelmed with grief.<br/><br/>She and the Bihant Peak master were close martial siblings, having shared the same master, and they had an extraordinary bond.<br/><br/>She revealed the matter of her martial brother borrowing the Xuan Light Shield.<br/><br/>The several peak masters fell silent at once.<br/><br/>It was clear that they all guessed why the Bihant Peak master had borrowed the Xuan Light Shield.<br/><br/>Last time, it was a member of the Water Moon Sect who had shielded them.<br/><br/>This time, could it have been the same person who killed the master of Bihant Peak?<br/><br/>At this moment, the sect leader spoke, “Investigate who killed Brother Li.”<br/><br/>His gaze swept over several people, and he said sternly, “No matter who the culprit is, we, the Ancient River Sword Sect, will surely avenge this blood feud.”<br/><br/>“Yes, Sect Leader.”<br/><br/>The peak masters left to carry out their commands.<br/><br/>Only the sect leader remained, his gaze lingering on the ancestral figures enshrined in the hall. His eyes deepened as he said, “Fu Mingyi, what on earth have you been planning these hundreds of years? Allowing the three sects to grow…”<br/><br/>The Ancestral Hall fell into silence, with no reply.<br/><br/>One day later, in Yangzhou City, Tang Empire.<br/><br/>This bustling city housed an elegant courtyard where Jiang Chu’er knocked on a gate.<br/><br/>“Come in.”<br/><br/>From inside, Gu Yang’s voice emanated.<br/><br/>Yesterday, they flew more than two thousand miles in one breath and reached this city. This courtyard was one of Jiang Chu’er’s hideouts, and they decided to stay here for now.<br/><br/>As the saying goes, ‘hide a tree in the forest’. This was a good way to evade the pursuit of the Ancient River Sword Sect.<br/><br/>Huang Yongkang reminded him of this.<br/><br/>After Jiang Chu’er entered the room, she gave a bow, “Greetings, senior.”<br/><br/>“Here is the cultivation technique you asked for.”<br/><br/>Gu Yang passed her a book, a hand-copied version of the “Divine Candle Technique”. Having promised her, he wasn’t one to go back on his word.<br/><br/>Jiang Chu’er took the book, overwhelmed with excitement, she gave a bow, “Thank you, senior.”<br/><br/>Gu Yang reminded her, “Actually, this technique is extraordinary and requires the essence blood of the Candle Dragon. Without the essence blood, no matter how hard you practice, you will not achieve any results.”<br/><br/>After hearing this, Jiang Chu’er’s expression changed. After a moment, she murmured with a bitter smile, “Looks like, when our ancestor went to those ruins all those years ago, he was most likely after the Candle Dragon’s essence blood.”<br/><br/>“Oh?”<br/><br/>Upon hearing this, Gu Yang became interested. He was quite curious about the ancestor from the Jiang Family who had reached the sixth level of the “Divine Candle Technique.”<br/><br/>No ordinary person could get the “Divine Candle Technique” from JiuZhou and integrate it into his Golden Core – the sixth realm.<br/><br/>This technique required the essence blood of the sacred beast as an aid. This meant that he had access to the essence blood of the Candle Dragon.<br/><br/>He asked, “Tell me more.”<br/><br/>Jiang Chu’er focused and replied, “Our ancestor went exploring a certain ruin and never returned. Actually, before leaving, he had stated that the journey was highly dangerous and that there were no guarantees of a return. However, it was his only hope of entering the Nascent Soul stage, hence he had no choice.”<br/><br/>“Do you know where those ruins are?”<br/><br/>“The Sky Ruins!” Jiang Chu’er’s tone was somewhat solemn, “Rumored to be the battlefield of ancient immortals, it’s extremely dangerous. Even an ancient Nascent Soul may not come out unscathed if they enter.”<br/><br/>“But there, ancient immortal’s Magic Treasures and even their cultivation techniques are left behind.”<br/><br/>“It is said that apart from the Water Moon Sect, the founders of the other three sects all received the inheritance and Magic Treasures from immortals in the Sky Ruins, enabling them to reach the Spirit Dividing Stage, establish their own sects, and compete with the Water Moon Sect.”<br/><br/>It sounded like a very dangerous place.<br/><br/>Gu Yang asked a few more questions, then let her go.<br/><br/>“Sky Ruins…”<br/><br/>He pondered for a moment, opened the system, and saw that his balance was 425 points, a substantial amount.<br/><br/>Not counting the four Magic Treasures, which were incredibly precious. Even in the Water Moon Sect, only those at Nascent Soul stage were able to own them.<br/><br/>It would be a waste to use them for recharging.<br/><br/>Especially something like the Dark Light Shield, a protective Magic Treasure which he had never seen before.<br/><br/>If the master of Cold Repelling Mountain used it for defense instead of trapping people, it would have been very difficult for him to kill him.<br/><br/>A knock knock noise sounded as Huang Yongkang arrived, saying, “Senior, you were looking for me?”<br/><br/>Without beating around the bush, Gu Yang handed over a magical tool to him and said, “This is for you.”<br/><br/>“You are too kind, senior…”<br/><br/>“This is rightfully yours. I will be leaving. You must take care of yourself,” Gu Yang finished, not lingering, and directly took Ye Lingbo with him to leave.<br/><br/>Leaving Huang Yongkang standing alone in the yard, feeling somewhat gloomy.<br/><br/>He was originally thinking about asking to become his disciple. Unexpectedly, Gu had not given him a chance at all.<br/><br/>Changing his thought, he thinked, “In any case, I have already taken him as my master in my heart.” He instantly felt better and started playing with the magical tool.<br/><br/>“This master is much more generous than the old man.”<br/><br/>Are we leaving?”<br/><br/>Ye Lingbo was a bit confused, not understanding what Gu Yang wanted to do entering the Water Moon Sect, was it all just to kill a few people on Forgetful Mountain?<br/><br/>Such behavior was truly baffling.<br/><br/>However, she didn’t ask too many questions.<br/><br/>One thing she was sure, Gu Yang killing the Nascent Soul Cultivator of Ancient River Sword Sect, they would definitely not let it go easily.<br/><br/>And that Forgetful Mountain Old Ancestor whose place was taken, how could he endure?<br/><br/>Gu Yang’s strength was not yet strong enough to compete with a Cultivator in the late stage of Nascent Soul.<br/><br/>In the entire Water Moon Sect, they no longer had a place to stay. If they didn’t leave now, it would be hard to get away later.<br/><br/>“Hmm.”<br/><br/>Gu Yang nodded.<br/><br/>Last night, he had simulated once, knowing the end of staying in Water Moon Sect would be very miserable. Ultimately, he started a war with Celestial Beings, almost destroying the Water Moon Sect. He also died in that fight.<br/><br/>It is a day later, still have a little time.<br/><br/>Half a day later, Gu Yang and Ye Lingbo returned to the outer area of Huang Family Town, to that broken temple.<br/><br/>The space passage has disappeared, and the stele has turned into powder.<br/><br/>Gu Yang thought that the entrance of this space channel here was definitely not a coincidence. Especially when a mysterious space hiding nine divine cauldrons and a spiritual treasure appeared, it further confirmed his guess.<br/><br/>Too many secrets were hidden in Ye Lingbo. Although she is nice, who knows whether she can keep her true self after her past wisdom awakened.<br/><br/>Seeing her about to open the entrance of the cave, Gu Yang said, “Wait a moment.”<br/><br/>He opened the system and decided to give it a try.<br/><br/>[Use Simulation? One use consumes twenty points of energy.]<br/><br/>“Yes.”<br/><br/>[…you and Ye Lingbo go to Sky Ruins together. At the entrance of Sky Ruins, you meet the five Nascent Soul cultivators of Ancient River Sword Sect. You narrowly escaped into Sky Ruins.]<br/><br/>[The cultivators of Ancient River Sword Sect chased into Sky Ruins, and a Celestial Being blocked them, followed by three more Celestial Beings attacking that Celestial Being.]<br/><br/>[In the chaos of the battle, an ancient prohibition was broken, and an ancient god escaped from it. With one bite, a Celestial Being was swallowed. The rest fled in a panic.]<br/><br/>[You and Ye Lingbo luckily escaped, but a few days later, you got caught in a spatial vortex and disappeared.]<br/><br/>[You died, age twenty-two.]<br/><br/>Are the people from Ancient River Sword Sect crazy? He escaped to Sky Ruins, and they still have to chase him?<br/><br/>Thinking about it, Gu Yang felt it was wrong, their target should be that Celestial Being.\t\t\t\t\t\t</div>", "images": {}, "success": true}