{"id": 261, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132124.html", "title": "Chapter 261 - Chapter 261: 261 Kill The Nascent Soul", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 261 - Chapter 261: 261 Kill The Nascent Soul</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 261: 261 Kill the Nascent Soul<br/><br/>This was the sixth Nine Provinces Seal that Gu Yang had obtained. If he could get his hands on Old Gao’s, that would make seven.<br/><br/>The whereabouts of the other two were still unknown.<br/><br/>The deeper Gu Yang delved into the practice of the “Nine Heavens Divine Method”, the more extraordinary he realized the Xia Emperor was.<br/><br/>Even though he had the Simulator, which allowed him to continuously exploit BUGs, and had spent such a long time in cultivation, he had only managed to cultivate two incarnations. He wondered when he would finally be able to assemble the nine incarnations.<br/><br/>As for how the Xia Emperor had done it, he had no idea.<br/><br/>After stowing away the Nine Provinces Seal, he looked at the two Golden Core cultivators. From just a glance, he knew they were no strangers to murder. Their murderous auras were strong and palpable.<br/><br/>They might not have been as monstrous as the cultivator before, but they were equally, if not more, deserving of death.<br/><br/>These deviants in the wrong path could be compared to demons in the eyes of ordinary people. To refine their Magic Tools, they would kill without hesitation and even tortured their victims before killing them, just for the sake of obtaining vengeful spirits and Yin Qi.<br/><br/>He had encountered three Golden Core stage cultivators, each with hundreds or even thousands of lives on their hands.<br/><br/>It was utterly horrifying.<br/><br/>In contrast, those in the Righteous Path like the Ancient River Sword Sect, though they went about their business in an overbearing manner and disregarded the principles of martial arts, at least they didn’t kill innocently.<br/><br/>Looking at the man and woman before him, a chill filled Gu Yang’s gaze as he said, “You two may call for help now.”<br/><br/>At that moment, Red Silk and Dai Zichu found that they could move again.<br/><br/>Whoosh!<br/><br/>In the blink of an eye, Red Silk turned into a green rainbow and shot off, her Sword Qi piercing straight to the heavens, and amazingly, she had even brought out a Magic Treasure.<br/><br/>Even Gu Yang was somewhat surprised. It seemed that the Forgetful Ancestor indeed had some good items, and he was even willing to give one of his Magic Treasures to this granddaughter of his.<br/><br/>Even the true disciple of the Ancient River Sword Sect didn’t have a Magic Treasure.<br/><br/>A red shadow shot out from Gu Yang’s brow and pursued Red Silk.<br/><br/>On the other side, Dai Zichu lofted his hand and a dazzling light exploded in the sky. He looked somewhat fearsome.<br/><br/>He knew all too well that there was no chance of escaping from such a powerful individual, especially given that he didn’t have a Magic Treasure like Red Silk did.<br/><br/>It was clear that this powerful figure intended to take advantage of the absence of their master to wipe out the Forgetful Mountain. Yet he didn’t hesitate to call for help.<br/><br/>Why should he be the only one to die?<br/><br/>If they were going to die, they would all die together!<br/><br/>After sending out the distress signal, Dai Zichu summoned his Spirit Tool and desperately attacked the enemy.<br/><br/>The entire Forgetful Mountain saw the distress signal rising from the rear mountain.<br/><br/>Immediately, four rays of escape light flew towards the rear mountain. These four were the four disciples of the Forgetful Ancestor.<br/><br/>The one at the forefront was the eldest disciple, Yuanzhou. From a distance, he could already see a heated battle taking place on the rear mountain, “Daring to cause trouble on Forgetful Mountain, they really seek death.”<br/><br/>In his sense, the intruder was just at the Golden Core stage. Although he had decent strength, capable of holding off his third junior sister and fourth junior brother single-handedly.<br/><br/>But to actually dare cause trouble on Forgetful Mountain with such strength, he didn’t even take him into consideration.<br/><br/>Before Yuanzhou even arrived, his Magic Treasure was already unleashed.<br/><br/>It was a black wooden stick, enveloped in a poisonous mist. It was undoubtedly a malicious Magic Treasure.<br/><br/>“You are finally here.”<br/><br/>Just then, a voice filled with joy echoed.<br/><br/>The tone was as if they had been eagerly awaited.<br/><br/>For some unknown reason, Yuanzhou’s heart thumped. He had an extremely ominous premonition.<br/><br/>The three junior brothers following behind him all paused their escape light, sensing something wrong.<br/><br/>Those who could distinguish themselves in a sect like the Forgetful Mountain, to become disciples of the Forgetful Ancestor, were all very sharp.<br/><br/>Those who weren’t sharp, even if highly talented, would have been schemed to death long ago.<br/><br/>They had an extraordinary instinct for danger. As soon as they noticed something was amiss, they were prepared to withdraw immediately.<br/><br/>But, it was already too late!<br/><br/>A huge golden shadow lunged at the three cultivators at the back. With one roll, it was already right in front of them.<br/><br/>A monster beast?<br/><br/>The three Golden Core cultivators reacted instantaneously, simultaneously summoning their Spirit Tools.<br/><br/>A knife, a canopy, and a banner.<br/><br/>The three Spirit Tools flew all at once towards the beast.<br/><br/>Amidst the sounds of thuds, the three Spirit Tools landed solidly on the beast.<br/><br/>All three cultivators’ faces lit up with joy. The beast didn’t even try to avoid their Spirit Tools, it was now either dead or seriously injured.<br/><br/>The magic tools of Mount Worry-Free were best at contaminating other magic tools and the mortal body, even the slightest touch could strip someone of their skin, if not kill them.<br/><br/>In the next instant, their smiles froze on their faces.<br/><br/>Those three spirit tools were unexpectedly bounced away, leaving only three black marks on the monster beast.<br/><br/>How could this be possible?<br/><br/>In their surprise, a big hand had already reached out and smashed them into pulp.<br/><br/>Sadly, three evil cultivators who had been running rampant in the Water Moon Cave for years, lost their lives in such a muddled way.<br/><br/>On the other side, Dai Zichu’s head exploded immediately, taking a step ahead of those three brothers.<br/><br/>Gu Yang kept him around to attract reinforcements. This was a strategy, the wisdom of ancient warfare.<br/><br/>The remaining disciples indeed fell for the trap.<br/><br/>Only one disciple of Mount Worry-Free did not arrive.<br/><br/>In this round, he wiped out four of them.<br/><br/>[Ten energy points acquired, current balance is sixty-eight points.]<br/><br/>[Twenty energy points acquired, current balance is eighty-eight points.]<br/><br/>[Twenty energy points acquired, current balance is one hundred and eight points.]<br/><br/>[Thirty energy points acquired, current balance is one hundred and thirty-eight points.]<br/><br/>Four consecutive notifications appeared which quickly restored his balance over one hundred points.<br/><br/>Now, only the most troublesome disciple of Mount Worry-Free’s Old Master was left. This man was at the Unleaking Realm of cultivation and absolutely not to be underestimated.<br/><br/>When Gu Yang saw the man using a magic treasure, he understood why he would get injured in the simulation.<br/><br/>The Unleaking Realm, combined with a Life Essence Magic Treasure, is not so easily killed.<br/><br/>With a magic treasure, the cultivator’s biggest weakness is made up for. In close combat, with the protection of the magic treasure, they won’t be easily assassinated by martial artists.<br/><br/>This battle was all about raw power, there were no tricks.<br/><br/>Gu Yang held the Phoenix Feather Knife, merging man and knife into one, cutting off the black stick and rushing towards the enemy.<br/><br/>When Yuanzhou saw his four disciples instantly killed, he was shocked but not flustered. Then, seeing his opponent’s knife split open his magic treasure, and the poisonous mist was blocked outside, he knew he had met a formidable opponent he has never encountered before.<br/><br/>This magic treasure was something he acquired by chance. It was humble and was originally only useful for hitting people.<br/><br/>He spent two hundred years collecting the deadliest poisons from all over the world to refine it into a poisonous stick. It could break through anyone’s mana and Original Spirit.<br/><br/>At this moment, seeing that the opponent’s mana was not afraid of the poison on the stick, the magic treasure that used to be unbeatable for the first time took a hit. Making him even more alert.<br/><br/>Right after that, Yuanzhou saw the young man charging straight at him. He was unused to this way of fighting and subconsciously wanted to move away.<br/><br/>Suddenly, the two of them commenced a chase on Mount Worry-Free, with one chasing and the other fleeing.<br/><br/>Jiang Chu’er and Huang Yongkang on the side were dumbfounded.<br/><br/>A cultivator who seemed to be at the Golden Core stage was actually chasing an old Nascent Soul beast to fight.<br/><br/>This was too fierce.<br/><br/>On the side, Ye Lingbo collected all the magical tools left behind by the four corpses. She could tell that Gu Yang needed these things very much.<br/><br/>Huang Yongkang’s attention was immediately attracted. Seeing the magic tools in front of him but unable to snatch them was really frustrating.<br/><br/>His gaze inadvertently collided with Ye Lingbo’s, making him feel a chill in his heart.<br/><br/>For some reason, even though their cultivation levels were the same, he felt a sense of fear towards this woman.<br/><br/>At that moment, the giant ape roared and joined the battle.<br/><br/>Yuanzhou was fighting two opponents at once, and was immediately becoming overwhelmed.<br/><br/>The golden giant ape didn’t fear the poison on the poison stick. His greatest skill had lost its effect and was being suppressed everywhere.<br/><br/>He was incredibly frustrated. Even though he had a lot of tricks up his sleeve, he was almost out of breath under the pressure of a man and a beast and couldn’t display his real power.<br/><br/>Most importantly, he had never encountered this kind of close hand-to-hand combat. For the time being, he was unable to shake off his opponents.<br/><br/>Right at that moment, a red shadow flew over, opened its mouth, and spewed out a flame that engulfed him completely.<br/><br/>There was a crackling sound, and a couple of his shields shattered instantly. Scared out of his wits, he quickly put his magic treasure back inside his body to protect his Nascent Soul.<br/><br/>The next moment, a blade cut across his neck, severing his head.<br/><br/>Poor him, a great Nascent Soul cultivator, a figure that could cause the ground to shudder with a stomp in the Water Moon Cave, under this thug-like fighting style, his mortal body was destroyed.<br/><br/>The only thing that was left was a chubby little man holding a black stick, who fled in a hurry.\t\t\t\t\t\t</div>", "images": {}, "success": true}