{"id": 268, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132138.html", "title": "Chapter 268 - Chapter 268: 268 Four Questions (Third Update Seeking Monthly Pass)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 268 - Chapter 268: 268 Four Questions (Third Update Seeking Monthly Pass)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 268: 268 Four Questions (Third Update Seeking Monthly Pass)<br/><br/>After the form of a Divine Beast in the Mana realm was thrown into the divine cauldron and absorbed, there was no apparent change on the withered corpse. It continued to appear as if it might collapse at any moment.<br/><br/>From its hollow eye sockets, the faint light points shrunk to the size of a needle tip, and it said, “Of course, I was killed.”<br/><br/>Gu Yang was not satisfied with this answer, “That’s all you can say?”<br/><br/>The corpse replied, “That question is void, you can ask another one.”<br/><br/>Gu Yang was a bit curious, does it not know or can’t it say?<br/><br/>This question was of great interest to him, he wanted to know exactly what had happened in this world.<br/><br/>After all, it concerned his future path.<br/><br/>He was already at the Mana realm, in no time, he would reach the Unleaking realm.<br/><br/>Once he reached the Unleaking Realm, wouldn’t that mean the Celestial Being realm was within reach?<br/><br/>According to Ye Lingbo, because the Way of Heaven in this world had perished, no one in this world could break through to the Celestial Being realm.<br/><br/>Then, after breaking through to the Celestial Being realm in the Pocket Dimension, how could he further break through to the higher Hollow Void realm?<br/><br/>All of this, was likely related to the Way of Heaven.<br/><br/>Gu Yang had originally wanted to figure this out.<br/><br/>However, the body was unwilling to tell him anything.<br/><br/>If that’s the case, then he simply changed his question, “I want to know, how to reach the Hollow Void realm?”<br/><br/>The corpse said, “When your ‘Nine Heavens Divine Method’ has cultivated all nine Divine Beasts to the ninth level, naturally you’ll be able to break through to Hollow Void realm. Or, if you can obtain more pure Essence Blood of the Phoenix, and awaken the bloodline inheritance of the Phoenix, with the passage of time, one day, you can reach the Hollow Void realm.”<br/><br/>Both paths were far from easy.<br/><br/>He hadn’t even collected all the seals of Kyushu yet, let alone cultivate all nine Divine Beasts to the ninth level. How many times would he need to do simulation cultivation?<br/><br/>As for the Pure Essence Blood of the Phoenix, if he understood correctly, it should be as difficult as obtaining the blood contained within the gallbladder of a Phoenix.<br/><br/>Gu Yang asked, “What if I practice another technique?”<br/><br/>The corpse replied, “That’s the second question.”<br/><br/>Gu Yang thought for a while, but decided not to waste his precious chance on this. Since he had reached such a realm, he definitely wouldn’t change to another practice.<br/><br/>“Second question, where can I get the Essence Blood of the Divine Beasts that I need?”<br/><br/>A White Tiger form emerged from the middle of Gu Yang’s brows, falling into the giant cauldron.<br/><br/>A glimmer of faint white light emerged from the giant cauldron, but it soon vanished.<br/><br/>The corpse said, “Are you sure you want to know? The Xia child died tragically because he opened the passage to Red-bright Heaven in his pursuit of Taiyin Youying’s Essence Blood.”<br/><br/>Taiyin Youying, in the Red-bright Heaven.<br/><br/>Upon receiving this vital piece of information, Gu Yang was delighted.<br/><br/>Although he hadn’t obtained the practice of Taiyin Youying yet, knowing where to get the Essence Blood was already a boon. When the day came that he had enough power, he could certainly break into the Red-bright Heaven and secure the Essence Blood.<br/><br/>Just as he was pondering over this, a flash of insight struck him as if a bolt of lightning.<br/><br/>Since the Red-bright Heaven was intentionally opened by the Xia Emperor, weren’t the other three in the Four Great Sacred Lands the same?<br/><br/>Furthermore, there is a high probability that each of the worlds within the Four Great Sacred Lands contains the Essence Blood of a Divine Beast.<br/><br/>It must be!<br/><br/>Saint Chaoyang of the Three Saint Sects acknowledged the Phoenix as his master, so there is likely to be Essence Blood left by the Phoenix within.<br/><br/>Guided by this reasoning, it is likely that the other two Sacred Lands, Blue Sky Palace and Star Sea, also harbor the Essence Blood of a Divine Beast.<br/><br/>After Gu Yang came to this realization, he was overjoyed.<br/><br/>It was like using one question to obtain four answers.<br/><br/>I am truly smart.<br/><br/>He gave himself a pat on the back.<br/><br/>Yet, Gu Yang’s face remained expressionless, he said, “The path of cultivation is full of thorns at every step. I’m not afraid of any danger.”<br/><br/>“Very well. In the East Sea, there is a Penglai Heaven, the kingdom of the Monster Race. The remains of the ancient Divine Beast Black Tortoise are in the Demon God Valley. Since you have now refined the true body of the Phoenix, you can perfectly impersonate the Monster Race. As long as your disguise doesn’t fail, you’ll have a chance to obtain the Essence Blood of the Black Tortoise.”<br/><br/>As he said this, he even shared with him the detailed method to enter Penglai Heaven.<br/><br/>Penglai Heaven, Demon God Valley!<br/><br/>Gu Yang noted it down.<br/><br/>However, there’s one prerequisite to open the entrance to Penglai Heaven, you must reach the Unleaking Realm. Only then will you possess enough power to break the ancient prohibition.<br/><br/>“The third question, the weakness of Saint Chao Yang.”<br/><br/>As Gu Yang spoke, a divine ape apparition, flew out from his forehead and fell into the giant cauldron.<br/><br/>The giant cauldron lit up with a golden hue.<br/><br/>The skeleton spoke, “She is already nearing the Hollow Void Realm, she just can’t break through because she’s limited by this world. Even if I gave you a Spirit-treasure Flying Sword, you still couldn’t defeat her. Stay in the palace, do not leave, only then can you ensure your safety.”<br/><br/>“When you reach the Celestial Being Realm someday, she will be beneath your notice. You will be her weak point.”<br/><br/>Gu Yang felt a bit ripped off, how was this any different from not having an answer?<br/><br/>However, he had benefitted from the previous question. When weighed together, it seemed he had neither lost out nor gained anything.<br/><br/>“The fourth question, how to heal the Dean of the Literature Institute?”<br/><br/>From Gu Yang’s brow, a phoenix apparition flew out and descended into the giant cauldron.<br/><br/>The Dean of the Literature Institute was the most influential person he was able to ask for help. As long as this person existed, there was no need to worry about problems from his enemy in Alight Heaven.<br/><br/>Including Luo Wang, with these two, whether it was the Three Saints Gate, Alight Heaven, or Star Luo Sect in the future, none could easily attack Divine City.<br/><br/>The situation of the whole world would be entirely different.<br/><br/>That was why he was willing to use a precious question for this.<br/><br/>The desiccated corpse said, “Within the land of Paradise Heaven, there exists a millennium-aged Green Lotus; taking one of its seeds could fully heal his injuries.”<br/><br/>Gu Yang asked, “And where is Paradise Heaven?”<br/><br/>At this time, Su Ningyan at the side interjected, “That’s the name of the world where the Three Saints Gate is located.”<br/><br/>Understanding dawned on Gu Yang. So, that’s how it was.<br/><br/>The desiccated corpse said, “That’s it for today; it’s always good to see fresh faces.” After finishing its speech, it burrowed into the ground and disappeared.<br/><br/>Gu Yang and Su Ningyan didn’t breathe easy until they left the underground and returned to the surface, resealing the well behind them.<br/><br/>Confronting such an inscrutable character was too stressful.<br/><br/>Gu Yang asked in a quiet voice, “Who exactly is that person, really?”<br/><br/>Su Ningyan shook her head, “I do not know either, but according to our ancestors, this person has quite likely been deep underground since the time of the Xia Dynasty. As for how long he has stayed underground, nobody knows.”<br/><br/>In essence, a mysterious old creature who has lived for an unknown number of years and knows countless secrets.<br/><br/>Gu Yang remembered the mysterious old man he had met at Dragon Gate Island and in the Yellow Springs. Perhaps he knew something about the mysterious person underground.<br/><br/>If they met again in the future, he may as well ask.<br/><br/>His impression of the old man was quite favorable; every time they met, he had been of service and had never treated him unfairly.<br/><br/>On the other hand, the underground creature seemed very sinister and didn’t resemble a good person at all.<br/><br/>At this point, Su Ningyan finally couldn’t hold back and said, “You lost four divine beast apparitions, the cost you paid was too high.”<br/><br/>“It doesn’t matter, I can cultivate them back quickly.”<br/><br/>Gu Yang said nonchalantly.<br/><br/>If it hadn’t been for the concern of annoying that creature underground, he would have been able to restore his four divine beast apparitions while underground.<br/><br/>Just before entering the palace, he had completed a simulation, and the reward hadn’t been claimed yet.<br/><br/>After leaving the underground suite arranged for him by Su Ningyan, Gu Yang opened the system.<br/><br/>[Simulation Over, you can choose to keep one of the following.]<br/><br/>[One, your Martial Arts realm at the age of thirty-six.]<br/><br/>[Two, your Martial Arts experience at the age of thirty-six.]<br/><br/>[Three, your life wisdom at the age of thirty-six.]<br/><br/>“I pick number one.”<br/><br/>In an instant, Gu Yang felt the essence of the four divine beast apparitions rushing back to him.<br/><br/>That was why he was willing to exchange divine beast apparitions for the chance to ask questions.<br/><br/>He was not a fool; why would he exchange divine beast apparitions that he had spent so much time cultivating, just for a few answers?\t\t\t\t\t\t</div>", "images": {}, "success": true}