{"id": 263, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132127.html", "title": "Chapter 263 - Chapter 263: 263 Great Harvest", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 263 - Chapter 263: 263 Great Harvest</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 263: 263 Great Harvest<br/><br/>[…After cleansing the toxins, the stick sprouted roots and leaves. It was revived.]<br/><br/>[…Ten years later, the tree only grew an inch high. In the same year, Qin Wu raised his troops to fight Zhou…]<br/><br/>[…He was 36 years old all year round.]<br/><br/>The black stick?<br/><br/>Gu Yang found an additional description of the stick in the simulation, and found it strange.<br/><br/>Could this thing be special?<br/><br/>Speaking of which, this unmatched divine weapon is indeed odd.<br/><br/>It was his first time seeing such a rudimentary divine weapon; it was nothing more than raw material.<br/><br/>A mere stick could actually be forged into a divine weapon.<br/><br/>Unfortunately, he exterminated the Unleaking Realm, both the person and their Nascent Soul, so there was no one to ask about it.<br/><br/>Honestly, he didn’t manage to do it in time, otherwise, it would have been recharged at the drop of a hat.<br/><br/>He was not willing to keep such a manifestly evil thing around him.<br/><br/>Now, however, he felt it was worth holding onto temporarily.<br/><br/>In this battle, he gained a great deal of energy and temporarily wasn’t lacking.<br/><br/>Just now, when he killed the phoenix-transformed female disciple, he gained thirty energy points and returned with a Magic Treasure and several Spirit Tools,<br/><br/>With the addition of the Unleaking Realm, he gained another hundred points.<br/><br/>At present, after deducting the costs of two simulations, his account balance was two hundred and twenty-eight points.<br/><br/>He hadn’t managed to recharge the rest of the Magic Treasures, Spirit Tools, and so forth.<br/><br/>This time, he could say he had made a hefty windfall.<br/><br/>[The simulation has ended, you can keep one of the following items.]<br/><br/>“I choose one.”<br/><br/>Instantly, a large amount of True Essence appeared out of nowhere within Gu Yang, and at the same time, he obtained a new kind of power.<br/><br/>“So it’s the Candle Dragon!”<br/><br/>The technique within this Nine States Seal was the “Divine Candle Technique”, and the corresponding Divine Beast was the Candle Dragon, which slept to plunge the world into night, was awake in the daytime, and could light up even the deepest abyss.<br/><br/>However, only having the first level wasn’t of much use.<br/><br/>“Continue.”<br/><br/>Gu Yang didn’t pause for a moment, initiating the third simulation.<br/><br/>Not far away, Lord Bihan calmly fused his body and sword into one, dealing with the two Divine Beasts, avoiding a head-on confrontation with them.<br/><br/>Although these two Divine Beasts were only in the Golden Core stage, their mortal bodies were astonishingly strong. It would still require a significant effort to kill them.<br/><br/>What terrified him the most, however, was Gu Yang lurking on the side. The boy was cunning and had myriad tactics up his sleeve. One careless move could flip the boat in the gutter.<br/><br/>He would rather be cautious and not give the youngster an opportunity to exploit.<br/><br/>Even though his Cultivation Level was higher, he could exhaust his opponent to death.<br/><br/>That’s why the scene of two Golden Core stage Divine Beasts chasing an Nascent Soul stage Cultivator to fight occurred.<br/><br/>“Hm?”<br/><br/>Lord Bihan, who was dealing with the two Divine Beasts, was actually devoting half of his attention to Gu Yang. Suddenly, he detected the boy’s climbing momentum.<br/><br/>His Mana strangely grew a lot.<br/><br/>“What’s going on?”<br/><br/>He was somewhat shocked.<br/><br/>“Could it be that he has consumed some sort of elixir that enhances his strength in a short time?”<br/><br/>He couldn’t help but increase his vigilance, suspecting that the youngster might be ready to stake everything.<br/><br/>However, the boy showed no signs of planning on risking everything, nor did he attempt to break the Mystic Light Shield. He floated in place, immobile.<br/><br/>“What on earth is he up to?”<br/><br/>Lord Bihan had a bad feeling about this. It was too unusual.<br/><br/>Despite all his contingency plans, he had never anticipated this situation. It felt as if Gu Yang was standing there, waiting for death.<br/><br/>Suddenly, the boy’s aura surged again, and his Mana rose sharply.<br/><br/>“What… what’s happening?”<br/><br/>He was taken aback. His Mana was mysteriously boosted for the second time. This was too strange.<br/><br/>Then the third time, the fourth time…<br/><br/>The unease in Lord Bihan’s heart grew.<br/><br/>By the seventh time, his unease had turned into dread.<br/><br/>Even though he was experienced and knowledgeable, he had never encountered such a thing.<br/><br/>In such a short time, the boy’s cultivation had increased by at least a sixty-years’ cycle.<br/><br/>With this rate of growth, it wouldn’t take long for him to break through to the late stages of Golden Core cultivation.<br/><br/>“This can’t go on!”<br/><br/>Lord Bihan could no longer remain calm. He swiftly turned and, with a bright Sword Light, flew towards Gu Yang.<br/><br/>If he did not make a move now, he would not have the chance to do so soon.<br/><br/>This was when Gu Yang opened his eyes, a hint of a smile on his lips, “You ran out of chances for that.”<br/><br/>From his brow, once again, flew out two shadows, one black and one white.<br/><br/>One was a white tiger, full of sigma, with cold light flashing in its eyes.<br/><br/>The other was a solid snake-turtle with an ancient and magnificent body.<br/><br/>These were the Divine Beasts of the White Tiger and Black Tortoise.<br/><br/>His Divine Tiger Manual and Divine Turtle Manual had finally broken through to the sixth level.<br/><br/>“Are you giving up?”<br/><br/>Seeing this, the Master of Mount Bi Han felt a chill in his heart. The two divine beasts alone were already extremely tough to deal with. Now two more had appeared, how was he supposed to fight this?<br/><br/>He had no choice but to go all out!<br/><br/>From his brows, a Nascent Soul flew out, spitting out Fire of Nascent Soul, a great surge of brilliance emanated from the Sword of Bi Han.<br/><br/>He had even sacrificed his Nascent Soul, he was indeed going all out.<br/><br/>All four Divine Beasts launched their Divine Powers simultaneously.<br/><br/>“Roar!”<br/><br/>The Heavenly Divine Ape let out a roar that could shake the Original Spirit.<br/><br/>The Phoenix spewed a mouthful of Phoenix True Fire.<br/><br/>The White Tiger spat out a beam of white light from its mouth, the sharpness akin to sword energy.<br/><br/>The three attacks arrived all at once, yet they couldn’t sway the sword light.<br/><br/>This strike was the culmination of the Master of Mount Bi Han’s entire life’s cultivation, aimed for an instant kill.<br/><br/>But they saw the Black Tortoise divine beast, which was blocking Gu Yang, enlarging its body and completely shielding Gu Yang underneath.<br/><br/>Ding!<br/><br/>This sword light stabbed solidly onto the shell of the Black Tortoise, causing an earth-shaking noise.<br/><br/>The large body of the Black Tortoise trembled slightly, a deep wound appeared on its heavily armored shell, and dark blood spurted out.<br/><br/>Whoosh!<br/><br/>It turned into a streak of flowing light and burrowed into Gu Yang’s forehead.<br/><br/>“It’s my turn now!”<br/><br/>After using the Black Tortoise to block that fatal strike, Gu Yang began his counterattack.<br/><br/>In the first simulation, he suffered a great loss under this strike.<br/><br/>This time, he had the Black Tortoise to block it, he remained unscathed.<br/><br/>And he managed to create a perfect opportunity to strike back.<br/><br/>At this time, the Master of Mount Bi Han was extremely close.<br/><br/>“Heavenly Inquiry Nine Knives” third style, Momentum Engulfs the Universe!<br/><br/>This strike, capable of tearing through space, was now used by Gu Yang at this moment, instantly crossing dozens of meters, a blade edge arrived before the Master of Mount Bi Han.<br/><br/>“No”<br/><br/>When the Master of Mount Bi Han’s strike missed, he knew trouble was coming. But he never imagined that Gu Yang’s blade could be so fast.<br/><br/>Even faster than his sword light.<br/><br/>He didn’t even have time to react before his body was mashed apart by that one blade.<br/><br/>Only his Nascent Soul wrapped itself around the Sword of Bi Han and turned into a fleeing light, hurriedly escaping.<br/><br/>His speed was nearly twice as fast as Yuanzhou’s earlier!<br/><br/>“Gather!”<br/><br/>With a loud shout, the layer of black light in the sky gathered up quickly and turned into a ring, and flew towards his Nascent Soul.<br/><br/>“Trying to escape?”<br/><br/>The Phoenix flapped its long wings, turned into a streak of red light, and chased after it, spitting out a beam of True Fire at the fleeing light of the sword. This made its momentum decrease momentarily.<br/><br/>Then, the White Tiger also arrived, spouting white light from its mouth, making the Sword Light of Master Bi Han fly around clumsily.<br/><br/>The Heavenly Divine Ape somersaulted, its giant palm grabbing onto the black ring in its hand.<br/><br/>“Die!”<br/><br/>Finally, Gu Yang’s second blade also arrived.<br/><br/>“Divine Heaven Six Extinctions” third style, Heaven and Earth Annihilation!<br/><br/>This strike broke through the sword light and hit the Nascent Soul right in the middle.<br/><br/>It didn’t even make a grunt before it vanished like a bubble.<br/><br/>The Frost Light Sword let out a wail, unexpectedly turned around and pierced towards Gu Yang.<br/><br/>“What a fine Magic Treasure.”<br/><br/>Gu Yang reached out and grasped it firmly, no matter how it struggled, it could not break free from his palm.<br/><br/>Without its master, the power of this once formidable divine weapon become insignificant.<br/><br/>[You’ve gained two hundred energy points, current balance is two hundred and eighty.]<br/><br/>When Gu Yang saw this hint, he was in a great mood.<br/><br/>A mid Nascent Soul is worth two hundred points.<br/><br/>Adding the two Magic Treasures, all the investment just now had been earned back.<br/><br/>The people watching the battle from outside were all dumbfounded.<br/><br/>For Huang Shaokang and Jiang Chu’er, this battle completely exceeded their expectations.<br/><br/>A Nascent Soul big shot died right before their eyes.<br/><br/>The shock in their hearts was indescribable.<br/><br/>That was a Nascent Soul cultivator from the Ancient River Sword Sect, he was easily killed?<br/><br/>In this realm, the Nascent Soul cultivators from the Four Major Orthodoxies are the most powerful beings. Any heretical masters can’t compare with the Four Major Orthodoxies.<br/><br/>What is more frightening is,<br/><br/>From beginning to end, Gu Yang only showed the cultivation of the Golden Core stage.<br/><br/>In the history from ancient times to present, only one prodigy in the Water Moon Sect has ever killed a Nascent Soul with a Golden Core, and was hailed as a legend.<br/><br/>However, the Nascent Soul he killed was from a heretical side door, whose strength was far inferior to that of the orthodox Nascent Soul.<br/><br/>When Gu Yang flew over, both of their eyes were filled with deep fear and awe.<br/><br/>“Let’s go.”<br/><br/>Gu Yang did not linger and left with them.\t\t\t\t\t\t</div>", "images": {}, "success": true}