{"id": 260, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132122.html", "title": "Chapter 260 - Chapter 260: 260 A Magic Treasure", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 260 - Chapter 260: 260 A Magic Treasure</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 260: 260 A Magic Treasure<br/><br/>[Earned 10 energy points, current balance 28 points.]<br/><br/>Gu Yang was in a good mood. Killing a cultivator with first-stage mana could earn him a divine weapon. Such a trade couldn’t be more profitable.<br/><br/>Moreover, this golden core cultivator was too weak compared to the one he encountered on No Return Mountain last time.<br/><br/>They had already walked up to him, but the poor man had no clue. He was utterly useless.<br/><br/>At such a close distance, killing cultivators was as easy as slaughtering mortal realm warriors.<br/><br/>Gu Yang collected everything from the corpse, and to his surprise, there were three spirit tools and five magical tools. All of them were such evil and harmful tools that would corrupt people.<br/><br/>He recharged them directly, earning back thirty energy points. His balance reached fifty-eight.<br/><br/>“This place is indeed a treasure trove.”<br/><br/>Killing an early-stage golden core cultivator earned him forty energy points.<br/><br/>Such earnings would be impossible in Yellow Springs or Golden Court.<br/><br/>In Yellow Springs, killing a creature in the mana realm would only earn five energy points.<br/><br/>Golden Court could earn ten points, but there were basically no magical tools there.<br/><br/>Gu Yang asked the woman, “Where is your family’s magic treasure hidden?”<br/><br/>Jiang Chu’er was both pleased and shocked to see Yan Yi’s head explode.<br/><br/>With a mere wave of his hands and feet, he killed a golden core cultivator. Could the young man before her eyes be a Nascent Soul elder?<br/><br/>Although the youth seemed to only have a golden core cultivation level, she knew that Nascent Soul elders often had their own quirks and could easily conceal their cultivation levels.<br/><br/>Jiang Chu’er was secretly delighted that a Nascent Soul elder would cause trouble for Master Forget-Worries. That would be great.<br/><br/>Master Forget-Worries was sly and careful, never offending large sects. He only attacked people and forces without backing.<br/><br/>That’s why he had been carefree for centuries.<br/><br/>His power was immense and he was a renowned heretic master. Even if usual Nascent Soul elders disapproved of him, they wouldn’t dare to cross him.<br/><br/>Now, finally, a Nascent Soul powerhouse dared to cause trouble for Forget-Worries Mountain, which was a welcome sight for her.<br/><br/>If the magic treasure could create a deadly feud between them, that would be even better.<br/><br/>With her talent, even if she got hold of the magic treasure, the chances of seeking revenge were still slim.’<br/><br/>The recent episode made her give up the idea of seeking revenge by herself.<br/><br/>Any disciple of Master Forget-Worries could leave her with no choice but to live or die.<br/><br/>Jiang Chu’er said, “In a certain valley in the mountains, there is a lake. The treasure lies at the bottom of the lake.”<br/><br/>“I hope I am not concealing from you that the magic treasure our ancestors accidentally obtained has no power but contains a skill. If you obtain the magic treasure, could you leave that method to me?”<br/><br/>She proposed this request with much trepidation, almost forcing the words out.<br/><br/>Her family was once prosperous. Her ancestors had not reached the Nascent Soul realm, but they were in the later stages of the golden core realm, and were quite mighty in their own right.<br/><br/>Losing the skill made the Jiang family rapidly decline.<br/><br/>For her, the most important thing was that skill.<br/><br/>Gu Yang agreed immediately, “Okay.”<br/><br/>The request was not extravagant.<br/><br/>“Thank you, senior.”<br/><br/>Grateful, Jiang Chu’er immediately knelt down to give thanks.<br/><br/>In a certain part of Forget-Worries Mountain, a man and a woman stood within a valley.<br/><br/>“Junior brother, you’re wasting your energy. My grandfather has turned Forget-Worries Mountain upside down and found nothing. If there was such a magic treasure, how could it be your turn?”<br/><br/>a red-dressed woman sat on a boulder by the lake, with a red quilt fluttering above her head to shield her from the sunlight. She dipped her feet into the clear and cool lake water, teasing the man next to her.<br/><br/>She was the granddaughter of Master Forget-Worries, named Red Silk, third youngest.<br/><br/>In the valley, another black-clothed man was meticulously searching, leaving no stone unturned.<br/><br/>He was Dai Zichu, the youngest disciple of Master Forget-Worries.<br/><br/>He ignored Red Silk’s words, searched the whole valley thoroughly, and found nothing.<br/><br/>Red Silk played in the water for half a day. Seeing him still acting like a piece of wood and lacking any fun, she turned around and spoke in a provocative tone, “Junior brother, aren’t you feeling a bit hot?”<br/><br/>Without raising his head, Dai Zichu said in a serious tone, “Senior sister, that thing is really important to me. Only when the master is not here can I come to the back mountain to search for it. Once I find the thing, I will definitely make it up to you.”<br/><br/>Red Silk was irritated and cranky. She exclaimed, “Aren’t you even considering that if that Jiang family really had a magic treasure, how could they not carry it with them? At that time, if he had the magic treasure on him, how could my grandpa have killed him?”<br/><br/>Dai Zichu didn’t argue with her. Only he knew that the Jiang family did have a magic treasure.<br/><br/>Because his great-grandfather, who used to be a servant of the Jiang family, had seen the magic treasure.<br/><br/>Moreover, his great-grandfather knew that the magic treasure was hidden somewhere in the back mountain.<br/><br/>When Master Forget-Worries exterminated the Jiang family, his ancestor was luckily visiting his hometown and escaped the calamity. On his deathbed, he passed down the secret.<br/><br/>It was until Dai Zichu’s generation that someone finally got the aptitude to cultivate. Through all his efforts, he managed to enter Forget-Worries Mountain to search for the magic treasure.<br/><br/>Later, he got to know Red Silk, the granddaughter of Master Forget-Worries, and learned a secret from her.<br/><br/>That ancient ancestor of the Jiang family had been killed by Master Forget-Worries.<br/><br/>Master Forget-Worries had killed the Jiang family and took this place as his own for the Jiang family’s magic treasure.<br/><br/>To make this late-stage Nascent Soul cultivator care so much, one can imagine the value of the magic treasure.<br/><br/>Dai Zichu had searched all over the back mountain these days but found nothing.<br/><br/>“Where on earth is it hidden?”<br/><br/>He stood by the lake, a compass in his hand. The needle on the compass remained still, indicating that there were no prohibitions nearby.<br/><br/>This compass was a magical tool specifically used to detect magic arrays and prohibitions. No matter how secret the magic arrays or prohibitions, they couldn’t hide from it.<br/><br/>Some hidden prohibitions could escape the divine sense of a Nascent Soul cultivator, but they couldn’t evade the detection of the compass.<br/><br/>But he had already searched throughout the valley, sparing even not the sidelines of the mountains.<br/><br/>Yet, he came up empty-handed.<br/><br/>According to his great-grandfather’s last words, this lake was the most probable place that the Spirit Treasure could be hidden.<br/><br/>What on earth had been overlooked?<br/><br/>Dai Zichu looked at the lake before him, the needle of the compass still motionless, implying that there were no prohibitions under the water either.<br/><br/>After much contemplation, suddenly, a bolt of realization hit him like a lightning bolt.<br/><br/>Could it be…<br/><br/>He stashed away the compass and from his waist untied a pouch, from which he freed several blood-red fish.<br/><br/>Once the fish hit the water, they quickly stirred up swirling currents.<br/><br/>Half an hour later, a fish jumped out, landing in his hand, vomiting out a jade seal.<br/><br/>“Found it!”<br/><br/>Dai Zichu was filled with triumphant joy.<br/><br/>The Jiang family had actually thrown this artifact straight into the lake without setting any prohibitions, which paradoxically made it impossible for the ancestor of the Forget Worry Mountain to find.<br/><br/>Perseverance pays off.<br/><br/>After all these years, with his relentless effort to join the Forget Worry Mountain and painstakingly woo Red Silk, he finally got his hands on this longed-for magical treasure.<br/><br/>According to his deceased great-grandfather, the ancestor of the Jiang family, despite only having the cultivation level of the late Golden Core period, had a strength comparable to the Nascent Soul period. Yet his low-key demeanor hid this from most people.<br/><br/>The reason he possessed such a formidable power was because of the techniques that this magic treasure harbored.<br/><br/>Anxious, Dai Zichu immediately pressed the jade seal onto his forehead, attempting to decipher the techniques with his divine sense.<br/><br/>However, his divine senses entered and vanished just like clay oxen into the ocean, without any response.<br/><br/>“Why isn’t it working?”<br/><br/>He tried channeling his mana and attempted a few treasure-retrieving mantras, but there was still no effect.<br/><br/>In the end, he even attempted the blood-ownership ritual, but it was still unproductive.<br/><br/>The jade seal was like a dead object.<br/><br/>How could this be?<br/><br/>Dai Zichu was on the verge of an emotional breakdown.<br/><br/>The artifact that he had worked so hard for was seemingly inaccessible to him, he could neither gain the techniques within it nor refine it.<br/><br/>“There really is a magical treasure.”<br/><br/>Red Silk, standing aside, was quite astonished. From her perspective, she naturally recognized the jade seal as something extraordinary, without a doubt, it was a magical treasure.<br/><br/>“May I try?”<br/><br/>She took the jade seal and attempted a few methods, but all were just as ineffectual in generating any sort of reaction from it.<br/><br/>Just then, a voice came, “It’s useless!”<br/><br/>The two were taken aback.<br/><br/>With their level of cultivation, they couldn’t believe that someone entered the valley without their knowledge.<br/><br/>Even though their attention was focused on the artifact, the person or persons that managed to hide from their awareness was definitely a formidable force.<br/><br/>The reactions of both were immediate, readying to deploy their spirit tools.<br/><br/>But quickly they discovered, much to their shock, they could not move, even their internal mana could not be summoned at will.<br/><br/>Nascent Soul?<br/><br/>Their hearts filled with dread. Only a cultivator in the Nascent Soul period had the ability to silently immobilize their bodies and mana without being noticed.<br/><br/>Then a group of four people appeared before them.<br/><br/>Stuttering, Red Silk managed to say, “Junior Red…. Silk…. Ancestor Forget Worry …”<br/><br/>The leading youth ignored her and with a wave of his hand, he brought the jade seal towards him.<br/><br/>One of the women said, “Senior, this is the magical treasure that I mentioned.”<br/><br/>The group of four people was Gu Yang and his companions.<br/><br/>You could arrive early, but it wouldn’t be as fitting as arriving at the right time. When they arrived, they just happened to see the artifact in the hands of the two people.<br/><br/>“How could this thing be here?”<br/><br/>Gu Yang found it inconceivable. The seal was one of the Nine State Seals.<br/><br/>He never expected that the magical treasure mentioned by Jiang Chu’er would turn out to be the Nine State Seal.<br/><br/>That was just too perplexing.<br/><br/>He turned to Jiang Chu’er, “How did your ancestor obtain this?”<br/><br/>“I don’t know,” Jiang Chu’er shook her head. Her ancestor had disappeared before she was even born, she had no way of knowing.<br/><br/>What Gu Yang was even more curious about was how her ancestor had obtained the inheritance inside.<br/><br/>Could it be that her family was a descendant of the Xia Emperor?\t\t\t\t\t\t</div>", "images": {}, "success": true}