{"id": 266, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132134.html", "title": "Chapter 266 - Chapter 266: 266 Secrets Of The Celestial Being", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 266 - Chapter 266: 266 Secrets Of The Celestial Being</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 266: 266 Secrets of the Celestial Being<br/><br/>When Ye Lingbo’s words came out, the courtyard became quiet.<br/><br/>Gu Yang thought to himself, surely a fight would break out now.<br/><br/>He was prepared, ready to unleash his divine beast incarnations at any moment. If they started to seriously fight, he would intervene in time to prevent a tragedy.<br/><br/>Four incarnations, just enough for each of them.<br/><br/>Just as he was thinking, he suddenly felt something was wrong. Su Ningyan, Princess Chang, and Pei Qianlan all turned their heads, all staring at him with intense gazes.<br/><br/>Their eyes were remarkably similar, filled with grief and self-blame.<br/><br/>Su Ningyan asked softly, “Is what she said, true?”<br/><br/>Princess Chang and Pei Qianlan didn’t need to ask because they had been present at the time and heard it with their own ears — the part about them becoming Dao companions.<br/><br/>Ye Lingbo’s words had dealt them a lethal blow.<br/><br/>Because what they represented was status.<br/><br/>Until now, Gu Yang had not given them any status.<br/><br/>Even a promise would have sufficed.<br/><br/>They didn’t even have the courage to fight back.<br/><br/>Gu Yang started to feel a prickling sensation on his scalp under their stare, not understanding why they suddenly turned their spears towards him.<br/><br/>In response to Su Ningyan’s questioning, his mind began racing.<br/><br/>How should he respond in such circumstances?<br/><br/>He truly lacked experience in this.<br/><br/>After thinking for a second, he nodded, “It is true.”<br/><br/>It was a fact, he couldn’t deny it after the fact.<br/><br/>In the air, a moment of stagnation seemed to appear.<br/><br/>Su Ningyan didn’t say anything. She turned around and walked away.<br/><br/>Gu Yang didn’t call after her, merely watching her leave.<br/><br/>Then, Princess Chang left as well. Like Su Ningyan, she didn’t say anything when she left, only her hand clutching Long Autumn Sword showed her knuckles whitening, revealing the turbulence inside her.<br/><br/>Watching her leave, Gu Yang felt a relief in his heart.<br/><br/>That would be the better result, wouldn’t it?<br/><br/>Ye Lingbo also left, leaving in the same breezy manner as she arrived. Only the smirk on her face as she left gave away her feelings.<br/><br/>She was originally supposed to go practice in seclusion. On her way, she heard from her students that Princess Chang and a mysterious woman were jealously arguing outside the entrance of the literature academy—almost coming to blows. They were stopped by Vice Principal Zhou.<br/><br/>As soon as she arrived at Zhou Zongye’s courtyard, she ended the fight among the three women with just one sentence.<br/><br/>The courtyard was left with only Gu Yang and Pei Qianlan, and the atmosphere became somewhat tense.<br/><br/>After half a year of not seeing each other, he wanted to ask about Su Qingzhen and the others, but saw tears gushing down her face. His heart softened, and he stepped forward to embrace her.<br/><br/>Pei Qianlan cried even harder.<br/><br/>“You are so cruel to leave me there and run away on your own…”<br/><br/>“Did you… not want me anymore…”<br/><br/>“You”<br/><br/>Seeing that she was about to talk nonsense, Gu Yang sighed, “I thought you could understand me.”<br/><br/>With one sentence, Pei Qianlan’s weeping stopped abruptly. She looked at him with her tear-stained face in a fluster.<br/><br/>He wiped the tears from her face with his hand and said, “My enemies are everywhere—the Shen Family, the Lin Family, the Heavenly Saint Sect; the Three Saint Sects and ChiMing Heaven behind them …”<br/><br/>“Surrounded by powerful enemies, I have no time to worry about personal matters. If I keep you by my side, I will only bring harm to you.”<br/><br/>Upon hearing his words, Pei Qianlan was both ashamed and guilty.<br/><br/>“I never thought of leaving you. Only if you are safe, can I focus on cultivation.”<br/><br/>“I’m sorry, it’s my fault…”<br/><br/>With a few sentences, Gu Yang had managed to calm Pei Qianlan.<br/><br/>Of course, what he said was indeed the truth. At such times, he had neither the time nor the mood for love.<br/><br/>But he had ended up attracting one woman after another.<br/><br/>Having too much charm was also a problem!<br/><br/>When Pei Qianlan had calmed down, Gu Yang said, “Let’s go.”<br/><br/>“Where?”<br/><br/>“The palace.”<br/><br/>“Huh?”<br/><br/>Zhou Zongye, who was outside, saw they weren’t fighting and intended to leave, but he couldn’t help eavesdropping a bit longer. When he saw Gu Yang not only soothe Pei Qianlan but also make her apologize, he couldn’t help but sigh. If only it was like this in the past…<br/><br/>When he heard Gu Yang intended to take her to the palace, he was shocked.<br/><br/>Gu Yang had just upset the dowager empress recently.<br/><br/>And now he was taking a lover to the palace. Was this really okay?<br/><br/>Gu Yang also knew the timing was not appropriate, but he didn’t have a choice.<br/><br/>At this time, Shen Yun must be not far from Divine City. Unlike the Nascent Soul cultivators in Shuiyue Dongtian, this Unleaking Realm powerhouse, who lived more than a thousand years, was not to be trifled with.<br/><br/>An Unleaking Realm powerhouse had no weaknesses. They were more formidable in close combat, had tougher mortal bodies, and stronger mana…<br/><br/>The only place he had a slight advantage was that his Shenxiao Six Annihilation could restrain the Taiyou Moon Devouring Technique.<br/><br/>Even with his four divine beast incarnations, he might not be a match for Shen Yun.<br/><br/>Even if he seized the opportunity and defeated Shen Yun, as soon as the Heavenly Being from the Three Saint Sects appeared, he would be done for.<br/><br/>At this point, the only place Gu Yang could go was the palace.<br/><br/>Even the literature academy could not protect him.<br/><br/>The problem was, he had just offended Su Ningyan…<br/><br/>He should run a simulation first.<br/><br/>“At the age of twenty-two, you already had the mana of the second heaven, killed Shen Zhou of the third heaven’s mana level, and stunned the world.”<br/><br/>“After returning from the Water Moon Cave Heaven, you survived a battle in the Asura realm. You then went to the Imperial Palace with Pei Qianlan.”<br/><br/>“Su Ningyen took you in, and you practiced in secrecy in the palace.”<br/><br/>“Thirteen years later, the Star Luo Sect broke into the Divine City and several Celestial Beings captured you alive, taking you to a Cave Heaven world.”<br/><br/>“One year later, you died after completely exhausting your mana, at the age of thirty-six.”<br/><br/>Su Ningyen was truly generous!<br/><br/>Gu Yang secretly heaped praises on her, finally feeling at ease.<br/><br/>The palace soon came into sight.<br/><br/>Gu Yang had a token given by Su Ningyen. He showed it to the palace guard at the gate, and soon the leader of the Imperial Guard personally came out to greet him.<br/><br/>The leader of the Imperial Guard led them to the outside of Qi Feng Pavilion.<br/><br/>Inside Qi Feng Pavilion, Su Ningyen was reading a report, her expression serious. At the moment, she heard news that Gu Yang had arrived with a woman.<br/><br/>She put down the report and uttered a word, “Call.”<br/><br/>Soon after, Gu Yang alone walked inside, leaving the woman outside in the Great Hall.<br/><br/>Without needing Su Ningyen’s command, the maids and eunuchs automatically retreated, leaving only the two of them.<br/><br/>Her tone was a bit cold, “What are you here for?”<br/><br/>Gu Yang replied, “Shen Yun is here.”<br/><br/>Hearing this name, Su Ningyen’s eyes hardened.<br/><br/>Shen Yun, the ancient patriarch of the Shen family, a thousand-year-old monster. He lived through the downfall of the Xia Dynasty, witnessed the rise and fall of the Qin Dynasty, and the emergence of the Great Zhou.<br/><br/>A thousand years, three dynasties, yet he still stood firm.<br/><br/>As can be imagined, how formidable such a person could be.<br/><br/>The realm of mana is the pinnacle of this world.<br/><br/>And the Unleaking Realm, it had already transcended mortal existence. High above, detached from the world.<br/><br/>A character like this rarely interferes in worldly affairs.<br/><br/>Over the past thousand years, only when a sect is faced with life and death, will such ancient monsters of the Unleaking Realm reveal themselves.<br/><br/>The last time a powerful Unleaking Realm warrior made a move was within the palace.<br/><br/>Dao Sect’s headmaster, Wen Jue, single-handedly held off two Unleaking Realm powerhouses under the palace’s prohibition.<br/><br/>If you trace further back, it was eighteen years ago during the eradication of the Wu Family.<br/><br/>At this time, three ancient monsters of the Unleaking Realm and three Sword Saints teamed up to kill Wu Da.<br/><br/>The battle was fierce, with numerous casualties, which made the heavens change colors.<br/><br/>Although Shen Yun’s fame is not as prominent as Wu Da’s, he should not be underestimated. The last time he made a move was during the Qin Dynasty’s end, when they besieged the Celestial Being in Lin Family.<br/><br/>At that time, he was already at the peak of the Unleaking Realm and his strength was definitely not inferior to Dao Sect’s head teacher, Wen Jue.<br/><br/>Gu Yang then added, “Shen Yun isn’t the main threat, but his master behind him might take action himself.”<br/><br/>“Three Saints Gate?”<br/><br/>Su Ningyen was startled.<br/><br/>Since she took over power, she secretly read some information about the Four Great Sacred Lands from the royal family. She was clearer than anyone about their terrifying power, especially the Three Saints Gate and Chiming Heaven.<br/><br/>In history, the death of Xia Emperor, the establishment and destruction of the Qin Dynasty, all had a huge relationship with the Four Great Sacred Lands.<br/><br/>In fact, the rise of the Great Zhou founder was also due to the support of the Three Saints Gate.<br/><br/>Later on, when the founder wanted to shake off the control of the Three Saints Gate, even though he succeeded, he ended up losing his life.<br/><br/>At present, the Zhao family could firmly sit on this throne due to two supporters.<br/><br/>One was Luo Wang. With this Celestial Being, unless the other Celestial Being took action, the Four Great Sacred Lands would not be able to shake the Zhao family’s rule.<br/><br/>The other was the Great Array of the Imperial Palace.<br/><br/>The Great Array of the Imperial Palace had already been activated once, killing an Unleaking Realm powerhouse. Now, only the final two remained.<br/><br/>Could they really fend off a Celestial Being powerhouse?<br/><br/>Su Ningyen did not have much confidence.<br/><br/>The last time, when the Dao Sect head teacher single-handedly blocked two Unleaking Realm characters was still fresh in her memory.<br/><br/>If it were a Celestial Being, it would probably only take a moment to kill all present.<br/><br/>Seeing her changing expression, Gu Yang did not rush her but quietly waited for her decision.<br/><br/>Su Ningyen took out a bright yellow token and flung it over, saying, “Inject your mana into the token, and you will not be affected by the palace’s prohibition.”<br/><br/>Gu Yang quickly caught it, and without any words, he injected his mana and quickly accomplished the refining.<br/><br/>All at once, he felt the pressure on his body lighten, and his internal mana fully recovered.<br/><br/>With this, the palace became his homeground. If Shen Yun dared to come in, he could give him a big surprise.<br/><br/>“Take this.”<br/><br/>Su Ningyen handed over another item.<br/><br/>Gu Yang took it and found it to be the Imperial Jade Seal, which was also the core of the palace’s great array.<br/><br/>It could be said that this was the most valuable treasure in the world today. It was not only a symbol of destiny but also a symbol of power.<br/><br/>Handing this over to him, meant entrusting him with incomparable trust.<br/><br/>Gu Yang carefully stored this Imperial Jade Seal.<br/><br/>Su Ningyen suddenly asked, “Want to know the secret of Celestial Being?”<br/><br/>The secret of Celestial Being?<br/><br/>Gu Yang’s heart jolted, and he looked at her.<br/><br/>“If you want, then follow me.”<br/><br/>After finishing her words, Su Ningyen turned and walked inside.<br/><br/>Gu Yang sent a message to Pei Qianlan who was outside the Great Hall, then followed her in.<br/><br/>Behind it was a long-abandoned garden, filled with all sorts of weeds. In the middle was a well sealed with stone slabs.<br/><br/>Su Ningyen lifted the stone slab on the well and jumped in.\t\t\t\t\t\t</div>", "images": {}, "success": true}