{"id": 269, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132140.html", "title": "Chapter 269 - Chapter 269: Moonlight Pond 269", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 269 - Chapter 269: Moonlight Pond 269</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 269: Moonlight Pond 269<br/><br/>Gu Yang opened his eyes and saw Pei Qianlan standing anxiously outside the door. He beckoned to her, signaling her to come in.<br/><br/>By now, it had grown dark, and the palace was eerily quiet.<br/><br/>The room was pitch-black. Earlier, a palace maid had tried to light a lamp, but Pei Qianlan had stopped her, fearful that it might disturb him.<br/><br/>“Are you okay?”<br/><br/>Pei Qianlan spoke anxiously as soon as she entered, “Just now, you seemed quite unwell.”<br/><br/>After breaking into the Divine Power Realm, her spiritual sense became incredibly keen. Gu Yang had looked noticeably weaker upon returning from his meeting with the Empress Dowager, which raised a disturbing thought.<br/><br/>“I’m alright now.”<br/><br/>Gu Yang said, lighting a candle on the table with Mana, brightening up the dark room.<br/><br/>Changing the subject, he asked, “Is everything going well at Tianzhu Mountain?”<br/><br/>“Everyone’s fine, but Han Mengling…” Pei Qianlan hesitated.<br/><br/>Han Mengling?<br/><br/>“What happened to her?”<br/><br/>“She disappeared all of a sudden, a month ago.”<br/><br/>“Disappeared?”<br/><br/>“Yes, she disappeared out of thin air. We’ve searched everywhere and couldn’t find her. I’m sorry. I should’ve kept a better eye on her.” Pei Qianlan looked guilt-ridden.<br/><br/>In the secret realm of Tianzhu Mountain, she was the eldest and most advanced in cultivation, therefore she naturally became the leader.<br/><br/>Han Mengling was the youngest and whimsical. Most importantly, she and Gu Yang were not romantically involved. Hence, she got along well with everyone.<br/><br/>Her sudden disappearance made Pei Qianlan feel responsible for not protecting her.<br/><br/>Gu Yang had a feeling there was more to this.<br/><br/>In all of his previous simulations, there had never been any accidents during their long stays in the secret realm. Why did something happen now?<br/><br/>Han Mengling was the disciple of the Asura Sword Saint entrusted to him. She had set a record in one simulation by breaking into Divine Power Realm within a few years.<br/><br/>Her cultivation speed was even faster than Su Qingzhen’s.<br/><br/>It indicated that Han Mengling must be harboring an immense secret.<br/><br/>However, one problem led to another, and he simply never had the time to discover the secret of Han Mengling.<br/><br/>Furthermore, she had not displayed any harmful tendencies during that simulation.<br/><br/>Gu Yang asked, “Did anything special happen before her disappearance?”<br/><br/>Pei Qianlan was quick to answer, “Indeed, something did happen. Sister Qingzhi accidentally opened the main gate of the cave dwelling. Inside, she found a sword.”<br/><br/>“At the time, Mengling was with her. They discovered a secret chamber, leading to an underground cave with a spiritual pool. It’s somewhat similar to the Dragon Washing Pond on Dragon Gate Island.”<br/><br/>“Sister Ruomei said that the pool was a Moonlight Pool, which could assist in cultivation. After that day, we took turns cultivating in the pool, which improved our cultivation rapidly. That’s how I managed to break through to the Divine Power Realm so quickly and come here to see you.”<br/><br/>“Both Sister Qingzhi and Sister Ruomei aren’t far from the Divine Power Realm either.”<br/><br/>Moonlight Pond?<br/><br/>Gu Yang was taken aback.<br/><br/>In all his previous simulations, he never discovered something like this underneath the cave dwelling.<br/><br/>Moreover, it was Han Mengling who had discovered it.<br/><br/>Ever since he found out that Han Mengling was hiding a secret, he had not brought her into the secret realm of Tianzhu Mountain in subsequent simulations.<br/><br/>This time, thinking that Pei Qianlan was there to keep her in check and that he couldn’t always keep Han Mengling by his side, he left her in the secret realm.<br/><br/>As a result, in his absence, this incident occurred.<br/><br/>Maybe Han Mengling quietly broke into the Divine Power Realm and left the secret realm, without them noticing.<br/><br/>“Why didn’t something this fortuitous ever happened to me?”<br/><br/>Gu Yang was slightly annoyed, feeling as if he was being singled out.<br/><br/>If he had found that Moonlight Pool earlier, he could have broken into the Divine Power Realm earlier. There would have been no need to waste so many simulation attempts.<br/><br/>After learning about the current situation of Su Qingzhen and the others, Gu Yang felt more at ease. After adjusting his state, he activated the system.<br/><br/>[Would you like to use the life simulator? Each use consumes twenty energy points.]<br/><br/>“Yes.”<br/><br/>[At the age of twenty-two, you’ve reached the second level of Mana. You killed Shen Zhou, shaking the world.]<br/><br/>[In the palace, you met a mysterious person from underneath the land and asked him four questions.]<br/><br/>[Nine days later, several Unleaking Realm powerhouses appeared in the Divine City and fought a great battle. A gigantic skull appeared in the sky, restraining the Dean of the Academy.]<br/><br/>[The Saint Chaoyang invaded the palace. The Empress Dowager activated the palace’s great array, and Luo Wang appeared. However, he was defeated by Saint Chaoyang, and you were captured and taken to Taoyuan Heaven.]<br/><br/>[A year later, you died at the age of twenty-three due to the exhaustion of your inner core.]<br/><br/>How could this happen?<br/><br/>Gu Yang was shocked by the results of this simulation.<br/><br/>During the previous simulation, the palace’s grand array was able to resist Saint Chaoyang. Why did it fail now?<br/><br/>Suddenly, an idea flitted through his mind. It was him!<br/><br/>The mysterious man under the ground.<br/><br/>The only thing that changed between the two simulations was that he had asked that mysterious man four questions this time.<br/><br/>Oh my god!<br/><br/>He had thought he had encountered a senior expert.<br/><br/>Yet, it turns out the expert had sinister intentions.<br/><br/>Right, in this world, there isn’t that many seniors willing to help others.<br/><br/>Who knows what that old monster, who had lived for an unknown amount of time, was thinking.<br/><br/>Gu Yang suspected that his rapid restoration of the four Divine Beasts in such a short time had aroused the murderous intent of the old monster.<br/><br/>The area beneath the palace, where both had been, was the heart of the palace’s grand array.<br/><br/>The ancient monster has stayed there for such a long time, it must be very familiar with this large array, playing tricks out of sight, it would not be hard.<br/><br/>Think a little deeper, back in the year when the Xia Emperor opened the entrances to those four worlds, leading to his death, perhaps, he was tricked by this ancient monster.<br/><br/>If the Xia Emperor broke through to the Hollow Void realm, it would bring no good to it.<br/><br/>Thinking about this, Gu Yang shivered.<br/><br/>How devious indeed.<br/><br/>This time, if it weren’t for the Simulator, he wouldn’t know how he died.<br/><br/>[Simulation complete, you may retain one of the following.]<br/><br/>[One, the Martial Arts realm at the age of twenty-two.]<br/><br/>[Two, the Martial Arts experience at twenty-three.]<br/><br/>[Three, the life wisdom at twenty-three.]<br/><br/>“I choose the second option.”<br/><br/>Suddenly, Gu Yang’s mind was suffused with a new battle experience.<br/><br/>He could only see two figures, a man and a woman, he couldn’t understand their way of fighting.<br/><br/>In the end, the woman took out a bead, instantly freezing everything around her, with a stretch of her hand, she captured him.<br/><br/>“The palace isn’t safe anymore, where can I go then?”<br/><br/>Gu Yang felt a bit challenged.<br/><br/>The enemy that he will face this time is the most powerful in history. He has no resistance now.<br/><br/>Chiming, that being, will not easily descend in person, but it is still separated from him, and there are ways to deal with it.<br/><br/>The Saint Chao Yang from the Three Holy Doors, that is the peak of the Celestial Being realm, infinitely close to the existence of the Hollow Void realm. Even a Celestial Being and a large palace array could not stop him. Where could he run to?<br/><br/>The only good news is that he still has nine days.<br/><br/>Each simulation, Saint Chao Yang would arrive on the same day.<br/><br/>Within these nine days, he had to come up with a solution.<br/><br/>Otherwise, nine days later, when Saint Chao Yang arrived, it would really be hopeless.<br/><br/>Shen Yun!<br/><br/>The name appeared in Gu Yang’s mind.<br/><br/>The key to the solution lies with the ancient ancestor of the Shen Family.<br/><br/>Divine City has already become a land of death, to find a way out, one must leave Divine City.<br/><br/>To leave Divine City, he had to deal with this Unleaking realm powerhouse.<br/><br/>Gu Yang glanced at the system balance, there were still 365 points. Enough for eighteen simulations.<br/><br/>Let’s get started!<br/><br/>[Twenty-two years old…]<br/><br/>[You left Divine City alone and headed north, a day later, you were caught up by Shen Yun, you fought while you escaped, eight days later, Saint Chao Yang arrived and took you away.]<br/><br/>[One year later, you’re dead, aged twenty-three.]<br/><br/>It seems that Shen Yun is already near Divine City, as long as he leaves Divine City, he will be discovered.<br/><br/>Gu Yang knew that the target of the enemy was to capture him alive, and just because he didn’t kill him directly, didn’t mean he could withstand Shen Yun for that long.<br/><br/>This route is not feasible.<br/><br/>He racked his brains, considering every possibility, unless the leader of Dao Sect, Wen Jue, took action, or lured Shen Yun to the palace, otherwise, it would be impossible to beat Shen Yun.<br/><br/>However, Ye Ling Bo said that Wen Jue had important matters to attend to in the Shuiyue world and would return in a month.<br/><br/>Shen Yun is not stupid, how could he run to the palace?<br/><br/>Is there really no other way?<br/><br/>[Simulation complete, you may retain one of the following.]<br/><br/>“I choose the second.”<br/><br/>Gu Yang’s mind was filled with another battle experience, specifically, the fight against Shen Yun.<br/><br/>His strength is far superior to Shen Zhou’s, even the “Godly Annihilation” can’t hurt him a bit.<br/><br/>From beginning to end, Gu Yang was severely suppressed.<br/><br/>If not for Shane Yun trying to capture him alive, he would’ve died already.<br/><br/>The disparity in their cultivation level was too large, he barely managed to not get captured alive.<br/><br/>Gu Yang got up and walked to the window, looking at the moon in the sky. The feeling of unease in his heart gradually subsided.<br/><br/>“In Divine City, is there any Unleaking realm powerhouse that can be utilised?”<br/><br/>Suddenly, he had a revelation.<br/><br/>There really was one!<br/><br/>The problem is, how do I lure Shen Yun into Divine City?<br/><br/>As Gu Yang pondered, slowly, a plan began to form.<br/><br/>After some deliberation, he sat down again and turned on the Simulator.<br/><br/>[Twenty-two years old…]<br/><br/>[Leaving the palace for the academy on the way, you are assassinated by the Shadow Sword Saint, heavily injured, and escaped by chance.]<br/><br/>[Suddenly, Shen Yun appears, you transform into a phoenix and escape to the Celestial Altar, activating the Secret Realm.]<br/><br/>[The guardian of the Secret Realm, a powerhouse of Unleaking Realm, comes forward with the Human Emperor Sword and fights with Shen Yun. You take advantage of the chaos to escape Divine City.]<br/><br/>[A day later, you reach Luo Prefecture, find Chu Xiyue, bring her into the Immortal Palace of Cold Moonlight. Chu family’s ancestor is right behind you, flying in too.]<br/><br/>[At this time, Shen Yun and that towering figure wielding the Human Emperor Sword arrives, closely followed by two more Unleaking realm powerhouses. At the critical moment, you all enter the Immortal Palace.]<br/><br/>[Five Unleaking realm powerhouses, in the palace, engage in a chaotic battle with the protective Monster Beast…]<br/><br/>PS: It’s the 18th, the end of the month is nearing, please drop some monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}