{"id": 265, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132132.html", "title": "Chapter 265 - Chapter 265: Draw Your Sword, 265", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 265 - Chapter 265: Draw Your Sword, 265</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 265: Draw your sword, 265<br/><br/>Indeed, wherever there are people, there are power struggles.<br/><br/>Even in the realm of Celestial Beings, disputes and plots are inevitable.<br/><br/>Gu Yang shook his head and turned to Ye Lingbo, saying, “Let’s go.”<br/><br/>With a wave of Ye Lingbo’s hand, a passage appeared. The two of them walked through the passage, returning to the Star Picking Pavilion.<br/><br/>“Principal Zhou?”<br/><br/>Just after their return to the Star Picking Pavilion, they saw Zhou Zongye waiting there. Gu Yang asked, “Why are you here?”<br/><br/>Seeing that he had finally returned, Zhou Zongye breathed a sigh of relief and said, “Waiting for you.”<br/><br/>Gu Yang was a little confused, “What happened?”<br/><br/>“Follow me.” Zhou Zongye turned and left.<br/><br/>Gu Yang followed him.<br/><br/>Ye Lingbo had to consolidate his cultivation level and didn’t follow them.<br/><br/>Soon, the two of them arrived at Zhou Zongye’s courtyard.<br/><br/>He stopped at the door and said, “Go in. You’ve brought this on yourself, so you deal with it.”<br/><br/>What does that mean?<br/><br/>With some kind of suspicion, Gu Yang pushed the door open and saw two women in the courtyard, sitting at opposite ends, staring at each other.<br/><br/>“Qianlan?”<br/><br/>He saw a familiar figure and was surprised, “Why are you here?”<br/><br/>According to his previous simulation, she would need at least several years to break into the Unleaking Realm and leave the Secret Realm.<br/><br/>Could it be that something has happened?<br/><br/>When Gu Yang thought of this, his heart tightened.<br/><br/>The two women were under a prohibition, unable to use their True Essence or move.<br/><br/>He was interfered with and could not figure out Pei Qianlan’s actual cultivation level.<br/><br/>At that moment, Zhou Zongye outside the door removed the lock on them.<br/><br/>“Gu Yang!”<br/><br/>When Princess Chang saw him stepping inside, she was furious that he only noticed that despicable woman while ignoring her. “Am I invisible to you?”<br/><br/>The drama had finally begun.<br/><br/>Gu Yang knew that a day like this would come, sooner or later. Now was the perfect opportunity to clear the air. He said, “Your Highness, this lady is my…”<br/><br/>“Hold on.”<br/><br/>Princess Chang cut him off, staring into his eyes and arrogantly said, “As the royal princess, I absolutely won’t be a concubine. No matter how many women you had before, I must be the legal wife.”<br/><br/>Gu Yang was left completely speechless.<br/><br/>As a royal princess, how could she share a husband with another woman?<br/><br/>Shouldn’t she be jealous and break up with me, or even become enemies with me?<br/><br/>To be the legal wife-<br/><br/>My goodness.<br/><br/>“Based on what?”<br/><br/>Pei Qianlan reacted violently. Influenced by Princess Chang’s personality, if she becomes the legal wife, would she still be able to live in peace?<br/><br/>She strongly opposed, “No matter if you’re a princess or a celestial nymph, we still should follow the principle of seniority.”<br/><br/>Princess Chang’s gaze became extremely dangerous, “What, you disagree?”<br/><br/>Clang!<br/><br/>Pei Qianlan had already pulled out her Rhinoceros Sword. The lingering sword intent filled the entire courtyard.<br/><br/>Crackling-<br/><br/>Sparks were flying between the two women, their blades at each other’s throats, ready to fight at any moment.<br/><br/>Gu Yang never thought that the usually gentle and pleasing Pei Qianlan could be so fierce. It was an eye-opener indeed.<br/><br/>Should he stop them?<br/><br/>He was somewhat hesitant.<br/><br/>Or should he let them fight it out?<br/><br/>Interestingly enough, determining the hierarchy based on strength was not a bad idea.<br/><br/>If not, neither of them would submit to the other, and if they bickered like this every time they met, who could stand it?<br/><br/>However, considering their strength, it’s highly probable that Princess Chang would emerge victorious. She already had a third-level Golden Body.<br/><br/>Pei Qianlan had just made her breakthrough and only had a first-level Golden Body. How could she possibly be her match?<br/><br/>The other women were out of the question.<br/><br/>Just as the tension reached its peak, a voice arrived, “What a lively atmosphere.”<br/><br/>A single phrase dismantled the intimidating atmosphere between Princess Chang and Pei Qianlan without a trace.<br/><br/>From outside the door, a figure dressed in purple entered, looking supremely noble. It was none other than the current Empress Dowager, Su Ningyan.<br/><br/>After integrating with her external incarnation, she had entered the Mana Realm. She had all kinds of magical and spiritual tools on her.<br/><br/>Gu Yang felt an odd power, as if it could soothe a person’s spirit, making them feel calm and peaceful.<br/><br/>Both Pei Qianlan and Princess Chang were clearly affected by this power, finding it hard to muster their fighting spirit.<br/><br/>They both turned to look at Su Ningyan, with evident wariness in their eyes.<br/><br/>The two of them together may not even be her match. If it came down to deciding role based on strength, the one who became the legal wife could very well be the woman standing before them.<br/><br/>Looking at Gu Yang, Su Ningyan’s gaze was complex, “You’ve gotten even stronger.”<br/><br/>Gu Yang asked, “Is there something you need?”<br/><br/>“There was indeed something, but it seems now, my visit is superfluous.” Su Ningyan gave a slight smile and said, “Someone has hired the Shadow Sword Saint at a high price to kill you.”<br/><br/>The Shadow Sword Saint, one of the ten sword saints and the most mysterious of them all. No one seemed to have ever seen his real face, hence the name.<br/><br/>With the title of a sword saint, his strength was naturally unquestionable.<br/><br/>Gu Yang replied, “For such matters, just send someone to inform me. There’s no need to come in person.”<br/><br/>For her to leave the palace in person was very dangerous.<br/><br/>There must be many people in this world who want her dead. If she stayed in the palace, no one would be able to kill her.<br/><br/>Once she left the palace and lost the protection of its formations, any Unleaking realm practitioner could kill her.<br/><br/>With a smile, Su Ningyan replied, “I wanted to see you.”<br/><br/>Princess Chang changed color, “You, as the Empress Dowager with your husband still unburied, dare to openly flirt with men! How do you have the face to be the Empress Dowager of Great Zhou?”<br/><br/>Without getting angry, Su Ningyan replied lightly, “Even if I am flirting, what will you do?”<br/><br/>At this point, Princess Chang could no longer bear it. She pulled out her Long Autumn sword and shouted in anger, “I’ll kill you, you shameless woman!”<br/><br/>However, she couldn’t bring herself to make a move.<br/><br/>An invisible force was constantly weakening her killing intent and fighting spirit.<br/><br/>Gu Yang held his head in his hands. This was an outright invitation to trouble.<br/><br/>Zhou Zongye on the outside was left in awe.<br/><br/>Three Divine Power realm women, actually competing over Gu Yang out of jealousy.<br/><br/>You have a Empress Dowager, a Princess Chang, and a former Jinghai Princess.<br/><br/>Goodness, they could be said to be the three most noble women of Great Zhou.<br/><br/>Absurd. This is too absurd.<br/><br/>Gu Yang, this young man, plays more games than he did when he was younger.<br/><br/>In the courtyard, Princess Chang continued to lift her sword and then lay it down, again and again…<br/><br/>Pei Qianlan, who was at the side, had her heart pounding. This woman’s cultivation level was simply inscrutable and composed of strange tactics. There was no way she could compete with her right now.<br/><br/>“I heard that the Empress Dowager is visiting. I apologize for not going out to meet you.”<br/><br/>Another familiar voice sounded, and a stunning figure walked into the courtyard – Ye Lingbo.<br/><br/>Well then, another one had arrived.<br/><br/>Gu Yang was feeling a little numb. He had no idea how to diffuse this situation now.<br/><br/>“Ye Lingbo!”<br/><br/>Su Ningyan’s eyes flashed a hint of surprise upon seeing her.<br/><br/>“I feel the need to inform you all,” said Ye Lingbo, “that Gu Yang and I have already bonded as Dao companions.”\t\t\t\t\t\t</div>", "images": {}, "success": true}