{"id": 267, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132136.html", "title": "Chapter 267 - Chapter 267: How To Achieve Celestial Being?", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 267 - Chapter 267: How To Achieve Celestial Being?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 267: How to achieve Celestial Being?<br/><br/>Gu Yang peered into the well. It was too deep to see the bottom.<br/><br/>It reminded him of the bottomless pit in the Golden Court cave, the one that contained the corpse of the Celestial Being Divine Ape.<br/><br/>He was surprised to find such a place in the palace.<br/><br/>Out of curiosity, Gu Yang jumped in.<br/><br/>Suddenly, he heard Su Ningyan’s voice, “This is the most secret place in the palace, for emperors alone. Since the establishment of the Great Zhou dynasty, you are likely the second outsider to be here.”<br/><br/>He asked, “Who was the first one?”<br/><br/>“Sun Yuwei,” she responded.<br/><br/>He vaguely recognized the name.<br/><br/>Suddenly, he remembered – a person of unparalleled power who was ranked second in the master’s list.<br/><br/>Gu Yang hadn’t crossed paths with a martial artist of this caliber before, and he wasn’t sure about his strength level.<br/><br/>Suddenly, a thought struck him, “Is she the heritor of the Blue Sky Palace who instigated the feud between the Wu Family and the royal family more than twenty years ago?”<br/><br/>The incident where the Wu Family assassinated Emperor Zhao and was subsequently eradicated is still shrouded in mystery.<br/><br/>The Blue Sky Palace’s heir was deemed the main culprit, but Gu also didn’t completely understand the inner workings of the situation.<br/><br/>Su Ningyan answered, “She is not the heritor of Blue Sky Palace.”<br/><br/>Gu Yang’s curiosity was piqued, and he asked, “What’s her background?”<br/><br/>“Her background is quite complicated. I’ll tell you about it when there’s time.”<br/><br/>Now was not the time to talk about it. Gu Yang scanned the surroundings. The well wall was sleek, initially covered in moss.<br/><br/>The further they went down, the less moss there was until the rock was completely exposed.<br/><br/>After about fifteen minutes, they touched bottom.<br/><br/>By his estimation, they were already about twenty thousand meters underground.<br/><br/>There was no visible light below. However, both of them were at the Mana realm, capable of ‘seeing’ even in complete darkness.<br/><br/>The underground space was relatively small, with a passage ahead that seemed endless.<br/><br/>“Let’s go,” Su Ningyan led the way.<br/><br/>Gu Yang followed her.<br/><br/>After a while, a corridor appeared ahead, obviously man-made. Night Pearls were embedded on both sides, illuminating the path.<br/><br/>The passage was spacious enough for ten people to walk side by side and was three meters high.<br/><br/>To imagine the manpower and resources required to construct such an engineering marvel twenty thousand meters underground was mind-boggling.<br/><br/>The pair kept walking.<br/><br/>After about another two kilometers, a large underground palace appeared before them. Surrounding it were nine extraordinarily large columns shaped like dragons.<br/><br/>In the middle, there was a giant cauldron!<br/><br/>The Divine Nine Cauldron!<br/><br/>Gu Yang recognized it instantly. It was a Divine Nine Cauldron, held aloft by the mouths of the dragon-heads atop the nine massive columns.<br/><br/>This formation seemed like a kind of spell array.<br/><br/>He remembered and quickly understood: based on their positions and the glimpse of the palace array he had when he held the imperial jade seal, he inferred that this was the eye of the palace array.<br/><br/>At this point, Su Ningyan took out a red crystal stone from her bosom. It was glowing softly.<br/><br/>Gu Yang could feel that the crystal contained a massive amount of energy, almost as much as a cultivator at the Unleaking realm would possess.<br/><br/>Monster beast’s core?<br/><br/>In essence, he had never seen it before, but guessed what it was instantly.<br/><br/>Moreover, it was a core from a Unleaking realm monster beast, of the Fire attribute.<br/><br/>Such a thing should suffice as a recharge, he assumed.<br/><br/>Su Ningyan threw the red crystal into the Divine Nine Cauldron and said, “Predecessor, please show yourself.”<br/><br/>With a few clinks, the crystal fell into the cauldron, creating a clashing noise.<br/><br/>After a moment, the cauldron illuminated faintly with a red light.<br/><br/>The ground beneath the cauldron moved slightly, and a dried-up head emerged slowly. The skin and muscles had atrophied, and the empty eye sockets flickered with faint light.<br/><br/>A hoarse and weak voice resonated, “A monster core at the Nascent Soul stage, it’s been almost a thousand years. Its energy is less than a tenth. Next time, don’t use these trinkets to summon me. What do you want to ask? Hurry up.”<br/><br/>There was immense discontent in his voice.<br/><br/>Gu Yang sneaked a visual analysis and noticed that the energy level of the figure was incredibly feeble, as though it could dissipate at any moment.<br/><br/>Describing the frailty, the phrase ‘one’s last gasp’ came to mind.<br/><br/>He’d never before seen a person clinging onto life with such feeble energy.<br/><br/>Even someone on the brink of death wouldn’t have energy levels as low as this.<br/><br/>It’s actually still capable of mental clarity.<br/><br/>Truly miraculous.<br/><br/>Su Ningyan said, “I want to know, how to become a Celestial Being.”<br/><br/>The mummified body said, “You just need to progress step by step. Assuming no accidents, in twenty years, find a pocket dimension, comprehend the Way of Heaven’s law of that realm, and when the time is right, you will naturally break through to the Celestial Being realm.”<br/><br/>Su Ningyan asked again, “Why must it be in a pocket dimension?”<br/><br/>The mummy replied, “That’s your second question!”<br/><br/>At this point, Gu Yang chimed in, “I know this one. Because, the Heavenly Dao of this realm is dead.”<br/><br/>The Heavenly Dao is dead?<br/><br/>Su Ningyan’s heart startled, her eyebrows furrowed as if harboring a great puzzlement.<br/><br/>“Huh?”<br/><br/>It seemed the mummy had just noticed his presence, turning its head towards him, he let out a faint “Huh?” “What’s your relationship with that kid named Xia?”<br/><br/>Gu Yang felt a chill in his heart, asking, “Is the Xia you mentioned the Xia Emperor?”<br/><br/>“A Celestial Being, yet he dares to call himself an Emperor?”<br/><br/>There was a trace of ridicule in the mummy’s voice, “You’re decent in practicing the ‘Nine Heavens Divine Method’, you’re more talented than the Xia boy.”<br/><br/>Seeing it brag so unabashedly, Gu Yang started to wonder if this thing was genuinely impressive, or just bluffing.<br/><br/>The mummy asked, “Boy, do you have any questions you want to ask?”<br/><br/>“I have no Monster Dan.”<br/><br/>“No problem, you can use your Divine Beast incarnations as a trade, four incarnations, for four questions.”<br/><br/>Gu Yang’s scalp began to tingle, this fellow really had a few tricks up his sleeve, seeing through his four Divine Beast incarnations in one glance.<br/><br/>Generally, his Divine Beast incarnations were kept inside his body, and as far as he knew, no one should have been able to discern that.<br/><br/>Finally, he understood why this character was never mentioned in the simulation.<br/><br/>Because in the simulation, he would definitely not be willing to give up a Divine Beast Incarnation for a question.<br/><br/>“Whether you want to know the secrets of ancient times, or have questions about cultivation methods, or want to know how to break through bottlenecks, I can help you with all these.”<br/><br/>“If one day, you advance your incarnation to the Nascent Soul stage. I can even teach you an ultimate technique. The ‘Nine Heavens Divine Method’ you are practicing, was traded by Xia lad from here.”<br/><br/>“There is also a boy named Qin, who traded the ‘Great Sun Scripture’ from here. As for this lass who practices the ‘Dragon Emperor Extreme Path’, it was traded by a Zhou lad from me.”<br/><br/>What?<br/><br/>Gu Yang was a bit shocked. The ‘Nine Heavens Divine Method’ was actually traded from him by the Xia Emperor?<br/><br/>And the ‘Great Sun Scripture’, that’s the Qi Empire’s royal family technique.<br/><br/>The ‘Dragon Emperor Extreme Path’ is the Zhao Family’s current royal family’s secret technique.<br/><br/>Just who the hell is this guy?<br/><br/>The mummy continued, “The technique you are practicing is clearly a Monster Race cultivation method from the ancient times. It’s not suitable for this era, logically speaking, you shouldn’t have been able to reach the Divine Power realm. You are indeed an anomaly.”<br/><br/>“Wait until one day you advance your Divine Beast incarnation to the Nascent Soul stage, for an incarnation, I can help you revise it into a martial arts technique suitable for this era.”<br/><br/>Looking at him, Gu Yang felt numb.<br/><br/>What kind of monster is this?<br/><br/>Since entering, he has not shown his own mana, yet all his secrets have been laid out.<br/><br/>Even the shortcomings in his training method were picked out.<br/><br/>At this moment, he felt as though he had been stripped nude, all his secrets exposed.<br/><br/>No, there’s still something he hasn’t figured out.<br/><br/>The Life Simulator!<br/><br/>Thinking of his greatest advantage, Gu Yang settled his heart.<br/><br/>As long as the simulator isn’t exposed, there’s no problem.<br/><br/>Just then, the mummy spoke, “When you’ve decided, come find me.”<br/><br/>“There’s no need.”<br/><br/>Gu Yang stopped him and said, “Let’s settle on this. One incarnation for one question.”<br/><br/>The mummy’s tone became a lot cheerier, “I like straightforward people like you, let’s do it. Release your incarnation into the cauldron.”<br/><br/>A Black Tortoise flew out from Gu Yang’s forehead and fell into the cauldron.<br/><br/>In an instant, he lost contact with the Black Tortoise incarnation.<br/><br/>The cauldron let off a faint black glow.<br/><br/>Gu Yang said, “The first question, how did the Heavenly Dao die?”\t\t\t\t\t\t</div>", "images": {}, "success": true}