{"id": 270, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132142.html", "title": "Chapter 270 - Chapter 270: 270 Mana Triple Heaven", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 270 - Chapter 270: 270 Mana Triple Heaven</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 270: 270 Mana Triple Heaven<br/><br/>[…A major battle royale took place, and eventually, an unknown Unleaking Realm powerhouse survived till the end and seized the Human Emperor’s sword. He was about to kill you all to eliminate the witnesses when a force awakened within Chu Xiyue, severely injuring him. He used the Human Emperor’s sword to tear open space and flee, disappearing without a trace. ]<br/><br/>[You and Chu Xiyue continue to cultivate arduously within the Cold Moon Immortal Palace.]<br/><br/>[Five years later, Chu Xiyue steps into the Mana Realm.]<br/><br/>[Another ten years later, Chu Xiyue steps into the Unleaking Realm.]<br/><br/>[One day, the space tears open, and the Unleaking Realm powerhouse who wields the Human Emperor’s sword appears. You and Chu Xiyue join forces; eventually, all three of you perish together. You died at the age of thirty-seven. ]<br/><br/>Success!<br/><br/>Gu Yang’s heart brims with joy, having finally found a way out of this gridlock.<br/><br/>He had refrained from unlocking the secret realm of the Human Emperor’s sword, and indeed, at a critical moment, it was able to save his life.<br/><br/>Truth be told, that Unleaking Realm powerhouse from the Xia Dynasty had saved him many times.<br/><br/>However, the final battle among the five Unleaking Realm powerhouses within the Cold Moon Immortal Palace resulted in the deaths of four, illustrating just how fraught the situation was.<br/><br/>He didn’t know who came out as the final victor.<br/><br/>This person returned for a killing spree fifteen years later, most likely mastering some of the powers of the Human Emperor’s sword, managing to die alongside him and Chu Xiyue.<br/><br/>[Simulation over. You can retain one of the following.]<br/><br/>[One, martial arts realm at the age of thirty-seven.]<br/><br/>[Two, martial arts experience at the age of thirty-seven.]<br/><br/>[Three, life wisdom at the age of thirty-seven.]<br/><br/>“I choose the first one.”<br/><br/>Inside the Qi Feng Pavilion, the candlelight is bright.<br/><br/>Su Ningyan is still sitting at the table, looking at the brass mirror, her expression somewhat melancholic.<br/><br/>This mirror is called the Split-light Mirror. It consists of a mother mirror and nine subsidiary mirrors.<br/><br/>No matter how far apart they are, the mother mirror and subsidiary mirrors can relay information in real time.<br/><br/>Previously, when she was at the Duke’s mansion and “older sister” was at the palace, they communicated through this mirror.<br/><br/>Now, the mirror remains, but the person is no longer there.<br/><br/>The relationship between her and “older sister” is not as simple as that between an embodiment and its external form.<br/><br/>When she was young, she accidentally stumbled into an ancient Immortal’s cave dwelling.<br/><br/>There, she obtained a dragon pearl and a method to cultivate an external incarnation.<br/><br/>Being young and naive, she found it intriguing and began practicing.<br/><br/>Ordinarily, one must be in the Mana Realm to successfully practice the externality technique. Yet, her extraordinary talent allowed her to succeed even in a muddled state, truly creating an external incarnation.<br/><br/>However, her original spirit was too weak to control two physical bodies simultaneously. Soon, the external incarnation developed self-awareness, an independent personality, and became her “older sister”.<br/><br/>Later, they met a woman and accepted her as their master.<br/><br/>Their master wanted them to enter the palace to find a certain item.<br/><br/>Bold and unwilling to lead an ordinary life, the “older sister” volunteered to enter the palace, and by a twist of fate, she became the empress.<br/><br/>Their destinies underwent a dramatic change from that point onwards.<br/><br/>As their cultivation levels rose, they understood that they originated from the same entity and that they would inevitably have to face each other one day, whether one of them succumbed to the other or vice versa.<br/><br/>The victor would swallow the whole of the defeated, merging back into one.<br/><br/>This was why they had flawless teamwork, yet faced each other like enemies whenever they met.<br/><br/>In the end, as the main body, Su Ningyan won this victory, inheriting everything from her “older sister” and, with the help of the dragon pearl, directly stepped into the Mana Realm.<br/><br/>She abandoned her identity as Miss Su Er and became the empress, inheriting “older sister’s” aspirations.<br/><br/>Now, the brass mirror remains, yet the person has passed.<br/><br/>“Rest assured, I will retain the Great Zhou’s territories for you. I will also win over the man you desired…”<br/><br/>Su Ningyan murmured, her expression suddenly changing as she turned to look in a certain direction.<br/><br/>“What’s this…”<br/><br/>In that direction resided Gu Yang, whose aura was suddenly skyrocketing.<br/><br/>After a while, his aura soared again.<br/><br/>Once, twice, three times…<br/><br/>Su Ningyan’s expression went from surprise to astonishment and then to dullness.<br/><br/>All that she could think about at that time was: So, this is how he cultivates?<br/><br/>No wonder his progress is so rapid. His progress in a few breaths’ time is equivalent to others’ painstaking efforts over several years. It’s like, he’s quite literally flying.<br/><br/>The thirteenth simulation.<br/><br/>[…You break through to the third level of the Mana Realm.]<br/><br/>Upon seeing that message, Gu Yang was overjoyed. He had finally reached the Third Heaven of Mana.<br/><br/>It was just too difficult to achieve!<br/><br/>His training of the “Nine Heavens Divine Method,” had progressed to the sixth level of God Refining, fifth level of Dragon Divine Law, and fifth level of Candle Divine Law.<br/><br/>[Simulation concludes; you may retain one of the following:]<br/><br/>[One — Martial Arts Realm at age thirty-seven.]<br/><br/>[Two — Martial Arts experience at age thirty-seven.]<br/><br/>[Three — Life wisdom at age thirty-seven.]<br/><br/>“I choose One.”<br/><br/>Boom!<br/><br/>A colossal phoenix’s phantom appeared in the sky. The worldly vitality gathered from all directions, forming a massive vortex, pouring into his body.<br/><br/>Within a peculiar space atop the Star Picking Pavilion in the Literary Academy.<br/><br/>In the courtyard, a middle-aged man in blue lay reclining on a lounge chair, still immersed in his book.<br/><br/>Suddenly, he stopped shaking his foot and looked up towards the distance. A touch of puzzlement appeared on his face. “What kind of secrets is this guy hiding, anyway?”<br/><br/>Inside the Everlasting Hall of the Duke’s mansion.<br/><br/>A burly old man looked up towards the palace, a bitter smile appearing on his face.<br/><br/>He addressed the purple, incessantly trembling Divine Sword placed in the center, saying, “You can see it too; his mana has reached the Third Heaven, and he’s got that woman supporting him as well. I’m afraid avenging the murder of the emperor will be impossible now.”<br/><br/>The attention-grabbing bloodstain on Lord of the State’s Sword seemed to have expanded a little, trembling even more violently.<br/><br/>The old man’s face also shadowed a bit.<br/><br/>He shared his fortunes and miseries with the Lord of the State’s Sword.<br/><br/>The harm done to the Lord of the State’s Sword was being reciprocated onto him.<br/><br/>A deep sigh echoed inside the Everlasting Hall.<br/><br/>Nowadays, the Great Zhou was under the control of a woman who managed the court affairs. Furthermore, the murderer of the emperor was openly living in the palace…<br/><br/>It was indeed a situation signaling the end of the dynasty.<br/><br/>Inside a normal loft in a mysterious Red Mansion.<br/><br/>A grey-clad person sat on a straw mat, still like a sculpture, seemingly devoid of any signs of life.<br/><br/>Suddenly, he moved his head and changed his direction. A hint of liveliness appeared in his dull eyes and his lips moved.<br/><br/>A faint whisper resounded in the loft, “Gu Yang…”<br/><br/>Outside Divine City, on a peak, a man in black sat on the mountaintop. He seemed to have completely merged with the darkness, and outsiders could hardly sense his presence.<br/><br/>Suddenly, he opened his eyes, looking towards Divine City, a cold gleam in his eyes.<br/><br/>Afterwards, he closed his eyes again, completely disappearing from sight.<br/><br/>The entire Divine City was disturbed by the anomaly in the sky. The common folks were all abuzz with discussions.<br/><br/>Warriors at the Mortal Realm were excited and thrilled by the divine-like spectacle before them.<br/><br/>Only warriors above the Divine Power Realm could sense how terrifying that force was.<br/><br/>“Gu Yang!”<br/><br/>Almost everyone had this name crossing their minds at the same time.<br/><br/>Everyone knew that Gu Yang practiced the “Phoenix Dance Nine Heavens.”<br/><br/>At this moment, upon seeing the colossal phoenix in the sky, it was natural to guess that the individual undergoing the breakthrough was him.<br/><br/>He had actually advanced to the Third Heaven of Mana!<br/><br/>This felt like a dream.<br/><br/>When was the last time he broke through to First Rank? It has been less than a year, hasn’t it?<br/><br/>In less than a year, he had risen from the First Rank to Third Heaven of Mana!<br/><br/>Before this, no matter how imaginative a person was, they would not dare to think of such a possibility.<br/><br/>From this point on, this man would stand at the pinnacle of the world.<br/><br/>Beyond that, would be the domain of the immortals.<br/><br/>Gu Yang withdrew his Mana, causing the anomaly in the sky to vanish.<br/><br/>This time, his chances of dealing with Shen Yun increased, ensuring he wasn’t on the backfoot like before.\t\t\t\t\t\t</div>", "images": {}, "success": true}