{"id": 277, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132155.html", "title": "Chapter 277 - Chapter 277: 277 Shearing The Sheep (Third Update Request For Monthly Ticket)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 277 - Chapter 277: 277 Shearing The Sheep (Third Update Request For Monthly Ticket)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 277: 277 Shearing the Sheep (Third update request for monthly ticket)<br/><br/>“[Simulation end. You may retain one of the following.]<br/><br/>[One: The martial arts realm at age 35.]<br/><br/>[Two: The martial arts experience at age 35.]<br/><br/>[Three: The life wisdom at age 35.]<br/><br/>“I choose two first.”<br/><br/>Gu Yang’s head was struck with a sudden understanding, grasping a Blade Intent capable of causing both the mortal body and original spirit’s demise.<br/><br/>The fourth technique of the Six Heavenly Annihilations, Celestial Being Destruction!<br/><br/>The Celestial Being mentioned in this technique was not just the Celestial Being realm, but representative of those who had transcended the mundane and stepped into the divine realm.<br/><br/>In the martial arts realm, the Mortal Realm was one level, belonging to the human realm.<br/><br/>The Divine Power realm, on the other hand, was the starting point of cultivation. The Golden Body, Mana, and Unleaking realms were three stages within it, individuals in this realm could be referred to as cultivators.<br/><br/>Yet reaching the Celestial Being realm was again another level, signifying that one had achieved the divine realm.<br/><br/>The Celestial Being realm further divided into three stages, the Dharma Appearance realm, Hollow Void realm, and Heavenward realm.<br/><br/>In ancient times, this realm was also known as the Human Immortal realm.<br/><br/>This move of Celestial Being Destruction could not only overcome Celestial Beings, those beyond the Celestial Being realm would also be affected by the Blade Intent.<br/><br/>However, at his current realm, using this saber technique would come at an immense cost.<br/><br/>his mortal body wouldn’t be able to withstand such destructive Blade Intent and would collapse immediately.<br/><br/>Gu Yang opened his eyes, a grayish light flashing across them.<br/><br/>The sight of that gray light in his eyes startled Ling Ling at his side, her heart pounding and almost sweating in fear. She called out in a terrified voice, “Gu Yang”<br/><br/>The light in Gu Yang’s eyes faded, and he patted her hand, saying, “I’m fine.”<br/><br/>He opened the simulator again.<br/><br/>[Do you want to use the Life Simulator? Each use consumes forty points of energy.]<br/><br/>“Yes.”<br/><br/>[… You launch the Celestial Being Destruction, killing Red Sun on the spot. You break out of the Demon Suppression Tower.]<br/><br/>[The Demon Suppression Tower flies away of its own accord; you are severely injured, and Ling Ling and Pei Qianlan take you towards Liangzhou, to enter the Golden Court Heavenly Cave.]<br/><br/>[You live incognito in Heavenly Gang Mountain, and after three years, your body begins to gradually recover.]<br/><br/>[One day, Saint Chao Yang bursts into the Golden Court Heavenly Cave and takes you away. In the Heavenly Peach Garden, she gives you a spirit fruit, which heals your wounds and propels your cultivation level. Afterwards, you are forced to inject your mana into a stone egg.]<br/><br/>[One year later, you die drained of your core energy. You were twenty-six years old.]<br/><br/>This time, how did Saint Chaoyang track him down?<br/><br/>Gu Yang was somewhat perplexed, for during the last simulation, Saint Chaoyang had not appeared.<br/><br/>Could it be that she was wary of the ruler of Golden Court?<br/><br/>He speculated in his mind.<br/><br/>Furthermore, this Saint Chaoyang went as far as taking out a spirit fruit to heal his injuries. No, she restored him to his prime and had him inject his mana into the egg.<br/><br/>Gu Yang was acutely aware of an issue.<br/><br/>It stood to reason that the more potent his power, the greater the chances of Phoenix’s resurrection.<br/><br/>If Saint Chaoyang had such a beneficial item, why didn’t she simply feed him the Spirit Fruit earlier, pushing his cultivation level directly to the Unleaking Realm?<br/><br/>That way, the chances of reviving Phoenix would be greater, right?<br/><br/>He had a nagging feeling that something was amiss.<br/><br/>“[Simulation end. You may retain one of the following.]<br/><br/>“I choose one.”<br/><br/>He didn’t hesitate and made his choice.<br/><br/>In an instant, Gu Yang’s mana began to surge, even causing it to overflow, almost knocking Ling Ling standing next to him off her feet. It wasn’t until she was sent flying a hundred meters away did she finally stop.<br/><br/>She had seen such scenes before, but it was her first time encountering such a massive increase.<br/><br/>It was then that Ling Ling truly fathomed the huge gap between herself and him.<br/><br/>Just the surge of mana this time surpassed the total amount of her True Essence.<br/><br/>A sense of bitterness filled her heart.<br/><br/>She had racked her brain, even leading him into such dangers to break through to the Divine Power realm, believing that it would close the gap between them. Who knew that with a single advancement, he erased all her efforts.<br/><br/>She knew that in this lifetime, he would only pull further and further away from her.<br/><br/>After a while, Gu Yang finally opened his eyes, feeling the surging mana within him, he was slightly astonished.<br/><br/>“It almost increased by 10%!”<br/><br/>What did this mean? His current mana was robust enough to rival someone like Red Sun at the first level of the Unleaking Realm.<br/><br/>The amount of mana increased this time almost equaled a martial artist with the first level of mana.<br/><br/>He only lived for four more years this time around.<br/><br/>Even after using Celestial Being Destruction, and despite his power diminishing greatly, he could still achieve such growth thanks to the Spirit Fruit that Saint Chaoyang gave him.<br/><br/>One single Spirit Fruit had such an effect.<br/><br/>Could it be the lotus seed of Green Lotus that the mysterious person beneath the Royal Palace mentioned, which could cure the Headmaster of the Wen Institute?<br/><br/>If that’s the case….<br/><br/>Gu Yang immediately opened the simulator and initiated another simulation.<br/><br/>“[…You executed the Celestial Being’s Demise, defeating the Red Sun…]<br/><br/>“[…Saint Chao Yang took you to the Heavenly Peach Garden and had you consume a Spirit Fruit…]<br/><br/>“[… reaching the age of twenty-six years.]<br/><br/>The outcome of this simulation was identical to the previous one.<br/><br/>He intended to fleece Saint Chao Yang.<br/><br/>“[Simulation ends…]<br/><br/>Gu Yang experienced the thrill of soaring Mana once again.<br/><br/>He sighed inwardly, this was his first time consuming an elixir and a Spirit Fruit, allowing his strength to rocket upwards, being able to run the simulation over and over again.<br/><br/>That was indeed not an easy feat.<br/><br/>Previously, he had missed the opportunity when Xi Huang gave him a drop of Essence Blood. This time, he was able to seize it in the nick of time.<br/><br/>The effect of the second attempt was not even half as potent as the first one, but nevertheless, it was quite impressive. It was at least equivalent to several decades of arduous cultivation.<br/><br/>“One more round!”<br/><br/>On the ninth floor of the Demon Suppression Tower, Red Sun stood at the exit, waiting for Gu Yang’s arrival.<br/><br/>Each ascent in the Demon Suppression Tower resulted in an increase in suppression power.<br/><br/>The ninth level, with the most powerful suppression, was where he could play to his strengths the best, and he had chosen it as his battlefield.<br/><br/>Being the master of the Demon Suppression Tower, he could sense the situation on each level.<br/><br/>Gu Yang had climbed upward but stopped at the eighth level.<br/><br/>However, the Red Sun was not anxious at all. The Demon Suppression Tower of today was far superior to that of the past.<br/><br/>After the divine ruler had reprocessed the Demon Suppression Tower, it had finally become a magical artifact.<br/><br/>Originally, it only had suppression power over the Monster Race.<br/><br/>Now, it also had suppression power over human martial artists, and the consumed mana could not be replenished here.<br/><br/>The longer Gu Yang stayed, the more drastically his strength would be reduced.<br/><br/>Red Sun knew that last time, Gu Yang had ruined the divine ruler’s plan, and the divine ruler had wanted to kill him.<br/><br/>This time, if he could kill this youngster, he would certainly be rewarded by the divine ruler.<br/><br/>With this thought in mind, his heart was aflame.<br/><br/>If the divine ruler bestowed divine grace upon him again, he might be able to ascend to the second level of the Unleaking Realm.<br/><br/>“Huh?”<br/><br/>Just as Red Sun was indulged in his thoughts, his face underwent a sudden change. “How is this possible?”<br/><br/>He suddenly felt Gu Yang’s aura skyrocketing, his strength soaring.<br/><br/>“What the hell happened?”<br/><br/>He was stupefied.<br/><br/>He couldn’t, no matter how he tried, understand how Gu Yang had mysteriously grown much stronger in such an environment.<br/><br/>Could it be that, on the eighth floor, there’s a spirit pill left by an ancient cultivator?<br/><br/>While Red Sun was in shock, Gu Yang’s aura rose dramatically once more.<br/><br/>“This”<br/><br/>He was dumbfounded.<br/><br/>In a short while, Gu Yang’s aura surged for the third time.<br/><br/>Is there more to come?<br/><br/>A chill ran down Red Sun’s spine.<br/><br/>No matter what, he couldn’t comprehend why, in the Demon Suppression Tower, Gu Yang’s strength could increase over and over, incessantly and out of the blue?<br/><br/>Just when Red Sun assumed that Gu Yang would directly break through to the Unleaking Realm in this way, he finally made a move towards the passageway of the eighth floor.<br/><br/>Finally over?<br/><br/>Red Sun was slightly suspicious.<br/><br/>For a brief moment, he was considering fleeing as far away as possible.<br/><br/>Who could stand this?<br/><br/>A total of six times!<br/><br/>Gu Yang’s mana had almost doubled.<br/><br/>All within less than a quarter of an hour.<br/><br/>A few more times, and he really could directly step into the Unleaking Realm.<br/><br/>“His accumulation must not have been enough.”<br/><br/>Red Sun was relieved. As long as he hadn’t reached the Unleaking Realm, Red Sun had a great chance of victory.<br/><br/>There was a fundamental difference between the Unleaking Realm and the Mana Realm.<br/><br/>Moreover, he was the master of the Demon Suppression Tower and could take advantage of a portion of this invaluable relic’s power.<br/><br/>As he was contemplating, Gu Yang’s figure appeared.<br/><br/>PS: Seeking monthly passes.\t\t\t\t\t\t</div>", "images": {}, "success": true}