{"id": 273, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132148.html", "title": "Chapter 273 - Chapter 273: 273 Shen Yun", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 273 - Chapter 273: 273 Shen Yun</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 273: 273 Shen Yun<br/><br/>That day, Gu Yang and Pei Qianlan settled down at the academy.<br/><br/>The ancestor of the Shen Family was indeed very cautious. Even facing him, who was at the mana realm, he was unwilling to take any risks.<br/><br/>He had already left the palace, yet the old fellow hadn’t made a move.<br/><br/>It seemed that unless he left Divine City, the other party would not take action.<br/><br/>However, upon reflection, this old ghost had lived for thousands of years, most of which were spent within the clan. It was clear that he possessed immense patience.<br/><br/>Gu Yang had two more opportunities for a simulation, which were vital for emergencies. They can’t be used recklessly.<br/><br/>At night, he borrowed a secret sword technique manual from the academy’s library and started learning the sword technique from scratch.<br/><br/>In order to borrow books from the library, he even joined the academy and became a visiting professor to get borrowing rights.<br/><br/>Given his martial arts cultivation level, even if he switched to learning the sword technique, he would pick it up quickly.<br/><br/>During his time in the mortal realm, he had dabbled in sword techniques, just not as proficient. After reaching the third rank, he mainly trained in saber techniques.<br/><br/>The night passed without incident.<br/><br/>The next morning, as Gu Yang and Pei Qianlan were leaving the academy’s gate in a carriage, Wu Er jumped on board, saying, “It’s done. We should leave for Yunzhou now. We only have half a day.”<br/><br/>Gu Yang didn’t ask how he arranged this. He disembarked the carriage, took the two of them, and flew off towards the north.<br/><br/>Outside Divine City, within a mountain peak.<br/><br/>In the early morning, the sun had just risen from the horizon, its golden light shining on a mountain peak, yet it casted a shadow.<br/><br/>“Sword Palace?”<br/><br/>Suddenly, an age-old voice came from the shadow, “Why do you block my way?”<br/><br/>“Favors.”<br/><br/>A cold voice echoed from the bottom of the mountain, colder than the wind on the peak. After a while, the person added two more words, “Half a day.”<br/><br/>Meaning he owed someone a favor, and was here to delay him for half a day.<br/><br/>“Very well.”<br/><br/>In the shadow, the age-old voice turned cold, “I’ll remember this.”<br/><br/>Then, no more voices were heard.<br/><br/>After Gu Yang flew out of Divine City, he couldn’t help but admire how far-reaching Wu Er’s connections were. There was no chase for a long time.<br/><br/>He didn’t know where Wu Er had found someone who could hold back Shen Yun, a powerful figure of the Unleaking realm.<br/><br/>Last time, Wu Er could even get Cao Kunpeng, the Spear Saint, to give him face.<br/><br/>Yunzhou was neighboring to Divine City. Two hours later, the Vast Mountain was already in sight.<br/><br/>To avoid alarming the enemy, Gu Yang first landed in a forest.<br/><br/>He asked, “Are there any other experts in the Red Venerate Sect?”<br/><br/>Wu Er replied, “Just one, Red Sun, he’s also in the Unleaking realm but isn’t currently at the Sect’s gateway. However, be careful of that one.”<br/><br/>Gu Yang shook his head, “No need to worry, he won’t make a move.”<br/><br/>Ever since he was marked by Saint Chaoyang of the Three Saints Sect, that character from Red Sun didn’t make a move against him.<br/><br/>He even suspected that if it knew Saint Chaoyang was going to deal with him, it wouldn’t waste its energy on him anymore.<br/><br/>If that were true, then this old monster was more terrifying than he thought.<br/><br/>This meant he was extremely rational, not blinded by hatred. Moreover, his information sources were vast. Even Saint Chaoyang’s activities couldn’t escape his attention.<br/><br/>As expected, at this level, each of his enemies was not easy to deal with.<br/><br/>Gu Yang and the others flew towards the direction of Vast Mountain.<br/><br/>He asked Wu Er, “How strong is Shen Yun?”<br/><br/>Wu Er replied, “He can withstand my two attacks.”<br/><br/>“Be more specific.”<br/><br/>“A hundred years ago, he had just taken the second step.”<br/><br/>Unleaking realm, alike, was divided into three levels. The first step involved unleashing the human body’s hidden potential, activating all its potential. This allowed the body to contain a vast amount of mana.<br/><br/>The second step is to form a bridge between the hidden human body and the acupoints all over the body, forming an inner universe. The mana one can hold increases more than tenfold.<br/><br/>The third is the amalgamation of the original spirit into every drop of blood, even each cell. The efficiency of converting life force into mana greatly enhances.<br/><br/>In layman’s words, this stage entails tapping into one’s potential, much like the legendary rebirth from a single drop of blood.<br/><br/>Unfortunately, due to the change in the laws of the universe, even if one’s physical body is cultivated to such an extent, one cannot gain energy from the universe. With the last drop of blood, at most, the Original Spirit can only exist for a short period.<br/><br/>When the power in the blood dissipates, the Original Spirit will naturally perish.<br/><br/>Shen Yun is at the second stage. His cultured body alone is incredibly strong, and with a substantial amount of mana, even Gu Yang might not have been his match if he hadn’t planned to capture Shen Yun alive.<br/><br/>Wu Er continued, “Shen Yun is an incredibly cunning man. He used to serve one of the senior saints of the Three Saints Sect. Because of his human identity, he was assigned to the human realm.”<br/><br/>“The technique he cultivates, the ‘Taiyou Moon Devouring Technique’, is incredibly damaging. Two cultivators of the same technique can devour each other, consuming the other’s power and even life force to strengthen themselves.”<br/><br/>At this point, his tone turned noticeably disgusted.<br/><br/>“Upon his arrival in the human realm, Shen Yun purposely disseminated this technique. Many uninformed practitioners thought they got lucky only to end up benefiting him.”<br/><br/>“After this incident was exposed, he created the Shen Family and took many wives, having numerous children. He passed on the ‘Taiyou Moon Devouring Technique’ to his children, forcing them to fight among themselves, until one reaches the Divine Power realm.”<br/><br/>“Only those who cultivate the ‘Phoenix Dance Nine Heavens’ can escape.”<br/><br/>“His aim was to cultivate an Unleaking Realm practitioner through this breeding method and devour them. He was initially close to succeeding.”<br/><br/>“It took him a thousand years to cultivate Shen Zhou who had a mana triple heaven cultivation level. Such a pity you killed him. How could he swallow that?”<br/><br/>In the end, Wu Er sounded somewhat delighted.<br/><br/>Gu Yang had heard how Shen Yun had been devouring life sources from the principal of the academy yesterday. He had assumed it resembled the Heavenly Extreme Divine Technique.<br/><br/>Now, it seems the ‘Taiyou Moon Devouring Technique’ is not as strong as the Heavenly Extreme Divine Technique, but Shen Yun getting the idea to extend it to his descendants is utterly abhorrent.<br/><br/>Comparatively, the emperor who was manipulated by the Heavenly Extreme Taoist, and even devoured his son, is just as bad.<br/><br/>In the end, Wu Er said, “Shen Yun only bullies those with a lower realm than him. Once you reach the Unleaking realm, whether it’s the Nine Celestial Swords or the Nine Heavens Destroyer, you could easily defeat him.”<br/><br/>Easy for him to say.<br/><br/>Gu Yang asked, “What about his master behind the scenes? How do we deal with the three Celestial Beings from the Three Saints Sect?”<br/><br/>Wu Er’s face immediately changed upon hearing this. He had been personally defeated by one of them. He has no resistance against Celestial Beings.<br/><br/>The strength of a Celestial Being is incomparable to that of an Unleaking Realm.<br/><br/>“Don’t worry, they wouldn’t dare to come down to this world casually. The higher the realm, the faster life force drains. That’s why the Celestial Beings from the Four Great Sacred Lands rarely descend.”<br/><br/>Gu Yang asked, “Were you, too, ambushed by one of them back then?”<br/><br/>Wu Er’s voice turned cold, “Back then, I was always on guard against that one from the Red Sun Sect. I didn’t expect the one to strike would be that scum from the Three Saints Sect!”<br/><br/>Gu Yang’s gaze shifted.<br/><br/>This means the Three Saints Sect and the Red Sun Sect had teamed up long ago.<br/><br/>Compared to the other two sacred sites, their presence is much lower.<br/><br/>He asked, “Is it Shen Yun’s master?”<br/><br/>“It’s the one behind the Guo Family. She is now in the Saber Tomb.”<br/><br/>Saber Tomb?<br/><br/>Gu Yang resolved a long-standing question. During a simulation, he and Ling Ling had ventured to the Saber Tomb and stirred up a formidable figure, who turned out to be a member of the Three Saints Sect.<br/><br/>He asked, “Who’s the other one?”<br/><br/>There were three Celestial Beings in the Three Saints Sect, and this was just two of them, there was still one more.<br/><br/>“The other one from the Three Saints Sect only appeared once during the siege of the Xia Emperor and has not shown up since.”<br/><br/>“Do they support any forces?”<br/><br/>“It should be the Luo Family.”<br/><br/>So it’s the Luo Family.<br/><br/>This family does have a relationship with Gu Yang; his “daughter” is half-blooded Luo.<br/><br/>“Not good!”<br/><br/>At that moment, Wu Er’s face changed, “Red Sun is back!”<br/><br/>Almost simultaneously, Gu Yang sensed an overwhelming aura descending onto Wuliang Mountain with breathtaking speed.\t\t\t\t\t\t</div>", "images": {}, "success": true}