{"id": 276, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132153.html", "title": "Chapter 276 - Chapter 276: 276 Celestial Being Corpse", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 276 - Chapter 276: 276 Celestial Being Corpse</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 276: 276 Celestial Being Corpse<br/><br/>Once Gu Yang entered the Demon Suppression Tower, he immediately broke free from that binding power, grabbed Ling Ling by the hand, and landed on the ground.<br/><br/>This was the first floor of the Demon Suppression Tower.<br/><br/>At a glance, he realized things seemed to have changed.<br/><br/>The light became dimmer.<br/><br/>The oppressive atmosphere in the air intensified, the invisible suppressing force was several times stronger than before.<br/><br/>He asked Ling Ling, “Are you alright?”<br/><br/>Ling Ling shook her head, her face slightly pale.<br/><br/>She was also being suppressed and could only resist by activating her True Essence. This accelerated the loss of her True Essence.<br/><br/>The Demon Suppression Tower at this moment was like the Hollow Void of Yellow Springs: the nature of the Vitality between heaven and earth had changed, which could harm the human body.<br/><br/>This was a very disadvantageous environment for warriors.<br/><br/>Her face solemn, she said, “Why has the Demon Suppression Tower changed like this? Humans shouldn’t be suppressed when they enter.”<br/><br/>“It has been re-ritualized.”<br/><br/>Gu Yang felt somewhat heavy-hearted. Judging by the environment within the Demon Suppression Tower, he could deduce that the figure of Red Sun’s world had become stronger.<br/><br/>Maybe, after the battle with the Academy head that year, the exhausted power had been restored.<br/><br/>This was not good news.<br/><br/>He and the Red Sun person had a grievance, a feud where neither could live while the other survives.<br/><br/>He didn’t want to be enemies with the other party, but the problem was that they were unwilling to let him go. He had no choice but to face it head-on.<br/><br/>“Let’s go.”<br/><br/>Suddenly, Gu Yang felt the pressure within the Demon Suppression Tower increase again. Without further hesitation, he held Ling Ling’s hand and flew toward the formation leading to the second level.<br/><br/>The guardian was still a Soul Spirit with a Golden Body, but its strength was several times stronger than the previous Soul Spirit.<br/><br/>Gu Yang casually slew it with a single stroke of his sword.<br/><br/>[Receive one point of energy. Current balance is forty-six points.]<br/><br/>In this way, Gu Yang had fought his way to the eighth level of the Demon Suppression Tower.<br/><br/>The second level had two Soul Spirits with a Golden Body.<br/><br/>The third level had a Soul Spirit with a two-fold Golden Body, the fourth level had two.<br/><br/>By the seventh level, it was the elementary Mana stage.<br/><br/>Compared to before, the difficulty level had increased significantly.<br/><br/>After reaching the eighth level, Gu Yang didn’t rush to confront the level; instead, he began to search for something.<br/><br/>“Su Ningyan said there’s a corpse of a Grand Demon Saint of the Monster Race here…”<br/><br/>The reason he had engaged in a protracted battle with Red Sun was simply to wait for the other party to put him in the Demon Suppression Tower, all for this Celestial Being-level corpse.<br/><br/>Soon, he saw a particularly large corpse not far away. His heart rejoiced, “Found it!”<br/><br/>Judging by the shape of the corpse, it was clearly some kind of bird. Most likely it was the last Demon Saint of the Xia Dynasty, the Divine Chicken Saint.<br/><br/>He landed in front of the corpse and said, “We share some kinship in terms of bloodline, so don’t take offence to me borrowing your corpse.”<br/><br/>As he spoke, he placed his hand on the corpse.<br/><br/>[Energy Source detected. Recharge?]<br/><br/>“Yes.”<br/><br/>The corpse on the ground instantly vanished.<br/><br/>[Successful recharge, you have gained five hundred energy points. Current balance is five hundred and fifty-eight points.]<br/><br/>Five hundred points!<br/><br/>Gu Yang was struck by immense joy. His meticulous planning hadn’t been in vain.<br/><br/>Last time, in the Water Moon Cave, he had killed six Golden Core stage Cultivators and two Nascent Soul stage ones, gaining just over four hundred energy points.<br/><br/>Now, he didn’t even need to fight, a single corpse was worth five hundred points, which could be considered free money.<br/><br/>Ling Ling, who was by his side, remarked, “Hey, there’s another human corpse beneath.”<br/><br/>Gu Yang looked over, and sure enough, there was another corpse. Judging by the decay of the corpse, it hadn’t been long since death occurred.<br/><br/>He charged it up without thinking.<br/><br/>[Recharge successful, two hundred and fifty energy points obtained, current balance is eight hundred and eight points.]<br/><br/>Over two hundred points, proving that this was a strong contender at the third level of the Unleaking Realm!<br/><br/>Gu Yang was surprised. Why would such a powerful figure have died here in the Demon Suppression Tower?<br/><br/>They were the strongest existence beneath the Celestial Beings.<br/><br/>Even among the old monsters of the Nine Clans and Six Great Sects, there were few who had achieved such a Cultivation Level.<br/><br/>Over hundreds of years, there had only been one Unleaking Realm cultivator killed, that was an old ancestor of the Wu Family, and the other one was the previous head of the Dao Sect.<br/><br/>“Could it be, this is the head of the Dao Sect?”<br/><br/>Ling Ling who was by his side suddenly said, “I know who she is.”<br/><br/>“Who?”<br/><br/>“My master once said that there was a person hidden in the Demon Suppression Tower, a disciple of the Blue Sky Palace.”<br/><br/>Ling Ling’s master was Wen Jue, the current head of the Dao Sect.<br/><br/>Gu Yang had an epiphany, suddenly understanding everything.<br/><br/>He remembered that Su Ningyan had found a sword on the eighth floor. That sword seemed very important to her.<br/><br/>This corpse was the original owner of that sword.<br/><br/>Su Ningyan had willingly entered the Demon Suppression Tower, knowing that a disciple of the Blue Sky Palace was hiding here, specifically entering to search for that sword.<br/><br/>From these, it could be inferred that Su Ningyan indeed had a close relationship with the Blue Sky Palace.<br/><br/>He asked curiously, “Why hide inside the Demon Suppression Tower?”<br/><br/>“I’m not sure about that.”<br/><br/>Actually, it wasn’t difficult to guess. With her strength, the only ones who could force her to hide were the Celestial Beings.<br/><br/>Perhaps it was that particular being from the Red Sun.<br/><br/>It was pitiful. She hid here but still could not avoid her fatal disaster.<br/><br/>Gu Yang was not idle and converted all the nearby corpses into points. Although the energy gained wasn’t much, only about ten points, even a small mosquito was meat.<br/><br/>“Wait for me a moment.”<br/><br/>After he converted all the valuable monster corpses on this floor into points, he told Ling Ling and opened the system.<br/><br/>“Do you want to use the Life Simulator? Using it once consumes forty points of energy.”<br/><br/>As expected, the price had increased again, from twenty points to forty.<br/><br/>This meant that with his current energy of over eight hundred points, he could only simulate twenty times.<br/><br/>Despite the pain, he still had to continue with the simulations.<br/><br/>“Yes.”<br/><br/>“At the age of twenty-two, your Mana reached the third heaven level. You went to save Ling Ling trapped in the Boundless Mountain and fought a great battle against Red Sun of the Unleaking Realm, and was trapped inside the Demon Suppression Tower.”<br/><br/>“You broke through to the ninth floor and fought with Red Sun who had control over the Demon Suppression Tower. You defeated him, but you were unable to protect Ling Ling and caused her death on the spot.”<br/><br/>“You broke out of the Demon Suppression Tower, your heart full of grief. You vowed to hunt down Red Sun. Half a day later, Shen Yun appeared and Red Sun took the opportunity to flee. You started to fight with all your might.”<br/><br/>“You surprised Shen Yun by inflicting severe injuries on him. You transformed into a phoenix and escaped to Liangzhou to retreat back into the Golden Court.”<br/><br/>“Soon after, Shen Yun chased you to the Golden Court, constantly harassing you and preventing your injuries from healing.”<br/><br/>“Half a month later, your injuries grew more and more severe. Just when you were about to be captured, a Celestial Being descended and repelled Shen Yun.”<br/><br/>“The Celestial Being rescued you back to the Golden Court, treated your injuries, and wanted to cooperate with you.”<br/><br/>“Feeling helpless, you had to agree. A year later, your injuries healed. You began to hunt gods in the other two countries.”<br/><br/>“In two years, the losses of the two great nations were heavy and the power of the Golden Court was constantly expanding. Finally, it attracted the attack of the Celestial Beings from the other two nations.”<br/><br/>“The battle lasted for ten years. You almost killed all the gods of the two nations. In the end, you provoked a Celestial Being who gave up on the siege of the Golden Court and started crazily chasing after you.”<br/><br/>“You fled all the way to where the body of the Divine Ape was located, resulting in a great battle between the mysterious individual from the earth’s depths and the Celestial Being.”<br/><br/>“In a critical moment, the ruler of the Golden Court appeared and killed both the mysterious individual and the Celestial Being by himself, making the Golden Emperor’s Jade Register whole again. He elevated his immortal status to the Hollow Void realm.”<br/><br/>“You returned to the Great Zhou. Soon after, Saint Chaoyang appeared in his real body. With the power gifted to you by the ruler of the Golden Court, you were able to block one of his attacks. At the moment of life and death, you grasped the fourth form of the Six Sly Disasters of God, Celestial Being’s Decline and left a wound on Saint Chaoyang’s face. You died at the age of thirty-five.”<br/><br/>Ling Ling was actually dead!<br/><br/>When Gu Yang saw this outcome, his face slightly changed.<br/><br/>He was too careless, not expecting the strength of the Demon Suppression Tower to have increased.<br/><br/>If it wasn’t for the simulation in advance, he might have capsized his boat in the gutter this time.<br/><br/>That was close!<br/><br/>Ling Ling saw the change in his face and asked concerned, “What’s wrong?”<br/><br/>Looking at her, Gu Yang shook his head, “It’s nothing.”<br/><br/>But in his heart, he was resolved not to let anything happen to her.\t\t\t\t\t\t</div>", "images": {}, "success": true}