{"id": 279, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132159.html", "title": "Chapter 279 - Chapter 279: What Exactly Happened At Number 279?", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 279 - Chapter 279: What Exactly Happened At Number 279?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 279: What exactly happened at number 279?<br/><br/>Red Sun eventually met his end, obliterated. Only a pitch-black sword was left in his place.<br/><br/>Gu Yang retrieved the sword, which was converted directly into points.<br/><br/>[15 points have been gained, with a current balance of 619 points.]<br/><br/>The grand Unleaking Realm was surprisingly impoverished, not even owning a single extraordinary divine weapon.<br/><br/>In contrast, in the Water Moon Cave, cultivators of the Nascent Soul would each at least have a Magic Treasure, and generally several Spirit Tools as well.<br/><br/>Compared to these, killing those in the Great Zhou’s Unleaking Realm proved to have the lowest cost efficiency, challenging to kill and being penniless.<br/><br/>After Gu Yang processed the spoils of war, he turned to look at Ling Ling and noticed that her current situation was a bit grim.<br/><br/>After she threw out the green sphere, the Magic Array in the middle started emitting black mists, gradually corroding the green light.<br/><br/>She was continuously pouring her True Essence into the sphere, barely managing to hold on.<br/><br/>At this moment, her True Essence was being consumed drastically, and she began to sweat from her forehead, struggling to keep up.<br/><br/>Suddenly, the black mist around them exploded, gobbling up the bundle of green light, and morphed into a venomous snake, dashing towards Ling Ling.<br/><br/>Her face paled, attempting to dodge, but her severe consumption of True Essence made her one step too late.<br/><br/>The bundle of black mist was about to hit her.<br/><br/>Swish!<br/><br/>A figure appeared and slashed the black mist in half.<br/><br/>Ling Ling felt a hand clutching her waist, and she found herself being held in someone’s arms.<br/><br/>“Let’s go.”<br/><br/>Gu Yang’s voice sounded in her ear, and she was taken into the black mist. A blaze of red fire around her instantly incinerated any approaching black mist.<br/><br/>She quickly cried out, “Sky Pearl!”<br/><br/>Gu Yang responded immediately, cutting a path through the black mist and revealing the pearl ensnared by it.<br/><br/>He reached out and grabbed the green pearl.<br/><br/>Whoosh!<br/><br/>The two activated the array and were teleported away.<br/><br/>Before leaving, a furious voice echoed faintly from inside the Demon Suppression Tower, “You dare——”<br/><br/>“How did they disappear?”<br/><br/>In the outside world, Pei Qianlan’s face changed when Gu Yang and Ling Ling’s aura disappeared. She anxiously asked.<br/><br/>Wu Er subtly furrowed his eyebrows and said, “They entered the Demon Suppression Tower. There’s no need to worry. The young lad Gu once got trapped in it before and escaped quickly.”<br/><br/>Although he said this, he was not very certain inside.<br/><br/>Red Sun wasn’t foolish; he used the Demon Suppression Tower to confine Gu Yang last time and wasn’t successful. He must have strong confidence in bringing it out again this time.<br/><br/>“Kid, what on earth are you up to? Don’t capsize your boat in a gutter!”<br/><br/>Wu Er’s abundant battle experience told him that Gu Yang deliberately got caught by Red Sun and brought into the Demon Suppression Tower.<br/><br/>With the situation earlier, Gu Yang could have employed many ways to escape with Ling Ling.<br/><br/>The two anxiously waited at their original spot.<br/><br/>This wait lasted for quarter of an hour.<br/><br/>The Demon Suppression Tower was still quietly floating in the sky.<br/><br/>Surrounding it, all the mortals of Red Venerate Religious Sect were waiting for the return of their leader’s victory.<br/><br/>In their view, once Gu Yang was imprisoned in the Demon Suppression Tower, he was as good as butchered meat on a chopping board.<br/><br/>Their leader was at Unleaking level, and he could control the treasure. How difficult could it be to kill a mortal cultivator?<br/><br/>Suddenly the Demon Suppression Tower shook, a band of green light lit up, and thick black smoke began to rise from the top.<br/><br/>Neither Red Venerate’s followers nor Wu Er knew why such a bizarre event was happening to the Demon Suppression Tower.<br/><br/>After a moment, a giant black vortex appeared in the sky.<br/><br/>Seeing this, all the followers of Red Venerate prostrated on the ground. Many faces showed a fanatical look.<br/><br/>This was their god!<br/><br/>They sensed the presence of their god.<br/><br/>“Not good!”<br/><br/>Upon the appearance of that aura, Wu Er’s expression changed drastically. He grabbed Pei Qianlan’s arm, “Run!”<br/><br/>“But…”<br/><br/>“If you stay here, you will just hinder Gu.”<br/><br/>Wu Er anxiously said this without considering her feelings, given the urgency of the situation.<br/><br/>Feeling a tremor in her heart, Pei Qianlan realized he was right and stopped hesitating, following him to flee.<br/><br/>“Where is this?”<br/><br/>After Gu Yang felt dizzy, he realized he had not been teleported out, but rather, he had arrived in an odd space.<br/><br/>This space was just a few hundred cubic meters, empty save for a black pillar at its center, etched with myriad bizarre patterns.<br/><br/>“What year is it now?”<br/><br/>Suddenly, a resounding voice rang out, startling him.<br/><br/>Upon closer inspection, he realized that the voice came from a human figure carved on the pillar. An old man, gazing at him and blinking, said, “I’m asking you a question.”<br/><br/>“Uh, I, a junior, don’t know either.”<br/><br/>Faced with such a peculiar situation, Gu Yang quickly composed himself and responded.<br/><br/>The old man scrutinized him several times, genuinely surprised, “You have not even reached the Human Immortal stage, and yet you’re able to reach the ninth layer of the Demon Suppression Tower. How extraordinary.”<br/><br/>Seeing the old man’s attitude, Gu Yang was curious about his background, and asked, “May I know your honorable name?”<br/><br/>“I am … Eh, what has happened?”<br/><br/>The old man’s tone became anxious, “Where is the Way of Heaven? Where is the Emperor? How did this world become like this?”<br/><br/>All of a sudden, he flew into a rage, “How dare you defile my body!”<br/><br/>The old man stepped out from the pillar. However, as soon as one foot emerged, it vanished into thin air.<br/><br/>“My foot”<br/><br/>The old man let out a miserable scream and quickly retreated back into the pillar. The carved figure was now missing a left foot.<br/><br/>This eerie scene left Gu Yang and Ling Ling feeling distinctly uncomfortable.<br/><br/>The old man shouted, “Boy, lend me your mana.”<br/><br/>Suddenly, Gu Yang felt his mana surging out of his body like a tidal wave, causing the space to slightly vibrate.<br/><br/>Meanwhile, outside, the disciples of Red Venerate who were waiting for the arrival of their divine lord heard a thunderous rumble. All of a sudden, the Demon Suppression Tower radiated intense light, transformed into a streak of brilliance, and disappeared into the horizon.<br/><br/>“Pursue it!”<br/><br/>Just then, an authoritative voice echoed in the ear of the kneeling Saint Tang Rui.<br/><br/>This was a divine decree!<br/><br/>With immense joy in his heart, Tang Rui, without hesitation, rose into the air and chased after the streak of brilliance that the Demon Suppression Tower had transformed into.<br/><br/>The remaining disciples looked at each other in confusion, unsure of what had just happened.<br/><br/>In a flash, almost all mana inside Gu Yang was drained. Thankfully, the drain stopped at the very last and he was left with a little mana.<br/><br/>“How could this be?”<br/><br/>The elderly figure within the black pillar kept pulling at his beard and repeating this question.<br/><br/>By this time, Gu Yang had more or less figured out the identity of the old man; he was likely a spirit trapped within the Demon Suppression Tower.<br/><br/>They had been able to enter this space surely due to the green orb they previously found.<br/><br/>This must be the core object that the Dao Sect uses to control the Demon Suppression Tower, triggering a reaction from this sacred artifact.<br/><br/>Gu Yang asked, “Elder, have you been asleep for a long time?”<br/><br/>The figure in the black pillar paused then turned to look at him, “What exactly happened in this world?”<br/><br/>Gu Yang solemnly replied, “All I know is that the Way of Heaven died in the ancient times.”<br/><br/>“The Way of Heaven… died?”<br/><br/>The old man repeated this quietly, his voice filled with indescribable shock, “Could it be… ”<br/><br/>He spoke slowly, “Tell me everything you know.”<br/><br/>Gu Yang knew only a little, and finished talking in a few short sentences.<br/><br/>“Nyeh, elder, can you let us go first? There’s no vitality here, I can’t recover my mana.”<br/><br/>“Alright!”<br/><br/>The old man reached out and grabbed a sword engraved beside him and threw it out, “Here’s a gift for you.”<br/><br/>Whoosh!<br/><br/>A sword appeared out of thin air that landed in Gu Yang’s hand. A warm energy flowed from the sword into him.<br/><br/>“Master!”<br/><br/>A soft voice sounded in his mind, connecting him to a naïve consciousness within the sword.<br/><br/>A spirit within a magical treasure?<br/><br/>Gu Yang was taken aback.<br/><br/>He had seen numerous divine weapons, and even though some had spiritual natures, none had developed a primordial spirit. This was the first time he encountered a magical treasure with its own primordial spirit.<br/><br/>Before he had a chance to say anything, he felt a spinning sensation.<br/><br/>With a whoosh, they were back outside.<br/><br/>“Where are we?”<br/><br/>Upon looking, he found himself in a completely unfamiliar environment.<br/><br/>They were no longer in the Immeasurable Mountains.\t\t\t\t\t\t</div>", "images": {}, "success": true}