{"id": 272, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132146.html", "title": "Chapter 272 - Chapter 272: 272 Weakness Of The Unleaking Realm", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 272 - Chapter 272: 272 Weakness Of The Unleaking Realm</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 272: 272 Weakness of the Unleaking Realm<br/><br/>The path to immortality is severed?<br/><br/>Upon hearing the dean’s words, Gu Yang’s expression became grave. He asked, “Why?”<br/><br/>The dean did not answer directly, but instead asked, “Do you know what realm corresponds to the Unleaking Realm in ancient times?”<br/><br/>Gu Yang was taken aback and said, “Could it be the Nascent Soul?”<br/><br/>“Exactly, in ancient times, cultivators at the Nascent Soul stage had a lifespan of over two thousand years. Celestial Beings had a lifespan exceeding five thousand years,” the dean spoke.<br/><br/>“These days, some people refer to the Unleaking Realm as the Longevity Realm, but it means a lifespan of just one thousand years. How can that be considered longevity?”<br/><br/>Gu Yang couldn’t help but ask, “Does that mean that the cultivation system of the Water Moon Hollow Void is a continuation from ancient times?”<br/><br/>“According to some ancient texts and techniques, it does seem very close.”<br/><br/>Gu Yang then queried, “Dean, what is the Way of Heaven?”<br/><br/>“Can you feel any difference between being here with me and being outside?” the dean asked.<br/><br/>Gu Yang carefully experienced it, and indeed found a slight difference.<br/><br/>The dean continued, “Do you feel a different sensation when you are in Water Moon Hollow Void?”<br/><br/>Remembering his experiences in Water Moon Hollow Void, Yellow Springs Hollow Void, and the Golden Court Hollow Void, Gu Yang felt an even greater difference. The Yellow Springs Hollow Void had the most drastic difference—it was no longer suitable for human survival.<br/><br/>“The Way of Heaven corresponds to the laws of nature. So, when you say the Way of Heaven is dead, it means the laws of nature have changed?” Gu Yang asked.<br/><br/>The dean nodded, “You can understand it that way.”<br/><br/>“How did the Way of Heaven die?”<br/><br/>“Of course, it was killed by someone.”<br/><br/>Why was it this answer again?<br/><br/>Gu Yang asked, “Who?”<br/><br/>“I don’t know.”<br/><br/>The dean calmly said, “After the death of the Way of Heaven, this world went through a long period of chaos that lasted for seven to eight thousand years.”<br/><br/>“Due to the drastic changes in the world, nobody was able to break through to the Celestial Being realm during the chaotic era. Until the Xia Emperor emerged, he established the Xia Dynasty with the cultivation level of a Celestial Being and ended the chaos.”<br/><br/>“Since you have cultivated the ‘Nine Heavens Divine Method,’ you naturally know that this technique is very special. The Xia Emperor and his descendants were able to achieve the Celestial Being realm by relying on the essence blood of a Divine Beast, something that others cannot imitate.”<br/><br/>“After the Xia Emperor, the first person to achieve the Celestial Being realm was the nameless Taoist who founded the Dao Sect. It was he who discovered a way to break through to the Celestial Being realm.”<br/><br/>Upon hearing this, Gu Yang nodded. He now knew what that method was.<br/><br/>If one cannot break through to the Celestial Being realm in this world, then just break through in a Hollow Void World.<br/><br/>The dean continued, “However, this method has a fatal flaw. The Hollow Void World is far too small to accommodate the power at the Hollow Void level.”<br/><br/>“This means that the Celestial Being realm is the pinnacle of martial arts.”<br/><br/>“There’s no way forward anymore.”<br/><br/>Gu Yang was silent. Currently at the level of an Triple Heaven of Mana, he was not far from reaching the Celestial Being realm.<br/><br/>But now, they were telling him there was no way forward after the Celestial Being realm.<br/><br/>What a joke.<br/><br/>Even if there was truly no way forward, he would carve his own path.<br/><br/>He refused to believe that with the Simulator in his hands, he would not be able to find a path forward.<br/><br/>After a moment, the dean asked, “Do you have any other questions?”<br/><br/>Gu Yang finally remembered the main issue and asked, “How to deal with Shen Yun?”<br/><br/>The dean didn’t give a direct answer but asked a question, “Do you know the significance of the name ‘Unleaking Realm’?”<br/><br/>Gu Yang replied, “It signifies the achievement of the Unleaking Body.”<br/><br/>The dean explained, “You should feel that there are now two paths ahead of you. One is to have your Original Spirit completely break through the gate of heaven and accept the baptism of nature, thereby achieving the Nascent Soul. This is the ancient way.”<br/><br/>“The other path is to completely sever your connection with nature, creating a cycle within your body. This is the Unleaking Realm.”<br/><br/>Having heard this, Gu Yang finally understood.<br/><br/>No wonder he always felt that there was still room for improvement after reaching the Triple Heaven of Mana. It turns out that the next level was the Nascent Soul.<br/><br/>“If you achieve the Nascent Soul in this world, you’ll find that your strength has hardly improved compared to the Mana Realm. The laws of nature cause the Nascent Soul to age faster than the physical body. Your lifespan will instead be shortened. This is the downside of achieving the Nascent Soul.”<br/><br/>No increase in strength after breaking through, and a reduction in lifespan?<br/><br/>Gu Yang was shocked. How could that be possible?<br/><br/>“To achieve the Unleaking Body is to unlock the human body’s secret potential. This is actually the ancient body-building method. By severing the connection with nature, you can slow down the loss of lifespan, thus, achieving a lifespan of a thousand years.”<br/><br/>“However, there is a downside to the Unleaking Body. Once you make a move, it is unavoidable that there will be a loss in life force. Therefore, after reaching this realm, if you want to live longer, you should avoid engaging in fights with others as much as possible.”<br/><br/>So that’s how it is.<br/><br/>No wonder it’s said that the powerful Unleaker Realm very rarely interfere with mortal affairs, only stepping in at the point of life and death for their clan.<br/><br/>Don’t these old monsters want to intervene? Obviously not, they’re just fearing for their own lives.<br/><br/>Every use of their power consumes some of their vitality. Who can withstand that?<br/><br/>Anyway, in his practice of the “Phoenix Dance Nine Heavens”, although the approach is similar, there was no mention of such side effects.<br/><br/>Listening to the dean continue, “Shen Yun’s Taiyou Moon Devouring Technique which he cultivated, has devoured a significant number of people who cultivated the same technique, possessing a tremendous amount of life force.”<br/><br/>“However, he has lived for more than a thousand years, his remaining vitality won’t be much. If you want to surpass him, the only way is to compete in consumption.”<br/><br/>Understanding dawned on Gu Yang.<br/><br/>This information, was incredibly valuable.<br/><br/>In the previous simulations, his battles with Shen Yun, he had always tried to avoid entanglement, hitting and running. This approach was wrong.<br/><br/>He needed to reverse his approach and compete in consumption, draining the opponent’s vitality until they ran out. That’s how he’d naturally win.<br/><br/>When it came to a contest of endurance, he was not afraid of anyone.<br/><br/>Excitedly, he said, “Thank you, dean, for your guidance.”<br/><br/>The dean said, “I should be thanking you. If not for you, Ling Bo would not have been able to break through to the Divine Power realm so quickly.”<br/><br/>“Junior has one more favor to ask.”<br/><br/>“You may speak.”<br/><br/>“I hope the senior can impart the sword technique from the top level of Star Picking Pavilion to junior.”<br/><br/>The dean stared at him for a moment before speaking, “Do you know what this sword technique represents?”<br/><br/>“I do not. But, junior really needs this sword technique.”<br/><br/>“You are a practitioner of the saber. Transitioning to sword technique will not be easy.”<br/><br/>“Please, senior.”<br/><br/>“Fine, I can impart the sword technique to you, but I have one condition.”<br/><br/>“Senior, please speak.”<br/><br/>“In the future, no matter what happens, you must preserve the heritage of the Academy for the duration of three hundred years.”<br/><br/>“I agree!”<br/><br/>Gu Yang returned to the Star Picking Pavilion, letting out a long sigh of relief.<br/><br/>He actually succeeded!<br/><br/>He felt some joy in his heart.<br/><br/>In the previous simulations, he had tried to seek an audience with the dean, but the simulations never mentioned this matter which clearly indicated failure.<br/><br/>This time, he personally came forward to find out the reason the dean rejected the request.<br/><br/>Who knew, the dean would agree just like that, even though he presented a rather stringent condition.<br/><br/>For the next three hundred years, he has to preserve the Academy’s heritage.<br/><br/>It’s not an easy task. In the coming decades, the Star Luo Sect followed by the Wanxiang Gate will stir up turbulence. If even the Four Great Sacred Lands can’t hold them back, their strength is evident.<br/><br/>Maybe, in these two sects, there exists a Hollow Void Realm.<br/><br/>However, it’s all worth it.<br/><br/>Gu Yang’s attention returned to the sword intent in his mind, still feeling somewhat in awe.<br/><br/>In this world, there exists such an incredible sword technique.<br/><br/>What the dean passed to him was a sword intent without a name.<br/><br/>The Jade sword bearing this sword intent turned to ashes after passing on the intent.<br/><br/>That is to say, this sword intent can only be passed on to one person.<br/><br/>No wonder the dean imposed such a stringent condition.<br/><br/>This sword intent was mysterious and profound. In his current realm, he couldn’t fully comprehend it. Its level was far above any saber technique he’d learned.<br/><br/>He didn’t even know where to begin to comprehend this sword intent.<br/><br/>For the entire next day, Gu Yang was contemplating this sword technique, but he was getting nowhere, gaining nothing.<br/><br/>“It seems, the foundation is too weak, need to start from scratch.”\t\t\t\t\t\t</div>", "images": {}, "success": true}