{"id": 274, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132149.html", "title": "Chapter 274 - Chapter 274: 274 The Path To Heaven That You Won’T Take (Third Update, Request For Monthly Tickets)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 274 - Chapter 274: 274 The Path To Heaven That You Won’T Take (Third Update, Request For Monthly Tickets)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 274: 274 The Path to Heaven that You Won’t Take (Third Update, Request for Monthly Tickets)<br/><br/>“Greetings to the Grandmaster!”<br/><br/>Upon the boundless mountain, a crowd bowed to a red figure in the sky.<br/><br/>Behind the red figure, a group of people followed. These were the core figures of the Red Venerate Cult.<br/><br/>At the forefront was the Grandmaster, Red Sun.<br/><br/>Close behind him were Tang Rui, who was once defeated by Gu Yang, and the madcap Feng Xiaoxiao.<br/><br/>The two of them were now at the Golden Body Realm in cultivation.<br/><br/>Not only them, but also the several Divine Power Realm experts who had set a trap at the National Residence in Divine City with the intention of striking all the ministers of the Great Zhou Court were present.<br/><br/>The cultivation of these people had also advanced into the Mana Realm.<br/><br/>The one who reaped the most was naturally the Grandmaster Red Sun, who had achieved the Unleaking Realm in one fell swoop.<br/><br/>In the Red Venerate Cult, all powers are granted by the Divine Lord.<br/><br/>All of this happened a month ago when the Divine Lord suddenly bestowed Divine Grace, raising everyone’s realm by one level overnight.<br/><br/>This tremendous power made the Red Venerate Cult more fanatic.<br/><br/>As of now, the Red Venerate Cult had secured a strength comparable to the nine major clans in the world.<br/><br/>The Divine Lord chose to enhance their strength at this time, naturally in preparation for the upcoming actions.<br/><br/>The Red Venerate Cult had already received the divine edict to incite rebellion across the country, with only one goal – to plunge the Great Zhou into chaos.<br/><br/>“Grandmaster, if we act so hastily, the losses will be extremely severe. The Great Zhou’s military is not completely relaxed yet.”<br/><br/>A man looking like a middle-aged scholar was persuading Red Sun.<br/><br/>This man was the Red Venerate Cult’s military strategist. Among the higher-ups of the Red Venerate Cult present, including the Grandmaster Red Sun, none were proficient in preaching or building military forces.<br/><br/>This military strategist was specifically in charge of this area.<br/><br/>Without hesitation, Red Sun said, “This is the Divine Lord’s decree. We must act at the agreed time. Changes are absolutely not acceptable.”<br/><br/>Upon hearing this, the strategist had to close his mouth.<br/><br/>In the Red Venerate Cult, questioning the Grandmaster might be tolerated, but questioning the Divine Lord meant certain death.<br/><br/>Red Sun didn’t want to demoralize this capable assistant, so he said, “Calm down, strategist. The Divine Lord must have his reasons for arranging this. I’ve heard that a few years ago, another Celestial Being emerged among the savages from the prairie. Moreover, that savage king with great ambitions is planning to invade Great Zhou in winter.”<br/><br/>The strategist’s eyes lit up, and he said excitedly, “The Divine Lord’s vision is beyond comparison by ordinary people like us. Under the pincer attack from inside and outside, the Zhao territory will be in danger.”<br/><br/>As they spoke, the people of the Red Venerate Cult landed on the ground.<br/><br/>“Grandmaster.”<br/><br/>Suddenly, a man guarding the Boundless Mountain reported, “A few days ago, a woman broke into the mountain. After we discovered her, she hid in a cave. There are prohibitions in the cave and we haven’t been able to break them.”<br/><br/>Red Sun’s expression darkened, and he scolded, “Useless!”<br/><br/>The Boundless Mountain was now the Red Venerate Cult’s main base, yet it had been infiltrated. After a few days, they still hadn’t caught the intruder.<br/><br/>Although the core figures of the sect weren’t here and the mountain gate was guarded only by an initial stage Golden Body Protector, this was too incompetent.<br/><br/>The man fell to his knees with a thud, trembling, “Please calm your anger, Grandmaster.”<br/><br/>“Lead the way.”<br/><br/>At the back of Boundless Mountain, inside a cave, the cave walls were filled with prohibitions.<br/><br/>In the middle was a round pool, half of the pool water was white, and the other half was black, forming a Yin-Yang symbol.<br/><br/>This place was the Dao Sect’s Black-White Spirit Pool.<br/><br/>No one had been to this Spirit Pool for a hundred years.<br/><br/>Only people from Dao Sect knew how to enter here.<br/><br/>After the Red Venerate Cult had taken over here, they didn’t know there was such a Spirit Pool.<br/><br/>In the past, the rule of Dao Sect was to open this place once every two years. Only one person was allowed to enter each time to take a baptism in the Spirit Pool.<br/><br/>This Spirit Pool was of great benefit to martial artists in the Mortal Realm, enhancing their cultivation.<br/><br/>Now, after a hundred years of accumulation, the water in this Spirit Pool had almost reached its fullest.<br/><br/>All of this benefited Ling Ling, who could cultivate in the Spirit Pool without any scruples.<br/><br/>In just three days, she had broken through from the Third Rank to the peak of the First Rank. She was only a step away from the Divine Power Realm.<br/><br/>The hundred years of accumulation in the Spirit Pool had been used up by nearly half.<br/><br/>At this time, she was still continuously absorbing the spiritual power from the Spirit Pool. With each in-breath and out-breath, white Qi columns formed from her nostrils.<br/><br/>A powerful aura flow formed within several tens of feet around her body.<br/><br/>An incredible change was occurring in her body.<br/><br/>This was the sign of achieving a Golden Body.<br/><br/>Just then, a loud rumble.<br/><br/>The cave shook, and the prohibitions on the cave walls lit up, then burst open.<br/><br/>This meant that the prohibition over the cave had been broken.<br/><br/>At this moment, Ling Ling was in the most crucial moment, oblivious to external affairs, devoid of distractions and focused on breaking through.<br/><br/>Outside the cave, the person who broke the prohibition was a formidable Mana Realm cultivator.<br/><br/>This person was the head elder of the Red Venerate Sect, who had once traveled with the Holy Child Tang Rui to Jingzhou, responsible for blocking the door of the Emperor’s Supreme Sword Saint.<br/><br/>“So, he’s attempting to break into the Divine Power Realm inside.”<br/><br/>Red Sun, sensing the movements inside, laughed instead of getting angry.<br/><br/>Without guessing, they knew the person inside must be the successor of the Dao Sect.<br/><br/>He ordered, “Xiaoxiao, bring the person inside out.”<br/><br/>“Yes.”<br/><br/>Feng Xiaoxiao seemed a bit excited, ready to rush into the cave.<br/><br/>Just then, a knife fell from the sky and stuck in the cave entrance.<br/><br/>Everyone present was startled by this.<br/><br/>Before the knife fell, no one had detected it.<br/><br/>Feng Xiaoxiao almost ran into it, fortunately she reacted quickly and stopped in time.<br/><br/>“Who?”<br/><br/>All the people of the Red Venerate Sect were on guard as they realized they had encountered a terrifying enemy.<br/><br/>Only Red Sun, the one with the highest cultivation level, looked up at the figure falling rapidly from the sky, a deep murderous intent flashing across his face as he shouted, “It’s you!”<br/><br/>The figure had already landed, blocking the entrance of the cave.<br/><br/>“It’s you?”<br/><br/>The Holy Child Tang Rui and Feng Xiaoxiao almost simultaneously voiced out.<br/><br/>A few months ago, the man in front of them was the very Gu Yang who had thwarted their plans at Jinghai Palace in Jingzhou.<br/><br/>Tang Rui had been defeated by him earlier, which caused great resentment in him at the time.<br/><br/>However, as Gu Yang’s cultivation level had been advancing with a jaw-dropping speed, he no longer harbored any thoughts of comparing himself with him.<br/><br/>Now, he couldn’t even see his back anymore.<br/><br/>Even though he had received the grace of the Divine Lord and successfully broken through to the Golden Body Realm, the gap was still so big that it filled him with despair.<br/><br/>He knew that the shadow this man had cast in his heart could never be erased.<br/><br/>Seeing this man again at this moment, Tang Rui was filled with mixed feelings.<br/><br/>“Funny how you have chosen to walk into the inferno instead of strolling in paradise.”<br/><br/>Red Sun burst into laughter. However, his eyes that looked at Gu Yang were colder than ice.<br/><br/>His heart was boiling with a murderous intent.<br/><br/>Back in the Divine City, he set up a brilliant trap that could have killed more than a dozen Divine Power Realm cultivators and killed all the high-ranking officials of the Great Zhou dynasty.<br/><br/>Juat when he was about to succeed, this kid ruined it.<br/><br/>He was extremely angry at heart and longed for the kid’s death more than ever.<br/><br/>However, outside the Divine City, he surprisingly was scared away by a small bird, facing Gu Yang who just broke through to the Golden Body Realm.<br/><br/>After learning the truth from the Divine Lord, he considered this as the greatest humiliation of his life.<br/><br/>Had he not been burdened with the Divine Lord’s assignments, he would have taken revenge on Gu Yang long ago.<br/><br/>Later on, knowing that Gu Yang had caught up with him and broken through to the Mana Realm in a extremely short period of time, he felt a shiver of fear.<br/><br/>Not until he received the grace of the Divine Lord and managed to break through to the Unleaking Realm did he leave that kid behind again.<br/><br/>He had always planned to find a chance, locate this kid, and remove this great threat.<br/><br/>Little did he know that the kid would bring himself to him.<br/><br/>Mana Third Heaven!<br/><br/>Red Sun could tell Gu Yang’s real cultivation level at a glance, he had broken through again.<br/><br/>Such a cultivation speed was indeed unthinkable.<br/><br/>It had been reported that he had broken through to the Second Heaven of the Mana Realm just half a month ago.<br/><br/>In half a month, he made another breakthrough.<br/><br/>The murderous intent in Red Sun’s heart became stronger.<br/><br/>If this kid was given more time, wouldn’t he soon break through to the Unleaking Realm?<br/><br/>If that happened, this kid would truly be unstoppable and become a real threat to the Red Venerate Sect.<br/><br/>PS: It’s almost the end of the month, if you still have votes for the month, hurry up and vote.\t\t\t\t\t\t</div>", "images": {}, "success": true}