{"id": 278, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132157.html", "title": "Chapter 278 - Chapter 278: All 278 Knives Are Blunt.", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 278 - Chapter 278: All 278 Knives Are Blunt.</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 278: All 278 knives are blunt.<br/><br/>When Red Sun saw Gu Yang, Gu Yang also looked at him. Over a hundred miles apart, their gazes clashed in the air, sparking a flash of light.<br/><br/>He clutched tightly to his blade without any hesitation, the fear in his heart transforming into a boiling intent to kill.<br/><br/>The entire ninth floor of the Demon Suppression Tower was under his control; he could freely harness the power of this precious treasure.<br/><br/>This moment, was his moment of utmost power.<br/><br/>Red Sun was very clear, right now, was the only chance to kill the man before him.<br/><br/>If he could not slay him despite such a massive advantage, he would never have another chance.<br/><br/>If he were to let Gu Yang escape today, he predicted that before long, he would break through to the Unleaking Realm.<br/><br/>By then, the one to die would be him.<br/><br/>He yelled out loud, “Come and meet your death!”<br/><br/>The entire ninth floor began to collapse inward from the edges, quickly reaching the spot where Gu Yang was. It forced them to fly towards the center.<br/><br/>In a flash, the entire ninth floor had shrunk to a size of just ten kilometers in diameter. Beyond that was boundless darkness that consumed all light.<br/><br/>Black flames rose around Red Sun, shooting up into the sky. At this moment, he was like the god of this space, his eyes filled with an extreme coldness.<br/><br/>He pointed his sword towards Gu Yang and shouted, “Seal!”<br/><br/>Suddenly, two black chains appeared in the sky, aiming for Gu Yang.<br/><br/>“Be careful!”<br/><br/>Ling Ling’s face drastically changed when she saw this.<br/><br/>As Wen Jue’s disciple, she naturally knew how terrifying the Demon Suppression Tower, a precious treasure, could be. Even a Celestial Being of the Monster Race couldn’t resist it once they were trapped within.<br/><br/>Now the Demon Suppression Tower had been seized by someone else and re-incorporated, but its main function remained the same: to suppress others.<br/><br/>Those two chains were the most powerful weapon of the Demon Suppression Tower. Once they locked onto someone, they would completely seal off all their mana.<br/><br/>When Gu Yang reached the ninth floor, he felt the suppressive force there was several times stronger than on the eighth floor. His powers were suppressed to only twenty percent of their usual strength.<br/><br/>It would be simple to kill Red Sun. Just by using the fourth move of the God Shattering Six Annihilation, he could easily kill him. However, if he did that, his own body would also be affected by the decaying energy.<br/><br/>The key issue was that during the previous simulation, Saint Chaoyang no longer used Spirit Fruit to heal his wound. Instead, he allowed him to recuperate for several years before charging the stone egg once again.<br/><br/>That’s why he did not continue with the simulation.<br/><br/>Gu Yang greatly suspected that the damage caused by that move was irreversible. The only treatment was those Spirit Fruits used by Saint Chaoyang.<br/><br/>To deal with Red Sun, he doesn’t even need to use that move.<br/><br/>When those two chains in the sky were about to fall, Gu Yang vanished out of thin air.<br/><br/>The next instant, he already appeared in front of Red Sun, his Phoenix Feather Knife slashing towards him.<br/><br/>He used the instantaneous teleportation Divine Power of the divine beast, White Tiger.<br/><br/>Upon reaching the sixth layer of cultivation of the “Nine Heavens Divine Method”, one could use the Divine Power of any divine beast.<br/><br/>Gu Yang had just brawled with Red Sun, using the Divine Power of the Heavenly Divine Ape, which was considered powerful amongst divine beasts.<br/><br/>How could an individual of the Unleaking Realm possibly fight against the Heavenly Divine Ape? Even though his realm was one tier lower than his opponent’s, he could still easily beat him.<br/><br/>The slash carried the blazing Phoenix Real Fire, the king of all flames.<br/><br/>“Move!”<br/><br/>Red Sun’s reaction was quick too. With a thought, he shifted space, disappearing instantly.<br/><br/>He also utilized teleportation, borrowing the power of the Demon Suppression Tower.<br/><br/>Up in the sky, those two immense chains followed closely behind, flying towards Gu Yang.<br/><br/>Once again, Gu Yang blinked away, going after Red Sun.<br/><br/>“Seal!”<br/><br/>Red Sun had anticipated this. With a thunderous sound, the space in front of him was locked. Gu Yang’s slash was unable to come down.<br/><br/>“Useless, within this Demon Suppression Tower, I am invincible!”<br/><br/>Red Sun roared out loudly, “Lock!”<br/><br/>From the sky, two additional black chains dropped down, entirely sealing off Gu Yang’s path of retreat.<br/><br/>This Demon Suppression Tower was proving to be quite troublesome.<br/><br/>Gu Yang realized he had still underestimated the power of this precious treasure.<br/><br/>To qualify as a sect’s treasure, it was indeed extraordinary. It was not something a common peerless divine weapon could compare to.<br/><br/>He had been careless!<br/><br/>His gaze turned cold, preparing to use his ultimate means of attack.<br/><br/>At this moment, Ling Ling, seeing Gu Yang in danger, did not hesitate. She grabbed something from her bosom, and threw it towards the platform at the center, the core of the Demon Suppression Tower.<br/><br/>Boom!<br/><br/>It was a green orb. Once it hit the ground, it released a massive light.<br/><br/>The entire Demon Suppression Tower shook once.<br/><br/>Red Sun felt like he almost lost control of the Demon Suppression Tower and was shocked. He looked at the woman, his heart filled with extreme anger.<br/><br/>He had completely overlooked that this woman was a descendant of the Dao Sect, and this Demon Suppression Tower was originally the treasure of the Dao Sect.<br/><br/>“Die!”<br/><br/>Just as he was about to attack, a blade intent was already in front of him. He reflexively raised his sword to block.<br/><br/>Bang!<br/><br/>A horrifying force sent him flying.<br/><br/>The one who made the move was Gu Yang. What he used was the third move of the Heaven-Questioning Nine Thrusts, Power that Swallows the Universe!<br/><br/>In the sky, the four chains suddenly stopped.<br/><br/>Gu Yang made a decisive move, slashing the Red Sun and opening up a gap in the blocked-off space in front of him.<br/><br/>Red Sun flew hundreds of meters away before finally coming to a halt. His chest bore a deep wound, but there was no blood flowing out.<br/><br/>The wound was healing rapidly.<br/><br/>His face was grim, the cut had cost him over ten years of his lifespan.<br/><br/>For those at the Unleaking Realm, using mana or injuring oneself both led to a consumption of life, or rather, lifespan.<br/><br/>Every move, every injury, they could clearly sense the decrease in lifespan.<br/><br/>As such, at this realm, unless necessary, they would not act rashly.<br/><br/>Red Sun was an exception. His strength was all given by the Divine Leader. His mission was to stir up trouble everywhere.<br/><br/>He wanted to kill Gu Yang to please the Divine Leader.<br/><br/>However, at this moment, he was on the verge of losing control of the Demon Suppression Tower, and fear surged in his heart.<br/><br/>He knew all too well the importance of the Demon Suppression Tower to the Divine Leader. If this treasure were snatched away from him, what awaited him would be a fate far worse than death.<br/><br/>“Scum, die!”<br/><br/>Red Sun, driven to madness, charged at Ling Ling.<br/><br/>The question of whether Gu Yang could be killed or not had become unimportant. He had to stop this woman.<br/><br/>Bang!<br/><br/>Almost at the same time, a Blade Intent locked onto him. It seemed as if everything between the heavens and earth was severed.<br/><br/>Gu Yang appeared in front of him, bringing down a swift slash.<br/><br/>The third form of Soaring Six Annihilation, Annihilation of Heaven and Earth!<br/><br/>Red Sun’s pupils contracted, feeling his mana disappearing the moment it left his body. An unprecedented sense of weakness made his heart flutter.<br/><br/>At this moment, he felt as if he had been abandoned by the world, no longer a part of it.<br/><br/>Splash!<br/><br/>In this instant, Gu Yang’s blade fell, cleaving him in two from head to waist.<br/><br/>Flames roared from the wound, burning Red Sun’s halved body into two fireballs.<br/><br/>“Ah”<br/><br/>A earth-shattering scream resounded.<br/><br/>Those two fireballs quickly fused back together, and in a flash, retreated several kilometers away with astonishing speed.<br/><br/>The flames dispersed and Red Sun, completely undamaged, appeared in the air. His body, which had just been split in half, had somehow regrown.<br/><br/>“Is this even possible?”<br/><br/>Gu Yang watched in amazement. He had thought that Red Sun would unquestionably die from that cut. Who could have imagined that even such a fatal wound could be healed?<br/><br/>Unleaking Realm experts were truly terrifying.<br/><br/>However, it was clear to see that Red Sun was in very bad shape and looked extremely weak. Obviously, this regenerative ability came at a hefty price.<br/><br/>This fatal wound had cost him a hundred years of his lifespan.<br/><br/>Unable to control his trembling body, Red Sun looked at Gu Yang with a newfound sense of fear.<br/><br/>He was only at the Mana realm, so how could he have such strength?<br/><br/>Wasn’t an Unleaking Realm fighting a Mana Realm supposed to be like an older brother bullying his younger brother?<br/><br/>Why had it turned the other way around when it came to him?<br/><br/>He couldn’t figure it out for the life of him, and at that moment, he saw Gu Yang preparing to make another move.<br/><br/>“What an outrageous bully!”<br/><br/>Red Sun’s eyes turned blood red. Mad with rage and willing to deplete his essence, he transformed into an endless pool of mana. His whole body turned into a mass of flames.<br/><br/>He unleashed the full power of the Red Flame Divine Power!<br/><br/>Then, he lunged towards that woman not far away.<br/><br/>He absolutely had to kill that woman!<br/><br/>The Demon Suppression Tower could not be stolen.<br/><br/>Just then, another blade descended from the sky.<br/><br/>The second form of the Nine Heavens Asking Blade, Blade Defines the Universe!<br/><br/>Boom!<br/><br/>This blade split the black flame that Red Sun had transformed into into two.<br/><br/>“Ah”<br/><br/>Again, a piercing scream resounded.<br/><br/>Gu Yang showed no mercy, and with another swing of his hand, another blade…<br/><br/>Blade after blade fell, cutting the mass of flames into seventeen or eighteen pieces.<br/><br/>Gu Yang felt as if his Phoenix Feather Blade were about to blunt. A prompt finally appeared before his eyes, [Gained 100 points of energy, current remaining balance: 604 points.]<br/><br/>Finally dead.<br/><br/>He wiped the sweat off his brow, feeling that his mana was nearly depleted.<br/><br/>“The Unleaking Realm is really too hard to kill.”<br/><br/>If it weren’t for the confined space, Gu Yang might not have been able to kill him.<br/><br/>If they were in the open, and Red Sun was intent on escaping, killing him would not be easy.<br/><br/>The leader of the Red Venerate cult, bent on killing him and creating such an environment, ended up digging his own grave. In the end, he couldn’t even escape.<br/><br/>PS: The first update, asking for votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}