{"id": 271, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132144.html", "title": "Chapter 271 - Chapter 271: 271 The End Of Cultivation (Third Update, Asking For Monthly Tickets)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 271 - Chapter 271: 271 The End Of Cultivation (Third Update, Asking For Monthly Tickets)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 271: 271 The End of Cultivation (Third update, asking for monthly tickets)<br/><br/>Just as day broke, a horse carriage drove out of the palace.<br/><br/>In the carriage sat Gu Yang and Pei Qianlan, breaking the tranquility of the early morning as it headed straight for the academy.<br/><br/>“Golden Body realm cultivates the mortal body. The cultivation method you have been practicing is lacking. I’ll pass on a new one to you…” Gu Yang was giving guidance on Martial Arts.<br/><br/>The method previously practiced by Pei Qianlan was inherited from her family and could only advance to the Golden Body realm at most. It was seriously hindering her progress.<br/><br/>What Gu Yang passed to her was a cultivation method he obtained from the Immortal Palace in the Cold Moon, known as the “Rainbow Gown Immortal Scripture,” an ancient Immortal cultivation method.<br/><br/>In one simulation, he spent more than ten years incorporating current Martial Arts into this method, transforming it into a Martial Arts method.<br/><br/>He used sound transmission to pass on this method to her.<br/><br/>Pei Qianlan listened very seriously. She was already highly enlightened, and after obtaining a drop of water from the Dragon Washing Pond at Dragon Gate Island, her entire persona had undergone a transformation.<br/><br/>Additionally, after refining herself in the Moonlight Pond, her qualities were so rare that she picked up things quickly.<br/><br/>Last night, she had witnessed Gu Yang break through to the third layer of the Mana realm, which filled her with a strong sense of crisis.<br/><br/>She had thought that after achieving Divine Power, she could help him.<br/><br/>Who knew that the gap between them was growing more and more.<br/><br/>She only reached the first level of the Golden Body, while Gu Yang was already in the third level of Mana realm.<br/><br/>This feeling made her a little panicked. If she kept going like this, she would be further left behind, and sooner or later, she wouldn’t even see his back.<br/><br/>She had to catch up, even if she couldn’t shorten the distance, she could not be left completely behind.<br/><br/>Suddenly, the carriage stopped.<br/><br/>Gu Yang’s heart moved, and before the coachman could speak, he said, “Let him get in.”<br/><br/>The carriage door opened, and an old man hopped in. It was the elusive Wu Er.<br/><br/>Gu Yang said, “Didn’t you say you dare not enter the Divine City?”<br/><br/>Wu Er laughed heartily, appearing extremely cheerful, “With you around, who can harm me?”<br/><br/>Given Gu Yang’s current strength, basically, no one in the Divine City could pose a threat to him.<br/><br/>That was what Wu Er thought, and so did the shadowy Sword Saint.<br/><br/>After Gu Yang broke through to the third realm of Mana, he went through another simulation, and as a result, the shadowy Sword Saint didn’t dare to act rashly.<br/><br/>It was because of this that he leisurely took Pei Qianlan out early in the morning.<br/><br/>Gu Yang asked, “The elder is in a hurry to find me, what is the matter?”<br/><br/>He knew that Wu Er wouldn’t look for him without reason.<br/><br/>The smile disappeared from Wu Er’s face, and he said solemnly, “That girl Ling Ling is in trouble.”<br/><br/>Gu Yang frowned, asking, “What happened?”<br/><br/>In his memory, Ling Ling never encountered any trouble in so many simulations, until she was going to break through to the Divine Power realm, where she was besieged and fell into a desperate situation.<br/><br/>Wu Er sighed, “This girl is just too prideful. Seeing your swift progress, reaching the Mana realm. On the one hand, she’s happy for you; on the other hand, she doesn’t want to be left behind, thus taking risks….”<br/><br/>“At the mountain gate of the Dao sect, there is a Spirit Pool called the Black and White Spirit Pool, which has significant benefits for her cultivation of Yang Ji Zhen Gang.”<br/><br/>“However, it has long been occupied by the Red Venerate Sect. Ling Ling thought to sneak in while the higher-ups of the Red Venerate Sect were absent, but she was discovered, and now she is trapped inside the Spirit Pool.”<br/><br/>“The members of the Red Venerate Sect cannot enter the Spirit Pool, so they stationed people outside. She has been trapped for two days already. The prohibition of the Spirit Pool also won’t last too long.”<br/><br/>Gu Yang did not expect that his quick cultivation would cause such changes.<br/><br/>Given Ling Ling’s deep affection for him, he definitely could not ignore the situation.<br/><br/>He asked, “Where is the mountain gate of the Dao Sect?”<br/><br/>“Unmeasurable mountain in Yunzhou.”<br/><br/>Gu Yang said, “Isn’t that the territory of Gao Family?”<br/><br/>“After the decline of the Dao sect, Yunzhou was occupied by the Gao Family. Saving people is like putting out a fire, you should set off immediately.”<br/><br/>Gu Yang shook his head, “I can’t leave now?”<br/><br/>With a worried face, Wu Er said, “Why not?”<br/><br/>“Shen Yun is waiting for me outside the city.”<br/><br/>“Shen Yun?”<br/><br/>Wu Er’s gaze hardened, “He actually took action personally?”<br/><br/>“I’m still no match for him.”<br/><br/>Gu Yang simulated it last night. Although he wasn’t completely at a disadvantage like before, he still couldn’t get rid of him. Eventually, the arrival of Saint Chao Yang would be inevitable.<br/><br/>“This bastard, I knew I should have killed him back then.”<br/><br/>Wu Er said agitatedly.<br/><br/>Gu Yang said, “So, we must consider this matter in the long run. Only by getting rid of Shen Yun can we rescue Ling Ling. Elder, do you have any solution?”<br/><br/>Even though he asked a question, his tone was very certain.<br/><br/>Because, last night after he broke through to the third level of mana, he conducted two simulations.<br/><br/>In the first one, he directly challenged Shen Yun and ended up failing.<br/><br/>In the other one, he used the method Wu Er thought of—to shake off Shen Yun.<br/><br/>Wu Er stroking his chin, said, “A method… I’ve got it!<br/><br/>His eyes lit up, he left a message “Give me one day.” then hopped off the carriage and vanished in the blink of an eye.<br/><br/>His arrival was abrupt, and his departure hurried.<br/><br/>At this point, Pei Qianlan, who had been silent all along, spoke up, “Ling Ling, she’s the girl Qingzhi mentioned, isn’t she?”<br/><br/>Gu Yang asked, “What did she tell you?”<br/><br/>“She said that Ling Ling is the woman who is closest to you.”<br/><br/>This description was not incorrect.<br/><br/>Gu Yang thought as much, but didn’t say it out loud. “Let’s continue.”<br/><br/>At the Academy, Gu Yang had become familiar with the place, and went straight to Zhou Zongye.<br/><br/>Zhou Zongye was not in the yard. Gu Yang sat down, brewed a pot of tea, and said, “When it comes to cultivation, one must not be too eager, or else one will not reach the intended result. You got an unexpected opportunity, your foundation is not steady, if you blindly pursue progress, it will backfire.”<br/><br/>“You are the last person who has the right to say that.”<br/><br/>At that moment, Zhou Zongye’s voice came from outside the door. Seeing him drinking tea, he grabbed the tea canister from Gu Yang’s hand and said in pain, “You don’t understand tea, you’re just wasting it.”<br/><br/>He put the tea canister into his sleeve, then said, “The first time I met you, you were only at the first level of the Golden Body. Now, you’ve surpassed me in realm. In terms of the speed of cultivation, you are the first in a thousand years.”<br/><br/>Gu Yang was unmoved. How could others know how long he had actually been cultivating to reach this realm?<br/><br/>He revealed his purpose, “I want to meet the dean.”<br/><br/>Zhou Zongye was first taken aback, then became serious, “Follow me.”<br/><br/>It was the same space. Gu Yang walked alone into the courtyard. He stopped in front of the middle-aged man in the green robe and greeted him, “Greetings to the Dean.”<br/><br/>This time, the Dean closed his book and carefully looked at him. Then, he gave Gu Yang a nod. “You’re good, now, what brings you here?”<br/><br/>Gu Yang said, “Elder, do you know…there’s a mysterious man in the Imperial Palace…underground… in the array’s core…”<br/><br/>He came this time to inquire about the origins of this mysterious man.<br/><br/>He recounted the situation when he saw the man that day.<br/><br/>The Dean’s face did not show any changes. He gently tapped his fingers on the armrest and after Gu Yang finished speaking, he pondered for a while and said, “The man is probably a great figure from the ancient times who managed to survive to this day.”<br/><br/>Survive?<br/><br/>Gu Yang took note of his use of this word.<br/><br/>Seeing Gu Yang’s confusion, the Dean said, “Do you know what lies at the end of cultivation?”<br/><br/>Gu Yang thought for a while and said uncertainly, “Immortality?”<br/><br/>The Dean’s eyes lit up, “That’s right. You’ve hit the nail on the head. It is indeed for immortality. However, since the Way of Heaven has perished, there will be no one on Earth who can continue to grow.”\t\t\t\t\t\t</div>", "images": {}, "success": true}