{"id": 275, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132151.html", "title": "Chapter 275 - Chapter 275: 275 Unleaking Battle", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 275 - Chapter 275: 275 Unleaking Battle</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 275: 275 Unleaking Battle<br/><br/>Boom!<br/><br/>Inside the cave, a rampant Gang Qi swept across, causing the canyon walls, no longer protected by the prohibition, to tremble. Small fragments of rocks were shaken loose and fell to the ground.<br/><br/>Ling Ling hovered in the air, a layer of invisible Gang Qi surrounding her. Any rock debris that fell on it was instantly pulverized.<br/><br/>She opened her eyes, a terrifying glint flashing in her pupils.<br/><br/>The Golden Body was complete!<br/><br/>She held her sword, bubbling with battle intent, ready to face her enemy.<br/><br/>Even while she was fully concentrated on breaking through her realm, she had some sensory awareness of the outside world. She knew that the prohibition of the cave had been broken.<br/><br/>She had braced herself to face an indomitable foe.<br/><br/>But surprisingly, as she opened her eyes, she sensed a familiar yet somewhat strange aura.<br/><br/>She paused, stunned. “Gu Yang?”<br/><br/>Why was he here?<br/><br/>Besides him, there were more than a dozen powerful auras, all of them at the Divine Power Realm or above.<br/><br/>Six of these auras were profound and unfathomable, clearly at the Mana realm.<br/><br/>One in particular was so overpowering that it made her feel suffocated. Even from this far away, just by its aura, it was suppressing the True Essence within her to be somewhat unstable.<br/><br/>The Unleaking Realm!<br/><br/>Ling Ling’s heart continued to sink.<br/><br/>She never imagined that there would be an Unleaking Realm expert in the Red Venerate Sect.<br/><br/>In truth, when she sneaked into the sect’s territory while most of the higher-ups were away, she had been detected by a Divine Power Realm expert who had stayed behind. She was then cornered in the Yin-Yang Spirit Pool and knew there was no way out.<br/><br/>Knowing she was going to die anyway, she threw caution to the wind and used the Yin-Yang Spirit Pool to drastically increase her own strength.<br/><br/>In a short time, she drained nearly a hundred years of the Spirit Pool’s accumulated energy, crossing two realms in a row and breaking through to the Divine Power Realm.<br/><br/>Doing so could very well result in the destruction of the Spirit Pool and make her own realm unstable.<br/><br/>But she didn’t care anymore.<br/><br/>This was her only chance of survival.<br/><br/>She succeeded!<br/><br/>She had successfully stepped into the Divine Power Realm, but as soon as she opened her eyes, she was met with an enemy so powerful it brought despair.<br/><br/>A dozen Divine Power Realm experts, six Mana Realm experts, and one Unleaking Realm expert.<br/><br/>Probably all the Red Venerate Sect powerhouses were here.<br/><br/>What made her despair even more was that Gu Yang had actually come to rescue her.<br/><br/>Ling Ling knew he had already reached the dual heaven in the Mana realm and even killed a triple heaven powerhouse from Shen Family.<br/><br/>But what they faced now was an Unleaking Realm expert!<br/><br/>In Great Zhou, only those in the Unleaking Realm are truly significant figures ruling the world.<br/><br/>The reason these nine families rule the world is because each of them has an Unleaking Realm expert in charge.<br/><br/>Similarly, the reason why there are only six major sects is because each of them also has an Unleaking Realm expert.<br/><br/>Adding the imperial family, there are only sixteen top forces in the world.<br/><br/>If anyone else manages to enter the Unleaking Realm, they can establish their own family, becoming the tenth ruling family. If they establish a sect, it will become the seventh major sect.<br/><br/>In this world, the strength of a force is always measured by its strongest individual.<br/><br/>The Qin Family is currently ranked first among the Nine Families because the Patriarch of the Qin Family has the strongest power.<br/><br/>The Culture Institute is the foremost among the six major sects because they have a Celestial Being.<br/><br/>The Zhao Family is the world’s co-ruler because they not only have an Unleaking Realm expert in the palace, but also a Celestial Being.<br/><br/>Even those Unleaking Realm experts who hold major grudges rarely make a move.<br/><br/>In the five hundred years since the establishment of Great Zhou, the number of Unleaking Realm experts who have fallen can be counted on one hand.<br/><br/>That’s because it takes a huge price to kill an Unleaking Realm expert.<br/><br/>Eighteen years ago, her Wu Family’s ancestor was besieged by several Unleaking Realm experts and a few Sword Saints. But he still held on for half a month, ultimately dying due to life exhaustion.<br/><br/>Before that, it was a hundred years ago when the previous head of Dao Sect died after being attacked by the Red Bright Heaven.<br/><br/>The difficulty of exterminating an Unleaking Realm expert is clear to see.<br/><br/>It’s my fault he’s in this situation!<br/><br/>A tremor rocked Ling Ling’s heart.<br/><br/>She clenched her sword tightly and flew resolutely toward the cave’s entrance.<br/><br/>Gu Yang faced the enemy alone for her—how could she ever save herself?<br/><br/>Shortly after, she arrived at the cave entrance and saw Gu Yang’s towering figure, standing alone with his blade, blocking all enemies outside. His arrogant figure was oh so familiar.<br/><br/>This man, no matter how strong the enemy, he has never flinched.<br/><br/>It was like this when he was in the Mortal Realm, and it is still the same now.<br/><br/>Even though he now faces the strongest warrior in the world.<br/><br/>Gu Yang didn’t turn around, nor did he say a word to her, but between them was a full understanding.<br/><br/>Ling Ling stood behind him, feeling the pressure lessen. It allowed her to directly face the Unleaking Realm expert in front of them.<br/><br/>“Die!”<br/><br/>Red Sun moved, giving up his flashy moves for the most primitive, yet most powerful method of Unleaking Realm experts – brute force.<br/><br/>Having become an Unleaking Body, he had accessed the human body’s secret potentials, stretching his strength to the utmost. The strength of his Mortal Body was enough to rival ancient Divine Beasts.<br/><br/>This punch nearly collapsed space itself.<br/><br/>The ultimate speed surpassing human nerve reaction time.<br/><br/>None in the crowd could clearly see his figure.<br/><br/>His Unleaking body even insulates Mana, suggesting a sense of imperviousness to all methods.<br/><br/>The strength of the Unleaking Realm’s strongman was fully showcased under this punch.<br/><br/>A common Mana realm, facing this punch, would only meet an instant death.<br/><br/>Boom!<br/><br/>A fist solidly collided with the Red Sun’s fist.<br/><br/>Monstrous strength formed a shock wave that swept out radially from them.<br/><br/>Rocks crushed, trees uprooted.<br/><br/>Within ten meters around them, the ground was plowed.<br/><br/>Red Sun’s punch which he was intent on delivering was oddly blocked.<br/><br/>He felt an indescribable force suddenly crashed into him, causing a thud in his chest and a choke in his breath, he fell and flew out uncontrollably.<br/><br/>He only stopped after flying out over ten meters.<br/><br/>“This…how is this possible?”<br/><br/>Seeing Gu Yang stand there, not swaying in the slightest, Red Sun looked horrified, like he had just seen a ghost.<br/><br/>He had exploited all the potential of the human body, and could compete with ancient divine beasts solely with his physical body.<br/><br/>Normally, this punch should obliterate anyone not in the Mana realm.<br/><br/>Only someone wielding a peerless divine weapon could possibly withstand this blow.<br/><br/>Yet Gu Yang, merely of the Mana realm, endured his punch and even pushed him back.<br/><br/>Did this imply this kid’s strength exceeded his?<br/><br/>Red Sun’s heart surged with both shock and anger.<br/><br/>Impossible!<br/><br/>He flew up again, both of them abandoned all tricks, struggling simply with strength and speed.<br/><br/>Boom Boom Boom!<br/><br/>In a blink of an eye, they had exchanged blows countless times and each collision caused a terrifying shock wave.<br/><br/>The spectators, both the followers of Red Venerate and Ling Ling, had to retreat from afar, fearing they would be hit by the wave.<br/><br/>This combat was beyond their imagination, there was no use of Mana, and no fancy moves, there was only extreme speed and extreme power.<br/><br/>In the face of such power, even powerful practitioners in the Mana realm felt their Mana was as flimsy as paper.<br/><br/>The so-called Golden Body was simply useless against such strength.<br/><br/>None among the crowd didn’t feel their hearts chilling.<br/><br/>Not far away, Pei Qianlan, hearing the distant turbulence, was burning with impatience, wishing she could rush over to help.<br/><br/>On the side, Wu Er was sitting on a stone, his face complicated, muttering, “What a formidable kid …”<br/><br/>Gu Yang’s current strength completely exceeded his imagination.<br/><br/>Just relying on his physical strength, he was able to compete with the Red Sun of the first Unleaking realm, even gaining the upper hand.<br/><br/>What will he become when he reaches the Unleaking realm?<br/><br/>He was worried before.<br/><br/>By now, he knew his concerns were unnecessary.<br/><br/>With Gu Yang’s strength, he might find it difficult to kill Red Sun, but retreating safely with Ling Ling would certainly be easy.<br/><br/>You should know, he hasn’t even drawn his Phoenix Feather Knife!<br/><br/>Boom!<br/><br/>By the eighteenth punch, Red Sun could no longer tolerate such violent force, and was directly blasted off, crashing into a mountain peak, causing the whole peak to collapse dramatically.<br/><br/>The followers of Red Venerate were scared to their spirits and were shocked that their leader was actually losing to the kid.<br/><br/>“I want you dead!”<br/><br/>Bang!<br/><br/>The mountain peak exploded, a terrifying force erupted to an extreme point.<br/><br/>A round of red fire rose, just like a scorching Sun, that was too dazzling to look directly at.<br/><br/>Red Sun was desperate, turning his life force into Mana, thus unleashing a power that should not have emerged in this world.<br/><br/>Gu Yang, who was beneath, grew more solemn and finally raised his Phoenix Feather Knife as he faced the frenzied Red Sun.<br/><br/>Just then, a tower soared above his head, expanding continuously, it was none other than the precious Demon Suppression Tower of the Dao Sect.<br/><br/>Gu Yang felt the Mana within him stagnate, suppressed by the Demon Suppression Tower.<br/><br/>Red Sun, now in Unleaking Realm, had managed to display part of this sacred object’s power.<br/><br/>He roared aloud, “Absorb!”<br/><br/>A strong suction appeared at the bottom of the Demon Suppression Tower.<br/><br/>Gu Yang and Ling Ling felt the mana and True Essence in their bodies being unstable and were involuntarily absorbed into the Demon Suppression Tower, vanishing in the blink of an eye.<br/><br/>“You all stay out.”<br/><br/>Red Sun ordered and completely transformed into a flame, flying into the Demon Suppression Tower on his own initiative.<br/><br/>It was the right way to use the precious Demon Suppression Tower, absorbing people into the tower, and then entering in his own body to execute the enemies.<br/><br/>As the owner, he had an absolute advantage in the tower.<br/><br/>And, in the tower, he could also draw on the power of the divine lord.<br/><br/>He vowed not to be human if he could not kill Gu Yang.\t\t\t\t\t\t</div>", "images": {}, "success": true}