{"id": 285, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132171.html", "title": "Chapter 285 - Chapter 285: 285 You Are Not Qualified To Negotiate Terms With Me.", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 285 - Chapter 285: 285 You Are Not Qualified To Negotiate Terms With Me.</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 285: 285 You are not qualified to negotiate terms with me.<br/><br/>Among the legendary Beastmasters, Mu Jun’s power wasn’t at the pinnacle, but his fame in the Ruivan Continent was tremendous, being the most famous adventurer, the “King of Illusionary Techniques”.<br/><br/>The origin of this nickname was solely because of his Overlord-level Fantom Jade Butterfly.<br/><br/>Compared to his Overlord-level Earth Bear, the Fantom Jade Butterfly was far more famous.<br/><br/>This pet beast that could create realistic illusions was incredibly rare. Almost all pet beasts found it challenging to break free from its illusions.<br/><br/>Even Overlord-level pet beasts could be disturbed, giving him time to leave at ease.<br/><br/>This is what gave him his confidence. So far, no matter who he had faced, as soon as the Fantom Jade Butterfly made its move, he could escape unharmed.<br/><br/>He believed, this time too, would not be an exception.<br/><br/>“After we leave here, immediately summon the mentor.”<br/><br/>Mu Jun was a very decisive person, he had been to so many ruins, faced countless dangers, and his survival up to now was due to this decisiveness.<br/><br/>If it’s unachievable, he’d leave immediately, without being greedy.<br/><br/>When his opponent released an Overlord-level extraordinary creature, he knew there was hardly any possibility of capturing this person.<br/><br/>Even if he could win the fight, the opponent could most likely escape.<br/><br/>If that’s so, why even bother fighting, better to go back quickly and summon the mentor.<br/><br/>He might not reap all the benefits, but he could still get a piece of it.<br/><br/>Just as Mu Jun was about to flee, a sense of alarm arose in his heart. Raising his head sharply, he saw that “person” looking towards him. His penetrating gaze appeared to pass through the illusion, piercing directly into his soul.<br/><br/>Hum!<br/><br/>He felt a moment of blankness in his mind.<br/><br/>The next moment, that knife hit his shield. The shield, formed from the Overlord-level power, shattered under this single strike.<br/><br/>Pu!<br/><br/>Mu Jun, as though struck by lightning, spat out a mouthful of blood on the spot.<br/><br/>The Fantom Jade Butterfly that had been resting on his other shoulder vanished like a bubble, returning to the Beast-taming Space due to heavy damage.<br/><br/>It’s over!<br/><br/>Mu Jun’s mind went blank, with a figure of the Grim Reaper looming before his eyes.<br/><br/>Just as the blade was about to fall onto his head, it suddenly paused, hovering above him, not falling.<br/><br/>“He’s scared to piss his pants, scared to piss his pants…”<br/><br/>The parrot, flapping its wings, shrieked in fluster.<br/><br/>Looking at the man who appeared before him, with a stupefied gaze, Mu Jun felt like falling into an ice cavern.<br/><br/>Suddenly, he remembered a phrase his mentor had spoken: “If you rely too heavily on the Fantom Jade Butterfly, you’ll eventually stumble upon it.”<br/><br/>Today, that prediction had come true.<br/><br/>Meanwhile, on the other side, the battle between the two monster beasts also had a conclusion.<br/><br/>The Divine Ape finally pinned the Black Bear to the ground and pummeled it. The iridescent glow on the bear’s body lasted only three blows before it began to fade.<br/><br/>The Divine Ape’s fists rendered the bear’s face into a bloody pulp, leaving it on the brink of death. Then, it triumphantly struck its chest as if flaunting its strength, the victor over the bear.<br/><br/>The Black Bear then disappeared in a flash, returning to the Beast-taming Space.<br/><br/>Gu Yang did not kill the other-worldly human. A slight smile appeared on his face, “Now, we can talk.”<br/><br/>Upon hearing these words, Mu Jun felt a chill down his spine.<br/><br/>From his opponent’s eyes, he could guess his intentions.<br/><br/>Strangely enough, he thought of the woman he had captured yesterday. It truly was a turn of karma, his fate now mirrored hers.<br/><br/>“Let’s go.”<br/><br/>Gu Yang called back the Divine Ape, grabbed Mu Jun with one hand, greeted King Jinghai and then flew away, disappearing out of sight.<br/><br/>Leaving behind Han Mengling and the others in a devastated land, their faces blank in shock.<br/><br/>“He has actually reached this point…”<br/><br/>Recalling how just a few months ago, this young man was barely in the First Rank in cultivation. Now he had exceeded him at his peak. The Sword Saint felt an indescribable feeling rising in his heart.<br/><br/>For the past few months, he frequently heard about Gu Yang, and, despite the shock, at least he was somewhat mentally prepared.<br/><br/>The most dumbfounded was the King of Jinghai.<br/><br/>He was still unable to react. How had he finished his retreat only to find that his younger brother’s cultivation level had surpassed his own?<br/><br/>Could it be that he didn’t retreat for just a few months, but for several decades?<br/><br/>Gu Yang took Mu Jun to a mountain hundreds of miles away before setting him down.<br/><br/>“How did you break through the illusions of the Fantom Jade Butterflies?”<br/><br/>Mu Jun genuinely couldn’t understand. The illusion techniques of the Fantom Jade Butterflies had always been invincible. How could they fail here? If he didn’t get a clear answer, he wouldn’t be able to rest in peace even in death.<br/><br/>Gu Yang said, “I have a divine power that can see through certain illusions.”<br/><br/>He was not lying. His “Divine Candle Technique” was now at the fifth layer. The Candle Dragon was born with the ability to see through illusions, which can be called the true eyes, the nemesis of all illusions.<br/><br/>He borrowed the divine power of the Candle Dragon and easily saw through this illusion.<br/><br/>Using illusions in front of him, who possessed the divine power of the Candle Dragon, was really like swinging a big knife in front of Guan Gong.<br/><br/>“So that’s how it is, I lost fairly.” Mu Jun gave a wry smile.<br/><br/>Gu Yang’s gaze fell on the flower on his chest, “You can understand my words, thanks to this flower, right?”<br/><br/>He could sense a special fluctuation from this flower, similar to that of magical tools.<br/><br/>Mu Jun said, “This is the Understanding Flower, a special superlife, that can translate any language of intelligent life of its own accord. It’s an indispensable tool for adventurers.”<br/><br/>Having said this, he paused and said, “Now that you have chosen not to kill me, you obviously want something. I can tell you everything I know, as long as you don’t kill me and my pets.”<br/><br/>His attitude at this moment was as humble as Han Mengling’s yesterday.<br/><br/>Gu Yang laughed, “You’re very smart. But do you think you’re still in a position to negotiate with me?”<br/><br/>Mu Jun was not frightened at all. “We Beastmasters have a way to commit suicide. If I want to die, you can’t stop me. I assure you that after my death, you won’t meet a second Beastmaster or gain any knowledge about Beastmasters.”<br/><br/>“Threatening me?”<br/><br/>Gu Yang scoffed and suddenly knocked him unconscious with a palm strike.<br/><br/>Then, he opened the system and initiated a simulation.<br/><br/>[…you defeated the Beastmaster from another major continent, captured him alive and forced him to disclose the cultivation methods of Beastmasters. Half a year later, as agreed, you let him go.]<br/><br/>[One day, Saint Chao Yang appeared, captured you alive. One year later, you died due to the exhaustion of your origin. You died at age twenty-three.]<br/><br/>“Did you really think I couldn’t handle you?”<br/><br/>Gu Yang looked at the unconscious Mu Jun. How about now? I will let you see what an outside hack is.<br/><br/>[Simulation ends, you can retain one of the following.]<br/><br/>[1. Martial arts realm at age twenty-three.]<br/><br/>[2. Martial arts experience at age twenty-three.]<br/><br/>[3. Life wisdom at age twenty-three.]<br/><br/>“I choose number two.”<br/><br/>Immediately, a myriad of strange knowledge flooded into Gu Yang’s mind.<br/><br/>On how to become a Beastmaster, how to capture supernatural creatures, how to make contracts, how to cultivate pets…<br/><br/>This is almost a complete cultivation system. The relevant knowledge is simply too much.<br/><br/>Just organizing this knowledge took him quite a bit of time.<br/><br/>There are two key points to becoming a Beastmaster – having a Beast-taming Space, and being able to form contracts with supernatural beings.<br/><br/>The strength of a Beastmaster is judged by the level of his Beast-taming Space.<br/><br/>Inferior Beast-taming Spaces cannot confine high-level supernatural beings. Even if such beings are tamed and put into the Beast-taming Space, they can easily break free.<br/><br/>That means Gu Yang’s previous idea of letting an ordinary person tame a celestial beast monster and become an instant success is impossible.<br/><br/>The weakest apprentice Beastmaster’s Beast-taming Space is very fragile. Not to mention celestial realm beasts, it can’t even fit a Golden Body realm beast. Perhaps even a sneeze from the beast could break the Beast-taming Space apart.<br/><br/>The strength of the Beast-taming Space is related to the Beastmaster’s own knowledge and mental strength.<br/><br/>This is somewhat similar to sorcerers from the West Bank Continent.<br/><br/>After Gu Yang organized all the knowledge, he closed his eyes and recalled the contents about Beastmasters…<br/><br/>PS: Here’s the second update for today, asking for monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}