{"id": 280, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132161.html", "title": "Chapter 280 - Chapter 280: How Did I Provoke Such A Powerful Enemy? {Third Update}", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 280 - Chapter 280: How Did I Provoke Such A Powerful Enemy? {Third Update}</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 280: How did I provoke such a powerful enemy? {Third update}<br/><br/>“What just happened?”<br/><br/>Although Gu Yang was worried about Pei Qianlan, he thought with Wu Er around, nothing too bad would happen. He suppressed his concern and asked Ling Ling about what just had transpired.<br/><br/>Ling Ling shook her head and said, “I don’t know, Master once told me when he passed the Sky Pearl to me that it could control the Demon Suppression Tower. In the urgent situation just now, I was thinking if I could give you a hand, but I didn’t expect…”<br/><br/>“Regardless, the loss of the Demon Suppression Tower is a good thing for that fellow from the Red Sun.”<br/><br/>That was all Gu Yang could say.<br/><br/>As he spoke, he couldn’t help but look at the sword in his hand. The Primordial Spirit within the sword was already gone.<br/><br/>Its spirituality remained, but it would no longer actively transmit thoughts and call him “Master”.<br/><br/>In such a short period of time, the Primordial Spirit had already been obliterated.<br/><br/>No wonder he had encountered so many peerless divine weapons, but not one had a Primordial Spirit.<br/><br/>It seems that not only cultivators were affected by the death of the Way of Heaven, but also the Primordial Spirit within the magic treasures.<br/><br/>If his guess was correct, the elderly man inside the Demon Suppression Tower was also a Primordial Spirit. Affected by the drastic changes in the world, he had been in a deep sleep until now.<br/><br/>But inadvertently he had woken him up.<br/><br/>From this point of view, this Demon Suppression Tower is no ordinary magic treasure. The Primordial Spirit could exist for such a long time.<br/><br/>According to the dean, it should have been at least ten thousand years since the death of the Way of Heaven.<br/><br/>“Where would the Demon Suppression Tower have flown to?”<br/><br/>Gu Yang looked in the direction where it disappeared and asked.<br/><br/>Ling Ling shook her head. Her knowledge of the Demon Suppression Tower was limited to knowing it was a treasure of the Dao Sect.<br/><br/>Gu Yang thought in his heart, “I hope it will not have a significant impact on the future.”<br/><br/>“Let’s go.”<br/><br/>Gu Yang quickly figured out that they were in Jingzhou.<br/><br/>The speed of the Demon Suppression Tower was too fast.<br/><br/>Traveling from Yunzhou to Jingzhou would require passing four or five prefectures, at least ten thousand kilometers. They had been in the Demon Suppression Tower for no more than an hour.<br/><br/>They were not far from Jingzhou City.<br/><br/>Ling Ling asked, “Aren’t we going to Jingzhou City?”<br/><br/>Gu Yang shook his head, “No need, let’s not give Brother Wu more trouble.”<br/><br/>He was already in too much trouble; it was better not to involve King Jinghai.<br/><br/>Being in a weak state, they found an uninhabited mountain range and took a rest in a cave after figuring out where they were.<br/><br/>Being in Jingzhou, thousands of miles away, Gu Yang no longer needed to worry about being pursued by Shen Yun.<br/><br/>While Ling Ling was sitting in meditation to recover her strength inside, he quietly opened the system.<br/><br/>After the awakening of the Primordial Spirit of the Demon Suppression Tower, it disappeared with this supreme treasure.<br/><br/>He always felt a bit uneasy and thought he should run a simulation.<br/><br/>“At the age of twenty-two, you were at the third-level of Mana, killed the Red Sun, the leader of the Red Venerate Sect, in the Immeasurable Mountain, causing a sensation in the world.”<br/><br/>“You inadvertently woke up the Demon Suppression Tower and freed it from the control of the Red Sun, causing it to fly away.”<br/><br/>“You and Ling Ling have arrived in Jingzhou. After recovering, on your way to Jiangzhou, you hear news that Jingzhou City was destroyed and King Jinghai was killed. You decide to avenge King Jinghai and return to Jingzhou.”<br/><br/>“You spent half a month investigating the matter but made no progress. With a month’s agreement with Wen Jue, the head of Dao Sect, you decided to leave first.”<br/><br/>“When you appeared in Divine City, Saint Chao Yang appeared immediately and took you away.”<br/><br/>“One year later, due to the exhaustion of your original energy, you died at the age of twenty-three.”<br/><br/>King Jinghai met with an accident?<br/><br/>Gu Yang started feeling uneasy halfway through the simulation.<br/><br/>Furthermore, it occurred precisely during these few days.<br/><br/>He immediately became restless.<br/><br/>He owed King Jinghai a huge favor because of Pei Qianlan’s incident.<br/><br/>This was the man he admired the most since he crossed over, and it would be too regrettable if he just died like that.<br/><br/>“The simulation has ended. You may keep one of the following conditions.”<br/><br/>“First, your martial arts realm at the age of twenty-two.”<br/><br/>“Second, your martial arts experience at the age of twenty-three.”<br/><br/>“Third, your wisdom of life at the age of twenty-three.”<br/><br/>“I choose the first one.”<br/><br/>Gu Yang’s exhausted Mana was instantly restored.<br/><br/>However, he didn’t rush to rescue anyone and ran another simulation.<br/><br/>“You head to Jingzhou City and encounter a powerful man from a different continent. After a battle, the enemy retreats.”<br/><br/>“Several days later, a stronger man from the continental foreign lands appears. You are sealed and brought to the foreign land through a teleportation array. At the critical moment, Saint Chao Yang appears and saves you. However, he encounters a siege from several strong men of the foreign land.”<br/><br/>[In an earth-shattering battle, the Saint Chaoyang had no time to consider your wellbeing. You died in the aftermath of the fight. You lived until the age of twenty-two.]<br/><br/>What the hell?<br/><br/>Gu Yang felt a cold shiver run down his spine.<br/><br/>The assailants on Jingzhou City were actually powerful beings from another continent. To escape their clutches required at least a cultivation level of the Unleaking Realm.<br/><br/>And what was even more outrageous was the presence of someone strong enough to capture him alive was clearly a Celestial Being.<br/><br/>The crux was why would he be captured alive and taken to a different continent?<br/><br/>In the end, it was Saint Chaoyang who came to his rescue, which was almost black comedy.<br/><br/>However, it appeared that the strength of the other continent surpassed that of Great Zhou. Several Celestial Beings actually ambushed Saint Chaoyang.<br/><br/>Saint Chaoyang, who was only a step away from the Hollow Void realm, could not withstand it either.<br/><br/>“How did Wu Brother provoke enemies like these?”<br/><br/>Gu Yang couldn’t quite understand it.<br/><br/>Typically, a practitioner of King Jinghai’s Golden Body cultivation level wouldn’t attract enemies from the Unleaking Realm.<br/><br/>Even when he was at the Golden Body realm, he hadn’t had enemies from the Unleaking Realm causing him trouble.<br/><br/>[Simulation ends, you can choose to retain one of the following options.]<br/><br/>“I choose two.”<br/><br/>Immediately, Gu Yang’s mind was flooded with memories of several battles.<br/><br/>“What is this all about?”<br/><br/>The memories of those battles were completely different from what he had imagined.<br/><br/>He had anticipated facing sorcerers like Lily, but the reality was far from that.<br/><br/>His opponents were immensely powerful Monster Beasts. Although they were in the Unleaking Realm, their combat capability was absurdly high. Even his four divine beast incarnations were unable to kill those two Monster Beasts, which had managed to escape.<br/><br/>The second battle was even more absurd, it was against a Phoenix. To be precise, a dead Phoenix, the Ming Huang.<br/><br/>This Ming Huang, with the cultivation level of a Celestial Being, defeated all his four divine beast incarnations singlehandedly and then sealed him away.<br/><br/>Once he arrived on the other continent, all of Saint Chaoyang’s battles involved various powerful Monster Beasts, each more eccentric than the last.<br/><br/>The majority of them were different types of dragons, such as the Frost Dragon, Thunder Dragon, Dark Dragon…<br/><br/>Could the cultivation system of that other continent be comprised of Beastmasters?<br/><br/>Gu Yang already had a guess in his mind. Whether it was true or not still needed verification.<br/><br/>“Again.”<br/><br/>He activated the Simulator once again.<br/><br/>[…taking Ling Ling with you to Tianzhu Mountain, you meet Su Qingzhen, reach Luo Prefecture, kidnap Chu Xiyue, take them into Guanghan Immortal Palace, with Chu Family’s ancestor also arriving in time to enter the palace.]<br/><br/>[The Chu Family ancestor kills the Monster Beast guarding the entrance and transfers the remaining power to Chu Xiyue before his death.]<br/><br/>[You guys cultivate hard within the Guanghan Immortal Palace.]<br/><br/>[Five years later, someone suddenly intrudes into the Guanghan Immortal Palace, you clash with the person, start a fight, and all are killed. You lived until the age of twenty-seven.]<br/><br/>“I knew it.”<br/><br/>Seeing the final result, Gu Yang couldn’t help but sigh.<br/><br/>It was clear that the person who broke into the Guanghan Immortal Palace had something to do with the Primordial Spirit of the Demon Suppression Tower.<br/><br/>He had anticipated this for a while, this incident would definitely cause vast and profound repercussions.<br/><br/>Like the strong figure from the other continent who inexplicably appeared in Jingzhou City, it might also be related to the incident.<br/><br/>With this, another safe place to grind experience was gone.<br/><br/>[Simulation ends, you can choose to retain one of the following options.]<br/><br/>“I choose one.”<br/><br/>After making his decision, Gu Yang found that the growth of his Mana was negligible.<br/><br/>“What’s going on?”<br/><br/>He was a little puzzled. He had been in the Guanghan Immortal Palace for five years. Surely he couldn’t have made no progress?<br/><br/>Unless…<br/><br/>Third Stage Mana Peak!<br/><br/>His Mana had reached the limit of this realm and couldn’t improve any further.<br/><br/>“Does this mean I’ve hit a bottleneck?”<br/><br/>A bottleneck, what a far-fetched term!<br/><br/>Ever since he started practicing “Phoenix Dance Nine Heavens”, he had not experienced any bottlenecks.<br/><br/>PS: Third update, seeking monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}