{"id": 282, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132165.html", "title": "Chapter 282 - Chapter 282: 282 Dragons?", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 282 - Chapter 282: 282 Dragons?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 282: 282 dragons?<br/><br/>“What a miraculous world.”<br/><br/>A tall man dressed in a golden robe, was strolling the streets of Jingzhou City. He marveled at the sights while speaking to the parrot on his shoulder.<br/><br/>This was a blue-feathered parrot, currently preening its feathers with its long beak.<br/><br/>The man and bird, both seemingly enthusiastic, were taking in the sights of the city as if everything felt novel and exciting.<br/><br/>The pedestrians on the street didn’t look any different from the inhabitants of the Ruqin Continent.<br/><br/>However, the attire, the language they used, and the architecture here were entirely different from that on the Ruqin Continent.<br/><br/>Moreover, this city was enormous and flourishing with activity.<br/><br/>Even the most prosperous city center in the Ruqin Continent could not compare to this city.<br/><br/>This man and bird were visitors from another continent.<br/><br/>The man was called Mu Jun, a legendary Beastmaster who possessed an overlord-level beast.<br/><br/>He had been exploring some ruins when he unintentionally got transported to this unfamiliar continent.<br/><br/>Discovering a new continent was like finding a treasure to him.<br/><br/>As a top power in the Ruqin Continent, he was audacious enough to venture alone into this city to investigate.<br/><br/>“Look, without relying on a pet beast, the man solely depends on his strength, yet he can wield such immense power.”<br/><br/>Suddenly, Mu Jun saw two men duelling with weapons, which made his eyes light up.<br/><br/>The strength exhibited by these two was on par with a super-level beast.<br/><br/>Moreover, neither of these men bore the power of a pet beast.<br/><br/>Since he arrived at this continent, he had not seen anyone using pet beasts. Even in the wilderness, he had not seen any extraordinary creatures.<br/><br/>Indeed, it was a magical place.<br/><br/>The parrot on his shoulder started squawking, “Incredible! Incredible!”<br/><br/>“From their conversation, it seems these people who have vast powers are called Martial Artists.”<br/><br/>On the chest of Mu Jun was a small purple flower.<br/><br/>This plant, known as Understanding Flower, was an extraordinary plant. If worn on the body, it could translate and help one understand any language, serving as a natural translator.<br/><br/>He was extremely intrigued by this superhuman power that one could possess, independent of a pet beast.<br/><br/>This was the most valuable thing he had discovered so far.<br/><br/>Even though he was a legendary power, his strength stemmed from the overlord-level beast and a monarch-level beast that he possessed.<br/><br/>Without his beasts, his own power would not even match the two martial artists before him.<br/><br/>Now that he had seen individuals with such vast powers, how could he not be moved?<br/><br/>Suddenly, enforcers in uniform arrived, captured the two brawling individuals, and took them away.<br/><br/>It seemed these were the officials of the city.<br/><br/>Mu Jun passed by a tavern-like establishment. Hearing people inside discussing about the recent brawl, he walked in.<br/><br/>As an experienced explorer, he knew that collecting information is crucial when arriving at a new place.<br/><br/>“A couple of Third Ranks, daring to stir up trouble in Jingzhou City.”<br/><br/>“Ever since the prince has ascended to the Divine Power realm, he has not shown up. These people seem to think that the Prince’s residence is now weak.”<br/><br/>“I heard that the princess has also broken into the Divine Power realm.”<br/><br/>“Hush, quiet down. If the Prince’s house hears us, we’re doomed.”<br/><br/>“How does it matter if they overhear us? If the Prince’s residence has guts, let them erase the name from the Beauty List.”<br/><br/>“Don’t even mention it. That woman, ever since she has been with Gu Yang, her cultivation level has skyrocketed.”<br/><br/>“He himself has already reached the Mana realm.”<br/><br/>In the inn, there was a woman wearing a bamboo hat, sitting alone in a corner. On hearing a familiar name, she slightly lifted her head, muttering the name, “Gu Yang…”<br/><br/>This woman was Han Mengling, the close-door disciple of the Asura Sword Saint. She had once spent some time with Gu Yang.<br/><br/>However she was no longer a young girl. Just a few short months had seemingly aged her by ten years. She was now a woman in her early twenties.<br/><br/>Two months ago, after she had broken into the Divine Power realm, she had quietly left the Secret Realm.<br/><br/>Now, she had astonishingly reached the second level of the Golden Body realm, her cultivation speed far outpacing that of Pei Qianlan and Su Qingzhen.<br/><br/>She had come to Jingzhou City this time to meet the Emperor’s Supreme Sword Saint.<br/><br/>Her master had old connections with the Emperor’s Supreme Sword Saint.<br/><br/>Han Mengling had complex feelings towards Gu Yang. For a while, she had been by his side, and what struck her the most was the indescribable allure this man possessed.<br/><br/>Even women like Su Qingzhen, Pei Qianlan, and Xu Ruomei were utterly bewitched by him.<br/><br/>Fortunately, she was still young and had not fallen into the seductive charm of that man.<br/><br/>This was also the reason she decided to leave after breaking through to the Divine Power realm.<br/><br/>She always felt that staying by that man’s side for too long would make her act foolish, just like Su Qingzhen and Pei Qianlan. By then, she wouldn’t even be able to leave if she wanted to.<br/><br/>As Han Mengling was thinking, she suddenly felt a bone-chilling cold, and couldn’t help but feel her hairs stand on end.<br/><br/>The Mana realm?<br/><br/>The Unleaking realm?<br/><br/>This was the gaze of a terrifyingly powerful being.<br/><br/>Suppressing the urge to look up, she stood up and left the inn.<br/><br/>Behind her, a unique set of footsteps followed, and soon, walked alongside her.<br/><br/>Han Mengling felt a terrifying murderous intent locking onto her, causing a thin layer of sweat to bead on her forehead.<br/><br/>“Don’t be afraid, I just want to ask you a few things.”<br/><br/>A voice filled with masculine magnetism echoed in her ears.<br/><br/>For some reason, this sentence sounded somewhat strange.<br/><br/>Han Mengling did not resist, the gap was too big, she didn’t have a shred of chance to win.<br/><br/>With such a big gap, even if Gu Yang came, he would be helpless, right?<br/><br/>Soon, the man took her to an uninhabited mansion.<br/><br/>The man asked, “In your world of martial artists, what are the different levels from weak to strong?”<br/><br/>Your martial artists?<br/><br/>Upon hearing this title and thinking of the strange accent of the man, Han Mengling was greatly shocked as she realized she might have stumbled upon an extremely rare incident.<br/><br/>In a dry voice, she said, “The Mortal Realm, which is divided into nine ranks. Above it are the Golden Body Realm, the Mana Realm, the Unleaking Realm, and finally, the Celestial Being realm…”<br/><br/>This man who had kidnapped Han Mengling was none other than the legendary Beastmaster Mu Jun from the Ruqin Continent.<br/><br/>He asked, “Which realm does your power belong to?”<br/><br/>“Second level of Golden Body.”<br/><br/>He immediately had a comparison in his mind. The Golden Body realm, is roughly equivalent to the beast at the Overlord level.<br/><br/>The Mana realm corresponds to the King level.<br/><br/>The Unleaking Realm must be the Overlord Level.<br/><br/>As for the highest Celestial Being, it could only be equivalent to the Totem level or legendary level.<br/><br/>With this thought, Mu Jun furrowed his brows. If he encountered a warrior at the Totem level, he was certainly not his match.<br/><br/>“How many in the Celestial Being realm exist here?”<br/><br/>“I don’t know the exact number, but there are two that are universally acknowledged…” Han Mengling was very cooperative and informed him about everything she knew.<br/><br/>Mu Jun asked in great detail and learned about the strongest forces present on this continent.<br/><br/>One entire day was spent like this in questioning.<br/><br/>The most asked question was about how these martial artists practiced cultivation, he even asked this woman to demonstrate it.<br/><br/>Unknowingly, a night passed.<br/><br/>Mu Jun was completely engrossed in the fascinating cultivation system of this world, this cultivation method that did not rely on beasts but returned the power to oneself was nothing short of ingenious.<br/><br/>He made up his mind, he was determined to master the martial arts of this place.<br/><br/>The value of this knowledge was immeasurable.<br/><br/>If he could take it back to the Ruqin continent and spread this martial arts, he would become a great figure comparable to the legendary Beastmaster.<br/><br/>Just as he was thinking, suddenly, a strong aura surged towards the sky from not far away.<br/><br/>Immersed in his cultivation, Mu Jun exclaimed, “A dragon?”\t\t\t\t\t\t</div>", "images": {}, "success": true}