{"id": 286, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132173.html", "title": "Chapter 286 - Chapter 286: 286 Immortal Underworld Phoenix (Third Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 286 - Chapter 286: 286 Immortal Underworld Phoenix (Third Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 286: 286 Immortal Underworld Phoenix (Third Update)<br/><br/>“It really isn’t that simple.”<br/><br/>An hour later, Gu Yang opened his eyes and couldn’t help but sigh.<br/><br/>Originally, he had wanted to directly construct the Beast-taming Space, but he had shamelessly failed.<br/><br/>He had thought that with the strength of his Original Spirit, constructing a Beast-taming Space would be a trifle. However, reality had slapped him across the face once again.<br/><br/>He should not have had any expectations for his own aptitude.<br/><br/>“Would you like to use the Life Simulator? Use once, consumes forty points of energy.”<br/><br/>“Yes.”<br/><br/>He would be better off just honestly using the Simulator.<br/><br/>“…you followed Mu Jun to Ruiqin Continent, and with his help, you spent three years successfully constructing a Beast-taming Space, becoming an Apprentice Beastmaster. ”<br/><br/>“You allowed Mu Jun to leave as he wished and then, you left the Ruins and found a deserted place to cultivate in seclusion.”<br/><br/>“Five years later, after relentless efforts, you finally upgraded your Beast-taming Space and became a Junior Beastmaster.”<br/><br/>“One day, you sensed a battle nearby between Celestial Beings and had to leave your secluded cultivation.”<br/><br/>“Soon, you discovered the calamities of war spread across Ruiqin Continent. You learned that invaders from a different continent had arrived. Several legendary Beastmasters had already been killed in battle.”<br/><br/>“The flames of battle quickly spread to the mainland, and half a year later, you could not escape the war. You were captured by a strong Celestial Being and taken to the Immortal Palace, held captive in the Immortal Prison. Half a year later, you died at the age of thirty-one after your Mana was completely drained.”<br/><br/>My goodness, those people from the Immortal Palace were even at war on Ruiqin Continent.<br/><br/>It seems like they want to unify this dimension.<br/><br/>Just what is the origin of this Immortal Palace? Why are there so many strong individuals there?<br/><br/>It feels as though they could effortlessly wipe out Great Zhou, then invade numerous other worlds. I wonder if the Four Great Sacred Lands managed to escape their clutches.<br/><br/>“Simulation over, you can choose to retain one of the following.”<br/><br/>“One, your Martial Arts Realm when you were thirty-one years old.”<br/><br/>“Two, your Martial Arts experience when you were thirty-one years old.”<br/><br/>“Three, your life wisdom when you were thirty-one years old.”<br/><br/>“I choose one.”<br/><br/>Suddenly, he felt an odd space in his mind, which was the Beast-taming Space.<br/><br/>This feeling was incredibly novel.<br/><br/>Now, he just needed to sign a contract with any extraordinary being or Monster Beast, and he could place them in the Beast-taming Space.<br/><br/>In the Beast-taming Space, pets can grow and evolve at an accelerated rate. If scientifically fed as well, pets could level up much faster than extraordinary creatures in the wild.<br/><br/>Moreover, the higher the level of the Beast-taming Space, the more advantageous it would be for the pets.<br/><br/>It must be said, this Beast-taming Space was pretty amazing.<br/><br/>According to Mu Jun, this kind of Beast-taming Space was researched and developed by the God of Beastmasters on Ruiqin Continent thousands of years ago.<br/><br/>It was said that thousands of years ago, that continent was filled with extraordinary creatures, and humans could only barely survive. It was only after the appearance of Beastmasters that humans finally stood up and became the dominators of the continent.<br/><br/>Gu Yang couldn’t help but feel a bit moved, wondering if that continent had the Divine Beast he needed.<br/><br/>Perhaps he might have to visit that continent in the future.<br/><br/>He looked at Mu Jun, who was still unconscious, and used his Mana to gather some water and splash it on the latter’s face.<br/><br/>Mu Jun jerked awake and, upon seeing Gu Yang and recalling his current situation, he was filled with suppressed anger.<br/><br/>Just then, he saw a movement by Gu Yang, his eyes nearly bulging out of their sockets.<br/><br/>“A Beast-taming Space?”<br/><br/>Fear was evident in his shocked face.<br/><br/>Did Gu Yang actually possess a Beast-taming Space?<br/><br/>Although the level was low, there was no doubt that he was a Beastmaster.<br/><br/>Could it be that he was also from Ruiqin Continent?<br/><br/>Countless thoughts intertwined in his mind, ultimately transforming into endless fear.<br/><br/>In other words, to the man in front of him, he no longer had any value.<br/><br/>Therefore, he could imagine his fate.<br/><br/>Gu Yang looked at him as he almost collapsed and said indifferently, “I told you, you are not in a position to negotiate with me.”<br/><br/>“Now, I ask, you answer, and don’t try to be smart.”<br/><br/>He didn’t use any threatening words, but Mu Jun knew very clearly that if he did not answer satisfactorily, death might be the result.<br/><br/>Gu Yang asked, “Who are the legendary beastmasters on the current Ruiqin Continent?”<br/><br/>Mu Jun was surprised by the question but did not dare to dawdle and quickly answered…<br/><br/>Just like that, it went back and forth between the two.<br/><br/>The problem with the system’s reward is that the so-called martial arts experience could be anything related to martial arts. However, anything unrelated to martial arts, there would be no memory of.<br/><br/>In the simulation, he must have asked Mu Yi about information on the Ruiqin Continent, but he didn’t inherit any of those memories.<br/><br/>He had to ask again.<br/><br/>It was a whole continent with many legendary monster beasts. This was of great value to him.<br/><br/>Gu Yang’s biggest enemies now are the Three Sacred Gates, three Celestial Beings, all from the Monster Race.<br/><br/>Ironically, what beastmasters are best at is dealing with the Monster Race.<br/><br/>With the methods of a beastmaster, he might be able to find their weaknesses. When the time comes, he won’t kill them but turn them all into his pets. Only in this way can he vent his anger.<br/><br/>In the simulation, he didn’t know how many times he had died at the hands of Saint Chao Yang. Killing him directly would be too easy for him.<br/><br/>Gu Yang primarily inquired about pets and extraordinary creatures above the Unleaking Realm.<br/><br/>Surprisingly, there were quite many of all breeds; various giant dragons, whales, unicorns, nine-headed birds, three-headed dogs, etc.<br/><br/>“Immortal Underworld Phoenix?”<br/><br/>When Gu Yang heard the name of this extraordinary creature, his eyes lit up instantly, and he asked, “Where is it?”<br/><br/>“In Hell Valley, at the southernmost tip of the Ruiqin Continent. It is an immortal creature of the fire attribute, possesses the property of immortality, and is very difficult to deal with. Moreover, it is impossible to make a contract with and take it as a pet.”<br/><br/>Mu Jun was talking endlessly.<br/><br/>However, he couldn’t help but ponder. When he first saw Gu Yang, he felt that Gu Yang’s aura was somewhat similar to the Immortal Underworld Phoenix.<br/><br/>He had once explored the Hell Valley and had dealings with the Immortal Underworld Phoenix. Its flame left a deep impression on him.<br/><br/>Now, seeing Gu Yang so interested in the Immortal Underworld Phoenix, perhaps, there might be some unknown relationship between him and it.<br/><br/>The next day, Gu Yang had a rough understanding of the Ruiqin Continent.<br/><br/>“Last question, how did you come to this continent?”<br/><br/>Mu Jun answered honestly, “When I was exploring the ruins, I accidentally found an ancient teleportation array and was teleported here.”<br/><br/>“Take me there.”<br/><br/>The Teleportation Array was located offshore on a remote island; through a cave and into the underground, they finally saw a huge Teleportation Array.<br/><br/>Such a secluded place, no wonder it was never discovered.<br/><br/>Gu Yang suddenly thought, it is said that Penglai Heaven is in the East Sea, wouldn’t the Ruiqin Continent be related to Penglai Heaven?<br/><br/>Mu Jun said, “This is it.”<br/><br/>Gu Yang looked at him and said, “You have a strong desire to live and are cooperative. Unfortunately, you deliberately hid one thing about your mentor. Therefore, I am sorry.”<br/><br/>Horror flashed across Mu Jun’s face. He shouted, “Listen to my explanation…”<br/><br/>Gu Yang drew his blade, and with one swipe, Mu Jun fell to the ground.<br/><br/>This person was no longer a threat, but his mentor could always be trouble. A celestial-level powerhouse was not something he could deal with at the moment.<br/><br/>Thus, he definitely could not let him go.<br/><br/>Upon Mu Jun’s death, the Beast-taming Space in his mind collapsed. The Earth Bear and the Fantom Jade Butterfly, already severely injured, died immediately. The parrot, bound by its contract, was also at death’s door.<br/><br/>Gu Yang couldn’t bear to see it suffering and ended its life with one strike.<br/><br/>[Obtained 100 points of energy, current balance 204 points.]<br/><br/>[Obtained 100 points of energy, current balance 304 points.]<br/><br/>[Obtained 30 points of energy, current balance 334 points.]<br/><br/>[Obtained 30 points of energy, current balance 364 points.]<br/><br/>This was the second reason for killing him. Killing one of him resulted in a lot of energy.<br/><br/>PS: A continuous 23 days of triple updates. Please vote.\t\t\t\t\t\t</div>", "images": {}, "success": true}