{"id": 284, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132169.html", "title": "Chapter 284 - Chapter 284: 284 I Am Your Daddy", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 284 - Chapter 284: 284 I Am Your Daddy</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 284: 284 I am your daddy<br/><br/>After Gu Yang’s breakthrough, he went alone to Jingzhou City. The journey was somewhat dangerous, so he did not bring Ling Ling with him but left her behind.<br/><br/>Half a day earlier, he had already arrived in Jingzhou City. However, he did not show himself. Instead, he stayed near the royal mansion.<br/><br/>Until King Jinghai broke the seal and attracted the foreign continent powerhouse.<br/><br/>When he saw Han Mengling, he almost didn’t recognize her.<br/><br/>How could she look like she has aged over a decade in just a few months? From a girl of thirteen or fourteen, she had transformed into a young woman in her twenties.<br/><br/>If not for the fact that her True Essence within her body hadn’t changed, he would have had trouble recognizing her.<br/><br/>Then, the Emperor’s Supreme Sword Saint made his move.<br/><br/>Gu Yang remained still and continued to observe.<br/><br/>If it were that easy to kill this powerhouse from the foreign continent, he wouldn’t have been able to escape from his hands in the simulation.<br/><br/>As expected, this almost sneak attack didn’t hurt the opponent at all.<br/><br/>A huge black bear appeared, the terrifying aura it released was from a Monster Beast in the Unleaking Realm.<br/><br/>Gu Yang noticed that around the figure of this man from the foreign continent, a layer of black light shield appeared. His energy and the black bear’s came from the same source.<br/><br/>It didn’t seem easy to break open.<br/><br/>He gave up on the idea of a surprise attack and instead saved the Emperor’s Supreme Sword Saint first.<br/><br/>In just this short amount of time, Gu Yang realized that this man was not easy to deal with.<br/><br/>The most peculiar thing was that this man was actually able to borrow the power of the Monster Beast.<br/><br/>He and the parrot seemed to become one, almost inseparable. Not only could he borrow the parrot’s monster power, but he could also use its Divine Power.<br/><br/>Gu Yang immediately realized the advantages of this cultivation system.<br/><br/>It required no self-cultivation. As long as one could subdue an extraordinarily powerful Monster Beast and establish such a relationship with it, one could share the power of that Monster Beast.<br/><br/>No wonder, after Saint Chaoyang reached the foreign continent in the simulation, so many powerhouses had made their move. They must have treated her like prey.<br/><br/>While Gu Yang was sizing up his opponent, Mu Jun was also scrutinizing him, even his eyes were glowing, “You are very different!”<br/><br/>The man in front of him clearly looked like a human being, but the scent he exuded and the power within him were extremely similar to that of a supernatural creature.<br/><br/>As a legendary Beastmaster, he had interacted with supernatural creatures his entire life and had never been as confused as he was at that moment.<br/><br/>Was the man in front of him a human or a supernatural creature?<br/><br/>If you say he was human, but his scent and power, which were unique to Monster Beasts, were clearly possessed only by supernatural creatures.<br/><br/>If you say he was a supernatural creature, his body was indeed human.<br/><br/>A human-shaped supernatural creature?<br/><br/>Or a human who had the power of a supernatural creature?<br/><br/>Looking at the man in front of him, Mu Jun felt as if he were looking at an extraordinarily rare treasure.<br/><br/>Regardless of which situation it was, he had discovered another incredibly rare person or supernatural creature!<br/><br/>What’s more important was that the man in front of him possessed a monarch-level power, which was even close to the Overlord level.<br/><br/>The land called Great Zhou was truly his blessed place.<br/><br/>He was so excited that his voice was trembling, “Tell me, what are you exactly?”<br/><br/>“I’m your father!”<br/><br/>Gu Yang was annoyed by the other’s look, which was as if he was looking at an alien. Without a second word, a golden ape flew out from his forehead.<br/><br/>The size of the ape quickly grew, rapidly more than ten meters high. Under the sunlight, it was bathed in golden light.<br/><br/>“Roar!”<br/><br/>The ape, looking at the black bear that was only up to its knee, banged on its chest as if in a challenge, making a thumping sound.<br/><br/>“Overlord Level?”<br/><br/>Mu Jun was shocked to see a supernatural creature emerging from within the man’s body, it was at the level of Overlord. He couldn’t help but take a deep breath.<br/><br/>With his legendary Beastmaster’s eye, the bloodline potential of this ape was, shockingly, not inferior to the top existence like the dragon. This roar suppressed his beloved beast, making it appear less imposing.<br/><br/>But how could there be an Overlord-level supernatural creature in the man’s body?<br/><br/>How did he do that?<br/><br/>Mu Jun’s brain felt insufficient, everything that he encountered today was challenging the limits of his common sense.<br/><br/>“Black Sun, don’t be afraid!”<br/><br/>Despite the shock, his reaction was extremely quick. He comforted the emotions of his favourite beast.<br/><br/>“Brave Heart!”<br/><br/>“Final Madness!”<br/><br/>“Holy Protection!”<br/><br/>Threw out three magic techniques consecutively. Immediately, the eyes of his beloved beast, Black Sun, turned red. It broke away from the Divine Ape’s suppression in an instant, its body hair stood on end, and its body began to swell. In no time, it grew to over ten meters high.<br/><br/>At the same time, a rainbow halo appeared on its body.<br/><br/>Next, it charged towards the enemy of its own accord. The two monstrous beasts instantly clashed violently.<br/><br/>The magic that Mu Jun used were all of the legendary level.<br/><br/>There was a mutual complement and achievement between the beastmaster and his beast pets. Not only could he assist his pets in growth, he could also use some magic in a battle to enhance the power of his pet beasts.<br/><br/>These three spells were the most beneficial for the Bear of the Earth. They were sufficient to enhance its combat power by considerable degrees.<br/><br/>“Is that possible?”<br/><br/>Gu Yang watched the man from the other continent casting a few spells. The strength of the black bear increased so explosively that it dared to challenge the Divine Ape, causing Gu Yang to marvel a bit.<br/><br/>The other party’s cultivation system was indeed interesting; it could greatly enhance the strength of the monster beasts.<br/><br/>If he could learn this kind of magic, once his other three divine beasts reached the seventh layer of incarnation…<br/><br/>A few spells casted, and the four divine beasts enhanced to reach the Unleaking Realm. Even if they met a strong person in the Celestial Being Realm, they could handle it, right?<br/><br/>Having thought this through, Gu Yang drew his Phoenix Feather Knife and flew towards the opponent.<br/><br/>Mu Jun was like an enemy, the being before his eyes, whether it was the monster beast or a human, both had Overlord Level strength, it is not an easy opponent to deal with.<br/><br/>“Jade, come out!”<br/><br/>He opened another beast-taming space again, releasing his third pet beast, a white butterfly!<br/><br/>The Fantom Jade Butterfly, an Overlord Level pet, was best at illusions. It is an extremely rare transcendent creature.<br/><br/>It was thanks to the Fantom Jade Butterfly that he managed to survive countless deadly traps.<br/><br/>Watching the butterfly flapping its wings, the space seemed to vibrate and Mu Jun disappeared from the spot.<br/><br/>Gu Yang only felt that his surroundings had changed and he had arrived in a bustling street. All he could see were pedestrians of all sorts, vendors hawking their wares, and the surrounding noise… it surged towards him like a tidal wave.<br/><br/>“An illusion?”<br/><br/>A mocking smile tugged at the corner of his mouth.<br/><br/>The area surrounding the imperial palace was a disorderly mess, two monster beasts that were over 10 feet tall were wrestling physically, causing countless nearby houses to collapse from the collateral damage.<br/><br/>Many civilians were affected, inside the imperial palace, from the guards to the servants, all had been evacuated.<br/><br/>The level of this fight was not something that a martial artist in the Mortal Realm could intervene in. If one is not careful and gets swept up in the aftermath, it could lead to his death.<br/><br/>The two monster beasts fought fiercely. Using the most primitive methods, they physically made contact with each other. They tore each other apart with their claws and bit each other with their teeth, falling from the sky to the ground.<br/><br/>When they fell to the ground, it resulted in a huge crater.<br/><br/>The destruction was colossal, if this continued, the entire Jingzhou City would eventually be taken down by them.<br/><br/>The only ones who remained at the scene were the three Divine Power Realm personals in the city.<br/><br/>The Emperor’s Supreme Sword Saint, Han Mengling and King Jinghai.<br/><br/>All three of them did not leave. They just moved a distance away and watched the battle nervously.<br/><br/>King Jinghai was unwilling to leave. He was the king of Jingzhou City. How could he abandon his city and run away?<br/><br/>The Emperor’s Supreme Sword Saint couldn’t leave. That sword strike earlier had exhausted all his mana.<br/><br/>Han Mengling didn’t leave because she had complete faith in Gu Yang. She believes that this man would be victorious.<br/><br/>The three of them had different feelings. As they watched the two fighting, their reactions varied greatly.<br/><br/>When that butterfly appeared and Mu Jun disappeared, and a bustling street was seen in front of them, all three of them realized that it was an illusion.<br/><br/>King Jinghai warned loudly, “Be careful!”<br/><br/>But when he opened his mouth, he realised he couldn’t make a sound and was terrified.<br/><br/>“What a formidable illusion!”<br/><br/>Even with the Eye of the Emperor’s Ultimate Swordsman, he couldn’t find any flaws. Even when he tried to use the spirituality of the Emperor’s Ultimate Sword, he still couldn’t find the opponent’s body.<br/><br/>He had never seen such an illusion before.<br/><br/>A flash of crystal white light flickered in Han Mengling’s eyes. She also could not see through the illusion, causing a slight waver in her heart.<br/><br/>How would Gu Yang deal with this kind of illusion?<br/><br/>Could he see through the illusion before him?<br/><br/>Just then, Gu Yang moved. He raised his Phoenix Feather Knife and swung it towards a certain location.<br/><br/>Everything in front of him twisted. It shattered like a phantom.<br/><br/>This stroke, firmly struck onto the light shield that was on top of Mu Jun’s head.<br/><br/>The first style of the Nine Heaven Breaking Swords, Chaos Opening!<br/><br/>With a crack sound.<br/><br/>A crack appeared on the light shield above Mu Jun’s head.<br/><br/>PS: The updates are getting later and later, I’m helpless too. I only get my typing done in the afternoon and evening.\t\t\t\t\t\t</div>", "images": {}, "success": true}