{"id": 281, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132163.html", "title": "Chapter 281 - Chapter 281: 281 Divine Ape Transformation Seventh Layer", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 281 - Chapter 281: 281 Divine Ape Transformation Seventh Layer</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 281: 281 Divine Ape Transformation Seventh Layer<br/><br/>“No, it’s not really accurate to call it a bottleneck,” Gu Yang said.<br/><br/>With Gu Yang’s high martial arts cultivation level, he quickly realized where the problem lay.<br/><br/>His strength was so formidable that both his physical body and mana far exceeded that of normal individuals at his cultivation level. Consequently, the path to achieving the state of the Unleaking Realm was more challenging for him than for others.<br/><br/>Had he chosen to follow the path of the Nascent Soul, he would not have had this problem. With his powerful Original Spirit, he would quickly reach the intermediate stage of Nascent Soul.<br/><br/>However, to achieve the Unleaking Realm, he needed to unlock the secret potential within his body and cultivate it into the Unleaking State.<br/><br/>The stronger the physical body, the more difficult this process becomes.<br/><br/>After cultivating the true Phoenix form, Gu Yang’s physical strength reached a level comparable to an Ancient Divine Beast. Even Red Sun who had already attained the Unleaking State, was beaten down by him.<br/><br/>This meant that attaining the Unleaking State was destined to be several times harder for Gu Yang than anyone else.<br/><br/>“Phoenix Dance Nine Heavens” was ambiguous about how to attain the Unleaking State.<br/><br/>Gu Yang seriously suspected that it was intentional.<br/><br/>The origins of this technique were dubious to begin with.<br/><br/>The purpose of Saint Chao Yang spreading this technique was to create “batteries” for her master.<br/><br/>Although he hadn’t found any hidden traps within the technique so far, it was reasonable to expect that some parts may have been omitted or manipulated.<br/><br/>Seeing that Saint Chao Yang had suddenly stopped giving him that Spirit Fruit, he suspected that she didn’t wish for him to break through to the Unleaking Realm.<br/><br/>Unfortunately, Wu Er was not around, and Divine City was too far away, so he had no one to ask for advice.<br/><br/>“It seems like I can only rely on myself,” he decided.<br/><br/>Knowing that “Phoenix Dance Nine Heavens” was unreliable for attaining the Unleaking Realm, he did not harbor any wishful thinking.<br/><br/>As long as he knew the problem, he had a way out.<br/><br/>Checking the balance in his system, he had four hundred and twenty-four points, and launched the simulation once more.<br/><br/>“…You, accompanied by Ling Ling, rush to Divine City as fast as possible and seek advice from the President of the Literature Academy on how to attain the Unleaking State,” said the simulation.<br/><br/>“At the Academy, you also encounter Wu Er and Pei Qianlan and ask Wu Er for advice.”<br/><br/>“You then go to Water Moon Cave Heaven, find Dao Sect Leader Wen Jue, and ask for his guidance. Soon after, the four Nascent Soul cultivators from Ancient River Sword Sect catch up to you.”<br/><br/>“You join forces with Wen Jue and kill all four Nascent Soul cultivators, incurring the wrath of Ancient River Sword Sect’s Ancestor who deals a heavy blow to Wen Jue with a single sword strike. You fend him off with a Celestial Decline, then flee in the form of the Phoenix.”<br/><br/>“Desperately fleeing, you arrive at Sky Ruins. Months pass and you take refuge in a Space Fragment where you find the remains of a Candle Dragon whose eyes have been gouged out.”<br/><br/>“From the Candle Dragon’s corpse, you successfully extract a drop of Essence Blood. However, the Space Fragment collapses before you can escape and results in your demise at the age of twenty-three.”<br/><br/>As expected, Saint Chao Yang had not yet arrived in this world at this time, thus making Divine City still safe.<br/><br/>Gu Yang sighed in relief, his aim in launching the simulation was to seek advice from President of the Literature Academy and Wen Jue. Encountering Wu Er was an unexpected blessing.<br/><br/>Even better was the fact that he managed to find the remains of a Candle Dragon in the Sky Ruins, from which he managed to extract a drop of Essence Blood.<br/><br/>With this experience, he would know to look for the Sky Ruins in Water Moon Cave Heaven next time.<br/><br/>“The simulation ends, you may choose to keep one of the following:<br/><br/>“One, your Martial Arts Realm at age twenty-three.”<br/><br/>“Two, your Martial Arts experience at age twenty-three.”<br/><br/>“Three, your wisdom of life at age twenty-three.”<br/><br/>“I choose Two,” Gu Yang said immediately.<br/><br/>Suddenly, Gu Yang’s mind was flooded with numerous experiences in martial arts and memories of several battles.<br/><br/>The most important of these were the suggestions given by the President of the Literature Academy, Wen Jue, and Wu Er.<br/><br/>That was how to attain the Unleaking state!<br/><br/>Opening his eyes, Gu Yang felt a bit confused.<br/><br/>The three people he consulted had given him dramatically different pieces of advice.<br/><br/>The president suggested that if he could comprehend the Swordsmanship in his mind, attaint the Unleaking state would be a breeze.<br/><br/>Wu Er, on the other hand, suggested a do-or-die situation, suggesting that he could make a breakthrough by stimulating all his potential in such a moment.<br/><br/>However, Wen Jue advised him to settle his karma, stating that after becoming unburdened, he would find the opportunity for breakthrough,<br/><br/>Gu Yang could understand the suggestions made by the President as well as Wu Er.<br/><br/>But he couldn’t figure out what Wen Jue meant. What did becoming unburdened have to do with unlocking the hidden potential within his body?<br/><br/>However, having run so many simulations, he still hadn’t managed to comprehend that Swordsmanship technique imparted by the President.<br/><br/>Furthermore, he had countless experiences of do-or-die situations.<br/><br/>In his view, neither of these two suggestions seemed to work.<br/><br/>Perhaps, he should experiment with the method suggested by Wen Jue.<br/><br/>Yet, settling karma was not an easy thing to achieve. He had too many entanglements. Leaving other matters aside, dealing with Red Sun and Saint Chaoyang alone were issues that could not be resolved without first reaching the Celestial Being Realm.<br/><br/>This matter can only be set aside for the time being. The most important thing now is to deal with the strong individual from the different continent and save the life of King Jinghai.<br/><br/>This is also for the purpose of settling a debt of karma.<br/><br/>I need to further increase my strength.<br/><br/>After some serious contemplation, Gu Yang had an idea and activated the simulator again.<br/><br/>[…Take Ling Ling with you, sneak into Liangzhou, and enter the Golden Court Cave Sky.]<br/><br/>[You go to the Golden Court Kingdom, voluntarily propose to cooperate with the ruler. The first thing to do is to go to the hole where the body of the Divine Ape is, and kill the monkey.]<br/><br/>[The ruler of the Golden Court receives the pardon, you get the body of the Divine Ape, extracting three drops of essence blood.]<br/><br/>[In the next three years, you will refine those three drops of essence blood, and the strength of the Divine Ape avatar will greatly increase.]<br/><br/>[After you come out, hunt down the gods of two other kingdoms, causing heavy losses to these two kingdoms and a great increase in the strength of Golden Court Kingdom. A year later, this finally attracts the siege of Celestial Beings from the two kingdoms.]<br/><br/>[During the chaos, several people suddenly descend into the Golden Court Cave Sky, holding the pardon of the Star Monarch. Three rulers refused to submit and were killed on the spot. You were affected, died on the spot, and were 26 years old at the end of your life.]<br/><br/>Success!<br/><br/>Gu Yang was overjoyed. Although he couldn’t break into the Unleaking Realm for the time being, it didn’t mean he had no way to enhance his strength.<br/><br/>Raising the strength of the Divine Beast avatar was also the same.<br/><br/>What he set his sights on was the corpse of the Divine Ape in the Golden Court Cave Sky.<br/><br/>He couldn’t beat that monkey, but there were others who could. Cooperating with the ruler of Golden Court to meet their respective needs naturally lead to an agreement.<br/><br/>In the end, he successfully obtained three drops of essence blood, and the progress of the “Divine Ape Technique” suddenly increased threefold.<br/><br/>As long as he could cultivate the “Divine Ape Technique” to the seventh level, he would also have the cultivation level of the Unleaking Realm.<br/><br/>[The simulation has ended, you can keep one of the following things.]<br/><br/>“I choose one.”<br/><br/>After that, Gu Yang carried out the simulation over and over again.<br/><br/>By the sixth time<br/><br/>[…”Divine Ape Technique” has been cultivated to the seventh level, the Divine Ape avatar has the strength of the Unleaking Realm.]<br/><br/>[…Three rulers died, you saw that the situation was unfavorable, killed your way out of the encirclement, and escaped from the Golden Court Cave Sky.]<br/><br/>[You went to Divine City, found that the Great Zhou had fallen. Half a year ago, an Immortal Palace appeared in the sky above Divine City, crushing the confidence of the Great Zhou court.]<br/><br/>[On that day, the immortal in the Immortal Palace broke through the great array of the imperial palace, and the entire royal family of Great Zhou was annihilated. The Zhou Dynasty was destroyed overnight.]<br/><br/>[You were discovered by an immortal official and hunted down. Then you were captured by a magic treasure and imprisoned in the Immortal Palace, suppressed in the immortal prison. Half a year later, your mana was drained and you died. You were 26 years old at the end of your life.]<br/><br/>Finally cultivated to the seventh level!<br/><br/>Gu Yang was overjoyed. This meant that he finally had the true strength of the Unleaking Realm.<br/><br/>However, seeing the outcome further along gave him a headache.<br/><br/>“What did that Demon Suppression Tower do to release such a terrifying force?”<br/><br/>It broke through the great array of the imperial palace and took over it in just one day.<br/><br/>Just any celestial official could capture him alive.<br/><br/>What kind of force is this?<br/><br/>Could those who invaded Guanghan Immortal Palace and Golden Court Cave Sky also be people from this Immortal Palace?<br/><br/>Without a doubt, this force that appeared three and a half years later is much more terrifying than Star Luo Sect and Wanxiang Gate.<br/><br/>And he is the one who triggered all of this.<br/><br/>If he hadn’t wanted to go into the Demon Suppression Tower to look for the body of that Celestial Being, he wouldn’t have awakened the primordial spirit of this supreme treasure. This Immortal Palace would not have emerged.<br/><br/>At least, it wouldn’t have emerged at this time.<br/><br/>Gu Yang finally realized why the will of this world was so hostile towards him.<br/><br/>His ability to stir things up was truly unmatched.<br/><br/>If things go on like this, perhaps one day, he really might ruin this world.<br/><br/>[The simulation has ended, you can keep one of the following things.]<br/><br/>“I choose one.”<br/><br/>Boom!<br/><br/>A golden monkey flew out of Gu Yang’s forehead, instantly flying above the nine heavens.<br/><br/>Unknowingly, thick dark clouds had formed in the sky, with countless lightning flashes. The Divine Ape flew among them, endured the baptism of lightning, beating its chest with its hands while roaring, undergoing a shocking transformation.\t\t\t\t\t\t</div>", "images": {}, "success": true}