{"id": 289, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132179.html", "title": "Chapter 289 - Chapter 289: 289 Today Is Your Day Of Death (Third Update, Asking For Monthly Ticket)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 289 - Chapter 289: 289 Today Is Your Day Of Death (Third Update, Asking For Monthly Ticket)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 289: 289 Today is your day of death (Third update, asking for monthly ticket)<br/><br/>Shen Yun had absolute confidence in his strength. He was at the second step of the Unleaking Realm, having already formed his inner cosmos. Even a Phoenix which had just entered the Unleaking Realm could not deal with him.<br/><br/>As for Gu Yang, a young lad at the triple realm of mana, there was even less of a chance he could pose a threat to him.<br/><br/>One like the Red Sun who relied on the gifts of others to possess the strength of the Unleaking Realm, was not even fit for comparison to him.<br/><br/>Although Gu Yang was capable of killing Red Sun, before him, he still had no chance of victory.<br/><br/>Shen Yun struck, his mana domain extending to envelop Gu Yang, a slight smile crossing his face.<br/><br/>The next second, a terrifying power roiled in the darkness, tearing apart his domain.<br/><br/>The smile on his face froze.<br/><br/>Gu Yang’s voice escaped from the frayed domain, “If one is not enough, how about two?”<br/><br/>A gigantic ape broke through his domain and issued a heaven-shaking, earth-shattering roar.<br/><br/>“The Divine Celestial Ape!”<br/><br/>Shen Yun’s eyes narrowed slightly.<br/><br/>A millennium ago, during the hunt for the Xia Emperor by the Four Great Sacred Lands, he had been there and witnessed the mighty power of eighteen celestial-level Divine Beasts.<br/><br/>He knew very well how terrifying these transformed Divine Beasts were.<br/><br/>Yet, he had never imagined that Gu Yang would also have a transformed Monster Beast in the Unleaking Realm.<br/><br/>In terms of the difficulties in cultivation, the “Nine Heavens Divine Method” was no less daunting than “Phoenix Dance Nine Heavens”.<br/><br/>This cultivation method required the Essence Blood of a Divine Beast.<br/><br/>After the Xia Emperor’s death, the remaining Monster Races of the Xia Dynasty were all taken to the land of paradise, Taoyuan Heaven, by the Three Sacred Dojo. Ever since, hardly any traces of the Monster Race could be seen in Great Zhou.<br/><br/>The fact that Gu Yang could transform into a Phoenix was somewhat understandable, given that he practiced “Phoenix Dance Nine Heavens”, which led to the cultivation of the Phoenix Element.<br/><br/>But how did he cultivate the transformation into a Divine Celestial Ape?<br/><br/>For a moment, Shen Yun even suspected that the young man before him could be a contingency plan left by the Xia Emperor.<br/><br/>Truth be told, not just him, but the old monsters of all factions and families had their own conjectures about Gu Yang.<br/><br/>Initially, he thought that this person could be the reincarnation of a great power from ancient times, which could justify his rapid pace of cultivation.<br/><br/>Now, the name of the Xia Emperor sprang up in Shen Yun’s mind.<br/><br/>Boom!<br/><br/>Just as he was distracted, the Phoenix which had just completed its Thunder Baptism in the sky launched an attack on him. A flurry of flames engulfed him.<br/><br/>The Divine Celestial Ape punched in a certain direction. Almost immediately, Shen Yun’s figure appeared out of nowhere, barely managing to raise his hand in defense.<br/><br/>Instantly, he was sent flying like a cannonball, crashing into the sea.<br/><br/>With a loud bang, a pit several dozen meters deep appeared on the sea’s surface, causing enormous waves.<br/><br/>“What a tough hide he has.”<br/><br/>Gu Yang mumbled to himself. The attack just now could not finish Shen Yun off.<br/><br/>It was quite difficult to kill a strong practitioner of Unleaking Realm. The last attempt at killing Red Sun had almost costed him his knife, let alone Shen Yun who was at the second layer of the Unleaking Realm.<br/><br/>Instant killing was out of the question.<br/><br/>He had to exhaust Shen Yun to death.<br/><br/>“Attack.”<br/><br/>The Divine Celestial Ape swiftly plunged into the sea to pursue, giving Shen Yun no chance to catch his breath.<br/><br/>A hundred miles away on a merchant ship, Zhong Zilin was using the great visualization and acoustics technique to witness the battle. Seeing Shen Yun getting beaten by the golden ape, his eyes popped out of his head in shock.<br/><br/>This divine beast was just too fierce, even more violent than the legendary dragons of the West Bank Continent.<br/><br/>What exactly was this young man’s background to have two divine beasts, one of them being the legendary Phoenix, by his side?<br/><br/>In West Bank Continent, there was an extremely mysterious organization that used the Phoenix as its totem.<br/><br/>Having encountered its people before, Zhong Zilin knew they were not easily trifled with. Even the tip of the iceberg beneath the surface seemed terrifying to him.<br/><br/>Could that young man be linked to this organization?<br/><br/>Zhong Zilin kept observing, refraining from making any rash move.<br/><br/>Having survived on the unknown continent until this moment and established a foundation for the Zhong Family, he was not the impulsive type.<br/><br/>His clan uncle, who was transported to the West Bank Continent with him and was even more talented, had perished because of his impulsive nature, falling in a scheme.<br/><br/>Therefore, even facing his lifelong nemesis, Zhong Zilin remained absolutely calm, waiting for the perfect opportunity to strike.<br/><br/>In the sea, a man and an ape turned the sea upside down, occasionally churning up enormous waterspouts.<br/><br/>Many fish were instantly caught in the calamity, and the surface was littered with bodies of all types of fish.<br/><br/>The Phoenix circled in the sky, not chasing underwater, but waiting for Shen Yun to surface.<br/><br/>Suddenly, a figure shot out of the water.<br/><br/>The Phoenix opened its beak and a burst of flames erupted, its power having increased after its recent advancement, leaving nothing unburned.<br/><br/>Shen Yun was too slow to dodge, catching the full blast of the flame head on. He turned into a ball of fire, everything on his body reduced to ashes.<br/><br/>Even his mana was ignited.<br/><br/>Despite his formidable Unleaking body, it was almost pierced through by this terrifying flame.<br/><br/>Quickly, Shen Yun turned and plunged back into the sea.<br/><br/>However, even underwater, the raging flame did not quench, seemingly intent on incinerating his flesh and bones completely.<br/><br/>After a while, deep under the sea, several waves of sword intent surged and finally extinguished the flame.<br/><br/>The commotion underwater was becoming bigger and bigger.<br/><br/>“What a powerful sword technique.”<br/><br/>Through the vision of the Divine Ape, Gu Yang could see the sword technique used by Shen Yun.<br/><br/>Among all the martial artists he had met, this was the highest level of sword technique he had seen. He speculated that even the fabled Sword Saints could only be this proficient at most.<br/><br/>Until now, he had never heard that Shen Yun was good at using swords.<br/><br/>Even Wu Er had no idea.<br/><br/>As expected, people like him who had lived for a thousand years must have some hidden techniques up their sleeve.<br/><br/>The sword in Shen Yun’s hand was also a rare divine weapon. With his exquisite sword technique, the Divine Ape was soon injured.<br/><br/>“Hmph, dream on if you think you can divide and conquer!”<br/><br/>Gu Yang was not oblivious to his intentions. The Phoenix dove into the sea with a clear cry, joining the battle.<br/><br/>With the Phoenix’s realm, it wasn’t at all restrained by the sea. Its flames could even ignite the sea water.<br/><br/>The battle under the sea intensified, the waves were becoming more fierce, intermittently rolling up waves as high as hundreds of meters.<br/><br/>Gu Yang tightly held the Phoenix Feather Knife in his hand, waiting for the right opportunity.<br/><br/>“Huh? Trying to escape?”<br/><br/>He spotted Shen Yun underwater, fleeing in one direction. Obviously, he was a little overwhelmed and wanted to escape.<br/><br/>Even with Shen Yun’s strength, the two divine beasts working together couldn’t kill him.<br/><br/>However, the consumption was too terrifying. The two divine beasts attacked him like crazy, even risking their own source.<br/><br/>Every time he defended, it was extremely difficult, and the mana consumed was at the expense of his lifespan.<br/><br/>In less than a quarter of an hour, he had already consumed several years of his lifespan.<br/><br/>Who could withstand this?<br/><br/>This was his biggest weakness, his lifespan!<br/><br/>He had been alive for more than a thousand years. Even though he had absorbed a lot of vitality through the Taiyou Moon Devouring Technique, he still couldn’t withstand such consumption.<br/><br/>If he continued to fight, he would soon exhaust his source and die.<br/><br/>Resolving the two divine beasts in a short time was no easy task.<br/><br/>So, he fled!<br/><br/>Reduced to this state, returning to Three Saint Gate was enough to fulfill his duty to his master.<br/><br/>As Shen Yun was fleeing at top speed, a sudden alarm went off in his heart, and he blocked it with his sword.<br/><br/>With a clang, he blocked an incoming sword intent.<br/><br/>“Taixu Sword Technique?”<br/><br/>He was somewhat surprised; this sword technique should have been lost— no, indeed two escaped members of the Zhong family had survived back then.<br/><br/>Shen Yun looked up to see an old man. He recognized at a glance, it was one of the two Zhong disciples who had escaped back then.<br/><br/>Five hundred years have passed, and this person has reached the Unleaking Realm and blocked his path at this critical moment.<br/><br/>Zhong Zilin’s timing was quick, accurate and ruthless. Although this sword couldn’t kill Shen Yun, it blocked his path. In this short time, the two divine beasts had caught up.<br/><br/>A satisfied smile surfaced on his face.<br/><br/>Today, is your death day!<br/><br/>Shen Yun read the intent in his opponent’s eyes and without hesitation he flew up. In an instant, he had flown out of the sea, with only Gu Yang left in front of him.<br/><br/>Compared to the two Unleaking Realm divine beasts and an Unleaking Realm martial artist underwater, the Gu Yang on the sea surface was the easiest to deal with.<br/><br/>He once again deployed his magic domain, and lunged at Gu Yang.<br/><br/>The whole world turned pitch black.<br/><br/>There was no hint of fear on Gu Yang’s face, only deep-seated murderous intent. The Phoenix Feather Knife in his hand was already lifted, and a saber technique was about to be released.<br/><br/>Shenxiao Six Obliterations, the fourth move, Celestial Decay!<br/><br/>PS: The third release, seeking monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}