{"id": 283, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132167.html", "title": "Chapter 283 - Chapter 283: 283 Great Discovery (Third Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 283 - Chapter 283: 283 Great Discovery (Third Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 283: 283 Great Discovery (Third Update)<br/><br/>“A dragon?”<br/><br/>An expression of wild joy spread across Mu Jun’s face.<br/><br/>It was dragon pressure!<br/><br/>There was actually a dragon present in this city!<br/><br/>He couldn’t possibly have mistaken it, because his mentor owned a pet frost dragon. He was extremely familiar with dragon pressure.<br/><br/>On the Requin Continent, as long as one possessed dragon lineage, it would be at the pinnacle of extraordinary creatures. Its potential far surpassed that of any other pet creature.<br/><br/>Even if it was currently at a low level, once tamed as a pet, and well-cultivated, it had the potential to grow to the Totem Level, which wouldn’t be impossible.<br/><br/>The levels of pets ranged from low to high; Awakened, Extraordinary, these two levels were equivalent to the Mortal Realm for martial artists.<br/><br/>The next one up was the Leader Level, equivalent to the Golden Body Realm.<br/><br/>Royal Level, analogous to the Mana Realm. The parrot on his shoulder was at the Royal Level.<br/><br/>Next was the Overlord Level, corresponding to the Unleaking Realm. He had an Overlord Level pet in his beast-taming space.<br/><br/>After that was the Totem Level, equivalent to the Celestial Being Realm!<br/><br/>Gone further above, there was only one Mythical Level. Only one had ever appeared in all of history; it was the divine pet of the God of Beastmasters.<br/><br/>The “dragon” that Mu Jun sensed right now was probably at the Leader Level, which was the Golden Body Realm.<br/><br/>His Overlord Level pet had exhausted its potential. Taking a step further would be incredibly difficult.<br/><br/>Therefore, he had traveled to a certain set of ruins this time, hoping to capture a young Golden Pheasant. But unexpectedly, he stumbled into a teleportation array and was transported to this strange continent.<br/><br/>He had initially thought that this continent held no extraordinary creatures. However, it gave him such a tremendous surprise.<br/><br/>He had actually encountered a dragon!<br/><br/>Moreover, it was only at the Leader Level. With his strength, he could easily capture it, tame it, and make it his pet.<br/><br/>The dragon, it definitely wouldn’t be inferior to the Golden Pheasant by any means.<br/><br/>This continent was simply his land of fortune!<br/><br/>Even if Mu Jun was obsessed with martial arts, he would never forget that his profession as a Beastmaster was his foundation.<br/><br/>He reached out his hand, grabbed Han Mengling, and took off.<br/><br/>As a Beastmaster, he could borrow the strength of his pets. At this moment, he was utilizing the flying ability of the King Kong Parrot on his shoulder.<br/><br/>“The power of the Monster Race, the cultivation method of the Xia Dynasty?”<br/><br/>Under the opponent’s power, Han Mengling was helpless.<br/><br/>Finally, she was able to determine that the power he was utilizing was undoubtedly Monster Essence.<br/><br/>The one most well-known for this method was undoubtedly the Xia Dynasty from a thousand years ago—they had a popular practice of cultivating using the essence blood of the Monster Race. The power was very similar to Monster Essence.<br/><br/>No, wait!<br/><br/>Although the martial artists of the Xia Dynasty did cultivate using the essence blood of the Monster Race, they were still martial artists themselves.<br/><br/>This man in front of her eyes, there wasn’t a single trait of a martial artist about him.<br/><br/>It seemed as if he was entirely borrowing the strength of a monster beast.<br/><br/>The source of his power was the parrot on his shoulder.<br/><br/>Although he was clearly a human, he was able to borrow the power of a monster beast.<br/><br/>Or, one could say, that monster beast was sharing its power with him.<br/><br/>Upon realizing this, Han Mengling became even more baffled. How was he able to do it?<br/><br/>This human-beast pair seemed to have established a sort of symbiotic relationship.<br/><br/>“Wait, this direction…”<br/><br/>She was just contemplating this when she saw that they had arrived at the Jinghai Royal Residence, and a thought popped into her head, “The dragon he mentioned, couldn’t it be…”<br/><br/>When Mu Jun saw the person radiating dragon pressure, he couldn’t help but stare.<br/><br/>It was clearly a human.<br/><br/>How could a human be radiating dragon pressure?<br/><br/>At this moment, the parrot on his shoulder began to squawk wildly, “Half-breed, half-breed…”<br/><br/>Mu Jun was taken aback. A hybrid of a human and a gigantic dragon?<br/><br/>How was that possible?<br/><br/>On the Requin Continent, pet beasts did not have the ability to transform into humans. Only in the stories could the divine pet of the God of Beastmasters do so.<br/><br/>Besides that, even extraordinary creatures at the Totem Level could not transform into human form.<br/><br/>Moreover, generally speaking, the higher their level, the larger their size.<br/><br/>Mu Jun really couldn’t imagine how a person and a gigantic dragon could produce a hybrid.<br/><br/>In the Requin Continent, such a thing had never happened before.<br/><br/>“Who are you, stranger?”<br/><br/>King Jinghai had just broken through his cultivation bottleneck, brimming with enthusiasm, when suddenly a terrifying aura descended, appearing before him, severely weakening his True Essence.<br/><br/>He was shocked. The man before him was dressed in a style completely unlike that of Great Zhou, a blue parrot on his shoulder and a woman gripped in one hand. His aura was quite peculiar, not at all like a martial artist’s.<br/><br/>“Hybrid, hybrid——”<br/><br/>Suddenly, the parrot squawked.<br/><br/>King Jinghai’s face immediately darkened. Obviously, he knew about his own dragon lineage. As a child, due to his unique characteristics, he had suffered prejudice and discrimination from the villagers.<br/><br/>What he hated most was these two words.<br/><br/>One should never insult a person’s dignity, and as King Jinghai, it had been a long time since he had suffered such a blatant insult.<br/><br/>“Beast, you’re courting death!”<br/><br/>Enraged, his True Essence seemed to boil within him, his body swelled, tearing his clothes, and small red scales began to appear on his face.<br/><br/>After reaching the Divine Power level, the power of his dragon lineage inside him had become even more powerful.<br/><br/>Now, activating the power of his dragon lineage, his body showed some characteristics of the dragon clan.<br/><br/>He managed to break free from the oppression, the divine weapon in his hand gleaming, and a swift cut was made.<br/><br/>A sharp-as-can-be sword aura slashed towards that beast!<br/><br/>This sword was the culmination of his life’s cultivation.<br/><br/>However, the blue parrot merely sneezed, dispersing the sword aura, without it even touching a single feather.<br/><br/>The gap between them was too wide.<br/><br/>“It indeed is a human-dragon hybrid!”<br/><br/>Mu Jun muttered, his eyes suddenly lighting up.<br/><br/>This is an excellent topic. A hybrid of human and dragon, this has never happened before in Rheichen Continent.<br/><br/>Now, does he belong to the human race or is he a super-being?<br/><br/>Can he be tamed and kept as a pet?<br/><br/>Mu Jun became excited at the thought.<br/><br/>If he could tame this human-dragon hybrid as a pet, he would become the first man in the Rheichen Continent to do so. It would definitely be a groundbreaking discovery.<br/><br/>Just as he was about to admit this man into his Beast-taming Space, a sense of danger suddenly rose in his heart.<br/><br/>The parrot on his shoulder spread its wings abruptly.<br/><br/>A blue halo formed around him.<br/><br/>Whoosh!<br/><br/>A sword aura silently came flying, striking the halo. With a pop, the halo shattered like a bubble, and was about to strike him.<br/><br/>A huge claw came out of nowhere, blocking the sword aura.<br/><br/>A few drops of blood splattered as a small wound appeared on the huge claw.<br/><br/>“Roar!”<br/><br/>A huge black bear jumped out from an unknown space, its body immense, standing more than 30 feet tall, exuding a violent aura.<br/><br/>It was indeed an Unleaking Realm Monster Beast.<br/><br/>After being injured, its eyes turned red, and it roared with a wave of ripples spreading through space, attacking the direction from which the sword aura came.<br/><br/>The person who’d just drawn his sword was the Emperor’s Supreme Sword Saint. His timing for the attack was extremely tricky. He might even have managed to kill the Mage Realm power master on the spot.<br/><br/>Who knew that the other party would actually have an Unleaking Realm Monster Beast with it.<br/><br/>Since the downfall of the Xia Dynasty, there has not been such a powerful Monster Beast in Great Zhou.<br/><br/>Even though the Emperor’s Supreme Sword Saint was worldly-wise, he was helpless in the face of such a monster beast.<br/><br/>Even at his peak, he might not have been able to win, not to mention the fact that he was yet unhealed.<br/><br/>He had already used all his mana for that single sword swipe just now.<br/><br/>Now, facing the retaliation of that beast, the only thing he could do was to raise the Emperor’s Supreme Sword and shield himself.<br/><br/>At that moment, he felt a tug on his arm and someone pulled him to the side, narrowly escaping that fatal attack.<br/><br/>The Emperor’s Supreme Sword Saint opened his eyes and saw an unexpected person, “Gu Yang?”<br/><br/>“Gu Yang!”<br/><br/>Meanwhile, excitement stirred within Han Mengling’s heart when she saw that figure.<br/><br/>When King Jinghai saw Gu Yang, his face paled and he urgently said, “Brother Gu, run!”<br/><br/>In his opinion, the person in front of him was too terrible. If Gu Yang arrived, he would be merely giving up his life in vain.<br/><br/>Mu Jun stared intently at the man who had just arrived, as if looking at a rare treasure, and said excitedly, “You are very different!”<br/><br/>PS: Please vote for me.\t\t\t\t\t\t</div>", "images": {}, "success": true}