{"id": 288, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132176.html", "title": "Chapter 288 - Chapter 288: 288 Finally We Meet", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 288 - Chapter 288: 288 Finally We Meet</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 288: 288 Finally we meet<br/><br/>“I’ve found you!”<br/><br/>In Jingzhou city, a black-clothed elder appeared out of thin air. He closed his eyes, using a technique to extend his sight and hearing. He swept across a radius of a hundred miles.<br/><br/>Suddenly, he opened his eyes, a flash of cold ruthlessness crossing his face.<br/><br/>Though he didn’t “see” the person he was looking for, he sensed an extremely fiery aura from the other side of the sea.<br/><br/>To him, this aura was very familiar.<br/><br/>He had been studying and researching the cultivation technique “Phoenix Dance Nine Heavens” for over a thousand years.<br/><br/>However, the power of that aura made a deep fear flash in his eyes.<br/><br/>That was clearly the Unleaking Realm!<br/><br/>“Has that youngster actually managed to break through to the Unleaking Realm?”<br/><br/>How is that possible?<br/><br/>The elder found it hard to believe in his heart. While that youngster’s cultivation speed was famously against the heavens.<br/><br/>But this was the Unleaking Realm.<br/><br/>No one knew better than him, the stronger one’s mana triple-fold, the harder it is to unlock the body’s secrets.<br/><br/>From the collected information, that youngster’s mortal body was formidable enough to rival the Unleaking Realm.<br/><br/>For the youngster to cultivate an Unleaking body, it was as difficult as ascending to heaven.<br/><br/>In front of him, there was only one road, that was to achieve a Nascent Soul.<br/><br/>If so, to the elder, there wouldn’t be any threat.<br/><br/>This elder was precisely Shen Yun, the old ancestor of the Shen family, a crafty old monster who had lived for over a thousand years.<br/><br/>He accepted his master’s order to catch Gu Yang who had cultivated “Phoenix Dance Nine Heavens” to the realm of mana, yet he managed to lose track of him several times.<br/><br/>Yesterday, Shen Yun learned from the Shen family’s intelligence network that Gu Yang had appeared in Jingzhou city, so he rushed over.<br/><br/>He always acted prudently, even though there was an opportunity in the Divine City, due to fear of the dean of the academy, he held back.<br/><br/>Who knew that in just a few days’ time, he would receive news that Gu Yang had broken through the third Heaven of the Mana Realm.<br/><br/>Furthermore, he had caused a big commotion in the stronghold of the Red Venerate sect, the Boundless Mountain. Red Sun wanted to suppress him with the Demon Suppression Tower. However, the Tower flew away by itself, and Red Sun disappeared without a trace.<br/><br/>The speed of that youngster’s strength growth was far beyond his imagination.<br/><br/>After learning this, Shen Yun suddenly had a premonition: if this continued, perhaps that youngster would soon break through to the Unleaking Realm.<br/><br/>This youngster always did things that caught everyone off guard. To others, the impossible things he managed to make happen every time.<br/><br/>No matter how much he overestimated this person, it would not be an overestimation.<br/><br/>That’s why this time, Shen Yun decided to hold nothing back. He spent a day getting to Jingzhou City.<br/><br/>Soon, he discovered that youngster’s traces.<br/><br/>“Something is wrong, this is monster energy.”<br/><br/>Shen Yun suddenly found something abnormal in that aura, realizing the truth in an instant.<br/><br/>“Nine Heavens Divine Law,” it was the guise of a phoenix that the youngster had cultivated, achieving the Unleaking Realm.<br/><br/>Gu Yang was originally a human, even if he practiced the monster race’s cultivation techniques, he wouldn’t become a monster.<br/><br/>Shen Yun was very clear on this point.<br/><br/>In the past, that emperor created this technique for the purpose of allowing humans to cultivate, refining monster energy into a phoenix and transferring it back to himself.<br/><br/>If the practitioner of this technique truly became a monster race being, having the bloodline of the phoenix, it would pose a threat to him.<br/><br/>He would never tolerate such a thing happening.<br/><br/>These were all things that Shen Yun had pondered over for thousands of years.<br/><br/>His research of the technique “Phoenix Dance Nine Heavens” was no exaggeration to say much deeper than Gu Yang’s.<br/><br/>Shen Yun came from humble origins, but he had ambitions. A thousand years ago, he was unwilling to be a servant of the monster race.<br/><br/>After a thousand years of struggle, he achieved the cultivation level of the Unleaking Realm, only a step away from the three monster saints, he was even less willing to be at their mercy.<br/><br/>Originally, Saint Chao Yang’s order was for him to spread the technique of the “Phoenix Dance Nine Heavens”.<br/><br/>Behind the scenes, he disobeyed and only passed down the technique to a select few of his descendants, choosing one talented individual from each generation to cultivate the technique.<br/><br/>Firstly, it was convenient for studying the technique.<br/><br/>Secondly, it was to be able to give a satisfactory explanation to Saint Chao Yang in the future.<br/><br/>Even if the Three Saints pursued it, he had countless excuses to evade responsibility.<br/><br/>That Saint Chao Yang was easy to fool as he was ignorant of worldly affairs. Otherwise, he would not have chosen him as his representative in Great Zhou all those years ago.<br/><br/>During these thousand years, Saint Chao Yang never even checked.<br/><br/>Who knew that all plans would come to naught and this technique would be stolen and fall into the hands of a foreigner, who cultivated it to the realm of divine powers.<br/><br/>This matter finally alarmed Saint Chao Yang who sent an envoy here.<br/><br/>With the envoy’s command, Shen Yun could not refuse and took action himself.<br/><br/>Especially after his son, Shen Zhou, was also killed by that youngster, he simply could not find a reason not to act.<br/><br/>Shen Yun thought this as he stood by the sea. They had already arrived. With his ‘Heaven Viewing and Earth Hearing’ divine power, he discovered the location of Gu Yang.<br/><br/>He was still at the realm of mana!<br/><br/>Shen Yun coldly said, “Gu Yang, there’s no escaping for you.”<br/><br/>They finally met.<br/><br/>Gu Yang heard these words, looked up and saw a black-clothed elder flying towards him. His aura was even more powerful than Red Sun.<br/><br/>Even though they had never met before, he immediately recognized his identity—Shen Family’s patriarch, Shen Yun!<br/><br/>Gu Yang felt somewhat emotional within him.<br/><br/>His grievances with the Shen Family dated back to Shen Baiyi.<br/><br/>Back then, his cultivation was very weak. In several simulations, he was outwitted by Shen Baiyi.<br/><br/>Later, he accidentally acquired the “Phoenix Dance Nine Heavens”, an unparalleled technique. From then on, he was destined to have a life and death enmity with the Shen Family.<br/><br/>Gu Yang was killed by the Shen Family many times in the simulations.<br/><br/>As his cultivation improved, the people the Shen Family sent after him became stronger. But in the end, they were all killed by him.<br/><br/>Now, it was finally Shen Family’s most powerful person, the old monster who had lived for a thousand years, who was personally taking action.<br/><br/>Today, it was time to settle the accounts.<br/><br/>He laughed heartily, “Shen Yun, is it finally your turn to court death?”<br/><br/>In mid-air, Shen Yun was surrounded by absolute darkness that quickly spread out in all directions. He scornfully said, “Do you really believe that by virtue of a divine beast avatar, you can contend with me? Let me show you the true power of the Taiyou Moon Devouring Technique today!”<br/><br/>In an instant, the darkness enveloped Gu Yang.<br/><br/>“Shen Yun?”<br/><br/>A hundred miles away, on the ship at sea, the elder standing at the front of the ship heard this name and his face instantly changed color.<br/><br/>The young man beside him too, turned pale and asked, “Master, isn’t this Shen Yun the same one who exterminated our Zhong Family?”<br/><br/>The elder sucked in a deep breath, his eyes flashing coldly, “It’s that damn bastard!”<br/><br/>His hand had already grasped the hilt of the sword, his palm slightly trembling. It was clear that his heart was in tumult.<br/><br/>“Master!”<br/><br/>The young man beside him turned pale and attempted to dissuade him from drawing his sword, “Don’t…”<br/><br/>These two were members of the Zhong Family.<br/><br/>Five hundred years ago, during the Qin Dynasty, the Zhong Family was once quite influential. They had a member who had reached the Unleaking Realm and were almost considered one of the ten most influential families of the time.<br/><br/>But who would have thought, one night, the Zhong Family was wiped out.<br/><br/>What others did not know was that the Unleaking Realm cultivator of the Zhong Family teleported his two most outstanding descendants away at the last moment.<br/><br/>The old man was one of those survivors, known as Zhong Zilin.<br/><br/>The youth was a descendent of the other survivor and was called Zhong Yanxing. Due to his outstanding talent, Zhong Zilin took him as a disciple.<br/><br/>In those days, the two Zhong Family members were sent to the other end of this world, the West Bank Continent.<br/><br/>After a few hundred years, the Zhong Family had branched out there and taken root.<br/><br/>However, Zhong Zilin never forgot his homeland. Ten years ago, he finally advanced to the Unleaking Realm and decided to return to Great Zhou and avenge the Shen Family.<br/><br/>This time, he had brought along his disciple, Zhong Yanxing. In order to avoid alerting the enemy, they traveled on a merchant ship.<br/><br/>Who would have thought that before they had even arrived at their destination, they would run into their sworn enemy.<br/><br/>And he was in the middle of a battle with an Unleaking Realm Phoenix.<br/><br/>This was an opportunity that could not be missed.<br/><br/>“One is not enough, but what about two?”<br/><br/>The next moment, a loud roar ripped through the darkness and echoed in the sky.<br/><br/>Zhong Zilin was utterly shocked, “Another ultra-level magical beast!”\t\t\t\t\t\t</div>", "images": {}, "success": true}