{"id": 298, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132197.html", "title": "Chapter 298 - Chapter 298: 298 Divine Punishment", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 298 - Chapter 298: 298 Divine Punishment</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 298: 298 Divine Punishment<br/><br/>“Just in time!”<br/><br/>Upon Gu Yang’s arrival at Kun Mountain, he spotted a purple flying sword slashing through the void and followed by a giant bubble fluctuation, which then burst to reveal three figures.<br/><br/>A middle-aged Taoist wearing a tattered golden robe was present, a small magic treasure shaped like a nail emitting dazzling golden light on his head.<br/><br/>The Extreme Sun Nail!<br/><br/>From a glance, Gu Yang recognized the extraordinary magic treasure, it was naturally the legendary Extreme Sun Nail.<br/><br/>Then this Taoist is the esteemed Superior Kunyang.<br/><br/>Another individual was wearing a flower circlet, with pointy ears, fair skin – quite a match for the elf characters in novels.<br/><br/>However, the situation wasn’t looking too good for her at this time – she was trapped in place by a formation and could only passively take the hits.<br/><br/>The power of the Extreme Sun Nail, this magic treasure, was no joke. Every attack it unleashed shook her protective shield continuously.<br/><br/>The third figure present was rather peculiar as well, possessing only the cultivation level of qi refinement, but was somehow unharmed by the combat aftermath of two powerful individuals at the Unleaking Realm.<br/><br/>The one who broke this domain with a purple sword light, who was also a nascent soul cultivator, must be Superior Kunyang’s Dao companion, Loose Immortal Ziyu.<br/><br/>With her joining in the battle, the Elf Clan powerhouse seemed to be hanging by a thread, unable to even fight back under the intense pressure.<br/><br/>On this occasion, Gu Yang chose not to sit by but loudly asked, “Do you need help?”<br/><br/>His words startled all four present parties.<br/><br/>Whoosh!<br/><br/>The purple sword light curved in mid-air, shooting towards the direction the voice came from.<br/><br/>A golden hand reached out and grasped the purple sword light, despite the sword’s struggle, it couldn’t escape the hand’s grip.<br/><br/>“A divine ape?”<br/><br/>The one who made the move was Loose Immortal Ziyu herself. Upon seeing the giant ape with golden fur, she gasped in disbelief.<br/><br/>A divine ape, a mythical beast from legends, naturally possessed unrivaled strength and divine powers from birth, rivaling innate divine spirits.<br/><br/>However, such a divine beast existed only in ancient times, an era where divine spirits and divine beasts dominated the world.<br/><br/>After the rise of the human race, gradually, the innate divine spirits and divine beasts disappeared from this world.<br/><br/>Where did this divine ape come from?<br/><br/>Moreover, it possessed a cultivation level equivalent to the nascent soul stage.<br/><br/>In a realm of the same level, such a divine beast is nearly invincible.<br/><br/>Not only Loose Immortal Ziyu, Superior Kunyang was also taken aback.<br/><br/>What’s happening today?<br/><br/>First, an alien woman arrived, wielding magic and magic treasures that were utterly bizarre and unheard of.<br/><br/>And now a divine ape has appeared.<br/><br/>This was too unusual.<br/><br/>Superior Kunyang instinctively felt a sense of danger. The foreign woman was already difficult to handle, not to mention the divine ape at the nascent soul stage…<br/><br/>While he was contemplating, a sudden clear tweet rang out. A red shadow shot out, followed by a surge of red flames engulfing Loose Immortal Ziyu.<br/><br/>“A phoenix?”<br/><br/>Superior Kunyang’s eyes narrowed, and his heart gave a start.<br/><br/>Another divine beast has arrived.<br/><br/>And it’s a phoenix!<br/><br/>A phoenix, the last emperor of the monster race in ancient times and the greatest enemy of several generations of human emperors. Possessing divine powers that reach high into the skies and penetrate deep into the ground, it is one of the most formidable existences in the Three Realms.<br/><br/>Faced with such a powerful figure from ancient times, well-known for its prestige, Superior Kunyang felt a trace of fear in his heart. With a shake of his hand, he released a red flag that disappeared into the sea of fire, wrapping around Loose Immortal Ziyu’s body.<br/><br/>This flag, a magic treasure known as the Cloud of Fire Flag, is specially designed to counter fire magic techniques.<br/><br/>Under the incineration of the Phoenix True Fire, the flag’s color grew brighter. In a blink of an eye, the flag gleamed like it was being heated red-hot.<br/><br/>“Kill the lad first!”<br/><br/>Loose Immortal Ziyu, who was originally a loose cultivator and fought her way to the top from the lowest rung of society, had a sharper battle instinct than the privileged Tribune Superior Kunyang from the Wanxiang Gate. She quickly realized the connection between the two divine beasts and the Golden Core stage youth.<br/><br/>Killing that lad should break the current encirclement.<br/><br/>As a highly intelligent man, Superior Kunyang readily understood her words. He made his move. The golden light from the Extreme Sun Nail on the top of his head flourished, and multiple golden lights shot towards the two divine beasts.<br/><br/>The two divine beasts were aware of the danger and dared not resist directly, retreating in haste.<br/><br/>Feeling the pressure lessen, Loose Immortal Ziyu’s flying sword managed to break free from the grip of the divine ape and flew straight towards the Golden Core stage youth.<br/><br/>“Kill!”<br/><br/>“An opportunity!”<br/><br/>Gress, who had been under suppression, felt the pressure lighten and was instantly overjoyed. She immediately switched from defense to offense, casting a “Disintegration Spell.”<br/><br/>This was the spell she was saving for a life-or-death escape, but now she didn’t hesitate to use it.<br/><br/>She didn’t understand why this powerful summoner was helping her, but she wouldn’t miss this opportunity.<br/><br/>If she wanted to survive right now, she had to join forces with this summoner.<br/><br/>One “Disintegration Spell” tore a hole in the array confining the space.<br/><br/>Then, a “Great Destruction Spell” promptly followed, bombarding Superior Kunyang’s protective shield, causing it to flicker wildly, almost collapsing.<br/><br/>Superior Kunyang was startled and hurriedly added a formation flag to patch up the Mini Sumeru Array.<br/><br/>At this point, Loose Immortal Ziyu, unified with her flying sword, had already reached the Golden Core youth.<br/><br/>This sword strike embodies her entire life’s cultivation. The sword qi tore through the air, swift and unparalleled, its speed defying imagination.<br/><br/>Seeking a one-strike kill.<br/><br/>She was very clear about how dire the current situation was. The power of that foreigner was only slightly inferior to Superior Kunyang. Adding two divine beasts, her husband and she were no match.<br/><br/>Only by acting first and killing this pivotal figure could the tide of battle be turned.<br/><br/>She was a hundred percent confident in this strike. He was merely a Golden Core, how could he possibly withstand her flying sword?<br/><br/>“Heh”<br/><br/>Just then, she seemed to hear a scornful chuckle.<br/><br/>The next moment, a terrifying blade intent burst from the Golden Core, its destructive aura locking onto her firmly.<br/><br/>Not good<br/><br/>Ziyu Scatterheart’s heart trembled violently.<br/><br/>That blade intent, it reeked of death.<br/><br/>How could this be?<br/><br/>In this life-or-death moment, she no longer cared about anything else and desperately tried to flee.<br/><br/>But it was already too late<br/><br/>The blade fell with incomparable speed, hitting her flying sword directly.<br/><br/>Clang!<br/><br/>A thunderous sound echoed.<br/><br/>Ziyu Scatterheart’s Nascent Soul seemed to have been shattered, and she coughed up a mouthful of blood on the spot.<br/><br/>Swish!<br/><br/>Before she could react, a flash of blade light cut through her protective fire cloud flag. And without losing momentum, it chopped off her head.<br/><br/>A Nascent Soul the size of a fist flew out from her crown, frantically flying toward Master Kunyang.<br/><br/>“Save me”<br/><br/>Before she could fly a few meters, the third blade descended, completely annihilating the Nascent Soul.<br/><br/>[Energy gained: 100 points, current balance: 384 points.]<br/><br/>A prompt appeared before Gu Yang’s eyes. He casually collected her flying sword, the red flag that could resist the Phoenix’s True Fire, and her storage bag.<br/><br/>“What was she thinking, daring to approach me?<br/><br/>In his view, this Ziyu Scatterheart was a bit foolish to willingly approach him and seek death.<br/><br/>In fact, having gained his Phoenix incarnation, he had already made up for his biggest weakness, which was long-range attack methods.<br/><br/>The flames of the Phoenix could reach near or far and had flying speed. Among those of the same level, hardly any cultivator could compare with it.<br/><br/>Even when faced with a cultivator, he no longer needed to worry about being cornered.<br/><br/>Gu Yang cared the most for the Jiuzhou seal. He pulled out the items from the storage bag to inspect, but the seal was not inside.<br/><br/>“Huh? Where is it?”<br/><br/>He was greatly puzzled. The simulation had recorded it very clearly: after killing her, he was supposed to obtain the Jiuzhou seal from her body.<br/><br/>Could it be… it’s on Master Kunyang?<br/><br/>“No!”<br/><br/>Master Kunyang saw his Dao Companion die, his eyes filled with rage. His mana surged from within his body, and the Extreme Sun Nail above his head shone brightly like a sun.<br/><br/>He was ready to fight to the death.<br/><br/>With two whooshing sounds.<br/><br/>Gu Yang withdrew the two Divine Beast incarnations. In the simulation, the two incarnations of the Divine Beast died under this very move.<br/><br/>Then, he sacrificed a black ring that hovered above his head, dropping a black curtain of light.<br/><br/>It was the Magic Treasure, Xuan Light Cover!<br/><br/>On the journey these past few days, he had finally refined the Xuan Light Cover successfully and could use it as a shield.<br/><br/>Next moment, countless light needles fell like rain, shooting toward him, causing the Xuan Light Cover to tremble incessantly.<br/><br/>The Xuan Light Cover barely held up for a moment before dissipating.<br/><br/>In that fleeting moment, enough time to accomplish many things had passed.<br/><br/>Gu Yang took out the Wutu Divine Cauldron, which began to grow larger in his palm, quickly reaching a height of three meters. Afterward, he aimed the base of the cauldron toward the incoming light rain and then jumped inside.<br/><br/>As soon as he was done, the light rain arrived, hitting the base of the Divine Cauldron and creating a dense series of ‘ding’ sounds.<br/><br/>“The Divine Cauldron?”<br/><br/>Master Kunyang never expected that this man would possess an endless supply of Magic Treasures. He could even produce the Divine Cauldron, a famous spiritual artifact from ancient times.<br/><br/>What was even more annoying was that he actually used the Divine Cauldron as a shield.<br/><br/>Although the Extreme Sun Nail was powerful, it was impossible to destroy a spiritual artifact like the Divine Cauldron.<br/><br/>He felt a sense of dread in his heart and no longer wasted his mana uselessly. The glow of the Extreme Sun Nail enveloped him, and he decided to flee decisively.<br/><br/>He even abandoned his battle flags.<br/><br/>“Trying to escape?”<br/><br/>Gu Yang put away the Divine Cauldron, transformed into the Phoenix, spread his wings, and pursued him.<br/><br/>No matter how fast Master Kunyang was, how could he be faster than a Phoenix? In a short while, Gu Yang had already caught up to him.<br/><br/>“Don’t go too far!”<br/><br/>Seeing that he couldn’t escape, Master Kunyang immediately became furious and was about to use his ace in the hole.<br/><br/>Suddenly, he felt his connection with the heavens and earth severed. His mana, unable to resonate with the heavens and earth, couldn’t even conjure any magic.<br/><br/>The next moment, his mana became frail, as if losing its vitality instantly.<br/><br/>How could this be?<br/><br/>Fear filled his heart. Suddenly, he thought of something, and his face turned white, “Is this… punishment from heaven?”\t\t\t\t\t\t</div>", "images": {}, "success": true}