{"id": 294, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132189.html", "title": "Chapter 294 - Chapter 294: 294 Myriad Phenomena Cave Heaven", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 294 - Chapter 294: 294 Myriad Phenomena Cave Heaven</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 294: 294 Myriad Phenomena Cave Heaven<br/><br/>“Ru Qin will tell you how to enter her Sea of Knowledge,”<br/><br/>After Cao Kunpeng finished speaking, he turned and left.<br/><br/>This was a respect for a powerhouse of the same rank. To enter Cao Yiyi’s Sea of Knowledge, one’s consciousness must be detached from the body. Could Gu Yang feel at ease if Kunpeng stayed here?<br/><br/>If Gu Yang was only at the Golden Body realm, Kunpeng of course didn’t need to consider his feelings.<br/><br/>But, Gu Yang was already at the third level of his mana cultivation, his Cultivation Level was not below Kunpeng’s. Therefore, he also had to be cautious.<br/><br/>When you have adequate strength, you can gain corresponding respect.<br/><br/>Cao Kunpeng left, leaving only Ru Qin, Gu Yang and Ling Ling.<br/><br/>Ru Qin told Gu Yang how to detach one’s consciousness, and finally said, “If the young master’s consciousness is rejected when entering the lady’s Sea of Knowledge, it must not be forced in, which would cause irreversible harm to her.”<br/><br/>Isn’t this the method of Spirit Detachment?<br/><br/>Gu Yang was a bit surprised. This method of detaching consciousness was quite clever. It could allow one to enter another’s Sea of Knowledge and also to travel beyond the heavens.<br/><br/>It was very much like the legendary Spirit Detachment technique.<br/><br/>However, Spirit Detachment is extremely dangerous, and the Original Spirit is very fragile before reaching the Celestial Being realm.<br/><br/>Gu Yang repeated the mnemonic several times in his mind and quickly understood.<br/><br/>This technique of spirit detachment was not too difficult; the key was in the trick of it. Without someone to teach, it would be hard to figure out on your own, regardless of how much time you have.<br/><br/>If someone teaches, it is easily mastered.<br/><br/>Because his Cultivation Level had reached, and he had practiced the God Refining Chapter of the Nine Heavens Divine Law, which has a lot of content about the Original Spirit, he naturally learned very quickly.<br/><br/>He closed his eyes and tried to let his Original Spirit fly out from the only gap in the Heavenly Spirit cover, and instantly, he felt an unprecedented brightness.<br/><br/>The Original Spirit had detached!<br/><br/>Immediately after, he felt an intense chill, as if he was in an extremely cold environment, his Original Spirit had been damaged.<br/><br/>He subconsciously returned to his Mortal Body, only then did he feel a trace of warmth.<br/><br/>It was too scary!<br/><br/>Gu Yang was still in a state of shock. His Original Spirit had only stayed outside for less than a second, and it felt as if it had been frostbitten.<br/><br/>It only needed a few more seconds, and his Original Spirit would have completely dissipated.<br/><br/>“Why is this happening?”<br/><br/>He was a bit shocked.<br/><br/>His God Refining Chapter had been cultivated to the sixth level, and his Original Spirit was six times stronger than that of others at the mana cultivation stage. It was surprisingly fragile.<br/><br/>“It felt as if I was hit by a strong wind, my Original Spirit was almost scattered.”<br/><br/>Gu Yang recalled the feeling just now, and could only say that the outside world was too harsh for the Original Spirit.<br/><br/>It seemed that before reaching the Celestial Being realm, spirit detachment means seeking death.<br/><br/>No wonder this magic was nearly lost. He had simulated so many times, yet he had never learned it.<br/><br/>This magic had no use for martial artists below the realm of Celestial Being, it could only be used for suicide.<br/><br/>It couldn’t be said to be completely useless, like in Cao Yiyi’s current situation, it could be useful.<br/><br/>“I’m ready.”<br/><br/>Gu Yan spoke, walked into the pool, placed his hand on top of Cao Yiyi’s head, and closed his eyes.<br/><br/>The next moment, his Original Spirit had already left his body and entered a strange place.<br/><br/>What came into view was a desolate desert, with nothing but the sky full of sand.<br/><br/>But, he did not feel any rejection.<br/><br/>“How do I find her consciousness?”<br/><br/>He looked around and saw an endless desert everywhere, which was a bit difficult.<br/><br/>Suddenly, he caught a glimpse of green in the corner of his eye and flew over there.<br/><br/>It was a green oasis, a small patch of green grass, there was a withered tree trunk and next to it, a flower with black petals swaying in the wind.<br/><br/>In the air, there was a white ball floating.<br/><br/>As Gu Yang approached, an image was reflected on the sphere.<br/><br/>A woman whose face couldn’t be seen clearly was pushing a swing. On the swing, there was a little girl of about three or four years old, and each time she swung high, there would be a giggle.<br/><br/>The little girl’s face could faintly see the shadow of Cao Yiyi.<br/><br/>This ball was clearly the Mysterious Pearl.<br/><br/>She was trapped in the Mysterious Pearl because she was addicted to swinging?<br/><br/>Gu Yang wasn’t sure what to say.<br/><br/>Did every abnormal person have an unfortunate childhood?<br/><br/>Suddenly, the little Cao Yiyi inside raised her head and looked at him, saying happily, “Come and play too.”<br/><br/>Gu Yang touched the orb with his hand and was instantly sucked into it, appearing in a yard, standing opposite to the woman whose face couldn’t be seen clearly.<br/><br/>Little Cao Yiyi said joyfully, “You sit over there, let’s have fun.”<br/><br/>Next to them, a swing appeared out of thin air.<br/><br/>Gu Yang stayed still, saying to her, “We’ve played enough, it’s time to go.”<br/><br/>She pouted and protested, “No, I still want to play. I want you to play with me.”<br/><br/>“I don’t have time to play with you here, stop.” Gu Yang’s tone was harsh.<br/><br/>She said unhappily, “Weren’t you here to play with me?”<br/><br/>“I’m here to take you away.”<br/><br/>“I don’t want to, it’s so fun here, I don’t want to leave.”<br/><br/>“If you don’t go, I will.”<br/><br/>Saying that, Gu Yang made a move to leave.<br/><br/>At that moment, the swing finally stopped.<br/><br/>Little Cao Yiyi shouted, “I won’t let you go.”<br/><br/>In an instant, the surroundings changed into a prison, sealing off all sides.<br/><br/>She said, “I want you to stay with me forever.”<br/><br/>Gu Yang shook his head, “You can’t stop me.”<br/><br/>As he spoke, a towering Divine Ape appeared, growing in size, and tore the roof open in an instant, creating a passage to the outside.<br/><br/>He said, “From now on, our karma is ending.” Then, he leaped out.<br/><br/>He had jumped out onto the outside desert.<br/><br/>“Don’t go!”<br/><br/>Inside, little Cao Yiyi became anxious, stomped her foot and followed him out.<br/><br/>Behind them, everything started to crumble, and the woman with an indiscernible face also faded away.<br/><br/>When she jumped out of that sphere and landed on the ground.<br/><br/>Suddenly, the entire space underwent a drastic change, and countless plants started sprouting from the barren ground.<br/><br/>In a blink of an eye, the deserted desert had turned into a prairie, vibrant with numerous growing trees.<br/><br/>Cao Yiyi still looked like a four or five year old, pleading, “Don’t leave me!”<br/><br/>Gu Yang looked back at her, said nothing, and flew out of that space.<br/><br/>Outside, Ling Ling and Ru Qin were standing, both looking anxious.<br/><br/>Ling Ling was worried about Gu Yang.<br/><br/>Ru Qin was worried about Cao Yiyi.<br/><br/>Concerning the Original Spirit, it was extremely dangerous. If anything went wrong and the Original Spirit was damaged, it would be irreversible. How could Ling Ling not be nervous?<br/><br/>After a dozen breaths, Cao Yiyi’s body suddenly trembled, and her eyes under her eyelids started to move.<br/><br/>Ru Qin was overjoyed seeing this. After such a long time, for the first time, her lady’s body has responded.<br/><br/>Indeed, finding Gu Yang was the right thing to do.<br/><br/>The lady indeed has deep feelings for this man.<br/><br/>Previously, she only suspected this. Now, she was finally certain.<br/><br/>At that moment, Gu Yang had already opened his eyes and flown to the shore. Before he could speak, he sensed Cao Kunpeng’s presence approaching quickly.<br/><br/>On the other side, Cao Yiyi in the Spirit Pool woke up with a start, her eyes wide open.<br/><br/>The white vine wrapped around her loosed, falling into her hand, one end shot into the void.<br/><br/>She shouted, “Gu Yang!”<br/><br/>In an instant, an odd ripple enveloped Gu Yang.<br/><br/>He didn’t struggle and took Ling Ling into his arms.<br/><br/>In a flash, they were pulled into the void.<br/><br/>“No!”<br/><br/>At that moment, Cao Kunpeng had arrived, shouting in frustration.<br/><br/>But he was a step too late, unable to stop his daughter.<br/><br/>After a dizzying turn, Gu Yang and the others appeared in a valley, surrounded by lush plants.<br/><br/>Yes, this is the All-encompassing Cave Sky!<br/><br/>Gu Yang this time came to Cao Yiyi, not only to resolve their karma but also intending to enter this All-encompassing Cave Sky.<br/><br/>The feeling of this place is somewhat similar to the Moonlit Water Cave Sky.<br/><br/>“Huh?”<br/><br/>Suddenly, he sensed two familiar presences, and was surprised, “They actually also came to the All-encompassing Cave Sky?”<br/><br/>Those two presences were the two elf girls he had encountered not long ago on Zhong Zilin’s ship.\t\t\t\t\t\t</div>", "images": {}, "success": true}