{"id": 293, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132187.html", "title": "Chapter 293 - Chapter 293: What Kind Of Mental Process Is That?", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 293 - Chapter 293: What Kind Of Mental Process Is That?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 293: What kind of mental process is that?<br/><br/>The Cao family, like the Wu family, was a force fostered by Red Venerate himself.<br/><br/>In the past, Gu Yang would not actively provoke the Cao family out of caution.<br/><br/>However, times have changed.<br/><br/>Now he possesses two Divine Beast incarnations at the Unleaking Realm level, and with one move of The Celestial Decay, he can eliminate the second tier of the Unleaking Realm.<br/><br/>Ordinary Unleaking Realm powerhouses can no longer pose much of a threat to him.<br/><br/>Even if he encounters someone he can’t defeat, he can escape with incredible speed; hardly anyone can catch up to him.<br/><br/>Even the Red Venerate, intending to project his power into this world, would find that he had already disappeared during the process.<br/><br/>“Grandpa “said that back in the day, the main forces attacking the Wu family were actually the Gao family and the Cao family.”<br/><br/>After entering the territory of Ningzhou, Ling Ling began talking about past events.<br/><br/>When she spoke of the family’s vendetta, she was not as deeply engrained in bitterness as Zhong Zilin was, but seemed fairly calm.<br/><br/>She was too young and naive to understand when the Wu family was exterminated. Wu Er told her about the revenge, which naturally made it seem distant.<br/><br/>“Everyone says that the feud between the Wu family and the Imperial family was instigated by a disciple of the Blue Sky Palace. But in reality, the true mastermind behind the scenes was him.”<br/><br/>She pointed up.<br/><br/>Gu Yang naturally knew whom she was referring to, and was somewhat surprised.<br/><br/>So, this was the truth hidden behind the fog of history?<br/><br/>The extermination of the Wu family was Red Venerate’s way of cleaning his own house?<br/><br/>However, upon further reflection, it made perfect sense.<br/><br/>“Heavenly Elemental God Slaying Art” and “God Destroyer Nine Styles” were clearly methods used by Red Venerate to control the Wu family, yet Wu Er did not practice these two techniques.<br/><br/>Furthermore, Wu Er’s talents were outstanding, and he quickly ascended to the Unleaking Realm.<br/><br/>No matter how one looks at it, the Wu family appeared unfaithful.<br/><br/>For Red Venerate to want to clean house was completely normal.<br/><br/>In fact, given the Wu family’s strength, even with the Cao and Gao families joining forces and inviting a member of the Red Venerate Sect, they might not necessarily win.<br/><br/>However, the Wu family had offended the Imperial family, and with the involvement of a Great Saint from the Three Saints Sect, the downfall of the Wu family was inevitable.<br/><br/>The Zhao family back then was not what it is now.<br/><br/>Gu Yang asked, “Why did Sun Yuwei scheme against the Wu family back then? Did she also bear a grudge against them?”<br/><br/>Sun Yuwei was the one rumored to be a disciple of the Blue Sky Palace twenty or so years ago. There were always rumors that she was the instigator behind the death of the Emperor and the extermination of the Wu family.<br/><br/>Upon hearing him mention this woman, Ling Ling’s expression grew somewhat icy, “She held grudges against the Zhao family. Thus, she meticulously planned to undermine the Zhao family’s rule. In the end, she implicated our Wu family.”<br/><br/>“She had a grudge against the Zhao family?”<br/><br/>This was somewhat unexpected for Gu Yang; he had not anticipated that this would be the truth.<br/><br/>Ling Ling said, “In the time of the Xia Dynasty, our ancestor had favored the owner of the Red Mansion. When the family met with disaster, it was the owner of the Red Mansion who had someone save me. I lived there for several years before Grandpa Second picked me up.”<br/><br/>“The matter about Sun Yuwei was told to Grandpa Second by the owner of the Red Mansion. Since this matter involves the secrets of the Blue Sky Palace, Grandpa Second instructed me not to reveal it.”<br/><br/>Ling Ling looked at him somewhat apologetically.<br/><br/>Gu Yang was somewhat surprised; he had not expected that she would have such a relationship with the mysterious owner of the Red Mansion.<br/><br/>He didn’t care much about Sun Yuwei’s matter.<br/><br/>Compared to that, he was more curious about the owner of the Red Mansion.<br/><br/>He asked, “What kind of person is the owner of the Red Mansion?”<br/><br/>“Actually, I’ve never seen him either. At the time, an old man surnamed Shen was in charge of taking care of me.”<br/><br/>Gu Yang was somewhat disappointed.<br/><br/>If he were to list the people he was most curious about in this world, the owner of the Red Mansion would definitely be included.<br/><br/>How did this fellow rank those lists?<br/><br/>Unfortunately, despite his many trips to Divine City, he had never visited the famous Red Mansion.<br/><br/>Never mind, he’d ask Wu Er about it when he encountered him again later.<br/><br/>The two of them chatted all the way, and Ningzhou City was already in sight.<br/><br/>Within the current Cao family, the most prominent and well-known figure is undoubtedly the Spear Saint, Cao Kunpeng, who is also Cao Yiyi’s father.<br/><br/>He did not live in the old Cao family house but had a separate villa built in Kunshan, two hundred miles away from Ningzhou City.<br/><br/>Gu Yang and Ling Ling headed directly to Kun Mountain and arrived at the entrance of a mountain villa, knocking on its grand door.<br/><br/>After announcing his name, the guard hurriedly went to report.<br/><br/>Soon, Cao Kunpeng’s maid, Ru Qin, came out to greet them. Upon seeing him, her expression was incredibly complex.<br/><br/>She had encountered Gu Yang twice before.<br/><br/>The first time, outside Zhongzhou City, she had witnessed him, with only a Second Grade Cultivation Level, slay a First Rank with his sword.<br/><br/>The second time, in Jingzhou City, she had wanted him to help save Cao Yiyi. At that time, he had just broken through to the First Rank.<br/><br/>Back then, her cultivation level was higher than Gu Yang’s.<br/><br/>Who would have thought, in just a few months’ time, the man standing before her was now a peerless powerhouse in the Mana Realm, possessing a cultivation level equal to her master’s.<br/><br/>Such a stark contrast made Ru Qin’s emotions unsettled.<br/><br/>She took a deep breath, quickly setting herself straight, lowered her head, and gave a salute, “Honored to see you, Master Gu. Please, come in.”<br/><br/>Gu Yang, used to such looks, stepped inside without hesitation.<br/><br/>The architecture inside the villa was grand and imposing; everything was quite new, having been built only a few decades ago.<br/><br/>Gu Yang was given the highest level of reception, and the whole villa was bustling.<br/><br/>As soon as he sat down in the main hall, a man with an imposing aura strode out, his eyes full of contempt.<br/><br/>Upon their gaze connecting, sparks seemed to flicker in the air.<br/><br/>With a face as cold and hard as a rock, the man could not help but show his admiration, “I didn’t expect that in just a few months, you would have grown to this extent. Good!”<br/><br/>Gu Yang asked, “Where is Cao Yiyi?”<br/><br/>There was no chance of him becoming friends with the Cao family, so there was no need to make polite conversation.<br/><br/>“Follow me.”<br/><br/>Cao Kunpeng, being a straightforward person, led them towards the backyard.<br/><br/>They continued to a cave on the back mountain and descended further down into the cave.<br/><br/>After descending hundreds of meters underground, they finally saw Cao Yiyi.<br/><br/>She was immersed in a Spirit Pool, entwined with a white vine, her eyes closed tightly in concentration. With every inhale and exhale, massive amounts of spiritual energy flooded into her body, converting into True Essence.<br/><br/>At a glance, Gu Yang could see that she now possessed a Golden Body cultivation level of the third rank. However, she had lost all consciousness, resembling the living dead.<br/><br/>Her rapid advancement in cultivation over the past few months was not only due to the Spirit Pool but more importantly, to the white vine.<br/><br/>One end of the vine extended into the void, continuously absorbing mystical power and purifying her mortal body.<br/><br/>In her mouth, she held a pearl emitting an arcane power.<br/><br/>However, why had she fallen unconscious?<br/><br/>Gu Yang asked, “What happened to her?”<br/><br/>Cao Kunpeng explained, “Her consciousness is trapped inside the Mysterious Soul Pearl. The only way to awaken her is to enter her sea of consciousness and bring her awareness back from the Mysterious Soul Pearl.”<br/><br/>“Mysterious Soul Pearl?”<br/><br/>“It’s an ancient artifact that can rapidly enhance one’s spiritual consciousness. However, those with weak willpower tend to lose themselves in it.”<br/><br/>Gu Yang understood.<br/><br/>Cao Kunpeng used this method to rapidly increase Cao Yiyi’s cultivation level.<br/><br/>In just a few months, her cultivation level leapt from the Mortal Realm to the Golden Body of the third rank. It was quite unbelievable.<br/><br/>Of course, such a method was obviously extremely dangerous.<br/><br/>This was called overreaching, and it resulted in disaster.<br/><br/>Cao Yiyi couldn’t handle it and turned into an “undead”.<br/><br/>It was apparent to Gu Yang that Cao Kunpeng’s aim was the All-Encompassing Heavenly Hole.<br/><br/>He deduced this from previous simulation results.<br/><br/>People like Cao Kunpeng always had a purpose for their actions.<br/><br/>Gu Yang asked the most crucial question, “Why did you want to find me?”<br/><br/>Looking at his daughter floating in the Spirit Pool, Cao Kunpeng spoke without any change in his tone, “Although her consciousness is lost, she instinctively repels any foreign invaders. We need to find someone whom she won’t reject, only then can we possibly awake her. I and Ru Qin have tried, but it was futile.”<br/><br/>And I’m supposed to succeed?<br/><br/>Gu Yang wanted to retort, but remembered that in a previous simulation, he had indeed successfully awakened her, which left him momentarily speechless.<br/><br/>Looking at Cao Yiyi soaking in the pool, he couldn’t understand what was going on in her head.\t\t\t\t\t\t</div>", "images": {}, "success": true}