{"id": 295, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132191.html", "title": "Chapter 295 - Chapter 295: 295 Void Immortal Vine", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 295 - Chapter 295: 295 Void Immortal Vine</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 295: 295 Void Immortal Vine<br/><br/>At the foot of Kun Mountain outside Ningzhou city, two people quietly arrived, without alarming anyone.<br/><br/>These two people were none other than the elf princess Eve, who had changed her appearance with magic, and the legendary elf mage Gress.<br/><br/>“We’ve arrived.”<br/><br/>Gress took out a jade seal. Using the legendary magic unique to the elf clan, capable of connecting with all living things, they forcefully activated this artifact.<br/><br/>Instantly, a white light beam shot out from the seal, reaching the sky.<br/><br/>“Open!”<br/><br/>Gress quickly sensed the entrance to the different dimension and used the artifact in her hand to open a portal.<br/><br/>The two stepped into the portal.<br/><br/>Upon their disappearance, the portal vanished as well and everything returned to its original state.<br/><br/>After a few moments, a figure appeared out of nowhere, silently gazing at the location where the portal was.<br/><br/>Upon entering the alternate dimension, Gress and Eve felt the vibrant life force of this world, and their moods became exceptionally relaxed.<br/><br/>Eve excitedly said, “It feels as if I’ve returned to the embrace of the Mother Tree, everything is so wonderful.”<br/><br/>Gress said reverently, “This is the blessed land of the Mother Goddess.”<br/><br/>“If our Elf clan could migrate here and reproduce here, it would be such a wonderful thing.” Eve was longing for this.<br/><br/>The Elf clan, innately capable of harnessing the Vitality of the world, is extremely sensitive to the environment.<br/><br/>Whether in the West Bank Continent or in the Divine State Continent, they all feel a sense of oppression. But after coming to this dimension, that oppressive feeling disappeared.<br/><br/>They felt an unprecedented sense of ease.<br/><br/>Suddenly, Gress held a finger to her lips and whispered, “There are people over there.”<br/><br/>“It’s that evil summoner.”<br/><br/>Eve was a natural elemental being, and she was extremely familiar with elements.<br/><br/>Even if the other party deliberately concealed his power, she immediately recognized one of them as the evil summoner they had encountered at sea.<br/><br/>She still hadn’t forgotten that beautiful and pure creature. She remained distressed by the enslavement it suffered at the hands of humans.<br/><br/>“Why is it him?”<br/><br/>Gress was extremely wary of this man.<br/><br/>She, too, was a second-level legendary being. On the sea, she had witnessed this man using a terrifying spell to kill another second-level legend.<br/><br/>The power of that spell was more terrifying than any forbidden spell, a divine-level spell that likely only a half-god could master.<br/><br/>Running into him in this dimension gave her a bad premonition.<br/><br/>It felt like a deliberate arrangement by the god of fate.<br/><br/>“Let’s go.”<br/><br/>Gress grabbed Eve and quickly left without wanting to make contact with that man.<br/><br/>“Who?”<br/><br/>On the other side, Ling Ling, hearing Gu Yang’s words, looked in his direction and asked.<br/><br/>“Two alien beings.”<br/><br/>Gu Yang withdrew his gaze. Regardless of the intentions of the two female elves, he had no desire to meddle in their affairs.<br/><br/>Suddenly, he stretched out his hand and grabbed a clear, white jade-like vine from the void.<br/><br/>This vine was just about to hit Ling Ling.<br/><br/>Gu Yang’s expression turned solemn as he looked at Cao Yiyi and warned, “Next time, I’ll leave you alone here.”<br/><br/>Earlier, while they were talking, Cao Yiyi suddenly attacked Ling Ling with this vine.<br/><br/>If Gu Yang hadn’t been keeping an eye on her, Ling Ling would have certainly been hit.<br/><br/>Cao Yiyi, this crazy woman, was really ruthless.<br/><br/>This vine was also an exceptional divine weapon, capable of merging into the void, rendering it difficult to defend against.<br/><br/>She retracted the vine, which then coiled around her arm and turned into a tattoo.<br/><br/>“Who is she?”<br/><br/>In her eyes, there was a blatant hostility.<br/><br/>Gu Yang said, “What does this have to do with you?”<br/><br/>Cao Yiyi turned to look at him, sizing him up and down, her brow furrowed, “How did you become so strong?”<br/><br/>This greatly displeased her.<br/><br/>She had taken considerable risks to achieve her level of cultivation.<br/><br/>She had thought that after her successful attempt, she would be able to surpass Gu Yang, making him obey her every whim.<br/><br/>Unfortunately, she still couldn’t compare to him.<br/><br/>Gu Yang ignored her and said to Ling Ling, “Let’s go.” He then flew off in a certain direction.<br/><br/>“Wait for me.”<br/><br/>Cao Yiyi hastily followed them.<br/><br/>The most important part of entering a new world is to understand the basic situation of that world.<br/><br/>That’s what Gu Yang thought, and that’s what the two elf women thought too.<br/><br/>However, they did not go in the same direction and ended up in different cities.<br/><br/>Gu Yang and the others ended up in a small county town, where they gathered information during the day, and found a place to rest at night.<br/><br/>After a day, they only obtained the most basic information.<br/><br/>Wanxiang Gate dominated this world, and its cultivation system was somewhat similar to that of Shuiyue Dongtian.<br/><br/>Gu Yang thought to himself, “The seal of Ning King will appear on Pingshan in half a month, in the hands of a Nascent Soul stage cultivator.”<br/><br/>This was exactly why he followed Cao Yiyi to the Wanxiang Dongtian.<br/><br/>Before arriving at Ningzhou, he had carried out a simulation, not only successfully waking up Cao Yiyi, but also obtaining the seventh seal in the Wanxiang Dongtian, and learning the “Divine Ghost Technique”.<br/><br/>Although the Wanxiang Dongtian was dangerous, it was worth taking some risks for that seal.<br/><br/>Anyway, once the seal was in his hands, he could leave the Wanxiang Dongtian immediately.<br/><br/>Unfortunately, this county town was too small and they couldn’t find very useful information.<br/><br/>Maybe they should go to a bigger city tomorrow.<br/><br/>However, one thing made Gu Yang curious.<br/><br/>Why was the language and script used in the Wanxiang Dongtian exactly the same as that of Great Zhou?<br/><br/>He had visited several Dongtians, Shuiyue Dongtian, Jinting Dongtian, and even Huangquan Dongtian, and they all used the same language and script.<br/><br/>This couldn’t help but make him wonder.<br/><br/>This meant that the humans of these four Dongtians shared the same language and ethnicity as Great Zhou.<br/><br/>Knock, knock.<br/><br/>At this moment, someone was knocking at the door from outside.<br/><br/>With a creak, the door was pushed open from the outside, and Cao Yiyi walked in with a basket, “Gu Yang, I made you some food.”<br/><br/>Looking at the suspicious food in the basket, Gu Yang said without expression, “I don’t eat.”<br/><br/>After reaching the realm of Mana, he could already abstain from food and didn’t need to eat anymore.<br/><br/>It wasn’t that he didn’t eat, but he didn’t want to eat what she brought. Who knows what was inside?<br/><br/>Cao Yiyi didn’t seem to mind. She took out the jade-like vine again and said proudly, “Do you know what this is?”<br/><br/>Without waiting for his answer, she said, “This is a Void Fairy Vine, an extremely rare object even in ancient times. It is a naturally occurring Magic Treasure and can break through the void.”<br/><br/>“Cao Kunpeng killed my mother for this object. But he never expected that the Void Fairy Vine only recognizes my mother’s bloodline. He can’t control it at all.”<br/><br/>“He wanted to use me to control the Fairy Vine, but I didn’t want to do what he wished. Even if I don’t cultivate, he can’t do anything to me.”<br/><br/>At this point, she laughed triumphantly.<br/><br/>“Without the cultivation level of the Divine Power realm, one cannot master the Void Fairy Vine. He went to great lengths to find a Spirit Pool and obtained a Mysterious Pearl. All these can help me quickly increase my cultivation. But without my cooperation, it’s useless.”<br/><br/>“Hmm, you always bully me with your martial arts. I thought that someday I would become stronger than you and show you how powerful I am. So, I changed my mind.”<br/><br/>“Nevertheless, I will not allow him to get his way. I know he wants to come to this Dongtian world. I won’t take him here.”<br/><br/>“I also know that he did all of this for a spiritual treasure, do you want to know about it?”\t\t\t\t\t\t</div>", "images": {}, "success": true}