{"id": 292, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132185.html", "title": "Chapter 292 - Chapter 292: 292 Settling Karma (Third Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 292 - Chapter 292: 292 Settling Karma (Third Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 292: 292 Settling Karma (Third Update)<br/><br/>Outside Jingzhou City, in a certain valley.<br/><br/>Ling Ling was regaining her strength. It had taken her a full day, but she had finally replenished her depleted True Essence.<br/><br/>Suddenly, she felt something, opened her eyes and looked up. She saw Gu Yang descending from the sky, a smile gracing his face, “Is everything taken care of?”<br/><br/>“Yes, and I’ve made a new friend too. I’ll introduce you someday.”<br/><br/>Gu Yang was in a good mood for finally making a friend, so he shared the news with her.<br/><br/>“That sounds good.”<br/><br/>“Let’s go.”<br/><br/>“Okay.”<br/><br/>Ling Ling didn’t ask where they were heading next.<br/><br/>After just surviving a life or death situation, she cherished every moment spent with him. Before, they had spent more time apart than together, now they could finally be together.<br/><br/>The two of them chose to walk in remote places.<br/><br/>Gu Yang’s enemies were spread throughout Great Zhou.<br/><br/>He had just shown his face in Jingzhou City and the next day Shen Yun had come after him. It was clear how extensive the Shen Family’s intelligence network was.<br/><br/>Now, although Shen Yun was dead and the Shen Family no longer a threat to him, his adversaries were not only limited to them.<br/><br/>Therefore, he couldn’t go to populated places, especially large cities.<br/><br/>They traveled very fast and by nightfall, they had already reached Lian Mountain Range.<br/><br/>This was where Gu Yang first traversed when he arrived, and now looking back on the then vast mountain range, it seemed trivial.<br/><br/>With his current speed, he could cross the entire mountain range in less than half an hour.<br/><br/>The Liu Family village was just the same as when Gu Yang had left.<br/><br/>He landed at the entrance of the village, holding Ling Ling’s hand, and they strolled into the village.<br/><br/>With night already fallen, there wasn’t much nightlife in the mountain village. The majority had already retired for the day.<br/><br/>Looking at the familiar houses, he felt a surreal sensation.<br/><br/>It had only been ten months since he’d last left.<br/><br/>The village hadn’t changed at all, but he had transformed from a powerless ordinary hunter to a peerless expert with triple-tier Mana.<br/><br/>His name echoed throughout the entire Great Zhou.<br/><br/>Gu Yang walked all the way to his own wooden house. The entrance was overgrown with weeds, and the broken beam was still on the door frame.<br/><br/>He clearly remembered the joy he felt when he activated the system and gained True Qi on that night ten months ago.<br/><br/>Back then, he punched and broke this column.<br/><br/>This was the starting point when he became a martial artist, something he would never forget in his life.<br/><br/>Touching the fracture, Gu Yang said, “I lived here for two years. During that time, I often didn’t have enough to eat.”<br/><br/>Ling Ling paused upon hearing this. She looked around at the bare wooden house, finding it hard to imagine Gu Yang living here.<br/><br/>“Who’s there?”<br/><br/>An alert voice rang out from the side.<br/><br/>“Brother Liu, it’s me.”<br/><br/>The newcomer was Liu Shitou. He was holding a wooden stick and came out. Hearing Gu Yang’s voice, he was slightly surprised. “Gu Yang, is that you?”<br/><br/>Seeing his old friend, Gu Yang laughed, “Who else could it be?”<br/><br/>Liu Shitou approached to take a closer look and confirmed that it was indeed him. He put the stick behind him, clapped Gu Yang’s shoulder, and said with some excitement, “Good to have you back.”<br/><br/>The interior of Liu Shitou’s house was also very simple. He lit the oil lamp on the table and said with a touch of regret, “It’s a pity that we have no wine.”<br/><br/>“Look, what’s this?”<br/><br/>Gu Yang deftly produced two bottles of wine that he had specifically bought before coming.<br/><br/>He said, “Let me introduce, this is my woman.”<br/><br/>“This is Brother Liu, the one who saved my life.”<br/><br/>Upon hearing this, Ling Ling solemnly bowed, “Nice to meet you, Brother Liu.”<br/><br/>Liu Shitou, a simple and honest mountain man, had never seen such a ceremony before and felt a bit awkward. “Why all this formality? Come, let’s drink,” he said, taking a swig from the wine bottle to hide his embarrassment.<br/><br/>Gu Yang said, “Congratulations, you’ve made it.”<br/><br/>After ten months, Liu Shitou had successfully mastered True Qi and became a Ninth Rank martial artist.<br/><br/>“Thank you.”<br/><br/>Liu Shitou picked up the bottle, clinked it against Gu Yang’s.<br/><br/>His current success was all due to the cultivation method that Gu Yang had left him.<br/><br/>The two drank until midnight, at which point Liu Shitou was defeated by the alcohol and fell asleep where he sat.<br/><br/>Gu Yang left a complete copy of the “Xuan Yuan Method”, along with a fist technique, for which he personally wrote some annotations.<br/><br/>He then went to meet the village chief, leaving behind some basic skills and weapons techniques, before departing.<br/><br/>He did not leave anything too profound, everything was basic skills. This was already sufficient for Liu village. If he left behind anything more advanced, it might instead bring disaster onto them.<br/><br/>Gu Yang could only express his gratitude for the shelter Liu village offered him in this way.<br/><br/>The next destination was Wangjiagou.<br/><br/>“Previously this place was occupied by a group of mountain bandits. Qingzhi was kidnapped by them, and almost became their village chief’s wife.” Gu Yang recalled the situation when he first met Su Qingzhi and couldn’t help but find it somewhat funny.<br/><br/>“Later, did you play the role of a hero saving the beauty?”<br/><br/>“She hired me as her bodyguard with 30,000 taels. The discernment of Sister Zhi Xing is really accurate.”<br/><br/>While speaking, Gu Yang took her to a swamp behind them and quickly found the target of their trip.<br/><br/>“It’s indeed still here.”<br/><br/>In the swamp, a dark figure emerged, driven by instinct to pounce towards them.<br/><br/>However, halfway through, it seemed to sense something and suddenly stopped, retreating at an even faster speed.<br/><br/>“Trying to escape?”<br/><br/>Without lifting a hand, Gu Yang summoned a blaze of red fire out of thin air which enveloped the dark shadow. A strange scream echoed out, then the dark figure completely dissipated under the fire.<br/><br/>The dark figure was, in fact, part of Heavenly Extreme Taoist’s body.<br/><br/>Gu Yang had several simulations, each with him dying miserably at the hands of this figure, each death involved being eaten.<br/><br/>Ling Ling said with some surprise, “Heavenly Extreme Taoist?”<br/><br/>“Do you know him?”<br/><br/>“My master told me about him, he is the biggest traitor in our Dao Sect, I can’t believe he managed to break the seal. Not good, have the other seals also been released?”<br/><br/>“Actually, at least two other seals of the Heavenly Extreme Taoist have failed. They were attached to the emperor, and then, were killed by me.”<br/><br/>“Ah?”<br/><br/>Ling Ling heard of this for the first time.<br/><br/>Gu Yang said, “Let’s go.”<br/><br/>Gu Yang’s next destination was Phoenix City.<br/><br/>He first repaid his debt to Liu Village, then went to Wangjiagou to destroy part of Heavenly Extreme Taoist’s body, all of which was in accordance with Wen Jue’s advice. He repayed grudges and gratitude, and settled karma to clear his mind.<br/><br/>In reality, he never encountered any setbacks. His journey was unimpeded; you could say he was invincible.<br/><br/>From an outsider’s perspective, things were going smoothly.<br/><br/>But only he knew how many times he had stumbled in the simulations.<br/><br/>If you were to count the resentments from the simulator, it would be uncountable.<br/><br/>Regardless, he thought he should try resolving them anyway.<br/><br/>After he killed Shen Yun, he finally had some time to do these things.<br/><br/>Settling karma was simple, in reality or in the simulations, he would repay those who helped him and take revenge on those who killed him.<br/><br/>If someone killed him in one simulation but helped him in another, it would be considered an offset of grudges and favors.<br/><br/>Gu Yang took Ling Ling to Phoenix City’s county government office and killed the local official before leaving casually.<br/><br/>This official once plotted against him in a simulation.<br/><br/>Next, they caused a disturbance around the Jiangzhou, returning grudges and favors where it was due.<br/><br/>With his current strength, all of these things were easy to accomplish.<br/><br/>The martial artists and forces that caused him much grievances early on were like ants to him now, being able to obliterate them with a single finger.<br/><br/>In just a few days, Gu Yang disposed of all the karma in Jiangzhou.<br/><br/>Incredibly, he could feel a sense of relief in his soul, as if it had lightened somewhat.<br/><br/>He was a little excited about this.<br/><br/>However, up next was a challenge to tackle – Cao Yi Yi.<br/><br/>This woman, had grudges with him more than once or twice. However, she also saved him. It was difficult to say whether the grudges outweighed the gratitude, or vice versa.<br/><br/>Regardless, he should first wake her up.<br/><br/>The Cao family was in Ningzhou, hence the next destination was Ningzhou.<br/><br/>PS: Seeking monthly tickets for Chapter 3.\t\t\t\t\t\t</div>", "images": {}, "success": true}