{"id": 291, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132182.html", "title": "Chapter 291 - Chapter 291: 291 Is Utter Nonsense", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 291 - Chapter 291: 291 Is Utter Nonsense</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 291: 291 is utter nonsense<br/><br/>“This man is alright.”<br/><br/>Gu Yang had chatted with Zhong Zilin for half a day and had a good impression of him.<br/><br/>Honestly, putting away his two divine beasts embodied was a bit of a test for human nature.<br/><br/>If the others harbored malicious intent and wanted to harm him, then killing them wouldn’t weigh on his conscience.<br/><br/>Unexpectedly, this Unleaking Realm powerhouse not only didn’t take advantage of the situation, but also enthusiastically befriended him, almost as if they had known each other for a long time.<br/><br/>Gu Yang had just finished off Shen Yun, earning two hundred energy points, bringing his system’s balance back to two hundred and eighty-four points.<br/><br/>Once again, he harvested another peerless divine weapon.<br/><br/>Including this one, he now had seven peerless divine weapons, not counting the Phoenix Feather Knife and the Guanghan Immortal Sword he gave to Xi Huang.<br/><br/>Four of them were from the Shuiyue Cave.<br/><br/>Gu Yang was reluctant to use these peerless divine weapons for top-ups, so he always kept them. However, he had no time to consecrate these divine weapons. So far, the first Xuan Guang Shield hadn’t even been consecrated yet.<br/><br/>If this were to continue, his divine weapons multiplying would become a problem.<br/><br/>The women around him, Su Qingzhen possessed the Ice Soul Divine Sword.<br/><br/>After Xu Ruomei regained her cultivation level, she would probably return to the Sword Palace to inherit the Dust Sword.<br/><br/>Pei Qianlan had the Rhinoceros Sword.<br/><br/>Su Ningyan had plenty of magic treasures.<br/><br/>Ye Lingbo had a spiritual treasure.<br/><br/>Only Ling Ling was left without a suitable weapon, so he gave her the Cold-resisting Sword.<br/><br/>There were still six peerless divine weapons idle.<br/><br/>“Let’s keep them for now, I can recharge them when the need arises.”<br/><br/>“What are your plans for the future, Elder Zhong?”<br/><br/>Gu Yang asked about Zhong Zilin’s next move.<br/><br/>“Shen Yun is dead, but his Shen family has not been eliminated.” Zhong Zilin’s tone was filled with killing intent.<br/><br/>In the past, the Shen family had eradicated the Zhong family. This grudge could only be washed away by completely wiping out the Shen family.<br/><br/>“I have other important matters and won’t accompany you.”<br/><br/>Gu Yang was prepared to take his leave.<br/><br/>The speed of this ship was very fast, and they already saw land. His grievance with the Shen family hadn’t reached a critical point. Now that Shen Yun was dead, the matter was settled.<br/><br/>He had to deal with Saint Chaoyang who was about to cross realms soon, and didn’t want to waste time on this matter.<br/><br/>Zhong Zilin said, “We hit it off right away, you don’t need to call me Elder Zhong. If you think highly of me, just call me Brother Zhong.”<br/><br/>“Brother Zhong.” Gu Yang was happy to oblige.<br/><br/>Good grief, the brothers he recognized were older and older. The former King Jinghai was nearly twenty years older than him, a generation apart.<br/><br/>This one was even more outrageous, five hundred years older, he didn’t know how many generations apart they were.<br/><br/>“Haha, good brother.”<br/><br/>Zhong Zilin laughed heartily. He was happy to recognize such a brother on his return to Divine State, who could be a strong reinforcement for him.<br/><br/>“I plan to rebuild the Zhong Family. In the future, you can come to Wei State to find me.”<br/><br/>Gu Yang said, “Sure, when I am free in the future, I will definitely visit.”<br/><br/>He thought of something and reminded, “By the way, Brother Zhong. Once we reach shore, it’d be best if you don’t tell anyone that you know me.”<br/><br/>Zhong Zilin was puzzled, “Why is that?”<br/><br/>“I have quite a few enemies.”<br/><br/>Gu Yang did not elaborate further. After speaking, he summoned his Divine Ape to fly him away. He disappeared in a blink of an eye.<br/><br/>Fairly many enemies?<br/><br/>Zhong Zilin furrowed his brows, thinking that with Gu Yang’s strength, who would dare to antagonize him?<br/><br/>Gu Yang had two super order magical beasts in the Unleaking Realm ready at his side and possessed a saber technique that can slay a second-level Unleaking Realm opponent. All Unleaking Realm beings would probably avoid provoking him.<br/><br/>For Unleaking Realm powerhouses, a fight regarding their pride is the most foolish. A fight, no matter the outcome, will diminish their lifespan.<br/><br/>Without a great grudge like Zhong Zilin’s extermination of his family, or substantial benefits, they would not attack easily.<br/><br/>Whether it was the Divine State or the West Bank Continent, there was little conflict among powerhouses of this level.<br/><br/>In the West Bank Continent, even if underlings from some massive forces fought fiercely, their legendary powerhouses would not casually intervene.<br/><br/>It was the same principle.<br/><br/>Anyone who could be considered an enemy by Brother Gu was definitely not simple.<br/><br/>At this moment, Zhong Yanxing, who was standing nearby, was looking at the sky, seeming somewhat unbelievable, “This man appears to be even younger than my disciple, yet he was able to kill Shen Yun, a legendary second-tier powerhouse?”<br/><br/>Zhong Zilin’s face darkened, “No manners, he is your elder.”<br/><br/>Zhong Yanxing realized his mistake and quickly said, “I stand corrected.”<br/><br/>Eventually, the ship neared shore.<br/><br/>The master and student from the Zhong Family, along with the two women from the Elf Clan, all disembarked and chose to enter Jingzhou City to gather information.<br/><br/>Whether it was Zhong Zilin who hadn’t returned to Divine State for five hundred years, Zhong Yanxing who had never set foot on this land, or the two elves, all of them were stunned by the grandeur and prosperity of Jingzhou City.<br/><br/>In the West Bank Continent, even the most prosperous commercial city couldn’t compare with this one.<br/><br/>Zhong Zilin felt as if he was in a different world upon returning to his homeland. They found a crowded inn, ordered some food, and while enjoying the local cuisine, they listened to the discussions of the people outside.<br/><br/>The most discussed topic among the people outside was about the Brother Gu he had just met.<br/><br/>It turned out that a day before, Brother Gu had dealt with a mysterious powerhouse in this city.<br/><br/>Zhong Yanxing said, “I didn’t expect Elder Gu to be so famous.”<br/><br/>However, as they heard more and more about Gu Yang, their expressions grew increasingly spectacular.<br/><br/>Tales of how he overcame powerful enemies with ease.<br/><br/>Stories of him being the most handsome man in the world, who seduced the queen of Jinghai, causing Princess Chang and the Queen Mother to fight over him.<br/><br/>Tales of him being the number one traitor, who, for the Queen Mother, murdered the emperor.<br/><br/>The most outrageous of all, in less than a year, he had advanced from a sixth-grade mortal warrior to the third layer of mana!<br/><br/>Eventually, Zhong Yanxing couldn’t help but ask, “Master, what kind of realm is the sixth grade?”<br/><br/>Zhong Zilin didn’t reply, he seemed somewhat dazed.<br/><br/>Common sense told him that this was absolutely impossible, regardless of whether it was in Divine State or the West Bank Continent, nobody could possess such cultivation speed.<br/><br/>Even the legendary God’s Child, born with a half-god’s body, would need several years to grow to the stage of a Mage’s grandmaster.<br/><br/>In less than a year, you’ve got to be kidding, right?<br/><br/>Yet, he couldn’t easily judge the veracity of the claims, given the seriousness of the ongoing discussions outside.<br/><br/>Suddenly, he remembered what Gu Yang had said about having lots of enemies before leaving.<br/><br/>If these rumors were true, then no wonder he had so many enemies…<br/><br/>“This is simply a pack of lies.”<br/><br/>On the other side of Jingzhou City, the two Elf women, who had used their transformation techniques to change their appearances, also decided to first gather intelligence about the continent.<br/><br/>Both of them knew the “general language” magic, so language wouldn’t be a barrier for them.<br/><br/>They also heard the discussions about Gu Yang.<br/><br/>When they were on the ship, they had heard the name of that legendary second-tier powerhouse, and knew that person was Gu Yang.<br/><br/>When Princess Eve heard these outrageous rumors, she couldn’t help but say, “Is that guy the reincarnation of a God?”<br/><br/>The older elf next to her was much more composed and said, “Regardless of whether it’s true or not, it has nothing to do with us. We need to quickly find out where Ningzhou is. Then, we must find that item.”<br/><br/>Upon hearing this, Princess Eve sat back down, a trace of worry in her eyes, “Even if we get to that place called Ningzhou, how would we find that dimensional plane?”<br/><br/>The Elf woman took out an object and said, “Before leaving, the High Priest gave me this, he said it would allow us to enter that dimensional plane and find the piece of Mother Tree that was left here.”<br/><br/>Princess Eve looked closely and saw a jade seal that seemed extraordinary. She felt relieved, so the High Priest had already made arrangements for this.<br/><br/>[Simulation has ended, you can retain one of the following items: ]<br/><br/>When Gu Yang returned to the land, he opened the system and saw this prompt.<br/><br/>“I choose the first one.”<br/><br/>In an instant, his almost desiccated mortal body began to regain vitality, his mana started filling his body again, and he was restored to his original state.<br/><br/>Facing a powerhouse like Shen Yun, he had naturally prepared in advance. Initiating a simulation beforehand was his precaution for the aftermath of using the Celestial Destruction technique.\t\t\t\t\t\t</div>", "images": {}, "success": true}