{"id": 290, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132180.html", "title": "Chapter 290 - Chapter 290: 290 Dead!", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 290 - Chapter 290: 290 Dead!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 290: 290 dead!<br/><br/>“Divine Annihilation: The Sixth Form, Celestial Being Withering!”<br/><br/>With a swing of the blade, the encircling darkness that was like solidified ink, halted mid-air.<br/><br/>At the very source of the darkness, Shen Yun, who had just flung aside the two divine beasts and Zhong Zilin, was now being bound by an invisible force in mid-air, and the darkness of his spatial magical domain instantly shattered.<br/><br/>At this moment, Shen Yun felt an unprecedented sense of danger, his pupils instantly constricting.<br/><br/>He was going to die!<br/><br/>The shadow of death shrouded him.<br/><br/>No!<br/><br/>Shen Yun’s expression turned wild, without reservation or regard, he exploded with all the mana within his body, pushing the Taiyou Moon Devouring Technique to its limit.<br/><br/>His body began to dematerialize, blending into the void.<br/><br/>Just then, Gu Yang’s saber reached him, slicing through that space.<br/><br/>The space paused for a moment, and a figure was forced out. It was Shen Yun, his face covered in pain and his clothes becoming filthy.<br/><br/>“My body”<br/><br/>He let out a terrified scream as his face started to decay, and soon, skin and flesh fell off.<br/><br/>He desperately tried to catch the decaying chunks of meat, trying to stuff them back onto his face, but he couldn’t hold on——his palms were decaying too, “No”<br/><br/>At this point, Zhong Zilin had surfaced, witnessing the appalling state of Shen Yun, he couldn’t help but gasp, his scalp tingling.<br/><br/>What kind of saber technique was this?<br/><br/>Shen Yun was at the second level of the Unleaking Realm, even though he hadn’t reached the point of being immune to all methods, he couldn’t be injured by ordinary mana.<br/><br/>Moreover, at this point, even if he suffered a fatal injury, as long as his origin wasn’t drained completely, he could recover quickly.<br/><br/>He was utterly clueless how a warrior at the third level of mana could make Shen Yun end up like this?<br/><br/>Only a curse from a half-god-level witch or demon could have such power, right?!<br/><br/>In an instant, Shen Yun’s screams abruptly stopped, his body already reduced to a puddle of dirty blood. The phoenix beside him spat out a flame, turning that pile of dirty blood into ashes.<br/><br/>An absolute powerhouse at the second level of the Unleaking realm met an inglorious end.<br/><br/>“Did he just die?”<br/><br/>Having witnessed the enemy who exterminated the Zhong family dying in front of his eyes, Zhong Zilin felt slightly dazed.<br/><br/>Five hundred years had passed.<br/><br/>In the five hundred years on the West Bank Continent, there wasn’t a single day that he didn’t think of taking his revenge. This vengeance held him up, helping him overcome numerous difficulties, leading him to his current achievements.<br/><br/>When he finally achieved the Unleaking body, he couldn’t wait to return to Divine State to take revenge on Shen Yun.<br/><br/>He knew Shen Yun’s days were numbered.<br/><br/>He absolutely refused to let Shen Yun die of old age; he vowed to be the one to kill his enemy.<br/><br/>As soon as he came back, he made countless plans on how to gradually dismantle the power of the Shen Family, kill every single member, then join hands with Shen’s enemies to kill Shen Yun…<br/><br/>However, he could never envision that before even reaching the shore, he would encounter Shen Yun.<br/><br/>What was even more unexpected was that this archenemy would die at the hands of a warrior with third-level mana.<br/><br/>Everything happened too quickly; he didn’t even have time to experience the thrill of avenging his enemy.<br/><br/>With a sense of confusion, Zhong Zilin saw the young man’s body withering away visibly, his mana was entirely drained and his mortal body was so weak that he seemed to die at any moment.<br/><br/>If it weren’t for the monster beside him catching him, he would have fallen into the sea.<br/><br/>He understood.<br/><br/>It seemed that to unleash an attack of such immense power required a price to be paid.<br/><br/>In fact, the reason Zhong Zilin dared to come back and seek revenge from Shen Yun, who was superior to him in cultivation level, was that he had a similar do-or-die plan.<br/><br/>At this moment, the young man, standing in the palm of the divine ape, spoke in a weak voice, “Thank you for your help. May I know your name?”<br/><br/>Zhong Zilin saw the sincerity in the other’s eyes and felt a sense of admiration towards him. He was used to the mutual defensiveness and scheming between legendary powerhouses in the West Bank Continent; this was the first time he had met such a candid person. He replied, “Not at all. I am Zhong Zilin, an enemy of Shen Yun.”<br/><br/>The young man perked up, “The surname Zhong, could it be the Zhong Family from Wei State five hundred years ago?”<br/><br/>Upon hearing ‘Zhong Family from Wei State’, Zhong Zilin couldn’t help but remark emotionally, “I never imagined that after several centuries, there are still people who remember the Zhong Family.”<br/><br/>“It’s an honor to meet you, Elder Zhong. My surname is Gu, and my name is Gu Yang.”<br/><br/>“It is I who should thank you for killing that old bastard and avenging my enemy.” Zhong Zilin did not put on airs.<br/><br/>Although the other party looked extremely weak, judging only by the two ultra-class monsters beside him, he could not be underestimated.<br/><br/>Gu Yang responded, “Elder Zhong, you’re too kind. I, too, have a bitter feud with Shen Yun. If not for your timely intervention, he would have escaped, the future trouble would have been endless… cough…”<br/><br/>Saying this, he suddenly started coughing violently.<br/><br/>Zhong Zilin spontaneously extended an invitation, “It’s windy here. Brother Gu, if you don’t mind, you can rest on the boat for a while.”<br/><br/>“It’s an honor then.”<br/><br/>The sky cleared of its dark clouds.<br/><br/>All of a sudden, the tumultuous storm subsided, replaced by a clear, sunshiny day with not a cloud in sight.<br/><br/>The storm had roared in furiously, but its disappearance was even more abrupt.<br/><br/>On board the ship, the sailors started hoisting the sails, continuing their voyage.<br/><br/>This routine was interrupted again when a golden ape came flying in their direction, causing a significant commotion and piercing screams.<br/><br/>“Everyone, please stay calm. That is a friend of my master and won’t harm anyone…”<br/><br/>Zhong Yanxing stepped forward, reassuring the people on the ship.<br/><br/>Once the golden ape had shrunk to human size and landed on the ship, causing no harm and merely following a young man around, the West Bankers on the ship relaxed their fear.<br/><br/>Still, they dared not get too close.<br/><br/>Anyone with a bit of common sense knew that creatures capable of flying were, at the very least, high-level magical beasts.<br/><br/>With only one intermediate mage and one middle-level sword master on board the ship, they were no match for this top-tier magical beast.<br/><br/>Zhong Zilin and his disciple had concealed their actual cultivation levels, thus no one on the ship knew about their true strength.<br/><br/>Seeing the fear the people on the ship had towards the celestial ape, Gu Yang decided to withdraw it back into his body.<br/><br/>The folks on the ship watched this happen, and there was another round of surprised gasps.<br/><br/>They were speaking the language of the West Bank Continent, which Gu Yang couldn’t understand.<br/><br/>Zhong Zilin had just witnessed how Gu Yang had kept the phoenix inside his own body, so he surmised that Gu Yang was likely a summoner.<br/><br/>Seeing him recall the ape this time filled Zhong Zilin with admiration. He believed that Gu Yang, kind and sincere, was someone worth knowing.<br/><br/>Even in his current weakened state, Gu Yang had withdrawn both beasts, showing he harbored no suspicions or wariness towards him. Such trust was extraordinarily rare.<br/><br/>Despite his broad knowledge and experience, Zhong Zilin had never encountered anyone like Gu Yang before, which invoked in him a desire to befriend this young man.<br/><br/>Suddenly, Gu Yang asked, “Who are the other two people on the ship?”<br/><br/>Zhong Zilin understood whom Gu Yang was referring to and responded, “They’re members of a certain religious sect from the West Bank Continent. Folks from these sects are zealots. It would be best not to provoke them.”<br/><br/>Beyond his disciples, there were other passengers aboard this ship—two women—neither of whom was to be underestimated. One of them, like him, possessed legendary strength.<br/><br/>‘Legendary’ referred to the Unleaking Realm.<br/><br/>Both women radiated the scent of divine beings, indicating that they were from religious sects.<br/><br/>Why these women would conceal their cultivation levels and travel so far to the Divine State, however, Zhong Zilin didn’t know.<br/><br/>Knowing well how tricky dealings with religious sect members could be, Zhong Zilin didn’t bother to meddle in their affairs, avoiding the potential for attracting trouble.<br/><br/>Despite their shared journey on the same ship and knowing of each other’s presence, they had not had any interactions. Each side had maintained an unspoken understanding.<br/><br/>“Sects?”<br/><br/>Gu Yang looked towards the ship cabin, a thoughtful expression on his face.<br/><br/>The aura of the two women triggered an inexplicable sense of familiarity in him, but he couldn’t pinpoint where this sense had originated.<br/><br/>He asked, “Which sect they belong to?”<br/><br/>Zhong Zilin replied, “These two, most likely elves, worship the Elf Goddess, the Goddess of Nature.”<br/><br/>Gu Yang retracted his gaze and changed the subject, “Master Zhong, have you been on the West Bank Continent all these years?”<br/><br/>“Yes, exactly five hundred years. I wonder what has become of the Divine State. I’ve heard that the Qin Dynasty has fallen. Is the Great Zhou reigning now?”<br/><br/>“Yes, the Qin Dynasty fell five hundred years ago…”<br/><br/>And so, the two of them started talking about the Great Zhou and the West Bank Continent.<br/><br/>Meanwhile, in the cabin, the two elf women were also discussing the two men outside.<br/><br/>“Damn that human summoner. He dares to enslave such pure and beautiful creatures.”<br/><br/>A younger elf spoke angrily.<br/><br/>As friends of nature, elves harbor a special fondness for pure creatures. The phoenix, a divine beast, naturally fell into their area of aesthetic admiration.<br/><br/>Seeing such a pure creature enslaved by an evil human was enough to enrage them.<br/><br/>An elder elf cautioned, “Princess Eve, don’t forget our mission. Even with that Eastern Sword Saint, we do not have a guaranteed victory, let alone with two ultra-tier magical beasts!”<br/><br/>Princess Eve replied dejectedly, “I know; I won’t act rashly.”<br/><br/>“Our journey here is to save the Mother Tree, bearing the future of the entire elf race on our shoulders. That eastern continent is very dangerous, filled with numerous strong presences. You saw just now, a Legendary Second-Order being fell.”<br/><br/>“This is not West Bank Continent, nor the Misty Forest. Please control your temper.”<br/><br/>The older elf’s stern admonishment brought tears to Princess Eve’s eyes, but she didn’t dare to refute.\t\t\t\t\t\t</div>", "images": {}, "success": true}