{"id": 297, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132195.html", "title": "Chapter 297 - Chapter 297: 297 Collisions", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 297 - Chapter 297: 297 Collisions</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 297: 297 Collisions<br/><br/>Kunshan, the most famous fairy mountain in the Great Moon Dynasty, is shrouded in clouds and mist all day long, akin to a fairyland.<br/><br/>This is also considered a sacred place by all cultivators within the Great Moon Dynasty.<br/><br/>In the Great Moon Dynasty, anyone who wants to embark on the path of cultivation has only one way to do so — by journeying to Kunshan and becoming a disciple of Kunshan.<br/><br/>Using Kunshan as a stepping stone, they then join the Wanxiang Gate and set foot on the path to eternal life.<br/><br/>There are countless people yearning to join Kunshan. However, Kunshan only accepts new disciples once every ten years, and there are only ten places available.<br/><br/>The competition is extremely fierce, only true geniuses have a chance at joining Kunshan.<br/><br/>Today is the day of Kunshan’s open door, a group of youngsters arrive one after another at the foot of the mountain, making their way up with a pilgrimage-like reverence.<br/><br/>These people are the ones who have passed the initial selection and are eligible to compete for the ten spots — a total of three hundred people.<br/><br/>The first test is to reach the peak of Kunshan.<br/><br/>“Have you heard? This year, a person with an innate flame body appeared. He was directly led to the peak, bypassing the test.”<br/><br/>“Doesn’t that mean there’s one less spot available?”<br/><br/>“Damn it! Why are we so unlucky, encountering a rare innate body that hasn’t appeared for hundreds of years.”<br/><br/>When this news spread, it caused an uproar.<br/><br/>“Silence.”<br/><br/>Suddenly, a loud shout rose, stifling the buzz of whispers. An elegant man declared loudly, “Those who make it to the peak before darkness falls may proceed to the next test.”<br/><br/>Having said this, he swooshed upwards into the sky.<br/><br/>Boom. The group of youngsters started scrambling to run up the mountain.<br/><br/>Amid the crowd, a nondescript young man in grey clothing moved nimbly. With a quick dodge, he dove into a nearby forest, choosing not to follow the main group.<br/><br/>“Mother, I will become a disciple of Wanxiang Gate to avenge my father’s death!”<br/><br/>A raging fire burned in the young man’s eyes, his gaze unwavering.<br/><br/>The young man was Nie Yuxuan, fourteen years old, from a small place. He had endured countless hardships and defeated numerous competitors to get here, vying for the last ten spots.<br/><br/>To him, becoming a disciple of Kunshan was only the first step.<br/><br/>The disciples of Kunshan are only the outer disciples of Wanxiang Gate.<br/><br/>Only by becoming an inner disciple of the Wanxiang Gate would he have a chance to avenge his father’s death.<br/><br/>His enemy is too powerful!<br/><br/>To become an inner disciple, you have to participate in the grand competition held once every twenty years.<br/><br/>Wanxiang Dongtian consisted of seven main continents, each with a Domain Lord.<br/><br/>Under the Domain Lords, there are several grand dynasties.<br/><br/>Each dynasty has a Nascent Soul Stage powerhouse in residence, just like Kunshan, which is responsible for recruiting outer disciples.<br/><br/>The Wanxiang Gate manages Wanxiang Dongtian this way, firmly controlling it in their hands and from every continent, they select the most outstanding individuals to inject fresh blood into the sect.<br/><br/>Nie Yuxuan moved quickly through the forest. The lush vegetation did not hinder him at all.<br/><br/>He was at the ninth level of Qi Refinement, only one step away from establishing his core foundation. He could easily move through the forest.<br/><br/>In fact, the three hundred people who came today all have a qi cultivation level of at least eight and are all under the age of sixteen.<br/><br/>Anyone who doesn’t meet this standard isn’t even eligible to be here.<br/><br/>Among them, at least a few dozen people are at the ninth level of qi refinement.<br/><br/>If it was just a matter of comparing cultivation levels, he had confidence he could rank within the top ten.<br/><br/>However, Kunshan’s rules do not merely consider cultivation level. In fact, there isn’t much difference between the eighth and ninth level of Qi Refinement.<br/><br/>Kunshan also tests their adaptability, willpower, as well as the elusive factor of fortune.<br/><br/>Of course, if someone could advance to the Foundation Establishment stage before turning sixteen, they could directly secure a spot.<br/><br/>Just like the girl who has the innate body constitution.<br/><br/>Nie Yuxuan originally had a chance, but he still fell a bit short.<br/><br/>“If only I had six more months…”<br/><br/>Just as he was thinking this, the scenery in front of him changed abruptly. The trees around him seemed to vanish into thin air, leaving emptiness.<br/><br/>What just happened?<br/><br/>Stunned, he heard a cold voice say, “Who’s this wicked intruder, daring to cause trouble on Kunshan!”<br/><br/>The voice resonated, almost making him faint from the dizzying noise. But just then, a cooling sensation came from the jade pendant hanging around his neck, helping him regain consciousness.<br/><br/>Nie Yuxuan turned towards the source of the voice. In the sky, there was a middle-aged Daoist in Daoist clothing with golden edges, giving him the appearance of an immortal.<br/><br/>Could this be…Master Kunyang?<br/><br/>He was taken aback.<br/><br/>Master Kunyang, a Nascent Soul Stage powerhouse, was the master of Kunshan and a representative of Wanxiang Dongtian. A person of high status whose presence was felt throughout the Great Moon Dynasty.<br/><br/>Why would such an important person appear here?<br/><br/>Is this part of the test, too?<br/><br/>While Nie Yuxuan was bewildered, a woman with an odd accent said, “Hand over that thing on your head.”<br/><br/>He looked around but saw no one speaking.<br/><br/>“Hahaha ….”<br/><br/>Master Kunyang burst into laughter, “Daring to covet my Extreme Sun Nail, you sure have great guts.”<br/><br/>As he spoke, a streak of blue light shot out from his forehead towards the ground.<br/><br/>“Great Dissolution Technique!”<br/><br/>Nie Yuxuan heard a string of weird sounds, almost like a chant of a spell.<br/><br/>The next moment, Master Kunyang was surrounded by crackling noises and his golden aura began to flicker rapidly, as if it might collapse at any moment.<br/><br/>“Eternal Sunlight!”<br/><br/>Following that, another series of incantations.<br/><br/>Before Nie Yuxuan’s eyes, a sun appeared. The blinding light stung his eyes and a terrifying wave of heat rolled over him.<br/><br/>It’s all over!<br/><br/>Just as he was certain he was doomed, an invigorating aura surged from the jade pendant around his neck. The terrifying heatwave suddenly turned gentle, like a cool breeze brushing over his body.<br/><br/>Amazingly, he was unscathed.<br/><br/>The sun persisted for two breaths’ time before it began to dissolve.<br/><br/>Nie Yuxuan was drenched in cold sweat, his heart still fluttering as he clutched the jade pendant hanging from his neck.<br/><br/>If it weren’t for this keepsake his father left him, he would have been reduced to ashes by now.<br/><br/>Honestly, he never expected this jade pendant could withstand such a terrifying attack.<br/><br/>“Right, Master Kunyang–”<br/><br/>Upon remembering Master Kunyang standing in the heart of the explosion, his heart tightened. He looked up.<br/><br/>The site of the explosion was empty.<br/><br/>His heart trembled. “Could it be… he was obliterated?”<br/><br/>Suddenly, a crack appeared in space and a somewhat disheveled figure stepped out. It was Master Kunyang.<br/><br/>However, he wasn’t the dignified figure he once was. His clothes were charred and broken and half of his hair and beard were burned off.<br/><br/>“Enough!”<br/><br/>Master Kunyang spat these words through gritted teeth. The murderous intent in his eyes was palpable.<br/><br/>How many years had it been since he’d last been this disheveled, after he reached the Gold stage and became an inner disciple of the Wanxiang Gate?<br/><br/>He was nearly killed in that last explosion.<br/><br/>His heart was filled with an intense mix of shock and fury. He would not let the person responsible get away.<br/><br/>Swish, swish, swish…<br/><br/>With a wave of his hand, Master Kunyang sent several black array flags merging into the void.<br/><br/>“Get out here!”<br/><br/>With his loud shout, the surrounding space rippled. Soon after, a person was squeezed out — it was Gress, a legendary second-tier mage from the Elf Clan.<br/><br/>The shock in her heart was no less than Master Kunyang’s.<br/><br/>Her two legendary spells failed to kill him. Especially the last one which tore open space, it was on the level of a half-god spell.<br/><br/>How did he survive?<br/><br/>Swish!<br/><br/>Suddenly, a blue streak of light flew towards Gress, pa-pa-pa-pa-pa-pa.<br/><br/>Six crisp sounds echoed, as her six protective spells were broken simultaneously. Now, only three layers of shielding were left.<br/><br/>Not good!<br/><br/>Her heart pounding, she was about to cast another spell when the light shot away again. Its speed was beyond her imagination.<br/><br/>Such a terrifying artifact!<br/><br/>Gress was alarmed and had the urge to retreat.<br/><br/>This mysterious artifact was- fast, powerful and made one shiver. A few more hits and her shield would be completely shattered.<br/><br/>The other legendary spells she had prepared were unlikely to kill her opponent.<br/><br/>If she didn’t leave now, she wouldn’t be able to once another legendary powerhouse arrived.<br/><br/>So, with a flash, she tried to escape.<br/><br/>The moment she disappeared, she was forced back into the space by a tremendous force.<br/><br/>“Space Lockdown?”<br/><br/>Gress sank in her heart. Nothing indicated her opponent had cast a spell, and yet, he managed to lock the space.<br/><br/>“Thinking of running? Too late.”<br/><br/>Master Kunyang sneered, waving his hand, several flags that had just entered the void materialized, forming a circle around the foreign woman.<br/><br/>Her unique spells intrigued him, fueling his desire to keep her alive.<br/><br/>He was curious, where exactly was this foreign woman from?<br/><br/>No such peculiar spell existed in Wanxiang’s Cave World.<br/><br/>Keeping down his excitement, Master Kunyang speculated that this woman might come from the main world isolated from the Wanxiang Cave World for tens of thousands of years.<br/><br/>With this thought, his excitement was palpable.<br/><br/>If he could capture her alive, it would be his enormous contribution.<br/><br/>“Just surrender yourself!”<br/><br/>Master Kunyang said, his flying sword continuously swirling, breaking the few remaining shields on her, ready to bring her to heel.<br/><br/>And then, the alien woman pulled out a flower crown from nowhere and put it on her head. It formed a white glowing shield around her instantly.<br/><br/>His flying sword struck the shield but failed to make any impact.<br/><br/>A Magic Treasure?<br/><br/>Master Kunyang’s eyes narrowed, his hands never ceased to move. From the center of his forehead, a small nail flew out. It was the Extreme Sun Nail – a treasured possession.<br/><br/>After being hit by the Eternal Ash, this treasure was also somewhat damaged.<br/><br/>Yet, in order to break the opponent’s protective barrier created by the Magic Treasure, he had no choice but to utilize this treasure.<br/><br/>The power of this treasure was incredibly significant.<br/><br/>He had spent over a thousand years refining this treasure. Although he couldn’t fully utilize its power, it was more than sufficient to deal with someone in the mid-stages of Nascent Soul.<br/><br/>With a flash of golden light, the white guardian was hit and began to tremble violently.<br/><br/>At that moment, the sky shook, and a crack appeared. A woman stepped out from it. It was Master Kunyang’s Dao Companion, The Purple Jade Hermit.<br/><br/>She shouted, “I’m here to help!” Then she released her flying sword and attacked Gress.<br/><br/>Facing the siege of two legendary powerhouses, Gress felt increasing pressure. Even the Thorn Crown, one of the highest artifacts of the Elf Clan, began to falter.<br/><br/>If this continued, she would undoubtedly die here.<br/><br/>Desperation filled Gress’s heart.<br/><br/>Suddenly, a man’s voice rang in her ear, “Do you need help?”<br/><br/>She was taken aback. The voice sounded familiar. It was the powerful summoner she had encountered on the ocean.<br/><br/>PS: I was tricked today and feel depressed, so there are only two updates. Let me adjust a bit.\t\t\t\t\t\t</div>", "images": {}, "success": true}