{"id": 296, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132193.html", "title": "Chapter 296 - Chapter 296: 296 Extreme Sun Nail", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 296 - Chapter 296: 296 Extreme Sun Nail</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 296: 296 Extreme Sun Nail<br/><br/>Spiritual Treasure?<br/><br/>Gu Yang understood. Cao Kunpeng had exerted so much effort naturally because he was scheming something significant.<br/><br/>Either he wanted to further improve his cultivation level, or he was after a powerful Magic Treasure.<br/><br/>A piece of Spiritual Treasure is enough to tempt figures like Cao Kunpeng.<br/><br/>He casually said, “I’m not interested in Spiritual Treasures.”<br/><br/>This was the truth. He had two ancient spiritual treasures in his possession, the Nine God Cauldrons. However, they were useless. He couldn’t use them to ward off enemies at all.<br/><br/>Not to mention Spiritual Treasures, he had a bunch of Magic Treasures, which he hadn’t had the time to refine. They were of no use to him for the time being.<br/><br/>Although Spiritual Treasures were attractive, they were not of significant use to him now, and wouldn’t worth his risking to fight for it.<br/><br/>Cao Yiyi thought that he would be surprised and interested after she revealed this blockbuster news. However, he didn’t seem to be interested at all.<br/><br/>He is not interested in Spiritual Treasures?<br/><br/>Her smile stiffened.<br/><br/>Aren’t men supposed to be most interested in powerful techniques, elixirs, and powerful divine weapons?<br/><br/>It’s a Spiritual Treasure!<br/><br/>For that Spiritual Treasure, Cao Kunpeng painstakingly got close to her mother, tried to deceive his intentions but when he failed, he arranged to have her killed, to get the Void Fairy Vine.<br/><br/>Later, he discovered that he could not refine the Void Fairy Vine, so he targeted her instead.<br/><br/>To this end, he plotted for more than a decade, managed to get that Spirit Pool and the Black Pearl, and spent so much effort.<br/><br/>Just so she could break through to the realm of Divine Power as soon as possible and control the Void Fairy Vine.<br/><br/>For that Spiritual Treasure, Cao Kunpeng had devoted himself utterly; he basically put half of his family wealth on stake.<br/><br/>Gu Yang just casually said that he was not interested, and he even disdained the Spiritual Treasure.<br/><br/>His reaction stunned her.<br/><br/>Cao Yiyi thought he didn’t understand the value of Spiritual Treasures, so she hastily added, “That’s an ancient Spiritual Treasure passed down from prehistoric times, named the Extreme Sun Nail. As the apex of Yang and solidity, it specifically banishes all sorts of Yin and demonic evils…”<br/><br/>Extreme Sun Nail?<br/><br/>Upon hearing her description, Gu Yang suddenly realised.<br/><br/>This thing is clearly designed to deal with the Red Sun.<br/><br/>It looks like not only the Wu Family, but even the Cao family, have begun to have second thoughts about the Red Sun, and wanted to break away from its control.<br/><br/>That was a good thing.<br/><br/>If the Cao family was to revolt, it would greatly weaken the power of the Red Sun.<br/><br/>The Red Sun currently controlled three forces: the Cao family, the Gao family, and the Red Venerate Sect.<br/><br/>The Red Venerate Sect was undoubtedly the most loyal, but Gu Yang had already killed their leader, the Red Sun. In the short term, they should find it hard to produce another Unleaking Realm cultivator.<br/><br/>If the Cao family had a shift in allegiance, what about the Gao family?<br/><br/>Gu Yang remembered Gao Fan, who had given up his cultivation and disguised himself. This man most likely was also trying to break away from the Red Sun’s control.<br/><br/>To completely eliminate the Red Sun wouldn’t be easy.<br/><br/>The mysterious old man he had met in the Yellow Springs Cave had mentioned that it had integrated with the Red Sun. To kill it, he would have to destroy the entire Red Sun world.<br/><br/>That was a difficult proposition.<br/><br/>To obliterate an entire world, what kind of power would someone need?<br/><br/>However, if he could sever all of its tendrils reaching into this world, it wouldn’t pose a threat to him any longer.<br/><br/>These tendrils included the Cao family, the Gao family, and the Red Venerate Sect, among others.<br/><br/>While pondering, Gu Yang started to develop some interest in the Extreme Sun Nail.<br/><br/>If this Spiritual Treasure was as Cao Yiyi described it, if it was truly effective against the demonic being. It could be used not only against the Red Sun but also against the strange beings of the Yellow Springs Cave.<br/><br/>He asked, “Do you know where this Spiritual Treasure is?”<br/><br/>Cao Yiyi paused, her gaze slightly shifty, “Um… can’t we just inquire about it?”<br/><br/>Gu Yang had purposely asked. Neither Cao Kunpeng nor Cao Yiyi had been to the Wanxiang Cave; how could they know where the Extreme Sun Nail is?<br/><br/>“You can leave now.”<br/><br/>After sending her away, Gu Yang opened the system.<br/><br/>This time, he encountered those two Elf Clan women who didn’t even mention this matter in the previous simulation.<br/><br/>He was worried something unexpected might happen and decided to run a simulation.<br/><br/>[Do you want to use the Life Simulator? Using it once consumes forty points of energy.]<br/><br/>“Yes.”<br/><br/>[At the age of twenty-two, you’re already at the third level of mana. You joined forces with Zhong Zilin above the East Sea and killed Shen Yun.]<br/><br/>[Two days later, you go to Ningzhou with Cao Yiyi to enter the Wanxiang Cave Sky.]<br/><br/>[You head to Kun Mountain in search of the Extreme Sun Nail, encountering two Elven Women being besieged. You witness them being killed by two Nascent Soul cultivators.]<br/><br/>[You step in immediately and, in the end, kill the two Nascent Soul cultivators with the Celestial Being’s Demise technique. The two divine beasts they had evolved into die, and you suffer severe injuries.]<br/><br/>[You find the Extreme Sun Nail and a Nine Province Seal. Cao Yiyi tried to open a spatial gate using the Void Vine and leave the Cave Sky but finds that the spatial dimension has been sealed off.]<br/><br/>[Soon, a Celestial Being realm cultivator appears and captures you all.]<br/><br/>[The Wanxiang Gate threatens your life and forbids Cao Yiyi from opening the Spatial Gate, and then they launch a large-scale invasion of the Divine State.]<br/><br/>[You’re imprisoned, and five years later, you pass away from severe injuries at the age of twenty-seven.]<br/><br/>Things did change indeed.<br/><br/>Gu Yang was somewhat relieved. Fortunately, he was alert enough. Otherwise, if he met these two Nascent Soul cultivators, it would be more than he could handle.<br/><br/>During the last simulation, he met only one Nascent Soul cultivator, whom he easily killed and then left the Wanxiang Cave Sky with his possessions.<br/><br/>Also, he did not obtain the Extreme Sun Nail, just a Nine Province Seal.<br/><br/>Which is to say, the Extreme Sun Nail was in the possession of the other Nascent Soul cultivator.<br/><br/>“It seems that the Nascent Soul cultivator brandishing the Extreme Sun Nail must be incredibly powerful.”<br/><br/>Both divine beast incarnates died, and he had to use the Celestial Being’s Demise to kill these two people. He also suffered a backlash, was severely injured, and just barely managed to win.<br/><br/>In the end, a powerful celestial cultivator from Wanxiang Gate was alerted. He was captured, causing Wanxiang Gate to invade several years earlier than they should have.<br/><br/>At this point, Qin Wu hadn’t become a celestial being yet, and Ye Lingbo’s cultivation level was very low.<br/><br/>Could just the Dean of the Literature Department, who was hanging by a thread, and Luo Wang withstand this?<br/><br/>[Simulation ended. You can keep one of the following items.]<br/><br/>[First, your martial arts level at twenty-two.]<br/><br/>[Second, your martial arts experience at twenty-seven.]<br/><br/>[Third, your life wisdom at twenty-seven.]<br/><br/>Gu Yang didn’t choose and shut down the system.<br/><br/>Then, he took out a black ring, the Magic Treasure Xuan Guang Shield.<br/><br/>A defensive treasure obtained from the master of the Bihan Peak in Water Moon Cave Sky. It provides a strong shield and can withstand a full strike from an Unleaking cultivator.<br/><br/>It can save his life at critical moments.<br/><br/>Of all the magic treasures he possessed, he valued the Xuan Guang Shield the most. It was very useful, whether he was using it for himself or protecting others.<br/><br/>However, the mana imprints in the Xuan Guang Shield were very stubborn. No matter how he tried to wash them away with his mana, they remained unyielding.<br/><br/>Moreover, the mana imprint in the Xuan Guang Shield seemed to belong to another route than Bihan Peak Lord, pointing out that its original owner was someone else, and was incomparably superior in cultivation than the Peak Lord.<br/><br/>Gu Yang could only try to grind it away bit by bit.<br/><br/>Even the most stubborn imprint will be worn away someday.<br/><br/>As his level continued to rise, this process would become faster.<br/><br/>After reaching the third level of mana, the mana imprint finally started to loosen. He estimated that in another ten to eight days, he would be able to completely erase it and gain control of this magic treasure.<br/><br/>The next day, after finding out the approximate location of Kun Mountain, Gu Yang and the others set off in that direction.<br/><br/>To avoid unnecessary trouble, all three of them disguised their cultivation levels, keeping a low profile.<br/><br/>Upon encountering a large city, they would go in to gather information and finally learned the name of the Nascent Soul cultivator in Kun Mountain.<br/><br/>This person was known as Venerable Kunyang, a mid Nascent Soul cultivato and a capable subordinate under a Domain Lord of Wanxiang Gate. It was said that he carried a spiritual treasure, making his strength comparable to a late Nascent Soul cultivator.<br/><br/>He also had a Dao Companion named Purple Jade Ascetic, an early Nascent Soul cultivator and also an elder of the Wanxiang Gate.<br/><br/>The two of them were in charge of maintaining peace in the Great Moon Dynasty and were entities that transcended the royal family.\t\t\t\t\t\t</div>", "images": {}, "success": true}