{"id": 299, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132199.html", "title": "Chapter 299 - Chapter 299: Not Enough 299", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 299 - Chapter 299: Not Enough 299</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 299: Not enough 299<br/><br/>“Dead?”<br/><br/>On the scene, Nie Yuxuan, who everyone overlooked as a small invisible figure, saw that Ziyun was killed on the spot, and his mind buzzed – almost unable to believe his own eyes.<br/><br/>A Nascent Soul stage powerhouse just… died?<br/><br/>As far as he knew, there were only three Nascent Souls in the Great Moon Dynasty, one of which was in the royal family of the Great Moon Dynasty and was bestowed upon by the Wanxiang Gate.<br/><br/>Here, the Wanxiang Gate was the preeminent power. Even among the independent cultivators, the highest stage was the Golden Core stage. There wouldn’t be a Nascent Soul stage powerhouse.<br/><br/>So, in this world, when one reached the Nascent Soul stage, they basically would not make a move on others.<br/><br/>The infighting of Nascent Soul stage elders was strictly forbidden within the Wanxiang Gate. When no rivals could be found, it was naturally rare for a Nascent Soul stage powerhouse to fall.<br/><br/>Now, Nie Yuxuan has personally witnessed a Nascent Soul falling before his eyes, which dealt a huge shock to him.<br/><br/>“Who on earth is that person?”<br/><br/>No matter how hard he thought about it, he couldn’t figure out how such a powerhouse would suddenly appear in the Great Moon Dynasty – even daring to kill the elders of the Wanxiang Gate.<br/><br/>While he was in shock, Kunyang ran away. That man transformed into a phoenix and catching up in the blink of an eye.<br/><br/>Suddenly, Nie Yuxuan felt a throbbing in his heart, a sense of impending disaster. His fear made his hands and feet feel a chill.<br/><br/>However, he had no idea where this fear came from.<br/><br/>The next moment, he saw a terrifying scene.<br/><br/>Kunyang’s aura suddenly began to decay, his clothes became rotten, the skin on his face decayed, starting to gush out black pus…<br/><br/>In the blink of an eye, his body was completely decayed. Even his bones turned into black pus and blood, and not even his Nascent Soul was left behind.<br/><br/>This Nascent Soul stage monk, Kunyang, followed in his wife’s footsteps, dying a tragic death.<br/><br/>Nie Yuxuan felt a chill in the depths of his heart, no longer daring to even look at that man.<br/><br/>It’s too terrifying!<br/><br/>In the blink of an eye, two Nascent Soul stage powerhouses were killed by him.<br/><br/>What kind of power is this!<br/><br/>[Received 200 energy points, current balance 584.]<br/><br/>Upon seeing this prompt, Gu Yang felt relieved and the aftermath of the Celestial Being’s demise didn’t feel so uncomfortable.<br/><br/>He called out another prompt,[Simulation ends, you can keep one of the following items.]<br/><br/>“I choose the first one.”<br/><br/>In an instant, that extreme feeling of weakness disappeared, his frail body quickly recovered to its peak, and his Mana also replenished.<br/><br/>Suddenly, a white figure rushed from the side towards the Extreme Sun Nail that was still in place.<br/><br/>“Trying to loot?”<br/><br/>Gu Yang sneered. Since his debut, no one has ever dared to steal from him.<br/><br/>And it’s just a Mana stage guy.<br/><br/>From the center of his brow, a red shadow shot out. It grabbed the Extreme Sun Nail later yet arrived first. With a flap of its wings, it slapped the woman who wanted to loot hundreds of meters away.<br/><br/>The one who tried to loot the Extreme Sun Nail was the elf princess, Eve, who was hiding nearby.<br/><br/>She had a noble bloodline and was born with a Mana domain. The domain that separated the outside world just now was hers.<br/><br/>When the domain was broken by Ziyun, she suffered a backlash and was seriously injured. She hid on the side, waiting for an opportunity.<br/><br/>Seeing the terrifying legendary powerhouse die, and the trunk of the Mother Tree falling in place, she couldn’t help but make a move, trying to loot the items.<br/><br/>However, she was slapped away by the phoenix, swirling in the air before finally stabilizing herself.<br/><br/>Eve was furious that the one who spoiled her good deeds was the sacred bird, “Why do you help that evil human?”<br/><br/>She was the child of nature and was born with an aura that was extremely affable to creatures of the good faction.<br/><br/>In the Foggy Forest, she made countless friends, including unicorns, the legendary creatures.<br/><br/>This bird, noble and proud, was clearly from the good faction and yet attacked her. This was the first time it had happened since she was born, so how could she not be angry?<br/><br/>All of this was obviously at the instigation of the evil summoner.<br/><br/>As Eve thought about this, her heart filled with anger and sadness. She said anxiously, “You are so noble and sacred, why do you submit to this human’s control? Rise and resist, you deserve freedom.”<br/><br/>This girl must have something wrong with her mind.<br/><br/>Seeing her act with such righteous indignation, Gu Yang just wanted to laugh.<br/><br/>This phoenix was one of his avatars. Was he supposed to rebel against himself?<br/><br/>The Phoenix flew back to Gu Yang’s side, not even giving the elf princess a look.<br/><br/>Seeing its reaction, Eve felt even more heartbroken. She angrily said: “Are you just willing to be his slave?”<br/><br/>“Princess!”<br/><br/>At this point, Gress finally broke free from the spell and hurried over, standing in front of the princess.<br/><br/>She knew very well how terrifying this man was.<br/><br/>At this point, she had used most of the magic she had prepared. She definitely couldn’t beat him.<br/><br/>Gu Yang paid them no mind, collected everything left by Kunyang, including a flying sword, and a Qiankun bag.<br/><br/>The Qiankun bag, a familiar item – he had seen it in the Water Moon Cave and the Golden Court Cave – was a spatial item used to store things.<br/><br/>He originally had quite a few of these, but as soon as he returned to the Great Zhou, they would stop working, and the space inside would disappear.<br/><br/>From this, it can be seen that the laws of the Great Zhou are very different from the two cave worlds.<br/><br/>Gu Yang emptied the contents of the Qiankun bag. There were quite a lot of random items.<br/><br/>“How can there be nothing?”<br/><br/>He was surprised, even here with Kunyang, there was no Nine Provinces Seal.<br/><br/>Where could the Nine Provinces Seal have gone?<br/><br/>Where exactly was the error?<br/><br/>Suddenly, he turned his head, looking at the two women from the Elf Clan not far off, somewhat surprised, “Could it be that the Nine Provinces Seal is with them?”<br/><br/>Despite how outlandish this idea is, there were no other possibilities.<br/><br/>The Nine Provinces Seal from the Divine State surprisingly ended up in the hands of the elf clan on another continent; this was indeed too absurd.<br/><br/>This has become a bit troubling now.”<br/><br/>Gu Yang saw that the two women were quite far off, with on guard expressions, it seemed unlikely that he would be able to launch a surprise attack.<br/><br/>The Unleaking Realm magic he saw earlier seemed pretty strange; it should possess the capacity to rip through space, providing an easy escape.<br/><br/>If forcefully taking it was impossible, then he would have to resort to temptation.<br/><br/>He took out the Extreme Sun Nail, feeling the extremely yang and rigid energy it emitted, asking, “Do you want this?”<br/><br/>Earlier, that woman fought tooth and nail to obtain this item; evidently their aim at Kunyang, was the Extreme Sun Nail.<br/><br/>The elder of the two women said, “That’s our clan’s sacred object, we kindly ask you return it to us—and our Elf Clan will be forever grateful.”<br/><br/>Although her words were understandable, her tone was strangely formal.<br/><br/>This woman was a bit too candid, openly revealing that it was a sacred item from her clan.<br/><br/>This was practically asking him to name his price.<br/><br/>Gu Yang’s eyes held hints of mockery, “Taking a spiritual treasure so lightly and just saying thanks—you think it’s that easy. If you want this, sure, make a trade with something else.”<br/><br/>At this, Eve could contain herself no longer, and angrily said, “That was originally our clan’s sacred object, it rightfully belongs to us.”<br/><br/>Gu Yang coldly laughed, “That’s my spoils of war—whose fault is it that you couldn’t beat them? Of course, you can also try to take it—if you succeed, it’s yours.”<br/><br/>“You”<br/><br/>Eve wanted to say something, but Gress pulled her back, afraid that the princess would infuriate him further, quickly asked, “What do you want in return? As long as our clan can provide it, you just have to ask.”<br/><br/>“You’ve misunderstood.”<br/><br/>Gu Yang shook his head, replying, “Currently, you’re the ones making the offer. For this spiritual treasure, how much are you willing to offer in exchange?”<br/><br/>Hearing his response, Gress felt a pang in her heart. She had experienced human greed before, and the human in front of her was obviously the most cunning kind—he wouldn’t quit until he sucked them dry.<br/><br/>Gu Yang, not waiting for her reply, continued, “This isn’t the right place for negotiations, let’s leave.”<br/><br/>With the death of two Nascent Souls, this would surely alert the top members of Wanxiang Gate. According to Simulation’s calculations, a Celestial Being strongman would soon arrive.<br/><br/>He flew off at once.<br/><br/>Since he knew that the Extreme Sun Nail was so important to these two elves, he naturally wouldn’t worry about them not giving chase.<br/><br/>As expected, the two elf women hurriedly followed behind.<br/><br/>After leaving Kunyang, Gu Yang picked up Cao Yiyi and Ling Ling, flew several thousand miles before stopping, then began to negotiate with the two elves who had been following at a distance.<br/><br/>He said, “So, how about it? Have you thought it through?”<br/><br/>Gress took out a ring and a short sword, “This is the Artifact, Love God Ring. After wearing it, one can receive the protection of the Love God and withstand one legendary magic.<br/><br/>“This is the Sword of Kru. Its only attribute is to inflict serious injuries. As long as it pierces, no matter how shallow the wound is, it will inflect serious injuries on the spot.”<br/><br/>Both were excellent treasures. There were only a few artifacts left in the Elf Clan. They only brought a few with them on this trip.<br/><br/>Gu Yang’s face remained unchanging, stating, “Not enough.”<br/><br/>Elf Princess Eve’s face was livid upon hearing this. If it hadn’t been for Gress’s repeated warnings on the way here, she wouldn’t have been able to hold back her rage.<br/><br/>Gress bit her teeth and took out a necklace, “This is the Chain of the Heart. After wearing it, it can immune you from mind-related magic.”<br/><br/>Gu Yang still shook his head, stating, “Not enough.”<br/><br/>After that, Gress continued to take out several items one by one. However, each time, Gu Yang shook his head in dissatisfaction.<br/><br/>Eve watched his insatiable behavior, her face turning green with anger.<br/><br/>In the end, Gress’s face turned paler, no longer able to bring out anything else, she replied, “We only have these items.”<br/><br/>Gu Yang, seeing that she still had yet to take out the Nine Provinces Seal, was growing slightly impatient and asked, “Are you sure?”<br/><br/>Gress’s face changed at his words and she finally bit the bullet, removing the Thorn Crown. “This is one of the most important artifacts of our clan—the Thorn Crown. After wearing it, one can receive the protection of the gods.”<br/><br/>That offer was somewhat sincere.<br/><br/>Gu Yang had seen the power of this artifact before—it was also a spiritual treasure. Its value was similar to that of the Extreme Sun Nail, making it a fair trade.<br/><br/>However, in terms of function, the Extreme Sun Nail was still more useful. It could be used against that person from Chi Ming Heaven.<br/><br/>But that wasn’t what he really wanted.<br/><br/>He still shook his head, stating, “Not enough.”<br/><br/>At this, the expressions on Gress’s face mirrored that of Eve’s. Suppressing her anger, she said, “Don’t push us too far. These artifacts are more than enough to exchange for that sacred object.”<br/><br/>Gu Yang’s expression did not change as he calmly responded, “Right now, you’re the ones that want to trade with me. Naturally, I set the price. If I say it’s not enough, then it’s not enough. If you feel it’s an unfair trade, you don’t have to trade.”<br/><br/>After saying that, he made a move to leave.<br/><br/>Gress changed her expression drastically and hastily stopped him, “Wait.”<br/><br/>The sacred object was tied to the future of the Elf Clan. If they were unable to bring it back, within a few hundred years at most, the Elf Clan would be extinct. No matter the cost, they had to get it.<br/><br/>She forced down her anger and said, “We really can’t bring out anything else.”<br/><br/>“No,” Gu Yang gave her a hint, “Think again. What else do you have?”<br/><br/>He didn’t clarify outright because he didn’t want to reveal his intentions.<br/><br/>If they knew how important the Nine Provinces Seal was to him, they might end up being the ones dictating high prices.<br/><br/>By then, one Extreme Sun Nail for one Nine Provinces Seal would be a massive loss.<br/><br/>Who knew, upon hearing this, both Elf women’s faces drastically changed. It seemed they were misunderstanding.<br/><br/>PS: I only slept for four hours last night. I kept thinking about the troubling matter when I tried sleeping. Even when night came, and after I adjusted myself, there were only two updates today. I’ll get back on track tomorrow.\t\t\t\t\t\t</div>", "images": {}, "success": true}