{"id": 307, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132214.html", "title": "Chapter 307 - Chapter 307: 307 Conditions", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 307 - Chapter 307: 307 Conditions</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 307: 307 conditions<br/><br/>When Gu Yang walked out of the Red Mansion, his brow was slightly furrowed, as if he was pondering something.<br/><br/>When he entered the courtyard outside, he ran into the little girl again.<br/><br/>She curiously asked, “What did the teacher say to you?”<br/><br/>“Children shouldn’t ask too many questions.”<br/><br/>Gu Yang left the words hanging, strode out of the gate, leaving the little girl behind stomping her feet in anger, grumbling, “You’re the child.”<br/><br/>When he walked out, the wooden door closed behind him.<br/><br/>Outside the gate, a person stood by the wall with her head down, almost invisible. It was Eve. She had followed him out without his notice, disguising herself with magic.<br/><br/>Gu Yang was somewhat surprised.<br/><br/>He originally thought that she would purposefully cause him trouble. Despite her life and death being under his control, causing trouble was not difficult for her.<br/><br/>She really had professional integrity!<br/><br/>He asked, “How do you reach the Legendary level on the West Bank Continent?”<br/><br/>He had learned about the power structure of the West Bank Continent from Zhong Zilin. Their ‘Legendary’ level was equivalent to the Unleaking Realm of Great Zhou.<br/><br/>But at that time, due to time limitations, he didn’t delve deeper into it.<br/><br/>Now, having acquired a subordinate equivalent to the third level of Mana, he naturally wanted to understand more.<br/><br/>If she became a Legendary mage, then he would have an additional helper.<br/><br/>Eve replied indifferently, “Only by receiving the protection of a God can one advance to Legendary. This continent has not been blessed by a God.”<br/><br/>The implication being, advancing to Legendary can only be achieved on the West Bank Continent, and only with the protection of a God.<br/><br/>Gu Yang asked again, “How far are you from it?”<br/><br/>“My mother once said that I could hold the promotion ceremony in ten years.”<br/><br/>Elsewhere, inside the Red Mansion.<br/><br/>In the grand hall, the man in white still sat on a cushion. Suddenly, a person walked in.<br/><br/>The visitor was none other than old Shen. He looked at the three books on the wooden shelf and asked, “How do you find this youngster?”<br/><br/>The man in white replied, “There seems to be a layer of fog around him. I can’t see through ”<br/><br/>Old Shen appeared a bit solemn. Even the owner of the Red Mansion couldn’t see through that youngster. Who on earth was he?<br/><br/>He asked again, “Did he agree to that proposal?”<br/><br/>“He is a man who values friendship and loyalty.”<br/><br/>Old Shen thought about Gu Yang’s relationship with that woman. If he were truly a man of loyalty, he would certainly not stand by and do nothing.<br/><br/>But<br/><br/>“Is it really worth it for him to confront Saint Chaoyang?”<br/><br/>As far as he knew, in over a thousand years, the man before him had never had any conflicts with the Four Great Sacred Lands.<br/><br/>The Red Mansion never meddled in worldly disputes.<br/><br/>When the Xia Dynasty fell, he remained impassive.<br/><br/>When the Celestial Being of the Lin Family was besieged, he was still indifferent.<br/><br/>When the Dean of the Academy and the Man from Chi Ming Tian both suffered a great loss, he was still without a reaction.<br/><br/>He seemed like a detached observer, watching the world with a transcendental perspective.<br/><br/>The Four Great Sacred Lands would not provoke a powerful enemy without reason.<br/><br/>All along, the two parties had minded their own business.<br/><br/>However, today, the always detached owner of the Red Mansion had, surprisingly, started to meddle in worldly affairs, even daring to confront a Saint from the Three Saint Gates.<br/><br/>This move would break the silent agreement between the Red Mansion and the Four Great Sacred Lands, bringing about uncontrollable consequences.<br/><br/>What would the attitude of the Four Great Sacred Lands towards the Red Mansion be in the future?<br/><br/>Would they join forces to eliminate this influence that had survived since the Xia Dynasty?<br/><br/>All kinds of thoughts were whirling around in Old Shen’s mind.<br/><br/>The man in white didn’t answer his question.<br/><br/>He understood immediately. He bowed and walked out.<br/><br/>Once outside, he looked up at the sky, a faint smile barely perceptible at the corner of his mouth.<br/><br/>After being at the Red Mansion for so many years, he finally understood what the owner of the Red Mansion truly cared about.<br/><br/>By the time Gu Yang returned to the Academy with Eve, everyone had already dispersed.<br/><br/>Only Zhou Zongye was left in the courtyard. He had prepared tea and was waiting for him.<br/><br/>Zhou Zongye asked curiously, “What kind of person is the one from the Red Mansion?”<br/><br/>Gu Yang pondered for a moment and shook his head, “I can’t quite say. He seems unfathomable.”<br/><br/>It was hard to describe what kind of person he really was. He couldn’t figure out the other party’s real purpose from the brief interaction.<br/><br/>“What did he invite you over for?”<br/><br/>“To protect our homeland.”<br/><br/>Zhou Zongye, somewhat puzzled by this answer, repeated, “Protect our homeland?”<br/><br/>“You heard correctly.”<br/><br/>Gu Yang couldn’t help but laugh. At that time, he also found it absurd when the Lord of the Red Mansion proposed the condition.<br/><br/>The Lord of the Red Mansion told him that the Barbarians from the grasslands were about to invade Great Zhou. He was asked to join the army and head to the frontier to resist the Barbarians, to protect the territory of Great Zhou from invasion.<br/><br/>Wasn’t that protecting our homeland?<br/><br/>Who would have thought that the Lord of the Red Mansion, who had always been aloof from worldly affairs and never meddled in mundane matters, would make such a request?<br/><br/>Then, the owner of the Red Mansion told him bombshell news.<br/><br/>On the grasslands, a new Celestial Being had appeared. Together with the original one, there were now two Celestial Beings. In terms of high-end strength, these grasslands had surpassed Great Zhou.<br/><br/>This fact was also the confidence behind the Khan’s invasion of Great Zhou.<br/><br/>Thinking about this, Gu Yang felt a headache.<br/><br/>He had not expected there to be two Celestial Beings on the grasslands.<br/><br/>In Great Zhou, there was only Luo Wang left. The Dean of the Academy was already half-handicapped. If they really went to war, Great Zhou would obviously be at a disadvantage.<br/><br/>Apart from the ever-threatening Chi Ming Tian, Great Zhou was already on the brink of extreme danger.<br/><br/>Whether annihilated by the Barbarians of the grasslands or ending up in Chi Ming Tian’s clutches, either outcome would be disastrous for Great Zhou.<br/><br/>Zhou Zongye knitted his brow and asked, “Has there been some change on the grasslands?”<br/><br/>It was no wonder he was the Deputy Dean of the Academy, quick to pinpoint the crux of the problem.<br/><br/>Gu Yang replied, “They say there’s a new Celestial Being on the grasslands.”<br/><br/>“What?”<br/><br/>Zhou Zongye’s face changed drastically. He shot up from his seat, his expression growing very serious, “Is this true?”<br/><br/>Gu Yang replied, “That’s what he told me.”<br/><br/>With a whoosh, Zhou Zongye disappeared from the spot, leaving Gu Yang no idea where he went.<br/><br/>Gu Yang picked up the tea cup in front of him and drained it.<br/><br/>Behind him, Eve stood with her head down the whole time. On her wooden face, a faint change took place.<br/><br/>[Simulation ends, you may retain one of the following…]<br/><br/>These were the rewards he hadn’t claimed when the simulation ended earlier.<br/><br/>“I choose option two.”<br/><br/>After receiving his reward, Gu Yang restarted the simulation.<br/><br/>In the previous simulation, nothing was mentioned about the Barbarian invasion, and Saint Chaoyang had appeared shortly after.<br/><br/>He suspected that he hadn’t agreed to the Lord of the Red Mansion’s request in the last simulation.<br/><br/>If that wasn’t the case, it would be the other party reneging on the agreement, or some accident occurred.<br/><br/>He needed to check again.<br/><br/>[At twenty years old, you are already at the third layer of Mana…]<br/><br/>PS: Double requests for monthly tickets continue. One more chapter to come, probably at one o’clock.\t\t\t\t\t\t</div>", "images": {}, "success": true}