{"id": 300, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132201.html", "title": "Chapter 300 - Chapter 300: Oath Of The 300 Covenant", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 300 - Chapter 300: Oath Of The 300 Covenant</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 300: Oath of the 300 Covenant<br/><br/>“Despicable!”<br/><br/>Eve couldn’t hold it back anymore, her face was flushed red. A symbol lit up at her brow, and her slightly curly black hair fluttered without wind.<br/><br/>A powerful and strange fluctuation emanated from her.<br/><br/>Huh?<br/><br/>Gu Yang was somewhat surprised. Her cultivation level was originally equivalent to the mana realm. Now, she had burst out with power equivalent to the Unleaking realm. It was apparent that she had used some kind of secret method to forcibly elevate her realm.<br/><br/>His eyes narrowed, releasing two dangerous rays of light, “So, you want to snatch it by force?”<br/><br/>“Princess, don’t do it!”<br/><br/>Gress became anxious and quickly pulled Eve back, shouting, “Don’t forget what you promised before we set off. I now command you to stop!”<br/><br/>Eve, who was about to rampage, finally regained a bit of her sanity after being shouted at. She panted heavily, and the mark in the middle of her eyebrows faded away.<br/><br/>The powerful and strange fluctuation also disappeared.<br/><br/>Her eyes were somewhat red as she stared fiercely at Gu Yang as though he was her sworn enemy.<br/><br/>In the West Bank Continent, summoners are one of the more mainstream professions.<br/><br/>The creatures that these human summoners can capture and enslave are not just magical beasts. Many intelligent beings have also become the victims.<br/><br/>What’s worse, from some time ago, summoners have started capturing elves. Owning an elf as a summoning beast has become a show of status.<br/><br/>As part of the Elf Clan, they have an intense hatred for summoners.<br/><br/>This is why she held such hostility towards Gu Yang on the sea when she mistakenly thought he was a summoner.<br/><br/>In her eyes, summoners, those evil existences that enslave other creatures, should all die and not exist in this world.<br/><br/>Just now, that summoner’s words were clearly insinuating that he wanted to make them his summoning beasts.<br/><br/>Eve exploded on the spot.<br/><br/>Had it not been for the fact that she knew their mission to the Divine State was to find a piece of the Elf Mother Tree – critically important to the Elf Clan – could she have tolerated it till now?<br/><br/>Several decades ago, the Mother Tree began to wither due to an inexplicable force. From then on, there were no new elves born.<br/><br/>This, for the elf clan, was a calamity of extinction.<br/><br/>While elves are immortal beings, their current lifespan is only about three to four hundred years.<br/><br/>At this rate, in a hundred or so years, the number of elves would halve.<br/><br/>After four hundred years, when the last elf passes away, the Elf Clan would disappear altogether from the world.<br/><br/>The Elf Clan leaders did everything they could to avert this extinction crisis.<br/><br/>In their attempts to heal the Mother Tree, the elves came up with countless methods, all to no avail. At the moment, they could only slow the rate of its withering.<br/><br/>Until a year ago, the High Priest led all the elves in a grand ceremony, praying to the Moon God. This was their last resort, as the Moon God had not responded to the prayers of believers for ten thousand years.<br/><br/>To their surprise, the Moon God did give a divine prophecy. There was a realm in a place called Ningzhou in the far east. There was a piece of the Elf Mother Tree there. With it, the Mother Tree could be fully healed.<br/><br/>The jade seal was obtained from the royal family in some country based on the prophecy of the Moon God.<br/><br/>Moreover, the prophecy indicated Eve as the key to this journey, and the ability to retrieve the item depended on her.<br/><br/>After deliberation, the elf leaders sent Gress, the tribe’s only legendary second-grade mage, and Eve to the Divine State.<br/><br/>Among the leaders of the Elf Clan, the Elf Queen needed to guard the Misty Forest to prevent being sneak attacked by enemies.<br/><br/>The High Priest’s strength would plummet dramatically once he left the God-graced West Bank Continent.<br/><br/>In the end, Gress seemed to be the most suitable choice.<br/><br/>Furthermore, the mysterious continent in the east was filled with formidable figures. They couldn’t act conspicuously or in large numbers.<br/><br/>On the other hand, too many of the Elf Clan’s legends leaving would also draw the attention of enemies.<br/><br/>Therefore, in the end, only the two of them were dispatched for this mission.<br/><br/>Whether it was Gress or Eve, both knew they bore the sacred mission of reviving the Elf Mother Tree and were prepared to sacrifice everything.<br/><br/>“Eve, you are the princess of the Elf Clan, the future queen. It’s time to shoulder this responsibility. You can’t be capricious like before. You must obey Gress’s orders on this journey.”<br/><br/>“Remember, whether the Elf Clan can continue to exist, depends on you. You must retrieve that item, no matter the cost!”<br/><br/>The words her mother told her before their departure echoed again in Eve’s ear.<br/><br/>She remembered the prophecy of the Moon God, stating that the key to obtaining the holy relic was with her.<br/><br/>In an instant, a jolting thunderbolt ripped through her mind.<br/><br/>With a bang.<br/><br/>Her face turned deathly pale, her head pulsating with an explosive sound.<br/><br/>Could it be —— the Mother Goddess had foreseen today?<br/><br/>“You are the future queen…”<br/><br/>“The survival of the Elf Clan hinges on you…”<br/><br/>The gradually withering Mother Tree…<br/><br/>For the future of the Elf Clan, her mother had been racking her brain…<br/><br/>Eventually, on the day of the sacrifice, a miracle appeared in the sky along with an oracle from the Moon God.<br/><br/>All these brewed into the promise she made to her mother before setting out, “Even at the cost of everything, I will bring back that sacred object to revive the Mother Tree!”<br/><br/>Now, that sacred object fell into the hands of an evil summoner, who is too formidable. Even with Gress, she can’t possibly win against him.<br/><br/>But then, he made that requirement…<br/><br/>At this moment, Eve finally realized why her name was mentioned in the oracle.<br/><br/>Turns out she needed to make such a sacrifice.<br/><br/>Eve’s heart trembled.<br/><br/>She knew clearly what fate awaited her after becoming a summoner’s pet. Losing her freedom, dignity and humanity, turning into someone’s tool and toy and forever unable to escape such a destiny.<br/><br/>It was a hundred times more terrifying than death.<br/><br/>Suddenly, Eve opened her eyes. In her eyes was only solemnity and resolution. She slowly spoke, “I, Eve Arthurlyn Moonlight, swear in the name of the Moon God, as long as he returns the trunk of the Mother Tree to the Elf Clan. I willingly sign the Master-Servant Pact with him——”<br/><br/>Upon hearing her full name, Gress who was at the side, her face suddenly changed. She already guessed what Eve was going to do, and reached out her hand trying to stop her.<br/><br/>However, thinking of the gradually withering Mother Tree, her hand felt as though it weighed a thousand pounds, it stopped midway and trembled violently.<br/><br/>On one side was the future of the Elf Clan.<br/><br/>On the other side, it was Eve’s miserable future.<br/><br/>No matter which one she chose, she was doomed to regret for her whole life.<br/><br/>“Princess”<br/><br/>She closed her eyes in pain, her hand just couldn’t reach.<br/><br/>With Eve’s words, the mark on her forehead lit up again, spreading out a strange ripple.<br/><br/>become his servant, never to betray him in this life, witnessed by the Moon God.”<br/><br/>After saying the last sentence, the mark on her forehead seemed to fly out, converting into a moon. The soft light fell on Gu Yang’s body.<br/><br/>Suddenly, he felt an invisible power in the dark, tying something to his Original Spirit.<br/><br/>“What the hell?”<br/><br/>Gu Yang was dumbfounded.<br/><br/>Master-Servant Pact?<br/><br/>What on earth is she trying to pull?<br/><br/>Just a moment ago, she was shouting and rushing to kill him and bore a deep grudge against him, wishing he were dead.<br/><br/>Then suddenly she traded the grudge with a tragic face, swearing in the name of the god and saying she would sign a Master-Servant Pact with him.<br/><br/>Wait, when did I say I want to sign a Master-Servant Pact with you?<br/><br/>I was talking about the Nine States Seal.<br/><br/>Damn it!<br/><br/>What kind of godly understanding is this?<br/><br/>This is really beyond absurd, absurdness has really taken the cake!<br/><br/>“You sly woman.”<br/><br/>Before Gu Yang could say anything, Cao Yiyi, who was standing at the side, had already burst out in rage, “You are so shameless, you even agreed to be a servant to seduce him. You, an alien woman, are really shameless and cheap, some princess you are, get lost…”<br/><br/>PS: This is the first update of the day, it’s also double vote ticket month again, kindly seeking your vote as support.\t\t\t\t\t\t</div>", "images": {}, "success": true}