{"id": 301, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132203.html", "title": "Chapter 301 - Chapter 301: Pulling The Whistle When The Wind Is Strong At 301", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 301 - Chapter 301: Pulling The Whistle When The Wind Is Strong At 301</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 301: Pulling the whistle when the wind is strong at 301<br/><br/>“Uh”<br/><br/>Gu Yang covered Cao Yiyi’s mouth with his mana, preventing her from continuing.<br/><br/>Otherwise, who knows what kind of unpleasant things she might say.<br/><br/>Although he found the thought process of these two elf women too bizarre, the situation had already progressed so far. He shouldn’t upset them and drive them away.<br/><br/>He strongly suspected that if he let Cao Yiyi keep talking, it was possible to completely break their defenses.<br/><br/>If they leave, it would be quite troublesome to travel all the way back to the West Bank Continent and retrieve that Seal of Nine States.<br/><br/>Better to calm them down first.<br/><br/>Fearing them, Gu Yang didn’t beat around the bush, and directly said, “I want this.”<br/><br/>He took out a seal and said, “I know, you guys have something exactly like this. I’ll trade it for the Extreme Sun Nail, along with what you just stated.”<br/><br/>Gress was surprised to see the jade seal in his hand.<br/><br/>Honestly, she hadn’t thought of this. To her, this was just a “key” for entering and leaving this plane.<br/><br/>Other than that, she couldn’t see its use.<br/><br/>She had never dreamed that what the other party wanted was this.<br/><br/>Having had more dealings with humans, she vaguely sensed from Gu Yang’s response, it was likely that the two of them had misunderstood.<br/><br/>Could it be that he didn’t mean what they thought?<br/><br/>As soon as this thought arose, Gress felt a chill in her heart; she didn’t dare to think any further.<br/><br/>If this were true, then what was Eve’s sacrifice for?<br/><br/>A joke?<br/><br/>She cast this dreadful thought out of her mind and hurriedly took out the seal, “You’re talking about this?”<br/><br/>“Correct.”<br/><br/>“This is the key to entering and exiting this plane, if we give it to you, how will we leave here?”<br/><br/>“I will escort you out.”<br/><br/>“You must sign a pact with me.”<br/><br/>Gress said as she took out a scroll, a Pact of Contracts obtained from the Church of Commerce, witnessed by the God of Money, it was sufficient to restrain a legendary powerhouse.<br/><br/>This fellow does have a lot of odds and ends.<br/><br/>Gu Yang asked, “How do we make the pact?”<br/><br/>Gress explained the terms of the contract. After listening, he found no loopholes and was curious about the restraining power of a West Bank Continent contract.<br/><br/>The woman who just called herself Eve showed it once and it was indeed quite magical. It was a force he couldn’t understand for now.<br/><br/>Surely enough, the two quickly established the contract.<br/><br/>As soon as the contract was established, the scroll ignited with a fizz.<br/><br/>Immediately, Gu Yang felt an odd force, ignoring his mortal body and mana, swirling around his Original Spirit.<br/><br/>“This seems a bit similar to the force just now, but completely different.”<br/><br/>He thought to himself while exchanging items with the other party.<br/><br/>The seventh Seal of Nine States was finally in his possession.<br/><br/>The Gao family still had one piece. Gao Fan said he’d help him retrieve it, but it’s been a while and there’s still no news. He didn’t know if an accident had occurred.<br/><br/>As for the last piece, he had no clue where it was.<br/><br/>To achieve the Celestial Being realm with “Phoenix Dance Nine Heavens” seemed hopeless.<br/><br/>What he could rely on now was the “Nine Heavens Divine Method,” advancing the nine incarnations to the ninth level, or even possibly the Hollow Void realm.<br/><br/>Therefore, he must assemble all nine Seals of Nine States.<br/><br/>In addition to the Seals of Nine States, there were several artifacts from the West Bank Continent. These artifacts, unlike the unparalleled divine weapons here, often contained power similar to rules.<br/><br/>Like that Sword of Kru, as long as it hurt someone, even if it only scratched a bit of their skin, they would be severely injured.<br/><br/>However, these artifacts all had usage restrictions, like only being able to use them once per day or something similar.<br/><br/>In certain situations, such artifacts could play a special role.<br/><br/>When the trade was completed, Gu Yang felt the two marks in his Original Spirit simultaneously ignited, and a peculiar force surged in.<br/><br/>The mark on the forehead of that elf girl called Eve brightened and shot a beam of light into his forehead.<br/><br/>A moment later, a faint circular mark appeared on his forehead as well.<br/><br/>The previously off-white mark on Eve’s forehead turned crimson red.<br/><br/>At the same time, something seemed to have exploded in Gu Yang’s mind, as if something were added to his Original Spirit.<br/><br/>He looked at the slender, exotic-looking girl standing in front of him, her tender skin was so white it dazzled the eyes.<br/><br/>A sudden realisation crossed his mind: he had complete control over her. With a single thought, he could take her life or make her wish she was dead.<br/><br/>Is this the Master-Servant Pact?<br/><br/>It’s too domineering!<br/><br/>Gu Yang was somewhat shocked.<br/><br/>The people of the West Bank Continent really know how to play, they’ve actually developed such magic.<br/><br/>He suddenly changed his mind: having an elf whose life and death you can control at your side is not a bad idea, and she could be quite useful.<br/><br/>From her, he could also learn more about the West Bank Continent.<br/><br/>He didn’t forget about the imminent arrival of the Immortal Palace in this world. When that happens, he could go to the West Bank Continent to hide for a while.<br/><br/>The feeling that the two contracts just gave him was that the gods on the other side were quite strong and might be able to resist the fighters from the Immortal Palace.<br/><br/>At this moment, Gu Yang suddenly felt an alarm in his heart and said, “Go.”<br/><br/>Picking up the seal of Ningwang he had just obtained, he quickly refined it, opened a Spatial Gate, and left this world with them.<br/><br/>As soon as they left, a figure appeared out of nowhere, looking at where Gu Yang had disappeared, murmured, “Xia Emperor?”<br/><br/>A moment later, he left as well.<br/><br/>Everything returned to calm, just as if nothing had happened at all.<br/><br/>Ningzhou, Kun Mountain.<br/><br/>Three figures appeared outside a mansion.<br/><br/>A tiny green bird sat on the shoulder of a woman, speaking in a sharp voice, “Our master’s breath disappeared over there.”<br/><br/>These three people were Xi Huang, Su Qingzhen, and the witch Lily from the West Bank Continent.<br/><br/>Not long ago, they came out of the Secret Realm in Zhushan. The first thing they did was look for traces of Gu Yang.<br/><br/>After bathing in the Moonlight Pond in the Secret Realm, the Little Green Bird had regained some strength, and could trace Gu Yang’s breath all the way here.<br/><br/>Xi Huang looked serious, “There is a very powerful person inside.”<br/><br/>Hearing this, Su Qingzhen’s heart tightened, and she anxiously said, “Will he be in trouble?”<br/><br/>Lily, dressed in a black robe, clenched her fists, speaking in her still broken Great Zhou language, “He, will, be, fine!”<br/><br/>The green bird said proudly, “Don’t worry, in this world, no one can kill the master!”<br/><br/>“Get moving.”<br/><br/>Suddenly, Xi Huang’s face changed, and she was about to escape with the two women nearby.<br/><br/>Suddenly, a terrifying pressure overwhelmed her, pressing her to the ground, making her unable to move for a time.<br/><br/>Both Su Qingzhen and Lily were even worse off, completely unable to move.<br/><br/>Both of them had also entered the Divine Power realm.<br/><br/>One of them held an ultimate divine weapon, the other had awakened several strange magics.<br/><br/>But against absolute power, neither was any help.<br/><br/>“Hold on tight, it’s a rough ride!”<br/><br/>Only the Little Green Bird ignored that mana and flew away, disappearing into the clouds in the blink of an eye.<br/><br/>A towering figure descended from the sky, a black spear in his hand, looking like a war god and exerting tremendous pressure.<br/><br/>Staring at the direction where the green bird had vanished, a trace of wariness flashed in his eyes.<br/><br/>That bird was actually able to completely ignore his magic cage and lock-on, definitely not a normal bird.<br/><br/>The man was Cao Kunpeng. He turned his head and stared at the three women, saying coldly, “You have a lot of nerve! Speak up, who sent you here?”<br/><br/>All three of them seemed a bit pale, but none of them made a sound.<br/><br/>At this point, Cao Kunpeng’s maid, Ru Qin, also came out. Seeing the three women present, she said, “She is Su Qingzhen, Gu Yang’s woman.”<br/><br/>“Hahaha…”<br/><br/>Cao Kunpeng laughed heartily, but his eyes became icy cold, “Gu Yang’s woman? That’s perfect.”\t\t\t\t\t\t</div>", "images": {}, "success": true}