{"id": 304, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132208.html", "title": "Chapter 304 - Chapter 304: Don’T Eat Me, 304", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 304 - Chapter 304: Don’T Eat Me, 304</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 304: Don’t eat me, 304<br/><br/>“Let’s go, we can’t stay here for long,”<br/><br/>Gu Yang made no room for discussion. With a sweeping gesture of his large sleeve, he lifted them with his magic and flew away from the location.<br/><br/>He wouldn’t want Cao Jing to summon his master. With so many burdens, it would be impossible to engage in a fight.<br/><br/>The women around him held different emotions.<br/><br/>Su Qingzhen was the first to follow Gu Yang, hence, she knew him the most. She knew he wasn’t a flirt, rather, those shameless women forced themselves on him.<br/><br/>Last month, after Pei Qianlan and Xu Ruomei left the Secret Realm, a woman and a bird mysteriously appeared.<br/><br/>The woman claimed that Gu Yang was her father.<br/><br/>And the bird, who can talk, claimed him as its master.<br/><br/>This was outrageous. It took her a while to digest the explosive news.<br/><br/>From the talkative little green bird, she heard many stories of Gu Yang’s romantic encounters: Princess Chang, the queen’s sister, even the queen herself… which caused a great deal of anxiety in her.<br/><br/>Though Gu Yang was a genuine gentleman, who has always been courteous to her and other women around him, his too good a heart made him unable to refuse advances.<br/><br/>Ling Ling was like that, so was Xu Ruomei and Gu Xiyue, at least to some degree. Later, it was Lily, Han Mengling, Pei Qianlan, and others who acted similarly.<br/><br/>Therefore, it wasn’t hard to figure out that the ones like Princess Chang, and the queen, must have launched their own advances as well.<br/><br/>And now, there were two unfamiliar women who had joined Gu Yang’s entourage.<br/><br/>One of them had a wicked expression and a dangerous glint in her eyes, clearly not easy to deal with.<br/><br/>The other’s skin was white like milk, with green pupils and pointed ears, clearly of a foreign race. Although she kept her head down, her air radiated a clear ‘keep away’ message.<br/><br/>These two women were going to be difficult to get along with.<br/><br/>Su Qingzhen couldn’t help but feel a pang of resentment. If this continues, where will it end?<br/><br/>She reluctantly accepted women like Ling Ling, Pei Qianlan. They knew their place and were bearable. But with these two new women, there would be troublous days ahead.<br/><br/>The sentiments of Ling Ling towards this situation diverged from Su Qingzhen.<br/><br/>In her heart, there were only two things: martial arts and Gu Yang. As for the women who emerged, she didn’t care as much.<br/><br/>She was present throughout the whole Gu Yang, Cao Yiyi, and the elven princess’s incident and knew these two women weren’t easy to deal with.<br/><br/>However, she wouldn’t interfere because she knew Gu Yang would handle it.<br/><br/>She maintained the most stable emotions among the group.<br/><br/>“Perhaps my father is too affectionate,”<br/><br/>Xi Huang looked troubled. She was aware that her father was an alluring man with a reputation for attracting women everywhere he went. In Divine City, there were Ye Lingbo, Princess Chang, and Su Ningyan.<br/><br/>In the Secret Realm, she met two more. From Su Qingzhen, she learned about two others.<br/><br/>Now, just after a little over a month, two more women showed up.<br/><br/>If this pace continues, she’ll soon have more than ten “aunts”.<br/><br/>Although she understood that she had no right to interfere with her father’s actions, she couldn’t help feeling resentment.<br/><br/>These women were much younger than her, yet they ended up as her elders. She couldn’t avoid calling them aunt.<br/><br/>She could hardly keep up with so many aunts.<br/><br/>“The Saint is amazing, he even managed to make the elven princess his slave!”<br/><br/>Lily was the most excited. Before coming east, she had visited the Misty Forest with her mentor and had met the elven queen and Eve.<br/><br/>Now holding a high-ranking title, she recognized the faint mark on Gu’s forehead at once. Comparing it to the elven princess’s mark, she knew they had formed a master-servant pact.<br/><br/>She admired him deeply.<br/><br/>That was a princess and future queen of the elves.<br/><br/>Every elven queen is among the top powerhouses in the West Bank Continent, including some at the half-god level.<br/><br/>Before now, no member of the elven royalty had ever signed a master-servant pact with a human.<br/><br/>Elves, proud as they are, would rather die than yield.<br/><br/>Yet the Saint accomplished it!<br/><br/>No wonder he’s the Saint.<br/><br/>Eve was like a walking corpse, with no inkling of life in her eyes. She allowed Gu Yang to lead her around.<br/><br/>From the moment she became a human’s slave, she felt like her soul had died, leaving behind an empty shell.<br/><br/>She could care less about who was around the human, or what kind of danger he faced.<br/><br/>Her only concern was whether Gress could deliver the sacred object back to the Misty Forest.<br/><br/>If that sacred object could save the mother tree.<br/><br/>The only outsider was Gress who trailed behind at a distance. She had no thought of leaving, partly because Eve deserved her sympathy and partly because she found Lily.<br/><br/>When she first spotted this golden-haired, clear-eyed witch, she was taken aback.<br/><br/>She had met this woman before.<br/><br/>About five years ago, the elven queen invited a legendary witch who bore the Eye of the Phoenix to help heal the mother tree.<br/><br/>The young girl who attended the legendary witch then is the same woman she sees now.<br/><br/>After five years, she stumbled into her in the Divine State. This aroused her suspicion.<br/><br/>What brought a member of the Eye of the Phoenix to the Divine State?<br/><br/>And how could it be mere coincidence that she’s also in the company of that man?<br/><br/>What exactly was her relationship with him?<br/><br/>Gress was filled with questions.<br/><br/>“Master, now that you’ve finally condensed your true form, why do you still keep the appearance of a human?”<br/><br/>“Master, your true form is so beautiful, you should show it to everyone.”<br/><br/>“Master, you can’t disregard our monster pride because of these beautiful women…”<br/><br/>The Little Blue Bird kept chit-chatting in Gu Yang’s ear, which annoyed him greatly. He wanted to shut it up, but every time his magic touched it, it was absorbed by the bird.<br/><br/>This guy, somehow got stronger.<br/><br/>You think I can’t cure you yet?<br/><br/>From Gu Yang’s eyebrows sprung a golden light, and a hand reached out to grab the little blue bird. It was the Divine Ape.<br/><br/>“Have mercy, don’t eat me —”<br/><br/>While the little blue bird cried out in despair, the Divine Ape stuffed it into his mouth.<br/><br/>At last, the world was peaceful again.<br/><br/>Gu Yang quickened his speed once again. Shortly, Divine City was within sight.<br/><br/>Upon reaching the outskirts of Divine City, Gress, who had been always following, finally stopped. She felt the presence of a half-god and dared not come any closer.<br/><br/>“Please take care, princess.”<br/><br/>As she watched the figures disappear into the distance, a heavy mood descended upon her. Finally, she made up her mind, turned around, and began her journey back home.<br/><br/>Eve made such a huge sacrifice to acquire the sacred object, she couldn’t afford any mishap.<br/><br/>PS: A guest dropped by my house tonight, hence the delay. There’s one more chapter, which will come fairly late. You can check back tomorrow for updates.\t\t\t\t\t\t</div>", "images": {}, "success": true}