{"id": 303, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132206.html", "title": "Chapter 303 - Chapter 303: 303 Intelligence", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 303 - Chapter 303: 303 Intelligence</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 303: 303 Intelligence<br/><br/>[Gained fifty points of energy, current balance is six hundred and thirty-four points.]<br/><br/>After Gu Yang slew Cao Kunpeng with a single slash, he reached out and grabbed the black spear that was about to fly away.<br/><br/>[Energy source detected. Would you like to recharge?]<br/><br/>“Yes.”<br/><br/>This black spear was one of the world’s most famed eighteen divine weapons, the Astonishing God Spear.<br/><br/>Cao Kunpeng’s reputation as the Spear Saint relied entirely on this divine weapon.<br/><br/>Even among the divine weapons, there were different grades. In ancient times, these graded magical tools were known as Magic Treasures. Based on the strength of the Magic Treasure’s Primordial Spirit, they were divided from low to high into the grades of Ghost Spirit, True Form, Phantom God, and Pure Yang.<br/><br/>It was said that in ancient times, the differences in power between different grades of Magic Treasures were staggering.<br/><br/>However, after the Way of Heaven died, nearly all Magic Treasures have lost their Primordial Spirits and have only retained some spirituality.<br/><br/>Even the spiritual treasures no longer feel the presence of the Primordial Spirit.<br/><br/>The difference in power between different levels of Magic Treasures is not as great anymore. The strength of the power that can be exerted depends mainly on the strength of the owner.<br/><br/>For example, the Phoenix Feather Knife, which is also a Magic Treasure, can probably increase his Mana by about 20 percent.<br/><br/>Don’t underestimate this 20 percent. With his current strength, this 20 percent increase is enough to elevate his abilities to another level.<br/><br/>Besides that, this divine weapon is extremely sharp and capable of breaking through shields.<br/><br/>The Phoenix Feather Knife played a significant role in him easily killing Cultivators in the Nascent Soul stage.<br/><br/>Because there is no presence of Primordial Spirits, it is difficult to judge the grades of the divine weapons.<br/><br/>However, being listed as one of the world’s most famous eighteen divine weapons, the grade of this Astonishing God Spear is certainly not low.<br/><br/>If it were any other divine weapon, Gu Yang would definitely be reluctant to use it for recharging.<br/><br/>But this Astonishing God Spear came from the Cao family and very likely was gifted by Chiming Heaven himself. How could he possibly keep it?<br/><br/>Who knows, one day someone might emerge from the Astonishing God Spear and stab him in the back.<br/><br/>[Recharge successful, gained two hundred energy points. Current balance is eight hundred and thirty-four points.]<br/><br/>Gu Yang was a little surprised. This spear was actually worth two hundred points, which was equivalent to the head of a second-layer Unleaking Realm person.<br/><br/>He remembered that when he was in the palace, he seized the God-Slaying Knife from the Wu Family, which was also a divine weapon. After recharging, he only received twenty energy points.<br/><br/>Now, this Astonishing God Spear could recharge two hundred points.<br/><br/>This disparity is too great.<br/><br/>“What a brilliant Nine Heavenly Strikes.”<br/><br/>Cao Jing’s short and thin body seemed even smaller in front of the Divine Ape. His voice was hoarse, revealing no traces of grief as though he didn’t care about the death of his clan member, Cao Kunpeng.<br/><br/>“Wu Shengtian really has good judgement.”<br/><br/>“With your current strength, no one in this world can handle you except for those two Celestial Beings and Qin Wu. Given your age, you are truly unprecedented since ancient times.”<br/><br/>There was a hint of awe in his tone, but he then changed the subject, “However, with your current strength, it is insufficient to confront the Four Great Sacred Lands. Neither your master nor that person from the Three Holy Gates will let you go.”<br/><br/>Gu Yang looked at him with interest and asked, “You’re saying all of this because you want me to spare you?”<br/><br/>Cao Jing lightly chuckled and said, “At our level, to fight over a bit of pride and resentment is unwise.”<br/><br/>“If you join forces with that foreigner, you might be able to kill me. But how many of the people here would have to die?”<br/><br/>“In fact, we can cooperate. If you want to deal with that person, I can provide you with some information.”<br/><br/>Seeing the sincere look on Cao Jing’s face, Gu Yang actually felt a bit of admiration. The future pillar of the clan died right in front of him, and he could still talk about cooperation with the murderer.<br/><br/>This man can be said to exemplify the concept of self-interest.<br/><br/>In comparison, Shen Yun had much more vitality.<br/><br/>However, he was right. If they really started fighting, he would focus on killing Su Qingzhen and the others. Gu Yang wasn’t sure if he could protect everyone.<br/><br/>Gu Yang asked, “What information?”<br/><br/>Cao Jing said, “You should already know about the Extreme Sun Nail. I’ll tell you another secret. In the past, my master was defeated by the ancient Divine Beast Taiyin Youying and had no choice but to merge with Chiming Heaven.”<br/><br/>“It was because of this that my master was able to escape the great catastrophe of the ancient times and survive till now. In contrast, the famous powerhouses of those ancient times have all vanished in history.”<br/><br/>“If you could cultivate the incarnation of Taiyin Youying, it would be enough to restrain your master.”<br/><br/>This was indeed a useful piece of information.<br/><br/>Originally, the importance of the incarnation of Taiyin Youying in Gu Yang’s ranking was fairly low, and in sequential order, it could only be last.<br/><br/>However, since Taiyin Youying could restrain that individual of Akimbo, it could be prioritized.<br/><br/>Gu Yang asked, “Doesn’t your master detect your dissidence?”<br/><br/>A strange smile floated on Cao Jing’s face, “I am loyal to my master, where is the dissidence?”<br/><br/>What an old cunning fox.<br/><br/>Gu Yang understood the meaning in his smile. As long as he didn’t think he was betraying that Akimbo man, that man wouldn’t notice anything unusual.<br/><br/>This is the highest realm of lying, deceiving oneself.<br/><br/>In his heart, he probably hypnotized himself no matter what he did, this was for his master.<br/><br/>As for whether this behavior would lead to adverse consequences, he deliberately ignored it.<br/><br/>That Akimbo man, even if he left some controlling means on him, couldn’t possibly monitor him all the time.<br/><br/>To be able to do this, this guy is really not ordinary.<br/><br/>Gu Yang shook his head and said, “This piece of information alone is not enough.”<br/><br/>Cao Jing wasn’t angry, and said, “If you want to deal with that Three Saints Sect man, you can cooperate with Shen Yun. He is a deep-minded man and has long wanted to get rid of the control of Three Saints Sect.”<br/><br/>“Shen Yun?”<br/><br/>Gu Yang said, “He has been killed by me.”<br/><br/>Upon hearing this, Cao Jing’s gaze slightly shrank, but after a moment, he slowly said, “Shen Yun is not a man who can be easily killed.”<br/><br/>The implication of his words was that he did not believe Gu Yang could kill Shen Yun.<br/><br/>Gu Yang looked at him, recalling that battle, the entire process, there was indeed no problem.<br/><br/>After killing Shen Yun, the system prompted to gain two hundred energy points, that surely meant he was dead beyond any doubt.<br/><br/>Cao Jing understood his thoughts and slowly said, “As I know, Shen Yun once got a spirit treasure, prepared to use against that Three Saints Sect man. Only I know this.”<br/><br/>Spirit treasure?<br/><br/>Gu Yang stared at him for a while.<br/><br/>That day, Shen Yun didn’t use the spirit treasure, and after he died, no spirit treasure was found on him.<br/><br/>Cao Jing seemed to have no reason to lie about this.<br/><br/>He could only put this matter aside for now and said, “Forget about the cooperation, in the near future, there will be those seeking revenge on you.”<br/><br/>He naturally meant Ling Ling. The Wu Family was extinguished, and the greatest contributors to this were undoubtedly Cao Jing and that Unleaking Realm man from the Gao Family.<br/><br/>When Ling Ling’s divine power is greatly successful, she will certainly take revenge on the murderers of that year.<br/><br/>Cao Jing smiled, his gaze swept over Ling Ling, and he calmly turned around and left.<br/><br/>With this man’s departure, Gu Yang suddenly felt that the atmosphere was somewhat wrong. Whether it was Ling Ling by his side, Cao Yiyi, Xi Huang, Su Qingzhen, Lily, they all stared at him with their straight eyes.<br/><br/>Only Eve, who had been made his slave, kept her head down all the time.<br/><br/>Not far away, there was also an outsider, Gress, her eyes only seeing Eve.<br/><br/>Reunion after a long time is quite a joy, they should be heartily talking over old times. However, when there are too many women, it seems inappropriate to do anything.<br/><br/>“Master, you are finally back, do you know how worried we’ve been about you.”<br/><br/>At this time, the Little Green Bird flew over from nowhere, chirping.<br/><br/>Gu Yang glanced at it, secretly admiring it in his heart. This guy was useful sometimes, breaking up the deadlock and saving him from the embarrassment.<br/><br/>He put on a straight face, “Where did you go when it was so dangerous just now?”<br/><br/>The Little Green Bird confidently said, “I went to the Divine City to get reinforcements, eh, this woman looks strange!”<br/><br/>Speaking of this, its voice became extremely shocked, “Master, you’re really getting heavier, even non-humans are now your targets?”\t\t\t\t\t\t</div>", "images": {}, "success": true}