{"id": 309, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132218.html", "title": "Chapter 309 - Chapter 309: 309 Secrets", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 309 - Chapter 309: 309 Secrets</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 309: 309 Secrets<br/><br/>Gu Yang asked, “What is the stance of the Blue Sky Palace?”<br/><br/>He was very curious about this matter. As one of the Four Great Sacred Lands, the Blue Sky Palace’s presence was far too muted.<br/><br/>From the awakening of the system till now, he had run countless simulations. Great Zhou had encountered numerous crises, yet he had never interacted with this power.<br/><br/>Setting aside the Three Holy Gates and Red Bright Heaven, he had even dealt with the equally quiet and mysterious Star Sea in his simulations, and not just once.<br/><br/>What was up with the Blue Sky Palace? Why did they seem so uninterested in Great Zhou?<br/><br/>Su Ningyan shook her head and said, “I am also unsure. Though my master accepted me as his disciple, I am currently just a nominal disciple. I have never been to the Blue Sky Palace. My master also seldom mentions it.”<br/><br/>Speaking of this, she paused, “If you really want to know, you might as well ask Chu Xiyue. Perhaps she knows more than I do.”<br/><br/>The Chu Family?<br/><br/>Gu Yang suddenly recalled, Wu Er had once mentioned that the Chu Family was a force fostered by the Blue Sky Palace.<br/><br/>He didn’t pursue the topic further and said, “Since you have prepared for the invasion of the barbarians, I’ll await your news. Inform me when it’s time to mobilize the army.”<br/><br/>With that, he left.<br/><br/>Su Ningyan watched his departing figure with a bittersweet gaze.<br/><br/>Ever since the Zhao Family annihilated the Wu Family eighteen years ago, Great Zhou had lost too many high-ranking warriors and its overall strength had drastically declined. Its control over its territories had also gotten progressively worse.<br/><br/>If it wasn’t for Luo Wang holding up, Great Zhou would have already collapsed under Zhao Yi’s character and abilities.<br/><br/>On the other hand, the Khan of the barbarians, who resided in the grasslands, had managed to develop his nation steadily with numerous talents arising within his tribe.<br/><br/>What was the worst, was that the Unleaking Realm warrior who had announced himself to be a God of War amongst the barbarians had truly reached the Celestial Being realm.<br/><br/>Thus, there were now two Celestial Beings amongst the barbarians.<br/><br/>For the first time since the Xia Dynasty, the top strength of the barbarians had surpassed Great Zhou’s.<br/><br/>The ambitious Khan would surely strike when this sort of opportunity arises.<br/><br/>An invasion was bound to happen soon.<br/><br/>She had been preparing for the barbarians for years already and made quite some preparations.<br/><br/>However, presently, the royal family’s most vulnerable time, there are only two individuals in the Unleaking Realm capable of commanding. Yet, they could only guard the imperial palace and were unable to leave.<br/><br/>There were quite a few in the Mana realm in the military, however, adding in the Lord of the State, their overall strength was still too weak.<br/><br/>One has to remember, there are two Unleaking Realm powerhouses under the Khan’s command, and nearly ten in the Mana realm.<br/><br/>If comparing regular strengths, Great Zhou is indeed at a disadvantage.<br/><br/>Initially, with Luo Wang holding fort, the Khan wouldn’t dare be too audacious.<br/><br/>However, it’s different now. There are two Celestial Beings amongst the barbarians, and if they made their move, they’d be able to hold off Luo Wang.<br/><br/>Thus, everything would depend on the two Celestial Beings behind the barbarians.<br/><br/>For that, Su Ningyan had particularly consulted her master.<br/><br/>Back then, her master said, “If there’s an opportunity, they’ll surely kill your two Celestial Beings. Likewise, the reverse is also true.”<br/><br/>“Why?”<br/><br/>“It’s a dispute of the Great Dao.”<br/><br/>A dispute of the Great Dao?<br/><br/>Su Ningyan wanted to ask more, but her master remained silent.<br/><br/>This was the worst-case scenario.<br/><br/>If the two Celestial Beings of the barbarians acted, Luo Wang and the Dean of the Academy would be held up.<br/><br/>Then, the weaker Great Zhou would undoubtedly be defeated.<br/><br/>The last strength of the imperial court would also be wiped out. The situation would become like the Qin Dynasty five hundred years ago, no longer able to suppress the world, and the demise of the royal dynasty was imminent.<br/><br/>A change in the dynasty was too trifling. The most terrifying scenario would be if Luo Wang and the Dean of the Academy also lost. At that time, Divine State would sink, and the hundreds of millions of common people would face the butchers’ knives of the barbarians.<br/><br/>This was not an impossibility. The Red Bright Heaven had always wanted to stir up a massacre in Divine State. It was very likely they would cooperate with the two Celestial Beings of the barbarians.<br/><br/>Su Ningyan felt she was in a damaged boat in a storm, facing dangers at every turn and on the verge of capsizing.<br/><br/>Gu Yang’s self-proclamation gave her a bit more confidence.<br/><br/>Not long ago, she received detail information about Gu Yang’s battle with the Red Sun at the Endless Mountains.<br/><br/>The internal security also had spies in the Red Venerate’s teachings.<br/><br/>Gu Yang’s current strength was comparable to the Unleaking Realm.<br/><br/>With him, even if they lose the battle with the barbarians, they wouldn’t lose too badly.<br/><br/>However, that was too dangerous.<br/><br/>How was he, alone, supposed to oppose the two Unleaking Realm powerhouses of the other party? He was merely at the Mana realm after all.<br/><br/>If possible, she really didn’t want Gu Yang to take this risk.<br/><br/>…<br/><br/>Gu Yang left the palace, contemplating his next move.<br/><br/>Now, the only real threat to him was the Celestial Being.<br/><br/>His main enemies recently were three: Saint Chao Yang, the one from the Red Venerate, and a Celestial Being from the Barbarians.<br/><br/>The host of the Red Mansion had offered to help him evade Saint Chao Yang’s pursuit.<br/><br/>The one from the Red Venerate seemed to have given up chasing him recently.<br/><br/>As for the celestial being of the Barbarians, it would be more than two months before he encountered them.<br/><br/>With this, he had a safety period of one to two months.<br/><br/>Just in time, he could take this opportunity to enhance his strength as much as possible.<br/><br/>He still had no clue about the Unleaking Realm, but that didn’t mean he had no means to improve his strength.<br/><br/>Upon returning to the academy, Gu Yang went to the courtyard where he lived and opened the system.<br/><br/>[At 22 years old, you have reached the Mana Triple Sky, topping the Grandmaster ranking.]<br/><br/>[You sneak to Jingzhou alone, arriving in the Ruiqin Continent through a seafaring teleportation array.]<br/><br/>[Three months later, you reach Hell Valley, the southernmost point of the continent, in search of the Undying Emperor.]<br/><br/>[You capture the Undying Emperor alive, extracting two drops of phoenix essence blood from its vitals. Afterwards, you wander around, meeting several powerful Beastmasters…]<br/><br/>[Seven years later, a powerful being from the Immortal Palace comes to the Ruiqin Continent, taking over most of the continent in just one month.]<br/><br/>[You follow the remaining Beastmasters, retreating to the Beast God Temple.]<br/><br/>[A year later, the powerful being from the Immortal Palace launches the final battle. The Beast God Temple is captured, and you escape to the forbidden land of the back palace, where you find a giant Black Tortoise shell.]<br/><br/>[Soon, the powerful being from the Immortal Palace pursues and kills you. You die at the age of thirty-one.]<br/><br/>There’s a Black Tortoise shell at the back of the Beast God Temple?<br/><br/>Gu Yang was stunned.<br/><br/>Didn’t the mysterious person under the palace say that the Black Tortoise shell was in Demon God Valley in Penglai Heaven?<br/><br/>Wait a minute…<br/><br/>Suddenly, a lightning bolt struck in his mind.<br/><br/>That is to say, the Ruiqin Continent is Penglai Heaven.<br/><br/>The Beast God Temple is the Demon God Valley!<br/><br/>What the hell!<br/><br/>That was the case.<br/><br/>This was completely beyond his expectation.<br/><br/>Wasn’t it said that Penglai Heaven was the kingdom of the Monster Race? How did it end up being enslaved by humans?<br/><br/>The Monster Race is really too miserable.<br/><br/>Who would have thought that in this kingdom of the Monster Race, there would be a profession like Beastmaster that specializes in dealing with monster beasts.<br/><br/>This was even more outrageous than those warriors who practiced with the monster dan and essence blood of monster beasts during the Xia Dynasty.<br/><br/>[Simulation over, you can keep one of the following items.]<br/><br/>[1. Your martial arts realm at the age of thirty-one.]<br/><br/>[2. Your martial arts experience at the age of thirty-one.]<br/><br/>[3. Your life wisdom at the age of thirty-one.]<br/><br/>“I choose the first one.”<br/><br/>This time, Gu Yang’s mana barely increased. Instead, the beast-taming space in his mind progressed.<br/><br/>The Beast God Temple was truly a sacred place for Beastmasters. Just by staying there for a year, one could make great progress.<br/><br/>“Again.”<br/><br/>Gu Yang activated the simulator once again.<br/><br/>“Nine Heavens Divine Method,” an additional Unleaking monster beast would not significantly enhance his strength.<br/><br/>Better to upgrade the level of the Beastmaster.<br/><br/>His current ranking is top-rated grandmaster, equivalent to Triple Sky Mana.<br/><br/>With just one more step, he can become a legendary Beastmaster, equivalent to the Unleaking Realm. By then, he can go to the Ruiqin Continent, capture an Unleaking monster beast, and sign a contract. Then he will possess the power of the Unleaking Realm.<br/><br/>Besides, he can also use some magic to enhance the combat power of his pets by a few degrees.<br/><br/>This would provide a greater boost to his power.<br/><br/>At this moment, his remaining balance was 714 points, sufficient for seventeen simulations. It should not be a problem to upgrade the Beastmaster level to legendary.<br/><br/>[At 22 years old, you have reached the Mana Triple Sky…]<br/><br/>[…]\t\t\t\t\t\t</div>", "images": {}, "success": true}