{"id": 306, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132212.html", "title": "Chapter 306 - Chapter 306: 306 Red Mansion Master", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 306 - Chapter 306: 306 Red Mansion Master</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 306: 306 Red Mansion Master<br/><br/>Gu Yang knew of the Red Mansion’s rule: To become a patrol envoy of the Red Mansion, one must sever ties with the past. Regardless of any past feuds or grudges, they must be cut off completely.<br/><br/>Of course, the Red Mansion didn’t accept just anyone. Those who were utterly evil would be turned away at the door.<br/><br/>Typically, factions and sects would afford the Red Mansion some respect. They would no longer pursue feuds.<br/><br/>The Red Mansion was an extremely special force. With a few lists, it stirred up storms under the sky.<br/><br/>It was no exaggeration to say that over half of the strife in the Great Zhou was due to these lists.<br/><br/>In addition, the Red Mansion’s lists avoided the imperial family and the court, which caused people to suspect that this force was the lapdog of the imperial family. Its purpose was to stir up conflicts between the major factions.<br/><br/>However, Su Ningyan had told him that the court was entirely unable to control the Red Mansion.<br/><br/>The imperial family and the court ministers not being listed was a pact established between the first emperor of the Great Zhou and the Red Mansion.<br/><br/>The owner of the Red Mansion never meddled in the affairs of the imperial family and the court.<br/><br/>Now, even one from the Shen Family was hiding in the Red Mansion. Did this imply that even a power like the Shen Family was greatly wary of the Red Mansion?<br/><br/>The old man in front of him, his cultivation level wouldn’t be weaker than Shen Zhou’s mana triple heaven stage.<br/><br/>It was likely, like Wu Er and Gao Fan, those who didn’t wish to become a pawn of the Three Saint faction, hence, they left their family’s power.<br/><br/>As Gu Yang pondered this, he quietly opened the system and performed a simulation.<br/><br/>“At twenty-two, you are already at Mana Triple Heaven. You lead a group of women to Divine City.”<br/><br/>“You receive the invitation of the owner of the Red Mansion and go to discuss matters at the Red Mansion.”<br/><br/>“After leaving the Red Mansion, you and Ye Lingbo head to the secluded moon. Soon, you are pursued and attacked by several Nascent Soul experts from the Ancient River Sword Sect. You release two divine beast incarnations and kill all the Nascent Soul experts of the Ancient River Sword Sect.”<br/><br/>“Subsequently, a deity level expert arrives. At the critical moment, another deity level expert appears, blocking that person. You take the opportunity to flee.”<br/><br/>“You and Ye Lingbo escape to the Sky Ruins, going through numerous hardships until you find a Space Fragment that houses the corpse of the divine beast, Candle Dragon. You extract three drops of essence blood from the corpse and spend over a month refining it.”<br/><br/>“You leave the Sky Ruins and return to Divine City. The next day, Saint Chaoyang appears in the academy and confronts you.”<br/><br/>“Suddenly, two Celestial Beings descend, and Saint Chaoyang treats them as great enemies.”<br/><br/>“They deliver two invitations to Saint Chaoyang, inviting her to the Yaochi Conference. They also give an invitation to the principal of the academy. Then, they leave.”<br/><br/>“Saint Chaoyang immediately takes action and captures you. You are completely outmatched and the divine ape incarnation is killed in battle while the phoenix incarnation is captured.”<br/><br/>“Six months later, you die of exhaustion at the age of twenty-three.”<br/><br/>He is relieved, this trip to the Red Mansion does not appear to be dangerous.<br/><br/>Unfortunately, he cannot glean the reason for his invitation from this simulation.<br/><br/>However, there are unexpected benefits.<br/><br/>Two Celestial Beings descend upon Divine City and deliver invitations to Saint Chaoyang and the Principal of the Academy, inviting them to what seems to be the Yaochi Conference.<br/><br/>The first thing Gu Yang thinks about is the Yaochi Immortal Palace, one of the legendary Three Immortal Palaces.<br/><br/>This suggests that the mysterious faction that appears not long after might very well be the Yaochi Immortal Palace.<br/><br/>However, what are their motives for inviting Saint Chaoyang and the Principal to the Yaochi Conference?<br/><br/>While Gu Yang was pondering, they arrived at the Red Mansion.<br/><br/>The Red Mansion is located in between the academy of literature and martial academy.<br/><br/>Or rather, when the first emperor of the Great Zhou established the two academies, he specifically chose sites on both ends of the Red Mansion.<br/><br/>This inconspicuous building merely took up roughly a field’s area, enclosed by red brick walls. Inside was a courtyard, followed by a pavilion.<br/><br/>The elderly Shen led the way to the front of the pavilion, saying, “Please, this way.”<br/><br/>Gu Yang looked at this unassuming pavilion.<br/><br/>This was a power that had witnessed the rise and fall of three dynasties over more than a thousand years. Perhaps, it was the oldest faction that had been passed down since the Xia Dynasty.<br/><br/>This group’s work was the most offensive of all.<br/><br/>The Beauty List alone had caused numerous deaths, leading to countless families being ruined.<br/><br/>Like Su Qingzhen, the person she hated most, aside from the Liu family, was the Red Mansion.<br/><br/>If it weren’t for the Red Mansion ranking her on the Beauty List, the Liu family wouldn’t have targeted her, and her parents wouldn’t have died. If one day, she had enough power, her first order of business would be to topple the Red Mansion.<br/><br/>Over a thousand years, there were many like Su Qingzhen who reluctantly fell victim to the beauty list, and countless others who sought to bring down the Red Mansion.<br/><br/>Yet, this unassuming Red Mansion has always stood firm.<br/><br/>This says something about the strength of its master.<br/><br/>As soon as Gu Yang entered the loft, he was met by a little girl of about ten years old, beautifully delicate looking.<br/><br/>With her glossy eyes trained on him, she expressed disappointment, “So, you are Gu Yang? The world’s most handsome man looks like you?”<br/><br/>This was the first time Gu Yang had been addressed so directly with this title. Despite his thick skin, he felt a tad embarrassed. At least it was just a little girl.<br/><br/>He replied, “I am here to meet the master of this place.”<br/><br/>“Follow me then.” The little girl turned and started walking further in, but after a few steps, she spun around, her curiosity piqued, “Are you really a reincarnation of an ancient great power?”<br/><br/>Just like a child, her emotions changed rapidly. He wasn’t sure how she was related to the master of the Red Mansion.<br/><br/>Exactly who resides inside the Red Mansion remained largely unknown.<br/><br/>The number of people with the qualifications to enter were few, and of those, most were unwilling to come here.<br/><br/>Even Su Ningyan admitted that she had been afraid to visit the Red Mansion before, fearing that her secrets would be seen through by the mansion’s host.<br/><br/>Gu Yang had similar concerns. Accordingly, he conducted a simulation to ensure no danger was present before coming over.<br/><br/>He responded, “No.”<br/><br/>“Then, how could your cultivation speed be so fast?” The little girl asked earnestly, her eyes filled with a burning desire to know.<br/><br/>At that moment, they reached the grand hall.<br/><br/>Upon seeing the man in white sitting inside, Gu Yang immediately knew that this must be the master of the Red Mansion.<br/><br/>From a different perspective, the man was devoid of any visible energy, as if there was no one before him at all.<br/><br/>This was the first time he had experienced such a thing.<br/><br/>“Secret.”<br/><br/>He said to the little girl, stepped into the hall and greeted, “Greetings, senior.”<br/><br/>Behind him, the little girl pulled a face at his retreating figure, disappointed with his answer. She then closed the door and left.<br/><br/>Although quite audacious, she dared not eavesdrop here.<br/><br/>Because she knew she wouldn’t be able to hide it from the master inside.<br/><br/>“You’re not from the Great Zhou.”<br/><br/>The man in white raised from his seat, appearing quite young with an equally youthful voice, his features bland, almost indistinguishable in a crowd.<br/><br/>Eyeing Gu Yang, he asked, “What are your intentions in the Great Zhou?”<br/><br/>Luckily, he didn’t reveal knowing about Gu Yang’s otherworldly origin.<br/><br/>Gu Yang felt relieved, realizing that the host of the Red Mansion didn’t know everything.<br/><br/>He replied, “I just want to survive and find my way home.”<br/><br/>This was his heartfelt wish.<br/><br/>The man in white showed no change in his expression and continued, “That might be difficult. Your reckless actions have prematurely awakened the Primordial Spirit within the Demon Suppression Tower, disrupting the plans of an ancient being. It won’t let you go.”<br/><br/>Was he referring to the Immortal Palace of Yaochi?<br/><br/>Indeed, the master of the Red Mansion knew many ancient secrets.<br/><br/>However, Gu Yang couldn’t figure out his intentions or ascertain his loyalty, hence his reservations.<br/><br/>Gu Yang retorted, “No matter, I’ve already amassed many enemies. If I can’t get past Saint Chao Yang, what about those who follow?”<br/><br/>A flicker of surprise passed through the eyes of the man in white, “It seems, you know more than I had anticipated. That’s good, it saves me the trouble.”<br/><br/>Gu Yang posed, “Senior, is there anything you wish to command?”<br/><br/>The man in white said, “I can help you evade Saint Chao Yang’s pursuit.”<br/><br/>Gu Yang knew well that nothing fell from the sky, so he asked, “What’s the condition?”<br/><br/>PS: Requesting double monthly pass.\t\t\t\t\t\t</div>", "images": {}, "success": true}