{"id": 308, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132216.html", "title": "Chapter 308 - Chapter 308: 308 Heir Of Blue Sky Palace", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 308 - Chapter 308: 308 Heir Of Blue Sky Palace</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 308: 308 Heir of Blue Sky Palace<br/><br/>[…Proceed to the palace and discuss with Su Ningyan on how to counter the invasion of the plains Barbarians.]<br/><br/>[Su Ningyan had long been prepared, deploying heavy troops to guard the border. She also vindicated the former God of War, the Marquis of Wu An, releasing him from prison to serve as the general.]<br/><br/>[You and the Marquis Wu An head to the frontier, spending a month arranging for the troops and rounding up supplies.]<br/><br/>[A little over a month later, the day of the Yaochi Conference arrived. Marquis Wu An took the initiative to lead the cavalry into the plains. They soon found the main force of the plains cavalry, and a decisive battle broke out between the two sides.]<br/><br/>[You and the Divine Power warriors in the army hold off the strong men of the plains.]<br/><br/>[You go on a killing spree, taking down two Barbarians at the Unleaking Realm, and finally beheading the Khan of the Barbarians. In this battle, the entire plains cavalry force was wiped out.]<br/><br/>[On your return to Divine City, a Celestial Being realm strong man from the plains suddenly arrives and kills you. You were twenty-two years old.]<br/><br/>The results of this simulation were pretty much as Gu Yang had anticipated.<br/><br/>With his current strength, he could easily kill anyone at the first layer of the Unleaking Realm.<br/><br/>At the second layer of the Unleaking Realm, given enough time, he could grind them down to death.<br/><br/>As for the third layer of the Unleaking Realm, he had not fought them yet, but even ifhe couldn’t beat them, if he wanted to run, most of the time, they wouldn’t be able to stop him.<br/><br/>The owner of the Red Mansion sought him out probably because of his strength.<br/><br/>Moreover, he was only at the Mana Realm, unlike the strong men at the Unleaking Realm who were bound by limitations. He could act on his will, without worrying about life span depletion.<br/><br/>However, when faced with a Celestial Being realm strong man, he still had no way to fight back.<br/><br/>This was a whole new level.<br/><br/>Just like the transition from the Mortal to the Divine Power realm, from the Divine Power to the Celestial Being realm involves a qualitative leap where a cultivator evolves into an initial-stage fairy being.<br/><br/>Thus, the key was to break through to the Unleaking Realm as quickly as possible.<br/><br/>If the realm gap was too wide, even if he could summon another Unleaking Realm divine beast, it would hardly stand a chance against a Celestial Being realm opponent.<br/><br/>In a nutshell, the most important thing was his own realm of cultivation.<br/><br/>If he could reach the Unleaking Realm, his move, the Celestial Decay, could pose a greater threat to those in the Celestial Being realm.<br/><br/>“Clear thought!”<br/><br/>Gu Yang thought of the advice Wen Jue gave him.<br/><br/>Thinking back, the enemies he made along the way through his simulations, from the Liu family to Lin family, then Shen family and finally Cao Yiyi, were pretty much all taken care of.<br/><br/>As for those he carried a grudge against, the Qin family counts as one, Nether Sect counts as one, and the odd thing in the Yellow Springs cave counts as one…<br/><br/>As for the Saint Chao Yang from the Three Saints Door of the Red Sky, it goes without saying.<br/><br/>The enemies are too strong; without the strength above the Unleaking Realm, there’s no way to deal with them.<br/><br/>But if he doesn’t deal with them, he couldn’t achieve clear thought and would have trouble breaking through to the Unleaking Realm.<br/><br/>Well, it’s a dead end.<br/><br/>Gu Yang left the academy and went to the palace with Eve to discuss the Barbarian invasion with Su Ningyan.<br/><br/>She really had been prepared all along, diverting the silver from the Four Sea Bank to compensate the deficit in the national treasury and prepare for this war.<br/><br/>He was a bit puzzled, “How could the national treasury be so depleted?”<br/><br/>Speaking of which, the decline of Great Zhou was too severe these years. After Wu Da had killed the predecessor emperor, the country had been on a downward spiral.<br/><br/>Su Ningyan sighed, “Someone has been scheming to ruin Great Zhou, planning it for decades. The case of Marquis Wu An’s conspiracy, followed by Wu Da assassinating the former emperor, are all linked.”<br/><br/>“Zhao Yi is weak and has been unable to contend with the ministers in court since his ascension to the throne. Several cabinet ministers, jostling for power and favoring their factions, have turned the court into a chaotic mess. All of this… is the result of a woman’s plot…”<br/><br/>Gu Yang couldn’t help but interject, “You’re not talking about Sun Yuwei, are you?”<br/><br/>Sun Yuwei, a disciple of the legendary Blue Sky Palace who has a deep grudge against the royal family. After she used Wu Da to kill the reigning emperor, it led to a great war between the royal family and the Wu family.<br/><br/>That battle profoundly changed the landscape of Great Zhou.<br/><br/>Su Ningyan’s eyes became complex at the mention of the name, and said, “Indeed, it’s her. She went to great lengths to subvert the ruling power of the Zhao family.”<br/><br/>Gu Yang added, “She probably never expected that an anomaly like you would appear, propping up the crumbling Great Zhou again.”<br/><br/>If the situation was as she had described, then after she took power, the bloodshed on the court would also make sense.<br/><br/>Those people were beyond redemption. Without using iron-fist means to purge them and replace them, there wouldn’t be any progress.<br/><br/>Of course, having the courage to make such a decision and carry out such a course, that’s not something ordinary people can do. One misstep could lead to immediate death.<br/><br/>That the external incarnation of Su Ningyan managed to pull this off was truly remarkable.<br/><br/>“Actually, in retrospect, the experiences of these years always make me feel as though there’s an invisible hand controlling everything in the background.”<br/><br/>Su Ningyan had been keeping these words in her heart for a long time, and finally found a confidant to share them with.<br/><br/>“A lot of things were far too much of a coincidence. ‘Sister’s’ appearance, her entrance into the royal palace, her encounter with Zhao Yi… Many things were just too coincidental.”<br/><br/>After she absorbed her external incarnation back into her body, she also merged with all of ‘sister’s’ memories.<br/><br/>‘Sister’s’ many experiences, were quite odd. An incredible series of coincidences, any single mishap would have made it impossible for her to have all the power in the royal court as queen.<br/><br/>When Gu Yang heard her say this, a chill went down his spine.<br/><br/>Su Ningyan was already in the Mana Realm. If even she felt that something was wrong, there was a high chance there really was an issue.<br/><br/>Suddenly, he thought of the owner of the Red Mansion he had just met.<br/><br/>Could it have been his doing?<br/><br/>However, he didn’t voice his thoughts, and instead switched the topic, “So who exactly is Sun Yuwei?”<br/><br/>Su Ningyan slowly revealed a piece of history. “Five hundred years ago, the Qin Dynasty had a very outstanding emperor, which brought the country to its apex. He himself was also a martial arts prodigy and reached the Mana realm before fifty.”<br/><br/>“Unfortunately for him, he was down on his luck. The Lin family miraculously produced a Lin Tianyi who entering the Celestial Being realm. He was the first to achieve this since the Xia Dynasty.”<br/><br/>“The emergence of Lin Tianyi completely changed the situation at that time. The Four Great Sacred Lands conspiring to take him down, this stirred the whole world.”<br/><br/>“At that time, Blue Sky Palace also sent a disciple to the mortal world, and she met a young man bearing the surname Zhao…”<br/><br/>This is a rather melodramatic story, the disciple from Blue Sky Palace fell in love with her encounter, the patriarch of the Zhao family.<br/><br/>After Lin Tianyi was suppressed by the united forces of the Four Great Sacred Lands, the Qin Dynasty quickly fragmented due to the loss of many of their elite.<br/><br/>The patriarch of the Zhao family, with the help of the disciple from the Blue Sky Palace, seized the opportunity to rise.<br/><br/>Everything started very smoothly, their strength growing continuously, until eventually only two major forces remained in the world, and the patriarch of the Zhao family encountered an enemy he could not defeat.<br/><br/>The disciples of the Blue Sky Palace betrayed the palace to help her beloved, stealing their treasured artifact. She finally killed that great enemy, clearing the biggest obstacle to a unified country.<br/><br/>But she was heavily injured in the process and lost a great deal of her strength.<br/><br/>Subsequently, the patriarch of Zhao’s family hatched a plot to kill her. She escaped with the help of an abnormal treasure and disappeared without a trace.<br/><br/>“If I guess right, Sun Yuwei is probably the disciple trained by that woman, coming to take revenge on Zhao’s family.”<br/><br/>Gu Yang didn’t expect such a melodramatic past in this.<br/><br/>He suddenly realized, “So your teacher is the actual descendant of the Blue Sky Palace!”<br/><br/>With that, he started connecting the dots to many things from the past.<br/><br/>The sword that Su Ningyan found in the Demon Suppression Tower back then was likely the lost treasure of the Blue Sky Palace.<br/><br/>The human corpse that he later discovered in the corpse of a Divine Chicken on the eighth floor of the Demon Suppression Tower, probably belonged to the defector from the Blue Sky Palace.<br/><br/>By these calculations, Su Ningyan was, rightfully, the successor of the Blue Sky Palace.<br/><br/>No wonder she could use the Sky Annihilation technique.<br/><br/>Many things are unexpected.<br/><br/>Without Su Ningyan revealing these things, he would never have imagined that so much was hidden beneath the surface.<br/><br/>PS: The third update. Need monthly ticket.\t\t\t\t\t\t</div>", "images": {}, "success": true}