{"id": 302, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132205.html", "title": "Chapter 302 - Chapter 302: 302 You Deserve To Die", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 302 - Chapter 302: 302 You Deserve To Die</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 302: 302 You deserve to die<br/><br/>Cao Kunpeng hated Gu Yang so much that he was itching to flay him and eat his flesh.<br/><br/>He had invested so much effort to enter the Myriad Phenomena Heavenly Realm!<br/><br/>The woman adamantly refused to use the Void Fairy Vine to take him into the Myriad Phenomena Heavenly Realm, so he was forced to kill her.<br/><br/>Unexpectedly, the Void Fairy Vine still retained its spirit and couldn’t forcibly be used by anyone else, it only recognized the woman’s bloodline.<br/><br/>But, his daughter, was born defiant, always opposing his will. Without her cooperation, he couldn’t forcibly make her cultivate.<br/><br/>To enter the Myriad Phenomena Heavenly Realm with the Void Fairy Vine, one had to at least reach the Divine Power Realm.<br/><br/>Even if he was the Spear Saint, he couldn’t make someone who refused to cultivate directly possess the cultivation level of the Divine Power Realm.<br/><br/>He could only wait, letting her wander the world and cause trouble everywhere. One day, she would understand the importance of power.<br/><br/>At last, she willingly started serious cultivation.<br/><br/>However, she had missed the best age for it and trying to step into the Divine Power Realm had become even more difficult.<br/><br/>To help her, he first asked their Ancestor for this Spirit Pool and paid a significant price for it.<br/><br/>Merely enhancing True Essence wasn’t enough to achieve the Divine Power Realm.<br/><br/>The Original Spirit was equally important.<br/><br/>So, he gathered the Dark Soul Pearl to train her Original Spirit.<br/><br/>For this, he paid an enormous price again.<br/><br/>When his daughter successfully advanced to the Divine Power Realm, her Original Spirit got lost within the Dark Soul Pearl and couldn’t wake up.<br/><br/>Reluctantly, he had to find a solution and call upon Gu Yang.<br/><br/>But who could imagine, that after this kid woke her up, he would follow her into the Myriad Phenomena Heavenly Realm.<br/><br/>His plans spanning decades were about to succeed, only for someone to pick the fruit of his work. You could imagine how furious he felt.<br/><br/>If Gu Yang were to appear before him, he wouldn’t hesitate to pierce a hundred holes in him with his own Terrifying God Spear.<br/><br/>Now, this woman is in his hands. Cao Kunpeng had a fierce glint in his eyes as he said with a cold laugh, “That kid took my daughter away, so I’ll use you to repay the debt!”<br/><br/>As he spoke, Su Qingzhen involuntarily flew towards him.<br/><br/>He had wanted to enjoy the look of despair in her eyes. Who would’ve thought that there wasn’t any fear in her eyes – only disdain and ridicule, “You are courting death!”<br/><br/>That gaze deeply hurt Cao Kunpeng, his face contorted with anger, “How dare you look down on me?”<br/><br/>He was from a minor branch of the Cao family, orphaned since childhood. He had suffered mockery and had been looked down upon.<br/><br/>Because of that, when he grew up, he swore never to let anyone look at him with that kind of gaze again.<br/><br/>As he displayed his talent and gradually grew stronger, those who once looked down upon him were all killed by him.<br/><br/>Eventually, he became the renowned Spear Saint, the second most powerful person in the Cao family. Everyone who saw him only felt fear and awe.<br/><br/>No one dared to look down on him again.<br/><br/>Yet now, in a woman’s eyes, he saw disdain and contempt again, instantly igniting the intention to kill in his heart.<br/><br/>He screamed with madness, “Die for me!”<br/><br/>Is she going to die?<br/><br/>Su Qingzhen is no longer the weak woman devoid of any Cultivation Level she once was. Today, she is a force to be reckoned with in the Divine Power Realm and wields a peerless divine weapon.<br/><br/>When Cao Kunpeng revealed his intention to kill, she sensed it.<br/><br/>She felt a bit unwilling, in the end, she wasn’t able to see Gu Yang…<br/><br/>Just then, a dark shield fell from the sky, landing over her head.<br/><br/>The spear intent that could have shattered her to pieces was blocked by the shield.<br/><br/>Immediately, Su Qingzhen’s eyes moistened. She looked blankly at the sky behind Cao Kunpeng and finally saw the figure she had been longing for day and night.<br/><br/>“What is this?”<br/><br/>Cao Kunpeng was taken aback. The sudden shield could actually block a strike from the Terrifying God Spear, undoubtedly it was a powerful Magic Treasure.<br/><br/>Suddenly, an alarm went off in his heart. He turned around abruptly and saw five figures behind him.<br/><br/>Among them were Gu Yang and Cao Yi Yi.<br/><br/>His face didn’t show any joy at seeing the two people he had been searching for, on the contrary, it was as if he was facing a formidable enemy. A cold sweat even trickled down his forehead.<br/><br/>Unleaking Realm!<br/><br/>Cao Kunpeng’s gaze was locked onto one female belonging to a foreign race.<br/><br/>The other party didn’t leak any aura, like a black hole, and the faintly revealed pressure made him feel creepy.<br/><br/>He had only experienced such pressure from his ancestor.<br/><br/>The woman from the other race was undoubtedly a strong person in the Unleaking Realm.<br/><br/>Cao Kunpeng was at the peak of the third layer of Mana. Although he had not been able to make it to the master list, with his astonishing spear, the only opponents who could match his fighting power were the Sword Saints.<br/><br/>Even when encountering the Unleaking Realm, he may have the strength to fight.<br/><br/>The premise is, that the strong person in the Unleaking Realm has not made a full shot. If a strong person in the Unleaking Realm fights with their full strength, no Sword Saint, no matter who, can resist.<br/><br/>In the past, two Sword Saints and two strong persons in the Unleaking Realm attacked Wu Da. The result was that one of the Sword Saints died and the other was seriously injured.<br/><br/>Cao Kunpeng was very sober, and he would never think that he could really compete with the strong ones in the Unleaking Realm.<br/><br/>“How could such a strong person appear?”<br/><br/>No matter what, he couldn’t figure out where this powerful alien woman came from, and why she was with Gu Yang and Cao Yiyi.<br/><br/>Gu Yang looked at Cao Kunpeng, with a somewhat icy gaze, “The spear saint, you actually make a move on a junior, it’s really despicable.”<br/><br/>He felt murderous in his heart.<br/><br/>If he had arrived a little later, Su Qingzhen would have died on the spot.<br/><br/>There are many women around him, Su Qingzhen was the first one to follow him, and a man always has special feelings for his first woman.<br/><br/>Seeing her in danger, Gu Yang almost couldn’t restrain his killing intent.<br/><br/>Originally, he didn’t intend to kill Cao Kunpeng. If he spared his life, maybe he could cause some trouble for Chi Ming Tian later.<br/><br/>But now, he’s changed his mind.<br/><br/>He said coldly, “You deserve to die!”<br/><br/>“Really?”<br/><br/>At this time, an old voice sounded overhead. A figure descended from the sky. It was a short and thin old man with turbid eyes and a look of old age.<br/><br/>When Cao Kunpeng saw the man, he felt the pressure relieved, and paid a respect respectfully, “Ancestor!”<br/><br/>This man was the founder of Cao family, a strong person on the second layer of the Unleaking realm, an old monster from the same era as Shen Yun, Cao Jing!<br/><br/>He spoke in an old and slightly weak voice, “Unexpectedly, in my lifetime, I would see the legendary Elves of the West Bank Continent. My name is Cao Jing. Nice to meet you.”<br/><br/>Gress responded seriously, “Gress, nice to meet you.”<br/><br/>In front of this powerhouse of the same realm who also knew about the existence of the Elves, she didn’t want to be rude.<br/><br/>Cao Jing said, “You have come from far away to be here, which is not easy. It’s better not to get involved in the affairs of our Divine State continent.”<br/><br/>This sentence was said weakly, but Gress naturally heard the threat in it.<br/><br/>She said, “Don’t worry, I won’t get involved in your affairs.”<br/><br/>After she finished speaking, she moved back a bit.<br/><br/>Honestly, if it wasn’t for her concern for Princess Eve, she would rather return to the West Bank Continent immediately and bring the things back.<br/><br/>With a few words, Cao Jing made a strong person of Unleaking Realm retreat, then turned his head and looked at Gu Yang, a smile appearing on his face, “My master has ordered that as soon as I see you, I’ll kill you right away. However, I’m quite curious, what exactly is your secret for cultivating so fast?”<br/><br/>Gu Yang slowly drew the Phoenix Feather Knife, said in a somewhat mocking tone, “Have you ever heard of the phrase ‘Curiosity kills the cat?’ Are you sure you want to know?”<br/><br/>“You dare to draw your sword in front of me, your courage…,” Before the old man finished speaking, his face suddenly changed.<br/><br/>Gu Yang’s forehead flew out a golden shadow, which turned into a golden monkey in the blink of an eye.<br/><br/>“The Nine Heavens Divine Law Code? You have practiced to this point!”<br/><br/>Cao Jing instantly recognized that the divine ape in front of him was of the Unleaking Realm. Against such an ancient Divine Beast, he regarded it as a major enemy and dared not to take it lightly.<br/><br/>Cao Kunpeng looked shocked too, and the next moment, he felt a huge killing intent. In shock, he raised the awe-inspiring spear in his hand.<br/><br/>The Nine Heavenly Blades swallowed the universe!<br/><br/>This blade broke the limit of space and directly beheaded Cao Kunpeng.<br/><br/>“I told you, you deserve to die!”<br/><br/>Cao Kunpeng felt a chill in his neck, the world started to spin, and Gu Yang’s murder-filled voice rang in his ears, but he was still somewhat confused.<br/><br/>How could this happen?<br/><br/>No matter what, he couldn’t imagine that he would die like this.<br/><br/>PS: The third update asks for a monthly ticket.\t\t\t\t\t\t</div>", "images": {}, "success": true}