{"id": 305, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132210.html", "title": "Chapter 305 - Chapter 305: I Can’T Handle It", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 305 - Chapter 305: I Can’T Handle It</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 305: I can’t handle it<br/><br/>In the Divine City, in an unremarkable small red building, sat a man wearing a white robe in the main hall. He was sitting motionless on a meditation mat, like a statue.<br/><br/>The entire hall was spotless.<br/><br/>In front of him, there was a wooden shelf signifying the passage of time.<br/><br/>Three books lay on the shelf.<br/><br/>Suddenly, the book on the extreme right began to flip itself, revealing the first page. A name flew out from the book, emitting a brilliant golden light.<br/><br/>The man in the white robe slowly opened his eyes, and looked at the two characters floating in the air. His calm face expressed a hint of surprise.<br/><br/>“Gu Yang.”<br/><br/>He silently repeated the name in his heart.<br/><br/>At this moment, footsteps rang out and a girl about the age of ten wandered in. Looking at the page of the opened book and the golden letters suspended in the air, she exclaimed in surprise, “Teacher, Gu Yang has actually become the number one in the mana Realm.”<br/><br/>“Isn’t he the fastest to reach the number one rank in the history of Mana Realm?”<br/><br/>While she was speaking, names were flying out of the book, forming a list right behind the first name that had appeared.<br/><br/>A moment later, the names in the air disappeared.<br/><br/>The book on the shelf was closed and sealed again.<br/><br/>The little girl couldn’t help herself from asking, “Teacher, who really is this Gu Yang? Could he be the reincarnation of an ancient figure with great power?”<br/><br/>The man in the white robe remained silent, seemingly ignoring her.<br/><br/>The little girl said angrily, “Again with the silence? It’s infuriating. Once I’m able to open these books, I’ll find out for myself.”<br/><br/>Previously, her teacher would mollify her by saying that celestial secrets must not be disclosed.<br/><br/>Now, he couldn’t even be bothered to say that.<br/><br/>This teacher was simply lazy to the extreme.<br/><br/>Since her arrival, she had never seen him move from this loft. He would sit there, too lazy to move or talk, even too lazy to eat.<br/><br/>She realized for the first time that some people could go without eating and still survive.<br/><br/>Suddenly, the man spoke, “Invite him over.”<br/><br/>“Yes, teacher.”<br/><br/>The little girl was somewhat excited. Finally, the teacher had spoken.<br/><br/>Ever since she had arrived, this was the first time she had heard the teacher invite someone over.<br/><br/>As soon as the little girl left, the man looked at the book on the extreme left of the shelf, which was emitting a faint light.<br/><br/>Then he closed his eyes again, and the loft went quiet once again.<br/><br/>Gu Yang arrived at the literary institute with the women.<br/><br/>He had nowhere else to go. Tianxin Martial Arts Hall was too small to accommodate all these people, the literary institute was bigger.<br/><br/>Zhou Zongye was taken aback when he saw the women accompanying him.<br/><br/>Was this guy planning to sweep up the entire Beauty List?<br/><br/>The top of the list was occupied by Su Ningyan, known for her mesmerising beauty, until she had entered the palace and became the queen.<br/><br/>Ye Lingbo was third.<br/><br/>Wu Lingling was fifth.<br/><br/>Pei Qianlan was seventh.<br/><br/>Cao Yiyi was tenth.<br/><br/>Su Qingzhen was thirteenth.<br/><br/>Impressive. The women now in the literary institute made up half of the Beauty List.<br/><br/>There were also two women of different races from another continent with equally superior beauty.<br/><br/>He suddenly felt that the title of ‘The Most Handsome Man in the World’ seemed justified.<br/><br/>“Why are you back again?”<br/><br/>Zhou Zongye felt a bit of a headache.<br/><br/>None of the women present were easy to deal with. If Gu Yang was around it would be manageable, but if he had to handle some business and left them here, there might be a serious fight…<br/><br/>The thought alone was troublesome.<br/><br/>Gu Yang didn’t need to mince words with him and said bluntly, “I’ve got nowhere else to go.”<br/><br/>He couldn’t take them to the Imperial Palace. The last time he did, Su Ningyan almost obliterated him.<br/><br/>“Gu Yang—”<br/><br/>At this moment, an excited voice called out from near the entrance of the courtyard. It was Pei Qianlan.<br/><br/>After she and Wu Er left Wuliang Mountain, they had returned to the Divine City and waited for him at the literary institute.<br/><br/>Now that she saw he was safe and sound, she finally let out a sigh of relief.<br/><br/>She ran towards Gu Yang, intending to throw herself into his arms.<br/><br/>Halfway there, she suddenly felt an intent to kill. She shivered and instinctively released True Essence from her body.<br/><br/>Like a chain reaction, every woman present released her own True Essence.<br/><br/>Suddenly, the courtyard was filled with a murderous aura.<br/><br/>Only Ling Ling and Elf Princess Eve seemed unperturbed, making no reaction whatsoever.<br/><br/>Zhou Zongye watched Gu Yang sympathetically, understanding that this was the price one needed to pay for being a playboy.<br/><br/>All of these women, even the weakest among them, were at the first level of the Golden Body realm. They were so young and had great potential. Their future achievements were immeasurable.<br/><br/>He could already envision the miserable future that awaited Gu Yang.<br/><br/>The strife between these women would be enough to drive him crazy.<br/><br/>Damn it!<br/><br/>A moment later, Pei Qianlan finally snapped out of her daze and stared at the woman who was harboring hostility towards her.<br/><br/>Sparks flew when their gazes met.<br/><br/>However, she was the first to withdraw her True Essence and did not push further.<br/><br/>Cao Yiyi wasn’t foolish either. She had just been warned once during their last meeting. She swiftly retreated, gently rubbing her arm and thought to herself, “Good girl, I can’t kill her or he will ignore me for real.”<br/><br/>The other women also realized their overreaction, and hurriedly retracted their True Essence.<br/><br/>The tense atmosphere that had blanketed the courtyard moments ago finally relaxed a bit.<br/><br/>Just then, an elderly man walked in from outside, “Excuse me, is Young Master Gu here?”<br/><br/>When Gu Yang saw the elderly man, he inexplicably felt a sense familiarity, and said, “That’s me.”<br/><br/>“In accordance with my master’s command, I would like to extend an invitation for the young master to come over for a meeting.”<br/><br/>Zhou Zongye, who was standing to the side, was taken aback when he heard these words.<br/><br/>He naturally recognized the old man and knew very well who his master was – the master of the Red Mansion.<br/><br/>The master of the Red Mansion had been sitting in his loft for over a thousand years. Over this time, only a few people had been invited.<br/><br/>The last one who was invited to the Red Mansion was their dean.<br/><br/>Gu Yang asked, “Who is your master?”<br/><br/>Zhou Zongye whispered, “His master is the man from Red Mansion.”<br/><br/>What?<br/><br/>Gu Yang’s spirit lifted, was it the mysterious master of the Red Mansion who was inviting him?<br/><br/>He had always been interested in this person but never had the time to pay a visit. Now that he was being invited, it was a great opportunity to get to know him.<br/><br/>“Please lead the way.”<br/><br/>Gu Yang then left by himself.<br/><br/>Wait.<br/><br/>Zhou Zongye suddenly realized the problem, what about all the women present now that Gu Yang is leaving?<br/><br/>He was not up for it at all.<br/><br/>Gu Yang followed the old man and felt the sense of familiarity growing stronger. He couldn’t help but ask, “Elder, how should I address you?”<br/><br/>This old man was not simple. His cultivation level was immeasurable, even Gu Yang couldn’t see through him. He had no problem with addressing him as ‘elder’.<br/><br/>The old man said, “I dare not accept the honorific title of ‘elder’. You can call me Old Shen.”<br/><br/>“Shen family?”<br/><br/>It finally dawned on Gu Yang why the old man seemed so familiar. He was from the Shen family.<br/><br/>So, someone from the Shen family went to the Red Mansion.<br/><br/>PS: I’m planning an activity for the 55 celebration, I will write a side story. I’m considering a story about the protagonist and several female characters crossing back to Earth. The protagonist does not remember the crossing, but the female characters do. What do you think? Let me know your suggestions. Lastly, double votes for this month are appreciated.\t\t\t\t\t\t</div>", "images": {}, "success": true}