{"id": 311, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132222.html", "title": "Chapter 311 - Chapter 311: Tame 311", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 311 - Chapter 311: Tame 311</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 311: Tame 311<br/><br/>A semi-god body!<br/><br/>An ultra-class monster!<br/><br/>When the Elf Princess Eve fell to the depths of the ground, she was startled at the sight of the vast corpse.<br/><br/>In the West Bank Continent, many gods had been silent for nearly ten thousand years, and it was the half-gods that could decide the fate of the continent.<br/><br/>Although she had never seen a half-god, the terrifying majesty was exactly the same as the divine majesty described in legends. She recognized it at a glance.<br/><br/>And the being sitting on that half-god body, is an ultra-class monster. And not just an ordinary one either.<br/><br/>She finally knew why Gu Yang came here.<br/><br/>He wanted to subdue this ultra-class monster.<br/><br/>She was somewhat curious, how was he going to subdue this exceptionally powerful ultra-class monster?<br/><br/>Defeating, killing, and subduing. These are completely different concepts.<br/><br/>Generally speaking, if your strength surpasses by a considerable margin, it’s easy to defeat, yet difficult to kill.<br/><br/>If the other party is hard to beat and desperate to escape, it’s difficult to kill.<br/><br/>Unless the strengths of the two are on different levels.<br/><br/>Moreover, subduing is more difficult than killing. Not only do you have to defeat the opponent, but you also have to prevent them from seeking death.<br/><br/>This requires an overwhelming power.<br/><br/>Can Gu Yang do it?<br/><br/>…<br/><br/>Gu Yang didn’t rush to make a move, and said, “If I’m not mistaken, that crystal in your hand is a pardon from a Star Lord. Without the Gold Emperor’s jade book, it’s almost impossible for you to inherit the power of the Star Lord.”<br/><br/>He had a certain understanding of the Golden Court system, so he could speculate about the current situation of the monkey.<br/><br/>A term to describe it, cornered like a tiger.<br/><br/>The Golden Court system has its own logic, and the power of the gods in this world originates from the Gold Emperor’s jade book, which is equivalent to a server.<br/><br/>And the pardon is like a terminal. The higher the level, the greater the authority it has, and the more power it can get from the “server”.<br/><br/>What the monkey is doing now is trying to break through the “firewall” of the jade book in the Golden Court and illegally gain power from the “server”.<br/><br/>This is not so easy.<br/><br/>During the Xia Dynasty, King Liang came to this world and divided the Gold Emperor’s jade book into three, but he did not bring this system outside. It’s impossible for this monkey to do something that even this celestial being wasn’t able to do, especially when it’s just in the Unleaking realm.<br/><br/>From another viewpoint, Gu Yang could see that the monkey and the purple crystal had almost merged into one.<br/><br/>At this moment, it probably couldn’t withdraw even if it wanted to. It could only forcefully resist.<br/><br/>He said, “You can only use about fifty percent of your strength now.”<br/><br/>The monkey snorted coldly, “That’s enough to kill you!”<br/><br/>While speaking, one of its white hairs flew out, landed on the ground, transformed into a monkey and roared as it charged towards Gu Yang.<br/><br/>“You won’t cry until you see the coffin.”<br/><br/>Gu Yang chuckled, his eyebrows flew out a golden giant ape, which kicked the monkey into the air. In mid-air, the monkey broke apart and transformed back into a hair.<br/><br/>“A Divine Ape that connects the heavens?”<br/><br/>The monkey was startled. It never expected that the young man would have a Divine Ape in the Unleaking realm.<br/><br/>If it was in its prime, it could fight against it.<br/><br/>How to fight under these circumstances?<br/><br/>Light once again emitted from Gu Yang’s eyebrows, and out flew a Phoenix whose aura was even more dreadful than the Divine Ape’s.<br/><br/>“A…A Phoenix?”<br/><br/>The monkey was beyond shocked.<br/><br/>The Phoenix was once the Emperor of the Monster Race, holding the highest position among them.<br/><br/>Suddenly, it recalled a prediction by a wise man, claiming that the revival of the Monster Race would begin when the Emperor returned to the human realm.<br/><br/>But the Phoenix had become a pet of a human?<br/><br/>And its strength was too weak, right?<br/><br/>Was this truly the invincible emperor during ancient times?<br/><br/>Fear flashed in the monkey’s eyes as it saw the Phoenix preparing to spit out flames. It shouted, “Stop!”<br/><br/>The Phoenix and the Divine Ape both stopped their actions.<br/><br/>Seeing the fear in its eyes, Gu Yang asked, “So, have you changed your mind?”<br/><br/>The monkey asked, “What do you mean by ‘pet’?”<br/><br/>If he could convince it without a fight, that would naturally be the best outcome.<br/><br/>Gu Yang explained in detail the relationship between a Beastmaster and his pets.<br/><br/>Strictly speaking, if it is an equal contract, the relationship between both sides can be called a partnership.<br/><br/>Beastmasters use the power of their pets to fight.<br/><br/>In return, pets can rely on their Beastmasters to grow rapidly, using the Beast-taming Space and scientific feeding and training methods to rapidly increase their strength.<br/><br/>The growth rate of pets is tens, even dozens of times faster than that of wild Monster Beasts.<br/><br/>Though freedom is sacrificed, the rapid increase in strength can’t really be considered a loss.<br/><br/>These two rely and accomplish each other.<br/><br/>It’s not an exaggeration to say that the relationship between a Beastmaster and his pet is much more intimate and secure than that of a married couple.<br/><br/>Among couples, there are many betrayals. But between Beastmasters and pets, this situation rarely happens.<br/><br/>…<br/><br/>The monkey, having listened to his explanation, understood what kind of relationship a Beastmaster and pet have. After thinking for a moment, it said, “I agree.”<br/><br/>Making this decision was not as difficult as expected.<br/><br/>There were only two paths before it: death or becoming Gu Yang’s pet.<br/><br/>Isn’t the choice obvious?<br/><br/>Seeing it agree so quickly, Gu Yang was very happy. He bit his middle finger and used his mental power to outline a contract, which flew toward the monkey.<br/><br/>The monkey’s Original Spirit sensed the content of the contract. Once it confirmed there was no mistake, it let go of its mind, letting the contract imprint deeply into its Original Spirit.<br/><br/>In the darkness, it sensed the presence of something immensely majestic.<br/><br/>This is-<br/><br/>It was shocked to the core, with no further doubts. It completely let go of its soul. Its Original Spirit underwent a miraculous change.<br/><br/>…<br/><br/>Almost at the same time, in the royal city of the Golden Court.<br/><br/>Above the clouds, an Immortal Palace could vaguely be seen.<br/><br/>On the sixth floor, a purple figure sat in the center chair. It was the ruler of the Golden Court.<br/><br/>Suddenly, she opened her eyes wide, looking somewhat amazed, “Is that… a Primordial Treasure?”<br/><br/>She sensed an incredibly vast power, coming from a distant place through the void, albeit only for a moment, it seemed to solidify her Original Spirit.<br/><br/>Such power greatly surpasses the scope of a Celestial Being realm!<br/><br/>It was very similar to the legendary Primordial Treasures.<br/><br/>Only the Primordial Treasures could resist the erosion of that power.<br/><br/>Those ancient Primordial Treasures have all vanished since that great calamity.<br/><br/>Now, after ten thousand years, the Primordial Treasures appear again. Does this mean that the impact caused by that catastrophe is finally over?<br/><br/>Thinking of this, her heart was somewhat anxious. If those great figures from ancient times reappeared, where would she stand?<br/><br/>…<br/><br/>Meanwhile, rulers from two other kingdoms also sensed the terrifying fluctuations, all feeling overwhelmed with fear.<br/><br/>…<br/><br/>Back at the pit, the ceremony was finally completed.<br/><br/>The moment the contract was formed successfully, Gu Yang felt an extremely strange sensation, as if an extra organ had been added to his body that he could control at will.<br/><br/>He could fully utilize the other’s power, including the Monster Yuan, physical strength, Divine Power, and so on.<br/><br/>At the same time, he could communicate with it through his thoughts.<br/><br/>Gu Yang tried to bring it into his Beast-taming Space. In an instant, the monkey disappeared from its original location and entered the Beast-taming Space in his mind.<br/><br/>“I didn’t expect it to go so smoothly.”<br/><br/>He was quite pleased, as he now technically had an extra avatar of a Divine Beast in the Unleaking Realm.<br/><br/>If he could also cultivate it to the Celestial Being realm, then he would possess ten Celestial Being realm Divine Beasts, one more than the Xia Emperor of the past.<br/><br/>This monkey is not the Divine Ape.<br/><br/>After it became his pet, he noticed the differences between it and the Divine Ape. They are completely different species.<br/><br/>He communicated with the monkey through his mind, “How should I address you?”<br/><br/>“You can call me Yuan Xing.”<br/><br/>“How do you feel in the Beast-taming Space?”<br/><br/>“I feel… very good.”<br/><br/>After speaking, it began to fall asleep.<br/><br/>Gu Yang did not disturb it and looked at the corpse of the Divine Ape on the ground, his eyes glinting.<br/><br/>PS: The third chapter request for a monthly ticket.\t\t\t\t\t\t</div>", "images": {}, "success": true}