{"id": 319, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132238.html", "title": "Chapter 319 - Chapter 319: Fallen 319", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 319 - Chapter 319: Fallen 319</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 319: Fallen 319<br/><br/>“So, are you really Luo Kun?”<br/><br/>Upon hearing this name, a trace of confusion flashed through the eyes of “Daoist Huangmu”, he muttered to himself, “Luo Kun? Am I Luo Kun? No, my name is Daoist Huangmu…”<br/><br/>Suddenly, he clutched his head, moaning in pain, “Who…who am I?”<br/><br/>As he spoke, a dark aura continued to leak from his body and the face of the half-transformed beast contorted, sprouting layer upon layer of black scales.<br/><br/>Seeing this, Murong hastily put some distance between them.<br/><br/>The Daoist was obviously on the brink of a full transformation, a true monster in the making.<br/><br/>In this world, once such a transformation starts, two things can generally happen.<br/><br/>One option is a physical transformation, where a person becomes a monstrous, unrecognizable creature.<br/><br/>The other arises from their Original Spirit undergoing a change, mutating into something ghastly.<br/><br/>For cultivators with a high Realm, both transformations often happen simultaneously.<br/><br/>As a powerful Nascent Soul cultivator, should Daoist Huangmu lose control, the resulting beast and ghastly entity would both be terrifying and difficult to contend with.<br/><br/>Just when it seemed Daoist Huangmu was about to lose control, a talisman atop his head suddenly burned, surprisingly suppressing the dark aura within him.<br/><br/>The violent trembling ceased, he slowly raised his head, his eyes, once panicked, now calm and cold, he asked, “Who exactly are you?”<br/><br/>At this moment, his appearance, his gaze, even his internal mana, everything was completely different from before, as if he had become someone else.<br/><br/>Gu Yang marveled, “Luo Family’s ‘Great Law of Seizing the Original’, it is indeed profound.”<br/><br/>Among the nine prominent families, the Luo family had two unparalleled cultivation methods, one of them being the ‘Great Law of Seizing the Original’, as Wu Er had mentioned to him.<br/><br/>However, Wu Er himself had never witnessed firsthand the ‘Great Law of Seizing the Original’. In fact, to date, no one had ever seen this method in practice.<br/><br/>It was only now that Gu Yang surmised what this law entailed.<br/><br/>Many doubts were suddenly made clear.<br/><br/>Why Luo Kun could pretend to be Daoist Huangmu for so many years without anyone realizing.<br/><br/>How Luo Kun, a martial artist, could use Nascent Soul wizardry.<br/><br/>Why Luo Kun, who knew he came from another world, did not react much to this revelation.<br/><br/>…<br/><br/>All these, must have something to do with the ‘Great Law of Seizing the Original’, which seems to ‘seize’ someone’s Original Spirit.<br/><br/>After Luo Kun seized Daoist Huangmu’s Original Spirit, he disguised himself as Daoist Huangmu. Over the years, he probably began to truly believe that he was Daoist Huangmu.<br/><br/>“The Great Law of Seizing the Original…”<br/><br/>As Luo Kun mumbled, his body began to change again; the monstrous half of his body mysteriously disintegrated, turning into ashes.<br/><br/>Quickly following this, a new body grew out from the ashes, restoring his human form.<br/><br/>…<br/><br/>“Wha… What the hell is going on here?”<br/><br/>Murong was dumbfounded, the events unfolding before his eyes surpassing his wildest understanding.<br/><br/>A ravaged, half-contaminated person, had managed to discard the contaminated parts of his body and grow new flesh and limbs in their place.<br/><br/>This was something unheard of.<br/><br/>How did he do it?<br/><br/>…<br/><br/>Gu Yang, however, was not overly surprised. Luo Kun was a high cultivator in the third layer of the Unleaking Realm, a step away from reaching the Celestial Being realm.<br/><br/>Even he had never personally encountered someone of such a high realm.<br/><br/>Regenerating severed limbs, in fact, was not that unusual.<br/><br/>Nascent Soul cultivators could never accomplish this.<br/><br/>This was exactly the advantage of being in the Unleaking Realm.<br/><br/>Luo Kun had maintained his monstrous form because such regeneration consumed a tremendous amount of life essence, his longevity.<br/><br/>Gu Yang said, “To have survived in this hellish place for two hundred years, even resorting to impersonating someone else, Luo Kun, your tenacity and will to live truly astonish me.”<br/><br/>Luo Kun’s face was icy, his eyes killing intent.<br/><br/>His charade had been exposed, nearly causing him to lose control. Forced to abandon his guise as Daoist Huangmu and revert to his original appearance, Luo Kun had lost this invaluable identity.<br/><br/>Giving up his contaminated half body and regenerating it cost him at least a hundred years of his life span.<br/><br/>This was undoubtedly pouring salt onto his wounds.<br/><br/>If he had been in a good mood after that, it would’ve been a real surprise.<br/><br/>He said coldly, “Hand over what you possess, unless you wish to die.”<br/><br/>Upon layin eyes on Gu Yang, Luo Kun had already guessed that Gu had a way to leave Yellow Springs Cave.<br/><br/>Otherwise, Gu Yang couldn’t have maintained his current intact condition.<br/><br/>And the means of exiting and entering must be the key to unlocking the Yellow Springs Cave.<br/><br/>With that thing, he could finally escape from this godforsaken place.<br/><br/>Thinking of this, Luo Kun felt as if there was a fire burning in his chest.<br/><br/>These past two hundred years, he lived as if he was not even a human being. He survived day by day, locked himself away, thoroughly debased.<br/><br/>Now, he finally had the chance to escape.<br/><br/>He didn’t care about attaining the Celestial Being realm, or the ancient Immortal’s treasures. He just wanted to leave this place.<br/><br/>All he wanted was to escape this godforsaken place.<br/><br/>…<br/><br/>Gu Yang sneered, “You’ve stayed here for two hundred years, how much life span do you have left? Fifty years? A hundred years?”<br/><br/>“That’s more than enough to kill you,” Luo Kun’s lips curled up in a cold smile, “Undeniably, you are strong. I’ve never seen a Mana realm as strong as yours. You’re no less formidable than the Unleaking Realm. But, how much of your mana is left?”<br/><br/>“Hand over the item obediently. I might spare your life!”<br/><br/>“Oh, really?”<br/><br/>Gu Yang smiled, then accessed his system.<br/><br/>[Simulation ends, you can keep one of the following.]<br/><br/>[…]<br/><br/>“I choose one.”<br/><br/>All of a sudden, his mana was restored to its peak. “How about now?”<br/><br/>Seeing his mana restored in an instant, Luo Kun’s face turned pale.<br/><br/>How did he accomplish this?<br/><br/>Luo Kun racked his brain yet failed to comprehend how one’s depleted mana could be restored instantly.<br/><br/>…<br/><br/>Murong, who was on the side, felt increasingly shocked. Their conversation contained too much information for him to process.<br/><br/>The moment he saw Gu Yang’s mana restored, his eyes nearly popped out of their sockets, a pair of horns seemed to protrude from his forehead.<br/><br/>His Daoist Heart nearly collapsed, nearly losing control right there and then.<br/><br/>…<br/><br/>…….<br/><br/>“Die!”<br/><br/>Boom!<br/><br/>Luo Kun attacked without hesitation. Now, he finally displayed the martial prowess of his desperation, fighting with the physical strength of his mortal body.<br/><br/>His speed was by no means slow, and his strength was by no means weak. Any Nascent Soul Cultivator, when faced with such close range attack, would be doomed.<br/><br/>However, his opponent was Gu Yang.<br/><br/>Whoosh!<br/><br/>A golden light shot out from Gu Yang’s forehead. A gigantic palm appeared, swatting Luo Kun away.<br/><br/>In terms of close-quarters combat, no one could match the Divine Ape, known to have unparalleled strength. The force of the palm strike completely shocked Luo Kun.<br/><br/>He shouted in disbelief, “Nine Heavens Divine Law?”<br/><br/>Who on earth is this person?<br/><br/>Just a cultivator at the Mana realm, yet possessing Unleaking realm level Divine Beast forms…<br/><br/>And more importantly, two of them!<br/><br/>Before his eyes, a Unleaking realm Phoenix appeared. It opened its mouth and spewed a terrifying flame.<br/><br/>“No–”<br/><br/>Facing two Unleaking Realm Divine Beasts, Luo Kun fought back desperately.<br/><br/>He simply could not accept it!<br/><br/>He was the rare genius poised to ascend to Celestial Being in a thousand years, the third no less.<br/><br/>As the third-step Unleaking Realm, with the exception of Celestial Beings, no one could match him.<br/><br/>If he had not been trapped in this world for two hundred years, if he were not almost drained of his life force, these two Divine Beasts would not be able to withstand him.<br/><br/>If only…<br/><br/>Unfortunately, there were no ifs.<br/><br/>Suddenly, Luo Kun’s mind went blank. A blade has already hacked at the crown of his head.<br/><br/>The next moment, endless darkness engulfed him.<br/><br/>Thus, a formidable being of the third layer of Unleaking Realm, fell here.<br/><br/>PS: Third update, seeking monthly ticket.\t\t\t\t\t\t</div>", "images": {}, "success": true}