{"id": 312, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132224.html", "title": "Chapter 312 - Chapter 312: 312 East Sea Sword Saint", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 312 - Chapter 312: 312 East Sea Sword Saint</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 312: 312 East Sea Sword Saint<br/><br/>This was the body of a Celestial Being, well preserved for over a thousand years. Only, the golden fur was somewhat dull, losing its luster.<br/><br/>Gu Yang leaped onto the body’s chest, the Phoenix Feather Knife in his hand slashing down ruthlessly.<br/><br/>There was a muffled sound!<br/><br/>He used fifty percent of his strength, yet the Phoenix Feather Knife only sunk half an inch into the flesh.<br/><br/>Good heavens, this mortal body was incredibly hard.<br/><br/>Gu Yang lifted his knife again, mana flowing through the blade, and slashed down.<br/><br/>Flick–<br/><br/>A deep cut mark was slashed open on the body.<br/><br/>Swinging left and right, finally, he split open the chest of this Divine Ape’s body, revealing the heart within.<br/><br/>Eve, who was watching from the side, was shocked.<br/><br/>That was the body of a half god!<br/><br/>Half gods were also gods, possessing divine power, they just hadn’t ignited their divine fire yet. In the West Bank Continent, half gods were considered incarnations of gods in the human realm.<br/><br/>It was universally accepted on the West Bank Continent that gods must not be profaned by mortals.<br/><br/>In history, those human heroes or legendary powerhouses who killed gods (half gods), all eventually met with terrible ends.<br/><br/>Eve was a faithful follower of the Moon God. Seeing Gu Yang so profane a half god’s body made her very uneasy. Although, this half god had no connection whatsoever with the Moon God.<br/><br/>This was completely an instinctual reaction.<br/><br/>…<br/><br/>Gu Yang cleaved the massive heart open with his knife, revealing the almost congealed pale gold blood within, and a trace of a smile appeared on his face.<br/><br/>All his efforts were for this bit of blood.<br/><br/>With a wave of his hand, a mass of dark golden blood flew towards him, not only from within the heart, but all the blood within the blood vessels was also sucked out completely.<br/><br/>In a short while, it formed a large mass in front of him.<br/><br/>A crimson flame was kindled in Gu Yang’s hand which then enveloped the large mass of dark golden blood.<br/><br/>Under the Phoenix True Fire, the impurities in the blood mass were quickly burned off. In the end, only three drops of golden blood remained.<br/><br/>This is<br/><br/>Gu Yang took out three prepared jade bottles and poured those three drops of blood into them.<br/><br/>Divine Blood!<br/><br/>Eve finally realized what Gu Yang was doing.<br/><br/>She had never imagined that this half god’s body, dead who knows how long ago, still had remnants of divine blood.<br/><br/>The divine blood contained some divine power and divinity, which countless legendary powerhouses dreamt of. Historically, any acts of slaying half gods were all done to obtain the divine blood within them.<br/><br/>Then, she saw the half-god’s body disappear before her eyes, making her slightly stunned.<br/><br/>Where did the body go?<br/><br/>She didn’t sense any fluctuations in space just now, so it didn’t seem like it was put into a spatial item.<br/><br/>“Let’s go.”<br/><br/>Gu Yang, seeing the prompt that he gained 500 energy points, felt quite satisfied.<br/><br/>Coming to the Golden Court was indeed the right choice. Not only did I get a pet from the Unleaking Realm, but from the body of the Celestial Being, I also recharged five hundred points of energy.<br/><br/>His current balance had returned to six hundred and fourteen points.<br/><br/>The two left the underground and flew into the sky.<br/><br/>Inwardly, Gu Yang communicated with his first pet, “Yuan Xing, what species are you?”<br/><br/>After a while, he received a response, “I have some bloodline of the Red-Eyed Divine Ape.”<br/><br/>After Yuan Xing finished speaking, he suddenly asked, “Where did you put the body of the Star Lord just now?”<br/><br/>Gu Yang said, “Would you believe me if I told you that I swallowed it?”<br/><br/>“…”<br/><br/>Gu Yang then asked, “What divine power do you have?”<br/><br/>He had never heard of the Red-Eyed Divine Ape before, so he had no idea how powerful it was. He needed to understand it thoroughly so that in future battles, he would know how to make proper use of it.<br/><br/>“My divine power is related to my eyes…”<br/><br/>After Yuan Xing’s explanation, Gu Yang finally understood.<br/><br/>His divine power, known as Red-Eyed Technique, was related to his eyes.<br/><br/>Once a Divine Power is used, it creates a Mana field. Within this field, the enemy’s Original Spirit would be affected unknowingly, as if under an illusion.<br/><br/>“Why didn’t you use this Divine Power on me earlier?” he asked curiously.<br/><br/>If well-tuned, an illusion could surprise the enemy and allow you even a chance to escape, despite being weaker.<br/><br/>In his mind, the faint voice of Yuan Xing came, “The Candle Dragon is the bane of all illusions. The blood of the Candle Dragon within you, I can sense it, even hundreds of miles away.”<br/><br/>So that’s it.<br/><br/>Gu Yang realized. Indeed, his Candle Dragon Art may only be at the fifth level without full transformation, but he could use the divine power of the Candle Dragon to see through illusions.<br/><br/>He communicated with Yuan Xing in his mind.<br/><br/>Soon they could see the Heavenly Gang Mountain.<br/><br/>Just as Gu Yang was preparing to land, he suddenly felt a piercing pain in his Original Spirit, hastily stopped, and turned to look. On the mountain peak, he saw a man dressed in white as snow.<br/><br/>The man was not tall, but just standing there gave a profound and unfathomable sense. Most peculiar were his eyes, shining like the stars.<br/><br/>As soon as Gu Yang met the man’s gaze, his eyes momentarily stung.<br/><br/>Such terrifying sword intention!<br/><br/>He held tightly the hilt of the Phoenix Feather Knife, meeting the gaze unflinchingly. Word by word, he said, “East Sea Sword Saint!”<br/><br/>In this pocket world, such a terrifying swordsman could only be the East Sea Sword Saint, the leader of the Ten Great Sword Saints.<br/><br/>However, this East Sea Sword Saint, standing there, showed nothing extraordinary, a characteristic of the Unleaking Realm.<br/><br/>He had already broken through to the Unleaking Realm!<br/><br/>“Gu Yang!”<br/><br/>The man dressed in white atop the peak called out his name.<br/><br/>It was the East Sea Sword Saint, originally named Qu Tianshu. He did not carry any weapon. The famed Jade Wave Sword was not with him.<br/><br/>Gu Yang was somewhat surprised, “Even the Sword Saint knows my name.”<br/><br/>Speaking of which, he saw a familiar figure behind the East Sea Sword Saint. It was Lan Shu, glaring at him. She was clearly still holding a grudge about what happened last time.<br/><br/>No wonder he knew him. She must have gone to him and tattled.<br/><br/>He said, “Why does the Sword Saint block my way? Is there any particular reason?”<br/><br/>Qu Tianshu spoke slowly, “In the future, do not come to the Golden Court Realm anymore.”<br/><br/>Gu Yang raised his eyebrows, asking, “Why?”<br/><br/>Qu Tianshu said, “It’s my duty. In the future, anyone who wishes to enter the Golden Court Realm must consult my sword.”<br/><br/>Duty?<br/><br/>Gu Yang understood somewhat and said, “Farewell.”<br/><br/>Then, he and Eve landed in front of a cave.<br/><br/>As they walked into the cave, a layer of light came up at the entrance, indicating a prohibition.<br/><br/>Gu Yang continued onward without looking back.<br/><br/>Blue Bird once said that the entrance to the Golden Court Realm was guarded by a sect called Heaven Gang, which was a powerful sect in the ancient times.<br/><br/>The first time they came, there was a prohibition at the entrance of the cave. At that time, Blue Bird was ready to retreat. It didn’t expect Heaven Gang to be still guarding this place.<br/><br/>Next, the God of Golden Court annihilated Heaven Gang.<br/><br/>They were able to enter the Golden Court Realm successfully then.<br/><br/>It seemed that East Sea Sword Saint had a deep relationship with Heaven Gang. Most likely, he inherited the legacy of Heaven Gang and therefore had the duty to protect the Heavenly Gang Mountain.<br/><br/>…<br/><br/>Meanwhile, up on the Heavenly Gang Mountain, Lan Shu spoke furiously, “Master, why didn’t you keep him? He is the one who killed my junior.”<br/><br/>Qu Tianshu gazed at the eastern horizon and said calmly, “If I can’t kill him, then there is no point in wasting my energy.”<br/><br/>Lan Shu’s eyes widened in shock and she was speechless.<br/><br/>She knew that her master had taken that step and become a warrior of the Unleaking Realm. Yet, that bastard was only at the Mana Realm.<br/><br/>Her master actually said he couldn’t kill him!<br/><br/>Was that guy really that strong?<br/><br/>After a while, she asked softly, “Master, aren’t we really going back to Linbin City? Will the East Sun Sword Saint harm my brothers?”<br/><br/>Qu Tianshu was silent for a while before he said, “When I inherited the legacy of the Heavenly Gang Mountain, I could no longer go back. Jian Fei and the others will have to rely on their own.”<br/><br/>Lan Shu sighed. After all, she had lived in Linbin City for more than ten years and had some feelings for her brothers.<br/><br/>She had entered the Golden Court Realm to find Master on elder brother’s request, but she had never expected things to turn out this way. They found the Master, but they could never return to Great Zhou.\t\t\t\t\t\t</div>", "images": {}, "success": true}