{"id": 314, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132228.html", "title": "Chapter 314 - Chapter 314: Go To Hell, 314", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 314 - Chapter 314: Go To Hell, 314</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 314: Go to hell, 314<br/><br/>After leaving Linbin City, Gu Yang did not return to Divine City but turned north instead.<br/><br/>To the north of Liangzhou lies Yunzhou, which is the Gao Family’s territory.<br/><br/>Last month, Gao Fan claimed he would retrieve the seal of the Nine Provinces, but there’s been no movement since then.<br/><br/>Moreover, despite all the Simulations he had run, Gao Fan had never handed the seal over to him, because he never learned a new Divine Law.<br/><br/>Evidently, something must have happened to Old Gao.<br/><br/>Before, he either lacked the power, or he was too busy.<br/><br/>Now, with the pursuit by Saint Chaoyang no longer a pressing concern and other matters having been mostly dealt with, he decided to go investigate the Gao Family.<br/><br/>Speaking of the Gao Family, among the nine named families under heaven, their history is exceptionally lengthy.<br/><br/>Like the Luo Family, the Gao Family was already a prominent and respected clan during the time of the Xia Dynasty, successive generations of officials.<br/><br/>It can only be said that the Gao Family’s patriarch has a remarkable ability to pick a side. Seeing the imminent collapse of the Xia Dynasty, he decisively changed allegiances, joining with the Red Sun.<br/><br/>Not only did this maneuver allow the clan to successfully escape annihilation, but it also made further strides. In the following millennium, it became one of the most distinguished families in the world.<br/><br/>The Gao Family has a rather low-key style and keeps to themselves in Yunzhou, rarely getting involved in matters of the martial world.<br/><br/>But this is merely an illusion. Whenever something truly significant happens, the Gao Family is always represented.<br/><br/>Five hundred years ago, at the battle against the Celestial Being from the Lin Family.<br/><br/>Eighteen years ago, at the battle against the Wu Family.<br/><br/>Both events had far-reaching impacts on Divine State, and the Gao Family participated in them.<br/><br/>It is said, the dog that bites does not bark, and the Gao Family is that biting dog.<br/><br/>Although Gu Yang felt that with his current cultivation level, he wouldn’t face much danger visiting the Gao Family, he decided to take precautions and activated the system to run a Simulation.<br/><br/>[At the age of twenty-two, you are already a mage with three levels of mana and a legendary Beastmaster. You killed the master of Red Venerate Church, Red Sun, shocking the world.]<br/><br/>[You head to Yunzhou to investigate Gao Fan’s whereabouts, but get entangled in the Gao Family’s internal disputes and quickly expose your identity, becoming besieged by the Gao Family’s strongest fighters.]<br/><br/>[You show your might, putting all the Gao family members in check. Two of Gao Family’s Unleaking Realm experts make their move, one of whom is Gao Fan, who does not hold back against you.]<br/><br/>[You battle against the two, defeating them. At this point, an unexpected twist occurs, a magic array traps you, Gao Fan’s body explodes, and an ominous power from another world yanks you away.]<br/><br/>[You are contaminated, and you die, aged twenty-two.]<br/><br/>Gao Fan advanced to the Unleaking Realm and attacked me?<br/><br/>Seeing this outcome, Gu Yang felt a chill in his heart.<br/><br/>Something undoubtedly happened to Gao Fan. It is most likely the work of the Red Sun.<br/><br/>He had experienced the power of the Red Sun’s “God Destroyer Nine Styles”. The first six moves of were normal, but the last three summoned the power of the Red Sun.<br/><br/>By then, the body and the Original Spirit would both start corroding. It wouldn’t be long before one would completely change.<br/><br/>Gu Yang had used the ninth move of the God Destroyer, and hence, was tainted by Red Sun’s power. Even now, he was unable to purge that power.<br/><br/>Gao Fan definitely noticed the enormous risk involved which was why he chose to seal his cultivation level.<br/><br/>But in an attempt to help him retrieve the seal of the Nine Provinces, Gao Fan returned to the Gao family, and his heart was corroded by the power of Red Sun.<br/><br/>“It seems that the Gao Family is profoundly controlled by that being, similar to the Red Venerate Church.”<br/><br/>Gu Yang recalled Cao Jing whom he had seen not too long ago.<br/><br/>Although also under Red Sun’s control, Cao Jing still had a semblance of free will and could make moves behind the scenes.<br/><br/>The plight of the Gao Family was far more wretched. Gao Fan was both mentally and physically controlled.<br/><br/>[The Simulation ended, and you can keep one of the following items.]<br/><br/>[…]<br/><br/>“I choose number two.”<br/><br/>Gu Yang had new memories of several battles stored in his mind.<br/><br/>The Divine Power Realm experts of the Gao Family were not worth mentioning.<br/><br/>The skills that Gao Fan and the other Unleaking Realm expert used were somewhat similar to the Wu Family’s God-Slaying Knife technique, which held great power and were incredibly unpredictable, affecting directly the Original Spirit. They, however, posed no threat to him.<br/><br/>The key was the Red Sun. Once it appeared, whether it was his Phoenix transformation, his Divine Ape, or his pet beast, the Red Eye Divine Ape, none of them stood a chance against it.<br/><br/>In a blink of an eye, both of his transformations and his pet beast were killed.<br/><br/>Afterwards, he was also contaminated by that terrifying power.<br/><br/>“The gap between the Unleaking Realm and the Celestial Being is simply too vast.”<br/><br/>Gu Yang gained a deeper understanding of the power of the Red Sun.<br/><br/>And that was the power transmitted from another world.<br/><br/>If he ever ended up in Red Dawn Sky, facing its real body, it would be even more terrifying.<br/><br/>…<br/><br/>“Forget about it, wait until I have enough power, then I can think of ways to remove the strange power within Old Gao.”<br/><br/>Since Gu Yang knew that Gao Fan had been controlled by contamination, going to Yunzhou had lost meaning.<br/><br/>With his current strength, even if he went, he wouldn’t be able to save anyone, but might instead get himself involved.<br/><br/>He changed his course, planning to return to Divine City.<br/><br/>While he was not around, he didn’t know if the women of the literary yard would start a fight.<br/><br/>He was least worried about everyone else – his primary concern was Cao Yiyi.<br/><br/>She was like a ticking time bomb that could explode at any moment.<br/><br/>Her power was also quite strong, her Void Immortal Vine appeared and disappeared without a trace. Even the magician, Zhou Zongye, might not able to stop her if caught off-guard.<br/><br/>Guy Yang quickened his pace thinking about this.<br/><br/>“It’s a legendary powerhouse.”<br/><br/>Suddenly, Eve behind him spoke with a warning.<br/><br/>Gu Yang was somewhat surprised at her words, and when he carefully sensed the situation in a certain direction, he could tell that something was wrong with the vitality of the world, but it was too distant for him to determine what was causing it.<br/><br/>Yet, she could assert that it was a legendary powerhouse.<br/><br/>In West Bank Continent, a legendary figure is equivalent to an Unleaking Realm.<br/><br/>Elves are known as Children of Nature, born mages, and it’s no exaggeration to say that they are sensitive to the energy of the world to this extent.<br/><br/>What surprised him even more was that she would actively speak to warn him.<br/><br/>This princess Elf had been indifferent, almost lifeless, since signing the Master-Servant Pact with him, and her mood had been extremely negative.<br/><br/>But for some reason, after he became the legendary Beastmaster in the literary yard, her attitude towards him changed a bit.<br/><br/>Now, she was even actively warning him.<br/><br/>Has she come to terms with it so quickly?<br/><br/>With curiosity in his heart, Gu Yang couldn’t help but fly towards that direction.<br/><br/>Unleaking Realm powerhouses each valued their lives and would not take action unless absolutely necessary, to avoid consuming their life force.<br/><br/>A thing valuable enough for an Unleaking Realm powerhouse to take action must be extremely precious.<br/><br/>Gao Family?”<br/><br/>After flying closer, Gu Yang finally sensed an explosive force, which was the same Unleaking Realm powerhouse from Gao Family that he had simulated in a fight memory previously.<br/><br/>Could it be…<br/><br/>A thought crossed his mind. He grabbed Eve’s hand, used the flying divine power of the Phoenix, and accelerated his speed several times over in an instant.<br/><br/>“Old Gao!”<br/><br/>From afar, he spotted Old Gao having his neck choked by someone, and without any hesitation, he took action.<br/><br/>A Phoenix True Fire completely engulfed the man from the Gao Family, who was already an Unleaking Realm.<br/><br/>Taken by surprise, Gao Zekun hadn’t expected a man to appear suddenly, and was instantly stricken. The raging fire carried a terrifying destructive power and ignited his mortal body.<br/><br/>He was shocked and started to use his mana, trying to extinguish the fire.<br/><br/>However, his mana ignited as soon as it made contact with the fire, feeding the flames. The fire only grew louder.<br/><br/>“Not Good!”<br/><br/>The fire engulfed everything. In just a few breaths, he had already lost some of his origins.<br/><br/>“Get out of my way!”<br/><br/>Gao Zekun roared angrily and his mana burst out fiercely, finally freeing him from the fire.<br/><br/>At this point, he was in quite a pitiful state. Not only were his clothes charred completely but even his hair and eyebrows were also burned off. His entire person was nearly turned into a charred briquette.<br/><br/>You could see his burned skin falling off and new skin growing rapidly.<br/><br/>He glaring relentlessly at the man, his eyes seemingly shooting fire. Between clenched teeth, he squeezed out two words, “Gu——Yang——.”<br/><br/>He recognized the man’s identity.<br/><br/>Not long ago, the ancestor had warned him about the news of Red Sun’s death. The one who killed Red Sun was indeed this Gu Yang.<br/><br/>“Die.”<br/><br/>With a loud bang.<br/><br/>Gao Zekun exploded without a moment’s hesitation, with him at the center, a black gas was unleashed in all directions.\t\t\t\t\t\t</div>", "images": {}, "success": true}