{"id": 316, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132233.html", "title": "Chapter 316 - Chapter 316: 316 Yellow Springs", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 316 - Chapter 316: 316 Yellow Springs</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 316: 316 Yellow Springs<br/><br/>[…Finally, he is thirty-one years old.]<br/><br/>The result of the simulation is similar to the previous one.<br/><br/>In the end, Gu Yang could not tame a divine beast of the Unleaking Realm.<br/><br/>In fact, on the Ruiqin Continent, most Beastmasters form contracts with beasts in their infant stage and gradually train them.<br/><br/>Adult beasts are wild and hard to tame, it is quite difficult.<br/><br/>With his current strength, killing a beast of the Unleaking Realm is tough, let alone capturing it alive.<br/><br/>Taming Yuan Xing was his fortune.<br/><br/>Most of its vitality was distracted by the amnesty order, and it couldn’t escape or fight. Its most potent Divine Power was restrained. In order not to die, it had to surrender willingly.<br/><br/>“It seems that this path is not feasible.”<br/><br/>Gu Yang shook his head. He originally planned to go to the Ruiqin Continent, tame two Unleaking Realm beasts to enhance his strength.<br/><br/>But now it seems that beasts are not that easy to tame.<br/><br/>He will have to find another way.<br/><br/>[Simulation ended. You are allowed to retain one of the options below. ]<br/><br/>[Option one: Martial Arts Realm at age 31.]<br/><br/>[Option two: Martial Arts experience at age 31.]<br/><br/>[Option three: Life wisdom at age 31.]<br/><br/>“I choose option one.”<br/><br/>Promptly, another Divine Beast, the Kirin, was added to his Ninth Sky Divine Law.<br/><br/>Gu Yang got up. He already knew what he should do next.<br/><br/>…<br/><br/>Outside the door, Eve was still pondering why Gu Yang’s body held the power of the Moon God.<br/><br/>Suddenly, the door opened, and he walked out and said to her, “Stay here, don’t follow me.”<br/><br/>As she was about to speak, he had already flown away and disappeared in the blink of an eye.<br/><br/>“Where is he going?”<br/><br/>Eve wanted to follow him. They had a contract. No matter where he went, she could sense his location.<br/><br/>However, in the end, she gave up this intention.<br/><br/>Unknowingly, her attitude towards Gu Yang had changed.<br/><br/>…<br/><br/>…<br/><br/>This time, Gu Yang did not bring anyone and left Divine City alone.<br/><br/>Because the place he was heading to was too dangerous.<br/><br/>That night, he arrived at Tianfang Mountain in Qi Province.<br/><br/>“Oh man, they’re on high alert, aren’t they?”<br/><br/>Gu Yang saw that Tianfang Mountain was garrisoned every few steps. The entire mountain was surrounded, and every short distance, a person of the Divine Power realm was stationed.<br/><br/>Looking at this situation, it was clear that they would not let any fly into Tianfang Mountain.<br/><br/>If he couldn’t sneak in, he would storm it.<br/><br/>Gu Yang no longer concealed his whereabouts and flew straight over.<br/><br/>“It’s you!”<br/><br/>Among the people defending Tianfang Mountain, the highest in cultivation level was Luo Wenxuan, a transcendental elder of the third mana stage. He was an important figure of the Luo Family.<br/><br/>Last time, when Gu Yang had killed the corrupted Luo Yaowu, it was this person who arrived first.<br/><br/>Luo Wenxuan was astonished. In just more than a month, how had this man become so powerful?<br/><br/>He stood on the peak, looking at the rapidly approaching man. His face changed, but he did not have the courage to draw his sword.<br/><br/>Not only him, but no one in the Divine Power realm on Tianfang Mountain tried to stop him.<br/><br/>Stopping such a powerful man was no different than committing suicide.<br/><br/>Since the powerful Luo Wenxuan did not do anything, why should they?<br/><br/>Just like that, everyone saw Gu Yang walk into Tianfang Mountain confidently and disappear into the void, heading to that cave world.<br/><br/>…<br/><br/>…<br/><br/>Gu Yang returned to the Yellow Springs cave world.<br/><br/>This was also a forced choice. He cannot go to the Shuiyue Cave World. The people of Ancient River Sword Sect were waiting for him to appear and then take revenge on him. The Nascent Souls would come first, and after they were all wiped out, the Incarnation Realm would come. He couldn’t bear it.<br/><br/>The entry to the Golden Court Cave World was blocked by the Sword Saint of East Sea. Forcing his way in was not going to be easy.<br/><br/>The Sword Saint of East Sea put a lot of pressure on him, which was not comparable to the average Unleaking Realm power.<br/><br/>So, Gu Yang had to go to the Yellow Springs Cave World.<br/><br/>This time, he aimed to cultivate his energy.<br/><br/>“What a terrifying world.”<br/><br/>Once again, he felt the omnipresent poison, permeating the air. Just breathing in and exhaling could cause irreversible damage, not to mention cultivation.<br/><br/>In this world, the higher the realm, the sooner one dies.<br/><br/>He not only stopped breathing but also used a layer of mana to isolate the poisonous heaven and earth vitality.<br/><br/>Just to avoid contamination unknowingly.<br/><br/>As he thought about this, the ground suddenly shook.<br/><br/>A terrifying breath emanated from the depths of the earth.<br/><br/>“It’s here!”<br/><br/>He was familiar with that breath, as it belonged to an old “acquaintance”. It was the Unleaking Realm monster that chased him out of the cave world last time, almost turning Great Zhou into a second Yellow Springs.<br/><br/>“Huh? Why did he come?”<br/><br/>Gu Yang sensed a familiar breath and was taken aback.<br/><br/>Just as he was thinking, the monster beast paused for a moment and suddenly left him, flying towards one direction.<br/><br/>It’s not going to kill me anymore?<br/><br/>He became curious. The direction the monster beast was heading to was just where the familiar breath originated.<br/><br/>Something went off in his mind, and he followed suit.<br/><br/>…<br/><br/>…<br/><br/>“It’s awful, that monster beast woke up ahead of schedule.”<br/><br/>Elsewhere, in Heiming Valley, two people were advancing in a cave. The face of one of them changed, and he said,<br/><br/>Half of this man’s body had turned into a monster, while the other half still resembled a human. He held a somewhat dim long sword in his hand. It was Daoist Muhuang.<br/><br/>He had fled the Muhuang City and came here for unknown reasons.<br/><br/>He said, “Brother Murong, if the monster appears, you must block it. Just hold it off for a few moments.”<br/><br/>The man next to him named Murong looked normal, but some subtle details still revealed the inhuman side of him.<br/><br/>Both of these men were cultivators in the Nascent Soul stage.<br/><br/>In the Yellow Springs Cave World, with their cultivation level, they could lose control at any time due to contamination.<br/><br/>The fact that a man named Murong could maintain this form indicated that his contamination level was extremely low.<br/><br/>He said angrily, “Didn’t you say that the monster had lost some of its power and needed to sleep? Why did it suddenly wake up?”<br/><br/>Daoist Muhuang calmly said, “There’s no use complaining at this point. We should think of a way to open the cave residence as soon as possible.”<br/><br/>Murong said coldly, “You better not try anything sneaky!”<br/><br/>While they were talking, the monster beast approached.<br/><br/>“I found it, right here!”<br/><br/>A trace of excitement appeared in Daoist Muhuang’s voice. He picked up a jade pendant, which no longer showed the lustrous light of jade and had turned grey.<br/><br/>He poured his precious mana into it, and saw this simple and unadorned jade pendant lighting up a colorful light, which all went into a smooth stone wall opposite.<br/><br/>With a rumble, a door appeared on the smooth stone wall.<br/><br/>Pure Spirit Qi rushed towards them, intoxicating these two Nascent Soul cultivators who hadn’t experienced such pure Spirit Qi for many years.<br/><br/>Just at this moment, the monster beast arrived, frantically rushing towards Daoist Muhuang.\t\t\t\t\t\t</div>", "images": {}, "success": true}