{"id": 318, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132237.html", "title": "Chapter 318 - Chapter 318: Ancient Heritage House 318", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 318 - Chapter 318: Ancient Heritage House 318</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 318: Ancient Heritage House 318<br/><br/>Gu Yang hurried to where the battle was taking place, easily dispatching any sporadic monsters he encountered on the way.<br/><br/>Shortly, he arrived on the scene and saw two powerful cultivators at the Nascent Soul stage joining forces against several dozens of monsters, utilizing a flying sword and a massive ruler.<br/><br/>Among them was Daoist Muhuang, half of whose body had already been mutated into a beast. Beside him stood another unfamiliar cultivator, a layer of blue scales growing on his forehead.<br/><br/>Behind the two of them lay a cave, lush with green grass and filled with bird songs and floral fragrances. Amidst the desolate environment of Yellow Springs, this place seemed like a paradise on earth.<br/><br/>A surge of incredible Spirit Qi flowed out from the cave and was quickly corrupted, transforming into a swirling column of black mist that rose into the sky, forming a vast cloud of darkness.<br/><br/>It was these black clouds that attracted the surrounding monsters, causing them to swarm to the cave.<br/><br/>The two Nascent Soul cultivators were formidable, their frosty sword piercing a hole into the body of the beast each time it flew out.<br/><br/>Equally impressive was the massive ruler, emitting a yellow light that stopped all the external monsters dead in their tracks.<br/><br/>By joining their efforts, the two managed to fend off the monsters, but couldn’t kill them effectively. In particular, the Unleaking Realm monster would instantly recover once the frosty sword pierced its body.<br/><br/>The monsters grew increasingly fierce, whereas the two Nascent Soul cultivators were weakening, slowly becoming unable to withstand the massive amount of energy they were expending.<br/><br/>For them, Mana was extremely precious. Once it was depleted to a certain extent, they would have to absorb vitality from the world or consume an Elixir to restore it, which would inevitably increase the level of contamination in their bodies.<br/><br/>If this carried on, they wouldn’t necessarily die by the hands of the monsters, yet the overwhelming pollution would eventually lead to a loss of control, resulting in their grim fate.<br/><br/>In the Yellow Springs, cultivators were at a distinct disadvantage, unable to unleash even a fraction of their full power and left constrained. Up against monsters of the same level, death was the only outcome.<br/><br/>Both of them struggled on, inwardly filled with lamentation.<br/><br/>They both knew that if they dragged on this way, death was inevitable.<br/><br/>The cultivator named Murong roared out, “Quickly think of a solution, or else, we will all die here.”<br/><br/>Just as Daoist Muhuang, with a grave expression, was about to speak, his face changed abruptly. He swiftly turned his head and saw a man he would never have expected.<br/><br/>Is it him?<br/><br/>His heart throbbed, recognizing the figure as Gu Yang, who he had met two months ago in Muhuang City.<br/><br/>The man was still alive!<br/><br/>What’s more, he was here!<br/><br/>Adding to his astonishment was the fact Gu Yang seemed no different from two months ago and seemingly unaffected by the pollution.<br/><br/>How could this be possible?<br/><br/>He should have exhausted all of his Mana after spending two months in this world, particularly in the wilderness. To restore Mana, he would certainly be polluted.<br/><br/>Daoist Muhuang’s heart pounded as he shouted, “Gu Yang, I beg you to lend us your power. With our combined strength, we can eliminate this beast. The treasures within this ancient Immortal’s cave will be shared equally among the three of us.”<br/><br/>Murong, standing nearby, also noticed that someone else was present. The moment he set eyes on Gu Yang, his pupils constricted.<br/><br/>There was actually someone in this world who hadn’t been tainted at all, with both his Mana and body in a flawless state.<br/><br/>Instantly, a certain possibility crossed his mind. A touch of complexity flickered within his eyes as he stated, “I agree with Daoist Muhuang’s proposal. As long as we can get rid of this monster, everything inside can be shared evenly.”<br/><br/>Then he added, “If you have any doubts, we can swear an oath.”<br/><br/>…<br/><br/>“No need!”<br/><br/>Gu Yang eyed the group of monsters, his Phoenix Feather Knife itching to be used. He gripped his beloved weapon and charged into the fray.<br/><br/>With each swing of his blade, numerous Golden Body Realm monsters were annihilated.<br/><br/>Like a tiger among a flock of sheep, he effortlessly obliterated over half the swarm in the blink of an eye.<br/><br/>Daoist Muhuang and Murong, standing not far off, watched in stupefaction. They had never seen anyone kill monsters so effortlessly.<br/><br/>These monsters were notoriously hard to kill and, without any discernible weak spots, had to be gradually worn down with Mana.<br/><br/>Even for them, defeating a Golden Core Realm monster required a tremendous amount of Mana.<br/><br/>That was precisely why, unless absolutely necessary, they wouldn’t strike lightly.<br/><br/>Each attack significantly increased the extent of their pollution, and who could withstand that pressure?<br/><br/>This is also the main reason why human cultivators are continuously retreating, almost on the brink of extinction.<br/><br/>No, it’s not that they’ve never seen it.<br/><br/>Murong recalls that in the past, when the sun had just fallen, those senior experts fought against the monsters in such a swift and decisive manner. However, as these strong figures disappeared, leaving behind those barely hanging on, they no longer possessed such capabilities.<br/><br/>Yet, this young man is only in the late stage of the Golden Core, why is his mana so powerful, on par with the Nascent Soul stage?<br/><br/>Even before the fall of the sun, such individuals were extremely rare, weren’t they?<br/><br/>As he was pondering, he saw the man took two more strokes to slay two monsters at the Golden Core stage, using only two more strokes than he did when he faced the monsters at the Foundation Establishment Stage.<br/><br/>Such a scene, unexpectedly stirred a surge of boiling blood within him.<br/><br/>How invigorating!<br/><br/>For so many years, humans could only retreat under the pressure of monsters, losing most of their territory.<br/><br/>Often, when monsters attacked, the higher-ups chose to retreat without fighting.<br/><br/>Now, it seems that there’s no place left for retreat.<br/><br/>The common scene now is a few monsters at the Golden Core stage can scare away a cultivator at the Nascent Soul stage.<br/><br/>Murong has retreated too many times in the face of these monsters.<br/><br/>He originally thought that his heart had become numb, until this moment. Watching the young man single-handedly disintegrating the army of dozens of monsters, his heart suddenly felt a surge of heat.<br/><br/>After the heat subsided, he felt a sense of sorrow.<br/><br/>Fighting in such a way is exciting indeed, but once that man’s mana is exhausted and needs to recover, he can only draw upon the vitality between heaven and earth at that time, and he will be contaminated.<br/><br/>No matter how outstanding his talents are, once contaminated, he will become like them, neither human nor ghost, with his path to Dao cut off.<br/><br/>As he was thinking about this, that man swiftly and decisively slaughtered all the dozens of monsters.<br/><br/>Just as he expected, the man’s mana had been consumed tremendously.<br/><br/>“Take action!”<br/><br/>However, the man showed no sign of stopping. He once again raised his knife, summoning the last of his mana to strike at the monster in the Nascent Soul stage.<br/><br/>Regardless of whether it was Daoist Muhuang or Murong, with the realm they have reached now, their ability to seize the opportunity in battle is undoubtable.<br/><br/>The two communicated tacitly and practically used their last resort at the same time.<br/><br/>You could see the frosty sword split into three, piercing the monster, and a cold air that could freeze the air spread out. The monster seemed to be frozen, its movements momentarily stagnating.<br/><br/>At the same time, that giant ruler fell, pressing against the monster’s massive skull, flattening it, ready to explode at any moment.<br/><br/>Immediately after, Gu Yang’s Phoenix Feather Knife arrived. The Phoenix Feather Knife was engulfed in raging flames, slashing solidly onto the monster’s body.<br/><br/>The monster’s resentful face twisted, letting out a shrill scream that was indistinct.<br/><br/>The three men present were all enveloped by the shockwave of the sound, and before their eyes went black, their Original Spirits slightly shook.<br/><br/>Boom!<br/><br/>The huge skull shrunk continuously under the Phoenix’s true fire, and in a moment, it was the size of a normal human skull. The look of resentment on the face also disappeared.<br/><br/>That face was unmistakably identical to “Daoist Muhuang”.<br/><br/>Looking at that face, Gu Yang knew his guesses were correct. This monster was indeed the manifestation of the Original Spirit of the body that claimed itself to be Daoist Muhuang.<br/><br/>[You have gained one hundred points of energy, current balance is nine hundred and fifteen points.]<br/><br/>In other words, this monster from the Unleaking Realm is equivalent to a cultivator at the Unleaking Realm stage.<br/><br/>Gu Yang was thinking inwardly, feeling somewhat overjoyed. Farming in this manner, it simply feels too good.<br/><br/>Suddenly, he sensed a hint of danger in his heart, raised his head and saw the frosty sword hanging in front of him, the point of the sword aimed at him, ready to strike at any moment.<br/><br/>He looked at “Daoist Huangmu” whose half-body had already turned into a monster, and asked, “Daoist Huangmu, what does this mean?”<br/><br/>The eyes of “Daoist Huangmu” were somewhat bloodshot, and he said excitedly, “Take me out of Yellow Springs Celestial Cave, back to Great Zhou, and I won’t kill you.”<br/><br/>Gu Yang said, “So, you really are Luo Kun!”\t\t\t\t\t\t</div>", "images": {}, "success": true}