{"id": 315, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132230.html", "title": "Chapter 315 - Chapter 315: 315 Disposal", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 315 - Chapter 315: 315 Disposal</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 315: 315 Disposal<br/><br/>This madman!<br/><br/>Gu Yang cursed silently, without hesitation, transformed into a Phoenix along with Eve and Gao Fan, and flew away as fast as possible.<br/><br/>He never expected that a strong being in the Unleaking realm would resort to self-destruction from the beginning, without even engaging in combat, and in this way, attract the attention of that being from Red Radiant Heaven.<br/><br/>As it turned out, when a strong Unleaking realm being is ready to give up their life, it becomes quite terrifying. Especially when there is an existence above the Celestial Being realm standing behind them.<br/><br/>With a whoosh, in the blink of an eye, Gu Yang and the others managed to escape a few dozen miles away, completely out of the blast radius.<br/><br/>“Huh?”<br/><br/>Suddenly, he realized something was wrong. That terrifying aura hadn’t arrived yet.<br/><br/>Normally, it wouldn’t take this long.<br/><br/>Eve, who was behind him, reminded him, “He ran away.”<br/><br/>So that was it!<br/><br/>Gu Yang suddenly realized, and despite the opponent, he had to admire his decisiveness.<br/><br/>The explosion was fake, but escaping was real.<br/><br/>The man had managed to judge the gap in their powers in such a short time and wasn’t fooled by his Mana realm cultivation level, deciding to cut off his arm to save his life.<br/><br/>Such decisiveness was simply unprecedented in his life.<br/><br/>That previous explosion had cost the man at least a hundred years of his lifespan. How ruthless!<br/><br/>Gu Yang asked Gao Fan, “Who was that man?”<br/><br/>Gao Fan replied weakly, “My ninth brother, Gao Zekun.”<br/><br/>Gao Zekun.<br/><br/>He made a note of the name.<br/><br/>He mockingly said, “I didn’t expect your cultivation level to be so high.”<br/><br/>“You brat, if it weren’t for you, I wouldn’t be in this situation,” Gao Fan said grumpily.<br/><br/>His cultivation level had now recovered to the third layer of the Mana realm. But after being breeched by a surge of Mana from Red Radiant Heaven by Gao Zekun, the Mana in his body seemed activated and was now extremely active.<br/><br/>Though he was trying hard to suppress it, the effect wasn’t great.<br/><br/>If this went on, it wouldn’t be long before all the Mana in his body was polluted. His Original Spirit would also be affected, gradually losing self-awareness.<br/><br/>As for this situation, Gu Yang was powerless.<br/><br/>Even he himself, who had been marked by one from Red Radiant Heaven, was helpless.<br/><br/>Let alone the situation Gao Fan was now facing.<br/><br/>Gu Yang reassured him, “Don’t worry. Once I master the sword technique passed down to me from the dean, I’ll be able to save you.”<br/><br/>However, Gao Fan held little hope for that. Although Gu Yang had shown an incredible talent, he studied the Saber Technique. Gaining proficiency in both the saber and sword technique wouldn’t be easy.<br/><br/>Dean Wen had hung a single sword technique at the top of Star Picking Pavilion for hundreds of years. Many talented youths and swordsmanship geniuses had tried, but till now, no one had mastered it.<br/><br/>That was just the entry-level test. The real sword technique was undoubtedly a hundred times more difficult.<br/><br/>Even if Gu Yang could create another miracle and master that sword technique, who knew how long that would take.<br/><br/>He wouldn’t be able to last that long.<br/><br/>Gao Fan didn’t say anything, he took out the Nine Provinces Seal and handed it over, “Here, for you.”<br/><br/>Gu Yang took the seal, it was the eighth one.<br/><br/>Gao Fan held his hand and said, “Promise me, you must kill that Divine Emperor.”<br/><br/>The Divine Emperor he was referring to was the one from Red Radiant Heaven.<br/><br/>Gu Yang seriously said, “I promise you.”<br/><br/>The grudge between him and the one from Red Radiant Heaven had escalated to a life and death scenario. Even if Gao Fan hadn’t said it, he would have tried to take that guy down.<br/><br/>And it wouldn’t be too long before that happened.<br/><br/>Gu Yang didn’t chase after Gao Zekun. He didn’t possess the divine power of seeing and hearing everything, and had already lost track of him.<br/><br/>Besides, if pushed too far and incase he decided to self-destruct, that would actually invite trouble by drawing the one from Red Radiant Heaven here.<br/><br/>He wasn’t ready to fight him just yet.<br/><br/>…<br/><br/>When Gu Yang and his companions returned to Divine City, upon reaching the Academy of Letters, they saw a stranger, wearing a long green robe, dust-covered boots, standing at the entrance whom they immediately recognized as a strong being in the Unleaking Realm.<br/><br/>He recognized him immediately! Li Yuan, the dean’s eldest disciple and the only Unleaking Realm practitioner in the Academy of Letters, excluding the dean himself. Known for his belief in reading tens of thousands of books and traveling thousands of miles, he had left the Academy about a hundred years ago and traveled the world.<br/><br/>Once he had left, he never returned, and no one knew where he had gone.<br/><br/>Even when the dean had a fierce battle with the one from Red Radiant Heaven in the Limitless Mountains, where both sides were badly hurt, he hadn’t shown up.<br/><br/>Surprisingly, he had returned at this turbulent time.<br/><br/>In this turbulent era, having one more Unleaking realm practitioner was undoubtedly a great thing for the Academy of Letters.<br/><br/>Next to Li Yuan stood Zhou Zongye, along with a group of professors from the Academy of Letters, who all looked as if they were facing a formidable enemy.<br/><br/>They were naturally not on guard against Gu Yang, but rather Gao Fan who was beside him.<br/><br/>At this time, Gao Fan’s internal Mana was under constant attack, and he could lose his self-awareness at any time, becoming a puppet of the being from Red Radiant Heaven.<br/><br/>As the dean’s archenemy, no one in the Academy dared to let their guard down.<br/><br/>Li Yuan spoke, “Mr. Gao, please accompany me to meet my mentor.”<br/><br/>“Alright.”<br/><br/>Gao Fan was also aware of his current situation and didn’t resist.<br/><br/>Even if Li Yuan killed him on the spot, he wouldn’t hold any resentment.<br/><br/>Dying at the hands of the Academy was better than being overwhelmed and turned into a mindless puppet.<br/><br/>Gu Yang said, “Coincidentally, I have some matters to report to the dean as well.”<br/><br/>Zhou Zongye, who was on the side, was about to speak when Li Yuan nodded his head in agreement, “Alright.”<br/><br/>The reason Gu Yang wanted to go along was out of worry that they might kill Gao Fan halfway.<br/><br/>He owed Gao Fan a great favor and naturally couldn’t just stand by.<br/><br/>The three of them immediately headed for Star Picking Pavilion and quickly entered the peculiar space.<br/><br/>This time, Eve was left outside.<br/><br/>…<br/><br/>As soon as the dean saw Gao Fan, he simply said, “You may stay here.”<br/><br/>Gao Fan immediately nodded in agreement.<br/><br/>Gu Yang did not show any reaction.<br/><br/>At this point, Gao Fan was like a ticking time bomb, and no one knew when he would explode. Leaving him with the dean was for the best.<br/><br/>Considering the dean’s stature, he probably wouldn’t stoop to the level of murdering witnesses to eliminate hidden dangers.<br/><br/>After leaving the space, Gu Yang returned to the courtyard and opened the system.<br/><br/>[Do you wish to use the Life Simulator? One use consumes forty energy points.]<br/><br/>“Yes.”<br/><br/>He had a sense of urgency in his heart; he had to swiftly advance in power.<br/><br/>[Twenty-two years old…]<br/><br/>[You have mastered the first level of the “Divine Qilin Technique”. Later, along with several women, you head to the Continent of Ruiqin with the intention of subduing a Unleaking realm Monster Beast. After several years of twists and turns, you haven’t succeeded even once.]<br/><br/>[Your existence has caught the attention of the Celestial beings’ strong practitioners, and you have been forced by one of the Celestial being practitioners. Two Divine Beast incarnations are taken as their pets…]&gt;<br/><br/>PS: Request for monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}