{"id": 313, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132225.html", "title": "Chapter 313 - Chapter 313: 313 The Eighth Seal Of The Nine Provinces", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 313 - Chapter 313: 313 The Eighth Seal Of The Nine Provinces</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 313: 313 The Eighth Seal of the Nine Provinces<br/><br/>At the border of Yunzhou and Liangzhou, amidst the ranges. Two shadows were in hot pursuit – one chasing and the other fleeing.<br/><br/>The red figure chasing from behind didn’t seem in a hurry, much like a cat playing with a mouse, he taunted, “Third brother, you haven’t progressed at all over these years.”<br/><br/>“Once upon a time, everyone said you were the most talented disciple of the Gao Family in a millennium. Now, how come you can’t even beat me?”<br/><br/>“Oh, I almost forgot. You, third brother, are so aloof, looking down on the Gao Family and despising Gao Kong’s methods. As a result, you suppressed your own cultivation level and hid away.”<br/><br/>“However, if you despised our Gao family so much, why did you sneak back to steal something?”<br/><br/>The pursuer’s tone was incredibly mocking.<br/><br/>However, the one being chased ran desperately, turning a deaf ear to the pursuer’s words.<br/><br/>“Oh third brother, I can hardly believe that you, of all people, would stoop to such treachery, acting against your own family.”<br/><br/>“You’re trying to steal this Nine Provinces Seal for Gu Yang, aren’t you? I heard that boy has mastered the ‘Nine Heavens Divine Method’. He must be the descendant of the Xia Emperor.”<br/><br/>“Tsk tsk tsk… Our ancestor betrayed the Xia Emperor back in the day. Are you trying to atone for his sins?”<br/><br/>…<br/><br/>The two pursuing figures were Gao Zekun and Gao Fan.<br/><br/>After parting with Gu Yang in Divine City, Gao Fan secretly went to the Gao Family to seek help from his closest niece.<br/><br/>The niece, who was raised by him and taught martial arts, was absolutely loyal to him.<br/><br/>Currently, she was a key figure in the Gao family with a cultivation level of the Third Mana Realm.<br/><br/>All was going well and the Nine Provinces Seal was nearly in their possession. However, things went awry at the last moment and their trace was discovered by ninth brother, Gao Zekun.<br/><br/>Gao Zekun did not alarm the family members but chose to chase after them alone.<br/><br/>With no choice left, Gao Fan was forced to lift his self-imposed seal, restoring his cultivation level to the Third Mana Realm. Despite trying everything, he couldn’t shake off his ninth brother.<br/><br/>He knew he was likely going down this time.<br/><br/>His ninth brother was completely surpassing him, breaking through the Unleaking Realm.<br/><br/>Their grudge, sown during their days in the Mortal Realm, had now grown into a towering tree.<br/><br/>Back then, amongst the same generation in the Gao family, two unprecedented geniuses emerged – these two.<br/><br/>However, regardless of cultivation level or Sword Technique, he always had the upper hand over his ninth brother.<br/><br/>Later on, he received the family’s support and their allocated resources, which continued to widen their gap.<br/><br/>Not until he broke through to the Third Mana Realm did he notice a huge defect in the family’s technique; an imminent and terrible disaster would occur once he broke through to the Unleaking Realm.<br/><br/>Realizing the danger, Gao Fan decided to suppress his cultivation level and lived incognito.<br/><br/>…<br/><br/>“Speaking of which, I must thank you, third brother. If not for your betrayal, I might never have broken through to this realm.”<br/><br/>A twisted look of excitement appeared on Gao Zekun’s face.<br/><br/>For over a hundred years of his life, he had been living in the shadow of his third brother.<br/><br/>People remembered only the name of his third brother, while he was forever just a foil.<br/><br/>When people spoke of the Gao Family, they would praise only the outstanding talent of his third brother. All the glory and honor fell upon him.<br/><br/>No matter how hard he practiced, he could never catch up.<br/><br/>Each time he made a little progress, he found that his third brother had made an even bigger leap.<br/><br/>He watched helplessly as the gap between them grew. Until one day, the third brother broke through to the Mana Realm, forever widening the gap.<br/><br/>He was completely immersed in despair.<br/><br/>He thought he would spend his entire life living in the shadow of his third brother.<br/><br/>Unexpectedly, just when the third brother was about to break through to the Unleaking Realm, he inexplicably gave up and disappeared without a trace.<br/><br/>With this eyesore gone, the gloom in his heart seemed to be swept away.<br/><br/>Soon after, he gained the support of his family, and his cultivation level progressed rapidly.<br/><br/>A few years ago, he even successfully broke through to the Unleaking Realm, becoming one of the strongest in the world.<br/><br/>Several days ago, Gao Zekun returned to his family on a whim and saw a familiar figure.<br/><br/>It was his third brother!<br/><br/>Finding the person who once overshadowed him at the peak of his life – could there be anything more exciting?<br/><br/>He kept silent, following quietly until the moment when the latter thought he had succeeded – that was when he suddenly revealed himself.<br/><br/>Seeing the shock on his face, he couldn’t help but feel an overwhelming pleasure.<br/><br/>He wanted his third brother to taste the despair he once these.<br/><br/>All the way, Gao Zekun played cat-and-mouse, shattering the latter’s hope every time he thought he could escape. Again and again.<br/><br/>Just like back then, when he felt despair time and time again in front of this man.<br/><br/>…<br/><br/>“Why aren’t you speaking?”<br/><br/>Suddenly, Gao Zekun becomes somewhat irritated and strikes abruptly.<br/><br/>In the air, a massive imprint of a fist emerges, hitting Gao Fan squarely in the back, hurling him away and crashing into a mountain peak miles away, creating a deep pit.<br/><br/>Whizz!<br/><br/>Gao Zekun appears beside the pit, looking at Gao Fan inside and says, “Do you regret missing such a great opportunity to reach the Unleaking Realm?”<br/><br/>“Pah!”<br/><br/>In the pit, Gao Fan spits out a mouthful of blood, looking at him with somewhat sympathetic eyes, saying, “Little brother, haven’t you noticed? You’re not yourself anymore. You weren’t like this before…”<br/><br/>Before he can finish speaking, a foot enlarges in front of his eyes.<br/><br/>With a loud explosion, his vision goes black, and he feels himself uncontrollably plummeting down.<br/><br/>Even at his Cultivation Level, he’s somewhat unable to withstand such incredible force, his head spinning violently.<br/><br/>Opening his eyes, he sees Gao Zekun’s face right in front of him.<br/><br/>“Oh, third brother, how could you be so foolish? In this world, everything is an illusion, only power is real.”<br/><br/>“If you had such power, I would be the one lying on the ground.”<br/><br/>A layer of black light appeared in his eyes, chilling to the bone.<br/><br/>At that moment, Gao Fan feels a void in his hand; the Nine-Province Seal that he had been gripping was taken away, and he couldn’t help but sink in his heart.<br/><br/>He ran such great risks returning to the Gao Family this time just for this Nine-Province Seal. He had managed to steal it with much difficulty, only to lose it all in the end.<br/><br/>After Gao Zekun took back the Nine-Province Seal, it would be incredibly difficult for Gu Yang to get it again.<br/><br/>Without the Nine-Province Seal, his “Nine Heavens Divine Method” will never be accomplished.<br/><br/>…<br/><br/>Gao Zekun finally sees a look of terror in his eyes. Displaying the Nine-Province Seal in front of him, he says, “So, that guy Gu Yang sure is important to you.”<br/><br/>“Just for him, you broke fifty years of persistence.”<br/><br/>Fifty years ago, Gao Fan had sealed his Cultivation Level, not letting the Gao family trace his whereabouts, not even the Supreme God could find him.<br/><br/>For a full fifty years, the Gao family had been searching for him but got nothing.<br/><br/>And now, he had handed himself in.<br/><br/>And the goal was merely the Nine-Province Seal.<br/><br/>Gao Zekun stares into his eyes, elated, knowing he had finally hit his weak spot.<br/><br/>“Don’t tell me you’re pinning your hopes on the boy to defeat the Supreme God. How naive! The Xia Emperor of the past even lost to the Supreme God, let alone a small child at the Mana realm.”<br/><br/>“By the time he completes the Nine Heavens Divine Method, the Supreme God would have already unified the world.”<br/><br/>Gao Fan feels a cold force invading his body; his Mana, suppressed for fifty years, starts to become cold under the influence of this force.<br/><br/>His Original Spirit is also affected, a sense of numbness from the cold).<br/><br/>This is bad!<br/><br/>After hiding for fifty years, he is still unable to escape this destiny.<br/><br/>Fifty years ago, Gao Fan realized there was a huge problem with the cultivation method he was practicing.<br/><br/>Back then, when he broke through to the third realm of Mana, the ancestor said he would hold a ceremony for him to help him step into the Unleaking Realm.<br/><br/>He sensed something was amiss – the Unleaking Realm involved opening a person’s hidden body, and it should only rely on oneself, not external assistance.<br/><br/>Gao Fan knew that once the ceremony was held, he would no longer be himself.<br/><br/>The ultimate goal of his cultivation was to turn the body into a vessel that can contain the power of the Supreme God.<br/><br/>When the power of the Supreme God crosses the realm and infuses into his body, his fate would be to become an avatar of the Supreme God.<br/><br/>Just like the ancestor and his forefathers in the family.<br/><br/>Gao Fan didn’t want to end up like that, so he promptly left the Gao family, took flight far away, and then sealed off his Cultivation Level. He hid his identity.<br/><br/>Now, having no choice, he lifted the seal. After being caught up by Gao Zekun, the Supreme God was unwilling to let him go.<br/><br/>This time, it’s really over.<br/><br/>Gao Fan laughs bitterly in his heart.<br/><br/>“Gu Yang, I hope you can get rid of that guy in the future…”<br/><br/>Suddenly, a crimson flame soars, engulfing Gao Zekun.<br/><br/>The Phoenix True Fire!<br/><br/>Gao Fan breaks free from the icy force’s control in an instant, his heart filled with both shock and joy. He turns around and sees a familiar figure – it’s Gu Yang, the lad, accompanied by a beautiful woman from a foreign tribe.<br/><br/>That stinky boy, wherever he goes, beautiful women always follow him.<br/><br/>PS: It’s been a bit hard to write, there are only two updates today. I will now straighten out the outline of the plot.\t\t\t\t\t\t</div>", "images": {}, "success": true}