{"id": 310, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132220.html", "title": "Chapter 310 - Chapter 310: Legend 310", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 310 - Chapter 310: Legend 310</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 310: Legend 310<br/><br/>Outside the door, the elf princess, Eve, stood under the eaves, staring blankly at the sky beyond the courtyard walls. Dark clouds were gathering; a storm was brewing.<br/><br/>Ever since she made her vow to the god, becoming that man’s slave, her heart had already died.<br/><br/>Now, only an empty shell was left.<br/><br/>For elves, once the heart is dead, the individual won’t live long.<br/><br/>What’s supporting her now is her concern for the Mother Tree of the elves.<br/><br/>She wanted to know if the Mother Tree could be revived.<br/><br/>Sshe didn’t care about what that man was doing or what he wanted to do.<br/><br/>The moment she made the vow, she had already made all psychological preparations.<br/><br/>Suddenly, a strange aura emanated from inside the house.<br/><br/>Eve jolted, turning her head sharply towards the house. Her previously blank face turned into shock.<br/><br/>The power of the Goddess?<br/><br/>How could that be possible?<br/><br/>She clearly felt that from that man inside the house, there was a fluctuation of the Goddess’s power.<br/><br/>Though it was faint, she felt it very clearly.<br/><br/>No, she must be mistaken.<br/><br/>How could that wicked summoner be favoured by the Goddess?<br/><br/>The Moon God is the unique faith of the elves, also known as the God of Elves. There are a few human followers, but the Moon God favors the pure-hearted elves. No human has ever been favored by the Moon God and received power.<br/><br/>All the priests of the Church of the Moon God are among the elves.<br/><br/>Although she is not a priest, she has been favored by the Moon God since her birth. The mark on her forehead is the sign of the Moon God. She could be considered the Saintess of the Church of the Moon God.<br/><br/>Not only is that man a human, but he is also a summoner, greedy and evil – the kind of person that the Moon God detests the most. How could he have the power of the Goddess?<br/><br/>Despite what she was thinking, after this incident, Eve couldn’t help but pay more attention to the man inside the house.<br/><br/>Half a moment later.<br/><br/>The aura appeared again, several times stronger than before.<br/><br/>“It’s really the Goddess!”<br/><br/>Eve’s face changed drastically.<br/><br/>This time, her spirit was highly concentrated, she would not sense it wrong.<br/><br/>She was all too familiar with the Goddess’s power.<br/><br/>How could this be?<br/><br/>Under no circumstances could she figure out how this human could be favored by the Goddess.<br/><br/>The power of the gods is completely different from the magic, magicians, swordsmen, and other professions. To obtain the power of the gods, the prerequisite is to get the approval of the gods.<br/><br/>He is a human.<br/><br/>And, this is not the West Bank Continent where the gods live, but the faraway Divine State Continent, a land of non-believers, where divine power doesn’t exist.<br/><br/>Just as Eve was shocked and clueless, somewhat at a loss.<br/><br/>The Goddess’s power on the man in the house exploded once again. This time, it was several times stronger than before.<br/><br/>He is now equivalent to a middle-rank priest.<br/><br/>Eve was utterly confused, couldn’t understand what had happened at all.<br/><br/>After a while, the man once again displayed the Goddess’s power, and this time, he directly escalated to the level of a high-rank priest.<br/><br/>This was middle-upper level in the elf clan.<br/><br/>Eve was beyond shocked.<br/><br/>Generally, the birth of a high-ranking priest requires a grand ceremony presided over by the high priest in front of the temple, in order to receive the Goddess’s response and thus be promoted.<br/><br/>…<br/><br/>Finally, the door was pushed open from the inside, and the man walked out.<br/><br/>The power of the Goddess never showed up again. But merely the power of a high-ranking priest was enough to shock this elf princess.<br/><br/>Watching the man who had become her master, she wanted to ask him what happened but couldn’t bring herself to.<br/><br/>Gu Yang walked out feeling refreshed, only to see the elf princess looking a bit strange, seemingly wanting to say something but hesitating.<br/><br/>He was slightly surprised. The elf princess had always been wearing a lifeless expression, making him wonder how to make her seem livelier.<br/><br/>Now it seemed that her adaptability was much stronger than Su Qingzhen’s.<br/><br/>He changed his mind in less than half a day.<br/><br/>Gu Yang simply ignored it and walked outside.<br/><br/>This time, after fifteen simulations, he managed to upgrade the level of his Beast-taming Space once again, becoming a legendary Beastmaster, equivalent to the Unleaking Realm.<br/><br/>Moreover, his Phoenix incarnation also stepped up a level, equivalent to the second stage of the Unleaking Realm.<br/><br/>His strength has greatly increased.<br/><br/>As long as he can tame a monster beast of the Unleaking Realm as his pet, his strength can rise another level.<br/><br/>A Beastmaster can only create three Beast-taming Spaces in their mind. That is, he can tame up to three pets.<br/><br/>He already has a target for his first beast choice.<br/><br/>…<br/><br/>Gu Yang told Su Qingzhen and Ling Ling, then quietly left Divine City with Eve.<br/><br/>He did not go south, but east.<br/><br/>The south is Jingzhou, and the east is Liangzhou.<br/><br/>In the Ruiqin continent, also known as Penglai Heaven, there are many powerful Beastmasters, and bluntly put, monster beasts that can be tamed have been almost all taken.<br/><br/>What’s left are either like the Immortal Underworld Phoenix, untamable, or similar to the Golden Peng Bird, difficult to tame.<br/><br/>In fact, the vast majority of Beastmasters initially choose newborn monster beasts to sign contracts and grow together.<br/><br/>Gu Yang doesn’t have that much time, nor does he think he can tame those notorious monster beasts.<br/><br/>Thus, he chose another place.<br/><br/>Monster beasts in Great Zhou are nearly extinct, but in the cave world, there are still monster beasts.<br/><br/>One is Shuiyue Cave World, and the other is Jinting Cave World.<br/><br/>Gu Yang chose to go to Jinting Cave World because it is less dangerous. The master of Jinting would not kill him, but rather collaborate with him.<br/><br/>…<br/><br/>Jinting Cave World.<br/><br/>When Gu Yang returned to this cave world, it felt very different than the last time.<br/><br/>He could feel that this world was indeed quite different from the outside world. If he stayed here for too long, even his mana could undergo some changes.<br/><br/>Eve, who was following him, was shocked. Naturally, she knew this was another plane.<br/><br/>This place is full of life, similar to the previous plane they visited.<br/><br/>“What is this place?”<br/><br/>This was the first time she had spoken since she became his servant.<br/><br/>Ever since this man possessed the power of the Moon God, Eve’s attitude towards him had subtly changed.<br/><br/>She suddenly realized that all of this may have been ordained by the Moon God, and her resistance had subsided.<br/><br/>“Jinting Cave World.”<br/><br/>Gu Yang said, leading her to fly into the sky and quickly headed in a certain direction.<br/><br/>His speed was much faster than before.<br/><br/>A few hours later, they arrived at their destination.<br/><br/>A mountain peak that was not unusual at all.<br/><br/>The two landed in front of a cave and walked in. Deep inside, they came to a bottomless pit.<br/><br/>Without hesitation, Gu Yang jumped right in.<br/><br/>Eve followed closely behind.<br/><br/>A moment later, they finally landed on the ground.<br/><br/>Gu Yang looked towards the white monkey sitting on the corpse of the Divine Ape, and said, “Brother Monkey, good to see you well.”<br/><br/>The monkey still held the purple crystal in its hand, and there was a hint of solemnity in its eyes, “In such a short time, your strength has become incredibly powerful.”<br/><br/>Gu Yang smiled, “Thanks to you.”<br/><br/>There was no trace of a smile in the monkey’s eyes as it asked, “You came to find me, it wasn’t just for pleasant chat, right?”<br/><br/>“Of course, my coming here this time was to discuss with you about signing a contract with me and becoming my pet. Don’t worry, I won’t mistreat you.”<br/><br/>Pet?<br/><br/>The monkey’s eyes turned icy, “You’re asking for death!”\t\t\t\t\t\t</div>", "images": {}, "success": true}