{"id": 317, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132234.html", "title": "Chapter 317 - Chapter 317: Chapter 317: The Second Pet Beast", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 317 - Chapter 317: Chapter 317: The Second Pet Beast</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 317: Chapter 317: The Second Pet Beast<br/><br/>Gu Yang was trailing the bizarre creature closely.<br/><br/>The familiar aura he sensed just now was that of Daoist Muhuang whom he had met in Muhuang City.<br/><br/>The creature, upon discovering Daoist Muhuang, went berserk, abandoning him, and flew towards Daoist Muhuang instead.<br/><br/>If this wasn’t personal grudge, he wouldn’t believe it.<br/><br/>The corpse that left a message had claimed to be Daoist Muhuang. Regardless of its authenticity, it was obviously deeply entangled with the Daoist Muhuang from Muhuang City.<br/><br/>Considering the behavior of this creature now, it might be the Original Spirit of that corpse.<br/><br/>Gu Yang followed the creature to the Silent Forest, watched it open the pathway to that underground tunnel, and trailed in after it.<br/><br/>After entering the underground cavern, he felt an astonishing fluctuation deep underground.<br/><br/>His expression shifted, “Could it be the ancient Immortal’s legacy that the corpse mentioned?”<br/><br/>The fluctuation was so immense it stirred the vitality in the cavern dramatically.<br/><br/>If that were true, then the corpse’s message could be real.<br/><br/>As Gu Yang was pondering, he saw the creature speeding up like mad.<br/><br/>Not only it, but countless wandering entities from all directions, smelling blood-like zombies, crazily flew towards the underground.<br/><br/>A flock of blood bats had even shown up at the corner ahead.<br/><br/>Each and every one of the blood bats had the cultivation level of the Mana Realm, amounting to twenty or thirty in total.<br/><br/>Even that mysterious old man before has shown some trepidation towards this creature, willing to make him deal with it.<br/><br/>The blood bats, each with blood-red eyes, madly flapped their wings, bumping into and pushing slower creatures to one side in the air.<br/><br/>What kind of creature is this blood bat that even bizarre creatures fear not?<br/><br/>“So much energy!”<br/><br/>Gu Yang couldn’t hold back anymore. With a single move of the Phoenix Feather Knife, it cleaved through the two nearest creatures, reducing them to ashes instantly.<br/><br/>In his eyes, this large group was merely energy in motion.<br/><br/>[Obtained energy: 5 points. Current balance: 499 points.]<br/><br/>[Obtained energy: 5 points. Current balance: 504 points.]<br/><br/>Immediately, an additional of 10 points of energy was credited.<br/><br/>Even though their value was low, there was sheer volume.<br/><br/>In front of him, there were at least ten creatures at the Mana Realm, not to mention even more at the Golden Body Realm, and a flock of blood bats at the Mana Realm.<br/><br/>In the Yellow Springs’ Cave Heaven, cultivators changed color upon sensing them and even though they tried to avoid them, for him they were a group of prey.<br/><br/>Gu Yang cut a swathe through the group of creatures.<br/><br/>Every strike of his blade meant the end of a creature.<br/><br/>Continuous notifications appeared before his eyes, but he just didn’t have the time to look at them.<br/><br/>In a blink, tens of bizarre creatures surrounding him were wiped out. Only, the fastest flock of blood bats remained.<br/><br/>About 10% of his Mana had been consumed.<br/><br/>In Yellow Springs’ Cave Heaven, the vitality in the environment was poisonous. The lost Mana couldn’t be restored. This point was a bit irritating.<br/><br/>However, he made a profit of more than 70 points, equivalent to 0.7 Unleaking Realm powerhouses.<br/><br/>In terms of profits, it was very cost-effective.<br/><br/>To kill an Unleaking Realm powerhouse, even if he used up all his body’s Mana, it would still be difficult. It would require resorting to the Divine Beast’s avatar.<br/><br/>Then, Gu Yang looked at the most difficult to deal with flock of blood bats.<br/><br/>The flock of blood bats seemed to sense danger, their dark red bodies lit up and turned blood-red, as if connected to each other, forming a peculiar pattern.<br/><br/>“Is this even possible?”<br/><br/>Gu Yang seemed surprised, as the power of thirty Mana Realm blood bats when combined, the power also stacked up together. That power had already surpassed the Unleaking Realm.<br/><br/>No wonder even that mysterious old man felt apprehensive around them, they actually had such Divine Powers.<br/><br/>This great power made Gu Yang feel the pressure.<br/><br/>Even if he exhausted all his Mana, he might not be able to get rid of them. He’d be better off hunting bizarre creatures.<br/><br/>With a loud rumble, the entire cavern seemed to tremble.<br/><br/>Not far away, the Unleaking Realm bizarre creature had already engaged in a fight with “Daoist Muhuang”. The battle was extremely fierce.<br/><br/>Just as Gu Yang was preparing to retreat, the flock of blood bats chased after him as he moved.<br/><br/>Whoa, what a temper, quite explosive indeed.<br/><br/>I intended to let him go, but apparently, he has no intention of doing the same, exuding such killing intent.<br/><br/>“Well then, off you go to your death!”<br/><br/>A flash of fire flew from Gu Yang’s brow and instantly plunged into the swarm of Blood Bats, transforming into a Phoenix bathed in flames. A few Blood Bats were instantly turned into ashes under the fire.<br/><br/>In just one clash, the formation formed by the Blood Bats was broken, fragile as paper.<br/><br/>The remaining Blood Bats fled in panic, scampering off in haste.<br/><br/>The Phoenix transformation opened its mouth and spewed out a flame, engulfing the fleeing Blood Bats. Without a squeak, they were burnt to nothingness.<br/><br/>“This weak?”<br/><br/>Gu Yang was very surprised.<br/><br/>The mysterious old man said that the Phoenix was the natural enemy of Blood Bats. But he really didn’t expect that the seemingly powerful Blood Bats would be this fragile in front of the Phoenix transformation.<br/><br/>They were wiped out in no time at all.<br/><br/>Notifications kept popping up in front of him.<br/><br/>[Acquired ten energy points, current balance…]<br/><br/>A total of twenty-seven notifications appeared. In just a few short seconds, he had gained two hundred and seventy energy points. Equivalent to defeating 2.7 Unleaking Realm cultivators.<br/><br/>So effortless, it was like picking up freebies.<br/><br/>He has really hit the jackpot this time!<br/><br/>Last time he was here, he saw a large group of Blood Bats, at least a hundred of them.<br/><br/>Cleaning them all up would yield thousands of energy points.<br/><br/>Gu Yang felt that the decision to come here to level grind was truly a brilliant one.<br/><br/>Although this world is extremely dangerous, with sufficient strength, the speed of energy acquisition is much faster than that in other Dongtian worlds.<br/><br/>“There’s one more.”<br/><br/>Gu Yang saw a lone escaped bat, retracted his Phoenix form, chased it down, and was about to finish it off with a single blow when a thought struck him. He tossed over an Identification Spell.<br/><br/>This spell is a must-have for Beastmasters. When encountering extraordinary creatures that are unknown, this spell can be used to identify them.<br/><br/>“Unidentified Bat-like Supernatural Creature (Mutant), Monarch Level, Swarm Community. Talent one: Absorption, can devour all forms of energy. Talent two: Union, can unite with same species. Potential: Overlord Level.”<br/><br/>It actually worked.<br/><br/>Gu Yang was suddenly intrigued, opened up the system, and initiated a Simulation.<br/><br/>[You trap a Blood Bat in the Yellow Springs and take it as your pet. You trap all the Blood Bats in the cave and fuse with them.]<br/><br/>[You exhaust your mana and leave the Yellow Springs. Soon after, you join the grand battle against the Prairie Barbarians and emerge victorious.]<br/><br/>[When you return triumphant, an Immortal powerhouse from the Prairie races to kill you. You unleash your swarm of Blood Bats to thwart his attack. Shortly after, Luo Wang arrives and severely injures the Immortal.]<br/><br/>[Followed by another Immortal, they join forces and awaken an ancient, powerful being who kills everyone present. You die at the age of twenty-three.]<br/><br/>Indeed, it works!<br/><br/>Gu Yang looked at the struggling Blood Bat, his eyes lit up.<br/><br/>It could actually be tamed as a pet and, through it, he could take the entire Blood Bat swarm for his own.<br/><br/>Moreover, the power of the Blood Bat swarm is indeed formidable. They can even hold off an Immortal powerhouse.<br/><br/>Joining forces with Luo Wang, they could even seriously injure that Immortal powerhouse.<br/><br/>From a certain perspective, they could rival an Immortal powerhouse.<br/><br/>However, these Immortal powerhouses really are stubborn. When they can’t beat you, they resort to summoning another. They summoned an ancient, powerful being, and killed everyone present.<br/><br/>[Simulation finished, you can keep one of the following.]<br/><br/>[1. Martial Arts realm at the age of twenty-three]<br/><br/>[2. Martial Arts experience at the age of twenty-three]<br/><br/>[3. Wisdom of life at the age of twenty-three]<br/><br/>Gu Yang put the reward aside for now and took out the Phoenix Feather Knife. He said to the Blood Bat, “Become my pet or die. Choose one.”<br/><br/>The Blood Bat trembled in terror showing some comprehension.<br/><br/>Just like that, under his threat, the Blood Bat dared not refuse and was tamed as his pet, stored in his mind and the Beast-taming Space.<br/><br/>At this time, the fight on Daoist Muhuang’s side has also entered a heated stage.\t\t\t\t\t\t</div>", "images": {}, "success": true}