{"id": 321, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132242.html", "title": "Chapter 321 - Chapter 321: 321 Book Of Mystical Heaven", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 321 - Chapter 321: 321 Book Of Mystical Heaven</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 321: 321 Book of Mystical Heaven<br/><br/>“Phoenix bloodline? You belong to the Monster Race?”<br/><br/>When Gu Yang morphed into a Phoenix and quickly fled, that gruff voice again echoed, causing his head to throb incessantly.<br/><br/>He retorted irritably, “You’re the one from the Monster Race, your whole family is from the Monster Race. Also, speak less loudly, my ears are… I’m nearly deafened by you.”<br/><br/>“So you’re a body cultivator who practices by borrowing the Monster Race Essence Blood, hmm, these are deviant methods.”<br/><br/>Unruffled, Gu Yang said, “I’ve actually misled myself. Can you point me to the right path?”<br/><br/>“Within your Zifu, there is a divine scripture. If you retrieve it, you can aspire to become a Celestial Immortal in the future. However, do you dare to go back? Without the strength of the Human Immortal, you won’t be able to exterminate those Heavenly Demons from outside realms.”<br/><br/>Divine scripture?<br/><br/>Gu Yang couldn’t help but feel tempted, clearly it was an ancient Immortal Cultivator technique.<br/><br/>The practices he cultivated, whether it was “Phoenix Dance Nine Heavens” or “Nine Heavens Divine Method”, were all adapted by the later generations after the Way of Heaven perished, to fit the era.<br/><br/>Not that these practices were ineffectual, but so far, none among those who cultivated Martial Arts had reached the Hollow Void realm.<br/><br/>Even a character like the Xia Emperor had failed to take that step.<br/><br/>One couldn’t help but question if there was a problem with these practices.<br/><br/>The “Phoenix Dance Nine Heavens” was deliberately disseminated by the Divine Beast Phoenix before its Nirvana. Whether or not it contains the practices of the Celestial Being realm remains uncertain.<br/><br/>The “Nine Heavens Divine Method” was given to the Xia Emperor by a mysterious person under the palace grounds. Whether this mysterious person was good or evil was questionable, suggesting that this practice might also have problems.<br/><br/>Gu Yang had always wanted to find some genuine ancient inheritance practices. Even if they couldn’t be used for cultivation, they could serve as references to deduce practices of realms like the Celestial Being and even the Hollow Void.<br/><br/>He possessed a Simulator and had ample time to deduce.<br/><br/>Even if the path to Martial Arts in this world had reached the end, he would carve a new path.<br/><br/>Therefore, upon hearing there was a divine scripture in that cave dwelling, Gu Yang immediately activated the system, initiating a simulation.<br/><br/>“…You utilized the complex terrain, circled around, returned to the cave dwelling, used your Phoenix transformation to clear the path, fought your way in, obtained The ‘Taixuan Heavenly Book’ in the Scripture Pavilion. You acquired the legacy of the divine scripture, but were besieged by strange beings, your mana was drained, and you eventually died in battle at the age of twenty-two.”<br/><br/>Got it!<br/><br/>He was overjoyed. With just one simulation, he successfully obtained the divine scripture. It was too smooth.<br/><br/>“Simulation has ended, you can retain one of the following items.”<br/><br/>“…”<br/><br/>Gu Yang firmly chose the second option.<br/><br/>Immediately, countless mysterious and profound mantras of cultivation methods surged into his mind.<br/><br/>After a while, he felt something was amiss, “Eh, why is it only the first level?”<br/><br/>The content in his mind only contained the first level, that is, the Divine Power realm, including the content of the three realms: Foundation Establishment, Golden Core, and Nascent Soul.<br/><br/>Techniques of the realms above Celestial Being were missing.<br/><br/>“Damn it.”<br/><br/>Gu Yang cursed under his breath. These cultivation secret manuals all had this issue. They wouldn’t directly give you all the techniques, only when your cultivation reached that level would you receive the corresponding realm’s technique.<br/><br/>His current cultivation level was equivalent to the Golden Core stage, so what he got was the Nascent Soul stage’s technique.<br/><br/>The techniques of just this realm alone greatly broadened his horizons.<br/><br/>Contrary to the conciseness of “Phoenix Dance Nine Heavens” and “Nine Heavens Divine Method”, the contents of just the three realms in the “Taixuan Heavenly Book” exceeded these two practices tenfold.<br/><br/>Needless to say, the contents within were extremely profound, containing a vast amount of information. When expanded, it was more than a hundred times more than the techniques of Martial Arts.<br/><br/>Many puzzling areas were now clear to him through the divine scripture, which deepened his understanding of the path of cultivation.<br/><br/>Many aspects enlightened him.<br/><br/>The ancient Immortal Cultivators’ understanding of this universe was somewhat beyond his imagination.<br/><br/>In comparison, the Martial Arts that are trending in Great Zhou now are just a simplified version, and myriad contents had been removed.<br/><br/>Though those contents seemed useless, they could help Martial Artists understand the essence of cultivation, and could be beneficial for them to walk further.<br/><br/>Honestly, Gu Yang didn’t respect Cultivators much initially. Be it in the Water Moon Celestial Realm, or Yellow Springs Celestial Realm, even the Golden Court Celestial Realm.<br/><br/>The cultivators he encountered seemed weak. It was effortless for him to kill Nascent Soul stage cultivators. If it were an Unleaking Realm Martial Artist, it would be more difficult.<br/><br/>But now it seemed that at the same realm, the understanding of the essence of cultivation, the Martial Artists were far less than the cultivators.<br/><br/>Martial Artists are pragmatists, possessing formidable battle strength, yet they are destined not to go too far.<br/><br/>Immortal Cultivators have a broader range, their cultivation is slow, yet their understanding of the cultivation process is more thorough, they value gradual accumulation to create a massive outburst.<br/><br/>However, in today’s era, the Way of Heaven has perished, nobody can break through to the Hollow Void realm, which makes Martial Artists more advantageous than Immortal Cultivators.<br/><br/>This is caused by the unique environment.<br/><br/>…<br/><br/>“I must obtain that Heavenly Scroll.”<br/><br/>Gu Yang resolved decisively, suddenly changed his course, and rushed towards those strange creatures behind him.<br/><br/>The creatures in the Netherworld Cave seem endless, he had killed at least a hundred today, and they still continue to surge from all directions.<br/><br/>The Spirit Qi in the cave dwelling was like a bait, attracting all the nearby strange creatures.<br/><br/>As time passed, more and more strange creatures would swarm towards the cave.<br/><br/>So, time was of the essence.<br/><br/>Otherwise, once the cave became entirely occupied by the strange creatures, the Heavenly Scroll would be destroyed.<br/><br/>“Netherworld Cave, what has happened to you? Why have you become like this? What are you trying to do?”<br/><br/>In his mind, the hammer kept on talking ceaselessly, it seemed that it had been trapped in the cave dwelling for too long and became somewhat talkative.<br/><br/>Suddenly, it was aware of what Gu Yang was trying to do, its voice filled with surprise, it howled, “If you want to die, don’t drag me into it.”<br/><br/>With that, the body of the hammer started to struggle incessantly.<br/><br/>However, it had depleted too much of its power, and for a while, it couldn’t break free.<br/><br/>Gu Yang had just acquired this spiritual treasure, how could he allow it to escape so easily? Using the Divine Ape’s divine power, he possessed unparalleled strength. Even at its prime, the hammer wouldn’t be able to break free easily.<br/><br/>From his forehead flew a phoenix avatar, it spat out flames, instantly scorching a third of the strange creatures.<br/><br/>This time, he didn’t hold anything back, the phoenix displayed its mighty power, transforming into a gigantic fire bird. Wherever it went, the strange creatures turned to ashes.<br/><br/>Gu Yang trailed behind the phoenix avatar, before long, he arrived at the entrance of the cave dwelling again.<br/><br/>The entrance was densely packed with strange creatures, no less than hundreds of them.<br/><br/>The flames on the phoenix avatar surged, it opened its mouth, releasing a golden flame.<br/><br/>This was its primal fire, its ultimate trump card.<br/><br/>The flame wasn’t large, yet its power was boundless. Everywhere it went, the strange creatures instantly vanished, forming a pathway.<br/><br/>After this flame, the spirit of the phoenix avatar became dispirited, in a whooshing sound, it returned to Gu Yang’s forehead.<br/><br/>He took advantage of this opportunity, passing through the pathway, and entered the cave dwelling.<br/><br/>“You’re insane!”<br/><br/>The voice of the hammer was howling in his mind, it was practically exasperated.<br/><br/>The cave dwelling was crammed with strange creatures. After consuming a large amount of Spirit Qi, several of them managed to break through to the Unleaking Realm.<br/><br/>Entering the cave dwelling at this moment was no different than seeking death.<br/><br/>Gu Yang remained calm, the phoenix avatar once again flew out from his forehead. Right now, it was as though it had a full health revival, spewing flames, rampaging and killing.<br/><br/>The hammer, which was struggling fiercely just a moment ago, suddenly froze, seemingly stunned by the scene before it.<br/><br/>The phoenix avatar displayed its mighty power once again, becoming unstoppable. Not a single strange creature could resist its flame.<br/><br/>However, the quantity of these strange creatures was simply too large, there were too many to kill.<br/><br/>In no time, its mana was depleted again, and it returned to Gu Yang’s forehead once more.<br/><br/>Yet, at this time, he had only advanced several hundred meters.<br/><br/>Seeing the area that had just been cleared out was quickly filled in again by the strange creatures squeezing in, the hammer began to curse once more, “You really are causing trouble—”<br/><br/>At this moment, the phoenix flew out again, the flames lit up, and all the strange creatures in front were incinerated.<br/><br/>“Huh—”<br/><br/>PS: Asking for monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}