{"id": 328, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132257.html", "title": "Chapter 328 - Chapter 328: 328 Devour", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 328 - Chapter 328: 328 Devour</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 328: 328 Devour<br/><br/>In the Wind God Valley.<br/><br/>The Ice and Snow Queen was still waiting for an opportunity, but the golden roc bird, having experienced two accidents, had become extremely cautious and stayed close to its nest.<br/><br/>Now it was a test of patience.<br/><br/>She had enough patience. Back when she was not yet a queen, Xirui Kingdom was forced to submit to the Northern Empire and suffered various oppressions.<br/><br/>To change the status of Xirui Kingdom, she left the barren lands of the far west to study in the Beast God Temple. After enduring countless trials and hardships, she managed to stay there.<br/><br/>Later, she became a legendary Beastmaster and returned to her country to take over the throne. Initially, she still submitted to the Northern Empire.<br/><br/>It wasn’t until five years later, when the emperor of the Northern Empire died and his princes began fighting over the throne, bringing the empire into a civil war. Then she bravely marched her troops, wiped out a legion of the Northern Empire, seized their most important fortress, and an entire province.<br/><br/>Since then, the power balance between Xirui Kingdom and the Northern Empire had reversed.<br/><br/>Xirui Kingdom was able to hold off the hundreds of thousands of strong troops from the Northern Empire with that fortress alone.<br/><br/>Moreover, that fortress was like an arrowhead threatening the Northwest Plains of the Northern Empire, one of their most crucial granaries.<br/><br/>Thus, Xirui Kingdom had become a thorn in the side of the Northern Empire and something they desperately wanted to get rid of.<br/><br/>The Ice and Snow Queen knew that Xirui Kingdom’s strength was nowhere near that of the Northern Empire.<br/><br/>Previously, the Northern Empire was too preoccupied with their internal chaos to pay attention to Xirui Kingdom.<br/><br/>Now, the new emperor of the Northern Empire had firmly secured his position and eliminated all opposition. Next, they would set their sights on Xirui Kingdom.<br/><br/>With her power alone, she couldn’t stand against an entire empire.<br/><br/>Unless, she could become a legendary Beastmaster.<br/><br/>The success of this mission would determine not only her breakthrough but also the fate of Xirui Kingdom. There was no room for failure.<br/><br/>Across the entire Xirui Continent, there were only forty-seven extraordinary totem-level creatures, half of which were controlled by the Beast God Temple and other major forces.<br/><br/>The chance for a golden roc bird to lay an egg was rare to come by. Once missed, who knows when such an opportunity would come again.<br/><br/>“There will be an opportunity.”<br/><br/>The Ice and Snow Queen silently repeated in her heart.<br/><br/>As she thought of the man and woman who were suspected to come from the “Human Realm,” she had a feeling that the opportunity she was waiting for might be them.<br/><br/>Suddenly, she felt something and looked up to see a familiar figure.<br/><br/>They’re here!<br/><br/>Seeing this humanoid extraordinary creature again still stirred her heart.<br/><br/>Moreover, that figure was holding a man in her hand. The same man who had shown his mighty power and killed Feng Qi and Qiu Nianzhong half a day ago.<br/><br/>Such a powerful person was now in the grip of this figure, unable to resist.<br/><br/>“She really came for that man.”<br/><br/>The Ice and Snow Queen drew a deep breath. The opportunity she had been waiting for had finally arrived.<br/><br/>At the same moment that figure appeared, the aura of the golden roc bird in the valley exploded, seeming to be filled with hostility towards the figure.<br/><br/>The figure paused for a moment without leaving, and suddenly said, “Golden Roc, don’t you remember me?”<br/><br/>It was a strange language that the Ice and Snow Queen didn’t understand.<br/><br/>However, she could tell that this humanoid extraordinary creature was trying to communicate with the golden roc bird.<br/><br/>“Roar——”<br/><br/>The golden roc bird let out a raging roar filled with anger and intense hostility.<br/><br/>“Sigh——”<br/><br/>The figure sighed and vanished.<br/><br/>The Ice and Snow Queen felt a strong spatial fluctuation. Apparently, the man and woman had left the Xirui Continent and returned to the “Human Realm.”<br/><br/>At that moment, she disappeared from the spot, ready to take action.<br/><br/>…<br/><br/>……<br/><br/>Gu Yang was immobilized, unable to use his Mana or move his body or even speak.<br/><br/>He had been following Saint Chao Yang, although up until now he hadn’t seen its true form. However, based on the voice, it should be a woman, correction, female.<br/><br/>That’s not right either. Trees don’t have genders.<br/><br/>Jin Feng, who serves under Saint Chao Yang, once mentioned that its true form was a Chinese parasol tree.<br/><br/>It also explained why she was so loyal to the phoenix. Nearly ten thousand years had passed, and she was still dedicated to reviving her master.<br/><br/>At this moment, being up close, Gu Yang witnessed the divine power of a Celestial Being realm. Instead of flying, they traveled by teleportation.<br/><br/>However, that was on the mainland of Ruichin.<br/><br/>After returning to Great Zhou, she also flew, not knowing if teleportation had any restrictions.<br/><br/>Her speed was not much slower than his Phoenix incarnation.<br/><br/>“My Lord.”<br/><br/>Soon after, a figure flew in from the front, an acquaintance, Jin Feng, a subordinate of Saint Chao Yang. He came to confess his fault, “The subordinate has failed my duty, please punish me, my Lord.”<br/><br/>Saint Chaoyang did not pause at all, leaving a sentence “Go back by yourself”, and then bypassed him, flying farther and farther.<br/><br/>Jin Feng chased desperately, but could only watch them disappear into the horizon.<br/><br/>He was extremely anxious, if the Lord found out that he had pledged allegiance to Gu Yang, he would be dead.<br/><br/>…<br/><br/>……<br/><br/>Saint Chaoyang flew non-stop for half a month until reaching the extreme north, where the world was covered in heavy snow and ice.<br/><br/>Eventually, she stopped in a glacier field, raised her head to look at the sky, seemingly observing the changes in the stars.<br/><br/>This wait lasted half a day.<br/><br/>Gu Yang stared blankly at the distant glacier, feeling bored.<br/><br/>This half a month was arguably the most leisurely period since his arrival in this world.<br/><br/>He didn’t need to think about where to hunt, how to earn money.<br/><br/>He didn’t need to consider where to get energy, or rack his brains to find ways to increase his strength, let alone worry about the sudden appearance of a Celestial Being who could kill him…<br/><br/>He could empty his mind and think about nothing.<br/><br/>Just waiting to enter the Peach Blossom World.<br/><br/>At this moment, Saint Chaoyang finally moved. A star constellation in the sky cast down a ray of starlight, and a spatial portal appeared in front of him.<br/><br/>The world beyond the portal was lush with plants, the grass was like carpet, the scenery was beautiful, much like an idyllic paradise.<br/><br/>Saint Chaoyang took him and flew in.<br/><br/>The vitality of this world was much stronger than any other realm Gu Yang had been to.<br/><br/>It was undoubtedly a cultivation sanctuary.<br/><br/>There were not a few animals, or rather, members of the monster race around. None of them were particularly strong, the highest cultivation level barely reaching the Golden Body realm.<br/><br/>Apart from those, there were many plants, all kinds of surprising flowers and herbs, and towering trees.<br/><br/>Some of them seemed powerful, with a cultivation level reaching the Mana realm.<br/><br/>These plants were obviously members of the monster race that had gained sentience.<br/><br/>In the distance, a huge tree could be seen, its crown hidden amongst the clouds, truly towering. It was at least a few thousand meters high.<br/><br/>That must be Saint Chao Yang’s actual form.<br/><br/>As expected, Saint Chao Yang took him and flew towards that giant tree.<br/><br/>Sometime later, they flew to a branch where a giant bird’s nest had been built. In the center of the nest laid a spherical red stone, over the height of a person, looking much like a red egg.<br/><br/>Saint Chao Yang led him and landed in front of the stone egg.<br/><br/>At this moment, Gu Yang could hear the breath of the person behind him getting heavy, he could only imagine her current state of excitement.<br/><br/>In a while, she would be too moved to cry.<br/><br/>A hint of a strange smile crept on his lips.<br/><br/>Then, Saint Chaoyang picked up his hand and pressed it towards the stone egg.<br/><br/>At the same time, Gu Yang opened the system, [Simulation end, you can retain one of the following options.]<br/><br/>[1, Martial Arts level at age 35.]<br/><br/>[2, Martial Arts experience at age 35.]<br/><br/>[3, Life wisdom at age 35.]<br/><br/>“I’ll take the first.”<br/><br/>Immediately, there was a roar in Gu Yang’s body, as if it had reached a critical point, a powerful force erupted, a never-before-seen strong force that instantly broke the prohibitions in his body, restoring his mobility.<br/><br/>At that moment, his hand was laying on the stone, with mana erupting out of it.<br/><br/>The next moment, his mortal body instinctively cut off contact with the outside world and mana stopped erupting.<br/><br/>He saw the red light of the stone egg brighten, a force that could not be resisted surged towards him and swallowed him whole.<br/><br/>Saint Chao Yang standing beside him was stunned.\t\t\t\t\t\t</div>", "images": {}, "success": true}