{"id": 322, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132244.html", "title": "Chapter 322 - Chapter 322: Survive 322", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 322 - Chapter 322: Survive 322</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 322: Survive 322<br/><br/>So it went. By leveraging the Phoenix’s ability to fully revive itself numerous times, Gu Yang was able to fight his way through the entire cave dwelling, reach the Scripture Pavilion, and get his hands on the divine scripture.<br/><br/>Then, he turned back around and cut his way through the fray, escaping out of the cave and back onto the surface.<br/><br/>Throughout the entire process, he used the simulator a total of ten times, consuming 400 points of energy.<br/><br/>He acquired a divine scripture of utmost significance to him and harvested more than 300 points of energy.<br/><br/>The loss wasn’t too great, but the entire process was incredibly perilous.<br/><br/>If it wasn’t for his Blood Bat pet beast as his trump card, he wouldn’t have dared to risk this. If things truly went south, releasing the Blood Bat swarm would surely have led him through the heavy encirclement.<br/><br/>However, if the Blood Bat swarm were to be dispersed, it couldn’t be recovered through the simulator. Thus, he had been refraining from using it throughout.<br/><br/>He has a better use for this trump card.<br/><br/>Gu Yang didn’t fancy taking risks as long as he had the simulator. Dangerous endeavors that could be preemptively resolved by the simulator weren’t worth doing.<br/><br/>However, this situation was exceptional. If he didn’t dare to risk a little, the divine scripture would be destroyed by the eldritch creatures.<br/><br/>No matter how you looked at it, now that the divine scripture was in his possession, the risk taken was worth it.<br/><br/>“Lad, how did you pull it off?”<br/><br/>At this point, Hammer’s voice rang in his mind, laden with heavy suspicion.<br/><br/>Gu Yang replied, “Secret.”<br/><br/>The voice snorted disdainfully before going quiet.<br/><br/>Gu Yang carefully tucked the divine script away and then set off towards Huangmu City.<br/><br/>With Luo Kun dead and Huangmu City left defenseless without its mightiest guardian, it was hard to station himself there anymore. He planned to notify them, so that the people in the city could prepare themselves accordingly.<br/><br/>He didn’t encounter a single eldritch creature all the way there.<br/><br/>Apparently, all the eldritch creatures from the surroundings had congregated deep underground.<br/><br/>“Lad, what’s your name? Which Sect do you belong to?”<br/><br/>After a while, Hammer couldn’t help himself and initiated the conversation once again.<br/><br/>“Gu Yang, unaffiliated with any sect. And you, what should I call you?”<br/><br/>The voice answered arrogantly, “I am the Massive Spirit Hammer, an Earth Grade Spirit Treasure.”<br/><br/>Although Gu Yang did not have a deep understanding of Spirit Treasures, from Hammer’s tone, it seemed that a Spirit Treasure of this grade was pretty formidable.<br/><br/>At the very least, it was quite formidable to him.<br/><br/>He said, “How impressive can an Earth Grade Spirit Treasure be? Now that the Way of Heaven is deceased, you will not receive the replenishment of Spirit Qi once you leave that cave dwelling. In the end, you will disperse due to the dispersal of your Primordial Spirit.”<br/><br/>The Massive Spirit Hammer sounded a bit deflated, “There is a way around it. As long as I find a Human Immortal who acknowledges me as their master, and gains the supply of Immortal Elements, I can protect my Primordial Spirit.”<br/><br/>Human Immortals refer to those at the Celestial Being realm and also those at the subsequent realms of the Hollow Void and the Law Manifestation.<br/><br/>Gu Yang scoffed, “Given the current state of this heavenly cave world, do you think there’s any Human Immortal who would willingly provide you their precious Immortal Element?”<br/><br/>At this, Massive Spirit Hammer fell silent.<br/><br/>Reality was indeed brutal. With the state of affairs in the Yellow Springs cave world, let alone whether there were any powerful beings at the level of Human Immortal, even if there were, they would find it impossible to replenish their Immortal Elements and would not invest it into nurturing a Spirit Treasure.<br/><br/>Gu Yang then said, “You might as well acknowledge me as your master. In this world, only I can afford to nurture you.”<br/><br/>“You don’t understand. Your cultivation level is too low. If I acknowledged you as my master, it would put a heavy burden on you. It would do more harm than good.” Massive Spirit Hammer’s tone wasn’t as arrogant as before; instead, it became a bit dispirited.<br/><br/>This was indeed a new perspective for Gu Yang.<br/><br/>He knew too little about Spirit Treasures at this level.<br/><br/>He changed the topic, “Hammer, how did the Yellow Springs cave world turn into such a state?”<br/><br/>“If my guess is right, it should be the tribulation of the River Styx.”<br/><br/>Massive Spirit Hammer said somewhat nostalgically, “Deep underground in the Yellow Springs cave world, there’s a branch of the River Styx. My master had sealed it off a long time ago.”<br/><br/>“However, the Way of Heaven suddenly collapsed, which to an Immortal is like the sky falling down. My master left me to guard the dwelling and set off to seek refuge.”<br/><br/>“After so many years, the seal on the River Styx’s branch has loosened and the river flowed into this heavenly cave world, igniting the Stygian disaster.”<br/><br/>“However, the Stygian disaster here is somewhat different from the usual disasters. It’s probably a change induced by the collapse of the Way of Heaven.”<br/><br/>From Hammer’s words, Gu Yang understood that it descended from ancient times. Intrigued, he asked, “Why did the Way of Heaven collapse?”<br/><br/>“I’m only an Earth Grade Spirit Treasure, how would I know such things?”<br/><br/>Gu Yang counted on his fingers. Celestial Beings fall under the realm of Human Immortals, above which is Earth Immortal, and further above that is Celestial Immortal. Going by Hammer’s words, there are higher beings above Celestial Immortals as well.<br/><br/>From this perspective, he was still a beginner. In ancient times, he would merely be a minor character.<br/><br/>He changed the question again, “Can the Yellow Springs cave world be saved?”<br/><br/>“Wait until the day you become a Celestial Immortal for us to talk about saving this heavenly cave world.”<br/><br/>A Celestial Immortal?<br/><br/>Yeah right! The Hollow Void realm is hard enough to reach already, let alone the Celestial Immortal. He guessed, when the Way of Heaven is restored someday, it might be possible.<br/><br/>A man and a hammer continued to chat while traveling. In no time at all, Muhuang City was in sight.<br/><br/>From a distance, Gu Yang recognized a familiar figure and greeted, “Han Feng.”<br/><br/>The person was completely shrouded in a black cloak, emitting an aura of chaos and madness. It was Han Feng, whom Gu Yang had interacted with previously. He was close to losing his mind last time; it was surprising that he managed to hold on till now.<br/><br/>Upon seeing Gu Yang, Han Feng’s chaotic aura became even more chaotic, “You haven’t changed at all.”<br/><br/>Gu Yang responded with a smile, “You neither.”<br/><br/>Suddenly, Massive Spirit Hammer said in his mind, “Oh, he practices the Nebulous Universe Sword Technique of the Sky-splitting Sword Sect. It’s surprising to see its inheritor in the Yellow Springs cave world.”<br/><br/>Gu Yang had seen Han Feng in action. He was proficient with a gourd, and according to Massive Spirit Hammer, this sword technique was quite significant.<br/><br/>Gu Yang then said, “The Daoist Huangmu is dead. You all should prepare early.”<br/><br/>Han Feng showed no response to the news of Daoist Huangmu’s death, as if he was indifferent. He had seen too much death to be affected by the demise of someone.<br/><br/>After delivering the news to him, Gu Yang said, “I have to go now.”<br/><br/>“Wait.”<br/><br/>Han Feng threw something at him; a small silver sword. “For you.”<br/><br/>Gu Yang caught it and felt a hint of sword intent emanating from it, “What is this?”<br/><br/>“Survive!”<br/><br/>Han Feng departed without looking back after dropping that comment.<br/><br/>Watching his retreating figure, Gu Yang felt a mix of emotions. Only after Han Feng disappeared at the end of the road did Gu Yang leap up and fly towards Netherworld Valley.<br/><br/>“Use the Life Simulator? A single use will consume forty points of energy.”<br/><br/>“Yes.”<br/><br/>“…Han Feng gives you a small sword, from which you received the inheritance of the Nebulous Universe Sword Technique…”<br/><br/>“…”<br/><br/>After the simulation ended, Gu Yang chose the reward. Upon seeing the immensely profound sword technique, his feelings were complex.<br/><br/>In no time at all, he arrived at Netherworld Valley.<br/><br/>The exit from the Yellow Springs cave world was here.<br/><br/>However, Gu Yang did not pause and flew directly into the Desolation Forest, killing his way back into that cave.<br/><br/>“Back again?”<br/><br/>Despite the Massive Spirit Hammer’s shocked outcry in his mind, Gu Yang turned a deaf ear to it.<br/><br/>Soon, he plunged into the horde of eldritch creatures.<br/><br/>PS: The third update of the month, please vote for us.\t\t\t\t\t\t</div>", "images": {}, "success": true}