{"id": 326, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132253.html", "title": "Chapter 326 - Chapter 326: 326 Kills", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 326 - Chapter 326: 326 Kills</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 326: 326 Kills<br/><br/>After stepping into the Teleportation Array, Gu Yang felt the world spinning around him and then found himself in an unfamiliar valley.<br/><br/>He had barely touched the ground when he sensed something was awry.<br/><br/>There was a terrifying aura to one side of him, unmistakably that of a Celestial Being.<br/><br/>A Golden Peng bird!<br/><br/>From the results of his simulation, he had known that he would face a tough battle upon arriving here.<br/><br/>Before he even got a clear look at the Golden Peng bird, he felt several killing intents. Without any hesitation, he summoned his Phoenix and Divine Ape avatars to block the two beasts from the Unleaking Realm.<br/><br/>Immediately after, Gu Yang felt a terrifying divine sense locking onto him. He quickly brought out his Radiant Shield, its black light enveloping him completely.<br/><br/>The next moment, a gigantic Wind Blade flew at him. It was a pure conglomeration of energy but its power was unmatched.<br/><br/>It was even more frightening than the Flying Swords of the Nascent Soul powerhouses from the Water Moon Cave-Heaven.<br/><br/>Boom!<br/><br/>The Radiant Shield was instantly shattered, and the Wind Blade, with its power still undiminished, slashed towards him.<br/><br/>He blocked it with the Phoenix Feather Knife in his hand, only to be hit by a powerful force that sent him flying several meters before he could steady himself.<br/><br/>“So frightening!”<br/><br/>This was his first time fighting a Celestial Being-level powerhouse in reality. The power was terrifying to the extreme, something he couldn’t defend against at his current level.<br/><br/>“I better run.”<br/><br/>From his simulation, Gu Yang had already anticipated what would happen.<br/><br/>The Golden Peng bird was laying an egg, and three Beastmasters wanted to compete for it. He had got caught right in the middle, getting attacked by both sides.<br/><br/>He had no interest in the Golden Peng bird’s egg.<br/><br/>It would take hundreds of years for it to hatch and grow to the level of its mother.<br/><br/>He did not have that much time.<br/><br/>The critical point was that in reality, the growth level of a pet beast from the simulation couldn’t be inherited, no matter whether it was related to the realm, experience, or life wisdom.<br/><br/>There was a fundamental difference between pet beasts and divine beasts. Simply put, divine beasts were obtained through his cultivation of the “Nine Heavens Divine Method,” while pet beasts were independent entities.<br/><br/>Even if a pet beast grew to the level of a Celestial Being in the simulation, it couldn’t be brought into reality.<br/><br/>So, he wasn’t particularly interested in raising a pet beast from scratch.<br/><br/>Gu Yang wanted to leave, but the others were not planning to let him go.<br/><br/>…<br/><br/>The three top legendary Beastmasters were greatly startled to see Gu Yang block the Golden Peng bird’s lethal attack.<br/><br/>Especially Feng Qi and Qiu Nianzhong, they immediately saw him as the strongest competitor and their will to kill him intensified.<br/><br/>Just after Gu Yang blocked the Golden Peng’s attack, he seemed to be in pain. As the saying goes, “Attack the enemy while he’s sick.”<br/><br/>The two agreed on an unspoken signal and released another pet beast.<br/><br/>Legendary Beastmasters usually have more than one Overlord Level Beast.<br/><br/>However, they seldom release their second beast, keeping it as a trump card to prevent others from studying and targeting it.<br/><br/>At this moment, in order to deal with their largest competition, they utilized this trump card.<br/><br/>Feng Qi shouted at the same time, “Ice and Snow Queen, why aren’t you making a move?”<br/><br/>The Ice and Snow Queen had been standing by all this while, seemingly indifferent.<br/><br/>Upon hearing Feng Qi’s words, she still showed no intention of making a move. To put it bluntly, her enmity with the Northern Empire ran deep. She had refrained from attacking Feng Qi due to the circumstances, which was already a huge compromise.<br/><br/>She would never join hands with the people from the Northern Empire.<br/><br/>She was already greatly benevolent for not taking advantage of this opportunity to launch a sneak attack on Feng Qi.<br/><br/>…<br/><br/>“Seeking death!”<br/><br/>Gu Yang originally planned to leave, but to his surprise, the two Beastmasters were relentless and had actually released two more Unleaking Realm beasts.<br/><br/>No matter how fierce the Phoenix and Divine Ape were, they could not withstand four enemies at once, especially given that their cultivation levels were one to two levels lower than their opponents.<br/><br/>If he allowed the two beasts to rush over and entangle him, and if the Golden Peng bird in the valley launched another Wind Blade attack, he wouldn’t be able to defend against it.<br/><br/>A murderous intention surged in Gu Yang’s heart.<br/><br/>If you want to die, then I’ll grant your wish!<br/><br/>His eyes glowed with a golden light.<br/><br/>He borrowed the divine power of the legitimate pet beast, the Golden Pupil Divine Ape.<br/><br/>Instantly, a golden glow lit up in the eyes of the two pet beasts, making an unexpected turn, they flew off to the side, seemingly oblivious.<br/><br/>The pupils of the two Beastmasters also became golden as they were casting spells, layering buff after buff onto their pet beasts.<br/><br/>These spells were substantial enough to boost the strength of their pet beasts by multiples.<br/><br/>However, they didn’t realize that their pet beasts had deviated from their targets and were in a tussle with thin air.<br/><br/>Gu Yang didn’t miss this opportunity. The light from the Phoenix Feather Knife flashed, beheading both before they could offer any resistance.<br/><br/>The expressions on their faces were somewhat dazed. Even at death, they had no idea where that fatal blow had come from.<br/><br/>“The divine power of the Golden Pupil Divine Ape is really useful.”<br/><br/>Gu Yang was surprised. The illusion easily felled two Beastmasters of the Unleaking Realm.<br/><br/>Had they fought head-on, the warriors of the Unleaking Realm, in the same realm as them, may not necessarily have been able to overcome them. After all, each of them had two pet beasts from the Unleaking Realm.<br/><br/>Fighting two against one, they certainly had the upper hand.<br/><br/>However, in the face of the divine power of the Golden Pupil Divine Ape, they didn’t stand a chance.<br/><br/>“The Beastmaster system has its perks, but once cornered, it’s easy to lose control. The little physique won’t even know how it died,” Gu Yang thought to himself.<br/><br/>Upon the deaths of the two Beastmasters, the four pet beasts cried mournfully, but did not linger any longer. They all turned and left, disappearing into the valley.<br/><br/>The death of a Beastmaster usually had repercussions on the pet beast, resulting in significant damage.<br/><br/>However, they were also now free.<br/><br/>There are also some loyal beasts that won’t want to live without their masters. But such cases were few and far between.<br/><br/>[You have acquired five hundred points of energy. Current balance: two thousand three hundred and forty-three points.]<br/><br/>[You have acquired five hundred points of energy. Current balance: two thousand eight hundred and forty-three points.]<br/><br/>Those two Beastmasters were equivalent to the third layer of the Unleaking Realm.<br/><br/>It was a pleasant surprise indeed.<br/><br/>Then Gu Yang looked at the last Beastmaster. Seeing no golden light in her eyes, the crystal crown on her head started to glow softly.<br/><br/>A tiny elf appeared on her shoulder, fluttering its wings, with ice crystals falling off.<br/><br/>An elemental elf?<br/><br/>Gu Yang had heard from Mu Jun that the elemental elf was an extremely rare supernatural creature, an incarnation of the elements. Capturing it was close to impossible.<br/><br/>The woman in front of him was not only immune to the illusions of the Golden Pupil Divine Ape, but also had an elemental elf, a rare pet beast. It wasn’t going to be easy to deal with her.<br/><br/>What was key was, she had not made a move against him.<br/><br/>Thinking of Saint Chao Yang, who might arrive and attack at any moment, Gu Yang didn’t feel like getting entangled with her.<br/><br/>If he were to agitate the Golden Peng bird that had just laid eggs again, it would be troublesome.<br/><br/>He called back his two incarnations of the divine beasts and swiftly flew out.<br/><br/>…<br/><br/>The Ice and Snow Queen watched as the man left, feeling her limbs go weak.<br/><br/>She turned to look at the two headless corpses and still found it hard to believe. How had two top legendary beastmasters died so easily?<br/><br/>No one knew better than her how challenging it was to kill such high-level practitioners.<br/><br/>Even if she had exhausted all her means, it would still have been difficult to kill Feng Qi.<br/><br/>That man had killed both Feng Qi and Qiu Nianzhong with just two confrontations.<br/><br/>The entire process was too easy, so easy that it felt unreal to her.<br/><br/>What shocked her even more was that the man was a legendary Beastmaster.<br/><br/>He had just shown the divine power of a pet beast, and a very powerful illusory divine power at that. Even the strong ones like Feng Qi and Qiu Nianzhong fell into his trap.<br/><br/>If she hadn’t had this crown, her fate would probably have been the same as theirs.<br/><br/>Why was that powerful man from the human realm a Beastmaster?<br/><br/>The Ice and Snow Queen was utterly bewildered.<br/><br/>Only after the man had vanished from sight did she turn her gaze back, looking towards the valley where the Golden Peng bird was. She frowned, wondering what to do next.<br/><br/>After what had just happened, the Golden Peng bird would surely be on high alert. Stealing the egg would now be even more difficult.\t\t\t\t\t\t</div>", "images": {}, "success": true}