{"id": 329, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132259.html", "title": "Chapter 329 - Chapter 329: 329 Turning The Tables", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 329 - Chapter 329: 329 Turning The Tables</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 329: 329 Turning the Tables<br/><br/>“How could this happen?”<br/><br/>The Saint Chao Yang, standing at the side, watched as Gu Yang was swallowed by the stone egg. Her heart jolted—she didn’t know whether she should interfere or not.<br/><br/>As she hesitated, Gu Yang was already engulfed by the stone egg, disappearing from sight.<br/><br/>Then, a red flame began to burn on the stone egg.<br/><br/>This change left her both shocked and elated.<br/><br/>In nearly ten thousand years, this stone egg had never displayed such a transformation.<br/><br/>Could it be that her master was finally going to revive?<br/><br/>She nervously stared at the stone egg, wringing her hands.<br/><br/>At this moment, dense clouds gathered in the sky, obscuring the sun. The thick layers made the entire sky darken.<br/><br/>Flashes of lightning began to form in the clouds, like serpents of electricity.<br/><br/>BOOM!<br/><br/>After a while, thick lightning bolts started to strike down. However, before they could even approach the tree Gu Yang was under, they vanished without a trace.<br/><br/>It was as if an invisible energy field surrounded the tree, preventing the lightning from causing any harm.<br/><br/>On the stone egg, the flame burned brighter and brighter.<br/><br/>A familiar surge of energy began to spread.<br/><br/>“Master…”<br/><br/>Saint Chao Yang’s eyes moistened. This aura- she recognized it all too well. It was unique to her master, the last imperial ruler of the Monster Race, the Monster Emperor Phoenix.<br/><br/>Ten thousand years. She had been guarding the stone egg, which the emperor had transformed into, in the realm of peach blossoms for ten thousand years.<br/><br/>Now, the emperor was finally reborn through nirvana, just like before.<br/><br/>Crack!<br/><br/>With a soft sound, the stone egg cracked and shattered. From the red flames, a tall figure emerged.<br/><br/>“Mas—” She began, about to kneel, but then, realizing something, she misstepped as if she’d been struck by lightning.<br/><br/>“Why is it you?”<br/><br/>Emerging from the flames was a human, with all his clothes burnt off, standing naked and bare. If it wasn’t Gu Yang, who else could it be?<br/><br/>Why was it a human who emerged?<br/><br/>Where is the Emperor?<br/><br/>A terrifying thought crossed her mind.<br/><br/>The thought was so horrifying that she couldn’t help but tremble.<br/><br/>Furious, she gripped Gu Yang’s throat, demanding, “Why is it you? Where is the Emperor?”<br/><br/>“Impudence!”<br/><br/>A jet of flame erupted from inside Gu Yang, instantly burning through her palm.<br/><br/>This was the Phoenix True Flame, even deeper in power. Even Saint Chao Yang’s celestial body could not withstand its force.<br/><br/>This flame gave him an aura of supreme authority, even when he wasn’t angry.<br/><br/>An aura fit for the Emperor.<br/><br/>“You…”<br/><br/>Even with her hand burnt through, Saint Chao Yang appeared to feel nothing. Terror etched across her face, she suddenly screamed, “No!”<br/><br/>The towering tree beneath her suddenly sprang to life, its branches and leaves closing in on Gu Yang.<br/><br/>Gu Yang calmly remarked, “If you kill me, you’ll never see your master again!”<br/><br/>The branches pressing towards him trembled and came to a stop.<br/><br/>After a moment, the branches and leaves slowly parted, returning to their original state.<br/><br/>…<br/><br/>A faint smile appeared on Gu Yang’s face.<br/><br/>Now he finally understood why in his previous simulations, after using the power to deplete the Celestial Being, he suffered repercussions and the Saint Chao Yang was unwilling to give him the miraculous liquid to save him.<br/><br/>Because, she dared not let him break through to the Unleaking Realm.<br/><br/>Once he reached the Unleaking Realm, he could turn the tables and swallow what remained of the Phoenix origin in the stone egg.<br/><br/>She must have never imagined that someone would use the Phoenix Dance Nine Heavens technique to cultivate themselves to the Unleaking Realm and absorb the Phoenix herself.<br/><br/>A deadly situation, unexpectedly solved this way, he had never thought of it.<br/><br/>Originally, Gu Yang planned to revert the stone egg to its original state if he were ever captured by Saint Chao Yang.<br/><br/>However, that was a last resort.<br/><br/>If he had indeed resorted to that, Saint Chao Yang would definitely not let him slide. It would be mutual destruction.<br/><br/>Now, he unexpectedly swallowed the Phoenix origin left in the stone egg. In a way, he had become the new Phoenix.<br/><br/>Would Saint Chao Yang be able to lay her hands on him?<br/><br/>The answer was no. She didn’t finish him off in the last simulation.<br/><br/>That’s why he didn’t resist when he was in the Ruiqin continent.<br/><br/>For one, he would definitely lose in a fight.<br/><br/>Secondly, there was no need to fight.<br/><br/>Having absorbed the source of the stone egg, Saint Chao Yang would be afraid to hurt him and thus, not kill him.<br/><br/>On top of that, he absorbed another source in the last simulation, which brought great benefits. It gave him the potential of the ancient Phoenix Emperor.<br/><br/>Unfortunately, he could only do it twice.<br/><br/>If he could repeatedly absorb it ten or so times, he estimated he could step directly into the Celestial Being realm.<br/><br/>If Saint Chao Yang discovers that he has reached the Unleaking Realm, she would definitely find a way to ruin his cultivation level. For her, that wouldn’t be a difficult task.<br/><br/>There was no way to take advantage of this loophole.<br/><br/>One shouldn’t be too greedy.<br/><br/>Gu Yang consoled himself, successfully solving this deadly crisis was already the best outcome.<br/><br/>Suddenly, he remembered the mysterious elder from Dragon Gate Island who had injected him with the liquid from the Phoenix gallbladder, mentioning that he would be grateful one day.<br/><br/>Could it be that this mysterious elder had already foreseen a day like this?<br/><br/>…<br/><br/>“Give me my things,” said Gu Yang.<br/><br/>After so long, it was his first time seeing the true face of the celestial powerhouse, an extremely beautiful woman. She wore a long green dress, her hair naturally falling over her shoulders, and had an air of innocence, seeming like an inexperienced young girl.<br/><br/>It was hard to believe that such a girl was a Monster race saint and one of the strongest people in the world.<br/><br/>However, her current state made it hard to discern the celestial authority from her as she looked panicked and distraught, full of guilt and regret for having done something wrong.<br/><br/>She was completely caught off guard.<br/><br/>Looking at Gu Yang, she held some resentment in her eyes, with a barely hidden murderous rage. She appeared as if she wanted to kill him on the spot.<br/><br/>However, she dared not act.<br/><br/>As Gu Yang said, if she were to kill him, there would be no chance for the Emperor to awaken.<br/><br/>Seeing her silent and motionless, Gu Yang continued, “Without a weapon, my strength is greatly reduced. If I encounter an enemy, I might be killed due to the lack of weaponry…”<br/><br/>CLANG—<br/><br/>An angry flash in Saint Chao Yang’s eyes led her to thrash her hand out, throwing out more than a dozen weapons.<br/><br/>They were the peerless divine weapons Gu Yang carried—all were there, not one less—in addition to a bundle of clothes.<br/><br/>Gu Yang calmly dressed, gathered the divine weapons, and spoke again, “Send me out of here.”<br/><br/>Indifferently, Saint Chao Yang replied, “In your dreams.”\t\t\t\t\t\t</div>", "images": {}, "success": true}