{"id": 323, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132246.html", "title": "Chapter 323 - Chapter 323: 323 Things Done", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 323 - Chapter 323: 323 Things Done</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 323: 323 Things Done<br/><br/>Two days later.<br/><br/>Three figures appeared in the sky above Wanji Forest, all clad in grey Daoist robes. Among them, one was Murong Jie.<br/><br/>He respectfully addressed the elder leading their group, “Elder Tang, this is the place.”<br/><br/>Elder Tang, tall and wrinkled, had one eye of a haunting grey, vertical pupil radiating intimidating light, “Is the person from the other realm you mentioned beneath us?”<br/><br/>Murong Jie replied, “Indeed. This person is extremely powerful, accompanied by two monster beasts of Nascent Soul level strength. One is the legendary Divine Beast, Phoenix, and the other should be the Heavenly Divine Ape. The Daoist Huangmu was killed by this person in their first encounter.”<br/><br/>The expression on Elder Tang’s face didn’t change. He calmly ordered, “Open it!”<br/><br/>He was evidently very confident in his strength.<br/><br/>Murong Jie cast a spell, and an entrance appeared before them.<br/><br/>Elder Tang commanded in a deep voice, “Everyone, be cautious.” As he spoke, he released a magic treasure to protect himself, and then entered.<br/><br/>The two people behind him followed suit, releasing their magic treasures and following him in.<br/><br/>“Huh?”<br/><br/>As soon as they entered the underground, Elder Tang exclaimed in surprise, “Why are there no creatures here?”<br/><br/>With his cultivation level, his spiritual perception could cover hundreds of miles.<br/><br/>In his perception, there were no creatures within a hundred-mile radius.<br/><br/>“Murong, didn’t you say that all the creatures outside have gathered in this cave?”<br/><br/>“This…”<br/><br/>Murong Jie was also very surprised. When he left here two days ago, the swarming creatures almost cost him his life.<br/><br/>But now, there wasn’t a single creature in the entire cave.<br/><br/>Elder Tang said, “Where is that cave mansion? Lead the way.”<br/><br/>…<br/><br/>After a while, Murong Jie led them to the location of the cave mansion. The once fairy-like cave mansion was now lifeless.<br/><br/>What was strange was that they didn’t encounter a single creature all the way here.<br/><br/>They stood at the entrance of the cave mansion, their faces filled with curiosity.<br/><br/>The creatures of this world are extremely sensitive to Spirit Qi. Once they detect it, they become crazy and converge where the Spirit Qi is located.<br/><br/>It is because of this characteristic that when the sun fell, the first to be attacked were the sects of various factions.<br/><br/>Because that’s where Spirit Qi is the most concentrated.<br/><br/>The emergence of a cave mansion here is enough to attract creatures from thousands of miles around. It undoubtedly represents a grand feast for them.<br/><br/>In just two days, it’s unlikely that the creatures would have dispersed so quickly.<br/><br/>But now, not a single creature was present.<br/><br/>This was too abnormal.<br/><br/>Most difficult to understand was Murong Jie. He had personally witnessed the numbers in which the creatures had swarmed this place. He muttered, “How could this be? Where are the creatures?”<br/><br/>“There’s only one explanation.”<br/><br/>Elder Tang suddenly spoke, his voice somewhat eerie, “The individual from the other realm has slain all the creatures.”<br/><br/>The other two were dumbstruck when they heard his words.<br/><br/>Murong Jie uttered in disbelief, “How is that possible?”<br/><br/>There were so many creatures, even a practitioner at the God Transformation stage would find it hard to kill them all!<br/><br/>Elder Tang said, “There’s nothing impossible for a person from another realm. Let’s go.”<br/><br/>“Where to?”<br/><br/>“Huangmu City.”<br/><br/>Elder Tang turned to leave without hesitation, “From now on, we three will stay in Huangmu City.”<br/><br/>Murong Jie knew that Tang intended to wait for the man called Gu Yang, but couldn’t help but ask, “What if the man never shows up?”<br/><br/>“Then we wait indefinitely,” Elder Tang said decisively.<br/><br/>He didn’t say out loud that waiting for that man and leaving the Yellow Springs pocket realm with him was Four Directions Alliance’s only way out.<br/><br/>…<br/><br/>…<br/><br/>At this time, in Netherworld Valley.<br/><br/>“You should know, it won’t be long before new creatures appear here. You’re wasting your efforts.”<br/><br/>There was a hint of cruelty in the voice of the Giant Spirit Hammer.<br/><br/>Gu Yang looked in the direction of Huangmu City, and said, “I will come back.”<br/><br/>With that said, he activated the key in his hand, took a step, and disappeared on the spot.<br/><br/>When he appeared again, he was already at Tianfang Mountain.<br/><br/>“Here is… the human realm? The key to the spatial gate is actually in your hands?”<br/><br/>The voice of the Giant Spirit Hammer was incredibly excited, causing Gu Yang’s Original Spirit to buzz in response.<br/><br/>“Quiet down.”<br/><br/>Gu Yang complained, rubbing his throbbing head forcefully.<br/><br/>“Back then, when the Way of Heaven collapsed, my master was worried that the future catastrophe of the Yellow Springs would reach the Human Realm, so he sealed the Spatial Gate to the void. Since then, one could enter the Yellow Springs Void but could not leave. Only those who possessed the key to the gate of the void could leave the Yellow Springs Void.”<br/><br/>“So, you’re the heir that the master chose.”<br/><br/>No wonder Luo Kun couldn’t manage to return.<br/><br/>Gu Yang now understood that it was because the Spatial Gate had been sealed.<br/><br/>“No good, I can’t resist the erosion of the power of time. I’m going to sleep now, see you——”<br/><br/>The Giant Spirit Hammer fell silent mid-sentence, not even finishing the word “you”.<br/><br/>“You can’t be serious, hey, I still have a lot of questions.”<br/><br/>No matter how Gu Yang called out, the hammer had no response.<br/><br/>If he had known earlier, he wouldn’t have been so hasty to leave the Yellow Springs Void.<br/><br/>Who could have guessed that after the Giant Spirit Hammer arrived at Great Zhou, it couldn’t even hold up for a minute?<br/><br/>What does the erosion of the power of time mean?<br/><br/>While he was brooding, a booming voice rang out, “Gu Yang, hand over the key to the Spatial Gate.”<br/><br/>In the sky, a gigantic net appeared, far more powerful than the one controlled by Luo Yaowu.<br/><br/>Gu Yang looked up and saw a few people surrounding him. The one leading was unmistakably an Unleaking Realm powerhouse.<br/><br/>“Luo Xu.”<br/><br/>The rumored Patriarch of the Luo Family, along with Shen Yun from the Shen Family and Cao Jing from the Cao Family, all were ancient creatures who had lived for a thousand years.<br/><br/>When he had come the day before, this Unleaking Realm powerhouse had not been here.<br/><br/>Now, he was outside, waiting for him.<br/><br/>Gu Yang said, “Move. I’m in a hurry.”<br/><br/>Luo Xu seemed extremely old, appearing like a wooden puppet that was close to crumbling. His face was filled with drooping wrinkles, his eyes nearly invisible.<br/><br/>He spoke faintly, “This is a Pure Yang Magic Weapon, called the Sky Net. Your Phoenix Feather Knife can’t break this weapon.”<br/><br/>“I do not want to be your enemy. If you hand over the key to the Spatial Gate, I will let you go.”<br/><br/>Gu Yang sneered, “Really?”<br/><br/>He summoned the Giant Spirit Hammer in his hand and smashed it into the net.<br/><br/>There was a cracking sound, the net didn’t even hold up for a second before it shattered.<br/><br/>Even though the Original Spirit of the Giant Spirit Hammer was now sleeping, it was still a Earth Grade Spirit Treasure. It was an easy task for him to shatter that Pure Yang Magic Weapon just by exerting a fraction of its might.<br/><br/>The disparity between the two was simply too great.<br/><br/>“What?”<br/><br/>The color drained from Luo Xu’s face, but he had no time to react. He was hit squarely by the Giant Spirit Hammer, reduced to dust without even having time to grunt in pain.<br/><br/>“Hm?”<br/><br/>After killing him, Gu Yang didn’t pause at all. He flew away at the fastest speed possible.<br/><br/>Because, he had already detected the formation of a Spatial Gate.<br/><br/>Since the Luo Family was under Chaoyang’s command, even if the master of Red Mansion could block Saint Chao Yang’s perception, he couldn’t stop himself from walking right into their trap.<br/><br/>If the Luo Family knew he was here, Saint Chao Yang would surely know as well.<br/><br/>Therefore, he didn’t want to have any unnecessary entanglement with the Luo Family. It was better to run away quickly.<br/><br/>However, even after he had flown far away, he had not seen any system notification about obtaining energy.<br/><br/>“He’s actually not dead.”<br/><br/>Gu Yang was surprised. No system prompt meant that Luo Xu was not dead.<br/><br/>As expected of an ancient creature who had lived for more than a thousand years. He wouldn’t be that easy to kill.<br/><br/>Gu Yang was somewhat curious about what method Luo Xu used to survive.<br/><br/>Regardless of his curiosity, his speed did not falter. He kept flying towards Divine City at full speed.<br/><br/>As he activated the system, he saw that his balance was now 2,563 points.<br/><br/>This was the reward he gained from his latest adventure.<br/><br/>In order to exterminate all the strange creatures in the cave, he had spent two extra days. The reward was not huge. When these creatures gathered together, the risk increased dramatically.<br/><br/>Melee combat was tantamount to seeking death. Only Phoenix True Fire could defeat them, which required huge energy consumption. He had to constantly rely on the Simulator in order to recover his mana.<br/><br/>Over the last two days, deducting all the costs, he only got a few hundred points of energy.<br/><br/>However, gaining more than 2,500 points should be enough.<br/><br/>The next step was to find a place and try to break through to the Unleaking Realm.\t\t\t\t\t\t</div>", "images": {}, "success": true}