{"id": 324, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132249.html", "title": "Chapter 324 - Chapter 324: 324 It’S Coming", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 324 - Chapter 324: 324 It’S Coming</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 324: 324 It’s coming<br/><br/>Tianfang Mountain.<br/><br/>After Gu Yang shattered the Pure Yang Magic Net with a hammer, the four men present at the scene who were in the Mana realm simultaneously spat out blood.<br/><br/>No matter what kind of magic treasure it is, it requires mana to unleash its power.<br/><br/>In order to suppress Gu Yang, the Luo family, apart from their ancestor Luo Xu, had their last four members in the Mana realm join hands, believing they would be able to capture him in one fell swoop.<br/><br/>However, with just one swing of his hammer, Gu Yang broke the indestructible Pure Yang Magic Net and reduced Luo Xu to a pile of crushed bones and dust.<br/><br/>The four men in the Mana realm also suffered backlash, resulting in various degrees of injury.<br/><br/>“Ancestor––”<br/><br/>Each of them was filled with rage upon witnessing their ancestor’s death.<br/><br/>If the ancestor were to die, it would be a fatal blow to the Luo family.<br/><br/>“Cough, cough…”<br/><br/>Suddenly, a coughing sound rang out from behind, and Luo Xu’s voice emerged, “Don’t worry, I’m not going to die yet.”<br/><br/>The four of them turned around and saw that their ancestor had somehow appeared behind them, trembling and seeming even older than before.<br/><br/>They were both relieved and overjoyed at the same time, “Ancestor, are you alright?”<br/><br/>Luo Xu looked at where Gu Yang had disappeared to, “I didn’t expect that he would possess a spiritual treasure. That was careless of me.”<br/><br/>Spiritual treasure?<br/><br/>Only then did the four of them understand why the Heavenly Net was so easily shattered. It turned out that the hammer in his hand was a spiritual treasure.<br/><br/>Spiritual treasures were extremely valuable – in ancient times, only Earth Immortals could possess them.<br/><br/>Even if the primordial spirit within the spiritual treasure had dissipated, its power would still far surpass any magical treasure.<br/><br/>However, only those in the Celestial Being realm could fully utilise the power of a spiritual treasure.<br/><br/>A spiritual treasure in the hands of those in the Unleaking Realm, while stronger than a magic weapon, would only be marginally so.<br/><br/>As for the hammer in Gu Yang’s hand, it was unknown why he could wield such immense power with it.<br/><br/>Luo Xu averted his gaze, “The holy master will soon arrive, follow me to welcome him.”<br/><br/>“Yes.”<br/><br/>…<br/><br/>…<br/><br/>[Do you wish to use the Life Simulator? Using it once will cost forty points of energy.]<br/><br/>“Yes.”<br/><br/>Gu Yang began the simulation while in flight.<br/><br/>[At twenty-two years old, you are a legendary Beastmaster at the third level of the Mana Realm.]<br/><br/>[After leaving the Yellow Springs cave and breaking the Luo Family’s Heavenly Net, you quickly depart for the Eastern Sea, travelling through a teleportation array to Purcell Continent.]<br/><br/>[Soon after, Saint Chao Yang pursues you to Purcell Continent, attracting a legendary Beastmaster to take action. Outnumbered, Saint Chao Yang retreats.]<br/><br/>[You are captured by a legendary Beastmaster. The divine beast avatar is taken as a pet, forming a special relationship.]<br/><br/>[Two years later, Saint Chao Yang and two other Celestial Beings return to Purcell Continent, starting a great war.]<br/><br/>[Soon, the three Demon Saints, with their incredible strength, breach the Beast God Temple. They never reappear.]<br/><br/>[You dwell in the Purcell Continent, focusing on your cultivation. Five years later, a Celestial Being from the Yao Chi Immortal Palace kills many Beastmasters in a relentless assault.]<br/><br/>[You are taken to the Beast God Temple by a legendary Beastmaster.]<br/><br/>[One year later, Yao Chi Immortal Palace attacks Beast God Temple. However, Beast God Temple displays an incredible power, killing all invaders. Afterwards, Saint Chao Yang appears and takes you away.]<br/><br/>[A year later, you die due to exhaustion of your original source in the Paradise Heaven. You were thirty-two years old.]<br/><br/>Another unexpected turn of events happened.<br/><br/>Gu Yang was a bit surprised, this time, the Purcell Continent surprisingly won against the invasion of Yao Chi Immortal Palace, and even totally annihilated them.<br/><br/>The key to this surprising turn was obviously the three Demon Saints of the Three Saints Gate. After breaking into Beast God Temple, what had happened?<br/><br/>The Purcell Continent was previously known as Penglai Heaven, and was a sacred place for demon race. Possibly, those three Demon Saints obtained some blessings which greatly enhanced their cultivation levels.<br/><br/>Or perhaps, Beast God Temple itself was a powerful mysterious treasure, just like Demon Suppression Tower, and was activated by the three Demon Saints.<br/><br/>Gu Yang quickly straightened out the ins and outs of the incident and began to make plans.<br/><br/>This simulation, which provided him with almost ten years of time, was pretty good.<br/><br/>[Simulation over, you can keep one of the following:]<br/><br/>[One, your martial arts realm at thirty-one.<br/><br/>[Two, your martial arts experience at thirty-two.]<br/><br/>[Three, your life wisdom at thirty-two.]<br/><br/>“I choose the second one.”<br/><br/>Instantly, Gu Yang’s mind was filled with a wealth of martial arts experience and knowledge.<br/><br/>The most important thing among them was the insights gained from the “Taixuan Heavenly Book”. Only by comprehending this ancient immortal cultivation method could he possibly find a future path.<br/><br/>Before long, he finally finished organising these ten years’ worth of insights.<br/><br/>“It’s not enough, let’s go again!”<br/><br/>…<br/><br/>…<br/><br/>Next, Gu Yang simulated over and over again.<br/><br/>By the tenth simulation, he suddenly experienced a feeling of anticipation, understanding what was about to happen, “It’s here!”<br/><br/>The holy master of the Three Saints Gate, Sagaing Chao Yang, had finally descended to the human world.<br/><br/>At this moment, they were not far from the East Sea.<br/><br/>“Again!”<br/><br/>By now, he had no way out. If he didn’t want to die, he had to raise his cultivation level before Saint Chaoyang caught up with him.<br/><br/>Once he reached the Unleaking Realm, perhaps he would still stand a chance of fighting.<br/><br/>…<br/><br/>…<br/><br/>Tianfang Mountain.<br/><br/>A huge vortex finally formed, and a figure walked out from the center of the vortex.<br/><br/>Next to him, Luo Xu led four people with mana realm to kneel down and bow their heads, “Greetings, Holy Master.”<br/><br/>The figure didn’t even glance at them, looking in the easterly direction. Without any gestures, he took a step and disappeared.<br/><br/>After a moment, Luo Xu and the other four got up from the ground. The four in the mana realm were drenched in sweat.<br/><br/>In front of a Celestial Being realm powerhouse, they felt an unprecedented pressure.<br/><br/>…<br/><br/>At this moment, in Divine City.<br/><br/>In the unassuming Red Mansion, a man sat cross-legged on a cushion, his eyes open, and his brows slightly furrowed. He murmured, “What nonsense.”<br/><br/>At this time, a small figure rushed in from outside the door and shouted, “Master, it’s bad. A Celestial Being realm power has invaded the human realm.”<br/><br/>The man said, “I know.”<br/><br/>The little girl anxiously asked, “Master, what should we do?”<br/><br/>“If the sky falls, there will be tall ones holding it up.” The man replied, and then closed his eyes again.<br/><br/>Seeing that he was indifferent, the little girl stomped her foot and left angrily.<br/><br/>…<br/><br/>…<br/><br/>In the Institute, in that peculiar space.<br/><br/>In the small courtyard, the dean was still lying on the recliner, reading the book.<br/><br/>Gao Fan was holding a hoe, working relentlessly.<br/><br/>Suddenly, the entire space shook. Gao Fan lost his footing and almost fell flat on his butt.<br/><br/>“Dean, what happened?”<br/><br/>The Dean didn’t look up from his book and said, “Your friend Gu Yang is in trouble.”<br/><br/>Upon hearing this, Gao Fan’s heart dropped. He asked, “How bad is it?”<br/><br/>“Worse than you.”<br/><br/>“Three Saints Door?”<br/><br/>“Yes.”<br/><br/>“Dean…”<br/><br/>“No one can help him.”<br/><br/>Gao Fan fell silent. After a while, he picked up the hoe again and started working silently.<br/><br/>…<br/><br/>…<br/><br/>Luo Province.<br/><br/>Luo Mansion, this is the unique royal mansion of Great Zhou, holding the supreme power.<br/><br/>Everyone knew, as long as Luo Mansion remained, the reign of the Zhao family would be as steady as Mount Tai.<br/><br/>In a certain hidden space, a young man was immersed in a green pool, breathing in all the misty air around him.<br/><br/>Suddenly, the whole space shook violently.<br/><br/>The man opened his eyes, after a moment, he closed them again and continued his breathing exercise. It was as if nothing had happened.<br/><br/>…<br/><br/>…<br/><br/>“So fast!”<br/><br/>Gu Yang could feel himself being locked in by a thought.<br/><br/>The opponent was rapidly approaching, moving with an incredible speed that was almost like teleporting.<br/><br/>“Again.”<br/><br/>He initiated the simulation for the eighteenth time.<br/><br/>“Still a bit off.”<br/><br/>After receiving the reward, he felt that he was close to finding the answer. At this point, all he needed was an opportunity.<br/><br/>At this time, he had reached the sea.<br/><br/>A moment later, he arrived at the teleportation array.<br/><br/>“It seems I’ll have to make a trip to the Ruichen Continent after all.”<br/><br/>Gu Yang stepped into the teleportation array, the world spun around him, and he disappeared from where he was standing, arriving in another pocket world.<br/><br/>Penglai Heaven!<br/><br/>PS: There are only two updates today. I spent the day brainstorming for the side story until I almost pulled my hair out. I’ve already submitted it to the editor, and it should be published in a few days.\t\t\t\t\t\t</div>", "images": {}, "success": true}