{"id": 327, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132255.html", "title": "Chapter 327 - Chapter 327: 327 Captured", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 327 - Chapter 327: 327 Captured</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 327: 327 Captured<br/><br/>Shortly after, Gu Yang took flight away from the valley.<br/><br/>It must be said, this area was extraordinarily dangerous. Apart from the Golden Roc, there were shockingly two other fearsome presences, only several hundred Li away.<br/><br/>There were unbelievably three Celestial Being realm level Monster Beasts in the nearby area.<br/><br/>Generally, Monster Beasts of this level had a strong sense of territory, how could they reside so closely to each other?<br/><br/>“The Golden Roc is right by the Teleportation Array, with two Celestial Being level Monster Beasts nearby, this can’t be a coincidence. They must be the guards for the Teleportation Array.”<br/><br/>Gu Yang speculated in his mind.<br/><br/>After he managed to leave the valley behind, he opened the system and initiated a simulation.<br/><br/>Now, he had 2800 energy points, plenty enough for seventy simulations.<br/><br/>Before Saint Chao Yang caught up to him, he needed to break through to the Unleaking Realm.<br/><br/>[Twenty-two years old…]<br/><br/>…<br/><br/>…<br/><br/>Soon, night fell.<br/><br/>The Ice and Snow Queen was standing guard outside the valley, waiting for the right opportunity.<br/><br/>She had traveled vast distances from the far west to reach Wind God Valley, all for the Golden Roc’s egg.<br/><br/>She was not going to give up that easily.<br/><br/>Now, the Golden Roc had just given birth and was at its weakest. If she didn’t seize this opportunity now, there would be no chance in the future.<br/><br/>However, she wouldn’t recklessly throw her life away. She had enough patience.<br/><br/>She was waiting, waiting for the opportunity to strike.<br/><br/>“Again?”<br/><br/>Suddenly, she sensed an unusual fluctuation, identical to the one from earlier in the day when that man appeared.<br/><br/>Another powerful being from the human realm had used the Teleportation Array to get to the Ruizhen continent?<br/><br/>At the same time, a strong aura burst out from the Golden Roc in the valley, accompanied by a strong sense of hostility.<br/><br/>As someone who had been dealing with extraordinary beings all her life, the Ice and Snow Queen could deduce the emotions of such beings. Right now, the Golden Roc was expressing hostility.<br/><br/>The Roc’s abnormal reaction sparked the Queen’s curiosity.<br/><br/>Yesterday, when the male figure descended, it did not show such hostility.<br/><br/>At this moment, a silhouette appeared in the valley.<br/><br/>The moment the Ice and Snow Queen set her eyes on the figure, chills ran down her spine, and her head spun, leaving her momentarily stunned.<br/><br/>Her Beastmaster instincts told her, that was an extraordinary being!<br/><br/>A human form!<br/><br/>A mythical level extraordinary being?<br/><br/>Since the existence of the Beastmaster profession, the only extraordinary being that could transform into a human form was the mythical level pet beast of the God of Beastmasters.<br/><br/>This turned into a universally recognized symbol for mythical level beings.<br/><br/>But now before her, a human form of an extraordinary creature appeared.<br/><br/>No, not right, not mythical level.<br/><br/>It’s Totem Level!<br/><br/>As a top-level legendary Beastmaster, the Ice and Snow Queen could easily determine the rank of extraordinary creatures.<br/><br/>However, this judgement made her hard to believe.<br/><br/>“How could that be possible?”<br/><br/>“A Totem Level, how could it take human form?”<br/><br/>Filled with confusion, the Ice and Snow Queen was unsure if she should trust her professional judgement or the universally recognized belief.<br/><br/>Just then, the human-formed creature looked her way, its seemingly tangible gaze penetrated her disguise and pierced her heart, causing her mind to go blank for a moment.<br/><br/>By the time she regained her senses, the silhouette disappeared.<br/><br/>It was as if everything that just happened was merely an illusion.<br/><br/>She stood there, her scalp tingling in fear.<br/><br/>It was too terrifying….<br/><br/>…<br/><br/>…<br/><br/>“He’s here!”<br/><br/>Gu Yang suddenly had a sense of foreboding, he knew Saint Chao Yang had descended into this world.<br/><br/>Faster than he thought.<br/><br/>However, the time he had gotten within half a day was enough.<br/><br/>In this half-day, he had completed over sixty simulations consecutively.<br/><br/>Finally, he found the breakthrough to the Unleaking Realm in the “Taixuan Heavenly Book”.<br/><br/>This Heavenly Book was extremely profound, covering an extensive range of knowledge.<br/><br/>These seemingly cumbersome pieces of information were the cornerstone to the path of cultivation.<br/><br/>He had no master, no one to explain these insights, he had to rely on his own comprehension, and used nearly eighty simulations to grasp the essence of the Unleaking Realm and Nascent Soul Stage.<br/><br/>Of course, these many simulations were not without their rewards.<br/><br/>His cultivation of the God Refining Chapter reached its ninth level, reaching its culmination.<br/><br/>The cultivation of the Divine Tiger Manual, Divine Turtle Manual, Divine Dragon Manual, “Divine Candle Technique” as well as the “Divine Ghost Technique” all broke through to the seventh level. The incarnations of all five divine beasts reached the Unleaking Realm.<br/><br/>If he combats now, he could summon seven Unleaking Realm divine beasts, scaring his opponents to death.<br/><br/>Additionally, the “Divine Qilin Technique” that he just started cultivating reached the sixth level.<br/><br/>A pity, there’s one more to go.<br/><br/>If he could cultivate all nine divine beasts to the seventh level, he could directly step into the Unleaking Realm.<br/><br/>The “Nine Heavens Divine Method” required balance, all nine divine beasts had to reach the same realm together to achieve a breakthrough, the requirements were demanding indeed.<br/><br/>Besides, the incarnations of the two most profound cultivation manuals, the “Divine Phoenix Manual” and the “Divine Ape Technique,” have reached the third level of the Unleaking Realm. Their fighting capabilities have thus climbed up another notch.<br/><br/>His current strength has nearly doubled compared to before.<br/><br/>“But it’s still not enough!”<br/><br/>In the simulation, this level of strength still fell short against Saint Chao Yang.<br/><br/>Even with the release of the blood bats, he still couldn’t win.<br/><br/>A wide gap of a major realm and one sub-level was just too wide to be bridged by the divine beast incarnations alone.<br/><br/>“Again!”<br/><br/>Gu Yang initiated the simulation once more.<br/><br/>[At twenty-two years old, you are a legendary Beastmaster at the third stage of Mana.]<br/><br/>[You head to the Ruizhen Continent and are soon caught by Saint Chao Yang. You release the blood bats to obstruct while you escape.]<br/><br/>[The battle between Saint Chao Yang and the blood bats caught the attention of a mythical Beastmaster, spawning a fierce battle.]<br/><br/>[You don’t escape far before you are captured by another mythical Beastmaster. Your divine beast incarnation is taken as her pet, forming a special bond.]<br/><br/>[Some years later, Saint Chao Yang returns to Ruizhen Continent with two Celestial Beings, and then disappears after attacking the Beast God Temple.]<br/><br/>[You cultivate diligently in the Ruizhen Continent. Five years later, powerful beings from the Yao Chi descent from the Immortal Palace, and the natives of the Ruizhen Continent retreat, backing all the way to the Beast God Temple.]<br/><br/>[A year later, the Yao Chi Immortal Palace launches a final attack. Amidst the chaos, you seize an opportunity, successfully breaking through the secret harbored in the human body, attaining the Unleaking form.]<br/><br/>[…]<br/><br/>“Got you.”<br/><br/>Suddenly, a cheerful voice rang out behind Gu Yang.<br/><br/>Almost at the same time, he felt his shoulder tighten as a hand held him down, sealing his Mana. He could no longer use it.<br/><br/>So quickly.<br/><br/>Gu Yang managed to catch the last few lines from the simulation before his eyes. His gaze slightly shifted and didn’t resist Saint Chao Yang’s grasp.<br/><br/>With Saint Chao Yang’s strength, he was easily controlled.<br/><br/>PS: Seek monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}