{"id": 320, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132240.html", "title": "Chapter 320 - Chapter 320: Lingbao 320", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 320 - Chapter 320: Lingbao 320</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 320: Lingbao 320<br/><br/>Nascent Soul stage Monster Beasts!<br/><br/>Two – no, three of them!<br/><br/>Just who exactly is this person?<br/><br/>Murong felt a chill crawling on his scalp when he saw “Daoist Huangmu” being killed by the young man with a single slash.<br/><br/>The young man turned a cold gaze towards him, sending shivers down his spine, he could not help but swallow hard. “I…I mean no…no offence. I beg for mercy… in return, I am willing to… to surrender… the ancient immortal’s remaining mansion to you.”<br/><br/>This plea, was close to begging for his life.<br/><br/>In the Yellow Spring Cave, any hot-blooded cultivator would have been long dead. The only ones left alive are adaptable individuals who could easily shed their dignity and reputation, just for the sake of survival.<br/><br/>Gu Yang effortlessly caught Luo Kun’s sword, the Frost Frost edging was hardly a challenge.<br/><br/>The spirit contained within this peerless divine weapon was on the verge of disintegration.<br/><br/>He put the weapon away, he observed the cultivator with horns growing on his forehead, and asked, “Who are you?”<br/><br/>Murong answered honestly, “My name is Murong Jie, from the Four-Heavens Alliance.”<br/><br/>Four-Heavens Alliance?<br/><br/>Gu Yang hadn’t heard of it, “How do you know him?”<br/><br/>“To be honest, I am one of the eight representatives of the Four-Heavens Alliance, specifically in charge of exchanging information with peripheral powers. I’ve known Daoist Huangmu for over a hundred years.”<br/><br/>“Tell me about the Four-Heavens Alliance.”<br/><br/>…<br/><br/>While the two were chatting, strange creatures and blood bats occasionally approached them but were easily killed by Gu Yang.<br/><br/>He would release the blood bat pet whenever he encountered one, using the Union technique to indirectly control them.<br/><br/>Blood bats are quite interesting creatures. After forming a Union, the strongest blood bat would lead, and the weaker ones willingly serve and follow commands.<br/><br/>It’s worth noting that the relationship between a Beastmaster and his beast is symbiotic. Not only can the Beastmaster borrow the power of the beast, but the beast can also borrow the Beastmaster’s power.<br/><br/>If Gu Yang lent his power to the blood bat beast, it could subdue other blood bats, gather them, and even incorporate them into the Beast-taming Space.<br/><br/>This means, after the Union, they become one.<br/><br/>After listening to Murong Jie’s introduction, Gu Yang finally understood what the Four-Heavens Alliance was.<br/><br/>It was the last bastion of the human race. After the fall of the sun, several major sects fell one after the other. Only the final super sect remained, standing as a beacon of hope.<br/><br/>Thereafter, the surviving cultivators all joined that sect and collectively resisted the apocalypse. Then they established the Four-Heavens Alliance. The alliance represented the four most powerful sects in the world.<br/><br/>Even though humanity continued to fall back, as long as the Four-Heavens Alliance still stood, there still was hope for the human race.<br/><br/>In addition to self-preservation, the Four-Heavens Alliance actively reached out to other human settlements, sharing information. Envoys like Murong Jie were responsible for field operations.<br/><br/>After listening to all of this, Gu Yang put away his blade and said, “You may leave now.”<br/><br/>Murong Jie was taken aback at first, then quickly thanked him with a bow, “Thank you.”<br/><br/>He then turned and flew away, his ruler bobbing above his head.<br/><br/>He left without hesitation, not even glancing back at the cave mansion. Murong Jie knew, better than anyone, only by staying alive, could he have everything. Otherwise, even the best luck would be useless.<br/><br/>Those who couldn’t see this truth, like “Daoist Huangmu” who had just been overcome by greed, were now dead.<br/><br/>Even with numerous opportunities in a cave mansion, it was useless without life.<br/><br/>…<br/><br/>After Murong Jie left, Gu Yang looked at the constantly spewing Spirit Qi from the cave mansion. Instead of rushing in, he decided to open the System.<br/><br/>This world was already this broken, yet this mansion remained intact. Surely, it was no ordinary place.<br/><br/>Just to be safe, let’s run a simulation.<br/><br/>[…You enter an ancient immortal mansion and trigger a spirit treasure inside. You’re beheaded with a single sword stroke. Age at death, twenty-two.]<br/><br/>Good Lord!<br/><br/>There’s actually a complete spirit treasure inside that can kill him with a single stroke. That killing power far surpasses the Unleaking Realm.<br/><br/>Lucky he didn’t rush in, otherwise it would have cost him his life.<br/><br/>Gu Yang glanced inside and saw a shadowy figure continuously invading the cave mansion. In just a short time, the shadow had invaded about ten meters.<br/><br/>He turned away and promptly left.<br/><br/>Not long after his departure, he encountered a group of blood bats. He released the blood bat beast and gathered them all.<br/><br/>Proceeding in this way, he made his way deeper into the cave, killing and collecting as he went.<br/><br/>The deeper he went, the fewer blood bats and odd creatures he encountered.<br/><br/>After a few hours, the number of blood bats Gu Yang’s beast had gathered exceeded one hundred. After forming a Union, their combined Mana power was staggering.<br/><br/>Boom!<br/><br/>Suddenly, an astounding aura burst forth.<br/><br/>He turned around and sensed that the source of the energy was right at the cave dwelling’s location.<br/><br/>A smirk formed at the corner of his mouth. Finally, what’s inside had been forced out.<br/><br/>The world’s contamination is too severe. The cave dwelling’s door, once opened, can’t help but be polluted.<br/><br/>After such a long time, the entire cave dwelling must have been contaminated.<br/><br/>“This energy, doesn’t feel like a cultivator’s. Could it be just a spiritual treasure?”<br/><br/>Gu Yang judged from the nature of the energy.<br/><br/>If there were people in the cave dwelling, and the door was open for so long with the battle so intense, the people inside couldn’t possibly not react.<br/><br/>It could be certain that there was no living thing inside.<br/><br/>It was very likely that there might only be that spiritual treasure.<br/><br/>About a spiritual treasure in such a perfect state, he was very interested. He had experienced its power from the simulation earlier; it was unimaginably powerful and could kill him instantly.<br/><br/>He opened the system and started another simulation.<br/><br/>…<br/><br/>Moments later.<br/><br/>He opened his eyes and flew back.<br/><br/>His speed was extremely fast and halfway there he felt the movements getting more intense.<br/><br/>“It’s another Unleaking Realm monster beast.”<br/><br/>Gu Yang was surprised. He had no idea where it came from.<br/><br/>The spiritual treasure failed to kill that monster beast. They fought for a long time, but the monster beast’s power only decreased a bit.<br/><br/>Finally, he arrived at the scene and couldn’t help but take a deep breath at the sight.<br/><br/>Countless monster beasts were pouring down from the top of the cave, madly rushing towards the entrance. They clumped together in frenzy.<br/><br/>A golden hammer was darting around amongst the beasts, smashing any monster beasts that made contact into pieces.<br/><br/>Even the biggest Unleaking Realm monster couldn’t stand against its strike.<br/><br/>But in the blink of an eye, the dissipated black fog recondensed and preserved its form, continuing to rush towards the cave.<br/><br/>Gu Yang finally understood why this spiritual treasure was unable to defeat the monster beasts.<br/><br/>Its main mode of attack was physical. Even though it was incredibly powerful and could squash him easily, it wasn’t effective against these monsters.<br/><br/>The one thing monster beasts are least afraid of is physical attack. It barely injures them.<br/><br/>Just like him not letting his Divine Ape face the monster beasts.<br/><br/>The monster beasts are the bane of the spiritual treasure, continuously exhausting its energy until it’s worn out.<br/><br/>Gu Yang called, “Hammer, come to me.”<br/><br/>The golden hammer didn’t respond to him and continued recklessly ravaging the beasts.<br/><br/>He was in no hurry, seizing the opportunity while the beasts were raving, and killed as many as he could on the periphery.<br/><br/>One strike, and he could harvest energy.<br/><br/>If one strike didn’t do it, he’d go in for a few more.<br/><br/>The beasts were so attracted to the cave dwelling that they paid him no mind.<br/><br/>Gu Yang hid at the edge, slaughtering wildly; his Energy Points were continuously increasing. What a pleasure it was.<br/><br/>With the hammer to attract their attention, getting this energy was like getting it for free.<br/><br/>Halfway through, Gu Yang’s mana ran out. He collected the rewards from his earlier simulation and instantly revived back to full health to carry on with the harvest.<br/><br/>Gradually, his energy balance was approaching two thousand points.<br/><br/>At this point, the hammer finally seemed to not be able to hold on any longer, as the beasts weren’t afraid of death and their charge was consuming its energy little by little.<br/><br/>The golden glow on the hammer dulled significantly, and its strength for each strike decreased significantly.<br/><br/>With its last strike, it landed on the biggest monster beast yet it wasn’t able to disperse it. Instead, the hammer was knocked back.<br/><br/>Whoosh!<br/><br/>It finally couldn’t withstand it anymore and changed its course, flying towards Gu Yang and landing in his hand.<br/><br/>“Wouldn’t this have been better earlier.”<br/><br/>Smiling, Gu Yang claimed the spiritual treasure.<br/><br/>The hammer suddenly vibrated, a rough voice sounded in his mind, “Boy, I didn’t say I recognize you as my master. Your cultivation is so low, you’re not qualified to be my master.”<br/><br/>Pretty proud, isn’t it.<br/><br/>Just as Gu Yang was about to reply, he suddenly sensed something was off. He saw the group of monster beasts all turn their heads and look at him.<br/><br/>Not good!<br/><br/>He felt a chill down his spine, facing hundreds of Mana Realm monster beasts. If they rushed at him, he couldn’t withstand it.<br/><br/>Run!\t\t\t\t\t\t</div>", "images": {}, "success": true}