{"id": 333, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132268.html", "title": "Chapter 333 - Chapter 333: 333 Missed Opportunities", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 333 - Chapter 333: 333 Missed Opportunities</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 333: 333 Missed Opportunities<br/><br/>Gu Yang felt himself plunging into darkness, as if he had fallen into a dark void. Forces from all directions were tearing at his body, threatening to rip him apart.<br/><br/>“Mysterious light shield!”<br/><br/>He quickly unfurled the mysterious light shield, erecting a dark shield that protected both him and Saint Chaoyang next to him.<br/><br/>This time, he did not hesitate to use up his mana, maximising the power of the mysterious light shield.<br/><br/>However, the tearing power from outside was terrifyingly strong. His mana was being used up rapidly and within a few breaths, he had aged by several decades.<br/><br/>Continuing like this for long, he would die from exhaustion of his life essence.<br/><br/>“Wake up.”<br/><br/>Gu Yang slapped the face of the young girl next to him.<br/><br/>She had just taken a strong blow, forcibly tearing open the space. When the space shattered, she got most of the backlash and passed out.<br/><br/>Two slaps woke her up, and she slowly came back to consciousness.<br/><br/>Without time to blame him, she took something out of her bosom and threw it out.<br/><br/>Immediately, they were pulled by a force that broke the space, causing another bout of dizziness.<br/><br/>Gu Yang could finally see light, and his feet were on solid ground again.<br/><br/>They were in a forest, in front of a monstrous tree, full of pink flowers. A fragrant smell that could intoxicate filled the air.<br/><br/>His eyes lit up, “Is this the main body of the Red Moon Great Saint?”<br/><br/>The young girl next to him was now almost fainting, pale as paper, with cold sweat on her forehead. Without the support of Gu Yang, she would have collapsed on the ground.<br/><br/>Before he waited for her to reply, he had already flown towards the top of the tree.<br/><br/>The target was the three mature peaches on the top.<br/><br/>Suddenly, three figures blocked his way, all of them were unfailingly powerful warriors of the Unleaking Realm.<br/><br/>The three men were about to confront him, but seeing the girl, they got startled and began to greet respectfully, “Greetings to the Saint Master–”<br/><br/>Before they could finish, their heads were flying.<br/><br/>Gu Yang used their courtesy as a distraction and beheaded them in a surprise move.<br/><br/>At such close range, with his current power, it was almost as if they were giving away their lives.<br/><br/>[Earned 200 Energy Points, current balance 504 points.]<br/><br/>[Earned 200 Energy Points, current balance 704 points.]<br/><br/>[Earned 300 Energy Points, current balance 1004 points.]<br/><br/>Two in the intermediate Nascent Soul stage and one in the late Nascent Soul stage.<br/><br/>Under his sword, killing them was as easy as slaying chickens.<br/><br/>Without any hesitation, Gu Yang flew up to the top of the tree and plucked the three just-ripe peaches at the very top.<br/><br/>Just then, the giant peach tree came to life and lashed out with a massive branch.<br/><br/>Gu Yang agilely dodged the attack.<br/><br/>Following that, countless pink petals took flight, filling the space, and a figure gradually emerged among them.<br/><br/>“Run.”<br/><br/>Without looking back, Gu Yang, transformed into a Phoenix, grabbed Saint Chaoyang and flew away as he unceremoniously crammed a peach into her mouth.<br/><br/>When the peach touched her lips, it turned into sweet juice and quickly replenished her drained Immortal Element, a hint of rosy color returning to her pale face.<br/><br/>Behind them, countless petals rained down, gaining speed.<br/><br/>Just as they were about to be caught, Saint Chaoyang had recovered some strength and with a swipe of her hand, split the space once again. In a flash, they appeared atop a glacier.<br/><br/>Finally made it out!<br/><br/>Gu Yang had a sense of foreboding that even though he had completely sealed up his physical body and isolated it from the outside world, his lifespan was still rapidly depleting.<br/><br/>The natural depletion of his lifespan was several times faster compared to his time in the Peach Source Heaven.<br/><br/>If his lifespan were previously at ten thousand years, then at his current rate of depletion, he would be left with about four to five thousand years at most.<br/><br/>Saint Chaoyang next to him also sealed her body.<br/><br/>No wonder the Celestial Beings of the Four Great Sacred Lands rarely ever ventured into the Great Zhou.<br/><br/>So it turns out that the speed at which their lifespan depletion in this world was much faster than those of the Cave Heavens.<br/><br/>Gu Yang now understood.<br/><br/>These thoughts flashed across his mind in an instant. A phoenix had already flown out from his forehead, bearing the weight of both of them; with a flap of its wings, it shot straight into the sky.<br/><br/>Moments later, a pink figure broke through space and arrived, seeming a bit furious.<br/><br/>“Enough!”<br/><br/>A cold voice rang out, soon afterward, a green figure blocked her path.<br/><br/>“Sister Green Lotus, isn’t it a bit too late to play the nice person now?”<br/><br/>The Red Moon Great Saint chuckled softly, “That Emperor is known for his petty nature. Your actions are tantamount to betrayal, when he fully recovers, do you think he will let you off?”<br/><br/>The green figure coldly said, “It’s not him!”<br/><br/>“How can you be so sure it’s not a smokescreen he laid down? That’s the Emperor we’re talking about, how can I rest easy unless he’s completely killed.”<br/><br/>“Don’t forget, that Heavenly Lord as always had his eyes on you. If you really kill Sister, how will you ward him off?”<br/><br/>The green figure said this and slowly faded away.<br/><br/>During their conversation, the two auras had already disappeared from her range of detection.<br/><br/>At the words of Green Lotus, the face of the Red Moon Great Saint changed ever so slightly.<br/><br/>In this world, the only one she feared was the Heavenly Lord of Red Clarity Heaven.<br/><br/>Back in the day, they fought once before. The three sisters joined forces and were barely able to draw a tie with the Heavenly Lord.<br/><br/>If Sister Wutong really died and the Heavenly Lord came after her, she would be hard-pressed to resist on her own.<br/><br/>The Red Moon Great Saint silently sighed in sorrow, knowing she had missed the best chance to kill that human.<br/><br/>…<br/><br/>…<br/><br/>“It’s safe now.”<br/><br/>After flying thousands of miles, Gu Yang felt the vastness of the sky and earth, the Red Moon Great Saint didn’t chase them, and he finally let out a sigh of relief.<br/><br/>Although he knew that the journey would be eventful but not dangerous, the process was still too thrilling.<br/><br/>Any minor accident could turn into a sudden death situation.<br/><br/>Even at the Unleaking Realm, there is still a significant gap between him and the Celestial Being Realm.<br/><br/>Heck, one of them is a Celestial Being who has lived for an unknown number of years after all.<br/><br/>Plants inherently have a long lifespan and are incomparable to animals. Probably on par with ancient Divine Beasts.<br/><br/>Who knows how long Saint Chaoyang and Red Moon Great Saint have been alive.<br/><br/>“But the rewards of this trip were immense.”<br/><br/>Gu Yang thought of the peaches he plucked from the main body of the Red Moon Great Saint and felt content.<br/><br/>This kind of peach can replenish life essence. When Saint Chaoyang, who was almost drained, took one, she quickly recovered.<br/><br/>He accessed the system and initiated a simulation.<br/><br/>[…]<br/><br/>[….Actual Years: thirty-seven.]<br/><br/>Gu Yang was overjoyed with the simulation result. The peach could not increase cultivation level, but it could complement the life essence, indeed a marvel.<br/><br/>This meant that he did not have to worry about depleting his lifespan in the future.<br/><br/>Once the lifespan was nearly used up, he could initiate a simulation, eat a peach, and be fully rejuvenated immediately.<br/><br/>While he was thinking, he saw the young girl who had been stroking the Phoenix’ feathers. When their eyes met, there was a brief awkward moment.\t\t\t\t\t\t</div>", "images": {}, "success": true}