{"id": 339, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132279.html", "title": "Chapter 339 - Chapter 339: 339 Ninth Seal Of Nine Provinces", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 339 - Chapter 339: 339 Ninth Seal Of Nine Provinces</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 339: 339 Ninth Seal of Nine Provinces<br/><br/>Upon hearing this, Qin Guang instantly flew into a rage.<br/><br/>A kidnapping was one thing, but doing it en route was something else.<br/><br/>How dare he announce, in front of hundreds of guests at the entrance of the Qin Manor, his intentions to steal someone away?<br/><br/>Wasn’t this a public assault on the face of the Qin Family?<br/><br/>How could he tolerate such an insult!<br/><br/>The Qin Family, widely recognized as the most significant family in the world today, is so powerful that even the Zhao Family cannot harm it. How could they tolerate the arrogance of someone who has just broken through to the Unleaking Realm?<br/><br/>“You think you can kidnap people from my Qin Manor?”<br/><br/>With a loud roar from Qin Guang, four large white light pillars flew out from all around the Qin Manor. Within the light pillars, a white light dragon flew out, blocking Gu Yang’s way.<br/><br/>“Huh?”<br/><br/>Gu Yang was somewhat surprised. The dragon in front of him was condensed purely from energy and emitted an astonishing aura of oppression.<br/><br/>Its power was at least at the Unleaking Realm.<br/><br/>The light dragon stretched out for dozens of meters. In front of it, Gu Yang seemed so insignificant. Just its head was taller than him.<br/><br/>The Qin Family still held such a card up their sleeve.<br/><br/>In the previous simulation, he didn’t kill his way into the Qin Manor but kidnapped Chu Xiyue halfway instead. On the way back to the Divine City, Qin Wu personally caught up and they had a fight, which ended in a draw.<br/><br/>In the end, Qin Wu voluntarily withdrew.<br/><br/>This time, he chose to forcibly kidnap in public at the Qin Manor in order to completely end this matter here.<br/><br/>He also wanted to know why Qin Wu valued Chu Xiyue so much that he was willing to break through cultivation early and make a move himself.<br/><br/>Qin Wu should be cloistered in a cave world just like Wen Jue.<br/><br/>Suddenly, Chu Xiyue, who was being held by Gu Yang, exclaimed, “It’s the Nine Provinces Grand Array!”<br/><br/>The Nine Provinces Grand Array?<br/><br/>A thought crossed his mind, and he abruptly turned to look at Qin Guang, with his eyes as cold as ice.<br/><br/>Qin Guang snorted coldly, and said in a chilling voice, “Gu Yang, you stand no chance before the Nine Provinces Grand Array. Put her down, leave, and I won’t have to kill you.”<br/><br/>As if to back up his words, the white light dragon let out a roar that echoed throughout Han State City.<br/><br/>A terrifying wave of energy shook the souls of everyone present.<br/><br/>This was a force that had transcended the mundane, and was almost at the level of a Celestial Being.<br/><br/>Gu Yang, who was the first to bear the brunt, remained unaffected, his eyes staring straight at Qin Guang, “Is the Nine Provinces Seal of Han Wang in your hands?”<br/><br/>This place is Han State City, which was Han Wang’s territory during the Xia Dynasty.<br/><br/>There is a Nine Provinces Grand Array here, he immediately thought of the last Nine Provinces Seal that belonged to Han Wang. Could this array be activated with that seal?<br/><br/>Seeing Gu Yang was not taking the Nine Provinces Grand Array seriously, a murderous intent flashed in Qin Guang’s eyes, “If you are seeking death, I will grant you.”<br/><br/>In an instant, the light dragon opened its mouth and shot a beam of white light, engulfing Gu Yang in a blink of an eye.<br/><br/>…<br/><br/>Meanwhile, two figures in the sky, barely visible, were watching the battle below.<br/><br/>One of them had white hair and a white beard, but his face was youthful. He was wearing a Daoist robe and held a duster in his hand. He stroked his beard and said wistfully, “The once formidable Nine Provinces Grand Array that shook all clans is now so weak.”<br/><br/>The other was a golden-armored warrior, his entire person like a statue with an iron-hard gaze, he said in a resounding voice, “Upon the death of the Way of Heaven, the world changed. All things related to Daoyun were invalidated.”<br/><br/>“Even immortal Golden Immortals cannot resist the erosion of time. One by one, they fall, let alone a mere formation? Now you and I only have the cultivation level of a Human Immortal after the collapse of the Way of Heaven; the power this world can accommodate stops at Human Immortal.”<br/><br/>The white-haired Daoist teased, “Who would have thought that the normally silent God General of Jade Dew has so much to say? Slept too long and feeling chatty?”<br/><br/>The golden-armored warrior, the God General of Jade Dew, said, “Master Sichen, what do you think of the individual below?”<br/><br/>Master Si Chen nonchalantly said, “The cultivators of the Human Realm are now all taking the ancient physical cultivation path. This person has even practiced the Monster Race’s methods, his foundations are good, but his cultivation level is too low. He’s not qualified to participate in the Yaochi Conference.”<br/><br/>“We are here for that Qin Wu.”<br/><br/>And with that, he let out a sigh, “A Nascent Soul junior actually requires us personally to deliver invitations.”<br/><br/>The God General of Jade Dew calmly said, “If we don’t, should we bother the True Lords to take the trouble?”<br/><br/>Master Sichen was rendered speechless.<br/><br/>Both of them were from the Immortal Palace of Yao Chi, awakened from a ten thousand year slumber and were ordained to deliver invitations to the top powerhouses of this world to attend the Yaochi Conference.<br/><br/>After ten thousand years of waking and sleeping, only a small part of the Immortal Palace of Yao Chi has survived until today.<br/><br/>Among the survivors, their cultivation level was the lowest, hence the task of running errands naturally fell on them.<br/><br/>“Huh?”<br/><br/>Just at this moment, Master Sichen let out a soft “huh”. He saw that the man had released a clone of the Divine Ape, also at the level of the Nascent Soul, which blocked the light dragon.<br/><br/>“A Divine Ape?”<br/><br/>He was somewhat surprised, but then he noticed something wrong, “No, no, it’s a method of creating a clone from oneself!”<br/><br/>In Master Sichen’s expression, there was a touch of seriousness, saying, “Interesting, this integrates the technique of creating a clone with the essence blood of the Monster Race, producing an external clone. This seems like the style of one of the Sky Lords in the North.”<br/><br/>Following that, the man let out two more divine beasts, the White Tiger and the Black Tortoise. The three divine beasts joined forces and completely overpowered the light dragon.<br/><br/>“There are three divine beast clones.”<br/><br/>Master Sichen exclaimed in surprise, “The Original Spirit of this young man is so powerful. It’s a pity that he was born in the wrong era, if he had been born in ancient times, many Sky Lords would have fought to take him as a disciple.”<br/><br/>“Wait a moment, issue him an invitation.”<br/><br/>The Divine General of Jade Dew responded, “Yes.”<br/><br/>With such strength, he was already qualified to participate in the Yaochi Conference.<br/><br/>…<br/><br/>……<br/><br/>“What?”<br/><br/>Seeing Gu Yang releasing three divine beast clones, each with cultivation at the Unleaking Realm, Qin Guang was taken aback.<br/><br/>Although the formation of Nine Provinces was powerful, it also depended on who was controlling it.<br/><br/>In the hands of their ancestor, it had the power of a Celestial Being.<br/><br/>But in his hands, it only had the power of the peak of the Unleaking Realm. Facing three divine beasts at the Unleaking Realm, he would be outnumbered and defeated.<br/><br/>“His Nine Heavens Divine Law has actually been cultivated to this level.”<br/><br/>Both Qin Guang and Liu Zheng felt unthinkable.<br/><br/>His own progress in cultivation was sky-defying enough, yet he had so quickly managed to cultivate divine beast clones from a technique like the Nine Heavens Divine Law.<br/><br/>Was this even fair to others?<br/><br/>This meant that Gu Yang alone was equivalent to four powerhouses at the Unleaking Realm.<br/><br/>Who in the Unleaking Realm could be his opponent?<br/><br/>These were Divine Beasts! Among beings of the same level, they were nearly invincible. Gu Yang summoned three of them all at once. Even their ancestor would probably find this a headache.<br/><br/>Qin Guang watched in horror as the light dragon was torn apart under the rampant rampage of the three divine beasts and finally turned into a ray of light, completely dispersed in the air.<br/><br/>His face was ashen, and as he looked at Gu Yang, who hadn’t made a move from start to finish, his body couldn’t stop trembling in fear and fury.<br/><br/>Whoosh!<br/><br/>Suddenly, the golden ape appeared in front of him, transformed into a human height, snatched the Seal of Nine Provinces from his hand, showing his teeth to him before flying back to Gu Yang’s side.<br/><br/>Throughout the whole process, Qin Guang was stunned, even his mana was frozen, he couldn’t react at all.<br/><br/>Liu Zheng was also in the same state.<br/><br/>This was the awe of an ancient divine beast. The Divine Ape had reached the third level of the Unleaking Realm, far above them. To kill them was as easy as making a tiny effort.<br/><br/>…Without the Seal of Nine Provinces, Qin Guang’s face turned deathly pale.<br/><br/>That Seal of Nine Provinces was crucial to the Qin Family. In the past, their ancestor relied on the formation of Nine Provinces to obstruct Luo Wang of the Celestial Being realm.<br/><br/>Without the Seal of Nine Provinces, how could their ancestor resist Luo Wang?<br/><br/>This incident was far more serious than Chu Xiyue being kidnapped. It might lead to a disaster for the Qin Family.<br/><br/>On the other side, Gu Yang, having obtained the last Seal of Nine Provinces, was in high spirits, saying, “Tell Qin Wu, if he wants to retrieve the Seal of Nine Provinces, let him come to find me in the Divine City.”<br/><br/>Having said that, he left with Chu Xiyue in a carefree manner.\t\t\t\t\t\t</div>", "images": {}, "success": true}