{"id": 331, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132264.html", "title": "Chapter 331 - Chapter 331: 331 Red Moon Great Saint", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 331 - Chapter 331: 331 Red Moon Great Saint</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 331: 331 Red Moon Great Saint<br/><br/>“Boy, what did you do to offend that woman?”<br/><br/>Within some space, there was no ray of light around and no vitality, Gu Yang was exploring the mysteries of the Unleaking Realm when an aged voice suddenly echoed in his ears.<br/><br/>The voice was cold, without a hint of warmth, just like a venomous snake.<br/><br/>He opened his eyes, and amidst the darkness, a cold glint seemed to sweep past, “Who’s that?”<br/><br/>Just a while ago, Saint Chaoyang had imprisoned him here, but he did not expect there to be someone else in here.<br/><br/>The aged voice echoed again, “A mere Unleaking Realm child like you has been imprisoned in the dark cell, what makes you special?”<br/><br/>A flicker passed Gu Yang’s eyes.<br/><br/>Through the words of the voice’s owner, he discerned several significant pieces of information.<br/><br/>The owner of the voice was at least at the cultivation level of a Celestial Being.<br/><br/>Furthermore, this dark cell most likely wasn’t just holding him, there had to be other Celestial Beings as well.<br/><br/>If Saint Chaoyang could imprison Celestial Beings in here, her strength must exceed his initial assumptions.<br/><br/>Moreover, the voice had mentioned the “Unleaking Realm”, not “Nascent Soul”, indicating that he was from the Divine State and he had trained in Martial Arts.<br/><br/>After the significant revival of Martial Arts, only a dozen or so people achieved the level of Celestial Beings.<br/><br/>Who could this person be?<br/><br/>Gu Yang’s mind turned quickly, a smile surfacing on his face, he asked, “How should I address you, senior?”<br/><br/>“It’s been many years since anyone asked my name. My family name is Shang.”<br/><br/>Shang?<br/><br/>Gu Yang thought for a moment but couldn’t recall any Celestial Being with the family name of Shang.<br/><br/>The number of Celestial Beings in the Xia Dynasty was limited, Lin Family had one, there was Luo Wang, the head of the academy. Counting back further, there was the Xia Emperor’s family, a total of ten people.<br/><br/>The thing was, none of them had the last name Shang.<br/><br/>Going further back, it seemed there was only the Nameless Taoist who founded Dao Sect, and the founder of the Sword Palace.<br/><br/>Then, the aged voice reacted, sounding somewhat disgruntled. “Hey, you haven’t answered the question. Why did that woman imprison you here?”<br/><br/>“Perhaps because I… teased her,” the casual words slipped out from Gu Yang’s mouth.<br/><br/>The aged voice coldly harrumphed, “Good job, slick one. Not a single word of sincerity.”<br/><br/>Then he stopped speaking.<br/><br/>Gu Yang also remained silent, continuing to explore the changes that occurred after breaking through to the Unleaking Realm.<br/><br/>After breaking his physical constraints, his potential had been fully unlocked, this state was somewhat akin to unlocking genetic locks. His strength significantly improved.<br/><br/>His current strength, when fully released, was not inferior to that of the Divine Ape.<br/><br/>But to unleash such terrible strength, he had to pay a price; after all, the human body could not compete with divine beasts like the Divine Ape.<br/><br/>And the price was his lifespan.<br/><br/>He had absorbed so much divine beast essence blood, especially swallowing the Phoenix’s origin twice; thus, Gu Yang possessed an incredibly robust origin, vastly surpassing any Unleaking Realm expert in this world.<br/><br/>Consequently, his lifespan became extraordinarily long.<br/><br/>Now, he could roughly calculate his lifespan. Considering only natural attrition, he could live for more than ten thousand years, over ten times the lifespan of a normal Unleaking Realm expert.<br/><br/>Of course, this was only if he did not use any Mana or Divine Power.<br/><br/>The moment he engaged in a battle, be it using Mana or strength beyond his limits, he would consume his lifespan.<br/><br/>At this moment, he finally understood why Unleaking Realm experts refrained from engaging in duels.<br/><br/>Each time they fought, they could feel their lifespan slipping away.<br/><br/>A single spell cost him several months of lifespan.<br/><br/>An all-out strike drained a year of his life.<br/><br/>Who could bear such a consequence?<br/><br/>Now, Gu Yang also had to consider this issue. No matter how abundant his vitality, it was bound to exhaust eventually.<br/><br/>He would avoid a fight if it was possible.<br/><br/>Fortunately, he could transform into divine beasts.<br/><br/>Using the power of his divine beast transformation wouldn’t consume his origin.<br/><br/>+Right now, his six divine beast forms had reached the Unleaking Realm, plus an Unleaking Realm companion beast and a blood bat, which could easily handle any opponent below the Celestial Being.<br/><br/>“Hey, kid, what’s your name?”<br/><br/>At this moment, the aged voice echoed again.<br/><br/>“My name is Gu Yang.”<br/><br/>“Is the Divine State still under the rule of the Xia Dynasty?”<br/><br/>“No, it is now the Zhou Dynasty.”<br/><br/>“Haha, the Xia Emperor has finally been overthrown. It’s a cause for celebration. Who was it that overthrew the Xia Dynasty?”<br/><br/>“To put it simply, the Four Great Sacred Lands.”<br/><br/>…<br/><br/>From the questions asked by the other party, Gu Yang could infer that this person was from the Xia Dynasty and, judging by his tone, didn’t have a good relationship with the Xia Emperor.<br/><br/>Could it be that the Xia Dynasty’s Celestial Being is the Nameless Taoist who founded the Dao Sect?<br/><br/>The aged voice seemed to have been incarcerated for too long, with a lack of human communication for a long time. The questions came one after another.<br/><br/>Suddenly, he changed the subject and asked, “Kid, do you want to leave this place?”<br/><br/>We’re finally getting to the point.<br/><br/>Gu Yang said, “Senior Shang, do you have a way to leave?”<br/><br/>“Of course there is a way. Do you know what this dark prison is?”<br/><br/>“I await your guidance, Senior.”<br/><br/>“Dark prison, that’s that woman’s mortal body. She transformed her own body into a spiritual treasure. This is a separate space, there is no natural vitality, no material substance. Moreover, once the power leaks out, it gets sucked away. You could say it’s quite malicious.”<br/><br/>“To break open this dark prison, only a power surpassing its physical limit is needed. With my power alone, it falls short. Young man, if you don’t want to die here, lend me your power.”<br/><br/>After listening, Gu Yang asked, “What should the younger generation do?”<br/><br/>“Lend me your power, then I can break open this dark prison.”<br/><br/>“I see.” Gu Yang nodded, and said, “Senior, I refuse.”<br/><br/>“It’s quite simple—huh?”<br/><br/>Gu Yang’s tone was so natural that the aged voice misinterpreted it, thinking he had agreed.<br/><br/>When the elder figure realized what had occurred, his voice deepened, “Are you playing with me?”<br/><br/>Gu Yang laughed, “You played me first. In this kind of place, lending power to you, are you taking me for a fool?”<br/><br/>There was a silence, then a long sigh was heard, “Isn’t it better to obediently offer your power? I really don’t want to fall out with Sister Wutong.”<br/><br/>The originally aged voice suddenly changed into a woman’s voice, filled with bitterness.<br/><br/>Gu Yang was taken aback, and he blurted out, “Red Moon Great Saint!”<br/><br/>Among the three doors of the sanctuary, there are three monster race Celestial Beings.<br/><br/>The Red Moon Great Saint was the most cunning and brutal among them.<br/><br/>Wu Er’s defeat in the past was at the hand of the Red Moon Great Saint. All of his magic power was devoured by her, and he barely managed to survive, becoming living dead.<br/><br/>Gu Yang wasn’t in a hurry because he knew that the Red Moon Great Saint would fall out with the Saint Chao Yang, leading to a great battle.<br/><br/>Then, he would seize the opportunity to escape. Moreover, in the end, he even took an immortal peach from the mortal body of the Red Moon Great Saint.<br/><br/>After eating the peach, his origin became even more vigorous.<br/><br/>Indeed, the Red Moon Great Saint’s mortal body is exactly a peach tree.<br/><br/>The name ‘Peach Origin Heaven’ might have been derived from it.<br/><br/>Unexpectedly, this Red Moon Great Saint is so cunning that she even disguised herself as the Celestial Being who was imprisoned in the same place. Through a series of words, she made him believe her identity.<br/><br/>In the end, she asked him smoothly if he wanted to leave this place.<br/><br/>If it were others, they might have been taken in.<br/><br/>Gu Yang did not actually have any doubts. Just that he knew this dark prison would be broken soon, so there would be no need for him to bother about it. That’s why he refused.<br/><br/>Boom!<br/><br/>Suddenly, the surrounding space violently shook.<br/><br/>“It’s coming!”<br/><br/>The Red Moon Great Saint outside had already launched her attack.<br/><br/>…<br/><br/>…….<br/><br/>“Red Moon, do you know what you’re doing?”<br/><br/>Saint Chao Yang’s voice was filled with extreme anger, his body trembling uncontrollably.<br/><br/>Just now, Red Moon sneakily ambushed her, causing her mortal body to suffer severely.<br/><br/>No matter how she thought about it, she couldn’t comprehend why her dear sister, with whom she had shared a bond for more than ten thousand years, would do such a thing.<br/><br/>In front of her, a figure formed by a group of pale-red mist emerged, with a long sigh, “Sister Wutong, don’t blame me for being ruthless. You are hell-bent on resurrecting the Emperor. I have no other choice but to kill you.”\t\t\t\t\t\t</div>", "images": {}, "success": true}