{"id": 335, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132272.html", "title": "Chapter 335 - Chapter 335: 335 Fear Of The Younger Generation", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 335 - Chapter 335: 335 Fear Of The Younger Generation</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 335: 335 Fear of the younger generation<br/><br/>At the entrance of the Chu Family’s residence, two large red lanterns are hung, and the interior is decorated with bright lights and festive decorations, creating an atmosphere of joy and celebration.<br/><br/>In the backyard, a few people are sitting in the main hall, which has an unusually somber atmosphere.<br/><br/>At the top seat, an old man is leaning on a dragon-headed cane with a hunched body and his eyes closed, seeming to be asleep.<br/><br/>In the middle of the hall, there is a sabre lying on the ground, emitting a silvery glow.<br/><br/>The few people present are all staring at the sabre.<br/><br/>This is the Bright Moon Sabre, the priceless treasure of the Chu Family!<br/><br/>Five hundred years ago, the Chu Family’s ancestor was defeated by Qin Wu, and the Bright Moon Sabre was crushed, inflicting severe damage to himself.<br/><br/>Now, the Bright Moon Sabre has finally returned to its original owner.<br/><br/>The cost of this was the marriage of the direct descendent, Chu Xiyue, into the Qin Family.<br/><br/>Today, the Qin Family’s wedding procession came with the Bright Moon Sabre. After placing the bride in the bridal sedan chair, they left the Bright Moon Sabre at the Chu Family.<br/><br/>By this time, the Qin Family’s wedding procession should have already left Luo Prefecture.<br/><br/>The Chu Family has finally welcomed back its family treasure, but the faces of everyone in the hall show no joy.<br/><br/>This was exchanged with the daughter of the Chu Family; as far as the Chu Family is concerned, it’s an unspeakable humiliation.<br/><br/>But when strength is inferior, one can only endure such humiliation.<br/><br/>A woman at the top finally couldn’t help but speak out, her tone icy-cold, “The shame of today will be avenged tenfold in the future.”<br/><br/>This woman is Chu Xiao, the Chu Family’s second-in-command, with a cultivation level of third Sky Mana.<br/><br/>Over the years, due to injuries, the Chu Family’s ancestor often secluded himself. The Chu Family has effectively been supported by her. In terms of generation, she is Chu Xiyue’s great-grandmother.<br/><br/>Among the nine surnames in the world, the Chu Family is the only one led by a woman. Everyone present is a core member of the Chu Family and all are women.<br/><br/>This is quite rare among all the powers in Great Zhou.<br/><br/>This is directly related to the Chu Family’s cultivation method, only women can practice the Chu Family’s peerless method to perfection.<br/><br/>Thump!<br/><br/>All of a sudden, the old woman sitting at the main seat opened her eyes and struck the ground with the dragon-headed cane in her hand. The Bright Moon Sabre automatically flew into her hand.<br/><br/>In her eyes, a deep hint of puzzlement flashed. She muttered to herself, “What is that old ghost from the Qin Family up to?”<br/><br/>This old woman is the ancestor of the Chu Family. She has lived for a thousand years and once was injured by Qin Wu. She now looks like a frail old woman.<br/><br/>She’s even worse than the ancestor of the Cao family, Cao Jing.<br/><br/>She knows that Qin Wu has been coveting her power.<br/><br/>After the battle all those years ago, Qin Wu had intended to capture her alive after seizing the Bright Moon Sabre.<br/><br/>It was for this reason that she had found an opportunity to escape back to the Chu Family. If Qin Wu had wanted to kill her, she would have been killed.<br/><br/>A year ago, the Qin Family suddenly proposed a marriage to the Chu Family, surprisingly willing to use the Bright Moon Sabre as a betrothal gift.<br/><br/>She has always felt that there must be some kind of scheme involved.<br/><br/>How could Qin Wu be so foolish as to exchange a world-class divine weapon for a mortal woman?<br/><br/>Even so, the offer was something the Chu Family could not refuse.<br/><br/>A mortal disciple able to bring back the family treasure. Even if there was only a slight chance, they decided to gamble on it.<br/><br/>As a result, the Qin Family really sent the Bright Moon Sabre over.<br/><br/>The old woman had been sitting in front of the sabre for a whole day, always hesitant to reach out to take it.<br/><br/>How could Qin Wu so easily return this peerless divine weapon?<br/><br/>Anything out of the ordinary is a sign of trouble.<br/><br/>Are there any imperceptible prohibitions or traps left on it?<br/><br/>It was because of this worry that she had been hesitant to reach out and touch the Bright Moon Sabre.<br/><br/>Only after repeatedly confirming that there were no problems with the sabre did she pluck up her courage and took the Bright Moon Sabre.<br/><br/>There were no traps, nor did anything terrifying prohibited were triggered.<br/><br/>The Bright Moon Sabre safely landed in her hand, and her internal Mana resonated with the treasure in her hand.<br/><br/>Five hundred years!<br/><br/>Even in her heart that had weathered many storms and already quiet as a still water, a hint of excitement irrefutably emerged.<br/><br/>The method she practiced, called “Bright Moon in the Sky”, from the Blue Sky Palace, shares the same origin with the Bright Moon Sabre.<br/><br/>This peerless divine weapon can transform the vitality of heaven and earth into a unique Mana, which is of great benefit to the cultivation of “Bright Moon in the Sky”.<br/><br/>Since losing the Bright Moon Sabre, her cultivation level has stagnated. It is for this reason that the injury in her body could never heal.<br/><br/>Now, once again feeling the power transmitted from the Bright Moon Sabre, she finally sensed the vital energy she had missed for so long.<br/><br/>It would only take a few years for her injuries to fully recover.<br/><br/>She closed her eyes again, her mana flowing into the Bright Moon Sabre, creating a special cycle.<br/><br/>Those present were all core members of the Chu Family, with “Divine Power” cultivation level. Naturally, they could see that their Ancestor was healing her wounds with the power of the Bright Moon Sabre.<br/><br/>A hint of joy finally surfaced on their faces.<br/><br/>If the Ancestor could recover from her injuries, Chu Xiyue’s sacrifice would be worth it.<br/><br/>Boom!<br/><br/>Suddenly, everyone in the presence felt a terrifying aura appearing above the Chu Family residence.<br/><br/>Unleaking Realm!<br/><br/>Their complexions changed drastically.<br/><br/>A powerful being from the Unleaking Realm unveiled their aura, displaying their vast power openly, what did this imply?<br/><br/>Trouble was coming!<br/><br/>The Ancestor seated on the main chair opened her eyes, her face grim.<br/><br/>In the face of a power from the Unleaking Realm, no one dared to be negligent.<br/><br/>However, the aura was incredibly unfamiliar, which they had never encountered before.<br/><br/>She was shocked. When did Great Zhou produce another Practitioner from the Unleaking Realm?<br/><br/>Although Great Zhou was immense, the number of apex individuals was limited. Despite not having met them all, she had heard of them.<br/><br/>However, this person didn’t match any of the Unleaking Realm Practitioners she knew of.<br/><br/>There was only one explanation, a new Unleaking Practitioner had emerged in Great Zhou.<br/><br/>Her thoughts whirling, the old lady had already rushed out the door, “Which esteemed friend has graced us with their presence? I apologize for not welcoming you sooner.”<br/><br/>She came to the unfamiliar power, clearly seeing his appearance.<br/><br/>This was an excessively young man, his mana transformed into flames, morphing into a phoenix. The flames surrounding him were full of spirit, containing an astonishing power.<br/><br/>Just from the uniqueness of his mana, she knew he was a formidable opponent.<br/><br/>The old lady grew more alert, refusing to show weakness, her internal mana exploded outwards. Above her head, a round moon emerged. Moonlight, akin to silver glow, shielded the entire Chu Family within it.<br/><br/>…<br/><br/>“Gu Yang?”<br/><br/>Suddenly, a stunned cry rang out. It was Chu Mei, who had an encounter with Gu Yang before.<br/><br/>That day in Mountain Terrace City, Qi Province, when she went to meet Chu Xiyue she was captured by Lu Yunshan. It was Gu Yang who had helped her and brought her to her senses.<br/><br/>An incredulous look appeared on Chu Mei’s face.<br/><br/>She never thought that, within only a few months, Gu Yang would already possess the cultivation of the Unleaking Realm.<br/><br/>You must know, back then he had just managed to reach the first heaven of mana.<br/><br/>In just a few short months, he went from the first heaven of mana to the Unleaking Realm, becoming one of the most powerful people in this world.<br/><br/>Such a rate of progress was beyond unfathomable.<br/><br/>This is bad!<br/><br/>Suddenly, she realized the purpose of Gu Yang’s visit to the Chu Family. Her face turned pale instantly.<br/><br/>The gossip about Gu Yang and Chu Xiyue had long been spread throughout the world.<br/><br/>The Chu Family, of course, was well aware of this. If it weren’t for Xiyue pleading for him, Chu Xiao, considering his disposition, would have sent someone to kill Gu Yang a long time ago, so as not to disrupt the family’s plans.<br/><br/>With Gu Yang’s cultivation getting higher and higher, and recently reaching the third heaven of mana, the Chu family had even held a discussion about it.<br/><br/>However, the conclusion of that discussion was still to marry Xiyue to the Qin Family.<br/><br/>Compared to offending a person with the third heaven of mana, the Bright Moon Sabre was obviously more important.<br/><br/>And would a figure like Gu Yang offend both the Qin and Chu families for an ordinary girl?<br/><br/>Everyone thought not.<br/><br/>But no one would have thought that Gu Yang would break through to the Unleaking Realm in such a short time.<br/><br/>What was even more unthinkable was that he had truly come to their doorstep, in such high spirits, even with the elder protecting, she still felt her legs go weak.<br/><br/>…<br/><br/>Gu Yang?<br/><br/>Upon hearing this name, the old lady’s pupils slightly shrank. Not long ago, she had heard this name from Xiyue.<br/><br/>“So you are Gu Yang? Truly young and promising!”\t\t\t\t\t\t</div>", "images": {}, "success": true}