{"id": 330, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132262.html", "title": "Chapter 330 - Chapter 330: 330 Has Encountered A Problem", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 330 - Chapter 330: 330 Has Encountered A Problem</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 330: 330 has encountered a problem<br/><br/>Gu Yang looked at Saint Chaoyang across from him, shook his head, and said, “Immortal Palace of Yaochi has already emerged. It won’t be long before they launch their attack. Can you hold them off?”<br/><br/>Saint Chaoyang would undoubtedly refuse to believe his words, saying coldly, “During the time of the great calamity, Immortal Palace of Yaochi hid in the void outside the domain. The Way of Heaven has not yet revived now, why would they appear ahead of time?”<br/><br/>You may not believe it, but it was me who accidentally awakened the primordial spirit of the Demon Suppression Tower.<br/><br/>Before Gu Yang could say this, a voice that shook heaven and earth came, “Jin Yu of Yaochi, invites the three Demon Saints to the Yaochi Conference.”<br/><br/>Immediately, a streak of golden light flew over and stopped in front of Saint Chaoyang.<br/><br/>Her face changed on the spot. She had just said that the Immortal Palace of Yaochi couldn’t possibly emerge earlier, and the very next moment, the invitation was delivered to her.<br/><br/>Gu Yang laughed and said, “Now do you believe? You should know better than me what kind of people are in the Immortal Palace of Yaochi. It is no longer safe here; please send me away.”<br/><br/>Looking at the invitation in front of her, Saint Chaoyang’s expression changed several times. In the end, she took the invitation and communicated through mental transmission, “I will certainly attend.”<br/><br/>The previous voice echoed once again, “We will await your august arrival.”<br/><br/>And everything reverted back to calm.<br/><br/>Saint Chaoyang looked at Gu Yang with a chaotic mind, unsure of what to do with him.<br/><br/>She couldn’t kill him, nor lock him up. Soon, she will be attending the gathering in Yaochi. By that time, with his strength, he could turn Peach Source Heaven upside down, and no one could stop him.<br/><br/>Most of the inhabitants of Peach Source Heaven are Monsters who have obtained sentience through plants and trees. Cultivation in the heavens was slow to begin with, and after the death of the Way of Heaven, growth was even slower.<br/><br/>Presently, she only had two subordinates at the Unleaking Realm by her side. If they were to truly fight, they definitely wouldn’t be a match for Gu Yang.<br/><br/>The crucial point was that she couldn’t bring him to Yaochi.<br/><br/>If that person in Yaochi found out about his existence, they certainly wouldn’t let him go.<br/><br/>Although that individual should still be in hibernation, it was necessary to be cautious.<br/><br/>The more Saint Chaoyang thought about it, the more irritable her heart became. She waved her hand and locked Gu Yang up.<br/><br/>Gu Yang, who was confined in a space without daylight, was content and sitting cross-legged on the ground. He thought it was a good opportunity to consolidate his realm.<br/><br/>The first thing he did was to open the system.<br/><br/>[Do you want to use a life simulator? One use will consume one hundred energy points.]<br/><br/>A hundred points!<br/><br/>The price shot up quite a bit after this breakthrough.<br/><br/>…<br/><br/>…<br/><br/>Divine City, Academy.<br/><br/>“Deputy Principal, those two are fighting again. You have to do something. If this continues, we won’t be able to conduct the lecture.”<br/><br/>In Zhou Zongye’s courtyard, a professor ran over to complain.<br/><br/>“How can I manage?”<br/><br/>Zhou Zongye was also depressed, “One of them can use space Divine Power, and the other has a higher cultivation level than me. I can’t manage them.”<br/><br/>Over the past month, he was really quite drained.<br/><br/>Just as he guessed before, Gu Yang’s women lived here for a few days and then started causing trouble.<br/><br/>The fights were fierce, each time causing him to intervene. Several times, they almost demolished the entire Academy.<br/><br/>The key point was that the senior brother Li Yuan didn’t want to handle this fan. His own strength was inferior and even if he wanted to manage, he couldn’t.<br/><br/>Over the past month, the Academy was smoky and chaotic. Many professors complained and came to him daily.<br/><br/>What could he do?<br/><br/>He was helpless too.<br/><br/>What Zhou Zongye regretted the most was how several months earlier, he invited Gu Yang to the Academy for tea.<br/><br/>Who would’ve thought that Gu Yang wouldn’t show any courtesy and brought several women to live in the Academy all at once?<br/><br/>What angered him the most was that this guy left them behind and took off, leaving him to clean up this mess.<br/><br/>Zhou Zongye swore that when the kid returned, he must make him take all those women away; he couldn’t let them wreck the Academy any longer.<br/><br/>“Let them fight. If anything is damaged, note it down. Later, we will settle this with that kid Gu Yang.”<br/><br/>He was truly exhausted and didn’t want to play the peacemaker anymore.<br/><br/>Fight if they must, it’s not like anyone would die.<br/><br/>Just as they were speaking, the two converging energies suddenly ceased their clash, flying over and landing in their courtyard.<br/><br/>Cao Yiyi, who held a spatial abnormal treasure, demanded, “Where is Gu Yang?”<br/><br/>Zhou Zongye, upon seeing these two ladies, inwardly despaired, “I wish I knew too.”<br/><br/>Another woman anxiously asked, “Vice Principal, my father is in danger. I have to find him.” It was Xi Huang.<br/><br/>Among the various women in the literary academy, only her cultivation level could suppress Cao Yiyi.<br/><br/>Every time Cao Yiyi went berserk, she was the one who subdued her.<br/><br/>She was given this responsibility by Gu Yang before he left.<br/><br/>Immediately following, Ling Ling, Su Qingzhen, Pei Qianlan, Lily, and Eve rushed over.<br/><br/>Ling Ling, with a serious expression, asked, “Principal Zhou, do you know how we can find Gu Yang?”<br/><br/>Zhou Zongye, witnessing all of Gu Yang’s ladies gathered around, couldn’t help feeling puzzled. “How did you know something happened to Brother Gu?” he asked.<br/><br/>All the women turned their eyes to Xi Huang and Eve.<br/><br/>Xi Huang, anxious, expressed, “Just now, I felt a sudden jolt in my heart. It’s a bloodline perception. Something must have happened to father.”<br/><br/>Eve added, “We have a certain pact. I’ve suddenly lost his signal.”<br/><br/>Upon hearing this, Zhou Zongye’s demeanor turned serious, “To find Brother Gu, we need to find someone.”<br/><br/>“Who?”<br/><br/>“The Master of Red Mansion.”<br/><br/>Swoosh—<br/><br/>Ling Ling was the first to fly away. Having resided at the Red Mansion for several years, she knew its location.<br/><br/>Following quickly, Su Qingzhen and the others also went.<br/><br/>Watching their departing figures, Zhou Zongye was far from relieved.<br/><br/>He did not want Gu Yang to end up in a predicament.<br/><br/>…<br/><br/>…..<br/><br/>Outside the Red Mansion, as soon as Ling Ling landed, she saw an old man waiting. It was Elder Shen who took care of her in the past.<br/><br/>Elder Shen nodded his head towards her and handed over a piece of paper, “The master asked me to deliver this to you.”<br/><br/>Ling Ling took the paper, and upon reading it, her face turned pale. It read, “Gu Yang is in the Three Saints Gate.”<br/><br/>One of the Four Great Sacred Lands, the Three Saints Gate, had three celestial beings.<br/><br/>Cao Yiyi and Xi Huang, who arrived almost simultaneously with Ling Ling, also read the contents of the paper and their faces changed drastically.<br/><br/>Soon, Ling Ling, Su Qingzhen, and the others also arrived. After learning of Gu Yang’s location, they all looked worried and frantic.<br/><br/>Ling Ling enquired, “Elder Shen, how can we get to Three Saints Gate?”<br/><br/>Elder Shen replied, “With your abilities, going to the Three Saints Gate would be suicide. Don’t throw your lives away.” Speaking these words, he turned and walked back into the house, closing the door behind him.<br/><br/>“Stop.”<br/><br/>The most hot-tempered Cao Yiyi couldn’t stand this. She drew her Void Wandering Vine, but it was stopped inches from the door by an invisible force. The usually unstoppable Void Wandering Vine missed its target.<br/><br/>Her complexion shifted, but in the end, she refrained from attacking again.<br/><br/>This inconspicuous red building was indeed not simple.<br/><br/>Su Qingzhen, somewhat at a loss, asked Ling Ling, “What should we do now?”<br/><br/>Relatively calm, Ling Ling quickly had an idea, “Currently, we can only go find someone who can help.”<br/><br/>“Where can we find this person?”<br/><br/>“In the palace!”<br/><br/>If there was someone in this world who had a special relationship with Gu Yang, and knew the location of the Three Saint Gate, it had to be the Empress Dowager at the palace.\t\t\t\t\t\t</div>", "images": {}, "success": true}