{"id": 338, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132277.html", "title": "Chapter 338 - Chapter 338: 338 Invalid", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 338 - Chapter 338: 338 Invalid</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 338: 338 invalid<br/><br/>Within the bustling city of Han State, the Qin Family Residence was particularly lively.<br/><br/>The Qin Family’s influence was undeniable. Prominent figures from surrounding states had all arrived to congratulate the marriage of the Qin’s heir with the legitimate daughter of the Chu Family.<br/><br/>Seizing this opportunity, the Qin Family summoned all its Divine Power realm members to discuss important matters.<br/><br/>In the room, there were dozens of Divine Power realm members, ten of whom were Mana realm members. All these people highly respected the Qin Family.<br/><br/>The Qin Family, instead of being just a family, was more like a Sect or even a small-sized court.<br/><br/>More than four hundred years ago, after Qin Wu had taken over Han State, he wiped out all the big and small families within the state’s borders.<br/><br/>Then, in the major cities of Han State, he set up Martial Academies, which were divided into three levels: elementary, intermediate, and advanced.<br/><br/>The number of elementary Martial Academies was the highest and they covered the entire Han State. All those who passed the test could enter the academy, with free food and accommodation, and receive orthodox martial arts education.<br/><br/>The intermediate Martial Academies were located in the county cities. Each county city had two intermediate academies, allowing only the outstanding students from elementary academies to be promoted.<br/><br/>Here, one could learn deeper and higher-level techniques and martial arts, and receive substantial subsidies every year.<br/><br/>The advanced Martial Academies were situated in Han State, with a total of three campuses. They picked the most promising students from multiple intermediate academies every two years.<br/><br/>In the advanced Martial Academy, many secret techniques could be learned for free that were only accessible to nobles outside of Han State.<br/><br/>Moreover, getting into an advanced Martial Academy would bring honor to the entire family, along with many special privileges.<br/><br/>The best students from the advanced Martial Academy also had the opportunity to take Divine Power realm experts as their masters.<br/><br/>Utilizing this system, the Qin Family had discovered countless martial arts prodigies from humble backgrounds over the centuries, nurturing over a hundred Divine Power realm members.<br/><br/>These people, who owed a great debt to the Qin Family, were absolutely loyal to them.<br/><br/>It was safe to say that the power of the Divine Power realm experts under the Qin Family was much stronger than that of Great Zhou.<br/><br/>The Qin family’s ambition was known to all.<br/><br/>However, even at the weakest time of the Great Zhou royal family, the Qin Family kept its troops inactive and did not make any moves.<br/><br/>Their wait was for the ancestral elder of the Qin Family to break through to the Celestial Being realm.<br/><br/>Everyone in the Qin Family knew that as long as Luo Wang of the Zhao Family was still alive, the Great Zhou would remain unshakeable. No matter how many Golden Body or Mana realm members they had, they would not be enough to kill a Celestial Being.<br/><br/>To overthrow Great Zhou, they would have to wait for the Qin Family’s ancestral elder to break through to the Celestial Being realm.<br/><br/>Everyone in the Qin Family knew that this day was not far away.<br/><br/>At this moment, dozens of Divine Power realm members under the Qin Family were gathered here.<br/><br/>Sitting in the main seat was Qin Guang, the number two person in the Qin Family, with triple heaven Mana. As the elder son of Qin Wu, he was regarded as the crown prince in this small group.<br/><br/>When Qin Wu was absent, he was the one in charge.<br/><br/>“The reason I’ve gathered everyone here today is to discuss an important matter.”<br/><br/>In the hall, only his voice could be heard, with all others quietly listening.<br/><br/>Qin Guang cast his eyes over everyone and paused for half a second when he reached a man on his right, then continued, “News has come from the plains that the Barbarians have produced another Celestial Being.”<br/><br/>Upon hearing this, there was some commotion in the room.<br/><br/>This news was quite surprising.<br/><br/>Another Celestial Being in the Barbarians means that their supreme power in the prairie is on par with Great Zhou, even gaining an advantage.<br/><br/>Given the ambitious nature of the Barbarians, their next step would undoubtedly be to invade Great Zhou.<br/><br/>The world was on the verge of chaos.<br/><br/>For the Qin Family, this was a once-in-a-lifetime opportunity.<br/><br/>It would be perfect if the Barbarians and Great Zhou ended up in mutual destruction.<br/><br/>Excitement flickered in many people’s eyes.<br/><br/>However, even so, nobody spoke up. It was evident that the rules of the Qin Family were strictly enforced.<br/><br/>Once they digested this news, Qin Guang turned to the man on his right, “Brother Liu, what do you think?”<br/><br/>Just like that, everyone’s focus shifted to the man in black sitting on the right.<br/><br/>Brother Liu, whose real name was Liu Zheng, looked young. Being a Martial Academy graduate, he was the first foreign disciple to take the Qin Family’s ancestral elder as a master. He was regarded as a senior brother figure by all those from the Martial Academy.<br/><br/>He also had a triple heaven Mana level, a cultivation level that could be regarded as top-notch in the whole world. Even Qin Guang had to pay attention to his opinions.<br/><br/>Liu Zheng’s gaze was somewhat solemn as he said, “This is by no means good news. The Barbarians are predators. If Great Zhou falls, then the Barbarians’ iron hoofs will invade the Divine State, resulting in countless civilian casualties.”<br/><br/>“Even if the two Celestial Beings from the steppes kill Luo Wang and the Principal of the Academy. How can our Master stand alone against them in the future?”<br/><br/>These words were like a bucket of cold water being poured over their heads, causing those who were previously hot-headed to consider the pros and cons.<br/><br/>Qin Guang wasn’t surprised, as he clearly had already considered this, “Does Brother Liu mean to propose an alliance with the Zhao Family?”<br/><br/>As soon as these words were spoken, there was an uproar at the scene.<br/><br/>All present saw the Zhao Family as imaginary enemies, with the ultimate goal to overthrow their rule. They never expected that they would have to collaborate with the Zhao Family one day.<br/><br/>This matter, for the time being, was hard to accept.<br/><br/>Liu Zheng said solemnly, “Such a big matter should be decided by the Master.”<br/><br/>At these words, everyone’s emotions settled down.<br/><br/>Yes, such a big matter can only be decided by the ancestor. When the time comes, as long as the ancestor commands, they will comply.<br/><br/>Qin Guang’s eyes flashed slightly, he was just about to say something, but suddenly his face changed, he exclaimed, “Unleaking Realm?”<br/><br/>Liu Zheng also sensed the terrifying aura in the sky, his face also changed dramatically.<br/><br/>With two swoosh sounds, the two disappeared almost simultaneously. The next second, they appeared in the sky above the Qin’s residence.<br/><br/>The two stood side by side, looking at the blue-clothed man not far away as if facing a serious enemy.<br/><br/>The Unleaking Realm is the existence at the pinnacle of this world, no one dares to underestimate it.<br/><br/>However, this man in front of them did not match any of the Unleaking Realm powerhouses they knew of.<br/><br/>Where did this powerhouse of this level pop out from?<br/><br/>No, this man looks somewhat familiar, he must have been seen somewhere before!<br/><br/>Qin Guang felt somewhat familiar. While thinking, he heard a woman’s voice, “Gu Yang!”<br/><br/>It’s him?<br/><br/>Qin Guang’s mind seemed to explode.<br/><br/>In recent times, he didn’t know how many times he had heard the name Gu Yang.<br/><br/>A few months ago, when Gu Yang broke through to the Mana Realm, he became a character that every power could not bypass.<br/><br/>Detailed information about this man was placed in front of every power’s high-ranking officials.<br/><br/>When this man reached the strength of the third tier of Mana, and took the first place in the Grandmaster list, even Qin Guang could not ignore him anymore.<br/><br/>The first in the Grandmaster list, that is the first person under the Unleaking Realm.<br/><br/>That day, detailed information about Gu Yang and Chu Xiyue was also delivered to him.<br/><br/>Qin Guang had imagined that Gu Yang might appear at the wedding. This man’s actions were unpredictable.<br/><br/>Indeed, he came!<br/><br/>However, Qin Guang could never imagine that he was already in the Unleaking Realm.<br/><br/>Didn’t he break through to the Mana Realm just a few months ago?<br/><br/>How could it be so fast?<br/><br/>Qin Guang was doubting everything.<br/><br/>He and Liu Zheng have been at the third tier of Mana for a hundred and fifty years, but till now, they still haven’t cultivated to the Unleaking Body.<br/><br/>But the other person stepped forward in just a few months.<br/><br/>How could he not be shocked?<br/><br/>Liu Zheng on the side also knew that this was the most terrifying enemy he had ever faced in his life, and his body was tense.<br/><br/>“I’m late.”<br/><br/>Gu Yang then landed in front of the bridal sedan, holding the bride, who was about to marry into the Qin Family today, in his arms.<br/><br/>Liu Zheng’s heart sank, knowing there was no wiggle room left with this Unleaking Realm powerhouse.<br/><br/>The Master has always given great importance to the face of the Qin Family. Now someone has come to bully the Qin Family, intending to snatch the young master’s bride in front of many guests.<br/><br/>If they let Gu Yang take her away, the Qin Family will become the laughing stock of the world. That is something the Master cannot tolerate.<br/><br/>He must make a move to stop it.<br/><br/>Just then, Gu Yang lifted his head to look at them and said, “From today, she is free from her engagement to your Qin Family. If you do not accept it, let Qin Wu come find me.”\t\t\t\t\t\t</div>", "images": {}, "success": true}