{"id": 337, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132275.html", "title": "Chapter 337 - Chapter 337: I’M Late.", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 337 - Chapter 337: I’M Late.</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 337: I’m late.<br/><br/>“In my eyes, all of you combined aren’t worth one of Xiyue’s hair. If you dare to morally bind her and force her to do things she doesn’t want to in the future, I’ll make you regret being born into this world.”<br/><br/>Gu Yang’s voice echoed in every Chu family member’s ears, ringing and causing an unbearable pain.<br/><br/>Then, taking the Bright Moon Sabre, he turned and left.<br/><br/>Leaving behind a group of Chu family members in a stupor, unable to recover from the reality of their ancestor being easily defeated.<br/><br/>In the tense silence, the old Chu ancestor suddenly spit out a mouthful of blood, collapsing from mid-air.<br/><br/>“Ancestor…”<br/><br/>Immediately, the scene descends into chaos.<br/><br/>…<br/><br/>Gu Yang, having flown dozens of miles away, was still using his divine power to keep an eye on the situation at Chu’s place.<br/><br/>Seeing the old woman vomiting blood, he couldn’t help but shake his head. She was an old figure of the jianghu, and yet her endurance was so poor. No wonder she was defeated so miserably by Qin Wu back in the day.<br/><br/>He had just taken the Bright Moon Sabre and didn’t kill her on the spot, which was already quite polite, entirely out of respect for Chu Xiyue.<br/><br/>These noble families are all bullies who fear the strong.<br/><br/>In front of the weak, they put on the facade of a thousand-year-old family.<br/><br/>When faced with an unbeatable strongman, they can only endure humiliation, just like when facing the Qin Family.<br/><br/>So, he decided to teach them a lesson to prevent them from causing trouble in the future.<br/><br/>His grabbing of the Bright Moon Sabre just now was a form of deterrence.<br/><br/>He believed that this time, they would receive a lifelong unforgettable lesson.<br/><br/>The old woman is a strong cultivator in Unleaking realm; it won’t be so easy for her to die.<br/><br/>Gu Yang looked in the northwest direction, next, it was time to rescue Chu Xiyue.<br/><br/>Earlier, through the discussions of the people in the Chu mansion, he learned that the Qin Family had taken Chu Xiyue away this morning. At this point, they should not have reached Han State yet.<br/><br/>Han State is the Qin Family’s territory, and it has been one of the most affluent areas in the Divine State since ancient times.<br/><br/>During the Xia Dynasty, the Xia Emperor crowned his eldest son in Han State for a reason.<br/><br/>Throughout history, Han State was a territory of the Chu Family. Later, Qin Wu defeated the Chu Family’s old ancestor and occupied Han State.<br/><br/>Over the next few hundred years, the Qin Family, through various means, continuously ate away at the surrounding territories and has now occupied three and a half states.<br/><br/>Among the original ten clans, the most keen on “expansion” was the Qin Family.<br/><br/>The Qin Family never hid their purpose, which is to one day raise an army against Zhou and restore the rule of the Qin Dynasty.<br/><br/>After all, the downfall of the Qin Dynasty was too wrongful back then.<br/><br/>Some say that it was during the decline of the Qin Dynasty, but in fact, it was the peak period of the Qin Dynasty. The last emperor of the Qin Dynasty governed diligently and was an extremely wise ruler.<br/><br/>His talents were extremely high, and his cultivation level was the highest among the Qin emperors. Having reached the third level of mana, he would undoubtedly be able to step into the Unleaking realm eventually.<br/><br/>This ruler knew how to use talented people well, and under his control, emerged a host of talented individuals, strongmen aplenty.<br/><br/>The barbarians on the prairie, under the suppression of the Qin Dynasty, had no choice but to surrender. If not for the protection of a celestial being, they would have already been annihilated.<br/><br/>The downfall of such a strong Qin Dynasty was only due to the emergence of a celestial being from the Lin Family.<br/><br/>This celestial being completely broke the balance among the major forces and posed a threat to the imperial power. Consequently, a plot to kill the celestial being of the Lin Family was initiated.<br/><br/>The war that ensued engulfed the entire continent.<br/><br/>Not a single one of the Four Great Sacred Lands was spared. The Blue Sky Palace, the Three Sacred Gates, the Red Bright Heaven, and the Star Sea were all drawn into it.<br/><br/>What’s even more ridiculous is that even the celestial being from the prairie was involved in the extermination.<br/><br/>Finally, the Lin Family’s celestial being fell, the Qin Dynasty’s imperial family was decimated, and not long after, this powerful dynasty began to collapse.<br/><br/>If we were to say who the victors were from the battle five hundred years ago, Red Bright Heaven was one, the Three Sacred Gates were another, and Zhao Taizu who picked up the remains was another.<br/><br/>The real winner in this was the celestial being from the barbarian prairie, not only was he able to eliminate a huge threat, but also cause the powerful Qin Dynasty to collapse, providing the barbarians an opportunity to develop and grow stronger.<br/><br/>Qin Wu, the most outstanding figure in the history of the Qin imperial family, was the youngest son of the last emperor of the Qin Dynasty.<br/><br/>Maybe it was because the fortune of the Qin Dynasty had been transferred to him. He managed to carve a bloody path and establish his impressive reputation with just his power. Even the Great Zhou imperial family couldn’t do anything to him.<br/><br/>Not long after, this man even broke through to the realm of a celestial being and officially raised an army against Zhou. If not for the invasion of the Star Sect, he might have been able to achieve the feat of reviving the Qin Dynasty.<br/><br/>In the last thousand years, the only ones who have managed to become celestial beings before him were a mere three.<br/><br/>The one from the Lin Family, the dean of the literature institute, and Luo Wang.<br/><br/>To say that he was the protagonist of an era wouldn’t be an exaggeration.<br/><br/>Now, the legendary figure Gu Yang is about to face is just such a person.<br/><br/>For someone like Qin Wu to personally arrange a marriage for a descendant, and moreover use the peerless divine weapon, the Bright Moon Sabre, as a betrothal gift, there must be a reason.<br/><br/>Gu Yang thought that it was very likely related to the secret Chu Xiyue held within her.<br/><br/>It seemed that she had the original spirit of an ancient great power in her.<br/><br/>Of course, it might also be because of her special constitution, that she was able to attract the original spirit of an ancient great power in the Immortal Palace.<br/><br/>Regardless, it indicates that she is a special individual.<br/><br/>It’s highly likely that Qin Wu, for this reason, proposed marriage to the Chu family to marry her to Qin Shang.<br/><br/>As for why he took such a roundabout approach, it’s very likely to make her cooperate willingly.<br/><br/>…<br/><br/>“Found her!”<br/><br/>After Gu Yang flew out of Luo Prefecture and continued west, crossing through another state, and when he was about to enter Han State, he finally located Chu Xiyue.<br/><br/>He didn’t rush to catch up, but opened the system and launched another simulation.<br/><br/>[At the age of twenty-three, you have reached the first level of the Unleaking Realm. You snatch the Bright Moon Sabre from the Chu Family’s patriarch, causing a shock around the world.]<br/><br/>[…only to die at twenty-three.]<br/><br/>Gu Yang looked at the result of the simulation, contemplating thoughtfully.<br/><br/>This simulation had inevitably been followed by new variables, thus provoking new dangers.<br/><br/>Dangers he could not avoid.<br/><br/>Anyway, each time his cultivation level increased, he would encounter various accidents.<br/><br/>He had grown accustomed to it.<br/><br/>After a moment of contemplation, Gu Yang had made up his mind.<br/><br/>He did not immediately reveal himself, instead trailing behind the Qin Family’s wedding procession all the way to Han State City.<br/><br/>At that moment, the city was adorned with lanterns and colored banners. The entire city seemed to be beaming with a festive atmosphere.<br/><br/>When the wedding cortege appeared within the city, it caused a great sensation, and people fell in line one after another.<br/><br/>Soon enough, the entire procession extended to several kilometers.<br/><br/>The clamor was such, that it left Chu Xiyue, seated inside the bridal sedan, feeling agitated.<br/><br/>Though she had prepared herself mentally, seeing the Qin Family’s home get closer and closer, dressed in her bright red wedding gown, she felt increasingly uneasy.<br/><br/>Once she married into the Qin Family, she would no longer belong to the Chu Family.<br/><br/>Before she sat in the bridal sedan, her mother had personally destroyed her cultivation base and made her vow never to teach the Chu Family’s cultivation techniques to outsiders.<br/><br/>Now, with her cultivation completely destroyed and her ties with the Chu Family severed, not to mention being married to the enemy… she had no future.<br/><br/>For the first twenty years of her life, she had enjoyed a smooth sail.<br/><br/>She had always imagined taking over the reins of the Chu Family, finding a husband, raising descendants, advancing to the Divine Power realm, Mana realm, even the Unleaking realm, and carrying forward the glory of the Chu Family.<br/><br/>Who would have known that an engagement gift from the Qin Family would completely change her destiny…<br/><br/>Since then, her life had become dull and lackluster.<br/><br/>She did not know what kind of fate awaited her in the Qin Family.<br/><br/>What was the true motive behind the Qin Family’s extravagant effort to marry her?<br/><br/>Could it be for the Chu Family’s cultivation technique?<br/><br/>For Chu Xiyue, who had lost her cultivation and become an ordinary person, the unknown future filled her with fear.<br/><br/>The cheer from all directions, the deafening sound of gongs and drums, were like monsters devouring her.<br/><br/>“Gu Yang…”<br/><br/>At this time of despair, she silently summoned his name, finding some strength deep within her heart, which was sliding into the abyss.<br/><br/>Her mind flickered with memories of her times with Gu Yang.<br/><br/>“If you don’t wish to marry, I can help you.”<br/><br/>His words from a year ago in Jiangzhou echoed in her ear.<br/><br/>Had she accepted his offer then, her destiny would have been entirely different, right?<br/><br/>Chu Xiyue allowed her imagination to run wild, dreaming of eloping with Gu Yang, spending every night with him. What a fairy-tale-like life that would be.<br/><br/>Even if it were only for a year’s time.<br/><br/>A sweet pain welled up in her heart. She murmured, “Where are you now?”<br/><br/>Just then, the bridal sedan halted. They had arrived at the Qin Mansion.<br/><br/>The curtain lifted, and a beam of light shone on her feet. The lotus flower embroidered on her red shoes was dazzling in the sunlight.<br/><br/>“Xiyue.”<br/><br/>A familiar voice came, it was her aunt Chu Lianxing who was responsible for her wedding, “We’re here.”<br/><br/>No matter how long and winding the road, there would always be a destination.<br/><br/>At this moment, she felt that her life too, had arrived at its end.<br/><br/>Chu Xiyue stiffly raised her hand, placing it on her aunt’s arm, and stepped out of the bridal sedan.<br/><br/>People were gathered all around, and various noises poured into her ears, yet her heart was oddly calm.<br/><br/>Suddenly, all the noises came to an abrupt halt.<br/><br/>From being unbelievably noisy a second ago, the environment instantly turned so silent that you could hear a pin drop.<br/><br/>A curiosity welled up within her.<br/><br/>What on earth was going on?<br/><br/>“Gu…Gu Yang—”<br/><br/>Suddenly, her aunt by her side stammered with a trembling voice.<br/><br/>Gu Yang?<br/><br/>Upon hearing this name, Chu Xiyue felt faint for a moment. She hastily removed her wedding veil and saw that faces around her were pale, some even collapsing. Only a few remained standing.<br/><br/>Feeling something, she looked up to see the man she longed for day and night, descending from the sky.<br/><br/>“Sorry, I’m late,” he said gently.<br/><br/>Chu Xiyue’s tears gushed out like a breaking dam.<br/><br/>PS: The novel has reached 800,000 words. I’ve been experiencing a bit of writer’s block these past few days while trying to gather my thoughts for the upcoming outline. That’s the situation.\t\t\t\t\t\t</div>", "images": {}, "success": true}