{"id": 334, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132270.html", "title": "Chapter 334 - Chapter 334: 334 A Year’S Promise", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 334 - Chapter 334: 334 A Year’S Promise</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 334: 334 A Year’s Promise<br/><br/>Gu Yang locked eyes with the girl, the atmosphere turning slightly awkward. As he was about to speak, the girl swooshed and leapt up, disappearing in the blink of an eye.<br/><br/>She left just like that, without uttering a single word.<br/><br/>Gu Yang watched her leave, not following her.<br/><br/>What would it accomplish to follow her? Let’s say he could defeat her, would he then have to kill her?<br/><br/>If that happened, he alone would not be able to fend off the Red Moon Great Saint.<br/><br/>“Just how big is this world?”<br/><br/>Gu Yang looked out at the boundless ocean, a question suddenly arising in his mind.<br/><br/>The entrance to ‘Tao Yuan Heaven’ was in the extreme north, everywhere was glacier, its geographical location somewhat similar to the North Pole.<br/><br/>Back then, Saint Chaoyang had taken him from the southeast end of Great Zhou, torn through the entire continent, flown across an ocean several times larger in scope than the continent itself, just to reach those glaciers.<br/><br/>He had long since returned his geographical knowledge to his geography teacher, but by his reckoning, the size of it easily surpassed Earth’s by dozens of times.<br/><br/>Many powerful creatures resided in this boundless ocean, some of them even reaching the Divine Power realm.<br/><br/>In the depths of the ocean, he could occasionally sense the existence of Celestial Beings.<br/><br/>“It seems like in this world, there is no scarcity of beings at the Celestial Being realm.”<br/><br/>Gu Yang thought to himself.<br/><br/>Ocean-dwelling creatures, they could burrow deep into the sea. For martial artists who wanted to hunt them, they wouldn’t meet with much success on land. If they ventured to the sea floor, they would mostly likely lose to a marine creature of the same realm.<br/><br/>Like Earth, this world had far more ocean than land.<br/><br/>That implies that there are more creatures at the Divine Power realm in the ocean than on land.<br/><br/>Gu Yang had no intention of provoking such powerful creatures. At the slightest detection, he gave them a wide berth.<br/><br/>If he happened upon any foul-natured fish or birds aiming to attack him, he showed no mercy. He killed them on the spot, gaining a few energy points in the process.<br/><br/>…<br/><br/>…<br/><br/>After ten days, Gu Yang finally saw land.<br/><br/>At this rate, he was somewhat slower than Saint Chaoyang.<br/><br/>Primarily to conserve mana, he needed to maintain an optimal speed, not depleting too much and having to convert his core into mana.<br/><br/>After reaching the Unleaking realm, he became prudent with his usage of mana.<br/><br/>The terrain ahead was the territory of the barbarians. However, it was constantly covered in snow, with harsh weather conditions and an extremely harsh living environment, it was inhabited by no one.<br/><br/>Once he entered Barbarian territories, Gu Yang kept a low profile. He put away the phoenix form, so as not to attract powerful barbarians.<br/><br/>He was not afraid of others, but those two Celestial Beings from the barbarians, he was yet to take them on.<br/><br/>Gu Yang took seven days to cross the Barbarian territories.<br/><br/>Speaking of territory size, the Barbarian land was indeed much larger than Great Zhou, but most of it was inhabitable with constant cold or vast deserts. Fertile areas were sparse.<br/><br/>It would only make sense for the Barbarians to intend to invade Great Zhou.<br/><br/>“But why would Unleaking realm powerhouses, and those two Celestial Beings, want to do that?”<br/><br/>During his journey across the plains, Gu Yang suddenly considered this question.<br/><br/>An invasion of Great Zhou would mean war.<br/><br/>For Unleaking realm powerhouses and Celestial Beings, what good would territorial disputes bring them? Better living conditions for their subjects? Did they have such selfless hearts?<br/><br/>Gu Yang expressed his doubts.<br/><br/>Great Zhou was not weak. They too had two Celestial Beings. Even if the headmaster had sustained an injury, once he fought with all his might, perhaps one Celestial Being on the Barbarian side would also fall.<br/><br/>Not to mention, there were Four Great Sacred Lands behind them.<br/><br/>Even if the Barbarians had the support of the Red Light Heaven, what about the remaining Three Sacred Lands?<br/><br/>Why did the Barbarian powerhouses risk so much to invade Great Zhou? Their real motive was?<br/><br/>This might only become clear once the real battle begins.<br/><br/>Upon entering the territory of Great Zhou, he saw a lot of mobilization. Some fortresses were even entrenched with large troops.<br/><br/>Looks like Su Ningyan did not lie. She was indeed well-prepared. On a conventional warfare scale, there wouldn’t be any significant errors.<br/><br/>What can now determine victory or defeat is a comparison of top powers.<br/><br/>After all, it depends on both sides’ Celestial Beings.<br/><br/>Right now, Gu Yang could only just manage to protect himself when facing a Celestial Being.<br/><br/>During his time in the Paradise of Peaches, all the hundred-plus blood bats were released to stall “Han Wang.” The result was that he sensed the death of the pet blood bats before he left the Paradise of Peaches.<br/><br/>The death of the pet took a toll on him.<br/><br/>He has not fully recovered even now.<br/><br/>…<br/><br/>The further south he travelled, the more populated it became, and the larger and more prosperous the cities were.<br/><br/>“I wonder how Qingzhi and the others are doing.”<br/><br/>Gu Yang was somewhat worried.<br/><br/>He had been away for two months, and he wasn’t sure if the girls would start fighting at the academy while he was gone.<br/><br/>He wasn’t worried about anyone else, but Cao Yiyi was definitely the one who gave him the most headaches.<br/><br/>Although he had tasked Xi Huang to watch over Cao Yiyi before leaving, she might not be able to stop Cao Yiyi if she really went crazy.<br/><br/>To ease his worry, Gu Yang resolutely opened the system and initiated a simulation.<br/><br/>[Usage of Life Simulator: Costs 100 energy points per usage. Use it?]<br/><br/>“Yes.”<br/><br/>[You are 23 years old and have reached the first level of the Unleaking Realm. You escaped from the Paradise of Peaches and are heading for Divine City.]<br/><br/>[You gave a peach to the head of the academy and helped him recover his cultivation level.]<br/><br/>[A month later, the Yaochi Conference is held as scheduled. You accompanied the Marquis of Shenwu to the border of the realm to resist the barbarians’ attacks. You launched an offensive, and within a few days, you single-handedly wiped out the barbarian Unleaking Realm warriors and beheaded the Khan of the barbarians.]<br/><br/>[Half a month later, a Celestial Being from the barbarians attacked. You tangled with him, and Luo Wang, who was lying in ambush, severely injured him.]<br/><br/>[Subsequently, another Celestial Being from the barbarians appeared, allied with the injured Celestial Being and was about to unlock an ancient prohibition. The head of the academy appeared and severely wounded him with one sword.]<br/><br/>[Luo Wang unleashed a magic treasure and trapped the two of them. The three of you joined forces and killed both the Celestials. Great Zhou had a complete victory.]<br/><br/>[Later on, you took Su Qingzhi and others and went to Luo Prefecture. You went to look for Chu Xiyue but found out that she was no longer in the Chu family. You learned that she had married into the Qin family a few months ago.]<br/><br/>[You went to the Qin family but were discovered by Qin Wu. You fought, but it was a draw. You could only leave and bring Su Qingzhi and others back to Luo Prefecture, entered the Broad Cold Immortal Palace.]<br/><br/>[The Chu family’s ancestor sensed the opening of the Immortal Palace and tried to enter, but you repelled him with one palm.]<br/><br/>[Three years later, you left the Broad Cold Immortal Palace with them and headed to the Ruiqin Continent.]<br/><br/>[Three years on, the Yao Chi Immortal Palace invaded the Ruiqin Continent, and half of the continent fell. You were forced to retreat to the Beast God Temple.]<br/><br/>[A year later, the Yao Chi Immortal Palace launched its final attack. At the last moment, the Beast God Temple erupted with immense power and killed all the invaders from the Yao Chi Immortal Palace.]<br/><br/>[Seven years later, another Immortal Palace descended upon the Ruiqin Continent and suppressed the Beast God Temple. You died in the aftermath, at the age of 37.]<br/><br/>Chu Xiyue got married?<br/><br/>Gu Yang was taken aback. He quickly calculated and realized that it had indeed been a year since Chu Xiyue decided to return to Jiangzhou to get married.<br/><br/>The wedding was probably scheduled for around this time.<br/><br/>Time really flew by, just like that, it had already been a year.<br/><br/>He remembered saying goodbye to Chu Xiyue a year ago when he had not even reached First Rank.<br/><br/>Now, a year later, he had already reached the Unleaking Realm.<br/><br/>“I hope I can make it in time.”<br/><br/>However, Gu Yang was no longer conserving his mana; instead, he was moving at his fastest pace towards Luo Prefecture.<br/><br/>In his heart, he made a pledge that if he has enough strength a year later, he would go to Chu Xiyue and take her away on her wedding day.<br/><br/>It was now time to keep that promise.<br/><br/>As for going back to Divine City to save the head of the academy, that could wait. Rescuing Chu Xiyue was his priority for now.<br/><br/>From the northern border of Great Zhou to Luo Prefecture in the south, he only took a day.<br/><br/>At Luo Prefecture City, the Chu family residence, it was a time of festive lights and decorations.<br/><br/>Gu Yang was in the sky above Luo Prefecture. He scanned with his divine sense but didn’t find Chu Xiyue. He was becoming anxious.<br/><br/>Obviously, she had already left.<br/><br/>“Who is the fellow Daoist that graces us with his presence? I apologize for failing to welcome you earlier.”<br/><br/>At this moment, an old voice spoke out, undoubtedly a powerful Unleaking Realm cultivator.<br/><br/>PS: The next chapter will be a bit late as I’m experiencing a writing block.\t\t\t\t\t\t</div>", "images": {}, "success": true}