{"id": 332, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132266.html", "title": "Chapter 332 - Chapter 332: 332 He Is Not", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 332 - Chapter 332: 332 He Is Not</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 332: 332 He is not<br/><br/>“Silence— How dare you display such disrespect!”<br/><br/>Listening to Red Moon’s reply, Saint Chaoyang was furious to the breaking point. Her body began to swell, and a terrifying force blanketed the entire sky.<br/><br/>In her heart, the Master was the Emperor of all the Monster Race, loyal to him alone.<br/><br/>She was willing to sacrifice everything to bring the Emperor back to life.<br/><br/>To her, saying such words as a member of the Monster Race was Red Moon acting in great defiance, something she could not tolerate.<br/><br/>Beneath Saint Chaoyang’s terrifying power, the figure formed from the red mist did not show any signs of panic and calmly said, “Sister Wutong, times have changed. This world can no longer tolerate Existences of Immortal Rank. Even the strongest Celestial Being can only maintain existence within the Spiritual Transformation Realm.”<br/><br/>“However, this is, for you and me, the best of times.”<br/><br/>“We are the true kings of the Monster Race, free and self-reliant. No one threatens our lives.”<br/><br/>“Have you forgotten the ancient times when many of our brothers and sisters died at the hands of Human Race cultivators? We were treated as cannon fodder.”<br/><br/>“We were born lowly, even if we were lucky enough to evolve into humanoid forms, we were still at the mercy of the high-rank monsters. Many sisters were gifted to lesser monsters and tortured beyond recognition…”<br/><br/>“Oh, I forget, Sister Wutong, you were born noble. Touched by the Emperor’s aura and transformed. Everyone in the Monster Race respects you. How would you know the suffering and darkness we lower beings have gone through.”<br/><br/>“Finally, after centuries of turmoil, the high-rank monsters disappeared, and it was our time to rise.”<br/><br/>“We no longer have to fear the threats of the cultivators, serve anymore, or fear anybody. We became the rulers of this world— Now, you seek to bring back the Emperor!”<br/><br/>“Did you ask me?”<br/><br/>“I will not allow anyone to lord over me! Be they Monster Kings, Emperors, whatever, let those who disappeared stay disappeared forever.”<br/><br/>“Sister Wutong, you once saved me, and I am grateful. But you can’t bring the Emperor back.”<br/><br/>“If you remain blind to reason, don’t blame me for becoming ruthless.”<br/><br/>…<br/><br/>Saint Chaoyang stared at Red Moon with an unfamiliar gaze. It was hard to believe that this once closest sister of hers had such wild ambitions.<br/><br/>She took a deep breath and shouted, “Green Lotus!”<br/><br/>The roar echoed throughout the world.<br/><br/>But there was no response.<br/><br/>Her heart sank.<br/><br/>Red Moon said faintly, “Don’t you understand yet? Sister Green Lotus hasn’t appeared until now because she disagrees with what you’re doing.”<br/><br/>“Sister Wutong, just give up, hand the person over to me, and let me consume him. We can still be good sisters…”<br/><br/>“Silence!”<br/><br/>Saint Chaoyang couldn’t bear it any longer and attacked first.<br/><br/>Suddenly, a ball of crimson flame darted towards the red mist—it was Phoenix True Flame. Saint Chaoyang had been fortunate enough to be inhabited by the Emperor. Over time, she mastered the Emperor’s unique Divine Power.<br/><br/>This was something unique in the world.<br/><br/>The red mist suddenly dispersed, only to gather again quickly elsewhere, soon forming into a human figure.<br/><br/>It was a young man who held an unyielding resolve visible through his eyes. In his hand was a rough, broken blade.<br/><br/>He roared out, delivering his attack.<br/><br/>The first style of Heavenly Inquiry Nine Knives: Primal Chaos Awakening!<br/><br/>…<br/><br/>…<br/><br/>Deep within the Black Prison,<br/><br/>Gu Yang saw a ray of light, and the Vitality of Heaven and Earth was filling his surroundings. Clearly, the previous attack had damaged the black prison, and all he needs to do is find the hole to exit.<br/><br/>However, he still couldn’t move yet.<br/><br/>A figure emerged from the darkness ahead, wearing Python Robes and wearing a crown. He exuded an indefinable nobility and dignity.<br/><br/>The Python Robe he wore was not adorned with a Flood Dragon, but a peacock. The tail was colored brightly in five colors.<br/><br/>A Celestial Being!<br/><br/>“Han Wang!”<br/><br/>Gu Yang gasped. The man standing before him was clearly Han Wang, the eldest son of the legendary Xia Emperor, who practiced the “Divine Peacock Method” from the “Nine Heavens Divine Method”.<br/><br/>This was a legendary figure, second only to the Xia Emperor in the Xia Dynasty.<br/><br/>In the previous simulation, there was no mention that he would encounter the terrifying existence of Han Wang.<br/><br/>The man spoke, “I never expected that in this world, there are still people who could recognize me.”<br/><br/>“Hmph, acting all mysterious.”<br/><br/>How could Gu Yang be frightened? Even if the Xia Emperor was resurrected, it would not scare him, let alone just Han Wang.<br/><br/>Han Wang carefully studied him up and down, his eyes somewhat complex. “I didn’t expect that besides my father, there would be someone who could practice so many Nine Heavens Divine Methods at the same time. And you’ve also cultivated to such a level. That’s really remarkable.”<br/><br/>Gu Yang suddenly asked, “Do you have the Nine States Seal on you?”<br/><br/>“What do you think?”<br/><br/>“Goodbye.”<br/><br/>Gu Yang already had an answer in his mind. He waved his hand, and the blood bats appeared and swooped towards Han Wang.<br/><br/>He didn’t even bother to look back and ran away.<br/><br/>He avoided the fights he wasn’t sure of winning.<br/><br/>He could always come back later.<br/><br/>He was incredibly fast, reaching the gap in a blink of an eye, and flew out without hesitation.<br/><br/>Whoosh—<br/><br/>As soon as Gu Yang left the black prison, he felt a familiar Blade Intent, looked up reflexively, and saw an incredible scene.<br/><br/>A familiar figure appeared, holding a broken saber, and using a very familiar saber technique, he split Saint Chao Yang into two halves.<br/><br/>Heavenly Inquiry Nine Knives?<br/><br/>Wu Er?<br/><br/>No, it was a younger version of Wu Er, but he had the strength of the Celestial Being realm.<br/><br/>How is that possible?<br/><br/>Gu Yang suddenly understood, this was the Divine Power of the Red Moon Great Saint.<br/><br/>More than a decade ago, all of Wu Er’s cultivation was devoured by the Red Moon Great Saint. She didn’t absorb those cultivations for herself, but created a pseudo incarnation from them.<br/><br/>The “Han Wang” he just met was created in the same way.<br/><br/>No wonder that “Han Wang” was so “weak”. If it had been the Han Wang from history, he would never have been able to escape.<br/><br/>The “Wu Er” before him, however, was too strong.<br/><br/>Obviously, the strength of such an incarnation depends on the original cultivation of the Red Moon Great Saint.<br/><br/>Even so, it was a very powerful Divine Power.<br/><br/>Being able to release two incarnations at the same time, means there were two celestial beings.<br/><br/>The power of the Red Moon Great Saint, a celestial being, was indeed terrifying.<br/><br/>However, it was uncharacteristic for Saint Chao Yang to be so weak, being dominated and beaten.<br/><br/>At this time, “Wu Er” turned his head and looked at him.<br/><br/>Gu Yang immediately felt a familiar Blade Intent locking onto him.<br/><br/>“What the—”<br/><br/>He felt a chill running down his spine.<br/><br/>After “Wu Er” reached the Celestial Being realm, the power of the Heavenly Inquiry Nine Knives was earth-shattering. Even Saint Chaoyang was cut in half with one blow.<br/><br/>Just as Gu Yang was about to release his divine beast, suddenly, the figure of Saint Chao Yang appeared next to him, grabbing his arm and saying, “Let’s go.”<br/><br/>Instantly, the feeling of being locked by the Blade Intent disappeared.<br/><br/>With a whoosh, Saint Chao Yang tore through the space, and with him, was about to teleport away.<br/><br/>“Trying to escape?”<br/><br/>A terrifying light flashed in “Wu Er” ‘s eyes and he swung his saber.<br/><br/>The second move of Heavenly Inquiry Nine Knives, The Blade Shatters The Universe!<br/><br/>This blow directly broke the space.<br/><br/>Saint Chao Yang, however, still forcefully squeezed into the spatial passage and disappeared instantly.<br/><br/>“Wu Er” didn’t pursue, as he had already lost sight of the two. Even if he wanted to, he couldn’t catch up.<br/><br/>He appeared pensive, “He is not the Emperor.”\t\t\t\t\t\t</div>", "images": {}, "success": true}