{"id": 336, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132273.html", "title": "Chapter 336 - Chapter 336: 336 Extremely Fragile", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 336 - Chapter 336: 336 Extremely Fragile</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 336: 336 Extremely fragile<br/><br/>In the grand courtyard of the Chu Family, a group of young members were gathered, discussing the wedding of Chu Xiyue and Qin Shang.<br/><br/>There were those who were indignant, believing that Chu Xiyue, the future head of the Chu Family, marrying into the Qin Family was a great humiliation.<br/><br/>There were also those who were calm and rational, thinking that sacrificing one person in exchange for the return of the treasured Bright Moon Sabre was completely worth it. After all, the current Qin Family held great power, and it was good to improve relations with them.<br/><br/>These two parties were in constant debate, blaming each other.<br/><br/>But no matter which side, they all sympathized with and lamented over Chu Xiyue’s sacrifice.<br/><br/>It is well known that Chu Xiyue once had a romantic relationship with Gu Yang, but for the sake of her family, she chose to marry into the Qin Family.<br/><br/>Who is Gu Yang?<br/><br/>In his twenties, with a triple-level mana!<br/><br/>Since ancient times, there has never been such a transcendent character.<br/><br/>Lin Tianyi, the Dean of the Literature College, Qin Wu… These old generation’s rare geniuses faded in comparison to this man.<br/><br/>Among these three people, who could achieve such feats at their twenties?<br/><br/>Not to mention Gu Yang’s splendid record of battles, his mastery of the First Rank Godslayer Divine Power, and his Golden Body that cuts through mana as if it were a plaything.<br/><br/>It can be said that there is no precedent before him, and it is estimated that there will be no one to rival him in the future.<br/><br/>Among the younger generation of Great Zhou, he was like a god.<br/><br/>Chu Xiyue has given up such a man for her family, anyone would feel pity and regret for her.<br/><br/>Of course, there were those who reveled in her misfortune.<br/><br/>Chu Xiyu was one of them.<br/><br/>She was Chu Xiyue’s cousin. From childhood, she has lived under her cousin’s aura.<br/><br/>She also had excellent talent and was second only to Chu Xiyue among the younger generation, ranked in the top ten on the Hidden Dragon List.<br/><br/>But this gap excluded her from the position of family head.<br/><br/>She was also extremely beautiful and considered herself no less than anyone else, but she couldn’t make it to the Beauty List. In the eyes of outsiders, she naturally falls short of her cousin.<br/><br/>Being suppressed everywhere, one can imagine the frustration in Chu Xiyu’s heart.<br/><br/>Even in matrimonial matters, she encountered the most outstanding man of this era, the youngest ever to attain the Divine Power Realm.<br/><br/>How could she not be envious, jealous, and resentful?<br/><br/>She thought that she would live in Chu Xiyue’s shadow for her whole life.<br/><br/>However, unexpectedly, the Qin Family proposed to marry Chu Xiyue offering Bright Moon Sabre as a bride price, a condition the Chu Family couldn’t refuse.<br/><br/>When Chu Xiyu heard this news, she could hardly believe it.<br/><br/>For the Qin Family to use the Bright Moon Sabre as a bride price to marry Chu Xiyue, that was a legendary divine weapon.<br/><br/>Why?<br/><br/>Why do all the good things happen to her?<br/><br/>Why should she be the one who is loved by all?<br/><br/>Chu Xiyu was so jealous that she was almost going crazy.<br/><br/>She couldn’t understand where she fell short?<br/><br/>The only news that made her happy was the fact that Chu Xiyue and Gu Yang broke up.<br/><br/>Suddenly, a terrifying presence appeared over the Chu residence, pressing all the people present almost to their knees.<br/><br/>Then the ancestor appeared, and that pressure disappeared.<br/><br/>As Chu Xiyu was wondering, she heard a shout, “Gu Yang!”<br/><br/>Gu Yang?<br/><br/>This name was as resounding as a thunderbolt. She hastily lifted her head and saw the figure in the sky, arrogantly looking down, not bowing even in the presence of the ancestor.<br/><br/>Was that Gu Yang?<br/><br/>Chu Xiyu’s heart was surging, she could not suppress her emotions.<br/><br/>She had heard so much about this man and was curious about what kind of person he was.<br/><br/>Today, she finally saw him in person, and naturally, she was excited.<br/><br/>Wait!<br/><br/>Suddenly, Chu Xiyu realized something.<br/><br/>Today was the day the Qin Family was to wed her cousin.<br/><br/>He must have come for Chu Xiyue!<br/><br/>Why her again?<br/><br/>Why?<br/><br/>This time, Chu Xiyu’s heart completely sunk.<br/><br/>…<br/><br/>……<br/><br/>Gu Yang’s gaze fell on the knife in the old lady’s hand, which was emitting a silver-white glow.<br/><br/>This seemingly gentle light contained a mysterious power that kept his Phoenix True Flame’s intense heat at a distance.<br/><br/>His gaze became a bit colder, “Is this the Bright Moon Sabre?”<br/><br/>It indeed is a rare treasure. Among all the unparalleled divine weapons he possessed, only the Guanghan Fairy Sword could compare to this knife.<br/><br/>This was certainly a Pure Yang level Magic Treasure, the creme de la creme among Magic Treasures.<br/><br/>“Are you forcing Xiyue to marry into the Qin Family for this knife?”<br/><br/>The sound of his voice, cold as ice, seemed to freeze the air itself.<br/><br/>Everyone from the Chu Family who was present felt a chill down their spines. Especially the few Divine Power realm powerhouses, who had already judged that the man before their eyes was a being of the Unleaking Realm.<br/><br/>In the face of the wrath of such a strong being, everyone was somewhat fearful.<br/><br/>Given the brilliant combat record he had achieved along the way, even with their Ancestor present, they were all very concerned.<br/><br/>A single misstep could spell disaster for the Chu’s.<br/><br/>It was Chu Xiao who spoke up, “Master Gu…Ultimately, it was our elders’ incompetence that led to this. However, Xiyue’s sacrifices and tolerance, it was all for the Chu Family. If you truly love and care for her, you should understand her predicament.”<br/><br/>Gu Yang raised an eyebrow, his eyes becoming dangerous, “Why should she be the one to make sacrifices? Why should she be the ones bearing the humiliation?”<br/><br/>These words hit Chu Xiyu hard, causing her vision to blur.<br/><br/>At this moment, she could only feel deep envy towards her cousin.<br/><br/>If there was a man willing to protect her like this one day, her life would be worth living.<br/><br/>…<br/><br/>Seeing Gu Yang’s aggressive attitude, Chu Xiao could only suppress her anger. She really didn’t wish to make an enemy out of such a powerful Unleaking Realm being.<br/><br/>“No matter who the Qin Family wants to marry, she would voluntarily step up. It’s her duty…If you must blame someone…”<br/><br/>Gu Yang interrupted her, “So in your eyes, trading her for this knife is a fair bargain?”<br/><br/>At this point, the Chu Family Ancestor couldn’t hold back any longer and sternly said, “Boy, it’s not your place to meddle in Chu Family’s affairs.”<br/><br/>She had traversed the world for many years and after achieving the Unleaking Realm, she looked down on the world. Even after losing to Qin Wu, she never begged anyone.<br/><br/>When had she ever been openly defied and mocked by a junior before?<br/><br/>The fact that she didn’t instantly attack was already very gracious of her.<br/><br/>Gu Yang looked at her and suddenly laughed, “You don’t stand a chance against Qin Wu and can only be submissive. In the future, I hope you can continue demonstrating such honorable traditions and bow down to me as well.”<br/><br/>When these words came out, the expressions of all Chu Family people present changed.<br/><br/>“Impudent!”<br/><br/>The Chu Family Ancestor’s face turned dark with anger.<br/><br/>Suddenly, a warning sign emerged within her heart and the mana within her started rushing towards the Bright Moon Sabre in her hand. The moon above her head became even brighter.<br/><br/>In the next instant, a hand broke through the silver glow around her, effortlessly reaching in front of her, using three fingers to seize the blade of the Bright Moon Sabre.<br/><br/>How is this possible?<br/><br/>She felt horror in her heart.<br/><br/>The Bright Moon Sabre is a Pure Yang level Magic Treasure and retains some of the treasure’s original power. That silver lunar radiance can block any attack.<br/><br/>In the past, even Qin Wu had to exhaust his strength to break through the lunar radiance’s defense.<br/><br/>The man in front of her managed to breakthrough through that silver lunar radiance barehanded.<br/><br/>Even though her Cultivation Level is no longer at its peak, this still shouldn’t be possible?<br/><br/>This is bad!<br/><br/>She realized that Gu Yang intended to take the Bright Moon Sabre and prepared to resist with all her strength.<br/><br/>The Bright Moon Sabre had been taken by Qin Wu for five hundred years. She had just regained it and absolutely wouldn’t allow it to be taken away again.<br/><br/>Just then, a golden light flashed in her eyes. In a trance, her hand loosened, and the Bright Moon Sabre had been taken away.<br/><br/>When she regained her senses, she saw that Gu Yang had returned to his original position, with the Bright Moon Sabre clutched in his hand.<br/><br/>She stared fixedly at the young man who was too youthful, her eyes filled with horror, fear, anger and even a hint of despair.<br/><br/>How terrifyingly strong is he?<br/><br/>He easily stripped the Bright Moon Sabre from her grasp.<br/><br/>Just now, if he had wanted to kill her, she wouldn’t even have known how she’d died.<br/><br/>The scene, was deadly silent.<br/><br/>All the Chu Family members present were in a state of shock.<br/><br/>They hadn’t seen clearly exactly what happened, only that the Bright Moon Sabre which was in their ancestor’s hand a moment ago, was now in Gu Yang’s hand.<br/><br/>But one thing was clear to everyone – their ancestor stood no chance in front of this man.\t\t\t\t\t\t</div>", "images": {}, "success": true}