{"id": 341, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132283.html", "title": "Chapter 341 - Chapter 341: 341 Solving Puzzles", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 341 - Chapter 341: 341 Solving Puzzles</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 341: 341 Solving Puzzles<br/><br/>“…You went to the Divine City, met the mysterious person beneath the palace and exchanged some information.”<br/><br/>“Later, you met with the Principal of the Literature Institute and gave him a peach.”<br/><br/>“Half a month later, you headed to the shores of the North Sea to attend the Yaochi Conference.”<br/><br/>“After entering the Immortal Palace of Yaochi, you unwittingly triggered a prohibition and died on the spot, at the age of twenty-three.”<br/><br/>It’s the same again.<br/><br/>Gu Yang furrowed his brows, his death this time was exactly the same as the last one.<br/><br/>He had already warned himself to be extra cautious after entering the Immortal Palace of Yaochi, and yet he ended up triggering the prohibition.<br/><br/>Was he being targeted?<br/><br/>The Immortal Palace of Yaochi was one of the three great immortal palaces of the ancient times, a force that was no ordinary one could have held the reputation until now.<br/><br/>The prohibitions inside must be extremely terrifying.<br/><br/>However, in the previous simulation, the Celestial Being of the Barbarians who attended the Yaochi Conference, Saint Chao Yang, and Luo Wang all returned safely.<br/><br/>Apparently, this Yaochi Conference wasn’t a must-die situation.<br/><br/>Gu Yang mulled over it, deciding that he should enhance his capabilities as much as possible.<br/><br/>There was only half a month left.<br/><br/>He didn’t hold back any longer and hurried towards the Divine City at the fastest speed.<br/><br/>Half a day later, he arrived at the Divine City.<br/><br/>…<br/><br/>From afar, Gu Yang had just caught sight of the silhouette of the Divine City when he saw about seven or eight figures flying towards him.<br/><br/>“It’s them!”<br/><br/>He sensed their familiar breaths and seeing them all safe and sound, he could not help but feel relieved.<br/><br/>During his months away, their safety was his biggest concern.<br/><br/>“Master, you’re finally back.”<br/><br/>The one flying in the forefront was the Little Green Bird, who complained, “If you didn’t return, I would have been annoyed to death by them.”<br/><br/>“Father!”<br/><br/>Then came Xi Huang, crying like rain, she was the one with the highest cultivation level and the fastest speed among them, she threw herself into Gu Yang’s arms.<br/><br/>The third one to arrive was Su Ningyan, dressed in a phoenix robe. She stopped in front of Gu Yang, didn’t say a thing, her eyes flickered once they swept over Chu Xiyue who was behind him.<br/><br/>Apparently, she had recognized Chu Xiyue’s identity.<br/><br/>Chu Xiyue was slightly surprised when she saw Su Ningyan, apparently recognizing her identity as well.<br/><br/>However, neither of them said a word.<br/><br/>Soon, the rest of them arrived as well.<br/><br/>Su Qingzhen, Ling Ling, Pei Qianlan, Ye Lingbo, Lily, Eve…<br/><br/>Looking at all their pairs of red eyes, Gu Yang felt a bit overwhelmed. He only had two arms, how could he hold so many women?<br/><br/>Luckily, Xi Huang was there. Officially, she was his “daughter”.<br/><br/>While he was holding his “daughter”, even if they had complaints they wouldn’t say anything.<br/><br/>Without waiting for them to speak, Gu Yang said, “I’ve made you worry. Let’s talk back in the Divine City.”<br/><br/>With that, he took the lead and flew towards the Divine City.<br/><br/>…<br/><br/>…<br/><br/>“Where is Cao Yiyi?”<br/><br/>Gu Yang asked Ling Ling via a transmitting message.<br/><br/>Among the women present, only she and Lily, and Eve wouldn’t be jealous. Among them, Lily’s Great Zhou language was still very poor and Eve’s loyalty was questionable.<br/><br/>The only one he could ask was Ling Ling.<br/><br/>Ling Ling replied, “She is locked in the palace.”<br/><br/>Gu Yang immediately understood.<br/><br/>Among the people present, only Xi Huang and Eve could suppress Cao Yiyi, but Xi Huang was soft-hearted and couldn’t bear to be hard on her own people.<br/><br/>As for Eve, she wouldn’t bother with these minor matters.<br/><br/>Only Su Ningyan has both strength and means. Naturally, she will teach Cao Yiyi a lesson if she gets on her nerves.<br/><br/>As long as she’s not harmed.<br/><br/>Gu Yang felt relieved and took them to the Literature Institute.<br/><br/>Seeing him bringing a group of women back again, Zhou Zongye said in half ridicule and half complaint, “If you didn’t return, they would have torn the Literature Institute apart.”<br/><br/>“I’m sorry for causing you trouble during this time.” Gu Yang thought. He had been relying on the Literature Institute to protect Su Qingzhen and the others during his absence, he was obliged to express his gratitude.<br/><br/>Zhou Zongye was about to speak when his face suddenly changed, his eyes locked on Gu Yang, “You… You’re in the Unleaking Realm now?”<br/><br/>As soon as the words were spoken, all the women present were taken aback.<br/><br/>The only ones who didn’t change their expressions were Chu Xiyue and Su Ningyan.<br/><br/>Chu Xiyue knew it all along.<br/><br/>And Su Ningyan had inferred it from Chu Xiyue’s identity.<br/><br/>“Yes.”<br/><br/>Zhou Zongye originally wanted to say a lot, in the end, all he could do was sigh deeply, “Sigh–”<br/><br/>The Unleaking Realm had already placed one at the peak of this world, not counting Celestial Beings who have transcended this world’s existence.<br/><br/>Gu Yang said, “I want to see the Principal.”<br/><br/>“Follow me.” Zhou Zongye said, this time, no need for a request.<br/><br/>“Wait for me here.”<br/><br/>Gu Yang turned his head to remind Su Qingzhen and the others, then followed Zhou Zongye to the Star Picking Pavilion.<br/><br/>…<br/><br/>It was still the same modest courtyard, but this time, a wisp of smoke rose from the chimney on the rooftop.<br/><br/>In the courtyard, the Dean was sitting in the same reclining chair, holding the same book, his posture identical to their previous two meetings.<br/><br/>Gu Yang even suspected that he maintained this position all the time, never changing.<br/><br/>“Not bad.”<br/><br/>The Dean surprisingly put down his book, looking at Gu Yang, his eyes showing a hint of appreciation, said, “I was not mistaken, your progress is even faster than I imagined.”<br/><br/>“Gu Yang!”<br/><br/>At this moment, a head popped out from the room; it was Gao Fan, holding a shovel. Seeing Gu Yang, he was quite pleased, “Wait a moment, my dish will be ready soon.”<br/><br/>Then, his head retracted back into the room.<br/><br/>Gu Yang asked, “How’s he doing?”<br/><br/>“He can’t leave yet.” The Dean replied, then asked, “Did you come to me this time to know how to break through to the Celestial Being realm?”<br/><br/>Gu Yang grinned, “Senior, you are farseeing. Besides, I have something to show you.”<br/><br/>With that, he took out a jade box from his bosom. As soon as he opened the lid, a refreshing aroma diffused into the air.<br/><br/>“This is—”<br/><br/>The Dean changed his expression abruptly, rose from the chair in a fluster, took that jade box from him, and looked at the ripe peach inside. He closed his eyes to feel it carefully.<br/><br/>Gu Yang asked, “Can this Spirit fruit heal your injury?”<br/><br/>After a while, he opened his eyes, looked at Gu Yang, and said deeply, “Although it’s not a Heaven and Earth Spirit Root, its origin is not ordinary, containing tremendous immortal energy. Once you break through to the Celestial Being realm in the future, this Spirit fruit would be of great benefit to your cultivation level.”<br/><br/>“I know. But now, Great Zhou is fraught with peril; Barbarians are invading from outside, and the Immortal Palace of Yao Chi has returned to the Human Realm. The top priority is to heal your injury.”<br/><br/>Hearing the words ‘Yao Chi Immortal Palace’, the Dean didn’t show any surprise, apparently he already knew about it.<br/><br/>He closed the jade box and said, “I owe you a favor.”<br/><br/>At this moment, Gao Fan from the room came out with food and placed it on the stone table in the courtyard.<br/><br/>He said, “Stop talking, come and eat.”<br/><br/>…<br/><br/>…<br/><br/>After eating, Gu Yang took leave.<br/><br/>With only half a month left until the Yaochi Conference, he didn’t dare to delay a moment.<br/><br/>After leaving the academy, he headed straight for the palace.<br/><br/>With the waist tag given to him by Su Ningyan, he had unhindered passage all the way to the Qi Feng Pavilion.<br/><br/>Su Ningyan had already changed her clothes. She was tall and upright, standing by the window. Without turning back, she asked indifferently, “What are you here for?”<br/><br/>Gu Yang got straight to the point, “Do you know about the Yao Chi Immortal Palace? One of the three ancient Immortal Palaces has returned to the world.”<br/><br/>Su Ningyan swiftly turned towards him, staring at him intently, “You want to see her?”<br/><br/>Speaking to a clever person saved trouble.<br/><br/>He nodded, “Yes.”<br/><br/>Su Ningyan didn’t utter a single superfluous word, she turned around and walked forward.<br/><br/>…<br/><br/>It was still the same well, and the two jumped down.<br/><br/>A quarter of an hour later, they reached the bottomless bottom and walked forward along the tunnel, arriving at an underground palace.<br/><br/>Nine huge pillars carved into dragon shapes in the middle, there is a nine godding.<br/><br/>Su Ningyan said, “I am out of Monster Beasts’ inner dan.”<br/><br/>Gu Yang didn’t waste words, directly manifested an avatar of the Azure Dragon and put it into the Nine Gods’ Cauldron.<br/><br/>The cauldron lit up with red light, the Azure Dragon avatar was instantly shattered by a force into pure power and absorbed by the cauldron.<br/><br/>At the bottom of the cauldron appeared a shriveled head with two points of dim light in the eye sockets.<br/><br/>Compared to the last time, its condition seemed much better, and it no longer breathed raggedly. “We meet again,” it said, “your progress is surprassing my expectations.”<br/><br/>Gu Yang had no intention of exchanging pleasantries with it and said, “I would like to know, where can I find the essence blood of a five-colored peacock?”<br/><br/>The mummy said rashly, “I don’t know.”<br/><br/>“You don’t know?”<br/><br/>“Of all the ancient divine beasts, that peacock is the most cunning, never participating in the strife between the Human Race and the Monster Race. No one knows where it hides.”<br/><br/>“How was Xia Emperor’s Shen Que Jue (God Bird Sutra) refined then?”<br/><br/>The mummy said, “For that, you should go ask him. Alright, you can ask another question.”<br/><br/>Gu Yang scrutinized it deeply but had no choice but to change the question, “What is the Yaochi Conference?”<br/><br/>“You asked the right person for that; I not only know about it, I have even attended the Yaochi Conference.”<br/><br/>“Every three thousand years, the Yao Chi Immortal Palace would host the Yaochi Conference by sending out invitations to gods and immortals, sharing the Immortal Fruit Pan Tao during the feast.”<br/><br/>“That Pan Tao is an Immortal Fruit borne by the Heaven and Earth Spirit Root; not only can it prolong one’s life, it can also enhance cultivation levels. The Yao Chi Immortal Palace made a wide array of good connections with this fruit. In the Three Realms, almost everyone with a reputation has tasted its kindness.”<br/><br/>Gu Yang looked puzzled, “Does the Yao Chi Immortal Palace simply share such Immortal Fruit with others?”<br/><br/>“After eating one Pan Tao, eating more doesn’t have any effect. Moreover, the news that the Yao Chi Immortal Palace has a Heaven and Earth Spirit Root has already spread, attracting the desires of many powerful beings. The Palace Master of Yao Chi, a person of great daring, invited various powerful beings to host the Yaochi Conference and shared this Immortal Fruit with them.”<br/><br/>The mummy paused before continuing, “Ever since, the Yaochi Conference mainly invited the prodigal sons of various major powers. If you were born in the ancient times, you would certainly have been on the invitation list.”<br/><br/>However, Gu Yang’s eyebrows furrowed even more deeply.<br/><br/>Now is not the ancient times; the strength of the Yao Chi Immortal Palace alone can suppress the whole world.<br/><br/>Why would they still host the Yaochi Conference then?\t\t\t\t\t\t</div>", "images": {}, "success": true}