{"id": 345, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132291.html", "title": "Chapter 345 - Chapter 345: Drive Off The Tiger, Swallow The Wolf", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 345 - Chapter 345: Drive Off The Tiger, Swallow The Wolf</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 345: Drive off the Tiger, Swallow the Wolf<br/><br/>After handling everything, Gu Yang looked towards the direction of the Valley of Dead Souls.<br/><br/>Nether Sect has two sect chiefs, Yin Demon Shao Yuhong, and Yang Demon Fu Shijie.<br/><br/>Now, Shao Yuhong had been killed by him, but Fu Shijie was still alive and now hiding inside the valley, not daring to come out.<br/><br/>He had no intention of entering the Valley of Dead Souls.<br/><br/>The reputation of the Five Major Desolate Lands wasn’t just randomly attributed, even he wouldn’t dare to barge in recklessly, let alone, there was also a Celestial Being powerhouse inside, watching like a tiger stalking its prey.<br/><br/>Even if the one inside was the weakest Celestial Being in history, when combined with such an environment, it still posed a big challenge for him.<br/><br/>Last time in the simulation, he entered the Valley of Dead Souls intending to kill Fu Shijie, but as a result, he was ambushed and killed by him instead.<br/><br/>Gu Yang stood in place for a while, noticing that Fu Shijie had no intention of coming out to avenge Shao Yuhong, he lost interest and turned to say, “Take your master and leave.”<br/><br/>This was for Zhong Yanxing. He had sneaked back after being sent away by Zhong Zilin. He was lucky to not be affected by the Heart-catching Bell.<br/><br/>Just now, Zhong Zilin had been controlled by the Heart-catching Bell and was knocked unconscious on the spot by the Golden Clear Divine Ape’s tail. He still hadn’t yet regained consciousness.<br/><br/>Zhong Yanxing asked worriedly, “Senior, is my master alright?”<br/><br/>“He’ll be fine when he wakes up.”<br/><br/>Although the Heart-catching Bell was very powerful, Zhong Zilin’s time under its control was very short. With his cultivation level, he would wake up quickly. Only his Original Spirit would take some damage, which wasn’t a big problem.<br/><br/>…<br/><br/>Sure enough, after Gu Yang and the others flew not too far, Zhong Zilin woke up. On opening his eyes and seeing his disciple, he was first startled and then relaxed.<br/><br/>He felt ashamed remembering the situation when he lost control just now.<br/><br/>He had stayed to help but instead bogged them down, was exploited by the enemy, and almost injured Gu Yang.<br/><br/>After Gu Yang comforted him a few times, he parted ways with him and his disciple, and continued his journey alone.<br/><br/>At this time, there were still thirteen days left until the Yaochi Conference.<br/><br/>The battle with Nether Sect made him a huge profit of more than 3,300 energy.<br/><br/>Shao Yuhong, a Celestial Being, was arguably the weakest in the Celestial Being realm in history.<br/><br/>Her weak points were too obvious. Her strongest means of fighting back were two; one was using the Death Aura, which was effective against warriors and cultivators.<br/><br/>But she ran into Gu Yang. His Phoenix True Flame was the natural nemesis of Death Aura.<br/><br/>Her power was instantly halved.<br/><br/>The other was her Celestial Being corpse, but unfortunately, a corpse is just a corpse after all. No matter how much it’s refined, it can’t possibly return to its original power. If it can retain one or two percent, it is considered good.<br/><br/>The strongest point of these ancient cultivators is their comprehension of the Way of Heaven. First, its Original Spirit had long since dissipated, and even if it was refined into a corpse, it was impossible to restore its original magic.<br/><br/>Secondly, the Way of Heaven is now dead. Even if the Way of Heaven it comprehended in its lifetime still existed, it couldn’t display it in such an environment.<br/><br/>In reality, this Celestial Being corpse could only rely on the Death Aura and its powerful mortal body to fight against enemies.<br/><br/>Gu Yang had many divine beasts by his side. He had never been afraid of physical combat.<br/><br/>In the final analysis, the fact that he was able to kill Shao Yuhong was not because his strength was comparable to a Celestial Being, but because she was too weak.<br/><br/>Any Celestial Being- strength person would be able to defeat someone like her in one hit.<br/><br/>For example, Saint Chaoyang and Red Moon Great Saint, either one of them could easily kill her.<br/><br/>…<br/><br/>Gu Yang flew thousands of miles before stopping to sort out this time’s gains.<br/><br/>He obtained more than ten godly weapons from the disciples of Nether Sect, which he directly converted into energy.<br/><br/>The most valuable were two unique godly weapons. He had so many of such things, he didn’t bother to carry them with him and converted them into energy as well.<br/><br/>Next, from Shao Yuhong, he got that black copper bell.<br/><br/>He hesitated for a moment, and finally decided to convert it into energy as well.<br/><br/>Although this thing was powerful, it had been corrupted by Death Aura for many years, and had become a demonic weapon, which gave him a very uncomfortable feeling.<br/><br/>[Detected energy source, recharge?]<br/><br/>“Yes.”<br/><br/>[Recharge successful, gained one thousand energy points. Current balance four thousand three hundred ninety-two points.]<br/><br/>One thousand points, equivalent to killing a Celestial Being.<br/><br/>In other words, this bell should be a spirit treasure.<br/><br/>Gu Yang instantly thought of the few spirit treasures he had, two Nine God Tripods, and a Giant Spirit Hammer, they should be more valuable than this bell, right?<br/><br/>He really had the urge to convert them all into energy.<br/><br/>“I’ll keep them first, they might come in handy in the future.”<br/><br/>Gu Yang didn’t lack energy now, and quickly suppressed this impulse.<br/><br/>“However, those magic treasures are useless if kept.”<br/><br/>He had over a dozen magic treasures on hand.<br/><br/>It was a good thing that the Beast-taming Space could be used to store things; otherwise, carrying so many things around would be too inconvenient.<br/><br/>Gu Yang picked through them, in the end only keeping the wooden stick, the Guanghan Immortal Sword, and the Xuan Light Shield. The rest of the magic treasures were all turned into energy.<br/><br/>This time, he got another 1,500 energy points.<br/><br/>He had already tested it out, a Void Spirit-level magic treasure was worth fifty points, a True Form-level one hundred points, and a Phantom God-level two hundred points.<br/><br/>A Pure Yang-level one should be worth over four hundred points.<br/><br/>None of the magic treasures he converted were Pure Yang-level ones.<br/><br/>Now, he had a total of five thousand eight hundred ninety-two energy points. This is an unprecedented number.<br/><br/>Gu Yang opened the system and officially started the simulation.<br/><br/>He already had a preliminary idea about how to break the game, now he could use the simulator to verify whether it was feasible.<br/><br/>[At the age of twenty-three, you are already at the first layer of the Unleaking realm, you killed Yin Demon Shao Yuhong outside the Valley of Dead Souls, causing widespread shock.]<br/><br/>[You take Chu Xiyue and Su Qingzhi and go to Luo Prefecture, entering Guanghan Immortal Palace.]<br/><br/>[You cultivate hard in the Guanghan Immortal Palace, and after three years, leave the palace and return to Great Zhou, finding that the world outside has changed. A few days later, the Jade Dew God General appears and kills you, age twenty-six.]<br/><br/>So vengeful?<br/><br/>Gu Yang muttered to himself, feeling unlucky, it had been three whole years and that Jade Dew God General was still after him.<br/><br/>But, this also proved one thing, places like the Guanghan Immortal Palace, the Jade Dew God General couldn’t enter, it could only wait for him to come out then chase to kill him.<br/><br/>Find a more secluded space, and I should be able to evade the pursuit of the Jade Dew Divine General.<br/><br/>The Lunar Immortal Palace won’t suffice, in a few years, the people from the Yao Chi Immortal Palace will be able to enter in there. At most, I could hide there for a few years.<br/><br/>[Simulation ends, you can keep one of the following.]<br/><br/>[One: Your martial arts realm at the age of twenty-six.]<br/><br/>[Two: Your martial arts experience at the age of twenty-six.]<br/><br/>[Three: Your life wisdom at the age of twenty-six.]<br/><br/>“I choose the second one.”<br/><br/>In an instant, Gu Yang’s mind was filled with numerous martial arts experiences.<br/><br/>After reaching the Unleaking Realm, trying to breakthrough purely based on the accumulation of time is almost impossible.<br/><br/>His accumulation is too deep, so wanting to break through the realm is even more difficult.<br/><br/>Now, he needs to comprehend a method of breakthrough from the “Taixuan Heavenly Book”, to open up a path that no one has trodden before.<br/><br/>…<br/><br/>[…You head to Wanxiang Cave Sky. A month later, you are targeted by a deity-level powerhouse. After a fierce battle, you are killed on the spot. You died at twenty-three.]<br/><br/>As expected, the Wanxiang Cave Sky is hazardous, and I was discovered by a deity-level powerhouse there so quickly.<br/><br/>Gu Yang sighed.<br/><br/>So far, all known cave worlds are unsafe.<br/><br/>It seems that hiding is not the solution, since there is no place safe in this vast world.<br/><br/>The only temporarily safe place is the Lunar Immortal Palace, where at least there are three years to live.<br/><br/>“Three years are too few.”<br/><br/>Fifty-odd simulations, totaling just over a hundred years, it’s hard to improve his strength by a layer.<br/><br/>He must think of other ways.<br/><br/>“There’s no other way.”<br/><br/>Gu Yang made up his mind and opened the system.<br/><br/>[…You open the Wanxiang Gate channel, and then, with Chu Xiyue and others, you hide in the Lunar Immortal Palace.]<br/><br/>[Three years later, you leave the Lunar Immortal Palace, only to find that the outside world has changed dramatically. You want to escape this continent, a month later, you are discovered by a powerhouse from Yao Chi Immortal Palace. They kill you on the spot, and you die at the age of twenty-six.]<br/><br/>It’s effective!<br/><br/>A joy emerged from Gu Yang’s heart.<br/><br/>The method he thought of was to pit one against another.<br/><br/>The strength of the Yao Chi Immortal Palace is too strong, and the power of Da Zhou is not enough to contend with it. Even the Four Great Sacred Lands can’t stop them.<br/><br/>Since that’s the case, then let’s use the Wanxiang Gate to trigger the aggression of Yao Chi Immortal Palace.<br/><br/>Now it seems that the Wanxiang Gate has indeed changed something.<br/><br/>This time, General Jade Dew didn’t appear; he died at the hands of another powerhouse.<br/><br/>This is a good change.<br/><br/>[Simulation ends, you can keep one option.]<br/><br/>[…]<br/><br/>…<br/><br/>[…You open the channel to Wanxiang Cave and then go to Qi Province to open the channel to the Yellow Springs Cave. Finally, with Chu Xiyue and others, you hide in the Lunar Immortal Palace.]<br/><br/>[Five years later, some day, two Celestial Beings broke into the Immortal Palace and clashed with you. You died on the spot at the age of twenty-eight.]<br/><br/>I survived for two more years.<br/><br/>It was not easy.<br/><br/>Even the strange creatures of the Yellow Springs Cave, were sacrificed by Gu Yang, and it remains uncertain what has become of the Da Zhou.<br/><br/>However, since two Celestial Beings have broken into the Lunar Immortal Palace, it’s highly probable that they are from Yao Chi Immortal Palace, proving that these strange things have not managed to exterminate the Yao Chi Immortal Palace.<br/><br/>Five years is still not enough.<br/><br/>[The simulation ends …]<br/><br/>…<br/><br/>[… You open the channel to the Wanxiang Cave Sky, then open the channel to the Yellow Springs Cave Sky, and then go to the Ruiqin Continent to publicize the teleportation array in the Wind God Valley.]<br/><br/>[Then, you brought Chu Xiyue and others and hid in the Lunar Immortal Palace.]<br/><br/>[Five years later, you left the Immortal Palace with them and found out that the outside world has become a world of strange creatures. You encountered a group of survivors and followed them into the Star Sea. From the survivors, you learned about the events of the past few years.]<br/><br/>[Strange creatures are flooding the Da Zhou to the point of catastrophe, and even Yao Chi Immortal Palace can’t completely eliminate them, leaving them no choice but to retreat from the Da Zhou. Since then, the human realm has become a world of these strange creatures.]<br/><br/>[You settled in the Star Sea. In order to obtain resources, you have to go to the human realm from time to time.]<br/><br/>[Three years later, an unexpected change occurred, and a celestial-level strange creature appeared. After a fierce battle, the Star Sea fell. You died in this battle at the age of thirty-one.]<br/><br/>The power of these strange creatures is truly terrifying, such that even the powerful Yao Chi Immortal Palace can’t eradicate them.<br/><br/>Releasing them is akin to mutual destruction.<br/><br/>As time passes, these strange creatures will become stronger and humans will become weaker.<br/><br/>Even the Star Sea, one of the former Four Great Sacred Lands, was wiped out just like that.<br/><br/>In the end, this world will be entirely occupied by these strange creatures, and all humans, including Yao Chi Immortal Palace, will be exterminated by them. It will become a literal hell.<br/><br/>What a sin!<br/><br/>Fortunately, this is just a simulation. Anyway, it manages to secure eight years of time.<br/><br/>It still feels too short, if only it could be a decade or more, that would be better.<br/><br/>[The simulation ends…]<br/><br/>…<br/><br/>After claiming the reward, Gu Yang starts a new simulation again.<br/><br/>[…You open the channel to Wanxiang Cave Sky, then open the channel to the Yellow Springs Cave Sky, and then go to Ruiqin Continent to make the Wind God Valley’s teleportation array public.]<br/><br/>[Then, you go to the Divine City, let Ye Lingbo open the channel to the Water Moon Cave Sky, and finally, you take Chu Xiyue and the others to hide in the Lunar Immortal Palace…]<br/><br/>PS: Please give me a monthly pass.\t\t\t\t\t\t</div>", "images": {}, "success": true}