{"id": 349, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132300.html", "title": "Chapter 349 - Chapter 349: Eradicate This Scourge 349", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 349 - Chapter 349: Eradicate This Scourge 349</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 349: Eradicate this scourge 349<br/><br/>In the courtyard of the Wen Academy.<br/><br/>Xi Huang was sitting by the window, engrossed in a thick volume titled “Qin History.”<br/><br/>She had been sleeping in the underground palace of the King Qi’s palace for over a thousand years, oblivious to the events that occurred in that duration.<br/><br/>Recently, with some time on her hands, she started to catch up on history, starting with historical texts.<br/><br/>The “Qin History” in her hands was compiled by the Wen Academy.<br/><br/>Suddenly, she felt an inexplicable palpitation. Alarmed, she raised her head and looked towards the west. Something there was making her heart pound, as if she had encountered her nemesis.<br/><br/>On the table, a little green bird, which had been sleeping, suddenly woke up. It began to flap its wings and squawked, “It’s the Human Emperor’s Sword, run…”<br/><br/>With that, it dashed instantly and fled wildly to the outside of the house.<br/><br/>The Human Emperor’s Sword?<br/><br/>Upon hearing this name, Xi Huang was taken aback.<br/><br/>This sword was extremely famous and she was well aware of it. It had become a symbol of imperial power in her time.<br/><br/>However, she had never seen the Xia Emperor, nor had she seen the Human Emperor’s Sword.<br/><br/>Such terrify was the sword that it posed an instinctive threat to her, even from such a distance.<br/><br/>At this point, the entire academy became noisy, feeling the same peculiar pressure. Many people were discussing and speculating about which abnormal treasure had appeared.<br/><br/>Whoosh-<br/><br/>Suddenly, the little green bird flew back, uttering, “Why should I fear? The Human Emperor’s Sword was already rendered useless by the Taiyi Emperor, it’s not the same sword that it used to be, it can’t threaten me.”<br/><br/>At its last sentence, it seemed somewhat apprehensive.<br/><br/>Its eyes darted toward Xi Huang. “Or maybe, you could steal the Human Emperor’s Sword. With your speed, you could get it and go before anyone else can catch up.”<br/><br/>Confused, Xi Huang asked, “Why?”<br/><br/>“You dummy! Although the Human Emperor’s Sword has been weakened by the Taiyi Emperor and no longer retains its former glory, it’s still a considerable threat if it falls into the hands of Human Race’s emperor. This sword has killed countless members of our Monster Race, it’s our bane. If humans got it, it would be a serious problem if they used it against the headmaster!”<br/><br/>Upon hearing that her father could potentially be threatened by the Human Emperor’s Sword, Xi Huang immediately put down her book and stood up.<br/><br/>Just then, both the man and the bird sensed something and turned their heads at the same time. They saw a blue figure appearing in the sky, dressed in a blue robe, and adorned with a wooden hairpin, exuding an indescribable sense of freedom and elegance.<br/><br/>A Celestial Being!<br/><br/>Xi Huang had seen a powerful Celestial Being before, and she was able to judge this in one glance.<br/><br/>This man must be the headmaster of Wen Academy.<br/><br/>The little green bird deflated instantly. “It’s over, who can outdo this old guy?”<br/><br/>Xi Huang remained silent. With her Cultivation Level at only the second mana level, it was impossible for her to steal the Human Emperor’s Sword from a powerful Celestial Being.<br/><br/>“Hold on…”<br/><br/>The little green bird suddenly remembered something and said in surprise, “Wasn’t it said that he was severely injured? Why does he look so well now? Damn, this old guy must be pulling a fast one, trying to trick someone.”<br/><br/>“Humph, these scholars are all deceitful…”<br/><br/>Xi Huang ignored its ramblings. She saw the Celestial Being remaining idle there, not trying to grab the Human Emperor’s Sword, and she couldn’t figure out what he was up to.<br/><br/>…<br/><br/>“Master, it’s the Human Emperor’s Sword!”<br/><br/>Next to the dean of the Wen Academy, a middle-aged man appeared. It was his disciple, Li Yuan, whose face showed some excitement. “With this sword, Master can surely completely drive away that person from the Human Realm.”<br/><br/>The dean, who had been staring in the direction of the Heavenly Altar, showed a hint of relief in his eyes and said casually, “The Human Emperor’s Sword does not belong to me.”<br/><br/>“What?”<br/><br/>Upon hearing this, Li Yuan was taken aback. Following his gaze, he instantly understood why his master would say that, he hesitated a bit, “Master, are you really okay with giving the Human Emperor’s Sword to him?”<br/><br/>The dean said, “He who was able to get the fruit of the Red Moon Great Saint himself demonstrates his remarkable luck. Only someone this fortunate deserves to be the master of the Human Emperor’s Sword.”<br/><br/>“But the hostility of the State-protecting Sword towards him is so great. What if he is truly the Heavenly Phoenix Emperor from the past?”<br/><br/>“The Human Emperor’s Sword will give us the answer.”<br/><br/>Li Yuan fell silent.<br/><br/>The mentor and disciple stopped talking, closely watching the battle at the Heavenly Altar.<br/><br/>…<br/><br/>…<br/><br/>“Just for killing an emperor, is it necessary to fight this hard?”<br/><br/>Looking at his opponent’s explosive increases in strength, Gu Yang couldn’t understand it.<br/><br/>The price to pay for strength to skyrocket to such a degree in a short time was unimaginable.<br/><br/>After this battle, that State-protecting Sword would definitely be scrapped.<br/><br/>At one glance, he recognized that the man and the sword must be the Lord of the State and his State-protecting Sword.<br/><br/>Who would have expected that the State-protecting Divine Sword, even though it was not ranked high among the Top Ten Divine Weapons, could still hide such tremendous power, elevating its owner’s strength to such a level?<br/><br/>At this time, the strength of the Lord of the State had already surpassed him, even exceeding the third level of the Unleaking Realm.<br/><br/>Really, just to kill him, was it worth it?<br/><br/>The Lord of the State was hovering in the air. At this moment, he sensed the destiny of Great Zhou represented by millions of citizens and the vast landscape.<br/><br/>The citizens living on this land recognize Great Zhou, longing for a better life, slowly merging into a mighty current.<br/><br/>This is the foundation of Great Zhou’s destiny.<br/><br/>At this moment, behind him, there stand billions of Great Zhou’s citizens.<br/><br/>His gaze, as if able to pierce through the void, traverse the long river of history, to see the future scene.<br/><br/>He now understands why the Lord of the State’s sword, regardless of any consequences, is compelled to kill this man.<br/><br/>The man before him is the root of Great Zhou’s chaos and will drag this world into the abyss of destruction. By then, not only Great Zhou but the entire world will cease to exist.<br/><br/>The Lord of the State, after seeing the “truth”, lay aside his hesitation and transformed it into the strongest killing intent. His gaze resolute, “You will cause chaos in the world in the future, today, I, on behalf of Great Zhou, and this world, will eliminate you, the scourge.”<br/><br/>This sentence, like a judgment, is echoed throughout heaven and earth.<br/><br/>All over Divine City, hundreds of thousands of citizens, seemingly empathizing with the Lord of the State, surge with killing intent.<br/><br/>These killing intents converge into one, transforming the color of heaven and earth.<br/><br/>Gu Yang feels like he is facing countless Great Zhou citizens.<br/><br/>At this moment, as if a thousand people are pointing at him, this seemingly intangible power is suppressing his Original Spirit, making it slightly difficult for him to breathe.<br/><br/>This kind of attack method is unheard of.<br/><br/>Gu Yang even has a strange thought that he is experiencing a wave of online violence.<br/><br/>…<br/><br/>“Die!”<br/><br/>The Lord of the State, with the aid of the power of hundreds of thousands of citizens in Divine City, presses down on his opponent completely in terms of momentum, and finally makes a move.<br/><br/>One sword that levels the world!<br/><br/>This is the strongest sword technique he extrapolated from Lord of the State’s sword.<br/><br/>He joined the army at the age of 14, and at the age of 16, it was in front of this sacrificial altar that he unintentionally drew this State-controlling sword.<br/><br/>From that moment on, he resolved to devote his whole life to Great Zhou.<br/><br/>He defends the country from foreign enemies and quelled domestic rebellions. From a foot soldier, he accumulated merit until he was conferred as the Lord of the State.<br/><br/>His greatest ambition in his life is to assist Great Zhou in pacifying the world.<br/><br/>This sword embodies his lifelong martial efforts and aspirations.<br/><br/>No matter how strong the enemy is, they can be defeated in one stroke.<br/><br/>…<br/><br/>“Good swordsmanship!”<br/><br/>Gu Yang’s current mastery in swordsmanship is very high. Facing the Lord of the State’s sword, he can’t help but admire it.<br/><br/>He does not evade, because there is no evasion. The Lord of the State’s sword intent firmly locks him.<br/><br/>There is an extra sword in his hand that he doesn’t know when it appeared, it’s the Guanghan Immortal Sword.<br/><br/>Now, he has only this sword to use.<br/><br/>With one sword in hand, he immediately breaks free from the bondage of sword intent, and strikes a sword out.<br/><br/>“Zhanxuan Sword Technique”, the first move, Zhan Yuan!<br/><br/>An indescribable grey sword intent flies out, colliding with the Lord of the State’s incredibly majestic sword Qi.<br/><br/>In an instant, the sword Qi on the Lord of the State’s sword was ruptured from the middle, dividing into two.<br/><br/>“This–”<br/><br/>The Lord of the State is so uncomfortable that he almost vomits blood. This sword embodies his lifelong cultivation. This time, the power he exerted was cut off by half, and he could no longer sense the existence of that half of the mana.<br/><br/>For the Unleaking Realm, even if the mana leaves the body, it will not be out of control and can be controlled freely.<br/><br/>In some ways, Mana is part of the martial artist and does not disappear, only consumed.<br/><br/>But now, his mana, after being cut into two sections, can no longer sense the existence of one section.<br/><br/>This situation is too strange.<br/><br/>At this moment, Gu Yang strikes out with another sword.<br/><br/>With a chi sound.<br/><br/>The remaining half of the power on the Lord of the State’s sword was also “cut off”.<br/><br/>The power condensed by the Lord of the State’s sword burning most of its destiny, and the sword that the Lord of the State, carrying the killing intents of tens of thousands of people in Divine City, could use to destroy heaven and earth, just like that, mysteriously disappeared without a trace.<br/><br/>Phew!<br/><br/>Lord of the State’s sword was stopped by an invisible obstacle about a meter away from Gu Yang’s chest.<br/><br/>The Lord of the State looked at the Lord of the State’s sword in his hand, his eyes vacant, his body trembling uncontrollably.<br/><br/>How can this be?<br/><br/>He could never have imagined that his all-out, lethal attack couldn’t even penetrate the opponent’s protective Mana.<br/><br/>Thud!<br/><br/>Suddenly, the Lord of the State’s sword in his hand broke, and the fragments scratched his face, leaving a bloody mark. He seemed to be unaware of it, raised his head to look at Gu Yang and moved his lips.<br/><br/>Gu Yang seemed to know what he was going to ask and said, “Zhanxuan Sword Technique.”\t\t\t\t\t\t</div>", "images": {}, "success": true}