{"id": 342, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132285.html", "title": "Chapter 342 - Chapter 342: 342 No Way Out", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 342 - Chapter 342: 342 No Way Out</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 342: 342 No Way Out<br/><br/>Gu Yang only asked this one question, and after receiving an answer, he left.<br/><br/>The way they had answered about the essence blood of the Five-Colored Peacock triggered an unsettling feeling as if something was deliberately being concealed.<br/><br/>It was purely an instinct.<br/><br/>After all, Gu Yang had personally seen the incarnation of “Han Wang” controlled by the Red Moon Great Saint, who was cultivating the “Divine Peafowl Method”. How could he have reached the Celestial Being realm without the blood essence of the Five-Colored Peacock?<br/><br/>He thought to himself, “Right now, my only hope is the incarnation of Han Wang that is being controlled by the Red Moon Great Saint.”<br/><br/>The Red Moon Great Saint, through some divine power, had kept the incarnation of Han Wang intact, so the peacock’s incarnation should still exist. As long as he could kill it, he would be able to extract the peacock’s essence blood from it.<br/><br/>But the thought of “Wu Er” and “Han Wang” at the Celestial Being realm gave him a headache.<br/><br/>Including the Red Moon Great Saint, they amounted to three beings at the Celestial Being realm. Such power exceeded that of both Great Zhou and the Barbarians.<br/><br/>If he did not reach the Celestial Being realm, it would be almost impossible for him to defeat the incarnation of Han Wang.<br/><br/>Gu Yang and the others flew out from the earth’s depths, returning to the surface.<br/><br/>After sealing the well’s opening, Su Ningyan turned around and asked, “What’s the situation with Yao Chi Immortal Palace?”<br/><br/>“It should be related to the Demon Suppression Tower …”<br/><br/>Gu Yang didn’t conceal anything from her. He told her about accidentally awakening the Primordial Spirit of the Demon Suppression Tower.<br/><br/>He also shared about encountering the emissary of the Yao Chi Immortal Palace in Peach Blossom Land and Han State, who was issuing invitations everywhere for the upcoming Yao Chi Conference.<br/><br/>After listening, Su Ningyan thought for a moment, then said, “So the Yao Chi Conference is only inviting those who are in the Celestial Being realm or Unleaking Realm. What about the Dean?”<br/><br/>“He didn’t receive an invite.”<br/><br/>Gu Yang had just come from the Dean’s office and had asked him. The Dean had not received Yao Chi Immortal Palace’s invitation.<br/><br/>With a keen insight, Su Ningyan questioned, “Why hasn’t he received an invite?”<br/><br/>The Dean was one of only two Celestial beings in all of Great Zhou.<br/><br/>The Yao Chi Conference was starting within half a month, surely they couldn’t have overlooked inviting the Dean.<br/><br/>Gu Yang said, “Unless, the people of Yao Chi Immortal Palace already know the Dean’s true situation.”<br/><br/>“How would they know?”<br/><br/>Although there were rumors in Great Zhou about the Dean being severely injured, they were just rumors. The fact that Yao Chi Immortal Palace did not invite the Dean indicated they had a credible source of information.<br/><br/>As recognition dawned on Su Ningyan, she grew solemn. This was a dreadful predicament.<br/><br/>She was reminded of the fall of the Xia Dynasty, which was triggered by the emergence of the Four Great Sacred Lands leading to the downfall of the mighty Xia Emperor.<br/><br/>The Four Great Sacred Lands, which were obscure powers in ancient times, had emerged and caused the collapse of the Xia Dynasty that boasted ten Celestial Beings.<br/><br/>Now that one of the Three Great Immortal Palaces, renowned since ancient times, had reemerged, what kind of powerful beings lay within?<br/><br/>The crisis facing Great Zhou now was markedly more terrifying than what the Xia Dynasty had faced.<br/><br/>But Great Zhou now only had one Celestial Being, while the Dean could barely be counted as half. They were far from matching the Xia Dynasty.<br/><br/>This was an unwinnable fight.<br/><br/>The Four Great Sacred Lands, each harboring ulterior motives, cannot be relied upon to resist Yao Chi Immortal Palace. It’s unrealistic.<br/><br/>Faced with this unprecedented crisis, even Su Ningyan felt a surge of despair.<br/><br/>Was there any chance of survival for Great Zhou?<br/><br/>Seeing her like this, Gu Yang felt a pang of sympathy and said, “Why don’t you contact Luo Wang and see what he has to say?”<br/><br/>In terms of Great Zhou, Luo Wang was the true pillar of support.<br/><br/>However, he always stayed out of worldly affairs, focusing only on his cultivation. Even when an outsider woman took control of Great Zhou, he never expressed any opinion, completely hands-off.<br/><br/>Of course, it was precisely because of this man’s existence that even if Su Ningyan wanted to usurp the throne from the Zhao Family, no matter how powerful she became, it would be impossible.<br/><br/>With such a big thing happening now, the only option was to seek his help.<br/><br/>Little Su Ningyan simply couldn’t shoulder such a massive burden.<br/><br/>She said in a low voice, “I’ve already asked. He confirmed it.”<br/><br/>Gu Yang was a little taken aback. He hadn’t noticed when she had contacted Luo Wang. “And what about the Blue Sky Palace?”<br/><br/>Su Ningyan said, “I have to consult my Master.”<br/><br/>…<br/><br/>After leaving the palace, Gu Yang didn’t stay in Divine City. He left straight away.<br/><br/>The situation was urgent. He hadn’t even said goodbye to Su Qingzhen and the others. If he went to say goodbye to each one, who knows how much time it would take?<br/><br/>He would deal with it after this crisis.<br/><br/>If he didn’t quickly increase his power, in half a month, it would be his end.<br/><br/>Now was not the time to be peaceable and loving.<br/><br/>If he wanted to increase his power, the natural way was to gather more energy and continuously strengthen himself through repeated simulations.<br/><br/>Gu Yang opened the system, [Current balance: 435 points.]<br/><br/>He could only carry out four simulations.<br/><br/>[Would you like to use the life simulator? One use requires 100 points of energy.]<br/><br/>“Yes.”<br/><br/>[At the age of 23, you’re already in the Unleaking Realm and you’re the talk of the world for having taken Chu Xiyue away from the Qin Mansion.]<br/><br/>[You head to Qi Province, enter the Yellow Springs Cave Sky, and are targeted by a creature at the Celestial Being realm two days later. You died at the age of 23.]<br/><br/>A creature of the Celestial Being realm.<br/><br/>A sinking feeling came over Gu Yang.<br/><br/>The Yellow Springs Cave Sky was a good place to farm energy. Beings of a lower realm than his could be easily killed by him.<br/><br/>However, the reverse was also true. If he encountered a creature of a higher realm, he wouldn’t even be able to escape.<br/><br/>He and the creatures were mutually destructive.<br/><br/>If he encountered another Celestial Being, he would still have a slim chance of escaping.<br/><br/>But if he ran into a Celestial creature, he wouldn’t even know how he died.<br/><br/>He wouldn’t be able to go to Yellow Springs Cave Sky now.<br/><br/>[The simulation ends, you can keep one of the following items.]<br/><br/>[….]<br/><br/>…<br/><br/>After making his choice, Gu Yang activated the simulation again.<br/><br/>[…You and Ye Lingbo went to Water Moon Cave Sky, a few Nascent Soul-stage cultivators from the Ancient River Sword Sect came chasing. You killed them all. A transform-stage expert came chasing you.]<br/><br/>[Another transform-stage expert appeared to hold off the Ancient River Sword Sect’s transformed being. Afterwards, several transformed-stage beings appeared, setting up a grand array, keeping that expert occupied.]<br/><br/>[Yet another transform-stage expert appeared and chased after you, killing you several days later. You died at the age of 23.]<br/><br/>Another change.<br/><br/>Gu Yang’s brows furrowed even deeper. This simulation was different from the previous ones.<br/><br/>In the past, he and Ye Lingbo easily escaped to the Sky Ruins without any problems. This time, however, a Deity-transformed power pursued and killed him the entire way.<br/><br/>If there were any changes compared to the previous times, it was that his cultivation was higher now.<br/><br/>Previously, he was in the Mana realm, and now he had advanced to the Unleaking Realm.<br/><br/>Most likely, this was the unknown Deity-transformed power’s reason for being adamant about killing him.<br/><br/>The enemy saw him as a threat.<br/><br/>He couldn’t go to the Water Moon Cave World anymore.<br/><br/>….<br/><br/>Next up was the Golden Court Cave World.<br/><br/>[…You go to the Golden Court Cave World, break through the prohibition, and have a climactic battle with the Sword Saint from the East Sea. But suddenly, the lord of the Golden Court appeared and killed you on the spot. You died at the age of twenty-three.]<br/><br/>Are you serious?<br/><br/>What was the lord of Golden Court thinking?<br/><br/>They used to collaborate well before, but why did he suddenly turn against him the moment they met this time?<br/><br/>Gu Yang found it hard to understand.<br/><br/>Could it be that after he broke through to the Unleaking Realm, he became unpopular among those Cave Worlds?<br/><br/>He was in trouble now, he couldn’t even go to the Golden Court Cave World.<br/><br/>So where else could he go?<br/><br/>[The simulation has ended. You can choose to retain one of the following items…]<br/><br/>[…]<br/><br/>…<br/><br/>Gu Yang paused, looking at the remaining balance of the system, he only had 135 points left.<br/><br/>Which was to say, he could only simulate once more.<br/><br/>Was he really forced to tread down that path?<br/><br/>He had always used the three Cave Worlds to farm energy. But now, these three places had all become traps.<br/><br/>Compared to those three Cave Worlds, the energy obtained in Great Zhou was minimal; even if he extinguished all the nine noble families, he wouldn’t obtain much energy.<br/><br/>The only thing left was stepping out the last step, recharging all unparalleled divine weapons, and those two Nine Gods tripods. It should fetch one to two thousand points.<br/><br/>However, once these Magic Treasures and spiritual treasures were recharged, they would be gone.<br/><br/>Especially the two Nine Gods tripods, they were ancient treasures handed down from the ancient times, at least they were of spiritual treasure class. Using them for recharge was truly a waste.<br/><br/>“Where can I farm a massive amount of energy?”<br/><br/>Wanxiang Cave World?<br/><br/>That place was even more dangerous. In Wanxiang Gate, there were nearly ten Celestial Beings. With that amount, they could even crush the Four Great Sacred Lands.<br/><br/>Going there was no different from courting death.<br/><br/>What about the Richelieu continent?<br/><br/>The Celestial Beings there were also numerous – and moreover, because he had the divine beast incarnation, he easily attracted the attention of Celestial Beings. Once caught, he had no chance to escape.<br/><br/>Gu Yang was deep in thought.<br/><br/>Suddenly, an idea struck him, and he remembered something. He could give that a try.<br/><br/>Without any more hesitation, he used the last chance of the simulation.<br/><br/>[…]<br/><br/>…<br/><br/>…<br/><br/>On the westernmost part of Great Zhou, there was a continuous range of mountains. It was an uninhabited primitive area.<br/><br/>Deep in the mountains, there was a valley shrouded by a thick black death aura all year round.<br/><br/>Here was the notorious Valley of the Dead Souls, known as one of the five most dangerous places. Presently, it was the location of Nether Sect’s sect.<br/><br/>Since this place was occupied by the Nether Sect, no one dared to approach the nearby mountains anymore.<br/><br/>Unexpectedly though, several figures appeared outside the Valley of Dead Souls today.<br/><br/>“Congratulations, senior brother. With senior brother’s recent breakthrough, we have caught an Unleaking Realm expert.”<br/><br/>“Senior brother has just made a great achievement in his cultivation right after his breakthrough, and the two Masters should truly reward him.”<br/><br/>“We, the Nether Sect, have another Unleaking Realm corpse in our possession. The various noble families and the other five major sects are no match for our Nether Sect.”<br/><br/>…<br/><br/>The group of excited men discussed amongst themselves. In their midst was a man encapsulated by dense Death Energy, struggling continuously.<br/><br/>The leader of the group was a bald man, the eldest disciple of the Nether Sect, Shen Li.<br/><br/>He was vigorously suppressing the Unleaking Realm expert they captured after innumerable hardships and struggles – waiting until the latter stopped struggling to finally speak. “We owe it all to the sixth’s information.”<br/><br/>“Speaking of it, where did this man come from? How can such an Unleaking Realm expert sprout from Great Zhou?”<br/><br/>“This man has a surname Zhong. He uses a peculiar cultivation technique and owns some strange magical treasures; he nearly caused great trouble for the senior brother.”<br/><br/>The disciples of the Nether Sect were all talking at once.<br/><br/>“Those old immortals from the nine families are very shrewd and always hide in their lairs, protected by powerful prohibitions. It’s hard to touch them. But this man dared to expose himself flamboyantly. Does he think that our Nether Sect has no one?”<br/><br/>“The Master will soon accomplish a great cause. By then, the dean of the Literary College and Luo Wang would be nothing to be afraid of.”<br/><br/>“Adding an additional Unleaking Realm corpse to the collection of the elder brother, we can then break into different families one after another in the future. We’ll turn those immortals into corpses, one for each of our disciples. Then we’ll exterminate the Four Great Sacred Lands, and only our Nether Sect will be left.”<br/><br/>…<br/><br/>Listening to the discussion outside, Zhong Zilin, who was trapped in the waves of death aura, felt his heart sinking continuously.<br/><br/>He couldn’t understand how the Nether Sect had become so strong and reckless.<br/><br/>He had heard of this Sect before; it was one of the six major sects and was known for its low profile.<br/><br/>Who would have known that after he returned from a five-hundred-year absence, the Nether Sect had become so terrifying?<br/><br/>A few disciples of the Nether Sect suddenly attacked him. Taken by surprise, he was instantly disadvantaged.<br/><br/>He didn’t know how powerful the Nether Sect’s death energy was. He accidentally came into contact with it, instantly it stuck to him like a malignant tumor, continuously eating away at his mortal body and Mana. He almost counteracted his Unleaking body.<br/><br/>When Zhong Zilin realized his opponent was not to be trifled with, it was too late. He had been progressively suppressed until he lost all resistance a few days later- and was captured alive.<br/><br/>Based on their conversation, their plan was to transform him into a dead corpse.<br/><br/>This was even more terrible than death for him.<br/><br/>But he was helpless, he couldn’t even commit suicide.<br/><br/>The hope in Zhong Zilin’s heart was fading away.<br/><br/>PS: Three thousand four hundred words, let’s make an agreement, counting as one and a half chapters, how does that sound?\t\t\t\t\t\t</div>", "images": {}, "success": true}