{"id": 340, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132280.html", "title": "Chapter 340 - Chapter 340: Disaster That Wipes Out Everything", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 340 - Chapter 340: Disaster That Wipes Out Everything</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 340: Disaster that wipes out everything<br/><br/>Gu Yang had just flown a short distance when his vision blurred suddenly. A golden-armored general blocked his way, clutching a long halberd. Beneath the gold helmet was a face as hard and cold as granite.<br/><br/>The instant he saw the other man, his heart was filled with an unprecedented sense of crisis.<br/><br/>The feeling was similar to the one when he encountered Saint Chao Yang not long ago.<br/><br/>The person before him was quite dangerous, even more so than Saint Chao Yang.<br/><br/>Celestial Being!<br/><br/>The golden-armored general spoke, “Yaochi Yulu, please attend the Yaochi Conference.”<br/><br/>As he spoke, a flash of silvery-white light flew before Gu Yang.<br/><br/>As expected, there’s no escaping.<br/><br/>Gu Yang looked at the silvery white invitation in front of him, and couldn’t help but sigh to himself.<br/><br/>In the last simulation, he was found by people from the Immortal Palace of Yaochi who invited him to the Yaochi Conference.<br/><br/>Then he died there.<br/><br/>The reason why he showed up at Han State city to snatch people was because he hoped to avoid the people of Yaochi Immortal Palace.<br/><br/>Unfortunately, what has to come will come eventually.<br/><br/>It seems that the people from Yaochi Immortal Palace came likely to invite Qin Wu.<br/><br/>He ran to the Qin family, and practically delivered himself to them.<br/><br/>Gu Yang took the invitation and said, “I will attend the meeting at the appointed time.”<br/><br/>Looking at the celestial being in golden armor standing in front of him, he wasn’t given a choice to refuse.<br/><br/>“We are looking forward to your presence.” As soon as he saw Gu Yang take the invitation, the Yulu divine general shimmered and disappeared on the spot.<br/><br/>Gu Yang couldn’t see how he left, just as he had mysteriously appeared. Out of the blue.<br/><br/>“A Celestial Being…”<br/><br/>He fell into deep thought.<br/><br/>So far, he encountered three Celestial Beings<br/><br/>The Headmaster, Saint Chao Yang, and the divine general of Yaochi he met just now.<br/><br/>The feeling he got from each of them was completely different.<br/><br/>The Headmaster felt like an ordinary person, as if returning to simplicity, bearing no trace of being a martial artist.<br/><br/>Saint Chao Yang was elusive, standing right before him but feeling as if he did not exist in this world.<br/><br/>The divine general just now gave a sense of great strength, like a primordial divine beast, just standing there exerts immense pressure.<br/><br/>Ordinary people would probably drop dead at the sight of him.<br/><br/>These three Celestial Beings displayed three completely different states.<br/><br/>This made Gu Yang wonder, what exactly is the Celestial Being realm?<br/><br/>He had three martial arts methods at hand.<br/><br/>“Phoenix Dance Nine Heavens” did not have a method for reaching the Celestial Being realm.<br/><br/>“Nine Heavens Divine Method” was crude, as long as he could cultivate all nine divine beast incarnations to the eighth level, he could naturally achieve Celestial Being status.<br/><br/>The last one was “Taixuan Heavenly Book”, which referred to the Celestial Being realm as the Transformation of Divine in ancient times, starting to touch the part of the Way of Heaven.<br/><br/>However, the Way of Heaven had died in this world and one couldn’t cultivate to the Transformation of Divine.<br/><br/>Perhaps, he could cultivate to Transformation of Divine in Shuiyue Cave-Heaven or Wanxiang Cave-Heaven.<br/><br/>“I still need to consult the Headmaster.”<br/><br/>Gu Yang had many questions about the Celestial Being realm. He could only blindly muddle along. It would be better to ask someone with experience.<br/><br/>Thinking to this point, he opened the silvery-white invitation. It stated the time and location.<br/><br/>“Calculating the time, it is in half a month, in the North Sea.”<br/><br/>He put away the invitation, picked up Chu Xiyue, and flew towards the Divine City.<br/><br/>When the golden-armored divine general appeared just now, Gu Yang was worried that she was not able to bear the pressure exerted by the Celestial Being, so he knocked her unconscious.<br/><br/>…<br/><br/>Meanwhile, the Qin family’s estate was in total shambles.<br/><br/>When Gu Yang arrived, he didn’t bother to be polite, displaying his might and suppressing everyone from the Qin family. Whether they were guests or the Qin family members, only a few were still able to stand now.<br/><br/>The aftermath from the fierce combat of his light dragon and the three divine beasts had collapsed many buildings.<br/><br/>The group of people at the divine power level, led by Qin Guang and Liu Zheng, were full of grief and anger.<br/><br/>Over the years, the Qin family had become increasingly powerful, expanding continuously. They were always the ones bullying others, when had they ever been bullied like this?<br/><br/>“This grudge must be avenged, or I will no longer be a man!”<br/><br/>Qin Guang let out a roar full of extreme anger, and his voice spread far and wide.<br/><br/>Suddenly, a figure appeared out of thin air and said, “Yaochi Si Chen, invites Qin Wu to attend the Yaochi Conference.”<br/><br/>No one present knew how he appeared.<br/><br/>Even the highest cultivators, Qin Guang and Liu Zheng, felt a shock in their hearts, and almost blurted out “Celestial Being!”<br/><br/>Whoosh.<br/><br/>A flash of silvery-white light flew in front of Qin Guang.<br/><br/>That celestial being named Si Chen said, “Please pass on this invitation. Half a month later, by the North Sea. I hope Qin Wu can arrive on time.”<br/><br/>After finishing speaking, he seemed to remember something else, “Oh, right.”<br/><br/>Clap!<br/><br/>Si Chen snapped his fingers, and dozens of white lights flew out from the dust-whisker in his hand, each one flying into the bodies of the several dozen Divine Power realm individuals present.<br/><br/>He gave a slight smile, “In order to ensure that Qin Wu keeps his appointment, I’ve left a little trick in your bodies. I hope you won’t mind.”<br/><br/>After finishing speaking, he vanished from sight.<br/><br/>Qin Guang and Liu Zheng were both enraged and stunned. When the white light flew towards them just now, they were already on their guard. They attempted to block it subconsciously, but to no avail; they could only helplessly watch as it entered their bodies.<br/><br/>Upon examining themselves, they quickly found that there was something new near their brains. It was clearly a strand of white hair.<br/><br/>The two exchanged a glance, and both saw shock and fear in each other’s eyes.<br/><br/>What the hell was happening in this world?<br/><br/>First, there came Gu Yang, who, transformed into three divine beasts, forcibly broke the barrier of the Nine Provinces. He demonstrated incredibly powerful strength.<br/><br/>Then, another unfamiliar Celestial Being arrived and planted prohibitions in the bodies of all the Divine Power realm individuals of the Qin Family.<br/><br/>If the patriarch didn’t attend that Yaochi Conference, the entire Qin Family would face annihilation.<br/><br/>Just a moment ago, they were discussing how to seize control of the world.<br/><br/>And now, the whole Qin Family was on the brink of destruction.<br/><br/>The situation had changed incredibly fast, too fast for them to react.<br/><br/>Qin Guang was by no means a mediocre person, so he quickly made a decision and said, “I’ll go find father now, you will be in charge here.”<br/><br/>Liu Zheng nodded gravely, “Alright.”<br/><br/>The patriarch had once mentioned that his going into seclusion meant not to be disturbed unless there was a major event.<br/><br/>Yet right now, Chu Xiyue had been taken away, the Nine Provinces seal had been stolen, and all the Divine Power realm members of the Qin Family had been implanted with prohibitions. The Qin Family was at the brink of life and death. In such a time, other than seeking help from the patriarch, there was no other option.<br/><br/>…<br/><br/>…<br/><br/>While on his journey, Gu Yang turned on the simulator.<br/><br/>[At 23 years old, you are at the first layer of the Unleaking realm. You took Chu Xiyue from the Qin Family and encountered the envoy of the Yaochi Immortal Palace, gaining an invitation to the Yaochi Conference.]<br/><br/>[From the last Nine Provinces Seal, you learned the “Divine Sparrow Method”, but there was no peacock essence blood inside, so you were unable to cultivate this method.]<br/><br/>[You went to the Divine City to ask the dean about the mystery of the Celestial Beings, and a few days later, you left the Divine City with Su Qingzhen and others to head to the Continental of Musical Qin.]<br/><br/>[A month later, the Yulu Divine General appeared before you and killed you on the spot. You died at the age of 23.]<br/><br/>He knitted his eyebrows, realizing that the invitation was indeed not that easy to accept.<br/><br/>If he accepted it, he would probably be targeted by the Yulu Divine General.<br/><br/>Of course, he couldn’t not accept it either. If he refused, the other party would most likely attack him on the spot.<br/><br/>The Yaochi Conference, whether he attended it or not, he was destined to die.<br/><br/>What a troublesome matter.<br/><br/>Gu Yang looked at his system, and he saw that he now had only five hundred energy points left.<br/><br/>He could only run five simulations at most.<br/><br/>He needed to find a way to earn more energy points again.<br/><br/>And there was another problem – the last Nine Provinces Seal didn’t contain the essence blood of the five-colored peacock.<br/><br/>This was the first time he had encountered such a problem.<br/><br/>The respective divine beasts’ essence blood was included in the previous eight Nine Provinces Seals he had obtained. He used the dripping essence blood and the simulator to continuously exploit the loopholes, and that’s how he reached his current level in “Nine Heavens Divine Method”.<br/><br/>Without the essence blood in this Nine Provinces Seal, he couldn’t cultivate at all.<br/><br/>Where would he then go to find the essence blood of the five-colored peacock?<br/><br/>As Gu Yang was racked with a headache, an idea suddenly came to him.<br/><br/>That’s right – that man!<br/><br/>The mysterious strongman beneath the imperial palace. Although this man seemed to have ill intentions, the information he had given so far did not have substantial problems.<br/><br/>He once mentioned that the corpse of the Black Tortoise was in Penglai Heaven.<br/><br/>Gu Yang had confirmed this in his simulation. Behind the Beast God Temple in what was formerly Penglai Heaven and now the Continent of Musical Qin, there was indeed a body of a Black Tortoise.<br/><br/>It was worth giving it a try.<br/><br/>[The simulation is done; you can retain one of the following items.]<br/><br/>He chose number two.<br/><br/>Suddenly, his mind was flooded with some new Martial Arts knowledge. It was about the secrets of the Celestial Being realm that he had learned after consulting with the dean of the academy.<br/><br/>There was also the battle with the Yulu Divine General.<br/><br/>The strength that the man displayed was even above that of Saint Chao Yang. He was nearly killed in the blink of an eye.<br/><br/>…<br/><br/>“I might as well simulate it once again.”<br/><br/>Once again, Gu Yang opened the system, intending to test the outcome of going to the basement of the imperial palace.<br/><br/>[Do you want to use the Life Simulator? Every use consumes one hundred energy points.]<br/><br/>“Yes.”<br/><br/>[At 23 years old…]\t\t\t\t\t\t</div>", "images": {}, "success": true}