{"id": 347, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132295.html", "title": "Chapter 347 - Chapter 347: The 347Th Human Emperor’S Sword Emerges", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 347 - Chapter 347: The 347Th Human Emperor’S Sword Emerges</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 347: The 347th Human Emperor’s Sword Emerges<br/><br/>The Sword Intent in Gu Yang’s mind was gifted to him by the headmaster of the Wen Academy. For this Sword Intent, he promised to protect the academy for three hundred years.<br/><br/>He learned this sword technique to get rid of the mark left on him by that being from the Chiming Heaven.<br/><br/>However, plans cannot keep up with changes. Since then, that being from the Chiming Heaven had not troubled him again. Instead, more powerful enemies had emerged.<br/><br/>With the Cao family and Gao family as his ears and eyes, that being from the Chiming Heaven should already know about the descent of the Yao Chi Immortal Palace into the Human Realm. It probably did not dare to come to the Human Realm anymore.<br/><br/>Regardless, since he paid such a high tuition fee, wouldn’t it be a loss if he didn’t master it?<br/><br/>Therefore, Gu Yang seriously studied this sword technique.<br/><br/>But in the beginning, progress was very slight.<br/><br/>Therefore, he started from scratch to learn the sword technique. Through numerous simulations, he cultivated the sword technique to a high realm, but still had no clue about that Sword Intent.<br/><br/>Not until he got the “Taixuan Heavenly Book,” did he begin cramming the ancient cultivation system.<br/><br/>Every experience accumulated through countless simulations, like water flowing into a canal, helped him grasp this sword technique.<br/><br/>He finally understood why he couldn’t comprehend that Sword Intent before.<br/><br/>This sword technique, passed down from ancient times, follows the path of a sword cultivator, which greatly differs from contemporary martial arts.<br/><br/>It’s just like using classical physics formulae to solve quantum mechanics problems. Obviously, they don’t fit.<br/><br/>“Zhanxuan Sword Technique.”<br/><br/>As Gu Yang silently muttered the name of this sword technique, essentially, it was a technique that only a Celestial Being could master, involving some Tao-related skills.<br/><br/>Just like the fourth form of the Shenzhao Six Destroy, the Celestial Decline.<br/><br/>The first form he comprehended, named Yuan Destruction, can cut True Essence and Mana, and even the power of the Immortal Element.<br/><br/>Gu Yang was a bit eager to try and test the power of this sword move. However, he forcefully held back.<br/><br/>He still needed a good sword.<br/><br/>The Guanghan Immortal Sword should be a Pure Yang grade Magic Treasure, but he always felt that this sword was somewhat Yin oriented, better suited for women.<br/><br/>Suddenly, he thought of a sword. His heart moved, that’s it!<br/><br/>Gu Yang rose into the air and flew towards the Divine City.<br/><br/>At this moment, there were twelve days left until the Yaochi Conference.<br/><br/>…<br/><br/>The Divine City, in the Duke’s Mansion.<br/><br/>The Everlasting Hall.<br/><br/>Hum——<br/><br/>In the center of the hall, the Duke’s Sword was surrounded by a purple aura, a splendid light shot up to the sky, almost piercing the roof. In the surging mist, the scenery of the thousands of miles of rivers and mountains became even clearer.<br/><br/>The Duke was sitting next to it, his robust body bursting with unparalleled power, forming a resonance with the Duke’s Sword in front of him.<br/><br/>At last, the purple light on the Duke’s Sword receded, returning to calm.<br/><br/>The aura of the duke sitting in front also calmed down, and even the sharpness in his eyes disappeared, as if he had become an ordinary old man.<br/><br/>But there was a hint of worry between his brows.<br/><br/>At this moment, someone outside knocked on the door. “Father.”<br/><br/>The Duke said, “Come in.”<br/><br/>The door was pushed open, and a middle-aged man who exuded a killing intent all over his body walked in. This was Zhu Weiyue, the eldest son of the Duke. He said with a surprised face, “Father, have you broken through to the Unleaking Realm?”<br/><br/>His father, the Duke, had been stuck in the Mana Triple Heavens for many years. In the battle to wipe out the Red Venerate, he had been seriously injured and could never fully recover.<br/><br/>Now, he had not only fully recovered from his injury, but had finally crossed that threshold and broken through to the Unleaking Realm.<br/><br/>From then on, the Duke would have a lifespan of a thousand years. One or two hundred years later, the Zhu family might become the tenth most prominent surname under heaven.<br/><br/>This was good news for both the Duke’s Mansion and Great Zhou.<br/><br/>But there was not a trace of joy on the Duke’s face. While looking at the Duke’s Sword, he said solemnly, “The Duke’s Sword sacrificed its own source to enhance my strength. It must have sensed a great danger. Weiyue, I fear that the Great Zhou has reached a critical point for its survival.”<br/><br/>Upon hearing his father’s words, Zhu Weiyue did not agree. In his opinion, strength was the key.<br/><br/>His father had entered the Unleaking Realm. Even if the Great Zhou was destroyed, as long as he was still there, the Zhu family would be as stable as a mountain.<br/><br/>When the Qin Dynasty was destroyed, the Great Zhou replaced it. The nine surnames of the world remained the same, even the Lin family, which caused the fall of the Qin Dynasty, continued.<br/><br/>That was because the Lin family still had an Unleaking Realm powerhouse.<br/><br/>When the Qin Dynasty was destroyed back then, it was not as if the Duke’s Sword had fallen. It was merely a change of dynasty. As long as the strength was still there, the Zhu family would always be the Duke’s Mansion.<br/><br/>Zhu Weiyue comforted, “Father, with your current strength, what is there to fear even if the barbarians invade?”<br/><br/>“It’s not that simple.”<br/><br/>The Duke shook his head, he had a deep connection with the Duke’s Sword. He knew, the crisis this time was not as simple as the Great Zhou’s destruction.<br/><br/>It was a hundred times worse.<br/><br/>It could even lead to the sinking of Divine State, with billions of living beings having no place to be buried.<br/><br/>The Duke’s Sword, rather than being linked with Great Zhou’s air transport, is more closely tied to the air transport of the Divine State.<br/><br/>In the dark, the Duke’s Sword could sense changes in the air transport, thereby triggering its reaction.<br/><br/>The Duke’s Sword willingly gave all of its essence to him, helping him break through to the Unleaking Realm. It was like putting all eggs in one basket, and it would lose the ability to resist risks.<br/><br/>If the Great Zhou collapsed, it would also cease to exist.<br/><br/>If it were a common crisis, the Duke’s Sword would never make such an extreme reaction.<br/><br/>News about the Barbarian’s having another Celestial Being is still confidential, only known to the Red Mansion and the Empress Dowager.<br/><br/>The Red Mansion has its own information channels, while the Empress Dowager learned it from Gu Yang.<br/><br/>Gu Yang’s news came from simulations of the future.<br/><br/>Except for this, no one in the Great Zhou currently knows this news.<br/><br/>The Duke doesn’t know about it yet either.<br/><br/>Of course, the overreaction of the Duke’s Sword is not simply because it senses the appearance of a Celestial Being in the grasslands.<br/><br/>The crisis it senses is far more terrifying than that.<br/><br/>This world is about to be destroyed.<br/><br/>Under such a crisis, the Duke’s Sword can still get the blessing of this world’s air transport, greatly increase its strength, and even feedback to its master.<br/><br/>…<br/><br/>Hum——<br/><br/>Suddenly, the sword of the Lord of the State began to vibrate wildly, the surrounding purple aura surged, as if ready to fly out on its own.<br/><br/>The Lord of the State had never seen the sword react so intensely, not even when the Emperor was killed had such a situation occurred.<br/><br/>He reached out, took the sword into his hand, and in an instant, understood everything.<br/><br/>Zhu Weiyue, standing by his side, was inevitably worried when he saw the sword reacting so abnormally and asked, “Father, what has happened?”<br/><br/>“He’s here!”<br/><br/>With a single phrase from the Lord of the State, he had already vanished from the spot.<br/><br/>Who was he?<br/><br/>Who was he referring to?<br/><br/>Zhu Weiyue was very puzzled, but there was no one to ask.<br/><br/>…<br/><br/>……<br/><br/>“Mother, your child greets you.”<br/><br/>In the Qi Feng Pavilion of the Imperial Palace, the eleven-year-old little Emperor knelt down and respectfully kowtowed.<br/><br/>Inside, Su Ningyan seemed somewhat distracted, casually saying, “Get up, the Emperor doesn’t need to offer such grand ceremonies.”<br/><br/>The little Emperor stood up and said, “Great Zhou governs the world with filial piety, as a role model to the world, these ceremonies must not be abandoned.”<br/><br/>At this moment, Su Ningyan did not have the mood to exchange these formalities with the young Emperor and waved her hand, “Dismiss yourself.”<br/><br/>“Yes.”<br/><br/>The little Emperor slowly withdrew from the throne room, once outside, he wore a smile on his face and left the Qi Feng Pavilion accompanied by an inner eunuch.<br/><br/>In the pavilion, Su Ningyan for some reason, felt a constant sense of alarm today, as if something bad was about to happen.<br/><br/>A martial artist’s intuition is very accurate, she pondered for a moment, opened the entrance leading to the underground palace, and went down.<br/><br/>Deep underground, there was a huge underground palace.<br/><br/>In the middle of it, sat a giant cauldron with a wisp of blue flame burning within.<br/><br/>Within the flame, lay a sword, its body overflowing with rainbow luster, a delicate crevice could be seen at the tip of the sword.<br/><br/>This sword, was precisely the Blue Sky Sword that Su Ningyan obtained from the Demon Suppression Tower. The tip of this sword was broken and was gradually being repaired over several months under the flame of the giant cauldron.<br/><br/>Before the cauldron sat a woman in palace attire, sweating from the forehead as she focused intensely on the Blue Sky Sword within the flame.<br/><br/>Su Ningyan performed a salute, “Master, for some reason, your disciple feels unusually uneasy. I feel that something very bad is about to happen.”<br/><br/>Upon hearing her words, the woman in palace attire furrowed her eyebrows, “You have not reached the Celestial Being realm yet, you do not have the ability to feel the coming threats.”<br/><br/>“However, you being the Empress Dowager of Great Zhou and carrying the fortune of Great Zhou, this should be a warning from the unknowable future.”<br/><br/>Su Ningyan’s gaze hardened, “Master, are you saying that something big is about to happen to Great Zhou?”<br/><br/>“No——”<br/><br/>The woman in palace attire had not finished her words when she appeared to sense something. She suddenly turned her gaze, her face filled with shock, she exclaimed in disbelief, “The Human Emperor’s Sword!”<br/><br/>The flames within the giant cauldron became unstable, reflecting her inner turmoil.<br/><br/>Su Ningyan also felt a strange fluctuation that made her heart pound.<br/><br/>She had a feeling that something that could change her destiny had appeared.<br/><br/>Hearing her master’s words, a boom echoed in her head.<br/><br/>Human Emperor’s Sword?<br/><br/>This was one of the earliest divine weapons of the human clan, a symbol of the clan’s fortune, and the supreme symbol of the human monarchy.<br/><br/>With the Human Emperor’s Sword, one could truly claim to be the sovereign of the human clan.<br/><br/>Since the fall of the Xia Emperor, the whereabouts of the Human Emperor’s Sword were unknown.<br/><br/>For a thousand years, the founding Emperor of the Qin dynasty and the founding Emperor of the Zhou dynasty had both diligently sought this object, but unfortunately, they obtained nothing.<br/><br/>Now, the Human Emperor’s Sword had reappeared in the world.<br/><br/>Moreover, it was in Divine City!<br/><br/>That direction, was the location of the ritual altar.<br/><br/>“Master——” Su Ningyan struggled to suppress her urge to seize the Human Emperor’s Sword, turning to look at the woman in palace attire.<br/><br/>By this time the woman in palace attire had already calmed down, and the flame within the cauldron had stabilized.<br/><br/>She asked, “Can you contend with the one from the Wen Academy?”<br/><br/>This sentence immediately extinguished Su Ningyan’s ambition to seize the Human Emperor’s Sword.<br/><br/>As long as the headmaster of the Wen Academy was present, no one could snatch the Human Emperor’s Sword under his watch.<br/><br/>The woman in palace attire said cryptically, “The Human Emperor’s Sword is not something that just anyone can wield. Back then, the Xia Emperor, who was extremely powerful and possessed vast territories, could not gain the approval of the Human Emperor’s Sword. In his hands, it became a mere symbol of power.”<br/><br/>“Otherwise, how could the Red Venerate have been able to kill the Xia Emperor?”<br/><br/>Su Ningyan was hearing about this for the first time and said in shock, “Even the Xia Emperor couldn’t gain the approval of the Human Emperor’s Sword? Why?”<br/><br/>“Because the Xia Emperor had the bloodline of the Monster Race. How could he gain the approval of the human clan’s treasure?”<br/><br/>…<br/><br/>……<br/><br/>Within the Divine City, inside a Red Mansion.<br/><br/>A man in black robes suddenly opened his eyes, revealing a shocked expression on his face for the first time.<br/><br/>“Teacher, something big has happened——”<br/><br/>An excited voice came from outside, its tone was shrill due to excitement.<br/><br/>With a bang, the door was pushed open. A small figure rushed in, her little face flushed as she exclaimed, “The Human Emperor’s Sword has appeared…”<br/><br/>The man in black was once again calm and responded with a simple, “Oh.”<br/><br/>Oh?<br/><br/>The girl stared at him with wide eyes, unable to believe what he had just said. She was hopping with impatience, “That’s the Human Emperor’s Sword, the Human Emperor’s Sword, the greatest treasure of the human clan. Teacher, aren’t you going to act quickly? What if it’s taken by the people from Three Holy Gates and Red Venerate?”<br/><br/>“What does it have to do with me?”<br/><br/>The man in black questioned and closed his eyes again.<br/><br/>The girl was stupefied, unable to understand why her teacher could remain indifferent in the face of such a significant event as the reemergence of the Human Emperor’s Sword.\t\t\t\t\t\t</div>", "images": {}, "success": true}