{"id": 346, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132293.html", "title": "Chapter 346 - Chapter 346: Breakthrough 346", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 346 - Chapter 346: Breakthrough 346</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 346: Breakthrough 346<br/><br/>[…Died at the age of thirty-one.]<br/><br/>This time in the simulation, Gu Yang opened the gateway to the Water Moon Pocket Universe, with little consequence to the grand scheme of things. His life trajectory was more or less the same as in previous simulations.<br/><br/>Simply put, the overall power of the Water Moon Pocket Universe was rather weak, and did not compare to the Wanxiang Pocket Universe and the Yellow Springs Pocket Universe.<br/><br/>“It’d be nice if the Star Luo Pocket Universe gateway could be opened,” he mused.<br/><br/>He thought about Star Luo Sect, who were the first to invade Great Zhou in the original timeline.<br/><br/>Star Luo Sect’s overall power was not below Wanxiang Gate, they should be able to pose some trouble for Yao Chi Immortal Palace.<br/><br/>Gu Yang’s idea was simple: to stir up trouble for Yao Chi Immortal Palace. The more chaotic the situation was, the better, because he could then exploit it to his benefit.<br/><br/>Unfortunately, only a Celestial Being could open the gateway to the Star Luo Pocket Universe.<br/><br/>The Dean of the Literature Institute should possess this ability, but persuading him to willingly open a gateway to another pocket universe, is probably not an easy task.<br/><br/>[Simulation ended…]<br/><br/>After receiving his reward, Gu Yang fell into deep thought again.<br/><br/>He had exhausted every option available to him. Now, only the Golden Court Pocket Universe was left, with only three Celestial Beings. Moreover, the Golden Court system had a sizeable weakness, so their overall power likely fell short of even the Water Moon Pocket Universe.<br/><br/>Could it be that eight years was the absolute limit?<br/><br/>“Wait a minute…”<br/><br/>Suddenly, a lightbulb went off in Gu Yang’s head, he remembered something and slapped his thigh.<br/><br/>How could he have forgotten about this!<br/><br/>In one of the simulations, he recalled that the ruler of Golden Court, after destroying other two rulers and obtaining the Divine Amnesty from the golden-eyed Divine Ape, his mana made a breakthrough to the Hollow Void realm.<br/><br/>Among numerous simulations, he was the only confirmed person who made a breakthrough into the Hollow Void realm.<br/><br/>Despite its glaring weaknesses, the Golden Court system boasted one aspect that was unparalleled in any other cultivation system: the height of its ceiling.<br/><br/>Whether it was Martial Arts or Beast Taming, or cultivation systems like the Wanxiang Pocket Universe, due to the constraints imposed by the Way of Heaven, cultivators could only reach up to the Celestial Being realm, and no further.<br/><br/>Despite the Xia Emperor being exceedingly powerful, he still found himself stuck at the Celestial Being realm, unable to reach Hollow Void in his lifetime.<br/><br/>However, a Celestial Being far less skilled than the Xia Emperor, such as the ruler of the Golden Court, had the chance to attain that level. This just goes to show that each system had its own merits.<br/><br/>Just how weak was the Golden Court system, you ask?<br/><br/>A little over a thousand years ago, the son of Xia Emperor, King Liang, annihilated the Golden Court Pocket Universe on his own. Several celestial beings were slain, and even the Golden Emperor’s jade book was divided into three parts.<br/><br/>However, the biggest advantage of the Golden Court system was that all its power originated from the core of the Golden Court: the Golden Emperor’s jade book.<br/><br/>This meant that, theoretically, those practicing this system could not only reach the Hollow Void realm but even the Mana Representation realm or even higher realms.<br/><br/>As Gu Yang contemplated this, he couldn’t help but be excited.<br/><br/>Even if the system of the Golden Court was weak, once it reached the Hollow Void realm, surely it could hold its own against a Celestial Being realm?<br/><br/>While annihilating Yao Chi Immortal Palace was out of the question, defending the Golden Court Pocket Universe shouldn’t be an issue.<br/><br/>Soon, a general plan began to take shape in Gu Yang’s mind.<br/><br/>…<br/><br/>[…You opened the gateway to the Wanxiang Pocket Universe and then went to the Guanghan Immortal Palace with Chu Xiyue and others.]<br/><br/>[A year later, you left Guanghan Immortal Palace. A few days later, the Jade Dew Divine General appeared and killed you. Died at the age of twenty-three.]<br/><br/>This Jade Dew Divine General is really like a vengeful ghost.<br/><br/>Gu Yang didn’t want to burn bridges, but it seems like he has no choice.<br/><br/>…<br/><br/>[…You opened the gateways to the Wanxiang Pocket Universe and the Yellow Springs Pocket Universe, then you took Chu Xiyue and the others to the Guanghan Immortal Palace.]<br/><br/>[A year later, you left Guanghan Immortal Palace. You quietly went to Liangzhou, and with great difficulty managed to enter the Golden Court Pocket Universe. You managed to break through the blockade of the Sword Saint of the Eastern Sea.]<br/><br/>[The ruler of Golden Court showed up, ready to take action, when you took out the Divine Amnesty from the Sky King and negotiated a deal with him.]<br/><br/>[Half a year later, you raided everywhere and killed the immortals of the other two empires. The rulers of the two empires couldn’t help but form an alliance in order to get rid of the Golden Court empire. You laid a trap, using the Divine Amnesty from the Sky King as bait, leading to infighting among the two empire rulers. Finally, the ruler of the Golden Court, appeared and killed them in one fell swoop.]<br/><br/>[The ruler of the Golden Court combined the parts of the Golden Emperor’s jade book and began his retreat. Half a year later, the Celestial Beings of Yao Chi Immortal Palace invaded Golden Court Pocket Universe and attacked the Golden Court. The ruler of Golden Court hurriedly fought back but was defeated and died. You also ended up in the crossfire and died on the spot. Died at the age of twenty-five.]<br/><br/>Just missed it by a hair.<br/><br/>Gu Yang had every reason to believe he was being targeted.<br/><br/>It was too much of a coincidence that just as the ruler of the Golden Court was about to make a breakthrough, the Celestial Beings from Yao Chi Immortal Palace came, causing his efforts to come to naught.<br/><br/>The timeline was too rushed.<br/><br/>It seems that he will have to take bigger risks.<br/><br/>…<br/><br/>[…]<br/><br/>[Half a year later, you left Guanghan Immortal Palace and headed to Golden Court Pocket Universe…]<br/><br/>[…The ruler of Golden Court combined the Golden Emperor’s jade book and began his retreat…]<br/><br/>[One year later, a Celestial Being from Yao Chi Immortal Palace arrived and invaded the Golden Court. A huge battle ensued. The ruler of the Golden Court made a breakthrough on the battlefield. He ended up dying along with the Celestial Being from Yao Chi Immortal Palace.]<br/><br/>[Golden Court Empire descended into chaos, and the celestial beings under its control started fighting each other for the Golden Emperor’s jade book, only to be suppressed by you in the end. You obtained the Golden Emperor’s jade book.]<br/><br/>[Soon after, a strange entity broke through the defense of the Sword Saint from Eastern Sea and entered the Golden Court Pocket Universe. You were targeted by a Celestial Being-level entity and were soon killed by it. Died at the age of twenty-six.]<br/><br/>So close, yet so far.<br/><br/>Although the ruler of Golden Court managed to make a breakthrough at the last moment, he still died, proving just how weak this cultivation system was.<br/><br/>Gu Yang scratched his head.<br/><br/>[Simulation ended. You can retain one of the following.]<br/><br/>[First, your martial arts realm at the age of twenty-six.]<br/><br/>[Second, your martial arts experience at the age of twenty-six.]<br/><br/>[Third, your life wisdom at the age of twenty-six.]<br/><br/>It was only three years.<br/><br/>After thinking for a moment, he chose the first option. Choosing the second one was simply not cost-effective.<br/><br/>If he chose the first option, there was a possibility that he might be able to enhance the “Nine Heavens Divine Method” further. If he were to make a breakthrough to the eighth layer of Divine Phoenix Method, all problems would be solved.<br/><br/>However, it was too difficult. To elevate the realm of the Phoenix Incarnation to the Celestial Being Realm, the requirement in terms of essence blood would certainly be astronomical.<br/><br/>There was no need to think about achieving this merely with fifty-odd simulations.<br/><br/>…<br/><br/>Gu Yang simulated again and again, trying to find the optimal timing for the ruler of the Golden Court to successfully break through to the Hollow Void realm.<br/><br/>However, he kept falling short each time.<br/><br/>Before he knew it, he had already used up twenty simulations.<br/><br/>[…Your “Divine Ghost Technique” has broken through to the seventh layer…]<br/><br/>[…Died at the age of twenty-six.]<br/><br/>This time, there were some rewards, and Taiyin Youying also made a breakthrough to the Unleaking Realm. However, it had no impact on the overall situation.<br/><br/>Even if the incarnations of the nine Divine Beasts reached the Unleaking Realm, he would still face inevitable death when confronting such mysterious beings of the Celestial Being realm.<br/><br/>…<br/><br/>Gu Yang was not discouraged and prepared to try several more times. If it still didn’t work, he would follow the path that he knew would keep him alive for eight years.<br/><br/>[…You bring Chu Xiyue and others into the Immortal Palace of Guanghan.]<br/><br/>[Soon, you discover that a certain resonance occurred between you and the Immortal Palace of Guanghan. After three months, you successfully take control of a part of its prohibitions.]<br/><br/>[You leave the Immortal Palace of Guanghan…]<br/><br/>[…Dead at the age of twenty-six.]<br/><br/>Oh really?<br/><br/>He was both surprised and delighted.<br/><br/>He had actually gained control of a part of the prohibitions of the Immortal Palace of Guanghan. After all, the Immortal Palace of Guanghan was a force as famous as Yao Chi Immortal Palace in ancient times.<br/><br/>If he controlled the prohibitions of the Immortal Palace of Guanghan, perhaps he could stop those two Celestial Beings from invading.<br/><br/>Unfortunately, in the simulation, he was too rigid, only acting according to his initial ideas without adapting to changes.<br/><br/>Even after gaining control of a part of the prohibitions of the Immortal Palace of Guanghan, he still followed the original plan and proceeded to the Golden Court Pocket Universe.<br/><br/>The simulation was wasted.<br/><br/>[The simulation ends…]<br/><br/>[…]<br/><br/>…<br/><br/>[…You stay in the Immortal Palace of Guanghan for three years, gaining control of some provisions.]<br/><br/>[One day, two Celestial Beings appear. You use the prohibitions of the Immortal Palace of Guanghan to block them outside.]<br/><br/>[After a stalemate that lasts for ten years, one day, a terrifying entity invades the palace and kills the two Celestial Beings. Soon after, the prohibitions of the palace are all destroyed, and you all die on the spot. You die at the age of thirty-six.]<br/><br/>Thirteen years!<br/><br/>Gu Yang was overjoyed. Finally, he could live past ten years.<br/><br/>Moreover, it was in a way he hadn’t previously considered.<br/><br/>Unexpectedly, he was able to control the prohibitions of the Immortal Palace of Guanghan.<br/><br/>Oh right, it was thanks to the metamorphosis of the Divine Beast Youying.<br/><br/>Taiyin Youying was the incarnation of the moon, and the Immortal Palace of Guanghan—this name undoubtedly originated from the moon. There must be some connection between the two.<br/><br/>So, when his Youying incarnation reached the Unleaking Realm, it resonated with the Immortal Palace of Guanghan, enabling him to control the palace’s prohibitions.<br/><br/>With this realization, Gu Yang felt elated. Finally, he had enough time to make a breakthrough.<br/><br/>The monstrous entity that appeared at the end was most likely a mischievous being of the Hollow Void level, capable of easily killing two Celestial Beings.<br/><br/>However, this was not unexpected for him; he had seen before how mischievous beings could devour each other in the Yellow Springs Pocket Universe.<br/><br/>Therefore, as long as there are enough mischievous beings, the emergence of one at the Hollow Void level was inevitable.<br/><br/>…<br/><br/>[…You open the portal of the Wanxiang Pocket Universe and hide in the Immortal Palace with Chu Xiyue and others.]<br/><br/>[Three years later, you gain control of some prohibitions of the Immortal Palace of Guanghan. One day, two Celestial Beings invade the Palace.]<br/><br/>[You use the prohibitions of the Immortal Palace to block them out.]<br/><br/>[After a stalemate that lasts for twelve years, a mysterious figure appears one day, shatters the prohibitions of the Immortal Palace with a wave of a hand, and you die—at age thirty-eight.]<br/><br/>Where did this mysterious figure come from, who could easily break the palace’s prohibitions?<br/><br/>Gu Yang felt somewhat depressed.<br/><br/>Unexpectedly, in the absence of mischievous beings, an unknown powerful being appeared.<br/><br/>It’s probably one of the ancient beings of the Yao Chi Immortal Palace.<br/><br/>Just his luck.<br/><br/>However, at least he managed to live for an additional two years, totaling fifteen years. This had met his expectations.<br/><br/>[The simulation ends…]<br/><br/>[…]<br/><br/>Gu Yang chose option two.<br/><br/>…<br/><br/>After that, the process was repeated.<br/><br/>Once, twice, three times…<br/><br/>After a total of thirty simulations–<br/><br/>[…You’ve connected the hidden passages and acupuncture points of your body, forming an inner universe. The Unleaking body evolved to the second layer.]<br/><br/>[…Dead at thirty-eight.]<br/><br/>At last, he made it.<br/><br/>Gu Yang breathed a sigh of relief.<br/><br/>What he feared most was that he might deplete all his simulations without making a breakthrough.<br/><br/>Fortunately, the breakthrough came at the right time.<br/><br/>At this point, he still had over eight hundred energy points remaining.<br/><br/>Fifty simulations, costing him a total of five thousand energy points. Breaking through a single realm was indeed very difficult.<br/><br/>[Simulation ends, you can keep one of the following…]<br/><br/>[…]<br/><br/>“I choose one.”<br/><br/>Suddenly, cracking sounds rang out from Gu Yang’s body, growing louder and louder, gradually turning into the sound of wind and thunder, inducing changes in the sky.<br/><br/>He felt all the acupuncture points around his body were undergoing unprecedented changes.<br/><br/>Upon internal inspection, these acupuncture points were expanding continuously, and between each point, a new connection was formed as if they had become a whole.<br/><br/>This was the so-called inner universe, a profound state suggesting that one’s body could contain infinite power like a universe.<br/><br/>After an unknown period of time, the changes within Gu Yang’s body finally ceased. He opened his eyes, and within them shone two fiery red lights so substantive that it seemed as if they could pierce the sky.<br/><br/>At this moment, the mana within his body was at least ten times larger than before, resulting in a drastic change in his overall strength.<br/><br/>Moreover, there was an unexpected surprise.<br/><br/>He had finally deciphered a sword technique from the profound sword intent in his mind.\t\t\t\t\t\t</div>", "images": {}, "success": true}