{"id": 344, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132289.html", "title": "Chapter 344 - Chapter 344: 344 Slaying The Celestial Being", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 344 - Chapter 344: 344 Slaying The Celestial Being</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 344: 344 Slaying the Celestial Being<br/><br/>Half God, it’s a term used in the West Bank Continent, which refers to the Celestial Being realm.<br/><br/>In the Valley of Dead Souls, there was a Celestial Being.<br/><br/>Zhong Zilin felt an impulse to turn tail and run.<br/><br/>The power of a Half God was unmatched by any legend, even a third-tier legend was no match for a Half God.<br/><br/>They stood at the apex of the world, the closest beings to the gods.<br/><br/>The fundamental difference between Half God and legend, is the possession of divine power, a higher level of force than mana.<br/><br/>Even using taboo curses, it would still be difficile for legend to hurt Half God.<br/><br/>In the history of the West Bank Continent, there have been only five real Godslaying events, where a Half God was killed. Behind all of these, there were gods plotting for them to succeed.<br/><br/>Zhong Zilin had also interacted with Half Gods. In fact, his being an outsider, able to stand firm in a foreign land, was because he had joined a major power.<br/><br/>There was a Half God in that major power. He had been granted an audience twice.<br/><br/>So, he instantly recognized that the person in the valley was a Half God.<br/><br/>Despite being separated by two continents, each with its own cultivation system, they ultimately converged.<br/><br/>When a martial artist reached the Celestial Being realm, the power they possessed was almost identical to divine power.<br/><br/>Zhong Zilin was stunned to see that Gu Yang showed no sign of leaving. He couldn’t believe the thought that sprang to mind, “Could it be that he wants to slay a god?”<br/><br/>Half God is also a god. During this age when all gods fell into slumber, a Half God wandering the lands was considered an embodiment of a deity.<br/><br/>To kill a Half God is to slay a god.<br/><br/>Had he gone mad?<br/><br/>Zhong Zilin was afflicted by an internal struggle.<br/><br/>He had just recently attained the status of a legend and was still at the first level. In front of a Half God, he was barely a match.<br/><br/>Only the third-tier legends could exchange a number of blows with Half Gods.<br/><br/>If he stayed, he was close to death.<br/><br/>After a moment, he made the decision. He waved his hand and used some mana to send his disciple, Zhong Yanxing, away, speaking through a message talisman, “Wait for me in Yuzhou.”<br/><br/>He, however, stayed behind, retrieved his weapon, and provided auxiliary support for Gu Yang.<br/><br/>…<br/><br/>Gu Yang stood with his hands behind his back, three divine beasts standing behind him; they stared intently in the direction of the valley, eyes filled with a fierce intent to combat.<br/><br/>He said loudly, “Shao Yuhong, do you truly believe that by means of some shallow tricks, opportunistic sneaking into the Celestial Being realm, you are strong enough to be undefeatable?”<br/><br/>From the valley, a woman flew out.<br/><br/>Although she appeared humanoid, there wasn’t a trace of humanly scent in her. Her skin was somewhat bluish, and her eyes glowed in a dark, eerie black. She looked akin to a zombie.<br/><br/>This person was none other than one of the two leaders of the Nether Sect, Shao Yuhong.<br/><br/>“I did not anticipate that in this world, there are still people who know my name.”<br/><br/>Her tone was somewhat complex.<br/><br/>Ever since a hundred years ago, after the Dao Sect’s leader obliterated the Nether Sect, no one had called her by her name.<br/><br/>In the mouths of the world, she and her senior brother were referred to as the Yin and Yang demons of the Nether Sect. She was Yin demon and her senior brother, Yang demon.<br/><br/>A hundred years had passed, and finally, she heard her name once again.<br/><br/>“So, you are Gu Yang?”<br/><br/>She stared at the young man across from her, her gaze growing even deeper, as if she intended to see through him, “You truly are a one-in-a-million genius, having already reached this realm. If you had arrived a few days earlier, I might have been wary of you, but alas, you have come too late.”<br/><br/>“Now, you are mine!”<br/><br/>Saying this, she turned her hand, revealing a black bronze bell that was completely dark and emitting an eerie aura.<br/><br/>This was a spirit tool called Heart Capturing Bell, and it was the treasure of the Nether Sect.<br/><br/>Back in the day, when the leader of the Dao Sect came to destroy the Nether Mountain, she had escaped unharmed with her senior brother by using this treasure.<br/><br/>Over the past hundred years, she had been in the Valley of Dead Souls, utilizing the valley’s adverse qi to re-refine the Heart Capturing Bell, elevating its power to a higher level, becoming even more insidious and ruthless.<br/><br/>She had originally intended to use this spirit tool against the Academy’s Dean.<br/><br/>But this young man before her eyes posed a considerable threat to her, especially the three divine beasts behind him, each possessing formidable divine powers, making even her somewhat wary.<br/><br/>A moment ago, she watched as her disciple Shen Li was killed. Under the siege of the three divine beasts, he was left without any opportunity to fight back.<br/><br/>She did not want to follow in her disciple’s footsteps, so without hesitation, she brought out the Heart Capturing Bell, prepared to strike him down with a thunderous blow.<br/><br/>Afterward, she planned to refine the man and the three divine beasts into death zombies. With them in her control, no one in the world would be able to resist her.<br/><br/>Shao Yuhong swung the bronze bell in her hand.<br/><br/>Ding Ling Ding Ling…<br/><br/>An invisible ripple spread out in all directions.<br/><br/>Not far away, Zhong Zilin suddenly froze, his eyes rapidly filled with a layer of black fog.<br/><br/>He abruptly turned around and lunged towards Gu Yang.<br/><br/>At this moment, a black screen of light appeared around Gu Yang, which was the Xuan Light Shield.<br/><br/>Under the invisible ripple, the black screen of light shuddered violently, maintaining only for a single breath before shattering.<br/><br/>The ripple swept over Gu Yang’s body, causing him to stiffen involuntarily as a black air crept onto his skin.<br/><br/>Simultaneously, the three divine beasts behind him were also affected, their bodies trembling slightly as they resisted the ringing of the Heart Capturing Bell.<br/><br/>Under these circumstances, Zhong Zilin, controlled by the Heart Capturing Bell, attacked. In the blink of an eye, he appeared in front of Gu Yang, thrusting a sword towards his chest.<br/><br/>At the critical moment, a long black tail flashed past from one side, whipping Zhong Zilin away.<br/><br/>A monkey with golden pupils appeared out of nowhere, holding a golden token in its hand, which completely blocked the bell sound of the Heart Capturing Bell.<br/><br/>This token was the Sky King pardon token from the Golden Court that originally belonged to the Divine Ape.<br/><br/>Gu Yang’s first pet, the golden-eyed Divine Ape Yuan Xing, had always wanted to refine this pardon token and inherit the rank and power of the Sky King.<br/><br/>In the Golden Court system, the Sky King was equivalent to the Celestial Being realm.<br/><br/>…<br/><br/>“Another divine beast?”<br/><br/>Shao Yuhong’s eyes narrowed. This divine beast was a species unknown even to her.<br/><br/>What shocked her even more was that the item held by this divine beast could withstand the bell sound of the Heart Capturing Bell. She wondered what kind of treasure it was.<br/><br/>“It seems like I actually have to make a sincere effort.”<br/><br/>Seeing that even the Heart Capturing Bell was unable to deal with the adversary, Shao Yuhong realized that using other means would also be insufficient to kill him, so without hesitation, she contacted that entity.<br/><br/>BOOM!<br/><br/>The Valley of Dead Souls shook violently and a horrible aura exploded, covering everything. Even the ubiquitous black fog surrounding it was expelled.<br/><br/>This was the kind of stature a real Celestial Being should have.<br/><br/>Compared with this person, Shao Yuhong was like a firefly compared to the glorious moon.<br/><br/>The Celestial Being dressed in a spotless white robe had an otherworldly and secluded charm, standing there like a transcendent being, akin to a disgraced Immortal.<br/><br/>However, all of this was marred by the pitch-black wound on his chest, imbuing him with a strange aura.<br/><br/>His face was perfect, but his skin was deathly pale. His hollow gaze was marked by an eerie calmness.<br/><br/>All signs pointed to the fact that this was a corpse.<br/><br/>Shao Yuhong had truly transformed this Celestial Being’s body into a corpse demon.<br/><br/>She commanded firmly, “Kill him.”<br/><br/>The corpse demon, glowing faintly with black light in its eyes, turned its head, fixed its gaze on Gu Yang, and vanished into thin air.<br/><br/>In the next moment, it appeared in front of Gu Yang, rigidly extending its hand in a slapping motion.<br/><br/>Boom—<br/><br/>Almost simultaneously, the sound of an explosion resounded from all around. The terrifying power sent the surrounding black fog hundreds of meters away.<br/><br/>A hairy huge hand reached out to block the attack.<br/><br/>Bang!<br/><br/>With a thunderous sound, the gigantic Divine Ape was send flying backwards.<br/><br/>“Continue.”<br/><br/>Gu Yang threw his giant spirit hammer over.<br/><br/>The Divine Ape caught the Spirit Tool and roared, launching itself at the corpse demon.<br/><br/>In the ensuing chaos, the White Tiger blocked the corpse demon.<br/><br/>The White Tiger was a master of slaying, its close-combat abilities were by no means inferior to the Divine Ape. It was even faster and entangled with the corpse demon in combat.<br/><br/>Then the Phoenix and the Candle Dragon joined the battle.<br/><br/>Four divine beasts were going against the corpse demon.<br/><br/>These four divine beasts were the incarnations of Gu Yang. Through their mutual understanding, fighting together was not a simple addition. Their cooperation was seamless, completely suppressing the corpse demon.<br/><br/>From his previous simulations, Gu Yang already knew the weak points of the corpse demon.<br/><br/>After becoming a corpse demon, it fought based purely on instinct and lacked intelligence. Most of the time, it depended on its physical body.<br/><br/>Against any other foe from the Unleaking realm, it would be a brutal end. But Gu Yang was least afraid of physical fights. Even Celestial Beings could only endure a beating when facing the incarnations of seven Unleaking realm divine beasts.<br/><br/>…<br/><br/>“How is this possible?”<br/><br/>Seeing her corpse demon at a disadvantage, Shao Yuhong was both shocked and furious.<br/><br/>She and her elder fellow disciple had spent decades transforming this Celestial Being’s body into a corpse demon and successfully breaking into the Celestial Being realm. She thought that she could dominate the world, but she wasn’t even able to defeat a youngster from the Unleaking realm on the first outing of her corpse demon.<br/><br/>How could she accept this?<br/><br/>“You’ve pushed me too far!”<br/><br/>A hint of frenzy flickered in her eyes. She suddenly bit her tongue, spewing out a mouthful of essence blood, which transformed into the purest Immortal Element.<br/><br/>The corpse demon’s eyes shot out two beams of black light. As its aura dramatically increased, it slapped the White Tiger away and kicked the Divine Ape, causing it to plummet to the ground, creating a deep pit.<br/><br/>Within a blink of an eye, it had turned the tables and launched an attack on the Phoenix, which posed the greatest threat to it.<br/><br/>The Phoenix opened its mouth and spewed out a flame, the mighty power of the Phoenix True Flame.<br/><br/>The corpse demon waved its fingers, and an incredible sword intention split the flame in half. If not for the Phoenix’s quick reaction, this blow would have cleaved it in two.<br/><br/>…<br/><br/>Seeing the corpse demon showing off its formidable power and knocking around the divine beasts, Shao Yuhong finally showed a trace of a smile on her face.<br/><br/>This was the way it should be.<br/><br/>“You seem to have forgotten someone.”<br/><br/>Suddenly, a voice sounded beside her ear.<br/><br/>The voice was so close it startled her.<br/><br/>She suddenly realized that she had overlooked the most important person.<br/><br/>In this moment of crisis, without time to think, her first reaction was to recall the corpse demon.<br/><br/>But it was too late.<br/><br/>A blade was already descending from above.<br/><br/>The fourth move of Divine Firmament Annihilation: Celestial Decay!<br/><br/>Shao Yuhong felt the sensation of merging with heaven and earth disappearing and that she was falling, dropping from the Celestial Being realm back to the Unleaking realm.<br/><br/>Next, an unprecedented sense of weakness hit her.<br/><br/>Her clothing became bedraggled, her life force was rapidly draining, her skin started festering, and a foul odor permeated the air.<br/><br/>An indescribable fear welled up in her heart as death’s shadow enveloped her.<br/><br/>“Evil ways are ultimately evil—”<br/><br/>Gu Yang’s cold voice reverberated in her ears as her sight turned black, plunged into eternal darkness.<br/><br/>A powerful practitioner who had once stepped into the Celestial Being realm had fallen.<br/><br/>…<br/><br/>[Received 1,000 energy points. Current balance is 1,392 points.]<br/><br/>Looking at Shao Yuhong that had turned into a puddle of blood, Gu Yang finally breathed a sigh of relief. He was at last relieved of his burden.<br/><br/>He collected the things she left behind, especially the black bell that even a strong practitioner of the Unleaking realm couldn’t resist. It was definitely not a common magic treasure.<br/><br/>Then, he turned to the corpse demon of the Celestial Being realm.<br/><br/>After the death of its master, the corpse demon ceased its movements and fell down due to lack of power.<br/><br/>The Divine Ape flew up from the ground at the same moment, caught the corpse demon, and brought it to Gu Yang.<br/><br/>He laid his hand on the corpse and a prompt appeared before him, [Energy source detected, do you wish to charge?]<br/><br/>“Yes.”<br/><br/>[Charging successful, received 2,000 energy points. Current balance is 3,392 points.]<br/><br/>A single corpse was worth 2,000 points.<br/><br/>Gu Yang was slightly surprised.<br/><br/>This meant the corpse demon’s realm before death was certainly more than just the Celestial Being realm.<br/><br/>He felt like he had stumbled upon a great windfall.<br/><br/>With more than 3,000 points, he could carry out over thirty simulations.<br/><br/>PS: Will be releasing two chapters a day, each chapter no less than 3,000 words.\t\t\t\t\t\t</div>", "images": {}, "success": true}