{"id": 343, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132288.html", "title": "Chapter 343 - Chapter 343: 343 Heaven Does Not Allow", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 343 - Chapter 343: 343 Heaven Does Not Allow</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 343: 343 Heaven Does Not Allow<br/><br/>“Master——”<br/><br/>Not too far away, one person was following behind the disciples of Nether Sect, yet no one noticed him.<br/><br/>That man was Zhong Yanxing, the disciple of Zhong Zilin, holding an artifact known as the Cloak of Invisibility, a relic of West Bank Continent’s god of thieves.<br/><br/>This artifact was bestowed upon him by his master for his protection.<br/><br/>Once he dons this cloak, he can completely hide himself, even from most legendary experts.<br/><br/>That time when Zhong Zilin was attacked, Zhong Yanxing happened to be absent. Sensing something off, he immediately put on the cloak and stealthily sneak over.<br/><br/>He wanted to assist his master, but seeing a dozen enemies, all at the Divine Power Cultivation Level, one of whom was a legendary expert just like his master, he didn’t dare raise a hand.<br/><br/>So, he watched helplessly as his master Zhong Zilin was captured alive by the enemy.<br/><br/>He followed them anxiously all the way with the intention of saving his master, but all the while he found no opportunities to act.<br/><br/>All the way here, Zhong Yanxing was remarkably unspotted by the people of the Nether Sect.<br/><br/>Now, it looked like they had reached the enemy’s hideout.<br/><br/>Zhong Yanxing was anxious, wishing he could rush up and save his master.<br/><br/>Just as he was thinking, suddenly a line of black smoke drifted over sticking to the Cloak of Invisibility.<br/><br/>With a sizzle, this artifact corroded like it had been struck by a corrosive force, changed color and its invisibility ability was immediately destroyed,<br/><br/>Not good!<br/><br/>Zhong Yanxing was taken aback. He looked up and saw several people turning their heads. His limbs suddenly felt cold as he went blank in panic. He was done for!<br/><br/>These people were powerful, their mana incredibly strange, even his legendary master was captured alive by them. How could he even compare?<br/><br/>…<br/><br/>“Huh?”<br/><br/>The first person to notice something abnormal was Shen Li, the disciple with the highest cultivation level. He looked back and saw an additional man behind with Golden Body Cultivation Level.<br/><br/>One of the disciples beside him looked surprised and said, “How did an extra person appear?”<br/><br/>“A Golden Body Cultivation Level brat popped out of nowhere and we didn’t even realize it.”<br/><br/>“There’s something peculiar about that cloak he’s wearing. It must be a Magic Treasure.”<br/><br/>…<br/><br/>Among them, the disciple with the lowest cultivation level rubbed his hands together excitedly, “Big brother, leave him to me.”<br/><br/>Shen Li instructed “Don’t damage the cloak.”<br/><br/>He also noticed the uniqueness of the cloak and reminded them.<br/><br/>“Yes, brother.”<br/><br/>That disciple immediately took flight, smiling sinisterly. “Boy, you’re gonna make a great zombie.”<br/><br/>Just then, a Blade Intent descended from the sky, slicing this person in half.<br/><br/>Next, with a bang, a ball of red flame ignited from the wound, and in the blink of an eye, it burned him to ashes.<br/><br/>This sudden event was beyond anyone’s expectation.<br/><br/>“Little Brother . . .”<br/><br/>The group from Nether Sect was a mix of shock and fury.<br/><br/>Within the Nether Sect, the relations were not exactly harmonious, and internal arguments and fights were common. But seeing a disciple being killed invoked a sense of vengeance in them all.<br/><br/>…<br/><br/>“I lived?”<br/><br/>Zhong Yanxing, holding another artifact and ready for a desperate fight, saw the enemy already burned to ashes, and was both shocked and relieved.<br/><br/>Right after that, he heard a slightly familiar voice ringing in his ear, “Why are you here?”<br/><br/>Looking up, he saw a familiar silhouette. Joy surged in his heart as he blurted, “Elder Gu, my master has been captured by them. Save him!”<br/><br/>The person who saved his life as if a godsend, was none other than Gu Yang whom he had seen in the East Sea earlier.<br/><br/>This was a superpowered man who owned two high-rank magical beasts and was capable of slaying legends.<br/><br/>A boon from heaven indeed!<br/><br/>With him around, he was bound to save his Master.<br/><br/>You can only imagine how stirred up Zhong Yanxing’s emotions were.<br/><br/>…<br/><br/>“Brother Zhong?”<br/><br/>Gu Yang had just arrived and saw Zhong Yanxing was in danger, so he intervened, not expecting that even Zhong Zilin was captured, he was quite surprised.<br/><br/>That day at the vast sea, during his battle with Shen Yun, Zhong Zilin came to his aid. His power is not to be underestimated, much stronger than those of the Red Sun whom rely on external powers to boost their strength.<br/><br/>It was out of his expectations that Nether Sect could capture a legend tier expert.<br/><br/>Gu yang had encountered some Nether Sect members before, all were kill on sight, giving him a feeling they were quite weak.<br/><br/>Because of this, his impression of Nether Sect was a sect with big reputation but average power.<br/><br/>It looks like Nether Sect does have strong experts.<br/><br/>Able to capture an Unleaking Realm expert, such prowess is indeed worth taking seriously.<br/><br/>Gu Yang looks at the group from Nether Sect, only six were humans, the rest were undead.<br/><br/>The strongest one was a bald man, reaching the Unleaking Realm cultivation level. From their conversation earlier, he was their big brother but wasn’t one of the two masters.<br/><br/>That is to say, Nether Sect has three Unleaking Realm experts.<br/><br/>With this Sect, the decade-long dominance of the world does make sense.<br/><br/>…<br/><br/>“Gu Yang!”<br/><br/>Shen Li stared intently at the figure in front of him, gritting out these two words between clenched teeth, his eyes filled with murderous intent, feeling so real it was almost tangible.<br/><br/>Nether Sect had three disciples, all orphans from a young age who grew up depending on one another, as close as brothers.<br/><br/>Later, by a fortunate coincidence, they were taken in by the two masters of Nether Sect and embarked on the path of cultivation.<br/><br/>A few months ago, their junior brother, Ding Fei, was tasked with hunting down Gu Yang by his master and was then murdered.<br/><br/>To Shen Li, Ding Fei was closer to him than his own kin. Since then, he had sworn to tear Gu Yang to pieces.<br/><br/>If it weren’t for the critical phase his two masters were in their cultivation, he would have taken revenge on behalf of his brother long ago.<br/><br/>Delaying like this set him back a few months.<br/><br/>When his masters finally finished cultivating, he too benefited greatly, managing to break into the Unleaking Realm in one fell swoop.<br/><br/>When he was prepared to leave Valley of Dead Souls for revenge, he received the news, his nemesis had even killed Shen Yun.<br/><br/>Shen Yun was a millennia old experienced Unleaking Realm expert, Gu Yang could slaughter him, which shows his extremely powerful strength.<br/><br/>Shen Li was not blinded by hatred, he suppressed his desire for revenge and stayed in the Valley of Dead Souls to immerse himself in training.<br/><br/>Until he heard the news of an unknown Unleaking Realm expert appearing in Yuzhou, he thought of an idea.<br/><br/>If he could turn this Unleaking Realm expert into an undead, his chances of handling Gu Yang would increase.<br/><br/>So, he led several disciples into action.<br/><br/>He even brought along an Unleaking Realm undead given to him by his masters, and they finally captured the man after much difficulty.<br/><br/>Unleaking realm’s powerful Unleaking Bodies are quite problematic, to turn one into a demonic corpse, we must take them back to the Valley of Dead Souls.<br/><br/>Shen Li never expected that Gu Yang would show up in the Valley of Dead Souls at this time.<br/><br/>This is truly an opportunity sent from heaven.<br/><br/>The Valley of Dead Souls is his home ground, within it exists an infinite amount of evil energy. Here, his power is boundless, even if he encountered a Celestial Being, he would have the confidence to withdraw in one piece.<br/><br/>Gu Yang running over here is like digging his own grave.<br/><br/>“You would not take the heavenly road, but barge into hell without a door.”<br/><br/>Shen Li laughed crazily, the black demonic energy filled the surroundings, forming a cage and sealing all directions.<br/><br/>He sternly said, “Gu Yang, do you remember my junior, Ding Fei? Today, I will take your head to tribute to his heroic spirit.”<br/><br/>“Ding Fei?”<br/><br/>Upon hearing this name, Gu Yang had no impression, “Who?”<br/><br/>Shen Li’s complexion became extremely gloomy, “You…”<br/><br/>Gu Yang frowned, and a hammer suddenly appeared in his hand, which he smashed behind him.<br/><br/>A demonic corpse emerged from the black mist behind him, its long nails stabbing at the back of his head. Before it could get close, it was smashed by a hammer, its head collapsed, deformed beyond recognition.<br/><br/>The next moment, red flames ignited on its body, the Phoenix True Flame.<br/><br/>Soon, the demonic corpse was burnt to ashes.<br/><br/>…<br/><br/>Shen Li, who was facing him, had a twitch in his eyelid. This man’s power was more terrifying than he had expected.<br/><br/>That demonic corpse used to be a Sword Saint in its lifetime, almost unbeatable in Mana realm. It had been refined by the black mist in the Valley of Dead Souls for over a decade, its mortal body had become extremely solid, comparable to the Unleaking realm’s powerhouses.<br/><br/>Now, it was smashed by Gu Yang beyond recognition with one hammer.<br/><br/>Originally, such an injury was not a big deal, but his opponent’s mana is like the bane of the demonic corpses, rendering it and the demonic energy within its body into nothingness.<br/><br/>Finally, he understood why Ding Fei had died by this man’s hand.<br/><br/>This man is the great enemy of their Nether Sect.<br/><br/>Shen Li sneered, “Don’t be too proud…”<br/><br/>A Phoenix, its whole body bathed in flame, flew out from Gu Yang’s forehead, and the previously invincible demonic energy evaporated wherever it went.<br/><br/>“Divine beast Phoenix!”<br/><br/>Shen Li’s eyes narrowed, the flame on the Phoenix made him feel extremely uncomfortable. It even provoked a sense of fear in him.<br/><br/>This is the nemesis of the demonic energy.<br/><br/>Then, another divine beast flew out, this time a White Tiger. The aura of oppression on its body instantly locked onto him, giving him chills from its terrifying killing intent.<br/><br/>Following it, the third divine beast appeared, it looked like a dragon but it had a human face with eyes as bright as the sun.<br/><br/>Shen Li’s gaze met its eyes, and there was a blinding light in front of him. He couldn’t see anything, as if he had gone blind.<br/><br/>“Three divine beasts?”<br/><br/>He closed his eyes in pain, tears streaming down his cheeks. A sense of fear that he had never experienced before surged up in his heart.<br/><br/>Each of these divine beasts was more terrifying than the last.<br/><br/>The fellow disciples next to him also ended up like him, their eyes were startled, and they were unable to see anything. Each of their faces showed horror.<br/><br/>“Let’s fight!”<br/><br/>Shen Li realized the lethal threat, exerted his mana without reservation, regardless of the consequences.<br/><br/>The black mist in the Valley of Dead Souls increased tenfold instantly, concentrated around him, quickly forming a black giant.<br/><br/>At this time, he could no longer care about the Unleaking realm powerhouse he had captured.<br/><br/>Zhong Zilin is a seasoned man, he felt the pressure eased and mustered all his remaining strength to finally break free from the cocoon-like black mist.<br/><br/>“Master!”<br/><br/>Zhong Yanxing saw that he had finally escaped, and was overjoyed.<br/><br/>Zhong Zilin didn’t have time to speak, he saw an incredibly spectacular scene.<br/><br/>That giant White Tiger slapped its paw, a flash of white light appeared and the giant formed by demonic energy was instantly shattered.<br/><br/>Following that, the dragon-faced, humanoid divine beast, with its bright eyes like the sun, shot two golden rays and pierced through Shen Li’s body.<br/><br/>Finally, the Phoenix let out a clear cry, sprayed out flames, turned them into a sea of fire, and engulfed the people there.<br/><br/>Accompanied by screams, those involved in attacking him were burnt to death by the flames one by one.<br/><br/>Zhong Zilin felt as if he was in a dream.<br/><br/>He knew very well the strength of these people. Their mana could be called a bane for martial artists. Once he was touched by a bit of it, his Unleaking Body was almost broken. He could only use less than half of his full power. The defeat was very aggrieving.<br/><br/>Now, these people were easily killed by Gu Yang’s extraordinary magical beasts.<br/><br/>What he found even more incredible was that the Phoenix had risen two tiers since last time.<br/><br/>It had gone directly from a first-tier legend to a third-tier legend.<br/><br/>How long has it been?<br/><br/>The white tiger, which was probably the legendary divine beast White Tiger, was also a third-tier legend.<br/><br/>And that big guy with a human face and dragon body should be the Candle Dragon, a second-tier legend.<br/><br/>These are all divine beasts with great renown from ancient times.<br/><br/>In just a few months, Gu Yang’s powers had undergone earth-shattering changes.<br/><br/>At that time, if the Phoenix had had this kind of strength, it could have killed Shen Yun just by itself.<br/><br/>…<br/><br/>When the flames dissipated, it signified that the most powerful Unleaking realm powerhouse was also turned into ash.<br/><br/>The black mist around them also dissipated.<br/><br/>Zhong Zilin approached and deeply bowed, “Many thanks to Brother Gu for saving my life. In the future, if you need any help, Zhong will not refuse.”<br/><br/>Gu Yang helped him up, smiling, “Brother Zhong is too polite.”<br/><br/>“Why did Brother Gu come here?”<br/><br/>Zhong Zilin was not someone who would make a fuss about favors, he kept this kindness in his heart and asked him his purpose.<br/><br/>Gu Yang said solemnly, “The Nether Sect committed numerous atrocities, even turning martial artists into demonic corpses, it’s intolerable. Over the past decade or so, I don’t know how many Divine Power realm powerhouses fell victims to their hands. Today, I’m here to root out this malignant tumor.”<br/><br/>Of course, harvesting energy was just something that came with it.<br/><br/>He looked at the rows of prompts that popped up in front of him, and was quite satisfied in his heart.<br/><br/>Just now, he had obtained a total of three hundred points of energy, which he could use for three simulations.<br/><br/>Zhong Zilin, hearing this, could not help but salute with respect and say, “Zhong is willing to do my humble part.”<br/><br/>“That’s great, in a while Brother Zhong can keep watch outside, we must not let anyone slip through the net.”<br/><br/>“What a big mouth you have!”<br/><br/>Suddenly, in the valley, a woman’s voice was heard. The voice was sharp, like the scraping of metal, very unpleasant.<br/><br/>“I want to see who this ignorant person is, who dares to annihilate my Nether Sect!”<br/><br/>Upon feeling the changes in the valley, Zhong Zilin’s face turned pale, he cried out in surprise, “Half God?”<br/><br/>PS: Three thousand eight hundred words, it’s equivalent to one and a half chapters.\t\t\t\t\t\t</div>", "images": {}, "success": true}