{"id": 348, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132297.html", "title": "Chapter 348 - Chapter 348: Burning 348", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 348 - Chapter 348: Burning 348</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 348: Burning 348<br/><br/>During the flight to the Divine City, Gu Yang, out of caution, initiated a simulation.<br/><br/>[At the age of twenty-three, you’ve reached the second level of the Unleaking Realm. You set off to the Divine City, successfully securing the Human Emperor’s sword and taming the Unleaking Realm powerhouse who guards the sword.]<br/><br/>[Subsequently, you open up the passages to the All-embracing Celestial Realm and Yellow Springs Celestial Realm, leading Chu Xiyue and others to the Broad Cold Immortal Palace.]<br/><br/>[Half a year later, you leave the Broad Cold Immortal Palace for the Golden Court Celestial Realm.]<br/><br/>[Another half a year later, you help the Lord of the Golden Court Country eradicate the other two country lords. The Lord of the Golden Court combines the Golden Emperor’s Jade Booklet and starts a closed-door cultivation.]<br/><br/>[Then, several Celestial Being Realm chimeras invade the Golden Court Celestial Realm, turning this world into a ghost realm. You are hunted down by several Celestial Being chimeras, escape is impossible, and you die on the spot at the age of twenty-five.]<br/><br/>Here we go again.<br/><br/>Whenever his cultivation level blossoms, he always encounters all kinds of accidents.<br/><br/>Those Celestial Being Realm chimeras absurdly breached the Golden Court Celestial Realm and insisted on chasing him down.<br/><br/>Gu Yang had already acclimated to this pattern—it was the butterfly effect in action.<br/><br/>However, he had a hunch that those chimeras were likely drawn in by the Human Emperor’s Sword.<br/><br/>The Human Emperor’s Sword was the nemesis of Red Ming. To some extent, the chimeras and Red Ming had some similarities, probably they shared the same weakness.<br/><br/>[Simulation ends, you can retain one of the following items.]<br/><br/>[First, your martial arts realm at the age of twenty-five.]<br/><br/>[Second, your martial arts experience at the age of twenty-five.]<br/><br/>[Third, your wisdom in life at the age of twenty-five.]<br/><br/>Gu Yang chose the first option.<br/><br/>His condition barely changed.<br/><br/>Only two years had passed, and his cultivation level hadn’t significantly changed, same for the “Nine Heavens Divine Method”.<br/><br/>At his level, years of harsh cultivation or drops of divine beast essence blood have a negligible effect on enhancing his cultivation level.<br/><br/>“The good news is that there won’t be any danger during the trip to fetch the Human Emperor’s Sword. I can even tame an Unleaking Realm fighter.”<br/><br/>Gu Yang felt relieved.<br/><br/>After all, his original plan was to attend the Yaochi Conference, he didn’t need to evade the pursuit of Jade Dew Divine Soldier, and therefore, he didn’t need the channels of Yellow Springs Celestial Realm to open.<br/><br/>So he had no need to worry that a bunch of Celestial Beings would come after him.<br/><br/>At this moment, his speed was even faster than before.<br/><br/>Two hours later, the Divine City was within sight.<br/><br/>…<br/><br/>Since time immemorial, the Heavenly Altar has been a place for the emperor to offer sacrifices to heaven. From the Xia Dynasty, to the Qin Dynasty, and now the Great Zhou, it has always been so.<br/><br/>This place is one of the forbidden lands of the Divine City, heavily guarded.<br/><br/>Feather Forest Army, the closest military force to the royal family and led by a First Rank powerhouse, guard here. Commoners can’t get close at all.<br/><br/>But to a warrior like Gu Yang, it wasn’t a problem, he landed directly on the square of the Heavenly Altar, unnoticed by the nearby guards.<br/><br/>The space where the Human Emperor’s Sword was located was right here. For a thousand years, no one discovered it.<br/><br/>This was his first time visiting the Heavenly Altar, and it was somewhat different from his imagination—in the center was an enormous altar. Its area was thousands of square meters, comparable to a football field, it was vast in structure.<br/><br/>The altar was situated on a high platform. The stairway leading to the platform was built of a kind of stone resembling white jade.<br/><br/>Atop the altar was a gigantic stone pillar, of which only a less than one-meter part was left at the bottom, appearing to have been severed, the cut was flat and neat. The pillar was cylindrical with a diameter of nearly a hundred meters.<br/><br/>Looking at the cut, this pillar was monolithic, not stacked with stones.<br/><br/>It was unimaginable how this gigantic pillar was brought here.<br/><br/>Historically, this Heavenly Altar has existed since the ancient times, most likely the work of a powerful immortal cultivator.<br/><br/>In the center of the altar, a huge black cauldron was placed. Unknown for how long it had been there, but its profound aura seemed to have merged with the altar.<br/><br/>The cauldron was one of the Nine Divine Cauldrons, the most important Universe Cauldron, placed here for a thousand years.<br/><br/>Seeing this grand construction, Gu Yang couldn’t help but admire it.<br/><br/>The Heavenly Altar, the city walls and the imperial palace of the Divine City were indomitable.<br/><br/>It was said that not even a Celestial Being could damage them.<br/><br/>Standing before the altar, Gu Yang felt a great constraint on his Divine Sense.<br/><br/>It felt like inside the imperial palace, even his internal mana was affected to some extent.<br/><br/>“No wonder the Xia Emperor chose to hide the Human Emperor’s Sword here.”<br/><br/>Gu Yang seemed to understand that there was an interference ancestral field in the city that prevented the existence of the space housing the sword from being inadvertently discovered.<br/><br/>Similar to his current state, while standing in the middle of the altar, he sensed nothing unusual.<br/><br/>Gu Yang was recalling the way to access the secret realm from the treasure map. He raised his head to observe the stars.<br/><br/>Though it was daytime now, with his vision, he could clearly see any star in the sky.<br/><br/>Soon, he determined the location based on the positions of the stars, drew out the Phoenix Feather Knife, and slashed, shouting, “Open!”<br/><br/>The Blade Intent hit a part of the void, encountered an invisible obstacle, then a spatial rift appeared, quickly forming a passageway.<br/><br/>The Secret Realm was vast, at a glance, mountains of gold, silver, and weapons could be seen.<br/><br/>The most noticeable was a man in pure silver armor. He was robust, standing tall like a tower, kneeling on one knee, and bowing his head motionless, appearing like a sculpture.<br/><br/>In front of the man, a giant sword was planted. A primitive and antiquated aura filled the air.<br/><br/>“Is this the Human Emperor’s Sword?”<br/><br/>Gu Yang looked at the sword and found that it didn’t really resemble an emperor’s sword. It completely lacked the supremely regal aura of imperial power.<br/><br/>He found it hard to imagine how a majestic emperor, who carried such a crude giant sword, looked like.<br/><br/>However, it wasn’t surprising. At that time, humans weren’t the sovereigns of this world. When the Human Emperor crafted this sword, the main concern was practicality.<br/><br/>A glance at the design of this giant sword and the crimson color of the blood grooves, it was clear that this was undoubtedly a Great Killer.<br/><br/>…<br/><br/>……<br/><br/>Meanwhile, the Lord of the State was hurrying toward the Altar of Heavenly Gods.<br/><br/>He appeared serious, knowing that a fierce battle was imminent, yet felt no chance of victory in his heart.<br/><br/>He had possessed the sword of the state for over a hundred years, and no event or person had ever elicited such a strong reaction from it.<br/><br/>The most severe response came when two emperors was murdered, but it paled in comparison to this time.<br/><br/>That person was no ordinary being.<br/><br/>Even though he had managed to break through to the Unleaking Realm, significantly enhancing his strength, he had no confidence.<br/><br/>However, he had no choice.<br/><br/>Ever since he unsheathed the sword of the state, his destiny, this sword, and the fate of Great Zhou had been tied tightly together. They thrived together, and perished together.<br/><br/>If one day Great Zhou was to fall, and a new dynasty to rise, the sword of the state would suffer devastating injuries, requiring hundreds of years to recover. And he, he would have no way to escape it.<br/><br/>Even if the sword of the state commanded him to kill a Celestial Being, he would unhesitatingly obey.<br/><br/>Suddenly, the sword in his hands violently trembled and broke free from his grip, flying out on its own and illuminating the sky.<br/><br/>“This——”<br/><br/>The Lord of the State was astounded and hurriedly gave chase.<br/><br/>At the same time, he sensed a primordial aura, stirring a sense of reverence in him.<br/><br/>“The Sword of the Human Emperor…?”<br/><br/>His mind thundered, finally understanding why the sword of the state had suddenly broken free.<br/><br/>The sword of the state was an unparalleled divine weapon, created in imitation of the Sword of the Human Emperor by the Qin Dynasty, was experiencing such a violent reaction due to the presence of the Human Emperor’s Sword.<br/><br/>The Sword of the Human Emperor!<br/><br/>A wave of ecstasy surged up the Lord of the State’s face.<br/><br/>The appearance of the Sword of the Human Emperor was very fortuitous for the Great Zhou.<br/><br/>This sword was a divine weapon forged in the early dawn of history by the Human Emperor.<br/><br/>The Human Emperor, with this sword, had slain countless foreign races, establishing the Human Race’s dominant position in this world.<br/><br/>When the Human Emperor was elected to be the shared ruler by the Human Race, the Sword of the Human Emperor shouldered the entire Human Race’s destiny, possessing an incredible power, slaying gods or Buddha that stood in its way.<br/><br/>Remember, the sword of the state only bore the destiny of the Zhou Dynasty.<br/><br/>But the Sword of the Human Emperor bore the destiny of the entire Human Race, the two weren’t on the same scale at all.<br/><br/>With the Sword of the Human Emperor, the Great Zhou would have more than enough confidence to face the coming crisis.<br/><br/>“The direction it’s heading… is the Altar of Heavenly Gods, this is bad——”<br/><br/>The countenance of the Lord of the State darkened as he figured out the location of the Sword of the Human Emperor.<br/><br/>The person the sword of the state wanted to kill was there as well.<br/><br/>If the Sword of the Human Emperor ends up in the hands of that person, the consequences would be catastrophic.<br/><br/>Realizing this, he felt a sense of burning urgency, taking flight towards the Altar of Heavenly Gods at the utmost speed.<br/><br/>…<br/><br/>A moment later, he arrived at the Altar of Heavenly Gods.<br/><br/>By this time, the Feather Forest Army guarding the Alter of Heavenly Gods had already been alerted. But the altar was covered by a force, even the commander with First Rank cultivation could not approach, let alone ordinary soldiers.<br/><br/>Their only choice was to notify the imperial palace of the alter’s abnormal state as quickly as possible.<br/><br/>“It’s the Lord of the State!”<br/><br/>At this time, the commander noticed a ray of purple light soar in, following a figure, who was none other than the Lord of the State, his heart swelled with joy.<br/><br/>The Lord of the State, however, did not have time to acknowledge him; his body was already flying into the interior of the altar.<br/><br/>Inside the alter, an entrance to a Secret Realm had appeared.<br/><br/>It turned out that the Sword of the Human Emperor had been hidden in a Secret Realm within the Altar of Heavenly Gods.<br/><br/>At the entrance, a figure was standing.<br/><br/>“Why him?”<br/><br/>The Lord of the State was shocked. Although he had never seen this person before, a deep loathing surged up in his heart at the sight of him.<br/><br/>He immediately knew that this was the murderer who killed the emperor, Gu Yang!<br/><br/>The person whom the sword of the state was hell-bent on killing was actually Gu Yang?<br/><br/>Whoosh——<br/><br/>At that moment, the sword of the state, emanating an intense purple light, shoots towards Gu Yang with murderous intent.<br/><br/>He turned his head to look, then raised the knife in his hand.<br/><br/>With a loud crash, the sword of the state was sent flying, its purple aura diminishing by half.<br/><br/>Unleaking Realm!<br/><br/>The Lord of the State was dumbfounded, stunned beyond words at this sight.<br/><br/>This youth had reached the Unleaking Realm so quickly?<br/><br/>The sword of the state missed its target, it resonated with a deep hum, seemly understanding its inability to kill the opponent, it changed its course and flew back to its master’s hand.<br/><br/>Boom!<br/><br/>The Lord of the State felt an indescribable surge of power flowing into him, elevating his strength.<br/><br/>He was deeply distressed.<br/><br/>This was the destiny that the sword of the state had accumulated over five hundred years of serving the Great Zhou, once ignited, the sword of the state would become a simple iron rod.<br/><br/>The sword of the state was intent on killing Gu Yang, regardless of the consequences.<br/><br/>This intelligent divine weapon was so resolute in its killing intent, it seemed to be in a kill-or-be-killed situation.<br/><br/>The Lord of the State, receiving the empowerment of the destiny of the sword of the state, his power kept escalating, quickly surpassing the Unleaking Realm.<br/><br/>At that moment, he felt as if he could do anything.<br/><br/>His heart was devoid of joy or sorrow, from his mouth came a single word, “Die!”\t\t\t\t\t\t</div>", "images": {}, "success": true}