{"id": 353, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132308.html", "title": "Chapter 353 - Chapter 353: This Person Is Manageable", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 353 - Chapter 353: This Person Is Manageable</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 353: This person is manageable<br/><br/>Before he knew it, evening had arrived.<br/><br/>Gu Yang now had a rough understanding of the situation in the West Bank Continent, he also found out who the biggest enemy of the Elf Clan was, and which forces in the vicinity were hostile and friendly toward them.<br/><br/>Finally, he asked the most crucial question, “What is the method you mentioned to get to the West Bank Continent in an extremely short period of time?”<br/><br/>Eve pointed to the mark on her forehead, saying, “This is an artifact known as the Crescent Ring that my mother placed within me when I was born. It can teleport over a great distance and can take us back directly to the Misty Forest.”<br/><br/>Gu Yang had not expected that she had such a trump card.<br/><br/>That artifact on her forehead, capable of spanning the distance between two continents, was no simple thing.<br/><br/>The West Bank Continent was not like the Reichin Continent.<br/><br/>The Reichin Continent was actually a pocket world, the ancient Penglai pocket world.<br/><br/>The West Bank Continent was a genuine piece of land existing in this world. Zhong Zilin once lived on that exotic continent for hundreds of years.<br/><br/>There was an even more important question.<br/><br/>Gu Yang asked, “Once we get to the West Bank Continent, can we make it back within ten days?”<br/><br/>“Yes.” Eve replied, “The Crescent Ring still has two opportunities left to perform a teleportation.”<br/><br/>As she spoke, she looked up at the sky, adding, “However, the Crescent Ring can only use its teleportation ability when the moon appears in the sky.”<br/><br/>Although it was night, the moon had not yet risen.<br/><br/>Gu Yang nodded his understanding, he didn’t say anything more.<br/><br/>Then, he quietly accessed the system and initiated a simulation.<br/><br/>[At the age of twenty-three, you have reached the second level of the Unleaking Realm…]<br/><br/>[You followed Eve and used a long-distance teleportation array to go to the West Bank Continent. You helped the Elf Clan find the root of the Mother Tree’s problem but were conspired against and thrown into the abyss…]<br/><br/>[In the abyss, you discovered the power related to Chi Ming Heaven and were besieged by countless soul monsters. Half a month later, you were drained to death. You died at the age of twenty-three.]<br/><br/>“Damn it.”<br/><br/>Having seen the content of the simulation, Gu Yang blurted out.<br/><br/>He never expected to encounter a power connected to Chi Ming Heaven in the West Bank Continent. Isn’t its reach too far?<br/><br/>What the hell.<br/><br/>In that case, the abyss of the West Bank Continent might just be another name for Chi Ming Heaven.<br/><br/>Even if they weren’t of the same world, they were highly related.<br/><br/>[Simulation ended, you can choose to keep one of the following.]<br/><br/>[One, Martial Arts Realm at the age of twenty-three.]<br/><br/>[Two, Martial Arts experience at the age of twenty-three.]<br/><br/>[Three, life wisdom at the age of twenty-three.]<br/><br/>“I choose Two.”<br/><br/>Gu Yang was curious to see who was the one that set him up.<br/><br/>Suddenly, several memories appeared in his mind. Most of them were about the battles with the soul monsters.<br/><br/>Among them, memories of being plotted against were only a few scenes.<br/><br/>Even so, he saw the face of the person who betrayed him.<br/><br/>Surprisingly, it was an elf with golden hair and black pupils, holding a black wand. The elf took advantage of him checking the Mother Tree, suddenly opened a space portal, and cast a Disintegration spell on him, stripping him naked on the spot.<br/><br/>By the time he reacted, he had already been blasted into the space portal and couldn’t escape.<br/><br/>Gu Yang glanced at Eve sitting next to him.<br/><br/>Surely the Elf Clan hasn’t been infiltrated, has it?<br/><br/>However, he did not mention this matter since Eve certainly wouldn’t believe something that had yet to occur.<br/><br/>He initiated another simulation.<br/><br/>[…As you were examining the Mother Tree, an elf suddenly made a move to kill you. Fortunately, you were prepared in advance, and the Disintegration spell tore apart the image left by Eve.]<br/><br/>[Then, another elf summoned more than ten Dark Dragons and a great battle unfolded in front of the Mother Tree.]<br/><br/>[With your help, the elves were victorious. Finally, when the power of a Half God descended, the Elf High Priest sacrificed himself to block the fatal blow. Just before dying, he handed over to you the Wand that symbolizes divine power.]<br/><br/>[Afterward, you led the elven warriors on various attacks, killing several legendary strongmen from the Half-Beastman and Human races.]<br/><br/>[On the ninth day, you returned to the Divine State Continent with Eve, went to the edge of the North Sea to attend the Yaochi Conference. When entering the Yaochi Immortal Palace, you triggered a prohibition and died on the spot. You died at the age of twenty-three.]<br/><br/>Not bad!<br/><br/>After finishing reading, Gu Yang was quite satisfied.<br/><br/>This is the advantage of knowing the plot in advance. As long as the difference in power is not too vast, the opponent’s plot can be foiled.<br/><br/>Avoiding the hidden attack made everything go smoothly.<br/><br/>The only thing that surprised him was that the Grand Priest of the Elves was willing to sacrifice himself to save him, blocking the fatal blow for him.<br/><br/>This Elf Grand Priest was reliable, indeed a reliable ally in times of need.<br/><br/>[Simulation ends…]<br/><br/>[…]<br/><br/>This time, Gu Yang chose one.<br/><br/>Then, he felt a significant increase in the power of Taiyin Youying, as if he had refined a dozen drops of essence blood all at once.<br/><br/>“Huh? What’s going on?”<br/><br/>He found it strange when Eve said, “Master, the moon has risen.”<br/><br/>He put this matter aside for now and stood up saying, “Let’s go.”<br/><br/>Time was running short. They needed to be fast.<br/><br/>Eve took his hand and said, “It has begun.” Then, she closed her eyes, and the mark on her forehead lit up, seemingly connected to the moonlight in the sky.<br/><br/>The crescent moon in the sky suddenly brightened, dropping a beam of light directly into her forehead.<br/><br/>A dazzling light shone.<br/><br/>…<br/><br/>……<br/><br/>Deep in the Misty Forest, there was an Elven Kingdom.<br/><br/>The entire community of elves was built around the central Mother Tree. The closer one lived to the Mother Tree, the higher their status implied.<br/><br/>The core members of the Elven Clan, including the Elf Queen and Grand Priest, usually lived here.<br/><br/>At this moment, there were two humans living in a tree house closest to the Mother Tree.<br/><br/>Elves had always despised humans because, in legend, elves were once the masters of the West Bank Continent, but were later defeated by humans and retreated to this misty forest.<br/><br/>Additionally, some human nobles fancied elven slaves, and there were always adventurers capturing Elves indiscriminately in the lure of hefty rewards.<br/><br/>It would be strange if elves could hold a favorable view of humans.<br/><br/>These two humans living here had evidently remarkable identities and were distinguished guests of the Elf Clan.<br/><br/>Both humans, an older and a younger one, were wearing mage robes. The older one wore a white robe, and the younger one wore a blue one, with different patterns embroidered on their chests.<br/><br/>For a Mage, the requirement for clothing was very strict. One’s strength decided the clothing they were entitled to wear.<br/><br/>Three feathers embroidered with golden thread on the chest of the older man in the white robe indicated he was a third-order legendary Mage.<br/><br/>Such strength made him one of the top characters in the entire West Bank Continent, and he would be treated as a distinguished guest wherever he went.<br/><br/>His name was Glendon, known as the Sage of Wind.<br/><br/>The term ‘Sage’ was an honorary address in the West Bank Continent, and only those closest to Half-god status earned this title.<br/><br/>The Sage of the Wind had been active on the West Bank Continent for more than a thousand years. He was a lawful neutral legendary Mage who never intervened in the conflicts of the continent.<br/><br/>The younger man in the gray robe was called Henry, his student, who was accompanying him on this journey for practice.<br/><br/>Henry curiously asked, “Master, what exactly is wrong with that Elf Mother Tree?”<br/><br/>The Sage of the Wind, staring at a rose on the window and lost in thought, replied offhandedly, “What do you think?”<br/><br/>Feeling stimulated, Henry realized this was his teacher’s examination. So, he voiced his answer, “I think it must have been corrupted by some kind of evil and chaotic energy.”<br/><br/>Without looking at him, the Sage of the Wind said, “Even you can see that. Naturally, the Elf Queen and High Priest also know the problem. But they are helpless. This time, I have no idea what formidable existence has offended the Elf Clan.”<br/><br/>“Even you can’t figure it out, master?”<br/><br/>“Pack up, we are leaving tonight-”<br/><br/>While the Sage of the Wind was talking, he suddenly sensed a strong wave and was surprised, “What is that?”<br/><br/>“Long-distance teleportation?”<br/><br/>He soon identified it and was slightly shocked. The Elf Clan could actually carry out long-distance teleportation. Indeed, this ancient race had profound depths.<br/><br/>Immediately, he felt a strange chill. He knew he was being watched by a terrifying presence and his back was instantly soaked with cold sweat.\t\t\t\t\t\t</div>", "images": {}, "success": true}