{"id": 359, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132320.html", "title": "Chapter 359 - Chapter 359: 359 Harvest", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 359 - Chapter 359: 359 Harvest</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 359: 359 Harvest<br/><br/>[Received 500 energy points, current balance is 2530.]<br/><br/>[Received 500 energy points,…]<br/><br/>…<br/><br/>After Gu Yang dispatched the last dark giant dragon, his energy balance reached 4530.<br/><br/>Fifteen giant dragons delivered a full 4000 points of energy.<br/><br/>The rewards of this alone had made his endeavor worthwhile.<br/><br/>Oh, there were two more.<br/><br/>He turned his head to look at the two elves who had betrayed their clan, Anna and Kelly<br/><br/>At this time, they had put up a massive shield. The other elf legends were attacking this shield, and although the various magic spells bombarded the shield, they could not shake it.<br/><br/>The legends of the elves were seriously injured, with only a few who could still use their legendary spells. For a while, they were unable to deal with these two traitors.<br/><br/>Inside the shield, Anna and Kelly were chanting a spell while a thick black fog continuously emanated from them.<br/><br/>Gu Yang recalled the Celestial Being who appeared at the last moment in the previous simulation and his eyes became more serious.<br/><br/>Without hesitation, he drew out the Sword of the Human Emperor from the Beast-taming Space with all his strength and launched it.<br/><br/>“Go!”<br/><br/>Whizz.<br/><br/>The Sword of the Human Emperor turned into a golden streak of light, crossed over nearly ten kilometers in an instant, and pierced through the shield in a fraction of breath.<br/><br/>Chi!<br/><br/>The two elves who were still in the process of chanting their spells had no time to dodge and were directly impaled by the Sword of the Human Emperor. The overwhelming power instantly mangled them into a ball of flesh.<br/><br/>The half-completed magic spells abruptly ran out of control; the congregated elemental power exploded, erasing any trace of them from the world.<br/><br/>[Received 200 energy points, current balance is 4730.]<br/><br/>[Received 500 energy points, current balance is 5230.]<br/><br/>Seeing these two prompts, Gu Yang finally relaxed.<br/><br/>Whizz!<br/><br/>The thrown Sword of the Human Emperor quickly flew back on its own, landing in his hand and was stored back into the Beast-taming Space by him.<br/><br/>In a critical moment, it’s always this treasure of the Human Race that comes in handy.<br/><br/>Purely on the basis of its blade, it is enough to break through the magic and shields of Immortal Rank and below.<br/><br/>Just as Gu Yang was thinking this, he suddenly sensed something wrong. A force that made the soul tremble diffused throughout the sky.<br/><br/>Celestial Being!<br/><br/>How can this be?<br/><br/>He was somewhat surprised. Weren’t the spells of those two elves disrupted by him?<br/><br/>Could it be that the Celestial Being was not summoned by them?<br/><br/>…<br/><br/>“Dragon’s might!”<br/><br/>“It’s an ancient giant dragon!”<br/><br/>This soul-shaking fluctuation was something everyone in the West Bank Continent was aware of.<br/><br/>That was Dragon’s might.<br/><br/>Such terrifying Dragon’s might could only emanate from an ancient giant dragon among the dragon race, a being comparable to a Half God.<br/><br/>All elves were frightened, their faces turn pale. The ten-odd dark giant dragons were formidable, but they were of the legendary rank. Had they not been ambushed, they might not have lost.<br/><br/>But what would soon appear was an ancient giant dragon, a Half God-level being.<br/><br/>If the Elf Mother Tree were intact, the enchanted lock was perfect, and many elf legends were unharmed, they could have tangled with the Half God for a while.<br/><br/>Who could resist the ancient giant dragon under the present circumstances?<br/><br/>“Run quickly!”<br/><br/>The grand elf priest yelled.<br/><br/>Why did the ancient giant dragon cross space to come here?<br/><br/>It was precisely because Gu Yan had killed too many dark giant dragons, a total of fifteen giant dragons, after all.<br/><br/>Although the dragon race does not acknowledge the dark giant dragons as the same race, they are indeed dragons, and their bloodline cannot be denied.<br/><br/>Since ancient times, every dragon slayer has had a bad end. There has always been a legend that a person who kills a giant dragon will be cursed by the dragon clan.<br/><br/>Now, Gu Yang killed fifteen giant dragons in one fell swoop.<br/><br/>How many dragons are there in the entire dragon clan? He had butchered fifteen in one go. Even though it was a dark giant dragon, it would still be considered as a provocation to the dragon clan.<br/><br/>When a dragon of the dragon race falls, it forms a Dragon Slaughter, which every nearby giant dragon can sense.<br/><br/>The Dragon Slaughter formed by the simultaneous death of fifteen dark giant dragons could probably be sensed by all the dragons in the West Bank Continent.<br/><br/>Therefore, it’s not surprising that it attracted an ancient giant dragon.<br/><br/>It is here to take revenge.<br/><br/>Gu Yang is in danger!<br/><br/>…<br/><br/>“Augusta!”<br/><br/>The Sage of the Wind uttered the name as he felt the terrifying Dragon’s might from the sky.<br/><br/>This is troublesome.<br/><br/>Augusta is a bronze dragon, an entity that has existed for a longer time than the vast majority of nations on the continent<br/><br/>Ever since it became an ancient dragon, it has been in a deep sleep to resist the erosion of time.<br/><br/>When he was younger, he had an interaction with this oldest entity of the dragon clan.<br/><br/>This bronze dragon has a temper that is gentler than most of the dragon clan. But one thing is certain, it is very protective of its own, and seeing the dragons suffer, it would act like a mother dragon protecting her calves, standing up for its race.<br/><br/>Now, it has discovered that fifteen giant dragons have been slaughtered and is undoubtedly enraged.<br/><br/>The human from the foreign continent is doomed.<br/><br/>Augusta is an ancient dragon, equivalent to a Half God. Not even six high-ranking magical beasts can stop it.<br/><br/>Between a Half God and legends, there lies a divide that is hard to cross.<br/><br/>However, the Sage of the Wind isn’t worried that the Phoenix would die from this.<br/><br/>The Phoenix has another name, the Undying Bird. Even Gods can’t kill it thoroughly. After its death, it would quickly be reborn from the ashes.<br/><br/>This might be his opportunity.<br/><br/>…<br/><br/>Celestial Being?<br/><br/>Gu Yang was not afraid. The Elf King’s Court had magical locks that obstructed the space.<br/><br/>Just because Akimichi could break open the space, sending over a dozen of Dark Dragons, didn’t mean others could do the same.<br/><br/>In the sky, a terrifying force was desperately trying to break open the space to get through, but it was failing.<br/><br/>At this moment, the Elf Queen was giving her all and using the power of the magical locks to seal the space.<br/><br/>The magical lock of the Elf King’s Court was arranged by a half-god. If it could be easily breached by others, the Elf Clan could have been wiped out by humans long ago.<br/><br/>Half-gods were extremely rare, but there were still several among humans.<br/><br/>Although the Elf Queen had her selfish thoughts, she was not ambiguous at this moment.<br/><br/>She knew that Gu Yang might be the only hope to cure the Mother Tree and could not let him be killed by that ancient dragon.<br/><br/>In the sky, in a distant place, a wrathful roar was heard when the ancient dragon failed to break open the space. A terrifying dragon breath finally punctured the space.<br/><br/>When the dragon breath broke out, everyone felt an overwhelming force, they all felt an urge to kneel and repent.<br/><br/>This was divine power!<br/><br/>Divine power is supreme and sacrosanct for common people.<br/><br/>Gu Yang faced this impending power and unwaveringly took out the Human Emperor Sword.<br/><br/>With the Human Emperor Sword in his hand, he did not feel fear. Instead, he leaped up and slashed at this supreme power.<br/><br/>“Break for me!”<br/><br/>The first move of Zhanxuan Swordsmanship, Xuan Yuan!<br/><br/>The Human Emperor Sword seemed to sense the crisis, emanating a golden light. A power similar yet completely different from the divine power erupted.<br/><br/>With this sword, the divine power was instantly shattered, disappearing without a trace.<br/><br/>In the sky, a resentful roar echoed as the space closed, cutting off the ancient dragon completely.<br/><br/>The crisis was resolved.<br/><br/>Gu Yang looked at the Human Emperor Sword in his hand, somewhat surprised.<br/><br/>He did not expect that it would take initiatives to help.<br/><br/>He said, “Thanks.”<br/><br/>There was no response from the Human Emperor Sword.<br/><br/>He didn’t care. He put the Human Emperor Sword back into the Beast-taming Space.<br/><br/>For the first time, he confronted the power of a celestial being without being overpowered.<br/><br/>It was a moment to remember.<br/><br/>Suddenly, Gu Yang felt several eyes on him. When he turned around, he saw a dozen survivors from the Elf Clan kneeling on the ground, paying him their respects as the “Son of God.”<br/><br/>Son of God?<br/><br/>I knew it, no matter how much I deny it, they will still assign me another identity.<br/><br/>Gu Yang was already familiar with this sort of situation. He said, “Rise.”<br/><br/>If they really think they can freeload just by bowing and calling me ‘Son of God’, they are too naive.<br/><br/>…<br/><br/>……<br/><br/>Next, Gu Yang set about removing the foreign power from the Mother Tree.<br/><br/>It wasn’t a difficult task for him.<br/><br/>This time, there were no more hitches.<br/><br/>It seemed that there were only two moles that Akimichi had laid within the Elf Clan.<br/><br/>After the foreign energy in over a dozen places had been cleared, the Mother Tree began to exude incredible vitality. The withered leaves fell one after the other, exposing the tender, green parts.<br/><br/>Although the trunk was full of large holes, and one-third of the leaves had fallen, every Elf could feel that the Mother Tree was reborn.<br/><br/>All the Elves present were moved to tears.<br/><br/>“Huh?”<br/><br/>Looking at the Mother Tree, Gu Yang felt a familiarity for some reason.<br/><br/>Where did he get this feeling from?<br/><br/>Upon pondering, he suddenly fetched a pot from the Beast-taming Space. It was the Wood God Ding, one of the Nine God Dings. Inside it, there was a stick sprouting a bud.<br/><br/>He got this stick from the Water Moon Fairyland. It was an eerie black stick that originally belonged to one of the disciples of No-Worries Sage on the No-Worries Mountain.<br/><br/>Later, he placed the stick in Wood God Ding, and the poisonous gas on it naturally dissipated, revealing its original form—just a stick. And now it had begun sprouting.<br/><br/>The aura of this stick was almost identical to the Mother Tree’s.<br/><br/>“Is this——”<br/><br/>Suddenly, the Elf Queen standing next to him noticed the stick, her voice trembling with excitement, “Another Mother Tree?”<br/><br/>There are two Mother Trees?<br/><br/>Gu Yang was somewhat curious. For him, this thing was useless, and he didn’t have time to wait for it to grow. So he took out the stick and said, “It’s yours.”<br/><br/>The Elf Queen tremblingly took it from him. Tremendous excitement could be seen on her face. The Elves around her were also extremely excited as if they were seeing something precious.<br/><br/>Then the Elf Queen buried one end of the stick in the ground and took out a golden cup from nowhere. She dropped a drop of green liquid into the soil.<br/><br/>Something miraculous happened. The stick instantly grew taller by a margin, even sprouting leaves and becoming a sapling.<br/><br/>The Elf Queen kept taking out the green liquid from the golden cup, and each drop caused the sapling to grow taller.<br/><br/>Soon, the sapling grew to over ten meters high, with a trunk as thick as two people could hug, and a massive crown covering tens of meters.<br/><br/>It was hard to believe it was just over a meter-long stick a moment ago.<br/><br/>Gu Yang marveled, “The Elves truly do have their own unique capabilities.”<br/><br/>The tree did look similar to the Mother Tree.<br/><br/>Having an additional Mother Tree meant that the birth rate of the Elf Clan could double. Hence, their excitement is unsurprising.<br/><br/>Just then, he saw an Elf come up to the tree, pressed its forehead against the tree trunk, and closed its eyes, establishing some connection with the tree through her mental power.<br/><br/>Moments later, a pure white fruit appeared on the tree. Within a dozen seconds, it expanded like a blown balloon to the size of a watermelon, and then fell off by itself, landing in the arms of the Elf beneath the tree.<br/><br/>The fruit split open, revealing a baby inside.<br/><br/>I see, this is how Elves reproduce.<br/><br/>Gu Yang was startled. He had just witnessed the process of the Elves ‘giving birth’ – it was an enlightening experience.<br/><br/>It was incredibly efficient.<br/><br/>As he was thinking, he noticed something strange. Looking closer, he saw that the baby was a boy.<br/><br/>Wasn’t it said that the Elf Clan only had females and no males?<br/><br/>Could it be…<br/><br/>He looked up at the tree, “Did I bring a ‘male’ Mother Tree to the Elves?”\t\t\t\t\t\t</div>", "images": {}, "success": true}