{"id": 354, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132310.html", "title": "Chapter 354 - Chapter 354: 354 God’S Favorite", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 354 - Chapter 354: 354 God’S Favorite</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 354: 354 God’s Favorite<br/><br/>Within the Elven kingdom, apart from the Elven Mother Tree, the tallest and largest tree housed the Elven Royal Court.<br/><br/>In the council hall of the royal court, Elf Queen Hilarya and the Chief Priest Regina were standing before a window, worriedly watching the Elven Mother Tree not far off.<br/><br/>The leaves at the top of the Mother Tree were turning yellow over a large area.<br/><br/>This situation started two months ago on a small scale.<br/><br/>In the course of those two months, the situation had grown increasingly grave, with the yellow leaves spreading like a virus to surrounding areas. Now, a third of the tree’s leaves had turned yellow before falling off.<br/><br/>Those bare branches left behind had also dried up, devoid of vitality.<br/><br/>The worsening situation had left the entire Elven upper echelons worried sick, yet they were helpless.<br/><br/>Some days ago, they managed to invite the Sage of the Wind, one of the most famous legendary mages on the West Bank Continent but he too was unable to help.<br/><br/>As the leaders of the Elf Clan, Elf Queen Hilarya and Chief Priest Regina could only watch, helpless, as the Elven Mother Tree wilted day by day.<br/><br/>Now, their only hope rested on Gress and Eve from the Divine State Continent, who might be able to bring back the Elven Mother Tree’s trunk successfully.<br/><br/>Only with that piece of trunk would they be able to save the Mother Tree.<br/><br/>The Elf Queen thought of her daughter, her eyes tinged with even more worry, “I wonder if Gress and Eve have arrived?”<br/><br/>Chief Priest Regina said, “Half a month ago, I conducted a divination. The results showed that everything was going smoothly.”<br/><br/>“I hope so.”<br/><br/>Queen Hilarya mumbled.<br/><br/>Over these days, she had gone through a great deal of ancient notes left behind by wise elven sages. They included records about that distant Eastern continent.<br/><br/>In ancient times, during the era of the Elven Empire, there was communication and interaction between the West Bank Continent and the Divine State Continent.<br/><br/>According to the records, the Elven Empire once tried to conquer that land, spreading the glory of the Earth Goddess to every corner of the world.<br/><br/>But they ended up failing.<br/><br/>Even though those notes from ancient times glossed over the failure of that expedition.<br/><br/>It was also during that time that major incidents occurred in the divine system of the elves, the Earth Goddess fell into a deep sleep, and several powerful divine spirits mysteriously fell.<br/><br/>That was the turning point for the Elven Empire from prosperity to decline.<br/><br/>It was also at that time that the humans seized the opportunity to rise. Soon after, the Elven Empire was overthrown, and the humans became the rulers of the continent.<br/><br/>If it weren’t for the internal strife among humans during the final battle, the remaining elves may not have been able to retreat into the Misty Forest and retain their vitality.<br/><br/>The Elf Queen realized after carefully reading these records that she might have uncovered a truth hidden in the mists of history.<br/><br/>Twenty thousand years ago, the divine system of the elves suffered heavy losses, the Earth Goddess fell into a deep sleep, and several of the most powerful divine spirits fell, possibly due to that expedition.<br/><br/>The mysterious Divine State Continent was countless times more dangerous than she had originally thought.<br/><br/>Even the omnipotent Earth Goddess suffered heavy losses. How terrifying must the powerful beings on the Divine State Continent be?<br/><br/>Would Eve and Gress truly be safe on this journey?<br/><br/>The Elf Queen felt a deep sense of powerlessness.<br/><br/>At that moment, a hand rested upon her shoulder, and Regina’s voice rang out beside her ear, “Everything will be alright.”<br/><br/>As Hilarya turned her head and opened her mouth to say something, she suddenly was alerted to something, looked up sharply, and cried out, “Eve!”<br/><br/>A grand spatial fluctuation appeared in the sky above the royal court.<br/><br/>The entire royal court’s lock system opened on its own, connected with the spatial fluctuation in the sky, and began to channel energy into it continuously.<br/><br/>The magic reserve in the royal court was consumed by one twentieth in an instant.<br/><br/>This degree of spatial fluctuation could only be the super long-distance teleportation of Eve’s new moon ring.<br/><br/>Elf Queen Hilarya was both shocked and pleasantly surprised.<br/><br/>Shock because the new moon ring was Eve’s last resort to save her life. If she had activated the super long-distance teleportation, it must have meant she encountered an enemy or danger she couldn’t counter.<br/><br/>Joy because at least she was certain now that Eve was safe.<br/><br/>As the ruler of the royal court, she not only didn’t stop it, she cooperated.<br/><br/>Soon, the teleportation was successfully completed.<br/><br/>The Elf Queen was able to sense her daughter’s presence clearly.<br/><br/>A legend?<br/><br/>She was inexplicably overjoyed; not only was Eve safe and sound, she also became a legend.<br/><br/>But just then, a heart-palpitating spiritual power swept across the entire royal court without any concealment.<br/><br/>With a thud, one of the artifacts she wore sensed danger and was activated on its own, forming a light shield.<br/><br/>“We’ve got an enemy!”<br/><br/>The Elf Queen was startled. The intensity of that spiritual power made her feel threatened; it wasn’t a small shock.<br/><br/>An extremely terrifying enemy had followed the super long-distance teleportation and arrived at the royal court.<br/><br/>She immediately took control of the lock system and protected the royal court and the Mother Tree.<br/><br/>Next to her, the Chief Priest, Regina knew they were facing a terrifying enemy. She took out her wand and a white glow rose immediately, without uttering an incantation, wrapping around Eve in the sky.<br/><br/>Sacred Protection!<br/><br/>This was a level-three legendary divine spell, an inherent ability of the wand in her hand.<br/><br/>Otherwise, even though she was a level-three legendary priest, she wouldn’t be able to cast it instantly.<br/><br/>Next, she triggered the second spell in her wand, a Sacred Summoning!<br/><br/>Immediately, a pure white unicorn and a clear, pure gemstone dragon flew out from the interdimensional space.<br/><br/>Then two more extra-order magic beasts flew up, which were transformed by the druids of the elf clan.<br/><br/>Several legendary mages were hiding behind these four extra-order magic beasts, casting shield after shield on themselves, ready for battle.<br/><br/>More than ten legendary masters were watching the terrifying master who infiltrated the royal court like they were facing a formidable enemy.<br/><br/>The entire scene was tight to the breaking point, ready to explode.<br/><br/>…<br/><br/>“Stop!”<br/><br/>Eve, seeing this scene, was dripping with cold sweat.<br/><br/>Having a master-servant pact with Gu Yang, their relationship was special; no one knew better than her how formidable her master was. If they started fighting, the consequences were unimaginable.<br/><br/>However, being within the Sacred Protection, her voice couldn’t get out.<br/><br/>She was anxious and activated a newly mastered legendary spell, casting it onto the sacred protection, yet failing to influence it in the slightest.<br/><br/>Gu Yang didn’t expect that his habitual use of the divine power of sky-viewing and earth-listening, to survey his surroundings, would provoke such a dramatic response.<br/><br/>The strength of the Elf Clan surprised him.<br/><br/>Weren’t the Elves said to have fallen from glory? Yet, there are over a dozen at the Unleaking Realm.<br/><br/>This number is almost catching up with all the Unleaking Realm experts in the Great Zhou Dynasty.<br/><br/>It should be noted that the territory of Great Zhou nearly covers half of the entire Divine State Continent.<br/><br/>In terms of land area, the Divine State Continent is much larger than the West Bank Continent.<br/><br/>From this, one can see how distorted the development of martial arts is in Great Zhou.<br/><br/>A thousand years ago, the number of Unleaking Realm experts wasn’t large due to the suppression by the Xia Emperor, a peerless expert.<br/><br/>After the demise of the Xia Emperor, Great Zhou was controlled by the powers backed by the Four Great Sacred Lands, suppressing any poor and grassroot families.<br/><br/>A thousand years ago, when the Qin Dynasty was just established, there were nine families and five major sects.<br/><br/>A thousand years later, there are ten families and six major sects.<br/><br/>Qin Family and the Academy were the only new powerhouses, not much changed among the rest of the fourteen families.<br/><br/>Moreover, the Qin Family were originally the royal family of the Qin Dynasty, with incomparably profound foundation.<br/><br/>About a decade ago, the Wu family was wiped out.<br/><br/>That means, over a full millennium, the only up-and-coming force not backed by the Four Great Sacred Lands was just the Academy.<br/><br/>This is absurd.<br/><br/>Among the elves here, there are two at the third layer of the Unleaking Realm.<br/><br/>Several at the second layer of the Unleaking Realm.<br/><br/>With the strength of the Elf Clan being suppressed within the Misty Forest, just how powerful should the humans, the strongest force on the West Bank Continent, be?<br/><br/>Facing these dozen Unleaking Realm experts and the surrounding prohibitions, Gu Yang didn’t dare to take them lightly. A divine beast incarnation flew out of his brow, it was the phoenix bathing in flames.<br/><br/>He spoke, “My friends, I bear no hostility.”<br/><br/>Before teleporting, he had pinned an Understanding Flower on his chest, a gift from Mu Jun, the Beastmaster from the Regina Continent. With it, he faced no language barrier in any world.<br/><br/>…<br/><br/>“Summoner!”<br/><br/>Seeing the great fire magic beast summoned by Gu Yang, the Elf Queen was greatly shocked and immediately had a dreadful presentiment.<br/><br/>Upon careful observation, she was filled with profound sorrow.<br/><br/>Among the Elf Clan, there is a special bond between mother and daughter, the higher the rank, the stronger the bond.<br/><br/>She used a secret method and instantly found that her daughter had formed a master-servant pact with the summoner.<br/><br/>A surge of anger rushed to her brain, nearly rendering her irrational.<br/><br/>She was on the brink of killing the evil summoner.<br/><br/>“Wait.”<br/><br/>At this moment, the Elf High Priestess Regina held her back and spoke with an incredulous tone. “He carries the power of the Mother Goddess.”<br/><br/>The power of the Mother Goddess?<br/><br/>The Elf Queen was startled and examined Gu Yang again. Indeed, there was a power so familiar it couldn’t be more so.<br/><br/>It was the power of the Mother Goddess, so pure, as if he’s an embodiment of the Mother Goddess.<br/><br/>How could the power of the Mother Goddess exist in a human summoner?<br/><br/>Her mind went blank.<br/><br/>…<br/><br/>“Phoenix!”<br/><br/>Simultaneously, from his treehouse not far away, the Sage of the Wind gazed at the fiery figure in the sky with a startling look in his eyes.<br/><br/>His heart was filled with shock.<br/><br/>Next to him, Henry, full of excitement, asked, “Who is he, mentor? Are there such powerful summoners on the continent? What breed is that fire magic beast? It seems so powerful. I’ve never heard of it before.”<br/><br/>The Sage of the Wind calmly replied, “This summoner is not from the West Bank Continent.”<br/><br/>“What?”<br/><br/>Henry was taken aback, “You mean, he’s from another continent?”<br/><br/>…<br/><br/>……<br/><br/>At this point, the other legendary elves also sensed the power of the Mother Goddess emanating from the summoner.<br/><br/>Each elf, being devout believers of the Mother Goddess, was no stranger to her power.<br/><br/>Doubt appeared on their faces.<br/><br/>Although they didn’t understand how a human summoner could possess the power of the Mother Goddess,<br/><br/>they were also reluctant to attack a human carrying the power of the Mother Goddess.<br/><br/>Besides, the human said he meant no harm.<br/><br/>In this confrontation, the High Priestess was the most clear-headed among the elves. She withdrew the divine protection from Eve, intending to learn the truth from her.<br/><br/>Seeing the divine protection finally lifted, Eve cried out, “Hold on, he is the protege of the Mother Goddess.”<br/><br/>The crowd of elves present was stunned by this remark.<br/><br/>A protege of the Mother Goddess?<br/><br/>A human?<br/><br/>Not one of the elves believed such an absurdity.<br/><br/>Yet, the power of the Mother Goddess was indeed on the man.<br/><br/>Upon hearing her daughter’s words, the Elf Queen was almost about to scold her, but she took a glance at the High Priestess nearby and saw her hesitation, leading her heart to skip a beat.<br/><br/>Among the elves, the High Priestess was the closest to the divine beings. Whether one was a protege or not could be determined by her.<br/><br/>Her hesitation indicated that she, too, was uncertain.<br/><br/>Could this human really be a protege of the Mother Goddess?\t\t\t\t\t\t</div>", "images": {}, "success": true}