{"id": 355, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132312.html", "title": "Chapter 355 - Chapter 355: 355 Added One More Identity", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 355 - Chapter 355: 355 Added One More Identity</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 355: 355 Added one more identity<br/><br/>When did I become a devotee of the Elven Mother Goddess?<br/><br/>Gu Yang was just as bewildered.<br/><br/>These people, one after another, put weird identities on him for reasons he didn’t understand.<br/><br/>The previous ones were acceptable. Lily, Little Green Bird, and Xi Huang mistook him for a phoenix, which was forgivable.<br/><br/>Wei Hao thought he was the prince of the Xia Dynasty, which was also understandable.<br/><br/>But now, Eve saying he’s a god’s devotee was too absurd.<br/><br/>What more, after Eve made this remark, the senior elves present seemed to believe her somewhat.<br/><br/>Gu Yang wanted to say something but decided against it.<br/><br/>Based on his experience, in such matters, even if he denied it, they wouldn’t believe him.<br/><br/>Doing the math, he was shouldering several identities.<br/><br/>Envoy, Emperor, Prince… He didn’t mind another identity as a devotee.<br/><br/>Having such an identity would make his actions here more convenient.<br/><br/>“Everyone step back.”<br/><br/>At this moment, an elf with a silver wand stepped forward. She had jet-black hair and jet-black eyes but her looks were quite western.<br/><br/>From her, Gu Yang felt a particularly familiar aura.<br/><br/>Taiyin Youying!<br/><br/>So, he was considered to be the elven Mother Goddess’s follower because of Taiyin Youying.<br/><br/>In that case, the Elven Mother Goddess was the Moon Goddess.<br/><br/>According to legend, Taiyin Youying was an incarnation of the moon.<br/><br/>This meant that there must be a very special relationship between the two.<br/><br/>With the Elf’s words, the rest of the powerful elves stepped aside. Even the prohibitions had been lifted, showing her significant influence within the elves.<br/><br/>Gu Yang also withdrew his phoenix form.<br/><br/>The Elf bowed, “Great Priestess Regina greets you, sir, may I know your name?”<br/><br/>“Gu Yang, from Divine State, pleased to meet Great Priestess.”<br/><br/>Gu Yang returned the bow, thinking to himself that she turned out to be the Great Priestess, she was quite powerful.<br/><br/>He also understood that the Great Priestess was willing to sacrifice herself in the simulation earlier because she considered him a devotee of the Elven Mother Goddess.<br/><br/>No matter what, she was indeed good at tact.<br/><br/>The High Priest directly asked, “Mr. Gu Yang, why do you possess the power of our Elven Mother Goddess?”<br/><br/>At this moment, the Elf Queen flew over and asked, “And why did my daughter sign a Master-Servant Pact with a human?”<br/><br/>The High Priestess introduced her, “This is the Queen of our Elf Clan, Hilarya. Eve is her daughter.”<br/><br/>Upon seeing the Elf Queen, Gu Yang guessed her identity. She looked a lot like Eve, but had a more mature temperament, “Is this what you mean?”<br/><br/>Using the divine power of Taiyin Youying, a cluster of silver light appeared in his hand, radiating a soft glow like moonlight, but containing an astonishing power.<br/><br/>The High Priestess, the Elf Queen, and all the elves present were staring intently at the power in his hand. Their eyes filled with shock, excitement, and fanaticism.<br/><br/>“Indeed, it’s the Mother Goddess​​—”<br/><br/>Several elves were moved to tears. Some of them had already knelt to the ground, worshipping the Mother Goddess.<br/><br/>The High Priestess was equally shocked. She took a deep breath and said, “Please follow me.”<br/><br/>As the High Priestess of the Elven Mother Goddess, she wouldn’t simply acknowledge someone as a devotee just because of this.<br/><br/>The key issue was that he was a human.<br/><br/>This was a serious matter and she needed to be cautious.<br/><br/>Gu Yang was uncomfortable with the atmosphere of fanaticism here. He nodded and said, “Alright.”<br/><br/>…<br/><br/>…<br/><br/>“How did he become the Moon God’s devotee now?”<br/><br/>In a certain treehouse, Henry was rather stunned.<br/><br/>The situation took an unexpected turn. Instead of a confrontation, the Elves recognized the powerful summoner as the Moon God’s devotee.<br/><br/>This was far beyond his expectation.<br/><br/>How could a human, the avatar of the summoner, be the devotee of the Moon God?<br/><br/>The Moon God was the main deity of the Elves, also worshiped by some humans.<br/><br/>The main god of humans was the Sun God. Twenty thousand years ago, humans defeated the Elves, and the Sun God defeated the Moon God, becoming the ruler of this continent.<br/><br/>In some sense, humans and elves were archenemies.<br/><br/>How could a human become a devotee of the Moon God? This was as impossible as the Sun God choosing a half-beastman as a devotee.<br/><br/>The Sage of the Wind looked intrigued, seemingly deep in thought.<br/><br/>No one knew that the Sage of the Wind, known for his neutrality, had another identity.<br/><br/>He was a member of the Phoenix Association.<br/><br/>The Phoenix Association, an ancient organization, dedicated itself to maintaining the balance of the world.<br/><br/>Such ideals were somewhat similar to those of the Elves.<br/><br/>However, since the Twilight of the Gods, the Phoenix Association’s philosophy changed to overthrowing the gods.<br/><br/>Because the leader of the Phoenix Association believed that the existence of the gods was the greatest imbalance in the world.<br/><br/>Upholding this belief, the Phoenix Association recruited many wizards and sorcerers to confront the Church over the last ten thousand years.<br/><br/>The most important step to overthrowing the gods was to destroy humanity’s faith in the gods.<br/><br/>To do this, naturally, they had to destroy the church of the deities.<br/><br/>Regrettably, the power of the Council of Gods was too fierce. The Phoenix Society, with its singular strength, was incapable of overturning the council. After repeated failures, the Phoenix Society grew weaker and eventually was forced underground.<br/><br/>In the West Bank Continent, the Phoenix Society had been labeled an evil organisation by the Council of Gods, given the same treatment as those dedicated to the worship of evil deities. If discovered, they were pursued and exterminated by the council’s powerhouses.<br/><br/>The Sage of the Phoenix was one of the core figures of the Phoenix Society.<br/><br/>His identity was extremely concealed, and only a few within the Phoenix Society knew his real identity.<br/><br/>In his daily life, he didn’t show overt hostility to the council, even having some friends within it. His concealment was deep.<br/><br/>The origin of the Phoenix Society was the Phoenix, also known as the Immortal Bird.<br/><br/>The Sage of the Phoenix, at the headquarters of the Society, had felt the power of the Phoenix, thus he immediately recognized that the Summoner had invoked a true Phoenix.<br/><br/>His shock was due to a scripture at the headquarters of the Phoenix Society, left behind by the first leader.<br/><br/>The scripture noted that there is only one Phoenix in the universe.<br/><br/>This uniqueness is an important factor distinguishing the Phoenix from other high-ranking magical beasts.<br/><br/>In a sense, the Phoenix could be regarded as an ancient deity. It is one of the oldest, natural-born divine spirits, existing since antiquity, before the emergence of humanity.<br/><br/>The scripture also stated that both the Sun God and the Moon God, the two most powerful divine spirits, were likewise ancient deities.<br/><br/>Now, with the resurgence of the Phoenix in the world, how could he not be excited?<br/><br/>The human not only summoned a Phoenix but also possessed the power of the Moon God. It was simply incredible.<br/><br/>The Sage of the Phoenix developed a strong interest.<br/><br/>…<br/><br/>…<br/><br/>Gu Yang followed the high priest of the Elves to the largest tree-house. This tree-house was vast, naturally formed, and was like a work of art.<br/><br/>The Elf Queen held her daughter Eve’s hand and was communicating with her through a secret method, occasionally glancing at Gu Yang who walked ahead.<br/><br/>They looked more like a pair of sisters, bearing a striking resemblance to each other.<br/><br/>Through conversation with her daughter, the Elf Queen finally understood the whole story.<br/><br/>She never expected that the situation would be filled with such astonishing and strange twists.<br/><br/>The Master-Servant Pact was actually proposed by Eve herself.<br/><br/>Could she blame anyone for that?<br/><br/>The Elf Queen was perturbed, struggling to regain her composure for a long time.<br/><br/>The entire situation was simply unfathomable.<br/><br/>Why did such a thing fall into that man’s hands?<br/><br/>Why did Eve suddenly have the impulsive thought to exchange her freedom for the trunk of the Mother Tree?<br/><br/>Why did the power of the Mother Goddess start to manifest on him after he formed the Master-Servant Pact with Eve?<br/><br/>…<br/><br/>There were too many coincidences and inexplicable elements involved.<br/><br/>The only explanation seemed to be this: all of this was the arrangement of the Mother Goddess.<br/><br/>Was he really the favored one of the Mother Goddess?<br/><br/>Thinking about this, the Elf Queen was still somewhat resistant. Why would the Mother Goddess choose a human as her favored one?<br/><br/>…<br/><br/>Finally, the high priest stopped before a door, she used her Wand to touch the door and it opened itself.<br/><br/>Inside was a storehouse filled with numerous items.<br/><br/>Gu Yang could feel that each item had a Prohibition, those who got too close would trigger it.<br/><br/>The high priest walked up to the deepest item and said, “This is the bow left by the Mother Goddess. Since the Twilight of the Gods, no one has been able to use it.”<br/><br/>Gu Yang had heard about the Twilight of the Gods from Eve. Ten thousand years ago, the Gods suddenly announced to their believers that they were going to sleep, since then, they seldom responded to their believers.<br/><br/>In terms of time, it was when the Way of Heaven died. It was just a different name.<br/><br/>He looked towards the bow, it was silver-white and seemed petite, engraved with exquisite patterns. It bore the old and distant aura akin to the Emperor’s Sword.<br/><br/>At least at the Divine Treasure level.<br/><br/>He made a judgment internally.<br/><br/>Then he heard the high priest say, “You can give it a try.”<br/><br/>Hearing her say that, Gu Yang didn’t hesitate, and reached out to grab the silver bow.<br/><br/>The high priest, the Elf queen, and Eve all watched him intently.<br/><br/>So cold!<br/><br/>That was Gu Yang’s feeling as he grabbed the bow. It felt heavy as he tried to lift it – this small bow seemed to weigh a thousand catties, and he couldn’t lift it.<br/><br/>What?<br/><br/>He became interested immediately, “I want to see just how heavy you are.”<br/><br/>He began to exert more force.<br/><br/>Soon, he had used all his strength, but the petite bow still did not budge.<br/><br/>Really now?<br/><br/>Stubborn, Gu Yang invoked his Divine Power, his arm muscles bulged.<br/><br/>“Heave!”<br/><br/>With a loud shout, he finally lifted the bow, firmly gripping it in his hand.<br/><br/>The nearby high priest and Elf queen watched in dull surprise. They could of course see that Gu Yang had used brute force to actually lift the Bow of the Moon Goddess.<br/><br/>Is he really a human?<br/><br/>Could he be a dragon in human skin?<br/><br/>This… this strength is even more terrifying than a dragon’s.\t\t\t\t\t\t</div>", "images": {}, "success": true}