{"id": 352, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132305.html", "title": "Chapter 352 - Chapter 352: 352 West Bank Continent", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 352 - Chapter 352: 352 West Bank Continent</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 352: 352 West Bank Continent<br/><br/>In the academy, when the dean saw Gu Yang pick up the Emperor’s Sword, a slight smile flashed in his eyes, and in a blink, he had already disappeared from his original spot.<br/><br/>Off to the side, Li Yuan was taken aback, he really didn’t expect that the Emperor’s Sword would actually acknowledge Gu Yang.<br/><br/>Even though Li Yuan had only seen Gu Yang once, the intense aura of the Monster Race on Gu Yang made him almost believe that this was a Divine Beast in human skin.<br/><br/>He had a deep wariness towards the Monster Race.<br/><br/>As for those like Gu Yang who possess the bloodline of the Monster Race, he was naturally cautious.<br/><br/>Even if Gu Yang was recognized by the Emperor’s Sword, it didn’t completely dispel his suspicions.<br/><br/>…<br/><br/>Gu Yang could sense someone spying on him, but he didn’t care. When he came to take the Emperor’s Sword, he was prepared, as such a thing cannot be concealed from others.<br/><br/>With his current strength, the only ones who could pose a threat to him were Celestial Beings.<br/><br/>Around the world, Celestial Beings could be counted on fingers.<br/><br/>Two from the Great Zhou, two from the prairies, one from Chi Ming Tian, three from the Three Sacred Doors, and then Yaochi Immortal Palace…<br/><br/>Alright, two hands were not enough to count.<br/><br/>The key point was it was unclear how many Celestial Beings were in the Yaochi Immortal Palace.<br/><br/>In summary, even if everyone in the world knew that the Emperor’s Sword was in his hands, there should not be many daring to trouble him.<br/><br/>Gu Yang held the Emperor’s Sword and felt a hefty power coming over. It was extremely heavy yet contained vigorous life energy, mighty and vast.<br/><br/>Under the blessing of this power, his mana became more spiritual, his mind clearer, and even his physical strength had significantly increased out of nowhere.<br/><br/>It was indeed an across-the-board improvement.<br/><br/>“Is this destiny?”<br/><br/>He was a bit surprised.<br/><br/>Though these forces of destiny couldn’t be used directly to fend off enemies, they greatly amplified his strength.<br/><br/>With this sword in his hands, his fighting power at least doubled.<br/><br/>And this was just some of the power of the Emperor’s Sword.<br/><br/>As expected of the supreme treasure of the Human Race, it gave him a great surprise.<br/><br/>Feet sounds came from behind.<br/><br/>Without turning back, Gu Yang said, “These are the heritage left by the Xia Dynasty. Send someone to the palace to report to the Queen Mother, seal up the scene, and wait for the Queen Mother to receive it.”<br/><br/>The one who came in was the commander of the Feather Forest Army guarding the altar. Realizing that the mana barrier had disappeared, he plucked up the courage to walk in.<br/><br/>He saw a passage to the Secret Realm filled with various treasures and all types of weapons. He was dumbfounded.<br/><br/>Then he saw the Lord of the State lying on the ground, dead. There were two people standing there, one tall and one short.<br/><br/>He recognized at a glance that the younger man was Gu Yang.<br/><br/>The speed of Gu Yang’s rise was amazing, shocking and tongue-tied.<br/><br/>When Gu Yang’s name disappeared from the top of the Master’s list, everyone knew he had broken through to the Unleaking Realm, becoming the world’s pinnacle powerhouse.<br/><br/>From then on, every family had to firmly remember Gu Yang’s image to avoid inadvertently provoking him.<br/><br/>Although the commander of the Feather Forest Army had never seen Gu Yang, he still recognized him at a glance, and was mightily astonished.<br/><br/>Only when Gu Yang spoke did he subconsciously salute, “Yes sir.”<br/><br/>As he looked up, Gu Yang and the giant who was over a meter tall had already soared into the sky and disappeared in the blink of an eye.<br/><br/>He sighed with relief, then turned to look at the Secret Realm. Seeing the mountains of gold and silver and rows of shiny new weapons, he became excited.<br/><br/>Having Gu Yang was indeed the fortune of Great Zhou.<br/><br/>As for the rumors about Gu Yang and the Queen Mother, he subconsciously ignored them.<br/><br/>…<br/><br/>…<br/><br/>Gu Yang took Wei Hao and left the Divine City. Before leaving, he looked back in the direction of the academy.<br/><br/>From this distance, with his divine power of celestial vision and hearing, he could see everyone in the academy. Xi Huang and the Little Green Bird, Ling Ling, Su Qingzhen, Pei Qianlan, Chu Xiyue, Ye Lingbo and so on.<br/><br/>Some were practicing, some were reading, and some were dazing…<br/><br/>Gu Yang looked in the direction of the palace, but unfortunately, a strange force prevented his celestial vision and hearing, and he could see nothing at all.<br/><br/>He didn’t know how Su Ningyan and Cao Yiyi were doing.<br/><br/>Soon, after more than two hundred miles, he could see nothing.<br/><br/>Now is not the time for romance.<br/><br/>There were only ten days left until the Yaochi Conference.<br/><br/>Although he had broken through to the second level of the Unleaking Realm and obtained the Emperor’s Sword, whether he could survive the Yaochi Conference was still an unknown.<br/><br/>Gu Yang opened the System and initiated a Simulation.<br/><br/>“At twenty-three years old, you are already at the second level of Unleaking Realm, and with obtaining the Emperor’s Sword, your fame has escalated even more.”<br/><br/>“Ten days later, on your way to the shore of North Sea, as you entered the Yaochi Immortal Palace, you triggered some kind of prohibition. Despite your efforts to resist, you still die on the spot, at the age of twenty-three.”<br/><br/>It was the same outcome as before.<br/><br/>Although Gu Yang had some expectation, it still made him somewhat frustrated.<br/><br/>It seems that without the strength of a Celestial Being, it would be impossible to pass this test.<br/><br/>“Why would I trigger the prohibition of the Yaochi Immortal Palace?”<br/><br/>He thought about this question.<br/><br/>Was it because there was something special about him?<br/><br/>Perhaps he should ask the Little Green Bird, maybe it was trouble caused by the Phoenix in ancient times.<br/><br/>Nevertheless, it all came back to improving one’s strength.<br/><br/>Where should he go next?<br/><br/>Gu Yang began to think about this difficult problem again.<br/><br/>His current strength was more than a dozen times what it was a few days ago. Naturally, it was overwhelming in comparison to the Unleaking Realm. The problem was, he still couldn’t assure victory against a Celestial Being. Whether he could even escape was debatable.<br/><br/>Such strength was awkwardly stuck between two levels.<br/><br/>This meant, no matter which part of the cave world he went to, there was a high likelihood he wouldn’t survive.<br/><br/>He only had just over seven hundred energy points remaining and the ways to obtain energy were becoming increasingly scarce. He must be prudent with his usage.<br/><br/>As Gu Yang was pondering, he suddenly felt a pull in his heart, sensing that someone seemed to be calling out to him anxiously.<br/><br/>“Is it her?”<br/><br/>He focused, sensing a special brand within his Original Spirit.<br/><br/>That was the mark left by the pact. Through this mark, he was clearly aware that someone was chasing him. Their speed was too slow, and the distance between them was growing.<br/><br/>Frowning, Gu Yang decided to stop and wait.<br/><br/>Through the mark, he could feel her emotions. She seemed in extreme distress.<br/><br/>A moment later, a figure appeared within his sight. It was the Elf princess, Eve, who had made a Master-Servant Pact with him.<br/><br/>To his surprise, her cultivation level had reached the Unleaking Realm, and she was considered a legendary figure on the West Bank Continent.<br/><br/>…<br/><br/>The experience of the Elf Princess Eve, after arriving at the Divine State, was full of ups and downs.<br/><br/>When she first arrived, she never dreamed that she would become a slave to an evil summoner, let alone that she would voluntarily make a pact with him.<br/><br/>Once the pact was made, her spirits sank and she became like a walking corpse. She was waiting for the reawakening of the Elf Mother Tree and then, she would instantly end her own life.<br/><br/>At this darkest moment of her life, she never expected that her master, the summoner she saw as wholly malevolent, would have the power of the Mother God.<br/><br/>As the Mother God’s power on him grew, she finally realized that all this was arranged by the great Mother God.<br/><br/>The master she accepted was clearly favored by the Mother God.<br/><br/>Although she did not understand why the Mother God would favor a foreign summoner, as a devout believer, she never questioned the Mother God’s decisions.<br/><br/>From then on, Eve picked herself up again.<br/><br/>Just a few days ago, she felt her ‘master’s’ power of the Mother God strengthening once more. She also profited greatly from it, experiencing an unexpected joy, which allowed her to smoothly reach the breakthrough and became a legendary power.<br/><br/>Initially, with her qualifications, she would have needed decades or even a century to have a chance to become a legendary figure.<br/><br/>All of this was thanks to her ‘master’.<br/><br/>The two made a Master-Servant Pact, in which she devoted her body and mind to her master. But the God of Pact on the West Bank Continent would not impose completely unfair contracts.<br/><br/>Having paid such a high price, as a servant, she was also compensated in other ways. One of them was that whenever her ‘master’s’ realm improved, she could also reap some benefits.<br/><br/>When Eve broke through to become a legendary figure through the pact, she had no doubt about her ‘master’s’ identity.<br/><br/>These past few days, she had been meditating to consolidate her strength.<br/><br/>Halfway through, she suddenly perceived that Gu Yang was nearby. She was instantaneously awakened and chased after him immediately.<br/><br/>But her speed was incomparable to Gu Yang, and she found herself falling further behind the more she chased.<br/><br/>In her desperation, she influenced Gu Yang’s focus through the power of the pact.<br/><br/>Finally, Gu Yang stopped.<br/><br/>“Master–”<br/><br/>When Eve saw Gu Yang again, the feelings in her heart were drastically different from before. Now, her heart held affection, reverence, and even a hint of fanaticism.<br/><br/>Gu Yang was stunned by her call, filled with rich emotions. Then he saw her slightly fanatical eyes and felt a little doubtful.<br/><br/>What was going on with her?<br/><br/>In the past, her expressions were numb, her eyes hollow. Although she obeyed his orders, her icy attitude revealed her reluctance.<br/><br/>Now, her attitude had undergone a complete turnabout. It seemed that if he asked her to die, she would commit suicide without any hesitation.<br/><br/>Gu Yang genuinely couldn’t understand what had happened to her over the past few days to cause such a drastic change.<br/><br/>It felt as if she had been brainwashed.<br/><br/>“Is that Master-Servant Pact so overbearing? Can it even completely warp a person’s thoughts?”<br/><br/>His thoughts naturally went off track.<br/><br/>“The Elf Mother Tree is withering. The Elf Clan hasn’t seen the birth of new members in over a hundred years. If this continues, the Elf Clan will go extinct in one or two hundred years. Please, Master, save us,” Eve said, tears streaming down her face.<br/><br/>When Gu Yang heard her words, he finally understood why they had traveled from West Bank to the Divine State. It was to save the Elf Mother Tree.<br/><br/>The Extreme Sun Nail must be the key to saving the Elf Mother Tree. No wonder she was willing to become his servant in exchange for the Extreme Sun Nail.<br/><br/>Such a spirit of sacrifice was truly touching and deserving of sympathy.<br/><br/>But…<br/><br/>“I regret that I cannot assist in this matter.”<br/><br/>He was barely saving himself now. Leaving aside that he didn’t know how to save the Elf Mother Tree, he had to survive the immediate dangers before anything else.<br/><br/>“The Divine State is far too distant from the West Bank Continent, the journey would take half a year to a year…”<br/><br/>“Master, I have a way to reach the West Bank Continent in a very short time,” Eve quickly interjected.<br/><br/>Even so, I won’t go…<br/><br/>Just as Gu Yang was about to refuse, his words stuck in his throat, and his eyes lit up suddenly.<br/><br/>The West Bank Continent, wasn’t it a place where he could earn energy?<br/><br/>It was as if a pillow had been handed to him when he was sleepy.<br/><br/>A smile surfaced on his face as he said, “Come, tell me about the Elf Clan’s plight. And also, the situation on the West Bank Continent.”<br/><br/>Overjoyed, Eve began to describe the situation of the Elf Clan, “We, the Elf Clan, are now living in the Mist Forest…”<br/><br/>Gu Yang listened intently, occasionally interjecting with a question.<br/><br/>He asked very specifically, about the Elf Clan, their opposing forces, other major forces, their formidable figures and so on.<br/><br/>If he planned on venturing into the West Bank Continent, he naturally needed to acquaint himself with both the knowns and unknowns.\t\t\t\t\t\t</div>", "images": {}, "success": true}