{"id": 358, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132318.html", "title": "Chapter 358 - Chapter 358: 358 Slaying The Dragon", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 358 - Chapter 358: 358 Slaying The Dragon</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 358: 358 Slaying the Dragon<br/><br/>The Elf Queen, Hilarya, knelt on one knee, her body stained with blood. The hand holding the Queen’s staff trembled slightly. Looking up at Anna and over a dozen dark dragons in the sky, her face was full of defiance and despair.<br/><br/>Just now, the breath of those dragons had shattered all their shields. If it weren’t for the life-saving gem she carried, she would now be a corpse.<br/><br/>The combined power of dozens of dragons was too terrible.<br/><br/>She, the high priest, and the most powerful legendary warrior in the clan had blocked most of the power and barely saved the others.<br/><br/>She and the high priest were both severely injured, and the legendary warrior was vaporized, leaving no body behind.<br/><br/>Even so, everyone was wounded.<br/><br/>The biggest advantage that dragons and other superior magical beasts have over intelligent beings like humans and elves is their innate ability to instantaneously cast legendary magic spells.<br/><br/>This gave them an overwhelming advantage in battle.<br/><br/>Mages, warlocks, and priests and other vocations, to deal with dragons and other superior magical beasts, need to make thorough preparations in advance to have a chance of victory.<br/><br/>Like their current predicament, they were taken by surprise, a single dragon breath from the dark dragon was equal to a dozen legendary spells, nearly wiping them out.<br/><br/>If they had sufficient time to prepare, they would not have ended up in this situation.<br/><br/>The Elf Queen glanced at Anna, who had been seduced by the evil god and whose appearance had even changed, and felt despair.<br/><br/>What would become of the remaining members of the tribe if their leadership died?<br/><br/>The people would be forced to change their faith, the devout followers of the Mother Goddess, would face slaughter…<br/><br/>In the end, the elven tribe would be completely corrupted, like the Dark Dragons, becoming evil creatures hidden from the light of day.<br/><br/>“Mother Goddess, save your people!”<br/><br/>In heart-wrenching despair, the Elf Queen made her final plea to the Mother Goddess.<br/><br/>“Do you need help?”<br/><br/>As if answering her plea, a familiar voice resounded in her ears.<br/><br/>It was a voice so familiar, with a certain unique tone.<br/><br/>The Elf Queen instinctively looked up and saw an unimpressive figure shining under the sun.<br/><br/>It’s him!<br/><br/>He’s not dead!<br/><br/>The Mother Goddess has shown herself!<br/><br/>A blurred figure appeared before her eyes, already filled with tears.<br/><br/>As much as the Elf Queen didn’t want to admit it, deep down, she had already accepted the fact that this alien man named Gu Yang was the chosen one of the Mother Goddess.<br/><br/>…<br/><br/>“Is it you?”<br/><br/>When Anna saw Gu Yang appeared, her eyes narrowed, and a strong murderous intent boiled in her heart.<br/><br/>Originally, according to her plan, she would find the opportunity to slowly corrupt the elven leadership, using the power of the Lord to assimilate them all.<br/><br/>That way, she could preserve as much of the strength of the elven tribe as possible.<br/><br/>But, Gu Yang’s appearance had messed up all her plans.<br/><br/>Or rather, her plans had been disrupted a year ago when the Elven Mother Goddess issued a divine decree.<br/><br/>The manifestation of the Mother Goddess injected a shot of adrenaline into the Elven Tribe.<br/><br/>Even Anna herself had wavered a bit, taking no action for a long time.<br/><br/>It wasn’t until the Mother Tree’s condition worsened that she realized it was a warning from her master.<br/><br/>If she didn’t act according to plan, the Elven Tribe would be completely annihilated.<br/><br/>So, Anna continued with her plan and finally found an opportunity to bring Kelly into her camp.<br/><br/>Just as she was about to take further action, the chosen one of the Elven Mother Goddess showed up. Worse still, this alien being actually had a way to clear the power left by the master.<br/><br/>Anna had no choice but to act prematurely, starting with killing the interfering human.<br/><br/>If he healed the Mother Tree, then all her schemes would have been in vain.<br/><br/>As soon as she made a move, she would be exposed, and the Elf Queen and the high priest would not let her off.<br/><br/>Therefore, she had no choice but to kill these stubborn fools.<br/><br/>Her trump card was an artifact that her master had given her, which could forcefully open a spatial gate under the lock of a trace, summoning over a dozen dark dragons.<br/><br/>These Dark Dragons are all servants of the master and are under her command.<br/><br/>But after cleansing the high-ranking elves, the strength of the Elven tribe was greatly reduced, with only two of them, her and Kelly, left as the legendary figures.<br/><br/>Therefore, persuading the ordinary clansmen to accept orders and change their faith would become very difficult…<br/><br/>Originally, she didn’t need to do this.<br/><br/>All of this was because of the human standing in front of her.<br/><br/>“Kill him!”<br/><br/>Anna was filled with hatred for Gu Yang from another continent. She changed her target and gave the order.<br/><br/>The dozen or so dark dragons immediately set their sights on the human in the sky, their black breath readied in their mouths.<br/><br/>Suddenly—<br/><br/>Several powerful presences burst into the dark dragon group, immediately throwing their formation into disarray.<br/><br/>“What?”<br/><br/>Anna was shocked, not knowing what had happened.<br/><br/>…<br/><br/>“That is—”<br/><br/>The elites below clearly saw five superior magical beasts suddenly charging into the ranks of the dark dragons. Blood spurted out, and on the spot, five mature dark dragons were killed.<br/><br/>Five dark dragons, the equivalent of five legendary beings.<br/><br/>The five superior magical beasts were even more formidable than the dark dragons.<br/><br/>The most brutal was a golden giant ape that, with one slap, pushed a dragon’s head into its chest. The dragon’s dark breath exploded inside its body, blowing its upper body to bits.<br/><br/>There was also a white tiger whose swipe opened up a dragon, its body as fragile as paper mache.<br/><br/>The other three beasts, one a bird of fire, and two colored snakes, swiftly killed their targets.<br/><br/>These five superior magical beasts had invisibility cast on them. After approaching unnoticed, they launched a sudden attack, achieving such a brilliant victory.<br/><br/>To deceive the spiritual perception of the Dark Dragon, it must be a legendary-level Invisibility Technique.<br/><br/>Suddenly, the Elven Queen and the High Priest spotted a familiar figure, it was Eve, and they finally understood.<br/><br/>It’s Gu Yang!<br/><br/>They were extremely shocked, Gu Yang actually had so many superior magical beasts by his side, five in total.<br/><br/>In the West Bank Continent, the greatest summoner, who owned three super tier magical beasts, had already been famous for over a thousand years.<br/><br/>However, many dark giant dragons disrupted this, shooting seven or eight breaths of darkness towards Gu Yang in the sky.<br/><br/>These were equivalent to seven or eight legendary magic attacks, where any form of shield couldn’t withstand their blasts.<br/><br/>“Watch out——”<br/><br/>The Elf Queen blurted out anxiously.<br/><br/>From Gu Yang’s brow, a giant shadow flew out to protect him.<br/><br/>The breaths of darkness hit the enormous shadow and were unable to penetrate it.<br/><br/>Only then did everyone notice that it was a gigantic turtle. Its shell bore the impact of the dark breaths, leaving only shallow traces.<br/><br/>Another super tier magical beast!<br/><br/>The elves were entirely numb.<br/><br/>…<br/><br/>In a treehouse nearby.<br/><br/>“This…”<br/><br/>Henry never imagined that such a twist would happen. The human from another dimension who was previously banished to a subspace dimension was actually still alive.<br/><br/>The scene of five dark giant dragons being instantly killed made his eyes pop and his mouth hang open.<br/><br/>He’s too powerful!<br/><br/>His mind was buzzing, with only one thought left.<br/><br/>A dozen dark giant dragons could destroy nearly any kingdom, apart from the two most powerful empires, leading to their eventual extermination.<br/><br/>Even masters would have to flee when confronted by them.<br/><br/>However, the mysterious man from another dimension chose to take them head-on.<br/><br/>Six super tier magical beasts!<br/><br/>He alone was equivalent to a top-tier power.<br/><br/>Henry watched in awe, imagining himself in the foreigner’s shoes.<br/><br/>The Wise One of Wind was far calmer. He had suspected from the start that the foreigner wouldn’t die so easily.<br/><br/>His focus was on the Phoenix the whole time. He watched it spew a flame that burned a dark giant dragon to death. Its power was exactly as recorded in the sacred book.<br/><br/>This Phoenix had achieved at least the third tier of legendary status.<br/><br/>The Wise One of Wind’s eyes brightened, and he thought, “Its power should be enough to open the divine kingdom…”<br/><br/>…<br/><br/>…<br/><br/>Gu Yang had already released the incarnations of the six divine beasts, leaving only Taiyin Youying. This was enough.<br/><br/>[Gained 100 energy, current balance 630 points.]<br/><br/>[Gained 100 energy, current balance 730 points.]<br/><br/>…<br/><br/>There were five notifications in total, earning him 500 energy points.<br/><br/>The divine beast incarnations targeted the weakest dark giant dragons – all first-tier legends – weakening their numbers first.<br/><br/>Then, the remaining ten dragons reacted and attacked them, and a chaotic battle ensued.<br/><br/>Though Gu Yang’s divine beast incarnations were outnumbered, they weren’t at a disadvantage. The Phoenix and the Divine Ape were especially powerful, beating the dragons into retreat.<br/><br/>However, the remaining dragons were quite hardy. It was hard to kill them in a short period.<br/><br/>“I’ll have to finish this.”<br/><br/>Gu Yang took out the giant spirit hammer from the Beast-taming Space and quickly appeared in front of the smallest dark giant dragon. He swung the hammer down.<br/><br/>Poor creature, it had just been stunned by one of the Candle Dragon’s psychic attacks and was struck on the head by the giant spirit hammer before it could react. Its brains splattered everywhere; it died on the spot without uttering a cry.<br/><br/>[Gained 200 energy, current balance 1230 points.]<br/><br/>Gu Yang, like a god of death, waded through his enemies as if they posed no threat, easily killing five giant dragons with his hammer.<br/><br/>His Spirit Tool showed its power for the first time on this strange continent, scaring off the remaining five dragons. They instantly turned and fled.<br/><br/>“Trying to escape?”<br/><br/>Gu Yang’s eyes were bloodshot. He held his giant spirit hammer, pursued them with his six divine beast incarnations.<br/><br/>After all, they were all energy!<br/><br/>…<br/><br/>The Elf Queen and the High Priestess, as well as several other elves, felt as if they were in a dream.<br/><br/>These were the dark giant dragons, the beings at the very top of the West Bank Continent.<br/><br/>In Gu Yang’s hands, they were like chickens. He killed a dragon with each hammer blow.<br/><br/>What were those legendary dragonslayers of lore compared to this man before their eyes?<br/><br/>This scene was imprinted deep in the minds of everyone present, never to be forgotten.<br/><br/>They finally understood why Gu Yang could tame so many super tier magical beasts. His strength was far more terrifying than that of a super tier magical beast.<br/><br/>…<br/><br/>“…”<br/><br/>In the treehouse, Henry was left speechless, staring wide-eyed.<br/><br/>He couldn’t believe his eyes.<br/><br/>A single man, wielding a hammer, killed five giant dragons in an instant.<br/><br/>Could a human really do this?<br/><br/>Could this be some new breed of magical beast?<br/><br/>The nearby Wise One of Wind was also taken aback by the sight. It was too brutal and violent.<br/><br/>How did this man acquire such divine power?<br/><br/>This method of fighting was far more superior than any Saint Knight or Saint Warrior.<br/><br/>He had never heard of a human who could physically fight a giant dragon.<br/><br/>Just then, Gu Yang had caught up with another dark giant dragon. Despite its fiery breath, with one swing of his hammer, he smashed its entire body into a pancake.<br/><br/>This dragon was an ancient beast of the third legendary tier, a being that would give even him a headache if he encountered one. But now, it was easily killed right before his eyes.<br/><br/>Just like that, Gu Yang chased and hammered each of the remaining four dark giant dragons of the third tier into oblivion. Their dying struggles didn’t cause him any harm.<br/><br/>Looking at Gu Yang, who had killed ten giant dragons yet remained unscathed, the Wise One of Wind felt a twinge of fear in his heart.\t\t\t\t\t\t</div>", "images": {}, "success": true}