{"id": 350, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132302.html", "title": "Chapter 350 - Chapter 350: Subdue 350", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 350 - Chapter 350: Subdue 350</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 350: Subdue 350<br/><br/>Zhanxuan Swordsmanship!<br/><br/>Upon hearing these four words, the Lord of the State seemed frozen in place, as if struck by lightning.<br/><br/>The only thought left in his mind was, why did the Dean pass on this sword technique to Gu Yang?<br/><br/>In all of Great Zhou, fewer than five people have ever heard of this sword technique, and he was one of them.<br/><br/>He once had the privilege of seeking the Dean’s guidance, during which they discussed the world’s various sword techniques, and he learned that the technique mastered by the Dean was Zhanxuan Swordsmanship.<br/><br/>This news was a massive blow to him.<br/><br/>Great Zhou had two pillars of support, one of them was Luo Wang, whose presence stabilized the Great Zhou royal family like a mountain, and no one could shake the Zhao Family’s status.<br/><br/>However, he would only intervene when the rule of Great Zhou was threatened.<br/><br/>The other, naturally, was the Dean, who, with his power alone, rivalled the Three Holy Gates and Chiming Heaven, protecting this world.<br/><br/>The person whom the Lord of the State admired most in his life was the Dean.<br/><br/>No matter how hard he tried, he couldn’t understand why the Dean would so recklessly pass on Zhanxuan Swordsmanship to such a future menace!<br/><br/>…<br/><br/>The Literary Institution.<br/><br/>A look of shock appeared on Li Yuan’s face, and he exclaimed, “He’s actually mastered Zhanxuan Swordsmanship!”<br/><br/>He knew that the instructor had always wanted to find a successor for this sword technique, and the first challenge at the Star Picking Pavilion was a test set by the instructor.<br/><br/>However, that sword technique had been there for almost five hundred years, and no one had ever managed to learn it.<br/><br/>Moreover, the Star Picking Pavilion was open to the public, and disciples outside of the academy were also allowed to comprehend the sword technique.<br/><br/>Over the past five hundred years, many extraordinarily talented individuals had appeared in the world, but not one of them had managed to comprehend it.<br/><br/>Neither he nor Ye Lingbo, who was said to be a reincarnation of a great power, could do it.<br/><br/>It was said that the elderly patriarch of the Qin Family had once disguised himself and came to the academy, but he also failed to comprehend the sword technique.<br/><br/>Zhanxuan Swordsmanship was found by the Dean in some ruins. It was created by a figure from ancient times and is incredibly powerful. Only two legacies of it were left behind.<br/><br/>One was inherited by the Dean.<br/><br/>The other was eventually passed on by the Dean to Gu Yang.<br/><br/>Li Yuan didn’t know why the Dean trusted that young man so much, but, it was too late to change anything now.<br/><br/>He never expected that Gu Yang, who was known for his unparalleled talent in swordsmanship, could master Zhanxuan Swordsmanship in such a short time.<br/><br/>This move, Xuan Yuan, could sever True Essence and Mana, approaching the Dao, which was a method of the Celestial Being realm.<br/><br/>No matter how powerful the Mana of the Unleaking Realm was, it was useless in front of this sword technique.<br/><br/>The Dean’s cultivation level and Chiming Heaven’s were vastly different, yet he could compete with it, and even end up mutually wounded. The reason for this was this sword technique.<br/><br/>A hint of unusual color flashed in the eyes of the Dean, who smiled with satisfaction and said, “I did not choose the wrong person.”<br/><br/>Now that Zhanxuan Swordsmanship had a successor, and with the emergence of the Sword of the Human Emperor, they were able to counter the Celestial Supreme of Chiming Heaven and the three Demon Saints from the Three Holy Gates.<br/><br/>However, Li Yuan wasn’t as optimistic as him. On the contrary, he was even more worried. If Gu Yang really was a scheme left by the Phoenix, things would be more difficult to control.<br/><br/>…<br/><br/>Seeing that the Lord of the State seemed to have his spirit drained in an instant, and looked like a lost soul, Gu Yang felt some sympathy for him.<br/><br/>This man was loyal to Great Zhou, dedicated himself to Great Zhou, and strictly adhered to his principles, refusing to get involved in political affairs.<br/><br/>Although Gu Yang didn’t understand why he was so determined to kill him, he didn’t want to kill someone like him either.<br/><br/>He put away his Guanghan Immortal Sword and flew towards the secret realm.<br/><br/>The silver-armored giant guarding the Sword of the Human Emperor also opened his eyes. The horrifying light shone from his pitch black pupils.<br/><br/>Hints of a wild aura emitted from him, giving the impression of the Monster Race.<br/><br/>This was a highly skilled Third Layer Unleaking Realm master, with the same cultivation level as the sect leader of the Dao Sect, Wen Jue.<br/><br/>This person was clearly arranged by the Xia Emperor to guard the Sword of the Human Emperor, and was therefore highly trusted by the Xia Emperor.<br/><br/>Still, Gu Yang was puzzled. The Xia Emperor had gone to fight against the Four Great Sacred Lands, so why didn’t he bring the Sword of the Human Emperor with him?<br/><br/>It wasn’t possible that on the verge of defeat, the Xia Emperor handed the Sword of the Human Emperor to a confidant to hide it, was it?<br/><br/>There’s no way that could have been kept secret from Chiming Heaven and Saint Chaoyang; they wouldn’t overlook such a treasure.<br/><br/>So, there was only one possibility.<br/><br/>The Xia Emperor hid the Sword of the Human Emperor beforehand and didn’t take it to the battle.<br/><br/>Gu Yang stared at the giant figure standing up. The giant man was taller than three meters, and his tower-like physique contained explosive power.<br/><br/>A golden shadow flew out from his brow, which was none other than the Heavenly Divine Ape.<br/><br/>In a simulation, he subjugated this Unleaking Realm powerhouse. Preparing for a fight was the logical next step.<br/><br/>The man was obviously good at melee combat, so using the Heavenly Divine Ape to deal with him was the most suitable strategy.<br/><br/>To his surprise, a look of joy appeared in the giant man’s eyes, and he suddenly kneeled down, “Lowly official Wei Hao, at your service, my prince.”<br/><br/>What the heck?<br/><br/>Gu Yang was taken aback.<br/><br/>What did he call me, Prince?<br/><br/>What did he mean by that?<br/><br/>No way…<br/><br/>Suddenly, he understood the reason.<br/><br/>During the time of Xia Dynasty, only the royal family was qualified to practice “Nine Heavens Divine Method”.<br/><br/>Seeing him release the Heavenly Divine Ape, which indicated that he practiced “Nine Heavens Divine Method”, it was understandable that the man would make such a mistake.<br/><br/>With an extremely excited expression, Wei Hao, the silver-armored giant said firmly, “Your lowly servant was entrusted to guard the Sword of the Human Emperor. I have been doing this for more than one thousand and seventy-three years. I am honored to have fulfilled my duties.”<br/><br/>“Good!”<br/><br/>Gu Yang shouted, approaching and placing a hand on his shoulder, “With loyal subjects like you in Xia, there is hope for restoration.”<br/><br/>This wasn’t the first time he encountered such a case of mistaken identity.<br/><br/>At first, Lily mistook him for some sort of a saint.<br/><br/>Then Little Green Bird and Xi Huang took him for a phoenix.<br/><br/>He’d gotten used to it, so he quickly accepted it.<br/><br/>After all, the entire royal family and ministers of the Xia Dynasty are all dead, who can say he isn’t a descendant of the Xia Emperor? Firstly, they would have to ask whether his divine beast incarnation agrees or not.<br/><br/>He had gone from denying these events and trying to explain them at first, to now calmly accepting them, gradually getting better at handling these incidents.<br/><br/>Without lifting a hand, he gains a loyal follower, why not?<br/><br/>Gu Yang looked at the sword before him and said, “There is one thing I don’t understand. I hope Master Wei can clarify my doubts.”<br/><br/>“Please proceed with your question, your highness. I will know nothing but tell everything.”<br/><br/>“Back then, why didn’t the Former Emperor take the Human Emperor’s Sword? Why did he leave it here?”<br/><br/>Wei Hao hesitated a little bit before saying gently, “The Emperor could never truly harness the power of the Human Emperor’s Sword.”<br/><br/>Gu Yang was astonished, “Why is this?”<br/><br/>If the Xia Emperor could establish a dynasty, an emperor that couldn’t gain the acknowledgement of the Human Emperor’s Sword?<br/><br/>The Human Emperor’s Sword is at least at the level of a spiritual treasure. To unleash its might, you must earn the recognition of itsprimordial spirit. Otherwise, it’s no more than an ordinary stick.<br/><br/>It was the same with the Spirit Treasure cudgel. If it weren’t for the primordial spirit reluctantly acknowledging him, he wouldn’t be able to bring out its power at all.<br/><br/>Therefore, the only explanation is that the Xia Emperor didn’t gain the recognition of the Human Emperor’s Sword.<br/><br/>However, if even the Xia Emperor couldn’t get its recognition, who else in this world would be qualified for it?<br/><br/>Wei Hao seemed to want to speak but hesitated, appearing very conflicted.<br/><br/>Seeing this, Gu Yang immediately understood that the matter involved the Xia Emperor’s privacy.<br/><br/>This man was able to guard the Human Emperor’s Sword in the Secret Realm for a thousand years, which spoke volumes about how loyal he was to the Xia Emperor. It was only natural that he wouldn’t wish to disclose the Xia Emperor’s secrets.<br/><br/>And the difficulty of dealing with Gu Yang without lying to him led to his current dilemma.<br/><br/>Gu Yang said, “Alright, forget I asked.”<br/><br/>Then he looked at the giant sword again and reached out to take hold of it.<br/><br/>“Be careful, your highness.” Warned Wei Hao, “The Human Emperor’s Sword is extremely capricious. One needs to be careful of being harmed instead.”<br/><br/>Gu Yang was not particularly worried. In the simulation, he had successfully picked up the Human Emperor’s Sword, obviously there would be no issue.<br/><br/>However, just to be sure, he kept two divine beast incarnations nearby just in case.<br/><br/>As Gu Yang’s hand touched the hilt of the Human Emperor’s Sword, he felt a rumbling in his head and his sight went black.<br/><br/>…<br/><br/>At this time, not only was the Lord of the State who was present at the scene paying attention to Gu Yang, but the headmaster of the academy and Li Yuan were also looking.<br/><br/>The Human Emperor’s Sword, the sword of the Human Emperor, was not something anyone could just take.<br/><br/>If an alien dared to take the Human Emperor’s Sword, it would likely be met with the backlash of the Human Race’s destiny.<br/><br/>Whether Gu Yang was truly the Demon Emperor Phoenix of the monster race could quickly be understood.<br/><br/>…<br/><br/>“Oh no.”<br/><br/>At the same time, inside a yard in the academy, Little Green Bird finally sensed the location of its master, overlapping with the Human Emperor’s Sword.<br/><br/>It knew that its master, like itself, had lost most of his memory. His reasons for running to find the Human Emperor’s Sword were self-evident.<br/><br/>Little Green Bird had experienced the power of the Human Emperor’s Sword in ancient times, and it was counted together with Demon Suppression Tower of the Yao Chi Immortal Palace as one of the two big rivals of the Monster Race.<br/><br/>After the Way of Heaven died, the level of the Demon Suppression Tower fell, and its power was not even a tenth of what it was in the ancient times.<br/><br/>The Human Emperor’s Sword was a different story. It was not an Innate Spirit Treasure like the Demon Suppression Tower. The reason it could shake the world was that it was infused with the destiny of the human race, regardless of the Way of Heaven.<br/><br/>Even if the Human Emperor’s Sword was heavily injured by the Taiyi Emperor, it was not the infinitely powerful Human Emperor’s Sword of ancient times that could kill the Demon Emperor. But it is still not to be underestimated.<br/><br/>With the current cultivation level of the master, rashly touching the Human Emperor’s Sword could likely result in injury from the Human Race’s destiny contained within.<br/><br/>That would be a total loss.<br/><br/>Thinking of this, Little Green Bird flew out without a care for anything else. It wanted to warn its master.<br/><br/>But it had barely flown out a little when it hit an invisible barrier and was bounced back violently.<br/><br/>This bounce made it dizzy.<br/><br/>I…<br/><br/>It was about to curse when it suddenly covered its mouth with its wings.<br/><br/>In the academy, the only one who could stop it in such an imperceptible manner was that human Celestial Being.<br/><br/>How dare it act rashly?<br/><br/>…<br/><br/>…<br/><br/>Gu Yang felt the world spin around him, and by the time he recovered, he found himself in a strange place.<br/><br/>This place was in the wild, filled with all sorts of plants and trees.<br/><br/>The first thing he felt was that everything was giant, whether it was the trees or the plants, or even the insects — they all were absurdly huge.<br/><br/>As if he had been shrunk several times.<br/><br/>All of a sudden, his eyes lit up with two golden rays as he used the Candle Dragon’s Divine Power.<br/><br/>He looked around, but found nothing unusual. He was still in the wilderness, surrounded by various plants.<br/><br/>A touch of unease entered Gu Yang’s heart. There were only two possibilities for not being able to discern anything even with the Candle Dragon’s divine power.<br/><br/>One, he was truly transported to a strange world.<br/><br/>The other was that this illusion was too strong that even the Candle Dragon’s divine power could not break it.<br/><br/>Either way means trouble.<br/><br/>He summoned the system, [Do you wish to use the Life Simulator? Each use consumes 100 energy points.]<br/><br/>Seeing that the Life Simulator was still there, his heart settled.\t\t\t\t\t\t</div>", "images": {}, "success": true}