{"id": 356, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132314.html", "title": "Chapter 356 - Chapter 356: 356 Deals", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 356 - Chapter 356: 356 Deals</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 356: 356 Deals<br/><br/>“The power of the law, huh?”<br/><br/>Gu Yang held the silver-white bow in his hand, feeling its incomprehensible weight, as if he were holding a mountain. He could barely lift it using the divine power of the Divine Ape.<br/><br/>Such a small bow couldn’t possibly be this heavy.<br/><br/>The only explanation was that this bow contained the power of the law, or according to Great Zhou, it’s Dao infusion.<br/><br/>The difference between spirit tools and magic treasures lies in the Dao infusion, a mysterious force.<br/><br/>Only when one reaches the Celestial Being realm can this force be understood.<br/><br/>Different realms grasp different essence of power.<br/><br/>In the Mortal Realm, it’s the True Qi.<br/><br/>In the Divine Power realm, it’s the True Essence Mana.<br/><br/>Upon reaching the Celestial Being Realm, one would comprehend the Dao infusion, which is the power of the law.<br/><br/>Therefore, the Celestial Being Realm can also be called the Immortal Realm.<br/><br/>Spirit tools involve Dao infusion, and only those in the Celestial Being realm or higher can truly harness its power.<br/><br/>Nowadays, with the Way of Heaven dying, the Dao infusion in spirit tools has gone dormant, rendering them far less powerful than in ancient times.<br/><br/>That’s why Gu Yang could use brute force to lift this bow. But in ancient times, such a thing would not have been possible.<br/><br/>However, merely lifting it was of little use. Using it to hit people was even less efficient than a giant hammer.<br/><br/>With a thought, he switched to Taiyin Youying’s divine power. The once impervious Silver Bow suddenly changed its “attitude”, allowing him to infuse his mana into it.<br/><br/>As he poured in more and more mana, the Silver Bow began to glow in silvery light.<br/><br/>On the side, the astounded Elf Queen, the High Priest, and Eve all had surprisingly colorful expressions upon seeing this.<br/><br/>After ten thousand years, the Moon God’s Bow was shining brightly again.<br/><br/>The three women had mixed feelings.<br/><br/>Eve was excited.<br/><br/>The Elf Queen was shocked and uneasy.<br/><br/>The High Priest bowed deeply and said, “Mr. Gu Yang, although I don’t know why you possess the power of our lord, it’s clear that you are chosen by him. Eve must have told you about the predicament of the Elf Clan. We hope that you can help save the Elf Mother Tree.”<br/><br/>She did not mention anything about the chosen one.<br/><br/>Gu Yang was happy with that. If she had knelt down then and there, recognizing him as the chosen one of the Elf Mother God, that would have been quite troublesome. That would mean that she wanted to freeload.<br/><br/>Thinking that by giving him a title, they can ask him to risk his life to help the Elf Clan, where could there be such a good deal?<br/><br/>Gu Yang retracted his mana, and the glow from the Silver Bow in his hand receded. He said, “I will take a look, but I can’t guarantee if I can help.”<br/><br/>With that, he returned the Silver Bow to its original place.<br/><br/>No reward without labor. It wasn’t right to take someone’s things without helping.<br/><br/>Once he had dealt with the enemies of the elves, they would hardly dare to refuse him anything he wanted, would they?<br/><br/>…<br/><br/>Gu Yang followed the High Priest and the Elf Queen to the Elf Mother Tree.<br/><br/>The Elf Mother Tree was not as large as he had imagined, paling in comparison to the bodies of Saint Chaoyang and Red Moon Great Saint in Paradise.<br/><br/>The bodies of those two Celestial Beings were nearly ten thousand meters high, taller than the highest mountain on Earth.<br/><br/>This Elf Mother Tree was just over a thousand meters high. Still, its branches and leaves were dense and spread wide.<br/><br/>However, its condition was poor, with large areas of yellow leaves and bare branches.<br/><br/>On the trunk, large black spots were evident, continuously seeping black, foul-smelling liquid.<br/><br/>“Indeed, it’s the power of that one from the Red Bright Heaven.”<br/><br/>Gu Yang flew to one of the black spots, sensing a familiar power coming from within.<br/><br/>He was all too familiar with that one from the Red Bright Heaven, and recognized it at once.<br/><br/>His reach was quite far indeed.<br/><br/>“However, what is his purpose in doing this?”<br/><br/>Gu Yang couldn’t help but ponder.<br/><br/>With the power of that one from the Red Bright Heaven, it should not be difficult to cause this tree’s death since his power had infiltrated the Elf Mother Tree.<br/><br/>But he was only slowly eroding the Mother Tree, allowing its condition to gradually deteriorate.<br/><br/>This implied that he had another sinister scheme in play.<br/><br/>The Elf Mother Tree was crucial to the Elf Clan, and one might even say it was the mother of all elves.<br/><br/>Because every elf grew from the body of the Mother Tree.<br/><br/>The elf race reproduces asexually, having only females and no males. The continuation of the race completely depends on the Elf Mother Tree.<br/><br/>As for details on how elves reproduce exactly, Eve did not elaborate.<br/><br/>However, she did suggest that elves are reproductively isolated from other races, like humans, and are incapable of producing offspring.<br/><br/>If something were to happen to the Mother Tree, it would mean a crisis of extinction for the Elf Clan.<br/><br/>…<br/><br/>As Gu Yang gazed into the distance, the three elves on the side watched him nervously.<br/><br/>Eventually, the High Priest asked, “Mr. Gu Yang, what do you think?”<br/><br/>Gu Yang responded with a question, “If you send someone to the Divine State to find the Extreme Sun Nail, which is the trunk of the Mother Tree, will that save the Mother Tree?”<br/><br/>The High Priest shook her head, “That is the last resort. Cutting down the Mother Tree and leaving only the unpolluted roots, a new Mother Tree would grow from that trunk. However, it would take a thousand years for the Mother Tree to mature and breed new elves.”<br/><br/>Gu Yang asked again, “Do you know what power is polluting the Mother Tree?”<br/><br/>“This power is extremely evil, it should come from the abyss, but I’m not sure which layer of the abyss it belongs to the lord.”<br/><br/>At this moment, the Elf Queen finally couldn’t help asking, “Can you save the Mother Tree?”<br/><br/>Gu Yang looked at the three elves in front of him who were anxiously waiting for his answer and said, “I only have sixty percent confidence.”<br/><br/>The High Priest and the Elf Queen couldn’t hide their sheer joy at his response.<br/><br/>Until now, they had sought help from many legendary powerhouses, mages, spellcasters, knights, and legends of various races. Everyone who had examined the Mother Tree concluded they had no solution.<br/><br/>Even a sage as ancient as the Wind Sage was helpless.<br/><br/>They were on the verge of giving up hope, and now, finally, they had found someone who said they could help.<br/><br/>They didn’t care that Gu Yang only had sixty percent certainty. Even twenty percent would have been better than sitting by, watching the Mother Tree wither and die.<br/><br/>Moreover, the one who said this was the favored one of the Mother God, which made his words all the more reliable.<br/><br/>Although the High Priest and the Elf Queen deliberately avoided mentioning Gu Yang’s identity as the chosen one, they recognized him as such the moment he picked up the Bow of the Moon God.<br/><br/>However, for practical reasons, they could never admit this. Otherwise, it would perhaps tear the Elf Clan apart.<br/><br/>The High Priest seriously said, “Mr. Gu Yang, as long as you can save the Mother Tree, I am willing to present you with the Bow of the Moon God.”<br/><br/>Deal!<br/><br/>Gu Yang silently commended her for offering this – naturally, the better.<br/><br/>A spiritual treasure is priceless. Even if used as a recharge, it is worth at least a thousand energy points, which is not bad at all.<br/><br/>“Deal.”<br/><br/>…<br/><br/>…<br/><br/>After reaching an agreement, Gu Yang didn’t rush to act. Instead, he called Eve over and whispered something to her.<br/><br/>To prevent eavesdropping, he used some mana to isolate them from the outside world.<br/><br/>Upon hearing his words, Eve’s face changed, and she instinctively looked at her elders.<br/><br/>The elites of the Elf Clan had almost all arrived after realizing that the High Priest had brought Gu Yang here.<br/><br/>There were more than twenty elves, nearly half of which were legends. Even those who weren’t legends held high positions in the royal court due to their seniority.<br/><br/>It was fair to say that almost all of the core figures of the Elf Clan were present.<br/><br/>All of these people were elder to Eve, and she was the youngest and least senior among them.<br/><br/>Though she found it hard to believe emotionally, that these elders would do something harmful to the elves, she was unable to resist Gu Yang’s command.<br/><br/>She could only make up an excuse to leave the space with Gu Yang and went to a deserted place to use a legendary illusion technique.<br/><br/>She did not master this spell, but fortunately, her mother had just given her a couple of scrolls for self-protection, one of which was an illusion technique.<br/><br/>Then, the real Gu Yang concealed his breath and stayed in the original place.<br/><br/>Eve took Gu Yang’s illusion back to the Mother Tree.<br/><br/>A legendary illusion technique could make a copy identical to the origin, even with the same strength, which was flawless to anyone.<br/><br/>Gu Yang’s illusion came to the Mother Tree, put his hand on the black spot that continuously oozed black fluid, and a red flame began to burn, burning a large hole in the trunk.<br/><br/>Phoenix True Flame!<br/><br/>A short distance away, all the senior members of the Elf Clan nervously watched his movements.<br/><br/>When the Mother Tree was contaminated by an alien energy, they had once thought of cutting off the contaminated part.<br/><br/>However, it was useless. The alien energy was like a living creature, which could freely transfer to other parts.<br/><br/>In the end, they found that unless they were to cut down the entire Mother Tree, there was no way to completely remove the alien energy.<br/><br/>This alien energy was very strange. Neither divine power nor any kind of magic could remove it.<br/><br/>Now, under the burning of the red flame, with a sizzling sound, a hole was burned in the trunk of the Mother Tree.<br/><br/>At the same time, the black spot was completely burned away.<br/><br/>The alien energy completely disappeared.<br/><br/>Upon seeing this, not only the Elf Queen and the High Priest, but most of the senior elves had sparks of excitement in their eyes.<br/><br/>The Mother Tree was finally saved!<br/><br/>May the Mother God bless us!<br/><br/>As long as the alien energy could be removed, given the vitality of the Mother Tree, it would recover in no time.<br/><br/>There were more than a dozen foreign energies in the Mother Tree.<br/><br/>Next, they waited for the human to clear them one by one….<br/><br/>Just then, two powerful waves of energy simultaneously appeared.<br/><br/>Legendary magic, Dimensional Exile!<br/><br/>Legendary magic, Disintegration Spell!<br/><br/>The target was Gu Yang.<br/><br/>A spatial rift appeared next to him, and at the same time, the Disintegration Spell tore through all his defenses, blasting him into the dimensional space and disappearing.<br/><br/>This unexpected event caught everyone off guard. Even the High Priest and the Elf Queen didn’t have time to react, they could only watch as Gu Yang was banished to the dimensional space.<br/><br/>The Elf Queen was shaking with anger and disbelief, “Anna! Kelly! What are you doing?”<br/><br/>The Mother Tree was finally about to be saved, and at this critical moment, it was actually betrayed by their own clan, dashing their only hope of saving the Mother Tree.<br/><br/>She could hardly believe that anyone could betray their own clan.<br/><br/>Not just her, everyone else present couldn’t believe it either. Looking at the two people who had just attacked Gu Yang, their hearts were filled with extreme anger.\t\t\t\t\t\t</div>", "images": {}, "success": true}