{"id": 351, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132303.html", "title": "Chapter 351 - Chapter 351: 351 Recognizing The Master", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 351 - Chapter 351: 351 Recognizing The Master</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 351: 351 Recognizing the Master<br/><br/>As Gu Yang was about to start a simulation, he felt a sudden jolt in his heart. Whirling around at once, the Phoenix Feather Knife had already appeared in his hand.<br/><br/>Standing behind him was a robust man clad in beast skin, holding a large bone club that glowed eerily in the sunlight, the origin of the bone unknown.<br/><br/>The man was strong, not as exaggerated as Wei Hao, but Gu Yang still felt an immense pressure from him.<br/><br/>“Are you a human or a monster?”<br/><br/>The man stared at him with an odd gaze, his face full of curiosity. “You smell like a human, but why do you bear the bloodline of a divine beast?”<br/><br/>“You smell not like the Monster Race either. Very strange indeed.”<br/><br/>The man’s accent was strange, his voice brusque.<br/><br/>Upon seeing the man’s appearance, temperament, and outfit, Gu Yang abruptly hatched a suspicion and couldn’t help but ask, “Could you be Qing Hao?”<br/><br/>“Huh, how do you know my name?”<br/><br/>The man in beast skin questioned, but quickly shrugged the query off. “Never mind, let’s spar. You seem pretty formidable.”<br/><br/>So it was a test.<br/><br/>Upon hearing his words, Gu Yang instantly understood.<br/><br/>Qing Hao, that was the name of the Human Emperor.<br/><br/>The man before him was the Human Emperor, or more accurately, the young version of the Human Emperor before he claimed his title.<br/><br/>After all, once he became the Human Emperor, who knows how powerful he would have become? He certainly wouldn’t look like he does now.<br/><br/>…<br/><br/>As soon as Qing Hao finished speaking, he lifted his violently large bone club and swung it towards Gu Yang.<br/><br/>“Hold on!”<br/><br/>Gu Yang had no intention of retaliating. He raised his hand to stop Qing Hao.<br/><br/>Whoosh—<br/><br/>The bone club came to a halt above his head, the resulting wind messing up his hair.<br/><br/>He tilted his head, looking rather impatient. “Can we finish our conversation after the fight?”<br/><br/>Seeing that Qing Hao had managed to stop in the nick of time, Gu Yang breathed a sigh of relief, growing more confident in his plan.<br/><br/>He wasn’t sure if he had passed the test during the last simulation, but most likely he hadn’t. Otherwise, he wouldn’t have been so powerless before the Celestial Being.<br/><br/>With his current strength and the Human Emperor’s sword, he should at least have been able to escape from the Celestial Being, right?<br/><br/>He speculated that during the simulation, he must have fought Qing Hao and lost.<br/><br/>It would be strange if he could defeat the Human Emperor, even a young one. So, he did not gain the recognition of the Human Emperor’s sword.<br/><br/>More importantly, Gu Yang just learned some crucial information. Even the Xia Emperor had not received the approval of the Human Emperor’s sword.<br/><br/>The Xia Emperor was a formidable figure, arguably the strongest among the Celestial Beings. With his nine divine beast avatars plus his own body, a fight against him was basically ten against one. Who could match him in the same realm?<br/><br/>Even the Xia Emperor failed the test. He must have sparred with Qing Hao, and the result was obvious.<br/><br/>Gu Yang felt the chance of defeating Qing Hao was slim.<br/><br/>So, combat was clearly not the way to pass this test.<br/><br/>Facing Qing Hao’s impatient countenance, he asked a piercing question, “No matter how strong you are, can you defeat the emperor of the Monster Race?”<br/><br/>Qing Hao snorted, clenching his fist and filled with fighting spirit. “I may not be able to defeat him now, but I grow quickly. In the future, I’ll make the Monster Emperor lose his teeth.”<br/><br/>Gu Yang responded, “Even if you become stronger, how many Monster Emperors can you defeat on your own?”<br/><br/>The Monster Race certainly had more than one emperor. It was said in ancient legends that not long after Human Emperor killed the Monster Emperor Lei, he was injured by another Monster Emperor, Taiyi, and soon passed his throne to the second Human Emperor, the one who forged the Nine Divine Cauldrons.<br/><br/>Plus the Phoenix, the Monster Race had at least three emperors. It was still unknown whether the Monster Race had any other emperor after the Phoenix.<br/><br/>As expected, Qing Hao’s brows furrowed, and he looked at Gu Yang suspiciously. “Why are you babbling about this?”<br/><br/>Seeing that he was willing to talk, Gu Yang felt that he had already succeeded halfway. He replied, “The Human Race is weak, living under the Monster Race, living a life where each day might be our last, treated as food by the Monster Race just like cattle and sheep.”<br/><br/>This was what he had learned from history.<br/><br/>“To change this tragic fate, relying on you alone is not enough. Firstly, we need to unite all the people of the Human Race…”<br/><br/>Gu Yang flexed his eloquent tongue, commencing his art of persuasion.<br/><br/>Thankfully, he had read a lot about history recently, especially about the era of the Three Emperors in ancient times.<br/><br/>The Three Emperors are the Human Emperor, Emperor Fu, and Gold Emperor.<br/><br/>These three have established the current status of the Human Race.<br/><br/>Before the era of the Three Emperors, it was the era of barbarism, when the human race’s circumstances were precarious and its place in the world was no better than that of cattle and sheep, owing to their inherent weakness.<br/><br/>Gu Yang, who properly underwent nine years of compulsory education, can easily bamboozle a primitive man.<br/><br/>The more Qing Hao listened, the more engrossed he became, his eyes eventually gleaming.<br/><br/>…<br/><br/>“…To sum it up, first you have to solve the problem of food, and I can teach you how to farm. Then conquer a piece of land and focus on farming. Establish a school for all children to receive education; those who can learn martial arts should do so, and those who can’t should learn literature…”<br/><br/>While Gu Yang was passionately speaking, Qing Hao abruptly interrupted him, “How can the Human Race develop and thrive in the current Divine State?”<br/><br/>Here comes the drama!<br/><br/>When Gu Yang saw him asking about Great Zhou, his eyes lit up.<br/><br/>Clearly, this “Human Emperor” was likely a manifestation of the Primordial Spirit of the Human Emperor’s Sword. His query about the current state of the Divine State indicates that he has already passed the initial test of the Primordial Spirit.<br/><br/>Gu Yang said, “The biggest problem of the Human Race is its fragmentation. The first step is to unite the entire Human Race, eliminate internal disputes, and then establish various systems…”<br/><br/>Then he launched into an extended discourse.<br/><br/>Finally, he concluded, “However, to unify the Human Race, you need a great deal of power. Please lend me your strength.”<br/><br/>“Qing Hao” stared at him, shook his head and said, “You have strategies and know how to govern a state, but you are not a king.”<br/><br/>“Like the one before you, your personal cultivation is more important to you than the future of the Human Race.”<br/><br/>Er…<br/><br/>There was indeed no refuting that. After all, Gu Yang was a Transmigrator. How could he possibly have the spirit of absolute devotion and sacrifice for the Human Race in this alternate world?<br/><br/>Still unwilling to give up, Gu Yang said, “Still, you have no other choice, do you?”<br/><br/>Qing Hao stayed silent.<br/><br/>“With the emergence of Yao Chi Immortal Palace, the whole world will experience a catastrophic disaster. The high and mighty immortals, would they care about the lives of ordinary people? When the time comes, it will be complete devastation.”<br/><br/>Gu Yang, having seen the “future”, was extremely certain.<br/><br/>Although he didn’t know why Yao Chi Immortal Palace was acting out and slaughtering all the forces without restraint, it was something that was inevitable.<br/><br/>From the Great Zhou to the Four Great Sacred Lands, to the Guanghan Immortal Palace, Shuiyue Cave Heaven, Golden Court, Ruiqin Continent…<br/><br/>Yao Chi Immortal Palace had gone on a killing spree in all these places.<br/><br/>When the immortals fight, it’s the mortals who suffer.<br/><br/>In the process, how many ordinary people will lose their lives unjustly?<br/><br/>The scariest thing is, if Yao Chi Immortal Palace strikes at the Yellow Springs and is unable to eliminate all those bizarre creatures, then the joke would be on us.<br/><br/>And the final outcome would be the extinction of the human race.<br/><br/>Suddenly, Qing Hao disappeared, and everything before Gu Yang’s eyes collapsed.<br/><br/>The scene changed, and Gu Yang found himself back at the Heavenly Altar. Qing Hao’s voice echoed in his ear, “I can lend you a small part of my power. Do as you wish.”<br/><br/>It worked!<br/><br/>A smile spread across his face as he lifted the Human Emperor’s Sword from the ground.<br/><br/>Boom!<br/><br/>A bolt of terrifying thunder fell from the sky.<br/><br/>His gigantic sword glowed a golden light, and its shape changed into a regular-sized long sword with a simple and unostentatious blade.<br/><br/>Wei Hao, standing aside, joyfully said, “Congratulations, Your Highness, for taming the Human Emperor’s Sword. The unification of the world and becoming the supreme leader of mankind are just a matter of time.”<br/><br/>…<br/><br/>On the other hand, the Lord of the State, seeing the transformation of the Human Emperor’s Sword, felt as if he had been struck by a heavy hammer in his chest. He had difficulty breathing and spat out a mouthful of blood on the spot.<br/><br/>Why?<br/><br/>Why did even the Human Emperor’s Sword acknowledge him as its master?<br/><br/>He felt as if his world was collapsing.\t\t\t\t\t\t</div>", "images": {}, "success": true}