{"id": 357, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132315.html", "title": "Chapter 357 - Chapter 357: Do You Need Help?", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 357 - Chapter 357: Do You Need Help?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 357: Do you need help?<br/><br/>Anna is the highest-ranked Druid among the Elf Clan, a legendary second-order. She is also the leader of the Druid lineage, holding a significant position within the Elf Clan.<br/><br/>In the Elf Clan, there are roughly four factions: Priest, Mage, Druid, and Warrior.<br/><br/>The legendary magic just now, Dimension Banishment, was released by her, using a scroll.<br/><br/>The other, Kelly, is a legendary second-order Mage with an equally high status. That Disintegration Spell was her handiwork.<br/><br/>In response to the Elf Queen’s questioning, Anna did not back down and loudly declared, “Your Majesty, our Elf Clan has been nestled in the Misty Forest for ten thousand years.”<br/><br/>“Initially, the number of elves who retreated to the Misty Forest exceeded one million. What about now? The entire Elf Clan population is less than a hundred thousand.”<br/><br/>“We are trapped in this small region with our population continuously decreasing and our overall strength becoming weaker and weaker. In another thousand years, even without the half-beastmen attacking, our Elf Clan would have already walked towards its extinction.”<br/><br/>“Your Majesty, for ten thousand years, don’t you see this path is leading nowhere? Only through drastic change will our Elf Clan gain a new life.”<br/><br/>Elf Queen Hilarya, hearing her insubordinate words, was stunned and furious, “Traitor, you dare betray the Mother God and our race?”<br/><br/>Anna calmly said, “If the Mother God still existed, why would she let us fall to such an extent? Wake up. The Twilight of the Gods has been going on for ten thousand years already. The human’s Churches of the Gods have long been snatched away by those half-Gods. Did any God ever impose Divine Punishment?”<br/><br/>Speaking, she pointed to the position where Gu Yang had just disappeared, “That follower of the Mother God, we banished him to another dimension. Did the Mother God have any reaction?”<br/><br/>“The Gods have been sleeping for ten thousand years, how many times have they responded to our believers’ prayers?”<br/><br/>“We can no longer rely on the Gods. We need to find our own path—”<br/><br/>“You dare blaspheme the Mother God!”<br/><br/>Seeing her increasingly audacious speech, the Elf Queen could no longer hold it in, and she waved her wand, releasing a legendary spell, Liberate Lightning.<br/><br/>A red bolt of lightning struck Anna, instantly piercing seven or eight shields on her body.<br/><br/>The wand in the Elf Queen’s hand, named Wand of the Queen, is an ultimate artifact. With this wand in hand, she has become a legendary third-order mage as it allows her to be one rank higher.<br/><br/>Upon receiving such a blow, Anna’s face revealed a smile, saying, “Succeeded!”<br/><br/>Kelly, who had kept her silence, had her eyebrows emit a black glow, illuminating the sky, and a Spatial Gate emerged out of thin air.<br/><br/>Then, a huge black dragon head emerged from the Spatial Gate.<br/><br/>It was indeed a Dark Dragon.<br/><br/>…<br/><br/>Everyone present was greatly shocked, “How is this possible?”<br/><br/>In the Elf Royal Court, a significant lock was in place, sealing the space. Within this range, it was impossible to open a Spatial Gate.<br/><br/>Unless it was a situation of ultra-long-distance teleportation as Eve had previously done and also granted permission by the master lock, it was possible.<br/><br/>But now, Kelly forcibly opened a Spatial Gate!<br/><br/>The control of the lock has always been in the hands of the Elf Queen. How did she do it?<br/><br/>“You, did you conspire with the Dark Dragon?”<br/><br/>The lead priest’s face changed dramatically.<br/><br/>The Dark Dragon worships the Lady of Darkness, the sworn enemy of Mother God.<br/><br/>As high-ranking figures of the Elf Clan, Anna and Kelly had colluded with the Dark Dragon to open a Spatial Gate and teleported them into the Elf Royal Court.<br/><br/>She utterly couldn’t understand why they would do such a crazed thing?<br/><br/>Although the usual words and actions of the two were seen as fanatical.<br/><br/>Yet, the High Priestess did not imagine that they would betray their clan, betray the Mother God.<br/><br/>And they betrayed so thoroughly.<br/><br/>A dreadful thought surfaced in her mind, “Did you cause the Mother’s Tree to become like this?”<br/><br/>As Anna gazed at the lead priest, a hint of guilt flashed in her eyes, followed quickly by a black sparkle in her pupils. Her expression immediately firmed up, “Only in this way can the Mother’s Tree be reborn. Hereafter, the number of newborns in the Elf Clan each year will be ten times that of the past. These are all necessary experiences for the resurgence of the elves.”<br/><br/>“Madwoman!”<br/><br/>The lead priestess grief-stricken. She could never have imagined that Anna would go to such lunatic extremes.<br/><br/>In her profound anger, she pointed her Wand.<br/><br/>Legendary Divine Magic, Divine Punishment!<br/><br/>With a rumble, all the remaining shields around Anna shattered, and a mighty willpower was about to shatter her spiritual power in an instant.<br/><br/>Just at that moment, a black mist rose from her body, enveloping her spiritual power, enabling her to withstand this terrifyingly dreadful divine magic.<br/><br/>At the same time, the dark fog also dissipated.<br/><br/>“Evil God?”<br/><br/>The High Priest’s heart sank, finally discovering the mastermind behind all of this.<br/><br/>So, it turned out to be an Evil God.<br/><br/>…<br/><br/>At this time, within the Spatial Gate, dark dragons kept emerging, every one of them legendary.<br/><br/>Dragons, in the West Bank Continent, stand at the top of the food chain and are the most representative super-magical beasts.<br/><br/>The Dark Dragons, who live underground, are the most corrupted branch of the dragon race, unacknowledged by the dragon clan. They are violent by nature, evil and chaotic in their stance, and extremely powerful.<br/><br/>We are already struggling to deal with one super magical beast, and now suddenly, over a dozen have appeared.<br/><br/>Probably all the mature Dark Dragons on the West Bank Continent are here.<br/><br/>This is a terrifying force that could destroy the entire Elf Clan.<br/><br/>The elf executives present are like facing a formidable enemy, everyone knows that the Elf Clan is at stake.<br/><br/>War is on the verge of breaking out.<br/><br/>…<br/><br/>“Mas… ter… we should… leave…”<br/><br/>Not far away, in a tree house, Henry saw over a dozen dark dragons flying out of the Spatial Gate, his legs trembling, stuttering.<br/><br/>The wise elder of the wind tribe, his face full of wrinkles, even more so now, said, “We can’t leave now.”<br/><br/>The Elf Queen had already activated the mythic lock, cranking it up to full power. Even if he wanted to leave now, he couldn’t.<br/><br/>If he forcibly broke the mythic lock, never mind if it was possible or not, causing a chain reaction could lead to the collapse of the Elf Clan.<br/><br/>Of course, he had no intention of helping the Elf Clan. After all, there were a dozen Dark Dragons; who could stand up to their dark breath?<br/><br/>The wise elder of the wind tribe still adhered to his usual neutrality!<br/><br/>There was another important reason he hadn’t left.<br/><br/>He always felt that the human who could summon the Phoenix would not die so easily.<br/><br/>Although most legendary figures banished to a different dimension would get lost and eventually die.<br/><br/>But how could a legend who can summon the Phoenix die so easily?<br/><br/>…<br/><br/>After Anna escaped the fatal blow, she took the opportunity to fly to the sky, standing with those dozen dark dragons.<br/><br/>With her was Kelly.<br/><br/>At this time, the pupils of the two became darker, and their bodies’ aura also changed. They became more powerful, no longer peaceful and elegant but more evil and brutal.<br/><br/>In the blink of an eye, Anna’s momentum surged, reaching the third level of legend. She looked down at all the elves down below and said, “Hilarya, Regina, for the rebirth of the Elf Clan, please die!”<br/><br/>Suddenly, the dozen dark dragons behind her launched an attack all at once.<br/><br/>Dark Breath!<br/><br/>The simple attack they used was extremely frightening, instantly piercing the mythic lock.<br/><br/>The elf legends below, assisting the Elf Queen, jointly set up a huge shield. It only lasted for two breaths, then it broke.<br/><br/>In the next moment, everyone was engulfed by the breath.<br/><br/>After everything passed, only the Elf Queen and the High Priest were left standing. They were badly injured in the attack, their clothes in tatters.<br/><br/>The others were even more miserable, all severely injured.<br/><br/>This breath almost wiped out the executives of the Elf Clan.<br/><br/>…<br/><br/>Deep in Anna’s eyes, there was only a cold killing intent. She coldly said, “Shall we kill them?”<br/><br/>The Dark Dragons behind her were preparing to spit out their breath again.<br/><br/>“Do you need help?”<br/><br/>At this moment, a sudden voice rang out.\t\t\t\t\t\t</div>", "images": {}, "success": true}