{"id": 360, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132321.html", "title": "Chapter 360 - Chapter 360: 360 Phoenix Club", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 360 - Chapter 360: 360 Phoenix Club</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 360: 360 Phoenix Club<br/><br/>The Elf King’s Court today is filled with joy and laughter, much like a festive celebration. A grand bonfire party is being held in front of the square.<br/><br/>For the elf clan, this is a day worth celebrating.<br/><br/>Firstly, the Mother Tree of the elves has finally been rescued.<br/><br/>Secondly, they have gained another Mother Tree.<br/><br/>Thirdly, and most importantly, the new Mother Tree is the lost one for over ten thousand years.<br/><br/>In the era of the Elfin Empire, the Elf Clan possessed two Mother Trees.<br/><br/>These two trees were the source of the Elf Clan.<br/><br/>Latterly, when the Elfin Empire collapsed, the surviving elves were only able to carry away one Mother Tree and the other was cut down by humans.<br/><br/>After the elves retreated to the Misty Forest, the last male elf born naturally died, and it has been exactly ten thousand years since then.<br/><br/>From then on, the Elf Clan became a species reproducing unisexually, and no male child was born ever since.<br/><br/>Now, another Mother Tree capable of giving birth to male children has finally returned to the Elf Clan.<br/><br/>For them, this is fantastic news.<br/><br/>After ten thousand years, the Elf Clan finally welcomed a male child again.<br/><br/>The High Priest performed a baptism for the newborn male child named William in front of thousands of clansmen.<br/><br/>For a moment, thousands of elves cheered jubilantly.<br/><br/>It can be foreseen that in the next hundred years, the population of the Elf Clan will experience explosive growth.<br/><br/>Previously, the population of the elves was limited to the productivity of the Mother Tree.<br/><br/>Now, with an additional Mother Tree, the productivity has increased.<br/><br/>Plus the appearance of males, the Elf Clan can now increase its population through natural conception.<br/><br/>For the disaster-ridden elves, there is no better news than this.<br/><br/>…<br/><br/>Gu Yang didn’t join in the festivities. He was studying the Bow of the Moon God.<br/><br/>This bow, referred to as the ultimate artifact in the West Bank Continent, is a weapon used by gods, and only Half Gods can exert its power.<br/><br/>This thing is quite unique. It only recognizes the power of Taiyin Youying, and if the power is replaced, it won’t work properly.<br/><br/>Moreover, the consumption required to draw this bow is gigantic. He tried it once and found that to fully draw it, all the power of Taiyin Youying, once embodied, will be consumed.<br/><br/>As Gu Yang was thinking, he suddenly sensed something and looked up at the front door.<br/><br/>An old voice came, “Roderick, Vice President of Northwest Mage Alliance from the West Bank Continent, seeks an audience, sir.”<br/><br/>The individual standing outside was a being at the Unleaking Realm, Level Three.<br/><br/>Moreover, the person was not an elf, but a human mage.<br/><br/>By day, he had just arrived here. With the divine power of Clairaudience and Clairvoyance, he scanned the surrounding area and found this person’s presence.<br/><br/>The Northwest Mage Alliance, as Gu Yang recalled, was mentioned by Eve. It’s one of the three major mage forces among human beings.<br/><br/>Gu Yang opened the door and smiled, “It’s an honor to have distinguished guests.”<br/><br/>The visitor was the Sage of the Wind. He was dressed in a white robe, wearing a pointy magic hat, holding an exquisite magic wand, and was very formally dressed.<br/><br/>Upon meeting, he performed a formal Mage’s courtesy.<br/><br/>Gu Yang also reciprocated with a bow, following the etiquette of martial artists of Great Zhou Region, and said, “Please have a seat.”<br/><br/>The Sage of the Wind sat across from him and smiled, “I hope you’d forgive my intrusion at this late hour.”<br/><br/>“I wonder what brings you here, sir?” Gu Yang, who doesn’t like pleasantries, asked the point-blank question.<br/><br/>“Please allow me to set up a small soundproof barrier.”<br/><br/>The Sage of the Wind manipulated his magic wand to set up a magic spell inside the room.<br/><br/>Gu Yang did not stop him, waiting for him to continue speaking.<br/><br/>“Do you know about the Phoenix Club?”<br/><br/>So it’s related to the Phoenix.<br/><br/>It piqued Gu Yang’s interest. Lily comes from a certain organization related to the Phoenix in the West Bank Continent, likely this Phoenix Club.<br/><br/>The Phoenix Gall given to him by Lily was of great help to him.<br/><br/>He was always curious about this force.<br/><br/>Unfortunately, his visit to the West Bank Continent this time was short, for at most one day. According to the original plan, he would leave with Eve at dawn the next day.<br/><br/>Therefore, he hadn’t considered inquiring about the affairs of the Phoenix Club.<br/><br/>Unexpectedly, someone showed up at his door, voluntarily bringing up the Phoenix Club.<br/><br/>Gu Yang shook his head, “Never heard of it.”<br/><br/>The Sage of the Wind was not surprised and introduced, “The Phoenix Club has a long history, established for over ten thousand years, and our ideal is…”<br/><br/>Gu Yang waited for him to finish before pulling the conversation back on track, “So, you’re here for the Phoenix?”<br/><br/>“Exactly.”<br/><br/>The Sage of the Wind acknowledged the point raised and no longer beat around the bush, he said, “I won’t hide it from you, the reason why our Phoenix Club is named after the Phoenix is because our founding leader was a devout believer of the Phoenix–”<br/><br/>“Believer?”<br/><br/>Gu Yang interrupted him.<br/><br/>In the context of the West Bank Continent, the term “believer” refers specifically to those who have faith in gods.<br/><br/>So, does this imply that the Phoenix is a god?<br/><br/>The Sage of the Wind confirmed, “Yes, a believer. The Phoenix of that time was an ancient god. Then, the founding leader ignited the divine fire, held high the God’s Throne and became a True God.”<br/><br/>“But soon, the Twilight of the Gods came. The founding leader fell into a deep sleep very quickly. Many of the treasures of the Phoenix Club were stored in his god kingdom and cannot be retrieved to date. Among them, a few artifacts are of utmost importance to the Phoenix Club.”<br/><br/>“So, my visit this time is to seek your help. Your pet Phoenix can help us open the door to the god kingdom. Once the task is completed, I can give you a drop of Phoenix’s Divine Blood.”<br/><br/>Phoenix’s Divine Blood!<br/><br/>Gu Yang was moved slightly. This should be the essence blood of the Phoenix.<br/><br/>This person is not simple. He can actually guess that he needs this item.<br/><br/>He pondered for a moment, not committing to an answer just yet. “Alright, let me think about it and give you an answer tomorrow morning.”<br/><br/>“Okay.”<br/><br/>The Wise One of the Wind rose immediately and left.<br/><br/>…<br/><br/>Gu Yang launched the system.<br/><br/>[Do you want to use the Life Simulator? To use it once, it will cost two hundred energy points.]<br/><br/>The cost had increased significantly after breaking into the second level of the Unleaking Realm, to two hundred points, which was quite painful.<br/><br/>“Yes.”<br/><br/>[At the age of twenty-three, having reached the second level of the Unleaking Realm, you journeyed to the West Bank Continent and helped the Elf Clan heal the Mother Tree, becoming a devotee of the Moon God.]<br/><br/>[You have slain fifteen gigantic dark dragons. Your reputation as a dragon slayer has echoed throughout the entire West Bank Continent.]<br/><br/>[You stayed in the elven king’s court and cultivated intensely. Two months later, a dragon from the Celestial Being Realm attacked. With the lock of the court and tens of thousands of elves praying together, the chief priest summoned an angel at the cost of his life and repelled the dragon.]<br/><br/>[At a critical moment, an evil god descended. You teamed up with the angel to kill the avatar of the evil god. The angel, overly worn out, dissipated immediately.]<br/><br/>[After that battle, you led some legendary powerful elves to strike out in all directions, eliminating all threats within the Misty Forest.]<br/><br/>[Five years later, a major event occurred in the human kingdom. The evil god descended, and the entire continent was engulfed in war.]<br/><br/>[Three years later, a human kingdom sought help from the elves, but you declined.]<br/><br/>[After another ten years, the last human kingdom was defeated. The remnants of their army retreated into the Misty Forest. The elves took them in.]<br/><br/>[A year later, the evil god launched a full-scale attack and soon overran the elven court.]<br/><br/>[You managed to escape the West Bank Continent with Eve before the attack, returning to the Divine State. As soon as you appeared, you were pursued and killed by the celestial beings. You met your end at the age of forty-two.]<br/><br/>Gu Yang was somewhat astonished. The West Bank Continent truly was his blessed place.<br/><br/>He had managed to hang on for nineteen years there.<br/><br/>Although eventually vanquished by the evil god, the fact he could last for so long was beyond his expectation.<br/><br/>Although the Elf Clan wasn’t a particularly strong force on the West Bank Continent, they still had a strong foundation. If fully prepared, they could withstand an attack from a Celestial Being.<br/><br/>He had profited quite a bit from this.<br/><br/>Indeed, good deeds do not go unrewarded. Today, he saved the senior members of the Elf clan and rendered them a significant favor.<br/><br/>Only after this, were they willing to risk their lives for him.<br/><br/>The most remarkable was the high priest, who summoned an angel at the cost of his life. The angel had to be of the Celestial Being Realm at least.<br/><br/>Coming to the West Bank Continent was the right decision.<br/><br/>As for the Phoenix Society’s matters, he chose not to consider them for now. Knowing that a powerful Celestial Being had set his sights on him and still running around recklessly would be no different from courting death.<br/><br/>Each round in the simulator now required two hundred energy points. He had to use them sparingly.<br/><br/>He would reconsider it once he possessed the power to match a Celestial Being.<br/><br/>[Simulation ended. You can keep one of the following items.]<br/><br/>[One, the Martial Arts realm at the age of forty-two.]<br/><br/>[Two, the Martial Arts experience at the age of forty-two.]<br/><br/>[Three, the life wisdom at the age of forty-two.]<br/><br/>“I choose two.”<br/><br/>Immediately, Gu Yang’s mind was flooded with memories of many battles, as well as experiences and knowledge related to Martial Arts.<br/><br/>In nineteen years time, he acquired a vast amount of knowledge.<br/><br/>…<br/><br/>The next step was to follow this path, repeatedly simulating and accumulating experience.<br/><br/>Most importantly was his enlightenment of the “Taixuan Heavenly Book”.<br/><br/>This heavenly book encompassed everything, profound and extensive. With each simulation, he gained new insights. In a way, he was catching up.<br/><br/>Martial Arts didn’t require much knowledge for cultivation. According to ancient standards, he lacked many elements.<br/><br/>The toughest part was having no one to guide him. He had to explore and gain insights by himself, hence the long learning process.<br/><br/>If he had a mentor to enlighten him, his progress would have been ten times faster.<br/><br/>By the tenth simulation, Gu Yang paused.<br/><br/>Gaining nearly two hundred years’ worth of knowledge at once was too much and too jumbled. He needed to digest it first.<br/><br/>…<br/><br/>…<br/><br/>The next day, Gu Yang went to meet Roderick, the third-tier legendary mage, and said, “I have lots of matters to deal with. I’ll come to you in half a year.”<br/><br/>“Okay.”<br/><br/>The Wise One of the Wind was overjoyed when Gu Yang agreed.<br/><br/>After agreeing on a meeting place for half a year later, the Wise One of the Wind left the elven king’s court with his apprentice, having already said his farewells to the elf queen.<br/><br/>After seeing off Roderick, Gu Yang went to find the elf queen and the high priest, proposing to lead a conquest to eliminate all threats to the elven race within the Misty Forest.<br/><br/>The elf queen and the high priest held a meeting and quickly approved the decision.<br/><br/>And so, Gu Yang set off with five legendary powerful elves from the Elf Clan. The high priest also joined them.<br/><br/>The Misty Forest was vast, a continuous mountain range covering an area equivalent to a medium-sized country in the West Bank Continent.<br/><br/>Many areas within the forest were harsh and inhospitable. Many beasts exceeding their rank made their homes here, calling it home.<br/><br/>In addition to this, there were also other tribes populating the area, like dog-headed humanoids, half-beastmen, gnomes, dwarves, and so forth.<br/><br/>The elves were the largest force in the forest. The threats they experienced came from a group of Komodo Lizard men living underground. This semi-dragon race was powerful and cunning, and they rallied many subordinate groups to act against the elves.<br/><br/>As they lived underground in a complex environment, the lizard men were hard to deal with. The elves, prior to this, were without a solution.<br/><br/>Gu Yang wasn’t bothered by this. He led his group straight into their lair, fighting their way to the deepest part of the cave.<br/><br/>The remaining pet beast of his, the Golden Pupiled Divine Ape, was an expert in wreaking havoc amongst weaker creatures. Those with lower realms simply couldn’t resist his illusions.<br/><br/>Soon, Gu Yang had cleared out the cave, killing two powerful lizard men in the process, causing the lizard men to disintegrate.\t\t\t\t\t\t</div>", "images": {}, "success": true}