{"id": 365, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132331.html", "title": "Chapter 365 - Chapter 365: 365 Star Luo Pocket Universe", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 365 - Chapter 365: 365 Star Luo Pocket Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 365: 365 Star Luo Pocket Universe<br/><br/>“Just like that, he’s dead?”<br/><br/>Yun Qian’s heart was shocked to its core, leaving him clueless about how to react.<br/><br/>He had never imagined that Gu Yang could actually kill the terrifyingly powerful elder in charge of punishment.<br/><br/>After all, according to rumors, his breakthrough to the Unleaking Realm only occurred a month ago.<br/><br/>No matter how formidable his power was or how glorious his past achievements were, how could he be a match for the elder in charge of punishment, who was in the third layer of the Unleaking Realm?<br/><br/>Yun Qian was just moments ago in a tight spot. The appearance of Gu Yang was his last straw.<br/><br/>He just hoped that Gu Yang could fend off the elder in charge of punishment for a while so he could take the opportunity to whisk Yi Yi away, leaving a last sliver of hope for the Heavenly Saint Sect.<br/><br/>The result, however, was that Gu Yang had killed the elder in charge of punishment effortlessly within moments. The elder did not even get a chance to escape.<br/><br/>Yun Qian couldn’t fathom how powerful Gu Yang was.<br/><br/>It should be noted that the elder in charge of punishment was two realms higher than him, and his martial arts was restrained. But he managed to escape in a desperate situation, whereas the elder did not even get a chance to fight back against Gu Yang.<br/><br/>Everything had happened so fast that Yun Qian had not been able to react. He hadn’t even gotten a chance to savour the joy of revenge.<br/><br/>Suddenly, Gu Yang turned his gaze toward him. As his eyes met Gu Yang’s, he subconsciously lowered his head.<br/><br/>It was a mark of respect for the strong.<br/><br/>At this point, Yun Qian no longer had any other thoughts. Faced with such a powerful being, all he could do was cooperate.<br/><br/>After all, Gu Yang had killed the elder in charge of punishment, avenging his deep grudge.<br/><br/>…<br/><br/>Elsewhere, Yi Yi was standing in stupefaction, gazing at the familiar yet strange figure. Recalling the efforts he made over the past year in order to vindicate his past shame, he suddenly felt like a joke.<br/><br/>The showdown from more than a year ago may as well have happened yesterday. Back then, their abilities were on par.<br/><br/>But one year had gone by, and the figure in front of him had surpassed him so much so that he couldn’t even see his back.<br/><br/>The disparity between them was as wide as a gulf.<br/><br/>His feelings were complicated to the point of extremes. His mind was in a whirl, and he did not know what he was thinking about.<br/><br/>…<br/><br/>Gu Yang looked at Yun Qian. “I hope the big secret you spoke of is something valuable to me.”<br/><br/>He came to receive his reward.<br/><br/>Yun Qian, struggling to stand up, told Yi Yi, “You wait for me over there.”<br/><br/>Yi Yi nodded woodenly and walked over to a spot more than ten meters away to wait.<br/><br/>When only the two of them were left, Yun Qian started speaking. “I know the entrance to a Pocket Universe.”<br/><br/>Gu Yang’s eyes lit up. A Pocket Universe indeed held great value.<br/><br/>The premise was that this Pocket Universe was none of those he already knew of.<br/><br/>The entrance of the Pocket Universe is in Star Province,” Yun Qian continued. “You should be aware of the value of a Pocket Universe. In the past, Lin Tianyi achieved the Celestial Being Realm in that Pocket Universe.”<br/><br/>If it’s in Star Province, it definitely isn’t any of the five Pocket Universes he knows.<br/><br/>This was definitely profitable.<br/><br/>A Pocket Universe is a new place to replenish energy.<br/><br/>Right now, be it the Water Moon Pocket Universe, Yellow Springs Pocket Universe, or the West Bank Continent, he had provoked Celestial Being Realm experts. Once he went to these places, there would soon be Celestial Being experts knocking on his door.<br/><br/>In the Golden Court Pocket Universe, it was a bit better. The ruler of Golden Court was open to negotiation. But hunting other countries’ immortals needed time, and time was what he lacked right now.<br/><br/>It was the same in the Ruiqin Continent. He had killed several Beastmasters of the Unleaking Realm. Their teachers must surely remember him.<br/><br/>In the Ruiqin Continent, there existed a teacher-student succession system among Beastmasters. The relationship between the teacher and the student was very tight, similar to the master-student relationship in the Great Zhou.<br/><br/>If a student was killed, most teachers would take revenge.<br/><br/>Especially in his case, having no background in the Ruiqin Continent, there was no burden in killing him.<br/><br/>Hence, the emergence of a new Pocket Universe was definitely good news.<br/><br/>But——<br/><br/>“Isn’t Star Province Chen family’s territory? How could Lin Tianyi have achieved the Celestial Being Realm in a Pocket Universe in Star Province?”<br/><br/>This was a point that Gu Yang was curious about.<br/><br/>Or rather, it was a doubt.<br/><br/>Yun Qian explained, “The histories of the Lin and Chen families are deeply intertwined. Their ancestors were disciples of the same sect. When the Qin Dynasty reigned, the two families were virtually as close as one.”<br/><br/>“It is not surprising that Chen family would inform Lin family when they discovered a Pocket Universe.”<br/><br/>“Moreover, when Lin Tianyi was surrounded and attacked by everyone, the ancestor of the Chen family did not lend a hand. This was not because he ignored the situation. Instead, he was trapped in that Pocket Universe.”<br/><br/>“Without any Unleaking Realm experts left, what could the Chen family use to save the Lin family?”<br/><br/>Gu Yang was aware of the story about the falling out between the Chen and Lin families. However, he didn’t expect there to be such a tale behind it.<br/><br/>He was curious, “How do you know about this secret?”<br/><br/>“To be honest, my Dao companion is a Chen.”<br/><br/>So that was it. No wonder Yun Qian could escape the notice of the Red Moon Great Saint. He took refuge in a powerful faction like the Chen family. Even if he hid in a Pocket Universe, the Red Moon Great Saint’s divine powers couldn’t track him down.<br/><br/>Yun Qian added, “This Pocket Universe, known as the Star Luo Pocket Universe, houses a powerful sect named Star Luo Sect. Its power is formidable.”<br/><br/>“The ancestor of the Chen family has been trapped there for over five hundred years. The Chen family has sent many people into the Star Luo Pocket Universe in an attempt to locate their ancestor, but none have returned.”<br/><br/>“These past several hundred years, the Chen family has been acting very low-key, even rarely sending disciples out for trial. This is the main reason. A large number of the Chen family’s elites fell within the heavens of the Star Luo Sect.”<br/><br/>“Now, voices of opposition have also appeared in the Chen family, feeling that it is meaningless to constantly send people to search for the ancestor. They shouldn’t let the most outstanding disciples of the family be consumed like this in that bottomless pit.”<br/><br/>“Even some suggest seeking outside help, someone like you, a strong one who is just one step away from becoming a Celestial Being. Exchange the entrance of the hole to go to the Star Luo Pocket Universe to find the ancestor of the Chen family.”<br/><br/>Star Luo Sect ——<br/><br/>Gu Yang really didn’t expect that the world of the holes Yun Qian was talking about turned out to be the Star Luo Pocket Universe.<br/><br/>This time, the Star Luo Pocket Universe and the Waning Pocket Universe have finally come to life.<br/><br/>He said, “Tell me the location.”<br/><br/>Yun Qian told him the location of the entrance to the Star Luo Pocket Universe and how to enter it.<br/><br/>After getting what he wanted, Gu Yang left.<br/><br/>He did not make things difficult for Yun Qian and Yi Yi.<br/><br/>In this world, one should respect righteousness. Yun Qian told him such valuable news, it’s not good to turn his back after crossing the river.<br/><br/>As for Yi Yi, looking at him now, Gu Yang feels a bit unbearable.<br/><br/>If you want to talk about misery, he is truly miserable. Overnight, everything collapsed. Such a blow is too great.<br/><br/>If he was killed again, it would be a bit too bullying.<br/><br/>Let’s forget about that grudge.<br/><br/>…<br/><br/>Gu Yang continued south to the Divine City.<br/><br/>Although he knew the entrance of the Star Luo Pocket Universe, he didn’t plan to go there now.<br/><br/>That’s an unknown hole. Exploring it costs something.<br/><br/>He only has one thousand energy points now, just enough for two simulations, exploring a new hole. It’s a little tight.<br/><br/>So he still followed the original plan and went back to the Divine City first.<br/><br/>His speed was extremely fast, and he arrived at Divine City after an hour.<br/><br/>Gu Yang kept a very low profile and did not disturb anyone when he entered the city gate. He went straight to the academy.<br/><br/>“Master, you’re back!”<br/><br/>Before he entered the door, a green bird had already flown out, shouting excitedly,” Where have you been these days? I almost couldn’t sense your location, and I thought you were gone again…”<br/><br/>“Father!”<br/><br/>A red shadow rushed out, knocked the little green bird away, and her face was pale, she looked anxious, her voice was tearful,” Are you okay?”<br/><br/>Gu Yang comforted her, “What can happen to me? I just went to another continent.”<br/><br/>The Little Green Bird quickly flew back, flapping its wings and said, “I know it, Master went to West Bank Continent to pick up something, right? No wonder the master’s realm has improved again.”<br/><br/>Gu Yang’s heart moved, the Phoenix meeting on the West Bank continent was an afterthought left by that ancient emperor.<br/><br/>What it was talking about was the item that the old man said was placed in the God Nation of the first leader of the Phoenix meeting, right?<br/><br/>He asked, “What did I leave there?”<br/><br/>The little green bird wondered, “Huh, didn’t you go to get something? Then what did you go to the West Bank Continent for?”<br/><br/>At this time, Ling Ling, Su Qingzhen, and others also arrived, interrupting their conversation.<br/><br/>Gu Yang saw their worried looks, their eyes red, and his heart softened. During this time, he really owed them a lot.<br/><br/>He felt that he should spend some time and accompany them.<br/><br/>…<br/><br/>The next two days were a rare leisure time for Gu Yang.<br/><br/>He took Su Qingzhen and Ling Ling around the Divine City, visiting those famous historical attractions.<br/><br/>In fact, the entire Divine City is the oldest relic.<br/><br/>They went to the most famous places like the list in front of the Martial College, the most famous Red Mansion, and the Altar of Sacrifice to the Heavens.<br/><br/>When Gu Yang arrived at the Altar of Sacrifice to the Heavens, he saw Wei Hao sitting on the ground.<br/><br/>This Xia Dynasty General who has lived for more than a thousand years has been waiting for him here.<br/><br/>Gu Yang almost forgot, a few days ago, he went to the West Bank continent with Eve, because the teleportation array could only transport two people, so he let Wei Hao return to the Divine City to wait for him.<br/><br/>He has been so busy these days that he has forgotten about this guy.<br/><br/>When Xi Huang saw Wei Hao, she exclaimed, “General Tianyun!”<br/><br/>Wei Hao looked at her, and said indifferently, “I didn’t expect, after a thousand years, someone still remembers the name of General Tianyun.”<br/><br/>Ling Ling and Su Qingzhen, they all sensed the terrifying pressure from this man who was like an iron tower, and were secretly surprised. Especially when they heard his address to Gu Yang, they were both somewhat confused, “When did he become his highness?”<br/><br/>Gu Yang’s identity is now so many, even they don’t understand.<br/><br/>A talking green bird recognizes him as its master.<br/><br/>A woman from the Xia Dynasty calls him father.<br/><br/>And Lily and Eve, these two alien women from the West Bank Continent, one calls him the Saint and the other calls him master.<br/><br/>Now another Xia Dynasty’s Tianyun General is here, calling him his highness.<br/><br/>With so many identities, which one is real?<br/><br/>PS: The title of the previous chapter is wrong, it should be 364, it can’t be changed.\t\t\t\t\t\t</div>", "images": {}, "success": true}