{"id": 363, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132327.html", "title": "Chapter 363 - Chapter 363: 363 Heavenly Saint Sect", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 363 - Chapter 363: 363 Heavenly Saint Sect</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 363: 363 Heavenly Saint Sect<br/><br/>[Simulation ends, you may keep one of the following.]<br/><br/>[One, Martial Arts realm at the age forty-two.]<br/><br/>[Two, Martial Arts experience at the age forty-two.]<br/><br/>[Three, Life wisdom at age forty-two.]<br/><br/>Looking at the three options presented to him, Gu Yang felt a surge of indescribable excitement.<br/><br/>Ever since he received the invitation to the Yaochi Conference, he had been doing everything he could, desperately gaining energy, simulating, and improving his strength.<br/><br/>After days of relentless effort, he finally saw a glimmer of hope, reaching the third layer of the Unleaking Realm, only one step away from becoming a Celestial Being.<br/><br/>And now, there were still six days left until the Yaochi Conference.<br/><br/>He calmed his mind and made a choice, “I choose one.”<br/><br/>In an instant, he felt his mind connecting at the deepest level to his body, uncovering deeper and more profound potentials within himself, down to the microscopic level.<br/><br/>He “saw” countless blood cells, differentiated into several types, along with various sizes of substances.<br/><br/>When his mental power barely touched those cells, the cells immediately underwent some indescribably strange changes, as if they had gained their consciousness…<br/><br/>Moments later, he suddenly felt dizzy and quickly withdrew his mental power and closed his eyes. He soon felt better.<br/><br/>“So, this is how it is.”<br/><br/>Despite not being able to break through this time, Gu Yang knew his next steps. The breakthrough was just a matter of time.<br/><br/>[Would you like to use the Life Simulator? One use consumes two hundred energy points.]<br/><br/>“Yes.”<br/><br/>[… … forty-two years old.]<br/><br/>A full simulation, spanning nineteen years, yet he still couldn’t break through to the Unleaking Realm.<br/><br/>This truly was a lengthy accumulation process.<br/><br/>…<br/><br/>If one attempt was not enough, then it was time for another.<br/><br/>Only after the third simulation, did Gu Yang finally see the prompt [… … You broke through to the Unleaking Realm’s third layer].<br/><br/>At this point, he only had five hundred energy points left.<br/><br/>[Simulation ends, you may keep one of the following.]<br/><br/>[… …]<br/><br/>After he received the reward, he immediately experienced a seismic change.<br/><br/>The change at the cellular level, every single cell in his blood, seemingly gained a spirit of its own, the mana that it produced and contained, increased tenfold, a hundredfold.<br/><br/>At this point, he had nearly unearthed his potential to the fullest extent.<br/><br/>This path he was on was close to its end.<br/><br/>At least, within his knowledge, it was very difficult to advance any further.<br/><br/>The best he could do was continue cultivating until every single cell in his body gained its spiritual nature.<br/><br/>To reach the Celestial Being realm, he would have to take another path.<br/><br/>…<br/><br/>Night fell, with a bright moon in the sky.<br/><br/>At the Elf King’s Court, Gu Yang stood before two Mother Trees and said to Eve, “Let’s begin.”<br/><br/>Eve hesitated but finally said nothing. The mark on her forehead lit up, reflecting off the moonlight in the sky. Soon, a massive force erupted, tearing open a rift in space.<br/><br/>Next to them, the Elf Queen, the High Priest, and other high-ranking elves stood, watching as Gu Yang flew into the realm. They all bowed in respect, “We bid farewell to the Divine Child.”<br/><br/>“I’ll return in half a year.”<br/><br/>Gu Yang’s figure disappeared into the Spatial Gate, leaving only his words behind.<br/><br/>…<br/><br/>…<br/><br/>Star Province, Mu Yun Peak.<br/><br/>On a precipice at the peak of the mountain, two figures sat on a giant rock.<br/><br/>The younger man in his early twenties was supporting a middle-aged man, anxiously asking, “Grandmaster, are you okay?”<br/><br/>The middle-aged man shook his head and said, “Yi Yi, listen to me.”<br/><br/>The young man was Yi Yi, the former number one on the Genius List, Gu Yang’s old acquaintance, the successor of the Heavenly Saint Sect.<br/><br/>At this moment, he incredibly already reached the Divine Power realm.<br/><br/>The middle-aged man was his master’s master, named Yun Qian, a force to be reckoned with in the Unleaking Realm.<br/><br/>Right now, his condition was seriously bad, on the brink of exhaustion.<br/><br/>Yi Yi tightly held his arm, not willing to let him fall, “Grandmaster, speak.”<br/><br/>Yun Qian said, “Heavenly Saint Peak is a lie, a huge conspiracy. You absolutely cannot go there. Remember my words.”<br/><br/>“Why?”<br/><br/>Yi Yi cannot comprehend this at all.<br/><br/>He was an orphan, adopted and raised by his master, guided by his master’s teachings throughout his life.<br/><br/>All along, he had found pride in his sect.<br/><br/>The Heavenly Saint Sect was one of the six major sects; in Great Zhou, there was hardly anyone who did not know of them.<br/><br/>Although due to the rules of the sect, he was allowed to leave the mountain only once, but even that single time made him realize the revered position of his Sect in the Great Zhou.<br/><br/>The Heavenly Saint Peak was the sacred place of the Heavenly Saint Gate, and the strongest cultivation techniques were contained therein.<br/><br/>According to the tradition of the Heavenly Saint Gate, when a disciple reached the peak of the Mana Realm, he had to go to the Heavenly Saint Peak to receive the ultimate inheritance of the sect.<br/><br/>The sect’s cultivation method was very unique, requiring exceptional talent to succeed at the Mortal Realm.<br/><br/>If one’s talent was slightly lacking, they couldn’t even pass the first threshold.<br/><br/>Therefore, all the disciples of the Heavenly Saint Sect were geniuses.<br/><br/>Once you cross the first barrier, after reaching the Divine Power realm, your progress accelerates incredibly. Saying you advance in leaps and bounds wouldn’t be an overstatement.<br/><br/>After Yi Yi broke through to the Divine Power realm, it has been more than a year and he’s already reached the second level of the Golden Body.<br/><br/>A few days ago, a sect uncle had reached the third level of Mana; according to the rules, he should’ve gone to the Heavenly Saint Peak to receive the ultimate inheritance.<br/><br/>Who knew that disaster would strike suddenly, and the sect would be destroyed.<br/><br/>Till now, Yi Yi had no idea who the enemy was.<br/><br/>All he knew was that a terrifyingly strong individual had annihilated the Sect.<br/><br/>His and his master’s strength was too weak, so they fled at first sight. Then, they met this Master Uncle.<br/><br/>Before this, Yi Yi had never met this Master Uncle.<br/><br/>Before he entered the Sect, this Master Uncle had already reached successful Cultivation Level. He went to the Heavenly Saint Peak to receive the inheritance.<br/><br/>Now, this Master Uncle has reached the Unleaking Realm, but sadly, he is still no match for the enemy.<br/><br/>Halfway through their escape, they were caught by this mysterious enemy.<br/><br/>Yi Yi’s master was killed on the spot due to the blast of a fight. Master Uncle barely managed to repel the enemy, but severely injured himself in the process.<br/><br/>Finally, they managed to escape to this place.<br/><br/>Face-to-face with his Master Uncle, someone he had barely known a day, Yi Yi knew he was on the brink of death; his heart was filled with melancholy.<br/><br/>…<br/><br/>Presently feverish and pale, Yun Qian darkly muttered, “The Heavenly Saint Sect was established a thousand years ago. Have you ever heard of any ancestor who returned from Heavenly Saint Peak?”<br/><br/>Yi Yi was taken aback.<br/><br/>Talented individuals consistently emerged from the Heavenly Saint Sect. Each generation boasted people of exceptional talent.<br/><br/>This generation was him, the last was his senior uncle, and before that, probably his Master Uncle.<br/><br/>And before that…<br/><br/>Almost every fifty years, someone would break through to the successful cultivation level and then journey to the Heavenly Saint Peak.<br/><br/>Master Uncle had done it fifty years ago.<br/><br/>Senior uncle was planning to do it today, fifty years later.<br/><br/>According to this frequency, over the past thousand years, there must have been at least twenty people from the Heavenly Saint Sect who went to the Heavenly Saint Peak.<br/><br/>However, he had never heard of anyone who had returned from the Heavenly Saint Peak.<br/><br/>Wait, that’s not correct—<br/><br/>Yi Yi said, “Master Uncle, aren’t you one of those?”<br/><br/>Yun Qian tried to smile, but it looked worse than crying. He said, “You are wrong. I never went to the Heavenly Saint Peak”.<br/><br/>“What?”<br/><br/>Yi Yi was stupefied, unable to comprehend that his Master Uncle had never gone to the Heavenly Saint Peak.<br/><br/>He broke the Sect rules.<br/><br/>In the Heavenly Saint Sect, those who violated the Sect rules would face severe punishment, ranging from deflating cultivation levels, driving out of the Sect, to sentencing death on the spot.<br/><br/>Now, the rule-breaker was his… Master Uncle.<br/><br/>Yi Yi didn’t know what to do.<br/><br/>Yun Qian gnashed his teeth and growled, “The Heavenly Saint Peak is a trap.”<br/><br/>“No, I should say, the whole Heavenly Saint Gate is a huge lie.”<br/><br/>Suddenly, a cold voice echoed, “Yun Qian, you successfully escaped earlier, so why did you return?”<br/><br/>Hearing this voice, Yi Yi’s face changed dramatically.<br/><br/>He would never forget the owner of this voice.<br/><br/>“The Executive Elder!”<br/><br/>In the Heavenly Saint Sect, the Executive Elder was in charge of penalties. As an uncompromising enforcer, he showed no mercy to anyone who violated the rules.<br/><br/>None of the Heavenly Saint Sect’s disciples dared to anger him.<br/><br/>But what did the Executive Elder mean by his words at this time?<br/><br/>Yi Yi was a bit confused.<br/><br/>…<br/><br/>As for Yun Qian, he had expected the Executive Elder’s appearance and laughed wistfully, “I simply underestimated you. Who could’ve guessed that a mighty person of the Unleaking Realm would be willing to hide in a valley for a thousand years, playing the role of the Executive Elder.”<br/><br/>The eyes of the Executive Elder were cold and venomous, staring intently at him, his tone chillingly casual, “You are very smart. Over the last thousand years, there have been many smart people like you, but you are the first to escape from my palm.”<br/><br/>“You have already fled, and I didn’t want to trouble myself anymore, but why did you return? Do you know because of this, I have to spend many more years rebuilding the Heavenly Saint Sect? You have delayed my master’s great plan.”<br/><br/>“You truly deserve to die!”<br/><br/>The conversation between the two plunged Yi Yi into an icy chill.<br/><br/>There was too much information in their conversation, which completely overturned his understanding.<br/><br/>Yun Qian stared hard at the Executive Elder, “Blue Sky Palace? No, you are not of the Six Heavenly Destructions.”<br/><br/>“Star Sea? No, this is not their style.”<br/><br/>“Red Sun Heaven? No, if it were Red Sun Heaven, they wouldn’t complicate it this much.”<br/><br/>“Which one of the Three Saint Gates is your master?”<br/><br/>“I understand now, the Red Moon Great Saint!”<br/><br/>Yun Qian asked and answered himself, deducing the answer from the Executive Elder’s reactions.<br/><br/>“Ha, ha, ha…”<br/><br/>He suddenly broke into maniacal laughter, “This is indeed very ridiculous. The so-called Six Great Sects are merely pastures of the Red Moon Great Saint. The disciples of the Heavenly Saint Sect are merely sheep and cattle reared by him. Whenever one is fattened, they automatically rush over and get swallowed up.”<br/><br/>The Executive Elder admired him, “Indeed, your intelligence surpasses the ordinary. You could have been used for a more significant purpose…”<br/><br/>Yun Qian mocked, “Like being a faithful dog for him, like you?”<br/><br/>The eyes of the Executive Elder flashed with a murderous intent, his tone turning icy cold, “You already know what you are supposed to. Now, you can die.”<br/><br/>A trace of regret was in Yun Qian’s heart.<br/><br/>He came here risking his life to save his most beloved disciple, intending to reveal the truth to him.<br/><br/>He didn’t expect to be discovered by this man.<br/><br/>This man was a madman; after discovering him, he resorted to a massive killing spree, murdering everyone in the Heavenly Saint Sect.<br/><br/>He thought that reaching the Unleaking Realm was enough to ensure his survival, even if he couldn’t defeat this man.<br/><br/>Who could have guessed that he had still underestimated his enemy. Not only had he gotten himself killed, but also caused the deaths of everyone in the Heavenly Saint Sect.<br/><br/>Now, looking at the murderous look in the Executive Elder’s eyes, he suddenly realized something.<br/><br/>The man standing before him had likely grown tired of his life. The genocide of the Heavenly Saint Sect simply because he had had enough and long desired to do so. His appearance had merely provided the man with an excuse.<br/><br/>Unfortunately, Yun Qian understood this a little too late.<br/><br/>After tonight, the Heavenly Saint Sect would vanish from this world.<br/><br/>“Do you need help?”<br/><br/>Suddenly, an abrupt voice echoed.\t\t\t\t\t\t</div>", "images": {}, "success": true}