{"id": 369, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132339.html", "title": "Chapter 369 - Chapter 369: Why Do You Insist On Pushing Me?", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 369 - Chapter 369: Why Do You Insist On Pushing Me?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 369: Why do you insist on pushing me?<br/><br/>“They arrived so quickly!”<br/><br/>Gu Yang’s expression became even more serious. There was no doubt that this sudden pursuer was from the Ancient River Sword Sect.<br/><br/>He had already prepared for their arrival.<br/><br/>However, he didn’t expect that they had a magic spell that could conceal their traces. They suddenly attacked after getting so close.<br/><br/>At the same time as the sound was heard, a fierce killing intent descended from the sky.<br/><br/>The sky dimmed as a Sword Light fell from each of the four directions, carrying an infinite sense of oppression and suppressing the space all around.<br/><br/>Four figures then appeared.<br/><br/>Their Mana seemed to have become one, surpassing the late stage of the Nascent Soul stage, as if it had reached another level.<br/><br/>“The Four Symbols Sword Formation, it’s the Ancient River Sword Sect!”<br/><br/>Huang Yongkang, the mere Golden Core stage cultivator, was trapped in this terrifying Sword Formation. His heart trembled in fear, and when he recognized the origin of the formation, he was filled with despair.<br/><br/>The Four Symbols Sword Formation was one of the trump card formations of Ancient River Sword Sect, formed by four Nascent Soul stage cultivators. The key thing is, it requires four Pure Yang level Flying Swords.<br/><br/>In history, before the Ancient River Sword Sect became a big sect, they faced a formidable enemy threating to wipe them off. They were on the verge of extermination.<br/><br/>At the eleventh hour, the last four Nascent Soul cultivators set up the Four Symbols Sword Formation outside the sect’s entrance, and astonishingly, slew that formidable enemy.<br/><br/>From then on, the name of the Four Symbols Formation spread throughout the world.<br/><br/>It could be said that it was thanks to the reputation of this Four Symbols Formation that the Ancient River Sword Sect weathered its most difficult period, and the sect was able to rise, this formation was indispensable to its achievement.<br/><br/>Back then, the formation was only set up by four early-stage Nascent Souls, but they managed to kill a late-stage Nascent Soul, showing its tremendous power.<br/><br/>Now, the Sword Formation is set up by one late-stage Nascent Soul and three mid-stage Nascent Souls. It is countless times more powerful than the previous one.<br/><br/>Since the day Huang Yongkang debuted, he often landed himself in anomalous situations and repeatedly faced danger, but he always reaped big benefits.<br/><br/>However, this time, the enemies he faced were unprecedentedly strong.<br/><br/>Four Nascent Souls, and they were powerhouses from the Ancient River Sword Sect, a renowned sect.<br/><br/>Huang Yongkang was intimidated by the terrifying Sword Intent, his mind swayed, and he sensed that a catastrophe was imminent.<br/><br/>It’s over, it’s truly over. I haven’t even tasted a woman yet, and today, I will meet my end…<br/><br/>Regret surged in his heart. He shouldn’t have been so greedy and provoked that demon, Youming Laozu.<br/><br/>If heaven could give him another chance…<br/><br/>….<br/><br/>In the sky, the head of the Maple Peak had already locked onto the foreigner. She felt as if she could sense the residual Wronged Ghost of her senior brother from him.<br/><br/>Senior brother, watch me take revenge for you!<br/><br/>She and the head of the Pihan Peak had the same master.<br/><br/>When she just entered the sect, her Cultivation Level was low, while her senior brother was already at the level of Foundation Establishment.<br/><br/>At that time, it was her senior brother who taught her and led her into the Sect.<br/><br/>To her, the head of the Pihan Peak was not only a senior brother, but also like a master as well.<br/><br/>The two siblings both broke through to the Nascent Soul stage and took up the position of the head of their peaks, becoming a sensational story for a time.<br/><br/>With her cultivation continuously deepening to the late stage of the Nascent Soul, senior brother also became her most significant support in the competition for the position of the Sect Master.<br/><br/>Who would have thought that senior brother would actually be killed?!<br/><br/>How dared he?<br/><br/>At this time, the head of the Maple Peak finally saw the enemy who killed her senior brother. He was a man who was too young, with looks no different from the people of this world.<br/><br/>Like the woman in the rumors, he had hidden all his cultivation levels and looked just like a mortal.<br/><br/>If not for the imprint left by her senior brother’s Original Spirit on him, even if she ran into him, she would never recognize that the man before her was the one who killed her senior brother.<br/><br/>“You dare to murder the head of the Pihan Peak of my Ancient River Sword Sect, do you know your crime?”<br/><br/>The head of the Maple Peak was towering above others, she controlled the Four Symbols Sword Formation, within which, she was the dominator.<br/><br/>This was an incredibly mysterious sensation, as if she had stepped into another Domain.<br/><br/>No wonder the sect’s records mentioned that the power of this Four Symbols Sword Formation was sufficient to contend with a Spiritual Transformation Realm cultivator.<br/><br/>The last person who controlled the Four Symbols Sword Formation was the only Spiritual Transformation Realm cultivator in the sect.<br/><br/>Back in the day, it was this ancestor, who led the formation of the Four Symbols Sword Formation and slew a formidable foe.<br/><br/>After that, this ancestor broke through all obstacles and advanced to the Spiritual Transformation Realm, becoming one of the strongest in this world.<br/><br/>Some speculated that this ancestor gained immense benefits from controlling the Four Symbols Sword Formation.<br/><br/>However, those who later tried to replicate the path of this ancestor by forming the Four Symbols Sword Formation,–their gains were insignificant.<br/><br/>Now, she finally understood why those people didn’t gain anything.<br/><br/>Because they lacked the most crucial factor– a powerful enemy!<br/><br/>Only with a common enemy, can the people in the Four Symbols formation truly unite and bring the power of this sword formation to its limit.<br/><br/>Otherwise, it’s all just for show.<br/><br/>The Master of Red Maple Peak had an indescribable feeling in her heart after realizing this.<br/><br/>It was an opportunity given to her by her senior brother at the cost of his own life.<br/><br/>Her vision blurred, “Brother, I will not let your sacrifice be in vain. In the future, I will undoubtedly reach the Spiritual Transformation Realm.”<br/><br/>…<br/><br/>Seeing the adversary’s aggressive attitude, Gu Yang patiently explained, “He wanted to kill me, and I killed him in self-defense. It’s only fair.”<br/><br/>The four in front of him didn’t emanate any murderous aura, implying they weren’t murderers. Their mana was upright, indicating they were of a proper sect.<br/><br/>In a sense, they weren’t evil.<br/><br/>Gu Yang was not a homicidal maniac. He had justifiable reasons for killing the individuals he had before.<br/><br/>These four were different from his previous opponents. There was no compelling reason to kill them.<br/><br/>Compared to the demon who had claimed countless lives and the eerie creatures of the Yellow Springs, these four were undoubtedly on the righteous path.<br/><br/>He couldn’t go on killing recklessly. It would upset the cosmic balance, and he wouldn’t be able to live with himself.<br/><br/>So, he felt it necessary to dissuade them from seeking their own deaths.<br/><br/>The Master of Red Maple Peak said coldly, “Killing a member of my Ancient River Sword Sect is a grave crime. You should kneel and beg for mercy!”<br/><br/>“Kneel down!”<br/><br/>“Kneel down!”<br/><br/>“Kneel down!”<br/><br/>Accompanied by four fierce shouts, the entire formation underwent a new change. Four sword intents banded together, generating a destructive power.<br/><br/>Seeing their confrontational attitude, Gu Yang felt a bit annoyed and said, “You guys are not my opponents. Why put ourselves through this? Leave. I don’t want to kill you.”<br/><br/>To the members of the Red Maple Peak, his words sounded like the ramblings of a madman, provoking questions about the source of his confidence.<br/><br/>When they arrived, they hadn’t noticed the battle between Gu Yang and Youming Laozu.<br/><br/>Upon reaching the spot and seeing the corpses on the ground, they didn’t take them too seriously.<br/><br/>The Master of Red Maple Peak didn’t underestimate him. His strength was evident in his ability to kill the master of Bihan Peak, who had a Xuan Light Shield.<br/><br/>Although outsiders didn’t know, upper-level members of the prominent sects knew the truth about these foreigners.<br/><br/>The woman and the man who killed Brother Li had one thing in common. Their close combat ability was terrifying.<br/><br/>She had carefully studied the traces left on Brother Li’s body and contemplated the scenario in her mind. She felt deep apprehension about the killer’s close combat ability.<br/><br/>This time, she didn’t give him a chance to engage in close combat. Right off the bat, she initiated the Four Symbols Sword Formation to seal off space, thereby maximizing the advantage of sword cultivation.<br/><br/>The Master of Red Maple Peak sneered, “Don’t struggle in vain. You have only two options in front of you–surrender or be killed on the spot.”<br/><br/>Hearing such overbearing words, Gu Yang sighed, “Why are you forcing me?”<br/><br/>He didn’t want to kill, but he was left without a choice.<br/><br/>They were after his life. What could he do?<br/><br/>He had no choice but to kill them all.<br/><br/>With that, he summoned the squirrel from the Beast-taming Space once again.<br/><br/>He had no other option; it was too useful.<br/><br/>“Come on.”<br/><br/>He said.\t\t\t\t\t\t</div>", "images": {}, "success": true}