{"id": 367, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132336.html", "title": "Chapter 367 - Chapter 367: 367 Purple Lightning Golden Cicada", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 367 - Chapter 367: 367 Purple Lightning Golden Cicada</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 367: 367 Purple Lightning Golden Cicada<br/><br/>When Gu Yang appeared in the Land of Water and Moon, he sensed a subtle change in his Original Spirit.<br/><br/>“Is this a curse?”<br/><br/>Only at this moment did he realize that someone had tampered with his Original Spirit.<br/><br/>It should have occurred after he killed the Nascent Soul of the Ancient River Sword Sect, unknowingly inheriting something similar to a curse.<br/><br/>This was a peculiar power. Normally, he could not detect any abnormalities, it was formless and insubstantial, causing him no negative effects.<br/><br/>Only upon stepping foot on the land of the Land of Water and Moon, did a subtle reaction occur.<br/><br/>As for its function, it was probably for locational identification.<br/><br/>It was as if someone had installed a locational system in his Original Spirit.<br/><br/>“It’s a bit like the power of that one from Chiming Sky, almost Dao-like.”<br/><br/>He researched for a while but found that he could not get rid of this thing.<br/><br/>“What’s wrong?”<br/><br/>Ye Lingbo, who was by his side, sensed that something was amiss with him and asked.<br/><br/>He replied, “I’ve been discovered. We should split up. You go and find Senior Wen first.”<br/><br/>“Alright.”<br/><br/>Ye Lingbo wasted no time. She had complete confidence in Gu Yang’s strength. After speaking, she transformed into a flying rainbow, quickly disappearing from sight.<br/><br/>Gu Yang turned towards another direction and flew away. That direction led to the deadly Sky Ruins of the legendary Land of Water and Moon.<br/><br/>There lay the corpse of a Candle Dragon. His main reason for coming to the Land of Water and Moon was for it.<br/><br/>From a single corpse, he could extract a considerable amount of Essence Blood.<br/><br/>After extracting the Essence Blood, he could use it for recharging. It was a case of killing two birds with one stone.<br/><br/>After flying for about an hour, Gu Yang entered a vast mountain range. Suddenly, he stopped in his tracks, turned his head to look in a certain direction, and said, “Is it him?”<br/><br/>…<br/><br/>“Boy, hand over the goods!”<br/><br/>An angry voice, like a thunderclap, echoed across the entire world.<br/><br/>It came from a man in a black robe, surrounded by ghost fires, emitting an overwhelming malicious aura. He was clearly a villain, and a Nascent Soul wielder at that.<br/><br/>Ahead, a white Sword Light was making a desperate attempt to escape.<br/><br/>“Good lord, this old devil is terrifying when he goes berserk,” exclaimed a frightened voice.<br/><br/>Inside the Sword Light was a young man, pale-faced but with extremely lively eyes. He was only at the Golden Core Cultivation Level, but his Sword Light was grand and proper, a result of orthodox Cultivation practices.<br/><br/>His Flying Sword was extraordinary, extremely fast. For a while, the Nascent Soul wielder behind him couldn’t catch up.<br/><br/>“You dare to snatch something from me – have you grown tired of living?”<br/><br/>The man in the black robe roared, completely losing the demeanor of a Nascent Soul wielder. Evidently, he was tremendously angered.<br/><br/>“You can’t escape. Once I catch you, I’ll grind your bones to dust, extract your Original Spirit to burn in the ghost fire. I’ll make sure you die painfully…”<br/><br/>He cursed and swore as he chased.<br/><br/>This man was called Youming Laozu, a leading figure of the Demonic Path and a late stage Nascent Soul cultivator.<br/><br/>In the entire Land of Water and Moon, there were only three late stage Nascent Soul cultivators from the Demonic Path. Each of them was powerful enough to cause tremors in the cultivation world.<br/><br/>Although the young Golden Core cultivator relied on his Sword Light escape technique to move slightly faster than Youming Laozu, the gap in their cultivation was too big. Once his mana was exhausted, it was inevitable that he would be caught.<br/><br/>Suddenly, he shrieked, “Master, stop fooling around! If you don’t show up soon, I’m done for…”<br/><br/>Were there accomplices?<br/><br/>Youming Laozu was at the verge of a heart attack from his anger. That item was something he had planned for two hundred years, enduring countless hardships to obtain. He was just about to get hold of it when someone stole it right under his nose at the final moment.<br/><br/>One can well imagine his fury.<br/><br/>He wanted to see who was daring enough to have this yellow-faced kid defy him.<br/><br/>Today, whoever showed up would regret being born in this world.<br/><br/>Even if it was the disciples of those big Sects, he would still show no mercy.<br/><br/>Throughout his life, whenever he was faced with the disciples of several big Sects, he always gave way and never confronted them.<br/><br/>These sects had no decorum at all. If one attacked their juniors, seniors would come to retaliate. If a practitioner at the Foundation Establishment stage couldn’t take care of it, a Golden Core adept would step in; if a Golden Core adept couldn’t handle it, a Nascent Soul adept would step in. If one adept wasn’t enough, two would step in, and if two adepts weren’t enough, the whole Sect would rally to fight.<br/><br/>They were utterly shameless.<br/><br/>Several leading figures from the Demonic Path had met their end in the hands of these so-called reputable Sects because they could not get their tempers in check.<br/><br/>Youming Laozu had learned his lesson; he was extremely cautious in conducting his affairs and never provoked these respected Sects.<br/><br/>But this time it was different.<br/><br/>That item was the key for his breakthrough to the Spirit Transformation stage.<br/><br/>His life span was running out. This might very well be his last chance. If he missed it, he would only be waiting to die.<br/><br/>He could compromise previously, but this time, he wouldn’t give in.<br/><br/>Even if it meant making enemies of these reputable sects, he was not afraid.<br/><br/>Just then, a figure appeared not far away. He did not use any Magic Treasure and relied solely on his mana to ride the wind.<br/><br/>Suspicious!<br/><br/>Upon seeing this unusual sight, Youming Laozu couldn’t help but raise his guard.<br/><br/>Anything out of the ordinary was bound to be suspicious.<br/><br/>This person’s cultivation level was clearly at the Nascent Soul stage, although there were some differences, the strength of his mana was undoubtedly at the Nascent Soul stage.<br/><br/>How could a Nascent Soul stage powerhouse not have even one Magic Treasure?<br/><br/>…<br/><br/>“Senior!”<br/><br/>As if he had found a savior, the young man ahead shouted out excitedly, “Save me.”<br/><br/>The newcomer was none other than Gu Yang, who, upon seeing Huang Yongkang flying towards him, couldn’t help but marvel. This kid truly was the protagonist of this world.<br/><br/>This yellow-faced youth, he had encountered him during his first visit to the Water Moon Cave Heaven when the youth hadn’t possessed any cultivation level.<br/><br/>It wasn’t long before they met again, and he had already reached the Foundation Establishment stage.<br/><br/>This time it was even more exaggerated – he had advanced to the Golden Core stage, equivalent to the Mana realm.<br/><br/>Such progress was even faster than Ye Lingbo’s. He wondered how the boy had been training.<br/><br/>Gu Yang said, “It’s not impossible for me to save you, but what will you give me in return?”<br/><br/>Without saying a word, Huang Yongkang threw something from his arms.<br/><br/>Gu Yang caught it. It was a red wooden box, rather quaint in appearance but otherwise unremarkable.<br/><br/>“Senior, I have urgent matters to attend to, so I must take my leave.”<br/><br/>Having tossed the hot potato, he didn’t linger and continued to fly away.<br/><br/>“Think you can escape?”<br/><br/>Youming Laozu knew the boy was extremely cunning and wouldn’t just let him get away so easily. At this point, he held nothing back and took out a small black bottle.<br/><br/>“Go to hell.”<br/><br/>His eyes flashed menacingly as he uncorked the bottle, and a golden bug flew out.<br/><br/>With a hum, the bug’s three pairs of wings trembled, and it crossed the distance of a kilometer in an instant, appearing before Huang Yongkang. Its jaws wide open, it lunged forward to bite him.<br/><br/>“Damn it!”<br/><br/>Huang Yongkang narrowly avoided the bug’s jaws and said in frustration, “The item is not with me anymore, do you have to cling to me like this?”<br/><br/>Buzz!<br/><br/>The golden bug vibrated its wings again, this time flying directly above his head and lunging down to bite him.<br/><br/>Huang Yongkang responded quickly, demonstrating his exceptional swordsmanship to just barely dodge the attack. Simultaneously, he cried out, “Senior, if you don’t do something soon, I’m going to die.”<br/><br/>Upon seeing the bug, Gu Yang felt something extraordinary about it. The sensation it gave him was akin to that of an ancient Divine Beast.<br/><br/>What kind of breed was it?<br/><br/>While holding the box, a white streak flew from his brow, heading toward the golden bug.<br/><br/>What he had unleashed was none other than the White Tiger, one of the ancient Divine Beasts. He felt that it was the best suited to deal with this incredibly fast bug.<br/><br/>“An Ancient Divine Beast?”<br/><br/>Youming Laozu was knowledgeable. The moment he saw the White Tiger, his face changed drastically.<br/><br/>This golden bug, his trump card, was what he relied on when dealing with Nascent Soul stage cultivators from the renowned sects. He had never used it before.<br/><br/>It was the Purple Lightning Golden Cicada, an extraordinarily ferocious insect from ancient times. During those times, it was a creature that could compete with Divine Beasts.<br/><br/>Centuries ago, he had incidentally come across the egg of this extraordinary insect, treating it as a precious treasure.<br/><br/>He had spent countless efforts to hatch the egg and raise the insect.<br/><br/>Even though it hadn’t reached its complete form, its powers had already surpassed those of a typical late stage Nascent Soul cultivator.<br/><br/>He believed that even if he came across accomplished cultivators at the late Nascent Soul stage from renowned sects, they wouldn’t be able to withstand the joint force of him and the Purple Lightning Golden Cicada.<br/><br/>It was the first time he had released the Purple Lightning Golden Cicada, but who would have thought he would encounter a real Divine Beast – the White Tiger.<br/><br/>How could there be a living Divine Beast in this world?<br/><br/>Youming Laozu had a ominous premonition as he saw the White Tiger and the Purple Lightning Golden Cicada engaged in battle.<br/><br/>The name ‘Purple Lightning Golden Cicada’ not only described its speed, ‘Purple Lightning’, but the ‘Golden’ represented the color and also signified its indestructible body, a body comparable to a Magic Treasure.<br/><br/>But in front of a White Tiger, it was completely suppressed. It couldn’t match the speed and could only take a passive beating. In just a short time, it had been hit several times and several wounds had appeared on its body.<br/><br/>“Stop!”<br/><br/>Youming Laozu, terrified and enraged, no longer cared about anything else.<br/><br/>He couldn’t watch as his Purple Lightning Golden Cicada was being killed. He took out a flag, and with a wave, countless ghost fires spread out, enveloping both Huang Yongkang and Gu Yang within.<br/><br/>Subsequently, five extremely evil ghostly beings appeared, exuding a horrible ghostly aura. They were, shockingly, five Nascent Soul stage wronged ghosts.<br/><br/>The supreme treasure, the Map of the Netherworld.<br/><br/>That was the reason he was known as Youming Laozu. While others thought he had a ghost flag, in fact, it was a map, a supreme treasure that could confine wronged ghosts and ghostly beings.<br/><br/>Those five Nascent Soul stage wronged ghosts were the five Nascent Soul stage powerhouses who had died by his hands and had been refined into main spirits.<br/><br/>“Kill them.”<br/><br/>Youming Laozu waved the flag in his hand, and immediately, countless ghostly auras rushed towards Gu Yang and Huang Yongkang.<br/><br/>Seeing this scene, Huang Yongkang was shocked and asked anxiously, “Senior, what should we do?”<br/><br/>“Come out.”<br/><br/>However, Gu Yang saw an opportunity and called out his pet beast from the Beast-taming Space – a grey squirrel.<br/><br/>The next moment, an invisible ripple emanated.\t\t\t\t\t\t</div>", "images": {}, "success": true}