{"id": 361, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132324.html", "title": "Chapter 361 - Chapter 361: 361 Monarch Class", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 361 - Chapter 361: 361 Monarch Class</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 361: 361 Monarch Class<br/><br/>In the Misty Forest, each super-level magic beast has its territory, which is essentially fixed and not easily relocated.<br/><br/>This made it convenient for Gu Yang. He went door-to-door, casting an illusion followed by a hammer blow to kill any beast with a lower realm than him.<br/><br/>If he encountered beasts with a higher realm, he would summon his divine beast avatars to gang up on them, while he wielded the Human Emperor sword. No super-level magic beast could withstand it.<br/><br/>Of course, he did not obliterate super-level magic beasts that had friendly relationships with elves, such as unicorns. He invited them to join the Elven family, for togetherness offered warmth.<br/><br/>The super-level beasts in the Misty Forest were formidable. For many years, the Elf Clan and these beasts lived like water and wells, not easily provoking each other.<br/><br/>The overall strength of the Elves was the strongest, boasting close to ten legends, which were not to be trifled with. However, they had a big family and business with a hundred thousand civilians living there.<br/><br/>If they had an unresolvable conflict with a super-level beast and couldn’t kill it leading to guerrilla warfare, it would be unbearable for them.<br/><br/>Because of this, a balance was formed between the elves and the super-level beasts.<br/><br/>Gu Yang’s appearance directly broke this balance; he acted without any scruples.<br/><br/>In less than a day, over ten super-level beasts had perished under his hammer.<br/><br/>Among them, two tyrant-level beasts were included.<br/><br/>Tyrant, equivalent to the third category of legends, represented the ceiling among the magic beasts.<br/><br/>This team also received three new members, all benevolent and orderly magical beasts that had a good relationship with the elves. When the High Priest pleaded, Gu Yang spared them.<br/><br/>These three beasts, initially due to their outnumbered situation, had no choice but to bow their heads though they still harboured some resentment in their hearts.<br/><br/>However, after witnessing Gu Yang single-handedly summon multiple super-level beasts, then crushing a Tyrant’s skull with his hammer, they dared not breathe heavily in front of this human.<br/><br/>They dared not imagine anything else.<br/><br/>…<br/><br/>…<br/><br/>“Let’s give this place a pass.”<br/><br/>When Gu Yang and the others arrived at a deep valley, the High Priest began to hesitate.<br/><br/>Not only her, but the other four elves also had solemn expressions.<br/><br/>Even the three beasts were noticeably terrified.<br/><br/>From their reactions, Gu Yang knew that a formidable being resided in this place. He asked, “Whose territory is this?”<br/><br/>The High Priest responded, “Inside lives the Evil Eye Tyrant, one of the four strongest monarchs in the Misty Forest.”<br/><br/>Monarch was an honorific or rank for a magic beast. They were the strongest beings among the tyrants.<br/><br/>Those known as Monarchs had lived for a long time, achieved dazzling battle records, made other beasts bow down in submission and were the rulers of magic beasts.<br/><br/>Gu Yang was a little curious, “Which four monarchs are they?”<br/><br/>A magic beast jumped in and answered, “Evil Eye Tyrant, Six-winged Flame Demon, Undead Monarch, Demon Heart Leader. These four are the most terrifying magic beasts in the Misty Forest. All of them possess domains, even half-gods dare not enter their territories.”<br/><br/>Gu Yang looked at the High Priest, saw her nod, and knew that these four beasts were unlike any other. He said, “In that case, wait here, I’ll be back shortly.”<br/><br/>Having said this, he entered the valley.<br/><br/>This move surprised everyone. One of the elves asked the High Priest worriedly, “What should we do?”<br/><br/>The High Priest said, “Don’t worry. With the strength of His Excellency Yang, even if he is not defeated, nothing will happen.”<br/><br/>She could see that Gu Yang’s fire elemental magic beast was about to form a domain. Coupled with the numerous beasts on his side, even if they couldn’t overcome the Evil Eye Tyrant, they could definitely retreat safely.<br/><br/>The three beasts standing in the back were curious about who was stronger, the human who had brutally killed a super-level beast with one strike of his hammer or the legendary Evil Eye Tyrant.<br/><br/>Soon after, violent elemental fluctuations rose to the extreme from the valley.<br/><br/>Then, everything returned to calm.<br/><br/>That’s it?<br/><br/>Both the five elves and the three beasts widened their eyes in disbelief.<br/><br/>They saw a figure emerging from the valley, dragging a huge body.<br/><br/>Could it be—the Evil Eye Tyrant?<br/><br/>Whether it was the five elves or the three beasts, they all unintentionally gulped when they saw the giant body.<br/><br/>The famous Evil Eye Tyrant was slaughtered just like that?<br/><br/>If they hadn’t seen it with their own eyes, neither the elves nor the beasts would have believed it.<br/><br/>“Let’s move on.”<br/><br/>Gu Yang deliberately brought out the corpse of the Evil Eye Tyrant for this effect.<br/><br/>Otherwise, they might not believe that the Evil Eye Tyrant was dead.<br/><br/>This monarch-level magic beast was indeed tricky, its formed domain could easily distort others’ thoughts and senses. It had a flavor of a Celestial Being.<br/><br/>It was extremely close to the Celestial Being realm.<br/><br/>With this strength, it could look down upon all in the Unleaking Realm.<br/><br/>Unfortunately, it had bad luck and encountered Gu Yang.<br/><br/>The divine beast Candle Dragon could ignore all illusions and mental attacks. Borrowing the power of the Candle Dragon, Gu Yang simply ignored Evil Eye Tyrant’s domain and killed it with one blow of his hammer.<br/><br/>Then, he harvested a thousand points of energy.<br/><br/>Equivalent to two powerful beings at the third level of the Unleaking Realm.<br/><br/>Profitable.<br/><br/>…<br/><br/>————-<br/><br/>The underground cave deep beneath the earth is the territory of the Six-winged Flame Demon.<br/><br/>This is the second target Gu Yang has set his sights on.<br/><br/>The Six-winged Flame Demon, as its name suggests, is a fire magic beast.<br/><br/>The high priest explained its origins to Gu Yang, “It is said that a six-winged angel died here, soaked in magma for countless years, and was transformed into the Six-winged Flame Demon…”<br/><br/>Upon seeing the apparition, it did indeed seem bird-like.<br/><br/>“Who dares to disturb my sleep?”<br/><br/>As Gu Yang and others arrived at the magma underground, a grand voice reverberated.<br/><br/>Immediately after, a figure enveloped in flames emerged from the magma, behind it were three pairs of wings made of fire, its power was overwhelming at its peak.<br/><br/>“Attack!”<br/><br/>Without wasting words, Gu Yang released the Phoenix, which immediately spewed a mouthful of flames.<br/><br/>“How dare you—”<br/><br/>The Six-winged Flame Demon roared, ready to incinerate these intruders, then suddenly felt a sense of danger.<br/><br/>The strange firebird’s flames pierced through its fiery domain and burned its body.<br/><br/>What kind of flame is this?<br/><br/>Shocked, before it could react, it was engulfed in raging flames and its body vaporized.<br/><br/>It didn’t understand even at the moment of its death, why it, the ruler of flames, was burned to death by some kind of flame.<br/><br/>The five elves and three magical beasts in the field were all dumbfounded.<br/><br/>The Six-winged Flame Demon, was it just… dead?<br/><br/>Burnt to death.<br/><br/>“Let’s go.”<br/><br/>Gu Yang didn’t react strangely. The Phoenix is an ancient divine beast. The Phoenix True Flame it spews is a higher ranking flame, especially effective against Spirit Fire and the like.<br/><br/>If it were another magical beast, it might not have been killed so easily.<br/><br/>A Fire magic beast, when encounters Phoenix, doesn’t stand a chance.<br/><br/>Another thousand points of energy were collected.<br/><br/>…<br/><br/>————-<br/><br/>The third target is the Undead Monarch. It is said to be a magical beast, but in reality, it is a body left by a magical beast after death, which somehow became an undead.<br/><br/>Its territory is a swamp.<br/><br/>When it appeared, it was accompanied by four minions, the undead of four legendary magical beasts.<br/><br/>Gu Yang released the Phoenix and Candle Dragon.<br/><br/>This time, it took a little more time to send the Undead Monarch and its four minions to the underworld.<br/><br/>[Received 1000 points of energy, current balance 7900 points.]<br/><br/>Well, if I can also take down the last Heart Demon Lord, I will likely be close to reaching the third level of the Unleaking realm.<br/><br/>…<br/><br/>————-<br/><br/>“The Heart Demon Lord first appeared hundreds of years ago. No one knows from where it originated. After arriving at the Misty Forest, it settled for a territory.”<br/><br/>The high priest began telling the story of the last lord.<br/><br/>“It is said that the Heart Demon Lord battled with the Undead Monarch, and neither came out victorious. That’s why people consider it a monarch-level beast.”<br/><br/>As they spoke, they had arrived at a forest. It was lush and teeming with life, with small animals occasionally seen.<br/><br/>One has to say, among the territories of the four lords, this placeseemed the most normal.<br/><br/>Suddenly, a grey squirrel jumped onto a tree branch, looking at Gu Yang and the others. When it met their eyes, it sprinted off like a frightened animal and disappeared in the blink of an eye.<br/><br/>Gu Yang laughed and said, “This place doesn’t look like the territory of a legendary magical beast.”<br/><br/>The high priest and others also found this strange. Normally, timid animals like squirrels would not dare to approach the territories of legendary magical beasts.<br/><br/>Even a unicorn, a creature of pure beauty in legend, if contaminated with the word ‘magical beast’, the powerful aura it emits could scare these weak animals to death.<br/><br/>Let alone a monarch-level magical beast like the Heart Demon Lord.<br/><br/>“Get out of my territory!”<br/><br/>Suddenly, a furious voice rang out, causing everyone present to wince in pain.<br/><br/>It’s the Heart Demon Lord!\t\t\t\t\t\t</div>", "images": {}, "success": true}