{"id": 368, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132337.html", "title": "Chapter 368 - Chapter 368: Harvest 368", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 368 - Chapter 368: Harvest 368</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 368: Harvest 368<br/><br/>“What is this…?”<br/><br/>Youming Laozu observed with shock as the ghost fire around Gu Yang evaporated instantly, leaving a blank space of several hundred meters around him, even a Nascent Soul phase Ghost King that entered vanished instantly.<br/><br/>The key was that he couldn’t sense any mana fluctuations from him.<br/><br/>He didn’t know how the other party dissipated the ghost fires, nor how they killed the Ghost King.<br/><br/>Such a method was beyond his understanding.<br/><br/>Divine Power?<br/><br/>A thread of fear emerged in Youming Laozu’s heart.<br/><br/>What he acquired was a complete cultivation method, including the part beyond the Divine Power phase. He knew that cultivation beyond the Nascent Soul phase was completely different.<br/><br/>A Divine Power cultivator practiced the Way of Heaven. The Way of Heaven in this world had already collapsed, leaving only five incomplete strands, and they had all been claimed by others.<br/><br/>If others wanted to cultivate to the Divine Powers phase, they could only pick the leftovers, making it significantly harder.<br/><br/>Although Divine Power phase cultivators could only comprehend some Dao essences and not the true Great Dao, these methods were already godlike to Nascent Soul phase cultivators.<br/><br/>Nascent Soul cultivators basically borrowed the power of heaven and earth and could only go with the flow. Their Divine Powers and mana had to conform to the Way of Heaven.<br/><br/>To summon fire, mana was needed to increase the temperature to a critical point to “ignite” the fire element.<br/><br/>To use a lightning spell, dark clouds needed to be summoned, generating lightning within the thick cloud layer.<br/><br/>In short, any magic spell needed to follow the laws and rules of heaven and earth; they could not be generated out of thin air.<br/><br/>But after reaching the Divine Power phase, understanding the corresponding Dao essence could create something from nothing.<br/><br/>To summon lightning, there was no need for dark clouds; it could be summoned from thin air, skipping the intermediary process.<br/><br/>To summon fire, flames could appear.<br/><br/>To summon ice and snow, the temperature could instantly drop below freezing…<br/><br/>Such ability to almost directly change the rules was extremely terrifying.<br/><br/>Because this was beyond the comprehension of Nascent Soul phase cultivators.<br/><br/>Just like now, Youming Laozu could not understand through what means the opponent made his Ghost King disappear out of thin air.<br/><br/>Were they some kind of power that specifically restrained wronged ghosts?<br/><br/>Even though he was beginning to feel fear, he had no thoughts of retreating.<br/><br/>That thing was critical to his breakthrough to the Divine Power phase. No matter what, he wouldn’t give up easily.<br/><br/>“If you can restrain ghostly beings, then try this.”<br/><br/>Youming Laozu’s expression turned determined, and a red flying sword flew out from his Niwan Palace.<br/><br/>Based on the sword light, it seemed to come from the Orthodox Daoist School.<br/><br/>“A Pure Yang Flying Sword?”<br/><br/>Huang Yongkang, who was watching from afar, nearly popped his eyes out of his sockets.<br/><br/>A Pure Yang Grade flying sword was incredibly rare in this world.<br/><br/>Despite all his extraordinary encounters, the flying sword in his hand just barely reached Illusion God Level.<br/><br/>Moreover, this old devil’s sword light was nothing like those from ordinary side schools.<br/><br/>This exceeded his expectations greatly.<br/><br/>…<br/><br/>Everyone believed that Youming Laozu practiced some demonic skill, but they didn’t know that it was merely a disguise.<br/><br/>His ability to control ghost fire was purely due to the Ghost Diagram, which absorbed souls and used them for himself. These were features of this divine item.<br/><br/>In reality, he practiced the orthodox Daoist School’s methods — a heritage from an ancient sect. It was not much different from the cultivation methods of the big sects.<br/><br/>However, he never dared to show it in public.<br/><br/>Before him, there were people who had received the heritage of ancient sects. But once such people revealed their extraordinary talents, they would all end up with unfortunate deaths.<br/><br/>If they didn’t die at the hands of Left Sect powerhouses, they were killed by the big sects.<br/><br/>Therefore, he had always disguised himself as someone from the Left Sect, not daring to let anyone know, which allowed him to safely cultivate to his current state.<br/><br/>Throughout this journey, he had been extremely careful and cautious. Even after becoming a top figure among demonic cultivators, he never revealed his true foundation.<br/><br/>But now, he had no choice.<br/><br/>For that thing, he had to show all his cards.<br/><br/>The red flying sword morphed into a ray of sword light, tracing a beautiful arc. As it was about to reach Gu Yang, it suddenly divided into two, then four…<br/><br/>Within a blink of an eye, it turned into hundreds of sword threads.<br/><br/>This was the sword art which turned sword energy into threads.<br/><br/>Huang Yongkang, who was not far away, was dumbstruck.<br/><br/>Such sword art was enough to rival the Nascent Soul Elders of the top sects. Could this really be the legendary demonic being who ripped people’s souls to make a Ten Thousand Soul Flagpole?<br/><br/>…<br/><br/>The next moment, hundreds of sword threads entered the several hundred-meter range around Gu Yang.<br/><br/>Then, these sword threads also vanished into thin air without a trace.<br/><br/>“How is this possible?”<br/><br/>Youming Laozu’s eyes narrowed, his mind shocked to the extreme.<br/><br/>Right after, he lost the connection with his life-bound flying sword.<br/><br/>Thump!<br/><br/>He vomited a mouthful of blood on the spot. Losing his life-bound, life-sharing flying sword dealt him a heavy blow.<br/><br/>“Forbidden Magic Field, really useful.”<br/><br/>What Gu Yang brought out from the Beast-taming Space was indeed the infamous Demon Heart Master from the Misty Forest.<br/><br/>He primarily wanted to test the power of the Forbidden Magic Field, and the results indicated that even the flying sword, once it entered the field, had to succumb.<br/><br/>He ordered the squirrel to withdraw the Forbidden Magic Field and, with a sweep of his hand, took the fiery-red flying sword into his possession.<br/><br/>Next, he conducted another test, reopening the field anew.<br/><br/>[Energy Source detected, would you like to recharge?]<br/><br/>Upon seeing this prompt, a smirk appeared at the corners of Gu Yang’s mouth.<br/><br/>It appears that even the Forbidden Magic Field, couldn’t restrict the system.<br/><br/>“Yes.”<br/><br/>The fiery-red flying sword in his hand instantly vanished into thin air.<br/><br/>[Successful Recharge, 500 points of Energy obtained.]<br/><br/>Great, it’s akin to having killed a level three Unleaking cultivator.<br/><br/>Almost every cultivator of the Water-Moon Cave Heaven had a Magic Treasure on hand, not of low grade either, this was one of the reasons why he chose the Water-Moon Cave Heaven.<br/><br/>After completing the testing, Gu Yang had the squirrel expand the scope of the Forbidden Magic Field.<br/><br/>All the ghost fires surrounding them vanished in an instant, and rapidly, it spread till two thousand meters away.<br/><br/>Then, the squirrel began to look quite strained. It seemed that this was close to its limit.<br/><br/>At this moment, Huang Yongkang, Youming Laozu, the four Ghost Kings by his side, and the White Tiger and Purple Lightning Golden Cicada in the midst of fierce combat were all enveloped within it.<br/><br/>“Hey, yo!”<br/><br/>Huang Yongkang suddenly found his levitation spell malfunctioning and was startled as he plummeted straight down.<br/><br/>Youming Laozu, who had just been severely injured, also started falling, his face filling with terror.<br/><br/>The four Ghost Kings beside him didn’t even whimper before they turned into dust.<br/><br/>The Forbidden Magic Field was the nemesis for these ghostly beings, as it could instantly remove their existence’s foundation, reducing them to oblivion.<br/><br/>Even the White Tiger and Purple Lightning Golden Cicada also lost their Divine Powers, both of them fell mid-combat, turning their battle into a primitive physical combat.<br/><br/>As they were about to land, the White Tiger finally found an opportunity and pierced its claw into its opponent’s abdomen, taking its life.<br/><br/>[500 points of Energy obtained, current balance is 1500 points.]<br/><br/>A prompt appeared in front of Gu Yang, indicating that the strange bug, which could go toe-to-toe with the Divine Beast White Tiger, was dead for sure.<br/><br/>Then, another prompt jumped out in front of his eyes, [Energy obtained, 500 points, current balance 2000 points.]<br/><br/>What’s happening?<br/><br/>He was a bit puzzled, but looking closer, he saw that the Nascent Soul stage cultivator had been smashed into a pile of mush. His Nascent Soul was wiped off the moment it flew out by the Forbidden Magic Field.<br/><br/>Good lord! This mortal body was way too weak, it couldn’t even survive a fall from a few hundred meters and fell to death.<br/><br/>He looked at Huang Yongkang, who somehow took out a piece of cloth and used that as a parachute to slow down his fall.<br/><br/>This kid was pretty smart.<br/><br/>By now, Gu Yang had more or less completed his testing and had the squirrel retract the Forbidden Magic Field. He then sent it back to the Beast-taming Space.<br/><br/>…<br/><br/>“Senior, could you perhaps warn me the next time you use your Divine Power?”<br/><br/>Feeling his mana returned, Huang Yongkang hastily floated to the ground. His face displayed the fear he had recently experienced, he said bitterly, “I almost fell to my death.”<br/><br/>He glanced at the pile of flesh not far away, and he couldn’t help but shudder.<br/><br/>A great Nascent Soul later stage cultivator, a significant and infamous devil head who had a continental renown, actually fell to his death humiliatingly.<br/><br/>Even if it was publicized, no one would believe it.<br/><br/>At this moment, he respected the mysterious senior in front of him to the utmost.<br/><br/>Just what kind of existence can effortlessly kill a great Nascent Soul late-stage cultivator?<br/><br/>…<br/><br/>Gu Yang had already reached the corpse and picked up the flag stuck next to it.<br/><br/>After losing its owner, it didn’t look eye-catching in the least and didn’t give any impression of being a Magic Treasure.<br/><br/>An idea entered his mind, Divine Items are always concealed, this is a characteristic of Spiritual Treasures.<br/><br/>Could it be that this was actually a Spiritual Treasure?<br/><br/>If indeed it was, then he had struck gold.<br/><br/>With his discerning eyes, he naturally realized that the flagpole and the flag were not one unit. With a little force, he easily separated them.<br/><br/>The flag, or the painting, was the valuable part.<br/><br/>As for the flagpole, it was merely a common Magic Treasure.<br/><br/>Gu Yang kept the painting and also removed everything from the corpse, which had a bag of possession in it with several Magic Treasures. Looking at the glows of the treasures, they all seemed extraordinary.<br/><br/>There were also some trivial things, such as jade pendants, maps, etc.<br/><br/>He collected everything, then turned to Huang Yongkang and said, “Tell me, what’s inside?”<br/><br/>Huang Yongkang embarrassingly said, “Senior, actually, I don’t know either.”<br/><br/>“You don’t know?”<br/><br/>“Exactly, yesterday when I passed by the Xi Ming Mountain, I saw a treasure light shooting towards the sky, I thought some Abnormal Treasure had emerged hence I rushed over. Just in time, I saw this old devil breaking the prohibition of a cave dwelling with his Divine Power.”<br/><br/>“Since I was there, I definitely wouldn’t let go of this opportunity. So, I used my spiritual pet to get the thing first. Then, this old devil pursued me for an entire day and night.”<br/><br/>“If it were not for the timely arrival of Senior, I was definitely doomed. This thing is just a token of respect for the Senior. Seeing this old devil taking it so seriously, it must be something good.”<br/><br/>Huang Yongkang spoke swiftly and explained the ins and outs of the matter briskly.<br/><br/>Just as Gu Yang was about to say something, his expression shifted and he looked upward.<br/><br/>“Thief, hand over your life!”\t\t\t\t\t\t</div>", "images": {}, "success": true}