{"id": 364, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132329.html", "title": "Chapter 364 - Chapter 364: 365 Meddling In Others’ Business", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 364 - Chapter 364: 365 Meddling In Others’ Business</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 364: 365 meddling in others’ business<br/><br/>“Where am I?”<br/><br/>When Gu Yang arrived in the Divine State through ultra-long-distance teleportation, he found it was not the place he had originally left.<br/><br/>There were mountains all around, and the temperature difference was noticeable.<br/><br/>He used his divine vision and hearing technique to survey the surrounding area and found there wasn’t a single person within a hundred miles.<br/><br/>He thought to himself, “It seems that some deviation has occurred during the teleportation.”<br/><br/>It wasn’t surprising. After all, he had traveled a considerable distance, and Eve, who had only recently become legendary, still lacked the experience to achieve precise positioning.<br/><br/>Gu Yang discerned his direction through the position of the stars and flew south.<br/><br/>Not far off, he finally encountered a village. Upon inquiry, he learned that this place was Star Province.<br/><br/>Star Province was located to the northwest of Divine City and was the territory governed by the Chen family.<br/><br/>Now, a problem laid before him.<br/><br/>Where should he go next?<br/><br/>He had six days before the Yaochi Conference.<br/><br/>His energy balance was down to five hundred points, just enough for one simulation. The most important thing now was to find a place to earn energy.<br/><br/>Indeed, after advancing to the third-tier of the Unleaking Realm, the cost of the life simulator had once again increased. It now required five hundred points per use.<br/><br/>He had two goals in mind. Regardless of which one he aimed for, a trip back to Divine City was necessary.<br/><br/>Thus, Gu Yang headed towards Divine City.<br/><br/>…<br/><br/>“Huh?”<br/><br/>Sometime later, Gu Yang suddenly sensed a familiar aura, “It’s him.”<br/><br/>Life’s encounters could be unexpected, indeed.<br/><br/>He had run into Yi Yi here.<br/><br/>He remembered the numerous simulations in which Yi Yi ruthlessly hunted him to the point of despair.<br/><br/>Later, although he defeated Yi Yi, he hadn’t managed to claim his life.<br/><br/>At this moment, Yi Yi was at the second level of the Golden Body Realm, negligible to Gu Yang.<br/><br/>However, Gu Yang had always wanted to settle this score. Having run into him here, he might as well take care of it.<br/><br/>He changed direction and flew towards him.<br/><br/>Then, he overheard a very fascinating conversation.<br/><br/>Gu Yang couldn’t believe that one of the six significant sects, the Tianji Sect, had such a secret.<br/><br/>Weren’t they just raising pigs for slaughter?<br/><br/>They would recruit talented disciples and, once they were nurtured well, slaughter them for their gain.<br/><br/>The Red Moon Great Saint was surely more cunning than the daylight revealed.<br/><br/>The Heavenly Saint Sect had managed to conceal such a fact for a thousand years. They had deceived the entire world and even played their disciples like puppets.<br/><br/>Considering the incident at Taoyuan Heaven, where the Red Moon Great Saint suddenly betrayed Saint Chaoyang, his ruthless strike seriously injured Saint Chaoyang.<br/><br/>If the Red Moon Great Saint hadn’t encountered Gu Yang, who had extraordinary abilities, he would have succeeded in trapping Saint Chaoyang and the Phoenix.<br/><br/>Also, in the matter of the Wu family, he gained the most significant victory by seizing the Saber Tomb.<br/><br/>Upon further consideration, the strategizing of Red Moon Great Saint was even more terrifying than that of Red Ming Tian.<br/><br/>Hearing this, Gu Yang kind of felt sorry for the disciples of the Heavenly Saint Sect, who were tragically deceived.<br/><br/>Especially Yi Yi, who could hardly endure the harsh truth. His whole reality probably collapsed in the wake of it.<br/><br/>Seeing that the elder in charge of punishment was about to execute the punishment, he couldn’t help but voice out, “Do you need a hand?”<br/><br/>…<br/><br/>This sudden voice startled the execution elder and Yun Qian.<br/><br/>They hadn’t noticed that someone else was eavesdropping on them. The fact that they were undetected indicated the outsider was a being of a similar tier.<br/><br/>“Who is it?” The elder’s gaze was solemn.<br/><br/>When Gu Yang revealed himself, he slightly squinted his eyes, “Gu Yang?”<br/><br/>Although he had been staying isolated in the Heavenly Saint Sect, he had been in contact with the Red Moon Great Saint.<br/><br/>He had recently received orders from his master to keep an eye on Gu Yang. If they discovered him, they had to try their best to kill him.<br/><br/>However, seeing Gu Yang in person, the elder felt a hint of danger.<br/><br/>It was his instinctive reaction to danger. He had a sharp intuition.<br/><br/>Back then, when Wu Shengtian challenged the Heavenly Saint Sect, he didn’t feel such danger.<br/><br/>This meant that the young man before him, in his early twenties, had surpassed Wu Shengtian.<br/><br/>“Gu Yang?”<br/><br/>Hearing this name startled Yun Qian as well.<br/><br/>Over the years, to avoid the Heavenly Saint Sect’s attention, he had remained hidden. Even then, he had heard of this famous name.<br/><br/>The person who reached the Unleaking Realm in the shortest time in history.<br/><br/>He himself was a peerless talent, and he had broken through the Unleaking Realm before he was a hundred years old. Considering the history of Xia, Qin, and Zhou dynasties, such a speed would put him in the top tier of cultivators.<br/><br/>But compared to Gu Yang, that was nothing.<br/><br/>Gu Yang made that journey in a year.<br/><br/>He couldn’t imagine how Gu Yang cultivated.<br/><br/>Yun Qian preferred to believe the exaggerated rumors like Gu Yang being a reincarnation of an ancient powerful being, and he was simply restoring his original cultivation.<br/><br/>And now, he had come face to face with the man himself.<br/><br/>He looked even younger than the rumors suggested.<br/><br/>To the point of almost being the same age as his own disciple standing next to him.<br/><br/>How enviable.<br/><br/>Upon reaching the Divine Power realm, a martial artist can retain their youthful appearance, but changes made otherwise to their appearance cannot fool the gaze of the Unleaking Realm powerhouses.<br/><br/>Yun Qian could tell at a glance just how vital and vibrant the life force was within the young man standing before him.<br/><br/>It was fundamentally different from someone like himself who was on his deathbed.<br/><br/>In truth, he was not old himself, being less than two hundred years of age and originally had at least eight hundred years of lifespan remaining. However, it was all consumed in the previous battle.<br/><br/>His hatred for the disciplinary elder could not be washed away even by the waters of the massive Jiujang River.<br/><br/>Yun Qian quickly recovered, loudly saying, “If you could help me kill him! I would share a great secret in return.”<br/><br/>“Deal.”<br/><br/>Gu Yang accepted without hesitation.<br/><br/>In fact, even if Yun Qian had said nothing, he would have intervened anyway.<br/><br/>He had a score to settle with the Red Moon Great Saint. He was almost killed by that Saint in Taoyuan Tian that day.<br/><br/>He held a grudge and naturally would not let go of the chance to get at the saint’s subordinate now.<br/><br/>As a loyal dog for the Red Moon Great Saint, this man had hidden his identity for a thousand years in the Heavenly Saint Sect, demonstrating his steadfast loyalty.<br/><br/>The Red Moon Great Saint probably didn’t have many like him under his command.<br/><br/>Compared to him, Yi Yi was way too weak to be his opponent now.<br/><br/>The disciplinary elder said, “Gu Yang, this matter has nothing to do with you, don’t meddle needlessly. Your cultivation was hard-earned, is it worth it to expend your life essence for an irrelevant person?”<br/><br/>This kind of talk was effective on other Unleaking Realm powerhouses.<br/><br/>Each fight consumes a portion of their lifespan.<br/><br/>So for the Unleaking Realm powerhouses, they would never act rashly unless it was absolutely necessary. Meddling in others’ affairs was a sheer luxury for them.<br/><br/>However, he ran into an anomaly like Gu Yang. So in response to his words, Gu Yang drew his saber.<br/><br/>Heavenly Inquiry Nine Saber-Art, first move, Chaos Unleashed.<br/><br/>It had been a long time since he last used his saber techniques. If he didn’t use them soon, they might just get rusty.<br/><br/>The disciplinary elder was on guard, his body flickering and disappearing from sight in an instant.<br/><br/>“Beware——”<br/><br/>Yun Qian started to warn but before he could finish, Gu Yang changed his move.<br/><br/>Heavenly Inquiry Nine Saber-Art third move, Might Envelops All. The saber’s trajectory crossed the space in a flash, striking a certain spot.<br/><br/>The next moment, the disciplinary elder’s figure appeared there, as if he had deliberately bumped into the blade.<br/><br/>Splash!<br/><br/>He was cut in half at the waist.<br/><br/>The ingenuity of these two saber techniques and their seamless transition left Yun Qian staggered and amazed.<br/><br/>On the other side, after being cut, the disciplinary elder didn’t make a sound. Grasping his lower half, his form vanished again.<br/><br/>He didn’t have any intent to fight with Gu Yang from the start and was prepared to run away.<br/><br/>His intuition was something he highly trusted.<br/><br/>It told him that he couldn’t win. So he didn’t hesitate and escaped.<br/><br/>He was of the Monster Race, but was naturally good at disguising; no one till now had seen his true face.<br/><br/>As a member of the Monster Race, his lifespan was naturally much longer than that of humans, especially after following the humans’ Martial Arts cultivation and achieving the Unleaking state, his lifespan became even longer.<br/><br/>Martial Arts seemed tailor-made for the Monster Race. Most of the Monster Race had much more powerful physical bodies than humans. After fully unlocking their potential, their power was incomparable to an average human.<br/><br/>For example, if the Divine Ape of the Sky, a Divine Beast, practiced martial arts, how strong would it become?<br/><br/>It was unimaginable.<br/><br/>The disciplinary elder was good at disguising, and was also somewhat cowardly by nature. Otherwise, he wouldn’t have stayed for a thousand years in the Heavenly Saint Sect.<br/><br/>He never fought a battle without certainty. When Yun Qian was his opponent, he was the craftiest hunter.<br/><br/>But when his opponent became Gu Yang, he sensed the danger and ran immediately, displaying the primal nature of a monster beast fully.<br/><br/>This was the first time Gu Yang had come across such an elusive enemy — possessing the strength of the third level of the Unleaking Realm yet thinking only of escape and not fighting.<br/><br/>“Running away?”<br/><br/>A ray of light shot from his brow, turning into a streak of light, chasing after the disciplinary elder.<br/><br/>“A God?”<br/><br/>The disciplinary elder sensed an extremely terrifying aura and his heart was filled with terror.<br/><br/>Whoosh!<br/><br/>The Phoenix flew above his head like a flash of lightning. Its claws pierced through his head like a blade, immediately splattering his brain.<br/><br/>Following a distortion of light, he revealed his true form — a seven-colored chameleon, whose skin could change with the environment.<br/><br/>A chameleon?<br/><br/>Gu Yang had never realized earlier that this man was a disguised monster, and was quite surprised.<br/><br/>The chameleon’s head quickly returned to normal. Despite suffering a fatal wound, it was hard to kill it.<br/><br/>The Phoenix was annoyed at once, and spit out a fiery breath.<br/><br/>“No—”<br/><br/>The chameleon barely managed to let out a shriek. It struggled desperately in the flames, but it was quickly turned into ashes.<br/><br/>The Phoenix True Flame was the only way to deal with such resilient creatures.<br/><br/>[Energy received: 500 points. Current balance: 1,000 points.]<br/><br/>This chameleon surprisingly had reached the third level of the Unleaking Realm.<br/><br/>At this level, the being would be considered one of the most powerful across the world. Unfortunately, it had met Gu Yang, and its death was more than a little frustrating.<br/><br/>After Gu Yang dealt with the chameleon, he looked at Yun Qian and Yi Yi standing on the side.<br/><br/>Both were stunned, their expressions vacant.\t\t\t\t\t\t</div>", "images": {}, "success": true}