{"id": 362, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132326.html", "title": "Chapter 362 - Chapter 362: 362 Unleaking Realm Third Layer", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 362 - Chapter 362: 362 Unleaking Realm Third Layer</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 362: 362 Unleaking Realm Third Layer<br/><br/>An invisible fluctuation enveloped Gu Yang and his companions.<br/><br/>“Huh?”<br/><br/>Gu Yang sharply sensed that his surroundings had become a mana vacuum, any leaked mana was instantly sucked dry, vanishing without a trace.<br/><br/>His instinct led him to seal up his mortal body, preventing the loss of internal mana.<br/><br/>“A Forbidden Magic Field?”<br/><br/>The High Priest’s complexion drastically changed as he cried out.<br/><br/>Within a Forbidden Magic Field, any existence of magic spells were forbidden, as a result, spells, fighting energy, and every transcendent power in existence were rendered unusable.<br/><br/>Among the five elves present, there were priests, mages, and druids…<br/><br/>Inside the Forbidden Magic Field, they all lost their strongest fighting power, becoming immensely vulnerable.<br/><br/>The ones most unaffected were the three monsters. Even though they could not use their inherited magic, their formidable physical strength and close combat abilities were still superlative.<br/><br/>However, due to the infamous reputation of the Demon Heart Lord, they lacked even the courage to fight, spending the whole time cowering at the back.<br/><br/>Among monsters, hierarchy was stringent – they did not meddle with existences higher than their own in the order. This was inscribed in their genetic makeup.<br/><br/>To them, submitting to more powerful monsters was a matter of course.<br/><br/>That they had not betrayed them on the spot was a small mercy.<br/><br/>Swoosh, swoosh, swoosh ——<br/><br/>Suddenly, a series of whooshing sounds broke out. Several sprays of blood erupted from the bodies of the three monsters who collapsed onto the ground.<br/><br/>Upon closer inspection, several thick crossbow bolts were lodged in their bodies.<br/><br/>Yes, crossbow bolts.<br/><br/>A monster wielding crossbow bolts, that was a bit bizarre.<br/><br/>A massive figure emerged from the forest beside them. It was a giant, standing over ten meters tall. Dressed in beast skins, characterized by her feminine traits, it was a female giant.<br/><br/>A large crossbow made entirely of metal was in her hand, exuding a cold metallic glow. It was a type that could simultaneously shoot multiple bolts.<br/><br/>The five elves present looked slightly pale when they saw the giant.<br/><br/>Who could have expected that the Demon Heart Lord was actually a giant who could employ a Forbidden Magic Field, armed with a crossbow capable of toppling higher-ranked monsters.<br/><br/>The elven race was inherently lacking in physical strength. Their only legendary warrior had died in a previous clash with the Black Dragon.<br/><br/>Now, even the legendary third-ranked High Priest was incapable of using divine magic. The giant, towering over ten meters tall, could kill her with just a flick of her finger.<br/><br/>At this moment, Gu Yang spoke up, “You’re not the Demon Heart Lord.”<br/><br/>The giant’s brutal and cruel eyes fell upon him, the expression in them full of deep hatred and disgust, “Nasty, despicable human ——”<br/><br/>Gu Yang’s eyes darted to a tree on the left, saying, “Found you!”<br/><br/>With a swish, he disappeared from his original spot.<br/><br/>The following moment, he appeared by a tree, reaching out to snatch something from it – it was a rather grayish-looking squirrel.<br/><br/>The small critter, once seized, tried to struggle frantically in panic but seemed utterly powerless.<br/><br/>“Release it!”<br/><br/>The female giant’s face changed drastically as she let out a harsh shout, strode forward, and charged toward Gu Yang.<br/><br/>Despite her huge figure, she was strangely agile and swift. In only two strides, she had reached Gu Yang and swung a hand towards him.<br/><br/>Whoosh ——<br/><br/>The draft caused by her swipe demonstrated how formidable her strength was.<br/><br/>Gu Yang clutched the squirrel in one hand. Trapped within the Forbidden Magic Field, he was unable to take any weapon out of the Beast-Taming Space, and faced the slap from a giant four to five times his size. He neither tried to dodge nor avoid, instead, he punched out.<br/><br/>The four elves who witnessed the scene, paled in terror, unwilling to watch the end.<br/><br/>A giant over ten meters tall was an extremely rare species with innate supernatural strength, comparable to that of a dragon. An adult giant could grapple with a higher-ranked monster.<br/><br/>Within a Forbidden Magic Field, such a giant was not something an ordinary human being could contend with. Even a holy knight would be smashed into a meat pancake by her palm.<br/><br/>Only the High Priest could keep her composure.<br/><br/>Bam!<br/><br/>The next moment, with a loud noise, the gigantic figure of the giant was sent flying.<br/><br/>Gu Yang, who they thought would be smashed into a pancake, was still standing. A large pit had appeared under his feet, the origin of which was unknown.<br/><br/>The four elves looked dumbfounded, almost unable to believe their eyes.<br/><br/>A human had sent a grown giant flying.<br/><br/>How was that even possible?<br/><br/>Even the High Priest, who had witnessed Gu Yang’s power numerous times, had a sudden jump in her heartbeat.<br/><br/>She had tried her best to overestimate his power, and yet, she was still taken aback.<br/><br/>It was way too dramatic.<br/><br/>Meanwhile, the three monsters had already fainted.<br/><br/>…<br/><br/>[Acquired two hundred energy points, current balance eight thousand and one hundred points.]<br/><br/>Gu Yang’s punch directly killed the giant.<br/><br/>This was a profound martial art skill. Against these kind of brutes, there couldn’t be a better counter.<br/><br/>That punch had pierced through her body, turning her internal organs and even brain matter into mush.<br/><br/>Actually, the order of this giant was not that high, it was equivalent to the legendary second rank.<br/><br/>It couldn’t be compared to the three Gods at all.<br/><br/>However, in terms of the danger level, it wasn’t any less.<br/><br/>Under the Forbidden Magic Field, the three Gods had to watch out, if they really started fighting, all three might not be able to handle a combination of this giant and the Forbidden Magic Field.<br/><br/>Especially this giant, who even knew how to make crossbows. Right from the start, she managed to take down the three most threatening monsters.<br/><br/>Unfortunately, she encountered Gu Yang, an oddball.<br/><br/>Until her death, the giant probably couldn’t understand that she could be killed with one punch by a tiny human.<br/><br/>“I offer you two choices.”<br/><br/>Gu Yang stared at the squirrel in his hand, speaking, “Either die. Or become my pet.”<br/><br/>Witnessing the fate of her partner, the squirrel’s look became even more fearful. It trembled violently, making a squeaking noise.<br/><br/>“Can’t you speak?”<br/><br/>Desperately, the squirrel nodded.<br/><br/>Gu Yang was surprised. A beast that could use the Forbidden Magic Field couldn’t even speak. It defied logic.<br/><br/>Generally speaking, beasts would be able to speak once they reach the legendary stage.<br/><br/>To have a domain reflects the peak of the legendary third stage, infinitely close to a Half-God.<br/><br/>He said, “First, put away the Forbidden Magic Domain.”<br/><br/>Instantly, the invisible pressure disappeared.<br/><br/>The five elves finally sensed the existence of magic and elements. Looking at the squirrel in Gu Yang’s hand, fear could be seen in their eyes.<br/><br/>As practitioners of magic, they instinctively fear entities capable of using the Forbidden Magic Domain.<br/><br/>Once the Forbidden Magic Domain is activated, they immediately become useless.<br/><br/>Gu Yang said, “Next, do as I say. Let your mind loose, do not resist at all, and sign this contract with me…”<br/><br/>Moments later, a blood-red Magic Array appeared in the void, constantly shrinking. It’s flying towards the squirrel’s body. Just as it was about to touch the squirrel’s body, the Magic Array disappeared into thin air.<br/><br/>Gu Yang’s gaze turned dangerous, he said, “You only have one more chance.”<br/><br/>He tried again.<br/><br/>This time, it went smoothly. The squirrel didn’t dare to resist, and let the Magic Array enter its head.<br/><br/>When everything was over, the contract was completed.<br/><br/>This squirrel became the third pet beast of Gu Yang.<br/><br/>He was surprised that this squirrel was actually of the second tier of the legendary stage.<br/><br/>After signing the contract, he could communicate simply with the squirrel.<br/><br/>According to it, it was originally an ordinary squirrel. It wasn’t a magical beast at all. It gained its current power because of a fortuitous encounter.<br/><br/>It gestured with its hands and squeaked. Gu Yang could only roughly understand that it encountered a mutation after accidentally eating something. One day, it suddenly possessed the Forbidden Magic Domain.<br/><br/>However, it couldn’t explain where that place was.<br/><br/>Too much time has passed, it hadn’t yet awakened its intelligence. Later, something terrifying happened, it left that place and came to the Misty Forest.<br/><br/>It became partners with the giant and settled down here. Now, it has been over two hundred years.<br/><br/>The giant brought him to the Misty Forest and found lots of good things. It kept evolving and got to its current rank.<br/><br/>…<br/><br/>Next, Gu Yang brought the squirrel and continued his hunting journey.<br/><br/>With the Forbidden Magic Domain, hunting magical beasts became a lot easier and efficient. The beasts often didn’t have time to react before they got killed.<br/><br/>His power was much stronger than that of the giant. Coupled with the Forbidden Magic Domain of this squirrel, the killing power was even greater.<br/><br/>After killing a few more beasts, they finally came up empty. The superior beast was not in the den.<br/><br/>Then, after two more unsuccessful attempts, he understood that the news must have leaked and the superior beasts had run away.<br/><br/>Gu Yang didn’t waste any more time and decided to return to the court.<br/><br/>This trip was incredibly fruitful, nearly twenty superior beasts were killed, among them, three were lord-level beasts.<br/><br/>Another lord-level beast became his pet beast.<br/><br/>The threats around the Elf King Court were almost cleaned up. It was believed that the elves could enjoy a period of peace for a long time to come.<br/><br/>More importantly, his energy balance reached nine thousand three hundred points, almost breaking ten thousand.<br/><br/>It could be said to be a bountiful harvest.<br/><br/>…<br/><br/>…<br/><br/>Gu Yang went straight back to his exclusive treehouse and immediately opened the system.<br/><br/>[Do you want to use the Life Simulator? Using it once will consume two hundred points of energy.]<br/><br/>“Yes.”<br/><br/>[At twenty-three, you have already reached the second level of the Unleaking Realm. In the West Bank Continent, you have become a follower of the Moon God and have slaughtered fifteen Black Dragons.]<br/><br/>[Two months later, a dragon from the Celestial Being realm comes to the Elf King Court to avenge you.]<br/><br/>[You, along with the High Priest and summoned Angel, severely wounded the Dragon, forcing it to flee.]<br/><br/>[Suddenly, an Evil God descends. You use the Squirrel’s Forbidden Magic Domain to obliterate the incarnation of the Evil God.]<br/><br/>[Five years later, the human kingdom undergoes a major change, an Evil God arrives, and the continent falls into chaos.]<br/><br/>[Eight years later, the Evil God turns to attack the Misty Forest, the Elf King Court falls. You die in battle, age thirty-six.]<br/><br/>He was targeted again.<br/><br/>It seemed that the Evil God saw him as a threat and wanted to kill him first.<br/><br/>The more powerful he got, the shorter his lifespan.<br/><br/>He had encountered this more than once or twice before.<br/><br/>Fortunately, the Evil God did not descend directly to kill him on the spot.<br/><br/>It seemed that He did not have full confidence, so He did not take action.<br/><br/>Gu Yang was somewhat relieved. Facing a mighty Celestial Being, he no longer felt as powerless as before.<br/><br/>[Simulation over, you can choose to keep one of the following.]<br/><br/>[…]<br/><br/>“I choose two.”<br/><br/>…<br/><br/>[… You, along with an angel, killed the incarnation of the Evil God.]<br/><br/>[… You died at the age of forty-two.]<br/><br/>This time, Gu Yang made adjustments. During the battle with the incarnation of the Evil God, he did not use the Forbidden Magic Domain.<br/><br/>As expected, he was not targeted by the Evil God and managed to survive until forty-two.<br/><br/>After claiming the reward, Gu Yang started another continuous simulation.<br/><br/>After each simulation, the results were very similar.<br/><br/>After each reward claim, he needed a little time to recover.<br/><br/>Without realizing it, Gu Yang had done forty simulations in a day and a night.<br/><br/>He felt a little groggy. In just one day, he had inherited over seven hundred years of Martial Arts knowledge and insights. If it wasn’t for his powerful Original Spirit, his head would have exploded from the pressure.<br/><br/>Forty-first time.<br/><br/>[… At the brink of life and death, you have figured out how to integrate the Original Spirit into every drop of blood, taking the first step. Later, you were killed, dying at the age of forty-two.]<br/><br/>Finally, it was a success!<br/><br/>PS: Please vote.\t\t\t\t\t\t</div>", "images": {}, "success": true}