{"id": 366, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132334.html", "title": "Chapter 366 - Chapter 366: 366 Thirty-Three Heavens", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 366 - Chapter 366: 366 Thirty-Three Heavens</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 366: 366 Thirty-Three Heavens<br/><br/>Two days later, at the entrance of the Star Picking Pavilion.<br/><br/>Gu Yang came alone, and the disciples from the academy he met on the way all paid their respects, respectfully calling him Master Gu.<br/><br/>The disciples of the academy are proud, considering themselves well versed in both civil and military matters. There are many powerful cultivators with divine powers in Great Zhou, but very few can gain their approval.<br/><br/>Most divine power cultivators, in their eyes, are nothing more than mere warriors. No matter how strong they are, they cannot command their respect.<br/><br/>Their idols are like the Dean, possessing remarkable achievements in the scholarly path, and can stand above all others in martial arts.<br/><br/>Great Zhou has many powerful individuals who have left legendary stories behind.<br/><br/>Like Qin Wu, who almost single-handedly held back the tide, resisting an entire dynasty with his power alone.<br/><br/>Like the top ten Sword Saints, who have roamed the Jianghu (martial arts underworld) full of romantic idealism.<br/><br/>And there’s Cheng Tianxin, an inspiring grassroots hero…<br/><br/>These figures, in the academy, receive both praise and criticism.<br/><br/>Qin Wu, has great martial strength but no political skills, it’s no surprise that he failed in his lone challenge against the world.<br/><br/>The top ten Sword Saints, relying on unparalleled divine weapons to bully people, can’t even make it onto the master list. Without their divine weapons, they’re nothing.<br/><br/>Cheng Tianxin, with his low power, not even reaching the Divine Power realm, as a mere pawn in the hands of the powerful, he is considered a hero?<br/><br/>So far, the number of figures who have gained the approval of a majority of the academy’s disciples can be counted on one hand.<br/><br/>Gu Yang is one of them, and he is undoubtedly the most unique one.<br/><br/>His legendary growth experiences are secondary, what truly earns the academy disciples’ profound admiration is his unmatched charm.<br/><br/>Managing to win the hearts of nearly half of the unforgettable beauties on the Beauty List, willingly sharing one husband, such accomplishments can truly be called unparalleled in history and unmatched in the future.<br/><br/>The women by his side include the current Empress Dowager, the most powerful woman in Great Zhou.<br/><br/>The former princess, who disregarded societal standards for him.<br/><br/>There’s Chu Xiyue, and Cao Yiyi, both are the direct descendants of the nine great families.<br/><br/>And even Ye Lingbo, the chief disciple of the academy, who is rumored to be the reincarnation of an ancient great power…<br/><br/>The other two, Su Qingzhen and Ling Ling, are not as famous, but both are at the realm of Divine Power. For their age, they can be called unparalleled prodigies.<br/><br/>As a man, Gu Yang is the victor of life. Such achievements are enough to make the young men of the world pay their highest respects.<br/><br/>The majority of disciples in the academy are men, and they are no exception.<br/><br/>At this moment, at the entrance of the Star Picking Pavilion, Ye Lingbo, dressed in a long robe, stood there with her eyes watery, waiting for Gu Yang to come over and walk in side by side.<br/><br/>This scene is like a world-class painting in the eyes of others.<br/><br/>All they have in their hearts is envy.<br/><br/>…<br/><br/>“Golden Body, third stage.”<br/><br/>Gu Yang couldn’t help admiring the rapid progression of Ye Lingbo.<br/><br/>The last time they met was over a month ago.<br/><br/>This reincarnated ancient power is extraordinary.<br/><br/>“Unleaking Realm, third stage!”<br/><br/>The shock in Ye Lingbo’s heart was even greater than his.<br/><br/>The last time they met, he had just reached the Unleaking Realm, and now, he is in the third stage of the Unleaking Realm.<br/><br/>Compared to him, her progress seemed insignificant.<br/><br/>Soon, she brought up the matter at hand. “Last time you killed a Nascent Soul from the Ancient River Sword Sect, they will not let it go easily.”<br/><br/>“I know.”<br/><br/>“In the Ancient River Sword Sect, there is a cultivator at the Spiritual Transformation Realm, equivalent to the Celestial Being Realm.”<br/><br/>“I know that too.”<br/><br/>Ye Lingbo asked, “Why would you take such a risk?”<br/><br/>Gu Yang said, “The Head Teacher Wen is about to make a breakthrough soon. She has actually been discovered by the native cultivators in the Water Moon Sky, I need to go help her.”<br/><br/>Wen Jue, the Head of the Dao Sect, Unleaking Realm, third stage, only one step away from becoming a Celestial Being.<br/><br/>She has been seeking opportunities for breakthroughs in the Water Moon Sky for many years.<br/><br/>During a previous simulation, Wen Jue tried to break into the Celestial Being Realm, but was besieged and killed by the Nascent Soul cultivators of Water Moon Sky, ruining her efforts.<br/><br/>He owed her a favor from the last time with the emperor’s killing, it was natural for him to give her a hand.<br/><br/>Furthermore, it would be a good thing for Great Zhou to have one more Celestial Being.<br/><br/>Then, in his camp, there would be the gradually recovering Dean, and the newly advanced Wen Jue, having one more strength to face future crises.<br/><br/>Ye Lingbo was slightly startled. She didn’t know where he got his information, but he was not the kind of person to speak lightly.<br/><br/>She asked with some seriousness, “Are you sure you can handle this?”<br/><br/>The Water Moon Sky was not just the Ancient River Sword Sect; there were quite a few Celestial Beings. The number of Nascent Souls added up to dozens.<br/><br/>Two cultivators at the third stage of the Unleaking Realm were not enough to confront such a massive power.<br/><br/>“Yes.”<br/><br/>Gu Yang spoke with great conviction.<br/><br/>Before he entered, he had used a simulation to ensure that there would be no danger, which enabled him to embark on this journey to the Water Moon cave heaven.<br/><br/>Ye Lingbo said nothing more after that.<br/><br/>In a short while, they arrived at the top floor. Ye Lingbo opened the entrance to the Water Moon cave heaven, and the two of them stepped in.<br/><br/>…<br/><br/>Ancient Sword Mountain, atop the main peak, stood an ancient sword hall.<br/><br/>This was the core of the Ancient River Sword Sect, where the Sect leader resided.<br/><br/>A middle-aged man in a purple robe was nurturing his sword in meditation. Suddenly, the archaic long sword in his hand started to vibrate violently.<br/><br/>He opened his eyes, a sharp glint flashing in his pupils, “He dares to show himself again!”<br/><br/>Previously, he did not pay much mind to the death of a true lineage disciple.<br/><br/>But now that a mountain lord had been murdered, he could no longer turn a blind eye to it.<br/><br/>The Ancient River Sword Sect had only nine mountain lords. The death of the Bihanshan lord was a significant loss to the sect.<br/><br/>Moreover, if they couldn’t retaliate for a mountain lord being killed, how would others perceive the Ancient River Sword Sect?<br/><br/>He waved his large sleeves, scattering beams of light that raced out towards various peaks.<br/><br/>A moment later, several beams of sword light returned. All the present bee lords of the Sect had gathered.<br/><br/>One of the peak lords asked, “What is so urgent, Sect leader, that you called for all of us?”<br/><br/>The Sect leader said coldly, “The murderer who killed Brother Li has appeared again. I request you all to take actions and kill this beast to avenge Brother Li.”<br/><br/>Once the peak lords heard this, they all responded, “We shall follow the Sect leader’s command.”<br/><br/>Then, after the four peak lords on the scene understood the location of the murderer that had slain the Bihanshan lord, they left with murderous intent.<br/><br/>Four streams of light flew out from Ancient Sword Mountain, a piece of news that quickly spread throughout the world.<br/><br/>As one of the well-known major sects, countless eyes were watching this place. Thus, such a major action naturally couldn’t escape the knowledge of others.<br/><br/>Of course, the Ancient River Sword Sect never intended to keep it hidden from others.<br/><br/>The news of the death of the Bihanshan lord had already spread throughout the world.<br/><br/>Everyone knew that one of the nine major peak lords of the Ancient River Sword Sect was killed by a wandering cultivator.<br/><br/>This caused a severe blow to the prestige of the Ancient River Sword Sect.<br/><br/>They had to regain their honor.<br/><br/>“Junior Sister, you all have already seen brother Li’s body. That strange injury is not like anything from this world. It is probably similar to that woman, who comes from a foreign domain.”<br/><br/>The speaker was a man dressed in black, the Nine Rivers peak lord. When he mentioned “that woman,” his expression became rather solemn.<br/><br/>The Junior Sister he referred to, the Red Maple peak lord, had the best relationship with Bihanshan lord. Originally, it was her who lent the mysterious light shield to the Bihanshan lord.<br/><br/>Her desire for revenge was the most intense.<br/><br/>Her cultivation level was at the late stage of the Nascent Soul, second only to the Sect leader. Therefore, this operation naturally took her leading role.<br/><br/>“Brother had the protection of the mysterious light shield. That person could kill Brother, so naturally, I will not underestimate him. After catching up with him, we will lay out the Four Images Sword Formation and kill him off.”<br/><br/>The Red Maple peak lord acted very calm. She was not blinded by hatred.<br/><br/>She was well aware of how dangerous those people from the foreign domain were.<br/><br/>A few years ago, the peerless sword seedling of Tianyuan Sect nearly fell into the hands of that woman.<br/><br/>The third peak lord raised a question, “How did these foreign domain people come here?”<br/><br/>The Nine Rivers peak lord said, “I have flipped over many of the sect’s oldest books. According to the records, our world here is known as Water Moon cave heaven, which is one of the thirty-three heavens …”<br/><br/>“Hey, Water Moon cave heaven, isn’t that saying that the Water Moon Sect is the owner of this world? Aren’t you boosting their morale, Junior Brother?”<br/><br/>“This is recorded in the books, not something I made up …”<br/><br/>“Enough.”<br/><br/>The Red Maple peak interrupted their argument and asked, “You mean, that woman, and the murderer who killed Brother Li, are from one of the other thirty-two heavens?”<br/><br/>“Not really. According to the book’s records, a great cataclysm occurred a thousand years ago, affecting the entire world. Just when it seemed like … this world was about to collapse, several great powers joined forces and severed the connection with the other worlds.”<br/><br/>“You should all know that according to ancient legends, this world was vast and boundless, dozens or even hundreds of times larger than our present territory. It’s because of that catastrophe, that the great powers could only manage to save this piece of land.”<br/><br/>“Although this world has become independent, disconnected from the thirty-two other heavens, its connection with the human realm remains, which cannot be severed. Therefore, those two people can only possibly be from the human realm.”<br/><br/>Red Maple peak lord repeated, “Human Realm? If that’s true, the thirty-three heavens would be equivalent to the immortal realm for the human realm …”<br/><br/>Nine Rivers peak lord gave a bitter smile, “After that ancient cataclysm a thousand years ago, the path to immortality was severed. One can only cultivate to the Spiritual Transformation Realm at most. Where else could there be an Immortal realm?”<br/><br/>Suddenly, everyone fell silent.<br/><br/>This topic was somewhat heavy. There are numerous ancient legends in this world. Several sects still retain some cultivation methods and books.<br/><br/>They naturally knew that the Spiritual Transformation period was only a human immortal, above which were Earth Immortal, Celestial Immortal, and even Da Luo Golden Immortal.<br/><br/>However, in the cultivation world nowadays, you can only cultivate to the Spiritual Transformation period at most. It is indeed said that the path to immortality has been severed.<br/><br/>The Spiritual Transformation period only has a life span of about two thousand years. Once its time comes, even if your divine power is invincible, you’ll still perish.<br/><br/>Eternal life?<br/><br/>It only exists in the ancient legends.<br/><br/>Suddenly, the Red Maple peak lord shouted, “Found him, set up the formation.”<br/><br/>The other three Nascent Souls reacted extremely quickly, instantly setting up a great Four Images formation.\t\t\t\t\t\t</div>", "images": {}, "success": true}