{"id": 376, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132353.html", "title": "Chapter 376 - Chapter 376: 376 Confrontation", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 376 - Chapter 376: 376 Confrontation</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 376: 376 Confrontation<br/><br/>“What?”<br/><br/>“How could this be?”<br/><br/>“The Human Emperor’s Sword!”<br/><br/>The sudden death of Emperor Wei sent shockwaves through everyone present.<br/><br/>Especially for the Bi Shui Daoist and Shen Bulin, their minds were filled with horror.<br/><br/>Since the ancient times, when true immortals began to emerge from the Water Moon Sect, there had never been an instance of a true immortal falling in battle.<br/><br/>Only two immortals had died so far, both of them passing away naturally at the end of their lifespan.<br/><br/>Emperor Wei was the first true immortal to be killed by someone, murdered right under their noses by a youngster at the nascent soul stage.<br/><br/>How could they not be shocked?<br/><br/>The power that the youngster had just burst out was completely beyond their imagination.<br/><br/>The golden stamp that Emperor Wei sacrificed was clearly a spiritual treasure. With the enhancement of this spiritual treasure, his power nearly reached the middle stage of self-realization, almost equal to that of Fu Wansheng.<br/><br/>However, he was slain by a single sword.<br/><br/>No, no, the youngster didn’t even draw his sword.<br/><br/>“The Human Emperor’s Sword!”<br/><br/>It wasn’t until they heard Yun Piaomiao’s exclamation that they were taken aback.<br/><br/>The Human Emperor’s Sword?<br/><br/>Could it be the legendary first treasure of the human race from ancient times? This sword might not be the most powerful divine weapon among humans, but it is definitely the most famous.<br/><br/>During the ancient times, the first Human Emperor opened the brilliant path of the human race with this sword, making an indelible contribution to the rise of the human race.<br/><br/>This sword holds a special significance for the human race.<br/><br/>It is also the universally recognized sword of the human sovereign.<br/><br/>No wonder Emperor Wei died. In front of the Human Emperor’s Sword, no one, no matter who they are, has the right to claim to be the emperor.<br/><br/>Whether it’s the golden seal or Emperor Wei himself, their attitudes towards the Human Emperor’s Sword are nothing but usurpation. It was no injustice that they died.<br/><br/>Swish—<br/><br/>The reaction of the Bi Shui Daoist cannot be said to be slow. He had already recalled his spiritual treasure flying sword, fearing a collision with the Human Emperor’s Sword.<br/><br/>His Bi Shui Sword, although a spiritual treasure, how could it compare to the legendary Human Emperor’s Sword?<br/><br/>If it collided and damaged this spiritual treasure, he wouldn’t even have time to regret it.<br/><br/>…<br/><br/>[Acquired 5000 energy points, current balance 6300 points.]<br/><br/>[Acquired 5000 energy points, current balance 11300 points.]<br/><br/>Gu Yang looked at the man wearing the dragon robe and his golden dragon above his head turn into ashes, stupefied for a moment.<br/><br/>Upon seeing the two prompts popping up in front of him, his eyelids twitched severely.<br/><br/>Glory to the Human Emperor’s Sword!<br/><br/>Gu Yang couldn’t help but exclaim in his heart.<br/><br/>Frankly speaking, when he drew the Human Emperor’s Sword, he didn’t think much, simply that it was the most useful divine weapon.<br/><br/>He had initially intended to use the Zhanxuan Sword Technique to withstand the lethal flying sword.<br/><br/>Who knew that as soon as he drew the Human Emperor’s Sword, it exploded on its own, slaying the man wearing the dragon robe with a golden dragon above his head on the spot.<br/><br/>By the time Gu Yang reacted, two prompts had already popped up in front of him.<br/><br/>One was the reward for defeating the Celestial Being.<br/><br/>What was the other one?<br/><br/>Could it be a reward for destroying a spiritual treasure?<br/><br/>A genuine Celestial Being is indeed precious.<br/><br/>Five thousand energy points!<br/><br/>Previously, when he killed the master of the Nether Sect, he only received a thousand points. It seems that he was just a phony Celestial Being; he was still far from reaching the real Celestial Being realm.<br/><br/>Looking at the other two Celestial Beings who were stunned by the sword just now, Gu Yang placed the Human Emperor’s Sword in front of him, his eyes deep and didn’t initiate an attack.<br/><br/>His current power was still somewhat lacking compared to that of a Celestial Being. If a fight were to break out, it would be very disadvantageous for him.<br/><br/>The most important thing is, after the Human Emperor’s Sword slew the man who usurped the Emperor’s title, it fell silent. Without the help of the Human Emperor’s Sword, it was impossible for him to kill those two Celestial Beings.<br/><br/>However, the opponents didn’t know this.<br/><br/>What he was doing now was tactical deterrence.<br/><br/>The present situation was two against three, seemingly advantageous to them.<br/><br/>In reality, the two on the other side were genuine Celestial Beings with immense combat strength.<br/><br/>For them, the principal’s power had not fully recovered and he was still an injured being. Wen Jue had just broken through but likely hadn’t mastered even a single Immortal Technique yet, adding onto him.<br/><br/>If a real fight were to break out, the outcome would be unpredictable.<br/><br/>…<br/><br/>On the other side, the Bi Shui Daoist and Shen Bulin were wary of the divine might of the Sword of the Human Emperor, but they weren’t scared enough to turn tail and bolt.<br/><br/>With their keen eyesight, they naturally could see that the young man in the Nascent Soul stage hadn’t really gained control over the Sword of the Human Emperor.<br/><br/>A treasure of such high order was not something a Nascent Soul could control.<br/><br/>The times were different now than in the ancient days, there were numerous Nascent Soul cultivators who had killed Human Immortals with the help of innate divine treasures.<br/><br/>However, the Way of Heaven had now collapsed, even innate divine treasures were eroding over time, with their powers depleting bit by bit. The Primordial Spirit, for its own preservation, wouldn’t recklessly squander its power.<br/><br/>No matter how overbearing the Sword of the Human Emperor was, it couldn’t possibly kill everyone it saw. If that were the case, it wouldn’t have survived till the present day.<br/><br/>Therefore, neither side wanted to start a fight nor retreat, they were at a standoff with Gu Yang and the others.<br/><br/>Both parties were waiting, waiting for one of the other two to determine the victor.<br/><br/>Those two were Fu Wansheng, the head of the Water Moon Sect, and Yun Piaomiao, the founder of the Piaomiao Sect. They had become the determining factors of this celestial battle.<br/><br/>…<br/><br/>“The Sword of the Human Emperor!”<br/><br/>The first to recognize the Sword of the Human Emperor was Yun Piaomiao.<br/><br/>He shrouded himself in a layer of mist and had brought Fu Wansheng, the leading figure of the Water Moon Celestial Realm, under his control with his first move, displaying his shrewdness and competence.<br/><br/>However, after he discovered the Sword of the Human Emperor, his entire aura changed, becoming more intense. The aura he exuded in an instant put everyone present under immense pressure.<br/><br/>“Is he really a Celestial Being?”<br/><br/>Gu Yang was taken aback – who exactly was this person?<br/><br/>The impression he gave was far from a normal Celestial Being.<br/><br/>In this world, there were variations among celestial beings too.<br/><br/>The highest caliber undoubtedly belonged to the Xia Emperor, and Lord Chi Ming.<br/><br/>Leaving aside the Xia Emperor, Lord Chi Ming was formidable precisely because they were probably an ancient power. Their original cultivation level was far beyond a Celestial Being, but they fell to this realm after the substantial changes in world order and the collapse of the Way of Heaven.<br/><br/>Naturally, this ancient power far surpassed ordinary celestial beings in strength.<br/><br/>He suspected that Yun Piaomiao might be an ancient power, surviving till now through some unknown method.<br/><br/>If that were truly the case, they would be in big trouble.<br/><br/>The four of them combined might not be a match for him.<br/><br/>The question now was, how did he manage to survive in the simulation?<br/><br/>Gu Yang must’ve simulated before making a move, knowing it wouldn’t be dangerous before proceeding.<br/><br/>However, the simulation only provided a brief overview, and he had no knowledge about the specifics of what had transpired.<br/><br/>All he knew was that it was a close call this time, they managed to rescue Wen Jue – and Great Zhou gained another powerful Celestial Being.<br/><br/>…<br/><br/>“No!”<br/><br/>At this moment, Fu Wansheng suddenly let out a roar. A vertical eye appeared on his forehead, emitting a golden glow as he wrestled free from his restrained state.<br/><br/>At this moment, he was like a deity descending on earth, with awe-inspiring power. The beam of light shot from the vertical eye on his forehead hit Yun Piaomiao, instantly dispelling the mist around him and revealing his true face.<br/><br/>Upon seeing Yun Piaomiao’s appearance, Fu Wansheng exclaimed as if he had seen a ghost, “Impossible——”<br/><br/>A faint sneer crossed Yun Piaomiao’s face, “The moment I restrained you, you should’ve known who I am.”<br/><br/>“I don’t care who you are, you’re going to die!” Fu Wansheng’s expression turned incredibly cold, and the golden light in the vertical eye on his forehead started to gather.<br/><br/>“I never thought you’d actually manage to master this divine power. However, it’s useless against me.”<br/><br/>Yun Piaomiao brushed off the golden light emanating from Fu Wansheng’s vertical eye, and said, “I always treated you well; why did you betray me? Was it really for that woman?”<br/><br/>Fu Wansheng remained silent. The golden light from his forehead shot towards Yun Piaomiao but dissolved just before it hit him, unable to inflict any damage.<br/><br/>Yun Piaomiao continued, “You don’t want to speak? That’s fine, I know how to make you talk. She is here, isn’t she?”<br/><br/>This comment made Fu Wansheng’s face turn ashen.<br/><br/>Ps: Please vote for the monthly ticket.\t\t\t\t\t\t</div>", "images": {}, "success": true}