{"id": 378, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132357.html", "title": "Chapter 378 - Chapter 378: 378 I Am Really A Genius", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 378 - Chapter 378: 378 I Am Really A Genius</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 378: 378 I am really a genius<br/><br/>“Huh?”<br/><br/>For the first time, Yun Piaomiao turned his head to look at someone else, not because of what the other party said.<br/><br/>Like him, no longer would he be infuriated by a single word from others. To him, cultivators at the Nascent Soul stage are no different from ants on the roadside.<br/><br/>If it weren’t for the great changes in the world, the collapse of the Way of Heaven, these Nascent Soul cultivators would not even have the right to stand before him.<br/><br/>What really shocked him was that, the other party was able to defy the spatial laws of the Mountain and River Chart and appear right in front of him.<br/><br/>Even though the Way of Heaven had collapsed and he had lost his Primordial Spirit, lessening the power of the Mountain and River Chart to less than a tenth of its former power, it still shouldn’t be something that a Nascent Soul boy could breach.<br/><br/>No, not even a Nascent Soul, merely a tiny little Nascent Soul, a solo cultivator at that, who had integrated various types of monster race essence blood into his body.<br/><br/>Yun Piaomiao immediately saw through the other party’s background. The only thing he took seriously was the Human Emperor Sword in the other party’s hand.<br/><br/>However, while the Human Emperor Sword is incredibly powerful, this place is not the Human Realm, it is not within the territory of the Human Emperor, so its power is greatly reduced. Given its current state, it would be impossible to break through the spatial barrier of the Mountain and River Chart.<br/><br/>Yun Piaomiao became a bit curious, opened his Dharma Eye for a better look, a touch of surprise appeared on his face, “The Way of the End of Dharma? Are you a disciple of that Immortal Venerable?”<br/><br/>…<br/><br/>When Gu Yang flew out, breaking through the spatial prohibition and appearing in front of Yun Piaomiao, everyone present was taken aback.<br/><br/>Especially Bi Shui Daoist and Shen Bulin, they could not imagine how they, holding a spiritual weapon, were unable to escape this domain.<br/><br/>This young man in the Nascent Soul stage was actually able to ignore this spatial prohibition as if it were nothing, breaking through just like that.<br/><br/>Moreover, he did not seize the opportunity to escape, but rather approached that terrifying figure that resembled a Celestial Immortal, intending to save someone.<br/><br/>This youngster is indeed loyal and righteous. However, he is certainly overestimating his abilities.<br/><br/>The other party is a Celestial Immortal. Even if they have fallen to be at par with the Nascent Soul stage, they could still utilize the power of the Mountain and River Chart, possessing Celestial Rank spiritual treasures like the Questioning Heart Mirror.<br/><br/>Even Fu Wansheng, widely recognized as the top figure in the Shuiyue Cave, was defenseless.<br/><br/>He is just a cultivator at the Nascent Soul stage, even if he can break through this spatial prohibition and wield the Human Emperor Sword, how could he be a match for that Celestial Immortal?<br/><br/>…<br/><br/>“Gu Yang?”<br/><br/>Wen Jue and the Dean were also surprised, they knew Gu Yang always acted unpredictably. Every time he appeared, he would bring some “surprises”.<br/><br/>It was the same this time.<br/><br/>He showed up at the critical moment, saving Wen Jue’s life and killing a powerful Nascent Soul cultivator.<br/><br/>Using his Unleaking Cultivation Level to kill a Celestial Being realm expert, even if he had borrowed the power of the Human Emperor Sword, it was still shocking to the extreme.<br/><br/>Everything was going smoothly until a terrifying, ancient Celestial Immortal appeared and displayed his terrifying strength. Playing around with Fu Wansheng, who’s Cultivation Level had already reached the middle stage of Nascent Soul, like a plaything.<br/><br/>Those beginners like them were trapped right here, unable to use their magic at all.<br/><br/>This is the second time the Dean has come across a powerful figure originating from ancient times.<br/><br/>The former one was Lord Chi Ming, who used his utmost effort and paid a heavy price to barely kill one of his incarnations.<br/><br/>Now, this Yun Piaomiao gave him a more oppressive feeling than Lord Chi Ming.<br/><br/>However, he hasn’t yet fully recovered to his peak at this moment.<br/><br/>He feels helpless when facing this figure even more terrifying than Lord Chi Ming.<br/><br/>When Ye Lingbo was taken away by Yun Piaomiao, both of them felt their hearts sink, knowing that they were most probably doomed this time.<br/><br/>Until Gu Yang stepped forward, they were both surprised and delighted.<br/><br/>Delighted that he could break free from the spatial prohibition.<br/><br/>Surprised that he intended to save Ye Lingbo.<br/><br/>Doesn’t that amount to seeking his own death?<br/><br/>Even if Gu Yang had previously achieved glorious merits in battle, they had zero confidence in him.<br/><br/>That’s an old monster who survived from ancient times, and possesses a metaphysic unformed treasure and a Celestial Ranked treasure. His formidable strength is plain to see.<br/><br/>Unless Gu Yang cultivates the “Nine Heavens Divine Method” to the same level as the Xia Emperor, perhaps he still has a slim chance.<br/><br/>…<br/><br/>When Ye Lingbo heard Gu Yang’s voice and caught sight of him standing not far away, a mix of complex emotions flashed in her eyes.<br/><br/>When she initially decided to form a Dao companion partnership with Gu Yang, her intentions were very utilitarian.<br/><br/>Namely, she aimed to use his Pure Yang Body to refine the Immortal Element within her body.<br/><br/>Although their interactions have generally been harmonious, they didn’t quite seem like Dao companions, but more like an alliance.<br/><br/>This relationship could be said to be quite fragile.<br/><br/>Especially after she regained her spiritual treasure—the Flying Sword left behind by her previous self—she no longer needed his Pure Yang Body.<br/><br/>The basis of their Daoist partnership no longer existed. What remained was only the camaraderie formed from past collaborations.<br/><br/>Even in her wildest dreams, she never imagined that when she fell into a fatal trap, he would actually step forward to help her.<br/><br/>Ye Ling Bo was stunned, shocked, and could hardly believe it.<br/><br/>For a moment, she didn’t know how to respond.<br/><br/>…<br/><br/>The path of the End of Dharma?<br/><br/>Upon hearing Yun Piaomiao’s words, Gu Yang’s heart stirred.<br/><br/>What he used was, naturally, the forbidden magic field of his pet squirrel. As soon as he activated the domain, the peculiar force that had trapped him in space vanished.<br/><br/>This was easier than he had expected.<br/><br/>This meant that the power of the innate spiritual treasure was not as great as he had imagined.<br/><br/>The Forbidden Magic Field was of course not invincible, otherwise, he would not have lost to a Celestial Being in the simulation.<br/><br/>That is to say, the Forbidden Magic Field was not very effective when dealing with celestial rank powerhouses.<br/><br/>However, as soon as he activated his domain now, the power of the innate spiritual treasure was negated, which was very strange.<br/><br/>Was the power of the innate spiritual treasure, in essence, inferior to a Celestial Being?<br/><br/>Gu Yang looked at Yun Piaomiao and said with a smile that wasn’t a smile, “You’re not frightened, are you?”<br/><br/>Yun Piaomiao’s expression didn’t change as he replied, “If this were the ancient times, naturally I would be wary of you. But after the collapse of the Way of Heaven, the situation of the Da Luo Golden Immortals has become even more dangerous. That Immortal Lord is already struggling to save himself, would he still have the energy to concern himself with the life and death of a little Nascent Soul like you?”<br/><br/>Gu Yang suddenly slapped his hands together, saying, “I get it, you’re stalling for time.”<br/><br/>“Otherwise, with your style, you would disdain to hold such a lengthy conversation with a Nascent Soul like me. You could easily kill me with a single move. Therefore, from this, I can infer that you cannot kill me now. Am I right?”<br/><br/>When he said this, everyone present was shocked.<br/><br/>They looked at Gu Yang and then at Yun Piaomiao. Seeing that he didn’t respond and his expression was somewhat disdainful.<br/><br/>He didn’t make a move!<br/><br/>No response in itself was a response.<br/><br/>Their minds became active all at once. Although they didn’t know why Yun Piaomiao didn’t attack, it was evident that he was restricted in some way.<br/><br/>This meant that this “Celestial Immortal” was not invincible.<br/><br/>…<br/><br/>“I was almost fooled by you.”<br/><br/>Gu Yang was able to infer this after knowing the outcome in advance. As long as he assumed that the other party was a paper tiger and extrapolated their weakness, it wasn’t too hard to do.<br/><br/>“If I’m not mistaken, you can’t actually control the Mountain and River Painting, can you?”<br/><br/>“Do you know where your vulnerability lies? You inadvertently revealed it yourself when you said that you’ve observed Fu Wansheng for over a thousand years. If you had such power, why would you wait a thousand years? You would have killed this traitor on the spot long ago.”<br/><br/>“Therefore, there’s only one possible truth: you can only use a trace of the power of the Mountain and River Painting when you create the situation of a one-on-one showdown with Fu Wansheng.”<br/><br/>As Gu Yang spoke, he suddenly swung his sword.<br/><br/>The first move of Zhanxuan Swordsmanship: Beheading Yuan!<br/><br/>This one sword directly cut off Fu Wansheng’s head that was next to him. The terrifying strength instantly killed this powerful Nascent Soul stage cultivator on the spot.<br/><br/>This sudden change caught everyone off guard.<br/><br/>In the next moment, the restriction on the space around Bi Shui Daoist, Shen Bulin, the Dean, Wen Jue, and other persons present disappeared.<br/><br/>What the kid said was actually true!<br/><br/>All four of them were somewhat stunned and confused.<br/><br/>[Earned 10,000 energy points, current balance 21,300 points.]<br/><br/>I’m rich!<br/><br/>The joy Gu Yang felt upon seeing this prompt was indescribable.<br/><br/>Over twenty thousand points, this was an unprecedented number.<br/><br/>I can’t believe what a genius I am!<br/><br/>PS: Begging for monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}