{"id": 375, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132351.html", "title": "Chapter 375 - Chapter 375: The Might Of Human Emperor’S Sword 375", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 375 - Chapter 375: The Might Of Human Emperor’S Sword 375</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 375: The Might of Human Emperor’s Sword 375<br/><br/>Bi Shui Daoist showed no mercy with his move, as a green Sword Light cut through the space, reaching in an instant the Forget-Worry Mountain beneath.<br/><br/>A sense of solemnity filled the eyes of the nearby Shen Bulin and Emperor Wei.<br/><br/>They could both tell, this was a Spirit Treasure.<br/><br/>A flying sword at the level of Spirit Treasure, rarer than other types of Spirit Treasures, was dedicated to slaughter. It discarded all unnecessary adornments, reaching the peak of destructive power.<br/><br/>Even in ancient times, Sword Cultivators at the same Cultivation Level were always feared as Great Killers.<br/><br/>In the Water Moon Cave Heaven, the Ancient River Sword Sect was the only one, and the entire sect comprised of Sword Cultivators.<br/><br/>The fact that Bi Shui Daoist possessed such a flying Spirit Treasure Sword made both Shen Bulin and Emperor Wei feel a bit more wary.<br/><br/>Although his timeframe for becoming a Celestial Being was the shortest, with this flying sword, he posed a threat to them.<br/><br/>Just as the flying sword was about to pierce the chest of the foreign woman below, suddenly, a white sword appeared out of nowhere and knocked it away.<br/><br/>“What?”<br/><br/>For an instant, Bi Shui Daoist felt he had lost his connection to the flying sword. However, almost immediately, he regained his control over it.<br/><br/>“A Celestial Being!”<br/><br/>“A Celestial Being!”<br/><br/>Both Shen Bulin and Emperor Wei were taken aback.<br/><br/>An unfamiliar Celestial Being emerged out of the blue. This person was neither Fu Wansheng nor the elusive Yun Piaomiao.<br/><br/>“A Celestial Being from a foreign land!”<br/><br/>Bi Shui Daoist urgently warned.<br/><br/>Just after one encounter, he determined that this person’s ways were incredibly strange and certainly not from their world.<br/><br/>This posed a significant problem for Shen Bulin and Emperor Wei.<br/><br/>Their plan hadn’t accounted for such assistance on the enemy’s side.<br/><br/>This had likely changed the situation to three against three.<br/><br/>They also had to face Fu Wansheng, an opponent with strength far surpassing them. Their chances of victory seemed very slim.<br/><br/>They couldn’t understand why Fu Wansheng would align himself with people from a foreign domain.<br/><br/>Helping the foreign woman break through was one thing, but uniting with a foreign Celestial Being was another.<br/><br/>What did he want?<br/><br/>With Fu Wansheng’s power, he was already at the pinnacle of this world. Could he possibly want to ascend even further?<br/><br/>Just then, a cold voice echoed in their ears, “You guys go ahead, I’ll hold off Fu Wansheng.”<br/><br/>Bi Shui Daoist immediately recognized that the speaker was Yun Piaomiao, whom he had never met before.<br/><br/>As fellow Celestial Beings, even without meeting face to face, one could infer another’s identity from their displayed power.<br/><br/>Upon reaching the realm of a Celestial Being, one’s power attributes could no longer be hidden.<br/><br/>At least, that was the case at their current level.<br/><br/>Today’s events were indeed full of twists and turns, filled with surprises.<br/><br/>The usually low-profile Yun Piaomiao had voluntarily interfered.<br/><br/>Seeing Yun Piaomiao make a move, Bi Shui Daoist and the others didn’t hesitate any longer and attacked almost immediately.<br/><br/>Four against three, one of them was a recent breakthrough who was not yet fully acclimatised. Their threat was almost negligible, effectively making it four against two. The chances of winning were not zero.<br/><br/>“Attack!”<br/><br/>The most decisive among them was Shen Bulin. He took off his gourd from his back and sprayed three black Sword Lights towards the foreign woman.<br/><br/>Almost at the same time, Emperor Wei made his move. He produced a white jade stamp which, when thrown in the air, turned into an enormous five-clawed Golden Dragon, carrying an undeniably royal and aloof aura.<br/><br/>The Golden Dragon circled above his head, and he suddenly donned a golden dragon robe. His aura changed entirely, reflecting a ruthless and domineering light from his eyes.<br/><br/>Addressing the foreign pair, he said, “Rebels and traitors, universally deemed deserving death.”<br/><br/>His voice seemed to resonate with heaven and earth. The wind howled, dark clouds congealed, and thunder roared. This land began to reject those two “rebels and traitors.”<br/><br/>Standing in the midst of this, Wen Jue and the Academy Head felt an exceedingly powerful force of rejection.<br/><br/>Especially Wen Jue who had just broken through. In this moment, he felt as if he had lost his connection with the Way of Heaven, like falling from a great height. He couldn’t even use his mana, turning him completely into a mortal.<br/><br/>At this moment, the three black Sword Lights were flying towards her. She could only watch but had no means to resist.<br/><br/>At the same time, Bi Shui Daoist also made his move and the green flying sword rapidly approached.<br/><br/>The Academy Head, clad in a green robe, stood side by side with Wen Jue. In his hand, he held the mundane grey sword. He swung three times, cutting down the three black Sword Lights.<br/><br/>When he was about to swing for the fourth time, his hand paused and he let out a barely audible sigh.<br/><br/>Though he had eaten one of Gu Yang’s Spirit Peaches and had somewhat recovered from his injuries, his strength was not fully restored. Facing the suppression of three Celestials Beings of the same level, those three swings were his limit.<br/><br/>He had thought that with Fu Wansheng’s help, they should have been able to protect Wen Jue.<br/><br/>Unexpectedly, another Celestial Being appeared, stopping Fu Wansheng.<br/><br/>He was yet to fully recover from his injuries, and to go up against three opponents was inevitably hard.<br/><br/>Victory or defeat among Celestial Beings can often be decided in the blink of an eye. A tiny mistake can lead to a fatal outcome.<br/><br/>The fourth Celestial Being, not a part of their calculations, was their significant oversight. Defeat seemed preordained.<br/><br/>…<br/><br/>“Who are you?”<br/><br/>Not far away, a figure was forced out of the void. He was a man in blue clothes, his face handsome and pleasant, yet now filled with confusion. He stared intently at the figure not far from him.<br/><br/>This man was Fu Wansheng, the leader of the Water Moon Sect. He was empty-handed, carrying no weapons. Hanging in midair, his presence was powerful and pure.<br/><br/>Near him, a nebulous figure appeared, shrouded in a layer of clouds and mist, his face was hidden.<br/><br/>This person was Yun Piaomiao, the most mysterious and low-profile among the five Divine Power cultivators in the Water Moon Cave Sky. His voice seemed to come from afar, “Fu Wansheng, is this the name she gave you? It sounds terrible.”<br/><br/>At his words, Fu Wansheng’s face changed dramatically, as if facing a formidable enemy. “Who the hell are you?” he demanded.<br/><br/>Yun Piaomiao answered indifferently, “Don’t you already know the answer in your heart?”<br/><br/>“Stop playing games!”<br/><br/>Fu Wansheng noticed the battle not far away and realized their side was in danger. Without wasting any more time, he promptly let loose his innate power, intending to rescue them.<br/><br/>“Stop!”<br/><br/>With a soft command from Yun Piaomiao, suddenly Fu Wansheng’s internal power felt as if it had been sealed. It abruptly came to a halt.<br/><br/>Fu Wansheng’s expression mirrored that of someone who had just seen a ghost, “How… How is this possible? You…”<br/><br/>“Wishing to save her? Dream on!”<br/><br/>Yun Piaomiao’s chilling voice echoed like it was emerging from purgatory itself.<br/><br/>…<br/><br/>Wen Jue watched the cascading green light in disbelief, a long-lost sensation of helplessness overwhelming him.<br/><br/>This feeling was like meeting a Divine Power practitioner in the Mortal Realm, insignificant and helpless, with no option to do anything but await death.<br/><br/>It was the man by his side who had saved him then.<br/><br/>Now, the situation was even more perilous, and even the omnipotent Headmaster who had saved her from Lord Chi Ming, was rendered useless in this scenario.<br/><br/>“Is this the end?”<br/><br/>Facing this impending fate, her heart was unusually calm, filled only with faint regret and reluctance.<br/><br/>In the end, she couldn’t avenge her Master.<br/><br/>She was an orphan, left on the streets to beg. It was her Master who took her in, accepted her into the Sect, and from then on, she escaped the bitter existence of her past.<br/><br/>For her, the Dao Sect was her home, and her Master was her family.<br/><br/>Lord Chi Ming killed her Master, her fellow disciples, and ruined the Dao Sect. To her, it was a vendetta that could not be shared under the same sky.<br/><br/>She had trained so hard over the years to put herself in a position to one day ascend to the Red Ming Heaven and slay the Heavenly Sovereign with her sword.<br/><br/>She was so close to achieving her goal, only to fail at the last moment.<br/><br/>Just then, a figure rushed into her line of sight and stood protectively in front of her.<br/><br/>Was it him?<br/><br/>Surprise welled up in Wen Jue’s heart.<br/><br/>She was cold by nature and other than the matter of revenge, she found little interest in other things.<br/><br/>Yet, this man named Gu Yang left an impression on her.<br/><br/>His astonishing cultivation speed, even she was in awe of it.<br/><br/>Each time they met, this man’s cultivation level seemed to have progressed by leaps and bounds.<br/><br/>She remembered the first time they met when he was not even in the Divine Power realm.<br/><br/>Sometime later, he had reached the Golden Body realm.<br/><br/>Then, after a month, he had attained Mana.<br/><br/>Now, only two months later, he had reached the pinnacle of the Unleaking Realm, almost catching up to her.<br/><br/>Wait, something is not right!<br/><br/>Wen Jue suddenly noticed something unusual.<br/><br/>Why is he not affected by that immortal technique?<br/><br/>Immortal techniques, the magic used by immortals, embody the laws of the Way of Heaven, often ignoring all reason when dealing with Divine Power practitioners.<br/><br/>Just like not far from here, the Divine Power practitioner dressed in a dragon robe, with a Five-Clawed Golden Dragon above his head, was using this technique to crudely suppress her, stripping her of her cultivation status and reducing her back to the mortal realm.<br/><br/>This was an Immortal Technique.<br/><br/>Such a powerful technique was obviously amplified by using a spiritual treasure.<br/><br/>Even though she had broken through to the Celestial Being realm, she was unable to resist this powerful Immortal Technique and was left no option but to silently await her fate.<br/><br/>Why is Gu Yang, a pinnacle Unleaking realm cultivator, unaffected?<br/><br/>Wen Jue’s heart skipped a beat, and all of a sudden, hope was rekindled.<br/><br/>The next moment, she saw Gu Yang drawing his sword.<br/><br/>The sword looked ordinary but emanated an indescribable majestic and overwhelming aura.<br/><br/>Hum!<br/><br/>The sword began to vibrate, and a halo of light shot up into the sky.<br/><br/>Wen Jue felt a warm energy surge towards her. The invisible restriction that held her abruptly melted away, and she once again felt the existence of the Way of Heaven.<br/><br/>The next moment, the man wearing the dragon robe and his Five-Clawed Golden Dragon let out a mournful cry. Under the pressure of the Sword Light, their colossal figures began to crumble.<br/><br/>The Divine Power cultivator wearing the dragon robe also showed a look of agony on his face, letting out a terrible cry, “This is the Human Emperor’s- No!”<br/><br/>His expression froze as his body was scattered by the wind, turning to dust.<br/><br/>A Divine Power practitioner was dead just like that.<br/><br/>Ps: This is last night’s chapter. I am in the hospital, so updates will be irregular. Please forgive me. Lastly, I hope for more monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}