{"id": 373, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132348.html", "title": "Chapter 373 - Chapter 373: 373 Three Transformation Gods", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 373 - Chapter 373: 373 Three Transformation Gods</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 373: 373 Three Transformation Gods<br/><br/>Even when he reached the peak of the Unleaking Realm, there wasn’t a substantial increase in Gu Yang’s strength. It still wasn’t sufficient to combat Celestial Beings.<br/><br/>However——<br/><br/>Perhaps it would be enough if he attended the Yaochi Conference.<br/><br/>Suddenly having this thought, he glanced at the remaining 1,800 points of energy and decided to give it a shot.<br/><br/>[Would you like to use the Life Simulator? Using it once will consume five hundred energy points.]<br/><br/>“Yes.”<br/><br/>[… A few days later, you head to the North Sea to attend the Yaochi Conference. After entering the Immortal Palace of Yaochi, you experience a mishap and fall into a dangerous prohibition.]<br/><br/>[With your strong physique, you endure and manage to make it to a safe place after consuming eighty percent of your source energy.]<br/><br/>[You take out the peach you obtained from the main body of the Red Moon Great Saint, but this again triggers the prohibition nearby. You hastily consume the Spirit Peach. Suddenly, a palace maiden from the Immortal Palace wakes up from deep sleep with an extremely powerful aura.]<br/><br/>[Subsequently, that Palace maiden’s aura begins to decline rapidly until it reaches the level of the Nascent Soul stage. Enraged, she attempts to killyou. You are decisive and you kill her instead.]<br/><br/>[Your actions wake up more palace maidens. These maidens, who originally had a cultivation of the Human Immortal Realm, when they awaken, have all fallen to the Nascent Soul stage. To preserve yourself, you have no choice but to kill them all.]<br/><br/>[After killing the last palace maiden, you realize that you are trapped, unable to escape. Even the Moon God’s Bow’s positioning fails.]<br/><br/>[Twenty years later, someone finally disengages the prohibition, finds you, but does not kill you, only capturing you alive. You are brought to a place where you meet a person.]<br/><br/>[That person lets you live, but after ten more years, your cultivation level has not advanced at all. The person loses patience with you and executes you. You die at the age of fifty-three.]<br/><br/>Thirty years!<br/><br/>Gu Yang did not expect that after surviving a near-death experience, he would find a safe haven.<br/><br/>He hid inside the Immortal Palace and wasn’t discovered until twenty years later.<br/><br/>This was ridiculous.<br/><br/>It seems that the owner of the Immortal Palace of Yaochi couldn’t control the palace at all.<br/><br/>Moreover, he learned of a crucial piece of information.<br/><br/>In ancient times, when the powerful beings of the Human Immortal Realm awakened from their slumber, their realms fell straight to the Unleaking Realm.<br/><br/>As long as it was the Unleaking Realm, no matter what state you were in before, he could kill them all.<br/><br/>All the palace maidens in that area in the Palace of Yaochi were slaughtered by him.<br/><br/>Given some time, these original Human Immortal Realm powerhouses could probably quickly find a way to upgrade to the Celestial Being Realm.<br/><br/>The thought of this made Gu Yang’s skin crawl.<br/><br/>Just in that area alone, there were at least ten powerhouses of the Human Immortal Realm.<br/><br/>So how many people in the entire Immortal Palace of Yaochi had such power?<br/><br/>When these people were all awakened, passed their most vulnerable period, and gained cultivation of the Celestial Being realm, how terrifying would their power be?<br/><br/>No wonder the Palace of Yaochi wanted to conquer everywhere, they definitely wanted to get a piece of the action.<br/><br/>Their power is indeed formidable!<br/><br/>With possibly hundreds of Celestial Beings, who could resist such power?<br/><br/>The catastrophe of strange creatures in the Yellow Springs Cave heaven can’t even destroy the Immortal Palace of Yaochi.<br/><br/>How should he deal with such a terrifying force?<br/><br/>The more Gu Yang thought about it, the more his head ached.<br/><br/>[The simulation is over, you can keep one of the following things.]<br/><br/>[One, martial arts level at fifty-three.]<br/><br/>[Two, martial arts experience at fifty-three.]<br/><br/>[Three, wisdom at the age of fifty-three.]<br/><br/>“I choose number two.”<br/><br/>At this time, what Gu Yang needs are methods to form a domain, which requires experience and knowledge.<br/><br/>…<br/><br/>…<br/><br/>All three simulations quickly ended, but he still had no clue.<br/><br/>Gu Yang took out the items from the Beast-taming Space and started choosing.<br/><br/>“This is the one.”<br/><br/>In the end, he chose the wooden box that Huang Yongkang had seized from Youming Laozu.<br/><br/>From the prohibition on the lid of the box, he knew the item inside must be extremely valuable.<br/><br/>This thing cannot be forcibly opened. If you use force, there’s a high chance that the item inside would be destroyed.<br/><br/>But to open the prohibition, he would have to spend time learning the prohibition arts.<br/><br/>He didn’t have so much energy to waste on this now.<br/><br/>After weighing the pros and cons, he decided to recharge it.<br/><br/>[Energy source detected. Recharge?]<br/><br/>“Yes.”<br/><br/>[Recharge successful, 5000 energy points obtained.]<br/><br/>Five thousand points?<br/><br/>Gu Yang paused for a moment. What on earth is so valuable?<br/><br/>A whole five thousand points, equivalent to the power of ten experts in the third level of the Unleaking Realm.<br/><br/>Unfortunately, the wooden box in his hand had completely disappeared. He guessed that he would never know what was actually inside the box.<br/><br/>[Do you want to use the Life Simulator? Each use consumes 500 energy points.]<br/><br/>Continue with the simulation, there is not much time left.<br/><br/>“Yes.”<br/><br/>…<br/><br/>…<br/><br/>After three rounds of simulation, Gu Yang saw a prompt, [….you have finally understood the law to form your own domain….]<br/><br/>He made it!<br/><br/>After collecting his reward, he sorted out the related knowledge and experience in his mind and understood.<br/><br/>The martial arts of Great Zhou greatly differed from the cultivation system of the West Bank Continent, hence, having a similar domain was unrealistic.<br/><br/>However, martial artists can completely set out on a different path.<br/><br/>Put simply, having a domain means having profound achievements in a certain magic. It signifies they are close to understanding some kind of law.<br/><br/>The domain is an intermediate state between a legend and a half-god.<br/><br/>Martial artists are on a completely different path, so naturally, they cannot form a domain.<br/><br/>But martial artists can do things that mages cannot do.<br/><br/>Such as, Sword Intent, Blade Intent and so forth.<br/><br/>More accurately, it should be called Martial Will.<br/><br/>Martial artists combine essence, energy, and spirit to form their unique power imprint, which can explode in an instant and maximize their strength.<br/><br/>It sounds easy to say, but it is extremely difficult to achieve.<br/><br/>Gu Yang opened the system again.<br/><br/>[Do you want to use the Life Simulator? Each use consumes 500 energy points.]<br/><br/>“Yes.”<br/><br/>[….]<br/><br/>…<br/><br/>…<br/><br/>Above Mount Forgotten, a figure appeared out of nowhere. It was the Ancestor of the Ancient River Sword Sect, Bi Shui Daoist.<br/><br/>He looked like a middle-aged man wearing Taoist robes, with a wooden sword on his back. He looked down at the place where the woman from the other world was, a hint of excitement in his eyes.<br/><br/>Suddenly, he spoke, “Shen Old Ghost, you’re not dead yet?”<br/><br/>Not far behind, a figure appeared out of nowhere, an old man with white hair and beard, with a red gourd on his back.<br/><br/>The old man chuckled, “Good on you, Bi Shui, your cultivation is getting more and more profound. It seems you will surpass me soon.”<br/><br/>This person was the Ancestor of another sect, the Red Emperor Peak, named Shen Bulin. Both his name and character are strange. Among the cultivators of the Spiritual Transformation Realm in Shuiyue Dongtian, he was the oldest.<br/><br/>It was said that he was almost two thousand years old, approaching the theoretical limit of his lifespan.<br/><br/>Of course, Bi Shui Daoist didn’t believe this rumor. When he had just broken through to the Spiritual Transformation Realm, he had heard this rumor.<br/><br/>Now, five hundred years later, this old fellow is still alive and kicking, showing no signs of imminent death.<br/><br/>The two of them, one was the oldest in the Spiritual Transformation Realm, and the other was the youngest. They formed a vivid contrast.<br/><br/>At this moment, a somewhat arrogant voice rang out, “I knew I couldn’t hide this from you two.”<br/><br/>The third figure appeared, a young man dressed in extremely lavish clothes, with a noble demeanor. He didn’t seem like a cultivator, but rather like a king or noble from the human realm.<br/><br/>This man was named Emperor Wei. Originally a king in the secular world, he gave up his throne to his son in pursuit of immortality. When he became a cultivator in the Spiritual Transformation Realm, he came out of his seclusion to find that his kingdom had already changed hands.<br/><br/>He lost interest in the throne and instead founded a sect called the Jade Emperor Pavilion. Hundreds of years later, it became one of the top sects in the world.<br/><br/>The three of them were old acquaintances.<br/><br/>Back then, when Bi Shui Daoist broke through to the Spiritual Transformation Realm, the two who came to “congratulate” him were these two.\t\t\t\t\t\t</div>", "images": {}, "success": true}