{"id": 374, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132349.html", "title": "Chapter 374 - Chapter 374: 374 Primordial Divine Treasures", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 374 - Chapter 374: 374 Primordial Divine Treasures</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 374: 374 Primordial Divine Treasures<br/><br/>In the whole Water Moon Heaven, there were only five Transcendent Cultivators. Now, three of them had arrived.<br/><br/>The Daoist Bi Shui and the two of them, although they had some minor disagreements previously, there had been no real conflict.<br/><br/>In this world, at least for a thousand years, there was no battle between cultivators at the Transcendent stage.<br/><br/>Cultivators at the Transcendent stage were not like the Unleaking Realm warriors of Great Zhou where employing strength once would consume their lifespan. But war was treacherous and dangerous. Among cultivators of the same cultivation level, without any real fights, it was unsure who was truly stronger.<br/><br/>It wasn’t worth it to fight to the death over a petty dispute.<br/><br/>The three of them, amongst each other, all had some discontent, but no conflicts had ever erupted.<br/><br/>Suddenly, Shen Bulin, who was carrying a giant red gourd, spoke in a low voice, “Old Ghost Fu should also be in the vicinity at this time.”<br/><br/>The surroundings of the three individuals were cut off by a barrier that separated the inside and outside, so they didn’t need to worry about their conversation being overheard. But he still subconsciously lowered his voice, showing his fear and apprehension of the “Old Ghost Fu”.<br/><br/>The Emperor Wei looked at him and sneered, “Old Ghost Shen, if you are scared now, you can quit.”<br/><br/>Shen Bulin retorted, “If you are not afraid, why bother involving us? Back then, you were proud and valiant, charging into the Water Moon Sect alone with your sword. However, you ended up losing an arm to Old Ghost Fu, and had to replace it with someone else’s. Or have you forgotten all of this?”<br/><br/>Emperor Wei’s face turned icy cold as his sole defeat in life was brought up, “Old Ghost Shen, how are you any better than me? You were also slashed by Fu Wansheng and aftewards needed the Fire Elemental Spirit Wine to suppress your injury for over a thousand years.”<br/><br/>The Daoist Bi Shui’s eyes flashed slightly, surprised.<br/><br/>So, Shen Bulin and Emperor Wei both had crossed swords with Fu Wansheng before.<br/><br/>Fu Wansheng was the ancestral master of the Water Moon Sect.<br/><br/>Although there was no clear ranking, the Daoist Bi Shui knew that Fu Wansheng was probably the number one person in the Water Moon Heaven.<br/><br/>He just didn’t expect that Fu Wansheng was so strong that both Shen Bulin and Emperor Wei suffered defeats at his hands.<br/><br/>He felt the need to reassess this person’s strength.<br/><br/>Just as the atmosphere between the two started tensing up, the Daoist Bi Shui timely asked, “Old Ghost Shen, why is Fu Wansheng so concerned about that foreign woman?”<br/><br/>This question has been on his mind for a long time.<br/><br/>Looking at Fu Wansheng’s actions, there were many strange aspects.<br/><br/>The Water Moon Sect was the most powerful sect in this world. Fu Wansheng, as the actual controller of the Water Moon Heaven, allowed Emperor Wei, himself, and another Transcendent Cultivator to grow.<br/><br/>This world went from being solely ruled by the Water Moon Sect to the current five major sects.<br/><br/>Fu Wansheng obviously had enough strength to eradicate us all when we reached the Transcendent stage.<br/><br/>Why didn’t he eliminate the threat when it first emerged?<br/><br/>The Daoist Bi Shui didn’t understand it at all. If it were him in that position, he wouldn’t hesitate to eliminate anyone who could threaten him.<br/><br/>Now, Fu Wansheng was about to experience the consequences of raising a tiger.<br/><br/>The other question was about the foreign woman.<br/><br/>The Daoist Bi Shui was the first to discover the existence of this foreign woman, because she comprehended the same Way of Heaven as him.<br/><br/>He sensed some inexplicable changes in the Way of Heaven and unknowingly noticed her presence.<br/><br/>In this world, there are only five incomplete Ways of Heaven, with the five Transcendent Cultivators each occupying one.<br/><br/>Although it is clearly stated in the cultivation scriptures that practicing the same Way of Heaven does not affect each other’s cultivation.<br/><br/>But with the collapse of the Way of Heaven and the great changes in the world, who knows whether the situation will change.<br/><br/>He would not gamble with his own path.<br/><br/>This was a struggle between the Great Dao, he had already regarded that foreign woman as his mortal enemy.<br/><br/>However, she was extremely cunning, and for several years, he was unable to lock onto her exact location.<br/><br/>There were several instances where he nearly caught her, but he was disrupted by some force, causing him to miss a great opportunity.<br/><br/>That force that disrupted him should be Fu Wansheng.<br/><br/>After the Daoist Bi Shui made this judgment, he gave up chasing after that foreign woman.<br/><br/>Then, he tried various ways to leak this matter to Shen Bulin and Emperor Wei, and as expected, they took the bait.<br/><br/>Three of them tacitly formed an alliance, and without even mentioning it, naturally came together.<br/><br/>This was their first meeting, everyone understood what their ultimate goal was.<br/><br/>That is, to get rid of Fu Wansheng.<br/><br/>In the Water Moon Heaven now, the only one who could pose a threat to them is this one person.<br/><br/>As long as this person is eliminated, they could rest easy.<br/><br/>…<br/><br/>When Shen Bulin heard the Daoist Bi Shui’s question, he said mysteriously, “This matter involves Fu Wansheng, and a huge secret of the Water Moon Sect. Are you sure you want to hear it?”<br/><br/>“Anyone who becomes aware of this secret, Fu Wansheng will definitely kill them without any consideration.”<br/><br/>Emperor Wei said impatiently, “Stop keeping us in suspense, just speak.”<br/><br/>The Daoist Bi Shui also said, “We are already at this point, there’s no turning back. Speak.”<br/><br/>Suddenly, Shen Bulin lowered his voice, his eyes growing deep, “Today’s Water Moon Sect, is not the Water Moon Sect from before.”<br/><br/>“Ten thousand years ago, the Way of Heaven collapsed. The leader of the Water Moon Sect and a few other Celestial Immortals of this world, made a prompt decision. Using the treasure map of mountains and rivers, they separated the core area of the Water Moon Sect and created the Water Moon Heaven.”<br/><br/>“Next, can you guess what happened?”<br/><br/>Emperor Wei said disdainfully, “Wasn’t it just a few Celestial Immortals fighting amongst themselves? The formation of the Sky Ruins ensued, who doesn’t know this?”<br/><br/>Shen Buling asked, “But do you know why they fought?”<br/><br/>Emperor Wei grunted, “The Mountain and River Map.”<br/><br/>“If you only know half the story, then don’t show off.”<br/><br/>Shen Buling sarcastically said, “I bet you have no idea what the Mountain and River Map is, right?”<br/><br/>Emperor Wei turned his head, looking into the distance, and pretended not to hear his words.<br/><br/>The Bi Shui Daoist offered a way out and asked, “So, what kind of treasure is the Mountain and River Map?”<br/><br/>A smug smile crossed Buling’s face, “To explain what the Mountain and River Map is, we have to delve into the history of the Water Moon Sect. Legend has it that the founder of the Water Moon Sect was a disciple of the Azure Emperor, one of the Five Heavenly Emperors of the ancient era.”<br/><br/>“The Mountain and River Map is a gift from the Azure Emperor and is a Primordial Spirit Treasure.”<br/><br/>Five Heavenly Emperors?<br/><br/>Primordial Spirit Treasure?<br/><br/>The inheritance that the Bi Shui Daoist received did not include this information. However, merely from its name, he knew it was a truly powerful entity from ancient times.<br/><br/>In the ancient era, there were countless immortals and gods; how powerful would a being called the Heavenly Emperor be?<br/><br/>As for the Primordial Spirit Treasure, it was a higher-order existence than the Spiritual Treasure.<br/><br/>He indeed had a Spiritual Treasure, and its power was incomparably stronger than any magical treasure he owned.<br/><br/>How potent could the Primordial Spirit Treasure be then?<br/><br/>In the ancient era, a strong celestial immortal from the Water Moon Sect used it to split an entire continent.<br/><br/>It was simply unimaginable.<br/><br/>…<br/><br/>Just listen to Shen Buling continue, “After the Great Calamity of Heaven and Earth occurred, the great beings from the ancient era couldn’t survive it. Very soon, he discovered that the only hope for surviving this catastrophe was the Primordial Spirit Treasure. Only the master of a Primordial Spirit Treasure could save himself. Thus, a great battle broke out.”<br/><br/>“As a result of that battle, the Mountain Gate of the Water Moon Sect was reduced to ruins, all celestial immortals fell, and the whereabouts of the Mountain and River Map became unknown.”<br/><br/>“Later, a few surviving disciples of the Water Moon Sect rebuilt the sect we know now. Almost every generation, someone would be sent to the Sky Ruins to look for traces of the Mountain and River Map.”<br/><br/>“For a very long time, there was no God Transformation cultivator in the whole of Water Moon. Not till 5,000 years ago did a cultivator of the Water Moon Sect first achieve a God Transformation. It was after that event that the Water Moon Sect stopped sending people to the Sky Ruins.”<br/><br/>At this point, Buling’s expression became enigmatic. “Do you two think it was a coincidence?”<br/><br/>Bi Shui Daoist instinctively reacted, “You mean the Water Moon Sect already found the Mountain and River Map?”<br/><br/>Shen Buling said, “It can’t be surely said. The Mountain and River Map is still in the Sky Ruins, sustaining this world. If the Water Moon Sect had taken the Mountain and River Map, the remaining five Ways of Heaven would have collapsed long ago. How could we be here today?”<br/><br/>“I suspect that the Water Moon Sect took the Primordial Spirit of the Mountain and River Map.”<br/><br/>“Primordial Spirit?”<br/><br/>Bi Shui Daoist repeated.<br/><br/>Suddenly, a strong sense of foreboding surged in his heart. He turned his head abruptly, his expression becoming serious, “How did she advance so quickly?”<br/><br/>Shen Buling and Emperor Wei both lowered their heads to take a look.<br/><br/>At this moment, the foreign woman in the Worry-Free Mountain had taken her final step, and the Way of Heaven was manifesting above her head.<br/><br/>The three of them gathered here not only to kill. If they really wanted to kill her, they could have sent their disciples to surround and kill her before she made a breakthrough.<br/><br/>They were also waiting for this moment.<br/><br/>When someone breaks through to the Transformation into God, the Way of Heaven manifests itself. It’s an excellent opportunity to feel the rules of the Way of Heaven up close, and no God Transformation cultivator would ever miss it.<br/><br/>They were even convinced that the other two God Transformation cultivators should also be nearby.<br/><br/>Apart from Fu Wansheng, there was the last God Transformation cultivator, the most mysterious Sect Leader of the Piaomiao Sect, Yun Piaomiao.<br/><br/>The manifestation of the Way of Heaven occurred in a blink of an eye and quickly disappeared again.<br/><br/>The three of them felt the rules manifested by the Way of Heaven, and each gained something from it.<br/><br/>It can be said that the understanding they just had made the trip worthwhile.<br/><br/>Of course, the one who gained the most was the Bi Shui Daoist. The enlightenment he got from that moment exceeded hundreds of years of hard cultivation. Once he returned and went into closed-door cultivation, he would surely make further progress in his cultivation.<br/><br/>At this moment, the mocking voice of Shen Buling came, “It’s time to make a move. If you don’t move now, it’ll be hard to kill her.”<br/><br/>They naturally realized that the foreign woman and the Bi Shui Daoist were following the same Way of Heaven.<br/><br/>Since this was the case, he should be the one to strike first.<br/><br/>The doubt in the Bi Shui Daoist’s mind was not dispelled. Why would Fu Wansheng help that foreign woman?<br/><br/>However, he couldn’t afford to ask more at this moment.<br/><br/>Shen Buling was right. If he didn’t make a move now, it would be difficult to stop the woman once she consolidated her realm.<br/><br/>“Die!”<br/><br/>He no longer hesitated and immediately made his move.\t\t\t\t\t\t</div>", "images": {}, "success": true}