{"id": 377, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132355.html", "title": "Chapter 377 - Chapter 377: 377 Primordial Spirit", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 377 - Chapter 377: 377 Primordial Spirit</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 377: 377 Primordial Spirit<br/><br/>The conversation from these two was beginning to bewilder Gu Yang more and more as he listened.<br/><br/>It seemed these two knew each other before, and their relationship was far from ordinary. Then there was the betrayal of Yun Piaomiao by Fu Wansheng because of a woman…<br/><br/>Why was this story suddenly sounding so melodramatically familiar?<br/><br/>As for who the woman was, it was nearly clear as day by now.<br/><br/>Who could it be other than Ye Lingbo?<br/><br/>But he was currently Dao companions with Ye Lingbo.<br/><br/>So just what was this?<br/><br/>A love square?<br/><br/>Gu Yang subconsciously looked over to where Ye Lingbo was. Not too far behind him, her brows were furrowed in apparent confusion.<br/><br/>She didn’t have many memories from the ancient times, but since she had inherited the wisdom, magic treasures, and many benefits from her past life, she naturally had to bear the corresponding karmic responsibilities.<br/><br/>There was no escaping this.<br/><br/>…<br/><br/>The Bishui Daoist and Shen Buling exchanged glances after hearing their conversation.<br/><br/>Just what kind of relationship existed between Yun Piaomiao and Fu Wansheng?<br/><br/>It sounded painfully vague, but the more they thought about it, the more it made their hearts race.<br/><br/>They subconsciously looked towards the foreign woman who had just broken through to the God Transformation stage, naturally assuming that she was the woman spoken about by Yun Piaomiao and Fu Wansheng.<br/><br/>“You dare!”<br/><br/>Fu Wansheng’s face changed dramatically upon hearing Yun Piaomiao’s threat, and an item appeared in his hands, which was a copper mirror. Images changed rapidly on the mirror’s surface as it swayed.<br/><br/>…<br/><br/>“Heart Inquiry Realm!”<br/><br/>The Bishui Daoist and Shen Buling both exclaimed in surprise at the same time, evidently apprehensive of the mirror in Fu Wansheng’s hand.<br/><br/>The Heart Inquiry Mirror, the founding treasure of the Water Moon Sect, was said to be handed down by the Sect’s founding ancestor Water Moon Celestial. This treasure was much more famous than the Map of Mountains and Rivers, another pre-existing magical artifact.<br/><br/>Using this treasure, the Water Moon Celestial had consolidated the Water Moon Sect’s position in this realm by sweeping away all other local factions within the Water Moon Cave Celestial Realm.<br/><br/>Under the Heart Inquiry Mirror, three Celestial Immortals had been mercilessly killed.<br/><br/>Even to this day, the formidable reputation of this celestial-rank spirit treasure still lingered in this world.<br/><br/>The Bishui Daoist’s Bishui Sword and Shen Buling’s gourd were both merely human-rank magical artifacts.<br/><br/>From lowest to highest, spirit treasures were ranked human, earth, and celestial, corresponding to Human Immortal, Earth Immortal, and Celestial Immortal respectively.<br/><br/>This rank was two levels higher than their spiritual treasures.<br/><br/>The principles of the Way of Heaven contained in this treasure were much more profound.<br/><br/>If Fu Wansheng was able to wield even a fraction of the Heart Inquiry Mirror’s power, none of the present company would likely be able to withstand it.<br/><br/>This realization made the Bishui Daoist and Shen Buling feel a sudden urge to turn tail and run.<br/><br/>…<br/><br/>Just as Fu Wansheng pointed the Heart Inquiry Mirror at Yun Piaomiao, the mirror shone with a seven-colored glow, subsequently fixing on an image that reflected Yun Piaomiao.<br/><br/>“Hah!”<br/><br/>Yun Piaomiao gave a contemptuous chuckle, and with a wave of his hand, the image on the mirror paused and its light dimmed.<br/><br/>Then, with a sudden jolt, the mirror escaped Fu Wansheng’s grip and flew into Yun Piaomiao’s hand.<br/><br/>This unexpected turn had everyone in shock.<br/><br/>No one could have anticipated that Yun Piaomiao would effortlessly snatch away the celestial-rank spirit treasure from Fu Wansheng’s hands.<br/><br/>The Bishui Daoist and Shen Buling stared dumbfounded.<br/><br/>Was that really possible?<br/><br/>The sudden turn of events had taken them completely by surprise.<br/><br/>That was a celestial-rank spirit treasure, for crying out loud! Could Yun Piaomiao just snatch it away like that without facing any consequences?<br/><br/>…<br/><br/>“How foolish of you to use my own magic treasure against me,” Yun Piaomiao said with a mocking tone. However, a hint of disappointment flashed in his eyes, “I thought your betrayal meant you had grand ambitions, that you were seeking the fruit of Immortal Longevity. But to think, it was merely for a woman.”<br/><br/>“Did you know? I’ve been observing you for more than a millennium. But you have disappointed me beyond words.”<br/><br/>Speaking with increasingly vehement anger, Yun Piaomiao continued, “No lofty ambition, no desire for progress. Despite having the resources of the whole world at your disposal, you never aspire to advance further.”<br/><br/>“Soft-hearted and weak-willed. When competitors arise, you don’t ruthlessly eradicate them. Instead, you allow them to grow, cultivating a tiger that courts calamity. If not for this, would we have ended up here today?”<br/><br/>“I’ve been unmatched throughout my life, from a nobody in a small village to a ruler of a realm. I’ve never been defeated, only to be brought down by a worthless thing like you at the end!”<br/><br/>By the time Yun Piaomiao finished, he was almost roaring.<br/><br/>…<br/><br/>Everyone present showed shock upon hearing his words.<br/><br/>A ruler of a realm?<br/><br/>The term provoked a flurry of thoughts.<br/><br/>This was especially true for the local natives, the Bishui Daoist and Shen Buling.<br/><br/>From ancient times till now, in the Water Moon Cave Celestial Realm, there was only one who could be deemed a ruler, none other than the unbeatable peak Celestial Immortal, Water Moon Celestial.<br/><br/>Could it be that this Yun Piaomiao standing before their eyes was the Water Moon Celestial who should have perished in the grand calamity a thousand years ago?<br/><br/>Then just who was Fu Wansheng?<br/><br/>As for Gu Yang, Wen Jue, and the Dean, although they didn’t know exactly what kind of entity a world’s master is, it is definitely not an ordinary powerhouse. The three became even more cautious, preparing to retreat at any moment.<br/><br/>“Something must be wrong.”<br/><br/>Gu Yang feels things beginning to get out of control.<br/><br/>This should not be the case. There should not be any changes in such a short period of time.<br/><br/>But looking at the strength shown by Yun Piaomiao, no one present could possibly escape.<br/><br/>He quietly opened the system and initiated a simulation.<br/><br/>…<br/><br/>After Yun Piaomiao’s roar, he quickly regained his composure, “I can understand all this stupidity of yours.”<br/><br/>“But as the Primordial Spirit of a congenital magic treasure, born at the time before chaos was untangled, acquiring spiritual intelligence after billions of years and surviving to this day for countless years, you’ve seen at least billions of beings.”<br/><br/>“You actually betrayed your master for a human, even at the cost of discarding your shell. I really want to know, why?”<br/><br/>What?<br/><br/>Not only Bi Shui Daoist and Shen Bulin were stunned, even the Dean and Wen Jue were greatly surprised.<br/><br/>Fu Wansheng is actually the Primordial Spirit of an innate magic treasure?<br/><br/>This is simply beyond belief.<br/><br/>The innate magic treasure is a legendary existence. After the great catastrophe of ancient times, all innate magic treasures disappeared and none have reappeared.<br/><br/>All those present, their understanding of innate magic treasures, were derived from some ancient classics. The things recorded in them were difficult to distinguish between true and false.<br/><br/>As for the truth of the matter, they were skeptical.<br/><br/>However, Bi Shui Daoist and Shen Bulin, as well as the Dean and others, quietly put some distance in between themselves.<br/><br/>However, they soon discovered in horror that even though they were retreating continuously, the distance from Yun Piaomiao did not decrease at all, as if they were trapped in this space.<br/><br/>At this point, they all knew that their actions had not escaped the opponent’s notice.<br/><br/>“Mountain and River Map!”<br/><br/>Shen Bulin muttered in a somewhat bitter tone.<br/><br/>The Innate Magic Treasure Mountain and River Map, which contains countless spaces within mountains and rivers.<br/><br/>Only the Mountain and River Map of the Innate magic treasures could trap them in the space trap without them noticing.<br/><br/>Whether Yun Piaomiao is Water Moon Heavenly Lord is still uncertain. But this person can indeed exert part of the power of the Mountain and River Map.<br/><br/>And his intent to trap them with the Mountain and River Map now is self-evident.<br/><br/>He wants to keep them all here.<br/><br/>…<br/><br/>From beginning to end, Yun Piaomiao didn’t look aside. In his eyes, there was only Fu Wansheng.<br/><br/>He was waiting for the other’s answer.<br/><br/>Fu Wansheng remained silent. He took out a flying sword and placed it on top of his head, his eyes resolute.<br/><br/>Seeing that he didn’t speak, Yun Piaomiao continued, “We’ve fought side by side for hundreds of years. I know you are not attracted to beauty. Mistress Ye is not the type to seduce others with beauty either.”<br/><br/>“So, there must be some other secret hidden here. Am I right?”<br/><br/>The flying sword above Fu Wansheng’s head shone brightly.<br/><br/>Without him answering, Yun Piaomiao already had an answer in his heart.<br/><br/>He said, “Mistress Ye, come out.”<br/><br/>As soon as his voice fell, a figure appeared out of thin air in front of them. It was Ye Lingbo.<br/><br/>She looked startled for a moment, but then immediately calmed down, staring at the man in front of her who seemed to be an ancient Celestial Immortal who could move her with a wave of his hand.<br/><br/>Fu Wansheng couldn’t hold back when he saw Ye Lingbo appear, his Immortal Element exploded within his body, and he yelled, “Let her go!”<br/><br/>Yun Piaomiao said indifferently, “From the moment you betrayed me, you were no longer the primordial spirit of the Mountain and River Map. It’s a bit unrealistic for you to compete with me for the control of the Mountain and River Map.”<br/><br/>While speaking, he waved the Mirror of Inquiry in his hand, and Fu Wansheng’s Dao Shadow appeared on the mirror surface.<br/><br/>Fu Wansheng, who was not far away, was rooted to the spot, his eyes dimming, as if he had lost his soul.<br/><br/>The number one figure of the Water Moon Cave, in front of him, had been suppressed from beginning to end, without any power to resist.<br/><br/>Yun Piaomiao looked at Ye Lingbo and said, “Mistress Ye, you are still as vibrant as ever after your reincarnation.”<br/><br/>Ye Lingbo wasn’t restrained. It seemed that the other party wasn’t worried that she would strike back unexpectedly.<br/><br/>Her first words were, “Am I truly your junior sister?”<br/><br/>“Being able to ask this question proves beyond doubt that you are indeed my junior sister.”<br/><br/>Ye Lingbo laughed, “People always said that I was the reincarnation of an ancient Immortal. I only half believed it before but it turns out to be true.”<br/><br/>Yun Piaomiao said, “In principle, as a mid-stage Celestial Immortal, your True Spirit has not yet been entrusted to the void. After the collapse of the Way of Heaven, your True Spirit should not be able to survive the mystery of reincarnation in the womb. It is surprising that you were able to succeed in reincarnation. It seems that the secret must be hidden within your True Spirit. Let me kill you and take out your True Spirit to see.”<br/><br/>Ye Lingbo asked, “Do we have any grievances?”<br/><br/>“No, we’ve always been cohesive under our master, respecting our seniors and juniors. Our relationship was inseparable. When I encountered the strongest enemy in my life, it was you who helped me. I have always remembered this,” Yun Piaomiao replied.<br/><br/>“Why are you going to kill me then?”<br/><br/>Yun Piaomiao lamented, “The Way of Heaven collapsed, and all Immortals died. The only hope to cross the great calamity is the Mountain and River Map. This is a fight for survival. It’s either you die or I die. What do you think?”<br/><br/>“I see.” Ye Lingbo sighed, “Go ahead.”<br/><br/>Having said that, she closed her eyes awaiting death.<br/><br/>“Don’t worry, my sword is fast. It won’t cause you any pain.”<br/><br/>Suddenly, a voice resounded, “Did you ask me before you decided to kill her?”<br/><br/>Ps: Begging for monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}