{"id": 371, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132343.html", "title": "Chapter 371 - Chapter 371: 371 Impact On Celestial Being", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 371 - Chapter 371: 371 Impact On Celestial Being</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 371: 371 Impact on Celestial Being<br/><br/>“Nether chart?”<br/><br/>Having learned the name and main function of this spiritual object from its Primordial Spirit, Gu Yang’s eyes lit up.<br/><br/>Its primary functions include two aspects – one is to devour souls.<br/><br/>All souls swallowed would transform into ferocious ghosts, wronged ghosts, and so forth inside it.<br/><br/>The other function is to release ferocious ghosts and wronged ghosts to fight enemies.<br/><br/>The entire process fully automated, user-friendly. Even those who haven’t practiced dark arts can refine powerful ghost kings.<br/><br/>However, the cultivation level of the soul before death is retained after transformation by the Nether Chart. It’s impossible for it to evolve further.<br/><br/>This means that the Nether Chart’s power depends on how many ghost souls you have collected – winning by either quantity or quality.<br/><br/>Youming Laozu, the previous possessor of the Nether Chart, chose to prioritize quality, only accepting five Nascent Soul Stage ghost kings. He didn’t bother with those below the Nascent Soul stage.<br/><br/>For Gu Yang, this posed a dilemma.<br/><br/>He had long discovered that everything such as Original Spirit, Mana, soul, etc., after killing someone, would completely disappear.<br/><br/>These powers apparently turn into energy, absorbed by the system.<br/><br/>That is to say, after he killed someone, he could either turn them into energy or store their souls in the Nether Chart – he could only choose one or the other.<br/><br/>Should he even have to choose?<br/><br/>Of course, energy would be more important.<br/><br/>However, this doesn’t mean this spiritual object is of no use. On the contrary, it might be very useful in certain situations.<br/><br/>For instance, the Yellow Springs Celestial Realm.<br/><br/>The creatures there were a type of ferocious ghost. Perhaps they can be collected into the Nether Chart.<br/><br/>The number of creatures in the Yellow Springs Celestial Realm was endless, if they could be collected into the Nether chart, it would really save a lot of trouble. If he could even turn these creatures into his own, it would be even better.<br/><br/>Gu Yang was also quite curious about the primordial spirit of this spiritual treasure, “Since you’re a spiritual object, you must be from the ancient times. How much do you know about the ancient past?”<br/><br/>The black dragon spoke with a sort of trepidation, “In response to my master’s question, I am just an earth-grade spiritual object. My previous owner was merely a cultivator at the Earth Immortal level and a senior elder of the Demon Light Sect. Considered a minor figure in the Water Moon Celestial Realm and didn’t know much.”<br/><br/>Gu Yang’s eyes lit up, “So to say, you still remember the ancient times? Then do you know what exactly happened then? How did the Way of Heaven collapse?”<br/><br/>The Black Dragon shook its head, “The calamity descended suddenly. At that time, I was in secluded cultivation with my previous master in a cave. Suddenly, he screamed in terror and died. I was left in the cave and miraculously survived. I am really not sure what happened.”<br/><br/>Gu Yang couldn’t help but feel a bit disappointed. It took so much effort to encounter a spiritual object’s primordial spirit that still remembered the events of the ancient era, but it turned out to know nothing.<br/><br/>He then asked another question, “What’s the difference between the Water Moon Celestial Realm now and in ancient times?”<br/><br/>“Of course, the current Water Moon Celestial Realm is less than one ten-thousandth of its original size, only retaining a small portion of the original Water Moon Sect’s territory.”<br/><br/>Gu Yang was taken aback. Only one ten-thousandth of the original size?<br/><br/>Exactly how big was the Water Moon Celestial Realm during ancient times?<br/><br/>He found it hard to imagine.<br/><br/>He questioned further, “Why has it become what it is now?”<br/><br/>“Presumably, when the great calamity came, in order to prevent the entire Water Moon Celestial Realm from collapsing, the Water Moon Sect used their treasure, Mount River Chart, to isolate the most core area. And that is today’s Water Moon Cave.”<br/><br/>Finally, some valuable information.<br/><br/>Gu Yang asked a few more questions about the ancient era while continuing to fly towards the Sky Ruins.<br/><br/>“Master, are you heading towards the Sky Ruins?”<br/><br/>Suddenly, the primordial spirit of the Nether Chart asked.<br/><br/>“Yes.”<br/><br/>“That was originally where the Water Moon Sect was located. Then, for some unknown reason, it became the battlefield of Celestial Immortals, causing spatial collapse. Even the Mount River Chart was broken.”<br/><br/>Gu Yang was surprised, “How are you so clear about these things?”<br/><br/>“My previous owner has explored there many times and ultimately died there.”<br/><br/>“So, are you familiar with it?”<br/><br/>“Even if I’m familiar with it, it’s no use. The space inside has been shattered and become very unstable. Every once in a while, changes occur and there are no rules.”<br/><br/>…<br/><br/>During the conversation with the primordial spirit, Gu Yang had arrived at the outer boundary of the Sky Ruins. However, he hesitated at this moment.<br/><br/>If the space inside the Sky Ruins changes at any time, then the results of the previous simulation would no longer be accurate.<br/><br/>After all, in the simulation, he did not encounter Youming Laozu, nor did he acquire the Nether Chart.<br/><br/>A small change could trigger the butterfly effect, let alone a place that is already so unstable.<br/><br/>Thinking of this, he opened the system.<br/><br/>[Do you want to use the Life Simulator? Use it once, consume 500 energy points.]<br/><br/>“Yes.”<br/><br/>[…]<br/><br/>A moment later, he no longer hesitated and flew forward, quickly entering the scope of the Sky Ruins.<br/><br/>Looking around, ruins were all that met the eye, which was precisely the origin of the name Sky Ruins.<br/><br/>According to the Primordial Spirit of the Youming Laozu, this area used to be the base of the Water Moon Sect. Following a massive battle between Celestial Immortals, it was entirely destroyed.<br/><br/>In this way, the event must have occurred after the collapse of the Way of Heaven.<br/><br/>With the Way of Heaven dead, why would those Celestial Immortals still be fighting?<br/><br/>It was well-known that when the Way of Heaven had died, the effect would be greater the higher the cultivation level. In that kind of situation, instead of thinking about how to survive, why would they wage a life-and-death battle with each other?<br/><br/>Could it be for the supreme treasure, the Portrait of Mountains and Rivers?<br/><br/>Gu Yang was mulling over this in his heart. Still, his attention was extremely focused, carefully observing everything around him.<br/><br/>Simultaneously, he made use of the divine power, Eye of the Candle Dragon, which allowed him to pursue good luck and avoid disasters. Moreover, due to the blood connection, in the mysterious way, he had an idea of the probable location of the dragon’s corpse.<br/><br/>Despite his rare visits to the Sky Ruins in the simulator, he could often find the Candle Dragon’s body. This wasn’t without reason.<br/><br/>It was indeed due to the blood connection between his Candle Dragon incarnation and the corpse.<br/><br/>Although the Sky Ruins were dangerous, with his current strength, Gu Yang wouldn’t be in much danger unless he acted recklessly.<br/><br/>…<br/><br/>A day later, he suddenly had a strong feeling in a specific direction.<br/><br/>He flew in that direction, avoiding several hardly detectable spatial rifts, and entered a space fragment. Inside, there was a colossal corpse.<br/><br/>“The corpse of the Candle Dragon!”<br/><br/>The primordial spirit of Youming Laozu suddenly blurted out in utter surprise, “How did it die here?”<br/><br/>Gu Yang asked, “Do you recognize it?”<br/><br/>“An ancient divine beast, ranking next only to a few Emperors. It was a very famous powerhouse in the Three Realms,” the primary spirit of Youming Laozu explained, “Unfortunately, it died so long ago that the light of its Tao has completely dissipated under the scouring of myriad years.”<br/><br/>Gu Yang landed on the head of the Candle Dragon’s corpse, pulled out the Emperor’s Sword, and cut open its skull.<br/><br/>Just like the Primordial Spirit had said, the Tao belonging to this Candle Dragon’s corpse had wholly dissipated. Otherwise, with his current strength, he wouldn’t have been able to cut through its skin.<br/><br/>The most critical part of the Candle Dragon was its head. After cutting through the skin, all he saw was completely dried flesh.<br/><br/>…<br/><br/>Gu Yang spent half a day successfully extracting eight drops of Essence Blood from the corpse.<br/><br/>He now had the most important item.<br/><br/>Next, he placed his hand on the Candle Dragon’s body.<br/><br/>[Energy Source detected, do you wish to recharge?]<br/><br/>“Yes.”<br/><br/>[Recharge Successful, 2000 Energy Points awarded. Current balance 5800 points.]<br/><br/>2000 points!<br/><br/>This was his biggest single gain in history.<br/><br/>This truly was the corpse of an ancient divine beast, even after being dead for ten thousand years, it was still worth so much.<br/><br/>If it had just died…<br/><br/>Gu Yang shook his head, discontinuing the thought.<br/><br/>It was time to leave.<br/><br/>Next would be the testing phase.<br/><br/>…<br/><br/>Gu Yang’s exit from the Sky Ruins went smoothly. The Eye of the Candle Dragon could differentiate the real from the fake, making it extremely useful in such an environment.<br/><br/>He flew back in the direction he came from, planning to find Ye Lingbo.<br/><br/>Considering the time, it should be about right.<br/><br/>Forget Worries Mountain!<br/><br/>Originally the territory of the Forget Worries Elder, it was once quite prominent.<br/><br/>Later, the entire Sect was wiped out. As the Sect Master, the Forget Worries Elder did not dare to make a single sound nor even return to the Sect, disappearing from that moment onwards.<br/><br/>Thus, Forget Worries Mountain became leaderless.<br/><br/>At the peak of a seldom visited mountain, Ye Lingbo watched Dao Sect’s leader meditating in a cave, her eyes unwavering.<br/><br/>Wen Jue, at this moment, had already found his path and was about to take that crucial step.<br/><br/>Being able to witness this process with her own eyes was Ye Lingbo’s fortune.<br/><br/>Her pupils turned pure white, shining as she stared intently at Wen Jue sitting inside the cave.<br/><br/>An invisible wave resonated from Wen Jue’s body, continuously spreading outwards. Eventually, it alarmed the few most powerful beings in this world.<br/><br/>Nearly at the same moment, a couple of people from sects such as the Water Moon Sect and Ancient River Sword Sect simultaneously turned their heads towards the direction of Forget Worries Mountain.<br/><br/>“Is it finally time for him to take that step?”<br/><br/>Among them in the Ancient River Sword Sect, a grand figure opened his eyes. His voice somewhat cold, he waved a hand and a rift appeared in front of him. He stepped forward, instantly spanning tens of thousands of miles, appearing outside Forget Worries Mountain.\t\t\t\t\t\t</div>", "images": {}, "success": true}