{"id": 370, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132341.html", "title": "Chapter 370 - Chapter 370: How Good It Would Have Been If It Had Been Like This Earlier", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 370 - Chapter 370: How Good It Would Have Been If It Had Been Like This Earlier</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 370: How good it would have been if it had been like this earlier<br/><br/>As an odd fluctuation appeared around Gu Yang, the Red Maple Peak Master felt a sense of danger. Immediately afterwards, she detected a flaw in the seemingly perfect Sword Formation.<br/><br/>The flaw emerged in a peculiar and abrupt way.<br/><br/>She had no clue what means Gu Yang employed.<br/><br/>Before she could raise an alarm, that flaw began to expand wildly, disrupting the entire Sword Formation.<br/><br/>The Four Symbols Sword Formation was broken just like that.<br/><br/>Red Maple Peak Master abruptly snapped out of her sense of being in control of everything, feeling somewhat bewildered.<br/><br/>What just happened?<br/><br/>Not only her, but also the other three Nascent Soul cultivators were shocked beyond belief and left in disarray.<br/><br/>The Four Symbols Sword Formation, profound and incomparable, required stringent conditions to set up. Four Nascent Soul cultivators who each wielded a Pure Yang Flying Sword affiliated with Wood, Fire, Metal, and Water could lay it out.<br/><br/>These four Flying Swords were a set obtained by the founding ancestor of the Ancient River Sword Sect, from a heritage site of a prehistoric immortal.<br/><br/>These four cultivated a single Flying Sword between them.<br/><br/>This was their first collaboration to set up this formation. Before this, they had never encountered an enemy they needed to combat using the Four Symbols Sword Formation.<br/><br/>Every disciple of the Ancient River Sword Sect held the utmost confidence in this Sword Formation.<br/><br/>Because their founder once relied on this formation to avert the danger of the sect’s destruction.<br/><br/>But now, the Four Symbols Sword Formation was effortlessly broken like child’s play.<br/><br/>The four Peak Masters of the Ancient River Sword Sect felt as if they’d fallen into a dream, refusing to believe it was true.<br/><br/>Just then, Gu Yang shot out like a cannonball, his speed pushed to the extreme, forming a residual image in the air.<br/><br/>“Beware——”<br/><br/>The Red Maple Peak Master was horrified and yelled a warning.<br/><br/>Before her words even finished, the Jade Dragon Peak Master became a cloud of blood mist. Even his Original Spirit couldn’t escape, he was dead beyond dead.<br/><br/>Among the four of them, Jade Dragon Peak Master had the lowest cultivation level. With his death, the Four Symbols Sword Formation was utterly broken.<br/><br/>“Run!”<br/><br/>The Red Maple Peak Master was both shocked and angry, but more than that, she felt an indescribable terror.<br/><br/>How could the strength of this man be so formidable?<br/><br/>Judging from the fatal wound on her senior brother’s body, this man’s strength should not exceed the Middle Nascent Soul stage. But he possessed some formidable attack method.<br/><br/>Fallen for it!<br/><br/>Suddenly, she realized.<br/><br/>The injuries on her senior brother were intentionally inflicted by this man, for the sole purpose of concealing his true strength, causing them to misjudge his power.<br/><br/>This time, his sudden appearance was calculated on the fact that they would not mobilize their full strength to hunt him down.<br/><br/>All of this was a trap. A trap to weaken the Ancient River Sword Sect.<br/><br/>If he managed to kill all four of them here, then the higher-ups of the Ancient River Sword Sect would lose more than half. It’s a bone-breaking wound that wouldn’t recover for centuries.<br/><br/>Cold sweat broke out from the Red Maple Peak Master’s back in an instant.<br/><br/>Too vicious!<br/><br/>This man set such a trap against their Ancient River Sword Sect with careful planning. Was there a deeper scheme behind it?<br/><br/>The more the Red Maple Peak Master thought about it, the more terrified she became.<br/><br/>It seemed as if an invisible net was slowly tightening around the Ancient River Sword Sect.<br/><br/>No, she had to inform the Sect Leader Senior Brother about this man’s conspiracy.<br/><br/>She was a decisive person. As soon as the man broke the Four Symbols Sword Formation and killed the Jade Dragon Peak Master, she knew that she couldn’t escape.<br/><br/>Therefore, without any hesitation, she slapped her Ni Wan Palace, and a Nascent Soul cradling a Flying Sword flew out.<br/><br/>Discarding her Mortal Body, the speed of the Nascent Soul with the Flying Sword increased by several fold, which increased her chances of escaping.<br/><br/>She didn’t fly very far when the sword light suddenly dimmed, and the flying sword described a parabola, falling to the ground.<br/><br/>The Nascent Soul had dissipated in mid-air.<br/><br/>She probably didn’t understand how she’d died, even in her last moments.<br/><br/>…<br/><br/>[Obtained 200 energy points, current balance 2200 points.]<br/><br/>[Obtained 500 energy points, current balance 2700 points.]<br/><br/>Upon deciding to strike, Gu Yang obviously wouldn’t hold back. The first to die was the weakest one among the four of them.<br/><br/>Just after he killed a person, he found that the most powerful woman suddenly died.<br/><br/>He paused for a moment, and quickly understood how she had died.<br/><br/>Playing around with Nascent Soul Slip in the Forbidden Magic Field, aren’t you dying fast enough?<br/><br/>He didn’t know that this woman had a lot of inner drama in her heart.<br/><br/>The remaining two Nascent Soul cultivators were of no threat to him and were easily killed by him.<br/><br/>Gu Yang didn’t give them a chance to speak. Once he decided to make a move, there was no room for reconciliation between them.<br/><br/>“What a waste.”<br/><br/>Looking at the four corpses on the scene, he sighed faintly, retracted the Forbidden Magic Field and casually seized the four Flying Swords.<br/><br/>At his side, Huang Yongkang still hadn’t reacted, and the enemies were already all dead.<br/><br/>There was still a faint look of confusion in his eyes as he watched Gu Yang. His lips moved slightly, and he said, “Senior is mighty.”<br/><br/>…<br/><br/>Meanwhile, Ancient Sword Mountain.<br/><br/>In the main peak, the Sect Leader of the Ancient River Sword Sect suddenly felt an uneasy restlessness, his heart thudding four times consecutively.<br/><br/>Something was amiss!<br/><br/>An extremely bad premonition arose in his heart.<br/><br/>Having reached his level of cultivation, such a sign would not appear without a reason, something must have happened.<br/><br/>He realized that it must be the four Peak Masters who had encountered trouble!<br/><br/>Immediately after, from the Ancestral Hall, there sounded four sorrowful shrieks consecutively. It represented the fall of four important figures within the Sect.<br/><br/>They’re all dead?<br/><br/>How could this be?<br/><br/>His face turned incredibly pale.<br/><br/>Never before had the sect suffered the loss of four Nascent Soul stage Peak Masters in an instant since the establishment of the sect.<br/><br/>Even at the sect’s most dangerous times, they never encountered such a dreadful loss.<br/><br/>Taking into account the Peak Master that was already killed before, five Nascent Souls had died by that person’s hand.<br/><br/>He instantly raised the danger level of that foreigner to its highest.<br/><br/>Immediately after, he issued three urgent orders, summoning the last three Peak Masters who were still outside back to the sect.<br/><br/>Next, the Ancient River Sword Sect would transition into the strategic defensive phase.<br/><br/>As for that foreigner…<br/><br/>He said with bitter resentment, “I shall avenge this great hatred in the future!”<br/><br/>…<br/><br/>…<br/><br/>After Gu Yang finished off the Nascent Souls of the Ancient River Sword Sect, he obtained a huge harvest.<br/><br/>Their wealth did not fall short compared to Youming Laozu’s, each had several Magic Treasures, all kinds of types. Altogether they had achieved more than ten.<br/><br/>There were also all sorts of intriguing oddities.<br/><br/>As expected from the elder generation of great sects, each one could be worthy of being called a Treasure Child.<br/><br/>Although they did not possess any spiritual treasures, four Pure Yang Flying Swords pretty much made up for it.<br/><br/>Gu Yang fully charged those ordinary Magic Treasures and all sorts of peculiar belongings, gaining a total of 1,200 energy points.<br/><br/>Only those four Pure Yang level Flying Swords were left. Such level of Magic Treasures were quite rare, especially since they were a set and could form into a Sword Formation, they were even rarer.<br/><br/>In this way, his energy balance reached more than 4,300 points.<br/><br/>“El… Elder, we should leave this place,” said a frightened helper.<br/><br/>Huang Yongkang saw him dealing with the loot in a leisurely manner, he looked rather apprehensive and nervously glanced around as if worried about a flying sword soaring across the sky to finish them off.<br/><br/>“You have killed four Nascent Souls of the Ancient River Sword Sect, they will definitely not let it go.”<br/><br/>He knew very well the practice of these great sects, once offended, they will not rest until they take revenge.<br/><br/>Keep in mind that the Ancient East Sword Sect had the existence of Divine Transformation powerhouses.<br/><br/>Perhaps this Elder wasn’t scared, but he was scared.<br/><br/>During fights between immortals, mortals bear the brunt of their power. His small body couldn’t endure such a strike.<br/><br/>Gu Yang said, “If you are scared, you can go.”<br/><br/>“Then, goodbye Elder.” Once Huang Yongkang heard this, he immediately flew away.<br/><br/>What a sneaky figure.<br/><br/>Gu Yang did not mind at all, for he already knew the simulation results. The Divine Transformation powerhouse from the Ancient River Sword Sect did not make a move.<br/><br/>He looked at the wooden box in his hands, only to see it engraved with a prohibition which was impossible to break.<br/><br/>Within the Supreme Heavenly Book, although there were contents about prohibitions, he didn’t have time to waste on this.<br/><br/>His understanding of prohibitions is limited. He could only see that the prohibition on the wooden box was very clever. Anyway, he could not break it.<br/><br/>No wonder that boy gave up the box so readily, it must be because he found it impossible to open.<br/><br/>Gu Yang could only store the box away.<br/><br/>Then, he took out that suspiciously divine- looking image. At first glance, it seemed disorderly, but gazing at it closely caused a dizzying sensation, as if some of his spiritual power had been absorbed by it.<br/><br/>He hastily removed his gaze, not daring to stare at the diagram any longer.<br/><br/>“This picture is indeed unusual.”<br/><br/>He tried to imbue it with a bit of mana, but it was like casting a stone into the sea with no response at all.<br/><br/>“Don’t play dead, I know you can hear me.”<br/><br/>He said out loud.<br/><br/>The diagram offered no response.<br/><br/>Gu Yang took out the Human Emperor’s Sword from the Beast-taming Space and said, “You know what it is? The Human Emperor’s Sword, specialized in slaying all kinds of demons and evil spirits, do you want to test its sharp edge?”<br/><br/>Seeming to sense the sinister presence within the image, the Human Emperor’s Sword emitted a golden glow.<br/><br/>The picture slightly trembled.<br/><br/>Coldly, Gu Yang declared, “Accept me as your master, otherwise, I will completely obliterate your primordial spirit. I’ll give you three breaths of time, three, two…”<br/><br/>“Master!”<br/><br/>On the surface of the painting, a speedy formation took shape, creating an image of a Black Dragon which respectfully bowed to him.<br/><br/>“Why couldn’t you have been like this from the start.”<br/><br/>Gu Yang put away the Human Emperor’s sword.\t\t\t\t\t\t</div>", "images": {}, "success": true}