{"id": 379, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132359.html", "title": "Chapter 379 - Chapter 379: 379 Slaying Celestial Immortal", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 379 - Chapter 379: 379 Slaying Celestial Immortal</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 379: 379 Slaying Celestial Immortal<br/><br/>“This—”<br/><br/>Upon seeing Gu Yang cut down Fu Wansheng with a single strike, Ye Lingbo’s mouth gaped slightly, as if she was struggling to find words to articulate her shock.<br/><br/>She had only just discovered her past life and even though her understanding of it was only superficial, one thing was incontrovertible: Fu Wansheng was connected to her in some way.<br/><br/>In her previous life, Fu Wansheng, when he was still the Primordial Spirit of the Landscape Map, had betrayed his master, Water Moon Heavenly Monarch, all for her sake.<br/><br/>The arrangements that had been made afterwards to transfer her to the Great Zhou for a new life likely came from him.<br/><br/>Fu Wansheng, a man she had never met before, was without doubt a benefactor.<br/><br/>And now, he was slain by Gu Yang with a single slash.<br/><br/>On one side was her benefactor, on the other her Dao Companion.<br/><br/>A wave of conflicting emotions washed over Ye Lingbo.<br/><br/>…<br/><br/>Throughout Gu Yang’s violent process of slaying Fu Wansheng, Yun Piaomiao displayed no reaction.<br/><br/>Once it was all over, he sneered coldly, “So what?”<br/><br/>With Fu Wansheng’s death, he was liberated from the Heart Inquiry Mirror he held.<br/><br/>With his current strength, he could only use the Heart Inquiry Mirror to deal with one enemy at a time.<br/><br/>Otherwise, why bother with such trouble? One flash of the Heart Inquiry Mirror, and those people would already be dead.<br/><br/>Just as Gu Yang said, his strength was not yet at a level that could dominate the entire situation. His firm control over the situation, and his creation of an invincible aura, was merely a clever ruse.<br/><br/>During that battle all those years ago, he had nearly perished completely due to the betrayal of the Primordial Spirit of the Landscape Map, and in the end was left with nothing but a sliver of True Spirit.<br/><br/>All these years, under the relentless grind of time, even that sliver of his True Spirit was nearly extinguished.<br/><br/>Some thousand years prior, when he could no longer sustain himself, he left that void. His fraction of True Spirit returned to Water Moon Heaven and spent the last of its energy maintaining his True Essence as he reincarnated.<br/><br/>From that point, all traces of his Celestial Immortal self ceased to exist, and he had to start from scratch.<br/><br/>In this life, he was called Yun Piaomiao. His mother had dreamt of a ethereal fairyland when she gave birth to him, hence she gave him such a name.<br/><br/>Leveraging his profound foundation, he took step by step, cultivating from nothing until he reached the early stages of God Transformation.<br/><br/>Afterwards, he could no longer progress further.<br/><br/>Firstly, his physical potential was limited. Secondly, due to the changes in the Way of Heaven, practically reaching the God Transformation stage was already the limit that the heavens and the earth could accommodate. Trying to progress even slightly further was extremely difficult.<br/><br/>If he wished to advance further, the only way was to reclaim the Heart Inquiry Mirror.<br/><br/>He had visited the mountain gates of the current Water Moon Sect. It was well guarded. As long as two Nascent Souls were stationed there, he would find it hard to break through.<br/><br/>The present Water Moon Sect had seven or eight Nascent Souls.<br/><br/>Being extremely cautious, he never acted without assurance. Hence, he abandoned his plans of forceful attack.<br/><br/>Since then, he had been seeking an opportunity, a chance to confront Fu Wansheng directly.<br/><br/>But to wrestle the Heart Inquiry Mirror from Fu Wansheng was not a simple task.<br/><br/>Fu Wansheng’s cultivation level far surpassed his own. If the two fought to the death, Yun Piaomiao would not be confident of victory. Should the traitor escape, chances of finding such an opportunity again would be practically nonexistent.<br/><br/>Yun Piaomiao had waited several years, and finally such an opportune moment had arrived.<br/><br/>He struck first, planting an indomitable illusion in Fu Wansheng’s heart, then exploited Ye Lingbo to further shake Fu’s resolve. Finally, he successfully reclaimed the Heart Inquiry Mirror.<br/><br/>With the Heart Inquiry Mirror back in his hands, Fu Wansheng no longer posed a threat.<br/><br/>On the contrary, he utilized Fu Wansheng’s power to channel a strand of the Landscape Map’s power, thereby trapping everyone else present in the scene.<br/><br/>Herewith, he had the situation completely in hand, and had undoubtedly triumphed.<br/><br/>The next step was to uncover the great secret hidden within Ye Lingbo.<br/><br/>The Landscape Map was a gift bestowed by his master. This made his master, the Azure Emperor, the true master of the Landscape Map.<br/><br/>The only one capable of inducing the Landscape Map’s Primordial Spirit to betray him was none other than his master.<br/><br/>Among his master’s disciples, be it in terms of talent, comprehension or power, he far surpassed Ye Lingbo.<br/><br/>However, his master had intentionally left a back door in the Landscape Map, positioning Lingbo, a mere junior sister, in importance above himself, the master of the Landscape Map.<br/><br/>This was too far from the ordinary.<br/><br/>His master was one of the Five Emperor of Heaven. Behind each of his moves, there must be profound meanings.<br/><br/>For several years, he had been wondering, what secret was actually hidden within Ye Lingbo?<br/><br/>Back then, if it wasn’t for the betrayal of the Landscape Map, he would have already suppressed the other three Celestial Immortals within the Map, and confiscated their Dao foundations to evolve the Landscape Map into a true world…<br/><br/>But the sudden betrayal of the Landscape Map’s Primordial Spirit ruined it all.<br/><br/>Ultimately, he was compromised to such a pitiable state.<br/><br/>Now, even a Nascent Soul stage youngster dared to clamor in his presence.<br/><br/>“So what?”<br/><br/>This seemingly calm statement was imbued with a potent killing intent.<br/><br/>This time, Yun Piaomiao was genuinely enraged.<br/><br/>He rotated the Heart Inquiry Mirror in his hand, letting a seven-colored light beam shine.<br/><br/>In the blink of an eye, Gu Yang’s reflection appeared on the mirror.<br/><br/>“Stop!”<br/><br/>Having gained their freedom, Wen Jue and the headmaster made their moves almost simultaneously.<br/><br/>They had seen Fu Wansheng turning soulless after being touched by the mirror earlier. They were aware of the power of this spiritual treasure.<br/><br/>As soon as they acted, they launched an offensive to protect their own.<br/><br/>…<br/><br/>Yun Piaomiao paid no heed to the attacks of these two. Even if he had fallen, he was not a contender that a grievously wounded person and a newly ascended celestial being could challenge.<br/><br/>From his other hand, a whip-like ray of light shot, like a flying sword, towards the Nascent Soul stage boy.<br/><br/>This sword aimed directly for his vitals.<br/><br/>The moment Yun Piaomiao made his move, it was a flurry of combinations, leaving no room for his opponent to breathe.<br/><br/>Clearly, he was taking the Nascent Soul stage kid seriously.<br/><br/>“Hmmm?”<br/><br/>He quickly realized that something was wrong. When the flying sword reached the boy’s chest, he suddenly lost his sensory connection to it, as if some force had wiped out his spiritual perception.<br/><br/>How was that possible?<br/><br/>Yun Piaomiao trembled inwardly as he saw the boy reaching out, taking his flying sword between two fingers, raising his head to look at him, his eyes full of mockery.<br/><br/>“Why isn’t he lost within the Heart Inquiry Mirror?”<br/><br/>The Heart Inquiry Mirror directs one’s heart, regardless if you are a Da Luo Golden Immortal. In front of the Heart Inquiry Mirror, one must confront their inner interrogation.<br/><br/>Ever since he acquired this spiritual treasure, it had served him well, effectively questioning the hearts of even the most formidable enemies.<br/><br/>Even with its diminished power, it was not something a Cultivator at the Nascent Soul stage could resist.<br/><br/>Why wasn’t the other party affected?<br/><br/>Yun Piaomiao couldn’t make sense of it.<br/><br/>…<br/><br/>However, Gu Yang knew exactly what happened.<br/><br/>He finally understood why the ancient Celestial Immortal failed to cause him any trouble.<br/><br/>This guy, he had completely subdued him.<br/><br/>His spatial confinement from the Mountain and River Map was nullified by his Forbidden Magic Field.<br/><br/>The Heart Inquiry Mirror was rendered useless by his Candle Dragon Divine Power.<br/><br/>The Candle Dragon Divine Power can see through all illusions and illusionary realms.<br/><br/>The magic of the Heart Inquiry Mirror, plainly put, is also high-level illusion magic. Under the eye of the Candle Dragon, capable of piercing through all falsehoods, the heart interrogation magic of the Heart Inquiry Mirror failed him.<br/><br/>Yun Piaomiao’s two most potent defenses were ineffective against him, indicating his imminent defeat.<br/><br/>“Now it’s my turn!”<br/><br/>Before Gu Yang could finish speaking, he arrived in front of Yun Piaomiao, and the Human Emperor’s sword descended.<br/><br/>Zhanxuan Swordsmanship’s second form, the Godslayer!<br/><br/>This was what he had realized when he was comprehending his martial arts will before rushing here.<br/><br/>It was also the reason why he dared to step into this troubled water.<br/><br/>“Hmph!”<br/><br/>Yun Piaomiao reacted swiftly. Before Gu Yang could get close, he prepared to escape, vanishing from where he stood.<br/><br/>Just then, a golden light emanated from the Heart Inquiry Mirror, halting him in his tracks.<br/><br/>“How dare you!”<br/><br/>Yun Piaomiao roared furiously.<br/><br/>This golden light was precisely the glimpse of True Spirit of Fu Wansheng he had captured into the mirror earlier.<br/><br/>At the critical moment, Fu Wansheng’s True Spirit halted Yun Piaomiao’s escape again, like history repeating itself.<br/><br/>The next moment, the sword of the Human Emperor descended, cleaving Yun Piaomiao’s body into two.<br/><br/>“Zhanxuan -”<br/><br/>He only managed to utter these two words before his voice abruptly ended.<br/><br/>Under this sword, his Original Spirit was thoroughly destroyed.<br/><br/>An ancient Celestial Immortal, had fallen.<br/><br/>Ps: Continue to seek monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}