{"id": 372, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132346.html", "title": "Chapter 372 - Chapter 372: 372 Peak", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 372 - Chapter 372: 372 Peak</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 372: 372 Peak<br/><br/>[Do you want to use the life simulator? One use will consume five hundred points of energy.]<br/><br/>Gu Yang activated the system, anticipating a big battle. His current strength was insufficient and wouldn’t be very helpful.<br/><br/>If he could increase his strength a bit more, perhaps he could alter the outcome of the battle.<br/><br/>The four Demon Beast lords in the Misty Forest had inspired him, knowing that there was room for improvement, from the third layer of the Unleaking Realm to the Celestial Being Realm.<br/><br/>That’d be the Domain.<br/><br/>He had specifically asked the Elf High Priest about it. According to her, the peak human legendary figures of the third order all possessed their own Domains.<br/><br/>Such as the Wind Sage, who had previously visited the Elves.<br/><br/>Those with such a title were all super-powerful fighters who had mastered their Domains.<br/><br/>Gu Yang, while in Great Zhou, hadn’t yet fought any martial artists of this level. Hence, he wasn’t sure if there were any among them who had mastered something like a Domain.<br/><br/>During his attempt to rescue someone from the Qin family, he thought he would fight Qin Wu, who was about to break into the Celestial Being Realm. However, people from Yao Chi Immortal Palace interfered, and the fight didn’t happen.<br/><br/>The other was Wen Jue, who was also very close to becoming a Celestial Being. Last time when they jointly invaded the palace, she faced the palace’s prohibition and blocked the two powerful Unleaking Realm warriors.<br/><br/>She might have used something similar to a Domain then.<br/><br/>However, his cultivation level was too low at that time to discern what she used exactly.<br/><br/>But, even if no one in Martial Arts had mastered such a Domain-like power, he was confident that he could forge his own path.<br/><br/>As long as he knew the direction, he could use the simulator to try and fail continuously, until he found the correct method.<br/><br/>“Yes.”<br/><br/>[At the age of 23, you have reached the third level of Unleaking Realm. You kill four Nascent Soul warriors from Ancient River Sword Sect while in the Water Moon Pocket Universe and get targeted by Bi Shui Daoist.]<br/><br/>[You go to Forget-Worry Mountain to witness Wen Jue’s breakthrough and perceive the Way of Heaven.]<br/><br/>[As Wen Jue is about to break into the Celestial Being Realm, a streak of Sword Light flies from the sky. At the critical moment, the principal of Wen Academy appears and blocks this sword.]<br/><br/>[Then you escape with Ye Lingbo.]<br/><br/>[As you both are fleeing for your lives, you detect Sword Light approaching in pursuit. You narrowly leave the Water Moon Pocket Universe.]<br/><br/>[Not long after, the principal of Wen Academy returns injured. You learn that Wen Jue fell during that battle.]<br/><br/>[You open the passageways to Wanxiang Pocket Universe and Star Luo Pocket Universe, and then lead Chu Xiyue and Su Qingzhen to the Broad Cold Immortal Palace.]<br/><br/>[Half a year later, you leave the palace, go to the Golden Court Pocket Universe, and establish a cooperative relationship with the ruler of Golden Court. You strike everywhere, in two months, the gods of the other two territories are wiped out.]<br/><br/>[The rulers of the other two territories are completely infuriated and band together to kill you. The ruler of Golden Court descends from the sky, you join hands, kill the two rulers, and unify the Gold Emperor’s Jade Register.]<br/><br/>[A year later, the ruler of Golden Court successfully breaks through, becomes a Celestial Monarch, and reaches the Hollow Void cultivation level.]<br/><br/>[Not long after, two Celestial Beings from Yao Chi Immortal Palace arrive and are killed by the ruler of Golden Court.]<br/><br/>[Following your suggestion, Golden Court ruler fortifies the entrance of the Pocket Universe, blocking the invasion of the creatures.]<br/><br/>[Ten years later, the entrance of Pocket Universe is breached, and a Hollow Void creature leads a group of creatures to invade. The ruler of Golden Court fights a brutal battle with them.]<br/><br/>[Three years later, the creatures reach the core of Golden Court and launch the final battle. At the crucial moment, an Immortal Palace intervenes, killing countless creatures and rescuing the ruler of Golden Court. You are unable to board the Immortal Palace and die on the spot at the age of 38]<br/><br/>The Golden Court ruler finally managed to break through.<br/><br/>Gu Yang felt somewhat appreciative in his heart. The Forbidden Magic Domain was a great weapon against cultivators below the Celestial Being level.<br/><br/>“It seems like, even that Spirit Treasure, Youming Map, is powerless against creatures of Hollow Void level,” Gu Yang thought.<br/><br/>Initially, he thought possessing the Forbidden Magic Domain and Youming Map, both of which were targeted at creatures, could resolve the crisis posed by these creatures.<br/><br/>It appeared now that the strength of the Hollow Void level had exceeded the capacity of the Youming Map.<br/><br/>And the Immortal Palace that saved the ruler of the Golden Court in the end – could that have been Yao Chi Immortal Palace?<br/><br/>Saving the ruler of Golden Court but not him – they really were realistic.<br/><br/>[Simulation ended. You can keep one of the following.]<br/><br/>[1. Your Martial Arts realm when you were 38 years old.]<br/><br/>[2. Your Martial Arts experience when you were 38 years old.]<br/><br/>[3. Your life wisdom when you were 38 years old.]<br/><br/>“I choose number one.”<br/><br/>Gu Yang quickly made a choice without hesitation.<br/><br/>He felt that his Unleaking Realm third level still had room for improvement.<br/><br/>Currently, he had only integrated his blood cells with his Original Spirit. Next, he needed to spread this integration to all cells in his body. By then, he would have reached the peak of the Unleaking Realm.<br/><br/>In an instant, he could feel the changes in his body.<br/><br/>It had been fifteen years and his progress was less than one-twentieth of the whole body.<br/><br/>This means that at least twenty or so simulations are needed for him to meet the set objective.<br/><br/>His energy points won’t last that long.<br/><br/>“It seems I need to change the approach.”<br/><br/>He thought to himself.<br/><br/>[Do you want to use the Life Simulator? Each use costs five hundred energy points.]<br/><br/>“Yes.”<br/><br/>[…You take out the Moon God’s Bow and the arrow to establish a connection with Eve from a different continent. The elf high priest remotely activated a teleportation array, transferring you to the West Bank Continent.]<br/><br/>[…You live to be forty-five years old.]<br/><br/>Well, compared to his previous life, he managed to hold on for three more years.<br/><br/>The efforts over this period were not wasted, his strength had improved significantly compared to before.<br/><br/>Among them, the credit must go to the Ghost Realm Map for effectively holding back the steps of the invading evil god.<br/><br/>Living seven years longer than on the Golden Continent, not bad.<br/><br/>Next, Gu Yang spent all his remaining balance in one go.<br/><br/>Five thousand eight hundred points, that’s a total of eleven simulations.<br/><br/>“Still not enough.”<br/><br/>He wore a solemn expression as he took out everything from the God-controlling Space.<br/><br/>At this moment, he must make some compromises.<br/><br/>The Moon God’s Bow, seemingly magic treasure, could not connect with the Primordial Spirit and could be activated only by using the power of Taiyin Youying. But it was the only way to communicate with Eve from another continent.<br/><br/>If its energy is charged, he won’t be able to get to the West Bank Continent in the short run.<br/><br/>Ghost Realm Map, magic treasure, turned out to be quite useful for now.<br/><br/>The Giant Spirit Hammer, magic treasure, could ignore the effects of the Forbidden Magic Field. Combined these two, no one in the Unleaking Realm could withstand his strike.<br/><br/>He was reluctant to part with these magic treasures, so he had to turn to some other items.<br/><br/>Eventually, he gritted his teeth and took out the four Pure Yang Flying Swords – the very ones capable of setting up a Four Symbols Sword Formation.<br/><br/>These four Pure Yang magic tools, only when combined with the strength of four Unleaking beings, could set up a sword formation. Its power is slightly greater than the domains of lord-level magical beasts in the Misty Forest.<br/><br/>But it does not reach the scope of the Celestial Being realm.<br/><br/>Prime conditions are required for their use, heaven knows when Su Qingzhen and others will reach the Unleaking Realm.<br/><br/>For the time being, they are not practical and can only be stored away.<br/><br/>Better to liquidate them now, and as his strength grows stronger, he can get better things.<br/><br/>[Energy Source detected, do you want to charge it?]<br/><br/>Gu Yang, after thinking it through, said, “Yes.”<br/><br/>[Charging successful, obtained four thousand energy points, current balance is four thousand three hundred.]<br/><br/>This is so valuable!<br/><br/>Gu Yang was a little surprised. He thought that Pure Yang magic tools were only worth five hundred points, and having two thousand points is already quite significant.<br/><br/>Unexpectedly, each of the four swords were worth a thousand points.<br/><br/>No, it should be that sets are more valuable than individual pieces.<br/><br/>This system is quite smart.<br/><br/>“Continue.”<br/><br/>Gu Yang continued to simulate.<br/><br/>By the time of the fifth simulation, he had finally converted all his body cells.<br/><br/>Such a level, compared to the ancient times, would be bleeding and rebirth, the pinnacle of body cultivation, where even one drop of blood left could potentially bring about resurrection.<br/><br/>Continuing practice could result in the unwavering Original Spirit, crossing into the realm of the Heavenly Dao’s scope.<br/><br/>Nowadays, since the Heavenly Dao has been destroyed, the Original Spirit cannot be put into the void and is impossible to practice to that extent.<br/><br/>What follows next, the effort would be targeted towards the domain realm.\t\t\t\t\t\t</div>", "images": {}, "success": true}