{"id": 389, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132379.html", "title": "Chapter 389 - Chapter 389: 389 Total Annihilation Of The Army", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 389 - Chapter 389: 389 Total Annihilation Of The Army</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 389: 389 Total Annihilation of the Army<br/><br/>As soon as the woman in palace attire began to speak, everyone’s attention was immediately drawn to her, leaving Gu Yang forgotten. Their own safety was what mattered the most.<br/><br/>The situation was unclear at the moment, and everyone wanted to know the woman’s purpose who seemed to be the one running the show in the Immortal Palace. The invitation she extended to them to attend the Yaochi Conference felt like a subtle coercion rather than a genuine invitation.<br/><br/>“May I ask how I should address the fairy maid?”<br/><br/>Suddenly, there came a voice from the seats, “Would you enlighten me about the purpose of inviting us?”<br/><br/>The speaker was a middle-aged man with a square face, dressed in a bright yellow robe. He exuded a sense of nobility, and his tone was neither humble nor arrogant.<br/><br/>Luo Wang?<br/><br/>Just by observing his demeanor, Gu Yang guessed that he must be the real pillar of Great Zhou, the Steady Sea Divine Needle, Luo Wang—who never interfered in politics yet whose reputation could intimidate the world and was a powerful Celestial Being.<br/><br/>He looked kind of familiar.<br/><br/>That’s right, he looked somewhat like the painting of Taizu.<br/><br/>There was a painting of Great Zhou’s Taizu in the imperial palace, which he had seen a few times.<br/><br/>As Luo Wang was Taizu’s younger brother, it made sense that he would resemble him.<br/><br/>…<br/><br/>The woman in palace attire turned to the man in the yellow robe and said, “My name is Lu Ying, and I am the 7th disciple of the Immortal Palace.”<br/><br/>“The Yaochi Conference is a banquet set up for the birthday of our master, held once every 500 years. It just so happens that it is the 500th year, and in the absence of our master, I am hosting it.”<br/><br/>So, she was a disciple of the lord of this Yao Chi Immortal Palace.<br/><br/>Then, someone else spoke up, “I have long desired to attend the Yaochi Conference. It is an honor for me to participate in such a grand event. However, I heard that those who attend the Yaochi Conference are awarded a flat peach—a rule set by the lord of the Immortal Palace. Does this rule still stand?”<br/><br/>The speaker was Qingyu Great Sage. Although her tone was plain and her demeanor seemed humble, her words were sharp, bringing up the lord of the Immortal Palace.<br/><br/>The expressions of both Jade Dew Divine General and Master Sichen behind Lu Ying slightly changed.<br/><br/>Lu Ying’s tone remained unchanged as she nodded and said, “Indeed, it’s a rule set by my master. As you all have come to attend the Yaochi Conference, everyone has a chance to receive a flat peach.”<br/><br/>At the word “chance,” Qingyu Great Sage’s eye’s visibly sharpened, and she asked, “Chance?”<br/><br/>Lu Ying replied, “After the collapse of the Way of Heaven ten thousand years ago, the flat peach tree no longer bears new fruit. Now, only a few flat peaches are left. A great disaster is around the corner, so we need to use them sparingly.”<br/><br/>When she mentioned the upcoming “great disaster,” she cast a glance at Gu Yang. However, there was a fog enveloping her, preventing others from seeing exactly whom she was looking at.<br/><br/>A great disaster?<br/><br/>Upon hearing her words, something stirred within Gu Yang.<br/><br/>Could she be referring to the light that is destined to kill him in ten years?<br/><br/>…<br/><br/>Lu Ying continued, “Only the truly strong are worthy of a flat peach. If anyone of you can defeat my Jade Dew Divine General, then a flat peach will be yours.”<br/><br/>The Jade Dew Divine General, upon being named by her, immediately stepped forward, and there was a powerful aura radiating from him. His golden armor was shimmering with an icy cold light under the sun.<br/><br/>For all the ones present in the Unleaking Realm, the desire to compete had been stamped out.<br/><br/>Fighting against a Celestial Being was utterly humiliating.<br/><br/>Since ancient times, there have been few who could defeat opponents of higher ranks. Only the freakish Gu Yang, who took defeating higher-ranked opponents as easy as daily meals.<br/><br/>They knew their own weight.<br/><br/>If they had to compete against someone in the same Unleaking Realm, they might try to challenge them. However, to fight against a Celestial Being? They would rather not.<br/><br/>Now, it was up to the eleven Celestial Beings.<br/><br/>…<br/><br/>“What is this ‘great disaster’ the fairy maid speaks of?” Qingyu Great Sage was also a bit puzzled.<br/><br/>The Celestial Beings’ invitation was different from those in the Unleaking Realm. The nine Celestial Beings arrived earlier and went directly into the Immortal Palace with their invitations. They did not see the blood-red sky.<br/><br/>Lu Ying said, “You will naturally know once you step outside. Does anyone want a flat peach?”<br/><br/>Among the eleven Celestial Beings present, none stood up.<br/><br/>Everyone coveted the flat peach, but no one wanted to be the first to tread into the unknown and test the waters—it was a gamble they were unwilling to take.<br/><br/>They were all unaware of this Jade Dew Divine General’s potential. The first one to compete would be at a disadvantage, giving others an opportunity to gauge his strength and weakness through the showdown.<br/><br/>None of the eleven Celestial Beings were willing to make this sacrifice.<br/><br/>After a while, still no one had stepped forward.<br/><br/>As Lu Ying quickly guessed their worries, she said, “If any of you are worried about the risks, there is no need to worry. We have set up a specialized combat field here for fair competitions. Inside, you can safely compete without fearing for your lives. The defeated will be automatically transported out.”<br/><br/>“Additionally, if you don’t want others to see your match, I can seal off the combat field to prevent other guests from watching.”<br/><br/>There’s such a thing?<br/><br/>Upon hearing this, Gu Yang realized that today’s battle would be terribly tough.<br/><br/>The combat field in Yaochi Immortal Palace was clearly a place for practical training. Inside, without worrying about injuries, they could freely spar with each other, accumulating unimaginable battle experience.<br/><br/>All this time, Gu Yang had been overpowering opponents of the same rank and even defeating higher-ranked ones. The abundant battle experience obtained from simulations contributed to his success as much as his superior cultivation level and superior techniques.<br/><br/>This allowed him to weather any opponent with ease.<br/><br/>However, such an advantage would no longer exist in front of those from the Yaochi Immortal Palace.<br/><br/>Perhaps, their battle experience was even more extensive than his.<br/><br/>…<br/><br/>“I’ll go.”<br/><br/>At this point, someone finally stood up. He was a man in gray clothes who, judging by his appearance, was likely one of the two Celestial Beings from the Barbarians of the grasslands.<br/><br/>He stepped into the arena with a fighting spirit, standing face-to-face with the Divine Soldier Yulu.<br/><br/>Suddenly, both of their figures vanished into thin air, and no one knew where they had been transported to.<br/><br/>Upon seeing the scene of the two being transported away, Gu Yang couldn’t help but think of the prehistoric spiritual treasure called the Mountain and River Map of the Water Moon Cave. This Yaochi Immortal Palace was likely also a prehistoric spiritual treasure.<br/><br/>Otherwise, the people of the Yaochi Immortal Palace could not have survived from the ancient times to the present.<br/><br/>Gu Yang was still somewhat puzzled. The Yaochi Immortal Palace in the future was clearly fierce, ruthlessly killing warriors of Great Zhou. Why didn’t they seize the opportunity to annihilate them now?<br/><br/>Inside the Yaochi Immortal Palace, they were helpless. If Lu Ying wanted to kill them, it would be extremely easy.<br/><br/>Surprisingly, she not only didn’t kill them, but also said that whoever could defeat her would be rewarded with a flat peach.<br/><br/>The inconsistency in her actions was too huge, almost as if she had a split personality.<br/><br/>Gu Yang seriously suspected that the Yaochi Immortal Palace had changed hands in the future.<br/><br/>Otherwise, it would be difficult to explain this inconsistency.<br/><br/>Whoosh—<br/><br/>At this moment, a figure appeared out of nowhere; it was the Celestial Being from the Barbarians.<br/><br/>He looked disheveled, with his clothes in tatters and half of his hair burnt off. His expression was extremely gloomy, as if he was about to cry.<br/><br/>He silently returned to his seat, but, surprisingly, he did not appear to be injured.<br/><br/>It was evident that he had suffered a devastating loss, and the entire process had taken less than two seconds. It was almost like being killed instantly.<br/><br/>The impressive strength of the Divine Soldier Yulu was clear to see.<br/><br/>“Who’s next?”<br/><br/>“I would like to learn from your expertise.”<br/><br/>The one who spoke was Qin Wu, who was sitting next to Gu Yang. He rose and stepped into the ring, throwing a challenge to the Divine Soldier Yulu.<br/><br/>The figures of the two quickly vanished, transported to the dueling field.<br/><br/>…<br/><br/>……<br/><br/>Gu Yang looked at Lu Ying, thinking that she would definitely be able to witness the fight in the dueling field.<br/><br/>He was quite interested in the martial arts of other Celestial Beings, but unfortunately, he couldn’t see them.<br/><br/>After a moment, Qin Wu was forced to return, having also lost. He had resisted for about two seconds longer than the previous contender, but he did not look as disheveled. Only the clothes on his chest were torn.<br/><br/>The Divine Soldier Yulu swept her gaze over the remaining ten people, asking, “Who’s next?”<br/><br/>Seeing that the others did not seem to be injured, they sequentially issued challenges to the Divine Soldier Yulu.<br/><br/>Regrettably, they all lost.<br/><br/>Both Saint Chaoyang and Red Moon Great Saint had also participated, but they lasted only a little longer.<br/><br/>Last of all, Qingyu Great Sage, who had the highest cultivation level, stayed the longest in the dueling field, for several minutes.<br/><br/>However, she still lost.<br/><br/>As such, all the Celestial Beings of the Divine State had fallen under the sword of the Divine Soldier Yulu.<br/><br/>All the Unleaking Realm martial artists present were slightly desperate. The Divine Soldier Yulu had managed to defeat all the Celestial Beings of the Divine State alone.<br/><br/>Looking at Lu Ying’s attitude towards him, he didn’t seem too important.<br/><br/>How strong must this legitimate student of the Yaochi Immortal Palace, Lu Ying, be?<br/><br/>How were these ancient immortal cultivators so strong?<br/><br/>Could their martial arts be so weak and brittle?<br/><br/>“I’ll go!”<br/><br/>At this moment, a calm voice echoed.<br/><br/>People then realized that there was one individual who hadn’t competed yet—Gu Yang.<br/><br/>PS: Please vote.\t\t\t\t\t\t</div>", "images": {}, "success": true}