{"id": 385, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132371.html", "title": "Chapter 385 - Chapter 385: 385 There Are Ten More Years", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 385 - Chapter 385: 385 There Are Ten More Years</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 385: 385 There are ten more years<br/><br/>“Huh?”<br/><br/>Deep underneath the imperial palace, at the foundation of the Nine Godly Cauldrons, a dried-up corpse crawled out from the earth. The faint glow in its eye sockets was terrifyingly bright. It raised its head and stared above, as if it could see through the thousands of meters thick layer of soil and witness the strange phenomenon in the sky.<br/><br/>Its body shook uncontrollably, and a shrill voice echoed throughout the palace, “It’s coming, it’s coming again…”<br/><br/>Then, it burrowed back into the earth and disappeared.<br/><br/>The entire underground palace was left in a deathly silence.<br/><br/>…<br/><br/>In the Red Mansion, in Divine City, a little girl was tidying up the table, grumbling under her breath, “He left without saying anything. How rude…”<br/><br/>Suddenly, she trembled and collapsed to the ground, holding her head and trembling as if she had encountered something terrifying.<br/><br/>The man in white sitting there, whose face had always been as calm as an ancient well, showed a startled expression. He abruptly stood up and appeared at the doorway, looking at the streak of blood in the sky, his face turned incredibly pale. He muttered, “How could it be…”<br/><br/>At that moment, the book in the middle of the wooden shelf started glowing brightly. As the pages flipped, a name flew out from inside, it was ‘Gu Yang’.<br/><br/>“It’s him!”<br/><br/>The man in white was taken aback when he saw the book that hadn’t been opened in ten thousand years flipped open again, and a name flew out. His face instantly turned ashen.<br/><br/>It’s over…<br/><br/>He finally knew what had happened.<br/><br/>Gu Yang had become a Human Immortal in this world!<br/><br/>Since the Way of Heaven had collapsed, this was the second time in ten thousand years that someone had broken through to the realm of Human Immortal in the human world.<br/><br/>The last time was eight thousand years ago.<br/><br/>In fact, when the Way of Heaven collapsed, many Immortal Rank powerhouses survived through various means. Their numbers were not small.<br/><br/>However, when that person achieved the rank of Human Immortal, it led to terrifying consequences. Almost all the surviving Immortal Rank powerhouses died in that catastrophe.<br/><br/>In that catastrophe, the Monster Race and humans, who were originally mortal enemies, uncommonly joined forces to resist a common enemy, but in the end, they were still defeated.<br/><br/>Since then, the human world had fallen into a dark era, and the cultivation tradition was almost cut off.<br/><br/>Now, there was another person who had broken through to the rank of Immortal in the human world. A similar phenomenon had appeared in the sky.<br/><br/>Eight thousand years ago, when that person stepped into the Immortal rank, the sky turned as red as blood, and a gigantic wound appeared in the middle.<br/><br/>The white-clothed man looked bewilderedly at the trail of blood in the sky as if he was a soulless statue.<br/><br/>…<br/><br/>…<br/><br/>On the shore of the North Sea, next to a piece of rock, a tall, elderly man looked up at the streak of blood with deep fear in his eyes. He moved closer to the rock, hiding himself in a shadow.<br/><br/>Not far away, a group of people were scattered along the shore, all staring at the sky, with shock evident on their faces.<br/><br/>These were the Unleaking Realm powerhouses who came to attend the Yaochi Conference.<br/><br/>They were the elders of the nine great clans, disciples of the six major sects, some reclusive experts, and even some powerful foreign races from the grasslands and borderlands.<br/><br/>These were the top figures on this continent.<br/><br/>Usually, they secluded themselves most of the time and rarely left, but now, they were gathered on this unknown beach.<br/><br/>Many people on the scene had only heard their names, but had never met them. This was the first time seeing each other.<br/><br/>Although they were scattered, it was clear that they were divided into three camps.<br/><br/>The largest of the camps was the Great Zhou, with eight people from the nine great clans, seven from the six major sects, and five lesser-known powerhouses.<br/><br/>The second camp was the Barbarians from the grasslands, a total of nine people, all of them extraordinarily large, bare-chested, and their skin adorned with all sorts of bizarre patterns.<br/><br/>The Barbarian’s cultivation method differed significantly from Great Zhou’s. The patterns on their bodies were called totems, and they were known as Totem Warriors.<br/><br/>In the grasslands, only the bravest men could become Totem Warriors.<br/><br/>The third camp, the smallest with only five people, was a mix.<br/><br/>They came from remote locations. Some from tribal communities in the mountains and forests of the southeast, some from herding tribes in the west, and others from island tribes…<br/><br/>Truly people from all corners of the world. It was impressive that the Immortal Palace of Yaochi managed to gather so many people.<br/><br/>These Unleaking Realm powerhouses, who were at the pinnacle of the world, felt differently about the blood stain in the sky.<br/><br/>They all felt an inexplicable danger from the blood stain. Just looking at it, they had a feeling as if their Original Spirit was being devoured.<br/><br/>This gave rise to a very ominous premonition in their hearts.<br/><br/>Each person’s reaction was different; some had defensive looks, some were frightened, and some fell to their knees on the spot praying in a strange language…<br/><br/>“What on earth has happened?”<br/><br/>Suddenly, someone broke the silence, asking the question everyone wanted to know.<br/><br/>“A streak of blood has appeared in the sky. I remember reading about a similar occurrence in an ancient book. The sky bleeding red is an omen of a great disaster. In the ancient times, it triggered a catastrophe that almost led to the extinction of the human race.”<br/><br/>The one who spoke was Li Yuan, the eldest disciple of the scholar’s academy. He looked extremely grim.<br/><br/>The scholar’s academy was fervent about archaeology and had conducted considerable research on the ancient times. They had gathered more peculiar ancient materials than the traditional families with long histories.<br/><br/>Several people had gloomy expressions, all from historically old families and sects.<br/><br/>“Don’t make a fuss. It’s just a heavenly anomaly. What’s there to be afraid of?”<br/><br/>Of course, there were those who didn’t believe in the ominous sign. As martial artists, they had the courage to face everything.<br/><br/>Most people, however, remained silent.<br/><br/>…<br/><br/>Meanwhile, in a dimension, an Immortal Palace was suspended.<br/><br/>Inside the Immortal Palace, in the great hall, a woman in white palace attire stood at the front of the hall, looking at a bronze mirror. The mirror displayed the scene of Unleaking Realm powerhouses on the beach and a corner of the bloody sky.<br/><br/>The woman in palace attire was shrouded in a haze of white light, making it impossible to discern her appearance.<br/><br/>“Seventh Sister, stop it. The Blood Sky has reappeared, and that thing will descend to the human world again soon. If you leave traces of the Immortal Palace and attract that thing, you will be the sinner of Yaochi.”<br/><br/>Suddenly, a woman’s voice rang out, sounding remarkably weak.<br/><br/>A woman in palace dress said lightly, “Second sister, you’re too naive. Now that I’ve made this step, there’s no turning back.” As she spoke, she waved her hand, blocking out the voice altogether.<br/><br/>Her tone resolute, she commanded, “Pass the order, stick to the plan.”<br/><br/>A palace maid looking woman affirmed the order and retreated.<br/><br/>The woman in palace dress clenched her fist, staring at the mirror’s corner, at that glimpse of a blood-red sky, she murmured, “Only ten years left…”<br/><br/>…<br/><br/>…<br/><br/>“Was this phenomenon caused by me?”<br/><br/>Gu Yang looked at the “wound” in the sky, feeling something was off.<br/><br/>How could it be such a coincidence that such a phenomenon would appear in the sky just as he broke through to the Celestial Being realm?<br/><br/>What did this phenomenon represent?<br/><br/>He felt an uneasy palpitation as if foreseeing some significant event about to happen.<br/><br/>“Let it be. Just keep going.”<br/><br/>Quickly, he remembered his priorties and decided to set aside this phenomenon for now.<br/><br/>[Life Simulator, will you use it? One usage, consume one shard.]<br/><br/>“Yes.”<br/><br/>[At the age of 23…]<br/><br/>[You collaborated with the ruler of the Golden Court, helping him attain the Hollow Void realm, after which you bitterly cultivated in the cave of the Golden Court…]<br/><br/>[Ten years later, one day, a beam of light descends from the sky, you died, age 33.]<br/><br/>What the hell?<br/><br/>Gu Yang was somewhat taken aback as he read the end.<br/><br/>Why did he die out of the blue this time?<br/><br/>The previous simulation allowed him to live till fifty.<br/><br/>This time, surviving just ten years before dying abruptly, how ludicrous.<br/><br/>The light descending from the sky…<br/><br/>He suddenly looked up at the sky’s anomaly, an idea crossing his mind, “Could it be related to this phenomenon?”<br/><br/>But something seemed off.<br/><br/>He had already run a simulation earlier, and the sky’s phenomenon should have appeared after his breakthrough to the Celestial Being realm.<br/><br/>If it was related to this phenomenon, why hadn’t the light appeared during the last simulation?<br/><br/>Despite pondering long and hard, Gu Yang couldn’t make heads or tails of it.<br/><br/>Two simulations conducted back to back, what variable triggered the future’s change?<br/><br/>[End of Simulation. You may retain one of the following:]<br/><br/>[1. Martial Arts realm at age 33.]<br/><br/>[2. Martial Arts experience at age 33.]<br/><br/>[3. Wisdom of life at age 33.]<br/><br/>“I choose one.”<br/><br/>At present, he was accumulating his power. Naturally, he chose the first option.<br/><br/>There was a decent amount of progress this time as well.<br/><br/>But it was nothing compared to the last.<br/><br/>…<br/><br/>After long consideration, Gu Yang decided to run another simulation.<br/><br/>[At the age of 23…]<br/><br/>[You went to participate in the Yaochi Conference, triggered a prohibition, managed to reach somewhere, alarmed a palace maid, you silenced her…]<br/><br/>[You were trapped there, ten years later, a beam of light descends from the sky, you died, age 33.]<br/><br/>No way?<br/><br/>Even hiding in Yao Chi Immortal Palace couldn’t help evade that light. What on earth is that thing?<br/><br/>[End of Simulation…]<br/><br/>[…]<br/><br/>“I choose one.”<br/><br/>…<br/><br/>At the edge of the North Sea, this area belonged to the grassland’s territory, where a grassland tribe was setting up camp nearby.<br/><br/>By the time Gu Yang arrived, most people were already there.<br/><br/>Most of them, he had never met before.<br/><br/>But there were also old friends. An Unleaking realm from the Gao Family was sitting inside.<br/><br/>And there was Li Yuan from the college…<br/><br/>“Gu Yang!”<br/><br/>Suddenly, he heard a booming shout that buzzed in his ears. A figure appeared before him, dressed in a purple robe, looking prestigious.<br/><br/>This man was supposedly the unmatched Unleaking realm, Qin Wu, a legend who held his own against the world, even battling a Celestial Being and managed to retreat in one piece.<br/><br/>“Celestial Being!”<br/><br/>Suddenly, someone with a keen eye shouted in surprise.<br/><br/>Qin Wu had indeed reached the Celestial Being realm.<br/><br/>PS: Today was on the road all day, the update is less than usual, please forgive me. I will try to update more tomorrow, asking for monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}