{"id": 388, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132377.html", "title": "Chapter 388 - Chapter 388: Is He A Celestial Being?", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 388 - Chapter 388: Is He A Celestial Being?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 388: Is he a Celestial Being?<br/><br/>This time, Gu Yang finally managed to enter the Yao Chi Immortal Palace without any further complications.<br/><br/>He had no idea if the mysterious elder had also made it inside. Logically speaking, since the Jade Dew Divine Generals had discovered him, it shouldn’t have been easy for him to slip in.<br/><br/>But the elder was of extensive divine power and might have used some special method.<br/><br/>While lost in thought, a majestic palace gate appeared before his eyes, awe-inspiring at first glance.<br/><br/>This palace alone was much larger than the imperial palace in Divine City. On the palace gate, hung a plaque with three characters on it.<br/><br/>“Huh?”<br/><br/>To his surprise, no matter how hard he tried, he couldn’t make out the characters on the plaque.<br/><br/>It was as if a peculiar force was interfering with his vision.<br/><br/>After staring at it for a while, he even began to feel a certain confusion in his Original Spirit.<br/><br/>Gu Yang withdrew his gaze, deciding not to look anymore.<br/><br/>The others present also seemed to realize the abnormality of the plaque. Once they discovered they could not read the characters, they quickly shifted their gazes.<br/><br/>Even Qin Wu, who had already stepped into the Celestial Being realm, did not attempt to struggle with the plaque.<br/><br/>At least, everyone present had the cultivation level of the Unleaking Realm. Due to the realm’s characteristics, those who liked to show off or compete excessively didn’t live long.<br/><br/>Most people opted to lie low, avoid fighting whenever possible and live to fight another day.<br/><br/>This was fundamentally different from the thrill-seeking cultivation geniuses of the ancient era.<br/><br/>In ancient times, almost everyone who arrived here felt unsatisfied, using every means possible, trying to decipher the characters on the plaque.<br/><br/>But most of them failed. Only a very few could succeed.<br/><br/>Although Gu Yang was different from normal martial artists of the Unleaking Realm, he understood how dangerous the Yao Chi Immortal Palace was. He only wanted to safely pass this stage, and drew no attention to himself.<br/><br/>…<br/><br/>The Jade Dew Divine Generals felt somewhat disappointed seeing they were so compliant.<br/><br/>Before, during each Yaochi Conference, his favourite pastime was watching disciples of the great sects and unparalleled geniuses make fools of themselves in front of that plaque.<br/><br/>Only those who were Celestial Immortals and above could look directly at it as the owner of Immortal Palace himself wrote the plaque.<br/><br/>Although the Way of Heaven has collapsed and the plaque no longer possesses its original power, it is not something an ordinary Human Immortal can withstand.<br/><br/>“Everyone, follow me. Remember to stay behind me. Do not wander off or touch anything here.”<br/><br/>After the Jade Dew Divine General issued a warning, he led them into the palace gate before their eyes.<br/><br/>The rest followed. Each person carefully observed his footsteps and followed with precision, never missing a step.<br/><br/>Accumulated caution had been etched into the marrow of the martial artists of the Unleaking Realm. They avoided taking risks whenever possible.<br/><br/>Gu Yang was no different.<br/><br/>“Kiddo, are you really not coming with me?”<br/><br/>Suddenly, the voice of the mysterious elder resonated in his mind once more.<br/><br/>The elder truly managed to infiltrate the palace, but Gu Yang had no idea how he accomplished it.<br/><br/>His curiosity about the elder’s origins grew. Gu Yang subtly shook his head.<br/><br/>Next, he noticed one person suddenly breaking away from the group, slipping into a nearby passage, and disappearing within a blink of an eye.<br/><br/>The others naturally noticed it too. They looked at the Jade Dew Divine General but saw that he had no reactions, as if he didn’t mind at all if someone slipped away from the group.<br/><br/>…<br/><br/>Finally, the Jade Dew Divine General came to a halt. They were at a side hall. The plaque here didn’t possess the peculiar essence of the Dao like the previous one. It just read ‘Zhuan Yun Hall’.<br/><br/>He asked everyone to position themselves in the middle. Soon after, a white light shone.<br/><br/>Gu Yang blinked and found himself in another place.<br/><br/>Turns out, it was a teleportation array.<br/><br/>In front of him was a large lake. The mist above the lake was curling up, and the lake was surrounded by an array of green grass and orchids, creating an irresistibly beautiful scenery. A fragrant odor, impossible to describe, drifted into his nose, refreshing both mind and spirit and invigorating his Original Spirit.<br/><br/>The effects were relaxing to the point where he felt like he was floating in a celestial paradise.<br/><br/>There was no mistake, he was in a celestial paradise.<br/><br/>This was the ancient Immortal Palace, where being in such an environment nourished one’s Original Spirit.<br/><br/>A true cultivation holy ground.<br/><br/>Once entering the Celestial Being realm, the key to cultivation lied in the Original Spirit. Only with a strong enough Original Spirit could one perceive more of the Way of Heaven and its essence.<br/><br/>However, cultivating the Original Spirit was the hardest part.<br/><br/>After breaking through to the Celestial Being realm, Gu Yang finally unlocked the chapter of Human Immortal Rank in the “Taixuan Heavenly Book”, which guided him on how to cultivate at the Human Immortal Rank.<br/><br/>In ancient times, Human Immortals had various ways to aid their cultivation.<br/><br/>The first was natural treasures that could directly strengthen the Original Spirit, as well as mythical pills.<br/><br/>The second was precious treasures containing some kind of Dao essence – these could be naturally formed, left behind by Golden Immortals, or remains of divine beasts…<br/><br/>Cultivators could directly perceive the corresponding Dao essence from these treasures.<br/><br/>The third was the elders of the sect displaying their divine powers, showing the Way of Heaven they had mastered for everyone to perceive.<br/><br/>The last method included the revealing of the Way of Heaven when a being of the Immortal Rank broke through, which offered an excellent opportunity for others to perceive the Dao essence up close.<br/><br/>This was the reason why during Wen Jue’s breakthrough to the Celestial Being realm in the Water Cave Realm, all Celestial Beings in the realm came. It was not just to prepare against Fu Wansheng.<br/><br/>After the collapse of the Way of Heaven, all objects infused with Dao essence, natural treasures, or mythical pills… All of them lost their effectiveness.<br/><br/>Therefore, the Celestial Beings of this era could only painstakingly perceive the world directly. They wished to have some kind of template to refer to, but this was impossible and the mere thought of the inefficiency was infuriating.<br/><br/>For ten thousand years, no strong figure of the Hollow Void level has emerged. This is the primary reason.<br/><br/>In this Immortal Palace, just the fragrant flowers alone could nourish one’s Original Spirit, silently fostering it.<br/><br/>A plaque outside the Great Hall contained certain profound teachings.<br/><br/>This is the Yaochi Immortal Palace.<br/><br/>“Welcome, everyone, to the Yaochi Conference.”<br/><br/>At that moment, a woman’s voice rang out, “Please, take a seat.”<br/><br/>As soon as the voice fell, Gu Yang felt an invisible force enveloping him, and he was involuntarily teleported away from his original position.<br/><br/>With a blur in front of his eyes, he found himself seated on a chair.<br/><br/>He remained calm, following the simulation he had earlier, this Yaochi Conference would at most startle him but hold no real danger. Not only would he return safe and sound, but he would also gain some things.<br/><br/>…<br/><br/>The others were not as collected as Gu Yang; when they realized they were imprisoned, they all started to struggle.<br/><br/>However, their struggles were futile.<br/><br/>In the blink of an eye, everyone was teleported to their respective chairs.<br/><br/>Even Qin Wu, a Celestial Being realm warrior, who drew his sword, was unable to break free from the binds around him and ended up teleported onto a chair, sitting next to Gu Yang.<br/><br/>At this moment, everyone present was shocked to the core.<br/><br/>Just a moment ago, if the other side had intended to kill them, a single thought would have been enough to wipe them out.<br/><br/>If they had other intentions before, most of the people at this moment were dispirited and lost all desire to compete in power.<br/><br/>The gap between them and the inhabitants of this ancient Immortal Palace was too vast.<br/><br/>They didn’t stand a chance of winning.<br/><br/>…<br/><br/>Gu Yang used his spare time to observe the people beside him.<br/><br/>This was a platform located next to the Yaochi.<br/><br/>The central seat on top was conspicuously grand and luxurious. However, it was empty.<br/><br/>There were two smaller chairs on the side. On the leftmost seat, a woman dressed in palace attire sat, her figure shrouded in mist, making her face hard to discern clearly.<br/><br/>This woman was presumably the hostess of this Yaochi Conference.<br/><br/>The Jade Dew Divine General and Master Sichen stood behind her.<br/><br/>On the left, a woman dressed in a green dress sat, emitting a cold aura.<br/><br/>Sitting beside her was a familiar figure in a red dress—the Red Moon Great Saint.<br/><br/>Behind them sat the Saint Chaoyang.<br/><br/>With a single glance, the identity of the woman in the green dress at the top was revealed. She was the Qingyu Great Saint.<br/><br/>Apart from them, he didn’t recognize the others in attendance.<br/><br/>“So many Celestial Being powerhouses are present.”<br/><br/>Gu Yang counted and found that, excluding him and Qin Wu, there were as many as nine Celestial Being powerhouses.<br/><br/>It seemed that the Celestial Beings of the Four Great Sacred Lands had all been invited.<br/><br/>He sat in the fifth seat to the left, and Qin Wu behind him occupied the sixth.<br/><br/>It looked like the seating arrangement was determined according to strength.<br/><br/>Among the Three Saints Sect, the most powerful one turned out to be the low-key Qingyu Great Saint; her cultivation level was also the highest among the Celestial Beings present.<br/><br/>The remaining ones at the Unleaking realm could only sit on small stools.<br/><br/>While Gu Yang was observing the others, they were also watching him.<br/><br/>Saint Chaoyang was the first to notice him. Seeing him sitting in the chair, her eyes slightly narrowed, revealing a deep shock.<br/><br/>She knew very well what sitting in a chair represented.<br/><br/>Gu Yang had actually broken through to the Celestial Being realm!<br/><br/>How was that possible so quickly?<br/><br/>It was just over a month since they had parted ways. At that time, he had only just broken through to the Unleaking realm.<br/><br/>Even if the emperor was resurrected, could he have recovered that quickly?<br/><br/>The Red Moon Great Saint and the Qingyu Great Saint next to her both recognized Gu Yang. The shock in their hearts was no less intense than Saint Chaoyang’s.<br/><br/>A cold murderous intent burst forth from the Red Moon Great Saint’s eyes.<br/><br/>The others cast surprised and bewildered glances at Gu Yang.<br/><br/>Clearly, they also knew Gu Yang.<br/><br/>…<br/><br/>“He’s actually a Celestial Being now?”<br/><br/>The Unleaking realm warriors below, seeing Gu Yang sitting together with a group of Celestial Being powerhouses, were utterly shocked.<br/><br/>Anyone with a brain could decipher what that represented.<br/><br/>Moreover, he was seated ahead of Qin Wu!<br/><br/>Did that mean that his strength surpassed Qin Wu’s?<br/><br/>At this moment, the woman in palace attire sitting next to the main seat spoke. “After ten thousand years, the Yaochi Conference is once again held in the Immortal Palace. This is truly joyous and exciting. I hope that everyone will gain something from this banquet.”<br/><br/>PS: It is the seventh day, seeking support via monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}