{"id": 383, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132368.html", "title": "Chapter 383 - Chapter 383: Celestial Being 383", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 383 - Chapter 383: Celestial Being 383</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 383: Celestial Being 383<br/><br/>Shen Yun!<br/><br/>Upon seeing the elderly man who opened the door, Gu Yang almost pulled out the Sword of Human Emperor to stab him.<br/><br/>He had seen the old man once when he last visited. At that time, he didn’t notice anything peculiar.<br/><br/>But this time, he sensed something unusual. His Candle Dragon’s divine power activated on its own, revealing the other’s disguise in an instant.<br/><br/>He was greatly surprised to see the man’s true face.<br/><br/>The old man in front of him was the very patriarch of the Shen Family who he thought he had killed. There was no mistaking the aura emanating from him.<br/><br/>He didn’t die?<br/><br/>That’s not right. He was confirmed dead the last time, and Gu Yang had even received power from it.<br/><br/>Could it be, he resurrected after dying?<br/><br/>Fortunately, Gu Yang knew where he was and refrained from acting rashly.<br/><br/>He had come here seeking assistance. Killing someone at the front door seemed inappropriate.<br/><br/>The old man was indeed Shen Lao, the most seasoned spy of the Red Mansion. With a natural smile on his face, he said, “Mr. Gu, please.”<br/><br/>Seeing him act as if nothing had happened, Gu Yang couldn’t help but ask, “Shen Yun?”<br/><br/>The smile on Shen Lao’s face remained unchanged as he replied, “I haven’t been addressed by that name in a very long time.”<br/><br/>It was indeed him, Shen Yun.<br/><br/>Gu Yang conceived a possibility and queried, “External Incarnation?”<br/><br/>Shen Lao said, “Have you ever heard of a method from the ancient times called Severing the Three Corpses?”<br/><br/>Such a high-level technique.<br/><br/>Gu Yang was shocked. Whether it was External Incarnation or Severing the Three Corpses, these body-division techniques were high-level methods.<br/><br/>Objects like the Dragon Pearl were extremely rare abnormal treasures; even some of the Celestial Immortals in ancient times didn’t necessarily possess them.<br/><br/>Therefore, anyone with an External Incarnation was not ordinary.<br/><br/>You could tell from this just how reversed Su Ningyan’s luck was. She accidentally got hold of this rare treasure of heaven and earth when she was young as well as unintentionally cultivated an External Incarnation.<br/><br/>As for Severing the Three Corpses, it was even more incredible. Only Golden Immortals knew this high-end technique. The so-called “three corpses” referred to one’s own evil thoughts, kind thoughts, and obsessions.<br/><br/>Shen Yun was just at the Unleaking Realm, not even reaching the Human Immortal Realm. Could he have severed the three corpses?<br/><br/>Shen Lao felt Gu Yang’s doubting gaze and responded with a bitter smile, “Back then, after obtaining this technique in the Netherworld, I was determined to escape from Saint ChaoYang of the Trinity Gate. I tried to sever the kind corpse, and unexpectedly, I really did create a separate body, which is myself.”<br/><br/>It must be said, Shen Yun was really bold.<br/><br/>It also showed how desperate he was to shake off Saint ChaoYang.<br/><br/>What was even more surprising was that he had successfully created a separate body. How remarkable!<br/><br/>Gu Yang was genuinely impressed.<br/><br/>It seemed that Shen Yun had encountered the same problem as Su Ningyan. His separate body had developed its own consciousness and the main body had no control over it.<br/><br/>Gu Yang was reminded that creating a separate body at a low realm could easily lead to a loss of control.<br/><br/>Shen Lao reminded him again, “Sir, please enter, the master is waiting for you inside.”<br/><br/>As Gu Yang entered the door, he raised another question, “Knowing about Zhong Zilin’s return, did you just watch the Shen family get annihilated?”<br/><br/>Zhong Zilin, the Unleaking Realm power who returned from the West Bank Continent. His family was exterminated by the Shen Family back then. Now, he’s back for revenge. Shen Yun is dead, and no one in the Shen Family can stop him.<br/><br/>For revenge on family extinction, how could he rest until he had wiped out the Shen Family?<br/><br/>Shen Lao said, “The Shen Family will not perish.”<br/><br/>Such confidence?<br/><br/>Gu Yang was curious but didn’t ask further, and walked into the most famous Red Mansion in the whole of Great Zhou.<br/><br/>The Red Mansion was not listed among the top forces in the Great Zhou, including the Nine Major Clans and Six Major Sects.<br/><br/>But everyone knows that the Red Mansion is the most unique force, occupying an unparalleled status. It is a unique existence.<br/><br/>The kind body that Shen Yun had severed, a powerful Unleaking Realm being, also identified the master of the Red Mansion as his master, in order to take shelter under the protection of the Red Mansion.<br/><br/>It is said that the Red Mansion never interferes in mundane affairs or participates in the conflicts of the martial world, but it does publish various lists.<br/><br/>Because of these lists, countless disputes and vendettas among the common people have been instigated, stirring up conflicts all over the world.<br/><br/>On the other hand, the Red Mansion welcomes martial artists who seek shelter, including Shen Yun-level figures, and it seems not to worry about the Shen family or the Trinity Gate coming after it.<br/><br/>But beyond that, The Red Mansion really never interferes in worldly disputes.<br/><br/>Whether it was the collapse of the Xia Dynasty, the sweeping of the six realms and ruling of the world by Qin Shi, the founder of Qin,<br/><br/>Or Lin Tianyi who used his Celestial Being state to shock the universe, which eventually led to a siege by the world’s powerful, causing the Qin to lose its dominance and the rise of the Great Zhou ancestor…<br/><br/>The Red Mansion’s presence was never seen in these major events in history.<br/><br/>For a thousand years, this red building has stood quietly in a lane in the eastern suburbs of Divine City, observing the changes in history with cold eyes.<br/><br/>No one knows what the mysterious owner of the Red Mansion is actually thinking.<br/><br/>…<br/><br/>This was the second time Gu Yang met the owner of the Red Mansion. He instinctively used the Eye of the Candle Dragon to observe.<br/><br/>Fortunately, there was no disguise on him. This was his real face.<br/><br/>He greeted, “Hello, Master of the Mansion.”<br/><br/>“It’s you again–isn’t it?”<br/><br/>The little girl he had met last time was also there. She was holding a plate of freshly washed fruit. Seeing Gu Yang, she greeted him, then suddenly widened her eyes in shock, as if they were about to fall out.<br/><br/>“Am I seeing things?”<br/><br/>She put down the plate in her hand, came over to Gu Yang, circled around him, and slapped his arm with her little hand. “Unleaking Realm peak! And you said you are not a reincarnation of an ancient power?”<br/><br/>“Enough, you should leave now,” The man in white said.<br/><br/>The little girl reluctantly left, looking back three times with every step she took.<br/><br/>“Sit,” The man in white said to Gu Yang.<br/><br/>In the pavilion, there appeared an extra table with a plate of fruit on it, the same one the little girl had just brought.<br/><br/>After a breakthrough in his cultivation realm, Gu Yang suddenly found himself treated differently. Even in the Red Mansion, he was now accorded the highest respect.<br/><br/>He directly asked, “How can I find out the location of the Xia Emperor’s body?”<br/><br/>The white-robed man, who seemed to already know his question, gave the answer directly, “In the realm of Peach Blossom Heaven.”<br/><br/>It was actually with the Three-Saint Sect.<br/><br/>This answer was somewhat unexpected to him.<br/><br/>He originally thought that it should be in the realm of Scarlet Bright Heaven. He didn’t expect that it had been moved by the Three-Saint Sect.<br/><br/>Thankfully he asked at the Red Mansion.<br/><br/>“Does elder have any instructions?”<br/><br/>As per the old rule, an exchange of information would require a condition.<br/><br/>The white-robed man took a green fruit into his mouth, saying, “Stay alive.”<br/><br/>What sort of condition was that?<br/><br/>Gu Yang quickly understood after a moment of surprise. He was referring to the imminent Yaochi Conference.<br/><br/>“Alright.”<br/><br/>The white-robed man went on, “This is a fruit borne from a fruit tree planted in the courtyard. Try it.”<br/><br/>“Thank you.”<br/><br/>Gu Yang took a fruit and chewed on it. It was a bit sour, but very tasty.<br/><br/>After eating a fruit, he asked, “Does elder know who is the person beneath the Imperial Palace?”<br/><br/>“A pitiful man.”<br/><br/>Gu Yang understood and didn’t ask any further.<br/><br/>By responding in such a manner, he was trying to avoid disclosing too much.<br/><br/>In a short while, the two of them finished a plate of fruit.<br/><br/>Gu Yang then took his leave.<br/><br/>…<br/><br/>…<br/><br/>After Gu Yang left Divine City, there are still four days left until the Yaochi Conference.<br/><br/>He activated the simulation function in the system.<br/><br/>“Twenty-three years old…”<br/><br/>“…you head on to the Golden Court Hollow Void, assist the country lord in reaching the Hollow Void realm. You cultivated religiously in the Golden Court Hollow for ten years and then the entrance was broken and a mysterious creature of the Hollow Void realm attacked…”<br/><br/>“…Eventually died at thirty-eight years old.”<br/><br/>This time, Gu Yang chose Golden Court Hollow.<br/><br/>In reality, his options were limited.<br/><br/>If he didn’t attend the Yaochi Conference, he would face two difficulties. One was being pursued by a Jade Dew Divine Soldier.<br/><br/>The second difficulty involved the Celestial Beings of the Yaochi Immortal Palace infiltrating everywhere. No Hollow Void world would be spared.<br/><br/>Not many Hollow Void worlds could resist; one was Golden Court Hollow, and another one was the large continent of Ruiqin, also called Penglai Heaven.<br/><br/>However, the level of Golden Court Hollow was lower than Penglai Heaven, so it was his only choice.<br/><br/>“Simulation ends, you can keep one of the following items.”<br/><br/>“One, the Martial Arts realm at age thirty-eight.”<br/><br/>“Two, the Martial Arts experience at age thirty-eight.”<br/><br/>“Three, the wisdom of life at age thirty-eight.”<br/><br/>“I choose the second option.”<br/><br/>Suddenly, Gu Yang felt that his mind gained some profound comprehension that couldn’t be described by words.<br/><br/>He felt joy for the comprehension of the Dao. Although it was very shallow, it was a good start.<br/><br/>Any progress is always a good thing.<br/><br/>“Again.”<br/><br/>…<br/><br/>Once Gu Yang found the correct way, he started the simulations over and over again.<br/><br/>He had a total of 25,300 energy points, an unprecedented amount, which allowed him to run fifty simulations.<br/><br/>For the next four days, he did nothing but ran ten simulations a day.<br/><br/>Gradually, the Dao he had comprehended began to form.<br/><br/>A single simulation was equivalent to fifteen years of cultivation. Ten times would be 150 years.<br/><br/>During these four days, he ran forty simulations, which was equivalent to exactly 600 years of time.<br/><br/>Just like a river channeling into the sea, at the Yaochi Conference, during the 40th simulation, he saw a prompt saying, “… you suddenly gained enlightenment, you began to condense the Immortal Element and stepped into the Celestial Being realm….”<br/><br/>Finally, he had become a Celestial Being!<br/><br/>Gu Yang felt a mix of emotions.<br/><br/>After transmigrating until now, a little over three years, he had finally grown from an ordinary person to becoming one of the pinnacle powerhouses in this world.<br/><br/>“Simulation ends, you can keep one of the following items.”<br/><br/>“One, the Martial Arts realm at age forty.”<br/><br/>“Two, the Martial Arts experience at age forty.”<br/><br/>“Three, the wisdom of life at age forty.”<br/><br/>“I choose the first option.”<br/><br/>Suddenly, the wind and clouds stirred, and the colors in the sky changed.<br/><br/>In Gu Yang’s body, a surge of indescribable power was about to erupt.<br/><br/>Apparently sensing the power within his body, a streak of blood-red color appeared in the sky, as if blood was dripping down.<br/><br/>Ps: Please give monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}