{"id": 386, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132373.html", "title": "Chapter 386 - Chapter 386: The Truth About The Yaochi Conference In 386", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 386 - Chapter 386: The Truth About The Yaochi Conference In 386</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 386: The Truth About the Yaochi Conference in 386<br/><br/>“Celestial Being!”<br/><br/>Feeling the terrifying momentum erupting from Qin Wu’s body, Chu Hongxiu’s heart starts throbbing uncontrollably. This is the pressure that can only be felt when facing a Celestial Being.<br/><br/>Her heart keeps sinking lower and lower.<br/><br/>A member of the Qin family has actually broken through to the Celestial Being realm!<br/><br/>Even though she knew that this day would come sooner or later, she didn’t expect it to arrive so quickly.<br/><br/>Finally, she now understands why Qin was willing to return the Bright Moon Sabre to the Chu family — he no longer needed it.<br/><br/>Chu Hongxiu, among the founders of the ten families, was the only woman, an extraordinary figure often treated as a role model for women all over the world.<br/><br/>She was always extremely prideful, never paying any heed to the men of the world.<br/><br/>Of the eight families that also held great fame alongside her, the only two she acknowledged were the Chen family and Lin family. The rest were all mediocre; simply lackeys of the Three Saints Gate and Red Bright Heaven.<br/><br/>That was, until Qin Wu came out of nowhere, undefeated, and crushed her pride into dust.<br/><br/>At the time of their battle, her cultivation level had been above Qin Wu’s.<br/><br/>However, when they clashed, she was utterly defeated. His direct counter destroyed her proudest saber technique and he took the Bright Moon Sabre from her. It was an absolute defeat.<br/><br/>At that moment, the tip of his sword was just inches from her head, but then he suddenly stopped.<br/><br/>He did not kill her and he just left, not even a single word left behind.<br/><br/>This kind of indifference was even more painful for her than death.<br/><br/>For four hundred years, she continually relived every detail of that battle, pondering over and over again about how she could defeat this man…<br/><br/>Obsession of several hundred years can be quite frightening.<br/><br/>Especially the obsession of a strong Unleaking Realm cultivator. Moreover, that obsession belongs to a woman.<br/><br/>She indeed found a way to suppress Qin Wu, but she still lacked one crucial thing — pure strength!<br/><br/>After losing the Bright Moon Sabre, she had been stagnating for the past several hundred years.<br/><br/>But her arch-enemy was continuously progressing. Although he hadn’t battled anyone since their battle, she knew that with his talent, he certainly wouldn’t have made slow progress.<br/><br/>But as long as Qin hadn’t reached the Celestial Being realm, there was still hope for her to seek revenge.<br/><br/>When the Qin family returned the Bright Moon Sabre as a betrothal gift, Chu Hongxiu felt ecstatic. This was her hope for revenge.<br/><br/>However, that damn bastard Gu Yang broke into the Chu Family and snatched the Bright Moon Sabre from her, smothering her sole hope for revenge.<br/><br/>Now, both of her enemies have appeared in front of her, and she was overwhelmed by an unprecedented sense of powerlessness.<br/><br/>One easily defeated her four hundred years ago, taking the Bright Moon Sabre and crushing her pride and confidence.<br/><br/>The other one broke into the Chu Family recently, casually taking the Bright Moon Sabre from her in front of all the clan members, trampling her and Chu Family’s dignity into the dirt.<br/><br/>It is hard to say which of them Chu Hongxiu hates more.<br/><br/>Now, her old enemy, Qin Wu, displayed his celestial power in front of her, extinguishing her last glimmer of hope for revenge.<br/><br/>“Do you want to seek revenge?”<br/><br/>Just as she sank into the most profound despair, a voice echoed in her heart.<br/><br/>Revenge?<br/><br/>In the depths of her heart, a tiny flame of hope sprang to life.<br/><br/>“Of course!”<br/><br/>The only reason she kept holding on was to seek revenge!<br/><br/>For revenge, she would do everything in her power.<br/><br/>Not long ago, she was hurt by Gu Yang and fell into a state of exhaustion. Just when her life was hanging by a thread, she consumed the ‘Life-Renewing Heavenly Pill’ that Chu Xiyue had presented to her in order to survive.<br/><br/>Although Xiyue had warned her that there might be a problem with the pill, possibly containing the Original Spirit of an ancient power, she didn’t have the luxury of paying heed to that. If she had died, she wouldn’t have been able to take revenge, and the Chu family would have been done for.<br/><br/>“I can help you.”<br/><br/>The voice in Chu Hongxiu’s heart sounded again, clearer this time.<br/><br/>…<br/><br/>The other people in the arena who were watching Qin Wu, who looked like a god descending to earth, all looked complicated.<br/><br/>After the Xia dynasty, Great Zhou finally welcomed its fourth Celestial Being.<br/><br/>It didn’t surprise anyone. Given Qin Wu’s talent, as long as he didn’t die, he was bound to become a Celestial Being sooner or later.<br/><br/>If even he couldn’t advance to the Celestial Being realm, then there was no hope for the others.<br/><br/>But even so, actually seeing him take that step filled them with awe.<br/><br/>He was now a Celestial Being. Taking this step marked his ascent to the Immortal Rank. In ancient times, he would have joined the ranks of the immortals, with a destiny separate from ordinary beings.<br/><br/>This was the ultimate state that every martial artist yearned for.<br/><br/>But very few could reach this state. For the past thousand years, only four people, including the Qin dynasty and Great Zhou, have managed this.<br/><br/>…<br/><br/>“Qin Wu!”<br/><br/>Gu Yang looked at the man standing in front of him, clad in a purple robe, who possessed the air of a noble dignitary, thereby guessing his identity. He scrutinized him intently.<br/><br/>The legend surrounding this man had been circulating in the Great Zhou for hundreds of years. His deeds became almost mythical.<br/><br/>Based on his combat record, he was akin to the protagonist of the previous era who had countered the entire Great Zhou alone; even Luo Wang, the Celestial Being, hadn’t been able to defeat him.<br/><br/>Previously, when Gu Yang was preparing to kidnap a bride, he had marshaled all his resources but had only managed to draw with him.<br/><br/>Moreover, it was hard to tell exactly how much strength he had actually used at that time.<br/><br/>Given that he was able to escape unscathed from a fight with a Celestial Being, he must certainly have some formidable trump cards up his sleeve.<br/><br/>What Gu Yang found even more intriguing was – which Dongtian world was this man able to achieve the Celestial Being status in?<br/><br/>Given their current relationship, it would be inappropriate to ask him directly.<br/><br/>“You——”<br/><br/>“Stop!”<br/><br/>Just then, two figures approached, riding on the waves. They were the Jade Dew Divine General and Master Sichen, who had handed out the invitations. Even before they arrived, their voices calling for a cessation of the impending battle could be heard.<br/><br/>The Jade Dew Divine General said, “If you two have any grudges, why not settle them at the Yaochi Conference? How about it?”<br/><br/>Qin Wu’s gaze swept past the Jade Dew Divine General and Master Sichen, eventually sheathing his sword, and with it, his astonishing aura.<br/><br/>Gu Yang was rather disheartened. He was initially hoping to have a wager with Qin Wu which might reveal a new entrance to a Dongtian World.<br/><br/>…<br/><br/>After the Jade Dew Divine General had resolved the discord between the two, he looked towards everyone present, feeling a bit strange. In ancient times, those who could attend the Yaochi Conference were all exceptional geniuses, including those at the level of Golden Immortals.<br/><br/>Young disciples of the major forces in the Human Realm and Thirty-three Heavens, all deemed the invitation to the Yaochi Conference as an honor.<br/><br/>Who could have imagined that now, even those in the early stages of the Nascent Soul could participate in the Yaochi Conference?<br/><br/>Sincerely, fate makes fools of the people!<br/><br/>If it were not to meet the required numbers, these people would not have been eligible to enter the Immortal Palace.<br/><br/>Controlling his emotions, the Jade Dew Divine General said, “Ladies and Gentlemen, welcome to the Yaochi Conference. Everyone is here, so let me lead you to Yao Chi.”<br/><br/>“Wait a moment.”<br/><br/>Suddenly, someone interrupted.<br/><br/>Gu Yang turned towards the voice, recognizing the speaker as Cao Jing, of the Cao Family – an Unleaking Realm powerhouse, “May I ask your eminence, the purpose of the Yaochi Conference through this invitation, could you please clear my doubts?”<br/><br/>This was a question that many people had in their minds, even if he hadn’t asked, someone else surely would have.<br/><br/>The Jade Dew Divine General scanned the crowd and commented, “Our Yao Chi Immortal Palace holds the Yaochi Conference once every 500 years. We invite the world’s most outstanding cultivators to sit and discuss the Great Dao, enrich each other’s knowledge, and collectively explore the Great Dao. You are all outstanding characters in today’s world.”<br/><br/>Upon hearing his words, Gu Yang almost burst into laughter. Was he trying to deceive a ghost with that statement?<br/><br/>Indeed, everyone present was among the top individuals in the world today. But from the Yao Chi Immortal Palace’s point of view, what aspects of their shallow martial arts could grab their attention?<br/><br/>Given the existence of these two, who were no doubt of Immortal Rank in the ancient times, they must have experienced a descent in realm post-awakening. Having Cultivation Level at the Celestial Being realm proves that they have already comprehended the current worldly laws.<br/><br/>Their martial arts had no value to the Yao Chi Immortal Palace.<br/><br/>It was as ludicrous as a top-ranked university inviting primary school students to deliver a lecture.<br/><br/>Only a fool would believe it.<br/><br/>As for the old bunch at the Unleaking Realm, wasn’t each of them several hundred years old? Being extremely shrewd due to their age, naturally they wouldn’t believe such nonsense voiced by the Jade Dew Divine General.<br/><br/>At this point, it was Li Yuan, the elder brother at the literary academy, who spoke up, “His eminence is indeed correct. According to several ancient books, Yao Chi Immortal Palace has such a tradition. Every five hundred years, the Yaochi Conference is held. Receiving an invitation to this conference is a great honor for any cultivator. However——”<br/><br/>Li Yuan’s gaze became sharper, “His eminence omitted the most important part that anyone participating in the Yaochi Conference is awarded a celestial peach. Those who perform well during the conference might even receive rewards from the Palace Master.”<br/><br/>“I wonder, do we attending the Yaochi Conference also get awarded a celestial peach?”<br/><br/>As soon as he finished, those present were already murmuring amongst themselves.<br/><br/>The fame of the celestial peach was too grand, one of the legendary heavenly treasures passed down from the ancestors. It was said that eating one could prolong life by a thousand years, while finishing an entire peach could lead to instant immortality.<br/><br/>These were records in some ancient books. Even if the effects of the celestial peach were slightly exaggerated, as long as it had the function of prolonging life, it held a lethal attraction to them.<br/><br/>Every martial artist in the Unleaking Realm suffered from longevity anxiety; items that could increase lifespan were instinctively coveted.<br/><br/>…<br/><br/>Gu Yang noticed that upon hearing Li Yuan’s words, the gaze of the Jade Dew Divine General underwent a slight change. Gu Yang deduced that Li Yuan must have hit the nail right on the head.<br/><br/>Celestial peach!<br/><br/>So, that’s how it is.<br/><br/>He had a bold guess in his heart. With this deduction, it all made sense.<br/><br/>Just then, he noticed an additional figure standing next to him, greatly surprising him.<br/><br/>Who could the one be who had managed to approach him without his notice?<br/><br/>Startled, he almost unsheathed the Emperor’s sword, but when he turned around, he saw a familiar figure, which made him simultaneously shock and joyful.<br/><br/>The person standing behind him was the mysterious old man he had encountered at both the Dragon Gate Island and Yellow Springs Dongtian.<br/><br/>So, he had come as well!<br/><br/>PS: I need monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}