{"id": 384, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132369.html", "title": "Chapter 384 - Chapter 384: Trace Of 384 Days", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 384 - Chapter 384: Trace Of 384 Days</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 384: Trace of 384 Days<br/><br/>“So that’s how it is!”<br/><br/>After Gu Yang took that step, he finally understood the meaning represented by the two words “Celestial Being”.<br/><br/>A Celestial Being is about making oneself like heaven. The type of “Dao” one can condense depends entirely on the foundation laid beforehand.<br/><br/>You must grasp some of the underlying logics of this world, use these logics to remodel yourself, and form a new mechanism that can generate a higher-level power, Immortal Element.<br/><br/>Since this world no longer has the Way of Heaven, I will create my own Way of Heaven within my body.<br/><br/>Just like what the mummy under the imperial palace said, this is akin to the cultivation mechanism of ancient divine beasts.<br/><br/>Inside the ancient divine beasts, the rules of the Way of Heaven are naturally contained, and their manifestation is Divine Power.<br/><br/>The key to condense the Immortal Element is the Original Spirit. Attuning the Original Spirit with Dao during enlightenment creates a core within the Original Spirit over time.<br/><br/>This core is a seed of power, which can also be said to be a personal understanding of Dao.<br/><br/>With this, mana can be metamorphosed and transformed into the Immortal Element.<br/><br/>The emergence of the Immortal Element signifies that he has stepped into the realm of the Celestial Being.<br/><br/>Under the transformation of the Immortal Element, the body will gradually undergo a transformation and cultivate the body of a Human Immortal. From then on, the constraints of this heaven and earth are broken, and you possess a much longer lifespan.<br/><br/>The biggest difference between the body of a Human Immortal and the Unleaking body is that it can use the power seed as the core, reabsorb the Vitality of heaven and earth for its own use, and no longer consumes its own origin.<br/><br/>Gu Yang could clearly feel a “core” within the Original Spirit, slowly digesting the Vitality of heaven and earth and transforming it into the Immortal Element.<br/><br/>However, the process was so slow that it was maddening. Ten thousand units of heaven and earth’s Vitality might not be enough to refine a unit of the Immortal Element.<br/><br/>No wonder Celestial Beings rarely use their power throughout history. Every time they use their power, the consumed Immortal Element would probably take several years to recover.<br/><br/>Once the Immortal Element is exhausted, it will fall back into the old path of the Unleaking Realm, needing to consume one’s own origin in order to transform into the Immortal Element. This is truly risking one’s life.<br/><br/>This world is really tough for Celestial Beings.<br/><br/>Typically, a newly advanced Celestial Being needs some time to transform all the mana in the body into the Immortal Element, at least one or two months.<br/><br/>Thankfully, he had already completed this process in Simulation. Now, he has the fighting strength of a Celestial Being.<br/><br/>Next is the continual accumulation.<br/><br/>While constantly perfecting his own Dao, perfecting the body of the Human Immortal, and storing the power of the Immortal Element.<br/><br/>Now, he can only be considered the first stage of a Celestial Being. It is not until he truly cultivates into a Human Immortal that he reaches the second stage.<br/><br/>The master of Water Moon Sect whom he met in the Water Moon Hollow Heaven, Fu Wansheng, was at this realm.<br/><br/>After understanding his physical state, Gu Yang took a deep breath and nervously opened the system.<br/><br/>“Do you want to use the Life Simulator? Each use consumes a piece of fragment.”<br/><br/>It’s changed again.<br/><br/>He sighed.<br/><br/>When he broke through from the Mortal Realm to the Divine Power Realm, the simulation started consuming energy instead of money.<br/><br/>He has guessed that after breaking through to the Celestial Being, the required item will change again.<br/><br/>He was not sure what these fragments were.<br/><br/>Then a hint popped up before his eyes, “Current fragment count: Five.”<br/><br/>Huh?<br/><br/>He was suddenly ecstatic. There were still five fragments in the system.<br/><br/>Where did they come from?<br/><br/>Could it be the remaining energy that had transformed into fragments?<br/><br/>Soon, he rejected this idea. It was not very likely.<br/><br/>If energy could be transformed into fragments, why make another move?<br/><br/>Wouldn’t it be easier to keep using energy?<br/><br/>Gu Yang didn’t waste much thought on this matter. Eventually, he would know.<br/><br/>Now, the most important thing is to continue improving his own strength to deal with the upcoming dangers.<br/><br/>“Yes.”<br/><br/>“Twenty-three years old…”<br/><br/>“…you go to Golden Court Hollow Heaven and cooperate with the master of Golden Court to kill the other two masters and help him achieve the Hollow Void realm…”<br/><br/>“…Passed away at the age of fifty.”<br/><br/>Fifty years old!<br/><br/>After Gu Yang finished reading, he was overjoyed.<br/><br/>After reaching the Celestial Being Realm, he finally had enough strength to break the original death situation and extend his lifespan to fifty years.<br/><br/>This means that if he follows the trajectory of the simulation, he can live until fifty years old. It’s almost doubled compared to before.<br/><br/>“The simulation is over, you can retain one of the following.”<br/><br/>“One, the Martial Arts Realm at the age of fifty.”<br/><br/>“Two, the Martial Arts experience at the age of fifty.”<br/><br/>“Three, the wisdom of life at the age of fifty.”<br/><br/>“I choose number one.”<br/><br/>Immediately, Gu Yang felt a significant increase in the Immortal Element within his body and doubled it in an instant.<br/><br/>The “core” within the Original Spirit also underwent a noticeable change, becoming larger and more profound, embodying an unknowable power.<br/><br/>Even the mortal body experienced some mysterious changes.<br/><br/>He had already exploited the potential of his mortal body to the extreme, but this time the transformations were at the very source. His cells underwent an essential change.<br/><br/>This sensation was like that of evolution, turning oneself into a higher level creature.<br/><br/>After the evolution, the cells have stronger vitality, tougher structure, and can contain more Immortal Element…<br/><br/>This is a comprehensive enhancement.<br/><br/>“So this is what a Human Immortal is!”<br/><br/>Gu Yang was somewhat shocked. In just a short period of time, his strength underwent earth-shaking changes.<br/><br/>Compared to the Unleaking Realm, it was simply not on the same level.<br/><br/>This time, he had only been cultivating in the simulation for twenty-eight years.<br/><br/>But, the progress attained in these twenty-eight years surpassed the sum of his previous cultivation experiences.<br/><br/>It should be noted that, before this, he had conservatively estimated that he had been cultivating in the simulation for more than two thousand years.<br/><br/>He finally understood what it meant to distinguish between the celestial and the mundane.<br/><br/>This was barely the first realm of the Human Immortal, so just how powerful would Earth Immortals and Celestial Immortals become?<br/><br/>What kind of catastrophe could cause the downfall of all immortals?<br/><br/>Gu Yang’s realm had basically reached the ceiling of this world, and he couldn’t help but ponder these questions.<br/><br/>What was the truth behind the catastrophe of ten thousand years ago?<br/><br/>How did the Way of Heaven die?<br/><br/>…<br/><br/>Gu Yang quickly retracted his thoughts. The answers to these questions would eventually be revealed.<br/><br/>Perhaps the mysterious master from the palace underground or the Red Mansion knew the truth.<br/><br/>He would ask them after overcoming this stage.<br/><br/>At this moment, he finally opened his eyes. What appeared in his vision was a sky seemingly stained with blood, at the center of which was an unfathomably deep, crimson void.<br/><br/>It was as if a piece of the sky had been torn off and was continuously bleeding.<br/><br/>“What is—”<br/><br/>Gazing at this bizarre scene, a shock surged in Gu Yang’s heart.<br/><br/>…<br/><br/>……<br/><br/>Just as Gu Yang broke through to the Celestial Being realm, every part of this world—countless continents, islands…<br/><br/>All the people could see a blood-stained sky when they looked up.<br/><br/>A sense of panic began to spread among the crowd as countless people were watching this sky.<br/><br/>Many ordinary people even believed that this was the fury of celestial gods about to bring disaster, and many of them knelt on the ground and prayed towards the sky.<br/><br/>Martial artists of Great Zhou and cultivators from other continents, witnessing this uncanny celestial phenomenon, felt their hearts palpitate with fear, as if a great disaster was imminent.<br/><br/>Moreover, the higher one’s cultivation level, the clearer this feeling became.<br/><br/>Some cultivators with an unstable Daoist Heart collapsed on the spot and entered a demonized cultivation state as they watched the blood color in the sky intensifying.<br/><br/>…<br/><br/>Tianxin Martial Academy<br/><br/>The still-cultivating-in-closed-off Cheng Tianxin felt a sudden shock in his heart, as if a disaster was about to occur. Unable to sit still, he broke his cultivation and came out.<br/><br/>Outside, he saw the blood-stained sky and the shocking “wound.” His shock was beyond description.<br/><br/>“Ma…Master!”<br/><br/>The disciples of the academy, all of them plunged in panic, flocked around him as if seeing their mainstay.<br/><br/>“What has happened?”<br/><br/>“Is the sky going to collapse?”<br/><br/>“…”<br/><br/>…<br/><br/>Seeing the disciples in disarray and panic-stricken, Cheng Tianxin shouted loudly, “Quiet down, the sky is not going to collapse! What do you think you look like?”<br/><br/>His stern reprimand finally calmed the disciples somewhat, and they stopped panicking. However, they all crowded around him, not daring to leave.<br/><br/>Among the many disciples present, the calmest was ironically the youngest, Cheng Qingyu. Held tightly by her sister-in-law Cheng Xue, she could feel her sister-in-law’s body tremble uncontrollably. She was the one patting her sister’s back.<br/><br/>She whispered comfortingly, “Don’t be afraid, we have Brother Gu Yang.”<br/><br/>Her voice was soft, but all the present martial artists of the sixth grade or higher, with their sharp hearing, heard her words clearly.<br/><br/>The name Gu Yang was like magic, and many people’s eyes were filled with hope.<br/><br/>Cheng Xue, who had been trembling just a moment ago, had also relaxed now.<br/><br/>Suddenly, a weak voice said, “But, where is Young Master Gu right now?”<br/><br/>One sentence shattered the calm atmosphere.<br/><br/>Yes, where was Gu Yang right now?<br/><br/>…<br/><br/>……<br/><br/>“Ha ha … Finally, I am free!”<br/><br/>Gao Fan walked out of the Star Picking Pavilion, stood at the entrance, and burst into laughter, laughing so hard that he was almost in tears.<br/><br/>For hundreds of years, he was trapped by his own practice and was forced to seal his cultivation level.<br/><br/>He had been sealed off for more than a hundred years.<br/><br/>For more than a hundred years, to escape his family’s pursuit and hide from Lord Chi Ming, he hid here and there. A formidable Unleaking Realm cultivator was forced to live under a pseudonym, mingling among the common folk. He tasted all kinds of life’s bitterness.<br/><br/>Sometimes, even if he was being oppressed, he could only restrain himself and not fight back.<br/><br/>He, once a pampered offspring of a wealthy family, was forced to become a penny-pinching old man well-versed in the ways of the world.<br/><br/>All of this was finally over.<br/><br/>He had escaped the fate of his family’s nightmare and could now openly display his cultivation level without worrying about losing control of his body someday.<br/><br/>While Gao Fan was laughing uproariously, he suddenly felt a turmoil in his vital energy and was on the verge of entering a demonized cultivation state.<br/><br/>“What is… that?”<br/><br/>He looked up and saw that bloody mark in the sky. Just one glance made him feel as if his Original Spirit was about to be extracted.<br/><br/>He was alarmed and quickly stabilized his Original Spirit by using his practices.<br/><br/>At that moment, another person appeared next to him. It was the dean in green clothes. He looked grave as he stared at the bloody mark in the sky, holding a sword in his hand and preparing for a face-off.<br/><br/>PS: Asking for your monthly vote of support, we got exploded.\t\t\t\t\t\t</div>", "images": {}, "success": true}