{"id": 382, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132365.html", "title": "Chapter 382 - Chapter 382: 382 The Path Of Celestial Being (Request For Monthly Tickets)", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 382 - Chapter 382: 382 The Path Of Celestial Being (Request For Monthly Tickets)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 382: 382 The Path of Celestial Being (Request for Monthly Tickets)<br/><br/>“…The palace maiden chose death over submission, committing suicide on the spot. Subsequently, all the maidens woke up together. Before you could react, they triggered a powerful prohibition, resulting in your immediate death at the age of twenty-three.]<br/><br/>Such an unexpected mishap.<br/><br/>Five hundred energy points!<br/><br/>Gu Yang felt somewhat pained. After all, eliminating a third-level Unleaking Realm took only 500 energy points.<br/><br/>In today’s Great Zhou, practitioners at this level could be counted with just two hands.<br/><br/>It could only be said that in places like Yao Chi Immortal Palace, every attempt comes with risks.<br/><br/>His natural inclination was to gather intelligence from the palace maidens, and he didn’t have to think it through consciously. As a result, that’s exactly what he did during the simulation.<br/><br/>However, such attempts provide valuable insights.<br/><br/>At least it shows one thing: the palace maidens are fiercely loyal to Yao Chi Immortal Palace. Forcing them to reveal information seems nearly impossible.<br/><br/>After summarizing his experiences, Gu Yang prepared for the second simulation.<br/><br/>Since he knew that Yao Chi was among the thirty-three heavens and was second only to the three heavenly worlds, he was interested in advancing there.<br/><br/>According to the previous simulation, if he triggered the prohibition of Yao Chi Immortal Palace, he would be trapped inside for many years, given that he doesn’t make a misstep.<br/><br/>Inside, there would be plenty of time to comprehend the Way of Heaven in that place.<br/><br/>As the principal stated, the key to achieving the Celestial Being realm lies in finding a Way of Heaven that matches one’s attributes and comprehending the profound truth within it.<br/><br/>As for what is the profound truth, it is mysterious and can’t be accurately described in words; it needs to be understood personally.<br/><br/>Take Gu Yang for example, he has been practicing the Phoenix Dance Nine Heavens, a fire-attributed method. Therefore, he’s required to seek a fire-related Way of Heaven.<br/><br/>Comparatively, the “Nine Heavens Divine Method” is indeed ingenious.<br/><br/>This method doesn’t require the comprehension of the Way of Heaven. Ancient divine beasts naturally formed their world. As long as they keep growing, a complete Way of Heaven law will be produced inside them.<br/><br/>All that’s needed is an adequate amount of essence blood. Once accumulated to a certain degree, the individual would naturally begin to comprehend the law of their bloodline and break through on their own.<br/><br/>From this, one can see how blessed these ancient divine beasts are compared to humans, their starting point is innumerable times higher.<br/><br/>However, given that divine creatures are naturally stronger than humans, is it really possible to control multiple beasts simultaneously with this method?<br/><br/>Among them are divine beasts from the ancient age, and there are nine different types.<br/><br/>These include the phoenix, the sovereign of ancient times, and Taiyin Youying, the once highest deity of West Bank Continent.<br/><br/>Controlling nine beings of such natures all at once sounds rather unrealistic.<br/><br/>He was doubtful that once the clones of these divine beasts reached a certain realm, they might regain consciousness, awaken their self-awareness and instead consume his original spirit.<br/><br/>After obtaining the “Taixuan Heavenly Book”, Gu Yang had a deeper understanding of the way of cultivation in ancient times, and he grew more in awe of the system of cultivation from the ancient era.<br/><br/>The “Nine Heavens Divine Method” is indeed mysterious and complex. Many of its contents are beyond the imagination of a typical cultivator at the realm of Celestial Being, based on his current insights.<br/><br/>The creator of this method must have been a powerful figure from the ancient era.<br/><br/>The most valuable parts are surprisingly the God Refining Chapter and the Deity Commanding Chapter, which appear the least noteworthy.<br/><br/>The God Refining Chapter provides a way to refine the Original Spirit. Even in the “Taixuan Heavenly Book”, there is no better way to cultivate the Original Spirit.<br/><br/>The Deity Commanding Chapter is even more remarkable; it can divide the spirit into nine parts.<br/><br/>In the “Taixuan Heavenly Book”, the most advanced technique of dividing one’s spirit only allows for the creation of three divisions.<br/><br/>The creator of the “Nine Heavens Divine Method” cannot be an ordinary being.<br/><br/>He thought of the corpse below the palace. Perhaps, it was a significant figure in the ancient times.<br/><br/>….<br/><br/>Since Gu Yang recognized the potential danger of this method, he naturally will not rush to elevate those divine beasts to the realm of Celestial Beings.<br/><br/>It’s best to elevate his own cultivation first.<br/><br/>[Will you use the life simulator? Using it once will consume five hundred energy points.]<br/><br/>“Yes.”<br/><br/>[Twenty-three years old…]<br/><br/>[…You are trapped in Yao Chi Immortal Palace, cultivating bitterly for ten years…]<br/><br/>[…At the age of thirty-five years.]<br/><br/>Indeed, as long as he doesn’t stir up any trouble, he can safely linger in Yao Chi Immortal Palace for over ten years.<br/><br/>[The simulation ends…]<br/><br/>[…]<br/><br/>“I choose choice two.”<br/><br/>After making his choice, Gu Yang felt something was amiss shortly.<br/><br/>“Why isn’t it here?”<br/><br/>In his martial arts experience and comprehension, there is no trace of the profound truth, not even a bit.<br/><br/>“Impossible.”<br/><br/>Is his aptitude so bad?<br/><br/>He got nothing out of ten years!<br/><br/>There must be a problem somewhere.<br/><br/>He wasted another chance for simulation, which hurts him greatly.<br/><br/>Maybe Yao Chi Immortal Palace is not suitable for comprehension.<br/><br/>Maybe Yao Chi Immortal Palace is not a whole immortal world as he expected.<br/><br/>Gu Yang shook his head, “It seems that self-exploration is too inefficient. I need to ask others for help.”<br/><br/>In cultivation, in addition to theoretical support, experience is also needed.<br/><br/>The former is the Way, the latter is the method, and neither can be neglected.<br/><br/>As for whom to consult, he already has a target in mind.<br/><br/>Having thought that far, he turned around and flew back to Divine City.<br/><br/>…<br/><br/>……<br/><br/>The royal palace, the same well.<br/><br/>Gu Yang decided to consult the corpse beneath the earth.<br/><br/>Despite the dubious intentions, he could not find any other suitable person.<br/><br/>Even just asking would be a good reference.<br/><br/>At this point, he especially missed the mysterious elder he had encountered in Dragon Gate Island and Yellow Springs Cave. Although the elder was also mysterious in origin and had an unfathomable realm, he was far friendlier.<br/><br/>While Gu Yang was thinking, he arrived at the bottom of the earth.<br/><br/>Without Su Ningyan’s summoning, the corpse under Jiuding drilled out from the earth, his eyes twinkling with two ghostly lights, staring straight at him, and said in a hoarse, unpleasant voice, “We meet again, youngster.”<br/><br/>Out of courtesy, Gu Yang bowed, “Greetings to my senior.”<br/><br/>“I didn’t think I would miscalculate. Your progress is so fast that I thought my sense of time was off.”<br/><br/>“Senior is flattering me, I’m here today to ask about matters regarding the realm of Celestial Being.”<br/><br/>“Celestial Being…”<br/><br/>The corpse’s mouth cracked open, seemingly laughing silently.<br/><br/>“Why would the elder laugh?”<br/><br/>“The so-called Celestial Being is actually imitating the Monster Race, that is, the cultivation method of Divine Beasts. The best method is the ‘Nine Heavens Divine Method’.”<br/><br/>Gu Yang shook his head and said, “It is required to transform a massive amount of Divine Beast’s Essence Blood into a Celestial Being. This kind of thing is rare.”<br/><br/>“This monk knows a place where you can find what you need.”<br/><br/>“Please enlighten me, elder.”<br/><br/>“After Xia Emperor’s death, his body was left behind, containing Essence Blood of every kind.”<br/><br/>Xia Emperor’s body?<br/><br/>Gu Yang hadn’t really thought about this. Indeed, Xia Emperor was a Celestial Being at its peak and it was said that he had cultivated nine Divine Beasts into Celestial Beings. If he could get his hands on his body, he might be able to extract some Essence Blood.<br/><br/>Even if he couldn’t extract it, the body of a Celestial Being is not lacking in energy.<br/><br/>He asked, “Does the elder know where his body is?”<br/><br/>“I don’t know.”<br/><br/>“…” Gu Yang still expressed his gratitude, “Thanks for reminding me, elder.”<br/><br/>He might not know, but he can find someone who does, like the Red Mansion’s master.<br/><br/>“This is a free tip. If you want to know more, you have to pay a fee.”<br/><br/>Without any hesitation, Gu Yang released a Divine Beast spirit and inserted it into the giant Nine God Cauldron, then asked, “In my situation, which level of the Immortal Realm should I go to understand the Way of Heaven?”<br/><br/>“Immortal Realm?”<br/><br/>The mummified voice became lower, “What Immortal Realm is left now? All that’s left is ruins.”<br/><br/>After a pause, it continued, “The so-called thirty-three heavens are divided into levels because of the differences in the laws of the Way of Heaven. The laws of the Heaven Realm have the lowest limit and can only be cultivated to the Golden Immortal Realm.”<br/><br/>“Then there are the myriad heavens, which can achieve Da Luo. Going above, it can be called a real Immortal realm, which can prove the mixed element.”<br/><br/>Seeing that it didn’t continue, Gu Yang asked curiously, “How about the three highest heavens, what realm can they reach?”<br/><br/>“I don’t know,” said the mummified corpse. “Before the disaster came, no one had stepped out yet.”<br/><br/>“Oh, elder continue.”<br/><br/>“After hearing this, don’t you feel that the higher the world’s grade, the easier it is to comprehend the laws of the Way of Heaven?”<br/><br/>Gu Yang was stunned, “Isn’t it?”<br/><br/>“Big mistake. The higher the world’s grade, the more rigorous and complex the laws of the Way of Heaven, and those without a foundation don’t even know where to start.”<br/><br/>Gu Yang instantly realized where the problem was.<br/><br/>He fell into a thinking trap, feeling that the higher the grade of the Immortal Realm, the better and more perfect the laws of the Way of Heaven are.<br/><br/>This is indeed correct, but for someone like him with no foundation, he doesn’t know where to start.<br/><br/>It’s like self-learning painting. If you first give a master’s work and ask to self-study, you don’t even know how to start copying it.<br/><br/>If you really want to learn, naturally start from the basics. At least, start with simple paintings, and there’s a chance of success.<br/><br/>Therefore, he was wrong from the beginning, he should start from the world with the lowest level.<br/><br/>“Hehe.”<br/><br/>Seeing his understanding, the mummified laughter came out, “Actually, compared to the ancestors of the Human Race in the ancient times, you are considered lucky, having so many fragmented laws of the Way of Heaven to comprehend.”<br/><br/>“In the ancient times, the situation faced by human ancestors was much more difficult than yours.”<br/><br/>“Thank you for the guidance, elder.” Gu Yang this time thanked sincerely.<br/><br/>If it were not for it, he didn’t know how long he would be on this wrong path and how many simulations would be wasted. It deserves his thanks.<br/><br/>The mummified asked, “Do you have any other questions?”<br/><br/>Gu Yang felt that its attitude this time was completely different from the previous two times. It became very patient, which made him feel valued.<br/><br/>Indeed, in this world of cultivation, everyone respects strength. Even this old monster that has lived for who knows how many years is no exception.<br/><br/>He said, “No more.”<br/><br/>In terms of specific cultivation, he dared not ask for its opinion, who knows if it would mislead him.<br/><br/>With Xia Emperor’s strength, he actually opened the passage to the four Heaven Realm worlds and eventually died because of this. This is a lesson from the past.<br/><br/>Then, he left with Su Ningyan.<br/><br/>…<br/><br/>“I didn’t expect you to reach that step so quickly.”<br/><br/>After the two left the ground, Su Ningyan, who had not spoken since they met, spoke with some emotion.<br/><br/>She remembered that when they first met, he was only a First Rank in the Mortal Realm.<br/><br/>Who would have thought, in less than a year, he has already reached the peak of the Unleaking Realm and is about to break through the Celestial Realm.<br/><br/>Gu Yang said, “Don’t worry about the Barbarian issue on the grassland. After I finish the Yaochi Conference, I will deal with them.”<br/><br/>Su Ningyan was slightly startled.<br/><br/>The grasslands today are home to two Celestial Beings. Yet he casually mentioned that he would deal with it.<br/><br/>Such confidence and dominance emanated from his casual words, leaving her somewhat shaken.<br/><br/>“…Okay.”<br/><br/>After Gu Yang finished speaking, he was about to leave.<br/><br/>“Gu Yang.”<br/><br/>Suddenly, Su Ningyan behind him called him. He turned his head and saw some hesitation in her expression and asked, “What’s the matter?”<br/><br/>She took a deep breath and said, “I have a request.”<br/><br/>“Say it.”<br/><br/>“When you become a Celestial Being one day, can you go back to Blue Sky Palace with me?”<br/><br/>One of the Four Great Sacred Lands, Blue Sky Palace?<br/><br/>Gu Yang didn’t expect her to make such a request. He thought about it and nodded, “Okay.”<br/><br/>He did not ask why. By then, he would naturally know the reason.<br/><br/>Among the Four Great Sacred Lands, the existence of Blue Sky Palace is the lowest. There must be a reason for this.<br/><br/>Now that he knows the origins of those Heaven Realm worlds, he will not underestimate any force that can survive in a Heaven Realm world.<br/><br/>In ancient times, that was the Immortal Realm, and the forces that survived the catastrophe to this day are definitely extraordinary.<br/><br/>Shuiyue Heaven was so weak simply because of the internal strife at the time. Otherwise, judging from the methods shown by Shuiyue Heaven’s Monarch, coupled with the innate spiritual treasure of the Riverside Picture, how terrifying would it be?<br/><br/>Normal inheritances like the Heaven Realm of Myriad Forms and the Star Luo Heaven Realm came to the human world and easily wiped out Great Zhou. Luo Wang could only survive relying on the palace.<br/><br/>He didn’t know what kind of strong man was in the Blue Sky Palace.<br/><br/>If he didn’t have the Simulator, he wouldn’t dare to agree to this easily.<br/><br/>…<br/><br/>…<br/><br/>After Gu Yang left the palace, he didn’t leave Divine City, but went towards Red Mansion, the most famous place in the world.<br/><br/>When he arrived outside the Red Mansion, he was surprised to see that the person opening the door was someone he would never have thought of, “Why is it you?”<br/><br/>PS: It’s the 4th now, and it will catch up soon, so please support with monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}