{"id": 380, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132361.html", "title": "Chapter 380 - Chapter 380: 380 Spoils Of War", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 380 - Chapter 380: 380 Spoils Of War</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 380: 380 Spoils of War<br/><br/>“Godslayer!”<br/><br/>The dean, who was rushing over, was taken aback by Gu Yang’s sword.<br/><br/>Gu Yang had actually mastered the second move of the “Zhanxuan Sword Technique”!<br/><br/>The “Zhanxuan Sword Technique” is an Immortal Rank swordsmanship, only accessible to those on the Immortal Rank, involving some aspects of the Dao. Anyone below the Immortal Rank would not only fail to comprehend it, they wouldn’t even be able to understand what they saw.<br/><br/>He himself was an unparalleled genius in swordsmanship, and during a fortuitous encounter, he obtained the inheritance of this sword technique. Before he reached the Celestial Being realm, he barely managed to grasp the first move, the Yuan Destroyer.<br/><br/>After entering the Celestial Being realm, he mastered the second move, the Godslayer.<br/><br/>With this move, he, with his cultivation level in the early stage of the Celestial Being realm, annihilated the clone of Lord Chi Ming, the ancient powerhouse. He created an impossible-to-replicate miracle.<br/><br/>Needless to say, the power of this sword technique is immense.<br/><br/>However, the greater the power of a sword technique, the higher the entry threshold.<br/><br/>The biggest problem with the “Zhanxuan Sword Technique” is the absence of a prior beginner’s sword technique. From the start, it is set at the highest difficulty level.<br/><br/>Over the course of several hundred years, he had been longing to find an inheritor for the “Zhanxuan Sword Technique”.<br/><br/>Therefore, he painstakingly simplified the Yuan Destroyer move and placed it in the Star Picking Pavilion of the Academy for anyone in the world to study and comprehend, regardless of their background. Even those with hidden agendas or people from the Demonic Path are allowed to learn.<br/><br/>Because this sword technique is extremely difficult.<br/><br/>Despite the pool of elites and gathered geniuses in the Academy, not one person was able to comprehend this move.<br/><br/>His situation at the time was extremely dire. Lord Chi Ming was eagerly awaiting his demise, while his injuries remained unhealed. He could barely muster enough strength for one sword strike as a deterrent.<br/><br/>He could not let the “Zhanxuan Sword Technique” get lost. Otherwise, no one in the human realm would be able to resist Lord Chi Ming.<br/><br/>Thus, he had no choice but to discard his preferences for his own Sect and select an inheritor from the entire world, even if they were disciples from another Sect.<br/><br/>Nevertheless, in these many years, despite visits by the greatest characters from all the major families, several large Sects, and the most outstanding individuals in the world to the Star Picking Pavilion, no one could comprehend that move.<br/><br/>As Lord Chi Ming’s plans unfolded, powers from all sides began to mobilize. He knew that Chi Ming was about to make a move on him, so without hesitation, he passed on the “Zhanxuan Sword Technique” to Gu Yang.<br/><br/>Over the years, he had met countless talents. Regardless of whether it was Qin Wu, Wu Shengtian and those from the Chen Family, Lin Family, and Sword Palace, he was able to discern their limits.<br/><br/>These unique individuals who had the potential to become Celestial Beings within the last few hundred years in the Divine State – it’s highly unlikely that their future achievements could surpass his.<br/><br/>Only this kid, he couldn’t see through.<br/><br/>Being inscrutable is the highest form of praise.<br/><br/>Now it seems that this might be the most correct decision he has ever made in his life.<br/><br/>Gu Yang was able to master the second move, Godslayer, before entering the Celestial Being realm and managed to kill an ancient Celestial Immortal who had survived till the present day.<br/><br/>What a miracle this is.<br/><br/>Even if it was him in his prime, his strength far surpassing the current Gu Yang, he would have had no means to break free from that deadly situation just now.<br/><br/>One Innate Spirit Treasure, one Celestial Rank Spirit Treasure, would have been enough to crush him.<br/><br/>But Gu Yang managed to do it. He did not even know how the kid achieved it. He broke the shackles of the Innate Spirit Treasure, resolutely endured an attack from a Celestial Rank Spirit Treasure, and then used the Godslayer to kill the ancient Celestial Immortal on the spot.<br/><br/>The first move of the “Zhanxuan Sword Technique” cuts through the Mana and Immortal Element.<br/><br/>The second move, Godslayer, targets the Original Spirit.<br/><br/>Even for powerful entities at the level of a Celestial Being who have cultivated their Original Spirits to the Pure Yang level, making them indistinguishable from their Mortal Bodies, if they were hit by this sword technique that specifically targets the Original Spirit, they would either die or lose a layer of skin.<br/><br/>…<br/><br/>The battle between Gu Yang and Yun Piaomiao was decided in an instant.<br/><br/>Wen Jue and the Dean were both greatly shaken, but at least they had some preparation in their hearts. Before this, Gu Yang had created one brilliant record after another, defeating enemies of higher ranks.<br/><br/>Although this record was a bit exaggerated, they quickly accepted it.<br/><br/>When Bi Shui Daoist and Shen Bulin from the Water Moon Cave Heaven saw that scene, they simply couldn’t believe their eyes, thinking they were victims of an illusion.<br/><br/>That terrifying figure, suspected to be the Water Moon Heavenly Monarch, was actually slain by a Nascent Soul cultivator?<br/><br/>Bizarre, horrifying, and terrifying…<br/><br/>Both of them were the leaders of a Sect and were among the top figures in this realm. But now, looking at that Nascent Soul stage young man, they felt somewhat unable to bear the sight.<br/><br/>At this moment, the young man turned his head and looked at them, with a meaningful smile on his face.<br/><br/>Both of them felt as if an icy chill crept up on them, and with two swooshes, they disappeared right from where they were, leaving no trace behind.<br/><br/>…<br/><br/>“These cowards, even rabbits have more guts than them.”<br/><br/>After Gu Yang scared away the two Transcendent God cultivators, he felt a wave of emptiness inside him.<br/><br/>The sword strike he just executed was beyond his realm’s control. It instantly exhausted his Mana, vitality, and Original Spirit. At this moment, he was enormously weak.<br/><br/>He was completely devoid of Mana, so weak that he could hardly lift the Human Emperor’s Sword, black spots appearing in front of his eyes.<br/><br/>It had been a very long time since he had felt this weak.<br/><br/>He felt that even an ordinary person could knock him down.<br/><br/>If it weren’t for the small amount of power the Human Emperor’s Sword fed back to him, he wouldn’t have been able to turn around.<br/><br/>“Simulation complete. You can choose to retain one of the following.”<br/><br/>“…”<br/><br/>He opened the system and directly chose one.<br/><br/>It was his reward from using a simulation before taking action, which he hadn’t claimed yet.<br/><br/>It was during that simulation that he discovered he had scared off that ancient Celestial Immortal, revealing his bluster but weak essence.<br/><br/>However, in the simulation, both the Dean and Wen Jue died.<br/><br/>Although that ancient Celestial Immortal could only use a hint of the power from the Mountain and River Painting, the way he used it was unpredictable. Even after he killed him, he still left in a mighty manner.<br/><br/>Therefore, when Gu Yang realized Fu Wansheng was the key to the Mountain and River Painting, he decisively struck and killed him.<br/><br/>In doing so, the ancient Celestial Immortal was unable to use the power of the Mountain and River Painting.<br/><br/>Sure enough, after removing his main reliance, Gu Yang easily killed him on the spot.<br/><br/>After using the reward, his body was instantly filled with Mana, his physical strength recovered to its peak, and his Original Spirit was replenished.<br/><br/>Instantly rejuvenated on the spot.<br/><br/>He glanced at the prompt in front of him, [Received 5000 energy points, current balance is 26,300 points.]<br/><br/>An ancient Celestial Immortal, is actually this stingy, only gave 5000 points. The same as that illusory God slain by the Emperor’s Sword just now.<br/><br/>This means that this person’s real strength is actually not as good as Fu Wansheng’s.<br/><br/>Like those Celestials, he is also at the first rank of the Celestial realm. Fu Wansheng should be at the second rank.<br/><br/>With such strength, an ancient Celestial Immortal, using a primordial spirit treasure and a copper mirror spirit treasure, actually suppressed the five Celestials into having no way to resist. One of them even had a higher realm than him.<br/><br/>This primordial spirit treasure is too awesome.<br/><br/>Thinking of this, Gu Yang looked at the Emperor’s Sword in his hand, compared to it, this first supreme treasure of the Human Race with such a massive reputation, seems a bit shabby.<br/><br/>“Humph!”<br/><br/>Suddenly, a disdainful snort came from his mind, obviously it was the primordial spirit of the Emperor’s Sword, sensing his thoughts.<br/><br/>It seemed unwilling to explain.<br/><br/>Haha, if you can resist reacting at all, that’s what true indifference is.<br/><br/>Gu Yang chuckled in his heart.<br/><br/>This shows that the Emperor’s Sword’s primordial spirit does care about being compared to other primordial spirit treasures.<br/><br/>Speaking of which, I don’t know if the Emperor’s Sword is considered a primordial spirit treasure.<br/><br/>As he was thinking, he saw the mirror in Yun Piaomiao’s hand wrapped in a brilliant light and flew up on its own.<br/><br/>Gu Yang witnessed this, but did not try to snatch it.<br/><br/>Even though, he is also quite greedy for this spirit treasure.<br/><br/>One spirit treasure, at least five thousand points of energy, can carry out ten simulations. How can he not be greedy?<br/><br/>However, he knows that those brilliant lights are Fu Wansheng’s true spirits. He took advantage of someone’s moment of weakness to kill them and managed to hold Yun Piaomiao back using their true spirits, only then did he have the chance to deliver a killer blow.<br/><br/>If he robs them of their spirit treasure as well, it would be too despicable.<br/><br/>The glittering light carried the heart mirror straight into Ye Lingbo’s hands. Then, the light circled around her a few times before heading towards the sky with reluctance, disappearing in an instant.<br/><br/>Ye Lingbo held the heart mirror in her hand, looking at the direction where the light had disappeared, her gaze somewhat complex. She said, “Thank you.”<br/><br/>Then, she came over to Gu Yang, handed the heart mirror over, and said, “Here.”<br/><br/>“…”<br/><br/>Gu Yang looked at the copper mirror in her hand, and asked, “What do you mean?”<br/><br/>Ye Lingbo looked at him very seriously, and said, “You were jealous just now.”<br/><br/>If you can’t speak properly, then say less.<br/><br/>Gu Yang said grumpily, “Put it away. It’s for you.”<br/><br/>“I don’t need it.”<br/><br/>Ye Lingbo stuffed the copper mirror into his hand, and said, “The Sword of Yao Light is enough for me.”<br/><br/>Her gaze was clear and pure, obviously sincere. In her heart, only the existence of the sword could be accommodated.<br/><br/>If that’s the case, I guess I have to reluctantly accept it.<br/><br/>Gu Yang held the copper mirror in his hand, feeling warm and smooth to the touch, but it seemed to be trembling slightly.<br/><br/>What’s going on?<br/><br/>He found it strange, the mirror was fine when it was in Ye Lingbo’s hand just now.<br/><br/>“Please don’t eat me…”<br/><br/>A tremulous voice echoed in his mind, sounding like a little girl.<br/><br/>Gu Yang was surprised and asked, “Are you the primordial spirit of this mirror?”<br/><br/>This way of communication can only be from a spirit treasure’s primordial spirit.<br/><br/>On his hand, there are several spirit treasures, and the communication with them is always carried out in this way.<br/><br/>He saw the emergence of a girl’s phantom on the copper mirror. She was dressed in a white dress, with a beautiful bun, and looked delicate and exquisite.<br/><br/>Her face was pale and trembling. Fear was in her eyes, but she forcefully suppressed it, not daring to show it. This is pitiful and pathetic to the extreme.<br/><br/>She whimpered, “Master, please, don’t eat me, I’ll behave…”<br/><br/>What the hell?<br/><br/>Gu Yang was stunned. He subconsciously used the Candle Dragon’s divine power to take a closer look and made sure this was not an illusion.<br/><br/>This little girl is actually the primordial spirit of this copper mirror. It’s not an illusion or something.<br/><br/>So far, the spirit treasure’s primordial spirit he has encountered, only the Emperor’s Sword has a human form, but it’s not entirely human.<br/><br/>The spirit of this mirror is actually a little girl.<br/><br/>Gu Yang found it quite curious, but from her words, it seemed that she had already foreseen her fate, asking him not to eat her.<br/><br/>Paying to the system is no different than being eaten.<br/><br/>This copper mirror is indeed unusual.<br/><br/>At this point, Ye Lingbo on the side said, “This is a Celestial-ranked spirit treasure. It’s rare that the primordial spirit can retain such intelligence. Unfortunately, you haven’t reached to the Celestial Being realm, so you can’t fully exploit its power.”<br/><br/>The principal and Wen Jue also arrived, looking at the primordial spirit revealed by the copper mirror, they were somewhat surprised.<br/><br/>Both of them have spirit treasures, but in the Human Realm that environment, the primordial spirits of spirit treasures either dissipate or fall into silence. They have never seen a live spirit treasure’s primordial spirit.<br/><br/>This is the first time.<br/><br/>Just as recorded, the primordial spirits of spirit treasures all possess extremely high intelligence, almost indistinguishable from humans.<br/><br/>Like the primordial spirit treasures, their primordial spirits can even leave their bodies and reincarnate to cultivate again.<br/><br/>Fu Wansheng is a living example.<br/><br/>Although the spirit of this copper mirror can’t achieve that level, being able to retain it to this degree is also very rare.<br/><br/>They didn’t say anything. This was Gu Yang’s spoil of war. It should be disposed of by him.<br/><br/>Gu Yang said, “Then you come over and let me leave a brand on your body.”<br/><br/>PS: Do we still have a monthly ticket?\t\t\t\t\t\t</div>", "images": {}, "success": true}