{"id": 387, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132375.html", "title": "Chapter 387 - Chapter 387: 387 Revival Of The Way Of Heaven", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 387 - Chapter 387: 387 Revival Of The Way Of Heaven</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 387: 387 Revival of the Way of Heaven<br/><br/>“Elder?”<br/><br/>Upon seeing this mysterious old man, Gu Yang felt both surprised and delighted.<br/><br/>Not long ago, he had wondered when he would meet this old man, and to his surprise, they had bumped into each other quite soon.<br/><br/>The old man signaled him to be quiet and not alert others.<br/><br/>At this point, everyone’s attention was on Li Yuan and the divine general Jade Dew, no one was paying attention to them.<br/><br/>Gu Yang nodded, indicating he understood, and stopped speaking.<br/><br/>Jade Dew Divine General looked deeply at Li Yuan, and stated, “Truth be told, the Peach Tree has long lost its vitality and ceased to bear fruit after the great catastrophe of the Ancient Times. Consequently, there are no peaches anymore.”<br/><br/>His words were quite reasonable. After the collapse of the Way of Heaven, countless heavenly treasures, immortal delicacies, and divine herbs vanished without a trace.<br/><br/>Even the most common materials in the cultivation world during ancient times, spiritual stones, and immortal stones, couldn’t be found anymore.<br/><br/>It was not strange that something like a Peach Tree, a Heaven and Earth Spirit Root, would lose its vitality after the collapse of the Way of Heaven.<br/><br/>It would be strange if it was still thriving.<br/><br/>“He’s lying.”<br/><br/>An old voice echoed in Gu Yang’s mind, coming from the elder next to him, “The Peach Tree is the foundation of Yao Chi’s Immortal Palace. If the Peach Tree withers, the Immortal Palace of Yao Chi will cease to exist.”<br/><br/>Though he wanted to say something, he didn’t have the means to communicate through Original Spirit and could only listen silently.<br/><br/>“Young man, do you want to taste the flavor of a Peach? In the Ancient Times, this was a top grade delicacy that only the leaders of different realms and mighty Golden Immortals could afford to taste.”<br/><br/>Gu Yang’s eyes brightened. So, there were still peaches in Yao Chi’s Immortal Palace?<br/><br/>This elder was here for the peach.<br/><br/>Just as he was about to nod, a thought suddenly crossed his mind.<br/><br/>Wait…<br/><br/>“Every time I use the Simulator to join the Yaochi Conference, could all the prohibitions I encounter from Yao Chi’s Immortal Palace have anything to do with this?”<br/><br/>Damn!<br/><br/>The more he thought about it, the more likely it seemed.<br/><br/>Previously, he had helped the old man twice and greatly benefited from both occasions.<br/><br/>The first time, on Dragon Gate Island, the old man helped him infuse the phoenix’s essence blood into his body, saving him from the fate of becoming the phoenix’s power bank.<br/><br/>He even gave Pei Qianlan a drop of genuine Dragon Washing Pond water, allowing her to transform her physique and endowing her with top-notch aptitude.<br/><br/>The second time, in Yellow Springs, he helped the old man again, and as a result, learned how to deal with Lord Chi Ming.<br/><br/>Having had these two experiences, he didn’t think too much about it.<br/><br/>And then, he was tricked.<br/><br/>The more Gu Yang thought about it, the more he felt that this elder might not have deliberately set him up. However, if it came to danger, the elder wouldn’t expend end energy to save him either.<br/><br/>This was actually quite normal. If the roles were reversed and the elder was in danger, he too wouldn’t risk his life to save the elder.<br/><br/>As he mulled over these thoughts, he couldn’t help but open the system and wanted to verify.<br/><br/>[Would you like to use the Life Simulator? Each use consumes a fragment.]<br/><br/>“Yes.”<br/><br/>…<br/><br/>After a while, Gu Yang saw the result of the simulation, exclaiming inwardly.<br/><br/>Finally cracked the case.<br/><br/>Turns out, each time he participated in the Yaochi Conference and encountered prohibitions, it wasn’t because Yao Chi’s Immortal Palace targeted him, but because of his reckless actions.<br/><br/>The Immortal Palace of Yao Chi is one of the three Major Immortal Palaces from the Ancient Times, it was a top-tier force that definitely had mighty Golden Immortals residing within.<br/><br/>And he wanted to steal peaches from them, if that’s not seeking death, what is?<br/><br/>…<br/><br/>Jade Dew Divine General continued, “The cultivation world is in decline today, with the Celestial Being realm being the highest one can reach. This is merely the starting point of a Human Immortal, with a lifespan limited to a few thousand years. Don’t all of you wish to transcend to a higher realm?”<br/><br/>“We host this Yaochi Conference with the intention to combine your experiences with our Immortal Palace’s cultivation techniques, in hopes of finding a method to break into a higher realm!”<br/><br/>His speech stirred many people in the room.<br/><br/>Even those who were more vigilant couldn’t think of any other reason why Yao Chi’s Immortal Palace would invite them to the Yaochi Conference.<br/><br/>Bluntly speaking, if they wanted to kill them, there was no need to go through such trouble. They could’ve just attacked them directly when they found them.<br/><br/>Except for the mysterious elder, all the powerhouses who had reached the Unleaking realm present would certainly die without a doubt.<br/><br/>Why go through the hassle of sending invitations and tricking them into the Immortal Palace to kill them?<br/><br/>This was also the reason why everyone accepted the invitation and arrived on time.<br/><br/>In fact, although the two emissaries from Immortal Palace took a strong stand, they had never killed anyone.<br/><br/>Now, although most people were skeptical, no one raised any objections.<br/><br/>Jade Dew Divine General didn’t give them much time to ponder and said, “The time is almost upon us, let’s go.”<br/><br/>With that, he flew into the sky first.<br/><br/>…<br/><br/>“This pie in the sky…”<br/><br/>When Gu Yang heard Jade Dew Divine General’s words, he felt familiarity, is this not promising empty rewards?<br/><br/>He already knew from the simulation that Yao Chi’s Immortal Palace would soon attack and kill mercilessly every city in their path. The deaths would be ruthless and brutal.<br/><br/>In no time, not just Great Zhou, but practically all the cultivators across various worlds, would be slaughtered by them.<br/><br/>Since he knew the real face of Yao Chi’s Immortal Palace, he naturally scoffed at the divine general’s words.<br/><br/>At this moment, the elderly man’s voice rang in his mind, “Boy, have you decided?”<br/><br/>He immediately shook his head, signaling his refusal.<br/><br/>Are you kidding me? He had just barely discovered this immense trap, he’d avoid it at all costs. Why on earth would he jump into it?<br/><br/>Originally, his plan was, if he really got trapped in there, to kill off the many immortal-ranked palace maids, he should be able to obtain some fragments.<br/><br/>Then, through constant simulation, he would try to increase his power as much as possible and see if he could break out from the seal.<br/><br/>But that was only a desperate measure within his set of solutions. Whether he could break out of the seal or not was still uncertain.<br/><br/>Now, he could finally avoid this deadly location, so of course, he would escape as quickly as possible.<br/><br/>“What a pity.”<br/><br/>There was a hint of regret in the old man’s tone, but he didn’t seem angry for being refused.<br/><br/>Times have changed. After Gu Yang had reached the Celestial Being realm, even he had to look at him differently.<br/><br/>If Gu Yang didn’t want to go, he couldn’t force him.<br/><br/>…<br/><br/>A group of people, following the Jade Dew God General, flew higher and higher. The blood trail in the sky seemed closer and closer.<br/><br/>After a while, the old man’s voice emerged again, “Boy, did you break through in the human realm?”<br/><br/>Upon hearing this question, Gu Yang was slightly startled, and disregarding everything else, he telepathically asked, “Senior, is there a problem?”<br/><br/>“Heh, the problem is significant.”<br/><br/>Seeing his inquiry, the old man knew that his guess was correct, and said, “In short, prepare yourself.”<br/><br/>Anxiety gripped Gu Yang, and he hurriedly asked, “Could you please clarify this confusion for me, senior?”<br/><br/>“Boy, you just need to know that because of your recklessness, you’ve destroyed many people’s plans. Those higher-ups probably wish they could grind you into dust.”<br/><br/>Gu Yang sensed a hint of killing intent in the old man’s words and couldn’t help but feel a chill run down his spine. He forced a laugh and said, “Just for a breakthrough? Is it really that serious?”<br/><br/>“Do you know what the Way of Heaven is?”<br/><br/>“Some kind of specific world rule, I suppose.”<br/><br/>“Then you should know that as long as this world isn’t destroyed, the Way of Heaven rules won’t disappear. Even if they’re ‘killed’ by someone, they’ll recover naturally over time.”<br/><br/>After hearing this, Gu Yang realized that this might involve the deepest secrets of this world, and he became somewhat excited. “So, senior, you’re saying that the Way of Heaven might come back to life?”<br/><br/>Once the Way of Heaven revived, this world could return to its ancient splendor.<br/><br/>The old man said, “That’s right, but, the process would be extremely long. It might take hundreds of thousands, even millions of years.”<br/><br/>A million years?<br/><br/>Well, that’s useless then. Even a Celestial Immortal probably wouldn’t live that long, right?<br/><br/>Gu Yang didn’t think he could live that long without the revival of the Way of Heaven.<br/><br/>“Who can live until then?” he asked.<br/><br/>The old man replied, “Naturally, some people can.”<br/><br/>What does that mean?<br/><br/>Could it be that some of the Golden Immortal powerhouses from ancient times are still alive now?<br/><br/>Wasn’t it said that the higher your realm, the greater the impact you would receive when the Way of Heaven collapsed?<br/><br/>The old man continued, “However, because of your provocation, the Way of Heaven might revive prematurely.”<br/><br/>Confused, Gu Yang asked, “Isn’t that a good thing?”<br/><br/>The turnaround of the Way of Heaven, well, wouldn’t that make him a great hero in the world of cultivation? His contribution to this world would be no less significant than when Pangu created the world.<br/><br/>A strange light flashed in the old man’s eyes, and with a chilling voice, he said, “Boy, do you know how the Way of Heaven died?”<br/><br/>…<br/><br/>As the two people shielded their surroundings for a private conversation, their actions did not escape the attention of the rest.<br/><br/>However, nobody else tried to find out exactly what they were talking about. They were merely curious about the identity of the old man.<br/><br/>Suddenly, Master Sichen, who had been silent all along, sensed something was off, he snapped, “Who are you? How did you get that invitation?”<br/><br/>“Hehe.”<br/><br/>With a strange laugh, the old man vanished like a bubble.<br/><br/>Everyone present was unaware of how he had left.<br/><br/>Even Master Sichen and Jade Dew God General, two of the immortal-ranked powerhouses who had survived since ancient times, hadn’t been able to stop him.<br/><br/>Their faces turned somewhat grim as they shifted their gaze onto Gu Yang.<br/><br/>Gu Yang held up his hands, immediately declaring his non-involvement, “Don’t look at me like that, I don’t know him. He suddenly started chatting with me, so we just talked a bit.”<br/><br/>Master Sichen and Jade Dew God General quickly shifted their gaze away from him, not saying anything else. They continued to lead everyone upward, their expressions a bit more alert.<br/><br/>Finally, when they were nearly ten thousand meters above the ground, they stopped.<br/><br/>After waiting for a short period, a crack suddenly appeared in space in front of them. It was bottomless and pitch-black, intimidating anyone who looked at it.<br/><br/>“Everyone, follow me.”<br/><br/>The Jade Dew God General was the first to fly into this space entrance.<br/><br/>The first person to follow in was Li Yuan.<br/><br/>With his example, the others followed suit.<br/><br/>Gu Yang was among the last to enter, just ahead of Master Sichen.<br/><br/>Before long, they arrived at the Yaochi Immortal Palace.<br/><br/>PS: I need monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}