{"id": 381, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132363.html", "title": "Chapter 381 - Chapter 381: 381 Thirty-Three Days", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 381 - Chapter 381: 381 Thirty-Three Days</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 381: 381 Thirty-three Days<br/><br/>There are several ways for a spirit treasure to acknowledge its master.<br/><br/>One is like the Human Emperor Sword, consenting to lend a portion of its power to Gu Yang, but neither exerting effort nor force. When it’s displeased, it completely ignores him.<br/><br/>When it’s delighted, it can exert divine power, helping him eliminate powerful enemies.<br/><br/>A powerful entity like a Celestial Being, can be eliminated with one strike.<br/><br/>This situation can’t even be considered as acknowledging a master.<br/><br/>Because the Human Emperor Sword can abandon him at any time.<br/><br/>In this relationship, the Human Emperor Sword is the dominant party.<br/><br/>The second type is like the Giant Spirit Hammer, having a certain relationship, its primordial spirit has reluctantly acknowledged him, it just dislikes his weak power. In the absence of a better choice, it temporarily recognizes him as its master.<br/><br/>This relationship is relatively equal.<br/><br/>Gu Yang can use most of the Giant Spirit Hammer’s power, and it will also try to cooperate.<br/><br/>But that’s it, deeper communication cannot be established. He can not activate the Giant Spirit Hammer’s real form.<br/><br/>As an Earth Grade Spirit Treasure, its power is naturally far from this, only, unlocking the real form consumes too much for it. It wouldn’t consume so much for Gu Yang’s sake.<br/><br/>The third kind is like the Ghostly Figure, fully acknowledging him as the master, revealing all its postures and functions to him.<br/><br/>He dominates over this relationship.<br/><br/>The Ghostly Figure’s Primordial Spirit is greatly restricted, the cost of betrayal is enormous.<br/><br/>Gu Yang can have it in its complete form, releasing all its energy, and it must comply.<br/><br/>However, its Primordial Spirit still has a certain degree of autonomy, like, he can’t make it self-detonate.<br/><br/>Apart from these three types, there is one more.<br/><br/>It’s what Gu Yang just proposed to the Mirror of Heart, leaving a mark in its primordial spirit’s body.<br/><br/>This means that its body and mind are completely open to him, with no autonomy left.<br/><br/>Even if Gu Yang orders it to self-destruct, it must comply.<br/><br/>This is the most thorough and complete acknowledgement of a master, an ordinary spirit treasure would rather die than agree to this. Each self-aware being rejects the situation where its life and death completely depend on others’ hands.<br/><br/>Generally speaking, only when a cultivator refines a spirit treasure by his own hands, can he leave a mark when the primordial spirit is newly born and its self-consciousness is extraordinarily weak.<br/><br/>Spirit treasures that have had several owners are all shrewd, not that easy to tame.<br/><br/>The relationship between a cultivator and a spirit treasure, who’s the dominant one and who has the final say, depends on their competition.<br/><br/>Just like now, Gu Yang proposed this extremely harsh condition, does the Mirror of Heart have room for rejection?<br/><br/>“Alright!”<br/><br/>The little girl agreed immediately, opened her most core part to Gu Yang.<br/><br/>This decisive and neat action even surprised Gu Yang a bit.<br/><br/>To be honest, he didn’t really consider recharging this spirit treasure, at least not in the short term.<br/><br/>Unexpectedly, it scared itself and revealed its cards so soon.<br/><br/>Seeing it being so cooperative, Gu Yang naturally wouldn’t be polite, and directly left a mark within it with his original spirit.<br/><br/>This method was learned from the “Taixuan Heavenly Book”.<br/><br/>This method is comprehensive, it could be said to be an encyclopedia of ancient cultivation world, it contains everything.<br/><br/>Suddenly, Gu Yang felt a mysterious connection in his Original Spirit.<br/><br/>This feeling was somewhat similar to when he made a contract with Eve.<br/><br/>He put away the Mirror of Heart and said to the dean and Senior Wen who had been waiting for a long time, “Dean, Senior Wen, what should we do next?”<br/><br/>The dean as usual was still in that green robe, looking like an ordinary scholar, just with a bit more free and easy temperament than before, “I have to go back first.”<br/><br/>After saying this, he disappeared.<br/><br/>Decisive to leave without any hesitation.<br/><br/>Senior Wen said, “I will stay here to cultivate in seclusion for a while.”<br/><br/>Understandable, she just broke through to the Celestial Being realm, and needed to consolidate it.<br/><br/>Gu Yang reminded, “Be careful of those two guys.”<br/><br/>He was referring to the two God Transformations who just ran away.<br/><br/>“Alright.”<br/><br/>Senior Wen didn’t say much unnecessary words, and left after she finished speaking.<br/><br/>She didn’t say where she was going. Having reached the Celestial Being realm, she already had enough power to protect herself and could go wherever she wanted in the world.<br/><br/>…<br/><br/>In the end, only Gu Yang and Ye Lingbo remained.<br/><br/>“Let’s go.”<br/><br/>Gu Yang called.<br/><br/>However, Ye Lingbo did not move. Instead, she took off a jade pendant from her neck and handed it to him, saying, “This is the key to the Heaven Opening Water Moon Pocket Universe. With this, you can come and go freely.”<br/><br/>Gu Yang understood and asked, “You’re going to stay here?”<br/><br/>Ye Lingbo replied, “If I follow you now, I’d only be a liability.”<br/><br/>Gu Yang seemed a little hesitant, but he respected her decision. He took the pendant and said, “I understand. I’ll be leaving now. Take care.”<br/><br/>Watching his departing figure, Ye Lingbo cried out, “Don’t flirt around anymore.”<br/><br/>Then he saw Gu Yang raise his hand and wave once.<br/><br/>A moment later, his figure had disappeared.<br/><br/>Her eyes flashed with a hint of melancholy, and she murmured softly, “The next time we meet, I want to stand by your side.”<br/><br/>Then she vanished from the spot as a glimmer of light flickered beside her.<br/><br/>If Gu Yang was here, he would have noticed that her space-traveling method was just like Yun Piaomiao’s method from earlier.<br/><br/>…<br/><br/>There wasn’t too much sadness or nostalgia in Gu Yang’s heart. His mind was still not at a point where it could accommodate such sentiments.<br/><br/>What he really wanted to say earlier was that the gap in their cultivation levels might be even larger the next time they met.<br/><br/>But thinking that stating such a harsh truth could hurt feelings, so he kept it to himself.<br/><br/>There were only five days left until the Yao Chi Conference.<br/><br/>He was still a little short of reaching the Celestial Being realm.<br/><br/>Don’t be fooled thinking that he had just killed two Celestial level beings. One achievement could be attributed to the Human Emperor’s sword and had nothing to do with him.<br/><br/>The other one was because he was aided by Fu Wansheng’s true spirit, restraining Yun Piaomiao.<br/><br/>Otherwise, no matter how powerful that sword was, it would be useless if it didn’t hit target.<br/><br/>The Immortal Palace in Yao Chi is full of ancient powerhouses that have survived till now, none of whom he can trifle with.<br/><br/>Now, he is at the peak of the third layer of the Unleaking Realm. The only path that lies before him is to make a breakthrough to the Celestial Being realm.<br/><br/>The term Celestial Being is used by Great Zhou. In ancient times, this realm was called God Transformation.<br/><br/>The so-called God Transformation is to cultivate the Original Spirit to Pure Yang, hence directly comprehending the Way of Heaven.<br/><br/>This step is crucial in the Immortal’s path. It is the starting point of becoming an Immortal.<br/><br/>Until the catastrophe of the ancient times, the collapse of the Way of Heaven, the fall of all immortals, there was no existence of Immortals in the world.<br/><br/>Also, no one could break through to this realm anymore.<br/><br/>After the catastrophe, the Martial Arts flourished, and the first to break the barrier of the Celestial Being realm was the founder of the Dao Sect, the Nameless Taoist.<br/><br/>Since then, the realm of Celestial Beings has arisen in the Divine State.<br/><br/>He referred to this realm as Celestial Being for a good reason.<br/><br/>this path was much different from that of the ancient cultivation<br/><br/>The path of ancient cultivation was to unify with heaven and human, focusing on merging body with Dao.<br/><br/>However, Martial Arts focus on tapping personal potential, continuously enhancing oneself. At the Celestial Being realm, the Dao is also comprehended and integrated into the body, creating a Daoistic aura in the Original Spirit, eventually forming one’s own Dao.<br/><br/>Such path to becoming a Celestial Being was more domineering. It was destined to be more difficult as it required a deep understanding of the Way of Heaven.<br/><br/>That’s why there were so few Celestial Beings in Great Zhou.<br/><br/>After Xia Emperor, in a thousand years, only three celestial beings have appeared in the whole Great Zhou. Including Wen Jue and Qin Wu who will achieve the Celestial Being realm in the future, there are only five.<br/><br/>In any Pocket Universe, the number of Celestial Beings is higher than that in Great Zhou. There is certainly a reason.<br/><br/>Of course, in terms of strength, the Celestial Beings of Great Zhou are very powerful. Just one academy principal was able to halt the invasion of the Lord Chi Ming.<br/><br/>The primary issue facing Gu Yang in achieving the Celestial Being realm is the location of the breakthrough.<br/><br/>He was aware of many Pocket Universes, not to mention this place. There were also Golden Court Pocket Universe, Yellow Springs Pocket Universe, All Appearances Pocket Universe, Star Luo Pocket Universe, Penglai Heaven, Peach Source Heaven, and so on.<br/><br/>There were too many choices.<br/><br/>He felt the need to ask someone for advice.<br/><br/>…<br/><br/>Gu Yang arrived at the dilapidated temple outside of Huang Family Town. Using the jade pendant, he opened the portal to the Star Picking Pavilion’s top floor in the pocket universe. With one step, he was back.<br/><br/>After the spatial gate closed, he called out, “Principal”.<br/><br/>Another spatial gate opened. It was the small courtyard where the principal was. The principal’s voice came from inside, “Come in.”<br/><br/>Gu Yang entered the yard and saw Old Gao busily working. A large pair of shears in his hand, he was trimming the trees in the yard.<br/><br/>“You’re here.”<br/><br/>Upon seeing him walk in, Gao Fan greeted him cheerfully and turned back to continue his work. Suddenly, he realized something was off, turned around sharply, and looked at Gu Yang incredulously.<br/><br/>“No way.”<br/><br/>His eyes almost bulged out of his head. He was so flustered he couldn’t even speak right, “you… you…”<br/><br/>Suddenly, he jumped down from the tree, moved closer to Gu Yang, and circled around him, mumbling to himself, “Peak of the Unleaking realm?”<br/><br/>The principal, still sitting in his wicker chair with a book in his hand, suddenly said, “Now, you can help him remove the imprint left on him by Lord Chi Ming.”<br/><br/>Oh right!<br/><br/>Gu Yang was reminded of this by his remark.<br/><br/>At the time, Gao Fan had been infected by the power of Lord Chi Ming. He had brought him here hoping the principal could help and save Old Gao’s life.<br/><br/>As a result, the principal had passed the “Zhanxuan Sword Technique” onto him.<br/><br/>He had almost forgotten the initial purpose of cultivating this sword technique.<br/><br/>Gu Yang drew out the Human Emperor Sword and slashed towards Gao Fan who was beside him.<br/><br/>The second move of the Zhanxuan Sword Technique, Godslayer.<br/><br/>Lord Chi Ming’s power could contaminate martial artists because it was of a higher order, incorporated with some Dao profundity, or in other words, the power of Laws. Ordinary means were utterly ineffective in removing it.<br/><br/>However, the Zhanxuan Sword Technique was the nemesis of this power.<br/><br/>The first move, Slaying Origin, corresponded to the mana in the Divine Power Realm.<br/><br/>The second move, Godslayer, corresponded to the Dao profundity and Immortal Elements in the Human Immortal Realm.<br/><br/>When the Human Emperor Sword slashed down, Old Gao only felt a sword intent penetrating his body. The cutting pain made him think that he’d been cleaved in two.<br/><br/>The intense pain twisted his facial expression.<br/><br/>From Gu Yang’s point of view, he clearly saw a wisp of black shadow separating from Old Gao’s back. Under the Godslayer sword intent, it was quickly reduced to nothingness.<br/><br/>“You——”<br/><br/>After the black shadow was slain, Gao Fan’s vision went black. Pointing at Gu Yang, he just said a word “you”, and then passed out.<br/><br/>Seeing his move, the principal couldn’t help but admire, “Masterful.”<br/><br/>Good performance for outsiders, but professionals look for details.<br/><br/>Gu Yang’s strike was precise, eliminating the foreign energy inside Gao Fan without causing him much harm. The delicate control was peak perfection.<br/><br/>It was impressive that Gu Yang could refine this sword move to such a degree in such a short time.<br/><br/>Compared to Gu Yang, his own title of a swordsmanship genius seemed a little undeserving.<br/><br/>When he first mastered this move, it had taken him at least ten years to reach this level.<br/><br/>This praise was indeed from the heart.<br/><br/>“I’m embarrassed.”<br/><br/>Gu Yang humbly replied. Unlike when he was at the Water Moon Pocket Universe where he needed to exert his full strength, this time, the expenditure was something he could handle.<br/><br/>Not bothering about Gao Fan lying on the ground, he broached the serious topic, “Principal, actually, this time I came because I have something to ask.”<br/><br/>The principal put down the book in his hand, “What do you want to know?”<br/><br/>“Does it matter which pocket universe I choose to break through in?”<br/><br/>Instead of answering, the principal asked him, “Do you know what the pocket universes were back in ancient times?”<br/><br/>Gu Yang shook his head, he really didn’t know.<br/><br/>“In ancient times, these places were generally referred to as the Three Realms. The Human Realm, is the world we are in, since you’ve had contact with people from the West Bank Continent, you should know that this world is vast and contains other continents.”<br/><br/>“In reality, the Human Realm is much larger than what you imagine. Whether it’s our Divine State Continent or the West Bank Continent, they are only a small part of the Human Realm.”<br/><br/>“However, after the collapse of the Way of Heaven, there were no more immortals in the Human Realm. For individuals in the Divine Power Realm, travelling across the vast sea to another continent would take a long time. Over time, there was no more interaction between the continents.”<br/><br/>“Besides the Human Realm, there is the Heavenly World, which consists of thirty-three heavens. Today’s pocket universes, during ancient times, were the Thirty-Three Heavens and were part of the Heavenly World.”<br/><br/>The Heavenly World?<br/><br/>Gu Yang listened, stunned. Could a place like Shuiyue Dongtian really be the fairyland?<br/><br/>Seeing his confusion, the Dean explained, “Of course, the fairyland isn’t anything extraordinary, really. All thirty-three heavens are territories conquered by the great power of the human race in ancient times and were later divided into fairyland and human world.”<br/><br/>“The original area of Shuiyue Dongtian was extremely vast. But when the great catastrophe descended, Shuiyue Tianjun, the World Lord at that time, used the innate magic treasure ‘Mountain River Map’ to isolate a region and protect it. That is now Shuiyue Dongtian, outside of which there is still ten or even hundreds of times more space.”<br/><br/>Gu Yang gave it a thought. It was quite normal for these Dongtian worlds, being able to retain part of the Way of Heaven, to be of a higher rank than the human world.<br/><br/>He asked, “I have been to quite a few Dongtian worlds actually. Are there any differences among them?”<br/><br/>“Of course, there are.”<br/><br/>The Dean elaborated, “Although they are all part of the Fairyland, the thirty-three heavens can be categorized into four levels. The lowest level is commonly known as ‘Dongtian’.”<br/><br/>“Take Shuiyue Dongtian for example, there are in total ten such Dongtian worlds.”<br/><br/>“A level higher is generally referred to as ‘a certain Heaven,’ like Chiming Heaven and Taoyuan Heaven. There are also ten of these.”<br/><br/>“Further up, the names become less consistent, such as Yao Chi and Guanghan Realm, etc. There are ten of these fairyland levels as well.”<br/><br/>“The last three are the supreme heavens. The great catastrophe that swept across the Three Realms ten thousand years ago is indissoluble from these three heavens.”<br/><br/>So, that’s how it is.<br/><br/>Gu Yang finally understood the differences among the Dongtian worlds.<br/><br/>What surprised him was Yao Chi and Guanghan Realm were actually among the thirty-three heavens and on the second level of the fairy realm.<br/><br/>He had been to Guanghan Immortal Palace many times in the simulation, but it had never been mentioned that it was an entire world.<br/><br/>The Dean continued, “Of course, this is a ranking from ancient times and doesn’t necessarily represent the present situation after the great catastrophe. Maybe some Dongtian worlds have managed things appropriately and have managed to retain their powerful strength. Or perhaps they have been occupied by demons like Chiming Heaven and transformed into ghost realms.”<br/><br/>“When you choose your Dongtian world, you need to consider various factors.”<br/><br/>“I understand now. Thanks for pointing me in the right direction, Dean.”<br/><br/>After that, Gu Yang inquired about many things to note when breaking through to the Celestial Being realm.<br/><br/>…<br/><br/>After who knows how long, Gao Fan, lying on the ground, suddenly woke up and jumped to his feet, touched his forehead, and realized he wasn’t dead. He asked, “Where’s that kid Gu Yang?”<br/><br/>The Dean, lounged in his chair, replied, “He left.”<br/><br/>He still couldn’t quite believe it. “Has he really reached the peak of the Unleaking Realm?”<br/><br/>The Dean nonchalantly responded, “Perhaps in not too long, he will become a Celestial Being.”<br/><br/>After the battle in Shuiyue Dongtian, he had full confidence in Gu Yang.<br/><br/>“Good lad!”<br/><br/>Gao Fan wasen’t sure how to feel, but at least his homecoming hadn’t been in vain for him.<br/><br/>“Alright, you can leave now. And remember to close the door.”<br/><br/>“Leave?” Gao Fan was momentarily bewildered.<br/><br/>“Gu Yang has already eradicated Lord Chi Ming’s mark for you. There’s no need for you to stay here anymore.”<br/><br/>“What?”<br/><br/>Gao Fan couldn’t quite believe it. The issue that had troubled him his whole life was just…solved?<br/><br/>All of a sudden, he remembered the events before he passed out, when Gu Yang had struck him with his sword…<br/><br/>…<br/><br/>…<br/><br/>Gu Yang once again left the academy, and subsequently, the Divine City.<br/><br/>He was still digesting all the information from the Dean. These valuable experiences would serve as references in future.<br/><br/>It wasn’t until the night that he once again opened up the system.<br/><br/>[Would you like to use the life simulator? Each use consumes five hundred energy points.]<br/><br/>“Yes.”<br/><br/>[At age 23, you have reached the third level of the Unleaking Realm. In Shuiyue Dongtian, you killed the reincarnation of an ancient celestial, earning a formidable reputation.]<br/><br/>[You head to the shores of the North Sea to attend the Yaochi Conference. When you enter Yao Chi, you accidentally trigger an emissary. With your strong mortal body, you endure and eventually enter a peach forest.]<br/><br/>[You inadvertently awake a palace maid. After waking up, her cultivation level drops to Nascent Soul period. You capture her and interrogate her about the situation in the Yao Chi Immortal Palace…]<br/><br/>PS: If there are any monthly tickets left, please announce. I really need your support.\t\t\t\t\t\t</div>", "images": {}, "success": true}