{"id": 399, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132400.html", "title": "Chapter 399 - Chapter 399: 399 The Efficacy Of Flat Peaches (Third Update, Requesting Monthly Tickets)", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 399 - Chapter 399: 399 The Efficacy Of Flat Peaches (Third Update, Requesting Monthly Tickets)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 399: 399 The Efficacy of Flat Peaches (Third update, requesting monthly tickets)<br/><br/>“If given the chance, I hope to preserve the legacy of Sky Star Pavilion.”<br/><br/>Lord Sky Star expressed his final wish, the only thing he was not at peace with.<br/><br/>Initially, he had completely given up hope. However, the appearance of this real person, Gu, has breathed a faint glimmer of hope into him again.<br/><br/>Upon hearing such a request, Gu Yang immediately agreed, “Okay.”<br/><br/>After returning to Great Zhou, he would simply need to find someone to pass down the practices of Sky Star Pavilion. This was something he could effortlessly achieve.<br/><br/>The moment he grabbed this sword, he felt it seemed different from ordinary Spirit Treasures. It might be just like the Giant Spirit Hammer, an Earth Grade Spirit Treasure.<br/><br/>Even if he didn’t use it, using it for recharge should earn him a good amount of fragments.<br/><br/>The Sky Star Sword did not reject him, but neither did it show any signs of recognizing him as its master. He didn’t mind this, as Spirit Treasures of this level usually had their own temperament.<br/><br/>Just like the Giant Spirit Hammer, which still doesn’t want to acknowledge him as its master until now.<br/><br/>Besides the Spirit Treasure itself, Sky Star Sword, the legacy of Sky Star Pavilion are also tied to a practice named “Sky Star Codex”. The techniques described within are diverse and encompass a wide range.<br/><br/>Sky Star Pavilion was a Sect that once produced Earth Immortals. Hence, this “Sky Star Codex”, just like the “Taixuan Heavenly Book”, is supposed to be a practice of the same grade.<br/><br/>Next, Tang Yue and Lord Sky Star discussed the following affairs, and arranged Gu Yang to stay in a courtyard.<br/><br/>The environment of Sky Star City is much better than that of Huangmu City. The toxicity of the Vitality of Heaven and Earth is approximately only one-tenth. In such an environment, the lifespan of cultivators is longer and the heights they could reach are also greater.<br/><br/>Not requiring any assistance, Gu was alone in the yard and took out the Netherworld Chart.<br/><br/>After swallowing thousands of strange creatures, he wondered if anything peculiar would happen.<br/><br/>He had witnessed the strangeness of these creatures firsthand and had to be cautious.<br/><br/>“Master.”<br/><br/>The Primordial Spirit of the Netherworld Chart flew out from the chart, still in the form of a Black Dragon, only a bit larger in size and its body seemed more substantial than before.<br/><br/>“Those ghosts are really strange. Their power is too extreme and impossible to control, so I had to swallow all their power.”<br/><br/>The Netherworld Chart offers two ways to deal with those ghostly wronged spirits in the chart: control or swallow.<br/><br/>Gu Yang focused his gaze on the small Black Dragon in front of him. Seeing that it seemed fine, he then asked, “You weren’t affected, were you?”<br/><br/>The Black Dragon proudly said, “Ghosts of this level are not a problem for me.”<br/><br/>“That’s good to hear.”<br/><br/>Gu Yang put it back into the Beast-taming Space and placed it next to the Human Emperor’s Sword. If anything odd happened, the Human Emperor’s Sword would give a warning.<br/><br/>Then, he opened the system.<br/><br/>Given how the things had progressed up to this point, he was uncertain about future changes. It would be more reassuring if he ran a simulation.<br/><br/>[Do you wish to use the Life Simulator? Using once will consume one fragment.]<br/><br/>“Yes.”<br/><br/>[At the age of twenty-three, you are a first-level Celestial Being. At the Yaochi Conference, you slay the Jade Dew Divine General and gain a flat peach which incurs the pursuit of multiple Celestial Beings.]<br/><br/>[You hide in Yellow Springs Pocket Universe, kill a Celestial Being-grade strange creature, and scare off Xu Tianxing. Later, you travel to Sky Star City and kill another Celestial Being-grade strange creature, following which you receive a warm invitation from the Four Directions Alliance and head to their headquarters.]<br/><br/>[Afterward, you venture out and slay Celestial Being-grade strange creatures. For the humans of this world, you fight for a bigger living space.]<br/><br/>[One month later, you’ve exterminated all Celestial Being-grade strange creatures known to the Four Directions Alliance. Your Immortal Elements are almost depleted. You consume the fruit of the Red Moon Great Saint’s actual body and fully restore your Immortal Elements.]<br/><br/>[After discussing with the leader of the Four Directions Alliance, you decide to jointly reclaim a desolate Sect site. In the midst of this desolate place, you encounter misfortune that nearly wipes out your entire team. Only you escape after utilising the Netherworld Chart to fend off those strange creatures.]<br/><br/>[You return to Great Zhou to find that the Barbarian army is bearing down on the Divine City, a great war imminent. Your appearance attracts the attention of several Celestial Beings.]<br/><br/>[In the midst of a shocking battle, an ancient Prohibition is shattered, and the passage to the Star Luo Pocket Universe is opened. Several Celestial Beings emerge from the universe and join the melee.]<br/><br/>[Afterward, under the siege of several Celestial Beings, you progressively become unable to hold on. Killing one person by heavily injuring yourself as the price, you are then instantly killed on the spot by Lord Chi Ming. You die at the age of twenty-three.]<br/><br/>All for one flat peach, was it worth it?<br/><br/>Gu Yang, seeing this outcome, wasn’t sure what to say for a moment.<br/><br/>Those few Celestial Beings were clearly after that one flat peach.<br/><br/>Even after a full month has passed, haven’t they considered that the peach was likely eaten by him?<br/><br/>They must be out of their minds.<br/><br/>This time, it was the Lord Chi Ming who was back again. This guy had been silent for so long and suddenly made a lethal move against him.<br/><br/>Was it also for the flat peach?<br/><br/>The thought gave Gu Yang a headache.<br/><br/>He hadn’t expected that possessing a flat peach would bring him such trouble.<br/><br/>Several Celestial Beings were trying to kill him.<br/><br/>As soon as he showed up in the Great Zhou, he would be besieged.<br/><br/>If it were only a single Celestial Being, he would have every confidence to face them. But these guys showed no respect for the Martial Arts, ganging up on him, and he couldn’t withstand that.<br/><br/>What’s more, there was this old sneaky Lord Chi Ming, who was not easy to deal with.<br/><br/>Gu Yang had thought that when he reached the Celestial Being realm, there would be no one in the world who could defy him, that he could run rampant.<br/><br/>Yet, he was still being hunted down.<br/><br/>[Simulation completed, you can retain one of the following.]<br/><br/>[Option one, the Martial Arts realm at the age of twenty-three.]<br/><br/>[Option two, the Martial Arts experience at the age of twenty-three.]<br/><br/>[Option three, life wisdom at the age of twenty-three.]<br/><br/>“I choose one.”<br/><br/>Only a month has passed and he hasn’t accumulated much experience, so it is better to go with option one.<br/><br/>Suddenly, Gu Yang felt a tremendous surge in his Immortal Element, nearly doubling it.<br/><br/>Not only that, but his origin became more robust. Roughly estimated, his lifespan, at this natural rate of depletion, had already exceeded 3,500 years.<br/><br/>As Lu Ying said at the Yaochi Conference, a flat peach could indeed increase one’s lifespan by a thousand years.<br/><br/>“This is the effect of the flat peach?”<br/><br/>He finally understood why those strong Celestial Beings were so desperate to kill him.<br/><br/>A single flat peach was enough to double one’s Immortal Element and increase their lifespan by a thousand years. If it were him, he would do anything to seize it.<br/><br/>Worth it!<br/><br/>Gu Yang thought excitedly.<br/><br/>Although he had only one flat peach, he had a life simulator. Every time he simulated, he could enjoy the benefits of eating a flat peach. It was as if he had an endless supply of peaches.<br/><br/>This could save him countless hours of hard work.<br/><br/>Gu Yang opened the system once again.<br/><br/>[…You reach an agreement with the Four Directions Alliance, leading several Celestial Beings to leave the Yellow Springs Pocket Universe and head toward the Great Zhou. You made them lie in ambush around the area, reappear to lure out the Celestial Beings who were trying to kill you. At the critical moment, the Celestial Beings from the Four Directions Alliance make their move, killing those Celestial Beings on the spot.]<br/><br/>[Later, you went to the Grasslands and killed the two Celestial Beings of the Barbarians and handed their territory over to the Four Directions Alliance. The mass migration of the Yellow Springs Pocket Universe began.]<br/><br/>[Three years later, strange creatures appeared in the Grasslands. You went to exterminate them, but it was already too late. A Hollow Void level creature had appeared in the Grasslands.]<br/><br/>[You took Su Qingzhen and others to the Golden Court Pocket Universe and reached a cooperation agreement with the ruler of the Golden Court.]<br/><br/>[Two years later, the ruler of the Golden Court broke through to the level of Hollow Void.]<br/><br/>[Three years later, the strange creature invades the Golden Court Pocket Universe.]<br/><br/>[Two more years, and the Golden Court fell. The ruler of the Golden Court, with his last bit of strength, broke through space and sent you away.]<br/><br/>[The moment you returned to the Human Realm, a beam of light descended from the heavens and killed you. You died at the age of 33.]<br/><br/>Indeed, people from the Yellow Springs Pocket Universe were like ticking time bombs. If they were really brought back to Great Zhou, they might explode at any time.<br/><br/>In merely three years, a Hollow Void level creature appeared, which was simply unthinkable.<br/><br/>Gu Yang couldn’t figure out how that Hollow Void level creature came into existence.<br/><br/>Normally, such a creature should not have appeared at this level within such a short period of three years.<br/><br/>Or could it be that there was someone close to the Hollow Void realm in the Four Directions Alliance?<br/><br/>PS: It’s mid-month, I need monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}