{"id": 390, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132381.html", "title": "Chapter 390 - Chapter 390: 390 I’M Coming!", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 390 - Chapter 390: 390 I’M Coming!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 390: 390 I’m coming!<br/><br/>The Conference at Yao Chi, a dead silence…<br/><br/>All the warriors from the Divine State Kontinent, whether they were Celestials defeated by the Jade Dew Divine General or the Unleaking Realm warriors on the sidelines, had all firsthandly experienced the enormous gap between them and a mighty and ancient immortal gate like Yao Chi Immortal Palace.<br/><br/>Such a chasm, that it brought despair.<br/><br/>Present were not just Luo Wang from Great Zhou, two Celestials from the Barbarian Plains, and another two unfamiliar Celestials.<br/><br/>But also there were the Celestials from the Four Great Sacred Lands; all of the three Saints from the Three Saint Gates had arrived, and there was one representative from Star Sea too.<br/><br/>They were all defeated nonetheless.<br/><br/>From start to finish, only a single Jade Dew Divine General of the opponents had fought.<br/><br/>After this competition, the Divine State Kontinent was utterly defeated.<br/><br/>At this moment, no matter who they were affiliated with, everyone was feeling intensely heavy-hearted.<br/><br/>The present-day Yao Chi Immortal Palace signified that the entire Divine State Kontinent would be reshuffled, just like when the Four Great Sacred Lands had emerged, causing the colossal Xia Dynasty to collapse rapidly.<br/><br/>The current Great Zhou could hardly compare to the Xia Dynasty.<br/><br/>If even the Four Great Sacred Lands who truly dominated this continent had been defeated, who could still counter the Yao Chi Immortal Palace?<br/><br/>Yet another big change, a thousand-year rare event, was happening right before their eyes.<br/><br/>Everyone began to consider how to preserve themselves and their powers within the impending big reshuffle.<br/><br/>At this point, the woman in palace attire, Lu Ying, surveyed everyone and asked, “Is there anyone else up for it?”<br/><br/>Even the Three Saint Gates had been defeated, who could still challenge that Jade Dew Divine General?<br/><br/>Following the collapse of the Xia Dynasty, the entire Divine State Kontinent was actually controlled by the Four Great Sacred Lands, with the largest forces among them being the Three Saint Gates and the Red Bright Sky.<br/><br/>For a thousand years, all the warriors from Great Zhou had been living under the shadow of the Four Great Sacred Lands.<br/><br/>The three Saints from the Three Saint Gates were all defeated by that Jade Dew Divine General, which caused a great shock to them.<br/><br/>“I’ll take up the challenge!”<br/><br/>Just at that moment, a clear voice rang out.<br/><br/>All at once, everyone’s gaze was drawn towards the speaker.<br/><br/>“Gu Yang?”<br/><br/>Only then did everyone remember that he hadn’t taken his turn yet.<br/><br/>But, what of it?<br/><br/>The Three Saint Gates had already been defeated, how could he, a Celestial who had just had a breakthrough, be a match for the Jade Dew Divine General?<br/><br/>…<br/><br/>Gu Yang didn’t intentionally want to be the last one to take the stage, but he simply hadn’t gotten his chance, as everyone else had rushed forward, seemingly driven by a fear of being left behind.<br/><br/>Since he wasn’t anxious, he just allowed the others to go first, and didn’t make his move until all the others were defeated and there was no one left to compete with him.<br/><br/>The defeat of the three Saints from the Three Saint Gates had caught him slightly by surprise.<br/><br/>Those guys should have been stronger than this.<br/><br/>Although Saint Chao Yang had been sneak attacked not long ago by the Red Moon Great Saint and his body had been destroyed, causing a great loss of power, it was generally accepted.<br/><br/>The other two, Red Moon and Qingyu, were in a completely intact state, how could their power level be lacking to this extent?<br/><br/>Although this Jade Dew Divine General was indeed strong, she wasn’t so strong as to be undefeatable and unmatched.<br/><br/>Gu Yang couldn’t help but use the divine power of the Candle Dragon to get a clearer look, but surprisingly this time the divine power of the Candle Dragon had failed, he couldn’t see anything at all.<br/><br/>The prohibition here was indeed formidable, even the Candle Dragon’s divine powers had been restricted.<br/><br/>He could only suppress his doubts, and upon hearing Lu Ying’s words, accepted the challenge.<br/><br/>Then, he took a step forward, walked right up to the Jade Dew Divine General, and from the Beast-taming Space, he drew out a sword.<br/><br/>Hummm!<br/><br/>An astonishing sword energy burst forth from the blade, bringing with it a kind of fiercely commanding aura that suggested nothing could stand in its way.<br/><br/>The Jade Dew Divine General’s initial somewhat bored expression changed when she saw the sword in Gu Yang’s hands, she couldn’t help but exclaim, “The Human Emperor’s Sword?”<br/><br/>The Human Emperor’s Sword!<br/><br/>Not just her, but Lu Ying and Master Sichen were also surprised. After a closer look, it was undoubtedly the Human Emperor’s Sword.<br/><br/>“Wasn’t the Huangdi Sword destroyed already?”<br/><br/>Master Sichen expressed his astonishment, saying that the Human Realm was the first in line in the great catastrophe tens of thousands of years ago. In that unprecedented catastrophe, the Sword of the Human Emperor was also destroyed.<br/><br/>The destruction of this treasure, a symbol of the rise of the Human Race, signified the beginning of the decline of the Human Race’s splendor.<br/><br/>Now, the Sword of the Human Emperor has reappeared in the Human Realm.<br/><br/>How could they not be surprised by this?<br/><br/>Fortunately, the current Sword of the human emperor no longer possesses the apocalyptic power it had in ancient times; otherwise, both Lu Ying and Master Sichen would have turned tail and run.<br/><br/>However, the Sword of the Human Emperor is still the Sword of the Human Emperor. It is the most special among many innate spiritual treasures; its power is inextricably linked to the fate of the Human Race itself.<br/><br/>One could say it is the spiritual treasure least affected by the Way of Heaven.<br/><br/>Just as long as the fate of the Human Race is strong enough, in this era, it is not impossible to restore the power of the ancient times.<br/><br/>Lu Ying knew that the man before her was the one who triggered the “Blood Sky” phenomenon.<br/><br/>Originally, she was extremely angry deep down. The appearance of the “Blood Sky” signified the arrival of the third great catastrophe. Long or short, in a few years or ten, the entire Three Realms would face another catastrophe again.<br/><br/>All her plans had been upset.<br/><br/>After the second great catastrophe, the master of the Immortal Palace of Yao Chi, her teacher, concealed the Immortal Palace deep in the sea of space using vast divine power. Everyone inside the Immortal Palace fell into a deep sleep to resist the erosion of endless time.<br/><br/>They were supposed to awaken after ninety thousand years.<br/><br/>Who would have expected the Demon Suppression Tower to return early, causing her to wake up abruptly?<br/><br/>This unexpected occurrence put her in a dilemma.<br/><br/>After the collapse of the Way of Heaven, whether you’re a Golden Immortal or a Primordial Golden Immortal, you’ll be reduced to Mortal Dust, and under the erosion of time, you’ll eventually decay, and there will be no immortality in the world.<br/><br/>She was initially only a Celestial Immortal; after awakening, she lost the protection of the Immortal Palace of Yao Chi and quickly fell to the Nascent Soul stage.<br/><br/>Soon, she found a way to return to the Human Immortal stage, let alone advancing further was as difficult as reaching the sky.<br/><br/>She has at most two thousand years of life left, and it’s impossible for her to live until her teacher awakens.<br/><br/>Even if she further advances and returns to the Earth Immortal stage, or even the Celestial Immortal stage, she will not possibly have tens of thousands of years of lifespan.<br/><br/>She doesn’t possess the divine power that her teacher had, allowing herself to fall into deep sleep, resisting the erosion of time.<br/><br/>At this time, she only has two choices.<br/><br/>One, accept her fate and wait for death.<br/><br/>Two, find a way to prolong her life.<br/><br/>Lu Ying doesn’t want to sit around waiting for death.<br/><br/>Among the members in the Immortal Palace, she ranked ninth and only had a small part of the authority. So, she woke up her second senior sister, who had the best relationship with her, and unexpectedly staged a sneak attack…<br/><br/>She successfully gained the authority to hold the Yaochi Conference, leading to today’s situation.<br/><br/>All that Lu Ying did was for the flat peach, a miracle product that could extend life by over a thousand years with just one.<br/><br/>The flat peach tree is the most precious treasure of the Immortal Palace, an innate spirit root, born at the beginning of the universe. They, as disciples, do not have the authority to pick flat peaches.<br/><br/>But there is no lack of ways to cheat. Holding the Yaochi Conference is the easiest way to get flat peaches.<br/><br/>That’s also why she sent her subordinates to invite the Unleaking Martial Artists from Great Zhou and Celestial Beings to attend the Yaochi Conference.<br/><br/>According to the rules of the Immortal Palace, each participant in the Yaochi Conference can receive a flat peach, even the youngest kind, can extend life by a thousand years. Moreover, it has great benefits for cultivation.<br/><br/>Lu Ying managed to conceal dozen flat peaches.<br/><br/>She plans to repeat this process in five hundred years, aiming to achieve immortality in this way.<br/><br/>However, after Gu Yang created the “Blood Sky”, it wouldn’t be long before all cultivators in the Human Realm would die out. It would take a few thousand years at least, and it was feared that there might not be any Nascent Soul level cultivators born.<br/><br/>The minimum cultivation level to participate in the Yaochi Conference is the Nascent Soul.<br/><br/>Lu Ying can hide in the Immortal Palace and doesn’t have to worry about dying in the catastrophe.<br/><br/>However, when the cultivators of the Human Realm are all wiped out, when can she gather enough Nascent Souls to participate in the Yaochi Conference?<br/><br/>You must know that the more miraculous items like the flat peach you take, the less effective they become.<br/><br/>Although she got dozens of flat peaches this time, at most, it can only extend her life by three thousand years; added to her own lifespan, it’s just five thousand years.<br/><br/>When the time comes, if she can’t gather people and is unable to hold the Yaochi Conference, she still can’t escape the fate of death due to old age in the end.<br/><br/>All of this was caused by Gu Yang.<br/><br/>If not for the prohibition of harm at the Yaochi Conference, Lu Ying wished she could smash him to pieces, pull out his original spirit, and burn it with ghostly fire for forty-nine days…<br/><br/>Gu Yang suddenly felt a chilly wind attacking him from behind, and he became vigilant, who is cursing me?\t\t\t\t\t\t</div>", "images": {}, "success": true}