{"id": 396, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132393.html", "title": "Chapter 396 - Chapter 396: 396 Another Strange Creature (Third Update, Begging For Monthly Tickets)", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 396 - Chapter 396: 396 Another Strange Creature (Third Update, Begging For Monthly Tickets)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 396: 396 Another Strange Creature (Third update, begging for monthly tickets)<br/><br/>“Do you know how many God-transformation-stage monsters are there in this world?”<br/><br/>Tang Yue shook his head upon hearing Gu Yang’s question, responding with a bitter smile, “To be honest, even we, the Four Directions Alliance, don’t know the answer.”<br/><br/>His demeanor was natural, lacking the stiffness common to most cultivators, suggesting he was only lightly affected by the contamination.<br/><br/>“So far, we have encountered monsters at the stage of God-transformation in four types.”<br/><br/>“The first type is the most terrifying and the origin of all monsters. It is said to be a cloud of black mist without a specific form, suddenly appearing at the forefront of several prominent Sects. Many cultivators lost control the moment they saw it.”<br/><br/>“Soon after, those Sects became a place straight from a Ghost Realm, with only a handful of people managing to escape.”<br/><br/>Remembering the scene of that day, Tang Yue felt a renewed sense of horror.<br/><br/>It all happened too suddenly. At that time, he had just become the Supreme Elder of his Sect and was in seclusion, refining a spiritual treasure. This fortuitously allowed him to escape the first wave of attack.<br/><br/>It was his disciple who desperately broke his solitude, and with his own eyes, Tang Yue witnessed his most valued student losing control and turning into a monster.”<br/><br/>He had no choice but to destroy his own disciple who had transformed into a monster, and then he managed to escape.<br/><br/>It was on that day, one of the top ten Sects of the Yellow Springs vanished, with only him—a Supreme Elder—managing to escape.<br/><br/>He hadn’t seen the black mist with his own eyes; his knowledge about it primarily came from others.<br/><br/>Tang Yue hides his emotions well and continues, “The second type involves the cultivators who underwent God-transformation, the first batch to be infected. They usually maintain the form of monsters—truly horrifying to behold. There are possibly fourteen such beings.”<br/><br/>“Fortunately, they do not readily move and have remained in the place they initially contaminated over the centuries.”<br/><br/>The first batch of contaminated monsters remains within the territories of the Sects.<br/><br/>Among the ten Sects in the Yellow Springs, nine have turned into forbidden zones that guarantee death for anyone who dares to set foot in them.”<br/><br/>“The third type includes those you have just eliminated: cultivators who lost control during God-transformation and then became monsters. They wander and are likewise immensely hazardous. There are, by approximation, ten of them.”<br/><br/>“The fourth type consists of monsters of lower levels, who, after devouring each other and fusing, evolve into God-transformation-stage monsters. Their number is incalculable.”<br/><br/>“No matter which type above, we’ve been incapable of killing any God-transformation-stage monsters to date. You’re the first one.”<br/><br/>Listening to Tan Yue’s words, Gu Yang was shocked.<br/><br/>It can be extrapolated that the number of Celestial Beings in the entire Yellow Springs is at least over thirty. This is horrifyingly absurd.<br/><br/>He couldn’t help but ask, “How did the Yellow Springs survive the ancient cataclysm that took place ten thousand years ago?”<br/><br/>Tang Yue replied, “At that time, the Realm Sovereign protected the Yellow Springs using a preeminent spiritual weapon. This barely helped us to escape calamity. However, not much later, the Sovereign—to seek a way out—left this Realm and even sealed off the passageway between the Yellow Springs and the Human Realm. After that, he never returned.”<br/><br/>Thus, it appeared that the Sovereign of the Yellow Springs was far superior to the Celestial Sovereign of Shui Yue.”<br/><br/>Gu Yang probed further, “Have you found out what caused this cataclysm?”<br/><br/>Tang Yue shook his head, “Initially, some speculated that it was a continuation of the ancient cataclysm but now it seems unlikely.”<br/><br/>Just by observing Gu Yang’s condition, he knew that the Human Realm was still a utopia and hadn’t suffered much catastrophe this time.<br/><br/>Just as he was about to say something else, he grimaced suddenly, looking hesitant.<br/><br/>At that moment, an urgent voice called out from outside, “Elder, an emergency message from Sky Star City! A God-transformation-stage monster is attacking the city, and you are urgently requested to help.”<br/><br/>“What?”<br/><br/>Tang Yue leapt up, his face turning pale. “What exactly happened?”<br/><br/>Seeing his reaction, Gu Yang realized how important Sky Star City was to the Four Directions Alliance.<br/><br/>The door was pushed open from outside, and a subordinate hurriedly walked in to present the report.<br/><br/>Apparently, an hour ago, a God-transformation-stage monster suddenly attacked the Sky Star City. Many city guards lost control immediately. However, the Grand formation of the city was timely activated, keeping the monster at bay.<br/><br/>The city lord of Sky Star City had sent Tang Yue a letter via flying sword, asking for urgent reinforcements.<br/><br/>Tang Yue grew more anxious after hearing the report.<br/><br/>Sky Star City was the gateway for the Four Directions Alliance. The city, along with a dozen other cities, constituted a grand formation, acting like a camouflage talisman, that protected them from being identified by the monsters.<br/><br/>For years, thanks to this Grand formation, the Four Directions Alliance had remained safe.<br/><br/>If Sky Star City were indeed breached by the God-transformation-stage monster, with the grand formation losing a corner, so to speak, dozens of the cities within the core region of the Four Directions Alliance would be exposed. Then, they would face incessant attacks by the monsters.”<br/><br/>Originally, his duty was to patrol the area and divert any God-transformation-stage monster that was discovered. This duty was assigned to someone else when he was stationed in Huangmu City, and unexpectedly, this massive error occurred in Sky Star City’s defense.<br/><br/>Throughout the Yellow Springs, although the number of God-transformation-stage monsters wasn’t scarce—estimated conservatively to be dozens—they were diffused sparsely throughout the Realm, rendering the overall number quite insignificant.<br/><br/>Before this chaos, it was unheard of for a God-transformation-stage monster to be found within a one-hundred-mile radius of these dozen or so cities in the Four Directions Alliance.<br/><br/>The last time it occurred, the monster had been over a hundred miles away.<br/><br/>Why did a strange creature suddenly appear outside of Sky Star City?<br/><br/>Nothing can go wrong in Sky Star City!<br/><br/>Tang Yue, who had experienced many things, immediately made a decision, “Master, I must rush to the aid of Sky Star City, please excuse me…”<br/><br/>Gu Yang said, “I’ll go with you.”<br/><br/>Tang Yue was overjoyed. He had thought about asking this master for help, but given their relationship, he couldn’t bring himself to ask.<br/><br/>Unexpectedly, Gu Yang offered to go with him to Sky Star City.<br/><br/>For a moment, he felt excitement, gratitude, and relief all at once.<br/><br/>With the accompaniment of this powerful figure whose strength was unfathomable, the crisis in Sky Star City could be resolved.<br/><br/>“Thank you, Master.”<br/><br/>…<br/><br/>…….<br/><br/>Sky Star City is nearly two thousand miles from Huangmu City, a distance unimaginable to most people.<br/><br/>In this era, most people never get a chance to leave their city in their entire lifetime.<br/><br/>Outside the human settlements, danger is everywhere.<br/><br/>The further from the city, the more dangerous it becomes.<br/><br/>To reach another city more than two thousand miles away, even a Nascent Soul Cultivator would face great risks.<br/><br/>In the wilderness, Nascent Soul Stage strange creatures, though not ubiquitous, are absolutely not rare. As one ventures farther out, the odds of encounter increase.<br/><br/>However, for a Celestial Being, such danger is insignificant.<br/><br/>What Tang Yue lacks in other aspects, he makes up for in an array of spell scrolls. With a high-level disguise scroll, he wouldn’t have to worry about being detected by Nascent Soul Stage creatures.<br/><br/>The two set off in the direction of Sky Star City.<br/><br/>Along the way, Gu Yang encountered many strange creatures. This world seemed to have become a playground for them.<br/><br/>He was curious about how these creatures managed to maintain their existence.<br/><br/>These creatures should be considered a kind of alternative life form, right? Since they exist, they must consume energy. But how do they replenish the energy they use?<br/><br/>Then he thought of Xu Tianxing who had just fled.<br/><br/>That guy didn’t have a disguise scroll. If he had flown away so conspicuously, who knows how many strange creatures he would have drawn to him. If he didn’t have a way to deal with them, he would have a lot of trouble.<br/><br/>Two thousand miles was not a long distance for a Celestial Being.<br/><br/>In no time, Gu Yang felt an immense terrifying power, triggering intense jealousy within him.<br/><br/>However, he easily suppressed this feeling.<br/><br/>No one in this world was worth his jealousy, there was absolutely nothing about Tang Yue, who was beside him, that he envied.<br/><br/>Tang Yue, on the other hand, had a bigger reaction, but he was trying his best to keep it under control.<br/><br/>A moment later, Gu Yang finally caught sight of Sky Star City. Countless strange creatures were densely packed in front of the city’s barrier, gnawing at it, creating a horrible sight.<br/><br/>He quickly identified the target, a humanoid creature, a woman dressed in palace clothes, her attire was extremely beautiful.<br/><br/>Her red eyes could stir up the deepest feelings of jealousy in people.<br/><br/>Tang Yue next to him was obviously affected, his body trembling uncontrollably, looking like he was on the brink of losing control.<br/><br/>No wonder the Divine Cultivators of this world were unable to deal with these Divine-Stage strange creatures. Just getting close to them was affecting him so severely. How could they even launch an attack?<br/><br/>The special traits of these creatures meant they didn’t need to worry about being ganged up on. No matter how many people came, the impact on each of them would be the same.<br/><br/>There was no case of having an extra person to share the pressure.<br/><br/>Just like right now, it was already good enough if Tang Yue didn’t hold him back.<br/><br/>Gu Yang had yet to get near when he already took out the Human Emperor Sword from his Beast-taming Space.<br/><br/>At the same time, a hint of dissatisfaction came from the Human Emperor Sword.<br/><br/>“Whatever it is, we’ll discuss after we deal with this.”<br/><br/>He took off and in a blink crossed a distance of several miles. He slashed his sword at the humanoid creature.<br/><br/>It didn’t dodge at all, allowed the sword to fall on it, splitting it in half.<br/><br/>PS: The third update, please vote for me.\t\t\t\t\t\t</div>", "images": {}, "success": true}