{"id": 391, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132383.html", "title": "Chapter 391 - Chapter 391: 391 Kills", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 391 - Chapter 391: 391 Kills</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 391: 391 Kills<br/><br/>When Gu Yang took out the Human Emperor’s Sword from the Beast-taming Space, he felt it was very different from usual. A strong emotion of anger was being transmitted from the sword.<br/><br/>Why was it angry?<br/><br/>He was a bit curious, but mostly delighted. The unleashing of the Human Emperor’s Sword was advantageous for him.<br/><br/>The might of the Jade Dew Divine General was formidable; all those experienced Celestial Beings had been defeated by it, and he was not that confident.<br/><br/>Despite this, he evidently won in the recent simulation, thus obtaining a flat peach.<br/><br/>Now, he understood why he’d won.<br/><br/>The Human Emperor’s Sword was in full swing!<br/><br/>A supreme surge of sword intent radiated from the Human Emperor’s Sword. The power it unleashed this time was much more formidable than the last time in the Water Moon Cave.<br/><br/>At this moment, an invisible ripple blanketed him, intending to teleport him elsewhere.<br/><br/>The sword intent from the Human Emperor’s Sword began to vibrate, breaking through this ripple.<br/><br/>The teleportation failed.<br/><br/>The Jade Dew Divine General on the opposite side disappeared, leaving only him standing alone.<br/><br/>“So intense?”<br/><br/>Gu Yang was somewhat shocked. The power of the Human Emperor’s Sword was indeed overwhelming– it could even directly break the Prohibition of the Yao Chi Immortal Palace.<br/><br/>…<br/><br/>Upon witnessing this, Master Sichen and Lu Ying in the main seat immediately confirmed– it was the Human Emperor’s Sword beyond doubt.<br/><br/>Although it had not fully recovered to the strength it had in ancient times, the power it had demonstrated should not be underestimated.<br/><br/>It was unclear what had transpired over these 8000 years, but someone had managed to restore the Human Emperor’s Sword.<br/><br/>The two of them knew well why the Human Emperor’s Sword was so reactive– the key was the Jade Dew Divine General.<br/><br/>In the Yao Chi Immortal Palace, there was a core group comprising the nine disciples under the Palace Master.<br/><br/>Then, there were cultivators like Master Sichen who joined the palace to serve it.<br/><br/>Apart from them, there were two more systems.<br/><br/>The first was palace maids who were similar to maid servants. Despite being maids, each one of them had a cultivation level surpassing that of a Human Immortal.<br/><br/>Second, were divine generals who did chores and maintained appearances.<br/><br/>These two categories could be considered servants and subordinates.<br/><br/>Maids relied on their own cultivation, and the Yao Chi Immortal Palace was a real Immortal realm. No matter how poor one’s natural talent was, if they stayed there long enough, they could also attain the Human Immortal realm.<br/><br/>Divine generals, however, were different. Their strength came from the approval of the Palace Master and was related to divine power.<br/><br/>What the Human Emperor’s Sword hated the most was divine power.<br/><br/>In the past, the third-generation Human Emperor, Gold Emperor, studied the power of divinity. This caused the Human Emperor’s Sword to abandon them. The Human Emperor system that the human race had established for tens of thousands of years collapsed.<br/><br/>The fragmentation of the human race began from then.<br/><br/>Afterwards, immortals and gods separated from the human race and no longer acknowledged the rule of the Human Emperor.<br/><br/>Hence, each Human Emperor sought to destroy divine power, creating tens of thousands of years of warfare and bitter animosity between the two sides.<br/><br/>Divine power was useful, and one could achieve quick results. Life and death were within the thoughts of the Divine Lord, making them much easier to control than cultivators.<br/><br/>Many experts liked to use it as it was convenient.<br/><br/>The Jade Dew Divine General was created using divine power.<br/><br/>Considering the disdain and hostility of the successive Human Emperors towards divine power, it was not surprising that the Human Emperor’s Sword was provoked by the Jade Dew Divine General.<br/><br/>…<br/><br/>At this moment, the Jade Dew Divine General emerged from the space.<br/><br/>“Kill!”<br/><br/>A dense murderous intent was transmitted from the Human Emperor’s Sword. Gu Yang felt an unprecedented strong power and was a bit surprised.<br/><br/>Was this necessary?<br/><br/>The Human Emperor’s Sword was burning its destiny to kill its opponent, revealing its true power.<br/><br/>Zhanxuan Swordsmanship, second move, Godslayer!<br/><br/>Gu Yang showed no mercy and slashed out with his sword.<br/><br/>“Stop!”<br/><br/>Noticing something was off, Lu Ying promptly shouted.<br/><br/>…<br/><br/>Gu Yang felt as if the surrounding space had been sealed off. He was firmly confined, preventing him from making that slash.<br/><br/>Useless!<br/><br/>A unique sword intent resonated within the Sword of the Human Emperor, instantly shattered the shackles and the sword had already fallen.<br/><br/>Couldn’t dodge in time!<br/><br/>A trace of fear and despair flashed in the eyes of General Yulu. He was as if having been shocked, he became stiff and failed to react at all.<br/><br/>The next moment, his gaze dimmed. A streak of blood appeared on his forehead and he was split in half. Starting from the wound, he turned into dust and in a blink of an eye, he has completely disappeared into the air.<br/><br/>…<br/><br/>“Is he dead?”<br/><br/>The people present were all taken aback, and they were so shocked they couldn’t speak.<br/><br/>Had that mighty existence which suppressed all the Celestial Beings present just been killed by a single strike from Gu Yang?<br/><br/>Especially the ten Celestial Beings; they had personally experienced the terrifying strength of General Yulu. Now seeing him die just like that, they felt a strong sense of disbelief.<br/><br/>Everyone’s eyes fell on the Sword of the Human Emperor in Gu Yang’s hand.<br/><br/>In those eyes, there was fear, excitement… and greed!<br/><br/>The fact that Gu Yang obtained the Sword of the Human Emperor was well known across the continent.<br/><br/>However, no one paid much attention to it. Not even Xia Emperor, who had unified the whole continent, could get recognized by the Sword of the Human Emperor, let alone Gu Yang.<br/><br/>However, no one expected that he could actually wield the power of the Sword of the Human Emperor.<br/><br/>This power was horribly strong, transcending the realm of Celestial Beings. Even mighty warriors like General Yulu could be killed in an instant, who else in the world could withstand this sword?<br/><br/>…<br/><br/>The smoke around Lu Ying trembled a few times, her fury reaching its peak.<br/><br/>Since she entered the Immortal Palace and became the ninth disciple of her master, General Yulu had been by her side, being her right-hand man. He was also the person she trusted the most.<br/><br/>Now he has been killed right in front of her, how could she not be furious?<br/><br/>Soon, the smoke around her calmed down.<br/><br/>She held a grudge. She needed to kill him to seek revenge.<br/><br/>However, she feared the sharpness of the Sword of the Human Emperor and was unwilling to take action personally.<br/><br/>What if he could strike another sword? She might not be able to defend against it.<br/><br/>“What a sword! The Sword of the Human Emperor!”<br/><br/>Lu Ying’s voice was exceptionally cold, “You just killed my subordinate right before me and perfunctorily moved on. Don’t you think you owe me an explanation?”<br/><br/>Gu Yang said innocently, “It was you who said that no one would die at the Yaochi Conference. I didn’t know that this sword strike would actually kill him. I’m not to blame, am I?”<br/><br/>Lu Ying was momentarily speechless because it was indeed what she had said.<br/><br/>People indeed would not die at the Yaochi Conference. Anyone who tried to kill would be hindered by the prohibitions.<br/><br/>However, who could have anticipated Gu Yang possessing the Sword of the Human Emperor now that the core of the Immortal Palace was in hibernation and the power of many prohibitions only remained at the level of immortal beings?<br/><br/>This remark left her no room to rebut.<br/><br/>Gu Yang continued, “You won’t go back on your word, will you? You said before that if someone defeated him, they would receive a flat peach. Now that I’ve won, where’s my peach?”<br/><br/>For a moment, Lu Ying felt her Daoist Heart was unstable, “He killed my subordinate and now has the nerve to ask me for a peach?”<br/><br/>The killing intent in her heart grew stronger.<br/><br/>“The peach will be sent over soon.”<br/><br/>The words she forced out through clenched teeth.<br/><br/>Since she had set the rules, she was not allowed to violate her own rules at the Yaochi Conference.<br/><br/>She had agreed that whoever defeated General Yulu would receive a flat peach, and she must deliver on that.<br/><br/>Then, Lu Ying noticed that the Sword of the Human Emperor had receded its sharpness. She asked, “Do you know the weakness of the Human Emperor’s Sword?”<br/><br/>As for the weakness, it was that the sword was not always trustworthy, sometimes it obeys orders, sometimes it doesn’t.<br/><br/>Gu Yang thought this but didn’t say it out loud.<br/><br/>Lu Ying continued on her own, “The Sword of the Human Emperor, can slay both monsters and immortals, possesses limitless power, and is not inferior to any innate spiritual treasure.”<br/><br/>“However, when it confronts the Human Race, it cannot exert its full strength. In ancient times, the Human Emperor died at the hands of human traitors. After Emperor Fu succeeded to the throne, he painstakingly refined the Nine God Tripods, in order to avoid repeating the fate of the Human Emperor.”<br/><br/>Suddenly, Gu Yang felt several malicious gazes shooting over from the side, each filled with deep hostility.<br/><br/>This woman is too vicious, isn’t this the same as inciting others to kill him?<br/><br/>At this moment, a woman who looked like a maid came out holding a plate. On it was a ripe peach.<br/><br/>This was the flat peach that was legendary among the immortals!<br/><br/>P.S: Seeking for monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}