{"id": 394, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132389.html", "title": "Chapter 394 - Chapter 394: 394 Glimmer Of Hope", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 394 - Chapter 394: 394 Glimmer Of Hope</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 394: 394 Glimmer of Hope<br/><br/>“This Celestial Being level monster has been specifically lying in wait for me, hasn’t it?”<br/><br/>Feeling the terrifying power that was enough to affect his emotions, Gu Yang found himself a bit apprehensive.<br/><br/>Last time, after he nearly cleared this area of all monsters, he encountered a Celestial Being level one during a simulation. He died on the spot.<br/><br/>This was rather unreasonable.<br/><br/>Logically speaking, after clearing this area of monsters, it would take some time for the monsters from the outside to wander in and fill the void, then give birth to powerful monsters.<br/><br/>This should have been a rather lengthy process.<br/><br/>However, it hadn’t been long before a Celestial Being level monster appeared here.<br/><br/>Where did it come from?<br/><br/>Why is it that it only appeared after I cleared all the monsters in this area?<br/><br/>This couldn’t just be a coincidence, could it?<br/><br/>From this Gu Yang had a bold thought, maybe this Celestial Being monster came here only upon discovering that all the monsters in this area had been wiped out. To eliminate the threat that wiped out the monsters?<br/><br/>If that’s true, then the monsters are more terrifying than he had imagined.<br/><br/>These monsters had been around for several hundred years, and it’s unknown whether any Ruin Realm monsters had emerged.<br/><br/>In many simulations, once monsters invaded the human realm, within a decade or so, Ruin Realm monsters would be born.<br/><br/>Thinking about this, Gu Yang felt it was better to play it safe.<br/><br/>As he was thinking, that Celestial Being monster appeared right before his eyes.<br/><br/>This time, what he saw was not a head, but a person.<br/><br/>It was a woman dressed in a Daoist robe, carrying a sword on her back. She was clearly a cultivator, still maintaining her appearance from when she was alive. Only her eyes were pitch black.<br/><br/>Upon laying eyes on those pitch black orbs, his heart filled with an uncontrollable hatred. Thinking back to the simulation where he was killed by the monster in front of him, he wanted nothing more than to charge over and smash it into dust.<br/><br/>Just one look can make a person lose control.<br/><br/>“Don’t look into its eyes!”<br/><br/>At that moment, a loud shout sounded, resounding like a giant bronze bell, shaking one’s heart.<br/><br/>…<br/><br/>Xu Tianxing, who was chasing from behind, was also affected, almost falling into a hateful emotional state. Jolted awake by that shout, he broke into a cold sweat.<br/><br/>What the hell is that thing?<br/><br/>Can it actually directly influence his Daoist Heart, giving rise to his inner demon, just like the rumored other-worldly celestial demons?<br/><br/>In ancient times, these other-worldly celestial demons were a test that every Immortal Cultivator had to face. Those with unstable Daoist Hearts were easily exploited by these inner demons, ultimately leading to their deaths.<br/><br/>However, today’s Martial Arts practitioners no longer need to face such a test. These other-worldly celestial demons are just the stuff of legend, no one has ever encountered one.<br/><br/>Having encountered this thing for the first time, Xu Tianxing was wary and instinctively slowed down.<br/><br/>Yet, he saw Gu Yang maintaining his speed, flying towards that eerie thing.<br/><br/>For a moment, he was a bit shaken.<br/><br/>Should I chase or not?<br/><br/>If I don’t chase, I resent the idea of letting the peach within reach fly away.<br/><br/>If I do, that weird thing is too eerie, and he had no confidence about it.<br/><br/>Xu Tianxing was born in the most prosperous period of the Xia Dynasty when the Xia Emperor had absolute power, with everyone having to submit to him.<br/><br/>Those who didn’t accept this were all swept into the trash heap of history.<br/><br/>He was able to cultivate step by step to the Celestial Being realm in such an environment, becoming one of the Xia Emperor’s most capable subordinates. He was no ordinary man.<br/><br/>Moreover, upon the emergence of the Four Great Sacred Lands, realizing their strength, he made a decisive choice to feign death and escape.<br/><br/>Such judgment and decisiveness are the main reasons why he has been able to safely survive until now.<br/><br/>Now, Xu Tianxing just took one look and determined that this strange existence was not to be meddled with, and it’s best to stay as far away as possible.<br/><br/>While he was hesitating, the Celestial Being powerhouse behind him made a move. A talisman flew out, transforming into a black cage in the air, trapping the eerie woman.<br/><br/>“This Heavenly Prison can only trap it for ten breaths time, go quickly.”<br/><br/>The tone of the Celestial Being who had assisted was somewhat urgent.<br/><br/>Talismans?<br/><br/>Xu Tianxing was taken aback.<br/><br/>In Divine State, the art of Talismans had been long lost. During the Xia Dynasty, some people still cultivated them. Later, with the near extinction of the Monster Race on the Divine State continent, and the loss of monster blood as a raw material, the basis for their existence was also lost.<br/><br/>He didn’t expect that in this hole world, there would still be such a profound Dao of talismans.<br/><br/>Just one talisman, capable of trapping a Celestial Being, even if only for ten breaths of time, was terrifying.<br/><br/>…<br/><br/>…<br/><br/>“There really are Celestial Being powerhouses in this world.”<br/><br/>Seeing the unfamiliar Celestial Being take the initiative to assist, Gu Yang was rather surprised.<br/><br/>The restrictions on the cultivators of this world are far more severe than those of the Unleaking realm.<br/><br/>Unleaking realm martial artists consume their lifespan when they take action.<br/><br/>It’s nearly the same with the cultivators of this world, after using up their mana, they absorb the vitality of heaven and earth to recover, unwittingly inhaling toxins into their bodies, undoubtedly committing slow suicide.<br/><br/>That’s why the cultivators here cherish their mana and True Essence exceedingly, to the point of being miserly, hoping to spend one unit of True Essence as if it were two.<br/><br/>The prevalence of Talisman Dao here is also for the same reason. Making talismans consumes the least mana, using the talisman as a carrier to unleash the greatest destructive power.<br/><br/>This unfamiliar Celestial Being, when faced with a Celestial Being level monster, was actually willing to assist, which was very rare.<br/><br/>However, for him, this was superfluous.<br/><br/>In the blink of an eye, Gu Yang had flown up to that strange entity, unsheathed the Emperor’s Sword and directly struck it with a slash.<br/><br/>…<br/><br/>…….<br/><br/>“No—!”<br/><br/>Not far away, Elder Tang, who was rushing over at top speed, saw this scene. He blurted out, wanting to stop it, but it was already too late.<br/><br/>The opponent’s sword had already broken the cage he had set up, releasing the apparition that had achieved the God Transformation stage.<br/><br/>It was over!<br/><br/>His heart was as cold as ice.<br/><br/>After hundreds of years, they had finally found someone who could freely move between the human realm and Yellow Springs. This gave him the hope of leaving this hellish world.<br/><br/>Yet, just after seeing a glimmer of hope, it was extinguished.<br/><br/>He found it hard to accept.<br/><br/>This apparition used to be an elder of the Falling Cloud Sect and the top female cultivator of Yellow Springs. She was incredibly powerful, but during a catastrophe, she turned into an apparition.<br/><br/>Even while she was alive, Elder Tang was by no means her match, let alone after she turned into this terrifying apparition.<br/><br/>The stronger the cultivator before death, the more horrifying they will be as a specter.<br/><br/>Even the Alliance’s leader had yet to kill any of those in the God Transformation stage.<br/><br/>On the contrary, countless cultivators in the God Transformation stage had been killed by apparitions over the years. After they died, they all turned into specters themselves.<br/><br/>This was a world of despair. Since the arrival of the specters, no new God Transformations had emerged for many years.<br/><br/>The power gap between humans and the specters was getting larger and larger, reaching a point where everyone became desperate. Even the most optimistic individuals lost their faith in defeating these specters.<br/><br/>The main reason the Four Directions Alliance hadn’t yet collapsed was because of the prestige of its leader, which was enough to suppress everyone else.<br/><br/>In addition, there was simply no safe place left in this world apart from the Alliance.<br/><br/>In such despair, Elder Tang was overjoyed to find a person from the human realm, and he even abandoned everything to stay and guard the desolate Huangmu City.<br/><br/>However, now, this glimmer of hope had also collapsed.<br/><br/>Under such roller-coaster emotions, his Daoist Heart was on the verge of breaking…<br/><br/>…<br/><br/>“Ignorant of his own impending doom.”<br/><br/>Xu Tianxing watched as Gu Yang, like a man possessed, charged towards that demonic entity. He could not help but feel relieved.<br/><br/>If Gu Yang wanted to court death himself, it would be for the best.<br/><br/>This boy was swift and agile in the sky, and he held the Emperor’s Sword. Xu Tianxing was always wary of him.<br/><br/>Now, if this boy was seeking death, that would save him quite a bit of trouble.<br/><br/>That eerie entity was clearly not a normal creature, and it probably had no interest in his relic. At that moment, he could easily grab that peach without lifting a finger.<br/><br/>This eerie creature was a tough one, even for him. In his view, Gu Yang was as good as dead for charging towards it.<br/><br/>“That same move again!”<br/><br/>Xu Tianxing recognized Gu Yang’s move immediately—it was the sword technique he had used to kill the Jade Dew Divine General during the Yaochi Conference.<br/><br/>However, its power was incomparable to the last time—it was miles apart, in fact.<br/><br/>“Could it be the Zhanxuan Swordsmanship?”<br/><br/>Suddenly, he remembered a sword technique—the Headmaster’s Zhanxuan Swordsmanship.<br/><br/>Although few had witnessed this technique, it was famous amongst the Celestial Beings.<br/><br/>In the entire Divine State, there were very few people that Xu Tianxing feared, and the Headmaster was undoubtedly one of them.<br/><br/>When he learned that the Headmaster had killed Lord Chi Ming’s incarnation, his first reaction was disbelief.<br/><br/>A young man with such terrifying power?<br/><br/>Later, even when he learned that the man had been heavily injured in the fight, Xu Tianxing still did not dare to underestimate him.<br/><br/>For more than a hundred years after that, under the dominant influence of the Headmaster, Lord Chi Ming was unable to invade the human realm.<br/><br/>Consequently, the Wu Family had to rely on the power of the Three Holy Sects to annihilate him—a feat they dared not even dream of in the past.<br/><br/>At this moment, Gu Yang’s sword had already slashed onto the head of the eerie woman, and a grimace of pain surfaced on her pallid face.<br/><br/>With a swish sound.<br/><br/>The Emperor’s Sword split her in two. No blood flowed out, and there were no organs inside her. She was just a mass of energy.<br/><br/>“Ah—”<br/><br/>A heart-wrenching scream rang out, causing Xu Tianxing’s mind to blank out for an instant.<br/><br/>By the time he reacted, he felt a chill in his heart.<br/><br/>In such a high-stake battle, even a momentary loss of consciousness, could lead to his death a hundred times over.<br/><br/>This spooky being was truly horrifying.<br/><br/>The next moment, he saw the entity being cleaved in two, both halves of its body rapidly dissolving until they vanished in the blink of an eye.<br/><br/>Only the sword that it had been carrying fell to the ground.<br/><br/>This—<br/><br/>Xu Tianxing could no longer sense the existence of that spooky being. He contracted his pupils, his heart filled with unspeakable horror.<br/><br/>Did it just die like that?<br/><br/>How could this be possible?<br/><br/>PS: This is the first update, three thousand words, kindly asking for monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}