{"id": 395, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132391.html", "title": "Chapter 395 - Chapter 395: 395 Four Directions Alliance", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 395 - Chapter 395: 395 Four Directions Alliance</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 395: 395 Four Directions Alliance<br/><br/>“Gone… it’s gone…”<br/><br/>Elder Tang stared at the place where the once greatest female cultivator had vanished with the wind, her presence entirely gone without a trace. He was stunned, hardly daring to believe his own eyes.<br/><br/>A Demi-god level anomaly… slain with a single sword strike?<br/><br/>He even thought that he was losing control, hallucinating in his last moments.<br/><br/>But that wasn’t right.<br/><br/>In the past, he had encountered Demi-god level anomalies. During the battle, he had teetered on the brink of losing control, but it hadn’t felt like this.<br/><br/>“Am I okay?”<br/><br/>Quickly recovering, he subconsciously touched his eyes; they had not undergone any strange transformations.<br/><br/>Confirming that he was not on the verge of losing control, he finally understood.<br/><br/>All of this was not a hallucination.<br/><br/>The anomaly had truly been slain by that man in white with a single sword strike.<br/><br/>Who in the world was he?<br/><br/>Elder Tang looked at the tall figure not far in the distance, the sword in his hand flickering with a dazzling light. His heart was filled with astonishment.<br/><br/>A Demi-god level anomaly was slain with a single strike of his sword.<br/><br/>Was this man a powerful being from the legendary Hollow Void Realm?<br/><br/>…<br/><br/>“Run!”<br/><br/>Just as Xu Tianxing was feeling shocked and confused, he saw Gu Yang turn his head and look at him. The chill in his eyes made Xu Tianxing’s heart shudder, and without any hesitation, he turned and ran.<br/><br/>The Streaming Light Sword transformed into a Sword Light and, in a blink of an eye, disappeared into the horizon.<br/><br/>…<br/><br/>“He sure can run fast.”<br/><br/>Gu Yang didn’t chase after him. Firstly, Xu Tianxing was slightly faster than him, and even if it was just slightly, he couldn’t catch up.<br/><br/>Secondly, even if he did catch up, it would be a tough battle.<br/><br/>He was able to slay a Celestial Being realm anomaly with a single sword strike because these anomalies were quite simple-minded, with straightforward and direct attack patterns.<br/><br/>His Zhanxuan Sword Technique was perfect for dealing with these pure energy beings.<br/><br/>Even a Celestial Being level anomaly would be reduced to ashes under his Godslayer move.<br/><br/>If his opponent was Xu Tianxing, striking down the former Supreme Sword Master of the world would not be an easy task. There would certainly be a bitter battle.<br/><br/>With the speed of his opponent’s Flying Sword, it was possible for Gu Yang to be counter-killed if he wasn’t careful.<br/><br/>If the two were to fight, the odds would be roughly 6 to 4.<br/><br/>He had the 6.<br/><br/>On the other hand, if Xu Tianxing encountered a Celestial Being level anomaly, he would be at a complete loss. Apart from fleeing, if he was cornered, he would most likely die a miserable death.<br/><br/>This was the restrain effect of Cultivation Techniques and Sword Techniques.<br/><br/>Gu Yang didn’t want to waste time chasing after Xu Tianxing, because there were easier anomalies to deal with here.<br/><br/>After he had slain the anomaly earlier, he had successfully obtained a fragment.<br/><br/>Just as he had guessed before, slaying a Celestial Being level power would yield a fragment.<br/><br/>If his guess was correct, these so-called fragments were likely fragments of the Dao.<br/><br/>He picked up the sword left behind by the anomaly, holding it in his hand.<br/><br/>It was a spiritual treasure, but it seemed to have been corrupted by the anomaly’s power. The sword blade had turned a pale color, identical to the face of the anomaly earlier.<br/><br/>He wondered whether the spirit within the weapon had also been corrupted into an anomaly.<br/><br/>[Fragment detected, Do you wish to extract it?]<br/><br/>Suddenly, a prompt appeared before Gu Yang’s eyes, bringing joy to his heart.<br/><br/>It turned out that fragments could be extracted from spiritual treasures too, what great news.<br/><br/>Without any hesitation, he said, “Yes.”<br/><br/>This sword was indeed a spiritual treasure, but with the corruption, he didn’t feel comfortable giving it to Su Qingzhen and the others to use.<br/><br/>[One fragment has been extracted, current fragment count: five.]<br/><br/>Gu Yang was overjoyed.<br/><br/>He hadn’t come to the wrong place indeed. For him, the easiest to deal with among the Celestial Being level powers were the anomalies of the Yellow Springs.<br/><br/>Of course, the deities from the Golden Court weren’t difficult to deal with either, but there were at most three Celestial Beings there, and killing all of them wouldn’t yield much.<br/><br/>When it came to quantity of Celestial Beings, the Yellow Springs held the most.<br/><br/>Moreover, he felt no guilt when killing these anomalies.<br/><br/>Once again, Gu Yang experienced the joy of his first visit to the Yellow Springs. Everywhere was a potential energy source for him.<br/><br/>“Greetings, Immortal.”<br/><br/>At this moment, Elder Tang respectfully greeted him.<br/><br/>“Immortal” was a term of respect for a Human Immortal, a ceremony from ancient times.<br/><br/>Actually, both of them were in the same realm, so there was no need for such formality.<br/><br/>But Elder Tang had personally seen Gu Yang slay a Demi-god anomaly in person, and regarded him as a powerful figure of the Hollow Void Realm. There was no way he would dare to be disrespectful.<br/><br/>Gu Yang gave the elder in front of him a once-over. Apart from one vertical pupil, he didn’t seem to have any other abnormalities.<br/><br/>Being a Celestial level being, his appearance was more normal.<br/><br/>However, he could sense the imbalance in the old man’s body, it was not the state a Human Immortal should be in.<br/><br/>Recalling how the elder had kindly warned him and even assisted him earlier, and how his attitude was quite friendly, he asked, “May I know your name, Daoist friend?”<br/><br/>Elder Tang respectfully replied, “This one is Elder Tang Yue from the Four Directions Alliance.”<br/><br/>The Four Directions Alliance?<br/><br/>Gu Yang once heard from Daoist Muhuang that the Yellow Springs world was the largest force, or rather, the final stronghold for mankind. It was said to house several Celestial Beings.<br/><br/>It seems that Daoist Muhuang’s information was correct. A single elder possesses the cultivation level of a Celestial Being, there must be a significant number of powerful Celestial Beings within.<br/><br/>And this is the state after enduring destruction from a peculiar creature for hundreds of years. Before the creature appeared, this world’s Celestial Beings must have been even more numerous.<br/><br/>The combined strength might even surpass that of Wanxiang and Star Luo Pocket Universes.<br/><br/>Of the few pocket universes Gu Yang knew, in terms of strength, the strongest undoubtedly was the Ruqin continent, which is Penglai Heaven. It’s also the only one that has repelled the invasion of Yao Chi’s Immortal Palace.<br/><br/>Then come Wanxiang and Star Luo Pocket Universes, where conservatively, the number of Celestial Beings are estimated to be in the double digits.<br/><br/>The Shuiyue and Golden Court Pocket Universes are at the bottom.<br/><br/>The Yellow Springs world is the most peculiar one. In terms of danger level, it tops the list.<br/><br/>Though the one with the most potential is the Golden Court Pocket Universe because Hollow Void cultivators can emerge here.<br/><br/>These thoughts flashed through Gu Yang’s mind as he said, “So, you are Elder Tang. Thank you for your warning.”<br/><br/>Tang Yue spoke somewhat apprehensively, “It is I who was presumptuous.”<br/><br/>He asked, “Did you come from Huangmu City?”<br/><br/>“Yes.”<br/><br/>“How did you end up in Huangmu City?”<br/><br/>Gu Yang was quite curious. Given the scale of Huangmu city, there shouldn’t have been a Celestial Being as its guardian.<br/><br/>Just a Nascent Soul would suffice.<br/><br/>Tang Yue immediately said, “To tell you the truth, I specifically waited here for you.”<br/><br/>“Oh?”<br/><br/>…<br/><br/>…<br/><br/>Huangmu City.<br/><br/>Gu Yang revisiting this old place, could not help but think of Han Feng, who had given him a swordsmanship inheritance. He turned to Tang Yue and asked, “Is Han Feng still in the city?”<br/><br/>Tang Yue answered, “Steward Han has received a reward from the alliance for his meritorious service and has been summoned by the Four Directions Alliance.”<br/><br/>Hearing that Han Feng did not die, he felt quite pleased.<br/><br/>That day, when Han Feng gave him the swordsmanship inheritance, he must have already resigned himself to death.<br/><br/>Without Daoist Huangmu, a Nascent Soul cultivator, it wouldn’t be easy for Huangmu City to survive in this dangerous world.<br/><br/>Unexpectedly, the situation has reversed. The arrival of a Celestial Being from the Four Directions Alliance is great news for both Huangmu City and Han Feng.<br/><br/>Of course, Han Feng was summoned by the Four Directions Alliance because of him.<br/><br/>Gu Yang knew Tang Yue’s purpose but remained non-committal.<br/><br/>Out of responsibility to Great Zhou, he could not allow people from the Yellow Springs world to go there.<br/><br/>If one of them were to lose control and turn into a peculiar creature, it would spell a disaster for the entirety of Great Zhou.<br/><br/>He had already released the peculiar creatures of the Yellow Springs world into Great Zhou multiple times in the simulations. But that was only in the simulation, he would never do such a thing in reality.<br/><br/>Having lived in Great Zhou for several years and getting to know so many people, forming bonds that could not be easily broken, he didn’t want to see Great Zhou get ruined because of him.<br/><br/>But, Gu Yang did not reject Tang Yue either. He still had a use for him.<br/><br/>“Senior!”<br/><br/>As Gu Yang and Tang Yue entered the city, a soldier at the gate suddenly shouted excitedly.<br/><br/>Looking over, Gu Yang recognized a familiar face and smiled, “It’s you.”<br/><br/>This was Wei Hu, whom he encountered upon first entering the Yellow Springs world.<br/><br/>At that time, Wei Hu was herb picking outside the Black Abyss Valley when he was attacked by a peculiar creature. Gu Yang saved him.<br/><br/>More than a year had passed and Wei Hu’s cultivation had improved, roughly corresponding to a Third Rank cultivation level.<br/><br/>Seeing that Gu Yang still remembered him, Wei Hu was even more excited, praising from the bottom of his heart, “Senior, you are as brilliant as ever, as if you are among immortals.”<br/><br/>Seeing him, Gu Yang suddenly thought of the fair-skinned youth from the Shuiyue Pocket Universe. Both were the first people he encountered in their respective pocket universes, but their circumstances couldn’t have been more different.<br/><br/>The fair-faced youth from the Shuiyue Pocket Universe was the main character of that world, his cultivation skyrocketed like it was propelled by a rocket.<br/><br/>Compared to that, this Wei Hu was quite pitiful. Up until now, he is still in the Mortal Realm.<br/><br/>A thought crossed Gu Yang’s mind, and he took out a bag of spirit stones from his Beast-taming Space and threw them over, saying, “Keep up the good work.”<br/><br/>This were pieces of the spoils he got from the Shuiyue Pocket Universe, a dozen or so low-grade spirit stones which were not suitable for charging up energy. He decided to keep them as souvenirs.<br/><br/>Perfect for giving away. After all, he didn’t need this, nor did the women around him.<br/><br/>Wei Hu received it, looked inside, and a look of ecstasy spread over his face. He knelt down at once and said, “Thank you for your generous offering, senior.”<br/><br/>When he looked up, he saw that the senior was already walking away. He knocked his head on the ground a few more times as a sign of respect.<br/><br/>This bag of spirit stones would take him at least fifty years without eating or drinking to save up. Even though these are low-grade spirit stones, he had never seen such quality before.<br/><br/>There wouldn’t be a second one like it in the entire Huangmu City.<br/><br/>When Wei Hu got up, he found that the eyes of his colleagues were filled with envy and jealousy. For a moment, he felt that the bag of spirit stones in his hand was somewhat hot.<br/><br/>He quickly took a leave of absence from his captain and ran all the way home.<br/><br/>…<br/><br/>…<br/><br/>Gu Yang didn’t really invest much thought in the act. He followed Tang Yue all the way to the city lord’s mansion.<br/><br/>The city lord’s mansion had changed greatly. Tang Yue had rebuilt it and set up quite a few formations.<br/><br/>These formations seemed to have the function of filtering out the toxins in the vitality of heaven and earth. Within the mansion, the vitality of heaven and earth felt much purer, and the toxicity was reduced to an acceptable level.<br/><br/>“I wonder how many peculiar creatures there are in this pocket universe that have reached the cultivation level of Godslayer?”<br/><br/>After sitting down, Gu Yang casually asked the question that concerned him the most.<br/><br/>PS: The second update is asking for monthly tickets. The next update will be out before one o’clock.\t\t\t\t\t\t</div>", "images": {}, "success": true}