{"id": 392, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132385.html", "title": "Chapter 392 - Chapter 392: 392 World Sword Master", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 392 - Chapter 392: 392 World Sword Master</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 392: 392 World Sword Master<br/><br/>Upon the palace maid walking towards Gu Yang with the peach, a tantalizing sweetness flooded his nostrils, reaching his Original Spirit.<br/><br/>A single sniff felt like it could nourish his spirit.<br/><br/>A deep desire, unlike any he had felt before, grew within his Original Spirit. It was a longing to devour the peach in one gulp.<br/><br/>He swallowed, reigning in his impulse.<br/><br/>To eat it just like that would be wasteful.<br/><br/>He withdrew a jade box from his Beast-taming Space and placed the peach carefully inside it. Upon closing the lid, the alluring fragrance was immediately trapped within.<br/><br/>The box, a spoils of war, had been taken from some foe. There were many such trivial things in his Beast-taming Space.<br/><br/>If they couldn’t be replenished and could likely come in handy, he kept them.<br/><br/>This jade box, specifically, appeared to be designed for storing rare treasures or sublime elixirs.<br/><br/>Gu Yang placed the box snugly in his Beast-taming Space. He then scoped around the room and noticed numerous envy-stricken eyes upon him. He didn’t quite understand their intentions.<br/><br/>He was completely undaunted. Of all the people in the room, the only ones he truly feared were the three from Three Holy Sects.<br/><br/>However, they were all Great Saints of the Monster Race, the enemies of the Human Emperor’s Sword. If they were to truly attack him, the sword being the way it was, would likely lend him its power.<br/><br/>As for the others…<br/><br/>He wondered who had the audacity to bring trouble to his doorstep.<br/><br/>Gu Yang glanced at the prompt he had seen earlier. “Acquired two fragments, the current number of fragments: three.”<br/><br/>This message appeared after slaying the Jade Dew Divine General.<br/><br/>Clearly, slaying Celestial Beings could yield fragments.<br/><br/>He wouldn’t hunt others down without reason.<br/><br/>But if others provoked him, he wouldn’t show mercy either.<br/><br/>…<br/><br/>Lu Ying saw the smug satisfaction on Gu Yang’s face. Despite her Daoist Heart being pure and transparent, she was still put off.<br/><br/>A single flat peach meant nothing to her.<br/><br/>But the fact that it was snatched by this little squirt irked her.<br/><br/>She said dismissively, “Congratulations. This is a thirty-thousand-year-old peach that can extend your life by a thousand years.”<br/><br/>At this point, she noticed the eyes of the Celestial Beings around her change, filling her with a certain sense of gratification.<br/><br/>If this youngster had eaten the peach right away, there would not be much she could do. But since he had chosen to keep it and everyone witnessed that…<br/><br/>She didn’t believe that there wouldn’t be someone harboring other ideas.<br/><br/>From her observation, a few of them were running out of time. They wouldn’t be able to resist the temptation of a life-extending peach.<br/><br/>At the brink of death, they might do anything unexpected.<br/><br/>Staring at Lu Ying, Gu Yang was certain that for some reason, she either couldn’t, or was not allowed to kill him in the Immortal Palace.<br/><br/>Otherwise, she had no reason to incite the Celestial Beings around her.<br/><br/>She was trying to instigate others.<br/><br/>As Gu Yang was about to speak, a sudden tremor shook the ground, ripples disturbing the once quiet lake.<br/><br/>Then, a terrifying wave of energy rolled out from a certain direction, causing his heart to flutter, “What kind of power is this?”<br/><br/>The others sensed it too, their eyes following the energy wave.<br/><br/>“Ladies and gentlemen, we should wrap things up for today. Please make your way back.”<br/><br/>All of a sudden, Master Sichen spoke.<br/><br/>Gu Yang realized that Lu Ying, who previously sat opposite him, was now nowhere to be seen.<br/><br/>Clearly, something had happened in the Yaochi Immortal Palace.<br/><br/>He couldn’t help thinking of the mysterious old man. This was undoubtedly his doing.<br/><br/>The next moment, he was enveloped by a force.<br/><br/>This time, the Human Emperor’s Sword seemed indifferent. With a swish, Gu Yang was teleported away.<br/><br/>…<br/><br/>As soon as Gu Yang stepped out of the Yaochi Immortal Palace, he promptly invoked the Phoenix’s Divine Power and fled at top speed.<br/><br/>Although a Celestial Being, there were ten of them, and he had no intention of battling them all simultaneously.<br/><br/>To divide and conquer was far superior.<br/><br/>When it came to flying, few could match the Phoenix’s speed—<br/><br/>“You can’t escape!”<br/><br/>A voice rang out from behind, merely twenty-odd kilometers away.<br/><br/>A transparent sword light was soaring forwards, its user riding the sword. His speed was somehow a tinge faster, “Give me the flat peach, and I will spare your life!”<br/><br/>Gu Yang recognized the man. He was seated diagonally opposite him, the third one on the right. This indicated he was amongst the top half of the eleven Celestial Beings present.<br/><br/>Gu Yang didn’t know anything more about him.<br/><br/>His rise had been so rapid, he had limited exposure to Celestial Being powerhouses.<br/><br/>Aside from the Three Holy Sects and the headmaster, he had no contact with any other Celestial Beings.<br/><br/>Even Luo Wang’s identity was a mere guess of his.<br/><br/>There were also two Celestial Beings from the Barbarians of the plains identifiable by their clothing.<br/><br/>As for the other three, he was utterly clueless about their origins, wondering if they came from the Four Great Sacred Lands.<br/><br/>Gu Yang scorned, “Don’t you want the Human Emperor’s Sword?”<br/><br/>The man behind retorted, “I have no interest in the Human Emperor’s Sword. But if you don’t know better, you won’t only fail to protect the peach and the sword, but your own life will be at stake too. Think it through!”<br/><br/>“Sword Palace?”<br/><br/>Suddenly, Gu Yang guessed the identity of the other party.<br/><br/>In the world, the only ones who would not be interested in the Human Emperor’s Sword were people from the Sword Palace.<br/><br/>Xu Ruomei once mentioned to him about the rules of the Sword Palace. Every disciple, when they joined, would have to choose their own sword in the palace. Once chosen, it could not be changed again.<br/><br/>This was a mutual selection process, in which both the person chose the sword, and the sword chose the person.<br/><br/>She was chosen by the Dust Sword, one of the most important six divine swords in the Sword Palace, during her initiation. She had become the heir to the Dust Sword, and once she broke through to the realm of Divine Power, she would become the lord of the Dust Sword Palace.<br/><br/>Every disciple of the Sword Palace had only one sword for their entire lifetime, which showed extreme dedication.<br/><br/>Only they could claim to be uninterested in the Human Emperor’s Sword.<br/><br/>Among the six major sects, the Sword Palace and the Dao Sect had the longest histories, both existed since the Xia Dynasty. They could be considered the truly indigenous sects.<br/><br/>In the Xia Dynasty, the Sword Palace was a department in the imperial court, and its leader was bestowed by the Xia Emperor as the Master of All Swords in the world.<br/><br/>After the collapse of the Xia Dynasty, the Sword Palace managed to survive on its own.<br/><br/>Over the past thousands of years, disciples of the Sword Palace of the Divine Power realm rarely ventured into the world, and they avoided meddling in worldly affairs, adding to their mystique.<br/><br/>But wait, when did the Sword Palace produce a new Celestial Being strongman?<br/><br/>There was once a Celestial Being in the Sword Palace, who was the one ennobled by the Xia Emperor as the Master of All Swords. According to the legends, he was the first one to die in battle after the Four Great Sacred Lands appeared.<br/><br/>Since then, no Celestial Being strongman had appeared in the Sword Palace.<br/><br/>These were all told to him by Wu Er.<br/><br/>…<br/><br/>“Sword Palace, Xu Tianxing!”<br/><br/>The Celestial Being strongman behind him said arrogantly, “Now that you know my name, you should be aware that in front of me, you stand no chance.”<br/><br/>Xu Tianxing?<br/><br/>He was indeed the one who had been bestowed upon by the Xia Emperor to be the Master of All Swords in the world.<br/><br/>Gu Yang was astonished, “Haven’t you already died?”<br/><br/>Seeing that Gu Yang had no intention of handing over the flat peach, Xu Tianxing, who was following him, also stopped speaking…<br/><br/>Anyone capable of cultivating to the Celestial Being realm was a person of firm will and could not be easily swayed by words. Further discussion was a waste of breath.<br/><br/>“Where did this kid come from, and how could he receive the recognition of the Human Emperor’s Sword?”<br/><br/>Xu Tianxing was slightly puzzled.<br/><br/>For these years, he had been in seclusion in a certain pocket world, only returning once every fifty years.<br/><br/>A few days ago, he received a message from a disciple that an envoy from Yao Chi had sent an invitation, inviting him to attend the Yaochi Conference.<br/><br/>Upon hearing it was the Yaochi Conference, he immediately came out from his seclusion. After hearing the disciple’s description, he judged that this event was most likely real, and promptly headed to the coastal region of the North Sea.<br/><br/>As expected, he entered the legendary Immortal Palace of Yao Chi.<br/><br/>Unfortunately, he was unable to defeat the ancient Celestial Immortal and couldn’t obtain the legendary flat peach that could prolong life.<br/><br/>However, he still had a chance.<br/><br/>That youngster, using the power of the Human Emperor’s Sword, actually killed that ancient Celestial Immortal and obtained a flat peach.<br/><br/>If he could snatch that flat peach, he could prolong his life by a thousand years, providing ample time for him to break through to a higher realm.<br/><br/>He was already two thousand years old, and his life was nearing its end, but he had yet to make further progress in his cultivation.<br/><br/>The flat peach was his last hope. If he could not get the flat peach, within at most a hundred years, his end would come.<br/><br/>However, this kid was a bit difficult to deal with.<br/><br/>His Streaming Light Sword was known for its speed, and when it came to escape speed, no one in the world could compare with him.<br/><br/>Back then, it was by using this spirit treasure that he managed to escape alive from Lord Chi Ming.<br/><br/>Surprisingly, the flight speed of this kid was hardly slower than his.<br/><br/>He had never heard of such a prominent figure before.<br/><br/>“This will do!”<br/><br/>Xu Tianxing thought and felt a bit more at ease.<br/><br/>He was not the only one aiming for the flat peach. The Red Moon Great Saint and someone from the Star Sea were both determined to get the flat peach.<br/><br/>If given the chance, any Celestial Being in attendance would definitely make a move.<br/><br/>If he couldn’t take down this kid immediately, it would be troublesome if other people came in haste.<br/><br/>He was extremely confident in his strength. While he was not capable of dealing with the ancient Celestial Immortal, he could certainly handle an ordinary Celestial Being.<br/><br/>But, if several Celestial Beings teamed up and attacked him first, who was leading the way, he definitely wouldn’t be able to withstand it.<br/><br/>“Let’s shake off those people first.”<br/><br/>Xu Tianxing made up his mind, even slowing down a bit. He was not in a hurry to catch up with that kid, but to use his advantage in speed to shake off the Celestial Beings that were following.<br/><br/>“Eh, what’s wrong with the sky?”<br/><br/>At this moment, he noticed the anomaly in the sky. It had turned red, as if it was stained with blood.<br/><br/>He remembered something he had read in an ancient book, that had recorded such a phenomenon, and he suddenly gasped.<br/><br/>“When the sky turns red, calamity is at hand.”<br/><br/>Currently, wasn’t the sky dyed red?<br/><br/>Could it be that the disaster mentioned in the ancient book, which could engulf the entire human realm, was arriving?<br/><br/>…<br/><br/>On the other side, Gu Yang also had similar thoughts.<br/><br/>Since his breakthrough to the Celestial Being realm, he had not properly fought with anyone yet, so he had to be careful.<br/><br/>Besides, the person he was facing was the Master of All Swords, who had become famous worldwide more than a thousand years ago.<br/><br/>He had already thought of a battlefield in his mind. Then, he opened the system and initiated a simulation.<br/><br/>PS: Begging for monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}