{"id": 398, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132398.html", "title": "Chapter 398 - Chapter 398: 398 Earth Grade Spirit Treasure", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 398 - Chapter 398: 398 Earth Grade Spirit Treasure</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 398: 398 Earth Grade Spirit Treasure<br/><br/>[Obtained a shard. Current shard count: six.]<br/><br/>After Gu Yang had killed the Celestial Being monster, he mentally communicated with the Human Emperor’s Sword, “Thanks. ”<br/><br/>Then he put it back into the Beast-taming Space.<br/><br/>It was due to the Human Emperor’s Sword that he could easily kill a monster of the Celestial Being level. Without the amplification of this sword, his consumption of the Immortal Element would be at least thirty percent higher.<br/><br/>And also, he might not be able to kill that monster with a single sword stroke.<br/><br/>The power of the Human Emperor’s Sword had a natural counterbalancing effect on the monsters.<br/><br/>After the monster was killed, only one piece of rainbow-colored feather clothing was left behind. By the looks of it, it was not an ordinary item. He picked it up, and instantly a prompt appeared before his eyes.<br/><br/>[Shard detected, do you want to extract it?]<br/><br/>As expected, it was a Spirit Treasure. The fact that it could withstand the power degradation from a Celestial Being level monster and yet remain intact meant that it was not an ordinary Magic Treasure.<br/><br/>“Yes.”<br/><br/>[Extraction successful. Obtained a shard. Current shard count: seven.]<br/><br/>However, the matter wasn’t settled here.<br/><br/>Gu Yang looked up at the thousands, tens of thousands of monsters surrounding him, their crazed onslaught marching towards him.<br/><br/>Among these monsters, some had a Cultivation Level equivalent to the Nascent Soul; the majority were of Golden Core status. Although their individual Cultivation Levels weren’t high, the sheer number of them could be overwhelming. Harassed by the various negative emotions they projected, his Daoist Heart was under a hefty assault.<br/><br/>This was enough to annihilated any ordinary person.<br/><br/>Furthermore, killing these several thousand monsters was a taxing feat that could leave him utterly drained.<br/><br/>The most crucial point was that now he would gain nothing from slaying these low-level monsters.<br/><br/>He wasn’t willing to expend that sort of effort.<br/><br/>“Rise!”<br/><br/>He took out something from his Beast-taming Space. After infusing it with the power of the Immortal Element, he threw it out.<br/><br/>It was a picture which, upon being thrown out, enlarged continuously, subsequently opening up a black whirlpool that sucked in the surrounding monsters.<br/><br/>Spirit Treasure, the Underworld’s Picture!<br/><br/>He got it from killing an old man when he was in the Water Moon Cave Heaven. He kept this Spirit Treasure specifically to deal with these monsters.<br/><br/>Monsters and Wronged Ghosts were similar — both formed after the death of a person.<br/><br/>Previously, he learned from the Primordial Spirit of the Giant Spirit Hammer that the existence of monsters in the world was due to the leakage of the Underworld River into this world.<br/><br/>Indeed, it was a kind of ghostly creature.<br/><br/>The Underworld’s Picture was a Spirit Treasure specifically used for dealing with these ghostly wronged souls.<br/><br/>This Spirit Treasure was truly formidable, in mere moments, it swallowed up thousands of the monsters. The image on the Underworld’s Picture had taken on a chaotic color, appearing even more bizarre.<br/><br/>…<br/><br/>Not far away, seeing Gu Yang easily slay another God Transforming monster, Tang Yue finally relaxed.<br/><br/>With the general monsters left, it wouldn’t be so easy for them to break the city-protection formation. Sky Star City finally had a chance to catch its breath.<br/><br/>Once he returned to the city, he could take turns with Lord Sky Star to control the formation. They could hold on until the Four Directions Alliance sent reinforcements to eliminate all the monsters.<br/><br/>After that, they would move the entire Sky Star City away and rebuild the formation…<br/><br/>Tang Yue had already figured out how to handle the aftermath of the situation. Then he saw Gu Yang throw out a Magic Treasure. It transformed into a huge black shadow blocking out the sun before it absorbed a countless number of monsters.<br/><br/>“What is that?”<br/><br/>He was astounded.<br/><br/>What kind of magic treasure can even absorb monsters?<br/><br/>Even in Yellow Springs Cave Heaven, space-related Magic Treasures or even Spirit Treasures could not absorb monsters because they were devoid of a tangible form and were unaffected by the laws of space.<br/><br/>There were also some cultivators on the ghost path who were proficient in manipulating ghosts and refining souls.<br/><br/>But those who attempted to control monsters ultimately couldn’t take control and were instead controlled by monsters.<br/><br/>In every respect, humans had been defeated by monsters.<br/><br/>That’s right!<br/><br/>Suddenly, a flash of understanding crossed Tang Yue’s mind. He finally recalled a Spirit Treasure from the legends that was remarkably similar to the one before his eyes.<br/><br/>“Could it be… the Underworld’s Picture?”<br/><br/>No, that’s impossible.<br/><br/>The Underworld’s Picture was an Innate Spirit Treasure belonging to the realm leader who had once saved the Yellow Springs Cave Heaven, Master of the Yellow Springs Sect.<br/><br/>The ruler of Yellow Springs did protect this world with this Innate Spirit Treasure. The Way of Heaven was not completely shattered and was preserved to some degree.<br/><br/>However, after that encounter, the Underworld’s Picture was destroyed.<br/><br/>According to the rumors, the Realm Leader of Yellow Springs left Yellow Springs Cave Heaven to repair the Underworld’s Picture.<br/><br/>Still, whether or not Gu Yang’s Magic Treasure was the Underworld’s Picture, it certainly wasn’t an ordinary Spirit Treasure if it could devour monsters.<br/><br/>Tang Yue’s heart filled with increasing reverence.<br/><br/>…<br/><br/>…<br/><br/>In Sky Star City.<br/><br/>The sight of a man unleashing a treasure that devoured countless ghostly beings in a matter of moments left Lord Sky Star and his student speechless.<br/><br/>A single stroke of the sword slew a god; a magical map swallowed a myriad of spirits.<br/><br/>In no time, the swarm of thousands of ghostly beings outside the city was completely devoured by that magic treasure.<br/><br/>Faintly visible within that picture was a black flood dragon, leisurely swimming about, swallowing each of the ghostly beings one by one.<br/><br/>The picture then rolled up, shrank to a foot in size, and flew back into the man’s hand.<br/><br/>The scene happened so quickly that the master and student of Lord Sky Star barely had time to react. Staring at the now empty city gate, they felt like they had just woken from a dream.<br/><br/>Both of them could hardly believe that the impending destruction of the city was resolved by that man alone with his sword and map.<br/><br/>They have seen too much despair and had long stopped hoping for a savior to descend from the heavens.<br/><br/>Could they be hallucinating due to loss of control?<br/><br/>They both simultaneously had this thought.<br/><br/>At that moment, they saw a familiar figure appear in the mirror of light, flying to the man’s side and bowing to him.<br/><br/>“Is it… Elder Tang?”<br/><br/>The Nascent Soul student murmured.<br/><br/>Lord Sky Star, being at the God Transformation level, quickly confirmed his state through a secret method, his Daoist heart not on the verge of loss of control.<br/><br/>This meant what he had seen might not be a hallucination.<br/><br/>As he was deep in thought, he saw Tang Yue fly into the city protection array in the mirror of light and easily open the city gate.<br/><br/>Only Tang Yue and the two of them could open the city gate while the city array was activated.<br/><br/>If Tang Yue was real, then the man beside him would also be real.<br/><br/>Therefore, everything that just happened was definitely real.<br/><br/>The heart of Lord Sky Star began to race uncontrollably, a surge of excitement welled up, and his eyes became slightly moist.<br/><br/>Since the descent of the ghostly beings, he hadn’t seen such an exhilarating victory in many years.<br/><br/>Every encounter with the ghostly beings either led to disastrous failure or required sacrificial decoys to allow the majority to escape, and that was considered a good outcome.<br/><br/>Defeating a God Transformation ghostly being and annihilating thousands of them?<br/><br/>This was something they could only dream about.<br/><br/>Today, however, it happened right before his eyes.<br/><br/>The spirit of Lord Sky Star, which had turned to ashes, regained some vitality in this moment.<br/><br/>…<br/><br/>Following Tang Yue into Sky Star City, Gu Yang noticed that the city was much larger than Huangmu City, even larger than some of the cities in Great Zhou.<br/><br/>Yet, the streets were deserted.<br/><br/>However, he sensed that people were hiding inside the houses.<br/><br/>Each house was filled with many people. Not just one or two houses were like this, but all within his sensing range were the same.<br/><br/>The population density here was very high, far exceeding that of Great Zhou.<br/><br/>Soon, they reached the core area of the city.<br/><br/>Gu Yang then met the lord of the city, an elderly man.<br/><br/>The man possessed a celestial being’s cultivation level and though he seemed fine, he was in fact at the end of his life.<br/><br/>Tang Yue introduced him, “This is Lord Sky Star, the lord of Sky Star city. This is Daoist Master Gu.”<br/><br/>He did not mention Gu Yang’s background.<br/><br/>It was exactly as Gu Yang requested, that his background be kept a secret to everyone else.<br/><br/>Tang Yue understood the importance of this request, knowing that if others found out, it would be hard to prevent some kind of mania.<br/><br/>In all honesty, had he not directly witnessed Gu Yang’s strength, he would have been tempted to resort to force as well.<br/><br/>“Thank you, Master Gu, for your assistance. You saved the lives of hundreds of thousands in Sky Star City,” Lord Sky Star bowed solemnly. “I have nothing to offer in return but my Sky Star Sword and the legacy of Sky Star Pavilion.”<br/><br/>Saying this, he extended his treasured Sky Star Sword.<br/><br/>“Master——”<br/><br/>His student gasped in disbelief.<br/><br/>Even Tang Yue was shocked. This was the famous Sky Star Sword, an Earth Grade Spirit Treasure.<br/><br/>In the Yellow Springs, each celestial being has a spirit treasure, but most of them were at the Human Grade. Earth Grade Spirit Treasures were extremely rare. Only sects that have survived since ancient times possessed treasures of this level.<br/><br/>The Sky Star Sword had extraordinary significance for Lord Sky Star. It was the sect’s legacy treasure. He didn’t pass it to his student but instead was willing to give it to someone else.<br/><br/>…<br/><br/>Gu Yang was also surprised. This was the first time someone offered him a treasure upon meeting him.<br/><br/>Without hesitation, he accepted the sword and asked, “Do you have any last wishes?”<br/><br/>Having accepted the man’s gift, he felt compelled to reciprocate in some way.<br/><br/>PS: This is the second update. The third one will be up before one o’clock. Tickets please.\t\t\t\t\t\t</div>", "images": {}, "success": true}