{"id": 397, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132396.html", "title": "Chapter 397 - Chapter 397: Did 397 Die?", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 397 - Chapter 397: Did 397 Die?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 397: Did 397 die?<br/><br/>Within Sky Star City, Lord Sky Star was sitting at the core of the defense array. Besides him, several Nascent Soul cultivators were also within the array, all of them working together to maintain the city’s protection.<br/><br/>Suddenly, Lord Sky Star’s complexion turned white, and he coughed up a mouthful of blood.<br/><br/>Even so, he continued to pour his Immortal Element into the defense array without cease.<br/><br/>“Master!”<br/><br/>Next to him, a Nascent Soul cultivator cried out in distress, “Let it go, we can’t hold Sky Star City, the number of those eerie creatures is increasing. There is no reason to fear if we still have life left, let’s leave and return to the Alliance…”<br/><br/>Lord Sky Star, his face pale due to excessive exhaustion, remained expressionless, and said, “Everyone, it seems that we can’t hold Sky Star City much longer. We have all done our best. It’s time for everyone to save themselves.”<br/><br/>By then, it had already been five hours since the Celestial Beings’ eerie creatures besieged the city. The last of the spirit stone reserves in Sky Star City were also exhausted not long ago.<br/><br/>By now, the defense array could only be maintained by their Immortal Element and Mana.<br/><br/>However, no one could withstand such consumption.<br/><br/>Even Lord Sky Star, this God Transformation stage cultivator, had reached his limit. Not to mention the Nascent Soul cultivators present.<br/><br/>The Nascent Soul cultivators present never beat around the bush. They all stood up, bowed to Lord Sky Star, and then left.<br/><br/>This kind of painful parting was not the first time they had experienced it. They had no time for sorrow, only survival mattered, so as not to waste Lord Sky Star’s sacrifice.<br/><br/>“Master——”<br/><br/>Prior, the Nascent Soul cultivator wept, “Why won’t you leave?”<br/><br/>“Foolish child, my time is limited. Even if I flee this time, I won’t live much longer.”<br/><br/>Lord Sky Star looked at his only remaining apprentice and smiled, “It’s better to stay here, so that Sky Star City can preserve some sparks of hope. You should leave, don’t let the inheritance of our Sky Star Pavilion be severed.”<br/><br/>Sky Star Pavilion, once one of the top ten sects, had three real masters, and was greatly esteemed.<br/><br/>He was the youngest Celestial Being in the sect, regarded by his elders as the disciple with the highest potential in thousands of years to step into the Hollow Void stage.<br/><br/>The elders of the sect had high hopes for him. If he could attain the Hollow Void stage in the future, he could suppress the other nine sects and become the truly deserving strongest sect in Yellow Springs Celestial Land.<br/><br/>However, all of that was destroyed in this great disaster.<br/><br/>At that time, all three Celestial Beings of Sky Star Pavilion were in the sect. He stared directly at that terrifying existence and almost suffered a Daoist Heart collapse on the spot. It was only because his two masters fought to the death to send him away that he managed to escape death.<br/><br/>From then on, Sky Star Pavilion was destroyed, and the mountain gate became a dead land.<br/><br/>He changed his name to Sky Star, hoping the name Sky Star Pavilion would not be forgotten.<br/><br/>This Sky Star City was built by him alone, becoming a sanctuary in this despairing world.<br/><br/>Lord Sky Star, due to directly looking at the original eerie creature, suffered a Daoist Heart injury. In addition, the world’s Vitality became toxic, rendering him unable to further increase his Cultivation Level.<br/><br/>So, he placed all his hopes on the next generation and had taken more than a dozen disciples over the years.<br/><br/>In the end, almost all of his dozen disciples died, leaving only this last one who barely managed to achieve the Nascent Soul stage. The prospect of making further progress seemed highly unlikely.<br/><br/>In the current Yellow Springs Celestial Land, the environment is becoming increasingly harsh. Achieving Nascent Soul stage has already become extremely difficult, let alone making further progress.<br/><br/>Lord Sky Star could feel that even the Way of Heaven in this world was beginning to be corrupted by the eerie creatures.<br/><br/>When all the Way of Heaven becomes corrupted by the eerie creatures, that will be the day when this world completely becomes a Ghost Realm.<br/><br/>The reason why he chose to stay here and wait for death was that he could no longer see any glimmer of hope.<br/><br/>He was weary!<br/><br/>This Nascent Soul cultivator insisted, “No, I won’t leave. I will stay here with you.”<br/><br/>“Foolish child.”<br/><br/>Lord Sky Star reached out and patted his head, sighing inaudibly.<br/><br/>This world will eventually walk towards destruction.<br/><br/>He, his disciple, Sky Star Pavilion, and even the name Yellow Springs Celestial Land would be buried forever in this Ghost Realm.<br/><br/>Whether to run or not, it no longer mattered.<br/><br/>Lord Sky Star had already made up his mind. When the moment came that he could hold on no longer, he would destroy himself and then destroy his Original Spirit. This way he would avoid unintentionally becoming a monstrous creature.<br/><br/>On his knee rested the Sky Star Sword, the hereditary treasure of Sky Star Pavilion, a Earth Grade Spirit Treasure inherited from his master. He was ready to annihilate himself at any moment.<br/><br/>With a single strike, guaranteed his Mortal Body would be completely destroyed, leaving no trace whatsoever.<br/><br/>Lord Sky Star and his disciple focused their gaze on the light mirror in front of them, which showed the scene outside the city gate. There were thousands upon thousands of eerie creatures, slamming against the city’s protective array.<br/><br/>The Mana of these eerie creatures was laughably weak in comparison to cultivators of the same grade. They were also ignorant of any other magics, only capable of incessantly charging with their own bodies. One or two of them could never pose a threat to the city’s defensive array.<br/><br/>However, their numbers were far too great. There were already thousands of eerie creatures, with many more coming from all directions continuously.<br/><br/>Once their numbers reached a certain scale, the impact they could produce was horrifying indeed.<br/><br/>Among countless objects in the shape of human heads, a shadowy figure could be vaguely seen. It was the demonic monster that had reached the level of God Transformation.<br/><br/>This woman, he recognized her, she was Jade Fairy from the Burning Incense Valley.<br/><br/>When he was at the Nascent Soul stage, he had had some dealings with this Jade Fairy. However, they were both core disciples of the Sect, destined to inherit the Sect in the future, this relationship ended without any ailment in the end.<br/><br/>After that great catastrophe, Lord Sky Star never heard about her whereabouts again, suspecting that she had probably encountered a mishap.<br/><br/>Unexpectedly, he would meet her again several hundred years later, she had turned into a demonic monster, bringing catastrophic disaster to Sky Star City.<br/><br/>“Master, someone’s coming!”<br/><br/>Suddenly, his disciple beside him pointed towards the mirror of light, saying excitedly.<br/><br/>Lord Sky Star was stunned. On a closer look, indeed a figure appeared in the mirror of light, who had actually taken the initiative to rush into the horde of thousands of monsters.<br/><br/>“Who is this person?”<br/><br/>“What does he want to do?”<br/><br/>He was taken aback.<br/><br/>This man, he had never seen before.<br/><br/>The purity of the other party’s mortal body and the richness of his immortal elements were also rare to see nowadays.<br/><br/>Lord Sky Star even had a misconception, feeling like this man seemed to come from an era that was not yet contaminated.<br/><br/>How did he appear here? And why is he offering his help?<br/><br/>He actually rushed directly into the midst of the monsters. What’s the difference between this and seeking death?<br/><br/>The occurrence of this event was too quick, and quite bizarre.<br/><br/>There were countless questions in Lord Sky Star’s heart, but no one could answer them for him.<br/><br/>In the mirror of light, the man, holding a long sword in his hand, struck towards Jade Fairy who had turned into a demonic monster.<br/><br/>He had never seen such an attack method before. It was hard to imagine, what kind of person would fight the monsters closely, with a flying sword.<br/><br/>This sword strike was so rapid, and the speed was extremely fast. The Jade Fairy barely had time to react and was already divided in two.<br/><br/>It’s useless.<br/><br/>Watching this scene, Lord Sky Star had no joy in his heart.<br/><br/>The speed of the monsters definitely couldn’t be faster than the flying sword. If they could be killed in this way, the demonic monsters of the whole world would have been wiped out by them long ago.<br/><br/>The most fearful aspect of these monsters is that the attack of the flying sword had absolutely no effect on them.<br/><br/>Even if they were divided into numerous pieces and utterly destroyed by Immortal Methods, they could quickly recover without any damage.<br/><br/>The monster at the level of the God Transformation is immortal, which has almost become a consensus among the high-ranking members of the Four Directions Alliance.<br/><br/>It’s precisely because of this, humans were driven to such a desperate situation.<br/><br/>Anyone would feel desperate when facing such invincible monsters.<br/><br/>Lord Sky Star chose not to go out and fight against the demonic monster. He did not want to waste his power there, but to protect Sky Star City to the best of his ability, buy time, evacuate the citizens of the city, to preserve the spark of humanity, it is a better choice.<br/><br/>This fellow Daoist, who suddenly appeared from nowhere, probably didn’t know the terror of the monsters. In this way, he not only wasted the Immortal Elements in vain but also put himself in a dangerous situation.<br/><br/>Even if it’s a cultivator who has reached the God Transformation stage, it’s still terrifying to get caught in the siege of thousands of monsters.<br/><br/>“I have to save him.”<br/><br/>Lord Sky Star couldn’t just watch a cultivator at the level of God Transformation fall here. Besides, the other party came to help Sky Star City.<br/><br/>Just when he was ready to burn his last bit of origin power to repel those monsters, he suddenly sensed that something was wrong.<br/><br/>The monstrous figure that Jade Fairy had transformed into, after being cleaved in half, seemed to have a look of terror on her wooden face.<br/><br/>In an instant, her body was disintegrating and disappearing little by little, and in a blink of an eye, she vanished into thin air.<br/><br/>“What——”<br/><br/>A hint of bewilderment appeared on Lord Sky Star’s face.<br/><br/>What just happened?<br/><br/>Why did the monstrous figure at the level of God Transformation suddenly disappear?<br/><br/>The Nascent Soul beside him was also dumbfounded, his body uncontrollably shaking, seeming to be excited, yet also somewhat in disbelief, stuttering, “Master… Mas… Master… where’s the… monster?”<br/><br/>In the suffocating atmosphere, neither of them saw the child reappear.<br/><br/>Dead… dead?<br/><br/>This thought finally emerged in their minds.\t\t\t\t\t\t</div>", "images": {}, "success": true}