{"id": 393, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132387.html", "title": "Chapter 393 - Chapter 393: 393 Great Catastrophe Of Antiquity", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 393 - Chapter 393: 393 Great Catastrophe Of Antiquity</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 393: 393 Great Catastrophe of Antiquity<br/><br/>On the coast of the North Sea, the water presents a dark blue color. The deep-colored sea reflects the blood-red sky, as if it were soaked in blood.<br/><br/>Two figures, one green and one red, were hovering in the air. They were Qingyu Great Saint and Red Moon Great Saint of San Saint Door.<br/><br/>They looked up at the red sky, their expressions turning somewhat pale.<br/><br/>After a long while, the Red Moon Great Saint muttered, “It has appeared again, the blood sky—”<br/><br/>They had come together, and after leaving the Yao Chi Immortal Palace, they instantly locked onto Gu Yang’s location, intending to pursue him. But they saw the bloodstain in the sky and the blood-colored sky, which shocked them to the core.<br/><br/>In a moment of distraction, they completely lost track of Gu Yang.<br/><br/>The two had already ignored the affair of the peaches. Looking at the bloodstains in the sky sent chills down their spine.<br/><br/>There was no one in the Divine State land who knew better than they did about the horrors that could happen when the sky showed that bloodstain.<br/><br/>Both of them are part of the few tribes of the Monster Race, belonging to the category of wood spirits. Their cultivation was extremely slow, but they had one advantage—their natural lifespan was exceedingly long.<br/><br/>Especially for these two, they were not ordinary, having lived for over fifteen thousand years to this day.<br/><br/>After the collapse of the Way of Heaven, they were able to resist the erosion of time and live for such a long period; no other race but the Monster Race with wood spirits as the soul of their entity could do this.<br/><br/>They had personally experienced the great catastrophe a thousand years ago, and had witnessed the collapse of Way of Heaven, a scene of the simultaneous fall of all immortals.<br/><br/>In the past, the lofty immortals, Human Immortals, Earth Immortals, Celestial Immortals, and even the immortal Golden Immortals…died en masse.<br/><br/>The Immortal Palace in the sky also fell with them…<br/><br/>Such a scene was like the end of the world.<br/><br/>That one day was like today, with a bloodstain appearing in the sky, the whole sky seemed to have been dyed red with blood.<br/><br/>The only reason they survived the great catastrophe was that their cultivation level was still low then, reaching the Nascent Soul stage. They retreated to their original form and did not dare to reveal themselves. They were trembling in fear.<br/><br/>When everything was over, they unwittingly survived.<br/><br/>The second time the sky showed such a bloodstain was two thousand years later.<br/><br/>By then, they were already Human Immortals and were taken into the emperor’s command.<br/><br/>When the calamity returned, even the emperor fell.<br/><br/>Before the emperor’s fall, he sealed the entrance between the Heavenly Peace Land and the Human Realm, preserving the last bit of power of the Monster Race. About a dozen or so of the Monster Race with Human Immortal Realm.<br/><br/>As time passed, the surviving Monster Race members all passed away one by one, leaving only the three wood spirits in the Heavenly Peace Land.<br/><br/>In a flash, seven thousand years passed, and the gateway between the Human Realm and Heavenly Peace Land was opened by someone. The Human Realm had completely changed its appearance.<br/><br/>They had thought that everything was over.<br/><br/>But they never imagined that they would see this ominous celestial phenomenon again after eight thousand years.<br/><br/>This revived their deepest nightmares.<br/><br/>Fear had reached its pinnacle in their hearts.<br/><br/>A thousand years ago, there was a Human Emperor in the Human Realm, and in the Thirty-Three Heavens, there were Realm Lords, Immortal Sovereigns, Heavenly Emperors…<br/><br/>All those great abilities had perished in that catastrophe.<br/><br/>Eight thousand years ago, there were also the emperor and several other major powers at the forefront.<br/><br/>And now?<br/><br/>As the great catastrophe approaches, the ancient great talents have either fallen or disappeared. Who will resist this great catastrophe?<br/><br/>In the present Human Realm, how many Human Immortals are there in total?<br/><br/>In the entire Divine State land, the number of Celestial Beings, including them, is only over a dozen.<br/><br/>They are the ones with the highest realm and strongest power.<br/><br/>At this moment, the Red Moon Great Saint said faintly, “Sister Wutong, come out. The great catastrophe is at hand. Can we put our differences aside for now?”<br/><br/>Not far away, a figure appeared out of thin air. It was Saint Chao Yang. Her face was also somewhat pale. She gave a wry smile and said, “Does it make sense?”<br/><br/>Having said that, she immediately left.<br/><br/>The Red Moon Great Saint was silent.<br/><br/>Yes, does it make sense?<br/><br/>Would the three of them working together be able to resist the great catastrophe a few years from now?<br/><br/>…<br/><br/>Other Celestial Beings were also shocked by the strange sky.<br/><br/>Unlike the two Saints, they had not experienced it in person and did not know what kind of disaster this phenomenon would bring. Surprised as they were, they did not forget their main task and set off to track down Gu Yang.<br/><br/>Every Celestial Being would not give up on something like the peach, which could extend life by a thousand years.<br/><br/>Even if there was only a slim chance, they would not let it go.<br/><br/>However, the further they pursued, the further away they were from Gu Yang.<br/><br/>The speed was so fast that they could not catch up.<br/><br/>Soon, some people gave up and quietly left.<br/><br/>Yet a few others still did not give up and continued to pursue.<br/><br/>…<br/><br/>…<br/><br/>“The time is almost right.”<br/><br/>Xu Tianxing finally shook off all the tails behind him. For a short time, no one could catch up. He suddenly accelerated, gradually closing the distance between him and Gu Yang.<br/><br/>In reality, the speed difference between the two was trivial, and it was not an easy task to catch up in a short period.<br/><br/>But he had the patience.<br/><br/>Any warrior who cultivated from the Unleaking Realm to the Celestial Being Realm would not lack patience.<br/><br/>Before they knew it, they had reached the territory of Qi Province.<br/><br/>This was Luo Family’s territory.<br/><br/>The Luo Family did not have any Celestial Beings; the only one that needed to be worried about was Lord Chi Ming behind Luo Family.<br/><br/>However, it was said that the incarnation of Lord Chi Ming in the Human Realm was slain by a junior hundreds of years ago.<br/><br/>Without that incarnation, Lord Chi Ming’s control over the Human Realm diminished significantly. Even if his strength is insufficient, escaping should not be an issue.<br/><br/>These thoughts flickered in Xu Tianxing’s mind, but suddenly, he saw Gu Yang swerve downward and fly onto a mountain.<br/><br/>“What is this kid trying to do?”<br/><br/>He thought that the other wanted to shake him off with the complex terrain of the mountains, but he saw a spatial rift appear before Gu Yang, and Gu Yang directly entered it.<br/><br/>What?<br/><br/>Xu Tianxing was surprised, and without hesitation, he passed through before the Spatial Gate closed.<br/><br/>“This is…”<br/><br/>He didn’t know what was behind the Spatial Gate, he remained vigilant to avoid being ambushed and falling into a trap.<br/><br/>Until he saw his surroundings clearly, he was shocked, “A Cave Heaven World?”<br/><br/>This place was actually a Cave Heaven world!<br/><br/>Following that, he realized something was wrong.<br/><br/>He smelled a foul stench, and the Vitality between Heaven and Earth contained some terrible toxins.<br/><br/>The most terrifying thing was the Way of Heaven in this world, it felt distorted, chaotic, evil…<br/><br/>Xu Tianxing was horrified, what kind of Cave Heaven world was this!<br/><br/>The Way of Heaven was so distorted and chaotic, not to mention martial artists, even an ordinary person staying here for a long time would end up neither human nor ghost.<br/><br/>Even a Celestial Being like him, once influenced by the Way of Heaven here, the contamination of his Original Spirit and mortal body would have unimaginable consequences.<br/><br/>He immediately sealed his connection with the outside world, and avoided the highly toxic Vitality between Heaven and Earth and the twisted Way of Heaven like the plague.<br/><br/>Xu Tianxing was shocked inwardly, but his speed was not affected at all, still firmly locking onto Gu Yang’s figure.<br/><br/>No matter where he fled, he could not escape from his palm.<br/><br/>Don’t think that hiding in such a twisted world can scare him.<br/><br/>At that moment, he felt a sense of alarm in his heart, sensing an incredibly evil existence approaching rapidly.<br/><br/>What is that?<br/><br/>He was somewhat surprised.<br/><br/>Even the demons of the Nether Sect, their evil aura was not as evil as this being.<br/><br/>Could it be the legendary Ghost Emperor? Flying Rakshasa? Golden Corpse?<br/><br/>All these are Demon Beasts and goblins at the Human Immortal level recorded in ancient books.<br/><br/>Soon, a huge skull appeared in his vision, its face filled with the color of hatred.<br/><br/>As soon as Xu Tianxing saw this face, a strong sense of hatred spontaneously emerged in his heart, as if he were dissatisfied with everything, wanting to destroy everything before his eyes.<br/><br/>Just as he was about to release his hatred, he was startled and realized something was wrong.<br/><br/>“What a terrifying ghost, its resentment could actually affect my Daoist Heart.”<br/><br/>He was on high alert.<br/><br/>His Daoist Heart had been polished to the point of flawlessness and was not supposed to be easily affected by illusions. But now, it was influenced by a ghost and almost lost control.<br/><br/>The ghosts born in such an environment completely defied conventional wisdom.<br/><br/>Soon after, Xu Tianxing detected another strong aura, which shocked him even more, “A Celestial Being?”<br/><br/>There were powerful Celestial Being-level existences in this world?<br/><br/>It was hard to imagine which Celestial Being would come to this world.<br/><br/>Was death not fast enough for them?<br/><br/>A normal Celestial Being in such an environment would count their blessings if they could survive a few hundred years.<br/><br/>Xu Tianxing understood why Gu Yang entered this world, he wanted to fish in troubled waters.<br/><br/>If others were in his place, they might have already beaten a hasty retreat.<br/><br/>But he had no choice, no matter how dangerous, he would never give up.<br/><br/>The immortality peach, he had to have it.<br/><br/>…<br/><br/>……<br/><br/>This place is exactly where the Yellow Springs Cave Heaven is located.<br/><br/>In Huangmu City, a wrinkled old man with one gray, vertical pupil in his eye, looking extremely strange, was Tang Elder of the Four Directions Alliance, sitting in a room filled with prohibitions.<br/><br/>Last time, his search for the man from the Human Realm in the underground cave ended in vain, so he stayed in Huangmu City, waiting for the man to appear.<br/><br/>Suddenly, his eyes popped open, a flash of excitement appearing in his pupils.<br/><br/>They’re here!<br/><br/>He sensed that two incredibly powerful auras had appeared on the outskirts of the city, not far from the entrance to the underground cave.<br/><br/>The appearance of these two auras immediately alarmed the Ascension Period freak beast,<br/><br/>The Ascension Period freak beast appeared not long ago, and with it came a large number of lower-level freak beasts. The situation outside of Huangmu City became extremely dangerous.<br/><br/>Huangmu City was under his protection and did not suffer any attacks.<br/><br/>Elder Tang was worried that the two cultivators, who were most likely from the Human Realm, did not know how powerful the freak beasts were and would unwittingly throw away their lives. He used his Divine Power and rushed over at the fastest speed.<br/><br/>The Ascension Period freak beast was almost impossible to kill.<br/><br/>In the ongoing war between humans and freak beasts, humans had yet to kill an Ascension Period freak beast, but there were quite a few Ascension period cultivators who had died at the hands of these beasts.<br/><br/>He did not want the two Ascension cultivators from the Human Realm to lose their lives foolishly.<br/><br/>PS: Requesting votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}