{"id": 407, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132416.html", "title": "Chapter 407 - Chapter 407: 407 Accident", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 407 - Chapter 407: 407 Accident</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 407: 407 Accident<br/><br/>The sword stroke that Gu Yang executed was the second move of Zhanxuan Swordsmanship—Godslayer.<br/><br/>His idea was simple. By killing the old man who summoned this ghastly entity, he might be able to resolve the current crisis.<br/><br/>He has encountered numerous perilous enemies and faced countless desperate situations. His strength was cultivated step by step with the simulator, which enabled him to conquer all enemies under his sword.<br/><br/>However, for the first time, he faced an adversary in reality that he had no way to defeat.<br/><br/>The power contained in the dean’s sword stroke was not inferior to his own. However, it did not harm the shadow creature in the slightest.<br/><br/>If he were to counter, the outcome would likely be the same.<br/><br/>He had never previously felt this sense of impotence of being unable to harm his opponent.<br/><br/>It was exactly this brutal crisis that unleashed a before-unseen strength in him, culminating in the most powerful sword stroke he had ever delivered.<br/><br/>The sword intent traversed thousands of miles to arrive above the Great Shaman’s head.<br/><br/>Swoosh!<br/><br/>The sword intent passed through his body.<br/><br/>“You can’t be serious?”<br/><br/>But Gu Yang felt as if his sword had hit nothing but air, providing no sensation of striking a physical form.<br/><br/>He immediately realized the reason. The Great Shaman, having integrated with the eerie spiritual treasure, had become an almost ethereal entity, much like the giant shadow.<br/><br/>What a miscalculation!<br/><br/>Just as this thought came to him, the black chain had already reached his head.<br/><br/>Yet he remained perfectly calm. Since he did not die in the simulation of this battle, it meant that he would not die here either.<br/><br/>Gu Yang had absolute faith in the life simulator.<br/><br/>It was only when the black chain fell upon his head, and the anticipated rescue had still not arrived, that his heart skipped a beat.<br/><br/>But he was unable to do anything at this moment.<br/><br/>Was he really going to die here?<br/><br/>As this thought flitted through Gu Yang’s mind, the black chain passed through his body as if it had no physical form.<br/><br/>Huh?<br/><br/>Why was he unharmed?<br/><br/>He didn’t feel any abnormalities, and his Original Spirit was intact, having sustained no damage at all.<br/><br/>In such a way, the attacks of both sides ended up being futile.<br/><br/>…<br/><br/>When the sword intent had slashed towards him, the Great Shaman almost thought his life was over and broke out in a cold sweat.<br/><br/>The man’s sword technique was ruthless. Getting hit was certain death. It was extremely perilous.<br/><br/>Luckily, that sword stroke had passed right through him.<br/><br/>He felt an immense relief, as if he had walked a full circle around the gates of hell.<br/><br/>The next moment, he saw the Soul-hooking messenger’s iron chain fall upon Gu Yang’s body and also pass right through it.<br/><br/>“He didn’t die from that?”<br/><br/>The Great Shaman was horrified.<br/><br/>This Book of Life and Death, which he obtained while still in the Mortal Realm, was the very treasure that allowed him to eliminate an enemy blocking his path.<br/><br/>Every time he used this treasure, he was extremely cautious, never revealing it. Not even his closest confidantes knew about this Abnormal Treasure.<br/><br/>Thus, without an exceptional talent, he gradually reached the summit, accomplishing a feat that countless generations on the plains couldn’t achieve. He entered the realm of Celestial Beings and became the god of the entire plains.<br/><br/>Yet now, the formerly unstoppable Soul-hooking messenger failed to work on Gu Yang.<br/><br/>How could this be?<br/><br/>Even his greatest card could not kill that youngster, causing momentary chaos in his mind.<br/><br/>“Kill him quickly!”<br/><br/>The Great Shaman anxiously urged the Book of Life and Death, commanding the Soul-hooking messenger to continue the attack.<br/><br/>As he continued to infuse it with his Immortal Element, the name “Gu Yang” in the air grew brighter and brighter, until it suddenly burst like a bubble.<br/><br/>“What–”<br/><br/>This unexpected development caught him by surprise. He had not faced such a situation before.<br/><br/>All of a sudden, the Great Shaman felt a chill on his back. Lifting his head, he saw the Soul-hooking messenger turn its gaze towards him.<br/><br/>A sense of foreboding welled up in his heart, sending chills down his spine.<br/><br/>“No–”<br/><br/>The Soul-hooking messenger’s black chain had already descended, extracting a soul. With a turn of its body, it disappeared.<br/><br/>Only the body of the Great Shaman remained in place, completely devoid of life.<br/><br/>…<br/><br/>This sudden turn of events surprised everyone.<br/><br/>Not only were “Han Wang” and Zi Wei Taoist, who were present at the scene, dumbfounded, but even the dean of Divine City and others such as Wu Er and Gao Fan, found it unbelievable.<br/><br/>In the Red Mansion.<br/><br/>“Huh, he isn’t dead?”<br/><br/>The little girl quietly opened her eyes, and was taken aback by what she saw.<br/><br/>She clearly saw the Soul-hooking messenger’s chain was about to descend on his head, but he was unharmed. In contrast, the old creature, who was neither human nor ghost, had somehow died.<br/><br/>“Master, what just happened?”<br/><br/>The man in white robes said, “You forget, he is not from this world.”<br/><br/>The little girl was still puzzled, “But, even if he is from the immortal world, once he enters the human realm, he can’t escape the Soul-hooking messenger’s hook, unless, he doesn’t come from the immortal world either—”<br/><br/>Suddenly, she realized something, her eyes widened in shock and she said, “Master, is he from somewhere beyond the heavens?”<br/><br/>The man in white robes didn’t respond, seemingly acknowledging it.<br/><br/>The little girl, having stumbled upon such a massive secret, had her face flush with excitement.<br/><br/>A person from beyond the heavens, that was truly extraordinary.<br/><br/>…<br/><br/>…<br/><br/>Upon seeing the Great Shaman being backlashed, with his soul restrained, Gu Yang subconsciously sliced out with a sword intent, splitting the shaman’s body in two and conveniently snatching the gray, unassuming book from him.<br/><br/>Afer slaying the opponent’s mortal body, no prompt appeared, disappointing him to some extent.<br/><br/>It felt like a loss of a billion.<br/><br/>Gu Yang looked at the book in his hand with some hesitation. It was the most peculiar treasure he had ever seen, without any form, not even a spiritual one, and yet, it could hook a person’s soul.<br/><br/>He had no idea what that strange thing was.<br/><br/>His understanding of the Primordial Era was still too shallow compared to the old monsters who had cultivated for hundreds or thousands of years.<br/><br/>This was the accumulation of knowledge, requiring time.<br/><br/>However, he had a general guess about the cause.<br/><br/>That black shadow was likely a nearly Dao-like existence that used a form of universal law to hook souls.<br/><br/>That’s why his Zhanxuan Swordsmanship couldn’t strike that black shadow.<br/><br/>He speculated that the reason why the black shadow couldn’t hook his soul was probably because he was a Transmigrator. His soul originally didn’t belong to this world.<br/><br/>So, this kind of rule-based soul-hooking method didn’t work on him.<br/><br/>In the end, the Great Shaman ended up being backlashed by this treasure and had his soul restrained.<br/><br/>This guy was simply too unlucky. Of all the Celestial Beings, he had to meet Gu Yang, as anyone else would have undoubtedly died facing that black shadow.<br/><br/>This treasure was undoubtedly a Great Killer.<br/><br/>Problem was, using this treasure was extremely dangerous. If one couldn’t kill the enemy, the user would be killed instead.<br/><br/>It was too temperamental, not something an ordinary person could wield.<br/><br/>Moreover, the Great Shaman possessed such a Great Killer, but there had never been a report of a Celestial Being dying by his hands.<br/><br/>If Gu Yang had guessed correctly, it must cost a great deal to use this treasure.<br/><br/>Otherwise, with the Great Shaman’s temperament, he would have long since used this treasure to kill all the Celestial Beings of this world, making himself the sole ruler and hoarding all the resources.<br/><br/>“I’ll keep it for now.”<br/><br/>Gu Yang didn’t dare to keep such a dangerous thing in his Beast-taming Space and instead stuffed it into his chest.<br/><br/>Afterward, he looked at the last two people, “Han Wang” and Zi Wei Taoist, and said, “Your turn, want to go together?”<br/><br/>“Han Wang” didn’t say a word and turned to leave, apparently having no intention of continuing the fight.<br/><br/>Only Zi Wei Taoist remained, he looked somewhat bitter and said, “My friend, you are skillful. It is my mistake for overestimating myself. I apologize.”<br/><br/>After saying that, he left somewhat dejectedly.<br/><br/>Gu Yang did not stop him. People from the Four Great Sacred Lands were not easy to deal with.<br/><br/>He nearly met his end earlier, almost killed by the Great Shaman from the barbarians, a danger he did not previously take seriously. Who knew if people from the Four Great Sacred Lands had similar trump cards?<br/><br/>He was lucky this time, but he couldn’t bank on being lucky every time.<br/><br/>There was no need to take such risks.<br/><br/>Finally, he turned his head, his gaze sharpened as he looked towards a certain direction, saying, “You can’t escape.”\t\t\t\t\t\t</div>", "images": {}, "success": true}