{"id": 400, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132403.html", "title": "Chapter 400 - Chapter 400: Hunt 400", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 400 - Chapter 400: Hunt 400</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 400: Hunt 400<br/><br/>[Simulation ended, you can keep one of the following items.]<br/><br/>[…]<br/><br/>Gu Yang looked at the popped up prompt and directly turned it off, waiting for a time when he would need to claim the reward.<br/><br/>Then, he took out the “Sky Star Treasure Book” that Lord Sky Star had just given him and started to flip through it.<br/><br/>In a flash, a day had passed.<br/><br/>Tang Yue finally finished his business and came to find him, accompanying him was a woman, “Master Gu, the leader of the alliance has sent Master Yin to invite you to the alliance.”<br/><br/>Gu Yang glanced at the woman beside him. She also had the cultivation level of a Celestial Being, seemed no different from ordinary people, with no traces of contamination.<br/><br/>This was the most normal cultivator he had seen since he came to the Yellow Springs. Not only did she appear normal externally, but she was also normal internally. She was nothing like the cultivators of this world.<br/><br/>From the two Celestial Beings he had seen — Tang Yue and Lord Sky Star — their bodies were somewhat abnormal, and inside them were major hidden illnesses accumulated under the torture of toxins.<br/><br/>The woman bowed in greeting, “Yin Suran bows before Friend Daoist. The leader of the alliance has expressed his regret for not being able to personally greet you, so he has sent me to represent him.”<br/><br/>Gu Yang returned the courtesy and said, “I am grateful for the leader of the alliance’s hospitality. However, it would be best not to visit the Four Directions Alliance for now. Since I am still able to wield my sword, I should focus my attention on exterminating the devilish monsters around here.”<br/><br/>After he finished speaking, without giving them a chance to respond, he stood up and said to Tang Yue, “Let’s go, we should leave now.”<br/><br/>“This…”<br/><br/>Tang Yue subconsciously glanced at Yin Suran next to him. She was highly trusted by the leader of the alliance and often acted as the leader’s emissary, representing his will.<br/><br/>An unusual light flashed in Yin Suran’s eyes, and she said, “Master Gu is courageous and righteous. I admire you. In that case, I would risk my life to accompany you.”<br/><br/>“Good.”<br/><br/>Gu Yang didn’t care. What he needed was a guide who knew the locations of the Celestial Being Monsters, which could help him save a lot of time.<br/><br/>He also didn’t go to the Four Directions Alliance with this consideration in mind. Going there would waste a day or two.<br/><br/>As for whether it would offend the Leader of the Alliance or not, he was not concerned about it. After he completed his harvesting here, he planned to leave.<br/><br/>The next time he came, he wouldn’t need to consider anything about the Four Directions Alliance.<br/><br/>…<br/><br/>Gu Yang and his two companions immediately flew out of Sky Star City.<br/><br/>The Four Directions Alliance didn’t always stay hidden in their base, they would send out nascent soul cultivators to patrol around the city from time to time to understand the movements of the monsters.<br/><br/>For cultivators like Tang Yue, who had reached the deity stage, the task was even more important, they would have to patrol a wider range.<br/><br/>They were primarily concerned with deity monsters and only deity cultivators could escape with their lives upon encountering such a monster.<br/><br/>The monsters were not intelligent, they simply wandered within a range until they detected the presence of living human beings, then they would be activated. It seemed like their only purpose was to kill every human being they saw.<br/><br/>“There have always been rumors that the monsters were created by the Yellow Springs Sect and the results got out of control, thus creating the present situation,”<br/><br/>The three of them were conversing even as they flew.<br/><br/>They all had high-level disguise symbols, which could deceive the eyes and ears of the Nascent Soul monsters, so they didn’t need to worry about being discovered.<br/><br/>Yin Suran said, “The truth is, the Yellow Springs Sect was wiped out in that great conflict, and no one escaped. So whether it’s true or not, no one knows.”<br/><br/>It seemed that even the upper echelons of the Four Directions Alliance did not know how the monsters came about.<br/><br/>Gu Yang asked again, “Master Yin, you have maintained your status so well. Do you have any secrets?”<br/><br/>Yin Suran laughed bitterly, “There are no secrets. To be honest, just like you, I was not born in this world, but unintentionally wandered in. I came here fifty years earlier than you, that’s all.”<br/><br/>“Oh?”<br/><br/>Gu Yang was quite surprised. It turned out she was from another world and asked, “Which world does Master Yin come from?”<br/><br/>“Kong Mingtian.” Yin Suran simply replied with a name, she didn’t want to say more.<br/><br/>His eyes brightened at the use of the word “sky” in referring to another place. This was a world of a higher level than the Heavenly Domain.<br/><br/>So far, he only knew of three such places — Chiming Sky, Penglai Sky, and Peach Source Sky.<br/><br/>Chiming Sky needs no explanation, as Lord Chi Ming exists beyond the realm of Celestial Beings.<br/><br/>The Beast God Temple in Penglai Sky could annihilate the people of Yao Chi Immortal Palace, showcasing their immense strength.<br/><br/>The Peach Source Sky was home to three great Monster Race sages who could stand as equals with Lord Chi Ming.<br/><br/>All these three worlds were very complex.<br/><br/>He wondered what the situation was like in this Kong Mingtian.<br/><br/>However, since Yin Suran didn’t want to say more, it wasn’t appropriate for him to ask further.<br/><br/>“We’re here!”<br/><br/>Tang Yue suddenly said.<br/><br/>While speaking, they had already arrived in one of the areas where a Celestial Being Monster was active.<br/><br/>When Gu Yang spotted the monster, it also noticed them. No matter what level of disguise spell, they couldn’t deceive the senses of a Celestial Being Monster.<br/><br/>Once it gets within a certain range, it would definitely be discovered.<br/><br/>Then, it would immediately launch an attack.<br/><br/>Gu Yang had already taken out his Emperor’s Sword.<br/><br/>“Kid, don’t go too far!”<br/><br/>At this point, the Primordial Spirit of the Emperor’s Sword finally couldn’t bear it any longer and spoke up.<br/><br/>Exterminating this celestial being monstrosity was a considerable burden for it, the cost was too high.<br/><br/>Gu Yang communicated with it through his thoughts, “I understand, you are the Human Emperor’s Sword of the human realm. You do not wish to interfere in the matters of the immortal realm. But since I’ve encountered this, I can’t ignore it. You don’t have to lend me your power.”<br/><br/>Having said this, he charged out without hesitation, swinging his sword at the monstrosity.<br/><br/>This creature only had one head and didn’t seem any different from ordinary monstrosities.<br/><br/>Such monstrosities were of a different type, evolved from countless lower order monstrosities that devoured and fused with each other.<br/><br/>The previous two were originally celestial being powerhouses. After losing control, they transformed into celestial being level monstrosities.<br/><br/>There was no distinction in power among these two types of creatures, as cultivators at the God Transformation stage in Yellow Springs cave realm couldn’t defeat them.<br/><br/>However, Gu Yang felt a significant difference when he drew his sword.<br/><br/>This kind of creature was even more chaotic, having a more significant impact on one’s Daoist heart.<br/><br/>But one thing remained the same, they had slow reactions, they didn’t know how to evade.<br/><br/>Or rather, they didn’t have the time to dodge.<br/><br/>Zhanxuan Swordsmanship, second move, Godslayer!<br/><br/>With a swift charge, rivaling the speed of thunder, the Human Emperor’s Sword bisected the creature.<br/><br/>In the blink of an eye, this celestial being monstrosity was annihilated.<br/><br/>[Obtained one shard, current shard count: six.]<br/><br/>Seeing the prompt in front of his eyes, Gu Yang mentally said, “Thank you.”<br/><br/>The Human Emperor’s Sword showed no response as its sword light retracted.<br/><br/>With that previous swing, the Human Emperor’s Sword had not retracted its power, lending him quite a bit of strength.<br/><br/>…<br/><br/>“The Human Emperor’s Sword——”<br/><br/>Although Yin Suran had heard Tang Yue and Lord Sky Star describe this strong man from the human realm who had killed the transformed god monstrosity, seeing it with her own eyes still shook her to the core.<br/><br/>She too had once faced a transformed god monstrosity, and despite exhausting all means, she could not harm it at all.<br/><br/>The man before her, however, had effortlessly slain a transformed god monstrosity with a single sword strike. It was as easy as cutting through a regular wronged ghost or goblin.<br/><br/>She recognized at a glance that the sword in his hand was the legendary Human Emperor’s Sword, first treasure of the human race.<br/><br/>“Could it be, the power of the Human’s Emperor Sword?”<br/><br/>“No, it’s not just the Human Emperor’s Sword, his swordsmanship…”<br/><br/>“Could it be——”<br/><br/>Yin Suran’s eyes narrowed as she thought of a famous personality.<br/><br/>“Let’s move on to the next area.”<br/><br/>Gu Yang’s voice rang out and he flew ahead.<br/><br/>Only then did she and Tang Yue react, hurrying to follow him.<br/><br/>At this moment, the surrounding monstrosities noticed the commotion and chased after them but they couldn’t catch up with the three celestial being powerhouses.<br/><br/>Tang Yue took out another camouflage charm and hid the three of them.<br/><br/>With this, the trio started their monstrous extermination journey.<br/><br/>…<br/><br/>……<br/><br/>Three days later.<br/><br/>“Die!”<br/><br/>Gu Yang executed the Zhanxuan Swordsmanship again, killing a celestial being monstrosity on the spot.<br/><br/>A prompt appeared before his eyes, [Acquired one shard, current shard count: twenty-two.]<br/><br/>This was the tenth monstrosity he had killed in these three days.<br/><br/>Among them, there were six humanoid ones and four single-headed ones.<br/><br/>The humanoid monstrosities held spiritual treasures.<br/><br/>Like the one right now, it had left behind a knife.<br/><br/>Gu Yang was tempted as this was the first time he encountered a knife-type spirit treasure. His original expertise was in the saber technique. The Phoenix Feather Knife was a bit inadequate for him.<br/><br/>But the knife was very attractive to him.<br/><br/>However, he ultimately chose to exchange it for shards.<br/><br/>[Extraction successful, received one shard, current shard count: twenty-three.]<br/><br/>With the monstrosity affecting it day and night, who knew what its primordial spirit had become, it might become a hidden danger.<br/><br/>Gu Yang looked at Tang Yue and Yin Suran and said, “We should part ways for now.”<br/><br/>With that, he didn’t give them a chance to respond, already taking flight and disappearing into the sky.\t\t\t\t\t\t</div>", "images": {}, "success": true}