{"id": 405, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132412.html", "title": "Chapter 405 - Chapter 405: Complete Physical And Mental Destruction", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 405 - Chapter 405: Complete Physical And Mental Destruction</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 405: Complete Physical and Mental Destruction<br/><br/>Gu Yang held the jade box in one hand, and in the instant his gaze shifted to a particular spot, someone couldn’t help but act.<br/><br/>The hooded figure in black made a move, a small black dot appeared out of thin air, about to fall onto the peach.<br/><br/>Almost simultaneously, a starlight lit up.<br/><br/>Just as it was about to pierce the tiny dot, it abruptly retracted.<br/><br/>A flame appeared out of nowhere, reducing the black dot to ashes.<br/><br/>Gu Yang looked at the black-cloaked figure, “Ancient insect?”<br/><br/>That black dot was not simple, it had managed to evade his perception. He almost allowed it to fall onto the peach if not for his quick reaction.<br/><br/>The black dot was a tiny insect, carrying a sense of familiarity, an aura of untamed wilderness about it.<br/><br/>Previously, in the Moon Water Cave Heaven, he encountered a demonic cultivator who released a Purple Lightning Golden Cicada, an ancient insect, whose aura felt similar.<br/><br/>“Ah, good observation.”<br/><br/>The voice of the cloaked figure sounded odd, not only in accent but the voice itself was not quite human-like, “I thought you were the reincarnation of that Emperor, but it seems I was wrong.”<br/><br/>“From the sounds of it, seems like you recognized it?”<br/><br/>“You don’t need to know that,” the cloaked figure laughed eerily, “Did you present this peach to have us kill each other? So naive of you, to think that such a scheme would work. If you want to survive, hand over the item. That’s your only chance.”<br/><br/>Gu Yang laughed, “Well, you’re mistaken. I simply aim to keep you all here!”<br/><br/>With that, he drew the Human Emperor’s Sword, asking, “Who’s first?”<br/><br/>…<br/><br/>“Could it be… the legendary Witch King of the South?”<br/><br/>In the literary courtyard, Gao Fan thought of a certain figure after seeing the move of the black-robed man, or rather, a being that could hardly be called a human.<br/><br/>He exclaimed with surprise, “But, how could it be still alive? Weren’t there records of it from 5000 years ago?”<br/><br/>Wu Er also seemed concerned, “The South, even the Xia Emperor couldn’t really conquer that land. Perhaps, it’s due to its existence.”<br/><br/>The South was a vast area covered in forest, stretching mountains, and miasma everywhere.<br/><br/>None of the Xia Dynasty, Qin Dynasty, or the present Great Zhou could control that area.<br/><br/>In the South, there lived a number of mountain tribes, people who had fled into the mountains to escape the turmoil of war.<br/><br/>According to legend, the South was ruled by a Witch King, omnipotent, a manifestation of a god.<br/><br/>The legend of the Witch King was ancient, with initial records dating back to 5000 years ago.<br/><br/>At that time, the Xia Dynasty had not yet been established. This land was divided into several factions.<br/><br/>The largest faction, neighboring the South, aimed to expand its territory. They conducted a large-scale deforestation to make farmland and captured mountain people as slaves.<br/><br/>However, overnight, the high officials and tens of thousands of soldiers of that faction disappeared without a trace.<br/><br/>Since then, the legend of the Witch King began to circulate throughout the Divine State.<br/><br/>If the black-robed figure truly was the legendary Witch King, it could be a terrifying existence that had lived for five thousand years.<br/><br/>…<br/><br/>“Who’s first?”<br/><br/>As Gu Yang asked this, his eyes were fixated on the black-cloaked figure.<br/><br/>This person, after initiating the first move, would naturally not stop there.<br/><br/>He saw him snort coldly, his figure blurring, then disappeared without a trace.<br/><br/>Sight of the Candle Dragon.<br/><br/>Gu Yang made use of the divine power of the Candle Dragon, looking around, but he couldn’t see the figure anywhere.<br/><br/>“He ran away?”<br/><br/>He finally realized.<br/><br/>The cloaked figure had actually just run away like that.<br/><br/>He genuinely had not expected it.<br/><br/>At this point, Zi Wei, the real person from the Star Sea, spoke up, “It’s not human.”<br/><br/>It was then that it dawned on Gu Yang. It avoided the Human Emperor’s Sword.<br/><br/>The Human Emperor’s Sword unleashed its true power only when dealing with non-human races.<br/><br/>Just like when he slaughtered the Jade Dew Divine at the Yaochi Conference before, if the black-robed figure wasn’t human, its fear of the Human Emperor’s Sword was justified.<br/><br/>He looked at Zi Wei, who seemed to have no intention of making a move.<br/><br/>Earlier on, when the robed figure released the insect, he made a move but pulled back midway.<br/><br/>“I’ll go!”<br/><br/>Chang Tian of the Barbarians had been raring to go. He drew out the scarlet longsword from behind his back.<br/><br/>In the past few days, he had learned a lot about Gu Yang’s exploits from the intelligence, and it made him a little indignant.<br/><br/>He always believed in his high talent, incomparable by anyone in the world.<br/><br/>He was just over two hundred years old, two hundred years younger than Qin Wu, universally recognized as an unmatched prodigy in Great Zhou. Yet, he surpassed Qin Wu by stepping into the Celestial Being realm at an earlier age.<br/><br/>Such talent is rare throughout the ages.<br/><br/>This was also the source of his pride.<br/><br/>Until he knew about Gu Yang’s existence.<br/><br/>In just over a year, from the Mortal Realm to Celestial Being.<br/><br/>Even if those intelligence agents swore on their lives that this information was true, he still didn’t believe it.<br/><br/>Even in ancient times, no one had cultivated at such a fast pace.<br/><br/>Chang Tian had long wanted to measure the strength of the opponent.<br/><br/>“Martial Arts?”<br/><br/>Gu Yang sensed a wild and domineering Blade Intent from the other party, which surprised him.<br/><br/>This was clearly Martial Arts.<br/><br/>However, the cultivation method of the barbarians was different from that of Great Zhou. More primitive, they used various coatings to draw patterns on their bodies, thereby possessing extraordinary power.<br/><br/>Another method was the shaman’s, incorporating facets of the ancient ways of ghosts and gods, techniques of refining corpses, and so on.<br/><br/>The Celestial Being of the barbarian tribe in front of him was showing proper Martial Arts.<br/><br/>What was going on?<br/><br/>…<br/><br/>Chang Tian loftily said, “Do you really believe that Martial Arts is exclusive to you people of Great Zhou? Let me show you the Forest of Blades technique from my Xueshan.”<br/><br/>With that, the aura of his body also climbed to its peak.<br/><br/>In a gust of gloomy wind, he saw the bloody long knife in his hand, a series of wronged ghosts appeared, converging and assaulting his heart.<br/><br/>At the same time, the surrounding space plunged into absolute darkness, and a heart-piercing chill sprang from his back.<br/><br/>He completely lost all his senses.<br/><br/>The one who took action was sure to be the Great Shaman of the barbarians.<br/><br/>The oldest Celestial Being in the barbarian tribe is the tribe’s guardian god, who once served the Xia Emperor. After the Xia Dynasty was destroyed, the barbarians became independent.<br/><br/>It was precisely because of the existence of this Great Shaman that neither the Qin Dynasty nor Great Zhou could conquer the barbarians.<br/><br/>Moreover, this man had always been timid, hiding in the sacred mountain of the barbarians, never leaving half a step. He was in fear of being found by the Celestial Beings of Great Zhou and being killed.<br/><br/>Until now, he had finally trained a helper, and this was the weakest moment of Great Zhou, which led him to dare step on the land of Great Zhou.<br/><br/>This time, he not only wanted to rob the peaches, but also kill Gu Yang on the spot, to eliminate a great enemy for the prairie.<br/><br/>…<br/><br/>The moment the Great Shaman made his move, the dean of the Academy was about to draw his sword.<br/><br/>Suddenly, he sensed a warning in his heart.<br/><br/>Only a black shadow fell from the sky, splitting into hundreds of shadows, scattering in all directions.<br/><br/>Lord Chi Ming!<br/><br/>This move was extremely treacherous.<br/><br/>He had only two choices in front of him. Help Gu Yang and all the disciples in the Academy will die.<br/><br/>Help the disciples of the Academy, can Gu Yang withstand the joint hands of two Celestial Beings?<br/><br/>He was caught in a dilemma.<br/><br/>…<br/><br/>“Break for me.”<br/><br/>Gu Yang no longer held back, raising his Emperor’s Sword high, and the Immortal Element within his body exploded.<br/><br/>A bolt of lightning pierced through the darkness in front of him, revealing Chang Tian who was already within arm’s reach.<br/><br/>Sixth Annihilation of Divine Lightning, Form and Spirit Destruction!<br/><br/>With a single stroke of the sword, the darkness vanished, and the wronged ghosts in the bloody long knife screamed, dispersing apart as their souls flew away. The Ghost Realm of the forest was immediately broken.<br/><br/>“Celestial Being Second Stage?”<br/><br/>Chang Tian’s Original Spirit sensed fatal danger, shocking him to the point of his soul flying away in fear.<br/><br/>And in the next moment, he could sense his body and Original Spirit starting to collapse.<br/><br/>“No——”<br/><br/>Before he could react, he sank into a hopeless darkness.<br/><br/>This exceptional genius of the barbarian tribe, a Celestial Being not yet three hundred years old, thus fell.<br/><br/>PS: Here’s the third update, please vote!\t\t\t\t\t\t</div>", "images": {}, "success": true}