{"id": 404, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132410.html", "title": "Chapter 404 - Chapter 404: 404 Celestial Being Second Level", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 404 - Chapter 404: 404 Celestial Being Second Level</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 404: 404 Celestial Being Second Level<br/><br/>[…You have broken through to the second level of the Celestial Being Realm…]<br/><br/>When Gu Yang proceeded to the twentieth simulation, he finally saw this prompt, which thrilled him.<br/><br/>The first level of the Celestial Being realm primarily involves the accumulation of the Immortal Element, a long process. Even in ancient times, it often took centuries to complete this accumulation.<br/><br/>The Immortal Element is a higher level power, carrying the nourishment of one’s Original Spirit and Human Immortal Body.<br/><br/>For each Celestial Being, their Immortal Element is unique.<br/><br/>Now, after the Great Calamity, the Way of Heaven has collapsed, and even the Vitality between Heaven and Earth has become increasingly sparse.<br/><br/>The majority of Celestial Beings spend their entire lives unable to complete this accumulation, unable to overcome this hurdle.<br/><br/>Just like Xu Tianxing, who has been stuck at the first level for more than two thousand years.<br/><br/>With that celestial peach, he managed to shorten this accumulation process to two hundred years.<br/><br/>It can be said that he was quite fortunate.<br/><br/>[The simulation has ended, you can keep one of the following.]<br/><br/>[One, your martial arts realm at the age of thirty-three.]<br/><br/>[Two, your martial arts experience at the age of thirty-three.]<br/><br/>[Three, your life wisdom at the age of thirty-three.]<br/><br/>“I choose one.”<br/><br/>Suddenly, Gu Yang felt a powerful rumble within his body. The Immortal Element expanded to a certain extent, making his Original Spirit stronger and his understanding of the Way became deeper and more thorough.<br/><br/>It was as if he had laid a solid foundation, and everything was falling into place.<br/><br/>In the Water Moon Pocket Universe, the Way he realized was related to flames, combined with the sword intent of the Zhanxuan Swordsmanship, it was an aura similar to destruction.<br/><br/>This was a path of slaughter.<br/><br/>His journey had claimed countless lives, and if you add those tricky creatures, it was even more.<br/><br/>It could be said that this path was very much in line with him.<br/><br/>Gu Yang understood why the Sword of the Human Emperor was reluctant to truly recognize him as its master. In a word, if our ways are different, we cannot make plans together.<br/><br/>The Sword of the Human Emperor, closely related to the destiny of the human race, required the spirit of protection and sacrifice.<br/><br/>If he had to protect the people around him, he could do it. If he had to extend this protection to all mankind, as long as it was within his power, that was not a problem either. But if he had to sacrifice himself for it, he’d rather not.<br/><br/>If it doesn’t recognize me as its master, so be it. As long as I can use it for now.<br/><br/>When I have time later, I’ll refine the Nine God Tripod, which isn’t necessarily worse than the Sword of the Human Emperor when fighting against enemies.<br/><br/>…<br/><br/>[Do you want to use the Life Simulator? Each use consumes two shards.]<br/><br/>After Gu Yang successfully broke through, he opened the system and saw this prompt.<br/><br/>As expected, the price of the simulator had gone up again.<br/><br/>Two shards, he could still afford.<br/><br/>The question was, where was he going to get so many shards in the future?<br/><br/>Throughout the Divine State Continent, including the Four Great Sacred Lands, there are only a dozen or so Celestial Being level powerhouses. If he wiped them all out, even with their magical treasures, he’d only get twenty or thirty shards.<br/><br/>Counting the pocket universes, only two remain in Water Moon.<br/><br/>Golden Court pocket universe has three.<br/><br/>It’s estimated that Wanxiang pocket universe has a dozen or so.<br/><br/>Star Luo Pocket Universe probably has about the same, a dozen or so.<br/><br/>Ruiqin Continent should also have a dozen or so.<br/><br/>Taoyuan Heaven has three.<br/><br/>Lord Chi Ming maybe just one.<br/><br/>The pocket universe with the most should be Yellow Springs, the number of Celestial Being level tricky creatures inside is unknown, but definitely will not exceed three figures.<br/><br/>Counting the Half-Gods on the West Bank Continent, probably about ten.<br/><br/>If Gu Yang wiped out all these people, the shards he could get wouldn’t exceed two or three hundred at most.<br/><br/>Would these few shards allow him to cultivate to the Hollow Void realm?<br/><br/>That’s a big question mark.<br/><br/>The celestial peach’s effect on him is becoming smaller, without practicing bitterly for a thousand years, it’s hard to reach the third level of Celestial Being.<br/><br/>This would require two hundred shards.<br/><br/>As Gu Yang was thinking, Divine City was already in sight.<br/><br/>He sensed those five auras.<br/><br/>Those two Celestial Beings from the Barbarian race, the suspicious old Daoist from Star Sea, a guy with a strange aura, and the old familiar face, the Red Moon Great Saint.<br/><br/>He shouted loudly, “Aren’t you looking for me? Here I am!”<br/><br/>As soon as his voice fell, five figures appeared before him one after another.<br/><br/>The fastest to arrive was “Han Wang”, whom Gu Yang had previously faced off against.<br/><br/>Next was the old Taoist from the Star Sea.<br/><br/>The two barbarians followed, and the last to appear was an old man fully shrouded in a black robe.<br/><br/>Upon their arrival, instead of initiating an attack, they surrounded him.<br/><br/>They were just ten miles from the Divine City, and although the headmaster didn’t give chase, everyone could sense a sword intent from afar, locking onto them, ready to strike at any moment.<br/><br/>…<br/><br/>Suddenly, the old Taoist spoke up, “Friend Gu, my Taoist name is Zi Wei, from the Star Sea. For a close relative of mine, I have to humble myself and ask you for that Peach of Immortality.”<br/><br/>“If you are willing to give me the peach, I can offer a spiritual treasure in exchange. Furthermore, I will owe you a favor, and when you face off against Lord Chi Ming in the future, I can lend you a hand…”<br/><br/>“Han Wang” said sneeringly, “Hehe, is it not too late to play the good guy, old Zi Wei? Gu Yang, deliver the object to me, and let bygones be bygones. What do you say?”<br/><br/>At this moment, one of the barbarian Celestials couldn’t help but chime in, “You both have said so much, but have you bothered to ask, is the peach still here?”<br/><br/>Then, a ghastly voice spoke up, “It doesn’t matter. He consumed the peach not long ago, and its effects are still present. I have a method to refine him into a human pill. After it is consumed, it can retain around seventy to eighty percent of the peach’s potency.”<br/><br/>It was the Celestial in the black robe.<br/><br/>Gu Yang looked at the five Celestials encircling him.<br/><br/>An old Taoist with a righteous appearance.<br/><br/>A treacherous woman with a mind full of deception who can stab her allies in the back.<br/><br/>Two aliens who unabashedly harbored malicious intent.<br/><br/>And a pervert who didn’t dare to show his face and kept saying he was going to refine Gu Yang into a human pill.<br/><br/>He couldn’t help laughing and said, “Is this what you want?”<br/><br/>With that said, he took a jade box out of the Beast-taming Space. He opened the box, revealing the Peach of Immortality inside.<br/><br/>A refreshing fragrance that tantalized the senses spread out. The aroma instilled in everyone a desire that came from their Original Spirit.<br/><br/>The desire to swallow that peach.<br/><br/>Five pairs of extremely greedy eyes focused on it.<br/><br/>…<br/><br/>…<br/><br/>“A Peach of Immortality?”<br/><br/>The headmaster in the academy was also deeply shocked.<br/><br/>Now, he finally knew why the five Celestials had joined forces to find Gu Yang. It turned out they were after this divine item rumored to extend one’s lifespan over a thousand years.<br/><br/>This time at the Yaochi Conference, Gu Yang had surprisingly gained such a thing.<br/><br/>Now, trouble was brewing.<br/><br/>…<br/><br/>Both Gao Fan and Wu Er had divine powers that allowed them to “see” the Peach of Immortality. Upon seeing it, they were dumbfounded.<br/><br/>“Has this kid gone mad?”<br/><br/>They simply could not understand why Gu Yang came back to be captured and even took out such a divine item in public. Now, the five Celestials would be even more relentless.<br/><br/>Suddenly, Wu Er’s deep voice sounded, “Could it be… he plans to capture all of them at once?”<br/><br/>Upon hearing this, Gao Fan was completely stunned and lost for words, “You mean… he has confidence?”<br/><br/>Such a thought was too mad. It’s one against five, and he even aimed for a sweeping victory. How could this be possible?<br/><br/>Unless—<br/><br/>Gao Fan came up with a possibility and couldn’t help but gasp in surprise.<br/><br/>…<br/><br/>Inside the royal palace, the Taiji Palace suddenly shook violently.<br/><br/>Everyone in the palace keenly felt the shake.<br/><br/>A moment later, everything returned to normal, as if nothing had happened at all.<br/><br/>“Great-grandfather, what’s wrong?”<br/><br/>Inside the palace, a little boy dressed in dragon robes carefully asked a dignified middle-aged man beside him.<br/><br/>The middle-aged man took his eyes back and said lightly, “To live a long life, remember the word forbearance. Always bear in mind what you want and never be greedy. That’s your way of survival.”<br/><br/>The little emperor listened and nodded in understanding, saying respectfully, “I will remember your words!”<br/><br/>…<br/><br/>“Found you!”<br/><br/>Gu Yang picked up on an extremely elusive presence nearby, and a cold smirk rose in his heart.<br/><br/>The reason he showed the Peach of Immortality was not to show off, but to locate the enemy hiding nearby.<br/><br/>If nothing unexpected happened, that should be Lord Chi Ming’s man.<br/><br/>PS: The second update, asking for monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}