{"id": 403, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132408.html", "title": "Chapter 403 - Chapter 403: 403 He’S Here!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 403 - Chapter 403: 403 He’S Here!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 403: 403 He’s here!<br/><br/>Outside the Liberal Arts Academy, in the sky above, five human shadows intermittently appeared, occupying the four directions. Even though their figures were not clear, the overwhelming aura they emitted put pressure on the Academy beneath them.<br/><br/>“Red Moon Great Saint, will that kid really show up?”<br/><br/>After waiting for a whole day, someone could not help but voice their doubts.<br/><br/>The one who spoke was a newly ascended Celestial Being from the Barbarian tribes of the plains, named Chang Tian. Although he was dressed in the style of the barbarians, he had delicate features, unlike the burly and rugged appearance typical of his people.<br/><br/>This man was a genius who emerged once every thousand years among the Barbarians. In fact, he had already ascended to a Celestial Being three years ago.<br/><br/>However, in recent years, he had been consolidating his cultivation level, and had only emerged from seclusion two months ago.<br/><br/>Originally, he and another Celestial Being were not planning to confront Great Zhou so soon. They wanted to wait until the circumstances were more favourable.<br/><br/>However, his existence was not concealed from the spies of Great Zhou and was quickly exposed.<br/><br/>Great Zhou, from top to bottom, held the Barbarians as their great enemy. They began to gather heavy troops at the border, making frequent movements.<br/><br/>Even though Great Zhou was no longer as strong as before, when they employed the full force of the nation to prepare for a major battle, their troops and war preparation were not things the Barbarians of the plains could compete with.<br/><br/>In such a situation, it was not up to them to decide whether to go to war.<br/><br/>If Great Zhou took the initiative to launch an attack, they would have to retreat deep into the plains unless they were willing to fight back.<br/><br/>However, with the addition of another Celestial Being to the plains, how could they retreat without fighting?<br/><br/>Taking part in this battle had become inevitable.<br/><br/>In the midst of this, they received an invitation to the Yaochi Conference and had no choice but to attend…<br/><br/>Chang Tian was only over two hundred years old and did not have much desire for the magical peach.<br/><br/>But it was different for the Great Shaman. He was almost two thousand years old and in a century or two, his time would be up. The magical peach was an absolute must-have for him.<br/><br/>The Great Shaman had been a benefactor to him, offering immeasurable kindness — his achievements today were not possible without the Great Shaman’s support. Therefore, when the Great Shaman wanted to snatch the magical peach, he had to lend unreserved support.<br/><br/>After Gu Yang left the Immortal Palace of Yao Chi, he fled, but indeed a monk could run away from his temple. They had all come to the Divine City jointly, waiting to apprehend him.<br/><br/>On their side, they had five Celestial Beings, while Great Zhou had four.<br/><br/>Qin Wu had a deep enmity with the Zhao family of Great Zhou and would never ally with them, so he could be excluded.<br/><br/>The dean of the Liberal Arts Academy, who fought a battle with Lord Chi Ming years ago, was severely injured. Even if including Luo Wang and Gu Yang, they only had three.<br/><br/>Five against three, their victory was assured.<br/><br/>Moreover, Luo Wang, that old fox, firmly kept his place during the extermination of the Wu Family years ago when so many masters in the royal family died. He might stay out of matters this time as well.<br/><br/>However, it had already been a day and Gu Yang hadn’t shown up, which made Chang Tian anxious.<br/><br/>He had already received news that during his and the Great Shaman’s attendance at the Yaochi Conference, Great Zhou’s troops had launched an attack. The battle had been raging for several days now.<br/><br/>With each additional day they lingered here, countless warriors from their tribe would be killed in battle.<br/><br/>…<br/><br/>“If you don’t want to wait, you can roll.”<br/><br/>The man, dressed in a python robe and wearing a crown, spoke coldly.<br/><br/>This man was the “Han Wang” that Gu Yang had encountered when in Taoyuan Heaven, also one of the puppets controlled by the Red Moon Great Saint.<br/><br/>A junior actually dared to question her in such a tone.<br/><br/>If it wasn’t for that magical peach, she would have already made him pay for this sentence alone.<br/><br/>Chang Tian was furious, “You—”<br/><br/>Suddenly, the Great Shaman next to him pulled him back and said, “Chang Tian, you must not be rude. Dear Great Saint, the junior is ignorant and rude, and offended you. Please forgive him. I, on his behalf, apologize to you.”<br/><br/>“Hmph!”<br/><br/>“Han Wang” snorted coldly, “Control your people.”<br/><br/>The Great Shaman went along with it, repeating, “Yes, yes.”<br/><br/>Chang Tian was still furious, and said telepathically, “Shaman, he’s just a Celestial Being of the Monster Race. What is there to be afraid of? If we join hands—”<br/><br/>The Great Shaman cut him off, “What’s most important now is to obtain the magical peach, we can’t afford to create any trouble.”<br/><br/>But he regretfully thought to himself that he had protected Chang Tian too well these years, allowing him to become proud and arrogant, looking down on everyone. This character was good during the advancement of cultivation.<br/><br/>However, once reaching the level of a Celestial Being, the opponent becomes a similarly powerful Celestial Being. If one continues to look down upon others, a great loss can be expected.<br/><br/>He was one of the witnesses to the battle the year Xia Emperor fell.<br/><br/>In that battle, Xia Emperor’s nine avatars, plus his nine sons who all held Celestial Being power, were all killed by Lord Chi Ming and the three Great Saints of the Monster Race.<br/><br/>No one knew better than him about the strength of Lord Chi Ming and the three Great Saints of the Monster Race.<br/><br/>If they truly believed that the power demonstrated by those three great saints was limited to what was exhibited within the Immortal Palace at Yao Chi, they were incredibly naive.<br/><br/>If he wasn’t mistaken, those who attended the Yaochi Conference that day were merely avatars of them.<br/><br/>Although he and Chang Tian had some measures in place, they didn’t have an absolute advantage against the Red Moon Great Saint.<br/><br/>…<br/><br/>The other two, witnessing this minor conflict, just stood by, their eyes coldly indifferent.<br/><br/>Even though the five of them have temporarily joined forces, each has their own hidden agenda. Every one of them is here for the peach, but there is only one, and when the time comes, it will come down to their means.<br/><br/>At the time of the Yaochi Conference, there were eleven Celestial Beings present, excluding Gu Yang, and Xu Tianxing, who was the first to follow them. Of the remaining nine, five had arrived.<br/><br/>The remaining four were not willing to muddy the waters.<br/><br/>All five individuals showed significant apprehension when facing the dean of the academy.<br/><br/>If they could avoid it, nobody would want to be an enemy of the one who once slew Lord Chi Ming’s avatar.<br/><br/>But each of them had their own reasons for needing to seize the peach.<br/><br/>The reason they were blockading this place was that they knew Gu Yang was someone who valued friendship and was also known for his philandering ways. His women were all in the academy.<br/><br/>The happenings of Gu Yang’s career have been scrutinized thoroughly by various powers in order to analyze his character and behavior.<br/><br/>That’s why they gathered outside the academy without making arrangements, deliberately revealing their presence, to make sure this matter spread as quickly as possible.<br/><br/>Next, they were just waiting for Gu Yang to show up.<br/><br/>They didn’t have complete confidence, but they had no better plan, so they could only try.<br/><br/>…<br/><br/>……<br/><br/>“This kid really knows how to stir up trouble!”<br/><br/>In a courtyard of the academy, Gao Fan looked up at the few indistinct figures in the sky and couldn’t help but taunt, “Compared to him, you were far from being this troublemaker in your time.”<br/><br/>Sitting next to him was Wu Er. He didn’t need to raise his head to clearly smell that nauseating scent.<br/><br/>The Red Moon Great Saint, who had destroyed his foundation years ago, making him this living dead who was neither human nor ghost, was the culprit.<br/><br/>She appeared before him again.<br/><br/>Speaking of offending people, Wu Er had done it all, provoking each of the major families and sects. In the end, a Celestial Being attacked him.<br/><br/>Back then, when the Zhao family mobilized so many people to besiege the Wu Family, they were worried about the recurrence of the Lin Family’s old affairs.<br/><br/>In the past, he, along with Qin Wu, and the two chaps from Lin Family and Chen Family, were considered the warriors most likely to become Celestial Beings.<br/><br/>This was the root cause of the Wu family’s destruction.<br/><br/>Of course, compared to Gu Yang, he could only feel inferior.<br/><br/>An unprecedented five Celestial Beings came to deal with him.<br/><br/>This sort of situation was indeed a rarity in a thousand years.<br/><br/>When besieging Lin Tianyi back then, the Four Great Sacred Lands only sent three Celestial Beings.<br/><br/>Wu Er said, “I hope the kid doesn’t do anything stupid.”<br/><br/>“Don’t worry, that kid is crafty as a ghost, how could he walk into their trap?” Gao Fan wasn’t worried.<br/><br/>With the Water Moon cave as their escape route, they could retreat at any time. Those five Celestial Beings simply couldn’t touch them.<br/><br/>“Aren’t you looking for me? Here I am!”<br/><br/>Just then, a voice rang out from far away, it was Gu Yang.<br/><br/>The faces of Gao Fan and Wu Er changed drastically.<br/><br/>They couldn’t have imagined that Gu Yang would actually walk into the trap.<br/><br/>Those are five Celestial Beings, among which, is the extremely powerful existence, Red Moon Great Saint.<br/><br/>If he returned, wouldn’t that be walking into a trap?<br/><br/>…<br/><br/>Gu Yang’s voice echoed throughout the entire Divine City, and the over one million residents of the city heard it clearly.<br/><br/>That man, he had indeed arrived!<br/><br/>PS: It’s a million words now, all the emotions boil down to one sentence, asking for monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}