{"id": 402, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132406.html", "title": "Chapter 402 - Chapter 402: 402 Where Are You? (Asking For Monthly Tickets At Midnight)", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 402 - Chapter 402: 402 Where Are You? (Asking For Monthly Tickets At Midnight)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 402: 402 Where are you? (Asking for monthly tickets at midnight)<br/><br/>“Teacher, what should we do?”<br/><br/>In a small red building, a delicate girl stood at the entrance, looking in the direction of the academy. Her face was filled with worry. “They’re about to start fighting.”<br/><br/>In the attic, a man in white sat cross-legged on a cushion, eyes closed, as still as a statue.<br/><br/>Seeing that such a major incident had occurred and her teacher had not reacted in the slightest, the girl stamped her foot anxiously. “If he dies, no one will be able to stop Lord Chi Ming. Then, Great Zhou will be finished.”<br/><br/>Finally, the man in white spoke. “He will not die. No one dares to take his sword.”<br/><br/>That sword, in the world, no one can stop it.<br/><br/>Even if the world knows that the dean is seriously injured, as long as he has a breath left, no one dares to act wildly in Divine City.<br/><br/>Even Lord Chi Ming, does not wish to take another one of his swords.<br/><br/>The five Celestial Beings each harbored their own thoughts. No one was willing to make the first move and sacrifice themselves for the benefit of others.<br/><br/>But they were also unwilling to simply retreat like this.<br/><br/>This situation would continue until something happened, breaking the balance between them.<br/><br/>Suddenly, the man in white opened his eyes and turned his head to look in a certain direction. In his deep eyes, a hint of worry flashed.<br/><br/>He sensed that the man was rushing over here.<br/><br/>The presence of a flat peach made the situation in Great Zhou even more confusing.<br/><br/>Even he could not predict the direction of events.<br/><br/>On the surface, it seemed that the dean and Luo Wang were on the same side.<br/><br/>In reality, the two were not in harmony. They couldn’t even be considered allies. They just shared the same goal when it came to resisting external enemies.<br/><br/>Now, facing the five powerful Celestial Beings, Luo Wang is likely to play safe.<br/><br/>Even if that man rushes back and, together with the dean and Luo Wang, it’s three against five, the odds of victory are extremely low.<br/><br/>The man in white knew that the Great Zhou Empire had reached a critical turning point.<br/><br/>Just like a thousand years ago, when the four Spatial Gates opened.<br/><br/>A change of dynasties was at hand.<br/><br/>The situation had reached this point all because of a single flat peach.<br/><br/>…<br/><br/>……<br/><br/>“Flat Peach….”<br/><br/>Underground at the palace, under the nine divine cauldrons, a faint voice echoed in the underground chamber.<br/><br/>The gathering of the five Celestial Beings in Divine City had disturbed it.<br/><br/>Without the Red Mansion’s abilities, it could still guess.<br/><br/>Not long ago, the messenger from Yao Chi Immortal Palace came to Divine City and delivered an invitation to Li Yuan of the academy. Naturally, it couldn’t hide from its ears.<br/><br/>Nothing other than the flat peach of Yao Chi Immortal Palace could make these martial artists of the Celestial Being realm risk everything to kill their way to Divine City.<br/><br/>The kid was even more capable than it had imagined, even managing to get a flat peach.<br/><br/>…<br/><br/>……<br/><br/>In the Tianxin Martial Academy, a group of students gathered, whispering and discussing about the five Celestial Beings.<br/><br/>Such a big incident occurred, not just them, even the teachers from the academy didn’t have the heart to instruct them in martial arts. They all went to find the headmaster.<br/><br/>Leaving these students on the practice field, gazing in the direction of the academy.<br/><br/>Yet, they were too far away to see anything.<br/><br/>All they could do was sense the five terrifying auras pressing down on their hearts, making it hard to breathe.<br/><br/>Today’s pressure was much less than yesterday’s.<br/><br/>When the five Celestial Beings appeared yesterday, their terrifying momentum almost made their hearts explode.<br/><br/>“Do you think Mr. Gu will come?”<br/><br/>“Come to do what? To die?”<br/><br/>“If he doesn’t come back, will the dean and them start fighting with those people?”<br/><br/>“Probably not. Those people’s target is Mr. Gu…”<br/><br/>“It’s hard to say, though the Dean is powerful, he’s injured and up against five at once. Haven’t you all felt it? Those people have already started to harbor killing intent.”<br/><br/>“Even if the fight starts, it shouldn’t involve us, right?”<br/><br/>“Who knows?”<br/><br/>“Sigh, we are really screwed this time thanks to Gu Yang.”<br/><br/>…<br/><br/>Finally, someone had broached this sensitive topic.<br/><br/>Among the people present, no one picked up the topic.<br/><br/>Tianxin Martial Arts Hall has a deep connection with Gu Yang, it was under his guidance that the Academy Master managed to break through to the First Rank realm.<br/><br/>He is a benefactor to the Academy Master, and also to Tianxin Martial Arts Hall.<br/><br/>Even if some felt this way, they didn’t dare to voice it out.<br/><br/>“Coward!”<br/><br/>Suddenly, someone stood up, pointed at the student who had just complained about Gu Yang, and scolded angrily, “It’s those five Celestial Beings who brought about this situation. You don’t dare to criticize them, but blame Sir Gu for provoking those Celestial Beings. You are not worthy to be a disciple of Tianxin Pavilion.”<br/><br/>The student scolded in public, turned red, and retorted angrily, “Did I say anything wrong? He brought strong enemies upon us, yet he vanished somewhere, leaving the Dean alone to face five powerful enemies. If he has guts, he should come out and face up to it, why should he involve innocent people…”<br/><br/>“Don’t squabble!”<br/><br/>“I think his point is valid.”<br/><br/>“You ungrateful scoundrel!”<br/><br/>…<br/><br/>Suddenly, the whole Martial Academy was in chaos. A fight was about to break out.<br/><br/>…<br/><br/>…<br/><br/>Imperial Palace.<br/><br/>In the Qi Feng Pavilion, Su Ningyan sat listlessly on a chair, a pile of memorandums sat in front of her with a brush beside it. However, she had no mood to sift through them.<br/><br/>Inside the Imperial Palace, though she couldn’t feel the oppression from the five powerful Celestial Beings, she could clearly sense their presence.<br/><br/>Suddenly, she turned her head, gazing into the depths of the palace, where there was also an unfathomable aura.<br/><br/>That was Luo Wang, the great pillar of Great Zhou and the guardian of the sea, himself.<br/><br/>Since the Emperor’s death, this was Luo Wang’s first time visiting the palace.<br/><br/>In the past, no matter how dire the situation, even when the Emperor was assassinated, or when the Red Venerate led a rebellion sweeping through several provinces, or even when foreign armies invaded, Luo Wang never showed himself.<br/><br/>It was rumored that the Emperor had made an agreement with Luo Wang, asking him not to interfere in the state affairs.<br/><br/>For nearly five hundred years, Luo Wang adhered strictly to that promise, never concerning himself with the matters of the court.<br/><br/>Even when two consecutive Emperors were assassinated, and she, as the highly suspicious Empress Dowager, took control of the state affairs, Luo Wang did not intervene.<br/><br/>But last night, he suddenly appeared. His first action was to take the Imperial Seal, seizing control of the Palace’s Array.<br/><br/>Luo Wang’s appearance signaled that Great Zhou was at a crossroads of life and death.<br/><br/>Su Ningyan, at this moment, was powerless. She lost control over the Palace’s Array and there was nothing she could do but wait.<br/><br/>She didn’t know what Gu Yang had done to provoke so many Celestial Beings.<br/><br/>Of the five Celestial Beings, two are from the prairies.<br/><br/>The other three — one wearing a python robe, a noble attire only worn by royalty that is distinctly different from the styles of the Great Zhou and the Qin Dynasty, was clearly from the Xia Dynasty.<br/><br/>If her guess was correct, this was the puppet of the Red Moon Great Saint from the Three Saint Sect.<br/><br/>Another one, with white hair and wearing a Taoist robe dotted with stars, was probably a powerful Celestial Being from the Star Sea.<br/><br/>The last one, wearing a black robe and emanating a black aura, was strangely intimidating and might likely be the legendary Witch King from the South Border.<br/><br/>Each one of these five Celestial Beings was legendary and well-known.<br/><br/>What exactly happened during the Yaochi Conference?<br/><br/>Su Ningyan was burning with anxiety. Facing these Celestial Being realm powerhouses, she was unable to offer any help.<br/><br/>“Gu Yang, where are you?”<br/><br/>PS: A million words now, celebrating with accolades, please vote for the monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}