{"id": 409, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132420.html", "title": "Chapter 409 - Chapter 409: The World Is Unpredictable", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 409 - Chapter 409: The World Is Unpredictable</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 409: The world is unpredictable<br/><br/>Gu Yang looked at Gao Zekun, whose strength had risen to the limit of the third stage of Celestial Being. He felt a huge doubt in his heart. How had the power projected onto the Human Realm by Lord Chi Ming become so strong?<br/><br/>If he could have created a clone of a third-stage Celestial Being in the Human Realm before, how could he have been killed by the dean?<br/><br/>Even though the dean was so powerfully against the heavens, he had been seriously injured afterwards. It wouldn’t have been difficult for Lord Chi Ming to kill him if he just created another clone of a third-stage Celestial Being.<br/><br/>If they talked about Lord Chi Ming being merciful and soft-hearted, Gu Yang would be the first one not to believe it.<br/><br/>Why couldn’t he do it before, but could now?<br/><br/>Was it because with the revival of the Way of Heaven, the maximum power Earth could accommodate had increased?<br/><br/>If that was the case, then it would spell trouble. As time went by, the power of those ancient beings who had survived to the present would continually recover.<br/><br/>Perhaps, existence at the level of the Hollow Void Realm would soon appear.<br/><br/>What would the Celestial Beings of the Great Zhou homeland fight against them with?<br/><br/>Just within the Immortal Palace of Yao Chi, how many Human Immortals, Earth Immortals, or even Celestial Immortals were there?<br/><br/>All of this had actually been caused by him.<br/><br/>He was indeed vexed. Who would have known that his blunder could actually revive the Way of Heaven? Who would believe that?<br/><br/>Gu Yang held the Human Emperor’s Sword, feeling the surging power within the sword, which was far stronger than before, and made up his mind.<br/><br/>After the revival of the Way of Heaven, the strength of those ancient powerhouses would continuously recover, but so too would the power that the Human Emperor’s Sword could harness. As long as his cultivation level could keep up, he would be able to cope with all enemies.<br/><br/>At this moment, Gao Zekun had begun to make his move. His entire being had turned into a plume of black mist, dispersing into the heavens and the earth, forming a vast black space that trapped Gu Yang inside and isolated him from outside observers.<br/><br/>Gu Yang felt the bizarre power all around him. This power was somewhat similar to the strange creatures in the Yellow Springs Hollowet, but not so extreme, and not so strong in terms of corruption.<br/><br/>He had encountered this power before. When he was still in the Mortal Realm, practicing the last style of the “God Destroyer Nine Styles,” he had almost been corrupted by this power.<br/><br/>At this moment, the power projected by Lord Chi Ming was countless times stronger than before. He was protected by the Immortal Element, and also had the body of a Human Immortal, yet he still felt wave after wave of cold, clearly indicating signs of erosion.<br/><br/>Buzz!<br/><br/>The Human Emperor’s Sword suddenly vibrated, a brilliant golden light burst forth, dispelling the surrounding endless darkness. The feeling of coldness immediately disappeared.<br/><br/>The first style of the God Destroyer Six Eradicator, Skyfire Annihilation!<br/><br/>In the sky outside the black curtain, a crack opened, a devastating aura burst out, and Skyfire fell down from within, instantly burning a hole through the black curtain.<br/><br/>Gu Yang used the sword to perform a Saber Technique without any sense of dissonance.<br/><br/>At his level, there was no difference whether he held a sword or a saber in his hand.<br/><br/>He hadn’t used the first style of the God Destroyer Six Eradicator for a long time. This time when he used it, its power was a thousand hundreds of times stronger than before.<br/><br/>It wasn’t merely because his strength had increased. When he performed this move, he felt a resonance with the sky, invoking the power between heaven and earth.<br/><br/>At this moment, he clearly felt that the Way of Heaven had indeed revived.<br/><br/>Everything was no longer the same as before.<br/><br/>The power of Lord Chi Ming could not withstand the burning of the Skyfire. This destructive power was enough to annihilate all foreign energy.<br/><br/>However, Gu Yang’s realm was ultimately a notch lower than Lord Chi Ming’s, and the range of the Skyfire could not clear away all the black curtains.<br/><br/>He raised his sword again, the second style of the God Destroyer Six Eradicator, Thunderbolt Punishment.<br/><br/>Boom!<br/><br/>In the sky, streaks of purple lightning fell down. The supremely bright and stalwart power swept away all the strange black mist wherever it went.<br/><br/>Gu Yang brandished his sword a third time.<br/><br/>The fourth style of the God Destroyer Six Eradicator, Celestial Being Decay!<br/><br/>This sword was directed at the last bit of black mist remaining. The black mist rapidly became bleak, as though it had lost its life force.<br/><br/>And in a blink of an eye, it disappeared without a trace.<br/><br/>[Obtained five shards, current shard count: nine.]<br/><br/>He’s finally dead!<br/><br/>Seeing the system’s prompt, Gu Yang was elated.<br/><br/>This journey had not been in vain.<br/><br/>This time he had encountered five Celestial Beings. As a result, he had only slain one Barbarian Celestial Being, and the Great Shaman had died of backlash. The other three all escaped.<br/><br/>Which is to say, he only gained one shard, plus one spiritual treasure.<br/><br/>By slaying one incarnation of Lord Chi Ming, he received five shards.<br/><br/>Not bad.<br/><br/>“However, it seems a little too smooth…”<br/><br/>Gu Yang felt that something wasn’t quite right in his heart.<br/><br/>Lord Chi Ming, an old monster who had lived for tens of thousands of years, knew that he possessed the sword of Human Emperor, so why was he so careless?<br/><br/>The Human Emperor’s sword, coupled with the power of the God Destroyer Nine Styles, was far beyond his imagination. It easily killed Lord Chi Ming, a third-level celestial being.<br/><br/>He had a feeling that there was some kind of scheme involved.<br/><br/>Throughout, Lord Chi Ming had always been extremely careful in his actions, even when he was still in the mortal realm. He always favored sneak attacks.<br/><br/>In a few simulations, Gu Yang got killed due to surprise attacks by Lord Chi Ming.<br/><br/>So how could such a scheming old creature become so inflated? Knowing that he could be restrained by the sword of Human Emperor, why did he still choose to confront him head-on?<br/><br/>As a result, he lost a clone.<br/><br/>“Whatever.”<br/><br/>After some thought, Gu Yang gave up trying to figure it out.<br/><br/>No matter what schemes Lord Chi Ming had, he had already gained the benefits. Five fragments meant two and a half simulations, which equaled twenty-five years of cultivation time.<br/><br/>Job done, time to wrap up!<br/><br/>…<br/><br/>…<br/><br/>Inside Divine City, everyone felt the terrifying power overhead disappearing. It led to cheering from many people, as the crisis was finally lifted.<br/><br/>The head of the Academy listened to the cheers and felt somewhat emotional.<br/><br/>Less than two years ago, that young man had grown so much.<br/><br/>Third-level Celestial Being was practically the ultimate achievement in the human realm. Xia Emperor had dominated Divine State for two thousand years at this level.<br/><br/>Gu Yang managed to kill an enemy of this level, who was one of the ancient great power’s clones, Lord Chi Ming.<br/><br/>“This lad might actually be the reincarnation of some powerful ancient figure.”<br/><br/>This thought came to him.<br/><br/>Originally, after meeting Gu Yang, he’d discarded this thought.<br/><br/>Ye Lingbo was the reincarnation of an ancient celestial immortal. A bit of her true spirit was retained in her soul, making her extraordinary to anyone who had cultivated the profound art of eye technique.<br/><br/>But Gu Yang didn’t seem to show any special traits, of course, except for the extraordinary things that he did, which others couldn’t replicate.<br/><br/>The strategies of ancient great powers were not something he, being just a human immortal, could measure against.<br/><br/>After a brief moment of joy, the head of the academy felt a heaviness in his heart.<br/><br/>With the revival of the Way of Heaven, those ancient powers hiding at the end of time were about to return…<br/><br/>If everything Lord Chi Ming said was true, then in the coming years, Great Zhou was likely to plunge into unprecedented turbulence and change.<br/><br/>…<br/><br/>…<br/><br/>In the Academy, Gao Fan and Wu Er stood up from their chairs, their faces were flushed with excitement, their hands trembling a bit.<br/><br/>To them, Lord Chi Ming was the biggest nightmare in their life. All their past experiences were given by him.<br/><br/>They saw potential in Gu Yang and passed on their most proud saber technique to him, hoping that one day, this young man could take revenge on their behalf and get rid of that evil spirit eyeing Divine State greedily.<br/><br/>But they never expected that this day would come so soon.<br/><br/>To witness Gu Yang killing Lord Chi Ming in their lifetime was more than they could ask for.<br/><br/>They felt completely content with their life.<br/><br/>…<br/><br/>…<br/><br/>In the imperial palace, in the Taiji Palace, a dignified middle-aged man sat silently in a chair.<br/><br/>The young emperor in a dragon robe standing next to him watched him quietly, restlessly.<br/><br/>But the middle-aged man didn’t even notice him. He was full of thoughts, “The revival of the Way of Heaven, the return of the great power of the ancients…”<br/><br/>This news was too shocking for him to accept at once.<br/><br/>He had only closed for less than ten years. How did the world turn out to be this way when he came out?<br/><br/>The battle that just happened gave him a huge shock.<br/><br/>Whether it was this suddenly emerged Gu Yang, the great Shaman of the Barbarians, or Lord Chi Ming, their strengths were far beyond his imagination.<br/><br/>This gave him a great sense of crisis in his heart.\t\t\t\t\t\t</div>", "images": {}, "success": true}