{"id": 401, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132404.html", "title": "Chapter 401 - Chapter 401: Divine City In Chaos 401", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 401 - Chapter 401: Divine City In Chaos 401</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 401: Divine City in Chaos 401<br/><br/>By the time Tang Yue and Yin Suran reacted, Gu Yang’s figure had already disappeared. With such speed, they could not catch up no matter what.<br/><br/>“True person Yin, what should we do? Should we pursue him?”<br/><br/>Tang Yue asked anxiously. As Yin Suran was the envoy of the Alliance Leader, naturally she would take the lead.<br/><br/>She stared in the direction Gu Yang had disappeared and said, “We can’t catch up.”<br/><br/>At this point, Gu Yang had already left their sensing range.<br/><br/>Tang Yue, realizing he’d lost his composure, explained, “The Alliance Leader gave strict orders to bring him to the Alliance. Now how do we explain this to the Alliance Leader?”<br/><br/>“With his strength, even if you and I joined forces, we can’t beat him. If he’s determined to leave, how can we stop him?” Yin Suran responded smoothly.<br/><br/>Tang Yue sighed, “He is very wary of us.”<br/><br/>“Don’t worry, I have a feeling he’ll return.”<br/><br/>Yin Suran didn’t believe that a cultivator at the divine transformation stage would undertake pointless actions.<br/><br/>Even though she didn’t know why the genuine person Gu was hunting divine transformation monsters everywhere, she was certain that he had some purpose.<br/><br/>Of course, it’s also possible that he was acting out of goodwill, seeing the world fallen to such a point and helping them eliminate the toughest divine transformation monsters.<br/><br/>However, the probability of this was quite low.<br/><br/>She instructed, “In the future, arrange more patrols on the perimeter. Once they spot a divine transformation monster, take note.”<br/><br/>“Yes.”<br/><br/>“Let’s go.”<br/><br/>Regardless, Gu Yang’s elimination of ten divine transformation monsters in one go considerably eased the Four Directions Alliance’s pressure.<br/><br/>…<br/><br/>…<br/><br/>Two hours later, Gu Yang returned to Black Abyss Valley outside Huangmu City and paused.<br/><br/>He looked around with the Eye of the Candle Dragon, but didn’t find any trace of Xu Tianxing.<br/><br/>“Looks like this guy ran into trouble.”<br/><br/>Otherwise, Xu Tianxing would most likely be laying low nearby, and leave only when he (Gu Yang) leaves this ghost world.<br/><br/>Perhaps there might be one more Celestial Being level monster nearby.<br/><br/>Gu Yang thought to himself, and opened the Spatial Gate, leaving this world.<br/><br/>His goal had basically been achieved, acquiring twenty-three fragments. There was no need to stay here any longer.<br/><br/>The Ghostly Chart swallowed several thousand monsters a few days ago. Now, it seemed to have digestion issues and had fallen into a deep sleep. It would take at least one or two months for it to fully digest those monsters.<br/><br/>He didn’t want to face the Alliance Leader of the Four Directions Alliance for the time being. The demands they might make were too predictable—nothing but asking him to bring the cultivators of the Four Directions Alliance to the Human Realm.<br/><br/>He definitely couldn’t agree to this. It’s better not to meet at all.<br/><br/>Gu Yang crossed the Spatial Gate and returned to Tianfang Mountain. Taking a deep breath, he found the vitality between heaven and earth to be so pure and fresh, making him realize how beautiful the world was.<br/><br/>He had only spent three or four days in the Yellow Springs heavens, but he felt somewhat oppressed. Living in the Yellow Springs heavens for the long term would truly be worse than death.<br/><br/>Then, he took off and flew toward Divine City.<br/><br/>According to the previous plan, the Great Zhou’s army would launch an attack on the Barbarians’ cavalry during the Yaochi Conference.<br/><br/>However, he was away and didn’t know what the outcome of the battle was.<br/><br/>Gu Yang had faith in Su Ningyan’s adaptability, so they probably hadn’t suffered much.<br/><br/>But if it drags on, the situation would be hard to predict. Luo Wang probably couldn’t hold back the two Celestials by himself.<br/><br/>The Academy Director had to stay in Divine City to prevent Lord Chi Ming from launching a surprise attack.<br/><br/>Wen Jue’s cultivation level hadn’t yet solidified, so even if he stepped forward, the chances of victory were not high.<br/><br/>According to the last simulation, the Barbarian cavalry would reach Divine City one month later, implying that the Great Zhou troops had lost.<br/><br/>Given the military strengths of the two countries, such a quick victory or defeat could only mean that the two Celestials had participated and crushed the Great Zhou’s army.<br/><br/>It seems that they had lost all dignity.<br/><br/>Once one reached the Celestial Being realm, influencing the outcome of a battle was an easy task.<br/><br/>Five hundred years ago, when the Lin Family had a Celestial Being, the Qin Family reacted so greatly and even collaborated with all forces under heaven for a siege. This was because they knew that the Celestial from the Lin Family could subvert the Qin Dynasty’s rule.<br/><br/>…<br/><br/>Gu Yang knew that what he had to face was not merely the two Celestials from the Barbarians, but also several others coveting the flat peach.<br/><br/>One flat peach had stirred up winds and clouds across the world. Those Celestials who usually hid in seclusion one after another made their appearances.<br/><br/>This was something he hadn’t considered before.<br/><br/>He turned on the system.<br/><br/>[Would you like to use the Simulator? Using it once consumes one fragment.]<br/><br/>“Yes.”<br/><br/>He had too many strong enemies, so he had to upgrade his strength as soon as possible.<br/><br/>[At twenty-three, you have reached the first stage of the Celestial Being realm. You obtained a flat peach at the Yaochi Conference, which attracted the pursuit of several Celestials.]<br/><br/>[After leaving the Yellow Springs, you head to the Golden Court alone…]<br/><br/>[…and survive until the age of thirty-three.]<br/><br/>Gu Yang followed the path to the Golden Court. Otherwise, even if he could evade the pursuit of the Celestials, he could not evade the pursuit of the Immortal Palace of Yao Chi.<br/><br/>[Simulation ended. You can retain one of the following.]<br/><br/>[First, your martial arts realm at the age of thirty-three.]<br/><br/>[Second, your martial arts experience at the age of thirty-three.]<br/><br/>[Third, your life wisdom at the age of thirty-three.]<br/><br/>“I choose the first.”<br/><br/>Immediately, Gu Yang’s Immortal Element within his body experienced a substantial increase.<br/><br/>This was his third simulation after obtaining the flat peach, equivalent to consuming the third one. Its efficacy was nowhere near as potent as the first one.<br/><br/>However, it still greatly enhanced his cultivation level.<br/><br/>…<br/><br/>…<br/><br/>Meanwhile, while Gu Yang was continuously running simulations and improving his strength…<br/><br/>Divine City.<br/><br/>On the streets, pedestrians hurried along. Each street was guarded by soldiers, creating an atmosphere of severity.<br/><br/>Anyone seeing such a scene would know that something significant was about to happen.<br/><br/>Just yesterday, several mysterious powerhouses intended to forcefully enter the academy. The dean appeared and singlehandedly blocked them at the gateway with his sword.<br/><br/>At that time, their conversation was heard by almost everyone in Divine City.<br/><br/>These mysterious figures were surprisingly Celestial powerhouses!<br/><br/>From top-ranked Divine powerhouses to high-ranking officials, from Mortal realm warriors to commonfolk, everyone was startled to learn that Great Zhou had so many Celestial powerhouses.<br/><br/>A total of five Celestials.<br/><br/>God only knows where they came from.<br/><br/>These five Celestials were all here for Gu Yang.<br/><br/>Upon hearing this name, many people thought to themselves, he finally provoked the Celestials.<br/><br/>Ever since Gu Yang broke through to the Unleaking Realm, he had rarely shown himself and hardly any news about him had spread. Even if there was, they were deemed improbable and seemingly fictional.<br/><br/>The level he was on was beyond the reach of ordinary people.<br/><br/>Those privileged enough to know Gu Yang’s deeds would never casually spread such information.<br/><br/>For more than a month, the buzz surrounding the name “Gu Yang” had somewhat faded.<br/><br/>Until now, with such a grand display.<br/><br/>Which mortal in history was ever pursued by five Celestials?<br/><br/>These five Celestials seemed to be after something specific on Gu Yang.<br/><br/>The dean of the academy stood his ground with his sword, facing the five Celestials without the slightest retreat.<br/><br/>The standoff continued, and the overwhelming aura of the six Celestials nearly engulfed the entire Divine City. Only a few exceptions—like the royal palace—were spared. The common folk were having difficulty catching their breath under the pervasive pressure.<br/><br/>Under such a high-pressure atmosphere, Divine City suffered countless casualties; the elderly and infants simply couldn’t bear such a tremendous pressure.<br/><br/>Under this heavy atmosphere, Divine City endured through an entire day.<br/><br/>Whether they were warriors, commoners, nobles, or civilians, every single person was trembling with fear, worried that a battle might utterly destroy Divine City.<br/><br/>Celestials, they were Human Immortals, possessing the power to destroy the heavens and earth.<br/><br/>Several Celestials appearing in Divine City was an event that had not occurred since the Xia Dynasty a thousand years ago when the Xia Emperor battled Lord Chi Ming and other Celestial powerhouses…<br/><br/>The Qin dynasty fell merely due to the intervention of one Celestial.<br/><br/>And now, five of them appeared at once!<br/><br/>Great Zhou couldn’t possibly match this show of strength; it was all caused by this man named Gu Yang.<br/><br/>Worst of all, he was nowhere to be found at the moment.<br/><br/>Leaving the Dean to face the storm on his behalf.<br/><br/>It was common knowledge that the Dean was injured. No matter how powerful he was, there was no hope of winning against five Celestials.<br/><br/>Many people, in fear, wanted to leave Divine City, which resulted in chaos last night in this ancient city that had remained quiet for a thousand years.<br/><br/>If it weren’t for the Empress Dowager decisively sending in internal guards to suppress the turmoil, who knows what Divine City would have turned into.<br/><br/>PS: This is the second update. Please vote for a monthly pass.\t\t\t\t\t\t</div>", "images": {}, "success": true}