{"id": 408, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132418.html", "title": "Chapter 408 - Chapter 408: 408 The Truth Of The Way Of Heaven’S Collapse", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 408 - Chapter 408: 408 The Truth Of The Way Of Heaven’S Collapse</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 408: 408 The Truth of the Way of Heaven’s Collapse<br/><br/>This time, apart from these five openly hostile figures, there was another wicked plotter hiding behind the scenes — Lord Chi Ming.<br/><br/>In one of the simulations, Gu Yang was cunningly killed by Lord Chi Ming who was lurking in the shadows.<br/><br/>Therefore, as soon as he entered, he revealed the peach and found the position of the sneaky figure. Under the gaze of the Candle Dragon’s eye, the enemy’s movements were continuously tracked.<br/><br/>This adversary remained undisturbed, hidden within the void by some eerie method, effectively deceiving everyone present.<br/><br/>Had he not possessed the Candle Dragon’s eye, his traces would have been nearly impossible to discover.<br/><br/>Until now, that person had yet to depart, evidently still harboring intentions against him.<br/><br/>After being unmasked by Gu Yang, the person didn’t move an inch, seemingly under the misguided belief that he was bluffing.<br/><br/>He must be an old fox.<br/><br/>“It seems I’m overthinking…”<br/><br/>Whoosh!<br/><br/>Before he could finish speaking, he unsheathed his sword and sent out a sword intent.<br/><br/>This blow was unexpected.<br/><br/>The figure hiding in the void had just relaxed when the sword intent broke through the void and was at his face.<br/><br/>In his alarm, his figure wavered and he narrowly avoided the blow, although his clothing was torn in the process.<br/><br/>In reaction to the movement, a figure wrapped in a black cape was revealed.<br/><br/>Unlike the Witch King, who fled when things took a turn for the worse, this man was tall and from his aura, Gu Yang determined that he was a warrior.<br/><br/>The robed man’s shoulder had a cut; albeit a minor injury, it caused him to speak with a hoarse voice, “Candle Dragon’s Eye?”<br/><br/>“Gao Zekun?”<br/><br/>Gu Yang instantly figured out his identity.<br/><br/>It was indeed the Unleaking Realm cultivator of the Gao Family who had attempted to kill Gao Fan recently, but Gu Yang had saved him.<br/><br/>However, this man was clever, feigning self-destruction to escape.<br/><br/>There were many enemies who wished Gu Yang harm, but very few who survived against him, which showed that this Gao Zekun was no simple character.<br/><br/>Unexpectedly, this man, who was merely at the first level of the Unleaking Realm and severely injured, had drastically transformed, becoming a strong Celestial Being.<br/><br/>Gao Zekun, having his identity revealed, removed his mask and exposed his face.<br/><br/>His whole demeanor had changed since their last meeting. The greatest difference lay in his eyes which now bore an extremely detached look.<br/><br/>He coolly stated, “I forgot about the Candle Dragon’s Eye. The Divine Law of the Nine Heavens is indeed wondrous, but sadly…”<br/><br/>Pausing for a moment, he changed his tone, “Hmph, you’ve spoiled my plans again and again. Today, I will end your life.”<br/><br/>“Lord Chi Ming?”<br/><br/>Only then, Gu Yang realized that the person before him, Gao Zekun, had been possessed by Lord Chi Ming and turned into an incarnation of him. Surprisingly, he had managed to advance Gao Zekun’s cultivation level to the Celestial Being realm in such a short time.<br/><br/>This Lord Chi Ming’s methods were indeed extraordinary.<br/><br/>He laughed, “Never expected that you would personally come to kill me, such an honor indeed. However, killing me might be a bit challenging for you. Previously, you didn’t even stand a chance against the principal, and now you want to face two opponents. Do you have any method of winning?”<br/><br/>“I’ll make sure you understand how you will die.”<br/><br/>Gao Zekun didn’t rush to strike first. Instead, a strange smile formed on his face, “The moment you chose to advance in the Human Realm, the world will soon face destruction.”<br/><br/>“Everyone claimed that I am the demon who would bring about the world’s destruction, the root of all evil. However, compared to the aftermath of your actions, what I did really amounts to nothing.”<br/><br/>Gu Yang sneered, “World destruction? Just because I advance a level in the Human Realm, I can destroy the world? You’re giving me too much credit.”<br/><br/>“You’ve always wanted to know how the Way of Heaven was killed, right?”<br/><br/>Gao Zekun’s face showed an even stranger expression, “That was caused by a glance from beyond the Nine Heavens. One glance could cause Havens to collapse instantly. Several Da Luo perished instantly from just a glance, half of the Golden Immortals died, The thirty-three heavens met their downfall, with countless immortals falling. The Three Realms almost collapsed.”<br/><br/>“Among the cultivators of the Three Realms, some were lucky enough to survive. It was not until two thousand years later that an extraordinary genius appeared in the Human Realm. Just like you, he broke through to the realm of Human Immortal even when the Heavenly Dao was collapsing.”<br/><br/>“The situation then was just like today — a bloody scar appeared in the sky, dyeing the entire sky red. All cultivators were thrilled to find that the Heavenly Dao was beginning to revive. However, none suspected that a catastrophe was imminent.”<br/><br/>“Ten years later, a catastrophe arrived, wreaking havoc on the Way of Heaven that had just begun to recuperate. Almost all the cultivators who had survived were now dead. Only a very few, through various means, managed to stay alive,” he said.<br/><br/>“The Heavenly Phoenix Emperor who planned to scheme against you was also amongst those who perished in this catastrophe. He had left behind provisions for resurrection, but you destroyed them.”<br/><br/>“Now, eight thousand years later, another individual like you has appeared. When you chose to break through to the Human Immortal status in the Human Realm, the Way of Heaven began to recuperate. Unless there is an unexpected incident, an even more terrifying disaster will arrive in the next ten years. When the time comes, the Three Realms might completely perish.”<br/><br/>“Your unintentional move is about to cause the destruction of this world, and everyone will die because of you. Having learned the truth, boy, what are your thoughts?”<br/><br/>Guilt filled Gu Yang’s heart.<br/><br/>A mere glance was enough to cause a world’s Way of Heaven to collapse, killing many Golden Immortals and countless Immortal Gods. The whole world had nearly turned into the end of Dharma.<br/><br/>What kind of terrifying existence could have done such a thing?<br/><br/>It’s hard to imagine.<br/><br/>Regarding Gao Zekun’s accusation that he was responsible for the death of everyone in this world, he didn’t take it to heart.<br/><br/>After all, everyone would die in ten years, by then no one would care about such matters.<br/><br/>Gu Yang curiously asked, “Who was the owner of that glance?”<br/><br/>Gao Zekun originally thought he could shake his beliefs by saying such things. Surprisingly, he could not have cared less.<br/><br/>He made a miscalculation.<br/><br/>“The way of cultivation never ends, and no one knows what kind of existence he was, or why he chose to destroy this world in such a way.”<br/><br/>“After the start of the Way of Heaven’s recuperation, those ancient powerhouses who had concealed themselves in various ways during the ancient times would also start to return to this world- the incident at the Immortal Palace in Yao Chi, was just an anomaly.”<br/><br/>…<br/><br/>Within Divine City, only a few people heard their conversation.<br/><br/>Both the head of the Literati, Wu Er, Gao Fan, and others, as well as the one in the palace, all felt disturbed upon hearing “Gao Zekun’s” words.<br/><br/>So, the collapse of the ancient times was actually just the result of a glance cast by an awesomely powerful being.<br/><br/>A single glance was enough to almost destroy this world.<br/><br/>It turns out that the appearance of blood-stains in the sky was a sign that the Way of Heaven was beginning to resurrect.<br/><br/>After the Way of Heaven resurrects, there will be disasters arriving in ten years, even powerful Golden Immortals won’t be able to escape.<br/><br/>Let alone them, these Human Immortals, even those petty warriors who are less than Human Immortals?<br/><br/>Also, those ancient powerhouses hiding at the ends of time, are also starting to return…<br/><br/>These pieces of information, they were bombshells.<br/><br/>The person uttering these words was the infamous Lord Chi Ming. They were somewhat skeptical.<br/><br/>But one thing was definitely sure.<br/><br/>When the sky shows blood stains, a calamity will come. This has been recorded in many ancient books.<br/><br/>While they were still processing this flood of information, a peculiar change occurred to Gao Zekun. A crack opened in the sky, and a column of dark light fell upon him, which he continuously absorbed.<br/><br/>His aura began to grow rapidly, quickly surpassing the first and second stages of the Celestial Being Realm.<br/><br/>In a blink of an eye, he had reached the third stage of the Celestial Being Realm.<br/><br/>The era of the Xia Emperor was just this realm.<br/><br/>The sight sent shivers down their spines.<br/><br/>The Way of Heaven had just started to resurrect, and it was already able to elevate a worldly incarnation to the third stage of the Celestial Being Realm.<br/><br/>It was simply terrifying.<br/><br/>The incarnation of Lord Chi Ming that the headmaster had slain back then only had cultivation of the first stage of the Celestial Being Realm.<br/><br/>At this point, the headmaster’s cultivation level hadn’t completely recovered, Gu Yang had only reached the second stage of the Celestial Being Realm. Even if the two of them joined hands, could they possibly withstand it, even with the addition of Luo Wang?<br/><br/>PS: Ask for monthly tickets.\t\t\t\t\t\t</div>", "images": {}, "success": true}