{"id": 417, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132436.html", "title": "Chapter 417 - Chapter 417: 417 Alliance", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 417 - Chapter 417: 417 Alliance</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 417: 417 Alliance<br/><br/>At the entrance of the Water Moon Cave, there was a barrier set up by the Eastern Sea Sword Saint.<br/><br/>Gu Yang hadn’t been here since the last time when he made the Red-eyed Divine Ape his pet beast.<br/><br/>Of course, in the simulation, he had been here countless times already.<br/><br/>This barrier could only hinder those at the Unleaking realm or below. For a Celestial Being, it could be broken in one strike.<br/><br/>He didn’t even need to use a weapon. With a stroke of his finger, he tore a crack in it and walked through.<br/><br/>Upon leaving the cave, he saw a figure flying towards him. It was the Eastern Sea Sword Saint himself.<br/><br/>“It’s you!”<br/><br/>The Sword Saint was visibly startled upon recognizing him.<br/><br/>The last time they met, Gu Yang was still in the Mana realm.<br/><br/>And now, he seemed to have fused with the world around him, evoking a sense of transcendence that was clearly indicative of a Celestial Being.<br/><br/>How long had it been since he leapt straight from the Mana realm, skipped the Unleaking realm, and ascended to the status of a Celestial Being?<br/><br/>During this small interval, The Sword Saint had only just managed to consolidate his cultivation at the Unleaking realm.<br/><br/>Gu Yang dismissed him, the renowned powerful being whom he had once looked up to a year ago was no longer that significant in his sight.<br/><br/>He raised his head to look at the sky, there appeared a whirlpool, a powerful aura emanated from within.<br/><br/>“It’s here!”<br/><br/>This was the territory of the Golden Court Kingdom, so the arrival could be none other than the ruler of Golden Court herself.<br/><br/>He had interacted with her numerous times in simulations, but this was their first meeting in reality.<br/><br/>A figure stepped out of the whirlpool, upon seeing him, her pupils slightly constrict, “It’s you? You have already achieved godhood!”<br/><br/>The ruler of the Golden Court Kingdom was a woman, radiating an overbearing majesty from her body, too formidable to gaze upon directly. Above her head, a celebratory cloud demonstrated her nobility and power.<br/><br/>She appeared to be a young woman, but in reality, she was over ten thousand years old.<br/><br/>As the top individual in the Golden Court Cave today, she was a third-order Sky King, equivalent to a third-order Celestial Being.<br/><br/>A few months ago, she had sent two underlings to Heavenly Gang Mountain to fetch something, but things didn’t go as planned, so she commanded her subordinates to obliterate the mountain.<br/><br/>However, both of her subordinates were killed.<br/><br/>That wasn’t the main issue, after their death, the decrees inside their bodies mysteriously disappeared.<br/><br/>On the Golden Emperor’s Jade Scroll, there were two fewer star envoy positions permanently.<br/><br/>Such a thing had never happened before. In the past when subordinates died, either the decree was snatched away, or it returned by itself, never disappeared into thin air.<br/><br/>Since then, she began keeping her eye on him.<br/><br/>Before long, another celestial envoy got killed by him, whose decree also vanished into thin air.<br/><br/>This necessarily drew her attention, as the positions on the Golden Emperor’s Jade Scroll were fixed. The loss of one was effectively a weakening of the jade scroll.<br/><br/>This was undermining her roots, how could she possibly tolerate it?<br/><br/>However, that guy quickly disappeared. As much as she gritted her teeth in hatred, she was helpless.<br/><br/>She knew he was from the human realm, but people from the immortal realm were not allowed to descend to the human realm on their own. Especially after living for ten thousand years. Once they descend to the human realm, they would provoke the soul-hooking messengers from the Netherworld.<br/><br/>That was life-threatening.<br/><br/>Though theoretically after the collapse of the Way of Heaven, the Netherworld should also be affected.<br/><br/>Yet, she didn’t dare to gamble with her life. If she provoked the soul-hooking messenger, she would certainly die.<br/><br/>Later, that person appeared again. But by the time she sensed his aura and hurried over, it was too late.<br/><br/>The appearance of a new disciple at Heavenly Gang Mountain was also something she welcomed.<br/><br/>With that disciple around, if that person dared to come again, the people at Heavenly Gang Mountain would definitely be alerted, allowing her to rush over at the first sign of trouble.<br/><br/>Just now, she rushed over as soon as she sensed something.<br/><br/>However, upon seeing that person, she was stunned.<br/><br/>Godhood!<br/><br/>This guy had actually achieved godhood.<br/><br/>The last time she sensed his aura, he was clearly only at the Golden Core stage.<br/><br/>What had happened over these few months?<br/><br/>Why had his cultivation progressed so quickly?<br/><br/>Since childhood, she has been cultivating the Way of Heaven, starting as a small mountain deity and gradually amassing power to her current position. It took her more than ten thousand years to reach the later stages of divine transformation.<br/><br/>Just the journey from Sky General to Sky King took her seven thousand years.<br/><br/>However, he achieved that feat in just a few months.<br/><br/>A few months compared to seven thousand years…<br/><br/>One could only imagine the shock in the heart of the ruler of the Golden Court.<br/><br/>…<br/><br/>Unaware of her complex emotions, Gu Yang sensed the oppressive aura emitting from her. He finally understood why she swiftly entered the Hollow Void realm after gathering all the Golden Emperor jade volumes.<br/><br/>Her cultivation level had evidently reached the pinnacle possible for a Celestial Being — it far surpassed all the celestial entities he had ever encountered.<br/><br/>Unfortunately, her path was the Way of Heaven.<br/><br/>Although it came with many benefits, it was genuinely lackluster when it came to battles based on sheer strength.<br/><br/>Gu Yang had clashed with warriors, Immortal Cultivators, deities, Monster Race members, Beastmasters, Mages, Demonic Beasts, etc. Amongst these, deities were the weakest.<br/><br/>He performed a formal salute, introducing himself, “Let me first introduce myself. I am Gu Yang, from the Human Realm. I am here to discuss something with the Sky King.”<br/><br/>Even though she was shocked, the Ruler of Golden Court had seen many frightening scenes before. She quickly calmed down and said coldly, “You’ve killed my men and destroyed my imperial edicts. What is there left to discuss?”<br/><br/>“Allow me to finish speaking before you get angry, Your Majesty.”<br/><br/>“Fine, I want to see what tricks you’re going to play.”<br/><br/>“I can help you exterminate your two greatest enemies and reclaim the two parts of the Golden Emperor jade volume.”<br/><br/>The Ruler of Golden Court was shocked. It was not surprising that he knew about her two adversaries. But how did he know about the division of the Golden Emperor jade volume into three parts?<br/><br/>Only the three of them and those at the level of Sky Generals knew about it.<br/><br/>“What benefits would that bring you?”<br/><br/>“Once we succeed, I simply ask for a Sky King edict from Her Majesty.”<br/><br/>“That’s it?”<br/><br/>The Ruler of Golden Court eyed him suspiciously.<br/><br/>Truthfully, his request was too modest. It made it hard for her to believe that this was his actual intention.<br/><br/>With his power, providing so much help just to receive a single Sky King edict would make anyone doubt his motives.<br/><br/>It’s not rare for Immortal Cultivators to join the Golden Court and assume divine roles.<br/><br/>By doing this, they hope to experience a different Way of Heaven, making it easier to grasp a new Dao foundation.<br/><br/>As an experienced character, Gu Yang could tell from her reaction that his price was too low, so he proposed, “Would Her Majesty be willing to give me a Star Monarch’s edict?”<br/><br/>In the Golden Court system, the divine position of Star Monarch equated to the Hollow Void realm.<br/><br/>The Ruler of Golden Court shook her head, stating, “Even if I succeed in becoming a Star Monarch, I cannot directly appoint you as one.”<br/><br/>In the system of the Way of Heaven, the divine ruler who holds the right to confer divine titles cannot give another the same title as theirs. They can only appoint titles of a lower rank.<br/><br/>Gu Yang proposed, “How about bestowing me with a Star Monarch decree after we succeed?”<br/><br/>The Ruler of Golden Court weighed it quickly in her heart and made a decision, “Deal. However, we must swear an oath of our Original Spirits.”<br/><br/>This was a once-in-a-millennium opportunity. For her alone to kill the other two was almost impossible, despite being a minor phase ahead of them.<br/><br/>If it came to a battle among those of the Way of Heaven, it would be incredibly difficult to determine the victor if the divine titles were equal.<br/><br/>If push comes to shove, they might even join forces against her.<br/><br/>For thousands of years, the three of them had been battling, unable to determine a victor.<br/><br/>If things continue this way, it wouldn’t be impossible for the stalemate to last another one or two thousand years.<br/><br/>Gu Yang’s appearance could break the current deadlock.<br/><br/>It was a chance worth risking.<br/><br/>Without reuniting the Golden Emperor jade volume, she won’t be able to progress, no matter how much she cultivates and comprehends. That was the limitation of the Way of Heaven.<br/><br/>“Agreed.”<br/><br/>Gu Yang accepted immediately.<br/><br/>As for the Oath of Original Spirit, whether or not there would be serious consequences for breaking it depended on what served as the witness during the swearing-in.<br/><br/>However, after cooperating with the Ruler of Golden Court so many times in the Simulation, he naturally trusted her.\t\t\t\t\t\t</div>", "images": {}, "success": true}