{"id": 416, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132434.html", "title": "Chapter 416 - Chapter 416: 416 Heavenly Court", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 416 - Chapter 416: 416 Heavenly Court</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 416: 416 Heavenly Court<br/><br/>In the Sky Ruins, countless spatial rifts existed, which posed a significant danger to cultivators below the Nascent Soul level. However, for Celestial Beings, who have spiritual treasures that protect their bodies, if they take caution, these spatial rifts pose no problem.<br/><br/>Some of them were merely empty rifts that contained nothing.<br/><br/>Some others sheltered fragments of broken spaces, like the one where Gu Yang had discovered the corpse of the Candle Dragon, which was hidden within a particular spatial rift.<br/><br/>Now, Gu Yang encountered an extremely rare occurrence; this spatial rift led to another world.<br/><br/>A desolate, silent world.<br/><br/>Gazing across, it was an endless desert that extended to the horizon, devoid of any living creatures. Forget about animals, there weren’t even any signs of plant life.<br/><br/>He could not sense any moisture, and the air was incredibly thin, while the temperature had reached several hundred degrees.<br/><br/>This was certainly not a world suitable for ordinary people to live in.<br/><br/>Only those cultivators with high cultivation levels could make a brief stopover here.<br/><br/>The golden light that had pushed its way in earlier had disappeared.<br/><br/>Gu Yang raised his head and peered into the distance, faintly seeing a cluster of magnificent golden palaces floating in the sky.<br/><br/>He took to the air, arriving in front of a massive heavenly gate in no time.<br/><br/>Suddenly, he came to a halt.<br/><br/>The palace cluster in front of him far surpassed the imperial palace of Divine City in both scale and style. It was probably an Immortal Palace.<br/><br/>A strong Prohibition was set at the entrance.<br/><br/>The moment he approached, he felt an intense threat and stopped.<br/><br/>Gu Yang suddenly retrieved the Human Emperor Sword from his Beast-taming Space, and communicated with the Primordial Spirit inside the sword with his thoughts, “Senior, do you know where this is?”<br/><br/>The voice of the Primordial Spirit from inside the sword echoed in his mind, “This is the Heaven Realm built by that traitor, the Gold Emperor. Humph, back then, he sought the Great Dao of eternal life wholeheartedly, but in the end, it all came to nothing.”<br/><br/>Gu Yang became interested in the Gold Emperor, the third-generation Human Emperor. However, he still asked, “What about the Gold Emperor’s Jade Book in the Golden Court?”<br/><br/>The Primordial Spirit explained, “That’s just his experimental field. The initial form of the Heaven Realm, he abandoned it when he realized that the pocket universe was unable to carry the power of a Golden Immortal, and then he set out for a higher-order world. That is here, the Heaven Realm.”<br/><br/>His eyes brightened, “So this means that this is the highest level world among the Thirty-Three Heavens apart from the three major Heavenly Worlds? How did it end up in this state?”<br/><br/>The known Thirty-Three Heavens were divided into four levels: Pocket Universe, Heaven, Realm, Heavenly World.<br/><br/>It was his first time arriving at an Immortal Realm that belonged to the “Realm” level.<br/><br/>However, even the lowest level pocket universe could be preserved, so how could this place become a death region?<br/><br/>The Primordial Spirit of the Human Emperor Sword replied indifferently, “The Gold Emperor, along with his followers, has already marched into the Heavenly World. Those who stayed behind couldn’t survive the great catastrophe, it’s not surprising.”<br/><br/>In this case, the Gold Emperor seemed to be a formidable person, having managed to seize all authority of a Heavenly World.<br/><br/>Gu Yang knew too little about the ancient era, especially about those top-tier figures. He only knew of the Monster Race’s Emperor Phoenix, and now he learned another name, the Gold Emperor.<br/><br/>It appeared that the strength and prestige of the Gold Emperor should be higher than those of the Phoenix.<br/><br/>He said with some regret, “Pity, I can’t get in.”<br/><br/>Only moments ago, when he approached, the Prohibition of this Immortal Palace started reacting, and it was on the verge of becoming activated at any moment.<br/><br/>This place doesn’t seem to welcome him much.<br/><br/>In retrospect, it should be due to the Human Emperor Sword.<br/><br/>The Human Emperor Sword treats the Gold Emperor as a traitor, and it’s highly likely that the Gold Emperor also holds hostile feelings towards the Human Emperor Sword.<br/><br/>The perfectly preserved Immortal Palace was right before him, yet he could not go in; it was truly frustrating.<br/><br/>Who knows how many treasures were hidden inside?<br/><br/>The Primordial Spirit of the Human Emperor Sword declared, “That may not be the case.”<br/><br/>Upon hearing that there might be a chance, Gu Yang instantly asked, “Oh, could senior please instruct me?”<br/><br/>“Over the years, the Human Emperor Sword has slaughtered countless members of the Heaven Realm. It has long been irreconcilable with the Heaven Realm. Because you have been tainted by the aura of the Human Emperor Sword, you are naturally seen as an enemy by this Immortal Palace.”<br/><br/>“If you want to enter it, you have to go to the Golden Court, and get a Divine Amnesty of the Human Immortal rank. Once you refine it, you will be able to get inside.”<br/><br/>Gu Yang frowned, “Isn’t it true that warriors and the Divine Dao are in conflict with each other? How can I refine the Divine Amnesty of the Divine Dao?”<br/><br/>The Primordial Spirit asked, “Who told you that?”<br/><br/>With that, he was left speechless.<br/><br/>Upon careful consideration, even the “Taixuan Heavenly Book” hadn’t mentioned that the Immortal Dao and the Divine Dao were in conflict.<br/><br/>This belief was probably instilled in him while he was in the Simulator, he wasn’t sure who told him about it.<br/><br/>He had engaged in too many simulations, and his experiences related to this were too plentiful and chaotic for him to recall who told him about this.<br/><br/>Most likely, it was the Lord of the Golden Court.<br/><br/>The Primordial Spirit continued, “If there was a conflict between the Immortal Dao and the Divine Dao, how was the Gold Emperor supposed to study the Divine Dao?”<br/><br/>Indeed, he hadn’t considered such a simple question.<br/><br/>Gu Yang couldn’t help but smile bitterly. Hence, it was not good to speculate.<br/><br/>He said, “I understand.”<br/><br/>Then, he couldn’t resist asking again, “Senior, you are once at odds with those in the Divine Dao, right? If I refine the Divine Amnesty and possess the power of the Divine Dao, you wouldn’t take action to kill me, would you?”<br/><br/>Of course, this was said in a teasing manner. Considering that this was a proposal of the Human Emperor Sword, there was no reason for it to turn against him.<br/><br/>However, he was curious as to why the Human Emperor Sword had changed its attitude towards the Divine Dao.<br/><br/>“Times have changed. The grand catastrophe is imminent, and the world’s destruction is around the corner. The few Yuan Xi and Da Luo from ancient times who have survived by luck can’t be relied on. Even if this world is completely demolished, they still have ways to keep surviving.”<br/><br/>“Your power has already reached the pinnacle of this world. If your power can improve slightly, your chances of resisting the grand catastrophe in the future will increase. In the face of such calamity, disputes between the Immortal Dao and the Divine Dao are insignificant.”<br/><br/>After hearing his words, Gu Yang held up his thumbs in admiration, “Magnificent.”<br/><br/>Such magnanimity and spirit of defiance were befitting of the Human Emperor Sword.<br/><br/>“Flattery won’t work; I won’t take you as my master.” The Primordial Spirit of the Human Emperor Sword declared, then fell silent.<br/><br/>…<br/><br/>Gu Yang left the Gold Emperor Realm and returned to the Water Moon Pocket Universe.<br/><br/>Returning to the Gu Mansion, he gathered everyone at dinner time and announced, “I need to go out for a bit.”<br/><br/>Su Qingzhen and Chu Xiyue were clever. Given the change in his behavior when he came back, similar to an unsheathed sword, they knew he wouldn’t stay put much longer.<br/><br/>They had a premonition, so they weren’t surprised. They did not show much reluctance either.<br/><br/>They didn’t know about the impending catastrophe in ten years.<br/><br/>Gu Yang didn’t want them to carry such a formidable psychological burden, so he did not reveal this information to them.<br/><br/>They believed that there was plenty of time in the future. They were not anxious about it, merely reminding him to be careful.<br/><br/>…<br/><br/>The next day, Gu Yang left the Water Moon Pocket Universe. Stepping out of the Star Picking Pavilion, he looked at the bloody blemish in the sky that seemed to bleed down. It brought a sense of urgency to his heart.<br/><br/>With only ten years left, did he really have a chance to possess the power to resist the catastrophe within such a short time?<br/><br/>He didn’t know.<br/><br/>However, he would never give up. Even if there was a slim chance, he would take it.<br/><br/>With the Simulator, anything was possible.<br/><br/>If nothing else worked, he would find those surviving big shots to use as sacrifice.<br/><br/>For instance, the Yao Chi Immortal Palace, where the number of Immortal Realm powerhouses was not less than a thousand, if not hundreds at least.<br/><br/>Thinking up to this point, Gu Yang emitted a murderous aura, scaring the scholars from the nearby literary institute out of their wits.\t\t\t\t\t\t</div>", "images": {}, "success": true}