{"id": 418, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132437.html", "title": "Chapter 418 - Chapter 418: 418 Unification", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 418 - Chapter 418: 418 Unification</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 418: 418 Unification<br/><br/>Within the Golden Court Heavenly Cave, there are three main kingdoms – the orthodox Golden Court, and the two others are Wanjiang Country and Ten Thousand Moon Country.<br/><br/>The masters of Wanjiang Country and Ten Thousand Moon Country were originally siblings, but their relationship is very poor. If it weren’t for the common enemy, the Golden Court, they would have quarreled long ago.<br/><br/>In a certain secret space, the masters of Wanjiang Country and Ten Thousand Moon Country were having a private talk.<br/><br/>“I heard that the little bitch has been going out continuously for the past few months, and she has been going to the same place, Heavenly Gang Mountain. What is she plotting?”<br/><br/>This time, the master of Ten Thousand Moon Country took the initiative to contact her brother. The only person she fears in this world is Xuan Zhen, that bitch.<br/><br/>Xuan Zhen is the real name of the master of the Golden Court.<br/><br/>For the past thousand years, Xuan Zhen very rarely left the Golden Court. Yet recently, she has been leaving repeatedly and always to the same place, which is quite suspicious. She didn’t dare to take this lightly and was in a rush to discuss it with her brother.<br/><br/>No matter how strained their relationship was, when facing a common enemy, they had to join forces.<br/><br/>The master of Wanjiang Country said, “Don’t forget what kind of place Heavenly Gang Mountain is.”<br/><br/>“You mean? The passage to the Human Realm? She wouldn’t dare go to the Human Realm, would she?”<br/><br/>Master of Ten Thousand Moon Country sneered.<br/><br/>For an Immortal who is over ten thousand years old, The Human Realm is a Forbidden Land. Once you go there, you would be hooked by the soul-hooking messenger. Even Celestial Immortals can’t escape, let alone humble Human Immortals like them.<br/><br/>All three of them are over ten thousand years old.<br/><br/>Even after the collapse of the Way of Heaven, they did not dare to take such a risk. If they were hooked by the soul-hooking messenger, there would be no turning back.<br/><br/>They’re already at the peak of this world, blessed with a long lifespan. As long as the Golden Emperor’s Jade Scroll is still there, they will not die.<br/><br/>Why would they rush to the Human Realm?<br/><br/>Master of Wanjiang Country said, “A few months ago, a martial artist from the Human Realm broke in. They killed a few of Xuan Zhen’s subordinates, including a Sky King.”<br/><br/>Hearing this, the master of Ten Thousand Moon Country’s face changed drastically, “What? When did this happen? Why didn’t you tell me earlier?”<br/><br/>A Martial Artist from the Human Realm is like a taboo, touching her sensitive nerves.<br/><br/>A thousand years ago, the once mighty Golden Court was shattered by martial artists from the Human Realm. They had no choice but to submit to them.<br/><br/>The prestigious Human Immortals of the Immortal Realm had to submit to the martial artists of the Human Realm. This was a mortifying disgrace to her.<br/><br/>Fortunately, after that incident, no martial artists from the Human Realm appeared again.<br/><br/>Even after a thousand years, when she thinks back to the fear of being dominated by the martial artists of the Human Realm, she is still terrified.<br/><br/>Master of Wanjiang Country said nonchalantly, “It’s just a small cultivator, what’s so noteworthy about it.”<br/><br/>Fool!<br/><br/>The Master of Ten Thousand Moon Country almost cursed out loud, angrily saying, “If that man was really so insignificant, why would Xuan Zhen be so worried? Can’t you think about it? What if that person summons strong individuals from the Human Realm, the consequences are unimaginable.”<br/><br/>Master of Wanjiang Country was displeased, “That passage has always been there, and it will be discovered by the strong individuals from the Human Realm sooner or later, so what is there to worry about?”<br/><br/>“Humph, of course you don’t care. You had already become a dog to King Liang, so what’s the problem with being a dog to others?” The Master of Ten Thousand Moon Country said sarcastically.<br/><br/>The Master of Wanjiang Country was furious, “At that time, you begged for your life to survive, to ascend to power, you did not hesitate to offer yourself in bed——”<br/><br/>When the darkest moment of her past was mentioned, the Master of Ten Thousand Moon Country’s expression was distorted, and she roared, “If it weren’t for you betraying Father Emperor, and secretly allowing King Liang’s men to enter the Golden Court. Even if Father Emperor could not defeat King Liang, he would not have died easily.”<br/><br/>“Who told that old man not to let me ascend to the Sky King? I’m nearly ten thousand years old. If I don’t become a Sky King, I will die. If that guy can not consider father-son affection, then don’t blame me for being ruthless.”<br/><br/>“Do you have any clue how poor your qualifications are? Father Emperor planned to wait for you to ascend to the position of Star Monarch, and then directly establish you as Sky King. But he never imagined that you would be so out of your mind…”<br/><br/>Master of Ten Thousand Moon Country became more and more agitated as she spoke, this incident was a hurdle that she could never get past in her heart.<br/><br/>And this was why she hated her brother so much.<br/><br/>Her brother actually colluded with outsiders and launched a sneak attack on their father. It caused the Golden Court to be destroyed overnight.<br/><br/>Everyone who refused to submit to the King was killed.<br/><br/>At that time, she chose to survive by being lowly and humble. She endured, so as not to let the Golden Court be destroyed by her stupid brother.<br/><br/>Later, when King Liang disappeared without turning back, the entire Golden Emperor’s Jade Scroll was divided into three parts.<br/><br/>She and her brother both successfully ascended to the status of Sky King, but their strength was still inferior to Xuan Zhen.<br/><br/>When their Father Emperor died, he gave half of the Golden Emperor’s Jade Scroll to Xuan Zhen. The other half was taken by King Liang and divided in two, given to her and her brother.<br/><br/>This is why, only by them joining forces, they could compete with Xuan Zhen.<br/><br/>“Every man for himself——”<br/><br/>The Master of Wanjiang Country’s speech got cut off halfway, his face suddenly turned pale, shouting angrily, “You dare——”<br/><br/>Soon after, his avatar shattered instantly.<br/><br/>“What–”<br/><br/>This sudden twist of events shocked the ruler of Ten Thousand Moon Country.<br/><br/>She realized that something significant must have transpired in Wanjiang Country.<br/><br/>With Xuan Zhen’s unusual behaviour in mind, an ominous premonition surged in her heart, and she immediately tore through space to leave.<br/><br/>…<br/><br/>……<br/><br/>Ten Thousand Moon Country, despite having the smallest territory among the three nations, had the largest population. It was the land of abundant riches.<br/><br/>Years ago, the ruler of Ten Thousand Moon Country voluntarily pledged allegiance to the Sky King not only for protection but gifts and rewards.<br/><br/>In truth, if it weren’t for the Sky King’s bestowal, she wouldn’t have ascended to the throne of the Sky King so quickly.<br/><br/>Her father, the king, was intensely wary of everyone. To maintain his supreme position, he wouldn’t confer the divine position of Sky King to anyone easily.<br/><br/>This applied to his own children and even more so to outsiders.<br/><br/>This laid the foundation for the downfall of Golden Court.<br/><br/>Upon the death of the king, there was not a single Human Immortal to be found in expansive Golden Court.<br/><br/>Therefore, the ruler of Ten Thousand Moon Country didn’t entirely resent the Sky King. The ones she hated the most were her treacherous elder brother and Xuan Zhen, who usurped the Gold Emperor’s Jade Register originally belonging to Wanjiang.<br/><br/>Of course, once the Gold Emperor’s Jade Register was split into three, it was inevitable that the three of them would fight to the death.<br/><br/>Whoever it would be, they would want to merge the other two pieces of the Jade Register into one.<br/><br/>After the avatar of the Ten Thousand Moon Country’s ruler returned, she issued several orders, setting the massive machinery of Ten Thousand Moon Country into motion.<br/><br/>The first was to reinforce their defenses.<br/><br/>The second was to send someone to investigate what had happened in Wanjiang Country.<br/><br/>She had planted numerous spies in both Golden Court and Wanjiang Country, which is why she knew Xuan Zhen’s whereabouts like the back of her hand.<br/><br/>Time flew by and half a day passed.<br/><br/>The people she had sent haven’t returned with news yet, when an urgent report came in, stating simply, “Enemy attack!”<br/><br/>Before she even had time to react, her expression drastically shifted upon sensing a powerful yet familiar aura rapidly approaching.<br/><br/>The owner of that aura was none other than Xuan Zhen.<br/><br/>This scoundrel, he actually showed up in person!<br/><br/>In an instant, Xuan Zhen had arrived outside her palace. All the guards along the way were no match for him and could not hinder him at all.<br/><br/>Xuan Zhen loudly announced, “Ten Thousand Moon, it’s been a while. Hand over the Gold Emperor’s Jade Register, and I will spare you.”<br/><br/>“Dream on!”<br/><br/>The ruler of Ten Thousand Moon Country realized that her foolish brother must have met with some misfortune.<br/><br/>Now it was her turn.<br/><br/>The next moment, she saw a man standing beside that scoundrel Xuan Zhen. He raised his sword and swung it at her.<br/><br/>She instantly understood why Xuan Zhen dared to confront her and her brother.<br/><br/>He had external help.<br/><br/>Straight after, she plunged into complete darkness.<br/><br/>Everything was over.<br/><br/>…<br/><br/>“It’s over.”<br/><br/>As Xuan Zhen watched Gu Yang kill Ten Thousand Moon with a single stroke, he felt a complex mix of emotions.<br/><br/>A thousand years ago, a formidable individual from the Human Realm caused the Gold Emperor’s Jade Register to split into three.<br/><br/>Now, because of this warrior from the Human Realm, the Gold Emperor’s Jade Register could finally be reunited once more.<br/><br/>PS: The next chapter will be at one o’clock.\t\t\t\t\t\t</div>", "images": {}, "success": true}