{"id": 410, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132422.html", "title": "Chapter 410 - Chapter 410: 410 Transaction", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 410 - Chapter 410: 410 Transaction</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 410: 410 Transaction<br/><br/>Gu Yang headed to Divine City, along the way, he heard cheering noises that resembled ocean waves and even faint sobbing sounds within.<br/><br/>Under the Divine Power of observing all things, he “saw” many families conducting funeral rites, at a glance, about half of the families had lost a relative.<br/><br/>As the cheering disappeared, more sobbing sounds emerged.<br/><br/>He remained silent inside.<br/><br/>Those supreme celestial beings, whether they are powerful shamans from the Barbarian tribes, Great Saints from the Monster Race, southern witch kings or Taoist priests from sacred lands… they all disregard the right to live of ordinary people.<br/><br/>If he hadn’t owned the Simulator, he would have been just an ordinary person, no different from those in the city who died under the celestial beings’ coercion.<br/><br/>In an individual’s powerful abilities that could devastate the world, those powerful beings naturally wouldn’t regard ordinary people who are unable to withstand their breath.<br/><br/>If the fight earlier happened inside Divine City, half of the population of this world’s largest city would have died.<br/><br/>Just as he was thinking about this, he arrived at the academy.<br/><br/>The arrival of Gu Yang didn’t alert anyone. With his current cultivation level, if he didn’t want to be noticed, no one would see him.<br/><br/>The dean was waiting for him, this time, not in the Secret Realm, but in the Guangxian Hall of the academy.<br/><br/>This was the place where the academy would receive important guests.<br/><br/>The dean sat in the main seat, looking particularly formal.<br/><br/>Gu Yang, who was used to seeing him lounging around, felt strange at the sight of his seriousness.<br/><br/>The dean said with satisfaction, “You did better than I imagined.”<br/><br/>Gu Yang responded with humility, “I have to thank dean for teaching me the Zhanxuan Sword Technique.”<br/><br/>“Teaching you the sword technique that day was a helpless decision. Besides, you have already repaid the favor.”<br/><br/>The favor the dean referred to was the peach fruit from the Red Moon Great Saint’s body that Gu Yang gave him. That peach helped the dean’s injuries recover and he would soon return to his peak state.<br/><br/>He continued to warn, “Be careful of the Red Moon Great Saint. If I am not wrong, her real body and the flat peach must have developed a special bond. She will definitely spare no efforts to snatch the flat peach from your hands.”<br/><br/>Gu Yang nodded, he also had some speculation. The effects of these two kinds of peaches were somewhat similar.<br/><br/>The difference was that the flat peach has much greater effects compared to the peach from the Red Moon Great Saint’s real body.<br/><br/>He then discussed the important matter, “Have you sensed anything about the recovery of the Way of Heaven, dean?”<br/><br/>“In the past few days, there have been subtle differences, but it wasn’t until I drew my sword that it became more certain. The power of sword intent has increased by 20% more than before.”<br/><br/>Only increased by 20%?<br/><br/>Gu Yang felt that, during the three devastating styles, the power had increased by at least 50%.<br/><br/>Could it be that the higher the cultivation level, the greater the increase bestowed by the Way of Heaven?<br/><br/>He then asked, “What’s the truth behind what Lord Chi Ming said earlier?”<br/><br/>The dean shook his head and said, “There’s no reason for him to lie about such things.”<br/><br/>Indeed, even if they were deceived by this kind of lie, it would not harm them, nor would it benefit him.<br/><br/>Strategic deception is not this type of deception.<br/><br/>However, Gu Yang was somewhat confused, “Why did he tell us all this? I feel like he deliberately said it for us to hear. This face-to-face confrontation with me isn’t his usual style, either.”<br/><br/>If anyone understood Lord Chi Ming the best, it would be the dean, aside from those three from the Three Saints Gate. They had been opponents for hundreds of years.<br/><br/>Therefore, faced with Gu Yang’s confusion, he asked for his advice.<br/><br/>The dean pondered for a moment, and then said, “I guess he wants to form an alliance with us.”<br/><br/>Wow, the dean’s speculation is huge.<br/><br/>That was Gu Yang’s first reaction. He and Lord Chi Ming were deadly enemies.<br/><br/>Lord Chi Ming has committed countless massacres in the Human Realm. Both Wu Er and Gao Fan harbor deep hatred for him.<br/><br/>The dean had killed his clone with a sword and had held him back for hundreds of years.<br/><br/>Gu Yang had also foiled his plans a few times and had died at his hands many times in simulations. Adding in the forces related to him, there were too many to count.<br/><br/>There was no room for compromise between the two sides, they both wished to kill the other for their satisfaction.<br/><br/>And now, the dean was saying that Lord Chi Ming wanted to join forces with them?<br/><br/>Has he gone nuts?<br/><br/>The dean continues, “If what he said is true, many great powers will return in the next few years. Then, both him and us will be greatly challenged.”<br/><br/>“Those ancient powerful beings will definitely not accept the jurisdiction of Great Zhou. There will inevitably be conflicts with us. Similarly, there will be huge disagreements between them and Lord Chi Ming. Instead of being defeated one by one, we might as well join forces to fight.”<br/><br/>“Earlier, he was testing your strength to see if you qualified to join forces with him.”<br/><br/>Hearing this, Gu Yang thought it made sense.<br/><br/>Old monsters like Lord Chi Ming, who have lived for countless years, would never be blinded by hatred. Rationally speaking, the two sides joining forces to resist those ancient powers is indeed the best choice.<br/><br/>But how could Gu Yang possibly trust him?<br/><br/>To join forces is nothing more than a dream.<br/><br/>He decisively said, “I will never join forces with him.”<br/><br/>The dean nodded and said, “Of course, all of this is just my speculation. It’s not necessarily accurate.”<br/><br/>Gu Yang said, “Don’t worry, those ancient powers might not appear in the Human Realm.”<br/><br/>After his breakthrough to the rank of a Celestial Being, he had engaged in twenty plus simulations. In those simulations, he never encountered any returning ancient powers.<br/><br/>That is to say, even if some power has truly returned, it would not conflict with him.<br/><br/>Anyway, there are only ten years left now.<br/><br/>If his strength cannot be elevated in these ten years to the level of resisting the ray of divine light, then there would simply be no future for him.<br/><br/>This time’s tribulation of death was almost unsolvable.<br/><br/>Even a Da Luo Golden Immortal was unable to resist it. His current position was at least a light year away from Da Luo.<br/><br/>In ten years, could he reach a realm above Da Luo?<br/><br/>Gu Yang wasn’t confident.<br/><br/>…<br/><br/>…<br/><br/>After leaving the dean, Gu Yang was going to the Moonlit Cave Realm, to meet Su Qingzhen and the others.<br/><br/>When the five Celestial Beings descended, the dean sent Su Qingzhen and others to Moonlit Cave Realm right away, to avoid them getting involved.<br/><br/>This arrangement was very appropriate. Without the method to open the Cave Realm’s door, even a Celestial Being would not be able to forcibly enter.<br/><br/>“Youngster.”<br/><br/>Suddenly, a familiar voice sounded in his ear. He felt an odd power surge immediately after, and before he could react, everything before his eyes blurred, and he was in a peculiar space all of a sudden.<br/><br/>This was a tight space. The one who brought him here was that mysterious elder who had helped him on Dragon Gate Island.<br/><br/>Gu Yang was a bit shocked. He was now at the second tier of Celestial Beings, yet he was easily displaced to here.<br/><br/>His methods were a bit similar to those used by Lu Ying during the Yaochi Conference.<br/><br/>The tactics used by these powerhouses, left behind by the ancients, were always unexpected.<br/><br/>“What business does elder have that he had to bring me here?”<br/><br/>The old man somehow took out a peach, took a bite, a tempting aroma filled the place.<br/><br/>A flat peach!<br/><br/>He really did bring out some flat peaches from the Yao Chi Immortal Palace.<br/><br/>His methods were really unpredictable.<br/><br/>Gu Yang became even more curious. What was this old man’s identity in ancient times?<br/><br/>The old man finished the flat peach in three bites, didn’t even spare the pit, throwing it in his mouth and swallowing it down after chewing for a bit, then praised, “This is a flat peach that matures once every ten thousand years, eat one and you can prolong your life by a myriad of years. You, young man, don’t have this luck.”<br/><br/>Gu Yang nearly rolled his eyes. Had he gone with him at that time, he would have been screwed. No matter how much a ten thousand years life-extending flat peach can extend life, if one can’t obtain it, it’s of no use.<br/><br/>“Elder, your methods are extraordinary. Had I gone with you, I would only have been a burden. I’m unworthy of this grace.”<br/><br/>“That’s not necessarily true.” The old man smiled slightly, “This old man has a proposal for you. I’ll give you this flat peach in exchange for something of yours.”<br/><br/>So he had taken a liking to my belongings and wanted to trade for it with a flat peach.<br/><br/>Gu Yang suddenly realized and jokingly said, “What elder has taken a liking to, wouldn’t be the Human Emperor’s sword, right?”<br/><br/>The old man vigorously shook his head, “The heavy responsibility of the Human Race’s greatest honor, this old man does not wish to bear. All generations of Human Emperors didn’t end well, do you think that is a coincidence? This old man advises you, before it recognises you as its master, find it a suitable owner to avoid misfortune in your later years.”<br/><br/>There’s such a saying?<br/><br/>Gu Yang really wanted to take out the Human Emperor’s sword and ask its primordial spirit.<br/><br/>He thought better of it and said, “Thank you for the reminder, elder. May I know what has elder taken a liking to?”<br/><br/>“The Life-Death Ledger.”<br/><br/>So that thing was the Life-Death Ledger.<br/><br/>When Gu Yang heard this name, he knew what the elder was referring to. That spiritual treasure he had just obtained from the Great Shaman.<br/><br/>“Sorry, this item is not up for exchange.”<br/><br/>PS: Only two chapters today.\t\t\t\t\t\t</div>", "images": {}, "success": true}