{"id": 414, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132430.html", "title": "Chapter 414 - Chapter 414: Why Are You Forcing Me 414?", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 414 - Chapter 414: Why Are You Forcing Me 414?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 414: Why are you forcing me 414?<br/><br/>When the imperial carriage came into the sight of the residents of Huang Family Town, everyone was petrified. Many of them fell to their knees, worshipping the celestial being in the sky.<br/><br/>In a blink, the convoy stopped in front of a manor outside the Huang Family Town.<br/><br/>A woman, who looked like a court lady, came out from the side and shouted, “The Emperor is here, why are you not kneeling to welcome him!”<br/><br/>Her voice carried an unforeseeable divine power, akin to a heavenly mandate, and no one dared to disobey.<br/><br/>Upon hearing this, the residents of Huang Family Town ran out of their homes like madmen.<br/><br/>Even Huang Yongkang, who had Golden Core cultivation level, felt a stir in his heart. He cursed inwardly, “Demeaning to have a Nascent Soul cultivator acting as a handmaid, is this Prince Cheng not afraid of divine retribution!”<br/><br/>Suddenly, he noticed his own parents were also affected and rushed out like mad. Unable to consider the risk of revealing his identity, he quickly intervened, knocking his parents unconscious and carrying them home.<br/><br/>Fortunately, his fiancee remained unaffected and hence saved him from disgrace.<br/><br/>The Nascent Soul cultivator’s technique wasn’t a simple mind-bending spell, it involved a certain profound principle that represented the unchallenged path of the emperor. Those with lower cultivation levels could not resist this command.<br/><br/>However, there was no movement from the Gu Mansion.<br/><br/>In such a situation, its tranquility seemed highly abnormal.<br/><br/>“As I expected, Elder Gu must have made some preparations at home.”<br/><br/>Huang Yongkang admired Elder Gu even more.<br/><br/>He had met Lady Gu before, identified her as a beginner cultivator, and realized she couldn’t possibly resist this mandate.<br/><br/>Moreover, there were numerous servants in the manor who had no cultivation power.<br/><br/>Elder Gu must have made necessary arrangements in advance.<br/><br/>…<br/><br/>In the imperial carriage, Prince Cheng noticed something peculiar, his gaze flashed a strange purple light, looking at the house.<br/><br/>This sight caused his heart to jump wildly.<br/><br/>“Body of Taiyin, Ice and Jade Bone, the Displaced Immortal Body, the Heavenly Phoenix Body…”<br/><br/>There were a few women in the courtyard who had extraordinary constitutions.<br/><br/>Even in ancient times, such constitution was scarce, yet now they appeared together, living in the same courtyard.<br/><br/>If he hadn’t seen with his own eyes, he would never have believed it.<br/><br/>A few women even had body types that he didn’t recognize, but undoubtedly they were on the same level as the Body of Taiyin.<br/><br/>“Heaven helps me!”<br/><br/>Prince Cheng was overjoyed. His cultivation method required the help of women. If he could gather these naturally gifted women, he could hope to reach a higher realm, the Hollow Void.<br/><br/>He lifted the curtain and got off the imperial carriage.<br/><br/>Next to him, the Nascent Soul female cultivator hastily bowed.<br/><br/>However, Prince Cheng ignored her, walked straight to the entrance, and loudly announced, “I am the master of the Jade Emperor Pavilion, wanting to meet the ladies.”<br/><br/>His followers were utterly surprised.<br/><br/>When had their master become so polite, even stating that he was asking to meet them?<br/><br/>In the past, if he wanted a woman, he would simply take her by force.<br/><br/>The Nascent Soul cultivator beside him, originally from a small sect, was forcibly abducted by his men and forced to serve as his handmaiden.<br/><br/>…<br/><br/>With a creak, the door opened.<br/><br/>A man and a woman stood inside, arm in arm, looking like a pair of immortal lovers.<br/><br/>The man asked, “Who do you wish to see?”<br/><br/>Prince Cheng’s face was originally adorned with an easy smile, but when he saw the man, his gaze involuntarily shrank.<br/><br/>Until he saw the man, he was totally unaware of his existence.<br/><br/>Being able to hide his presence up close, without doubt, he was not a person to be taken lightly.<br/><br/>An Ascended Being?<br/><br/>He immediately became cautious and asked, “Who are you, sir?”<br/><br/>The man smiled and revealed his white teeth, saying, “You break into my home, behave arrogantly, intending to see my women. And you still ask me who I am?”<br/><br/>What?<br/><br/>Prince Cheng, as if doused with cold water, abruptly calmed down.<br/><br/>Exactly, how could so many females with natural Dao Bodies appear here without reason?<br/><br/>He was just too blinded by desire that he forgot they may already have masters.<br/><br/>Or rather, he did not care before. He just didn’t expect that the man behind them would be a God-converting strongman.<br/><br/>Simply put, he became arrogant after advancing to the God-converting stage, believing that besides the Bi Shui Daoist and Shen Bulin, he had no other rivals. He even looked down on the Water Moon Sect.<br/><br/>No matter what, he could never have imagined that in this unremarkable place, there would be a God-converting cultivator.<br/><br/>But, is this person really a God-convert?<br/><br/>Although Prince Sheng was a little surprised, he was naturally suspicious and immediately doubted in his heart, asking, “May I know how to address you?”<br/><br/>The man answered casually, “Gu Yang.”<br/><br/>This name, Prince Sheng had never heard of, which deepened his suspicion.<br/><br/>Having presided over the Jade Emperor Pavilion for hundreds of years, he was familiar with every God-converting being that had appeared in this world, and there was not a single one with the surname Gu among the Nascent Soul cultivators whose whereabouts had been unknown for nearly a thousand years.<br/><br/>Prince Sheng did not know how his father, Yun Piaomiao, and Fu Wansheng died.<br/><br/>In the Water Moon Sect, only the Bi Shui Daoist and Shen Bulin knew the truth. They were tight-lipped and did not tell anyone.<br/><br/>He simply assumed that his father, Yun Piaomiao, and Fu Wansheng had perished together.<br/><br/>Before his departure, his father had handed over the most crucial inheritance, clearly foreseeing the outcome of his journey.<br/><br/>No matter how creative he was, he would never imagine that these three top figures in the world were all killed by the same person, and that person was from another world.<br/><br/>For those cultivators who had never been in contact with outlanders, it was truly something from another world.<br/><br/>Out of caution, Prince Sheng then asked, “May I ask where you come from?”<br/><br/>…<br/><br/>Seeing Prince Sheng’s cautious look and continuous probing, Gu Yang found it somewhat amusing.<br/><br/>This guy was worried about kicking an iron plate but reluctant to give up. His little trick was as clear as if it were written on his face.<br/><br/>Such a man could actually cultivate to the Celestial Being realm.<br/><br/>Furthermore, his aura was quite similar to that of a late-stage Nascent Soul cultivator who had recently died by his, no, by the Emperor Sword’s hand; they were obviously from the same lineage.<br/><br/>What was that guy’s name?<br/><br/>Oh, he never asked.<br/><br/>“Wen Institute.” Gu Yang wanted to see what he would do in the end, so he gave a false name.<br/><br/>If you really want to say it, he belonged to no school or sect. The cultivation techniques he practiced were basically obtained in the simulation.<br/><br/>Only the Zhanxuan Swordsmanship was passed down from the Institute’s headmaster.<br/><br/>This sword technique was now his most powerful means of dealing with enemies. If he really had to say which faction he belonged to, it would be the Wen Institute.<br/><br/>In his heart, Prince Sheng was even more certain that this person probably used a special method to deceive his perception. He could not possibly be a God-converting cultivator.<br/><br/>This was a judgment made from various aspects.<br/><br/>Even if there were unexpected circumstances, he was not afraid.<br/><br/>With that thing at hand, even if he encountered experienced God-converting cultivators like the Bi Shui Daoist or Shen Bulin, he was confident he could escape.<br/><br/>Prince Sheng ultimately didn’t want to miss such an opportunity and said, “May I ask you to give me these women? The reward I can offer will surely satisfy you.”<br/><br/>The smile on Gu Yang’s face disappeared. He turned to Chu Xiyue and asked, “How do you want to deal with this idiot?”<br/><br/>Chu Xiyue looked at him with shining eyes and said, “You decide.”<br/><br/>“It’s not easy for the Water Moon Sect to produce another God-convert. I didn’t really want to kill.”<br/><br/>These past few days, he had been with Chu Xiyue and Su Qingzhen, living in a domestic bliss, he felt calm and no longer thought about fights.<br/><br/>Sometimes he thought that just living like this with them was quite good too.<br/><br/>He was originally a modern man who grew up in a peaceful era; if he hadn’t traversed to this dangerous world, he would never have liked violence.<br/><br/>It was the environment that forced him to become a decisive and ruthless person.<br/><br/>During these days, he had reclaimed some of the leisure and relaxation he had experienced during his modern life.<br/><br/>But this man was intent on seeking death, and with just one sentence, he stirred up the killing intent in his heart.<br/><br/>“There are some words that you can’t take back once you’ve said them,” he said.<br/><br/>Gu Yang threw a punch, hitting right in the chest of Prince Sheng, shattering his mortal body.<br/><br/>PS: There is another chapter ahead.\t\t\t\t\t\t</div>", "images": {}, "success": true}