{"id": 419, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132440.html", "title": "Chapter 419 - Chapter 419: 419 Entering Heaven", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 419 - Chapter 419: 419 Entering Heaven</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 419: 419 Entering Heaven<br/><br/>[You have obtained two fragments, current fragments count: twelve.]<br/><br/>After Gu Yang had killed the ruler of Ten Thousand Moon Country with one sword strike, he saw the prompt in front of him, but no waves of emotion rippled through his heart.<br/><br/>It didn’t matter if they were the rulers of Wanjiang Country or Ten Thousand Moon Country, their strength was mediocre, and they both met their ends by a single sword stroke.<br/><br/>Both of them had the cultivation level of second-order Celestial Beings.<br/><br/>However, Gu Yang wondered in his heart, if the people in the Way of Heaven are all so weak, how could the Heavenly Court, built by the Gold Emperor, become one of the three giants?<br/><br/>The three Heavenly Worlds were eventually occupied by three forces. Calling them the three giants could not have been more fitting.<br/><br/>Could it be that the weakening of these gods was due to the division of the Golden Emperor’s Jade Scroll into three parts?<br/><br/>Gu Yang had already learned about the transformation of the Golden Court from the ruler of the Golden Court.<br/><br/>Simply put, it was because of a traitor that the Golden Court was easily destroyed by King Liang. The only survivor was the ruler of the Golden Court, who managed to escape with half of the Golden Emperor’s Jade Scroll, preserving the lineage of the Golden Court.<br/><br/>Later, King Liang mysteriously disappeared. The ruler of the Golden Court assumed the position of the Sky King by virtue of the Golden Emperor’s Jade Scroll. Upon returning, she annihilated all of King Liang’s followers and rebuilt the Golden Court.<br/><br/>During that time, the siblings from Wanjiang and Ten Thousand Moon ascended to the Sky King’s position and had comparable power to hers.<br/><br/>The three maintained a balance of power, resulting in a three-way deadlock in the Golden Court for nearly a thousand years.<br/><br/>Today, the ruler of the Golden Court has finally unified the Golden Emperor’s Jade Scroll.<br/><br/>Unless unexpected, she will reach the realm of the Hollow Void in a few years.<br/><br/>And Gu Yang would also get what he needed.<br/><br/>Two days later, the ruler of the Golden Court re-refined the Golden Emperor’s Jade Scroll, extracted a Sky King’s decree, and gave it to him.<br/><br/>The ruler of the Golden Court said, “The decree of the Star Monarch level could only be retrieved when I reach the position of Star Monarch.”<br/><br/>“Alright.”<br/><br/>Gu Yang had no objections to this. The Star Monarch level, also known as the realm of Hollow Void, even if she gave him the decree, he would not be able to refine it.<br/><br/>For a cultivator who wants to simultaneously practice the Way of Heaven, it is challenging to self-refine a higher-level divine appointment. Unless one received the divine appointment directly from a divine lord, allowing him to take that position.<br/><br/>It is said that in ancient times, some cultivators with strong connections ascended by this method, giving them early experiences of higher realms and thereby quickly comprehending the profound essence.<br/><br/>After receiving the pardon order, Gu Yang left the Golden Court.<br/><br/>When passing Heavenly Gang Mountain, he glanced at the Sword Saint of the Eastern Sea on the distant hilltop, gave a slight smile, and walked into the passageway.<br/><br/>As far as he was concerned, the Sword Saint of the Eastern Sea had become an insignificant character and was not worth his attention.<br/><br/>Upon returning to Great Zhou, he activated the system.<br/><br/>[Would you like to use the Life Simulator? To use once, consumes two fragments.]<br/><br/>“Yes.”<br/><br/>[At the age of twenty-three, you are already a second-order of Celestial Being, your battle outside Divine City has bestowed upon you the reputation of the strongest in the world.]<br/><br/>[You went to the Golden Court, assisted the ruler of the Golden Court in taking back the Golden Emperor’s Jade Scroll. You obtained a Sky King’s decree.]<br/><br/>[You, accompanied by Su Qingzhen and others, used the elf clan’s long-distance teleportation array to travel to the West Bank Continent, undertaking bitter cultivation in the Mist Forest.]<br/><br/>[Ten years later, one day, a ray of light fell from the sky, and you died on the spot at the age of thirty-three.]<br/><br/>He went to the West Bank Continent but could not escape the fatal light.<br/><br/>Gu Yang was not discouraged. It was just an attempt.<br/><br/>If it was so easy to avoid, what could be considered a major catastrophe?<br/><br/>[The simulation ended, you can keep one of the following.]<br/><br/>[One, martial arts realm at the age of thirty-three.]<br/><br/>[Two, martial arts experience at the age of thirty-three.]<br/><br/>[Three, life wisdom at the age of thirty-three.]<br/><br/>“I choose one.”<br/><br/>Suddenly, Gu Yang could feel his cultivation level soaring again.<br/><br/>He now had seventeen peaches, including a ten-thousand-year-old one. Each simulation was equivalent to consuming seventeen peaches.<br/><br/>The boost to his cultivation level was huge.<br/><br/>Upon reaching the second-order Celestial Being, he needed to comprehend another essence.<br/><br/>This was not a difficult task for him.<br/><br/>Techniques like Shenxiao Six Extinctions and Zhanxuan Swordsmanship were all at the Celestial Being level.<br/><br/>Especially Shenxiao Six Extinctions, each of them embodied a different essence, yet they all led to the same destination.<br/><br/>He had already mastered the first five forms, signifying that he could easily grasp the five different Dao essences.<br/><br/>He chose the Dao path of Thunderous Destruction, which was the second form.<br/><br/>…<br/><br/>“Let’s try another location.”<br/><br/>Gu Yang knew how terrifying the calamity in ten years would be, so it was crucial to increase his strength as soon as possible.<br/><br/>[Twenty-three years old…]<br/><br/>[You and Su Qingzhen proceed to Ruiqin Continent, taming the golden phoenix bird as a pet beast. After destroying the ancient teleportation array, you head to the Beast God Temple, but are rejected by the temple’s messenger and can’t enter.]<br/><br/>[You find a location for heavy training, but three years later, Yao Chi Immortal Palace launches an invasion and you are enlisted by the Beast God Temple to defend alongside other Beastmasters.]<br/><br/>[Three years later, in the final battle, a land immortal appears in the Beast God Temple, and he single-handedly slays all the invading enemies of the Yao Chi Immortal Palace. This ends the war chaos.]<br/><br/>[Four years later, a Celestial Immortal appears in the Ruiqin Continent, conciliates with the Beast God Temple’s messenger. They wish to join forces against the calamity of doomsday.]<br/><br/>[Another year later, the catastrophe spreads to the Ruiqin Continent, a beam of light descends from the sky, killing you, you died at the age of thirty-four.]<br/><br/>It works.<br/><br/>Seeing that he had somehow survived for an extra year, Gu Yang felt quite buoyed.<br/><br/>This meant that although the calamity was terrible, it wasn’t without solutions.<br/><br/>However, what stunned him was that a land immortal emerged in the Ruiqin Continent just six years later, and a Celestial Immortal appeared ten years later.<br/><br/>This suggested that the speed of Heaven’s revival was somewhat beyond his imagination.<br/><br/>Why hadn’t he encountered such strong beings in the human realm before?<br/><br/>Could it be because the Ruiqin Continent is a third-tier Immortal World?<br/><br/>In ancient times, Ruiqin Continent was Penglai Heaven. The ruler of this realm was once a powerful Golden Immortal.<br/><br/>This was both good news and bad news.<br/><br/>The good news was that theoretically, in the Immortal World, he could achieve Celestial Immortal or even Golden Immortal status within ten years, provided he could get enough fragments.<br/><br/>The bad news was that the higher-level Immortal World he explores, the more likely he is to encounter powerful enemies.<br/><br/>According to the system’s nature, he might offend a land immortal or even a Celestial Immortal for no apparent reason.<br/><br/>[The simulation has ended; you can keep one of the following]<br/><br/>[One, martial arts realm at the age of thirty-four.]<br/><br/>[Two, martial arts experience at the age of thirty-four.]<br/><br/>[Three, life wisdom up till the age of thirty-four.]<br/><br/>“I choose the first one.”<br/><br/>Gu Yang once again experienced the joy of an explosion in cultivation level.<br/><br/>Although it was slightly less than the previous time, it was still a major advancement.<br/><br/>He could feel that he was not far from reaching the third stage of Celestial Being.<br/><br/>Even during the ancient times, not everyone was privileged to boost their cultivation level with peaches during the Human Immortal period.<br/><br/>Even the direct disciples of the Yao Chi Palace Master could not afford such luxuries.<br/><br/>The potency of such an exquisite Immortal delicacy diminishes with the second ingestion. To use it for cultivation purposes was simply a waste of heavenly materials.<br/><br/>The master of the Yao Chi would never allow such a thing to happen.<br/><br/>The only ones who could feast on peaches were him and the mysterious elderly man who had plundered the Yao Chi Immortal Palace.<br/><br/>“It’s a success.”<br/><br/>At the same time, Gu Yang successfully refined the Sky King’s Decree, able to borrow the divine power within it.<br/><br/>However, once he had left the Golden Court Cave, the power within the decree diminished with each use, and once exhausted, he must return to the Golden Court Cave to have it restored by the ruler of the Golden Court.<br/><br/>Now that he had harnessed the power of the divine path, Gu Yang ended the simulation and headed towards Divine City.<br/><br/>Upon returning to the Academy, he entered the Water Moon Cave, setting a course for the Sky Ruins.<br/><br/>He hadn’t forgotten that the trip to the Golden Court Cave was to acquire the power of the divine path and gain access to the sky palace within the Golden Emperor’s realm.<br/><br/>The Immortal Palace seemed well preserved from the outside. If the inside was still intact, he might be able to get his hands on some valuable things.<br/><br/>Whether it was elixirs or divine treasures, it was all he needed.<br/><br/>Soon, Gu Yang was once again in front of the Immortal Palace. Holding the decree, he tentatively flew inside.<br/><br/>This time, he encountered no obstacles and smoothly entered the palace.\t\t\t\t\t\t</div>", "images": {}, "success": true}