{"id": 413, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132428.html", "title": "Chapter 413 - Chapter 413: 413 Please Come To The Door", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 413 - Chapter 413: 413 Please Come To The Door</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 413: 413 Please come to the door<br/><br/>Nowadays in this world, there were very few people who could pose a fatal threat to Gu Yang, not even his biggest foes in the past, Lord Chi Ming and Red Moon Great Saint of the Three Saints Gate, could touch him for the time being.<br/><br/>And those ancient powers, they all chose to keep a low profile.<br/><br/>Even Yao Chi Immortal Palace started to act more discreetly, only planning to invade the vast magical worlds after one year, stirring up a storm across the Three Realms.<br/><br/>He now had enough leisure time to spend with Su Qingzhen and the others, although, he couldn’t do anything for now.<br/><br/>There was a clear division between immortals and mortals, given his current physical condition, mortals couldn’t possibly bear his affection.<br/><br/>When he could’ve done something before, he didn’t grasp the opportunity. Now that he was in the mood and in high spirit, he dare not touch them.<br/><br/>This was quite a headache for him.<br/><br/>Apart from this, Gu Yang’s days were quite filled with fun, he spent every day with one of them in turn, which could be said was a real mastery of balance.<br/><br/>Most of Su Qingzhen and the others’ time was spent on cultivation, they didn’t need to be stuck together for 24 hours.<br/><br/>It was enough to accompany them for meals, practice some skills, and take them around to enjoy different sceneries.<br/><br/>If it was modern-Earth, with so many girlfriends, he would be torn apart into five pieces and it still wouldn’t be enough.<br/><br/>On this day, it was Chu Xiyue’s turn, she asked about the young man who came to visit that day, “Who is Huang Yongkang?”<br/><br/>“The protagonist of this magical world.” Gu Yang said offhandedly, around them, he didn’t need to hold back and use the conversation style of Great Zhou, he could be his authentic self, sometimes even uttering modern terms.<br/><br/>Chu Xiyue understood what he meant and exclaimed, “A young person with such a high level of mana, unheard of.”<br/><br/>“Maybe, he’s the reincarnation of some ancient power.” Gu Yang guessed. Then he suddenly remembered, he was also regarded as a reincarnation of a powerful being.<br/><br/>This was quite a broad theory, invoking it when a genius with an extraordinary rate of progress emerged, which would then label them with the title.<br/><br/>Of course, he was not a genius, he was more formidable than any geniuses because he had a cheat.<br/><br/>Chu Xiyue then asked again, “The old man by his side, is he in the Unleaking Realm?”<br/><br/>“He’s in the late period of Nascent Soul, just one step away from entering the realm of Spirit Transformation.”<br/><br/>Although that old man was very good at concealing himself, how could he possibly deceive Gu Yang’s eyes? Gu Yang saw through his cultivation level at a glance.<br/><br/>As Gu Yang was speaking, his expression shifted suddenly. He turned his head toward a certain direction, his face turning a little strange.<br/><br/>Seeing him look strange, Chu Xiyue asked, “What’s the matter?”<br/><br/>“Trouble is coming.”<br/><br/>He sighed resignedly,” I thought by hiding here, we could enjoy a few peaceful days, but it turns out I can’t avoid it.”<br/><br/>Before, he always suspected that he was being targeted by the will of the Way of Heaven. Every time his strength enhanced, he always encountered all sorts of new troubles and enemies.<br/><br/>Now, it was almost confirmed.<br/><br/>This time he came to the Water Moon magical realm, he had been staying within the villa, spending time with a few women, without stirring up any trouble.<br/><br/>But even so, trouble came knocking on the door.<br/><br/>And the incoming person turned out to be a cultivator in the Spirit Transformation stage, moreover, not one of the two he had met before.<br/><br/>It’s simply absurd.<br/><br/>Why is it so hard to enjoy a few peaceful days?<br/><br/>…<br/><br/>…<br/><br/>A few hundred miles away, an imperial carriage drawn by a pair of green phoenix birds arrived from the horizon.<br/><br/>At the front, eight palace maids carrying flower baskets, scattered various flower petals along the way.<br/><br/>Then came a carriage pulled by a pair of white cranes, on which were a dozen palace maids, playing various musical instruments.<br/><br/>Behind were more than a dozen golden-armoured guards, all of them had Golden Core cultivation level.<br/><br/>Some wandering cultivators far away saw this scene and avoided it from a distance.<br/><br/>This kind of parade was unique in Water Moon Realm, only Prince Sheng of Jade Emperor Pavilion would be so particular when travelling.<br/><br/>Among the few main Sects, Jade Emperor Pavilion behaved the most domineeringly. If anyone stood in their way, they were likely to drop dead on the spot. No one dared to mess with them.<br/><br/>However, those wandering cultivators all found it strange. This was the territory of Water Moon Sect, what could possibly happen that the Jade Emperor Pavilion would show up so openly here?<br/><br/>And also, this imperial carriage seemed a little different from the one in the stories about Prince Sheng. Judging from its shape and specifications, it was clearly a level higher than the prince’s.<br/><br/>…<br/><br/>“This Prince Sheng is truly vain.” Outside of Huang Family Town, Huang Yongkang watched the luxurious imperial carriage in the distance, muttering sourly.<br/><br/>He had sharp eyes and recognized at a glance that the carriage was a Pure Yang level Magic Treasure.<br/><br/>He had never seen such a level of Magic Treasure being used as transportation.<br/><br/>“I warned him not to mess with those women, he’s just asking for death.”<br/><br/>His tone was somewhat gloating.<br/><br/>He witnessed Gu Yang slaying Youming Laozu just a while ago, even the Nascent Soul stage cultivator was easily killed by him, Gu Yang’s strength was truly immeasurable.<br/><br/>Next to him, the old man said indifferently, “She is of the Yin Body, one of the rarest cultivation bodies from ancient times. It’s fatal attraction for Wei Sheng, master of dual cultivation, isn’t something that can be swayed by your simple warning.”<br/><br/>“The Yin Body? Is it Lady Gu that we met a few days ago?”<br/><br/>“You remember the woman in white we saw on No Return Mountain last time, right? She also has the rare Displaced Immortal Body, likely a reincarnated Celestial Immortal.”<br/><br/>Huang Yongkang said enviously, “Elder Gu is so lucky, enjoying the embrace of women on both sides. I’m the one who suffered, actually ended up in the hands of that menacing woman.”<br/><br/>“Speak louder, she might just hear you.”<br/><br/>Huang Yongkang coughed awkwardly, quickly changing the topic, “Old man, what should we do now?”<br/><br/>“Don’t look at me, I can’t beat Wei Sheng, he has two fierce generals with him. If we really come to blows, it’s courting death.”<br/><br/>“We can’t just ignore it. If anything happens to Lady Gu, how will we explain it to Elder Gu?”<br/><br/>“Don’t drag me into this. I don’t owe him any life debt, this is your business.”<br/><br/>“Old man, you can’t just stand by and watch someone die, can you?”<br/><br/>Just as the argument was heating up, a clear and loud voice rang out, “The Crown Prince of the Jade Emperor Pavilion has arrived, your lack of hospitality is noted.”<br/><br/>Shortly after, several silhouettes dropped from the sky, all at the Nascent Soul Cultivation Level.<br/><br/>The man leading them had an unfathomably deep Cultivation Level.<br/><br/>Huang Yongkang curiously asked, “Who is this guy? He seems rather impressive.”<br/><br/>The older man stared at the sword in the stranger’s hand and said, “That’s Shi Mingyuan, Fu Wansheng’s senior disciple. It seems that the rumor is true. Fu Wansheng, along with Emperor Wei as well as Yun Piaomiao; the three of them who had reached the God Transformation Stage, have perished.”<br/><br/>Huang Yongkang excitedly responded, “Now it’s getting interesting. Crown Prince Sheng versus Shi Mingyuan, both Nascent Soul stage cultivators. It’ll be a good show.”<br/><br/>The old man disagreed, “People of their level don’t just fight casually. In my opinion, Shi Mingyuan will definitely make a concession to Wei Sheng.”<br/><br/>…<br/><br/>A grand and authoritative voice echoed from inside the imperial palanquin, “So it’s Brother Shi. It’s been two hundred years, and you haven’t changed at all. This visit is because of a woman. I hope Brother Shi can grant me this favor, there will be a repayment in the future.”<br/><br/>As soon as he finished speaking, the music stopped, and everything fell silent.<br/><br/>This man was none other than Crown Prince Sheng, the successor to the Jade Emperor Pavilion. After Emperor Wei’s death, he was elevated to the imperial throne and started to call himself ‘Our Majesty’.<br/><br/>Shi Mingyuan wasn’t surprised by the news of Emperor Wei’s death; for the Water Moon Sect, it was no secret.<br/><br/>Similarly, Jade Emperor Pavilion knew about the death of his master, Fu Wansheng.<br/><br/>The current Water Moon Wonderland was now ruled by both the Water Moon Wonderland and the Ten Thousand Dao Gate, as Master Bi Shui Daoist and Shen Bulin were both still alive.<br/><br/>Both the Jade Emperor Pavilion and the Water Moon Sect wouldn’t wish for any trouble at this time, as it would weaken their power. A single misstep could lead to the Sect’s destruction. This is why Crown Prince Sheng assumed Shi Mingyuan would give way.<br/><br/>Shi Mingyuan asked, “Are you referring to the woman from the Gu Family Villa three hundred miles away?”<br/><br/>From inside the imperial palanquin came that dominant voice again, “Brother Shi’s guess is indeed accurate, I admire that. Since you know who she is, you must understand how important she is to me. I am determined to have her.”<br/><br/>Shi Mingyuan shook his head, “If you want any woman, I would not obstruct you. But you cannot touch any woman from the Gu Family.”<br/><br/>His voice wasn’t loud, but his tone was firm, leaving no room for debate.<br/><br/>…<br/><br/>“Has Shi Mingyuan gone mad?”<br/><br/>The old man was stunned, finding it hard to believe.<br/><br/>With the death of Fu Wansheng from the Water Moon Sect, they lost their greatest supporter. Shi Mingyuan should be laying low instead of provoking Crown Prince Sheng for an unknown woman. Regardless of who wins, it will bring no benefits to the Water Moon Sect.<br/><br/>However, Huang Yongkang immediately understood, “He must have done this for Elder Gu. Elder Gu certainly commands great respect, even Shi Mingyuan stood up for his woman.”<br/><br/>The old man’s curiosity deepened, “Just who the hell is Gu Yang if Shi Mingyuan is willing to provoke Crown Prince Sheng just to protect his woman?”<br/><br/>…<br/><br/>Crown Prince Sheng, on the imperial palanquin, was also puzzled and his tone hardened, “Brother Shi, have you thought it through? You want to be our enemy, for an unrelated woman?”<br/><br/>Shi Mingyuan remained unmoved, instead he persuaded, “Crown Prince, you still can back down now.”<br/><br/>Being from the same era, they were often compared and competed with each other. Over the years, though they never had a real fight or any deep conversation, they regarded each other as rivals and friends.<br/><br/>But today, they might really have to determine who’s better.<br/><br/>The atmosphere instantly became tense.<br/><br/>Inside the palanquin, Crown Prince Sheng calmly said, “No matter what your reasons are for protecting that woman, I will not back down. No one can stop me, not even you.”<br/><br/>As he spoke, a terrifying aura surged into the sky.<br/><br/>“God Transformation Stage?”<br/><br/>…<br/><br/>Several hundred miles away, outside Huang Family Town, the old man was dumbstruck. He could hardly believe that Crown Prince Sheng had silently reached the God Transformation Stage.<br/><br/>With a swoosh, he disappeared.<br/><br/>Huang Yongkang was also flabbergasted. He was already used to the old man’s cowardice and tendency to run away at the slightest sign of danger.<br/><br/>He muttered, “Elder Gu, it’s not that I don’t want to help. I’m just powerless.”<br/><br/>If it were just a Nascent Soul cultivator, he and the old man could figure out a way to at least delay them, and provide Lady Gu an opportunity to escape.<br/><br/>But against a God Transformation cultivator, they had no chance.<br/><br/>Even if they stepped forward, they would not be helpful and would only lose their lives in vain.<br/><br/>Not to mention himself, even Shi Mingyuan, a major cultivator in the late Nascent Soul Stage, wouldn’t dare to provoke the God Transformation cultivators, right?<br/><br/>…<br/><br/>Shi Mingyuan was also in shock, having long been rivals with Crown Prince Sheng, he was familiar with each other’s Cultivation Level. Although they were in the late Nascent Soul Stage, they were still a long way from becoming Celestial Beings.<br/><br/>Without three to five decades of accumulation, it was impossible to reach that threshold.<br/><br/>How could he suddenly break through to the God Transformation Stage?<br/><br/>At this moment, the imperial palanquin continued its journey towards Huang Family Town.<br/><br/>Shi Mingyuan’s expression changed several times, then suddenly turned around and said, “Don’t go.”<br/><br/>The imperial palanquin did not stop at all, heading straight towards Huang Family Town.<br/><br/>Shi Mingyuan closed his eyes with a hint of pain, seemingly preempting the outcome awaiting Crown Prince Sheng.<br/><br/>PS: I’ve been busy renovating recently, so many annoying things to deal with. So there’s only one release today, and it’s a bit longer.\t\t\t\t\t\t</div>", "images": {}, "success": true}