{"id": 411, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132424.html", "title": "Chapter 411 - Chapter 411: 411 This Deal Is Worth It", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 411 - Chapter 411: 411 This Deal Is Worth It</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 411: 411 This deal is worth it<br/><br/>“Don’t be in a hurry to refuse.”<br/><br/>After the old man ate the flat peach that only ripens every ten thousand years, there was no change in his aura. It was as if he had just consumed a regular peach.<br/><br/>Despite being rejected by Gu Yang, he wasn’t agitated. Still smiling, he said, “I heard that you’ve obtained a flat peach at the Yaochi Conference. But what about the women around you?”<br/><br/>“You are charming and romantic, quite like myself in my youth. With the mortal realm on the brink of unprecedented changes, haven’t you thought of improving their strength?”<br/><br/>“The flat peach can do more than prolong life. For a mortal, consuming one can result in immediate ascension to immortality. Although the flat peaches of today no longer hold the divine effects of the ancient times, it’s not hard to ascend to the realm of Human Immortal with a few years of effort.”<br/><br/>A notion struck Gu Yang. From the old man’s words, he was willing to exchange a number of flat peaches for the Book of Life and Death.<br/><br/>Although the flat peaches weren’t particularly beneficial to him anymore, Su Qingzhen and the others were indeed his weaknesses.<br/><br/>As his cultivation level continued to rise, the gap between him and them continued to widen.<br/><br/>There is a serious distinction between mortals and immortals.<br/><br/>The Mortal Realm and the Divine Power Realm belong to the domain of mortals.<br/><br/>When the gap widens to a certain extent, the relationship naturally changes. He has already reached the Celestial Being realm while the highest among Su Qingzhen and her companions was just at the Divine Power realm. The lowest were still in the Mortal Realm.<br/><br/>In the next ten years, only two people, Ye Lingbo and Chu Xiyue, have the chance to break through to the Celestial Being realm.<br/><br/>The rest, who were considered talents in the Mortal Realm, could only rely on time after reaching the Divine Power realm. Without one or two hundred years, they would have no chance at all.<br/><br/>Gu Yang didn’t have a better solution as the ancient resources that could enhance cultivation levels, wonderful elixirs, and treasures had disappeared.<br/><br/>The two things that he had on hand that could directly enhance cultivation were the peach from the Red Moon Great Saint and the other was the flat peach.<br/><br/>But these two things were not enough to share among everyone.<br/><br/>If he could trade this spirit treasure for several flat peaches and each woman could receive one, it would indeed be a tempting proposal.<br/><br/>It wouldn’t necessarily be a loss. This was about meeting each other’s needs.<br/><br/>Gu Yang asked, “What use does senior have for this Book of Life and Death?”<br/><br/>Seeing that Gu Yang’s stance had changed, the old man knew he was in. He said, “In fact, what you have is a replica. The Black Emperor of ancient times created this spirit treasure when he captured a Soul-hooking messenger. Perhaps through this replica, you can find the real Book of Life and Death.”<br/><br/>Hearing that it was a replica, Gu Yang was somewhat disappointed, but soon realized that it was normal. How could the real Book of Life and Death end up in the hands of someone like Great Shaman?<br/><br/>The old man continued, “Since the Soul-hooking messenger couldn’t hook your soul, it means that you can’t use this spirit treasure. It’s useless to keep it. After all, using it once would reduce your lifespan. Using it too often might cause death.”<br/><br/>Gu Yang couldn’t help but laugh, “If you encounter an unbeatable enemy and can’t even keep your life, why worry about reducing your lifespan? This is a thing for saving lives. Even if I can’t use it, there’s still the dean.”<br/><br/>His implication was clear. A life-saving spirit treasure wasn’t something that could be traded away for just anything.<br/><br/>Seeing that the negotiation was almost complete, the old man made his offer, “Ten thousand-year-old flat peaches.”<br/><br/>Gu Yang looked troubled, “Too few… Ten won’t be enough to share.”<br/><br/>“Fifteen, no more.”<br/><br/>“Look, now Lord Chi Ming can create a third-stage Celestial Being avatar at any time. If he brings a few avatars to round up on me, I won’t be able to stand it…”<br/><br/>“You audacious boy, asking for so much! Plus a ten thousand years’ flat peach, okay?”<br/><br/>“Deal!”<br/><br/>Gu Yang spoke so much just to bargain. Since he decided to sell the Book of Life and Death, he had to sell it for a good price.<br/><br/>Fifteen thousand-year-old flat peaches and one ten thousand-year-old flat peach met his expectations.<br/><br/>He was satisfied and agreed to the terms.<br/><br/>Then, they made the trade, money for the goods.<br/><br/>Sixteen flat peaches were all packed neatly in jade boxes. If such majestic elixirs weren’t stored properly, letting the aura dissipate and waste, it would be a big pity.<br/><br/>Gu Yang’s mood improved after receiving the peaches. He considered the Book of Life and Death replica to be rare but worth only a few fragments.<br/><br/>Trading for sixteen flat peaches was definitely a great deal.<br/><br/>It meant that for each Simulation he carried out in the future, he could consume seventeen flat peaches. Ten simulations would mean one hundred and seventy peaches…<br/><br/>Moreover, when thousand-year-old flat peaches no longer have any effect on him, he could give them to Su Qingzhen and the others, with one peach for each to spare.<br/><br/>This was a total win.<br/><br/>Gu Yang’s face remained calm as he took the opportunity to ask, “Senior, is what Lord Chi Ming said true?”<br/><br/>After receiving the replica of the Book of Life and Death, the old man was in high spirits, “Most of it is true. However, those old guys who hid away to survive won’t easily reveal themselves after arriving in the Mortal Realm.”<br/><br/>“Why so?”<br/><br/>“Once they reveal their whereabouts, they can’t escape the imminent catastrophe in ten years. They barely have time to hide, let alone interfere with mortal affairs. The Master of Yaochi loves shows, taking in so many disciples, yet in the end, she was betrayed by her own disciples.”<br/><br/>The old man gleefully discussed this.<br/><br/>Gu Yang nodded, understanding that what he said was the truth. In his Simulations, he had not encountered any ancient powers returning in the next ten years.<br/><br/>“Senior, how did that catastrophe of the ancient times come to be?”<br/><br/>At this question, the smile on the old man’s face faded, and he said casually, “It wouldn’t harm to tell you. Years ago, someone discovered three higher level worlds. Blood was shed over the ownership of these worlds leading to countless deaths.”<br/><br/>“In the end, the three Heavenly Worlds were occupied by the three most powerful forces. They found out that the Heavenly Worlds were boundless, and the Way of Heaven was unfathomable. For cultivators, this was the real immortal realm.”<br/><br/>“Soon, news came that one of the Emperors ascended further and grasped the Way of Creation. Shortly after, a gaze from that Heavenly World’s entrance stretched directly into the Mortal Realm, collapsing the Way of Heaven immediately. All foundations of cultivation vanished.”<br/><br/>Gu Yang asked, “Does senior mean that the breakthrough of that Emperor brought about this catastrophe?”<br/><br/>“Yes and no, who knows. Afterwards, all who entered that Heavenly World to figure out the truth never returned.”<br/><br/>The old man raised his head and said, “See the scar in the sky? That’s the entrance to that Heavenly World. If you succeed in Creation someday, maybe you can go in and see.”<br/><br/>“That’s enough for today. Don’t tell anyone about our meeting. We’ll meet again if we’re destined.”<br/><br/>The old man didn’t want to talk any longer. With a wave of his hand, he sent Gu Yang away.<br/><br/>…<br/><br/>Gu Yang returned to the academy as the scenery before his eyes changed.<br/><br/>The dean appeared beside him with a serious look on his face, asking, “What happened?”<br/><br/>Gu Yang shook his head, replying “Nothing.”<br/><br/>Since the old man specifically instructed him not to, he would naturally keep quiet.<br/><br/>The dean didn’t ask further. Seeing that Gu Yang was fine, he left.<br/><br/>Gu Yang continued on his way to the Star Picking Pavilion, broke open the spatial barrier on the top floor, and entered the Water Moon Cave again to see Su Qingzhen and the others.<br/><br/>Recently, he had been busy preparing for the Yaochi Conference and dealing with the pursuit of five Celestial Beings. Every time he returned to the Divine City, he came and left in a hurry without a good reunion with them.<br/><br/>Now he finally had time to be with them.\t\t\t\t\t\t</div>", "images": {}, "success": true}