{"id": 412, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132426.html", "title": "Chapter 412 - Chapter 412: 412 Is Worthy Of Joy And Congratulations", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 412 - Chapter 412: 412 Is Worthy Of Joy And Congratulations</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 412: 412 is worthy of joy and congratulations<br/><br/>Water Moon Cave Heaven, Gu Yang has already lost count of the number of times he had entered it. This time, however, it felt a bit different than before.<br/><br/>Could it be that the recovery of the Way of Heaven on the human realm had so quickly influenced the Water Moon Cave Heaven?<br/><br/>Outside the old temple, he was immediately aware of the location of Su Qingzhen and the others, upon his arrival.<br/><br/>Su Qingzhen, Ling Ling, Pei Qianlan, Chu Xiyue, Lily the sorcerer from the West Bank Continent, Cao Yiyi…Even Ye Lingbo, who had chosen to stay in Water Moon Cave Heaven, was present.<br/><br/>They were located outside the nearest town, where they had built a mansion. Constructing such a large-scale building in such a short period of time must have required quite some effort.<br/><br/>With a flash, Gu Yang appeared at the mansion’s gate. Seeing the “Gu Mansion” inscription on the gate, he felt a pang of guilt.<br/><br/>They had been by his side uncomplainingly for so long, knowing full well that he had several women, yet they never abandoned him.<br/><br/>He couldn’t provide them with consistent companionship, let alone an official status.<br/><br/>He was truly a scoundrel.<br/><br/>At this time, there were several uninvited guests in the mansion. Chu Xiyue, who used to be an heiress from a great family, was adept at handling such situations and was in charge of welcoming them.<br/><br/>A couple of the unexpected guests were familiar faces.<br/><br/>The other three were women cultivators with high cultivation levels. According to their introductions, they came from the Jade Emperor Pavilion.<br/><br/>Gu Yang didn’t rush in. He listened outside for a while and learned that the guests wanted to invite Su Qingzhen and the others to join the Jade Emperor Pavilion.<br/><br/>He had heard of this sect. It was one of the most powerful ones in the Water Moon Cave Heaven, as renowned as the Ancient River Sword Sect.<br/><br/>They had quite an eye for talent, seeing the potential in Su Qingzhen and her friends.<br/><br/>Their giftedness, in any realm, would be considered top-notch.<br/><br/>At this moment, a languid voice sounded in the hall, “Emperor Wei just died a few days ago. Prince Sheng has just ascended the throne, and he’s already in a hurry to gather female cultivators. Isn’t he rather restless?”<br/><br/>The three female cultivators looked astonished, “Impudent! How dare you disrespect His Majesty? Do you realize your wrongdoing?”<br/><br/>“I am so scared. Emperor Wei is dead. Do you think that the Jade Emperor Pavilion is still the same Jade Emperor Pavilion? You dare to show up without even understanding the situation, you’re courting death.”<br/><br/>The languid voice spoke sarcastically.<br/><br/>The three female cultivators from the Jade Emperor Pavilion, although extremely angry, dared not cause a scene. They swallowed their anger and said, “Who are you indeed? Will you tell us your name?”<br/><br/>“My name has always been the same, and I have never changed it. Huang Yongkang.”<br/><br/>The man who spoke was Gu Yang’s old acquaintance, Huang Yongkang. The old man who was with him, was his master.<br/><br/>“Demon Sect’s Holy Child?”<br/><br/>“Mischievous Demon Child?”<br/><br/>The three female cultivators were horrified. Huang Yongkang’s name was known throughout the Water Moon Cave Heaven.<br/><br/>Recently, two powerful wandering cultivators had appeared in this world. One was known as the Demon Blade Asura, who could slay Nascent Soul cultivators as if he were cutting vegetables, with his demonic blade.<br/><br/>Five of the nine peak masters of the Ancient River Sword Sect died under his blade. His strength was formidable, known as the first person below the God transformative level.<br/><br/>The other was the Holy Child of the Demon Sect. Although his cultivation level was not as high as the Demon Blade Asura’s, he was extremely cunning. Several Nascent Soul experts had suffered at his hands.<br/><br/>Wherever he went, he stirred up trouble, and those with far greater cultivation levels than his had no way to deal with him.<br/><br/>This Mischievous Demon Child was notorious.<br/><br/>The so-called Holy Child of the Demon Sect was not afraid of anything. He had offended all the large sects, making people itch with hatred, but they were helpless against him.<br/><br/>Prince Sheng had already taken over the management of the Jade Emperor Pavilion.<br/><br/>Only a few people knew about the death of His Majesty within the sect, which Prince Sheng ordered to be strictly confidential.<br/><br/>The news was only known by the higher echelons of several major sects. How did Huang Yongkang get hold of this information?<br/><br/>One of the female cultivators spoke coldly, “Our sect has no old grievances with you. Must you insist on having a beef with our Jade Emperor Pavilion?”<br/><br/>Huang Yongkang disdainfully replied, “I couldn’t care less about the affairs of your Jade Emperor Pavilion. You shouldn’t have come here. My advice to you is: roll as far away as you can. Don’t bring trouble to Prince Sheng that he doesn’t need.”<br/><br/>“You — very well, let’s wait and see.” The female cultivator finished speaking, turned around, and left with her group.<br/><br/>…<br/><br/>Once the people from the Jade Emperor Pavilion left, Huang Yongkang immediately became serious in front of Chu Xiyue, his host, and said without shifting his gaze, “My lady, this Jade Emperor Pavilion is one of the strongest sects in our realm. Their divine transforming behemoth may have died, but there are several Nascent Souls within their sect.”<br/><br/>“Given Prince Sheng’s way of doing things, he won’t let it rest. It is wise for you to prepare early.”<br/><br/>Chu Xiyue, looking at this young boy with a cultivation level at the realm of mana in front of her, was somewhat startled and cautiously asked, “Do you know my husband?”<br/><br/>“Elder Gu imparted knowledge and saved my life. I regard him as a teacher and a father…”<br/><br/>“Cough, cough!”<br/><br/>At this, the boy’s proper master couldn’t stand it any longer and coughed heavily as a warning.<br/><br/>Huang Yongkang continued, “If only one Nascent Soul from the Jade Emperor Pavilion comes, my master and I can handle it. But I’m afraid they’ll disregard martial ethics and send several Nascent Souls.”<br/><br/>“It’s best for you to avoid the storm for now, my lady. Of course, if Elder Gu were here, these insignificant characters would not be a concern.”<br/><br/>Chu Xiyue wasn’t the type of person who simply believes what others say, and responded, “Thank you for the reminder. Both of you came looking for my husband, but unfortunately, he’s not at home. Please excuse any negligence on my part.”<br/><br/>Huang Yongkang hastily said, “We have imposed on you, my lady. Since Elder Gu is not here, we shall leave first.”<br/><br/>After saying so, he left with his master.<br/><br/>…<br/><br/>Once the pair left, Gu Yang surfaced in front of Chu Xiyue.<br/><br/>Chu Xiyue, seeing Gu Yang reappear after many days, was initially startled and seemed to scarcely believe it. Then, she involuntarily had tears welling up in her eyes.<br/><br/>He stepped forward, drew her into an embrace, and softly said, “You’ve lost weight since we last met.”<br/><br/>Chu Xiyue shook her head, rested her head against his chest, closed her eyes, and once more shook her head.<br/><br/>After a moment, she suddenly remembered something, raised her head and spoke with worry, “Several Celestial Beings came to the academy looking for you. They demand you hand over something. You didn’t get caught by them when you returned to the academy, did you?”<br/><br/>Knowing they must have been very worried, Gu Yang reassured her, “Relax, I’ve already taken care of it.”<br/><br/>Seeing Gu Yang speak of it so lightly, Chu Xiyue halted any further words.<br/><br/>She felt that he was trying to comfort her by saying such things, in order to ease her anxiety.<br/><br/>Seeing her disbelief, Gu Yang said, “Actually, I’m a Celestial Being now. Of those five men, I killed two, and scared the remaining three away.”<br/><br/>Upon hearing his words, Chu Xiyue stared at him blankly, her mouth slightly ajar in a state of adorable astonishment.<br/><br/>Seeing her shocked expression, Gu Yang felt a sense of indescribable accomplishment.<br/><br/>He had seen plenty of others shocked and admiring him, which was nothing special. But seeing such a reaction from the woman by his side was different – incredibly satisfying.<br/><br/>“Master!”<br/><br/>That’s when a little green bird flew in from outside, chirping nonstop as soon as it entered, “You’ve finally made it back to the Fairy Realm, congratulations, congratulations!”<br/><br/>Next came Xi Huang, who was the first to arrive; seeing him made the tears in her eyes almost fall, “Father…”<br/><br/>Then Cao Yiyi, Pei Qianlan, and Su Qingzhen arrived.<br/><br/>In the blink of an eye, all the women were there.<br/><br/>Seeing the resentful expressions on each of their faces, Gu Yang couldn’t help but feel a bit overwhelmed. He only had two arms to embrace so many women.\t\t\t\t\t\t</div>", "images": {}, "success": true}