{"id": 415, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132432.html", "title": "Chapter 415 - Chapter 415: 415 Enter The Sky Ruins Again", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 415 - Chapter 415: 415 Enter The Sky Ruins Again</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 415: 415 Enter the Sky Ruins Again<br/><br/>“Elder Gu is actually here.”<br/><br/>Huang Yongkang was first thrilled to see Gu Yang appear, and then regret soon followed.<br/><br/>His joy came from the presence of Elder Gu, and having him there naturally alleviated any worries about Prince Sheng.<br/><br/>In his heart, this elder who resembled an immortal, was no doubt a Deity Transformation Stage cultivator. If he could easily slay an old monster like Youming Laozu who had dominated the world for hundreds of years, how could he not be at the Deity Transformation Stage?<br/><br/>His regret stemmed from his missed opportunity to impress.<br/><br/>If he had risked it all to defend the Gu Mansion in front of a Deity Transformation Stage cultivator, he might have been able to latch onto this powerful ally. After that, who would dare to provoke him?<br/><br/>It’s such a pity, such a pity.<br/><br/>Although Huang Yongkang does have a master, the old man is generally shunned within the cultivation world. Despite having Nascent Soul cultivation, he acts furtively and dares not to reveal himself openly.<br/><br/>This has caused him to be labeled as the demonic prince, making him a target for all.<br/><br/>Let alone holding onto his master’s coattails, it would already be good if he didn’t hold him back.<br/><br/>While Huang Yongkang was filled with regret, he saw Elder Gu had a few words with Prince Sheng before their talk collapsed and Elder Gu suddenly made a move.<br/><br/>With one punch, he shattered Prince Sheng’s body into a mist of blood.<br/><br/>“This-”<br/><br/>This scene almost made his eyes pop out, wondering if he was hallucinating.<br/><br/>Did I see that correctly?<br/><br/>Prince Sheng, a well-known Deity Transformation Stage cultivator, was killed with a single punch?<br/><br/>How is this possible?<br/><br/>Huang Yongkang stood there foolishly, his mouth half-open, completely stunned.<br/><br/>…<br/><br/>On the other hand, Shi Mingyuan did not leave, but stayed where he was, also watching the scene where Prince Sheng was instantly killed. Despite his mental preparation, he was still utterly shocked.<br/><br/>Although Prince Sheng has just broken through, he is still a genuine Deity Transformation Stage cultivator.<br/><br/>The dragon robe he wore was also a Pure Yang Magic Weapon; ordinary magical weapons would hardly hurt it. But it still could not withstand that man’s single punch.<br/><br/>This person’s strength is even more terrifying than what his master had described.<br/><br/>Killing a Deity Transformation Stage cultivator is like slaughtering a chicken to him.<br/><br/>How could there be such a terrifyingly powerful person in this world?<br/><br/>For a moment, his mind was in confusion, and his Daoist Heart was somewhat shaken.<br/><br/>He and Prince Sheng were both competitors and motivators to each other.<br/><br/>In the future, when he broke through to the Deity Transformation Stage, he would be comparable to Prince Sheng. But now, he can’t even withstand one punch from his opponent. What’s the point of his cultivation then?<br/><br/>…<br/><br/>……<br/><br/>Gu Yang found his punch extremely satisfying.<br/><br/>This man, a cultivator, dared to stand in front of him at such a close range. He didn’t even need a weapon, nor did he need to worry about any kind of technique, he just punched directly.<br/><br/>None of those Immortal Elements for body protection, or any magic treasures, worked.<br/><br/>He shattered that so-called prince into a mist of blood, not even a piece of intact blood clot could be found.<br/><br/>Only a golden light flashed, and something wrapped a Nascent Soul and flew away like lightning.<br/><br/>“Huh?”<br/><br/>Gu Yang was somewhat surprised. Originally, this punch could have destroyed both the opponent’s mortal body and Original Spirit together.<br/><br/>Unexpectedly, his Original Spirit actually escaped, seemingly protected by a magic treasure.<br/><br/>“Trying to run?”<br/><br/>He took out the Human Emperor Sword from his Beast-taming Space and slashed across the air.<br/><br/>The third move of the Nine Heavens Asking Blade, Momentum Engulfing the Universe!<br/><br/>When he used this saber technique with the Human Emperor Sword, its power did not diminish at all.<br/><br/>The Blade Intent crossed space and struck that spot of light.<br/><br/>[Received a fragment, current number of fragments: Ten.]<br/><br/>After Gu Yang killed the Original Spirit of this so-called Prince Sheng, he saw that the golden light only paused a bit and then continued to fly forward.<br/><br/>Spirit Treasure!<br/><br/>Only a Spirit Treasure, and not just an ordinary one, could possibly protect a Primordial Spirit from being scattered under this blade.<br/><br/>Spirit Treasures are rare, he didn’t want to let it go.<br/><br/>“I’ll leave this place to you.”<br/><br/>He sent a message to Wen Jue in the sky, then swiftly pursued after her.<br/><br/>…<br/><br/>Wen Jue had arrived when Crown Prince Sheng appeared in front of Gu Mansion. She had deceived everyone, but she could not deceive Gu Yang.<br/><br/>In fact, she had been secluded nearby and hurried over when she noticed something amiss.<br/><br/>Then, she saw Gu Yang display a mighty power, easily killing a Nascent Soul cultivator on the spot.<br/><br/>“This young lad, who quietly accomplished his goals, has already become a Celestial Being.”<br/><br/>Although Wen Jue knew that this day would eventually come, she did not expect it to come so swiftly.<br/><br/>Where did he make the breakthrough?<br/><br/>Unbeknownst to her, his strength had already surpassed hers significantly.<br/><br/>Like Crown Prince Sheng, she had only recently advanced. Therefore, in terms of cultivation level, she was slightly above him.<br/><br/>This comparison made it clear how wide the gap in power was between her and Gu Yang.<br/><br/>If they were to face off, she would likely be taken out in a single blow.<br/><br/>Despite those thoughts, a slight smile surfaced on Wen Jue’s face.<br/><br/>Her greatest aspiration in life was to seek revenge against Lord Chi Ming for her master. Even with her own abilities, she could not be certain that she could kill this formidable enemy in a thousand years.<br/><br/>However, Gu Yang was different. No one knew what heights he could reach in the future.<br/><br/>If they had to eliminate Lord Chi Ming, they would likely have to depend on him.<br/><br/>She looked at the others from Jade Emperor Pavilion with a cold gaze.<br/><br/>…<br/><br/>People of the Jade Emperor Pavilion were profoundly shocked. They found it impossible to believe that the reality before them was true.<br/><br/>This sect, which practically venerated Crown Prince Sheng as the patriarch with Emperor Wei as the honorary sovereign, left the other members to obey every command of Crown Prince Sheng.<br/><br/>The deaths of Emperor Wei and Crown Prince Sheng felt like the sky had collapsed on them.<br/><br/>“Kill that woman! Avenge our emperor!”<br/><br/>Suddenly, someone shouted, and several people moved and headed towards Gu Mansion.<br/><br/>“Let’s see who dares.”<br/><br/>This time, Huang Yongkang seized the opportunity. He displayed his trump card and blocked those people, quickly gaining the upper hand.<br/><br/>In the sky, Wen Jue looked at the young man oddly and pulled out a sword. With a casual wave, a massive Blade Intent descended. Wherever it passed, all of the people of Jade Emperor Pavilion were split in two.<br/><br/>Among them, two Nascent Soul cultivators didn’t even have the chance to escape.<br/><br/>All members of Jade Emperor Pavilion had been annihilated.<br/><br/>With this, Huang Yongkang got a fright but quicky realized that a powerful Nascent Soul cultivator was hiding nearby.<br/><br/>He felt a wave of excitement and was glad that he had gambled right this time.<br/><br/>On the other side, Shi Mingyuan and others of the Water Moon Sect were about to come to their aid when they witnessed this scene and were taken aback.<br/><br/>This triggered a feeling of indescribable emotion in their hearts.<br/><br/>The Jade Emperor Pavilion was finished!<br/><br/>This sect, one of the four great sects that had existed for over a thousand years, lost its only two remaining Nascent Soul cultivators soon after the deaths of Emperor Wei and Crown Prince Sheng.<br/><br/>With the loss of their strongest members, the downfall of the Jade Emperor Pavilion was inevitable.<br/><br/>This made Shi Mingyuan think of the Water Moon Sect. If they offended a powerful Nascent Soul cultivator, their fate wouldn’t be good either.<br/><br/>For a moment, he was filled with sorrow as if mourning a close friend.<br/><br/>On this side, Wen Jue took action and removed the hidden dangers for Gu Yang.<br/><br/>On the other side, Gu Yang was chasing after the golden light and had already travelled hundreds of miles in an instant. For a moment, he could not catch up.<br/><br/>The speed of that golden light was unimaginably fast.<br/><br/>This aroused his competitive spirit. He wanted to see how long it could keep running.<br/><br/>Keeping up such speed required enormous energy.<br/><br/>He had with him a dozen peaches and a system to boot. Nobody could compete with him in terms of energy consumption.<br/><br/>Before he knew it, half a day had passed.<br/><br/>Just as the golden light was showing signs of exhaustion and Gu Yang was ready to speed up and capture it, the golden light suddenly flashed and disappeared.<br/><br/>Upon closer inspection, he realized he had actually reached the outskirts of the Sky Ruins.<br/><br/>The golden light had vanished into a spatial rift.<br/><br/>Gu Yang hesitated for half a second before giving chase.\t\t\t\t\t\t</div>", "images": {}, "success": true}