{"id": 424, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132450.html", "title": "Chapter 424 - Chapter 424: You Guys Finally Arrived.", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 424 - Chapter 424: You Guys Finally Arrived.</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 424: You guys finally arrived.<br/><br/>No way, again?<br/><br/>Upon seeing this task, Gu Yang couldn’t help but feel overwhelmed. This time it was even more extreme, a Celestial Immortal-level Demon Beast suppressed in the Immortal Prison. The level of danger had shot up by several stars.<br/><br/>What the hell is wrong with these powerful forces?<br/><br/>Catching a demon beast, why not just annihilate it directly? Why suppress it?<br/><br/>He didn’t believe it, there could be no way that the Heavenly Court wouldn’t have a method to annihilate a Celestial Immortal-level demon beast.<br/><br/>In the end, he was the one who had to clean up the mess.<br/><br/>“Upon completion of the task, you will be rewarded with one Immortality Pill. Failure will result in banishment to the Mortal Dust.”<br/><br/>An Immortality Pill, what is it this time?<br/><br/>No matter whether he’s willing or not, if he wanted to stay here, he could only complete this task.<br/><br/>Although the task was dangerous, it should be safe according to the results of the simulation.<br/><br/>He stood up and walked out of the Barracks Tent, seeing the old and young standing outside.<br/><br/>Old Daoist Yu Ming greeted, “High Immortal, I have received orders to assist High Immortal in suppressing the demon beast of the Immortal Prison.”<br/><br/>Good, with one more Hollow Void realm helper, he might come in handy at a crucial moment.<br/><br/>“Let’s go.”<br/><br/>Gu Yang said, leading them towards the Divine Weapon Hall.<br/><br/>…<br/><br/>It wasn’t Yu Ming’s first time in the Heavenly Court, he had stayed here for a few years when he was a Nascent Soul late stage cultivator under a senior.<br/><br/>He knew naturally that the Heavenly Court would occasionally assign tasks many of which require manpower and are assigned to temporary divine soldiers like them.<br/><br/>How long one can stay depends on luck.<br/><br/>Maybe, just after a few months of arrival, one may encounter some extremely difficult tasks and be unable to complete them, forcing to leave the Heavenly Court.<br/><br/>He considered himself quite lucky, he had stayed here for a good five years and built a solid foundation during that time.<br/><br/>Over thousands of years, there have been hundreds of Guang Yuan Sect disciples who came to the Heavenly Court. Only three have achieved the Hollow Void realm. Each of them stayed in the Heavenly Court for several years.<br/><br/>This shouldn’t be a coincidence.<br/><br/>Plus, even if you fail a mission and are expelled from the Heavenly Court, you can return after a period of time and become a divine soldier again. However, the merits you had earned before would be erased.<br/><br/>From this, one can see that the Heavenly Court is really short of people. Even those who were eliminated before can become divine soldiers again.<br/><br/>This time, the task was to suppress the Immortal Prison, which was considered one of the most difficult tasks.<br/><br/>Those qualified to be suppressed in the Immortal Prison were not simple characters, they were at least Celestial Immortals to start with.<br/><br/>In the ancient times, a wisp of breath from a Celestial Immortal was enough to shake a Human Immortal to death.<br/><br/>If one is careless, there may even be a danger to their life.<br/><br/>In the history of the Guang Yuan Sect, there were two unfortunate individuals who were killed while carrying out tasks.<br/><br/>These two unlucky ones, one died in the Heavenly River, the other died in the Immortal Prison.<br/><br/>And these two places are considered by the Guang Yuan Sect as the most dangerous places in the Heavenly Court.<br/><br/>Of course, the more dangerous the task, the more generous the reward.<br/><br/>If this task is successful, one can gain an Immortality Pill.<br/><br/>This is one of the most precious rewards in the Heavenly Court. After consumption, one’s Cultivation Level can be promoted by one rank out of the blue.<br/><br/>If a first-level Celestial Being takes it, they will directly advance to the second level.<br/><br/>If a second-level Celestial Being takes it, they will advance to the third level.<br/><br/>If it’s a third-level Celestial Being, then they will advance directly to the Hollow Void realm.<br/><br/>Old Daoist Yu Ming was able to break through to the Hollow Void realm because he had once consumed an Immortality Pill.<br/><br/>Over thousands of years, hundreds of Guang Yuan Sect disciples have entered the Heavenly Court and completed countless tasks, but only four Immortality Pills have been obtained in total.<br/><br/>It is stipulated in the Guang Yuan Sect that after getting the Immortality Pill, it must be given to the Sect. In the future, anyone who breaks through to the third-level Celestial Being will be eligible to consume this Immortality Pill.<br/><br/>This is the secret as to why the Guang Yuan Sect has become the most powerful sect in the Kong Mingtian.<br/><br/>This Immortality Pill, each person can only consume one. If you take it again, it will have no effect.<br/><br/>The Guang Yuan Sect’s first Hollow Void fearless ancestor received a second Immortality Pill. After taking it, hoping to advance further, there was no effect, and the Immortality Pill was wasted.<br/><br/>Now, with the opportunity to obtain an Immortal Pill, even if the task was dangerous, they had to carry it out.<br/><br/>The last Immortal Pill of the Sect had been consumed by him.<br/><br/>At present, the lifespan of Elder Yu Ming was running out. In a few hundred years, he would pass away. Once he died, the Guang Yuan Sect would face a great crisis.<br/><br/>His wish was to return an Immortal Pill to the Sect before his demise.<br/><br/>Hence, he was very enthusiastic about it.<br/><br/>…<br/><br/>Sometime later, they arrived at the Hall of Divine Weapons.<br/><br/>Both Elder Yu Ming and Yun Hua received their equipment, Silver Armor and Spirit Sword, two sets of spiritual treasures, one for each person.<br/><br/>Gu Yang got the Demon-Subduing Pestle.<br/><br/>“A Human Immortal?”<br/><br/>A crude voice echoed in his ear, scoffing, “It seems that the Celestial Court has run out of people. They even let a mere Human Immortal wield the Demon-Subduing Pestle.”<br/><br/>Gu Yang replied, “Your assistance in this matter is greatly appreciated.”<br/><br/>“Boring.”<br/><br/>The crude voice mumbled something and then fell silent.<br/><br/>Gu Yang didn’t understand what he had said wrong but didn’t bother to think about it.<br/><br/>It was normal for these high-level spiritual treasures to be a bit haughty.<br/><br/>Talkative ones like the Demon-Slaying Sword seemed to be in the minority.<br/><br/>Carrying the heavy golden pestle, he left the Hall of Divine Weapons and headed towards the nearest Teleportation Array.<br/><br/>The Celestial Court was filled with Teleportation Arrays, forming a vast and complex transportation network.<br/><br/>This Immortal Palace could be compared to a huge city, where the Teleportation Arrays were like subway or bus stations – only that they were far more efficient than buses or subways, allowing instant travel.<br/><br/>Gu Yang and his companions teleported and arrived at a dark place.<br/><br/>It was gloom all around, devoid of any light, and all they could sense was bone-chilling cold.<br/><br/>Yun Hua, who had the lowest Cultivation Level, couldn’t help but shudder.<br/><br/>They were not bothered by this darkness and could clearly see their surroundings.<br/><br/>Gu Yang could feel an inexplicable pressure around him, but this terrifying pressure was blocked by the golden armor he was wearing.<br/><br/>This seemed to be a place like the Demon Suppression Tower. It had a strong restraining force on demon beasts, but as celestial soldiers of the Heavenly Court, they would not be affected at all.<br/><br/>They could be said to have a great home-field advantage.<br/><br/>However, Gu Yang grew cautious. In such an environment, a demon beast that could break free was no ordinary demon beast.<br/><br/>He cautioned, “Be careful,” and moved forward.<br/><br/>As he entered the Demon Prison, the Demon-Subduing Pestle in his hand started emanating waves of heat, guiding him in a direction.<br/><br/>Unless something unexpected happened, the direction it was indicating was where the demon beast was located.<br/><br/>He had no idea what the demon beast looked like.<br/><br/>Gu Yang felt somewhat nervous as he was always cautious about the unknown.<br/><br/>The three of them kept advancing, and throughout their journey, they did not encounter any living creatures.<br/><br/>This was not surprising. The collapse of The Way of Heaven affected not only cultivators but all transcendent beings like ghosts and demons. They would all be affected.<br/><br/>Over time, the demon beasts suppressed in the Demon Prison would naturally fade away.<br/><br/>After all, it had been thousands of years, or even tens of thousands of years.<br/><br/>This made Gu Yang even more nervous.<br/><br/>It meant that the demon beast that had broken free was undoubtedly the most terrifying among the many demon beasts. It had lasted for nearly ten thousand years and had not faded away.<br/><br/>Suddenly, Gu Yang felt the Demon-Subduing Pestle in his hand become extremely hot as it began absorbing his Immortal Element without asking for his permission.<br/><br/>He knew that the demon beast must be nearby.<br/><br/>“So, you have finally arrived.”<br/><br/>An old voice suddenly echoed.\t\t\t\t\t\t</div>", "images": {}, "success": true}