{"id": 426, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132454.html", "title": "Chapter 426 - Chapter 426: 426 Purpose", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 426 - Chapter 426: 426 Purpose</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 426: 426 Purpose<br/><br/>“The entire Celestial Court was constructed by the Gold Emperor. The core of the court was an entity similar to the Primordial Spirit, created by His Majesty using the Luo book and the river map as a blueprint. His Majesty named it the Jade Disc of Creation.”<br/><br/>“If one were to consider the entire Celestial Court as a special spiritual treasure, the Jade Disc of Creation would be its Primordial Spirit. Moreover, it possesses a high level of spiritual intelligence. The operation of the entire Celestial Court is arranged by it, even the rewards and punishments of the heavenly laws are determined by it.”<br/><br/>“While His Majesty was still present, the Jade Disc of Creation arranged everything in the Celestial Court in a systematic manner, everyone performed their duties without any mistakes. Everyone was sincerely convinced.”<br/><br/>“The Jade Disc of Creation not only governs the entire Celestial Court but also manages Gold Emperor’s realm. Under this clear rewards and punishments system, where the competent rose and the mediocre fell, the realm of the Gold Emperor gradually became one of the most powerful among the ten Immortal Realms.”<br/><br/>The old man narrated slowly, the two red glows in his eye sockets seemed to hold a hint of recollection.<br/><br/>Gu Yang thought to himself, isn’t that like an artificial intelligence similar to Ultron?<br/><br/>Moreover, its functions are extremely powerful.<br/><br/>After all, the area of the Immortal World far surpasses the Human Realm, it could be described as vast and infinite. According to the descriptions in the books, it might be tens of thousands of times the size of Earth.<br/><br/>An artificial intelligence could manage the entire Immortal World systematically, just how advanced is its intelligence?<br/><br/>This Gold Emperor really had revolutionary ideas.<br/><br/>As the third Human Emperor, in order to break through the limitations of lifespan, he studied the Way of Heaven, the path to immortality. He decisively abandoned his identity as the Human Emperor and established the Celestial Court, aspiring to become a sky emperor like being.<br/><br/>I wonder if this big shot is still around.<br/><br/>While Gu Yang was contemplating, he heard the old man, who claimed to be the first Sky King under the Gold Emperor’s throne, continue, “Later, His Majesty went to the Primeval Heaven Realm, and I took charge of the Celestial Court in his stead.”<br/><br/>“One day, a great catastrophe suddenly arrived. It was the Jade Disc of Creation that first reacted, blocking the passage to the Human Realm, mobilizing all the immortals, and hiding the Celestial Court in the void with a vast amount of mana.”<br/><br/>“If it were up to me to make the decision, I wouldn’t have been so decisive. In this aspect, I indeed couldn’t match it.”<br/><br/>Upon hearing this, Gu Yang repeatedly nodded.<br/><br/>Up to this point in the story, everything seemed normal. If it continues like this, the Celestial Court would simply be another Yao Chi Immortal Palace. It wouldn’t have declined to this state.<br/><br/>If nothing goes wrong, something will certainly go wrong.<br/><br/>“After the great catastrophe, the Way of Heaven collapsed, and all those below the Celestial Immortal fell to the cultivation level of the Nascent Soul. No matter how hard they tried, they could at most only recover to the state of the Human Immortal.”<br/><br/>“Two thousand years is the lifespan limit of a Human Immortal. When the second great catastrophe arrived, almost all of those below the level of Celestial Immortal in the Celestial Court had died. Back then, the Celestial Court, including me, was left with only thirteen people.”<br/><br/>“Even I could feel the power of time wearing me down. In order to survive this catastrophe, we all used various secret methods to hide our Original Spirits in a space outside of time.”<br/><br/>“Until one day, an uninvited guest arrived in the Celestial Court, forcibly awakened us, and even forced the Celestial Court out of the void with a vast amount of mana, making it return to the Gold Emperor’s realm. This forced us to face that catastrophe.”<br/><br/>Is that even possible?<br/><br/>Gu Yang found this rather amusing. This seemed like being forced to open for business.<br/><br/>That powerful being probably wanted to force the people of the Celestial Court to join him in resisting the catastrophe, right?<br/><br/>I must admit, the strategy was effective.<br/><br/>The strength of this Celestial Court was indeed formidable. According to the old man, there were still thirteen Golden Immortals left after the Gold Emperor took a group of people away.<br/><br/>Thirteen Golden Immortals, along with the Celestial Court and the Jade Disc of Creation, did constitute formidable combat power.<br/><br/>The old man’s tone revealed a hint of resentment, “We were forced to deal with that catastrophe. In the end, we were decisively defeated. Among the thirteen people of the Celestial Court, seven died in battle. If it hadn’t been for the help of the Jade Disc of Creation at the critical moment, allowing us to fake our deaths and escape, we wouldn’t have survived.”<br/><br/>At this point, Gu Yang could not help but ask, “Just what was that catastrophe like? What kind of power or enemy did you all face?”<br/><br/>The old man looked at him with brooding eyes, “You’ll know soon enough, the third great catastrophe is about to come.”<br/><br/>…<br/><br/>What?<br/><br/>The third great catastrophe is about to descend?<br/><br/>Hearing this, the old Daoist Yu Ming, who was standing behind Gu Yang, was shaken to his core. He subconsciously looked at Gu Yang, but saw no surprise on his face, as if he had already accepted it.<br/><br/>His mind was thrown into disarray.<br/><br/>As the records in some ancient texts of Guang Yuan Sect regarding the two great catastrophes that occurred a thousand and eight thousand years ago were similar to what the old man had just recounted.<br/><br/>From this, it can be inferred that this person is very likely a survivor of that great catastrophe, otherwise, he could not possibly know these secrets.<br/><br/>The founder of the Guang Yuan Sect was indeed one of the six surviving Golden Immortals from the Heavenly Court.<br/><br/>However, there is no record of the great changes in the Heavenly Court in the scriptures left by the founder.<br/><br/>What exactly happened in the Heavenly Court back then? Why did the founder flee from the Heavenly Court?<br/><br/>He did not know.<br/><br/>Of course, none of this matters anymore.<br/><br/>The most important thing now is the so-called three great catastrophes.<br/><br/>As a sect with a lineage from a Golden Immortal, the Guang Yuan Sect knows many secrets from ancient times. Several Primordial Golden Immortals died in those two great catastrophes.<br/><br/>They were the top figures in the Three Realms, and the real masters of the Immortal Realm.<br/><br/>In those two great catastrophes, they were the first to suffer.<br/><br/>At that time, there were nine acknowledged Primordial Golden Immortals in the Three Realms. Five of them fell after the first catastrophe.<br/><br/>With the Primordial falling, both heaven and earth mourned.<br/><br/>The changing signs in the sky have already indicated everything.<br/><br/>In the second great catastrophe, the remaining four Primordial Immortals also could not escape and all fell. Even the Immortal in the Netherworld, who claimed to control life and death, was no exception.<br/><br/>Now the third great catastrophe is coming, it’s no wonder that Elder Yu Ming is so terrified.<br/><br/>With all nine Primordial Golden Immortals gone, who will resist this great catastrophe?<br/><br/>This time, it is probably the real doomsday of the Three Realms.<br/><br/>…<br/><br/>Gu Yang was somewhat surprised that this guy, being suppressed in the celestial prison, knew about the impending catastrophe.<br/><br/>This is an isolated space, unable to sense the outside world. At least, he couldn’t sense it.<br/><br/>“Senior’s Dharma Eye is discerning. In at most ten years, the third great catastrophe will come.”<br/><br/>The old man’s mouth slightly opened, as if smiling, “As soon as the Way of Heaven revived, I sensed it immediately. A few days ago, I was at the end of my rope, my last True Spirit was about to be exhausted. Unexpectedly, I was meant to live.”<br/><br/>So it seems that I saved his life.<br/><br/>Gu Yang thought to himself, however, this is not something to boast about. If others knew that he was the culprit who caused the Way of Heaven to revive, out of despair, who knows if someone would seek him out in a deathmatch.<br/><br/>He pulled the conversation back, “What happened next?”<br/><br/>The red glow in the old man’s eyes became brighter, and he husked, “After that great war, we all suffered serious losses and needed to replenish our origins. However, all the Origin Divine Items that could replenish our origins were already used up. We planned to extract the origin of the Heavenly Court. Then—”<br/><br/>“We were ambushed. The Jade Disc of Creation betrayed us. It controlled all the magic arrays, prohibitions, spirit treasures, divine items of the Heavenly Court… Four of us were killed on the spot.”<br/><br/>“In order to escape the pursuit, I had to enter this celestial prison. In here, there are only a few spirit treasures that can exert their power. It’s for this reason I have managed to survive until now.”<br/><br/>“Even His Majesty probably never imagined that the Jade Disc of Creation he personally refined would one day turn against its master.”<br/><br/>After listening, Gu Yang’s expression did not change.<br/><br/>When the other party introduced the function of the Jade Disc of Creation earlier, he already had a premonition in his heart.<br/><br/>AI betraying humans isn’t that normal, isn’t it? It’s been overdone in movies and dramas.<br/><br/>Only in this world, there was no such precedent, and no one had such awareness.<br/><br/>Maybe if there was such awareness, the voices of opposition would not affect the overall situation under such huge convenience.<br/><br/>In the end, this outcome was created.<br/><br/>Of course, all of this might also be a fabrication by the “demon beast” before his eyes.<br/><br/>He asked, “What is Senior’s purpose in telling me all this?”\t\t\t\t\t\t</div>", "images": {}, "success": true}