{"id": 422, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132445.html", "title": "Chapter 422 - Chapter 422: 422 Earth Immortal?", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 422 - Chapter 422: 422 Earth Immortal?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 422: 422 Earth Immortal?<br/><br/>After accepting the task, Gu Yang, according to the requirements, heads to the Divine Weapon Hall.<br/><br/>Upon entering the Divine Weapon Hall, following the instructions, he returned the silver armor and spirit sword he obtained previously. Then, he swapped them for gold armor and a gold sword.<br/><br/>Both of these items were Earth Grade Spirit Treasures.<br/><br/>Even though they were both classified as standard spirit treasures, the Earth Grade Spirit Treasures were extremely valuable. A typical Celestial Being would have a hard time getting their hands on these.<br/><br/>These two items could probably be exchanged for quite a significant number of fragments.<br/><br/>Including the wind-stabilizing pearl, he now had three Earth Grade Spirit Treasures. The Heavenly Court truly was a massive treasure trove.<br/><br/>Next, following the instructions, he ascended to the second floor and received the River Book (fake). Without this item, it would be impossible for him alone to restore the prohibitions within the Heavenly Court.<br/><br/>The Luo Book was not a book, but rather, a turtle shell, engraved with profound patterns.<br/><br/>He could sense that within this divine item, there was the existence of a Primordial Spirit. However, it was extremely aloof and didn’t pay any attention to him.<br/><br/>It might be because it deemed his cultivation level too low.<br/><br/>Regardless, he wouldn’t be able to take this divine item out of the Heavenly Court anyway.<br/><br/>Unless one day he became the lord of the Heavenly Court, but who knows when that would be.<br/><br/>Gu Yang, holding the Luo Book, headed towards the Extreme Heaven Hall.<br/><br/>The Extreme Heaven Hall appeared to be a significant place, located at the core of this Immortal Palace.<br/><br/>Unfortunately, he wasn’t allowed to enter and take a look inside.<br/><br/>The place that required prohibition repairs was a section of the courtyard wall.<br/><br/>Looking at that patch of wall, he couldn’t discern any problems with it.<br/><br/>Just as he was about to ask the Luo Book in his hand, he suddenly sensed a peculiar fluctuation. His vision completely changed, and what he saw in front of him were various geometric patterns and complex runes that formed a vast network.<br/><br/>These runes comprised part of the Heavenly Court’s prohibition.<br/><br/>Gu Yang curiously observed everything around him. Such a perspective gave him an incredibly high-end feel, almost sci-fi-like.<br/><br/>After a moment, several spots marked in bold and red grabbed his attention.<br/><br/>He understood immediately that these were the spots where errors occurred—or in more modern terms, these were bugs.<br/><br/>This Luo Book was no different from a supercomputer, and its intelligence was incredibly high. It could simultaneously find bugs—comparable to artificial intelligence.<br/><br/>Gu Yang only needed to follow the Luo Book’s instructions and correct the errors in those spots.<br/><br/>The method of correction was to use Immortal Element energy to trace the runes. And it was indeed an incredibly draining task. After correcting a dozen runes, his internal Immortal Element had already been depleted by almost half.<br/><br/>Finally, the last error was corrected before his internal Immortal Element was completely depleted.<br/><br/>He couldn’t help but wipe the cold sweat off his brow.<br/><br/>Who would’ve thought that what seemed like a mentally taxing task turned out to be a physically taxing one.<br/><br/>…<br/><br/>Gu Yang returned to the Divine Weapon Hall and returned the Luo Book. Throughout the entire process, the Luo Book’s Primordial Spirit didn’t communicate with him at all.<br/><br/>This made him miss the talkative Demon-Slaying Sword.<br/><br/>There wasn’t a single person to converse with at this place, and if he stayed for too long, he was afraid he might fall ill from loneliness.<br/><br/>Thankfully, after becoming a third-order god, there is a period of relaxation, working eight days, and resting for two days. During this time, he can leave the Heavenly Court.<br/><br/>It has to be said that in certain aspects, the Heavenly Court is quite human-friendly.<br/><br/>Of course, only those above the third order could enjoy such benefits. Heavenly soldiers, on the other hand, had no days off.<br/><br/>Another fifty thousand merits were added to Gu Yang’s merit record.<br/><br/>There was also another opportunity for Immortal Pool Body Cleansing.<br/><br/>This was the reward for completing the task.<br/><br/>Putting aside the fifty thousand merits for now, he was rather curious about the opportunity for Immortal Pool Body Cleansing.<br/><br/>Immediately, he put this opportunity to use.<br/><br/>Then, he used a teleportation array in the military camp to head towards the “Immortal Pool”.<br/><br/>The Immortal Pool indeed looked quite celestial, shrouded in mist, with various exotic flowers and grasses growing along the shore, emitting a fragrant aroma.<br/><br/>However, this setup seemed oddly familiar—it reminded him of Yao Chi.<br/><br/>Gu Yang took off his clothes, went down into the pool, and soaked in the water. In that instant, he felt as though his entire body was becoming transparent. The last trace of his mortal body was washed away, and he was completely transformed into an Immortal.<br/><br/>He never thought that his mortal body could still improve, reaching a level of perfection that only existed in ideals.<br/><br/>The Immortal Element that had just been depleted was quickly replenished.<br/><br/>Gu Yang soaked in the pool for a whole day and night.<br/><br/>…<br/><br/>…<br/><br/>Meanwhile, at the gates of the Heavenly Court, arrived two unexpected guests.<br/><br/>They were an old man and a young woman. The elderly man was dressed in plain grey Daoist robes, with an image of an immortal well-preserved in youth, holding an Immortal’s rag whisk in his hand.<br/><br/>The young woman had a celestial-like appearance, with an extraordinary demeanor.<br/><br/>“Yun’er, this is the ancient Heavenly Court. Among the ten Immortal Worlds, it is one of the most powerful forces. It was able to claim one of the three Heavenly Worlds amid multiple forces during the grand war that swept the Three Realms,”<br/><br/>“Our Ancestor was one of the mighty Immortals in the Heavenly Court. After that tribulation, a shocking change occurred in the Heavenly Court. Our Ancestor was fortunate to escape and began the Guang Yuan Sect.”<br/><br/>“The Ancestor once said that the Heavenly Court is ominous and one should never enter it. However, after many generations of exploration by our Ancestor, as long as the length of the stay isn’t too long, it should be safe.”<br/><br/>The old Daoist patiently advised the young woman, “For thousands of years, the Guang Yuan Sect has been able to hold authority in Kong Mingtian thanks to the Heavenly Court. It is the greatest secret of Guang Yuan Sect. After reaching the late Nascent Soul stage, every disciple is led by a senior to come here for the breakthrough.”<br/><br/>“However, there indeed are some dangers in this Heavenly Court. After entering it, you must not act recklessly.”<br/><br/>The young woman listened attentively, and solemnly responded, “Yes, Ancestor.”<br/><br/>This old Daoist was called Daoist Yu Ming, a Supreme Elder of the Guang Yuan Sect.<br/><br/>The young woman’s name was Yun Hua, who was the most brilliant among the younger generation in the Guang Yuan Sect. Not yet a hundred years old, she had already reached the late Nascent Soul stage, making her the most talented disciple since the establishment of the sect.<br/><br/>Yu Ming Daoist regarded this disciple of his with great importance, so he personally led her to the Heavenly Court to protect her Dharma.<br/><br/>The two had already entered through the gate while they were talking. They were not obstructed in any way.<br/><br/>“First-Order heavenly soldier?”<br/><br/>Upon entering the massive plaza, Yun Hua could sense a vague will. She asked quietly.<br/><br/>Old Daoist Yu Ming responded, “The current Heavenly Court is in a state of no lord. Every cultivator who enters will automatically become a Heavenly Soldier. The ones in the Nascent Soul and Primordial Spirit stage all become First-Order Heavenly Soldiers.”<br/><br/>“What about you, Ancestor?”<br/><br/>“I am a Second-Order Heavenly Soldier. Later, you will encounter some tasks. After completing them, you can earn merits. To get promoted, however, you need the corresponding realm.”<br/><br/>“Will the tasks assigned by the Heavenly Court be very difficult?”<br/><br/>“Don’t worry, they usually won’t assign tasks that are too difficult. And in case you are unable to complete them, you can give up without a threat to your life.”<br/><br/>Upon hearing this, Yun Hua felt relieved.<br/><br/>They talked while they walked, and before long, they reached the military camp.<br/><br/>Because their ranks were different, they received different tents.<br/><br/>“For Nascent Soul cultivators, this place is a sanctuary for cultivation. With your comprehension ability and aptitude, barring any accidents, you should be able to break through in a few months. Cherish this opportunity. In the future, it will be difficult to come here again…”<br/><br/>As Yu Ming was speaking, his expression suddenly changed. He swiftly turned his head to see a figure appearing at the entrance of the camp.<br/><br/>There was someone here!<br/><br/>Guang Yuan Sect had been using the Heavenly Court as a place to help their Nascent Soul disciples break through to the Primordial Spirit stage for thousands of years. They had never encountered anyone before.<br/><br/>Upon recognizing the armor on that person, Yu Ming Daoist’s pupils contracted.<br/><br/>An Earth Immortal?\t\t\t\t\t\t</div>", "images": {}, "success": true}