{"id": 420, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132441.html", "title": "Chapter 420 - Chapter 420: 420 First-Order Heavenly Soldiers", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 420 - Chapter 420: 420 First-Order Heavenly Soldiers</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 420: 420 First-Order Heavenly Soldiers<br/><br/>After stepping through the great doors of Heaven, a gigantic plaza stood before him, devoid of all people.<br/><br/>The ground was paved with perfectly level stones, each inlaid as if they were a piece of clear jade, giving an extremely grand impression.<br/><br/>The area of this plaza alone was as large as an entire Divine City.<br/><br/>From the outside, Gu Yang had already perceived the immensity of the Immortal Palace, but upon entering he had found it to be even broader than he had imagined.<br/><br/>The nearest palace was more than tens of kilometers away.<br/><br/>There was air here, and the vitality of heaven and earth was overflowing. He could even sense the existence of Immortal Elements, which he could directly absorb. The feeling was richer than at the Yao Chi Immortal Palace.<br/><br/>As soon as he stepped in, he felt an aura of strictness, as if a grand consciousness was relaying a list of prohibitions into his mind.<br/><br/>He had come to know the severe regulations of Heaven.<br/><br/>Here, aside from the guards on duty, other immortals were not allowed to fly within the palaces.<br/><br/>Moreover, immortals had ranks and divine classification; they had to act strictly in accordance with their respective ranking and role.<br/><br/>When Gu Yang entered Heaven, he naturally had a status; he was a First-Order Heavenly Soldier.<br/><br/>His rank was first order, and his divine role was a Heavenly Soldier.<br/><br/>Being a Human Immortal, in Heaven, he could only hold the smallest divine office, like a cannon-fodder soldier.<br/><br/>You can imagine how large Heaven’s force must have been in the past.<br/><br/>This powerful Heaven, now only this Immortal Palace remains, and it’s unknown if there are still people alive inside.<br/><br/>But one thing is for sure, Heaven is still in operation.<br/><br/>Gu Yang squatted, hands on the ground. He waited quite a bit, his heart couldn’t help but sank when there was no statement from the system.<br/><br/>How great would it be if he could fully recharge this Immortal Palace?<br/><br/>As a whole, this Immortal Palace was a Magic Treasure.<br/><br/>Such a pity, the system still has some limitations.<br/><br/>He patted his hands, stood up, and walked towards the distant palace to see if he could make any gains there.<br/><br/>Before he entered, he had conducted a simulation that assured him of no danger to his life. As for any possible gains, the simulation did not specify that either.<br/><br/>He had to find it on his own.<br/><br/>…<br/><br/>Gu Yang, now a First-Order Heavenly Soldier, could only go to one place: the New Recruits Camp located in a side hall in the west.<br/><br/>Without receiving any orders, it was forbidden to go anywhere else. Violations would result in serious consequences.<br/><br/>For this trip, he mainly wanted to explore, not intending to test the consequences of violating the heavenly laws.<br/><br/>The New Recruit’s Camp was a huge camp, and still, it was entirely devoid of people.<br/><br/>Guided by an imperceptible will, Gu Yang found himself entering one of the barracks.<br/><br/>Upon stepping inside, he sensed something unusual, the density of the immortality aura present was at least ten times more than the outside.<br/><br/>Practicing here, whether in Heaven or the efficiency of absorbing Immortal Element, beats any outside place by several dozen times.<br/><br/>Any celestial being, within a hundred years of standing here, could accumulate Immortal Elements and break through to the second order.<br/><br/>Undoubtedly, for celestial beings, this place was a holy land for cultivation.<br/><br/>“Next time, I’ll bring Senior Wen in. It will only take a few days for him to consolidate his cultivation level.”<br/><br/>Gu Yang thought to himself.<br/><br/>Suddenly, a thought descended through the dark, giving him a task.<br/><br/>“In Heavenly River, a celestial flood dragon is about to break the prohibition. Take the Demon-slaying Sword to slay it immediately.”<br/><br/>A celestial flood dragon?<br/><br/>Seeing this task, Gu Yang’s heart leaped.<br/><br/>Was someone having a laugh?<br/><br/>He’s just a low-rank Human Immortal, tasked with slaying a celestial level flood dragon—Is he meant to use his head as a weapon?<br/><br/>“Complete the task to receive one hundred thousand merits, and you will be promoted to the rank of Heavenly General, with an Earth Grade Spirit Treasure as a reward.”<br/><br/>“Task failure results in expulsion to the mortal world.”<br/><br/>Isn’t that a bit overbearing?<br/><br/>This means that such a mission is impossible to refuse. Once failed, you would essentially be expelled from the Heavenly Court, never allowed to enter here again.<br/><br/>Gu Yang suddenly felt that his system was better, at least it wouldn’t force him to complete such dangerous tasks.<br/><br/>He carefully pondered, thinking about how to solve the problem, “It seems that the key to completing this mission is that Demon-Slaying Sword.”<br/><br/>A sword named the Demon-Slaying Sword would surely be specially designed to counter the Monster Race.<br/><br/>Moreover, given that the Way of Heaven has just revived, the Celestial Immortal-level monster would not have been able to recover to the state of a Celestial Immortal, at most, it would be at the peak of the Third Order Celestial Being.<br/><br/>And there was also the advantage of fighting in the Heavenly Court, which should provide some convenience.<br/><br/>Gu Yang’s thoughts immediately sparked into action. After this analysis, it seemed not without hope of victory.<br/><br/>…<br/><br/>Gu Yang decided to give it a shot. Guided by that will, he went to the Divine Arsenal and picked up the Demon-Slaying Sword.<br/><br/>Not only that, but he also received a full set of silver armor and a sword. All of them were Spirit Treasures.<br/><br/>He couldn’t help but marvel at how even the most ordinary First-Order Heavenly Soldier was equipped with two standard-issue Spirit Treasures. Just how rich was the Heavenly Court?<br/><br/>It was astounding.<br/><br/>Although they were merely the most common Human Grade Spirit Treasures, thinking about that massive army camp, capable of holding hundreds of thousands of Heavenly Soldiers, were there hundreds of thousands of sets of Spirit Treasures here?<br/><br/>Gu Yang was practically salivating at the thought.<br/><br/>As for that Demon-Slaying Sword, it was even more incredible. It was actually a Celestial Grade Spirit Treasure, and a full-sized one at that. Its Primordial Spirit was unfathomably deep.<br/><br/>A Celestial Grade Spirit Treasure, only a Celestial Immortal could unleash its maximum power.<br/><br/>“Human Immortal?”<br/><br/>As Gu Yang was thinking, a majestic voice suddenly sounded in his mind. Just this voice alone nearly shattered his Original Spirit.<br/><br/>“Have all the people in the Heavenly Court died? Is a Human Immortal like you now entrusted with the Demon-Slaying Sword?”<br/><br/>Gu Yang focused his inner power to steady his mind, replying, “Senior, you’ve hit the nail on the head. As of now, it seems like I’m the only one left in the Heavenly Court.”<br/><br/>If there were other survivors in the Heavenly Court, its will wouldn’t have assigned a small Human Immortal like him to slay a Celestial Immortal-level Black Flood Dragon.<br/><br/>“Your Original Spirit is sturdy. What is this mission?” The majestic voice scoffed, not dwelling on the issue.<br/><br/>Gu Yang replied, “To slay a Celestial Immortal-level Black Flood Dragon in the Heavenly River.”<br/><br/>“Kid, who did you offend? Sending you to slay a Celestial Immortal monster? With your little Immortal power, you can’t even bring out one ten-thousandth of the power of the Demon-Slaying Sword.” The voice sneered.<br/><br/>Gu Yang said, “Don’t worry about that. Presumably, that Black Flood Dragon can’t bring out one ten-thousandth of its peak strength either.”<br/><br/>“If that’s the case, lead the way,” replied the voice, seemingly too lazy to speak further.<br/><br/>…<br/><br/>The Heavenly River is a river that flows around the Immortal Palace, situated in the sky. It’s vast and seemingly descends from the heavens spanning ten kilometers wide.<br/><br/>Its source and final destination of its water were unknown to Gu Yang.<br/><br/>Even at the edge of sight, he could not see its origin, nor its ultimate destination.<br/><br/>But, he could feel a terrifying presence in the river, exerting enormous pressure on him.<br/><br/>Although it was just of the third rank of Celestial Being, that oppressive feeling was incomparable even to the avatar of Lord Chi Ming.<br/><br/>Suddenly, Gu Yang realized a major problem.<br/><br/>This Flood Dragon was here in its true form.<br/><br/>For the Monster Race, their most potent weapon is their Mortal Bodies. Just how strong can a Celestial Immortal Bomb’s body be?<br/><br/>He now felt just how terrifying it was, standing hundreds of kilometers away and feeling such oppressive force that made his bones creak under pressure.<br/><br/>Once it left the Heavenly Court, its formidable Mortal Body would be enough to destroy everything.<br/><br/>At that moment, the majestic voice rang out, “Channel all your Immortal Elements into the Demon-Slaying Sword.”<br/><br/>Gu Yang did as instructed, pouring all his Immortal Element into the Demon-Slaying Sword in his hand.<br/><br/>Instantly, the Demon-Slaying Sword began emitting a bright glow, flying towards the Black Flood Dragon in the Heavenly River.<br/><br/>The Black Flood Dragon seemed to sense the danger, and the originally calm Heavenly River was stirred into towering waves.<br/><br/>However, no matter how huge the waves were, they couldn’t reach the shore, as if an invisible force confined the water within the Heavenly River’s area.<br/><br/>Unable to withstand it any longer, Gu Yang turned and ran.\t\t\t\t\t\t</div>", "images": {}, "success": true}