{"id": 425, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132451.html", "title": "Chapter 425 - Chapter 425: 425 Mysterious", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 425 - Chapter 425: 425 Mysterious</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 425: 425 Mysterious<br/><br/>“So, you’ve finally arrived.”<br/><br/>That aged voice, carried a hint of weakness and fatigue.<br/><br/>Gu Yang also saw an emaciated old man, leaning against the wall and struggling to move forward.<br/><br/>The old man was as skinny as a skeleton, nearly bald, and his clothes were torn and ragged. At first glance, one would think he was a mummified corpse that had crawled out from the ground.<br/><br/>Quite similar to the mummy from the underground of the palace.<br/><br/>The difference, however, was that the one in front of him barely had any life left.<br/><br/>This is supposed to be a Celestial Immortal-level demon beast?<br/><br/>He was skeptical, but the reaction of the Demon-subduing Pestle in his hand told him that it was undoubtedly a demon beast.<br/><br/>Yu Ming and Yun Hua, standing behind him, were on guard and simultaneously raised the spirit tools in their hands.<br/><br/>Both spirit tools, a bead and a bow and arrow, had been obtained from the Divine Weapon Hall, possessing the purest Yang and the hardest rigidity, specialising in banishing evil demons.<br/><br/>The mummy-like old man studied the Demon-subduing Pestle in Gu Yang’s hand and said with a hoarse voice, “The Demon-subduing Pestle, when Taihua refined you all those years ago, he never expected to die from your betrayal.”<br/><br/>Gu Yang felt the Demon-subduing Pestle was absorbing the Immortal Element within his body at a faster rate. The thought struck him.<br/><br/>As if his Immortal Element could be easily absorbed?<br/><br/>While controlling the rate of his Immortal Element’s output, he asked, “May I know how to address you, senior?”<br/><br/>The old man didn’t answer, but countered, “What did the Wheel of Fate tell you?”<br/><br/>Wheel of Fate?<br/><br/>He must be talking about that indistinct will.<br/><br/>Thinking in his heart, Gu Yang answered truthfully, “We are here to suppress a demon beast.”<br/><br/>“A demon beast?”<br/><br/>The old man’s mouth was slightly open, seemed to be laughing, but he couldn’t even make a sound, “Who would have thought that one day I would become a suppressed demon beast.”<br/><br/>The old man showed no intention of making a move, standing there discussing the world with Gu Yang.<br/><br/>Yu Ming, behind him, was a bit anxious. This High Immortal, was taking things a bit too lightly.<br/><br/>What kind of place is this celestial prison?<br/><br/>Those who were suppressed in here were all extremely terrifying existences, don’t just look at this mummified corpse, it seems to have lost all of its vitality, but it has survived since ancient times, how could it be so simple?<br/><br/>The best response is to make a thunderous strike at the beginning, killing it instantly.<br/><br/>Such demon beasts are most adept at bewildering people’s hearts. Once this High Immortal is bewildered, the consequences would be unbearable.<br/><br/>Yu Ming wanted to suggest this, but he was worried about offending the other party and dared not speak casually. He could only give Yun Hua a meaningful glance, reminding her to stay alert.<br/><br/>…<br/><br/>“Senior, to be able to survive in such a place till now, you must be a renowned figure.” Gu Yang was sincere in saying this.<br/><br/>Being suppressed in the Immortal prison yet managing to survive from ancient times until now, if you say this person is a Celestial Immortal, even a ghost wouldn’t believe it.<br/><br/>For this task, there must be a hidden catch.<br/><br/>This old man, most likely has only the cultivation level of a Celestial Immortal now, but in ancient times, definitely not just that.<br/><br/>As the saying goes, Golden Immortals never die. After the collapse of the Way of Heaven, only powerful Golden Immortals could survive for tens of thousands of years under the erosion of time.<br/><br/>Or like the master of Yao Chi Immortal Palace who hidden the entire palace outside of time, with all the Celestial Immortals inside, asleep. That’s the only way to survive the long passage of time.<br/><br/>Other Celestial Immortals were unable to escape the erosion of time and turned to dust.<br/><br/>Only some of the long-lived species in the Monster Race, such as enlightened plants and trees, due to the existence of their bodies, naturally possessed a long lifespan. These were exceptions.<br/><br/>Last time during the task, the Celestial Immortal-level Black Flood in the Heavenly River, had woken up from sleep, therefore, managed to survive through such a long time.<br/><br/>Just like the people in the Yao Chi Immortal Palace.<br/><br/>The Heavenly Court didn’t have a single Immortal; it was also possible that all of them were in deep slumber.<br/><br/>However, this demon beast in front of them was suppressed in an Immortal prison. It’s impossible for it to hibernate in such an environment, right?<br/><br/>Gu Yang always had an odd feeling, so he did not rush into action, wanting instead to get more information.<br/><br/>Anyway, he had his ways to discern truth from lies.<br/><br/>Even if this demon beast lied, it couldn’t deceive him.<br/><br/>The old man stared at him with his hollow eyes, saying in a hoarse voice, “You notice something is not right, don’t you?”<br/><br/>“I’m just wondering why I don’t see anyone in the Heavenly Palace, yet its doors are wide open, allowing anyone to enter.”<br/><br/>Gu Yang voiced his doubts.<br/><br/>Emperor Wei must have been here before. Only after Prince Sheng’s original spirit was destroyed did that golden light fly back here.<br/><br/>Even now, both Old Daoist Yu Ming and Yun Hua behind him could enter.<br/><br/>This was indeed a bit strange.<br/><br/>If everyone in the Heavenly Palace, like in the Yao Chi Immortal Palace, had fallen into slumber, why are the palace doors open?<br/><br/>Were they not afraid of being robbed?<br/><br/>Even the tightly guarded Yao Chi Immortal Palace ended up having a great number of peaches stolen.<br/><br/>The Heavenly Palace might rank higher than the Yao Chi Immortal Palace, but without any protection, it wouldn’t escape the fate of being raided, especially if that powerful old man was involved.<br/><br/>If all the people in the Heavenly Palace were gone, then why did those immortals abandon such a grand palace?<br/><br/>Or perhaps, all those immortals had died out?<br/><br/>This was even more terrifying. How did they die? There was no sign of a battle in the Heavenly Palace.<br/><br/>What kind of individual could have killed all the immortals who governed the Heavenly Palace, silently and without leaving a trace?<br/><br/>The more he thought about it, the more terrified he became!<br/><br/>If it weren’t for the fact that he had never encountered any danger to his life in his simulations, he wouldn’t want to stay here any longer.<br/><br/>Anyway, Gu Yang always felt that this unpopulated Heavenly Palace was filled with strange occurrences.<br/><br/>“What exactly happened in the Heavenly Palace back then? I entreat you to clear my doubts, senior.”<br/><br/>The old man’s gaze became somewhat strange, “Over the course of ten thousand years, you are the seventh person to ask me this question. The previous six all died, killed by their own spirit tools. I fear you may follow in their footsteps before I’ve finished speaking.”<br/><br/>Gu Yang looked at the Demon-subduing Pestle in his hand, which was beginning to glow golden. It emanated a feeling of utmost Yang and firmness.<br/><br/>He fell silent for a moment.<br/><br/>But in reality, he surreptitiously activated his system and initiated a simulation.<br/><br/>Then, lifting his head, he calmly said, “No matter, senior, please go ahead.”<br/><br/>“High Immortal, you mustn’t do this.”<br/><br/>Upon hearing this, Old Daoist Yu Ming, his heart pounding, finally couldn’t restrain himself and advised, “This is a demon beast! It must be eliminated as soon as possible to avoid future troubles.”<br/><br/>No matter what the demon beast was about to say, whether it was true or false, was it something they could handle hearing?<br/><br/>Matters involving the secrets of the Heavenly Palace were daunting enough. Knowing too much could potentially invite peril.<br/><br/>Moreover, how did they know this beast wasn’t trying to confuse their minds with such words?<br/><br/>They should get rid of it quickly. That was the wise course of action for self-preservation.<br/><br/>Gu Yang said, “If you want to contribute, feel free to take action yourself.”<br/><br/>A bitter smile appeared on Old Daoist Yu Ming’s face. If he had such abilities, why would he need to talk so much?<br/><br/>The spirit tools in his and Yun Hua’s hands were merely aids. In this expedition, Gu Yang was leading.<br/><br/>Without Gu Yang’s action, they could not kill this beast.<br/><br/>He really couldn’t understand what exactly Gu Yang wanted to do.<br/><br/>The old man did not care about their dispute. He looked at Gu Yang, his previously hollow eyes now glowing with two red points of light. He remarked, “Good, you’re brave.”<br/><br/>“I am the number one Sky King under Gold Emperor’s command, carrying out his bidding, managing the Heavenly Palace…”<br/><br/>PS: This is to make up for yesterday’s chapter. Wait, I think I’ve said that before. Oh no, I’m stuck in a loop.\t\t\t\t\t\t</div>", "images": {}, "success": true}