{"id": 429, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132460.html", "title": "Chapter 429 - Chapter 429: 429, Please Everyone Bear Witness.", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 429 - Chapter 429: 429, Please Everyone Bear Witness.</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 429: 429, please everyone bear witness.<br/><br/>In the celestial system, a Sky King is not the same concept as the “Sky King” of the Golden Court’s Cave Realm. Only a Golden Immortal could be bestowed the title of Sky King. They are influential figures who stand on their own.<br/><br/>The first Sky King, named Yu Hao Heavenly King, held extreme power and was in charge of punishing the guilty.<br/><br/>His innate divine item is called “Divine Sky Nine Annihilation”, which contains a destructive power of nine layers. Anyone who offends the celestial court will be punished by this divine item, being executed.<br/><br/>And the “Divine Sky Six Annihilation” saber technique was created by emulating the power of this divine item.<br/><br/>Naturally, the one who created this saber technique was from the celestial court.<br/><br/>These were all told by Yu Hao Heavenly King to Gu Yang.<br/><br/>In that case, the origin of the Blue Sky Palace could likely be linked to the celestial court, Gu Yang thought.<br/><br/>The two essentially reached an agreement that Yu Hao Heavenly King could stay by his side and temporarily remain in the “Divine Sky Nine Annihilation”.<br/><br/>Anyway, his current strength is not enough to get rid of the half rebellious Primordial Spirit inside this divine item.<br/><br/>He then asked about the matter of the Jade Disk of Creation, “Senior, why can the Jade Disk of Creation control even the Primordial Spirit of the innate divine item?”<br/><br/>“When His Majesty created the Jade Disk of Creation, it was bestowed with this power, aiming to prevent others from taking possession of divine items of the celestial court. Initially, when the celestial court was founded, it recruited many hands, resulting in a mixed bunch of people.”<br/><br/>It seems that the Gold Emperor has left a hand with everyone.<br/><br/>As the second-in-command under the celestial court, Yu Hao Heavenly King was no exception.<br/><br/>There must be a back door left in the Jade Disk of Creation, and its core command should be to preserve the celestial court. Therefore, when Yu Hao Heavenly King and the others planned to extract the core of the celestial court, it immediately started a rebellion.<br/><br/>Emperor’s art of managing affairs, too normal.<br/><br/>Gu Yang understood the reason for the rebellion of the Jade Disk of Creation. However, there is no need to say this matter out.<br/><br/>The fact that Yu Hao Heavenly King could become the second-in-command of the celestial court means that he is definitely not a fool, he would surely understand.<br/><br/>…<br/><br/>Along the way, Gu Yang learned many secrets of the ancient times from Yu Hao Heavenly King.<br/><br/>Eventually, they left the realm of the Gold Emperor and returned to the Hollow Void.<br/><br/>Recognizing this place, Yu Hao Heavenly King said, “The battlefield of the Sky Ruins? So you entered from here.”<br/><br/>“What kind of war occurred here?”<br/><br/>“The war between His Majesty and the Candle Dragon. As a result of this war, His Majesty discovered a Cave Realm. From then on, a new era was opened in the Three Realms.”<br/><br/>“There should be indigenous inhabitants in these Cave Realm, right?”<br/><br/>“Naturally, there are.”<br/><br/>“What happened to them?”<br/><br/>“What do you think?”<br/><br/>This question was indeed superfluous.<br/><br/>Gu Yang could imagine how terrible the war was when the human cultivators of the Three Heavens invaded back then.<br/><br/>The fate of those indigenous inhabitants must not be good.<br/><br/>He changed the subject, “Right, it is said that the Way of Heaven was restored because someone in the human world broke through to the Human Immortal state. If someone continues to break through to the next realm, will it stimulate the restoration of the Way of Heaven faster?”<br/><br/>Yu Hao Heavenly King said, “Of course, the second catastrophe was due to the restoration of the Way of Heaven. The person who activated the Way of Heaven was ultimately blocked in the Earth Immortal Realm. Unable to let the Way of Heaven further restore, caused a few Da Luo and mixed Yuan people to be unable to fully exert their power, which led to the failure of great promises.”<br/><br/>It really works.<br/><br/>Gu Yang was a bit relieved in his heart, he had held back a few days ago and didn’t break through because he suddenly thought about this.<br/><br/>The faster the Way of Heaven is restored, the greater the benefits to the cultivators in the world.<br/><br/>He had already thought clearly that it was too heavy a burden to resist the great calamity with his own power. This is a major event in the Three Realms, and all the powerful beings of the Three Realms should face it together.<br/><br/>If the Way of Heaven could be restored to the state of the ancient times, perhaps, those hidden ancient powers would have the confidence to resist the great calamity together.<br/><br/>At last, Gu Yang saw a glimmer of hope to survive the coming catastrophe.<br/><br/>…<br/><br/>After leaving the Sky Ruins, Gu Yang returned to the Gu Mansion, took Qingzhi and the others with him, accompanied by Wen Jue, and returned to Great Zhou.<br/><br/>After returning to the academy, he called out the dean.<br/><br/>Even the two old men playing chess in some courtyard of the cultural academy, Gao Fan and Wu Er.<br/><br/>Even the palace not far away, veiled in a shadow.<br/><br/>Further afield, that seemingly non-existent small pavilion.<br/><br/>He spoke loudly, “Today, I ask everyone to bear witness.”<br/><br/>As he spoke, he took a step and was already above the sky, he opened the system panel and said quietly, “I choose one.”<br/><br/>Suddenly, he could feel an incredible transformation happening in his Primordial Spirit, resonating with the unperceivable existence in this world.<br/><br/>In the deepest part of his Primordial Spirit, a new core was forming, this was a newly comprehended Dao Inscription.<br/><br/>The first Dao Inscription was the flame of destruction. It corresponds to the first form of Divine Sky Six Annihilation.<br/><br/>What’s condensed now is the second Dao Inscription, Thunder, which corresponds to the second form of Divine Sky Six Annihilation.<br/><br/>Outside his body, the heavens and earth resonated, countless dark clouds began to gather and cover the sky, countless golden thunders were brewing in them.<br/><br/>In the roaring thunder, all the people of Divine City were awakened.<br/><br/>Many people hadn’t come out of the shock of the blood stain in the sky not long ago.<br/><br/>Seeing this scene like the end of the world, countless people were frightened. They even thought that the celestial punishment had truly arrived.<br/><br/>But those warriors had a completely different feeling. Many people with sensitive consciousness felt a sense of boiling blood.<br/><br/>And the warriors above the Divine Power realm, felt their Primordial Spirits trembling. For the first time, they truly felt the power of heaven and earth, and they were all inexplicably fearful.<br/><br/>Only beings at the Celestial Being level knew what was happening.<br/><br/>“Hollow Void?”<br/><br/>Stammered the dean, pupils agape with shock.<br/><br/>How long had it been?<br/><br/>Just fifteen days ago, he had sensed Gu Yang’s breakthrough into the Celestial Being stage, which caused an astonishing change in the celestial phenomena.<br/><br/>Only fifteen days, and the brat had already skipped the second and third level of the Celestial Being realm, advancing straight to the Hollow Void realm.<br/><br/>How was this possible?<br/><br/>…<br/><br/>In the academy, Gao Fan and Wu Er looked up at the sky, both of their faces masked with shock.<br/><br/>Both of them had once been at the Unleaking Stage, and their sharp eyes could vaguely guess what was happening.<br/><br/>But, had this kid completely disregarded the normal rules?<br/><br/>Why did his progress speed up even more after reaching the Divine Power realm?<br/><br/>Previously, his breakthroughs were at least counted by the month.<br/><br/>Now, it seemed to be by the day instead.<br/><br/>In half a month, from the Celestial Being realm to the Hollow Void realm, my goodness, he averaged a breakthrough every five days.<br/><br/>Barriers that other Celestial Beings couldn’t break through for hundreds or even thousands of years seemed to not exist for this kid.<br/><br/>Who could withstand this?<br/><br/>…<br/><br/>In the imperial palace, within the Qi Feng Pavilion.<br/><br/>Su Ningyan stared at the anomaly in the sky, and with a crack, she broke the armrest she held. She hadn’t even noticed.<br/><br/>Her emotions were complex, like a mix of five flavors.<br/><br/>She never thought that one day, she would witness the birth of a Hollow Void strong cultivator.<br/><br/>8000 years ago, after the second great catastrophe, all ancient great powers either died or disappeared, leaving not even a single Human Immortal in the human realm.<br/><br/>Until now, there had been no appearance of a Hollow Void expert.<br/><br/>Even the astonishingly talented Xia Emperor died before he could take that step.<br/><br/>Yet Gu Yang accomplished it, in a way that shocked everyone — just half a month after his advancement to the Celestial Being state, he made this step right in front of the people of the world.<br/><br/>From this point on, the entire human realm would enter a completely new era.<br/><br/>What would happen when someone in the human realm broke through to the Cave Realm?<br/><br/>Just a few days ago, she had asked her master this question. She never thought it would become reality so quickly.<br/><br/>She remembered her master saying that the revival of the Way of Heaven would further accelerate, and soon, those ancient great powers could recover their Earth Immortal cultivation level.<br/><br/>In the nearly ten thousand years, immortals and gods had almost vanished.<br/><br/>In the next few years, scenes from the ancient times could likely be revived.<br/><br/>And all of this was ignited by a single man.<br/><br/>Thinking this, she felt somewhat emotional.<br/><br/>…<br/><br/>In the Red Mansion, the little girl blankly looked at Gu Yang in the sky, suddenly huffed, and muttered, “You can’t deny it now. You’re definitely the reincarnation of an ancient great power…”<br/><br/>The man in white sitting on the mat looked at the three volumes of books in front of him, the corner of his mouth lifting in a faint smile.<br/><br/>He hadn’t misjudged him…<br/><br/>…<br/><br/>…<br/><br/>“The master’s cultivation has recovered a little more…”<br/><br/>The Little Green Bird chirped excitedly, but it couldn’t help but whisper, “Strange, when did Master comprehend the essence of thunder?”<br/><br/>Su Qingzhi, Ling Ling, Chu Xiyue, Pei Qianlan, Ye Lingbo, Cao Yiyi, and the other ladies all seemed much calmer. In their hearts, Gu Yang was invincible, and any kind of achievement he made would not surprise them.<br/><br/>Only they had absolute faith in Gu Yang.<br/><br/>Out of all of them, the one with the most complex emotions was Xi Huang standing at the end. Her aura was entirely different from before, having reached the realm of the Celestial Being.<br/><br/>A few months ago, her cultivation had already been restored to its peak, and even rose a level further, reaching the Unleaking Realm.<br/><br/>After the revival of the Way of Heaven, she was the first to benefit.<br/><br/>Just a few nights ago, her bloodline suddenly awakened, and she broke through to the Celestial Being realm overnight, receiving the inheritance within her bloodline that provided a vast amount of cultivation knowledge.<br/><br/>She was no longer naive as she had been before.<br/><br/>…<br/><br/>…<br/><br/>“Huh?”<br/><br/>Out of all the people, the most surprised was none other than the Yu Hao Heavenly King hiding within the “Divine Sky Annihilation”.<br/><br/>He was most familiar with Gu Yang’s cultivation. It had clearly been at the mid-stage of Spiritual Transformation just now, how had he suddenly skipped two realms and broken through to the Hollow Void stage?<br/><br/>Even after taking an Ascension Pill, the breakthrough wouldn’t be like this.<br/><br/>Furthermore, the Ascension Pill could only break through one minor realm.<br/><br/>There might be divine items in this world that could break two stages, but none of them caused this kind of commotion.<br/><br/>As expected of the one chosen by destiny, he had broken through in a manner far exceeding his knowledge.<br/><br/>He felt somewhat unable to see through this kid now.<br/><br/>PS: 3000 words, it’s the end of the month, ask for some monthly votes.\t\t\t\t\t\t</div>", "images": {}, "success": true}