{"id": 428, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132458.html", "title": "Chapter 428 - Chapter 428: 428 Hollow Void", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 428 - Chapter 428: 428 Hollow Void</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 428: 428 Hollow Void<br/><br/>[Recharge successful, obtained one shard, current shard count: one.]<br/><br/>[Recharge successful, obtained one shard, current shard count: two.]<br/><br/>[Recharge successful, obtained ten shards, … twelve shards.]<br/><br/>[…Twenty-two shards.]<br/><br/>After Gu Yang returned to his barracks tent, he recharged the standard spirit treasures he had, obtaining a total of twenty-two shards.<br/><br/>The quantity was beyond his expectation, it was simply a pleasant surprise.<br/><br/>What followed was his realization that the old Taoist Yu Ming was a practitioner of the Hollow Void realm, he definitely wasn’t a First-Order Heavenly Soldier. Most likely a second order. The standard spirit treasures he obtained could also be of the second order.<br/><br/>The Human Immortal Realm is divided into three minor realms: Celestial Being (Transcendence), Hollow Void, and Law Phantoma.<br/><br/>Each minor realm is further divided into three stages.<br/><br/>He was now a Celestial Being of the second order, ready to break through to the third order at any moment.<br/><br/>Similarly, among human-grade spirit treasures, there is also a hierarchy.<br/><br/>According to the records in the “Taixuan Heavenly Book,” human-grade spirit treasures are divided into three orders, the fundamental difference lies in the number of divine prohibitions they contain.<br/><br/>Some have one divine prohibition, some have two, and others have three.<br/><br/>The effect of a treasure varies greatly depending on the number of divine prohibitions.<br/><br/>From what it seemed, a spirit treasure having a single divine prohibition was worth one shard.<br/><br/>Those having two divine prohibitions were worth ten shards.<br/><br/>It’s regrettable that during this trip, Taoist Yu Ming and Yun Hua didn’t get any new standard spirit treasures when they went to the divine weapons hall. It could be that the Jade Disc of Fate had become suspicious.<br/><br/>According to the description from the old man who claimed to be the number one Sky King of the Sky Court, the intelligence of the Jade Disc of Fate is high, but after all, it is somewhat different from a normal Primordial Spirit and doesn’t seem very clever.<br/><br/>He had previously exploited its loophole.<br/><br/>Now, with twenty shards, his sense of security has greatly increased.<br/><br/>[Would you like to use the Life Simulator? Each use consumes two shards.]<br/><br/>“Yes.”<br/><br/>[At the age of twenty-three, you are already a second-order Celestial Being. You go to Sky Court and bring out a mysterious old man. You obtain a congenital spirit treasure and an elixir of ascension.]<br/><br/>[You received guidance from that mysterious old man, cultivated hard in the Sky Court for a year, then were banished from the Sky Court following a failed mission.]<br/><br/>[Half a year later, you returned to Sky Court, regaining the identity of a Heavenly Soldier…]<br/><br/>[After seven years of rigorous cultivation, you finally broke through to the third order of Celestial Being. Then, you took the Elixir of Ascension and directly advanced to the Hollow Void realm.]<br/><br/>[Three years later, when you were once again banished from the Sky Court, a ray of light descended from the sky. You died on the spot, at the age of thirty-three.]<br/><br/>The Hollow Void realm?<br/><br/>Really?<br/><br/>When Gu Yang saw the result of this simulation, he felt somewhat dazed.<br/><br/>He thought he had seen wrong due to tired eyes.<br/><br/>Upon closer inspection, there was no mistake. It was indeed written that he had broken through to the Hollow Void realm.<br/><br/>This is too…<br/><br/>His heart was filled with mixed emotions, it seems the system has finally done its part justice.<br/><br/>Breaking through two realms in a single simulation was a first in history.<br/><br/>Elixir of Ascension!<br/><br/>Gu Yang quickly realized the tremendous value of this Elixir. It could allow him to break directly through from the third order of Celestial Being to the Hollow Void realm.<br/><br/>Well-deserved Elixir of Ascension.<br/><br/>A fairy elixir that could directly promote realm advancement.<br/><br/>[Simulation over, you can keep one of the following.]<br/><br/>[One, martial arts realm at the age of thirty-three.]<br/><br/>[Two, martial arts experience at the age of thirty-three.]<br/><br/>[Three, life wisdom at the age of thirty-three.]<br/><br/>Amidst his excitement, Gu Yang was about to select an option. He paused suddenly, a thought popped into his mind. He temporarily suppressed the impulse in his heart and closed the system page.<br/><br/>…<br/><br/>Several days later, Gu Yang finally got the chance to leave the Sky Court.<br/><br/>However, before leaving, he had to leave behind the two standard spirit treasures, returning them to the divine weapons hall.<br/><br/>From this, it can be seen that for the Sky Court, earth grade spirit treasures are also very precious, they don’t give others the chance to easily take them away.<br/><br/>After leaving the Heavenly Court, he flew for half a day in the Gold Emperor Realm, which was like a dead zone, before finally stopping. He had a feeling that he had left the radiating range of the Heavenly Court, which was when he retrieved something from his Beast-taming Space.<br/><br/>It was a small jade talisman, the innate spirit treasure of the first Sky King. Now, a part of his True Spirit resided within this jade talisman.<br/><br/>No matter how vast the capabilities of the Wheel of Fate Jade Disk were, it would not know that there existed a profession like a Beastmaster in this world, capable of creating a Beast-taming Space within their consciousness.<br/><br/>With neither the gods nor the ghosts being aware, they had managed to bring out the old man.<br/><br/>Gu Yang said, “Senior, we are now beyond the Heavenly Court.”<br/><br/>A red glow lit up the jade talisman, and a faint shadow flew out. After observing the surroundings, it appeared to be a little astonished, “How did the Gold Emperor Realm become like this?”<br/><br/>Gu Yang shrugged his shoulders, “I am not sure about that. I have followed my promise and brought you here, I hope you can trust that.”<br/><br/>The red shadow kept silent for a while, then it said, “Although you have obtained the Black Emperor’s inheritance, in my view, your fundamentals are rather mixed, probably due to too many cultivation methods. If there isn’t anyone to guide you, if you continue to cultivate in this reckless manner, there will be no hope for you to become an Earth Immortal.”<br/><br/>Gu Yang became alert. This way of putting it was also recorded in “Taixuan Heavenly Book”.<br/><br/>Until now, when he had cultivated, he had indeed changed several cultivation methods.<br/><br/>This person could tell all of that at a glance, and he surely had some substance.<br/><br/>Lack of guidance was indeed his biggest shortcoming, and it was only after obtaining the “Taixuan Heavenly Book” that he gained a systematic understanding of the path of cultivation.<br/><br/>However, he didn’t know how to resolve the problems left over from his prior cultivation practices.<br/><br/>Since this person was once a Da Luo Golden Immortal, he might have a solution to his problems.<br/><br/>However, he appeared dismissive on the surface, and said, “It doesn’t matter. Anyway, everyone’s going to die when the catastrophe arrives in ten years.”<br/><br/>“You don’t have to deceive me. I’ve seen too many young people like you. Arrogantly confident, looking down on everything, why would they easily accept their fate? I won’t hide it from you, this Gold Emperor Realm has turned into a Dead Zone, and I cannot survive here. I need to go to a world full of life.”<br/><br/>Gu Yang flatly refused, “That’s impossible.”<br/><br/>This person was a Da Luo Golden Immortal. If he were to bring him into the Human Realm, or any other Hollow Void Realm, who knew what kind of trouble would arise?<br/><br/>Seeing Gu Yang’s apprehensions, the elderly person said, “I can stay by your side and guide your cultivation, how about that?”<br/><br/>“I don’t trust you.”<br/><br/>“If that’s the case, then I can’t give you this innate spiritual treasure. Without its protection, I would completely vanish within few years. When it’s a matter of life and death, even breaking a promise is justifiable.”<br/><br/>Both spoke with resolve, causing the atmosphere to freeze all of a sudden.<br/><br/>After a moment, Gu Yang asked in a more eased tone, “Why does senior insist on staying by my side? Given senior’s abilities, you can surely find other Hollow Void realms.”<br/><br/>This was a Da Luo Golden Immortal, one of the top figures in the Three Realms, apart from those Primordial ones. It would be strange if he did not know the location of other Hollow Void Realms.<br/><br/>“Before every great catastrophe, exceptional individuals emerge. The Human Emperor rose during the first catastrophe, and similarly, during the second one, another individual with great destiny came forth, achieving Da Luo in merely a few hundred years which is unheard of.”<br/><br/>“If my guess is not wrong, you are the one who is destined for the third catastrophe.”<br/><br/>Gu Yang was astounded on hearing this.<br/><br/>From one perspective, this was the truth.<br/><br/>As his cultivation level got higher, he felt more and more that his transference to this world and the Life Simulator attached to him were not without reason.<br/><br/>Especially after understanding the predicament this world was in, it became even clearer that his mission was likely to deal with the so-called great catastrophe.<br/><br/>Although, at heart, he really didn’t want to be the saviour of the world.<br/><br/>But with every simulation pushing him to the limit, even if he didn’t want to face it, he had no choice.<br/><br/>Unless he chose to lie down and wait for death.<br/><br/>If he wanted to survive, he would have to overcome the catastrophe ten years from now.<br/><br/>Seeing a hint of surprise in his eyes, the elder said, “Kid, your real age isn’t a secret, it’s obvious at a glance. A Twenty-three-year-old Human Immortal, even in ancient times, would be considered a prodigy.”<br/><br/>“Looking at your physique, you were not born with a heavenly body, yet possessing such cultivation level is undoubtedly a miracle. Moreover, after the collapse of the Way of Heaven, cultivation became even more difficult, which makes you more precious.”<br/><br/>“My energy has been locked on, and I will undoubtedly die in the next catastrophe. Staying by the side of you, the one meant for this catastrophe, perhaps, will provide me with a ray of hope.”<br/><br/>Gu Yang laughed, “Senior really thinks highly of me.”<br/><br/>The elder remarked, “There is no need for you to belittle yourself. Obtaining the Black Emperor’s inheritance and recognition from the Human Emperor Sword have proven your potential.”<br/><br/>“…”<br/><br/>Gu Yang knew that if the other party really wanted to follow him, there was nothing he could do about it.<br/><br/>This was a Da Luo Golden Immortal, even the second move of the Zhanxuan Swordsmanship, the Godslayer, would not be able to kill him. Even if the Human Emperor Sword unleashed all its power, it would be barely enough.<br/><br/>Besides, it was not worth drawing swords with a Da Luo Golden Immortal over such a trivial matter.<br/><br/>He changed the topic, “What is the name of this innate spirit treasure?”<br/><br/>The elder replied, “It’s called Nine Destructive God Thunder.”<br/><br/>Hmm, this name.<br/><br/>Could it be that this innate spirit treasure had a special relationship with the Six Destructive God Thunder?\t\t\t\t\t\t</div>", "images": {}, "success": true}