{"id": 421, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132443.html", "title": "Chapter 421 - Chapter 421: 421 Wind Stabilizing Pearl", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 421 - Chapter 421: 421 Wind Stabilizing Pearl</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 421: 421 Wind Stabilizing Pearl<br/><br/>“How terrifying.”<br/><br/>Gu Yang retreated several kilometers in one breath before he felt a little at ease. This gave him a whole new understanding of the horror of Celestial Immortals.<br/><br/>Merely by the oppression of their mortal body, from such a distance, he was almost crushed to death.<br/><br/>Had it been another Celestial Being, they would already be dead.<br/><br/>His accumulation was incredibly profound, not only was his mortal body far superior to common Human Immortals, but his Original Spirit was also ten times stronger than that of ordinary Human Immortals, which allowed him to withstand the huge pressure induced by the body of a Celestial Immortal, and not die immediately.<br/><br/>He looked ahead and saw waves raging in the Heavenly River, a black light and a golden light were shining in it. Even through the eyes of the Candle Dragon, he could not see the combat situation.<br/><br/>On one side was a Celestial Immortal-level demon beast.<br/><br/>On the other side was a Celestial Rank Spirit Treasure, nemesis to demon beasts, yet it didn’t have an owner to control it. Who would win was really hard to say.<br/><br/>At present, the Way of Heaven had just awakened, and the highest power was only at the third rank of Celestial Beings. Yet this beast, and this sword, were able to display such formidable power.<br/><br/>This was truly beyond his imagination.<br/><br/>Before, Gu Yang believed that with his own strength, even if he encountered ancient beings, he would be able to fight.<br/><br/>Now it seems he was still far from that.<br/><br/>Just the Celestial Immortal, in such an environment, could exert such terrifying power. Not to mention the Golden Immortal.<br/><br/>Legend has it that Golden Immortals are immortal beings, truly attaining the same longevity as heaven and earth.<br/><br/>Those he had encountered before, were Celestial Immortals left with a shred of their True Spirit. This was completely different from a Celestial Immortal with a Celestial body.<br/><br/>At this moment, Gu Yang had not a single drop of Immortal Element left in his body. To be on the safer side, he opened the system and claimed the reward after the simulation.<br/><br/>In an instant, he was back to his peak state. What’s more, the depth of his Immortal Element had also leveled up.<br/><br/>He took a glance at the remaining balance in the system; only six shards were left.<br/><br/>This quantity was a bit dangerous, enough for only three simulations.<br/><br/>After considering it, he decided to recharge using the silver armor and the sword he had just acquired.<br/><br/>[Successful recharge, one shard acquired, current shard quantity is 7.]<br/><br/>[Successful recharge…8 shards]<br/><br/>Having obtained two spirit treasures wasn’t exactly a lack of gain.<br/><br/>At this point, the battle over at the Heavenly River had entered a fierce stage. Two beams of light, black and white, shot into the sky, continuously hitting the bank. He could even feel the ground shaking.<br/><br/>In the end, that beam of white light managed to gain the upper hand, suppressing the black light.<br/><br/>A moment later, the Heavenly River returned to calm.<br/><br/>The battle was decided.<br/><br/>Seeing the carcass of the black dragon floating in the Heavenly River, Gu Yang felt a surge of joy, “Victory.”<br/><br/>A victory meant obtaining an Earth Grade Spirit Treasure as a reward.<br/><br/>Just this one Earth Grade Spirit Treasure was almost enough to cover the cost. And there was the unknown merit worth a hundred thousand points.<br/><br/>“Whoosh.”<br/><br/>The Demon-Slaying Sword flew back by itself, falling into his hand.<br/><br/>The voice became much weaker, “I made a huge loss this time — oh, kid, it seems you’ve got some good stuff on you. Your Immortal Element has recovered so quickly.”<br/><br/>“Awe-inspiring, senior!”<br/><br/>Gu Yang sincerely brown-nosed. This sword was too badass, capable of killing even Celestial Immortals.<br/><br/>A Celestial Immortal-level demon beast is considered the ceiling strength in this world.<br/><br/>If he could swindle it out, wouldn’t killing the three Demon Saints of the Three Saint Gate be child’s play?<br/><br/>Gu Yang was thinking along these lines, but before he could speak, the Demon-Slaying Sword fell silent and spoke no more.<br/><br/>It seemed that it had over-exerted itself when it killed the black dragon just now.<br/><br/>He could only give up for the time being, looking back at the corpse of the great demon beast floating in the Heavenly River, he felt a bit envious. This was the corpse of a Celestial Immortal demon beast.<br/><br/>If turned in for recharging, it must be worth a lot of shards.<br/><br/>Unfortunately, the mission was already completed. He currently could not enter the area of the Heavenly River.<br/><br/>The rules of the Heavenly Court were strict. Just like him, as a First-Order Heavenly Soldier, without an order, he would not even be able to leave the camps.<br/><br/>Of course, it was a simple matter to leave the Heavenly Court itself. Just violating some not so serious Heavenly Rules would result in being expelled out of the Heavenly Court, and that was the only punishment.<br/><br/>Gu Yang could leave whenever he wanted.<br/><br/>But once he left, it would be difficult to return.<br/><br/>…<br/><br/>According to the instructions, Gu Yang returned to the Temple of God Soldiers and returned the Demon-Slaying Sword.<br/><br/>Next, he received a silver armor and a sword.<br/><br/>He paused, then suddenly felt overjoyed.<br/><br/>By chance, he had discovered a method to exploit the system.<br/><br/>Two spiritually powerful treasures. To the Heavenly Court, they may be insignificant, but for him, they were equivalent to two fragments, tantamount to a chance to use the simulator.<br/><br/>Besides, he also received a reward for completing the mission, a bead.<br/><br/>The Wind-Calming Bead, an Earth Grade Spirit Treasure!<br/><br/>This is a rare treasure that does not possess a primordial spirit, an abnormal treasure that naturally formed. Any wind-oriented magic, would fail to exhibit its due valor in front of the Wind-Calming Bead.<br/><br/>It’s a good thing; but only proves useful under special circumstances.<br/><br/>Gu Yang put away the treasure and left the Divine Weapon Palace.<br/><br/>Soon, he returned to the barracks.<br/><br/>This time, he arrived at a tent.<br/><br/>At this point, he transformed into a fourth-order Heavenly General, having gained three ranks in succession, his status was completely different now.<br/><br/>He now knew what merits were for – they were meant for promotion; one hundred thousand merits were originally enough to get him promoted to a fifth-order Heavenly General.<br/><br/>The problem was that his cultivation level was too low.<br/><br/>The cultivation requirement for a Heavenly General was to be an Earth Immortal. The fact that he could become a Heavenly General was already an exceptional promotion. Any further advancements required stricter standards, which could be delayed because of his acquired merits.<br/><br/>Once he breaks through his cultivation level, he can naturally be promoted.<br/><br/>It looks like he would have to wait until he reached the Hollow Void realm.<br/><br/>But why, even though he is a Heavenly General, are his equipments still the same as those of a Heavenly Soldier?<br/><br/>Gu Yang felt that the will overseeing the operation of the Heavenly Court seemed somewhat dense or, rather, inflexible.<br/><br/>Seemingly unsure if it was an illusion, the rules of the Heavenly Court were strict, but there were quite a few loopholes. It was unclear whether the rules were not stringent enough or if it was intentional.<br/><br/>The accommodations for the Heavenly Generals, compared to the soldiers, were a notch up. The force of the immortal elements was more potent.<br/><br/>If he were to cultivate here, in at most a hundred years, he could complete the accumulation of the second level and break through to the Celestial Being realm third-order.<br/><br/>“I wonder how many years I could survive if I stay here.”<br/><br/>Suddenly, such a thought arose in Gu Yang’s mind.<br/><br/>As it appears now, the various functionalities of the Heavenly Court are still quite intact. Hiding here might allow him to evade the white light and possibly survive a few more years.<br/><br/>With this thought, he activated the system.<br/><br/>[Do you wish to use the Life Simulator? Using it once will consume two fragments.]<br/><br/>“Yes.”<br/><br/>[Twenty three years old…]<br/><br/>[You are cultivating hard in the Heavenly Court. After a year, you fail in a certain mission and are severely injured, and then expelled from the Heavenly Court.]<br/><br/>[Nine years later, one day, a white light descends, and you die on the spot at the age of thirty-three.]<br/><br/>Damn it, staying in the Heavenly Court wasn’t as easy as it seemed.<br/><br/>Only a year in, he encountered a mission he could not complete, so he couldn’t stay any longer.<br/><br/>This Heavenly Court indeed was cold-hearted. When they found him useless, they kicked him out directly.<br/><br/>He couldn’t imagine what kind of mission he would encounter a year later.<br/><br/>[The simulation has ended. You can choose to retain one of the following.]<br/><br/>[…]<br/><br/>Gu Yang did not make any choices and directly shut down the system.<br/><br/>After reaching the Celestial Being realm, the process of accumulating the Immortal Elements took way too long. He had barely recovered after several years of fighting.<br/><br/>Thus, he wanted to preserve a reward for a crucial moment when it could instantaneously replenish his exhausted Immortal Elements.<br/><br/>Just as he was thinking about this, he felt an idea from the depths of the universe once again.<br/><br/>Another task was at hand.<br/><br/>It was no surprise since he was likely the only one left in these barracks. If there was a mission, it could only be assigned to him.<br/><br/>“A prohibition in the Wuji Temple has failed. With the River Book (fake), go and repair it.”<br/><br/>Repair the prohibition?<br/><br/>This was Gu Yang’s weak point. For a fighter, prohibitions were not useful, so they would not normally be studied. The most he had done was to get a basic understanding of them.<br/><br/>“Upon completion of the task, you will receive 50,000 merits and a chance to cleanse your body in the Immortal Pool.”<br/><br/>“If the mission fails, you will be demoted to the Mortal Dust.”\t\t\t\t\t\t</div>", "images": {}, "success": true}