{"id": 427, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132456.html", "title": "Chapter 427 - Chapter 427: 427 Innate Spiritual Treasures", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 427 - Chapter 427: 427 Innate Spiritual Treasures</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 427: 427 Innate Spiritual Treasures<br/><br/>Gu Yang’s question seemed a tad abrupt, as if this unknown old man had deliberately lured them here.<br/><br/>Indeed, this was his speculation, or perhaps a probe.<br/><br/>Since this man could sense the revival of the Way of Heaven, it would be quite normal for him to sense their arrival in heaven as well.<br/><br/>He had said, “You have finally arrived,” indicating that he really had been waiting for them.<br/><br/>There was a possibility that this man intentionally caused a disturbance to compel the Wheel of Creation to issue an order, summoning people to suppress him.<br/><br/>The task that Gu Yang received was “suppression,” not annihilation. He had found it odd at the time, but now it seemed it was because they could not possibly annihilate him.<br/><br/>He was very likely a former Da Luo Golden Immortal.<br/><br/>An emaciated camel is still larger than a horse. Even a supreme treasure might not be able to kill a Da Luo Immortal.<br/><br/>At that moment, the Demon-subduing Pestle in Gu Yang’s hand began to vibrate violently, about to break free from his grip.<br/><br/>A powerful thought was transmitted: “You dare to defy orders! You’re courting death.”<br/><br/>The Demon-subduing Pestle could tolerate no further and was about to retaliate.<br/><br/>“Rebellion?”<br/><br/>Gu Yang sneered and took out the Sword of the Human Emperor from his Beast-taming Space.<br/><br/>Knowing that the Sword of the Human Emperor was incompatible with Heaven, he had never taken the sword out before.<br/><br/>Now, with the Demon-subduing Pestle about to rebel, he needed to use the Sword of the Human Emperor to deal with such an extraordinary treasure.<br/><br/>“The Sword of the Human Emperor?”<br/><br/>The old man, who looked like a mummy, was the first to recognize it, showing shock in his tone for the first time.<br/><br/>…<br/><br/>“What, the Sword of the Human Emperor?”<br/><br/>Old Daoist Yu Ming was also greatly shocked when he heard this.<br/><br/>From ancient times, this sword had been the most famous treasure of the human race. Its power was not the greatest, but its renown was undoubtedly the highest.<br/><br/>You couldn’t mention the rise of the Human Race without mentioning the Sword of the Human Emperor.<br/><br/>Even cultivators of the Three Realms knew about the prestigious Sword of the Human Emperor.<br/><br/>Just as the Book of the Dead is a symbol of the Netherworld, the Sword of the Human Emperor is the iconic treasure of the Human Realm.<br/><br/>However, wasn’t the Sword of the Human Emperor destroyed in the first catastrophic calamity?<br/><br/>According to the records left by the founder, during the calamity, the strongest figure of the Human Realm who wielded the Sword of the Human Emperor was the first to perish. The Sword of the Human Emperor was also destroyed on the spot.<br/><br/>Could it be a counterfeit?<br/><br/>No, this aura was unmistakably the Sword of the Human Emperor.<br/><br/>The Old Daoist Yu Ming finally realized what gave Gu Yang his confidence. It was the Sword of the Human Emperor, a supreme treasure from the ancient times.<br/><br/>At the very least, two Golden Immortals of the Monster Race had been slain by this sword.<br/><br/>…<br/><br/>Zhanxuan Sword Technique’s second form, Godslayer!<br/><br/>This time, when he took out the Sword of the Human Emperor, it was completely different than before. The blade emitted a dazzling light that swept away the surrounding darkness and oppressive atmosphere.<br/><br/>Wherever it reached, it was overpowering and pure, symbolizing a burgeoning vitality.<br/><br/>Gu Yang felt an unprecedented surge of power, amplifying his Immortal Element by hundreds of times. This was the most powerful strike he had ever released in his life.<br/><br/>The Demon-subduing Pestle, sensing danger, also erupted with golden radiance, symbolizing extremity and rigidity. However, in front of the Sword of the Human Emperor, it paled in comparison.<br/><br/>The Sword of the Human Emperor struck through the air, an invisible force instantly slicing through the Demon-subduing Pestle’s radiance.<br/><br/>The Demon-subduing Pestle then quieted down and its radiance turned softer.<br/><br/>Its Primordial Spirit had been annihilated by a single strike.<br/><br/>Then, Gu Yang turned his gaze towards the spiritual treasures held by Old Daoist Yu Ming and Yun Hua.<br/><br/>Both were deeply shocked by the power of that one sword.<br/><br/>Especially Old Daoist Yu Ming, who could hardly believe that such tremendous power could be unleashed after the collapse of the Way of Heaven.<br/><br/>Was this the power of an Earth Immortal?<br/><br/>Just one sword was enough to destroy the Primordial Spirit of a Celestial Grade spiritual treasure.<br/><br/>It was truly terrifying.<br/><br/>Thus, when Gu Yang’s gaze turned towards him, he let out a tremble and instinctively handed the bead in his hand over, stuttering, “El…Elder, I think you should keep this.”<br/><br/>Yun Hua also quickly handed over the bow and arrow from his hand to Gu Yang.<br/><br/>After accepting the two items, Gu Yang felt the Primordial Spirits within trembling, and communicated with them, “If you don’t want to be destroyed, let me leave my imprint on your cores.”<br/><br/>Just like that, he gained two more Earth Grade Spirit Treasures.<br/><br/>Extreme Sun Beads, Demon-breaking Bow.<br/><br/>These are the names of two Earth Grade Spirit Treasures. As the names suggest, they are special relics used to deal with the likes of demons.<br/><br/>They also have miraculous effects on Original Spirits and Spiritual Bodies.<br/><br/>Gu Yang put these two Spirit Treasures, along with the Demon-subduing Pestle, into his Beast-taming Space. He looked at the elder and said, “Elder, we can continue.”<br/><br/>The two red dots in the elder’s eyes emitted a faint glow, “Are you the descendant of the Black Emperor?”<br/><br/>Black Emperor?<br/><br/>Gu Yang knew that in ancient times, there were five Heaven Emperors, all of whom were existences on par with the Human Emperor. They were big figures in the Three Realms. The Black Emperor was one of these Five Heaven Emperors.<br/><br/>Yun Piaomiao from Shuieyue Cave Heaven once asked him if he was the descendant of a certain Immortal Sovereign. Was she referring to the Black Emperor?<br/><br/>That means the Zhanxuan Swordsmanship is inherited from the Black Emperor.<br/><br/>He chuckled without answering, “Elder, time is of the essence. Let’s talk about the task at hand.”<br/><br/>The elder looked at him deeply and said, “I want you to do me a favor and help me leave Heaven.”<br/><br/>This request was not unexpected.<br/><br/>The elder was trapped in the Immortal Prison. Although he had managed to survive, he could no longer leave. Staying was akin to waiting for death.<br/><br/>In fact, he was on the verge of death. Had Gu Yang not broken through, facilitating the resurgence of the Way of Heaven, the elder would have already perished<br/><br/>Ten years from now, a great catastrophe will come. Staying here is the same as waiting for death.<br/><br/>By leaving, he had a chance of survival.<br/><br/>Gu Yang simply asked a question, “What are the benefits for me if I do this?”<br/><br/>The task was extremely risky. Without sufficient benefits, who would be willing to perform it?<br/><br/>The elder looked at the Human Emperor Sword in his hand, paused for a moment, and said, “I used to possess a primordial treasure. If you can help me escape, this primordial item will be yours.”<br/><br/>As expected of a former Golden Immortal, he offered a primordial treasure so easily.<br/><br/>Of course, there was no proof.<br/><br/>“Why should I believe you?”<br/><br/>“Truth be told, that Primordial Spirit Treasure was also eroded by the Wheel of Fortune Jade Disk, and its Primordial Spirit split into two. One half remains loyal to me, while the other half turned traitor. I only have a tiny bit of True Spirit left, making me incapable of expelling the rebellious Primordial Spirit. If you can use the Zhanxuan Swordsmanship, you should be able to handle it.”<br/><br/>So that’s how it is.<br/><br/>Gu Yang thought to himself, that sounds about right. Otherwise, why would anyone want to give away a primordial treasure?<br/><br/>This primordial treasure seems unreliable.<br/><br/>The Primordial Spirit of the Shanhetu from Shuieyue Cave Heaven also betrayed its owner. This super treasure from Heaven also betrayed its owner. Even this elder’s Primordial Spirit is messed up.<br/><br/>“Deal.”<br/><br/>…<br/><br/>…<br/><br/>A day later, Gu Yang, with the anxious Yu Ming and Yun Hua, left the Immortal Prison.<br/><br/>Suddenly, he remembered something else, “Right, give me the armor and the sword.”<br/><br/>Although Yu Ming was perplexed, he handed over the armor and the sword promptly.<br/><br/>Having witnessed the power of these items, he dared not harbor any other thoughts.<br/><br/>He obtained four more fragments.<br/><br/>Gu Yang was in high spirits as he led them to the Divine Weapon Hall.<br/><br/>In the Great Hall, he reported the completion of his task, “Task completed, the demon beast has been subdued. However, the Demon-subduing Pestle, Extreme Sun Beads, and Demon-breaking Arrow were all destroyed during the battle.”<br/><br/>Suddenly, a profound consciousness descended upon him, scanning him from head to toe – even his Original Spirit wasn’t spared.<br/><br/>After a moment, the consciousness disappeared.<br/><br/>“Task complete. Please collect your reward.”<br/><br/>When Gu Yang heard this, he let out a sigh of relief. He had really passed.<br/><br/>He then received his reward, an Immortal Ascension Pill.<br/><br/>He didn’t know what the use of this Immortal Pill was, he’d ask that person when he got back.<br/><br/>Yu Ming and Yun Hua standing next to him also received their rewards and were overjoyed. They never thought the task would be considered a success like this.<br/><br/>This time, they basically did nothing and got a Rise Immortal Pill for free.<br/><br/>Moreover, they learned some secrets about the ancient times.<br/><br/>This trip was really worth it.<br/><br/>They were also filled with gratitude for High Immortal Gu Yang.<br/><br/>They could say they had basked in his radiant fortune.\t\t\t\t\t\t</div>", "images": {}, "success": true}