{"id": 423, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15132447.html", "title": "Chapter 423 - Chapter 423: 423 Immortal Prison", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 423 - Chapter 423: 423 Immortal Prison</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 423: 423 Immortal Prison<br/><br/>Earth Immortal?<br/><br/>Upon seeing the golden armor on the man, Old Daoist Yu Ming was astounded.<br/><br/>How can an Earth Immortal exist in this world?<br/><br/>After the collapse of the Way of Heaven, whether you’re an Earth Immortal or Celestial Immortal, you’ll fall from your realm and at most be able to maintain as a Human Immortal.<br/><br/>He has lived for more than a thousand years and encountered all sorts of strange things. He has met reincarnated mighty beings from ancient times and even living Celestial Immortals from the ancient eras. None of them surpassed him in cultivation.<br/><br/>A living Earth Immortal? How is this possible?<br/><br/>The founder of Guang Yuan Sect came from the Heavenly Court. Among the sect’s records, there is a hand-rolled book that details information about the Heavenly Court, including how the heavenly soldiers and generals are classified.<br/><br/>Only an Earth Immortal can serve as a third-rank general, wearing a golden armor, which is an Earth Grade Spirit Treasure.<br/><br/>Feeling the oppressive force emanating from that golden armor, Yu Ming had only ever felt such a pressure before when he was in the presence of a living Celestial Immortal – after achieving his own profound cultivation.<br/><br/>This is bad!<br/><br/>A layer of fine sweat beads instantly appeared on his forehead.<br/><br/>To encounter an Earth Immortal with an unknown background could be a terrifying experience. Battle? Would lose. Flee? Can’t escape. Both life and death are controlled by others.<br/><br/>Why did he have to stumble upon this kind of situation on this particular trip inside?<br/><br/>Could it be related to the recent changes in the Way of Heaven?<br/><br/>Yun Hua, who stood behind him, was also astonished. Wasn’t it said that no one else existed in the Heavenly Court?<br/><br/>She was about to ask her master, but observing the terrified expression on his face, she felt a knot in her stomach and dared not ask further.<br/><br/>…<br/><br/>“There are people?”<br/><br/>Gu Yang had just taken a bath and was merrily heading back to his camp when he discovered two more people in the barracks and his steps involuntarily slowed down.<br/><br/>Encountering other people within the Heavenly Court was something he never anticipated.<br/><br/>Had the inhabitants of the Heavenly Court awakened?<br/><br/>Or, were they intruders from outside?<br/><br/>From their attire, they seemed to be the latter.<br/><br/>One of them had an elusive aura that painted an unfathomable impression.<br/><br/>Hollow Void?<br/><br/>He was uncertain, but without a doubt, the old man in the Daoist robe was the most powerful individual he had ever encountered—more so than even Lord Chi Ming’s incarnation.<br/><br/>It could only be the Hollow Void realm.<br/><br/>Such a being is actually present in his world.<br/><br/>In the face of such a figure, he felt somewhat unsure.<br/><br/>Most importantly, he knew nothing about the other party’s background.<br/><br/>Encountering a Hollow Void realm expert in a place like the Heavenly Court would definitely require careful consideration from anyone.<br/><br/>He just arrived here two days ago and had already gained countless benefits.<br/><br/>A treasure like this, discovered by two groups simultaneously, and these two groups discovering each other simultaneously– suspicion was inevitable.<br/><br/>The most frightening thing was that he was currently on the weaker side.<br/><br/>“Wait, this is the Heavenly Court. The Heavenly Law prohibits private fights. If discovered, they can be stripped of their cultivation at the least, and at worst, executed.”<br/><br/>Remembering where he was, Gu Yang felt settled.<br/><br/>Moreover, during the Simulation, there was no mention of these two, which meant they would not pose a significant impact on him, much less any fatal threat.<br/><br/>Feeling more confident, he continued approaching them, thinking of how to start the conversation, just as the Hollow Void elder bowed in respect, “Greetings, High Immortal.”<br/><br/>High Immortal?<br/><br/>This surprised Gu Yang and almost threw him off balance, but luckily, he reacted promptly and realized that the golden armor he wore had caused the misunderstanding.<br/><br/>“Did they mistake me for an Earth Immortal?”<br/><br/>In the Heavenly Court, those who wear golden armor are heavenly generals, and typically, only Earth Immortals qualify to serve as such.<br/><br/>His rapid promotion was due to his exceptional merit, which others could hardly replicate.<br/><br/>After all, he was credited with slaying a Celestial Immortal demon beast. Although the Demon-Slaying Sword did most of the job, without him, who knows how long that demon beast would have wreaked havoc in the Heavenly River.<br/><br/>With the Way of Heaven gradually recovering, there was a chance that the demon beast would eventually break loose and cause chaos in the Heavenly Court, which would lead to immeasurable losses.<br/><br/>After understanding this, Gu Yang gave a slight nod and casually asked, “Where did you come from?”<br/><br/>Old Daoist Yu Ming replied in fear and trepidation, “I’m just a simple country folk, of no importance. I wouldn’t dare bother the High Immortal with my story.”<br/><br/>Gu Yang clearly understood his fear. They were worried that revealing their origins might bring disaster to their sect.<br/><br/>“Your name.”<br/><br/>“I am Yu Ming, and this is my disciple, Yun Hua.”<br/><br/>“Since you are in the Heavenly Court now, you should follow its rules,” said Gu Yang before returning to his barracks tent.<br/><br/>His position was high, but his cultivation level lagged behind others by one realm. In addition, the rules of the Heavenly Court were strict, so he could not do anything to them. It was better not to see them at all.<br/><br/>Hopefully, they would know their place and leave voluntarily.<br/><br/>Gu Yang returned to his tent and started to practice after sitting cross-legged on the ground.<br/><br/>The Celestial Pond body cleansing he received this time brought him great benefits.<br/><br/>After he realized the uniqueness of the Celestial Pond, he swiftly activated the simulator and carried out two simulations.<br/><br/>It was as if he had a body cleansing three times, laying an excellent foundation for his mortal body.<br/><br/>With the two simulations providing twenty years of cultivation level improvement, he was only one step away from reaching the Tier-3 Celestial Being Realm.<br/><br/>Suddenly, Gu Yang picked up the auxiliary sword of a heavenly general, an Earth Grade Spirit Treasure.<br/><br/>[Item grade is too high, cannot recharge.]<br/><br/>Are you kidding me?<br/><br/>Looking at this prompt, he was almost stunned. This was the first time he encountered such an issue when trying to recharge.<br/><br/>It claimed that the grade was too high, which was rather awkward.<br/><br/>But then he thought about it, he was stuck at the second tier of the Human Immortal Nine Realms. An Earth Grade Spirit Treasure was equivalent to the existence of an Earth Immortal. At least seven to eight levels, maybe even more than ten levels set them apart.<br/><br/>If he lacked one realm, he wouldn’t have the certainty of success, let alone a gap of seven or eight realms. The gap was simply too big.<br/><br/>Moreover, when he finally broke through to the Earth Immortal Realm someday, the requirements of the system would definitely change again.<br/><br/>Thinking about it this way, it made sense.<br/><br/>However, he was left with only two fragments now and needed to get more urgently.<br/><br/>He possessed several Earth Grade Spirit Treasures but was in short supply of Human Grade Spirit Treasures. All the items that could be recharged were already recharged. The few ones left previously were given to Qingzhi and the others.<br/><br/>…<br/><br/>Seeing the Heavenly General showing no interest in dealing with him, Yu Ming breathed a sigh of relief.<br/><br/>The pressure of facing an Earth Immortal was simply overwhelming.<br/><br/>“Grandmaster, shall we continue to stay here?” Yun Hua asked in a low voice.<br/><br/>The presence of a Heavenly General of unknown origin in the Heavenly Court made it extremely dangerous. She had already contemplated leaving.<br/><br/>After pondering for a while, Yu Ming decisively said, “Let’s stay. The rules in the Heavenly Court are stringent. Even if that person harbors ill intentions towards us, it won’t be easy.”<br/><br/>That was his reliance.<br/><br/>As a Hollow Void expert, standing at the pinnacle of the world, he had always been longing to advance further. However, he had been stuck in this realm for hundreds of years, and his cultivation level could not move forward.<br/><br/>Until recently, he finally felt an extremely slow growth.<br/><br/>This made him very delighted. Therefore, he came to the Heavenly Court in person, hoping to leverage this environment to improve his cultivation level a little bit more.<br/><br/>But to his surprise, he encountered an Earth Immortal.<br/><br/>An Earth Immortal!<br/><br/>He was only in the first tier of Hollow Void, five minor realms, and one major realm away from an Earth Immortal. It was like a chasm.<br/><br/>He was eager to know how the other party managed to maintain the Earth Immortal realm.<br/><br/>Even if he had to take some risks, he was ready to do it.<br/><br/>As the saying goes, “If one learns the Dao in the morning, it is okay to die at night.”<br/><br/>If Yu Ming did not have this mindset, he wouldn’t have reached today’s realm.<br/><br/>Seeing that even her grandmaster said so, Yun Hua could only put her mind at ease and stayed.<br/><br/>Afterwards, the two of them went to their respective tents.<br/><br/>Just like that, another two days passed.<br/><br/>Suddenly, the three people in the tent opened their eyes at the same time.<br/><br/>The mission is here again.<br/><br/>“A Celestial Immortal level demon-beast is causing trouble in the Fairy prison. Take the Demon-subduing Pestle and go suppress it.”<br/><br/>This was Gu Yang’s mission.<br/><br/>The missions for the other two, however, had become, “Assist Gu Yang in suppressing the demon beast in the prison.”<br/><br/>That is to say, this was a team mission. They had to go together.<br/><br/>PS: This is to make up for the update I missed last night.\t\t\t\t\t\t</div>", "images": {}, "success": true}