{"id": 430, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15258190.html", "title": "Chapter 430 - Chapter 430: 430 Way Of Heaven Rebirth", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 430 - Chapter 430: 430 Way Of Heaven Rebirth</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 430: 430 Way of Heaven Rebirth<br/><br/>When the second core in Gu Yang’s Original Spirit coagulated, the Vitality of Heaven and Earth from all directions converged on him. Above him, a massive funnel-shaped cloud formed, looking quite impressive.<br/><br/>Great amounts of Heaven and Earth Vitality flowed into his body and transformed into Immortal Element. This process was extremely slow.<br/><br/>Ten thousand pieces of Heaven and Earth Vitality could hardly synthesize a single strand of Immortal Element Power.<br/><br/>Continuing at this pace, the entire breakthrough process was impossible to complete within one or two months.<br/><br/>Meanwhile, beside him, the Way of Heaven began to manifest.<br/><br/>It started faintly, almost nonexistent. Even and Wen Jue, who were Celestial Beings, could hardly see it clearly.<br/><br/>However, as time passed, the manifested Way of Heaven became substantial, like a newborn baby, it grew from small beginnings and evolved into the magic of creation.<br/><br/>The two were utterly fascinated.<br/><br/>After the collapse of the Way of Heaven, even a world like the Hollow Void was left incomplete.<br/><br/>During their breakthrough, their understanding of the Way of Heaven was also incomplete, leading to their imperfect realm.<br/><br/>Now, they were able to witness the process of the Way of Heaven growing from its infancy. For them, this was a great opportunity.<br/><br/>Su Qingzhi and others who were close by, along with the disciples of the academy, also observed this opportunity.<br/><br/>The higher ones cultivation level, the greater the benefit they would receive.<br/><br/>Suddenly, an astonishing fluctuation came from the academy, resonating with Heaven and Earth.<br/><br/>Someone had a breakthrough to the Celestial Being realm!<br/><br/>It was Li Yuan, the first disciple of the academy, who was already almost at the door. After witnessing the manifestation of the Way of Heaven, he finally took a step forward.<br/><br/>His breakthrough stimulated the currently manifesting Way of Heaven.<br/><br/>All at once, in the void, a wisp of Immortal Element Power was born.<br/><br/>Then, more and more Immortal Element Power began to emerge.<br/><br/>Both Gu Yang and Li Yuan absorbed these Immortal Element Powers, accelerating their breakthroughs.<br/><br/>…<br/><br/>The onlooking audience was not limited to just the members of Divine City.<br/><br/>In the distant sky, a faint figure manifested, looking at the manifesting Way of Heaven, murmuring, “Eight thousand years have passed, and the Human Realm has given birth to Immortal Element Power again…”<br/><br/>The collapse of the Way of Heaven had caused the fall of countless immortals, and simultaneously, the basis for the existence of Immortal Element Power had been lost. As the Immortal Element began to vanish.<br/><br/>Sooner or later, the Vitality of Heaven and Earth would also completely disappear.<br/><br/>That would mark the era of the Dharma’s decline.<br/><br/>However, for a few individuals, it would present a significant opportunity.<br/><br/>For example, those who practiced the Way of the Declining Dharma.<br/><br/>When the Three Realms enter the era of the Dharma’s decline, it would be the opportunity for such great beings to accomplish creation.<br/><br/>That is the only chance of giving birth to new creation after a great disaster, calculated by three Primordial Golden Immortals in ancient times.<br/><br/>All the withdrawn powers were waiting for that day to come.<br/><br/>However, their calculations now faced an unexpected event.<br/><br/>There was actually a boy who singlehandedly reversed the decline of this world, causing the Way of Heaven to revive, and in such a short time, had given birth to Immortal Element Power.<br/><br/>The faster the Way of Heaven revives, the more horrifying the great disaster it would invite in a few years.<br/><br/>Then, those powers hidden at the end of void, would probably have nowhere to hide.<br/><br/>At that time, what the Three Realms would welcome could be truly the complete destruction.<br/><br/>This man was none other than an incarnation of Lord Chi Ming, who had sensed a significant change in the Heaven and Earth, and had rushed to the source instantly.<br/><br/>He had watched Gu Yang grow from the Mortal Realm to the second realm of the Human Immortal in just over a year.<br/><br/>He had spent more than a few years even in his sleep.<br/><br/>“Who exactly left this fellow as a backup?”<br/><br/>The names flashed through the mind of Lord Chi Ming, but none of them seemed likely.<br/><br/>On Gu Yang, he saw the shadow of the Phoenix, the shadow of the Heaven Court, the shadow of the Black Emperor, and even the shadow of the Human Emperor…<br/><br/>But it didn’t seem like any of their doings.<br/><br/>Because it was too obvious.<br/><br/>Whether it was their work or not, this move had sent the fate of this world sliding unpredictably.<br/><br/>Honestly, he had spent over a thousand years carefully setting multiple traps, and was just about to set them off. But with this interference, all his plans were lost.<br/><br/>He could hardly wait to appear in person and strangle the boy.<br/><br/>However, he held back.<br/><br/>Whether he could do it or not, even if he could, he wouldn’t do that.<br/><br/>He knew clearly that after this boy activated the Way of Heaven, he would become the dominant force of this world. Anyone who opposed him wouldn’t end up well.<br/><br/>After the Way of Heaven revived, the fate became something invisible yet tangible.<br/><br/>But it didn’t matter, there would always be those who lost their sanity and were looking for trouble for him.<br/><br/>The incarnation of the Lord Chi Ming withdrew his gaze and vanished.<br/><br/>…<br/><br/>On the other side, two figures appeared on the clouds, who were the two Great Saints from the Sacred Sect.<br/><br/>“Hollow Void—”<br/><br/>Red Moon Great Saint, dressed in a peach-colored gown, murmured, “this boy, can’t really be the Emperor, can he?”<br/><br/>No one answered her question.<br/><br/>Qingyu Great Saint’s face was grave.<br/><br/>They had both experienced the previous two disasters, and naturally knew what would ensue once the Way of Heaven revived to this point.<br/><br/>When the Way of Heaven initially revived, the ancient powers asleep at the end of the void might not have felt it.<br/><br/>But now that the Way of Heaven had officially been reborn, some of the powers would definitely sense it, and would send their subordinates to return and investigate.<br/><br/>An Immortal Palace in Yao Chi was already making them worried, and things would become very lively in the future.<br/><br/>As for whether Gu Yang was really the Emperor, it wasn’t important anymore.<br/><br/>His cultivation speed was astonishingly fast. Even if he was not the Emperor, his origins could not be simple, and not something they could dare to provoke.<br/><br/>…<br/><br/>Hidden at the edge of the void, in an Immortal Palace in Yao Chi.<br/><br/>In a certain hall, Lu Ying was seated cross-legged on the ground, with several mirrors in front of her displaying profound techniques.<br/><br/>She was comprehending a big divine power.<br/><br/>Suddenly, she felt her Original Spirit brimming with vitality, as if it had unraveled some bindings. In an instant, her Cultivation Level had restored to the second realm of Human Immortal.<br/><br/>“Huh?”<br/><br/>She was somewhat surprised. When she felt more intently, she immediately felt that something was wrong.<br/><br/>Way of Heaven, had actually revived.<br/><br/>How could this happen?<br/><br/>What on earth happened?<br/><br/>Once she confirmed, she was taken aback.<br/><br/>According to her previous experience, the Way of Heaven shouldn’t reappear until two years later, right?<br/><br/>Why was it so fast this time?<br/><br/>Lu Ying felt a little uneasy, knowing that something significant must have happened in the Human Realm.<br/><br/>“Si Chen!”<br/><br/>She decided to send someone to investigate the Human Realm and check what had happened.<br/><br/>…<br/><br/>The rebirth of the Way of Heaven, the impact it created, was not only limited to Divine City, or only to Divine State Continent, but even as far as West Bank Continent, and every corner of this world felt its influence.<br/><br/>Even the cultivators in the Thirty-Three Heavens felt the change of Way of Heaven.<br/><br/>And the central figure of all these changes was at this moment, completely immersed in the evolution of the Way of Heaven. He was reaping massive rewards every moment.<br/><br/>This was the benefit of being the first to breakthrough. One could witness firsthand how the Way of Heaven grew from a single seed, sprouted, to thrived. This process from one to two was an opportunity that countless Golden Immortals yearned for in their dreams.\t\t\t\t\t\t</div>", "images": {}, "success": true}