{"id": 431, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15258191.html", "title": "Chapter 431 - Chapter 431: 431 Congratulations To Master Gu", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 431 - Chapter 431: 431 Congratulations To Master Gu</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 431: 431 Congratulations to Master Gu<br/><br/>This feast lasted a full ten days.<br/><br/>During these ten days, all the warriors who received the news hurried to Divine City as fast as possible. Being able to witness the manifestation of the Way of Heaven was of great benefit to their own cultivation.<br/><br/>Especially for those in the Divine Power realm.<br/><br/>In these ten days, countless First Rank warriors crossed that threshold and broke through to the Divine Power realm.<br/><br/>Among them, many broke through their realms in the Divine Power realm, at least several dozen advanced to the Mana realm.<br/><br/>There were also more than ten who advanced to the Unleaking Realm.<br/><br/>Even the number of Celestial Beings increased by several.<br/><br/>Apart from Li Yuan, there was a member from the Lin Family, one from the Chen Family, and several others who had been stuck in the Unleaking Realm for countless years.<br/><br/>This was an unprecedented miracle in martial arts history, where one person’s ability benefitted countless warriors.<br/><br/>Everyone present, regardless of whether they were from the nine prominent families, several major sects, the royal palace… all owed him a debt of gratitude.<br/><br/>Finally, after ten days, the manifested Way of Heaven disappeared, and everything returned to its calm.<br/><br/>Gu Yang had also finished the final step, reaching the Hollow Void realm.<br/><br/>He opened his eyes and saw the crowd below, most of them were unfamiliar faces, but there were also a few acquaintances.<br/><br/>Before he could say anything, someone in the crowd blurted out, “Congratulations, Real Man Gu!”<br/><br/>“Real Man” was an ancient title of respect for human immortals and currently used to honor powerful Celestial Beings. It was quite fitting in this context.<br/><br/>Gu Yang wasn’t expecting such a grand reception. He thought back to just over a year ago when he left Liu Family Village, and he was just a minor Ninth Rank warrior.<br/><br/>He hadn’t even left Lian Mountain when he ran into a gang of mountain bandits, leading to a close brush with death. Cautiously all the way, taking various risks to earn money, and offending powerful entities like the Liu Family…<br/><br/>Now, just over a year later, he stood at the pinnacle of this world.<br/><br/>Among those present were Celestial Beings, those in the Divine Power realm, grand clans, prominent sects, members from the royal family…<br/><br/>These people, willing or not, had to bow their noble heads before him out of respect.<br/><br/>Today, he was the first among Great Zhou, and even the entire Divine State Continent.<br/><br/>His achievements had surpassed those of the two legendary figures, the founder of the Dao Sect and the Xia Emperor.<br/><br/>Gu Yang glanced at them, gave a slight nod, and left the place with Su Qingzhen and the others.<br/><br/>As he left, the crowd dispersed, but some still stayed, eagerly discussing the momentous event.<br/><br/>…<br/><br/>“Two seniors.”<br/><br/>After sending Su Qingzhen and the others back to the Lunar Abyss, Gu Yang stayed in the academy and went to a courtyard where Gao Fan and Wu Er resided.<br/><br/>Both of these seniors had provided him with substantial help. Now, it was time to repay them.<br/><br/>Gao Fan and Wu Er looked at him with complex expressions, “Didn’t expect you to take this step so quickly. I originally thought it would take, at least, hundreds of years.”<br/><br/>“You brat, instead of focusing on cultivation, you’re here looking for us two old farts? Shoo, go do what you have to. I do not have any requests, I just hope that one day, you will be able to perfect the Nine Blade of Heavenly Question.”<br/><br/>Seeing Wu Er impatiently shooing him away, Gu Yang could roughly guess his thoughts.<br/><br/>Perhaps, his time was running out.<br/><br/>Wu Er’s current state was abnormal. He should have been killed by Red Moon Great Saint nineteen years ago, but somehow he escaped and was left powerless.<br/><br/>These years, he had been following his junior, Ling Ling, and aside from advising on cultivation, he couldn’t help much.<br/><br/>However, precisely because this once Unleaking realm powerhouse was present, Ling Ling managed to avoid many dangers and grow seamlessly.<br/><br/>Now, Ling Ling has broken through to the Divine Power realm and with Gu Yang around, whether it’s about rebuilding the Wu Family or seeking revenge against Lord Chi Ming and Red Moon Great Saint, it’s no longer challenging.<br/><br/>Wu Er’s wishes had been fulfilled, his heart was at ease, and his life was approaching its end.<br/><br/>Over the years, he had persisted until now because of his determination.<br/><br/>Just earlier, he witnessed Gu Yang breaking through to the Hollow Void realm and understanding the Way of the Celestial Beings from the manifested Way of Heaven.<br/><br/>Unfortunately, he had no cultivation left in his body. Even though he gained enlightenment, it was impossible for him to make a breakthrough.<br/><br/>The saying goes, “To learn the Way in the morning, one can die in the evening with no regrets.”<br/><br/>After Wu Er gained insight into the Way of the Celestial Being, he suddenly realized that his death was drawing near.<br/><br/>He didn’t want to let Gu Yang and Ling Ling know, to make them worried, so he tried to drive Gu Yang away to prevent him from finding out.<br/><br/>What he mentioned was just a small wish.<br/><br/>As for revenge, even if he didn’t mention it, Gu Yang would do it. There was no need to unnecessarily remind him.<br/><br/>…<br/><br/>In fact, after Gu Yang broke through to the Celestial Being realm, he hadn’t met with Wu Er again.<br/><br/>Seeing him now, he noticed something amiss with Wu Er. His life force was even weaker than that of the dried corpse below the imperial palace and it could extinguish at any moment.<br/><br/>His original source was almost drained, like a living dead, purely supported by the power of his Original Spirit.<br/><br/>However, he was about to run out of strength.<br/><br/>Red Moon Great Saint!<br/><br/>Gu Yang knew that the one who made a move against Wu Er was the Red Moon Great Saint.<br/><br/>If the two were at the same level and Wu Er lost, it’s because his skills were inferior. But the Red Moon Great Saint bullied the weak, which was intolerable.<br/><br/>He figured out Wu Er’s mindset and asked, “Don’t you want to take revenge on your own? You were once Wu Shengtian, as famous as Qin Wu. None could withstand even three strokes of your ‘Nine Heavenly Questions’. So, are you content to fade away and let others avenge you?”<br/><br/>Gao Fan, who was beside him, understood the unspoken words. He suddenly turned to look at Wu Er, his expression mixied with surprise and sadness.<br/><br/>These two old guys had been hanging out together recently. They naturally felt sad when they suddenly heard about Wu Er’s terrible condition.<br/><br/>Wu Er glared at him and sighed, “Life and death are predestined. You brat, why must you point it out? Can’t you let me die in peace?”<br/><br/>Gu Yang said, “Although you are seriously injured, there is still a slim chance of survival. I’ll just ask you, do you want to live? Do you want to breakthrough to the Celestial Being realm to take revenge against the Red Moon Great Saint, Lord Chi Ming, and those who annihilated the Wu Family yourself?”<br/><br/>Wu Er was first taken aback, then his somewhat muddy eyes became sharp.<br/><br/>Who wouldn’t want that?<br/><br/>He was once acknowledged as a peerless genius, an equal to Qin Wu. He was proud and arrogant, and only respected a few in the world.<br/><br/>But after this great disaster, he became neither human nor ghost, and all his ambitions had long been worn away.<br/><br/>This was all fate.<br/><br/>If anyone else said these words, he wouldn’t care.<br/><br/>But the one who said this was Gu Yang. This kid repeatedly broke common sense and people’s understanding, doing things that were totally impossible.<br/><br/>He was an anomaly.<br/><br/>He said there was a glimmer of hope, maybe there really was a glimmer of hope.<br/><br/>In Wu Er’s throbbing heart, he finally regained some of his past vigor as Wu Shengtian.<br/><br/>He said solemnly, “I want to!”<br/><br/>“Good!”<br/><br/>Gu Yang took out a jade box from the Beast-taming Space, “This is a flat peach, a Heaven and Earth Spirit Root that grew in the Yao Chi Immortal Palace. Eating one can prolong one’s life by a thousand years, or allow a mortal to become an immortal instantly.”<br/><br/>A flat peach?<br/><br/>Both Wu Er and Gao Fan were shocked. They were born into high-ranking families, so they naturally knew what a flat peach was.<br/><br/>Gao Fan suddenly remembered something, “The five Celestial Beings were after this at first, right?”<br/><br/>Five Celestial Beings went all out chasing after this, even coming to siege Wen Yuan. This showed how valuable it was.<br/><br/>Gu Yang actually took it out for Wu Er.<br/><br/>“Yes, I got a flat peach at the Yaochi Conference back then. They wanted to snatch it from me. With this, your depleted original source can be replenished, and you can recover to your peak state.”<br/><br/>As Gu Yang spoke, he had already opened the box. A refreshing fragrance immediately filled the room.<br/><br/>However, a look of struggle and hesitation flashed in Wu Er’s eyes at this moment.<br/><br/>Without saying a word, he used his mana to pick up the flat peach and forcefully shoved it into Wu Er’s mouth.<br/><br/>PS: You might not believe this, but I forgot a place name yesterday. When I was skimming through the previous chapters to find it, I accidentally ended up reading all the chapters until noon…\t\t\t\t\t\t</div>", "images": {}, "success": true}