{"id": 432, "url": "https://www.novelhall.com/my-life-can-be-infinitely-simulated-32873/15258192.html", "title": "Chapter 432__End - Chapter 432: 432 Creation (Grand Finale)", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 432__End - Chapter 432: 432 Creation (Grand Finale)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 432: 432 Creation (Grand Finale)<br/><br/>As soon as the flat peach entered his mouth, Wu Er’s body immediately boomed, exploding with unmatched power. A large amount of pure Immortal Element even overflowed from his mouth and nose.<br/><br/>At this point, he had no choice but to force his mystical power to convert the immense medicinal strength.<br/><br/>His momentum continued to rise, in the blink of an eye, he had stepped into the Divine Power realm, Mana Realm, Unleaking Realm…<br/><br/>Gao Fan on the side watched, dumbstruck.<br/><br/>Such a small flat peach actually contained such terrifying Immortal Element, able to revive a person on the brink of death and restore them to their peak state in an instant.<br/><br/>But that was not all.<br/><br/>After a short while, the Way of Heaven began to manifest around Wu Er.<br/><br/>This meant that Wu Er was about to step into the Celestial Being realm.<br/><br/>Indeed, it was the legendary Divine Item from ancient times, one bite could turn a person into an Immortal.<br/><br/>The commotion here, once again attracted attention from the entire academy. The students of the academy came running, wanting to see who in the academy had broken through to the Celestial Being realm.<br/><br/>When they saw it was an unfamiliar old man, they began to discuss amongst themselves.<br/><br/>In the academy, the only people who knew Wu Er and Gao Fan’s identities were a few professors.<br/><br/>The entire breakthrough process lasted a day.<br/><br/>When Wu Er opened his eyes, his face still held an incredible expression.<br/><br/>A day ago, he felt his days were numbered, but a single flat peach pulled him back from the brink of death and even shot him straight into the Celestial Being realm, extending his lifespan by a millennium.<br/><br/>He looked at Gu Yang, his lips moving slightly.<br/><br/>Gu Yang barely smiled, “The last six strokes of the ‘Heavenly Questioning Nine Blades’, you create them yourself.”<br/><br/>Saying this, he took out another jade box, threw it to Gao Fan and said, “Senior Gao, this is for you.”<br/><br/>Gao Fan was still reminiscing on the aftermath of the Way of Heaven, he subconsciously took it, seeing that this jade box was exactly the same as the one that contained the flat peach, his heart moved, “This is…?”<br/><br/>Gu Yang said, “Both of you seniors have given me a lot of help on this journey. I can only repay you with this small token. I have matters to attend to, so I must leave now.”<br/><br/>Saying that, before they could say anything, he disappeared from the spot.<br/><br/>Gao Fan opened the jade box and saw that it contained a flat peach. He murmured, “This rotten boy…”<br/><br/>Wu Er’s feelings were incredibly mixed. He did not expect that passing the ‘Heavenly Questioning Nine Blades’ to this young man would bring such immense fortune…<br/><br/>…<br/><br/>……<br/><br/>For Great Zhou, and even for the Divine State continent, this was quite the historic event.<br/><br/>Afterwards, whether it was the Divine State continent or the other continents overseas, powerful ones in Celestial Being realm appeared like bamboo shoots after rain.<br/><br/>Those old monsters who were trapped in the Unleaking Realm found the opportunity to break through one after another.<br/><br/>There were also some young ones in Divine Power realm whose cultivation levels were rapidly improving.<br/><br/>The human world seemed to return to the age of ancient myths, with Celestial Beings emerging one after another.<br/><br/>Two years later, the second Hollow Void realm appeared in Great Zhou, surprisingly it was Luo Wang of Zhao Family.<br/><br/>Another two years passed and the first individual broke through to the law realm, it was none other than the academy’s dean who had been accumulating power.<br/><br/>Outstanding talents emerged from various states, all making their mark for years.<br/><br/>During this time of rapid development, Gu Yang no longer appeared before the people and gradually he was forgotten.<br/><br/>What people were talking about was which state saw another powerful Celestial Being, a Hollow Void force.<br/><br/>When will the second law realm individual appear?<br/><br/>Then, in Great Zhou, some unfamiliar immortals began to appear. However, it did not have a significant impact on the lives of ordinary people.<br/><br/>…<br/><br/>Time passed, and ten years went by in a flash.<br/><br/>The dean of the academy finally completed his accumulation and became an Earth Immortal.<br/><br/>From the sky, that bloody mark became even more noticeable, as if blood was seeping out from within.<br/><br/>On this day, in front of the academy, countless powerful figures gathered.<br/><br/>While it was said to be a celebration of the academy dean’s achievement of being an Earth Immortal, the actual reason was to discuss how to handle the great calamity.<br/><br/>Among those who arrived were human immortals from the Divine State, Luo Wang, Su Ningyan, Wu Er, Gao Fan, and representatives from all ranks, even the members of the Sword Palace.<br/><br/>All of them knew that a great disaster was imminent, but no one knew what kind of calamity they would face, leading to a lack of actionable plans.<br/><br/>None among them had experienced the ancient catastrophe. The scarce and fragmented information from the books was hardly sufficient to deduce what the catastrophe might entail.<br/><br/>“They have arrived!”<br/><br/>Suddenly, the dean raised his head sharply, looking towards the bloodstain in the sky. A faint radiance could be seen emanating from it.<br/><br/>Just sighting this faint glow gave him a sense of instability in his original spirit, as if his realm was about to falter.<br/><br/>He sighed internally, albeit prepared for what was to come.<br/><br/>In the past decade, he had combed through all kinds of scriptures and befriended a few Celestial Immortals from the ancient times. Even these Celestial Immortals had no confidence in facing the imminent catastrophe.<br/><br/>Let alone the current assembly of people, except for his Earth Immortal cultivation level, the rest were merely Human Immortals.<br/><br/>All of them combined were nowhere near a single Celestial Immortal.<br/><br/>What could they possibly do in the face of such a disaster?<br/><br/>There was nothing left but to await death.<br/><br/>The dean knew that his time was near, yet, he was at peace. He had done all that he could.<br/><br/>Suddenly, he thought of someone.<br/><br/>I wonder where that lad is?<br/><br/>Over the years, that lad had not appeared before them again.<br/><br/>Every year, there would be several significant celestial changes in the Human Realm, unknowingly triggered by whom. Perhaps Gu Yang might have had a hand in it?<br/><br/>I wonder what his cultivation level is now.<br/><br/>He must be at least a Celestial Immortal.<br/><br/>I hope he can survive this catastrophe, this would mean preserving something for the Great Zhou…<br/><br/>While he was lost in thought, a figure appeared in the sky. It was Gu Yang!<br/><br/>Compared to ten years ago, he looked the same. However, the dean was unable to discern his cultivation level. Gu Yang stood there, but his presence could not be sensed in the slightest.<br/><br/>Was he like a phantasm?<br/><br/>A Golden Immortal?<br/><br/>The dean was both shocked and overjoyed.<br/><br/>Over the past decade, there had been several celestial changes affecting the entire Human Realm. Each upheaval seemed to revive the Way of Heaven further.<br/><br/>The current Way of Heaven, although not as strong as in ancient times, it wasn’t far off. It was enough to accommodate the power of a Golden Immortal, and even that which is beyond.<br/><br/>Given how Gu Yang had performed all along, him becoming a Golden Immortal wasn’t beyond imagination.<br/><br/>However, even a Golden Immortal was helpless in the face of such a disaster. During the time of the ancients, numerous Golden Immortals had perished in the two great calamities.<br/><br/>Before the dean could react, Gu Yang in the sky spoke up towards a certain direction, “Senior, please reveal yourself and lend me a hand.”<br/><br/>A black light flickered, and a figure appeared next to Gu Yang. The man was dressed in white, three books revolving in front of him.<br/><br/>“The master of the Red Mansion?”<br/><br/>The dean recognized him instantly. This man was the incredibly mysterious master of the Red Mansion whose depth even he could not fathom.<br/><br/>Gu Yang said, “If I’m not wrong, these three, should be the Books of Heaven, Earth, and Human. My senior, are you the Lord of the Netherworld, known as the Nether Emperor?”<br/><br/>What?<br/><br/>The dean was taken aback.<br/><br/>The Lord of the Netherworld was one of the most powerful entities from ancient times, who even defeated the Human Emperor.<br/><br/>The Master of the Red Mansion, was indeed an unimaginably terrifying power?<br/><br/>…<br/><br/>The man in white said, “Just the two of us, isn’t enough.”<br/><br/>Gu Yang then looked towards the palace, “I respectfully request another senior to make his appearance.”<br/><br/>A hoarse voice rang out, “This helpless man, I’m afraid, cannot be of much assistance.”<br/><br/>Immediately, another figure appeared next to him. An elderly man with a sorrowful countenance. It was the mummy hiding beneath the Imperial Palace.<br/><br/>Gu Yang took out an item and tossed it over, saying, “Today, the Sword of the Human Emperor returns to its rightful owner.”<br/><br/>The Sword of the Human Emperor flew before the elder and was gripped by him. Instantly, his demeanor completely transformed, emanating an aura of disdainful condescension towards the world.<br/><br/>…<br/><br/>The Sword of the Human Emperor?<br/><br/>Returning to its original owner?<br/><br/>A sense of alarm surged in the dean’s heart. Could it be that this person is the Human Emperor from ancient times?<br/><br/>After the Gold Emperor, the lineage of the Human Emperor was maintained for many generations, until eight thousand years ago. After the last Human Emperor, the Sword of the Human Emperor shattered, and no Human Emperors had appeared since.<br/><br/>The Xia Emperor attempted to become the Human Emperor a thousand years ago, but ultimately, he failed.<br/><br/>Unexpectedly, the Human Emperor who lived through the grand calamity eight thousand years ago, during which the Sword of the Human Emperor shattered, is still alive today.<br/><br/>The last Human Emperor, one of exceptional innate talent, possessed cultivation at the Da Luo level.<br/><br/>Who would have thought that two such formidable ancient powerhouses were hidden within the Divine City?<br/><br/>…<br/><br/>Gu Yang spoke for the third time, “I request the Senior to reveal himself.”<br/><br/>Suddenly, a fissure appeared in the sky, and a gigantic Immortal Palace squeezed itself out.<br/><br/>Upon seeing this, the dean recognized it as the ancient Heavenly Court and could not help but swallow hard.<br/><br/>With Gu Yang’s repeated murmurs of “please reveal yourself, Senior…”<br/><br/>Continuous new figures began to appear, including the three most renowned ancient heavenly palaces in addition to the Heavenly Court – Yao Chi Immortal Palace, Guanghan Immortal Palace, and Taiyi Immortal Palace.<br/><br/>There were also some that he couldn’t identify, but how could those who could stand alongside the Nether Emperor and the ancient Human Emperor be ordinary Golden Immortals?<br/><br/>These famous powerhouses from the ancient times had all appeared simultaneously.<br/><br/>Suddenly, a glimmer of hope rose within his heart. With these ancient powerhouses present, perhaps they could weather this grand calamity.<br/><br/>…<br/><br/>Eventually, Gu Yang summoned all the ancient powerhouses he knew.<br/><br/>For the past ten years, he had been far from idle; apart from cultivating, he had been searching for ancient powerhouses.<br/><br/>After achieving the Golden Immortal status, he sought them out one by one.<br/><br/>The first was the master of the Red Mansion, followed by the mummy beneath the imperial palace, and then the Yao Chi Immortal Palace, the Guanghan Immortal Palace, and the Ruiqin Continent…<br/><br/>The Beast God Temple on Yaorui Continent turned out to be the ancient Taiyi Immortal Palace.<br/><br/>He even ventured into the deepest parts of space, forcing the hidden powerhouses to emerge one by one.<br/><br/>It must be acknowledged, there were indeed many survivors among the ancient powerhouses.<br/><br/>Not one of the Five Emperors from the ancient times was missing. The Black Emperor was none other than the mysterious old man who once stole the flat peach from the Yao Chi Immortal Palace.<br/><br/>There was also the Azure Emperor, the White Emperor, the Red Emperor, and along with the Nether Emperor, these five existences closest to the Primordial Chaos, had all gathered.<br/><br/>Altogether, Gu Yang summoned more than a dozen Da Luo and another dozen of Golden Immortals.<br/><br/>It was a pity that there was not a single Primordial Chaos amongst them.<br/><br/>The Black Emperor began to speak, “Boy, you should know, as old fellows like us face this grand calamity, we’re absolutely powerless. This is simply waiting for death.”<br/><br/>The ancient powerhouses present, whether indebted to Gu Yang or coerced by him to be here, shared the same sentiment as the Black Emperor.<br/><br/>Those who hadn’t experienced the previous two calamities couldn’t imagine how terrifying they were.<br/><br/>At this time, the glowing dot in the bloodstain had already flown out and was heading towards them.<br/><br/>The end, was imminent.<br/><br/>Gu Yang smiled faintly, “If you can’t do it, there’s still me!”<br/><br/>As he spoke, he waved his hand, and the glowing dot seemed to solidify and astonishingly, it no longer fell.<br/><br/>The Black Emperor’s complexion drastically changed, “The Dao of Time? Creation?”<br/><br/>Upon hearing this, everyone on scene looked at the young man, not much older than a few decades, with an incredulous gaze.<br/><br/>No one could imagine that this young man in his thirties might have actually achieved the state of Creation.<br/><br/>What is Creation?<br/><br/>The path of cultivation includes the Mortal Realm, the Divine Power realm, the Human Immortal, the Earth Immortal, the Celestial Immortal, the Golden Immortal. Above Golden Immortal, there is Creation.<br/><br/>Throughout history, only one entity in the three realms has ever achieved Creation, and that was the lord of the Heavenly Court, the former Gold Emperor.<br/><br/>And it was this breakthrough by the Gold Emperor that brought about the grand calamity to the three realms.<br/><br/>Now, another creation has emerged.<br/><br/>This has brought them great shock.<br/><br/>The Gold Emperor took hundreds of thousands of years to achieve Creation.<br/><br/>What about Gu Yang? He’s only had a few dozen years.<br/><br/>This is too terrifying.<br/><br/>The fact that he could achieve the Golden Immortal status in such a short time was already beyond imagination.<br/><br/>Who would have thought that he had surpassed everyone and stepped into the realm of Creation?<br/><br/>How did he do it?<br/><br/>…<br/><br/>As for the dean and the rest, upon hearing that Gu Yang had achieved Creation, they weren’t as shocked due to the distance, lacking a sense of realism.<br/><br/>Anyway, no matter what realm Gu Yang breaks through to, it wouldn’t be surprising.<br/><br/>…<br/><br/>Gu Yang revealed a trick, silencing everyone, and said, “Today, I will take you to the Heavenly World.”<br/><br/>Saying so, everyone felt the world spin around them. Together with the glowing dot in the sky, they found themselves in a strange world.<br/><br/>This place was one of the three greatest heavenly worlds discovered in the past, where the Gold Emperor broke through to the state of Creation. It was also the source of the grand calamity of the three realms.<br/><br/>Over the past ten years, Gu Yang had traveled the Thirty-three Heavens, even venturing into the Netherworld. Relying on the Simulator, he made breakthroughs step by step, finally achieving the state of Creation.<br/><br/>Since reaching the Golden Immortal realm, he had primarily been lingering in the three great heavenly worlds.<br/><br/>This place was a world even more vast, as vast as a universe, with infinite space and countless powerful beings.<br/><br/>Back then, when the Gold Emperor broke through to Creation here, the commotion was too great and attracted the attack of another great power of Creation.<br/><br/>With a single blow across the void, the other entity killed the Gold Emperor, and to eliminate the threat, the adversary made another cross-void attack, destroying the Way of Heaven of this world with the Dao of Ultimate Magic.<br/><br/>With the collapse of the Way of Heaven, the foundation of this world was destroyed. It would be impossible to naturally recover without hundreds of thousands of years.<br/><br/>Unexpectedly, it encountered an anomaly like Gu Yang.<br/><br/>Within less than ten thousand years, he had restored the Way of Heaven to its original state.<br/><br/>He even broke through to the realm of Creation and could now confront the entity that caused all this.<br/><br/>In the simulation, he had suffered a lot under the hands of that entity.<br/><br/>Now, it was naturally time for vendetta.<br/><br/>However, he alone was not enough, being solitary and weak. So, he brought along these struggling surviving ancient powerhouses.<br/><br/>The fight between Creations was not a matter that could be decided in a short amount of time. It was a contest of who had more subordinates and greater power.<br/><br/>Entering the fray personally was utterly inelegant. Without absolute assurance, they would not easily take action.<br/><br/>This was a war that would drag on indefinitely.<br/><br/>The longer this dragged on, the more advantageous it was for Gu Yang.<br/><br/>After reaching the state of Creation, Gu Yang completely mastered the Simulator, which in fact was one of the supreme Ways of Heaven — the Dao of Time.<br/><br/>Perhaps, this was the legacy left behind by the Gold Emperor.<br/><br/>No matter what, since he had received this world’s gift, he had to make some contributions in return. This was settling karma.<br/><br/>Gu Yang said to everyone, “This is the Heavenly World. From now on, what we have to face are even stronger enemies. Calamities like that, I will take on. But if we come across other Da Luo, or even Primordial Chaos, it will be up to you.”<br/><br/>“Yes!”<br/><br/>Everyone present was completely won over!<br/><br/>——<br/><br/>End of the book!\t\t\t\t\t\t</div>", "images": {}, "success": true}