{"id": 6, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14099717.html", "title": "Chapter 6 - Chapter 6 – Chapter 6: Female Cow’S Difficult Birth, Space Fluctuation", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 6 - Chapter 6 – Chapter 6: Female Cow’S Difficult Birth, Space Fluctuation</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 6 – Chapter 6: Female cow’s difficult birth, space fluctuation<br/><br/>Time unknowingly lied flat and passed by three months.<br/><br/>At three months, Jinli had already proficiently started to turn over.<br/><br/>At this time, she looks so good, white and plump and tender, with a pair of black grape-like eyes that turn round and round, laughing like a crescent moon. She’s so cute that you can’t help but take a big bite.<br/><br/>What made the villagers more amused and fond of her was that she even recognized people at such a young age.<br/><br/>If someone is unhygienic and dirty, she would wrinkle her little face and show her dislike, and she wouldn’t let them hold her.<br/><br/>For those who are hygienic and clean, she would show a little smile, and it’s okay if they want to hug her.<br/><br/>Over time, everyone in the village knew that Jinli was a clean and hygienic baby.<br/><br/>“Haha, I’ve never seen such a smart and clean little baby.”<br/><br/>“In her first month, she could already recognize people. Now at three months, she actually chooses her favorites. Xiaofang, your daughter is so smart.”<br/><br/>After lunch, a group of villagers came to Xiao Wanshan’s yard to see Jinli, praise her, and tease her.<br/><br/>Adorable and cute like a doll, Jinli has become a must-praise for the villagers when they visit.<br/><br/>“When I came, Xiao Changsheng’s female cow was about to give birth. I wonder if it has been born by now?” said a villager.<br/><br/>“I heard it started in the morning, and by now it should have given birth.”<br/><br/>“That cow in his family gives birth to a calf every year, haha, it’s quite a good income.”<br/><br/>At this moment, there are a bunch of people crowded around Xiao Changsheng’s cattle pen.<br/><br/>A robust female cow keeps pacing back and forth, constantly kicking and throwing dirt with her front hooves, and mooing loudly, clearly in pain.<br/><br/>An experienced villager looks at the situation, and his eyebrows furrow a little, expressing a slightly bad feeling, “Changsheng, it’s been so long and it still hasn’t given birth, could it be a difficult birth?”<br/><br/>As soon as Xiao Xianchun’s words fell, Xiao Changsheng’s eyebrows were tightly twisted together.<br/><br/>A villager immediately said, “It seems like a difficult birth. Changsheng, why don’t you quickly go to town to find a veterinarian?”<br/><br/>Xiao Changsheng’s wife, seeing the cow’s suffering and its inability to give birth, also worriedly said, “Old man, hurry up and go to town to find a veterinarian.”<br/><br/>Xiao Changsheng didn’t hesitate, got on his motorcycle, and left.<br/><br/>After he left, the villagers still talked.<br/><br/>“Changsheng’s cow has given birth before. It’s been a while, and it’s probably a difficult birth.”<br/><br/>Women can have B-ultrasound scans at the hospital before giving birth. If the fetal position is abnormal, a cesarean section can be performed.<br/><br/>But the female cow doesn’t have these options when giving birth to a calf.<br/><br/>If it really is a difficult birth, people can only rely on their own strength to pull the calf out of the cow’s stomach, which is cruel and somewhat painful, but it’s the only way and relatively safe.<br/><br/>However, this also requires professionals, otherwise, both the mother cow and calf are at great risk.<br/><br/>Xiao Changsheng’s wife watched the cow pacing back and forth restlessly, showing a worried and anxious expression on her face.<br/><br/>Their family has been raising this old cow for almost ten years, and it has given birth to six calves without any trouble before. However, this time…<br/><br/>Xiao Changsheng rode by Xiao Wanshan’s house on his motorcycle, leaving the villagers somewhat puzzled.<br/><br/>“Why is Changsheng in such a hurry? Has the calf in his house been born?”<br/><br/>“When I came, I went to have a look and they said the cow seemed to be having difficulty giving birth. Has it still not given birth after all this time, so Changsheng is going to town to find a veterinarian?”<br/><br/>“That’s very likely!”<br/><br/>“They’ve been raising that cow for over ten years; they’ve formed a bond with it. This difficult birth must be making them anxious.”<br/><br/>“Let me go take a look!”<br/><br/>“I’ll go too!”<br/><br/>“Jinli, Auntie will come to see you again soon!”<br/><br/>After saying that, she pinched Jinli’s pink cheeks.<br/><br/>Jinli waved her small arms in protest, rejecting the pinching of her little cheeks.<br/><br/>Her cheeks were pink and tender, but being pinched often was painful.<br/><br/>After most of the villagers left, Xiao Jinli and Xiao’s mother were left in the yard.<br/><br/>Watching a female cow giving birth is not suitable for Jinli. So Xiao’s mother wouldn’t bring her along.<br/><br/>In addition, there would be some flies and mosquitoes there, and getting bitten by them wouldn’t be good.<br/><br/>Soon after the villagers left, Xiao’s mother put Jinli on the small bed to lie down for a while, so she could tidy up the yard.<br/><br/>Who would have thought that the usually obedient and quiet Jinli seemed a little reluctant this time.<br/><br/>A person lay on the small bed, kicking their little feet in the air as they cried, “Ah, ah, oh, oh,” clearly not wanting to lie there.<br/><br/>Xiao’s mother had no choice but to put down her work, wash her hands, and pick up Jinli from the bed.<br/><br/>“Little Bao, what’s wrong? Are you unhappy?”<br/><br/>Jinli babbled and waved her little hands towards the door.<br/><br/>Xiao’s mother frowned slightly and asked, “Do you want to go and watch the cows giving birth too?”<br/><br/>Jinli uttered a few yelps, seemingly agreeing with her mother’s words.<br/><br/>However, Xiao’s mother shook her head in disagreement, “Little Li, be good. Let’s not go, okay? There are flies and mosquitoes there, and they’ll bite you.”<br/><br/>As soon as Xiao’s mother finished speaking, Jinli suddenly blurted out a sentence.<br/><br/>“Mother, I want to go!”<br/><br/>After all, she wasn’t a real baby. In the three months she had been here, she had already learned the local language.<br/><br/>But she was too young to speak casually.<br/><br/>She now demanded to go and watch the cows giving birth because she sensed fluctuations in the space.<br/><br/>She felt that to unlock the space, perhaps this was an opportunity.<br/><br/>Xiao’s mother was shocked by Jinli’s sudden sentence.<br/><br/>Her expression first froze, then she was overwhelmed with joy. “Little Bao, is that you calling mommy? You can call mom? You can talk? Can you call mommy again, please?”<br/><br/>She knew that her daughter was very smart, but she never expected her daughter to be so smart that she could already speak at three months old.<br/><br/>It was both surprising and delightful.<br/><br/>“Mother!”<br/><br/>Jinli called again, clearly and fluently.<br/><br/>Jinli secretly breathed a sigh of relief.<br/><br/>It was so suffocating.<br/><br/>She could speak but had to pretend she couldn’t.<br/><br/>She had pretended to be gentle and well-behaved for more than a month during her confinement period. Then, every day, Xiao Father would hold her in his arms, and his beard would poke her tender little face, causing her great pain. Helpless, she could only wave her limbs and cry out loud in protest.<br/><br/>As soon as Jinli cried, Xiao’s mother and older brother would start condemning Xiao Father, and then she would enjoy watching the drama unfold on the side.<br/><br/>The family atmosphere was really good.<br/><br/>For the next two months, she followed the normal development of a baby. Well, her development was even better than most children.<br/><br/>She could laugh, recognize people, and express her likes and dislikes through facial expressions and actions. So she felt happy performing, but also very tired.<br/><br/>Now, with this shout, it felt like opening a floodgate, allowing her to relax at once.<br/><br/>Xiao’s mother, holding Jinli with red eyes and an expression that was surprised, excited, and delighted, said, “Hehe, our Little Bao is really a smart child. She can talk at three months old and does so fluently. Little Bao, you’re amazing!”<br/><br/>Generally, infants would start talking at eight or nine months old, and even then, they might only say a few simple sentences.<br/><br/>Jinli’s little hands wiped away Xiao’s mother’s tears, and she smiled innocently, saying, “Mom, didn’t you say I’m smart? So it’s not strange that I can talk.”<br/><br/>Hearing Jinli’s words, Xiao’s mother said with mixed laughter and tears, “You little girl, it’s not strange? A three-month-old baby that can talk is so shocking, okay?”<br/><br/>Jinli tilted her little head, her expression slightly urgent, and said, “Mother, let’s go see the cows giving birth to calves?”<br/><br/>“…” Xiao’s mother frowned and said, “Little Bao, the cow’s birthplace has flies and mosquitoes, and the scene is bloody. It’s not suitable for you. Let’s not go, okay?”<br/><br/>But the usually obedient child became stubborn on this matter.<br/><br/>Jinli shook her head firmly and said, “I want to go!”<br/><br/>Left with no choice, Xiao’s mother had to clean up Jinli and take her to see the cow giving birth. When they arrived at Xiao Changsheng’s cowshed, the villagers were somewhat surprised.<br/><br/>“Xiaofang, why did you bring the child here? This place is dirty, and there are many flies and mosquitoes.”<br/><br/>“Yeah, Xiaofang, hurry up and take the child back.”<br/><br/>Xiao’s mother smiled helplessly and said, “Little Bao wanted to come. I couldn’t resist, so I brought her.”<br/><br/>“Oh, Jinli wanted to come?” The villagers asked in astonishment, “Why would a child want to be here?”<br/><br/>“Jinli is really smart. She can express her wishes at such a young age. But Xiaofang, how did Jinli express that she wanted to come here?”<br/><br/>Xiao’s mother, “…”\t\t\t\t\t\t</div>", "images": {}, "success": true}