{"id": 2, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14099705.html", "title": "Chapter 2 - Chapter 2 – Chapter 2: Tear Off Their Ugly Faces", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 2 - Chapter 2 – Chapter 2: Tear Off Their Ugly Faces</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 2 – Chapter 2: Tear Off Their Ugly Faces<br/><br/>“Clang!”<br/><br/>A door being kicked open reverberated throughout the room.<br/><br/>Xiao Sese and Cui Tianhao were wondering who would be audacious enough to disturb guests this way in a seven-star hotel.<br/><br/>Determined to reprimand them, they froze as soon as they saw the person at the door. Unbelief filled their eyes.<br/><br/>Why…why would she be here?<br/><br/>Shouldn’t she be at the global alliance awards ceremony right now?<br/><br/>Before they could react, they heard a cold voice,<br/><br/>“I’m sorry, but it seems you won’t be getting all of my inheritance after all.”<br/><br/>“Even if I have to feed chickens or dogs, I won’t waste another morsel on you two, you unworthy man and woman, you ungrateful wolves!”<br/><br/>The color drained from the guilty couple’s faces, leaving a deathly pallor!<br/><br/>What did this mean?<br/><br/>It means, Xiao Wushuang had overheard their conversation.<br/><br/>At this moment, the adulterous couple was still naked, cuddling together, and failed to react to Xiao Wushuang’s sudden appearance.<br/><br/>Xiao Wushuang looked at their faces and sneered, “What’s the matter, surprised to see me here?”<br/><br/>“If I weren’t here, I might never have known how I was going to die. So it turns out, my sister whom I’ve treated wholeheartedly, and my considerate boyfriend, are both fervently wishing for my death?”<br/><br/>The expressions on Xiao Sese and Cui Tianhao’s faces became even more shocked. A look of guilt and fear emerged in their eyes, making their hearts tremble.<br/><br/>Everyone in the world knew that Xiao Wushuang was unparalleled in beauty, her medical skills were outstanding, and her martial arts extraordinary. Moreover, she was a ruthless and merciless woman.<br/><br/>Once, someone tried to assassinate her, but she killed them instead, and then had their body sliced into thousands of pieces to feed dogs as a warning to those who wanted to kill her.<br/><br/>Simply showing she could kill with ease.<br/><br/>Xiao Sese tried to suppress her fear, nervously and guiltily asking, “Sis, why…why are you here? Shouldn’t you be…receiving an award right now?”<br/><br/>An award of such importance to anyone, how could she just leave?<br/><br/>“Oh, well, I was on my way to the award ceremony. But then I heard that my dear sister had twisted her ankle and couldn’t attend my award ceremony. As her caring sister, I rushed over to see how she was doing without even waiting to receive the award. What was not expected was to see a pair of adulterers in an affair.”<br/><br/>Xiao Sese’s face alternated between red and white.<br/><br/>Cui Tianhao, however, yelled angrily, “Xiao Wushuang, we are not adulterous dogs. Sese and I are in love. It was you who stepped in and stole me from her. Fine, now that you know, let’s break up. But the compensation for my lost youth spent with you is 5 billion, pay me!”<br/><br/>He had a thick face.<br/><br/>Since Xiao Wushuang had overheard his conversation with Xiao Sese, given her intolerance for any shortcomings, a breakup with him was inevitable.<br/><br/>But how could he stand to just break up like this?<br/><br/>“Stole you away? Huh, wasn’t it you who pursued me? 5 billion, Cui Tianhao, are you joking with me? Is your shabby self worth 5 billion?” Xiao Wushuang mocked, “Not to mention 5 billion, even 50 Yuan, I would be reluctant to give you.”<br/><br/>Having said that, she stepped forward, sharply gripped his chin and taunted, “Cui Tianhao, you betrayed me, Xiao Wushuang, and you still want to profit from me. You must be daydreaming in broad daylight!”<br/><br/>After that, as if touching Cui Tianhao had soiled her hand, she quickly let go.<br/><br/>Listening to Xiao Wushuang’s ridicule, a furious Cui Tianhao vented all his resentment,<br/><br/>“Xiao Wushuang, you bitch, who are you to look down on me? On paper, I’m your boyfriend, but in reality, I’m your nanny, taking care of your daily needs. Only under your stingy charity can I live in a mansion, drive luxury cars, and enjoy a rich life.<br/><br/>Do you know how many people mock me behind my back? They call me a cowered man depending on a woman for a living. Do you have any idea, how this label is a naked insult to me? I am a man, why should I be insulted like this!”<br/><br/>Xiao Wushuang hearing his resentment, laughed instead of getting mad and said, “Oh, a nanny, a man who depends on a woman for a living? If you think this is humiliating for you, then you totally can break up with me, couldn’t you? Nobody is tying you up here, or holding a knife to your throat forcing you!<br/><br/>Move aside, go and fly off with your true love.<br/><br/>There are plenty of men more than willing to take your position, serve me wholeheartedly, and be my dedicated nanny. Oh, and here you are, enjoying the affluence I have given you on the one hand, while brimming with resentment and wishing me dead on the other. I have never seen someone as despicable as you, playing the whore while wanting to establish a monument to chastity, aren’t you dreaming nicely!”<br/><br/>Her heart sank, she had thought she had found a man who didn’t care about status and wealth and was attentive. Who would have thought, this man’s heart could be so dark, being her boyfriend was an insult to him.<br/><br/>The insult from Xiao Wushuang made Cui Tianhao’s face turn ashen, but he didn’t know how to retaliate.<br/><br/>Indeed, as she said, there are so many people eager to be her boyfriend. If he moves the slightest, hungry wolves would immediately leap at the opportunity, pushing him off this position.<br/><br/>To ask him to give up this position, he simply wouldn’t do it.<br/><br/>Because his talent in medicine, technology, and martial arts is average. With his own efforts, he could probably only afford a toilet in the imperial capital in his lifetime.<br/><br/>He wanted to enjoy the life of luxury, to live in mansions, drive luxury cars, and have servants and bodyguards at his beck and call.<br/><br/>Xiao Wushuang could exactly provide him with this life.<br/><br/>Yet, a man serving a woman in exchange for such a life was a blow to his masculine pride.<br/><br/>Under such a conflicting mentality, his resentment deepened every day.<br/><br/>“And you, my dear sister.” Xiao Wushuang turned her head again, staring coldly at Xiao Sese lying on the bed, “Since you and this unworthy man are in love, why didn’t you tell me earlier? If you had, I would have directly given him to you. Why make you two go through all the trouble of secret trysts under my nose? You are my sister whom I’ve cherished for so long, not to mention a smelly man, even if you wanted hundreds, thousands of men, I, your sister, would go out and find them for you, wouldn’t I?”<br/><br/>While Cui Tianhao’s face turned green, Xiao Sese trembled all over in fear.\t\t\t\t\t\t</div>", "images": {}, "success": true}