{"id": 1, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14099702.html", "title": "Chapter 1 - Chapter 1 – Chapter 1: Double Betrayal", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 1 - Chapter 1 – Chapter 1: Double Betrayal</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 1 – Chapter 1: Double Betrayal<br/><br/>Due to the harsh changes in the environment of the Living Planet, it changed the human pursuit of life, making the development of human careers gradually shift towards medicine, technology, and martial arts, the three most sought-after professions.<br/><br/>By the 25th century, anyone who makes significant achievements in these three fields is worshipped by millions of people.<br/><br/>During this time, there is a genius among geniuses, who achieved great success in all three fields, and she became a goddess in the eyes of millions of people.<br/><br/>Her name is Xiao Wushuang!<br/><br/>…<br/><br/>Xiao Wushuang received news that her sister was hurt. She hurriedly rushed to the hotel from the Global Alliance Technology Outstanding Contribution Award ceremony.<br/><br/>She found the room number, and when she was about to press the doorbell, she heard an unusual sound from inside the room.<br/><br/>“Brother Hao!”<br/><br/>Soon after, a man’s voice followed.<br/><br/>Then there were bursts of sounds transmitted intermittently.<br/><br/>Even though she had never eaten pork, she had seen pigs run.<br/><br/>Xiao Wushuang widened her eyes in shock and disbelief.<br/><br/>She just stood there in a daze at the door, not knocking.<br/><br/>It was unknown how long it had been, but the sounds of movement inside gradually stopped.<br/><br/>“Brother-in-law, today is my sister’s Global Alliance Outstanding Contribution Award ceremony, is it okay if you don’t attend? You know, on such an extremely joyful day, she must want you to be with her to share and celebrate.”<br/><br/>“Baby, call me Brother Hao. I don’t like it when you call me brother-in-law! This name makes me sick!”<br/><br/>The man’s voice was incredibly familiar.<br/><br/>Because the owner of that voice had been with her for ten years.<br/><br/>“Hehe… sister… Brother Hao, do you know that my sister planned to give you a surprise at today’s award ceremony? She personally designed an Ice Snow Diamond Ring and was going to propose to you today.”<br/><br/>Xiao Sese showed a slightly smug expression, then quickly revealed a sad face and said, “Brother Hao, after today, you will really become my brother-in-law.”<br/><br/>“Silly girl, even if I become your brother-in-law, we can still be together, right?” Cui Tianhao tapped her delicate nose and said with a smile, “Didn’t we agree on that already?”<br/><br/>Xiao Sese looked a bit unhappy and wronged, “Oh, so you just treat me as a secret mistress, right? Hmph, I get it. I’m not as capable as Xiao Wushuang, nor am I as pretty as her, so you despise me. I met you first, but how come I became the third wheel?”<br/><br/>“Aiya, baby, where did you get that idea?” Cui Tianhao immediately coaxed, “We still need to deceive her, right? Once we have all her property in our hands, she can disappear from this world, and we can be together openly then.”<br/><br/>Saying this, he paused for a brief moment, hesitating, “Baby girl, Xiao Wushuang is your sister, you won’t be heartless, right?”<br/><br/>Xiao Sese sneered coldly, hatred and mockery filled her eyes, “Sister? She’s not my sister, she’s my sworn enemy. It’s an enmity for my mother’s death! I’ve endured it for twenty years, just waiting for the day when I can take revenge on her.”<br/><br/>In fact, what angered and made her most jealous was that Xiao Wushuang was always better than her, more capable, more beautiful, and even because of this great sister, she was able to enjoy the good life.<br/><br/>Jealousy twisted her heart, causing her to fall further into darkness, as though a prison held her, leaving her suffocating, suffering, and feeling despair.<br/><br/>She believed that only when Xiao Wushuang was gone from this world would she be saved.<br/><br/>Outside, Xiao Wushuang was incredibly shocked for a moment, but soon calmed down after that.<br/><br/>She never would have thought that her boyfriend was already in a relationship with her best friend.<br/><br/>Oh, maybe they were together even before she met him.<br/><br/>Even her acquaintance with Cui Tianhao was probably designed by her so-called best friend.<br/><br/>They were together, just wanting her dead.<br/><br/>Thinking of this, a cold smile and self-mockery appeared on Xiao Wushuang’s beautiful face.<br/><br/>She never imagined that her best friend, whom she treated with all her heart, would want her dead.<br/><br/>She thought she had never wronged this sister.<br/><br/>Whatever her sister requested, she would satisfy it. Even if her sister asked for stars in the sky, she would work hard to create a spaceship.<br/><br/>Now, well, well…, it seems she has indeed raised a white-eyed wolf.<br/><br/>Xiao Wushuang didn’t knock, she continued to listen to the movements inside.<br/><br/>Xiao Sese said, “Brother Hao, my sister is skilled in medicine and martial arts. She is always surrounded by bodyguards, we can’t get to her at all.”<br/><br/>But Cui Tianhao confidently laughed and said, “I found an Old Divine Doctor and got a divine medicine from him at a high price.”<br/><br/>“You’re planning to drug her?” Xiao Sese was slightly surprised, “But Brother Hao, Xiao Wushuang is a genius in the medical field; she is a recognized Divine Doctor. If you directly drug her, she would undoubtedly discover it.”<br/><br/>“Baby girl, this is why I told you I need to marry her,” Cui Tianhao said with some smugness, “This medicine is colorless and tasteless; it’s only effective for women, not for men. As long as I bury it in her body during our intimate moments, even a healer cannot heal herself, and she won’t discover any issues. This medicine can make her die suddenly without anyone noticing. Everyone will believe that she died from overworking.”<br/><br/>Upon hearing Cui Tian’s explanation, Xiao Sese’s eyes lit up, and the excitement and joy in her eyes could no longer be hidden.<br/><br/>Then Cui Tianhao continued, “After her death, as her spouse and her sister, we are the legal heirs to her inheritance; all her assets will fall into our hands.”<br/><br/>Having heard this, Xiao Sese’s delight and excitement could no longer be concealed.<br/><br/>You must know that Xiao Wushuang’s personal fortune reached hundreds of billions. With so much money, they wouldn’t be able to spend it all in ten generations.<br/><br/>“Bang!”\t\t\t\t\t\t</div>", "images": {}, "success": true}