{"id": 5, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14099714.html", "title": "Chapter 5 - Chapter 5 – Chapter 5: Lucky Star And Space", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 5 - Chapter 5 – Chapter 5: Lucky Star And Space</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 5 – Chapter 5: Lucky Star and Space<br/><br/>A small village called Xiao Family Village, was located a hundred miles from Qing County in Jianggan City.<br/><br/>The village had not seen rain for half a year, and the continuous drought had caused the crops in the fields to wither.<br/><br/>What was strange was that while Xiao Family Village hadn’t seen a drop of rain in half a year, other villages occasionally experienced heavy rain to relieve their drought situations.<br/><br/>Even though dark clouds hovered above Xiao Family Village, as if to pour rain at any moment, a gust of wind would soon blow the clouds away to the neighboring villages.<br/><br/>As a result, the villagers from other villages speculated that Xiao Family Village must have committed some sort of sin, causing even the heavens to be displeased and punish them with drought.<br/><br/>The village head looked at the clear blue sky above and couldn’t help but frown. A villager beside him lamented, “Our crops are withering in the fields. If it doesn’t rain, we won’t harvest anything for half a year. Is it true that our village has committed some sin that even the heavens are punishing us?”<br/><br/>The village head replied solemnly, “Nonsense!”<br/><br/>Suddenly, he saw Xiao Wanshan and his family returning to the village with their child.<br/><br/>To the village head’s surprise, as soon as their feet stepped into the village, the previously clear blue sky became engulfed in dark clouds, followed by thunder and lightning.<br/><br/>In fact, the villagers were no longer surprised by such a situation.<br/><br/>Many times before, the rain had just ended up falling in neighboring villages.<br/><br/>Xiao Wanshan looked up at the sky and said, “Let’s hurry home, or Little Bao will get caught in the rain.”<br/><br/>A villager smiled and reassured him, “Wanshan, don’t worry. It won’t rain. This has happened so many times before.”<br/><br/>Before Xiao Wanshan could react, Xiao Junxuan, who was carrying things beside him, said, “Auntie Chun, but the raindrops are already hitting my face.”<br/><br/>“What?” The villager immediately looked up and indeed felt heavy raindrops like beans hitting their faces.<br/><br/>Excited and agitated, the villagers exclaimed, “It’s raining! It’s raining!”<br/><br/>The village head was also shocked; it was really raining this time.<br/><br/>He was overjoyed.<br/><br/>Seeing Xiao Wanshan’s family just at the village entrance, he shouted, “Wanshan, hurry up and run home with the child! Anyone close to them, bring a big umbrella quickly!”<br/><br/>Upon hearing the village head’s shout, other villagers reacted.<br/><br/>“It’s too late to grab an umbrella. Quick, quick, my house is the closest. Hurry to my house for shelter.”<br/><br/>“Aunt, I’m still in confinement period, I can’t go to your house.”<br/><br/>“Why can’t you? Come on, hurry up. The rain is getting heavier, and if you don’t go now, you’ll get soaked. You’re in confinement, you can’t get caught in the rain!”<br/><br/>Soon after, whether it was Xiao Wanshan’s family or other villagers farther away, they all ran to Xiao Chunming’s house, which was the closest to the village entrance.<br/><br/>Not long after they entered, they heard the sound of heavy rain pouring outside.<br/><br/>“Haha, it’s really raining!”<br/><br/>“This is great.”<br/><br/>Then, some of the women surrounded the newborn baby and spoke.<br/><br/>“This child is truly blessed. She just returned to the village, and it started raining heavily. She is like a lucky star for our village.”<br/><br/>“Indeed, I saw Wanshan carrying the child entering the village, and the sky immediately darkened, followed by rain. Haha, this child is like our village’s savior. It hasn’t rained for half a year, and if it didn’t rain, our crops would die.”<br/><br/>“Wanshan, have you named the child yet?”<br/><br/>A villager asked.<br/><br/>Xiao Wanshan shook his head, “Not yet, we want the elders in the village to help choose a suitable name.”<br/><br/>At this moment, the village head suggested, “The child returned to the village and brought rain, which shows she is blessed and brings good fortune. Carp is a traditional symbol of good luck and auspiciousness. Why not name her Jinli, and hope that blessings and good luck will accompany her throughout her life!”<br/><br/>“Jinli, I think it’s a good name.” A villager agreed. “Since the child is blessed, we should choose a name with a good meaning.”<br/><br/>Everyone voiced their agreement with the name Jinli.<br/><br/>After pondering for a moment, Xiao Wanshan and his wife nodded, “Alright, her name is Xiao Jinli!”<br/><br/>…<br/><br/>Just as Xiao Wanshan and his wife brought Xiao Jinli back to the village, coincidentally, rain finally fell. As a result, Xiao Jinli quickly became a favorite among the villagers.<br/><br/>Even before her first month ended, groups of villagers visited Little Jinli every day.<br/><br/>Throughout that month, the now smaller Xiao Wushuang remained silent and pensive.<br/><br/>Over the course of that month, Xiao Wushuang learned through overheard conversations that she had somehow been reborn 400 years earlier on the Blue Star.<br/><br/>That is, 21st-century Earth, in the year 2001.<br/><br/>…<br/><br/>When Xiao Wushuang looked at her right wrist when adults were not around and saw the small green leaf birthmark there that was identical to her previous life, she was once again shocked.<br/><br/>How could this be?<br/><br/>Could it be that this space had traveled with her soul through time?<br/><br/>It had to be.<br/><br/>In her previous life, she had a space.<br/><br/>At the age of three, she accidentally scratched her hand while playing, and her blood dripped onto the family heirloom, an imperial-green jade bracelet.<br/><br/>The blood was absorbed, and then green mist filled the entire room. After a while, the mist shrank and condensed into a green droplet, hovering in mid-air for a moment. The green light flashed, entering her wrist and turned into a green leaf, becoming a birthmark.<br/><br/>At that time, she was only three years old, but her innate intelligence allowed her to have a complete memory of the event.<br/><br/>Instead of being afraid, she was amazed by what had just happened.<br/><br/>Later, her father saw the birthmark on her hand and took her to the hospital for a checkup, worried that it would hurt her body. Only after the results showed no harm did he feel relieved.<br/><br/>The birthmark accompanied Xiao Wushuang as she grew up, until she was fifteen when an accident took her to another space. That space was a completely different world with beautiful scenery, flowers, trees, and water that enhanced the quality of a person’s body when consumed.<br/><br/>Furthermore, the vegetables and fruits grown in the space tasted incredibly delicious.<br/><br/>In other words, Xiao Wushuang, in her youthful age, had a colossal prideful achievement, and space played a significant role in it.<br/><br/>Of course, she didn’t rely entirely on the space; all her achievements were also the results of her hard work.<br/><br/>Xiao Wushuang felt regretful, wondering why she didn’t hide in the space at the moment of the explosion. Maybe she wouldn’t have died.<br/><br/>Perhaps her reluctance to rely too heavily on the space caused her to forget about its existence in times of danger.<br/><br/>However, it turned out to be a blessing in disguise.<br/><br/>She was given a chance to be reborn four hundred years ago.<br/><br/>And in this life, her family members were all quite good, with a beautiful mother, a handsome yet honest father, and a stable and handsome younger brother. Most importantly, they all loved her.<br/><br/>This warm and happy atmosphere was bubbling with sweetness.<br/><br/>Not to mention the surrounding neighbors and villagers, who were all caring and adorable, friendly, and united, rarely arguing with one another.<br/><br/>This kind of peaceful and harmonious life didn’t exist in her previous life.<br/><br/>Due to overpopulation on Blue Star, humans were eager to migrate to another planet.<br/><br/>Survival of the fittest!<br/><br/>Only the most outstanding people would have the power to choose better living conditions.<br/><br/>People competed with each other for their interests and gains.<br/><br/>They engaged in intrigues, resorting to deception, hardship, and drama all the time.<br/><br/>She was born into the Xiao Family on Longzhou Land.<br/><br/>The Xiao Family was a great clan with a lineage of over three to four hundred years. She was the only heir, but her life was on the line at all times.<br/><br/>At that time, her father was the only one who tried to protect her, but she was exposed to danger at any moment.<br/><br/>Being in such a high position and always at risk of losing her life, she became vigilant, ruthless, and brutal.<br/><br/>Especially after her loving father passed away, she became even more unfeeling and heartless.<br/><br/>She cared for Xiao Sese because of her father’s instructions.<br/><br/>After all, her mother married her father and raised her for many years, so there was a deep emotional bond.<br/><br/>At the same time, Xiao Sese was adept at acting and concealing her true nature, which prevented her from discovering Sese’s true intentions.<br/><br/>In her previous life of twenty-eight years, her days were spent either studying and researching or fighting assassinations, never having a day of peace.<br/><br/>In reality, she had felt tired and exhausted during those twenty-plus years, but she couldn’t stop for a moment.<br/><br/>Because if she showed even a hint of relaxation, she might face the repercussions.<br/><br/>Now in this time, as soon as she opened her eyes, she could hear her family’s laughter, friendly conversations with the neighbors and villagers, and the lively discussions with her relatives and friends.<br/><br/>She had never experienced such a relaxed and comfortable atmosphere before.<br/><br/>But she was now experiencing it.<br/><br/>To be honest, she enjoyed this kind of life.<br/><br/>Well, the past was the past, and now was now.<br/><br/>Since fate had given her a chance to live again, she would thoroughly enjoy this peaceful, harmonious, warm, and happy life.<br/><br/>From now on, she would no longer be Xiao Wushuang; she would be Xiao Jinli, the lucky star of her family and even the entire village, with high hopes and good fortune accompanying her throughout her life.<br/><br/>However, she was still a baby in her mother’s arms.<br/><br/>…<br/><br/>Xiao Jinli raised her right hand, stared intently at the small green leaf on her wrist with her bright eyes.<br/><br/>A moment later, she slightly frowned.<br/><br/>Why couldn’t she enter the space now?<br/><br/>It didn’t matter. If she couldn’t enter, so be it.<br/><br/>After all, the space wouldn’t disappear. She would eventually enter it in the future.\t\t\t\t\t\t</div>", "images": {}, "success": true}