{"id": 4, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14099711.html", "title": "Chapter 4 - Chapter 4 – Chapter 4: Crossing Over", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 4 - Chapter 4 – Chapter 4: Crossing Over</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4 – Chapter 4: Crossing Over<br/><br/>Ever since Xiao Wushuang sent those scumbags to Lao Mountain Prison, she devoted herself wholeheartedly to her career and work.<br/><br/>As a result, in just three years, there have been tremendous breakthroughs in both medical technology and space technology.<br/><br/>“We did it, we did it, Dr. Xiao, we finally did it!”<br/><br/>“As long as you take this Gene Agent, the genes in the human body can undergo natural selection, and after recombination and rearrangement, not only can human lifespan be extended to two thousand years, but also human quality will be comprehensively improved. There will be no illnesses like colds and cancer, and when humans migrate, they will not suffer from distance-related ailments.”<br/><br/>“Dr. Xiao, the technology of Spaceship- travel has been greatly improved, and its safety performance has also been greatly enhanced, especially the Invisible Laser Shield, which greatly reduces the risk of harm to humans during space migration.”<br/><br/>“Wow, Dr. Xiao is truly a genius among geniuses. Achieving great success in a single industry is something that billions of people admire, let alone Dr. Xiao, who has achieved great success in medicine, technology, and martial arts. She’s simply a god in the hearts of the people.”<br/><br/>“Three years ago, Dr. Xiao won the Global Alliance Technology Outstanding Contribution Award. I didn’t expect that three years later, Dr. Xiao would achieve even greater accomplishments, something ordinary people could not achieve in several lifetimes.”<br/><br/>“Haha, fortunately, Dr. Xiao is from Longzhou Land. Her achievements and massive contributions are the pride and glory of our Longzhou Land.”<br/><br/>“Dr. Xiao is simply inhuman. I don’t know what would happen if we lost her one day.”<br/><br/>“Pah, pah! Don’t jinx it. Since Dr. Xiao has already developed human genetic modification and natural selection technology, she can live for two thousand years.”<br/><br/>“Yes, yes, yes, pah, I don’t want to jinx it. I hope Dr. Xiao lives for two thousand years and leads us to new planets to expand our territory.”<br/><br/>“Haha…”<br/><br/>…<br/><br/>When it’s late at night and quiet, Xiao Wushuang, who is lying in bed resting, suddenly opens her eyes, and a vicious light flashes through the depths of her pupils.<br/><br/>At this moment, the alarm suddenly rings in the villa.<br/><br/>All the bodyguards quickly went into action. Some went to check the situation, while others rushed to Xiao Wushuang’s side to protect her.<br/><br/>Xiao Wushuang wears a red silk sleepwear, her long hair draped, looking stunning.<br/><br/>“Dr. Xiao!”<br/><br/>“Who broke into the villa?”<br/><br/>“Team Three is checking.”<br/><br/>After a while, the members of Team Three hurriedly came running, “Dr. Xiao, it’s a meteorite from outer space heading towards the villa.”<br/><br/>The bodyguards’ expressions changed immediately, and they said to Xiao Wushuang, “Dr. Xiao, please move to the basement.”<br/><br/>Meteorites from the sky, even if the villa has the highest level of protection, could still possibly penetrate the protective layer, causing the collapse of the building and injuries to people.<br/><br/>No matter how strong one’s martial arts skills are, it’s difficult to fight against unexpected disasters.<br/><br/>Xiao Wushuang said, “I’ll take a look!”<br/><br/>According to her recent calculations, there was no possibility of meteorite falls.<br/><br/>Why would a meteorite suddenly come crashing directly towards her villa?<br/><br/>Xiao Wushuang quickly went outside, and the bodyguards immediately followed her.<br/><br/>At this time, the entire villa activated its highest level of defense function.<br/><br/>As soon as Xiao Wushuang walked out of the villa, she saw thirty or forty men dressed in black invisible armor in mid-air, each holding her latest developed laser gun, the AK-12.<br/><br/>The bodyguards quickly formed a protective circle around Xiao Wushuang.<br/><br/>It turned out that it was not a meteorite at all, but these people who had created a simulated meteorite falling scene.<br/><br/>Everyone in the world knows that with Xiao Wushuang’s ability to calculate, it is impossible to make a mistake.<br/><br/>They created such a scene to draw out Xiao Wushuang.<br/><br/>Of course, the bodyguards accompanying Xiao Wushuang are top-notch, world-class protectors, capable of distinguishing the authenticity of meteorite falls.<br/><br/>But what if…<br/><br/>Xiao Wushuang sneered at this sight.<br/><br/>“People from Country R?”<br/><br/>Her eyes were very sharp, and she immediately recognized their identity!<br/><br/>It turns out that traitors have already emerged among her subordinates, and the one who reported the situation just now is one of them.<br/><br/>Xiao Wushuang activated her smart brain-item, and after a moment, her red dress quickly transformed into a silver battle armor, and in her hand appeared a small and exquisite silver laser gun, emitting a silver chill.<br/><br/>With an awe-inspiring and magnificent aura.<br/><br/>Before anyone could react, she quickly jumped out of the bodyguards’ protection circle and flew into mid-air at the other end.<br/><br/>Since it was confirmed that there were traitors among the bodyguards, they could no longer be trusted followers.<br/><br/>She wouldn’t put her back in their hands!<br/><br/>The leading black-clothed man hesitated slightly but soon burst into laughter. “Haha, Dr. Xiao is truly Dr. Xiao, her eyesight is really good. However, it’s a pity that today is the day you die! Attack!”<br/><br/>Originally, the villa’s protective shield wouldn’t let these laser guns penetrate.<br/><br/>But, today they could shoot in.<br/><br/>A bodyguard’s face changed, “Someone on the inside sabotaged the protective device? Who exactly is it?”<br/><br/>As soon as he finished speaking, several people in the team pointed their guns at their former comrades.<br/><br/>In a moment, more than ten bodyguards had fallen.<br/><br/>A cold smile appeared on Xiao Wushuang’s beautiful face, “It seems that you guys put in a lot of effort and resources to assassinate me.”<br/><br/>Her bodyguards wouldn’t betray her easily.<br/><br/>If they were to betray her, it must be because the other party offered them enormous temptations and benefits.<br/><br/>The leader sneered, “Hmph, as long as you disappear from this world, no matter how big the cost, it’s worth it.”<br/><br/>With that said, he made a move.<br/><br/>After a while, in mid-air, silver light flickering and vanishing like a meteor.<br/><br/>Xiao Wushuang moved swiftly through the whirlpool of silver cold light, her afterimages flickering past the naked eye.<br/><br/>At the same time, wearing a silver armor, Xiao Wushuang dodged attacks while holding her personally crafted laser gun – unique and most exquisite in the world – and shot at the enemies with agility and precision.<br/><br/>Below, the bodyguards worked together to take down all the traitors.<br/><br/>The number of enemies was also decreasing rapidly.<br/><br/>The more they fought, the more terrified the enemy became.<br/><br/>They thought to themselves, “No wonder she is the highest-rated genius in global martial arts. The people behind them went to great lengths to deal with Xiao Wushuang. But in the end, they were no match for her when they faced her. Fortunately, they were well-prepared for the last resort.”<br/><br/>Before long, Xiao Wushuang and her subordinates killed all the traitors and enemies. The entire villa was drenched in blood.<br/><br/>However, when she killed the last enemy leader, he laughed excitedly, “Ha ha, Xiao Wushuang, despite being known as the smartest person in the world, you don’t even know you’re going to die. Ha ha, with the famous Dr. Xiao dying with me, I, Cui Tianhao, have no regrets in death. Xiao Wushuang, I will be waiting for you in hell!”<br/><br/>The remaining bodyguards changed their expressions and became extremely vigilant, looking around.<br/><br/>Xiao Wushuang was very surprised by Cui Tianhao’s appearance; shouldn’t he be staying in Lao Mountain Prison?<br/><br/>What made her even more alert was what he said. What did he mean?<br/><br/>However, before she could react, the blood on the ground began to boil and suddenly turned into bubbles flying up. Then, with a loud “bang,” the entire villa exploded in an instant.<br/><br/>Even if Xiao Wushuang was skilled, she couldn’t escape at this moment.<br/><br/>Just before she died, Xiao Wushuang cursed, “Damn, these madmen actually turned Cui Tianhao’s blood into a nuclear explosive using high-end nanotechnology. Now, there’s nothing left of us.”<br/><br/>Damn unjust!<br/><br/>Cui Tianhao, I won’t let you go, not in this life or any other!<br/><br/>…<br/><br/>When Xiao Wushuang woke up again, she was utterly dazed.<br/><br/>Where was she?<br/><br/>Didn’t she die in the explosion?<br/><br/>Could it be that Xiao Sese’s curse worked, and she went to hell?<br/><br/>However, when she tried to observe her surroundings, she found that she couldn’t move at all.<br/><br/>Damn it, what’s going on?<br/><br/>She… seemed to have gotten smaller.<br/><br/>Xiao Wushuang, “…”<br/><br/>She was beyond herself.<br/><br/>Damn, what is going on here?<br/><br/>After a while, a young couple walked in and went to check on the baby first.<br/><br/>Seeing the baby opening her eyes at this moment, the woman immediately smiled and said, “Shan-ge, look how adorable our little darling is! She’s so young, but she’s already opened her eyes, with her pupils moving around. She must be a very smart child.”<br/><br/>With that, she wanted to hold the baby.<br/><br/>Xiao Wanshan immediately took the baby and said, “Wife, you just gave birth and can’t hold the baby yet. Let me do it. You lie down first!”<br/><br/>He then placed the baby in the crib, helped his wife to lie back down, and then picked up the baby again.<br/><br/>The couple looked at the baby with happiness in their eyes.<br/><br/>Suddenly, Xiao Wanshan saw his older son sleeping on the edge of the bed. He frowned and said, “This little stinker, I told him to watch over his little sister, but he fell asleep. With his pig-like sleeping habits, the baby could be stolen away without anyone knowing!”\t\t\t\t\t\t</div>", "images": {}, "success": true}