{"id": 9, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14099726.html", "title": "Chapter 9 - Chapter 9 – Chapter 9: Decisively And Domineeringly Saving People! (Requesting Reviews)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 9 - Chapter 9 – Chapter 9: Decisively And Domineeringly Saving People! (Requesting Reviews)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 9 – Chapter 9: Decisively and Domineeringly Saving People! (Requesting Reviews)<br/><br/>Two groups of people were in a standoff in the yard of Xiao Youfu’s house.<br/><br/>One group were the village head, local elders and middle-aged villagers, and the other was naturally the Liu family.<br/><br/>Wow, a lot of Liu family members had come over, mostly young adults, and they bore tools in their hands—hoes, iron shovels, bamboo poles, and such. It was clear they came prepared.<br/><br/>Xiao Chunhua had been laid by her family in the main room of the house, lying on a bamboo bed, looking pale and feeble due to blood loss. It seemed she was exhaling more than she was inhaling, which greatly worried Madame Xiao.<br/><br/>Hearing that Jinli was going in, a villager expressed his worries, “It’s really bloody inside, can we let Jinli go in?”<br/><br/>Someone’s reminder made many villagers snap back to reality.<br/><br/>“Yeah, this isn’t an ordinary conflict. Xiao Chunhua just lost her baby, letting a child go in is not a good omen.”<br/><br/>“So what do we do now? Do we not let Jinli go in?”<br/><br/>“It’s too late to stop her from going inside. Jinli has already entered.”<br/><br/>Seeing Xiao Jinli walking in, Xiao Youfu’s family brightened up.<br/><br/>The village head’s pupils involuntarily shrank, and then he sternly said, “This matter concerns adults. You, a child, should stay out of it.”<br/><br/>The main concern was that the heavy smell of blood here might scare Jinli.<br/><br/>Jinli is the lucky star of the whole village, the village’s treasure, no harm could befall her.<br/><br/>Having said that, he cast a harsh gaze at his own son Xiao Qingshan.<br/><br/>Facing his father’s terrifying stare, Xiao Qingshan shivered and immediately hid behind Jinli.<br/><br/>He felt somewhat wronged.<br/><br/>His father and the people from the Liu family had been arguing for such a long time without reaching any results, while Xiao Chunhua’s condition was getting more and more dangerous. He had no choice but to seek Jinli’s help.<br/><br/>Although he felt a little guilty for relying on Jinli.<br/><br/>As soon as Xiao Jinli entered, her beautiful, sharp eyes darted towards the main room.<br/><br/>Then, without saying a word, she ran straight towards the main room.<br/><br/>Everyone was stunned by Xiao Jinli’s actions.<br/><br/>Especially the Liu family, they were somewhat dumbfounded, not understanding why the argument suddenly stopped and why everyone was staring blankly at a child.<br/><br/>As soon as she entered the room, she was hit with a stench of blood, quite intense and nauseating.<br/><br/>Xiao Jinli slightly frowned, but she wasn’t disgusted.<br/><br/>She saw Xiao Chunhua, who was lying on a bamboo bed, more accurately, unconscious.<br/><br/>Madame Xiao covered her with a thin blanket, but couldn’t hide her increasingly pale face.<br/><br/>And the sound of blood dribbling “drip drip” onto the floor.<br/><br/>Seeing Xiao Jinli appear, Madame Xiao immediately pleaded, “Jinli, I beg you, you must save my daughter. Please, Jinli, I beg you.”<br/><br/>Xiao Jinli swiftly approached the bamboo bed and placed two fingers on Chunhua’s nostrils. Then, she put her entire palm on Chunhua’s chest.<br/><br/>After a while, she sternly said, “Sister Chunhua is in critical condition and must be rushed to the hospital immediately. Has anyone called 120?”<br/><br/>When she mentioned calling 120, everyone looked slightly stunned.<br/><br/>They had thought about taking Xiao Chunhua to the hospital, but it never occurred to them to call 120.”<br/><br/>Xiao Jinli took one look at them and knew, no one had called 120.<br/><br/>She frowned and said, “It’s too late to call 120 now. Uncle Village Chief, please arrange for village vehicles and get her to the hospital immediately!”<br/><br/>Before the village head could respond, Xiao Qingshan immediately said, “I’ll go bring the car around now.”<br/><br/>Having said that, Xiao Qingshan ran out.<br/><br/>The Liu family finally recovered at this moment.<br/><br/>They wanted to send Xiao Chunhua to the hospital?<br/><br/>How is that possible? They hadn’t even received their betrothal gifts back yet.<br/><br/>If Xiao Chunhua really got sent to the hospital, and the Xiao family spent all their money, what could they use to return the betrothal gifts?<br/><br/>Led by Liu Bald, the people from Liujiacun forcefully blocked the door to the main room.<br/><br/>Liu Bald, holding an iron shovel in his hand, placed it directly in front of the door and said menacingly, “You can send her to the hospital, but you have to return the betrothal gifts first! Otherwise, haha…, don’t even think about leaving this place!”<br/><br/>Then he added, “We paid 98,000 to marry a woman who would become our wife, but she turned out to be a promiscuous woman, causing our Liu family lose face. This account, should also include compensation for mental damage. Just returning the betrothal gifts would be letting you all off easy.”<br/><br/>Liu Daqiang didn’t speak, shooting Xiao Chunhua a hard look full of anger.<br/><br/>The rest of the villagers who had accompanied the Liu family echoed, “That’s right. The woman we Liu Family married with a betrothal gift is for having children and carrying on the family line, not a promiscuous woman who cheats on her husband and carries an illegitimate child. Today, if you don’t return the betrothal gifts, don’t even think about going to the hospital!”<br/><br/>Xiao Youfu was so angry that his face turned pale. He sternly pointed at Liu Bald and Liu Daqiang and yelled, “The betrothal gifts, the damn 98,000! When we agreed to the betrothal gifts of 98,000, you reduced it to 66,000.<br/><br/>But I allowed Chunhua to bring this 66,000 to you guys. On the night of the wedding, you took the betrothal gifts right from her hands. Now, you’re still demanding betrothal gifts. Have you no shame?”<br/><br/>Liu Bald, however, argued defiantly, “Xiao Chunhua brought the betrothal gift back and gave it to us, who saw it? Don’t think you can deny giving us the gifts with such an excuse.”<br/><br/>Just then, Xiao Qingshan and a few young men ran over.<br/><br/>Xiao Qingshan declared, “The car is ready.”<br/><br/>Xiao Jinli said, “Hurry up and carry her to the car, be gentle and be quick. Qingshan, when driving, try to be as smooth as possible. Also, it’s best if you could call 120, they will meet us on the way.”<br/><br/>Xiao Qingshan and the others nodded their heads, then made their way straight to the main room.<br/><br/>Liu Bald became very angry, saying, “If you want to save…”<br/><br/>“If we don’t save her now, Sister Chunhua will die. And when she dies, will you pay with your lives?”<br/><br/>Before he could finish, Xiao Jinli cut him off coldly.<br/><br/>Her piercing eyes swept over the Liu family members and the villagers from Liujiacun who had followed the Lius.<br/><br/>“Whether or not Sister Chunhua cheated on her husband, we won’t discuss that for now. But, right now Sister Chunhua’s life is hanging by a thread. If she’s not taken to the hospital for treatment immediately, she will die. You all are standing here blocking the way, preventing her from being sent to the hospital, do you know what that is called?”<br/><br/>Some villagers from Liujiacun frowned, “What is it called?”<br/><br/>“It’s called deliberate homicide!” Xiao Jinli said coldly, “If anything happens to Sister Chunhua, whether it’s Liu Bald or Liu Daqiang, even if they don’t pay with their lives, they’ll definitely spend half of their lives or the rest of their lives in prison.”<br/><br/>“As for you accomplices, although you won’t be imprisoned for life or half of your life, you won’t be able to evade spending three to five years in prison.”<br/><br/>Now that we’re talking about this, I’m really curious. Did the Liu family give you any benefits to make you willing to risk going to jail, just to help them murder someone?”<br/><br/>“Clang.”<br/><br/>A sound.<br/><br/>The tools in the hands of the villagers from Liujiacun fell to the ground, their faces slightly pale.\t\t\t\t\t\t</div>", "images": {}, "success": true}