{"id": 8, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14099723.html", "title": "Chapter 8 - Chapter 8 – Chapter 8: Little Koi, Something Big Happened! (Please Comment!)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 8 - Chapter 8 – Chapter 8: Little Koi, Something Big Happened! (Please Comment!)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 8 – Chapter 8: Little Koi, Something Big Happened! (Please Comment!)<br/><br/>Ten years later<br/><br/>Miles of lush paddy fields waved gently in the breeze, the stridulation of insects rose and fell, and a small river flowed slowly.<br/><br/>On both banks of the river, willow branches hung low, green grass swayed, and in the river, a few ducklings flapped their wings while swimming, occasionally pulling out a little fish, shrimp, or snail from the water.<br/><br/>On a river bank, standing in a pasture, five or six cows were grazing, occasionally letting out a “moo” sound.<br/><br/>A short distance away, under a big tree, seven or eight children about ten-year-old were engaged in herding cows. During this task, they were playing cards and games, thoroughly enjoying themselves.<br/><br/>While they were being cheerful and playing around, they dared not yell or scream. They would occasionally glance, with respectful little expressions, towards a girl lying on a haystack nearby, her arms folded into a pillow, with a dog’s tail grass in her mouth, resting with her eyes closed.<br/><br/>The girl had fair skin and extraordinary temperament, unlike a typical village girl.<br/><br/>“Why doesn’t Jinli join us every time we play? We have more people playing together. It would be so lively and great.”<br/><br/>“It’s because Jinli finds Goudan too dumb every time. She doesn’t like playing with dumb people!”<br/><br/>Goudan immediately flared up. He retorted, “Calling me dumb, you are no better!”<br/><br/>The children sighed like adults and said, “Indeed, we’re all just too dumb. Jinli is really too clever. There are so many things in the village that the adults can’t solve, but as long as she gets involved, they can be solved!”<br/><br/>“That’s why my parents told me that Jinli is the Lucky Star of Xiao Family Village, our village treasure. We must take good care of Jinli, and then our village will get better and better!”<br/><br/>“Yes, my parents also told me the same!”<br/><br/>…<br/><br/>Xiao Jinlu, the village treasure, was lying on the haystack, hearing the chirping voices of the children. Her mouth twitched involuntarily.<br/><br/>These children…are indeed adorable!<br/><br/>“Jinli, Jinli,”<br/><br/>Suddenly, a urgent voice of a young man echoed from afar.<br/><br/>The man appeared to be in his twenties. He was of average build, had dark skin, and was wearing a plain shirt and shorts. His expression was anxious.<br/><br/>A child quickly pointed towards the haystack and said, “Qing Shan brother, Jinli is resting over there.”<br/><br/>“Brother Qing Shan, what happened again that requires Jinli’s intervention?”<br/><br/>“Yeah, Brother Qing Shan, can’t you adults handle it?”<br/><br/>The man, who was being called Brother Qing Shan, didn’t pay attention to these children. He ran straight to the haystack where Xiao Jinlu was resting. He stopped, placed both his hands on his knees, and gasping for breath, he said, “Lit… Jinli, something… significant… has happened!”<br/><br/>Xiao Jinlu opened her eyes at this time.<br/><br/>What kind of eyes were those?<br/><br/>Her pupils seemed to contain the sea, shining like stars!<br/><br/>Xiao Jinlu’s gaze swept across, she stood up from the haystack, brushed the grass off her backside with her small hands, and asked with a hint of immaturity, “Tell me, what’s happened this time?”<br/><br/>The children who were playing under the tree ran over, and they all curiously asked, “Brother Qing Shan, what big event has occurred that needs Jinli’s intervention to solve?”<br/><br/>In the children’s understanding, a problem in the village that could not be resolved, only then would Jinli be called for help.<br/><br/>It seemed that in Xiao Family Village, no one thought there was a problem in letting a ten-year-old child solve village affairs.<br/><br/>“Brother Qing Shan, is the issue very serious?”<br/><br/>“Goudan, isn’t that obvious? If it wasn’t serious, why would they need Jinli’s intervention? Wouldn’t the adults have solved it?”<br/><br/>“Exactly, only issues the adults can’t resolve would require Jinli’s involvement.”<br/><br/>Brother Qing Shan, “…” Children, can you not speak the absolute truth.<br/><br/>Xiao Qingshan wiped the sweat from his forehead. His breathing had begun to slow down.<br/><br/>He said, “Sister Chunhua, the daughter of Uncle Dafu from our village who married off, was carried back by her husband’s family, having bled a lot.”<br/><br/>Xiao Jinlu frowned slightly and asked, “Was Sister Chunhua carried back? Was she hit by someone?”<br/><br/>Xiao Qingshan nodded, “Yes, it’s very serious. Sister Chunhua’s husband, Liu Daqiang, hit her, causing her to miscarry. They didn’t take her to the hospital but brought her straight back. They claim that Sister Chunhua stole and is carrying a bastard. They’re here not just to return her but also to demand the return of the betrothal gifts.”<br/><br/>As he said this, Xiao Qingshan frowned, a look of anger crossing his face, “There’s no way Sister Chunhua could have cheated.”<br/><br/>Upon hearing how serious the situation was, Xiao Jinlu asked earnestly, “Has she been taken to the hospital now?”<br/><br/>“No. Liu’s family won’t let us move her. They’ve said they won’t allow for her to be taken to the hospital until the betrothal gifts are returned,” Xiao Qingshan said, “Liu Family brought a large group of people over. My father, along with others, are currently confronting Liu’s family. Sister Chunhua’s condition is deteriorating.”<br/><br/>“Have you called the police?” Xiao Jinlu asked with a solemn face, “This is a matter of life and death. If they obstruct us, we can call the police directly. If Sister Chunhua doesn’t have an accident it’s okay, but if something happens, let the people of Liu Family wait for their punishment!”<br/><br/>Xiao Qing Shan was shocked by the cold radiance in Xiao Jinlu’s eyes, but he quickly responded, “Someone has already called the police, but the Liu’s seem to not be afraid at all.”<br/><br/>“Let’s go!”<br/><br/>They couldn’t delay this matter. If Sister Chunhua bled to death, it would be a great injustice.<br/><br/>As Xiao Jinlu walked, she listened to Xiao Qingshan describe the situation.<br/><br/>Seeing the event unfolding in the village, the children decided to let the cows graze. They all ran towards their homes.<br/><br/>Anyway, with Cow King there, these cows would not run off. They would return to their homes by themselves when it got dark.<br/><br/>Xiao Jinlu quickly arrived at Xiao Youfu’s house.<br/><br/>A large group of people surrounded the main gate of Xiao Youfu’s home.<br/><br/>From afar, they could hear the loud quarrelling emanating from inside.<br/><br/>“Xiao Youfu, I’m telling you, your daughter is involved in an affair. We caught her in the act,” Liu Bald, Daqiang’s father, exclaimed loudly, “Your daughter, I’m sending her back to you, but the betrothal gift of 98,000 we gave you, you must return back!”<br/><br/>“Liu Bald, don’t wrong my daughter. Chunhua is an honest and sincere girl from my family. She would never do such a thing,” Xiao Youfu naturally stood by his daughter.<br/><br/>“You still want to quibble? Today, our family and several villagers caught her in the act. She was lying with Laizi of our village,” Liu Bald said furiously, “Ever since my son Daqiang brought your daughter Chunhua back, he has been spoiling her and treating her like a treasure. But she, having such a good husband, actually sought other men outside. Hmph, we, Liu’s family, won’t tolerate such a capricious woman.”<br/><br/>At this moment, someone shouted, “Jinli is here, let’s quickly let Jinli in!”\t\t\t\t\t\t</div>", "images": {}, "success": true}