{"id": 3, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14099708.html", "title": "Chapter 3 - Chapter 3 – Chapter 3: Ruthlessly Revenge On Jerk Men And Cheap Women", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 3 - Chapter 3 – Chapter 3: Ruthlessly Revenge On Jerk Men And Cheap Women</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3 – Chapter 3: Ruthlessly Revenge on Jerk Men and Cheap Women<br/><br/>She had never seen such a terrifying side of Xiao Wushuang before.<br/><br/>In the past, Xiao Wushuang had always been gentle and soft-spoken with her, giving her money and anything else she wanted, even promising to get stars from the sky if needed.<br/><br/>So, she took advantage of Xiao Wushuang’s affection to gain countless benefits while suppressing her jealousy and resentment towards her all the time.<br/><br/>Xiao Wushuang ignored the shock on her face and continued, “Oh, right, I’m the maternal murderer you hate, and your hatred for me is irreconcilable. So, you used a man to strike at me, wanting to see me in pain, right? Thinking that the man I found doesn’t love me, but is devoted to you, satisfies your vanity, doesn’t it?<br/><br/>Then, you two despicable people, one bearing a grudge against me and the other hating me irreconcilably, joined forces to want me dead and take over my property? Well, I have to say, your plan is pretty perfect. But unfortunately, you made one crucial mistake.”<br/><br/>As she spoke, her face was filled with sarcasm and mockery.<br/><br/>“You really underestimated how much I care about you. I bet you never thought that because of your lame excuse of a sprained ankle, not wanting to attend my award ceremony, I would come over to check on you.”<br/><br/>Xiao Sese’s pupils couldn’t help but contract, her frightened face opening and closing her mouth, as if wanting to argue something, but all her reasons seemed feeble.<br/><br/>Yes, she hated seeing Xiao Wushuang in the spotlight during the award ceremony. So, she found an excuse to avoid attending.<br/><br/>But she never imagined that a small injury like a sprained ankle could make Xiao Wushuang abandon her moment of glory to check on her.<br/><br/>She regretted it deep down in her heart, knowing now… if only she had known…<br/><br/>But unfortunately, even a fortune cannot buy that kind of hindsight.<br/><br/>Xiao Wushuang chuckled coldly, “Heh, Xiao Sese, you think I killed your mom? How long have you been brainwashing yourself? Your mom was actually killed by you!”<br/><br/>Xiao Sese’s pupils shrank again, disbelief etched in her eyes.<br/><br/>“What, surprised?” Xiao Wushuang saw her expression and continued, “When you were six years old, your mother was pregnant with your younger brother. You were afraid that your unborn brother would steal away all your mother’s love, so while your mother was going downstairs, you stood behind her, and with a push, sent her tumbling. Sadly, your mother fell and bled all over, eventually leaving this world with your brother. And you, completely lost your mother!”<br/><br/>With Xiao Wushuang’s narration, the buried deep memory was quickly brought back to life.<br/><br/>Scenes flashed through her mind.<br/><br/>She was wearing a pink princess dress, watching her mother caressing her belly every day and calling her unborn brother, she felt scared.<br/><br/>Her father had abandoned her, she was afraid her mother would abandon her too once she had a brother.<br/><br/>She didn’t want to be abandoned by her mother, so her chosen solution was to get rid of her brother.<br/><br/>As long as her brother was gone, her mother would still love her.<br/><br/>So she stood at the stairway, and seeing her mother descending, a thought flashed through her mind, and she reached out a hand.<br/><br/>Then, not only did she get rid of her brother, she also got rid of her mother.<br/><br/>Downstairs, all was covered in blood.<br/><br/>Xiao Sese clutched her head, crying out in pain, “No, no, it was you who killed my mom and brother, not me, it was you, Xiao Wushuang, not me, not me!”<br/><br/>Her eyes, full of anger and resentment like a madwoman, stared fiercely at Xiao Wushuang.<br/><br/>Xiao Wushuang held two silver needles in her hand, quickly inserted them into the acupuncture points on her head.<br/><br/>Xiao Sese soon calmed down.<br/><br/>Xiao Wushuang continued coldly, “When the incident with your mother happened, my father sent me to medical school to study. Xiao Sese, did you really think you could frame me for pushing your mother and change the fact that you were the one who pushed her down the stairs?”<br/><br/>Hehe, my dear little sister, it’s not that I look down on you, but even if you were to bury your memories and hypnotize yourself into making me the maternal murderer, you still wouldn’t have the power to take revenge, would you?”<br/><br/>Since these scumbag men and cheap women are ungrateful white-eyed wolves, and they want to kill her, there’s no need for her to show them any mercy.<br/><br/>From a young age, her education had been: if you don’t offend me, I won’t offend you. If you attack me, I’ll pay you back a hundredfold!<br/><br/>No matter if it’s a younger sister or a boyfriend.<br/><br/>Moreover, Xiao Sese isn’t her blood-related sister, but only a stepsister brought in by her stepmother.<br/><br/>Since she’s repaying kindness with ingratitude, it’s only natural that she’ll retaliate with an eye for an eye.<br/><br/>Xiao Wushuang crossed her arms, her disdainful gaze sweeping lightly over the naked scumbag man and his cheap woman, and coldly called, “Come, arrest them, and lock them up in Lao Mountain Prison!”<br/><br/>As her voice fell, four men in blue uniforms immediately appeared in the room.<br/><br/>Upon hearing the words “Lao Mountain Prison,” Cui Tianhao and Xiao Sese’s expressions changed, and they quickly reacted.<br/><br/>“On what grounds are you arresting us to Lao Mountain Prison?” Cui Tianhao demanded.<br/><br/>“On the grounds that you two conspired to murder Dr. Xiao Wushuang!” Xiao Wushuang said coldly. “That alone is enough to keep you in Lao Mountain Prison for a lifetime!”<br/><br/>“No, you have no evidence; you can’t do that!”<br/><br/>Cui Tianhao struggled in desperation.<br/><br/>“Hehe, it seems you won’t give up until the very end.”<br/><br/>Xiao Wushuang then pressed on the smart brain-item in her hand, and the clear sound of their conspiracy to kill Xiao Wushuang came from within.<br/><br/>“This is the evidence!”<br/><br/>Xiao Wushuang stated coldly.<br/><br/>The scumbag man’s entire body went limp, and he slumped down, powerless as a pile of rotten mud!<br/><br/>Xiao Sese’s face turned deathly pale, fear and terror showing in her eyes.<br/><br/>Suddenly, she knelt before Xiao Wushuang and cried out in pleading sobs, “Sister, sister, I was wrong, I was wrong. Please forgive me, okay? I was wrong, boo-hoo… I don’t want to go to Lao Mountain Prison!”<br/><br/>Xiao Wushuang expressionlessly said, “If you had only taken my boyfriend, I might have forgiven you. But you had such malicious intentions as to try to put me to death and seize my property. Xiao Sese, how can I forgive you?<br/><br/>Did you think just because I spoiled and loved you, I would still let you kill me? Why should I? I, Xiao Wushuang, don’t owe you anything.<br/><br/>And don’t call me sister. You’re just a bastard brought into the Xiao family by your mother. You’re unworthy of being my sister, and calling you my sister makes me sick! Take them away!”<br/><br/>The four men in uniforms quickly dragged the two out of the bed. They didn’t even cover them with a sheet, and just took them away naked.<br/><br/>Seeing Xiao Wushuang’s cold and merciless nature, the pair immediately began cursing her.<br/><br/>“Xiao Wushuang, you heartless woman! I curse you to never find true love and to die with no place to bury your body!”<br/><br/>“Xiao Wushuang, you malicious woman! I curse you to be lonely and old, with eternal solitude as your companion!”<br/><br/>“Xiao Wushuang, I curse you to go to the eighteen levels of hell and suffer in eternal pain and torment!”<br/><br/>…\t\t\t\t\t\t</div>", "images": {}, "success": true}