{"id": 7, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14099720.html", "title": "Chapter 7 - Chapter 7 – Chapter 7: Female Cows Express Gratitude, Space Unlocked", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 7 - Chapter 7 – Chapter 7: Female Cows Express Gratitude, Space Unlocked</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 7 – Chapter 7: Female Cows Express Gratitude, Space Unlocked<br/><br/>Xiao Mother was considering how to answer these people when Xiao Jinli turned her head and suddenly said, “It was me who asked Mom to bring me here.”<br/><br/>Words that shock people!<br/><br/>When Xiao Jinli spoke, she simply astonished the villagers present.<br/><br/>“My goodness, are my ears playing tricks on me? How did I hear Jinli speaking?”<br/><br/>“If there’s a problem with your ears, there’s a problem with mine too, I also seem to have heard Jinli speak. And when she does speak, she is clear and fluent.”<br/><br/>“Oh, it really was Jinli speaking. She’s so young, only three months, right? A three-month-old baby talking already surprised me. What’s even more shocking is her clear pronunciation and fluency. My goodness, Jinli is a genius!”<br/><br/>“Yes, a genius, a language genius!”<br/><br/>“A three-month-old infant speaking better than a three-year-old child. This child is really rare.”<br/><br/>Just as everyone was praising Jinli, suddenly a villager excitedly shouted, “The calf is about to be born, it’s coming!”<br/><br/>As soon as someone shouted, everyone’s attention quickly turned to the birthing cow.<br/><br/>They saw the calf, who had been unable to be born for a whole day, being born more than halfway out with a “moo” from the mother cow.<br/><br/>The most difficult part of the delivery was over, and the rest was relatively easy.<br/><br/>A villager immediately called out, “Xiao Changsheng’s family, hurry up and bring some dry hay and water for the mother cow to regain some strength.”<br/><br/>“The dry hay and water have been prepared!” Xiao Changsheng’s wife immediately brought dry hay and water.<br/><br/>After the mother cow ate a few mouthfuls of hay and water, she let out another “moo” cry, and the whole calf fell out.<br/><br/>“Haha, it’s born, it’s born, the calf is born!”<br/><br/>The villagers were filled with excitement and joy.<br/><br/>As the newborn calf was still wrapped in its membrane, the mother cow went up and licked it off, and after a while, the calf wobbled to its feet.<br/><br/>“Haha, the calf stood up!”<br/><br/>After the calf stood up, it nuzzled its little head against its mother’s neck, as if in celebration and also acting spoiled at the same time.<br/><br/>The mother cow licked her calf’s fur again, “mooed,” and ran to Xiao Mother, kneeling down in front of her with her two front hooves bent.<br/><br/>The villagers gasped in surprise.<br/><br/>“What is this cow doing?”<br/><br/>“What else could it be doing, it’s kneeling down to Xiaofang.”<br/><br/>“I know it’s kneeling. But why is it kneeling to Xiaofang?”<br/><br/>Someone suddenly thought of something and looked at Jinli in Xiaofang’s arms, her big eyes blinking.<br/><br/>So a villager shouted, “Could it be that the cow was able to give birth smoothly thanks to Jinli? So, it’s thanking Jinli?”<br/><br/>Others also reacted.<br/><br/>“Now that you mention it, it really might be the case.”<br/><br/>“It’s not might be, it’s definitely the case.”<br/><br/>“Haha, Jinli really is a lucky star. When she returned to the village three months ago, Xiao Family Village, which hadn’t had rain for nearly half a year, immediately had heavy rain. Today, this cow has been in difficult labor for a day, but who would have thought that as soon as Jinli came, it would give birth to a calf.”<br/><br/>“Hehe, this mother cow is also grateful. Knowing that it could give birth to a calf smoothly, it knelt down in front of Jinli to thank her for the grace of childbirth.”<br/><br/>“Haha, Jinli is a lucky star. I need to get closer to her in the future, maybe my son can find a wife earlier.”<br/><br/>…<br/><br/>Listening to the adults’ simplistic and good-hearted jokes, Jinli’s mouth corners lifted slightly, somewhat speechless.<br/><br/>In fact, the villagers hadn’t said anything wrong; the mother cow had indeed given birth to the calf smoothly because of her.<br/><br/>When her mother held her close to the cow, she felt the spatial fluctuations becoming more intense, and when the mother cow “mooed,” her space “poofed” and fully unlocked.<br/><br/>Then, a childish voice sounded in her mind.<br/><br/>“Master, I can see you again, so glad, sob sob…”<br/><br/>Xiao Jinli communicated with it in her mind, saying, “Xiao Zhi, wait a moment for me to reminisce. I’ll save this mother cow first.”<br/><br/>Then, she raised her little index finger, and a drop of Lingquan water flew out, flying directly to the cow’s womb angle.<br/><br/>At that time, Jinli was held upright, her hand resting on her mother’s back, and since everyone’s attention was on the mother cow and her face, no one noticed the sudden appearance of a crystalline liquid on her finger.<br/><br/>During broad daylight, no one would notice the transparent Lingquan water flying out.<br/><br/>So, the mother cow, which was having difficulty giving birth, gave birth to the calf smoothly.<br/><br/>This mother cow had been raised by humans for several years and had developed its own spirituality. Maybe in a hazy moment, it knew who had helped it through this ordeal, so it bowed down to thank Jinli.<br/><br/>As such, it only further confirmed Jinli’s title as a lucky star.<br/><br/>…<br/><br/>After returning home and lying on her baby bed, Jinli once again experienced being surrounded by villagers.<br/><br/>Mr. and Mrs. Xiao Changsheng even brought gifts to express their gratitude.<br/><br/>They felt it was Jinli who brought good luck to them, and that was why their cow gave birth to a calf so smoothly. Naturally, they wanted to express their gratitude.<br/><br/>“Tsk, tsk, I have to get some more of Jinli’s luck in the future. Maybe my family’s stinky boy can get a wife earlier.”<br/><br/>“Haha, Qiu Ping, when your son marries a wife, you have to bring a big gift to express your gratitude.”<br/><br/>“Of course.”<br/><br/>“Oh, I want to join in too, so my elder daughter-in-law will have a chubby, rosy-cheeked grandson!”<br/><br/>“Hey, you’re just favoring boys over girls.”<br/><br/>“Who says so? Grandsons and granddaughters are all called grandsons. Haha, if I have a granddaughter who is half as pretty and cute as Jinli, I’ll laugh myself awake in my sleep.”<br/><br/>…<br/><br/>Xiao Jinli, “…”<br/><br/>She really didn’t know whether her luck was good or it was just a coincidence.<br/><br/>For now, the rain incident when she was just brought back to Village Beijing was a complete coincidence for her.<br/><br/>As for the successful birth of the calf by the female cows, of course it was not a coincidence; she had helped.<br/><br/>Of course, for other people, this was certainly a blessing brought by Jinli.<br/><br/>On a late night, when the moonlight was like a flower, and the insects outside were making noise.<br/><br/>In the baby’s crib, Xiao Jinli started communicating with Xiao Zhi.<br/><br/>Xiao Zhi was the intelligent system created by Xiao Wushuang in her previous life, storing all the global network data inside.<br/><br/>It can be said that as long as there is a network, this system can break through all firewalls, completely copy the data inside, silently, without leaving any traces.<br/><br/>This was Xiao Wushuang’s personal secret, and she didn’t let anyone know about it.<br/><br/>Otherwise, she would be hunted down globally.<br/><br/>After all, no one wants their secrets exposed.<br/><br/>Xiao Wushuang spent a lot of effort transforming the intelligent system into her own Q-version character, which was very cute.<br/><br/>In order to prevent the intelligent system from being discovered, Xiao Wushuang had to throw it into her Space.<br/><br/>She would never use this intelligent system unless absolutely necessary.<br/><br/>Unexpectedly, after the intelligent system was placed in the space, it could communicate with her consciousness in her mind.<br/><br/>The space had traveled with her, and the Xiao Zhi in the space naturally came along as well.<br/><br/>“Master, what’s going on? How did I suddenly lose contact with you?”<br/><br/>Xiao Zhi asked doubtfully.<br/><br/>“Sigh!” Xiao Jinli sighed lightly and explained how she was assassinated and then crossed over to Xiao Zhi.<br/><br/>Finally, Xiao Jinli said, “I don’t know why I crossed over 400 years ago?”<br/><br/>After a while, Xiao Zhi said, “Master, you probably don’t know, the power of the space seems to have weakened. Now in this space, except for a shallow Lingquan, it’s basically just barren land.”<br/><br/>Xiao Jinli was almost shocked when she heard this and tried to sit up.<br/><br/>But the three-month-old her couldn’t sit up at all.<br/><br/>A moment later, Xiao Jinli reacted.<br/><br/>She murmured, “So, my ability to cross over was because of the space power?”<br/><br/>Xiao Zhi leaped in mid-air in the space, looked at it filled with yellow sand, and said somewhat dejectedly, “Probably. Why did everything in the space turn into dust?”<br/><br/>After a while, Xiao Zhi said again, “But Master, don’t be discouraged. Before Mini Space lost most of its energy, it passed a message to Xiao Zhi. Its space power can be restored. It said that as long as the Master becomes stronger and continuously plants in the space, it will slowly return to its previous state.”<br/><br/>Xiao Jinli’s eyes brightened after hearing this, and tears brimmed in the corners of her eyes as she nodded, “Okay, I got it. Xiao Zhi, thank you and Mini Space.”<br/><br/>Xiao Zhi held his cheeks, looking a little embarrassed, “Master, as long as you’re okay.”<br/><br/>…<br/><br/>Later, the elder daughter-in-law of the Western house successfully gave birth to a chubby granddaughter.<br/><br/>At the end of the year, the son of the Eastern house married his wife smoothly.<br/><br/>After that, if someone lost a chicken or their cow ran off, they needed to see Jinli. Then, the chicken would come back, and the cow would also return on its own.<br/><br/>All those who had made small wishes in front of Jinli and had their luck rubbed off by her would have their wishes fulfilled within the year.<br/><br/>The Xiao Village villagers practically wanted to worship Xiao Jinli after this series of events.<br/><br/>Of course, these villagers were simple and honest, and they wouldn’t make extravagant wishes.<br/><br/>For example, winning the lottery or getting rich overnight.<br/><br/>When the village encountered some troubles, the Village Head or village cadres would go to Xiao’s house, and then things would be resolved quickly.<br/><br/>As a result, Xiao Jinli’s title as the village’s Lucky Star became even more established.<br/><br/>Then, the villagers started calling Jinli “village treasure.”<br/><br/>Xiao Jinli, “…”<br/><br/>No, it’s not me, it’s obviously a coincidence.<br/><br/>Xiao Jinli also fell into deep thought.<br/><br/>Could it be that she really had the Koi constitution?<br/><br/>Seeing Xiao Jinli’s Koi constitution, Xiao Zhi was also stunned.<br/><br/>He exclaimed, “Master, could it be that you are the incarnation of Koi in this life?”<br/><br/>Xiao Jinli, “…”\t\t\t\t\t\t</div>", "images": {}, "success": true}