{"id": 14, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14099744.html", "title": "Chapter 14 - Chapter 14 – Chapter 14: The Liu Family Causes Trouble Again", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 14 - Chapter 14 – Chapter 14: The Liu Family Causes Trouble Again</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 14 – Chapter 14: The Liu Family Causes Trouble Again<br/><br/>Xiao Family Village was a very united and cohesive village.<br/><br/>Following Xiao Jinli’s instructions, the Village Head quickly arranged for people to take action.<br/><br/>The Village Head and Xiao Youfu arrived at Xiao Jinli’s house.<br/><br/>In these two days, Xiao Youfu had been taking care of Xiao Chunhua at the hospital, and he was very worried about her. His whole person seemed haggard and pale, with more than half of his hair turned white.<br/><br/>It’s true; the children indeed are the debt of their parents.<br/><br/>The ones who always worry about their children are their parents.<br/><br/>Xiao Youfu angrily said, “Chunhua said that day, somehow, she just drank a cup of tea handed by Daqiang and fell asleep. When she woke up, she saw a large group of people standing in the room, all pointing to her saying she had stolen a man.”<br/><br/>Afterwards, Liu Laizi, who was lying next to her, said that she had seduced him into the house. He even said that they had been together for a long time, and the child in Chunhua’s stomach might be his.”<br/><br/>Then Liu Daqiang, out of anger, beat Chunhua and caused her to lose the child. These bastards were all bullying my Chunhua.”<br/><br/>“There was clearly something wrong with the tea. Otherwise, with such a commotion, she would have woken up already.”<br/><br/>Xiao Jinli just comforted him, “Uncle Fu, calm down! We’ll definitely help her seek justice and clear Sister Chunhua’s name.”<br/><br/>Who would have thought that just as she finished speaking, a child ran over, “Uncle Three, Uncle Three, those bad guys are at your house again!”<br/><br/>“What?” Xiao Fu was so surprised that he jumped up, “Well, they dare to come here? If they don’t come, I’ll go to Liujiacun.”<br/><br/>With that said, he stood up and ran out quickly.<br/><br/>Xiao Jinli and the Village Head immediately followed.<br/><br/>Xiao Youfu has a son and a daughter – Xiao Chunhua is the eldest, Xiao Chunming is the second, but he was already of age and had gone out to work.<br/><br/>The elderly couple was still able to take care of themselves at home, so they lived alone in a separate house.<br/><br/>Madame Xiao was taking care of Xiao Chunhua in the hospital, so there was only Xiao Youfu at home.<br/><br/>However, Xiao Youfu had a large family.<br/><br/>As soon as they heard that the Liu Family was coming again, the villagers of the Xiao Family Village immediately dropped their work, picked up an iron shovel or hoe from their homes, and hurried to Xiao Youfu’s house.<br/><br/>“Well, Liu Bald, I didn’t even come looking for you, and you already came knocking on my door.”<br/><br/>As the saying goes, enemies meeting each other would see red!<br/><br/>As soon as Xiao Youfu saw Liu Bald, he couldn’t wait to tear them apart.<br/><br/>This family almost killed his daughter!<br/><br/>At this time, a short, slightly plump middle-aged woman, hands on her hips, and in a shrew-like image, scolded, “Xiao Youfu, your family is full of cheap people, and you treat our Liu Family as if we were dead? Doing such shameless things in broad daylight, you people are shameless women that get around. You should be put into a pig cage and spare us the shame on our Liu Family.”<br/><br/>Listening to Old Lady Liu’s words, Xiao Youfu’s face turned pale with anger, but he, as a big man, didn’t know how to retort.<br/><br/>Xiao Chunhua’s aunt stepped forward, put her hands on her hips, and immediately viciously cursed back, “Chen Erying, you crazy woman, you’re the cheap one, and your whole family is cheap! It’s obviously your son, Liu Daqiang, who stole a man, don’t try to pin that crime on my Chunhua. Your precious son, Liu Daqiang, should be the one in the pig cage!”<br/><br/>Upon hearing Auntie Xiao’s words, the three members of the Liu Family were suddenly scared, and a flash of panic crossed their eyes.<br/><br/>Liu Daqiang exclaimed loudly, “Great Aunt, don’t wrongly accuse me, I didn’t steal anyone at all!”<br/><br/>Auntie Xiao sneered, “You didn’t steal anyone? Then do you dare to swear? You swear that if you have stolen someone, you, Liu Daqiang, will be struck by lightning and your whole family will be childless. Do you dare?”<br/><br/>Liu Daqiang certainly didn’t dare!<br/><br/>In modern society, people believe in scientism.<br/><br/>However, he grew up in the countryside after all, where many superstitious old customs deeply influenced them.<br/><br/>Asking him to swear that he would be struck by lightning and cut off from his descendants, what if it came true?<br/><br/>Liu Daqiang adamantly spoke louder, “I, Liu Daqiang, didn’t steal anyone’s wife, so why should I swear? Humph, as for Xiao Chunhua, it’s a shame that after marrying her, I treated her like a treasure, and she just went out to cheat on me, giving me a green hat. We caught her cheating red-handed, that’s a fact!”<br/><br/>The louder he spoke, the more guilty he seemed!<br/><br/>“You’re talking nonsense!” Xiao Youfu angrily shouted, “My daughter did not cheat on you! It’s clear that your whole family framed her. I found out that after Xiao Chunhua drank the cup of tea you gave her, she fell asleep.<br/><br/>When she woke up, you and your so-called friends caught her cheating. Why would Chunhua fall into a deep sleep after drinking the water you gave her?<br/><br/>Why did you catch her with such a large group of people? Did you know in advance that my daughter Chunhua would be in bed with someone in broad daylight, in front of everyone?<br/><br/>So, do you think that even though you knew you were cuckolded, you would still make a big scene so that everyone knows? This is obviously a disgraceful matter, shouldn’t it be hidden instead?”<br/><br/>“I…I…” Liu Daqiang was caught off guard and didn’t know how to respond!<br/><br/>He did not expect the Xiao family to find the truth so quickly.<br/><br/>But they came to cause trouble, did they want the betrothal gifts back?<br/><br/>Liu’s wife immediately stood in front of her son and pointed at Xiao Youfu, angrily cursing, “Your shameless daughter cheated and isn’t afraid of it being exposed, so why should my family be afraid? On the contrary, if we help keep the truth hidden on this disgusting woman, she may think we’re afraid of her?<br/><br/>Humph, since that’s the case, let her lose face thoroughly and make sure everyone knows about it.<br/><br/>Xiao Youfu, don’t try to push the responsibility onto our Liu family for the cheap daughter you raised.<br/><br/>I tell you, today we came for the betrothal gifts. If you don’t give them back, I’ll go to town and let the whole town and villagers know that Xiao Family Village has produced a shameless and disgraceful woman.”<br/><br/>“You…you…” Xiao Youfu trembled with anger, “You’re just making things up!”<br/><br/>Jinli, who was in the crowd, saw that Liu family’s combat power was so strong, while the Xiao family was obviously at a disadvantage, she slightly frowned.<br/><br/>She thought for a moment and then approached Aunt Xiao Chunhua.<br/><br/>Aunt Xiao looked at Jinli with bright eyes, but then asked worriedly, “Jinli, the Liu family is just making things up. What should we do now?”<br/><br/>Jinli took out something that looked like a black pen and handed it to Aunt Xiao, saying, “Aunt Xiao, this is evidence of Liu Daqiang’s affair with the widow Niu Xiaolan from their village. I’m giving it to you now, and you can play it directly. However, you must protect this evidence well. I’ve called the police, and as long as you can stall until the officials from the Yamen arrive, it will be fine.”<br/><br/>After listening, Aunt Xiao took the item very carefully and promised, “Okay, I will definitely protect this evidence!”<br/><br/>Next, Jinli taught Auntie Xiao how to use it.<br/><br/>After a while, Aunt Xiao rushed out with the item, and she slapped Liu Daqiang twice and cursed,<br/><br/>“Damn you, I want to kill you! How can you be so evil? What has Chunhua done to hurt you?<br/><br/>You cheat on her and then frame her, even causing her to miscarriage and almost lose her life. You heartless thing, she was carrying your son! How could you be so cruel and wicked?”<br/><br/>Aunt Xiao’s sudden fury caught everyone by surprise, including the villagers of Liujiacun!<br/><br/>“What? You said that shameless woman was carrying a son in her stomach? How could that be?”<br/><br/>Old Lady Liu’s shrill voice rang out, clearly not believing any of it!\t\t\t\t\t\t</div>", "images": {}, "success": true}