{"id": 13, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14099739.html", "title": "Chapter 13 - Chapter 13 – Chapter 13: Looking For Liu Laizi", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 13 - Chapter 13 – Chapter 13: Looking For Liu Laizi</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 13 – Chapter 13: Looking for Liu Laizi<br/><br/>A strange girl arrived at Liujiacun.<br/><br/>This child had dark skin, wore a pair of small sunglasses, and had her hair tied up in a high ponytail, looking quite gallant and giving off a little female bandit vibe.<br/><br/>The people of Liujiacun didn’t recognize this child, but they didn’t think much of it.<br/><br/>With so many villages around, it was common for naughty children to run around from village to village, and adults not recognizing them was normal.<br/><br/>Xiao Jinli stood not far from Widow Niu’s house and saw the snot-nosed, dark-skinned brat in front of the door. She said somewhat speechlessly, “Xiao Zhi, this is the child of the widow Liu Daqiang has been flirting with. She’s even older than Sister Chunhua, and not as pretty. What does he see in her, treating Sister Chunhua that way?”<br/><br/>Xiao Zhi replied, “People’s hearts are unpredictable. Master will have to experience this for themselves! Xiao Zhi is not human!”<br/><br/>Xiao Jinli, “…”<br/><br/>After a while, Xiao Jinli looked around and saw no one else, so she shouted at the child, “Kid, come here!”<br/><br/>Liu Xiaoming heard the shout and looked up. Two thick white streams of snot were about to flow into his mouth. He wiped them with his hand, smearing his face and hand with snot.<br/><br/>Xiao Jinli was disgusted beyond words.<br/><br/>She thought to herself, “How can there be such an unhygienic child? The children of Xiao Family Village are all so clean.”<br/><br/>The children of Xiao Family Village were clean because the unclean ones would be despised by Xiao Jinli.<br/><br/>Therefore, to avoid Xiao Jinli’s disdain, the parents of the children would make sure they were neat and tidy.<br/><br/>Yes, Xiao Jinli was the guiding star of their village.<br/><br/>After wiping his nose, Liu Xiaoming bounced over and asked doubtfully, “Sister, are you calling me?”<br/><br/>Xiao Jinli took out a small bag of Little White Rabbit Candy and said to Liu Xiaoming, “You’re Liu Xiaoming, right?”<br/><br/>“Yes,” Liu Xiaoming replied.<br/><br/>“Do you like these candies?” Xiao Jinli waved the candies in front of him.<br/><br/>Liu Xiaoming gulped and his eyes filled with desire. He said, “I like them! Sister, are these candies for me to eat?”<br/><br/>As he spoke, he reached out to grab them.<br/><br/>Xiao Jinli quickly stepped back and said, “These candies are for you. But you have to promise to do something for me, and I’ll give you this bag of candies.”<br/><br/>Liu Xiaoming’s eyes brightened, and he said, “All right, sister, just say it!”<br/><br/>Xiao Jinli handed Liu Xiaoming an object and said, “Put this somewhere in your mom’s room where she can’t see it. Then, tomorrow morning, I’ll come find you, and you can give it back to me. I’ll bring you more candy tomorrow morning.”<br/><br/>Liu Xiaoming was overjoyed at the thought of more candy the next day.<br/><br/>Xiao Jinli instructed, “But you have to promise me, when you put this thing in your mom’s room, she absolutely cannot find out. Also, if someone asks where you got this candy, just say you found it on the ground, all right? Otherwise, if your family finds out someone gave it to you, they’ll definitely confiscate it, and you won’t have any candy to eat.”<br/><br/>Liu Xiaoming didn’t want to go a day without candy and immediately replied, “Mm-hmm, I understand.”<br/><br/>Afterward, Xiao Jinli walked around Liujiacun and heard one piece of gossip after another.<br/><br/>“Have you heard?”<br/><br/>“Heard what?”<br/><br/>“Yesterday, after Liu Laizi got drunk, he said Liu Daqiang approached him and asked him to sleep with his wife.”<br/><br/>“What?” The villagers listening were shocked. “Has Liu Daqiang gone crazy, looking for someone to put a green hat on him?”<br/><br/>“Humph, he’s been having an affair with Widow Niu Xiaolan from the village entrance, so he wants his betrothal gifts back. Wearing a green hat is nothing to him. It’s just a pity for his wife, Xiao Chunhua. She’s been hardworking and diligent since marrying him, and she’s still looked down upon by her in-laws.”<br/><br/>“Tsk tsk, that’s just fate!”<br/><br/>…<br/><br/>Xiao Jinli went directly to Liu Laizi’s house.<br/><br/>Liu Laizi’s house was easy to find, as it was the only earthen brick and tile house in the village, dark and gloomy.<br/><br/>However, most rural houses have walled yards.<br/><br/>Xiao Jinli didn’t plan to take the courtyard door, she looked around, sprinted from a distance, jumped onto the wall, and leaped into the yard.<br/><br/>Xiao Jinli directly found Liu Laizi’s room. At this moment, he was sprawled on the bed. After a while, he turned over, switched to a blackened pillow, and muttered, “Mmm, so fragrant! Xiao Chunhua is really fragrant!”<br/><br/>Xiao Jinli’s face darkened.<br/><br/>She stepped forward, raised her little hand, and gave him two hard slaps.<br/><br/>“Who, who, who hit me?”<br/><br/>Liu Laizi jerked up from the bed.<br/><br/>“It’s your Auntie here!”<br/><br/>Xiao Jinli stood at the head of the bed, her aura cold and fierce.<br/><br/>When Liu Laizi saw a young girl suddenly appear in his room, he was first startled, and then asked, “You this child, how did you come to my room? Whose child are you?”<br/><br/>As he finished speaking, a joyful and lewd smile appeared on his face, he opened his arms and lunged at Xiao Jinli, excitedly saying, “No matter whose child you are, since you’re here, play with me first!”<br/><br/>Xiao Jinli’s little face became solemn, a fierce light flashing in her eyes.<br/><br/>She coldly said, “Fine, today, this Auntie will play with you first!”<br/><br/>As Liu Laizi lunged at Xiao Jinli, she lifted her foot and swiftly kicked him in his lower body.<br/><br/>“Ah!”<br/><br/>Liu Laizi let out a miserable scream, covering the kicked area with both hands, cold sweat on his forehead. He still glared at Xiao Jinli and yelled, “You little bitch, I’ll kill you! No, I’ll rape and then kill you!”<br/><br/>Having said that, completely disregarding the pain, he stretched out one hand toward Xiao Jinli’s hair and the other to slap her face.<br/><br/>Xiao Jinli’s head tilted slightly, and Liu Laizi’s hand brushed past her ear. Then, this arm was quickly grabbed by a small hand.<br/><br/>Liu Laizi tried to shake her off, but the hand gripping his arm was like a pair of pliers, tightly clamping his arm.<br/><br/>Liu Laizi’s expression turned fearful.<br/><br/>Before he could react, a slap slammed across his face, and half of his face swelled and turned red.<br/><br/>As if that wasn’t enough, his throat was then grabbed by someone.<br/><br/>He couldn’t breathe for an instant!<br/><br/>His entire face turned red and purple.<br/><br/>Liu Laizi appeared scared and uneasy.<br/><br/>For the first time, he felt the taste of death.<br/><br/>This child, shorter than his shoulder, possessed incredible strength, and emanated evil energy that made him shiver.<br/><br/>“De…demon!”<br/><br/>With his throat being clamped, he finally squeezed out a few words.<br/><br/>“Demon? Hehe…” A cold laughter and imposing aura that didn’t belong to her age emerged on Xiao Jinli’s face. She coldly said, “Liu Laizi, those who do evil things will suffer retribution. Now, it’s your retribution! Speak, why did you conspire with Liu Daqiang to frame and wrong Xiao Chunhua?”<br/><br/>Liu Laizi came to his senses.<br/><br/>“You… you’re here to avenge Xiao… Chunhua? You… who are you to Xiao… Chunhua…?”<br/><br/>As soon as he finished speaking, he felt his throat clamped even tighter, making it impossible to catch his breath.<br/><br/>Then he heard a devilish voice.<br/><br/>After a while, Xiao Jinli clapped her hands and walked out of Liu Laizi’s house.<br/><br/>Of course, she still went over the wall to leave the courtyard.\t\t\t\t\t\t</div>", "images": {}, "success": true}