{"id": 15, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14100675.html", "title": "Chapter 15 - Chapter 15: Chapter 15: The Truth Revealed 1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 15 - Chapter 15: Chapter 15: The Truth Revealed 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 15: Chapter 15: The Truth Revealed 1<br/><br/>Translator: 549690339<br/><br/>The Liu Family didn’t believe that Xiao Chunhua was carrying a son at all.<br/><br/>Old Lady Liu exclaimed in disbelief, “A son? How is that possible? We had Granny Yuan from Ten Li Village come over to have a look, and she clearly said that the child in that wretched woman’s stomach was a bad deal!”<br/><br/>As soon as she finished speaking, Auntie Xiao seemed to understand everything in an instant.<br/><br/>“Well, now I get it.” She pointed at the Liu Family and shouted, “You think Chunhua is carrying a girl, so you don’t want this child, and neither does the child’s mother.<br/><br/>But if you divorce Chunhua for no reason, it would be unreasonable and you would have no excuse to ask for the betrothal gifts back. So, you set up Chunhua to have an affair, is that right?”<br/><br/>Liu Daqiang and his family were taken aback, their pupils involuntarily shrinking!<br/><br/>The truth was indeed just like this.<br/><br/>But could they admit it?<br/><br/>Definitely not!<br/><br/>Just as Liu Daqiang was about to refute, Auntie Xiao took out a recording pen and said coldly, “Hmph, don’t be so quick to deny it. I have evidence in my hands, I’m not just making things up!”<br/><br/>“What is this thing?”<br/><br/>Most of the villagers were not highly educated and had never seen a recording pen before.<br/><br/>“This is a recording pen!” Xiao Qingshan explained with some surprise.<br/><br/>“Haha, this is a recording pen?” Many people were curious, “Is it the same thing as a tape recorder? It sounds similar from the name!”<br/><br/>Xiao Qingshan explained, “Yes, it has the same function as a tape recorder.”<br/><br/>Liu Daqiang looked at the so-called recording pen in Auntie Xiao’s hand with confusion.<br/><br/>Liu Bald had a bad feeling about it and said, “What is this thing you’ve taken out, and you even claim it’s evidence! Don’t slander us!”<br/><br/>Auntie Xiao sneered, “Hmph, whether I have wronged you or not, you’ll know when you hear it!”<br/><br/>After she finished speaking, she immediately played the recording pen.<br/><br/>Then, they heard a familiar voice.<br/><br/>“Baby, I missed you so much!”<br/><br/>This voice was Liu Daqiang’s, which both the villagers of Liujiacun and those of Xiao’s Village were familiar with.<br/><br/>“Why is this voice so disgusting . It’s Daqiang’s voice, right? Haha…”<br/><br/>Who would have thought that the next voice would leave everyone speechless.<br/><br/>A woman’s voice with a coquettish tone said, “You dead ghost, we see each other every day, how can you miss me?”<br/><br/>Then, everyone heard a “pop” sound of a kiss, followed by a man’s hoarse and passionate voice,<br/><br/>“I miss you so much, especially down there, I can’t get enough of you. Do you want to touch it?”<br/><br/>“You dead ghost, what you mean by missing me is actually missing that part of me. Hmph, I think all men are just lower body creatures.”<br/><br/>Hearing the voices coming from the recording pen, both the villagers of Liujiacun and those of Xiao’s Village were shocked.<br/><br/>If these two voices were a couple’s bedroom talk, then others would praise them for being affectionate.<br/><br/>But if they were…<br/><br/>The villagers of Xiao’s Village were not familiar with the woman’s voice in the recording pen, but they knew the man’s voice.<br/><br/>It was Liu Daqiang’s voice.<br/><br/>So who was the woman talking with him?<br/><br/>The villagers of Liujiacun were extremely familiar with the woman’s voice. A villager exclaimed in disbelief, “This voice sounds so much like Niu Xiaolan!”<br/><br/>A villager who knew the truth sneered and said, “Not just ‘sounds like’, it’s definitely Niu Xiaolan! I’ve heard long ago that they were fooling around together, and it turns out it’s true!”<br/><br/>As his voice fell, more shocking words emerged from the recording pen.<br/><br/>It sounded like Liu Daqiang was eager to do something with Niu Xiaolan but was stopped by her.<br/><br/>Niu Xiaolan asked, “When are you going to get the betrothal gifts back? When are you divorcing?”<br/><br/>Liu Daqiang replied anxiously, “Soon, soon.”<br/><br/>Niu Xiaolan seemed somewhat annoyed and said, “What do you mean ‘soon’?<br/><br/>How long has it been? At first, when you were supposed to divorce Xiao Chunhua, you said you had to plan it out and see if you could get some money from the Xiao Family.<br/><br/>I’ve been waiting for several months, and my stomach is already three months along. If I wait any longer, someone will find out. I went to the shaman woman and asked, this child is a son, not like the bad merchandise in your wife’s belly.<br/><br/>Luckily, you kicked out that bad merchandise, or else even if you divorced her, there would still be a child, and that would disgust me! Hurry up, or I’ll have the child in my womb aborted.”<br/><br/>Hearing Niu Xiaolan’s threat to abort the child, Liu Daqiang was instantly anxious.<br/><br/>He pleaded, “Baby, baby, don’t rush. Please don’t let anything happen to my son. I… I’ll go to Xiao’s Village tomorrow, yes, tomorrow. I’ll get a hundred thousand yuan back and then give the money to you as betrothal gifts. Will that be enough?”<br/><br/>“Alright, I’ll wait a few more days with your promise. But you have to know, after the first three months, the baby will grow rapidly. If we wait another three months, experienced women will definitely be able to tell that there’s a problem with my belly.”<br/><br/>Liu Daqiang promised, “Okay, okay, I’ll go and get the money tomorrow, just wait. Now, baby, can we go to bed? Your husband can’t wait any longer.” Niu Xiaolan giggled and said, “You dead ghost!”<br/><br/>Immediately afterward, the sounds of their lovemaking were heard.<br/><br/>Everyone present blushed and their hearts raced as they listened to those sounds.<br/><br/>Now, not only the Xiao Family but also the villagers of Liujiacun were at a loss for words.<br/><br/>Niu Xiaolan and Liu Daqiang not only had an affair but also had a<br/><br/>three-month-old child.<br/><br/>This news was too shocking.<br/><br/>“Well, Liu Daqiang, you have an affair and even fathered a bastard child, yet you frame my daughter Chunhua. You vile and ungrateful thing! 1…1’11 fight you to the end!” Xiao Youfu’s face turned livid with anger.<br/><br/>At first, Liu Daqiang was stunned by the conversation that came out of the recording pen.<br/><br/>But when he came to his senses, the other side had already finished playing the recording.<br/><br/>Liu Daqiang refused to admit it, shouting, “No, no! I didn’t do it.” Then, he tried to grab the recording pen.<br/><br/>In fact, trying to snatch the recording pen now was meaningless.<br/><br/>Whatever was going to be played had already been played.<br/><br/>“If it’s not you, then whose voice is it in there?” Xiao Youfu demanded, “If you really did not have an affair, then swear in front of us that the child in the woman’s womb is a bastard and will be dragged away by dogs and cats when born, do you dare?”<br/><br/>Before Liu Daqiang could respond, Old Lady Liu began shouting in anger and frustration, “Xiao Youfu, you curse my grandson! I’m not finished with you!”<br/><br/>Everyone,<br/><br/>Well, there’s no need to question Liu Daqiang anymore, as one of them had already confessed without any prompting.<br/><br/>After saying that, Old Lady Liu took a hoe and swung it at Xiao Youfu!<br/><br/>At this moment, a stern and authoritative voice rang out, “Stop! Stop it! If you don’t stop, I’ll arrest you all!”<br/><br/>Arrest?<br/><br/>Old Lady Liu’s face suddenly revealed a cold smile.<br/><br/>She sneered to herself, “Hmph, we have someone behind us in the Liu Family.<br/><br/>Let’s see who’s going to capture us!”<br/><br/>However, as soon as she turned around, her face changed on the spot!\t\t\t\t\t\t</div>", "images": {}, "success": true}