{"id": 18, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14100682.html", "title": "Chapter 18 - Chapter 18: Chapter 18: Red Peak Mountain", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 18 - Chapter 18: Chapter 18: Red Peak Mountain</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 18: Chapter 18: Red Peak Mountain<br/><br/>Translator: 549690339<br/><br/>Not only is Red Peak Mountain the highest peak around Xiao Family Village, it’s also a notorious primordial forest in Qing County, fraught with dangers for those who don’t take precautions before entering.<br/><br/>“Jinli, where are you off to?”<br/><br/>At the foot of Red Peak Mountain, villagers seeing Xiao Jinli on the road asked.<br/><br/>With a smile, Xiao Jinli replied, “I’m going to the mountain to see if I can find any wild chickens or rabbits. I fancy some game meat today.”<br/><br/>Upon hearing this, the villagers burst out laughing, “Haha, your luck is always so good. While others may search the mountain high and low without finding a single chicken, Jinli can always find wild chickens and rabbits rushing towards her. If they don’t run into a tree, they’re already injured by other animals.”<br/><br/>One of the villagers chimed in, “I envy your luck. Jinli, if you find any spare wild chickens or rabbits could you sell one to us? My naughty boy is also craving for them, and I don’t know what else to feed him.”<br/><br/>Once one person spoke up, the other villagers began to say, “Jinli, if you have extras, do sell one to my family too.”<br/><br/>Listening to their requests, Xiao Jinli tilted her head slightly and held up two fingers, “Today, I can probably only find two wild chickens at most.”<br/><br/>So, she could only spare one wild chicken to be distributed.<br/><br/>“Then I’ll have to wait for the next time. Jinli, I’m pre-ordering for the next time!”<br/><br/>Even though they live at the foothill, wild game is not an everyday occurrence.<br/><br/>Now that life has improved, people are less focused on hunting in the mountains to obtain basic necessities for life.<br/><br/>Now, those who hunt on the mountain do so purely for the taste of game meat.<br/><br/>But there are strict laws by the government. Hunting many wild animals is illegal and the punishment is imprisonment.<br/><br/>Rural people do not know which wild animals may be hunted and which are not. If they inadvertently break the law, it would be too late for regrets.<br/><br/>The most famous case happened when a college student caught a few birds in the mountains, only to be reported for capturing endangered species protected by law. One year of imprisonment for each bird, he was sentenced to eleven years in total.<br/><br/>After this case occurred, the village head held a village-wide meeting to sternly warn everyone, not to hunt arbitrarily in the mountains, as the consequences could be severe.<br/><br/>Of course, they could hunt wild chickens and rabbits, but these animals were not always available.<br/><br/>Only Xiao Jinli had such luck; every time she went to the mountain, she ended up finding something. Yes, literally coming across.<br/><br/>She could easily find things that others couldn’t hunt.<br/><br/>Xiao Jinli didn’t know what the villagers thought of her, but she suddenly felt like taking a trip to the mountain today.<br/><br/>Also, she really did crave some wild game today.<br/><br/>However, whenever she went to the mountain, she was always alone. She did not like others following her, especially those mischievous children.<br/><br/>Apart from the initial period when Xiao family members and villagers went up the mountain with her out of concern, they gradually started feeling reassured after several times finding Xiao Jinli returned from the mountain safe and sounu.<br/><br/>Because, they had seen a ferocious wild boar run away at the sight of Xiao Jinli.<br/><br/>A creature can only run away out of fear and terror, right?<br/><br/>But how did they prove that?<br/><br/>Ha, because several villagers went up the mountain to pick mushrooms, they encountered a wild boar. As the boar charged at those villagers, they immediately ran away. Later somehow, Xiao Jinli appeared, and while the panicked villagers were simultaneously trying to flee and protect Xiao Jinli, the boar turned and ran away at the sight of her.<br/><br/>At first, the villagers were confused, then they reacted, uttering incredulously, “Has that wild boar really run away?”<br/><br/>“Did it really?”<br/><br/>One villager sighed in relief and said with a laugh, “I guess it must have run away after seeing Jinli. After all, she’s the lucky star, protected by the God of Fortune. Even ferocious beasts run away when they see her. Haha, we probably don’t need to worry about Jinli’s safety in the future.”<br/><br/>But another villager fretted again, “But what if she encounters more dangerous animals, like tigers?”<br/><br/>Xiao Jinli confidently declared, “Don’t worry, Second Uncle. I’m someone protected by the God of Fortune. All wild beasts will hide when they see me.”<br/><br/>The villagers, ‘<br/><br/>Despite their concerns, they had been living in the village for so long without ever seeing ferocious wild beasts like tigers and lions, so they should be fine.<br/><br/>However, Xiao Jinli went up to the mountain a few more times, and each time she returned safely, the villagers finally felt relieved.<br/><br/>What surprised them even more was that each time Xiao Jinli went to the mountain, there was always some game animal to be found.<br/><br/>Sometimes she would give some to the villagers, but after repeated instances, the villagers felt embarrassed receiving for free, so they gave her money instead. Xiao Jinli did not refuse the offers.<br/><br/>After all, gratitude is shown by bags of rice, enmities by measures of rice!<br/><br/>Like usual, Xiao Jinli went into the mountain.<br/><br/>There were narrow mountain paths around the boundary of the deep mountain, made by villagers, but further in, the paths disappeared. Thorns or spiky grasses were everywhere, occassionally bugs and snakes would jump out of the grass, frightening any passerby. There were also some pointed pebbles, or small pits.<br/><br/>Anyway, it was very difficult to move forward.<br/><br/>But Xiao Jinli was able to walk through effortlessly.<br/><br/>She arrived at the mountain top quickly.<br/><br/>At the top, there stood a giant pine tree, towering into the sky.<br/><br/>Below was a clear ground covered with gravel and a few scattered weeds.<br/><br/>Looking up, one could see a huge rock standing tall, like a proud lion, magnificent and dominating, roaring towards the sky.<br/><br/>The air here is fresh, the scenery like a painting, and it’s all quiet with no one around to disturb.<br/><br/>This is Xiao Jinli favorite spot to relax.<br/><br/>Upon reaching the mountaintop, she looked up at the giant pine tree reverently, her eyes glittering. After a moment, her right ring finger dripped a few drops of a clear liquid. She poured it over the tree roots with a smile.<br/><br/>After that, she patted the giant trunk of the pine tree and said, “Old friend, I’ve brought you more food. Enjoy!”<br/><br/>The giant pine tree swayed, thousands of branches making a rustling sound, as if responding to her.<br/><br/>Then, the needle-like leaves of the tree began to grow more robustly at a speed visible to the naked eye, becoming greener.<br/><br/>A moment later, Xiao Jinli rolled up her sleeves and jumped directly to the tree trunk. She climbed up to a fork in the branches in just a few moments. The fork was spotlessly clean, and no insects could be seen on the whole tree.<br/><br/>At first, Xiao Jinli sat on the tree fork, looking far into the distance where not just the Xiao Family Village, but the entire Qing County was within her sight.<br/><br/>Overlapping hills, lush trees, and visible houses.<br/><br/>What a magnificent view, making other mountains seem insignificant!<br/><br/>After a while, she laid down on the tree fork, closing her eyes. With her long eyelashes resting on her young and innocent face, she looked so innocent and beautiful.<br/><br/>After an unknown period, Xiao Jinli’s ears twitched and her eyes snapped open.<br/><br/>Something was moving!\t\t\t\t\t\t</div>", "images": {}, "success": true}