{"id": 19, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14106513.html", "title": "Chapter 19 - Chapter 19: Chapter 19: The Murder Scene", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 19 - Chapter 19: Chapter 19: The Murder Scene</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 19: Chapter 19: The Murder Scene<br/><br/>Translator: 549690339<br/><br/>“Chase, hurry and chase him! He went that way! With wounds so severe, he won’t get far!”<br/><br/>A man’s vicious voice reached Xiao Jinli’s ears.<br/><br/>Immediately after, two sets of hurried footsteps came from the direction of the summit.<br/><br/>One set was urgent and panicked, while the other was just as urgent but orderly.<br/><br/>Su Yichen was holding onto his shoulder wound, and fresh blood continued to seep out from it. His face and white shirt were covered in bloodstains. The swelling and bruising on his face made it hard to recognize him.<br/><br/>He didn’t know how long he had been running, and now had no strength left to keep running.<br/><br/>When he reached the summit, there was a giant pine tree. nothing else but a steep cliff in front of him.<br/><br/>There was nowhere left to run.<br/><br/>Standing on the edge of the cliff, he saw the figures coming closer and closer, and his eyes couldn’t help but show despair.<br/><br/>Was he really going to die here?<br/><br/>He couldn’t accept it!<br/><br/>He was only 18 years old.<br/><br/>He still had a long life ahead of him, but because of those despicable villains, his life would end here.<br/><br/>The people chasing him caught up quickly.<br/><br/>They were four ferocious men, filled with murderous intent.<br/><br/>Each of them held a gun in their hand, their clothes were somewhat disheveled, but not as miserable as the young man in front.<br/><br/>“Haha, Young Master Su, you run, you run. Why don’t you run anymore?”<br/><br/>The man with the roughest appearance, a square face, and a beard, had a knife scar on his face, and was a one-eyed dragon. He had a ring in his nose, looking like a bull demon king, extremely vicious, and frightening to look at. He was the leader among the four men.<br/><br/>“Young Master Su, I suggest you give up and surrender. You can suffer less if you do, otherwise, Young Master Su, your delicate body might not be able to bear our treatment.”<br/><br/>“Hahaha…”<br/><br/>In the face of these four vicious men, Su Yichen did not choose to beg for mercy. The pale look on his face was replaced with a calm expression. Then he asked, “I just want to know, who wants me dead so badly?”<br/><br/>The one-eyed dragon kidnapper laughed aloud, “Young Master Su, you’ve always been smart, outstanding among your peers. Don’t you already know who wants you dead so desperately?”<br/><br/>Su Yichen let out a miserable laugh, his eyes becoming red, “Why? Why is he doing this to me?”<br/><br/>The one-eyed kidnapper showed sympathy on his face, and laughingly said,<br/><br/>“Young Master Su, your existence is blocking his path, don’t you know that?”<br/><br/>On hearing this, hatred and fury filled Young Master Su’s eyes. He suddenly roared, “So what if I’m dead? Does he really think he’ll get everything from the Su Family just like that? He’s dreaming! Hahaha…”<br/><br/>The kidnapper frowned and said coldly, “Young Master Su, we don’t care about your family’s affairs. We only take money and do our job. You should give up and surrender. Our employer prefers to send you to Africa as a slave… Tsk tsk, some people really hate you, enough to want you dead.”<br/><br/>The kidnapper pointed his weapon at Su Yichen.<br/><br/>At this point, Su Yichen was desperate. He showed a hint of refusal in his eyes, “Surrender? Haha… I would rather die. Take my body back and explain to that beast.”<br/><br/>As he finished speaking, he turned around and jumped off the cliff.<br/><br/>But as soon as he turned around, he passed out.<br/><br/>The four kidnappers’ pupils contracted sharply, and their faces revealed a high level of alertness as they looked around.<br/><br/>Su Yichen didn’t pass out on his own. Instead, he was knocked out by a tree branch that suddenly flew over and hit his back.<br/><br/>Having been fugitives for a long time, they quickly realized that it wasn’t an accident, but someone had deliberately done it.<br/><br/>Then, there was an eerie laughter that echoed in all directions in the open summit.<br/><br/>The one-eyed dragon’s face changed drastically and shouted, “Who is it? Come out! Stop playing tricks!”<br/><br/>The four kidnappers looked around but couldn’t locate the source of the laughter. Panic began to seep into their faces.<br/><br/>These four vicious men had committed countless murders over the years and even enjoyed torturing their victims. They didn’t believe in the existence of ghosts.<br/><br/>If there really were ghosts, all the people they had tortured and killed would have come back to haunt them as vengeful spirits.<br/><br/>But in this desolate wilderness…<br/><br/>A tall, thin man shouted in panic, “Ghosts, there must be ghosts! They’ve come for revenge! They’ve come to take vengeance on us!”<br/><br/>The other three were suspicious of ghosts but didn’t truly believe in their existence.<br/><br/>Another one admonished him, “Fourth Brother, calm down. There are no ghosts in this world, only people trying to scare us, right?”<br/><br/>Fourth Brother was still panicking. “Second Brother, tell me, we’re standing here on the summit in the middle of the wilderness. Where did that laughter come from? Even if someone is here, how did they time our arrival? The people we killed in the past must have followed us here; they’ve come to take revenge on us!”<br/><br/>As the saying goes, a guilty conscience needs no accuser.<br/><br/>They had killed too many people over the years, and now they couldn’t help but feel guilt haunting them.<br/><br/>The one-eyed dragon shouted at him, “What are you afraid of, Fourth Brother?<br/><br/>If I can kill them while they’re human, I can kill them while they’re ghosts too. There’s nothing to be afraid of! ”<br/><br/>As soon as he finished speaking, the eerie laughter rang out again, and even delivered a message. The voice was ethereal, like a whisper from the void.<br/><br/>“Hehe, that’s right, you’re not afraid of killing people, so why be afraid of ghosts? That’s why we’ve come back as vengeful spirits to take revenge on you!”<br/><br/>The laughter finished, and a cold wind blew over the summit and the surrounding trees, making them creak and groan.<br/><br/>Although it was summer, the one-eyed dragon and the others felt cold to their bones.<br/><br/>The men couldn’t stay calm. Was it a real ghost?<br/><br/>If someone was pretending, how could the wind be so chilling?<br/><br/>Their faces turned pale, and their lips trembled.<br/><br/>Fifth Brother suddenly held his head and abruptly shouted, “I need to leave, I need to leave!”<br/><br/>He then tried to run down the mountain.<br/><br/>But before he could even take a few steps, he turned back, his face stricken with terror. His legs shook uncontrollably, unable to take a step as if something was holding him in place.<br/><br/>“Tigers ! ”<br/><br/>The one-eyed dragon was shocked to see the tigers in front of them.<br/><br/>Not just one tiger, but two – one yellow and one white.<br/><br/>“What the hell kind of place is this? Why is it so strange?” Second Brother shouted, looking around, his eyes fixated on the tigers. “Whether you are ghosts or humans, we are not afraid of you! If we can kill people, we can kill ghosts too!”<br/><br/>Suddenly, there was a series of clapping sounds..\t\t\t\t\t\t</div>", "images": {}, "success": true}