{"id": 16, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14100676.html", "title": "Chapter 16 - Chapter 16: Chapter 16: The Truth Revealed 2", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 16 - Chapter 16: Chapter 16: The Truth Revealed 2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 16: Chapter 16: The Truth Revealed 2<br/><br/>Translator: 549690339<br/><br/>Wearing uniforms, the Yamen staff escorted Liu Laizi with handcuffs on his hands.<br/><br/>Only those suspected of illegal crimes would be handcuffed.<br/><br/>A very bad premonition suddenly rose in the hearts of the Liu family members.<br/><br/>The villagers of Liujiacun had a slightly puzzled expression on their faces.<br/><br/>“Why is Liu Laizi handcuffed?” A villager from Liujiacun asked in confusion.<br/><br/>“Yeah, even though Liu Laizi is a bit lazy and loves to drink, he hasn’t done anything terrible.”<br/><br/>“That’s right, why would people from the Yamen come, and with Liu Laizi too?”<br/><br/>Liu Bald saw the people from the Yamen, handed the hoe to his wife, and immediately ran over. He took out a pack of cigarettes from his pocket, took out two, and planned to hand one to each of them.<br/><br/>He asked with a flattering smile, “Comrades, you’ve worked hard. Have a cigarette! ”<br/><br/>But he was sternly rejected.<br/><br/>The Yamen staff solemnly said, “During work hours, we strictly prohibit casually making connections!”<br/><br/>Liu Bald’s expression stiffened for a moment, but he still bowed and asked, “Actually, I just wanted to ask if Deputy Director Liu is busy today?”<br/><br/>The meaning was very clear – I know your Director Liu.<br/><br/>Of the two Yamen staff who had come, one was surnamed Guan and the other Li.<br/><br/>The two frowned slightly, “Deputy Director Liu, Liu Yang?”<br/><br/>Liu Bald immediately excitedly said, “Yes, yes, yes, it’s Liu Yang. He’s my good brother! ”<br/><br/>He thought that by revealing this relationship, he’d be able to ingratiate himself with the two staff members.<br/><br/>But Officer Li’s words felt like pouring a bucket of cold water directly on top of his head.<br/><br/>He said, “Oh, Liu Yang was taken away by the Disciplinary Inspection<br/><br/>Department this morning for alleged corruption and bribery!”<br/><br/>Liu’s wife was shocked and couldn’t accept it. She couldn’t believe it and said,<br/><br/>“How can this be! He just came to our house for dinner yesterday!”<br/><br/>Liu Yang was their biggest supporter in Liu Family Village.<br/><br/>In the past, their domestic violence against Xiao Chunhua had been fearless, all because of Liu Yang’s backing.<br/><br/>But now, Liu Yang was arrested in the blink of an eye.<br/><br/>Officer Guan didn’t want to explain to them. He said sternly, “Now is our working time, not the time for chatting!”<br/><br/>After that, he swept his fierce gaze over the crowd and asked sharply, “Which one of you is Liu Daqiang?”<br/><br/>Everyone’s eyes fell on Liu Daqiang.<br/><br/>Liu Daqiang’s heart instantly became flustered.<br/><br/>He stuttered in response, “I… I am Liu Daqiang. May I ask… what’s the matter?”<br/><br/>Officer Guan said solemnly, “We’ve received a report accusing you of domestic violence, assault, and slander. Please come with us to assist in our investigation!”<br/><br/>Liu Daqiang’s face immediately turned pale, and he stuttered nervously, “Officer, you must have gotten it wrong. I… I was framed. Don’t just believe others.”<br/><br/>Xiao Dafu charged over and said loudly, “You were framed? That’s a joke. My girl Chunhua was beaten by you until she miscarried and was left with only half her life. She was in the hospital for a day, barely escaping the gates of hell.<br/><br/>Having said that, Xiao Youfu turned to the two Yamen staff and said, “Comrades, Liu Daqiang and his family are well-known for beating my daughter Chunhua until she miscarried and couldn’t get out of bed, and she was in the hospital for a day and a night. Everyone here is a witness! Please arrest all of them! The three of them were all the assailants!”<br/><br/>Officer Guan immediately reassured him, “Old fellow, don’t worry. We know about this! Rest assured, we will not let any criminals go.”<br/><br/>Officer Guan then turned to Liu Daqiang and said, “Liu Daqiang, Liu Bald, you two are suspected of setting up and brutally assaulting others. The evidence is conclusive. Please come with us to the Yamen.”<br/><br/>Liu Bald’s face instantly turned pale, and he stuttered, “Officer… is there a mistake?”<br/><br/>Officer Li sneered, “No mistake. This Liu Laizi came to surrender early this morning and said that, thinking that his daughter-in-law Xiao Chunhua was pregnant with a girl, Liu Daqiang hooked up with a widow in the village who also became pregnant. They consulted a shaman woman and confirmed the child in the widow’s belly was a boy.<br/><br/>Afterward, they planned to kill the baby in their daughter-in-law’s womb and drive her out. They asked Liu Laizi for help, paid him 500 yuan, drugged Xiao Chunhua, and had Liu Laizi raped her. Then they staged a scene of catching adultery and beat Xiao Chunhua with their fists and feet.”<br/><br/>As Officer Li’s words fell, anger showed up on the faces of everyone in Xiao Family Village.<br/><br/>Even the villagers from Liujiacun, who had come with the Liu family, were amazed and began to feel angry and scared.<br/><br/>“It turns out they were so ruthless to Xiao Chunhua just because they wanted a son or grandson. These people are simply animals!”<br/><br/>“Calling them animals is an overstatement. They are not even comparable to animals! What’s wrong with having a daughter? Is she not their own child? Besides, how could they know whether the child in Chunhua’s stomach was a boy or a girl before it was born?”<br/><br/>“Haha, they believed the words of a shaman woman, thinking that the widow’s child was a boy. This is absurd. In this day and age, who would still be this superstitious? Besides, isn’t doing a B-ultrasound the most accurate way to determine the baby’s gender?”<br/><br/>“In this day and age, what’s wrong with having a girl? Can’t a girl be filial to her parents?”<br/><br/>The villagers of Liujiacun also found the actions of the Liu family incomprehensible.<br/><br/>“Are Liu Bald and his wife insane? Even if the child in Xiao Chunhua’s belly is a<br/><br/>girl, they can just have another one after she’s born.”<br/><br/>Rural people generally have a more conservative mindset, valuing sons over daughters. However, most families would still give birth to the girl and then have another child afterward.<br/><br/>Don’t they see that in most rural families nowadays, there are more than two children?<br/><br/>“I think they must have gone crazy thinking about having a son or grandson, that’s why they resorted to such outrageous acts. Otherwise, the Yamen staff wouldn’t have come to arrest them today.”<br/><br/>At this point, a villager realized something and his face immediately changed.<br/><br/>He said, “Since we came with them today, the Yamen staff won’t think we’re accomplices, will they?”<br/><br/>Other villagers caught on, and their expressions turned ugly.<br/><br/>“They shouldn’t. We… we came here and didn’t do anything.”<br/><br/>The faces of Liu Bald and his family members turned bloodless in an instant.<br/><br/>Liu Daqiang stared at Liu Laizi furiously and yelled, “Liu Laizi, you son of a bitch, how dare you betray us!”<br/><br/>With that, he swung a fist at Liu Laizi’s face.<br/><br/>Officer Guan sternly shouted, “What are you doing, still trying to hit people? If you have the energy to hit someone, then come with us.” With that, he handcuffed both Daqiang and Liu Bald.<br/><br/>Liu’s wife tried desperately to stop them but to no avail.<br/><br/>She wept and cried, “We are innocent, we have been framed…”<br/><br/>But no one listened to her..\t\t\t\t\t\t</div>", "images": {}, "success": true}