{"id": 11, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14099732.html", "title": "Chapter 11 - Chapter 11 – Chapter 11: Running By Crawling And Rolling", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 11 - Chapter 11 – Chapter 11: Running By Crawling And Rolling</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 11 – Chapter 11: Running by Crawling and Rolling<br/><br/>Liu Bald wanted to snatch the iron shovel, but he couldn’t move it again.<br/><br/>He was secretly shocked in his heart.<br/><br/>After glaring at Xiao Jinli, he raised his head and scolded Xiao Youfu, “We all caught Xiao Chunhua on the spot, and you still want to argue. I tell you, the marriage between my son and your daughter is over, and the 98,000 betrothal gifts, you must return them to me.”<br/><br/>Without returning the money, how could Liu Daqiang marry again?<br/><br/>Xiao Youfu also stubbornly said, “I’d have ended this marriage even if you hadn’t brought it up. My precious daughter married into your Liu Family and returned covered in bruises. How could I let her stay in the Liu Family? If there’s a next time, my daughter and I might not even see each other alive because you would have killed us.”<br/><br/>Xiao Jinli picked up the iron shovel and stabbed it directly towards Liu Bald’s face. Liu Bald’s face changed, and he instinctively dodged backward. One foot stepped on a rock, and he fell to the ground again, supporting himself with both hands, his face full of terror!<br/><br/>He asked fearfully, stuttering, “Wha… What do you want to do?”<br/><br/>The sharp iron shovel stopped less than a centimeter away from his nose.<br/><br/>Xiao Jinli coldly said, “If you keep talking nonsense here, I’ll beat you up, break your legs, and leave you bedridden for months.”<br/><br/>Of course, she wasn’t just scaring them.<br/><br/>When pushed too far, she really could beat them badly enough to leave them bedridden for months.<br/><br/>Baldy Liu and Liu Daqiang, the father and son, were almost scared to tears by Xiao Jinli’s fierce and intimidating aura.<br/><br/>Is this even a child?<br/><br/>It’s more like a devil!<br/><br/>“Get lost!”<br/><br/>Xiao Jinli spat out another word coldly.<br/><br/>Regaining their senses, Liu Bald and his son shamelessly scurried away, crawling and rolling.<br/><br/>They even left behind the iron shovel and hoe.<br/><br/>Upon seeing the two retreating figures, the villagers of Xiao Family Village finally breathed a sigh of relief, and the atmosphere lightened up a bit.<br/><br/>But when they thought of Xiao Chunhua’s situation, a worried look appeared on the villagers’ faces.<br/><br/>“Jinli, will Chunhua be okay?”<br/><br/>They instinctively asked Xiao Jinli.<br/><br/>Because Xiao Jinli was the Lucky Star of their village, as long as she said it was alright, it would definitely be alright.<br/><br/>Unconsciously, the not yet ten-year-old Jinli had become the backbone of the Xiao Family Village, even surpassing Village Head Xiao Changgui.<br/><br/>Xiao Jinli shook her head.<br/><br/>The villagers’ faces immediately changed, thinking that Xiao Jinli meant no.<br/><br/>Xiao Jinli said somewhat speechlessly, “I mean, Sister Chunhua should be okay.”<br/><br/>Xiao Youfu and the villagers let out a big sigh of relief.<br/><br/>At this moment, the Village Chief’s phone rang.<br/><br/>“Qing Shan, what, okay, okay, I got it!”<br/><br/>After hanging up the phone, the Village Chief told Xiao Youfu, “Afu, you should hurry to the hospital. Qing Shan called, they met the ambulance halfway. After Chunhua was put onboard, the doctor gave her emergency treatment and then rushed her to the emergency room.”<br/><br/>Xiao Youfu panicked and said, “Okay, okay, I’ll go now!”<br/><br/>The Village Chief worried that Xiao Youfu might get into an accident if he rode his motorbike there, so he arranged for a young man to give him a ride.<br/><br/>Seeing Xiao Youfu’s anxious and hurried figure, the villagers’ faces showed some concern.<br/><br/>Involuntarily, everyone’s eyes turned to Xiao Jinli again.<br/><br/>Xiao Jinli, “…” She is a person, not a god, she can’t predict the outcome.<br/><br/>Xiao Jinli thought for a moment and said, “Uncle Village Chief, I’m worried that the Liu Family will still cause trouble. Before Sister Chunhua wakes up, it’s best to send someone to Liujiacun now to check what’s going on, so we can vindicate Sister Chunhua after the investigation is clear.”<br/><br/>The Village Head nodded in agreement, “You’re right, I’ll arrange it now!”<br/><br/>Then, the Village Head asked doubtfully, “Jinli, do you really think there’s a problem with the Liu family? Chunhua…”<br/><br/>Xiao Jinli somewhat speechless said, “Uncle Village Chief, what kind of person Sister Chunhua is, even if others don’t know, don’t the people in our village know? Sister Chunhua must have been wronged. As for why the Liu Family suddenly wronged Sister Chunhua and started to beat her, there must be something going on.”<br/><br/>The Village Head nodded immediately, “Alright, I understand. Jinli, you can leave this to me, you’ve worked hard, now go rest!”<br/><br/>Xiao Jinli nodded, “Alright, then I’ll head home!”<br/><br/>“Jinli, my family is cooking a braised fish, come have dinner at my house tonight!”<br/><br/>“Jinli, my family is cooking your favorite braised pork, come have dinner at my house.”<br/><br/>Xiao Jinli shook her head and laughed, “No need, my mom made braised beef brisket with radish at home, I’ll be eating there!”<br/><br/>After a while, Xiao Jinli went home.<br/><br/>The rest of the matter could be left to the Village Head to arrange.<br/><br/>Soon after, Xiao Jinli arrived in front of a small western-style villa, the faint scent of beef wafting out.<br/><br/>Xiao Jinli took a deep breath and had an innocent, happy smile that only children possess.<br/><br/>“It smells so good!”<br/><br/>Pushing the courtyard door open, Xiao Jinli shouted, “Mom, I’m back!”<br/><br/>Then, a young and beautiful woman in her thirties, wearing an apron, ran out.<br/><br/>This was Xiao’s mother, and in fact, she was already over forty.<br/><br/>Xiao’s mother smiled gently, “Jinli, you must be hungry, your mom is stewing beef brisket, it’ll be ready soon. Go watch TV in your room and have some fruit to fill your stomach!”<br/><br/>Xiao Jinli laughed and said, “I’ll go back to my room and read for a while, I’ll come out when mom finishes cooking.”<br/><br/>Xiao’s mother replied, “Alright. Oh, by the way, make a call to your dad and brother, and tell them to come home for dinner.”<br/><br/>“Sure!” Xiao Jinli answered cheerfully.<br/><br/>Then, she jumped and ran back to her room, picked up her cell phone, and made a call to her working father.<br/><br/>As soon as the call was answered, a gentle voice from the other side happily asked, “My baby girl, what’s up?”<br/><br/>Xiao Jinli said, “Dad, mom made beef and radish stew today, you and my brother hurry back for dinner.”<br/><br/>“Alright, your brother and I will be right back. Baby girl, wait for your dad, okay? Mom and Dad!”<br/><br/>Xiao Jinli, “…”Daddy is so immature.”<br/><br/>After hanging up the phone from her father, Xiao Jinli spread out on the bed with her arms and legs wide open, closed her eyes and said, “Xiao Zhi, track Liu Bald and Liu Daqiang’s cellphones, and give me feedback on the information about them beating Xiao Chunhua!”<br/><br/>“Yes, Master!”<br/><br/>A childish voice rang in Xiao Jinli’s mind.<br/><br/>A moment later…<br/><br/>“Ding Ding, Master, Xiao Zhi has detected that Liu Daqiang is currently on a call with someone, do you want to eavesdrop?”<br/><br/>“Yep!”<br/><br/>Liu Daqiang’s voice then entered Xiao Jinli’s ears.<br/><br/>“Lanlan, don’t worry, I will definitely make them send the money over, and then go to your house to propose marriage. Oh dear, baby, don’t cry, it breaks my heart.”<br/><br/>Xiao Jinli’s little face darkened!\t\t\t\t\t\t</div>", "images": {}, "success": true}