{"id": 12, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14099735.html", "title": "Chapter 12 - Chapter 12 – Chapter 12: Investigating The Truth", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 12 - Chapter 12 – Chapter 12: Investigating The Truth</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 12 – Chapter 12: Investigating the Truth<br/><br/>The next morning, the Village Head and Xiao Youfu’s two brothers came to Xiao Jinli’s house.<br/><br/>Xiao Mother was cleaning the yard and watering the flowers and plants.<br/><br/>Seeing them, she immediately put down her work and greeted them with a smile, “Village Head, why are you guys here so early? Are you here to see my daughter, Jinli? She went for a run and will be back later. Is there something urgent? If it is, I can give her a call, and she can come back earlier.”<br/><br/>Although Xiao Jinli was young, she was strict with herself. She would go for a run every day no matter the weather, and wake up at 5 o’clock in the morning!<br/><br/>The three men directly sat on the stone benches in the yard and waved their hands, saying, “No need, we can wait. She should be back soon.”<br/><br/>As the Village Head spoke, he took out his cellphone to check the time.<br/><br/>Xiao Mother poured them each a glass of water.<br/><br/>She also took a seat, looking serious, and asked, “Village Head, is this about Chunhua’s situation?”<br/><br/>The Village Head nodded, “Yes. I have made some phone calls and asked some relatives and friends from Liujiacun.<br/><br/>They told us that before Chunhua got caught cheating, there was no rumor in the village about her being unfaithful or flirting with men.<br/><br/>She was suddenly caught cheating, and it was Liu Bald and his son who brought a large group of people and found Chunhua in bed with a leper from their village.”<br/><br/>Xiao Mother sighed lightly, “Chunhua, everyone in our village knows she is an honest person. How could she cheat on her husband, and with a leper? Who would believe that?”<br/><br/>“That’s the strange part. But there are rumors in the village that Liu Daqiang is having an affair with a young widow. Some people have seen Liu Daqiang coming out of the widow’s house in the early morning.”<br/><br/>Xiao Mother was shocked, and said apprehensively, “So it wasn’t Chunhua who cheated, it was Liu Daqiang. But why did he frame and wrong Chunhua?”<br/><br/>“Why? It must have been for the betrothal gift!”, said Xiao Youlu, Chunhua’s uncle, with anger. “Only by tarnishing our Chunhua’s reputation could they take back the betrothal gifts.”<br/><br/>Xiao YouShou frowned, “But Chunhua’s parents said that when she married into the Liu Family, she already brought sixty thousand yuan of betrothal gifts. On the night of the wedding, the Liu Family took it away. Now they want to get another hundred thousand yuan from her parents. They are shameless.”<br/><br/>Xiao Mother was also angry, “Since they took the betrothal gifts that Chunhua brought, how can they ask for more? It’s too much.”<br/><br/>“They’re taking advantage of the fact that we have no evidence when they took the betrothal gifts on the wedding night. So whatever they say goes,” said Xiao Youlu resentfully, looking as if he wanted to stab the Liu family members.<br/><br/>How hateful!<br/><br/>“How is Chunhua? Is she alright?”, asked Xiao Mother.<br/><br/>Xiao Youlu said, “Chunhua was taken to the hospital yesterday, and she was in the rescue room for seventeen or eighteen hours. The doctor said the surgery was successful, but she’s not out of danger yet. If she wakes up within twenty-four hours, she should be fine. If not… Sigh…”<br/><br/>“Poor girl!”, sighed Xiao Mother, “I hope Chunhua recovers soon.”<br/><br/>After talking for a while, Xiao Jinli came back from her run.<br/><br/>Seeing the three men in her home, she raised her eyebrows.<br/><br/>As soon as the three men saw Xiao Jinli, they looked excited.<br/><br/>“Jinli, just as you suspected, there’s something fishy about Chunhua’s affair,” said Xiao Youlu angrily, “Liu Bald and his son are so despicable and shameless. It was Liu Daqiang who was having an affair, but they blamed Chunhua.”<br/><br/>Xiao Jinli took a seat, and her mother poured her a glass of water.<br/><br/>Xiao Jinli took the water from her mother and drank it all at once, feeling much better.<br/><br/>She nodded, then asked sharply, “So are the claims that Chunhua and a leper from their village were caught in bed together true?”<br/><br/>Xiao YouShou nodded, “Yesterday, Liu Bald and his son brought a group of villagers to catch Chunhua and the leper in bed. Many people saw them lying on the same bed.”<br/><br/>Xiao Jinli tapped the stone table lightly with her fingers, and said, “Now, we have three things to do! First, we need to find out why Chunhua was in bed with the leper and got caught cheating.<br/><br/>In our Xiao Family Village, everyone knows that Chunhua was framed and wronged.<br/><br/>What we need to do now is to find out the truth and gather concrete evidence.<br/><br/>But we have to wait for Chunhua to wake up before we can ask her.”<br/><br/>“Second, since there are rumors about Liu Daqiang having an affair with a widow in Liujiacun’s, what we need to do is find evidence or witnesses.”<br/><br/>“Third, report the case to the police! Accuse Liu Bald and Liu Daqiang of domestic violence and intentional injury, or even attempted murder.”<br/><br/>Xiao Youlu hesitated, “I heard that the Liu Family has connections in the Yamen. I’m afraid it might not work if we report the case directly?”<br/><br/>Xiao Jinli responded, “Uncle Lu, don’t worry for now. Let’s report it first and see how it goes. If it doesn’t work, we’ll figure out another way!”<br/><br/>Xiao Youlu sighed and looked worried, “What will happen to Chunhua after all this? ”<br/><br/>Xiao Mother comforted him, “Chunhua is a good girl, and she has good fortune. She will marry into a good family in the future.”<br/><br/>“Let’s hope so,”, Xiao Youlu was not optimistic.<br/><br/>Xiao Mother glanced at her daughter and smiled, “Didn’t you all say that my daughter is a lucky star? In the future, let Chunhua share some of Jinli’s good fortune, and she will surely be happy.”<br/><br/>“That’s right. With Jinli here, Chunhua will definitely get better.”, said Xiao YouShou, laughing in agreement.<br/><br/>Xiao Jinli,”…” Fine, if her mother wanted her to be the shield, she would be one.<br/><br/>The Village Head nodded, “Okay, I’ll arrange for it right away. It’s just…”<br/><br/>The Village Head was worried and doubtful, “Between villages, people are always keen to protect their village’s reputation. I don’t know how many people would be willing to testify in this case. If there aren’t any, then…”<br/><br/>Being a witness could easily get on people’s bad side.<br/><br/>No one wanted to bring trouble on themselves for no reason!<br/><br/>Xiao Jinli thought for a moment and said, “Uncle Village Chief, leave it to me to deal with this!”<br/><br/>“No!”, the Village Head immediately refused, “How can you handle it? We will take care of it. I think not everyone in Liujiacun is united. We can find some people who don’t get along with Liu Bald’s family and see if they can help!”<br/><br/>“I also think this could work better! We can give it a try!”\t\t\t\t\t\t</div>", "images": {}, "success": true}