{"id": 10, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14099729.html", "title": "Chapter 10 - Chapter 10 – Chapter 10: Little Koi’S Fierce And Overbearing Attitude (Please Comment!!!)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 10 - Chapter 10 – Chapter 10: Little Koi’S Fierce And Overbearing Attitude (Please Comment!!!)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 10 – Chapter 10: Little Koi’s Fierce and Overbearing Attitude (Please Comment!!!)<br/><br/>The villagers of Liujiacun were pale, their expressions somewhat astonished.<br/><br/>Someone asked, “How… how could it be intentional murder?”<br/><br/>These villagers who couldn’t even read, how could they know it was a crime of intentional murder?<br/><br/>Some people looked at Xiao Jinli’s age and didn’t quite believe it.<br/><br/>“No, you’re just a kid, how do you know this is a crime of intentional murder? You must be talking nonsense and trying to deceive us.”<br/><br/>Liu Bald also reacted, glaring at Xiao Jinli, and shouted, “You little brat, how dare you lie to people, I’ll beat you to death!”<br/><br/>As he said that, he picked up an iron shovel and aimed it directly at her head. The people of Xiao Family Village had furious expressions on their faces.<br/><br/>“Liu Gou, you dare!” the Village Head roared angrily.<br/><br/>Nobody expected that just as he said it, he would swing it down.<br/><br/>He clearly wanted to put Jinli in mortal danger.<br/><br/>Even the closest person to Jinli couldn’t save her.<br/><br/>But what happened next stunned everyone.<br/><br/>“How… how is this possible?”<br/><br/>Not just the people of Liujiacun, but also the villagers of Xiao Family Village were somewhat stunned.<br/><br/>However, the villagers of Xiao Family Village soon breathed a sigh of relief and started to cheer.<br/><br/>“Jinli is Jinli, able to catch such an iron shovel thrown at her. If it was me, I definitely couldn’t do it!”<br/><br/>“I always knew Jinli had great strength, but I never thought her power would be enough to surpass a strong adult. Haha, that’s good, in the future, whoever dares to bully Jinli will get a punch from her, sending them flying three meters away.”<br/><br/>“Haha…”<br/><br/>The villagers were relieved and happy.<br/><br/>However, Liu Bald, Liu Daqiang, and the villagers of Liujiacun were not pleased.<br/><br/>They didn’t expect that a girl in her early teens would be able to catch a sudden blow from an iron shovel; her reaction speed and strength amazed them.<br/><br/>What kind of freak is this child from Xiao Family Village?<br/><br/>Xiao Jinli grabbed the handle of the iron shovel and pushed it forward with all her might, knocking Liu Bald to the ground.<br/><br/>She clapped her hands, and a cold smile appeared on her delicate face that didn’t match her age.<br/><br/>She said, “You all saw it, didn’t you? Liu Bald can just hit with an iron shovel in public?<br/><br/>I’m so small and he’s so big, even if he doesn’t kill me, he’ll seriously injure me. If this isn’t intentional murder, what is it? So, do you people of Liujiacun all want to be accomplices with this father and son?”<br/><br/>If at first, they had blocked Xiao Chunhua from going to the hospital for treatment, it might be just a scare tactic.<br/><br/>But when Liu Bald directly hits a child with an iron shovel, it is really an attempt to kill.<br/><br/>The villagers of Liujiacun were all pale, their expressions panicked.<br/><br/>One of them said, “Liu Daqiang, you deal with your own problems. I have things at home to take care of, so I’ll leave first.”<br/><br/>Once one villager leaves, others follow…<br/><br/>There were about twenty-five or twenty-six villagers who came to Xiao Family Village with Liu Bald and his son; they had gathered their relatives to help make a show of force, fearing they’d be beaten if they clashed with the people of Xiao Family Village.<br/><br/>After a while, only Liu Bald, his son, and a few of their close relatives remained on the side of Liujiacun.<br/><br/>Xiao Jinli’s sharp gaze looked at them, and she spoke coldly, “Liu Bald, Liu Daqiang, whether Sister Chunhua really committed adultery or not, we will find out when she wakes up. But you have hurt her and caused her miscarriage. I am taking note of this, and our Xiao Family will definitely not let this go. Get lost!”<br/><br/>To settle accounts, Xiao Chunhua had to be awakened first to understand the whole story.<br/><br/>When she held Liu Bald’s swung iron shovel at her signal, several villagers from Xiao Family Village quickly carried Xiao Chunhua onto a car.<br/><br/>Madame Xiao hurriedly followed them with some money she took from the room.<br/><br/>When the villagers from Liujiacun tried to stop them, they were blocked by the villagers from Xiao Family Village.<br/><br/>Liu Bald, father and son, were frightened by the ferocity of the child.<br/><br/>Liu Bald pointed at Xiao Jinli and shouted loudly, “You…you dead girl, you are so uneducated and dare to defy an elder.”<br/><br/>Liu Daqiang looked at the villagers from Xiao Village in the yard, dealing with the situation as if it were natural and had some surprise in his heart. He looked incredulously at Xiao Youfu and the Village Head and said, “You actually let a child handle this situation?”<br/><br/>A villager from Xiao Family Village laughed and said, “We’re willing to let her handle it. It’s none of your damn business!”<br/><br/>Before Jinli arrived, the confrontation between the two sides had been going on for quite some time.<br/><br/>“Humph, you came in and accused Xiao Chunhua of adultery and demanded that their family hand over 98,000 betrothal gifts on the spot, or no one could be sent to the hospital.<br/><br/>“Where can they gather so much money in such a short time?”<br/><br/>“Even if they go to the bank in the town to withdraw, so much money requires an appointment beforehand. They went too far, treating someone’s life as a joke, and not giving in without payment. What bastards!”<br/><br/>“It’s a good thing Jinli came and solved the problem so quickly!”<br/><br/>“Chunhua was beaten so severely, I hope nothing terrible happens.”<br/><br/>“It seems the injury was caused by Liu Daqiang. Well, ‘a husband and wife for a hundred days,’ he truly is ruthless, beating her on the verge of death, causing her to miscarry and bleed heavily, and not allowing her to be taken to the hospital. He must want to force Chunhua to die.”<br/><br/>“The dog that doesn’t bark is the one that bites. Seeing Liu Daqiang’s honest and simple appearance before, I never expected he could be so ruthless when hitting a woman.”<br/><br/>Liu Daqiang’s face flushed red with anger, and he shouted, “Xiao Chunhua cheated on me, what man could bear their woman being unfaithful? What’s wrong with me hitting her?”<br/><br/>His words instantly silenced the villagers from Xiao Family Village.<br/><br/>If it were them, they might be angry enough to hit someone if they saw their woman cheating on them.<br/><br/>Xiao Jinli shot a sharp glance at Liu Daqiang and asked coldly, “Liu Daqiang, do you dare to swear that Sister Chunhua is truly unfaithful?”<br/><br/>At Xiao Jinli’s words, the Village Head and others shuddered.<br/><br/>The Village Head asked, “Jinli, do you mean that the Liu Family is framing Chunhua?”<br/><br/>As Xiao Jinli did not answer directly but said, “Uncle Village Chief, everyone in our Xiao Family Village knows what kind of person Sister Chunhua is.<br/><br/>Chunhua has always been an honest and simple girl. How could she change from that to become a flirtatious woman in less than a year after marrying into Liujiacun?”<br/><br/>“Yeah, we all watched Chunhua grow up; she’s a shy and honest girl. She had never even held a boy’s hand before marrying Liu Daqiang. How could she turn into such a person in less than a year?”<br/><br/>“Maybe Jinli is right. There must be some hidden truth that we don’t know. When Chunhua wakes up, we’ll know the truth.”<br/><br/>Somehow, Liu Daqiang said anxiously, “We can know others’ looks but not their hearts. Maybe Xiao Chunhua’s true nature is like this, and it was only exposed after she married me.”<br/><br/>Hearing this, Xiao Youfu angrily stepped forward and slapped him, cursing, “You jerk! My Chunhua is absolutely not like that. Don’t you dare frame her!”<br/><br/>Liu Bald saw his son getting hit and angrily came forward with the iron shovel, shouting, “Xiao Youfu, you bastard! How dare you hit my son!”<br/><br/>Then, he tried to lift the iron shovel but couldn’t. He tried again, but the shovel still didn’t budge!<br/><br/>He glanced down and saw a child’s hand holding the iron shovel.\t\t\t\t\t\t</div>", "images": {}, "success": true}