{"id": 17, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14100679.html", "title": "Chapter 17 - Chapter 17: Chapter 17: Leaving Them With Nothing, That’S The Ultimate Revenge!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 17 - Chapter 17: Chapter 17: Leaving Them With Nothing, That’S The Ultimate Revenge!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 17: Chapter 17: Leaving them with nothing, that’s the ultimate revenge!<br/><br/>Translator: 549690339<br/><br/>After Liu Bald and Liu Daqiang father and son were taken away by the yamen officials, the Xiao family members were still in a state of shock.<br/><br/>But very soon, everyone became happy.<br/><br/>“That’s great, finally, Chunhua’s name is cleared.”<br/><br/>“The Liu family is so hateful! They tried to frame Chunhua just for the sake of their son and grandson.”<br/><br/>“I’ve never seen a family treat their own daughter-in-law like this, spending money to set her up and then turning the tables. They’re animals!” “Hmph, now Liu Bald and his son are arrested, this is retribution!” “It’s strange that Liu Laizi suddenly ran to the yamen to report the crime.”<br/><br/>“Not only that, but the Liu family’s connections were also arrested this morning. Otherwise, it would have been difficult to resolve Chunhua’s situation. Haha… they deserved it.”<br/><br/>As they talked about Liu Laizi’s arrest, everyone’s eyes turned to Xiao Jinli.<br/><br/>Everyone thought that it must be Jinli who brought good fortune to them.<br/><br/>That’s because, ever since Jinli was born, it has always been like this.<br/><br/>Whenever there were troubles in the village, after seeking help from Jinli, things would become much smoother.<br/><br/>Xiao Youfu’s eyes were red with emotion, extremely touched and grateful, “Jinli, thank you so much! If it weren’t for you, what kind of slanderous allegations would my Chunhua bear? And she might still be blackmailed by the Liu family.”<br/><br/>“Haha, Jinli is truly the lucky star of our Xiao Family Village!”<br/><br/>“Yes, yes, the lucky star!”<br/><br/>The villagers from Liujiacun looked at the scene, feeling a bit uneasy in their hearts.<br/><br/>For them, things indeed seemed a bit strange.<br/><br/>How did Liu Laizi suddenly decide to turn himself in?<br/><br/>Even the deputy director, who was on good terms with Liu Bald, was arrested this morning.<br/><br/>It seemed that the Liu family’s good luck had run out all at once.<br/><br/>As for those who followed the Liu family members to make trouble, they did so to save face and because of their connection to Liu Bald’s powerful friend.<br/><br/>After all, it’s good to have someone to turn to for help when there’s trouble in the countryside.<br/><br/>But now…<br/><br/>The villagers from Liujiacun looked at each other, feeling slightly uneasy.<br/><br/>Xiao Village Chief laughed and asked them, “So, would you like to stay and help the Liu family demand justice or stay and have a meal with us?”<br/><br/>The villagers from Liujiacun had their faces changing, forcing a slightly stiff smile and said, “No… no need, we have something to do at home, we need to leave quickly!”<br/><br/>What a joke! Liu Bald and his son were taken away, what reason did they have to stay?<br/><br/>“Wait, take this crazy woman with you!”<br/><br/>Xiao Jinli stopped the villagers who were about to leave, pointing to Liu’s wife, who was still crying and shouting on the ground, “If she stays, I’m afraid we won’t be able to control ourselves and end up beating her!”<br/><br/>What could the villagers of Liujiacun do?<br/><br/>They had no choice but to carry her away.<br/><br/>After all, if the Liu family really got beaten up, their village would lose all face.<br/><br/>Liu’s wife shouted, “I won’t leave! Xiao Youfu, listen to me, hurry up and go to the yamen to get my husband and Daqiang released. Otherwise, your Chunhua’s marriage to Daqiang will be finalized. Let’s see who will marry a divorced woman and she will have to stay home as a spinster for the rest of her life!”<br/><br/>Everyone fell silent after hearing this.<br/><br/>What’s wrong with this old lady Liu’s brain?<br/><br/>What era is this, divorced women still don’t get married?<br/><br/>Humph, doesn’t she know how sought-after divorced women are?<br/><br/>I bet Xia Chunhua divorces Liu Daqiang and then a bunch of matchmakers will come knocking on her door.<br/><br/>She’s just full of herself.<br/><br/>Xiao Youfu snorted and said, “Humph, even if you didn’t divorce with that animal Liu Daqiang, we would still want to be separated from your family! You should be worried about who dares to marry into your family in the future.”<br/><br/>It was at this time that Xiao Jinli laughed and said, “Uncle Fu, you don’t have to worry about that. Hasn’t her son hooked up with a widow in the village? That widow is pregnant, and I don’t think she minds that Liu Daqiang’s been arrested and put in prison.”<br/><br/>As soon as Xiao Jinli finished speaking, Xiao Youfu realized it and laughed, “Yes, they are a loving family.”<br/><br/>Bullshit! They’d be at each other’s throats if they didn’t fight.<br/><br/>When Mother Liu heard their reminder, she sobered up and quickly said, “Let me down! I have to hurry back!”<br/><br/>She was afraid that if she went back too late, Niu Xiaolan might give Chunhua a dose of abortifacient and cause her to lose the child.<br/><br/>Anyone who could hook up with Liu Daqiang couldn’t possibly be a good person.<br/><br/>That was the offspring of the Liu family, so she had to go back to guard it.<br/><br/>After the people from Liujiacun had left, the villagers of Xiao Family Village began to talk to Xiao Youfu, “Youfu, now that Liu Bald and his son have been caught, your family can finally have some peace!”<br/><br/>Someone was still a little worried and said, “I’m just afraid that Mother Liu will make a scene every three days!”<br/><br/>It wasn’t a good idea to use force against an old lady.<br/><br/>Someone scoffed, “I’m afraid she won’t have the time to come and make a fuss. Baldy Liu and his son have been arrested, and they won’t be able to get out anytime soon. Isn’t it said that the widow who hooked up with Liu Daqiang is pregnant with a boy? Their family values boys, so Mother Liu has to keep an eye on that widow every day, in case she gets rid of the child.”<br/><br/>“Oh, that makes sense now. I was wondering why Mother Liu suddenly jumped up and ran off by herself. She must have gone back to guard that widow.”<br/><br/>“Hmph, anyone who could hook up with Liu Daqiang can’t be a good person.<br/><br/>Besides, it was her instigation when Liu Daqiang schemed to frame Chunhua. Now, let them bite each other like dogs.”<br/><br/>“Haha, the Liu family is really making a mess. They believed a shaman woman’s words, assuming Chunhua’s child in her belly is a girl, and as a result, they aborted a boy. I wonder if they regret it or not! Poor Chunhua’s child.”<br/><br/>“They must have regretted it. Didn’t you hear Mother Liu’s expression when she said that the child in Chunhua’s womb was a boy, it was terrifying. Alas, it’s just too late to regret.”<br/><br/>“It’s actually a good thing that Chunhua didn’t give birth to that child, she won’t be tied to the Liu family, and can be more at ease when she remarries.”<br/><br/>“It’s just that Chunhua had to suffer a lot.”<br/><br/>Xiao Youfu was still a little uneasy, and asked Xiao Jinli, “Jinli, will the people of Liu family be released?”<br/><br/>Xiao Jinli first nodded, and Xiao Youfu’s heart sank, then she shook her head. “…” Xiao Youfu asked in confusion, “Jinli, what do you mean?”<br/><br/>Xiao Jinli said, “They can be released, but only if they pay to make up for their mistake!” “Hmm?”<br/><br/>Still not clear.<br/><br/>Xiao Jinli explained, “Uncle Fu, Sister Chunhua is the victim, the one who has suffered. The Liu family can only beg you to forgive them in order to escape the disaster of prison. At that time, you don’t need to be polite, make them pay as much money as they have, even if it means they lose everything and become destitute. This is how you can take revenge on them.”<br/><br/>Upon hearing this, the Village Chief Xiao laughed and said, “That’s right, Jinli is right. Youfu, you should focus on taking care of Chunhua, and then wait for the Liu family to come begging with humble expressions.”<br/><br/>“Hahaha….”\t\t\t\t\t\t</div>", "images": {}, "success": true}