{"id": 21, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14106515.html", "title": "Chapter 21 - Chapter 21: Chapter 21: Encountering Me Is Your Retribution.", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 21 - Chapter 21: Chapter 21: Encountering Me Is Your Retribution.</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 21: Chapter 21: Encountering me is your retribution.<br/><br/>Translator: 549690339<br/><br/>One-eyed Dragon and his gang were well-known ruthless criminals a decade ago, kidnapping countless people and killing many.<br/><br/>Throughout their kidnappings, they would outsmart and outfight government officials, even making them run in circles for their amusement.<br/><br/>Therefore, they had never been afraid in all these years.<br/><br/>But at this moment, they were truly experiencing fear for the first time.<br/><br/>This fear was clearly visible on their faces!<br/><br/>And the person who made them scared and terrified was just a young girl.<br/><br/>Looking at the young girl with a carefree expression and calm demeanor, her words struck them with great fear.<br/><br/>“Are you a human or a ghost?” One-eyed Dragon said through gritted teeth and trembling, “No, you must not be human! If you were, how could you have such extraordinary skills and martial arts?”<br/><br/>These four grown men were facing a teenage girl, and they had no power to resist. They were disarmed by her without even having the chance to fight, and the tree branches she used were now piercing their hands.<br/><br/>Such ability was not something an ordinary person could possess.<br/><br/>Old Three stuttered, “Girl, we four brothers have no grudges with you. Can you please let us go? In the future, we will definitely mend our ways, be good people, and do good deeds!”<br/><br/>“Hehe…” Xiao Jinli sneered coldly, “Dear big brother, do you think you’re too smart or that I’m too easy to fool? How much do you believe in your own words?<br/><br/>Originally, I am not a busybody, but you guys have intruded into my territory and wanted to kill people on my turf.<br/><br/>So, sorry, but I have to stand up for those innocent people and seek justice for them. Therefore, if you want to blame someone, blame your bad luck for meeting me! ”<br/><br/>Upon hearing this, One-eyed Dragon and the others’ faces changed abruptly. They angrily roared at Xiao Jinli, “Stupid girl, you really think you can do whatever you want just because you have some skills?”<br/><br/>Then, the three of them exchanged glances and charged towards Xiao Jinli.<br/><br/>This kind of situation seemed to be a life-or-death battle.<br/><br/>Little White and Little Yellow, seeing these oblivious humans charging towards their master, leaped onto one person each without the need for a command from their master. They quickly pinned down Fourth Brother and Old Three under their tiger paws and roared at them to express their anger.<br/><br/>These two insignificant humans dared to harm their master right under their watch – they had to see if these tigers would allow it.<br/><br/>However, without the command from their master, they didn’t bite them.<br/><br/>This was their master’s territory, and they didn’t want to dirty the place.<br/><br/>Only One-eyed Dragon managed to rush in front of Xiao Jinli, but he soon ended up like Second Brother – being kicked to the edge of the cliff and meeting the same fate as his comrade.<br/><br/>Xiao Jinli clapped her hands and looked at the four defeated men, sneering,<br/><br/>“Hehe, overconfident fools. I am your nemesis, and your good days are over. However, it seems your fate has run out. Well, at least I can make use of you as food for my little darlings.”<br/><br/>The four of them lost all color from their faces, showing expressions of terror and unease.<br/><br/>They had committed countless murders and evil deeds, so their final destiny was to be eaten by these tigers?<br/><br/>This was their retribution.<br/><br/>“No, no, I don’t want to be eaten!”<br/><br/>These people were terrified.<br/><br/>“Wu wu, please just kill me directly, I don’t want to be eaten by animals!”<br/><br/>Seeing these scared men, Xiao Jinli recalled the hostages who had been fed to hunting animals by them. She became even more determined not to show mercy.<br/><br/>“Humph, like I said, meeting me is your retribution. You’ve committed too many evil deeds, and this is the outcome you deserve! Little White, Little Yellow, don’t dirty my territory!”<br/><br/>Little White and Little Yellow roared at Xiao Jinli, seemingly in response to her words.<br/><br/>Then, with one swipe of their paws, they knocked out the two men beneath them.<br/><br/>Little White stretched its neck and roared loudly towards the distance.<br/><br/>After a while, four young tigers came running over.<br/><br/>The two adult tigers growled a few times at the young tigers, who also growled back in reply.<br/><br/>Tasks were quickly assigned.<br/><br/>Two young tigers dragged one person each, and one adult tiger dragged another. Soon, all four men were dragged away.<br/><br/>As for their fate…<br/><br/>At this time, Xiao Jinli slowly walked over to the unconscious young man she had treated earlier. After examining him for a moment, her little eyebrows were slightly furrowed.<br/><br/>Then, she grabbed his wrist and took his pulse. A moment later, her eyebrows furrowed even more.<br/><br/>She muttered to herself, “How much can this kid endure? His external injuries look pitiful, and his internal injuries are no better. He was able to endure and come all the way here. This time, you’re lucky to have met me. Otherwise, with the severity of your internal bleeding, even the greatest immortal would have trouble saving you.”<br/><br/>After saying that, a medicine box appeared out of thin air beside her.<br/><br/>Opening the medicine box, besides the exquisite bottles and jars, there was a row of thin silver needles.<br/><br/>She pulled out several Silver Needles and held them between her fingers. Then, with a burst of strength, five or six Silver Needles quickly flew into the young man’s various acupoints.<br/><br/>A moment later, Su Yichen’s body was filled with dense silver needles, including his head.<br/><br/>Xiao Jinli looked up at the sun and, not long after, her cell phone rang in her pocket.<br/><br/>A call at this time was obviously from home, urging her to come back for dinner.<br/><br/>When she answered the phone, a gentle voice came through, “Xiao Bao, come home to eat. Mom made your favorite steak today.”<br/><br/>Xiao Jinli replied, “Alright, mom, I’ll be back soon!”<br/><br/>After hanging up the phone, she looked at the young man lying on the ground with silver needles all over him and her eyebrows furrowed again..\t\t\t\t\t\t</div>", "images": {}, "success": true}