{"id": 25, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14106519.html", "title": "Chapter 25 - Chapter 25: Chapter 25: Memory Loss", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 25 - Chapter 25: Chapter 25: Memory Loss</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 25: Chapter 25: Memory Loss<br/><br/>Translator: 549690339<br/><br/>Xiao’s mother looked at the boy in front of her, dressed in a white T-shirt and blue jeans.<br/><br/>What caught her eye the most was Su Yichen’s handsome face, with sharp eyebrows and piercing eyes, well-proportioned and elegant.<br/><br/>Xiao’s mother smiled and said, “What a handsome young man. But young man, what’s the matter with you?”<br/><br/>Xiao Qingshan brought Su Yichen along to explain, “Sister-in-law, he’s the person Jinli saved. He has lost his memory now, and the Yamen can’t find any proof of his identity or his family. He has nowhere to go. Jinli said before that after he’s discharged, he would come to your house to stay. Now that he’s out of the hospital, I brought him over.”<br/><br/>After Xiao Qingshan’s explanation, Xiao’s mother smiled and said, “Oh, so it’s you. Xiao Bao told me before to let you stay at our house after you get discharged. I’ve already cleaned up the room for you and prepared your toiletries. Let me take you to see the room first and see if there’s anything else you need. Oh, right, what should I call you?”<br/><br/>Not Su Yichen anymore, but now Xiao Siqian, said, “Auntie, I don’t remember my old name. I’ve temporarily taken a new name, Xiao Siqian.” “Xiao Siqian,” Xiao’s mother said, “Can I call you Xiao Quan then?”<br/><br/>“Yes, auntie!” Xiao Siqian replied.<br/><br/>Xiao’s mother took Xiao Siqian to see the prepared room.<br/><br/>Xiao’s mother said, “Your room is on the second floor, oh, it’s this one!”<br/><br/>After opening the door, the room had a 1.8-meter bed covered with black and white checkered sheets, black and white pillowcases as well, a big wardrobe, a table with two books on it.<br/><br/>In short, the room was clean and tidy.<br/><br/>Xiao’s mother said, “You see if there’s anything else you need, just feel free to tell me. Since you’re here with us, treat our family as your own.”<br/><br/>Xiao Siqian looked around and with satisfaction said, “Auntie, it’s great! I like it.”<br/><br/>But after a while, he looked somewhat embarrassed and said, “Auntie, 1…1 don’t have any clothes to change into.”<br/><br/>He was a person who was picked up and didn’t have money to buy any clothes.<br/><br/>Hearing him say that, Xiao’s mother immediately realized and said with a smile, “Oh, I didn’t think about that. Let me find two sets of clothes from Xiao Bao’s brother for you to wear first, and tomorrow we’ll go to the county town to buy you two new sets.”<br/><br/>It’s estimated that there’s no suitable clothing for Xiao Siqian in the town.<br/><br/>Xiao Siqian  gratefully said, “Auntie, can I just wear her brother’s clothes<br/><br/>instead of buying new ones?”<br/><br/>He was eating and living here, and also spending money, he felt embarrassed.<br/><br/>Xiao’s mother shook her head and said, “Xiao Bao’s brother does have old clothes, but since you’re here with us, you can’t always wear old clothes. You should have at least two sets of new clothes.<br/><br/>She looked at Xiao Siqian and said, “Judging by your age, you should be going to school, right? High school age.”<br/><br/>Hearing that, Xiao Siqian shook involuntarily, and shook his head saying, “Auntie, according to the doctor, I should be 18 years old now. I don’t remember if I’m in high school or not, but I should have graduated from junior high school at least, and I can find a job now.”<br/><br/>In his heart, he thought, “Not only did he go to high school, but he was also a<br/><br/>Harvard University finance master’s graduate.”<br/><br/>Of course, since he pretended to lose his memory and hide his identity, he certainly wouldn’t tell them about it.<br/><br/>Xiao’s mother sincerely advised, “Xiao Quan, you’re still a teenager, the age to go to school. I don’t know if you’ve forgotten the knowledge of school, or if it’s appropriate to send you to junior high, high school, or university?” Xiao Siqian’s smile on his face slightly froze for a moment.<br/><br/>Go to junior high school?<br/><br/>How could that be possible?<br/><br/>At such an age, wouldn’t that be embarrassing?<br/><br/>Xiao Siqian immediately said, “Auntie, can we skip this? I’m just suffering from amnesia for the time being, and I’m sure I’ll remember in the future. Auntie, now I just want to go out and work to earn money to repay my debt. I owe everyone so much money for my hospitalization, and if I don’t hurry to pay it off, I won’t feel at ease!”<br/><br/>Xiao Qingshan tried to persuade him, “Xiao Quan, don’t worry about the money. We won’t rush you. I think you going to school is more appropriate!”<br/><br/>Xiao Siqian, “…” He, a Harvard finance master’s graduate, still needed to go to school?<br/><br/>He thought for a moment and said, “Auntie, how about this? You help me buy some materials for graduated junior high, high school, or university so I can have a look and test myself to see if I need to go to school. I may have lost my memory, but I’m not stupid. Maybe all the knowledge is still hidden in my brain.”<br/><br/>Upon hearing this, Xiao’s mother nodded and said, “You do make a point. Let’s do it tomorrow then. Tomorrow, when we buy your clothes, we’ll also buy these materials. However, Xiao Quan, just in case you did forget these things, I think it’s better for you to go to school. After all, knowledge is the most important thing, and without it, you can only do hard labor out there. Most importantly, no one knows when you’ll recover your memory, right?” Xiao Siqian immediately agreed, “Alright, Auntie, I’ll leave it up to you!”<br/><br/>Xiao’s mother nodded with satisfaction, “You’re such a sensible child!”<br/><br/>After leaving the room, Xiao Siqian finally took a closer look at the house.<br/><br/>A three-story small western-style building villa with white tiles and red glazed tiles, which showed that the living conditions of this family were quite good, especially in the countryside.<br/><br/>There were yards in front of and behind the house.<br/><br/>In the backyard, some vegetables were planted.<br/><br/>In the front yard, some flowers and plants were arranged.<br/><br/>On the walls, some cacti were planted, along with a few Scindapsus and Chinese roses.<br/><br/>A small resting area was also built in the yard, with a stone table in the center.<br/><br/>The yard was arranged to be warm and elegant.<br/><br/>At the same time, one could see that this was a warm and happy family.<br/><br/>Xiao Siqian’s eyes showed a hint of envy.<br/><br/>He thought of something and asked, “Auntie, where’s Sister Jinli?” Xiao Qingshan smiled and said, “Of course, Jinli went to school!”<br/><br/>“Haha, to school?” Xiao Siqian didn’t react for a moment.<br/><br/>Mainly because, Xiao Jinli gave him the impression of being quite grown-up, so much so that he had forgotten she was still a child, a school-aged child.<br/><br/>Xiao Qingshan said, “Jinli is only ten years old, so at this age, she’s supposed to go to school. There are no vacations now. She found you a few days ago because she was coincidentally on vacation.”<br/><br/>Xiao Siqian curiously asked, “So, what grade is Sister Jinli in right now?”<br/><br/>“Hm, I think it’s fourth grade, right, sister-in-law?” Xiao Qingshan asked uncertainly.<br/><br/>Xiao’s mother nodded and said, “Yes, she’s in fourth grade. But when this child goes to school, it’s really just a place to sleep.”<br/><br/>Xiao Siqian was dumbfounded.<br/><br/>Sending a child to school to sleep, and the parents are so permissive, what kind of enlightened parents are they?\t\t\t\t\t\t</div>", "images": {}, "success": true}