{"id": 22, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14106516.html", "title": "Chapter 22 - Chapter 22: Chapter 22: Picked Up A Person", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 22 - Chapter 22: Chapter 22: Picked Up A Person</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 22: Chapter 22: Picked Up a Person<br/><br/>Translator: 549690339<br/><br/>“Aiyo, Jinli, you… carried a person on your back?”<br/><br/>Upon saying that, the villager immediately stepped forward and helped take the bloodied person off Xiao Jinli’s back.<br/><br/>That’s right, Xiao Jinli had carried Su Yichen down the mountain.<br/><br/>She couldn’t just leave him on the mountain top.<br/><br/>Although there wouldn’t be any vicious beasts eating him or anything, his internal injuries wouldn’t heal in a day or two.<br/><br/>So, she had to bring him back.<br/><br/>“Jinli, what’s going on with this person, why is he covered in blood?,” asked the villager Xiao Deming, full of doubts.<br/><br/>Xiao Jinli shrugged and said, “I don’t know. I found him in the mountain!”<br/><br/>Xiao Deming asked doubtfully, “Could he have been bitten by a wild beast in the mountain?”<br/><br/>After that, he checked the boy’s injuries and after a while said, “Looking at his wounds, it doesn’t seem like he was bitten by a wild beast. How did he end up in the mountain?”<br/><br/>Xiao Jinli shook her head and said, “I don’t know!”<br/><br/>Xiao Deming said, “His injuries look very serious, we should hurry and take him to the hospital!”<br/><br/>After saying that, he carried the person on his back, with Xiao Jinli following behind.<br/><br/>When they met other villagers on the way, they were immediately alarmed upon hearing that Xiao Jinli had found an injured boy in the mountain.<br/><br/>“Usually, Jinli picks up some wild chicken and rabbits in the mountain, but today, she found a person!”<br/><br/>“Looking at the child’s injuries, they’re severe. I wonder how he got hurt? Did he get injured while being chased by wild beasts in the mountain?”<br/><br/>“We don’t know. Xiao Deming is sending the person to the hospital, so let’s go and see.”<br/><br/>“Let’s go.”<br/><br/>When the Village Head heard that Xiao Jinli found a person in the mountains and that person’s injuries were quite serious, needing to go to the hospital, he immediately asked his youngest son, Xiao Qingshan, to drive the car and quickly take the person to the hospital, while also alerting the police.<br/><br/>The Village Head said to Xiao Jinli, “Jinli, the mountains are really dangerous, so try to go there less often, okay?”<br/><br/>Xiao Jinli laughed and said, “Okay, Uncle Village Chief, I know!”<br/><br/>But she would still go there when she wanted to.<br/><br/>Seeing Xiao Jinli being so obedient, the Village Head was very pleased and said, “Alright, hurry back home to eat. You’re still growing, so you can’t be hungry, otherwise you won’t grow tall! As for the child’s matter, don’t worry about it, we’ll take care of everything! ”<br/><br/>Xiao Jinli nodded and said, “Alright, Uncle Village Chief, I’m going home now!”<br/><br/>After Xiao Jinli returned home, she immediately took a shower, changed her clothes, otherwise the smell of blood would be too unbearable.<br/><br/>Then, she wolfed down the steak stewed by her mother.<br/><br/>Dealing with those four people in the mountain had consumed a lot of energy.<br/><br/>Xiao Mother immediately stopped her, “Little Li, eat slowly, eat slowly, don’t choke, nobody’s fighting you for the food.”<br/><br/>Xiao Father and Older Brother Xiao looked at Xiao Jinli’s wolfing down the food, full of doubt and turned to Xiao Mother.<br/><br/>Older Brother Xiao asked doubtfully, “Mom, when did you starve my sister?”<br/><br/>As soon as he finished speaking, Xiao Dad slapped him hard on the back of his head, scolding, “You stinky boy, what are you talking about? How can you suspect my wife? How could Mom ever starve Little Sister?!”<br/><br/>Older Brother Xiao touched the slapped head and defended himself, “But looking at sister’s eating, it’s like she hasn’t eaten for eight hundred years!”<br/><br/>Xiao Father,<br/><br/>Xiao Mother, ‘<br/><br/>As she ate, Xiao Jinli explained, “Brother, today I picked up a person in the mountain and carried him all the way back, so I might have consumed too much energy and ended up being extremely hungry.”<br/><br/>Upon hearing this, Xiao Father’s face immediately changed, and he asked anxiously, “You picked up a person? Little Li, what kind of person did you pick<br/><br/>Having eaten halfway, Xiao Jinli slowed down her eating and said, “I don’t know who it was. He’s probably seventeen or eighteen years old. When I found him, he was lying injured under a tree on the mountain. Leaving such a person in the mountain, I was afraid that he would be eaten by wild animals, so I decided to save a life which is better than building a seven-storey pagoda! So I brought him down the mountain. Uncle Village Chief and the others have taken him to the hospital now!”<br/><br/>Upon hearing this, Xiao Dad, hearing that she had picked up a seventeen or eighteen-year-old child, immediately breathed a sigh of relief.<br/><br/>Picking up a person is not a big deal, but it’s scary to bring a bad person home.<br/><br/>A seventeen or eighteen-year-old kid, even if they were a bad person, couldn’t be that terrible!<br/><br/>Older Brother Xiao asked doubtfully, “Where does this child come from? Is he from one of the surrounding villages? Otherwise, why would he go into the mountains?<br/><br/>Xiao Jinli shook her head and said, “I don’t know, I don’t recognize him.”<br/><br/>Just when Older Brother Xiao was about to ask more questions, Xiao’s mother interrupted, “Brother, let our sister eat first.”<br/><br/>So Older Brother Xiao didn’t ask any more questions.<br/><br/>After Xiao Jinli had finished eating, she stretched lazily and said, “Dad, Mom,<br/><br/>I’m so sleepy, I’m going to my room to rest.”<br/><br/>Xiao’s mother immediately said, “Little Li, you just ate and should go for a walk to help digest the food. If you go to bed now, you may suffer from indigestion!”<br/><br/>Xiao Jinli waved her hand and said, “Mom, I’m really too tired, I’m going to sleep now!”<br/><br/>Get some sleep, replenish energy as soon as possible!<br/><br/>When Su Yichen woke up groggily, his mind was still fuzzy.<br/><br/>The first thing he saw was a white wall. He thought to himself, “Where am I? Am I dead?”<br/><br/>Suddenly there was an exclamation.<br/><br/>“Oh my! You’re awake! Do you feel unwell anywhere? I’ll go call a doctor now!”<br/><br/>He turned his head and saw a person dressed as a nurse talking.<br/><br/>Suddenly, his mind jolted into reality.<br/><br/>Nurse?<br/><br/>Why is there a nurse? Is this a hospital?<br/><br/>Wanting to confirm his current situation, he struggled to sit up.<br/><br/>As he struggled, there was the sound of clinking.<br/><br/>He then noticed the tubes and IV drip on his body.<br/><br/>The nurse immediately stepped forward to stop him, “Don’t move! You have tubes all over your body and are on medication now. Do you need to use the restroom? I can help you!”<br/><br/>After saying that, she grabbed a urinal from under the bed and prepared to assist him.<br/><br/>Su Yichen twitched the corners of his mouth and quickly stopped her, “No, no, I don’t need to pee now!”<br/><br/>Upon hearing this, the nurse immediately put down the urinal.<br/><br/>At this moment, Su Yichen was completely awake.<br/><br/>He glanced at the ordinary hospital ward.<br/><br/>He asked, “Nurse, which hospital am I in? And who brought me here?” He hadn’t even thought that he could actually survive.<br/><br/>The nurse said, “This is the Qing County People’s Hospital! Oh, a man called<br/><br/>Xiao Qingshan brought you here.”<br/><br/>As she was saying this, she paused and said to Su Yichen, “Oh, now that you’re awake, I’ll notify the police officer.”<br/><br/>“Huh, notify the police officer?” Su Yichen was a little confused.<br/><br/>The nurse explained, “The man who brought you here said he found you in the mountains and didn’t know you. After he paid the hospital fee for you, he reported it to the police. The officer has come a few times, but you were always unconscious. Now that you’re awake, it’s a good time to notify the officer or perhaps any family members you may have. If not, I can inform your family first.<br/><br/>Upon hearing this, Su Yichen’s expression quickly froze, “Do I have family? I… 1 don’t remember! ” The nurse was at a loss for words, Was this memory loss?\t\t\t\t\t\t</div>", "images": {}, "success": true}