{"id": 20, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14106514.html", "title": "Chapter 20 - Chapter 20: Chapter 20: Begging For Mercy On Their Knees From Fear!", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 20 - Chapter 20: Chapter 20: Begging For Mercy On Their Knees From Fear!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 20: Chapter 20: Begging for Mercy on their Knees from Fear!<br/><br/>Translator: 549690339<br/><br/>“Right, you guys aren’t afraid of killing people, so why would you be afraid of ghosts?” The pleasant yet deadly voice rang out. “Hehe, since that’s the case, let me give you a gift. Little White, Little Yellow, please entertain these guests who have traveled from afar!”<br/><br/>As the voice stopped, two tigers roared in apparent response to their master’s command.<br/><br/>One-eyed Dragon and the others trembled in fear as they faced the two tigers, their hearts pounding as well.<br/><br/>Glancing at the weapon in his hand, a vicious glint flashed through One-eyed Dragon’s eyes as he roared, “Hmph, just two tigers. Don’t you see the guns in our hands?”<br/><br/>After being reminded by their boss, the other three regained their composure.<br/><br/>That’s right, they still had guns in their hands.<br/><br/>They raised their guns, aiming at the two big tigers.<br/><br/>However, just as they were about to pull the triggers, their wrists suddenly hurt, and the guns in all four of their hands fell to the ground. The previous darts which had knocked away their weapons were none other than the small tree branches.<br/><br/>Those small branches were precisely embedded in their wrists, as if they had taken root long ago!<br/><br/>The branches were tiny, with the thickest ones only being the size of a baby’s little finger.<br/><br/>The four were astonished, staring at the tiny branches embedded in their wrists. As they finally realized what had happened, their expressions and eyes filled with fear and dread.<br/><br/>They may not be afraid of ghosts, but they certainly feared these bizarre and unknown things.<br/><br/>“Who’s there? Show yourself!” One-eyed Dragon covered his wound, surveying the area cautiously. He signalled the others to pick up their fallen weapons.<br/><br/>But before they could bend down, the two tigers leaped in front of them, roaring fiercely, which frightened them so much that they retreated several steps. Their faces turned pale, their eyes wide open in terror as they stared at the tigers.<br/><br/>With their weapons still on the ground, the two tigers eyeing them menacingly, and a cliff behind them, they had nowhere to run.<br/><br/>They had committed countless crimes for ten to twenty years, but they had never experienced such a terrifying and frightening situation like today.<br/><br/>“Whether it’s a human or a ghost, show yourself! What’s the big deal about hiding and playing tricks?” One-eyed Dragon yelled again, suppressing his fear.<br/><br/>“Fine. since you all want to see me so much. I’ll let you see me!”<br/><br/>Once the voice faded, they heard movement behind them.<br/><br/>And then, they witnessed an unbelievable sight, causing their pupils to shrink involuntarily.<br/><br/>A little girl jumped down from the big pine tree.<br/><br/>So, the one playing tricks on them all this time was this little girl?<br/><br/>The girl looked young, about ten years old or so. She had fair skin and a chubby, rounded face, featuring big, round eyes with sharp gazes. She wore simple clothing, similar to the attire of rural children.<br/><br/>How could there be a little girl like her in these deep mountains and forests?<br/><br/>Regardless of her being a little girl, the four of them did not lower their guard.<br/><br/>They hadn’t forgotten that Su Yichen was knocked out by a single tree branch, and the weapons in their hands had been knocked away by four small branches, which were still in their wrists.<br/><br/>This kind of ruthlessness and power was not something an ordinary person could possess, let alone a child.<br/><br/>Old Four, who had been scared out of his wits, pointed at her in disbelief and asked, “So the one who’s been messing with us all along is you, this stinky brat?”<br/><br/>Xiao Jinli shrugged and laughed, “Hehe, sorry, I wasn’t the one playing tricks.<br/><br/>You guys scared yourselves.”<br/><br/>Hearing Xiao Jinli’s words, anger surged on the faces of the four kidnappers.<br/><br/>Second Brother shouted, “You damn brat, talking nonsense! See if I don’t teach you a lesson!”<br/><br/>As he said this, he rushed towards Xiao Jinli, raising his uninjured hand, wanting to slap her hard.<br/><br/>Unexpectedly, before he could get close, Xiao Jinli gently lifted her foot and kicked him straight in the stomach. He was sent flying two meters away.<br/><br/>Clink!<br/><br/>Kidnapper Second Brother was kicked to the edge of the cliff, with his upper body almost falling off. If he moved at all, his entire body would plummet down.<br/><br/>Fearing that he would fall, he clung tightly to the edge of the cliff and shouted in a panic, “Save me! Big Brother, Third Brother, Fourth Brother, come and help me!”<br/><br/>Seeing this, the other three revealed looks of terror and panic. They stared at Xiao Jinli with incredulity and disbelief.<br/><br/>They determined once again that this little girl was by no means an ordinary child.<br/><br/>Which child could kick a grown man several meters away with one foot?<br/><br/>Xiao Jinli clapped her hands together, ignoring the terrified expressions of the three men, and laughed, “Do you still want to teach me a lesson?”<br/><br/>Seeing the innocent smile on the little girl’s face, all three of them were so scared that they were trembling all over.<br/><br/>They deeply realized how terrified those people they had kidnapped and tortured in the past must have been.<br/><br/>Old Four suddenly knelt down with a thud and pleaded, “Little Fairy, I beg you, please let me go. Please, I won’t kill anyone again. I’ll be a good person from now on!”<br/><br/>One-eyed Dragon kicked Old Four angrily and shouted, “Old Four, get up! A little girl has made you lose your nerve.”<br/><br/>Old Four cried, “Big Brother, we can’t beat her! She kicked Second Brother so far away with just one foot. And there are two tigers behind us, which obviously listen to her orders. We can’t even get our weapons. What should we do if we don’t beg for mercy?”<br/><br/>Before One-eyed Dragon could say anything, Xiao Jinli interrupted, nodding,<br/><br/>“Yes, exactly, what should you do if you don’t beg? Should I let Little White and<br/><br/>Little Yellow eat you, or should I throw you down this cliff?”<br/><br/>One-eyed Dragon and the others,<br/><br/>Whose child is this? How could her character be so bad and her thoughts so evil?<br/><br/>One-eyed Dragon gritted his teeth and asked, “You damn girl, what do you really want?”<br/><br/>Old Three quickly offered, “Just let us go, and I’ll give you any amount of money you want. How about that?”<br/><br/>Xiao Jinli laughed, “Deliver it? Deliver it for revenge and silencing us?”<br/><br/>At this point, her expression changed, and she became serious, “You all have killed countless people and reek of blood. Haven’t you ever spared anyone who knelt and begged for mercy?”<br/><br/>One-eyed Dragon and the others turned ashen-faced and had a hard time responding.<br/><br/>“Heaven is just, and retribution is inevitable! You have lousy luck, messing with me on my territory and trying to kill people right under my nose. I am your retribution!” Xiao Jinli declared resolutely.<br/><br/>One-eyed Dragon instantly turned from ash-gray to pale.<br/><br/>They realized that the innocent-looking girl in front of them might, in fact, be a merciless demon.<br/><br/>They could feel the strong and cold murderous intent from her..\t\t\t\t\t\t</div>", "images": {}, "success": true}