{"id": 23, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14106517.html", "title": "Chapter 23 - Chapter 23: Chapter 23: Little Koi Has Been Strong Since Childhood", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 23 - Chapter 23: Chapter 23: Little Koi Has Been Strong Since Childhood</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 23: Chapter 23: Little Koi has been strong since childhood<br/><br/>Translator: 549690339<br/><br/>“Jinli, Jinli, the hospital called, and the boy you found has woken up. Do you want to go see him?”<br/><br/>Before they even reached the Xiao Family house, Xiao Qingshan began shouting from the doorway.<br/><br/>The Village Head followed behind Xiao Qingshan and rolled his eyes at his son’s immature behavior, speaking irritably, “He’s over twenty years old, and still acting so noisy, it’s quite disgraceful.”<br/><br/>Xiao Jinli was lying in a lounge chair in the yard when she saw the Village Head and his son enter, so she stood up.<br/><br/>Xiao’s mother laughed as she brought some tea, saying, “Village Head,<br/><br/>Qingshan has always been lively and bubbly, which is quite cute.”<br/><br/>When a twenty-something young man is called cute, even thick-skinned Xiao Qingshan’s face reddens involuntarily.<br/><br/>He said, “Auntie, don’t praise me like that; it’s embarrassing.”<br/><br/>Xiao’s mother covered her mouth, giggling, “Qingshan, I’m telling the truth.”<br/><br/>Xiao Qingshan didn’t bother to argue with her further. He turned to Xiao Jinli and said, “Jinli, the hospital called and said that the boy you found has woken up, and the police officers have gone over too.<br/><br/>However, he seems to have amnesia and doesn’t know his name or where he’s from. He doesn’t have anything on him to identify himself either, so his identity is still unknown for now.”<br/><br/>“Oh, he has amnesia?” Xiao Jinli’s eyes twinkled, and the corners of her mouth lifted slightly, revealing an intrigued expression, “Does he really not remember anything?”<br/><br/>She had already checked his pulse, and he hadn’t suffered any major head injuries. His most serious injuries were to his internal organs, especially his lungs, which showed signs of severe bleeding. However, after her treatment and hospitalization, it shouldn’t be much of a problem.<br/><br/>So, how did he get amnesia?<br/><br/>Xiao Qingshan nodded, “That’s right, he doesn’t remember anything. Jinli, my dad and I are planning to visit him. Do you want to go too? The hospital also said that his hospitalization costs aren’t enough, so we need to bring some money.”<br/><br/>“Sure, let’s go see him together,” Xiao Jinli immediately became interested in the boy.<br/><br/>When Xiao Qingshan and the others arrived at the hospital and entered the ward, they saw a police officer stand up and prepare to leave.<br/><br/>Upon seeing them enter, one of the officers smiled at Xiao Qingshan, “Mr. Xiao,<br/><br/>I was just about to find you, and you’re already here.”<br/><br/>Xiao Qingshan smiled and asked, “Officer Chen, what did you need from me?”<br/><br/>Officer Chen put away his smile, asked seriously, “Mr. Xiao, where exactly did you find this boy in the mountains?”<br/><br/>Xiao Qingshan looked at Xiao Jinli, who replied, “On top of Red Peak Mountain!<br/><br/>When I found him, he was lying unconscious on the ground, bleeding all over.”<br/><br/>Hearing Xiao Jinli’s words, Su Yichen was taken aback and looked at her with surprise in his eyes, asking, “Little Sister, you were the one who found and carried me down the mountain?”<br/><br/>Xiao Jinli nodded, “Yes, I’m the one who carried you down the mountain. Is there a problem?”<br/><br/>Su Yichen was astonished when he looked at Xiao Jinli’s small frame.<br/><br/>The two officers were also doubtful, staring at Xiao Jinli with suspicious eyes.<br/><br/>Xiao Qingshan quickly explained, “Jinli has been stronger than most people since she was little, so she can carry you down the mountain.”<br/><br/>Officer Chen immediately asked with interest, “Stronger than most people since she was little? How strong?”<br/><br/>Xiao Jinli replied, “Well, carrying a load, like carrying around a hundred pounds, is no problem! Carrying a person is, of course, a piece of cake.”<br/><br/>Officer Chen and the others were instantly stunned.<br/><br/>Good heavens, that’s quite strong!<br/><br/>No wonder she could carry a young man weighing over a hundred pounds down the mountain.<br/><br/>Officer Chen thought for a moment and said, “Little girl, can you take us to the place where you found him?”<br/><br/>From Su Yichen’s wounds, in addition to bruises and contusions, his body had marks from being beaten up and gunshot injuries.<br/><br/>These injuries indicated that the child’s identity was not simple, and it was very likely that he had been kidnapped and then had escaped.<br/><br/>Now that he had amnesia, there was no clue about his identity.<br/><br/>It seemed worth visiting the scene to see if they could find any clues.<br/><br/>Xiao Jinli naturally agreed without hesitation.<br/><br/>After all, she had already arranged for her little helpers to clean up the scene, so nothing suspicious would be found even if these people went up the mountain.<br/><br/>Xiao Jinli looked at Su Yichen and showed a naive smile, asking curiously, “Big Brother, I heard you have amnesia, is that true? Do you really not remember who you are at all?”<br/><br/>Su Yichen shook his head, “I don’t remember.”<br/><br/>Xiao Jinli’s little face immediately showed a worried expression, “What should we do? You don’t even remember who you are, so where will you go after you’re discharged? Should we send you to an orphanage or an aid station?”<br/><br/>Su Yichen’s mouth twitched slightly, and he said somewhat speechlessly, “That shouldn’t be necessary. I’m a grown man now and should be able to support myself. ”<br/><br/>Officer Chen also smiled and chimed in, “That’s right, the hospital did a bone age test on him, and he’s already 18 years old. A young man can easily find work and support himself. Oh, and we’ll get him a temporary ID card when the time comes!”<br/><br/>Su Yichen’s eyes lit up showing gratitude, and he said, “Thank you, Officer<br/><br/>Uncle. ”<br/><br/>Officer Chen laughed, “You’re welcome. It’s our duty. It’s just that we need to find your family as soon as possible, or your loved ones might worry.”<br/><br/>Su Yichen lowered his eyes, and a dark light flickered in them.<br/><br/>Worry, huh? They’d rather he didn’t appear in this world again; how could they possibly worry?<br/><br/>But thinking that he did have loved ones who cared for him, his eyes darkened again.<br/><br/>He clenched his fists and muttered to himself, “I’m surrounded by wolves and tigers, and if I go back now, I’m afraid I’ll be eaten alive!”<br/><br/>So pretending to have amnesia for now was the best strategy. When the right opportunity came, he would strike back at those people.<br/><br/>Xiao Jinli had been watching Su Yichen’s expressions and movements all along, naturally noticing the subtle changes in his expression.<br/><br/>She hooked her lips, thinking to herself, “Interesting! Pretending to have amnesia!”<br/><br/>Of course, she wouldn’t expose him now.<br/><br/>She was curious to see what he would do next.<br/><br/>The identity of someone pursued by fierce and ruthless men must be extraordinary.<br/><br/>Thinking of this, Xiao Jinli showed a sweet smile on her face and offered, “How about this, Big Brother, when you’re discharged, come stay at my house. We have plenty of spare rooms.”<br/><br/>Being close to him would allow her to watch the show.<br/><br/>Su Yichen hesitated for a moment, “Is that okay? Little Sister, can I really stay at your house? Should we ask your family first?”<br/><br/>After saying that, he looked toward Xiao Qingshan.<br/><br/>He assumed that Xiao Qingshan was Xiao Jinli’s parent.<br/><br/>“Ahem…” Xiao Qingshan said, “Since Jinli is inviting you to stay, just go and stay. She can make the decision for her house, right?”<br/><br/>“Really?” Su Yichen was full of doubt.<br/><br/>A stranger staying in their home- could a child really make that decision?<br/><br/>What kind of family was this?<br/><br/>And they were supposed to be a rural family.<br/><br/>Weren’t rural families usually poor?<br/><br/>Having one more person living in their house wasn’t as simple as having one more set of chopsticks and a bowl!\t\t\t\t\t\t</div>", "images": {}, "success": true}