{"id": 26, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14106520.html", "title": "Chapter 26 - Chapter 26: Chapter 26: How He Survived", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 26 - Chapter 26: Chapter 26: How He Survived</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 26: Chapter 26: How He Survived<br/><br/>Translator: 549690339<br/><br/>Xiao Siqian settled down at the Xiao Family’s residence.<br/><br/>“Little Quan, don’t feel restrained,” Xiao’s mother said, “Consider this place home from now on! If you want to eat or buy anything, just tell me.” nodded, “Thank you Auntie, I understand.”<br/><br/>“Anything particular you’d like to eat today?” Xiao’s mother asked, “I’ll make it for you. You just got discharged from the hospital. Your health hasn’t fully recovered yet, so you need to take care of your nutrition. And make sure to rest well, don’t worry too much for now. Health comes first, understand?”<br/><br/>His mother said these words because she was worried that the kid wouldn’t feel comfortable living in the house.<br/><br/>Xiao Siqian nodded, “Yes, I understood Auntie, I’ll treat this place as home.”<br/><br/>This home seemed so warm and blissful. He also wanted to fit in and feel it too.<br/><br/>Xiao’s mother patted him on the shoulder, laughing, “Haha, that’s the right attitude. Alright, you should rest. I’m going to cook now. Little Bao will eat at school, so it’ll just be the two of us for lunch.”<br/><br/>Speaking about Jinli, Xiao Siqian asked, “Auntie, won’t Jinli come home for lunch?”<br/><br/>Xiao’s mother shook her head, “No, she’ll eat lunch at school. There’s not enough time. Either her father or brother will pick her up after school in the afternoon.’<br/><br/>Xiao Siqian thought and then suggested, “Auntie, how about I pick her up this afternoon? If Uncle and Brother are busy with work, it’ll be less urgent if I go.”<br/><br/>Xiao’s mother, with a smile, said, “It’s okay, let them pick her up today. You should rest and recover first, then you can pick her up.”<br/><br/>But suddenly, she recalled something, and asked doubtfully, “It’s a dozen miles distance from here to the school, can you ride an electric scooter or drive a car?”<br/><br/>Then she realized something was not right, “Wait, but you’ve lost your memory. Even though you might remember how to ride a scooter or drive, you don’t have a driver license. How are you going to pick up Little Li?”<br/><br/>Xiao Siqian,<br/><br/>That’s indeed a problem.<br/><br/>He knows how to drive.<br/><br/>But he doesn’t know how to ride an electric scooter.<br/><br/>He was born in a wealthy family, where he had chauffeurs wherever he went, so there was no need for him to ride bikes or scooters.<br/><br/>After Xiao’s mother left for cooking, he laid on the bed, arms and legs spread out, staring at the white ceiling above, sinking into deep thought.<br/><br/>Since waking up in the hospital to now, he had been thinking about one issue.<br/><br/>How did he survive?<br/><br/>He remembered, he was chased by the kidnappers to the edge of a cliff. Just when he was about to commit suicide by jumping off the cliff out of despair, he felt a sharp pain in his back and then he passed out.<br/><br/>When he woke up again, he was already in the hospital.<br/><br/>According to what Xiao Qingshan and the others said, it was Jinli who carried him down the mountain.<br/><br/>Here comes the question.<br/><br/>Firstly, who knocked him out? It’s certain that it wasn’t the kidnappers.<br/><br/>The kidnappers might have wanted to capture him alive, but under that situation, without firearms or any weapons, they didn’t have the ability to knock him out.<br/><br/>If they were capable, they would’ve caught him alive long ago instead of chasing him a thousand miles to the point where he was about to end his life by jumping off the cliff.<br/><br/>Secondly, what happened when he was unconscious? How did he survive?<br/><br/>The four ominous kidnappers were at the same location as him.<br/><br/>As he survived, what happened to the four kidnappers?<br/><br/>They wouldn’t have just run off, right? What made them panic and run away?<br/><br/>What did they come across that made them run so hurriedly?<br/><br/>No, if they chose to run off at that time, what about after?<br/><br/>As long as they heard he didn’t die, they definitely would’ve come after him again.<br/><br/>But during his hospitalization, nobody came to protect him. Those people didn’t appear at the hospital either.<br/><br/>It seemed… It seemed as if the four kidnappers disappeared into thin air.<br/><br/>Suddenly, Xiao Siqian sat up from the bed, looking excited.<br/><br/>He mumbled to himself, “Disappearing? Did the one-eyed dragon and his gang really disappear? Why did they disappear?”<br/><br/>In short, his stomach was full of questions.<br/><br/>No matter how many questions he had, there was no one to answer them.<br/><br/>It was like a riddle.<br/><br/>And no one knew the answer.<br/><br/>Of course, it didn’t occur to him that the disappearance of the four kidnappers was related to Jinli.<br/><br/>Given Jinli’s age, a ten-year-old girl causing kidnappers to disappear was ridiculous, right?<br/><br/>Secondly, Jinli was just a child with a little more strength and luck, how could she have walked away unharmed when up against the four ruthless thugs? It was impossible.<br/><br/>Thus, either of these conjectures was complete nonsense to him.<br/><br/>After thinking for a while, not figuring anything out, Xiao Siqian ruffled his hair, saying, “Forget it, no point in thinking about it. I was lucky enough to survive. Next, I need to think about how to take revenge. Hmm, those people must be celebrating with champagne now. Ha… They really think that if I’m dead, they can inherit all my mother’s property? They’re dreaming! ”<br/><br/>In a renowned law firm in the Capital City.<br/><br/>A middle-aged man in glasses and a suit, looking at the documents in his hand, spoke apologetically, “Sorry, Mr. Su, in accordance with our industry regulations, we cannot transfer all the property from Xia Zhi Meng into your name before seeing Su Yichen!”<br/><br/>Upon hearing the lawyer’s words, Su Xiangdong’s face darkened.<br/><br/>Before he could answer, a woman dressed as an upper-class lady protested in a shrill voice, “What’s wrong with you? We have Su Yichen’s agreement to give up his inheritance rights and commission contract, so why can’t we transfer the ownership? It must be you who’s making it difficult for us! I’ve heard that you were close to that cheap woman Xia Zhi Meng. Are you trying to take over her inheritance? Let me tell you, Liu Qing Ming, all the property under Xia Zhi Meng’s name belongs to the Su Family, you can’t get a single cent from it!”<br/><br/>Liu Qing Ming frowned, suppressing his anger, he warned firmly, “Lady Su, watch your words! I have been handling matters according to Xia Zhi Meng’s will and industry regulations, and neither is related to our personal relationship.<br/><br/>Xia Zhi Meng’s will: All her property shall be inherited by Mr. Su Yichen when he turns eighteen. If he gives up his inheritance rights, it should be confirmed by him in person and the commission will be invalid. Otherwise, all inheritance shall be donated to a charity foundation within five years.<br/><br/>Mr. Su wants to inherit Xia Zhi Meng’s property, okay, but that’s on the condition that Mr. Su Yichen appears in person and confirms that he is giving up his inheritance rights. Otherwise, no one can touch a single penny of Xia Zhi Meng’s property!”<br/><br/>Upon hearing these words, Lady Su was on the verge of going mad, her delicate make-up looking distorted and glaring fiercely.<br/><br/>They had been plotting this for fifteen years, just waiting for Su Yichen to turn eighteen and take all the inheritance.<br/><br/>Before, they only knew that Su Yichen had to be eighteen years old to inherit. They used all sorts of tricks to forge and deceive Su Yichen, obtaining a voluntary inheritance resignation agreement and transfer letter of attorney.<br/><br/>But in the end, they were told that all these procedures had to be done with that little lowlife in person.<br/><br/>All their planning turned out to be in vain.<br/><br/>They were practically driven mad..\t\t\t\t\t\t</div>", "images": {}, "success": true}