{"id": 27, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14107171.html", "title": "Chapter 27 - Chapter 27: Chapter 27: All The Schemes Turned Out To Be In Vain.", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 27 - Chapter 27: Chapter 27: All The Schemes Turned Out To Be In Vain.</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 27: Chapter 27: All the schemes turned out to be in vain.<br/><br/>Translator: 549690339<br/><br/>Su Xiangdong and his wife returned to their luxury villa, their faces darkened with anger.<br/><br/>As soon as they entered the house, Lady Su threw her limited edition handbag  forcefully onto the sofa, clearly furious.<br/><br/>Her face turned green as she sat on the sofa, her eyes filled with venomous anger, her chest heaving with rage.<br/><br/>She resentfully said, “That bastard Liu Qing Ming must have done it on purpose. Why didn’t he tell us beforehand that the bastard’s presence was required to inherit that bitch’s inheritance?”<br/><br/>At this point, she continued angrily, “He was so close to that bitch when she was alive, even rumored to be in love with her. So, he must be doing this on purpose now. That little bastard is neither dead nor alive, where are we supposed to find him?”<br/><br/>Su Xiangdong sat on the sofa with a gloomy face, his expression clearly showing his anger.<br/><br/>He suddenly shouted at his wife, “Shut up!”<br/><br/>Lady Su, still in a fit of anger, was stunned by his outburst. After a moment, she screamed like a shrew, “Su Xiangdong, how dare you yell at me?! What gives you the right?!”<br/><br/>Su Xiangdong had no interest in acknowledging her tantrum, and instead walked straight to his study.<br/><br/>After locking the door, he took a black cellphone out of the safe.<br/><br/>He dialed a number, and an icy voice came from the cellphone: “Sorry, the number you dialed is currently powered off!”<br/><br/>Undeterred, he dialed another number, only to receive the same message: “Sorry, the number you dialed is currently powered off!”<br/><br/>Hearing the two messages, his dark eyes couldn’t help but reveal a hint of anxiety.<br/><br/>He muttered to himself, “It must be out of battery, it must be out of battery!” That was the only way to console himself.<br/><br/>He took a deep breath and blankly stared at the cold cellphone for a moment.<br/><br/>After a while, he put the phone back into the safe.<br/><br/>When he went out, he saw his eldest son, Su Hanyang, clenching his fists and angrily saying, “Weren’t you the ones who said that after that little bastard turns 18, I would inherit all of his mother’s property? Why can’t I now? That’s several billion worth of property! Are we just going to let that bastard take it all<br/><br/>Su Xiangdong walked over with a dark expression on his face, and sternly said, “Little bastard, little bastard, Su Hanyang, is that how you refer to your brother? You share the same father but different mothers; if he’s a little bastard, then what am I?”<br/><br/>Su Hanyang’s angry expression turned into disbelief as he said, “Dad, I…”<br/><br/>Su Xiangdong waved his hand and said, “Enough, don’t say it. Right now, we need to find Su Yichen as soon as possible and trick him into giving up his inheritance rights!”<br/><br/>At this point, his sharp, piercing eyes scanned his wife and son, warning,<br/><br/>“When he comes back, you must treat him like before, acting as a virtuous wife and obedient siblings, and completely gain his trust!”<br/><br/>After hearing this, Su Hanyang was clearly unwilling, and he angrily said, “Why should I? He robbed me of everything I had, and now I’m just taking it back. I won’t let him take advantage of me now, don’t even think about it!”<br/><br/>Su Xiangdong’s face darkened, and he said coldly, “Then you don’t have to think about his mother’s inheritance! ”<br/><br/>Su Hanyang,<br/><br/>Both hands clenched, his face ashen.<br/><br/>Lady Su immediately took Su Hanyang’s hand and said, “Yangyang, we’ve endured more than ten years, we don’t mind bearing it a bit longer. Just think about his mother’s inheritance.”<br/><br/>After that, Lady Su looked at Su Xiangdong and said, “Don’t worry, husband. When Su Yichen comes back, we will treat him as we did before, ensuring that he will gladly give up his inheritance rights.”<br/><br/>Upon hearing this, Su Xiangdong’s face slightly relaxed.<br/><br/>But he continued to warn, “For the sake of the inheritance rights in his hands, no matter how wronged or aggrieved you are, you must swallow it and bear it.<br/><br/>Once we have the inheritance rights, you can do whatever you want with him!”<br/><br/>Upon hearing this, Su Hanyang’s eyes lit up, and his face showed excitement, he said, “Dad, are you serious? He’ll be at my mercy later?”<br/><br/>“Mhm!” Su Xiangdong nodded and said, “So, Yangyang, you must be patient before obtaining the inheritance rights.”<br/><br/>Su Hanyang nodded and said, “Alright, dad, I understand!”<br/><br/>However, he secretly thought to himself, “Humph, Su Yichen, just let you be smug for now. Once you fall into my hands, you’ll be nothing more than a dog beneath my feet.”<br/><br/>He had already begun to imagine how he would torture this dog.<br/><br/>Suddenly, he thought of a question and asked, “Dad, Su Yichen hasn’t been home for several days, where is he now?”<br/><br/>Lady Su also asked with confusion, “That’s right, he hasn’t been home for a long time. In the past, he would at least call us if he was going somewhere. Now, he hasn’t called once in so long. Yangyang, call him!”<br/><br/>Su Hanyang nodded and said, “Okay, mom, I’ll call him now!”<br/><br/>After dialing the number, the response he got was: “Sorry, the number you dialed is currently powered off!”<br/><br/>Lady Su’s expression briefly faltered before saying, “Powered off? How could it be powered off? Yangyang, did you dial the wrong number?”<br/><br/>Su Hanyang shook his head and said, “No, I didn’t. Maybe it’s out of battery.”<br/><br/>Lady Su said, “We’ll try again later then. It’s strange, why would he disappear for so long without contacting us? Did he hear something?”<br/><br/>Su Hanyang’s face changed, “Could it be? Did he really find out we’re trying to deceive him and take over his mother’s inheritance? If that’s the case, he might not come back to this home, right? Then we wouldn’t get the inheritance rights! Mom, what should we do?”<br/><br/>After hearing Su Hanyang’s words, Su Xiangdong clenched his fists, and a hint of regret flashed in his eyes.<br/><br/>He was now afraid of that rebellious child…<br/><br/>Lady Su consoled her son, “Don’t worry, son. As long as he comes back to this home, I have the ability to deceive him into continuing to trust us!”<br/><br/>She then looked at Su Xiangdong and asked, “Husband, do you know where he is now?”<br/><br/>Su Xiangdong said coldly, “He rarely communicates with me, his father. How would I know where he is?”<br/><br/>Lady Su furrowed her brow and asked, “Then what should we do now? How can we find him?”<br/><br/>Su Xiangdong pondered for a moment and said, “First, try contacting his friends or his mother’s relatives.’<br/><br/>“Alright, we can only do that for now,” Lady Su nodded and agreed..\t\t\t\t\t\t</div>", "images": {}, "success": true}