{"id": 29, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14107183.html", "title": "Chapter 29 - Chapter 29: Chapter 29: Being Hit On", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 29 - Chapter 29: Chapter 29: Being Hit On</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 29: Chapter 29: Being Hit On<br/><br/>Translator: 549690339<br/><br/>Xiao Siqian had been to shopping malls before, but those were large ones encompassing a few thousand square meters or even tens of thousands of square meters.<br/><br/>Visiting a supermarket less than a thousand square meters was a first for him.<br/><br/>He had to admit that, though petite, the supermarket was nicely compact and complete.<br/><br/>The items were affordable and worthwhile.<br/><br/>Xiao’s mother directly led Xiao Siqian to the clothing department.<br/><br/>“Xiao Quan, try this white T-shirt. You’re over one point eight meters tall, with a model-like build. Whatever you wear looks good,” Xiao’s mother said with a smile.<br/><br/>Under Xiao’s mother’s teasing, Xiao Siqian blushed, took the clothes his mother picked, and went to the fitting room.<br/><br/>The waitress outside said to Xiao’s mother, “Your son is really handsome. Not only good-looking, but he also has a great figure. I’ve been selling clothes for many years and this is the first time I’ve seen someone so well-proportioned in both appearance and physique. Usually, those with good looks don’t have good bodies, and those with good bodies are not good-looking.”<br/><br/>Then, the waitress sweetly complimented Xiao’s mother, “Madam, you’re so beautiful and elegant, your son’s handsomeness must be inherited from you!” Xiao’s mother just laughed and didn’t respond.<br/><br/>After a while, when Xiao Siqian came out of the fitting room, he immediately caught the eyes of everyone around him.<br/><br/>“Wow, this guy is so handsome.”<br/><br/>A few girls were beside looking at clothes, the moment they saw Xiao Siqian, they held their cheeks, revealing a starstruck expression.<br/><br/>“He is really handsome, even more so than the captain of our school’s basketball team, and his figure is great.”<br/><br/>“Yeah, yeah, how can there be such a handsome guy? He’s just like the school prince in a television drama.”<br/><br/>“In my opinion, this guy is more handsome than the male lead in a drama. Ah, I feel like having a nosebleed.”<br/><br/>“How can he be so handsome, it’s simply infuriating. Who knows if this handsome guy has a girlfriend, should we ask him for his contact?” one girl with starry eyes wondered aloud.<br/><br/>“Why don’t we try it?”<br/><br/>Xiao’s mother, ‘<br/><br/>Are all the girls so bold nowadays?<br/><br/>Xiao’s mother covered her mouth and joked, “Xiao Quan, you’ve won over a bunch of girls. Hehe…”<br/><br/>Xiao Siqian remained composed. In Capital City, socialite daughters also surrounded him from time to time, which he found quite annoying.<br/><br/>Xiao’s mother looked at the clothes he tried on and said with a smile, “Xiao<br/><br/>Quan, you’re so handsome, you look great in anything you wear.”<br/><br/>The waitress on the side immediately echoed, “The Little Mister is beyond handsome. He looks great and fits perfectly in any clothes. Little Mister, why don’t you try on a few more sets?”<br/><br/>She thought to herself, “these two don’t seem to be short of money, if he tries on more sets, maybe they’ll buy more, then my commission bonus this month would be higher.”<br/><br/>Xiao’s mother also agreed, “Xiao Quan, come, try a few more sets. I just love seeing you in new clothes. You have a model’s body and make a perfect clothes hanger. Let me see more of my handsome little son.”<br/><br/>In the end, Xiao Siqian reluctantly tried on a few more sets to satisfy his new mother’s interest.<br/><br/>Encountering such a good-looking and well-built male customer, the waitress served them with a full smile.<br/><br/>The onlooking girls nearby, with their cheeks flushed, watched every set of clothes Xiao Siqian tried and offered their opinions enthusiastically.<br/><br/>“I think, he looks most handsome in that black one.”<br/><br/>“No, he looks best in that blue one.”<br/><br/>“He looks so good and bright in the white one.”<br/><br/>They argued incessantly for their own opinions.<br/><br/>After trying on over a dozen sets of clothes, Xiao’s mother wanted to buy them all.<br/><br/>After all, Xiao Siqian looked like a model in every set of clothes, which was truly a feast for the eyes.<br/><br/>Xiao Siqian declined, “Auntie, buying two sets is enough. Brother Xuan still has old clothes that I can wear.”<br/><br/>Xiao’s mother sternly refused, “That won’t do. Now that you’ve come to my home, you’re my son. How can I let you wear your Brother Xuan’s secondhand clothes? Besides, you can’t compare to your Brother Xuan’s physique; he’s really just a stick with no meat on his tall body.”<br/><br/>“…” Xiao Siqian said, “Auntie, Brother Xuan’s physique is also excellent, and he looks very handsome.”<br/><br/>Xiao’s mother replied, “Regardless of whether he’s good or not, you shouldn’t wear his old clothes. It’s not that I can’t afford to buy you new clothes!”<br/><br/>“Alright, listen to Auntie. I am eager to buy you new clothes and dress my new son in style. Isn’t that great?” Xiao’s mother spoke firmly.<br/><br/>Xiao Siqian,<br/><br/>He is left with no choice, but to agree for Xiao’s mother to buy those five suits of clothes.<br/><br/>As they were about to leave, a girl in a pink dress with the floating long hair and pretty face, blushed and shyly walked up to Xiao Siqian, asking,<br/><br/>“Handsome man, hello, I am Lai Siyi, a student from the first class in County Middle School. Which school are you from? Can we be friends?”<br/><br/>It is a well-known fact that Qing County Middle School is the best high school in the county, where all the top students from different towns are concentrated.<br/><br/>The first class of County Middle School, in particular, is the cream of the crop among all top-notch students.<br/><br/>Lai Siyi introduced herself this way for two reasons; she is proud of her top-student status, and naturally, she wanted to catch Xiao Siqian’s attention.<br/><br/>However, her flirtatious gaze was completely wasted.<br/><br/>Leaving aside the fact Xiao Siqian doesn’t come from this county and is unfamiliar with its local customs, he is also pretending to have amnesia in front of Xiao’s mother.<br/><br/>How could he possibly understand what being in the first class of County Middle School represents?<br/><br/>Xiao Siqian responded with a flat expression, “No!”<br/><br/>Xiao’s mother, The onlookers, Such a beautiful girl who studies well, most boys should be eager to know her.<br/><br/>However, this sunny and handsome boy appeared to be intellectually dense.<br/><br/>Lai Siyi,<br/><br/>Her face turned red immediately when she realized she had been rejected. Her beautiful face exuded awkwardness, embarrassment, a hint of grievance, and even some annoyance!<br/><br/>She never thought there would come a day when she was rejected by somebody after she took the initiative to befriend him.<br/><br/>This was really embarrassing.<br/><br/>She bit her lip, her eyes welling up with tears, holding back her tears, she said, “Tha-that doesn’t matter, we can… we can be friends next time whenever possible!”<br/><br/>After hearing these words, Xiao Siqian answered with evident impatience,<br/><br/>“There won’t be a next time!”<br/><br/>Lai Siyi looked momentarily stunned, then, no longer able to hold back her tears, she ran off crying.<br/><br/>Girls are generally sensitive about face-saving, let alone a pampered girl like her who is everyone’s favorite. She had already let go of her reserved demeanor and pride to befriend a boy, but was rejected and witnessed by so many people. How could she hold it together?<br/><br/>Lai Siyi’s three or four companions exchanged glances for a moment before chasing after Lai Siyi.<br/><br/>As they chased her, they said, “Siyi has never been rejected by a boy, this is the first time.<br/><br/>“This boy is too unfeeling. Siyi is good-looking, smart, and more than qualified to be his friend.<br/><br/>Their voices gradually faded into the distance.<br/><br/>Those onlookers stared somewhat speechlessly at Xiao Siqian.<br/><br/>Xiao Siqian disregarded their looks.<br/><br/>Feeling somewhat sorry for the girl, Xiao’s mother quickly bought several sets of clothes for Xiao Siqian and then left.<br/><br/>Though staying here wouldn’t bring shame, she didn’t want to be made a spectacle of..\t\t\t\t\t\t</div>", "images": {}, "success": true}