{"id": 28, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14107177.html", "title": "Chapter 28 - Chapter 28: Chapter 28: Ordinary Life Of Common People", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 28 - Chapter 28: Chapter 28: Ordinary Life Of Common People</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 28: Chapter 28: Ordinary Life of Common People<br/><br/>Translator: 549690339<br/><br/>At this moment, Su Yichen was unaware that the people in Capital City were scheming against him.<br/><br/>Even if he knew, he would just sneer and laugh it off.<br/><br/>Of course, he couldn’t see their anxious state either when they couldn’t get in touch with him.<br/><br/>He was currently pretending to have amnesia and had no plans to return to Capital City immediately.<br/><br/>“Ha, you want to learn how to ride a motorcycle?” Xiao Mother said with some difficulty, “But Xiao Quan, you don’t have an ID card even if you learn how to ride a motorcycle and get your license, right?”<br/><br/>Xiao Siqian said, “Aunt, I checked. Even if I have a fake name and temporary identity, it is still issued through the official channels of government agencies, and it is a form of ID proof that can be used to get a driver’s license. If I remember in the future, I can just change it back to my original identity, and the driver’s license can also be changed.”<br/><br/>After listening, Xiao Mother said, “Oh, so it can be done like this. Well, if you want to learn, go learn. But I’m not very good at riding a motorcycle either. When Little Li’s brother comes home, he can teach you. Once your riding skills are proficient, you can go take the driver’s license test!”<br/><br/>Xiao Sigian said, “Alright, thank you Aunt.”<br/><br/>The main reason he wanted to learn how to ride a motorcycle was to make it  easier to pick up Xiao Jinli in town.<br/><br/>He really liked the young girl, but of course, for now, he only thought of her as a sister.<br/><br/>Xiao Mother said, “Xiao Quan, come and have breakfast quickly. Then clean up and we’ll go to the county town to buy you two sets of clothes and buy some books for you to test.”<br/><br/>When he thought about how his friends in Capital City would laugh at the fact that he, an international brand-name university graduate, had to do elementary and junior high school tests, he couldn’t help but scoff.<br/><br/>When he thought of those friends in Capital City, Xiao Siqian’s eyes darkened slightly.<br/><br/>The Xiao family had a pretty good life.<br/><br/>In addition to a small western-style building, they had two motorcycles, a tricycle, and a small sedan worth over a hundred thousand RMB.<br/><br/>When Xiao’s Mother said she was going to take Xiao Siqian to the county town to buy clothes, Xiao Junxuan, Jinli’s older brother, drove them to the county town without any hesitation.<br/><br/>Xiao Siqian looked at Xiao Junxuan driving with admiration and said, “Brother Xuan, your driving skills are awesome, very steady. When did you learn to drive, Brother Xuan?”<br/><br/>Xiao Junxuan raised an eyebrow and smiled, “I started learning to drive at 16 and got my driver’s license at 18. Before I got my driver’s license, I drove without one.”<br/><br/>Xiao Siqian,<br/><br/>So he should be able to drive without a license, right?<br/><br/>However, he was already 18 years old and should be able to take the driver’s license test.<br/><br/>But in order to take the test, he had to pay a fee, which…<br/><br/>Xiao Siqian glanced at Xiao Junxuan secretly, and then his expression became resolute, thinking, “Anyway, I’ll have to pay off my debts. I’ll owe a million whether I like it or not, so I might as well owe ten million. In the future, I’ll pay it back.”<br/><br/>Xiao Mother laughed and said, “Little Xuan, Xiao Quan said he wants to take the driver’s license test. You can take him to the driving school to register in a few days.”<br/><br/>Xiao Junxuan nodded, “Alright, Mom! Mom, when you go shopping, don’t tire yourself out. If you get tired, find a cool place to rest. When it’s time to go home, give me a call and I’ll come to pick you up.”<br/><br/>Xiao Mother smiled and said, “Alright.”<br/><br/>Xiao Siqian saw the gentle expression on Xiao Mother’s face and the concern on Older Brother Xiao’s face, and his eyes couldn’t help but show a touch of sadness and envy.<br/><br/>So this is what genuine care and love look like?<br/><br/>A simple word of concern can make a person feel warm.<br/><br/>He suddenly thought of how his family used to care for him and couldn’t help but sneer.<br/><br/>It was ridiculous that he, the so-called genius of Capital City, never noticed his family’s fake care and love.<br/><br/>An hour later, they arrived at the county town. Older Brother Xiao dropped them off at the entrance of a large supermarket and told them, “Mom, it’s hot today, so drink more water and rest in a cool place.”<br/><br/>He then instructed Xiao Siqian, “Xiao Quan, take good care of my mom.” Xiao Siqian smiled and replied, “Alright, Brother Xuan, I will!”<br/><br/>Xiao Junxuan nodded, “Mom, I’m leaving now. Call me when you’re done shopping.”<br/><br/>Xiao Mother waved her hand and laughed, “Alright, go to work.”<br/><br/>Xiao Junxuan left.<br/><br/>Xiao Siqian followed behind Xiao Mother, beginning to take in the bustling area of this small county town.<br/><br/>Perhaps it was because it was daytime and time for work, so there weren’t many pedestrians coming and going.<br/><br/>Surrounded by some old residential buildings, the shops on both sides of the street all had the same format – white walls and red lacquered pillars, with grey signs and yellow characters, giving a somewhat solemn atmosphere.<br/><br/>The highest floor of the residential building was only six or seven stories, and some of the exterior walls were even peeling off.<br/><br/>Old residential areas are old residential areas, but the largest supermarket in the whole county is located here. Therefore, on holidays, the place is bustling with people and very lively.<br/><br/>At the entrance of the supermarket, on both sides of the street, various items are sold. When there were no patrols, there were fruit sellers, toy sellers, pickled radish sellers, specialty sellers… all kinds of things.<br/><br/>Xiao Siqian grew up in Capital City, where the bustling metropolis was full of high-rise buildings and a crisscross network of streets. Cars shuttled through the streets, and at night, it was a dazzling world of red lights and wine.<br/><br/>He took three steps and had a private jet to pick him up. He wore high-end custom clothes, and ate food prepared by either five-star chefs at home or high-end restaurants outside.<br/><br/>Overall, he never had to worry about life.<br/><br/>He was just a high and mighty young master from Capital City and never experienced the colorful lives of ordinary people.<br/><br/>Now, suddenly, from a phoenix to a land chicken, he felt very complicated about this change.<br/><br/>However, for now, he quite enjoyed this peaceful and warm ordinary life.<br/><br/>Living an ordinary life and experiencing a variety of human emotions.<br/><br/>Sometimes, money can indeed provide a luxurious life.<br/><br/>But money can also cause one to lose their way, become more greedy and even lead to loss of humanity.<br/><br/>Money…<br/><br/>“Xiao Quan, what are you daydreaming about? Follow Aunt!”<br/><br/>Xiao Mother went into the shopping mall and was about to take the elevator, but she looked back and saw that Xiao Siqian hadn’t followed.<br/><br/>Xiao Siqian snapped back to reality and quickly replied, “Oh, coming, Aunt!”<br/><br/>Xiao Siqian was handsome and tall, so when they entered the mall, the eyes of the female staff inside brightened up.<br/><br/>“Oh wow, a handsome man has come. He’s so handsome. It’s the first time I’ve seen such a handsome man.”<br/><br/>“It’s also my first time seeing such a handsome man. His features are sharp and well-defined, and when combined, he’s just a perfect-looking man. However, he still looks like a boy by his age.” “With such a handsome boy, there must be a lot of girls chasing after him!” “What, you want to chase him?”<br/><br/>“Haha, if I chase him, it would be like an old cow eating young grass.”<br/><br/>“Hehe, the question is, can you catch up with him?”\t\t\t\t\t\t</div>", "images": {}, "success": true}