{"id": 24, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14106518.html", "title": "Chapter 24 - Chapter 24: Chapter 24: Repay The Kindness Of A Drop Of Water With A Gushing Spring.", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 24 - Chapter 24: Chapter 24: Repay The Kindness Of A Drop Of Water With A Gushing Spring.</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 24: Chapter 24: Repay the kindness of a drop of water with a gushing spring.<br/><br/>Translator: 549690339<br/><br/>Xiao Jinli led the two police officers up the mountain, followed by Xiao<br/><br/>Qingshan and the village head, as well as five or six other young villagers.<br/><br/>After all, the mountain was very dangerous, and wild beasts might appear.<br/><br/>For safety’s sake.<br/><br/>Of course, to their surprise, they arrived at the top of the mountain without any issues.<br/><br/>The only unexpected thing was that the two officers were unfamiliar with the mountain road and tripped a couple of times.<br/><br/>Officer Chen raised an eyebrow in surprise and asked, “Didn’t you say there were many wild animals in this mountain? How come we didn’t encounter<br/><br/>Xiao Qingshan replied matter-of-factly, “That’s because Jinli is leading the way. Wherever Jinli goes, things tend to go smoothly.”<br/><br/>Officer Chen looked at Xiao Jinli in surprise, “Oh, is that really the case?”<br/><br/>Xiao Qingshan said proudly, “Of course it is. Jinli has been incredibly lucky ever since she was a child. Wherever she goes, things go smoothly. She’s our village’s lucky star.<br/><br/>When we brought her home from the hospital as a baby, our long drought-stricken village was instantly relieved with rain. The village believed that it was Jinli’s good fortune that had come to us. So, our respected elders in the village, along with her parents, decided to name her Jinli, Xiao Jinli.” Officer Chen was intrigued and was about to ask more questions when the village head interjected, “Ahem… Officers Chen and Xiao, we’ve arrived!” At his announcement, Officer Chen immediately turned around.<br/><br/>What he saw was the towering Giant Pine Tree reaching into the clouds.<br/><br/>Officer Xiao blinked in amazement and exclaimed, “What a huge tree! It’s so lush, magnificent, strong, and beautiful!”<br/><br/>The village head and other villagers had also never seen this big pine tree on the mountaintop before.<br/><br/>Normally, no one dared to come up here.<br/><br/>Xiao Qingshan was also slightly surprised.<br/><br/>He looked at Xiao Jinli and asked, “Jinli, do you usually come to this spot when you come up the mountain?”<br/><br/>Xiao Jinli nodded, “Yes. This place has a wide view, good air, and is very quiet. That’s why I like coming here.”<br/><br/>Xiao Qingshan immediately asked sycophantically, “Jinli, can you take me here next time? I want to rest and play here as well!”<br/><br/>Xiao Jinli refused without hesitation, “No, this is my territory. If it weren’t for today’s special circumstances, I wouldn’t bring you guys here.”<br/><br/>She walked over to a spot and pointed out, “This is where I found the man lying unconscious, face towards the cliff, a few days ago.”<br/><br/>Officer Chen went to the spot, squatted down, and examined it carefully, asking, “Did you see anyone else when you came here?”<br/><br/>Xiao Jinli shook her head and then thought of something, “When I arrived, I saw a big tiger near him, but the big tiger ran away as soon as it saw me. I don’t know if the tiger wanted to eat him or if it saved him. But I didn’t see anyone else.”<br/><br/>Officer Xiao was shocked.<br/><br/>He couldn’t believe it, “A big tiger? Is there really a tiger? Why would a tiger run away when it saw you? Could it be…”‘<br/><br/>Xiao Qingshan rolled his eyes at the question and explained, “Officer Xiao, like I said, Jinli has been incredibly lucky since she was a child. Even the fiercest beasts will run away when they see her. So isn’t it normal for the big tiger to run away when it sees Jinli? Jinli has the protection of the God of Fortune, so nothing can harm her.”<br/><br/>Officer Xiao shook his head, “It’s not normal, not normal. It doesn’t make sense. Even if she has good luck, it can’t make vicious animals that would eat people run away when seeing food.”<br/><br/>Officer Xiao felt something was wrong but couldn’t pinpoint what it was.<br/><br/>Worried that rumors might harm Xiao Jinli, the village head decided to address Officer Xiao’s confusion carefully, “Officer Xiao, Jinli has always had such luck in our village, and we’re used to it. But luck is something we can’t understand, right?<br/><br/>Otherwise, there wouldn’t be such a thing as good luck and bad luck. Some people have such bad luck that even drinking water gets stuck in their teeth, can that be explained? Does that make any sense? No, it doesn’t.<br/><br/>So, maybe it’s Jinli’s good fortune that somehow makes the animals instinctively feel that they shouldn’t mess with her. After all, every animal has an instinct to seek benefits and avoid harm.’<br/><br/>Listening to the village head’s explanation, Officer Xiao pondered for a moment and nodded, “Indeed, there’s some truth to that. Just like buying lottery tickets, some people never win anything big in their lifetime, while others win a huge prize the first time they buy. Luck really is something you can’t put your finger on.”<br/><br/>Officer Chen squatted down and examined the surroundings carefully. He then asked, “Did you find anything belonging to him when you found him, like an ID for example?”<br/><br/>Xiao Jinli shook her head, “No! When I came here, he was lying here full of blood. I called out a few times and got no response, so I immediately carried him down the mountain. Then I met Uncle Deming from the village, who took him over. After that, Qingshan took him to the hospital.”<br/><br/>Officer Chen thought for a moment and said, “We want to look around!”<br/><br/>The village head responded, “Of course.”<br/><br/>Xiao Jinli joined them, “I’ll go too.”<br/><br/>Officer Chen didn’t refuse.<br/><br/>Technically, it was very dangerous for a young girl to move around in the mountain.<br/><br/>However, according to the villagers in Xiao Family Village, this girl had incredibly good luck, and the wild beasts would flee when they saw her.<br/><br/>And indeed, that was the case.<br/><br/>The whole journey up, they didn’t encounter any danger, most likely because of the girl.<br/><br/>Soon, everyone began searching for clues in the mountain.<br/><br/>But they found nothing whatsoever!<br/><br/>Officers Chen and Xiao had no choice but to return empty-handed.<br/><br/>“I’m sorry, sir, we couldn’t find anything about your identity,” Officer Chen told Su Yichen.<br/><br/>Shaking his head, Su Yichen replied, “Officer, you don’t need to apologize. It’s me who has lost my memory and can’t remember who I am. If I could, you wouldn’t have to work so hard trying to find my things.”<br/><br/>Officer Chen smiled and said, “There’s no need to be so polite, kid. It’s our duty as police officers to help. We can issue you a temporary ID after you leave the hospital, but what should we put down as your name?”<br/><br/>Yichen frowned for a moment and then brightened up, “Officer, I was saved by a little girl from Xiao Family Village, she’s my savior. Can I take her last name? As for my first name, I’ll go with Siqian (a name derived from a Chinese saying that means one must repay a favor as soon as possible).”<br/><br/>Officer Chen thought for a bit and said, “You’re a grateful child. Alright, I’ll use the name Xiao Siqian to issue you a temporary ID.” Yichen thanked him happily, “Thank you, Officer!”\t\t\t\t\t\t</div>", "images": {}, "success": true}