{"id": 35, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14107219.html", "title": "Chapter 35 - Chapter 35: Chapter 35: Being Expelled (Happy New Year)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 35 - Chapter 35: Chapter 35: Being Expelled (Happy New Year)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 35: Chapter 35: Being Expelled (Happy New Year)<br/><br/>Translator: 549690339<br/><br/>Teacher Xiao couldn’t understand at the moment, why would these school leaders defend a student who just slept in class and had poor academic results so much?<br/><br/>Moreover, her uncle was the School Guidance Director; wouldn’t the two principals give him some face?<br/><br/>She knew that her credibility as a teacher might be severely damaged this time, yet they chose to not defend her but to put more pressure on her.<br/><br/>Teacher Xiao felt that this was the most humiliating experience she had had since becoming a teacher.<br/><br/>Xiao Junxuan saw that Teacher Xiao didn’t answer Principal Chen’s question for a long time, and knew that her problem was huge. He asked coldly, “Teacher Xiao, is it so difficult to just respond whether what the two little classmates said is true or not?”<br/><br/>Teacher Xiao’s face was extremely ugly, and she looked at her uncle with a pleading look.<br/><br/>Guo Chungui received this pleading look from his niece and his face turned black immediately.<br/><br/>He didn’t deny the facts stated by the two little classmates at all.<br/><br/>As a relative of the Xiao Family, he knew very well that Xiao Jianming was the darling of the entire Xiao Family. They wouldn’t even dare to use harsh words, let alone criticize or beat him. They spoiled him without any principles.<br/><br/>But he didn’t expect that his niece would also spoil that child so unprincipledly at school.<br/><br/>Bullying classmates was just brushed off so lightly.<br/><br/>This niece even made a bigger fool of herself by reporting the matter directly to the Principal.<br/><br/>It was obvious that she, as a teacher, didn’t fulfill her responsibilities, but she pushed the blame onto her students. Is this what a role model should do?<br/><br/>She was obviously too biased!<br/><br/>Director Guo took a deep breath and said with a solemn face, “Teacher Xiao, as a teacher, the first thing you should do is to be fair and impartial to every student without any bias.<br/><br/>With so many mistakes made by Xiao Jianming, have you ever seriously criticized or educated him? Now, you just push the blame onto your students, causing many of them to have strong resentment towards you. Teacher Xiao Hongmei, honestly, I am very disappointed in you!”<br/><br/>Xiao Hongmei felt like she had been heavily struck, and looked at her uncle in disbelief.<br/><br/>She never thought that her uncle, whom she had hoped would side with her, would end up criticizing her in public.<br/><br/>With her strong self-esteem, she couldn’t accept this.<br/><br/>With red eyes and a look of great grievance, she tried to defend herself, “Uncle, you know what kind of child Jianming is. He is just naughtier and more mischievous than other children, and he hasn’t caused any substantial harm to other students. It’s just that these children are overreacting and making a big deal out of it. Tearing apart a textbook is not a big deal, and I can just replace it. Why do I have to give them justice? Isn’t this a blatant provocation of my authority as a teacher?”<br/><br/>Tearing apart a textbook…<br/><br/>Upon hearing her words, Principal Chen, Vice-principal Lin, and Guo Chungui were all shocked.<br/><br/>Xiao Jinli’s worldview was also shattered by a teacher.<br/><br/>What does she mean by naughtier and more mischievous? Bullying, beating, and taunting classmates, tearing apart their textbooks, not participating in collective labor – aren’t these mistakes serious enough?<br/><br/>For an elementary school student, these are already very serious and solemn issues.<br/><br/>Principal Chen and Vice-principal Lin exchanged glances.<br/><br/>After a while, Principal Chen said to Guo Chungui, “Director Guo, I think<br/><br/>Teacher Xiao Hongmei is not suitable for the position of a teacher.”<br/><br/>Vice-principal Lin also nodded and chimed in, “I agree with what Principal Chen said. Teacher Xiao Hongmei’s behavior, attitude, and moral character are all unsuitable for the position of a teacher.<br/><br/>A teacher is supposed to educate and nurture students, guiding, leading, and organizing their mental and physical development.<br/><br/>The quality of a teacher’s work is related to the level of mental and physical development of our younger generation and the improvement of national quality, which in turn affects the rise and fall of the country.<br/><br/>How can a teacher with a skewed worldview properly educate students?”<br/><br/>Teacher Xiao listened to the criticism from the two principals and felt as if she had been struck by lightning.<br/><br/>How did things escalate to this point? Her original intention was to expel Xiao Jinli, or at worst, have her transfer classes. In any case, she did not want to deal with this thorn in her side.<br/><br/>Unexpectedly, the troublemaker in her class was not expelled, but she, the teacher, was dismissed instead.<br/><br/>This was truly absurd!<br/><br/>Xiao Hongmei stared wide-eyed at Principal Chen and Vice-principal Lin, then looked at her uncle in amazement. She stammered, “Exp… expel me? Why?<br/><br/>What did I do wrong?”<br/><br/>Guo Chungui frowned again.<br/><br/>Xiao Hongmei still didn’t understand where she went wrong.<br/><br/>Does she think she can do whatever she wants with her students just because she is a teacher?<br/><br/>With such heavy bias, how can she educate and nurture students in the future?<br/><br/>Guo Chungui sighed and said, “Hongmei, do you still not know where you went wrong? If that’s the case, you should reflect on yourself and think about what your original intention was as a teacher.”<br/><br/>At this time, Principal Chen said, “Regarding Teacher Xiao Hongmei’s qualifications to stay at school and continue teaching, we need to discuss further in a meeting.”<br/><br/>After saying that, he looked at Xiao Jinli and Xiao’s mother with a smile and said, “Xiao Jinli, you and the other two kids go out first, and I’ll have a chat with your mom. Is that alright?”<br/><br/>Xiao Jinli’s eyes flashed and he nodded slightly, “Okay!”<br/><br/>After saying that, he went out with Hu Hongmei and Dong Qiufang, standing directly outside the principal’s office.<br/><br/>As soon as they went out, Hu Hongmei nervously asked, “Xiao Jinli, will Teacher Xiao really be fired and not be a teacher anymore?” She was extremely worried in her heart.<br/><br/>They reported Teacher Xiao, and they were genuinely terrified.<br/><br/>Teacher Xiao was a teacher after all, their class headteacher. They were afraid she would target the three of them in the future.<br/><br/>Teacher Xiao wanted to expel Xiao Jinli and didn’t want her as a student, which made them feel very uneasy and scared, especially Hu Hongmei, who felt even more guilty.<br/><br/>Because Xiao Jinli was disliked and targeted by Teacher Xiao just for defending her.<br/><br/>Who would have thought that Xiao Jinli wasn’t expelled, but Teacher Xiao was instead?<br/><br/>Xiao Jinli shook his head and said, “Even if Teacher Xiao isn’t fired, her position as the class headteacher will be revoked, and she may even receive a severe warning as punishment!”<br/><br/>After all, Teacher Xiao had some problems with her worldview and she was biased. Students brought up by her could easily go astray.<br/><br/>Hu Hongmei looked at the door and whispered to Xiao Jinli, “I don’t want Teacher Xiao to continue teaching us. If she continues to teach us, then we three definitely won’t have good days.”<br/><br/>“…” Xiao Jinli patted her on the back of her hand and comforted her, “Don’t think too much about it, the school will arrange everything properly!”<br/><br/>Even if Xiao Hongmei was to continue teaching, it would be impossible for her to teach their class again.<br/><br/>After all, the school had to take her character issues into consideration.<br/><br/>Dong Qiufang also cautiously said, “Jinli, I feel that Teacher Xiao is really terrifying. Do you think so too?”<br/><br/>Xiao Jinli, ‘\t\t\t\t\t\t</div>", "images": {}, "success": true}