{"id": 31, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14107195.html", "title": "Chapter 31 - Chapter 31: Chapter 31: Scoring Control Genius", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 31 - Chapter 31: Chapter 31: Scoring Control Genius</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 31: Chapter 31: Scoring Control Genius<br/><br/>Translator: 549690339<br/><br/>Hearing Teacher Xiao’s question, Xiao Jinli said, “Of course, he should be punished by sweeping the toilet.”<br/><br/>What Xiao Jianming feared most was working, especially cleaning toilets. In the school playground and water channel, each class took turns to clean, and the toilets were cleaned by the whole class one by one.<br/><br/>As the class bully, when Xiao Jianming was on duty, he either slacked off or instructed his minions to do the work, and no one dared to complain. Teacher Xiao just turned a blind eye to all of this.<br/><br/>Now that Xiao Jinli suggested that Xiao Jianming clean the toilet, this made Teacher Xiao very displeased.<br/><br/>You should know that her nephew was her parents’ only grandson, her brother and sister-in-law’s only son, and her only nephew. The whole family cherished him, afraid of breaking him or melting him in their mouths. At home, he didn’t even have to buy a bottle of soy sauce, let alone do any cleaning, because they were afraid it would tire the child.<br/><br/>Therefore, Teacher Xiao said unhappily, “Student Xiao Jinli, I have a plan for criticizing and punishing Student Xiao Jianming. I know what you have said, now go home early and don’t worry your parents.”<br/><br/>Xiao Jinli knew from Teacher Xiao’s words that she was simply perfunctory towards them, and by tomorrow, she would have completely forgotten about this matter.<br/><br/>Xiao Jinli slightly swept her eyes around the office at the other teachers before adopting a serious and strict tone,<br/><br/>“Teacher Xiao, every time Xiao Jianming makes a mistake, you say you know, but then you just give him a few light words. Then, next time, he continues to make mistakes without changing, even escalating his bullying of other students.<br/><br/>Teacher Xiao, I think you must let Xiao Jianming apologize to Hu Hongmei in front of us and accept severe punishment, so he can learn his lesson deeply. Next time, he won’t be able to continue bullying other students.”<br/><br/>After listening to Xiao Jinli’s words, the teachers in the office looked at Teacher Xiao with strange eyes.<br/><br/>Teacher Xiao originally planned to appease the three students, but she didn’t expect Xiao Jinli to leave her with no face, making her complexion turn red and white.<br/><br/>Unable to hold back her anger, she shouted, “Xiao Jinli, Teacher Xiao doesn’t need you to teach me what to do. Instead of criticizing others, why don’t you look at yourself? You can’t even keep up with your grades and sleep in class all the time, dragging our class down. What right do you have to criticize others?” At this, Teacher Xiao took a deep breath and said, “Student Xiao Jinli, I’m officially telling you, you’re contradicting the teacher, and I’m going to punish you. Tomorrow in class, you’ll have to stand outside the classroom and bring your parents as well. You sleep in class every day and don’t participate in any class activities or even respect the teacher. I want to ask now, how were you raised to be so wayward and disrespectful to authority?”<br/><br/>Another teacher by the name of Yang, after hearing Teacher Xiao’s words, frowned slightly, feeling that Teacher Xiao’s approach was somewhat excessive.<br/><br/>This student was merely standing up for a classmate, and Student Xiao made a reasonable argument without contradicting the teacher or disrespecting authority.<br/><br/>Teacher Yang looked at Xiao Jinli, his eyes narrowed, but he didn’t say anything.<br/><br/>He had heard about this student, Xiao Jinli, before.<br/><br/>Oh no, it should be said that Xiao Jinli had become famous throughout the school and even had a place in the principal’s mind.<br/><br/>Besides sleeping all day in class, what was most surprising about her was her academic performance.<br/><br/>No matter how many students there were in her grade, her score was always right in the middle.<br/><br/>For example, in first grade with 220 students, her score would definitely be at 110. There was no variation whether it was a unit test, a month exam, or a mid-term or final exam; she always ranks 110th.<br/><br/>And, for example, when there were 187 students in the second grade, her score would definitely be locked in at 99th place.<br/><br/>The same occurred in the third and fourth grades, with her results consistent each and every time.<br/><br/>This was quite miraculous.<br/><br/>As a result, many teachers and the principal have analyzed her performance and test papers. They believe that not only can Xiao Jinli manipulate her scores but also has a strong logical thinking ability.<br/><br/>Not only can she judge the difficulty of the test, but she can also determine the performance of other students, which is as good as installing CCTV cameras beside each student.<br/><br/>Even the teachers themselves couldn’t control the performance of each student.<br/><br/>Xiao Jinli could be said to be a genius.<br/><br/>It’s just that this genius didn’t seem to care much about her ranking in academic performance, only maintaining her place in the middle.<br/><br/>Before, the class headteacher had talked to her a few times, and even the principal stepped in to encourage her to fully realize her abilities and bring honor to the class or the school.<br/><br/>But for some reason, the persuasions stopped after Xiao Jinli talked to the headteacher and the principal.<br/><br/>Teacher Xiao, who had just been transferred this semester, was not familiar with Xiao Jinli’s situation. Consequently, she loathed Xiao Jinli’s lazy study habits and was unable to control her, whether it was through difficult classroom questions or difficulties outside the classroom.<br/><br/>Being unable to manage a student was a disgrace to her teaching career.<br/><br/>Seeing Xiao Jinli’s fair and pretty face seemingly expressionless, Teacher Xiao’s anger grew. She shouted sternly, “Xiao Jinli, did you hear what the teacher said? Are you made of wood? Don’t you know how to make a sound?”<br/><br/>Teacher Xiao’s state was clearly like that of a shrew.<br/><br/>Hu Hongmei and Dong Qiufang, both looking a little scared and timid, turned pale when they saw the teacher’s anger.<br/><br/>They didn’t expect the class headteacher to scold Xiao Jinli like this and even ask Xiao Jinli’s parents to come.<br/><br/>They carefully tugged at Xiao Jinli’s clothes, unsure of what to do.<br/><br/>Xiao Jinli, however, was not afraid of Teacher Xiao. She patted Hu Hongmei on the back and followed with a calm statement,<br/><br/>“Teacher Xiao, I am speaking only to the matter at hand and not disrespecting you or the teacher’s authority. All I want is for you to stand up for Hu Hongmei and have Xiao Jianming apologize to her directly. Then, give Xiao Jianming a punishment to prevent him from bullying others in the future. What’s wrong with that?<br/><br/>There are so many teachers here, Teacher Xiao. Why don’t you let the other teachers judge who is in the wrong? If I’m wrong, I’ll apologize to you, but if you’re using this as an excuse to vent your anger and ask for my parents, I have nothing to say!”<br/><br/>Hu Hongmei and Dong Qiufang looked at Xiao Jinli with admiration in their eyes.<br/><br/>Xiao Jinli was so brave and dared to confront the class headteacher’s anger.<br/><br/>Teacher Xiao’s face turned red and blue with anger as she was rebuked by Xiao Jinli.<br/><br/>She pointed at Xiao Jinli furiously, “You…You…you are so reckless! How dare you talk to a teacher like this? Believe it or not, I will expel you and prevent you from going to school..”\t\t\t\t\t\t</div>", "images": {}, "success": true}