{"id": 39, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14107243.html", "title": "Chapter 39 - Chapter 39: Chapter 39: The Spiritually Awakened Cow King (Seeking Recommendations And Reviews)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 39 - Chapter 39: Chapter 39: The Spiritually Awakened Cow King (Seeking Recommendations And Reviews)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 39: Chapter 39: The Spiritually Awakened Cow King (Seeking Recommendations and Reviews)<br/><br/>Translator: 549690339<br/><br/>Seeing Cow King followed by a group of large and small yellow cattle and water buffalo, a total of more than ten, Xiao Chunfu was extremely surprised. He clearly recognized that these cattle did not belong to their village.<br/><br/>He wondered, “Where did these cows come from?”<br/><br/>Xiao Jinli said, “Once Cow King comes over, we’ll know where these cows came from. However, according to my guess, Cow King might have really been stolen by the cattle thief. But not only did Cow King escape on his own, he also brought back the other cows stolen by the thieves.” After hearing this, Xiao Chunfu laughed out loud.<br/><br/>He grinned, “So the cattle thieves’ plan backfired. Haha, Cow King really lives up to its name. It’s truly amazing.”<br/><br/>Xiao Siqian, “…” He now really doubts whether there is such a smart cow that exists? A cow that not only saves itself but also saves other cows.<br/><br/>Xiao Jinli and the others stood on the mountain top, while Cow King and the others were still at the foot of the mountain, walking through the fields.<br/><br/>Xiao Jinli looked into the distance, squinting his eyes, and suddenly said, “There are several people following behind, who should be the cattle thieves.<br/><br/>They noticed that Cow King had escaped and now they’re chasing after him.”<br/><br/>Hearing this, Xiao Chunfu became anxious, and said loudly, “What are we waiting for, let’s go down quickly. These cattle thieves are really hateful. Who knows how many of these ten cattle were stolen by them?”<br/><br/>With that, Xiao Chunfu took the lead in jogging down the small path, making quick and urgent moves.<br/><br/>Xiao Jinli immediately shouted, “Uncle Chunfu, be careful. Since we’ve discovered them, they can’t possibly steal the cows back again. Oh, right, you should also make a call to gather the others. There are more of them, and we are likely to have a confrontation.”<br/><br/>Reminded of this, Xiao Chunfu also nodded and said, “Right. I need to hurry up and notify the others to come over quickly. Oh, and Jinli, should we call the police?”<br/><br/>“Let’s report it!” Xiao Jinli nodded.<br/><br/>Hearing their conversation, Xiao Siqian felt a bit strange.<br/><br/>Why does he always feel like Xiao Chunfu is listening to Xiao Jinli? After all, Xiao Jinli is only ten years old.<br/><br/>After calling the other villagers, Xiao Chunfu immediately called the police.<br/><br/>Then, they rushed down the mountain.<br/><br/>Xiao Jinli put his thumb to his lips and immediately whistled loudly.<br/><br/>Originally at a relaxed pace, Cow King immediately perked up upon hearing the whistle, turned his head, let out a loud “moo” towards the cows behind him, and then accelerated his pace, even starting to run.”<br/><br/>Seeing the sudden sprint of the running cattle, the cattle thieves’ expressions changed abruptly, cursing under their breath, “What the fuck, is this cow possessed?”<br/><br/>Immediately, one of them said to his companions, “We have to run fast. Do you guys still have tranquilizers?”<br/><br/>Without tranquilizers, catching up with these cows would be no use.<br/><br/>They can still run.<br/><br/>“Also, call Little Wang and ask where the car is? Tell him to call some more people over. With so many cows, we seven or eight people won’t be able to handle them all.”<br/><br/>Hearing this, his companion immediately took out his phone and called Little Wang.<br/><br/>After hanging up, he said to Li Yuanming, “Brother Ming, Little Wang has already driven the car to the Back Village Entrance, and he has called more than ten people who will be here soon.”<br/><br/>Li Yuanming was slightly dissatisfied, “It took him so long just to get to the village entrance. What has he been doing? Doesn’t he know how big of a loss it would be if we lost these eleven cows? Now that these cows have escaped, we must not let their previous owners find out. So, the sooner we catch them, the better. Otherwise, none of us will be able to face the consequences!”<br/><br/>Immediately after, the group of people sped up their pace.<br/><br/>But there was no way their two legs could catch up with four.<br/><br/>One of the men complained, “Damn, this field path is really difficult to walk on, it’s all muddy. If the road was better, we wouldn’t need to use our legs, a two-wheeled motorcycle would be enough to catch up with them.”<br/><br/>Li Yuanming spoke with a dark face, “You don’t have to say it, if we had a motorcycle, we would have caught up already.”<br/><br/>Brother Ming, the cow we caught this morning is really cunning. It’s smarter than the ones we’ve stolen before. It actually knows how to open the cowshed to escape,” Zhang San said with suspicion.<br/><br/>“Not only can it open doors, but it can also untie ropes. It’s really strange,” Li Si muttered, “A cow that can open the cowshed isn’t amazing, but what’s amazing is that it can untie a rope, untie a rope. If we had known earlier that a cow could untie a rope, we would have slaughtered it first.”<br/><br/>“Shut up! With this energy, let’s catch these cows!” Li Yuanming scolded, then said, “A smart cow, when sold to a cattle enthusiast, is definitely better than slaughtering it.”<br/><br/>If slaughtered and sold, they could only make 20,000 at most.<br/><br/>But if sold to cattle enthusiasts, they could sell it for a hundred thousand or eighty thousand.”<br/><br/>Li Yuanming decided that once they caught the cow, he would find a way to contact the enthusiasts and sell it at a high price.<br/><br/>“I’ve found out about the cow we caught this morning. Everyone in Xiao Family Village calls it Cow King. The village’s cows are usually led and managed by it, preventing the other cows from destroying the villager’s crops. Usually, the cattle herders would feel at ease to play when they saw this cow.”<br/><br/>Upon hearing this, Li Yuanming glared at him.<br/><br/>He shouted angrily, “Why didn’t you mention this important information before? If you had said it, we would have been more cautious.”<br/><br/>Zhang San defended, “I thought they were just exaggerating. I’ve never seen a cow that can manage a herd in all my life. I’ve been watching this cow for several days, and it usually acts alone, hardly seen with other cows, and no one watching over it. I thought it was like those chickens and ducks who go out to forage in the morning and then know when to go home at night.”<br/><br/>Li Yuanming was so angry that he almost died, and he shouted, “Just because you haven’t seen it, doesn’t mean it doesn’t exist! Enough, no more nonsense, these cows are running faster and faster, let’s hurry up and catch up!”<br/><br/>With that said, the three of them also quickly ran after the cows.<br/><br/>But the distance between them and the running cows was getting farther and farther.<br/><br/>Li Si, who had a good vision, immediately noticed three figures coming down from the mountain.<br/><br/>He was surprised, “Brother Ming, there are people coming down from the mountain! Are they here for the cows?”<br/><br/>“Are they from the opposite side of the Xiao Family Village? The cow we caught this morning is from the Xiao family village, and the direction these cows are escaping to is exactly where their village is. Have they found out that the cow was stolen?” Zhang San asked, feeling slightly panicked as he spoke.<br/><br/>After all, thieves have a guilty conscience!\t\t\t\t\t\t</div>", "images": {}, "success": true}