{"id": 38, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14107237.html", "title": "Chapter 38 - Chapter 38: Chapter 38: Cow King Brought A Group Back", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 38 - Chapter 38: Chapter 38: Cow King Brought A Group Back</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 38: Chapter 38: Cow King Brought a Group Back<br/><br/>Translator: 549690339<br/><br/>Soon, the three of them arrived at the rear mountain while chatting and walking.<br/><br/>the rear mountain, called Niu Xinshan, is opposite the Red Peak Mountain in the dense and wild forest.<br/><br/>Niu Xinshan consists of several hills, although it is also overgrown with vegetation. Usually, people in the village would go there to cut firewood, mow grass, or release their cattle.<br/><br/>As a result, children feel safe visiting Niu Xinshan, and it would be entirely normal for Cow King to go there as well.<br/><br/>Niu Xinshan also connects with several nearby villages, and there are small paths leading to various villages.<br/><br/>Before the arrival of Cow King, village children had to constantly watch and keep hold of their cattle when grazing, for fear that a cow might run off to another village.<br/><br/>Back then, cattle were very valuable livestock, and if they were lost, they would hardly be recovered.<br/><br/>Since the appearance of Cow King, as the leader, the Cow King supervised the herd, not allowing them to leave Xiao Family Village.<br/><br/>“The Cow King occasionally disappears but always returns home on its own,” said Xiao Chunfu. “Today, being away for the whole day is really unusual.”<br/><br/>Xiao Chunfu was somewhat worried and said, “Jinli, some people in the village went along this path to search, but no one has reported any information yet. Was Cow King really stolen?”<br/><br/>Halfway through, Xiao Jinli’s sharp eyes scanned the surroundings. The mountain was not high, but the dense trees and shrubs blocked the view in all directions.<br/><br/>If the cattle thieves used anesthesia, Cow King might not be able to escape and could be in real danger.<br/><br/>After contemplating for a moment, Xiao Jinli said to Xiao Chunfu and Xiao<br/><br/>Siqian, “Uncle Chunfu, I’ll go look over there, you guys wait here for me.”<br/><br/>The direction Xiao Jinli pointed to was where the trees in the mountain were the densest. The tall and densely gathered trees looked somewhat gloomy. Such places often hid great dangers.<br/><br/>Xiao Siqian said, “It looks dangerous there-I’ll go with you!”<br/><br/>Xiao Jinli, having a secret task to accomplish, didn’t want Siqian to follow her.<br/><br/>With an eye-roll and a slightly speechless tone, she said, “Brother Siquan, I’m going over there to answer the call of nature. Do you want to come with me?” Xiao Siqian’s face flushed red immediately.<br/><br/>“Pfft!” Xiao Chunfu, being a countryside man, didn’t find this remark rude. He laughed and said, “Alright, Jinli, you go. Little Quan and I will wait for you here!”<br/><br/>After Xiao Jinli left, Xiao Siqian worriedly asked, “Uncle Chunfu, that place looks dangerous. What if Little Li encounters snakes or insects while…when she goes to that place to answer the call of nature? She is just a child and a little girl, after all.”<br/><br/>Xiao Chunfu laughed and said, “Little Quan, don’t worry about that! Jinli has a lucky star protecting her since she was young. No matter how fierce the beasts are in the mountains, they will avoid her! So even the most dangerous places in the mountains pose no threat to Jinli!”<br/><br/>Xiao Siqian was amazed. He had never heard of someone with such constitution. She was not just protected by a lucky star; she was a lucky star herself!<br/><br/>No wonder Xiao Chunfu wasn’t worried about Xiao Jinli going up the mountain.<br/><br/>Once Xiao Jinli entered the woods, she quickly dripped Lingquan water from her fingertips onto a blade of grass, turning it into crystal clear water droplets. After a while, a group of little friends appeared, including snakes, wild rabbits, and ants.<br/><br/>As soon as the snake and the wild rabbit appeared, they seemed to be at odds. The snake’s sharp eyes stared at the wild rabbit, ready to swallow it at any moment. The wild rabbit, instinctively fearful, had its fur raised and its eyes flickered with fear and anxiety. It wanted to back away and escape, but the temptation of the transparent liquid droplets on the shrub was too irresistible, urging it to risk its life for the food.<br/><br/>Xiao Jinli looked at the wild rabbit, then narrowed her eyes to appraise the snake.<br/><br/>She asked directly, “Which of you knows if a cow passed by here and where it went? Whoever can answer the question will get more Lingquan water in return. ”<br/><br/>Immediately after, Xiao Jinli put a finger on the snake’s head and connected with its consciousness through physical contact to get the information she needed.<br/><br/>Then, she did the same with the wild rabbit.<br/><br/>After a while, Xiao Jinli rewarded them. She extended one finger and said,<br/><br/>“Open your mouths, I’ll give you your reward.”<br/><br/>The snake and wild rabbit understood and immediately opened their mouths to receive their rewards.<br/><br/>Xiao Jinli said, “I need someone to lead the way. Little rabbit, you’ll do.” It would be strange to have a snake guide them, and this white-furred rabbit was quite cute.<br/><br/>The snake was unwilling but knew the girl in front of it was not to be trifled with, so it could only leave.<br/><br/>Xiao Chunfu and Xiao Siqian were waiting on the small path for Xiao Jinli, who was off to answer the call of nature.<br/><br/>After a while, Xiao Jinli came out.<br/><br/>However, they immediately noticed the rabbit cradled in her arms.<br/><br/>“Ah, Jinli, you went to the bathroom and picked up a rabbit!” Xiao Chunfu was surprised and laughed. “Jinli, you really are a lucky star. Just casually going up a mountain gets us some game.”<br/><br/>Xiao Siqian took a glance at the rabbit in Xiao Jinli’s arms. The rabbit was energetic, not injured or sick.<br/><br/>So the question was, how did Xiao Jinli catch this rabbit, and how come the rabbit was so docile?<br/><br/>Xiao Jinli laughed and said, “Uncle Chunfu, I found a little rabbit daydreaming under a tree. It didn’t run away when it saw me, so I just caught it. Uncle Chunfu, let’s keep going.”<br/><br/>Xiao Chunfu nodded and was about to leave, but hesitated when looking at the three forks in the small path. He asked, “Jinli, which way should we go?” “Straight ahead!” Xiao Jinli decisively said,<br/><br/>“Alright then, let’s go straight ahead. This small path leads directly to the top of Niu Xinshan. Going down the other side leads to the mountain-back village.” Xiao Chunfu looked at the mountain top and continued, “Could it be that Cow King was captured and taken away through this path by those people? Mountain-back village has some conflict with our Xiao Family Village, and even if they saw someone stealing our cattle, they probably wouldn’t say anything. ”<br/><br/>Xiao Jinli nodded and said, “Uncle Chunfu, let’s go check it out.”<br/><br/>So, the three of them, with Xiao Jinli holding the rabbit, moved on.<br/><br/>On the way, Xiao Chunfu received several phone calls, exchanging information about not finding Cow King in other places.<br/><br/>The lack of good news made Xiao Chunfu increasingly worried.<br/><br/>Now, their only hope was Xiao Jinli.<br/><br/>Twenty minutes later, they reached the top of the mountain.<br/><br/>They looked down from the top of the mountain.<br/><br/>Then Xiao Siqian pointed to a spot and asked, “Little Sister Jinli, isn’t that the Cow King you are looking for? But, it seems like there is a group of cattle following it?”\t\t\t\t\t\t</div>", "images": {}, "success": true}