{"id": 34, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14107213.html", "title": "Chapter 34 - Chapter 34: Chapter 34: Slandered", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 34 - Chapter 34: Chapter 34: Slandered</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 34: Chapter 34: Slandered<br/><br/>Translator: 549690339<br/><br/>For Xiao’s mother and older brother, their precious child is the brightest, most obedient, and sensible one.<br/><br/>Otherwise, their child wouldn’t have been called Fortune by the villagers.<br/><br/>Now the child is not obeying the teacher and arguing with the teacher. The only reason is that this teacher is too outrageous, so their little treasure can’t stand it anymore.<br/><br/>Thinking of this, Xiao’s mother didn’t scold Xiao Jinli right away, but asked anxiously and gently, “Xiao Bao, what’s going on?”<br/><br/>Xiao Jinli said, “It’s nothing, Mom, don’t worry!”<br/><br/>Upon hearing this, Teacher Xiao’s face turned pale. She pointed at Xiao Jinli and angrily said to Xiao’s mother, “Listen, what do you mean by ‘it’s nothing’? A student talking back to a teacher is simply disrespectful. Our class cannot tolerate such a student. We must go to the principal today. You parents should come with us.”<br/><br/>Xiao’s mother, who looked very gentle, responded indifferently to Teacher Xiao’s anger, “Since Teacher Xiao insists, let’s go. I believe my child wouldn’t talk back to the teacher without a reason.”<br/><br/>Implicitly, she meant that Teacher Xiao was being too much.<br/><br/>Hearing this, Teacher Xiao’s face darkened even more. She said coldly, “I wondered why this child dared to argue with the teacher. It turns out that the parents aren’t setting a good example. Since you trust your child so much, I have nothing to say. However, I’m telling you this: I can’t tutor your child anymore.”<br/><br/>Having said this, Teacher Xiao left regardless of how others reacted.<br/><br/>Xiao’s mother looked at Xiao Jinli, Xiao Jinli just shrugged her shoulders at her mother, then followed.<br/><br/>The others also followed, including Teacher Yang.<br/><br/>In the Principal’s Office, besides Principal Chen, there are two other school leaders, Teacher Xiao’s uncle – Director Guo, and Vice-principal Lin. As soon as Guo Chungui saw Xiao Hongmei coming, he asked, “Teacher Xiao, what’s the matter?”<br/><br/>When Teacher Xiao saw Guo Chungui, a smile appeared on her angry face. She said, “Uncle… Director Guo, I can’t handle Xiao Jinli anymore.”<br/><br/>Principal Chen glanced at the calm Xiao Jinli and the parents following behind her, frowned slightly, and asked, “What’s the matter?”<br/><br/>He was asking Xiao Jinli, but Teacher Xiao rattled Ott a bunch ot stutt, and finally said: “Principal Chen, like Xiao Jinli, who slacks off, sleeps in class, and believes she is right when she rudely talks back to the teacher without any respect, I can’t teach such a bad student. I request that Xiao Jinli be expelled, as an example to the others. Otherwise, other students will follow her example and misbehave. If this continues, it will be unbearable.<br/><br/>Vice-principal Lin twitched his mouth when he heard Teacher Xiao’s all-out accusation against Xiao Jinli.<br/><br/>Xiao Jinli is a student whose name is attached to every school leader. Although she loves to sleep in class, her scores always remain around the average.<br/><br/>She is a talent indeed.<br/><br/>Vice-principal Lin said, “Teacher Xiao, isn’t the situation as serious as you said? If Xiao Jinli talks back to the teacher, you can criticize and discipline her.<br/><br/>You don’t need to go as far as expulsion.”<br/><br/>Teacher Xiao, who felt her authority as a teacher was challenged, was, of course, relentless.<br/><br/>She said, “Vice Principal Lin, you don’t understand. This student is too lazy and disobedient. She not only sleeps in class and ignores lessons, but also sets a bad example for other students. When Xiao Jianming accidentally bumped into a classmate, she led the accusation that Xiao Jianming was bullying others. Look, have you ever seen such a domineering student? Principal Chen, Vice Principal Lin, considering the bad track record of student Xiao Jinli, I recommend expulsion.”<br/><br/>Xiao Junxuan listened with a very bad look on his face.<br/><br/>He said directly, “Teacher Xiao, please refrain from tarnishing my sister’s reputation. My sister has always been a polite and well-behaved girl since she was young. She is definitely not a bad student as you have described.”<br/><br/>Teacher Xiao asked angrily, “Do you mean to say that I lied and slandered your sister?”<br/><br/>Xiao Junxuan said loudly, “I didn’t mean that. However, even if my sister did those things, I believe there’s a reason.”<br/><br/>TTeacher Xiao, having heard that, pointed at Xiao Junxuan, her face ashen, and she yelled, “You…you’re simply twisting words to win an argument.”<br/><br/>Xiao Junxuan ignored Teacher Xiao and looked at Xiao Jinli. He asked softly,<br/><br/>“Sister, can you tell us what happened?”<br/><br/>Principal Chen also asked, “Yes, Xiao Jinli, could you tell us what happened?”<br/><br/>TTeacher Xiao’s face froze for a moment.<br/><br/>Xiao Jinli then explained what had happened.<br/><br/>Under the watchful eyes of the school leaders, Hu Hongmei and Dong Qiufang, the two classmates, timidly said what had happened.<br/><br/>In the end, Hu Hongmei looked at Principal Chen nervously and said cautiously, “Principal Chen, it was Xiao Jianming who bullied me. As his desk mate, every time I accidentally crossed the so-called three-eighth line on the table, he secretly kicked me, hit me and tore my books. I have reported this to Teacher Xiao many times, but each time Teacher Xiao just said a few words<br/><br/>lightly, without taking any effective action.<br/><br/>This time too, because I accidentally crossed the three-eighth line, Xiao Jianming tore off my homework book. 1…1 told Xiao Jinli, and then Xiao Jinli went to see Teacher Xiao directly, requesting that Teacher Xiao should severely punish Xiao Jianming. And then, it angered Teacher Xiao!”<br/><br/>For Hu Hongmei to say this, it took a lot of courage.<br/><br/>After all, this was equivalent to accusing Teacher Xiao in front of all the school leaders.<br/><br/>She surely offended Teacher Xiao and made her angry, for she didn’t know if Teacher Xiao would make her life difficult afterward.<br/><br/>But Xiao Jinli was going to get expelled by Teacher Xiao for her sake, which made her even more frightened and guilty, and she felt sorry for Xiao Jinli.<br/><br/>After hearing what Xiao Jinli and Hu Hongmei had said, Principal Chen looked at Teacher Xiao and asked calmly, “Teacher Xiao, is what these two students just said true?”<br/><br/>Teacher Xiao’s face turned pale, and her expression became somewhat awkward.<br/><br/>She really wanted to deny it, but what happened just now in the office and with other teachers being present, they could testify to it.<br/><br/>If she didn’t deny it, did that mean she was unfair, twisting the truth, and lying about students?<br/><br/>No, any of these accusations would be a stain on her teaching career. Afterward, how could she gain the trust of parents and continue to be a teacher?<br/><br/>“Teacher Xiao, does answering Principal Chen’s question require such a long time?” Xiao Junxuan asked out loud..\t\t\t\t\t\t</div>", "images": {}, "success": true}