{"id": 30, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14107189.html", "title": "Chapter 30 - Chapter 30: Chapter 30: The Little Jinli Standing Up Against Injustice", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 30 - Chapter 30: Chapter 30: The Little Jinli Standing Up Against Injustice</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 30: Chapter 30: The Little Jinli Standing Up Against Injustice<br/><br/>Translator: 549690339<br/><br/>Xiao’s mother took Xiao Siqian shopping for clothes, bought daily necessities at the supermarket, and then took him to a bookstore to buy test papers from elementary school to high school.<br/><br/>Xiao Siqian stood by, watching his mother carefully selecting elementary and junior high school test papers, his mouth twitching constantly. He, a prestigious foreign university graduate, had to do these junior test papers.<br/><br/>Xiao Siqian endured and said, “Aunt, I’ve looked through these elementary and junior high school test papers, and I can definitely do them without any problem. How about we just buy two sets of high school test papers to see?”<br/><br/>Upon hearing this, Xiao’s mother’s eyes lit up, and she exclaimed excitedly, “Xiao Quan, you can understand and do these elementary and junior high school test papers?”<br/><br/>Xiao Siqian nodded.<br/><br/>Xiao’s mother pointed to several questions on the third and fifth-grade test papers, and Xiao Siqian answered each one.<br/><br/>The sales clerk standing nearby looked puzzled.<br/><br/>At first, she thought they were buying for the children in the family, but now it seems like they were buying for this young man.<br/><br/>Looking at the young man’s age, he must have at least graduated from junior high school, if not high school.<br/><br/>After all, nine-year compulsory education is implemented nationwide.<br/><br/>She couldn’t help but ask, “Ma’am, are you buying test papers for the children in your family? What grade are the children in? Would you like me to recommend some materials?”<br/><br/>Xiao’s mother smiled and said, “No need, we’ve already made our selections. Thank you, we’ll go check out now.”<br/><br/>The bookstore clerk,<br/><br/>Xiao’s mother had already determined that Xiao Siqian had no problem with elementary and junior high school knowledge, but she still needed to confirm his high school knowledge.<br/><br/>By the time the two of them left the bookstore, it was already three-thirty.<br/><br/>Just as Xiao’s mother was about to call her son, he called her.<br/><br/>“Son, I was just about to call you. Yes, we’ve bought everything, and we’re waiting for you at the bookstore entrance.”<br/><br/>After hanging up, Xiao’s mother said to Xiao Siqian, “Let’s wait here for a while. Your brother will come to pick us up by car soon.”<br/><br/>Xiao Siqian said, “Aunt, let’s wait inside the store. There’s air conditioning.”<br/><br/>Xiao’s mother nodded, “Alright!”<br/><br/>About ten minutes later, Xiao Junxuan arrived in his car to pick them up.<br/><br/>Xiao Siqian was slightly puzzled, wondering where the Xiao family’s father and son worked. Were their work hours so flexible?<br/><br/>Of course, Xiao Siqian didn’t ask, knowing that he would find out eventually.<br/><br/>Xiao Junxuan took them to the Central Primary School in town. After waiting<br/><br/>for a few minutes, Xiao Jinli got off school.<br/><br/>Xiao Siqian and the others stood among the crowd of parents waiting to pick up their children outside the school. The small and old school in his eyes was incomparable to the prestigious school he had attended, yet it had a different kind of vitality and joy.<br/><br/>That’s because the parents here were simple and active, without the intention of flattering or comparison.<br/><br/>Outside, Xiao’s mother and the others waited for Xiao Jinli to finish school.<br/><br/>Inside the school, Xiao Jinli carried her little school bag and walked towards the school gate.<br/><br/>At that moment, two little girls stopped her.<br/><br/>Xiao Jinli glanced over and noticed that one of the little girl’s eyes were red and swollen.<br/><br/>Xiao Jinli frowned slightly and asked, “Hu Hongmei, what happened to you?<br/><br/>Your eyes are red, you’ve been crying.”<br/><br/>By Hu Hongmei’s side, another girl puffed up her cheeks, clenched her little fists, and angrily said, “Hu Hongmei was bullied by Xiao Jianming. During seating, Hu Hongmei accidentally crossed the three-eighth line on the table, and then Xiao Jianming tore up Hu Hongmei’s homework book. Xiao Jianming is really too much.”<br/><br/>“Didn’t you tell Teacher Xiao?” Xiao Jinli asked.<br/><br/>Teacher Xiao was their class headteacher.<br/><br/>Hu Hongmei had red eyes and shook her head.<br/><br/>Xiao Jinli was a little puzzled.<br/><br/>Dong Qiufang explained, “Xiao Jianming has bullied Hu Hongmei more than once or twice. But every time we tell Teacher Xiao, she just says a few words to Xiao Jianming without even scolding him, just telling him not to bully Hu Hongmei next time. As a result, Xiao Jianming thinks Hu Hongmei went to the teacher and got him scolded, and then, he played tricks on Hu Hongmei again by putting cockroaches and insects in her drawer, which scared her to death. Now Hu Hongmei doesn’t dare to tell Teacher Xiao.”<br/><br/>Xiao Jinli, ‘<br/><br/>Xiao Jinli thought for a moment and said, “Let’s go to Teacher Xiao now.” Hu Hongmei and Dong Qiufang looked a little puzzled.<br/><br/>Dong Qiufang asked, “Why go to Teacher Xiao? If we go to tell on Xiao<br/><br/>Jianming, he will definitely take revenge on Hu Hongmei.”<br/><br/>Perhaps thinking of Xiao Jianming’s revenge, Hu Hongmei’s face turned pale.<br/><br/>Seeing Hu Hongmei’s expression, Xiao Jinli said domineeringly, “What are you afraid of? I’m here.’<br/><br/>Dong Qiufang looked around, lowered her head slightly, and whispered, “I heard that Teacher Xiao is Xiao Jianming’s aunt, she really loves him and couldn’t bear to say a word against him.”<br/><br/>Hearing what little Dong Qiufang said, Xiao Jinli instantly understood why Xiao Jianming was so arrogant in class.<br/><br/>Xiao Jinli patted little Hu Hongmei on her shoulder and said, “Don’t cry. Let’s go to Teacher Xiao directly. Don’t worry, I guarantee that Teacher Xiao won’t dare to favor Xiao Jianming, the little villain, and let him get a lesson.” With that, she went to find Teacher Xiao.<br/><br/>Little Hu Hongmei hesitated and looked scared, but little Dong Qiufang held her hand and followed behind, saying, “Hu Hongmei, we should believe in Xiao Jinli. If she says she will teach Xiao Jianming a lesson, she will. We have been classmates for so many years, and she always keeps her word.”<br/><br/>After hearing this, little Hu Hongmei hesitated no more and immediately followed Xiao Jinli.<br/><br/>Xiao Jinli and the others found Teacher Xiao in the office.<br/><br/>There were four other teachers in the office preparing for lessons.<br/><br/>When Teacher Xiao saw Xiao Jinli and the others appear, her brow furrowed.<br/><br/>She didn’t like Xiao Jinli, let alone Hu Hongmei and Dong Qiufang.<br/><br/>Mainly because Xiao Jinli liked to sleep in class too much. Moreover, her test scores were average, and she often talked back to Teacher Xiao, making her a real headache.<br/><br/>“Xiao Jinli, do you need something from the teacher?” Teacher Xiao asked.<br/><br/>Xiao Jinli said straightforwardly, “Teacher Xiao, just now, Xiao Jianming tore up Hu Hongmei’s notebook because she crossed the three-eighth line on the table. Hu Hongmei lost the notebook to do her homework and also the assignments she had done. Teacher Xiao, Xiao Jianming’s behavior is too bad, he must be severely punished.”<br/><br/>Teacher Xiao looked at Hu Hongmei and asked disdainfully, “Is that true, Hu Hongmei?”<br/><br/>Faced with the teacher, Hu Hongmei and Dong Qiufang were still a little timid.<br/><br/>Little Hu Hongmei stuttered, “Yes… That’s true, Teacher Xiao!”<br/><br/>However, Teacher Xiao looked indifferent and perfunctory. “Okay, I got it. I will scold Xiao Jianming. It’s time to go home, hurry up. Going home late is not safe!”<br/><br/>Xiao Jinli was clearly dissatisfied and said, “Teacher Xiao, just scolding Xiao Jianming is not enough. Besides, every time you say you will criticize him, but you never even say a harsh word to him. This leads to Xiao Jianming bullying Hu Hongmei even worse in revenge. So, Teacher Xiao, we must demand a severe punishment for Xiao Jianming to teach him a profound lesson, so he will not repeat his mistakes and bully others.”<br/><br/>Xiao Jinli’s words were very direct and sharp, which made Teacher Xiao very unhappy.<br/><br/>Teacher Xiao asked with hidden anger, “So, what do you think should be the punishment for Xiao Jianming?”\t\t\t\t\t\t</div>", "images": {}, "success": true}