{"id": 37, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14107231.html", "title": "Chapter 37 - Chapter 37: Chapter 37: Cow King (Happy New Year!)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 37 - Chapter 37: Chapter 37: Cow King (Happy New Year!)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 37: Chapter 37: Cow King (Happy New Year!)<br/><br/>Translator: 549690339<br/><br/>As the car approached the village entrance, villagers stopped the vehicle. Seeing Xiao Jinli, their expressions were somewhat anxious. “Little Jinli, the Cow King has gone missing?”<br/><br/>Xiao Junxuan immediately asked, “Uncle Chunfu, what do you mean by Cow King has gone missing? Usually, doesn’t the Cow King go out by himself and return by himself? It’s not even dark yet and if the Cow King is not back, isn’t that pretty normal?”<br/><br/>Xiao Chunfu explained, “That’s not it. Someone saw the Cow King heading towards the rear mountain, then some strangers followed suit covertly. We searched for the Cow King at the rear mountain but found nothing, and those strangers have also vanished. We suspect they might have stolen the Cow<br/><br/>King! ”<br/><br/>Xiao’s mother said, “The Cow King is so intelligent, it won’t be easily caught, would it?”<br/><br/>Xiao Chunfu replied, “That may be true, but we’ve called for Cow King several times and even used a loudspeaker, yet there’s been no sight of it.”<br/><br/>Having said that, Xiao Chunfu presented his suspicions, “There’s a small path on the rear mountain that leads to other villages. We suspect those four strangers might have stolen Cow King using that path.”<br/><br/>Listening to their conversation, Xiao Siqian was extremely curious about this so-called Cow King.<br/><br/>He had heard of and seen cows before.<br/><br/>But he had never heard of a breed referred to as the “Cow King.”<br/><br/>Xiao Jinli thought for a moment and said, “Uncle Chunfu, I’ll go and take a look at the rear mountain now.”<br/><br/>With that, she got off the car.<br/><br/>Out of curiosity, Xiao Siqian also got off the car, intending to join her.<br/><br/>Xiao Chunfu noticed Xiao Siqian and smilingly asked, “Is this child the one Little Jinli carried down from the mountain?”<br/><br/>Xiao Siqian was speechless.<br/><br/>He found out on his first day that Xiao Jinli had carried him down the mountain.<br/><br/>Xiao’s mother laughed and said, “Yes, this is Xiao Quan.”<br/><br/>Xiao Chunfu said, “Well, this boy is really handsome. Xiaofang, we’re going now!”<br/><br/>Xiao’s mother nodded and said, “Alright, be careful on the mountain and come back early! ”<br/><br/>Walking alongside Xiao Jinli, Xiao Siqian couldn’t help but ask out of curiosity,<br/><br/>“Little Sister Jinli, what’s the deal with this Cow King?”<br/><br/>He only knew about the Tiger King, Lion King, and Monkey King in the mountains, but he had never heard of the Cow King.<br/><br/>He didn’t know how the Cow King was chosen in this mountain village.<br/><br/>Xiao Jinli didn’t mention Sun Island, so Xiao Chunfu began to recount the tale.<br/><br/>He said, “Well, young man, you wouldn’t know this but our Cow King has quite the story and it’s related to Little Jinli.”<br/><br/>Upon hearing this, Xiao Siqian’s eyes lit up immediately and he asked curiously, “Uncle Chunfu, could you tell me more?”<br/><br/>His curiosity about Xiao Jinli was growing stronger and stronger.<br/><br/>As he walked, Xiao Chunfu began to recount, “This story traces back to ten years ago. Back then, the mother of this Cow King was in difficult labor, and Jinli, who was only three months old at the time was insistent that her mother take her to see the cow give birth.”<br/><br/>“Ha ha, you wouldn’t believe it, but Jinli was so eager to see the birth that she started speaking coherently at only three months old. Her articulate words shocked everyone. But Jinli has always been a lucky charm, extremely smart. Although her speaking at three months was surprising for most, it was quite the norm for her!” Xiao Siqian,<br/><br/>Is that normal?<br/><br/>Don’t most children start speaking around six or seven months old? And even then, it’s hardly coherent sentences.<br/><br/>No child speaks fluently at three months old.<br/><br/>Xiao Chunfu continued, “You won’t believe it, but the mother cow struggled for a whole day to give birth. However, in less than ten minutes of Jinli’s arrival, the calf was born. The most astonishing thing was, the mother cow knelt down in gratitude to Jinli after she gave birth.”<br/><br/>Everyone thought that it was Jinli’s good fortune that helped the cow give birth successfully. Thus, the cow was also grateful to Xiao Jinli. Even the newborn calf ran up to Little Jinli’s mom, her eyes moist as she looked at Jinli in her arms.”<br/><br/>Xiao Siqian was secretly amazed.<br/><br/>A cow expressing gratitude, a calf showing affection – these were truly rare in this world.<br/><br/>“Later, the calf followed Jinli home,” Xiao Chunfu said with a chuckle as he remembered the scene, “After the calf was born, Xiaofang was worried about the environment and decided to take the child home. Who would have thought that the calf would follow them back home directly. Everyone said that the calf and Jinli were predestined. Seeing this, the calf’s owner, Xiao Changsheng, gave the calf to Jinli on the spot.”<br/><br/>Xiao Siqian replied, “So, the calf has been following Jinli ever since, eventually becoming the Cow King!”<br/><br/>“It’s not that simple!” Xiao Chunfu said, “Xiao Quan, let me tell you, after the calf followed Jinli, it gradually became smarter. Not only did it understand human speech slowly, but when it went out to graze, it led the village’s cows without trampling on the crops. If any cow tried to eat the crops, the calf would roar at it. It’s strange, all the village’s cows, big and small, listened to it. Thus, we started calling it the Cow King.<br/><br/>Since the Cow King arrived, the children herding cows could finally rest easy.<br/><br/>They didn’t have to worry about their cows eating the crops as long as the Cow King was around. The cows would be let out and led back home on time, and during this time, the children could carefreely play.”<br/><br/>Xiao Siqian found this story quite interesting.<br/><br/>“Now that I think about it, Cow King is about the same age as Jinli. It shouldn’t be called Little Cow King anymore, it should be called Big Cow King, ” Xiao Chunfu sighed, “Time flies!”<br/><br/>He went on, “You know, for miles around, everyone knows our village has a Cow King that’s very spiritually aware. Now that the Cow King has suddenly disappeared, I’m worried that someone might have been eyeing it. What if some cattle trafficker manages to kidnap it, what will we do then?”<br/><br/>Xiao Siqian reassured, “If the Cow King really gets kidnapped, we’ll just call the police!”<br/><br/>Xiao Jinli also consoled, “Uncle Chunfu, the Cow King is very spiritually aware and sensible. It wouldn’t allow itself to get kidnapped easily.”<br/><br/>But Xiao Chunfu retorted, “I know, but it’s the ‘what if’ that worries me. I’ve heard that these dog and cattle thieves employ all sorts of lowly measures. For instance, they use anesthetics – one shot from an anesthetic gun from a dozen meters away could knock out a dog or a cow.”<br/><br/>People in the village had become accustomed to the presence of the Cow King. Especially when Cow King was around, the kids herding cows were a lot more relaxed, and the crops were no longer damaged.<br/><br/>Most importantly, the Cow King brought everyone a lot of joy.<br/><br/>Laughing, Xiao Jinli reassured, “Uncle Chunfu, isn’t it believed that I’m a lucky star? Since I’m Cow King’s owner, it’ll definitely be safe and sound.”<br/><br/>Xiao Chunfu nodded in agreement after hearing her, “That’s true. Jinli is indeed a lucky star. Whoever dares to take Jinli’s Cow King is just asking for trouble.”<br/><br/>Xiao Siqian, “…” He was becoming more and more curious..\t\t\t\t\t\t</div>", "images": {}, "success": true}