{"id": 32, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14107201.html", "title": "Chapter 32 - Chapter 32: Chapter 32: Confronting The Teacher", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 32 - Chapter 32: Chapter 32: Confronting The Teacher</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 32: Chapter 32: Confronting the Teacher<br/><br/>Translator: 549690339<br/><br/>In Teacher Xiao’s eyes, Xiao Jinli was just a bad student who slept during class, had poor grades, liked to meddle in other people’s business, and loved to talk back to teachers.<br/><br/>She had also proposed to the school several times to transfer this student to another class or expel her, but somehow the school did not agree.<br/><br/>At first, she thought Xiao Jinli had connections in the school, but upon inquiring, she found out she was from an ordinary family.<br/><br/>Later, the School Guidance Director, who happened to be her uncle, reminded her that Xiao Jinli was a genius, so the school turned a blind eye to her sleeping during class.<br/><br/>Hearing her uncle’s words, she disdained in her heart.<br/><br/>She simply didn’t believe that a student who loved to sleep in class could be a genius.<br/><br/>Frankly, she had long wanted to teach this student a tough lesson.<br/><br/>Now, she finally had an excuse.<br/><br/>The anger emitted by Teacher Xiao could be seen as a threat to Xiao Jinli.<br/><br/>Teacher Yang, who was beside her, thought for a moment and couldn’t bother about possibly offending Teacher Xiao.<br/><br/>He interrupted, “Teacher Xiao, you’re going too far with your words. I don’t think Xiao Jinli was wrong in the first place. She’s just enthusiastic and stands up for her classmates. That student Xiao Jianming in your class is always bullying others. Besides apologizing to the students he bullied, he really needs to be punished severely to learn his lesson!”<br/><br/>After hearing Teacher Yang’s words, Teacher Xiao’s face turned green.<br/><br/>She gritted her teeth and said, “Teacher Yang, this is my class, and I can handle it. ”<br/><br/>Meaning: Mind your own business!<br/><br/>However, Teacher Yang solemnly said, “Teacher Xiao, as a teacher, we should first of all strive to be fair and impartial to every student and not show favoritism to anyone.<br/><br/>I’ve heard of that Xiao Jianming, who bullies classmates every day, especially girls. He either puts snakes or insects in girls’ drawers, or tears their books apart. He doesn’t listen carefully during class and disturbs the surrounding students. He cheats on exams and doesn’t do work when it’s his turn to be on duty. Is it enough to just mildly criticize such a bad student? Isn’t this favoritism too excessive?”<br/><br/>It’s no secret that Xiao Jianming is Xiao Hongmei’s nephew.<br/><br/>Xiao Jianming had openly boasted about it in class. Normally, Xiao Hongmei would take care of him, sending him delicious food after class.<br/><br/>As Teacher Yang spoke, Xiao Hongmei’s face turned red and blue with anger, humiliation, and rage.<br/><br/>She unconsciously snapped, “Teacher Yang, how I treat my students is none of your business! Do I need you to be nosy and point fingers at me? My nephew is just a bit mischievous in class and nowhere near as bad as you claim. He’s an obedient and sensible child at home, but now you’re painting him as so unbearable. Teacher Yang, do you think it’s too much to harp on a little mistake made by an elementary student?”<br/><br/>Teacher Yang and others,<br/><br/>Xiao Jinli, ‘<br/><br/>This… was truly self-deceiving.<br/><br/>Xiao Hongmei was obviously dissatisfied with Teacher Yang.<br/><br/>She continued, “In that case, I must have a good talk with Director Guo about whether you, as a role model, are doing the right thing.”<br/><br/>Director Guo was the Teaching Director, her uncle.<br/><br/>With Xiao Hongmei saying this, it was like the offender accusing the victim first.<br/><br/>As Teacher Yang was about to speak, Xiao Jinli’s little face turned cold. She said coldly, “So, if Teacher Xiao clearly favors her nephew, is that being a good role model? If such an elementary school student commits such a serious offense like not participating in labor, playing pranks on classmates, and bullying classmates, are those all minor errors? So, may I ask Teacher Xiao, what counts as a major mistake made by an elementary school student? Is it robbery or arson?”<br/><br/>Pausing for a moment, she continued, “Or is it that this school, or you, Teacher Xiao, own this place, and you do whatever you want?”<br/><br/>Teacher Xiao was instantly rendered speechless with anger.<br/><br/>She angrily pointed at Xiao Jinli and shouted, “You’ve gone too far! This is a total disregard for me as your teacher. Fine, I don’t want you as my student anymore. Oh, no, I’m expelling you. You don’t have to study here anymore.<br/><br/>Hurry up and get your parents over here and have them withdraw you from school!”<br/><br/>Xiao Jinli stared very seriously at Xiao Hongmei, saying, “About transferring to another class, I will consider it. But transferring schools, that’s impossible!” Hu Hongmei and Dong Qiufang, the two little classmates, were completely stunned.<br/><br/>They had clearly come to resolve the issue of Xiao Jianming bullying people, but how did it escalate to expelling Xiao Jinli?<br/><br/>The two little classmates were a little frightened and felt that Teacher Xiao was so unreasonable and terrifying.<br/><br/>After a while, Hu Hongmei’s face turned a little pale, and she timidly said to Teacher Xiao, “Teacher Xiao, I… I don’t want Xiao Jianming to apologize to me anymore. It’s… it’s my fault. You… can you please not expel Xiao Jinli, okay?”<br/><br/>Hu Hongmei felt it was all her fault. If she hadn’t been bullied by Xiao Jianming and sought help from Xiao Jinli, Xiao Jinli wouldn’t have confronted Teacher Xiao, talked back to her, made her angry, and wanted to expel Xiao Jinli.<br/><br/>It’s just that she doesn’t know, at this point, it’s not something that can be solved by not asking Xiao Jianming to apologize.<br/><br/>Xiao Jinli patted her shoulder to comfort her, “Don’t worry, I will be fine.”<br/><br/>With this, she said firmly, “I just can’t believe there isn’t a single place in this whole school that’s reasonable.”<br/><br/>Teacher Yang and others, ‘ This child, saying this, wasn’t it just adding fuel to the fire? She truly has no fear of heaven or earth in her character.<br/><br/>Teacher Xiao, ‘ . This little bastard, she really doesn’t take her seriously at all.<br/><br/>Teacher Xiao looked at the eloquent Xiao Jinli, not angry but laughing coldly, “Hehe, do you think this school is owned by your family? Let me tell you, just the matter of you sleeping in class will be enough reason for the school to expel you.”<br/><br/>However, Xiao Jinli simply shrugged her shoulders nonchalantly, “I don’t care.”<br/><br/>She really didn’t care.<br/><br/>Even if she was expelled, she would just be sleeping somewhere else.<br/><br/>Naturally, if possible, she didn’t really want to go to school either.<br/><br/>It’s too childish.<br/><br/>However, if she didn’t go to school, her family would definitely make her come.<br/><br/>After all, no matter how intelligent or gifted she was, her age required her to complete her nine-year compulsory education.<br/><br/>Teacher Yang and others,   This child has such a strong control over her SAT score, that she might really not care about going to school.<br/><br/>After Xiao Jinli finished her words, the atmosphere became deadlocked against Teacher Xiao.<br/><br/>Teacher Xiao felt that Xiao Jinli, this bad student, was simply here to oppose her.<br/><br/>“Alright, you don’t care, huh? Fine, call your parents over right now. I want to hear how they educate their child, who is so rude, disrespectful, and talks back to the teacher!” Teacher Xiao looked at Xiao Jinli with contempt and said coldly..\t\t\t\t\t\t</div>", "images": {}, "success": true}