{"id": 33, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14107207.html", "title": "Chapter 33 - Chapter 33: Chapter 33: I Can’T Teach Your Child At Home", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 33 - Chapter 33: Chapter 33: I Can’T Teach Your Child At Home</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 33: Chapter 33: I Can’t Teach Your Child at Home<br/><br/>Translator: 549690339<br/><br/>Teacher Xiao’s attitude towards Xiao Jinli really angered Teacher Yang and the others.<br/><br/>However, before they could speak, Xiao Jinli also said, “Teacher Xiao, my parents are waiting outside for me to go home. But, if you really want to expel me, I’m afraid you’ll have to call Teaching Director Guo and Principal Chen together. To be honest, my biggest offense is sleeping in class, and I haven’t disturbed other students. Likewise, my grades are not the worst.”<br/><br/>At this point, Xiao Jinli paused for a moment and asked, “Teacher Xiao, do you need me to help you call both Director Guo and Principal Chen?”<br/><br/>Teacher Yang and the others,<br/><br/>Teacher Xiao, ‘ .<br/><br/>Teacher Yang and the others couldn’t help but snicker, causing Teacher Xiao’s face to turn green and purple, her expression becoming more twisted.<br/><br/>After laughing, Teacher Yang may have felt that she was not being very kind.<br/><br/>“Hmm, hmm…” Teacher Yang said, “Teacher Xiao, calm down. I think concerning the matter of expelling Student Xiao Jinli, we should wait until tomorrow when we report to the Principal. ‘<br/><br/>After saying that, she turned her head to look at Xiao Jinli, and said seriously, “Xiao Jinli, how can you talk to a teacher in such a tone? Teacher Xiao is just angry now. As for the punishment of Xiao Jianming, I’m sure Teacher Xiao will give you an explanation tomorrow. You three students, go home now. It’s not safe to go home late on the road!”<br/><br/>Nowadays, children go home by themselves after school without parents picking them up.<br/><br/>Those who do have parent pick-ups are probably a bit further away and their families have better financial conditions.<br/><br/>Teacher Yang said this, actually, to give Teacher Xiao a way out.<br/><br/>After all, as a teacher, it wouldn’t sound good if she was arguing with her own student.<br/><br/>However, Teacher Xiao didn’t appreciate Teacher Yang’s kindness.<br/><br/>She just thought that Teacher Yang and the others were laughing at her, and her frustrations grew as her authority as a teacher was being challenged by a student. Her face became even uglier.<br/><br/>Teacher Xiao didn’t give face to Teacher Yang and said loudly, “Teacher Yang, this is a matter for my class and my student, and I don’t need you to meddle. If you have so much free time to interfere, you might as well spend it on grading more lesson plans. I will discipline my students myself!”<br/><br/>With this remark, Teacher Yang was left speechless and ashamed.<br/><br/>Even someone as good-natured as Teacher Yang couldn’t help but get angry.<br/><br/>He shouted, “Teacher Xiao, how am I meddling? It’s clear that you, as a<br/><br/>teacher, are being unfair and favoritism to your nephew while letting your own students suffer injustice. As a fellow teacher, I can’t stand it and I am entitled to say something. Fine, since you say I’m meddling, let’s call Director Guo and Principal Chen together and ask them if I’m meddling!”<br/><br/>Others might be afraid of Xiao Hongmei, but he wasn’t.<br/><br/>He had been teaching here for many years, receiving bonuses every year, and as long as he didn’t make any mistakes in principle, no one could easily dismiss him.<br/><br/>Upon hearing this, Teacher Xiao’s face became even uglier.<br/><br/>Her face had already changed many times.<br/><br/>Never before had she been so angry and frustrated in her teaching career.<br/><br/>Her own student challenged her so much that she was almost speechless, and now even other teachers were stepping on her.<br/><br/>If she didn’t vent her anger, how would she establish prestige among her students, and how would she manage students in the future?<br/><br/>Teacher Xiao agreed and said, “Alright, let’s call both Director Guo and Principal Chen over.”<br/><br/>This was no longer just a conflict between a teacher and a student, it was now a confrontation between teachers.<br/><br/>Xiao Jinli, ‘<br/><br/>She whispered to Hu Hongmei and Dong Qiufang, her classmates, “You two can go home first!”<br/><br/>They didn’t want to be around when the Teaching Director and Principal came, fearing their legs would give out.<br/><br/>However, Hu Hongmei, determined, shook her head and said, “No, this issue was caused by me, I should be present!” Moreover, she had to be the one to testify as the bullied person.<br/><br/>She couldn’t be a deserter.<br/><br/>Little student Dong Qiufang also hadn’t expected the situation to escalate like this, and she was completely dumbfounded.<br/><br/>However, she didn’t desert either and decided to stay.<br/><br/>While waiting outside, Xiao’s mother and the other two noticed that almost all the students had left school, but their precious daughter (precious sister) had not appeared, their brows slightly furrowed.<br/><br/>Xiao’s mother worriedly asked, “Older Brother, is today your sister’s day to be on duty?”<br/><br/>Xiao Junxuan took out a duty schedule for Xiao Jinli’s class and said, “No, my sister is on duty on Wednesday.”<br/><br/>“She’s on duty on Wednesday, today is only Monday, why hasn’t she come out yet?” Xiao’s mother asked.<br/><br/>Xiao Siqian said, “Aunt, shall we go inside the school to look for her?”<br/><br/>He noticed that the school’s security measures were not good, and parents could enter and leave freely.<br/><br/>He didn’t know if it was because the school was in the countryside, or if it was just this school.<br/><br/>But in any case, it was too unsafe.<br/><br/>He was increasingly worried about Xiao Jinli’s safety.<br/><br/>After all, Xiao Jinli was so smart and beautiful, what if she were targeted by a bad person?<br/><br/>After some thought, Xiao’s mother said, “Alright, let’s go inside the school and look for her. Our baby normally comes out as soon as school is over. There are rarely cases where she comes out late. She might have something going on now.”<br/><br/>So, Xiao’s mother and the others went to the school.<br/><br/>When they entered the school gate, they just happened to see Xiao Jinli and the others going in the direction of the Principal’s Office.<br/><br/>Xiao Siqien immediately spotted Xiao Jinli following the teachers.<br/><br/>He shouted loudly, “Little Sister Jinli!”<br/><br/>As soon as Xiao Siqien called out, Teacher Xiao naturally noticed them.<br/><br/>Teacher Xiao and the others naturally noticed Xiao’s mother and the other two.<br/><br/>Although Xiao’s mother was middle-aged, she had fair skin, a tall figure, and an elegant demeanor, not at all like an ordinary countryside housewife.<br/><br/>Xiao Jinli had been in school for several years, and her father and brother were the ones who picked her up most of the time, so the teachers hardly knew Xiao’s mother.<br/><br/>When Xiao Jinli saw her mother appear, she was slightly surprised and called out, “Mom, what are you doing here?”<br/><br/>“Mom?!” Teacher Yang and the others were slightly surprised.<br/><br/>Surprised that Xiao Jinli’s mother was so beautiful, elegant, and charming.<br/><br/>It made sense, with such a beautiful mother, she could give birth to a beautiful daughter like Xiao Jinli.<br/><br/>Xiao’s mother smiled and said, “We brought your Brother Siqian to buy some things today, and then came here to pick you up together. Jinli, what is going on here?”<br/><br/>As she said this, she looked puzzled at the teachers and students.<br/><br/>Before Xiao Jinli could answer, Teacher Xiao said with a bad face, “So, you’re<br/><br/>Xiao Jinli’s mother, huh? That’s good.”<br/><br/>Having said that, she began to scold Xiao’s mother, saying sternly, “You parents, look at how you’ve educated your children. Xiao Jinli doesn’t pay attention in class, sleeps instead and refuses to accept her teacher’s scolding.<br/><br/>She doesn’t respect her teacher at all. I’m telling you, I can’t teach your child. I’m going to see the Principal now and have her expelled.”<br/><br/>Xiao’s mother, ‘<br/><br/>Older Brother Xiao, .\t\t\t\t\t\t</div>", "images": {}, "success": true}