{"id": 36, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14107225.html", "title": "Chapter 36 - Chapter 36: Chapter 36: Required To Participate In The Whole County Competition (Happy New Year)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 36 - Chapter 36: Chapter 36: Required To Participate In The Whole County Competition (Happy New Year)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 36: Chapter 36: Required to Participate in the Whole County Competition (Happy New Year)<br/><br/>Translator: 549690339<br/><br/>The door to the Principal’s Office suddenly opened, and Xiao Siqian looked at<br/><br/>Xiao Jinli, saying, “Little Sister Jinli, the Principal wants you to come in.”<br/><br/>His expression was slightly surprised as he said this.<br/><br/>Just now, he listened to the conversation between Principal Chen, Vice-principal Lin, Xiao’s mother, and Older Brother Xiao and found out that Xiao Jinli was a genius, and possibly even a prodigy among geniuses.<br/><br/>However, this genius was too lazy and had no interest in fame or fortune, hiding herself and acting like an invisible person.<br/><br/>Xiao Siqian recalled the scene of his first encounter with Xiao Jinli and could see that she was smarter and more clever than the average child.<br/><br/>After Xiao Jinli went in, Principal Chen directly said to Xiao Jinli, “Xiao Jinli, there is a county-wide Math Olympiad competition coming up. I have discussed it with your mother and we hope you can participate!”<br/><br/>Xiao Hongmei listened to this and found it incredible, even thinking that Principal Chen and the others had gone crazy.<br/><br/>Xiao Hongmei exclaimed loudly, “Principal Chen, Xiao Jinli is just an average student. How can she participate in the Math Olympiad? Aren’t you making a joke of the school’s honor?”<br/><br/>As soon as she finished speaking, she heard Guo Chungui coldly scold,<br/><br/>“Hongmei, shut up!”<br/><br/>Principal Chen and the others ignored Xiao Hongmei, and just focused their sharp eyes on Xiao Jinli.<br/><br/>Xiao Jinli frowned slightly and looked at her mother.<br/><br/>“Ahem…” Xiao Junxuan looked at his mother and carefully said, “Little sister, we believe you shouldn’t hide your talents. You should show your true strength and let those who look down on others see that even if you sleep all day, you can still beat everyone!”<br/><br/>He was so confident and proud of his little sister!<br/><br/>Xiao Jinli, ‘<br/><br/>Principal Chen and the others, “… l’ Well, that’s quite a bold statement.<br/><br/>Xiao Hongmei, “…” With a red face, she thought to herself, “Hmph, an average student participating in the county-wide Math Olympiad, just don’t embarrass the school.”<br/><br/>“Mmm…” Principal Chen also said, “Well, Xiao Jinli, the school only asks you to participate once in the county competition. It’s best if you can get a good ranking, but of course, the school won’t blame you if you don’t.”<br/><br/>Xiao Jinli, “… I’ No pressure for rankings, yet they ask her to participate instead of other students.<br/><br/>Xiao’s mother looked at her precious daughter and said with a smile, “Baby, whether you participate or not, Mom always respects your opinions. However,”<br/><br/>At this point, her words took a turn, “Baby, actually, I also want to see my baby’s glorious moments.”<br/><br/>Although their child was smart and sensible, they never put much emphasis on her academic achievements as parents. Their wish was for their child to be happy and joyful.<br/><br/>But now, because of her academic achievements, the teachers looked down on her and even slandered her. As a parent, it’s natural to be angry.<br/><br/>Now, she just wanted those people to see that her baby’s performance was not bad, but too good. She wanted to slap those people in the face and see who else would dare to look down on her baby in the future.<br/><br/>When Xiao Jinli heard her mother’s words, she wanted to roll her eyes.<br/><br/>How could she not know her mother’s thoughts?<br/><br/>However, she couldn’t bear to disappoint her mom.<br/><br/>She sighed lightly and said, “Alright. I promise to participate in this competition and bring back a big prize. However, Principal Chen, let me make something clear. I don’t like trouble. In the future, if there are similar competitions, you should let me know and I’ll choose whether or not to participate. Don’t force me.”<br/><br/>“Of course, of course!” Principal Chen’s face was all smiles, like an old fox, “As long as Xiao Jinli participates in the Math Olympiad and wins a prize for us, the bigger the better, all future competitions will follow your wishes.”<br/><br/>He thought to himself, “Once we have a start, there will be ways to make her participate in future competitions.”<br/><br/>Xiao Hongmei felt that these people were talking nonsense.<br/><br/>It was absurd to ask a student who had never had outstanding results to participate in such an important competition and even expect her to win a prize.<br/><br/>Xiao Jinli asked, “When is the competition?”<br/><br/>Principal Chen said, “In one week. Our school has three competition spots. The other two will be selected through a school-wide competition!”<br/><br/>In other words, Xiao Jinli’s spot was predetermined.<br/><br/>“…” Xiao Jinli said with some speechlessness, “Don’t I need to participate in the selection? Are you that confident in me? Principal Chen, doing this like this, isn’t it too carefree for the school? This is about the school’s honor!”<br/><br/>“Ahem…” Principal Chen laughed, “We have studied your academic performance, and we all think you don’t need to participate in the selection competition.”<br/><br/>If participating in the selection competition was useful, Xiao Jinli would have already excelled and not have waited until now.<br/><br/>Actually, he felt that he should thank Xiao Hongmei.<br/><br/>If it weren’t for her causing such a scene, they wouldn’t even know how to persuade Xiao Jinli’s parents to persuade Xiao Jinli herself.<br/><br/>After Xiao Jinli agreed to participate in the competition, there was nothing left for the parents to do, so they quickly left the school.<br/><br/>Since they spent some time at the school, they decided to take Hu Hongmei and Dong Qiufang back home.<br/><br/>The two little students were still in disbelief, unable to understand why Principal Chen and the others wanted Xiao Jinli to participate in the county-wide Math Olympiad.<br/><br/>Jinli’s academic achievements had always been average.<br/><br/>Dong Qiufang whispered, “Jinli, why does the Principal want you to participate in the competition? And even ask you to win a prize, don’t you feel pressured?” Xiao Jinli laughed and said, “No pressure. I’ll just treat it as a trip to the county town. As for the prizes, they’re not something you can get just by asking. You guys shouldn’t think too much about it either. Go home, do your homework, and have a good night’s sleep!”<br/><br/>Hu Hongmei and Dong Qiufang,<br/><br/>Why did they feel that Xiao Jinli was treating them like three-year-old children?<br/><br/>When only their family was left in the car, Xiao Junxuan immediately said, “Hmph, I never thought there would be such teachers. It’s bad enough that they favor their own nephew, but they also tried to dump their dirty water on my sister. Who would dare give their child to such a teacher in the future? Wouldn’t that just teach them to be selfish, foolish, and unable to distinguish right from wrong?”<br/><br/>Xiao Siqian said, “There are always one or two bad apples in every industry.”<br/><br/>Xiao Jinli nodded, “Right, right, brother, in fact, most of the teachers in the school are good and considerate towards students. You shouldn’t be angry about it either.”<br/><br/>Xiao Junxuan was still indignant, “But when I think about the grievances my sister had to endure, I get upset.”<br/><br/>Xiao’s mother said, “Alright, brother, don’t be angry anymore. The school will punish Teacher Xiao, which will serve as a lesson for her..”\t\t\t\t\t\t</div>", "images": {}, "success": true}