{"id": 40, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14107249.html", "title": "Chapter 40 - Chapter 40: Chapter 40: Both Sides Confront Each Other", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 40 - Chapter 40: Chapter 40: Both Sides Confront Each Other</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 40: Chapter 40: Both Sides Confront Each Other<br/><br/>Translator: 549690339<br/><br/>Xiao Jinli and Xiao Siqian leisurely descended the mountain.<br/><br/>Xiao Chunfu was more anxious and ran faster.<br/><br/>However, looking down from the mountain at the cattle thieves running, he grew angrier and angrier.<br/><br/>He cursed, “These thieves, they’re getting too bold. They steal the cows in broad daylight, and even when the cows escape, they can chase them right to our doorstep. Just wait until the Yamen officials come, they’ll pay for this.”<br/><br/>Xiao Jinli was worried that Xiao Chunfu would trip if he walked too fast, so she said, “Uncle Chunfu, no need to hurry, Cow King has already come back. Those thieves only have two legs, they won’t be able to catch up. We’ll just meet up with Cow King later.”<br/><br/>But Xiao Chunfu still anxiously said, “But look at those cattle thieves, they’re almost catching up.”<br/><br/>Xiao Jinli shrugged, “Let them come. We’ll catch them red-handed. They won’t be able to escape now.”<br/><br/>Xiao Chunfu stopped in his tracks, raised his hand, and slapped his forehead, laughing, “Haha, you’re right, Jinli.”<br/><br/>Afterward, he slowed down his pace.<br/><br/>What’s the rush? Cow King and the others have already started running back.<br/><br/>On the other side, Li Yuanming and his group were gasping for breath.<br/><br/>Zhang San leaned on his knees, panting heavily, and said, “I can’t take it anymore—I’m too exhausted. These cows run too fast. How are we supposed to catch up? By the time we catch them, we’ll be directly at Xiao Family Village.”<br/><br/>Li Yuanming also gasped heavily, frowned tightly, and said, “Little Wang and the others haven’t arrived yet, it seems like we can only take a gamble.”<br/><br/>He looked around; it was evening and the people working in the fields were almost all gone. The weather was dark, making it hard to see clearly.<br/><br/>Li Yuanming said, “Take out the anesthetic gun, aim it at the cows, and shoot. Hit one, and that’s one less!”<br/><br/>In broad daylight, they didn’t dare take out the anesthetic gun and shoot from a distance, lest they be mistaken for terrorists.<br/><br/>Zhang San, Li Si, and the others immediately took out the anesthetic guns.<br/><br/>Although the distance was far, and they didn’t know if they could hit the target, it was the only way to catch those cows.<br/><br/>If they let these cows run up to the mountain or to Xiao Family Village, they’d be in big trouble.<br/><br/>Xiao Jinli’s eyes were sharp, and the moment they took out the anesthetic guns, she noticed and a cold light flashed in her eyes.<br/><br/>Immediately, she put her thumb to her lips and blew a loud whistle.<br/><br/>Cow King heard the whistle, “mooed” twice, and the cows that were following it immediately dispersed and ran.<br/><br/>Li Yuanming and the other cattle thieves were stunned.<br/><br/>How were they supposed to shoot under this chaos?<br/><br/>What’s going on?<br/><br/>Li Si furrowed his brow and asked, “Why did I hear a whistle sound?”<br/><br/>Zhang San agreed, “I think I also heard a whistle, and after the cow in front heard the whistle, it called out twice, and the cows dispersed.”<br/><br/>“Damn it, why is that cow in front so weird? How can it understand commands like that?” Zhang San complained again.<br/><br/>Li Yuanming heard his subordinate’s complaints, his eyes bursting with a burning glare. Excitedly, he said, “This cow is so smart. If we catch it, we can sell it for a high price to those who like to keep pets. It should be able to sell for at least 100,000 to 200,000!”<br/><br/>When Zhang San and Li Si heard this, their expressions immediately brightened, and they asked incredulously, “Brother Ming, are you serious?”<br/><br/>“Of course, I’m serious. A smart cow like this is sure to be liked by those wealthy pet enthusiasts. 100,000 to 200,000 is just a conservative estimate—we might be able to sell it for even more! So, we can ignore the other cows, but we have to catch this one!”<br/><br/>Hearing this, Zhang San, Li Si, and the others seemed to be injected with energy and immediately lifted their spirits. There were hundreds of thousands of dollars waving at them in the front.<br/><br/>“Let’s hurry up and chase after them.”<br/><br/>Cow King quickly gathered with Xiao Jinli and the others.<br/><br/>They had only just arrived at the halfway point of the hillside.<br/><br/>When Cow King saw Xiao Jinli, its big, round eyes lit up with excitement. It rubbed its big head against Xiao Jinli’s palm and “mooed” twice, expressing its grievances yet also pride.<br/><br/>Xiao Jinli stretched out her hand and patted its head, laughing, “Alright, I know. You were caught and wronged by someone. But you also rescued your fellow cows from the cattle traffickers. Well done!”<br/><br/>Xiao Siqian examined Cow King as it approached.<br/><br/>Although it was dark, Xiao Siqian’s eyesight was still good.<br/><br/>This was a large, well, water buffalo. Compared to the other dirty ones, this large water buffalo was very clean. Its fur was sleek and shiny, thick black hairs clinging to its body.<br/><br/>Most distinctive were its large, black eyes, full of childlike innocence and naivety.<br/><br/>What a tall and handsome Cow King!<br/><br/>As the thieves approached even closer, they noticed Xiao Jinli and the others, and their faces changed drastically.<br/><br/>Just now, in their hurry to chase the cows and with the darkening sky, they hadn’t noticed Xiao Jinli and the others.<br/><br/>But as the group stopped running, drawing closer to the thieves, they finally noticed them.<br/><br/>“Who… who are you?” gasped Li Si, stuttering.<br/><br/>Xiao Chunfu’s face turned extremely sour, asking, “That’s what I should be asking you! Who are you? Why are you chasing these cows?”<br/><br/>Li Yuanming’s sharp, vigilant eyes met Xiao Chunfu’s.<br/><br/>He squinted his eyes and said, “We’re from the Cow Market. The cows sneaked out of the Cow Market when no one was looking, and we chased after them. Thank you for stopping these cows. Otherwise, it would be so hard for just the few of us to round them up by ourselves.”<br/><br/>What a shameless liar!<br/><br/>Xiao Chunfu was seething.<br/><br/>Suppressing his anger, he asked loudly, “Which Cow Market do you belong to? How did your cows escape to this area? I know everyone from the three nearby<br/><br/>Cow Markets, so how come I don’t know which one you belong to?”<br/><br/>Li Yuanming hesitated, then said, “We’re not exactly from one of these three markets, but we have a partnership with them. Today we bought over a dozen cows from one market and were about to transport them to the east city when the truck’s door wasn’t closed properly. The cows jumped out and ran away, so we chased after them.’<br/><br/>Xiao Chunfu obviously didn’t believe him, and sarcastically said, “Oh, which cow market are you cooperating with? I know all three bosses and have their phone numbers. I’ll have to call and ask them about these cows. What if these cows aren’t from their market, but were stolen by you?”<br/><br/>Li Yuanming and the others.\t\t\t\t\t\t</div>", "images": {}, "success": true}