{"id": 49, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14110126.html", "title": "Chapter 49 - Chapter 49: Chapter 49: Going To The County Town For The Competition (Requesting Evaluation And Comments)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 49 - Chapter 49: Chapter 49: Going To The County Town For The Competition (Requesting Evaluation And Comments)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 49: Chapter 49: Going to the County Town for the Competition (Requesting Evaluation and Comments)<br/><br/>Translator: 549690339<br/><br/>Peach Blossom Town Central Primary School, is one of the bottom five respectively among the eighteen key primary schools in Qing County.<br/><br/>So, being the principal of this school doesn’t really add much luster to one’s reputation.<br/><br/>Every time Principal Chen attended meetings in the county town, he would be criticized by the leaders of the Education Bureau.<br/><br/>Of course, this was also due to the issues concerning educational resources. Principal Chen was a good principal, he never let these negative emotions affect the students in his school.<br/><br/>Having been in office for just over a year, he hoped that the students in his school would earn some respect for him during his tenure.<br/><br/>For this trip to the county town for the competition, Principal Chen personally took three pupils with him.<br/><br/>Except for Xiao Jinli who parachuted into the quota, the other two made themselves stand out among all the students in the school with their own capabilities.<br/><br/>This time, going to the county town for the competition, besides excitement, there were also feelings of unease, trepidation and even fear.<br/><br/>However, what they didn’t know was that the school did not think highly of them, but instead put all its hopes on Xiao Jinli.<br/><br/>The two students had decent grades in their school.<br/><br/>However, when compared with others, their grades really left much to be desired.<br/><br/>For this competition, Principal Chen managed to secure three spots.<br/><br/>Looking at the anxious students, and then at another person who seemed to be calm and relaxed as if he were on a trip, Principal Chen felt a tightness in his chest.<br/><br/>He comforted the other two students by saying, “Li Xiaohua, Lan Dahai, don’t be nervous. We should consider it as a tour instead of a competition.”<br/><br/>Unfortunately, Principal Chen’s reassurances only made the two kids more nervous.<br/><br/>Facing the principal, Lan Dahai stammered, “But…but principal, we are going for a competition, 1…1 can’t pretend it’s a trip!”<br/><br/>Principal Chen,      felt even more disheartened.<br/><br/>He glanced at Xiao Jinli and said, “Cough, Cough, Xiao Jinli, why don’t you try comforting them?”<br/><br/>Xiao Jinli shrugged and said, “Principal Chen, you overestimate me. I’m nervous myself, how can I comfort my fellow students?”<br/><br/>Principal Chen,<br/><br/>Then Xiao Jinli changed the topic and said to them, “Li Xiaohua, Lan Dahai, you guys should see it this way. Look, Xiao Jinli’s grades are so poor, yet she can go to compete in the county town. I’m the school’s top student, so I must do better than her. If she’s not nervous, I should be even less so.’<br/><br/>Principal Chen,<br/><br/>Li Xiaohua and Lan Dahai,<br/><br/>Did they really need to put themselves down like this?<br/><br/>But, to their surprise, Xiao Jinli’s method of consolation seemed quite effective.<br/><br/>The two little students did seem to loosen up quite a bit.<br/><br/>Seeing this, Principal Chen immediately gave Xiao Jinli a kind smile, which caused her to feel the chills.<br/><br/>Actually, Li Xiaohua and Lan Dahai were quite curious as to why Xiao Jinli, who was suddenly able to participate in the competition, got this opportunity, and they felt a bit unconvinced.<br/><br/>They were selected to compete through school exams.<br/><br/>But Xiao Jinli’s grades were low, and she clearly didn’t qualify for the competition.<br/><br/>Why would the teacher choose Xiao Jinli to participate?<br/><br/>In fact, not just for these two students, many parents also felt puzzled.<br/><br/>Despite their children being ranked among the top ten in the whole school for their maths grades, they didn’t qualify to participate in the competition, yet a kid with average grades got the chance.<br/><br/>As a result, out of the parents of the top ten students, three or four came to the school to complain.<br/><br/>It’s unknown how the school explained to them, but after a while, this matter was no longer pursued.<br/><br/>“Xiao Jinli, have you ever been to the county town?” Li Xiaohua curiously asked.<br/><br/>Xiao Jinli nodded, “Yeah, I’ve been there.”<br/><br/>“Really? Is the county town fun?” Lan Dahai asked with his curious eyes wide open.<br/><br/>“What’s so fun about the county town? Apart from concrete and iron, and some taller buildings than the countryside, there’s nothing else to see or fun to do; downright less fun than herding cattle in the countryside.” Xiao Jinli said indifferently.<br/><br/>Principal Chen,<br/><br/>He was aware that this child came from a more affluent family, with a small western-style building and a sedan at her home, that made it convenient to go anywhere.<br/><br/>However, not all families have these conditions.<br/><br/>Going to the county town was quite inconvenient for them.<br/><br/>Therefore, without any pressing matters, few would go to the county town.<br/><br/>“But I heard from Lan Bing that the county town is really fun, with many delicious and fun things.” Li Xiaohua, furrowing his brows, looked a little puzzled, “He said he has been to an amusement park in the county town. There were so many kids there, it was really fun.”<br/><br/>After listening to him, Xiao Jinli frowned, but then said seriously, “I know that amusement park, my brother took me there once. However, we are here for the competition. As long as you guys relax during the exams and answer the questions seriously, when we get out of the examination room, I will take you out to have some fun. How does that sound?”<br/><br/>Upon hearing this, Li Xiaohua’s and Lan Dahai’s eyes lit up, full of anticipation. However, they stole a quiet glance at Principal Chen next to them and whispered, “Is this allowed? Will the Principal agree?”<br/><br/>Xiao Jinli immediately turned her gaze to Principal Chen and asked with an innocent and adorable smile, “Principal Chen, after we finish our exams, can we go out to play?”<br/><br/>Principal Chen, “… l’ Now that she put it that way, how could he not agree?<br/><br/>He nodded and said, “yes, as long as you all seriously answer the papers and perform beyond your normal capabilities in the exam, when you come out of the examination room, I’ll take you all to the amusement park to play. I’ll cover all costs as a reward for your efforts in this competition, what do you say?”<br/><br/>Hearing this, Xiao Jinli immediately approved, “Okay, Principal Chen, let’s agree on this.”<br/><br/>Then she turned to the other two students and said, “As long as you’re not nervous and perform well, after we finish the exams, we can have a great time.”<br/><br/>Internally she thought, “What’s so fun about children’s games anyway? But to pacify these two students, I just have to go along with it.”<br/><br/>Actually, Principal Chen didn’t mind taking them to the amusement park to have some fun.<br/><br/>As long as these two children weren’t too nervous and didn’t affect their performance, that would be just fine.<br/><br/>Although he didn’t expect them to bring back an award, he certainly didn’t want them to come last in the competition.<br/><br/>Upon Principal Chen’s promise, Li Xiaohua and Lan Dahai was no longer as nervous as before, rather, they felt excited and full of anticipation.<br/><br/>They could play in the county town, and it was Principal Chen who was going to take them.<br/><br/>When they returned to school and home, they could definitely show off.<br/><br/>Unknowingly, they arrived at the county town and followed the teachers to the hotel to rest..\t\t\t\t\t\t</div>", "images": {}, "success": true}