{"id": 41, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14107255.html", "title": "Chapter 41 - Chapter 41: Chapter 41: Conflict", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 41 - Chapter 41: Chapter 41: Conflict</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 41: Chapter 41: Conflict<br/><br/>Translator: 549690339<br/><br/>Li Yuanming certainly couldn’t name a cow market.<br/><br/>About half of these dozen or so cows were bought from a cow market, but the other half were stolen from nearby villages.<br/><br/>Seeing that they weren’t talking, Xiao Chunfu became more aggressive.<br/><br/>He continued, “What’s the matter? Is it that hard to name one of your cooperative cow markets? Or do you need to think for so long? Or,”<br/><br/>His sharp gaze swept over these people, and with a change of tone, he said sharply, “Are these cows really stolen by you?”<br/><br/>At this, Li Yuanming and the others’ expressions changed in the cover of darkness.<br/><br/>Li Si sharply retorted, “Bullshit, don’t slander us. We are legitimate cattle traders.”<br/><br/>“If you are legitimate cattle traders, what are you doing chasing our family’s cows?” Xiao Chunfu sharply countered, “How come our Cow King from Xiao Family Village has become one of your transactions, and we don’t even know about it?”<br/><br/>Upon hearing this, Li Yuanming and the others suddenly realized.<br/><br/>These three people came for the lost cow.<br/><br/>The missing cow was most likely the cunning and intelligent one among this group, the one that could open doors and untie ropes by itself.<br/><br/>No wonder they came looking for it.<br/><br/>Li Yuanming looked at the cow, which was now standing quietly beside a little girl. In its gaze at them, there was an inexplicable disdain and contempt.<br/><br/>Li Yuanming, “… l’ Was he crazy, or seeing things, to see such a look in a cow’s eyes?<br/><br/>Li Yuanming sized up the three people in front of him, exchanged glances with his comrades, and they all nodded slightly in tacit agreement.<br/><br/>Then they simultaneously reached out for their anesthetic guns and shot them at the three people, as well as the cow.<br/><br/>They couldn’t take the other cows away for now, but this clever and cunning one had to be taken.<br/><br/>No matter if these people were looking for it or not, they couldn’t see their faces clearly under the cover of darkness. Even if they knew they had stolen the cows, once they were all knocked out by the anesthesia, they would take the cow and run away.<br/><br/>They had beautiful thoughts.<br/><br/>They thought they could easily take out the three of them with anesthetic guns<br/><br/>In nana.<br/><br/>Little did they know that their every move was under Xiao Jinli’s watch.<br/><br/>As they raised their anesthetic guns and aimed them at the three of them, five thin silver needles flew out of nowhere, piercing their wrists directly.<br/><br/>Their wrists felt like they had been sliced by a sharp knife, causing them to instinctively throw away their anesthetic guns in pain, shouting, “Ah, it hurts!” The other hand instinctively covered the painful area.<br/><br/>The simultaneous actions of the five people made Xiao Chunfu and Xiao Siqian somewhat baffled.<br/><br/>What were these people doing all of a sudden?<br/><br/>Xiao Chunfu looked at them suspiciously and asked doubtfully, “What tricks are you playing? No, what did you just throw away?”<br/><br/>Having said that, his gaze searched the ground.<br/><br/>It was already very dark, and it was hard to see clearly. Xiao Chunfu took out his cellphone, turned on the light, and dimly illuminated the ground.<br/><br/>When he saw the things on the ground, Xiao Chunfu was greatly surprised, and his voice stuttered, “Gun… gun… you guys… ‘<br/><br/>Xiao Jinli just laughed softly, “Uncle Chunfu, it’s not a real gun, just an imitation. It’s an anesthetic gun. It’s just a tool they use to steal cows.”<br/><br/>“An… anesthetic gun?” Xiao Chunfu stammered.<br/><br/>Even if it was just an anesthetic gun, it still surprised him.<br/><br/>As rural people, besides working the fields, they had very little contact with other things.<br/><br/>The five silver needles in their wrists caused intense pain whenever they moved, distorting their expressions grotesquely.<br/><br/>Li Yuanming, covering his wrist, glared at Xiao Chunfu viciously, saying angrily, “I tell you, these cows were all bought from a cow market by us. Don’t you meddle in our business.”<br/><br/>Having said that, he glanced at the anesthetic guns discarded on the ground, wanting to squat down and pick them up despite the pain.<br/><br/>Xiao Siqian was faster. He took two quick steps forward, squatted down, and quickly picked up the guns before backing away two more steps.<br/><br/>Xiao Jinli, ‘<br/><br/>That was a swift move.<br/><br/>Li Yuanming’s eyes were full of anger as he cursed at Xiao Siqian, “Bastard, you little brat! Give me back that thing!”<br/><br/>After playing with the gun for a moment, Xiao Siqian showed a light smile. “This thing is fake, isn’t it? What’s the rush? Oh, right. This thing isn’t fake for you guys. It’s your tool for making a living.”<br/><br/>Li Yuanming became even angrier. His sharp gaze swept over the three of them, followed by a cold sneer. “I advise you to be sensible. Do you really think you’re capable, with an old man, a young man and a little girl?” Xiao Chunfu couldn’t help but get angry when he heard that.<br/><br/>He thought for a moment and said, “Who said there are only three of us? I called the village when I found you. They’ll be here soon. I see you guys have strange faces, you must not be from the villages around here. I think you should be sensible. Don’t think we’re easy to bully.”<br/><br/>Fortunately, he didn’t impulsively tell them that he had already called the police.<br/><br/>Otherwise…<br/><br/>Upon hearing this, the expressions of Li Yuanming’s five men changed once again.<br/><br/>Li Si looked at them and saw that the old man was the only tricky one. The other man looked young, so he wouldn’t have much strength.<br/><br/>As for the little girl, she could be completely ignored.<br/><br/>Li Si gritted his teeth and said, “Brother Ming, what are you hesitating for? Let’s do it before their people arrive.”<br/><br/>The others also had this idea.<br/><br/>Xiao Siqian and Xiao Chunfu immediately protected Xiao Jinli behind them, looking extremely vigilant and on guard, and prepared for the others to pounce on them.<br/><br/>Li Yuanming and his men raised their fists and smashed them towards the heads of Xiao Siqian and Xiao Chunfu.<br/><br/>Having trained since childhood in Sanda, Taekwondo, and even a few moves from his family bodyguard, Xiao Siqian was more than capable of protecting himself.<br/><br/>Faced with a powerful enemy, he didn’t care about hiding his abilities due to amnesia.<br/><br/>He raised his long leg and swept it forcefully, swiftly and sharply kicking Zhang Si and Lai Wu to the ground. Immediately, he raised his fist and fiercely punched at the other three, then raised his long leg again and knocked them all down with one kick each.<br/><br/>A series of wails echoed on the ground.<br/><br/>Covering their stomachs, faces, or hands…<br/><br/>Xiao Jinli, ‘<br/><br/>His skills were quite good.<br/><br/>Xiao Chunfu was amazed, his mouth agape.<br/><br/>He didn’t expect the young man to be so capable.<br/><br/>He had even gotten into a fighting stance, but in the end…<br/><br/>Xiao Siqian’s sharp eyes coldly stared at the thieves he had taken down in just a few moves.<br/><br/>He thought to himself, “Humph, when dealing with vicious kidnappers, he’d run away like a lost dog. But when dealing with ordinary thieves like you, his skills are more than enough..”\t\t\t\t\t\t</div>", "images": {}, "success": true}