{"id": 42, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14107261.html", "title": "Chapter 42 - Chapter 42: Chapter 42: Taking Her As A Hostage", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 42 - Chapter 42: Chapter 42: Taking Her As A Hostage</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 42: Chapter 42: Taking Her as a Hostage<br/><br/>Translator: 549690339<br/><br/>Li Yuanming and the others were dumbfounded by being knocked down.<br/><br/>They initially thought that the most difficult person to deal with would be the older man.<br/><br/>However, the king turned out to be this young man.<br/><br/>In just a few moves, he knocked down all five of their robust men.<br/><br/>And he beat them so hard that they were crying out in pain.<br/><br/>They had never felt so humiliated in their lives.<br/><br/>Lai Wu angrily cursed, “You son of a turtle.”<br/><br/>Xiao Siqian’s face darkened, he stepped forward, and delivered another kick to Lai Wu’s stomach.<br/><br/>With this kick, Lai Wu felt as if his internal organs were about to be kicked out of his body.<br/><br/>This young man was not to be underestimated; he was really ruthless.<br/><br/>Xiao Siqian looked at Xiao Chunfu and asked, “Uncle Chunfu, should we find something to tie them up? After all, they are cattle thieves. If they run away, it will be difficult to find them in this darkness.<br/><br/>Upon being reminded by Xiao Siqian, Xiao Chunfu immediately regained his senses and nodded.<br/><br/>He said, “Yes, yes, we need to tie them up.”<br/><br/>He then looked at Li Yuanming and the others coldly and said, “Hmph, you dared to steal our cows from Xiao Family Village. Not only did you manage to steal, but you even stole the Cow King.<br/><br/>Now, you not only failed to steal chickens but also lost your rice. Worse, you will end up in prison. Ha, did you think you could steal the Cow King so easily? Don’t you know that the Cow King is our precious treasure in Xiao Family<br/><br/>Village? Now you are paying the price.”<br/><br/>Xiao Jinli, “… l’ Watching Uncle Chunfu’s proud appearance, he looked like a proud rooster. However, it was quite adorable.<br/><br/>Xiao Jinli lowered her head slightly, holding back her laughter.<br/><br/>Xiao Siqian watched Xiao Chunfu’s behavior, and the corner of his mouth curled up slightly, revealing a trace of a smile.<br/><br/>The people here were really simple and cute.<br/><br/>On the other hand, the emotions of Li Yuanming and the others were the exact opposite.<br/><br/>They had been stealing for several years, but this was the first time they had stumbled so miserably.<br/><br/>After listening to Xiao Chunfu’s words, they were both angry and annoyed. At the same time, they regretted not having investigated Xiao Family Village thoroughly beforehand.<br/><br/>Now that they had failed to steal chickens and lost rice, they might face prison disaster.<br/><br/>They couldn’t afford to sit idly by at this point.<br/><br/>They had to seize the opportunity to escape quickly.<br/><br/>As for the lost cattle, there would be plenty of opportunities to recoup their losses later.<br/><br/>Li Yuanming held his stomach, shooting an angry and sharp gaze towards Xiao Jinli behind Xiao Siqian.<br/><br/>Now, their only breakthrough point for escape was this little girl.<br/><br/>As long as they grabbed the little girl, they would have a hostage and could escape easily.<br/><br/>Compared to Zhang San and Li Si, Li Yuanming was closest to Xiao Jinli.<br/><br/>He struggled to get up, his face twisted with pain, and forced out a seemingly sincere smile.<br/><br/>He said to Xiao Chunfu, “Big brother, we were wrong, and we apologize. We will never steal again. Please forgive us and let us go. Can you?”<br/><br/>As he said this, his body tilted slightly, but his feet moved closer to Xiao Jinli’s direction.<br/><br/>Xiao Chunfu sneered and said, “Hmph, if everyone could easily get away with their wrongdoings by apologizing, then what would be the point of having government officials? What would you do?”<br/><br/>He glared with wide eyes and shouted.<br/><br/>At this very moment, Zhang San and Li Si, who were lying on the ground, suddenly pounced forward in sync, each grabbing one of Xiao Siqian’s legs.<br/><br/>At the same time, Li Yuanming reached out his hand and immediately grabbed Xiao Jinli, his other hand quickly gripping her neck.<br/><br/>In fact, Xiao Siqian had been protecting Xiao Jinli the whole time, and he was also on guard against Li Yuanming.<br/><br/>However, there were too many opponents, and they were highly coordinated. By the time he broke free from the two men grabbing his legs, Xiao Jinli was caught unprepared and seized by Li Yuanming.<br/><br/>Xiao Chunfu was furious to see Xiao Jinli being seized.<br/><br/>He pointed at Li Yuanming and shouted, “What are you trying to do? Let her go; she’s just a child. If you hurt even a hair on her head, the entire Xiao Family Village will not let you off.”<br/><br/>Xiao Jinli was the darling of the whole village, and no one was allowed to hurt her.<br/><br/>Having suffered so much humiliation before, Li Yuanming and the others were now very smug, with a hostage in hand.<br/><br/>Li Yuanming said triumphantly, “As long as you agree to our terms, I won’t hurt  this child. Otherwise, if we don’t end up well, this child will accompany us.”<br/><br/>Hearing this, Xiao Chunfu immediately replied, “Okay, okay, just tell us what your terms are.”<br/><br/>Xiao Siqian, however, stared at Li Yuanming intensely. His sharp eyes flashed with a hint of murderous intent as he coldly said, “She’s just a child! If you want a hostage, take me instead. Let her go!”<br/><br/>Li Yuanming sneered and said, “Hmph, do you think I’m an idiot? If I let her go, you’ll have nothing to fear. Don’t try to trick me with such nonsense. As I said, as long as you promise my conditions, I will release her as soon as we’re safe.”<br/><br/>With that, he tightened his grip on Xiao Jinli’s neck, causing her to utter a soft groan.<br/><br/>Xiao Chunfu immediately waved his hand and said, “Alright, alright, just tell us your conditions. Just be gentle.”<br/><br/>Li Yuanming said, “First, bring back the cattle that escaped, including the Cow King you spoke of. Second, we will take these cattle and leave together. Once we are safely away, we will naturally let the child go. Now, will you agree to these conditions or not?”<br/><br/>However, before Xiao Chunfu could answer, the Cow King was already provoked.<br/><br/>It raised its head and let out a loud “moo” twice towards the sky.<br/><br/>Then, with its head aimed at Li Yuanming’s direction, it thrust its sharp horns from behind.<br/><br/>Li Yuanming had no defense against the cow, let alone the fact that the Cow King attacked from behind. He was caught off guard, and the whole person was pushed forward. The grip on Xiao Jinli’s neck eventually lost its strength.<br/><br/>However, just as Xiao Jinli was about to be crushed under Li Yuanming, Xiao Siqian and Xiao Chunfu had no time to save her.<br/><br/>At that moment, Xiao Jinli unexpectedly executed a shoulder throw and threw Li Yuanming out.’<br/><br/>These actions happened too quickly, leaving Xiao Siqian dumbfounded.<br/><br/>After throwing Li Yuanming to the ground, Xiao Jinli rubbed her hands and coldly said, “Did you not know that I’m very strong? Even without the Cow King’s help, I could have easily thrown you down with a shoulder throw. How does it feel?”<br/><br/>In fact, Xiao Jinli allowed herself to be caught on purpose.<br/><br/>She wanted to buy some time, wait for these accomplices to arrive, and then capture them all in one fell swoop.<br/><br/>However, she never expected that the Cow King would come to her rescue so eagerly, creating such a scene..\t\t\t\t\t\t</div>", "images": {}, "success": true}