{"id": 48, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14110123.html", "title": "Chapter 48 - Chapter 48: Chapter 48: Competing To Thank The Cow King", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 48 - Chapter 48: Chapter 48: Competing To Thank The Cow King</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 48: Chapter 48: Competing to Thank the Cow King<br/><br/>Translator: 549690339<br/><br/>News of the people from Xiao Family Village helping other villages find their stolen cattle spread as quickly as the wind, reaching the surrounding ten miles and eight villages.<br/><br/>They cursed the cattle thieves with all sorts of disgusting words, accusing them of having no conscience, black hearts, and wishing for festering sores on their feet.<br/><br/>At the same time, they were surprised to find that their domestic cattle had been retrieved thanks to a cow from Xiao Family Village that had also been stolen.<br/><br/>Listening to the story of a cow saving another cow, everyone found it astonishing.<br/><br/>“Is that cow from Xiao Family Village really that smart?” someone questioned doubtfully.<br/><br/>“I heard that the cow has been smart since it was young. It can understand human speech.”<br/><br/>“I would like to go and see for myself if this cow is really that extraordinary.”<br/><br/>So, people from other villages would occasionally come to Xiao Family Village these days to visit the Cow King.<br/><br/>Of course, those whose cattle had been lost and then found again were sensible enough to bring gifts to the rescuer’s house to express their gratitude. After all, they helped them find their lost cattle, which saved them a loss of several thousand yuan.<br/><br/>Ha, those gifts were naturally sent to Xiao Jinli’s home.<br/><br/>It’s not like they could send a bundle of straw as a gift to the cow that saved the day – that would only make them a laughing stock.<br/><br/>Though people brought gifts to the master’s house, they still wanted to see the cow.<br/><br/>“This is the Cow King, it really looks majestic,” a villager from West Cow Village said while watching the Cow King running in the field, quite impressed, “How did you raise such a smart cow? Is it like training a dog?”<br/><br/>Xiao Chunfu smiled and said, “That’s not the case. If the Cow King could be trained, our Xiao Family Village would have more than just one. This Cow King is quite special in that it’s very smart from birth. Such exceptional cases are rare, just like among humans, as most are ordinary, and absolute geniuses are very few. Maybe only one or two in several million. The birth of this cow might be similar.”<br/><br/>“Haha, what you said makes some sense,” the villager from West Cow Village laughed, “I wonder what the mother cow had eaten while pregnant with it, otherwise, why would its brain be so special?”<br/><br/>Xiao Chunfu shook his head, “Who knows? Besides eating grass, they are left to find their own food. No one knows what the mother cow ate back then.<br/><br/>As for the Cow King, ever since villagers from the surrounding areas came to visit it, it had been excited all the time.<br/><br/>It often ran to an open area and performed for the people.<br/><br/>Like a loveable and mischievous child who loves to show off, the Cow King was either bellowing loudly or training the other cows in the village, creating a chaotic dance scene. It was hilarious.<br/><br/>“Haha, this Cow King is so adorable! It looks majestic and domineering too.”<br/><br/>“Haha, look at it training the other cows to behave so obediently. If we had such a group of well-behaved cows, taking care of them would be so much easier!”<br/><br/>“I wish our village had a Cow King like this. If we had one, we’d all be worshipping it. It saves us so much trouble.”<br/><br/>Xiao Jinli certainly knew about the Cow King being adored and admired by the villagers from the surrounding areas.<br/><br/>She just smiled.<br/><br/>If the Cow King wanted to show off, so be it.<br/><br/>As for those who wanted to steal the Cow King, just see if they had the ability to do so.<br/><br/>The Cow King had been nourished by her Lingquan water since its birth, making its body strong and resistant to all toxins.<br/><br/>Anesthetics would only work on it for a short while.<br/><br/>Unless they wanted to end up like the previous cattle thieves who not only suffered a complete failure but also faced severe punishment.<br/><br/>It was said that the thieves were sentenced to a minimum of three years to a maximum of seven years in prison and were also fined heavily.<br/><br/>All these able-bodied people, why did they have to do such chicken-stealing and dog-touching things? Now they’re trapped in a big pit and can’t climb out.<br/><br/>Xiao Jinli arrived at school, and the new class headteacher, Teacher Yang, came to find her.<br/><br/>“Student Xiao Jinli, come with me to the Principal’s Office!” Teacher Yang called to her as she was about to slip away after class.<br/><br/>As a result, Teacher Yang had come to catch her at just the right time.<br/><br/>Xiao Jinli, who was packing her schoolbag, paused and showed a slightly helpless expression in her eyes.<br/><br/>She muttered in response, “Okay, I know, I’ll be right there.”<br/><br/>After packing her schoolbag, she carried it on her back and followed Teacher Yang.<br/><br/>She said, “Teacher Yang, you guys don’t need to keep such a close eye on me. I said I would participate in this Math Olympiad, and I won’t go back on my word.”<br/><br/>Faced with such a student who often wants to sleep in and slip away, Teacher Yang helplessly said, “Student Xiao Jinli, it’s not that we’re keeping such a close eye on you, but if we don’t, who knows when you’ll be willing to turn over a new leaf. The competition in the county town is tomorrow, and Principal Chen just wants you to go over and ask about the situation.”<br/><br/>Xiao Jinli shrugged and said, “What’s there to ask? You guys catch me and do this every day.”<br/><br/>Teacher Yang helplessly said, “We have no choice. The principal and the school have placed all their hopes on you. We hope you can bring glory to our whole school.”<br/><br/>Xiao Jinli, ‘<br/><br/>She’s stuck on this boat and can’t get off now.<br/><br/>Glancing at Xiao Jinli’s expression, Teacher Yang smiled and said, “Of course, Student Xiao Jinli, you don’t need to be too nervous either. Just do your best and see how fate plays out. No one will blame you.”<br/><br/>Xiao Jinli, ‘<br/><br/>What if she comes back with a zero?<br/><br/>After a while, the two arrived at the Principal’s Office.<br/><br/>Seeing Xiao Jinli appear, Principal Chen smiled like a fox.<br/><br/>He said, “Student Xiao Jinli is here, take a seat.”<br/><br/>Xiao Jinli looked at the enthusiastic Principal and got straight to the point,<br/><br/>“Principal, just tell me directly, what do you want me to do this time?”<br/><br/>“Ahem…” Principal Chen said with a slightly serious expression, “Well, Student Xiao Jinli, I have a set of test questions here, could you give them a try?” Xiao Jinli stared at Principal Chen with a strange look in her eyes.<br/><br/>These test questions wouldn’t be for tomorrow’s competition, would they?<br/><br/>Principal Chen immediately explained, “Don’t misunderstand. These test questions are from last year’s competition, which I got through connections.”<br/><br/>“Oh, I see!” Xiao Jinli nodded and replied, “Alright, I’ll give it a try.”<br/><br/>Then, Xiao Jinli took the test questions and pen from Principal Chen, glanced at the entire exam paper, and began writing quickly.<br/><br/>After a moment, she looked up at Principal Chen and said, “I’m done.”<br/><br/>“Ah, so soon? Finished in just twenty minutes?” Teacher Yang, who had been watching the time, was very surprised.<br/><br/>“Yes, I’m done!” Xiao Jinli nodded.<br/><br/>It took her twenty minutes, but in her eyes, these questions were no more complicated than 1+1. They didn’t need twenty minutes, at most five.<br/><br/>These five minutes were just for her to write.<br/><br/>Principal Chen was shocked by the answers she came up with..\t\t\t\t\t\t</div>", "images": {}, "success": true}