{"id": 45, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14107279.html", "title": "Chapter 45 - Chapter 45: Chapter 45: The Situation Repeats (Seeking Votes And Reviews!)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 45 - Chapter 45: Chapter 45: The Situation Repeats (Seeking Votes And Reviews!)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 45: Chapter 45: The Situation Repeats (Seeking Votes and Reviews!)<br/><br/>Translator: 549690339<br/><br/>Just as Wang Gouzi and his men were about to break through, the cloth in Lai Wu’s mouth somehow came loose.<br/><br/>He shouted, “Wang Gouzi, there are still many people ambushed here…”<br/><br/>Before he could finish, Xiao Siqian quickly covered his mouth and stuffed the cloth back in.<br/><br/>Wang Gouzi and his men were shocked by his words.<br/><br/>“There are many people ambushed here?” Liu Ba incredulously replied, “Brother Wang, what…”<br/><br/>Wang Gouzi spat and said with a murderous look on his face, “What’s the matter? We’re not afraid.<br/><br/>With that, he pulled out an anesthetic gun and yelled to his companions, “Those of you with a weapon like this, take it out now.”<br/><br/>Then he shot towards Xiao Chunfu’s direction.<br/><br/>In his mind, with the dark sky providing cover, no matter how many people his opponents had, they would all be brought down.<br/><br/>However, most of the weapons had been taken by Li Yuanming when he went after the escaping cattle.<br/><br/>So, among their group of more than ten, they had only three weapons. Normally, these three weapons would be enough to knock down their opponents.<br/><br/>However, when he pulled out his weapon, Li Yuanming and the others had a look of hope in their eyes.<br/><br/>Just now, they didn’t know why their weapons simultaneously had failed, but they were putting their hope in Wang Gouzi.<br/><br/>After all, having that weapon was much more advantageous than fighting with real knives and iron rods.<br/><br/>They could eliminate their opponents without touching them and do so effortlessly and ruthlessly.<br/><br/>However…<br/><br/>More screams!<br/><br/>Then the three holding the anesthetic guns covered the hand holding the gun with the other hand, and due to the pain, they reflexively threw the guns away.<br/><br/>The others heard their screams and were perplexed, but they also noticed the anesthetic guns thrown away.<br/><br/>“Brother Wang, what happened to you guys?”<br/><br/>“Brother Wang, what’s wrong with your hands? Were they bitten by insects?”<br/><br/>Wang Gouzi, enduring the pain, picked up his own weapon with gritted teeth and told the others, “Hurry up and pick up the weapons on the ground.”<br/><br/>At his command, two of them quickly picked up the anesthetic guns on the ground.<br/><br/>They were afraid if they were any slower, their opponents would pick them up first.<br/><br/>But they were still puzzled, as it was strange for all three people to cry out in pain at the same time.<br/><br/>Even if bugs bit them, they couldn’t all be bitten at the same time.<br/><br/>In fact, not only were Wang Gouzi’s group of cattle thieves puzzled, but even Xiao Siqian was full of doubt.<br/><br/>This was really strange.<br/><br/>Why did all these people have such an incident at the same time?<br/><br/>Their screams were all the same, and they all held their wrists.<br/><br/>If it was an insect bite, how could they be bitten at the same time?<br/><br/>The odds of that happening were far too low.<br/><br/>However, the situation was very favorable for their side.<br/><br/>As their opponents were picking up the anesthetic guns, noises came from the mountain top.<br/><br/>“Xiao Qingshan, where are you? We’re here.”<br/><br/>The yelling suddenly broke the strange atmosphere.<br/><br/>The one who picked up the anesthetic gun was so scared that he almost threw it away again.<br/><br/>Upon hearing the shouting, Xiao Qingshan could only run out from his hiding place and respond to the voices above, “Dad, we’re here. There are more than ten people here with weapons. Did you bring weapons too?”<br/><br/>Wang Gouzi and the others were speechless.<br/><br/>They didn’t expect that suddenly emerging from the darkness would be another person.<br/><br/>Oh, no, many more people emerged.<br/><br/>Because as Xiao Qingshan came out, the others also received a signal and left the darkness one after another.<br/><br/>There were also about twenty people.<br/><br/>Wang Gouzi and the others’ pupils suddenly shrank.<br/><br/>Then, Wang Gouzi reacted and roared towards Xiao Qingshan, “You were hiding here?”<br/><br/>But why were they hiding?<br/><br/>Xiao Qingshan shrugged and replied, “Yeah, we were hiding here.”<br/><br/>At this point, he paused and sincerely advised, “I suggest you surrender. Be lenient if you confess, and be strict if you resist! The five accomplices you wanted to rescue were already tied up by us long ago.”<br/><br/>“Already tied up?” Wang Gouzi’s pupils shrank again, and he quickly realized what happened. He asked, “So the phone call earlier wasn’t answered by Third Brother, but by you guys? You wanted us to come over, right?”<br/><br/>Xiao Qingshan nodded and praised miserly, “You’re quite clever. It’s just a pity you didn’t walk the right path.”<br/><br/>Wang Gouzi,<br/><br/>He said viciously, “Hmph, so what if you have more people? We have quite a few people here too. Who will win is still unknown.”<br/><br/>Immediately, he looked at his companions and said, “Brothers, grab your weapons. Before their people come down, let’s save Brother Ming first, then catch some of them. The more we can catch, the better!”<br/><br/>His companions responded.<br/><br/>Li Yuanming and the others hummed in response, but their eyes couldn’t help but reveal a glimmer of hope.<br/><br/>After all, if they could be saved and escape, they wouldn’t have to go to prison in the future.<br/><br/>Xiao Qingshan’s side did not show weakness either, he asked the villagers, “We should also be careful. They have knives and iron rods in their hands. If you can’t defeat them, run. Don’t fight them hard.”<br/><br/>The villagers also responded.<br/><br/>Just as the fight was about to erupt, voices came from the mountain top again.<br/><br/>“The government officials are here!”<br/><br/>Then, a stern angry shout followed, “What are you doing? Stop!”<br/><br/>Wang Gouzi and the others turned pale when they heard the shouting.<br/><br/>One of his companions in panic said, “Brother Wang, the government officials are here, we can’t save Brother Ming now, let’s run away quickly. If we’re caught, we’ll definitely be sentenced with the crimes we’ve committed.” The others had the same mindset.<br/><br/>They could show their loyalty and disregard their lives to save their fellows.<br/><br/>But they couldn’t be captured and sent to the Yamen.<br/><br/>Because once they were caught and sent to the Yamen, they would face the possibility of a sentence, and going to prison would implicate their families. Wang Gouzi, after hearing his companion’s persuasions, decided to retreat. His face was gloomy, and he said coldly, “Let’s go!”<br/><br/>But as they tried to retreat, they found that they were surrounded by a group of people.<br/><br/>Unbeknownst to them, another group of people had appeared, blocking their escape route.<br/><br/>Wang Gouzi and his group pointed their knives and iron rods at the people blocking them and ferociously said, “Get out of the way, or don’t blame us for being rude.”<br/><br/>Facing these sharp weapons, some people’s faces showed tension as they stepped back a few steps in fear.<br/><br/>At this time, Xiao Siqian and Xiao Jinli quickly ran over.<br/><br/>Xiao Siqian looked at them and sneered, “In order to catch all of you, we set up this act. If we just let you go now, wouldn’t all our efforts have been in vain?<br/><br/>Hmph, if you want to leave, dream on!”<br/><br/>Wang Gouzi and the others’ faces instantly turned extremely ugly..\t\t\t\t\t\t</div>", "images": {}, "success": true}