{"id": 46, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14107285.html", "title": "Chapter 46 - Chapter 46: Chapter 46: All Caught In The Net! (Please Vote And Leave A Message)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 46 - Chapter 46: Chapter 46: All Caught In The Net! (Please Vote And Leave A Message)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 46: Chapter 46: All Caught in the Net! (Please vote and leave a message)<br/><br/>Translator: 549690339<br/><br/>Although Wang Gouzi and his gang were not the most vicious outlaws, they were not patient when facing threats either.<br/><br/>He glared at the young Xiao Siqian, his eyes flashing maliciously, and said viciously, “You little rabbit, get out of my way, or don’t blame me for being impolite.”<br/><br/>With that said, he waved the sharp knife in his hand.<br/><br/>Xiao Siqian completely ignored his threat and continued, “Do you know why your five accomplices were caught? I’ll tell you, it’s because they met me.<br/><br/>They’re unlucky to have met me.”<br/><br/>Wang Gouzi and the others simply didn’t believe his words.<br/><br/>Wang Gouzi, with a dark, iron-like expression, sneered, “I, Wang Gouzi, have traveled far and wide, encountering all kinds of situations and all kinds of people. But you’re the first one to brag in front of me.”<br/><br/>He turned his head slightly, eyes glinting maliciously, his heart filled with urgency as he noticed the approaching crowd. Then, he gritted his teeth, brandished the knife, and charged towards Xiao Jinli.<br/><br/>That’s right, it was Xiao Jinli.<br/><br/>Among the people here, only this child was the weakest.<br/><br/>Only by capturing her would these people hesitate and perhaps let them all go.<br/><br/>Unfortunately, what he thought was the weakest child…<br/><br/>Just as the sharp knife swung towards her, someone worriedly shouted, “Jinli, watch out!”<br/><br/>Immediately, they saw that as the knife approached Xiao Jinli, she skillfully squatted down, dodging the blade. Then, while squatting, she launched a series of kicks towards Wang Gouzi’s lower leg, delivering a fierce kick.<br/><br/>Xiao Jinli had enough strength, and with such a kick, Wang Gouzi was sent toppling forward by the force, falling face-first into the mud according to the laws of physics.<br/><br/>As for the sharp knife in his hand, it clattered to the ground a short distance away.<br/><br/>At the moment he fell to the ground, Xiao Jinli’s footsteps swiftly followed, stepping directly onto his back.<br/><br/>The other accomplices shuddered when they saw this scene.<br/><br/>This child, this child was so ruthless and so strong.<br/><br/>Was she just a child? A girl?<br/><br/>Xiao Jinli firmly stepped on Wang Gouzi’s back, her young face looking at the other accomplices, and then coldly said,<br/><br/>“I advise you to lay down your weapons and surrender. You will not be able to escape. Even if you escape, as soon as your accomplices are caught, it’s only a matter of time before you’re caught too.<br/><br/>So, put down your weapons and report to the government officials now. The punishment will certainly be lighter. Otherwise, well, just wait for the heavier punishment. The nets of heaven are vast, but they spare no one! You decide for yourselves.”<br/><br/>The little girl’s immature and clear voice was decisive and deafening.<br/><br/>Miraculously, the thieves who were running around trying to escape seemed to calm down at this moment.<br/><br/>The villagers of Shibei Village were dumbfounded.<br/><br/>They were close to Xiao Family Village, so they had naturally heard of this child.<br/><br/>But they never thought that this child from Xiao Family Village would be so bold and reckless.<br/><br/>A child, facing a person wielding a sharp knife, showed no fear.<br/><br/>Even they, as adults, did not have such courage.<br/><br/>With the atmosphere getting increasingly bizarre, the Village Head of Xiao Family Village finally arrived with the policing officers.<br/><br/>Noticing the situation at hand, they too were somewhat stunned.<br/><br/>A policing officer asked doubtfully, “What’s going on here?”<br/><br/>Five were tied up, one adult was pinned down by a child, and the people at the scene seemed to have hit the pause button.<br/><br/>“Ahem…” One of the policing officers recognized someone from Xiao Family Village.<br/><br/>Not long ago, they had also come to Xiao Family Village to arrest Liu Bald and his son.<br/><br/>The Village Head first spotted Xiao Jinli and immediately asked, “Jinli, how are you, are you all right?”<br/><br/>Xiao Junxuan and his father Xiao Wanshan also looked very concerned and asked, “Xiao Bao, are you alright? Are you injured anywhere?”<br/><br/>Jinli shook her head and said, “Uncle Village Chief, Dad, older brother, I’m fine, don’t worry about me!”<br/><br/>Xiao Siqian,<br/><br/>So, whoever came here, the first thing they would do was show concern for Jinli.<br/><br/>It didn’t matter if it was between family members, but others also seemed concerned.<br/><br/>This made Xiao Jinli’s importance in the village even more apparent.<br/><br/>She’s… just a kid, right?<br/><br/>After a thorough examination, Junxuan was relieved to find that his sister was unharmed. He then directed his anger towards the thief under Jinli’s feet.<br/><br/>He angrily asked, “Sister, what did this guy do to you? Let me handle this, my strength is greater, and I’ll make sure he won’t be able to catch his breath.” Villagers, “…” Are you sure your strength is greater than your sister’s?<br/><br/>Xiao Siqian,<br/><br/>Everyone didn’t seem to think it was strange that Jinli had the thief pinned down under her feet.<br/><br/>Could it be… due to her impressive strength?<br/><br/>Jinli lifted her foot off the man and shook her head, “No need. He tried to escape, and I stopped him. Even if I let him go now, he won’t be able to get away.”<br/><br/>The man lying on the ground with the name Wang Gouzi, felt like crying but had no tears.<br/><br/>He just wanted to run away, but how could it be so difficult? Being stepped on by a little girl, it was utterly humiliating.<br/><br/>With this dark history, how would he face the villagers in the future?<br/><br/>Regardless of his unwillingness and humiliation, he had to be handcuffed by the police when they arrived.<br/><br/>Because there were too many of them, the number of handcuffs brought by the police were limited.<br/><br/>The previously tied-up thieves would continue to be tied but with their mouths and feet freed of cloth and rattan.<br/><br/>Officer Xiao Li sympathetically told them, “You guys have good health and strength, but instead of doing something meaningful, you committed disgusting acts like theft. Look at the situation now, tied up like this. I hope you learn your lesson and cooperate with us to get lenient treatment.”<br/><br/>People like Li Yuanming were too ashamed to respond, and their expressions showed a mix of anger, annoyance, and regret.<br/><br/>Those without handcuffs had their hands tied with a few strips of rattan as well.<br/><br/>Officer Liu looked at the dozen or so cattle thieves and then looked around, before asking, “Village Chief, where are the stolen cattle?”<br/><br/>He had heard that these cattle thieves had stolen more than ten cattle, but he hadn’t seen a single one yet. The cattle couldn’t have run away, right?<br/><br/>Xiao Chunfu laughed and said, “The cattle are hidden now.” Jinli looked at Officer Liu and immediately blew a whistle. As soon as her whistle sounded, a cow responded with a moo.<br/><br/>“Moo!<br/><br/>The sound came from the left side of the mountain.<br/><br/>In no time, the majestic Cow King led a group of yellow and water cattle in a grand procession toward them.<br/><br/>Officer Liu and others were astonished to see this.<br/><br/>Had those cattle gained spiritual wisdom or something?<br/><br/>Officer Liu curiously asked with a smile, “How did you train these cattle? They seem so intelligent.”<br/><br/>At this, Xiao Qingshan became excited, “This is our Xiao Family Village’s Cow<br/><br/>King. He’s really smart and sensible..”\t\t\t\t\t\t</div>", "images": {}, "success": true}