{"id": 47, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14110120.html", "title": "Chapter 47 - Chapter 47: Chapter 47: Cow King Seeking Praise And Compliments", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 47 - Chapter 47: Chapter 47: Cow King Seeking Praise And Compliments</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 47: Chapter 47: Cow King Seeking Praise and Compliments<br/><br/>Translator: 549690339<br/><br/>After arriving in the crowd, Cow King walked directly towards Xiao Jinli, nuzzling her palm with its fluffy head, its bright eyes seemingly seeking praise and compliments.<br/><br/>These movements straight-up melted some people.<br/><br/>“This cow is so intelligent, it’s really adorable!” Although it was an impressive water buffalo.<br/><br/>“Look at it, its eyes… it’s like a child seeking praise.”<br/><br/>The villagers of Xiao Family Village, chuckling in agreement, said, “Haha, it is indeed seeking praise right now.”<br/><br/>As his words fell, Xiao Jinli raised her hand, showing a slightly helpless face, and praised with a smile, “Yes, yes, Cow King really did an excellent job, you’ve saved so many of your kind, a great deed indeed!”<br/><br/>Upon hearing its young master’s praise, Cow King immediately got excited. It raised its head high towards the sky and let out a series of moo’s.<br/><br/>It was simply earth-shattering!<br/><br/>Officer Liu and his colleagues, watching this scene, were both intrigued and extremely curious.<br/><br/>“Cow King?”<br/><br/>This was the first time Officer Liu and the other government officials had heard of him.<br/><br/>An animal referred to as a king by humans must certainly possess extraordinary qualities compared to other animals of the same species.<br/><br/>Xiao Qingshan said smugly, “Yeah, it’s the Cow King. Speaking of Cow King, there’s actually a legendary story to it.”<br/><br/>Officer Liu and his colleagues became instantly interested.<br/><br/>Officer Xiao Li asked curiously, “Tell us, this sounds legendary!”<br/><br/>Xiao Qingshan explained, “About ten years ago, when Cow King was still in its mother’s womb, a difficult birth took place. It couldn’t be delivered after a whole day and night. Jinli, out of curiosity, went to see what was happening.<br/><br/>Unexpectedly, as Jinli arrived, Cow King was born. Its mother, after the delivery, knelt directly towards Jinli in gratitude.<br/><br/>The little calf that had just been born could hardly stand, but it still wobbled towards Jinli, tears pooling in its eyes. It was indeed very adorable.<br/><br/>Later, when Jinli was going home, Cow King followed directly behind her. Jinli took it in, and since then, Cow King has been well-behaved and sensible, leading other cows not to trample on the vegetables and crops in the village. But Cow King has always listened to Jinli the most.”<br/><br/>By this point, Xiao Qingshan seemed to think of a question and asked, “Officer Liu, will Cow King be brought into custody this time?”<br/><br/>Upon hearing this, Officer Liu burst into laughter and said, “Young man, what are you thinking? No matter how smart and sensible Cow King is, it’s still a cow, a cow from your village. How could we possibly bring it back to Yamen? Rest assured, we will only take the relevant personnel back to the Yamen office.’<br/><br/>At this point, Officer Liu asked with curious skepticism, “You guys aren’t going to tell me that these men were captured largely due to Cow King, are you? And how did these cows escape? Can you explain?”<br/><br/>Originally, when their Yamen office received the alarm from the people of Xiao Family Village, it was mentioned that their village cows had been stolen, but they had also caught the thieves.<br/><br/>The rest, they only found out upon arrival at the scene.<br/><br/>Xiao Jinli smiled at Officer Liu and said, “Officer Uncle, I suppose I’ll have to be the one to explain this. Because only I can communicate with Cow King.<br/><br/>Cow King told me that it was drugged and secretly transported from Niu Xinshan to some place. When it woke up from the anesthesia, it found that many of its kind were locked up and tied up around it.<br/><br/>After communicating with these related cattle, it learnt that they all were stolen in the same way. After hearing this, Cow King took advantage of the lack of attention from those people, gently opened the cowpen gate with its hooves, then bit the rope that was tied around trees and pillars, unlocking it, and then led its liberated kind towards Xiao Family Village. When those people discovered this, they quickly chased after them, and then we ran into them.”<br/><br/>Officer Liu and his colleagues, “…” Did they enter a fairy tale world or a fantasy world? Why do these words seem so unbelievable?<br/><br/>Are there really people who can communicate with animals?<br/><br/>And are the communications so smooth?<br/><br/>“Ahem…” Officer Liu turned a straight face, and asked Li Yuanming’s group, “Was it Cow King that opened the cowpen gate and untied the ropes?”<br/><br/>Li Yuanming said with despair, “Yes, we didn’t expect this cow to be so cunning. After we caught it, we made sure several times that it hadn’t roused from the anesthesia, and then straightaway locked it in the cowpen. To our surprise, as soon as we turned our backs, it opened the door, released the rope, and ran away with all our cows.”<br/><br/>Officer Liu and his colleagues, .<br/><br/>Cow King really is intelligent. No wonder it is called the Cow King by the villagers of Xiao Family Village.<br/><br/>Zhang San said, “What’s even more infuriating is the direction in which it led the cows to escape – was exactly where we caught it from.”<br/><br/>Anyway, they have been captured, and sooner or later they will have to confess.<br/><br/>Officer Liu and his colleagues, ‘<br/><br/>Then, Officer Liu started laughing, “Hehe, it looks like Cow King has really performed a great deed. Without it, who knows when you guys would have been caught? Recently, we received several reports stating that their cows had gone missing. Was it you guys who did it?”<br/><br/>Li Yuanming and his cohorts were scared into silence immediately-<br/><br/>Their group had stolen so many cows that they had no idea if it was their doing or not.<br/><br/>Since they were silent-<br/><br/>Officer Liu immediately shouted, “Alright, come back with us to the Yamen office. Once there, you will have to confess cleanly. Leniency for those who confess, severity against those who resist. Seek lenient treatment, understand?”<br/><br/>Li Yuanming and his people weakly responded, “We understand!”<br/><br/>Over a dozen people, never captured by humans, were brought down by a single cow. It would be a joke if this got out-<br/><br/>But since it was a joke, they were also captured-<br/><br/>Therefore, Officer Liu and his colleagues escorted Li Yuanming’s group to the Yamen office. But there weren’t many people from their office who arrived here, so to prevent accidents, Officer Liu asked a dozen strong young men from Xiao Family Village to accompany and escort them.<br/><br/>Xiao Jinli, Xiao Siqian, and Xiao Chunfu, as the parties involved in this incident, had to go along to make a record as well.<br/><br/>However, Xiao Jinli and the others hadn’t eaten dinner yet, so Officer Liu let them eat their dinner first and then come over- the sooner this matter was handled, the better.<br/><br/>As for the herd of cows, well, they could only be kept temporarily with Cow King in Xiao Family Village. Once the owners were found, they would be returned one by one.<br/><br/>Xiao Siqian was clearly extremely excited.<br/><br/>Living in the countryside was indeed quite interesting.<br/><br/>Even coming across such a bizarre event as a cow rescuing cows was so flavorful.<br/><br/>However, the entire incident made him increasingly curious about Xiao Jinli. Xiao Jinli was like a treasure, the more you dig, the more surprises she brings..\t\t\t\t\t\t</div>", "images": {}, "success": true}