{"id": 43, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14107267.html", "title": "Chapter 43 - Chapter 43: Chapter 43: The Cattle Thief Is Captured", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 43 - Chapter 43: Chapter 43: The Cattle Thief Is Captured</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 43: Chapter 43: The Cattle Thief is Captured<br/><br/>Translator: 549690339<br/><br/>Xiao Jinli, a child, performs an over-the-shoulder throw on a grown man, not only surprising Xiao Siqian but also shocking everyone else, like Zhang San and Li Si.<br/><br/>They never expected that among them, the child they believed was least threatening, could actually throw over a grown man.<br/><br/>Xiao Siqian was equally astonished.<br/><br/>He had already heard that Xiao Jinli was strong, but he had never expected that Jinli’s strength would be this great.<br/><br/>The strength required for an over-the-shoulder throw was surely much greater than carrying someone on one’s back.<br/><br/>However, Xiao Siqian, after a moment of surprise, quickly returned to his senses.<br/><br/>He approached Xiao Jinli, checking her condition, and asked with great concern, “Little Sister Jinli, are you okay? Did you twist your arm or hurt your hand?”<br/><br/>The strength of an over-the-shoulder throw primarily comes from one’s arms.<br/><br/>Xiao Jinli shook her head and said, “I’m fine. The priority now is to tie up these five guys so they won’t try to play any tricks.”<br/><br/>Xiao Chunfu promptly grasped the situation and instructed Xiao Siqian, “Xiao Quan, you keep an eye on them, I’ll go find some rattan.”<br/><br/>With Xiao Siqian’s martial ability, it would be very difficult for these people to run away.<br/><br/>Li Yuanming had never expected that he would not only be humiliated but also face the risk of imprisonment. His heart was filled with both anger and frustration, along with a deep sense of humiliation.<br/><br/>What made him even more anxious was how he and his men were going to escape this predicament.<br/><br/>Li Yuanming, lying on the ground, was continuously turning his eyes, thinking of a way out.<br/><br/>Just then, the cell phone in Zhang San’s pocket rang.<br/><br/>The sound seemed to offer them some hope, and their eyes lit up.<br/><br/>Xiao Jinli’s eyes sparkled.<br/><br/>Xiao Siqian was about to stop the cell phone, but Xiao Jinli immediately held him back, gently shaking her head.<br/><br/>Xiao Siqian slightly frowned but refrained from making any move.<br/><br/>Ignoring his own pain, Zhang San immediately shouted, “Little Wang, we’ve been stopped. You guys bring weapons and come here quickly. Okay, hurry up!” After saying this, he took a deep breath.<br/><br/>As long as they could hold out until their comrades arrived, they would have<br/><br/>the upper hand.<br/><br/>But just as he was catching his breath,<br/><br/>Xiao Jinli sneered and said, “Oh, you’ve got reinforcements. But have you forgotten that our Xiao Family Village’s people are also on the way? Aren’t you afraid that your comrades will be caught as soon as they arrive?”<br/><br/>The moment her words fell, the expressions on Li Yuanming and his men’s faces froze.<br/><br/>That’s right, they’d called for backup, but according to the trio, the Xiao Family Village was also getting reinforcements.<br/><br/>Now it depended on whether their comrades or the villagers of Xiao Family Village would arrive first.<br/><br/>Feeling anxious, they regretted underestimating the trio earlier.<br/><br/>If from the beginning, they had not wasted words and had directly used the anesthetic gun on the trio, they might not only have taken down the three, but also effortlessly stolen the Cow King.<br/><br/>But it’s too late for that now.<br/><br/>While Xiao Siqian was protecting Xiao Jinli, so she wouldn’t be captured again, his sharp eyes were vigilantly sweeping over the five men, tightly observing their every move.<br/><br/>About ten minutes later, occasional voices could be heard from the top of the mountain.<br/><br/>“This should be the place, right? Around Niu Xinshan in Shibei Village. Xiao Chunfu, where are you?”<br/><br/>A villager suddenly shouted, while the lights from over a dozen flashlights swept around.<br/><br/>Upon hearing the villager’s shouts, Xiao Chunfu promptly responded, “We are at the foot of the mountain, hurry over. We’ve caught five cattle thieves. They are now tied up.”<br/><br/>With the help of martial arts expert Xiao Siqian, Xiao Chunfu and his comrades effortlessly tied up the five men.<br/><br/>Upon hearing that Xiao Chunfu and his two companions had captured five cattle thieves, some of the younger and stronger villagers immediately quickened their pace to come down and check the situation, especially since Xiao Jinli was part of the group that came to catch the Cow King with Xiao<br/><br/>Chunfu.<br/><br/>They hoped that nothing would happen to her.<br/><br/>After all, there were five adversaries against their three.<br/><br/>Even if Xiao Jinli was strong, whether she could fight or not was still uncertain.<br/><br/>After a short while, the group of younger villagers arrived at the scene.<br/><br/>They first used their flashlights to scan the surroundings before looking at Xiao Jinli.<br/><br/>Xiao Qingshan asked with concern, “Jinli, are you okay?”<br/><br/>Xiao Jinli, with a smile, shook her head and replied, “Brother Qing Shan, I’m fine. don’t worry!”<br/><br/>Xiao Qingshan grinningly remarked, “Hehe, as long as you’re okay.”<br/><br/>He then turned his fierce gaze onto Li Yuanming and his men, asking, “Are these the cattle thieves?”<br/><br/>Xiao Chunfu nodded and said, “Yes, it’s them. They even had anesthetic guns. If Xiao Quan wasn’t so skilled and quickly took them down, it would probably have been difficult to capture them.”<br/><br/>Having said this, he took out the anesthetic gun to show everyone, saying, “If I didn’t know better, I’d have thought it was a real gun.”<br/><br/>All the villagers were eager to have a look, but Xiao Jinli, with a serious little face, said, “This is not something to play with. We need to hand it over to the policing officer when they arrive.”<br/><br/>Xiao Jinli said this to prevent the villagers from accidentally firing the anesthetic needle out of curiosity.<br/><br/>Hearing what Xiao Jinli said, everyone immediately curbed their curiosity and didn’t insist on seeing it anymore.<br/><br/>Xiao Siqian,<br/><br/>He had a feeling that Xiao Jinli had a high reputation in Xiao Family Village.<br/><br/>Was it just his imagination?<br/><br/>Xiao Jinli went on to say, “These cattle thieves have accomplices, we don’t know how many there are. They’ll be here soon. But since they’re a group, let’s capture all of them at once. Have the policing officers arrived?”<br/><br/>“Not yet, it will probably be awhile longer,” someone answered.<br/><br/>“They’re not here yet?” Xiao Jinli slightly frowned and said, “We don’t know how many accomplices they have, and they probably will be armed. If they get here first, I’m afraid we’ll have to fight!”<br/><br/>If the policing officers arrive, it will be difficult to start a fight.<br/><br/>If the policing officers don’t arrive, their gang will surely try to take their comrades away first, otherwise, they would face imprisonment.<br/><br/>Hearing what Xiao Jinli had said, Xiao Qingshan immediately said, “No matter how many of them there are, I’m going to call over all the young and able-bodied men from Xiao Family Village, and bring weapons. Hmph, this is our territory, whether dragon or tiger, they’ll have to cower.”<br/><br/>After stating that, Xiao Qingshan made a phone call, “Dad, you need to gather all the young and robust men in the village to the foot of Niuxin Mountain in Shibei Village. Xiao Jinli and her group have caught some cattle thieves who have accomplices; we don’t know how many there are. So, the more people we have on our side, the better. Okay, understood. Of course, we’ll always prioritize protecting Xiao Jinli. We can get hurt, but Xiao Jinli must remain unharmed, you can rest assured.”<br/><br/>Xiao Siqian,<br/><br/>Every person in the village was particularly concerned about Xiao Jinli.<br/><br/>The attitude of the village toward Xiao Jinli made him increasingly curious..\t\t\t\t\t\t</div>", "images": {}, "success": true}