{"id": 44, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14107273.html", "title": "Chapter 44 - Chapter 44: Chapter 44: Bringing The Accomplice Over", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 44 - Chapter 44: Chapter 44: Bringing The Accomplice Over</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 44: Chapter 44: Bringing the Accomplice Over<br/><br/>Translator: 549690339<br/><br/>Li Yuanming and the others looked at the villagers from Xiao Family Village who had arrived earlier, their expressions extremely ugly.<br/><br/>They had never stumbled so bad in all these years.<br/><br/>As thieves who stole dogs and cattle, their actions were quite dangerous, and if caught, they could be beaten half to death.<br/><br/>Over the years, they had made mistakes but managed to escape safely because they acted as a group and ran fast. But now…<br/><br/>Suddenly, Zhang San’s cellphone rang.<br/><br/>With his hands and feet tied, he couldn’t answer the phone, of course.<br/><br/>Xiao Jinli directly took the phone from his pocket, looked at the caller ID, and it was Wang Gouzi.<br/><br/>Xiao Jinli’s eyes flickered, and then, to everyone’s surprise, she anxiously said, “Little Wang, have you arrived? Where are you? Oh, you’ve reached the entrance of Shibei Village. How many people did you call? Did you bring weapons? Ten people have arrived? Alright, alright, I got it. Hurry up and intercept those people from our village who have also called others to come over.<br/><br/>If you don’t hurry up, when they have more people, we’ll be at a disadvantage. Right now, there are only three of them, including an old man and a child, and just one young man with good skills, which is why we were caught. Hurry up, they’re in Shibei Village, at the foot of the mountain called Niuxin Mountain.”<br/><br/>After saying that, she hung up the phone.<br/><br/>Li Yuanming and the others were dumbfounded.<br/><br/>This child, her voice sounded exactly like Zhang San’s.<br/><br/>How did she imitate it? Her childlike, tender voice could actually imitate that rough, mature voice.<br/><br/>However, the seemingly plain words she said shocked all five of them.<br/><br/>She was really trying to lure their accomplices into a trap and catch them all in one swoop.<br/><br/>At this moment, they desperately hoped that their accomplices would come to rescue them, but they also feared that their accomplices would step right into the same trap.<br/><br/>Xiao Siqian’s expression initially froze when he saw Xiao Jinli’s move, but then his eyes shone with the brilliance of finding a treasure.<br/><br/>The more he got to know this child, the more surprises he found.<br/><br/>However, looking at the villagers’ unconcerned expressions, he felt like he was overreacting.<br/><br/>After hanging up the phone, Xiao Jinli began to talk to the villagers, “Considering the distance from Shibei Village to here, their accomplices will arrive in at least fifteen minutes. Before they arrive, we absolutely can’t let them discover anything suspicious or make them want to escape.” Xiao Qingshan nodded and asked, “So, Jinli, what should we do?”<br/><br/>Xiao Siqian,<br/><br/>Why was everyone treating Xiao Jinli’s words as the main idea?<br/><br/>Xiao Jinli continued, “First, you can only keep three flashlights in your hands, and the rest will be replaced by the light from five cellphones.”<br/><br/>Xiao Qingshan’s eyes suddenly lit up, and he said excitedly, “You mean, these eight lights will be equivalent to the eight people on both sides.”<br/><br/>Xiao Jinli nodded, “As locals, we are very familiar with this terrain. As for the remaining people, they will be hiding on the side and will only reveal themselves after their accomplices have arrived.”<br/><br/>“Alright!” Xiao Qingshan agreed.<br/><br/>Then, Xiao Qingshan discussed with the villagers, leaving five people to act as the thieves and hiding the rest.<br/><br/>Of course, the people left behind were the strong young men.<br/><br/>After making the arrangements, Xiao Qingshan looked at Xiao Jinli with some hesitation and asked, “Jinli, why don’t you hide too? Just in case the people who come have very dangerous weapons and might hurt you.”<br/><br/>Xiao Jinli shook her head, “No need, Brother Little Quan will protect me, right, Brother Little Quan?”<br/><br/>Xiao Siqian was slightly startled, then smiled and replied, “Yes, I will protect you.”<br/><br/>Xiao Qingshan, who had not seen Xiao Siqian’s strength, looked doubtful.<br/><br/>Xiao Chunfu then said, “Qingshan, don’t worry. Little Quan is very powerful. He knocked down these five people in just a few moves.”<br/><br/>Xiao Qingshan nodded, “Alright, if that’s the case, let’s proceed.”<br/><br/>After a while, everyone concealed their figures, waiting for the arrival of the other party.<br/><br/>About ten minutes later, sounds came from the other side.<br/><br/>“There’s light over there, it should be there.”<br/><br/>In two or three minutes, a group of people arrived.<br/><br/>There were quite a few of them, about twenty people, more than ten were from Shibei Village and seemed to have come to watch the excitement.<br/><br/>It was now around seven or eight o’clock, and most people had already had dinner and were resting while watching television.<br/><br/>However, some people heard the commotion outside and felt that something might happen, so they followed these people.<br/><br/>After all, when outsiders suddenly came to Shibei Village with so many people, what if they were here to steal children or do something bad?<br/><br/>They just didn’t expect that following them would lead to the foot of Niuxin Mountain, which bordered the Xiao Family Village.<br/><br/>The people from Shibei Village asked doubtfully, “What’s going on? Who are these people, and why are they here?”<br/><br/>“Let’s stay farther away. These people don’t look like good guys. They’re carrying iron rods and sharp knives.”<br/><br/>“This looks like the gang fights you see on television.”<br/><br/>“Should we call the police?”<br/><br/>“Let’s not call the police yet, and let’s not cause trouble. Let’s see the situation first.’<br/><br/>“Brother Wang, where are Brother Ming and Brother San?” asked one of Wang Gouzi’s people.<br/><br/>Wang Gouzi replied, “Third brother said they are at the foot of Niuxin Mountain in Shibei Village. I asked around, and they should be just up ahead.” Soon, they arrived at the place Zhang San had mentioned.<br/><br/>They shone their flashlights towards the front and immediately noticed five people tied on the ground, their mouths stuffed with cloth.<br/><br/>And the five people using their cellphones as lights hid nearby when Wang Gouzi and the others approached them.<br/><br/>Then they noticed three people standing beside them: a middle-aged man in his forties, a young man of eighteen or nineteen, and another young man.<br/><br/>At this moment, the three of them seemed very relaxed and waiting calmly for their arrival.<br/><br/>Wang Gouzi’s pupils couldn’t help but contract.<br/><br/>Wang Gouzi and the people he brought with him couldn’t help but shout, “Brother Ming! Brother San!”<br/><br/>Immediately after, they rushed forward.<br/><br/>One of them angrily asked, “So it’s you three who tied up Brother Ming and the others.”<br/><br/>Xiao Chunfu glared and shouted, “So you are their accomplices who were called?”<br/><br/>“So what if we are? If you know what’s good for you, let those five go immediately, or else don’t blame us for being rude.”<br/><br/>“Yes, we don’t know what tricks you used to capture Brother Ming and the others, but there are so many of us and we all have weapons. Are we still afraid of you? If you know what’s good for you, release them now.”<br/><br/>Xiao Chunfu sneered, “Haha, I’d like to see just how rude you’re going to be!”<br/><br/>Wang Gouzi’s face showed a ferocious expression, and he said viciously, “Old man, since you’re not taking our warning seriously, don’t blame us for being rude.. Brothers, let’s go!”\t\t\t\t\t\t</div>", "images": {}, "success": true}