{"id": 55, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231915.html", "title": "Chapter 55 - Chapter 55: Chapter 55: Digging A Pond In The Countryside (First Update) (Happy New Year’S Eve!)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 55 - Chapter 55: Chapter 55: Digging A Pond In The Countryside (First Update) (Happy New Year’S Eve!)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 55: Chapter 55: Digging a Pond in the Countryside (First Update) (Happy New Year’s Eve!)<br/><br/>Translator: 549690339<br/><br/>On Saturday and Sunday, Xiao Jinli doesn’t need to go to school.<br/><br/>Many times, Xiao Jinli would go to the fields with her family.<br/><br/>Xiao Wanshan and his son don’t need to go to work on Saturdays and Sundays, so they are idle, and there are two acres of land at home that need to be taken care of.<br/><br/>In the paddy field, one acre and five of rice is grown, along with six parts of peanuts, all of which are grown for their own consumption. Therefore, they usually don’t use pesticides whenever possible, and plant according to the green management methods.<br/><br/>On dry land, they grow some vegetables, sweet potatoes, taro, and other common crops in the countryside.<br/><br/>In May and June, many crops begin to be harvested.<br/><br/>“Jinli, Uncle Da Chun’s pond will be opened tomorrow morning for fishing. Do you want to go and have a look?” Xiao Wanshan asked Xiao Jinli during dinner.<br/><br/>Xiao Siqian asked, “What is opening the pond?”<br/><br/>Xiao Wanshan explained with a smile, “It’s our local countryside saying. It means draining the pond to catch fish. Many children like to watch the process. They go into the pond to pick snails, catch soft-shelled turtles, loach, and crabs. These can all be taken back home.”<br/><br/>Actually, this is also a kind of fun for rural children.<br/><br/>Upon hearing this, Xiao Siqian’s eyes lit up instantly, and he asked excitedly,<br/><br/>“This must be so much fun!”<br/><br/>Xiao Junxuan immediately said, “Yes, it’s very interesting. Sometimes when we hear that someone’s pond is being opened, we would get up early and wait by the edge of the pond. Once the water is drained, we go down!”<br/><br/>Xiao’s mother laughed and said, “You still say so. It’s okay when the weather is warm in summer, but in winter, you would also follow the crowd and get your clothes all wet. A couple of times, you even caught a cold.”<br/><br/>Xiao Junxuan said, “Isn’t it normal to catch a cold once in winter?”<br/><br/>“You still have the nerve to say that, you scared your father and me half to death one night when you had a high fever.” Xiao’s mother said unhappily.<br/><br/>Xiao Junxuan defended, “That was all before I turned ten. After I turned ten, I rarely caught colds. Hm, seems like I haven’t caught a single cold since I turned<br/><br/>ten. ”<br/><br/>Xiao Jinli was eating the rice in her bowl and her eyes rolled:<br/><br/>That’s because before her brother was ten, she hadn’t been born yet.<br/><br/>After she was born, her family’s physical fitness had become better and better, especially for Xiao Junxuan, who was still in his growth period since Lingquan water was even more effective.<br/><br/>No wonder, Xiao Junxuan, who had a great physique, hadn’t caught a cold in more than ten years since he turned twenty.<br/><br/>Not to mention Xiao Junxuan, even Xiao Wanshan and his wife’s health had become better and better, and they hadn’t been seriously ill either.<br/><br/>In the family, the only one who had been sick in recent years was Xiao Jinli.<br/><br/>Of course, the reason for her illness was that she had used her psychic powers excessively twice, leaving her exhausted for several days.<br/><br/>But even during those few days of exhaustion, everyone at home was worried sick.<br/><br/>Thankfully, Xiao Jinli became lively again after three or four days, and the family finally relaxed.<br/><br/>Of course, the family didn’t know the reasons for this.<br/><br/>Xiao Jinli picked up a piece of braised pork and asked, “Dad, what time is Uncle<br/><br/>Da Chun opening the pond tomorrow?”<br/><br/>Xiao Wanshan said, “His fish are pre-ordered by the hotel, so he doesn’t have to go to the open market town to sell them. He’s scheduled to start at 5:30. Mainly because the weather is hot now, it’s better to open the pond early when it’s not so hot and annoying.” 5:30 is already an early time.<br/><br/>Even in winter, if you want to sell the fish in the open market town, you need to open the pond around 4 or 5 0’clock.<br/><br/>Because it takes time, they have to be at the open market town by 6 or 7 o’clock.<br/><br/>Xiao Jinli nodded and said, “Hmm, we can go there at 7 or 8 0’clock, it’s fine. Dad, are you going to help?”<br/><br/>Xiao Wanshan nodded and said, “Yes, Uncle Da Chun asked me to help.”<br/><br/>Xiao’s mother said, “Then tell Da Chun to leave some fish for us, grass carp, bighead carp, and carp, all of them. Leave more if you can. Xiao Bao loves eating fish, and the fish from his house are all grass-fed, so they are less fishy and taste better. Older Brother, remember to clean the fish pond tomorrow morning and put the fish in.”<br/><br/>Xiao Junxuan nodded and said, “Okay, Mom, I know!”<br/><br/>At 5 0’clock in the morning, Xiao Jinli got up on time to go for a run and exercise.<br/><br/>After learning about Xiao Jinli’s good habit, Xiao Siqian also started getting up at the same time.<br/><br/>As the sky began to brighten, Xiao Siqian stepped out of his room and met Xiao<br/><br/>Jinli face-to-face.<br/><br/>Xiao Jinli wore casual clothes while exercising.<br/><br/>“Good morning, sister!”<br/><br/>Xiao Jinli nodded and said, “Good morning, Brother Xiao Quan!”<br/><br/>Then, the two went downstairs together to wash and clean themselves.<br/><br/>After they were done, they began jogging towards the rear mountain. At the foot of the rear mountain, there was a small path that encircled the small hill.<br/><br/>However, don’t underestimate this path; it was two miles long.<br/><br/>Every day, Xiao Jinli would run around this path for twenty circles, or twenty kilometers, with ease.<br/><br/>When Xiao Siqian learned about the distance Xiao Jinli ran, he was incredulous.<br/><br/>Twenty kilometers, that’s twenty thousand meters.<br/><br/>Twenty kilometers, unless one has special training, would be very difficult for ordinary people to complete and persist in.<br/><br/>Even he couldn’t keep up.<br/><br/>In the past, he could run a maximum of ten kilometers, which was already praised by many.<br/><br/>Now, he could only persist in running ten kilometers. However, in order to catch up with Xiao Jinli, he increased the distance he ran each day by a little more than the day before.<br/><br/>How could a child run twenty thousand meters every day? How did she keep it<br/><br/>Moreover, judging by her posture when running, she still seemed relaxed and at ease after running twenty kilometers.<br/><br/>Xiao Siqian wondered if this was the reason for Xiao Jinli’s strength.<br/><br/>After running ten kilometers, Xiao Siqian began doing calisthenics by the side of the road.<br/><br/>It had to be said, the air in the countryside was indeed great.<br/><br/>Inhaling the fresh air of the early morning, his whole body felt relaxed, and each pore exhaled carbon dioxide while inhaling fresh oxygen.<br/><br/>During his time recuperating at Xiao Family, he had a clear feeling that his physical fitness was improving by the day.<br/><br/>In addition to exercising, he attributed this to the fact that this place was nourishing for a person.<br/><br/>About half an hour later, Xiao Jinli had finished her run.<br/><br/>Xiao Jinli wore casual clothes, her long hair tied in a ponytail, and the sweat on her forehead had dampened her delicate fringe, sticking them to her forehead. After stopping, Xiao Jinli took the towel from her neck and wiped the sweat from her face and forehead.<br/><br/>Xiao Siqian felt that the little girl seemed more and more energetic.<br/><br/>Xiao Siqian asked, “Sister, shall we go home now?”<br/><br/>Xiao Jinli nodded and said, “Yeah, let’s go home!”<br/><br/>It was now half-past six.<br/><br/>As the two walked past the rice fields, they heard a group of children exclaiming excitedly.<br/><br/>“Wow, that fish is so big!” “Yeah, it’s so huge. What does it eat to grow so big?”<br/><br/>“Duh, of course it eats grass.”<br/><br/>“But the other fish also eat grass, and they’re not this big! Does it eat small fish? Doesn’t the book say that big fish eat small fish?”<br/><br/>The children’s chatter was so adorable!\t\t\t\t\t\t</div>", "images": {}, "success": true}