{"id": 50, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14110130.html", "title": "Chapter 50 - Chapter 50: Chapter 50: The Strange Uncle Who Deceived The Little Girl", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 50 - Chapter 50: Chapter 50: The Strange Uncle Who Deceived The Little Girl</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 50: Chapter 50: The Strange Uncle Who Deceived the Little Girl<br/><br/>Translator: 549690339<br/><br/>After sending the three children to the examination room, Principal Chen waited nervously.<br/><br/>The exam time was 2.5 hours, from 9 am to 11:30 am.<br/><br/>However, he didn’t wait outside the examination room all the time, instead, he went to a friend’s tea shop for some tea.<br/><br/>Seeing his arrival, Principal Chen’s close friend, Zhou Cheng, teased, “You’re a busy man, what brings you here today? This is a rare occasion!”<br/><br/>Principal Chen laughed and replied, “I brought a few students here for an exam today!”<br/><br/>Zhou Cheng curiously asked, “Exam? What kind of exam would require the principal himself to lead the team? Aren’t other teachers responsible for those previous exams and competitions?”<br/><br/>Of course, Principal Chen couldn’t tell him the truth, so he said, “Well, all the other teachers are occupied, so I’m the one who brought the kids to take the test.”<br/><br/>Zhou Cheng nodded and said, “Enough talking, let’s have some tea. How long will the kids take for the exam?”<br/><br/>“2.5 hours!” Principal Chen replied, “From 9 am to 11:30 am. I have to pick them up at 11 am. After all, these kids are young and might be scared in this unfamiliar place.”<br/><br/>Actually, what he was more afraid of was Xiao Jinli running around with the other two students.<br/><br/>So, it’s better to go to the exam room early to catch them.<br/><br/>Suddenly, he thought of something and immediately put down his teacup. “Ah Cheng, I’m sorry, I just remembered something important I need to do. I’ll be back later!”<br/><br/>Then, without waiting for Zhou Cheng’s reaction, he hurriedly left.<br/><br/>When he left, he deliberately checked the time. The exam started at 9 am, and it was now 9:15 am. He hoped the girl hadn’t left the examination room yet.<br/><br/>Otherwise, it would be difficult for him to find her as a young girl running around in this county town without a cellphone.<br/><br/>Principal Chen hurried to County First Primary School, and as soon as he arrived at the school gate, he bumped into Xiao Jinli, who was just about to leave.<br/><br/>He knew it would be like this! Just as he suspected!<br/><br/>Principal Chen’s face was full of black lines.<br/><br/>After a moment, he put on a friendly smile and asked, “Xiao Jinli, have you finished the exam so quickly?”<br/><br/>Xiao Jinli nodded and said, “Yeah, after finishing those questions, sitting there was somewhat boring. If I fell asleep in the exam room, the invigilating teacher would keep casting glances at me, which would be quite uncomfortable. So, I just handed in my paper and left.”<br/><br/>Upon hearing this, Principal Chen urgently asked, “Do you think the questions were difficult?”<br/><br/>Xiao Jinli really wanted to roll her eyes at him. She said, “Principal Chen, what kind of question is that? If the questions were difficult, would I have handed in the paper without finishing them? Since I promised to do this for you, I’ll do it well. Otherwise, I wouldn’t have agreed.”<br/><br/>Having heard Xiao Jinli’s words, Principal Chen was so excited that he didn’t know how to express his emotions.<br/><br/>He nodded and said, “Good, good, that’s great! Although I don’t want to put pressure on you, I still hope you can win the big prize for me!”<br/><br/>Thinking about the exam paper he gave her the day before yesterday, she finished it in twenty minutes and got all the questions right.<br/><br/>He already knew that Xiao Jinli was hiding her talent, but he didn’t expect her to give him such a big surprise.<br/><br/>In the past, he hoped Xiao Jinli could bring back a prize.<br/><br/>Now, he further hoped that Xiao Jinli could bring back a big prize.<br/><br/>Once Principal Chen had calmed down, he asked, “Where do you plan to go now? It’s only been half an hour since the exam started, and Li Xiaohua and Lan Dahai won’t be out until 11:30 am. If we’re going to the amusement park, we might have to wait until the afternoon.”<br/><br/>Xiao Jinli thought for a moment and said, “I want to go to the National<br/><br/>Bookstore to look at some books!”<br/><br/>“Ah, the bookstore?” Principal Chen asked with a slightly surprised expression, “Do you still like reading? I thought you only liked sleeping? Otherwise, why would you always sleep in class?”<br/><br/>Xiao Jinli chuckled and said, “Principal Chen, I don’t actually like sleeping, it’s just that I understand everything the teachers teach in class, so I don’t need to spend that time listening to them.”<br/><br/>Of course, she also didn’t deny that she liked sleeping.<br/><br/>Hearing this explanation, Principal Chen suddenly understood.<br/><br/>He also found it rather amusing and said, “So, that’s what it is. But since your grades have always been average, you’ve been misunderstood by the teachers. Actually, it’s your fault, not your classmates’ or teachers’. If you’re capable of getting good grades, why would you purposely make them average? Isn’t it better to be top-notch? Every day, you could be praised by the school and envied by your classmates. Others want to get top grades and work hard for it, but you, on the other hand, take it easy. You’re not like a primary school student at all.”<br/><br/>Xiao Jinli bluntly said, “Getting good grades is annoying and troublesome! I also don’t like being constantly watched like a monkey!”<br/><br/>Xiao Jinli didn’t hold back her feelings in front of Principal Chen.<br/><br/>After listening, Principal Chen looked somewhat stunned.<br/><br/>It turned out that Xiao Jinli didn’t want to get good grades for this reason.<br/><br/>She actually found getting good grades to be troublesome.<br/><br/>Once Principal Chen had recovered, he found it both funny and helpless.<br/><br/>It’s like discovering a treasure but not being able to dig it up, for fear that the treasure would be destroyed once you started digging.<br/><br/>That’s how he felt right now.<br/><br/>Principal Chen thought for a moment before saying, “Oh, so that’s how it is!” Hearing Principal Chen’s calm tone, Xiao Jinli was slightly surprised.<br/><br/>She raised her eyebrows, smiled, and asked, “Principal Chen, aren’t you going to persuade me to get better grades?”<br/><br/>Principal Chen laughed and said, “I do want to persuade you. But are you the type to listen? If you were, we would have talked to you earlier, but you never took it seriously. Instead of wasting our breath, it’s better to let you be free.”<br/><br/>At this point, he asked curiously, “You’re in fourth grade now. When it’s time for high school, there will be good schools, and the average ones too; they’re all based on grades. What’s your plan for this?”<br/><br/>Xiao Jinli tilted her little head and said without hesitation, “For me, it doesn’t matter which school I go to. As long as it’s close to home, it’s fine!”<br/><br/>According to her family’s expectations, she would definitely be able to attend high school.<br/><br/>There are high schools in only the county town.<br/><br/>By the time she’s in high school, her family will definitely buy a house there.<br/><br/>She added, “Haha, I’m still in elementary school now, and there are three more years until junior high. As for high school, there’s still plenty of time. We’ll talk about it later.”<br/><br/>Principal Chen’s eyes darted around, and he said with a smile, “Xiao Jinli, let’s make a deal, shall we?”<br/><br/>Seeing Principal Chen’s fox-like smile, Xiao Jinli’s hackles rose, and her expression became guarded. She said, “Principal Chen, just say what you need to say. This creepy uncle deceiving little girl’s attitude is scaring me.”<br/><br/>‘ Principal Chen went straight to the point: “Alright. Let’s cut to the chase. Can you directly crush everyone in the primary-to-junior high transition and win glory for the school just once more?”<br/><br/>Xiao Jinli, ‘<br/><br/>Indeed, he’s a creepy uncle who deceives little girls..\t\t\t\t\t\t</div>", "images": {}, "success": true}