{"id": 56, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231917.html", "title": "Chapter 56 - Chapter 56: Chapter 56: Catching Loach 1 (Second Update) (Happy New Year’ S Eve!)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 56 - Chapter 56: Chapter 56: Catching Loach 1 (Second Update) (Happy New Year’ S Eve!)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 56: Chapter 56: Catching Loach 1 (Second Update) (Happy New Year’ s Eve!)<br/><br/>Translator: 549690339<br/><br/>Xiao Siqian looked at the group of children surrounding the pond, feeling eager to join them.<br/><br/>He said to Xiao Jinli, “Little sister, let’s go take a look!”<br/><br/>Xiao Jinli raised her eyebrows and nodded slightly, “Alright then.”<br/><br/>It was summer, so it wasn’t cold anyway.<br/><br/>When they reached the pond, Xiao Siqian asked, “How big is this pond?”<br/><br/>Xiao Jinli replied, “It seems to be one and a half mu, which is quite large.”<br/><br/>Is it really? Xiao Siqian thought that this pond didn’t seem as big as the one in his home.<br/><br/>The pond at his house was half the size of this one and also had fish, but they were all very precious ornamental fish.<br/><br/>This pond was surrounded by weeds, and there was a frame built at one end, covered in pumpkin and melon vines, wrapping tightly around it. From a distance, it looked like a small house.<br/><br/>Water bamboo and lotuses were also planted in the pond.<br/><br/>However, Xiao Siqian recognized the lotus but not the water bamboo.<br/><br/>He asked directly, “What are those clumps that look like reeds? They look like reeds but their leaves are bigger and greener.”<br/><br/>Xiao Jinli replied, “That’s water bamboo!”<br/><br/>“Water bamboo? What is that?” Xiao Siqian asked curiously, “Can it be eaten?”<br/><br/>“Yes, water bamboo can be eaten.” Xiao Jinli nodded, “It can be eaten raw or cooked! When eaten raw, it’s tender and crisp; when cooked and stir-fried, especially with beef, it’s very delicious.”<br/><br/>When Xiao Siqian heard her explanation, his mouth watered, wanting to try it.<br/><br/>Xiao Jinli glanced at him and said with a smile, “It’s actually the perfect season to eat water bamboo. I can ask Uncle Da Chun to pick some for us later if you want.”<br/><br/>Xiao Siqian didn’t refuse.<br/><br/>The children were initially excited to see Xiao Jinli, but when they noticed the mud and dirt on their clothes, they dared not come closer.<br/><br/>Everyone in the village, young and old, knew that Xiao Jinli was especially fond of cleanliness.<br/><br/>She didn’t like those who were unhygienic.<br/><br/>Everyone wanted to be liked by Xiao Jinli, so if anyone wanted to see or play with her, they had to be clean from head to toe.<br/><br/>“Jinli!”<br/><br/>“Sister Jin Li!”<br/><br/>Older children called her Jinli, while younger ones called her Sister Jin Li.<br/><br/>“Sister Jin Li, what are you doing here? Are you here to catch fish too?” A seven or eight-year-old child asked.<br/><br/>Xiao Jinli nodded, “Yes, I’m here to catch loaches today. I want to eat Loach Tofu.<br/><br/>“Jinli wants to eat loaches? I’ll catch some for you later.”<br/><br/>“Sister Jin Li, I’ll catch loaches for you too!”<br/><br/>The children, big and small, competed with each other to catch loaches for Xiao Jinli.<br/><br/>Xiao Jinli raised her hand and said loudly, “Alright, once you catch them, I’ll buy them from you.”<br/><br/>After all, live loaches could be kept and eaten later.<br/><br/>“No need for money. We’ll catch them for you. If our parents find out we took your money, they’ll scold us when we go home.”<br/><br/>“Yeah, yeah, besides, we don’t even know if it’s easy to catch these loaches, or how many we can catch.”<br/><br/>“Don’t worry about being scolded by your parents, just say it was me, Xiao Jinli, who said it.”<br/><br/>“Oh, yeah!”<br/><br/>The children were overjoyed.<br/><br/>Xiao Jinli would buy their loaches, so they would have some pocket money in their hands.<br/><br/>With this little pocket money, they can buy spicy strips or other small snacks.<br/><br/>A group of adults, hearing the laughter of the children, suddenly found it amusing.<br/><br/>One adult said with amusement, “Haha, Jinli buying your loaches is just a disguised way of giving you some pocket money. But how much money you get depends on your ability and how many loaches you can catch.”<br/><br/>“Hehe, the atmosphere becomes so much more joyful when Jinli is here.”<br/><br/>At this moment, Xiao Da Chun said, “Jinli, you love eating fish. Just tell me how many and what kind of fish you want, and I’ll give them to you!”<br/><br/>Before Xiao Jinli could speak, Xiao Wanshan, who was helping to pour water, smiled and said, “No need to give them for free. Your fish are all grass-fed, just tell me how many you can sell to me. Of course, I don’t want to buy all the fish for myself, other people might want to buy some too, so make sure there’s enough!”<br/><br/>Xiao Da Chun said, “Don’t worry about that. The restaurant has reserved 200 grass carps weighing around three jin each, and carps over half a jin each, there’s still plenty left in the pond. I’ve raised more than a thousand fish in this pond.”<br/><br/>Xiao Wanshan laughed, “But those over a thousand fish were also pre-ordered by others. Fine, just give me ten grass carps, ten carps, and three bighead carps.”<br/><br/>These three types were all Xiao Jinli’s favorites.<br/><br/>Xiao Jinli liked to have grass carp fried in oil and then stir-fried with black bean chili sauce, braised carp, and bighead carp fish head soup. Xiao Da Chun smiled and said, “Alright, you can catch them later.”<br/><br/>Xiao Wanshan didn’t refuse.<br/><br/>Once the water in the pond was drained enough to expose the muddy bottom, they could start catching fish.<br/><br/>However, since Xiao Jinli wanted to eat Loach Tofu, they needed to drain the water a bit more so the loaches would be easier to find and catch.<br/><br/>After draining the water for a moment, the pond was left with a few small muddy pits with water, and they stopped draining.<br/><br/>At this point, Xiao Da Chun waved his hand and shouted, “Children, you can now come down and catch loaches. How much pocket money you get depends on how many loaches you catch. Remember, opportunities like this are rare!”<br/><br/>Upon hearing Xiao Da Chun’s words, the children were all excited, rolling up their pant legs and going into the pond one after another. Some didn’t even bother to roll up their pant legs and stepped directly into the mud.<br/><br/>Seeing this, the adults at home scolded with laughter, “You little rascals, you got your clothes so dirty, go and wash them yourself when you get home.”<br/><br/>Xiao Siqian saw the children go down to the pond and rolled up his pant legs to join them.<br/><br/>Xiao Jinli looked at him doubtfully and asked, “Little Quan Brother, do you know how to find loaches?”<br/><br/>Xiao Siqian, “…” He really didn’t know.<br/><br/>He just wanted to have some fun now.<br/><br/>Xiao Siqian watched the children in the pond excitedly groping for loaches, and said, “I’ll see how they catch them first, then learn from them.”<br/><br/>Xiao Jinli nodded and said, “Okay.”<br/><br/>In fact, um, she didn’t know how to catch loaches either.<br/><br/>However, she had seen others catch them before.<br/><br/>Before long, a child excitedly said, “I heard it, I caught one.”<br/><br/>“I caught one too.”<br/><br/>Everyone searched for loaches more enthusiastically. “Ah, this loach is so slippery. I caught it and it slipped away.”<br/><br/>“I… I found a turtle! It’s such a big turtle.”<br/><br/>“Really? Let me see!”<br/><br/>So a group of children ran to see the turtle.<br/><br/>“This turtle is so big, is it over a jin?”<br/><br/>“It should be.”<br/><br/>“Little Qiang, you hit the jackpot. This turtle is so expensive, can you sell it for over a hundred yuan?”<br/><br/>“I don’t know. I’ll go home and ask my dad.”<br/><br/>“Well, make sure to secure the turtle first, don’t let it get away. Otherwise, you’ll lose your money..”\t\t\t\t\t\t</div>", "images": {}, "success": true}