{"id": 51, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14110134.html", "title": "Chapter 51 - Chapter 51: Chapter 51: Rewards For The Grand Prize", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 51 - Chapter 51: Chapter 51: Rewards For The Grand Prize</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 51: Chapter 51: Rewards for the Grand Prize<br/><br/>Translator: 549690339<br/><br/>As Li Xiaohua and Lan Xiaohai excitedly ran out of the exam room, their eyes locked onto Principal Chen intently.<br/><br/>In the afternoon, Principal Chen decisively took them to the largest amusement park in the county to fulfill his promise.<br/><br/>He didn’t know whether Xiao Jinli liked to play or not, but the other two children were very enthusiastic. This could be considered their reward. This amusement park had carousels, trampolines, and slides…<br/><br/>These attractions didn’t interest Xiao Jinli in the slightest.<br/><br/>So, when the three of them went to the amusement park, she found a leisurely spot, sat down, and, yes, went to sleep!<br/><br/>Anyway, she would sleep wherever she went.<br/><br/>As for Li Xiaohua and Lan Dahai, they had already immersed themselves in the fun, bouncing, jumping, and running around—absolutely overjoyed.<br/><br/>The amusement park was an enclosed space, with only one entrance and exit, and nowhere else to go.<br/><br/>Outside, parents with children were waiting.<br/><br/>As for Principal Chen, who brought them there, he left after buying water for the three of them.<br/><br/>Of course, before leaving, he instructed Xiao Jinli to watch over the other two, and in case of any situation, have the reception call him. He had already left his phone number at the reception desk.<br/><br/>When Li Xiaohua and Lan Dahai noticed that Xiao Jinli hadn’t joined in the fun activities, they were puzzled.<br/><br/>The two leaned their heads together and whispered, “Strange, didn’t Xiao Jinli come in with us? Where’s she now? Should we go look for her? After all, she’s a girl; what if something happens?”<br/><br/>These little friends were really thoughtful and loving, huh.<br/><br/>“Well…Let’s go find her! Once we found her, we can ask her if she wants to play with us!”<br/><br/>“Okay, okay, let’s go find her!”<br/><br/>Then, the two little friends went to find Xiao Jinli.<br/><br/>However, they couldn’t find her even after searching the entire park. Finally, they found her sleeping on a corner on a soft toy cushion.<br/><br/>Li Xiaohua and Lan Dahai,<br/><br/>How could Xiao Jinli be so fond of sleeping? She would sleep anywhere, during class and at amusement parks too. “Should we wake her up?”<br/><br/>“Yeah, let’s do it!”<br/><br/>Sleeping with a book covering her face, Xiao Jinli suddenly spoke up, “You guys go and play. I won’t join you. I’ll wait for you here. When it’s 5:30, Principal<br/><br/>Chen will come to pick us up!”<br/><br/>Hearing Xiao Jinli’s voice, the two little friends nodded blankly, “Okay, okay. We’re going to play now. You… just keep sleeping here.”<br/><br/>Xiao Jinli, ‘<br/><br/>When the three of them returned from the county, Li Xiaohua and Lan Dahai excitedly recounted their adventures at the amusement park to their relatives, friends, and classmates.<br/><br/>Unexpectedly, this triggered great expectations among many of their peers. As a result, at the school-wide meeting, Principal Chen solemnly promised that the top ten students every semester would be taken to the amusement park for a visit.<br/><br/>If anyone ranked in any county-wide competition, they could go three times.<br/><br/>Principal Chen’s commitment greatly encouraged the whole school.<br/><br/>Children of this age were curious and fond of playing.<br/><br/>They too wanted to visit the county amusement park; after all, not everyone’s family had the means to go there.<br/><br/>The Math Olympiad results were out in a week.<br/><br/>When the whole school heard that Xiao Jinli had won the county’s special prize, everyone was in disbelief.<br/><br/>However, it brought tremendous honor and prestige to the school.<br/><br/>Many people were puzzled and doubtful.<br/><br/>Weren’t Xiao Jinli’s grades just average? When did her mathematical skills become so good that she won a special prize in her first competition in the county?<br/><br/>Perhaps the teachers knew that Xiao Jinli had been concealing her talents, but the children didn’t know.<br/><br/>They simply couldn’t believe that Xiao Jinli’s grades were that good.<br/><br/>However, whether they believed or not, it was a fact.<br/><br/>Principal Chen finally had something to gloat over.<br/><br/>This competition wasn’t a total failure for their school. Not only did they not come in last, they jumped straight to the top.<br/><br/>He certainly hadn’t misjudged Xiao Jinli.<br/><br/>In fact, when the results came out, his heart had been hanging, fearing that Xiao Jinli, just like at school, wouldn’t want to achieve good results due to her dislike of trouble.<br/><br/>Now that the results were out, he realized he had been worrying too much. Xiao Jinli kept her word. She promised him she’d get good results, and she did just that.<br/><br/>Haha, Principal Chen was walking on air these days.<br/><br/>Having such a talented student in the school, he attended meetings in the county with a beaming smile instead of his usual serious demeanor.<br/><br/>He also received praise from higher-ups and was instructed to cultivate this promising talent well.<br/><br/>He agreed verbally but pulled a long face afterward.<br/><br/>That child only agreed to participate in the competition and get good results because he had invited her parents and persuaded her with reason and emotion. And she had only agreed to do it once.<br/><br/>When Principal Chen called Xiao Jinli to his office, he said with a beaming face, “Ah, Xiao Jinli, I really didn’t misjudge you. Getting such good results brought so much honor and prestige to our school. This is the cash reward given by our higher-ups, 500 yuan.”<br/><br/>Having said that, he handed Xiao Jinli the 500 yuan in cash.<br/><br/>Seeing the cash, Xiao Jinli’s beautiful eyes shone.<br/><br/>As she took the money, she asked, “You get cash for winning the special prize? Principal, why didn’t you ever mention the reward was this?”<br/><br/>Principal Chen choked and replied irritably, “But you never asked either, did you?”<br/><br/>After saying that, he continued, “Not only does the county offer prizes, but our school does too.”<br/><br/>Xiao Jinli’s eyes lit up, “The school has prizes too? How much, another 500?”<br/><br/>Principal Chen said, “Two hundred, plus a few notebooks!”<br/><br/>Xiao Jinli immediately lost interest and lazily replied, “Oh, that’s all.”<br/><br/>Principal Chen got irritated and said, “That’s all? How much more do you want? Two hundred yuan is already quite a lot. The usual rewards for top students from the school are just a few notebooks or certificates.”<br/><br/>Xiao Jinli didn’t add anything, only calmly asked, “So, Principal, do you have any more questions? If not, I’m leaving.”<br/><br/>Principal Chen,<br/><br/>His heart more stuffed.<br/><br/>What did she mean by not bothering her in the future?<br/><br/>Was she the principal, or was he the principal? How could a student talk to their principal like that?<br/><br/>Of course, at this point, Principal Chen could only grin and bear it..\t\t\t\t\t\t</div>", "images": {}, "success": true}