{"id": 59, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231926.html", "title": "Chapter 59 - Chapter 59: Chapter 59: Harvesting Rice During Summer Vacation (Fifth Update) (Happy New Year’S Eve!)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 59 - Chapter 59: Chapter 59: Harvesting Rice During Summer Vacation (Fifth Update) (Happy New Year’S Eve!)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 59: Chapter 59: Harvesting Rice during Summer Vacation (Fifth Update) (Happy New Year’s Eve!)<br/><br/>Translator: 549690339<br/><br/>Chapter 59: Rice Harvesting During Summer Vacation (Fifth Update)<br/><br/>Time passed by leisurely.<br/><br/>Soon, Xiao Jinli’s summer vacation began.<br/><br/>For city kids, two months of vacation often meant attending various tuition and interest classes, which made the days go by quickly.<br/><br/>But for rural children, summer vacation meant they could play, but at the same time, it also meant they had to work.<br/><br/>Summer vacation also happened to be the busy farming season, when they needed to harvest watermelons, cut rice, transplant rice seedlings, pull peanuts, dig sweet potatoes, etc. All kinds of harvesting required a lot of manpower and time.<br/><br/>So, unless the child was overly pampered by their family, they usually had to help out in the field.<br/><br/>As for Xiao Jinli, well, she could be said to be very doted on by her family, but everyone in the family knew that although they doted on Xiao Jinli, she was actually a sensible and well-behaved child.<br/><br/>Their family didn’t grow many crops, like peanuts and sweet potatoes, so not much of it needed to be harvested. It could be finished quickly by the family working together, so Xiao Father didn’t ask her to join in.<br/><br/>However, when the whole family was busy working, and she was the only one idle, she felt pampered and loved by her family, but she also loved them. So, she wanted to participate in the family work, and even if it was tiring, it was still a happy experience.<br/><br/>Therefore, during every busy farming season, Xiao Jinli always participated without exception.<br/><br/>The Xiao Family doesn’t have much land, only a little over one mu of rice. When Xiao Father invited seven or eight people to cut the rice, it was done in just half a day, so Xiao Mother and Xiao Jinli didn’t participate in the rice harvesting.<br/><br/>Xiao Father and Brother Xiao had already prepared the area for drying the rice, and it was cleaned and ready. They were just waiting for the rice to be brought back so that it could be poured directly into the drying area.<br/><br/>Xiao Mother was cooking at home.<br/><br/>Although they invited people to help them with the work, they still provided a lunch meal, no matter if it was for a whole day or just half a day.<br/><br/>If people worked at someone else’s house and finished in half a day, most of<br/><br/>them would choose not to eat at the host’s house and instead return home to eat.<br/><br/>But when it came to eating at the Xiao Family’s house, no one would refuse. This was because Xiao Jinli’s mother was an excellent cook. Her cooking skills were well-praised in the entire village, and her meals were outstanding in terms of color, flavor, and taste.<br/><br/>Ordinarily, people wouldn’t dare to ask to eat at her house, but now that they had a chance, only a fool would refuse.<br/><br/>While Xiao’s Mother was cooking, Jinli was her assistant.<br/><br/>She didn’t inherit her mother’s talent for cooking. The food she made was either too salty or too bland, barely edible. Inedible dishes were either burnt or undercooked, and they simply couldn’t be eaten.<br/><br/>So, in terms of cooking skills, Xiao Jinli was clearly more like her father.<br/><br/>On the contrary, Xiao Junxuan must have inherited his mother’s cooking talent. Although the food he prepared couldn’t compare to his mother’s, it was quite good compared to others.<br/><br/>Today, the Xiao family was gathering rice.<br/><br/>The people they invited to help were all from Xiao Family Village.<br/><br/>At the break of dawn, Xiao Changchun and others who were invited to help gathered their tools and went to the fields.<br/><br/>The morning was cool and inviting for work.<br/><br/>The earlier they finished, the sooner they could go home.<br/><br/>With only a small piece of land and seven or eight people invited, the work could be done in a whole morning.<br/><br/>Now, when it comes to rice harvesting, manual labor is still more common, with small sickles used to cut the rice, and threshing machines for threshing. The straw, after removing the rice grains, is bundled up, mound by mound, waiting to be moved to a spacious open space to dry. Once dry, it is stacked into haystacks, and can be stored long-term to feed cattle.<br/><br/>Especially in winter, when everything is bleak and devoid of greenery, these rice straws are the main food source for cattle.<br/><br/>“Wanshan’s place has so little land, we’ll finish this work in no time. It’s still early, and I would feel embarrassed to have lunch at his house,” said Xiao Changchun as he stepped on the threshing machine, which hummed loudly but couldn’t drown out his booming voice.<br/><br/>“If you’re embarrassed, then don’t go. Anyway, no one would blame you,” a nearby villager immediately joked. “I, for one, am going. It’s rare to get an opportunity to eat a meal at their delicious table, and I won’t be shy.”<br/><br/>“I’m the same. Wanshan invites people on a rotational basis, and it’s a hard-earned chance to be invited this time. I won’t give up eating at his house.”<br/><br/>“Haha, speaking of which, Xiao Wanshan is really too polite. We’re just doing a bit of work, and he’s giving us wages. Instead, we should be satisfied with just a meal.”<br/><br/>“Actually, we don’t really even want his wage. I’d rather exchange it for a couple of meals at his house!”<br/><br/>“I think you can all stop dreaming. Do you not see how much Xiao Wanshan dotes on Xiaofang? He’s more than happy to cook for you all and treat you to a meal, but he wouldn’t let you take multiple free meals, lest it tires Xiaofang out. I’m afraid after that, he would rather pay wages than let you eat at his “Haha, you’re right. Since Xiao Wanshan usually dotes on his wife, he won’t let her get tired from cooking for more than ten people.”<br/><br/>Xiaofang was indeed lucky. She had been married to Wanshan for over twenty years, and he still cherished and pampered her like a child. If it weren’t for Xiaofang insisting on cooking for the family, Xiao Wanshan would probably have taken over the cooking. However, it is said that Xiaofang did not think highly of Xiao Wanshan’s cooking, which is why she insisted on doing it herself.<br/><br/>Actually, Xiao Wanshan began pursuing Xiaofang after tasting her cooking and becoming infatuated with it. He then launched an intense courtship. At first, Xiaofang’s parents did not agree, since Xiao Wanshan’s family was too poor. However, they couldn’t resist Wanshan’s persistent entreaties and eventually agreed to let their daughter marry him.”<br/><br/>“Haha, it’s true that love can change a person’s life. I used to think that if Xiao Wanshan hadn’t fallen in love with Xiaofang at first sight, he might have continued on a dark path.”<br/><br/>“That’s possible. Before meeting Xiaofang, Wanshan was quite a little gangster. Who would have thought he’d become a doting husband? But, Xiao Wanshan is good-looking, capable, and sincere. Otherwise, no matter how persistent he was, Xiaofang wouldn’t have taken notice of him.”<br/><br/>“Back then, Xiaofang was a great beauty in the ten miles and eight villages around, and there were plenty of boys chasing her. There were many wealthy, powerful, and handsome men who wanted her, but for some reason, she chose Xiao Wanshan. It angered her parents for a while.”<br/><br/>“At least the two of them were both attractive, and they fell in love. If not,<br/><br/>Xiaofang’s parents would have been even more upset.”<br/><br/>Haha…”<br/><br/>Xiao Wanshan never thought that just going home to get some hot water would turn his love story into everyone’s topic of conversation.<br/><br/>However, the love story between him and his wife had been brought up many times over the years, and he no longer cared..\t\t\t\t\t\t</div>", "images": {}, "success": true}