{"id": 54, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231913.html", "title": "Chapter 54 - Chapter 54: Chapter 54: The Aftermath Of The Xiao Chunhua Incident 2", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 54 - Chapter 54: Chapter 54: The Aftermath Of The Xiao Chunhua Incident 2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 54: Chapter 54: The Aftermath of the Xiao Chunhua Incident 2<br/><br/>Translator: 549690339<br/><br/>Xiao Jinli got off the motorcycle and also stood by to watch the excitement.<br/><br/>Old Lady Liu’s face turned green, red, and white from Xiao Chunhua’s stare, and she said angrily, “I am your mother-in-law. It’s unfilial not to obey your mother-in-law.”<br/><br/>Xiao Chunhua coldly answered, “Mother-in-law? Oh, yeah, my ex-mother-in-law. I’ve never heard of a divorced woman being obliged to obey her ex-mother-in-law. Your face is so big, have you ever seen it? Your skin is thick and hard.”<br/><br/>“How shameful on you calling yourself as a mother-in-law! I feel embarrassed for you. After all, who else but your selfish and heartless family would find a replacement wife for their son while the daughter-in-law is still pregnant, uncertain if it’s a boy or a girl? You’re even worse than animals! Killing your own grandchild, it’s your retribution!”<br/><br/>Thinking of the aborted child, Xiao Chunhua’s heart ached.<br/><br/>Did Xiao Chunhua hate it?<br/><br/>Of course she did.<br/><br/>It was her child after all.<br/><br/>Her own flesh and blood that she was filled with anticipation for.<br/><br/>She had already prepared little clothes and shoes for the child.<br/><br/>However, the Liu family treated the unborn child like an animal, and it was aborted just because they thought it was a girl.<br/><br/>When she learned the truth from the hospital, she wanted to cut the Liu family members into pieces.<br/><br/>However, she reported the crime, and Liu Bald and his son were arrested.<br/><br/>As the evidence was solid, they were charged with the intentional injury, Liu Bald was sentenced to five years in prison, and Liu Daqiang was sentenced to seven years. They also had to compensate her for medical expenses, mental damage compensation, and various other fees, totaling fifty thousand yuan.<br/><br/>As Old Lady Liu listened to Xiao Chunhua’s disrespectful words, she was both angry and furious. She didn’t hold back, and sarcastically said, “Xiao Chunhua, do you think you can get married after divorcing my son? With you being played by my son, who among the ten miles and eight villages would want you, and who would marry you? ‘<br/><br/>Now, I’m humbly asking you to return to my family, giving you face. When Daqiang comes out, you guys will still be husband and wife, and a family. Now, if you don’t return home with me, when you aren’t wanted by anyone, even if you kneel and beg, I will not let you into my Liu family.”<br/><br/>Old Lady Liu was still acting superior to Xiao Chunhua.<br/><br/>This irritated Xiao Chunhua, and she pointed at Old Lady Liu with her shaking hand and said angrily, “Even if I don’t get married for the rest of my life, I’ll never set foot in your house again.”<br/><br/>At this moment, a villager from Xiao’s family village sneered and said, “Old Lady Liu, don’t you have a pregnant daughter-in-law? Isn’t the child she’s carrying your family’s precious grandson? How come you’re pleading to<br/><br/>Chunhua now?”<br/><br/>As they mentioned the widow, Old Lady Liu’s eyes flashed with cruelty, and she snarled, “That bitch, she’s carrying nothing but a little bastard.”<br/><br/>People in Xiao village looked puzzled at the Liu villagers nearby.<br/><br/>A Liu villager whispered, “After Liu Bald and his son were arrested, Old Lady Liu kept an eye on Niu Xiaolan every day. Then, the day before, Niu Xiaolan took advantage of the old woman’s momentary distraction and went out to have an abortion. It’s said that the aborted child was a girl!”<br/><br/>Originally, Aunt Niu was going crazy when she knew Niu Xiaolan went for the abortion, but when she found out it was a girl, she fainted from anger. When she woke up, she lay on the ground, crying miserably.”<br/><br/>The villagers of Xiao Village,<br/><br/>One villager sneered, “How ironic! They schemed and aborted Chunhua’s baby boy. The girl they took as their precious one is carrying a girl after all. Such retribution! ”<br/><br/>Another villager mocked, “Hehe, this is retribution. Their whole family is desperate for a grandson, but in the end, all they got was empty hands.”<br/><br/>Not to mention that the villagers in Xiao Village have no sympathy for Liu Family, even the people in Liu Jia Cun don’t have any sympathy for Liu Family either.<br/><br/>The misfortunes of the Liu family were brought on by their actions, and they are not deserving of pity or sympathy!<br/><br/>Xiao Chunhua had obviously heard about the Liu Family’s affairs. She mocked Old Lady Liu, “That widow is carrying your Liu Family blood. If she’s considered a lowly breed, then what are you, the Liu Family, a bunch of even lower breeds? Haha, you don’t want a perfectly good grandson, but you treasure a lowly child as if it’s a precious gem. It’s karma, it’s truly karma.”<br/><br/>Xiao Chunhua laughed as she cried.<br/><br/>She cried for the injustice her lost child suffered.<br/><br/>Now that karma was at work so quickly, she couldn’t help but feel ecstatic.<br/><br/>Old Lady Liu’s face was twisted and fierce with hate. “It’s all because our Liu<br/><br/>Family married you, a star of misfortune, that we ended up like this! Xiao Chunhua, let me tell you, it doesn’t matter whether or not you and Daqiang divorce, you will live as part of the Liu Family and die as a ghost of the Liu Family. Even if you die, you have to die in the Liu household.”<br/><br/>Having said that, she lunged to grab Xiao Chunhua again.<br/><br/>However, the villagers of Xiao Family Village stepped in to block her, sarcastically saying, “Old Lady Liu, do you still think you’re living in the old days? Xiao Chunhua is already divorced from Liu Daqiang, so she has nothing to do with your Liu Family. You’d better scram now, or else don’t blame us for being rude.”<br/><br/>Old Lady Liu immediately sat on the ground, slapping her thigh, and wailing like her whole world was crashing down. “Aiyoh, I’m being bullied. The entire village is bullying me, a poor old lady! Is there no justice in this world?! If this is how you treat me, I might as well just die!”<br/><br/>Everyone present wore a dark expression on their faces.<br/><br/>Xiao Siqian had heard before that the women in rural areas tended to be shrewish and unreasonable.<br/><br/>Now he finally saw that for himself.<br/><br/>He quietly asked a nearby villager, “Will she be okay crying and making a fuss like this?”<br/><br/>Looking at Xiao Siqian with a smile, the villager replied, “Hehe, what could possibly happen to her? We just let her off easy because she’s an old lady. If she were younger, we would have thrown her out of the village already.” Xiao Siqian asked again, “Are we really going to let her continue like this?”<br/><br/>“Continue? Hehe, it depends if she has the stamina for it.” The villager mockingly said, “Now that Liu Bald and his son have been arrested, and the widow wants nothing to do with her, she’s just trying to get Chunhua to come back and take care of their family. Humph, what does she consider Chunhua? Their family’s slave? She wants to hit and scold Chunhua as she pleases, and after the divorce, she still wants someone to serve her? She is really living in a world of fantasy, daydreaming! ”<br/><br/>Xiao Siqian,<br/><br/>Xiao Jinli watched the commotion for a while and felt that Xiao Chunhua could handle it herself, so she decided not to watch any further.<br/><br/>She asked Xiao Siqian, “Little Quan brother, I’m going home. Are you coming back with me?”<br/><br/>After thinking for a moment, Xiao Siqian said, “Sister, you go home first; I’ll stay here a little longer.”<br/><br/>Xiao Jinli, ‘          she hadn’t expected that a young man would enjoy watching such a spectacle.<br/><br/>Well, if he liked to watch, he could just watch.<br/><br/>With that thought, Xiao Jinli carried her school bag and walked home by herself.<br/><br/>Upon reaching home, Xiao’s mother looked at her returning alone and asked with confusion, “Where’s Little Quan?”<br/><br/>Placing her school bag down and picking up an apple from the table, Xiao Jinli replied, “He’s still at the village entrance, watching the commotion.”<br/><br/>“A commotion?” Xiao’s mother asked with surprise, “What commotion is happening at the village entrance?”<br/><br/>“It’s Sister Chunhua’s ex-mother-in-law coming to find her,” Xiao Jinli explained.<br/><br/>Xiao’s mother, ‘\t\t\t\t\t\t</div>", "images": {}, "success": true}