{"id": 58, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231923.html", "title": "Chapter 58 - Chapter 58: Chapter 58: Xiao’S Dad And Xiao’S Mom’S Love Story (Fourth More) (Happy New Year’S Eve)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 58 - Chapter 58: Chapter 58: Xiao’S Dad And Xiao’S Mom’S Love Story (Fourth More) (Happy New Year’S Eve)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 58: Chapter 58: Xiao’s Dad and Xiao’s Mom’s Love Story (Fourth More) (Happy New Year’s Eve)<br/><br/>Translator: 549690339<br/><br/>Following behind, Xiao Jinli carried a handful of water bamboo shoots back home.<br/><br/>The water bamboo shoots still had their leaves attached.<br/><br/>Xiao Junxuan immediately stepped forward to take the water bamboo shoots from her hands, saying, “Little sister, where did you get these water bamboo shoots? You haven’t removed the leaves yet, be careful not to cut your hands. Let me take them.”<br/><br/>As he walked, he asked, “Sis, what made you think of eating water bamboo shoots?”<br/><br/>Xiao Jinli said, “I saw that Uncle Dachun’s water bamboo grew well, and I had a craving, so I asked for some from Uncle Changchun.”<br/><br/>Xiao Junxuan nodded, “We have loach, we can make Loach Tofu, but we just caught them from the field, we need to keep them in clean water for a while before cooking. Then today, let’s make stir-fried eel with dried chilies, and water bamboo shoots with beef. The meals at noon today are indeed very good, and we can enjoy a few cups of wine. Oh, right, we didn’t buy beef yet. I’ll go to the town to buy some beef; if I go late, there won’t be any beef left.”<br/><br/>After saying that, he stopped stripping the water bamboo shoot leaves, washed his hands at the sink, took his wallet from the house, and walked towards his car, while instructing Xiao Siqian, “Little Quan, you don’t know how to handle loaches and eels. Wait for me to come back and do it.’<br/><br/>Xiao Siqian nodded and replied, “Okay, Brother Xuan!”<br/><br/>Even if he wanted to, he didn’t know how to do it.<br/><br/>Afterward, Xiao Junxuan left, and Xiao Siqian squatted next to Xiao Jinli, watching her peel off the leaves one by one, revealing the tender white stems inside.<br/><br/>Xiao Siqian asked, “Is this the water bamboo shoot?”<br/><br/>Xiao Jinli handed him a clean shoot and said, “Try it for yourself!”<br/><br/>Xiao Siqian took it and asked again, “How do I eat it?”<br/><br/>“Eat it as it is, like you would eat a fruit!” Xiao Jinli replied.<br/><br/>Xiao Siqian took a bite directly, and indeed it was very tender, crisp, and sweet.<br/><br/>“…” Xiao Jinli said, “Brother Little Quan, it just came from the ground, you should wash it first.<br/><br/>Looking at the bitten water bamboo shoot, Xiao Siqian stood up, ran to the faucet, and rinsed it off.<br/><br/>He genuinely enjoyed the taste, so after washing it clean, he quickly finished it. After eating, he nodded and said, “Hmm, it tastes really good. It seems like water bamboo can be both a fruit and a vegetable.”<br/><br/>Xiao Jinli nodded, “Yeah, you can eat it raw or cook it, just like a tomato.”<br/><br/>After finishing a water bamboo shoot, Xiao Siqian also squatted down and learned to peel off the leaves one by one, revealing the plump white water bamboo shoots.<br/><br/>In no time, he had become proficient at removing the leaves.<br/><br/>Looking at the pile of water bamboo shoots, Xiao Siqian said, “I wonder how much this pile weighs.”<br/><br/>Xiao Jinli said, “Probably about two or three kilograms. It’s enough to make two meals. If you like to eat them raw, choose some tender ones. If they’re a little older, the taste won’t be as good.”<br/><br/>After saying that, Xiao Jinli quickly picked out four or five tender water bamboo shoots and handed them to Xiao Siqian.<br/><br/>She didn’t like eating them raw; she always felt a strange taste. She preferred to eat them stir-fried.<br/><br/>“…” Xiao Siqian accepted the bamboo shoots with a slight embarrassment. Afterward, Xiao Jinli washed half of them by the sink, put them in a basket to drain the water, and set them aside.<br/><br/>When Xiao Father returned, he carried two big buckets, filled with fish that he had bought from Xiao Da Chun.<br/><br/>Xiao Father laughed and said, “Ha ha, with so many fish, we can eat them for a while. Little Quan, which way do you want to have the fish cooked? No need to be polite. We’re all family now.”<br/><br/>Xiao Siqian shook his head and said, “Uncle, I like all kinds of fish. Auntie’s cooking is so good that the fish will be delicious no matter how it’s cooked!”<br/><br/>Hearing the child praise his wife’s cooking, Xiao Wanshan nodded and said, “That’s true. Let me tell you, when I was pursuing your aunt, I loved her cooking. I don’t know how she does it, but the taste is simply divine. The same dish made by others never tastes as good as the one made by your aunt.”<br/><br/>Xiao Siqian nodded in agreement, “Auntie’s cooking skills are indeed excellent, the meals she makes are truly delicious.”<br/><br/>Xiao Wanshan said, “Back then, your aunt was a renowned beauty in the ten miles and eight villages around here. With her good cooking skills, there were countless people pursuing her. There were so many people who came to propose marriage that they almost wore out the doorstep of her house.”<br/><br/>Xiao Jinli immediately teased, “So Dad, how did Mom fall for you back then?”<br/><br/>Xiao Wanshan said proudly, “Of course, it’s because I’m handsome. Your mom is beautiful, and I’m also dashing and attractive. When we stand together, everyone says we are a perfect golden couple.”<br/><br/>Xiao Jinli countered, “But Dad, I heard Mom say that our family was very poor back then, and maternal grandparents and uncles didn’t agree with you marrying mom. Plus, there were many richer and more handsome people pursuing her.”<br/><br/>Xiao Wanshan proudly said, “That was indeed the case at the time. But your mom liked me too. Your maternal grandparents and uncles didn’t agree, so I went to their house every day to show my sincerity.”<br/><br/>“So, Dad, did my maternal grandparents and uncles finally agreed to the marriage because you kept bothering them by going to their house every day?” Xiao Jinli laughed.<br/><br/>“Look, you child. Didn’t I tell you, I was showing my sincerity to your mom. Your maternal grandparents saw my true feelings for your mom, and in the end, they agreed to let her marry me.”<br/><br/>Xiao Wanshan defended himself, “And after your mom married me, I never let her suffer or feel wronged. That’s why even now, your maternal grandparents don’t regret marrying her to me at all. Look how welcome I am when I go to their house.”<br/><br/>Xiao Jinli nodded, “That’s true.”<br/><br/>She didn’t know how her parents’ life was before she was born.<br/><br/>But ever since she was born, she had never seen her parents fighting, especially when they showed affection in front of her and her brother.<br/><br/>Even though she was young, she felt like she was fed up with their daily displays of affection.<br/><br/>She heard people in the village saying that when her father married her mother, their life was really hard, but even so, her father never let her mother suffer or work too hard.<br/><br/>It was like a joke in the village. If her mother hadn’t insisted on opposing, her father might have treated her like a pampered daughter or wealthy wife, even being afraid of her washing dishes in case she hurt her hands.<br/><br/>Luckily, many people said her mother was blessed and married a good husband.<br/><br/>Their families’ good days now were all the result of Xiao Father’s hard work.<br/><br/>After talking about his and Xiao Mother’s love story, Xiao Father went to catch an old hen from the chicken coop to cook.<br/><br/>Today, he was going to make Old Hen Soup.<br/><br/>In the eyes of ordinary people, the meals at Xiao family were nothing short of luxurious.<br/><br/>With fish and meat available all the time, and various dishes being prepared.<br/><br/>So, during Xiao Siqian’s time in the Xiao family, his health had improved significantly, and his face had even gained some plumpness.<br/><br/>Of course, Xiao Siqian hadn’t noticed this yet..\t\t\t\t\t\t</div>", "images": {}, "success": true}