{"id": 57, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231920.html", "title": "Chapter 57 - Chapter 57: Chapter 57: Catching Loach 2 (Third Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 57 - Chapter 57: Chapter 57: Catching Loach 2 (Third Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 57: Chapter 57: Catching Loach 2 (Third Update)<br/><br/>(Happy New Year’ s Eve!)<br/><br/>Translator: 549690339<br/><br/>In the pond, children catch loaches and soft-shelled turtles, while adults catch fish directly.<br/><br/>A child caught a soft-shelled turtle, instantly igniting the excitement of the other children.<br/><br/>They excitedly dug in the pond and scraped for catches, prompting adults to shout, “Children, watch out for the fish in the pond; don’t tread them into the mud!”<br/><br/>Xiao Siqian, who had never played in the mud, quickly joined in and enjoyed the fun.<br/><br/>He couldn’t catch loaches, but he helped the adults catch fish.<br/><br/>He watched as the adults caught fish as big as three jins and put them into a bucket. He also grabbed a similarly sized fish and put it in the bucket.<br/><br/>Many times, the fish were slippery, and after he caught them, they escaped from his hand. The muddy water splashed on Xiao Siqian, covering his entire body, even his face, with mud.<br/><br/>“Hahaha…”<br/><br/>This laughter from some of the children ensued.<br/><br/>“Little Brother Xiao Quan, you can’t even catch a single fish. Look at your face and body covered in mud, hahaha, it’s hilarious.”<br/><br/>“Ah, ah, I see an eel!”<br/><br/>“Ha, Little Ding, did you get it wrong? Is it an eel or a snake? Don’t confuse eels with snakes.”<br/><br/>Eels don’t bite, but snakes can. If bitten by a non-venomous snake, it’s no big deal, but if bitten by a venomous snake, it can be serious.<br/><br/>However, the snakes in the pond are generally non-venomous water snakes.<br/><br/>Little Ding is a big kid, around thirteen or fourteen years old.<br/><br/>He shouted loudly, “It’s an eel, not a snake, I saw it again. I’ll catch it!”<br/><br/>Xiao Siqian immediately went over, wanting to see what an eel looked like and how it was different from a snake.<br/><br/>Eels are good at burrowing into mud, and perhaps because of the people’s disturbance, it quickly burrowed into the mud.<br/><br/>However, it was clear that Little Ding was good at catching eels. He dug out the mud according to where the eel had burrowed and saw its shadow. Then, he reached out and caught the eel.<br/><br/>He held the eel and shouted, “Look, I caught it, it’s an eel, right?”<br/><br/>Xiao Siqian stared at the eel in Little Ding’s hand.<br/><br/>This is an eel? It looks just like a snake. Apart from having slightly yellow skin, it doesn’t seem to have much of a difference from a snake.<br/><br/>Little Ding looked at Xiao Siqian, who was still staring at the eel in his hand, and asked doubtfully, “Little Brother Xiao Quan, do you want this eel?<br/><br/>Otherwise, I’ll give it to you?”<br/><br/>Xiao Siqian hesitated and asked, “Don’t you need the eel? Can’t the eel be sold for money?”<br/><br/>Children in the countryside value money but are also happy with or without it.<br/><br/>Little Ding said, “If Little Brother Xiao Quan wants this eel, I’ll give it to you.” After all, the things found in the mud pond are not very precious.<br/><br/>Even if their parents found out that he had given the eel to Xiao Siqian, they would approve.<br/><br/>Xiao Siqian had initially gone to catch loaches, but he didn’t catch any. He helped catch fish, but the fish escaped from his hands. He really wanted this eel.<br/><br/>Not only this eel but also that soft-shelled turtle, he also wanted them.<br/><br/>However, he was too embarrassed to say it out loud.<br/><br/>Xiao Siqian reached out to take the eel. Just as Little Ding was about to hand it over, he remembered something and said to the shore, “I’d better put it into the bucket. When you go home, just take it with you.”<br/><br/>Xiao Siqian, .<br/><br/>Xiao Jinli, who was watching by the pond, tried to suppress her laughter.<br/><br/>Everyone had a deep impression of Xiao Siqian’s ineptitude at catching.<br/><br/>After the adults had been busy in the pond for half a day and caught enough fish, Xiao Da Chun began to shout, “Children, did you catch any loaches? Have you gotten any pocket money? I’m going to release the water back.”<br/><br/>There were still thousands of fish in the pond. They couldn’t be kept in the water for too long, or they would lack oxygen and struggle to survive.<br/><br/>Adults also shouted, “Children, we’re going to put the water back; come ashore now.”<br/><br/>Hearing the adults’ shouts, the children reluctantly came ashore one by one.<br/><br/>However, the children’s trip yielded quite a lot.<br/><br/>Most of them caught loaches, ranging from three or four to more than a dozen.<br/><br/>Then, crabs, small river snails, eels, soft-shelled turtles, and so on, were all caught by someone.<br/><br/>Xiao Jinli bought these loaches for five mao a piece, which was actually a bit expensive.<br/><br/>But she was willing to give the children pocket money, and the adults also enjoyed the bustling scene.<br/><br/>Little Qiang came over and asked, “Jinli, do you want this soft-shelled turtle?”<br/><br/>Xiao Jinli looked at the soft-shelled turtle that weighed more than one jin and said, “Does your family want it?”<br/><br/>Little Qiang shook his head, “I want to give it to you!”<br/><br/>Xiao Jinli didn’t refuse and said, “Alright, I’ll accept it. When we go home, I’ll weigh it and pay you according to the market price in the open market town.”<br/><br/>Little Qiang didn’t refuse either. He nodded and said, “Alright. Then I’ll put this soft-shelled turtle directly into your bucket.”<br/><br/>“Mmm.”<br/><br/>Xiao Jinli looked at Little Ding and said, “Little Brother Ding, I’ll also weigh this eel when we get back and pay you accordingly.” Little Ding’s eyes lit up and said, “Okay, thank you, Jinli!”<br/><br/>Children were eager for their pocket money.<br/><br/>Little Ding was no exception.<br/><br/>Though he initially wanted to give the eel to Xiao Siqian, he wouldn’t refuse if Xiao Jinli was willing to pay for it.<br/><br/>At worst, he will just accept a little less money when the time comes.<br/><br/>Xiao Siqian carried a big bucket full of assorted wild catches back home directly.<br/><br/>However, his eyes kept glancing at the things in the bucket.<br/><br/>He hadn’t expected that opening the pond in the countryside would be so fun.<br/><br/>After returning home, there was a small concrete pool in the yard.<br/><br/>This small pool was built because Xiao Jinli loved to eat fish.<br/><br/>Xiao Junxuan saw Xiao Siqian carrying a bucket back and asked with a smile, “Is there fish in this bucket?”<br/><br/>Xiao Siqian replied, “It’s loaches, eels, and soft-shelled turtles!”<br/><br/>“Ha, you have all of these things!” Xiao Junxuan was slightly puzzled.<br/><br/>Xiao Siqian explained, “These things were all bought by my sister from the children. ”<br/><br/>“Bought?” Xiao Junxuan was a bit surprised, “All these things!”<br/><br/>“Yes. My sister wanted to eat Loach Tofu, so she bought the loaches from the children for five mao each.<br/><br/>When Xiao Siqian mentioned this, Xiao Junxuan suddenly understood.<br/><br/>He laughed and said, “Oh, so my sister just wanted to give the children some pocket money.”<br/><br/>Xiao Siqian, who never lacked money, asked with some curiosity, “Is it really so difficult for children to get pocket money?”<br/><br/>Xiao Junxuan nodded, “That’s right. Every penny earned by rural parents is not easy, and they are very careful about spending. In general, they don’t give children pocket money. If children need money, they have to figure it out themselves. For example, picking herbs or collecting garbage, as long as there is no stealing, no robbing, and no danger to life, most parents are at ease.”<br/><br/>Xiao Siqian, “…” It turns out that getting pocket money is really so difficult for children.<br/><br/>He used to have a shallow understanding, thinking that every family had a specific plan for their finances, and that children’s pocket money was planned the same way.<br/><br/>Now he knows that many places are not what he thought they were..\t\t\t\t\t\t</div>", "images": {}, "success": true}