{"id": 53, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231909.html", "title": "Chapter 53 - Chapter 53: Chapter 53: Follow-Up To The Xiao Chunhua Incident 1", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 53 - Chapter 53: Chapter 53: Follow-Up To The Xiao Chunhua Incident 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 53: Chapter 53: Follow-up to the Xiao Chunhua Incident 1<br/><br/>Translator: 549690339<br/><br/>Since Xiao Siqian got his motorcycle driver’s license, as long as the weather was clear and it wasn’t raining, he would usually pick up and drop off Xiao Jinli for school.<br/><br/>First, Xiao Wanshan and his son had to go to work in the county town, and second, Xiao’s mother had to prepare meals for the whole family and manage the family’s fields.<br/><br/>So, Xiao Siqian took up the task of shuttling around.<br/><br/>In the afternoon, when Xiao Siqian came to pick up Xiao Jinli, he heard from the chattering of her classmates that she had been awarded 500 yuan by the principal for winning a special prize in the county competition.<br/><br/>But Xiao Jinli took out fifty yuan to treat her entire class.<br/><br/>This matter was being discussed by all the students in the school.<br/><br/>Xiao Siqian, who was waiting by the roadside, listened with one ear and raised his eyebrows again.<br/><br/>He knew that Xiao Jinli had won first place in the County Mathematics Olympiad.<br/><br/>Back when he went to the Principal’s Office, he knew from the conversation between Principal Chen and Xiao’s mother that Xiao Jinli was a genius.<br/><br/>However, this genius was too lazy to show off, and always performed very mediocre at school, with average grades.<br/><br/>This time, Chen Principal invited Xiao Jinli to participate in the competition, actually gambling on her.<br/><br/>However, Xiao Jinli’s performance really surprised everyone.<br/><br/>They thought she would just bring back an award, but she took home a big prize instead.<br/><br/>Of course, for Xiao Siqian, who had received an elite education since childhood, such a small-scale competition was not even worth his attention.<br/><br/>However, he also knew that different regional economies and education levels varied.<br/><br/>Xiao Jinli winning such a big prize was really a great talent.<br/><br/>The more he interacted with Xiao Jinli, the more he could not understand her.<br/><br/>This child brought more and more surprises to people.<br/><br/>After waiting for a while, Xiao Jinli came leisurely with three female classmates.<br/><br/>When Hu Hongmei and the others saw Xiao Siqian, they immediately greeted him politely, “Brother Little Quan!”<br/><br/>Everyone followed Xiao Jinli and called him the same way.<br/><br/>Although the classmates were curious about why Xiao Jinli called her brother this way.<br/><br/>Xiao Siqian also kindly said, “Hello, classmates! Do you want Brother Little Quan to take you home?”<br/><br/>“No need, no need. It’s still early, and we can just walk back!” Hu Hongmei and the others immediately shook their heads.<br/><br/>Sometimes, when they are off from school late or on rainy days, Xiao Jinli’s two older brothers would give them a ride home, which was already a trouble for them.<br/><br/>So on normal days when they could avoid bothering them, they tried their best not to.<br/><br/>Xiao Siqian didn’t insist, but just nodded, then gave Xiao Jinli the little helmet, and said, “Sister, get in the car!”<br/><br/>Xiao Jinli said goodbye to her classmates and got on the motorcycle.<br/><br/>After getting in the car, as they walked, Xiao Siqian said to Xiao Jinli, “Sister, you’re really amazing. I just stood at the school gate for a while, and I heard everyone saying that you won a big prize in the county competition, and the principal gave you a cash prize. You even took out some part of the money to treat all your classmates. It made the other classmates so envious.”<br/><br/>Xiao Siqian knew that Xiao Jinli had absolute control over her own money.<br/><br/>No matter if it was New Year’s money or the pocket money given to her by her parents, Xiao Father and Xiao Mother rarely interfered.<br/><br/>A reward of 500 yuan, not to mention for a child, but even for an adult, is a lot of money.<br/><br/>Generally, parents would confiscate it.<br/><br/>At the same time, using fifty yuan to treat her classmates was really generous.<br/><br/>For this countryside area.<br/><br/>Xiao Jinli won a big prize and instantly became the talk of the school.<br/><br/>Her every move at school was watched and noticed by everyone.<br/><br/>Just like now, Xiao Jinli generously treats her classmates, which makes everyone envious.<br/><br/>Xiao Siqian teased, “Little sister, if you win more prizes like this with cash rewards, would you become a little rich lady?”<br/><br/>Xiao Jinli slightly frowned and seriously replied, “That would be troublesome!”<br/><br/>Xiao Siqian’s expression froze for a moment, then he nodded with sympathy, “Yeah, troublesome!”<br/><br/>In the past, after he received any awards or honors, he would either be interviewed by reporters or asked by the school to give a speech.<br/><br/>Xiao Jinli then earnestly said, “I think it’s better for me to be a salted fish at school! ”<br/><br/>“Okay, be a salted fish!” Xiao Siqian said with a smile, “The kind that never turns over! Hahaha…<br/><br/>Soon the two of them arrived at the entrance of the village.<br/><br/>“Huh, there are a bunch of people gathered up ahead, looks like they’re arguing about something,” Xiao Siqian asked with a hint of curiosity, “When I went out to pick you up just now, there was nothing happening here.” Xiao Jinli squinted her eyes and said, “Let’s go check it out!”<br/><br/>She would always get involved in the village affairs.<br/><br/>Xiao Siqian rode his motorcycle and quickly reached the scene, where he could see the situation more clearly.<br/><br/>An old lady was holding onto Xiao Chunhua, talking very excitedly while sniffling and wiping her tears.<br/><br/>Xiao Siqian had been in the village for a while now.<br/><br/>During this time, he would walk around and take a look at the village, so he had come to know most of the villagers.<br/><br/>He knew Xiao Chunhua and that she had almost lost her life due to an unhappy marriage until Xiao Jinli saved her.<br/><br/>As for the other old lady, Xiao Siqian didn’t recognize her and she didn’t seem to be from Xiao Family Village.<br/><br/>There were several villagers from Xiao Family Village, as well as some other unfamiliar villagers.<br/><br/>These unfamiliar villagers also didn’t appear to be from Xiao Family Village.<br/><br/>“Chunhua, Chunhua, we know we were wrong, and we won’t get divorced. Please come back with me and remarry Daqiang,” said the old lady who turned out to be Liu Daqiang’s mother, Old Lady Liu.<br/><br/>Old Lady Liu held onto Xiao Chunhua’s hand, crying, “Daqiang knows he was wrong too. He was bewitched and deceived by that vicious Widow Niu. Please forgive him and let’s remarry; we’ll live a good life from now on.”<br/><br/>Xiao Chunhua shook off Old Lady Liu’s hand and said coldly, “Aunt Liu, it’s not your fault; it’s mine. It’s because I served your Liu Family so diligently, taking care of everybody, that you all became so arrogant and thought I couldn’t live without you.<br/><br/>Also, remember that I, Xiao Chunhua, have already divorced from Liu Daqiang. Since he conspired with others to hurt me, causing my miscarriage and almost taking my life, I have nothing to do with him. So, whether he knows he’s wrong or not has nothing to do with me. You’re begging the wrong person.”<br/><br/>Hearing Xiao Chunhua’s icy words, Old Lady Liu looked slightly incredulous.<br/><br/>She widened her eyes and said angrily, “Xiao Chunhua, how dare you talk to me like this?” In the past, this girl had always shown the utmost respect for her.<br/><br/>Well, her true nature has been exposed!<br/><br/>The onlookers felt amused.<br/><br/>Old Lady Liu still didn’t understand the situation, thinking that Xiao Chunhua was still under her control like in the old days!<br/><br/>However, the villagers didn’t refute her, they just wanted to see how Xiao<br/><br/>Chunhua would handle it.<br/><br/>Xiao Chunhua sneered, “Why wouldn’t I dare to talk to you like this? How big of a face do you have? Did you really think that when I used to give you face, your face became invincible in the world?” The villagers, ‘         ” Well countered!\t\t\t\t\t\t</div>", "images": {}, "success": true}