{"id": 52, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14110138.html", "title": "Chapter 52 - Chapter 52: Chapter 52: A Big Slap In The Face (Seeking Comments And Votes)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 52 - Chapter 52: Chapter 52: A Big Slap In The Face (Seeking Comments And Votes)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 52: Chapter 52: A Big Slap in the Face (Seeking Comments and Votes)<br/><br/>Translator: 549690339<br/><br/>When Xiao Jinli left the Principal’s Office with 500 yuan in his pocket, he didn’t go far before running into Teacher Xiao Hongmei.<br/><br/>Upon seeing Xiao Jinli, Xiao Hongmei’s face darkened instantly, and she secretly fumed with resentment.<br/><br/>Ever since she had reported Xiao Jinli to the Principal’s Office, she had received a severe warning from the school and had been demoted from a regular teacher to a temporary one. This outcome was already the best her uncle, the Teaching Director, had managed to get for her.<br/><br/>If she could realize her mistake and correct her thoughts, focusing on teaching her students well, there would still be a chance to become a permanent teacher in the future.<br/><br/>Xiao Hongmei had not expected that a seemingly ordinary elementary school student could cause her to fall into such a big pit.<br/><br/>Even more unexpectedly, the student she once looked down on turned out to be a genius hiding their true abilities.<br/><br/>Now, Xiao Jinli’s winning of the county’s special prize in the Math Olympiad had greatly slapped her in the face.<br/><br/>As Xiao Jinli brought honor to the school, the entire school erupted with joy and congratulations, except for Xiao Hongmei, who was very unhappy.<br/><br/>The more Xiao Jinli succeeded, the more it showed that she lacked vision.<br/><br/>Back then, after Xiao Jinli’s grades came out, quite a few teachers openly ridiculed her.<br/><br/>“Teacher Xiao, didn’t you know Xiao Jinli is so good at math? After all, you were her headteacher for such a long time.”<br/><br/>“Teacher Xiao, Xiao Jinli has won such a big prize. If you were still her headteacher, imagine how prestigious it would be for you. Alas, what a pity…<br/><br/>“Haha, don’t feel too sorry. I heard that Xiao Jinli decided to participate in the competition because Teacher Xiao scolded him for being a bad student and leading his classmates astray, demanding that the school expel him. Well, now he’s come back with a big slap in her face.”<br/><br/>“Honestly, I’ve heard rumors among the school’s top brass that Xiao Jinli is a ‘score control genius.’ Do you know what that means? The top students in our school are just ordinary geniuses, but a ‘score control genius,’ that’s a genius among geniuses.”<br/><br/>“Ah, Xiao Jinli is truly remarkable. We thought he was just an average student who slept in class and had mediocre grades. Who would have thought he was the real genius? I must say, the real pity is on Teacher Xiao.”<br/><br/>“That’s right, Mingming this genius belonged to Teacher Xiao, but now that he has gained such great honor, Teacher Xiao gets none of the credit. Instead, Teacher Yang enjoys the limelight. I’ve seen her smiling at everyone and even walking with a breeze.”<br/><br/>“Hehe, if I had a student like that too, I’d be excited and overjoyed. You know, our school ranks last in both regular grades and various competitions in the whole county.”<br/><br/>“But why would Xiao Jinli hide his abilities? Why would he pretend to be an ordinary student? Isn’t it better to have good grades and be a top student?”<br/><br/>“Who knows? I’ve heard that geniuses often have their inexplicable thoughts.”<br/><br/>Listening to all this, Xiao Hongmei felt increasingly uncomfortable.<br/><br/>Deep down, she had started to regret her actions.<br/><br/>Her uncle had warned her that Xiao Jinli was likely a genius since the school leaders had taken notice of him.<br/><br/>But she didn’t pay any attention at the time.<br/><br/>Now, the student she looked down on had come back with a resounding slap in her face, so she couldn’t help but feel humiliated.<br/><br/>Seeing Xiao Hongmei, Xiao Jinli immediately acted like a respectful student and greeted her with a smile, “Hello, Teacher Xiao!”<br/><br/>Xiao Hongmei, however, turned her face away with an unhappy expression and coldly said, “As long as I don’t see you, I’m fine!”<br/><br/>With that, she strode away.<br/><br/>Xiao Jinli didn’t mind her expression and went straight back to the classroom.<br/><br/>As soon as he entered, several of his friends immediately came up to ask, “Xiao<br/><br/>Jinli, what did the principal want from you again?”<br/><br/>Xiao Jinli took out fifty yuan from his pocket and said with a smile, “The principal gave me a little reward. I plan to buy some things for everyone. What do you guys want?”<br/><br/>Hu Hongmei’s eyes lit up upon hearing this, and she enthusiastically asked,<br/><br/>“Are you serious? So, you’re going to treat the whole class?”<br/><br/>Xiao Jinli nodded, “Yeah, my treat. So, just let me know what you want.”<br/><br/>“Yay! Xiao Jinli, you’re so awesome. I want spicy gluten strips, is that okay? You know, the ones that cost 50 cents a pack.”<br/><br/>“Sure, as long as you can eat it,” Xiao Jinli nodded and continued, “It’s not my responsibility if you eat something you can’t handle and hurt your health. So, think clearly about what you want to eat.”<br/><br/>“I want spicy gluten strips too.”<br/><br/>“I want milk candy!”<br/><br/>“I want to buy two pens!”<br/><br/>Xiao Jinli handed the money to the class monitor and asked him to tally up the needs of the classmates.<br/><br/>With that out of the way, he returned to his seat to sleep.<br/><br/>The whole class was excited, and the students from other classes looked on with envy.<br/><br/>How come their class didn’t have such a generous classmate?<br/><br/>The class monitor and several class committee members went to the convenience store outside the school to buy the items.<br/><br/>When the items were brought back, everyone sat excitedly at their desks, waiting for the distribution.<br/><br/>After everything was handed out, the class monitor approached Xiao Jinli with the remaining twenty yuan, saying, “Xiao Jinli, here’s twenty yuan left, I’ll give it back to you.”<br/><br/>Although the money was in his hands, the monitor’s eyes were filled with reluctance.<br/><br/>After all, this was twenty yuan, and for a kid, it meant a lot of snacks and entertainment for quite a while.<br/><br/>Seeing the money in the class monitor’s hand, Xiao Jinli directly said, “Keep this money as the class fee.”<br/><br/>“Huh?” The monitor immediately replied, “Okay, I’ll give the money to the teacher!”<br/><br/>Class fees were typically handed to the teacher.<br/><br/>After all, the self-control of kids this age was poor, and they might spend it without restraint?<br/><br/>If they needed to reimburse the money from home, they might get beaten to death by their parents.<br/><br/>When Teacher Yang heard the class monitor’s report, she too was delighted.<br/><br/>This money was Xiao Jinli’s reward but he chose to use it as the class fee.<br/><br/>She said, “Okay, I’ll be in charge of the class fee. If you need anything for the class later, just tell the teacher. So, Xiao Jinli really treated the whole class?” She asked curiously.<br/><br/>“Yes.” The class monitor didn’t withhold any information and said, “However, many people chose spicy gluten strips and milk candy.”<br/><br/>Teacher Yang said, “It’s fine to eat these occasionally, but not too much or every day. Also, these snacks are the students’ own choice, so if they get sick from it, they can’t blame others.”<br/><br/>The class monitor also said, “Right, I’ve already made this clear to everyone!” Teacher Yang nodded, “As long as it’s made clear.”<br/><br/>However, she was feeling a bit pessimistic.<br/><br/>Some parents might be unreasonable and might make a fuss if their kids got sick from the snacks.<br/><br/>Of course, coincidences like this shouldn’t happen. Soon, Teacher Yang became optimistic again..\t\t\t\t\t\t</div>", "images": {}, "success": true}