{"id": 64, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231941.html", "title": "Chapter 64 - Chapter 64: Chapter 64: Harvesting Grains (Second Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 64 - Chapter 64: Chapter 64: Harvesting Grains (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 64: Chapter 64: Harvesting Grains (Second Update)<br/><br/>Translator: 549690339<br/><br/>By three or four o’clock, Xiao Junxuan went to the grain drying field.<br/><br/>He grabbed a broom, circled around the rice, swept in the middle, and then the rice stalks flew together.<br/><br/>After sweeping these rice stalks into a pile, Xiao Junxuan picked up a sieve and filtered them out.<br/><br/>Soon after, the rice at the drying field became even more golden and full.<br/><br/>However, Xiao Junxuan looked at the sky, and thought it was about time to pile up the rice.<br/><br/>After some thought, he took out his cellphone and called home.<br/><br/>The phone was answered by Xiao Jinli.<br/><br/>Xiao Junxuan said, “Sis, it’s time to harvest the rice, you can wake up mom and dad.”<br/><br/>After hanging up, he used the broom to sweep the rice grains together.<br/><br/>Before long, Xiao Mother, Xiao Jinli, and Xiao Siqian arrived.<br/><br/>As for Xiao Father, he got drunk at noon and was difficult to wake up, so Xiao Mother didn’t bother calling him.<br/><br/>Anyway, since it’s not raining and there’s no rush to harvest the rice, it’s no big deal.<br/><br/>Xiao Mother came and picked up a broom and started sweeping.<br/><br/>Xiao Jinli also did the same, sweeping with a broom as well.<br/><br/>Xiao Siqian, “…” what should he do?<br/><br/>He looked around and didn’t see any brooms.<br/><br/>There were only three brooms in the house.<br/><br/>Xiao Siqian asked, “What should I do then?”<br/><br/>Xiao Jinli replied, “You can take the push scraper board and collect the rice.” Xiao Siqian, “…” but how do you collect it?<br/><br/>Xiao Junxuan put down his broom, picked up the push scraper board, walked toward the center, and scraped the rice together from all sides, bit by bit. Then he said, “Xiao Quan, this is how you use it. There’s another push scraper board over there.”<br/><br/>Xiao Siqian picked up the other push scraper board and started gathering the rice.<br/><br/>The two male students were strong, and Xiao Jinli was also strong, so sweeping the rice repeatedly wasn’t very tiring.<br/><br/>Xiao Mother had done this kind of work countless times, so sweeping the rice was not much of a challenge.<br/><br/>Soon, the rice was piled into small hills.<br/><br/>Xiao Siqian wondered, “Do we have to pack the rice?”<br/><br/>Xiao Mother said, “No need. If we pack it now, we’ll have to unpack it tomorrow, which is troublesome. Just pile the rice up, cover it with waterproof plastic film, and that’s fine. Tomorrow morning, simply open the plastic wax film and spread out the rice to dry.”<br/><br/>Xiao Junxuan also said, “As long as it doesn’t rain at night, the rice won’t get wet. Many people don’t bother to collect the rice and just let it dry in the moonlight. However, during summer, rain is unstable, so most people collect the rice. Don’t get lazy and end up getting the rice wet, or it will be too late to regret. ”<br/><br/>Xiao Siqian, “…” couldn’t help but sigh in his heart, it’s not easy for these rural people, who always have to watch the sky, fearing a sudden rainstorm.<br/><br/>Soon, the family finished covering the rice piles. Xiao Siqian asked again, “Do we need to keep watch overnight?”<br/><br/>Xiao Junxuan waved his hand and said, “No need.”<br/><br/>Xiao Siqian was puzzled again, “If no one is watching, won’t someone steal it at night?”<br/><br/>Xiao Junxuan replied, “I don’t know about other villages, but in our village, there has never been such a thing as stealing. Every household leaves their rice out like this, and nobody steals it.”<br/><br/>Xiao Siqian,    ‘ Rural people are so simple and honest.<br/><br/>No, for now, it’s just that the people in Xiao Family Village are simple and pure.<br/><br/>By the time they finished cleaning up, it was already five or six in the evening.<br/><br/>Xiao Siqian, “…” How did time pass so quickly? It seemed like they had just come out a while ago!<br/><br/>When the family returned home, Xiao Father was still asleep.<br/><br/>People who get drunk can sleep for a particularly long time.<br/><br/>For dinner, Xiao Mother simply cooked tomato and egg noodles. After waking up Xiao Father to eat dinner, he took a bath and went back to sleep.<br/><br/>The next day, after breakfast, the whole family went to dry the rice again.<br/><br/>Xiao Siqian’s work today was much more skilled than yesterday’s.<br/><br/>But the price he paid was a layer of calluses on his palms, and some skin irritation.<br/><br/>But he didn’t make a fuss about it.<br/><br/>As a man, enduring such hardship is nothing.<br/><br/>After the rice is harvested, they also have to plant second season rice in the<br/><br/>field.<br/><br/>To plant the second season, they need to plow the land first.<br/><br/>Nowadays, they don’t use cattle to plow the land but machines instead. It costs<br/><br/>150 yuan per mu.<br/><br/>There are people in Xiao Family Village who have it, and Xiao Wanshan had already made arrangements with them earlier.<br/><br/>There are many households that need their land plowed now, so Xiao Wanshan has to wait his turn.<br/><br/>Of course, since many families raised cattle, some chose to use cattle to plow the land.<br/><br/>Xiao Wanshan and Xiao Junxuan didn’t go anywhere these days. They didn’t even go to work, at least until the rice was dried and stored.<br/><br/>To the people of Xiao Family Village, the work of Xiao Wanshan and his son seemed somewhat mysterious.<br/><br/>That’s because only a few people knew what kind of work they were doing. Some people said they worked for a company, while others said that both father and son were employed by the government.<br/><br/>Xiao Wanshan and his son neither confirmed nor denied.<br/><br/>In fact, even Xiao Siqian was curious about what jobs they had in the county town. Their salaries were high but work was flexible, which sounded like iron rice bowls but didn’t quite fit the description.<br/><br/>Iron rice bowls had low salaries but good welfare. However, the money that the father and son handed over to Xiao Mother every month was several times that of ordinary civil servants.<br/><br/>Once Xiao Siqian asked, “Brother Xuan, what kind of job do you have in the county town? High pay and flexibility.”<br/><br/>Xiao Junxuan smiled and said, “If you’re curious, why not come with me and see for yourself!”<br/><br/>Xiao Siqian didn’t refuse.<br/><br/>It was fine in the morning, but during lunch, the sky suddenly darkened, and clouds gathered.<br/><br/>The whole family immediately put down their bowls and hurried to the grain drying field.<br/><br/>At this moment, the drying field quickly became busy, with someone shouting as they collected rice, “It’s going to rain! By the looks of it, it’s going to be heavy. We have to get the rice in quickly.”<br/><br/>Those nearby who weren’t drying rice dropped what they were doing to help.<br/><br/>In no time, the whole drying field was even busier with many people.<br/><br/>Some people helped Xiao Wanshan’s family. With the help of many hands, the rice was quickly piled up and covered with plastic film, which was then secured with bricks.<br/><br/>After finishing their own rice, Xiao Wanshan and the others immediately went<br/><br/>to help others.<br/><br/>After all, Xiao Wanshan’s family didn’t have much land and their rice wasn’t much either. And since there were many people, the work was done quickly.<br/><br/>But most people in the village had more than 3-4 mu of land, so they had even more rice.<br/><br/>The five members of Xiao Wanshan’s family helped others collect rice separately.<br/><br/>Soon, the rain began to fall drop by drop.<br/><br/>“Hurry up, hurry up, the heavy rain is coming.”<br/><br/>All the people moved even faster.<br/><br/>By the time the heavy rain arrived, the rice of many families had been packed up, but a few families’ rice was soaked. However, there were only 3-4 loads of soaked rice, which was enough to break people’s hearts..\t\t\t\t\t\t</div>", "images": {}, "success": true}