{"id": 68, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231955.html", "title": "Chapter 68 - Chapter 68: Chapter 68: Treat It As Travel! (Third Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 68 - Chapter 68: Chapter 68: Treat It As Travel! (Third Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 68: Chapter 68: Treat it as Travel! (Third Update)<br/><br/>Translator: 549690339<br/><br/>After the busy farming season ended at home, Xiao Father and big brother returned to their nine to five work schedules, and Xiao Jinli also finally had some free time.<br/><br/>As others in the village were still working, even if Xiao Jinli wanted to help, no one would dare to bother her with any work.<br/><br/>For the villagers, it was good enough that Xiao Jinli finished her family’s work. When she wasn’t busy, all she needed to do was be happy.<br/><br/>So Xiao Jinli resumed her carefree days of grazing cows.<br/><br/>Though, with Cow King at home, she didn’t need to worry about them at all. Cow King could go out and come back on its own, even helping to manage the other cows.<br/><br/>“Ah, Jinli has fallen asleep again beside the haystack.” A few little friends were playing card games under the big tree and glanced at the unsociable Xiao Jinli, feeling somewhat disappointed.<br/><br/>“Jinli doesn’t like noise and doesn’t like playing with us. She prefers sleeping by the haystack. What can we do about it?”<br/><br/>As the farming work of the Xiao Family had come to an end, Xiao Siqian also found himself with some free time.<br/><br/>When Xiao Jinli went to graze Cow King, he followed along.<br/><br/>However, while she was napping by the haystack, he sat under the big tree, watching the children playing.<br/><br/>Listening to the children talking about Xiao Jinli, he immediately found it interesting.<br/><br/>He asked with a smile, “Why doesn’t Jinli like playing with you all?”<br/><br/>At this age, children usually enjoy having fun with their friends.<br/><br/>Little puppy said, “Jinli always thinks that we’re stupid and doesn’t like playing with us!”<br/><br/>“…” Xiao Siqian asked, “Has Jinli always been this smart?”<br/><br/>“Yes, yes, Jinli has been smart since she was little. The adults told us that Jinli could talk when she was three months old, and she could chat with adults. At four months, she started learning to read. By the time she was eight months old, she could recognize every character in the dictionary. Then, Brother Junxuan happily showed Jinli ancient poems, and she could memorize them after reading them once. She also easily learned the math formulas that always give us headaches, like addition and subtraction, multiplication tables. It’s as easy as eating a meal to her.”<br/><br/>Xiao Siqian, “…” This is truly a genius among geniuses.<br/><br/>“When we used to try to play with Jinli, she would complain about how dirty we were and say that we were too stupid to play with her.”<br/><br/>“Jinli has always been handling big matters with the adults since she was young.”<br/><br/>“So, Jinli is different from us. She’s someone who’s meant to do great things.”<br/><br/>Xiao Siqian, .<br/><br/>He discovered that in Xiao Family Village, whether they were adults or children, they all blindly worshipped Xiao Jinli.<br/><br/>While Xiao Siqian was inquiring about Xiao Jinli’s situation, the perceptive Xiao Jinli heard everything clearly.<br/><br/>Xiao Jinli looked up at the blue sky with her eyes wide open and thought, “Although life is leisurely now, it might be a bit too boring. I should go to the city and explore. Maybe, I’ll find something interesting there.”<br/><br/>At dinner, Xiao Jinli told her family, “Dad, mom, I’m planning to go to Jianggan City tomorrow!”<br/><br/>“Ah, going to Jianggan City?” Xiao Mother sounded a bit worried, “Xiao Bao, do you have any business there? If you’re bored at home, you can go to the county town to play.”<br/><br/>Xiao Jinli shook her head and said, “Mom, I don’t know how many times I’ve been to the county town. It’s no fun. I just want to see what a big city is like.”<br/><br/>“But Jianggan City is quite far away. If we drive there ourselves, it will take more than two hours.” Xiao Mother sounded slightly concerned, “How about this, if you really want to go to Jianggan City, I can go with you tomorrow.” Upon hearing his mother’s words, Xiao Junxuan’s eyes flickered, and he said, “Mom, my little sister is already on vacation. Why don’t we all go on a family<br/><br/>Xiao Mother’s eyes lit up immediately, “Right, we can all go together. We can treat it as a family vacation. But can your father and brother make time for it?”<br/><br/>Xiao Father laughed and said, “It’s fine. We wouldn’t be able to relax if Xiao Bao goes alone. Let’s all go together and treat it as a vacation.”<br/><br/>Xiao Siqian had wanted to say that he would go with Xiao Jinli initially, but when the whole family decided to go, he kept quiet.<br/><br/>The second day early in the morning, the whole family packed up and set off by car.<br/><br/>They met villagers on the way, and if they were asked, they would smile and say that the whole family was going to Jianggan City for fun.<br/><br/>The villagers would then smile back at them and tell them to have fun.<br/><br/>As for Qing County, Xiao Siqian might not have heard of it before, but he must have heard of Jianggan City, a third or fourth-tier city.<br/><br/>Xiao’s mother prepared some snacks to prevent Jinli from getting hungry on the road.<br/><br/>“Xiao Bao, are you hungry? Do you want to eat some homemade mung bean cake?” Xiao Mother asked.<br/><br/>This mung bean cake is made by Xiao’s mother.<br/><br/>Xiao Jinli shook her head and said, “Mom, I’m not hungry.”<br/><br/>As they passed a small shop, Xiao Jinli immediately got out of the car and bought an ice cream cone.<br/><br/>Such cold and refreshing treats are delicious in this weather.<br/><br/>The car was getting closer to Jianggan City, and more and more tall buildings appeared, gradually revealing the atmosphere of a big city.<br/><br/>In Qing County, there were not many high-rise buildings at all.<br/><br/>Except for a landmark 18 -story building, the highest floors of other buildings were only eight stories.<br/><br/>But the closer they got to the city, the more stifling hot it felt.<br/><br/>Xiao’s mother said, “The countryside is much cooler. Once we’re here, besides the heat, no breeze can be felt at all.”<br/><br/>Xiao Junxuan said, “In this big city, reinforced concrete buildings are everywhere, blocking the wind and making it even hotter.”<br/><br/>Xiao Father asked Xiao Jinli, “Little Bao, where do you want to go and explore when we get here?”<br/><br/>Xiao Jinli said, “Dad, I want to go to the library.”<br/><br/>“…..” Xiao Father asked, “To the library? Little Bao, don’t you want to go shopping in the supermarket or the mall and buy some beautiful clothes and skirts? Or go to an amusement park?”<br/><br/>Xiao Jinli said, “Mom will buy me clothes and skirts, I don’t need to worry about that! And there’s not much fun in amusement parks.”<br/><br/>Xiao Father, “…” A child who is too sensible and well-behaved can also be worrisome sometimes.<br/><br/>Other children would go to zoos or amusement parks or shopping for clothes and toys when they arrived at a new place, but his child wanted to go to the library as soon as they arrived.<br/><br/>Xiao Jinli didn’t know about her father’s concerns, she said, “Dad, drop me off at the library, then you can have a good time shopping with Mom.”<br/><br/>As for her brother, she didn’t need to arrange for him; he would find his own friends.<br/><br/>Xiao Mother worriedly asked again, “Little Bao, can you be alone in the library?<br/><br/>How about sending your brother with you?”<br/><br/>Xiao Jinli laughed and said, “Mom, I won’t run around in the library, don’t worry. As for my brother, he wants to find his friends.”<br/><br/>Xiao Siqian then said, “Aunt, I will accompany my sister.”<br/><br/>Xiao Mother asked, “Xiao Quan, do you want to go shopping with us?”<br/><br/>Xiao Siqian immediately shook his head, “No, no. I also want to go to the library and read some books.” He didn’t want to be a third wheel.<br/><br/>Xiao Mother laughed and said, “Alright then, I’ll leave Little Bao in your care.”<br/><br/>“Aunt, it’s my duty..”\t\t\t\t\t\t</div>", "images": {}, "success": true}