{"id": 67, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231951.html", "title": "Chapter 67 - Chapter 67: Chapter 67: Mung Bean Soup In The Heat (Second Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 67 - Chapter 67: Chapter 67: Mung Bean Soup In The Heat (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 67: Chapter 67: Mung Bean Soup in the Heat (Second Update)<br/><br/>Translator: 549690339<br/><br/>After the busy period of harvesting rice and transplanting seedlings, peanuts and sweet potatoes at home began to be harvested.<br/><br/>Xiao Siqian knew that farming was busy during the farming season, but when he truly experienced it, he realized how busy farming could be.<br/><br/>Harvesting peanuts and digging sweet potatoes are not heavy work, but they do tire people out, especially when all the work has to be done manually.<br/><br/>Xiao Wanshan and his son could not bear to see their wife and daughters (mother and sister) get tired, so they began to take care of the peanut harvesting and sweet potato harvesting.<br/><br/>To harvest peanuts means pulling them out of the ground, the upper part is the plant, and the roots are all peanuts.<br/><br/>When harvesting peanuts, if someone needs the land to cultivate rice, they would pluck the peanuts and pick them up to be picked at home.<br/><br/>Once picked and brought home, there was no hurry to remove the peanuts.<br/><br/>If there was time, they would pick them. If they did not have time, they would leave them as they won’t get spoiled right away, so, first, they would get busy with the rice seedling transplanting.<br/><br/>The Xiao family only grew one acre and five of rice. By comparison, there was no urgency for this peanut harvesting job.<br/><br/>Aside from Xiao’s mother doing household chores like washing clothes and cooking at home, the other four were all in the field pulling peanuts.<br/><br/>After pulling out one peanut plant at a time, they neatly put them aside. When there were enough, they would tie them into large bundles and directly transport them home on a tricycle.<br/><br/>However, the small paths in the field were too narrow for a tricycle to enter.<br/><br/>This was when Cow King played its part.<br/><br/>The bundled peanuts were placed on Cow King’s back, and then Cow King would transport them to a broader place where the tricycle was parked and put the peanuts on the tricycle.<br/><br/>The peanuts from five points of land were not much. With Cow King transporting some, and Xiao Father and Xiao Junxuan carrying one or two loads, it was more or less done.<br/><br/>Xiao Jinli patted Cow King’s head and said with a smile, “Cow King, you’ve worked hard. I’ll give you a reward later.”<br/><br/>As soon as Cow King heard the word ‘reward’, its eyes bulged round and gleamed brightly, it was clear that it liked the idea of the reward.<br/><br/>Given that Xiao Siqian was delicate, Xiao Wanshan did not let him carry the peanuts, after all, this was arduous work; nor did he let Xiao Jinli carry.<br/><br/>Fearing that the weight might hurt Xiao Jinli’s little waist and impede her growth in future, what should they do?<br/><br/>Xiao Bao was quite strong, but her strength lied in her arms. Her small waist would not be able to bear the heavy load.<br/><br/>Not long after Xiao Wanshan and others left, elderly villagers came with small baskets to pick up peanuts from the field.<br/><br/>Some even used hoes to turn the soil in the field, plowing out the peanuts buried deep in the ground.<br/><br/>This phenomenon was common.<br/><br/>Just like when people finished harvesting rice in their fields, others would go and pick up the fallen rice stalks and thresh them at home.<br/><br/>No one would say anything, nor would anyone find it strange.<br/><br/>After Cow King returned to its shed, it waited for its owner to reward it. As expected, after a while, its young master came to it.<br/><br/>Xiao Jinli patted its little head and said with a smile, “Well, Cow King, you’ve worked hard. Here is your reward!”<br/><br/>After saying this, Lingquan water flowed out of his fingertips directly into Cow King’s mouth.<br/><br/>After drinking the Lingquan water given by Xiao Jinli, it was very pleased and rubbed its head against Xiao Jinli’s palm, evidently satisfied.<br/><br/>Xiao Jinli stroked its fur and said, laughing, “All right, it’s ticklish. You rest now. I’m going home!”<br/><br/>Cow King was loath to see Xiao Jinli leave, but after drinking the pure Lingquan water, it felt very satisfied, it was in high spirits now, and it could even flirt with some cows!<br/><br/>However, other cows were still kept in the cattle shed and were not accessible for flirting. Well, it might as well rest for a while.<br/><br/>Next, Cow King laid down on the clean and dry floor, and quickly fell into a state of dormancy.<br/><br/>After having lunch, the family began to pick peanuts under the shade of the<br/><br/>trees.<br/><br/>Since it was not cool enough, they even brought out the fan from the house.<br/><br/>Nevertheless, the weather was hot and dry. Even with a fan under the tree, they still felt a bit irritable.<br/><br/>Xiao’s mother said, “I’ll go make some mung bean soup.”<br/><br/>“Hmm, go ahead!” Xiao’s father nodded and said, “In this kind of weather, drinking some mung bean soup can relieve the heat and make you feel better!”<br/><br/>Xiao Junxuan looked at the tender peanuts they had picked and said, “Mom, cook some young peanuts, I want them spicy and fragrant.”<br/><br/>Xiao’s father immediately gave him a glance and said, “You have hands and feet, can’t you do it by yourself, and yet you started giving orders to your mother!”<br/><br/>Xiao Junxuan, “…” He confirmed once again that he was adopted.<br/><br/>Xiao Junxuan chuckled and said, “Dad, Mom’s cooking is more delicious, right, sister!”<br/><br/>Xiao Jinli nodded, “Yes, the peanuts cooked by mom are more fragrant.” Not because she favored her brother, but because her mom’s really tasted better.<br/><br/>Xiao’s mother laughed and said, “Alright, if my children like to eat, what’s wrong with making some? Xiao Quan, which flavor do you prefer for the peanuts?”<br/><br/>Every time, Xiao’s mother would ask Xiao Siqian’s preference.<br/><br/>Xiao Siqian said, “I’ll just have the same as Brother Xuan’s.”<br/><br/>Previously, he preferred light tastes, but since he arrived at the Xiao home, his taste has gotten heavier, and it was hard to eat light-tasting food anymore.<br/><br/>Xiao’s mother went to scoop the green beans first. After cleaning the green beans and draining the water, she roasted them in a clay pot for a while. The roasted green beans would be easier to soften when cooked later, otherwise, it would take a long time to cook unsoaked green beans until they’re tender.<br/><br/>She used a pressure cooker to cook the mung bean soup.<br/><br/>While cooking the mung beans, Xiao’s mother began to wash the fresh peanuts from the winnowing pan in the sink.<br/><br/>After washing, she cooked them directly in an aluminium pot with salt, edible oil, and five-spice powder.<br/><br/>After Xiao’s mother had done all this, she went back to picking peanuts.<br/><br/>In a short while, there was a “hissing” sound from the pressure cooker.<br/><br/>In no time, the scent of mung beans wafted out of the kitchen.<br/><br/>Xiao Siqian inhaled the scent, “It smells wonderful.”<br/><br/>Xiao’s mother grinned, “It still needs more time.”<br/><br/>About fifteen minutes later, Xiao’s mother went to the kitchen to turn off the gas of the pressure cooker.<br/><br/>She then checked the peanuts in the aluminum pot, tasted them and found they were not fully cooked and flavored yet, so she decided to cook a bit more.<br/><br/>After a while, Xiao’s mother walked out of the kitchen, smiling, and asked,<br/><br/>“The mung bean soup is ready, do you want it hot or cold?”<br/><br/>Xiao Junxuan said, “In this hot weather, it is certainly more comfortable to eat cold.”<br/><br/>Everyone else also expressed their wish for cold mung bean soup.<br/><br/>Xiao’s mother then poured out the mung bean soup from the pressure cooker and put it in cool water to cool down. After it cooled down, she put the mung bean soup in the freezer of the refrigerator.<br/><br/>In the freezer, it didn’t take long, at most twenty minutes, for the mung bean soup to cool down.<br/><br/>After taking the mung bean soup out of the freezer, Xiao’s mother served everyone a bowl, put it on the dining table, and shouted loudly, “Come home and have a bowl of mung bean soup, it’s ice cold and refreshing!”<br/><br/>Xiao Junxuan did not hesitate to put down his work, washed his hands, rushed into the house, grabbed a bowl, and started drinking the mung bean soup. He couldn’t help but sigh, “Drinking this mung bean soup is really refreshing!” Everyone else felt the same way.<br/><br/>In this kind of weather, drinking a cold bowl of mung bean soup is indeed very refreshing!\t\t\t\t\t\t</div>", "images": {}, "success": true}