{"id": 63, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231938.html", "title": "Chapter 63 - Chapter 63: Chapter 63: Good Son Xiao Junxuan – First Update (Happy New Year!)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 63 - Chapter 63: Chapter 63: Good Son Xiao Junxuan – First Update (Happy New Year!)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 63: Chapter 63: Good Son Xiao Junxuan – First Update (Happy New Year!)<br/><br/>Translator: 549690339<br/><br/>At this lunch at the Xiao family’s, everyone ate to their heart’s content.<br/><br/>More than a dozen dishes, all of them were eaten clean, even the soup was all gone.<br/><br/>If someone didn’t know, they’d think that the host did not make enough food.<br/><br/>It was the first time Xiao Siqian saw rural people so happy at the dining table, drinking and chatting, talking about everything, and not having to worry about their image at all.<br/><br/>Even if they got drunk and collapsed on the table, they would be sent home in a while.<br/><br/>There were none of those strict and old-fashioned rules like “not speaking while eating or sleeping” at his old house, and when it came to eating, they had to follow various dining etiquette, mainly focused on nutritional balance, avoiding overly spicy or oily food, and taking care of the digestive system.<br/><br/>Now Xiao Siqian understood that it’s not about the so-called nutritional balance, but rather about mixing meat and vegetables, eating well, and regular exercise for good health.<br/><br/>Is there any data to show that the physical quality of people who eat scientifically and are wealthy is better than that of rural people?<br/><br/>Centenarians are common in the countryside.<br/><br/>But those who are over ninety years old and wealthy actually hang onto life with money.<br/><br/>There was a gambling tycoon who spent several hundred million just to live one more year.<br/><br/>However, centenarians in rural areas can still run swiftly with heavy burdens on their shoulders.<br/><br/>Xiao Siqian thought about this and felt that the rich people’s scientific health regimen was like a joke.<br/><br/>Although rural people don’t have much money, they live happily and eat with peace of mind.<br/><br/>After the villagers left one by one, Xiao Jinli suddenly asked Xiao Siqian,<br/><br/>“Brother Little Quan, did you get enough to eat?”<br/><br/>Every time people came to eat at their house, no matter how much food they prepared, all the dishes would be cleaned up.<br/><br/>Because if you eat at his house, you have to act fast, otherwise, it will end up in someone else’s mouth.<br/><br/>Xiao Siqian’s table manners were excellent, he was well-cultured and polite, and his family never fought over food.<br/><br/>But when people came over, it was different.<br/><br/>With Xiao Siqian’s previous dining etiquette, it would have been a wonder if he could even grab a bite to eat.<br/><br/>Xiao Siqian was slightly startled, then smiled, “Sister, I’m full.”<br/><br/>It’s not like he’s inflexible and can’t adapt.<br/><br/>Seeing everyone grabbing food, he definitely wouldn’t be slow to join in.<br/><br/>Nothing is more important than filling one’s own stomach.<br/><br/>If you don’t eat enough, how can you work in the afternoon?<br/><br/>Xiao Siqian had already deeply understood this truth in these past days.<br/><br/>Xiao Jinli nodded without asking anything more.<br/><br/>She just helped clean up the bowls on the dining table.<br/><br/>Except for Xiao Jinli who was too young to drink, everyone else had had some drinks, especially Xiao Wanshan, whose voice grew louder and he kept hugging Xiao’s mother and shouting, “Wife, I love you, wife, I love you.”<br/><br/>In front of their children, Xiao’s mother blushed beet red in embarrassment.<br/><br/>As for Xiao Jinli and Xiao Junxuan, they were used to such scenes.<br/><br/>Anyway, their father, when drunk, would always grab their mother and confess his love, followed by passionate kissing.<br/><br/>Xiao Siqian’s expression was quite amusing, with his eyes wide open and round, looking very surprised.<br/><br/>He never expected that Xiao Father, who seemed so honest and reserved, would become so enthusiastic and unrestrained after getting drunk.<br/><br/>Being tightly embraced and passionately kissed by Xiao Father, Xiao Mother blushed and said angrily, “Xiao Wanshan, you stubborn old man! Wait till you sober up, and see how I’ll punish you!”<br/><br/>Xiao Jinli and Xiao Junxuan,     They had heard this at least a hundred times, if not a thousand. As soon as their father wakes up, he would completely forget his previous actions, and their mother would be appeased within no time.<br/><br/>Not wanting Xiao Siqian, who had just arrived, to witness their bickering, Xiao<br/><br/>Mother said to Xiao Junxuan and Xiao Jinli who were clearing the dining table,<br/><br/>“Brother, Little Bao, hurry up and help your father back to his room to sleep!”<br/><br/>The drunk Xiao Father, although talkative, would fall asleep quickly once he was in bed!<br/><br/>The brother and sister had no choice but to obey their mother’s order.<br/><br/>Then, with great expertise, they quickly removed the hand that was holding onto Xiao Mother – one hand each from the two siblings. Xiao Jinli grabbed their father’s wandering hand, while Xiao Junxuan supported him on the other side and helped him back to the room.<br/><br/>After the siblings sent Xiao Father to his room, Xiao Mother, blushing, said to Xiao Siqian, “Little Quan, let Aunt take care of the bowls and chopsticks. You’ve been working all morning and had some drinks too. You should go back to your room and rest.”<br/><br/>Xiao Siqian smiled and said, “Aunt, I can help with the dishes.”<br/><br/>Xiao Mother said, “No need, no need. You should go back to your room and rest. I’ll finish these bowls and chopsticks quickly. Besides, there aren’t many dishes left in the kitchen.”<br/><br/>After hearing Xiao Mother’s last sentence, Xiao Siqian’s face couldn’t help but turn red.<br/><br/>Because the reason there weren’t many dishes in the kitchen was that every time Xiao Siqian offered to help, he accidentally broke some.<br/><br/>Xiao Siqian nodded, “Alright, Aunt, I’ll go back to my room and rest.”<br/><br/>When he was about to go upstairs, he turned back and said, “Aunt, Brother Xuan said we have to harvest the rice this afternoon. When it’s time to harvest, remember to call me. I want to help!”<br/><br/>Xiao Mother smiled and said, “Alright, I’ll definitely call you. Since you’re part of the family, you can’t be left out of the family work!”<br/><br/>Since he was really considered a family member, there was no need to make distinctions.<br/><br/>Only when the family worked together would they truly feel like a family.<br/><br/>Hearing this, Xiao Siqian happily went upstairs to rest.<br/><br/>Xiao Mother tied on her apron and began to clean up the bowls and chopsticks on the dining table, putting them in a plastic basin.<br/><br/>Before long, Xiao Junxuan came out.<br/><br/>He said, “Mom, you’ve worked all morning too. You should rest. I’ll take care of this.”<br/><br/>Xiao Mother smiled, “You’ve been busy all morning too.” She felt happy having a thoughtful and considerate son. However, like his father, he always worried about tiring her out. This made her feel both gratified and a little helpless at the same time.<br/><br/>Xiao Junxuan said, “I’m young and strong. Doing this little work won’t tire me out. Mom, you’ve cooked this entire feast all morning; you must be tired. Go and rest.’<br/><br/>Xiao Mother said, “It’s not like I did it all by myself; your sister helped too.”<br/><br/>Xiao Junxuan smiled and said, “She might be able to help wash the vegetables, but if you ask her to cut them, she’ll cut her hand too. She can’t help much.”<br/><br/>“Alright, I can’t win against you!” Xiao Mother laughed and said helplessly, “I’ll go rest for a while. Also, keep an eye on the weather. As soon as it turns cloudy, you must wake us up right away.”<br/><br/>Xiao Junxuan nodded, “Alright, I understand.”<br/><br/>As Xiao Mother went to rest, Xiao Junxuan quickly put all the bowls and chopsticks in a basin, carried them to the yard, then washed and wiped the table clean with a cloth and detergent.<br/><br/>When Xiao Jinli came out, she saw her brother washing the dishes. She rolled up her sleeves, wanting to help.<br/><br/>Xiao Junxuan immediately stopped her, “It’s fine, Sis. You’re not the material for this kind of work. There’s not much work here; I can do it. You should go back to your room and rest.”\t\t\t\t\t\t</div>", "images": {}, "success": true}