{"id": 65, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231944.html", "title": "Chapter 65 - Chapter 65: Chapter 65: Pulling Seedlings From The Ground (Third Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 65 - Chapter 65: Chapter 65: Pulling Seedlings From The Ground (Third Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 65: Chapter 65: Pulling Seedlings from the Ground (Third Update)<br/><br/>Translator: 549690339<br/><br/>After harvesting the rice, they began preparing for the planting of the second season rice.<br/><br/>After plowing the field, Xiao Wanshan spread the fertilizer and manure in the field and let it ferment for several days.<br/><br/>However, when Xiao Siqian saw the manure being spread in the field, he found it hard to accept.<br/><br/>Xiao Jinli saw his slightly disgusted expression, rolled her eyes, and said with a hint of speechlessness, “Do you know what this manure is called scientifically? It’s called organic fertilizer, the cleanest fertilizer. Let me tell you, to grow green food, this manure is indispensable.<br/><br/>Those merchants claiming to sell green food, who knows how they actually grow their crops behind closed doors? Maybe they’re just chemically synthesized.”<br/><br/>Although Xiao Siqian knew about it, hearing it from Xiao Jinli was another matter.<br/><br/>Seeing his expression, Xiao Jinli continued, “Besides, if you don’t use this manure, can you expect pure soil and a bit of water to produce green food? If it were that simple, there wouldn’t have been so many people starving to death in ancient times.”<br/><br/>Xiao Siqian’s expression gradually softened, and he blushed slightly, saying,<br/><br/>He didn’t know how to explain his feelings.<br/><br/>He wanted to say that he never knew green rice was grown this way before.<br/><br/>But then he thought about his amnesia, and how could someone with amnesia know about the past?<br/><br/>Xiao Jinli waved her hand and said, “Brother Little Quan, you don’t need to explain to me. If you can’t get over this, then you might as well stop eating and live on air for a long and healthy life.”<br/><br/>Xiao Siqian,<br/><br/>As for working in the fields to transplant rice seedlings, Xiao Father didn’t require Xiao Jinli to participate, and even refused to let the women join in because he didn’t want his wife and daughter to be tired from working in the fields.<br/><br/>But Xiao Junxuan was different.<br/><br/>Since childhood, under his father’s strict requirements, he was the best at working both inside and outside the home.<br/><br/>Some villagers joked, “Such a capable and well-rounded young man like Little Xuan, who can handle both official duties and kitchen work, will surely be sought after by the girls.”<br/><br/>Xiao Father said with a smile, “As a man, one must bear the responsibilities of a man. We must not spoil our sons. If a son is overly indulged, the ones to suffer and toil later will be my daughter-in-law and grandsons and granddaughters.”<br/><br/>After hearing Xiao Father’s words, everyone found it amusing and looked at Xiao Junxuan with a mix of pity and sympathy.<br/><br/>Poor child, having such a strict and demanding father, it really is pitiful.<br/><br/>Of course, the villagers, seeing Xiao Junxuan being so sensible and capable, loving his mother and sister, and having a harmonious and happy family with the days getting better and better, were also inspired and began to educate their own children.<br/><br/>In this day and age, although boys and girls are treated equally, the perception in rural areas is still different between sons and daughters.<br/><br/>A daughter, once grown up, must get married and leave her parents, not staying by their side.<br/><br/>But a son, whether good or bad, will stay by his parents’ side. Deep down, parents tend to be biased towards their sons.<br/><br/>It may not be obvious on a daily basis, but when related interests are involved, this bias quickly becomes apparent.<br/><br/>For example, a family with one son and one daughter, when the daughter gets married, they always want to raise the betrothal gifts higher. This way, there will be more money in the family to marry a daughter-in-law and buy a house for the son.<br/><br/>Of course, a true heartache for their daughter, even if they take betrothal gifts, they will let their daughter take the betrothal gifts back to her small family.<br/><br/>Ah, I digress.<br/><br/>Although Xiao Father does not ask Xiao Jinli to work in the fields, Xiao Jinli, as a member of the home, wants to work with the family.<br/><br/>Although they hired someone to do the transplanting of rice seedlings, the whole family still worked on it.<br/><br/>Xiao Jinli and Xiao Mother went to the field to pull the seedlings.<br/><br/>From the time she was five years old, Xiao Jinli could do this work.<br/><br/>She skillfully pulled up her pant legs, stepped on the seedling bed, and looked at the lush green seedlings, her eyes shining.<br/><br/>Xiao Mother looked at her and said with a bit of helplessness, “Little Bao, every time I ask you to go to the field, don’t pull up your pant legs. There are leeches in the field. Your skin is so tender, which is very attractive to leeches.”<br/><br/>Xiao Jinli laughed and said, “Mom, it’s fine. I’m not afraid of leeches. If these leeches bite me, I’ll dry them out on the ground.”<br/><br/>Xiao Mother laughed and said, “You, if I didn’t know better, I would think that I gave birth to a boy, not even afraid of blood-sucking leeches. I don’t know who you take after.”<br/><br/>Xiao Jinli laughed and said, “Of course, I take after my dad. When my dad was young, he was famous for not fearing anything. As his daughter, I must have inherited it.”<br/><br/>Xiao Mother shook her head and said, “Speaking of which, your dad was indeed fearless, but he was also a notorious little gangster in the ten miles and eight villages. He was lazy and troublesome, which almost made your grandfather spit blood with anger.”<br/><br/>Xiao Jinli immediately said, “Well, it’s all thanks to you, Mom, for teaching my dad well. Look, my dad has turned into a completely different person after marrying you, hardworking and strong.”<br/><br/>As Xiao Jinli spoke, she reached out and skillfully pulled a few seedlings out of the ground. Then she placed them in one hand and continued pulling until her hand couldn’t hold any more. She then washed the mud off the seedlings in the slightly higher water ditch nearby, and finally tied them together with a straw in the middle.<br/><br/>Once a bundle of seedlings was done, she set it aside.<br/><br/>Then, she continued the work in her hands.<br/><br/>In addition to Xiao Mother and Xiao Jinli, there were two other people involved in pulling seedlings: Chen Qiujie and Hu Liujiao.<br/><br/>When Chen Qiujie heard the mother and daughter talking about Xiao Father’s youth, she also laughed and said, “Yeah, at that time, Wanshan was a complete gangster, always idle all day long. When he reached marriageable age, his parents were very worried. They sighed every day, saying that no girl would marry such a gangster, even if they did, they would certainly have to suffer. Any family that doted on their daughter would never let their precious girl marry someone like that.”<br/><br/>At this point, she laughed and looked at Xiao Mother, continuing, “But who would have thought that this gangster actually set his eyes on your mom.<br/><br/>Your mom was a well-known beauty in the ten miles and eight villages. Her parents doted on her, and it was impossible for them to think highly of your dad, the gangster, even if your dad was handsome and tall.<br/><br/>But, good looks can’t be eaten as food. At that time, your dad was anxious and made a promise to your maternal grandparents. He swore that he would mend his ways and give your mom a good life. He would love her well and not let her suffer or struggle in life.”<br/><br/>However, these words were nice to listen to, but no one knew what would happen in the future. In case he was just saying it and would change back to his old ways after marriage, it would be too late for their regrets. So, no matter how nice your dad spoke, your maternal grandparents did not agree.<br/><br/>But, it was your mom who had a soft heart and believed your dad’s words. Despite her parents’ opposition, she insisted on marrying your dad. This really made your maternal grandparents angry. But, as it turned out, your mom really had an eye for people.”<br/><br/>In fact, Xiao Jinli had heard many stories about her parents growing up, but the villagers just loved to talk about it.<br/><br/>After all, Xiao Wanshan was a classic example of a prodigal son who made a comeback..\t\t\t\t\t\t</div>", "images": {}, "success": true}