{"id": 69, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231959.html", "title": "Chapter 69 - Chapter 69: Chapter 69: A Small Incident In The Library 1 (First Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 69 - Chapter 69: Chapter 69: A Small Incident In The Library 1 (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 69: Chapter 69: A Small Incident in the Library 1 (First Update)<br/><br/>Translator: 549690339<br/><br/>After sending Xiao Jinli and Xiao Siqian to the library, the family left.<br/><br/>Xiao’s mother repeatedly urged, “Xiao Bao, don’t run around here, wait for mom and dad to pick you up! Xiao Quan, please look after Xiao Bao.”<br/><br/>Xiao Siqian assured, “Aunt, don’t worry, I promise to watch my sister and not let her run around.”<br/><br/>Xiao Jinli glanced at him and muttered, “If I wanted to run, you couldn’t stop me.”<br/><br/>Of course, she came to the library to read books, not to run around.<br/><br/>After Xiao’s father left with two others, Xiao Siqian led Xiao Jinli into the library.<br/><br/>Since it was summer vacation, there were quite a few people coming to read and borrow books. In this unfamiliar place, Xiao Siqian felt more at ease holding his sister’s hand.<br/><br/>As they walked, he asked, “Sis, what kind of book do you want to read?”<br/><br/>Xiao Jinli thought for a moment and said, “Science fiction!”<br/><br/>In fact, it was not really science fiction; she just wanted to read about quantum cosmology and such.<br/><br/>As a person from the future, she knew best about the development of the future.<br/><br/>Because she was so clear about it, she wanted to try to slow down the deterioration of the Earth and give humanity more time to live in peace and stability.<br/><br/>Xiao Siqian was a bit surprised that Xiao Jinli liked to read science fiction.<br/><br/>After all, during the time he had spent with Xiao Jinli, he knew that she was lively when with her family, but otherwise seemed laid-back and didn’t seem to have any hobbies.<br/><br/>Xiao Siqian chuckled softly, “Oh, so my sister likes to read science fiction novels. Alright, I’ll take you to find some.”<br/><br/>The library was quite large, and Xiao Siqian found the science fiction section, where many children were already sitting, crouching, or standing and reading books.<br/><br/>Xiao Siqian asked, “Which book do you want to read? I’ll get it for you!”<br/><br/>Xiao Jinli scanned the area and said, “Get me that ‘Galaxy Heroes’.”<br/><br/>Xiao Siqian took the book off the shelf, flipped through it, and handed it to Xiao Jinli, saying, “This is a good book for you.”<br/><br/>Xiao Jinli took the book, found a place to sit down, and began to read.<br/><br/>After watching for a while, Xiao Siqian left.<br/><br/>He was there to read books too, but he wanted to read about economics and finance, and he didn’t want Xiao Jinli to know for the time being.<br/><br/>After all, he was still in a state of amnesia.<br/><br/>After Xiao Siqian left, Xiao Jinli sat quietly and read her book.<br/><br/>As she read, she found it more and more interesting.<br/><br/>She never thought that people of this era would have such rich imaginations, and many of the things described were very close to the future.<br/><br/>However, Xiao Jinli also wondered whether it was the modern people’s rich imagination and wild ideas, or if the forms of the things in the later generations were based on the descriptions of their predecessors.<br/><br/>It’s like the debate about whether the chicken or the egg came first!<br/><br/>As Xiao Jinli was lost in thought, suddenly a hand reached over and snatched the book from her hands.<br/><br/>Xiao Jinli snapped back to reality, only to see a fat man holding the book, smugly telling the people behind him, “Look, I found the ‘Galaxy Heroes’.”<br/><br/>Xiao Jinli stood up, her voice cold, “I got this book first, give it back to me. If you want to read it, come and get it when I’m not reading it!”<br/><br/>Upon hearing Xiao Jinli’s words, the fat man who snatched the book became unhappy.<br/><br/>He said, “I want to read this book now, so you should find another book.”<br/><br/>Xiao Jinli repeated, “I said this book was mine first, so I should read it first. If you want to read it, wait until I put it back and then come and get it.”<br/><br/>Someone behind the fat man immediately began to egg him on, “Luo Zhiqiang, hey, someone is not giving you face. Isn’t your family powerful and influential? Someone is not afraid of you?”<br/><br/>The fat man listened to his buddies’ instigation, his face becoming more and more unhappy. He angrily glared at Xiao Jinli, who had made him lose face.<br/><br/>He shouted loudly, “You stinky woman, do you know who I am? I’ll tell you, my dad is the Yayi Bureau Chief Luo Sanbiao. If you don’t behave, I’ll let my dad arrest you and detain you at the Yamen!”<br/><br/>Ordinary people, whether adults or children, would feel fear and horror when they heard about the Yamen.<br/><br/>The fat man had used this tactic to scare countless people.<br/><br/>So, he was the school bully.<br/><br/>Xiao Jinli’s expression changed, and she sarcastically said, “Oh, you’re the son of the Yayi Bureau Chief. I’m so scared. I’m afraid your dad will arrest me.”<br/><br/>Seeing Xiao Jinli’s expression, the fat man proudly said, “So, if you know what’s good for you, don’t argue with me over this book. Humph!”<br/><br/>Then Xiao Jinli became serious, “Humph, I haven’t done anything wrong or committed any crime, so why should I be afraid of being arrested by your dad? Can it be that your dad is an official who can’t tell right from wrong and doesn’t distinguish between public and private?”<br/><br/>Hearing Xiao Jinli insult his dad, the fat man became furious in his shame and said, “Stinky bitch, how dare you insult my dad! Watch me teach you a lesson and make you lose your teeth!”<br/><br/>With that, he swung his fist and aimed it at Xiao Jinli’s head.<br/><br/>The surrounding adults and children were all frightened and stared wide-eyed. The fat man was tall and strong, and he seemed to have a lot of strength. Not to mention the girl’s height and weight difference with him, even their gender differences put her at a disadvantage.<br/><br/>So, with this punch, the girl’s head would surely be cracked open.<br/><br/>Knowing the fat man’s background, no one dared to come forward to rescue the girl, and everyone could only watch as he violently hit the little girl.<br/><br/>Before his fist could land, there was already chaos around, and those with smaller hearts were scared and closed their eyes to hide, while those with bigger hearts yelled in panic, “He’s hitting someone! He’s hitting someone!”<br/><br/>But no one expected that just as the fat man’s fist was about to hit the girl’s head, the girl suddenly stretched out a hand, directly catching the fat man’s fist. Then with a gentle push, the fat man was forced to step back a few steps, stumbling twice and falling on his butt when she let go.<br/><br/>The change happened so suddenly!<br/><br/>Everyone thought it would be the little girl who would get hit, but it was the fat man who fell instead.<br/><br/>The expressions of many children around were stunned and did not react for a while.<br/><br/>After a quiet moment, someone began to shout, “Well done!”<br/><br/>Then, someone started clapping.<br/><br/>Hearing the applause, the fat man, who didn’t feel any pain from the fall, felt humiliated. His face showed a mix of shame and anger, and his complexion turned ashen.<br/><br/>The fat man’s followers quickly helped him up and pretended to care, asking, “Brother Luo, are you hurt?”<br/><br/>The fat man gritted his teeth and said, “I’m fine.”<br/><br/>One of the followers stepped forward and menacingly said to Xiao Jinli, “You stinky bitch, do you know who Brother Luo is, and dare to fight back? Brother Luo is the son of the Yayi Bureau Chief! Aren’t you afraid of being arrested?”<br/><br/>Xiao Jinli rolled her eyes rudely and cooly said, “I have done nothing wrong or illegal, so I am not afraid of anything. You don’t have to repeat it to me!<br/><br/>Everyone present has bright eyes..”\t\t\t\t\t\t</div>", "images": {}, "success": true}