{"id": 61, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231932.html", "title": "Chapter 61 - Chapter 61: Chapter 61: Sun-Drying The Grains (Second Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 61 - Chapter 61: Chapter 61: Sun-Drying The Grains (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 61: Chapter 61: Sun-drying the Grains (Second update)<br/><br/>Translator: 549690339<br/><br/>Due to the slightly elevated location of the drying yard, rice was brought over by a tricycle driven by Xiao Wanshan.<br/><br/>Well, in this era, only two or three families in the village own a tricycle. There are not many people in the village who can ride a tricycle, so Xiao Wanshan brought it over personally.<br/><br/>The villagers don’t know how much money the Xiao Wanshan family has, but they have all the convenient transportation tools.<br/><br/>Cars, motorcycles, tricycles; other families, having a motorcycle alone means their living conditions are considered good.<br/><br/>After the tricycle was parked, the three of them took down the bags of rice one by one.<br/><br/>When Xiao Siqian offered to help, Xiao Wanshan asked, “Xiao Quan, can you handle it? Each bag of rice weighs at least seventy to eighty jin.”<br/><br/>The main reason was that Xiao Wanshan thought Xiao Siqian was too thin, not like a strong child.<br/><br/>Xiao Siqian nodded, “Uncle, don’t worry, I can handle it!”<br/><br/>It’s a joke, as someone who exercises every day and can single-handedly knock down a dozen thugs, he wouldn’t struggle to carry a small bag of rice.<br/><br/>Having said that, Xiao Siqian picked up a bag of rice, pulled it a bit, and it barely moved.<br/><br/>He slightly knitted his eyebrows, exerted some strength, finally moved it, then reached out, pushed with his thigh, held the bag of rice in his arms, and staggered a few steps.<br/><br/>Xiao Junxuan laughed, “Haha, Xiao Quan, if you can’t do it just say so. My dad and I will take care of it. You can just open these bags and pour the rice out.” Having said that, he took the bag of rice from Xiao Siqian’s hands and placed it steadily on an open space.<br/><br/>Xiao Siqian, “…” He underestimated these farm tasks. At first glance, they seemed simple tasks that only required physical strength, but it wasn’t that straightforward.<br/><br/>It was indeed a misjudgment.<br/><br/>In order not to embarrass himself, Xiao Siqian followed Xiao Junxuan’s instructions to untie the bags.<br/><br/>The mouths of these snake skin bags were all tied with thin ropes.<br/><br/>During his time in Xiao Family Village, he could handle some simple farm work. For example, untie these small ropes and pour the rice onto the ground.<br/><br/>When the rice was poured out, it was all golden, very dazzling and beautiful.<br/><br/>However, the rice had just been taken from the field and had not been sorted properly, so there were some rice straw leaves and green granules mixed in.<br/><br/>The rice straw leaves could be slowly swept out while turning and sunning the rice. As for the green granules, they would be very light after drying, and could be shaken out using a grain windmill, leaving behind the golden full grains.<br/><br/>Of course, the green granules could also be crushed by machines and turned into bran to feed chickens, ducks, pigs, and so on.<br/><br/>More than a dozen bags of rice were quickly placed by the father and son duo.<br/><br/>Xiao Wanshan drove the tricycle away as there was still some rice left in the field that had not been brought up yet.<br/><br/>Xiao Junxuan and Xiao Siqian were left to sun the rice.<br/><br/>Xiao Siqian, following the principle of asking if he didn’t know, asked, “Brother<br/><br/>Xuan, how do we do this?”<br/><br/>Xiao Junxuan pointed to two tools used for sunning rice in his hand and said, “These are bamboo rakes and push scrapers, both used for sunning rice. Now that the rice is in small piles, we use these two tools to spread and thin them.<br/><br/>Which one would you like to use?”<br/><br/>Xiao Siqian smiled and said, “I can use either.”<br/><br/>Xiao Junxuan handed him the bamboo rake and then they started working. After taking the tools, Xiao Siqian watched Xiao Junxuan’s method for a moment and then started working in the same way.<br/><br/>At the beginning, it was a bit clumsy, but soon, he got the hang of it.<br/><br/>He quickly realized that sunning rice was not that difficult.<br/><br/>Sunning rice was physical work, but the two grown men had the strength for it, and soon after, they had spread out ten bags of rice to dry.<br/><br/>However, when Xiao Junxuan turned to look at the rice that Xiao Siqian had sunned, he almost burst into laughter.<br/><br/>He saw the rice Xiao Siqian sunned was too thin, only drying to a single layer of grains.<br/><br/>No wonder it took so long to spread out just one bag.<br/><br/>Xiao Junxuan laughed, “Xiao Quan, this is too thin, it won’t work.”<br/><br/>Xiao Siqian asked, puzzled, “Why not? Isn’t sunning it thin enough?”<br/><br/>Xiao Junxuan said, “If it’s too thin, it takes up too much space, and the small drying yard can’t accommodate so much rice. Don’t worry, we can add more later.”<br/><br/>Just as the two of them took a break, Xiao Wanshan returned with the tricycle.<br/><br/>Seeing the full truck of rice, Xiao Junxuan asked, “Dad, how many bags have we cut today?”<br/><br/>Xiao Wanshan said, “We had sixteen bags just now, and there are another fifteen here! That’s a total of thirty-one bags.”<br/><br/>Xiao Junxuan’s eyes lit up, and he happily said, “This year’s harvest is not bad, we have as many as thirty-one bags. Last year, I remember, we only had twenty-six or twenty-seven bags.”<br/><br/>Xiao Wanshan said, “What’s the point of comparing these? Each time we bag the rice, the size and weight are different, so the number of bags we have each year is different too. However, this year’s rice is more mature than in previous years, and there are fewer green granules.”<br/><br/>The father and son quickly moved the bags from the back of the tricycle.<br/><br/>Afterward, Xiao Wanshan parked the tricycle aside and busied himself sunning the rice.<br/><br/>Xiao Siqian didn’t have any rice tools to use, so he just stood on the side and watched the father and son work.<br/><br/>Both father and son had great strength and were very good at their work. They soon finished sunning the rice.<br/><br/>After placing the nearby tools, Xiao Wanshan looked at the sky and said with a smile, “It’s a good day. With this kind of weather, we’ll only need to sun the rice for two days and then it can be stored.”<br/><br/>Xiao Junxuan also laughed, “This day is indeed good. However, the weather nowadays is unpredictable. One moment it’s a clear sky, and the next moment it’s covered with dark clouds. As they say, June weather, like a child’s face, changes without warning.”<br/><br/>Xiao Wanshan said, “Rural people depend on the weather to work. When we have stuff drying at home, we don’t go far away. As soon as the weather changes, we must immediately start packing up.”<br/><br/>Xiao Siqian asked, “What if the rice gets rained on?”<br/><br/>Xiao Wanshan said, “What can we do? If it rains for a while, then stops, we’ll have to continue to spread the rice out to dry. There won’t be much loss this way. If it keeps raining and continues into the second day, the rice will get moldy and sprout.”<br/><br/>“So fast!” Xiao Siqian was a bit surprised.<br/><br/>“Yes. That’s why, during the rice drying time, we have to stay at home. If it rains, we’ll lose half a year’s harvest, and our efforts will be in vain,” Xiao<br/><br/>Wanshan sighed, “People who farm have to rely on the weather to eat.”<br/><br/>Xiao Siqian fell silent.<br/><br/>He knew that rural people had a hard life, but he didn’t quite understand how hard it was.<br/><br/>After all, his previous life was completely different from life in the countryside..\t\t\t\t\t\t</div>", "images": {}, "success": true}