{"id": 66, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231947.html", "title": "Chapter 66 - Chapter 66: Chapter 66: Fear Of Leeches (One Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 66 - Chapter 66: Chapter 66: Fear Of Leeches (One Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 66: Chapter 66: Fear of Leeches (One update)<br/><br/>Translator: 549690339<br/><br/>After participating in the drying of rice, Xiao Siqian took part in transplanting rice seedlings in the field.<br/><br/>He knew that there was manure in the field, but by this point in time, he had adjusted his mindset and didn’t feel too burdened about it anymore.<br/><br/>Xiao Wanshan instructed Xiao Siqian saying, “Little Quan, since you don’t know how to transplant seedlings, you can handle the process of extracting seedlings. ”<br/><br/>The so-called “extracting seedlings” refers to the process during transplanting wherein one or two threads are drawn from one end of the field to the other, straightly. After that, the transplanting begins one by one, along the thread. This method creates straighter and more visually pleasing seedlings, making future weeding and fertilizing easier.<br/><br/>Rural children are not very proficient in planting seedlings. Once the adults have drawn the lines, they instruct the children to transplant along these lines.<br/><br/>Xiao Wanshan demonstrated as he explained, “All you have to do is transplant along this line. The distance between two seedlings should be around twelve centimeters. Also, don’t plant the seedlings too deeply. About half the depth of our thumb is fine.’<br/><br/>While saying these words, he purposefully glanced at Xiao Siqian’s fingers. They were slender and long, much like a girl’s. He added, “Your fingers are a bit longer, so you wouldn’t need to use half of your finger.”<br/><br/>Xiao Siqian watched attentively and after a while, he nodded, “Okay, Uncle, I<br/><br/>understand.”<br/><br/>Xiao Wanshan smiled heartily, “Ha ha, Little Quan is indeed a smart kid.<br/><br/>Alright, I will entrust this task to you then. Our family doesn’t have much land.<br/><br/>With six people in the field, we can finish all the work in a morning.”<br/><br/>If it was just his family doing the work, it would take them more than a day.<br/><br/>But Xiao Wanshan always believed in finishing work early and thus, he would hire help every year.<br/><br/>In fact, the work in the field was just his part-time job. He needed to finish it quickly so he could return to his main work.<br/><br/>After Xiao Siqian got to the field, he took a bundle of seedlings. After undoing the straw, he bent over along the line and began planting one by one.<br/><br/>In the beginning, he was rather clumsy. The heights of the seedlings he transplanted were uneven, but the distance between each seedling was like it was measured, all of the same length.<br/><br/>Xiao Wanshan praised him, “Little Quan, you’re doing well.”<br/><br/>Hearing Xiao Wanshan’s praise, Xiao Siqian had a bashful smile.<br/><br/>He felt embarrassed for being praised just for doing this amount of work, but at the same time, he felt rather warm inside.<br/><br/>This family is wonderful. They lived in harmony and happiness. It was a blessed family.<br/><br/>If possible, he wanted to stay in this family, taking on the persona of son, younger brother, and older brother permanently.<br/><br/>But alas… A flicker of complex emotion flashed across Xiao Siqian’s eyes.<br/><br/>After a moment, Xiao Jinli came over with her hands full of extracted seedlings.<br/><br/>She looked at Xiao Siqian doing work and laughed, “Brother Little Quan, you’re doing a great job for your first time doing this kind of work. You’re really amazing. ”<br/><br/>Xiao Siqian,<br/><br/>It was one thing to be praised by an adult, but it felt more embarrassing to be praised by a child.<br/><br/>He laughed and said, “Little sister, listen to what you’re saying. Who knew whether I did this kind of work before or not. Your words are making me feel embarrassed.”<br/><br/>After hearing his words, Xiao Jinli thought to herself, “You must not have done this before. You were being chased by thugs, and your background must not be simple. How could a child with such a background know how to farm?”<br/><br/>After speaking with Xiao Siqian for a while, Xiao Jinli took bundles of seedlings and threw them into the field.<br/><br/>Xiao Jinli was strong, and she was accurate with her throws. Each bundle of seedlings was equally spaced out.<br/><br/>As Xiao Siqian was seriously transplanting seedlings, he felt an itch on his calf. He couldn’t help but reach out to scratch it, but when he scratched, he felt something cool and soft.<br/><br/>He involuntarily lifted his leg to check and saw a black thing clinging to his leg.<br/><br/>Seeing his actions, Xiao Jinli walked over. After seeing the thing on his leg, she said, “It’s a leech! You should not scratch it with your hand, otherwise, it will bite deeper.”<br/><br/>Hearing Xiao Jinli’s words, Xiao Siqian’s face instantly turned pale, fear and nervousness appearing in his eyes.<br/><br/>He stuttered, “Le… leech!”<br/><br/>This cool and soft thing, much like a snake, terrifies him.<br/><br/>Before he entered the field, he didn’t think that a leech would bite him.<br/><br/>Seeing his unusual expression, Xiao Jinli immediately comforted him, “Brother<br/><br/>Little Quan, don’t worry, it’s alright. We’ll just get rid of this leech.”<br/><br/>She then used a small seedling, held the head and tail end with both hands, and gently scraped off the leech from Xiao Siqian’s leg. The leech was easily removed.<br/><br/>Once the leech let go, the wound on Xiao Siqian’s leg began to bleed.<br/><br/>For rural people, being bitten by a leech wasn’t a big deal. They would just remove the leech and continue working.<br/><br/>As for whether the wound needed to be disinfected or not, well, they had no such concept.<br/><br/>Xiao Siqian looked at the leech Xiao Jinli had tossed onto the levee and then at his bleeding leg. His face turned even more pale, and his fear heightened.<br/><br/>Seeing his appearance, Xiao Jinli showed concern and asked, “Brother Little<br/><br/>Quan, are you alright? I’ve already removed the leech, so it’s fine.”<br/><br/>Xiao Jinli was somewhat confused. How could a grown man be so afraid of a small creature like a leech?<br/><br/>Xiao Wanshan also noticed the commotion over here. He asked, “What’s wrong, Xiao Bao?”<br/><br/>Xiao Jinli explained, “Brother Little Quan was bitten by a leech, but he doesn’t look good! ”<br/><br/>Being bitten by a leech, eh? Hearing that Xiao Siqian was not in good shape,<br/><br/>Xiao Wanshan said, “Little Quan, why don’t you take a break?.”<br/><br/>He glanced at Xiao Siqian’s pale leg and added, “Go back and apply some disinfectant to the wound. You don’t need to worry, leeches suck blood but they are not poisonous. Xiao Bao, you go back with Little Brother Quan.”<br/><br/>Xiao Jinli nodded, “Okay! Brother Little Quan, let’s go back.”<br/><br/>Xiao Siqian didn’t want anyone to see his weaknesses, but he couldn’t hide them in front of Xiao Jinli.<br/><br/>He shook his head and said, “I’m fine.” He felt embarrassed for showing such fear and nervousness in front of a child. However, this fear came from deep within his heart.<br/><br/>Xiao Jinli, however, was quite stern. She said, “You say you’re alright, but you look as white as a sheet. Let’s go!”<br/><br/>After saying that, Xiao Jinli rather rudely pulled Xiao Siqian up from the ground.<br/><br/>Once she checked his leg and saw nothing left on it, not even an ant, she secretly nodded and said, “Come on, Brother Quan, let’s go home. The mud on your leg can be washed off at home, too!”<br/><br/>Atter that, she dragged him away.<br/><br/>Xiao Siqian could only instinctively follow her. Looking at Xiao Jinli’s small figure with her assertive strength, he felt a warmth.<br/><br/>He laughed and said, “Jinli, I’m glad to have met you and your family!”<br/><br/>Xiao Jinli’s eyebrows furrowed slightly, but then she laughed and said, “Of course our family is great!”<br/><br/>She absolutely adored and loved her family.<br/><br/>Therefore, as long as she was there, she would not let anyone harm her family..\t\t\t\t\t\t</div>", "images": {}, "success": true}