{"id": 60, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231929.html", "title": "Chapter 60 - Chapter 60: Chapter 60: Buying A Combine Harvester (Part 1) (Happy New Year!)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 60 - Chapter 60: Chapter 60: Buying A Combine Harvester (Part 1) (Happy New Year!)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 60: Chapter 60: Buying a Combine Harvester (Part 1) (Happy New Year!)<br/><br/>Translator: 549690339<br/><br/>The unthreshed rice was directly carried to the grain drying field.<br/><br/>The grain drying field was a large flat area, paved with cement, and was where the villagers of Xiao Family Village usually dried their things.<br/><br/>However, the drying field was only so big, with a capacity of 20,000 to 30,000 pounds at a time, and there would be no space for any more.<br/><br/>Thus, families who wanted to dry their grain here had to make arrangements in advance, agreeing on when to harvest and ensuring enough time to allocate space on the drying field.<br/><br/>Xiao Wanshan’s family had five acres of land and 16 dan of unthreshed rice. After removing the rice spikelets and leaves and drying the water content, there would be around 12 or 13 dan of rice, which was considered a good yield.<br/><br/>Xiao Junxuan and Xiao Siqian were waiting at the drying field, sitting on a pile of straw in the shade of a tree, chatting.<br/><br/>Xiao Siqian asked, “Brother Xuan, is the rice harvesting done all by human labor? Aren’t there combine harvesters available now?”<br/><br/>He didn’t know much about agriculture or crop harvesting, but he had watched the news and had some knowledge of it.<br/><br/>The news reported daily on combine harvesters being used to harvest rice, wheat, and various other crops, with very high efficiency, capable of harvesting tens or even hundreds of acres of land in a single day.<br/><br/>Xiao Junxuan replied, “In the countryside, each household doesn’t have much land, and combine harvesters are very expensive, costing tens of thousands of yuan. Rural people’s money is hard to come by, and no one is willing to spend such a huge amount to buy a combine harvester.”<br/><br/>The general thought of rural people was that they were reluctant to spend money.<br/><br/>Furthermore, rural people tended to be more conservative, feeling safer with money in their hands.<br/><br/>Xiao Siqian said, “Hasn’t anyone thought about buying a combine harvester and using it not just for their own rice but also for harvesting other people’s rice and charging a fee for it? I’ve heard that a combine harvester can harvest dozens of acres of land in a single day, saving a lot of manpower and time.”<br/><br/>After hearing Xiao Siqian’s words, Xiao Junxuan was slightly stunned, then smiled and said, “Xiao Quan, I didn’t expect that you actually have a business mindset.”<br/><br/>Xiao Siqian was also slightly stunned, a little confused. Was this what having a business mindset meant?<br/><br/>Had he, the inheritor of a business conglomerate, not have this kind of mindset?<br/><br/>Xiao Junxuan didn’t care about what Xiao Siqian thought. He laughed and said, “Of course people have thought about it. But many people would be reluctant to spend a large amount of money on a combine harvester that costs tens of thousands, or even over a hundred thousand yuan. There’s also the uncertainty of when they’ll make their money back. What if it takes several years to make their investment back, and by then the harvester has broken down? So, there are many factors that make farmers hesitate when it comes to combine harvesters.”<br/><br/>Xiao Siqian couldn’t understand rural people’s thinking.<br/><br/>To him, this seemed like a huge business opportunity.<br/><br/>Of course, in the business world, every opportunity comes with risks alongside its potential rewards.<br/><br/>But to make money, one needs courage and determination.<br/><br/>Xiao Siqian asked, “Brother Xuan, why don’t our family buy a combine harvester?”<br/><br/>Xiao Junxuan said, “We had thought about buying a combine harvester before, but my dad and I both have regular jobs and don’t have time to maintain it.”<br/><br/>“Can’t you hire someone to operate it? Why do you have to do it yourself?” Xiao Siqian asked in confusion. “You can just pay them a daily wage.”<br/><br/>Listening to Xiao Siqian’s words, Xiao Junxuan looked at him with a stunned expression.<br/><br/>Xiao Siqian, feeling strange under Xiao Junxuan’s gaze, asked, “Brother Xuan, what’s wrong? Is there something on my face?”<br/><br/>Xiao Junxuan came to his senses and said with slight excitement, “Xiao Quan, how did you think of this idea? When my dad and I were considering buying a combine harvester, we thought about operating it ourselves for others’ harvest, but we never thought about hiring someone else to do the work!”<br/><br/>Xiao Siqian thought, “Why do you have to do everything yourself?”<br/><br/>In fact, this had something to do with Xiao Junxuan’s mindset of growing up in the countryside.<br/><br/>After all, in their minds, buying a combine harvester was like buying a car, which they would naturally want to drive themselves to feel more secure.<br/><br/>As if inspired by Xiao Siqian’s ideas, Xiao Junxuan said, “Now that you mention it, I think my dad and I should have a good discussion about whether or not to really buy a combine harvester. We don’t have time to operate it ourselves, but we can hire someone. There are many relatives and friends who would be willing to work. Xiao Quan, according to you, should we buy a large combine harvester or a small one?”<br/><br/>The family now had enough money to buy either a large or a small one.<br/><br/>Xiao Siqian thought for a moment and said, “I’ve seen news reports before, small combine harvesters can harvest a maximum of about 20 to 30 acres of land per day, especially if it’s connected to a flat plain. Large combine harvesters can harvest hundreds of acres of land in a single day. Brother Xuan, the combine harvester we buy can not only be used for harvesting in our village, but also in other villages. Do other villages have combine harvesters?”<br/><br/>Xiao Junxuan thought for a moment and said, “As far as I know, there are no combine harvesters in the surrounding ten miles and eight villages.”<br/><br/>“That’s what I mean.” Xiao Siqian smiled and said, “These ten miles and eight villages don’t have any combine harvesters. We can charge a certain fee for harvesting for others, and many people would be willing to use machines for rice harvesting, as long as the fee is within their affordability. In these ten miles and eight villages, and even more villages, there must be tens of thousands, or at least three to four thousand acres of rice fields. As long as one-fifth of the people are willing to use the machines for harvesting, there will be eight or nine hundred acres of land, and charging a hundred yuan per acre, that would bring in eight or nine thousand vuan of income. Plus, two seasons of rice planting can double that! Of course, these conditions are assuming there are no competitors. However, in my opinion, any business opportunity requires taking the initiative.”<br/><br/>Xiao Siqian’s words left Xiao Junxuan stunned once again.<br/><br/>Xiao Siqian looked at his dumbfounded expression, and asked hesitantly,<br/><br/>“Brother Xuan, what’s wrong? Did I say something wrong?”<br/><br/>Xiao Junxuan came to his senses and shook his head, saying, “No, Xiao Quan, you’re absolutely right! Your words have really broadened my thinking.”<br/><br/>As they spoke, he suddenly asked in astonishment, “Xiao Quan, have you regained your memory?”<br/><br/>Xiao Siqian was taken aback, “What?”<br/><br/>“If you haven’t regained your memory, how did you know about the news reports on combine harvesters?” Xiao Junxuan asked suspiciously. “Or have you seen any recent news reports on combine harvesters?”<br/><br/>During the busy farming season, there would be many news reports on rural matters.<br/><br/>Xiao Siqian quickly composed himself and said, “Yes, it was a recent news report I saw.”<br/><br/>Xiao Junxuan didn’t doubt him any further.<br/><br/>After all, who would think that an 18-year-old would lie to others with the excuse of amnesia?<br/><br/>The two of them continued discussing the combine harvester issue for a while, and then the rice was carried back by the others.<br/><br/>After that, the two of them started working..\t\t\t\t\t\t</div>", "images": {}, "success": true}