{"id": 62, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231935.html", "title": "Chapter 62 - Chapter 62: Chapter 62: Xiao’S Mother’S Amazing Cooking Skills (Third Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 62 - Chapter 62: Chapter 62: Xiao’S Mother’S Amazing Cooking Skills (Third Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 62: Chapter 62: Xiao’s Mother’s Amazing Cooking Skills (Third Update)<br/><br/>Translator: 549690339<br/><br/>“Wow, it smells so good!”<br/><br/>“Xiaofang’s cooking skills are so impressive. We haven’t even entered the yard, and the aroma has already greeted us.”<br/><br/>“I think I smelled radish stewed beef.’<br/><br/>“I smelled braised pork.”<br/><br/>“And also chicken, must be old hen soup.”<br/><br/>When everyone arrived, Xiao Jinli was in the yard, cleaning the bowls and chopsticks to be used.<br/><br/>Seeing everyone came over, Xiao Jinli laughed and said, “My uncles and aunts, your noses are really sensitive. All those dishes are made, my mom also made beef offal, spicy blood dishes, stuffed tofu, braised pork feet…”<br/><br/>“Ha Ha, with so many delicious dishes today, we are surely blessed.” Everyone laughed, “I am drooling just from the aroma.”<br/><br/>“Every time I pass by your house and smell the meals, I always want to come and mooch a meal, but I feel too embarrassed.’<br/><br/>Visiting Xiao Wanshan’s home for a meal once or twice is fine, but doing so too often is definitely not acceptable.<br/><br/>Given Xiao Wanshan’s affection for his wife, he would certainly send those who come for free meals away.<br/><br/>Jokes aside, having an additional person for a meal would just add to the burden of his wife.<br/><br/>Xiao Jinli naturally understands her father’s nature and laughed, “We will invite everyone to dine with us when the opportunity arises.”<br/><br/>However, we can’t tire mom out and instead, it’s okay to push brother a bit.<br/><br/>After all, he inherited the cooking talents from mom, and he can prepare meals almost as well as mom.<br/><br/>But, mom loves to cook for the family, hence, brother doesn’t really get a chance to do so often.<br/><br/>Once everyone arrived, they took their seats.<br/><br/>It was a big round table that can accommodate eleven or twelve people easily.<br/><br/>With seven or eight people who worked and the five members of the Xiao family, it’s just enough to fill a big table.<br/><br/>Of course, there were also adults who brought their children along.<br/><br/>However, the children didn’t sit at the table.<br/><br/>The children were served some rice and dishes and they would eat at a smaller table.<br/><br/>Xiao Jinli, well, she did sit at the table.<br/><br/>Because the people of Xiao Village never treated her as an ordinary child.<br/><br/>Xiao Junxuan brought the dishes out from the kitchen one by one.<br/><br/>Braised pork with dried bean curd, radish stewed beef, beef offal, spicy blood dishes, stuffed tofu, braised pork feet, eggy-stewed needle mushroom, eggplant claypot, vinegar-yuhe stewed pig intestine, and a steamed bass, seaweed beer duck, hand-torn cabbage, sausage fried garlic sprouts, assorted vegetables, and an old hen soup.<br/><br/>A full table of dishes, all looking and smelling great, tempting enough to make people drool.<br/><br/>“Wow, Xiaofang’s dishes are not only beautiful but also appetizing.”<br/><br/>“Indeed, look at this braised pork and braised pork feet, the color is so vibrant, it’s so beautiful, and it smells incredibly good too. The braised pork feet I cook ends up either white or black, my children at home always ask me to learn how to cook this dish from Xiaofang.” Chen Qiuhua spoke with a slight trace of helplessness, “I’ve watched Xiaofang quite a few times and tried to cook it myself at home as well, but it’s never as flavorful.”<br/><br/>Her kids at home love this dish, so she also wanted to learn how to make it, but no matter how she tried, there was always something missing.<br/><br/>Xiao Changchun laughed and said, “Ha ha, that just proves that you don’t have<br/><br/>a knack for cooking! ”<br/><br/>“Ha ha, that’s true. Not everyone has Xiaofang’s talent for cooking. It’s just a shame that Xiaofang doesn’t open a restaurant, otherwise, it would be quite a prosperous business.”<br/><br/>“Heh, Wanshan won’t even let Xiaofang cook for their family, even less so start a restaurant. It would be even more exhausting.”<br/><br/>“In my opinion, Wanshan, with Xiaofang’s cooking skills, your restaurant would surely be profitable. Why not just open one?” Xiao Changchun laughed and said, “Running a restaurant is always better than farming.”<br/><br/>Someone immediately chimed in, “Wanshan doesn’t rely solely on farming for a living. Both he and Junxuan have formal jobs in the county town. Farming for them is just to avoid having to buy rice. Plus, Xiaofang doesn’t like to stay idle throughout the year, so she helps out a bit with the farming. Unlike us, who have to rely on farming to make a living.”<br/><br/>“Speaking of which, running a restaurant really is exhausting. The preparation of ingredients alone is cumbersome, not to mention the strenuous task of stir-frying.’<br/><br/>“Oh, if only I had those cooking skills, I’d open a restaurant no matter how tiring or tough it might be. It is far better than farming.”<br/><br/>“Yeah, it’s a pity you don’t have those skills.”<br/><br/>Everyone began to sit down, exchanging quips and comments with each other.<br/><br/>Jinli even scooped a pot of rice wine from the room.<br/><br/>Seeing this, Xiao Changchun immediately asked, “Jinli, did your mother brew this wine? What flavor is it? It smells so good!”<br/><br/>Jinli said, “This is osmanthus wine. It’s very fragrant. Uncles, you must drink it well. ”<br/><br/>“Osmanthus wine, great, great, I must have a good few bowls later. Xiaofang’s brewed wine is also unique.”<br/><br/>“Is it true that anyone who can cook can also brew wine?” someone asked.<br/><br/>“Xiaofang is excellent at cooking and brewing wine. Wanshan, let me tell you, we don’t get to taste your wife’s meals often, but this wine, anyhow, you have to sell me some. I don’t have many hobbies, but I do enjoy sipping on a glass or two.”<br/><br/>“Yes, Xiaofang, how much wine did you brew this time? Can you spare some for me? I usually like to drink a little wine before going to sleep at night, it helps me to sleep better.”<br/><br/>Xiao’s mother wiped her hands and laughed, “This time I brewed two Sho (unit of volume) of rice. It’s quite a bit of alcohol, so you can take some with you when you leave.”<br/><br/>Those who are fond of wine would not refuse.<br/><br/>“That’s great, Xiaofang, thank you for that.”<br/><br/>However, Xiao Wanshan said, “There’s no more of our wine to sell, just like Xiaofang said, you can take some home. This little bit of wine is not enough for me to drink.”<br/><br/>Xiao Wanshan is not a big drinker. but his wife’s brewed wine. no matter how you drink it, always tastes good. He only likes to drink the wine brewed by his wife.<br/><br/>Upon hearing this, Xiao Changchun and the others laughed and scolded, “I say, Wanshan, you can always have your wife brew more wine when yours runs out.<br/><br/>It’s just a little bit of wine, and you can’t bear to sell it.”<br/><br/>“Xiaofang, we won’t listen to Wanshan. You tell us, can you sell us some of this wine?” someone laughed and asked.<br/><br/>Before Xiao’s mother could answer, Xiao Wanshan immediately shook his head and said, “No way, brewing wine is also a tiring job, I can’t bear to have Xiaofang brewing wine every day. Alright, it’s already nice that you can take some wine with you. Don’t ask for too much. Otherwise, I won’t even let you take this small amount of wine.’<br/><br/>“Ha ha, Wanshan, you miser. Who else is as stingy as you?” Xiao Changchun and the others laughed and jeered, “It’s just a little wine, why all the fuss?”<br/><br/>Xiao Wanshan justified his stand, “But this little bit of wine is also tiring for my wife.<br/><br/>Xiao Changchun and the others,<br/><br/>All right. There’s no reasoning with a…wife doting…maniac.<br/><br/>They worry about their wives getting tired all day long. Their wives aren’t porcelain dolls, who would get tired from doing a little work..\t\t\t\t\t\t</div>", "images": {}, "success": true}