{"id": 77, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231991.html", "title": "Chapter 77 - Chapter 77: Chapter 77: Xiao’S Dad Takes Xiao’S Mom To The Beauty Salon (First Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 77 - Chapter 77: Chapter 77: Xiao’S Dad Takes Xiao’S Mom To The Beauty Salon (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 77: Chapter 77: Xiao’s Dad Takes Xiao’s Mom to the Beauty Salon (First Update)<br/><br/>Translator: 549690339<br/><br/>Xiao Junxuan went to a friend’s house.<br/><br/>When Shi Xia saw him, he gave him a happy hug, “Ah Xuan, long time no see. You little bastard, hiding in the small county town, not coming to hang out with us.”<br/><br/>Xiao Junxuan punched his shoulder and laughed, “Here I am to hang out with you guys.”<br/><br/>“Brother Junxuan!” Shi Zhu’er’s face flushed with excitement when she saw Xiao Junxuan. She was visibly shy.<br/><br/>Xiao Junxuan nodded at her, his voice a little cold, “Miss Shi is getting more and more beautiful!”<br/><br/>Obviously, he was just being polite.<br/><br/>But Shi Zhu’er took it as sincere. She looked at Xiao Junxuan with shining eyes, boldly and somewhat shyly saying, “Really? Brother Junxuan really thinks I’m getting more beautiful.”<br/><br/>Shi Xia frowned slightly and said to Xiao Junxuan, “Ah Xuan, we haven’t seen each other for so long, we have to have a good gathering. I’ll treat you to dinner at noon today. Where do you want to eat? At the hotel or the restaurant?”<br/><br/>Xiao Junxuan shook his head, “I came out with my family this time. We will eat together at noon, and then my whole family will go back.”<br/><br/>“Ah, so soon?” Shi Xia asked, “Can’t you stay longer? You should call Ah Jun and have a gathering with everyone. Everyone else is in Jianggan City, you are the only one who has to stay in Qing County. Your family company is not small in scale, it could be located in a larger city. Why nest in a small city? You are completely blocking the development of your company.”<br/><br/>Xiao Junxuan said, “I don’t want to be too far from home. Besides, as long as the money is enough to spend, it’s fine.”<br/><br/>For the current situation, Xiao Junxuan was satisfied.<br/><br/>He could go home every day to eat dinner and chat with his family. It was very warm.<br/><br/>Furthermore, if something happened at home, he could be there to help immediately.<br/><br/>But Shi Zhu’er suggested, “But, Brother Junxuan, you could bring your family over to live together. That way, your company can develop, and you can be with your family.”<br/><br/>Xiao Junxuan shook his head, “No, my mom likes to stay in the countryside and doesn’t like to live in the city!”<br/><br/>On this issue, he had discussed it with his father and asked Xiao’s mother’s opinion. But Xiao’s mother felt that her relatives and friends were in the countryside, and she was used to living there, so she didn’t want to go to an unfamiliar big city with no relatives or friends.<br/><br/>Xiao’s father agreed as well.<br/><br/>What was the point of the father and son making money if not to make a better life for Xiao’s mother?<br/><br/>If Xiao’s mother didn’t want to, it didn’t matter how much money they made.<br/><br/>After hearing Xiao Junxuan’s words, Shi Zhu’er, who had never met Xiao’s mother, began to feel resentful of her in her heart.<br/><br/>She thought Xiao’s mother was too selfish, stopping her son’s development for her own preferences.<br/><br/>If Xiao Junxuan knew what she was thinking, he would definitely sneer, “Nonsense! ”<br/><br/>Shi Xia stopped urging after hearing Xiao Junxuan’s words.<br/><br/>He said, “In that case, let me treat your Uncle and Aunt to a meal. It’s only right that I show my hospitality a bit. Besides, I’ve known you for so long, you’ve met my parents, and I still don’t know yours. Isn’t that a bit unfair?”<br/><br/>Xiao Junxuan grinned, “Alright, I’ll call my dad and ask if he’s willing to come over for the meal.<br/><br/>“Okay, go call him now!” Shi Xia said with a smile.<br/><br/>Xiao’s father listened to the phone call and laughed to Xiao’s mother, “Jun’er said his friend wanted to meet us and invited us to dinner. What do you think?”<br/><br/>Xiao’s mother smiled, “That’s fine. We should go since our child’s friend has this intention.”<br/><br/>Xiao’s father replied to his son, “Your mother says it’s okay. You and your friend can gather first, and your mother and I will go shopping a bit more. When it’s time for dinner, just come pick us up.”<br/><br/>After hanging up the phone, Xiao’s mother laughed, “I didn’t even know our son had friends here.<br/><br/>Xiao’s father said, “Actually, Jun’er has many friends from all over the place, mostly from his university days. Having a few friends here is not surprising.”<br/><br/>As he said this, he paused and added, “In fact, our son’s popularity is very good.” He also had some friends he met through the business.<br/><br/>Xiao’s mother nodded, “Our child has really grown up.” She felt satisfied in her heart.<br/><br/>Xiao’s father asked, “Wife, where else do you want to go? Or shall we go to the mall and buy some clothes or jewelry?”<br/><br/>Xiao’s mother glared at him and said unhappily, “Can’t you think of any other place to take me besides shopping malls to buy clothes and jewelry?”<br/><br/>Xiao’s father was a little confused and asked, “Wife, do you want to go somewhere else? But don’t women love shopping malls and such places?”<br/><br/>At this point, Xiao’s father suddenly thought of a place and mysteriously said to Xiao’s mother, “Come on, wife, I’ll take you to a place.”<br/><br/>Xiao’s mother was very curious about where Xiao’s father was taking her.<br/><br/>Then, half an hour later.<br/><br/>Xiao’s mother stood in the beauty salon lobby with black lines on her face as the staff introduced various beauty treatments with a smile.<br/><br/>So she pulled Xiao’s father aside, clenched her teeth and asked, “So, the good place you were talking about is taking me to a beauty salon for beauty treatments?”<br/><br/>Xiao’s father still didn’t realize his wife’s discomfort and laughed, “Yes, yes, wife. I heard that besides shopping, women like to come to beauty salons even more. I heard that there’s something called SPA that women enjoy very much, so I brought you here to enjoy it.”<br/><br/>“…” Xiao’s mother clenched her teeth and asked, “So, you’re disgusted with me for being old now and want me to come to the beauty salon for beauty treatments? And, where did you, a man, hear so much about women loving to go shopping and beauty salons?”<br/><br/>Xiao’s father finally realized his wife’s discomfort and immediately tried to please her, “Wife, wife, don’t misunderstand. I’m not disgusted with you for being old. Look at you, fair and beautiful, the mother of a forty-something-year-old child, looking like a thirty-something-year-old woman, gorgeous. If anyone is old, it’s me. When we walk together, people who don’t know us might think we’re father and daughter.”<br/><br/>Seeing his wife’s face eased, Xiao’s father let out a quiet sigh of relief and continued, “As for who told me, well, actually, I heard it from some female subordinates and female clients. Wife, I really had no other intentions. I just wanted to bring you here to enjoy.”<br/><br/>Xiao’s mother listened and laughed, “Alright, I know, I won’t blame you.<br/><br/>However, I don’t like places like this, so let’s leave.”<br/><br/>Despite many women enjoying places like this, she didn’t.<br/><br/>She didn’t like other people touching her body, even if they were women.<br/><br/>After Xiao’s father and mother left, the salespeople who had overheard their conversation began to discuss.<br/><br/>“Taking his wife to the beauty salon, he must be an excellent husband.”<br/><br/>“He is a great husband, but they don’t look like rich people judging from their clothes and appearance. I wonder if he knows that coming to our salon once would cost at least three to four thousand yuan.”\t\t\t\t\t\t</div>", "images": {}, "success": true}