{"id": 74, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231979.html", "title": "Chapter 74 - Chapter 74: Chapter 74: Luo Fatty Gets Taught A Lesson 2 (Two More)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 74 - Chapter 74: Chapter 74: Luo Fatty Gets Taught A Lesson 2 (Two More)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 74: Chapter 74: Luo Fatty Gets Taught a Lesson 2 (Two More)<br/><br/>Translator: 549690339<br/><br/>Grandma Luo hesitated and said, “It’s just a small matter, how could it ruin you? Son, you’re making a big fuss out of a small issue.”<br/><br/>Luo Sanbiao thought his mother’s way of thinking was simply unbelievable.<br/><br/>His family members, relying on his position, not only show off and bully people outside but also find trouble, yet they still think it won’t ruin him.<br/><br/>Luo Sanbiao suddenly felt exhausted by this.<br/><br/>Is this what everyone in his family also thinks?<br/><br/>His gaze swept over his wife and grumpy old man, and as expected, their expressions were also silent, and silence meant acquiescence.<br/><br/>Luo Sanbiao suddenly felt as if all the strength in his body was gone, and he collapsed onto the sofa.<br/><br/>This action immediately scared everyone.<br/><br/>“Husband (Son), what’s wrong? Don’t scare us.” The two women immediately asked with concern.<br/><br/>Luo Sanbiao looked at the two women. His expression suddenly became very serious and said, “I’m thinking about whether I should quit my current job and find an ordinary one!”<br/><br/>“What?” The three were even more shocked by Luo Sanbiao’s words.<br/><br/>“Why?” Madam Luo asked with a puzzled look.<br/><br/>Luo Sanbiao gave her a cold glance and said, “Why? What else could it be? I don’t want my son to be ruined by my high position as the Yamen Bureau Chief. Luo Zhiqiang, at a young age, relies on my position as Luo Benbiao’s son, the son of Yamen Bureau Chief, and causes trouble everywhere, bullying the weak. So, while he hasn’t caused any major trouble, I should give up my position and let him have no power to rely on. In the future, he will only become an ordinary child. ”<br/><br/>After hearing her husband’s (son’s) words, the three of them were silent.<br/><br/>Luo Sanbiao’s words were clearly meant to be a wake-up call for them.<br/><br/>Because their son (grandson) bullied people because of his power, it was their teaching.<br/><br/>Every time they would say, “Son (Grandson), let me tell you, no one can bully you in Jianggan City. Whoever bullies you, you should bully them back. You have us and your dad to back you up. Your dad is the Yaman Bureau Chief, everyone is afraid of him.”<br/><br/>Perhaps it was under such teaching that Luo Zhiqiang repeatedly caused trouble outside.<br/><br/>However, every time he caused trouble, they, as parents, took advantage of their position to settle the matter.<br/><br/>They didn’t think there was anything wrong with this.<br/><br/>But who would have thought that this situation would force their son to resign?<br/><br/>How could this happen?<br/><br/>Luo Sanbiao said seriously again, “I, as the Yamen Bureau Chief, am a public servant of the people and is responsible for doing real things for the people. It’s not for you to show off and bully others based on my position.<br/><br/>If this position, on the contrary, makes you bully ordinary people, then what’s the point of me being the Yamen Bureau Chief?<br/><br/>Luo Zhiqiang is still young and doesn’t know what he can and cannot do.<br/><br/>But what about you? You are adults who can tell right from wrong and separate black and white. Why do you teach your child to bully others with his power?<br/><br/>Are you dissatisfied with my position as Yamen Bureau Chief? Do you want to bring me down, aren’t you?”<br/><br/>Madam Luo began to sob. She first realized her mistake and said, “Husband, I was wrong, I was wrong. From now on, I’ll let you discipline Zhiqiang. I… I won’t protect him anymore.”<br/><br/>Without Luo Sanbiao’s position as Yamen Bureau Chief, she wouldn’t have the status of the Director’s Wife.<br/><br/>In the end, she was also afraid of losing such a lofty position.<br/><br/>Grandma Luo was silent for a moment and said, “Son, I know I was wrong too. From now on, I won’t teach Zhiqiang to show off his position outside. From now on, when you discipline him, I… I won’t protect him either.”<br/><br/>Now she knows, the child, as a child, can’t cause too much trouble even if he does.<br/><br/>But what if he causes big trouble? If it really ruins their son, it would be too late to regret it.<br/><br/>As the two most difficult women in the family relented, Luo Sanbiao secretly breathed a sigh of relief in his heart, and then turned his gaze towards his grumpy old man.<br/><br/>Grandpa Luo pursed his lips, his expression serious, as he said, “Son, you’re right. We can love children, but we shouldn’t spoil them. Spoiling them will ruin the child and the family. In the future, I won’t interfere either when you discipline our child.”<br/><br/>After hearing this, Luo Sanbiao felt completely relieved, thinking, “It seems that tough measures are necessary.” Of course, if his family still couldn’t clearly realize their mistakes, he was really planning to resign and quit.<br/><br/>If the family wasn’t harmonious, how could they talk about serving the country and the people?<br/><br/>Luo Sanbiao’s expression was serious as he said, “Dad, Mom, Wife, will you keep your word?”<br/><br/>The three nodded in unison, “Yes, we promise!”<br/><br/>“All right!” Luo Sanbiao nodded, “Luo Zhiqiang, go face the wall and ponder over your mistakes for two hours, you can’t eat lunch, and give me a written review of three thousand words for me to check later. I want him to be clear about his mistakes!”<br/><br/>“What? Facing the wall and thinking for two hours?”<br/><br/>“Not having lunch?” “Three thousand-word review?”<br/><br/>“Luo Sanbiao, you’re…”<br/><br/>“Ahem…” Luo Sanbiao immediately reminded the three people.<br/><br/>Then the three immediately shut their mouths.<br/><br/>Luo Sanbiao asked seriously, “What’s wrong with facing the wall and thinking for two hours? What’s wrong with skipping lunch? What’s wrong with writing a three thousand-word review? Do you have any objections?” “No, no!” The three had somewhat embarrassed expressions.<br/><br/>“Well, since there are no objections, Luo Zhiqiang, did you hear your punishment today?” Luo Sanbiao said to Luo Zhiqiang, “None of these three punishments can be skipped. Today, I will take a leave and supervise you personally. If you still can’t clearly realize your mistakes, we will continue to punish you!”<br/><br/>“What, is it that serious?” The three began to worry again.<br/><br/>But when they met Luo Sanbiao’s stern expression, they shut up again.<br/><br/>So, under Luo Zhiqiang’s wailing, he accepted the first punishment supervised by his father.<br/><br/>Luo Zhiqiang cried his eyes out and sobbed, he sincerely knew he was wrong.<br/><br/>This could be said to be Luo Sanbiao’s first genuine attempt at disciplining his son.<br/><br/>In the past, every time he tried, other family members would start to make a fuss and the discipline would be abandoned halfway. As a result, Luo Zhiqiang developed such a terrible character.<br/><br/>That child was right.<br/><br/>At this age, he still has time to correct himself.<br/><br/>If he doesn’t correct him in time, when he really causes big trouble, it will be too late.<br/><br/>At this moment, Luo Sanbiao felt truly grateful to that little girl for her reminder deep down in his heart.<br/><br/>He secretly thought, “Next time I see that little girl, I must remember to thank her!”<br/><br/>Xiao Jinli didn’t know that Luo Sanbiao had taken her advice as a great favor.<br/><br/>At this moment, after eating lunch at the restaurant, they found a nearby hotel and rented an hourly rental room to rest.<br/><br/>In the afternoon, they planned to go to the amusement park to swim.<br/><br/>Such a hot day, swimming and having fun was really interesting..\t\t\t\t\t\t</div>", "images": {}, "success": true}