{"id": 71, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231967.html", "title": "Chapter 71 - Chapter 71: Chapter 71: Persuading Him To Wake Up (First Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 71 - Chapter 71: Chapter 71: Persuading Him To Wake Up (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 71: Chapter 71: Persuading him to Wake up (First update)<br/><br/>Translator: 549690339<br/><br/>The Administrator really did make a phone call.<br/><br/>At that time, Luo Sanbiao was in a meeting. Upon hearing the Administrator’s words, his face turned purple with anger.<br/><br/>After the meeting ended, he rushed to the Library.<br/><br/>As soon as he arrived, without saying a word, he slapped his son’s face and loudly scolded, “You good-for-nothing!”<br/><br/>Being obese, Luo Pangzi’s face quickly swelled up after the slap.<br/><br/>“Wah wah .<br/><br/>Perhaps he had never been hit like this before, so his father’s slap made him cry out loud.<br/><br/>Luo Sanbiao scolded, “You have the nerve to cry? You have thrown your father’s face away today, and you still have the face to cry! I didn’t even know that you were flaunting your father’s power outside. How old are you that you already know how to bully others with your power?”<br/><br/>After scolding his son, Luo Sanbiao turned his head to apologize to Xiao Jinli.<br/><br/>Xiao Siqian worried that this fatty’s father would vent his anger on Xiao Jinli, so he immediately protected her behind him and guarded vigilantly, asking, “What are you going to do?”<br/><br/>When he was reading in another area earlier, he learned that a girl in the Science Fiction Area was being bullied. He suddenly realized something and quickly rushed over.<br/><br/>As expected, it was Xiao Jinli who was being bullied.<br/><br/>He came forward to check and immediately let out a sigh of relief when he found that she was not bullied.<br/><br/>However, when he found out the identity of the other party, he was suddenly enraged.<br/><br/>But he temporarily suppressed his anger after hearing that the Administrator called his father to come over.<br/><br/>Luo Sanbiao glanced at Xiao Jinli behind Xiao Siqian, then looked into Xiao Siqian’s eyes, showing a friendly expression. He barely managed to smile and said, “Young man, don’t be afraid. I am here to apologize to the girl behind you.”<br/><br/>Xiao Siqian was suspicious and asked, “Apologize?”<br/><br/>“Yes, apologize!” Luo Sanbiao said, “Young girl, I am sorry. It is my fault for not disciplining my son properly, letting him cause trouble outside, and forcefully bullying you.”<br/><br/>Xiao Jinli stood up from behind Xiao Siqian and asked with a serious expression, “Can I ask you a question?”<br/><br/>Luo Sanbiao was slightly stunned, then nodded and said, “Yes, you can!”<br/><br/>Xiao Jinli boldly asked, “Do you know about your son’s actions?”<br/><br/>Luo Sanbiao’s pupils shrank abruptly, and his aura was briefly horrified. When his gaze met Xiao Jinli’s, it was sharp and authoritative.<br/><br/>However, Xiao Jinli ignored the frightening sharp aura of him and fearlessly looked him in the eye.<br/><br/>Suddenly, Luo Sanbiao laughed out loud.<br/><br/>His expression seemed a bit ashamed and he honestly said, “Young girl, I won’t lie to you. If I said I had no idea what my son was doing, that would be a lie. But every time I learn that my son was causing trouble and try to teach him a lesson, my family would stop me. Helplessly, every time I had to pick up something heavy, I would put it down lightly without causing any real pain. He never truly learned a lesson!”<br/><br/>Every time he tried to discipline this brat, his wife and mother would try to stop him. If they couldn’t stop him, they would cry, make a fuss and even threaten with suicide, making it impossible for him to discipline the child. Moreover, there was his father, who would swing a stick to chase him down and teach him a lesson every time.<br/><br/>He would also confidently say, “You discipline your son, and I will discipline mine!”<br/><br/>As a result, every attempt at disciplining never amounted to anything.<br/><br/>After hearing his words, Xiao Jinli immediately understood his position within the family and with his children.<br/><br/>She nodded and said, “I also hope that you will be a good father.<br/><br/>Each child is the hope of the next generation of the family and the hope of the nation’s future. If you have the ability, please educate him to become a pillar of the nation, rather than a bully who takes advantage of the weak and the helpless!”<br/><br/>Of course, the details about Luo Sanbiao were told to her by Xiao Zhi.<br/><br/>Therefore, Xiao Jinli also didn’t particularly mean to cause trouble for him.<br/><br/>Upon hearing Xiao Jinli’s words, the adults were very surprised, especially Luo Sanbiao, who was even more shocked.<br/><br/>A girl of such a young age had an upright demeanor, a broad mind, and a love for her country.<br/><br/>Each child is the future of the family and the country.<br/><br/>Luo Sanbiao suddenly understood.<br/><br/>He said seriously to Xiao Jinli, “Fine, I will make sure to discipline him when we go back. Young girl, thank you!”<br/><br/>Xiao Jinli waved her hand and said, “At this age, if the child is not born with a bad heart, they can be corrected.”<br/><br/>“Yes, I understand, thank you, young girl!” Luo Sanbiao sincerely thanked her and then invited her to a meal at noon.<br/><br/>“Uncle Luo, please take us out to lunch!” he said, inviting both Xiao Jinli and Xiao Siqian.<br/><br/>Xiao Jinli declined and said, “My name is Xiao Jinli. It’s not necessary, we are here to read books. At noon, my parents will come to pick us up for lunch. You must be very busy, please go ahead with your work!”<br/><br/>At least first go and discipline your son.<br/><br/>Luo Sanbiao had someone bring paper and pen, wrote down his phone number, and handed it to Xiao Jinli, saying, “Miss Jinli, this is my phone number. If you need anything from Uncle Luo, just call this number. I will ask you out for a meal another day.”<br/><br/>Xiao Jinli did not refuse his friendly gesture and accepted the paper saying, “Alright, thank you in advance, Uncle Luo!”<br/><br/>With that, they became acquainted as seniors and juniors.<br/><br/>It wasn’t long before Luo Sanbiao took his son away.<br/><br/>Luo Zhiqiang’s followers also left, their faces pale with fear.<br/><br/>They didn’t expect that the girl not only didn’t get punished but also got his phone number, which was a great opportunity to connect with him. With Luo Sanbiao and company gone, many adults looked at Xiao Jinli with envious eyes.<br/><br/>This young girl had turned her misfortune into a blessing.<br/><br/>An adult asked her jokingly, “Young girl, aren’t you afraid?”<br/><br/>Xiao Jinli asked, puzzled, “Why should I be afraid of him? Does he have an extra eye or ear that makes him a monster? Should I be afraid?”<br/><br/>The adults, “… l’ Alright, this young girl’s thinking is indeed different from others.<br/><br/>From then on, Xiao Siqian dared not leave. He also casually picked up a science fiction novel to read nearby.<br/><br/>Xiao Jinli, “….” How can I go tind other books to read it you don’t leave!\t\t\t\t\t\t</div>", "images": {}, "success": true}