{"id": 70, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231963.html", "title": "Chapter 70 - Chapter 70: Chapter 70: A Small Incident In The Library 2 (Second Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 70 - Chapter 70: Chapter 70: A Small Incident In The Library 2 (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 70: Chapter 70: A Small Incident in the Library 2 (Second Update)<br/><br/>Translator: 549690339<br/><br/>Xiao Jinli, though small in stature, had a strong presence. She glared coldly at Luo Pangzi and the others, speaking with conviction, “All I wanted was to read a book, yet you want to take it from me and arrest me. I have to ask, does this library belong to your family? Or do you people possess such power and influence that you can control the entire Jianggan City and even arrest ordinary people just for reading?”<br/><br/>The children didn’t quite understand what Xiao Jinli was saying and their expressions were calm.<br/><br/>But the adults were different, especially those who accompanied their children to the library to read, most of them were intellectuals.<br/><br/>After hearing Xiao Jinli’s words, they were quite surprised, and secretly praised in their hearts, “This child has guts, daring to say anything! However, if she really encounters revenge from a narrow-minded, powerful family, it’s unimaginable.”<br/><br/>Xiao Jinli wasn’t a real child, so she knew what could be said and what couldn’t.<br/><br/>But at this moment, she treated herself as an ignorant child.<br/><br/>Luo Pangzi and the others were about fourteen or fifteen years old, at the age of junior high school.<br/><br/>Many children at this age were rebellious, having a sense of understanding yet still rebellious.<br/><br/>So when they heard Xiao Jinli’s words, they didn’t take them to heart.<br/><br/>Luo Pangzi pointed at Xiao Jinli angrily, “You stinkin’ bit…”<br/><br/>Before he could finish, Xiao Jinli stepped forward and pinched his outstretched finger.<br/><br/>“Ouch, ouch…” Luo Pangzi’s expression twisted in pain as he shouted, “Let me go, let go of me… wu wu…”<br/><br/>Xiao Jinli ignored his pain, speaking coldly, “Stinking bitch, stinking bitch, that’s all you say? Is that the quality of a Yamen Bureau Chief’s son? Does your family have no women or girls? Or do you also call your mom and sister ‘stinking bitches’? Such discrimination against women.”<br/><br/>As soon as Xiao Jinli’s words fell, an adult echoed, “Yeah, cursing this little girl with that filthy word over and over again. Is that something a child should say?<br/><br/>Some people whispered, “I heard that Director Luo is a fair and impartial person, but how is his child raised like this?”<br/><br/>“Looking at Luo’s son, he shouldn’t have taken advantage of his power to bully others regularly, right?”<br/><br/>“So, does Director Luo know?”<br/><br/>After all the discussion, everyone began to doubt whether Director Luo was really a just and unselfish person.<br/><br/>After all, even his own child could bully others with his power outside.<br/><br/>The followers behind Luo Pangzi turned pale and nervous as they listened to the surrounding gossip.<br/><br/>Did they… did they cause negative consequences for Director Luo?<br/><br/>Enduring the pain, Luo Pangzi yelled, “Stink…you stinky girl, let me go right now, or else… I won’t let you off! If you dare, tell me your name!”<br/><br/>“I’m not stupid. Why should I tell you my name?” Xiao Jinli said confidently, “After I tell you my name, am I going to stupidly wait for your revenge?”<br/><br/>The onlookers,     ‘ This child is really… surprising.<br/><br/>Luo Pangzi and the others were also a little dumbfounded.<br/><br/>This stinky girl didn’t play by the rules.<br/><br/>In the past, when he asked like this, either the person would be scared and shivering like a quail or be scared and foolishly reveal their own name.<br/><br/>“If you want to take revenge on me, do it now while I’m still here,” Xiao Jinli said generously, “Otherwise, once I leave, you won’t be able to find me.”<br/><br/>Adults,<br/><br/>Luo Pangzi, ‘<br/><br/>This girl really doesn’t play by the rules.<br/><br/>So how should they proceed?<br/><br/>“Mmm, mmm…”<br/><br/>A series of voices broke the somewhat quiet atmosphere.<br/><br/>“There is no noise allowed in the library!” The library administrator said sternly, “If anyone makes noise again, please leave immediately!”<br/><br/>One of Luo Pangzi’s followers caught on and immediately pointed at Xiao Jinli, shouting, “It’s her… she’s the one fighting here. Look, she’s still holding Luo’s hand right now. She’s causing trouble, kick her out!”<br/><br/>The evil person complains first!<br/><br/>Having said that, the expression when looking at Xiao Jinli was somewhat smug.<br/><br/>Thinking to himself, stinky girl, you’re no match for us.<br/><br/>The librarian glanced at Xiao Jinli with furrowed brows.<br/><br/>Xiao Jinli immediately let go of Luo Pangzi, her expression innocent, “Auntie, I was just looking at a book quietly, he wanted to take it, I didn’t give it, and he just raised his fist to hit me. I was just defending myself. So, this is legitimate self-defense.<br/><br/>The implication was that if one is to be kicked out, they should both be kicked out!<br/><br/>“Wow, this little girl actually knows about legitimate self-defense.”<br/><br/>“Yeah, at this age, she should know.”<br/><br/>“But, this is indeed legitimate self-defense. If this girl had been strong enough to fend off Luo’s… Luo’s punch, she probably would have been beaten bloody.”<br/><br/>The librarian, of course, recognized Luo Pangzi and knew his identity. Luo Zhiqiang had relied on his status to bully many people in the library and had taken their books. She had long been displeased with him.<br/><br/>However, most people couldn’t provoke him and chose to endure, so she chose to turn a blind eye.<br/><br/>While other families might fear the Luo family, she didn’t.<br/><br/>Anyone who could work in the library must have some connections at home.<br/><br/>Now this brat had finally met a tough opponent and needed a lesson.<br/><br/>The librarian said seriously, “It’s forbidden to fight and make noise in the library while reading. Book readers must follow the principle of first-come, first-served. Luo Zhiqiang, it was you who took someone else’s book first, right?”<br/><br/>Being suddenly questioned, Luo Zhiqiang’s face turned red and green, justifying himself, “It’s my right to read what I want, so I took her book. What’s it to you? She should have let me read it. Me, a Yamen Bureau Chief’s son, asking her for the book, is looking up to her. It’s her own fault she didn’t seize the opportunity! ”<br/><br/>Everyone had black lines on their faces!<br/><br/>What powerful reasoning!<br/><br/>What brash arrogance.<br/><br/>The administrator’s face darkened, “Alright, since you’re insisting, I’ll call your father and ask him if whatever you set your eyes on should be given to you by Upon hearing that, Luo Pangzi’s face turned pale.<br/><br/>If his father knew about his behavior, he wouldn’t let him go unpunished.<br/><br/>Luo Pangzi, frightened and stuttering, “Auntie, don’t call my dad, call my mom, or my grandparents!”<br/><br/>Usually, he relied on his family’s spoiling and indulgence to act recklessly. The librarian said earnestly, “Sorry, I only have your father’s phone number!”<br/><br/>Upon hearing the administrator had Director Luo’s phone number, the surrounding adults’ eyes lit up.<br/><br/>What does this represent? It means that this person is not simple either.<br/><br/>Otherwise, an ordinary librarian would not have the Yamen Bureau Chief’s phone number..\t\t\t\t\t\t</div>", "images": {}, "success": true}