{"id": 75, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231983.html", "title": "Chapter 75 - Chapter 75: Chapter 75: Seed Station (Part 1)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 75 - Chapter 75: Chapter 75: Seed Station (Part 1)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 75: Chapter 75: Seed Station (Part 1)<br/><br/>Translator: 549690339<br/><br/>When they arrived at the amusement park around 3-4 0’clock in the afternoon, Xiao Jinli and Xiao Siqian frowned when they saw the crowd in the pool, resembling dropped dumplings.<br/><br/>Both of them were clean freaks who didn’t like so many people swimming together.<br/><br/>Xiao Jinli said directly, “Dad, Mom, there are too many people here. I don’t want to swim anymore.”<br/><br/>If she wanted to swim, she would have preferred the creek in the village, which seemed cleaner than this place.<br/><br/>Xiao Siqian also stated, “Uncle, Aunt, I don’t want to swim either!”<br/><br/>Xiao Junxuan took a look and said, “So many people swimming together, it’s better to swim in our village’s creek. More fun.”<br/><br/>Xiao Father and Xiao Mother didn’t feel comfortable seeing so many people swimming together either.<br/><br/>They thought the kids would like it and came here with them. Since the kids didn’t like it, everyone naturally left.<br/><br/>After leaving the amusement park, Xiao Jinli said again that she wanted to go to the library, and Xiao Siqian agreed to accompany her.<br/><br/>Fearing the incidents from the morning would happen again, Xiao Junxuan also wanted to go with them.<br/><br/>Xiao Jinli, ‘<br/><br/>She directly refused, “Brother, if you’re busy, don’t worry about us. Things like bullying don’t happen all the time. Besides, I haven’t suffered any losses since I was a kid. With the strength in my body, even the most aggressive person can’t mess with me. You can rest assured.”<br/><br/>Xiao Junxuan thought about it and said, “Alright, just be careful.”<br/><br/>His visit to Jianggan City wasn’t just for fun. Besides meeting old friends, he also had work and business to discuss.<br/><br/>He knew his sister’s abilities.<br/><br/>Not only was she strong, but she also had great luck. Usually, those who bullied her would end up unlucky first. That’s why the title “Lucky Star” had stuck with her for more than ten years.<br/><br/>Xiao Junxuan told Xiao Siqian, “Xiao Quan, please take care of my sister.”<br/><br/>Xiao Siqian said with slight embarrassment, “Brother Xuan, Jinli is my sister now too. Protecting my sister is my natural duty.”<br/><br/>Moreover, it seemed that Xiao Jinli didn’t need his protection. She could handle many things by herself.<br/><br/>Sometimes Xiao Siqian wondered if Jinli had the mind of an adult in the body of a child.<br/><br/>Xiao Father still accompanied Xiao Mother to the shopping mall.<br/><br/>For women, other than jewelry, there are also clothes and bags.<br/><br/>Xiao Father was happy to accompany his wife to buy these things, paying with his card and carrying the bags behind her.<br/><br/>After Xiao Father and the others left, Xiao Jinli turned to Xiao Siqian and said,<br/><br/>“Brother Little Quan, I don’t want to go to the library now.”<br/><br/>“Huh?” Xiao Siqian looked puzzled. “Then where do you want to go?”<br/><br/>Xiao Jinli said, “I’m not as familiar with this place as the county town. I want to go out and look around!”<br/><br/>Although they had a car at home, they didn’t come to Jianggan City very often. In the past ten years, Xiao Jinli hadn’t visited much.<br/><br/>She was still curious about the outside world.<br/><br/>Xiao Siqian knew that Xiao Jinli was a decisive and opinionated child. She seldom changed her mind with her decisions. He nodded, “Okay, I’ll go wherever you want to go.”<br/><br/>Xiao Jinli didn’t refuse.<br/><br/>Then she took a map of Jianggan City out of her bag. After looking at it, she pointed to a place and said, “Let’s go to the pedestrian street. I heard it’s also a gourmet food street. I want to check it out! ”<br/><br/>“Alright.” Xiao Siqian nodded.<br/><br/>The two of them figured out the route and then went to the bus stop to wait for the bus.<br/><br/>Soon the bus arrived.<br/><br/>Xiao Jinli put in the already-prepared coins, and they found seats to sit down.<br/><br/>Seeing the prepared coins, Xiao Siqian guessed that Xiao Jinli had made enough preparations.<br/><br/>Not long after they got on the bus, Xiao Jinli suddenly saw something and her eyes lit up. She said to Xiao Siqian, “Brother Little Quan, we’re getting off the bus soon!”<br/><br/>“Huh? Getting off?” Xiao Siqian looked at the bus route map and said puzzled, “But we still have five or six stops to go.”<br/><br/>Xiao Jinli pulled him up and led him to the back door, saying, “I saw a place I want to check out.”<br/><br/>Xiao Siqian, “…” Alright, he would accompany his sister to the bitter end.<br/><br/>When they arrived at the station, Xiao Jinli and Xiao Siqian got off the bus. Then Xiao Jinli led Xiao Siqian in the direction the bus had come from.<br/><br/>“…” Xiao Siqian looked puzzled. “Sister, what did you see? We’re going back now.”<br/><br/>Xiao Jinli said, “Seed station!”<br/><br/>“Ah, seed station?” Xiao Siqian didn’t understand, “What seed station?”<br/><br/>Forgive this child from the big city. He truly didn’t know what a seed station was.<br/><br/>Xiao Jinli said, “The seed station is where they sell seeds. I want to see what kind of seeds they have.”<br/><br/>“Ah, I see!” Xiao Siqian nodded in understanding, “Well, let’s go take a look.” He was also curious about what seeds were sold at the seed station.<br/><br/>After walking for about seven or eight minutes, they arrived at the seed station Xiao Jinli had seen.<br/><br/>At the entrance of the seed station, there was a green sign that read “Jianggan<br/><br/>City Agricultural Technology Seed Management Station.”<br/><br/>Inside, there were two or three plainly dressed people looking like farmers choosing red melon seeds. A staff member was explaining the pros and cons of the red melon seeds to them.<br/><br/>The staff member said, “This is a new variety, high yield, large grains, good taste, and it’s already sold hundreds of portions. There are only about fifty or sixty pounds left. If you need a large order, we’ll have to call the breeding company to reserve.”<br/><br/>A tall and thin farmer was doubtful, “The seeds look good, but we don’t know if it’s easy to plant.”<br/><br/>The staff member said, “Don’t worry, we provide seeds, technical consultations, and professional technical guidance. We can help you grow these red melons successfully.”<br/><br/>The two farmers discussed and then decided to buy the remaining red melon seeds. They asked for the phone numbers of the seed station and the technicians and left with their purchases.<br/><br/>Seeing the two children come in, the staff member laughed and asked, “What are you two here for? Are you here to buy flower seeds?”<br/><br/>He didn’t think the two kids would need agricultural seeds.<br/><br/>Xiao Jinli shook her head and said, “Big Brother, we don’t need flower seeds, but we do want to see what kind of seeds there are.<br/><br/>The staff member saw the beautiful and lovely Xiao Jinli and felt a liking for her. He smiled and said, “You are just a child. What do you know about seeds? Why don’t you tell Big Brother what seeds you need, and I’ll get them for you to see. How about that?”<br/><br/>Xiao Jinli politely shook her head and said, “Big Brother, I haven’t decided what seeds I need yet. I just want to take a look first. If I need any seeds, I’ll ask for your help getting them out, okay?”<br/><br/>Polite and lovely children are well-liked by everyone.<br/><br/>The staff member nodded and said, “Alright, I’ll be here sitting. If you need anything, just call me directly, okay?”<br/><br/>The staff member pointed to where they could get water and said, “Do you want to drink some water?”<br/><br/>“No, thank you, Big Brother.. We’re not thirsty!”\t\t\t\t\t\t</div>", "images": {}, "success": true}