{"id": 76, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231987.html", "title": "Chapter 76 - Chapter 76: Chapter 76: Picking Seeds And Buying Seeds (Second Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 76 - Chapter 76: Chapter 76: Picking Seeds And Buying Seeds (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 76: Chapter 76: Picking Seeds and Buying Seeds (Second Update)<br/><br/>Translator: 549690339<br/><br/>There were indeed many seeds at the seed station, not a thousand kinds, but there were several hundred.<br/><br/>Xiao Siqian found out for the first time that there were so many varieties of seeds.<br/><br/>All kinds of seeds were displayed on colorful walls and in transparent cabinets, as well as in the snake skin sack in the center of the room.<br/><br/>These seeds included some common ones, such as rice seeds, watermelon seeds, sorghum seeds, peanut seeds, rapeseed, and various vegetable seeds, among others.<br/><br/>There were also some seeds that were not commonly grown by farmers, such as strawberry seeds, potted gourd seeds, and colorful chili seeds.<br/><br/>Xiao Siqian saw these diverse seeds for the first time and was somewhat interested.<br/><br/>Of course, he wouldn’t grow them; he was just looking.<br/><br/>After looking around, Xiao Jinli went to the staff member who was drinking tea and asked, “Big brother, are all the seeds here?”<br/><br/>The staff member smiled and said, “Yes, almost all the seeds in the seed station are here. Little sister, what seeds do you need? Just tell big brother, and I’ll help you find them.”<br/><br/>Xiao Jinli thought for a moment and said, “Well, I want the latest varieties developed by the Agricultural Research Institute, those that are highly valuable and rare.”<br/><br/>The staff member was taken aback, then laughed out loud, “Little sister, those newly developed varieties have very high technical requirements and are difficult to grow. Are you sure you need them? And, those new varieties tend to be more expensive!”<br/><br/>He didn’t think a child would have so much money from her parents to buy those seeds.<br/><br/>Xiao Jinli looked serious and nodded, “Big brother, can you show them to me?”<br/><br/>Seeing her sincere attitude, the staff member nodded, “Okay, I’ll get them for you to see. But I’m warning you in advance, these seeds are quite precious, so please just look without rubbing or pinching them, as that could easily damage them.”<br/><br/>“Alright, alright, I know, big brother!” Xiao Jinli chimed in.<br/><br/>Then, the staff member took a bunch of keys from the drawer of his workbench and walked to a wooden table. He unlocked one of the drawers, took out a delicate wooden box containing seeds, and showed them to Xiao Jinli.<br/><br/>As he introduced the seeds, he said, “This is the latest seven-color tea flower variety developed by the Agricultural Research Institute, which is a kind of flower seed.<br/><br/>This colorful tea flower seed has been cultivated, but it is very difficult to grow the plant, as the technical requirements are quite demanding. However, once the flower is successfully grown, its value is almost impossible to estimate.<br/><br/>This seed is rare, and our station only got a little bit through the relationship with the Agricultural Research Institute. Originally, a friend of the station master wanted to buy it, so the station master got it.<br/><br/>However, the station master’s friend had an accident and no longer needed the seeds, so they have been left here. No one asked about them, so no one bought them. But since you suddenly asked, I’ll show them to you.”<br/><br/>He didn’t think that Xiao Jinli could afford them.<br/><br/>When Xiao Jinli heard the staff’s introduction, her head slightly lowered and her eyes flashed.<br/><br/>She looked at the staff member and said innocently, “Big brother, I want to buy these seeds, how much are they?”<br/><br/>The staff member was a bit surprised, “You want to buy these seeds, but you should know they are expensive, and they might not even survive when you buy them. If they don’t survive, it would be a huge loss. Little sister, why don’t you think it over? Besides, are your parents willing to give you that much money?”<br/><br/>Xiao Jinli asked again, “Big brother, I want to buy them, can you tell me how much they cost?”<br/><br/>Unable to persuade Xiao Jinli, he looked at Xiao Siqian and said, “Young man, these seeds are too expensive, why don’t you all pick some other seeds to buy?”<br/><br/>Xiao Siqian glanced at the serious Xiao Jinli and looked back at the staff member, “Big brother, my little sister likes them, can you just tell us the price?”<br/><br/>Unable to persuade them, the staff member sighed slightly, “Alright. Let’s do it this way. These seeds are sold by the piece, with one seed costing 1200 yuan. Considering your young age, I’ll give them to you for 1000 yuan each. There are five seeds in one kind, and I’ll sell you two seeds.”<br/><br/>“One thousand yuan per seed is indeed quite expensive.” Xiao Jinli looked at the seeds in the box without surprise, then said, “I want all the seeds.”<br/><br/>“What, all of them?” The staff member was amazed, “Little sister, you’re going to spend 5000 yuan on seeds?”<br/><br/>“Yes, all!” Xiao Jinli nodded definitively.<br/><br/>“No, little sister, are you sure you don’t want to think about it again?” The staff member tried to dissuade her again, “Why don’t you call your parents over and ask for their opinion, alright?”<br/><br/>Xiao Jinli shook her head, “Big brother, this is my own matter, and I can handle At this point, she paused and then said with a smile, “Big brother, are you afraid that I won’t have enough money to pay for these seeds? It should be better to sell more products. But you keep trying to dissuade me.”<br/><br/>The staff member laughed and said, “It’s just that you are all still children. What if you spend money recklessly and get scolded by your parents when you get home?”<br/><br/>In actuality, he was worried that selling such expensive seeds to two children might cause trouble if their parents found out and came to the store angrily.<br/><br/>He couldn’t cheat a child just for some money.<br/><br/>Xiao Jinli smiled and said, “Don’t worry, big brother, since I want to buy these seeds, I’ll definitely have enough money for them. My parents won’t make a fuss about it.’<br/><br/>The staff member, hearing Xiao Jinli’s words, could only laugh and say,<br/><br/>“Alright, I’ll pack them for you.”<br/><br/>Xiao Jinli asked, “Big brother, can I use a card here?”<br/><br/>The staff member nodded, “Yes, you can!”<br/><br/>Then, Xiao Jinli picked out three or four dozen more varieties of seeds, and when it was time to pay, she took out a UnionPay card.<br/><br/>The staff member took the card and swiped it, only to be a bit surprised.<br/><br/>There was actually money in the card.<br/><br/>Still not quite feeling reassured, the staff member asked, “Little sister, whose card is this…”<br/><br/>Xiao Jinli immediately explained, “Don’t worry, big brother, this card is mine. The money in it is the pocket money and New Year’s money my parents gave me.”<br/><br/>The staff member thought to himself, “It seems that this child’s family life is quite good.”<br/><br/>They had spent over 5,600 yuan on seeds.<br/><br/>Apart from the tea flower seeds, the other seeds were not very expensive. Xiao Siqian asked curiously, “Sister, why did you buy so many seeds?”<br/><br/>Xiao Jinli blinked and said, “I bought them to study. Brother Little Quan, don’t tell my parents about the seeds I bought.”<br/><br/>Xiao Siqian was speechless.<br/><br/>Buying seeds for research.<br/><br/>Xiao Siqian asked, “Sister, are you interested in agriculture?”<br/><br/>Xiao Jinli nodded, “Yes, I’m interested!”\t\t\t\t\t\t</div>", "images": {}, "success": true}