{"id": 79, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231999.html", "title": "Chapter 79 - Chapter 79: Chapter 79: The Friendship Is Completely Over! (First Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 79 - Chapter 79: Chapter 79: The Friendship Is Completely Over! (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 79: Chapter 79: The Friendship is Completely Over! (First Update)<br/><br/>Translator: 549690339<br/><br/>After being scolded by Xiao Jinli, Shi Zhu’er’s face turned red with anger. She pointed at Xiao Jinli and said angrily, “What’s wrong with you? How could you be so ill-mannered?”<br/><br/>Xiao’s mother disagreed with these words, saying, “Young lady, I don’t agree with you saying that my Xiao Bao has no manners. Regarding manners, may I ask, young lady, is it courteous to mock and ridicule elders you don’t know, snatch the jewelry we liked, and now worry about us not having money for a meal? Is this your upbringing? Does your family’s education teach you to look down on and ridicule people at will?”<br/><br/>On her own, Shi Zhu’er couldn’t out-argue Xia’s mother and daughter. She stomped her foot and snorted, “Hmph, I’m worried that you’ll come to eat and not have money to pay for the meal, don’t lose face then!”<br/><br/>“Really, thank you for your kindness, young lady!” Xiao’s mother sharply replied, “Even if we don’t have money and have to wash dishes or beg outside, we would never ask you for a penny. So, worry less about us.”<br/><br/>Then, Xiao’s mother looked at Shi Xia, her tone not very pleasant, “Young man, who is this person to you? Why don’t you control her and let her bite people indiscriminately outside?”<br/><br/>Shi Xia’s expression immediately worsened.<br/><br/>As he was about to speak, Xiao Junxuan walked over after parking the car. Seeing Shi Xia and his siblings with their parents, he smiled and said, “What a coincidence, you all met here.”<br/><br/>Then, he introduced them to his parents, “Mom and Dad, let me introduce you, this is Shi Xia, my friend, and this is his sister. They were the ones who invited you to have dinner. Shi Xia, these are my parents, sister, and younger brother.”<br/><br/>However, after introducing them, he noticed that the atmosphere on the scene was a bit odd, especially the expressions of his parents. They looked uncomfortable, and Shi Xia’s siblings’ faces were flushed.<br/><br/>Xiao Junxuan asked in confusion, “What’s going on?”<br/><br/>At this moment, Xiao Jinli smirked and said, “Brother, did you say they invited our family to have dinner?”<br/><br/>“Yes!” Xiao Junxuan was puzzled, “Sis, did something happen?”<br/><br/>Could something have happened while he had gone to the parking lot?<br/><br/>“Oh!” Xiao Jinli revealed a sarcastic expression on her face and said lightly, “This young lady said we’re dressed poorly and can’t afford to eat in this restaurant. She suggested we go eat fast food outside.”<br/><br/>Upon hearing this, Xiao Junxuan’s handsome face immediately darkened.<br/><br/>In just a short while, his family had been insulted by Shi Zhu’er.<br/><br/>Shi Zhu’er was both embarrassed and ashamed, her face flushed. She was about to explain when Xiao’s father spoke up.<br/><br/>Xiao’s father said, “That’s not all. When I took your mom to the shopping mall to buy jewelry, she came up and mocked us for our shabby appearance, thinking we could afford gold and silver jewelry. Didn’t they know how expensive gold is now? Also, when we were in the jewelry store, we liked a necklace and were about to pay for it when she came over and wanted to pay double the price to buy it from the salesperson.”<br/><br/>The more Xiao Junxuan listened, the darker his face became.<br/><br/>He hadn’t imagined that his parents would be insulted by Shi Zhu’er before they even formally met Shi Xia.<br/><br/>Xiao Junxuan stared at Shi Zhu’er with a gloomy face and gritted his teeth, “Miss Shi, do you have a grudge against my parents? Why do you keep targeting them<br/><br/>“Brother Junxuan, I… I…” Shi Zhu’er defended herself in shame, “Listen to me,<br/><br/>Xiao Junxuan waved his hand and said, “Miss Shi, you don’t need to explain anything to me.”<br/><br/>Then he looked at Shi Xia and said, “Mr. Shi, it seems we won’t be able to enjoy this meal.”<br/><br/>The change in address, from Ah Xia to Mr. Shi, marked the end of their friendship.<br/><br/>Shi Xia’s face changed, and he immediately explained, “Ah Xuan, Zhu’er is just reckless, she’s not bad at heart.”<br/><br/>At this moment, Shi Zhu’er hurriedly explained, “Brother Junxuan, don’t blame my brother. It’s my fault. 1…1 didn’t know that uncle and auntie were your parents. I would never have said those things if I had known.”<br/><br/>Xiao Junxuan sneered, “You don’t know they’re my parents? Hehe, Miss Shi, do you mean to say that anyone who looks poor can be insulted by you?”<br/><br/>“No, no, I… I didn’t!” Shi Zhu’er bit her lip, her eyes reddening as she tried to explain, “I… I didn’t know either…”<br/><br/>Xiao Jinli was also quite angry, “You don’t know? Sister, I think you’re not just being nosy, but you’re out of your mind. Two strangers, why did you insult them for no reason? Did they owe you eight million dollars or do something bad under your family’s name that you have to insult them like this?”<br/><br/>Xiao Junxuan also looked at Shi Xia and asked, “Yes, is your sister crazy? What business is she meddling in, concerning herself with other people’s spending?<br/><br/>Did my family ever borrow a dime from her?”<br/><br/>“Brother Junxuan…” Shi Zhu’er blushed with shame.<br/><br/>“No, Miss Shi, please call me Mr. Xiao.” Xiao Junxuan said coldly, “I can’t afford you calling me Brother Junxuan, because we’re not close!”<br/><br/>His family was his bottom line.<br/><br/>No matter if Shi Zhu’er intentionally or unintentionally insulted his parents, she had already touched his bottom line.<br/><br/>Before, he had tolerated her calling him Brother Junxuan for Shi Xia’s sake, but now he couldn’t stand it anymore.<br/><br/>For Shi Xia, they might have been friends in the past, but when he couldn’t control his sister’s mouth and let her insult his parents, the friendship was over.<br/><br/>Shi Xia also secretly regretted it.<br/><br/>How could he have known that things would turn out like this?<br/><br/>His sister randomly talked about some people, and it just happened to be Xiao Junxuan’s parents.<br/><br/>Their true friendship with Xiao Junxuan was based on the purest four years of university.<br/><br/>After graduating, they went their separate ways and rarely kept in touch.<br/><br/>Once out of school and into society, people tend to become more calculating, mostly considering their interests first.<br/><br/>The Shi family opened a small company with over 10 million in worth in Jiang Ganzhou City, and he is the only heir.<br/><br/>Thus, most of the friends he had relationships with were carefully selected.<br/><br/>His choice to become friends with Xiao Junxuan was not only because he recognized Xiao Junxuan’s abilities, and that given the opportunity, he would soar high, but also because his sister fell in love with him at first sight. As a result, he often created opportunities for his sister.<br/><br/>Who could have imagined that this carefully planned friendship would sink so quickly and with such disgrace?<br/><br/>“Mr. Shi, we won’t be able to eat this meal.” Xiao Junxuan said coldly, “I’ll take my parents and siblings to a restaurant.”<br/><br/>Then Xiao Junxuan led his parents and siblings into the restaurant.<br/><br/>Shi Zhu’er, watching Xiao Junxuan’s heartless back, cried in great sorrow,<br/><br/>“Brother, brother, what should I do? Brother Junxuan is ignoring me, wuwu…”<br/><br/>Shi Xia was also angry, “Just let him be. A person from the countryside like him is not worthy of you!”<br/><br/>“So that’s how you’ve always seen me!” Xiao Junxuan suddenly stood behind him, sneering derisively. He had forgotten his cellphone in the car and went back to get it, but he didn’t expect to hear Shi Xia talking about him like that.<br/><br/>Shi Xia,<br/><br/>The friendship was completely broken!\t\t\t\t\t\t</div>", "images": {}, "success": true}