{"id": 73, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231975.html", "title": "Chapter 73 - Chapter 73: Chapter 73: Luo Fatty Gets Taught A Lesson 1 (One More)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 73 - Chapter 73: Chapter 73: Luo Fatty Gets Taught A Lesson 1 (One More)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 73: Chapter 73: Luo Fatty Gets Taught a Lesson 1 (One More)<br/><br/>Translator: 549690339<br/><br/>As it approached noon, Xiao Junxuan and his wife, Xiao Wanshan, arrived at the library to pick up Xiao Jinli.<br/><br/>However, as they arrived at the entrance, they overheard someone discussing how Director Luo’s son had bullied a girl, only to be taught a lesson by her in return.<br/><br/>All three agreed that the girl must be their own Xiao Bao (sister).<br/><br/>Because, ever since she was a child, their sister Xiao Bao has always been strong and would never lose a fight.<br/><br/>But this made them even more anxious.<br/><br/>This was Director Luo’s son after all.<br/><br/>If he is the chief government officer in Jianggan City, his family must certainly hold considerable power.<br/><br/>They were worried about Xiao Bao (sister) getting into trouble.<br/><br/>Even though they were worried, they couldn’t immediately enter and had to wait at the door.<br/><br/>After a while, Xiao Siqian and Xiao Jinli came out.<br/><br/>Seeing them come out, Xiao’s mother immediately looked nervous and asked anxiously, “Xiao Bao, they said that inside the library a chubby kid tried to snatch a book from a girl and wanted to beat her up when he failed. But instead, she beat him up. Was that girl you?”<br/><br/>Xiao Jinli nodded and responded, “Yes, it’s me!”<br/><br/>Xiao’s mother was shocked and asked urgently, “Are you okay then? They say the chubby kid’s family is powerful and influential, and that his parents came later. Child, if something happened, why didn’t you call us?”<br/><br/>Xiao Jinli immediately reassured her, “Mother, don’t worry, I’m fine. The chubby kid’s parents did come, but they were really nice and reasonable. After they arrived, they punished their kid and they even apologised to me.”<br/><br/>Xiao Junxuan looked around subtly and asked, “But I heard that they are powerful and influential, couldn’t their apology be just for public show, and then they take revenge later in private?”<br/><br/>Xiao Siqian responded, “The parent is Director Luo from the Yayi Bureau, he seemed very honest and upright, he probably wouldn’t.”<br/><br/>Xiao Jinli then added, “Yes, he probably wouldn’t. After Director Luo apologized to us, he invited us for a meal, but I declined. Then he left his phone number, saying he could be contacted if needed.”<br/><br/>After hearing this, Xiao’s father paused for a moment and asked, “Director Luo?<br/><br/>Do you mean Luo Sanbiao?”<br/><br/>“It seems that’s his name!” Xiao Jinli added.<br/><br/>Xiao’s father continued, “If it is him, then he wouldn’t be the kind to seek revenge after a conflict. His character is actually quite good.”<br/><br/>Still worried, Xiao’s mother asked, “If he is truly an upright person, then why would his child behave in such a bully manner?”<br/><br/>“…” After thinking about it for a moment, Xiao Jinli replied, “Maybe he’s often busy with work and thus, negligent in disciplining his child. But, he also said that he would properly educate his child after this incident.”<br/><br/>After hearing this, Xiao’s father nodded and said, “Wife, dont worry too much. Let’s wait and see. To him, we’re just nobodies. Perhaps he wouldn’t condescend to take revenge.”<br/><br/>Upon hearing her husband’s words, Xiao’s mother temporarily put aside her worries.<br/><br/>She suggested, “It’s getting late, let’s find a place to eat.”<br/><br/>Meanwhile, after Luo Sanbiao brought back his son Luo Zhiqiang home, the family was both heartbroken and angry at the sight of the boy’s beaten face.<br/><br/>“Oh my, my precious child, who beat you to the point where your face is bright red from swelling? I’m going to find them and demand an explanation.”<br/><br/>Both of the women, one calling him precious and the other darling, were moved to tears by their distress.<br/><br/>Although Grandpa Luo didn’t express his feelings obviously, his facial expression showed that he was distressed too.<br/><br/>Madam Luo immediately found some anti-swelling medication in the house to apply to Luo Zhiqiang. As the medication was being applied, Luo Zhiqiang grimaced in pain, causing the two women in the house to ache for him even more.<br/><br/>Grandma Luo scolded angrily, “Just who was the heartless person that beat up my grandson? Don’t they know the status of my precious grandson?”<br/><br/>Only then did Luo Sanbiao understand why his son, at such a young age, was already acting high and mighty, bullying others with his authority.<br/><br/>Luo Zhiqiang cried loudly in a wronged manner, and sobbed, “Grandma…it was dad who beat me up. He hit me because of a stranger!”<br/><br/>“Ha, it was your dad?”<br/><br/>Upon hearing Luo Zhiqiang’s words, both Madam Luo and the others were shocked, as they all then gazed at Luo Sanbiao.<br/><br/>Luo Sanbiao wore a frustrated expression and yelled, “Yes, it was me! I’ll tell you, this stinking kid deserves to be beaten up!”<br/><br/>“Okay Luo Sanbiao, so it was you who beat up our precious son…you… I’ll fight you to the death!” Madam Luo charged at Luo Sanbiao and started to hit him all over his body. She cried as she scolded, “You jerk, have you lost all your humanity – to even beat your own son, and to beat him so badly. Oh…l feel so much pain.”<br/><br/>Grandma Luo also turned around and started berating Luo Sanbiao, “You useless boy, what has my precious grandson ever done to you for you to be so cruel and heartless. My poor grandson, his face is swollen red, he must be in terrible pain.”<br/><br/>At that point, Grandpa Luo picked up a stick from the corner and started hitting Luo Sanbiao. As he was hitting him, he sternly said, “Since you can hit your son, then I can hit my own son too!”<br/><br/>Dodging his father’s stick, Luo Sanbiao shouted loudly, “Dad, Dad, listen to me!”<br/><br/>However, his father ignored him.<br/><br/>Looking at his family, who were overly indulgent to his child, Luo Sanbiao thought about what Xiao Jinli had said and made a decision.<br/><br/>He grabbed the stick from his father and said sternly, “Enough! Have you all had enough of your fussing?”<br/><br/>Upon seeing the sudden stern expression on his husband’s (son’s) face, everyone was shocked and stopped in their tracks, their faces showed surprise.<br/><br/>Throwing away the stick in his hand, Luo Sanbiao shouted, “Is this the way you pamper this child of yours? You are unconditionally protecting and spoiling him without investigating right from wrong, without asking about the truth of the issue. Do you know the consequences of pampering him in this way? It’s overindulgence! It’s because of your overindulgences that he dares to act like a tyrant out there, causing troubles! How is this, do you wish to ruin him in the name of expressing your love for him?”<br/><br/>Upon hearing Luo Sanbiao’s words, their expressions changed.<br/><br/>Watching their changing faces, Luo Sanbiao continues, “And do you know what he did today? Fine, I’ll tell you. He went to the library and tried to snatch a book from a little girl to read. The little girl, who’s just over ten years old, didn’t want to give the book to him, so he wanted to beat her up.<br/><br/>“But that girl fights back, and he still boasts shamelessly that his dad is me, Luo Sanbiao, the director of the Yayi Bureau. He threatened that if the girl didn’t let him read the book, he’d have her locked up! Do you see what kind of things he’s been doing?”<br/><br/>However, Grandma Luo said in a low voice, “It’s just a book. If our boy wants to read it, shouldn’t the girl give it to him?”<br/><br/>Upon hearing Grandma Luo’s comment, Luo Sanbiao was furious. He shouted angrily, “Mom, will you only be satisfied if I’m ruined?”<br/><br/>Upon hearing this, Grandma Luo was taken aback and stuttered, “What? How could that possibly happen?”\t\t\t\t\t\t</div>", "images": {}, "success": true}