{"id": 72, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231971.html", "title": "Chapter 72 - Chapter 72: Chapter 72: Minor Shopping Mall Incident (Second Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 72 - Chapter 72: Chapter 72: Minor Shopping Mall Incident (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 72: Chapter 72: Minor Shopping Mall Incident (Second Update)<br/><br/>Translator: 549690339<br/><br/>On the other side, Father Xiao took Mother Xiao to the largest shopping mall in Jianggan City.<br/><br/>They were not strangers to this city since they had visited Jianggan City before.<br/><br/>Father Xiao just wanted to stroll around with his wife and buy her any beautiful clothes, skirts, or jewelry that caught his eye.<br/><br/>Looking at his wife’s smooth forehead, Father Xiao suddenly said earnestly,<br/><br/>“Wife, I feel like you’re missing something!”<br/><br/>Mother Xiao was perplexed and asked, “What?”<br/><br/>“Beautiful jewelry!” Father Xiao said seriously, “Aren’t all women fond of gold and silver jewelry?”<br/><br/>Mother Xiao was taken aback. When had she ever said she liked these things?<br/><br/>Feeling somewhat helpless, Mother Xiao replied, “That won’t be necessary. The jewelry box you bought is already full of gold and silver jewelry.”<br/><br/>“Is it full?” Father Xiao said matter-of-factly, “Then, let’s buy another jewelry box. ”<br/><br/>“…” Mother Xiao replied, “No need, it’s too extravagant.”<br/><br/>“It’s only natural for a man to earn money and for a woman to spend it,” Father Xiao declared boldly. “Rest assured, wife, I may not be very capable, but I can certainly afford to buy you gold and silver jewelry. Come, let’s go take a look.” As soon as he finished speaking, a snicker could be heard from behind.<br/><br/>Then, someone mocked, “Bro, listen to this guy bragging about things he can’t afford. Hee hee… Dressed like a pauper and still dreaming of buying gold and silver jewelry. Doesn’t he know how expensive gold is these days?”<br/><br/>Xiao Wanshan and Mother Xiao turned around and saw an eighteen or nineteen-year-old girl in a pink skirt, clinging to a man in his mid-twenties, jeering at them.<br/><br/>Hearing this, Xiao Wanshan became infuriated. Just as he was about to lash out, Mother Xiao quickly pulled him back and placated him. “Husband, let it go, she’s just a young girl. You shouldn’t hold a grudge against her. Didn’t you say you were going to buy me gold and silver jewelry? Let’s go now!” After all, she was just a child, and they shouldn’t stoop to her level.<br/><br/>Only Mother Xiao could tame Father Xiao’s temper.<br/><br/>Mother Xiao quickly took Father Xiao to a jewelry store in the shopping mall.<br/><br/>Seeing them actually heading to a jewelry store, Shi Zhu’er, the girl who had mocked them, stomped her foot in anger and said to her brother, “Brother, come, accompany me to buy jewelry!”<br/><br/>At his sister’s words, Shi Xia was momentarily speechless, “Sister, why do you care about their business? Whether they have money or not has nothing to do with you. There’s no need for you to get angry over it.”<br/><br/>Shi Zhu’er said petulantly, “But I can’t stand people who pretend to be richer than they are. They obviously don’t have much money, yet they spend it lavishly.”<br/><br/>Shi Xia frowned and advised, “Sister, it’s their money, not yours, why should you care?”<br/><br/>“Come, follow me to see!” Shi Zhu pulled her brother along to the same jewelry store.<br/><br/>Shi Xia,<br/><br/>Upon entering the jewelry store, Father Xiao and Mother Xiao went straight to the gold section.<br/><br/>Well, when men choose jewelry, the bigger and heavier, the better.<br/><br/>Father Xiao picked out a thick necklace and said, “Wife, this necklace is good, let’s buy this one.”<br/><br/>Mother Xiao rolled her eyes, retorting disgruntledly, “It’s ugly. You’re the only one who thinks this necklace looks good.”<br/><br/>With such a thick chain, it’s as if we’re second-rate gangsters on the street, or more like those overnight millionaires mentioned on TV, who only flaunt their wealth without having any taste!<br/><br/>But Xiao’s father defended, “But this necklace is thick.”<br/><br/>Xiao’s mother chided with a smile, “It’s not like we’re buying it to leash a dog, and you’re concerned about its thickness. When we women buy necklaces, we look for what’s appropriate and beautiful, not how thick it is.”<br/><br/>Xiao’s father appeasingly responded, “Alright, wife, I’ll buy for you, you choose. choose. No matter which one you pick, I’ll buy it for you. Oh, right, when buying a necklace, we must also buy a pendant, otherwise what’s so attractive about just a chain?”<br/><br/>The waitress had come up earlier and began to promote their products to them, patiently introducing each necklace and pendant.<br/><br/>After a while, Xiao’s mother selected a necklace and a pendant.<br/><br/>Xiao’s father immediately called out, “Come on, tell us how much these are!”<br/><br/>The waitress immediately took the calculator and said, “The gold price is 285 per gram, this necklace is fifteen grams, the processing fee is 15 per gram, which adds up to 4500 yuan. The pendant is 5-53 grams, the processing fee is 22 per gram, which adds up to 1697-7 yuan. So the total cost is 6197-7 yuan. Today our store is having a promotion, offering a 95% discount, so the discounted price is 5972.7 yuan. Sir, are you paying in cash or by card?”<br/><br/>Just when Xiao’s father was about to say by card, Shi Zhu’er who had just ridiculed them suddenly appeared behind them again and loudly said, “I want a necklace and pendant like these too, are there any more?”<br/><br/>Xiao’s mother frowned slightly.<br/><br/>The waitress said somewhat awkwardly, “I’m sorry, madam, we only carry one of each design in our store. Why don’t you take a look at our other styles? We have many other beautiful designs that are more suitable for young ladies like you.”<br/><br/>But Shi Zhu’er replied, “Who said I’m buying it for myself? I’m buying it for my mother. I just happened to like these two designs.” She definitely doesn’t want something so old-fashioned.<br/><br/>She then suddenly raised her voice, “How about this, I will offer double the price for the necklace and pendant in their hands!”<br/><br/>Shi • Xia• ,   Little sister, that’s not how to spend money either.<br/><br/>Xiao Wanshan’s face darkened, a brewing rage flashed across his face. He pointed at Shi Zhu’er and bellowed, “Little girl, you’re doing this on purpose, aren’t you? Out of all the jewelry here, you just had to want the ones we picked?”<br/><br/>Ignoring his angry outburst, Shi Zhu’er wore a triumphant smile and laughingly said, “Yes, uncle, I did it on purpose. If you can, why don’t you pay double the price too? If you do, I won’t compete with you.”<br/><br/>Instead of getting angry, Xiao Wanshan laughed upon hearing her words and said, “Oh, double? Why would I pay double for something I can get cheaper? My money didn’t just fall out of the sky.”<br/><br/>After a moment’s pause, he skeptically turned to the waitress and Shi Zhu’er, “Oh, I see. Is this your store? You want to dupe customers this way, is that it? If you can sell at double the price, of course, you’d make more than double the profit. So, you want to scam as many customers as you can, isn’t that right?”<br/><br/>The waitress’s face changed instantly, she hastily replied, “Sir, you misunderstood. We don’t know this lady at all, she has nothing to do with our store.”<br/><br/>This was a question of the store’s credibility and reputation, a clarification was necessary.<br/><br/>Then, she turned to Shi Zhu’er and said, “I’m sorry, madam, since these two customers were interested in them first, no matter how much you offer, if they want to buy, we have to sell to them.”<br/><br/>Upon hearing the waitress’s explanation, in order to avoid further trouble, Xiao’s mother swiftly pulled Xiao Wanshan and said “Husband, let’s pay. After we pay, we’ll leave.”<br/><br/>Xiao Wanshan didn’t want to engage in a meaningless dispute with a young girl. He took out his card, swiped it, took the items and left.<br/><br/>Shi Zhu’er was left behind, fuming and staring at their receding figures.<br/><br/>Xiao Wanshan glanced at her from the corner of his eye and said to Xiao’s mother, “That girl is really inexplicable. Is her brain not working properly?” Xiao’s mother shook her head and said, “Who knows?”<br/><br/>Shi Zhu’er and Shi Xia, “…” Who’s the one that’s not normal? They are the ones who are not normal..\t\t\t\t\t\t</div>", "images": {}, "success": true}