{"id": 78, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14231995.html", "title": "Chapter 78 - Chapter 78: Chapter 78: Encountering Someone With An Abnormal Mind (Second Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 78 - Chapter 78: Chapter 78: Encountering Someone With An Abnormal Mind (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 78: Chapter 78: Encountering Someone With an Abnormal Mind (Second Update)<br/><br/>Translator: 549690339<br/><br/>Xiao Junxuan went to the zoo to pick up his parents, and then went to the library to pick up his sister and the others.<br/><br/>Xiao Junxuan looked at his dad and asked suspiciously, “Dad, you took mom to the zoological park?”<br/><br/>Xiao Father said loudly with some guilt, “You little brat, what’s wrong with me taking your mom to the zoo? We can’t go to the zoo?”<br/><br/>After taking his wife away from the beauty salon and walking halfway, he didn’t know where to go. He looked up and saw the big, shiny words “Jianggan City Zoo” on the opposite side, so he went to the zoo with his wife.<br/><br/>Xiao Junxuan said, “I’m not saying you guys can’t go to the zoo. I’m just wondering why you didn’t take my sister with you. It seems like she hasn’t been to the zoo before!”<br/><br/>Xiao Mother also realized and said, “Yeah, how come we didn’t bring Xiao Bao with us to the zoo?”<br/><br/>Xiao Father, “…” At that time, he just wanted to go around with his wife alone, not thinking about bringing an extra, oh, two light bulbs along.<br/><br/>“Ahem,” Xiao Father said, “Ask Xiao Bao later if she wants to go to the zoo in the afternoon. But I think Xiao Bao doesn’t want to go. If she wants to, she’ll say it herself.”<br/><br/>Xiao Mother followed up, “Whether Xiao Bao wants to go or not, let’s ask her later.”<br/><br/>On the other side, after buying seeds at the seed station, Xiao Jinli went to the pedestrian street according to plan.<br/><br/>But after tasting a few so-called gourmet food items on the pedestrian street, her brows furrowed.<br/><br/>She said, “Gourmet food? The taste isn’t even half as good as what my mom makes.’<br/><br/>Xiao Siqian said with a smile, “Auntie’s cooking skills are very high. Ordinary people can’t compare with the food she makes. Sister, I guess you’re used to eating the dishes auntie makes, so when you eat outside, you become more picky about the taste.+”<br/><br/>With that, he looked at the crowded crowd ahead and asked, “So do we keep trying gourmet food?”<br/><br/>Xiao Jinli raised her hand to check the time, then shook her head and said, “No, we have to hurry back to the library. My brother and them are coming to pick us up for dinner.”<br/><br/>Xiao Siqian looked at her stomach and asked with a smile, “You just ate a lot. Can you still eat more?” Don’t be exposed!<br/><br/>Xiao Jinli waved her hand and said, “Don’t worry, my appetite is quite good. The little bit I ate just now only filled my stomach.”<br/><br/>Xiao Siqian nodded, “Alright, let’s go. We still have to catch the bus, in case we wait too long and they…” It would be interesting to get caught.<br/><br/>Xiao Jinli shivered, took Xiao Siqian’s hand, and walked quickly back, “Let’s go, hurry, we can’t miss the bus.”<br/><br/>Xiao Siqian walked behind Xiao Jinli, looking at their tightly clasped hands, a little hand holding a big hand, with a doting and gentle gaze in his eyes.<br/><br/>The two hurriedly caught up, and when they reached the entrance of the library, Xiao Junxuan arrived in his car.<br/><br/>Seeing the two of them waiting at the entrance, Xiao Junxuan asked with a smile, “Oh, why are you guys out so early today?”<br/><br/>Xiao Jinli calmly said, “We watched the time and came out. We just came out, and you guys were here.”<br/><br/>After the two of them got in the car…<br/><br/>“Ahem…” Xiao Father suddenly asked, “Xiao Bao, do you want to go to the zoo?<br/><br/>Do you want Dad to take you to the zoo in the afternoon?”<br/><br/>Xiao Jinli refused without thinking, “No!”<br/><br/>It’s a joke. If she wanted to see animals, she might as well go to Red Peak Mountain. What kind of animals weren’t there?<br/><br/>Well, she hadn’t seen many fierce animals besides tigers and wolves.<br/><br/>“Why not?” Xiao Father immediately said, “Let me tell you, that zoo has all kinds of animals, tigers, lions, peacocks, ostriches, elephants, camels, and the adorable national treasure giant pandas. Don’t you want to see them? You don’t know how beautiful a peacock’s tail display is when you see it with your own eyes, and the white crane’s flight… ‘<br/><br/>After hearing Xiao Father’s introduction, Xiao Jinli had an idea and thought,<br/><br/>“Indeed, there are many animals I haven’t seen. Not now, even in her previous life, she hadn’t seen these animals. She had only heard about them in museums.”<br/><br/>After all, in the harsh environmental changes on Blue Star, many animals had gone extinct.<br/><br/>Those paleontological experts could only see the appearance of animals after examining and restoring them.<br/><br/>Xiao Jinli thought for a moment and said, “Okay, let’s go to the zoo this afternoon.’<br/><br/>Once Xiao Jinli agreed, Xiao Junxuan laughed out loud.<br/><br/>Xiao Jinli looked puzzled and asked, “Brother, what are you laughing at?”<br/><br/>“Hahaha…” Xiao Junxuan couldn’t help but laugh and said, “You don’t know.<br/><br/>Mom and Dad went to the zoo this morning and left you behind.”<br/><br/>Xiao Jinli, ‘<br/><br/>Xiao Father glared at Xiao Junxuan with a black face and scolded, “If you don’t talk, no one will treat you like a mute!”<br/><br/>Xiao Mother covered her mouth and laughed, “Hahaha, since Xiao Bao wants to go, it’s not a big deal to go again. After all, we didn’t finish the tour in the morning. The zoo is quite big.”<br/><br/>Xiao Father nodded, “Yes, let’s go again.”<br/><br/>Anyway, he was a hen-pecked husband. Whatever his wife said went.<br/><br/>When Xiao Junxuan brought the group of people to the entrance of the Friendship Restaurant, he went to park the car.<br/><br/>But he didn’t know that as soon as he left, Shi Xia and Shi Zhu’er walked out of<br/><br/>the restaurant.<br/><br/>As soon as Shi Zhu’er came out, she saw Xiao Father and Xiao Mother standing at the door, frowning.<br/><br/>She walked over and asked directly, “Hey, what are you doing here?” She sounded impolite.<br/><br/>Xiao Jinli and Xiao Siqian looked at each other confusedly.<br/><br/>Facing this girl with an abnormal mind, Xiao Father’s face was also not looking good as he said, “This is a restaurant, of course, we came here to eat. How is it any of your business where we eat?” Xiao Jinli frowned and asked, “Dad, do you know each other?”<br/><br/>Xiao Father shook his head, “I don’t.”<br/><br/>At this point, Shi Zhu’er said, “Don’t think just because you can afford gold ornaments, you can spend money lavishly. You don’t look like rich people at all. Don’t you know how much it costs to eat here? Let me tell you, if it’s a little worse, it’s several hundred yuan, if it’s a little better, it’s thousands. I advise you not to show off, go to the fast-food spot outside, and eat some fast food. The most expensive fast food is only twenty-five yuan per serving.”<br/><br/>Xiao Father and Xiao Mother, ‘ … This girl really has a problem with her brain.<br/><br/>Xiao Jinli, ‘<br/><br/>She looked up at Shi Zhu’er and asked with a smile, “Miss, do you live by the sea?”<br/><br/>“What sea?” Shi Zhu’er didn’t react, “My home is in Jianggan City, in the Rich<br/><br/>District.”<br/><br/>Xiao Jinli narrowed her eyes slightly and said coldly, “Since your home is not by the sea, why are you being so nosy? Whether my family has money or not to eat has nothing to do with you. I don’t need you to worry about it.”<br/><br/>Shi Zhu’er, .\t\t\t\t\t\t</div>", "images": {}, "success": true}