{"id": 83, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14235611.html", "title": "Chapter 83 - Chapter 83: Chapter 83: The House Has Great Potential For Value Appreciation In The Future (Part 1)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 83 - Chapter 83: Chapter 83: The House Has Great Potential For Value Appreciation In The Future (Part 1)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 83: Chapter 83: The House Has Great Potential for Value Appreciation in the Future (part 1)<br/><br/>Translator: 549690339<br/><br/>At night, Xiao Jinli flashed into the space again.<br/><br/>She opened the wooden box and saw five camellia seeds inside, her eyes flashing.<br/><br/>Little Zhi circled the seeds and asked, “What kind of seeds are these? Their vital energy seems a bit weak. They probably wouldn’t survive in a common environment. Only here in this space, they might have a chance.”<br/><br/>Xiao Jinli asked, “Are these seeds really weak?”<br/><br/>Little Zhi nodded and said, “Well, they are not very weak, just a little bit. Master, what kind of seeds are these? They don’t seem ordinary.”<br/><br/>Xiao Jinli smiled and said, “Indeed, they’re not ordinary. According to the staff at the seed station, these seeds are a new breed developed by the Agricultural Research Institute. Whether they can be successfully cultivated is unclear. These are colorful camellia seeds. If they survive, they will be of high value. But for now, I’m not sure about their worth. However, I do want to cultivate them.’ Of course, planting in this space is not a problem.<br/><br/>After cultivating them in the space, they have to be transplanted outside to realize their value.<br/><br/>Otherwise, if they just remain in this space, who will admire them, only herself, Little Zhi and Little Space?<br/><br/>That’s not her intention.<br/><br/>Little Zhi said, “Of course, it’s no problem to cultivate them with Little Space’s help. As long as the seeds are not completely lifeless, Little Space can make them grow. Master, you can rest assured.”<br/><br/>Xiao Jinli nodded and said, “You’re right about that. But I plan to transplant them outside when they sprout.”<br/><br/>Little Zhi rolled his eyes in a very human-like way and said, “If they’ve sprouted, there will be no problem surviving outside. All you need to do is water them with Lingquan water every day.”<br/><br/>After that, Xiao Jinli directly tossed the seeds onto the ground, and then water from the river in the space poured down on them like a beam of light.<br/><br/>Little Zhi nodded and said, “The seeds have been sown. Now we just wait for them to sprout and grow.”<br/><br/>Xiao Jinli instructed Little Zhi, “Keep an eye on them, and let me know as soon as they sprout.”<br/><br/>Little Zhi, realizing the importance Xiao Jinli gave to these seeds, nodded and agreed, “Okay, I will keep a close watch.”<br/><br/>After that, Xiao Jinli left.<br/><br/>That day, Xiao Siqian, very curious about where Xiao Father and Xiao Junxuan worked, followed them.<br/><br/>He rode with them in their car to the county town, then entered the industrial park in the county town, and stopped in front of a fairly large company.<br/><br/>As soon as the security guard at the security room saw their car, he immediately opened the gate, calling out respectfully, “President Xiao, Little President Xiao!”<br/><br/>Xiao Junxuan parked the car in the parking lot. Xiao Siqian stood in front of the company, looking at the shiny characters: Xiaoli Clothing Co., Ltd!<br/><br/>Upon seeing the company name, Xiao Siqian understood its meaning.<br/><br/>But he couldn’t help asking, “Uncle, did you and Brother Xuan start this company?”<br/><br/>Xiao Wanshan nodded and said, “Yes, we started this company.”<br/><br/>Xiao Siqian said, “Uncle, you and Brother Xuan are really amazing.”<br/><br/>Xiao Junxuan was a recent college graduate, yet Xiao Wanshan originated from a rural farming background.<br/><br/>The company must have been established solely by him, judging by its scale.<br/><br/>At first glance, the company seemed quite large.<br/><br/>The building at the front was a villa-style five-story office building.<br/><br/>Behind the office building were two three-story factory buildings and workshops.<br/><br/>In front of the office building was a four-story dormitory for employees.<br/><br/>This scale indicated the total assets of the company to be over ten million.<br/><br/>Who could think that two people who return home to work in the fields every day own such a large company in the county?<br/><br/>Xiao Siqian quirked his lips and said, “Uncle, your company is quite large. How many people are in the company?”<br/><br/>Xiao Wanshan replied, “Currently, more than 300 people. Business is hard these days, and staff turnover is high.”<br/><br/>Xiao Siqian nodded and asked, “Did you rent or build this factory building?”<br/><br/>“Rented!” Xiao Wanshan said, “At the beginning, I thought about building our own factory, but after calculating the cost and the cash flow at hand, renting was more cost-effective.’<br/><br/>“How long is the lease?” Xiao Siqian asked again.<br/><br/>“The contract is for ten years!” Xiao Wanshan did not hide, “We have already rented for six years, but the rent is getting higher and higher!”<br/><br/>When they first started the company in the industrial park, the place was very<br/><br/>bleak with few factories and companies, so naturally, it was difficult to rent out spaces.<br/><br/>As soon as there was someone willing to rent, the rent would be relatively cheap.<br/><br/>When he rented these places, the rent was four hundred thousand a year, increasing by 10% every year, and this year’s rent was six hundred and fifty thousand.<br/><br/>However, with the development of the industrial park and more companies moving in, the value of these spaces also went up and the rent became increasingly expensive.<br/><br/>Earlier, the developer sent someone to say that the rent was too low. So, next year’s rent must be increased to one million.<br/><br/>After hearing Xiao Wanshan’s words, Xiao Siqian nodded and said, “The price of a house will definitely rise in the future, and the house has a large space to appreciate.”<br/><br/>Xiao Wanshan was taken aback, and he looked at Xiao Siqian and asked, “Little<br/><br/>Quan, what did you just say?”<br/><br/>Xiao Siqian repeated his words, saying, “I said that the price of this house will definitely rise in the future, and the house has a large space to appreciate.”<br/><br/>Xiao Wanshan clapped his hands suddenly and laughed, “Exactly, why didn’t I think of that? Let’s go, Little Quan, Uncle will take you to my office!”<br/><br/>Xiao Siqian looked at Xiao Wanshan’s reaction and smiled faintly.<br/><br/>Xiao Wanshan did have a business mind. At a casual comment from him, he immediately caught on.<br/><br/>Enthusiastically, Xiao Siqian followed Xiao Wanshan to the general manager’s office.<br/><br/>Xiao Wanshan’s office was not very large, but it was still about twenty to thirty squares. There was a redwood desk, a sofa seat, blue and white striped curtains, and a bookcase.<br/><br/>Xiao Siqian said with a laugh, “Uncle, your office is quite spacious!”<br/><br/>Xiao Wanshan said, “It’s just average.”<br/><br/>At this point, Xiao Wanshan curiously asked, “Little Quan, tell me why you think the house has a large space to appreciate.”<br/><br/>Xiao Siqian contemplated before saying, “As China’s economic level improves, people’s living standards become better and better, and the demand for housing will continue to increase.<br/><br/>Secondly, as China’s population gradually shifts from rural to urban areas, more and more people settle in the cities, which also leads to a continuous increase in the demand for city housing.<br/><br/>The third and most important point is due to inflation. The Consumer Price Index keeps rising, and the prices of all kinds of goods, including agricultural products, keep getting higher. According to scientific evidence, the rise in the prices of goods, especially food, will drive up house prices. For example, the rise in oil prices over the past few years has been inflating like a snowball.<br/><br/>Prices are rising, even for radishes and green vegetables.. There’s no reason why house prices wouldn’t rise!”\t\t\t\t\t\t</div>", "images": {}, "success": true}