{"id": 82, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14235610.html", "title": "Chapter 82 - Chapter 82: Chapter 82: Building The Greenhouse (Second Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 82 - Chapter 82: Chapter 82: Building The Greenhouse (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 82: Chapter 82: Building the Greenhouse (Second Update)<br/><br/>Translator: 549690339<br/><br/>Our backyard is about four or five parts large.<br/><br/>Knowing that her daughter wanted to use it, Xiao Mother cleared everything out of the field for her daughter to use.<br/><br/>According to Xiao Jinli’s request, a fence was built around it and a greenhouse had to be set up.<br/><br/>“Why do we need to set up a greenhouse, Jinli?” Xiao Father asked with a puzzled expression, “With a greenhouse, rainwater and sunlight will be an issue.”<br/><br/>Xiao Jinli said, “Well, I’ve looked through the books, the ones on agriculture. Planting crops in a greenhouse is better for research. Because the greenhouse has controllable factors, and without a greenhouse, it is difficult to control things like rainwater and sunlight.”<br/><br/>In fact, the greenhouse was set up to prevent some uninvited guests from entering, such as rats and snakes.<br/><br/>Hearing this, Xiao Father nodded and said, “Okay, as long as Jinli has her own considerations!”<br/><br/>For the fence, Xiao Father and Xiao Junxuan went into the bamboo grove and cut down more than a dozen yellow bamboo, along with some fir branches.<br/><br/>Adding fir branches was meant to make the fence more secure.<br/><br/>After cutting down the yellow bamboo, it was sawed into sections with a length of about 1.2 to 1.5 meters each.<br/><br/>The sawed short yellow bamboos were then split in half with a machete.<br/><br/>However, for the fence, bamboo strips were needed.<br/><br/>Bamboo strips are the green skin layer of yellow bamboo. When peeled off and soaked in hot water, they become more flexible and stronger.<br/><br/>It took a family less than a day to set up a fence.<br/><br/>Afterwards, Xiao Father found someone to set up a greenhouse according to Xiao Jinli’s requirements.<br/><br/>When the person who built the greenhouse found out that it was for a child, they thought it was ridiculous.<br/><br/>Not only did they doubt that a ten-year-old child could cultivate anything, but they also thought that the effort to set up a greenhouse was just a waste of money.<br/><br/>When the villagers heard that the greenhouse was for Xiao Jinli’s research, all of them were curious and came to take a look.<br/><br/>Hearing the people who built the greenhouse talking, some unhappy villagers said, “Why do you care if Xiao Wanshan wants to let their child play with it?” “Yeah, it’s just five parts of land, it can’t grow that much.”<br/><br/>The person who set up the greenhouse, “…” Not only did the employer find it ridiculous, but the people in the village were also confused.<br/><br/>Is five parts of land a small amount?<br/><br/>If five parts of land were used to grow rice, at least several hundred kilograms of grain could be harvested.<br/><br/>If used to grow other vegetables, it could feed a family for a year.<br/><br/>And, what does a ten-year-old child know about planting?<br/><br/>Of course, the person who set up the greenhouse simply muttered under his breath and didn’t bother to argue with them.<br/><br/>Everyone here thinks it’s nothing, so why should we worry about it?<br/><br/>The cost of the greenhouse is calculated based on its size, and at five parts, it is more than 300 square meters. Also, the construction uses a glass greenhouse framework, costing 32 yuan per square meter.<br/><br/>Thus, the total cost is sixteen or seventeen thousand.<br/><br/>However, because the person Xiao hired to build the greenhouse was familiar with them, the change was removed and it was charged for ten thousand.<br/><br/>The boss of the greenhouse business always wondered why they spent so much money just to cater to a child’s whims; it was simply a waste of money.<br/><br/>Xiao Wanshan’s family really has money, spending such a large amount on a child’s whim and not finding it heartbreaking, instead, they are happily cheering.<br/><br/>After the greenhouse was set up, many villagers came to visit.<br/><br/>In this era, greenhouses were still a rare sight for rural people.<br/><br/>Generally, only those large-scale vegetable growers would choose to build greenhouses, and the people of Xiao Family Village did not engage in commercial activities, so they had little chance to see them.<br/><br/>“This greenhouse is really nice. It’s made of glass. Wanshan, what kind of research does Jinli want to do that requires such a large setup?” Xiao Changchun asked with confusion.<br/><br/>Xiao Wanshan shook his head and said, “Actually, I’m not quite sure either. Xiao Bao said she wants to explore agricultural research and use a piece of land at home for her studies.’<br/><br/>“Ah, Jinli wants to focus on agricultural research.” The villagers, hearing Xiao Wanshan’s response, were somewhat puzzled.<br/><br/>“Jinli is really ambitious. At such a young age, she has already set goals for herself.<br/><br/>“Exactly. Having aspirations, goals, and dreams makes a child more motivated.”<br/><br/>“At such a young age, Jinli has ambitions. She is bound to be successful in the future and become an agricultural expert.”<br/><br/>“Right, maybe Jinli can become the second Father of Rice in the future.”<br/><br/>“No, you’re wrong, it should be the Mother of Rice.”<br/><br/>“Haha… ”<br/><br/>Xiao Wanshan, however, humbly said, “The child is still young; how can we tell what she has in mind? I don’t expect her to have great ambitions or achievements. I just hope that she can live peacefully until she grows old.” “Jinli is our Lucky Star, with God of Fortune’s protection, she will definitely live a safe and peaceful life. Wanshan, you don’t need to worry.”<br/><br/>“Yeah, Wanshan, Jinli is a Lucky Star, you are unnecessarily worrying.” Hearing everyone’s words, Xiao Wanshan just shook his head.<br/><br/>As a parent, how could one not worry about their children?<br/><br/>It’s just that his daughter, Jinli, has been luckier than others since birth. But does that mean parents should stop worrying?<br/><br/>After the greenhouse was set up, the family loosened the soil, and then let Xiao Jinli do whatever she wanted.<br/><br/>Xiao’s mother said that for these seeds, besides pumpkins, wax gourds, sponge gourds and other large vine plants, which could be planted directly into small pits, things like cabbage and Chinese cabbage should be grown from seedlings first, and then transplanted once they reached a certain height.<br/><br/>Upon hearing this, Xiao Jinli asked her mom to prepare several seedling beds.<br/><br/>She took out a plastic bag, which was filled with ordinary seeds.<br/><br/>Xiao’s mother looked at the pile of seeds and asked, “Xiao Bao, how many seeds did you buy? Do you want to plant all these seeds? But Xiao Bao, some seeds are not in season right now. It is July, and some plants may not survive if planted now.”<br/><br/>Xiao Jinli looked at the seeds in her hand and said, “Then Mom, let’s just plant the in-season seeds.”<br/><br/>As for the out-of-season ones, she would first sow them in the space, and when they grew to a certain size in the space, she would transplant them out.<br/><br/>Later, with the help of her mother, Xiao Jinli started by planting some ordinary seeds, like cabbage, Chinese cabbage, and radishes.<br/><br/>After a while, as if Xiao Jinli’s mom remembered something, she laughed and said, “Ah, I’m wrong, Xiao Bao. We have built a greenhouse. Many off-season vegetables and fruits can be grown inside the greenhouse. Otherwise, where would we get so many off-season vegetables and fruits? Hehe, I didn’t think of that just now.”<br/><br/>Xiao Jinli, ‘<br/><br/>She just wanted an excuse to plant these seeds and didn’t think too much about the rest.<br/><br/>But now that her mother mentioned it, having different unexpected things growing in her greenhouse would seem natural.<br/><br/>Xiao Jinli was instantly relieved. If she hadn’t asked her parents to build the greenhouse, she wouldn’t have a good excuse.<br/><br/>Xiao Jinli thought and said, “Then Mom, can I plant some watermelons?”<br/><br/>“…” Xiao’s mother said somewhat speechlessly, “That’s something you’ll have to figure out through trial and error. I have never grown anything in a greenhouse.”<br/><br/>Xiao Jinli, ‘\t\t\t\t\t\t</div>", "images": {}, "success": true}