{"id": 89, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14235617.html", "title": "Chapter 89 - Chapter 89: Chapter 89: Playing With Earthworms, Do You Want To Play? (First Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 89 - Chapter 89: Chapter 89: Playing With Earthworms, Do You Want To Play? (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 89: Chapter 89: Playing with Earthworms, Do You Want to Play? (First Update)<br/><br/>Translator: 549690339<br/><br/>After returning home, Xiao Wanshan and his son never mentioned their work.<br/><br/>As they said themselves, work is work, and home is home.<br/><br/>At home, they only talked about trivial daily matters and the family would chat together.<br/><br/>Xiao Siqian was very puzzled, didn’t the villagers of Xiao Family Village know that the father and son had started such a big company, and did Aunt and Jinli know?<br/><br/>Uncle didn’t talk about work, and Aunt didn’t seem to ask about it either.<br/><br/>So, he really couldn’t be sure whether the mother and daughter knew or not. In fact, he wanted to test Jinli someday to see if she knew.<br/><br/>But, Jinli seemed to have become really fascinated with farming recently.<br/><br/>Well, she was in the greenhouse every day, tinkering around.<br/><br/>At first, Xiao’s mother would go to the field to help, but after a few days, seeing her daughter doing this and that, she began to doubt whether she could grow vegetables at all, so she just stopped going. Let her daughter do what she liked, after all, that piece of land was just for her to play with.<br/><br/>This was exactly what Xiao Jinli wanted.<br/><br/>Without Xiao’s mother around, she could be a little more unrestricted.<br/><br/>To make watering more convenient, Xiao’s father had specially arranged a pipe connected to the well water at home, so they wouldn’t have to carry water.<br/><br/>Five points of land, divided into ten long plots, each with its own boundary and different seeds sown.<br/><br/>Some seeds had been sown for quite a few days, and now one or two tiny tender buds could be seen.<br/><br/>Xiao Siqian walked into the greenhouse and saw Xiao Jinli squatting, seemingly busy with something.<br/><br/>As he approached, he was suddenly speechless.<br/><br/>She was playing with earthworms.<br/><br/>He saw an earthworm trying to escape into the ground, only to be dug out by Xiao Jinli again. Then she twisted it like a twisty doughnut.<br/><br/>Xiao Siqian, who had always been afraid of soft and cold animals, felt his scalp tingle from the sight of it.<br/><br/>He thought to himself, “What a cute little girl, how could she have such a wicked taste?<br/><br/>Fortunately, having been here for some time, he had gradually adapted to the occasional sight of birds, frogs, snakes, and insects.<br/><br/>Otherwise, given his previous life, he would probably have been startled by the sight of a frog.<br/><br/>“Oh, Little Sister Jinli, what are you doing?” Xiao Siqian asked, “Playing with earthworms?”<br/><br/>Xiao Jinli nodded, “Yes, playing with earthworms.”<br/><br/>Then, she pinched an earthworm from the soil and handed it to him, asking,<br/><br/>“Do you want to play? It’s quite fun.”<br/><br/>Xiao Siqian’s face changed immediately, and he shook his head, “No, I don’t want to play.”<br/><br/>Seeing the earthworms dug out by Xiao Jinli, he asked doubtfully, “Are these earthworms larger than those in other places?”<br/><br/>Since he had come here, the largest earthworms he had seen were only as thick as chopsticks.<br/><br/>But the earthworms dug out by Xiao Jinli were as thick as an adult man’s thumb and long, at least twenty or thirty centimeters.<br/><br/>Such earthworms, from a distance, would look like snakes if you didn’t know better.<br/><br/>Xiao Siqian looked at these earthworms, feeling an urge to turn and run.<br/><br/>However, as a grown man, it would be a big joke if he was scared and ran away from a few earthworms.<br/><br/>Xiao Siqian gritted his teeth and stared at the earthworms for a while, then forced himself to shift his attention.<br/><br/>He asked with a mixture of confusion and curiosity, “Were the earthworms in this land also bigger than those in other places before?”<br/><br/>Xiao Jinli shook her head and said, “No.”<br/><br/>“Then how did these earthworms become so big and so long?” Xiao Siqian asked.<br/><br/>“Oh, it’s because I fed them with special fertilizer,” Xiao Jinli said with a smile, “These earthworms are good friends for turning the soil and loosening the ground. Where there are earthworms, there is enough manure and fertilizer, which makes it easier to grow vegetables and fruits.”<br/><br/>“What kind of fertilizer did you feed them that it made them grow as big as a snake?” Xiao Siqian asked with intense curiosity.<br/><br/>Xiao Jinli replied, “Well, it’s a mix of chicken and duck manure and rotting root systems.”<br/><br/>“…” Xiao Siqian asked hesitantly, “Then wouldn’t the number of earthworms keep increasing? I heard that one earthworm can become two and they reproduce.”<br/><br/>Suddenly, his eyes widened, and he asked incredulously, “You’re not trying to breed these earthworms, are you?”<br/><br/>“Yes,” Xiao Jinli said, “Since earthworms are a good thing, I can breed more of them, which is beneficial for planting. In the future, when I have enough, I can sell them for money.”<br/><br/>“Sell?” Xiao Siqian couldn’t keep up with Xiao Jinli’s train of thought. “Yes. I heard that earthworms are edible. They are rich in protein, fat, and carbohydrates, with a crude protein content of up to 72%, and contain essential amino acids, vitamins, and trace elements needed by the human body. They can be used as animal feed, and for producing medicine and cosmetics, as well as food for human consumption. I heard that rich people in foreign countries like to eat this kind of stuff.”<br/><br/>Xiao Jinli continued, “Earthworms can also be used as medicine, which is highly valuable and has the effects of clearing heat and calming panic, promoting blood circulation, relieving asthma, and promoting urination. So, breeding earthworms is also a way to make money.”<br/><br/>After finishing this speech, Xiao Siqian looked at Xiao Jinli with a somewhat surprised expression, and then asked, “How do you, at such a young age, know so much about this?”<br/><br/>Xiao Jinli spread her hands and said, “Of course, by reading books. Don’t think I only know how to sleep in class. That’s because the knowledge in the textbooks doesn’t require me to use my brain.”<br/><br/>Xiao Siqian nodded knowingly, “You’re so smart and have the ability to remember things at a glance. The knowledge in class is as simple as 1 plus 1 equals 2 for you. Why don’t you skip grades?”<br/><br/>Like him, he jumped from the first grade to the third grade in elementary school, then to the sixth grade, from junior year to senior year, and then directly entered world-renowned universities, obtaining a dual master’s degree in economics and finance at the youngest age of 18.<br/><br/>From a young age, he was considered a genius by everyone.<br/><br/>Xiao Jinli smiled and said, “My parents hope that I can have a complete childhood. They don’t want me to be outstanding or excellent, putting pressure on myself, but want me to be happy and enjoy life! Besides, I think taking it step by step is quite good!”<br/><br/>How wonderful it would be to enjoy a happy childhood she hadn’t experienced before in this era.<br/><br/>She didn’t want her childhood to pass by once again in endless hard work and study.<br/><br/>After hearing Xiao Jinli’s words, Xiao Siqian’s expression slightly changed.<br/><br/>A happy childhood?<br/><br/>Did he have one?<br/><br/>It seemed that from the time he could remember, people kept telling him that he was the heir of the Su family, so he had to be better than others.<br/><br/>In order to be better than others, he sacrificed all his playtime, either reading or learning other things.<br/><br/>He suddenly felt envious of Xiao Jinli, envious of such a warm and loving family.<br/><br/>What they wanted was not wealth or power, but a healthy and happy family together..\t\t\t\t\t\t</div>", "images": {}, "success": true}