{"id": 81, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14232007.html", "title": "Chapter 81 - Chapter 81: Chapter 81: I Just Want To Lie Down In This Life (First Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 81 - Chapter 81: Chapter 81: I Just Want To Lie Down In This Life (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 81: Chapter 81: I Just Want to Lie Down in This Life (First Update)<br/><br/>Translator: 549690339<br/><br/>Xiao Siqian enjoyed a ride on Cow King’s back, basking in Xiao Jinli’s good fortune.<br/><br/>Indeed, riding a cow felt different from riding a horse.<br/><br/>Xiao Jinli rode Cow King around the entire village and decided on a spot for farming.<br/><br/>Xiao Jinli said, “Mom, after looking around, our backyard seems to be the most suitable spot!”<br/><br/>Xiao’s mother nodded and agreed, “Alright, the backyard is yours! Let me know if you need any help.”<br/><br/>“Okay, Mom!” Xiao Jinli nodded.<br/><br/>When it was late at night and quiet, Xiao Jinli locked the doors and windows, then entered the Space by pressing the birthmark on her wrist.<br/><br/>The Space was no longer as desolate as it was when Xiao Jinli first arrived, with yellow sand and stones flying everywhere.<br/><br/>On the once bare hills, there were now lush trees and glistening green grass.<br/><br/>At the foot of the hills, there was plot after plot of land.<br/><br/>Some plots had already been planted, while others were overgrown with weeds.<br/><br/>Little Q-like Xiao Zhi flew over, spun around, and asked, “Master, you have already planted a lot of fruits and vegetables here. Are they all to be kept in the Space?”<br/><br/>Xiao Jinli shook her head, “I’m trying to find a way to bring these things out of the Space.”<br/><br/>Xiao Jinli walked to the apple tree, picked an apple, and bit into it with a “crunch. ”<br/><br/>It was crispy and delicious, with the fragrance of the apple filling her mouth instantly.<br/><br/>It tasted several times better than the apples bought outside.<br/><br/>Xiao Jinli would occasionally bring out fruits like apples, pears, tangerines, and grapes when they were in season for her family to taste.<br/><br/>Her excuse was always that someone else had gifted them to her.<br/><br/>Xiao Zhi looked at Xiao Jinli’s young face, sighed lightly, and said, “Master, you are just too young now, making many things inconvenient.”<br/><br/>Xiao Jinli glanced at him and said, “How is it inconvenient? Don’t you see that I am the village’s Lucky Star now, with Fortune God’s protection in everything I do? It’s all reasonable!”<br/><br/>Speaking of this, Xiao Zhi giggled as he flew around the Space, “Hehe… Master, before you traveled through time, I didn’t know you had a koi constitution. The Village Head named you Jinli, and you truly have the luck of a koi! The Village<br/><br/>Head chose such a great name; your luck is ceaseless!”<br/><br/>Over the past decade, he had witnessed Xiao Jinli’s smooth sailing in everything she did. Even when someone tried to sabotage her, it was the ill-intentioned people who ended up suffering.<br/><br/>Xiao Jinli ate her apple, feeling content with her constitution.<br/><br/>Xiao Zhi held his little face and sighed, “Master, this era is simply too peaceful. Even when people are bad, they just have evil thoughts and aren’t vicious enough to take lives easily.”<br/><br/>He looked at Xiao Jinli, and his expression shimmered with excitement, “You can just relax! As you grow older, you can have whatever you want and be as free as a bird in the sky. Think about the past, how hard you worked, staying up day and night researching, and as a result, you were so outstanding that you attracted countless assassination attempts from various forces. Remembering<br/><br/>Xiao Jinli, ‘<br/><br/>She raised her small hand and lightly tapped Xiao Zhi’s little head, “Are you feeling nostalgic? I think you’re just bored and always want to see me make a fool of myself.”<br/><br/>Xiao Zhi slapped Xiao Jinli’s hand and defended himself, “Master, you’re wronging me. When did I ever want to see you make a fool of yourself? I was genuinely worried about you every time you faced an assassination attempt.”<br/><br/>“Oh, worried? You are a smart brain-item, do you have a heart?” Xiao Jinli said, somewhat speechless, “You can only calculate but are unable to calculate a heart for yourself!”<br/><br/>Xiao Zhi argued, “Although I don’t have a heart like humans, I can think like one! I have all five human senses. You underestimate me.<br/><br/>Xiao Jinli rubbed his little head and laughed, “Yes, I underestimated you.”<br/><br/>Xiao Zhi asked, “Little Master, what do you want to do when you grow up?<br/><br/>“Now that I have you, the most advanced smart brain-item, what else do I need to do? I can just relax,” Xiao Jinli said with a light laugh, “It’s great just to be a carefree child with my dad doting on me, my mom loving me, and my older brother indulging me.”<br/><br/>Xiao Zhi rolled his eyes at Xiao Jinli’s lack of ambition, waving his little hands, “No, no! Don’t you want to be a famous person in this world during this era? A celebrity, a name remembered throughout history! Someone who will be revered by our descendants 400 years later.”<br/><br/>“I don’t want to, I just want to be an ordinary person,” Xiao Jinli shook her head, “Being famous is too tiring.”<br/><br/>In her previous life, she had borne the reputation of being a genius, shouldering the hopes of several billion people worldwide. She was as busy as a spinning top, constantly working while fending off assassination attempts from various forces.<br/><br/>Xiao Zhi said loudly, “Being an ordinary person is too unambitious!”<br/><br/>Xiao Jinli rolled her eyes and said speechless, “What’s the use of having ambition? It’s not like I can eat or drink it.’<br/><br/>“Who says ambition can’t be eaten or drunk?” Xiao Zhi argued, “When you have ambition, you have motivation. With motivation, you can achieve success. After success, fame and wealth will come – can’t you eat and drink those?”<br/><br/>Xiao Jinli shrugged, “It doesn’t matter. I don’t lack food or drink now, so I don’t need ambition or motivation!”<br/><br/>Xiao Zhi became frustrated and turned away, ignoring his master.<br/><br/>Wuu… Did his master lose all her ambition and fighting spirit when she died once?<br/><br/>Xiao Jinli looked amused at Xiao Zhi and said, “Xiao Zhi, isn’t life good like this? This is the ancient time of 400 years ago when technology was still in its infancy. The people of this era need to explore, develop, and research in order to drive the overall development of humanity. However,”<br/><br/>Her brows furrowed Sligntly as sne continued, “Wnat we need to do IS prevent the worsening of the global environment.”<br/><br/>Xiao Zhi immediately turned around and nodded at Xiao Jinli, “Yes, yes, that’s what we’re doing now — preventing the worsening of the global environment, or at least slowing down its rapid decline!”<br/><br/>The development of human history has a certain trend.<br/><br/>It can’t be stopped; it can only be delayed!<br/><br/>Xiao Jinli’s beautiful eyes narrowed, “Well, it seems like we can only rely on<br/><br/>Little Space.”<br/><br/>Xiao Zhi,<br/><br/>What did she mean by that?<br/><br/>Just as Xiao Zhi was about to ask, Xiao Jinli had already laid down on the grass and fallen asleep.<br/><br/>Xiao Zhi, “…” Not only was she a koi, but she was also a sleeping deity!<br/><br/>Following suit, Xiao Zhi lay down beside Xiao Jinli..\t\t\t\t\t\t</div>", "images": {}, "success": true}