{"id": 84, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14235612.html", "title": "Chapter 84 - Chapter 84: Chapter 84: Did You Really Lose Your Memory? (Second Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 84 - Chapter 84: Chapter 84: Did You Really Lose Your Memory? (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 84: Chapter 84: Did You Really Lose Your Memory? (Second Update)<br/><br/>Translator: 549690339<br/><br/>“Great, great! That’s a really great speech!” Xiao Wanshan applauded after hearing Xiao Siqian’s opinion.<br/><br/>At this moment, Xiao Junxuan came in and asked with confusion, “Dad, I heard your laughter from far away. What are you talking about that’s so great?”<br/><br/>Xiao Wanshan told his son, “I just said that Xiao Quan’s opinion is great. Little Xuan, Xiao Quan was just telling me that the future price of houses will rise and there’s a huge potential for growth. His analysis is spot on and I think it’s really great!”<br/><br/>“Foreign houses’ prices will skyrocket, and there’s a huge potential for growth?” Xiao Junxuan frowned, his eyes half-closed, and asked again, “Xiao Quan, can you repeat what you just said?”<br/><br/>Then, Xiao Siqian repeated his words, and Xiao Junxuan’s eyes grew brighter and brighter. Like his father, his expression was somewhat excited. But soon, Xiao Junxuan’s eyes towards Xiao Siqian changed a bit.<br/><br/>He stared intently at Xiao Siqian.<br/><br/>Xiao Siqian felt inexplicably unsettled by the stare, making his scalp tingle, as he asked, “Brother Xuan, what’s wrong?”<br/><br/>Xiao Junxuan said very seriously, “I’m just trying to figure out how your brain works.”<br/><br/>Xiao Siqian,<br/><br/>“How can you be so clever and business-minded?” Xiao Junxuan continued, “Last time you inspired me with the combine harvester. My dad and I decided to buy the combine harvester. Although the purpose of buying the harvester wasn’t to make money, but for everyone’s convenience, it still has a certain commercial value to it.<br/><br/>Now, you say that house prices will rise, and you analyze it so logically. I’m starting to doubt, are you really only 18 years old? Or maybe you’re an old demon wearing an 18-year-old disguise?”<br/><br/>“Pfft!” Xiao Wanshan couldn’t help laughing at his son’s words.<br/><br/>With Xiao Siqian, who was being stared at, feeling uneasy, listening to Xiao Junxuan’s last sentence made his face go dark.<br/><br/>He said somewhat dissatisfied, “Brother Xuan, how could I be an old demon?” Xiao Wanshan nodded and chimed in, “That’s right, how could Xiao Quan be an old demon? Xuan’er, don’t doubt someone else’s intelligence just because you think your brain is not as clever and nimble as Xiao Quan’s.”<br/><br/>Xiao Junxuan, “…” His brain was not less clever and nimble than this kid’s.<br/><br/>Then, Xiao Wanshan asked puzzledly, “Xiao Quan, where did you learn all these things?”<br/><br/>When Xiao Siqian first came to the Xiao family, his wife and other family members had taken him to a bookstore to buy textbooks, wondering if they should send him to school.<br/><br/>But, the kid turned out to be really smart.<br/><br/>Xiao Siqian suddenly got a jolt in his heart.<br/><br/>That’s right, he was still playing the role of an amnesiac child.<br/><br/>The things he was saying now were truly suspicious.<br/><br/>Xiao Siqian explained, “Mmm, I analyzed it from newspapers and news on television. ”<br/><br/>Having heard that, Xiao Wanshan didn’t doubt it and nodded, “Oh, I see.”<br/><br/>Then, his tone changed to praise, “This shows that you really have a great business mind. Xiao Quan, do you really not remember anything about your past?”<br/><br/>He stared sharply at Xiao Siqian with his piercing eyes, and then continued, “I don’t know how you ended up on Red Peak Mountain, and how Xiao Bao carried you back. However, when you were saved, the clothes on you were of very high quality, clearly something ordinary people like us can’t afford. Could it be that you have an unusual identity?”<br/><br/>After hearing Xiao Wanshan’s words, Xiao Siqian’s heart tightened.<br/><br/>He was afraid that Xiao Wanshan would kick him out because of his identity.<br/><br/>He felt comfortable and warm in this home, and he didn’t want to leave for the time being.<br/><br/>He pleaded, “Uncle, I really have amnesia and can’t remember anything about my previous identity. Please, don’t kick me out, okay?” The last sentence had a hint of pleading in it.<br/><br/>Xiao Wanshan was startled, and then said seriously, “Xiao Quan, who said I would kick you out? Since the day you entered our home, you’ve been a part of us, our family. We will always welcome you here and will never kick you out unless you want to leave yourself. Xiao Quan, it’s my fault for bringing up such a thing and making you overthink it. I apologize.”<br/><br/>He never expected Xiao Siqian to be so sensitive. Just because he casually mentioned the identity issue, Xiao Siqian already worried about being kicked out.<br/><br/>Sigh, what kind of experiences did this child have in his past?<br/><br/>Xiao Wanshan looked at Xiao Siqian with a mixture of pity and sympathy in his eyes.<br/><br/>Xiao Siqian, “…” Why is my uncle looking at me with such eyes?<br/><br/>As a result, Xiao Junxuan turned his head and looked at him with the same<br/><br/>eyes.<br/><br/>Xiao Siqian,<br/><br/>“Mmm…” Xiao Wanshan laughed, “Xiao Quan, do you want your brother Xuan to take you on a tour around the place?”<br/><br/>Xiao Siqian immediately refused, “No need, uncle. I’ll just take a walk around by myself. Brother Xuan must be very busy.”<br/><br/>Would a deputy general manager of a company not be busy?<br/><br/>Xiao Wanshan didn’t force it, and just nodded, “Okay, go ahead and explore on your own. If you need anything, just come to us.”<br/><br/>Xiao Siqian nodded, and then went out.<br/><br/>After Xiao Siqian left, Xiao Junxuan immediately became excited, “Dad, Dad, we can buy a house!”<br/><br/>Xiao Wanshan glanced at him and said irritably, “Calm down, why are you so excited? You’re an adult and you still can’t control your emotions. How will you handle big things in the future?”<br/><br/>Xiao Junxuan’s face turned red as he defended himself, “I just get so excited when I think about the future rise in house prices.”<br/><br/>With the size of the company they ran, their father and son must have earned quite a bit of money.<br/><br/>After that, Xiao Junxuan said calmly, “Dad, where should we buy the house if we want to buy one?”<br/><br/>Xiao Wanshan squinted his eyes and replied, “We need to think carefully about that and do some investigations. However, for the time being, we still need to manage the current company well. The houses won’t run away for a while.”<br/><br/>Xiao Junxuan nodded, “Dad, you’re right.”<br/><br/>But then, he asked doubtfully, “Dad, do you really think Xiao Quan has lost his memory?”<br/><br/>“What are you doubting?” Xiao Wanshan’s sharp gaze focused on his son, “Even if he lost his memory or not, does it affect our relationship with him?”<br/><br/>“…” Xiao Junxuan replied, “There’s no effect!”<br/><br/>“Well, there you have it!” Xiao Wanshan said seriously, “No matter if he has lost his memory or not, as long as he’s part of our family, he’s Xiao Siqian, your younger brother. In the future, don’t doubt so much. Haven’t you noticed how well your sister gets along with him? If he had any ill intentions, your sister would have already stopped caring about him.”<br/><br/>Xiao Junxuan nodded, “Oh, I understand now!”<br/><br/>But then again, apart from his family, there wasn’t anyone else his sister got along with. Now there’s Xiao Siqian added to the list..\t\t\t\t\t\t</div>", "images": {}, "success": true}