{"id": 86, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14235614.html", "title": "Chapter 86 - Chapter 86: Chapter 86: Xiao Siqian’S Trouble (Second Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 86 - Chapter 86: Chapter 86: Xiao Siqian’S Trouble (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 86: Chapter 86: Xiao Siqian’s Trouble (Second Update)<br/><br/>Translator: 549690339<br/><br/>Xiao Siqian and Li Dayong’s argument quickly attracted some onlookers.<br/><br/>However, it was now work hours, and most ordinary employees were working in the workshop.<br/><br/>Those who came over were either security guards or company management.<br/><br/>“Li Dayong, what’s going on? It took you more than half a day just to deliver some goods!”<br/><br/>The person who came was a woman in her forties, who seemed like a department leader.<br/><br/>With a pale face, Li Dayong said to the woman, “Director Xin, my stomach was not feeling well just now, so I asked him to help deliver the goods to the workshop. But I didn’t expect that after coming out of the toilet, he would still be here. I criticized him, and he said it wasn’t his job.”<br/><br/>Director Xin raised her head to look at Xiao Siqian. As she saw his appearance clearly, her eyes lit up, but she instantly asked seriously, “Which workshop do you belong to? I haven’t seen you before.”<br/><br/>Xiao Siqian said, “I don’t belong to any workshop.”<br/><br/>Director Xin asked with confusion, “Not to any workshop? Are you from an office? Which office do you belong to? I haven’t heard of any department hiring new people.” Except for the production workshops.<br/><br/>Xiao Siqian shook his head, “No, I’m not!”<br/><br/>Upon hearing this, Li Dayong immediately said, “You’re not from a workshop, nor from an office? What are you doing here then? This is not a tourist attraction; you can’t be here just for fun.”<br/><br/>Xiao Siqian nodded, “That’s right; I came here for fun.”<br/><br/>Then he explained to Director Xin, “I was just passing by when this guy suddenly handed me a cart full of goods he pulled. Without asking whether I accepted or not, he just went straight to the toilet.<br/><br/>At first, I was going to help, but I didn’t know how to pull this kind of cart. I tried for half an hour, and by the time he came out from the toilet, I had only managed to pull it a dozen meters or so. So, it’s not my fault that I didn’t help to deliver the goods to the workshop, right?<br/><br/>Instead, this guy comes out and scolds me without considering the actual situation. Excuse me, is it my fault that the goods didn’t make it to the workshop?”<br/><br/>Director Xm• , “…” It’s not your fault.<br/><br/>These small carts may look easy to pull, but for someone who’s never operated one before, it’s not easy to get the hang of it.<br/><br/>Director Xin looked at Li Dayong with narrowed eyes and asked coldly, “Li Dayong, what do you have to say for yourself? You were supposed to deliver the goods first, but you went to the toilet instead and stayed there for half an hour! Are you constipated or something? And now you’re blaming him? How thick is your skin?”<br/><br/>Li Dayong’s face turned red, and he stammered, “Director Xin, this… I can’t be blamed. I thought he was here to work, and I was in a hurry, so I asked him to help. Who knew he wouldn’t help!”<br/><br/>He turned the fact that someone was helping him into not helping, just to shirk responsibility.<br/><br/>Director Xin said coldly, “Enough, don’t say anything more. Hurry up and deliver these goods; they’re waiting for you inside.”<br/><br/>Li Dayong still wanted to argue, but meeting Director Xin’s cold gaze, he could only pull the goods away with an awkward face.<br/><br/>After Li Dayongleft, Director Xin asked Xiao Siqian again, “If you’re not from a workshop nor an office, are you here for an interview?”<br/><br/>Xiao Siqian shook his head, “No.”<br/><br/>Director Xin frowned, puzzled, and asked, “If you’re neither, then how did you get in? Who brought you in?”<br/><br/>Xiao Siqian looked up at Director Xin and said, “Naturally, someone brought me in. As for who, it’s none of your business.”<br/><br/>Having said that, Xiao Siqian didn’t want to deal with this woman any further.<br/><br/>Seeing Xiao Siqian’s attitude, Director Xin was irritated. She immediately stopped him and said, “Stop, I’ll call security to kick you out if you don’t explain yourself!”<br/><br/>Xiao Siqian slightly raised his eyebrows, somewhat puzzled, and asked, “What’s your position? What is your qualification to kick me out?”<br/><br/>A smart person wouldn’t get involved in other people’s affairs.<br/><br/>Director Xin said with pride, “I am the Production Department Director. Do you think I have no right to kick you out?”<br/><br/>Xiao Siqian nodded and said, “Oh, so you’re the Production Department Director. No wonder you’re so domineering. But I’m sorry; you really don’t have the right to kick me out. If you don’t believe me, call security over and see.”<br/><br/>The security guards at the security office had seen him get out of President Xiao’s car.<br/><br/>Upon hearing this, Director Xin’s eyebrows furrowed even more.<br/><br/>Just who was this person to be so confident and fearless?<br/><br/>Xiao Siqian ignored her thoughts and left directly.<br/><br/>What a bothersome affair.<br/><br/>Director Xin’s gaze followed Xiao Siqian’s retreating figure, then noticed him heading towards the office building.<br/><br/>She suddenly thought to herself, “Could he really be brought here by someone from the office just for fun?”<br/><br/>After a while qhp followed him<br/><br/>As the Production Department Director, she also had an office in the office building.<br/><br/>There was nothing strange about her going to the office building.<br/><br/>She went to the Human Resources Department and asked, “Did you hire anyone today?”<br/><br/>“No, Sister Xin, is something wrong?” the HR Department replied.<br/><br/>“Today, I saw a stranger coming into the factory. Just now, I clearly saw him walking into the office building. What’s going on?” asked Director Xin, puzzled.<br/><br/>The HR Department confidently claimed, “There was no new hiring today. But,<br/><br/>Sister Xin, did you need him for something?”<br/><br/>Director Xin shook her head, “No!” She simply thought the young man looked good and wondered if they could talk more in the future.<br/><br/>Human Resources, ‘ She still chased after him even though she had no business with him.<br/><br/>At this moment, a clerk spoke up, “Oh, Director Xin, are you talking about that handsome young man with a tall stature and good looks?”<br/><br/>“Yes, that’s him!” agreed Director Xin.<br/><br/>The clerk said excitedly, “Oh, you’re talking about that handsome guy! He came in with President Xiao. Right now, he should be in President Xiao’s office. If you need to see him, just go inside.”<br/><br/>Director Xin, “…” It turned out that President Xiao brought him in. No wonder the young man acted so confident and fearless. He really was just visiting the factory.<br/><br/>At noon, Xiao Junxuan took Xiao Siqian to the cafeteria for lunch.<br/><br/>Just as they were about to walk in, Xiao Junxuan’s face turned red, and he said,<br/><br/>“Xiao Quan, you go ahead and wait for me at the table in the cafeteria. I need to use the restroom.”<br/><br/>Then he hurriedly ran off.<br/><br/>Xiao Siqian walked into the cafeteria alone.<br/><br/>The cafeteria was spacious, and everyone was lining up to get their meals.<br/><br/>Xiao Siqian went straight to a table and sat down.<br/><br/>As soon as he sat down, Li Dayong came over with two young men, stood in front of him, and threatened, “So, you’re here, pretty boy! Damn it, I asked you to help me earlier, and that was already showing you respect!”<br/><br/>After saying that, Li Dayong slapped at Xiao Siqian, intending to teach him a lesson.<br/><br/>It was often the case that employees would have private quarrels.<br/><br/>Fighting in the cafeteria was also quite normal.<br/><br/>Xiao Siqian turned his head and stretched out his hand to grab Li Dayong’s slap. He then countered with a slap of his own, shouting fiercely, “Get lost!”<br/><br/>Li Dayong’s eyes were full of sparks from the blow!\t\t\t\t\t\t</div>", "images": {}, "success": true}