{"id": 88, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14235616.html", "title": "Chapter 88 - Chapter 88: Chapter 88: Eliminating Woodworm (Second Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 88 - Chapter 88: Chapter 88: Eliminating Woodworm (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 88: Chapter 88: Eliminating Woodworm (Second Update)<br/><br/>Translator: 549690339<br/><br/>“Little… Little President Xiao, 1…1 was wrong!” Seeing Xiao Junxuan’s serious face, Li Dayong stuttered an apology.<br/><br/>Xiao Junxuan snorted coldly, “Humph, I don’t care if you know you’re wrong or not, but Xiao Li Company can’t keep you anymore. You’d better go to the Human Resources Department in the afternoon to resign. If you resign voluntarily, I can still give you this month’s salary. But if the company fires you, you won’t get a cent!”<br/><br/>Such a parasite definitely can’t stay.<br/><br/>Li Dayong’s face turned pale, and he struggled to say, “Little…Little President Xiao, I was wrong. How about letting me go this time for the sake of my friendship with President Xiao? I won’t do this again in the future.”<br/><br/>“Not doing this anymore? Which things are you referring to?” Xiao Junxuan sneered, “Humph, you’re admitting you’re wrong because we caught you in the act. If it weren’t for my younger brother suddenly having a whimsy and wanting to come and see, I wouldn’t have known that you as an ordinary employee could use your power to bully new employees. When could I have caught this behavior if not for my brother? Should I just wait until you drive every employee away and then notice?”<br/><br/>Li Dayong’s mouth opened wide, not knowing how to argue.<br/><br/>“Alright, my place here is small and can’t fit your big Buddha, so please don’t seek a higher position.”<br/><br/>After saying that, Xiao ignored him and walked up to Xiao Siqian. He reached out and playfully tousled Siqian’s hair, smiling, “Little Quan, I really have to thank you for helping me catch a little bug.”<br/><br/>Xiao Siqian pushed away his hand that was tousling his hair and said, “Brother<br/><br/>Xuan, I’m hungry. Let’s eat.”<br/><br/>Xiao Junxuan amiably replied, “Okay, have a seat. I’ll get you a meal, it will be ready in a moment.”<br/><br/>Knowing that Little President Xiao was going to get food, the employees all made room.<br/><br/>Xiao Junxuan was not polite, and directly got in line to get the meals.<br/><br/>When he brought two plates of food over, Xiao Siqian took one and looked at the food on the plate. The color was fine, but he didn’t know about the taste yet.<br/><br/>Xiao Junxuan laughed and said, “The Head Chef of the Canteen has good cooking skills. Of course, he can’t compare to my mom. Just make do with this meal. We’ll go home and eat tonight!”<br/><br/>When they are not very busy, they would go home early to eat dinner. If they were too busy, they wouldn’t go back at noon, but they would definitely go back at night.<br/><br/>Xiao Siqian nodded, looked at the food on the plate, and started eating.<br/><br/>There’s nothing to be picky about here.<br/><br/>If you knew what he went through during the days he was being hunted, the kidnappers only gave him a steamed bun and half a bottle of water per day to keep him from starving but not having the energy to run away.<br/><br/>After taking two bites, Xiao Siqian asked, “Brother Xuan, isn’t Uncle coming down for lunch yet?”<br/><br/>Xiao Junxuan said, “He should be soon.”<br/><br/>As soon as he finished speaking, Xiao Wanshan appeared at the doorway.<br/><br/>However, before Xiao Wanshan could step in, Li Dayong cried out to him, “President Xiao, I was wrong, I really know I was wrong. President Xiao, for the sake of my friendship with you, please don’t let Little President Xiao fire me?”<br/><br/>Xiao Wanshan stared at Li Dayong for a moment, slightly confused, and asked, “You are?”<br/><br/>Li Dayong was slightly stunned and then said, “President Xiao, I am Li<br/><br/>Dashan’s friend Li Dayong.”<br/><br/>That’s when Xiao Wanshan recalled such a person, “Oh, it’s you. What exactly happened? Why does Little President Xiao want to fire you?”<br/><br/>His son was not a reckless person who would casually fire someone.<br/><br/>Xiao Junxuan, who was eating, saw Li Dayong blocking his father’s way and begging for mercy, so he immediately went over and said, “Dad, here’s what happened! ”<br/><br/>Then he explained the whole story.<br/><br/>Xiao Wanshan’s face instantly darkened, and he fixed his sharp gaze on Li Dayong, saying, “Since Little President Xiao has fired you, you can pack your things and leave later.”<br/><br/>Li Dayong was unwilling.<br/><br/>Working for this company had great salary and benefits, and his job in the factory was very easy. He didn’t want to leave.<br/><br/>He gritted his teeth and said, “President Xiao, Li Dashan and I are good friends!”<br/><br/>Meaning not looking at the monk’s face, but the Buddha’s face.<br/><br/>It would be difficult for Xiao Wanshan to explain if he fired him with such disregard.<br/><br/>However, Xiao Wanshan casually said, “I’ll talk to Li Dashan about this.”<br/><br/>Back when Li Dashan introduced his friend to work in the factory, and considering their friendship, he agreed. Then he arranged for the HR Department to put him in the receiving and sending position.<br/><br/>The position was easy, with good salary, so it could be considered a favor to his friend.<br/><br/>But he didn’t expect that with such a small favor, Li Dayong could cause trouble in his company, harming the company and bullying new employees.<br/><br/>What is this? Eating mother’s cooking while cursing her.<br/><br/>No matter how good their relationship was, he couldn’t keep someone who continued to harm his company.<br/><br/>After saying that, Xiao Wanshan took out his phone and called his friend Li Dashan, saying, “Great Mountain, your introduced friend used his connections to bully my company’s new employees and harm my company, so I fired him today. Yes, alright…”<br/><br/>After that, he hung up the phone, strode away, and walked to Xiao Siqian, saying with some concern, “Little Quan, when you were bullied, why didn’t you tell Uncle? No matter what, you can’t let people bully you in your own company, right?”<br/><br/>Xiao Siqian smiled and said, “Uncle, I’m fine. It’s just a small matter. Uncle, let’s eat. I’ll get you some food since I’m already done.”<br/><br/>Xiao Wanshan stopped him, “You don’t need to go. Your brother Xuan will get me food.<br/><br/>Xiao Junxuan, who hadn’t finished eating yet, had to put down his chopsticks and went to get food from the window.<br/><br/>After finishing lunch, Xiao Wanshan said, “Little Quan, why don’t you go to Little Xuan’s office and rest?”<br/><br/>Xiao Siqian nodded and said, “Okay!”<br/><br/>In the afternoon, Xiao Wanshan and Xiao Junxuan were still busy, and Xiao<br/><br/>Siqian went to the workshop.<br/><br/>He didn’t go into the workshop in the morning.<br/><br/>After the cafeteria incident, everyone knew that this handsome young man was a relative of the Xiao family.<br/><br/>So, when he entered the workshop, the young girls in the workshop blushed and peeked at him, thinking in their hearts, “The Xiao family’s genes are really good. President Xiao is handsome, Little President Xiao is handsome, and this man is even more handsome.”<br/><br/>Many of the young girls, whether unintentionally or intentionally, dropped things in front of Xiao Siqian while he passed by.<br/><br/>“Sorry, sorry… I didn’t mean to.” The girl’s face flushed red with embarrassment.<br/><br/>Xiao Siqian paid no attention and walked away directly.<br/><br/>The workshop employees, ‘ . ‘ This man is so rude.<br/><br/>But then again, he’s a high-and-mighty young master. How could he be interested in ordinary factory workers?<br/><br/>Xiao Siqian went around the workshop, and that Director Xin, who had approached him in the morning, immediately followed him with a flattering smile, “Young Master Xiao, is there anything I can do for you?” She was a completely different person than she had been in the morning.<br/><br/>Xiao Siqian glanced at her with a cold gaze and said coolly, “No need, I’ll just take a look..”\t\t\t\t\t\t</div>", "images": {}, "success": true}