{"id": 80, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14232003.html", "title": "Chapter 80 - Chapter 80: Chapter 80: Lucky Star Is The Animal King (Second Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 80 - Chapter 80: Chapter 80: Lucky Star Is The Animal King (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 80: Chapter 80: Lucky Star is the Animal King (Second Update)<br/><br/>Translator: 549690339<br/><br/>“What, you want a piece of land?”<br/><br/>After returning from Jianggan City, Xiao Jinli brought up the request for a piece of land to her parents.<br/><br/>Xiao Jinli nodded and said, “Yes, I want a piece of land. This land should be able to accommodate at least thirty or forty types of seeds.”<br/><br/>Xiao’s mother looked at her daughter’s serious expression and slightly furrowed her brow before asking earnestly, “Jinli, are you sure you want to plant things on the land?”<br/><br/>“Yes. Mom, I bought some seeds from a seed shop in Jianggan City,” Xiao Jinli replied honestly. “I want to plant these things myself.”<br/><br/>Xiao’s father laughed and said, “Wife, if our child wants a piece of land, let’s give her one. After all, we have land in the family. If not, we can always ask other people in the village if they have some.”<br/><br/>He has always been very indulgent with his daughter since, unlike other children, Xiao Jinli has always been quite sensible.<br/><br/>After hearing her husband’s words, Xiao’s mother said somewhat speechlessly, “Is this a question of whether we have land or not? Why would Jinli want a piece of land to plant things at such a young age? Besides, does a child know how to plant things?”<br/><br/>Although she usually participates in labor, she rarely lets the two children take part in activities like planting vegetables.<br/><br/>However, Xiao Jinli said very seriously, “Mom, let me tell you, I have thought deeply about wanting to plant things on land. I want to focus on studying agriculture.”<br/><br/>Upon hearing this, Xiao’s father burst into laughter and said, “Good, Jinli has aspirations at such a young age. Well done, daughter, I support you!”<br/><br/>“…” Xiao’s mother laughed helplessly. “Since you have such aspirations and interests, Mom will support you too. But Jinli, have you set your sights on a particular piece of land?”<br/><br/>Xiao Jinli thought for a moment before saying, “Not yet. I’ll look around tomorrow.”<br/><br/>“Alright, you can go have a look. If you like one of our lands, that’s the best. If you like someone else’s in the village, Dad will talk to them and ask them to sell or rent it,” Xiao’s father immediately decided.<br/><br/>Xiao Jinli happily said, “Thank you, Mom and Dad!”<br/><br/>Xiao Siqian’s dark eyes flashed and he looked at Xiao Jinli somewhat strangely.<br/><br/>Did this child buy so many seeds just to plant them herself? With her parents’ permission, Xiao Jinli went to find Cow King.<br/><br/>“Cow King, let’s go work,” said Xiao Jinli.<br/><br/>Afterwards, Xiao Siqian, who was following behind, saw Cow King crouching down, Xiao Jinli leaping onto him, and sitting on him firmly.<br/><br/>Xiao Siqian,<br/><br/>So that’s how Cow King was used?<br/><br/>Xiao Jinli directed Cow King, “Let’s make a round of the whole village.”<br/><br/>Whenever Xiao Jinli was feeling lazy and didn’t want to walk, she would ride Cow King around.<br/><br/>Cow King was obedient, carrying his young master steadily, and they started walking towards the farmland in the village.<br/><br/>As they walked out, the villagers saw Xiao Jinli riding Cow King and greeted her with smiles.<br/><br/>“Jinli, where are you going with Cow King?”<br/><br/>“Uncle, I’m going to the field.”<br/><br/>“Going to the field? What’s there to see now?”<br/><br/>“Nothing, I just want to go for a walk. It’s been a long time since I’ve ridden Cow King, and I want to ride him.”<br/><br/>The villagers, “…” Alright then.<br/><br/>In Xiao Family Village, only Xiao Jinli would say she wanted to ride Cow King, and only she could actually ride him.<br/><br/>Others couldn’t even touch Cow King if they wanted to.<br/><br/>Since the last time Cow King rescued more than a dozen cows and helped the authorities catch more than a dozen cattle thieves, his fame didn’t only ring out in the ten miles and eight villages but also within the county town.<br/><br/>For a while, in addition to some people who were curious about Cow King, there were also people who came to ask if the cow was for sale, with offers of no less than one hundred thousand yuan.<br/><br/>One hundred thousand yuan! In the countryside, that’s an astronomical price.<br/><br/>Ordinary cows could only sell for at most five or six thousand yuan.<br/><br/>Of course, Xiao Jinli refused.<br/><br/>Now, Cow King was already part of their family. How could they sell him for such a small sum of money?<br/><br/>Of course, the sky-high price of over one hundred thousand yuan also made some people restless.<br/><br/>So, from time to time, people would come to inquire about the situation, but the villagers of Xiao Family Village were not so foolish that an outsider could easily find out about Cow King’s bottom line.<br/><br/>As for those who wanted to sneak in at night, they were either chased by dogs or bitten by them before they even got close.<br/><br/>That’s right, ever since they found out that Cow King was too eye-catching and that there were many people who wanted a piece of him, Xiao Family Village started to have more dogs.<br/><br/>Xiao Jinli didn’t raise dogs, but every dog was very affectionate towards her. Perhaps because of Xiao Jinli’s blessing, the dogs became smarter and smarter, ignoring unfamiliar food. Those thieves who wanted to drug the dogs all returned empty-handed.<br/><br/>In the eyes of everyone, Cow King became even more majestic.<br/><br/>Xiao Jinli rode Cow King in front, the dogs of Xiao Family Village unknowingly gathered behind and followed, this spectacular team had a demeanor of a king’s patrol, apparently, Xiao Jinli was that king.<br/><br/>Xiao Siqian,<br/><br/>If you didn’t know better, you might think Xiao Jinli was an animal king.<br/><br/>The villagers watched this procession, and after an initial pause, they burst into laughter.<br/><br/>“Haha, Jinli is not only popular among us humans, but also in the animal kingdom.”<br/><br/>“Jinli, where is your majestic procession headed for inspections? Haha…”<br/><br/>“My dog usually ignores me but when it comes to Jinli, it’s like plaster, always sticking close. Haha, what a difference.”<br/><br/>“Jinli has such great charm.”<br/><br/>All the way, the villagers teased Xiao Jinli, who sat leisurely on Cow King’s back without a care in the world.<br/><br/>Seeing Xiao Siqian following behind her, she raised an eyebrow and asked, “Little Brother Xiao Quan, do you want to sit up here?”<br/><br/>Xiao Siqian’s eyes brightened, and he asked with slight excitement, “Can I? I heard that Cow King doesn’t like to carry anyone else.”<br/><br/>Cow King also let out a “moo” as if to protest, but Xiao Jinli patted its horns and said, “If I say you can, then you can.”<br/><br/>Xiao Siqian didn’t refuse and responded, “Okay!”<br/><br/>Xiao Jinli patted Cow King’s head, and it reluctantly bent down its hind legs, allowing Xiao Siqian to get on.<br/><br/>It didn’t really want to carry anyone else, but it couldn’t resist its young master’s orders.<br/><br/>Cow King was tall and sturdy, so when Xiao Siqian sat down, there was still plenty of space.<br/><br/>However, since it was his first time sitting on it, and he didn’t have reins like when riding a horse to help him balance, Xiao Siqian nervously grabbed onto Xiao Jinli’s clothes.<br/><br/>Xiao Jinli laughed and said, “Little Brother Xiao Quan, don’t be so nervous. Cow King walks very steady and won’t throw you off. You can just put your hands on his back.”<br/><br/>“Oh, okay!”\t\t\t\t\t\t</div>", "images": {}, "success": true}