{"id": 87, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14235615.html", "title": "Chapter 87 - Chapter 87: Chapter 87: Teaching A Lesson To The Worm (First Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 87 - Chapter 87: Chapter 87: Teaching A Lesson To The Worm (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 87: Chapter 87: Teaching a Lesson to the Worm (First Update)<br/><br/>Translator: 549690339<br/><br/>Employees who were watching the drama in the cafeteria were somewhat shocked.<br/><br/>This handsome young man was so powerful and his moves were so cool.<br/><br/>Just now, they thought about sympathizing with Xiao Siqian and pitying him. After all, as a newcomer, how could he fight Li Dayong?<br/><br/>Li Dayong was beaten by Xiao Siqian so hard that his eyes were seeing stars.<br/><br/>After being hit, he subconsciously covered the slapped side of his face. After steadying himself, he reacted and pointed at Xiao Siqian with one hand, “You little white face, how dare you hit me! Do you know who I am? I think you don’t want to stay here anymore, huh?”<br/><br/>Xiao Siqian stared at him coldly and asked, “I don’t need to know who you are! I warn you, you better not mess with me!”<br/><br/>Hearing his words, Li Dayong laughed in anger, and said, “You better listen, I am President Xiao’s relative. Do you know who President Xiao is? He is the general manager of our Xiao Li Company.”<br/><br/>Xiao Siqian frowned and asked, “You are President Xiao’s relative. What kind of relative are you?”<br/><br/>Uncle and Brother Xuan opened such a big company in the county town, but no one in the Xiao Family Village was working here.<br/><br/>If Uncle’s relatives knew about it, the villagers would know about it too.<br/><br/>Li Dayong boasted proudly, “Hmm, one of my friends is President Xiao’s classmate.” In fact, he was a friend of that friend.<br/><br/>“So, with my relationship with President Xiao, it will only take minutes to fire you. Hmm, if you admit your mistake and apologize to me, I will be generous and let you go!”<br/><br/>But Xiao Siqian asked, “Your friend and President Xiao are classmates, so you and President Xiao are also classmates, right?”<br/><br/>“…” Li Dayong hesitated for a moment and then admitted, “Of course. Xiaojun and I are classmates, so you better be sensible.”<br/><br/>Xiao Siqian nodded and asked, “So, how should I be sensible?”<br/><br/>“Of course you should let me hit you back, huh?” Li Dayong said matter-of-factly, “I just can’t take a slap for nothing, right? And you have to apologize to me. But I don’t need you to do anything, just handle my clothes every day, and also, get my meals in the cafeteria.”<br/><br/>Someone nearby advised, “Handsome guy, you should apologize to him. If you want to stay and work in this factory!”<br/><br/>“Yes, yes. I also heard that President Xiao and he are friends. This factory has good welfare treatment. If not, you just suffer a little loss and apologize to him.”<br/><br/>After listening to these words, Xiao Siqian asked, “Does he often bully new employees?”<br/><br/>“Well, it’s not that he often bullies new employees, he just occasionally asks them to help him with washing clothes and getting meals for him.” By the way, he also takes half of their first month’s salary.<br/><br/>The latter part was not mentioned, so as not to provoke Li Dayong too much.<br/><br/>Xiao Siqian’s calm face was filled with a trace of anger, and he shouted, “Isn’t this frequently bullying new employees?”<br/><br/>This is my uncle’s company. It would have been fine if I didn’t find out earlier.<br/><br/>Now that I’ve found this bug, I’m going to help clean it up.<br/><br/>Just then, Xiao Junxuan came back and saw a group of people gathered together and heard Xiao Siqian’s words.<br/><br/>He asked puzzledly, “What happened?”<br/><br/>Before anyone else could say anything, Li Dayong said, “Little President Xiao, you’re here, and that’s great. This newcomer suddenly slapped me just now, saying that I made him work this morning!”<br/><br/>Xiao Junxuan looked at Xiao Siqian and Li Dayong, and asked, “In the morning, he was working?”<br/><br/>Li Dayong then stuttered about how he delivered goods to the workshop in the morning, and he had a stomachache and urgently needed to use the toilet, so he asked the new guy to deliver the goods.<br/><br/>“Little President Xiao, it took him half an hour to send it there,” Li Dayong said loudly, “I just said a few words to him, and then he started to talk back to me, saying that it was not his job, and I had no right to blame him. You listen, as an employee, what’s wrong with asking him for help? Hmm, how can such a person who doesn’t take the company as his home possibly work here wholeheartedly in the future?”<br/><br/>Xiao Junxuan’s eyes narrowed, and he looked at Li Dayong and asked again,<br/><br/>“So, it took you more than half an hour to use the bathroom?”<br/><br/>The company didn’t set a time limit for employees to use the bathroom; however, taking half an hour seems like treating people like fools.<br/><br/>Li Dayong’s expression was slightly stiff.<br/><br/>He said so much, but Little President Xiao only listened to this one sentence.<br/><br/>After a long time, Li Dayong forced a sentence out, “Little President Xiao, I… I’m constipated! So, I took more time.”<br/><br/>Xiao Junxuan nodded, then looked at Xiao Siqian and asked, “Little Quan, someone bullied you in the morning, why didn’t you tell me?”<br/><br/>“Brother?!”<br/><br/>“Brother, I’m fine!” Xiao Siqian said indifferently, “I’m not a three-year-old child who’s suffered a little bullying and then tells parents!”<br/><br/>The employees present were extremely surprised.<br/><br/>They were just saying who this handsome boy could be, whether he was a new employee or not, but it turned out to be Little President Xiao’s younger brother.<br/><br/>Wait, he is Little President Xiao’s younger brother, which means he is President Xiao’s son.<br/><br/>Thinking of this, many people looked at Li Dayong sympathetically and with strange expressions, while many others wore a look of schadenfreude.<br/><br/>This guy picked the wrong person to bully, picking on President Xiao’s son.<br/><br/>Even if you have a close relationship with President Xiao, it’s useless when you bully his children.<br/><br/>Li Dayong’s face turned pale when he heard the word “brother.”<br/><br/>He never expected that Little President Xiao’s younger brother would be President Xiao’s son.<br/><br/>So his move to complain about it first turned into a big joke.<br/><br/>Then, Xiao Junxuan asked another question that almost made Li Dayong’s legs go weak.<br/><br/>He asked, “What happened now?”<br/><br/>Xiao Siqian, who hadn’t said anything about it, told the truth, “Well, I was sitting here nicely when this guy suddenly came over with two people aggressively, trying to hit me. Then I hit him back.<br/><br/>After that, he threatened me, saying he was friends with my uncle and told me to be sensible. Besides letting him hit me back obediently and apologizing to him, I had to wash his clothes and line up for his meals!<br/><br/>I just heard from some people that he often bullies new employees! Brother, is he really friends with Uncle? Oh, no, he said that one of his friends is Uncle’s classmate, implying that he is friends with Uncle too. So, is he using this relationship to be domineering in the factory?”<br/><br/>This time, Li Dayong’s legs went weak on the spot.<br/><br/>Xiao Junxuan’s face darkened and he said coldly, “Li Dayong, I and my father didn’t even know that you were using my father’s relationship to work in my father’s factory, but bullied the employees in my father’s factory! You’re really something! Who gave you the right to bully these new employees?”<br/><br/>He wondered why some new employees left after just a few days.<br/><br/>However, since he didn’t handle personnel issues, he didn’t ask too much about it.<br/><br/>As a result, the problem was here..\t\t\t\t\t\t</div>", "images": {}, "success": true}