{"id": 85, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14235613.html", "title": "Chapter 85 - Chapter 85: Chapter 85: Disturbance In The Factory (First Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 85 - Chapter 85: Chapter 85: Disturbance In The Factory (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 85: Chapter 85: Disturbance in the Factory (First Update)<br/><br/>Translator: 549690339<br/><br/>After coming out of the General Manager’s Office, Xiao Junxuan went directly to tour the Factory.<br/><br/>Because of Xiao Junxuan’s tall height, good figure, handsome appearance and extraordinary temperament, he looked like a beautiful scenery wherever he walked.<br/><br/>Most of the people working in this factory are young, especially many who are only two years out of junior high school and have followed acquaintances into the factory.<br/><br/>The girls and women working in the workshop inadvertently looked up and saw Xiao Junxuan outside the factory, their eyes instantly brightening as they said to their colleagues, “Look, that young man outside is so handsome, is he the new guy? I’ve never seen him before.”<br/><br/>The colleague looked up and said, “He must be the new guy. If he had come before, such a handsome young man would have been recognized by everyone sooner. ”<br/><br/>“New guy, huh? He doesn’t look very old and is so handsome. I wonder if he already has a girlfriend?” a girl with a blushing face muttered.<br/><br/>A married woman nearby teased, “Interested, huh? Why don’t you go ask him and find out!”<br/><br/>The girl with a red face replied, “We don’t know each other at all, what am I supposed to ask him about?”<br/><br/>The woman laughed and said, “You may not know each other now, but maybe you will be familiar in a few days. You can ask him then.”<br/><br/>She also glanced over and sighed softly, “To be honest, this is the first time I’ve seen such a handsome young man in person. In the past, we only watched handsome guys on TV. It’s a pity that Time doesn’t spare anyone. My children are all grown up now.”<br/><br/>Xiao Junxuan was the subject of discussions not just here, but everywhere he went. As long as someone caught a glimpse of his face, they couldn’t help but talk about him.<br/><br/>After all, they rarely saw someone with such a stunning appearance.<br/><br/>Some of the young men in the factory who didn’t have girlfriends suddenly felt threatened.<br/><br/>They grumbled, “Who is this stinky kid? Why haven’t we seen him before? Is he new here?”<br/><br/>“He must be new. If he had been here before, we would have seen him!”<br/><br/>“So is he here to work in the factory? Why isn’t he with anyone?”<br/><br/>“Who knows! He probably wants to look around the factory on his first visit.” Deep down, they were worried that he would be assigned to their team.<br/><br/>Because having a man who looks better than they do in the same team also puts a lot of pressure on them.<br/><br/>“Humph, his skin is so white, he must be a Little White Face. What kind of work can he do?”<br/><br/>“You didn’t see the looks in those girls’ eyes when they saw him, they were all shining. He’s just a little more handsome than us, what’s the big deal? What’s there to look at?”<br/><br/>“That’s right, what’s the big deal about being handsome? Only if you can work hard and earn more than us is it impressive. Otherwise, if you can’t work and have no money, how can you date girls? Do you expect girls to support you?<br/><br/>That would be so embarrassing.”<br/><br/>Well, the tone of these words was sour.<br/><br/>However, since it was work hours, they couldn’t cause any trouble even if they wanted to.<br/><br/>After touring the factory, Xiao Junxuan went into the workshop.<br/><br/>The Workshop Supervisor was slightly puzzled when he saw an unfamiliar young man wandering around the entrance.<br/><br/>The Supervisor walked over and asked, “Handsome guy, what can I do for you?”<br/><br/>Xiao Junxuan shook his head and said, “Just looking around!”<br/><br/>“Looking around? Are you new here? Which workshop are you in?” the supervisor asked again.<br/><br/>Xiao Junxuan shook his head and said, “I’m not here to work.”<br/><br/>“If you’re not here to work, then what are you here for? Are you here to play?<br/><br/>This is factory territory, so you can’t just mess around!”<br/><br/>The Supervisor was slightly dissatisfied, saying, “Whichever workshop put you in, even if you’re not working right now, you should be looking around your assigned workshop instead of wandering around.” Xiao Junxuan nodded and said, “Oh, I understand.”<br/><br/>He then left the workshop.<br/><br/>Supervisor, ‘ .<br/><br/>Why did such a handsome young man come, and what was he up to?<br/><br/>However, having such a handsome boy assigned to her workshop would probably motivate the other kids to work harder.<br/><br/>Hearing Xiao Siquan’s words, Xiao Sichuan felt hesitant to walk around the workshop, so he just toured the outside of the factory.<br/><br/>The entire company wasn’t that big, and after walking for a while, he had seen the entire factory.<br/><br/>Xiao Siqian became bored in an instant.<br/><br/>But since Xiao Wanshan and Xiao Junxuan were busy, he couldn’t disturb them.<br/><br/>Just as he was thinking, a man in his thirties called out to him.<br/><br/>The man was pulling a cart of goods.<br/><br/>“Hey, which workshop are you in?”<br/><br/>Xiao Siqian was about to answer when the man handed him the handle of the cart and said, “I’m in a bit of a hurry right now. Can you help me deliver these goods to the Third Workshop?”<br/><br/>Without waiting for Xiao Siqian’s response, the man hurriedly ran toward the Toilet.<br/><br/>Xiao Siqian looked at the cart and muttered, “Where is the Third Workshop?”<br/><br/>There are two workshops here.<br/><br/>As for the layout structure of the workshops, he really had no idea.<br/><br/>“Forget it, I’ll just ask,” Xiao Siqian said to himself.<br/><br/>After asking the Cleaning Auntie, he found out that the Third Workshop was in the back building and pulled the goods there.<br/><br/>However, he was not familiar with using a handcart and couldn’t control the cart.<br/><br/>As he pulled it, the cart swerved to one side.<br/><br/>While pushing it, the cart swerved to the other side.<br/><br/>He had been pulling for more than ten minutes but had only covered a distance of ten meters or so.<br/><br/>By the time the man who had asked him to pull the goods came out of the Toilet, it was already half an hour later. When he saw that the cartload of goods had not yet been delivered to the workshop, his face immediately darkened.<br/><br/>He swiftly walked up to Xiao Siqian, scolding him in an angry tone, “What on earth are you doing? It’s been more than ten minutes, and you’re still here! You can’t even do this simple task. If you can’t, you better not come here to work.”<br/><br/>Xiao Siqian received the goods without knowing why, and was scolded without knowing why. His face turned unhappy, as he replied, “I have never pulled anything like this before. How can I deliver it to the workshop? And who are you to judge me? This is your job; you handed it to me and I’m doing you a favor by helping you. You went into the Toilet for half an hour before coming out. Did you fill up the whole Toilet or something?”<br/><br/>The man, hearing Xiao Siqian’s words, was furious.<br/><br/>He angrily pointed at Xiao Siqian and yelled, “You’re new here, and I let you do some work because I respect you. Do you know who I am? I’ll have you believe that I could have you kicked out with a single word!”<br/><br/>Xiao Siqian replied with a dark expression, “I don’t care who you are. All I know is, this is your job. You handed your work to me without my consent, and whether I completed it or not, you have no right to criticize me.<br/><br/>And, are you trying to be lazy and get me to do your work? Why did it take you half an hour to go to the Toilet? Why didn’t you deliver the goods to the workshop first and then go?”<br/><br/>Perhaps it was because Xiao Siqian had hit the nail on the head, the man was pointing at him with his face green..\t\t\t\t\t\t</div>", "images": {}, "success": true}