{"id": 97, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14235641.html", "title": "Chapter 97 - Chapter 97: Chapter 97: Lively 3 (First Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 97 - Chapter 97: Chapter 97: Lively 3 (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 97: Chapter 97: Lively 3 (First Update)<br/><br/>Translator: 549690339<br/><br/>“Since you’re already 18 years old, let Cousin Xin have a taste.” Xiao Junxuan said.<br/><br/>Gao Jianjun nodded, “Alright, give it a try. But remember, Xiao Xin, not to be greedy for more! ”<br/><br/>“Great, thanks Dad!” Gao Yanxin happily said, “I just thought the smell of the wine was really good, and I wanted to try it, I definitely won’t be greedy.”<br/><br/>“Dad, come on, have a drink too!” Xiao Wanshan first poured a glass of wine for his father-in-law.<br/><br/>His father-in-law had been able to drink since he was young, and his alcohol tolerance was not small.<br/><br/>Now that he’s old, although the family didn’t forbid him to drink, they would only let him have a little.<br/><br/>“Alright, I’ll have a glass too. My dear wife, it’s not that I want to drink, it’s your son-in-law who’s pouring it for me.” The grandfather looked at his grandmother and laughed.<br/><br/>Grandmother laughed and said, “Alright, today I’ll let you drink a glass for the sake of your two sons-in-law. But remember, old man, you can only drink one glass, no more allowed.”<br/><br/>Not only did Jinli, who was young and strictly forbidden from drinking, but also Xiao’s mother and Ji Yuzhu each poured a glass.<br/><br/>“Come on, try these dishes!” Xiao Mother beckoned, “These two dishes are picked from Little Bao’s greenhouse.”<br/><br/>She pointed to the scrambled eggs with chives and a plate of stir-fried baby bok Choy, and continued, “They both taste really good, you should all try them!”<br/><br/>“Haha, I definitely have to try the vegetables Jinli grows.” The grandfather first picked up a pair of chopsticks and tasted the chives. As soon as he tasted them, his eyes lit up, and he said while eating, “These chives are so fragrant, with a rich chives aroma and a hint of egg flavor, they’re so delicious.”<br/><br/>“Yes, this dish is really delicious!” Ji Yuzhu, who had tasted the dish, spoke up, “When I was in the kitchen, I said I’d try some, but after one bite, I ate half of the plate.”<br/><br/>Everyone heard the grandfather and the little aunt talking like that, and their chopsticks immediately reached for the plate of chives.<br/><br/>“Ah, it’s so delicious, how can it be so delicious?” Gao Yanxin kept muttering to himself while eating, “It’s really too delicious! I see that my mom, who usually eats so little, ate half a plate of vegetables all at once. It turns out it’s so delicious!”<br/><br/>Others nodded in agreement, “Yeah! It’s really delicious. The aroma of the chives is so rich, as soon as it touches your tongue, it’s all fragrant.”<br/><br/>Because the dish was so delicious, even though everyone was praising it while eating, they finished it in two or three bites.<br/><br/>Even Xiao’s mother grabbed a few more chopsticks, usually, she chewed her food thoroughly and ate slowly.<br/><br/>Seeing that the big plate of chives was finished, everyone’s eyes then focused on the stir-fried baby bok Choy.<br/><br/>Again, it was the grandfather’s chopsticks that went in first, followed by everyone else’s chopsticks.<br/><br/>“Wow, this green vegetable is also so delicious.” Gao Yanxin said while eating,<br/><br/>“I’ve never tasted such delicious green vegetables from childhood to now.”<br/><br/>“What are you talking about? From childhood till now, you’ve been the pickiest eater, except for fish and seafood, you don’t eat ordinary vegetables at all.” Ji<br/><br/>Yuzhu said while eating, “The only green vegetable you like is scrambled eggs with chives!”<br/><br/>“That’s right, you were so picky when you were young.” Grandmother also nodded in agreement, “No, even now, you’re still picky – if you can avoid eating green vegetables, you will!”<br/><br/>Gao Yanxin argued, “If the green vegetables I ate in the past tasted as good as these, I wouldn’t have been picky at all. It would be foolish to be picky when it comes to such delicious green vegetables!”<br/><br/>In two or three bites, everyone finished the plate of green vegetables as well.<br/><br/>Everyone looked at the two empty plates and smiled at the wine in their glasses.<br/><br/>“Haha, I never thought that, one day, eating two green vegetable dishes could be so enjoyable,” said Xiao Wanshan. “Xiao Bao, how did you make these dishes? They are so fragrant and tempting.”<br/><br/>Xiao Jinli said, “Well, this is how I grow them. I think it might be because of the earthworms. No, it’s also my mom’s excellent cooking skills that make these two dishes so delicious.”<br/><br/>Xiao’s mother smiled and said, “I dare not take credit for that. These dishes taste good mainly because of the high-quality ingredients. You know, I’ve made the same two dishes before, and they didn’t taste as good.”<br/><br/>Xiao Junxuan chimed in, “Yes, yes, I also think it’s a matter of the ingredients. As for why my sister can grow such delicious vegetables, it might be just as she guessed: the contribution of the earthworms is significant.”<br/><br/>“Yes, yes, it’s the earthworms!” Xiao Jinli nodded.<br/><br/>“Elder aunt, we should make these two dishes again tonight,” Gao Yanxin said.<br/><br/>“All right,” Xiao’s mother nodded, “There are not only these two kinds of vegetables in the greenhouse. Tonight, let’s have a vegetarian meal and stir-fry a few more greenhouse vegetables.”<br/><br/>“Okay, okay, after we finish eating, cousin, I’m going to your field to pick some vegetables. I saw many kinds of vegetables in the greenhouse, and some are not common ones. I want to try them all,” Gao Yanxin said without any politeness.<br/><br/>Xiao Jinli also generously said, “Fine, you can pick whatever you want. If you want to have stir-fried earthworms, I can catch them for you too.”<br/><br/>“Earthworms? I’ll pass on that,” Gao Yanxin shook his head when he heard about using earthworms as a dish. “I can’t eat that.”<br/><br/>“Why not? Just think of them as snakes,” Xiao Jinli said with a smile. “Don’t you like to eat snake meat?”<br/><br/>“Snakes? You look at those earthworms, which part of them looks like a snake?” Gao Yanxin said. “Snakes have meat, but where is the meat in earthworms? They’re just a layer of skin, their bodies are filled with mud.”<br/><br/>“Haha, you said that these earthworms don’t look like snakes, but a snake-like creature scared your mom badly, ” said the maternal grandmother with a laugh.<br/><br/>“Mom, what are you talking about?” Ji Yuzhu said helplessly, “It seems that my dark past will be mentioned for a long time.”<br/><br/>The atmosphere during the meal was harmonious, joyful, and warm.<br/><br/>Xiao Siqian, looking at his lively family, had some bitterness and loneliness in his lowered eyes.<br/><br/>However, he quickly regained his composure and collected his emotions.<br/><br/>At least in this home, he had experienced warmth and happiness.<br/><br/>Everyone enjoyed the noon meal.<br/><br/>Although everyone finished the first two dishes, they didn’t neglect the other dishes.<br/><br/>By the time everyone had eaten their fill, the ten or so plates of dishes on the dining table had been practically wiped clean.<br/><br/>“Ah, elder aunt’s cooking is so good,” Gao Yanxin said as he slouched on the stool, rubbing his full stomach, “I am so stuffed. Mom, I am puzzled. You and elder aunt were born to the same parents, but how come elder aunt’s cooking is so good, and yours is so bad?”<br/><br/>“You little brat, now you’re complaining about my bad cooking, huh?” Ji Yuzhu laughed and scolded. “Didn’t you eat a lot of it before?”<br/><br/>“I had no choice back then,” Gao Yanxin seriously exposed her. “Dad was not home. If I didn’t eat the meals you cooked, I would have starved to death.”<br/><br/>“You little brat, you’re just begging for a beating!” Ji Yuzhu said as she slapped her son on the head. “I raised you, and now you’re complaining..”\t\t\t\t\t\t</div>", "images": {}, "success": true}