{"id": 94, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14235635.html", "title": "Chapter 94 - Chapter 94: Chapter 94: Maternal Grandmother And Maternal Grandfather Arrived (Second Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 94 - Chapter 94: Chapter 94: Maternal Grandmother And Maternal Grandfather Arrived (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 94: Chapter 94: Maternal Grandmother and Maternal Grandfather Arrived (Second Update)<br/><br/>Translator: 549690339<br/><br/>“They’re here, they’re here!”<br/><br/>Xiao Jinli stood at the entrance of the courtyard, watching from afar as three cars slowly approached.<br/><br/>Xiao Siqian squinted at the other two cars.<br/><br/>It seems that their maternal aunt’s family is doing pretty well.<br/><br/>After a while, the cars stopped at the entrance.<br/><br/>Xiao Jinli immediately ran to the second car, opened the door, and sweetly called, “Grandpa, Grandma!”<br/><br/>Moments later, two spirited and healthy-looking elderly people stepped out. Although there were a few white hairs in their temples, their faces were flushed red. They were dressed simply but neatly, looking very approachable and friendly. However, the old man was slightly more serious.<br/><br/>But his seriousness couldn’t resist Xiao Jinli.<br/><br/>“Oh, my good baby, my good baby, Grandma missed you so much. You’ve grown taller and even more beautiful.”<br/><br/>As soon as they met, Grandma hugged Xiao Jinli.<br/><br/>Xiao Jinli said, “Grandma, I missed you too, I really did.”<br/><br/>At this time, they could only call each other every day, unable to see each other in person.<br/><br/>Grandpa seemed a little unhappy, “Doesn’t my good baby miss Grandpa as well?”<br/><br/>“Of course, I miss Grandpa too, I miss both of you!” Xiao Jinli said, and then gave her grandpa a hug as well, “Seeing you both in such good spirits makes me so happy!”<br/><br/>“Haha, my good baby, you’re always the most considerate.”<br/><br/>At this time, the maternal aunt’s family of three also got out of the car.<br/><br/>The maternal aunt and Xiao’s mother looked somewhat similar, both tall and with fair skin. Wearing light makeup, a floral dress, and black sandals, she was a beautiful woman.<br/><br/>Standing next to her was an elegant-looking man in his thirties or forties, dressed in a suit and shoes, wearing black-rimmed glasses, exuding a refined, polite demeanor.<br/><br/>The other person was a young man who looked about the same age as Xiao Siqian, tall but slightly chubby.<br/><br/>As soon as Gao Yanxin got out of the car, he took Xiao Jinli from her grandfather’s arms, hugged her excitedly and happily, saying, “Cousin! Cousin!<br/><br/>I’ve missed you so much!”<br/><br/>Gao Yanxin held her so tightly that Xiao Jinli struggled a bit before helplessly smiling sweetly, “Cousin, I’ve missed you too. Can you let me go first? You’re holding me too tight, I can’t breathe!”<br/><br/>Gao Jianjun immediately slapped his son on the shoulder and scolded, “You idiot, did you hear her? Put your cousin down. The older you get, the more rude you become. You’re so big and your cousin is so delicate, why are you using so much force to hold her?”<br/><br/>Gao Yanxin put Xiao Jinli down, grinned and said, “I haven’t seen my cousin in so long, I’m just excited and happy.”<br/><br/>The maternal aunt, Ji Yuzhu, playfully hit his head and laughed, “With your strength, you could win a weightlifting championship, or at least a silver medal, not many people are as strong as you.”<br/><br/>Gao Yanxin was not convinced, “It’s not that exaggerated. I used to hold her when we were kids, too.”<br/><br/>“You idiot, you still talk about when you were kids. As soon as your cousin was in your arms, she would cry her eyes out,” the maternal aunt was even angrier, “At first we didn’t know why; we thought your cousin didn’t like you. Turns out you were holding her so tight, it was uncomfortable.”<br/><br/>Thinking about his childhood embarrassment, Gao Yanxin’s face turned red.<br/><br/>When he was a child, he loved his cousin so much that he always wanted to hold her whenever he saw her. But as soon as he picked her up, she would start crying. So, the adults strictly forbade him from holding his cousin.<br/><br/>Later, he found out that it was because he held her too tight, making her uncomfortable. He tried to use less strength while holding her, but then he was afraid of dropping the delicate girl. So he could only watch tearfully as his cousins fought to hold her.<br/><br/>Xiao Jinli laughed and said, “I’m not a kid anymore, I won’t cry just because<br/><br/>Cousin Yanxin holds me. Mom, Dad, I’ve missed you, too.”<br/><br/>The maternal aunt hugged Xiao Jinli softly and laughed, saying, “Hehe, your ad and I have missed you, too. We decided to come and see you during your break, you little ungrateful one.”<br/><br/>Xiao Jinli immediately said, “Little Aunt, how did I become such a heartless person? I think about you every day.”<br/><br/>Little Aunt nodded, “Hmm, you think about me, but you don’t know how to call me more often. Every time I have to call you first!”<br/><br/>Xiao Jinli, ‘<br/><br/>“Jinli has grown taller and even more beautiful!” Uncle said at this time. “Come, don’t stand at the door, let’s go inside and chat.” Xiao Wanshan said.<br/><br/>“Good baby, I bought you many beautiful dresses in Licheng, you can try them on later.” Maternal Grandmother happily said.<br/><br/>“Ok, thank you, Grandma.”<br/><br/>“Cousin, I also bought you a gift, do you know what it is?” Gao Yanxin approached with an eager expression.<br/><br/>Xiao Jinli laughed and said, “Cousin Yanxin, you want to surprise me, I really can’t guess.”<br/><br/>She secretly thought, “What else could it be besides those dolls and Barbie dolls.”<br/><br/>Gao Yanxin proudly opened the trunk of the car, took out a rabbit doll that was more than a meter tall, and said, “Look, cousin, this is my gift to you. Do you like it?”<br/><br/>Xiao Jinli nodded, “Yes, I like it!”<br/><br/>Gao Yanxin said, “Hehe, I heard girls love these dolls.”<br/><br/>“Thank you, Cousin!” Xiao Jinli took the doll from Gao Yanxin’s hands.<br/><br/>Xiao Siqian watched this warm family scene, without any pretense, insincerity, flattery, or pleasantry, only genuine and simple affection.<br/><br/>Such family bonds are so enviable.<br/><br/>But at this moment, he felt a little lost.<br/><br/>When Xiao Jinli stepped into the gate, she saw Xiao Siqian still standing outside. She ran over with the rabbit doll and then held his hand, saying, “Brother Little Quan, let me introduce you to my maternal grandparents and the others. They all know about you; they just don’t know you yet!”<br/><br/>When Xiao Jinli’s small hand entwined with his big hand, he felt warm all over. He hadn’t been neglected, and she even considered his feelings.<br/><br/>Upon hearing Xiao Jinli’s yell, maternal grandmother also walked over, smiling and saying, “This boy is Xiao Quan, right? He’s so handsome! Xiao Quan, I’m your grandmother.”<br/><br/>For some reason, Xiao Siqian’s eyes felt a little sore as he called out, “Grandma!”<br/><br/>“Eh!” Maternal Grandmother laughed and answered, “What a sensible child!<br/><br/>Come on, let’s go inside.”<br/><br/>Then, she led him into the house with the other hand.<br/><br/>Once inside, even without Xiao Jinli’s introduction, Ji Yuzhu laughed and said, “This is Xiao Quan, right? I heard from my sister that you’re so handsome. Now that I’ve finally seen you, you really are handsome, even more than Xuan’er!<br/><br/>Come on, I’m your Little Aunt.”<br/><br/>“Little Aunt!” Xiao Siqian called out.<br/><br/>“Eh, what a sensible child!” The Little Aunt took out two big red envelopes from her bag and handed them to Xiao Siqian, “Xiao Quan, these are the red envelopes from your maternal grandpa, grandma, aunt, and uncle for the first time we meet. Take them!”<br/><br/>Xiao Siqian had a stunned expression and wanted to refuse.<br/><br/>Xiao Jinli said, “Brother Little Quan, don’t refuse the gift from your elders! Just accept it; it’s a token of their love.”<br/><br/>Xiao Siqian took the two red envelopes with a bit of choked up voice, “Thank you, maternal Grandpa and Grandma, Little Aunt, and Uncle!”<br/><br/>“That’s right; this is how you should be!” Little Aunt said cheerfully..\t\t\t\t\t\t</div>", "images": {}, "success": true}