{"id": 91, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14235619.html", "title": "Chapter 91 - Chapter 91: Chapter 91: Raising And Raising, Then Someone Comes To Buy (Part One)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 91 - Chapter 91: Chapter 91: Raising And Raising, Then Someone Comes To Buy (Part One)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 91: Chapter 91: Raising and Raising, Then Someone Comes to Buy (Part One)<br/><br/>Translator: 549690339<br/><br/>For rural people, the seedlings cultivated by Xiao Jinli were relatively rare.<br/><br/>For example, Purple-Black Sheep Horn Pepper, Purple Cabbage, Spore Kale, Pagoda Cauliflower, Gold Warty Melon, Square Beans, Artichoke, and so on.<br/><br/>Therefore, although there were many people who wanted seedlings, they only took a few to plant.<br/><br/>As long as they could survive and prove valuable, they could be planted again next year.<br/><br/>If they couldn’t survive, it would be a waste of Jinli’s energy to cultivate them.<br/><br/>Of course, it’s not just a matter of grabbing one type of seedling; everyone agrees on what types she plants, so as not to take away all of Xiao Jinli’s seedlings.<br/><br/>After the villagers took some, Xiao Jinli planted the rest herself.<br/><br/>There weren’t many seedlings left, so this five points of land was just about right with a few different types planted.<br/><br/>If there wasn’t enough land, they could always plant on other lands.<br/><br/>Xiao Jinli looked at the earthworms constantly churning in the ditches, and her little eyebrows began to furrow.<br/><br/>Were there too many earthworms now?<br/><br/>In each row of land, there were already thousands of earthworms, and each one was so robust.<br/><br/>Xiao Jinli muttered, “It seems that these earthworms need to be diverted to other lands. Otherwise, if this continues, the whole land will be filled with earthworms, and there will be no meaning to planting.”<br/><br/>As she was pondering, the Village Chief suddenly came in. Seeing the dense earthworms churning in the ditches, he felt a slight tingling in his scalp.<br/><br/>Well, he felt a bit claustrophobic.<br/><br/>The Village Chief looked around and asked, “Jinli, why are there so many earthworms? Will this affect the planting?”<br/><br/>Xiao Jinli said, “Uncle Village Chief, I am just thinking about what to do with these earthworms.”<br/><br/>Upon hearing this, the Village Chief’s eyes lit up. He said, “Jinli, my wife told me that these earthworms not only turn the soil and loosen it, but they also improve the soil, making the crops grow better, right?”<br/><br/>“Yes.” Xiao Jinli nodded, “So I started by raising some earthworms. I didn’t expect them to multiply so much.”<br/><br/>“Is that a lot?” The Village Chief asked with a smile, “Jinli, if you think there are too many earthworms, why don’t you sell some to me? I’ll release them into the fields to improve the soil.”<br/><br/>Xiao Jinli’s eyes brightened and she said excitedly, “Okay, okay. I’ll get a bucket and take some home for you!”<br/><br/>With that, she turned and walked back to the yard, found a small bucket, and took a pair of fire tongs. She asked the Village Chief, “Uncle Village Chief, how many do you want?”<br/><br/>The Village Chief scratched his head and said, “I don’t know how many.”<br/><br/>“Well, how much land do you plan to cover?”<br/><br/>The Village Chief thought for a moment and said, “I have about three acres for growing vegetables. Jinli, let’s start with three acres. You can decide how many earthworms are needed.”<br/><br/>Xiao Jinli squatted down, picked up the fire tongs, and caught the earthworms one by one into the bucket. She said, “I don’t know how many earthworms are appropriate for three acres since my earthworms are so big and long. How about I give you one thousand first?”<br/><br/>The Village Chief agreed, “Alright, let’s do one thousand. Do you have any more fire tongs?”<br/><br/>“There’s another one in the corner at the entrance,” said Xiao Jinli.<br/><br/>The Village Chief went to find the fire tongs.<br/><br/>Then the two of them caught earthworms together in the ditches, counting as they went.<br/><br/>Half an hour later, the bucket was almost full of earthworms.<br/><br/>It was fortunate that the earthworms were so large; otherwise, a thousand earthworms might not even fill a third of the bucket.<br/><br/>Carrying the full bucket of earthworms, the Village Chief asked, “How do you plan to sell these worms? By weight or by quantity?”<br/><br/>“By quantity,” Xiao Jinli said, “I’m selling earthworms for the first time, and you’re my first customer, so I’ll give you a discount. Let’s say one dime per worm. Uncle Village Chief, just give me one hundred yuan.”<br/><br/>“Ha, one dime per worm, isn’t that too cheap?” The Village Chief thought he was getting too good a deal. “Why don’t you raise the price a bit, to three dimes?”<br/><br/>Xiao Jinli smiled and said, “Uncle Village Chief, didn’t I tell you? This is my first time selling earthworms, so I gave you the biggest discount. When I sell them next time, I’m afraid I’ll have to raise the price.”<br/><br/>When the Village Chief heard this, he realized, “Are you going to raise and sell earthworms in the future?”<br/><br/>Xiao Jinli nodded and said, “Yes, I have this plan. However, it depends on how effective these earthworms are. I’ll have to trouble Uncle Village Chief to help me with the experiment. If they work well, I will definitely continue to sell earthworms. If not, these earthworms will just roll around and turn soil in this piece of land.”<br/><br/>“Haha… Alright, let Uncle Village Chief take them back and test their effects,” said the Village Chief happily.<br/><br/>As the Village Chief happily carried a bucket of earthworms from the greenhouse, people along the way asked him about it. He smiled and said, “I bought these from Jinli. She asked me to try their effects. If they work well, she will raise more earthworms to sell.”<br/><br/>“Hehe, if these earthworms can really improve the land and promote the growth of crops, I will definitely buy some too in the future.”<br/><br/>That’s what the villagers said.<br/><br/>After the Village Chief left, Xiao Zhi was frantically shouting in Xiao Jinli’s mental sea, “Ah, Master, are you really selling earthworms? Do you really want to get rich by selling these earthworms?”<br/><br/>Xiao Jinli looked very calm. She said, “Why worry, this is just the beginning. What if the villagers don’t buy the earthworms later?”<br/><br/>Xiao Zhi angrily retorted, “How is that possible? You should know that those earthworms have been raised with Lingquan water. Now 80% of the water stored in their bodies is Lingquan water. Once the earthworms roll around in the fields a few more times and squeeze out the Lingquan water, how could the soil and land not improve? Ah! Can the things planted in this land with Lingquan water not be good?”<br/><br/>“Isn’t this better! The more earthworms I sell, the more the villagers’ soil improves. In a way, it means I’ve helped the villagers secretly, right?”<br/><br/>Xiao Zhi suddenly realized and said, “So, it’s all about raising earthworms to help these villagers?”<br/><br/>Xiao Jinli’s lips curled up, “Yes! The villagers here are very simple and kind-hearted. In the village for over 10 years, everyone has called me the Lucky Star and the village treasure, but I haven’t really been able to help them effectively.”<br/><br/>“How can you say you haven’t helped?” disagreed Xiao Zhi. “You’ve been dealing with all kinds of things for the villagers since you were a child!”<br/><br/>“Yes, because I’ve handled village affairs, the villagers respect me,” nodded Xiao Jinli. “But what I want to do is to truly help the villagers out of poverty and lead them to a moderately prosperous life!”<br/><br/>Xiao Zhi,\t\t\t\t\t\t</div>", "images": {}, "success": true}