{"id": 92, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14235620.html", "title": "Chapter 92 - Chapter 92: Chapter 92: Selling Earthworms! (Second Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 92 - Chapter 92: Chapter 92: Selling Earthworms! (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 92: Chapter 92: Selling Earthworms! (Second Update)<br/><br/>Translator: 549690339<br/><br/>Xiao’s mother and father didn’t understand; their Jinli was obviously planting vegetables in the greenhouse, but somehow, he ended up raising earthworms instead?<br/><br/>Not only had he raised a large number of earthworms, but the crops he had grown were also big, strong, and verdant – better than what experienced farmers could grow.<br/><br/>Xiao’s mother looked at Xiao’s father doubtfully and said, “Honey, does Jinli have a natural gift for farming? Who did he inherit this from?”<br/><br/>Xiao’s father,<br/><br/>Farming doesn’t have anything to do with natural talent; it’s all about being diligent and good at management.<br/><br/>Xiao Junxuan chimed in, “He must have inherited it from dad. Grandma told me that before dad became a little gangster, he followed granddad into the field and could grow anything with his carefree poking.”<br/><br/>Xiao’s father, “…” What do you mean by carefree poking? He was serious about it, alright?<br/><br/>Xiao Jinli then agreed from the side, “Mm-hmm, Jinli must have inherited dad’s farming talent!”<br/><br/>She then added, “My brother inherited mom’s cooking talent, and I inherited dad’s farming talent. Yes, it’s fair!”<br/><br/>Xiao’s mother and others, “…” Can the inheritance be really considered fair? “Pfft!” Xiao Siqian burst into laughter, “Little Sister Jinli is so cute!”<br/><br/>Xiao Junxuan immediately replied proudly, “My sister, Xiao Jinli, is of course cute and pretty.”<br/><br/>“Right, your sister’s cuteness and prettiness are obviously inherited from your mom.” Xiao’s father suddenly added, “You have no idea how pretty and lively your mom was when she was young!”<br/><br/>Xiao siblings and Xiao Siqian, “Oh, another show of love.”<br/><br/>“Jinli, is that greenhouse for growing crops or raising earthworms?” Xiao’s father asked, “Do you need dad’s help for anything?”<br/><br/>Xiao Jinli said, “Farming and breeding shouldn’t be a problem.”<br/><br/>Xiao’s mother stated, “Mm, I see that the things grown in the greenhouse are all looking good. Raising earthworms and farming at the same time shouldn’t be an issue as long as it’s well managed.”<br/><br/>Xiao Junxuan suddenly asked, “Sister, do you sell these earthworms to other places besides the village?”<br/><br/>Xiao Jinli shook her head, “I’ll sell them to the village for now. I’ll consider selling them to other places later!”<br/><br/>Her real purpose was to help the villagers through these earthworms, not to make a business out of them.<br/><br/>Of course, if the earthworm business has a market, it should be feasible to continue.<br/><br/>When the villagers heard that the Village Head had bought earthworms from Xiao Jinli and put them in the field, many people would go to check it out every once in a while, observing the earthworms’ activities.<br/><br/>“At first glance, these earthworms seem soft and big, which is a bit scary. But now that I see them turning the soil and constantly burrowing, they seem quite cute.”<br/><br/>“Haha, this one is so big that if you didn’t know better, you’d think it was a snake and get a big scare.”<br/><br/>“How many days have these earthworms been in the ground?”<br/><br/>“Mmm, it should be a week now.”<br/><br/>“The soil was already turned, and the ridges were made, so it should be ready for planting vegetables.”<br/><br/>“Yeah, Chen Qiulan said they’ll plant things in a couple of days.” “Once it’s planted, we can see the growth of the things in the field.”<br/><br/>Five days later, the villagers went to the Village Head’s fields again.<br/><br/>The Village Head’s wife had planted cabbage, pepper, eggplant, and other vegetables in the field.<br/><br/>“Look, these vegetables were just planted and haven’t wilted. After just a few days, they’re already so green?”<br/><br/>“Yeah, they’re growing really well.”<br/><br/>Generally speaking, newly transplanted crops, due to unstable root systems and poor absorption, will experience wilting before recovering after three or five days.<br/><br/>“These newly planted crops haven’t wilted, which means they are absorbing well. Haha, it seems that these earthworms really are useful. No, I have to go and buy some from Jinli and put them in my field.”<br/><br/>“I’ll also buy some.”<br/><br/>Seeing the growth of the crops, the villagers’ hearts were itching to try. “If everyone squeezes to buy, will Jinli have that many earthworms?” “That’s true. Anyway, let’s go and ask first. Let’s see if Jinli can spare some.”<br/><br/>Still outside the door, the villagers shouted, “Jinli, Jinli.”<br/><br/>Xiao’s mother came out of the house and asked with a smile, “Sister-in-law, what can I help you with?”<br/><br/>“Mm, we want to buy some earthworms. Jinli isn’t out, is she?”<br/><br/>“No, she’s in the greenhouse right now. Ever since the greenhouse was built, she’s been tinkering around in there most of the time.”<br/><br/>“Alright, Xiaofang, let’s go find Jinli.”<br/><br/>“I’m coming with you!”<br/><br/>When the villagers arrived at the greenhouse, Jinli was holding fire tongs, picking earthworms from the gutter and putting them into the plastic bucket.<br/><br/>Seeing the dense earthworms on the ground, their scalps felt a bit numb.<br/><br/>But thinking of the purpose of these earthworms, they became excited again.<br/><br/>“There are so many earthworms.” A villager exclaimed, “How did Jinli raise them, I wonder?”<br/><br/>“People have their own secrets and techniques; let’s not ask.” Another villager reminded.<br/><br/>After all, if earthworms prove useful, they could make money in the future, and that would be a business opportunity.<br/><br/>“Jinli, what are you doing with so many earthworms?”<br/><br/>“There are too many of them. I wanted to move them to other places. Auntie, do you need anything?” Jinli stopped what she was doing and asked.<br/><br/>“Hehe, Jinli, we came to find you to buy some earthworms. Are you still selling these earthworms?”<br/><br/>“Yes,” Jinli nodded, “I sold some to Uncle Village Chief last time and was wondering when someone would buy them again. And here you are.”<br/><br/>“Ah, that’s great.” The villagers were delighted, “Then sell some to us. How much can you sell? Let’s see if it’s enough for all of us here.”<br/><br/>There were seven or eight of them in the group.<br/><br/>Jinli nodded, “It should be enough. One thousand per person is no problem. How many do you want?”<br/><br/>“One thousand per person? Then just give me one thousand.”<br/><br/>Someone suggested, “How about giving us one thousand per person first? If there are more, we can share again.”<br/><br/>Of course, the others had no objections, and Jinli agreed even more.<br/><br/>Jinli said, “Mm, but we don’t have that many buckets and fire tongs at home, so you’ll have to bring your own.”<br/><br/>“No problem.”<br/><br/>Then, the villagers hurried back to get their own buckets and fire tongs.<br/><br/>Xiao’s mother came over and asked, “Jinli, everyone wants to buy these earthworms, how are you going to sell them?”<br/><br/>“One point five cents per worm,” Jinli said, “I offered a discount last time when I sold them to Uncle Village Chief for one cent per worm. Now I’m back to the original price..”\t\t\t\t\t\t</div>", "images": {}, "success": true}