{"id": 90, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14235618.html", "title": "Chapter 90 - Chapter 90: Chapter 90: Should We Start Raising Earthworms To Get Rich? (Second Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 90 - Chapter 90: Chapter 90: Should We Start Raising Earthworms To Get Rich? (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 90: Chapter 90: Should We Start Raising Earthworms to Get Rich? (Second Update)<br/><br/>Translator: 549690339<br/><br/>In the Space, Xiao Jinli sat on the swing he built himself, which was entwined with grapevines and fresh flowers.<br/><br/>Little Zhi landed on a petal, asking puzzledly, “Master, are you really going to raise earthworms?”<br/><br/>Xiao Jinli pondered for a moment, murmured, “Or maybe, we start our path to prosperity by raising earthworms?”<br/><br/>“But Master, isn’t your goal to grow vegetables?” Little Zhi said excitedly, “Your goal is clearly to grow vegetables, so why did you suddenly think of raising earthworms, these soft and squishy creatures?”<br/><br/>Having said that, he paused for a moment and asked with skepticism, “Master, are you really going to raise earthworms?”<br/><br/>Xiao Jinli shrugged his shoulders and laughed, “Who knows? Let’s try it out!”.<br/><br/>He paused for a moment, then added, “Actually, raising earthworms is really a lucrative business. Seriously!”<br/><br/>“What lucrative prospects!” Little Zhi exclaimed, “It doesn’t come close to the profits you’d get from growing vegetables. As long as you plant vegetables and sell them, money will come.”<br/><br/>“But don’t you think solely planting vegetables is too mainstream?” Xin Jinli commented casually.<br/><br/>“Mainstream? How is it mainstream?” Little Zhi objected, “The vegetables we grow can strengthen the body, prolong lifespan, and even cure diseases. They couldn’t be any better!”<br/><br/>Xiao Jinli nodded, “Yes, they are indeed very good. So, do you think these things can be sold?”<br/><br/>Little Zhi, “…” was suddenly speechless.<br/><br/>Indeed, he had a point.<br/><br/>Little Zhi slumped in disappointment and said, “What can we do then? It’s so heart-wrenching. There’s a clear path to wealth in front of us, but we can’t make use of it.’<br/><br/>Xiao Jinli cast him a glance and retorted irritably, “Alright, enough with the act. You’re an Al, can you actually feel heartbroken?”<br/><br/>“I now possess emotions and desires, so why can’t I feel heartbroken?” Little Zhi defended, “Also, if you don’t grow more fruits and vegetables, Little Space will also feel heartbroken.<br/><br/>“Little Space?” Xiao Jinli seemed puzzled, “Isn’t he still in hibernation?”<br/><br/>Little Zhi told the truth, “After recovering for over ten years, he occasionally wakes up now. However, his power is not strong enough and his body is still weak.”<br/><br/>Xiao Jinli sighed softly, “Well then, I’ll grow more vegetables.”<br/><br/>As for raising earthworms, it appears a plan still needs to be formulated.<br/><br/>Xiao Jinli had grown a variety of vegetables in the greenhouse, but he also raised a lot of earthworms, which got the attention of the villagers.<br/><br/>When they were free, they would come to watch the commotion. “Wow, how did Jinli raise such big earthworms?”<br/><br/>“Yes, they are huge. I thought it was a snake when I didn’t know.”<br/><br/>“Haha, if it were really a snake, the sight of so many would give you goosebumps.”<br/><br/>After all, most people are afraid of snakes.<br/><br/>“Look, these seedlings are also growing very well, they look stout.”<br/><br/>“Yeah, it’s not just one type of seedling that grows well, it seems like every type grows well.”<br/><br/>“Jinli, could you sell me some chili seedlings. The chili seedlings you have definitely bear a lot of peppers once they mature,” Chen Qiulan asked smilingly, “What type of pepper is this?”<br/><br/>Xiao Jinli took out a bag from the corner, looked at the label, and then said,<br/><br/>“Auntie, this is Black Goat Horn Pepper.”<br/><br/>“…” Chen Qiulan asked confusedly, “What kind of pepper is that? I’ve never heard of it before.<br/><br/>They only plant a few types of chilis usually.<br/><br/>Xiao Jinli handed her the packaging bag and said, “Auntie, there is a picture of the pepper here, have a look!”<br/><br/>She bought it because she thought the pepper was distinctive.<br/><br/>Auntie Chen couldn’t read, but there was a picture on the packaging bag. She asked, “Is this pepper very spicy?”<br/><br/>Xiao Jinli tilted his head slightly and responded, “The vendor who sold me the seeds said it was spicy. This type of pepper is rich in anthocyanin and can balance capsaicin. So even if you eat a lot, you won’t get pimples, and you can continuously harvest for about a year after planting one.”<br/><br/>Aunt Chen didn’t understand what anthocyanin and capsaicin were, but she did understand that the peppers were spicy.<br/><br/>Her eyes lit up and she said, “Can one plant be harvested for a year? Is it really that good? If so, I’ll try to plant a few.”<br/><br/>Xiao Jinli nodded and said, “Okay, Auntie, how many plants do you want? You can dig them up yourself.”<br/><br/>“I’ll start with ten. If they grow well, I’ll plant more”, Auntie Chen replied.<br/><br/>Another aunt said, “Jinli, your cabbage seedlings are growing well, can I take a few home to plant?”<br/><br/>Xiao Jinli nodded and said, “Okay, Auntie, how many plants do you want? You can dig them up yourself.”<br/><br/>“I’ll start with ten. If they grow well, I’ll plant more”, Auntie Chen replied.<br/><br/>“Thank you so much, Jinli”, Everyone was very grateful.<br/><br/>“Jinli, is this the first time you’re cultivating these seedlings?” Auntie Chen asked with a hint of curiosity, “You are doing a much better job than us who have been planting for decades. Dear, Jinli, do you have a talent for growing vegetables?”<br/><br/>Laughing, Xiao Jinli said modestly, “Hehe, I am talented in everything I do, aren’t I?”<br/><br/>“Haha, true. Despite his young age, Jinli does everything meticulously, even better than us adults.”<br/><br/>“Jinli, could you tell us how you managed to grow these crops so well?” Everyone was understandably curious.<br/><br/>With an adult-like voice, Xiao Jinli explained, “Um, the greenhouse I built is for researching various crops. After some study, I had a sudden idea to mix all the fertilizer, manure, and water in certain proportions. I then spread this mixture on the soil and stirred it well. After that, I introduced earthworms into the soil.<br/><br/>Besides loosening the soil, the earthworms can also break down organic matter, creating favourable conditions for soil organisms to grow and multiply, thereby improving the soil. This makes it easier for seeds and seedlings to better absorb nutrients from their root systems!” Of course, the real factor was the Lingquan water she used.<br/><br/>However, it’s better not to mention this as it’s a secret.<br/><br/>The womenfolk seemed to understand yet also didn’t, “Oh, I see. So, the earthworms play a significant role here?”<br/><br/>They never realized before that earthworms played such a big role in crop growth.<br/><br/>Or was it that they hadn’t paid attention before?<br/><br/>Xiao Jinli nodded and said, “Yes, basically that’s it. The interaction between soil organisms and the earthworms in the soil greatly aids plant growth and absorption.”<br/><br/>‘Oh, that’s how it is!”<br/><br/>Everyone nodded their heads.<br/><br/>In fact, they didn’t really understand.<br/><br/>Of course, it might be difficult for Xiao Jinli to fool those who are educated, like her brother.<br/><br/>As for her brother, he certainly wouldn’t undermine his own sister..\t\t\t\t\t\t</div>", "images": {}, "success": true}