{"id": 99, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14235645.html", "title": "Chapter 99 - Chapter 99: Chapter 99: A Variety Of Vegetables (Part One)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 99 - Chapter 99: Chapter 99: A Variety Of Vegetables (Part One)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 99: Chapter 99: A variety of vegetables (Part One)<br/><br/>Translator: 549690339<br/><br/>After Cow King tearfully finished eating the canned meat that Brother Gao Yanxin gave him, Gao Yanxin reluctantly said goodbye and said, “Brother Cow King, I will come and see you again tomorrow. Also, I will take these cans back and bring them again tomorrow.”<br/><br/>Cow King mooed twice and said, “You idiot, don’t come back, every time I see you, I suffer!”<br/><br/>But to Gao Yanxin’s ears, it was Cow King warmly welcoming him. So, he happily left.<br/><br/>Xiao Siqian glanced at Cow King and then at Gao Yanxin’s back, always feeling that Cow King was scolding Gao Yanxin, but he was unaware of it.<br/><br/>After the three of them left, they arrived inside the greenhouse.<br/><br/>As soon as they arrived in the greenhouse, Gao Yanxin’s excited voice came.<br/><br/>“Wow, these vegetables are so beautiful, just like flowers!” Gao Yanxin said loudly, “They could be planted in pots. It would be a pity to eat them.”<br/><br/>Those rare varieties indeed looked like flowers.<br/><br/>Ji Yuzhu and Gao Jianjun also came to the greenhouse.<br/><br/>Once Ji Yuzhu knew that the soft worms in the greenhouse were earthworms, she was no longer afraid.<br/><br/>After all, she had dug up countless earthworms when she was a child.<br/><br/>Ji Yuzhu laughed and said, “If you think it’s a pity, don’t eat them when they are cooked.”<br/><br/>“That’s not right!” Gao Yanxin refused, “Although they look like flowers, they are not flowers but vegetables. Vegetables are for eating.”<br/><br/>Based on this morning’s taste of chives and small cabbage, the taste of other vegetables will not be bad.<br/><br/>Ji Yuzhu smiled and said, “You have a lot of reasons.”<br/><br/>She looked around at the vegetables in the greenhouse and said, “There are so many varieties, which dishes should we eat tonight?”<br/><br/>It is impossible to cook all thirty or forty kinds of vegetables.<br/><br/>Gao Yanxin said, “I want to eat chives and small cabbage again and a cold mixed tomatoes. Cousin, what kind of vegetable is this?”<br/><br/>“This is Spore Kale.” “What about the one that looks like an egg?”<br/><br/>“Egg Eggplant!”<br/><br/>“Wow, this vegetable is so beautiful, green and jade-like, resembling a jade pagoda. What kind of vegetable is this?”<br/><br/>“Well, this is Pagoda Vegetable!”<br/><br/>After Gao Yanxin asked about all the unfamiliar vegetables, he picked seven or eight kinds of vegetables and said, “Let’s cook these dishes tonight. I will eat the rest of the vegetables tomorrow and the day after. Anyway, I must taste them all over these days.”<br/><br/>Ji Yuzhu laughed and said, “Son, weren’t you a meat-eater? When did you become a vegetarian? If you taste all the vegetables in your cousin’s greenhouse, do you have to taste them all before you are willing to leave?” “That’s actually possible!” Gao Jianjun echoed his wife’s words, “This disaster, he won’t leave without causing all the disaster!”<br/><br/>Especially after tasting the two dishes in the morning, the taste was really extraordinary.<br/><br/>Not only that, he didn’t know whether it was because of the drinking or the vegetables, but after sleeping they felt particularly comfortable. That made him want to stay for a few more days.<br/><br/>Gao Yanxin also argued, “Dad, I am not a disaster. There are so many vegetables in this greenhouse, why should I taste them all? If I finish tasting them all, it must be because everyone is together.”<br/><br/>Then, everyone picked vegetables together. It took some time to clean the seven or eight vegetarian dishes.<br/><br/>However, many hands make light work.<br/><br/>Xiao Wanshan had tea with his father-in-law and Gao Jianjun in the house, and the others joined in the work.<br/><br/>“Xuan’er, Xiao Quan, Xin’er, and good baby, you go to the house to talk to your grandpa. We can handle this work.” The maternal grandmother laughed, “Your grandpa likes to have more people and talk to them.”<br/><br/>Xiao Junxuan said, “Okay, Grandma, we will go in and accompany Grandpa for a chat.”<br/><br/>“Okay, grandma, we will go in and accompany grandpa for a chat,” Gao Yanxin said.<br/><br/>Ji Yuzhu rolled her eyes a bit and said, “Hurry up and go. After all, you don’t do much of this work at home, it’s better to talk to grandpa more.”<br/><br/>Gao Yanxin spread his hands and said, “Alright.”<br/><br/>Ji Yuzhu looked at Xiao Siqian and said, “Xiao Quan, you and Jinli go ahead too.<br/><br/>Jinli, listen, your grandpa is calling you.”<br/><br/>While washing the vegetables, Xiao Jinli replied, “Here I come, Grandpa. Brother Little Quan, let’s go.”<br/><br/>A group of children went to accompany their grandpa, leaving Ji Yuzhu and the maternal grandmother to quickly clean the freshly picked vegetables.<br/><br/>Ji Yuzhu looked at the lovely green vegetables and laughed as she said to her grandmother, “I don’t know how Jinli planted these vegetables, but they are really beautiful and delicious.”<br/><br/>The grandmother laughed and said, “Our good baby has been called a fortune since she was a child, so whatever she does is extraordinary.”<br/><br/>Everyone loved this granddaughter very much.<br/><br/>Grandma had four children, two boys and two girls. But besides Xiao Jinli, the others were all sons.<br/><br/>In a sense, Xiao Jinli was the precious daughter of her maiden family.<br/><br/>Ji Yuzhu nodded, “Yes, Jinli has always been different from other children since she was a child. She is a sensible and intelligent child. At a young age, no problem was a problem in her hands.”<br/><br/>On the other side, when Xiao Jinli walked over, the maternal grandfather asked, “Good baby, are those earthworms you raised in the greenhouse going to be sold?”<br/><br/>Xiao Jinli thought for a moment and said, “These earthworms are mainly for our family and the village.”<br/><br/>Grandfather nodded, “So, you have no intention of selling them outside for now.”<br/><br/>“Yes,” Xiao Jinli said, “I am just on vacation now. When school starts, I won’t have much time to deal with these things. So, I don’t know if there will be any surplus to sell to other villages in the future. However, if relatives and friends want them, they can tell me in advance, and I will prepare them.”<br/><br/>The Xiao Family and Xiao’s mother’s families have many relatives and friends, and many of them have good relationships. If those people came asking, they would definitely have to sell some to them. Otherwise, there would be no family or friend’s affection left.<br/><br/>Listening to Xiao Jinli’s words, the grandfather was very happy and nodded,<br/><br/>“Yes, our family’s good baby is a sensible and intelligent child.”<br/><br/>She naturally understood some worldliness and human relationships without being taught by adults.<br/><br/>Gao Jianguo also nodded in agreement, “Yes, it is rare to see such a smart and sensible child as Jinli.” At least he had not seen many.<br/><br/>Xiao Wanshan laughed and said, “Dad, brother-in-law, don’t praise her anymore. If you keep praising her, her tail will stick up to the sky.”<br/><br/>Xiao Jinli immediately said with slight dissatisfaction, “Dad, you are not a rooster, so you don’t have a tail.”<br/><br/>“Yes, yes, you are not a rooster, you don’t have a tail, Dad is wrong. Hahaha…” Xiao Wanshan laughed cheerfully..\t\t\t\t\t\t</div>", "images": {}, "success": true}