{"id": 96, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14235639.html", "title": "Chapter 96 - Chapter 96: Chapter 96: Lively 2 (Second Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 96 - Chapter 96: Chapter 96: Lively 2 (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 96: Chapter 96: Lively 2 (Second Update)<br/><br/>Translator: 549690339<br/><br/>“Huh, one point five cents per worm, and sold twenty thousand of them.” Ji Yuzhu was surprised, “Jinli is so young and already knows how to make money, not bad!”<br/><br/>Gao Jianjun was also quite surprised.<br/><br/>These earthworms were actually raised by Jinli, how on earth did she raise them?<br/><br/>Gao Jianjun thought so and asked as well.<br/><br/>Xiao Junxuan shook his head and said, “I don’t know exactly how my sister raised them. Let’s ask her later.”<br/><br/>He had heard of this earthworm-raising technique when he was in university, but he had never seen it.<br/><br/>But he knew that the earthworms raised by those farms would definitely not be as big as the ones his sister raised.<br/><br/>“Bamboo, what happened? I just heard you scream.” The maternal grandmother asked as soon as she came over.<br/><br/>Scream…<br/><br/>Ji Yuzhu’s face was a bit confused, she looked at her husband and asked with her eyes, “Husband, did I really scream that badly?”<br/><br/>“Ahem…” Gao Jianjun was also a little embarrassed to say, “Wife, your scream just now was indeed quite frightening.”<br/><br/>“Haha…” Unable to hold back his laughter, Gao Yanxin burst out laughing, looking at his mother’s awkwardness.<br/><br/>Ji Yuzhu immediately had black lines on her face and scolded her son angrily, “Stinky boy, what’s so funny?”<br/><br/>“Hehe, Bamboo, what happened to you just now?” The maternal grandmother asked with a slightly amused expression.<br/><br/>Ji Yuzhu explained, “It’s nothing. It’s just that I mistook the earthworms inside the greenhouse for snakes.”<br/><br/>If she was going to be embarrassed, she might as well go all the way.<br/><br/>“Oh, oh, I see!” The maternal grandmother said with understanding, “That makes sense. You’ve been afraid of snakes since you were little!”<br/><br/>“What earthworms in the greenhouse would make you think they were snakes?” The maternal grandfather was very curious as he walked into the greenhouse.<br/><br/>After all, there’s a big difference between snakes and earthworms.<br/><br/>As soon as the maternal grandfather walked into the greenhouse, he shouted, “Wife, wife, come and have a look.”<br/><br/>“What’s the matter?” The maternal grandmother also got up and walked over, seeing the insides of the greenhouse, she exclaimed, “These are all earthworms? They’re so big. No wonder Bamboo mistook them for snakes.”<br/><br/>The grandfather asked doubtfully, “Where did all these large earthworms come from?”<br/><br/>The grandmother said, “Let’s ask the children, and then we’ll know.”<br/><br/>Grandma came out and asked, “How come there are so many earthworms in the greenhouse?”<br/><br/>Xiao Siqian said, “Grandma, these are raised by Little Sister Jinli.”<br/><br/>“Yes, Mom, these were all raised by Jinli.” Ji Yuzhu had completely calmed down, even looking happy, “Xuan’er just said that these earthworms were sold for one point five cents each. They’ve already sold twenty thousand, and there are still people booking twenty to thirty thousand more. Hehe, Jinli is really capable, knowing how to make money at such a young age.”<br/><br/>When the grandmother heard that they were raised by Xiao Jinli, she was also happy and said, “Yes, yes, Jinli is really capable. Knowing how to make money at such a young age. Twenty thousand worms, that’s three to four thousand Yuan. It’s equivalent to our income from farming for a year. Sometimes, we don’t even make that much in a year from farming.”<br/><br/>As soon as Xiao Jinli saw that her maternal grandparents had come to the backyard, she went to help in the kitchen.<br/><br/>“Xiao Bao, go and check on your brother, has he finished cutting the chives? Hurry up and bring them back to wash and cook. Just now, when we cooked a plate of chives, your aunt finished half of it with two chopsticks. There’s not enough for everyone. Go and check now, cut some more, everyone likes it, so cook more.” Xiao Mother said.<br/><br/>When Xiao Jinli arrived in the backyard, seeing everyone discussing her earthworm raising, she first said to her brother, “Brother, have the chives been cut? Mom said to cut more and cook more!”<br/><br/>Xiao Junxuan looked at the handful of chives in his hand and handed them to Xiao Siqian, saying, “Xiao Quan, you first take these back to clean, I will go cut some more, this is probably not enough.’<br/><br/>If his little aunt could eat half a plate of this dish, the taste must be good. It’s better to stir-fry more so everyone can eat more.<br/><br/>“OK!” Xiao Siqian took the chives and left.<br/><br/>His grandmother looked at Xiao Jinli with bright eyes and asked, “Jinli, how do you raise these earthworms? They are so big, they scared your little aunt into screaming. ”<br/><br/>Little aunt, “…I admit, they are big…”<br/><br/>Xiao Jinli said, “I raised these by utilizing the scientific method of soil and earthworm ecological structure.”<br/><br/>“What does that mean?” The grandmother didn’t understand.<br/><br/>Xiao Jinli explained, “Earthworms are decomposers. They feed on decaying plants or other organic matter, swallowing soil and sand particles to obtain their organic substances. Earthworms contribute to the material cycle and energy transfer of the soil by feeding, digesting, excreting, secreting, and burrowing. That’s why they are also called Earth Dragons. To breed earthworms, I just need to mix their food, which is feces, according to their preferences. Of course, I strictly followed the proportionate method while mixing the food, which I have figured out through numerous experiments.”<br/><br/>This was actually her secret formula for raising earthworms.<br/><br/>The grandparents didn’t quite understand, but the others did.<br/><br/>Xiao Junxuan smiled and said, “I wondered how you raised these earthworms. So that’s how you did it. My sister is really clever.”<br/><br/>Xiao Jinli looked at the chives in his hand and said, “Brother, take these chives, mom’s going to hurry us.”<br/><br/>“Hehe, I’ll take them over right now!” With that, Xiao Junxuan ran off. Xiao Jinli said, “Grandma, let’s go home, there’s only one dish left for mom to cook.”<br/><br/>“OK, OK, let’s go home quickly. I haven’t had food cooked by Fangfang in a long time, and I miss it.” The grandmother smiled.<br/><br/>Then, the group of people went home.<br/><br/>Gao Jianjun glimpsed the greenhouse, and a glint flashed in his eyes.<br/><br/>When they returned home, the dining table was already filled with dishes.<br/><br/>Xiao Siqian brought out the bowls and chopsticks from the kitchen, smiling,<br/><br/>“Aunt is cooking the last dish.”<br/><br/>Xiao Wanshan took out the Osmanthus Wine from the house and said to Gao Jianjun, “This is the newly brewed wine your sister made, it’s very fragrant, and you must drink a few more cups.”<br/><br/>Gao Jianjun nodded, “Alright!”<br/><br/>Ji Yuzhu smiled and said, “Brother-in-law, Jianjun doesn’t drink much, don’t get him drunk.”<br/><br/>“What does it matter if he gets drunk? He doesn’t have to drive, there’s no problem!” Xiao Wanshan said while opening the wine bottle, and the fragrance of the wine instantly spread.<br/><br/>“This wine smells delicious. Uncle, I want to drink too!” Gao Yanxin shouted loudly.<br/><br/>“You’re not allowed to drink! Are you 18 years old yet?” Ji Yuzhu scolded, “No drinking!”<br/><br/>Gao Yanxin shouted, “Mom, I am already 18 years old. I even got my driver’s license. ”<br/><br/>“Hmm, are you 18 yet?” Ji Yuzhu looked at her husband.<br/><br/>Gao Jianjun nodded slightly, “Yes, he turned 18 last month. At that time, you were busy with your students’ college entrance examination sprint!”<br/><br/>Ji Yuzhu, ‘\t\t\t\t\t\t</div>", "images": {}, "success": true}