{"id": 98, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14235643.html", "title": "Chapter 98 - Chapter 98: Chapter 98: Becoming Brothers With Cow King (Second Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 98 - Chapter 98: Chapter 98: Becoming Brothers With Cow King (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 98: Chapter 98: Becoming Brothers with Cow King (Second Update)<br/><br/>Translator: 549690339<br/><br/>At noon, everyone had a bit of alcohol and, with the stuffy weather, they were all feeling sleepy. So, after Xiao Junxuan and Gao Yanxin finished clearing up the bowls and chopsticks, everyone cooled off under the trees and then went back to rest.<br/><br/>There were plenty of rooms available in the Xiao Family house, even though Xiao Siqian occupied one of them, there were still three or four rooms left.<br/><br/>When Ji Yuzhu called earlier, saying she would stay at the Xiao Family home for a while, Xiao Mother had already prepared the rooms.<br/><br/>At around 3-4 0’clock in the afternoon, Gao Yanxin came knocking on Xiao Jinli’s door.<br/><br/>Xiao Jinli opened the door and asked, “Cousin Xin, what’s up? Are you going to pick vegetables?”<br/><br/>Gao Yanxin said, “No, little sister, I just remembered I haven’t done<br/><br/>something.”<br/><br/>“What is it?” Xiao Jinli asked.<br/><br/>“I haven’t seen Cow King for half a year. I don’t know if it forgot about me!” Gao Yanxin said.<br/><br/>Xiao Jinli, ‘    Same story every year.<br/><br/>However, he probably didn’t know that Cow King didn’t want to remember him at all.<br/><br/>If Gao Yanxin wanted to see Cow King, he had to go with Xiao Jinli; otherwise, Cow King wouldn’t even bother with him.<br/><br/>But Gao Yanxin liked Cow King very much and wanted to interact with him. Xiao Jinli said, “Alright then, wait for me. I’ll get ready and then take you there.”<br/><br/>She had just woken up from a rest. Her hair was uncombed, and she hadn’t brushed her teeth yet.<br/><br/>When Xiao Jinli came out, she saw Xiao Siqian standing at the door as well.<br/><br/>Before Xiao Jinli could say anything, Xiao Siqian said, “Little Sister Jinli, let me go with you!”<br/><br/>“Fine, let’s go together.” Xiao Jinli nodded her head.<br/><br/>Of course, Gao Yanxin wouldn’t object.<br/><br/>The three of them soon arrived at the cowshed.<br/><br/>From a distance, Gao Yanxin’s loud voice started calling out.<br/><br/>“Brother Cow King, it’s Gao Yanxin! I’ve come to see you!”<br/><br/>Xiao Siqian, “…” This was his first time seeing someone being so chummy with a cow.<br/><br/>Then, from afar, he saw Cow King roll its eyes helplessly.<br/><br/>Xiao Siqian, “…” What kind of look was that? Disdain, helplessness?<br/><br/>Gao Yanxin seemed not to notice Cow King’s disdainful eye roll. He ran over and stood in front of Cow King, raising his hand like he wanted to greet or touch its fur.<br/><br/>He said, “Brother Cow King, it’s been half a year since we last met. Did you miss<br/><br/>Cow King rolled its eyes at Gao Yanxin again, then mooed twice at Xiao Jinli, seemingly asking, “Why is this idiot here?”<br/><br/>But in Gao Yanxin’s eyes, Cow King was responding to him.<br/><br/>He danced with joy, exclaiming loudly, “Hahaha, Brother Cow King, I knew you would miss me too! Let me tell you, this time I’ve brought gifts for everyone.”<br/><br/>With that, he slammed the bag he was carrying onto the ground and took out the contents one by one, saying, “These are all sorts of canned meats I bought, except for beef, there’s pork, fish, etc. Which one do you want to eat, and I’ll open it for you.”<br/><br/>After hearing this, Cow King mooed twice at Xiao Jinli, seemingly saying,<br/><br/>“Master, get this idiot out of here quickly. I don’t know what I’ll do if this continues. This idiot, who told him I like to eat these cans? I obviously like the water and green fodder you give me the most.”<br/><br/>However, Xiao Jinli seemed not to understand Cow King’s meaning. She touched Cow King’s head and said with a smile, “Cousin Xin, Cow King says it really likes these canned foods. Open a can of pork for it first.’<br/><br/>“Alright!” Gao Yanxin excitedly opened the canned pork and said, “I knew Cow King would like the gifts I brought. Haha, Brother Cow King, I brought a lot! If you want more after you finish, I’ll go buy it.”<br/><br/>Cow King,<br/><br/>The day it was betrayed by its master, it wanted to cry, but no tears came!<br/><br/>It really wanted to headbutt this idiot to death!<br/><br/>But it didn’t dare to…<br/><br/>So, they could only reluctantly eat these disgusting canned foods with tears in their eyes.<br/><br/>However, Gao Yanxin was deeply moved.<br/><br/>He reached out his hand, tentatively stroked Cow King’s head, and said with great enthusiasm, “Brother Cow King, don’t be too moved, you know, I really like you. From now on, I’ll buy it for you every day!” Cow King paused in the midst of eating the canned food.<br/><br/>Ah, buy it every day?<br/><br/>Every day, that means eating it every day.<br/><br/>Who would just find a block of tofu to bump into and die for him, so he doesn’t have to be tormented by this idiot every day.<br/><br/>After Cow King ate the third can, it couldn’t eat any more of these disgusting things and had to ask Xiao Jinli for help.<br/><br/>“Um, um, Cousin Xin, don’t feed it anymore.” Xiao Tieling said with a suppressed laugh, “Cow King can’t eat too much canned food. If it eats too much, it’ll have diarrhea. Two or three cans are enough.”<br/><br/>It has to stop Cousin from feeding it any longer, or Cow King might go against its master’s wishes and attack him.<br/><br/>Cow King’s temper is not to be trifled with.<br/><br/>After hearing what Xiao Jinli said, Gao Yanxin had no choice but to stop feeding it, and said regretfully, “Alright then, I’ll feed it again tomorrow.”<br/><br/>Then, he put away the cans and put them back into a bag.<br/><br/>Cow King, who had just put down its heart, could see the despair in its eyes when it heard Gao Yanxin’s words. Does it have to eat this tomorrow?<br/><br/>Please spare it.<br/><br/>It’s just a cow, after all.<br/><br/>It only loves to eat tender green grass and drink water from its master’s hand. It doesn’t like and even hates eating meat.<br/><br/>Every time this idiot came here, he would bring all sorts of messy things for it to eat, and it couldn’t refuse.<br/><br/>Whimper… Master, you really favor others too much.<br/><br/>In order to please your cousin, you wouldn’t even stop your idiot cousin’s foolish behavior.<br/><br/>However, arms can’t win against thighs. As the small Cow King, it could only submit.<br/><br/>Xiao Jinli seemed to be able to hear Cow King’s grief, she gently stroked its head and said with a smile, “Alright, you can’t refuse Cousin’s good intentions, you know?”<br/><br/>Facing such a biased master, what could Cow King do but compromise?<br/><br/>Anyway, it’s not like it’s too hard to get over it after compromising. Afterward, the master will give it a major compensation.<br/><br/>Gao Yanxin really wanted to ride Cow King, but Cow King was willing to let him feed it, but not let him ride it, not even if his cousin asked for it.<br/><br/>Therefore, he had to give up time and time again.<br/><br/>“Cow King, may I ride you once?” Gao Yanxin asked again with hopeful eyes.<br/><br/>Unexpectedly, Cow King rolled its eyes once again, turned around, and presented its buttocks to him.<br/><br/>It was clearly a blatant refusal.<br/><br/>Gao Yanxin, ‘ . Refused again.<br/><br/>Xiao Siqian, “…” He wondered how many times Cow King had rolled its eyes now. Seeing Cow King despise Gao Yanxin but not refusing his feedings, what kind of play was this?<br/><br/>“Whimper… Brother Cow King, did you reject me again?” Gao Yanxin pretended to cry, “How many times have you rejected me since we were little? I just want to ride you once, why is it so difficult?”<br/><br/>As he spoke, he pretended to wipe away tears, then said spiritedly, “It’s okay to reject me again. I believe that one day, you will let me ride.”<br/><br/>Xiao Siqian, “…” How persistent he is.<br/><br/>Fortunately, he had ridden it once.<br/><br/>Well, why does this feel like a case of a well-fed man not knowing a hungry man’s hunger?\t\t\t\t\t\t</div>", "images": {}, "success": true}