{"id": 93, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14235633.html", "title": "Chapter 93 - Chapter 93: Chapter 93: The Lifespan Of Earthworms (Part 1)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 93 - Chapter 93: Chapter 93: The Lifespan Of Earthworms (Part 1)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 93: Chapter 93: The Lifespan of Earthworms (Part 1)<br/><br/>Translator: 549690339<br/><br/>Xiao Jinli’s earthworm business was selling like hotcakes in the village.<br/><br/>After several experiments, Xiao Jinli found out that one thousand earthworms were enough for five points of land.<br/><br/>The whole village’s consumption, hmm, would require at least twenty thousand.<br/><br/>Luckily, since they have the “cheat device”, the Golden Finger, it wasn’t much of a problem to cultivate these earthworms in a short time.<br/><br/>Because the villagers had all bought earthworms, the crops in their fields, visible to the naked eye, were growing better and everyone was happy.<br/><br/>“Haha, these earthworms that Jinli came up with are real treasures. We used to know that earthworms could improve the soil, but we had no idea their effect could be this huge.”<br/><br/>Now, the villagers are treating these earthworms as precious commodities.<br/><br/>“In the past, the effect of earthworms on improving the soil wasn’t this noticeable. It must be because the earthworms cultivated by Jinli are bigger, and Jinli said that these bigger earthworms store more nutrients, so they are able to improve the soil effectively.”<br/><br/>“That makes sense. If the earthworms had such a huge impact before, people would have discovered it and put them in the fields. It wouldn’t have waited until Jinli cultivated them.”<br/><br/>“Alas, Jinli also mentioned that these earthworms do not have a long lifespan, only between three and five months. However, the dead earthworms can be used to feed chickens and ducks, which can increase their nutrition. It’s not wasted after all.’<br/><br/>When it came to the lifespan of these earthworms, Xiao Jinli initially considered making it longer, but it wasn’t really feasible.<br/><br/>Because, these earthworms depleted the Lingquan water in their bodies within three to five months. After three to five months, all the Lingquan water inside them would be lost. They could not metamorphose back into ordinary earthworms since their bodily structure had changed. In order to survive, they needed to be irrigated with Lingquan water again. This was not a problem at all for Xiao Jinli.<br/><br/>All she had to do was walk around the fields once, and these earthworms would regain vitality.<br/><br/>However, this created another problem. The originally sluggish earthworms suddenly became active again.<br/><br/>This was troublesome to explain.<br/><br/>So, Xiao Jinli simply told everyone that earthworms lived for only three to five months and anyone willing to buy needed to consider it carefully.<br/><br/>After all, there would be no returns or exchanges once sold.<br/><br/>Nevertheless, everyone had seen with their own eyes the effect of these earthworms, and the villagers also trusted Xiao Jinli. Naturally, those with land would buy some, more or less.<br/><br/>The results proved that they did not disappoint.<br/><br/>“Hey, have you noticed? I found that the vegetables in my field are growing better than before, so fresh.<br/><br/>“Exactly, and there are fewer pests, have you noticed?”<br/><br/>“Now that there are no pests, we don’t need to use pesticides anymore.”<br/><br/>Xiao’s mother walked into the greenhouse and saw the lush and tender vegetables in the field, her eyes lighting up.<br/><br/>“These vegetables are growing really well, even better than those I used to grow!” Xiao’s mother complimented, “Little Bao, you are really capable!”<br/><br/>Xiao Jinli replied with a smile, “Both mom and dad are so capable, I guess it’s heredity.”<br/><br/>Xiao’s mother laughed and said, “You are such a smooth talker!”<br/><br/>Looking at the wriggling earthworms in the field, Xiao’s mother still found it visually shocking and couldn’t quite get over it, feeling a bit of scalp tingling. She said, “Little Bao, your maternal grandparents and aunt are coming over.”<br/><br/>Upon hearing that her maternal grandparents were coming, Xiao Jinli’s eyes lit up with excitement. She said joyfully, “Are they coming? Mom, let’s cut some chives to take back. We can stir-fry it with eggs, and also pick some small cabbage to go with it.”<br/><br/>She had been eyeing these vegetables for a long time now, and she wasn’t going to let an excuse slip past her.<br/><br/>However, Xiao’s mother hesitated a bit, “But these vegetables are still too tender, should we wait for them to grow a bit more?”<br/><br/>“No, no, I want to eat them.” Xiao Jinli said, acting like a spoiled child.<br/><br/>Xiao’s mother gave in, “Alright! I know you’ve been wanting to eat the vegetables you planted yourself for a long time. Today I will fulfill your wish. You go pick some big small cabbages, and I’ll go find some tools to cut the chives!”<br/><br/>Xiao Jinli happily picked some cabbages.<br/><br/>Xiao’s mother went outside and quickly came back with a small knife.<br/><br/>The mother and daughter quickly got everything ready.<br/><br/>Xiao’s mother, looking at the tender chives in her hand, hesitated a bit, “These chives are too tender, it’s a bit of a pity to eat them now.”<br/><br/>“Chives can grow back after being cut. I want to taste the vegetables I grew myself now. Hehe….” Xiao Jinli happily said.<br/><br/>The mother and daughter took the vegetables back to the yard and cleaned them.<br/><br/>These chives had no yellow or rotten leaves, so there was no need to pick them one by one, they just needed to be washed to clean off the dirt.<br/><br/>While Xiao’s mother was cleaning, she could smell the refreshing scent of the chives, “These chives smell so good. They will definitely smell even better when cooked!”<br/><br/>“Of course.” Xiao Jinli said proudly, “Mom, see who grew them.”<br/><br/>Xiao’s mother, “…” This daughter of mine has a not so humble personality, unlike herself and her husband.<br/><br/>Knowing that her maternal grandparents were coming, Xiao Jinli immediately went upstairs to get Xiao Siqian and said, “Come, take me to the town. My maternal grandparents are coming, let’s go to town to pick them up.”<br/><br/>Xiao Siqian was reading a book in the house. Just as he came out after hearing Xiao Jinli calling him, she dragged him away.<br/><br/>“Maternal Grandpa and Grandma?” Xiao Siqian was a bit confused.<br/><br/>They had been there for so long and they hadn’t seen any relatives from Xiao’s mother’s side, which made him think that Xiao’s mother didn’t have much relatives on her side.<br/><br/>Nevertheless, he knew from the conversation with Xiao family members that the relationship between the Xiao family and Xiao’s mother’s maiden family was very good.<br/><br/>Xiao Jinli nodded and said, “Yes, yes, it’s been a long time since I last saw my grandparents. I miss them.”<br/><br/>Xiao Siqian asked, confounded, “It is vacation time, if you miss them you can just go to see them, right?”<br/><br/>Xiao Jinli replied with a smile, “Well, I’d love to. The problem is, my grandparents are not at home.”<br/><br/>“Huh, not at home, what does that mean?” Xiao Siqian asked confused.<br/><br/>“After the New Year, they went to my maternal aunt’s house. My two uncles have bought houses in other places.” Xiao Jinli explained with a smile, “Today, my maternal aunt is bringing my grandparents over.”<br/><br/>When Xiao’s mother saw Xiao Jinli pulling Xiao Siqian out, she asked puzzled,<br/><br/>“XiaoBao, where are you guys going?”<br/><br/>“Mom, I’m going to the town to pick up Grandma!” Xiao Jinli said, “I want to see my grandparents and maternal aunt as soon as possible!”<br/><br/>“You child!” Xiao’s mother laughed, “Your maternal aunt and family are driving back, and your dad and your brother have gone to pick them up. They should be here soon. It’s better to wait at home. Or, you can directly call and ask where they are now.”<br/><br/>“Alright, I’ll go make the call right now!” With that, Xiao Jinli ran off.<br/><br/>Xiao Siqian,<br/><br/>After a while, Xiao Jinli came running out and shouted, “Mom, dad said they have already reached the village entrance!”\t\t\t\t\t\t</div>", "images": {}, "success": true}