{"id": 95, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14235637.html", "title": "Chapter 95 - Chapter 95: Chapter 95: Lively 1 (First Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 95 - Chapter 95: Chapter 95: Lively 1 (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 95: Chapter 95: Lively 1 (First Update)<br/><br/>Translator: 549690339<br/><br/>“Wow, sis, what kind of cosmetics have you been using, or did you eat some beauty-enhancing pills? You’re getting more and more beautiful.” Ji Yuzhu exclaimed as soon as she saw Xiao’s mother, “You’re like aging in reverse. Come on, sis, introduce me to your secret so your younger sister can look younger too.”<br/><br/>Xiao’s mother smiled and said, “I’m just a countryside woman, what kind of cosmetics or beauty-enhancing pills would I use?”<br/><br/>“Ah, my sister is indeed a natural beauty!” Ji Yuzhu laughed, “You’re getting younger and more lovely. No wonder you’ve enchanted your husband! Haha…” Xiao’s mother glared at her, “Nonsense!”<br/><br/>“No, really,” Ji Yuzhu looked at Xiao’s mother’s fair face and asked seriously, “Sis, you’re getting more and more beautiful, a true beauty, nationally stunning. How do you maintain your skin? Tell me.”<br/><br/>“I work every day, there’s no time for skincare,” Xiao’s mother laughed, “I don’t even know why my skin is getting better and better, everyone says so.” Xiao’s mother didn’t deny it.<br/><br/>“Yes, yes, one wouldn’t think you’re a countryside woman at all!” Ji Yuzhu nodded, “With your looks in wealthy upper-class circles, you’d outshine all the noble ladies and daughters. Honestly, is it because the water and soil here are good for people? Look at our Little Jinli, so young yet her skin is white and tender, a true beauty in the making. When she grows up, she’ll be unstoppable. And I’ve noticed that your husband and Little Xuan’s skin has also improved a lot. It really seems like the water and soil here are good for people. I must stay here for a while.<br/><br/>Xiao’s mother laughed, “Stay for a while, don’t you have to go to work?”<br/><br/>Ji Yuzhu spread her hands, “Sis, did you forget that I’m a teacher? I don’t have to work during summer vacation.”<br/><br/>She is a junior high school teacher, teaching at Licheng Key Experimental Middle School.<br/><br/>“Oh, right. Then stay here for a while longer!” Xiao’s mother said with a smile, “Maybe we can make you whiter and rosier.”<br/><br/>“Wow, it smells so good!” Ji Yuzhu exclaimed as she smelled the freshly cooked stir-fried leek with eggs, “Not only are you getting more beautiful, but your cooking skills are also getting better and better, sis. The smell of this dish alone outshines a five-star hotel chef. I must try it!”<br/><br/>As she said, Ji Yuzhu picked up her chopsticks and took a mouthful of the stir-fried leek with eggs.<br/><br/>“Wow, wow, it’s so delicious!” Ji Yuzhu shouted, “It’s tender and fragrant! I’m in love with this dish.”<br/><br/>Having said that, she went for another chopstick-full.<br/><br/>As Gao Yanxin ran in, attracted by the aroma, he exclaimed, “Auntie, what dish did you make? It smells so good. I just smelled the scent of chive and egg.” As he said this, he saw his mother eating it and immediately exclaimed, “Mom, you’re eating before the meal is even served. Uh, you’ve eaten half the plate already. How are we going to eat during dinner?”<br/><br/>After her son’s exclamation, she realized that she had unknowingly eaten half a plate of vegetables. Her face turned red, but she felt humiliated by her son’s words and said, “How’s that? I only had a few bites, and I ate half of it.”<br/><br/>Gao Yanxin was speechless, “Mom, when did you become such a big eater?<br/><br/>When you’re at home, you always eat so little to maintain your figure.” Ji Yuzhu, “…This stinky kid, he just had to say it. It’s infuriating.”<br/><br/>Xiao’s mother covered her mouth and laughed, “It’s okay, if you like it, eat more. The chives are grown in the backyard. If we run out, we can just cut some more and cook them. Little Xuan, Little Xuan…<br/><br/>Xiao Junxuan asked, “Mom, what’s up?<br/><br/>“Go to the backyard, cut some more chives and bring them back, we’ll cook another plate!” Xiao’s mother ordered.<br/><br/>Xiao Junxuan nodded and left.<br/><br/>Later on, Gao Yanxin followed and said, “Cousin, let me go with you!”<br/><br/>If he stayed any longer, he would probably finish off half of the plate, which would be too embarrassing.<br/><br/>“Are these chives from the backyard?” Ji Yuzhu reluctantly put down her chopsticks.<br/><br/>“Yes, both the chives and the small cabbage were planted by Xiao Bao.” Xiao’s mother said.<br/><br/>“Huh, they were planted by Jinli?” Ji Yuzhu was somewhat surprised, “Can she plant them at such a young age?”<br/><br/>“She can, and she does a pretty good job at it!” Xiao’s mother didn’t hesitate to praise her daughter.<br/><br/>“Then I’ll go and take a look now!”<br/><br/>After that, Ji Yuzhu followed them to the backyard.<br/><br/>Meanwhile, the maternal grandpa, grandma, and uncle, who were chatting with Xiao Wanshan and Xiao Siqian, heard a scream from the backyard.<br/><br/>The three of them were stunned and asked in confusion, “What happened? Why does that sound like Yuzhu’s scream?”<br/><br/>“It’s Yuzhu’s.” Gao Jianjun quickly stood up and ran to the backyard. Then, he saw his somewhat pale wife standing outside the greenhouse. He asked with concern and urgency, “Wife, what happened?”<br/><br/>Ji Yuzhu pointed in the direction of the greenhouse, but before she could speak, Gao Yanxin ran out laughing, then said, “Mom, they’re just earthworms, what are you afraid of?”<br/><br/>“What, you’re saying those are earthworms, not snakes?” Ji Yuzhu’s frightened expression hadn’t eased yet, “If they really are earthworms, how can they be so<br/><br/>At this time, Xiao Junxuan also ran out and explained, “Little aunt, they are indeed earthworms, just that they’ve been raised by my sister and grown a bit bigger. If you don’t look closely, you could really mistake them for snakes.” He knew that she used to be a tomboy who feared nothing except snakes.<br/><br/>“Haha, Xuan’er, you’re saying these earthworms are raised by Jinli?” Ji Yuzhu asked in surprise, “Why would Jinli raise such things? And they’ve grown so big, like snakes. Isn’t she afraid as a girl?”<br/><br/>Gao Jianjun entered the greenhouse, and after a while, he came out laughing and said, “Haha, wife, they really are earthworms, just a bit bigger.”<br/><br/>“They really are earthworms!” Ji Yuzhu recovered and grabbed Gao Jianjun’s hand as they carefully walked into the greenhouse. As soon as she entered, she saw a large number of earthworms in the trenches in the soil.<br/><br/>With her husband’s company, she wasn’t that scared anymore, and said, “There are so many earthworms. It’s creepy to look at them all clustered together.<br/><br/>Xuan’er, why does Jinli keep so many earthworms?”<br/><br/>Xiao Junxuan said, “At first, my sister raised them for fertilizing the soil, but as their numbers increased, she sold some of them to the villagers. Many villagers have placed orders.”<br/><br/>“Haha, they’re for sale? How do you sell them?” Ji Yuzhu asked, somewhat surprised.<br/><br/>“Yes, one point five cents per worm!” Xiao Junxuan said, “According to my sister, she has already sold twenty thousand of them, and some others want to buy them to release in the peach and tangerine orchards in the mountains..”\t\t\t\t\t\t</div>", "images": {}, "success": true}