{"id": 104, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14254843.html", "title": "Chapter 104 - Chapter 104: Chapter 104: The Furious Cow King (Second Update) No. 11", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 104 - Chapter 104: Chapter 104: The Furious Cow King (Second Update) No. 11</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 104: Chapter 104: The Furious Cow King (Second Update) No. 11<br/><br/>Translator: 549690339<br/><br/>“Brother Cow King, I’m back again,” said Gao Yanxin, bringing more canned food for Cow King.<br/><br/>However, Xiao Jinli didn’t accompany him this time.<br/><br/>Gao Yanxin came to visit Cow King every day, and it was impossible for Xiao Jinli to accompany him every time.<br/><br/>“Look, I’ve bought some more canned food for you,” Gao Yanxin said happily, “I know you’re tired of eating meat canned food, so I’ve changed the taste for you. Ta-da, they’re all fruit-flavored now. There’s apple, orange, mango, oh, and coconut, I don’t know which one you prefer.”<br/><br/>Gao Yanxin laid out the cans one by one, saying, “Brother Cow King, you pick the flavor you like, and I’ll open it for you.”<br/><br/>Now Cow King would barely even bother rolling its eyes at Gao Yanxin, let alone mock or disdain him.<br/><br/>This idiotic fool would never notice any of its expressions anyway.<br/><br/>So it simply couldn’t be bothered to waste its energy dealing with him.<br/><br/>After all, its master wasn’t here.<br/><br/>With that, Cow King lifted its leg and walked into the cowshed, lying on its comfortable dry hay with its back(side) facing Gao Yanxin, paying no attention to him.<br/><br/>Gao Yanxin shouted loudly, “Hey, Brother Cow King, you can’t be serious. You don’t like these fruit canned foods? Alright, if you don’t like them, I’ll eat them myself. Tomorrow, I’ll buy some meat canned food with Cousin Junxuan in the county town.”<br/><br/>Hearing this, Cow King immediately got up and walked back, its big dark eyes filled with anger as it “mooed” twice at Gao Yanxin.<br/><br/>“You fool, are you not satisfied unless you try to kill me? Do you know that eating these things will give me a stomachache?”<br/><br/>Of course, it would never actually get a stomachache after its master gave it Lingquan water.<br/><br/>But it simply didn’t like those things.<br/><br/>Unfortunately, Gao Yanxin couldn’t understand cow language at all, and he excitedly said, “Haha, Brother Cow King, I knew you liked meat canned food. Otherwise, you wouldn’t come over so excitedly when you heard I was going to buy meat canned food. Don’t worry, Brother Cow King, I’ll buy more meat canned food for you so you can eat it every day.”<br/><br/>This idiot couldn’t understand cow language, so just keep quiet!<br/><br/>After hearing this, Cow King snorted angrily through its nostrils, wishing it could kick Gao Yanxin with one hoof.<br/><br/>But it had to hold back, hold back, hold back!<br/><br/>Otherwise, if it really kicked this idiot, its master wouldn’t let it off the hook.<br/><br/>Well, it could at least dodge, right?<br/><br/>Immediately, Cow King opened the door with its mouth, unbolted the lock, and slowly pushed the door open with its hooves.<br/><br/>Before Gao Yanxin could stop it, Cow King let out a “whoosh” and ran off at top speed, its figure soon disappearing.<br/><br/>Gao Yanxin stared at Cow King’s fading figure, completely dumbfounded.<br/><br/>What happened to Brother Cow King this time? He ran so fast, as if there were dogs chasing him from behind.<br/><br/>When he finally realized, Gao Yanxin immediately followed, shouting while running, “Brother Cow King, wait for me. Don’t run so fast. Wait for me…”<br/><br/>The villagers laughed at the sight, saying, “Haha, Cow King has thrown Gao Yanxin off again. What on earth did this kid do to offend Cow King, making it hide from him every time it sees him?”<br/><br/>“Haha, who knows? This kid’s energy is really good too. Whenever Cow King hides, he’s chasing right behind it. If you didn’t know any better, you’d think he’s chasing after a lover.”<br/><br/>“Gao Yanxin is like that. Cow King clearly doesn’t want to play with him, yet he insists on sticking around. Isn’t he just asking for trouble?”<br/><br/>At night, after dinner, the Village Head and Xiao Chunfu and a few other villagers came to see Xiao Jinli.<br/><br/>“Uncle Village Chief, what brings you here?” Xiao Junxuan asked as he made tea.<br/><br/>The Village Head laughed and said, “We don’t visit the Three Treasure Hall without a reason. We came to see Jinli.”<br/><br/>“My sister is in the room. I’ll call her down,” said Xiao Junxuan.<br/><br/>He then stood in the yard and shouted upstairs, “Sister, Uncle Village Chief and others are here to see you.”<br/><br/>Xiao Jinli replied, “Alright, I’m coming down right now!”<br/><br/>After a moment, she came downstairs.<br/><br/>She asked directly, “Uncle Village Chief, what do you need me for?”<br/><br/>The Village Head explained to Xiao Jinli about selling vegetables from their homes and their plans for the future.<br/><br/>Xiao’s mother and others listened, finding it interesting.<br/><br/>Xiao’s mother chuckled, “Hehe, so our village’s vegetables are all being snatched up.”<br/><br/>Ji Yuzhu added, “Haha, if I bought good quality and cheap goods for the first time, I would also be eager to buy them the next day. Besides, the vegetables and fruits we’re growing now are very unusual. Not to mention us adults, even those kids who don’t eat green vegetables, I’m sure they will come to love them. My son is the best proof of that. Before, eating vegetables at home was like eating poison, but now he brings vegetables back from the field every day. He seems determined to eat all the vegetables in the field.”<br/><br/>The Village Head agreed, “Indeed, my own kids used to not like green vegetables much either, but now that they’ve eaten our homegrown ones, they can’t get enough of them. They can do without meat, but absolutely can’t do<br/><br/>without our homegrown vegetables. Haha, children these days can be so<br/><br/>difficult! Back in our days, we were happy if we had something to eat.”<br/><br/>“Now that living conditions have improved, there’s no shortage of food and drink at home. So the children have become picky. Just like my grandson; his grandmother always tells him how hard life used to be, and that they had nothing to eat. Now the children have it good, and there’s food everywhere. In the end, he said that she had it so hard because she was born too early. That silenced her.”<br/><br/>Xiao Chunfu laughed and said, “Don’t mention it; the children are really picky and clever these days. However, because life is too good, they’ve all become lazy. Back then, we used to fetch water for the family when we were seven or eight, but now they’re in their teens, and they don’t even want to do dishes.”<br/><br/>“Sigh, these children nowadays are just so hard to discipline. You say one thing and they come back with ten.”<br/><br/>As they talked, the conversation drifted.<br/><br/>As for Xiao Jinli, who was also a child among them,  ‘ How can I join such a conversation?<br/><br/>Most importantly, the children in the village are all well-behaved in front of her.<br/><br/>After talking for a while, the Village Head redirected the conversation.<br/><br/>He asked, “Jinli, your aunt wants to plant more land and sell more vegetables to increase her income. So she wants to buy more earthworms.”<br/><br/>Xiao Jinli asked, “How much do you want to plant?”<br/><br/>The Village Head said, “The dry land at home is only about four or five mu now. That’s what we’re planning to plant this year. That is, next year, we want to plant some vegetables from three to five acres.”<br/><br/>Once the Village Head finished talking, Xiao Chunfu also said, “Jinli, my family has the same plan, actually.”<br/><br/>Xiao Jinli thought for a moment and said, “Uncle Village Chief, I have an idea, why don’t you listen to it and see if it works?”\t\t\t\t\t\t</div>", "images": {}, "success": true}