{"id": 100, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14235647.html", "title": "Chapter 100 - Chapter 100: Chapter 100: Blissfully Happy (Second Update)", "volume": 1, "volume_title": "Volume 1", "body": "<h1>Chapter 100 - Chapter 100: Chapter 100: Blissfully Happy (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 100: Chapter 100: Blissfully Happy (Second Update)<br/><br/>Translator: 549690339<br/><br/>Dinner turned out to be an actual vegetarian feast.<br/><br/>Apart from a plate of chives and eggs that added a touch of meatiness, all dishes were either fresh stir-fry, water stir-fry, or spicy stir-fry. But no matter how they were cooked, they couldn’t mask the natural flavor of the vegetables.<br/><br/>“Wow, these vegetables are so delicious!” Gao Yanxin stood by the table, looking at the vibrant dishes while being hit by the array of different aromas from the greens. He was utterly enthralled. “I have never imagined that there<br/><br/>would be a day when dishes full of greens could turn into such amazing<br/><br/>delicacies.”<br/><br/>Ji Yuzhu laughed, “Your elder aunt says that it’s not even the prime timing for harvesting these vegetables, but seeing how you are drooling over them, we’d satisfy your craving first.”<br/><br/>“Mom, you and dad’s cravings were satisfied too!” Gao Yanxin retorted, “Didn’t you all enjoy the meal as well?”<br/><br/>Ji Yuzhu, ‘ This unmanageable son, always making things difficult. He only knows how to dismantle things.<br/><br/>“Although tonight’s a vegetarian banquet, I feel like it could use some wine to bring out the joy!” Xiao Wanshan carried a jug of osmanthus wine out from the house and chuckled, “The fragrance of the wine mixed with dishes, makes up another delicacy.”<br/><br/>“Ha-ha, sure we can have wine, just don’t pretty up your words.” Xiao’s mother laughed, “Fine, go ahead and drink, but do not drink too much!”<br/><br/>The grandfather stared hopefully at the grandmother, who waved her hand approvingly, “Alright, if my two sons-in-law want some wine, go ahead. Wanshan, Jianjun, do not let your dad drink too much. Shis body can’t handle too much alcohol now.”<br/><br/>“Sure mom, don’t you worry, we’ll just let dad have a glass!” Xiao Wanshan instantly responded, “This osmanthus wine is rather beneficial for your health. Come on dad, let me pour you a glass.”<br/><br/>After pouring a glass for his grandfather, Xiao Wanshan poured one for Gao<br/><br/>Jianjun as well, “Jianjun, tonight, we drink to our heart’s content!”<br/><br/>Gao Jianjun immediately agreed, “Sure, I’ll join my brother-in-law!”<br/><br/>Ji Yuzhu, feeling a bit exasperated, commented, “Heh, one second you say don’t overdo the drinking, the next it’s to drink until satisfied. Your determination should be ‘no stopping until drunk,’ huh?”<br/><br/>“Yeah, you can have a good sleep after getting drunk!” Gao Jianjun nodded.<br/><br/>“Well, don’t complain about a headache tomorrow,” Ji Yuzhu did not object.<br/><br/>After all, it’s a rare gathering for the two families, as long as everyone is happy, it’s fine.<br/><br/>Generally, Gao Jianjun does not overdrink. Even if he is forced to at work, he always knows his limit. So, it’s okay to lose that control slightly among family.<br/><br/>Just the people after drinking…<br/><br/>Thinking about drunken men, Ji Yuzhu involuntarily blushed.<br/><br/>“Mom, why is your face so red? Are you feeling hot?” Gao Yanxin asked in a care-free tone, “The weather is indeed quite hot. Ah Xuan, why didn’t you have an air conditioner installed in the living room? It must be unbearable to endure this heat.”<br/><br/>His elder aunt’s family wasn’t lacking financially, installing an air conditioner wouldn’t be a problem.<br/><br/>Xiao Junxuan responded, “The fan usually gives us enough comfort. But I’ll get an air conditioner tomorrow.”<br/><br/>Although the fan is usually enough, on particularly hot days, it can become unbearably warm.<br/><br/>“Alright, cousin, I’ll accompany you tomorrow,” Gao Yanxin volunteered. Ji Yuzhu smiled, “Okay, you just have to be part of everything.”<br/><br/>Afterward, everyone enjoyed their meal and engaged in lively conversations. The atmosphere was both lively and warm.<br/><br/>Even though they were just vegetarian dishes, they were much more appreciated than the usual meat dishes.<br/><br/>The men, who generally didn’t embrace vegetarian food, relished these dishes, picking up bites non-stop. As they enjoyed their drinks and savored the vegetarian dishes, they truly revelled in the unique flavor and indulged themselves.<br/><br/>Xiao Siqian just turned 18, and he could partake in some drinking. So, he too had two glasses of wine.<br/><br/>With two glasses of wine in his stomach, he felt a bit intoxicated, unsure if it was the wine or the happy atmosphere.<br/><br/>That evening was filled with enjoyment for the entire family!<br/><br/>The next day, bright and early, Xiao’s Mother and her grandmother made breakfast for everyone.<br/><br/>Steamed buns, rice porridge and noodles were available, and they could choose whichever they wanted to have.<br/><br/>After breakfast, Xiao Junxuan planned to go to the county town to buy some air conditioners.<br/><br/>Since he had decided to install it, he planned to have one fitted in each room, so as not to be bothered later.<br/><br/>There were hardly any appliances in the stores in the town, so they could only go to the county town.<br/><br/>Gao Yanxin wanted to go – so did Xiao Jinli.<br/><br/>The grandmother said, “Alright, you kids go to the county town and take a look, if you can’t get back by noon, just go to a restaurant, order some good dishes and have a meal, then go and have some fun in the afternoon!”<br/><br/>Xiao Junxuan nodded, “Okay!”<br/><br/>But Gao Yanxin said, “Grandma, going out to play in this weather, we might get sunburned. Even if we don’t get sunburned, we’ll still get tan, and frankly, there’s nothing interesting to do in the county town that we haven’t already done. I think we should come right back after we’ve finished buying the air conditioners. The county town is not as fun as staying at home.”<br/><br/>As for the afternoon, he can just play with that group of kids chasing after calves.<br/><br/>“…” The grandmother said, “Fine, you guys go ahead early, and while it’s still not too hot, if you can get back after you’ve finished shopping, just call home and have lunch. If you can’t make it, go to a restaurant, eat and come back. Don’t go hungry. You guys, as young men, can bear being hungry, but my little darling Jinli can’t.”<br/><br/>“Grandma, listen to you. Out of all of us, no one can go hungry except for our<br/><br/>cousin.” Gao Yanxin assured.<br/><br/>“Alright, you guys go ahead and come back early!” Grandma urged them.<br/><br/>Xiao Junxuan took his younger brothers and sisters to the appliance store in the county town.<br/><br/>The largest appliance store in the county town was located on the Old Square, called “Bafang Electric Appliance,” owned by a friend of Xiao Junxuan’s.<br/><br/>Before they left, Xiao Junxuan had already called his friend.<br/><br/>By the time Xiao Junxuan arrived, his friend was already waiting at the door.<br/><br/>“Hey Ah Xuan, you’re here early!” Yuan Kai greeted Xiao Junxuan, took a look at the people following him and smiled, “Are these three your younger brothers and sister?”<br/><br/>Xiao Junxuan nodded, “This is my cousin Gao Yanxin, my younger brother Xiao Siqian and my younger sister Xiao Jinli.”<br/><br/>Among the group, only Xiao Jinli was underage.<br/><br/>After Yuan Kai had greeted them, he led them to the reception room and even got some candies for Xiao Jinli.<br/><br/>He thought that kids always love candies.<br/><br/>Xiao Junxuan chatted with him for a while then moved on to check out the air conditioners.<br/><br/>“Ah Kai, I want to buy one Central Air Conditioner and six Wall-Mounted Air Conditioners.” Xiao Junxuan said directly.<br/><br/>One for the living room and the rest six were to be installed in the rooms. “Ah Xuan, you’re buying so many air conditioners, you could totally set up a wholesale market. Haha… Alright, I’ll sell them to you at wholesale prices. I’ll have them delivered to you in the afternoon.” Yuan Kai said, “And then, I’ll have the master install them for you.”<br/><br/>“Alright, let’s settle the bill then.” Xiao Junxuan said with a smile. Because they were friends, and also because Xiao Junxuan bought in bulk, when the bill came for the seven air conditioners, it was twenty-three thousand in total. Yuan Kai directly rounded it down to twenty thousand.<br/><br/>Xiao Jinli twitched at the corner of her mouth when she heard the discount.<br/><br/>But this friend was really something – he didn’t take advantage of them.<br/><br/>Otherwise, a discount of several hundred would’ve been generous enough..\t\t\t\t\t\t</div>", "images": {}, "success": true}