{"id": 102, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14254834.html", "title": "Chapter 102 - Chapter 102: Chapter 102: Villagers Selling Vegetables (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 102 - Chapter 102: Chapter 102: Villagers Selling Vegetables (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 102: Chapter 102: Villagers Selling Vegetables (Second Update)<br/><br/>Translator: 549690339<br/><br/>Chen Qiulan woke up before dawn, took her flashlight, and picked two large baskets of vegetables from the field. She then washed them in the water channel and carried them straight to town to sell.<br/><br/>Quite a few other villagers were also picking vegetables in the fields just like her.<br/><br/>“Ha, Qiulan, are you selling vegetables in town today as well?” Li Qiuxiang asked with a smile, “How much did you pick today?”<br/><br/>“I picked two baskets.” Chen Qiulan said with a smile, “Now that everyone has vegetables to sell, there are more sellers than buyers at the market.”<br/><br/>Li Qiuxiang sighed lightly, “With so many vegetables, we have to sell them even if they don’t sell well. Otherwise, they would rot in the ground.”<br/><br/>At this point, she spoke excitedly, “Qiulan, haven’t you noticed that the vegetables grown from the soil turned by earthworms taste so good? My grandson used to hate eating green vegetables; it was like he was eating poison.<br/><br/>But after trying the vegetables from this field a couple of times, he finished a whole plate of them all by himself. We adults only got a few leaves, and now he is even picky about meat, always asking for more vegetables. It’s funny, I used to worry about him not eating enough vegetables, and now I worry about him not eating enough meat.”<br/><br/>“Haha, so your child is like that too. I thought it was only my family. My two grandsons and granddaughters are the same. Now, we must cook extra vegetables from this field for every meal, otherwise, they won’t eat.”<br/><br/>Chen Qiulan chuckled, “I was wondering when they started to love these vegetables so much? They used to want big fish and meat every day, and now they don’t even like them.”<br/><br/>Li Qiuxiang said with a smile, “Hehe, I’ve asked several families, and they all have the same situation. The children are all competing to eat vegetables, and they can eat more rice now. You see, what’s going on in Jinli’s head? He’s so smart to think of using earthworms to till the soil for planting vegetables. Look at these vegetables, they taste so good. I think that as long as our village’s vegetables sell once, those who have tasted them will definitely come back for more.”<br/><br/>If she were to buy vegetables herself, she would definitely think that way.<br/><br/>“Qiulan, have you finished picking? It’s getting bright, and I have to hurry to town to grab a good spot, so we can sell faster and go home.”<br/><br/>“Yeah, almost done. I’ll have Qingshan drive us over,” Chen Qiulan said.<br/><br/>“Alright, I’ll take your car.” Li Qiuxiang didn’t refuse.<br/><br/>Many people asked their family members with motorcycles to take them to town, but her family hadn’t bought one yet.<br/><br/>She planned to buy a motorcycle when her younger son gets married at the end of the year since most of the young people are living outside the village.<br/><br/>Xiao Qingshan soon arrived with the car.<br/><br/>As he carried the vegetables to the trunk, he said, “Mom, now that everyone at home loves vegetables so much, don’t sell all of them, or the children will cry to death.”<br/><br/>Chen Qiulan laughed and said, “I know. I just saw that there were too many vegetables in the field that we couldn’t eat them all, so I had to sell some. Otherwise, they would rot away in the field.”<br/><br/>Xiao Qingshan said with a smile, “Mom, I’m just reminding you. After all, we have to take care of our family first.”<br/><br/>“Alright, you talk too much; I know how to handle it,” Chen Qiulan said, “Hurry up and take us to the fair. Today is fair day, so there will be many people selling vegetables. Aunt Qiuxiang and I need to get a good spot.”<br/><br/>“Don’t worry, our four wheels will definitely be faster than your two legs,” Xiao Qingshan said with a smile, “It will take us about ten minutes to get to the fair, and it probably won’t even be bright by then.”<br/><br/>About ten minutes later, Chen Qiulan and Li Qiuxiang found a good spot at an intersection with a lot of traffic.<br/><br/>Usually, such spots would have been taken by others, but they arrived early today.<br/><br/>As the day grew brighter, more and more people came to the market to buy vegetables.<br/><br/>Many shoppers noticed the vegetables from the two families at a glance; they looked fresh and tender.<br/><br/>A refined woman approached them and asked, “How much are the pak choi and onions?”<br/><br/>“The pak choi is one yuan for two bundles, and the onions are one yuan for three bundles!” Chen Qiulan said.<br/><br/>Rural people usually tie their vegetables with straw into bundles for convenience when selling them.<br/><br/>“How about this, the pak choi is 80 cents for two bundles, and the onions are one yuan for four bundles, and I’ll take them all,” said the refined woman.<br/><br/>She was a restaurant owner, so she needed a larger quantity.<br/><br/>After hearing this, Chen Qiulan didn’t hesitate and nodded, “Alright, I’ll sell them all to you. There are twelve bundles of pak Choi, which is 4.8 yuan, and twenty bundles of onions, which is exactly 5 yuan. In total, that would be 9.8 yuan.”<br/><br/>The boss lady bargained, “I bought so much, so let’s forget about the 80 cents.” Chen Qiulan, being straightforward, said, “Okay, since it’s all homegrown. Let’s make it nine yuan.”<br/><br/>After paying, the boss lady looked at the chives in Li Qiuxiang’s basket and asked, “How much are these chives?”<br/><br/>Li Qiuxiang replied, “One yuan for three bundles.”<br/><br/>“One yuan for four bundles, and I’ll take them all,” the boss lady bargained.<br/><br/>“Okay, four bundles it is. There are thirty bundles in total, so it’s seven and a half yuan for all,” Li Qiuxiang calculated.<br/><br/>“Seven yuan for all,” the boss lady countered.<br/><br/>“Alright, seven it is.” Li Qiuxiang didn’t want to argue any further.<br/><br/>After the boss lady left, the vegetables of both families were gradually sold out.<br/><br/>Although they were sold at a lower price, the income was still a small bonus for the rural people who grew extra vegetables at home.<br/><br/>Around eight o’clock, the two packed their things and left them at the door of a familiar shop.<br/><br/>Li Qiuxiang said with a smile, “I didn’t expect our vegetables to sell out so early.<br/><br/>Usually, I don’t even know if I can sell them all by ten o’clock.” Chen Qiulan said, “Our vegetables look fresher.”<br/><br/>“Yes, they do.” Li Qiuxiang agreed, “Qiulan, let’s go have breakfast.”<br/><br/>“Sure,” Chen Qiulan replied, “What do you want to eat? Sweet potato vermicelli or rice noodles?”<br/><br/>Having sold all their vegetables, they now had time to stroll around, so they needed a full stomach.<br/><br/>“Let’s have sweet potato vermicelli.”<br/><br/>Then, the two went to the sweet potato vermicelli stall and ordered two servings of vermicelli.<br/><br/>While eating their vermicelli, two more villagers who had sold vegetables came over, also here for breakfast.<br/><br/>“Where did you set up, that you sold out so quickly?”<br/><br/>“You look like you sold out too. Hehe, today’s vegetables really sell well.”<br/><br/>“Yes, when we came, I was worried that I wouldn’t be able to sell such a large load. I didn’t expect to sell out so quickly.”<br/><br/>“Our spot was very good, so we sold out very quickly. Where did you set up?<br/><br/>“We were stopped by a few people at the entrance of the market, and by the time we went inside to find a location, everywhere was full. We could only set up in a remote corner. However, people still came over to buy from us, so we sold out quickly..”\t\t\t\t\t\t</div>", "images": {}, "success": true}