{"id": 106, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14254855.html", "title": "Chapter 106 - Chapter 106: Chapter 106: You Aren ‘T Amnesiac At All (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 106 - Chapter 106: Chapter 106: You Aren ‘T Amnesiac At All (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 106: Chapter 106: You Aren ‘t Amnesiac At All (Second Update)<br/><br/>Translator: 549690339<br/><br/>Xiao Siqian paused slightly, reining in his slightly annoyed expression, and continued, “As for establishing a company, this collaborative model certainly has its advantages and disadvantages.”<br/><br/>“The company’s collaborative model is mainly based on farmers’ land or capital investment to establish a shareholding system or limited liability company.”<br/><br/>“Under the company model, farmers’ capital investment or land capitalization will become company assets, which will be managed by the company as a whole, thus solving the production disparities in the cooperative process due to the individual lack of capabilities.”<br/><br/>“The company operates independently, with shareholders sharing benefits and risks.”<br/><br/>“So the advantages of establishing a company are: firstly, the company is established according to a relatively advanced modern property rights system, with a clear and reasonable rights and responsibilities system, which better protects the interests of farmers who participate in the cooperation.”<br/><br/>“Secondly, farmers can directly participate in production, and the market sales price of the products will be unified, eliminating the problem of interest loss caused by competition among cooperatives in a unified market.”<br/><br/>“Thirdly, the company operates independently and is managed uniformly, which effectively prevents farmers from breaching contracts. Talented and knowledgeable farmers can participate in the management and conduct market demand surveys and market forecasts, determine production projects and production plans, which is beneficial for the cultivation of local management talents and the growth and development of the company, realizing agricultural industrial scale operation.”<br/><br/>Xiao Siqian looked at Xiao Jinli’s bright eyes and continued, “Of course, the company model also has its shortcomings.”<br/><br/>Xiao Jinli nodded and said, “Well, Brother Xiao Quan, you go ahead and tell me.”<br/><br/>Xiao Siqian said, “First, the establishment of a company is more complicated than that of a cooperative, and the requirement for the registered and paid-in capital of a company is higher than that of a cooperative. For example, what standard should farmers’ land be used to participate in the shareholding, and so on.”<br/><br/>“Second, the company’s registration and operation must follow the modern corporate management system, independent accounting, independent profit and loss payment, which puts higher requirements on the management personnel participating in the company’s operation and management. However, there is a general lack of talent reserve in this area in rural areas. If external personnel are hired to participate in the management, combined with the unfamiliarity of farmers with the company’s operation, the professional managers do not get full trust and authorization, which affects the management decisions.”<br/><br/>“These two cooperative models have their own advantages and disadvantages, so, after all, this is a big matter, and it’s better for the village to consider it carefully!”<br/><br/>The last sentence was Xiao Siqian’s sincere advice.<br/><br/>However, he was now being stared at closely by Xiao Jinli, his expression serious and solemn.<br/><br/>Xiao Siqian felt his scalp tingling and uneasy, and he was about to break out in cold sweat.<br/><br/>He asked, “What… what’s wrong? Sister Jinli, why are you staring at me like<br/><br/>Xiao Jinli suddenly blurted out, “Brother Little Quan, you never lost your memory, did you?”<br/><br/>Her beautiful eyes stared closely at Xiao Siqian’s dark pupils.<br/><br/>Xiao Siqian’s pupils shrank suddenly and then relaxed into a smile. He nodded and said, “I knew it, Sister Jinli is so smart, I couldn’t deceive you. That’s right, I never lost my memory. I never had memory loss from the very beginning.”<br/><br/>Xiao Jinli frowned and asked in confusion, “If you never lost your memory from the start, why did you pretend to have amnesia and hide it from me and my family? Is it fun?”<br/><br/>Xiao Siqian shook his head and said, “No, I didn’t do it on purpose. I… when I woke up in the hospital, I was very excited and thrilled, I finally survived.<br/><br/>However, this excitement and joy were instantly gone, because I no longer had a home.”<br/><br/>Because I no longer had a home!<br/><br/>“I was born in a wealthy family. My maternal grandfather was rich, and my mom brought a sky-high dowry when she married my dad. I had a happy life for a while.<br/><br/>But when I was four or five years old, my mom died. She killed herself by jumping off a building due to depression. After my mom’s death, my dad brought home a woman and a child, saying they were to be my new mom and older brother.<br/><br/>At first, I disliked my stepmother and brother, and the sight of them filled me with great resistance.<br/><br/>But my stepmother and brother were genuinely good people. No matter how I made a fuss or cursed them, they just shrugged it off and even advised my dad, saying that I was just a child and needed time.<br/><br/>Later, their kindness really touched me. I started to call her mom and him older brother, and our family lived happily ever after, appearing to be a happy and joyful family.”<br/><br/>Faced with such a happy and joyful family, I didn’t care whether I was rich or not. So they coaxed me into signing away my inheritance rights to my mom’s estate, and I foolishly gave them up.”<br/><br/>But just before I turned eighteen and became an adult, I was kidnapped on my way to the company.”<br/><br/>At that time, I didn’t know where I was, but when I woke up, I found myself in an abandoned warehouse. And then, I learned from the kidnappers that they were hired by someone very close to me.<br/><br/>They were paid to take my life. Following the employer’s instructions, they kidnapped me and were about to kill me. But those kidnappers got too greedy; after accepting the employer’s money, they also called my grandfather for a ransom of two hundred million. To make sure I didn’t starve to death, they gave me half a steamed bun and half a bottle of water every day to ensure that I would have the strength to escape when they weren’t paying attention.”<br/><br/>But even so, I escaped. They chased me for a long time, and I didn’t know how far or where I had run. But when I reached the edge of a mountain peak cliff, there was nowhere left to go. At that moment, I was filled with despair, rage, and resentment. I couldn’t accept dying so senselessly while the culprits remained at large.”<br/><br/>Unexpectedly, I passed out. When I woke up, I was in the hospital.<br/><br/>At that time, my first thought was how great it was to be alive! As long as I was alive, I could avenge myself!<br/><br/>But my second thought was that I couldn’t go back right away and I couldn’t contact anyone.”<br/><br/>If they knew I was still alive, I would surely face kidnapping and assassination again. I didn’t want to involve anyone. While I was in the hospital, I was afraid that the kidnappers would come for me. But after more than ten days of hospitalization, there was no sign of them. I wondered where those kidnappers had gone. But no matter where they went, I felt safe for now. I wanted to stay here for the time being; the most dangerous place is the safest.’<br/><br/>“The real reason I pretended to have amnesia was that I didn’t want the people at the Yamen to contact my so-called relatives. I want to go back and take revenge, and I want to give them an unexpected heavy blow.”<br/><br/>At this point, he looked at Xiao Jinli with great seriousness and said, “Sister Jinli, I want to thank you for carrying me down the mountain and allowing me to survive. Also, I chose to live at your house because I needed a shelter. But later, I gradually felt warmth and happiness in this family. The feeling was completely different from the harmonious and happy family that I had experienced before. Here, I experienced the most sincere and simple affection.<br/><br/>So, I am more and more reluctant to leave this home.”<br/><br/>Xiao Jinli looked at him and said seriously, “It doesn’t matter who you were before. As long as you don’t threaten the safety of my family, you will always be Xiao Siqian of our family and my Brother Little Quan.”<br/><br/>Xiao Siqian, with misty eyes, also said solemnly, “Sister Jinli, rest assured, I swear that I will never harm this family, nor will I allow anyone to harm it..”\t\t\t\t\t\t</div>", "images": {}, "success": true}