{"id": 108, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14254869.html", "title": "Chapter 108 - Chapter 108: Chapter 108: Earthworm Growth Environment (2Nd Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 108 - Chapter 108: Chapter 108: Earthworm Growth Environment (2Nd Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 108: Chapter 108: Earthworm Growth Environment (2nd Update)<br/><br/>Translator: 549690339<br/><br/>The Village Head returned quickly and saw Xiao Siqian playing with the two children, nothing strange about it.<br/><br/>When taking care of children, it’s just about playing with them.<br/><br/>As soon as the Village Head entered, he asked, “Jinli, what did you want to talk to me about?”<br/><br/>Xiao Jinli said, “Uncle Village Head, it’s about the establishment of the cooperative in the village. Last night, we discussed another plan and thought it would be better to set up a company.”<br/><br/>“Set up a company?” The Village Head looked a bit startled.<br/><br/>For the Village Head, who had spent a lifetime working in the countryside, the company was quite distant to them. In their impression, a company symbolized wealth.<br/><br/>Now that Xiao Jinli suddenly told him about setting up a company in the village, he was genuinely surprised.<br/><br/>He asked hesitantly, “Can the village establish… a company? Is it possible?”<br/><br/>Xiao Jinli nodded, “Yes, it is. I have looked up some information, and in a few days, I will write up the proposals for the establishment of the cooperative and the company. At that time, we can let the villagers see them, vote on which proposal to choose, Uncle Village Chief, is that alright?”<br/><br/>After listening, the Village Head thought for a moment and said, “It is possible. However, Jinli, you need to know that whether it is the establishment of a cooperative or a company, the premise is that there are enough earthworms to allow everyone to grow vegetables. Otherwise, without earthworms, we wouldn’t know if the ordinary vegetables that grow would sell well.”<br/><br/>Xiao Jinli smiled and said, “Uncle Village Head, since I have planned to establish a cooperative or a company in the village, I have naturally taken this issue into account. Rest assured, I will be able to cultivate enough earthworms before the start of next spring.”<br/><br/>The Village Head smiled and said, “Good, Jinli, for this matter, I will discuss it with the village cadres at a meeting later on. After you have completed the two proposals, we can hold a village-wide meeting. However, should we wait for the young people who have gone out for work to return?”<br/><br/>The younger generation is now the decision-makers in many families.<br/><br/>Xiao Jinli said, “Let’s hold a village-wide meeting first to see the villagers’ reactions. When the young people return to the village at the end of the year, we can hold another meeting. However, whether it is the establishment of a cooperative or a company, a decision must be made before the start of spring.” The Village Head nodded and said, “Alright, I understand. We will discuss it together later.”<br/><br/>Xiao Jinli nodded, “Alright, in these few days, I will look up some relevant information and draft several proposals first. You can also give a heads-up to everyone in advance.”<br/><br/>The Village Head nodded, “Sure, no problem!”<br/><br/>After discussing with the Village Head, Xiao Jinli and Xiao Siqian left the Village Chief’s house.<br/><br/>The Village Head looked at Xiao Jinli’s small figure, sighed towards the sky, “She is clearly a child but has been worrying about the village affairs since childhood. ”<br/><br/>He hoped that this time, Xiao Jinli could truly lead the entire village onto a road of prosperity.<br/><br/>Little did the Village Head know, not far away, Xiao Jinli said to Xiao Siqian as a matter of course, “Brother Little Quan, I will leave this matter of writing the proposals to you.”<br/><br/>Xiao Siqian, . ‘ So he was drafted into this.<br/><br/>She patted Xiao Siqian’s arm and said earnestly, “Brother Little Quan, it’s an honorable and great task. The future development of Xiao Family Village is all in your hands. Brother Little Quan, keep it up!”<br/><br/>While speaking, she beamed happily, winked at Xiao Siqian, looking very adorable.<br/><br/>Xiao Siqian reached out and arranged her bangs, laughing, “Alright, I accept this honorable and great task.”<br/><br/>A simple proposal couldn’t stump a world-famous finance master like him.<br/><br/>Xiao Jinli laughed and said, “Alright, if you need any information later on, I will accompany you to find it.”<br/><br/>Xiao Siqian said helplessly, “Haha, I shall thank my Princess Jinli in advance.”<br/><br/>Xiao Jinli waved her hand and said, “Yes, you’re welcome!”<br/><br/>Xiao Siqian, “…” He even praised the snake for adding legs.<br/><br/>Xiao Siqian said, “Then, Princess Jinli, can you accompany me to walk around the fields in the village? After all, when writing the proposal, I need to conduct a field investigation.”<br/><br/>“Alright, let’s go!” Xiao Jinli waved her hand with a swagger.<br/><br/>Subsequently, in the next three to four days, Xiao Jinli accompanied Xiao Siqian, touring from the head of the village to the tail, and leaving no stone unturned in each area at the foot of the hills and other places.<br/><br/>As for what Xiao Jinli and Xiao Siqian were doing, Xiao’s mother and others never asked.<br/><br/>In the end, it was Gao Yanxin who curiously asked, “Cousin, what have you and<br/><br/>Xiao Quan been doing these few days?”<br/><br/>Xiao Jinli didn’t hide it, “We’re conducting field investigations!”<br/><br/>“What field investigation?” Gao Yanxin asked, puzzled.<br/><br/>Xiao Jinli didn’t hide it and said, “If the village really wants to establish a cooperative or a company, the planting area is essential. These days, we’ve been looking at which areas in the village are suitable and which ones need to be eliminated.”<br/><br/>Xiao Wanshan asked with some confusion, “Aren’t there earthworms? Can’t any piece of land work?”<br/><br/>Xiao Jinli shook her head, “The most suitable living temperature for earthworms is about 20 degrees Celsius. Below 5 degrees and below o degrees, they will die. At 15 degrees, they can reproduce normally, but if it exceeds 33 degrees, they will either crawl away or die.<br/><br/>Additionally, their living environment must maintain a certain amount of moisture. If it’s too dry, they’ll die. If it’s too wet, it’s difficult to survive.<br/><br/>Therefore, worms are unable to survive in environments that are too dry or too wet and have excessive moisture accumulation. For example, mountain flatlands are too dry and filled with sand and stones, making it hard for worms to survive. Areas with excessive moisture and poor drainage, such as water dan, are also unsuitable for worm habitation.<br/><br/>So when we enclose the land, we must take all these factors into consideration instead of blindly putting worms in. Doing so would only result in waste and have no benefits.<br/><br/>Xiao Wanshan nodded, “Oh, I see. As long as you have an idea, that’s good. Xiao<br/><br/>Quan, I’m sorry to have troubled you to accompany Xiao Bao these days.”<br/><br/>Xiao Siqian smiled and said, “Uncle, it’s not a matter of trouble or not. Didn’t you say that we are a family?”<br/><br/>Gao Yanxin looked at his cousin and then glanced at Xiao Siqian, whose smile hadn’t faded yet, and immediately said, “Then I’ll also accompany you guys on your trips.”<br/><br/>Xiao Jinli asked doubtfully, “Brother Gao Yanxin, aren’t you following my brother anymore?”<br/><br/>Gao Yanxin waved his hand and said, “No, I won’t. Going to the county town every day, there’s nothing fun besides buying canned food for Cow King. It’s better to stay in the village. But it’s strange that Cow King doesn’t eat canned food these days, whether it’s meat canned food or fruit canned food. Cousin, what on earth does Cow King like to eat?”<br/><br/>Xiao Jinli smiled and said, “It likes the Green Barley Grass. Even though it’s Cow King, its nature is still that of a cow. Don’t cows eat grass?” Gao Yanxin, “…” He felt like he had been played by his cousin..\t\t\t\t\t\t</div>", "images": {}, "success": true}