{"id": 103, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14254836.html", "title": "Chapter 103 - Chapter 103: Chapter 103: Xiao Family’S Vegetables Successfully Made It Out Of The Circle (Extra Chapter)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 103 - Chapter 103: Chapter 103: Xiao Family’S Vegetables Successfully Made It Out Of The Circle (Extra Chapter)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 103: Chapter 103: Xiao Family’s Vegetables Successfully Made It Out of the Circle (Extra Chapter)<br/><br/>Translator: 549690339<br/><br/>The vegetables sold by the villagers of Xiao Family Village were popular, initially because they looked better. The vegetables in their baskets were juicier and greener than others, and the prices were not high.<br/><br/>However, afterwards, anyone from Xiao Family Village who had sold vegetables in the Open Market Town, would be stopped by previous customers who would eagerly buy from them.<br/><br/>“Hey, slow down, don’t rush, don’t crush our vegetables!”<br/><br/>Chen Qiulan was anxious as she watched as these customers raided her basket of vegetables, grabbing them haphazardly.<br/><br/>Soon, seven or eight people cleared out the vegetables in her basket.<br/><br/>Chen Qiulan,”.<br/><br/>Having sold out so quickly felt good.<br/><br/>“Come on, tally up our bill,” an old lady holding several small cabbages and spinach asked.<br/><br/>Chen Qiulan said, “Small cabbage is fifty cents a bundle, spinach is one yuan and fifty cents a bundle.”<br/><br/>The old lady frowned slightly and said, “Yesterday, this small cabbage was sold for forty cents, today it’s fifty cents. Spinach was one yuan, make it cheaper.”<br/><br/>Chen Qiulan was not a fool. Her vegetables were in high demand but she would not sell them cheaply.<br/><br/>She had no relationship with these people and didn’t know them. It could be considered good if she sold them at a low price once; they couldn’t expect her to sell cheaply every time.<br/><br/>Chen Qiulan said, “No, I can’t lower the price of these vegetables.”<br/><br/>Chen Qiulan stood firm!<br/><br/>“I bought so much, make it cheaper.” The old lady haggled.<br/><br/>Chen Qiulan laughed and said, “Old lady, I haven’t even started selling this batch of vegetables.”<br/><br/>Meaning that even if she didn’t buy, others would clear out her vegetables anyway.<br/><br/>The old lady realized she could not get a discount, took into account the vegetables in her hand, and thought of her own children back home, so she paid.<br/><br/>Seeing this, the others did not haggle with Chen Qiulan either; they paid according to the prices Chen Qiulan quoted.<br/><br/>Chen Qiulan looked at the empty baskets, looked at the money in her hand, and muttered, “Did I sell them too cheaply? Should I raise prices further?”<br/><br/>Chen Qiulan packed up her empty baskets and headed home.<br/><br/>It wasn’t a market day, so there was nothing to buy at home. Of course, after selling she would go straight home.<br/><br/>On her way, she bumped into other sellers.<br/><br/>They looked at each other first, then burst into laughter.<br/><br/>“I thought only my vegetables sold quickly, haha, your vegetables were sold out that quickly, too.”<br/><br/>“Yes, I didn’t even reach the entrance of the market when the people who bought my vegetables previously were waiting there. My basket hadn’t even been put down when they snapped up all my vegetables. Haha, I’ve been selling my homegrown vegetables for more than ten years, and this is the first time I’ve seen such a situation.”<br/><br/>“I was in the same situation. My vegetables were also sold out by people who had bought from me before, blocking the path and emptying the basket in just a few moments.<br/><br/>“Now, our vegetables are really tasty. Even the children at home, who usually dislike green vegetables, are competing to eat them. Not to mention, those who bought for the first time will definitely like it. So, they will buy a second time, a third time, and will always buy ours.”<br/><br/>“Haha, I also feel that this is indeed the case. What do you think, should we raise the price of our vegetables?”<br/><br/>“I’m also considering this issue. I think we should raise it a bit. After all, our vegetables are superior because we paid to buy earthworms; our costs are certainly a bit higher. It’s reasonable to price them higher. Do you all agree?”<br/><br/>“Hmm, I agree.”<br/><br/>They started out just testing the waters by buying some earthworms and placing them in the field. The vegetables in their field were grown for their own consumption and they only sold the surplus.<br/><br/>Who would have thought that they would sell so well?<br/><br/>They felt conflicted. On one hand, they wanted to harvest more vegetables from the field to sell; on the other hand, if they sold too many, they wouldn’t have any left at home and their children would grumble.<br/><br/>“Let’s raise prices tomorrow then. Cabbage is one yuan, spinach two yuan, and chives and onions are one yuan for two bundles…”<br/><br/>“Do you think this pricing is okay?”<br/><br/>“Raising prices by so much all at once, wouldn’t that be bad?”<br/><br/>“It’s business; if they think it’s expensive, they can choose not to buy. Shall we give it a try?”<br/><br/>“Well, let’s give it a try.”<br/><br/>After the prices were set, they returned home and discussed it with their families.<br/><br/>“If we pick all the vegetables in the field to sell, will we have enough to eat?” After hearing his wife’s words, the Village Head hesitated. “We only planted vegetables in five points of land. The kids now want two or three vegetables for every meal.”<br/><br/>Chen Qiulan said, “Old man, this is what I’m thinking. We should go buy more earthworms from Jinli and grow more. When the time comes, we’ll have enough vegetables to sell. I think, given the aesthetics and taste of these vegetables, we won’t have problems selling them.”<br/><br/>Upon hearing this, the Village Head became thoughtful and slapped his thigh, saying, “I think this is a good idea. If the town can’t consume all the vegetables we grow, we can go to tne City.”<br/><br/>Chen Qiulan’s eyes lit up and she laughed, “I’ve had the same idea. If that’s the case, let’s discuss with Qing Shan, and plant two or three mu of land, and buy more earthworms from Jinli.”<br/><br/>Upon hearing this, the Village Head frowned slightly.<br/><br/>He said, “Buying earthworms for two or three mu of land is a lot. I don’t know how many Jinli can raise. I’ll go to the Wanshan Family in a bit and ask Jinli. If she can’t raise that many, I’m afraid we can’t plant vegetables on two to three mu of land.<br/><br/>Chen Qiulan also thought of this problem when she heard what the old man said.<br/><br/>“Okay, go talk to Jinli about this first. If it can be done, we’ll plant several mu of vegetables next year. We have Qing Shan and a vehicle at home, so it’s convenient. If it can’t be done, then we’ll have to give up.” Chen Qiulan said.<br/><br/>Other villagers also stated that they wanted to buy more earthworms from Xiao Jinli and grow more vegetables for sale.<br/><br/>“But what if we grow too much and no one buys it? Do the vegetables just rot in the field?” Xiao Chunfu asked with a furrowed brow.<br/><br/>Li Qiuxiang confidently responded, “Old man, you didn’t see the situation when we were selling vegetables at the market. People who bought before were waiting on the road to buy from us; our vegetables were almost snapped up in a few moments. I think as long as they have eaten our vegetables, they will definitely buy a few more times. These days, we earned several hundred yuan from selling vegetables. The only pity is that we don’t grow that many vegetables at home. I estimate we can only sell two to three more times before we run out.”<br/><br/>If there were no vegetables to sell, that would mean one less source of income.<br/><br/>Thinking about having vegetables to sell every day, she wanted to plant more land, so she discussed it with her old man.<br/><br/>Xiao Chunfu was quite conservative; he said somewhat pessimistically, “What if people buy a few more times and then stop buying? Who would we sell the large amount of vegetables we grew to?”<br/><br/>Li Qiuxiang was about to roll her eyes, she said, “Taohua Town isn’t just made up of a few people buying vegetables. If they don’t buy, others will. Besides, I just don’t believe that we could ever tire of the vegetables we grow at home, not to mention people who buy every two or three days.”<br/><br/>Xiao Chunfu,\t\t\t\t\t\t</div>", "images": {}, "success": true}