{"id": 107, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14254863.html", "title": "Chapter 107 - Chapter 107: Chapter 107: It’S More Suitable To Start A Company (Part 1)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 107 - Chapter 107: Chapter 107: It’S More Suitable To Start A Company (Part 1)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 107: Chapter 107: It’s More Suitable to Start a Company (Part 1)<br/><br/>Translator: 549690339<br/><br/>The second day, early in the morning, Xiao Jinli took advantage of the time when Xiao Father and her older brother hadn’t gone to work yet and discussed the pros and cons of establishing a cooperative or company in the village.<br/><br/>Xiao Father started his company from scratch and had been running it for several years, so he was quite familiar with the operation procedures of running a company.<br/><br/>He thought for a moment and said, “I also think it’s more appropriate for the village to start a company. Sharing the benefits and risks can ensure that the village’s development path is smoother. As for the company’s procedures, your Dad and your brother can handle them. After all, your Dad is running a company now. This way, it would help the village’s company to avoid some detours.”<br/><br/>Xiao Siqian was a bit surprised.<br/><br/>From Xiao Father’s words, it seemed that their family was aware of Xiao Father running a company.<br/><br/>It made sense; how could he possibly keep it a secret after running a company for so many years?<br/><br/>He just wondered if the villagers knew about it or not.<br/><br/>After hearing her father’s words, Xiao Jinli nodded and said, “After breakfast,<br/><br/>I’ll go talk to the Village Head and listen to the opinions of the other villagers.”<br/><br/>At this time, Xiao Junxuan also said, “I also think that establishing a company is more appropriate. Many young people from our village are working outside. After the villagers start planting vegetables and the company is established, these young people might consider staying at home. In this case, children wouldn’t have to be left-behind, and the elderly would have someone to take care of them.’<br/><br/>Xiao Jinli nodded and said, “That’s also my idea. Our Xiao Family Village seems united and harmonious, but compared to other villages, we’re not that wealthy. We’re trying to see if this path of growing vegetables can lead to development.”<br/><br/>Xiao Junxuan confidently said, “This path was brought out by my sister. My sister is a Lucky Star, and our village will definitely succeed.”<br/><br/>Xiao Jinli, ‘<br/><br/>After breakfast, Xiao Jinli went to the Village Chief’s house.<br/><br/>However, the Village Chief had also gone to work in the fields.<br/><br/>There were two children at home, a ten-year-old boy named Gouwa, and a four-year-old girl named Nini, who were the Village Chief’s grandsons and granddaughters, and the children of his eldest son, Xiao Qinglin.<br/><br/>Xiao Qinglin and his wife went out for work, while Xiao Qingshan stayed at home to transport goods and help his father take care of the village.<br/><br/>“Jinli, why are you here?” Gouwa, who was playing with his sister, was very happy to see Xiao Jinli.<br/><br/>When Nini saw Xiao Jinli, she stopped playing with the sand and happily ran over, “Jinli older sister, hug!”<br/><br/>Xiao Jinli smiled and hugged Nini, weighing her in her arms, and said, “Nini, you’ve gained some weight!”<br/><br/>Then, Xiao Jinli said to Gouwa, “Gouwa, go and call your grandfather back, tell him I have something to discuss with him.”<br/><br/>Gouwa, slightly dissatisfied, said, “Jinli, my name is Mingliang, Mingliang. Don’t call me Gouwa anymore. I’m the same age as you. I’ll go call my grandfather back now. ”<br/><br/>Gouwa knew that whenever Xiao Jinli came to see his grandfather, there must be something important to talk about.<br/><br/>Xiao Siqian looked at the little Nini with two goat horn braids, two red hair strands, and a clean, white face, and said with a smile, “This child is so beautiful and cute!”<br/><br/>He noticed that the children of Xiao Family Village, regardless of their age, were all clean and tidy.<br/><br/>Being praised, Little Nini raised her lovely smile and said, “Thank you, Little Uncle!”<br/><br/>Little Uncle?<br/><br/>Xiao Siqian felt as if he had been hit by ten thousand points of damage!<br/><br/>How did he look like the age of a Little Uncle?<br/><br/>Xiao Siqian didn’t want to be called Little Uncle; he said, “Nini, not Little Uncle, call me Little Brother!”<br/><br/>Little Nini raised her head, looked at him, and asked somewhat puzzled, “But you’re taller than my uncle!”<br/><br/>Xiao Siqian, “…” He was indeed taller than Xiao Qingshan.<br/><br/>So, do children call people based on height?<br/><br/>Seeing Xiao Siqian’s injured expression, Xiao Jinli covered her mouth and laughed, saying, “Nini, this is Little Brother, not Little Uncle. He may be tall, but he’s not old.”<br/><br/>Nini nodded and said, “Oh, Little Brother!”<br/><br/>Little Nini still politely called out again.<br/><br/>Xiao Siqian immediately touched her little head happily and said with a smile, “Nini is such a good girl!”<br/><br/>Nini looked at Xiao Jinli and said, “Sister Jinli, can you play with the sand with me? Just now my brother and I were building a sandcastle.”<br/><br/>Xiao Jinli glanced at the sandpit, which had one hole here and another there, with several tree branches sticking out.<br/><br/>So, this is a castle?<br/><br/>Don’t blame her; whether in her past life or this one, she had never played with sand.<br/><br/>When she was a child in her past life, she had no time to play; all she did was study and study more.<br/><br/>In this life, though she has a young body with an adult heart, she still has no interest in playing with sand.<br/><br/>Now that a child is asking her to play with the sand, should she play or not?<br/><br/>Her eyes shifted, and she saw Xiao Siqian nearby and immediately said, “Let the little brother play in the sand with you, and sister will watch you play. Is<br/><br/>that okay?”<br/><br/>Little Nini looked at Xiao Jinli, then tilted her little head to look at Xiao Siqian, and reluctantly agreed, “Alright, little brother, come play with me!”<br/><br/>After saying that, she came out of Xiao Jinli’s arms, ran to a corner, found a small shovel, handed it to Xiao Siqian, and said, “Little brother, here, this little shovel is for you!”<br/><br/>Xiao Siqian took the shovel and was momentarily stunned.<br/><br/>From birth to now, he had never played in the sand, nor had he ever played with a small shovel.<br/><br/>So now, is he going back to childhood to enjoy the fun of childhood?<br/><br/>Xiao Siqian didn’t refuse. Holding the small shovel, he asked, “Nini, how do you play with this?”<br/><br/>Subsequently, he received a scornful look from Nini, who said condescendingly, “Little brother, this shovel is for shoveling sand, what else can you do with it?”<br/><br/>After saying that, she took the shovel and demonstrated what to do.<br/><br/>Xiao Siqian,<br/><br/>Afterwards, he began to learn it too.<br/><br/>Well, he’ll take it as making up for his childhood.<br/><br/>Little Nini took the shovel, dug out some sand, piled it up, and repeated the process, all the while saying, “I want to build a castle, just shovel the sand into piles. Little brother, do as I do!”<br/><br/>Xiao Siqian,<br/><br/>Xiao Jinli watched one teach seriously and the other learn seriously and couldn’t help but cover her mouth with a laugh.<br/><br/>These two children, both big and small, were really cute.<br/><br/>It didn’t take long for Gouwa to return first. Before entering the house, he shouted loudly, “Jinli, my grandfather said he’ll be back soon.”<br/><br/>Xiao Jinli nodded and said, “Okay!”<br/><br/>As soon as Gouwa entered the house, he headed for the sandpile too. But instead of using a shovel, he took a bottle and poured the sand into it, then poured it out again.<br/><br/>Xiao Jinli said, “Gouwa, stop pouring it out. The sand is scattering everywhere, and it might get into your eyes.”<br/><br/>After listening to Xiao Jinli’s words, Gouwa had no choice but to put down the bottle. Then he found another small shovel in the corner and started shoveling the sand, not building a castle but digging a ditch.<br/><br/>Xiao Jinli, ‘<br/><br/>Xiao Siqian,<br/><br/>So, playing with sand is still fun, right?\t\t\t\t\t\t</div>", "images": {}, "success": true}