{"id": 105, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14254847.html", "title": "Chapter 105 - Chapter 105: Chapter 105: Establishing A Cooperative (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 105 - Chapter 105: Chapter 105: Establishing A Cooperative (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 105: Chapter 105: Establishing a Cooperative (First Update)<br/><br/>Translator: 549690339<br/><br/>After Xiao Jinli shared her idea, the Village Head excitedly slapped his thigh and said, “Establishing a cooperative is a great idea. I think it’s feasible.<br/><br/>Chunfu, what do you think?”<br/><br/>In rural areas, the best way to achieve the common prosperity ot the whole village is through cooperation.<br/><br/>The state also encourages this by providing policy support such as loan subsidies, technical assistance and promotion of services, and continuously develops various forms of moderate-scale operations.<br/><br/>Cooperative model mostly focuses on family units, mainly using resources of each family for production cooperation, driving and enjoying policy support, and expanding the production scale of a certain field to achieve the same scale.<br/><br/>Xiao Family Village has been seeking a way to get rich for a long time but after years of discussion, nothing ideal has been found.<br/><br/>Now that Xiao Jinli has come up with a solution, the Village Head naturally would not want to give up.<br/><br/>Xiao Chunfu nodded and said, “I also think it’s possible.”<br/><br/>The Village Head asked others, and their opinions were similar.<br/><br/>The Village Head said, “Jinli, since this involves the big issues of the whole village, I’ll let the whole village hold a meeting. If everyone has no objections, then there should be no problem.”<br/><br/>Xiao Jinli smiled and said, “Of course.”<br/><br/>After the Village Head and others left happily, Xiao Wanshan looked at his daughter seriously and said, “Girl, letting the whole village grow vegetables for sale, engaging in agricultural operations on a large scale, and establishing a cooperative has obvious advantages. But, Little Bao, will it be too difficult?”<br/><br/>By difficulty, Xiao’s father meant whether Xiao Jinli could raise that many earthworms.<br/><br/>With 123 households in the village, each with at least three to five acres of land, it adds up to several hundred acres.<br/><br/>How many earthworms would need to be raised to meet the demand?<br/><br/>He was a little worried.<br/><br/>Gao Yanxin’s eyes widened, surprised, “Cousin, you’re really smart! How did you think about letting the entire village grow vegetables and establishing a cooperative?”<br/><br/>His cousin was only ten years old!<br/><br/>Where would a ten-year-old child know about these things?<br/><br/>Xiao Siqian’s eyes were also closely watching Xiao Jinli, thinking that this child’s mind was not something ordinary children could compare to.<br/><br/>At first, he thought she bought seeds just for fun.<br/><br/>At the end, the real plan was here.<br/><br/>Her ultimate goal was for the entire village?<br/><br/>Ji Yuzhu told her son, “Jinli has always been smart since she was a child. For small matters in the village, she usually doesn’t interfere, but for big issues, Jinli is the one who usually takes charge. Can’t you adapt to it by now? Now,<br/><br/>Jinli is doing this because she wants the whole village to live a better life.”<br/><br/>Xiao Siqian,<br/><br/>After living in the village for so long. he knew more or less about Xiao Tinli’s special status in the village.<br/><br/>Whenever there was a problem in the village that was difficult to solve, they would turn to Xiao Jinli.<br/><br/>As long as Xiao Jinli took charge, even the most difficult issues would be solved easily.<br/><br/>Xiao Siqian seemed to have something to say, but after thinking about it, he decided to talk to Xiao Jinli privately.<br/><br/>Now, he doesn’t see her as an ordinary child.<br/><br/>Xiao Junxuan said, “Now the biggest issue is that if we let everyone in the village grow vegetables next year, we naturally will need a large number of earthworms. Sister, you have to solve the earthworm problem first. You had initially promised Uncle that you would cooperate with him to sell earthworms abroad.”<br/><br/>Xiao Jinli said, “Brother, actually the earthworm problem is easy to solve, as long as we expand breeding areas. The current Five Points of Land in the greenhouse simply does not meet the demand.”<br/><br/>Xiao Wanshan asked, “Little Bao, how much do you plan to expand?”<br/><br/>Xiao Jinli said, “I still need to plan and calculate, but roughly estimate, that will be at least five acres.’<br/><br/>“Then we need to build more greenhouses?” asked Xiao Wanshan.<br/><br/>Xiao Jinli nodded, “Yes, we need to!”<br/><br/>Xiao Wanshan thought about it and said, “I think the village will support this in establishing a cooperative. I think the main concern should be the market.<br/><br/>Several hundred acres of vegetables can’t be consumed by just a small town.”<br/><br/>“Dad, I think we don’t need to worry about that temporarily. When we get to the bridge, it will straighten itself. Maybe at that time, those merchants will come to us on their own? Think about it, with the quality and taste of our vegetables, wouldn’t any bosses come looking for us?” Xiao Jinli confidently said.<br/><br/>Xiao Junxuan said, “Dad, I think my sister has a point.”<br/><br/>Besides, they had opened such a big company, with some connections, they would certainly find a market for their products.<br/><br/>Xiao Wanshan nodded, “Okay, Little Bao, whatever you want to do, Dad will support you!”<br/><br/>Xiao’s mother laughed and said, “No, our whole family supports you, Little<br/><br/>Bao! Keep it up!”<br/><br/>Xiao Siqian, “…” Where does this unwavering support and confidence for their daughter come from?<br/><br/>The maternal grandmother intervened at this point, “If our good baby really wants to do this, then your grandparents will stay and help.”<br/><br/>Xiao Jinli smiled and said, “Okay, thank you, maternal grandmother and grandfather. ”<br/><br/>Gao Yanxin scratched his head and said, “Or I’ll stay and help too.”<br/><br/>Ji Yuzhu immediately said angrily, “What help can you provide? If you stay, you’ll just cause trouble. Do you know that? As your mother, how could I not know what kind of person you are?”<br/><br/>Gao Yanxin said dissatisfied, “Mom, you’re always putting me down. Why can’t I help?”<br/><br/>“Oh, help?” Ji Yuzhu coldly said, “Did you forget that you still have to go to school? You’re 18 years old. Do you think you don’t have to go to school once you’re 18? If you could learn from your cousin Junxuan, work hard to get your credits and certificates in advance, and then graduate early!”<br/><br/>Gao Yanxin instantly lost confidence and said, “I never liked studying in the first place, and I don’t have the ability to graduate early.”<br/><br/>“Well, at least you know that!” Ji Yuzhu nodded.<br/><br/>Gao Yanxin, ” …” His mother couldn’t go a day without attacking him. Everyone shared their opinions on the matter, then went back to their rooms to rest.<br/><br/>Xiao Siqian followed Xiao Jinli and said, “Little Sister Jinli, I think it’s better to establish a company rather than a cooperative.”<br/><br/>Xiao Jinli asked, “Brother Little Quan, what do you mean?”<br/><br/>Xiao Siqian said, “Establishing a cooperative can reduce the operational risk of farmers, avoid blind management, expand influence, and withstand the impact of market competition, while also enhancing the enthusiasm of villager’s wealth management and accelerating the industrial and scaled development of projects in the area.<br/><br/>However, there are significant drawbacks.<br/><br/>Cooperatives are voluntary, based on the principle of cooperation on the basis of interest. This can lead to a situation where partnerships are formed when profitable, but dissolved when unprofitable. Also, driven by self-interest, many farmers may bypass the unified cooperative model and operate independently. Finally, cooperatives have a simple organizational structure, and there is a lack of clear division of rights, responsibilities, and interests. There are no perfect interest distribution systems or loss degree systems, so the enthusiasm of cooperative members may be low, among other issues.”<br/><br/>After listening to Xiao Siqian’s analysis, Xiao Jinli stared at him with her beautiful eyes and then asked with a seemingly sarcastic tone, “What about establishing a company?”\t\t\t\t\t\t</div>", "images": {}, "success": true}