{"id": 109, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14254873.html", "title": "Chapter 109 - Chapter 109: Chapter 109: Argument (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 109 - Chapter 109: Chapter 109: Argument (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 109: Chapter 109: Argument (First Update)<br/><br/>Translator: 549690339<br/><br/>The news that the village might be establishing a cooperative or company soon was quickly known to everyone, including the young people who work outside the village.<br/><br/>Those who stayed in the village unanimously felt that it was more reliable to set up a company.<br/><br/>However, those who worked outside thought the idea was groundless.<br/><br/>They questioned the idea of using earthworms for farming vegetables. If everyone in the village was to farm vegetables on their land, which was at least five to six hundred mu in total, wouldn’t there be a significant loss if they were unable to sell the produce?<br/><br/>Moreover, their wages from working outside were stable, so they didn’t have to worry about things like incurring losses.<br/><br/>However, the idea for the cooperative or the company was proposed by Xiao Jinli.<br/><br/>The people of Xiao Family Village highly respect Xiao Jinli and seldom oppose her decisions.<br/><br/>Of course, the new daughters-in-law who had married into Xiao Family Village didn’t understand the prestige and influence Xiao Jinli had in the village, and found it absurd that such a major decision was proposed and decided by a child.<br/><br/>Thus, arguments broke out.<br/><br/>“Let me tell you, I disagree with this. If every household is to farm vegetables on their three to five mu of land, and then we are unable to sell the vegetables, who’s going to cover the loss? Xiao Jinli?”<br/><br/>“Xiao Jinli, Xiao Jinli, you folks speak highly of her all day long. I’ve been part of this family for years but have never seen Xiao Jinli, the so-called ‘Lucky Star’ you mention, share even a cent. Oh, and now just by her saying so, the entire village has to switch from rice farming to vegetable farming. If we do suffer losses, is she going to compensate us?”<br/><br/>“Xiao Jinli, she’s only ten, an age when other children are at school. What business does she have meddling in the affairs of the village? Oh, she just raises earthworms so now the entire village should switch to vegetable farming. She’s probably scheming to have the entire village buy her earthworms. Her family gets to sell their earthworms, but can you guarantee that all the vegetables grown will be sold?”<br/><br/>“In short, I do not agree with this.”<br/><br/>“I’m telling you not to underestimate Xiao Jinli. Over the years, she has helped resolve countless tricky issues. Take, for example, the incident with Xiao Chunhua, do you think she could have survived, let alone sought revenge on those people, without Jinli’s help?”<br/><br/>“I’m telling you, you can disrespect your parents, but you absolutely cannot defame Xiao Jinli. You have no idea how much effort Jinli has put in for our village.”<br/><br/>“Hmph, Xiao Jinli has been a smart girl since she was young, speaking at three months old and able to read a dictionary at six months old, plus she’s never made a wrong decision for the village. She is our village’s Luckv Star. and if she says vegetable farming is the way to wealth for our village, then it surely is.”<br/><br/>The daughters-in-law were infuriated by their husband’s and mother-in-law’s blind trust in Xiao Jinli.<br/><br/>They angrily pointed fingers at their husbands or in-laws and said, “You listen to me, if you want to farm vegetables next year, then I… I will divorce you. I also want to take the children, I do not want them to fall into debt before they have a chance to enjoy a good life.”<br/><br/>“Hmph, we get a divorce, you and your family can go follow Xiao Jinli.”<br/><br/>Such arguments were constantly unfolding.<br/><br/>The Village Chief, filled with sighs, reached out to Xiao Jinli and said, “Jinli, what do we do about this? We old chaps trust you, but those young folks, especially the new daughters-in-law who just joined us a few years back, have no faith in us. They quarrel non-stop at home, even threatening to divorce and take the children with them.”<br/><br/>Upon hearing this, Xiao Jinli stayed silent for a moment.<br/><br/>She hadn’t expected such a strong reaction from those working outside the village.<br/><br/>Since the idea was for the whole village to get rich, naturally she didn’t want any household to be left behind.<br/><br/>Therefore, she certainly couldn’t let them divorce and take their children away because of farming vegetables.<br/><br/>Xiao Jinli said, “Uncle Village Chief, let me think about this first.’<br/><br/>The Village Chief nodded and said, “Alright, Jinli, we are counting on you for this matter.”<br/><br/>Jinli smiled and said, “Uncle Village Chief, it’s my duty. I should thank the villagers for their trust in me.”<br/><br/>The Village Chief laughed heartily and said, “Haha, I think we’re all going to eat well by following you.”<br/><br/>Xiao Jinli, “…” It felt like the burden was getting heavier and heavier.<br/><br/>After several days of field research and constant finding of information, Xiao Siqian wrote out two plans.<br/><br/>Xiao Jinli shared with Xiao Siqian the Village Chief’s concern.<br/><br/>She, clutching both of her cheeks, said somewhat distressedly, “Little Brother Xiao Quan, what can we do about this? We can’t let a family break up just because we’re asking everyone to farm some vegetables, right?”<br/><br/>Xiao Siqian chuckled, “For now, let’s allow those who are willing join first. As for those who are unwilling, let’s just let the first batch earn some money first.<br/><br/>If they manage to make money, who would be opposed?”<br/><br/>Xiao Jinli said, “I’ve thought about that too. But if those who join later get in with their original shares, wouldn’t that be unfair to the initial members?”<br/><br/>Xiao Siqian said, “Then let’s evaluate the shares based on their value at that time. The original intention was to invest twenty thousand in capital at the beginning, but six months later, the company is making money and the value of the shares would naturally rise. They would need forty thousand by then to calculate the shares. If anyone is unsatisfied, they can only blame their own bad decisions.”<br/><br/>Xiao Jinli thought for a moment and said, “For now, that seems to be the only way. If they regret later, then it would only be because they didn’t join from the start.”<br/><br/>“That’s right.” Xiao Siqian gently patted her soft hair and laughed, “Little Sister Jinli, remember you’re still a kid. Don’t shoulder all the responsibilities yourself, sometimes you should share some of them with others.”<br/><br/>Xiao Jinli was slightly taken aback, then nodded, “Yes, you’re right.’<br/><br/>Since crossing over to this world, she had spent over ten years in Xiao Family Village, constantly feeling the warmth of family and the trust from the villagers. That’s why she subconsciously carried the determination to make Xiao Family Village better and better.<br/><br/>But she didn’t realize that despite having an adult’s mind, she was still just a child in her tens.<br/><br/>Children don’t need to bear responsibilities they shouldn’t bear.<br/><br/>Afterward, the two had a detailed discussion on plans for both the cooperative and the company.<br/><br/>Xiao Jinli, holding the plans in her hand, said, “I’ll take these two plans to Uncle Village Chief first, let everyone discuss them in a meeting. I’ll also bring up the matter of those willing to join and those not willing to join. The opportunity is right before their eyes, whether they can seize it depends on their discussion results. Like you said, I’m just a child and I can’t possibly take everything upon myself.”<br/><br/>Xiao Siqian said, “That’s right. Little Sister Jinli, remember you can help villagers, but the entire village is not your responsibility, nor is it your task. You just need to do your best..”\t\t\t\t\t\t</div>", "images": {}, "success": true}