{"id": 101, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14235649.html", "title": "Chapter 101 - Chapter 101: Chapter 101: Sold To Foreign Countries (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 101 - Chapter 101: Chapter 101: Sold To Foreign Countries (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 101: Chapter 101: Sold to Foreign Countries (First Update)<br/><br/>After spending three or four days at Xiao Family, Gao Jianjun returned home.<br/><br/>He still had work to do, and the visit to his wife’s maiden family was only for a short break.<br/><br/>Due to the allure of the vegetables in Xiao Family, he really didn’t want to leave.<br/><br/>After returning home, with his wife and children gone, he couldn’t cook for himself and had to order from the cafeteria or takeaway.<br/><br/>However, after getting used to the exquisite delicacies of Xiao Family, going back to eating pig-like food was truly painful.<br/><br/>Before leaving, he approached Xiao Jinli.<br/><br/>“Jinli, have you ever thought about expanding this earthworm business?” Gao Jianjun asked tentatively.<br/><br/>Gao Jianjun observed the earthworms in the greenhouse for several days and found that they were slightly different from ordinary earthworms. In addition to being large, they were of superior quality.<br/><br/>You should know that earthworms contain a rich array of nutrients and are considered high-end ingredients in foreign countries.<br/><br/>Of course, only carefully cultivated earthworms could become high-end ingredients.<br/><br/>He was engaged in foreign trade business, with rich experience, keen judgment, and discerning abilities.<br/><br/>Upon hearing Gao Jianjun’s words, Xiao Jinli’s expression froze for a moment before she reacted and asked, “Uncle, what do you mean? What do you mean by expanding the business?”<br/><br/>In her heart, she thought, “It finally arrived.”<br/><br/>Gao Jianjun explained seriously, “I mean, besides selling them to the villagers for farming, we could also sell them abroad?”<br/><br/>“What? Sell them abroad?” Xiao Jinli asked with an incredulous expression,<br/><br/>“Can these earthworms really be sold abroad?”<br/><br/>“Yes!” Gao Jianjun nodded, “Your Uncle is in the foreign trade business, so I know what I’m talking about. However, if we want to do big business and sell them to foreign countries, the earthworms in your greenhouse are far from enough. We need to expand the breeding scale, but you are still a child and studying in school, so what about that?”<br/><br/>The key issue was that only Xiao Jinli knew the techniques of raising earthworms.<br/><br/>If possible, he hoped Xiao Jinli could teach it to someone else.<br/><br/>Of course, that person had to be someone trustworthy.<br/><br/>Therefore, this was the difficult part.<br/><br/>Xiao Jinli understood Gao Jianjun’s meaning. She lowered her eyes and seemed to be pondering.<br/><br/>After a while, she said seriously, “Uncle, I will think carefully about this matter.<br/><br/>How about this? You can take most of the earthworms from my greenhouse to test the waters first, how about that?”<br/><br/>“Great!” Gao Jianjun laughed, “It’s good to be cautious. You, at such a young age, are just as calculating as an adult.”<br/><br/>Xiao Jinli said, “I’m afraid it won’t sell well, so we must give it a try first. Since<br/><br/>Uncle has connections, he can take the lead.”<br/><br/>“Ha ha…” Gao Jianjun laughed, “You should trust your uncle’s judgment. The earthworms you’ve cultivated will definitely sell well. Alright, then I’ll take some back first to explore the market.”<br/><br/>“Okay, if there really is a market for it, expanding the breeding grounds shouldn’t be a problem,” Xiao Jinli promised.<br/><br/>Immediately, Gao Jianjun took twenty thousand earthworms with him!<br/><br/>When Gao Jianjun took the earthworms away, it scared Xiao’s mother and the others. However, when they heard he wanted to sell them to foreign countries, they found it even more unbelievable.<br/><br/>They had never thought that earthworms could end up on the tables of foreigners.<br/><br/>After Gao Jianjun left, Ji Yuzhu and Gao Yanxin continued to stay at the Xiao Family.<br/><br/>In previous summer vacations, they would usually stay for about a month, but this year, with the temptation of greenhouse vegetables, they didn’t want to leave at all.<br/><br/>Knowing that the vegetables in the greenhouse were all grown by Xiao Jinli, Ji Yuzhu also wanted to follow suit, learn some planting techniques and see if she could grow such vegetables in a plot of land behind the villa when they returned home.<br/><br/>However, she saw that Xiao Jinli’s planting techniques were the same as those of normal people, but why did the vegetables grown by Xiao Jinli taste so different?<br/><br/>“Haha, you mean the taste of these vegetables is because of these cultivated earthworms?” Ji Yuzhu asked somewhat blankly, “But what’s so special about these earthworms?”<br/><br/>Xiao’s mother shook her head and said, “I don’t know. In the past, I only knew that these earthworms would turn the soil, but no one ever used them to grow crops. However, the villagers who bought earthworms and put them in the fields grew vegetables that were almost as good as those in this greenhouse. Hmm, maybe the difference is due to the number of earthworms.”<br/><br/>After hearing this, Ji Yuzhu became doubtful.<br/><br/>Xiao’s mother said, “Why don’t you go to the village entrance to compare fields with and without earthworms? You can also pick some vegetables from other people’s homes and cook them.”<br/><br/>Ji Yuzhu’s eyes lit up, and she laughed, “Sister, that’s really a good idea. Haha, if it’s really because of these earthworms, I will definitely take some back when I return.”<br/><br/>“Haha, what would you take back for? You don’t have land over there,” Xiao’s mother asked with confusion.<br/><br/>“There is no land, but we can open up a piece,” Ji Yuzhu shrugged and said, “My villa has a garden in front and behind it. We can pull out the flowers and use the land to grow vegetables.”<br/><br/>Xiao’s mother said somewhat speechlessly, “Pulling out the flowers, that’s too much of a pity. They are not easy to grow.”<br/><br/>“Haha, who let them be just for show and not for eating? I want to eat these vegetables all the time,” Ji Yuzhu laughed, “So, I can only bear the pain and pull them out.”<br/><br/>After all, these vegetables are so delicious that even the most expensive green vegetables in the supermarket can’t compare in taste.<br/><br/>Moreover, these vegetables are not only delicious but also make the body feel good after eating them.<br/><br/>Before coming here, Gao Jianjun had some insomnia, but after these few days, he slept so well that it was hard to bear waking him up.<br/><br/>Therefore, even for her husband’s health, she wanted to follow Xiao Jinli and learn to grow vegetables properly.<br/><br/>If the source was really in these earthworms, she would definitely take more back with her.<br/><br/>Ji Yuzhu listened to Xiao’s mother’s words, went to the fields for a stroll, and found that if there were earthworms in the ground, the plants that grew would be sturdier and greener.<br/><br/>She also greeted several villagers and picked some vegetables to take back.<br/><br/>“Sister, this is spinach I picked from the Village Chief’s house, and this is Chinese cabbage from Xiao Changchun’s house. Tonight, we’ll cook them for dinner,” Ji Yuzhu said, pointing to the piles of vegetables in the vegetable basket.<br/><br/>“Mom, are you robbing?” Gao Yanxin asked doubtfully, looking at the basket of vegetables, “These are not greenhouse vegetables. Mom, where did you pick them from?”<br/><br/>“You’re talking nonsense,” Ji Yuzhu said irritably, “I picked these from other people’s fields after getting their permission.”<br/><br/>Gao Yanxin sneered, “Picking from other people’s fields, isn’t that robbery?” Ji Yuzhu, ‘              This son definitely can’t be kept.<br/><br/>At dinner, everyone ate a few vegetarian dishes and commented, “The taste of these vegetables is not bad either, just slightly worse than those in our greenhouse. But they are much better than the ones grown before.” “So, it’s really because of the earthworms?”<br/><br/>Xiao Jinli, who was eating dinner, curled her lips into a smile..\t\t\t\t\t\t</div>", "images": {}, "success": true}