{"id": 114, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14254897.html", "title": "Chapter 114 - Chapter 114: Chapter 114: Thinking About The Dogs (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 114 - Chapter 114: Chapter 114: Thinking About The Dogs (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 114: Chapter 114: Thinking About the Dogs (Second Update)<br/><br/>Translator: 549690339<br/><br/>Four vegetable thieves couldn’t have imagined their plan would go so wrong.<br/><br/>On their first attempt to steal vegetables from Xiao Family Village, they were discovered by the villagers due to the barking of two local dogs.<br/><br/>When they realized something was off and tried to flee on their motorcycles, they discovered that more than ten dogs had surrounded their motorcycles.<br/><br/>The pack of dogs barked furiously at them.<br/><br/>“Damn, when did so many dogs get here? How did we not notice them?”<br/><br/>“These dogs are strange. How did they manage to be so quiet?”<br/><br/>“Big brother, what should we do now? With so many dogs, we can’t scare them away, and we might get surrounded.”<br/><br/>“Let’s just rush over, mount our motorcycles, and ride away. Once we’re on our motorcycles, the dogs won’t be able to do anything to us. On the contrary, maybe we can even take a few of them with us as we leave.”<br/><br/>“But big brother, these dogs look vicious and they will bite. How can we get to our motorcycles with them guarding it?”<br/><br/>“How? Don’t you have a stick in your hand? Just hit them with it. I don’t believe they won’t move out of the way in fear when they see the stick coming down!”<br/><br/>As soon as the big brother finished speaking, the younger brother swung the wooden stick at the dogs.<br/><br/>However, what they didn’t expect was that these dogs were smart. When they saw the stick coming, they wouldn’t run away but instead moved around the motorcycles in a way that still kept these men from getting close.<br/><br/>“Strange, these dogs seem like they’ve been trained. We can’t hit them with the stick, and they won’t leave.”<br/><br/>“The people are getting closer. If we don’t run away now… we’ll be caught.”<br/><br/>But abandoning their valuable motorcycles was out of the question.<br/><br/>“Big brother, what do we do?”<br/><br/>The leading big brother gritted his teeth, looked at the dogs, and said, “What else can we do? We just have to rush forward and ride away on the motorcycle. Do we just leave it behind otherwise?” That would be like losing a watermelon while picking up sesame seeds, a massive loss.<br/><br/>“If we get bitten by a dog, we’ll just get a few vaccine shots.”<br/><br/>So, they decided to risk being bitten by the dogs and ride away on their motorcycles.<br/><br/>Unfortunately, the villagers of Xiao Family Village arrived quickly and surrounded them before they could flee.<br/><br/>“What are you doing? Who are you?”<br/><br/>Xiao Chunfu shined a flashlight on the four men.<br/><br/>Li San Gou, the leader of the four, smiled and said, “Uncle, we’re just tourists who happened to ride our motorcycles here.”<br/><br/>Catch the thieves with the stolen goods!<br/><br/>Anyway, they hadn’t stolen anything, and these people couldn’t do anything to them.<br/><br/>“It’s so dark out, what could you be doing here for fun?”<br/><br/>“Uncle, the four of us just like riding our motorcycles around. We haven’t done anything wrong. Why are all of you surrounding us?” Li San Gou was very good at arguing.<br/><br/>Xiao Chunfu and the others, “…”<br/><br/>It seemed that these four hadn’t stolen any vegetables yet, so they had a strong argument.<br/><br/>Just then, the two guard dogs barked twice, and one of them came out with a snake skin bag in its mouth, placing it in front of the villagers.<br/><br/>The meaning was very clear— the snake skin bag belonged to these four men, and they were here to steal vegetables.<br/><br/>Xiao Chunfu directly asked, “Are you four here to steal vegetables?”<br/><br/>Li San Gou’s expression changed slightly before he smiled and said, “Uncle, don’t joke around. Like I said, we just rode our motorcycles here for fun. How did that turn into us stealing vegetables in your eyes? Uncle, being accused of stealing is not a light matter. Catch the adulterers in pairs, catch the thieves with the stolen goods. If you say we’re here to steal vegetables, where’s the evidence? Without evidence, I can actually turn around and accuse you of slander.”<br/><br/>Xiao Chunfu and the others’ faces changed.<br/><br/>These men were really brazen.<br/><br/>These four must have been here to steal vegetables, but since they hadn’t started stealing yet and were discovered by the dogs, it brought them good fortune.<br/><br/>Xiao Chunfu consulted with the other villagers and then said, “Young men, be more careful when riding your motorcycles. Don’t ride recklessly and hit someone. Alright, there’s nothing else. You can leave now.”<br/><br/>After hearing this, Li San Gou showed a smug expression to the villagers and then left on their motorcycles.<br/><br/>As they watched the men leave easily, Xiao Xianming was annoyed and said, “Are we just letting them go like that?”<br/><br/>Xiao Chunfu said, “What else can we do? We only found the two empty snake skin bags and didn’t catch them stealing vegetables. We’re not government officials who can detain them indefinitely.”<br/><br/>Someone said with a chuckle, “It seems the dogs alerted us too early. We should have let them take some vegetables from the field, then we could’ve caught them red-handed.”<br/><br/>“Let it go. Our dogs guard the village entrance to prevent people from stealing. These guys didn’t succeed this time. Maybe they won’t dare to come back later.”<br/><br/>As they walked, everyone talked, “I never thought that the vegetables of our village would one day be targeted by thieves.”<br/><br/>“You can say that again. My relatives in the open market town told me that the vegetables from our village are famous and many people can’t even buy them. My relatives asked me if I had any vegetables to sell to them. So, I sent some over as a favor.”<br/><br/>“I heard that some people who bought vegetables from our village sold them for high prices in town. Small cabbages usually sell by the bundle, but now they sell for eight yuan per jin. The price is even comparable to pork.”<br/><br/>“They’re selling for so much? I didn’t even know.”<br/><br/>“It’s amazing to think that they’re selling so high, but there’s still a shortage.<br/><br/>No wonder our village has attracted thieves.”<br/><br/>“Wife’s been nagging me every day to plant more vegetables.”<br/><br/>“Ha, my wife’s the same. They must be addicted to selling vegetables. But then again, even if we plant more now, it won’t be ready for a while.”<br/><br/>A few days ago, the village head said that our village plans to get rich by growing vegetables. Next year, he wants to establish a company. At first, I thought it was impossible. But looking at the vegetables in our fields now, it’s likely to happen.”<br/><br/>“I heard from Wangshan that when everybody in our village starts growing vegetables, they won’t just be sold in the market town, county town, but even in Jianggan City.”<br/><br/>“If that’s the case, next year my family will use all our land to plant vegetables. Yes, leave a portion of the field to plant rice so we don’t have to buy in the future.”<br/><br/>“My family is planning the same thing.”<br/><br/>After Li San Gou and his men took their motorcycles and left, Lai Xiaosi said, “Big brother, there are so many dogs in this village. Why don’t we get some later? These dogs have a higher value than the vegetables.”<br/><br/>After hearing this, Li San Gou furrowed his brow, saying, “Hmm, let’s see..”\t\t\t\t\t\t</div>", "images": {}, "success": true}