{"id": 113, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14254892.html", "title": "Chapter 113 - Chapter 113: Chapter 113: Someone Really Comes To Steal Vegetables (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 113 - Chapter 113: Chapter 113: Someone Really Comes To Steal Vegetables (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 113: Chapter 113: Someone Really Comes to Steal Vegetables (First Update)<br/><br/>Translator: 549690339<br/><br/>Xiao Jinli listened to the strange stories the villagers were telling about stealing vegetables, and she couldn’t help but feel speechless.<br/><br/>Then, she said, “Okay, aunts, I’ll have the dogs guard the village entrance, and if they see any strangers coming to steal vegetables, they’ll catch them.”<br/><br/>Xiao Jinli had anticipated that the vegetables in the villagers’ fields would be popular when sold in the open market town.<br/><br/>She didn’t expect them to be so sought after that sellers wouldn’t want to sell, and buyers would rather come and steal them.<br/><br/>Chen Qiulan smiled and said, “Jinli, it’s not that we don’t want to sell our vegetables, but we only have enough for our families to eat. We need time to grow more. Nowadays, the vegetables in the fields have become the spiritual food for our children. If they can’t get them, they’ll make a fuss and refuse to eat. But, on the other hand, during this time, my two children have become more and more rosy and probably eat better because of it.”<br/><br/>“The same goes for my family. During this time, Goudan loves to eat, and he seems to have grown taller. Before, he was a picky eater and unwilling to eat. Now he eats well and sleeps soundly. So, for the sake of our children, no matter how expensive these vegetables are, I’m unwilling to sell them.”<br/><br/>“That’s right. No matter how expensive these things are, they cannot compare to the importance of our children’s health. Seeing our children getting healthier, I must prioritize them first. However, when the next batch comes, I want to plant more. Jinli, can you sell me more earthworms?”<br/><br/>Xiao Jinli nodded and said, “Of course. I don’t have tens of thousands of earthworms, but I can give a few hundred or a thousand to each family.”<br/><br/>“That’s great. I’ll go and check the fields later to see where’s the best place to put this batch of earthworms.”<br/><br/>“I also need to go back and check. Jinli, I’ll see how much land I have left, and buy some earthworms in a few days, can I?” Chen Qiulan asked.<br/><br/>“Of course,” Xiao Jinli nodded, “As long as the aunties in our village need them, our family’s earthworms can be provided to you at any time.” “Haha, Jinli, thank you so much. You really are a lucky star.” Everyone left happily.<br/><br/>After the aunts left, Xiao Jinli immediately blew a whistle.<br/><br/>After a while, the dogs wandering around the village gathered in front of Xiao Jinli’s house.<br/><br/>These dogs were just ordinary mutts.<br/><br/>However, perhaps because of Xiao Jinli’s cleanliness, these dogs also kept themselves very clean, with not a single stain visible on their fur.<br/><br/>“Woof woof…<br/><br/>As soon as they saw Xiao Jinli, the dogs started barking.<br/><br/>Hearing their overlapping barks, Xiao Jinli’s head started to ache. She immediately shouted, “Quiet! Line up!”<br/><br/>The dogs obediently lined up in two neat rows.<br/><br/>Xiao Jinli counted; there were 14 of them – quite a coincidence.<br/><br/>Xiao Jinli said, “Today, I have a task for you.”<br/><br/>“Woof woof…” What task?<br/><br/>“Our village’s crops might be stolen by outsiders. So we need you to guard the village entrance. If you see any strangers stealing vegetables, report it immediately, understand?”<br/><br/>“Woof woof… Is that the task?<br/><br/>Xiao Jinli said, “Although it’s only one task, it’s very important. You must not take it lightly. There are 14 of you. Schedule two dogs to be on duty every day, so that by the end of the week, everyone will have taken their turn. Don’t worry, after your shift, you can come to me for rewards.”<br/><br/>When they heard there would be rewards, the dogs became very excited.<br/><br/>“Alright, now I’ll assign your partners and the dates for your duty. Remember them.”<br/><br/>Xiao Jinli went down the line, assigning duties one by one.<br/><br/>“Alright!” Xiao Jinli clapped her hands, “Your assignment starts today. Follow the partners I assigned and obey my orders. Alright, meeting dismissed!”<br/><br/>Hearing the meeting was over, the dogs left one after another, reluctant to part.<br/><br/>From that day on, there were two dogs guarding the village entrance.<br/><br/>The villagers felt at ease seeing this scene.<br/><br/>Well, it turns out that after just a few days, someone really came to steal vegetables.<br/><br/>During these days, there were still many people coming from the town to buy vegetables, but without exception, none of them could buy any. This made some people unwilling to give up.<br/><br/>After all, if they couldn’t buy vegetables, the children at home would be upset, which would break the hearts of those who cared for them.<br/><br/>But what could they do if they couldn’t buy them?<br/><br/>What else could they do? If they couldn’t buy, they could only steal.<br/><br/>In the evening, the villagers returned home one after another.<br/><br/>As darkness fell, two motorcycles entered the village.<br/><br/>For the past few days, the dogs on duty had been diligently observing every stranger entering the village.<br/><br/>Now, when they saw these two unfamiliar motorcycles and four unfamiliar people, their eyes immediately filled with caution. However, they didn’t make a sound. They silently followed behind.<br/><br/>The people in front didn’t notice that they had two little tails behind them at all.<br/><br/>They parked their motorcycles in a relatively open area and took out two snake skin bags after they got off.<br/><br/>“Where should we pick?”<br/><br/>In the darkness, without a trace of moonlight, everything was blurred.<br/><br/>One of them took out a flashlight and swept it around, saying, “I heard that the vegetables in Xiao Family Village all taste the same. Let’s just find a nearby field, pick enough, and leave.”<br/><br/>“The vegetables in Xiao Family Village have gone up in price in the open market town, but they still won’t sell. I don’t know why they don’t want to sell such expensive and popular homegrown vegetables.”<br/><br/>“Hehe, it’s precisely because they don’t want to sell that we can get a better<br/><br/>deal. We four need to leave one person on the lookout while the other three hurry.”<br/><br/>After that, the four men arranged their tasks.<br/><br/>They found the closest field and had just started picking when the dogs’ barks scared them to jump.<br/><br/>“Woof woof…” Someone’s stealing vegetables!<br/><br/>“Woof woof…” Someone’s stealing vegetables!<br/><br/>“Why is there a dog here? Why didn’t we notice it earlier?”<br/><br/>“What should we do? Will these dogs attract others?”<br/><br/>“Don’t you have a stick in your hand? Drive them away. If you can’t, kill them. In any case, dog meat is also expensive. We can still make a profit from these two dogs.”<br/><br/>“Big brother is right. Alright, leave it to me.”<br/><br/>With that, the man took a stick and started chasing the dogs.<br/><br/>Little did he know, the moment the dogs started barking, the villagers of Xiao Family Village had been alerted.<br/><br/>Soon, the villagers arrived at that spot.<br/><br/>More than a dozen villagers holding flashlights swept the area and shouted, “Who’s there?”\t\t\t\t\t\t</div>", "images": {}, "success": true}