{"id": 115, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14254901.html", "title": "Chapter 115 - Chapter 115: Chapter 115: Dogs Pretending To Be Unconscious (Part 1)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 115 - Chapter 115: Chapter 115: Dogs Pretending To Be Unconscious (Part 1)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 115: Chapter 115: Dogs Pretending to be Unconscious (Part 1)<br/><br/>Translator: 549690339<br/><br/>After that, Xiao Family Village didn’t calm down much, and there were still people who continued to steal vegetables.<br/><br/>However, those who stole the vegetables didn’t even have the chance to pick them before the guarding dogs barked and called their companions to chase them away.<br/><br/>Of course, most of the people who tried to steal vegetables were those who couldn’t buy them in Xiao Family Village, so they had no choice but to risk it. They were really driven to desperation by their children at home.<br/><br/>Since the villagers of Xiao Family Village were able to drive away those who tried to steal vegetables, they just turned a blind eye to it.<br/><br/>However, the people of Xiao Family Village never expected that the dogs in their village would be targeted.<br/><br/>Li San Gou and his group came over again as soon as it got dark.<br/><br/>Lai Xiaosi said, “Big brother, I’ve found out that there are two dogs guarding the entrance of the village every day. Let’s catch those two first. Two dogs can be sold for two to three hundred, which is enough for us to spend for a while.”<br/><br/>Li San Gou frowned and said, “There should be quite a few dogs in the village, right?” That night there were at least a dozen dogs surrounding them.<br/><br/>Lai Xiaosi said, “There should be quite a few. It’s just strange that, apart from the two dogs at the entrance of the village, the other dogs rarely show themselves. They say they are guarding inside their homes and don’t come<br/><br/>out. ”<br/><br/>“Then how did they come out that night?” Wang Wu Liu asked, puzzled.<br/><br/>“How else could they come out?” Lai Xiaosi said, “When those two dogs guarding the village barked, all the dogs in the village must have come out.”<br/><br/>“So, big brother, should we catch the two first, or what?” Wang Wu Liu asked.<br/><br/>Li San Gou thought for a moment and said, “First, catch these two. After that, we’ll find a way to lure the other dogs out.”<br/><br/>“But if we catch the dogs at the entrance first, how can we lure the other dogs out?” Lai Xiaosi said, “Normally, only when the two dogs at the entrance bark will the other dogs come out. Besides, if we catch these two dogs first, I’m afraid we’ll lure the people of this village out before the other dogs.”<br/><br/>Li San Gou, a little annoyed, looked at Lai Xiaosi and said, “If this won’t work and that won’t work, what should we do first? A dozen dogs can be sold for two to three thousand.”<br/><br/>Lai Xiaosi said, “Big brother, don’t be angry first. These village dogs seem to be trained. I’ve heard that recently quite a few people have tried to steal these vegetables. These dogs are used to monitor strangers stealing vegetables.”<br/><br/>“So that’s how it is! Damn, no wonder those dogs suddenly appeared behind us that night, like ghosts. It seems these dogs really are trained,” Li San Gou cursed.<br/><br/>“Big brother, what should we do now?” Wang Wu Liu asked.<br/><br/>“What can we do? Just steal the two dogs at the entrance directly. Now we can steal one is better than none, and as for the other dogs, we’ll find a way later.” Li San Gou said, “Damn it, I don’t believe it, we can’t even steal dogs if we can’t steal vegetables?”<br/><br/>Hehe, the reality soon slapped them in the face.<br/><br/>From a distance, they threw the canned meat they bought over.<br/><br/>Of course, the canned meat was drugged.<br/><br/>As long as the dogs ate it, they would immediately fall down.<br/><br/>Li San Gou and the others watched the two dogs cautiously from a distance, and their hearts relaxed as they licked the meat.<br/><br/>“They ate it. Let’s go over in a while.”<br/><br/>“Alright!”<br/><br/>After waiting for about five minutes, they saw the two dogs fall to the ground.<br/><br/>“It’s time, let’s go and have a look.”<br/><br/>They immediately walked over cautiously. Seeing the two dogs down, Lai Xiaosi deliberately kicked them with his foot, then said, “They’ve really been drugged.’<br/><br/>As he spoke, he bent down and reached out to grab the dog’s paw. Just then, the seemingly drugged dog suddenly jumped up and fiercely bit his face.<br/><br/>“Ah…” Lai Xiaosi covered his bitten face.<br/><br/>The other dog also jumped up at the same time and bit Li San Gou’s hand. “Damn, these two dogs were actually pretending.”<br/><br/>After biting these two people, the two dogs suddenly lunged at the other two.<br/><br/>The two unbitten ones were startled at first, but quickly regained their composure and ran off, cursing as they went, “Damn, are these dogs crazy, or have they turned into spirits? They’re so good at pretending!”<br/><br/>The two dogs chased them while barking loudly.<br/><br/>Xiao Jinli was having dinner when she suddenly put down her bowls and chopsticks.<br/><br/>Xiao Mother asked in confusion, “Xiao Bao, what’s wrong? Don’t you like the meal?”<br/><br/>Xiao Jinli replied seriously, “No, someone is stealing dogs at the village entrance! ”<br/><br/>“What? At this time, someone is stealing dogs in our village?” Xiao Junxuan was very surprised, then also put down his bowls and chopsticks, saying, “No, I have to go and check it out!”<br/><br/>With that, he ran off.<br/><br/>Xiao Siqian followed, saying, “Brother Xuan, I’ll come with you.”<br/><br/>Xiao Jinli also followed, and Xiao Wanshan immediately put down his bowls and chopsticks and went after them.<br/><br/>A villager asked, “Why are you guys running so fast?” “Someone is stealing dogs at the village entrance!”<br/><br/>“What? Stealing dogs!”<br/><br/>Hearing that someone was stealing dogs, everyone stopped eating and rushed to the village entrance.<br/><br/>When they arrived, they saw a scene that left them dumbfounded.<br/><br/>More than a dozen dogs from the village were chasing the four dog thieves around frantically!<br/><br/>They shined their flashlights and someone said, “Aren’t these four guys somewhat familiar?”<br/><br/>Someone took a closer look and immediately shouted, “Oh, aren’t they the ones who stole vegetables a few days ago?”<br/><br/>“That’s right, it’s them. I didn’t expect that just a few days after they stole vegetables, they’d be targeting dogs.”<br/><br/>“I remember they had motorcycles. Hurry up and find their motorcycles, and seize them. This time we can’t let them get away.”<br/><br/>With the dogs chasing them and biting fiercely, the four thieves couldn’t even get on their motorcycles.<br/><br/>Perhaps the dogs knew that once the thieves got on their motorcycles, they would escape easily, so they continued to chase them, not letting them get on the motorcycles.<br/><br/>Li San Gou and the others felt increasingly anxious as the villagers approached. They had to leave as soon as possible, or they would be caught and have to eat free meals at the detention center for a few days.<br/><br/>But most importantly, they had been bitten by dogs and needed to get rabies vaccines.<br/><br/>“Let’s go, we have to get on the motorcycles.”<br/><br/>With tears in their eyes, Lai Xiaosi and the others said, “Big brother, I’ve already been bitten by dogs several times. These dogs won’t even let us get close to the motorcycles. They’re too cunning!”<br/><br/>Xiao Junxuan and a few other young people seized the opportunity to take the motorcycles while the dogs were chasing the thieves.<br/><br/>With the motorcycles under their control, the thieves would have to either give up their rides or stay behind.<br/><br/>Xiao Jinli blew a whistle, and the dogs immediately stopped chasing but still surrounded the thieves.<br/><br/>Xiao Chunfu walked up to them, sneered, and said, “It’s you four again! What, did you come to our village for another joyride?”\t\t\t\t\t\t</div>", "images": {}, "success": true}