{"id": 117, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14254909.html", "title": "Chapter 117 - Chapter 117: Chapter 117: Solving The Vegetable Theft Problem (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 117 - Chapter 117: Chapter 117: Solving The Vegetable Theft Problem (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 117: Chapter 117: Solving the Vegetable Theft Problem (First Update)<br/><br/>Translator: 549690339<br/><br/>After Li San Gou and others were arrested by the Yamen, the villagers began discussing.<br/><br/>“Damn, we thought about our vegetables being stolen, but we didn’t expect our dogs to be targeted too!”<br/><br/>“Luckily, these dogs are clever and didn’t eat the food given by strangers, otherwise they would’ve been stolen too.”<br/><br/>“Those four people are probably habitual thieves. They failed to steal vegetables last time and also failed to steal dogs this time. I don’t know if they will come back to steal again after they are released.”<br/><br/>“Hehe, if they come to steal again, it would be foolish. People say that you can’t be caught three times. They didn’t learn a deep lesson the first two times; next time they come to steal, will they be able to escape being caught?”<br/><br/>Village Head and the villagers spoke to Xiao Jinli, “Jinli, now our village is often visited by thieves, even our dogs are being targeted. We can’t carry on like this.”<br/><br/>The villagers said, “Mainly because our vegetables in the field are too attractive now. If we could sell them, we would prefer to sell them all, but the problem is the children in our families.”<br/><br/>“Those who steal vegetables are mainly for their children, right?”<br/><br/>“So, this problem needs to be solved. Now it’s stealing vegetables and dogs, but what if it attracts human traffickers to steal children? That would be troublesome.”<br/><br/>“I think the only solution now is to pull out all the vegetables in the fields.<br/><br/>Without these vegetables, the thieves would have nothing to steal.”<br/><br/>“The problem is, can you bear to pull out all the vegetables in the field? It doesn’t matter if we adults eat or not, but the children will make a fuss.”<br/><br/>Everyone was discussing these issues. Xiao Jinli frowned slightly and said to the villagers, “Let me go back and think about a solution.”<br/><br/>At this time, Xiao Junxuan furrowed his brows and said, “Actually, I do have an idea.”<br/><br/>Everyone immediately asked, “Little Xuan, what’s your idea? Let’s hear it.”<br/><br/>Xiao Junxuan said, “There are not many vegetables left in everyone’s field now. The vegetables left are mostly for the children, right? So, I think everyone should move the remaining vegetables to one place. When those who want to steal vegetables come, they won’t know where to steal.”<br/><br/>“That’s an idea. But where do we move the vegetables to? Everyone’s fields are already planted, so we can’t pull out the things in the field.” A villager said, “Moreover, everyone’s vegetables, when moved to one place, would occupy quite a large area.”<br/><br/>“Yeah, it’s hard to find a place now.”<br/><br/>Hearing the villagers’ discussions, Xiao Jinli’s frown deepened.<br/><br/>Xiao Wanshan said at this time, “We just need to concentrate the vegetables in the fields of several families, not all of them, planting in one place.”<br/><br/>When Xiao Wanshan said this, the villagers were slow to react.<br/><br/>Xiao Junxuan said, “What my dad means is that we can select a few fields that are close together, make rules and regulations, and then transfer other people’s vegetables. The vegetables in everyone’s field are not much now, after they are put together, isn’t that just one place?”<br/><br/>After hearing Xiao Junxuan’s explanation, someone immediately slapped his head and laughed, “Oh, that’s right. It can be like that. It doesn’t have to be one piece of land, it can be a few families’ lands close together. Haha, I was confused.”<br/><br/>“Haha, in this case, the problem isn’t that big. In order to avoid delay, those who have time tomorrow can go to the field to see which families’ vegetable plots are close together and have a larger area. After we finalize it, let’s transfer the vegetables as soon as possible.”<br/><br/>Everyone went back after discussing the matter for a while.<br/><br/>After all, many people hadn’t finished their dinner and followed out.<br/><br/>Xiao Jinli returned home and continued eating her unfinished meal.<br/><br/>“Good baby, what are you thinking?” Her maternal grandmother, who had been paying attention to her, asked, “You’ve been quiet since you came back.” Xiao Jinli shook her head and said, “Grandma, it’s nothing. I’m just thinking about how to prevent those who steal vegetables from time to time.”<br/><br/>At this point, she put down her bowl and laughed with some helplessness,<br/><br/>“Now stealing vegetables has become stealing dogs. It’s just the beginning. Before all the villagers start farming in our company, the trouble will only increase.”<br/><br/>Her grandmother was quite optimistic, laughing and saying, “At such a young age, don’t have too many thoughts. There must be a way when the car gets to the mountain and the boat gets to the pier. Take your time to solve the problem, there will always be a solution.”<br/><br/>At this point, her grandmother thought about it and continued, “Many people steal vegetables for the sake of their children’s good food, and everyone works so hard for their children.”<br/><br/>Xiao Jinli nodded her head.<br/><br/>At first, when she sold earthworms to the villagers to grow vegetables, she never thought that a handful of ordinary vegetables could cause so many problems.<br/><br/>She did consider the sales of these Lingquan water vegetables, but she didn’t expect that the biggest problem would occur with the children.<br/><br/>At night, after everyone went back to their rooms to rest, Xiao Siqian came over to knock on Xiao Jinli’s door.<br/><br/>Seeing Xiao Jinli’s worried face, he smiled and asked, “Are you still worried about tonight’s incident?”<br/><br/>Xiao Jinli nodded her head, “Yes.”<br/><br/>She looked at Xiao Siqian and asked, “Brother Little Quan, do you have any solutions?”<br/><br/>Xiao Siqian said, “Actually, I came to you for this matter.”<br/><br/>Xiao Jinli’s eyes suddenly lit up. She asked, “So, do you have a solution?” Xiao Siqian smiled and said, “What I’m suggesting is not really a solution.”<br/><br/>“Tell me then.”<br/><br/>“My idea is to open a vegetable shop in the Open Market Town.”<br/><br/>“Open a shop?” Xiao Jinli suddenly felt deflated, “We don’t have any vegetables.<br/><br/>What’s the use of opening a shop?”<br/><br/>“Just hear me out.” Xiao Siqian said, “The purpose of opening this store is to sell Xiaojia Vegetables on a limited basis, to address the urgent need. We can deliver some vegetables to the town from time to time. As for whether those people can buy them, it’s not our concern. Maybe they didn’t get them today, but they can get them tomorrow, right?”<br/><br/>After listening to Xiao Siqian’s explanation, Xiao Jinli frowned again and fell into deep thought.<br/><br/>After a while, she said, “Maybe what you said is a solution, we don’t need to send too many vegetables there, just a little bit from time to time. This tells them that there will be Xiaojia Vegetables for sale from time to time, so those people will not think about stealing.”<br/><br/>However, with this small supply, the vegetables in our family greenhouses can still solve some problems. Then, we can call on the aunts and uncles to gather some more vegetables, and when the new vegetables are ready, we can supply more. So altogether, the current problem is the stealing. With this arrangement, the stealing problem will also be solved.”<br/><br/>“Yes, you are right,” Xiao Siqian nodded, “Little Sister Jinli is really smart..”\t\t\t\t\t\t</div>", "images": {}, "success": true}