{"id": 111, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14254881.html", "title": "Chapter 111 - Chapter 111: Chapter 111: Someone Comes To The Door", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 111 - Chapter 111: Chapter 111: Someone Comes To The Door</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 111: Chapter 111: Someone Comes to the Door<br/><br/>(First Update)<br/><br/>Translator: 549690339<br/><br/>Lan Xiaoyu rode her motorcycle and arrived at Xiao Family Village.<br/><br/>As soon as she entered Xiao Family Village, she asked a villager, “Hello, Auntie, can I ask, is this Xiao Family Village?”<br/><br/>“Yes, this is Xiao Family Village,” the auntie replied. “Young lady, who are you looking for?”<br/><br/>“That’s great!” Lan Xiaoyu seemed very happy. “Auntie, how many people in your village sell vegetables? I’m here to buy some.”<br/><br/>Li Guixiang looked at her doubtfully and said, “No one in our village grows vegetables to sell. We all grow them for our own consumption, and only sell them at Xuzhen market when we have too much. Young lady, who are you really trying to buy vegetables from?”<br/><br/>“…” Lan Xiaoyu smiled and said, “I don’t know who to look for. I bought vegetables from several people a while ago. However, these days, no one has been selling them at the market.<br/><br/>My child doesn’t want to eat meals these recent days, so I thought I’d come here to buy some vegetables to take back. My child has been picky about food since they were little, and they don’t like to eat. It’s hard to find vegetables they like, so I came to look for them here.’<br/><br/>Hearing this, Li Guixiang’s expression changed slightly.<br/><br/>She said, “I see. Sigh, parents really worry about their children. In that case, young lady, I have some vegetables in my field too, let me take you to pick some.”<br/><br/>Lan Xiaoyu, “This…”<br/><br/>She didn’t know how to refuse the kind offer from the auntie.<br/><br/>But what if the vegetables from this auntie’s family can’t be compared to those of the others who sell them?<br/><br/>Perhaps understanding her doubts, Li Guixiang smiled and said, “Don’t worry. The taste of the vegetables in our village is all the same. I used to sell vegetables at the market every day, too, but mine were all sold out on the way, so you just didn’t see me.”<br/><br/>Hearing this, Lan Xiaoyu felt relieved and expressed her gratitude, “Thank you,<br/><br/>Auntie. ”<br/><br/>Then, Li Guixiang took her to her own field and pointed to the vegetables, saying, “Here are the vegetables, just go ahead and pick whatever you want.”<br/><br/>Lan Xiaoyu looked at the dozen or so different types of vegetables in the field, her eyes shining with excitement.<br/><br/>These vegetables are growing really well.<br/><br/>They’re moist, green, and tender.<br/><br/>“Auntie, your vegetables are growing so well, you’re really good at farming, ” Lan Xiaoyu sincerely praised.<br/><br/>Li Guixiang waved her hand and said, “Don’t praise me. Look at the vegetables in the fields around me, none of them are worse than mine.’<br/><br/>Lan Xiaoyu looked up and realized it was true.<br/><br/>“Auntie, is it because of the soil in your village that everyone can grow such good vegetables? And I’ve bought vegetables from several families, the taste is equally great,” Lan Xiaoyu asked.<br/><br/>Li Guixiang laughed and said, “It’s not that. The soil in our village is just ordinary. The vegetables we used to grow in Xiao Family Village didn’t have a special taste.”<br/><br/>Lan Xiaoyu asked curiously, “Then what’s the reason?”<br/><br/>“Hehe…” Li Guixiang laughed and said, “Now that we use a lot of earthworms to cultivate the soil, I heard that the nutrients inside the earthworms will come out while they turn the soil, which in turn nourishes the vegetables.” She didn’t really understand the actual principle, but she had heard it from Xiao Jinli.<br/><br/>“Ha, earthworms?” Lan Xiaoyu’s eyes were full of doubts as she looked at the field. Suddenly, her pupils widened in fear as she pointed at an emerging earthworm and shouted, “Auntie, there’s a snake here!”<br/><br/>She was scared of snakes, and her face turned pale.<br/><br/>Li Guixiang glanced at it and calmly said, “Don’t be afraid, young lady, this is just an earthworm!”<br/><br/>“Ha, an earthworm? Earthworms are this big?” Lan Xiaoyu found it hard to believe.<br/><br/>She was also a child who grew up in the countryside, and had seen, dug, and played with earthworms many times, but she had never seen such a large one.<br/><br/>Li Guixiang nodded and said, “Yes, these earthworms were specially bred by someone, so they are bigger. Let me tell you, our vegetables now rely on these earthworms. So to us, these earthworms are treasures.”<br/><br/>Lan Xiaoyu’s fear and uneasiness gradually subsided.<br/><br/>She asked again, “Auntie, where did you buy these earthworms?”<br/><br/>Generally speaking, this question might involve trade secrets or something like that.<br/><br/>In case Xiao Family Village’s road to wealth depends on growing vegetables, then these earthworms would obviously be the core and the village’s secret.<br/><br/>However, Li Guixiang didn’t have such awareness.<br/><br/>She said, “These earthworms were bred by Jinli from our village. We all buy them from her. However, these earthworms can only survive for three to five months, and after that, we have to buy the next batch. Young lady, just pick the vegetables you want. Now that we have these vegetables, we should feed our families with them. If the children don’t eat, it will be troublesome.<br/><br/>After listening, Lan Xiaoyu began to pick the vegetables.<br/><br/>Seeing so many different types of vegetables, she wanted to pick a little of each and take them home to eat for a few days.<br/><br/>Fortunately, she had a sense of proportion when picking vegetables.<br/><br/>She didn’t pick too much of each kind.<br/><br/>However, when all the vegetables were put together, they filled a big plastic bag.<br/><br/>Lan Xiaoyu asked, “Auntie, how much is it?”<br/><br/>Li Guixiang waved her hand and said, “Don’t worry about the money, these are for your child to eat.”<br/><br/>“That won’t do,” Lan Xiaoyu insisted. “I picked so many vegetables from you, how can I not pay? I know that the vegetables from Xiao Family Village are more expensive than others when you sell them at the market. I’ve seen it when I bought them regularly.”<br/><br/>As she spoke, she looked down at the vegetables in the plastic bag and made a rough calculation, saying, “How about I give you twenty yuan for this bag of vegetables?”<br/><br/>After she finished speaking, she took out twenty yuan and handed it to Li Guixiang.<br/><br/>Seeing that Lan Xiaoyu insisted on paying, Li Guixiang couldn’t refuse. She said, “Don’t give twenty, just give me ten yuan.”<br/><br/>“Ten is too little, how about fifteen? Auntie, please don’t argue with me. Picking vegetables from your field has really helped me a lot, and I’m truly grateful. If it’s too cheap, I won’t feel right about it,” Lan Xiaoyu said very earnestly.<br/><br/>Li Guixiang didn’t refuse and accepted the fifteen yuan.<br/><br/>After Lan Xiaoyu left, someone asked, “Guixiang, is she your relative?”<br/><br/>Li Guixiang shook her head and said, “No, she’s the person who’s been buying our Xiao Family Village vegetables for some time. I heard her child wouldn’t eat without our village’s vegetables. So she was in a hurry and came straight to our village. She happened to meet me, so I let her pick some vegetables in my field.<br/><br/>I wanted to let her pick for free, but she insisted on paying, so I took it.”<br/><br/>Hearing Li Guixiang’s explanation, someone laughed and said, “There are really people coming to the door. It seems like our Xiao Family Village’s vegetables are going to be famous in the market.”<br/><br/>“That’s true. Haha….”\t\t\t\t\t\t</div>", "images": {}, "success": true}