{"id": 119, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14254917.html", "title": "Chapter 119 - Chapter 119: Chapter 119: Buying The Entire House (Part One)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 119 - Chapter 119: Chapter 119: Buying The Entire House (Part One)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 119: Chapter 119: Buying the Entire House (Part One)<br/><br/>Translator: 549690339<br/><br/>Xiao Wanshan, through a friend’s introduction, took Xiao Jinli to see the store.<br/><br/>“Jinli, how do you like this store?” Xiao Wanshan looked around the store and asked.<br/><br/>It must be said that Xiao Wanshan’s connections were quite strong.<br/><br/>The store he found was in the center of the Open Market Town, in a four-story building with white tiles on the exterior. The living quarters were upstairs, and the store was downstairs, covering an area of about seventy or eighty square meters.<br/><br/>Xiao Jinli nodded, “Dad, this store is quite good. Are people really willing to sell such a prime location? Even the rent wouldn’t be cheap. Would they let it go?”<br/><br/>Xiao Wanshan nodded, “He bought a house in the county town, and plans to move his whole family there, so he wants to sell this house for convenience. The rent wouldn’t even amount to 1,000 yuan a year, so he plans to sell it to pay off the bank loan for the house in the county town.”<br/><br/>Xiao Jinli understood and nodded, “Then Dad, you should buy this house and find someone to renovate it. Dad, how much would this house sell for?”<br/><br/>Xiao Wanshan spoke without hesitation, “He says 120,000 yuan! Mainly because this house is in the town center, good for business, so it’s a bit more expensive.”<br/><br/>It was worth noting that similar houses next to it were priced at most 80,000-90,000 yuan, making this house about 30,000-40,000 yuan more expensive.<br/><br/>Xiao Jinli took another look at the house and store and nodded, “Being in the central area, it’s reasonable for it to be a bit more expensive.”<br/><br/>The most important thing was that the value of this house would definitely appreciate after a few years.<br/><br/>Seeing that Jinli agreed and liked the house, Xiao Wanshan contacted the middleman to get in touch with the seller right away.<br/><br/>“Wanshan, are you sure you want to buy this house?” Xiao Wanshan’s friend asked, “Do you still want to think it over?”<br/><br/>Xiao Wanshan shook his head, “No need, Ah Yong, please get in touch with your friend. The sooner, the better!”<br/><br/>Li Yong nodded, “Alright, I’ll call him right now.”<br/><br/>After Li Yong made the call, he told Xiao Wanshan, “He’s on his way right now. Let’s find a place to rest. Jinli, are you hungry? Do you want to go to a restaurant and have a few dishes?”<br/><br/>Xiao Jinli shook her head, “Uncle Li, I’m not hungry.”<br/><br/>The group found a restaurant to sit down, and about half an hour later, Li Yong’s friend arrived.<br/><br/>“Ah Yong, I’ve brought everything.” Li Yong’s friend, Li Jiang, said, “It’s just this money… ‘<br/><br/>Li Yong laughed, “Da Jiang, don’t worry. The money is absolutely guaranteed.”<br/><br/>Xiao Wanshan nodded, “I don’t know if you want cash or a transfer? If you want cash, over one hundred thousand needs to be reserved three days in advance.”<br/><br/>Li Jiang said, “Just transfer it directly.”<br/><br/>In this day and age, very few people use cash.<br/><br/>Xiao Wanshan nodded, “No problem, I brought my card.”<br/><br/>Li Yong laughed, “Haha, that’s great. Let’s have a meal, and after the meal, we’ll transfer ownership.”<br/><br/>Xiao Wanshan, of course, had no objections, and Li Jiang had no objections either. He was in urgent need of cash to pay the full price for the house in the county town.<br/><br/>In less than half a day, Xiao Wanshan bought the entire building, with the owner being Xiao Wanshan.<br/><br/>Xiao Wanshan initially wanted to put Xiao Jinli’s name on it, but Jinli was still young, which was a bit inconvenient.<br/><br/>Xiao Wanshan saw Jinli touching the little notebook with a crescent moon in her smile and laughed, “Jinli, you’re so happy, aren’t you?”<br/><br/>Xiao Jinli nodded, “Of course, I’m happy. Dad, find someone to renovate the store as soon as possible. Hmm, let’s renovate the upstairs as well, add some furniture, so we can occasionally rest in town.”<br/><br/>“Okay, we’ll do as you wish, you little smart aleck,” said Xiao Wanshan. “Don’t worry about the store. We can bring vegetables and fruits from home anytime to sell. Speaking of which, should we make a sign for the store? After all, it’s a store, and it would be easier for people to find it if there’s a sign.”<br/><br/>“That’s a good idea. Let’s make a sign,” Xiao Jinli nodded. “Just call it ‘Xiaojia Vegetables’. ”<br/><br/>“Xiaojia Vegetables?” Xiao Wanshan laughed. “Why does that sound like a restaurant sign? Let’s think of another name. Jinli, think it over.”<br/><br/>Xiao Jinli thought for a moment and said, “Xiao Family Village Fresh Green Vegetables! Hmm, let’s use this name for this little store for now. We’ll pick another one once the company is established.”<br/><br/>Xiao Wanshan nodded, “Alright, I’ll have someone make a sign like that.”<br/><br/>After returning home, Xiao Wanshan contacted a friend and had the store simply renovated.<br/><br/>Xiao’s mother was not surprised that Xiao Wanshan had spent over a hundred thousand yuan to buy a house.<br/><br/>“Where is it located?” Xiao’s mother asked curiously.<br/><br/>“Mom, it’s right next to the place selling dumpling wrappers, in the town center,” Xiao Jinli pointed out. “The house looks quite new. Dad, how many years has that house been built?”<br/><br/>Xiao Wanshan said, “I heard it’s only been five or six years. Li Jiang’s family didn’t live there for too long and had been renting it out for business. Now that they have a house in the county town and urgently need money, they plan to sell this place to raise the funds.”<br/><br/>Xiao’s mother nodded, “Hmm, it’s good to have bought the house. Jinli needs to open a store, so having this store can be operated at any time.”<br/><br/>Xiao’s mother spoke as if buying the store in town was just for Jinli to play with.<br/><br/>Xiao Siqian had already witnessed how much his uncle and aunt doted on their daughter.<br/><br/>Fortunately, he knew the Xiao family had established a company, and they were not short of money, so it was okay to spoil their only daughter a bit.<br/><br/>Xiao Jinli said, “Right, after Dad fixes up the store and puts up the sign, we’ll transport some vegetables over.”<br/><br/>Xiao’s mother suddenly thought of a problem and asked, “Jinli, who’s going to watch the store when the vegetables arrive?”<br/><br/>“…” Xiao Jinli said, “We probably don’t need anyone, do we?”<br/><br/>“No, we still need someone,” Xiao’s mother laughed. “Why don’t we ask someone who’s familiar with selling vegetables to do it? How about asking your Aunt Chen? She’s sold vegetables in the market several times and is a familiar face. As long as she’s standing there, everyone should know it’s our Xiao Family’s vegetables.”<br/><br/>Xiao Jinli said, “Sure, let’s go talk to Aunt Chen at the village chief’s house.”<br/><br/>“I’ll go,” Xiao’s mother laughed. “You finish your meal and go upstairs to do your homework.”<br/><br/>Xiao Jinli,     ‘ It suddenly dawned on her that she had started school, and had homework to do.<br/><br/>Although these assignments were not difficult, she still had to do them.<br/><br/>Xiao’s mother went to the village chief’s house and told Chen Qiulan about the store.<br/><br/>“Opening a store?” Chen Qiulan was somewhat surprised when she heard that Xiao Jinli wanted to open a store.<br/><br/>Xiao’s mother said, “Yes, this store will specialize in selling our Xiao family’s vegetables and fruits. The store will be operating now, and we will be sending vegetables to the store from time to time. By the time everyone’s second batch of vegetables can be harvested in one or two months, there will be few people stealing vegetables from the village.”<br/><br/>Chen Qiulan laughed, “Alright.. Just let me know when the vegetables are shipped to the store!”\t\t\t\t\t\t</div>", "images": {}, "success": true}