{"id": 112, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14254885.html", "title": "Chapter 112 - Chapter 112: Chapter 112: The Insatiable Old Lady (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 112 - Chapter 112: Chapter 112: The Insatiable Old Lady (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 112: Chapter 112: The Insatiable Old Lady (Second Update)<br/><br/>Translator: 549690339<br/><br/>Li Guixiang and the other villagers thought that Lan Xiaoyu would be the only one coming in person to buy vegetables.<br/><br/>But to their surprise, more people started knocking on their doors, asking to buy vegetables from the Xiao Family.<br/><br/>This left the villagers in Xiao Family Village completely bewildered.<br/><br/>The vegetables left in their fields were barely enough for their own consumption, let alone having surplus to sell.<br/><br/>They could sell a few vegetables to a few people once or twice, but not to this many people.<br/><br/>“Sister, I am really desperate. My children refuse to eat meals without Xiao Family’s vegetables. They even throw tantrums and roll on the ground. I barely got them to promise that I would bring some vegetables home today,” said a woman in her sixties or seventies. “Since I’ve come all the way here, please sell me some.”<br/><br/>Chen Qiulan was also a bit troubled.<br/><br/>This wasn’t the first time someone had come to her door to buy vegetables.<br/><br/>And this old woman was not here for the first time either.<br/><br/>She had come a few days ago, and Chen Qiulan, seeing the woman’s concern for her children, let her pick some vegetables from the field.<br/><br/>But who would have thought that she would come again and repeat the same story?<br/><br/>With all the vegetables being picked these days, there wasn’t much left in the field.<br/><br/>She needed to save some for her own children as well.<br/><br/>Before the next crop could be harvested, she couldn’t risk running out of vegetables for her children.<br/><br/>Chen Qiulan frowned slightly and said reluctantly, “Elder sister, I don’t mind selling the vegetables to you, but I hardly have any left in my field. I need to save some for my children.”<br/><br/>However, the old lady became upset. She argued, “Sister, you’ve grown so many vegetables; giving me a few more isn’t a big deal. If I pick some, my child will cry and make a fuss if there are no Xiao Family’s vegetables at mealtime. I… I have no other choice, sister.”<br/><br/>As she spoke, her eyes reddened.<br/><br/>Chen Qiulan,<br/><br/>What else could she do? Under the old woman’s persistent pleading,<br/><br/>soft-hearted Chen Qiulan had no choice but to let her pick some vegetables to take home.<br/><br/>But the old woman was ruthless.<br/><br/>Perhaps she knew that once she picked this time, she might not be allowed to pick them again, so she picked a huge amount, making Chen Qiulan’s face turn red with anger.<br/><br/>“Elder sister, you can’t pick like this. If you keep picking, there will be nothing left in my field in a few days!” Chen Qiulan immediately tried to stop her.<br/><br/>But the old lady still wasn’t satisfied. She said, “Sister, since you let me pick, I will pick more to save myself the trouble of coming again in a few days.” Chen Qiulan, She’s really infuriating.<br/><br/>In the end, the old woman picked two large plastic bags full of vegetables.<br/><br/>So many vegetables would last a family of six or seven people for five to six days.<br/><br/>Chen Qiulan was furious too and said directly, “Elder sister, our vegetables are not cheap. For these two large bags of vegetables, I won’t charge you extra. Just give me 100 yuan.”<br/><br/>When the old lady heard this, she widened her eyes and said angrily, “100 yuan? Are you robbing me? These vegetables in the Open Market Town would cost at most twenty yuan.”<br/><br/>Chen Qiulan laughed instead of getting angry and said, “It’s fine if you don’t want to pay. Just return the vegetables to me. And then you can go to the Open Market Town to buy those two bags of vegetables for twenty yuan.”<br/><br/>Hearing Chen Qiulan’s words, the old lady was afraid the vegetables in her hands would be snatched away. She immediately grabbed the two bags of vegetables and disappeared in a flash, her mouth still muttering, “You are taking advantage of the situation. No way, 100 yuan is too much. Lower the price.”<br/><br/>“I won’t go any lower. 100 yuan is 100 yuan, not a cent less,” Chen Qiulan firmly refused to compromise.<br/><br/>If she didn’t charge more this time, the old lady would still act like this the next time, now that she had tasted the sweetness.<br/><br/>“Elder sister, either you pay or give the vegetables back to me,” Chen Qiulan said bluntly.<br/><br/>Having no choice, the old lady grudgingly handed over the money, muttering, “Such a black heart, a robber!” before she left.<br/><br/>“Tsk tsk, this old lady is really ruthless. Look, she has picked your vegetables bare in the field, leaving them in a mess,” a villager said as they looked at the vegetables in the field.<br/><br/>“Look at what she picked, only the tenderest parts, leaving the old leaves, all crooked and askew. Qiulan, taking 100 yuan from her is not even worth it for these vegetables, ” another villager said.<br/><br/>Chen Qiulan looked at the vegetables in the field and felt heartbroken. “Seeing her make herself out to be so pitiful and considering her love for her grandson,<br/><br/>I let her pick some vegetables to take home. But who would have thought she would be so greedy and even trample on the vegetables in the field? I regretted letting her into the field to pick vegetables. Charging her extra is the least I could do to make up for the damage she’s done to my vegetables.”<br/><br/>“Now that she has picked so many, I don’t know if she will come to pick more next time.”<br/><br/>“It’s hard to say. If her child really makes a fuss, she might still come.”<br/><br/>“Now that you mention it, it’s highly possible. Next time she comes, let’s just ignore her and avoid making trouble for ourselves. We don’t want her to wreak havoc on the vegetables in our fields.”<br/><br/>“Our vegetables have become real treasures now. We can hardly bring ourselves to eat them, as we save most of them for the children.’<br/><br/>“Sigh, more and more people are coming from the Open Market Town lately, all because of our vegetables. What are we going to do?”<br/><br/>“Yes, they don’t want to leave empty-handed when they come. But we don’t have much excess in our fields.<br/><br/>“After this old lady’s behavior, if more people come in the future, I won’t dare to bring them directly to the field. I’ll just send them away.”<br/><br/>“I have the same idea. But what if those people, having failed to buy any, secretly steal vegetables when we’re not paying attention? All of us in the village have planted vegetables; they could steal from any house without us even knowing it.”<br/><br/>“You have a point. Should we discuss whether to get one or two dogs to guard the village entrance?”<br/><br/>“I think it’s necessary.”<br/><br/>“If we really want dogs to guard, then we can only rely on Jinli.”<br/><br/>Because only Xiao Jinli could make the dogs in the village obey, even their masters couldn’t manage it..\t\t\t\t\t\t</div>", "images": {}, "success": true}