{"id": 116, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14254905.html", "title": "Chapter 116 - Chapter 116: Chapter 116: Fail To Steal The Dog And Get Bitten By The Dog (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 116 - Chapter 116: Chapter 116: Fail To Steal The Dog And Get Bitten By The Dog (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 116: Chapter 116: Fail to Steal the Dog and Get Bitten by the Dog (Second Update)<br/><br/>Translator: 549690339<br/><br/>“Is our place here so good for a stroll? Every night, you have to come, and have our village dogs chase you?” Xiao Chunfu said coldly while looking at them.<br/><br/>Li San Gou had already been holding in his anger as these dogs had been chasing and biting him.<br/><br/>He shouted loudly, “What, which law says we can’t stroll here?”<br/><br/>He even said it with such righteousness.<br/><br/>“The dogs here are all mad dogs, biting everyone they see. You injured us, so you should pay us. Otherwise, I’ll sue you for intentionally harming us with your animals.”<br/><br/>“Haha, it seems you have some knowledge of basic legal principles,” said the Village Head. “Since you know the law, why did you come to steal dogs?”<br/><br/>“Steal dogs?” Li San Gou pretended to repeat his old tricks, “Which eye of yours saw us stealing dogs? Do you have any evidence? Don’t talk nonsense without evidence!”<br/><br/>“And, all four of us brothers were bitten by this pack of beasts, you must compensate us. We four need to get rabies vaccines and see a doctor, so first compensate us for our medical expenses, and also, we were injured and can’t work, so you must compensate us for our lost wages. Also, our mental state has been severely traumatized, so mental damage compensation must also be provided. We won’t ask much from the four of us brothers, just compensate each of us two thousand yuan, and we’ll be generous enough to let this matter go.” Li San Gou said righteously, “Hmph, it’s our bad luck to take a stroll and be bitten by a pack of mad dogs.”<br/><br/>Xiao Village Villagers,        ‘ They can really twist black and white.<br/><br/>“Just because you let it go doesn’t mean we will!” The Village Head was furious to hear Li San Gou’s words, “You want two thousand yuan per person, you must be dreaming. You come to our village to steal dogs, and you still think it’s right? You even want to hit back? You really think Xiao Family Village is easily bullied?”<br/><br/>“Where’s the evidence?” Li San Gou asked for evidence again, “Without evidence, don’t talk nonsense and slander me. I can sue you for defamation. But we were bitten by this pack of mad dogs, which is a real fact.”<br/><br/>“Evidence? It’s simple to get evidence!” Xiao Siqian stood up at this time. He pointed to the can of food on the ground and sneered, “This canned food is your doing, right! The purpose was to lure the dogs into a trap so you could catch them.”<br/><br/>When the villagers heard about canned meat, someone subconsciously went to pick it up.<br/><br/>Xiao Siqian immediately stopped him, “Uncle, don’t pick it up!”<br/><br/>“You say this canned food is ours, and it’s ours.” Li San Gou said with some guilty conscience, “What evidence do you have?”<br/><br/>“It’s simple to get evidence!” Xiao Siqian sneered, “Since this can is yours, there must be your fingerprints on it. So, as long as we take this can and do a fingerprint comparison, we will know if it’s yours.”<br/><br/>Li San Gou’s pupils couldn’t help but contract violently.<br/><br/>Suddenly, Li San Gou’s eyes rolled, and he said with full momentum, “Hmph, so what if they verify that there are our fingerprints on the can? Is there anything wrong with throwing away a can I don’t want?”<br/><br/>“Hmph, it seems you really won’t shed tears until you see the coffin,” Xiao Siqian said coldly, “There’s nothing wrong with you throwing the can. But your mistake is putting something extra in the can. You dog thieves, in order not to make too much noise, must first drug the dogs, and only then can you steal them smoothly. Dogs are very alert animals; otherwise, how could you steal them? Village head, I think we should call the police right away.”<br/><br/>When Li San Gou and the others heard that they were going to call the police, their faces changed instantly.<br/><br/>They didn’t steal the dogs, but the key evidence they left during the theft can certainly prove that they are dog thieves.<br/><br/>“Please, don’t call the police!” Li San Gou tried to stop them, “We were wrong, please let us go! Next time, we won’t dare do it again.”<br/><br/>“Hmph, it’s too late,” the Village Head said angrily, “We let you go last time when we had no conclusive evidence of you stealing vegetables. But we didn’t expect you four to be so relentless that you targeted our dogs this time. This time, we must call the police and teach you a lesson.”<br/><br/>Upon hearing this, Lai Xiaosi said bitterly, “But we’ve already learned our lesson. Look at our faces, hands, wherever we weren’t bitten. We were bitten and have to go back to get rabies vaccines. Please let us go this time and have mercy on our pitiful selves. We were wrong, and we won’t dare to do it again.” Wuu wuu… it’s so embarrassing.<br/><br/>This Xiao Family Village is so wicked. They came to steal twice, and both times they were chased by dogs. It’s really bad luck.<br/><br/>“Impossible!” The Village Head said decisively, “We let you go once last time, there’s no reason to let you go a second time. This time, when the police officers come, you can reflect on what you’ve done at the police station. How can you four, young and strong men, not do something better and instead get involved in petty theft? Don’t you feel embarrassed for your family?”<br/><br/>Li San Gou and the others turned red with embarrassment.<br/><br/>Soon, the police officers of the Yamen arrived, and they were familiar faces from the Xiao Family Village.<br/><br/>“What’s going on?” Officer Li looked around and asked, “Are they dog thieves?”<br/><br/>The villagers of Xiao Family Village were really civilized, and they didn’t use violence against the dog thieves, not even beating them half to death.<br/><br/>You should know that the previous dog thieves they caught had been badly beaten by the entire village during the theft.<br/><br/>“Yes, these four!” The Village Head laughed and said, “Officer Li, you’re on duty again today.”<br/><br/>Officer Li nodded, “Yeah, a colleague had something to do, so I took the shift. Do you have any evidence that these four stole dogs?”<br/><br/>They value evidence in the police station.<br/><br/>“This is evidence!” The Village Head pointed to the can on the ground and said, “This canned food is for the dogs to eat, but the dogs didn’t eat it. I bet there’s something extra in it.”<br/><br/>Officer Li understood immediately and put on gloves to put the evidence in a transparent sealed bag.<br/><br/>He looked around at the dogs and asked, “Did your village raise so many dogs?”<br/><br/>“Yes, these are all dogs in the village.” The Village Head laughed and said,<br/><br/>“These dogs are usually obedient and don’t eat things from outsiders. So, these dog thieves failed in their attempts to steal the dogs.”<br/><br/>Li San Gou and the others may have given up, but he still pointed to the dogs and complained, “Officer, we have been bitten by these dogs and have many wounds. We want compensation.”<br/><br/>“Shut up!” Officer Li said with a dark face, “You tried to steal dogs and ended up being bitten by them, and now you think it’s justified? I’m telling you, this is all self-inflicted, and no one will pay for your behavior. Come on, follow me back to the station..”\t\t\t\t\t\t</div>", "images": {}, "success": true}