{"id": 118, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14254913.html", "title": "Chapter 118 - Chapter 118: Chapter 118: Planning To Open A Store (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 118 - Chapter 118: Chapter 118: Planning To Open A Store (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 118: Chapter 118: Planning to Open a Store (Second Update)<br/><br/>Translator: 549690339<br/><br/>At night, after Xiao Jinli secured the doors and windows, she entered the space.<br/><br/>Actually, the suggestion from Xiao Siqian is a good one.<br/><br/>As for the lack of resources she mentioned, it wasn’t an issue at all.<br/><br/>Her space was filled with plenty of crops. As long as she occasionally transplants them to the fields, no one would notice.<br/><br/>Xiao Jinli looked at the vast amount of fruits and vegetables in her space.<br/><br/>Little Zhi jumped out and said, “Master, isn’t the idea proposed by Xiao Siqian to open a shop exactly what you wanted? Why are you still looking worried? Is there a problem?”<br/><br/>Xiao Jinli shook her head and said, “That’s not the problem. The vegetables in the space can fill the gap and be sold. However, the vegetables in the space are, after all, a bit different from the outside ones, I don’t want to invite more trouble.”<br/><br/>In this life, she just wanted to be an ordinary person, not wanting too much attention.<br/><br/>But Little Zhi said, “Master, with your ability, you can solve even the biggest troubles.”<br/><br/>“I can solve them, but I don’t want to be too different,” Xiao Jinli said. “The villagers in Xiao Family Village are very simple and don’t have various bad intentions. But people outside are not the same. Human nature is hard to guess, let alone when it is tested by huge benefits.”<br/><br/>Little Zhi, hovering in mid-air, tilted its little head and said with slight worry, “Then what should we do? You want to be an ordinary person, but you want to help the Xiao Family Village villagers become rich. You don’t want to attract too much attention, but you have to step out. You’re clearly looking for trouble.”<br/><br/>Xiao Jinli,<br/><br/>Little Zhi continued excitedly, “But master, no matter what you want to do, Little Zhi will support you. If you find someone annoying, I can hack their cell phones or even their bank accounts and transfer all their money!”<br/><br/>Xiao Jinli,<br/><br/>She raised her hand and flicked Little Zhi’s little head, laughing, “Alright, it seems I should thank you for your support.”<br/><br/>Then she looked at the vegetables in the space and said, “Well, just sell them. Anyway, if we don’t sell much, they will just think it is delicious and won’t think too much. Plus, with the excuse of earthworms, if others want to learn vegetable farming techniques, they have to learn how to raise earthworms from me first.”<br/><br/>The next day, Xiao Jinli mentioned to Xiao Wanshan about setting up a small shop in Open Market Town.<br/><br/>Xiao Wanshan frowned slightly and asked, “Little Bao, do we need a shop just to sell some vegetables? Wouldn’t a stall do?”<br/><br/>It’s not that he was reluctant to spend money, but he genuinely thought there was no need.<br/><br/>Vegetables could be sold even better on a small stall.<br/><br/>Xiao Jinli said, “Dad, we need to take a long-term view. I set up a shop now for the future. There aren’t many vegetables to sell now, so getting a shop is just for show. But in one or two months, when everyone’s second wave of vegetables come in, this shop will be necessary, don’t you think?”<br/><br/>Xiao Father laughed and said, “Alright, let’s get one. I’ll ask around my friends to see if there’s a shop for rent.”<br/><br/>Xiao Jinli thought for a while and said with a smile, “Dad, it would be better if we could buy the shop.”<br/><br/>If it was rented, and someone became jealous and suddenly raised the rent, that would be a headache.<br/><br/>Xiao Father laughed heartily and said, “Okay, I’ll buy the shop and give it to you. How about that?”<br/><br/>Xiao Jinli laughed and said immediately, “Thank you, Dad!”<br/><br/>Elsewhere, the Village Head and a few villagers decided on where to fence off after taking a walk in the field.<br/><br/>The village head pointed to the land of several families and said, “Mine, Chuntu’s, Changchun’s, and Xiantu’s, these tour plots add up to about two mu. This space should be big enough for everyone to transplant the remaining vegetables. Of course, if you are willing to plant, then plant. If not, then forget it. ”<br/><br/>“There aren’t many vegetables left in my family, my wife plans to plant here and start a new batch.”<br/><br/>“So is my family!”<br/><br/>“However, taking up these people’s land, there should be some compensation. Otherwise, occupying people’s land for free, and delaying their farming, isn’t right.”<br/><br/>“I think the same.”<br/><br/>The villagers tacitly agreed to compensate those whose land was taken.<br/><br/>The villagers acted quickly, and in less than an afternoon, the vegetables in the field were transplanted, and they had even watered them.<br/><br/>The village head observed and said, “These plots are close to our houses, and at a glance, you can see if there are people in the field. If it’s at night, as long as the dogs bark, we can rush over immediately. Now, the dogs don’t need to guard the village entrance, they just need to stroll around nearby and they can notice if there are strangers. This way, it will be difficult for the dog thieves to make a move on our dogs.”<br/><br/>The villagers agreed, “That’s true. This place is close, and we’re more at ease.”<br/><br/>The Village Head still looked slightly worried and said, “Everyone’s fields are now empty, but I don’t know how long the earthworms in these fields will live? Should we buy more from Xiao Jinli?”<br/><br/>“Dad, didn’t Xiao Jinli say that the lifespan of these earthworms is basically between three to five months? The earthworms we released have not been out for three months, and they still have a certain lifespan, so planting another batch should not be a big problem.” Xiao Qingshan said, “If these earthworms die in the middle, we can buy from Xiao Jinli again. Xiao Jinli said that she can provide them to anyone in our village at any time.”<br/><br/>The Village Head gave him a glance and said snappily, “Hmph, you think I don’t know what you just said. I was just expressing my feelings. Xiao Jinli is now going to school and doesn’t have much time to raise earthworms, so we should save as much as we can.”<br/><br/>Xiao Qingshan pouted and said, “Considering Xiao Jinli’s intelligence, there isn’t much difference whether she’s at school or not.”<br/><br/>The Village Head slapped Xiao Qingshan on the back of the head and said in dissatisfaction, “What nonsense are you talking about? No matter how clever Xiao Jinli is, she is still a child. At this age, she should go to school. No matter how big the matter is, it’s not as important as school. From now on, do not say this in front of Xiao Jinli.”<br/><br/>Xiao Qingshan rubbed the back of his head and said with a smile, “Okay, I got<br/><br/>”<br/><br/>The Village Head looked at the things in the field and said, “Alright, help gather these old vegetables and leaves to feed the chickens and ducks. The chickens, ducks, pigs, and cattle at home all love eating these vegetables, so don’t waste them.”<br/><br/>“Oh, understood.” Xiao Qingshan got to work collecting the old leaves from the field.<br/><br/>The others also took the old leaves and went home to feed the chickens and ducks.<br/><br/>Who knew, the chickens and ducks fed with these vegetable leaves laid particularly tasty eggs. Perhaps, when there were no green vegetables, these eggs could tide them over for a while..\t\t\t\t\t\t</div>", "images": {}, "success": true}