{"id": 110, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14254877.html", "title": "Chapter 110 - Chapter 110: Chapter 110: Xiaojia Vegetables Are Sold Out (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 110 - Chapter 110: Chapter 110: Xiaojia Vegetables Are Sold Out (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 110: Chapter 110: Xiaojia Vegetables Are Sold Out (Second Update)<br/><br/>Translator: 549690339<br/><br/>Xiao Jinli went to the Village Chief’s house and handed over both proposals.<br/><br/>She said, “Mr. Village Head, please have your village committee examine these two proposals first, then call a village-wide meeting to discuss. Regardless of which proposal you choose, I will support it. Regarding the issue of whether or not some people want to join, it should be voluntary. However, let it be known that if they decide to join after we start making money, the dividend system may be a bit different compared to those who joined from the start. If they want to cause trouble at that time, we can just kick them out.”<br/><br/>Even though she wanted to help the villagers become wealthy, she couldn’t overcome people’s inherent selfishness.<br/><br/>It was not wrong for them to consider potential future losses. However, once the first group started making money, it would not be a reason for them to cause a commotion.<br/><br/>The Village Head took the proposals and said, “Hmm, I will bring this up during our meeting. Let me take these two proposals to the village committee so everyone can study and discuss them. When we call the meeting, I will notify you!”<br/><br/>Even though Xiao Jinli was young, she’d already become the backbone of Xiao Family Village. She was usually invited to major village meetings.<br/><br/>Xiao Jinli nodded and said, “Alright. Uncle Village Chief, if you have any questions, you can directly ask me, or you can ask Little Brother Xiao Quan.”<br/><br/>“Little Quan?” The Village Chief looked a bit puzzled at Xiao Siqian, standing off to the side.<br/><br/>Xiao Jinli laughed, “Uncle Village Chief, don’t worry, Little Brother Xiao Quan knows at least as much as I do. These two proposals in your hands were written by him. Therefore, if you have questions, he is most capable of answering.”<br/><br/>Only then did the Village Chief understand. He nodded and said, “Alright then. Little Quan, we will be counting on you.”<br/><br/>Xiao Siqian smiled and said, “Uncle Village Chief, you’re too kind. It’s just a small effort.’<br/><br/>“Haha….. you are a good lad!” The Village Chief praised with a laugh, “Indeed, one family will not walk under two roofs!”<br/><br/>When Xiao Siqian heard these words, his heart was filled with unspoken joy.<br/><br/>After Xiao Jinli and Xiao Siqian left, the Village Chief, not wasting any time, called Xiao Qingshan to study the two proposals.<br/><br/>After they finished reading, the Village Chief asked, “Qingshan, which of these two cooperation methods do you think is more suitable?”<br/><br/>Without hesitation, Xiao Qingshan said, “My opinion is the same as Jinli’s, that cooperating in the form of a company is more suitable. The cooperative’s way of cooperation, bluntly speaking, is sharing benefits when there are profits to be made, and dissolving when there are none. Such an obvious drawback won’t last. Companies are different, they have a strict management system, and their core method is to share benefits and share risks, clearly strengthening collaboration between people.”<br/><br/>At this point, he paused as if remembering something, and then said, “Besides, the process of setting up a company may be cumbersome, but Jinli mentioned that the creation of the company can be left entirely to her father and her brother.”<br/><br/>After listening to his younger son’s words, the Village Chief pondered for a moment and said, “I’m actually more inclined toward starting a company too. However, it’s yet to be decided whether we will form a cooperative or start a company. Our village committee needs to research and discuss this multiple times. We also need to have a village-wide meeting with everyone else to discuss this.”<br/><br/>Xiao Qingshan nodded, “Of course, that’s how it should be. After all, this is a big decision and we need to get everyone’s opinion.”<br/><br/>It was already the end of August and Xiao Jinli’s holiday was just about over.<br/><br/>Taking advantage of the tail end of her holiday, Xiao Jinli planned on fencing in the land and taking the first step toward expanding production.<br/><br/>Ji Yuzhu and Gao Yanxin had been staying in Xiao Family Village for almost a month. But due to their job responsibilities, they had to leave despite their reluctance.<br/><br/>When they left, Ji Yuzhu took two thousand earthworms with him.<br/><br/>The village’s vegetables were increasingly in demand.<br/><br/>Any vegetables grown in earthworm soil that made it to the open market town were immediately sold out.<br/><br/>However, no matter how popular a product, it would eventually run out if the demand was too high.<br/><br/>Initially, the villagers of Xiao Family Village planted vegetables with earthworms for their own consumption, but now, they had sold so much that they were almost out of vegetables for themselves.<br/><br/>While the adults could manage, families with children would be in trouble without these vegetables.<br/><br/>Therefore, no matter how marketable these items were, they couldn’t keep selling them off, at least not at the expense of their children.<br/><br/>As a result, fewer and fewer people were going into town to sell vegetables.<br/><br/>Those who had bought veggies from the Xiao Family in town found that if they missed out on securing any, their children made quite a fuss at home, giving them headaches.<br/><br/>“Whine… There aren’t any tasty green vegetables today, I’m not eating, I’m not eating.”<br/><br/>“Sweetie, be good. Grandma went late today and didn’t manage to buy. I’ll go earlier tomorrow and buy more. We’ll store them at home, alright? For now, let’s eat and fill our bellies, then we can go outside and play, okay?”<br/><br/>“No, no, these vegetables aren’t fragrant. They’re not tasty!”<br/><br/>A child, about thirteen or fourteen, came to the dining table, sniffed, and then frowned. “Mom, why don’t we have the greens we ate yesterday?”<br/><br/>A middle-aged woman came out from the kitchen, seeming somewhat helpless. “No one came to sell them today. I went to wait at the usual spot early in the morning, but not a single vendor showed up. Dabao, I made your favorite braised fish and prawns today, give them a try.”<br/><br/>But Dabao shook his head. “Both of these dishes aren’t as tasty as your stir-fried leek with eggs from yesterday.”<br/><br/>“Isn’t there a dish of stir-fried leek with eggs right here? Try some!”<br/><br/>“No, this dish of stir-fried leek with eggs tastes weird. It’s nowhere near as tasty as yesterday’s.”<br/><br/>Afterwards, Dabao ate a few mouthfuls of rice and then barely touched his plate.<br/><br/>“Why aren’t you eating?” his mother asked with a furrowed brow.<br/><br/>“I don’t have an appetite. Mom, I’m not eating anymore, I’m going out to play.” With that, the child laid down his bowl and chopsticks and went outside.<br/><br/>The mother, looking at the half-eaten bowl of rice left by the child, knitted her brows.<br/><br/>The child had always been picky about food and didn’t enjoy meals. He was small and thin compared to his peers, resembling a malnourished sprout.<br/><br/>No matter how many methods she came up with or how much effort she put into preparing meals, there was never any improvement.<br/><br/>Until some time ago, when she bought vegetables from a family in Xiao Family Village, three bunches of small chives, and two bunches of small cabbage.<br/><br/>She stir-fried the chives with eggs and stir-fried the small cabbage.<br/><br/>Who could’ve guessed that once she cooked these two dishes, their fragrant aroma filled the house. At the dining table, her typically finicky child suddenly had a large appetite. With the aid of these two dishes, he ate two bowls of rice. “Mom, these two dishes are so fragrant, and they feel so good to eat. Where did you buy these vegetables?”<br/><br/>“I bought them from a villager.”<br/><br/>“Then let’s buy from them again tomorrow. It’s really tasty.”<br/><br/>The next day, she went out to buy again. When she arrived, most of the vegetables were about to sell out, with only some spinach remaining. She feathered her way through the crowds to snatch it up. If a slightly higher price could encourage her kid to eat more, it was a small price to pay.<br/><br/>However, she realized this person’s veggies sold really well, so if she wanted to buy some the next day, she’d have to wake up early and wait on the route the vendor took to the market. Otherwise, she wouldn’t have a chance.<br/><br/>After buying this way for several days, her child’s appetite kept getting better. In just a few days, her child’s cheeks started to look more rosy.<br/><br/>Who knew that after a few days, the sellers from Xiao Family Village would all disappear.<br/><br/>She became worried, unsure of what to do next..\t\t\t\t\t\t</div>", "images": {}, "success": true}