{"id": 120, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14254921.html", "title": "Chapter 120 - Chapter 120: Chapter 120: Store Sells Vegetables (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 120 - Chapter 120: Chapter 120: Store Sells Vegetables (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 120: Chapter 120: Store Sells Vegetables (Second Update)<br/><br/>Translator: 549690339<br/><br/>Several days later, the shop was open for business.<br/><br/>Upon learning the location of the shop, Chen Qiulan picked some vegetables from Xiao Jinli’s greenhouse and immediately set off for the Open Market Town.<br/><br/>As she picked the vegetables in the greenhouse, Chen Qiulan laughed and said, “These greenhouse vegetables look more vibrant than the ones we grow in the fields.”<br/><br/>Xiao’s mother chuckled and replied, “It’s probably because there are more<br/><br/>earthworms in these fields than yours.”<br/><br/>Chen Qiulan thought about it and agreed, “That should be the reason. Xiaofang,<br/><br/>I have already picked a basket full, is that enough?”<br/><br/>Xiao’s mother looked and said, “That should be enough. Jinli said we only need to provide a little each day, we don’t need too much.”<br/><br/>Looking at the basketful of vegetables, Chen Qiulan smiled and said, “These vegetables will probably be snatched up before they even reach the shop, why do we even need a shop?”<br/><br/>Xiao’s mother thought for a bit and replied, “Hmm, we should cover them before reaching the shop.”<br/><br/>“Huh?” Chen Qiulan asked in confusion, “Why do we need to cover them?”<br/><br/>Xiao’s mother said, “Our current goal is to direct attention to our shop. If we sell on the way, then people won’t know about our store.”<br/><br/>Chen Qiulan laughed and said, “Even if we cover them, it’s not going to help that much. A few sales in, people will know what’s in these baskets: vegetables, and they’ll still snatch them up.”<br/><br/>Xiao’s mother gave a little shake of her head and said, “Well, let’s keep it hidden for as long as we can.”<br/><br/>Chen Qiulan nodded, agreeing, “Alright then.”<br/><br/>Having picked a basketful of vegetables, which she divided into two baskets, she covered them with cloth and asked Xiao Qingshan to take them to the shop.<br/><br/>Xiao Qingshan looked at the baskets, and said somewhat resignedly, “Mother, isn’t this unnecessary? I’m driving, I can directly deliver it to the shop without anyone stopping me on the way.”<br/><br/>“Upon being reminded of this by Xiao Qingshan, she slapped her forehead and laughed, “That’s true. Initially, I hadn’t planned to have you deliver them. I was going to do it myself. But now that you offered to help, it has indeed saved me some trouble.”<br/><br/>Xiao Qingshan quickly took his mother to the shop.<br/><br/>After parking, he looked at the sign hanging above the store that read “Xiao Family Village Fresh Green Vegetables,” and asked, “Mother, this is the place, right?”<br/><br/>Chen Qiulan nodded and said, “Yes, it’s here. Here is the key, let’s open the shop first.”<br/><br/>Xiao Qingshan took the key, opened the door, and saw that the shop was quite clean with some shelves inside.<br/><br/>Chen Qiulan took the baskets out of the trunk and walked into the shop.<br/><br/>She said, “This shop is pretty big. I heard that it used to be rented to a clothing store owner. The house owner needed money so he sold it to Xiao Wanshan.<br/><br/>Honestly, using such a shop to sell vegetables seems a bit of a waste.”<br/><br/>Xiao Qingshan laughed and said, “Wanshan and Jinli probably have their plans. Otherwise, they wouldn’t have spent so much to buy a shop. Once all the vegetables from our village arrive, this shop will have its use, it won’t be wasted.”<br/><br/>Now every household in Xiao Family Village has expanded their vegetable cultivation area, hoping to sell some vegetables, make some money and buy new clothes for their children to celebrate the New Year.<br/><br/>Previously, they never thought about making money by selling vegetables, but now they have unexpectedly triggered this making-money mode.<br/><br/>No one can resist money, right?<br/><br/>Just as Xiao Qingshan was carrying the other basket of vegetables into the shop, a woman who was buying vegetables recognized Chen Qiulan.<br/><br/>“Oh, sister! It’s you!” exclaimed a middle-aged woman. Seeing Chen Qiulan, her eyes lit up. She walked into the shop, saw the vegetables in the baskets and immediately broke into a smile, “Do we have vegetables today?”<br/><br/>She then selected a large pile of them to buy.<br/><br/>Chen Qiulan immediately intervened, saying, “Sorry sister, we don’t sell many vegetables and have to limit quantities. At most, you can only buy two handfuls of vegetables.”<br/><br/>The woman looked surprised and said, “What? Limited quantities? I’ve never heard that before. Why would you limit the quantity of vegetables you sell? Sister, aren’t you selling vegetables anyway? Whether you sell them or not, why would you limit quantities?”<br/><br/>Chen Qiulan explained, “I’m sorry about this, sister. We have a lot of customers looking for our vegetables, so many that they are going straight to our village.<br/><br/>In order to allow more people to buy them, we have to resort to this measure. There aren’t many vegetables in our village to start with and we only have so much each day. I hope you can understand.”<br/><br/>The woman looked at the vegetables in the baskets and seemed to struggle to part with them. She said, “How about this, let me buy a bit more today. I will buy less from tomorrow on. Anyway, whether I buy a lot or a little, I have to pay, don’t I?”<br/><br/>Chen Qiulan quickly shook her head and said, “Sister, we can’t do that. In a while, many more people will be here. We are limiting sales so more children can have these. I know you are buying and saving these vegetables for your kids too. Here’s what, since you’re the first customer today, from now on, I’ll keep your share of vegetables aside for you. No matter how early or late you come, you will always get fresh vegetables, alright?”<br/><br/>The woman brightened up immediately and said, “Okay, going forward, you just keep my portion of vegetables aside and I will come and pick it up.”<br/><br/>She paused before smiling and saying, “Actually you’re right, sister. We buy these vegetables all for our children. Ever since they tasted the green vegetables bought from your place, they have enjoyed their meals a lot more. But without your vegetables, they kick up a fuss. It gave me a headache. Now I am hoping I can have one or two of your vegetables every day so that the kids can eat them and be content with their meals.”<br/><br/>Upon hearing this, Chen Qiulan smiled and said, “Well, we’re all doing this for the kids, I understand. We don’t grow many vegetables ourselves, and what we have reserved now is also for children to eat every day. Otherwise, we would have brought our vegetables over to sell.”<br/><br/>“Then sister, how are you growing these vegetables?” The woman asked with curiosity. “I haven’t tasted a more fresh, crisp and delicious cabbage than these.<br/><br/>At first, some people were skeptical that the vegetables were injected with something they shouldn’t be.<br/><br/>But those who ate the vegetables found that they felt noticeably more energetic.<br/><br/>The news in the Open Market Town travels fast.<br/><br/>Chen Qiulan laughed and said, “Ah, sister, I’m sorry but I can’t tell you yet. But you can rest assured, we grow our vegetables with technology. Every household in Xiao’s Village knows how to do it.”<br/><br/>The woman said, “Well, I must visit your village one of these days to see the special kind of land that can produce such vegetables.” “You are very welcome,” Chen Qiulan readily agreed..\t\t\t\t\t\t</div>", "images": {}, "success": true}