{"id": 124, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14254937.html", "title": "Chapter 124 - Chapter 124: Chapter 124: Turmoil Over Harvesting In Other Villages 1 (Part 2)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 124 - Chapter 124: Chapter 124: Turmoil Over Harvesting In Other Villages 1 (Part 2)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 124: Chapter 124: Turmoil Over Harvesting in Other Villages 1 (Part 2)<br/><br/>Translator: 549690339<br/><br/>News of having a combine harvester in Xiao Family Village soon spread to other villages.<br/><br/>After all, in this information age, any developments or changes in a village can be instantly known.<br/><br/>“I heard there is a harvester in the Xiao Family Village that can harvest forty or fifty mu of land in a single day!”<br/><br/>“Heavens, forty or fifty mu of land a day, is that for real?”<br/><br/>“Of course, it’s real. Now, many people in the Xiao Family Village are using the harvester to harvest their lands. It can finish harvesting four or five mu of land in just over an hour.”<br/><br/>“Who bought the harvester? I heard that harvesters are very expensive, costing several thousand yuan each. Who has that much money to buy one? How much land do you need to harvest to cover the cost?” “I heard it was bought by Xiao Wanshan.”<br/><br/>“Oh, Xiao Wanshan, I heard his family is quite wealthy.”<br/><br/>“Heh heh, no matter how wealthy they are, this seems like a waste. These machines cost several thousand yuan. How many years and how much land would we have to cultivate to save that much money?”<br/><br/>“People who have ways to make money don’t need our concern. Besides, after he bought the harvester, it costs sixty yuan per mu to have him harvest for you. If it’s forty or fifty mu per day, that’s an income of two to three thousand yuan. Wow, you don’t realize how much it is until you do the math. A daily income of two or three thousand, and thirty thousand yuan can be earned in just about ten days. See, the cost is recovered quickly.”<br/><br/>“Ah, now that you mention it, it does seem that way. This machine costing several thousand yuan can cover its cost within just ten days of harvesting rice, and then it will be all profit.”<br/><br/>“That’s what you would think. But this machine needs maintenance and gasoline, both of which cost money. Plus, there probably aren’t many people who are willing to buy such an expensive machine. Moreover, where would you find so much land to harvest forty or fifty mu every day?”<br/><br/>“You’re right.”<br/><br/>“However, what I heard is that many people in the village want to have the harvester from Xiao Family Village come to harvest their rice. I wonder if they can get it.”<br/><br/>“I asked the Village Head, and he talked to the Xiao Family Village. If our village has at least twenty mu of land to be harvested per day, they would be willing to come. However, if it’s just a small plot of a few mu, Xiao Wanshan wouldn’t be willing to come. It costs too much both in time and money to go back and forth for just a small piece of land.”<br/><br/>“The village head also said that if you want the harvester, go to his office to collect some data, then set a time for the combine harvester from the Xiao Family Village to come.”<br/><br/>“Sixty yuan per mu, my family has three mu of land, which would cost almost two hundred yuan. To be honest, I’m a bit hesitant. It’s better for my whole family to harvest these three mu ourselves, finishing it in two days.”<br/><br/>“I have the same idea. My family doesn’t have that much money to spend inviting a harvester. With that money, I could buy more meat for several meals, which is more practical.”<br/><br/>“Yeah, no matter how fast the harvester is, it still costs money. I don’t know how many people in our village are willing to use the harvester for rice harvesting.”<br/><br/>“I heard from Xiuxiu that her husband saw the harvester in action in Xiao Family Village. It finished such a large plot of land with just one round. They have seven or eight mu of land and are thinking of getting the harvester!”<br/><br/>“Their family has a lot of land, so when it comes to exchanging harvest, other families might not be willing. After all, most people have at most four or five mu, and many more only have two or three mu. Who would be willing to exchange like that?”<br/><br/>“Right, so every year they invite people to harvest their rice; they invite more than a dozen people. But even from early morning to night, it’s still not enough to harvest all.”<br/><br/>“With so much land, it’s more cost-effective for their family to have the harvester come to harvest than inviting people.”<br/><br/>“Indeed. I heard from Xiuxiu that their family has already signed up with the village head. There are also several other families with plots of land registered, so the harvester should come.”<br/><br/>“I just don’t know when the village head will set the harvest time, so we can go and have a look.”<br/><br/>“Xiuxiu said their harvest time was set for September 26th. With so much rice in their family, plus two or three more households, it can be harvested together. ”<br/><br/>“My family’s rice is also scheduled for harvest around that time.”<br/><br/>On September 26th, Xiao Wanlin drove the harvester to Li Village.<br/><br/>Village Head Li saw Xiao Wanlin and was very happy, “Wanlin, have you had breakfast yet?”<br/><br/>Xiao Wanlin replied, “I’ve already eaten. Village Head, where is the rice that needs to be harvested? Please show me the way!”<br/><br/>“Alright.”<br/><br/>The Village Head led him to the field where the rice was to be harvested.<br/><br/>But when they arrived there, a problem arose.<br/><br/>The harvester had to pass through some land on its way to the rice fields, inevitably damaging some things. This led to the villagers preventing the harvester from passing through.<br/><br/>“No way, you can’t go through my land. If your machine passes by, it will damage the stuff in my field.”<br/><br/>Xiao Wanlin said, “I can compensate for the damaged things.”<br/><br/>“That’s not enough.” Li Dayou seemed somewhat overbearing, “How much can you compensate? At least fifty yuan.”<br/><br/>Upon hearing this, the Village Head’s face immediately darkened, and he shouted angrily, “Li Dayou, you’re really stretching it. Your several plants of wilted vegetables in the field are worth fifty yuan? Why don’t you just go rob people? It’s more than enough to compensate you with ten yuan.”<br/><br/>However, Li Dayou insisted, “Ten yuan is not enough. If it’s not fifty, you can’t go through my land.”<br/><br/>Hearing Li Dayou’s words, Xiuxiu was anxious and angry.<br/><br/>With anger, she said, “Li Dayou, don’t be too excessive. How much can these few wilted vegetables of yours be worth? Ten yuan at most. I think you’re not trying to block the harvester. You just don’t like my family. Isn’t that why you’re trying to prevent our rice from being harvested?”<br/><br/>Li Dayou raised his head stubbornly and said, “I’m dealing with the issue, not the person. Zhou Xiuxiu, you either let the harvester pass through other places or give me fifty yuan if you want to pass through my land.”<br/><br/>Xiao Wanlin looked around and asked the Village Head, “Village Head, whose land is next to this one? Can the machine pass through there?”<br/><br/>The Village Head looked at one person in the crowd and asked, “Da Shan, can<br/><br/>the machine pass through your field!”<br/><br/>Li Dashan stepped forward, frowning, “Village Head, my field is planted with rice. If such a big machine passes through, it’s hard to say how much rice will be damaged. This won’t do.”<br/><br/>Xiao Wanlin said, “I can compensate for this. Also, although the machine is big, it doesn’t cause too much damage when passing through. Plus?”<br/><br/>He looked at the rice in the field and continued, “Your rice is also quite ripe. How about this, when I pass through, I’ll also harvest this section of your field, and give you additional compensation. What do you think?”<br/><br/>When the villagers heard this, they immediately laughed and said, “Ha ha, that’s not bad. Da Shan, your rice was going to be harvested in a few days anyway. Now the harvester will do it for free, and you’ll even get some compensation. This is a win for you.”<br/><br/>After listening, Li Dashan frowned for a moment, seemingly deep in thought..\t\t\t\t\t\t</div>", "images": {}, "success": true}