{"id": 127, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14254949.html", "title": "Chapter 127 - Chapter 127: Chapter 127: Mental Illness (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 127 - Chapter 127: Chapter 127: Mental Illness (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 127: Chapter 127: Mental Illness (First Update)<br/><br/>Translator: 549690339<br/><br/>As Li Dayou fell on his buttocks two or three meters away, the villagers started chattering in surprise after watching him.<br/><br/>“This young man has such great strength.”<br/><br/>“Yeah, being able to kick someone so far away, how strong must he be?”<br/><br/>“Has Li Dayou gone crazy? He starts fights with everyone and now he even wants to hit a child.”<br/><br/>“Yeah, have you noticed that something’s off with Li Dayou’s mental state?”<br/><br/>“Yes, I also think there’s something wrong with Li Dayou’s mental health. When he used to beat his wife and children, we thought it was just a violent temper. But now, he beats people all the time, even strangers. That’s not normal, is it?”<br/><br/>“Yeah, which normal person swears and beats people so easily? Perhaps Li Dayou really has a mental illness.”<br/><br/>“If he has mental illness, that would be terrifying. It seems his illness makes him prone to violence, always hitting people. What if, by chance, he beats someone to death? How could we deal with that?”<br/><br/>“Yeah, the child is so young, and he wanted to hit him without hesitation. Look at his eyes, obviously red, and he’s so impulsive and violent. If he didn’t control his strength, the child wouldn’t be able to withstand it.”<br/><br/>Everyone was suspecting that Li Dayou had a mental illness.<br/><br/>Oh, it’s not just suspicion, they were certain of it.<br/><br/>Li Dayou was lying on the ground, howling in pain. Some children, out of curiosity, wanted to join in the commotion but were held back by the adults, not allowing them to come close.<br/><br/>This Li Dayou was a mentally ill person who could become violent.<br/><br/>What if he hurt the children? What would they do?<br/><br/>Xiao Village Chief frowned and asked Chief Li, “Is this man mentally ill?”<br/><br/>Chief Li shook his head, “We don’t know?”<br/><br/>Xiao Village Chief said, “I don’t care if he’s mentally ill or not, but he beat Xiao Wanlin for no reason, and he must compensate for it!”<br/><br/>At this moment, Xiao Jinli whispered a few words into the ear of Xiao Village Chief.<br/><br/>Xiao Village Chief’s frown deepened.<br/><br/>He asked again, “Have you seen his wife and child lately?”<br/><br/>The villagers were slightly stunned, not understanding why Xiao Village Chief suddenly wanted to ask about Li Dayou’s wife and child. They looked at each other.<br/><br/>Xiao Village Chief didn’t hear the villagers’ answer, so he became more anxious and asked again, “Have you or not?”<br/><br/>“I haven’t seen Hongxiu and Xiaoliang for nearly a month.”<br/><br/>“It’s been a long time since I saw them too. Li Davou said that he beat Honzxiu and the child, so they went back to their maiden family a month ago.”<br/><br/>“That’s not right. In the past, when he beat Hongxiu and the child, they would go back to their maiden family, but Li Dayou would come to fetch them after two or three days. In general, Hongxiu’s time at her maiden family wouldn’t last more than one week.”<br/><br/>“Sigh, Hongxiu is really unlucky. After being beaten by Li Dayou, she went back to her maiden family and tried to get a divorce, but her family wouldn’t let her. They said it would embarrass them and lose face, and they wouldn’t recognize her as their daughter. They also said that it’s not a big deal for a woman to be beaten, just lie down for a few days and she would be fine.”<br/><br/>“Ever since marrying Li Dayou, Hongxiu would be beaten every few days. It’s said that the most severe beating left her with three broken ribs, and she wasn’t even allowed to go to the hospital. She just rested in bed for ten days to half a month and went back to work.”<br/><br/>“Thinking about it now, Li Dayou is simply not human.”<br/><br/>“Right, now that Hongxiu has been missing for a month, you see that Li Dayou doesn’t seem to be in a hurry. Before, as soon as Hongxiu went back to her maiden family, he would be anxious, buy some gifts, and go to Hongxiu’s family in a respectful manner to bring her back.”<br/><br/>“Yes, something is clearly not normal.”<br/><br/>The more everyone talked, the more uncertain they felt, and a bad premonition began to creep into their hearts.<br/><br/>Chief Li listened to everyone’s discussion, and his heart sank, feeling a little uneasy. But he still asked, “Changgui, why are you asking this?”<br/><br/>Xiao Village Chief said straightforwardly, “As you have said, this man often beats his wife and children, and now his wife and child have been missing for over a month. He doesn’t seem to be worried, which is clearly not normal. I suggest you go to his house and check it out.”<br/><br/>Chief Li and some of the villagers’ faces changed at once.<br/><br/>Li Dayou, who was lying on the ground, heard them talking about going to his house and immediately disregarded the pain. With red eyes, he became extremely agitated and said, “No, you can’t go!”<br/><br/>Then, he wanted to rush up and hit Xiao Village Chief again.<br/><br/>But this time, he was held back by several strong men from Li Village.<br/><br/>Now, even the most foolish person could tell that there must be something going on at his house.<br/><br/>If Hongxiu and her child had really been…<br/><br/>The villagers didn’t dare to think further.<br/><br/>Chief Li, looking at Li Dayou who was trying to pounce on Xiao Village Chief, slightly lowered his face and said, “Let’s go and have a look. Li Chunliang, you guys keep him under control.”<br/><br/>If things were as they suspected, Li Dayou would not only be dangerous, but potentially a murderer. They couldn’t let him escape easily, or else he would pose a great threat to the villagers.<br/><br/>Then Chief Li led everyone to Li Dayou’s house.<br/><br/>Li Dayou’s house was a two-story, reinforced concrete building with a large front yard and an iron gate.<br/><br/>Looking at it, their living conditions seemed okay.<br/><br/>The iron gate of the yard was locked, and Chief Li searched Li Dayou’s body for the key, ignoring his violent struggle.<br/><br/>As they opened the gate, they saw the messy yard. There was a chicken coop on the left side, with chicken droppings all over the ground and no space to step on.<br/><br/>On the right side was a bathroom with two urine buckets. Rural people used them as fertilizer for their vegetables.<br/><br/>“It smells so bad!”<br/><br/>Someone stepped into the yard and caught a whiff of a nauseating odor.<br/><br/>“Why is it so smelly?”<br/><br/>“There’s chicken poop all over the ground, of course it stinks.”<br/><br/>“No, this doesn’t smell like chicken poop, it’s more like… it’s more like a dead rat.”<br/><br/>“Yes, yes, I also think it smells like the odor of dead rats. But how many rats must have died to create such a stench?”<br/><br/>At this time, someone suddenly understood the situation and whispered, “What if it’s not the smell of dead rats, but…?”<br/><br/>The person next to him shivered, his back hairs standing on end, unable to believe it. He stammered, “No… No way, right?”<br/><br/>In fact, the villagers present had a vague guess in their hearts, but they still couldn’t quite believe it.<br/><br/>Chief Li’s brow furrowed tightly.<br/><br/>He then noticed the young girl from Xiao Family Village, whose facial expression remained unchanged, but her deep black eyes flickered with a hint of ruthlessness.<br/><br/>She pulled Qing Shan’s sleeve and gestured with her eyes for him to head straight to the backyard.<br/><br/>However, not only was the iron gate of Li Dayou’s yard locked, but the front door of the house was also locked. If they wanted to go to the backyard, they had to pass through the front door.<br/><br/>Qing Shan asked Chief Li, “Chief, please open the door.”Chief Li took out the key to the front door and was about to open it.<br/><br/>Just at this moment, something unexpected happened!\t\t\t\t\t\t</div>", "images": {}, "success": true}