{"id": 122, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14254929.html", "title": "Chapter 122 - Chapter 122: Chapter 122: Combine Harvester (Part 2)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 122 - Chapter 122: Chapter 122: Combine Harvester (Part 2)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 122: Chapter 122: Combine Harvester (Part 2)<br/><br/>Translator: 549690339<br/><br/>After several meetings and discussions, the Village Head and village cadres all agreed that it was more appropriate for the village to establish a company.<br/><br/>After all, with shared interests and risks, it would better reflect the cohesion and unity of a village, rather than fostering selfish individuals who only want to enjoy the benefits without taking on any risk.<br/><br/>After the village cadres’ meeting, a village-wide meeting took place.<br/><br/>However, it was difficult to reach a consensus at the village-wide meeting.<br/><br/>Especially for those women who had married into Xiao Family Village within the past few years.<br/><br/>They believed that using land as capital to join the company was too risky, and if the company didn’t make any money after joining, they would suffer a great loss if they couldn’t get the land back.<br/><br/>Having some land at home, the older family members could rely on farming, growing rice and vegetables, so as to reduce the burden on the younger generation.<br/><br/>After the land shares, if the company didn’t make any money and the elderly could do nothing but farm and take care of the children, wouldn’t that increase the burden on the younger people?<br/><br/>Moreover, they don’t think planting vegetables can actually make everyone money.<br/><br/>If planting vegetables could make money, people would have started doing it already.<br/><br/>Instead, the whole village has to follow a child’s proposal to grow vegetables and become busy, and everyone’s land has to be invested in as well.<br/><br/>Are they playing house?<br/><br/>The people of Xiao Family Village are not so childish, are they?<br/><br/>The new daughters-in-law of Xiao Family Village have many opinions.<br/><br/>However, they don’t know that their opinions are not important anymore.<br/><br/>“Fine, since my opinion doesn’t matter, let’s get a divorce. I’ll take the children and leave. After that, you can listen to whatever Xiao Jinli says; I won’t interfere.”<br/><br/>“Divorce, divorce! I can’t make decisions on such a big matter at home. I’ve been married into your family for so many years, and you still treat me as an outsider. If that’s the case, let’s just be outsiders completely. Also, I gave birth to the child, and I have to take them with me.”<br/><br/>Such quarrels started one after another since the decision of establishing the company and using household land as capital input.<br/><br/>If they use their land as shares, the young wives want a divorce.<br/><br/>But if they don’t join the company, they might miss out on any profits if the company starts making money in the future.<br/><br/>Finally, many families followed the Village Head and Village Committee’s advice, dividing their land in half, with one part as capital and the other part left for personal cultivation.<br/><br/>Out of the more than 100 households in Xiao Family Village, at least 30 of them made such a choice.<br/><br/>Xiao Jinli had anticipated this outcome.<br/><br/>With the information handed over by the Village Head, Xiao Jinli began preparing to establish a company.<br/><br/>Of course, all the related procedures and paperwork for setting up the company were handed over to his father and elder brother.<br/><br/>After all, they are the ones who have experience running a company and are very familiar with the process.<br/><br/>Of course, establishing a company isn’t something that happens overnight.<br/><br/>A single falling leaf heralds the arrival of autumn!<br/><br/>As deep autumn arrives, the crops are gradually being harvested!<br/><br/>Late rice has already started to be harvested urgently.<br/><br/>Compared to summer, autumn weather is more stable, with longer periods of sunshine replacing the constant switching between clouds and blue sky.<br/><br/>Before harvesting the late rice, Xiao Wanshan bought a combine harvester, which cost over 30,000 yuan.<br/><br/>In addition to harvesting his own rice, it would also be used to harvest others’ rice, charging 60 yuan per mu.<br/><br/>Xiao Wanshan bought the harvester not to make money but to make things more convenient for everyone, so he didn’t charge a high price.<br/><br/>They checked and found that in places with harvesters, the cost of harvesting one mu of land is 100 yuan.<br/><br/>Of course, for rural people, 100 yuan per mu is considered expensive. Hiring someone to work for a day would only cost 30 yuan.<br/><br/>Xiao Wanshan set the price after careful calculation, considering the salary of the person operating the harvester and the cost of the machine itself.<br/><br/>He didn’t intend to make a huge profit, but he also didn’t want to suffer a loss.<br/><br/>Though the people of Xiao Family Village are simple and united, they couldn’t just rely on charity to help the villagers, right?<br/><br/>As the saying goes, “A rise in rice brings gratitude, while a peck of rice breeds enmity!”<br/><br/>Xiao Wanshan knew how to strike a balance.<br/><br/>Otherwise, with such a big company in the county town, if the people of Xiao Family Village had developed a greedy nature, they would have taken advantage of him long ago.<br/><br/>When Xiao Wanshan first brought the harvester back, the villagers were curious to see it.<br/><br/>“Wanshan, what kind of machine is this? It’s so big!” one villager asked, reaching out to touch the red paint.<br/><br/>Xiao Wanshan smiled and said, “Uncle, this is a combine harvester, a machine for harvesting rice!”<br/><br/>“This is a rice harvesting machine? How do you use it with the machine being so big?”<br/><br/>Xiao Junxuan replied, “Great Grandfather, the combine harvester just goes into the field, makes a couple of noises, and the rice is harvested very conveniently. In a few days, when our rice is ready to be harvested, I’ll show you how it’s done.”<br/><br/>“Haha, good, good, I’d like to see something new at my age.”<br/><br/>Five days later, when the villagers saw Xiao Wanshan using the harvester to harvest his own rice, they were completely astonished by the efficiency. In less than an hour, five acres of rice were harvested.<br/><br/>This efficiency is just too high.<br/><br/>For one acre and five of rice, if they were to hire three people to work for a day, it would cost at least 100 yuan or more, and it would also be tiring.<br/><br/>However, the biggest drawback of the harvester is that it cannot obtain complete straw; rice is harvested halfway, and after the grains are threshed, the straw is scattered all over the ground in a disorganised manner.<br/><br/>Many families in the village now have cows, and not having dry straw for the winter is a problem.<br/><br/>Families with cows were hesitant about using the harvester.<br/><br/>The Village Head doesn’t have cows, so when he saw Xiao Wanshan’s harvester, he was both intrigued and excited. He had his five acres of land harvested by the machine in less than two hours, and as soon as it was done, he rushed to the grain field to dry the rice.<br/><br/>“The efficiency of this harvester is just too amazing. Five acres of land harvested in under two hours.”<br/><br/>“It saves time and effort but it does cost money. Five acres of land requires 300 yuan. Now that rice is selling for 80 yuan for 100 jin, it costs several hundred jin of rice. Suddenly, I feel a bit reluctant to pay.”<br/><br/>Normally, the income from farming isn’t much, and spending money on this would make villagers somewhat reluctant.<br/><br/>“Yeah, five acres of land, 300 yuan, it’s a bit much. Usually, when we harvest rice, we exchange labor with one another, only spending time and effort without too much money.”<br/><br/>“Now it saves time and effort but not money. Saving money doesn’t save time and effort so we have to choose one.”<br/><br/>“But really, harvesting five acres of land in less than two hours saves so much trouble. After the rice harvest, the remaining time can be used to find other work or do odd jobs.”<br/><br/>“Yes, you’re right. The time spent exchanging labor for harvesting can be used for odd jobs, and the money won’t be less.. Haha..\t\t\t\t\t\t</div>", "images": {}, "success": true}