{"id": 123, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14254933.html", "title": "Chapter 123 - Chapter 123: Chapter 123: Combine Harvester Efficiency (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 123 - Chapter 123: Chapter 123: Combine Harvester Efficiency (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 123: Chapter 123: Combine Harvester Efficiency (First Update)<br/><br/>Translator: 549690339<br/><br/>Everyone saw the efficiency of the Xiao Family’s combine harvester when harvesting rice, and aside from a few families with cattle who needed straw, many people chose to use the combine harvester for harvesting.<br/><br/>However, since this harvester was quite large, it would always damage some crops when passing through fields. For this, Xiao Wanshan would always offer some compensation. Although villagers would refuse, Xiao Wanshan insisted on giving, so they accepted it.<br/><br/>Xiao Wanshan went to the fields and saw that several villagers had nearly ripened rice, he discussed with them, “Uncle, all your rice is almost ripe, so let’s cut it all together when it’s time. This way, it’ll be more convenient for the machine to move and for everyone. Otherwise, it would be difficult to deal with one family at a time!”<br/><br/>Seeing such a large harvester, of course, everyone considered this issue and said, “Um, no problem. When the time comes, let’s harvest together.”<br/><br/>Xiao Wanshan reminded them, “You all need to prepare more snake skin bags for storing the grain. For one mu, you’ll need at least fifteen bags. When loading the grain, if there are more people helping, it’ll be faster.”<br/><br/>The villagers laughed, “Haha, Wanshan, we’ve all seen how your combine harvester harvests rice. Don’t worry, we’ll prepare more bags. If we don’t, the grains might end up in someone else’s house.”<br/><br/>For the first joint rice harvest, there were more than ten households, totaling forty mu of land.<br/><br/>That day, when the harvest started, people from these families and others in the village all came to see the rare sight, making it even busier than when Xiao Wanshan harvested his own rice.<br/><br/>“This machine is convenient for harvesting rice, but it’s not so easy to get it into the fields. The narrow ridges make it difficult for the machine to move. It can only pass through people’s fields, which can cause damage.”<br/><br/>“There’s no way around it. If the machine was like a thresher, we could lift it and take it there with some extra effort. But for such a large machine, even with twenty or thirty people, we don’t know if we could lift it. Also, people would still need to go down and damage the crops anyway.”<br/><br/>“Everything has its pros and cons. Today, we’re harvesting for ten families, forty or fifty mu of land. I don’t know if we can finish in one day.”<br/><br/>“We should be able to. Xiao Wanshan said that this combine harvester could harvest over a hundred mu in a day.”<br/><br/>“That’s true. But that’s only possible if all the land is connected. Look at our land, your piece is here, and mine is over there. The combine harvester needs time to move between them.”<br/><br/>“You’ve got a point. But even if it can harvest forty or fifty mu in a day, it’s already quite impressive. If we were to harvest all this land manually, it would take who knows how long. Now with the combine harvester, once it starts cutting the rice, it can be immediately taken to the grain drying field to dry. It’s so much more convenient.”<br/><br/>The combine harvester went down to the field early in the morning, and the villagers got up before dawn.<br/><br/>In autumn, the weather wasn’t hot, so everyone wasn’t in a hurry to finish the work early.<br/><br/>Those who wanted to harvest rice had already prepared snake skin bags and ropes for tyingoff the mouths of the bags.<br/><br/>Since not all fields were close to each other, the harvester started with the closest house, which happened to be the Village Chief’s land.<br/><br/>This field was 1.5 mu.<br/><br/>As soon as the combine harvester entered the field, it circled the area in just a few minutes, moved to the ridge, and then poured out the rice grains from the funnel. The Village Chief and others immediately opened the snake skin bags and filled them with the grains, bag after bag.<br/><br/>In less than half an hour, the entire 1.5 mu was harvested, with the Village Chief filling more than twenty bags. Then, several young and strong men carried them to the tricycle, which transported the bags to the grain drying field.<br/><br/>Then the combine harvester moved on to the next house.<br/><br/>“Earlier, when Wanshan was harvesting his own rice, it didn’t seem this fast. Now it’s much faster.”<br/><br/>“Hehe, at that time, Wanshan’s harvest was a trial and he was not so experienced. Now that Xiao Wanlin has gotten the hang of it, of course, it’s faster.”<br/><br/>Xiao Wanlin was the person Xiao Wanshan asked to be a driver. He was also a cousin of Xiao Wanshan’s.<br/><br/>Initially, when Xiao Wanshan decided to buy the combine harvester, he considered that neither he nor his son had the time to operate it, so he asked his cousin to be the driver.<br/><br/>Xiao Wanlin agreed without any hesitation.<br/><br/>Xiao Wanshan planned to pay for him to learn, but Xiao Wanlin refused and paid for his own training.<br/><br/>After all, it was a skill, and once learned, it would belong to him. It was unreasonable for Wanshan to both pay him a salary and pay for his learning expenses.<br/><br/>That day, the forty to fifty mu of land from ten families was successfully harvested by 3-4 pm.<br/><br/>Seeing this, the villagers exclaimed in amazement, “The speed of this harvester is really fast. It’s worth spending some money to harvest the rice quickly.”<br/><br/>After all, in the eyes of the villagers, rice harvesting was a time-consuming and laborious task. Now that it was done in one go, many people couldn’t help but feel tempted.<br/><br/>Spending some money to save time and effort, while avoiding too much hardship, is definitely worth it.<br/><br/>As a result, everyone gathered together to inspect their own rice for ripeness, and they discussed and planned to harvest together.<br/><br/>Firstly, it was convenient for the harvester to operate, and secondly, when everyone harvested together, there were more people to help with tasks like loading and transporting the rice.<br/><br/>“My rice can be harvested around September 22. Are your grains ripe?” “I’ve been to the field and it looks like mine will be ready by then.”<br/><br/>“It seems mine will also be ready around that time.”<br/><br/>“Mine may take a few more days; it’s still a bit green.”<br/><br/>“Then, let’s harvest together for our few families. For the rest, we’ll see if they want to harvest together.”<br/><br/>“Yeah, these days, I’ve found a part-time job at Dashi Aqueduct Construction, which pays 35 yuan a day. I estimate it’ll last about a month, so when it’s time to harvest, I can take a day off.”<br/><br/>“Ah, really? That’s great! A month’s worth of work would earn you over a thousand yuan.”<br/><br/>“In the past, harvesting rice took a lot of time, and we didn’t have much time to do part-time jobs. Now with this harvester, things are much more convenient.”<br/><br/>“That’s right. Although we can’t keep the straw, it’s not an issue since we don’t raise cattle. In the past, we would use it as fertilizer, but now, after cutting, it’s left in the field to decompose directly. It’s more convenient.”<br/><br/>“However, a few families who raise cattle still need straw. They either exchange harvesting services among themselves or hire people to do the work.<br/><br/>Sigh, I heard they don’t really want to raise cattle anymore.”<br/><br/>“In the past, people raised cattle because they needed them for plowing the fields. Now there are plowing machines, so there’s no need for cattle.”<br/><br/>“Hehe, nowadays, farming is so convenient. There are plowing machines for plowing the fields, combine harvesters for harvesting rice, and rice transplanters for transplanting rice seedlings. Everything has become mechanized..”\t\t\t\t\t\t</div>", "images": {}, "success": true}