{"id": 129, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14261145.html", "title": "Chapter 129 - Chapter 129: Chapter 129: Murder Case 2 (Part 1)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 129 - Chapter 129: Chapter 129: Murder Case 2 (Part 1)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 129: Chapter 129: Murder Case 2 (Part 1)<br/><br/>Translator: 549690339<br/><br/>With the siren wailing from the Yamen, two of their cars drove toward Li Village.<br/><br/>Li Village, as a whole, was plunged into panic.<br/><br/>“Who could have guessed that Zhou Hongxiu and her child didn’t go back to her maiden family and were killed by Li Dayou instead?”<br/><br/>“Yeah, not only did they kill them, but he also dismembered them. Didn’t even leave their bodies intact.”<br/><br/>“Li Dayou is so ruthless. Before, we just thought he liked beating his wife and children. Who could have thought he would actually kill his wife and children too? He’s not even human.’<br/><br/>“Li Dayou must really have a mental illness. Before, when he had an episode, he would just beat his wife and children. No one noticed or realized it. After all, before he got married, he was polite to everyone. But after getting married, his temper changed drastically. Who knew his violent temper was due to mental illness? So terrifying.”<br/><br/>“Indeed, it’s terrifying. Zhou Hongxiu and her child are so pitiable, being killed by their husband and father in the middle of the night.”<br/><br/>Li Dayou had already been subdued.<br/><br/>Xiao Village Chief and the others never expected that the incident of Xiao Wanlin being beaten would lead to such a major case.<br/><br/>At this moment, the faces of Xiao Village Chief, Xiao Qingshan, and the others were pale, and their expressions revealed fear and horror.<br/><br/>Just thinking about the things they had found back then made them nauseous and scared.<br/><br/>Xiao Qingshan whispered, “Jinli, how did you find out that Li Dayou had mental illness? And how could you guess that his wife and child were killed by him?” None of the people in Li Village noticed it, but Jinli, a child, could see it.<br/><br/>Jinli said, “When Li Dayou was beating someone, his eyes were clearly red, his emotions were agitated, and his temper was explosive. His expression was clearly not normal, so I guessed he might have a mental illness. As for him killing his wife and child, it was because I learned from the villagers that he often beat his wife and children, so I asked a question, and who thought that it would lead to such a case.”<br/><br/>From the villagers’ mouths, he knew that Li Dayou often beat his wife and children, but he didn’t have any conflicts or disagreements with other villagers.<br/><br/>But today, he suddenly acted unreasonably and bullied Xiao Wanlin, starting with beating, and even going after a child like Jinli. It was clear that he had a violent tendency, and his condition was abnormal, like a long-term lack of venting, desperately seeking an outlet.<br/><br/>Xiao Qingshan patted his chest and said, “Li Dayou’s mental illness is too scary. He can kill and still deal with it calmly. He dismembered the bodies and put them in the septic tank and told the outside world that his wife and children had gone back to their maiden home. For more than a month, no one discovered anything. Even though the strong pungent smell was spreading outside, no one thought about it.”<br/><br/>Xiao Village Chief said with a heavy face, “We’ve always heard that Li Dayou loved to beat people, but who could have thought he could kill too.”<br/><br/>For rural people, killing is simply terrifying.<br/><br/>Just as they were about to walk towards the village entrance, Officer Li came over, glanced at Jinli, who seemed as calm as ever, and saw a flash of surprise in his eyes. Then his expression turned serious, and he looked at Xiao Village Chief and said, “Xiao Village Chief, this case was discovered by you guys, so we might need you to go to the police station to give a statement.”<br/><br/>Xiao Village Chief nodded, “Alright, we’ll be there when needed.”<br/><br/>Officer Li looked at Jinli again, his expression a bit puzzled, and asked, “I heard from the others that it was this child who discovered that Li Dayou was mentally abnormal and guessed that his wife and child were killed.”<br/><br/>Xiao Village Chief nodded, “That’s true.”<br/><br/>Fearing that Officer Li would think too much, he quickly added, “Officer Li, this child is smart, but it’s just a guess.”<br/><br/>Officer Li smiled and said, “Xiao Village Chief, don’t worry, I’m just asking. Even if you didn’t tell me, I already knew that this child is very smart. I heard that last semester in Taohua Town Central Primary School, there was a kid who participated in the Math Olympiad and won the county’s special prize. Was that you, little friend, Xiao Jinli?”<br/><br/>Xiao Jinli nodded, “Yes, it was me!”<br/><br/>“Haha, I guessed it right away. There’s only one person named Xiao Jinli in all of Taohua Town!” Officer Li laughed, and then his expression changed, becoming more serious, and he asked, “Kid, I heard you went to the septic tank too. Were you scared?”<br/><br/>Xiao Jinli shook his head, “I wasn’t. I’m brave and not afraid!”<br/><br/>“…” Officer Li nodded, “Alright, will you go with us later to give a statement at the station?”<br/><br/>He heard that many adults were scared by this incident, not to mention the child.<br/><br/>Especially those villagers who went to find it with them, when they saw the hair and head floating up in the septic tank, several of them fainted on the spot.<br/><br/>For them, it was a truly horrifying nightmare.<br/><br/>He thought that Jinli was also scared and was considering whether to let him go to the Yamen to give a statement.<br/><br/>Who would have thought that this child would be more calm and bold than anyone else?<br/><br/>“You guys find a place to rest well first, and we’ll go to the station together later to give a statement. I still have some work to do now, so I’ll go take care of it first.” Officer Li said.<br/><br/>Xiao Village Chief nodded and then thought of a question, and asked, “Officer Li, will Li Dayou be arrested? I’ve heard that people with mental illness don’t get arrested.”<br/><br/>Officer Li said seriously, “This kind of case of mentally ill killing others is a special kind of criminal. When they commit a crime, they have absolutely no sense of reason and cannot judge the severity of the matter. For such criminals, we can only first send them to the mental hospital for treatment, and then decide whether they need to be imprisoned.”<br/><br/>Having said that, he paused for a moment and then reassured, “Don’t worrv, either way, he won’t be able to get out and harm others. He is the type of dangerous person who must always be supervised and managed.”<br/><br/>Xiao Village Chief breathed a sigh of relief and said, “That’s good, that’s good.<br/><br/>As long as he doesn’t appear again, I’m relieved. You have no idea how when Li Dayou’s mental illness flared up, he was always staring at Jinli. I’m really afraid that because mentally ill people aren’t arrested, what if he runs to our village and hurts Jinli again?”.<br/><br/>Officer Li smiled and said, “Since he killed two people, there’s no chance for him to come out again, so you guys can relax. In fact, because you guys discovered this case, our organization could possibly give you a reward. If it weren’t for you noticing something was amiss, Li Dayou might have killed again, with dire consequences!”<br/><br/>Xiao Village Chief immediately waved his hand and said, “Forget about the reward. Our discovery of this incident was purely a coincidence. As long as you don’t let this person out who harms others, we’re already grateful.”<br/><br/>Xiao Village Chief meant every word..\t\t\t\t\t\t</div>", "images": {}, "success": true}