{"id": 126, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14254945.html", "title": "Chapter 126 - Chapter 126: Chapter 126: The Harvest Storm In The Outside Village 3 (Second More)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 126 - Chapter 126: Chapter 126: The Harvest Storm In The Outside Village 3 (Second More)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 126: Chapter 126: The Harvest Storm in the Outside Village 3 (Second More)<br/><br/>Translator: 549690339<br/><br/>Xiao Jinli was in the field, planting vegetables, when she suddenly heard someone shout, “No good, Uncle Wanlin has been beaten up in Li Village.”<br/><br/>“What?” Xiao Jinli immediately stopped what she was doing, stepped out of the greenhouse and saw the village head and other villagers rushing out of the village.<br/><br/>Xiao Jinli asked, “Uncle Village Chief, I just heard someone say Uncle Wanlin was beaten in Li Village. What happened?”<br/><br/>Xiao Wanlin, who worked for her family and was her uncle, was a close relative.<br/><br/>The village head frowned slightly and said, “I’m not too clear on it either, I’m rushing to check it out.”<br/><br/>Xiao Jinli said, “Then I’m coming too!”<br/><br/>The village head shook his head and said, “Jinli, we will go and check it out first. You don’t need to get involved.”<br/><br/>Xiao Jinli shook her head, “No, I’m worried about my uncle. I want to go and<br/><br/>The village head sighed lightly and said, “All right.”<br/><br/>Everyone got in the car, and Xiao Qingshan drove straight to Li Village.<br/><br/>Upon arriving at Li Village, they rushed to the scene of the incident after asking for the location.<br/><br/>Upon arrival, they saw a large crowd gathered, and from a distance, they could hear the argument going on there.<br/><br/>“Li Dayou, don’t you go too far! On what grounds do you resort to violence?” the village chief scolded loudly, “The combine harvester did not pass through your field nor damaged anything of yours, what are you raging about now?”<br/><br/>“Indeed. Li Dayou, you’ve been blocking the machine from passing through your field. It passed through Li Dashan’s field instead, so why are you so angry?” One of the villagers tried to mediate, “Not to mention, you attacked someone out of the blue, which is wrong.”<br/><br/>Li Dayou spat out defiantly, “They initially said they would pass through my field and promised to give me fifty yuan. But now they passed through other routes, causing me a loss of fifty yuan. This is their fault.”<br/><br/>The villagers, ‘ .<br/><br/>The village chief’s face turned pale with anger, he pointed at Li Dayou and yelled, “You… You’re stirring up trouble! They never agreed to give you the fifty yuan from the start. What kind of loss are you talking about?”<br/><br/>Li Dayou insisted, “Hmph, if I say I lost fifty, then it’s fifty. Now if they don’t compensate me, Xiao Wanlin isn’t going to leave Li Village.”<br/><br/>The villagers from Xiao Family Village listened to Li Dayou’s words, their anger instantly boiling over.<br/><br/>The village head of Xiao Family Village strode forward, and said sternly, “I’d like to see how you plan to keep Wanlin from leaving Li Village.”<br/><br/>Xiao Jinli immediately spotted Xiao Wanlin, who had been beaten to the point of swelling and bruising. Anger surged in her eyes, and she walked over to Xiao Wanlin and asked, “Little Uncle, how are you? Are there injuries other than your face?”<br/><br/>Upon seeing Xiao Jinli, Xiao Wanlin asked, “Jinli, why are you here? Don’t worry about me, I just took a couple of unexpected hits to the face.”<br/><br/>Xiao Qingshan, suppressing his anger, asked, “Uncle Wanlin, why did he hit you?” pointing at Li Dayou.<br/><br/>Xiao Wanlin did not hide anything, “Initially the machine had to pass through his field. He requested for a compensation of fifty yuan before he would let the machine pass. I did not agree. Then, it passed through someone else’s field. After I finished harvesting today’s land, I was planning to go back after a short rest. Suddenly this man rushed at me and threw me a couple of punches. He said I owed him fifty yuan and refused to let me leave.”<br/><br/>“Are you out of your mind!” Xiao Qingshan roared at Li Dayou in rage, “Isn’t there a better way to profit? If you’re so desperate for money, why don’t you go rob a bank?”<br/><br/>Xiao Jinli looked at Li Dayou, her eyes cold, “Qingshan, call the police!”<br/><br/>Xiao Qingshan nodded and replied, “Okay!” Then he took out his cellphone to call the police.<br/><br/>The village head of Li Village instantly tried to intervene, “Let’s talk this through, it’s not good to call the police over such a small matter.”<br/><br/>Xiao Jinli coldly retorted, “Being attacked and injured unprovoked, ending up with a swollen and bruised face, is that a small incident?”<br/><br/>The village head of Li Village immediately tried to defuse the situation with a sheepish smile, “Li Dayou is a bit impulsive, but he isn’t a bad person. What if I make him apologize to Master Xiao, how about that?”<br/><br/>If they reported this to the police, it would tarnish not only Li Dayou’s reputation but also the reputation of the entire Li Village. As the village chief, he had to consider the bigger picture.<br/><br/>However, just as the words of the Li Village’s village chief fell, Li Dayou roared angrily at Xiao Jinli, “Shut your trap, you little brat! Believe it or not, say another word and I’ll beat you so hard your buttocks will bloom.”<br/><br/>Li Dayou couldn’t understand why he felt such anger boiling up within him, wanting to vent by hitting and cursing someone.<br/><br/>Upon hearing his words, the people from Xiao Family Village began glaring fiercely at him.<br/><br/>To the people of Xiao Family Village, you could curse at them but you absolutely could not insult Xiao Jinli.<br/><br/>Xiao Qingshan said furiously, “You dare.”<br/><br/>Xiao Jinli looked at Li Dayou’s expression, her eyebrows slightly furrowed.<br/><br/>She felt that Li Dayou’s demeanor was very abnormal, yes, he indeed seemed like a lunatic. Oh, not only a lunatic, but also showing signs of mania.<br/><br/>She turned to the village chief of Li Village, “Does he usually beat his wife and children, even when he’s sober?”<br/><br/>Before the village chief could respond, a villager piped in, “Yes, he does. Any little thing that doesn’t go his way, he starts beating his wife and children.” Li Dayou assaulting his wife and children wasn’t surprising.<br/><br/>As long as something didn’t go his way, he would start throwing things around and abuse his wife and children.<br/><br/>At first, everyone tried to dissuade him. But after their advice, he became even more severe in his treatment towards his wife and children. Over time, they stopped intervening.<br/><br/>Xiao Jinli frowned tightly as she asked again, “So his wife just tolerates this and doesn’t ask for a divorce?”<br/><br/>In this day and age, isn’t divorce a common thing?<br/><br/>Any woman who was long term victim to domestic violence, who could bear it? Wouldn’t she want a divorce?<br/><br/>As soon as Li Dayou heard Xiao Jinli’s question, his anger flared again. With a reddened face, he charged at Xiao Jinli without a word, raising his fist aiming for her head. He also shouted angrily, “Shut up, you little brat!”<br/><br/>Seeing Li Dayou’s violent act, everyone was taken aback and didn’t have time to stop him. Xiao Qingshan roared, “You dare!”<br/><br/>Just as Li Dayou launched himself forward, Xiao Siqian quickly shielded Xiao Jinli behind himself, raised his long leg, and aimed a fierce kick at Li Dayou’s stomach, coldly saying, “You’re just a mad dog, ready to bite anyone!”<br/><br/>Li Dayou was instantly kicked two to three meters away.<br/><br/>“Thump!”<br/><br/>He fell flat on his butt. The kick to his stomach caused him to convulse in pain, combined with the severe pain from the fall, his face contorted in agony, he couldn’t help but yell, “Ouch!”<br/><br/>Everyone watched this scene, their expressions slightly dumbstruck..\t\t\t\t\t\t</div>", "images": {}, "success": true}