{"id": 121, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14254925.html", "title": "Chapter 121 - Chapter 121: Chapter 121: More Famous (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 121 - Chapter 121: Chapter 121: More Famous (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 121: Chapter 121: More Famous (First Update)<br/><br/>Translator: 549690339<br/><br/>“Xiao Family Village Green Fresh Vegetable” shop, after only a few days of selling vegetables in town, became even more famous.<br/><br/>Originally, Xiao Family’s vegetables were only known by those who had bought them.<br/><br/>But since the establishment of the shop, almost half of the people in the street and the town knew about Xiao Family Village Green Fresh Vegetables, which sold well, sold quickly, and sold for high prices, and everyone rushed to buy them.<br/><br/>For example, ordinary bundles of small cabbage are one yuan each, but a bunch of small cabbage from this shop is two yuan each, and there is a limit to the quantity that can be purchased: one customer can only buy one bunch and no more than two different kinds of vegetables in total.<br/><br/>The vegetables in this shop are twice as expensive as other vegetables.<br/><br/>Logically, there should be fewer people buying such expensive vegetables.<br/><br/>But the reality is the opposite. The good-selling vegetables are sold out as soon as the shop opens every day.<br/><br/>“Does this vegetable shop sell gold and silver, or are they not asking for money?” someone wondered, “Why is everyone rushing to buy it?”<br/><br/>Someone in the know said, “I heard the vegetables in this shop are especially delicious, so even though they are expensive, people are still buying them.”<br/><br/>Someone scorned, “It’s just some greens. How good can it taste? Do we need to be so desperate to buy it? It’s like there are no greens sold in the entire town.”<br/><br/>“You don’t know. It’s said that people who come here to buy vegetables do it for their children. The children like the vegetables from this shop, so they feel like eating meals.”<br/><br/>“Strange, what’s so special about the vegetables in this shop that makes the children like it so much?”<br/><br/>“I’m not sure, I haven’t tasted it. I want to try it, but it’s too expensive, and I can’t snatch the vegetables. This shop only sells one or two boxes of vegetables a day, which is about 10-20 jin (about 11-221b).”<br/><br/>“I had never heard that Xiao Family Village was good at growing vegetables before. Recently, wherever I go, I hear that the vegetables grown in Xiao Family Village taste really great.”<br/><br/>“Now I hear that every household in Xiao Family Village is growing vegetables, but they say they keep them for their own family to eat. There are very few households that can sell them. I heard that a while ago, people used to steal vegetables from Xiao Family Village.”<br/><br/>“What? Stealing vegetables? Are you serious or not? In this age, when everyone has enough to eat, drink, and money, are there still people stealing vegetables?”<br/><br/>“Yeah, I can believe that, in the sixties and seventies, when there was not enough to eat, people would go to the fields to steal vegetables. But in this age, even if your family doesn’t grow anything, wouldn’t it be cheaper to buy vegetables?”<br/><br/>“Well, you should know that when I first heard about it, I was very surprised.<br/><br/>But after listening to it many times, I believe it.”<br/><br/>“Why do you believe it?” someone asked puzzledly, “If it’s just taking someone else’s vegetables to cook, I might believe it. But stealing? I find it hard to believe.”<br/><br/>“Not only that, but most of the people who steal vegetables do it at night. Xiao Family Village has dogs, and those who stole vegetables were chased away by the dogs.”<br/><br/>Everyone’s discussion about Xiao Family Village’s vegetables made them seem more and more outrageous.<br/><br/>No one really believed that people would steal vegetables from Xiao Family Village.<br/><br/>They were just puzzled as to why the vegetables sold by Xiao Family Village Green Fresh Vegetable Shop were so expensive.<br/><br/>But it’s infuriating to compare oneself to others.<br/><br/>Their vegetables sell for so much and everyone is rushing to buy them.<br/><br/>Nearby shops and small stalls also sell watery, tender vegetables. The prices of these vegetables don’t rise, and there are very few people coming to buy them.<br/><br/>Chen Qiulan came to the Xiao Family, her face excited and full of enthusiasm, and said, “Oh, Xiaofang, our shop is really famous now. Every day before dawn, there is a big crowd of people waiting outside the shop to open. These vegetables are all priced at twice the price of others’, but it still can’t stop people from being enthusiastic about buying them.”<br/><br/>Xiao’s mother laughed, “Scarcity makes things valuable, right? Our vegetables are delicious, and most importantly, there aren’t many of them. It gives buyers the feeling that if they miss this village, there won’t be this shop, so even if they are more expensive, they are willing to buy.”<br/><br/>If it’s for their children to eat, she is also willing to spend more money.<br/><br/>She continued, “Moreover, our shop currently sells in limited quantities. On average, each person spends about two to three yuan a day. Even if they really want to save money, they can save money by cutting back on other things. There’s no need to skimp on food for the children.”<br/><br/>Xiao’s mother nodded in agreement.<br/><br/>Chen Qiulan looked at the vegetables in the greenhouse and frowned, “Xiaofang, we can’t pick these vegetables in the greenhouse for long, can we?”<br/><br/>Xiao’s mother looked around the empty patches of land, nodding, “It seems that we can’t pick them for long. However, there are seedlings planted over there, and Jinli said they will be supplemented in time. The land is rich in nutrients, so they will grow faster.”<br/><br/>Chen Qiulan glanced at the various seedlings in the corner and smiled, “Alright, I’ll help fill them in now. If you didn’t say it, I wouldn’t have noticed at first that the vegetables in the greenhouse are indeed growing faster. Like this Chinese cabbage, yesterday it hadn’t formed a head yet, but today half of it has formed, and in a couple of days, it can be cut down and sold. The other vegetables are the same. So, it turns out that Jinli is really a talented vegetable planting expert. We have been farming for decades, but we are still defeated by a half-grown child.”<br/><br/>Xiao’s mother laughed modestly, “She just plays around with planting, who would have thought that she could actually come up with some new tricks.”<br/><br/>The whole family has infinite love and admiration for Xiao Jinli.<br/><br/>She said she wanted to grow vegetables, so they immediately allocated some land for her. She said she wanted a greenhouse, so they built one for her.<br/><br/>She wanted to open a shop, and without a word, Xiao Wanshan spent more than 100,000 yuan to buy a house for her to run her vegetable shop.<br/><br/>Ordinary families would never spoil their children like this.<br/><br/>Xiao’s mother added, “The other day, Little Bao said he wanted to enclose a few mu of land for greenhouse construction and make it an earthworm breeding ground. ”<br/><br/>“Has the land been chosen?” Chen Qiulan asked.<br/><br/>Xiao’s mother nodded, “Yes, it will be built next to this greenhouse, covering several acres of land around it. It’s close to home and only a few steps away, making it convenient for Jinli to work. Since raising earthworms, she spends almost every day in the greenhouse doing various things. By next spring, she will have to raise enough earthworms to meet the demands of our village.<br/><br/>That’s over one hundred thousand earthworms.”<br/><br/>Chen Qiulan showed a sympathetic expression, “It’s really hard on Jinli. For the sake of our village, a child like her has put in so much effort. Other children are having fun, and she thinks every day about how to solve the difficulties of the village.”<br/><br/>Xiao’s mother smiled, “She is doing what she likes to do..”\t\t\t\t\t\t</div>", "images": {}, "success": true}