{"id": 128, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14261144.html", "title": "Chapter 128 - Chapter 128: Chapter 128: Murder Case 1 (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 128 - Chapter 128: Chapter 128: Murder Case 1 (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 128: Chapter 128: Murder Case 1 (Second Update)<br/><br/>Translator: 549690339<br/><br/>Li Dayou broke free from the grasp of a few people, dashed toward Chief Li, snatched the key from his hand, and then in two or three steps, reached the well and threw the key right into it.<br/><br/>Everyone, ‘ .<br/><br/>Well, the cat’s out of the bag now.<br/><br/>Obviously, something was not right at Li Dayou’s house.<br/><br/>Chief Li regained his composure with a blue face of anger, and shouted at Li<br/><br/>Dayue, “Li Dayou, what are you doing?”<br/><br/>At this moment, a hint of smugness appeared in Li Dayou’s eyes. He said, “This is the key to my house. I can do whatever I want with it. But what about you people? Did you ask for my permission to come to my house?”<br/><br/>Chief Li didn’t want to argue with him anymore. He said bluntly, “Li Dayou, whether you agree or not, we are definitely going into your house today.”<br/><br/>Immediately after, he ordered, “Li Chunliang, you and some others, hold him down. We are breaking down the door!”<br/><br/>Li Dayou then roared, “You dare!”<br/><br/>Chief Li declared, “Why wouldn’t we dare? Li Dayou, if you weren’t guilty and afraid, why wouldn’t you open the door? Why throw away the key? I’m telling you, if you don’t confess where Zhou Hongxiu and Xiaoliang have gone, we will search your entire house inside and out!”<br/><br/>Li Dayou’s strength was extraordinary. Li Chunliang and three or four others failed to hold him down.<br/><br/>Li Dayou, while running, yelled loudly, “I already said, my wife took the children back to her maiden home.”<br/><br/>Then, he found an iron rod leaning against the chicken coop and swung it wildly at everyone.<br/><br/>The timid, especially women, turned pale with fear when they saw Li Dayou’s abnormal mental state, and they screamed in horror.<br/><br/>This iron rod could kill someone if it struck them.<br/><br/>“Li Dayou, what are you doing? Put down the iron rod immediately,” Chief Li urgently ordered.<br/><br/>“You all get out of my house right now, or don’t blame me for being impolite!” Li Dayou’s eyes were bloodshot, and his expression was extremely agitated, as he swung the iron rod wildly, keeping everyone at a distance.<br/><br/>The villagers of Li Village were now one hundred percent certain that Li Dayou was mentally ill and severely so.<br/><br/>In the past, when he had episodes, he would only beat his wife and children, and no one thought it was abnormal.<br/><br/>Now, with his wife and children gone, he starts attacking others when triggered.<br/><br/>With bloodshot eyes, Li Dayou suddenly stared at Xiao Jinli, who was standing next to Chief Xiao, and raised the iron rod to strike her, shouting, “I’ll kill you! If it weren’t for your big mouth, no one would have paid attention to the whereabouts of my damn wife. Yes, only by killing you, nobody would know about my wife’s whereabouts.”<br/><br/>As everyone watched Li Dayou’s actions and listened to his words, their pupils contracted violently. They all tensed up, with some even closing their eyes, not daring to watch the next moment.<br/><br/>Xiao Siqian immediately pulled Xiao Jinli behind him, his whole body tense and his face extremely serious and alert.<br/><br/>He could handle a dozen ordinary people.<br/><br/>But the man facing him was clearly an unreasonable madman.<br/><br/>As Li Dayou approached with the iron rod, Xiao Siqian rushed forward. With a swift movement, he dashed past Li Dayou’s shoulder, raised his arm, and chopped with his palm at Li Dayou’s wrist.<br/><br/>“Clang!”<br/><br/>The iron rod in Li Dayou’s hand was instantly knocked down. Xiao Jinli swiftly picked it up and quickly retreated a few steps, both of them working in perfect harmony.<br/><br/>Seeing that Li Dayou no longer held the iron rod, everyone breathed a sigh of relief.<br/><br/>Without the iron rod, Li Dayou’s danger and threat were greatly reduced.<br/><br/>With so many people, they could suppress even the most frenzied Li Dayou.<br/><br/>However, people also looked at Xiao Siqian with strange eyes.<br/><br/>The young man was really brave.<br/><br/>Moreover, his skills were good; otherwise, he couldn’t have knocked the iron rod out of Li Dayou’s hand so easily.<br/><br/>After having the iron rod taken away by that cursed girl, and having lost his sanity, Li Dayou’s only thought now was to kill her. If she died, no one would pursue Zhou Hongxiu’s whereabouts any further.<br/><br/>His expression was chaotic and he struggled constantly, trying to break free of Xiao Siqian’s hold. But the other man’s strength was clearly greater.<br/><br/>Xiao Jinli held the iron rod, weighed it, and then solemnly said to Chief Li, “Kick down the door.”<br/><br/>Chief Li’s expression hesitated for a moment, but before he could react, Xiao Jinli raised her leg and kicked the door hard. Everyone heard a “crack” sound.<br/><br/>Obviously, the door was broken.<br/><br/>The villagers of Li Village were shocked by Xiao Jinli’s foot strength. “This child is so strong. Her kick broke the door!”<br/><br/>“Even adults would have trouble doing that! Li Dayou’s door, although a wooden one, is still very sturdy. For us adults, it would take three or four of us to kick it down.”<br/><br/>After Xiao Jinli broke the door with a “crack,” she immediately kicked it again with her second kick.<br/><br/>With a thud, half of the wooden door was cracked open. Then, a nauseating smell wafted out from inside the house.<br/><br/>This stench completely masked the smell in the courtyard.<br/><br/>“Ugh…”<br/><br/>Many people couldn’t stand the stench, and immediately vomited.<br/><br/>“It’s so stinky!” “How can it smell so bad?”<br/><br/>“It’s too stinky.”<br/><br/>Everyone covered their noses and exclaimed incredulously.<br/><br/>Xiao Jinli also covered her nose as the stench overwhelmed her.<br/><br/>She then walked toward the back room with the smell guiding her.<br/><br/>Chief Li and others followed closely.<br/><br/>The house’s back room was a low building.<br/><br/>Usually, this room was used to store fertilizer, and it looked like a small septic tank.<br/><br/>That strong nauseating smell came from this septic tank.<br/><br/>Xiao Jinli pointed at the septic tank and said, “Chief Li, let someone search in there!”<br/><br/>Startled, Chief Li asked in disbelief, “Child, are you serious? Search in here?”<br/><br/>At this time, Chief Xiao spoke with a serious expression, “Li Fu, let someone take something and search.”<br/><br/>No one mentioned what they were looking for, but everyone knew what it was.<br/><br/>Chief Li’s face turned pale, he wanted to deny the truth but had to face the terrifying reality.<br/><br/>Chief Li tried to find someone to take something and search, but everyone he asked refused, their faces pale.<br/><br/>No one had the courage!<br/><br/>They were all scared too.<br/><br/>Unable to call anyone, Chief Li had no choice but to take an iron shovel from the corner, and with a village guard, proceeded together.<br/><br/>As the iron shovel and the village guard’s wooden stick went down, the stench became even more intense.<br/><br/>After a while, someone shouted in horror, “Look, what’s floating up?”<br/><br/>“Why does it look like hair?”<br/><br/>Everyone felt terror rising in their hearts!\t\t\t\t\t\t</div>", "images": {}, "success": true}