{"id": 125, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14254941.html", "title": "Chapter 125 - Chapter 125: Chapter 125: Turmoil In Harvesting From Other Villages 2 (Part 1)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 125 - Chapter 125: Chapter 125: Turmoil In Harvesting From Other Villages 2 (Part 1)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 125: Chapter 125: Turmoil in Harvesting from Other Villages 2 (Part 1)<br/><br/>Translator: 549690339<br/><br/>Li Dashan thought about it briefly and agreed.<br/><br/>After all, his rice was almost ripe, and it would only be harvested three or four days later.<br/><br/>Now that the combine harvester will go through their field with some compensation, it’s quite a good deal.<br/><br/>However, he never expected the problem to arise from Li Dashan’s wife.<br/><br/>“No, I don’t agree! Our rice is still green, cutting it now would be a waste,” Li Dashan’s wife said.<br/><br/>Xiao Wanlin frowned slightly and said, “Sister-in-law, I’ll give you some compensation.”<br/><br/>Li Dashan’s wife rolled her eyes and asked, “Oh, how much can you compensate?”<br/><br/>“Five yuan!” Xiao Wanshan estimated.<br/><br/>“Five yuan?” Li Dashan’s wife’s voice suddenly became louder, “Are you kidding? Five yuan can only buy a few pounds of food.”<br/><br/>Xiao Wanlin said, “Sister-in-law, this five yuan compensation is enough for your unripe rice.”<br/><br/>“No, five is too little,” Li Dashan’s wife disagreed, “At least fifteen… Fifteen yuan, yes, fifteen yuan.”<br/><br/>It was apparent that she was trying to take advantage.<br/><br/>However, Xiao Wanlin shook his head and said, “No, ten yuan. I can’t do more than that.”<br/><br/>Although he was helping his cousin with the work, 60 yuan per mu for the service was already very low, and he had to pay his cousin a salary – his cousin was hardly making any money.<br/><br/>If there was a high compensation for each place he passed, the loss would be too great.<br/><br/>“No, fifteen yuan.” Li Dashan’s wife was persistent, “I won’t let you pass without fifteen yuan.”<br/><br/>Li Dayou wanted fifty yuan as a compensation for crossing the field. Now she wants another fifteen yuan.<br/><br/>Was it necessary to compensate every time they went through a field?<br/><br/>How much would that cost him in a day?<br/><br/>Xiao Wanlin’s attitude became more assertive, and he directly said, “It’s not possible. If you all don’t want to make way and I have to pay a high compensation for every place I pass, I might as well not take this job.<br/><br/>Sister-in-law, your family’s rice is already almost ripe. After harvesting, you get the rice back and still demand such high compensation. This fifteen yuan could buy all of these rice. Since your village invited me to harvest, but none of you are willing to make way, then I won’t accept the work in your village.” Upon hearing Xiao Wanlin’s words, Zhou Xiuxiu’s face changed.<br/><br/>She said anxiously, “No, we have already asked you to come. You must get the work done.”<br/><br/>Xiao Wanlin spread his hands and said, “I accepted your village’s work, but the people in your village don’t make way. I have no choice. With such a big machine, it can’t fly, and I can’t carry the harvester over.”<br/><br/>Zhou Xiuxiu looked at Li Dashan’s wife and said, “Sister-in-law Lan, just let the machine pass. They will help you harvest the rice and save you some work, plus a bit of compensation. We plan to harvest all seven mu of our land with the combine harvester.”<br/><br/>However, Li Dashan’s wife still insisted, “As I said, if you want to pass, you need to compensate fifteen yuan. Without this money, I won’t let it pass.”<br/><br/>Li Dashan’s wife’s insistence on fifteen yuan was because she saw an opportunity to take advantage.<br/><br/>The property was still theirs, and they could get extra money effortlessly. Such good fortune doesn’t come by every day.<br/><br/>All the paths to Zhou Xiu’s rice field required high-priced compensation from both families.<br/><br/>Someone suggested, “I think we should do this: let Master Xiao pay half and Zhou Xiu’s family pay half. If we keep this stalemate, the sun will be at its highest.”<br/><br/>This proposal was immediately echoed by some people.<br/><br/>“I think this is feasible.”<br/><br/>But Zhou Xiu disagreed.<br/><br/>She said, “No, why should I pay this money? I invited people to come for the harvest and already paid.”<br/><br/>The meaning behind her words, was that this money had to come from Xiao Wanlin.<br/><br/>Xiao Wanlin looked around, feeling the irony.<br/><br/>People in Li Village were somewhat selfish and greedy, unlike Xiao Family Village, where unity and harmony prevailed.<br/><br/>He smiled and said, “If that’s the case, I won’t take your business.”<br/><br/>Li Village’s land was like Xiao Family Village’s, where each family’s land was scattered.<br/><br/>Having finished harvesting this field, they had to move on to the next.<br/><br/>If they were successfully imposed upon this time, would they have to pay a high price every time they passed a field? Would there be any profit for his cousin?<br/><br/>His cousin Xiao Wanshan’s family did have some money, but they bought the harvester to make things more convenient for the people of Xiao Family Village, not to allow people from other villages to take advantage.<br/><br/>After finishing speaking, Xiao Wanlin turned around, intending to leave.<br/><br/>Zhou Xiu’s husband’s face changed, and he immediately shouted, “Xiao Wanlin, you can’t leave! How will we harvest our rice if you leave?”<br/><br/>Xiao Wanlin laughed and said, “How else can you harvest? You can still do it the way you used to – before, didn’t you always hire people to work? You can do that now. When I accepted your village’s job, I didn’t expect the road toll to be so high. My cousin runs a small business and can’t afford to make a loss.”<br/><br/>Everyone understood what he meant by saying this: he was mocking the villagers for being greedy.<br/><br/>“Ah, Wanlin, it’s just a misunderstanding,” the Village Head said with a smile, “Both Dayou and Dashan just feel bad about the things being wasted in their fields.”<br/><br/>Xiao Wanlin nodded and said, “You’re right, so I choose not to waste any more.<br/><br/>That way, they won’t have to feel bad. Village Head, I’m leaving.”<br/><br/>Zhou Xiu’s face immediately became ugly. She walked over and grabbed his clothes, shouting, “No, you can’t go now. You’ve come here, and you must harvest the rice in my field.”<br/><br/>Xiao Wanlin’s face darkened immediately, “Zhou Xiu, you have to understand, it’s not that I won’t harvest, but the road fees to your field are too high; I can’t afford them.”<br/><br/>Zhou Xiu turned her head and yelled at Li Dashan’s wife, “Zhou Lan, your land is not made of gold or silver. What’s the big deal about letting the machine pass? You don’t lose much. Don’t be so overbearing.”<br/><br/>Li Dashan’s wife angrily replied, “Zhou Xiu, of course you don’t care because it’s not your field that’s being wasted. I told you fifteen yuan is fine, but now, no matter how much you pay, I won’t let the machine pass.”<br/><br/>Zhou Xiu’s husband pursed his lips and looked at Li Dashan, shouting loudly, “Li Dashan, are you going to let your wife make a scene? Our families have no ill will towards each other, right? Can’t we make it easier for our rice harvest today?”<br/><br/>Li Dashan just wanted to take advantage, so he let his wife make a fuss.<br/><br/>But now that people were questioning him face to face, he just couldn’t stand it anymore.<br/><br/>He yelled at his own wife, “Stop it! Let the machine pass.”<br/><br/>He then looked at Xiao Wanlin and said, “You said five yuan for compensation, is that a deal?”<br/><br/>Xiao Wanlin nodded, “Hmm.”<br/><br/>“Alright, then let it pass..”\t\t\t\t\t\t</div>", "images": {}, "success": true}