{"id": 139, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298126.html", "title": "Chapter 139 - Chapter 139: Chapter 139: Entering Red Peak Mountain Again (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 139 - Chapter 139: Chapter 139: Entering Red Peak Mountain Again (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 139: Chapter 139: Entering Red Peak Mountain Again (First Update)<br/><br/>Translator: 549690339<br/><br/>“Little Sister Jinli, where are you going?”<br/><br/>Xiao Jinli planned to go to Red Peak Mountain and was stopped by Xiao Siqian. Xiao Jinli said, “I want to go to Red Peak Mountain. Are you coming?” “Red Peak Mountain?” Xiao Siqian was a little puzzled, “Then I’ll go with you.”<br/><br/>He had heard from the villagers that he was brought down from Red Peak Mountain by Xiao Jinli.<br/><br/>Red Peak Mountain is the highest peak in the area, with various ferocious beasts in the forests, even wild boars and tigers are considered common here.<br/><br/>It is said that hunters dare not venture deep into Red Peak Mountain, only hunting other wild animals in the perimeter.<br/><br/>Of course, at this time and age, hunting is prohibited.<br/><br/>However, it is said that Xiao Jinli goes in and out of Red Peak Mountain as if it were uninhabited. Except for herself, nobody knows why it is so.<br/><br/>Xiao Jinli nodded, “Then let’s go.”<br/><br/>Xiao Siqian’s heart itched to explore Red Peak Mountain, and he really wanted to know what kind of great mountain was it after all?<br/><br/>At first, how did he escape there? Were those four fierce kidnappers disappeared there?<br/><br/>Moreover, how did he manage to survive?<br/><br/>All these questions almost made him run to Red Peak Mountain to investigate.<br/><br/>But considering how difficult it was for him to survive, he couldn’t risk it.<br/><br/>What’s more, he still has to save his life to take revenge, right?<br/><br/>He also needed to save his life to investigate the cause of his mother Xia Zhi Meng’s death.<br/><br/>In the past, he was young and fooled by those so-called relatives, believing that his mother had depression and jumped to her death.<br/><br/>In the past, he was immersed in the lies concocted by the trio and never thought about the cause of his mother’s death.<br/><br/>But after being kidnapped, his head was suddenly awakened.<br/><br/>For example, why would his mother have depression? That big brother of his, one look and he’s 70% to 80% similar to his father, obviously his father’s seed,<br/><br/>yet he never doubted it.<br/><br/>However, he’s even more curious now, how did he manage to survive after all?<br/><br/>Maybe only by going to Red Peak Mountain can he find the answers.<br/><br/>Xiao Jinli and Xiao Siqian greeted people along the way, and when Xiao Jinli said they were going to Red Peak Mountain, people immediately reserved wild game.<br/><br/>“Jinli, if you can find a wild rabbit this time, save one for me.” “Jinli, if you find a wild chicken, save one for me.”<br/><br/>Xiao Siqian,         ‘ Picking up wild game, can one predict the future?<br/><br/>However, when Xiao Siqian followed Xiao Jinli into Red Peak Mountain, a scene that left him dumbfounded emerged.<br/><br/>As soon as Xiao Jinli entered the mountain, the animals, even the snakes on the ground and the insects lying on the leaves, were panic-stricken and fled helter-skelter.<br/><br/>But Xiao Jinli isn’t the king of animals, right? He had witnessed how welcome she was by dogs and even poultry in the village.<br/><br/>Why would it be the opposite here?<br/><br/>Xiao Siqian didn’t know that at this moment, Xiao Jinli had slightly exerted her pressure, making those little things feel immediate stress and flee in an instant.<br/><br/>On the contrary, if she wanted the animals to be close, all she had to do was to withdraw this pressure and release a little Spiritual Spring Aura.<br/><br/>After a while, the entire mountain forest became extremely quiet, even the sound of insects chirping disappeared at this moment.<br/><br/>However, while walking on the quiet forest path, they would occasionally encounter villagers’ common wild game, such as wild chickens and rabbits stunned by collisions.<br/><br/>Xiao Siqian,<br/><br/>He finally understood why the villagers had rushed to preorder these wild games from Jinli. So Xiao Jinli, this little lucky star, really was a Lucky Star. She could find all kinds of wild game just by going up a mountain.<br/><br/>Xiao Siqian was holding a fainted wild rabbit and a struggling wild chicken and said with a smile, “Little sister Jinli, is this considered guarding a tree to wait for rabbits? Oh, no, guarding a tree to wait for rabbits requires actually waiting by a stump. We’re just picking up ready-made ones. Hehe, now we have wild chicken and wild rabbit to eat. But how do we eat this wild rabbit?”<br/><br/>Xiao Jinli said, “What kind of cooking do you want? Braised wild rabbit? Dry pot wild rabbit? Or spicy wild rabbit?”<br/><br/>After hearing this, Xiao Siqian swallowed his saliva and said, “Hmm, actually, all of them are fine. I think with aunt’s cooking skills, this wild rabbit should taste great no matter how it’s cooked.”<br/><br/>Xiao Jinli nodded and said, “That’s right, my mom’s culinary skills are unmatched even by Michelin Chefs. A simple home-cooked dish can become incredibly delicious in her hands.”<br/><br/>Speaking of which, she turned her head to look at Xiao Siqian and said with a smile, “If you want to try all the different ways to cook a wild rabbit, you can catch a few more wild rabbits and raise them first.<br/><br/>“Catch wild rabbits?” Xiao Siqian’s eyes suddenly lit up, and he looked slightly excited, “Can I?”<br/><br/>Xiao Jinli nodded, “Of course! Come on, follow me!”<br/><br/>Xiao Siqian followed her and saw her skillfully finding several rabbit holes and then found three or four wild rabbits.<br/><br/>When these wild rabbits suddenly saw a person, they were frightened and wanted to escape, but Xiao Jinli caught them with quick and agile movements.<br/><br/>Xiao Siqian held four lively jumping wild rabbits in his hands, and curiously asked, “How did you know about these rabbit burrows?”<br/><br/>Xiao Jinli said, “I am very familiar with this area, so naturally I know.” Of course, the source of her knowledge could not be revealed to Xiao Siqian.<br/><br/>Xiao Siqian asked in amazement, “I heard that Red Peak Mountain is full of dangers. How come for you it’s like your backyard garden?”<br/><br/>Xiao Jinli shrugged her shoulders and said with a smile, “Don’t I have the God of Fortune to protect me? So, there’s nothing in this mountain forest that can harm me.”<br/><br/>Xiao Siqian, “…” As someone who grew up with a scientific modern education, could he believe this? Maybe it could only deceive three-year-old children.<br/><br/>However, it must be that Xiao Jinli’s numerous miracles convinced the villagers of Xiao Family Village that she was indeed a Lucky Star.<br/><br/>He didn’t need to figure everything out.<br/><br/>Thinking of this, Xiao Siqian couldn’t help but show a helpless smile.<br/><br/>The more he interacted with Xiao Jinli, the more he felt her exceptional mystery.<br/><br/>But he couldn’t explore further.<br/><br/>After the two of them caught a few wild rabbits, Xiao Jinli found some delicious wild fruits along the way, and they walked towards the mountain top while eating wild fruits.<br/><br/>Xiao Siqian, “…” He suddenly felt that this kind of life was so comfortable and enviable.<br/><br/>If Xiao Jinli’s age were ignored, nobody would treat her like a child.<br/><br/>Soon, Xiao Siqian followed Xiao Jinli to the mountain top.<br/><br/>Upon reaching the mountain top, the first thing that caught his eye was a towering pine tree with dense branches and leaves of lush greenery. It was a magnificent sight to behold.<br/><br/>Xiao Siqian couldn’t help but exclaim, “This pine tree is so beautiful! Haven’t the people from the tourism bureau discovered such a beautiful pine tree?”<br/><br/>This pine tree held great ornamental value. If it were discovered by the Tourism Bureau, it would surely be developed.<br/><br/>Xiao Jinli smiled and said, “This is my secret base, and those people can’t find it even if they wanted to.”<br/><br/>Xiao Siqian.\t\t\t\t\t\t</div>", "images": {}, "success": true}