{"id": 130, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14261146.html", "title": "Chapter 130 - Chapter 130: Chapter 130: Two Old Women Fight (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 130 - Chapter 130: Chapter 130: Two Old Women Fight (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 130: Chapter 130: Two Old Women Fight (Second Update)<br/><br/>Translator: 549690339<br/><br/>Li Dayou’s case was quickly solved.<br/><br/>The police didn’t disclose the process of him killing his wife and child, as it was too horrifying.<br/><br/>The reason he killed his wife and child was that the child suddenly developed a high fever at night and Zhou Hongxiu woke him up to take the child to the hospital immediately.<br/><br/>Who would have thought that Dayou, being woken up in the middle of the night, would become furious and throw a punch at her head, striking a critical area, knocking her unconscious on the spot.<br/><br/>Seeing Zhou Hongxiu passed out, his anger still hadn’t subsided, and he felt very irritated, wanting to vent his violent outburst, so he got out of bed, found an axe in the woodshed, and aimed it at Zhou Hongxiu’s neck…<br/><br/>While killing Zhou Hongxiu, his son woke up from unconsciousness. Li Dayou decided to just kill his son too, once and for all.<br/><br/>Subsequently, after the murder, he regained his senses.<br/><br/>Seeing blood all over the bed and the room, he felt a moment of panic and fear, but somehow, a sense of excitement and thrill surged in his heart.<br/><br/>Afterward, he calmly handled the bodies of the mother and son, and then threw them into the septic tank.<br/><br/>The next day, he told others that his wife and child had returned to their maiden home.<br/><br/>Because Zhou Hongxiu often returned to her maiden home after being beaten, no one went to her maiden home to verify her whereabouts.<br/><br/>Although the police didn’t release the details of Li Dayou’s murder, the villagers could still vaguely guess what had happened. It was so shocking and terrifying to them.<br/><br/>Having a mentally ill murderer nearby who appeared normal made everyone’s hair stand on end. If he were to lash out at them because of a slight unhappiness, they wouldn’t even know how they’d die.<br/><br/>In front of Li Dayou’s door, officials from the Yamen and the mental hospital were about to take him away, but his parents blocked their way. Granny Li even lay on the ground, crying and shouting, “No, you can’t take my son away. If you want to take him away, you have to step over my body!”<br/><br/>Rural people, being poorly educated, believed that a killer should pay with his life!<br/><br/>Moreover, her son had killed two lives.<br/><br/>She was afraid that once her son was taken away, he would lose his life.<br/><br/>While crying out loud, she also cursed, “That Zhou Hongxiu’s a wicked woman, a curse, a harbinger of doom! My good son changed after marrying her. She ruined my son, who’s taking revenge for himself. What’s wrong with that? You can’t arrest my son; he’s a well-behaved child. Oh, why is my life so miserable? My son married a disaster, and now even in death, she won’t leave my son alone. Oh, my poor son!”<br/><br/>At this time, Zhou Hongxiu’s maiden family received the news and hurriedly rushed over, their eyes red from crying.<br/><br/>Many people couldn’t help but look down upon them with contempt.<br/><br/>Now, it’s too late to cry and regret.<br/><br/>When Zhou Hongxiu wanted to divorce in the past, her family didn’t allow it, telling her to endure the abuse and the situation would pass, even threatening to disown her if she insisted on divorcing.<br/><br/>Now it’s over, their daughter and grandson are gone from this world, forever.<br/><br/>Zhou Hongxiu’s mother got furious when she heard Li’s mother’s words. She rushed over in three steps, grabbed her by the hair, and yanked her backward, shouting loudly, “Your son’s the real curse! My daughter was fine until she married into your family, then she got beaten up every now and then. Now she’s even lost her life! I want your son to pay with his life for my daughter.”<br/><br/>With that, she raised her hand and slapped her across the face.<br/><br/>There was a loud smack.<br/><br/>Granny Li, forced to bear the violence from Zhou’s mother with her hair being pulled and her head tilted back, cursed, “Your daughter deserved to die! She was a short-lived ghost. Why the hell should my son pay with his life for her?!”<br/><br/>Zhou Hongxiu’s mother, losing all reason in her anger, shouted, “You rotten woman! No wonder your son is mentally ill; he must’ve inherited it from you! Your son deserves to die! No, the one who deserves to die the most is you! Why don’t you die and pay with your life for my daughter?!”<br/><br/>The two old women fought at the door, while the government officials looked at each other, wanting to break up the fight but not knowing how to intervene.<br/><br/>Zhou Hongxiu’s father saw Li Dayou’s father’s pale face and immediately commanded his three sons, “You guys go beat him up!”<br/><br/>The officials immediately scolded, “What do you mean, beat him up? Do you really think hitting people is not against the law? If you guys lay a hand on him, do you want to come with us to the station?”<br/><br/>Hearing that they’d be taken to the station for hitting someone, Zhou’s three brothers dared not act.<br/><br/>Seeing that the Zhou family members didn’t dare to lay a hand on him, Li Dayou’s father became emotional, pointing at them and cursing, “Come on, come on, if you have the guts, come and beat me up! If you beat me, will you pay with your life too? Zhou Wuzai, my son marrying your daughter was a mistake.<br/><br/>If I had known that marrying your daughter would cause my son to become mentally ill, I would have made them divorce early. Poor Dayou, he was a healthy young man, and because of the wrong choice of wife, disaster had struck him for his whole life. And my poor grandson, if it weren’t for Zhou Hongxiu being his mother, he wouldn’t have died. Oh, my poor son and my poor grandson!”<br/><br/>Xiao Siqian stood outside the crowd, watching the drama inside, and his eyes widened once again.<br/><br/>Wow, there really are all kinds of people in this world.<br/><br/>A son who killed his wife and child can still be pitied?<br/><br/>If pity was warranted, he shouldn’t have married in the first place.<br/><br/>Given the situation in Li’s family, whoever Dayou married would probably trigger his mental illness, and it would be a disaster no matter what.<br/><br/>Xiao Qingshan murmured softly, “Uncle Wanlin, was it worth getting beaten<br/><br/>Xiao Jinli,<br/><br/>As it stands, Xiao Wanlin should at least ask Li Dayou for medical expenses and compensation for mental damage.<br/><br/>But who would expect the other party to be a mentally ill patient who killed two people?<br/><br/>Based on the current situation, not only would the Li family not be compensating, they would probably vent their anger on Xiao Wanlin and others.<br/><br/>As two old women fought, no one stepped in. The two old men were arguing at the door, and no one tried to stop them either.<br/><br/>Since no one’s life was in danger and Li Dayou was mentally ill, who would know who he inherited his illness from? What if someone tried to intervene and suddenly encountered another mentally ill person, what would they do?\t\t\t\t\t\t</div>", "images": {}, "success": true}