{"id": 138, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298123.html", "title": "Chapter 138 - Chapter 138: Chapter 138: Inviting Shi Dajiang (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 138 - Chapter 138: Chapter 138: Inviting Shi Dajiang (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 138: Chapter 138: Inviting Shi Dajiang (Second Update)<br/><br/>Translator: 549690339<br/><br/>The power of ten miles and eight villages is really great.<br/><br/>When people found out that Wen Changsheng from Daxing Village was mixing other stuff when selling earthworms, the Xiao Family refused to buy them directly.<br/><br/>This immediately made everyone alert.<br/><br/>Those who had originally thought about asking for more money, immediately dropped the idea.<br/><br/>It’s not worth it in case they get caught; the loss will outweigh the gain.<br/><br/>So, in the following days, most of the earthworms that were brought were clean.<br/><br/>More than 100,000 earthworms were collected in just a few days.<br/><br/>“I thought it would be difficult to gather more than 100,000 earthworms, but I didn’t expect it to be this fast,” said Xiao Siqian with a smile, “I’ve tried digging earthworms in the field. I only found a few after half a day’s work. How did they find them? They can find several jin (Chinese weight unit) in a day. There are more than 1,000 earthworms in a jin, that’s several thousand of them. How many fields would they have to turn over for that? Haha, originally it was the earthworms that turned the fields, but now it’s for finding earthworms that the fields are turned.’<br/><br/>Xiao Jinli also couldn’t help but smile at this situation.<br/><br/>She said with a smile, “Indeed!”<br/><br/>Xiao Jinli came to the greenhouse, and all the more than 100,000 earthworms had been poured into the soil.<br/><br/>All these earthworms burrowed into the ground, and very few crawled out to the surface.<br/><br/>Xiao Wanshan looked at the empty ground and frowned, “Now that the earthworms are all in the ground, do you still plan to grow vegetables? If you turn the soil now, wouldn’t that turn over the earthworms too?”<br/><br/>Xiao Jinli smiled and said, “It’s okay. As long as the environment is suitable for them and they haven’t reached their lifespan, these earthworms should multiply. Of course, turning the soil directly will definitely result in some loss.”<br/><br/>Xiao Wanshan and Xiao Junxuan have been busy with the establishment of the company in the village recently.<br/><br/>Several meetings were held with the villagers to discuss this matter.<br/><br/>The autumn harvest is now complete, and what needs to be done is land consolidation, the signing of contracts, and other tedious tasks.<br/><br/>Because some new daughters-in -law in the village were unwilling to contribute their land as shares, the village head and village cadres had to compromise and let these families contribute only half of their land. Even so, some new daughters-in-law were still unwilling.<br/><br/>However, the village head said, “You only see that the old people have no land to farm, but if we succeed in growing vegetables and make money, you, the new daughters-in-law, will be blamed by your families. The old people have already conceded a step, so you, the new daughters-in-law, should also take a step back.”<br/><br/>With a serious expression, he said, “Once the company is established and everyone starts making big money, it won’t be so easy for those who didn’t join from the start to become shareholders. The value of the company will increase, and your share will definitely decrease. So, it’s better for you to think carefully. After all, this is not only a path to wealth for the village in the future but also an opportunity for you. Whether you can seize it or not depends on yourself.”<br/><br/>After hearing the village head’s words, even the unwilling new daughters-in-law had to consider the interests of their families and their future prospects.<br/><br/>If it turns out as the village head said, would they, without shares, just watch everyone else make money from growing vegetables?<br/><br/>“Dad, how is the progress of the company’s establishment?” asked Xiao Jinli.<br/><br/>Xiao Father said, “The process is ongoing. In about half a month, it should be settled. By the way, Jinli, I’ve found out about Shi Dajiang from Shigang Village. His character is decent, and I’ve talked to him. He said that as long as we let him work here with his grandson and rent out his land, he’s willing to do so. I agreed on your behalf. As for the salary, I’ve already negotiated with him. For the first three months, it’s 800 yuan per month, including food and accommodation. After three months, it will be increased to 1000 yuan. If his performance is good, the salary will continue to increase.”<br/><br/>This salary is already quite good for rural people.<br/><br/>Xiao Jinli nodded and said, “Okay, Dad, whatever you decide is fine. However, it seems that we’ll need to build a small house for him and his grandson to live in.”<br/><br/>Xiao Wanshan nodded, “Yes, I’ll talk to Xiao Jiansheng tomorrow and ask him to free up some time to help us build a small house as soon as possible.”<br/><br/>Xiao Jiansheng is a mason in Xiao Family Village.<br/><br/>When people in the village want to build a house, they would first look for him, and if he’s not available, they would look for others.<br/><br/>The very next day, Xiao Jiansheng came with his apprentice to measure the<br/><br/>size of the house.<br/><br/>The house was built outside the greenhouse, with two bedrooms, a living room, a kitchen, and a bathroom.<br/><br/>Two bedrooms were designed considering that more people might be hired in the future.<br/><br/>Xiao Jiansheng laughed and said, “Wanshan, after the house is built, I want to come and live here too. The conditions are too good.”<br/><br/>Xiao Wanshan laughed and said, “Haha, you live in a two-story house and still envy this small house? But my daughter said, since there are so many earthworms raised in the greenhouse, someone must always be watching over them. That’s why we’re hiring Shi Dajiang from Shigang Village.”<br/><br/>“Shi Dajiang?” Xiao Jiansheng asked somewhat puzzled, “The Shi Dajiang who lives with his grandson?”<br/><br/>Xiao Wanshan nodded, “Yes, that’s him. Jinli said to find him for the job.”<br/><br/>Xiao Jiansheng immediately understood Xiao Jinli’s intentions and praised, “Jinli is really a kind-hearted child. Shi Dajiang is very fortunate to have met our Jinli.”<br/><br/>In fact, when Xiao Wanshan mentioned hiring someone to guard the greenhouse, many people in the village were eyeing the position, but they did not expect that Xiao Jinli would look for someone from another village.<br/><br/>However, Xiao Jinli has always been purposeful and measured in her actions.<br/><br/>Xiao Wanshan said, “Jinli feels sorry for them and wants to help them out.” A disabled man and a child have a hard life. “But she also said that they must be of good character.”<br/><br/>“Haha, that’s right. Jinli chooses her friends based on their character,” Xiao Jiansheng laughed, “With Jinli’s help, Shi Dajiang and his grandson’s lives will definitely get better and better.”<br/><br/>The house was soon completed.<br/><br/>The house covers an area of about 40 square meters, which is not small.<br/><br/>After Xiao Wanshan left, Shi Dajiang still found it hard to believe.<br/><br/>“Grandpa, what’s wrong with you?” His five-year-old grandson looked worriedly at his dazed grandfather.<br/><br/>Shi Dajiang came to his senses, holding his grandson with tears in his eyes, and said with a choke, “Little Bao, we’ve met our benefactor. I will be able to make money now, and I can buy you meat to eat and have money to send you to school…”<br/><br/>He was both touched and grateful.<br/><br/>He never thought that by just selling a few earthworms, he would attract the attention of the other party and be offered a job.<br/><br/>His grandson, Little Bao, wiped the tears for him and said sensibly, “Grandpa, don’t cry. In the future, I will help you with the work.”<br/><br/>“Yes, yes, good!” Shi Dajiang nodded in agreement..\t\t\t\t\t\t</div>", "images": {}, "success": true}