{"id": 132, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298106.html", "title": "Chapter 132 - Chapter 132: Chapter 132: Setting Fire At Midnight (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 132 - Chapter 132: Chapter 132: Setting Fire At Midnight (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 132: Chapter 132: Setting Fire at Midnight (Second Update)<br/><br/>Translator: 549690339<br/><br/>As expected, after Li Dayou’s parents had been forcibly taken to the mental hospital, the old couple cried their hearts out for several days before resenting the meddlesome Xiao Jinli.<br/><br/>Old Mrs. Li’s eyes were filled with intense hatred, like a poisonous venom. She gritted her teeth and said venomously,<br/><br/>“It’s all that little bitch’s fault. If it weren’t for her cold and cruel heart, sticking her nose where it doesn’t belong, how could our son have been discovered to have a mental illness, or having killed that despicable couple, and then been captured by the government officials?”<br/><br/>Old Man Li’s expression was filled with raging hatred as well. “Right, it’s all her fault. If it weren’t for her, our son would still be fine, not captured.”<br/><br/>“Old man, I’m filled with hatred. I just can’t stand it. I want to kill that little bitch.” Old Mrs. Li paused for a moment, then nodded. “Yes, kill that little bitch, and let her pay with her life for our son. Humph, if our child won’t come back, then she doesn’t need to live either. Come on, old man, let’s find something to finish her off.”<br/><br/>As she spoke, her mind was empty, with the only thought being to kill the little bitch.<br/><br/>Looking at her expression, it was somewhat similar to Li Dayou’s when he had a mental breakdown.<br/><br/>Although Old Man Li was immersed in pain, he had not lost his reason. As his wife raved, he shuddered.<br/><br/>Then he said, “Old woman, don’t be impulsive, calm down! Listen to me, we mustn’t let that little bitch go, but not like this. We have to do it secretly, absolutely not letting anyone discover it. Otherwise, we will lose our lives for nothing, and it’s not worth it!”<br/><br/>Old Mrs. Li nodded. “Right, it’s not worth it! She has to pay for our son’s life,<br/><br/>but we won’t give her ours. She doesn’t deserve it.”<br/><br/>It was late into the night!<br/><br/>The pitch-black darkness offered not a single ray of light. Only the occasional insect noises by the roadside and the barking of dogs in the village broke the black silence.<br/><br/>In this darkness, a hidden couple held flashlights in one hand and an oil drum in the other, heading in the direction of Xiao Family Village.<br/><br/>The two walked on foot to a house in the village.<br/><br/>An old voice asked, “Old man, are you sure it’s this house? Are we not mistaken?”<br/><br/>The other old man replied, “I’ve checked, it’s this house.”<br/><br/>“Good, it’s this house.” The person spoke viciously. “I want their whole family to pay for our son’s life.”<br/><br/>With that, she unscrewed the oil drum’s lid and was about to pour the oil in the corner.<br/><br/>Just then, a dog rushed over and pounced on her, biting her on the leg.<br/><br/>“Ah!” The pain from the dog bite made her cry out involuntarily.<br/><br/>Another person was knocked down by the dog. The unopened oil lid fell to one side.<br/><br/>After a while, more than ten dogs surrounded the old couple, barking at them.<br/><br/>The barking awakened the people inside the house.<br/><br/>With the lights turned on inside, Xiao Junxuan rushed out and opened the courtyard lights and the gate, puzzled at the sight of the strangers surrounded by more than ten dogs. “Who are you? What are you doing in front of my house so late?”<br/><br/>He swept his flashlight and spotted the oil drums. He sniffed the air, and his face suddenly changed. He picked up the open oil drum, and its smell made him furiously ask, “Are you pouring gasoline in front of my house?”<br/><br/>As soon as Xiao Junxuan finished, Xiao Wanshan came out wearing his coat. Hearing his son’s words, his face changed drastically. He hurried over, smelled the gasoline, and immediately shouted, “Who are you, and what are you doing pouring gasoline in front of my house? Are you trying to set a fire?”<br/><br/>The house doused in gasoline could catch fire in an instant, especially during this dry season. Not only would the house burn, but it was uncertain if his family could escape the flames.<br/><br/>Xiao Wanshan shuddered at this thought.<br/><br/>If it weren’t for the dogs discovering these two ill-intentioned old people, the consequences would have been unimaginable.<br/><br/>“Dad, I recognize them. They’re the parents of Li Dayou from Li Village!” Xiao Jinli came out wearing a coat, her expression slightly serious.<br/><br/>“Li Dayou?” Xiao Wanshan was slightly taken aback, then reacted, “The mentally ill murderer?”<br/><br/>Old Mrs. Li was infuriated by the reference to her son’s mental illness and murder, her eyes red with anger. “You are the mentally ill ones. Your entire family is mentally ill! My son is a good boy, you are the mentally ill ones, you are the murderers!” She yelled.<br/><br/>As she spoke, she tried to push away the dog, stand up, and pounce at Xiao Wanshan, as if she wanted to tear him to pieces.<br/><br/>Xiao Wanshan furrowed his brow and said to Xiao Junxuan, “Xuan’er, call the police! Also, inform the Village Head to call someone from Li Village!”<br/><br/>“Alright, Dad!” Xiao Junxuan replied, running to get his phone from the house. He called the police and went to find the Village Head.<br/><br/>Someone trying to set fire to their house was no small matter.<br/><br/>However, before Xiao Junxuan could bring people back, villagers wearing coats started arriving, following the sounds of the barking dogs.<br/><br/>After all, everyone in the village knew that the dogs generally wouldn’t bark if nothing was amiss.<br/><br/>The dogs were well-behaved and wouldn’t disrupt the villagers’ sleep under normal circumstances.<br/><br/>Xiao Junxuan told the Village Head about the situation on the way, making him furious.<br/><br/>He went back to his house and called a relative from Li Village.<br/><br/>By the time they arrived at the Xiao Family, quite a few villagers had already gathered.<br/><br/>“So they are the parents of the mentally ill murderer from Li Village? I can’t believe mental illness runs in their family. Late into the night, they come to someone’s house to set a fire. Luckily, the dogs discovered them, or the consequences would’ve been unimaginable.”<br/><br/>“Yeah, when Li Dayou was taken away, many people were speculating who he inherited his mental illness from. Well, it looks like it came from his parents.”<br/><br/>“I think they want to take revenge on Jinli.”<br/><br/>“I think they want to take revenge on Jinli, too. Humph, they only have themselves to blame since their own son has a mental illness and killed people.<br/><br/>It’s unreasonable to take it out on others.”<br/><br/>“You can’t reason with a family of madmen!”<br/><br/>The mention of her son as a mentally ill murderer over and over had driven Old Mrs. Li to the brink of insanity, her eyes blazing red with vengeance. She stared hatefully at Xiao Jinli and angrily said, “If it weren’t for her, my son wouldn’t have been found out about his mental illness, and he wouldn’t have been found to have killed someone. He would still be fine. It’s all her fault; it’s all her fault.. You little bitch, why don’t you go die!”\t\t\t\t\t\t</div>", "images": {}, "success": true}