{"id": 131, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14261147.html", "title": "Chapter 131 - Chapter 131: Chapter 131: Ten Miles And Eight Villages Buzzing With Discussion (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 131 - Chapter 131: Chapter 131: Ten Miles And Eight Villages Buzzing With Discussion (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 131: Chapter 131: Ten Miles and Eight Villages Buzzing with Discussion (First Update)<br/><br/>Translator: 549690339<br/><br/>The mental illness murder case in Li Village shocked the surrounding villages.<br/><br/>“Did you hear? There’s a mentally ill person in Li Village who killed his wife and child in the middle of the night.”<br/><br/>“I heard. They say that in the middle of the night, the madman took up an axe from the firewood room and chopped his wife in bed. Oh my, it’s so terrifying!”<br/><br/>An old woman slapped her chest and said, “That man once came to my house to find a match for my daughter. Our whole family agreed, but my daughter didn’t because she had a bad feeling about him.<br/><br/>At the time, I thought my daughter was overthinking it. He seemed like a handsome and sincere young man with a good family background, and he smiled at everyone. How could she have a bad feeling about him?<br/><br/>However, since my daughter disagreed, we couldn’t persuade her otherwise. Looking back, fortunately, my daughter didn’t agree. If she had married that man, I would have cried myself to death.”<br/><br/>Their family loved their daughter so much.<br/><br/>When they thought about her marrying a mentally ill man who would beat her every day and suddenly kill her in the middle of the night, they couldn’t help but shudder with fear.<br/><br/>“Hey, I heard his wife was from Zhou Village. After the first time the girl was beaten by him, she went back to her maiden home crying and wanted a divorce.<br/><br/>It was her family who stopped her, saying that it would bring shame to them. They told her to just endure it. It will pass… What kind of parents would do that? They knew their daughter was mistreated and beaten, but they just told her to endure it. Now look at the consequences, she even lost her life because she endured it.”<br/><br/>“Yeah, I heard that the parents in Zhou Village are now crying every day, regretting not letting their daughter get a divorce earlier. If they had agreed to the divorce, their daughter wouldn’t have died.”<br/><br/>“Hmph, what’s the use of crying now? If you ask me, when the madman first beat his wife, her parents should have taken action and beaten him back into submission. If they had, he would have been too afraid to try it again.”<br/><br/>“But, on the other hand, the man is a lunatic. I heard that when they have an episode, they don’t remember anything. Even if you beat him up, the next time he has an episode, he’ll still beat his wife and children. Alas, the most unfortunate thing was the child; I heard they were only five years old.”<br/><br/>“I heard that mental illness is hereditary. Who did this lunatic inherit it from?<br/><br/>And how come his parents didn’t protect their only grandson better?”<br/><br/>“Their family is really odd, they only treasure their son and treat their grandson like a stray. Now their grandson is gone, their son is arrested, and the two old folks are left crying every day.”<br/><br/>“I heard they also have a daughter who is married to another village. When that family heard their son was mentally ill and killed people in the middle of the night, they were afraid that their daughter might also have mental illness and suddenly attack her husband and kids in the middle of the night. So they quickly got a divorce and kicked her out.”<br/><br/>“I can understand their decision. After all, having a mentally ill brother who beats and kills people would make anyone feel uneasy. Who knows if she herself has a mental illness? What if she ends up like her brother and kills someone? That would be bringing disaster upon her own family.”<br/><br/>“I’ve seen a few people with mental illnesses, but their symptoms were relatively mild. When they are provoked, they might have an occasional outburst but they only scold people, not attack them. The lunatic in Li Village, on the other hand, has a very severe condition.” “Of course, otherwise he wouldn’t kill in the middle of the night.”<br/><br/>Xiao Family Village also discussed the matter.<br/><br/>“Xiao Wanlin went to Li Village to harvest rice and ended up uncovering a murderer. It’s really terrifying.”<br/><br/>“Yeah, I heard that the incident happened because the machine was passing through the madman’s field, and wanted to charge 50 yuan but he refused. So, I guess that’s what triggered Li Dayou’s mental illness, and he attacked Xiao Wanlin after he finished harvesting.”<br/><br/>“Fortunately, when he attacked Xiao Wanlin, he used his fists, so it was just some external injuries, considered a minor injury. If he had picked up something, like a hoe or a knife, it would have been unimaginable. After all, a madman has no rationality.”<br/><br/>“Yeah, that’s true. It’s really a blessing in disguise. But I heard that it was Jinli who first noticed that Li Dayou was not normal, and suspected that something might have happened to his wife and children, so she suggested going to his house to check.”<br/><br/>“However, at that time, Li Dayou was provoked and tried to attack Jinli two or three times. Luckily, Xiao Siqian was able to kick him away with his excellent martial arts skills. Madmen, they’re just madmen! They don’t care who they hurt, even if it’s a young girl.”<br/><br/>“Sigh, I never heard anything about Li Dayou being mentally ill before. It’s said that he only developed the illness after getting married. Many men would beat their wives and children when they got drunk, but Li Dayou didn’t even drink. As soon as he became unhappy, he would beat his wife and children. It was said that during the most severe beating, he broke several ribs of her body and refused to let her go to the hospital. She lied at home for more than half a month and had to endure the pain while working after she recovered.” “Poor woman. Being beaten so badly, why didn’t she just divorce him?”<br/><br/>“I heard her parents didn’t allow it, saying her divorce would bring shame to her family, making it difficult for their younger son to find a wife.”<br/><br/>“What a joke, it’s not the olden days anymore. Why would divorce be so shameful? If it were my daughter being beaten, I would certainly ask them to get a divorce. Such domestic violence will happen again and again. If you don’t care for your daughter, who will? Now, their daughter is dead, and their younger son will certainly find it even more difficult to get married.”<br/><br/>“Absolutely. Anyone who loves their daughter wouldn’t want her to marry into such a family. If you marry into that family and give birth to a boy, it might be fine. But what if you give birth to a daughter? They don’t prioritize their daughters.”<br/><br/>“That’s right. If her parents had cared for their daughter from the beginning and stood up for her, the result wouldn’t be like this now. Because they didn’t agree to the divorce, she lost her life.”<br/><br/>“Since Jinli figured out that Li Dayou was mentally ill and exposed the murder, Li Family might take their hatred out on Jinli. After all, those people are madmen who know no reason.”<br/><br/>“That’s actually quite possible. We need to remind Wanshan and his family to be cautious of Li Family. Who knows what they’ll do to Jinli.”<br/><br/>With that, a few villagers went to Xiao Wanshan’s house to remind him about this issue.<br/><br/>Xiao Jinli, “…” Actually, there’s no need to remind her. The old Li couple couldn’t do anything to her anyway.<br/><br/>Nevertheless, she appreciated the villagers’ concern and advice..\t\t\t\t\t\t</div>", "images": {}, "success": true}