{"id": 135, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298114.html", "title": "Chapter 135 - Chapter 135: Chapter 135: Earthworm Larvae (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 135 - Chapter 135: Chapter 135: Earthworm Larvae (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 135: Chapter 135: Earthworm Larvae (First update)<br/><br/>Translator: 549690339<br/><br/>When asked about earthworm larvae, Xiao Jinli raised an eyebrow and replied smilingly, “The earthworm larvae I originally found were actually ordinary earthworms I dug up from the ground. I cut them in half, and one earthworm became two. Through cultivation, they grew into these big earthworms!”<br/><br/>Having heard Xiao Jinli’s explanation, Xiao Wanshan laughed and said, “So that’s how it was. I wondered why so many earthworms suddenly appeared in your greenhouse. It turns out you dug them all up from the ground.”<br/><br/>Xiao Jinli nodded and said, “Yes. I even got the kids to help dig them up.”<br/><br/>Xiao Wanshan nodded and said, “Hmm, the kids in the village do listen to you. We could have them dig up the earthworm larvae for the five acres of land then.”<br/><br/>Ordinary earthworms can’t do much besides loosening the soil. Only Xiao Jinli’s cultivated earthworms could increase soil nutrients and improve crop growth. Xiao Junxuan, listening to the father-daughter conversation, gave a slight frown and asked, “How many earthworm larvae would we need for over five acres of land?”<br/><br/>Xiao Jinli smiled and said, “I’ve estimated that we would need about twenty thousand larvae per acre of land.”<br/><br/>“Twenty thousand? That would mean almost a hundred thousand for over five acres of land, right?” Xiao Junxuan said with a furrowed brow, “Where could we possibly find so many? Even if we turned the whole Xiao Family Village upside down, we couldn’t find that many!”<br/><br/>But no sooner had he spoken, than his father smacked him on the head.<br/><br/>Xiao Father retorted grumpily, “You dolt! Do we absolutely have to find them in Xiao Family Village? Once we are ready to pay, someone will find the earthworms for us!”<br/><br/>At his father’s words, Xiao Junxuan finally understood.<br/><br/>He chuckled and slapped his forehead exclaiming, “Haha, that’s true indeed.”<br/><br/>Then he turned to Xiao Jinli and said, “Sister, I’ll go find people and discuss this with them. Oh, by the way, sister, how do you plan to purchase the earthworms? By count or by weight?” Xiao Jinli replied, “By weight!”<br/><br/>By count would be too troublesome.<br/><br/>“By weight, the price is a bit high.” Xiao Jinli thought for a moment and said, “How about one hundred yuan per jin?”<br/><br/>“Haha, one hundred yuan per jin? Isn’t that a bit too much?” Xiao Junxuan replied, “How many jins do we need for these hundred thousand earthworms?”<br/><br/>Xiao Jinli responded, “We can first see how many earthworms there are in a jin, and then give an approximate estimation.”<br/><br/>Xiao Junxuan nodded and said, “Alright, I got it. I’m going to spread the word right now.”<br/><br/>Communication was quite advanced nowadays. One phone call and many people would immediately get the news.<br/><br/>Therefore, everyone in this ten miles and eight villages radius knew that someone from Xiao Family Village was purchasing earthworms.<br/><br/>“Xiao Family Village is buying earthworms at one hundred yuan per jin, which is a pretty good price. Since we have nothing to do, let’s go find some earthworms,” said one villager.<br/><br/>“Haha, I’m also going to find earthworms. If I can dig up one jin, that’s one hundred yuan. But I heard that they only want live earthworms, dead ones don’t count.” said another.<br/><br/>“Dead earthworms mixed in with the live ones? Who would know which is dead or alive without picking through them one by one? Moreover, it’s not easy to find dead earthworms at all. It would be easier to find live ones though.” another villager piped in.<br/><br/>“That’s true. Most of the ones you dig up from the ground are alive.”<br/><br/>“But I heard someone in Xiao Family Village raises earthworms. Why are they still buying from the outside?” a villager chimed in.<br/><br/>“I’ve heard about that. The person raising earthworms plans to expand the cultivation area and needs a lot of earthworm larvae. And these larvae are supposed to be directly dug up from the ground.”<br/><br/>“Isn’t it strange? They raise earthworms, but they are also required from various places. I thought they had specific technology to breed earthworm larvae. I’ve heard that the earthworms this person is raising are as thick as our pinky fingers, as long as chopsticks, like small snakes. I thought they had some special way to breed them.” another villager discussed.<br/><br/>“The person raising earthworms in Xiao Family Village buys the larvae, raises them, and then sells them on to other farmers for use in their fields. The crops grown on land with these earthworms, be they vegetables or fruits, are excellent.”<br/><br/>“Yes, that’s right. I heard that the entire Xiao Family Village plans to start farming fruits and vegetables next year.”<br/><br/>“Ha, the entire village farming fruits and vegetables? Are they not going to grow rice anymore?”<br/><br/>“Whether or not they’ll grow rice, I’m not sure. But I heard from a relative in Xiao Family Village that next year, they even plan to set up a company. Every household in the village will have shares in the company.”<br/><br/>“One village setting up a company where every family has a stake, is that even possible? I’ve never heard of a company like that. Usually, whoever invests money owns the company. Could a company really have so many shareholders?<br/><br/>Does that mean every family has invested some money?”<br/><br/>“No, it’s not about investing money, they would use their own land as stock.<br/><br/>The number of shares each family would get in the company would depend on the amount of land they put in. Sigh, I don’t understand the details.”<br/><br/>“Using their land as stock, how does that work? And does that mean the land will no longer belong to them afterward? If a family no longer owns any land, what will happen to the elderly in the village? Also, if the younger generation no longer works and the family has no land or income, what will happen then?”<br/><br/>For the older generation, land was what they relied on for survival. Without this foundation, what would they do in the future?<br/><br/>“I heard it’s not that simple.”<br/><br/>“It’s not that, then what is it?”<br/><br/>“I don’t know about that. But I heard that they decided to set up a company and have the entire village farm fruits and vegetables because of a kid’s suggestion. The new daughters-in-law who married into the village thought it was a bit outrageous. Therefore, many people disagreed with becoming shareholders in this way and even threatened to divorce.”<br/><br/>“Ha, are you serious? Forming a company just based on the words of a child? Isn’t that a bit ridiculous? Forming a company requires money, you know? And if the entire village starts farming fruits and vegetables instead of rice, where would they go to farm rice then? Would they go buy it? If so, wouldn’t that be a major expense? Moreover, if the entire village farms vegetables and they produce too much, where would they sell all that? What if they can’t sell them and the village suffers a great loss? Who will be responsible for that?”<br/><br/>“You’re right. But, everyone in Xiao Family Village, old or young, all listen to that kid. The new daughters-in-law who married into the family still can’t believe it. Therefore, they do not agree to gamble with their own lands and some even threatened to divorce.”<br/><br/>“Even I find it absurd. Relying on a child’s word, the entire village would farm vegetables and set up a company? Is this some kind of child’s play? If they make a loss, who is going to compensate for that loss? The kid?”<br/><br/>“Well, whatever they do in their village, we just need to watch. Haha, if they end up producing too much and can’t sell their vegetables, it would be a big joke across all the villages in this ten miles and eight villages radius. However, that they’re buying earthworms benefits us.”<br/><br/>“Hehe, you’re right..”\t\t\t\t\t\t</div>", "images": {}, "success": true}