{"id": 133, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298108.html", "title": "Chapter 133 - Chapter 133: Chapter 133: Crazy Woman (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 133 - Chapter 133: Chapter 133: Crazy Woman (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 133: Chapter 133: Crazy Woman (First Update)<br/><br/>Translator: 549690339<br/><br/>Li Dayou’s parents even wanted to set fire to Xiao Wanshan’s house.<br/><br/>When the people of Xiao Family Village received this news, they couldn’t help but panic!<br/><br/>“Madman, he’s definitely a madman! No wonder Li Dayou is mentally ill, it must be inherited from his parents.”<br/><br/>“Their son killed someone, and they blamed Jinli for being gossipy, which is completely unreasonable. They even wanted to take revenge on Jinli and make her pay with her life for their son Li Dayou. It’s really… really… terrifying.”<br/><br/>“This mental illness is indeed terrifying. In the future, even if my son can’t find a wife, I won’t let him marry someone with a mental illness.”<br/><br/>“And for our daughters, even if they can’t get married, we won’t marry them off to a madman. It’s too scary, not to mention the domestic violence they might endure, and no knowing when their life could be in danger.”<br/><br/>“Fortunately, the dogs discovered these two old folks, otherwise, once the gasoline was poured and the fire lit, the consequences would be unimaginable.”<br/><br/>“These two old madmen, their whole family are lunatics and murderers!” the villagers angrily scolded.<br/><br/>Old Man Li and Old Mrs. Li were surrounded by dogs and villagers in the middle, unable to escape.<br/><br/>With pale faces and hatred in their eyes, Old Mrs. Li said resentfully, “You’re the madmen, all of you are madmen. If it weren’t for that damn girl, my son wouldn’t have been caught. I wish I could cut her to pieces.”<br/><br/>As Old Mrs. Li spoke, she angrily pointed at Xiao Jinli, continuing her resentful tirade, “What grudge did my son have against this damn girl? She gossiped and harmed my son, and she’s a wicked person with bad intentions. I wish she would die now.”<br/><br/>“Shut up!” Xiao Wanshan couldn’t bear to hear someone curse his precious daughter so viciously, and he angrily said, “It was your own son who went crazy and became a murderer. Who else can you blame? Even if my Little Bao did talk too much, do you think your son’s act of murdering his wife and child<br/><br/>wouldn’t be discovered? It’s useless to blame anyone else since you didn’t raise your child well and let him become a killer.”<br/><br/>“Exactly, now they still have the nerve to come here and set fires. That must be an inherited problem. They really have the audacity to blame others.”<br/><br/>“Oh, I can’t take it anymore, I’m going to die from being bullied, boo hoo… Why am I so unfortunate? My only son has been killed, and I can’t take revenge…” Old Mrs. Li cried out loud.<br/><br/>However, no one paid attention to them, showing indifference and coldly watching from the side.<br/><br/>As long as they didn’t let them escape under their watch, it didn’t matter how much they cursed or cried. Besides, with so many people, there was no need to fear them.<br/><br/>Xiao’s Mother came out, saw the gasoline on the ground that hadn’t been poured, and trembled in fear and shock.<br/><br/>How could these two people be so evil, coming here to set fire in the late night?<br/><br/>Fortunately, they were discovered. Otherwise, if the house had caught fire, they wouldn’t even know if their family could escape.<br/><br/>Xiao Jinli looked at her mother’s pale face, held her cold hand, and immediately comforted her, “Mom, we’re fine now. Don’t worry! Weren’t these two arsonists discovered by the dogs? They will face severe punishment.”<br/><br/>Xiao’s Mother’s teeth chattered, “If it weren’t for the dogs, would they have succeeded? I’m scared when I think about the consequences. Jinli, how can they be so evil? How can they be so evil?”<br/><br/>Xiao Jinli said, “Mom, they’re mentally ill in the first place. A mentally ill person does things without reason or logic. Mom, don’t worry, we’ve caught them this time, and they’ll never have a chance to hurt anyone again in the future.”<br/><br/>With Xiao Jinli’s continuous comfort, Xiao’s Mother’s mood gradually calmed down.<br/><br/>But her heart was still filled with some lingering fear and terror.<br/><br/>It wasn’t long before the government officials arrived.<br/><br/>At the same time, the Village Head of Li Village and a few young men also arrived.<br/><br/>Chief Li jumped out of bed in shock when he received the news, almost falling off the bed.<br/><br/>“What did you say? Li Wuqian and his wife went to Xiao Family Village to set fire?”<br/><br/>The relative who delivered the information nodded, “Yes. My Uncle just called and said so.”<br/><br/>Chief Li anxiously asked, “Is everything okay now?”<br/><br/>“Everything’s fine. Fortunately, several dogs discovered them, and they were caught red-handed before they could take action,” the relative hesitated before continuing, “My Uncle also said they’ve called the police and asked you to bring some people and hurry to Xiao Family Village.”<br/><br/>After all, it was people from Li Village who came to set the fire, so the people of Li Village must go and deal with it somehow.<br/><br/>Everyone in the village had relatives and connections, and although Li<br/><br/>Wuqian’s family only had one son, they still had a large extended family.<br/><br/>Upon hearing this, Chief Li quickly put on his clothes, took his flashlight, and went to knock on the doors of several households. Soon after, a group of people rode their motorcycles toward Xiao Family Village.<br/><br/>When the people from Li Village arrived, so did the government officials.<br/><br/>When they saw Li Wuqian and his wife surrounded by Xiao Family Village people, they all frowned, especially Old Mrs. Li who was cursing viciously.<br/><br/>Chief Li, seeing the two, angrily said, “Li Wuqian, have you two gone mad as well? In the middle of the night, you came to someone else’s house to set a fire.”<br/><br/>Li Wuqian yelled, “Yes, I’m a madman! Since my son was arrested, my wife and<br/><br/>I have gone crazy. I want their whole family to pay with their lives. Unfortunately, their family has such great luck!”<br/><br/>Hearing his words, Chief Li was trembling with anger and shouted, “Your son was already a murderer and deserved to be arrested. Why is everyone else to blame?”<br/><br/>“My son killed people, but if it weren’t for that bitch talking too much, no one would have found out about the murders. If it hadn’t been discovered, my son wouldn’t have been arrested,” Li Wuqian said resentfully, “Shouldn’t I seek revenge on her?”<br/><br/>Chief Li’s face turned green with anger at his words, he retorted, “So now that your son killed his wife and child, is he the victim? Oh, you’re mad about your son being arrested and want to set fire to kill others, but what about the family of Zhou Hongxiu who your son killed? Don’t they want revenge too? So your son is a human and other people’s daughters are not? Only you care about your son, but others don’t care about their daughters?”<br/><br/>At this point, he took a deep breath and continued, “Besides, isn’t Li Dayou’s situation now because you failed to educate him properly? In my opinion, blaming others is useless when you didn’t raise your child well.. If you had educated him well, how could he frequently beat his wife and child?”\t\t\t\t\t\t</div>", "images": {}, "success": true}