{"id": 134, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298111.html", "title": "Chapter 134 - Chapter 134: Chapter 134: Ten Miles And Eight Villages Buzzing With Discussion Again (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 134 - Chapter 134: Chapter 134: Ten Miles And Eight Villages Buzzing With Discussion Again (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 134: Chapter 134: Ten Miles and Eight Villages Buzzing with Discussion Again (Second Update)<br/><br/>Translator: 549690339<br/><br/>Upon hearing this, Old Mrs. Li seemed as if she had been ignited by a firecracker, she “swooshed” up from the ground and angrily scolded Village Chief Li, “What does how I educate my child have to do with you? Mind your own business. My son has been so well-behaved and sensible since he was little. It’s all because of that ill-fated woman, and she ruined everything. Otherwise, how could my well-behaved child ever kill her?”<br/><br/>Village Chief Li was taken aback by her twisted logic.<br/><br/>But he soon took a deep breath.<br/><br/>Forget it, Old Mrs. Li is also a mental patient.<br/><br/>What does a normal person have to quarrel with someone mentally ill?<br/><br/>Not long after the people of Li Village arrived, government officials from the<br/><br/>Yamen came.<br/><br/>Upon figuring out the situation, they didn’t discuss further, and just arrested the couple right away.<br/><br/>As Old Mrs. Li was being taken away, her cold and malicious eyes were aimed directly at Xiao Jinli. She shouted loudly, “You little wretch, you’ve ruined my son and our family, causing our family’s destruction. Even in death, I won’t let you go.”<br/><br/>Upon hearing this, Xiao Father and others were so angry that they almost went up and beat her.<br/><br/>This old witch didn’t know how to educate her children and still blamed the hatred on a child, which was completely unreasonable.<br/><br/>Xiao Jinli calmly said, “I don’t know if you’ll let me go after you die. But I do know that the law won’t let anyone go. It just so happens, Grandma, that you have mental illness, and you can stay with your son.”<br/><br/>It was not necessary to deal with such a mental patient.<br/><br/>The more attention given, the more arrogant the other party would become.<br/><br/>The second day, not only in Li Village and Xiao Family Village, but also in other surrounding villages, people heard about the arson incident of Old Mr. and Mrs. Li.<br/><br/>“Oh, it’s really terrifying. Late in the night, who would have thought that someone would set fire to their own house.”<br/><br/>“Yeah, I heard they were caught trying to pour gasoline, and because the village dogs discovered them, it attracted the attention of others. Fortunately, it was discovered in time. Otherwise, the consequences would have been unimaginable. Not only would the house be burned, but people might also be burned alive.”<br/><br/>“It’s indeed very dangerous. That Li family is full of madmen. The young one killed his wife and child, and the old ones set their house on fire. It’s a good thing they were arrested, or having such dangerous people around would be like having a bomb that could explode at any time.”<br/><br/>“It turns out that Lee Dahai’s madness was really inherited from his mother. In the past, we used to hear Old Mrs. Li talking angry and nonsense from time to time, but we didn’t think she was mentally ill.”<br/><br/>“Maybe when she was cursing, her mental illness wasn’t severe. When it gets severe, it turns into murder and arson. It’s a good thing that our family had some conflicts with them before but thought they were just problematic, so we didn’t hold a grudge afterwards. Now that I think about it, it’s really terrifying. If our conflicts had escalated, would my family be the one with the fire in the middle of the night?”<br/><br/>“It’s hard to say. Xiao Jinli from Xiao Family Village just said a few more words, and now the whole family is holding grudges against her. Otherwise, they wouldn’t have gone to someone else’s house to set fire in the middle of the night.”<br/><br/>“Speaking of that child from Xiao Family Village, I heard she is a very smart and blessed child, and people in Xiao Family Village like her very much.”<br/><br/>“But, that child is so young, how could she tell that Li Dayou had mental illness? I also heard that she was the first to suspect Li Dayou of killing his wife and child, not the village head.”<br/><br/>“I heard that the child is also very smart and capable. Do you know about Xiao Family Village’s vegetables?”<br/><br/>“Of course, I do. Now, who doesn’t know about Xiao Family Village’s vegetables in ten miles and eight villages? The hottest-selling item in the town is their vegetables. They’re quite expensive, but people at the fair are still rushing to buy.”<br/><br/>“Yeah, our small cabbage only sells for 0.50 yuan per bundle, but in their store, it sells for three to four yuan per jin. The price is high enough, but they even impose purchase restrictions, which really make people envious.”<br/><br/>“But I haven’t heard of people in Xiao Family Village being good at farming before. How did their vegetables suddenly become so good?”<br/><br/>“This has to do with that child. I heard that she is very smart and has bred a kind of earthworm. When these earthworms are placed in the ground, they not only loosen the soil but also add nutrition. So, when the vegetables are planted, they can absorb the nutrients in the soil. As a result, the vegetables are not only vibrant and full of water but also taste particularly good. Every family in<br/><br/>Xiao Family Village goes to buy some earthworms from her to grow crops. Oh, right, the Vegetable Store in the fair is also run by her.”<br/><br/>“Wow, what kind of child is that? How can she be so smart and capable? How were these earthworms bred with such a strong effect?”<br/><br/>“Who knows? If they knew, others would definitely try it too.”<br/><br/>“Yet, many people have asked about it, and they couldn’t find any key techniques.”<br/><br/>“If it were that easy to raise, it wouldn’t be left to a child to figure it out.”<br/><br/>“Hmm, I heard that the child has expanded her breeding grounds and built a greenhouse covering three to five acres directly next to the previous one.”<br/><br/>“Wow, it’s such a large area.”<br/><br/>“Yes, I heard that next year, every family in Xiao Family Village will be growing vegetables, and they are even preparing to establish a company. Therefore, they must expand their production capacity to meet the needs of all the villagers.”<br/><br/>“Would she sell the earthworms to us too?”<br/><br/>Someone shook their head, “Not really. She currently only sells to people from Xiao Family Village and a few of her relatives and friends. She doesn’t sell to regular people. ”<br/><br/>“Ah, how did you know that?”<br/><br/>“I heard it from a relative of mine in Xiao Family Village.”<br/><br/>At this moment, the child being talked about by everyone was walking in circles around the newly built greenhouse.<br/><br/>As said in the discussion, this greenhouse covers an area of five acres and is right next to the previous one.<br/><br/>For the breeding ground, a regular greenhouse was built directly.<br/><br/>Originally, Xiao Jinli wanted to build a smart greenhouse, but at this time and in such a remote countryside, it was difficult to find a company with the technology, so a regular greenhouse was built directly instead.<br/><br/>Of course, her main purpose in building the greenhouse was to cover it up.<br/><br/>Earthworm farming was also a cover-up. The main function of the earthworms was to act as a bridge.<br/><br/>However, expanding this much all at once raises the issue of earthworm seedlings..\t\t\t\t\t\t</div>", "images": {}, "success": true}