{"id": 136, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298117.html", "title": "Chapter 136 - Chapter 136: Chapter 136: Acquisition (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 136 - Chapter 136: Chapter 136: Acquisition (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 136: Chapter 136: Acquisition (Second Update)<br/><br/>Translator: 549690339<br/><br/>Xiao Jinli didn’t care about the gossip from ten miles and eight villages that was caused by her buying earthworms.<br/><br/>Her brother spread the news, and the next day, many people came with earthworms for sale.<br/><br/>Xiao Jinli looked at the buckets and plastic bags filled with wriggling earthworms, raising her eyebrows slightly.<br/><br/>It seemed that taking the initiative was indeed a good move.<br/><br/>In just one day, people had dug up several jin of earthworms.<br/><br/>Were earthworms really that easy to dig up? Xiao Jinli wondered.<br/><br/>The people bringing the earthworms were from the neighboring village.<br/><br/>An old man in his fifties or sixties with dark and honest features was accompanied by a scrawny child about four or five years old.<br/><br/>He carried a bucket filled with wriggling earthworms, his expression cautious as he asked Xiao Wanshan, “Are you the ones buying earthworms?”<br/><br/>Xiao Wanshan recognized this man. He was from Shigang Village next door, a poor family.<br/><br/>This man had a leg disability and had lost his wife early. He had raised his son with great difficulty, and even got him a daughter-in-law. But then, both the son and daughter-in-law passed away, leaving behind a helpless child.<br/><br/>With the burden of the child and his disability, he could only farm at home and didn’t have any other options. As a result, his family lived in poverty.<br/><br/>Xiao Wanshan looked at the man’s bucket of earthworms and said with a smile, “Yes, we buy earthworms here. Let me check your earthworms first.”<br/><br/>Although feeling pity and sympathy, quality still mattered.<br/><br/>Shi Dajiang lifted the bucket and said, “Don’t worry, these earthworms were all caught by me today. They’re all alive. I was worried that they would suffocate, so I came as soon as it started getting dark. Well, have a look.”<br/><br/>Xiao Wanshan squatted down and reached into the bucket. All he felt apart from the cold was the sensation of wriggling earthworms.<br/><br/>He nodded, “Alright, let’s weigh them quickly.”<br/><br/>When weighed, there were three jin and three liang.<br/><br/>Xiao Wanshan asked curiously, “How did you catch so many earthworms in just one day?”<br/><br/>Shi Dajiang smiled and said, “I have experience in finding earthworms. As soon as I heard you were buying them, I took my grandson and spent the whole day searching. ”<br/><br/>Since the man didn’t want to say more, Xiao Wanshan didn’t pry further. He nodded and said, “Alright, we’ll be buying earthworms for a while. Bring them here whenever you catch some.”<br/><br/>With that, he took out some money and paid the man.<br/><br/>After receiving the money, Shi Dajiang nodded and said, “Yes, I will.”<br/><br/>If he could catch two or three jin every day, he’d have over a thousand yuan in just a few days. This would cover living expenses for half a year and he wouldn’t have to worry as much.<br/><br/>Thinking of this, he looked down at his skinny grandson, and his eyes turned red. Due to their poverty, the child had rarely eaten well since his parents died. At four or five years old, he was much shorter than his peers.<br/><br/>Now, with a little money, he planned to buy some eggs and ribs to nourish his grandson.<br/><br/>After Shi Dajiang left, Xiao Jinli looked at his retreating figure and asked somewhat puzzled, “Dad, do you know him?”<br/><br/>Xiao Wanshan nodded, “Yes, I know him. He’s from the neighboring village. He lost his wife early in life, and later lost his son and daughter-in-law. Only a child was left. With his leg disability and the burden of the child, no one wanted him for work. He could only rely on his three acres of land to support himself and the child, barely eating well. Look at him and the child, all bones.”<br/><br/>Listening to what her father said, the light in Xiao Jinli’s eyes flickered, and she asked, “Dad, how’s his character?”<br/><br/>“Character?” Xiao Wanshan looked surprised, “His character should be alright. He doesn’t steal or rob, and doesn’t bear grudges against others. Xiao Bao, why are you asking this?”<br/><br/>Xiao Jinli explained her plan, “Dad, I’ll definitely need people to work in such a large earthworm farm. I need someone to watch over the greenhouse every day.”<br/><br/>Xiao Wanshan immediately understood, “So, Xiao Bao, you pity and sympathize with him and want to give him a job?”<br/><br/>Xiao Jinli tilted her head slightly and cunningly said, “Well, you can say that. But as long as his character is good, and he’s willing to give up his family’s land. I don’t need someone who runs home to farm every few days.”<br/><br/>Xiao Wanshan nodded, “Alright, I’ll ask around some more. If his character is good, I’ll talk to him about it.”<br/><br/>If Shi Dajiang wasn’t a fool, he would surely accept such a good opportunity.<br/><br/>Xiao Jinli nodded, “Thanks, Dad!”<br/><br/>That day, besides Shi Dajiang, three or four other people brought earthworms as well.<br/><br/>However, their amounts weren’t as much as Shi Dajiang’s, just over a jin. But it was still a substantial income for a day.<br/><br/>On top of that, there was a villager from Daxing Village who brought a water bucket filled with what looked like three or four jin of earthworms.<br/><br/>Xiao Jinli took the bucket and started checking it. Her gloved hand stirred inside, and Wen Changsheng’s face involuntarily showed signs of guilt. He let out an awkward chuckle and explained, “Miss, these earthworms are all alive. They were dug up by my family today. You can rest assured.”<br/><br/>Who would have thought that as soon as he finished speaking, Xiao Jinli’s hand caught a few something alive and his face changed.<br/><br/>Xiao Jinli asked, her expression slightly serious, “Uncle, can you tell me what these things are?”<br/><br/>“This…This…” Wen Changsheng hastily and guiltily explained, “It’s probably some leeches the children accidentally caught and put in the bucket. I didn’t notice. You can just pick them out.”<br/><br/>Xiao Siqian looked at the leeches in Xiao Jinli’s hand, his face turning pale.<br/><br/>He remembered the day when they were transplanting rice seedlings, and a leech had attached itself to his leg to suck blood.<br/><br/>He asked in a puzzled voice, “The children in your family went to the fields to catch leeches and put them in this bucket? Uncle, how old are your children?<br/><br/>Aren’t they afraid of leeches?”<br/><br/>Wen Changsheng replied loudly, “Boys shouldn’t be afraid of leeches.”<br/><br/>Xiao Jinli said coldly, “So, Uncle, your boys aren’t afraid of leeches, so they went to catch them and mixed them with the earthworms to sell to me?”<br/><br/>Although it was the truth, Wen Changsheng didn’t want to admit it. He retorted, “You misunderstood. My children didn’t do it on purpose. It must have been a prank. Yes, just a prank. Don’t worry, there shouldn’t be many leeches in the bucket.”<br/><br/>Xiao Jinli sneered, and put the leeches aside. Then she reached into the bucket again.<br/><br/>Xiao Siqian watched, feeling goosebumps all over.<br/><br/>He thought, “Not to mention those cold and wriggling little creatures that make one’s heart tremble just by touching them, but leeches are obviously bloodsuckers. They’re terrifying. Yet Jinli treats them like toys.” After a moment, Xiao Jinli had several more leeches in her hand.<br/><br/>Wen Changsheng…\t\t\t\t\t\t</div>", "images": {}, "success": true}