{"id": 137, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298120.html", "title": "Chapter 137 - Chapter 137: Chapter 137: Kill A Chicken To Scare The Monkeys (Part 1)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 137 - Chapter 137: Chapter 137: Kill A Chicken To Scare The Monkeys (Part 1)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 137: Chapter 137: Kill a Chicken to Scare the Monkeys (Part 1)<br/><br/>Translator: 549690339<br/><br/>After doing this twice, Xiao Jinli poured everything from the bucket into a large basin. Then, the leeches and other soft worms mixed in with the earthworms became obvious.<br/><br/>Xiao Jinli’s face darkened.<br/><br/>Seeing the various soft worms in the basin, Xiao Siqian’s scalp tingled as if ten million ants were crawling and biting.<br/><br/>Xiao Jinli looked at Wen Changsheng with a cold tone and said, “Uncle, take a look at what’s mixed in here. Are you sure it’s not intentional? The stuff you brought seems to weigh at least four jin, but there’s at least two jin of mixed in stuff. Are you treating our house as fools who will take anything? I’m sorry, but<br/><br/>I won’t be buying your earthworms today.”<br/><br/>Wen Changsheng’s expression changed subtly, and he asked with a smile, “Is your family here?” Implying, can you make the decision?<br/><br/>Xiao Jinli shook her head and said, “They’re not home. Uncle, you’re being  dishonest, so I won’t accept your earthworms. Even if my family was here, I wouldn’t let them buy it.”<br/><br/>If she bought them now, others might follow suit, and she would have to carefully screen each batch, increasing her workload. If she didn’t check, the extraneous things would be mixed in, costing her money and affecting the survival rate of the earthworms.<br/><br/>After hearing this, Wen Changsheng’s face changed again, becoming somewhat unsightly. He said, “Little girl, I can pick out the mixed stuff.”<br/><br/>Xiao Jinli shook her head, still firmly rejecting, “Even if you pick out the leeches and water leeches, I won’t buy them. You can take back what you brought and feed it to the chickens and ducks or put it back in the field.” Upon hearing this, Wen Changsheng’s expression changed to anger.<br/><br/>He raised his voice in dissatisfaction, “Little girl, since I said I will pick out the mixed stuff, why won’t you buy them? Are your parents okay with you doing<br/><br/>Xiao Jinli coldly replied, “The matter of buying earthworms doesn’t require my parents’ permission. I can make that decision. Besides, with so many different things mixed in, why should I buy it? Today, I carefully checked and found that at least one to two jin of it is mixed in, which is worth 100 to 200 RMB. If I hadn’t checked carefully, I would have suffered a small loss. But the real problem is the huge impact on the earthworms’ survival rate. Who will I complain to about the consequences and losses?”<br/><br/>After hearing this, Wen Changsheng still argued, “Little girl, I said that I will pick out the stuff, can’t you just stop being so persistent? And besides, didn’t you find them? I won’t let the children do such tricks again.”<br/><br/>He paused for a moment, his tone becoming somewhat pleading, “Pick out these things, and there are still more than two jin of earthworms left. Will you please buy them?”<br/><br/>Before they came, they had weighed more than four jin at home, which could be sold for more than 400 RMB.<br/><br/>Of course, this was the result of wishful thinking.<br/><br/>Even if they were discovered, there would still be more than two jin left, which could be sold for more than 200 RMB.<br/><br/>Whether it was more than 400 RMB or more than 200 RMB, for rural people, it was a significant income.<br/><br/>But they never expected the other party to refuse directly after finding the mixed stuff.<br/><br/>How could this be?<br/><br/>If she didn’t accept their stuff, wouldn’t their family have wasted a whole day for nothing?<br/><br/>With suppressed anger, Wen Changsheng said, “Little girl, call your parents out. I’ll pick out the stuff first.”<br/><br/>Xiao Siqian was disgusted by his tactics and said, “Stop talking about calling the adults. We both know whether this was a prank by the children or not.<br/><br/>Don’t think you can deceive us or hope to get more money. You should know that our family’s money doesn’t come easily. If we buy your stuff this time, will other people also follow suit by mixing things in? Not to mention the loss of money, but it would only increase our workload.”<br/><br/>At this point, Xiao Siqian paused for a moment and said coldly, “We’re all villagers here, who are you trying to deceive?”<br/><br/>The last sentence practically tore off the other party’s face.<br/><br/>Being scolded by two children, Wen Changsheng had no face to stay any longer.<br/><br/>He angrily packed up his things and left.<br/><br/>Not long after he left, Xiao Wanshan and Xiao Junxuan came back.<br/><br/>Seeing the two children in the yard, they laughingly asked, “Xiao Bao, what’s going on? Are you two acting as rocks in the yard?”<br/><br/>Xiao Jinli shook her head and said, “Dad, just now someone from the neighboring village came with earthworms, and there were a lot of leeches and other stuff mixed in. I refused to buy it, and he angrily left.”<br/><br/>“Who’s this dishonest person?” Xiao Wanshan was also a bit angry, “We’re only buying earthworms, not other bugs.”<br/><br/>At this point, he paused and said to his daughter with a smile, “Xiao Bao, you did the right thing. If you had set a precedent, others would follow suit, and it would be unbearable.”<br/><br/>Xiao Jinli said, “Right. I refuse their stuff now as a warning to others so that people who come later won’t try to cheat. They all want more income, but our money doesn’t come easily either.”<br/><br/>“Yes, yes, that’s right!” Xiao Wanshan agreed, “Xiao Bao, how many earthworms did you buy today?”<br/><br/>“Not much, just over ten jin! More than ten people came in total.”<br/><br/>“It’s only the first day, and there are already more than ten jin. That’s not bad,” Xiao Wanshan nodded, “We’ll have 100 ,ooo earthworms soon.”<br/><br/>One jin of earthworms has about one thousand, and 100,000 earthworms weigh around a hundred jin.<br/><br/>Xiao Jinli picked up the bucket of earthworms and said to Xiao Wanshan, “Dad, I’ll take them to the greenhouse.”<br/><br/>Xiao Wanshan nodded, “Alright, go ahead!”<br/><br/>Xiao Siqian picked up the water bucket and said, “I’ll go with you!”<br/><br/>“Okay!”<br/><br/>Carrying the water bucket, the two quickly arrived at the greenhouse. The five acres of land in the greenhouse had been plowed and the weeds removed, but the rows hadn’t yet been made, which wasn’t urgent.<br/><br/>This piece of land was intended for raising earthworms. During the breeding process, Xiao Jinli was planning to grow some crops and covertly transplant some vegetables and fruit from the space.<br/><br/>Xiao Jinli took the water bucket from Xiao Siqian and secretly added some Lingquan water to it. The earthworms in the bucket immediately became active after being exposed to the aura of the Lingquan water.<br/><br/>Then, Xiao Jinli picked spots to pour the earthworms on the ground, and the active earthworms quickly burrowed into the soil.<br/><br/>Xiao Siqian worriedly asked, “With no one watching, will people steal them?”<br/><br/>Xiao Jinli confidently replied, “No, the dogs are watching.”<br/><br/>Xiao Siqian…\t\t\t\t\t\t</div>", "images": {}, "success": true}