{"id": 141, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298132.html", "title": "Chapter 141 - Chapter 141: Chapter 141: The Truth Behind The Victim (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 141 - Chapter 141: Chapter 141: The Truth Behind The Victim (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 141: Chapter 141: The Truth Behind the Victim (First Update)<br/><br/>Translator: 549690339<br/><br/>After hearing Xiao Jinli’s question, Xiao Siqian’s expression was momentarily stunned.<br/><br/>He… really didn’t know why Xiao Jinli was letting him know the truth.<br/><br/>In fact, with Xiao Jinli’s intelligence, deceiving him would have been a fairly simple matter.<br/><br/>As long as she said that she just picked him up here, that would be it.<br/><br/>Because no one would suspect that his coma was caused by her, and the sudden disappearance of the four kidnappers was her doing as well.<br/><br/>Not to mention her young age was deceptive, who would think that a child could save him from the clutches of four vicious criminals?<br/><br/>Xiao Siqian took a deep breath and sincerely said, “Little Sister Jinli, have you noticed that I’ve been going out more frequently lately?”<br/><br/>Now that he had seen Xiao Jinli’s ability, he naturally could easily notice his own change in activity.<br/><br/>Xiao Jinli smiled.<br/><br/>She looked at Xiao Siqian and nodded, “That’s right. I remember I once told you that I don’t care what your identity was before, as long as it doesn’t threaten my family and the people of Xiao Family Village, I would turn a blind eye to it.”<br/><br/>Xiao Siqian nodded, “I always remember your words! Moreover, I’ve always treated Uncle and Aunt, Brother Xuan, and you like family, and I absolutely won’t allow anyone to hurt you all.<br/><br/>Also, the whole Xiao Family Village has brought me great joy and warmth, and I won’t let anyone harm them either.<br/><br/>Jinli, please believe me. For me, I would rather hurt myself than hurt anyone in<br/><br/>Xiao Family Village.”<br/><br/>Having said that, he took another deep breath, “Also, I’ve been going out frequently lately because my maternal grandfather’s people have found Ganjiang City, and to avoid them bringing their attention here, I can only take the initiative.”<br/><br/>He accidentally discovered this in Ganjiang City.<br/><br/>Xiao Jinli raised her eyebrows, “Your maternal grandfather?”<br/><br/>Xiao Siqian said, “Yes, my maternal grandfather. At that time, I was immersed in the beautiful lies of happiness woven by my father and stepmother, and I was too young to inquire about the real cause of my mother’s death. My maternal grandfather came to see me a few times, but he was alienated by the instigation of my father and stepmother, and our relationship gradually became distant.”<br/><br/>Xiao Jinli looked at Xiao Siqian like he was an idiot, and asked faintly, “How old were you then?”<br/><br/>Xiao Siqian’s face turned red, “Well, probably five or six years old.”<br/><br/>“Oh, five or six years old,” Xiao Jinli nodded, “You were indeed too young at that time, and being brainwashed and deceived is understandable. But after you grew up, didn’t you notice anything abnormal?”<br/><br/>Xiao Siqian thought for a moment and then said, “I did. Especially when I saw my half-brother, who looked six or seven points similar to my father, I once suspected that they were father and son. But, just like you said, I was blinded by the superficial affection, immersed in happiness, and didn’t want to delve deeper.”<br/><br/>After all, he was too young and needed the companionship of his parents and affections.<br/><br/>“Tsk tsk…” Xiao Jinli mocked, “You are really unfilial! After your mother died, your father brought a stepmother and a brother who looked so similar to your father into the house, yet you indulged in superficial happiness without suspicion.”<br/><br/>Xiao Siqian’s face turned even redder.<br/><br/>“However, if you were so happy, why were you kidnapped and hunted?” As Xiao Jinli said this, she suddenly thought of something, “Ah, I remember when I saved you, I heard the kidnappers say that you had blocked someone’s path. So, who did you block?”<br/><br/>Xiao Siqian showed a bitter smile and said, “My half-brother from the same father. When my mother married my father, she brought a sky-high dowry.<br/><br/>My father, relying on my mother’s dowry, expanded the company more and more. At that time, perhaps to secure my mother’s heart, he gave her 40% of the shares.<br/><br/>Before my mother passed away, she left a will stating that when I turn 18 years old, I can inherit all her properties. When I turned 18, my family deceived me and transferred all my mother’s inheritance, including her company shares, to my half-brother.”<br/><br/>After hearing Xiao Siqian’s words, Xiao Jinli looked at him like the biggest fool in the world and asked incredulously, “How did they deceive you and transfer the property your mom left to you to someone who has no blood relation to her and might even be an enemy?”<br/><br/>Xiao Siqian mocked, “Yes, I still feel like the biggest fool in the world. It only took a few words from that family of three to deceive me into giving up my own mother’s inheritance.”<br/><br/>But why didn’t he give the inheritance to his scumbag father instead? Because that’s their true love!<br/><br/>“However, since you’ve handed over all your mother’s inheritance to them, why would they want to kill you?” Xiao Jinli asked.<br/><br/>“Perhaps they wanted to eliminate all possible threats, ” Xiao Siqian replied with a deep hatred in his eyes. “They believed that only with me dead can they truly inherit my mother’s properties in peace.”<br/><br/>As he spoke, he paused and then continued, “Not long ago, I got in touch with my maternal grandfather. He told me something – that family of three is now frantically searching for me.”<br/><br/>“Searching for you?” Xiao Jinli frowned, “Why? The kidnappers they hired to abduct and kill you, at least in theory, should have been clear that you might have already been killed. Aren’t they afraid of bringing disaster to themselves with all the commotion?”<br/><br/>Xiao Siqian explained, “According to my grandfather, it has something to do with my mother’s will. Her will stated that all her properties must be inherited by me after I turn 18 years old. If I were to forfeit the inheritance rights, I would have to be present in person, making a verbal promise that the entrusted inheritance is invalid. Otherwise, within five years, all the properties will be donated to a charity foundation.”<br/><br/>Xiao Jinli, ‘<br/><br/>After a while, she raised her thumb to Xiao Siqian with a smile, saying, “Your mother was really clever and had great foresight!”<br/><br/>With a sigh, she continued, “Such a great motherly heart, so thorough in her considerations. If she hadn’t set up such a will, even if you were alive, you wouldn’t be able to get a single cent of your mother’s inheritance!”<br/><br/>Xiao Siqian fell silent for a moment.<br/><br/>A while later, he continued, “Yes, I’m grateful that my mother set up such a will. Otherwise, even if I were to go back, I fear I would lose all her properties!”<br/><br/>At that time, when they tricked him into signing the inheritance transfer agreement, he hadn’t realized that his 18th birthday would also be the day of his death.<br/><br/>Fortunately, he met a benefactor who helped him survive.<br/><br/>Now that he’s alive, that family better be prepared to face his fierce revenge.<br/><br/>Xiao Siqian continued, “Since they can’t get the inheritance rights, they naturally want to find me and resort to the same trick. But I won’t let them succeed this time.”<br/><br/>He must take his revenge!<br/><br/>Xiao Jinli nodded and said, “Right, revenge must be taken, and grievances must be repaid. Since they didn’t leave you any way to live, there’s no need to leave them any room to survive, either!”<br/><br/>“…” Xiao Siqian nodded and said, “Yes, once the veil of kinship is lifted, I will no longer regard them as family members, but as enemies.”<br/><br/>Xiao Jinli nodded and said, “Yes, that’s right.”<br/><br/>Xiao Jinli then asked, “So, you’re planning to go back and take your revenge?”<br/><br/>Xiao Siqian hesitated for a moment..\t\t\t\t\t\t</div>", "images": {}, "success": true}