{"id": 143, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298138.html", "title": "Chapter 143 - Chapter 143: Chapter 143: Farewell 1 (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 143 - Chapter 143: Chapter 143: Farewell 1 (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 143: Chapter 143: Farewell 1 (First Update)<br/><br/>Translator: 549690339<br/><br/>Xiao Jinli found a flower pot and planted the small tea tree seedling in it. While no one was paying attention, she dripped a few drops of Lingquan water on it.<br/><br/>She had looked up the information, and although this Seven Color Tea Tree was a new variety from the Agricultural Research Institute, it had already been cultivated in Cray Country.<br/><br/>Last year, at the International Horticultural Flower Auction, a pot of Seven<br/><br/>Color Tea Flowers attracted everyone’s attention and became the highlight of the auction,<br/><br/>This flower was named the Rainbow Angel.<br/><br/>Seven Color Tea Flower: Beautifully blooming, charming and enchanting, colorful, and elegant!<br/><br/>At that auction, a pot of Seven Color Tea Flowers was sold to a mysterious person for 38 million.<br/><br/>Although Xiao Jinli didn’t know if the Seven Color Tea Flower seeds she bought were genuine, she still wanted to take good care of them. If they turned out to be genuine, they could be worth over 10 million!<br/><br/>Because there were only three days left, Xiao Siqian cherished every moment he spent with the Xiao family.<br/><br/>“Xiao Quan, what’s wrong with you these days?” At dinner time, Xiao Mother finally couldn’t help but ask, “You seem to have become very silent. Are you feeling unwell, or have you encountered any problems?”<br/><br/>Xiao Siqian’s hand holding chopsticks paused, then his eyes reddened, shaking his head, “Auntie, I’m fine.’<br/><br/>But Xiao Mother didn’t believe him at all. She rarely showed a stern face and said, “Look at your expression, and you still say nothing’s wrong, who would believe it?”<br/><br/>After a moment’s pause, she continued, “Xiao Quan, we’re a family now. Since we’re a family, we’re relatives. No matter what kind of problems you encounter, you can share them. If we can solve them ourselves, we’ll do it together. If we can’t, we’ll all try to find a solution as a family. Your silence really worries us.”<br/><br/>As soon as Xiao Mother finished speaking, Xiao Siqian’s eyes welled up with tears.<br/><br/>Mother Xiao and others looked worried the moment they saw his tears.<br/><br/>Xiao Father hurriedly asked, “Xiao Quan, if you have any problems, just tell us.<br/><br/>Uncle will do his best to help you solve them.”<br/><br/>A boy must have encountered some difficulties, otherwise, why would he cry?<br/><br/>Xiao Junxuan also patted his chest and said, “Xiao Quan, Brother Xuan always treats you like a real younger brother. Your problems are my problems too. So, whatever difficulties you encounter, just tell me, and I’ll do everything in my power to help you solve them.”<br/><br/>Hearing their heartfelt words, Xiao Siqian was deeply moved, and he couldn’t help but cry.<br/><br/>He shook his head and then said with determination, “Uncle, Auntie, Brother Xuan, I’ve actually recovered my memories!”<br/><br/>Mother Xiao and others were momentarily stunned.<br/><br/>Xiao Junxuan reacted first, smiling and saying, “Haha, regaining your memory is a good thing. Little brother Xiao Quan, congratulations!”<br/><br/>Xiao Jinli, ‘<br/><br/>Sometimes, she thought her big brother was very smart, but other times, she felt he was a bit foolish.<br/><br/>He didn’t even ask whether the return of Xiao Quan’s memories was a good or bad thing, and just started congratulating him.<br/><br/>What if those memories were something he didn’t want in the first place?<br/><br/>Of course, Xiao Jinli didn’t expose her big brother’s words.<br/><br/>It was Xiao Mother who seemed to have thought of something, her face changing colors and slightly worriedly asking, “Xiao… Xiao Chen, are you planning to leave after regaining your memory?”<br/><br/>Xiao Siqian nodded and said, “Yes, I plan to leave in two days. I have some important things to do. Uncle and Auntie, I’m sorry.”<br/><br/>Xiao Wanshan shook his head and said, “Xiao Quan, what are you apologizing for? You have nothing to be sorry about. Since you have important things to do,<br/><br/>Uncle won’t interfere. But Uncle hopes that you can ensure your own safety! ”<br/><br/>He remembered that when Xiao Bao carried him down Red Peak Mountain, he was covered in blood and wounds all over his body, suffering both internal and external injuries. Moreover, according to the Yamen officials, he had some gunshot wounds on his body.<br/><br/>All these signs indicated that this child had a not-so-simple background.<br/><br/>Xiao Siqian nodded, “Well, Xiao Quan, oh… Yichen will always remember<br/><br/>Uncle’s words.”<br/><br/>“Yichen?”<br/><br/>“Yes, my name is Su Yichen. I come from the Capital City!”<br/><br/>Xiao Siqian, or rather Su Yichen, introduced himself, “My family is quite well-off. I was kidnapped and brought here. After escaping, I fainted on Red Peak Mountain, and then was saved by Little Sister Jinli.”<br/><br/>He was telling the truth, but not in detail.<br/><br/>He continued, “A couple of days ago, I accidentally recovered my memory and contacted my family. They were very anxious and wanted to take me back.”<br/><br/>Xiao Mother smiled and said, “Haha, it’s good to recover your memory and find your family. Xiao Quan, no, Xiao Chen, you’ve been missing for so long, your family must be very worried. It’s only right for you to go back.”<br/><br/>Xiao Jinli thought to herself, “Mom, you’re wrong. He’s not going back because his family is worried, but to take revenge.”<br/><br/>Xiao Junxuan also laughed, “Hey, little… brother Chen, it’s a good thing that you found your relatives. I thought you ran into some difficulties that were hard to solve. Why did you cry and worry us?”<br/><br/>Xiao Jinli, ‘<br/><br/>Su Yichen,<br/><br/>With Xiao Junxuan’s words, the sentimental atmosphere was gone.<br/><br/>Su Yichen smiled and said, “Brother Xuan, it’s my fault for making you all worry!”<br/><br/>Xiao Junxuan smiled and said, “It’s okay, we’re happy for you that you found your relatives.”<br/><br/>Xiao Wanshan said, “Xiao Chen, we’re all happy that you found your own relatives. Our home’s door will always be open for you, and we’ll still be family! Remember to tell Uncle and Brother Xuan about any difficulties you encounter in the future. If we can help, we definitely will!”<br/><br/>Su Yichen nodded and said, “Uncle, I’ll remember.”<br/><br/>Xiao Mother hesitated a bit before asking, “Little… Xiao Chen, when do you plan to leave? Auntie wants to prepare some things for you to take back.”<br/><br/>“The day after tomorrow!” Su Yichen said, “Auntie, when I leave, please make me two dishes, spicy and sour taro and sweet and sour carp. I particularly like these dishes you make.”<br/><br/>Xiao Mother smiled and said, “Okay, I’ll have them ready for you when you leave!”<br/><br/>Although they were happy for Xiao… Su Yichen for finding his family, they were also reluctant to see him go.<br/><br/>Xiao Mother said, “Xiao Chen, no matter what your identity is, in Auntie’s heart, you’ll always be our Xiao Quan, a part of our family, and our loved one! Auntie also hopes that no matter what difficulties and setbacks you face in the future, you’ll always remember us.”<br/><br/>Su Yichen nodded and said, “I’ll remember, Auntie! From the first day I entered this home, I’ve considered Uncle, Auntie, Brother Xuan, and Sister Jinli as my family. The warmth, happiness, and joy you’ve given me will forever remain in my heart.. You are my family forever!”\t\t\t\t\t\t</div>", "images": {}, "success": true}