{"id": 140, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298129.html", "title": "Chapter 140 - Chapter 140: Chapter 140: Xiao Siqian’S Shock (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 140 - Chapter 140: Chapter 140: Xiao Siqian’S Shock (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 140: Chapter 140: Xiao Siqian’s Shock (Second Update)<br/><br/>Translator: 549690339<br/><br/>Xiao Jinli told Xiao Siqian to set the wild rabbits and wild chickens aside, tied with rattan, so they couldn’t escape.<br/><br/>After examining for a moment, Xiao Siqian finally couldn’t help asking, “Little<br/><br/>Sister Jinli, where did you find me in the first place?”<br/><br/>After that, he walked to the edge of the cliff and continued, “I remember I was standing here, confronting a group of people in a life-and-death situation. Later, I felt a sharp pain in my shoulder and passed out. When I woke up again, I was in the hospital.’<br/><br/>At this point, he asked with a slightly serious expression, “Jinli, how did you pick me up that day? Did you see anyone else?”<br/><br/>Xiao Jinli’s deep and sharp gaze stared straight at Xiao Siqian.<br/><br/>Xiao Siqian was shocked by Xiao Jinli’s gaze, which seemed to be able to penetrate his heart.<br/><br/>After a while, Xiao Jinli showed a sharp smile and questioned, “So, Little Brother Xiao Quan, what are you doubting? Are you doubting that I killed those people?”<br/><br/>Before Xiao Siqian could react, her face showed a bloodthirsty smile. She didn’t deny it, “That’s right. I saved you and those four kidnappers became food for my little darlings.”<br/><br/>Xiao Siqian’s pupils contracted involuntarily, and disbelief filled his eyes.<br/><br/>Xiao Jinli pointed to the location and continued, “At that time, when I saw your despair and unwillingness to jump off the cliff, and the anger and hatred on your face, I had a moment of softness in my heart. Just that moment of softness made me decide to save you.”<br/><br/>Xiao Siqian struggled to hide the shock on his face.<br/><br/>He had thought of countless truths, but he never thought that the child who picked him up the mountain was the one who saved him first.<br/><br/>Xiao Jinli then pointed to the big pine tree, laughing and saying, “At that time, I was lying and resting on that branch when you and several outsiders broke in. I didn’t want to get involved, but I also didn’t want your group to pollute my territory.<br/><br/>However, those four kidnappers were so arrogant, and the bloodthirsty aura on their bodies was heavy, indicating that they had taken many lives. Moreover, your expression at that time intrigued me, so I saved you when you tried to jump off the cliff to commit suicide.”<br/><br/>Xiao Siqian had no doubt about Xiao Jinli’s words.<br/><br/>Because the situation was exactly like that at the time.<br/><br/>His shocked and dazed look made him want to ask, “How exactly did you save me at that time?”<br/><br/>As if she knew his doubts, Xiao Jinli casually picked up a weed leaf from the side, and after a moment, it turned into a sharp dagger, which she threw out.<br/><br/>“Bang!”<br/><br/>A soft weed leaf instantly penetrated the nearby mountain wall.<br/><br/>Xiao Siqian’s pupils shrank violently again!<br/><br/>If he hadn’t seen it with his own eyes, it would be hard for him to believe that he had seen a martial arts expert in the legendary world, and it was a ten-year-old child.<br/><br/>He opened his mouth, wanting to say something, but it seemed that nothing needed to be said.<br/><br/>Xiao Jinli laughed and described the process of saving him, “At that time, I knocked you out with a tree branch and then dealt with those kidnappers. So you can put your mind at ease now. Those four kidnappers will never appear in this world again. No one knows how they disappeared, except for you.” Afterward, she whistled.<br/><br/>It didn’t take long before Xiao Siqian heard a roar of tigers coming from the woods.<br/><br/>Xiao Siqian’s face immediately showed fright and caution. He looked at Xiao<br/><br/>Jinli and stuttered, “Ti…tigers?”<br/><br/>Immediately, regardless of his own fear and panic, he unconsciously protected Xiao Jinli behind him, his eyes highly alert and cautious.<br/><br/>Xiao Jinli, who was protected behind him, flashed her eyes.<br/><br/>Xiao Jinli patted his shoulder from behind and said with a smile, “Don’t worry, these tigers were called by me.”<br/><br/>Having heard that, Xiao Siqian turned around, dumbfounded.<br/><br/>He stuttered, “You…you called them?”<br/><br/>He knew that Xiao Jinli was liked by the village dogs, but he didn’t know that even the king of the forest could listen to her.<br/><br/>As he was shocked and surprised, the tigers that were called appeared before them.<br/><br/>Xiao Siqian’s pupils contracted, and his heart tightened again.<br/><br/>“Six…six tigers?” Xiao Siqian exclaimed.<br/><br/>Isn’t there a saying that a mountain cannot accommodate two tigers? How could six tigers appear here all at once?<br/><br/>This was incredible.<br/><br/>Xiao Jinli explained, “Oh, these six tigers are a couple and four tiger cubs.”<br/><br/>After hearing her explanation, Xiao Siqian understood and asked curiously,<br/><br/>“So, these are the little darlings you mentioned?”<br/><br/>“Yes,” Xiao Jinli nodded, “Don’t you think they’re fluffy and cute?”<br/><br/>Xiao Siqian, .<br/><br/>Cute? How could such fierce beasts be considered cute in Xiao Jinli’s words? But Xiao Siqian still nodded reluctantly, “Uh, cute!”<br/><br/>Xiao Jinli nodded, “Yes. The kidnappers who chased you back then were divided among this family of six!”<br/><br/>After that, she called out to her little darlings, “Little White, Little Yellow, come here, let me introduce you to a new friend.”<br/><br/>Xiao Siqian felt his scalp tighten, and then heard two tiger roars.<br/><br/>“Roar…” Master, this human looks delicious.<br/><br/>Xiao Jinli immediately sternly said, “This new friend is not to be eaten.<br/><br/>Moreover, remember, you can’t eat humans casually. If I find out, hehe…”<br/><br/>The six little darlings shrank their necks immediately, widened their eyes, breathed heavily, and obediently submitted.<br/><br/>They let out low roars again, as if to say, “We wouldn’t dare to eat humans casually.” If they wanted to eat humans, they would definitely go down the mountain to find food, like before.<br/><br/>However, ever since Xiao Jinli became the boss of a piece of mountain forest, no fierce beasts dared to go down the mountain to hunt, and they all stayed honestly in their one-acre, three-point forest.<br/><br/>Xiao Jinli reached out and touched their fluffy heads, smiling innocently, “Yes, that’s more like it. Little White and Little Yellow, you’ve all grown fatter since before.’<br/><br/>Little White and Little Yellow were the four tiger cubs, two white and two yellow. Xiao Jinli named them these simple names.<br/><br/>Little White and Little Yellow immediately stretched out their little heads, rubbed Xiao Jinli’s palm, looking very pleasing. Xiao Siqian watched nervously from the side, fearing that these tigers would suddenly become aggressive and bite Xiao Jinli.<br/><br/>Fortunately, what he worried about never happened.<br/><br/>Then, he secretly let out a sigh of relief.<br/><br/>However, soon his breath tightened again, and he became extremely nervous.<br/><br/>Xiao Jinli asked, “Do you know why I let you know the truth about how you were saved, Little Brother Xiao Quan?”\t\t\t\t\t\t</div>", "images": {}, "success": true}