{"id": 145, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298144.html", "title": "Chapter 145 - Chapter 145: Chapter 145: Farewell 3 (Part 1)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 145 - Chapter 145: Chapter 145: Farewell 3 (Part 1)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 145: Chapter 145: Farewell 3 (Part 1)<br/><br/>Translator: 549690339<br/><br/>Xiao Mother prepared Xiao Siqian’s favorite Spicy and sour taro, chili, sweet and sour fish, glutinous rice cake, and other local specialties that can only be found in the countryside.<br/><br/>Oh, right, Xiao Mother and the others still prefer to call him Xiao Siqian.<br/><br/>Because, the one who entered their home was Xiao Siqian, not Su Yichen.<br/><br/>Knowing that Xiao Siqian also likes Osmanthus Wine, Xiao Father gave him the last two jars without hesitation.<br/><br/>Carrying the jars, Su Yichen declined, “Uncle, you only have these two jars of wine. I can take one jar back, but you should keep the other one for yourself.”<br/><br/>Xiao Father waved his hand and said, “I can have your Aunt make more wine if I run out. But it would be hard for you to get a drink thousands of miles away. Little Quan, don’t be too polite to your Uncle, just take it.”<br/><br/>After hearing Xiao Father’s words, Su Yichen no longer declined and nodded his head, “Alright, Uncle, I’ll accept it.”<br/><br/>Xiao Father patted his shoulder and smiled, “That’s right. But remember, although the wine is delicious, don’t overdo it. One small cup a day can help you stay strong and healthy!”<br/><br/>This was his advice based on experience.<br/><br/>Xiao Siqian nodded and said, “Mm, Uncle, I’ll remember that.”<br/><br/>Xiao Mother packed various things in glass jars and sealed them while  instructing, “Little Quan, you need to eat the glutinous rice cake and the steamed rice cake as soon as possible, otherwise they will go bad easily. As for this spicy and sour taro, you also need to eat it quickly. This chopped chili can last longer as long as it is stored properly. But you have to remember, once these items turn white or go bad, you can’t eat them anymore, alright?”<br/><br/>Xiao Siqian listened and nodded, “Aunt, I got it!”<br/><br/>Xiao Mother, with her eyes turning red, said reluctantly, “We don’t know when we’ll be able to see you again once you leave. But no matter what, Aunt hopes that you’ll always be well.”<br/><br/>Xiao Siqian suddenly hugged Xiao Mother’s shoulder, his voice choking up,<br/><br/>“Aunt, I’ll remember your words, I promise I’ll be well!”<br/><br/>He would definitely be well, and then return to this home.<br/><br/>Xiao Mother patted his shoulder and said, “Yes, as long as you want to, our door will always be open to you! Even though we’ve only been together for not even half a year, you’re like another son to your Uncle and me in our hearts.” “Mhm, I know!” Xiao Siqian replied, his eyes brimming with tears.<br/><br/>On usual days, no one of the opposite sex could even touch his wife’s clothes.<br/><br/>However, at this moment of parting, Xiao Father resisted the urge to pull them apart and instead patted Siqian’s shoulder, “Little Quan, remember Aunt’s words. You are like another son to her and me. Our door will always be open for you. You can always come back whenever you want.”<br/><br/>Xiao Siqian truly enjoyed the unadulterated love, warmth, and happiness in this family and had already considered it his own home.<br/><br/>If possible, he would really love to give up his billions in the Capital City and stay in this cozy little home.<br/><br/>However, he must avenge his mother’s death and protect his own life, so he has to return.<br/><br/>Besides, if those people learn that he is hiding in this remote small village, they will definitely target the people around him to force him to give up his inheritance rights.<br/><br/>Therefore, to eliminate the hidden dangers, he must go back. Xiao Siqian hugged Xiao Mother for a while before letting go.<br/><br/>He knew that Xiao Father was very jealous.<br/><br/>Xiao Junxuan patted his shoulder and said, “Little Brother Quan, I don’t know what gift to give you right now. Just remember, you will always be my brother, Xiao Junxuan. As long as you need help from your older brother, whether it’s climbing up knife ladders or diving into seas of fire, I will always rush out for you. So remember, wherever you are, you won’t be alone. You have Brother<br/><br/>Xuan and our whole family.”<br/><br/>“Alright, Brother Xuan, I’ll remember that,” Xiao Siqian replied.<br/><br/>Xiao Jinli held a pot of Seven-color Camellia seedling, which was transplanted a few days ago, and handed it to Siqian, “Big Brother Quan, this tea flower tree is for you.”<br/><br/>Xiao Siqian looked at the tea flower tree with faint buds and was slightly surprised. He declined, “Little Sister Jinli, this is the Seven-color Camellia, very precious, I can’t accept it!”<br/><br/>Other people may not be aware of the value of the Seven-color Camellia, but he knew.<br/><br/>Even though it wasn’t the one from the international horticultural flower auction, it was still worth at least a million yuan.<br/><br/>This was already a very high value for people in the countryside.<br/><br/>Xiao Jinli shook her head and said, “Precisely because it’s precious, I want to give it to you. Since we can’t be with you, let this tea flower be with you in our place. Don’t worry, this flower is easy to grow, and with the nutrients I’ve prepared, you can add a few drops later, and it won’t wither or die.”<br/><br/>As for those so-called “nutrients”, they were of course Lingquan water.<br/><br/>Hearing this, Siqian held the flower pot tightly and stopped declining. With a bit of hesitation, he said, “But…But…<br/><br/>Xiao Jinli shook her head and laughed, “There are no buts. Have you forgotten? I have five seeds. Since I can grow one, I can grow a second tree too.”<br/><br/>Siqian nodded, “Alright, Little Sister Jinli, I’ll accept it.”<br/><br/>He would definitely take good care of this tea flower.<br/><br/>Even if he didn’t know how to grow it, he would hire the best botanists in the world to help him.<br/><br/>As the saying goes, even the longest journey must come to an end!<br/><br/>Even though Su Yichen and the Xiao family were reluctant to part ways and had countless words of advice for each other, time waits for no one.<br/><br/>“It’s getting late, you should go back. The people who came to pick you up have been waiting outside for a day,” Xiao Mother said, as she looked at the sky and checked the time.<br/><br/>In the morning, the cars that had come to pick up Su Yichen had been waiting since the sun was high in the sky.<br/><br/>His family in the Capital City must be missing him too.<br/><br/>No matter how reluctant they were to part ways, they couldn’t be too hard on the child who didn’t want to leave either.<br/><br/>“Yeah, go back. Your family in the Capital City must be waiting for you,” Xiao Father said, glancing at the two black cars parked outside. “Nowadays, transportation and communication are very developed. You can come back and visit us whenever you have time.”<br/><br/>Xiao Junxuan also said, “That’s right. As long as you don’t forget about us and disdain our poor life, just let us know when you’re safely back in the Capital City. As long as there’s a chance, we can still stay in touch.”<br/><br/>Xiao Jinli looked at her parents and older brother and sighed softly, thinking, “With Su Yichen’s complicated family background, it would be really difficult for them to stay in touch. Let’s just temporarily offer them some comfort.”<br/><br/>In the end, Su Yichen reluctantly got into the black car at the door, waving goodbye to this family he had spent such a short time with.<br/><br/>As they parted, they couldn’t be sure when they would meet again!\t\t\t\t\t\t</div>", "images": {}, "success": true}