{"id": 144, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298141.html", "title": "Chapter 144 - Chapter 144: Chapter 144: Farewell 2 (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 144 - Chapter 144: Chapter 144: Farewell 2 (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 144: Chapter 144: Farewell 2 (Second Update)<br/><br/>Translator: 549690339<br/><br/>Hearing that Su Yichen was going to leave and go home, the family was happy for him but also worried at the same time!<br/><br/>This kid doesn’t seem to be in a hurry to go home.<br/><br/>Is it because his home is not good to him or is there another reason?<br/><br/>Generally speaking, family members are the people that everyone most wants to see.<br/><br/>Since he regained his memory two days ago, why would he only go back after a few days?<br/><br/>Xiao’s Mother wanted to ask but didn’t dare, afraid of touching on the child’s sad past.<br/><br/>Xiao Wanshan and his wife spend the night somewhat sleepless.<br/><br/>Xiao’s Mother said, “Xiao Quan is from the Capital City, how was he kidnapped thousands of miles away to Red Peak Mountain?”<br/><br/>“Since those kidnappers have kidnapped Xiao Quan for money, his family must be quite wealthy. So, did they look for someone when Xiao Quan was missing for so long?”<br/><br/>“I see on Television, those wealthy families, for their own interests, they compete for power, and even hurt each other’s lives. Husband, do you think Xiao Quan’s situation is like this?” Xiao’s Mother became more and more worried as she spoke.<br/><br/>Xiao Wanshan patted the back of her hand, comforting, “Don’t worry, that’s all your guess. Xiao Quan survived from a group of kidnappers, which means he has great luck and fortune. Besides, Xiao Quan, being such a smart person, will definitely protect himself. Just stop worrying, have a good sleep, and prepare something for Xiao Quan tomorrow!”<br/><br/>Although Xiao’s Mother was still worried about Su Yichen, she gradually fell asleep under Xiao Father’s comfort.<br/><br/>Xiao Junxuan couldn’t fall asleep tonight, tossing and turning in bed. He got up, took a card from the drawer, went to Su Yichen’s room next door, knocked on the door, and entered after Xiao Siqian opened it.<br/><br/>Xiao Junxuan directly handed the card in his hand to Su Yichen, saying, “Xiao Quan, younger brother, there’s one million in this card of mine, saved up over the past two years, I’m giving it to you now, I hope it can help you!” Seeing the bank card in his hand, Su Yichen felt touched and moved in an instant.<br/><br/>The family members who he once treated wholeheartedly ended up harboring evil intentions behind his back, trying to take away the inheritance left to him by his birth mother, and even tried to harm his life.<br/><br/>But the people he only met a few months ago could give their life savings to him without hesitation.<br/><br/>So, is it genuine affection or money that is more important? It just depends on whether a person is willing to give their true heart.<br/><br/>Su Yichen pushed the bank card back, sincerely saying, “Brother Xuan, I really appreciate it, but I can’t take your money! My family is very wealthy, and I don’t lack money when I go home!” What he lacked was just genuine affection. Hearing Su Yichen’s words like this, Xiao Junxuan felt a little embarrassed to take back the card.<br/><br/>After all, he didn’t really know about Su Yichen’s family, but he believed that Su Yichen would need more money when he went back home.<br/><br/>Xiao Junxuan gave an embarrassed smile, “So, you’re actually a young master of a wealthy family. Then my money is really offensive.”<br/><br/>Su Yichen frowned disapprovingly, “Brother Xuan, what are you talking about? Regardless of how much your money is, I’m still grateful and moved. It’s just that I think you need this money more. I heard your uncle say that you intend to buy several houses. Why don’t you take this money to buy a house, and then become a rental lord?”<br/><br/>“Haha, a rental lord?” Xiao Junxuan laughed, “Okay, then I’ll buy a few more houses and become a rental lord!”<br/><br/>Su Yichen seriously suggested, “Brother Xuan, the future space for real estate appreciation is huge, have you considered moving in the direction of the real estate market?”<br/><br/>Xiao Junxuan nodded, “Yeah, my dad and I thought about changing careers and doing real estate after listening to you last time.”<br/><br/>At this point, he asked curiously, “Xiao Quan, you have such a sharp business sense, is your family in the business?”<br/><br/>Su Yichen nodded, “Yes, my family is in business! Well, we are involved in various industries, such as electronic science and technology, jewelry, and real estate.”<br/><br/>“Oh, your family’s business is so big.” Xiao Junxuan’s eyes shone brightly, and he asked excitedly, “Your family is also in the real estate business? Can you tell me about it?”<br/><br/>Su Yichen smiled, “Of course.<br/><br/>Afterwards, the two discussed the real estate field.<br/><br/>Actually, it was Su Yichen unilaterally imparting his experience, and Xiao Junxuan was humbly asking for advice.<br/><br/>Xiao Jinli listened from the next room as the brothers talked about business and couldn’t help but smile.<br/><br/>She said to Xiao Zhi, “It seems my brother really wants to develop in the real estate industry.”<br/><br/>Xiao Zhi said, “Actually, your brother is pretty smart in business. Comparing to Su Yichen, he is a little bit behind. However, Su Yichen’s family has a wide range of businesses, but not all of them are industry leaders. But if your brother focuses on real estate, he may become a real estate tycoon. By then, Master, with a brother who can make money at home, you can truly relax.”<br/><br/>Xiao Jinli curled her lips and laughed, “Yes, life was not fair in the past, but I want to lie flat in this life!”<br/><br/>Xiao Zhi thought of something and asked, “Master, after Su Yichen goes back, should we help him?”<br/><br/>“Not for now!” Xiao Jinli said, “It’s his business, let him solve it by himself. If he can’t even avenge himself after surviving death once, even if we help, he is just a useless person.”<br/><br/>“…” Xiao Zhi pressed his lips and said, “Master, your heart is really hard. Anyway, you’ve been with him for so long, he protects you and treats you like a real sister. But you just want to treat him like a passer-by.”<br/><br/>Xiao Jinli was silent for a moment and said, “In this world, whoever truly treats me well, I will treat them well in return. Su Yichen is good now, but people can change. Who knows, once back in the Capital City, with power and money in hand, he might think that his days spent in the countryside were a disgrace?”<br/><br/>“No… it can’t be, can it?” Xiao Zhi was very dubious and surprised, “He shouldn’t be… that kind of person, right?”<br/><br/>“It’s hard to tell what kind of person he is right now.” Xiao Jinli said very seriously, “Just like my ex-boyfriend and sister from my past life, for the sake of money and power, they deceived me for so many years. So, human hearts are really hard to test and wear down.”<br/><br/>Xiao Zhi fell silent, deep in thought.<br/><br/>It is just a high-end intelligent network, it can infiltrate any corner of the internet, but it cannot penetrate the human heart.<br/><br/>“Sigh!” Xiao Zhi sighed lightly and said earnestly, “You humans are really complex. Much more complicated than our network data by millions of times!”<br/><br/>Xiao Jinli, ‘<br/><br/>This kid doesn’t want to be a human being now..\t\t\t\t\t\t</div>", "images": {}, "success": true}