{"id": 147, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298150.html", "title": "Chapter 147 - Chapter 147: Chapter 147: Dream Of Summer 2 (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 147 - Chapter 147: Chapter 147: Dream Of Summer 2 (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 147: Chapter 147: Dream of Summer 2 (First Update)<br/><br/>Translator: 549690339<br/><br/>Su Yichen’s eyes reddened when he heard Liu Qing Ming tell the story of his mother’s past.<br/><br/>Choking with emotion, he asked, “Uncle Liu, what about the photo?”<br/><br/>Liu Qing Ming said, “It’s a bed photo of your father cheating. After she received this photo, she kept receiving more photos of your father, his first love, and their child. The child looked very much like your father, and it was obvious that he was your father’s biological child. And that child was three years older than you!”<br/><br/>Su Yichen’s hands clenched into fists, the veins on his back bulging, as if he was about to explode at any moment.<br/><br/>Rage and hatred seethed in his eyes, and he gritted his teeth, saying, “So, my mom’s spirit was completely crushed, and that’s why she jumped off the building to commit suicide!”<br/><br/>Therefore, his mother’s death was caused by Su Xiangdong’s family. They were the culprits.<br/><br/>Yet foolishly, he had considered his enemy as his family, and had almost handed over everything his mother left for him to his enemy. At this moment, he really wanted to smash his own head.<br/><br/>He was so incredibly stupid!<br/><br/>He was considered a genius by everyone, but compared to those who manipulated others, he was practically mediocre.<br/><br/>Perhaps sensing Su Yichen’s guilt, Liu Qing Ming patted him on the shoulder and comforted him, saying, “Don’t blame yourself too much. After all, you were too young back then, and Su Xiangdong was always good at controlling people’s hearts. It’s only natural that you would believe them and fall for their tricks.”<br/><br/>With a sigh, he continued, “Before your mom jumped off the building, she had a severe depression. Under their provocation, she experienced a mental breakdown. But there was a period when she was lucid, and she came to me and left that will for you, leaving you a way out.”<br/><br/>Crying, Su Yichen said, “But I, being her son, almost gave away everything she left for me!”<br/><br/>“You almost did, but you didn’t, right?” Liu Qing Ming consoled, “Now that you see their true colors and are no longer deceived by them, it’s not too late.” Upon hearing this, Su Yichen fell silent.<br/><br/>After a while, Liu Qing Ming asked, “Xiao Chen, what do you plan to do next?<br/><br/>Will you return to the Xia Family or the Su Family?”<br/><br/>Su Yichen clenched his fists, a determined look in his eyes. He said, “Uncle Liu,<br/><br/>I want to avenge my mom!”<br/><br/>Liu Qing Ming was startled by his words and asked, “So, you still want to return to the Su Family?”<br/><br/>“Yes, return to the Su Family!” Su Yichen said bitterly, “If I don’t go back, how can I make them taste the feeling of falling from a high place? I want them to live in pain and despair like my mom! But for now, I will return to the Xia Family.”<br/><br/>From Uncle Liu’s mouth, he learned that his mother was a brilliant and capable woman. She had given up everything to be a devoted wife and mother at home, only to be betrayed by her husband. The truth was cruel beyond measure.<br/><br/>His father, a worthless man, had never loved her and had used her from the very beginning. In the end, he stepped on her to enjoy a life of wealth and luxury with his first love and child.<br/><br/>Worry crept into Liu Qing Ming’s eyes as he looked at Su Yichen. He said, “Yichen, your business talent is inherited from your mother, and you have surpassed her. Su Xiangdong’s business aptitude is not as good as yours, but after all, he has been fighting in the business world for over 20 years and has become a cunning veteran in the field. You are no match for his ruthless tactics and extensive connections. However, if you are truly determined to defeat him in the world of business, Uncle Liu will do everything to help you.”<br/><br/>Su Yichen gratefully said, “Uncle Liu, thank you!”<br/><br/>Uncle Liu shook his head and said, “It’s my duty to take care of you since I was friends with your mother.”<br/><br/>He then asked, “When you return to the Su Family, what will you do about the Xia Family? Your maternal grandfather may have treated your mother harshly, but he is still your grandfather. These years, the only reason that family hasn’t dared to mistreat you is because your grandfather has been watching.”<br/><br/>Su Yichen shook his head and said, “I don’t know how to deal with the Xia Family right now, but I plan to return to the Xia Family first, and then gradually return to the Su Family.”<br/><br/>When he returned to the Capital City, he immediately contacted his maternal grandfather, Xia Weiguo.<br/><br/>Upon his return to the Capital City, he didn’t go to the Xia Family first, but he went to the lawyer’s office to meet with Liu Qing Ming, the lawyer his mother had met before. He wanted to learn about his mother’s will.<br/><br/>In the past, Liu Qing Ming had tried to talk to him about his mother’s will as a friend of hers, but had been interrupted by Su Xiangdong multiple times.<br/><br/>He hadn’t wanted to investigate further at that point because Su Xiangdong had told him that Liu Qing Ming had pursued his mother, who chose Su Xiangdong over him.<br/><br/>So, Su Yichen believed that Liu Qing Ming must have been seeking revenge because his mother hadn’t chosen him.<br/><br/>As a result, he didn’t have a good impression of Liu Qing Ming.<br/><br/>But he hadn’t expected that his mother would have entrusted Liu Qing Ming with her will if she hadn’t trusted him.<br/><br/>Regardless of whether Liu Qing Ming had once had feelings for his mother, the fact was that she had trusted him.<br/><br/>The facts proved that his mother’s trust had not been misplaced. If Liu Qing Ming hadn’t repeatedly refused Su Xiangdong’s requests to see his mother’s will, it might have been tampered with or even forged.<br/><br/>As a son, he would have been deemed useless by then, or perhaps considered a thorn in their side and removed secretly.<br/><br/>When a child had an accident or died from illness within a family, outsiders wouldn’t inquire too deeply.<br/><br/>Thinking about how he had been safe thus far due to his mother’s protection, and Liu Qing Ming’s help, he was deeply grateful.<br/><br/>In the past, he had been deceived by others and had poor judgment. But that would change.<br/><br/>The bodyguards waiting outside the lawyer’s office received a call and entered, saying to Su Yichen, “Young Master Su, the old master is waiting for you at home.”<br/><br/>It seemed that the old master was dissatisfied because he had spent too much time at the lawyer’s office.<br/><br/>Su Yichen furrowed his brows and nodded, “Fine.<br/><br/>He then said goodbye to Liu Qing Ming, “Uncle Liu, I’ll be going now. I’ll contact you next time.”<br/><br/>Liu Qing Ming nodded and said, “Yes, after you go back, have a good talk with your grandfather. After all, he is your family!”<br/><br/>Su Yichen nodded, “I understand.”<br/><br/>Liu Qing Ming watched Su Yichen leave, worry etched on his face.<br/><br/>Although Su Yichen hadn’t told him how he had disappeared or where he had been for the past half year, he knew that it wasn’t that simple.<br/><br/>Otherwise, he wouldn’t have come to ask him about his mother and her will as soon as he returned, and he wouldn’t have had a change of heart about trusting Su Xiangdong and his family.<br/><br/>Su Xiangdong’s family was plotting against Su Yichen, and the Xia Family wasn’t much better.<br/><br/>It was just that the Xia Family hadn’t shown their true colors yet.<br/><br/>“Ai, Zhi Meng, I hope you can protect your son from up there!” Liu Qing Ming looked up at the sky and sighed heavily..\t\t\t\t\t\t</div>", "images": {}, "success": true}