{"id": 142, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298135.html", "title": "Chapter 142 - Chapter 142: Chapter 142: Time To Take Revenge (Part Two)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 142 - Chapter 142: Chapter 142: Time To Take Revenge (Part Two)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 142: Chapter 142: Time to Take Revenge (Part Two)<br/><br/>Translator: 549690339<br/><br/>Xiao Siqian was taken aback, his face was full of inexplicable longing and reluctance.<br/><br/>After a while, he nodded and said, “Yes, I plan to go back for revenge. Since they’re looking for me, almost to the point of madness, then I’ll appear before them as they wish. I want to see what kind of lies they can concoct in my presence!”<br/><br/>But as he said this, he added emotionally, “But I cannot bear to leave this village, leave Uncle and Auntie, Brother Xuan, and you. Living in the Xiao Family Village, I’ve truly experienced warmth and kinship free of ulterior motives. I immersed myself in this atmosphere every day, and the longer I stayed, the harder it was to leave.”<br/><br/>He sighed slightly and said, “The people my grandfather sent came looking for me again two days ago.”<br/><br/>He didn’t want to leave, so he delayed one day after another.<br/><br/>However, Xiao Jinli said indifferently, “Everyone will part ways eventually! Brother Xiao Quan, why agonize over this? After you leave, won’t you ever return to Xiao Family Village?”<br/><br/>Upon saying this, she looked at Xiao Siqian with a very serious expression and said, “As long as you or anyone around you won’t harm anyone or anything in Xiao Family Village, we welcome you to come back anytime!”<br/><br/>Xiao Siqian was stunned again, then choked with emotion, “Rest assured, I stick to my words. I will never, and will never allow anyone to harm anyone or anything in Xiao Family Village, including myself! If I break this pledge, you can do whatever you want to me!”<br/><br/>Xiao Jinli suddenly revealed the truth about his rescue to him just to tell him that she was able to save him but similarly, had the capacity to kill him too.<br/><br/>Xiao Jinli nodded and said, “Okay, I trust you.”<br/><br/>Then, she asked, “When are you planning to leave?”<br/><br/>Xiao Siqian thought for a moment and said, “In three days.”<br/><br/>Xiao Jinli said, “Then these few days, say your goodbyes properly to everyone. Especially my parents, they’ve really spoiled you like their own son.”<br/><br/>“Hmm, I know!” Xiao Siqian nodded, his voice nasal.<br/><br/>Afterwards, the two remained silent.<br/><br/>The atmosphere was extraordinarily quiet.<br/><br/>At that moment, Xiao Zhi said in Xiao Jinli’s mindscape, “Master, the seven-colored tea flower!”<br/><br/>Xiao Jinli immediately remembered another purpose for coming here.<br/><br/>She said, “Brother Xiao Quan, do you remember the seven-colored tea flower seeds we bought?”<br/><br/>Xiao Siqian nodded and said, “Of course I remember. Speaking of which, sister<br/><br/>Jinli, how are you going to plant that seed?”<br/><br/>Xiao Jinli blinked her eyes and then with a mysterious smile said, “Come, follow me.”<br/><br/>Then, she led Xiao Siqian to… the edge of the cliff.<br/><br/>Standing on the edge of the cliff, she pointed to a spot inside the cliff and said, “There, that’s it.”<br/><br/>“Huh?” Xiao Siqian was astonished. “Plant it on the cliff? Sister Jinli, how did you manage to plant the seed on a cliff?”<br/><br/>“Hehe, it was an accident!” Xiao Jinli explained, “When I originally came here, I brought the seeds with me. However, the seeds accidentally fell off. To my surprise, they sprouted not long afterwards.”<br/><br/>In fact, they all sprouted from the seeds planted in her space and then transplanted out.<br/><br/>“It seems that this cliff is suitable for growing tea flowers!” Xiao Jinli said, “Look how it’s growing vibrant and hardy yet cute. It shouldn’t take long before it blooms.”<br/><br/>But Xiao Siqian asked confusedly, “But how did you manage to transplant it? It’s so dangerous to go down such a steep cliff!”<br/><br/>Xiao Jinli said, “For me, that’s a small challenge.”<br/><br/>Xiao Siqian,<br/><br/>Then, he saw Xiao Jinli fetch a thick rope from a corner, tie one end to a big pine tree and the other end around her waist. Holding a small iron shovel in her hand, she jumped directly off the cliff.<br/><br/>That’s right, she just jumped down.<br/><br/>Xiao Siqian’s face instantly became pale with fright.<br/><br/>He yelled, “Sister Jinli!”<br/><br/>Then, he rushed to the edge of the cliff in two or three steps, looked down and suddenly burst into laughter.<br/><br/>Xiao Jinli was standing on a rock perfectly fine.<br/><br/>Xiao Siqian heaved a sigh of relief and laughed, “Hehe, you really scared me!”<br/><br/>Then he became solemn and said, “Sister Jinli, do you know how dangerous it is to do what you did. What if the rope didn’t hold? Or what if you hit your head while jumping? These things could lead to serious accidents.”<br/><br/>Xiao Jinli laughed and said, “I told you this is my territory, nothing will happen to me.”<br/><br/>“No matter what, it’s always better to be careful!” Xiao Siqian expressed his concern sincerely.<br/><br/>Xiao Jinli nodded and said, “Hmm, I’ve got it.”<br/><br/>Then, she carefully walked towards the tea flower tree, stepping on the edge of the rock.<br/><br/>Once she reached the tea flower tree, she carefully dug it up.<br/><br/>Before long, the entire seedling was dug up.<br/><br/>She yelled to Xiao Siqian, “Brother Xiao Quan, I am done digging. Pull me back up.”<br/><br/>“Okay, I’m pulling now. Just be careful!”<br/><br/>Xiao Siqian grabbed the rope and pulled. Before long, Xiao Jinli was pulled up.<br/><br/>She held a small iron shovel in one hand and a small tea tree in the other.<br/><br/>Xiao Siqian thoroughly checked Xiao Jinli and breathed a sigh of relief, saying, “That’s good, that’s good. There were no injuries!”<br/><br/>Xiao Jinli smiled and said, “since I was able to go down, I would never allow myself to get hurt.”<br/><br/>She looked at the small tea tree and said, “This small sapling has been transplanted. Now we need to go home and plant it in a flower pot.”<br/><br/>Xiao Siqian nodded in agreement, “Okay, let’s hurry back home!”<br/><br/>Mainly because, staying here, what Xiao Jinli was doing was too thrilling and if he stay here any longer, he’d be scared half to death.<br/><br/>Then, Xiao Siqian packed up the equipment, picked up the wild rabbits and chickens on the ground, and left.<br/><br/>Xiao Jinli held the small tea tree sapling in her hand.<br/><br/>As for Little White and Little Cutie, after meeting with Xiao Siqian, they left.<br/><br/>On the way back for Xiao Siqian, his heart was pounding non-stop.<br/><br/>Xiao Jinli had given him too many surprises.<br/><br/>At the same time, he vowed silently to make himself stronger.<br/><br/>Only by becoming stronger can he break through any barrier, and protect the people he wants to protect.<br/><br/>He didn’t know how powerful Xiao Jinli was, but he couldn’t fall too far behind her. Otherwise, instead of providing protection, he might become the one who needed to be protected.<br/><br/>When Xiao Jinli and Xiao Siqian arrived home and saw what they were carrying, Xiao’s mother was quite surprised.<br/><br/>Xiao’s mother asked with a smile, “You caught so many rabbits today?”<br/><br/>Xiao Jinli responded directly, “Brother Xiao Quan wanted to taste various dishes made with wild rabbits, so I found two rabbit nests and caught a few rabbits.”<br/><br/>Xiao’s mother, “…” So they had found a rabbit nest.<br/><br/>She also noticed the small tree in Xiao Jinli’s hand and asked, “What kind of sapling is this?”<br/><br/>Xiao Jinli said, “This is a tea flower sapling! It’s something I found on the mountain. The buds aren’t open yet, so I don’t know what kind it is!”<br/><br/>Xiao Siqian,\t\t\t\t\t\t</div>", "images": {}, "success": true}