{"id": 146, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298147.html", "title": "Chapter 146 - Chapter 146: Chapter 146: A Summer’S Dream 1 (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 146 - Chapter 146: Chapter 146: A Summer’S Dream 1 (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 146: Chapter 146: A Summer’s Dream 1 (Second update)<br/><br/>Translator: 549690339<br/><br/>Capital City Su Family<br/><br/>Lady Su sat on the high-end sofa seat with a pale face, looking at Su Xiangdong across from her, she said anxiously, “Husband, I heard from the Xia family people that Su Yichen was found by Old Man Xia, and they have sent someone to pick him up.”<br/><br/>Then she scolded, “This damn kid, I don’t know where he hid for the past half year, making us search for him for so long.”<br/><br/>Upon hearing that Su Yichen was coming back, Su Xiangdong was immediately frightened, his voice raised slightly, “Impossible! How did that old man find that bastard?”<br/><br/>Hearing the news of Su Yichen being found, Su Xiangdong’s first reaction was panic and fear.<br/><br/>For the past six months, the cellphone in the drawer had been taken out from time to time, trying to contact that person.<br/><br/>But that person’s cellphone was initially busy and then turned off, and ultimately became unreachable.<br/><br/>He couldn’t contact that person, nor could he find his missing son.<br/><br/>Everything seemed to have sunk into the sea.<br/><br/>However, to get all of Xia Zhi Meng’s inheritance, he had to find Su Yichen.<br/><br/>Normally, a missing person could be reported.<br/><br/>But the family of three had a guilty conscience and didn’t dare to report it, so they had to send more people to search in private.<br/><br/>Who would have thought that it would take six months.<br/><br/>But after half a year, Old Man Xia found him.<br/><br/>Lady Su cursed Su Yichen for a moment, then suddenly realized something.<br/><br/>She asked with a puzzled look, “Wait, how did that old man from the Xia family find Su Yichen? Didn’t he break Old Man Xia’s heart? Why would Old Man Xia go looking for that kid? Does Old Man Xia know about the will?”<br/><br/>This was what concerned her the most.<br/><br/>If Old Man Xia knew about the will, was he looking for that kid for the sake of the will?<br/><br/>The Xia family had been on a decline in recent years, far from its past glory.<br/><br/>It was said that Xia Zhiming, the treacherous elder brother, had invested in a new project which was now stuck and in urgent need of funds.<br/><br/>Therefore, they might be eyeing Xia Zhi Meng’s inheritance.<br/><br/>“Husband, we must not let Su Yichen restore his relationship with the Xia family,” Lan Yingying said anxiously, “What if Su Yichen is fooled by them and gives away all his mother’s inheritance to the Xia family? Then our decades of work would have been in vain, right?”<br/><br/>Most importantly, she already considered everything about Su Yichen as her son’s.<br/><br/>Su Xiangdong’s face turned ugly when she mentioned this, and his panicked thoughts were interrupted. He scolded in a low voice, “Keep your voice down, the walls have ears, don’t you know?”<br/><br/>Then, he tried to comfort her, “If that bastard was so easy to coax, his relationship with the Xia family wouldn’t have been so tense. So, even if the Xia family has found him, the brat might not necessarily be willing to accept their affection.’<br/><br/>With her husband saying this, Lady Su suddenly felt somewhat relieved and said, “That’s true. If that damn kid was so easy to coax, we wouldn’t have spent more than a decade creating a warm family atmosphere for him, just to get him to willingly give up his mother’s inheritance rights. Humph, the Xia family’s wishful thinking is wrong.”<br/><br/>Upon saying this, she asked again, “Husband, now that the Xia family has gotten him back, what should we do to get that smelly kid back home and then have him give up his mother’s inheritance in person?”<br/><br/>Su Xiangdong’s dark eyes flickered with an ambiguous intent, and he said, “How did we do it before? After he returns, I’ll continue doing the same. Also, you need to remind Yangyang to keep up the act and not reveal any flaws. This concerns whether or not he can inherit Xia Zhi Meng’s inheritance.”<br/><br/>Lady Su nodded and said, “Yes, I will remind him.”<br/><br/>In the past six months, due to Su Yichen’s disappearance, Su Hanyang had become more and more exposed to his true nature.<br/><br/>So, she had to remind her son to control his nature, and after he had obtained all of Xia Zhi Meng’s inheritance, he could do whatever he wanted.<br/><br/>The Xia family was once one of the top four wealthy families in Capital City, but that was twenty years ago.<br/><br/>Now, the Xia family had not produced anyone with business talent who could lead the Xia family to greater heights.<br/><br/>Xia Weiguo, the head of the Xia family and Su Yichen’s maternal grandfather, had three sons and one daughter.<br/><br/>The eldest son was Xia Zhiming, the second son was Xia Zhiliang, the third son was Xia Zhibin, and the daughter was Xia Zhi Meng.<br/><br/>The three sons were mediocre, while Xia Zhi Meng was very talented in business.<br/><br/>Twenty years ago, Xia Weiguo wanted to capitalize on his daughter’s business talent to open a new field for the Xia Corporation and lead the entire Xia family  to new heights. Then he would hand over the Xia family to the next heir and let Xia Zhi Meng marry into another family.<br/><br/>But things didn’t go as planned.<br/><br/>Xia Zhi Meng fell in love with a phoenix man from the countryside and broke with her family to marry him.<br/><br/>The so-called sky-high dowry was all earned by Xia Zhi Meng herself.<br/><br/>Even though he had severed ties with his daughter, Xia Weiguo maintained his dignity by claiming that Xia Zhi Meng’s dowry was given by the Xia family.<br/><br/>Xia Zhi Meng didn’t want to make things too difficult for her father, so she agreed to the arrangement.<br/><br/>However, Xia Zhi Meng married the wrong person.<br/><br/>After marrying Su Xiangdong, Xia Zhi Meng gave him funds to start the Su Corporation. Later, using her connections and resources, she helped her husband expand the company’s scale and industry.<br/><br/>Su Xiangdong was deeply moved.<br/><br/>To show his sincerity, he directly gave Xia Zhi Meng a 40% share of the company, making her the second-largest shareholder.<br/><br/>After Xia Zhi Meng got pregnant and gave birth to a child, she gradually gave up her control over the company for the sake of the child, and finally stopped managing the company altogether. However, she would give advice when her husband encountered difficulties.<br/><br/>As the company grew rapidly, the Su Corporation soon became the Su Group, and its fame spread in Capital City. In just three or four years, it became one of the top wealthy families in Capital City.<br/><br/>As the Su Group’s position in Capital City became more and more stable, Su Xiangdong began to reveal his true nature.<br/><br/>Especially after Xia Zhi Meng gave birth to their child, her health declined, and he began to frequently go out and not return home.<br/><br/>Or when he returned home in the middle of the night, he would have lipstick marks on his neck or shirt, or the scent of other women on his body.<br/><br/>His only excuse was that he was attending social engagements and got smudged accidentally.<br/><br/>Later on, he even stopped bothering to explain.<br/><br/>Xia Zhi Meng suspected that he had someone else outside.<br/><br/>Su Xiangdong accused her of being paranoid and neurotic.<br/><br/>The quarrels between the two increased, Xia Zhi Meng’s health worsened, and her mental state was very bad. The once sharp and capable Xia Zhi Meng in the business world was now like a resentful wife trapped in a palace, repressed, sighing, and washing her face with tears every day.<br/><br/>What completely crushed her was a single photograph!\t\t\t\t\t\t</div>", "images": {}, "success": true}