{"id": 149, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298156.html", "title": "Chapter 149 - Chapter 149: Chapter 149: Don ‘T Argue With Something That Isn ‘T Human (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 149 - Chapter 149: Chapter 149: Don ‘T Argue With Something That Isn ‘T Human (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 149: Chapter 149: Don ‘t Argue with Something That Isn ‘t Human (First Update)<br/><br/>Translator: 549690339<br/><br/>“Sigh, I don’t know if Xiaoquan has gone back yet?” Xiao Mother looked at the empty chair and sighed softly, with a worried look on her face.<br/><br/>Xiao Father was silent.<br/><br/>Xiao Jinli said, “Mom, don’t worry. Didn’t you see the three cars that came to pick up Brother Little Quan? They were all bodyguards. With bodyguards to protect him, Brother Little Quan will definitely be able to get to the Capital City safely.”<br/><br/>After Su Yichen returned to the Capital City, she found out.<br/><br/>However, Xiao Mother was even more worried, “That’s why I’m even more concerned. You know, he’s from the Capital City, so how did he end up in our remote little village? He was brought down from the mountain covered in blood by Xiao Bao, wasn’t he? He must have enemies, so the people who came to pick him up were so cautious.”<br/><br/>Xiao Jinli couldn’t reveal Su Yichen’s situation, so she continued to reassure her, “Mom, Little Quan had a narrow escape from death, so he’s bound to have good fortune. Little Quan is clever, he will definitely protect himself. Don’t worry. Maybe soon, he will contact us and let us know he’s safe.”<br/><br/>Xiao Mother let go of her worries and nodded, “Yes, Little Quan is a lucky child, and he is so smart, he can definitely protect himself.”<br/><br/>Xiao Father also agreed, “Yes, this kid Xiaoquan is smart, he can definitely protect himself.”<br/><br/>After dinner, Xiao Jinli went back to her room and lay down on her soft bed, lost in deep thought.<br/><br/>From the information Xiao Zhi had given her, the people surrounding Su Yichen all had their own motives and thoughts, like ghosts, gods, snakes, and horses.<br/><br/>Even his maternal grandfather, who he contacted and sent someone to pick him up, had ulterior motives for him.<br/><br/>Xiao Jinli mumbled, “Su Yichen, it seems your days are anything but peaceful.” After a while, she flashed into the space again.<br/><br/>In the space, besides the planted vegetables and fruits, there were four small buds.<br/><br/>That’s right, these four small buds were the remaining Seven Color Tea Flower seedlings.<br/><br/>Xiao Zhi flew around in mid-air for a few laps before stopping on her hair and curiously asked, “Master, these four Seven Color Tea Flowers all survived. What do you plan to do with them? When they bloom, will you sell them? Hmm, based on the value of these Seven Color Tea Flowers, you could sell them for at least ten million. Ah, Master, you’ve made a fortune, aren’t you happy?”<br/><br/>Xiao Jinli, ‘<br/><br/>Then, she rolled her eyes and said with annoyance, “Don’t you know what it means to be valuable due to rarity? If these four tea flowers are sold together, their value will definitely be much lower.”<br/><br/>Xiao Zhi got excited and said, “So, Master, do you plan to sell them one by one?<br/><br/>Then where will you sell them?”<br/><br/>“For such valuable tea flowers, a small county town won’t be able to handle it. So if we want to sell it, we have to go to a big city.” As Xiao Jinli said this, a somewhat frustrated expression appeared on her face, “But to go to a big city, with my age, bringing this pot of flowers, my parents will definitely not agree.”<br/><br/>She had to lie low, and her age was both her strength and her weakness!<br/><br/>Xiao Zhi tilted his little head, held his little cheeks with both hands, and curiously asked, “So, Master, what are you going to do?”<br/><br/>Xiao Jinli’s eyes flickered, and suddenly she looked excited, “I just thought of it, I can’t go, but I can find someone to go. In terms of strength and connections, he is the most suitable person to represent me.”<br/><br/>Xiao Zhi was puzzled and asked, “Who is this person after all?”<br/><br/>Xiao Jinli looked at him, blinked mischievously, and said, “Aren’t you very smart? Why don’t you guess?”<br/><br/>Xiao Zhi, “…” He always ended up on the losing end when sparring with his master.<br/><br/>However, the one trick that always worked on his master after two lifetimes of fighting wit and strength…<br/><br/>“Master, please, just tell me!” Xiao Zhi coaxed.<br/><br/>Xiao Jinli touched her forehead with her fingertips and said somewhat helplessly, “Xiao Zhi, you’re the most advanced smart brain in the world after all. Can you not always resort to this?”<br/><br/>Xiao Zhi said innocently, “What set are you talking about, Master? I don’t understand!”<br/><br/>“…” Xiao Jinli said, “Forget it, you win. However, you’ll know who this person is later.”<br/><br/>Xiao Zhi• , “…” It seemed that acting coquettish was not working this time.<br/><br/>Xiao Jinli glanced at the vast expanse of fruits and vegetables in the space and said, “It seems we need to transplant these crops out as soon as possible.”<br/><br/>Previously, the empty space in the five points of land she planted was too obvious, so she could only transplant some out when everyone else wasn’t paying attention.<br/><br/>Otherwise, with no vegetables available in the village, the shops in town would be unable to maintain daily operations.<br/><br/>Xiao Zhi immediately flew up in mid-air and nodded in agreement, seeing the vast array of vegetable and fruit, “That’s true. Otherwise, these things cannot be transplanted out, and we won’t be able to continue planting. Fortunately, it’s almost the end of the year and the company is going through the final process. After the year, the company will be established. After spring, the whole village will be planting vegetable and fruit, and then it will be much easier to move these things out.”<br/><br/>Xiao Jinli nodded in agreement, “Indeed.”<br/><br/>However, Xiao Zhi suddenly gave her a side-eye, reminding her, “So, Master, you need to hurry up and feed your more than 100,000 earthworms well and full. Otherwise, when everyone starts planting, if you don’t have enough earthworms, it will be troublesome.”<br/><br/>Xiao Jinli said irritably, “I don’t need you to remind me, I know! You’ve never seen me do anything without a bit of measurement or certainty. It’s just a mere one hundred thousand earthworms. Back in the day, I had to support one billion people.”<br/><br/>“A hero never speaks of his past glories!” Xiao Zhi retorted.<br/><br/>Xiao Jinli, ‘<br/><br/>Forget it, don’t argue with something that isn’t human.<br/><br/>The next day, Xiao Jinli went to the greenhouse.<br/><br/>The five-acre greenhouse was separated from the original five points of land greenhouse, but the land was close together.<br/><br/>Because Xiao Family Vegetables sold so well, everyone in the town knew that the earthworms of Xiao Family Village were the key to growing good vegetables.<br/><br/>Therefore, Xiao Jinli’s earthworms attracted much attention and interest and might also bring ill-intentioned people.<br/><br/>As soon as Xiao Jinli entered the greenhouse, Shi Dajiang was leading his grandson to check if the earthworms in the field had grown or died.<br/><br/>Dead earthworms were to be picked up and fed to chickens.<br/><br/>Seeing Xiao Jinli come in, Shi Dajiang immediately shouted respectfully, “Little Householder.”<br/><br/>The obedient grandson beside him also called out, “Little Householder!”<br/><br/>Xiao Jinli said, “Grandpa Shi, you don’t have to come and watch during the day, and you can rest freely.”<br/><br/>It was the night that needed to be watched when everyone else was resting.<br/><br/>Shi Dajiang said, “It doesn’t matter, it doesn’t matter, I have nothing to do during the day anyway, so I just came over to have a look!”<br/><br/>Since he was given a job, he had to take it seriously.<br/><br/>Xiao Jinli looked at the child next to him and said, “Grandpa Shi, you may not need to rest, but Xiao Bao needs to rest well. He is growing and developing, and you should let him sleep well.”<br/><br/>Shi Dajiang laughed and said, “This child sleeps soundly in the house at night.”<br/><br/>There was a house right next to them where he could watch the greenhouse while sitting in the house, simply observing the surroundings for any movement, without affecting his grandson’s sleep.<br/><br/>Xiao Jinli, ‘\t\t\t\t\t\t</div>", "images": {}, "success": true}