{"id": 148, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298153.html", "title": "Chapter 148 - Chapter 148: Chapter 148: Xia Family (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 148 - Chapter 148: Chapter 148: Xia Family (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 148: Chapter 148: Xia Family (Second Update)<br/><br/>Translator: 549690339<br/><br/>Upon Su Yichen’s return to the Xia family home, Xia Weiguo was already waiting at the door, assisted by an old housekeeper.<br/><br/>His three uncles, their wives, and his cousins had also come out to greet him.<br/><br/>In fact, it seemed as if they were welcoming an important person.<br/><br/>“Really, he is just a cousin we haven’t been in touch with for more than 10 years. Why did grandfather insist we all come out to welcome him? It made me turn down a date with a pretty girl,” Xia Xinbei, a man decked out in gold jewellery, grumbled.<br/><br/>“Yes, he’s nothing special, why do we all have to come and greet him?” A trendy woman, Xia Danni, expressed her displeasure.<br/><br/>“We haven’t heard anything about him for more than 10 years, so why the sudden fuss?” Xia Xinnan raised doubts. “Does this mean the cousin will live with us in the Xia Family from now on?”<br/><br/>“What? That’s impossible!” Xia Xinbei protested passionately. “He is a member of the Su Family; why should he stay in the Xia Family? Is it because he wants to…”<br/><br/>He didn’t finish his sentence, but everyone understood what he was suggesting straight away.<br/><br/>He might take away the Xia Family’s property.<br/><br/>Despite the size of the Xia Family, there were many people.<br/><br/>The share of the property distributed amongst everyone was not much to start with. If another person were to be added, it would mean everyone would get even less.<br/><br/>Upon this realization, the faces of Xia’s younger generations turned sour.<br/><br/>“Humph, I am not waiting any longer. Whether or not he comes is none of my concern,” grumbled Xia Xinbei impatiently before heading towards the garage. Seeing him leave, Xia Zhiming demanded, “Xia Xinbei, where are you going?”<br/><br/>“I have something to do, ” responded Xia Xinbei, ignoring his father’s calling and leaving straight away.<br/><br/>Xia Zhiming’s face turned pale with frustration, and he shouted, “You ungrateful son, come back!”<br/><br/>Xia Zhiming’s wife, Yu Zhen, quickly tried to smooth things over, “It’s alright,<br/><br/>Xinbei just had something to do and had to leave, there’s no need to get angry. Besides, for our whole family, his elders, to wait for your nephew, we’ve already given him so much face. Don’t be harsh on these young people.”<br/><br/>After Xia Xinbei left, the other discontented youngsters also left and didn’t look back. However, Xia Xindong, the eldest son and grandson of the Xia Family, didn’t leave.<br/><br/>The car delivering Su Yichen home met Xia Xinbei just as he was driving out of the villa.<br/><br/>Seeing three bodyguard cars following behind Su Yichen, his complexion went sour instantly. As he hit the steering wheel, he cursed under his breath, “Bastard! ”<br/><br/>The sharp gaze from inside the black car immediately landed on him.<br/><br/>Xia Xinbei blinked in surprise, wondering, “Could that bastard have heard me?”<br/><br/>Nevertheless, he quickly put it aside, sneering to himself, “Hmph, even if he heard, so what? That motherless bastard can’t do anything to me.”<br/><br/>With this consoled, he left without further ado.<br/><br/>Turns out, as Xia Xinbei had guessed, Su Yichen heard everything clear and bright.<br/><br/>Due to half a year of living in the Xiao home and consuming Lingquan water, not only had his physical fitness improved, every one of his senses had also become sharper.<br/><br/>Despite the distance, he could hear even the slightest sound clearly.<br/><br/>With the tea tree seedling cradled carefully in his arms, Su Yichen kept his gaze down, his face revealing no emotion, and no one could tell what he was thinking.<br/><br/>After a while, a bodyguard knocked on the car door and respectfully told him, “Young Master Su, we have arrived!”<br/><br/>With the pot of tea tree seedling in his arms, Su Yichen stepped out of the car without a hint of expression.<br/><br/>Upon Su Yichen’s arrival, an old man in his seventies or eighties, whose hair may have greyed but eyes were still sharp, came towards him with visible excitement. He tentatively called, “Xiao Chen!”<br/><br/>The fervour in his eyes was hard to miss.<br/><br/>Compared to this, Su Yichen looked unperturbed, and calmly responded, “Grandfather!”<br/><br/>Even so, his voice was enough to bring tears to the old man’s eyes. Nodding, he said, “Yes, Xiao Chen, you have been through a lot out there.”<br/><br/>Shaking his head, Su Yichen responded, “Grandfather, sorry to have made you worry!”<br/><br/>Hearing Su Yichen’s words, Xia Weiguo nodded and said, “Good, good, you have grown up and become so understanding.”<br/><br/>“Of course, I have grown up! I should understand these things,” said Su Yichen.<br/><br/>“Having worried you for so long, I would like to apologize to you, grandfather!”<br/><br/>“Good, good, good child!” Xia Weiguo kept nodding, visibly moved and gratified.<br/><br/>Watching the interaction between the grandfather and grandson, a gleam flashed in Xia Zhiming’s eye.<br/><br/>Then he stepped forward and said, “Xiao Chen, you have grown up and understand things even better. Your eldest uncle is really gratified.”<br/><br/>Even though Su Yichen’s relation with the Xia family wasn’t that great due some ideas implanted into his mind by Su Xiangdong. All the people he was supposed to know, he knew.<br/><br/>But not now!<br/><br/>With a puzzled look, Su Yichen asked, “Grandfather, who are they?”<br/><br/>Xia Zhiming and the others, ‘ .<br/><br/>His grandfather immediately introduced, “They are your uncles. This is your eldest uncle…”<br/><br/>One by one, he introduced.<br/><br/>Immediately, Su Yichen said respectfully, “Sorry, uncles, I have lost my memory. However, it was my fault in the past and I apologize for making you all worry.”<br/><br/>“Ha Ha, you were young in the past and not understanding things could be excused.” Xia Zhiming laughed happily, “Let’s go inside the house to talk. Now that you are home, you should feel at ease. Your father wouldn’t dare set foot here.”<br/><br/>Su Yichen fell silent and didn’t respond.<br/><br/>He walked into the living room of the Xia family, still carrying the flower pot in his arms.<br/><br/>Seeing the plant pot in his hands, his eldest aunt looked puzzled and asked, “Xiao Chen, why are you carrying a pot of flowers? It seems inconvenient. Why don’t you give it to me so I can have it placed in the garden? I will ask the gardener to look after it for you!”<br/><br/>As she spoke, she reached out to take the pot of flowers.<br/><br/>Su Yichen swiftly moved aside and gently declined, “No need, eldest aunt, it’s not inconvenient for me.’<br/><br/>His eldest aunt looked surprised, and a tinge of dissatisfaction crossed her heart. She felt that Su Yichen was ungrateful.<br/><br/>“Alright, it’s just a pot of flowers, let Xiao Chen hold it however he wishes,” said Xia Weiguo.<br/><br/>Then he curiously asked, “Xiao Chen, tell me about this pot of flowers?”<br/><br/>Su Yichen replied, “It was given to me by a friend.”<br/><br/>He offered no further explanation.<br/><br/>“Good, good …” Xia Weiguo didn’t ask further. But his inquiry took a different turn, “Xiao Chen, how did you end up in that small mountain village during these six months? Did something happen to you? Do you know that, in the six months when you went missing, your grandfather couldn’t eat or sleep well out of worry. I was even afraid that you were being mistreated out there, and even suspected at one point that that bastard Su Xiangdong might have done something to you.”<br/><br/>“Grandfather, nothing happened. It’s just that I was feeling a bit down about a half year ago. So I went out for a walk, and ended up in that small mountain village. Seeing the hospitable and simple villagers, I decided to stay there for a while.” Su Yichen shook his head and explained.<br/><br/>“Young man, why didn’t you let us know when you went to the mountain village?” the eldest aunt asked, her tone filled with blame. “We thought you went missing and even almost reported it to police. It made us all worry.”<br/><br/>She was blaming Su Yichen for his lack of consideration..\t\t\t\t\t\t</div>", "images": {}, "success": true}