{"id": 151, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298162.html", "title": "Chapter 151 - Chapter 151: Chapter 151: I Lost My Memory (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 151 - Chapter 151: Chapter 151: I Lost My Memory (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 151: Chapter 151: I Lost My Memory (First Update)<br/><br/>Translator: 549690339<br/><br/>Capital City<br/><br/>The cold wind was blowing fiercely, and heavy snow was falling, covering the entire Capital City in a silvery-white blanket.<br/><br/>In a 56-story building, a tall figure stood by the window in a spacious office, gazing down at the cars below cautiously moving through the snowstorm and the pedestrians wrapped up, revealing only their eyes, hurrying along carefully.<br/><br/>After a while, he looked at the green tea tree seedling on his office table, a sense of longing flashing in his eyes.<br/><br/>“Uncle, Aunt, Brother Xuan, and Jinli, is it snowing over there? It’s already the second snowfall in the Capital City.” He cast his glance outside again, “I miss you all so much!”<br/><br/>Capital City was where he grew up, and all his relatives and friends were here.<br/><br/>But he felt extremely lonely!<br/><br/>From the moment he returned to Capital City, he had hidden all his emotions.<br/><br/>Once a gentle, modest and polite sunny boy among all the ladies, after experiencing betrayal from his family and going through death, he had become a handsome, indifferent, and deep man.<br/><br/>Ironically, he was only nineteen years old!<br/><br/>Su Yichen looked up at the falling snow in the sky and muttered, “It’s almost<br/><br/>New Year! I wish I could spend it with you all!”<br/><br/>But this simple wish was quite lavish for him now, given his current fragile state.<br/><br/>Everyone around him was eyeing the huge inheritance his biological mother left behind.<br/><br/>Now everyone was hypocritically trying to please him.<br/><br/>Having enjoyed warmth and true feelings in Xiao Family Village, he was not someone who could be deceived by those superficial pretenses. Even his maternal grandfather, who now doted on him, was the same!<br/><br/>“Bang bang!” Someone knocked on the door outside.<br/><br/>“Come in!” Su Yichen’s cold and deep voice rang out.<br/><br/>A moment later, a tall woman in a professional outfit entered to report, “Mr. Su, CEO Su is looking for you!”<br/><br/>Su Yichen now held the position of deputy general manager in the Xia Corporation, directly replacing Xia Xinnan’s previous position.<br/><br/>Of course, the members of the Xia Family, apart from Xia Weiguo and Xia Changming, unanimously opposed the decision. However, the two strong-willed individuals appointed Su Yichen directly.<br/><br/>Su Yichen did not refuse.<br/><br/>After he started working at Xia Corporation, Su Xiangdong and Lady Su, who learned the news, suddenly felt a sense of anxiety.<br/><br/>Therefore, Su Xiangdong visited Su Yichen as soon as possible.<br/><br/>However, perhaps due to Xia Weiguo’s instructions, he was driven out by security guards and bodyguards.<br/><br/>Later, he tried calling Su Yichen but was informed that he had changed his number and the old one was deactivated.<br/><br/>Suddenly losing all contact with Su Yichen made Su Xiangdong even more frantic.<br/><br/>He was more worried that Xia Zhi Meng’s inheritance would be taken away by Xia Weiguo, which would render all his calculations useless.<br/><br/>So, he continued to visit Su Yichen at Xia Corporation, claiming to be his father.<br/><br/>“Alright, let him in!” Su Yichen said calmly. It was time to face him.<br/><br/>Immediately, he walked to his office table.<br/><br/>With an air of rage, Su Xiangdong stormed in and as soon as he opened his mouth, he scolded, “Su Yichen, you unfilial son, is this how you treat your biological father?”<br/><br/>Su Yichen furrowed his eyebrows and asked in confusion, “You said you’re my biological father?”<br/><br/>Su Xiangdong, “…” What was going on? This unfilial son seemed not to recognize him.<br/><br/>No, he must be pretending.<br/><br/>With that thought in mind, Su Xiangdong’s anger flared up, and he pointed at Su Yichen and scolded,<br/><br/>“Fine, you unfilial son, to climb up the Xia Family, even I, your biological father, am not recognized by you? Has your conscience been eaten by a dog?<br/><br/>You should know that since your disappearance, your mother and I have been so worried that we couldn’t eat or sleep, and your mother has lost several pounds due to worrying about you. You didn’t return to the Su Family, but even worse, you don’t recognize us. You… you’ve really angered me to death.”<br/><br/>After hearing Su Xiangdong’s words, Su Yichen sneered in his heart but put on a clueless face and said, “You said you’re my father and that there’s a mother as well, but I have no memory of them. I’ve lost my memory.”<br/><br/>“Lost…lost your memory?” Su Xiangdong was stunned. He asked in disbelief, “How could you lose your memory?”<br/><br/>Su Yichen shook his head and said, “I don’t know how I lost my memory either.<br/><br/>About half a year ago, someone saved me from the deep mountain forest. covered in blood. When I woke up, I had lost all my memories!” Back then, when he woke up in the hospital, he was indeed amnesiac.<br/><br/>Of course, he was pretending, but who would know?<br/><br/>He had been staying in Xiao Family Village as an amnesiac for half a year.<br/><br/>His condition had been verified by the local Yamen.<br/><br/>Even if anyone investigated, the result would still be that he was an amnesiac.<br/><br/>Su Xiangdong had thought of hundreds of consequences for finding Su Yichen but never expected this.<br/><br/>Amnesia?<br/><br/>Upon learning the answer, he didn’t know whether to cry or laugh.<br/><br/>During these six months, he had been in constant fear because he couldn’t make contact with Su Yichen. He had thought that those people might have killed Su Yichen, which would not be good news for him.<br/><br/>That was because he hadn’t obtained Xia Zhi Meng’s inheritance yet.<br/><br/>But suddenly, half a year later, Su Yichen returned.<br/><br/>However, the first thing he did when he returned was not to go back to the Su Family, but to the Xia Family, which he had been resisting all along. His first reaction was that Su Yichen must have learned the truth and was planning to join forces with the Xia Family to take revenge on the Su Family.<br/><br/>With such entangled and uneasy feelings, Su Xiangdong had to confront Su Yichen face to face.<br/><br/>He never expected Su Yichen to have lost his memory.<br/><br/>Su Xiangdong’s sharp eyes stared intently at Su Yichen and asked skeptically,<br/><br/>“Have you really lost your memory?”<br/><br/>Su Yichen shrugged and spread his hands, saying, “I don’t want to have lost my memory either. But the fact is, I did lose my memory.”<br/><br/>Su Xiangdong asked doubtfully, “Since you lost your memory, you shouldn’t remember anyone, right? But how did you get in touch with the Xia Family and start living with them?”<br/><br/>Su Yichen explained, “I don’t know how I got in touch with the Xia Family either. Half a year ago, after I was saved by someone in the mountains and woods, I suffered severe internal and external injuries and stayed in the hospital for a long time. After I recovered, I stayed with a local farmer.<br/><br/>But some time ago, a phone number suddenly popped up in my head, and when I called it, I found out it was my grandfather’s. Then, my grandfather told me that I had been missing for more than half a year and everyone had been frantically looking for me.”<br/><br/>Su Xiangdong asked incredulously, “How could you think of your grandfather’s phone number? Why not mine? You know, you didn’t have a good relationship with your grandfather before, even treating him as an enemy?”<br/><br/>Immediately, he thought of something, and he yelled, “Su Yichen, you must be lying to me! If you have really lost your memory, how come you went to see Liu Qingming the moment you returned to the Capital City?”<br/><br/>Ever since Su Yichen came back to the Capital City and stayed with the Xia Family, he had been investigating him.<br/><br/>Su Yichen,\t\t\t\t\t\t</div>", "images": {}, "success": true}