{"id": 154, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298171.html", "title": "Chapter 154 - Chapter 154: Chapter 154: Racing Drama 2 (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 154 - Chapter 154: Chapter 154: Racing Drama 2 (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 154: Chapter 154: Racing Drama 2 (Second Update)<br/><br/>Translator: 549690339<br/><br/>“Oh, Xiao Chen is back.”<br/><br/>As soon as he returned to Xia Family, Xia Weiguo smilingly called out to Su Yichen and then asked with concern, “Xiao Chen, is your work hard? Are you tired? Should I reduce your workload for you?”<br/><br/>Su Yichen shook his head, laughed, and replied, “Grandfather, I’m not tired.”<br/><br/>“Good, pay attention to your own body,” Xia Weiguo instructed, “If you feel tired, take more rest. A healthy body is essential to success.”<br/><br/>“Yes, yes, I know, Grandfather!” Su Yichen respectfully replied.<br/><br/>At this moment, Xia Weiguo asked, “Hmm, Chen’er, I heard that your stepmother went to see you today?”<br/><br/>Su Yichen nodded, “Yes, Su Xiangdong came to find me the day before yesterday, and his wife came to find me today.”<br/><br/>“So, did they say anything?” Xia Weiguo probed, “For example, asking you to return to the Su Family?”<br/><br/>Su Yichen shook his head, “They only came to see me in my office. They just told me that they are my parents, but since I have amnesia, I have no way ofrecognizing them. Naturally, they didn’t have much to say.”<br/><br/>Xia Weiguo, ‘<br/><br/>Xia Weiguo secretly breathed a sigh of relief, and then said, “Sigh, you can’t believe what they say. They are the culprits responsible for your mother’s death. Your real mother committed suicide by jumping off a building because of depression caused by learning about their affair and that they had a three-year-old child before you. Your mother couldn’t stand the blow and jumped.”<br/><br/>Saying this, he looked into the distance, sighed lightly, and continued,<br/><br/>“Fortunately, your mother was sane enough before jumping to leave a will at the lawyer’s office. All of her property can only be inherited by you when you turn 18 years old. It’s because of this inheritance that your mother left behind that you have not been harmed in the Su Family for the past decade. Your mother saved your path.”<br/><br/>Upon saying this, his eyes turned red, and he said with great sorrow, “I let<br/><br/>Meng’er down. If only I had been more persistent back then, investigated Su Xiangdong more thoroughly before she married that scum, then maybe your mother would not have married him and would not have died so young.”<br/><br/>He knew that his daughter had always been clever, and he never expected that she could leave a way out for her son before dying.<br/><br/>This daughter of Xia Zhi Meng, he used to genuinely care for and love her – his only daughter.<br/><br/>After she grew up, she increasingly disobeyed him, challenged his fatherly authority, and he angrily abandoned this gifted daughter.<br/><br/>After hearing Xia Weiguo’s words, Su Yichen’s deep eyes flashed a dark light behind his lowered eyelids.<br/><br/>He then comforted Xia Weiguo with teary eyes, “Grandfather, don’t blame yourself. If we’re going to blame someone, we should blame Su Xiangdong for being too good at deception. He deceived both you and my mother, causing her  to lose her life at such a young age.”<br/><br/>Then he seemed to make a promise to Xia Weiguo, “Grandfather, don’t worry. I’ve grown up and won’t be easily deceived by them anymore. On the contrary, since they killed my mother, I must seek revenge.”<br/><br/>Xia Weiguo nodded, “Chen’er, you have indeed grown up. I originally wanted to personally take revenge for your mother’s vengeance. But in recent years, the Su Family’s business has been thriving, while the Xia Family’s has declined.<br/><br/>There’s no way the Xia Family can retaliate against the Su Family now. It’s me,<br/><br/>I let your mother down. I, as a father, couldn’t avenge her.”<br/><br/>There was a flash of brilliance in Su Yichen’s deep eyes. He then held his grandfather’s hands with both of his and said very sincerely, “Grandfather, don’t worry about avenging my mother. I’m here, aren’t I? I’ve grown up, and in a few years, I’ll definitely bring them down.”<br/><br/>Upon hearing this, Xia Weiguo was filled with surging emotions and thought to himself, “This child has indeed been raised to be naive by the Su Family. Hooked by just a few words of mine. Su Yichen’s business talents are even more exceptional than his mother’s. I must make good use of him.”<br/><br/>Xia Weiguo patted his grandson’s hand and looked very gratified, “Yes, Chen’er has indeed grown up and become sensible. In the past, when I came to see you, you always kept a distance from me, and I couldn’t tell you many things.”<br/><br/>After hearing this, Su Yichen showed a guilty expression and said, “Grandfather, I’m sorry. Although I don’t remember the past, I still feel very ashamed. I was ignorant and hurt you.”<br/><br/>Xia Weiguo shook his head, “I don’t blame you. You were young and ignorant, and it was easy for them to brainwash you. Now that you’ve lost your memory, and can’t remember the past, but at least you know right from wrong. This makes me very comforted.<br/><br/>Child, remember, I am your grandfather, and I will never harm you. I will always be on your side. In the future, when you live in Xia Family, if anyone treats you poorly, tell me, and I will teach them a lesson.”<br/><br/>Upon hearing this, Su Yichen could not help but laugh and say, “Grandfather, I’m not a three-year-old child who wants to tattle all the time. How can I get along with the rest of the Xia Family in the future like that?”<br/><br/>“Hahaha…” Xia Weiguo laughed heartily and said, “Your uncles and cousins are all good to get along with. You all share the same blood, and you are relatives. You should love each other in the future.’<br/><br/>Su Yichen nodded, “Yes, grandfather, I will definitely love them in the future.”<br/><br/>As soon as Xia Xinbei, who had just entered the house, heard grandfather’s hearty laughter, his face, which was just pleased from hooking up with a big star, instantly darkened. He muttered under his breath, “This bastard is really good at pleasing the old master. Humph, don’t think that by pleasing the old master, you can get a share of Xia Family’s property. You’re dreaming!”<br/><br/>Then, he entered the living room, called out to his grandfather, ignored Su Yichen’s call of ‘Fourth Cousin,’ and went straight upstairs.<br/><br/>Xia Weiguo was so angry that he wanted to beat him with his crutch. He shouted, “Xia Xinbei, stop! Didn’t you hear your cousin calling you? What kind of attitude is that, not even responding? What did you learn from home?!”<br/><br/>Xia Xinbei glanced at Su Yichen with a mocking expression on his face, “A cousin who hasn’t been recognized for more than ten years and now suddenly wants to acknowledge me? Who knows what he’s up to?”<br/><br/>With that, he ignored the old master’s anger and went straight upstairs to rest.<br/><br/>Xia Weiguo, furious, leaned back, and Su Yichen immediately supported him, soothing him, “Grandfather, it’s okay. Fourth Cousin is telling the truth. We haven’t had any contact for more than ten years. Now that I suddenly moved into Xia Family, it’s only natural that he would have his doubts. Don’t worry, grandfather, I’m fine.”<br/><br/>Xia Weiguo looked at Su Yichen with guilt, “Chen’er, I’m sorry to have wronged you.”<br/><br/>Su Yichen shook his head, “Grandfather, I’m not wronged.”<br/><br/>When Su Yichen returned to his room, his whole tense body immediately relaxed.<br/><br/>He walked to the table, gently touched the leaves of the little camellia, and muttered softly, “It’s really tiring to act and deal with them. Luckily, I have you to accompany me..”\t\t\t\t\t\t</div>", "images": {}, "success": true}