{"id": 158, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298183.html", "title": "Chapter 158 - Chapter 158: Chapter 158: Going To My Daughter’S Home For New Year’S Is Not Shameful (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 158 - Chapter 158: Chapter 158: Going To My Daughter’S Home For New Year’S Is Not Shameful (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 158: Chapter 158: Going to my Daughter’s Home for New Year’s is Not Shameful (Second Update)<br/><br/>Translator: 549690339<br/><br/>On New Year’s Eve, our three uncles’ families, maternal aunt’s family, and<br/><br/>Grandpa and Grandma Xiao would join us to celebrate the New Year together. All in all, we made up a big group of thirty or forty people, spread across three or four tables. Preparing such a feast was no easy task!<br/><br/>A couple of days prior, maternal grandparents had gone back to their old home to do some cleaning, tidying up the place enough to accommodate their three sons and daughters-in-law when they returned.<br/><br/>Otherwise, there would be far too many people for Xiao Family house to accommodate.<br/><br/>Xiao Junxuan and his father offered their assistance.<br/><br/>After all, the end-of-the-year deep cleaning was a strenuous task, especially with some heavy lifting involved. Xiao Wanshan and his wife weren’t comfortable leaving their elders to handle that.<br/><br/>The homes of the three uncles were small western-style buildings fashioned similar to the villas, built side by side but separated by walls.<br/><br/>The brotherly love between the trio was strong, yet they each had their own families, necessitating some personal space and privacy. At least this way, future generations wouldn’t squabble over housing.<br/><br/>Cleaning the three houses was not a one or two-day job.<br/><br/>Luckily, Xiao Wanshan and his son were capable and strong. The elders mostly participated by doing simpler tasks such as sweeping floors and wiping furniture, but the bulk of the work was handled by the father-son duo.<br/><br/>After three days, all three houses were sparkling clean, arousing envy among the other villagers of Ji Family Village.<br/><br/>“My goodness, Old Master Ji and his wife are truly blessed. Their three sons are so accomplished, their two daughters married so well — especially the younger one who married a big city businessman!”<br/><br/>“Indeed! Among all the villagers, they enjoy the most luxurious life. Their children and grandchildren are filial and their wealth is vast.”<br/><br/>“I really don’t understand, we educated our children the same way. Why are theirs so successful while ours can only go out to work for meager wages?”<br/><br/>“Maybe it’s just fate.”<br/><br/>“Look at that, when the elders returned home for cleaning, their grandson-in-law came over to help. In our case, not even our own daughters would bother visiting.”<br/><br/>“Xiaofang did marry a nice man. Initially, Mr. and Mrs. Ji viewed Xiaofang’s husband as a gangster and refused to let their eldest daughter marry him.<br/><br/>Who would’ve thought that after marrying Xiaofang, he’d turn a new leaf, working a steady job, leaving behind his gangster tendencies.<br/><br/>I heard people from Xiao Family Village say that Xiaofang led a very comfortable life after marriage. Her husband didn’t let her do household chores, not even cooking because he wanted to prevent her from overworking. Xiaofang eventually took over their cooking because he was terrible at it.”<br/><br/>“Speaking of cooking, I remember how Xiao Wanshan courted Xiaofang. It was because of her excellent cooking skills, he was hooked after the first taste.”<br/><br/>“Haha, Xiaofang was indeed a renowned beauty in all the villages around. There were hundreds of suitors in queue for her hand in marriage, many from influential families. However, she chose to marry a gangster.”<br/><br/>Many ridiculed Old Ji third child when Xiaofang married a gangster. Who would’ve thought that twenty years later, everyone envies his eldest daughter’s great husband.”<br/><br/>“Xiaofang is really good at taming her husband. Nowadays, Xiaofang’s life is quite splendid. Aside from having both a son and a daughter, she is also one of the richest in Xiao Family Village.”<br/><br/>“Sigh, their entire family is truly lucky.” many people said enviously, “Some hold public offices, while others own businesses. They’re both wealthy and powerful, nobody dares to mess with them.”<br/><br/>Then many villagers greeted the elderly couple, “Uncle, Auntie, you’re back. Are you cleaning up?”<br/><br/>Grandma responded with a smile, “Yes, our three children are coming home for the New Year. We have to tidy up so that they can live comfortably.”<br/><br/>“Are Derong, Deliang, and Deming all coming home for the New Year?” someone asked curiously.<br/><br/>“This year, all of us will spend New Year at our second child’s house.” Grandma replied.<br/><br/>The villagers were surprised, “Spending New Year at Xiaofang’s place? Would the three brothers agree?”<br/><br/>It’s uncommon for rural people to celebrate New Year at a daughter’s house.<br/><br/>It was even considered unacceptable for daughters to visit their maiden family during the New Year.<br/><br/>Obviously, Grandma understood the villagers’ thoughts, but without waiting for her to respond, Grandpa scoffed, “Of course they’re willing. They practice none of that nonsense. It doesn’t matter where we celebrate New Year, as long as the family is together, that’s all that counts. This year, our second child and his wife wanted all of us to celebrate New Year at their place, so of course, we agreed.”<br/><br/>Villagers, ‘ .<br/><br/>Their family was indeed out of the ordinary; they treated such an important and ceremonious event like the New Year so casually.<br/><br/>Seeing the slightly displeased expression on Old Master Ji’s face, the villagers hastily chuckled, “That’s right, you are correct. Wherever we celebrate New Year, as long as we are with our family, it’s always a joyous occasion.”<br/><br/>As their lives got better and better, they became more casual about certain things. Of course, the villagers wouldn’t discuss their family’s affairs openly. If they had something to say, they muttered behind their backs.<br/><br/>During the three days of cleaning, many people approached asking whether they planned to celebrate New Year at their eldest daughter’s house.<br/><br/>When they confirmed it, some people began to talk behind their backs.<br/><br/>“Ha, Old Master Ji has sons of his own, yet he goes to celebrate New Year at his daughter’s place; it’s laughable. If it were me, I’d die before celebrating New Year at my daughter’s place. It’s embarrassing!”<br/><br/>“It’s not just them, even their three sons and their families will be there. With so many people, it would be hard to manage. It’s also embarrassing for the three sons.”<br/><br/>“Ha, if they’re not embarrassed, why should we worry for them? Their family has always rejected gender bias. In the eyes of Mr. and Mrs. Ji, whether it’s a son or a daughter, they are all the same. I guess only the elders have no property to their name, otherwise, they’d probably equally divide it among all five children.”<br/><br/>“That’s very likely. However, even if they had some property, I bet their two daughters wouldn’t want it. Not to mention Xiaozhu, the younger daughter, married a multimillionaire and doesn’t need money. As for Xiaofang, she’s saved a lot of money with her husband over the past twenty years.”<br/><br/>“Besides, all three sons are wealthy and influential, they wouldn’t covet such a small parental property. The sons-in-law that the three brothers married are generous and magnanimous women who wouldn’t care if all of the elder’s property was given to their two sisters-in-law.”<br/><br/>“So, how did their family raise such a generation? Their descendants are filial, and the siblings are loving and united.”<br/><br/>Someone said quietly, “Maybe this is because their parents didn’t favor one child over another..”\t\t\t\t\t\t</div>", "images": {}, "success": true}