{"id": 155, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298174.html", "title": "Chapter 155 - Chapter 155: Chapter 155: End Of The Year 1 (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 155 - Chapter 155: Chapter 155: End Of The Year 1 (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 155: Chapter 155: End of the Year 1 (First Update)<br/><br/>Translator: 549690339<br/><br/>Xiao Family members did not know that Su Yichen would continue to interact and act with his so-called relatives in a state of amnesia.<br/><br/>Since Xiao Mother received a phone call from Su Yichen saying that he was doing well, their hearts were at ease.<br/><br/>After all, there were his relatives in the Capital City, even if someone had ulterior motives, there were still family members to protect him.<br/><br/>As the New Year approached, young people who had gone out to work gradually returned to the village.<br/><br/>The once quiet village became more lively with each passing day.<br/><br/>Especially the children, running and laughing in the village, showing off and comparing with each other. “My mom bought me a beautiful dress.” “My dad bought me a set of toys.”<br/><br/>“My mom bought me a pair of beautiful shoes!”<br/><br/>“My mom bought me a lot of food!”<br/><br/>At the end of the year, families reunited, and everyone seemed very happy.<br/><br/>“Oh, my daughter-in-law bought me a red coat. It’s so expensive, costing three to four hundred yuan. But at my age, I’m too embarrassed to wear red.”<br/><br/>“Haha, what’s there to be embarrassed about? At our age, we should wear more red, which is more festive. My daughter-in-law bought me a pair of warm leather shoes, which are very comfortable.”<br/><br/>“They don’t make money easily when they go out to work, so we should let them save some money. But at the end of the year, they buy things for everyone. This hard-earned money is spent just like that.”<br/><br/>“Now young people have their own ideas. The money they earn is meant to be spent. I don’t mean to be nosy, but when young people show their kindness and buy us something, we should accept it graciously and not complain that they are spending too much, or say that we don’t need it. If we say too much, they will feel bad.’<br/><br/>“That’s true. Young people are willing to buy things for us as a way to show their filial piety. We used to have a hard time, so we naturally feel bad about spending money. But young people were born in a better era, not worrying about food and clothing, and now they can make money, so their life is even better. Naturally, they don’t save as much as we do, especially when spending on us old folks and children.<br/><br/>“Yes, they can buy things for us, which shows their filial piety, and we should accept it. If we hurt their feelings, it may be difficult to make up for it later.”<br/><br/>“That’s true.”<br/><br/>But as they talked, someone thought of another problem.<br/><br/>“Sigh, my daughter-in-law asked me about planting vegetables on all the land next year as soon as she returned. She didn’t want all the land to be part of the company.”<br/><br/>“My daughter-in-law was the same. But on the day they came back, I went to the field to pick some fresh vegetables, cooked a nice meal, and let them eat.<br/><br/>Later on, they were very happy, saying that the vegetables were so delicious.<br/><br/>They asked if there were more at home, if we bought or grew them, and asked me to cook more.”<br/><br/>I told them directly that these vegetables were grown at home, and next year, we would grow them for sale. My daughter-in-law said that such delicious vegetables would definitely sell well.”<br/><br/>“So, what did you say?”<br/><br/>“I said I don’t know if they will sell well now. But next year, everyone in the village will grow vegetables, and our family will only grow half of them. Even if we grow only half, we still have two or three mu of land. If we can grow them well and sell them, the income should be quite substantial.”<br/><br/>“This vegetable issue has caused problems for several new daughters-in-law in the village. The land in their families is divided into half joining the company and half being planted by themselves. This proposal was actually made by the Village Head and others. Just in case the vegetables really make money and they don’t make any, people might feel uncomfortable and might cause trouble in the future.<br/><br/>“Speaking of this, I sold quite a few winter vegetables, and the income from several mu of land reached three to four thousand yuan. If I only planted rice, the harvest would only be a few hundred jin, and converted into cash, it would only be five to six hundred yuan.”<br/><br/>“My family is the same. We grew vegetables on five points of land, and the income is several thousand yuan. I never expected that vegetables could sell for so much money.”<br/><br/>“That’s because our Xiao Family Village vegetables are now famous throughout the town. Our vegetables are expensive, but there are still many people who rush to buy them. As soon as our village vegetables enter the market, they are surrounded by people. Once they arrive in the store, people are scrambling for them, as if they are free. I have never seen anything like this in my life, people fighting over vegetables like this.”<br/><br/>“However, next year our whole village will plant vegetables on several hundred mu of land, where will we sell them?” someone said worriedly, “Our small town definitely cannot consume so much.”<br/><br/>“Don’t worry about that. I’ve heard Wanshan say that since the village has established a company, the sales channels will naturally have the company to find a solution. We just need to focus on growing vegetables well. I remember him saying that before our village’s vegetables go on sale next year, a store will be found in the county town, just like in the open market town, specializing in selling vegetables from our Xiao Family Village. Think about it, with the whole county being so big, there must be many people coming to buy. So, we should grow vegetables with confidence and boldness.”<br/><br/>“Now, Jinli has raised more than 100,000 earthworms, which will be distributed next spring. Yesterday, I went to see the earthworms in the greenhouse, and they have grown a lot.”<br/><br/>“Those earthworms were ordinary earthworms in the field, what exactly did they eat, what did they grow?”<br/><br/>“Besides Jinli, who knows? When we raise them, they die, but when Jinli raises them, they grow better and better.”<br/><br/>“It’s really not easy for Jinli. At such a young age, she has to worry about going to school and working for the village’s livelihood. Now, besides going to school, she spends all her time in the greenhouse.”<br/><br/>“If growing vegetables really is a path to prosperity for us, we must be grateful to this child when we make money.”<br/><br/>“Indeed, despite her young age, she bears adult responsibilities.”<br/><br/>“Ah, I won’t talk anymore. I have to go back and cook dinner. It’s the end of the year, and my family is looking forward to mealtime. We don’t need fancy dishes, just a few vegetarian ones. But with these meals, the children have grown stronger, healthier, and more energetic than before.”<br/><br/>“Haha, my daughter Little Jade used to catch a cold, cough, and have a runny nose every winter, even getting feverish and developing pneumonia. But this year, there was no sign of pneumonia or even a cough. She ran outside every day in the cold weather and was fine.”<br/><br/>“Indeed, this winter in our village, not a single child caught a cold. They are all healthy and running around..”\t\t\t\t\t\t</div>", "images": {}, "success": true}