{"id": 156, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298177.html", "title": "Chapter 156 - Chapter 156: Chapter 156: End Of The Year 2 (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 156 - Chapter 156: Chapter 156: End Of The Year 2 (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 156: Chapter 156: End of the Year 2 (Second Update)<br/><br/>Translator: 549690339<br/><br/>By the end of the year, most of those who went out to work would come back home and visit the Xiao Family or send gifts.<br/><br/>In their hearts, Xiao Wanshan’s family was the richest in the village, so they came to connect with them and because of Xiao Jinli’s reputation and status in the village.<br/><br/>“Ah, Xiao Hua, Xiao Ming, and Xiaoliang, you guys are back.”<br/><br/>“Yes, Auntie, we’re back. We came to see you, Uncle, and Jinli as soon as we returned. This is the local specialty I bought!”<br/><br/>“You came, that’s enough, why buy anything? Come in, come in, sit down for a while.”<br/><br/>Xiao Mother welcomed these young people into the house with a happy smile,<br/><br/>“I’ll make tea!”<br/><br/>“Auntie, don’t bother.”<br/><br/>“Haha, I’m not busy. I’m just making some tea. I remember you all love drinking our family’s tea.”<br/><br/>Because Xiao Jinli added more Lingquan water to brew the tea, the tea was very fragrant and sweet. Both the older and younger people loved it.<br/><br/>Hearing Xiao Mother saying this, these young people politely stayed.<br/><br/>You need to know that the things in Xiao Wanshan’s house were amazing, whether it was meals, drinks, tea, or snacks, all were top-notch. They usually didn’t have the chance to eat them.<br/><br/>They didn’t want to miss this opportunity.<br/><br/>“Thank you, Auntie. We will just drink some tea and go back. By the way,<br/><br/>Auntie, I also brought some small gifts for Jinli.”<br/><br/>Little girls’ gifts are usually clothes, hair clips, toys, etc.<br/><br/>Jinli had been blessed with luck since childhood, and the close people around her always had good luck.<br/><br/>Over the years, although they went out to work and didn’t earn much money, they were all safe and sound.<br/><br/>Xiao Mother looked at the gifts they took out and laughed, “You guys are really too polite. Our Little Bao has received so many gifts from you guys since she was little. The gifts you gave her are almost filling up the entire house. I remember your kindness, but please, don’t buy her any more gifts in the future.’<br/><br/>“Auntie, we love Jinli, and when we come home, we think of buying her some little gifts.” Someone laughed and said, “Oh, right, Auntie, where is Jinli?”<br/><br/>Xiao Mother pointed to a greenhouse not far away, smiled, and said, “She goes there every day to check on the earthworms and the seedlings’ growth.”<br/><br/>“Jinli is really smart and capable.” Someone sighed, “She is only in her early teens, yet she is doing adult work.”<br/><br/>“Jinli is different from us ordinary people from a young age.” Someone laughed and agreed, “From a young age, she was meant for big things. While we were playing in the mud in the fields, Jinli would help the village handle matters. When we were able to help our families with work, Jinli was already helping the village with important affairs.”<br/><br/>“Yeah, comparing ourselves with her is frustrating. Fortunately, there’s only one Jinli.” Someone joked, “If there was another one, it would make us seem even more foolish.’<br/><br/>While the others chatted casually, Xiao Mother quickly brewed the tea and brought it over.<br/><br/>“It smells so good.” Someone moved their nose and exclaimed, “Auntie, how did you make this tea? It’s getting more and more fragrant. Just smelling it from far away makes me want to pick up the teapot and drink it all in one gulp.’<br/><br/>“Haha, if you grab it, you won’t be able to drink it anymore. And you might get scalded.”<br/><br/>“Drinking tea should be done slowly, only then can you taste the increasingly rich flavor.’<br/><br/>Xiao Mother took out the cups, poured a cup for each of them, and laughed,<br/><br/>“We have enough tea at your Auntie’s house. You can drink it slowly!”<br/><br/>“Then, Auntie, I’ll be ready to drink a whole stomach of tea. Seriously, how did you brew your family’s tea? Why is it so fragrant?”<br/><br/>Xiao Mother laughed, “I just brewed it like this. As for why it’s so fragrant, I don’t know.”<br/><br/>Anyway, anything that passes through her hands always tastes exceptionally good.<br/><br/>“Haha, maybe it’s Auntie’s natural talent. Auntie, not only do you cook delicious meals and snacks, but you also make fragrant alcohol and tea. If you open a tea house, tavern, or restaurant with your skills, the business would be booming.”<br/><br/>Someone immediately interjected, “That’s right. But Uncle Wanshan doesn’t want Auntie to get tired. I heard that he used to not let her cook, fearing she’d get tired, so Uncle Wanshan cooked himself. But the dishes he made were so bad that even the dog wouldn’t eat them, and Auntie was particularly picky, so she had to cook despite Uncle Wanshan’s opposition.”<br/><br/>“Haha…Uncle Wanshan really dotes on Auntie. No wonder Auntie has such great cooking skills and never thought of opening a restaurant.”<br/><br/>Regarding the past of Xiao Wanshan and Xiao Mother when they were young, it was no secret in the village.<br/><br/>From time to time, people would bring it up to discuss it or use it for  comparison during arguments between husband and wife.<br/><br/>Xiao Mother laughed, “You guys are teasing me again.”<br/><br/>“But we are stating the truth.” Someone laughed, “Auntie, Uncle Wanshan really dotes on you. Everyone can see it.”<br/><br/>Even though her past with her husband was brought up and discussed by a group of young people, Xiao Mother’s face couldn’t help but flush a little.<br/><br/>Xiao Mother immediately changed the subject, “I made some snacks. I’ll bring them out for you to try.”<br/><br/>With that, she went into the room to get the snacks.<br/><br/>A group of young people looked forward to them with anticipation in their eyes.<br/><br/>They came to the Xiao Family to give gifts and also genuinely wanted to eat something at their home.<br/><br/>After Xiao Mother brought out some snacks, she sat down and chatted with them, asking about some of the things that happened while they were working.<br/><br/>After a while, Xiao Mother said, “Our Xiao Family Village has established a company, and starting next year, the whole village will plant vegetable and fruit. I hope that you young people can stay and help manage the village together. In this way, the elderly and children at home can be taken care of. If the vegetables and fruits sell well, staying at home might make more money than working outside.”<br/><br/>When it came to this, the young people present became somewhat silent.<br/><br/>They were actually very conflicted in their hearts.<br/><br/>They, of course, wanted to stay home for next year’s village-wide vegetable and fruit planting.<br/><br/>But what if the produce can’t be sold next year? They’ll have no money, and how will their families survive next year?<br/><br/>So, their current thinking was to go out and work first, observe, and if planting vegetables really made money, they would come back not just the following year but also the next half year.<br/><br/>In the end, they were just uncertain about planting and selling in the next year.<br/><br/>Xiao Mother laughed and said, “However, earning money through working outside is more stable. After our village’s vegetables sell, you can come back later. From then on, the whole family can make money together..”\t\t\t\t\t\t</div>", "images": {}, "success": true}