{"id": 153, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298168.html", "title": "Chapter 153 - Chapter 153: Chapter 153: Racing Drama 1 (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 153 - Chapter 153: Chapter 153: Racing Drama 1 (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 153: Chapter 153: Racing Drama 1 (First Update)<br/><br/>Translator: 549690339<br/><br/>Lady Su walked into Xia Corporation with a thermos box and approached the receptionist. “Hello, I’m looking for Su Yichen. I’m his mom. Is he in his office?” The receptionist looked at Lady Su dressed exquisitely and asked, “Mother Su?”<br/><br/>“Yes, I am his mom. Which floor is he on?”<br/><br/>Lady Su’s exterior image was gentle and virtuous, even though she disdained and looked down upon the receptionist. Nonetheless, she maintained her noble and gentle demeanor under watchful eyes.<br/><br/>The receptionist quickly recognized her identity and asked, “Are you… Lady Su?<br/><br/>“Yes!” Lady Su nodded and said, “I want to bring some chicken soup that I personally made to my little son. Which floor is he on? Can I go directly to find him?”<br/><br/>The news that Su Yichen was the son of Su Corporation’s chairman had long been circulating in the Xia Corporation.<br/><br/>It was common knowledge that the Xia Corporation and Su Corporation were at odds.<br/><br/>Yet now, the son of Chairman Su worked for Xia Corporation, and Chairman Su had come to find Mr. Su the other day. No one knew what the resolution was.<br/><br/>Everyone was curious about the affairs between superiors but dared not gossip about it.<br/><br/>The receptionist smiled and asked, “Lady Su, did you make an appointment with our Mr. Su in advance?”<br/><br/>Upon hearing the receptionist’s questions, Lady Su couldn’t believe it and asked, “What are you talking about? I need an appointment to see my own son? How does that work? Just tell me which floor my son is on, what’s with all the questions?”<br/><br/>The receptionist maintained her smile and calmly said, “Sorry, Lady Su, but company policy states that anyone who wants to see our company leaders needs to make an appointment in advance. If I were to recklessly disclose a leader’s information, I would also be punished. Please understand!”<br/><br/>People in the receptionist position need to have a keen eye, recognize many people while also possibly offending others.<br/><br/>A single misstep could potentially offend an influential character.<br/><br/>However, since Xia Corporation had been at odds with Su Corporation for many years, the receptionist didn’t need to worry too much about offending Lady Su.<br/><br/>After hearing the receptionist’s words, Lady Su’s well-maintained image nearly cracked, her expression twisted momentarily. Clenching the handle of the thermos box, she suppressed her anger and questioned loudly,<br/><br/>“How could someone like you be so insensitive? I said Su Yichen is my son, do I need an appointment to see him? Just tell me which floor he’s on!”<br/><br/>The receptionist maintained her polite smile but still didn’t answer the question.<br/><br/>Seeing this, Lady Su grew more impatient.<br/><br/>She directly said, “Well, just give Su Yichen a call. Tell him I brought him some chicken soup!”<br/><br/>The receptionist slightly nodded and said, “Lady Su, please wait a moment while I call Secretary Zhao!”<br/><br/>The receptionist could only contact the secretary, not the leader directly.<br/><br/>After putting down the phone, the receptionist smiled politely and said, “Lady<br/><br/>Su, Mr. Su invites you to go up, he’s on the fifty-second floor.”<br/><br/>Lady Su raised her head proudly, disdainfully glanced at the receptionist, snorted, and left with the thermos box, heels clicking on the floor.<br/><br/>Su Yichen looked down at the cars and people coming and going below from his high office window. After hearing the secretary’s report, a touch of coldness appeared at the corner of his mouth, and a flicker of malice flashed through his eyes.<br/><br/>Not long after, there was a knock on his office door.<br/><br/>After he called for them to enter, Lady Su rushed through the door without waiting.<br/><br/>As she entered, she saw Su Yichen standing by the window, noticing he’d grown much taller since half a year ago, and looking more handsome and energetic.<br/><br/>Seeing Su Yichen like this, Lady Su’s eyes flicked with a gleam of cunning, cursing in her heart, “This little bastard, who knows where he hid for the past half year, returned more energetic than ever, even overshadowing my own son.<br/><br/>Just wait, I’ll make him as desperate as his real mom was.”<br/><br/>After a moment of thought, she saw Su Yichen and immediately showed a gentle smile, complaining as she walked in, “Xiao Chen, you’re such a busy man now. Even I need to make an appointment to see you. Hehe…”<br/><br/>According to the attention and affection that Su Yichen had shown her in the past, he would have certainly tried to please her.<br/><br/>Who would have thought, Su Yichen’s deep eyes swept over her coldly and he asked sharply, “Who are you?”<br/><br/>Lady Su,<br/><br/>The color of her face changed instantaneously, and her expression seemed both stiff and incredulous.<br/><br/>She raised her head and asked in disbelief, “You… are asking who I am?”<br/><br/>Su Yichen frowned and said doubtfully, “Am I supposed to know you? I’m sorry, I’ve lost my memory and don’t have any impressions of you.”<br/><br/>Lady Su, ‘<br/><br/>She had been warned by her husband about Su Yichen’s memory loss and had been mentally prepared for it. However, seeing it firsthand, she was still somewhat shocked and mostly furious.<br/><br/>Su Yichen, this little bastard, chose to lose his memory at such a critical time.<br/><br/>If he continued to lose his memory and refused to give up his real mom’s inheritance, refusing to transfer it to her own son, what could she do?<br/><br/>Therefore, before obtaining all of his real mom’s inheritance, she had to make sure to firmly hold onto him.<br/><br/>“Lady Su should have heard from Mr. Su about my memory loss, right?” Su Yichen said indifferently, “So, no matter what your goal is, I can only tell you that playing the emotional card with me now is useless.”<br/><br/>Lady Su, ‘<br/><br/>Listening to Su Yichen’s blunt words, she failed to hide her emotions for a moment, and her lips trembled with anger.<br/><br/>She opened her mouth wanting to curse him but hadn’t entirely lost her senses. She took a deep breath, and her face, covered by exquisite makeup, showed a kind smile. She gently explained,<br/><br/>“Chen’er, you misunderstand us. We’re a family, and we don’t have any ulterior motives. I just heard about your memory loss and wanted to see you, to care for you. Look, I personally made this chicken soup for you to help nourish your body!”<br/><br/>Of course, she wouldn’t make it herself.<br/><br/>To play the family card, one must be sincere and do their part.<br/><br/>Su Yichen glanced at the thermos box in her hand and rejected it indifferently, “Lady Su, you can take it back. Since I’ve lost my memory, you’re like a stranger to me. I won’t eat anything from a stranger.”<br/><br/>Lady Su, “…” Now she was really angry, annoyed, and wanted to curse him for being ungrateful.<br/><br/>Fortunately, Lady Su had been performing in front of Su Yichen for more than a decade and had long developed a thick skin. She suppressed her resentment and anger again.<br/><br/>Lady Su maintained her good manners, and her face showed sadness. She said, “Chen’er, you broke my heart with that statement. Nevertheless, I can understand your memory loss. One day, when you remember everything, you’ll accept me..”\t\t\t\t\t\t</div>", "images": {}, "success": true}