{"id": 157, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298180.html", "title": "Chapter 157 - Chapter 157: Chapter 157: High-End Ingredients (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 157 - Chapter 157: Chapter 157: High-End Ingredients (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 157: Chapter 157: High-end Ingredients (First Update)<br/><br/>Translator: 549690339<br/><br/>At 12 0’clock on December 24, during the Xiao Nian Festival, Xiao Jinli received a phone call from her maternal uncle.<br/><br/>Even through the phone, her uncle’s voice sounded very excited.<br/><br/>He said, “Jinli, do you know that the earthworms you brought back have been sold overseas and have become high-end ingredients? Haha, I didn’t expect things to go so smoothly.”<br/><br/>It had been six months since Gao Jianjun updated Xiao Jinli on the sales of the earthworms to foreign countries. It seemed to have taken quite a long time.<br/><br/>After all, the earthworms that Xiao Jinli had cultivated had only lived for about three to five months, so it was impossible for them to survive until now.<br/><br/>Xiao Jinli still seemed very surprised and said, “Oh, really, Uncle, that’s great!”<br/><br/>Gao Jianjun said, “To be categorized as high-end ingredients in the international market, products must undergo strict inspections, complicated processes, and be examined by industry insiders. Only then can they be labeled as high-end ingredients.”<br/><br/>Speaking of which, he lamented, “Ah, I just didn’t send enough earthworms abroad. Now, lots of famous hotels overseas are sending orders our way, but I don’t dare to accept them. It’s like watching a huge pile of money fly away right before my eyes.”<br/><br/>Xiao Jinli,<br/><br/>Gao Jianjun continued, “Jinli, I heard from your dad that you’ve contracted over five acres of land and raised more than 100,000 earthworms. Can you spare some of them? You should know that the price offered by those overseas orders has reached 88,000 yuan per jin.”<br/><br/>Xiao Jinli raised her eyebrows in surprise, “That high?”<br/><br/>She bought them for 100 yuan per jin, and after only three to four months, the price per jin had skyrocketed to 88,000 yuan. This was a huge profit.<br/><br/>If it were someone else, they would definitely be tempted.<br/><br/>But her purpose in raising earthworms was not to sell them directly but to help enrich the entire Xiao Family Village.<br/><br/>“Yes, yes, that’s how high it is.” Gao Jianjun nodded and said, “So, Jinli, can you raise more earthworms and sell them through foreign channels? With a price of 88,000 yuan, it would be heartbreaking to miss out.”<br/><br/>Xiao Jinli slightly raised her eyelids, covering her mouth and chuckling, “Uncle, we’re planting vegetables and fruits in our village next year, and my five acres of land and over 100,000 earthworms are already part of my plan.”<br/><br/>Gao Jianjun, ‘<br/><br/>Does this child realize that she’s missing out on a money-making opportunity?<br/><br/>“However, I plan to expand production and sell them as part of foreign trade deals,” Xiao Jinli said with a smile. “Also, we’ll be exporting the vegetables and fruits grown in Xiao Family Village along with the earthworms. Uncle, I’m afraid I’ll have to ask for your help when the time comes.”<br/><br/>‘ Gao Jianjun was suddenly anxious, and he asked, “Jinli, what do you mean by that? Are you planning to export the Xiao Family vegetables as well?”<br/><br/>Xiao Jinli nodded and said, “Yes, Uncle, that’s my plan. Uncle, you’ve tasted the vegetables from my family during summer vacation. How do you think they would fare if sold overseas?”<br/><br/>Gao Jianjun’s eyes lit up, “They’ll definitely become high-end ingredients. Haha, if the taste of the vegetables from your village is as good as what we’ve tasted before, then we have nothing to worry about regarding overseas sales.”<br/><br/>Xiao Jinli nodded and said, “I have no worries at all. I have great confidence in our Xiao Family vegetables and don’t need to worry about them not selling. Next year, our entire village will be planting on just a few hundred acres. If we sell overseas, it will only be a small portion.”<br/><br/>Gao Jianjun’s expression was slightly complicated as he paused for a moment and then asked, “Jinli, do you have a bias against foreign markets?”<br/><br/>Xiao Jinli laughed and said, “Not at all. I just think that it’s better to prioritize the domestic market. After all, good things should be sold domestically.”<br/><br/>Moreover, crops grown with Lingquan water improve the consumer’s health, enhance their physical fitness and prevent diseases.<br/><br/>Regardless of whether it’s the education she received in her past life or this life, she has always been patriotic.<br/><br/>So, she’s a good girl who listens to her teacher.<br/><br/>Gao Jianjun sighed lightly and said, “Alright, I’ll listen to you. I’ll wait for your news.”<br/><br/>“Uncle, my three uncles are coming to my house for the New Year. You should come too with my maternal aunt and cousin. And when you come, I have a favor to ask you,” Xiao Jinli said mysteriously.<br/><br/>Gao Jianjun asked curiously, “What’s the favor? Can you tell me now?”<br/><br/>“I can’t tell you now. I’ll let you know when you come,” Xiao Jinli said with a<br/><br/>smile.<br/><br/>“Haha….” Gao Jianjun looked very happy and said, “You cunning little girl. Okay, since my brothers-in-law are all going to your house for the New Year, my wife and I will definitely join you. As a family, we should be united and inclusive. Otherwise, it would seem like we don’t fit in. Jinli, have your uncles mentioned when they’ll be coming over?”<br/><br/>“Yes, they said they’ll only start their vacation at 3 pm on New Year’s Eve. Driving here would take at least four to five hours,” Xiao Jinli said.<br/><br/>After listening, Gao Jianjun laughed and said, “Alright, I’ll call your uncles and ask. On New Year’s Eve, we’ll all come over together.”<br/><br/>“Great, I’ll prepare a big meal with mom and make sure to treat you all well,” Xiao Jinli said with a smile. “We’ll have good food and drinks.”<br/><br/>“Haha, of course, with you around, I’m sure we’ll have a great time,” Gao Jianjun laughed and said, “See you for the New Year.”<br/><br/>“Yes, see you for the New Year!” Xiao Jinli nodded.<br/><br/>After hanging up the phone, Xiao Jinli immediately heard Xiao Zhi’s voice in her sea of consciousness.<br/><br/>“Oh, Master, I understand now. The person you’re looking for is your uncle, right?” Xiao Zhi seemed very excited and said, “Your uncle knows a lot of people and has connections. It’s most appropriate to ask him to sell the Seven Color Tea Flower.”<br/><br/>Speaking of this, it sighed again and said, “Ah, I always thought the person you were looking for was Xiao Siqian, oops, I mean Su Yichen. After all, with his status, selling the Seven Color Tea Flower would be a breeze. However, just like ‘Xiao He helped him succeed and also caused his downfall,’ his status is also a problem. If we turn to him for help, we’ll definitely run into some trouble.”<br/><br/>Xiao Jinli nodded and said, “That’s right, you’re not as dumb as I thought. Turning to Su Yichen for help would be asking for trouble, given the wolves surrounding him due to his mother’s inheritance. You know, in my current life, I hate trouble the most.”<br/><br/>Xiao Zhi rolled its eyes and said unhappily, “I know, in this life, you just want to be a salted fish, the kind that’s too lazy to turn over. Look at your ambition.” Xiao Jinli,\t\t\t\t\t\t</div>", "images": {}, "success": true}