{"id": 152, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298165.html", "title": "Chapter 152 - Chapter 152: Chapter 152: Sharp Questioning, Serious Doubts (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 152 - Chapter 152: Chapter 152: Sharp Questioning, Serious Doubts (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 152: Chapter 152: Sharp Questioning, Serious Doubts (Second Update)<br/><br/>Translator: 549690339<br/><br/>Since Su Yichen used amnesia as an excuse, he naturally wouldn’t let them find any flaws.<br/><br/>An insinuating smile appeared on his cold face.<br/><br/>He said, “Of course, I learned from my maternal grandfather that my biological mother left me a huge inheritance which I need to claim when I turn eighteen. So, as soon as I returned to Capital City, I couldn’t wait to find a lawyer to inquire about it. Is there any problem with that?”<br/><br/>He had it all planned before he returned to Capital City.<br/><br/>He then looked at Su Xiangdong with an expression of irony and bitterness, his face showing a sense of disappointment and frustration.<br/><br/>He continued, “But what I didn’t expect was that when I found Lawyer Liu, he told me that during my disappearance, Mr. Su Xiangdong and his family of three were holding the Inheritance Rights Transfer Agreement I had signed before I turned eighteen and were demanding, and even forcing him, to transfer all the inheritance my biological mother Xia Zhi Meng left me, to Su Xiangdong’s eldest son, Su Hanyang. So…”<br/><br/>At this point, his cold voice full of doubt and heartache, he sharply questioned,<br/><br/>“If you claim to be my biological father, Su Xiangdong, why would the inheritance my mother left me be transferred to my half-brother from the same father but different mother? Why did I sign that so-called Inheritance Rights Transfer Agreement? Why didn’t my family, who claim to love me, report my disappearance to the police for more than half a year?”<br/><br/>“Mr. Su, I may have amnesia now, but I’m not stupid. So, I’ve always been puzzled about these questions. Can you help me clear them up?”<br/><br/>Su Xiangdong was questioned and immediately backed away a few steps, his face turning pale and blue.<br/><br/>He never expected that his youngest son, who had been missing for more than half a year, would return with such keen suspicion and doubt about his own family.<br/><br/>“I… I…” Su Xiangdong opened his mouth, wanting to explain, but quickly realized that he had lost his composure in front of the hateful child, which made his anger rise even more.<br/><br/>He shouted, “You… are you doubting your own father?”<br/><br/>Su Yichen spread his hands and said, “Well, Father, please clear up my doubts then!”<br/><br/>Su Xiangdong raised his voice even more, “Hasn’t our family been taking good care of you for the past ten years? Doesn’t everyone in the whole Capital City know how much Su Xiangdong and your stepmother love you? Especially your stepmother, who treats you as her own, even better than your older brother. What, now that you’re living in the Xia family home, you want to wipe out the good things we’ve done for you with a single stroke?”<br/><br/>Full of doubt, Su Yichen asked, “No, I just want to know why you want me to transfer my biological mother’s inheritance to Su Hanyang. And yet, you’re telling me that I’ve forgotten all the good things you’ve done for me? Father, I don’t understand. Is there any connection? Besides, I’ve lost my memory anyway. I’ve really forgotten all the so-called good things you’ve done for me!”<br/><br/>At this point, he even more suspiciously asked, “Or is it that your kindness to me is based on me transferring all of my biological mother’s inheritance to Su Hanyang?”<br/><br/>Su Xiangdong’s face expression stiffened instantly, his face turning red and pale, pointing at Su Yichen, and seemingly wounded, he said, “Su Yichen, is this what you think of me and your mother?”<br/><br/>Su Yichen’s silence told Su Xiangdong that he was indeed suspicious of them.<br/><br/>Su Xiangdong’s face turned red and blue with anger, and he shouted, “Fine, Su Yichen, you’ve become a heartless and ungrateful thing after your amnesia. I don’t recognize you as my son.”<br/><br/>With that, he stormed out, seemingly enraged.<br/><br/>In reality, his movements were not fast.<br/><br/>He knew Su Yichen too well, having always admired and respected him as a father since childhood.<br/><br/>So, he was waiting for Su Yichen to call him back.<br/><br/>But Su Yichen didn’t call him back, and his heart was filled with anger and anxiety, but he couldn’t let go of his pride and stay.<br/><br/>So he really left in a fury.<br/><br/>Su Yichen didn’t even look at his retreating figure, he just looked at the tea flower tree on the table, his eyes deep and dark, drifting out the window, the corner of his mouth slightly raised, coldly laughing, “Father, mother? Huh, huh…”<br/><br/>After angrily leaving the Xia Corporation, Su Xiangdong returned home with a belly full of anger.<br/><br/>As soon as Lady Su saw him, she immediately greeted him, her voice anxious,<br/><br/>“Husband, how did it go? Did you see Su Yichen?”<br/><br/>Su Xiangdong irritably pulled at his tie, his face angry, “Don’t mention that unfilial son to me!”<br/><br/>“What’s wrong?” Lady Su asked.<br/><br/>“Hmph, do you know what that unfilial son did?” Su Xiangdong shouted angrily, “He said he lost his memory.”<br/><br/>“What?” Lady Su’s voice suddenly rose, “Amnesia? How could he have amnesia?”<br/><br/>“How would I know how he lost his memory?” Su Xiangdong said angrily, “He only said he was saved by someone in a deep mountain forest, and when he woke up, he didn’t know who he was.”<br/><br/>“How is that possible?” Lady Su obviously didn’t believe it, “If he doesn’t know who he is, what’s the deal with him and the Xia family? Could it be that the Xia family found him first? How did the Xia family find him?”<br/><br/>“It’s not the Xia family who found him, but him who contacted the Xia family first!” At this point, Su Xiangdong became even angrier, “That unfilial son, after losing his memory, only remembered the phone number of that old man from the Xia family, so the Xia family went to pick him up.”<br/><br/>Lady Su asked the question she cared about the most, “Did you talk to him about the inheritance? Did he agree to come forward and go with us to the lawyer’s office? As long as he goes with us to the lawyer’s office and says in front of Liu Qingming that he’s willing to give up all his inheritance rights, our Yang’er can have all of the inheritance left by that b*tch.”<br/><br/>Su Xiangdong gave her a white-eye and said coldly, “The first thing he did when he came back was going to the lawyer’s office to find Liu Qingming. After learning about his biological mother’s entire inheritance, he questioned me, asking why his biological mother’s inheritance should be transferred to his half-brother from the same father but different mother? And why did he sign that so-called Inheritance Rights Transfer Agreement?”<br/><br/>“What does that mean?” Lady Su reacted instantly, and asked incredulously, “Is he doubting us? How is that possible?”<br/><br/>Su Xiangdong didn’t know which nerve had been touched, but he suddenly got angry, and said,<br/><br/>“How is it not possible? Do you know when he questioned me about these things, his eyes were so sharp, and his expression was full of doubt?<br/><br/>That ungrateful thing, we’ve been so good to him, and after one amnesia, he’s forgotten everything.<br/><br/>He’s doubting us, doubting that we have ulterior motives and are plotting against him? How can he possibly be willing to go to the lawyer’s office with us now, to say that he’s willing to give up inheriting his biological mother’s inheritance and transfer it to Su Hanyang?<br/><br/>Although this was the truth, he absolutely could not admit it.<br/><br/>After listening to Su Xiangdong’s words, Lady Su’s face turned pale.<br/><br/>She didn’t expect that the little bastard would come back rebellious after being missing for half a year.<br/><br/>She clenched her hands tightly, unwillingness flashing in her eyes. All those things belonged to her son Yang’er. That wild child had to give it, whether he wanted to or not..\t\t\t\t\t\t</div>", "images": {}, "success": true}