{"id": 159, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298186.html", "title": "Chapter 159 - Chapter 159: Chapter 159: Festivities Of The New Year 1 (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 159 - Chapter 159: Chapter 159: Festivities Of The New Year 1 (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 159: Chapter 159: Festivities of the New Year 1 (First Update)<br/><br/>Translator: 549690339<br/><br/>On Lunar New Year’s Eve, every household was bustling with excitement, as they got up bright and early to paste couplets and hang lanterns.<br/><br/>Busy throughout the year, only on this day, they could eat and play well.<br/><br/>Things they usually didn’t eat would be taken out on this day.<br/><br/>The chickens and ducks they raised would also be caught on this day.<br/><br/>Xiao Family members got up early in the morning to get busy.<br/><br/>Xiao Junxuan went to the market town even before dawn to buy fresh meat.<br/><br/>Preparing four tables of meals was quite a lot of work.<br/><br/>“Mom, what dishes are we going to make today?” Jinli asked Master Chef Xiao Mother.<br/><br/>Xiao Mother thought for a moment and said, “Just make the usual home-cooked dishes. Beer duck, Hakka braised meat with preserved mustard, braised pork feet, stuffed tofu, fried small fish, braised beef brisket with radish, and oil-braised prawns. Cook the old hens, make five or six vegetarian dishes, such as eggplant claypot, scrambled eggs with leeks, stir-fried cabbage, cold mixed tomatoes, and when your uncles come over, we will let them order some more dishes.”<br/><br/>Jinli nodded, “Alright, I’ll go pick the vegetables from the greenhouse now. Big brother went to buy groceries early in the morning.”<br/><br/>Jinli planned to pick the vegetables herself, intending to move the vegetables in her space out.<br/><br/>“Alright, you go pick them,” Xiao Mother said with a smile. “You have a keen eye. The vegetables you pick always turn out better tasting than the ones we pick!”<br/><br/>Jinli thought, “Of course. The vegetables she picked were mostly space vegetables after all.”<br/><br/>“Alright, Mom, I’m going to pick the vegetables now,” Jinli replied, and then picked up her basket and walked toward the greenhouse.<br/><br/>The vegetables in the greenhouse spread over five points of land had already been sold in one crop, and these were the second crop.<br/><br/>Previously, the vegetables in the village had gradually been harvested, and Jinli had slowly turned the plot of land with vegetables and fruit into their own food, no longer selling them outside.<br/><br/>As a result, more vegetables and fruits were transferred out of her space.<br/><br/>Walking into the greenhouse, Jinli looked at the lush and lovely vegetables in the field and smiled at the corners of her mouth.<br/><br/>Xiao Zhi said, “Master, what are you so proud of? You only moved a small portion of vegetables out of your space. Your family, no matter how much they eat, cannot finish all the vegetables in your space. I think you should find a way to sell the space vegetables as soon as possible.”<br/><br/>Jinli rolled her eyes speechlessly and said irritably, “I know what to do, and it doesn’t need your reminder.”<br/><br/>Xiao Zhi said, “I’m just reminding you out of kindness.”<br/><br/>Ignoring Xiao Zhi’s nagging, Jinli picked the vegetables carefully. In fact, they all grew at a similar pace, whether she picked or not.<br/><br/>It didn’t take long for her to fill a big basket.<br/><br/>Except for leeks, which were not easy to clean, other vegetables were easy to wash.<br/><br/>When Jinli returned with the vegetables, she saw her dad killing two big ducks and two old hens.<br/><br/>The ducks and old hens were raised at home, fed on vegetable leaves and earthworms. The meat was tender and delicious.<br/><br/>“Dad, you’re killing ducks,” said Jinli, looking at the chubby ducks, “Do you need help?”<br/><br/>Xiao Father said, “You come and hold the two legs of the duck!”<br/><br/>Killing ducks was a skillful task. If not careful, blood and feathers could be everywhere, making it hard to clean up.<br/><br/>It also required patience to pluck the ducks’ downy feathers.<br/><br/>Jinli walked over, grabbed the two duck legs, and lifted them up. Xiao Father plucked the feathers from the ducks’ necks, holding their heads down. A bowl was placed on the ground containing a bit of saltwater and starch, which was prepared to collect the duck blood.<br/><br/>Xiao Father said, “Hold on tight, I’m going to start.”<br/><br/>Xiao Jinli, with her strength, held the ducks tightly.<br/><br/>After a while, two ducks were killed, and a large bowl of duck blood was collected.<br/><br/>Xiao Jinli looked at the duck blood and laughed, “We can make spicy blood dishes with this.”<br/><br/>Xiao Mother came out with hot water and heard Xiao Jinli’s words, laughing, “Little Bao wants to eat spicy blood dishes, alright, I’ll make it for you at noon.” Spicy blood dishes are best made with duck blood.<br/><br/>As they were plucking the ducks, Xiao Junxuan went to town to buy beef and prawns.<br/><br/>Afterwards, father and son started to pluck duck and chicken feathers together.<br/><br/>Plucking chicken feathers is easier, as long as the hot water is effective, it can be removed cleanly with a single pull.<br/><br/>Plucking duck feathers, however, takes much more effort, especially with the large amount of down feathers, as it requires more patience to clean them thoroughly.<br/><br/>The father and son duo took nearly an hour to pluck the feathers off two ducks.<br/><br/>After plucking the duck feathers, they started cleaning the innards, and used the duck offal to make stir-fried peppers, which also tastes quite good.<br/><br/>At around 9:ooam, Grandpa Xiao and Grandma Xiao also came to help.<br/><br/>After all, there were many people coming to eat at Second Brother’s house.<br/><br/>Xiao Jinli and her maternal grandmother were washing vegetables, especially chives, which didn’t have many yellow or rotten leaves, but had quite a bit of dirt in the roots, requiring them to be washed one by one.<br/><br/>Grandma Xiao immediately came forward to help.<br/><br/>Grandma Xiao looked at the green chives and laughed, “Good baby, how on earth did you grow these vegetables? Not only do they look better than the others, but they taste better too.”<br/><br/>Xiao Jinli laughed and explained, “It might be because these vegetables are the first batch to get nutrition from earthworms, so the results are better.”<br/><br/>Whether others believe it or not, this is her explanation.<br/><br/>The maternal grandmother looked at the basket of chives and other vegetables and said, “This basket of vegetables may not be enough. In a while, we’ll pick another basket. Oh, and cut more chives, because after dinner, we’re going to make some dumplings for tomorrow morning.”<br/><br/>Xiao Jinli nodded and said, “For dumplings, besides chive filling, do we need to prepare other fillings? Should we have more filling options?”<br/><br/>The maternal grandmother considered for a moment and said, “On the morning of New Year, we should eat vegetarian meals. So let’s have a few more vegetarian fillings. Besides chives, let’s also have radish and scallion, and cabbage fillings. Anyway, the homegrown vegetables are fresh and taste good, so everyone will like any kind of filling.”<br/><br/>Xiao Jinli nodded.<br/><br/>Then, she took two big baskets to the vegetable field.<br/><br/>She first cut two big handfuls of chives, then pulled out three or four white radishes as thick as an adult’s calf.<br/><br/>Although these radishes were big, they were tender, crispy, sweet, and slightly spicy, which made them perfect to eat just like a fruit.<br/><br/>Then, she took a vegetable knife and picked three or four firm cabbages and cut them off.<br/><br/>Finally, she pulled a large handful of scallions.<br/><br/>When she was putting these vegetables in the basket, she seemed to hear Gao Yanxin’s loud voice.<br/><br/>“Maternal Grandpa, Maternal Grandma, eldest aunt, eldest uncle, Cousin<br/><br/>Junxuan, and Jinli, I, Hu Hansan, have returned!”<br/><br/>Xiao Jinli,<br/><br/>Immediately after, she heard her maternal aunt’s scolding, “You little rabbit, what do you mean by Hu Hansan has returned? Do you know who Hu Hansan is? Hu Hansan is a tyrant, and at this age, you’re still talking nonsense. You don’t want to be a good person but want to be a tyrant.”<br/><br/>Then, the sound of a slap followed, obviously the maternal aunt’s slap on<br/><br/>someone..\t\t\t\t\t\t</div>", "images": {}, "success": true}