{"id": 150, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298159.html", "title": "Chapter 150 - Chapter 150: Chapter 150: Hustle And Bustle In A Rush (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 150 - Chapter 150: Chapter 150: Hustle And Bustle In A Rush (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 150: Chapter 150: Hustle and Bustle in a Rush (Second Update)<br/><br/>Translator: 549690339<br/><br/>Once the greenhouse was constructed, Xiao Jinli bought some earthworms and released them into the field.<br/><br/>After that, they had to be careful while leveling the soil, not to take any earthworms out with them.<br/><br/>To everyone in the village, the earthworms that Xiao Jinli was cultivating were precious.<br/><br/>Because of these earthworms, the village’s vegetables were so unique and sold so well.<br/><br/>By the spring of next year, everyone in the village was depending on these earthworms to make their fortune.<br/><br/>Although Xiao Jinli insisted everyone could freely till the soil, the household help from the village were still very careful.<br/><br/>After turning the soil, they scattered various vegetable seeds, prepared seedlings, and by spring of next year, these seedlings would be distributed to everyone for planting.<br/><br/>Yes, Xiao Jinli used most of the five acres used for rearing earthworms to cultivate seedlings.<br/><br/>These seeds had all been soaked in Lingquan water.<br/><br/>The several hundred mu of land in the whole village wouldn’t just plant one type of vegetable.<br/><br/>Before Xiao Siqian left, he accompanied Xiao Jinli on another trip to the seed station and nearly emptied out all the seeds there.<br/><br/>The land meant for rearing earthworms was used for cultivating seedlings, which made the villagers worry if it would affect the growth of the earthworms.<br/><br/>Xiao Jinli explained, “Uncles, and aunties, don’t worry. I’m using recursive knowledge to farm. Just like before, when I grew vegetables, it definitely won’t affect the growth of earthworms.”<br/><br/>Although the villagers didn’t understand the knowledge and techniques of earthworm farming, Xiao Jinli was the only one who did. Plus, Xiao Jinli had indeed been growing crops and breeding earthworms concurrently before. The result was, not only were the crops growing well, but the earthworms were also thriving<br/><br/>So, the villagers didn’t voice out their concerns anymore.<br/><br/>It would be quite amusing for outsiders to worry about a professional.<br/><br/>After all, Xiao Jinli was not one to shirk her responsibilities.<br/><br/>She had promised that next year, everyone would be able to receive earthworms for farming, and she would definitely keep that promise.<br/><br/>After all, she was the village’s lucky star.<br/><br/>After scattering the seeds, Xiao Jinli let the people smooth the soil and then left it alone.<br/><br/>The seasoned farmers began to worry a lot.<br/><br/>“Jinli just scattered the seeds and left them be. Will the seedlings that sprout out grow well?”<br/><br/>“Yeah, some seeds need a layer of straw-covering to keep warm so they can grow well. But Jinli’s field is bare, how can it grow well?”<br/><br/>“Let’s wait and see. However, the reason that there’s no straw-covering might be the greenhouse. The greenhouse does provide thermal insulation.”<br/><br/>“Haha, hearing you say that, I realised that the seeds were scattered inside the greenhouse. The greenhouse does maintain the warmth, so it really doesn’t need straw-covering.”<br/><br/>“It seems that we were overthinking. As you said, we should just wait and see. Some seeds will sprout within three to five days. By then, we’ll check the germination rate and see if these seedlings are good or not.”<br/><br/>These experienced farmers could easily assess a seed’s germination situation. However, these villagers didn’t know that these seeds were soaked in Lingquan water.<br/><br/>As long as the seeds have a bit of life left, soaking them in Lingquan water can revive them, and once placed in the soil, they will root and sprout.<br/><br/>Unless the seed is completely dead.<br/><br/>After all, nothing in the world can be reversed once it’s totally dead.<br/><br/>As time quietly passed, winter entered its severe phase. The cold wind was biting, everything withered, dry hay and barren branches, and the villagers wore thick cotton clothes wandering around the village corners.<br/><br/>For the farmers, apart from growing some seasonal fruits and vegetables, it’s a time of idleness and laziness. If they were not at home, warming themselves over the brazier, they would be sitting on stools in the sun, chatting with others about this and that.<br/><br/>As the New Year was approaching, everyone began preparing the New Year’s supplies.<br/><br/>The standard of living had improved and they started drying cured sausages and curing meat in the frosty days. They filled all corners of the yard with things they usually wouldn’t eat. By the end of the year, everything was brought out in a joyous mood.<br/><br/>Because, when the end of the year approached, the young people who worked in other places began to return home for the New Year and reunite with their They had struggled outside for a year. Just for life’s sake. But home is still the haven that everyone looks forward to returning to, it’s where warmth lies.<br/><br/>Xiao’s mother, in her black down jacket and sleeve covers, was in the yard making sausage, curing meat, pickling chicken, and so on.<br/><br/>The sausage here was made by mincing marbled meat, marinating it with white wine and various preferred seasonings for two hours, and then stuffing it into a prepared pig intestine casing, then tie them into sections with a thin rope.<br/><br/>However, stuffing the meat into the pig intestine casing was a meticulous task.<br/><br/>A funnel was tied to one end of the casing, then the meat was funneled into it. While filling, they would press the meat so that it would be compacted.<br/><br/>After the sausages were filled, they could be hung out in the sunlight to dry.<br/><br/>The best days to sun-dry the sausages were frosty, consecutive sunny days. This is when the sausages would taste the best.<br/><br/>As for the other cured meats, some needed to be marinated overnight, and others only for two to three hours. After that, they were hung out in the sun to dry.<br/><br/>These cured meats were dishes paired with alcohol when friends and relatives visited during the end of the year.<br/><br/>In previous years, Xiao Jinli would help Xiao’s mother make sausages, but this year, she became unusually busy.<br/><br/>Firstly, she was still a student and hadn’t yet had her vacation. She had a pile of homework during her school period.<br/><br/>Secondly, she had raised more than 100,000 earthworms and grown seedlings for various crops on over five acres of land. Every day, she would go to the greenhouse to check on the earthworms’ growth and development of the seedlings.<br/><br/>Of course, with Lingquan water, everything would definitely grow well.<br/><br/>But Xiao Jinli certainly had to keep up appearances.<br/><br/>“Jinli, are you going to the greenhouse again?”<br/><br/>“Yeah, Aunt,” replied Xiao Jinli, “I have to check it every day.”<br/><br/>“Jinli, are the earthworms big now? When it’s time to plant in the spring, there won’t be any problems with them, right?”<br/><br/>Many people were concerned about this issue.<br/><br/>Due to the reputation of Xiao Family vegetables sold in the town, all people in the village now had a lot of enthusiasm and anticipation for planting vegetables next year. Plus, with the founding of a village company, everyone hoped that Xiao Family Village could really become rich from growing vegetables. They hoped that in the future, young people would no longer need to work outside, and families could be together.<br/><br/>Xiao Jinli smiled, “Don’t worry, aunt. If I say these earthworms will be ready for distribution next year, they will be. It won’t hold anyone back.”<br/><br/>“Haha, I’m just asking..”\t\t\t\t\t\t</div>", "images": {}, "success": true}