{"id": 166, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298212.html", "title": "Chapter 166 - Chapter 166: Chapter 166: Gossip In The Upper-Class Circle (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 166 - Chapter 166: Chapter 166: Gossip In The Upper-Class Circle (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 166: Chapter 166: Gossip in the Upper-class Circle (Second Update)<br/><br/>Translator: 549690339<br/><br/>“Chen’er, today is New Year’s Eve, come back to the Su Family, please,” Lady Su Lan Yingying gently persuaded in Su Yichen’s office.<br/><br/>“After all, we are a family. It’s great to gather together to celebrate the New Year and have a warm reunion meal together. You should know that since you went missing, our family hasn’t been together. Your brother would be so happy to know that you’re coming back for New Year.”<br/><br/>This was not the first time Lady Su had tried to persuade Su Yichen to come home for the New Year.<br/><br/>Since Su Yichen returned from the outside, he not only worked at the Xia Corporation but also lived at the Xia Family’s home.<br/><br/>In just a few days, gossip began to spread among the upper circles.<br/><br/>“I heard that Su Yichen disappeared for half a year and lost his memory when he came back. After losing his memory, he only recognizes the people of the Xia Family and not the Su Family.”<br/><br/>“I heard that when Su Xiangdong tried to take him home, Su Yichen said he didn’t know him.”<br/><br/>“Yeah, when Lady Su went to see him, he also said he didn’t recognize her.”<br/><br/>“Hmm, what on earth happened to Su Yichen during these six months? Before, their family was harmonious and happy. Lady Su, although a stepmother, is very good to Su Yichen, even better than a birth mother. And Su Yichen is very respectful to his stepmother.”<br/><br/>“Lady Su also brags to us all the time about how good she is to her stepson and how he treats her as his real mother. Wherever they go, he always thinks of her.”<br/><br/>“Well, maybe not. Su Yichen disappeared for six months, and Lan Yingying didn’t seem worried at all, didn’t report it or look for him. Besides,” someone whispered, “I’ve heard gossip that Lady Su treats her stepson well because she wants his mother’s inheritance.”<br/><br/>“Haha, really? Su Yichen’s mother’s inheritance? But I haven’t heard of Xia Zhi Meng’s inheritance.”<br/><br/>“Hehe, who says there isn’t? You should know that Xia Zhi Meng used to be a prominent figure in the business world. After becoming pregnant, she gradually withdrew from the field and returned to the family.<br/><br/>She certainly had a lot of assets before she quit the business world. Also, Su Xiangdong founded the Su Corporation with Xia Zhi Meng’s help, providing a lot of financial and human resources. Otherwise, Su Xiangdong, who was only a phoenix man at the time, wouldn’t have been able to build up the Su Corporation so quickly.”<br/><br/>“Speaking of that, I also heard that Su Xiangdong showed his deep love and gratitude by directly giving Xia Zhi Meng 40% of the shares in the company, making her the second-largest shareholder. It is said that before she committed suicide by jumping, she transferred all these shares to her son Su<br/><br/>Yichen. ”<br/><br/>“Ah, are you telling the truth or a lie? Did Xia Zhi Meng really transfer all the company shares to Su Yichen before committing suicide?”<br/><br/>“Mm, I heard it’s true. It was accidentally revealed by Lady Su and overheard by my friend. Not only the company shares but also the stock funds, real estate shops worth billions, and other properties that Xia Zhi Meng had invested in before committing suicide, all had a will leaving it to Su Yichen to inherit.<br/><br/>However, Su Yichen must be 18 years old to inherit these assets. If not inherited within five years after turning 18, it will be considered a waiver of these assets, which will then be donated to the country in Su Yichen’s name.”<br/><br/>“Haha, really?” Someone was shocked, “Not to mention the real estate stocks and funds worth billions, but the 40% shares of Su Corporation alone are worth several billion. Who would donate all these?”<br/><br/>“That’s what Xia Zhi Meng’s will said.”<br/><br/>“Strange, why would Xia Zhi Meng set up such a will? I heard she had a great relationship with Su Xiangdong, right? Why would her inheritance not include Su Xiangdong?”<br/><br/>“Hehe…” Someone sneered immediately and then looked around, whispering and laughing, “Only you’re foolish enough to believe that Xia Zhi Meng had a good relationship with Su Xiangdong. If their relationship was good, why would Xia Zhi Meng suffer from depression and commit suicide by jumping off a building when she had a son?”<br/><br/>“Also, didn’t you notice that Su Xiangdong’s stepson looks very similar to him? If they weren’t related by blood, why would they look so much alike, and become a family?”<br/><br/>As someone mentioned it, others nodded in agreement, “So, you mean, Su<br/><br/>Hanyang might be Su Xiangdong’s biological son?”<br/><br/>“Not might, must be. I heard that Su Xiangdong had a first love before marrying Xia Zhi Meng, and that first love turned out to be Lady Su now. You taste, you savor.”<br/><br/>“Haha, so before Xia Zhi Meng jumped, Su Xiangdong already had an older son, and when Xia Zhi Meng found out, she couldn’t take the blow and committed suicide?”<br/><br/>“Yes, that’s the most likely truth. Otherwise, why would Xia Zhi Meng, who was always strong, suddenly develop depression? Especially when she’s betrayed by the man she deeply loved? Her body and mind couldn’t handle such stimulation.”<br/><br/>“So, Xia Zhi Meng was so pitiful.”<br/><br/>“After Xia Zhi Meng’s suicide, Su Xiangdong hastily brought his first love and eldest son into the family. But Lady Su has her own tricks, somehow finding out about the will Xia Zhi Meng left her son and the huge inheritance.<br/><br/>So she treated the young boy extremely well when she entered. Su Yichen was only three or four years old back then, having just lost his mother. He couldn’t resist Lady Su’s affection and soon treated her like his birth mother.”<br/><br/>“I also heard that Lady Su coaxed Su Yichen into giving up all his mother’s inheritance on his 18th birthday, and transferred all the inheritance rights to her biological son Su Hanyang.”<br/><br/>“Haha, really? I can’t believe it! Is Su Yichen a fool? That’s his mother’s fortune worth several billion, how could he refuse?”<br/><br/>“Yeah, who knows how Lady Su coaxed him? She must have been very persuasive. But I also heard that Su Yichen disappeared on his way to the lawyer’s office.”<br/><br/>“Haha, he disappeared? How did it happen? Is it related to the Xia Family?”<br/><br/>“I don’t know. It might be, or it might not. The Xia Family probably doesn’t want Xia Zhi Meng’s inheritance to fall into Su Hanyang’s hands either. But I heard they didn’t know about Su Yichen’s disappearance.”<br/><br/>“So, what really happened to Su Yichen’s disappearance? I heard that he’s amnesic now, and he doesn’t even know how he went missing.”<br/><br/>“Some suspect that Lady Su had something to do with it.”<br/><br/>“What do you mean?”<br/><br/>“When Su Yichen turned 18, didn’t he sign his abandonment of all of Xia Zhi<br/><br/>Meng’s inheritance, and instead transferred all the inheritance rights to Su Hanyang? Once the agreement was signed, Su Yichen no longer had any utilitarian value, and Lady Su, afraid that he might change his mind, made a preemptive strike.”<br/><br/>“That’s really possible..”\t\t\t\t\t\t</div>", "images": {}, "success": true}