{"id": 167, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298216.html", "title": "Chapter 167 - Chapter 167: Chapter 167: Lady Su Being Squeezed (Part One)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 167 - Chapter 167: Chapter 167: Lady Su Being Squeezed (Part One)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 167: Chapter 167: Lady Su Being Squeezed (Part One)<br/><br/>Translator: 549690339<br/><br/>In Capital City’s upper-class circles, rumors were swirling about Xia Zhi Meng’s inheritance and Su Yichen’s disappearance.<br/><br/>Everyone suspected that after Lady Su had taken the inheritance from her stepson Su Yichen, she had begun plotting against him.<br/><br/>After all, his existence posed a significant threat to her and her son.<br/><br/>However, somehow her son hadn’t received Xia Zhi Meng’s inheritance, and Su Yichen had gone missing.<br/><br/>After hearing these rumors, Lady Su’s face turned red and green with anger.<br/><br/>Especially at the high society gatherings, she was subjected to strange looks from other ladies and open mockery.<br/><br/>“Lady Su, I heard that your eldest son inherited all of your husband’s ex-wife’s assets. Congratulations! I heard that it’s worth more than several hundred million. Your son won’t be able to spend all that money in his lifetime. Ah, it’s not like our children who work so hard at their companies all year round and still can’t make much money. It’s truly a hard life.”<br/><br/>“Lady Su, you’re really lucky. Not only does your husband treat you like a treasure, even your stepson obeys your every command and willingly handed over his mother’s inheritance. Wow, you’re such a good stepmother.”<br/><br/>“Lady Su, I heard that your stepson, who has been missing for half a year, has returned and went straight to the Xia family. Wasn’t it said that his relationship with the Xia family was really bad? Oh, wait, I heard that your stepson has amnesia and doesn’t remember you anymore. Alas, it’s truly a tragedy. How could someone just suddenly lose their memory like that? Who knows what happened to him before his memory loss? He must have injured his head, poor thing. Lady Su, don’t you think so?”<br/><br/>“It’s really quite a coincidence. Just after your stepson signed the inheritance transfer agreement, he went missing. Lady Su, many people suspect that his disappearance is closely related to you. But how could that be possible? You were known to treat this stepson even better than your own son. How could you possibly harm him?”<br/><br/>“Lady Su, once my son and your son Hanyang got drunk and he told my son that he won’t have to bother with his stupid younger brother since he inherited his mother’s assets. He also said that the inheritance belongs to him and he could spend it however he wants. Furthermore, he wished that his foolish younger brother would disappear forever. When I heard this, I couldn’t believe it. After all, your two sons were known for their harmonious brotherly relationship.”<br/><br/>Lady Su listened to these ladies and was furious, but also felt deeply anxious.<br/><br/>How had these rumors spread?<br/><br/>She hadn’t done anything yet – oh, she hadn’t even had the chance to because Su Yichen had disappeared before she could act.<br/><br/>Her son Hanyang hadn’t received Xia Zhi Meng’s inheritance, so how could she possibly harm Su Yichen?<br/><br/>So now, everyone in their circle suspected her of causing Su Yichen’s disappearance?<br/><br/>Lady Su was truly at her wit’s end.<br/><br/>However, the only way to dispel these rumors was to reconcile with Su Yichen.<br/><br/>If Su Yichen still treated her as his mother and showed her respect and reverence, and if he restored his previous relationship with his older brother Su Hanyang, everything would be fine.<br/><br/>Thus, every day Lady Su took her nutritious soup to Xia Corporation to see Su<br/><br/>Yichen.<br/><br/>Knowing which floor he was on, she didn’t bother asking for permission and went up directly with her thermos.<br/><br/>As soon as she entered the office, she spoke kindly to Su Yichen and even brought up the hardships and efforts she went through raising him, hoping to awaken his lost memories.<br/><br/>She believed that Su Yichen’s current indifference toward her was because of his amnesia. Without the shared memories between them, she was naturally treated as a stranger by him.<br/><br/>But day after day, she had been unceremoniously driven away by Su Yichen, causing Lady Su to grow increasingly anxious.<br/><br/>New Year’s Eve was approaching fast.<br/><br/>Lady Su wanted to take advantage of the holiday to persuade Su Yichen to come home. If the family could be reunited and harmonious during the New Year, it would dispel the circulating rumors.<br/><br/>However, Su Yichen’s attitude remained the same.<br/><br/>He looked coldly at Lady Su and said, “Lady Su, I’ve told you, I don’t remember anything that happened before. Therefore, no matter who you are to me, I can only treat you as a stranger. It’s impossible for me to go to a stranger’s house for the New Year. I’m sorry, Lady Su, but I’m very busy now. Please don’t disturb my work and ask you to leave!”<br/><br/>Seeing Su Yichen’s cold attitude, Lady Su’s face twisted for a moment, and she couldn’t help but think of him as a heartless and ungrateful person, a cursed wretch, and a despicable man.<br/><br/>However, Lady Su quickly regained her composure, forcing a smile and saying, “Yichen, after all, your father, your brother, and I all used to be your closest relatives before you lost your memory. Now that you’ve lost your memory and don’t remember us, we don’t blame you. It’s just that now it’s the New Year, a time for family reunions. We should all gather together for a New Year’s Eve dinner, right? Yichen, your room is still the same as before, and once you go back and see everything there, you’ll surely remember everything.”<br/><br/>Su Yichen shook his head and said, “Lady Su, I’m not used to being around strangers, let alone eating a meal with them. Please don’t bother, I won’t be going back with you for the New Year. And again, please leave!”<br/><br/>Lady Su was a proud person, and being rejected and humiliated by Su Yichen again and again made her very angry.<br/><br/>But she was also very good at enduring, and in the end, she took a deep breath and left.<br/><br/>After all, she couldn’t give up!<br/><br/>Looking at her receding figure as she angrily got into her car, Su Yichen’s mouth curled into a smile, finding the situation highly amusing.<br/><br/>Then, his gaze turned to the sky, his eyes holding a hint of melancholy and loneliness.<br/><br/>He thought to himself, “Yes, today is New Year’s Eve, a time for family reunions, but where is my family? Uncle, Aunt, Brother Xuan, and Jinli, are you all happily preparing for the New Year’s Eve dinner at home? Do you still remember me?”<br/><br/>As the clock struck midnight on New Year’s Eve and the brand new year began, fireworks lit up the sky, filling the air with a lively and festive atmosphere.<br/><br/>“Happy New Year! ”<br/><br/>“Happy New Year! ”<br/><br/>Subsequently, the TV show hosts began offering their New Year wishes.<br/><br/>During the New Year’s celebration, Xiao Jinli was woken up.<br/><br/>The whole family gathered together to welcome the New Year, a blessing for a harmonious and united family.<br/><br/>This year’s New Year was even more lively than before.<br/><br/>Everyone was there.<br/><br/>In previous years, it was lively, but due to adults’ work schedules, some simply couldn’t make it home to celebrate, and either he or she was missing.<br/><br/>A new year, a new beginning!\t\t\t\t\t\t</div>", "images": {}, "success": true}