{"id": 162, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298196.html", "title": "Chapter 162 - Chapter 162: Chapter 162: The Bustle Of New Year 4 (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 162 - Chapter 162: Chapter 162: The Bustle Of New Year 4 (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 162: Chapter 162: The Bustle of New Year 4 (Second Update)<br/><br/>Translator: 549690339<br/><br/>At noon, the arrival of Little Aunt’s family of three made the meal even more lively.<br/><br/>Since they had to work in the afternoon, no one drank alcohol.<br/><br/>Gao Yanxin muttered while eating, “This is what real food should taste like. No matter how good the ingredients are, when they’re in my mom’s hands, they turn into a pile of mud.”<br/><br/>Everyone at the table found his mumbling amusing.<br/><br/>Ji Yuzhu said angrily, “You little brat, don’t think we can’t hear your mumbling. If you think my cooking is so bad, why don’t you cook for yourself instead of relying on your mom.”<br/><br/>Gao Jianjun, sitting next to him, also became serious, “Gao Yanxin, since you dislike your mom’s cooking, from today on, you should learn to cook with your eldest aunt and Brother Xuan. Once you’ve learned, you can be in charge of our meals.”<br/><br/>Gao Yanxin, ‘<br/><br/>He inherited his mother’s lack of culinary talent, so no matter how hard he tried, he couldn’t cook well.<br/><br/>He immediately protested, “Dad, I am my mom’s biological son. I didn’t inherit any of eldest aunt’s culinary talents, but I inherited my mom’s inability to cook fully. No matter how hard I try, I can’t learn.”<br/><br/>“I don’t care. You better learn well these next few days,” Gao Jianjun ordered.<br/><br/>Gao Yanxin felt utterly desperate.<br/><br/>At this point, Xiao Junxuan said, “Cousin Xin, cooking is actually not that difficult. With my mom and me teaching you, I believe you’ll become an excellent chef.”<br/><br/>He had tasted his little aunt’s cooking before.<br/><br/>Honestly, the appearance alone was either burnt or undercooked, not to mention the taste was indescribable.<br/><br/>Fortunately, his own mom was a good cook, so he didn’t have to suffer from childhood till now.<br/><br/>Thinking about it, he actually felt a little sorry for his cousin.<br/><br/>Gao Yanxin, who was initially discouraged, became full of energy and confidence, saying, “Yes, I will definitely master culinary skills and cook delicious meals. Dad, Mom, just wait for my success.”<br/><br/>Ji Yuzhu laughed and said, “Alright, we’ll wait for Chef Gao to make us delicious meals.”<br/><br/>Because Little Aunt’s family preferred vegetarian dishes, there wasn’t much meat for lunch, just a braised pork dish and braised beef brisket with radish. The rest were vegetarian dishes.<br/><br/>However, everyone enjoyed their meal happily.<br/><br/>After lunch, Xiao’s father began preparing incense sticks, while Xiao Junxuan and Gao Jianjun carried out the cleaned tables and set them up.<br/><br/>Around two or three in the afternoon, they heard the sound of firecrackers going off.<br/><br/>Gao Yanxin curiously asked, “Why is someone setting off firecrackers so early?”<br/><br/>Xiao Junxuan replied, “Once people have prepared everything, they set off firecrackers to start the ritual of honoring the gods.”<br/><br/>Xiao’s father caught a rooster and started to slaughter it. Rural people’s customs dictate that sacrificing a rooster is needed on Lunar New Year’s Eve and the second day of the lunar new year.<br/><br/>After plucking the feathers and gutting the rooster, it was cleaned and then boiled in a pot. The plate was arranged in a squatting position with the rooster’s head facing upwards.<br/><br/>Looking at the cooked rooster, Gao Yanxin asked, “How did you arrange the rooster like this? Why does it have to be like this?”<br/><br/>Xiao Junxuan glanced at him and said indifferently, “This is how us country folks do it.”<br/><br/>By 3-4 0’clock in the afternoon, the village was filled with the sounds of firecrackers going off.<br/><br/>Accompanying the noise were the joyful voices of children who had taken a bath, put on new clothes, and were running around playing with toys and picking up firecracker debris.<br/><br/>The festive atmosphere of the Lunar New Year was ignited by the sounds of firecrackers, making everything extremely lively!<br/><br/>The Xiao family had also set up a table for worshiping and prepared nine bowls – three filled with alcohol, one with tea, one with small fish, three pieces of fried square tofu, as well as tangerines and candies, and a large rooster in the center!<br/><br/>After setting off firecrackers, they carried the basket and offered offerings to the gods in all directions.<br/><br/>By 5-6 0’clock, all three of Xiao Jinli’s uncles had arrived.<br/><br/>Each family came in a car.<br/><br/>Xiao Iinli’s three uncles. eldest uncle Ti Deliang. second uncle Ti Derong. and third uncle Ji Deming, were all named according to their generation.<br/><br/>Each uncle had two sons.<br/><br/>The eldest son of the eldest uncle, Ji Mingxing, was 28 years old, married and had a son named Ji Bohan, who was three years old this year.<br/><br/>The second son, Ji Mingchen, was 23 years old, unmarried but in a relationship.<br/><br/>The eldest son of the second uncle, Ji Kaijun, was 24 years old, unmarried, with a girlfriend.<br/><br/>The second son, Ji Haitao, was 20 years old, unmarried.<br/><br/>The eldest son of the third uncle, Ji Haiyang, was 16 years old and in high school.<br/><br/>The second son, Ji Haifan, was 12 years old, in junior high school.<br/><br/>The eldest daughter of the maternal grandparents, Xiao’s mother Ji Fangqin, had a son named Xiao Junxuan and a daughter named Xiao Jinli.<br/><br/>The second daughter, Ji Yuzhu, had a son named Gao Yanxin.<br/><br/>Well, the Ji family’s third generation was predominantly male, with Xiao Jinli being the only girl.<br/><br/>As a result, Xiao Jinli was treated like a little princess in the Ji family, receiving love and affection from everyone.<br/><br/>The grandparents had a keen eye for choosing their daughters-in-law, all of whom were kind, generous, and virtuous.<br/><br/>Women who married into the Ji family never had any mother-in-law issues, sister-in-law issues, or aunt-niece issues; the family was harmonious.<br/><br/>“Ah, the uncles are back!” Seeing the car, Xiao Jinli called out loudly.<br/><br/>Then, Ji Yuzhu’s family, Xiao’s mother, and others all came out to greet them.<br/><br/>As soon as the car stopped, those inside immediately got out.<br/><br/>“Eldest Uncle, Eldest Aunt, Second Uncle, Second Aunt, Third Uncle, Third Aunt!” Xiao Jinli and other younger family members all greeted the arrival of the uncles and aunts.<br/><br/>“Eldest cousin, eldest cousin’s wife, second cousin,…”<br/><br/>The eldest uncle and others responded right away, and they also greeted their elders first.<br/><br/>Then, they turned to Xiao Jinli, and happily said, “Wow, Jinli has grown so much taller, and she’s getting prettier.”<br/><br/>“Haha, our Jinli has always been better looking than other kids. Come on, Jinli, your eldest aunt has brought you a gift!” The eldest aunt pulled Xiao Jinli and laughed.<br/><br/>Being the only girl in the family, they naturally doted on her and brought her gifts every time they came back from other places.<br/><br/>Even though the gifts were always the same – either clothes or toys – as the girl grew older, her figure and taste changed, so buying her beautiful clothes was inevitable.<br/><br/>As for the boys in the family, well, except for Little Bo Han, who occasionally got some handsome clothes, no one really bought things for them anymore.<br/><br/>As the boys grew up, their tastes were different from adults, so they received money to buy things themselves.<br/><br/>As long as they liked it, they could buy ten holey pants and no one would complain.<br/><br/>Xiao Jinli accepted the gifts from her third aunt and eldest cousin’s wife and thanked them with a smile, “Thank you to my three aunts and eldest cousin’s wife..”\t\t\t\t\t\t</div>", "images": {}, "success": true}