{"id": 164, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298204.html", "title": "Chapter 164 - Chapter 164: Chapter 164: The Bustle Of New Year 6 (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 164 - Chapter 164: Chapter 164: The Bustle Of New Year 6 (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 164: Chapter 164: The Bustle of New Year 6 (Second Update)<br/><br/>Translator: 549690339<br/><br/>Once the meat dishes were served one after another, Xiao Father had already brought out the Yangmei wine.<br/><br/>Xiao Wanshan said, “This is the Yangmei wine Xiaofang brewed a year ago. It’s been sealed for a year, and the aroma is particularly strong. Big brother, you and I need to appreciate it.”<br/><br/>Gao Jianjun also added, “I was the first to taste this wine. It was never hidden back then, and it tasted great. Now that it’s been stored for a year, it must be even more extraordinary.”<br/><br/>Eldest Uncle nodded, “Eldest sister’s cooking and wine-making abilities have never disappointed.”<br/><br/>“Speaking of which, I haven’t had a meal cooked by my eldest sister for a year, and I really miss it.” Third Uncle said with a smile, “Tonight, I must eat my fill.”<br/><br/>Maternal grandfather laughed and said, “How can you eat enough in one night? I guess you guys will be eating here for the next few days.”<br/><br/>He and his wife heard that Xiao Jinli was cultivating earthworms and said they would stay and help, but they were actually craving the food.<br/><br/>They were too old to be of much help.<br/><br/>The work in the fields was done by hired hands.<br/><br/>The chores at home were done by their eldest daughter, son-in-law, and grandson. The elderly couple only did light tasks.<br/><br/>Everyone was more excited about tonight’s meal after hearing what their old father said.<br/><br/>Honestly, there were no rules when it came to celebrating the New Year in their family.<br/><br/>They spent New Year’s Eve here, stayed up for the occasion, and probably would still be here on the first day of the new lunar year.<br/><br/>Starting from the second day, they would probably visit relatives and friends.<br/><br/>Xiao Wanshan unsealed the jar, and the aroma of wine filled the whole house.<br/><br/>“It smells so good!” The people in the room sniffed the aroma of wine, “This wine is really mellow. It seems that we must drink more tonight.”<br/><br/>Eldest Uncle and the others laughed.<br/><br/>Xiao Wanshan said, “The alcohol content of this wine is low, it smells good, and it doesn’t get you drunk when you drink it, so you can drink a few more cups. Moreover, this wine doesn’t cause vomiting after drinking, and it helps you sleep well. If you guys get drunk, just stay here. We can squeeze in.” Every room was already cleaned.<br/><br/>The three uncles had strong self-control and seldom got drunk unless it was necessary for social occasions.<br/><br/>Today was a rare occasion for everyone to gather, so it was lively and happy.<br/><br/>The tempting aroma of wine and dinner couldn’t hurt to get drunk for a while.<br/><br/>“Okay, we’ll drink more tonight. Wanshan, Jianjun, you must accompany us in drinking.” The eldest uncle said very seriously, “You can’t just focus on getting us three brothers drunk.”<br/><br/>Xiao Wanshan and Gao Jianjun nodded in unison, “Of course, we will definitely accompany you in drinking.”<br/><br/>Then, Xiao Wanshan poured a full cup for each person who could drink wine.<br/><br/>For those who didn’t drink, tea was served.<br/><br/>“Actually, this tea is so delicious that it can get you drunk.” Second Aunt took a small sip of tea from the teacup, “The taste lingers on the lips and palate, and  the aftertaste is long-lasting. Who made this tea? The tea brewing skills are getting better and better.”<br/><br/>“I think it was my cousin who made it.” Fourth cousin said, “I saw her making the tea.”<br/><br/>“Oh, was it Jinli who made it?” Second Aunt was slightly surprised, “Jinli’s tea brewing skills can be considered master level. How did she make the tea so delicious?”<br/><br/>Xiao Wanshan laughed, “It’s not little Bao’s tea brewing skills, but the water quality. Our family well water is sweet and refreshing, and the tea brewed is really extraordinary. Any of us could make it.”<br/><br/>Third Aunt was slightly surprised and asked, “Oh, really? Why don’t I remember the tea being so fragrant in the past?”<br/><br/>Ji Yuzhu said, “Third sister-in-law, the water in the well wasn’t as good before. In the past year, for some unknown reason, the water has become more and more delicious, especially in summer when the weather is hot, drinking a sip of water from the well is really comfortable.”<br/><br/>“Oh, is it because of the water?” Second aunt sounded a little disappointed. “I thought it was Jinli’s superb tea brewing skills. Frankly speaking, with these tea brewing skills, she could participate in a competition.”<br/><br/>“Haha, Little Bao is too lazy to make any effort. She would rather sleep in than participate in any competition.” Xiao Wanshan bragged, “In the first half of this year, the Elementary School Principal persuaded Jinli to participate in the<br/><br/>Olympic Math Competition, and Xiaofang has done a lot of ideological work. However, Xiaofang only says that the child should do what she wants. Later, something happened, and Xiaofang agreed to let Little Bao participate in the competition.”<br/><br/>“What happened that made Xiaofang let Jinli participate in the competition?” Eldest aunt asked curiously.<br/><br/>Everyone knew Xiao Jinli’s temperament. Although she was usually sensible and well-behaved, she could be very stubborn and wouldn’t easily agree to anything.<br/><br/>Xiao Wanshan said with a smile, “It was her former class headteacher who let her nephew bully his classmates. Little Bao couldn’t stand it and stood up for her classmates. But that class headteacher turned the tables and accused Little Bao of having average grades, sleeping in class, and defying the teacher, demanding that she be expelled from school.”<br/><br/>As soon as they heard that Little Bao was to be expelled, the faces of the eldest uncle and the others turned sour. Their well-behaved niece might have average grades but generally didn’t cause trouble. Hmph, expulsion, that class headteacher was too full of himself.<br/><br/>Before the eldest uncle and the others could get angry, Xiao Wanshan continued, “Fortunately, the school leaders were sensible and knew that Little Bao might be hiding her true abilities. After verifying the facts, the class headteacher was promptly removed from his position and given a severe punishment.”<br/><br/>Later, the principal used this incident to persuade Xiaofang to let Little Bao participate in the competition to slap the faces of those who said she had poor grades. Sure enough, Xiaofang was convinced by the principal, and Little Bao went on to participate in the whole county competition, winning a special prize and earning several hundred yuan.”<br/><br/>“Haha, I knew my niece was something special. Indeed, she doesn’t speak up until she has something amazing to say!” The eldest uncle said happily, “See, who would dare say Little Jinli has poor grades now? This competition result is a slap in the face for them.”<br/><br/>“Haha, Little Jinli has been incredibly clever since she was little. She just doesn’t like to strain herself. Otherwise, she would get first place every year, and being a three-good student would be effortless.”<br/><br/>“It’s just that Little Jinli doesn’t want to stand out. Sigh, that child is clever and has a heart like a mirror.”<br/><br/>As they spoke, Gao Yanxin and Ji Kaijun brought two more dishes to the table. One was an Eggplant Claypot, and the other was stir-fried leek with eggs!<br/><br/>“It smells so good!”<br/><br/>“It’s so fragrant. Just smelling it makes my mouth water.”<br/><br/>Gao Yanxin pointed at the plate of chive and egg, and said to his eldest uncle, “Eldest uncle, when my elder aunt first made this chive and egg dish in the kitchen, half of it was eaten by my mom!”<br/><br/>“Gao Yanxin!” Ji Yuzhu blushed slightly and yelled angrily..\t\t\t\t\t\t</div>", "images": {}, "success": true}