{"id": 165, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298208.html", "title": "Chapter 165 - Chapter 165: Chapter 165: Keeping The New Year’S Eve Vigil (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 165 - Chapter 165: Chapter 165: Keeping The New Year’S Eve Vigil (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 165: Chapter 165: Keeping the New Year’s Eve Vigil (First Update)<br/><br/>Translator: 549690339<br/><br/>Just as Gao Jianxin and his wife had said, the Xiao Family’s vegetarian dishes were more popular than the meat dishes. As soon as their uncles tasted them, they couldn’t stop eating. Even the usually well-mannered people didn’t bother to be polite, picking up their chopsticks and grabbing food straight from the plates.<br/><br/>“Why are these vegetables so delicious? They’re so fragrant, and each dish has its own unique flavor.”<br/><br/>“Yes, when the dishes enter your mouth, you can immediately feel how extraordinary they are. The taste is simply unparalleled.”<br/><br/>“Are these really homegrown vegetables? In the past, the delicious taste of the food relied on the Auntie’s cooking skills. Now the taste is not only due to her cooking skills but mainly the original taste of the vegetables themselves.”<br/><br/>Gao Yanxin kept raving while eating, “You guys don’t know, but these vegetables are all grown by Cousin herself. During the summer vacation, she planted five points of land, and I stayed for one month, eating these vegetables every day and never getting tired of them. Now, when I eat them again, ah, it’s truly unforgettable.”<br/><br/>Everyone, ‘ .<br/><br/>The other cousins listened enviously, “Ah, you get to eat them every day.”<br/><br/>Then they complained, “The vegetables at the Auntie’s house are so delicious. Why didn’t you tell us cousins and let us try them too? Had I known this, I would have come over during summer vacation.”<br/><br/>Gao Yanxin looked puzzled, “Ah, didn’t I call to tell you guys?”<br/><br/>Ji Haiyang looked slightly resentful, “No, you didn’t. I doubt you wanted to keep it all to yourself.”<br/><br/>He then turned to Xiao Jinli, “Cousin, how come you didn’t call to tell us about your homegrown vegetables? We would have come to show our support. Now Yan Xin is the one benefiting.”<br/><br/>Xiao Jinli looked a bit innocent, “I… how was I supposed to tell you? By saying ‘I’ve grown vegetables myself, dear cousins come and have a taste, and support me?”’<br/><br/>At this point, the maternal grandmother spoke, “I remember telling you all. I said that your cousin built a greenhouse to grow many vegetables. I also bragged that the vegetables she grew were very tasty. But you all thought I was exaggerating, so none of you believed me.”<br/><br/>The cousins, ‘ .<br/><br/>It was true that their Grandma had said that, but they thought she was biased and overly praising their cousin’s vegetable farming.<br/><br/>The maternal grandfather couldn’t help but chide, “Hehe, you don’t even trust your own grandmother, how can you be so reasonable?”<br/><br/>The cousins, ‘ . Fine, they were wrong.<br/><br/>When they leave this time, they will definitely bring back more vegetables with them. Hmph.<br/><br/>“Come, let’s toast!” Xiao Wanshan stood up and said, “On this New Year’s Eve, let’s wish our parents good health and safety!”<br/><br/>“Come, let’s toast to our grandparents (parents) (maternal grandpa and grandma) good health, safety, and a happy New Year’s Eve! Cheers!”<br/><br/>Those who could drink alcohol poured a glass, and those who couldn’t drink substituted with soft drinks.<br/><br/>Afterward, everyone enjoyed the meal.<br/><br/>After dinner, the adults collaborated to clean up the dining table, bowls, and chopsticks, and then started watching the annual Spring Festival Gala.<br/><br/>But on the first day of the new lunar year, you eat dumplings.<br/><br/>The dumpling fillings had already been prepared in the afternoon – chives, scallions, radish, and cabbage fillings, all vegetarian.<br/><br/>So, while watching the program, they rolled dumpling wrappers and made dumplings.<br/><br/>“Ah, this year’s performances have improved a lot and are even more exciting.” “Yes, look at this comedy sketch, haha, it’s funny and thought-provoking.”<br/><br/>“This song almost expresses the feelings of everyone who’s away from home. Always go home and visit your family!”<br/><br/>Everyone discussed the program.<br/><br/>However, they also set up a mahjong table and two card tables.<br/><br/>Everyone stayed up late to welcome the arrival of the New Year.<br/><br/>But Xiao Jinli and Ji Bohan, being the youngest, were urged to go to bed by the adults at 9:oopm.<br/><br/>Ji Bohan was staying with his Great Aunt for the first time, and being together with everyone was lively and fun. He also wanted to stay up with them, but his energy couldn’t keep up.<br/><br/>Too excited during the daytime, by eight o’clock, he was already getting sleepy. The eldest cousin’s wife found it amusing, so she put him to bed.<br/><br/>Rarely having everyone together, Xiao Jinli didn’t want to rest so soon. Despite trying several times to indicate that she wanted to stay, she was not allowed to.<br/><br/>After all, she was still growing, and staying up late wasn’t good for her.<br/><br/>Xiao Jinli finally gave in, “When it’s time for the New Year countdown, make sure to call me. I want to spend it with everyone.”<br/><br/>“Alright, alright, we’ll definitely call you. Now go and rest.”<br/><br/>So, while the adults were having fun in the living room, Xiao Jinli had no choice but to go back to her room and rest.<br/><br/>Once the two youngest children left, the adults enjoyed themselves even more, with louder voices playing mahjong and cards.<br/><br/>Previously, they had been considerate of the children and played cautiously.<br/><br/>When Xiao Jinli returned to her room, she was mocked by Xiao Zhi. “Haha, Master, you’re isolated from the adults. Everyone is playing, but you can only come back to your room and rest. That’s so funny.”<br/><br/>Xiao Jinli rolled her eyes, “What’s so funny about that? In their eyes, I am just a child, a growing child. So naturally, they won’t let me stay up late. Humph, everyone is just being affectionate.”<br/><br/>Xiao Zhi nodded in agreement, “Yes, yes, you’re still a child and a growing child at that. So while everyone has fun in the living room, you have to be alone in your room.”<br/><br/>Xiao Jinli, “…” What’s there to say about that? Isn’t that normal?<br/><br/>Xiao Jinli then glanced at the bed and said, “Xiao Zhi, help me check what Su Yichen is doing now.”<br/><br/>“Ha, Master, why are you suddenly interested in Su Yichen?” Xiao Zhi wondered. His eyes widened in surprise as he asked, “Master, are you really interested in Su Yichen and are developing worldly desires?”<br/><br/>Then he kept chattering, “This won’t do, Master. Have you forgotten that you were deceived by a jerk for several years? Men are no good, and this Su Yichen is no exception. You saved him, and he pretended to have amnesia to deceive you…<br/><br/>“Shut up!” Xiao Jinli’s face darkened, and she retorted, “I’m just curious about Su Yichen’s current situation and want to watch the show. Also, don’t forget that my dad, my brother, and my uncles are men, too. They are all responsible men who love their wives and families.”<br/><br/>Xiao Zhi, It’s over. The master has been completely assimilated by these ordinary people.<br/><br/>The Master can’t be deceived and hurt by others again.<br/><br/>Hearing his mutterings, Xiao Jinli’s face became even more frustrated..\t\t\t\t\t\t</div>", "images": {}, "success": true}