{"id": 160, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298189.html", "title": "Chapter 160 - Chapter 160: Chapter 160: The Bustle Of New Year 2 (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 160 - Chapter 160: Chapter 160: The Bustle Of New Year 2 (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 160: Chapter 160: The Bustle of New Year 2 (Second Update)<br/><br/>Translator: 549690339<br/><br/>Xiao Jinli walked out with two baskets of green vegetables, upon seeing Ji<br/><br/>Yuzhu and her other two companions, she was very surprised. She immediately called out, “Auntie, uncle, you’ve arrived so early? I thought you would come over for dinner in the afternoon.”<br/><br/>Ji Yuzhu looked at the two baskets of vegetables Xiao Jinli was carrying, walked over to her, took one basket, and said, “I’ve been off work for a while now, and your uncle also started his holiday early. So, we decided to come early and help out if needed.”<br/><br/>She carried the basket, took a look at the vegetables inside, and asked, “You picked so many vegetables?”<br/><br/>Xiao Jinli nodded, “Hmm, my grandmother said, after dinner, when it’s time to keep vigil for the New Year (a Chinese tradition), we will make dumplings.”<br/><br/>“That sounds good.” Ji Yuzhu said happily, “These vegetable dumplings with no meat will certainly taste great. Adding meat might dilute the flavour of the greens. ”<br/><br/>Xiao Jinli’s aunt dumped an entire basket of vegetables into the sink, where their grandmother was still washing chives.<br/><br/>Seeing almost a sinkful of chives, her aunt asked with a small gasp of surprise, “So much chives was harvested?”<br/><br/>Her grandmother said, “We need to stir-fry some dishes with chives, and also use chives to make dumplings, so natural we harvested a little more.”<br/><br/>Her aunt nodded, “Oh, so that’s it.”<br/><br/>Then, she went to the kitchen to find an apron. After putting it on, she began helping to clean the vegetables.<br/><br/>While washing the vegetables, she said, “I miss eating green vegetables from here so much. At home, we also used earthworms to grow some fruits and vegetables, but the Taste is just not the same. Now that I’m here, I must eat my fill.<br/><br/>Gao Yanxin, standing by her side, said, “Tonight, when the uncles return, there will be many people, and they will definitely want to eat these vegetables. Mom, the only way you can eat your fill is to sneak some in the kitchen!”<br/><br/>Upon hearing this, Ji Yuzhu instantly retorted, “You naughty boy, who needs to sneak food in the kitchen?”<br/><br/>“Mom, haven’t you sneaked food in the kitchen before?” Gao Yanxin said loudly, “I remember you ate almost half the plate.”<br/><br/>“Alright, stop bringing up the past!” Ji Yuzhu retorted in exasperation, “I wasn’t sneaking food, I ate it openly. What, do you have a problem with that? Even if you do, keep it to yourself. Enough, stop talking so much and get to work.” Gao Yanxin looked around at the busy scene and asked, “What work should I<br/><br/>“I will go ask your Brother Xuan!” Ji Yuzhu shouted, “Everyone else is working, but you’re standing there doing nothing, aren’t you embarrassed?”<br/><br/>Gao Yanxin pouted and said, “It’s not that I don’t want to work, it’s that I don’t know what to do.”<br/><br/>At this point, Xiao Wanshan smiled and said, “Xiao Xin, you don’t have to work, go keep your grandfather company and have some tea.”<br/><br/>Their grandfather, however, waved at him and said, “Xiao Xin, let’s hang couplets. The couplets and lanterns haven’t been put up yet.”<br/><br/>Having said that, he went to his room and took out the couplets and lanterns.<br/><br/>Gao Yanxin asked, “Where is the ladder?”<br/><br/>“It’s in the firewood room.” The grandmother said, “Be careful.”<br/><br/>“Got it, grandmother!” Gao Yanxin excitedly rushed to the firewood room.<br/><br/>After he brought out the ladder, the grandfather held the couplet, pointed to a place, and said to Gao Yanxin, “This couplet, just stick it there.”<br/><br/>The grandfather pointed to a position, “Hmm, apply some double-sided tape first.”<br/><br/>Before long, the couplets were hung up. After that, they started hanging lanterns.<br/><br/>Gao Jianjun went to the greenhouse to look at the earthworms.<br/><br/>When Gao Jianjun wanted to enter the greenhouse, Shi Dajiang didn’t know who he was and stopped him.<br/><br/>“May I know who you are?” Shi Dajiang asked.<br/><br/>“I’m Gao Jianjun, Xiao Jinli’s uncle. I’m here to take a look at the earthworms.” Gao Jianjun directly stated his identity.<br/><br/>“Oh, you’re the uncle of the little householder?” Shi Dajiang rather responsibly replied, “I have to confirm this with the little householder!”<br/><br/>‘ Gao Jianjun nodded and said, “Alright!”<br/><br/>Immediately after, Shi Dajiang took out a small cellphone. After a moment, the call was connected, he hastily asked, “Little householder, there’s a person named Gao Jianjun here who claims to be your uncle. He wants to go into the greenhouse to take a look. Ok, ok, I got it!”<br/><br/>Afterwards, Shi Dajiang said to Gao Jianjun, “Mr. Gao, I’ve confirmed your identity, you may go in.”<br/><br/>Gao Jianjun nodded, “Hmm, you’re very dedicated!”<br/><br/>Shi Dajiang said with a smile, “Since I’m taking the householder’s money, I should pay due respect to my job.’<br/><br/>He was very happy now.<br/><br/>He had already received two months’ salary and had some money on hand. He could afford to buy two new sets of clothes for his grandson and buy some meat to supplement his grandson’s nutrition.<br/><br/>During these two months, his grandson had grown much taller, his complexion had become much rosier, and he no longer had that malnourished look.<br/><br/>More importantly, the child had become much happier.<br/><br/>When Gao Jianjun walked into the greenhouse, what caught his eyes was a field of tender green and yellow seedlings.<br/><br/>However, at first glance, it looked quite spectacular, appealing to human vision.<br/><br/>Gao Jianjun could not help but exclaim, “It’s really beautiful. From afar, it looks like a large grassland.”<br/><br/>Shi Dajiang stood by him while his grandson had run off to play with the village kids.<br/><br/>Shi Dajiang said, nodding, “Yes, it’s really beautiful. These are all the seedlings that the whole village needs to grow for next year. These seeds were all bought by the little householder. There are hundreds of types of seedlings here.”<br/><br/>Gao Jianjun, who had heard Xiao Jinli talk about this before, nodded and said,<br/><br/>“These seedlings can be transplanted after next spring, right?”<br/><br/>“Yes, they can be.” Shi Dajiang nodded and said, “The plan was to plant them in the spring of next year.”<br/><br/>“Oh, where are the earthworms?” Gao Jianjun looked at the seedlings and started looking for the earthworms, but he found that the earthworms were not showing themselves.<br/><br/>Shi Dajiang explained with a smile, “The weather is too cold now, and even in the insulated greenhouse, the earthworms can’t adapt to this temperature, so they all burrowed into the ground to hibernate. However, as soon as the weather warms up, they will come out to bask in the sun or breathe.”<br/><br/>After taking care of the greenhouse for two to three months, he had observed the habits of these earthworms.<br/><br/>Gao Jianjun nodded, “Oh, I see!”<br/><br/>Then, he asked, “Is there a shovel? I want to dig some out to see.”<br/><br/>Upon hearing this, Shi Dajiang looked somewhat surprised, “You want to dig them out?” Then he shook his head, “No, no, what if the earthworms get hurt when you dig? The earthworms in this greenhouse are very valuable. The whole village of Xiao Family Village is counting on these earthworms, so not one of them can be lost.”<br/><br/>Gao Jianjun, ” …” He knew that the earthworms here were valuable, they cost up to 88,000 per kilogram overseas.<br/><br/>But he was just a little curious now, wondering how big these earthworms had<br/><br/>grown..\t\t\t\t\t\t</div>", "images": {}, "success": true}