{"id": 161, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298192.html", "title": "Chapter 161 - Chapter 161: Chapter 161: The Bustle Of New Year 3 (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 161 - Chapter 161: Chapter 161: The Bustle Of New Year 3 (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 161: Chapter 161: The Bustle of New Year 3 (First Update)<br/><br/>Translator: 549690339<br/><br/>When Xiao Jinli arrived at the greenhouse, she saw Gao Jianjun with a shovel, shoveling the soil, and Shi Dajiang with a look of difficulty on his face.<br/><br/>As soon as he saw Xiao Jinli, he stepped forward and said, “Little Householder!”<br/><br/>Xiao Jinli nodded and then asked, “Uncle Shi, didn’t I give you a holiday? Didn’t you and your children go back for the New Year?”<br/><br/>Shi Dajiang shook his head and said, “For the New Year, it is just Xiao Bao and me. Here, it is also just Xiao Bao and me, so I simply didn’t go back. For me and my child, it doesn’t matter where we celebrate the New Year. I don’t have many relatives and friends, and if they want to come to find me, they can come directly here.”<br/><br/>Anyway, the two villages are not far apart.<br/><br/>When people are poor, no one looks up to them.<br/><br/>Usually, his family has few relatives and friends throughout the year.<br/><br/>Even if he went to someone else’s house, he would be ridiculed in the face or secretly, saying that they were simply visiting.<br/><br/>So he simply didn’t go.<br/><br/>Xiao Jinli nodded and then said, “Then come to my house to celebrate the New Year tonight. My family has many people today, you and Xiao Bao come, and we will celebrate together.”<br/><br/>Shi Dajiang’s expression froze, and the next moment, his eyes became red, feeling very moved and grateful, “Thank you, Little Householder. Xiao Bao and I will celebrate the New Year in this house tonight.”<br/><br/>Since his son and daughter-in-law passed away, he has rarely received kindness from others.<br/><br/>In the past, even if someone suggested going to his house for the New Year, their eyes revealed disdain and contempt. Obviously, they were just saying it, not really wanting them to go for the New Year.<br/><br/>But this little householder, time and time again, showed kindness to him, and even gave him a warm and fulfilling job.<br/><br/>He didn’t know how to repay this kindness in his life.<br/><br/>Xiao Jinli said, “Uncle Shi, it’s just a meal. After dinner, you can come back, it’s nothing.”<br/><br/>Gao Jianjun persuaded on the side, “Yeah, it’s just a meal. You can take the child with you and join in the fun.”<br/><br/>After hesitating for a moment, Shi Dajiang said, “Alright, Little Householder, then I will not be polite.”<br/><br/>But in his heart, he was thinking, “In the future, he will have to work even harder.’<br/><br/>Xiao Jinli looked at Gao Jianjun and asked, “Uncle, did you find the earthworms?”<br/><br/>‘ Gao Jianjun shook his head, “No, it seems they are all hiding.”<br/><br/>“The weather is too cold now, and the earthworms can’t adapt, so they hide in the ground and won’t come out. In a few days, when the sun comes out and it’s warmer, they will come out, and you can see them too.”<br/><br/>Gao Jianjun nodded regretfully, “Alright, it will be in a couple of days.”<br/><br/>Anyway, he has a seven or eight-day vacation.<br/><br/>When Xiao Jinli and Gao Jianjun were about to leave, Xiao Bao, wearing nice clothes and holding his new toys, rushed in excitedly. He ran and shouted, “Grandpa, look, my good friend gave me two new toys.”<br/><br/>Then, he noticed Xiao Jinli and immediately greeted her politely, “Sister Jinli!”<br/><br/>Xiao Jinli patted his little head and asked with a smile, “Xiao Bao, did you have fun today?”<br/><br/>Xiao Bao nodded, “Yes, so much fun! There were so many kids playing with me, they shared their new toys with me, and they also gave me some candy and snacks!”<br/><br/>Unlike before when he was at home, the children in the village used to bully and beat him, saying he had no parents to support him, cursing him as a disabled grandson. In short, no one wanted to play with him.<br/><br/>But it was different here.<br/><br/>The children here not only didn’t curse him, but they also played with him, playing hide and seek, hopping, sharing toys with him, and giving him lots of things to eat.<br/><br/>He wanted to stay here and never wanted to go back to that old home.<br/><br/>He’s very happy here, very joyful!<br/><br/>Shi Dajiang was happy to see his grandson stay here because he knew his grandson was even happier here, so there was no need or desire to take him back to the village.<br/><br/>Xiao Jinli laughed and said, “As long as you are happy. Remember tonight to come to my house with grandpa for a New Year’s dinner!”<br/><br/>“Go to sister’s house for dinner?” Xiao Bao’s eyes lit up immediately, and he seemed very happy, “That’s great!”<br/><br/>After leaving the greenhouse, Gao Jianjun smiled and said, “Xiao Jinli, you’re really nice to them!”<br/><br/>Xiao Jinli laughed and said, “Both the grandson and grandfather are pitiful people, I’m just lending them a helping hand.”<br/><br/>“Haha, our Xiao Jinli is indeed a kind-hearted child,” Gao Jianjun laughed, “Kind-hearted people are always blessed.”<br/><br/>Then, the two went home.<br/><br/>After arriving home, everyone was still busy. Even for the noon meal, with so many people, they needed to cook more, let alone three or four tables for dinner.<br/><br/>Ji Yuzhu and her maternal grandmother had already cleaned all the vegetables. Xiao Junxuan was holding a kitchen knife, chopping chicken and duck meat, while Xiao’s father was cleaning the chicken and duck innards.<br/><br/>Some people didn’t like these innards, but Xiao Wanshan and his son did, so they never threw them away casually.<br/><br/>Maternal grandmother picked up another small kitchen knife, found a chopping board, and began cutting the vegetables.<br/><br/>In the kitchen, Xiao’s mother was steaming pork with preserved vegetables.<br/><br/>They had fried the pork belly yesterday, and today they started steaming it.<br/><br/>When frying pork belly, they first boiled it with cooking wine, ginger, green onions, star anise, and other spices. Once chopsticks could easily pierce the skin, they would fish it out.<br/><br/>After that, they would poke holes in it with a toothpick, drain the water, and then start frying.<br/><br/>When frying, they would put it in the wok when it was about half heated, cover it, turn the heat down, and continue frying. When the pork skin turned golden brown, they could turn off the heat and get it out of the pot.<br/><br/>The fried pork belly could be soaked in the soup used for cooking it, so it would be easier to slice later.<br/><br/>After slicing the pork belly, they would place it upside down in a bowl.<br/><br/>Then, they would start preparing the preserved vegetables.<br/><br/>Some people would put the preserved vegetables in the wok with chili, soy sauce, salt, and sugar, stir-fry it briefly, then put it in a bowl and cover the meat directly.<br/><br/>After that, they would put it in the pot to steam.<br/><br/>This dish must be steamed until the meat is tender, melts in your mouth, and not greasy, with the flavors of preserved vegetables infused into it. The taste of this dish is simply unparalleled.<br/><br/>Yesterday, Xiao’s mother had fried twelve pieces of pork belly, but today she would steam only six bowls.<br/><br/>In the countryside, every household would build a stove with a large pot for steaming dishes. While steaming the pork, Xiao’s mother also washed some sweet potatoes and put them in the pot.<br/><br/>Steamed sweet potatoes were also delicious, fragrant, sweet, and soft. Everyone in the family loved them.<br/><br/>When the pork started steaming in the pot, Xiao’s mother began preparing the pig’s feet.<br/><br/>The pig’s feet needed to be blanched first. While blanching, she added cooking wine, and ginger and green onions, using her home-brewed rice wine. After blanching, the pig’s feet were set aside to drain the water, waiting to be cooked.<br/><br/>Gao Yanxin walked into the kitchen and asked, “Auntie, what dishes are you cooking for lunch today?”<br/><br/>Glancing at the items in the kitchen, he swallowed and said, “I miss your cooking so much. You have no idea how terrible my mom’s cooking is. Sometimes I wonder if you and my mom are really sisters? The difference in your cooking skills is too great.”<br/><br/>Just as Ji Yuzhu entered the kitchen, she heard his words and shouted angrily, “Gao Yanxin, I think you’re itching for a beating, aren’t you? Badmouthing your own mother behind her back!”\t\t\t\t\t\t</div>", "images": {}, "success": true}