{"id": 169, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298224.html", "title": "Chapter 169 - Chapter 169: Chapter 169: Making Green Cake On The First Day Of New Year 2 (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 169 - Chapter 169: Chapter 169: Making Green Cake On The First Day Of New Year 2 (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 169: Chapter 169: Making Green Cake on the First Day of New Year 2 (First Update)<br/><br/>Translator: 549690339<br/><br/>The baba mixed in the pot is placed directly into a large basin, and the inside of  the basin is smeared with oil. Otherwise, it would stick and be difficult to clean.<br/><br/>Xiao Jinli and her two sisters-in-law washed their hands, applied oil, and then took out the baba molds, ready to start wrapping the dads.<br/><br/>Grandma Xiao first took out a small piece and placed it on a clean table, which had also been smeared with oil, then began to knead the dough into a round strip shape.<br/><br/>After shaping it into a round strip, she took a small piece, kneaded it into a round shape, placed the round-shaped baba onto the mold, and pressed it into a dumpling-skin shape, but larger and thicker than a dumpling.<br/><br/>This is the green skin.<br/><br/>Then, like wrapping dumplings, she placed the filling in the green skin, pinched the edges of the skin together, and made sure the filling did not leak. The green cake was now wrapped.<br/><br/>Making green cakes was an activity everyone had done many times, and they were very familiar with it. In just a little while, they had wrapped a whole steamer full and then rolled some small strips without filling, placing them in the steaming basket.<br/><br/>Many children liked to eat these long strips.<br/><br/>“Haha, it’s so fast when there are many people. One steamer is already wrapped, now let’s steam it.” Grandma Xiao immediately carried a steamer of green cakes and placed them in the large pot to steam.<br/><br/>Steaming over boiling water, the optimal time is fifteen minutes.<br/><br/>Little Aunt was still in charge of the fire.<br/><br/>Xiao Jinli looked at her two sisters-in-law who were wrapping the baba and asked, “Sister-in-law, when do you go back to work after the Chinese New<br/><br/>Year?”<br/><br/>Of Xiao Jinli’s three cousins, two had already graduated from university and started working, while the youngest was in senior high school, and the first half of this year was a sprint stage, with a very tight curriculum.<br/><br/>The cousins and their sisters-in-law were college students who worked as white-collar workers in foreign companies. They earned several thousand yuan per month.<br/><br/>Eldest Sister-in-law frowned slightly and shook her head, saying, “The company starts work on the eighth day of the first lunar month. However, your eldest cousin wants to stay at home.”<br/><br/>“Stay at home?” Xiao Jinli was surprised, “Why?”<br/><br/>Eldest Sister-in-law said, “Didn’t the village establish a company? Your dad said about hiring a professional manager to manage the company. And your eldest cousin wants to stay home. After all, this company affects the whole village’s livelihood, and it’s always a little uneasy to hire an outsider.”<br/><br/>“Ah, the eldest sister-in-law, what do you think?” Xiao Jinli asked.<br/><br/>Eldest Sister-in-law hesitated and said, “I’m a little conflicted and contradictory in my heart. We want to stay, but…” Staying in the hometown company, they didn’t know what their salary would be like, but working in an outside company, the two of them could at least guarantee an income of fifty to sixty thousand a month.<br/><br/>But if they didn’t stay in the hometown company, they didn’t know what others’ opinions would be, and whether others would think they were too arrogant and looked down on the small company.<br/><br/>Xiao Jinli immediately understood Eldest Sister-in-law’s thoughts.<br/><br/>The matter of establishing a company in the village was her proposal. The whole process of establishing the company was handled by her father and brother.<br/><br/>This was probably what made Eldest Sister-in-law most uncomfortable.<br/><br/>At this moment, Second Sister-in-law also said, “Jinli, I heard that it was your idea to establish a company in the village. When your second cousin heard about it, he wanted to quit his job before the end of the year and work at home.”<br/><br/>But she stopped him.<br/><br/>For this matter, she even argued with her husband. After all, they were senior white-collar workers with good jobs and high salaries. Once they quit, it would be hard to find such a good job again.<br/><br/>But in her heart, she had some resentment towards Xiao Jinli.<br/><br/>The only reason her husband was so firm in his decision was that he loved Xiao Jinli very much and naturally supported her in everything.<br/><br/>So, he was willing to return home at all costs, just to help the company develop well.<br/><br/>“Huh?” Xiao Jinli looked at her Second Sister-in-law, and from her eyes, she saw some dissatisfaction and helplessness. She smiled wryly and said, “Second brother’s personality is very similar to little aunt’s. They are always impulsive in doing things, and once they make a decision, even eight horses can’t pull them back.”<br/><br/>Having said that, she looked at her Second Sister-in-law and said seriously, “Second sister-in-law, if you trust me, my second brother’s choice is definitely the right one.<br/><br/>Our Xiao Family Village’s vegetables and fruits will not only sell well in the domestic market but also possibly in foreign markets. Not to mention anything else, just look at the growth and taste of these vegetables. You and eldest sister-in-law have seen a lot of the world and been exposed to many things. Have you ever seen or tasted anything like this? If we were to sell our vegetables out in the open, what would happen?”<br/><br/>Eldest Sister-in-law and Second Sister-in-law, as new brides who had just married into the Xiao Family, had not been there for very long. Their feelings for Xiao Jinli and the Xiao Family Members were not as deep as those of other villagers.<br/><br/>However, since everyone in the Xiao Family loved Xiao Jinli, they followed their husband’s wishes and tried their best to love her too.<br/><br/>After all, Xiao Jinli was the only girl in the Xiao Family and the darling of everyone. As long as they didn’t want to be in conflict with their parents-in-law, they had to love Xiao Jinli, even if it was just for show.<br/><br/>But now, when it came to work, their parents-in-law supported their son’s decision without considering the opinions of their daughters-in-law. This made them very unhappy and dissatisfied.<br/><br/>How good was it to work in foreign companies outside? They earned several thousand yuan a month!<br/><br/>But staying at the hometown company, it was hard to say whether the company could even get off the ground. Moreover, the salary was not stated. Were they supposed to earn just a few thousand yuan a month?<br/><br/>These daughters-in-law who had just married into the family really couldn’t understand why the entire Xiao Village had so much respect and trust for a child of just a few years, even letting her decide on such a major issue as planting vegetables and establishing a company.<br/><br/>If they hadn’t married into the Xiao Family, they’d think the people of Xiao Family Village were all madmen, like the other brides.<br/><br/>After listening to Xiao Jinli’s questions, the two sisters-in-law fell into deep thought.<br/><br/>Even before returning to the village, they had heard from other people that Xiao Family vegetables had become famous in the town. Yes, they were now only famous in the town and selling like crazy.<br/><br/>Seeing this new situation, the entire Xiao Village started planting vegetables and fruits and establishing a company. Even though they’d seen a lot outside the village, they still found it incredible.<br/><br/>However, after returning to the village and actually experiencing the taste of the homegrown vegetables and fruits, they found the taste incredible and thought that planting vegetables and fruits in the whole village next year would work.<br/><br/>The problem they are facing now is that if they plant a small amount of vegetables and fruits, they can sell them in town and the county town. However, having several hundred mu of vegetables to sell is too much for a small town and a small county town to consume, so they have to find ways to sell them outside.<br/><br/>Since they need to sell the vegetables outside, they need to find a sales channel. This is not an easy task.<br/><br/>So, Xiao Jinli’s two cousins wanted to come back and help the company expand its sales channels. Once the Xiao Village’s vegetables become a well-known brand, they would have no worries about the market.<br/><br/>The two cousins had the courage and ambition to do this.<br/><br/>But the two sisters-in-law wanted to follow their husbands, but they couldn’t let go of their previous high-paying jobs, so they were very conflicted in their hearts..\t\t\t\t\t\t</div>", "images": {}, "success": true}