{"id": 163, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298200.html", "title": "Chapter 163 - Chapter 163: Chapter 163: The Bustle Of New Year 5 (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 163 - Chapter 163: Chapter 163: The Bustle Of New Year 5 (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 163: Chapter 163: The Bustle of New Year 5 (First Update)<br/><br/>Translator: 549690339<br/><br/>“Uncle, weren’t you supposed to get off work at around three or four o’clock? How come you’re back so early?” Xiao Jinli asked, “I thought you wouldn’t arrive until seven or eight o’clock.”<br/><br/>Her eldest uncle answered with a smile, “That’s true, but it’s New Year’s Eve, so everyone rushes back after finishing their work. After all, some people have a long way to go. Since we planned to come to your house for the New Year, we needed to come early.”<br/><br/>Her eldest uncle worked in a public position and was assigned to work in other places.<br/><br/>Second uncle was a professor at a prestigious university, so he was very busy too.<br/><br/>Third uncle had a business in another city; in short, all three uncles were leading a decent life.<br/><br/>In the past, maternal grandpa and grandma lived with their eldest son, but when they visited Xiao Family, they stayed with their youngest daughter.<br/><br/>Xiao Wanshan welcomed his brothers-in-law into the house, where the table had already been set.<br/><br/>“Brother, sister-in-law, let me tell you, the vegetables we’re eating tonight are all grown by Jinli. After you’ve tried them, I guarantee you won’t want to eat any meat,” Ji Yuzhu said with a smile, “Tonight, my sister has prepared five or six vegetarian dishes. I suggest that you eat meat dishes first, and then try the vegetarian ones. Otherwise, once you’ve tasted the vegetarian dishes, you’ll only want to eat them and won’t touch any meat.”<br/><br/>Eldest uncle laughed and asked, “Is it really that delicious? In that case, we must give it a try. And Jinli, being so young, already knows how to farm?”<br/><br/>Ji Yuzhu replied with a smile, “Not only does Jinli know how to farm, she also knows how to raise earthworms. She currently has several hundred thousand of them.”<br/><br/>“Wow, several hundred thousand earthworms? That many?” asked Second Uncle in surprise, “What are they for? Selling?”<br/><br/>Xiao Wanshan explained, “While they are sold, it’s mainly to the people in the village. There’s a company established in the village now, and the whole village will grow vegetables next year. These earthworms are sold to everyone for cultivating their vegetables.”<br/><br/>The three uncles were curious about this.<br/><br/>“Wanshan, what do you mean by that? Next year, your whole village will grow vegetables, and all the earthworms Jinli raised will be used for it? What’s the rationale behind this?” Third Uncle asked in confusion, “I’ve heard of using earthworms for feeding chickens and fishing, but I never heard that they can be used for growing vegetables.”<br/><br/>Ji Yuzhu replied excitedly, “Third Brother, you have no idea; the vegetables we’re eating later were grown by Jinli using earthworms. The taste of these vegetables is simply amazing – even better than those high-priced organic vegetables sold in big supermarkets. I can say that the so-called organic vegetables simply cannot compete with what Jinli has grown.”<br/><br/>Eldest Aunt said with a smile, “After listening to what my younger sister said,<br/><br/>I’m even more looking forward to the dishes at dinner later.”<br/><br/>After chatting and laughing for a while, they suddenly smelled a delicious aroma of stir-fried vegetables.<br/><br/>Ji Mingxing’s eyes lit up, and he wrinkled his nose before asking with a smile, “Aunt, what kind of dish are you making? It smells so good!”<br/><br/>Gao Yanxin immediately laughed, “It’s Stir-fried Baby Bok Choy, haha, smells good, doesn’t it? Second cousin, let’s go to the kitchen and help out!”<br/><br/>With that, he playfully winked at his second cousin.<br/><br/>Second cousin hurriedly carried Little Bo Han and followed Gao Yanxin into the kitchen.<br/><br/>The aroma of the dishes from the kitchen was just too tempting.<br/><br/>They always knew their aunt’s cooking skills were the best in the Ji family – no matter the ingredients, she could turn them into delicious dishes.<br/><br/>When they were younger and hadn’t moved to other cities yet, they would always stay at their aunt’s house during holidays, reluctant to leave, just for a chance to eat her meals and homemade snacks – those were all precious memories.<br/><br/>Upon entering the kitchen, Ji Kaijun held Little Bo Han in his arms, sniffed, and asked, “Aunt, what dish are you making? It smells so good!”<br/><br/>Little Bo Han wrinkled his little nose, his round and shiny eyes looking up, he said in a babyish voice, “Great Aunt, it smells so good.”<br/><br/>Xiao’s mother laughed and said, “If it smells so good, Little Han Han will have to eat two more bowls of rice later!”<br/><br/>“Okay, I will!” Little Bo Han nodded in agreement.<br/><br/>Then he looked around and asked his second cousin, “Uncle, put me down, I want to go find Jinli Auntie! Where is Jinli Auntie now?”<br/><br/>“Oh, you’re looking for Jinli Auntie, she might have gone to sort out the gifts.<br/><br/>Why don’t you go to her room and look for her?”<br/><br/>Not only did these relatives and friends bring gifts for Xiao Jinli, but also some people from Xiao Family Village who returned from work brought her many gifts.<br/><br/>As a result, her gifts filled the whole house.<br/><br/>She went to the room to sort out the gifts now, wanting to see if there was anything suitable for Little Bo Han to play with. “Okay, I’m going to find Jinli Auntie now.”<br/><br/>With that, he ran off with his little steps.<br/><br/>“Hehe, Little Bo Han is getting cuter and cuter!” Xiao Junxuan laughed and said.<br/><br/>With so many dishes to prepare tonight and as one of the two best cooks, Xiao Junxuan, of course, had to help in the kitchen.<br/><br/>Some of the dishes he made tasted almost the same as his mother’s, such as Braised Pork Feet, Beer Duck, etc. These dishes required effort in turning the wok, so he was the one to cook them.<br/><br/>Xiao Junxuan laughed and said, “The meat dishes are done, just have to prepare a few vegetarian dishes. Xiao Xin, bring the cooked dishes to the table first, so the uncles can have a drink first.”<br/><br/>Gao Yanxin nodded and said, “Okay, I’ll bring the dishes now.”<br/><br/>Second cousin Ji Kaijun also said, “I’ll help too.”<br/><br/>“The braised pork is still in the big pot, you two take it out using a plate first, be careful when flipping it, it’s hot, and don’t burn your hands,” Xiao’s mother instructed. “Also, the pork feet are in the pressure cooker, the beer duck is in the small pot, and the Radish Braised Beef Brisket is in the pot outside. All of these are very hot, be careful, and don’t burn yourself.”<br/><br/>“Okay, Auntie (Great Aunt)!” Gao Yanxin and Ji Kaijun replied at the same time.<br/><br/>Immediately, Gao Yanxin opened the cabinet where the plates were stored familiarly and took out more than a dozen plates from inside.<br/><br/>Afterward, he opened the lid of the large pot.<br/><br/>He took out a bowl by bowl of braised pork and placed it on a long wooden board on the side.<br/><br/>Ji Kaijun held a plate against the bowl, and with a flip of his hand, a beautiful plate of braised pork appeared before their eyes.<br/><br/>“What a beautiful plate of braised pork!” Ji Kaijun praised, “Great Auntie’s cooking skill is still so good!”<br/><br/>Gao Yanxin nodded and said, “My aunt’s cooking will only get better and better. Ah, every time I come to my aunt’s house, I don’t want to go home. As soon as I go back, I can’t eat cooking that rivals a five-star hotel, and I feel listless. Auntie, if you could give some of your cooking talent to my mom, it would be so great. Then, I wouldn’t have been eating my mom’s dark cuisine every day since I was a child. Fortunately, I grew up healthy.”<br/><br/>Showing a sympathetic look, Ji Kaijun said, “Yeah, even though they are siblings, my little aunt’s cooking is really, ah, it’s really tough for you,<br/><br/>Xin-Cousin. I think the worst cook in our Ji family should be my little aunt.”\t\t\t\t\t\t</div>", "images": {}, "success": true}