{"id": 168, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298220.html", "title": "Chapter 168 - Chapter 168: Chapter 168: Making Green Cake On The First Day Of New Year 1 (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 168 - Chapter 168: Chapter 168: Making Green Cake On The First Day Of New Year 1 (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 168: Chapter 168: Making Green Cake on the First Day of New Year 1 (Second Update)<br/><br/>Translator: 549690339<br/><br/>After the New Year’s Eve midnight celebration, all three of Xiao uncles took their families and left.<br/><br/>Ji Family Village and Xiao Family Village are not too far apart, it only takes about twenty minutes by car.<br/><br/>On the first day of the New Year in the countryside, it is customary to stay at home or just gather with the family.<br/><br/>There are many traditions for the first day of the New Year, firstly, the first meal of the morning, apart from being vegetarian, must be cooked by the men in the house, and then women are called to eat.<br/><br/>On the first day of the New Year, you can’t clean up, make a ruckus, or wash clothes and shoes, etc.<br/><br/>From childhood to adulthood, Xiao Jinli has always followed these New Year’s traditions.<br/><br/>The family gathers together to play cards. Sometimes, Xiao Father and Xiao Junxuan go out to play cards or Mahjong with others, or relatives come over to Xiao’s home to cook some special delicacies.<br/><br/>For instance, they cook the Green Cake, Xiao Mother is skilled at it, whatever she makes is delicious.<br/><br/>Hence, the women in the clan, on this day, would all come over, gather together and have Green Cake.<br/><br/>This year, the maternal aunt’s family of three stayed at Xiao’s house, while the maternal grandfather and grandmother followed their three sons back.<br/><br/>Their family holds an annual family gathering on the first day of the year, so they had to go back home, catch up with relatives and friends, have a chat and create a lively atmosphere.<br/><br/>After breakfast, Grandpa Xiao, Grandma Xiao, Xiao Family’s Eldest Uncle, and Xiao Family’s Youngest Uncle all came.<br/><br/>On Chinese New Year’s Eve, the three Xiao brothers were supposed to celebrate together, but with the arrival of Xiao Jinli’s three uncles and maternal aunt for the New Year’s celebration, the crowd was too large. It was lively but quite troublesome to have everyone crammed together.<br/><br/>Therefore, Grandpa Xiao suggested that the three families celebrate separately during New Year’s Eve and then gather together on the first day of the year.<br/><br/>“Grandpa, grandma, eldest uncle, aunt, little uncle, little aunt, you all are here!” Xiao Jinli greeted them with a smile when he saw them.<br/><br/>Grandma Xiao, looking at the adorable Xiao Jinli, squinted her eyes, took out a big red envelope, and said with a laugh, “My good baby, you’ve grown another year older. Here, this is the big red envelope from your Grandpa and Grandma.”<br/><br/>Xiao Jinli, took the big red envelope and said, “Thank you, Grandpa and<br/><br/>Grandma. I wish you both good health!”<br/><br/>“Haha… Our good baby really knows how to act appropriately!”<br/><br/>Xiao Jinli, looking at the crowd, asked, “Aunt, Little Aunt, where are my cousins?”<br/><br/>The aunt replied, “They all came home late from card playing last night and are still sleeping. Let’s not bother about them. Let’s get a move on. Today, we’re making Green Cake. What fillings do we need? Pickled cabbage? Dried radish?<br/><br/>Buckwheat? Or Eggplant?”<br/><br/>Xiao Jinli said, “With so many people in the house, we need all of these fillings.”<br/><br/>The aunt nodded and said, “Alright, then I will go check the kitchen first.”<br/><br/>Having said that, the aunt and little aunt went into the kitchen.<br/><br/>“Xiaofang, how much rice have you soaked?” The aunt asked.<br/><br/>Xiao’s mother replied, “Hmm, I’ve soaked two dans of rice. There are many people, so I’m making a little more.”<br/><br/>Every year, everyone knows she will make some snacks, so from time to time villagers drop by. The quantity may appear ample, but it is not sufficient with so many people around.<br/><br/>“It has already been made into a rice slurry and is about to be cooked.”<br/><br/>“Alright, leave it to me.” Having said that, the aunt took the spatula from Xiao’s mother’s hand and directly poured a bucket of rice slurry into the pot.<br/><br/>Because there is a lot of rice slurry, it must be divided into two pots for stirring and cooking.<br/><br/>The so-called Green Cake is made by mixing green vegetable leaves or chives with soaked rice and putting them into a blender. The resulting paste turns green in color.<br/><br/>Xiao’s mother used chives.<br/><br/>After all, most people like chives, plus her home-grown chives have a unique aroma making them the best ingredient for the wrapper<br/><br/>“It’s so fragrant!” Little Aunt wrinkled her nose, “The chives you used, second sister-in-law, are really fragrant.”<br/><br/>Xiao’s mother laughed and said, “I thought everyone loves chives. Using them as colorant is surely going to be very fragrant.”<br/><br/>Aunt, smelling it, laughingly said, “Yes, it’s very fragrant. It’s not even cooked yet, who knows how delicious it’ll be when it’s done.”<br/><br/>Little aunt in front of the stove, controlling the fire, in the beginning, you need a high flame but towards the end, a low flame is required, and constant stirring is necessary until the rice slurry is cooked. Then, keep stirring until it thickens, and finally, when it turns into clumps, it is ready to be taken off the stove.<br/><br/>Three sisters-in-law, one stirring the paste, one stoking the fire, and Xiao’s mother starting to fry the fillings.<br/><br/>The fillings, already cut, pickled cabbage is made by Xiao’s mother, dried radish also made by Xiao’s mother, buckwheat, and eggplant are freshly plucked from the field.<br/><br/>Because everyone eats spicy food, chilies were added during frying of pickled cabbage, dried radish, and buckwheat. Chilies were not added to the eggplant to cater to the taste buds of kids since many children do not eat spicy food.<br/><br/>“These fillings are so fragrant.” Little Aunt, enjoying the smell of the fillings, praised, “Second sister-in-law, your culinary skills, we’ll never be able to match. Watching you cook, the smallest effort makes anything delicious. If my eldest sister-in-law and I use the same methods, the resulting taste is still not up to the mark.”<br/><br/>The aunt completely agreed. “That’s true. Before Xiaofang got married. apart from her good looks, her cooking skills were already well-known. Haha, I remember when Second Uncle was courting Xiaofang, it wasn’t because of her looks but Xiaofang’s cooking skills that led to his persistence and finally persuaded Xiaofang to marry Second Uncle”<br/><br/>“….” Xiao’s mother, feeling a little embarrassed, said, “This is such old news.<br/><br/>Big sister-in-law, please stop teasing me.”<br/><br/>This old story is being told constantly by everyone.<br/><br/>“Haha, what’s there to be embarrassed about.” Eldest sister-in-law said jokingly, “In these ten miles and eight villages, who doesn’t know that our little rogue, in his quest for winning the beauty, persevered and ultimately succeeded. After he married you, Second Uncle changed his ways immediately, found a job, and started providing for the family. Many people envy you.”<br/><br/>Xiao’s mother didn’t deny that ever since she married Xiao Wanshan, she has been living in happiness.<br/><br/>This man is responsible, knows how to care for others, never let her suffer any grievance, apart from childbirth, never let her suffer any hard work.<br/><br/>The little aunt, who had heard of Xiao Wanshan’s mischievious behaviour before he got married, still asked curiously, “Second sister-in-law, I heard that the conditions of many men who coursed you were better than Second Brother. How did you choose Second Brother?”<br/><br/>Xiao’s mother replied with a bit of shyness, “Actually, I don’t know myself why I chose Wanshan at that time. I only felt that among all the men courting me, he was the most sincere. Most of those men were only interested because I was quite beautiful.”<br/><br/>She has never regretted marrying Xiao Wanshan.<br/><br/>The three sisters-in-law chatted while they worked, harmoniously.<br/><br/>At this moment, Grandma Xiao walked in and asked, “Is the cake done yet?”<br/><br/>Aunt took a bit from the pot with chopsticks and tasted it, then said, “It’s still a little raw, needs a little more stirring!”\t\t\t\t\t\t</div>", "images": {}, "success": true}