{"id": 179, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298264.html", "title": "Chapter 179 - Chapter 179: Chapter 179: Villagers’ Busy Work (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 179 - Chapter 179: Chapter 179: Villagers’ Busy Work (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 179: Chapter 179: Villagers’ Busy Work (First Update)<br/><br/>Translator: 549690339<br/><br/>“There are a total of 786 mu of land in the village, and the land invested in the company amounts to 660 mu,” Xiao Yucheng and other company leaders and the Village Committee reported to the villagers. “Of this, the land used for building chicken, duck, and goose farms is 12 mu each, the pond is 5 mu, and as for the pig farm, it is located on the rear mountain of the village, while the cattle farm is at the foot of Cow Heart Half Mountain…<br/><br/>“Through election voting, the entire village selected 12 young people to go to East Province to learn technology. Here are the names of these individuals: Xiao Guanghua, Xiao Chunliang…”<br/><br/>The villagers listened to Xiao Yucheng and others’ speeches, looking very excited.<br/><br/>For those who went to learn technology in East Province, the company reimbursed all their living and transportation expenses, which was equivalent to a free trip there.<br/><br/>Of course, the company would not reimburse any private purchases such as local specialties.<br/><br/>Even so, for the villagers, this was a great opportunity.<br/><br/>The meeting lasted over an hour, introducing the development progress of various projects within the company and also announcing job openings.<br/><br/>Positions such as cleaners, chefs, warehouse administrators, etc., were available, but each job had specific requirements.<br/><br/>As this was a company, everything would follow company regulations.<br/><br/>For the villagers, this was a great opportunity to work while still taking care of their families.<br/><br/>This village-wide company meeting not only reported on the progress of various projects but also announced the start of planting for the entire village.<br/><br/>Before the new year, the seedlings in Xiao Jinli’s five acres of greenhouses already started to grow, ready for transplanting when the time comes.<br/><br/>Of course, the land must be properly prepared before transplanting the seedlings. Each family’s land was allocated accordingly to the specific needs of different vegetables, such as moisture, dryness, or sufficient sunlight.<br/><br/>Now the company had purchased a large plow machine, which could till 50 to 70 mu of land in a day.<br/><br/>As the plow machine travelled and tilled the land, the villagers followed behind, gathering the soil into neat rows.<br/><br/>With the exception of elderly people and children who could not work, everyone who could work was out in the fields with hoes and iron shovels. Many hands make light work! Five to six+acres of land could be prepared in a day.<br/><br/>“These are cabbage and cabbage seedlings, be careful.”<br/><br/>“Oh, don’t let so many people come into the greenhouse, be careful not to step on these earthworms.”<br/><br/>While transplanting seedlings, people were very careful of the earthworms in the ditches, but with so many people working, it was inevitable that some earthworms would be trampled on.<br/><br/>To the villagers, earthworms were precious, and each one held significant value. Thus, seeing an earthworm being trampled on would make them feel distressed.<br/><br/>“We women will handle the seedlings. You men should wait outside for a while. You men are all rough and careless; don’t trample on the earthworms!” Chen Qiulan said to the men carrying the seedlings.<br/><br/>The men nodded and said, “Alright, we’ll wait outside for a while. You go and bring out the seedlings.”<br/><br/>These men were not as careful and meticulous as the women and might accidentally step on an earthworm.<br/><br/>Although they wouldn’t stomp them to death, it would still be distressing.<br/><br/>Chen Qiulan, Li Guixiang, and five or six other women began to carefully shovel out the seedlings one by one and place them in baskets.<br/><br/>“These seedlings have grown so strong.”<br/><br/>“Indeed. We’ve been farming for decades, but no child has ever done better than this.”<br/><br/>“I heard from Xiaofang that Jinli wants to study agriculture. I didn’t expect her to have such a high talent in this area. With just a casual effort, she’s already better than us.’<br/><br/>“That’s true. How come we’ve never discovered her talent before?”<br/><br/>“I hope that with more than 600 acres of land, we can sell all these vegetables and get a high price.”<br/><br/>“That’s not a problem,” Chen Qiulan confidently said. “You should know, our vegetables sold in Xuzhen are more expensive than those from ordinary households. No matter how much we have, it’s never enough. If we sell them in the city, they are sure to sell better. After all, people in the city have more money than us country folks. If even rural people are willing to spend money on this, then city dwellers will surely be even more willing. The people in the city are rich and more willing to buy good things.”<br/><br/>“That’s right. People who’ve tasted our village’s vegetables say they’re delicious. The children especially love them. So, even just for the children, people are willing to buy them. Just like here, when our village has no vegetables for sale, people would even steal some from our village.” Everyone found this amusing.<br/><br/>In this day and age, people still steal vegetables.<br/><br/>But it was indeed a fact.<br/><br/>As people continued working, they also chatted about the future.<br/><br/>Chen Qiulan added, “I heard from my husband that, with more than 600 acres of land, there are many varieties of vegetables to grow. After calculating, the quantity of each variety is not much. If we really want to sell, I’m afraid it will only be enough to supply the entire county.”<br/><br/>“Ah, really?” cried a woman in surprise. “The problem is, who will we sell all these vegetables to?”<br/><br/>“Wasn’t it mentioned in the meeting the day before? The company has already leased a large store in the county town. When the vegetables are ready, they will be sold directly in the store. However, if our company wants to grow bigger, we need to expand our sales channels and reach further places, such as big cities and even exports!”<br/><br/>“Ah, exports, selling to foreign countries! Just thinking about it excites me!” someone said with a beaming smile. “I really hope that one day our vegetables can be sold abroad.”<br/><br/>It wasn’t about how good it would be to sell overseas, but the sense of accomplishment it would bring.<br/><br/>“Our company’s plan is to grow bigger and stronger, and that includes selling our vegetables and fruits abroad.”<br/><br/>“In the eyes of our elders, we only care about our own small plots of land, but those young people have much broader perspectives.”<br/><br/>With the whole village working together, the vegetables that needed to be planted were all completed within a few days.<br/><br/>Now, they were waiting for the rice seeds to take root.<br/><br/>“Jinli, do these watermelon seedlings need grafting?” the Village Head asked as he looked at the robust watermelon seedlings.<br/><br/>In rural areas, people graft watermelon seedlings with gourd roots while they are still young because watermelon stems are thin and susceptible to wilting, while the gourd roots are thicker and easier to grow. Thus, grafting is a major task while cultivating watermelon seedlings.<br/><br/>However, the watermelon seedlings in the greenhouse were stronger than the ones without grafting, and those with experience in watermelon planting, like the Village Head, were uncertain whether grafting was necessary. Growing up in the countryside, Xiao Jinli knew about this.<br/><br/>However…<br/><br/>Xiao Jinli shook her head and said, “No need. These watermelon seedlings are strong and won’t wilt easily.”<br/><br/>The seeds had soaked in Lingquan water, and Xiao Jinli watered the growing seedlings with Lingquan water as well.<br/><br/>As long as they were not damaged by humans, these watermelon seedlings would grow robustly..\t\t\t\t\t\t</div>", "images": {}, "success": true}