{"id": 173, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298240.html", "title": "Chapter 173 - Chapter 173: Chapter 173: Xiao Yucheng And His Wife (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 173 - Chapter 173: Chapter 173: Xiao Yucheng And His Wife (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 173: Chapter 173: Xiao Yucheng and His Wife (First Update)<br/><br/>Translator: 549690339<br/><br/>Most of the young people who returned home for the New Year learned about the special vegetables from Xiao Family Village, as well as the scope and business philosophy of the newly established company.<br/><br/>Initially, the new daughters-in-law who opposed contributing land as shares gradually changed their minds.<br/><br/>According to last year’s calculations, the income of one mu of land could reach at least twenty to thirty-four thousand, not including additional income from raising chickens and ducks, for example.<br/><br/>However, the actual results of this plan would have to wait until March or April to be seen.<br/><br/>Since the establishment of the company was to follow the company’s plan, the earnings of the village would naturally be distributed in the form of dividends.<br/><br/>For example, if the profit from the vegetables in the first half of the year was 100,000, the company would distribute dividends based on each household’s share ratio. If their land accounted for 3% of the company’s shares, their dividend would be three thousand.<br/><br/>However, if they joined in the middle or later stages, their share ratio might be 2% or more, meaning they would receive significantly fewer dividends.<br/><br/>Thinking about this, the new daughters-in-law who were unwilling to contribute land as shares were feeling uneasy.<br/><br/>If the company really makes money in the future, those who join later will receive much less money.<br/><br/>Of course, it was still early days, and various crops had not yet been planted, so it was not certain that they would make money.<br/><br/>The vegetables now being grown were good, but they also needed to be sold and marketed well.<br/><br/>There was also some discord in the families of Eldest Uncle Xiao and Little Uncle Xiao before the eighth day of the first lunar month.<br/><br/>It was mainly because Jinli’s two cousins wanted to work in the family company, but their wives were unwilling to give up their high-paying jobs outside, leading to disagreements.<br/><br/>“I’ve made up my mind; I’ll stay and help the family company,” Xiao Yucheng said firmly to his wife, Zhou Yingxiu.<br/><br/>Zhou Yingxiu’s face darkened slightly. “The company in the village has just been established and hasn’t even started operating yet. How can you help? We’re making thirty to forty thousand a month at our current jobs. You’re just going to give that up? Do you have any idea how hard it is to find a good job these days? Do we still want to buy a house in the big city or not?”<br/><br/>Although the couple had been married for three or four years, they didn’t want to have children too soon because they were still in the career growth stage. So their plan was to struggle for a few more years, save some money, buy a house in a big city, and then have children.<br/><br/>Once their child was born, he or she would receive a good education in a big city.<br/><br/>As for whether or not to have children, the older family members were open-minded and followed the young people’s wishes.<br/><br/>Young people could decide when to have children.<br/><br/>When they were ready to have children, the older family members would either help take care of them or give them some financial assistance to take care of the children themselves.<br/><br/>Zhou Yingxiu felt very fortunate to have such open-minded parents-in-law.<br/><br/>Everything was going well according to their plan, and they even had savings of over a million.<br/><br/>Although having one million in savings was considered a lot in the countryside, they were working in a first-tier city where houses were very expensive.<br/><br/>Buying a three-bedroom house would require a down payment of at least a million, followed by monthly mortgage payments.<br/><br/>Yingxiu and her husband planned to work another year, buy a house, and then start preparing for a baby.<br/><br/>But they never expected that they would have a conflict over work today.<br/><br/>Yingxiu was very angry. “Yucheng, don’t you want to have children anymore? We’ve got our plan in place; work for another year, and then we can buy a house in Shenzhen and have children. What are you doing now? The company hasn’t even started operating yet, and even if it has, we don’t know if it will make a profit, and we don’t know how much your salary will be. Don’t you want to buy a house in Shenzhen? Don’t you want our future child to receive a good education?”<br/><br/>Zhou Yingxiu cried as she spoke, feeling particularly wronged.<br/><br/>She did all this for the future of their family, but nobody supported her.<br/><br/>After listening to her, Xiao Yucheng was silent for a moment before saying, “Yingxiu, the village company has just been established, and it is in need of people. I want to do my part to contribute to the development of the company. The future development of this company is related to the wealth of the whole village.”<br/><br/>“So, you’re giving up your high-paying job and our future?” Yingxiu cried with a sense of grievance.<br/><br/>At this point, Uncle Xiao Wanshui spoke seriously, “Daughter-in-law, do you really underestimate our village’s company so much? Do you think the salary offered by the company will definitely be lower than what you are earning now?”<br/><br/>Yingxiu looked at her father-in-law’s serious and solemn face, and her expression stiffened instantly. She shook her head and said, “Dad, that’s not what I mean. I… I just want to buy a house in a big city so that our future child can receive a good education.”<br/><br/>“If you really want to buy a house in a big city, how much more do you need? Will five hundred thousand be enough? You can use my pension savings to buy a house first, and we’ll talk about the child’s situation after they’re born.”<br/><br/>Xiao Wanshui spoke seriously, “However, since Yucheng wants to stay at home, I still hope you can support him. People in our Xiao Family Village always have a strong sense of solidarity, and no one will refuse when there’s a need in the village.”<br/><br/>Upon hearing this, Xiao Yucheng disagreed. “Dad, if we want to buy a house, we have our own money. We don’t need your and mom’s money. That’s your pension money. We’re young, and we shouldn’t be using it!”<br/><br/>Listening to her father-in-law’s words, Zhou Yingxiu realized that Xiao Yucheng was determined to stay in the village, and there was no room for negotiation.<br/><br/>He was apparently just humoring her by listening to her protests.<br/><br/>However, Yingxiu still felt very wronged. They had planned everything for the future, and now…<br/><br/>Aunt sighed softly and said, “Yingxiu, your mother-in-law knows that it’s not easy for young people to find a job, especially a good job with high pay. But sometimes, you have to let go when it’s time to let go, and maybe there will be even bigger surprises waiting for you.”<br/><br/>Zhou Yingxiu was speechless. What could she say when the whole family was supporting Xiao Yucheng and even the elderly couple offered up their savings?<br/><br/>Zhou Yingxiu wiped her tears and reluctantly said, “Alright, if he stays at home, then I will stay at home too.”<br/><br/>Xiao Yucheng immediately took her hand and said, “Wife, thank you!”<br/><br/>Zhou Yingxiu replied with a smile, “We are husband and wife. Since you’ve made a decision, as your wife, all I can do is support you.”<br/><br/>Xiao Wanshui said, “Daughter-in-law, if you can stay, that would be even better. I’ll go tell your second uncle now that you’re both staying..”\t\t\t\t\t\t</div>", "images": {}, "success": true}