{"id": 170, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298228.html", "title": "Chapter 170 - Chapter 170: Chapter 170: The Dissatisfaction Of The Two Sisters-In-Law (Double Updated)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 170 - Chapter 170: Chapter 170: The Dissatisfaction Of The Two Sisters-In-Law (Double Updated)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 170: Chapter 170: The Dissatisfaction of the Two Sisters-in-law (Double Updated)<br/><br/>Translator: 549690339<br/><br/>After pondering for a moment, Eldest Sister-in-law said, “According to the growth and taste of the vegetables in Xiao Family Village, once they are really planted, there will be no need to worry about sales as long as we promote them quickly. The problem now is that the whole Xiao Family Village has not yet fully started planting vegetables. We need to wait until after the spring to plant them.”<br/><br/>And, most crops, from planting to harvest, take at least one hundred days. One hundred days, three to four months, where can we go in the meantime?<br/><br/>Isn’t it too early to start opening up sales channels before we even have finished products? Jinli, I talked to your older brother about going back to the company and working for another half a year. Then we would come back to the village company after half a year. But your older brother won’t listen to me. Jinli, why don’t you talk to your older brother? The family has always listened to you more.”<br/><br/>In the end, Eldest Sister-in-law is not very willing to stay at home.<br/><br/>To avoid conflict between the couple, Xiao Jinli had to nod her head and say,<br/><br/>“Okay, I will talk to Big Brother about it!”<br/><br/>Second Sister-in-law immediately said, “Jinli, you should also talk to your Second Brother. Actually, my thoughts are similar to Eldest Sister-in-law’s. We can continue working outside for another half a year, and then return here after half a year.”<br/><br/>Half a year’s salary would be three to four hundred thousand.<br/><br/>“Okay!” Xiao Jinli agreed.<br/><br/>But after a while, she said again, “Eldest Sister-in-law, Second Sister-in-law, actually, there is no need to wait for the harvest season in four to five months to open up sales channels. Now, in the entire Xiao Family Village, basically every family has planted some vegetables and has finished products. As long as we take these finished products to find merchants and customers, sign orders in advance, the company will quickly start operating! So, I think you are overthinking.”<br/><br/>Eldest Sister-in-law and Second Sister-in-law, ‘ …<br/><br/>After marrying into the Xiao Family, they have doubted countless times whether Xiao Jinli is really just a child of a few years old.<br/><br/>Why is she so smart and clever, with such clear thinking and strategy, and that’s why she is so trusted and respected by the people of Xiao Family Village?<br/><br/>Xiao Jinli obviously doesn’t want to affect the couple’s relationship between the two sister-in-laws.<br/><br/>But both sister-in-laws, in their words, do not seem to be optimistic about the company in the village and do not want to return to work in the village. They are unable to convince their husbands and want this little aunt to play the bad guy.<br/><br/>In fact, both sister-in-laws’ feelings towards Xiao Jinli are not deep, and some love is only superficial. What makes them unhappy is that their husbands love this cousin more than their own sister.<br/><br/>Every time they go back to the village to buy gifts, their husbands remind them to buy gifts for this cousin, but they don’t say to buy them for their own sisters as well.<br/><br/>On the other hand, Xiao Jinli’s feelings towards them are not deep either.<br/><br/>Several times, she noticed that the two sister-in-laws looked at her with dissatisfaction, but they just didn’t say it out loud. Xiao Jinli pretended not to see it.<br/><br/>Now asking her to play the bad guy, sorry, since she was little, she has only been a good person, a Lucky Star, and has never been a bad person.<br/><br/>Xiao Jinli smiled and said again, “Two sister-in-laws, I will have a good talk with both of my brothers, but whether they will listen to me or not remains hard to say. Actually, my suggestion is for you to have a good talk with your husbands and communicate with them. Don’t let this affect your relationship as husband and wife over it.”<br/><br/>Two sister-in-laws, “…” This child is so smooth, it’s not easy to trick her.<br/><br/>They had no choice but to nod their heads and say, “Alright, then we’ll leave it to you, Jinli.”<br/><br/>Grandma Xiao had been listening to the conversation and her gaze towards the two daughter-in-laws was somewhat strange.<br/><br/>She thought to herself, “It seems that these two daughter-in-laws seem to have some dissatisfaction and opinions about Good Baby. This won’t do. Good<br/><br/>Baby is the Lucky Star of the entire Xiao Family Village and the treasure of the<br/><br/>Xiao Family. She shouldn’t be mistreated.”<br/><br/>Grandma Xiao laughed and said, “Eldest daughter-in-law, Second daughter-in-law, Jinli is right. If there’s anything, it’s essential to communicate well between husband and wife!” Don’t blame others for no reason.<br/><br/>The whole village’s planting and the establishment of the village company, although it was proposed by Xiao Jinli, was also supported by everyone.<br/><br/>So, if you have any opinions, just keep them in your heart.<br/><br/>After listening to Grandma’s words, the expressions on the two sister-in-law’s faces froze for a moment, then they nodded and said, “Yes, Grandma, we understand.”<br/><br/>As they were talking, Aunt’s second batch of Green Cakes was done frying, poured into another big basin, and brought out.<br/><br/>At the same time, Aunt brought out a basin of Guoba (Crispy Rice Crust) and asked, “This Guoba smells so good, you all must try it!”<br/><br/>Xiao Jinli really liked this Guobao, it was crispy and fragrant.<br/><br/>She picked up a piece, put it in her mouth, and made a crisp sound with a bite, then smiled and said, “This is so delicious, sister-in-laws, you should try it too!”<br/><br/>Eldest Sister-in-law liked this Green Cake Guoba, but Second Sister-in-law didn’t care for it, thinking it’s too heaty (In Traditional Chinese Medicine).<br/><br/>Eldest Sister-in-law also picked up a piece and started to eat it, her eyes lit up and she looked surprised, “This is so delicious. It seems to be even crispier and more fragrant than before. Sister, you should try it, it’s really delicious.”<br/><br/>Aunt laughed and said, “This year’s chives have a stronger flavor, so the Green Cakes made from them taste better, and naturally, the Guoba is also more delicious. Qingqing, have a taste, it’s really delicious.” Qingqing refers to Second Sister-in-law.<br/><br/>Lan Qingqing was tempted by the scent of the Guoba and picked up a piece to eat, “Mmm, it’s really delicious!”<br/><br/>Although the Guoba from previous years was delicious, it was not as good as this one.<br/><br/>Aunt holds the basin and laughs, “Come on, pick out the ones you love and take them. I’m going to take them into the house, let these men taste how crispy and delicious today’s Guoba is!” Aunt said, “In the past, they all loved it. This year, they will definitely love it even more.”<br/><br/>After hearing Aunt’s words, Xiao Jinli quickly took a few more pieces, and the two sister-in-laws each took two or three pieces before Aunt carried the Guoba inside.<br/><br/>After eating the Guoba, they continued to make Green Cakes.<br/><br/>Soon, another steamer was done, and they began rolling it into a bar shape.<br/><br/>Little Aunt came out of the kitchen and said to her daughter-in-law, “Yingxiu, Qingqing, call your husbands and tell them that the Green Cakes are ready and they can come eat.”<br/><br/>Zhou Yingxiu and Lan Qingqing nodded, and then made calls to their husbands.<br/><br/>After a while, Xiao’s mother brought out a steamed bun of Green Cakes and laughed, “It should be cooked, we can eat.”<br/><br/>“It smells so good!”<br/><br/>“Yes, it smells amazing.”<br/><br/>Maternal Aunt brought out the prepared Soy Sauce Chili and smiled, “Come on, those who like spicy food, the chili is here!”<br/><br/>For Soy Sauce Chili – it’s just chopped raw chili with added Soy Sauce and a little cooked oil. It’s a way to adjust the spiciness. It tastes salty and spicy.<br/><br/>Xiao’s mother poured the steamed Green Cakes onto a dustpan, emptied the steamer, and steamed the next pot.<br/><br/>Men who were sitting and chatting at the stone table walked over, picked up the bowls and chopsticks placed on the wooden board, grabbed the Green Cakes, poured some Soy Sauce Chili on them, and started eating.<br/><br/>“Delicious!”<br/><br/>“Really delicious!”\t\t\t\t\t\t</div>", "images": {}, "success": true}