{"id": 174, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298244.html", "title": "Chapter 174 - Chapter 174: Chapter 174: Quarrel 1 (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 174 - Chapter 174: Chapter 174: Quarrel 1 (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 174: Chapter 174: Quarrel 1 (Second Update)<br/><br/>Translator: 549690339<br/><br/>Second cousin Xiao Mingchen had a similar quarrel with his wife.<br/><br/>Lan Qingqing angrily yelled at Xiao Mingchen, “Xiao Mingchen, you only care about your cousin Xiao Jinli. Just because this company was started by your cousin, you want to stay and work here, are you out of your mind? Leaving behind a high-paying job outside to work in a newly-established company at home?”<br/><br/>The family’s faces darkened as they heard Lan Qingqing bring Xiao Jinli into the matter.<br/><br/>Xiao Mingchen coldly said, “Don’t drag my cousin into this. It’s my own decision, and it has nothing to do with her. Moreover, since the company has just been established, it needs us even more.”<br/><br/>Lan Qingqing was so angry that her face turned pale red, she pointed at Xiao Mingchen and said, “Fine, I’ll give you two choices. Either go back to work with me, or stay at the home’s company, and we’ll get a divorce.”<br/><br/>Xiao Wantian and his wife were startled by Lan Qingqing’s words.<br/><br/>Little Aunt tried to mediate, “Qingqing, let’s discuss things calmly, there’s no need to escalate it to divorce, right?”<br/><br/>Xiao Wantian’s face darkened, and he said sternly, “Daughter-in-law, let’s discuss things calmly, and don’t mention divorce!”<br/><br/>But at this point, Lan Qingqing disregarded everyone and said, “Am I the one who doesn’t want to discuss things? You don’t give me any choice. Our outside jobs were so good, with a salary of several thousand a month. But what about the company at home? How much can we make in a month? If we don’t have money, will our whole family go hungry? We’re also considering having children. If we have no money, how can we raise children?”<br/><br/>Xiao Mingchen said, “Money, money, money, is that all you see? Haven’t we saved some money from working these two years?”<br/><br/>“Is that little amount of money enough to buy a house?” Lan Qingqing said angrily, “Don’t you know how expensive the houses in Haicheng City are?”<br/><br/>“Do we have to buy our house in Haicheng City?” Xiao Mingchen also replied loudly, “Can’t we buy it somewhere else?”<br/><br/>Lan Qingqing was so angry that she stomped her feet and yelled, “We both work in Haicheng City, and if we don’t buy a house there, where should we buy? Should we buy it in some remote corner of a mountain village?”<br/><br/>“Now I don’t want to go to Haicheng City for work, is that not allowed?” Xiao Mingchen was also stubborn. Although he usually pampered and indulged his wife, he insisted on his decision now, “We’ll talk about the house later!”<br/><br/>Hearing her husband’s words, Lan Qingqing was extremely disappointed, and said coldly, “So, you still choose to divorce me, right?”<br/><br/>Little Aunt frowned and immediately persuaded, “Qingqing, it’s not that serious, why bring up divorce? You’re both acting impulsively now, just calm down.”<br/><br/>Then, she gave her son a stern glance and said, “Xiao Mingchen, watch your tone, and don’t lose your temper. You have such a fiery temper, who do you take after? Also, you and your wife should communicate better.”<br/><br/>Although the old couple supported their son’s decision to stay, they didn’t want the young couple to part.<br/><br/>Xiao Mingchen pursed his lips and remained silent for a moment. After a while, he turned around and left, saying, “I’m going to visit Second Uncle’s house.”<br/><br/>Lan Qingqing watched her husband’s departing figure, her face extremely terrible.<br/><br/>After their son left, Little Aunt said, “Qingging, once my Chenchen makes up his mind, even eight horses can’t pull him back. Please discuss things with him, don’t mention divorce. It will hurt your relationship.”<br/><br/>Hearing her mother-in-law’s words, Lan Qingqing immediately got angry and shouted, “Stop pretending to be kind in front of me. Xiao Mingchen always obeys you. If you didn’t agree with his decision, he definitely wouldn’t have said he wanted to stay. Do you think we’re making too much money outside and don’t like it? Why would you let us give up so much money to stay at home and make so little?”<br/><br/>Xiao Wantian and his wife’s faces turned sour upon hearing their daughter-in-law’s words.<br/><br/>They had thought their daughter-in-law was kind-hearted and sensible, but they never expected her to lash out at her in-laws over money matters.<br/><br/>Just as Xiao Wantian was about to scold her, Little Aunt immediately held back her husband and shook her head. Then, Little Aunt looked seriously at Lan Qingqing and said, “Daughter-in-law, don’t you feel guilty for saying that we’re being hypocritical? I believe I’ve treated you like my biological daughter ever since you married into our family.<br/><br/>You and my Chenchen had a love marriage. When we married you, your family demanded a higher betrothal gift than the local custom. Your local custom’s highest betrothal gift is 66,000, but your parents demanded 266,000, arguing that you had been sent to college and could earn money, but you were married far away and couldn’t help your family. Without a second thought, we gave all the betrothal gifts to your family. Apart from the three cotton quilts that they brought as dowry, they didn’t provide anything else. For your sake, we spent more money to buy you some dowry. As far as we’re concerned, as long as you and Chen’er live a harmonious life, we won’t care about money, betrothal gifts or dowry.”<br/><br/>Lan Qingqing’s face turned green as her mother-in-law spoke, and she opened her mouth to say something, but Little Aunt continued, “After you got married, you and Chen’er had a monthly income of more than twenty thousand. But you send at least ten thousand a month back to your maiden family.<br/><br/>Last year, you said your younger brother was getting married and your father asked you to pay for the betrothal gifts. You sent eighteen thousand back without discussing it with Chen’er. You could say that all the money you’ve earned since marrying into our family, you’ve sent back to your maiden family.<br/><br/>My Chenchen is the one who bears the daily expenses. If it weren’t for Chenchen knowing that you care so much about your maiden family that he doesn’t want to give you his salary card, I’m afraid you would send even his money back to your maiden family.<br/><br/>Daughter-in-law, have your father and I ever said a bad word about any of this? After marriage, you said you didn’t want children for a few years because of your career. Your father and I agreed, and we never complained.<br/><br/>Now, Chen’er just wants to stay at home, and you’re venting your anger on us. What’s the reason? Is it because you think the money you earn at home is too little, or because you think you’ll have less money to send back to your maiden family?”<br/><br/>Lan Qingqing’s face went from red to white, not knowing whether to be angry or ashamed.<br/><br/>She shouted, “Mother-in-law, what do you mean by this? Can’t a married daughter care about her maiden family, her parents? I send money to my parents because they’ve raised me and suffered a lot. Now that they’re old, can’t I give something back? And my younger brother’s wedding, can’t I, as his sister, help out a bit? I’m married far away and can’t take care of my parents personally, so am I not allowed to compensate them financially?”<br/><br/>Xiao Wantian and his wife,\t\t\t\t\t\t</div>", "images": {}, "success": true}