{"id": 175, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298248.html", "title": "Chapter 175 - Chapter 175: Chapter 175: Argument 2 (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 175 - Chapter 175: Chapter 175: Argument 2 (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 175: Chapter 175: Argument 2 (First Update)<br/><br/>Translator: 549690339<br/><br/>Lan Qingqing looked at her speechless parents-in-law, a blink of delight in her eyes.<br/><br/>She continued to speak, “My parents raised me to this age, and even helped me go to university, suffering and working hard. If I have the means to earn money, I should repay my parents for their nurturing. Otherwise, what kind of person am I really?<br/><br/>You guys are just plain hypocritical. If you do not want me to subsidize my family, why did you not talk about it upfront? Oh, now you’re looking into my accounts? What is the meaning of this? Are you trying to stop me from taking care of my parents?”<br/><br/>On an ordinary basis, Lan Qingqing does not have any major complaints about her parents-in-law. After all, they have been good to her and do not meddle in her affairs.<br/><br/>However, the words spoken by her mother-in-law today touched on her thorny issue. That’s right — her own family is her sensitive spot.<br/><br/>For her, her high-paying job and current lifestyle are all credits to her parents. Therefore, if she is capable, she must reward her parents well.<br/><br/>She believes that no amount of money can repay her parents’ kindness, so the least she can do is to continue supporting them economically, allowing them to relax and enjoy their twilight years.<br/><br/>But now, her mother-in-law is trying to track how much she gives to her family. This angers Lan Qingqing, making her upset with the in-laws, especially her husband.<br/><br/>Xiao Wantian and his wife, were taken aback and turned ghostly pale by their daughter-in-law’s words.<br/><br/>They could hardly believe that the seemingly good-natured Lan Qingqing could be so unreasonable and pompous, let alone disrespectful to her parents-in-law.<br/><br/>It’s not that they took an air of superiority as parents-in-law, they never did anything excessive to their daughter-in-law. What causes these grievances?<br/><br/>Seeing her parents-in-law speechless, Lan Qingqing’s face displayed even more arrogance and satisfaction.<br/><br/>She sneered and said, “Oh, I get it now. You kept my husband in the village, didn’t you? So that we can earn less, and I would send less for my parents. Quite a scheme you got there. I tell you though, I won’t let you get what you want.”<br/><br/>“Lan Qingqing, do you really talk to my parents this way?<br/><br/>A voice roared from behind Lan Qingqing.<br/><br/>Upon hearing the voice, Lan Qingqing shuddered, and a look of panic flashed across her face.<br/><br/>She turned around to see an angry Xiao Mingchen, and asked guiltily, “Hu… Husband? When did you come back?”<br/><br/>With fury in his eyes, Xiao Mingchen bit out, “If I didn’t come back, who would know that behind my back, you’d be so disrespectful to my parents? Lan Qingqing, what have my parents done to you to deserve this? I thought you were kind-heartened, gentle, dutiful, but you turned out to be so arrogant and rude behind our backs. What a two-faced person you are.”<br/><br/>Lan Qingqing immediately tried to explain, “Husband, it’s not like that, let me explain! I was just…” she added, “caught up in the heat of the moment.”<br/><br/>“No need for explanations!” Xiao Mingchen dejectedly cut her off, “You wanted to get divorced, right? Let’s do it! After the divorce, you can work wherever you want. You want to send money back to your family, then send it. You want to subsidize your family, then do it. I won’t interfere.”<br/><br/>Lan Qingqing’s face suddenly turned pale as she said incredulously, “You… you want a divorce? How can you say that?”<br/><br/>Xiao Mingchen said coldly, “Well, didn’t you bring up the divorce? I’m just granting your wish. ”<br/><br/>The divorce was just a threat from Lan Qingqing.<br/><br/>She wanted Xiao Mingchen to return to his previous job instead of idling his time in the remote mountains, where there’s no money to be made.<br/><br/>Without money, how could she continue to send ten thousand yuan each month to her parents?<br/><br/>Besides, ever since she started dating Xiao Mingchen in university and married into the Xiao family, she didn’t suffer the slightest grievance from the Xiao’s, not to mention Xiao Mingchen himself.<br/><br/>Therefore, she never intended to divorce him in the first place.<br/><br/>Upon hearing the mentioning of divorce, Little Aunt immediately scolded,<br/><br/>“Stop it! Do you think divorce is a trivial matter?”<br/><br/>But Xiao Mingchen shook his head, “Mom, I am unfilial for letting you and dad suffer undue grievances.”<br/><br/>His parents are such understanding and savvy people.<br/><br/>His wife has always favored her own family, and even has become the spoiled little brother. Yet his parents have constantly been comforting him behind the scenes, allowing him to be more understanding of his wife, after all, she was raised by her parents and they indeed have spent a lot on her. Furthermore, it’s fine for the elder sister to help out with the younger brother’s marriage expenses.<br/><br/>For the sake of the relationship, regarding his wife using the money on her family, he has turned a blind eye.<br/><br/>Over the past two years, they never blamed Lan Qingqing for the spending, nor uttered a single word of discontent.<br/><br/>But now in Lan Qingqing’s eyes, it turned out to be her parents-in-law acting like hypocrites.<br/><br/>How could Xiao Mingchen tolerate this.<br/><br/>Little Aunt, with red eyes, was still trying to persuade, “We’ve not been wronged at all. Normally, Qingqing treats us well. During holidays, she would also buy clothes and gifts for your dad and me. Right now, she’s just mad. Let’s stop talking about divorce.”<br/><br/>After what Little Aunt said, Lan Qingqing opened her mouth, seeming to want to say something. However, she couldn’t utter a word, a touch of guilt in her eyes.<br/><br/>What she had said was not merely out of anger, but a venting of her dissatisfaction with her parents-in-law.<br/><br/>It is just that her parents-in-law are magnanimous and didn’t care much about it.<br/><br/>She turned her gaze to Xiao Mingchen, hope gleaming in her eyes.<br/><br/>Yet, Xiao Mingchen still couldn’t accept Lan Qingqing’s double-faced attitude. He shook his head and said, “Dad, Mom, I still want the divorce.”<br/><br/>“Xiao Mingchen, what did I do to deserve this, that you want a divorce so easily?” Lan Qingqing shouted desperately at Xiao Mingchen. “I only said it because you refused to go back to your previous company for work. I was just furious, and said something regrettable. Why would you take it so seriously? You have such a small tolerance! I really misjudged you!”<br/><br/>Xiao Mingchen looked at her angry face, and a hint of scorn crossed his face. He retorted coldly, “I have a small tolerance? Huh! If I did, wouldn’t I have dumped you after your family asked for astronomic betrothal gifts? If I did, wouldn’t I argue with you over the huge amount of money you sent home every month? If I did, would I allow you to give all that money to your brother for betrothal gifts and buying a house?<br/><br/>Lan Qingqing, have you ever calculated how much money have you spent on this family since we got married? And how much on your family?<br/><br/>From betrothal gifts to monthly money and the money for your younger brother, you’ve spent almost one million in total. But what about on my parents? That’s the three thousand yuan I gave you each year for holidays and festivals to buy them gifts. And even then, you skimmed off two thousand, giving my parents gifts that are worth less than a thousand yuan..\t\t\t\t\t\t</div>", "images": {}, "success": true}