{"id": 177, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298256.html", "title": "Chapter 177 - Chapter 177: Chapter 177: Divorce (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 177 - Chapter 177: Chapter 177: Divorce (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 177: Chapter 177: Divorce (First Update)<br/><br/>“Huh, Second Brother and Second Sister-in-law are getting divorced?” Xiao Jinli was still somewhat surprised when she heard the news.<br/><br/>Because, in the eyes of outsiders, the marital relationship between her second cousin and his wife seemed quite good.<br/><br/>The two started dating from university, and after graduating, they both worked at the same company. They got married two years later, and now that it had been two years since their marriage, there had been no news of them arguing or anything like that.<br/><br/>“Why would they get divorced?” Xiao Jinli asked in confusion. “Just these past days, their relationship seemed fine!”<br/><br/>Although she had a Golden Finger, she wouldn’t pry into everyone’s personal affairs.<br/><br/>Grandma Xiao sighed softly and said, “It was all started by work issues. Your<br/><br/>Second Brother wanted to stay working at the company in the village, and your Second Sister-in-law firmly opposed it. They’d been arguing over it these days. Unexpectedly, today Lan Qingqing suddenly vented all her anger saved for your Second Brother on your Little Uncle and Little Aunt, and Xiao Er heard it and got really angry.”<br/><br/>Xiao Jinli asked with incomprehension, “But that wouldn’t be enough to cause a divorce, would it?”<br/><br/>Grandma Xiao continued, “Such a thing, of course, wouldn’t be enough for a divorce. Your Little Uncle and Little Aunt really treated Lan Qingqing like their own daughter. As long as she was at home, she didn’t have to lift a finger, and all her meals were prepared according to her tastes; your Little Aunt even did her laundry for her.<br/><br/>Even if the couple had differing opinions on their work situation, Lan Qingqing acted all aggressive towards her in-laws, and your Little Uncle and Little Aunt wouldn’t make a big deal of it. However, Lan Qingqing had crossed the line. If it weren’t for your Second Brother speaking up, I wouldn’t have known that she was…sigh…<br/><br/>“…” Xiao Jinli was really curious, and she asked, “Grandma, how did Second<br/><br/>Sister-in-law cross the line?” In order for her usually mild-mannered Little Uncle and Little Aunt to not try to stop them from divorcing, it must be that Second Sister-in-law had done something too much.<br/><br/>However, just like Grandma Xiao said, they really didn’t know what Second Sister-in-law had done before Second Brother revealed it.<br/><br/>Grandma Xiao said, “Well, Lan Qingqing is really filial to her parents. It would have been understandable had she only done that before their wedding, but after Second Sister-in-law married your Second Brother, she sent every single penny she earned to her family in the countryside. She remitted ten thousand yuan of living expenses per month and, without discussing it with your Second Brother, transferred 180,000 for her younger brother’s betrothal gifts and 100,000 as a house deposit.”<br/><br/>Xiao Jinli, ” …” Was this the legendary spoiled little brother?”<br/><br/>“If it were just that, your Little Uncle and Aunt wouldn’t be too upset, but<br/><br/>what’s too much is that every holiday and New Year, the money Second Sister-in-law gives to your Little Uncle and Aunt for clothes and gifts is still given by your Second Brother. He said that every time he gives three thousand, she would keep two thousand and buy only one thousand yuan’s worth of things. ”<br/><br/>Grandma Xiao said discontentedly, “What she’s doing is really too much. She has a job and money, not asking her to spend her own money on gifts for her parents-in-law, but even the money her husband gave her she’d pocket. This simply isn’t justifiable, no matter where you look.”<br/><br/>Xiao Jinli agreed with these words.<br/><br/>She also didn’t expect that Second Sister-in-law, who usually appeared gentle and demure, would turn out to be such a person of two faces.<br/><br/>“This time, your Second Brother insisted on staying home to work, and your Second Sister-in-law vented her anger on your Little Uncle and Aunt, which was heard by Second Brother, so they decided to get a divorce because of the old grievances and new accounts.” Grandma Xiao said, a hint of anger flashing in her face. She continued, “When Second Brother wanted to divorce her, she refused. But later when she agreed, she demanded all of Second Brother’s savings.”<br/><br/>Xiao Jinli, ‘   So, Second Brother ended up penniless?<br/><br/>“It’s a pity for your Little Uncle’s family.” Grandma Xiao felt sorry for her youngest son’s family. She said, “More than a million yuan, all gone just to marry a wife.”<br/><br/>Xiao Jinli, ‘          She really hadn’t expected that Second Sister-in-law would turn out to be so heartless and selfish.<br/><br/>No, Second Sister-in-law was affectionate and righteous to her parents and younger brother, but towards her husband’s family, she was truly heartless and selfish.<br/><br/>Xiao Jinli comforted, “Grandma, it’s just money. Consider it as paying for getting rid of a huge burden. In the future, Second Brother will definitely marry an even better wife. If they hadn’t divorced, who knows if that million would be enough to satisfy Second Sister-in-law in the future?”<br/><br/>Grandma Xiao nodded and said, “It indeed is just like that. With an uncaring daughter-in-law like that, even if she doesn’t completely empty her husband’s family of all their assets right now, she inevitably will in the end. It’s better to get rid of her sooner rather than later.”<br/><br/>At this point, Grandma Xiao said with a trace of uncertainty, “Weren’t Xiao Er and Lan Qingqing in a love relationship? Didn’t she show any bottomless kindness to her parents and younger brother during their love affair?” Xiao Jinli, “… l’ How was she, a girl who had never dated anyone, supposed to answer that?<br/><br/>Xiao Jinli said with a smile, “Grandma, it’s pointless to dwell on the past. Second Brother is so handsome and capable; I’m sure there will be plenty of girls fighting to marry him.”<br/><br/>“Haha…, that’s true.” Grandma Xiao laughed, “Even if our Xiao family members get divorced, they’re still tall, handsome, and capable. There are so many girls fighting to marry them.”<br/><br/>At this point, she paused for a moment, her eyes narrowed with a hint of gleaming light as she continued with a smile, “However, we must be careful of choosing the next time. This family can afford to lose once, but not twice.”<br/><br/>All one million of their family’s savings had been wiped out, but as a family with hands and feet and ability, Xiao Jinli believed they would soon earn it back.<br/><br/>Xiao Mingchen’s divorce was big news in Xiao Family Village.<br/><br/>As a result, no matter which corner of the village they were in, they could hear the villagers gossiping and discussing the matter.<br/><br/>“Tsk, tsk, I never thought Xiao Mingchen’s wife would be such a person. She only cares about her own family and doesn’t want to spend a penny on her husband’s family. Now that they’re divorcing, she’s even snatched all of Xiao Mingchen’s savings.”<br/><br/>“You tell me, what was the point of getting married? No children were born, and they even lost money.”<br/><br/>“They say that educated people are more sensible and understanding, but I think Lan Qingqing has become more calculating after reading so many books. She’s completely calculated and emptied her husband’s family.”<br/><br/>“Isn’t it? It’s said that the total amount is over a million. Over a million, for us in the countryside, would be enough to marry quite a few wives. She’s swindled all of it by herself. Xiao Wantian’s family too, she asked for all of it, didn’t they save some for themselves? Now, all the money’s gone; where will they get the betrothal gifts if Xiao Mingchen gets another girlfriend?”<br/><br/>“As for the money, Xiao Mingchen can solve that problem himself since he has the ability. It just feels like they’re being taken advantage of by having such a daughter-in-law. She’s practically a money-wasting genius.”<br/><br/>“Right, it’s just Xiao Wantian’s family had that much money for her to waste.<br/><br/>Unlike us, we don’t have much in savings, there’s nothing for her to waste..”\t\t\t\t\t\t</div>", "images": {}, "success": true}