{"id": 178, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298260.html", "title": "Chapter 178 - Chapter 178: Chapter 178: Company Deployment (2Nd Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 178 - Chapter 178: Chapter 178: Company Deployment (2Nd Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 178: Chapter 178: Company Deployment (2nd Update)<br/><br/>Translator: 549690339<br/><br/>After the news of Xiao Mingchen’s divorce had been discussed in the village for a while, everyone started getting busy.<br/><br/>Contrary to Xiao Jinli’s expectations, many young people chose to stay at home.<br/><br/>She thought that many young people would still choose to go out and work.<br/><br/>After all, working outside seemed to guarantee more money, while staying in the village to grow vegetables had uncertain earninzs.<br/><br/>The village company was named Xiao Family Village Lu Xian Ltd.<br/><br/>At the end of the year, Xiao Wanshan posted job advertisements online to recruit several senior professional managers.<br/><br/>Three college students from the Xiao family – Xiao Yucheng, Xiao Mingchen, and Xiao Junxuan, along with Xiao Yucheng’s wife Zhou Yingxiu, joined the company. Their education, qualifications, and work experience qualified them for managerial positions.<br/><br/>Now Xiao Yucheng was appointed general manager, with the responsibility of planning the company’s future development direction, Zhou Yingxiu as deputy general manager responsible for personnel, administration, and finance, Xiao Mingchen as executive deputy general manager and part-time marketing manager, and Xiao Junxuan as production and sales manager.<br/><br/>Well, the company seemed like a family business, with all the Xiao family members holding positions.<br/><br/>From an outsider’s perspective, it seemed like an apparent family control.<br/><br/>But there was really no other choice.<br/><br/>There were only a few college students in the village, all from the Xiao family, and they were capable of handling the positions.<br/><br/>For now, hiring them to manage the company was better than hiring unknown outsiders.<br/><br/>If one day the unknown outsiders decided to quit and leave a mess, it would be even more troublesome.<br/><br/>Although the company had just been established, Xiao Wanshan and his son had experience in managing companies, and Xiao Yucheng and others were elites in the workplace. Therefore, the company quickly entered the operational process.<br/><br/>Before the New Year, the company came up with a rough strategic plan.<br/><br/>In addition to managing the villagers’ vegetable planting, the company will also establish several large-scale breeding farms.<br/><br/>Chicken farm, duck farm, pig farm, fish farm, goose farm, and a cattle farm.<br/><br/>The cattle farm was proposed by Xiao Jinli.<br/><br/>Because with the vegetables fed by Xiao Family Village, the beef would definitely be popular among customers.<br/><br/>The locations for these farms had been decided, except for the cattle farm.<br/><br/>Xiao Jinli insisted that the cattle must be raised in a free-range system.<br/><br/>But a free-range system required a large area, otherwise, it wouldn’t be considered free-range at all.<br/><br/>Where would there be excess land in Xiao Family Village for raising cattle after allocating land for raising chickens and ducks and planting crops?<br/><br/>After multiple inspections and discussions by Xiao Yucheng, Xiao Jinli and others, the cattle farm location was finally determined to be at the foot of Niu Xinshan.<br/><br/>With multiple breeding farms established, they naturally needed to hire people for breeding and management.<br/><br/>Large-scale breeding is not as simple as raising a few animals at home, it requires professional skills.<br/><br/>After many discussions, the company and the village committee decided to send young people with aspirations to professional training institutions for skills learning and training.<br/><br/>Most of the villagers were surprised after hearing this.<br/><br/>“I’ve never heard that there is a specialized training institution for raising chickens and ducks.”<br/><br/>“Yeah, me neither. My eldest and second sons are both interested in this, I wonder if they can make the cut?”<br/><br/>The company would pay for the training, but with the majority of young people in the village interested, the competition for spots was intense. The company and the village committee had to evaluate from multiple aspects and choose the best and most suitable people through competition.<br/><br/>After the people who went to learn the skills returned, the company would also set up a study group to teach the villagers the basic breeding techniques.<br/><br/>The villagers marveled at the news.<br/><br/>“Haha, I never thought things could be like this after establishing a company.”<br/><br/>“Yes, even if we can’t participate in raising chickens and ducks, there will always be a turn for our family. Learning something always comes in handy.”<br/><br/>“I heard from the village head that the company plans to raise 12,000 chickens, 8,000 ducks, 5,000 geese, 30,000 fish, and 3,000 pigs. Only the cattle will start with 300 initially. It sounds like a big project.”<br/><br/>“Now, in addition to managing the planting of our own crops, the company will also ask us to work. There are short-term and long-term jobs. Short-term jobs are settled on a daily basis, while long-term jobs are for company employees and require a labor contract. The minimum wage is based on regional wage standards, and there are various benefits. Both short-term and long-term workers are prioritized from our village.”<br/><br/>When they said this, many villagers had hopeful expectations in their eyes.<br/><br/>Someone worried, “The company has just been established, and nothing has been planted in the fields yet; there is no profit at all. Every project and every step taken requires a large investment. Will the company still have money to continue like this?”<br/><br/>“Yeah, I heard that the company borrowed from the bank.”<br/><br/>“Everything is difficult at the beginning,” someone said optimistically. “If our village continues to work like this, we may earn more and more money.”<br/><br/>Not only would they receive dividends, but they would also have a salary. This was indeed double income.<br/><br/>There was more and more hope!<br/><br/>“Yeah, I used to think that setting up a company in the village was just for planting and selling vegetables. I didn’t expect that the company could also engage in other businesses,” someone said with a smile. “Like raising so many chickens and ducks, we never even thought about it before.”<br/><br/>“Xiao Yucheng said that this is for the principle of recycling. We grow vegetables and feed the animals with these old leaves. Their feces can not only be used as fertilizer but also feed, which can be used for feeding fish. And pig feces can also be used as feed for chickens and ducks. Anyway, I don’t understand it very well.”<br/><br/>“In the past, we only knew that these feces were used as fertilizers, but we never thought that they could be used as feed.”<br/><br/>“It’s true that educated people understand more. These things are well thought out. No wonder before the company was established, Xiao Wanshan and his son told us that they would hire professional managers to manage the company.”<br/><br/>Xiao Junxuan was temporarily busy with the company in the village, so he left the management of his company in the county town to Xiao Wanshan.<br/><br/>Xiao Wanshan and his son were planning to enter the real estate industry this year.<br/><br/>Every member of the Xiao family seemed very busy.<br/><br/>Including Xiao Jinli.<br/><br/>The New Year atmosphere had long since faded, and everyone soon started working in the fields.<br/><br/>Unlike in previous years, where they could plant whatever they wanted around Qingming Festival, this year, the land invested in the company had to be allocated according to the company’s planning.<br/><br/>What to plant in the fields and how to plant it must be done according to the company’s requirements.<br/><br/>In addition to vegetable and fruit planting, rice planting would not be left out either..\t\t\t\t\t\t</div>", "images": {}, "success": true}