{"id": 171, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298232.html", "title": "Chapter 171 - Chapter 171: Chapter 171: No Title (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 171 - Chapter 171: Chapter 171: No Title (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 171: Chapter 171: No Title (First Update)<br/><br/>Translator: 549690339<br/><br/>The hustle and bustle of the New Year lasted for several days. During these days, family visits were everywhere, and every corner was filled with laughter and conversation.<br/><br/>This lively atmosphere lasted until the eighth day of the first lunar month.<br/><br/>Many factories and companies chose to start work on auspicious days like the eighth or ninth day of the first lunar month. As a result, those who went out for work generally left their families on the sixth and seventh days of the first lunar month.<br/><br/>For Xiao Family Village, this New Year seemed a bit different.<br/><br/>Because this lively year was accompanied by disputes.<br/><br/>The reason, of course, was still related to the family’s land and vegetable cultivation.<br/><br/>Upon returning home, they were surprised by the taste of the vegetables grown in their own backyard.<br/><br/>“Mom, are these green vegetables grown by ourselves?”<br/><br/>“Yes, they are. How’s the taste?”<br/><br/>“Ah, it’s great. I’ve never tasted such delicious green vegetables in my entire life. Even the carrots that I hated the most tasted crispy, sweet, and juicy, like fruit, and I started to like them.’<br/><br/>“And this cabbage, how can it be so delicious!”<br/><br/>Upon hearing their son and daughter-in-law’s praises, the father-in-law and mother-in-law smiled, “Hehe, do these taste good? Now our vegetables are so popular in town that people fight over them, and the prices are much higher than others.”<br/><br/>“Also, we have to cook two or three dishes with our own vegetables for every meal at home, or the children won’t eat. Didn’t you notice that the children have grown taller and stronger in the past six months, and have become more energetic?<br/><br/>In the past, children would easily catch colds and coughs when the weather changed. However, last winter, they were all lively and jumping around without catching a cold. Our family is not the only one; no children in the entire village caught a cold.”<br/><br/>“Haha, is it true that not a single child in the whole village caught a cold?” “Of course, if you don’t believe it, just ask anyone else. During the whole winter, the children ate well, had strong bodies, and their immunity improved, so they naturally did not catch colds.”<br/><br/>The son and daughter-in-law exchanged a glance.<br/><br/>The father-in-law continued, “Son, daughter-in-law, after eating these vegetables, do you think our vegetables can be sold?”<br/><br/>The son replied excitedly, “Yes, definitely. If anyone tries our family’s vegetables, they will never forget the taste and will definitely come back for more.”<br/><br/>The father-in-law nodded, “Yes. You guys don’t know that in July and August, several families in our village were selling vegetables in the Open Market Town every day. Every day, people would stop us on the road to buy our vegetables. In the past, we had to guard our stall for an entire morning and noon and still couldn’t sell them all. But now, we can sell everything in less than half an hour, and the prices are good too. However, we didn’t sell for too long since everyone ran out of vegetables to sell and had to save some for our own children. Can you guess what happened?”<br/><br/>The son asked curiously, “What happened, Dad?”<br/><br/>“A lot of people came to steal vegetables! Haha…”<br/><br/>“Haha, stealing vegetables? Life isn’t like the past anymore, now that we live better, who would steal vegetables when they’re not worth much?”<br/><br/>“That’s right, these vegetables are not valuable. But many people still came here to steal them. Because of this, Jinli arranged for the village dogs to guard the vegetables. The village’s fourteen dogs took turns guarding in pairs, and they actually caught quite a few people trying to steal vegetables.”<br/><br/>The son and daughter-in-law, ‘<br/><br/>The daughter-in-law was amazed and asked, “Guard dogs? Are dogs really that obedient?”<br/><br/>The mother-in-law laughed and said, “You probably don’t know this. No matter whose dog it is, they may not listen to their owner, but they do listen to Xiao Jinli. Only Xiao Jinli can communicate with them. Because of these dogs, no outsiders can steal anything from the village.”<br/><br/>Speaking of which, the mother-in-law recalled another incident, “There’s another thing; the dogs played a significant role in it.”<br/><br/>The son and daughter-in-law curiously asked, “Mom, don’t keep us in suspense. Hurry up and tell us.”<br/><br/>The daughter-in-law was especially curious about this matter.<br/><br/>The mother-in-law said, “During the autumn harvest, didn’t Xiao Wanshan buy a combine harvester? This harvester not only harvested crops in our village but also went to other villages. It went to Li Village, and when Xiao Wanlin was about to return to our village after harvesting in Li Village, he was suddenly attacked. Later, it was discovered that the attacker was not only mentally ill, but he also killed his wife and children.”<br/><br/>The people who had gone out to work had also heard about this incident.<br/><br/>After all, this kind of murder case was not only big news in the ten miles and eight villages, but also in the whole town.<br/><br/>“Later, the parents of the mentally ill person blamed Xiao Jinli for their son’s arrest and the murder of his wife and children. So, in the middle of the night, with gasoline, they tried to burn down Xiao Wanshan’s house. However, the dogs discovered them before they even started pouring the gasoline,” the mother-in-law said, still feeling the lingering fear. “Fortunately, the dogs found them, otherwise, the consequences would be unimaginable.”<br/><br/>“Not only could Xiao Wanshan’s house have been burned down, but it’s also hard to say whether the people inside could have escaped.”<br/><br/>The daughter-in-law asked in surprise, “Why did the parents of the mentally ill person want to burn down Uncle Xiao’s house?”<br/><br/>The father-in-law said, “Initially, when Xiao Wanlin was beaten in Li Village, the village head and Xiao Jinli went there. Unexpectedly, Xiao Jinli discovered that the attacker might be mentally ill. It was also said that he used to beat his wife and children every day, but his wife and children hadn’t appeared in the village for over a month.<br/><br/>Xiao Jinli suspected that he had killed his wife and children, so he went to the mentally ill person’s house to have a look. Who would have thought that he really found something in the septic tank of the person’s backyard? It was horrendous; the bodies were cut into pieces, and apart from the head, they were mostly decomposed down to just bones.”<br/><br/>Upon hearing this, the son and daughter-in-law could not help but shudder, feeling chills down their spines.<br/><br/>Before, they had only seen such gruesome murder cases on TV, but now it was happening close by, making it even more terrifying.<br/><br/>“It’s too horrible, too terrifying.”<br/><br/>“Isn’t it? Some people who were at the scene at that time were so frightened that they vomited on the spot, and some had nightmares for several days. Even those of us who heard the story were very afraid, let alone those who saw it firsthand.’<br/><br/>“This mentally ill person is really terrifying.” From now on, they would definitely stay away from mentally ill people.<br/><br/>“That’s right. After the murderer was arrested, his parents went crazy too. In the middle of the night, they came to our village to set fire to houses. Luckily, they were discovered in time, and after they were reported to the police, they were caught.”<br/><br/>“Oh my, mental illness is indeed hereditary.”<br/><br/>“Isn’t it? Before, the mentally ill person used to beat his wife and children every two or three days, and everyone simply thought he had a bad temper. Who would have thought he was actually having a mental breakdown?”<br/><br/>“The dogs in the village are really smart,” the daughter-in-law admired. “Mom, do all the dogs in the village listen to Xiao Jinli?”<br/><br/>“Yes.”<br/><br/>The daughter-in-law asked again doubtfully, “Why do the dogs listen to Xiao<br/><br/>Jinli<br/><br/>The father-in-law laughed and said, “Xiao Jinli is a Lucky Star. Animals are very spiritual and surely like people who bring good luck.”<br/><br/>The daughter-in-law was speechless, ‘\t\t\t\t\t\t</div>", "images": {}, "success": true}