{"id": 172, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298236.html", "title": "Chapter 172 - Chapter 172: Chapter 172: Untitled (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 172 - Chapter 172: Chapter 172: Untitled (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 172: Chapter 172: Untitled (Second Update)<br/><br/>Translator: 549690339<br/><br/>At this moment, the parents-in-law looked at each other, and the father-in-law said with a smile, “Son, our village has already established a company at the end of the year. Our family has contributed half of our land as shares. When spring comes, we will plant vegetables on our 1.5 Mu of land along with everyone else. As for the other half, we plan to plant rice.”<br/><br/>At this point, the daughter-in-law hesitated and asked, “Mom, last year, we planted vegetables on Five Points of Land. How much money did we make?”<br/><br/>The mother-in-law thought for a moment and said, “Planting vegetables on Five Points of Land is not much at all, because we grow them for ourselves to eat, so we grow a wide variety of crops. We eat one kind today and another kind tomorrow, so there is not much left to sell. However, in the second half of the year, the price of our village’s vegetables rose, and although we didn’t sell much, we still made three to four thousand yuan.”<br/><br/>“What, Five Points of Land sold for three to four thousand yuan?” The daughter-in-law was slightly surprised, “So much?”<br/><br/>“Almost.” The mother-in-law said, “We estimate that the vegetables we sold only account for about one-fifth.”<br/><br/>“One-fifth sold for three to four thousand.” The son calculated, “If we sold them all, that would be more than ten thousand, right?”<br/><br/>“Yes. And, we feed these old leaves to our chickens and ducks. The eggs they lay don’t taste fishy at all, and the meat is even more tender. So, our village’s chickens, ducks, pigs, and eggs all sell at a higher price than others. For example, the chickens raised by this family sell for twenty-five yuan per jin, while other villages sell for twenty yuan per jin. Our village’s eggs cost eighty cents each, while other villages charge fifty cents each.”<br/><br/>“But if they’re so expensive, do people buy them?” The daughter-in-law asked in doubt.<br/><br/>“Of course, and it’s not enough to sell. Just like our village’s vegetables, they sell at high prices, and people still scramble to buy them. Nowadays, money is not a problem for people; as long as the quality is good, no matter how expensive, someone is willing to buy it.<br/><br/>Nowadays, many people in our village raise chickens and ducks, which is another source of income. In the second half of last year, our family raised thirty chickens and twenty ducks. Besides keeping some for ourselves and giving some to relatives and friends, we made three to four thousand yuan from selling eggs.”<br/><br/>As the mother-in-law was talking, she remembered something else, “However, besides each family raising some chickens, ducks, and pigs, the company also plans to establish large-scale chicken, duck, pig, cattle, and fish farms.<br/><br/>“Ah, so many?” The son and daughter-in-law were both surprised, “Who will raise them?”<br/><br/>The father-in-law gave his son and daughter-in-law a look as if to say they were idiots.<br/><br/>The father-in-law said, “Who will raise them? Like I said, the company will.”<br/><br/>“Ha, the company will raise them?” The son and daughter-in-law were confused, “The company just started, does it have money?”<br/><br/>The father-in-law said, “If the company doesn’t have money, don’t you know about loans?”<br/><br/>“Ah, loans?” The daughter-in-law asked incredulously, “How can this be done with loans?”<br/><br/>They really didn’t know that companies could take out loans.<br/><br/>The father-in-law explained, “It’s an agricultural loan. As for how to get the loan, we don’t know. Those things are handled by Xiao Wanshan and his son. We don’t really understand when they explain it to us!”<br/><br/>However, the daughter-in-law was still suspicious, “Dad, won’t they cheat people? They won’t just take out a loan and use it for themselves, right? Then everyone in our village will be in debt!”<br/><br/>“Don’t talk nonsense!” The father-in-law scolded gently, “Xiao Wanshan’s family is very wealthy. They don’t need to cheat the entire village.”<br/><br/>“Ha, their family is rich?” The daughter-in-law was puzzled.<br/><br/>“You may not know, but they have a clothing company in the county town, with assets reputedly worth at least five to six million, even up to ten million yuan,” the father-in-law explained.<br/><br/>Surprised to learn that there was a millionaire in the village, the daughter-in-law asked, “How come I’ve never heard of their wealth before? Also, since their family has a clothing company, why doesn’t anyone in the village work there instead of going to outside jobs? Do they not hire people from the village? They must really look down on the people in the village.”<br/><br/>The father-in-law explained, “Shut your mouth, what do you know? All the older generation in our village knows about Xiao Wanshan’s family and their company. At the beginning, Xiao Wanshan told us that his company would hire people, and people from our village could work there. However, we old folks believed that if the young people from our village all went to work in his company, it would definitely cause some trouble. We thought that the young people would be better off going out and making something of themselves.” Daughter-in-law, “…” What kind of reason is that?<br/><br/>She felt that the attitude of the people in Xiao Family Village towards Xiao Jinli’s family was simply unbelievable.<br/><br/>By her logic, if there was a company owner in the village and his company was in the county town, it would be better for the village’s young people to work for him. It would be close to home, allowing them to take care of their families.<br/><br/>Yet no one in the village is allowed to work in his company?<br/><br/>Actually, the older generation in the village thought more long-term.<br/><br/>How could they not want their young people to work close to home?<br/><br/>However, the root cause was that they didn’t want to have any entanglements with Xiao Wanshan over interests.<br/><br/>Young people working for an acquaintance’s company may become relaxed in their attitude, acting as they please. As the boss, it would be difficult to manage them, but also not good to ignore them. This would offend people.<br/><br/>Once they returned to the village, there might be endless gossip, making the relationship difficult.<br/><br/>So, no one from Xiao Family Village should go to work for them.<br/><br/>Well, in summary, the older generation pays more attention to feelings.<br/><br/>“No one from our village works in Xiao Wanshan’s company,” the father-in-law said, “but Xiao Wanshan’s family does everything they can to help the villagers. So, don’t accuse them of being stingy or not treating people well. ”<br/><br/>Daughter-in-law, “…” Had the old folks in Xiao Family Village been brainwashed by Xiao Wanshan’s family? It seemed that everyone put them first, always considered their interests and followed their advice.<br/><br/>Of course, she didn’t dare to say these words out loud, for fear of being scolded.<br/><br/>She asked again, “Dad, how many chickens, ducks, and pigs will the company raise?”<br/><br/>Father-in-law said, “At the end of the year, the village held a meeting. After the crops are planted and can be harvested, we will start raising them. Xiao Quan said that we should breed pure green food and create our village’s own specialty breeding base.”<br/><br/>“What does that mean? Who is Xiao Quan?” the son and daughter-in-law asked in confusion.<br/><br/>“It means that the food we feed our chickens and ducks must be free of any pesticides, purely green food. Only then will the chickens and ducks we raise have tender and delicious meat,” explained the father-in-law. “Xiao Quan, well, he’s a young man who was once saved by Xiao Jinli. I heard that the company’s establishment plan, management scope, management concept, and so on, all came from him.’<br/><br/>As he said this, he sighed softly, “That young man is really capable, but he was found by his family and went back home before the New Year.”<br/><br/>Son and daughter-in-law, ‘ .\t\t\t\t\t\t</div>", "images": {}, "success": true}