{"id": 176, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298252.html", "title": "Chapter 176 - Chapter 176: Chapter 176: Argument 3 (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 176 - Chapter 176: Chapter 176: Argument 3 (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 176: Chapter 176: Argument 3 (Second Update)<br/><br/>Translator: 549690339<br/><br/>Upon hearing their son’s words, the faces of Xiao Wanshan and his wife changed involuntarily.<br/><br/>Little Aunt had just mentioned that every New Year and holiday, their daughter-in-law would buy them clothes and gifts.<br/><br/>They hadn’t expected that all of this was actually their son’s face-saving gesture.<br/><br/>Their son gave her money, but would mostly hold back a significant amount.<br/><br/>“All the expenses of your life are paid with my salary, you haven’t spent a cent on my parents or me. I said nothing as long as they were happy. But now look at you! You’re wielding your filial piety towards your parents like a sharp knife stabbing my parents’ hearts.<br/><br/>So Lan Qingqing, are your parents the only parents? What about mine? Why should they, in their old age, pay for you fulfilling your duties to your own parents?”<br/><br/>Lan Qingqing, upon hearing this, turned pale and then flushed in disbelief.<br/><br/>She couldn’t believe that her beloved husband, whom she thought was genuinely tolerant and accommodating, would be so petty with her.<br/><br/>“So, if you want to fully respect and provide for your parents, then you should do it. As for me, I will stay at home and do the same for my parents. Lan<br/><br/>Qingqing, let’s divorce.” Xiao Mingchen proposed the divorce once again.<br/><br/>He was truly disappointed in Lan Qingqing.<br/><br/>He had no objection to her respecting and providing for her parents, helping her maiden family.<br/><br/>But, there had to be limits.<br/><br/>This act of using his family’s resources to fulfill her filial obligations, showing no filial piety to his parents in return, was unacceptable to him.<br/><br/>When Xiao Mingchen proposed divorce again, Little Aunt didn’t know how to dissuade him.<br/><br/>Earlier, she had pointed out that their daughter-in-law was usually respectful and filial towards them, buying them gifts and clothes. But their son then told them the money she spent was indeed given to her by him.<br/><br/>Taunted again by the word “divorce”, Lan Qingqing roared, “Xiao Mingchen, you need to understand this. We are a married couple, and within this relationship, who can separate your money from mine?<br/><br/>Isn’t yours also mine? Since your money is also mine, it’s me who’s showing filial respect to your parents. Besides, aren’t your parents also my parents? As a son-in-law, shouldn’t you respect my parents with me? Plus, in the two years since we got married, how many times have I visited my childhood home?<br/><br/>Since I, as a married daughter, can’t take care of my parents, and it all falls on my younger brother, can’t I provide them more financial support? So now if you’re still haggling over this with me, are you even human?”<br/><br/>Anyway, she wouldn’t admit she was wrong. Where was the error in her filial duties towards her parents or in supporting her brother? Why should Xiao Mingchen and his parents be so nitpicky about it?<br/><br/>Hearing her words, the disappointment in Xiao Mingchen’s eyes deepened.<br/><br/>He nodded without expression and said, “Hmm, right, it’s appropriate for you to respect and provide for your parents. Ignoring your own small family and neglecting my parents is also appropriate, I should be generous, and not so petty.”<br/><br/>Lan Qingqing,<br/><br/>“But, Lan Qingqing, now I’m precisely so petty.” Xiao Mingchen reversed the tone, “Since you don’t regard our small family as your home and don’t have my parents in your heart, why should I live with you? To others, it’ll appear as if I only married a wife as a bed warmer.”<br/><br/>Upon hearing this, Lan Qingqing’s face changed color instantly.<br/><br/>Her lips trembling, Lan Qingqing blurted out, “Xiao Mingchen, what you’re saying is too harsh, isn’t it? You’re too excessive, aren’t you?” “Isn’t what I say the truth?” Xiao Mingchen retorted calmy.<br/><br/>Lan Qingqing,<br/><br/>“Your parents are your parents, and you should respect them. Are not my parents, who raised me, actually my parents? Shouldn’t I respect and provide for them?” Xiao Mingchen shot back sharply, “So, from now on, we should each respect our own parents. Lan Qingqing, just because I want to stay home and work, you blame my parents and complain about them, I see your true nature now. Therefore, this marriage is over whether you like it or not!”<br/><br/>Heartbroken and enraged, Lan Qingqing shouted, “Fine, Xiao Mingchen, let’s divorce! But don’t regret it!”<br/><br/>“I won’t regret it! We don’t have children anyway, it would be much cleaner to split!” Xiao Mingchen retorted coldly.<br/><br/>Having said that, he went into the house to get their paperwork.<br/><br/>While Xiao Wantian and his wife did resent their daughter-in-law’s domineering and selfish behavior,they were not entirely dissatisfied.<br/><br/>Still, divorce was a serious matter, not something to be done hastily.<br/><br/>Little Aunt wanted to interject, but Xiao Wantian promptly pulled her aside and shook his head, “If their beliefs and values don’t align, forcing them to stay together will only lead to splitting up eventually. It is better to let them go now when they have no children.”<br/><br/>This daughter-in-law didn’t see the bigger picture.<br/><br/>In the past, when she was their daughter, it might have been overlooked, but after getting married and setting up her own small family, she still solely took care of her maiden family. All the money she earned was sent back to her childhood home without a single penny spared.<br/><br/>It’s not that they didn’t want her to respect and provide for her parents or help her maiden family, but there should be limits.<br/><br/>This boundless respect, provision and assistance were like an endless pit, the more she contributed, the more the pit demanded.<br/><br/>Now that the couple could earn money and they, the elderly couple, could also earn some money and had some savings, they didn’t mind.<br/><br/>But what would happen when they had children, or when they, the old couple, got sick or couldn’t work and needed more money? What then?<br/><br/>Though generous, they wanted to be selfish for their children.<br/><br/>After hearing her husband’s words, Little Aunt opened her mouth to speak, but said nothing.<br/><br/>Lan Qingqing expected her parents-in-law to persuade Xiao Mingchen, but saw only their cold faces, standing unmoved, and her anger surged again.<br/><br/>She sneered at them, “I am going to divorce your son, are you satisfied? Huh, seems that all the good treatment I received from you before, considering me as your own daughter was merely superficial. As I said, you’re mere hypocrites.”<br/><br/>Her words enraged Xiao Wantian and his wife.<br/><br/>In the past, their good treatment towards her, considering her their daughter, was like they fed the dog.<br/><br/>They really hadn’t seen how narrow-minded, selfish and unreasonable she was before.<br/><br/>Xiao Wantian, face livid with anger, said sharply, “Since you think we’re superficial, and hypocritical, then after your divorce with my son, you won’t have to face our superficiality and hypocrisy anymore.”<br/><br/>Lan Qingqing’s face turned pale and then white.<br/><br/>Xiao Mingchen took out their marriage certificate and said, “Let’s go, let’s divorce now. From now on, you won’t have to face my parents’ hypocrisy, you can completely face your parents who are sincere to you.”<br/><br/>At this moment, Lan Qingqing felt fear; she shook her head and said, “No, I won’t divorce! Xiao Mingchen, if you want a divorce, it is fine, but after being married to you for two years, you can’t make me leave without anything, can you?”<br/><br/>Xiao Mingchen stopped immediately, his cold eyes stared at her and asked, “We don’t have children, we don’t have properties, what do you want?”<br/><br/>Lan Qingqing said, “I want all your savings! Give me all your money and I will divorce you!”\t\t\t\t\t\t</div>", "images": {}, "success": true}