{"id": 184, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298284.html", "title": "Chapter 184 - Chapter 184: Chapter 184: Sending Some Vegetables (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 184 - Chapter 184: Chapter 184: Sending Some Vegetables (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 184: Chapter 184: Sending Some Vegetables (Second Update)<br/><br/>Translator: 549690339<br/><br/>“Elder sister, our child has been fussing and demanding to eat your village’s vegetables. Can you please see if any family here has some extra to sell to us?<br/><br/>Even if the price is higher, that’s fine.”<br/><br/>Li Guixiang found their words amusing and said, “It’s not that we don’t want to sell, it’s that we really don’t have any vegetables left. During the New Year, the young people who came back ate several plates every day, and when the New Year was over, they took a large bag of fresh vegetables to work and gave some away to relatives and friends. Now, there’s only a little left in the fields for the children, so we have to save it.”<br/><br/>Li Guixiang naturally knew how popular their vegetables were, and even at a high price, they were snapped up as soon as they arrived at the store.<br/><br/>If they could sell them and make some money, who wouldn’t want to sell their vegetables?<br/><br/>But the problem is, there’s none left to sell.<br/><br/>“Really? What should we do? Ever since your store closed, our child has been causing a ruckus. We thought that now that they’re in school, we should let them eat well, be energetic, and pay attention in class.”<br/><br/>“Elder sister, so many people in your village are growing vegetables. Are they all meant to be eaten by your own families only? Can you spare some to sell to us? We just want to improve our children’s meals.”<br/><br/>After listening, Li Guixiang thought for a while and said, “Alright, let me ask around to see if anyone has any vegetables for sale. I think it is unlikely, though. If anyone had any vegetables to sell, they would have sent them to the store long ago.”<br/><br/>“Well, please ask. Regardless of whether there are any or not, it’s still worth asking.”<br/><br/>Unable to do anything else, Li Guixiang led a group of seven or eight customers from the open market town to the village committee.<br/><br/>“Village Head, these people came to Xiao Family Village to buy vegetables,” Li Guixiang said, looking at the people behind her.<br/><br/>The Village Head glanced at the crowd and slightly frowned. “Here to buy vegetables? But we don’t have anyone with extra vegetables for sale.”<br/><br/>Li Guixiang helplessly said, “That’s what I told them, but they don’t believe me. They insist I ask others.”<br/><br/>The Village Head thought for a while and said, “Alright, let me make an announcement through the loudspeakers.”<br/><br/>The people in the village who were at home and working in the fields heard the announcement and their expressions turned strange as they began to discuss.<br/><br/>“People from the open market town are coming here to buy vegetables? Where can we find any to sell now? There are none left at my house. What about yours?”<br/><br/>“We don’t have any either. We ate most of them during the New Year, and the rest, we saved for our children. We don’t have any extra to sell.”<br/><br/>“It seems these people have come here in vain.”<br/><br/>“Well, there’s nothing we can do about it. The new vegetables haven’t grown yet, and the old ones will be gone once we pick them. Nobody wants to sell any.”<br/><br/>The Village Head and the group of customers waited at the village committee for a long time, but no one came.<br/><br/>“Ahem…” The Village Head said, looking at them. “It seems that no one has any vegetables to sell. I suggest you all go home.”<br/><br/>Someone unwillingly said, “But Village Head, we saw a large area of vegetables in your fields when we came. How could there be none to sell?”<br/><br/>They had come all the way here and didn’t buy anything. Wasn’t it a wasted trip?<br/><br/>Li Guixiang said, “That large area of vegetables belongs to the whole village, not just one family. Although it may seem like a lot, there are many households in our village, so it’s very limited.”<br/><br/>“What should we do then? We came here specifically to buy vegetables, but we didn’t get any. How can we explain this to our children at home?”<br/><br/>The Village Head and Li Guixiang,<br/><br/>The Village Head looked at them, thought briefly, and said, “You all wait here.<br/><br/>Let me ask one more time.”<br/><br/>Then he went out and directly to Xiao Jinli’s house.<br/><br/>Xiao Jinli was even busier now than before.<br/><br/>Apart from going to school to pass the time, the rest of her time was spent in her greenhouses.<br/><br/>“Xiaofang, is Jinli at home?” The Village Head arrived at Xiao’s house and asked Xiao’s mother.<br/><br/>Xiao’s mother said, “Xiao Bao is in the small greenhouse!”<br/><br/>The small greenhouse refers to the one on the original five points of land.<br/><br/>Now, Xiao Jinli had three greenhouses: one on the five points of land, one on the five acres of land, and another on the thirty acres of land.<br/><br/>These three greenhouses were all under Xiao Jinli’s management, so it was a private research base where no outsiders were allowed without permission.<br/><br/>The Village Head found Xiao Jinli, who was tending to the vegetables in the field.<br/><br/>Looking at these water-filled vegetables, the Village Head felt they were much better than anything grown by anyone else.<br/><br/>“Jinli!”<br/><br/>“Uncle Village Chief, what brings you here?” Xiao Jinli put down the small iron shovel in her hand and asked with a smile.<br/><br/>The Village Head said, “Seven or eight customers from the town have come to buy vegetables, but they haven’t found any and don’t want to leave. I came here to ask if you have any vegetables for sale.”<br/><br/>Xiao Jinli shook her head and said, “No, I don’t. I’ve planted these five points of land, but there aren’t many vegetables. After the New Year, I picked a large bag for each of my uncles and aunts when they went to work, so there’s not much left.’<br/><br/>The Village Head nodded. “Oh, that’s the case. Well, if there are no vegetables, it doesn’t matter. I’ll go back and send them away. No one has extra vegetables now.”<br/><br/>It’s hard to believe that one day, vegetables would be sold out and people would worry about it.<br/><br/>Xiao Jinli looked at the remaining vegetables in her field, smiled, and said, “My family doesn’t have extra vegetables to sell, but I can give some away. Uncle Village Chief, pick one Chinese cabbage or one cabbage for each person.” Upon hearing this, the Village Head smiled and nodded. “Alright, I’ll pick them.”<br/><br/>It was only a few cabbages, so he could carry them all by himself.<br/><br/>Xiao Jinli continued, “Uncle Village Chief, please make it clear to them later that these vegetables are not for sale. We’re only giving them away this time. If they want to buy some in the future, they’ll have to wait for the next crop in a month or two.”<br/><br/>The Village Head nodded. “Alright, of course, I will make it clear to them. Otherwise, they’ll come here every day for nothing and we’ll have to deal with them.”<br/><br/>While talking, the Village Head quickly picked four Chinese cabbages and four cabbages, all similar in size and weight.<br/><br/>The Village Head laughed heartily. “I really don’t know how you grow these vegetables. They all look the same, with no difference in size. Alright, I’ll be going now.”<br/><br/>After the Village Head left, Xiao Jinli looked at the empty pits in her field, her eyes shifted, blinked, and then another type of vegetable appeared in the pits:<br/><br/>lettuce.<br/><br/>Undoubtedly, these vegetables were transplanted from her space.<br/><br/>This place was Xiao Jinli’s private land, and no one knew what kind of vegetables or how many there were in the greenhouse except for Xiao Jinli herself.<br/><br/>Even Xiao’s mother didn’t know..\t\t\t\t\t\t</div>", "images": {}, "success": true}