{"id": 187, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298296.html", "title": "Chapter 187 - Chapter 187: Chapter 187: The Village Chief’S Wife Is Mighty! (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 187 - Chapter 187: Chapter 187: The Village Chief’S Wife Is Mighty! (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 187: Chapter 187: The Village Chief’s Wife is Mighty! (First Update)<br/><br/>Translator: 549690339<br/><br/>“Elder sisters, we really don’t have any vegetables for sale in our village, let alone giving them away to you!” The Village Head looked at the old ladies in front of him and said with great effort, “All the few vegetables we had left are now gone. We don’t have any spare to give to you!”<br/><br/>After hearing this, Granny Li played dumb, “I don’t care. We came here, and we won’t go back empty-handed.”<br/><br/>The Village Head and others, ‘ .<br/><br/>How could there be such shameless people?<br/><br/>They don’t even know them, so why should they give them anything?<br/><br/>They’re so infuriating.<br/><br/>However, these old ladies are all over sixty or seventy years old, and you can’t hit or scold them. You can only persuade them gently. Otherwise, if something happens to any of them, they would have to bear the consequences.<br/><br/>“Village Head, no matter how we persuade these old ladies, they just won’t leave. What should we do?” A villager whispered, “Should we really give them some vegetables?”<br/><br/>The Village Head glared at him and said unhappily, “No, we won’t! Believe it or not, if we give them some now, they’ll come every day for more. Even if we were familiar with them, we wouldn’t do that!”<br/><br/>“But if we don’t give them anything, they won’t leave! What should we do?” The villager said anxiously, “It’s getting dark. What if something happens to them on their way home? They wouldn’t blame us, would they?”<br/><br/>“What can we do? We can only compromise!” The Village Head said even more unhappily, “If we really can’t persuade them to leave, then we’ll have to give them some.”<br/><br/>“Village Head, you’re wrong about that. Our Xiao Family Village’s vegetables are famous in the town. Now that our village has no vegetables to sell, even money can’t buy them. These old ladies must be here because of our village’s reputation, trying to take advantage.”<br/><br/>The Village Head furrowed his brow, looked at the old ladies again, and tried to persuade them, “My old sisters, we really don’t have any free vegetables left in our village. Please hurry back before it gets dark. Otherwise, when it’s dark, the road will be hard to navigate.”<br/><br/>Granny Li sneered, “How come others get free vegetables, but when we old ladies come, there’s none for us? Who are you people looking down on? I’m telling you, we won’t leave today without getting vegetables. If we walk back after it gets dark and happen to fall on the way, we’ll put the blame on you.” Upon hearing these words, Chen Qiulan’s anger surged.<br/><br/>She burst out, “You people really shouldn’t go too far! If you choose to walk back in the dark and fall, what does that have to do with us? Are we the ones stopping you from leaving? Obviously, you just don’t want to go! I’ve seen greedy and opportunistic people before, but you really take the cake.”<br/><br/>Granny Li and her group were immediately dissatisfied, “You, woman, who are you calling greedy and shameless?”<br/><br/>Chen Qiulan didn’t hesitate and said loudly, “Whoever feels guilty, that’s who I’m talking about! Am I not telling the truth? We’ve said it countless times: we have no vegetables to sell or give away! And yet, you’re still here, acting shameless. Isn’t that just being greedy and taking advantage? Are you all so impoverished that your children can’t provide for you? If you really don’t have children to take care of you, fine, we’ll be generous and give you some old vegetables. How’s that?”<br/><br/>Chen Qiulan realized that reasoning with them was useless, and their thick skin had to be ripped off.<br/><br/>Those who followed Granny Li felt very angry when they heard Chen Qiulan’s words.<br/><br/>“No one takes care of you! I have three or four sons, and they are all very filial.”<br/><br/>“My children are also very filial!”<br/><br/>If it were true that their children didn’t care for them, their reputation would be tarnished, not only for themselves but also for their children. So, they became angry.<br/><br/>As Chen Qiulan listened to their words, she placed her hands on her hips and sneered, “Oh, so you all have filial children, huh? Since you all have such children, then what’s the meaning of sticking to us like glue?”<br/><br/>“Is it your children’s idea? If it is, that’s fine. Just tell us your names, and we’ll go door-to-door and deliver the vegetables while drumming and playing the trumpet. At the same time, we’ll also help you promote how filial your children are, how about that?”<br/><br/>The faces of these old ladies turned a dark shade of green, looking extremely unpleasant.<br/><br/>They pointed at Chen Qiulan as if they wanted to curse but couldn’t find the words.<br/><br/>Seeing them all unable to speak, Chen Qiulan continued, “Are you leaving or not? If you don’t leave, we’ll call the police and have the Yanmen officials find your children to take you back. After all, it’s getting dark, and it’s not easy for old ladies like you to move around. It’s safer to have your children pick you up.”<br/><br/>After saying that, Chen Qiulan turned to his younger son, Xiao Qing Shan, and said, “Xiaoshan, go and call the Yamen officials.”<br/><br/>Xiao Qingshan saw his mother in her moment of triumph and immediately replied, “Got it, I’m going now!”<br/><br/>When Granny Li saw Xiao Qingshan taking out his cellphone as if he was really going to call the police, she panicked and shouted, “Fine! We’re leaving!”<br/><br/>While Grousing, she said, “We only came for the reputation of Xiao Family<br/><br/>Village’s vegetables. Who would have thought that you would be so stingy and even haggle over a few vegetables? Let’s go, we’re leaving!”<br/><br/>The Village Head and others, ‘ .<br/><br/>That’s it?<br/><br/>They’d been trying to persuade these old ladies for a long time, but they remained unmoved.<br/><br/>Yet, with just a few words from Chen Qiulan, they were sent running.<br/><br/>Watching the backs of the old ladies as they retreated, the villagers gave Chen Qiulan a thumbs-up and teased her, “Ha ha, it’s no wonder you’re the Village Chief’s Wife. You’re really impressive! Just a few words, and you’ve scared these old ladies away.”<br/><br/>“Mom’s mighty!” Xiao Qingshan also happily shouted, “Ha ha, listening to my mother’s words, I was really afraid that these old ladies would have a stroke and fall. I didn’t expect them to run away instead.”<br/><br/>“Heh, we men have been speaking nicely to these old ladies for so long, yet they just wouldn’t listen. We were about to give in and try sending them some vegetables. Now we didn’t even think that the Village Chief’s Wife would show her authority and send them running.”<br/><br/>Chen Qiulan felt a little embarrassed hearing these words.<br/><br/>She laughed and said, “These shameless old ladies just won’t listen to you when you’re nice to them. They’ll get all excited and think that we have no choice but to give them what they want. However, when it comes to their children’s reputation, they get cautious. They may love taking advantage, but they can’t let that affect their children.<br/><br/>“You’re actually right. Why didn’t we think of that just now?”<br/><br/>“Ha ha, next time someone tries to take advantage, we’ll threaten them like this..”\t\t\t\t\t\t</div>", "images": {}, "success": true}