{"id": 180, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298268.html", "title": "Chapter 180 - Chapter 180: Chapter 180: Surrounding Villagers Watching The Excitement (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 180 - Chapter 180: Chapter 180: Surrounding Villagers Watching The Excitement (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 180: Chapter 180: Surrounding Villagers Watching the Excitement (Second Update)<br/><br/>Translator: 549690339<br/><br/>In the nearby villages, they heard that not only had Xiao Family Village planted vegetables throughout the whole village, but they also established a company. So, during the planting period, many people came to watch the excitement.<br/><br/>When they stood on the ridge, they saw acres of well-organized land in Xiao<br/><br/>Family Village, and everyone was working diligently.<br/><br/>Some people started discussing.<br/><br/>“I heard that each family’s land has become their share capital and is now part of the company. So, the land is no longer theirs but the company’s.”<br/><br/>“Ha, if it’s true, do they have money when working now?”<br/><br/>“I don’t know if they have money.”<br/><br/>“It seems that they don’t have money. However, I heard that their labor belongs to the company, so after these vegetables are sold, they will receive dividends.”<br/><br/>“How much money can be made by selling the vegetables from an acre of land? When it comes to dividends, who knows how much they can get? Now they don’t have their own land and have to buy everything. Isn’t this all money spent? So, who would want to do this work without pay right now?”<br/><br/>“Hehe, where are your eyes? Can’t you see everyone working in the field, and there’s even no one slacking off.”<br/><br/>“Now the vegetables from Xiao Family Village are famous throughout Taohua Town, and many people scramble to buy them at high prices. I don’t know what’s so tasty about the vegetables from their village that so many people buy them.”<br/><br/>Those who said this obviously hadn’t tasted Xiaojia Vegetables before.<br/><br/>“Hehe, from what you’re saying, it’s obvious you haven’t tasted the vegetables from Xiao Family Village. One of my relatives is from that village. At the end of the year, they brought some of the vegetables they planted to our house. Wow, you have no idea how delicious these vegetables are. They’re even better than meat, and my picky child at home didn’t want her favorite braised fish and kept eating the green vegetables.”<br/><br/>“A relative from Xiao Family Village also brought us some vegetables. Ah, they were really delicious. So delicious that I wish they would send them over every day. But last year, their vegetables, besides a portion sold in the town, were mostly for their own consumption. Alas, after picking a few times at my relative’s house, I felt embarrassed to go again. However, the child at home kept demanding it. It’s really headache-inducing.”<br/><br/>They were not those greedy relatives. After eating it once and picking a few more times, it was enough. If they continued to pick, they might not even have a relative left. Although people grew their vegetables for their own consumption, they could also sell them for money, and the vegetables sold for quite a high price.<br/><br/>So, for the sake of their children, they had to bite the bullet and buy vegetables from their relatives every day.<br/><br/>After refusing a few times, the relatives finally accepted the money.<br/><br/>After all, they were not the only relatives. If every relative came to pick vegetables and didn’t pay, how could they continue being relatives?<br/><br/>“But why did they need to establish a company for the whole village to plant vegetables? And even the land shares? Once the land is shared, there is no autonomy, and it will be difficult to get it back later.”<br/><br/>“What’s the need for it to return? If joining the company can make money, I’d rather let the company take care of it. We don’t need to work, and we can make money, how great is that?”<br/><br/>“Exactly. However, several families in Xiao Family Village said that their new daughter-in-law did not agree to the full sharing of land, but only joined half of the land shares. So, in the future, they can plant whatever they want. But if<br/><br/>they really want to make money, they can’t get that much.”<br/><br/>“On the other hand, if the company loses money, they won’t lose much.”<br/><br/>“That’s true. It’s just that it’s only the first year for Xiao Family Village, and it’s hard to say how they will develop in the future.”<br/><br/>“Who knows? I’ve never heard of the whole village starting a company.”<br/><br/>“I’ve only heard of individuals starting companies, or partnering with others, but I haven’t heard of the whole village starting a company.”<br/><br/>“Wow, these seedlings are really well-cultivated, and they’re very stout.” Someone exclaimed while looking at the seedlings that were brought out, “Who cultivated these seedlings?”<br/><br/>The seedlings they saw included chili seedlings, cabbage seedlings, eggplant seedlings, and so on. No matter what kind of seedlings, they all grew extraordinarily thick, and their leaves were shining green.<br/><br/>“Ah, I heard that these seedlings were grown by a ten-year-old child.”<br/><br/>“Ha, a ten-year-old child, really? A ten-year-old child may be able to dig some soil, pour some water for the plants, but can they really cultivate seedlings?<br/><br/>Without seeing it for themselves, no one would believe that a ten-year-old child could actually cultivate seedlings.<br/><br/>“You don’t believe it, do you? But that’s the truth. The people of Xiao Family<br/><br/>Village said so. It is said that more than 600 acres of seedlings with more than<br/><br/>100 varieties were all cultivated by that child.”<br/><br/>She paused before continuing, “I don’t know what method she used, but she cultivated seedlings on more than five acres of land, and each type of seedling grew exceptionally well. Also, the watermelon seedlings, which we all know, need to be grafted after they grow two or three leaves when planted. But the watermelon seedlings cultivated by this child don’t need grafting at all. They can be directly transplanted into the field.”<br/><br/>“How could a ten-year-old child do this?”<br/><br/>“Yes, how did she do it? I heard from a relative in Xiao Family Village that the planting of vegetables and fruits in the whole village and the establishment of their company was all suggested by this child. And did you know that the success of Xiao Family Village’s vegetables since the second half of last year was all due to earthworms?”<br/><br/>“Speaking of earthworms, I’ve heard about it too. Since the second half of last year, when they planted vegetables, they put big and thick earthworms into the soil, like small snakes.”<br/><br/>“I heard that after putting these earthworms into the soil, they would continuously turn the soil and release nutrients from their bodies. After three to five months, when all the nutrients in their bodies are released, their lifespan is almost over. By then, what needs to grow has already grown.” ,<br/><br/>“I’ve heard about this too. I asked my relative if they could give me some earthworms so I could give it a try. But my relative refused. My relative said that those earthworms are temporarily not for sale, and even giving some away is not allowed. Alas, my relative was very stubborn about this matter and wouldn’t sell me any. For this reason, I almost fell out with that relative. Later, when I heard that the whole Xiao Family Village was like this, I let go of my grievances towards my relative.”<br/><br/>“Speaking of earthworms, who in ten miles and eight villages doesn’t know now that Xiao Family Village’s vegetables grow well, all thanks to a kind of earthworm? However, this earthworm can only be bred by one person, that child who suggested the whole village plant vegetables.”<br/><br/>“It’s that child again. How can this child know everything? She’s just like a demon.”<br/><br/>“Exactly! “\t\t\t\t\t\t</div>", "images": {}, "success": true}