{"id": 185, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298288.html", "title": "Chapter 185 - Chapter 185: Chapter 185: Sister Doing Big Things (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 185 - Chapter 185: Chapter 185: Sister Doing Big Things (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 185: Chapter 185: Sister Doing Big Things (First Update)<br/><br/>Translator: 549690339<br/><br/>“Eh, Village Head, where did these few vegetables come from?” Li Guixiang asked, looking at several vegetables in the Village Head’s hands.<br/><br/>The Village Head replied, “They were picked from Jinli’s place.”<br/><br/>“Huh, does Jinli have vegetables for sale?” Li Guixiang asked with some surprise.<br/><br/>The Village Head shook his head, “No. She just asked me to pick these few vegetables to give to these guests.”<br/><br/>With that, he put down the few cabbages in his hand, still with roots and soil attached, and said to the few guests, “These are given to you by a family in our village. One for each, free of charge.”<br/><br/>These people’s eyes lit up as soon as they saw the vegetables in the Village Head’s hands.<br/><br/>After hearing the Village Head’s words, they quickly grabbed a cabbage each, frightened if they were a bit slower, someone else would grab it.<br/><br/>The Village Head, watching their behavior, didn’t say much. He just noted, “These vegetables are gifts for you. Our village really has no more vegetables to sell. This is the first and the last time we give them out. The new vegetables in our village will be available for sale at least one month later. When the time comes, you can buy as much as you want.”<br/><br/>“Oh, not until more than a month later? That’s so long?”<br/><br/>“Yeah, not until more than a month later. During this period, there will be no vegetables for sale in our store or in the village. We hope you guys wouldn’t make the trip for nothing,” the village head advised. “This year, the whole village is growing vegetables, so you don’t have to worry about not having vegetables to sell. We hope you continue to support us!”<br/><br/>Hearing this, the guests were a bit unhappy knowing that vegetables will only be available for sale more than a month later, but there was nothing they could do about it.<br/><br/>They all said, “Alright, we won’t come again. We’ll wait for your new batch of vegetables to be available.”<br/><br/>“But, can you ensure the new batch of vegetables will taste the same?”<br/><br/>“Of course,” the Village Head guaranteed. “The primary goal of our whole village’s growing vegetables is to ensure the quality of the vegetables. This time, it’s not just a small patch of field. Every household has planted several mu of land. If there is no quality guarantee, who would we sell the vegetables to?”<br/><br/>After hearing what the Village Head said, these guests left with a cabbage each.<br/><br/>Seeing these people leave, the villagers began to stir in excitement.<br/><br/>“Didn’t you see? They used to buy vegetables from our shop regularly. Now that there’s no sell in the shop, they are coming to our village to buy.”<br/><br/>“Haha, by the looks of it, we don’t have to worry about not being able to sell these vegetables.”<br/><br/>“True. Which village is like ours when we run out of vegetables to sell, apart from coming to the village directly to buy, many people even steal. Stealing vegetables! It’s like a joke in this day and age. Who would lack a few pieces of green vegetables at home? But the ones stealing green vegetables from our village are selling them.”<br/><br/>“Haha, with you mentioning it, wouldn’t the remaining vegetables in our fields be stolen?”<br/><br/>“Haha, what are you thinking? Aren’t there dogs guarding the vegetables in the field? Even those living nearby didn’t steal any last year, even less chance anyone would steal now.”<br/><br/>“Our village’s vegetables won’t be on the market for at least another month.<br/><br/>This period, we must not let thieves get the upper hand.”<br/><br/>“It’s hard to say.”<br/><br/>Xiao Yucheng and other executives of the company have heard about people coming to the village to buy vegetables from the open market town.<br/><br/>Zhou Yingxiu held documents, smiling and said to her husband, “Hehe, husband, I’m becoming more and more confident about the future development of our company. The vegetables in Xiao Family Village are indeed extraordinary. When we establish our sales channel, I guess these dealer bosses will come to us on their own.”<br/><br/>Zhou Yingxiu originally opposed Xiao Yucheng’s decision to stay, largely because she couldn’t leave the high salary of the foreign enterprise.<br/><br/>However, Xiao Yucheng insisted on staying, so she had no choice but to accompany her husband in starting a business.<br/><br/>No one was deterred by the busy and challenging days of the company’s inception. On the contrary, everyone was enthusiastic.<br/><br/>Especially Zhou Yingxiu, she felt proud watching the company gradually formalize amidst the busyness.<br/><br/>Xiao Yucheng said, “Even the world-renowned organic green vegetables cannot compare with ours in terms of taste and quality. So, as long as we establish a sales channel, there will be a constant supply of orders. Also, wife, have you noticed that after eating our vegetables, we feel more energetic and healthier?”<br/><br/>Zhou Yingxiu nodded, “Indeed, you know, I used to have a chronic problem with painful periods. But after living at home for a while and eating these vegetables every day, I didn’t feel pain during my period.”<br/><br/>“Haha, no more pain during your period, that’s wonderful!” Xiao Yucheng said with a laugh. “In the past, you would turn pale every time you had a painful period, I felt so bad for you. Now that you are free of this chronic problem, you won’t have to suffer this pain in the future.”<br/><br/>“Oh, right!” Zhou Yingxiu, picking up a lab report, said, “I sent some vegetables for testing, guess what the findings were?”<br/><br/>Xiao Yucheng took the report and asked curiously, “What is it?”<br/><br/>Zhou Yingxiu leaned over, pointed to a spot on the report and said, “There’s a kind of active molecule in the structure of these vegetables, which is very beneficial to the human body. Regular consumption can lead to improved health!”<br/><br/>It was only after she experienced no pain during her periods after eating the vegetables that she suddenly thought of getting them tested.<br/><br/>Having this test report will make it easier to find a sales channel.<br/><br/>“Haha, that’s great, with this test report, we can avoid many hassles,” Xiao Yucheng said excitedly. “Wife, thank you so much.”<br/><br/>“However, there’s a problem now,” Zhou Yingxiu said with a frown. “Why do our vegetables contain this active molecule when others do not? This requires an explanation!”<br/><br/>To her surprise, Xiao Yucheng said without hesitation, “There’s nothing to it. Of course, this belongs to our company’s trade secret, a technical secret. If anyone asks, just say it this way.”<br/><br/>Trade secrets are not to be disclosed casually.<br/><br/>Next, Xiao Yucheng said seriously, “Wife, this technology is currently only mastered by Jinli. So for Jinli’s safety, it must not be disclosed.”<br/><br/>Zhou Yingxiu nodded, “Of course, I know that. But anyone would be curious, right?”<br/><br/>“Hehe, being curious is useless!” Xiao Yucheng laughed, “It’s a secret, a secret, our company’s top-level secret.”<br/><br/>Zhou Yingxiu thought for a moment and asked again, “Husband, the most critical part of our vegetable growing technique is the earthworms. But, Jinli is just a child in her early teens, can she handle it alone? Should we let her pass on this technique to others?”<br/><br/>Xiao Yucheng shook his head, his expression serious, “You don’t fully understand my sister. Despite her tender age, she has always been a strong problem solver since young. Many major issues in the village are solved by her. She considers problems more meticulously and comprehensively than us adults. If this technique could be passed on to others, she would have already done so, instead of doing it all herself!”<br/><br/>Zhou Yingxiu,\t\t\t\t\t\t</div>", "images": {}, "success": true}