{"id": 181, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298272.html", "title": "Chapter 181 - Chapter 181: Chapter 181: Watching The Excitement From Other Villages (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 181 - Chapter 181: Chapter 181: Watching The Excitement From Other Villages (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 181: Chapter 181: Watching the Excitement from Other Villages (First Update)<br/><br/>Translator: 549690339<br/><br/>The voices discussing the child grew louder and louder.<br/><br/>“I heard that this child is the Lucky Star of Xiao Family Village.”<br/><br/>“Why do you say that?”<br/><br/>“Do you guys still remember that drought in Xiao Family Village more than a decade ago?”<br/><br/>“Haha, of course I remember that. At that time, it rained in other villages but not in Xiao Family Village. If other villages didn’t get rain, it was just a drought for a month or two. But it was strange when it came to Xiao Family Village. Even though there were dark clouds and thunderstorms, it looked like rain was about to fall, but then a gust of wind blew it away, and the rain went to the next village. As a result, Xiao Family Village had no rain for half a year, and almost no harvest.”<br/><br/>“Yeah, that year, Xiao Family Village faced ridicule from surrounding villages, saying it must have done something wrong, and even the heavens couldn’t bear it, so they punished the entire village.”<br/><br/>“The situation in Xiao Family Village was really quite tragic that year. With no rain for half a year, the crops in the fields were about to wither. It was only because there was a bit of rain in the upstream village, and a little water in the river, that the crops barely managed to hold on for half a year. However, since the river water was scarce, they had to block it, and it was impossible for the downstream village to get any water. So, the downstream village started making a fuss, and Xiao Family Village could only use the river water briefly, just enough to irrigate the surface of the crops.”<br/><br/>“Luckily, it was only Xiao Family Village that had no rain for half a year. The surrounding villages, although also experiencing some drought, would at least occasionally have rain, so the crops could still grow. When there was rain, the river had water, and this was how Xiao Family Village managed to survive for half a year. But if there was no rain soon, even if the crops didn’t die, the harvest would be significantly reduced, or there might be no harvest at all. Just when the villagers of Xiao Family Village were becoming desperate, a torrential rain suddenly arrived.”<br/><br/>“Haha, I heard about that. It is said that the rain was brought by the child.”<br/><br/>“Yes. People in Xiao Family Village really make a big deal out of it. They say that before the child entered the village, there wasn’t a single cloud in the sky, but when the child was carried into the village, the weather changed instantly, with large dark clouds. Once the child was completely inside the village, the heavy rain began.”<br/><br/>“Wow, that’s such a coincidence. Is this true or just a story, it’s so mysterious?”<br/><br/>“I know, right? It was just that coincidental. That rain quickly eased the drought in Xiao Family Village. Everyone in the village believed that the child was the village’s Lucky Star. Otherwise, why would it rain so heavily when the child arrived after no rain for half a year?”<br/><br/>“I just don’t believe it,” said a villager with suspicion. “Is it really that mysterious?”<br/><br/>“I don’t believe it much either. But everyone in Xiao Family Village firmly believes that the child is the Lucky Star of the entire village. They all like and trust the child. Now the child is only in their teens, but when the child says to grow vegetables, everyone in the village follows along. They say to start a company in the village, and now there’s a company.”<br/><br/>“…” A villager from another village said, “Isn’t this too childish? The whole village listens to a child?”<br/><br/>“Exactly. My daughter married into this village two years ago, and she strongly opposed the idea of growing vegetables for sale and having the whole village invest in a company. It’s just too incredible that the entire village actually listens to a child’s words without a single person doubting it. Because of this, my daughter quarreled with her husband and her in-laws. I also thought my in-laws were being ridiculous and didn’t agree to invest all their five acres of land in the company.”<br/><br/>“But my in-laws, young and old, were like lunatics and didn’t listen to us at all. In the end, my daughter threatened to divorce and take the child away. Only then did my in-laws agree to invest half of their land and keep the other half for their own farming.”<br/><br/>“I heard that only a few newlywed wives in Xiao Family Village disagreed with investing their family’s land.”<br/><br/>“It’s only the first year that Xiao Family Village is doing this, and we don’t know if they can make money. If they can’t, the new daughter-in-law has a say in her mother-in-law’s home, but if they do make money, it will cause problems.”<br/><br/>“What problems? No one knows for sure about the risks. The new daughter-in-law is just considering the family’s situation. Why should they join the company and give up their own land? What if the company loses money later and the land can’t be reclaimed?”<br/><br/>“Sigh, the risk is indeed great. But the people in Xiao Family Village are quite bold.”<br/><br/>“Definitely. If it were our village, no one would be willing to do this. After all, investing the land in a company means it won’t be yours anymore. You can’t decide what to grow on it or do anything with it.”<br/><br/>“But what if they can make money? Then the new daughter-in-law who opposed the idea will become the target of complaints from the whole family, right?”<br/><br/>“Yeah, that’s true. It’s really a dilemma.”<br/><br/>“Though, no matter what, I still can’t help but be amazed by the people in Xiao Family Village, as they directly believe a child’s words.”<br/><br/>“But although they listen to them, you have to admit the child’s achievements. Xiao Family Village’s vegetables sell so well in The Town, and that’s due to the child. Since they can make the whole village trust and obey, it proves that the child really has the ability.”<br/><br/>“But no matter how capable a child is, they’re still a child. In my opinion, the people in Xiao Family Village are just confused. Ten years ago, they thought the child was the Lucky Star because of that rain, but is the child still the Lucky Star ten years later?”<br/><br/>“It’s none of our business what happens in their village, we’re just watching and listening.”<br/><br/>The people of Xiao Family Village naturally knew that people from other villages were watching them, thinking they were crazy.<br/><br/>However, the idle talk of the people from other villages didn’t bother the villagers of Xiao Family Village.<br/><br/>All the villagers were working together on more than 600 acres of land, plowing the fields, transplanting seedlings, and it was a bustling scene.<br/><br/>After the land was plowed, it didn’t take long for everyone to plant the seedlings.<br/><br/>“Here are three thousand earthworms, here are five thousand earthworms…<br/><br/>After transplanting the seedlings, the greenhouse only had a few seedlings waiting to be planted and a large area of bare land.<br/><br/>Now everyone was using special tools to turn the soil, digging out the earthworms, and then putting them into the planting area.<br/><br/>Turning the soil and counting the worms was more complicated than planting seedlings.<br/><br/>“Ah, you men, always so careless. We’ve told you to be careful, but look how many earthworms were cut in half when you dug them up! You men should just go count worms, and let us women do this work.”<br/><br/>“Yeah. You men, don’t try to do something you can’t. Look how many earthworms you’ve broken. Just go do what you can, and if you have nothing to do, go smoke a cigarette outside, so you won’t get in our way!”<br/><br/>The men,..\t\t\t\t\t\t</div>", "images": {}, "success": true}