{"id": 188, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298300.html", "title": "Chapter 188 - Chapter 188: Chapter 188: Jiang Chen’S Arrival (2Nd Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 188 - Chapter 188: Chapter 188: Jiang Chen’S Arrival (2Nd Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 188: Chapter 188: Jiang Chen’s Arrival (2nd Update)<br/><br/>Translator: 549690339<br/><br/>Soon, Xiao Jinli received news of the Village Chief’s Wife’s impressive display of authority.<br/><br/>As expected, no matter how old they are, women understand women. Once a woman becomes a mother, she remains a mother for life!<br/><br/>Even the most selfish mothers have selfless love for their children.<br/><br/>No matter how old they are, their children are still their most beloved.<br/><br/>Thus, when it comes to their children’s reputation, their greed for taking advantage of others naturally takes a back seat.<br/><br/>Xiao Jinli certainly wouldn’t get involved in such minor matters.<br/><br/>In the five acres of land, rice seedlings are now growing.<br/><br/>Over 100 acres of seedlings require at least three acres of seedlings. Xiao Jinli cultivated four acres of seedlings, and the rest were other seedlings.<br/><br/>The rice seedlings can be transplanted in about twenty days and should be planted in the fields in March.<br/><br/>The rice seeds were still bought from the seed station, and they were the Northeast Fragrant Pure Rice.<br/><br/>Jiang Chen thought Xiao Jinli was just playing around when they first did business. But later, he realized that her business had grown bigger and bigger, almost emptying their seed station of seeds.<br/><br/>However, Xiao Jinli now gives advance notice to the seed station for any seeds she needs.<br/><br/>After getting to know Xiao Jinli, Jiang Chen came over to check things out.<br/><br/>Upon seeing a large area of tender green seedlings, he couldn’t help but ask in surprise, “Did you cultivate all these seedlings?”<br/><br/>Xiao Jinli nodded, “Yes!”<br/><br/>Jiang Chen immediately gave her a thumbs up and praised, “You are truly amazing. We usually need professional technicians to guide us in cultivating some rare seeds, but you did it all by yourself and even did better than the professionals.”<br/><br/>Xiao Jinli grinned and said with a laugh, “Maybe I have a talent for farming.”<br/><br/>Jiang Chen agreed wholeheartedly, “It must be a talent indeed. Everyone has special or outstanding talents in some areas. Otherwise, how could we have so many top-notch people in various fields?”<br/><br/>At this point, he seemed to remember something and asked, “I remember you bought those Colorful Camellia Seeds. Have you planted them? Have they germinated? With your talent for farming, maybe you can really make these Colorful Camellia Seeds take root and grow.”<br/><br/>Xiao Jinli nodded, “I planted two seeds, and both of them have germinated, and they’re growing well!”<br/><br/>Upon hearing this, Jiang Chen’s face showed extreme surprise. Then he said excitedly, “Really? Can I take a look and see for myself? I’ve only heard of Colorful Camellia, but I’ve never seen a real one!”<br/><br/>Xiao Jinli hesitated, her face full of difficulty. She shook her head and said, “I’m sorry, I’ve already given one away, and the other one is planted in a special location. It’s not convenient to let people see it.”<br/><br/>Jiang Chen’s expression fell, and he soon resumed his usual demeanor, understandingly saying, “That’s true, such expensive and special seeds would have been bought and all over the place if they could be easily cultivated.” It’s because they are special that Colorful Camellias are so expensive.<br/><br/>Xiao Jinli said, “Brother Jiang, when the Colorful Camellia blooms, I’ll invite von over to see it.”<br/><br/>Jiang Chen was excited again, “Great, that’s great! Please remember to let me come and see it. I’m also curious about what a Colorful Camellia worth millions and tens of millions looks like. Oh, by the way, when will it bloom?”<br/><br/>Xiao Jinli said, “There are already some flower buds now, and they should bloom around March or April.”<br/><br/>Jiang Chen nodded and said, “Colorful Camellia is very precious to people who love plants and flowers. Do you plan to keep this flower or sell it?”<br/><br/>Without hesitation, Xiao Jinli said, “Of course I’m going to sell it. No matter how precious, money is more practical!”<br/><br/>Jiang Chen,      She’s so vulgar at such a young age.<br/><br/>However, if he were in her shoes, he would also sell the flower. After all, to someone like him who doesn’t know how to appreciate it, a flower is just a flower, with no value. It’s more practical to sell it for money.<br/><br/>Jiang Chen thought for a moment and offered, “Do you need my help when you sell this Colorful Camellia? I may not be rich or powerful, but I have some connections and know quite a few noble elites.”<br/><br/>Those who can afford to buy the flower are either rich or noble.<br/><br/>Xiao Jinli thought for a moment and said, “Alright, if I need your help, Brother Jiang, I’ll definitely ask.’<br/><br/>Jiang Chen nodded and reminded her once more, “Jinli, remember to let me know when the Colorful Camellia blooms. I want to come and see!” Even if he can’t afford to buy it, he would still like to see and appreciate its beauty.<br/><br/>“Don’t worry, Brother Jiang, I’ll remember,” Xiao Jinli looked at the time and said, “It’s time for dinner. Let’s go eat. I’ll tell you, the food my mom cooks is simply amazing. You won’t be able to forget it once you’ve tried it.”<br/><br/>Upon hearing this, Jiang Chen was immediately interested and said, “Oh, really? Then I’ll enjoy it and maybe eat a little more.”<br/><br/>Before Jiang Chen and Xiao Jinli had even entered the courtyard, they smelled the enticing fragrance of the dishes. Jiang Chen’s spirits lifted, and he wrinkled his nose, exclaiming, “It smells so good! What dish is this, it smells so delicious? It must taste even better.”<br/><br/>With anticipation all over his face, they entered the house and saw the four elders sitting at the dining table. After hearing Xiao Jinli’s introduction that they were Xiao Jinli’s maternal grandparents and paternal grandparents, Jiang<br/><br/>Chen greeted them.<br/><br/>“Ha-ha, young man, don’t be so formal when you come here. Sit down,” Grandpa Xiao said with a smile.<br/><br/>After sitting down, Jiang Chen saw that the dishes were already on the table. Smelling the different aromas from the various dishes, Jiang Chen’s mouth was watering, and he swallowed, then said to Xiao Jinli,<br/><br/>“Just by looking and smelling these dishes, I can tell how delicious they are. I never thought that your mom’s cooking would be this good! Even a five-star chef can’t compare!”<br/><br/>As he was speaking, Xiao Jinli’s father brought a plate of green vegetables to the table and said with a smile, “Well, young man, you’d better eat a lot later.” Jiang Chen nodded, “Definitely, definitely!”<br/><br/>Xiao Jinli checked the time and asked, “Dad, are my brothers coming home for dinner?”<br/><br/>Dad replied, “They are busy with work, so they won’t be coming back for dinner. They’ll eat at the company’s cafeteria. The food there is also pretty good.”<br/><br/>Xiao Jinli nodded, then said with a smile, “My brothers always complain about missing my mom’s cooking, but when they’re working, they forget about everything else and only come home once in a while.”<br/><br/>Her maternal grandfather chuckled, “Their work ethic is really admirable. Now that the company is doing better and better, the young people have contributed a lot.’<br/><br/>Xiao Jinli agreed, “That’s for sure! My three brothers and sister-in-law are all outstanding. In the future, our company will undoubtedly develop better and better..”\t\t\t\t\t\t</div>", "images": {}, "success": true}