{"id": 186, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298292.html", "title": "Chapter 186 - Chapter 186: Chapter 186: Xiao Yucheng And His Wife Have A Heart-To-Heart Talk (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 186 - Chapter 186: Chapter 186: Xiao Yucheng And His Wife Have A Heart-To-Heart Talk (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 186: Chapter 186: Xiao Yucheng and His Wife Have a Heart-To-Heart Talk (Second Update)<br/><br/>Translator: 549690339<br/><br/>“Do you think that she became the Lucky Star of our village just because of that rain ten years ago?” Xiao Yucheng shook his head and said, “No. The reason she received the respect and trust from the whole village is because she is more decisive and effective than us adults in handling matters.<br/><br/>She was smart from a young age, being fluent in speech by three months, able to recite an entire dictionary by six months, and by ten months, she was riding the Cow King and helping villagers train their domestic cattle. When she was just two, she solved the dispute over water resources between our upstream and downstream villages. When she was three…”<br/><br/>Xiao Yucheng shared Xiao Jinli’s achievements since childhood with his wife. The more Zhou Yingxiu listened, the more astonished and shocked she became.<br/><br/>Could these incredible feats really have been accomplished by a child?<br/><br/>This was truly unbelievable.<br/><br/>However, some geniuses were indeed born to astound others.<br/><br/>“As for her skill of breeding earthworms. If she hasn’t disclosed it and passed this skill on to others, it means that this skill cannot be shared with others, and only she can put it into practice!” Xiao Yucheng finally said earnestly.<br/><br/>Upon hearing this, Zhou Yingxiu’s expression turned serious and complex.<br/><br/>She voiced her worries, “But husband, as our company grows larger and our farming base keeps expanding, when the demand for earthworms continues to increase, can my sister manage all on her own?”<br/><br/>Xiao Yucheng smiled and said, “I believe Jinli must have her own plans. At present, our company is in the early stages, and Jinli will certainly consider the future development of the company. You don’t need to worry about this.”<br/><br/>Zhou Yingxiu gave a somewhat helpless bitter smile, “Placing the burden of a company on a child, how can I not worry? However, since you have such confidence in Jinli, I will also have confidence in you!”<br/><br/>Xiao Yucheng said emotionally, “Thank you, my wife, for supporting everything I do!”<br/><br/>Fortunately, his wife, who initially disagreed with staying, ended up supporting him wholeheartedly.<br/><br/>Unlike Xiao Mingchen and his wife, they ended up divorcing and leaving their home empty-handed.<br/><br/>That Lan Qingqing, she appeared frail and weak, but her heart was really cruel, she swindled all the savings of Little Aunt’s family.<br/><br/>Zhou Yingxiu said with a smile, “I chose to follow the chicken when I married a chicken, follow the dog when I married a dog. Since I married you, naturally I should obey you. We are a couple and certainly need to assist each other!” Moreover, Xiao Yucheng, as a husband, was considerate and caring, displaying occasional manly traits.<br/><br/>When they worked outside, they lived in a rented house and shared household duties. They would never complain about who did more or less housework.<br/><br/>Both would sympathize with each other’s hard work.<br/><br/>When they went shopping together, she selected items and he paid for them while also carrying the bags, never complaining about her extravagant spending.<br/><br/>With such a good husband, she would naturally cherish him.<br/><br/>Even this time, although they had arguments due to disagreements about where to work, they would always communicate well afterwards.<br/><br/>Moreover, her in-laws were all very good, tolerant and magnanimous, treating her as their own daughter.<br/><br/>Having a good husband and good in-laws is the dream of many women, and only a fool would want to divorce such a good husband.<br/><br/>Speaking of which, the only fool must be her former sister-in-law, Lan Qingqing.<br/><br/>Lan Qingqing, married to a good man with a good mother-in-law’s family, did not know how to cherish, and always prioritized her maiden family.<br/><br/>Did she really think that her maiden family would be her everlasting support?<br/><br/>Humph, she will regret it one day.<br/><br/>Speaking of, the people in the Open Market Town, after visiting Xiao Family<br/><br/>Village and bringing back a cabbage, said when asked, “This is from Xiao Family Village. ”<br/><br/>“Ah, it’s from Xiao Family Village?” the questioner’s eyes lit up and said, “Do they still have vegetables there?”<br/><br/>“Are there vegetables to sell? This is a gift they gave us.”<br/><br/>“They gave it?” the old lady who asked the question rolled her eyes, looked at the vegetable in her hand, and smiled. “This big cabbage can make several meals. And it comes with the root and soil, it can be planted in the ground and eaten as it grows.”<br/><br/>And let’s not talk about whether it’s a Chinese cabbage or a common cabbage, each one was quite large, weighing at least six or seven jin.<br/><br/>“Isn’t it? We do plan to do so. There are no vegetables for sale in Xiao Family Village now, we have to save as much as possible.”<br/><br/>After these people left, the old lady who asked the question, Granny Li, immediately called some people over and said, “The Fu family’s daughter-in-law just went to Xiao Family Village and received a cabbage for free, the cabbage must weigh at least six or seven jin. Let’s also go to Xiao Family Village to see if we can get some cabbage.”<br/><br/>Those who were called by her were all old ladies who loved to exploit small advantages.<br/><br/>Hearing about getting free vegetables from Xiao Family Village, their eyes lit up and they agreed assuredly, “With such a good thing, then let’s go. You know, it’s been a long time since the vegetables from Xiao Family Village have been<br/><br/>up for sale, everyone’s been looking for it.”<br/><br/>“Go, go, let’s go and have a look to see if we can get free vegetables from Xiao Family Village. ”<br/><br/>Thus, more than a dozen old ladies set off in the direction of Xiao Family Village.<br/><br/>Xiao Jinli had no idea that because of the free vegetables she gave away, there would be a bunch of penny-pinching old ladies coming over, causing the villagers of Xiao Family Village to have a hard time dealing with them.<br/><br/>The main issue was that these old ladies were very persistent, wanting vegetables for free and refusing to leave without them!<br/><br/>Xiao Jinli was in the greenhouse observing the growth condition of the earthworms when a child came in and called, “Jinli, come quickly, something has happened!”<br/><br/>Xiao Jinli slightly furrowed her brows, stepped out of the greenhouse, and asked, “Gouwa, what’s wrong, what happened?”<br/><br/>If something really happened in the village, an adult would come to call her.<br/><br/>Since a child came running to her, it meant that the matter was not that serious.<br/><br/>Gouwa’s face darkened, “Jinli, how many times have I told you, don’t call me<br/><br/>Gouwa, my name is Xiao Mingliang.”<br/><br/>Then he said, “It’s just that our village suddenly has a bunch of old ladies, um, probably more than ten people, asking for our vegetables, and they refuse to leave without getting them for free!”<br/><br/>When Xiao Jinli heard this, she immediately knew what had happened.<br/><br/>She guessed that the batch of old ladies probably heard about the free vegetables she sent out and wanted to come over to take advantage of it.<br/><br/>“Now my grandfather is dealing with them, but he’s having a hard time.” Gouwa scratched his head and said, “These old ladies, you cannot scold or hit them, you can only try to reason with them. But these old ladies simply don’t listen to reason.”<br/><br/>Xiao Jinli raised her eyebrows and asked, “So, your grandpa asked you to call<br/><br/>“Hehe…” Gouwa laughed naively and said, “No, it wasn’t my grandpa who asked me to call you, I came here on my own.”<br/><br/>Xiao Jinli crossed her arms and said, “Okay, I got it. You go back.”<br/><br/>Gouwa was taken aback, “Huh, that’s it?”<br/><br/>Xiao Jinli immediately spread her hands and said, “Not like this, then how should I be? Alright, I’m still quite busy. You go back.”<br/><br/>For such a small matter, if the Village Head couldn’t handle it, she still had her<br/><br/>three elder brothers.<br/><br/>Gouwa,\t\t\t\t\t\t</div>", "images": {}, "success": true}