{"id": 182, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298276.html", "title": "Chapter 182 - Chapter 182: Chapter 182: Earthworms Second Generation (Part 2)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 182 - Chapter 182: Chapter 182: Earthworms Second Generation (Part 2)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 182: Chapter 182: Earthworms Second Generation (Part 2)<br/><br/>Translator: 549690339<br/><br/>Initially, over 100,000 earthworm larvae were collected, but earthworms have a small characteristic: they can survive even after being cut in half.<br/><br/>Earthworms are a special type of segmented animal. They have a head and a tail and specific organs.<br/><br/>However, their entire body is like two tubes wrapped together, with an outer layer containing the muscle system inside. Running through its body is the digestive tract, which contains many body cavity fluids.<br/><br/>When an earthworm is cut into two parts, its muscle tissue begins to contract, allowing some cells to automatically dissolve and form new cell clusters.<br/><br/>As a result, the cut surface is blocked, ensuring that not too much blood is lost from the wound on its body.<br/><br/>Once the wound heals, muscle cells begin to migrate, forming regenerative buds and growing new parts.<br/><br/>Of course, not all earthworms can regenerate after being severed. There is a luck factor involved.<br/><br/>Earthworms are a relatively complex existence in the segmented world. They have a digestive system and a circulatory system, and a large number of blood vessels are distributed.<br/><br/>If the cut position is incorrect, the muscles will not be able to block the wound during contraction, and the earthworm may die from excessive bleeding.<br/><br/>Overall, it depends on whether the cut position is correct or not. If the position is correct, regeneration becomes relatively easier.<br/><br/>Xiao Jinli carefully selected a group of robust and energetic earthworms, artificially severed them, and then placed them in nutrient-rich soil she had prepared. Even if the cutting position was not right, the abundant Lingquan water in the soil could help the earthworms recover quickly from their wounds.<br/><br/>These severed earthworms quickly turned from one worm into two worms.<br/><br/>So, the initial 100,000 earthworms have now doubled, plus the earthworms’ own reproduction, totaling more than 200,000.<br/><br/>Earthworms have strong reproductive abilities. They are hermaphrodites, laying eggs once every month, and each egg produces multiple earthworms.<br/><br/>Due to the large number of earthworms, the total breeding volume is still quite large.<br/><br/>Xiao Jinli considered the earthworms she initially bought as the first generation.<br/><br/>The first-generation earthworms were raised and grown entirely by Xiao Jinli, using Lingquan water to irrigate them.<br/><br/>When they reproduced and produced offspring, the resulting earthworms were nurtured inside the parents and had larger sizes and higher nutritional and survival rates than their parents. Xiao Jinli marked them as the second generation.<br/><br/>However, the second generation of earthworms became a new batch of seedlings.<br/><br/>As the parent body of the second-generation seedlings, Xiao Jinli carefully selected them.<br/><br/>These parent bodies were then placed in another nutrient-rich soil plot.<br/><br/>Mature earthworms can reproduce once a month, and within three to four months, one earthworm can produce twenty to thirty offspring.<br/><br/>Xiao Jinli looked at the vast breeding ground of more than five acres and felt that it wouldn’t be enough if things continued like this.<br/><br/>Therefore, in the second year, she expanded the earthworm breeding area and built another greenhouse.<br/><br/>After Xiao Yucheng became the general manager of Xiao Family Village Green Fresh Company, he had special future plans for Xiao Jinli’s earthworm breeding, which was a key project.<br/><br/>After all, the whole village relies on these earthworms for the development and prosperity of crop cultivation.<br/><br/>Therefore, a specific allotment of thirty mu of land was made to build greenhouses for future earthworm breeding.<br/><br/>Apart from the initial five points of land used by Xiao Jinli for research as a private base, the following five acres of land also belonged to her research base. She bred earthworms and seedlings for the company, which received compensation.<br/><br/>After thirty acres of land were set aside, Xiao Jinli divided the area into sections, each for cultivating the second and third generations of earthworms…<br/><br/>These earthworms, offspring of the parent earthworms, had stronger constitutions than the first generation from the beginning.<br/><br/>Therefore, the value of these earthworms is actually higher than the first generation. They inherit all the advantages of the previous generation, eliminate all impurities, and are superior to the first generation. The crops grown with them are sure to be of better quality.<br/><br/>Of course, Xiao Jinli hasn’t told the villagers about this yet.<br/><br/>Now, all working together, they are pouring the first-generation earthworms into the fields. Each earthworm is as thick as an adult finger and as long as chopsticks. People who are afraid of crawling, soft animals and those with a fear of dense clusters are terrified by them.<br/><br/>It is now the second lunar month. The weather is still cold, but the villagers have planted all the seedlings they can in nearly 500 mu of land, including peppers, eggplants, cabbages, and watermelons.<br/><br/>For the remaining hundred plus acres of land, apart from planning for rice cultivation, there are forty to fifty acres of land for flexible use.<br/><br/>From plowing the land to planting earthworms, the whole village has been busy for more than twenty days. According to the company’s requirements, pure green vegetables and fruits must be cultivated, so all the fertilizer used consists of earthworms and organic farm fertilizer, without using any chemical fertilizers or additives.<br/><br/>“Yucheng, what are pure green vegetables? And what is green food?” A villager asked.<br/><br/>Xiao Yucheng explained, “Green vegetables refer to those that follow the principles of sustainable development. They are produced under the prerequisite of good ecological environment in the place of origin, in accordance to specific quality standards, and approved by specialized agencies to be pollution-free, safe, high-quality, and nutritious vegetables bearing the green food logo.<br/><br/>Green vegetables refer to those whose pesticide residues remain in the vegetables after pesticide use are lower than the national or international standards.<br/><br/>We not only want to create green vegetables but also strive to produce green food, such as the chickens and ducks we raise. Green vegetables are just one type of green food.<br/><br/>Green food must meet 5 standards:<br/><br/>Standard 1: The product or its raw material location must comply with the green food ecological environment quality standards.<br/><br/>Standard 2: Crop cultivation, livestock and poultry breeding, aquatic cultivation, and food processing must comply with the green food production operation specifications.<br/><br/>Standard 3: The product must comply with green food and hygiene standards.<br/><br/>Standard 4: The product packaging must comply with the national food label general standards.<br/><br/>Standard 5: Meet the specific packaging, decoration, and label requirements for green food.<br/><br/>Green food is graded into two categories: Grade A and Grade AA.<br/><br/>Grade A green food<br/><br/>In addition to meeting the above standards, limited use of designated chemical synthetic production materials is required, and biological methods must be actively adopted to ensure product quality requirements are met.<br/><br/>Grade AA green food, in addition to meeting the above standards, uses organic fertilizers, green manures, crop rotation, biological or physical methods, and other technologies for production, improving soil fertility and controlling pests and diseases.”<br/><br/>“So, our goal is to make the products created in our village into Grade AA green food, sell them all over the country, and build our green brand!”<br/><br/>Most villagers have little education and couldn’t quite understand Xiao Yucheng’s explanation, but they did understand the last sentence.<br/><br/>Passionate and excited!\t\t\t\t\t\t</div>", "images": {}, "success": true}