{"id": 189, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298304.html", "title": "Chapter 189 - Chapter 189: Chapter 189: Did President Gao Get A Mistress? (Part One)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 189 - Chapter 189: Chapter 189: Did President Gao Get A Mistress? (Part One)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 189: Chapter 189: Did President Gao Get a Mistress? (Part One)<br/><br/>Translator: 549690339<br/><br/>Licheng Gao Sheng International Trade Company<br/><br/>President Gao Jianjun just finished a meeting with his subordinates when he received a phone call.<br/><br/>Seeing the incoming call, the secretary watched the usually serious and cold president quickly turn into a gentle and amiable person.<br/><br/>The secretary marveled to herself, “I wonder who the president is talking to, is it his wife?”<br/><br/>Only in front of his wife would this aloof president become gentle and affectionate.<br/><br/>As the saying goes, women at forty are like tofu residue, men at forty are like blooming flowers.<br/><br/>A man at forty is at the peak of his career, mature and steady, exuding charm, which attracts many women, especially young girls.<br/><br/>President Gao is no exception. Even though he is over forty, he does not have the bald, pot-bellied, and greasy uncle look like other bosses. Instead, he is handsome, tall, and cool, with a refined demeanor and a successful career, making him very attractive to women.<br/><br/>However, within the industry, it is well known that President Gao only has eyes for his wife and treats any other woman indifferently. Even when dealing with female clients, he is always polite and tactful, never crossing the line.<br/><br/>In his words, business is business, and it’s not about trading power for sex.<br/><br/>If he had to sacrifice his appearance for the sake of cooperation, he would rather give up on the collaboration.<br/><br/>Haha! If a woman said such a thing, people would admire her for her straightforwardness and perseverance, like a female hero!<br/><br/>However, when a man says this, many people find it funny and think that a man who rejects women is either not interested in women or pretends to be upright.<br/><br/>Nobody would believe that a successful businessman could be so loyal to his aging wife.<br/><br/>But that’s how it is.<br/><br/>For this reason, he has broken the hearts of many men.<br/><br/>Just as Secretary Cui thought that their president was talking to his wife and was about to leave, she heard President Gao’s gentle voice, “Jinli, did you call me for anything?”<br/><br/>Jinli?<br/><br/>This name sounded like a girl’s name.<br/><br/>The president is surprisingly gentle to another girl, she must be special.<br/><br/>Could it be that the president has found a mistress behind his wife’s back? Secretary Cui felt uneasy.<br/><br/>He was considered a good man in the business world, but now he found a mistress?<br/><br/>“Ah, is that true? You’re coming over? Okay, when? Should I pick you up? Alright, I got it.”<br/><br/>After hanging up the phone, President Gao made another call. As soon as the other party answered, he said,<br/><br/>“Bamboo, Jinli is coming over in a few days. Okay, okay, don’t worry, I’ll make sure everything is arranged. Yes, yes, at that time, I’ll have Gao Yanxin pick her up. Oh, no, I’ll pick her up myself!”<br/><br/>Secretary Cui, “…” It seems she had overthought it.<br/><br/>This Jinli might be a girl, but she should be related to President Gao’s family.<br/><br/>After the president hung up the phone, he noticed that his secretary was still standing at the door and asked doubtfully, “Secretary Cui, do you need something?”<br/><br/>Secretary Cui immediately shook her head and said, “Nothing, nothing, Mr. President, I’ll leave now.”<br/><br/>As soon as Secretary Cui stepped out and leaned against the door, she patted her chest and gasped, “Oh my, that was so scary. I really thought the president had found a mistress.<br/><br/>Another secretary happened to pass by and heard her muttering. With an intrigued look, she asked, “Secretary Cui, who has a mistress?”<br/><br/>Upon hearing this, Secretary Cui immediately panicked and covered Secretary Li’s mouth, casting a cautious look at the door of the president’s office, “Be quiet! Do you want to get me killed?”<br/><br/>“Mmm…” Secretary Li’s face turned red with her mouth covered, her eyes motioning for Cui to let go.<br/><br/>Secretary Cui released her, and Secretary Li asked, “Secretary Cui, what are you afraid of? Who has a mistress?”<br/><br/>Then she looked in the direction of the president’s office and exclaimed, “Could it be our president has found a mistress?”<br/><br/>If that’s true, it would be big news in the industry.<br/><br/>Upon hearing Secretary Li’s words, Secretary Cui reflexively covered her mouth again.<br/><br/>Once again, Li’s mouth was covered. Her big, expressive eyes blinked rapidly, filled with curiosity and confusion.<br/><br/>Secretary Cui whispered, “You really want to get me killed. If the president knew I was talking behind his back about him having a mistress, he would fire me in a minute.”<br/><br/>At this point, she explained, “Don’t misunderstand. It’s not the president who has a mistress; it’s that I almost misunderstood that he had one.”<br/><br/>Secretary Li hooked her lips with curiosity and groaned, “Let go of me first; it’s uncomfortable for you to cover my mouth like this!”<br/><br/>Secretary Cui finally let her go.<br/><br/>Secretary Li took a few breaths and then asked with confusion, “What’s going on? How could you misunderstand that our president had a mistress?”<br/><br/>Then Secretary Cui explained, “It was the first time I saw our president talk on the phone with such a gentle tone towards a woman other than his wife. I thought it was a mistress.”<br/><br/>Upon hearing this, Secretary Li rolled her eyes and said displeasedly, “You’re really something. Just because our president speaks gently to another woman, you suspect he has a mistress? You’re not sick in the head? If our president really had a mistress, would he make this call in front of you, his secretary?”<br/><br/>That would be damaging to his image and reputation, and he would definitely avoid doing it in front of anyone.<br/><br/>‘ Secretary Cui nodded, “It’s my fault. I overthought it.”<br/><br/>Then she made a pleading gesture and said, “Please, don’t tell the president about this, or I won’t be able to get away with it. Please, Secretary Li, you’re the best!”<br/><br/>Secretary Li laughed, “It’s okay. Even if you didn’t beg me, I wouldn’t report such a petty thing.”<br/><br/>“Secretary Li, come in for a moment,” President Gao suddenly called.<br/><br/>Guilty-conscious Secretary Cui jumped with fright and whispered, “We were whispering just now. Are you sure the president didn’t hear us? What does he want you to do now?”<br/><br/>Secretary Li rolled her eyes and said irritably, “Humph! Serves you right for doubting our president. Okay, I have to go in now.”<br/><br/>With that said, she ignored Secretary Cui’s nervousness and entered the president’s office.<br/><br/>After a while, she came out.<br/><br/>Secretary Cui expectantly looked at her, and Secretary Li said with a smile, “The president asked me to book a flight from Ganjiang City to Licheng in three days.”<br/><br/>“Oh, so that’s it.” Secretary Cui felt relieved.<br/><br/>Secretary Li mischievously added, “Yes, the ticket is for that Xiao Jinli.”<br/><br/>Secretary Cui,\t\t\t\t\t\t</div>", "images": {}, "success": true}