{"id": 183, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298280.html", "title": "Chapter 183 - Chapter 183: Chapter 183: Continuously Adding Condiments To The Pie (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 183 - Chapter 183: Chapter 183: Continuously Adding Condiments To The Pie (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 183: Chapter 183: Continuously Adding Condiments to the Pie (First Update)<br/><br/>Translator: 549690339<br/><br/>It can be said that Xiao Yucheng is truly a cultured person, and moreover, he has worked as an executive in a big company outside.<br/><br/>Each progress report on company projects and every company and village meeting always managed to rouse high emotions in people.<br/><br/>It’s like there was a pie in front of everyone, which everyone could already see, yet he continued to add seasoning to it, making the pie look even more tempting and appetizing.<br/><br/>The emotions of the whole village were driven by Xiao Yucheng as if they had already seen the vegetables and fruits of their village being sold all over the country, and then becoming famous.<br/><br/>But while the whole village of Xiao Family Village was positive and looking forward to it, people from other villages were constantly pouring cold water on them, mocking the Xiao Family Village villagers for their wild imaginations.<br/><br/>“Haha, just growing vegetables and they can sell them all over the country?<br/><br/>That’s just wishful thinking.”<br/><br/>“Exactly. We haven’t heard of any place that can sell its vegetables all over the country. In many places, the vegetables are grown locally and sold back to the locals. Otherwise, the transportation of the vegetables would be a problem, especially for long distances. After two or three days of transportation, by the time the vegetables have arrived, they will likely have rotted.”<br/><br/>“Well, isn’t transportation now using some kind of preservative or refrigerated transport? It shouldn’t be that easy to spoil, right?”<br/><br/>“It won’t spoil easily, but I’ve heard that the taste of frozen vegetables and fruits is far worse.’<br/><br/>“But the vegetables from Xiao Family Village haven’t even been grown yet, so what are we worrying about for them?”<br/><br/>“Right. They have established a company in their village, and I heard they are also planning to raise a large number of chickens, ducks, geese, pigs, and cows. They have already built large-scale breeding farms.”<br/><br/>“Ha, so many animals; can they sell them all?”<br/><br/>Indeed, people who haven’t accomplished big things always have some groundless fears.<br/><br/>They never believed that so many things could be sold; how can all of this be<br/><br/>sold?<br/><br/>“Haha, who knows? Maybe they really have this ability. The company they established is not casually set up. The company has not started making money yet, but it already went to the bank to get a loan – borrowing hundreds of thousands.”<br/><br/>“Ha, borrowing so much? Can the vegetables they grow sell for so much? They are already in debt before earning money. It seems like they are making money for the bank.’<br/><br/>“That’s true. Vegetables are cheap, and there are only a few hundred acres, which can’t sell for much. It seems that the people of Xiao Family Village are going down a dead-end road. We’ll just wait and see.”<br/><br/>“The whole village is growing vegetables. I don’t know what they’re thinking.”<br/><br/>Of course, the villagers of Xiao Family Village heard the whispers of the people outside.<br/><br/>Many people’s concerns were just like what the outsiders said – how much can these vegetables sell for? The company hasn’t made any profit yet, but they have already borrowed hundreds of thousands from the bank. They must repay the bank first, so how much money can they make?<br/><br/>Privately, many villagers started discussing among themselves.<br/><br/>“The company borrowed so much money; can we pay it all back just by growing vegetables?”<br/><br/>“Moreover, since the establishment of the company, any action it has taken has cost money. Except for our voluntary efforts to grow vegetables in the whole village, it seems that everything else costs money. Even hiring a cleaner for the company costs money, as well as paying salaries to the company employees who go to work there. Besides, establishing such large breeding farms and buying seedlings also requires a lot of money. I don’t know if the borrowed money from the bank is enough.’<br/><br/>“Sigh, I’m also worried about this. However, Xiao Yucheng and others said that everything is hardest at the beginning. Our spending stage is in the early stage of establishment, and in the later stage, we can just wait to make money.”<br/><br/>The whole village was growing vegetables, and with the company doing so many things, the villagers were unsure in their hearts.<br/><br/>But soon, everyone regained confidence.<br/><br/>Because many people in Open Market Town came to buy vegetables.<br/><br/>Since the end of the year, the supply of vegetables to Open Market Town had already stopped.<br/><br/>Once the supply of vegetables from Xiao Family Village stopped, those families whose children had become addicted to them were naturally dissatisfied.<br/><br/>However, the end of the year was approaching, and every household was getting busier. After comforting their noisy children, the parents could finally feel relieved for the moment.<br/><br/>But looking at their children growing taller and in better spirits, the parents knew that after the New Year, they would definitely continue to buy vegetables from Xiao Family Village.<br/><br/>It was because of the vegetables from Xiao Family Village that the children were willing to eat, and with enough food and sleep, the children’s spirit naturally grew taller.<br/><br/>For the sake of their children’s health, even the most frugal parents were willing to spend money.<br/><br/>After all, the children were everything to their families.<br/><br/>But after the Lantern Festival, the Xiao Family Village Vegetable Store still hadn’t opened, and the parents started to wonder again.<br/><br/>“What’s going on with this store? It’s been past the Lantern Festival, but the store still hasn’t opened. The children are going back to school soon, and I want to feed them well before they do, so they can be more energetic in class.”<br/><br/>“I am also waiting for my child to go back to school before buying more vegetables from Xiao Family Village for them to eat. But the store has been closed since the end of the year until now. What’s going on?”<br/><br/>“Speaking of which, these vegetables from Xiao Family Village are truly amazing. They taste great, the children love to eat them, they can eat more rice, and their spirits are getting better and better, making it easier for them to pay attention in class. My child even advanced thirty spots in the class in the last exam, and even the teacher is amazed by his progress. Haha, my child used to always be one of the last ones in the class. I am so happy with how quickly he is improving.”<br/><br/>“I also asked my child, and he said that after eating enough, he feels energetic and can concentrate during class. His grades have naturally improved. Since the end of the year when the Xiao Family Village Vegetable Store closed, my child’s appetite has significantly decreased. Now that school is starting, I just want to feed him well. But what’s the deal with this store? It still hasn’t opened for business.<br/><br/>“Who knows what’s going on? Why don’t we go to Xiao Family Village and see?<br/><br/>I heard that every household there grows the same vegetables.”<br/><br/>“Okay, let’s go take a look. It is not just the children, even the old bones like us want to eat the vegetables from Xiao Family Village.”<br/><br/>“Let’s go and see if we can buy some. If the mountain doesn’t come to us, we have to go to the mountain.”<br/><br/>So, a group of regular customers of the Xiao Family Village Vegetable Store went to Xiao Family Village in a lively pack. “Big sister, we want to buy some vegetables, where can we buy them?”<br/><br/>“Buy vegetables? We don’t have any to sell.”<br/><br/>“Ha, no vegetables for sale? With so many people here growing vegetables, is there really none to sell?”<br/><br/>“No, there isn’t. Everyone does grow vegetables, but it’s for their own consumption. At the end of the year, the young people come back, and the children don’t have to go to school, so more people means more vegetables are needed. Now we don’t even have enough to eat for ourselves, so how can we have extra vegetables to sell?”<br/><br/>This is the conversation between the regular customers and the villagers ot<br/><br/>Xiao Family Village..\t\t\t\t\t\t</div>", "images": {}, "success": true}