{"id": 190, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298308.html", "title": "Chapter 190 - Chapter 190: Chapter 190: Airplane Delay (Part 2)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 190 - Chapter 190: Chapter 190: Airplane Delay (Part 2)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 190: Chapter 190: Airplane Delay (Part 2)<br/><br/>Translator: 549690339<br/><br/>“Jinli, are you sure you don’t want us to accompany you to Licheng?” Xiao Father was driving Xiao Mother and Xiao Jinli to Ganjiang City Airport.<br/><br/>Xiao Jinli held a bunch of little camellias in her hand with a few flower buds still on the tree and carried a small black bag on her back.<br/><br/>She shook her head and said, “No need, Dad, I can manage on my own. You’ve brought me here to take the plane, and when I arrive in Licheng, Cousin Xin and my Uncle will pick me up. Don’t worry, I definitely won’t get lost.”<br/><br/>Xiao Father looked at his beautiful daughter and couldn’t help but worry. He said, “No, I should go with you.”<br/><br/>“…” Xiao Jinli said, “Dad, don’t worry. Your daughter is so smart and energetic; most ordinary people can’t even beat me. I won’t be easily deceived or<br/><br/>abducted.”<br/><br/>“But you’re still only eleven years old.” Xiao Father said, “No matter how strong you are, can you be stronger than those grown men? No, I’ll buy a plane ticket and stay with you in Licheng for a few days.”<br/><br/>His daughter was smart and beautiful, making her an easy target for human traffickers.<br/><br/>Xiao Jinli, ‘ That wouldn’t work. Having her father around would make many things difficult to do.<br/><br/>So, she had to dissuade him.<br/><br/>Helplessly, Xiao Jinli said, “Dad, you should trust your own daughter. I was born as a Lucky Star, and bad people will only be unlucky when they meet me. Dad, don’t worry, I’ll be careful and won’t talk to strangers or go with them!” When mentioning the Lucky Star, Xiao Father agreed.<br/><br/>After hearing Xiao Jinli’s repeated assurances, Xiao Father reluctantly agreed to let his daughter go to Licheng alone.<br/><br/>Once Xiao Jinli boarded the airplane, he immediately called Gao Jianjun and said, “Jianjun, Jinli is already on the plane and will arrive in two hours. Make sure you pick her up.”<br/><br/>Gao Jianjun received the call from his brother-in-law and laughed, promising, “Brother-in-law, don’t worry. As long as Jinli gets on the plane, I’ll definitely pick her up in advance. Brother-in-law, there’s no need to worry. Jinli is so smart; nobody can deceive her. Okay, okay, once I pick her up, I’ll call you right away.”<br/><br/>After hanging up, Gao Jianjun said to his son beside him, “Your cousin has already boarded the plane. Let’s go pick her up together.”<br/><br/>Gao Yanxin took the car keys and said, “Dad, I can go alone.”<br/><br/>Gao Jianjun nodded, “Alright, you go to the airport. And when you pick her up, call your uncle to ease their worries.”<br/><br/>Gao Yanxin nodded, “Okay, I understand!”<br/><br/>Afterwards, he took the car keys and was about to leave, but Gao Jianjun called him back a moment later.<br/><br/>“Dad, what’s the matter?” Gao Yanxin asked.<br/><br/>“Let Secretary Li go with you to pick her up.” Gao Jianjun said, “Secretary Li is more careful and knows what girls need. When your cousin gets off the plane, let Secretary Li take her shopping.”<br/><br/>Gao Yanxin rolled his eyes and said speechlessly, “Cousin just gets off the plane and you want her to go shopping? Won’t that be tiring?”<br/><br/>“Just do what I say and go with Secretary Li!” Gao Jianjun said,<br/><br/>A while later, Gao Yanxin and Secretary Li set off for the airport.<br/><br/>Secretary Li asked curiously, “Young Master, who are we picking up?”<br/><br/>As for Xiao Jinli, she was really curious.<br/><br/>She didn’t expect that the usually aloof President would speak so gently to this girl.<br/><br/>Gao Yanxin said, “My cousin, um, my elder aunt’s daughter. You know,<br/><br/>Secretary Li, Xiao Jinli is so smart and beautiful. She…”<br/><br/>Afterward, Secretary Li was forced to listen to the praises and growth experiences of this cousin throughout the journey.<br/><br/>Secretary Li became extremely curious about the girl.<br/><br/>However, when they arrived at the airport, they learned of the flight delay from Ganjiang City to Licheng.<br/><br/>Upon hearing the news, Gao Yanxin’s face turned pale with fear.<br/><br/>He trembled and said, “A delay? How can the plane be delayed? I clearly heard my uncle say that my cousin had boarded the plane!”<br/><br/>If the plane had taken off, it would mean it was flying normally.<br/><br/>If there’s a delay, like encountering bad weather or mechanical failure, the passengers would be informed in advance and not allowed to board.<br/><br/>But if the plane is delayed after boarding, what does that mean?<br/><br/>It means that an emergency occurred during the flight.<br/><br/>The probability of an airplane accident is low, but it doesn’t mean it can’t happen.<br/><br/>Once an airplane accident occurs, the people inside have almost no chance of survival.<br/><br/>Secretary Li also hadn’t expected such a situation.<br/><br/>She comforted Gao Yanxin, “Young Master, don’t worry. Right now, it’s just a delay; it doesn’t mean the plane has crashed. Calm down first.”<br/><br/>At this time, many family members of the passengers on that flight were in the airport. Upon hearing the news, they became very emotional.<br/><br/>“What situation causes a flight delay? Doesn’t the airport owe us an explanation?”<br/><br/>“I want to know the situation of the plane!”<br/><br/>“My parents and children are all on this flight. You don’t give us any explanation and tell me to calm down? How am I supposed to calm down? If anything happens to them, I’ll make sure the airport suffers too.”<br/><br/>“Give us an explanation!”<br/><br/>“The airport must give an explanation to the relatives of the passengers!”<br/><br/>Gao Yanxin shivered as he pulled out his cellphone, then he couldn’t even hold it anymore.<br/><br/>He looked at Secretary Li and said, “Secretary Li, call my Dad!”<br/><br/>He couldn’t get any information on that flight now, but his father had connections in the company, perhaps they could get the inside story as soon as possible.<br/><br/>The cousin was the pearl in the palm of both Xia and Gao families. He didn’t dare to imagine the impact it would have on them if anything happened to her, especially the elderly on both sides. They might not be able to bear the heavy blow of losing their granddaughter.<br/><br/>Secretary Li supported Gao Yanxin and comforted him, “Young Master, don’t worry, I’ll call the President right now.”<br/><br/>After saying that, Secretary Li called Gao Jianjun.<br/><br/>Gao Jianjun’s face changed after receiving the call from Secretary Li, and he said, “I know. I’ll call the airline right away. Keep an eye on Xin er.”<br/><br/>After hanging up with Secretary Li, he immediately called a familiar person at the airline.<br/><br/>“Director Li…”<br/><br/>After hearing the other party’s words, Gao Jianjun’s face became more and more serious, ugly, and worried.<br/><br/>“Okay, I understand, Director Li. Thank you!”<br/><br/>After hanging up, Gao Jianjun hurried out of his office. Secretary Cui saw his boss’s face looking wrong and immediately asked, “Mr. President, what’s happened?”<br/><br/>Gao Jianjun calmed himself down and ordered Secretary Cui, “Secretary Cui, come with me to the airport. You drive!”<br/><br/>He couldn’t drive in that state.<br/><br/>Secretary Cui didn’t ask what had happened and went obediently to fetch the car from the underground parking lot..\t\t\t\t\t\t</div>", "images": {}, "success": true}