{"id": 195, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14300041.html", "title": "Chapter 195 - Chapter 195: Chapter 195: The Flower Was Stolen (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 195 - Chapter 195: Chapter 195: The Flower Was Stolen (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 195: Chapter 195: The Flower Was Stolen (First Update)<br/><br/>Translator: 549690339<br/><br/>After the bomb crisis was resolved and Captain Qian Li was apprehended, all the staff in the airport heaved a sigh of relief.<br/><br/>If the bomb had exploded before the airplane took off, the entire airport might have been affected, and the resulting casualties and property damage would have been immeasurable.<br/><br/>The general manager of Ganjiang City Southern Airlines, Yang Fei, led the company’s leadership team onto the plane to personally thank Xiao Jinli.<br/><br/>“Little friend, we are deeply grateful to you!” As soon as Yang Fei boarded the plane, he shook hands with Xiao Jinli, his face full of excitement. “If it hadn’t been for you, the consequences don’t bear thinking about.”<br/><br/>Especially considering that Qian Li planned to detonate the bomb after the airplane had taken off, potentially causing damage in densely populated cities.<br/><br/>“Little friend, you’re incredibly brave and clever!”<br/><br/>“Indeed, little friend, you are extremely brave.”<br/><br/>As Xiao Jinli faced the leaders’ expressions of gratitude, she responded calmly, “I just did what needed to be done, you shouldn’t thank me too much!”<br/><br/>The leaders were speechless. What does she mean by saying she only did what she needed to do?<br/><br/>She is only in her early teens, right? What does an average ten-year-old understand? The usual response to a bomb threat would be fear.<br/><br/>But not her. Not only was she not afraid, but she also found the bomb and, due to sheer luck, cut the right wire.<br/><br/>Xiao Jinli seemed slightly embarrassed by the praise. “I…I need to get to Licheng, when is the next flight?”<br/><br/>Yang Fei laughed, “We are currently arranging it. The next flight should be in about three hours. Little friend, come and rest in our company. Once the flight is confirmed, I will personally escort you onto the airplane.”<br/><br/>“Thank you, sir!” Xiao Jinli expressed her gratitude.<br/><br/>When she got to the cockpit and returned to her seat on the plane, she discovered that the plant she had left on her seat was gone.<br/><br/>Xiao Jinli searched the entire plane but couldn’t find it.<br/><br/>Seeing Xiao Jinli’s perplexed expression, Yang Fei asked in confusion, “Child, what are you looking for? Did you lose your luggage?”<br/><br/>Xiao Jinli shook her head and said, “Not my luggage, my pot of flowers is missing.”<br/><br/>“Flowers? What flowers?” Yang Fei asked, puzzled. “You brought flowers on the plane?”<br/><br/>“A pot of tea flowers,” Xiao Jinli nodded. “A Seven Color Tea Flower. I planned to sell this flower at the Licheng Flower Market.”<br/><br/>“Seven Color Tea Flower?” Someone asked, not really understanding. “Is there such a flower?”<br/><br/>“Yes!” Xiao Jinli explained, “The Seven Color Tea Flower, also known as the Rainbow Angel, is famous for its luxurious and striking beauty, clearly defined color, and lush green leaves. It is prized by the world’s horticulturists and is one of the world’s most valuable plants.”<br/><br/>The people who didn’t understand about flowers were speechless.<br/><br/>Someone swallowed hard and asked, “So, little friend, how much is your pot of flowers worth?”<br/><br/>Xiao Jinli said, “At the world horticultural auction market, the most expensive Rainbow Angel is priced at 38 million M coins. While my Rainbow Angel is not the most expensive one, its estimated value is also over two million. Although, the flower I was carrying only had a few buds, but if you know about flowers, you can tell the type of tea flower from the buds.”<br/><br/>So, the person who took the flower pot, might be someone who knows a bit about flowers.<br/><br/>Hearing about a flower worth over two million, everyone’s faces changed.<br/><br/>Yang Fei immediately said seriously, “Little friend, rest assured, we will do our best to get your tea flower back.”<br/><br/>He immediately directed his subordinates, “Xiao Li, check the surveillance footage right away. Not too much time has passed, as long as we find out who took the flower, we should be able to find them quickly!”<br/><br/>The person who took the flower pot must have been a passenger on this plane.<br/><br/>A two-million-dollar flower.<br/><br/>This child was openly carrying a flower worth two million dollars, she was too conspicuous.<br/><br/>Wait a minute, was this child traveling alone on the plane?<br/><br/>“Little friend, are you traveling alone?” Yang Fei asked. “Where are your parents?”<br/><br/>Xiao Jinli nodded, “Yes, just me.”<br/><br/>“So, you, a child, carrying a flower worth two million dollars, are going to Licheng alone?” Yang Fei twitched his mouth, not sure what to say. “Are your parents really okay with that?”<br/><br/>Xiao Jinli shook her head, “Not really. My dad and my brother wanted to accompany me, but I wouldn’t let them.”<br/><br/>“So, just because you didn’t want them to accompany you, they just let you go to Licheng alone?” Hearing this, Yang Fei didn’t know what to say.<br/><br/>The child’s parents were really trusting.<br/><br/>“Yes.” Xiao Jinli said, “My parents saw me off when I boarded the plane, and there will be someone to pick me up when I get off. So, there’s nothing to worry about.”<br/><br/>That might be true, but nobody was expecting this child to find a bomb on the plane, averting a major disaster.<br/><br/>“Ah, I almost forgot to let my uncle know I’m safe,” Xiao Jinli suddenly remembered, then took out her cell phone to find it was dead.<br/><br/>“Could I borrow a cell phone from someone? The flight was delayed, and I’m worried my cousin and uncle will worry. I want to let them know I am safe.”<br/><br/>At this point, Yang Fei laughed and said, “Haha, just now, Licheng called to inquire about a passenger named Xiao Jinli, and I told them that the guest was handling something with us. Don’t worry, Director Li will definitely tell your uncle that you are safe.”<br/><br/>Xiao Jinli immediately sighed with relief, saying, “Thank you!”<br/><br/>“Child, if anyone should be thanking anyone, it’s all of us at the company thanking you,” Yang Fei laughed. “Later on, we will discuss within the company how to thank you and what reward to give you.”<br/><br/>Xiao Jinli shook her head, “That’s not necessary!”<br/><br/>“It’s necessary, it’s necessary!” Yang Fei insisted, “Child, if you hadn’t noticed something was wrong, the consequences of this incident would have been unthinkable.<br/><br/>You saved the lives of everyone on the plane and saved our company from a huge loss. This thank you and reward are absolutely necessary. If you weren’t underage, we’d also like to thank you in the newspapers and the media, while also apologizing to the broader passenger community!<br/><br/>Qian Li, exploiting his job to carry a bomb onto the plane, was our negligence. This lesson must serve as a potent reminder.”<br/><br/>After hearing those words from the leader, Xiao Jinli immediately felt a sense of admiration towards him.<br/><br/>This leader is open-hearted and able to admit his mistakes and take responsibility.<br/><br/>Usually, when a company experiences such a significant error, they would try to cover it up. Exposing it would be a great scandal for the company.<br/><br/>Xiao Jinli’s eyebrows danced, and she wore an innocent and adorable smile, declaring, “Uncle, you are a good leader!”<br/><br/>Yang Fei was startled for a moment, then burst into laughter, “Haha, I should be the one grateful for your compliment, little friend.”\t\t\t\t\t\t</div>", "images": {}, "success": true}