{"id": 191, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298312.html", "title": "Chapter 191 - Chapter 191: Chapter 191: There Is A Bomb On The Airplane (Part 1)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 191 - Chapter 191: Chapter 191: There Is A Bomb On The Airplane (Part 1)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 191: Chapter 191: There is a Bomb on the Airplane (Part 1)<br/><br/>Translator: 549690339<br/><br/>Xiao Jinli wasn’t sure if she was unlucky or lucky.<br/><br/>As soon as she boarded the plane, her ears picked up a distinct “tick-tock” sound.<br/><br/>This sound was all too familiar to her from her previous life.<br/><br/>Her expression immediately changed, and she said to Little Zhi in her mind, “Little Zhi, there’s a bomb on the plane. Find out where it is and who brought it on board.”<br/><br/>Even though she was human now and could escape into her space if the plane exploded, how would she explain this later?<br/><br/>Moreover, there were so many innocent people on the plane that she had to save them no matter what.<br/><br/>There was still time before the plane took off.<br/><br/>Upon hearing about the bomb, Little Zhi was also startled and began searching for its location.<br/><br/>After a moment, he said, “Master, the bomb is in the cockpit, right by the captain’s seat.”<br/><br/>Xiao Jinli was astonished, “How can this be?”<br/><br/>If the bomb was in the cockpit and right by the captain’s seat, then the answer was that the captain had brought the bomb on board.<br/><br/>“I am now certain and sure that the bomb was brought on by the captain.<br/><br/>Furthermore, I noticed a hint of fanaticism and determination in his eyes.” Little Zhi reported to Xiao Jinli, “Master, the captain intends to bury everyone on the plane in space. What should we do now?”<br/><br/>If the bomb needed to be connected to the internet to explode, Little Zhi would definitely destroy the network without hesitation, preventing the explosion. Xiao Jinli quickly calmed down and said, “Let me think first!”<br/><br/>If she told the flight attendants directly that there was a bomb on the plane and that the captain had brought it, she would be called crazy and not be believed,<br/><br/>especially since she was a child.<br/><br/>“Master, it would be best to resolve this before the plane takes off. Otherwise, even if the bomb is defused, having a captain with an unstable mentality could still be a major disaster.”<br/><br/>Xiao Jinli checked the time, the plane would take off in ten minutes.<br/><br/>She went to the galley and found the chief flight attendant.<br/><br/>“Elder sister, I’m afraid to be alone on the plane. Can I stay with you?” Xiao Jinli said innocently, like a ten-year-old child.<br/><br/>The chief flight attendant saw such a lovely and pretty little girl and couldn’t help but like her. She said, “Of course. But little friend, the plane is about to take off, and we must be seated in our seats. And I also need to serve other passengers. How about I escort you back to your seat?”<br/><br/>Xiao Jinli waved to the chief flight attendant and said, “Sister, I want to whisper something to you. It won’t take long!”<br/><br/>The chief flight attendant was curious about what the child wanted to say and leaned in with a smile, “What do you want sister to say?”<br/><br/>Xiao Jinli said, “Sister, I’ll tell you a secret. My ears are very sensitive, and when I boarded the plane, I heard a tick-tock sound, um, like it’s coming from the front of the plane.”<br/><br/>The chief flight attendant didn’t take it seriously and laughed, “What tick-tock sound? You must have heard it wrong.”<br/><br/>Xiao Jinli appeared very anxious, grabbed the chief flight attendant’s sleeve, and said fearfully and nervously, “Sister, I didn’t hear it wrong. I’ve heard this tick-tock sound on TV before, um, it’s like the sound of a bomb. Sister, you must believe me.”<br/><br/>Seeing Xiao Jinli’s expression, the chief flight attendant still couldn’t believe the child’s words. She comforted her, “Little friend, you must have heard it wrong. It should be something else on the plane making that sound. How could there be a bomb on the plane? Little friend, the plane is about to take off, so I’ll take you to your seat now.”<br/><br/>However, Xiao Jinli could see that the chief flight attendant didn’t believe her, and her face looked even more anxious. She said even more urgently, “Sister, you must believe me! You have to believe me! No, I need to prove to you that I’m not lying!”<br/><br/>With that said, without waiting for the flight attendant and others to react, she immediately ran towards the cockpit.<br/><br/>The chief flight attendant’s face changed drastically, and she shouted, “Little friend, stop! Stand still!”<br/><br/>Xiao Jinli skillfully dodged all obstacles and quickly reached the cockpit.<br/><br/>The captain and co-pilot, sitting in the cockpit, did not expect a child to run in. Before they could react or scold the child, she ran to the captain’s seat, pushed his head forward, and rushed underneath the seat.<br/><br/>The co-pilot looked dumbfounded at the child’s move.<br/><br/>However, as a co-pilot, they had been trained to handle emergencies calmly.<br/><br/>But before he could scold the child, he saw her come out from under the seat with something in her hands, her face changed dramatically, and she stood up abruptly.<br/><br/>How could he not recognize that item?<br/><br/>The fact that he recognized it was what shocked him the most.<br/><br/>Xiao Jinli held the bomb and asked with a puzzled and confused expression, “Uncle, what is this? I heard this thing making a tick-tock sound earlier, which made me very scared and uneasy, so I went straight to look for it. Uncle, what is this?”<br/><br/>As the chief flight attendant and the others rushed to the cockpit, they saw Xiao Jinli holding the bomb, her face full of confusion and innocence.<br/><br/>When the chief flight attendant and others saw the bomb, their faces and expressions changed dramatically.<br/><br/>Especially the chief flight attendant, she never thought that the child’s words were all true.<br/><br/>As Xiao Jinli held the bomb, wanting to take a closer look, Co-pilot Hua Shengyu’s face became serious and said, “Child, don’t move, don’t touch it.” Xiao Jinli immediately stopped moving!<br/><br/>Just as she looked back at the captain and saw him rubbing his head and trying to stand up, she quickly and unintentionally stretched out her leg, pushing him down again and crashing him into the nearby control panel.<br/><br/>“Bang!”<br/><br/>The captain’s eyes flashed with anger.<br/><br/>The co-pilot and chief flight attendant and others watched Xiao Jinli’s movements with bated breath.<br/><br/>The chief flight attendant then said worriedly, “Captain!”<br/><br/>Xiao Jinli looked terrified and nervously said, “Sister, I’m so scared of him, he…<br/><br/>he is a bad guy!”<br/><br/>“What did you say?” Bi Shengyu asked in shock, “Captain is a bad guy?”<br/><br/>He just heard the child say that she heard the sound and felt very scared and uneasy, so she came running to find the object.<br/><br/>Now she’s saying the captain is a bad guy, this…<br/><br/>Bi Shengyu asked, “Child, why do you say the captain is a bad guy?<br/><br/>Xiao Jinli shook her head and said, “I don’t know, but this uncle gives me a very bad, disgusting feeling, and I don’t like him!”<br/><br/>Everyone,<br/><br/>“Uncle, what is this object in my hand?” Xiao Jinli looked at the bomb in her arms and asked, “Why is it making a tick-tock sound that scares people? How was it brought on board?”\t\t\t\t\t\t</div>", "images": {}, "success": true}