{"id": 194, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14300040.html", "title": "Chapter 194 - Chapter 194: Chapter 194: Father And Son Anxious (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 194 - Chapter 194: Chapter 194: Father And Son Anxious (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 194: Chapter 194: Father and Son Anxious (Second Update)<br/><br/>Translator: 549690339<br/><br/>When Gao Jianjun arrived at the airport, he saw his son looking pale and weak, slumped in a chair.<br/><br/>As soon as he saw his dad, his tears instantly flowed down, looking very helpless, and said, “Dad, cousin…cousin… will she be in any trouble?”<br/><br/>Gao Jianjun immediately reassured him, “Son, don’t worry. I just called Director Li of the airline company. He told me that the accident happened before the plane took off, not after it was in the air. So, Jinli is still safe.”<br/><br/>Boarding the plane doesn’t mean it has already taken off.<br/><br/>Hearing his dad’s words, Gao Yanxin’s eyes brightened up, and he said, “Dad, is everything you said true? Cousin won’t be in any trouble, right?”<br/><br/>Gao Jianjun nodded and said, “Yes.”<br/><br/>“But why can’t we get in touch with cousin?” Gao Yanxin still said worriedly, “Not only can we not get in touch with cousin, but it seems that the family members of other passengers can’t get in touch with their relatives either. Many people are now making a fuss.”<br/><br/>Gao Jianjun said, “Director Li told me that there was indeed a sudden accident before the plane took off, but everyone was safe. They just moved those people to a safe area, and they should be able to contact them soon.”<br/><br/>Just as Gao Jianjun finished speaking, he suddenly heard someone shouting excitedly, “Wife, wife, is that you? Are you and our daughter okay? That’s great. Oh, it’s really because of the weather delay, okay, I get it now. Oh, your next flight is four hours later, all right. All right, I got it. You and our daughter take care. Yeah…”<br/><br/>Then, one after another, people received calls from their relatives.<br/><br/>“Dad, Dad, is that you guys? You’re alright, that’s really great. Yeah, all right, I got it, then you guys be careful!”<br/><br/>“Son, you’re all right? Wuu… that’s great. We were so scared when we heard the flight was delayed. All right, I’ll wait for you here, you be careful!”<br/><br/>Hearing that all the relatives called to report their safety, many people were overjoyed and in tears!<br/><br/>The two hours of waiting had been too torturous, and everyone had fallen into deep fear, fearing the news of the plane crash and the death of their family members.<br/><br/>Now, they found out it was just a false alarm, and their mood felt like they were going from the ground to the sky in an instant.<br/><br/>Father and son Gao Yanxin and Gao Jianjun looked at each other, and both took out their cellphones, then said in unison, “I’ll call!”<br/><br/>Gao Jianjun put down the phone and said, “All right, you can call!”<br/><br/>Secretary Li and Secretary Cui exchanged glances, their eyes seemed to say, “Didn’t expect the young master to love that cousin so much.”<br/><br/>Gao Yanxin took out his cellphone and called Xiao Jinli, but unexpectedly, there came a cold female voice from the other side, “I’m sorry, the number you dialed has been switched off!”<br/><br/>Thinking he had dialed the wrong number, Gao Yanxin found the correct number and called again.<br/><br/>“I’m sorry, the number you have dialed has been switched off.”<br/><br/>Gao Yanxin, whose face had turned better, turned pale again, and anxiously said, “Dad, you try calling cousin too! Why is cousin’s phone off?”<br/><br/>Secretary Li chimed in to comfort him, “Young Master, don’t be nervous! It’s normal to turn off the phone before boarding a plane! Maybe cousin forgot to turn it on now!”<br/><br/>Gao Yan Xin shook his head and said, “No, you guys don’t know my cousin. Even if she did turn off her phone, if nothing happened, she would definitely turn it on as soon as possible and call us to report her safety.”<br/><br/>Secretary Cui said, “Maybe her phone’s out of battery!”<br/><br/>“Even if the phone is out of battery, she would borrow a phone to call us and report her safety!” Gao Yanxin said.<br/><br/>Secretary Li and Secretary Cui,<br/><br/>What on earth is going on?<br/><br/>Gao Jianjun also didn’t know what was happening. He thought for a moment and said, “I’ll call Director Li again and ask him to help inquire about your cousin’s situation.”<br/><br/>Gao Jianjun picked up the phone and called Director Li again.<br/><br/>“Director Li, my niece is on this flight. Now, all the family members at the airport are able to contact their relatives, but I can’t contact my niece. Can you please help me call and ask the staff on the other side about her situation? Yeah, her name is Xiao Jinli! All right, thank you so much, I really appreciate it!”<br/><br/>After hanging up the phone, Gao Jianjun felt uneasy inside.<br/><br/>It didn’t make sense that others could contact their relatives, but his Jinli had her phone switched off.<br/><br/>Everyone was waiting for Director Li’s call.<br/><br/>About ten minutes later, Gao Jianjun’s phone rang.<br/><br/>But these ten minutes seemed like a century-long wait to father and son Gao Jianjun.<br/><br/>Hearing the phone ringing, Gao Jianjun’s heart jumped, wanting to answer but was afraid to.<br/><br/>Secretary Li said, “President, do you want me to answer it?”<br/><br/>“No need, I’ll do it myself!” Gao Jianjun shook his head and said.<br/><br/>He then picked up the phone, “Director Li, um…”<br/><br/>Next, no one knew what Director Li had said on the phone, but Gao Jianjun’s eyes were getting brighter and brighter, he looked more excited and agitated. With red eyes and a choked voice, he said, “All right, um, I got it!”<br/><br/>After a while, he hung up the phone.<br/><br/>Then, looking at his son who was all tensed up, he immediately hugged his shoulders, and excitedly said, “Son, Jinli is all right. She’s fine; she just has something to deal with at the airline company.”<br/><br/>Hearing that his cousin was safe, Gao Yanxin immediately relaxed.<br/><br/>“Wuu… It’s so good that cousin is fine, wuu… it’s so good, I was so scared, so scared!”<br/><br/>If he lost such a smart, beautiful, and cute cousin, he really didn’t know what to do.<br/><br/>“All right, it’s fine now, don’t cry!” Gao Jianjun comforted him, “A big man crying doesn’t look good!”<br/><br/>“Yeah, yeah, I didn’t cry! I’m just too happy!” Gao Yanxin said while wiping away his tears.<br/><br/>Secretary Li and Secretary Cui, “…” The young master is indeed still a child.<br/><br/>But it also shows how good the relationship is between the young master and his cousin.<br/><br/>Both secretaries were looking forward to the appearance of that cousin.<br/><br/>Hearing that Xiao Jinli was safe and sound, both father and son relaxed.<br/><br/>Once the mood had somewhat calmed down, Gao Yanxin asked, “Dad, what’s Jinli doing with the airline company?”<br/><br/>Gao Jianjun shook his head and said, “I’m not sure. We’ll ask when we see Jinli. Don’t worry, your cousin is someone who can do big things. She’s smart, resourceful, and capable; she won’t have any problems.”<br/><br/>Gao Yanxin nodded and asked, “Then Dad, why did Cousin come this time?”<br/><br/>Gao Jianjun said, “It seems like she grew a Seven Color Tea Flower and came here to sell it!”<br/><br/>“Ha, Seven Color Tea Flower?!” Secretaries Li and Cui were surprised, “President, is it really a Seven Color Tea Flower?” They knew the value of the Seven Color Tea Flower.<br/><br/>“Yes, it’s indeed a Seven Color Tea Flower!” Gao Jianjun nodded.\t\t\t\t\t\t</div>", "images": {}, "success": true}