{"id": 198, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344258.html", "title": "Chapter 198 - Chapter 198: Chapter 198: Unlucky Flower Thief (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 198 - Chapter 198: Chapter 198: Unlucky Flower Thief (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 198: Chapter 198: Unlucky Flower Thief (Second Update)<br/><br/>Translator: 549690339<br/><br/>On his way home, Xiao Wanshan learned about the flight delay of the flight Xiao Jinli was on from his sister-in-law and immediately sensed that something was wrong.<br/><br/>He quickly called Xiao Jinli, but her cellphone was switched off.<br/><br/>“Husband, what happened? Why do you look so upset?” Xiao’s mother asked in confusion.<br/><br/>Xiao Wanshan did not hide the truth from his wife, saying, “My wife, please be prepared. Something might have happened to Jinli.”<br/><br/>“What?” Hearing the news, Xiao’s mother was almost fainting, anxiously asking, “Husband, what happened? Did something happen to the airplane?”<br/><br/>Both of them personally saw Xiao Jinli get on the plane.<br/><br/>There was no problem before boarding, which means the problem occurred after boarding.<br/><br/>If there’s no accident on the plane, that’s fine; but if there is, it’s a big deal.<br/><br/>Xiao Wanshan said, “My sister called me, telling me that Jinli’s plane is delayed! But how could that be possible? We personally sent Little Jinli on the plane, how could it be delayed in such a short time?”<br/><br/>“Let’s go, let’s go! We need to go to the airport right now!” Xiao’s mother couldn’t wait any longer, wanting to know the situation at the airport.<br/><br/>“Alright, sit tight, and we’ll head back to the airport now!” Xiao Wanshan tried to stay calm, “Wife, a flight delay doesn’t necessarily mean that something will happen to Jinli. Don’t you remember that she’s been very lucky since she was a child, and bad things rarely happen to her? She’s our Lucky Star, protected by the God of Fortune, so she’ll be fine.”<br/><br/>Xiao’s mother didn’t know what to think, she just wanted her daughter to be safe. She nodded and said, “Right, our Jinli is a Lucky Star, blessed by the God of Fortune. She’ll be fine. Even if something happens, she’ll still be safe.”<br/><br/>“Yes, so we need to stay calm right now, okay?” Xiao Wanshan kept comforting his wife and himself, “Let’s go to the airport first.”<br/><br/>As Xiao Wanshan’s couple was nearing the airport, they received a call from Xiao Jinli.<br/><br/>Seeing the caller ID, Xiao Wanshan couldn’t contain his excitement, telling his wife, “Wife, it’s a call from Jinli!”<br/><br/>Xiao’s mother grabbed the phone and asked anxiously, “Jinli?”<br/><br/>Xiao Jinli laughed and said, “Mom, it’s me. I’m fine, don’t worry!”<br/><br/>“Great, as long as you’re fine!” Xiao’s mother nodded in both tears and relief: “Wu wu, as long as you’re fine! Just now, your mom was really scared. But I know my daughter is a Lucky Star, and nothing bad will happen to her.”<br/><br/>Xiao Jinli nodded, “Yes, I am a Lucky Star, and I have the God of Fortune’s protection. Mom, don’t worry about Dad and me, I’m doing well.”<br/><br/>Xiao Wanshan asked from the side, “Jinli, where are you now? Your mom and I are coming to find you!”<br/><br/>Xiao Jinli said helplessly, “I’m in General Manager Yang’s office at the airline company. Mom and Dad, please come here directly later.”<br/><br/>“Okay, your mom and I will be there soon. Don’t go anywhere,” Xiao’s father instructed.<br/><br/>“Alright, I’ll wait for you!” Xiao Jinli nodded.<br/><br/>After hanging up the call from her parents, Xiao Jinli took a deep breath.<br/><br/>Xiao Zhi immediately mocked her from the side, “Hehe… Master, I don’t know if your luck is good or bad. The first time you take a flight, you encounter such a dangerous situation. When your parents come, I’m afraid they won’t let you fly alone anymore.”<br/><br/>Xiao Jinli said, “That just means that the people on the plane are lucky to have me.”<br/><br/>Because she was on the plane, the disaster was avoided.<br/><br/>If she hadn’t come on the flight, the safety of the passengers onboard would be uncertain.<br/><br/>Xiao Zhi laughed, “Hehe, you do have a point. So, you are your own Lucky Star, but their savior!”<br/><br/>But the incident of the captain carrying a bomb onto the plane would definitely be kept confidential by the airline, as it would affect the company’s credibility.<br/><br/>Thankfully, the only people present at the time besides Xiao Jinli were the Co-pilot, four special police officers, and two bomb disposal experts.<br/><br/>Actually, since even the special police and bomb disposal experts were there, everyone would definitely speculate.<br/><br/>But of course, that was none of her business.<br/><br/>“Ah, Master, the tea flowers were recovered so quickly.” Xiao Zhi instantly knew the whereabouts of the tea flowers through the internet data.<br/><br/>Xiao Jinli was slightly surprised, “So fast? How long has it been?”<br/><br/>Xiao Zhi said, “Hmm, they stole the tea flowers more than an hour ago, and we found out about it half an hour later. So, right now, it’s just been an hour.”<br/><br/>“So, after more than an hour, the person who stole the tea flowers hasn’t left the city yet?” Xiao Jinli asked.<br/><br/>If he had left the city, it would definitely have taken more effort to recover them.<br/><br/>Xiao Zhi said, “Because when persuading the passengers on board the plane, the flower thief quickly disembarked and left the airport, hastily calling for a taxi to the suburbs. But he seems to be unlucky. He got on the first taxi, but his car broke down. When it started working again, the taxi broke down once more. Then he took a second taxi, which only traveled a short distance before breaking down again.”<br/><br/>Xiao Jinli, “Well, continue!”<br/><br/>“When he took a third taxi, it collided with someone else’s car. Then, he gave up on taking a taxi and boarded a bus heading to the suburbs. But not long after he got on the bus, there was a pervert on the bus harassing a woman. The bus suddenly became chaotic, and it had to be stopped. The passengers handed the pervert over to the Yamen officials.”<br/><br/>Xiao Jinli, “…” This guy is really unfortunate.<br/><br/>“In and out of all those cars, more than an hour has been wasted. By the time the government officials found him, the bus had already arrived at the Yamen office, and he was still clueless.” Xiao Zhi laughed, “Haha, this unlucky guy! The car arrived at the Yamen office, and he didn’t even know it.”<br/><br/>Xiao Jinli was curious, “So the bus went directly to the Yamen office? What happened?”<br/><br/>“Well, after we reported the case and the police started investigating, they found him on that particular bus. To prevent him from escaping midway, the Yamen officials contacted the bus driver and had the bus taken directly to the Yamen office. Then, that unlucky guy just walked right into the trap. Oh, no, he fell into the net on his own.”<br/><br/>Xiao Jinli sighed softly, “Sigh, he wasn’t supposed to be so unlucky. But who told him to steal my things? Were my things so easy to take? Now, he’s brought all the bad luck on himself. Hehe…”<br/><br/>After she finished sighing, there was a knock on the door.<br/><br/>She looked around and saw no one, so she called out, “Come in!”<br/><br/>When she saw the visitor, Xiao Jinli raised her eyebrows in surprise. Oh, it turned out to be a familiar face.<br/><br/>“Ah, Director Luo?” Xiao Jinli pretended to be surprised, “What brings you here?”\t\t\t\t\t\t</div>", "images": {}, "success": true}