{"id": 197, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344256.html", "title": "Chapter 197 - Chapter 197: Chapter 197: Master, You Have Degenerated (Part 1)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 197 - Chapter 197: Chapter 197: Master, You Have Degenerated (Part 1)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 197: Chapter 197: Master, You Have Degenerated (Part 1)<br/><br/>Translator: 549690339<br/><br/>The chief flight attendant was confused, “If his wife asked him not to fly the plane, why would she scold him at home for being useless? Even his son considers him a disgrace, and his parents look down on him for being a failure? This doesn’t make any sense.”<br/><br/>“Yeah, this doesn’t make any sense at all.” Bi Shengyu was puzzled, “Even if his wife and children wanted to persuade him not to fly, they shouldn’t have insulted him like that, right? Any husband or father subjected to such verbal abuse by their wife and children wouldn’t be able to take it, right?”<br/><br/>Yang Fei shook his head and said, “So what the hell is going on? It was clearly his family who asked not to let him fly the plane. Insulting Old Qian like this, it’s no wonder he couldn’t take it anymore.”<br/><br/>Bi Shengyu took a deep breath, his face looking angry, and said, “Hmph, Old Qian’s family should bear a lot of responsibility for this accident!”<br/><br/>Yang Fei said with a somber face, “We must investigate this thoroughly! If it was the insults from Old Qian’s family that drove him to the extreme, then his family must be held responsible!”<br/><br/>Even if they can’t be legally held responsible, they will definitely be held morally accountable.<br/><br/>“Hmph, in the future, if we encounter such things again, it’s better to be open and honest to avoid misunderstandings! Our company ended up being blamed on all sides, leading to a huge misunderstanding.” Yang Fei slammed his fist on his office table, “This time we were lucky to have Jinli help us solve this serious crisis. But we cannot always be so lucky.”<br/><br/>The chief flight attendant and Bi Shengyu,<br/><br/>After Yang Fei finished speaking, someone came to report, “General Manager Yang, Qian Li’s family is causing a commotion.”<br/><br/>The reporter used the word “cause a commotion,” meaning that they were being unreasonable in handling the situation.<br/><br/>“Hmph, causing a commotion? It’s already good enough that I haven’t gone after them, and now they dare to make trouble!” Even Yang Fei, with his good temper, got angry at this point, “Hmph, I want to see what qualifications they have to cause a scene as Old Qian’s family members.”<br/><br/>Then he turned to Xiao Jinli with a smile, “Little one, take a rest in my office. I’ll go out and see what’s going on.”<br/><br/>Xiao Jinli nodded.<br/><br/>Bi Shengyu and the chief flight attendant also followed him out.<br/><br/>After all, they were both witnesses on site when the incident happened.<br/><br/>After they left, Xiao Jinli hooked the corner of her mouth and asked, “Xiao Zhi, don’t you think it’s getting more and more interesting?”<br/><br/>Xiao Zhi rolled his eyes in mid-air, looking somewhat speechless, “Master, I think you are regressing. You find such a small matter interesting? If you are really bored, you can do something earth-shattering, it’s not like you can’t handle it.”<br/><br/>Xiao Jinli was also speechless, “I managed to take down the bomb, saved so many people, and prevented huge property losses. Isn’t that a big deal? What qualifies as earth-shattering then?”<br/><br/>“Heh, you are now content with staying safe and being a salted fish. You dare to call such small and opportunistic actions a big thing?” Xiao Zhi mocked, “Master, what am I to say about you?”<br/><br/>Xiao Jinli listened to Xiao Zhi’s words, constantly rolling her eyes, then coldly snorted, “Humph, I just want to be a salted fish. What’s wrong with that? I’ve had enough of that kind of life in my previous life. In this life, all I want to do is protect those who need protecting. As for changing the world or history, I don’t feel like doing it, and I don’t have the ambition for it now!”<br/><br/>Upon hearing this, Xiao Zhi simply said, “Alright, if you want to be a salted fish, then I’ll be one too. As long as you don’t regret it, I’ll always be by your side!”<br/><br/>Then he asked again, “Master, shall we go and watch the commotion now?”<br/><br/>Xiao Jinli shrugged her shoulders and said, “What’s so exciting about this kind of commotion? It’s just a bunch of troublemakers. Now I’ll just lean back on the sofa and have a good rest. Wait for my pot of tea flowers to return!”<br/><br/>Xiao Zhi said, “You mean the guy who stole the tea flowers? Of all the people to steal from, he chose you. Hmph, he’s destined to fail!”<br/><br/>Even if the Yamen officials didn’t step in to track them down, as long as the tea flower thief used a phone or computer to connect to the internet, Xiao Zhi would be able to track them down.<br/><br/>That pot of tea flowers was carefully cultivated by her master for several months, just waiting to be sold at a high price. Of course, it won’t be cheap for someone else to take it.<br/><br/>Xiao Zhi said again, “I’ll mourn for the tea flower thief for three seconds!”<br/><br/>If caught, he would definitely be severely punished! It was something worth two million, not twenty thousand.<br/><br/>“By the way, Master, do you want to give your uncle a call and personally report that you’re safe?” Xiao Zhi reminded her, “Even though they heard that you are safe, they won’t be at ease until you report it personally!”<br/><br/>Xiao Jinli looked at her charging phone and nodded, “Okay, now that my phone has power, let’s call them to let them know I’m safe.”<br/><br/>Then, Xiao Jinli unplugged her phone and made the call.<br/><br/>“Jinli, is that you?” As soon as Gao Jianjun saw the caller ID, he hadn’t even had a chance to speak, when his wife snatched the phone from him and asked anxiously.<br/><br/>“Auntie, it’s me. I’m fine, don’t worry!” Xiao Jinli said, “Just now my phone ran out of power, so I couldn’t report to you in time. I’m very sorry!”<br/><br/>“Wuuu… As long as you’re safe, everything’s fine. You really scared us. Do you know when we got the news, our whole bodies went soft, fearing something might have happened to you. Wuuu… You’re so terrifying.” Ji Yuzhu cried like a child.<br/><br/>At the time, she was in class at school. When she finished, she called her son to ask if he had received Xiao Jinli, who said there was a plane delay.<br/><br/>Plane delays were a normal occurrence, so she didn’t think much of it.<br/><br/>But who would have thought when she called her brother-in-law to inform him of the plane delay, he told them that they had seen Xiao Jinli board the plane with their own eyes, so how could it be a plane delay at this time?<br/><br/>A plane delay would definitely be announced in advance, not after passengers board the plane.<br/><br/>So, this kind of plane delay must have been due to something they didn’t know happening on the plane.<br/><br/>After that, she called her husband Gao Jianjun to find out the situation while hailing a taxi, going straight for the airport.<br/><br/>“Okay, Auntie, I’m okay now, don’t cry.” Xiao Jinli consoled, “It’s just an accident. Isn’t it normal for a plane to be delayed due to weather conditions?”<br/><br/>“Where’s normal!” Ji Yuzhu cried while wiping away her tears, “A plane delay would have been announced beforehand. There’s no such thing as notifying passengers after they’ve boarded the plane. But as long as you’re safe, that’s all that matters. Jinli, quickly call your parents and let them know you’re safe. They’re all rushing to the airport now.”<br/><br/>“Alright, Auntie, I know. I’ll call my mom and dad now, and hang up first.” Xiao Jinli’s face became serious as she hung up the phone.\t\t\t\t\t\t</div>", "images": {}, "success": true}