{"id": 193, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298320.html", "title": "Chapter 193 - Chapter 193: Chapter 193: Cutting The Blue Wire, Crisis Averted (First Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 193 - Chapter 193: Chapter 193: Cutting The Blue Wire, Crisis Averted (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 193: Chapter 193: Cutting the Blue Wire, Crisis Averted (First Update)<br/><br/>Translator: 549690339<br/><br/>They thought Bi Shengyu’s words could persuade Qian Li, who had already gone mad.<br/><br/>After all, in the eyes of outsiders, Qian Li was a good man who loved his wife, cherished his children, and respected his parents.<br/><br/>Who would have thought that after hearing Bi Shengyu’s words, Qian Li’s expression became more and more agitated.<br/><br/>He roared, “What do you know? Just because the company doesn’t want me anymore, my wife scolds me for being a loser, insists on divorcing me, and my son is ashamed of me. My parents dislike me because I’m the least successful among my brothers.”<br/><br/>Bi Shengyu,<br/><br/>Xiao Jinli, The hit from family was indeed heavier than that from the outside world.<br/><br/>No wonder people either go mad in silence or explode in silence.<br/><br/>So, the co-pilot’s persuasion seemed to pour oil on the fire.<br/><br/>Xiao Jinli sighed lightly in her heart, it seemed that it was up to her to step in.<br/><br/>Xiao Jinli showed a frightened, nervous, yet brave side, and said courageously, “Uncle Pilot, we know that you are not a bad person, you just went astray. You have resentment in your heart, and you just want to vent.<br/><br/>But Uncle Pilot, don’t you think your previous happiness was an illusion, a dream? Or is your happiness really built only on your identity as a captain? Uncle Pilot, please think about it.”<br/><br/>After hearing Xiao Jinli’s words, Qian Li was momentarily stunned.<br/><br/>Yeah, was his previous happiness a lie?<br/><br/>He began to recall the scenes of his wife cooking soup for him with her hands and taking care of him wholeheartedly, his child admiring him from childhood as the sky hero, and his parents giving him all the living expenses from his brothers.<br/><br/>Xiao Jinli, taking advantage of Qian Li’s stun, gave Bi Shengyu a glance, signaling him to snatch the remote controller in Qian Li’s hand.<br/><br/>Bi Shengyu understood and slowly approached Qian Li. However, Qian Li quickly came to his senses, with a wary expression, and shouted, “Bi Shengyu, what do you want to do?”<br/><br/>Sweating coldly, Bi Shengyu calmly said, “Brother Qian, can you put down the remote controller in your hand? It’s too dangerous!”<br/><br/>Upon hearing his words, Xiao Jinli thought to herself, “Oh no!”<br/><br/>As expected, once Qian Li heard his words, he was instantly irritated again.<br/><br/>He raised the remote controller and roared, “Bi Shengyu, who the hell are you to tell me to let go of the remote controller? It’s all your fault! If it weren’t for you, the company wouldn’t have thought about wanting me to give away the captain’s position, or even let me leave the company. Bi Shengyu, today I’ll drag you down to die with me!”<br/><br/>Suddenly, the bomb in Xiao Jinli’s hand started making a “beeping” sound, and the numbers were dropping fast, even Xiao Jinli was startled.<br/><br/>She shouted at Bi Shengyu, “Don’t bother with him anymore, it’s too late! Is there a pair of scissors? We can only take the risk now!”<br/><br/>Bi Shengyu reacted and said loudly, “No, there are no scissors on the plane!”<br/><br/>At this moment, the door of the cockpit opened, and three or four special police officers rushed in along with two bomb disposal experts.<br/><br/>However, when they saw the countdown on the bomb, which showed only a few dozen seconds left, their faces changed dramatically.<br/><br/>Xiao Jinli reacted quickly and shouted, “Give me the scissors, and you all get out of here!”<br/><br/>“No!”<br/><br/>Whether it was Bi Shengyu or the special police officers, they all refused adamantly.<br/><br/>How could they possibly leave a child to face the bomb alone?<br/><br/>At the same time, they were moved by this child.<br/><br/>The bomb disposal expert immediately stepped forward, took out a specialized tool, and was about to cut a wire when Xiao Jinli’s face changed, and she shouted urgently, “Not this wire, it’s the blue one! It has to be the blue one!”<br/><br/>The bomb disposal expert looked at her and reassured her, “Little friend, don’t be afraid, we are professionals, and this bomb must be cut on the red wire!”<br/><br/>“No, it’s the blue wire, Uncle, you have to believe me!” Xiao Jinli said nervously, “I have good luck, and I’m always right when I say something.”<br/><br/>Seeing that the bomb disposal expert wasn’t listening to her, she became desperate, hugged the bomb, dodged the red wire, and cut the blue wire.<br/><br/>Everyone saw the wrong wire being cut, and their expressions changed dramatically. In their hearts, they all thought, “My life is over!”<br/><br/>But they couldn’t blame this child.<br/><br/>The child found the bomb, hugged it, and told everyone to leave. She was already very brave.<br/><br/>After cutting the blue wire, there were only a few seconds left on the countdown. Everyone closed their eyes and counted in their hearts, “Five, four, three, two, one!”<br/><br/>The “beeping” sound from the bomb immediately stopped.<br/><br/>Stopped… It stopped!<br/><br/>When everyone realized what had happened, they opened their eyes and looked at the bomb, only to find that the numbers had reached 00, but the bomb hadn’t exploded.<br/><br/>“Haha, it stopped! It didn’t explode!”<br/><br/>“Haha, that’s great! It didn’t explode!”<br/><br/>“It really was the blue wire. Little friend, you’re amazing, smart and brave!”<br/><br/>It was proven that the blue wire indeed should have been cut.<br/><br/>If they had followed the bomb disposal expert’s guess and cut the red wire, the consequences would have been…<br/><br/>Thinking about this, everyone felt cold sweat on their backs!<br/><br/>Qian Li, holding the remote controller, cried out hysterically, “How could it not have exploded?”<br/><br/>At this moment, the special police officers reacted and restrained Qian Li without the worry of the bomb.<br/><br/>Qian Li was quickly controlled.<br/><br/>The chief flight attendant, with red eyes and tears streaming down her face, walked over to Xiao Jinli, hugged her, and cried out, “Child, thank you so much, thank you.”<br/><br/>If it weren’t for her discovering the bomb and running to the cockpit with it, and insisting on cutting the blue wire, everyone present would have been reduced to ashes.<br/><br/>Bi Shengyu, a grown man, also started crying after surviving this ordeal.<br/><br/>They had been on this flight, carrying out numerous tasks, and with each flight, they had actually prepared to face death.<br/><br/>But he never expected that the biggest danger would come from the person closest to him.<br/><br/>Who could have imagined that a captain would bring a bomb onto the plane, intending to kill everyone on board?<br/><br/>If it weren’t for this child, the terrifying consequences would have been unimaginable.<br/><br/>The special police captain gave Xiao Jinli a thumbs up and praised, “Child, you are amazing! Holding the bomb and staying calm, you saved everyone!”<br/><br/>The bomb disposal expert nodded and said, “Child, you are truly amazing. How did you know that the blue wire had to be cut for this bomb?”<br/><br/>He was puzzled.<br/><br/>They were professionals, and never thought that their judgment could be wrong, but a child saved them.<br/><br/>Xiao Jinli looked at them with innocent and ignorant eyes and said seriously, “I didn’t know whether to cut the red or blue wire. But I’ve always had good luck since I was little. When I’m in danger, I feel particularly anxious and uneasy. Then I follow my instincts to avoid these dangers.”<br/><br/>As she said this, she laughed innocently, “That’s why, in the village, everyone calls me Lucky Star, saying I’m a very lucky person, protected by the God of Fortune.”<br/><br/>Everyone, How does this sound so mysterious and divine?’\t\t\t\t\t\t</div>", "images": {}, "success": true}