{"id": 196, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344254.html", "title": "Chapter 196 - Chapter 196: Chapter 196: Behind Qian Li’S Extremism (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 196 - Chapter 196: Chapter 196: Behind Qian Li’S Extremism (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 196: Chapter 196: Behind Qian Li’s Extremism (Second Update)<br/><br/>Translator: 549690339<br/><br/>The disappearance of the tea flower was quickly clarified.<br/><br/>It turned out to be taken by a passenger on the plane.<br/><br/>That passenger was sitting right behind Xiao Jinli.<br/><br/>According to the surveillance cameras, the moment Xiao Jinli boarded the plane, he was clearly eyeing the flower she was holding with a keen interest.<br/><br/>Soon after, when Xiao Jinli sneaked to the cockpit while the chief flight attendant wasn’t paying attention, he first glanced around, then he fixed his gaze on the tea flower on Xiao Jinli’s seat.<br/><br/>Then the flight attendant announced that because of the weather condition, the plane could not take off and the passengers had to change flights. During the passengers’ commotion, the man grabbed his luggage, walked past Xiao Jinli’s seat, and took the opportunity to take the tea flower.<br/><br/>“General Manager Yang, the passenger’s name is Wu Jun. After taking the tea flower, he didn’t wait in our airport lounge for the next flight, but left the airport directly,” a subordinate reported to Yang Fei, “It seems that he knew the value of the flower, and that’s why he stole it. He has now left the airport, we may need to ask for the assistance of the local police to retrieve the flower.”<br/><br/>Yang Fei decisively said, “Then call the police!”<br/><br/>In fact, the police had already been called when it was found there was a bomb on the plane.<br/><br/>But the situation was serious, so what they sent was special police.<br/><br/>Yang Fei immediately took out his cellphone and made a call. After the call was connected, he said directly, “Director Luo, I need your help!”<br/><br/>Then he briefly introduced the situation, “Alright, thank you, Director Luo.”<br/><br/>Director Luo?<br/><br/>Xiao Jinli blinked, was it that Luo Sanbiao?<br/><br/>After hanging up the phone, Yang Fei said to Xiao Jinli, “Child, why don’t you rest in my office for a bit? I believe we should soon be able to find the person who took the tea flower. However, you were just startled. You should rest.”<br/><br/>Xiao Jinli didn’t refuse and followed Yang Fei to his office.<br/><br/>The flight attendants and co-pilots of this flight were both frightened. They were not suitable to continue the flight today, and they had to do a psychological evaluation to see if they had any psychological shadows.<br/><br/>Bi Shengyu and the chief flight attendant went to the General Manager’s Office with Xiao Jinli.<br/><br/>The whole thing was truly thrilling.<br/><br/>Now that Xiao Jinli’s precious flower pot is lost because of their crisis, they all wanted to accompany her, until the flower is found.<br/><br/>Upon arriving at the General Manager’s Office, the chief flight attendant poured water for Xiao Jinli and herself.<br/><br/>After taking a few sips of water to calm down, she couldn’t hold back her curiosity and asked, “Child, how is your hearing so exceptional? You could hear the sound of the bomb from such a distance? Is it a natural ability or did you train to acquire it?”<br/><br/>“We were trained too, but I didn’t hear the abnormal sound of the bomb even from this close distance,” Bi Shengyu said anxiously, “So, is it that your hearing is naturally exceptional?”<br/><br/>He was sitting right next to the captain’s seat, and the bomb was under the seat, but he still didn’t hear any abnormal sounds.<br/><br/>But this child was able to sense the unusual sound as soon as she got off the plane. Her hearing was astonishing, and not to mention it was in the midst of all the crowd’s noise.<br/><br/>Such a person with exceptional hearing is indeed a talented individual.<br/><br/>Xiao Jinli responded, “Yes, my hearing is exceptional. I can hear the buzz of a mosquito from several meters away!”<br/><br/>“Ha ha, no wonder.” the chief flight attendant laughed, and then asked in confusion, “But, don’t you find it annoying? With such exceptional hearing, any slight noise can disturb your brain, wouldn’t it affect your rest?”<br/><br/>“Indeed,” Bi Shengyu also asked, “Does it affect your sleep?”<br/><br/>Xiao Jinli shook her head and said, “Not at all. As the saying goes, ‘the mind is naturally cool when it’s calm.’ It applies to me too. As long as I am determined to block the external noise, those sounds naturally cannot be transmitted to my ears. So, it does not affect my rest.”<br/><br/>“Ha ha, you child, sometimes you don’t sound like a child at all when you talk!” the chief flight attendant joked, “Your words are full of wisdom.”<br/><br/>“You two, don’t disturb the child’s rest.” Yang Fei said with amusement, “She was just startled. She needs to calm down and rest well.”<br/><br/>“Alright, we understand!” the chief flight attendant replied, “Child, would you like to rest a bit and close your eyes? Don’t worry, your sis will wake you up when your tea flower is back.”<br/><br/>Xiao Jinli shook her head and said, “I’m fine. Although I was startled, I will quickly calm down. Well, I am not an ordinary child!”<br/><br/>The chief flight attendant and others, “…..”<br/><br/>True, this child is indeed extraordinary.<br/><br/>What child could remain composed while holding a bomb that could explode at any moment, and even manage to persuade the criminal?<br/><br/>Keep in mind, that was a bomb, not a firecracker!<br/><br/>The chief flight attendant sighed lightly and said, “Who would have thought that as a captain, he would carry a bomb onto a plane, pulling everyone on board to their deaths. I didn’t expect Captain Qian to have such an extreme personality.”<br/><br/>Generally speaking, someone with an extreme personality cannot fly a plane.<br/><br/>As the chief flight attendant finished speaking, Yang Fei and Bi Shengyu immediately frowned.<br/><br/>Not to mention the chief flight attendant, no one had expected that Qian Li would take this step.<br/><br/>Bi Shengyu asked in confusion, “General Manager Yang, Qian Li said this flight was his last one. Did he lose his position as a captain and was no longer allowed to fly? What happened?”<br/><br/>“So, just because of this, he chose the extreme path?” Yang Fei asked with a furrowed brow.<br/><br/>Bi Shengyu shook his head and said, “No. he mentioned that his wife demeaned him for being cowardly. His son viewed him as an embarrassment, and his parents thought he was worthless. So, for a moment, he freaked out and went to the extreme!”<br/><br/>“Damn it!” Yang Fei cursed, becoming agitated, “What the hell is going on!”<br/><br/>Bi Shengyu and others, “…..” Yang is acting unusual.<br/><br/>In a hurry, Bi Shengyu asked, “General Manager Yang, what is going on?”<br/><br/>After cursing a couple times, Yang Fei took a deep breath. Yet, he still looked grim.<br/><br/>“It wasn’t the company’s decision to stop him from flying; it was a request from his family!” Yang exclaimed.<br/><br/>“What, it was a request from his family?” Bi Shengyu and the chief flight attendant were surprised, “What happened?”<br/><br/>Yang Fei explained, “A while ago, Qian Li’s wife contacted the company and mentioned that her husband Qian Li was having some health issues. He needed to get checked out, but he kept making up excuses about being busy with work. As long as he has health issues, the company would definitely ask him to go for medical tests. Therefore, in frustration, his wife came to the company and asked them to keep Qian Li from flying.”<br/><br/>Bi Shengyu and the chief flight attendant,<br/><br/>They too wanted to curse.<br/><br/>What the hell is this.\t\t\t\t\t\t</div>", "images": {}, "success": true}