{"id": 199, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344259.html", "title": "Chapter 199 - Chapter 199: Chapter 199: See You Again, Director Luo (One More)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 199 - Chapter 199: Chapter 199: See You Again, Director Luo (One More)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 199: Chapter 199: See You Again, Director Luo (One More)<br/><br/>Translator: 549690339<br/><br/>Luo Sanbiao was holding a pot of flowers and looked surprised to see Xiao Jinli here. He asked, “Xiao Jinli, what are you doing here?”<br/><br/>Yang Fei, who followed behind, walked in, looked at Luo Sanbiao, then at Xiao Jinli, and smiled, “Director Luo, do you kids know each other?”<br/><br/>Xiao Jinli laughed and said, “We had a brief encounter before!”<br/><br/>Luo Sanbiao also laughed and said, “Indeed, we had a brief meeting before! I didn’t expect to meet you again after half a year. Student Xiao, what are you doing with General Manager Yang?”<br/><br/>“Ha ha…” Yang Fei laughed loudly, “This little friend is the owner of the flower in your hand!”<br/><br/>“Oh, Student Xiao, this flower is yours?” Luo Sanbiao received the report, but did not know that the owner of the pot of flowers was a child.<br/><br/>“Yeah, it’s mine!” Xiao Jinli nodded.<br/><br/>“Where are your parents?” Luo Sanbiao frowned slightly and asked seriously, “Aren’t your parents with you?”<br/><br/>He remembered last time it was also a conflict between his child and Jinli’s friends. Afterward, no adults showed up to deal with it.<br/><br/>A child now holding a pot of flowers worth two million?<br/><br/>It might not be too reassuring for the child’s parents.<br/><br/>Xiao Jinli immediately knew what he was thinking and said a bit helplessly, “My parents will be here soon!”<br/><br/>If the trip to Licheng went smoothly, her parents would not have worried at all.<br/><br/>However, after this accident, her parents would definitely accompany her to Licheng, no matter what, and she wouldn’t be able to refuse.<br/><br/>Hearing that Xiao Jinli’s parents would arrive soon, Luo Sanbiao handed her the pot of tea flowers and then asked curiously, “Where are you taking this flower?”<br/><br/>“To Licheng to sell!” Xiao Jinli said, “That place is a gathering spot for the world’s flower markets, and you can get a better price!”<br/><br/>Luo Sanbiao and Yang Fei,  Hearing a child going so far just for money, they felt the child was somewhat worldly.<br/><br/>“What’s wrong? Did I say something wrong?” Xiao Jinli looked at their expressions and asked innocently.<br/><br/>Luo Sanbiao shook his head and said, “No. I just wonder how you, a child, would know that you can get a good price there?”<br/><br/>Xiao Jinli laughed and said, “I asked my uncle.”<br/><br/>She looked at the pot of flowers in her hand, showed a sincere smile, and said, “Director Luo, thank you for helping me find this pot of flowers.”<br/><br/>“Oh, speaking of gratitude, I should be the one thanking Director Luo.” Yang Fei laughed loudly, “If it wasn’t for you, child, trying to help us, this pot of flowers wouldn’t have been taken away by someone so easily.”<br/><br/>As the head of the Yamen, Director Luo knew what happened on the plane.<br/><br/>However, to protect the safety of the minor, the information reported was simply that a child saved everyone on the plane.<br/><br/>He didn’t expect the child to be Xiao Jinli.<br/><br/>From their first meeting, he knew that Xiao Jinli was not an ordinary child. At first, she didn’t fear power and taught his son a lesson, later even reminded him to educate his child properly. She was mature and calm, different from other children.<br/><br/>Now, she has used her calmness and wisdom to save everyone on the plane and prevent a disaster at the airport.<br/><br/>Director Luo smiled and said, “Student Xiao, actually, I should thank you. If it wasn’t for your reminder, my son would have committed a serious crime. Now, after more than half a year of training, my son is much more obedient than before and no longer does those domineering things.”<br/><br/>Xiao Jinli nodded, “The Young Master is not bad by nature, he’s just been spoiled by others. Now that he can correct his mistakes, that’s a happy and fortunate thing. Director Luo, congratulations!”<br/><br/>Listen to the child’s words, she sounds like an adult.<br/><br/>Director Luo laughed, “Ha ha, you talk like a little adult. But, my mischievous son being able to mend his ways is also thanks to you.”<br/><br/>As he said that, he paused for a moment and smiled, “Since we’re old acquaintances, don’t call me Director Luo, call me Uncle Luo. Uncle Luo still owes you a meal. Let me know when you have time so I can treat you.”<br/><br/>Xiao Jinli laughed and said, “I’m afraid that’ll have to wait until I return from Licheng.”<br/><br/>“Alright, I’ll wait for you. Do you still have Uncle Luo’s phone number? If not, you can write it down now,” Director Luo asked.<br/><br/>Xiao Jinli nodded, “I remember it!”<br/><br/>She had a good memory and never forgot what she saw.<br/><br/>Yang Fei, standing next to them and watching the two talking happily, smiled and interrupted, “Oh, child, if Director Luo owes you a meal, then I owe you one too. No, not just one meal, I owe you a lifetime of meals.”<br/><br/>As he said that, he thought and asked, “Child, you said your parents will be here soon, right?”<br/><br/>Xiao Jinli nodded.<br/><br/>“Then, let’s wait for your parents to come and I’ll treat you all to a meal at the Friendship Hotel. Director Luo, you can join us too,” Yang Fei smiled and said.<br/><br/>Friendship Hotel was the best hotel in Ganjiang City, a five-star hotel.<br/><br/>Director Luo was very curious about the parents that could raise such a brilliant and insightful child, so he nodded and said, “That would be my honor!”<br/><br/>“Ha ha, Director Luo, it’s my pleasure!” Yang Fei laughed loudly.<br/><br/>“Excuse me, is this the… Xiao Bao!” When Xiao Wanshan came to ask about the general manager’s office, he saw Xiao Jinli at a glance.<br/><br/>As soon as Xiao Wanshan and Xiao Mother saw Xiao Jinli, they rushed into the office without caring about the other people present, hugged Xiao Jinli and cried, “You child, you really scared us.”<br/><br/>From the moment they received Ji Yuzhu’s call until they saw Xiao Jinli, their hearts were in their throats. Later, they felt relieved when they heard she was safe, but they were still not completely at ease without seeing her personally.<br/><br/>Xiao Wanshan said, “You child, after you went through such a big incident, why didn’t you notify your mom and me right away? Do you know how worried and scared we were when we found out about the flight delay from your aunt? Even after you called to say you were safe, we still couldn’t rest easy.”<br/><br/>Xiao Jinli looked at her parents’ red-rimmed eyes and said immediately, “I’m sorry, Dad, Mom, my… my cellphone suddenly ran out of power. I forgot to call and report my safety when I had power to report to my uncle.”<br/><br/>Xiao Father,  It seems like she didn’t forget but did it on purpose, right?<br/><br/>The child was afraid that they would worry. If it weren’t for the aunt’s call, they wouldn’t have known about the incident.<br/><br/>Just as Xiao Wanshan was about to scold Xiao Jinli, Yang Fei smiled and said, “So, you two are the parents of Student Xiao. I’m the general manager, Yang Fei. It’s a pleasure to meet you!”\t\t\t\t\t\t</div>", "images": {}, "success": true}