{"id": 192, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14298316.html", "title": "Chapter 192 - Chapter 192: Chapter 192: Crisis (Part 2)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 192 - Chapter 192: Chapter 192: Crisis (Part 2)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 192: Chapter 192: Crisis (Part 2)<br/><br/>Translator: 549690339<br/><br/>After hearing Xiao Jinli’s words, the co-pilot quickly reacted and asked the chief flight attendant, “Have you alarmed anyone?”<br/><br/>The chief flight attendant finally reacted and said, “I’ll do it now!”<br/><br/>The co-pilot said, “I’ll contact the control tower. You and the others calm the passengers down; this flight will be delayed.”<br/><br/>The co-pilot arranged this without consulting the captain at all.<br/><br/>The chief flight attendant immediately assigned tasks to other flight attendants.<br/><br/>When Bi Shengyu suspected something was wrong with the captain, he looked at Xiao Jinli and said, “Kid, hold onto that thing and don’t move it. Walk over here carefully, and be very careful, understand?”<br/><br/>They must keep the child away from the captain; otherwise, what if the captain harms the child?<br/><br/>Xiao Jinli nodded, holding the bomb steadily, and walked towards the co-pilot.<br/><br/>For Xiao Jinli, it would take only a moment to dismantle the bomb, but she couldn’t be too conspicuous.<br/><br/>So she cleverly held the bomb, ensuring it didn’t collide with anything while moving.<br/><br/>When Xiao Jinli came over and Bi Shengyu saw the bomb in her hands, he finally sighed in relief.<br/><br/>It was a timer bomb.<br/><br/>Looking at the time, there were still fifteen minutes left.<br/><br/>Suddenly, the co-pilot realized—only fifteen minutes left?<br/><br/>Wasn’t the plane just recently airborne?<br/><br/>It had just taken off and hadn’t even reached cruising altitude.<br/><br/>If it exploded at that point, the entire plane would be reduced to ashes, and the flaming wreckage would undoubtedly fall somewhere.<br/><br/>If it fell into the sea or a desolate mountain village, it would be just an airplane explosion.<br/><br/>But if it fell into a densely populated city, it would be a devastating disaster.<br/><br/>Thinking of this, Bi Shengyu was covered in cold sweat.<br/><br/>Seeing the cold sweat on his face, Xiao Jinli innocently asked, “Uncle, is this a bomb?”<br/><br/>Bi Shengyu asked, “Child, how did you know this was a bomb?”<br/><br/>“I saw it on television!” Xiao Jinli said matter-of-factly, “Otherwise, why would<br/><br/>I feel frightened and uneasy when I hear this sound?”<br/><br/>Bi Shengyu,<br/><br/>“But, uncle, even if it’s a bomb, we shouldn’t be afraid.” Xiao Jinli comforted,<br/><br/>“I’ve been incredibly lucky since I was young, and people in the village call me Lucky Star. So, with me here, even if there’s a bomb, we’ll be safe.”<br/><br/>After hearing Xiao Jinli’s words, Bi Shengyu couldn’t help but smile and cry.<br/><br/>Bi Shengyu nodded and said, “Alright, today we’ll rely on our little Lucky Star to survive this ordeal.”<br/><br/>These words, of course, were meant to reassure Xiao Jinli.<br/><br/>As for luck, that was hard to say for him.<br/><br/>The chief flight attendant ran in and said, “I’ve called and reported the situation. A bomb disposal expert will arrive shortly.”<br/><br/>Bi Shengyu nodded and said, “Mhm, have the passengers been appeased?”<br/><br/>The chief flight attendant said, “We told them the weather was causing issues and we couldn’t fly, so they needed to change flights. Most of them obediently got off the plane, with only a few causing trouble. We forcibly dragged them off the plane. The company is now evacuating all passengers from the airport! ”<br/><br/>After all, there was a bomb on the plane, and they might not have time to dismantle it…<br/><br/>The co-pilot nodded and then said, “Chief flight attendant, you leave too, along with the other flight attendants. Evacuate immediately!”<br/><br/>“Brother Bi?” The chief flight attendant called out, “I’m not leaving. I’ll stay with you!”<br/><br/>“No, get out of here right away!” Bi Shengyu insisted, “It’s too dangerous here.<br/><br/>If the bomb… think about your parents and all your loved ones?” The chief flight attendant cried and said, “Wuu wuu, Brother Bi!”<br/><br/>“Go, leave now!” Bi Shengyu suddenly shouted.<br/><br/>“None of you will leave!” The captain suddenly got up, holding a remote controller in his hand. He turned around, revealing a bump on his forehead and blood at the corner of his mouth.<br/><br/>He wiped the blood from the edge of his lips and, seeing the blood on his hand, revealed a hideous and terrible smile. He said,<br/><br/>“I thought the explosion would happen mid-air. I didn’t expect that this stinky girl would ruin my plan. Hehe, that’s even better. As long as I press this controller, the entire airport will be destroyed in an instant with me.” Suppressing his anger, Bi Shengyu sternly asked, “Qian Li, why are you doing<br/><br/>“Hahaha, why?” Qian Li laughed maniacally, “Hahaha… Why? Because the company is being unfair to me!”<br/><br/>Bi Shengyu furrowed his brows and asked with some confusion, “What do you mean?”<br/><br/>Qian Li roared, “Do you know, this is my last flight as a captain? I’ve been working diligently in the company for over twenty years, flown planes for more than ten years, and have been a captain for three years. Now, they just say I can’t do it anymore.”<br/><br/>“Do you know how much I love this industry, and now they want to take away my beloved aviation profession? On what grounds? How is it different from killing my child or killing me? Since that’s the case, I’ll drag everyone on this flight to accompany me in death!”<br/><br/>“But, my plan was ruined by a child.” Qian Li glared ferociously at Xiao Jinli, “However, taking you all with me in death, I won’t be at a loss. Haha, you stupid girl, you can only blame yourself for meddling.”<br/><br/>With that, he shook the remote controller in his hand.<br/><br/>Immediately, the ticking of the bomb became louder, indicating the time was running out faster.<br/><br/>“Qian Li, calm down!” Bi Shengyu shouted, “If you don’t want to quit this industry, we can talk it out!”<br/><br/>“Shut up!” Qian Li roared, “Do you think I haven’t talked it through with company leaders? Do you know what they said to me?”<br/><br/>“They said I’ve been in the captain’s seat for too long, and it’s time to make room for others. Do you know who they want to give the position to?”<br/><br/>“Give it to you, Bi Shengyu? On what grounds? Why should I give you my captain’s seat? I don’t want to, so they won’t let me work anymore. On what grounds, Bi Shengyu? Just because your father is a company director? Huh!”<br/><br/>Bi Shengyu never expected Qian Li’s extreme behavior to arise from such a hidden reason.<br/><br/>“Hahaha, now I’m taking you, the future captain, with me. I’ll make them all regret it!”<br/><br/>With that, he shook the remote controller in his hand again, and the ticking became even louder, signaling that time was running out even faster. Bi Shengyu looked at the countdown – only three minutes left.<br/><br/>He had to get Qian Li to stop!<br/><br/>“Stop, Qian Li, don’t be impulsive. Think about your wife, your children, your parents. Do you want to be known as a villain for all eternity?” Bi Shengyu continued to appease, “If you really press it down, your parents will lose a son, your children will lose a father, your wife will lose a husband. Can you endure that along with your own pain, being pointed at by thousands of people?”<br/><br/>Qian Li, think calmly for a moment. Your wife is beautiful, your child is in university, and your parents are old..”\t\t\t\t\t\t</div>", "images": {}, "success": true}