{"id": 205, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344272.html", "title": "Chapter 205 - Chapter 205: Chapter 206: Being Looked Down Upon", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 205 - Chapter 205: Chapter 206: Being Looked Down Upon</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 205: Chapter 206: Being Looked Down Upon<br/><br/>Translator: 549690339<br/><br/>Ji Yuzhu was really angry.<br/><br/>Usually, she would dress up when going to the shopping mall.<br/><br/>Today, she came directly from school to the airport, and then to the shopping mall, wearing only light makeup and ordinary clothes. She didn’t expect to be looked down upon by others.<br/><br/>The waitress glanced contemptuously at the group and rolled her eyes. She casually said, “Yes, yes, yes, you can afford it. But it would take you, ordinary workers, a year’s salary to buy this dress. I’m thinking about you. It’s not worth your hard work for a year just to buy a single dress.”<br/><br/>Hearing the sarcastic words of the waitress, Ji Yuzhu’s face turned pale with anger. Seeing this, Gao Jianjun immediately tried to calm her down, saying, “Wife, calm down, calm down. We won’t stoop to her level.”<br/><br/>Ji Yuzhu took a deep breath and said angrily, “Are you blind, you waitress? Didn’t you see the big and small bags in our hands, each one costing tens of thousands of yuan? My stuff, totaling hundreds of thousands of yuan—I can absolutely afford one measly dress from your store. Go get your store manager. I’d like to ask them if, when doing business, they treat their customers with contempt and push them away.”<br/><br/>The waitress’s face changed instantly, and she looked very upset. She said, “Our manager isn’t here!”<br/><br/>Ji Yuzhu nodded angrily and said, “Fine, the manager isn’t here? Gao Jianjun, call their brand’s regional manager and ask them if they treat their customers with contempt too.”<br/><br/>When the waitress heard Ji Yuzhu’s words, her face showed even more disdain.<br/><br/>You bunch of bumpkins, can’t even afford a dress, yet you think you can actually contact the regional manager? Stop bluffing.<br/><br/>The waitress said coldly, “Go ahead and make the call.”<br/><br/>Ji Yuzhu was simply infuriated by the waitress’s attitude.<br/><br/>If it were just her alone, it would pass. But now, she’s brought her sister’s family along.<br/><br/>She took her sister’s family out to buy clothes just to receive such contemptuous treatment. How could she not be angry?<br/><br/>Gao Jianjun’s sharp eyes flashed a cold light, and he was about to dial the phone when Manager Li ran over.<br/><br/>He smiled and said to Gao Jianjun, “President Gao, I finally found you.”<br/><br/>Hearing the shopping mall’s Manager Li call him President, the waitress’s face changed again, and she thought to herself that perhaps he really was a rich man.<br/><br/>Only people from big companies would be called President.<br/><br/>Gao Jianjun nodded.<br/><br/>Manager Li saw that something was wrong and immediately asked, “Lady Gao, what happened?”<br/><br/>Ji Yuzhu said, “We wanted to look at this cheongsam, but this waitress not only had an attitude, but also mocked us for being unable to afford it. Humph, I was just about to have my husband call their brand’s regional manager to file a complaint.”<br/><br/>Seeing the situation, the waitress immediately apologized softly, “President Gao, Lady Gao, I’m sorry. It was my mistake. Please don’t call the regional manager.”<br/><br/>Ji Yuzhu snorted and said, “Hmph, you think you can just apologize after looking down on us? Husband, keep calling!”<br/><br/>If it was just her receiving such contemptuous treatment today, it would be one thing, but she absolutely could not allow her sister’s family to be treated with such discrimination.<br/><br/>Usually, she wouldn’t use her status to bully others, but today, she wanted to do just that.<br/><br/>The waitress’s face turned pale. She said with sincere apology, “I’m sorry, Lady Gao. It’s all my fault. It was I who looked down on you. I apologize to you. Please don’t call the manager, or I will lose my job.”<br/><br/>Working here, not only were commissions high, but she could also meet people from high-class circles. Maybe one day, some rich man would notice her and elevate her to the status of a wealthy wife.<br/><br/>So, she couldn’t afford to lose this job.<br/><br/>Ji Yuzhu had no intention of being soft-hearted. She said loudly, “Oh, now that you know our status, you finally admit your mistake. If we were really poor, wouldn’t we be insulted to death by you?”<br/><br/>Seeing that Ji Yuzhu was still being relentless, the waitress looked at Manager Li for help, then bit her lip and asked, “Lady Gao, what do you want me to do? Should I kneel down and beg you?”<br/><br/>With that, she was about to kneel down toward Ji Yuzhu.<br/><br/>Xiao Jinli noticed that people with cameras and cellphones were not far away, taking pictures and videos in their direction.<br/><br/>She knew that her uncle was quite a prominent figure in Licheng, and any negative news about him could become a disaster. For example, if a rich woman was reported to the media as bullying people and forcing a waitress to kneel down…<br/><br/>She immediately pulled Ji Yuzhu to the side and innocently said to the waitress, “Sister, why do you want to kneel down? If you kneel down, people who don’t know will think that my aunt is bullying you. But it was clearly you who looked down on us and mistreated us. All my aunt wants is a sincere apology, not for you to kneel down!”<br/><br/>Then, she pointed to the people taking pictures and videos not far from the counter and said, “Although we’re not afraid of being photographed, kneeling would still have a bad impact, right?”<br/><br/>Upon being reminded by Xiao Jinli, Ji Yuzhu and the others instantly turned and looked in the direction of the photographers, their faces changing.<br/><br/>Xiao Jinli pointed to the CCTV camera above and said, “Of course, if we’re really misunderstood, this place can vindicate us.”<br/><br/>Gao Jianjun immediately said to Manager Li, “Manager Li, I’m sorry, but I’ll have to get a copy of the surveillance footage.”<br/><br/>Manager Li said solemnly, “President Gao, Lady Gao, rest assured, the mall will definitely not spread any unfavorable rumors. I’ll make a copy of the surveillance video for you later!”<br/><br/>Then, he turned to the waitress and scolded her sternly, “What is the matter with your store? Don’t you know that customers are god? You dare to be arrogant to customers and consumers. Do you still want to do business? Where is Li Hong?”<br/><br/>Another waitress immediately said, “Our manager went out on an errand.”<br/><br/>Manager Li said, “When she comes back, tell her to visit me in my office!”<br/><br/>“Yes, Manager Li!”<br/><br/>Then, Manager Li accompanied with a smile, “Lady Gao, what would you like to buy? Whatever you fancy, I’ll pay for it today!”<br/><br/>As he said this, his heart bled.<br/><br/>He was a shopping mall manager, and although looking successful, his monthly salary was only several thousand yuan. The cheapest clothes in this store cost twenty or thirty thousand yuan.<br/><br/>Ji Yuzhu refused directly, “There’s no need for Manager Li to pay. Although our family isn’t particularly wealthy, we can still afford a few small pieces of clothing here.”<br/><br/>With that, she pointed to another waitress and said, “You serve us, and bring me that cheongsam!”\t\t\t\t\t\t</div>", "images": {}, "success": true}