{"id": 206, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344274.html", "title": "Chapter 206 - Chapter 206: Chapter 205: Changing Women Like Changing Clothes", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 206 - Chapter 206: Chapter 205: Changing Women Like Changing Clothes</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 206: Chapter 205: Changing Women Like Changing Clothes<br/><br/>Translator: 549690339<br/><br/>Manager Li returned to his office.<br/><br/>In his office, a man of medium height, clad in a black short sleeve shirt, was sitting on the sofa. This man was none other than Huang Mao, the guy who was with Zhu Lao Liu earlier.<br/><br/>“How’s the investigation?” Huang Mao asked nonchalantly.<br/><br/>Manager Li said, “That woman is Gao Jianjun’s relative. Although Gao Jianjun did not introduce her, I noticed some resemblance between her and Madam Gao, so she must be a blood-related relative of Madam Gao.”<br/><br/>Having said this, Manager Li carefully asked, “Third Brother, why are you investigating this woman?”<br/><br/>Huang Mao shot him a glance, slapped him on the back of his head, and said scornfully, “You dimwit, didn’t you notice the stunning beauty of that woman? Obviously, our Boss Zhu has taken a liking to her.”<br/><br/>Upon hearing this, Manager Li’s expression froze momentarily, he instinctively said, “Ah, Boss Zhu has taken a liking to her, but doesn’t he already have a woman by his side?”<br/><br/>“Does having a woman mean Boss Zhu can’t switch women?” Huang Mao said dismissively. “With his wealth and power, switching women is as easy as changing clothes. Is there anything wrong with wanting to change into a beautiful new set of clothes when the worn ones are old?”<br/><br/>Manager Li understood then. Still doubtful, he said, “But Third Brother, that woman is Gao Jianjun’s relative, isn’t it difficult to make a move on her? You know, if we really harm her, considering Gao Jianjun’s status in the business world of Licheng, it wouldn’t be easy for us to clean up the mess.”<br/><br/>“Who told you to do it forcefully?” Huang Mao was nearly angered to death. “If we can’t use force, can’t we use a softer approach? Boss Zhu has plenty of money. I don’t believe that woman wouldn’t be moved if enough money was thrown at her.”<br/><br/>Manager Li was bleak, “But Third Brother, Gao Jianjun is also wealthy. If that woman really likes money, wouldn’t Gao Jianjun give it to her?”<br/><br/>Hearing this, Huang Mao was on the verge of exploding. He said, “Yes, Gao Jianjun is wealthy, but why would he give it to those so-called relatives? Even though that woman is related to his wife, and he is quite famously devoted to his wife in the business circle, he can’t possibly be squandering money on the relatives from his wife’s side.<br/><br/>Didn’t you see just now how those so-called relatives were dressed so poorly? The clothes on them probably cost a few dozen yuan from a street stall. That woman didn’t even have decent jewelry on her. Clearly, they’re poor relatives. If Gao Jianjun was really generous with his relatives, would they be dressed so shabbily?<br/><br/>Furthermore, in this society, who dislikes having too much money? Gao Jianjun is rich, but if she could hitch herself to Boss Zhu, it would be a boon to her. Would he dare to offend Boss Zhu for those so-called relatives?”<br/><br/>When Manager Li heard this, it suddenly started to make sense. He then asked, “But Third Brother, how should we play it soft? Just now when I was investigating, it seemed like that woman’s husband and child were also there. It wouldn’t be easy to make a move.”<br/><br/>Hearing this, Huang Mao fell into deep thought. He said, “Given the incredibly attractive beauty of that woman, it’s likely that she isn’t from Licheng. If such a woman were to appear in Licheng, it would have caused quite a stir by now.” She might even have been kept by some noteworthy person.<br/><br/>He knows how many eyes were on that group of people the moment they set foot in the mall.<br/><br/>In this large mall, most of the people who usually come to shop are people with money and power, like those upper-class ladies, socialites, or men accompanying their ladies shopping.<br/><br/>If they play hardball, it would be to secretly kidnap her and then try to win over her heart with wealth.<br/><br/>If they play soft, well, it would be to talk directly to the woman, in reality, still trying to win her over with wealth.<br/><br/>Soft or hard, both are just about the strength of the approach.<br/><br/>While the two were lost in their thoughts, Zhu Lao Liu burst into the office and saw the two of them. Smilingly, he asked, “What are you two pondering over?”<br/><br/>“Boss!”<br/><br/>“Boss!”<br/><br/>The two of them yelled simultaneously.<br/><br/>Zhu Lao Liu went directly to the chair in front of the office table and sat down. He directly asked,” Third Brother, what’s the identity of that woman?”<br/><br/>Huang Mao replied, “Boss, that woman is Gao Jianjun’s relative. And, Boss, the man and child accompanying her are her husband and child!”<br/><br/>Zhu Lao Liu had never been with a married woman before.<br/><br/>Upon hearing the news, Zhu Lao Liu squinted his small eyes and his brows knitted together. A troubled look flashed in his eyes.<br/><br/>He muttered, “Married, huh?”<br/><br/>Manager Li and Huang Mao exchanged glances.<br/><br/>Isn’t that obvious? Despite her remarkable beauty, her age was apparent. She was clearly over thirty.<br/><br/>Of course, neither of them dared to say this out loud for fear of being beaten!<br/><br/>Zhu Lao Liu lightly tapped on the table. The “pom pom” sound made both men’s hearts jump, fearing that if he got angry, their skulls might be cracked open.<br/><br/>After a while, Zhu Lao Liu said to Manager Li, “Xiao Li, you go and tell Gao Jianjun, Zhu Lao Liu invites them to dinner!”<br/><br/>Manager Li was startled. Hesitantly, he asked, “Boss, this…?”<br/><br/>“Just go when I ask you to, stop being so slow!” Zhu Lao Liu ordered harshly.<br/><br/>“Yes, Boss!” Manager Li immediately replied.<br/><br/>When Manager Li left, Huang Mao carefully asked, “Boss, what are you…”<br/><br/>“Testing the waters!” Zhu Lao Liu replied coolly.<br/><br/>Huang Mao, What’s going on? He didn’t understand at all.<br/><br/>Seeing him look so bewildered, Zhu Lao Liu said irritably, “Enough, you wouldn’t understand even if I explained it.”<br/><br/>Xiao Jinli and her group had reached the sixth floor. Ji Yuzhu was excitedly choosing clothes for Xiao’s mother. “Sister, this, this purple cheongsam is very beautiful. You will look amazing in it.”<br/><br/>Xiao Jinli also brightened up when she saw the purple cheongsam and added, “Wow, this cheongsam is really beautiful, Mom, go try it on!”<br/><br/>Xiao’s mother looked at the slit of the cheongsam and said a little shyly, “Let’s forget about it. This cheongsam is too revealing.”<br/><br/>Ji Yuzhu laughed, “Hehe, Sister, you’re just too conservative. The slit on the cheongsam is to highlight the figure and show off the beautiful lines of the legs. It’s very fashionable. For a woman as beautiful as you, you’ll definitely stun everyone wearing a cheongsam. Let’s try it on.”<br/><br/>As she finished, she reached to grab the cheongsam.<br/><br/>But she was intercepted by a waitress, who also gave them a disdainful look.<br/><br/>The waitress looked at them and sneered, “If you’re not buying, don’t try it on. This cheongsam is very expensive, 58,000 yuan a piece. Can you afford it?”<br/><br/>The waitress’s limited experience only allowed her to notice their unassuming outfits and fail to recognize the high-quality dress Gao Jianjun was wearing.<br/><br/>Ji Yuzhu’s temper flared upon hearing this.<br/><br/>She retorted loudly, “Aren’t the clothes displayed here for sale? Does it matter whether they are sold to rich or poor people? And besides, which eye of yours saw that we couldn’t afford these clothes?”\t\t\t\t\t\t</div>", "images": {}, "success": true}