{"id": 201, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344264.html", "title": "Chapter 201 - Chapter 201: Chapter 201: Mother-Son Shenanigans (1St Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 201 - Chapter 201: Chapter 201: Mother-Son Shenanigans (1St Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 201: Chapter 201: Mother-Son Shenanigans (1st Update)<br/><br/>Translator: 549690339<br/><br/>Yang Fei and the others didn’t want to deal with Yang Ping’s moral kidnapping. He directly said to her, “I also have the video evidence of you family members asking Qian Li not to fly the plane. Should we confront each other about it? So, why did you suddenly turn against Qian Li when our company made the decision?”<br/><br/>At this point, he said angrily, “You should know that you are family. Hurtful words from family members are the most hurtful. Old Qian has been working diligently in the company for twenty years. In two more years, he could retire safely and truly enjoy his old age. But you family members, under the pretext of his poor health, asked the company not to let him fly the plane.”<br/><br/>Yang Ping’s son Qian Weimin angrily said, “We asked my dad not to fly the plane anymore, but we didn’t ask you to directly stop him from working, did we? And you made him give up his captain position to someone else?”<br/><br/>Yang Fei was amused by his words and said, “So, is this company your family’s? You ask him not to fly the plane on one side and then ask our company to keep him in the captain’s position on the other side?”<br/><br/>Bi Shengyu said angrily, “So, are your family members out of their minds? Is what you’re doing really for Old Qian’s good, or are you harming him? No, you’ve already harmed Old Qian. Old Qian was driven to extremes by you. Hmph, Old Qian is now a criminal, and no matter who you beg, it’s no use.”<br/><br/>Yang Ping and her son’s faces changed instantly, looking very angry but a hint of guilt flickered in their eyes. Xiao Jinli’s eyes narrowed slightly.<br/><br/>There was something off about this mother and son.<br/><br/>Xiao Jinli thought for a moment and said to Luo Sanbiao beside her, “Uncle Luo, lower your head, I want to whisper something to you!”<br/><br/>Luo Sanbiao raised his eyebrows and lowered his head while slightly laughing, “Alright, what do you want to tell your uncle?”<br/><br/>After Xiao Jinli whispered a few words to him, Director Luo’s expression changed slightly, his dark, sharp eyes narrowed and swept across the mother and son with a serious look.<br/><br/>Yang Ping and her son, who were angrily glaring at Yang Fei, naturally did not notice the two whispering to each other.<br/><br/>“Mmm, mmm…” Luo Sanbiao stood up and praised Xiao Jinli, “You, this little girl, are so observant at such a young age! I will arrange for someone to investigate immediately.”<br/><br/>In fact, without Xiao Jinli’s reminder, he had already noticed that there was something wrong with Yang Ping and her son.<br/><br/>It wasn’t just their guilty expressions and gazes, but their actions towards Qian Li that made him feel puzzled.<br/><br/>If it was puzzling, there must be a reason behind it.<br/><br/>Luo Sanbiao said to Yang Fei, “General Manager Yang, I have some important matters to attend to, so I will not accompany you to dinner.”<br/><br/>Yang Fei immediately said, “Director Luo, you have things to do, go ahead and take care of them first. We’ll have dinner another day!”<br/><br/>Luo Sanbiao then said to Xiao Wanshan and his wife, “Mr. Xiao, Mrs. Xiao, I’m sorry to leave you!”<br/><br/>Xiao Wanshan nodded, “Director Luo, go ahead with your work!”<br/><br/>After that, Luo Sanbiao hurriedly left, and before leaving, his sharp eyes swept over Yang Ping and her son.<br/><br/>Seeing this, Yang Fei’s brows slightly furrowed, and he said, “Mrs. Qian, you should go back. It won’t do any good for you to keep making a fuss like this.”<br/><br/>Then he said to Xiao’s father, “Mr. Xiao, Mrs. Xiao, let’s go, Shengyu and Xinyi are with us, let’s go together.”<br/><br/>Xinyi is the chief flight attendant, Tian Xinyi.<br/><br/>Ignoring Yang Ping and her son, the group left directly.<br/><br/>The mother and son kneeling on the ground couldn’t bear the pointing and whispering of the surrounding people and left in anger and shame.<br/><br/>Yang Fei took Xiao Wanshan and the others to the Friendship Hotel and entered a private room led by the waitress.<br/><br/>Yang Fei asked with a smile, “Mr. Xiao, Mrs. Xiao, Student Xiao, do you have any dietary restrictions?”<br/><br/>Xiao Wanshan shook his head, “We don’t have any dietary restrictions.”<br/><br/>Yang Fei nodded, then ordered two signature dishes and Buddha Jumps over the Wall, abalone, and several other expensive dishes. Afterward, he handed the menu to Xiao Wanshan and his wife and laughed, “Mr. Xiao, Mrs. Xiao, and Student Xiao, order whatever dishes you like, don’t be shy!”<br/><br/>Xiao Wanshan smiled and said, “It’s fine, Mr. Yang, whatever you’ve ordered is good.”<br/><br/>No matter how good the dishes are, they can’t compare to home-cooked meals.<br/><br/>After ordering, Yang Fei glanced at the well-behaved Xiao Jinli and then looked at Xiao Wanshan and said, “Mr. Xiao, Mrs. Xiao, how do you educate your children? She’s not only smart and clever but also obedient, sensible, calm, and resourceful. If I had a daughter like this, I would wake up laughing in my sleep.”<br/><br/>As Xiao’s father, he was very happy when others praised his daughter.<br/><br/>He proudly said, “I didn’t really teach her much, my daughter has always been sensible and obedient since she was a child. In the village, everyone praises my Xiao Bao, and everyone likes her. I’m very proud and happy to have a daughter like her.”<br/><br/>Yang Fei, He thought Xiao’s father would be more modest.<br/><br/>To be honest, having such a daughter would make any father proud, and he wouldn’t be modest, he would be proud.<br/><br/>But quickly, Xiao’s father directly asked, “Mr. Yang, can you tell me what exactly happened on the plane? Why is everyone praising my daughter?”<br/><br/>Xiao’s father and mother received Ji Yuzhu’s call and only knew that the plane was delayed, and their daughter just reported her safety.<br/><br/>But they didn’t know what happened on the plane.<br/><br/>Xiao’s mother also asked anxiously, “Xiao Bao, what on earth happened to you on the plane? Your dad and I saw you board the plane with our own eyes, right? Then we received your aunt’s call saying your plane was delayed. That almost scared the soul out of me. Thankfully, you are safe.”<br/><br/>Xiao Jinli said, “Dad, Mom, there were some minor incidents on the plane. But fortunately, it was more fear than danger.”<br/><br/>Xiao’s father asked seriously, “So, Xiaobao, what exactly happened?”<br/><br/>Just as Xiao Jinli was about to say something, Xiao’s father waved his hand and said, “Before coming here, that mother and son came to make trouble. Is it related to the accident on the plane? So don’t even think about hiding it from your mom and me!”<br/><br/>Xiao Jinli,  It seemed that it couldn’t be hidden.<br/><br/>Yang Fei, These parents are quite strict.<br/><br/>To be honest, he didn’t know the details of the accident on the plane.<br/><br/>Bi Shengyu and the chief flight attendant,<br/><br/>“Ahem…” Tian Xinyi unconcernedly looked at Xiao Wanshan and his wife and said, “Mr. Xiao, it’s like this. When Student Xiao got on the plane, she told us…”<br/><br/>Then, she recounted the details of what happened on the plane without any omissions.<br/><br/>There was no way for her to avoid it since she couldn’t fool Mr. Xiao with his intelligence.<br/><br/>Listening to her, Xiao’s father and mother’s faces turned pale and fearful, their expressions astonished and tense, their hearts pounding with fear!<br/><br/>Xiao’s mother, scared, tightly held her daughter.\t\t\t\t\t\t</div>", "images": {}, "success": true}