{"id": 203, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344268.html", "title": "Chapter 203 - Chapter 203: Chapter 203: (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 203 - Chapter 203: Chapter 203: (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 203: Chapter 203: (First Update)<br/><br/>Translator: 549690339<br/><br/>After everyone had lunch, they waited for the scheduled flight.<br/><br/>As the general manager, Yang Fei had many things to deal with due to this incident. So, he asked Bi Shengyu and Tian Xinyi to accompany Xiao Wanshan’s family of three until they were respectfully sent onto the plane.<br/><br/>Seeing the plane safely flying in the sky, Tian Xinyi patted her chest with lingering fear, saying, “I’m still scared to death today, my mood hasn’t calmed down yet.”<br/><br/>Bi Shengyu said, “With this state of mind, it seems you won’t be able to catch up with work for a while.”<br/><br/>Tian Xinyi said, “I will adjust as soon as possible. I’ve been working for over a decade and encountered various emergencies, such as turbulence in mid-air and changes in wind direction, which were thrilling experiences. But this time, the bomb incident was caused by someone we knew well, and the impact was too great.”<br/><br/>Bi Shengyu’s face was also serious, saying, “Yeah, who could have thought that Old Qian, who always worked diligently, would go to such extremes.”<br/><br/>He clenched his fists, with anger in his heart.<br/><br/>“At that time, I was sitting next to him but didn’t notice any abnormalities about him, not even hearing the sound of the bomb. If it were not for that child, we…”<br/><br/>Tian Xinyi nodded, “Yes, if it were not for that child, perhaps we would all be buried in a mid-air explosion by now.”<br/><br/>“At that time, the child got on the plane and said she heard a ‘tick-tock’ sound, which she said sounded like a bomb on Television. I didn’t believe it at first and thought she heard it wrong.”<br/><br/>“Who would have thought that she would dash into the cockpit in a blink of an eye and get the bomb from under the captain’s seat. You know, when I saw the bomb in the child’s hand, my whole body almost collapsed.”<br/><br/>Bi Shengyu also said, “Yes, when she pulled the bomb out from under the captain’s seat, I was completely dumbfounded. Fortunately, that child was calm and didn’t fiddle with it.”<br/><br/>Tian Xinyi looked at the blue sky, somewhat distracted, and said, “That child was braver and calmer than us adults!”<br/><br/>Bi Shengyu nodded, “Yes. You go back and rest well. In the next few days, the company will have a psychological expert assess our mental quality. We need to be prepared! From now on, don’t think too much, just rest well.”<br/><br/>Tian Xinyi nodded her head.<br/><br/>Then, the two of them went their separate ways, each to their own mothers.<br/><br/>Licheng Airport<br/><br/>After receiving Xiao Wanshan’s phone call, Gao Jianjun said to his wife and son, “Sister and brother-in-law are coming with Jinli this time.”<br/><br/>Ji Yuzhu finally regained a bit of calm and nodded, “Well, with my sister and brother-in-law accompanying Jinli, I feel much more at ease.”<br/><br/>Speaking of this, she paused and said, “Who could have imagined that Jinli would encounter such a thing the first time she went on a long trip. Fortunately, she is a fortunate child with a great destiny and good luck, and she safely survived this disaster.”<br/><br/>Gao Jianjun held his wife’s hand and said with a smile, “Jinli is a very lucky child, and she has had good luck since she was young. In the face of any danger, it will all retreat and turn into safety.”<br/><br/>Ji Yuzhu nodded, “Yes, Jinli has been a little lucky star since she was young.”<br/><br/>Gao Yanxin gradually calmed down and then nodded, “Yes, my cousin is a lucky star.”<br/><br/>Gao Jianjun then said to the two secretaries, “Secretary Li, Secretary Cui, you can go back first!”<br/><br/>The emotions of the two secretaries also fluctuated and finally, they breathed a sigh of relief.<br/><br/>The two secretaries nodded and said, “Alright, Mr. President, Madam, and Young Master, we’ll go back first.”<br/><br/>Gao Jianjun’s family of three found a cafe nearby to rest and wait.<br/><br/>When it was more than two o’clock, the family of three went to the airport again to pick up their relatives.<br/><br/>“Elder Aunt, elder uncle, Cousin, we are here!”<br/><br/>At the exit, Gao Yanxin saw the three people from a distance and called out.<br/><br/>As soon as they came out, Gao Yanxin tightly hugged Xiao Jinli and finally put down his heart, saying, “Cousin, you really scared me to death. You almost scared my soul away. Fortunately, you are lucky and safe.”<br/><br/>Xiao Jinli was always breathless when hugged by this cousin, but this time she didn’t say anything. Holding a pot of flowers in her arms, she felt squeezed, so she apologized, “I’m sorry, Cousin, I made you worry!”<br/><br/>Ji Yuzhu saw Xiao Jinli’s face turn red from her son’s hug, so she slapped him on the back and said, “Stinky boy, hurry up and let go of your cousin. Don’t you know how strong you are? Look how red your cousin’s face turned.”<br/><br/>Gao Yanxin immediately let go of Xiao Jinli, scratched his head embarrassedly, and laughed, “Cousin, I’m sorry, I forgot that I’m strong.”<br/><br/>Xiao Jinli laughed and said, “It’s okay!”<br/><br/>Ji Yuzhu hugged Xiao Jinli again, her eyes red, her voice choked, “You child really scared me to death. Fortunately, you are lucky, and you are safe.”<br/><br/>Xiao Jinli could only apologize again, “I’m sorry, Aunt, I made you worry!”<br/><br/>Gao Jianjun said, “Alright, as long as we are safe, let’s go home.”<br/><br/>Xiao Wanshan said, “Jianjun, we came in a hurry and didn’t prepare anything. Now, we need to buy some toiletries and clothes.”<br/><br/>Ji Yuzhu laughed and said, “No need to buy toiletries, we have new ones at home. Just buy a few sets of clothes. The shopping mall is not far from here. Let’s have a look. Husband, why don’t you take brother-in-law home first, and I’ll go with my sister.”<br/><br/>Xiao Wanshan shook his head, “Let’s all go together. Just buy two sets of clothes for a change.”<br/><br/>Gao Yanxin said, “Mom, let’s go together. I’ll carry the bags behind you.”<br/><br/>Then, they all went to the shopping mall.<br/><br/>Licheng is even more economically developed than Ganjiang City, and the shopping malls are more luxurious and prosperous.<br/><br/>Ji Yuzhu took everyone to the shopping mall and went directly to the brand clothing counter.<br/><br/>Xiao’s mother hesitated a little when she saw the prices of these clothes, “Bamboo, are these clothes too expensive?”<br/><br/>A skirt was priced at twenty-eight thousand, and a set of sleepwear was eight thousand eight hundred…<br/><br/>Ji Yuzhu laughed and said, “Not expensive, not expensive at all! Sister, for a woman as naturally beautiful and outstanding as you, ordinary clothes can’t match you. This time you come to Licheng, have a good time, and of course, you have to buy some good clothes.”<br/><br/>Xiao’s mother laughed and said, “Just you and your sweet talk.”<br/><br/>Xiao Jinli also nodded on the side, “Mom, this skirt is really beautiful. If you wear it, you will definitely be nationally stunning.”<br/><br/>Xiao’s mother said with a smile, “Am I really that beautiful?”<br/><br/>“Of course!” Xiao Jinli smiled, “If you don’t believe me, just ask Dad!”<br/><br/>Xiao Wanshan nodded, “Your mother is the most beautiful, even without this skirt, she is nationally stunning.”<br/><br/>Everyone,\t\t\t\t\t\t</div>", "images": {}, "success": true}