{"id": 207, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344276.html", "title": "Chapter 207 - Chapter 207: Chapter 207: Invited To A Meal (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 207 - Chapter 207: Chapter 207: Invited To A Meal (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 207: Chapter 207: Invited to a Meal (First Update)<br/><br/>Translator: 549690339<br/><br/>Ji Yuzhu bought seven or eight qipaos in one go, worth more than two hundred thousand, and specifically asked for a new waitress to serve them. So naturally, the sales performance belonged to her.<br/><br/>The offended waitress looked on, showing a very annoyed expression, and she felt a lot of regret in her heart.<br/><br/>For these more than two hundred thousand, just taking a commission would give her tens of thousands of pieces. It was supposed to be her performance, but now it all flew away and took advantage of Zhou Mo, the cheap person.<br/><br/>Mother Xiao looked at the four qipaos in her hand and said somewhat speechlessly, “It’s enough to buy one qipao. Why buy so many?”<br/><br/>Ji Yuzhu smiled and said, “Sister, you look so good in a qipao, you look beautiful and elegant. You should wear more of them, of course you need to buy a few more, we can afford it!” She deliberately bit the last sentence and glanced at the waitress with a hint of contempt.<br/><br/>Mother Xiao and others,<br/><br/>Mother Xiao knew her sister was doing this out of anger, so it was not easy for her to refuse, “Well, we’ll buy them.”<br/><br/>Xiao Jinli smiled and said, “Mom, you really look beautiful in a qipao. If you don’t believe me, you can ask Dad, right, Dad?”<br/><br/>Xiao Wanshan immediately nodded his head, “Yes, wife, you are really beautiful in a qipao. But no matter what clothes you wear, you’re always beautiful!” His wife is always beautiful at any time.<br/><br/>After buying the qipaos, Ji Yuzhu said, “Let’s go to the children’s area and buy some clothes for Jinli!”<br/><br/>Xiao Jinli said, “Auntie, I don’t need to buy it. I brought clothes from home.”<br/><br/>At this moment, Gao Yanxin said, “Cousin, since everyone else is buying, you should definitely buy two just to be fair.”<br/><br/>Ji Yuzhu pinched Xiao Jinli’s little cheeks and laughed, “Our Jinli is so pretty and cute that no matter how many clothes we buy for her, it’s not enough. Let’s go to the children’s area!”<br/><br/>The men carried the bags, while the three women walked in front.<br/><br/>Seeing that they were about to leave, Manager Li promptly came forward and said, “President Gao, Boss Zhu would like to invite you all for a meal. What do you think?”<br/><br/>“Boss Zhu?” President Gao frowned and asked with an uncertain expression, “He wants to invite us for a meal?”<br/><br/>Manager Li nodded, “Yes! Boss Zhu said he wants to invite you and your family for dinner!”<br/><br/>Ji Yuzhu frowned, “Boss Zhu, Zhu Lao Liu?”<br/><br/>“Yes!” Manager Li nodded.<br/><br/>“No!” Ji Yuzhu directly refused.<br/><br/>Although she was a teacher, Zhu Lao Liu’s reputation was well known and impressive.<br/><br/>As for why, she often heard some students at school mention it.<br/><br/>It was said that Zhu Lao Liu had risen from being an insignificant little gangster to a fearsome character nowadays.<br/><br/>It was said that he was ruthless and cruel.<br/><br/>It was said that he was loyal and valued brotherhood, treating his brothers like hands and feet, and women like clothes.<br/><br/>And so on…<br/><br/>Anyway, for Ji Yuzhu, the reputation was not good.<br/><br/>Hearing Lady Gao’s direct refusal, Manager Li was slightly surprised, but quickly looked at Gao Jianjun.<br/><br/>As a man in the shopping mall, Gao Jianjun had, of course, heard of Zhu Lao Da’s reputation and methods.<br/><br/>However, he was puzzled as to why Zhu Lao Da invited them to dinner for no reason?<br/><br/>They had no previous relationship with each other.<br/><br/>But Zhu Lao Da was someone who, if you didn’t have to offend him, it was better not to offend.<br/><br/>If you did offend him, you wouldn’t even know if someone tripped you in the shopping mall.<br/><br/>Gao Jianjun thought for a moment and said, “Since Boss Zhu invited us to dinner, it would be rude not to go.”<br/><br/>Ji Yuzhu somewhat disagreed, but when she met Gao Jianjun’s eyes, she immediately understood that they couldn’t refuse this person.<br/><br/>Gao Jianjun immediately instructed Gao Yanxin, “Xin er, take your elder aunt, uncle, and cousin home first. Your mom and I will attend a dinner!”<br/><br/>Gao Yanxin immediately responded, “Yes, Dad!”<br/><br/>When Manager Li heard that Mother Xiao and her family were going to leave first, his face became a little anxious.<br/><br/>He immediately said, “President Gao, Boss Zhu said he wants to invite all of you, including your relatives, to dinner.”<br/><br/>The target of Boss Zhu was Mother Xiao. If Mother Xiao didn’t go, it would mean his mission had failed.<br/><br/>Gao Jianjun heard this and his brow immediately furrowed.<br/><br/>What did Boss Zhu mean?<br/><br/>His gaze turned to his brother-in-law, and then to his sister, whose smile was calm and beautiful. His pupils shrank involuntarily, and a bad premonition enveloped his heart.<br/><br/>Then, Gao Jianjun said, “Manager Li, my brother-in-law and his family have just got off the plane, and they have come a long way. They’re tired and need to go back and rest. They’re not suitable to have dinner with us.”<br/><br/>Gao Jianjun’s heart was raised, hoping that his guess was wrong.<br/><br/>Upon hearing this, Manager Li frowned, looked somewhat puzzled and said, “Is that so? Well, let me ask Boss Zhu!”<br/><br/>As he said this, his gaze unintentionally swept over Mother Xiao and then he took out his phone.<br/><br/>Gao Jianjun, who had been staring at Manager Li’s expression, saw that Manager Li’s gaze had touched on Mother Xiao. His heart immediately sank.<br/><br/>As expected, Sister Bamboo had caught Zhu Lao Da’s eye.<br/><br/>The invitation to dinner may have been nominally for all of them, but in reality, it was not about the wine.<br/><br/>After a while, Manager Li said to Gao Jianjun, “Boss Zhu said that since the guests have come a long way and are tired and need to rest, we’ll have dinner another time!”<br/><br/>Hearing this, Gao Jianjun felt even more certain that Boss Zhu’s goal was probably his wife’s sister, and his heart became even heavier.<br/><br/>Gao Jianjun could only agree, “Alright, we’ll do it some other time!”<br/><br/>After Manager Li left, Ji Yuzhu asked inexplicably, “Husband, what does he mean by this?”<br/><br/>Gao Jianjun said solemnly, “Wife, let’s go home and talk about it. Let’s go home now!” He emphasized the word “now!”<br/><br/>Having been married to Gao Jianjun for many years, the two of them had long been in harmony.<br/><br/>Immediately, the whole group didn’t buy anything in the mall and hurried back home.<br/><br/>Once they arrived home, Ji Yuzhu asked with a slight unease, “Husband, what did that Manager Li in the mall mean? Why did that Boss Zhu invite us all to dinner for no reason?” They even had to bring her sister and their family.<br/><br/>Xiao Wanshan and his wife, as well as Jinli, also looked at him unanimously.<br/><br/>Gao Jianjun rubbed his eyebrows, and without concealing anything, he said, “I guess that Boss Zhu might have taken a fancy to my sister!”<br/><br/>“What?” Ji Yuzhu and Gao Yanxin exclaimed.<br/><br/>Ji Yuzhu jumped up and shouted, “That son of a bitch, who does he think he is, an ancient emperor?”<br/><br/>Gao Yanxin’s face showed a hint of panic, and he looked at Gao Jianjun nervously and asked, “Dad, what should we do?”<br/><br/>Gao Jianjun looked at Xiao Wanshan and his wife and said, “Sister, brother-in-law, I’m afraid you’ll have to leave Licheng immediately, otherwise…” Otherwise, it would be very difficult to leave.<br/><br/>Looking at the nervous expressions of her uncle and cousin, Xiao Jinli asked in confusion, “Uncle, cousin, who is this Boss Zhu? Why do we have to leave if he fancies my mom?”\t\t\t\t\t\t</div>", "images": {}, "success": true}