{"id": 204, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344270.html", "title": "Chapter 204 - Chapter 204: Chapter 204: Got Noticed (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 204 - Chapter 204: Chapter 204: Got Noticed (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 204: Chapter 204: Got Noticed (Second Update)<br/><br/>Translator: 549690339<br/><br/>Ji Yuzhu was a teacher. When she was at work, her attire was usually simple. Xiao Wanshan and his wife cared even less about clothing. Gao Yanxin was dressed in casual clothes, which although branded, were popular brands. The only one who dressed meticulously was Gao Jianjun.<br/><br/>After all, he was the president of a company, it was important for him to pay attention to his image at work and during business negotiations.<br/><br/>He was always dressed in bespoke suits from top brands. Those who had knowledge of these brands could tell at a glance that these suits were not cheap, costing tens of thousands or even hundreds of thousands for a set.<br/><br/>Thus, Gao Jianjun, dressed in his high-end custom clothing, seemed somewhat out of place among these people; akin to the sensation of a phoenix falling into a chicken coop.<br/><br/>Luckily, what these people lacked in attire, they made up for with their beauty. Handsome men and beautiful women, especially Mother Xiao with her appearance and figure, no matter how simple her dress, it was hard to conceal her exceptional beauty, revealing her unique charm and transcendent grace.<br/><br/>As a result, as soon as they entered the mall, they had attracted a lot of attention and gazes.<br/><br/>Mother Xiao was accustomed to being watched by others, but after all she was a countrywoman. She was usually well protected by her family members and rarely went to big cities, let alone high-end shopping malls. Her expression was noticeably awkward and shy.<br/><br/>She held Xiao Jinli’s hand and spoke in a seemingly natural manner, “Xiao Bao, the mall here is big and crowded, make sure you keep up with the adults.”<br/><br/>Xiao Jinli looked at her hand that was tightly holding hers, nodded, and said, “Okay, I understand.”<br/><br/>Ji Yuzhu brought the group to the brand counters on the sixth floor.<br/><br/>Unbeknownst to them, as soon as they entered the mall, the men upstairs who were accompanying their wives and girlfriends had noticed them. Their gaze was fixed on Mother Xiao, Ji Yuzhu, and Xiao Jinli.<br/><br/>Mother Xiao has a fair and beautiful face, looking mature yet still charming and elegant, radiating a unique charm from her very bones.<br/><br/>Ji Yuzhu, although not as beautiful as her sister, is also quite stunning. Being a teacher, she possessed an aura of scholarly grace and cultivated temperament.<br/><br/>As for Xiao Jinli, despite her young age, she had the makings of a beauty, while at the same time exuding innocence and loveliness.<br/><br/>“Hey, when did such stunning women appear in Licheng?” asked a man on the sixth floor, wearing a black t-shirt and a thick gold necklace around his neck. He was in his thirties or forties, with a face full of coarse features and a balding head.<br/><br/>The man next to him immediately sycophantically said, “Boss, are you interested in that woman? Should I go and ask around?”<br/><br/>Zhu Lao Liu gave him a glance, took a deep puff of his cigarette, and kept his eyes fixed on Mother Xiao.<br/><br/>His subordinate immediately understood.<br/><br/>As soon as his subordinate left, a flamboyantly dressed woman came out and asked in a spoiled tone, “Honey, what do you think of this dress? Is it pretty?”<br/><br/>As she spoke, she kept winking at Zhu Lao Liu.<br/><br/>However, Zhu Lao Liu didn’t even bat an eye at her.<br/><br/>Zeng Yanmei was instantly annoyed inside, but she dared not show it. Just as she was about to throw a tantrum, she followed Zhu Lao Liu’s gaze and saw Mother Xiao’s charming smile. A flicker of jealousy and resentment crossed her eyes in an instant.<br/><br/>“Has Zhu Lao Liu laid his eyes on another target? This can’t happen, I haven’t gotten enough money out of him yet,” Zeng Yanmei thought to herself, “Where did this bitch come from? I must find a way to ruin her beauty!”<br/><br/>“Darling,” Zeng Yanmei whined as she clung to Zhu Lao Liu’s arm, “I called you, why aren’t you paying attention to me?”<br/><br/>Zhu Lao Liu turned to look at her heavily made-up face and lost interest instantly. He took a card out of his wallet, handed it to Zeng Yanmei, and said coldly, “There are two million in this card. You don’t need to follow me anymore.”<br/><br/>Zeng Yanmei’s face immediately changed, looking heartbroken and teary-eyed. She asked, “Brother Liu, did I do something wrong? Why are you giving up on me?”<br/><br/>It’s not that she particularly enjoyed being around Zhu Lao Liu, but Zhu Lao Liu was more generous than her previous sugar daddies. Whatever she wanted, name-brand clothes and bags, expensive jewelry, he would purchase it all for her without batting an eyelash. He even gifted her a house worth five million yuan.<br/><br/>The longer she stayed by his side, the more she acquired, so of course, she was in no rush to be cast aside.<br/><br/>Having been with Zhu Lao Liu for so long, she had grown to understand him well. He did not like women who were clingy and nagging.<br/><br/>She carefully studied Zhu Lao Liu’s expression, sure enough, he showed signs of impatience and disdain. Her heart skipped a beat. She quickly grabbed the card he was offering and immediately said, “Brother Liu, you’re a good man, and I don’t want to leave you, but if you really don’t need me anymore then, well… I’ll just leave.”<br/><br/>What Zhu Lao Liu valued about Zeng Yanmei was her ability to read the room and behave appropriately. Among all the women he knew, she was the one who lasted the longest by his side.<br/><br/>Had he not found a new target, he would have wanted to keep her around a bit longer.<br/><br/>Zhu Lao Liu nodded and promised her, “After you leave me, don’t hesitate to come and find me if you need any help.”<br/><br/>Zeng Yanmei’s eyes lit up and she responded excitedly, “Really? Thank you, Brother Liu. Since you’re busy, I won’t disturb you anymore!”<br/><br/>With that said, she quickly left with the card and her bag.<br/><br/>As she was walking away, she cast a malicious glance towards Mother Xiao and her group.<br/><br/>As long as that woman was out of the picture, and Zhu Lao Liu’s attention wasn’t on her, Zeng Yanmei would be able to return to Zhu Lao Liu’s side.<br/><br/>It’s not that she truly fell in love with Zhu Lao Liu and could not bear to leave him. It’s that she feared it would be hard to find another sugar daddy as generous as him in the future. So, of course, she wanted to hold onto this opportunity.<br/><br/>After Zeng Yanmei left, Zhu Lao Liu’s heated gaze remained focused on Mother Xiao.<br/><br/>Xiao Jinli, who was busy choosing clothes with her mother and her aunt, felt two burning and domineering gazes pierce her, causing her to furrow her brows slightly. She quickly scanned the surroundings and soon identified the source.<br/><br/>Xiao Jinli glanced at the burly man leaning on the corridor on the 6th floor narrowing her eyes. Was this man eying her mother?<br/><br/>Soon, she noticed a man dressed in a suit and leather shoes approaching. Upon seeing Gao Jianjun, he immediately greeted him, “President Gao, I thought I had mistaken you for someone else just now!”<br/><br/>Gao Jianjun immediately recognized the man as a manager from one of his partner companies, and he nodded in acknowledgement, “Manager Li.”<br/><br/>Manager Li smiled and took a brief but careful look at the people around Gao Jianjun, then he asked cautiously, “President Gao, you’re out shopping with your family. Is this your wife?”<br/><br/>He pointed at Ji Yuzhu.<br/><br/>Gao Jianjun said with a smile, “Yes, this is my wife.”<br/><br/>Then he didn’t introduce anyone else.<br/><br/>There was no need to do that for someone he wasn’t close to.<br/><br/>Manager Li immediately greeted Ji Yuzhu, “Madam, hello! Lady Gao, you’re really beautiful, no wonder President Gao doesn’t pay attention to other women.”<br/><br/>Ji Yuzhu replied politely, “Manager Li, you flatter me!”<br/><br/>Manager Li showered Ji Yuzhu with compliments before turning to Mother Xiao and the others and asking, “Lady Gao, are these your relatives? The women are so gorgeous, the men so handsome – it’s truly a case of like attracts like!”\t\t\t\t\t\t</div>", "images": {}, "success": true}