{"id": 208, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344278.html", "title": "Chapter 208 - Chapter 208: Chapter 208: This Person Zhu Lao Liu", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 208 - Chapter 208: Chapter 208: This Person Zhu Lao Liu</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 208: Chapter 208: This Person Zhu Lao Liu<br/><br/>Translator: 549690339<br/><br/>Xiao Wanshan asked with a serious face, “Jianjun, who exactly is this Zhu Lao Da that you’re all so nervous about?”<br/><br/>Gao Jianjun said, “Zhu Lao Da, known as Zhu Lao Liu on the streets. He can be considered the hegemon of Licheng!”<br/><br/>Xiao Wanshan furrowed his brows, puzzled, “Licheng Hegemon?”<br/><br/>“Yes!” Gao Jianjun nodded, “Zhu Lao Liu used to be the boss on the streets a couple of years back, but he’s gone legit in recent years, becoming a security company. However, he’s still the most influential in the underworld, and those from both paths dare not offend him easily.<br/><br/>Rumor has it that Zhu Lao Liu worked his way up from a low-level little gangster to his current position. Not only is he resourceful and ruthless, but he’s also known for his loyalty and friendship. He has friends among all the powers and is considered a hero by those on both paths.<br/><br/>Even the richest and most powerful people in Licheng have to give him some respect and pay attention to his expressions.”<br/><br/>Xiao Jinli summed it up, “So, we can’t afford to offend such a person, and we don’t dare to, right?”<br/><br/>Gao Jianjun nodded, “That’s right. Zhu Lao Liu may seem magnanimous and generous at times, but he’s also known to be vengeful. So, such a person is the one you absolutely can’t provoke!”<br/><br/>Xiao Jinli nodded and then continued to ask, “So, Uncle, you also said that he has his eyes on my mom. What does that mean?”<br/><br/>Gao Jianjun said, “Zhu Lao Liu is fond of women, especially beautiful women. It is rumored that as long as he fancies a woman, whether married or single, he will use any means necessary to get her. However, he’s also generous towards women. As long as they follow him, he will basically meet any demands they have.”<br/><br/>At this point, he looked worriedly at Xiao Wanshan and his wife, continuing, “He invited us to dinner for no reason and insisted that you come with us. Based on my guess, he might have set his sights on my sister! I’m sorry, sister, brother-in-law, I may not be able to protect you. So, it’s best for you to leave Licheng as soon as possible! As long as you leave Licheng, he can’t do anything to you. Otherwise…”<br/><br/>Upon hearing this, Ji Yuzhu became furious, “Has this Zhu Lao Liu become lawless, wanting to forcefully take a married woman? Can he really cover the sky in Licheng?”<br/><br/>Gao Jianjun sighed lightly, “He is called the Licheng Hegemon, so it’s not that different from covering the sky with one hand!”<br/><br/>Ji Yuzhu,<br/><br/>Xiao Jinli’s eyes flickered as she said, “Dad, Mom, they say that a local snake is no match for a strong outsider. Let’s not forget, Zhu Lao Liu is a dragon in Licheng holding sway. To avoid trouble, you should just go back. Don’t worry, now that I’ve arrived in Licheng, with maternal aunt and uncle here, I’ll be fine.”<br/><br/>Xiao Wanshan pondered for a moment and said, “Alright, we’ll leave Licheng.”<br/><br/>Gao Jianjun nodded, “Good, I’ll book the earliest flight to Ganjiang City for you and my sister now!”<br/><br/>Xiao Mother heard this and felt a little uneasy.<br/><br/>She wanted to go back, but she didn’t want to leave her daughter alone.<br/><br/>Xiao Jinli saw her mother’s hesitation and comforted her, “Mom, don’t worry, I’ll be fine. Wherever I go, Cousin will be with me. If you’re still worried, Uncle can arrange for a couple of bodyguards to follow me!”<br/><br/>Gao Yanxin immediately promised, “Elder aunt, uncle, don’t worry, I will definitely protect my cousin. Wherever my cousin goes, I will follow her every step of the way, 24 hours a day!”<br/><br/>“Pfft!” Xiao Mother laughed, “Twenty-four hours a day is not necessary. It’s enough to just have you follow Xiao Bao when she goes out.”<br/><br/>Does her Xiao Bao need privacy for twenty-four hours a day?<br/><br/>Since the decision to return had been made, the sooner they left the better.<br/><br/>Gao Jianjun said, “Brother-in-law, the fastest flight from Licheng to Ganjiang City is at 1:30 am.”<br/><br/>Xiao Wanshan nodded, “Alright, let’s take that flight.”<br/><br/>After dinner and a two-hour rest, they left for the airport at 11:30 pm.<br/><br/>Who would have thought that as soon as they walked out of the villa, they were stopped by a group of men.<br/><br/>Gao Jianjun stared at the men blocking their way, asking with a dark face, “Who are you? Why are you stopping us outside my house?”<br/><br/>Huang Mao chuckled, “President Gao, you misunderstand; my brothers and I are not here to stop you. This morning, our Zhu Lao Da invited you all to have a meal, and he was afraid that you might forget. We are just here to remind you. Oh, and by the way, President Gao, where are you going so late? How about we give you a lift?”<br/><br/>He thought secretly, “As expected, Zhu Lao Da is a visionary; he guessed that Gao Jianjun would send this woman away overnight. Luckily, his men have been watching Gao Jianjun!”<br/><br/>As Gao Jianjun was about to respond, Xiao Jinli giggled and said, “Hehe, Big Brother, are you serious? We’re going to the airport. If you don’t mind, please give us a ride!”<br/><br/>The faces of Xiao Wanshan and the others changed, and they exclaimed, “Xiao Bao!”<br/><br/>Huang Mao’s expression paused, and his eyes swept over Xiao Wanshan and the others one by one. Then he looked back at Xiao Jinli, his expression slightly odd, “To the airport?”<br/><br/>He thought Xiao Jinli was just an ordinary child with no ulterior motives.<br/><br/>Xiao Jinli nodded, “Yeah. There’s a man-eating demon here in Licheng, and it especially likes eating beautiful women. My mom is so beautiful, and that demon will definitely not let her go. Naturally, it’s better to leave this place. Big Brother, don’t you think so?”<br/><br/>“A man-eating demon?” Huang Mao’s expression cracked slightly, “This…this can’t be, right?”<br/><br/>This child just described Zhu Lao Da as a man-eating demon, she’s quite a character.<br/><br/>Xiao Jinli nodded her head, “Why not! Big Brother, you have no idea. Since we came here, we’ve been feeling two powerful and scorching stares, as if trying to trap us in a prison to await slaughter. If this isn’t a demon, what is it?<br/><br/>So, it’s best for us to leave here as soon as possible. Big Brother, didn’t you say you’d give us a ride? It’s late into the night, the perfect time for demons to come out. We’re afraid we might even encounter one on the way. Now that you, Big Brother, are escorting us, we don’t have to worry too much.”<br/><br/>Xiao Wanshan and others, What on earth is this child talking about?<br/><br/>“Alright!” Huang Mao subconsciously nodded, but then reacted and shook his head vigorously, “No, you can’t leave!”<br/><br/>If they left, how would he explain it to Zhu Lao Da? He didn’t want to lose himself either.<br/><br/>“Why?” Xiao Jinli asked with a puzzled look, then seemed to have a sudden realization and said in surprise, “Big Brother, you’re not part of that man-eating demon’s gang, are you?”<br/><br/>Xiao Wanshan and others,<br/><br/>Caught off guard, Huang Mao and the others,  Was this girl doing this on purpose?<br/><br/>Huang Mao lost his patience and shouted, “Gao Jianjun, I don’t know if you’re pretending not to understand or if you really don’t understand. But let me tell you, none of you are allowed to leave tonight, or don’t blame us for being impolite!”\t\t\t\t\t\t</div>", "images": {}, "success": true}