{"id": 209, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344280.html", "title": "Chapter 209 - Chapter 209: Chapter 209: Xiao Jinli Gets Angry, The Consequences Are Severe", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 209 - Chapter 209: Chapter 209: Xiao Jinli Gets Angry, The Consequences Are Severe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 209: Chapter 209: Xiao Jinli gets angry, the consequences are severe<br/><br/>Translator: 549690339<br/><br/>After saying that, Huang Mao’s expression was very smug, and his gaze deliberately lingered on Xiao Mother’s face for a moment before swallowing.<br/><br/>This woman is so damn beautiful!<br/><br/>He had followed Zhu Lao Liu and seen all kinds of enchanting women, but none of them were as beautiful and graceful as Xiao Mother.<br/><br/>Xiao Wanshan immediately stood in front of Xiao Mother, suppressing the anger in his eyes. He stared coldly at Huang Mao and said coldly, “So, you want to abduct and force our women?”<br/><br/>Huang Mao’s disdainful gaze on Xiao Wanshan and coldly sneered,<br/><br/>“Hmph, it seems you already know Zhu Lao Da’s intentions. Gao Jianjun, are you sure you want to offend Zhu Lao Da? In Licheng, do you dare to offend Zhu Lao Da?”<br/><br/>At this point, he paused and showed an even more disdainful expression, continuing, “So, I advise you to be a little more sensible! Don’t let your so-called relatives, because of a woman, cause your family’s company to disappear in Licheng!”<br/><br/>Threats, naked threats!<br/><br/>He was convinced that Gao Jianjun would not dare to offend Zhu Lao Liu!<br/><br/>Indeed, in Licheng, there were very few people who dared to offend him.<br/><br/>Moreover, Gao Jianjun’s business in Licheng was not very influential.<br/><br/>Anyone with a bit of common sense would know how to choose!<br/><br/>Gao Jianjun’s eyes were filled with rage, but before he could speak, Ji Yuzhu loudly scolded, “You’re farting!”<br/><br/>Ji Yuzhu was very angry and said, “Do you really think that Zhu Lao Liu can cover the sky in Licheng, and there is no law left? My sister has a husband and children, why should we surrender just because he fancies her? You go tell Zhu Lao Liu, we will not submit!”<br/><br/>Huang Mao said coldly, “Lady Gao, don’t be naive. You can ask your husband if our Zhu Lao Da is someone you can afford to offend? Gao Jianjun, knowing reality is the mark of a wise man! You’re a smart man, you know how to choose, right?”<br/><br/>Gao Jianjun’s face was ashen, and he shouted angrily, “Fine, let Zhu Lao Da kill me if he has the guts, and let my company disappear in Licheng!”<br/><br/>Hearing that, Huang Mao laughed instead of getting angry!<br/><br/>He looked mockingly at Xiao Wanshan and his wife with a sneer, “So, you two, what will it be? Do you really want Gao Jianjun and his wife to offend Zhu Lao Liu for your sake and let Gao’s Group disappear from Licheng?”<br/><br/>Xiao Wanshan’s face was full of anger, and he was really furious!<br/><br/>Xiao Mother had always been well protected and had never experienced such a thing. Her beautiful face turned slightly pale, and she looked scared and nervous!<br/><br/>Seeing Xiao Mother’s appearance, Xiao Jinli was really angry!<br/><br/>Provoking her family meant touching her reverse scale!<br/><br/>Since her rebirth, she had never been so angry!<br/><br/>Very well, Zhu Lao Liu, you and I are completely at odds now.<br/><br/>Xiao Jinli’s delicate, childish face showed a coldness unlike her age, and she sneered, “Hehe, we want to see how your Zhu Lao Da makes Gao’s Group disappear in Licheng.”<br/><br/>Upon hearing this, Huang Mao immediately became angry. He pointed his finger at Xiao Jinli and shouted, “You little brat, how dare you be so arrogant!”<br/><br/>As he said that, his eyes swept menacingly across Gao Jianjun, “Gao Jianjun, since you refuse the toast and insist on punishment, you just wait for it!”<br/><br/>As long as Gao Jianjun’s company was still in Licheng, it wouldn’t matter where his relatives hid.<br/><br/>“Let’s go!” Huang Mao called for his subordinates.<br/><br/>“Stop!” Xiao Jinli coldly said, “Did I let you go?”<br/><br/>Gao Yanxin was frightened and pulled Xiao Jinli’s sleeve, whispering softly, “Cousin!” His face was full of worry.<br/><br/>“Hehe…”<br/><br/>Huang Mao found it funny that a young girl could stop him.<br/><br/>“Little girl, do you have any more orders?” he sneered in warning, “However, little girl, it’s not your place as a child to interfere in adult matters. Otherwise, don’t blame my brothers for not sparing even a child!”<br/><br/>Xiao Jinli crossed her arms, and her childish face showed an uncharacteristic cold smile.<br/><br/>She said coldly, “Oh, I want to see how you, Zhu Lao Da’s subordinates, can go so far as to not spare even me, a child!”<br/><br/>Huang Mao frowned, his eyes slightly dissatisfied as he looked at Gao Jianjun, saying, “Gao Jianjun, you adults actually let a child stick her neck out for you, haha, it’s really showing us what kind of coward Gao’s Group’s president is!”<br/><br/>Snap, snap!<br/><br/>He had barely finished speaking when his face was hit with two slaps.<br/><br/>Huang Mao’s face instantly swelled up.<br/><br/>Gao Yanxin and his family opened their mouths wide in disbelief and exclaimed, “Cousin!”<br/><br/>Xiao Wanshan and his wife’s expressions were actually quite calm.<br/><br/>Because they were already used to it!<br/><br/>Xiao Jinli clapped her hands, her eyes sharp and coldly said, “If you can’t speak properly, shut up!”<br/><br/>Huang Mao’s subordinates also looked at Xiao Jinli incredulously.<br/><br/>Huang Mao was Zhu Lao Da’s henchman and very trusted. Most people in Licheng didn’t dare to mess with him. On the contrary, many people tried their best to please him.<br/><br/>But now, he had been beaten by a child.<br/><br/>When Huang Mao came to his senses, he covered his swollen face with one hand, and shouted furiously, “You little brat, how dare you hit me! See if I don’t teach you a lesson!”<br/><br/>Having said that, he reached out a hand towards Xiao Jinli’s face.<br/><br/>Xiao Jinli sidestepped and grabbed Huang Mao’s arm, giving it a gentle squeeze.<br/><br/>“Ah!”<br/><br/>A mournful scream rang out in the deep night, startling the neighbors in the nearby villas.<br/><br/>The people who lived in this area were either rich or noble!<br/><br/>“What happened?”<br/><br/>“What’s going on? Send someone to check it out!”<br/><br/>“Where is that sound coming from?”<br/><br/>“It seems to be coming from the Gao’s. The Gao family? Is there something wrong with the Gao family? How does this sound so creepy?”<br/><br/>Soon after, some people gathered here.<br/><br/>“Mr. Gao, what happened here?”<br/><br/>“President Gao, your home…”<br/><br/>As they walked in, their mouths dropped open in surprise.<br/><br/>They saw five or six men lying on the ground, either holding their chests or arms, or hugging their heads, screaming in pain. Then there was a teenager standing in the middle.<br/><br/>By the looks of it, these men were beaten by the teenager.<br/><br/>“Jianjun, what happened here?” Licheng Group’s Chairman Li Ming, seeing their good relationship, asked in confusion.<br/><br/>Gao Jianjun was also quite shocked and couldn’t react for a long time. Hearing someone ask, he couldn’t help but smile bitterly and said, “Zhu Lao Liu took a fancy to my sister-in-law and wanted to abduct her by force. This child is her child. She was very angry, very furious. So, in her fury, she taught these guys a lesson.”<br/><br/>After hearing Gao Jianjun’s words, some people immediately understood and asked, “Are these people Zhu Lao Liu’s men?”\t\t\t\t\t\t</div>", "images": {}, "success": true}