{"id": 202, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344266.html", "title": "Chapter 202 - Chapter 202: Chapter 202: (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 202 - Chapter 202: Chapter 202: (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 202: Chapter 202: (Second Update)<br/><br/>Translator: 549690339<br/><br/>Xiao Mother’s face turned pale, and she asked, “You kid, how could you… how could you be holding a bomb? Is your courage too big? It’s a bomb, one careless moment, and it could explode, could explode, you know? Boo hoo…”<br/><br/>She couldn’t imagine what it was like for a child to carefully hold a bomb.<br/><br/>Not to mention a child, even an adult couldn’t calmly hold an explosive bomb while remaining composed.<br/><br/>Yet her child did just that.<br/><br/>This made them proud, but at the same time, even more worried!<br/><br/>The child’s first time away from home and encountered such a dangerous and thrilling situation, yet the parents weren’t there with her.<br/><br/>What if, something happened to her, they would live the rest of their lives in guilt, regret, and heartache.<br/><br/>Xiao Jinli smiled and comforted, “Mom, I’m fine now. You all know, your daughter has always had incredible luck and was called a Lucky Star. Any misfortune would disappear in front of me. See, I turned this big crisis into safety, right?”<br/><br/>At this point, she rolled her eyes and laughed, “Actually, Mom and Dad, you should be proud of me. Just because I was on that flight, I saved everyone, right?”<br/><br/>Yang Fei listened and was stunned. Was that the real reason?<br/><br/>Yang Fei was really excited and said, “Mr. Xiao, Mrs. Xiao, it’s really thanks to your child being on the plane, as soon as she got on, she heard the ticking sound of the bomb. With her calm and smart demeanor, she managed to prevent this major crisis.<br/><br/>I can’t even imagine what would have happened if the child hadn’t been on this flight. More than 200 passengers and staff aboard the plane would have been wiped out, and if the plane exploded mid-air in the Big city, the falling wreckage would have caused a massive disaster.”<br/><br/>At this point, he stood up and expressed his sincere gratitude earnestly, “Mr. Xiao, Mrs. Xiao, I truly thank you for raising such an outstanding child who saved everyone in our company and avoided a huge disaster and countless losses! Honestly, I don’t know what words could express my gratitude to you and your child.”<br/><br/>After listening to this, Xiao Wanshan was silent for a moment.<br/><br/>Mrs. Xiao still held Xiao Jinli, her eyes red, in silence.<br/><br/>At this moment, they didn’t know whether to feel relieved that their child was on this flight or wish she hadn’t been on it.<br/><br/>However, the fact that their child could save so many people was a testament to her good deeds.<br/><br/>Perhaps it was because of her incredible luck that the heavens allowed her to board this flight and save so many lives.<br/><br/>After a while, Xiao Wanshan sighed and said, “It’s good that everyone is safe! Everything is fate, I guess.”<br/><br/>Maybe it was destined that all the people on the plane wouldn’t perish, so their daughter was sent as an angel.<br/><br/>Xiao Wanshan then looked at Xiao Jinli seriously and said, “Xiao Bao, no matter what happens, you must let us know immediately, okay? Otherwise, we will really worry!”<br/><br/>Especially since they had learned about Xiao Jinli’s near-accident from someone else’s mouth.<br/><br/>Xiao Jinli realized her mistake and promised earnestly, “All right. From now on, no matter what happens, I will tell you both as soon as possible. Dad, Mom, I’m sorry for making you worry!”<br/><br/>She shouldn’t have kept it from her parents because she was afraid of worrying them.<br/><br/>Looking at their child’s innocent and serious expression, Xiao Father said helplessly, “All right, let’s move on from this.”<br/><br/>At this point, Yang Fei said, “Mr. Xiao, our company will reward the child.”<br/><br/>Xiao Father said seriously, “It doesn’t matter whether she gets a reward or not. We only care about our child’s safety. Also, General Manager Yang, she is still a child, and I don’t want her identity to be exposed and put her in danger!”<br/><br/>General Manager Yang nodded, “Of course. We will definitely protect the child’s identity.”<br/><br/>Xiao Jinli, being so beautiful, wise, and calm, attracted attention from people with ill intentions, causing real danger.<br/><br/>Xiao Wanshan said to Xiao Jinli again, “After dinner, your Mom and I will accompany you to Licheng.”<br/><br/>Xiao Jinli,<br/><br/>She knew they would say that.<br/><br/>But this time, she couldn’t refuse.<br/><br/>Still, she struggled a bit, “But Dad, what about the house and the company?”<br/><br/>Xiao Wanshan said seriously, “Your brother and your maternal grandmother are at home, so there’s nothing to worry about. As for the company, your brother will handle it, so I don’t need to worry about it!”<br/><br/>Xiao Jinli could only nod helplessly, “Okay.”<br/><br/>Xiao Wanshan turned to Yang Fei and said, “General Manager Yang, since this happened, we really can’t rest assured and want to accompany her to Licheng. Could you please arrange two plane tickets for us?”<br/><br/>Yang Fei smiled and said, “That’s not a problem. I’ll make a call right away and arrange it for you!”<br/><br/>Then, Yang Fei called his subordinate and booked two plane tickets to Licheng.<br/><br/>Tian Xinyi was very interested in Xiao Jinli’s tea flower pot.<br/><br/>She asked, “Student Xiao, do you keep flowers?”<br/><br/>Xiao Jinli shook her head, “I don’t really keep flowers.”<br/><br/>“Ha, you don’t keep flowers, so what’s this tea flower pot?” Tian Xinyi was very curious about the Seven Color Tea Flower pot, and said, “The Seven Color Tea Flower is difficult to cultivate, but look at this pot, the leaves and blossoms are flourishing, and you managed to keep it so well?”<br/><br/>Xiao’s mother said, “Hehe, this pot of flowers grows in the Great Mountain, not in the house. It was brought back some time ago.”<br/><br/>“Grown in the Great Mountain?” Tian Xinyi was puzzled.<br/><br/>Xiao Jinli nodded, “Yes, I bought a few seeds from the Seed Station, didn’t know how to plant them, so I threw a couple into a pit in the mountain, and then they grew.”<br/><br/>Tian Xinyi and others,<br/><br/>So, this precious Seven Color Tea Flower was just casually thrown in and grew wild?<br/><br/>But is it that easy?<br/><br/>If it were that easy, the value of the Seven Color Tea Flower wouldn’t be so precious.<br/><br/>Xiao’s mother asked doubtfully, “Is this flower really that precious?”<br/><br/>Yang Fei and others,<br/><br/>The child was carrying a flower worth over two million, walking around, and the parents still don’t know?<br/><br/>But the child knew it.<br/><br/>Yang Fe arrayWithlacenames.PreDbTypeProcedureThe names= “|array|_right|string|” and saidFilename.ReadAllText(contents, Encoding.UTF8;vara mightFilename.ReadAllText(contents, Encoding.UTF8;vara.”},\t\t\t\t\t\t</div>", "images": {}, "success": true}