{"id": 200, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344262.html", "title": "Chapter 200 - Chapter 200: Chapter 200: Qian Li’S Family Makes Trouble (Second Update)", "volume": 2, "volume_title": "Volume 2", "body": "<h1>Chapter 200 - Chapter 200: Chapter 200: Qian Li’S Family Makes Trouble (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 200: Chapter 200: Qian Li’s Family Makes Trouble (Second Update)<br/><br/>Translator: 549690339<br/><br/>Xiao Wanshan, however, was not enthusiastic. He just reached out a hand and said indifferently, “General Manager Yang, nice to meet you!”<br/><br/>His daughter almost had an accident on this plane, so it would be strange for him to have a good expression.<br/><br/>Yang Fei didn’t mind, and his attitude was still very enthusiastic, even attentive, as he said, “Mr. Xiao, you really raised a good daughter. She’s not only smart and beautiful, but also so excellent.<br/><br/>At a young age, she faced a sudden accident and responded so calmly.<br/><br/>I was wondering earlier, what kind of parents could raise such an outstanding child?<br/><br/>Now I see, with a handsome and wise father and a young and beautiful mother, it’s no wonder their child is both beautiful and intelligent.”<br/><br/>Everyone likes to hear and is willing to listen to compliments.<br/><br/>Especially when others praise their children, how can the parents be indifferent?<br/><br/>Xiao Father’s attitude was not as cold as before, but he still said with some coldness, “General Manager Yang, you’re too kind. We’re just average. Not like you, at such a young age, already the general manager of the company.”<br/><br/>Yang Fei,<br/><br/>Director Luo,<br/><br/>This child’s parents are a bit hard to deal with.<br/><br/>Actually, it makes sense that raising such an outstanding child would not be simple.<br/><br/>Yang Fei smiled awkwardly and said, “I’m flattered, flattered.”<br/><br/>Then he showed a sincere attitude to apologize to Xiao Wanshan and his wife, “Mr. Xiao, Mrs. Xiao, the incident on the plane scared your child, which is our company’s mistake and responsibility. On behalf of the entire company, I apologize to Miss Xiao Jinli and her family, and sincerely express my gratitude!”<br/><br/>After saying this, he bowed to apologize to Xiao Wanshan and his wife.<br/><br/>Xiao Wanshan’s cold and hard expression softened somewhat. He sighed softly and said, “General Manager Yang, no one wants to see such accidents happen to your company. My child just happened to be on that plane. Fortunately, she has always been lucky, making many things turn from dangerous to safe, and this time the incident was luckily averted without any harm. There’s no need for you to apologize.”<br/><br/>Speaking of being lucky, Director Luo on the side laughed and said, “Student Xiao does have very good luck. We tracked down the tea flower quickly, which is really the thief’s bad luck.”<br/><br/>“Oh, bad luck, what kind of bad luck?” Xiao Jinli asked curiously.<br/><br/>In fact, she wanted to divert her father’s attention.<br/><br/>Director Luo then shared the story of the flower thief’s three taxi crashes and haplessly catching himself in the trap on the bus.<br/><br/>” Ha ha, I’ve been solving cases for more than twenty years, and I’ve never seen such an unlucky thief.” Director Luo said.<br/><br/>Yang Fei agreed, thinking that the flower thief was indeed very unlucky.<br/><br/>Yang Fei lamented, “Such an unlucky thief, no wonder he couldn’t get away with a two-million-dollar flower.”<br/><br/>Unexpectedly, Xiao Father’s proud and indifferent voice said, “Humph, he deserves to be unlucky. Why did he steal my Xiao Bao’s things?”<br/><br/>Yang Fei immediately chimed in, “Exactly, with Jinli’s good luck, any bad person who encounters her can only be unlucky themselves.”<br/><br/>After he finished speaking, his expression became a little stunned.<br/><br/>Indeed.<br/><br/>Qian Li had carried explosives and intended to detonate them on the plane mid-air, but as soon as his plan began, he encountered Jinli. She discovered the bomb and then, by sheer good luck and a series of mistakes, cut the right wire, completely avoiding a major man-made disaster.<br/><br/>As for the flower thief, after he stole the flower, he tried to change his route to escape but he encountered car accidents again and again. There’s no such coincidence. It could only be said that he became so unlucky after stealing Jinli’s flower.<br/><br/>Thinking of this, a different look flashed across Yang Fei’s face. A person with such extraordinary luck must be befriended; otherwise, the unlucky one would only be himself.<br/><br/>Although she is still a child.<br/><br/>Yang Fei looked at the time and said, “It’s 11:00 am now, and the company’s next flight to Licheng is at 2:40 pm. Mr. Xiao, Mrs. Xiao, Director Luo, I have booked a private room at the Friendship Hotel. Let’s go have lunch first.”<br/><br/>Xiao Father did not refuse.<br/><br/>Director Luo also did not refuse.<br/><br/>After a while, everyone left the general manager’s office.<br/><br/>Unexpectedly, a disheveled woman came running over, knelt down in front of Yang Fei, and cried while begging, “General Manager Yang, please, let Qian Li go. Qian Li is the pillar of our family. If he is gone, how can the rest of us survive?”<br/><br/>This woman is Qian Li’s wife, Yang Ping.<br/><br/>General Manager Yang frowned, coldly saying, “Sister-in-Law, Qian Li has committed a crime now; it’s not up to me whether I can release him. Your pleading now is useless. Even if I could spare him, could the law spare him? Sister-in-law, you should go home.”<br/><br/>“No, no, I won’t go!” Yang Ping said emotionally, “If you don’t release Qian Li, I will kneel here forever!”<br/><br/>Yang Fei said coldly, “Do as you please!”<br/><br/>Yang Ping cursed, “Yang Fei, how can your heart be so black and hard? Qian Li has been working in the company for twenty years. Even if he doesn’t have any merits, he still worked hard. Now that he’s old and can’t work anymore, are you just giving up on him? Do we have to be forced to the edge of despair?”<br/><br/>Everyone,<br/><br/>Who’s forcing who?!<br/><br/>Even if Qian Li had no merits or hard work over the past twenty years, the moment he brought a bomb onto the plane, any merit he had could not offset his crime.<br/><br/>Hearing Yang Ping’s words, the chief flight attendant and Bi Shengyu were both angry…<br/><br/>Yang Fei took two steps forward, his eyes filled with anger. He said coldly, “Is it me and the company who gave up on Qian Li? It’s you, his family, who said Qian Li’s health isn’t good, requested that we don’t let him fly the plane, and had him retire early.<br/><br/>As requested by the family, we stopped Qian Li from flying. Today is his last flight as a captain.<br/><br/>Now, what are you doing as family members? You abuse him and look down on him when you learn the company is giving up on him and that he can’t fly anymore?<br/><br/>So, is this how you comfort him? Let me tell you, you, as family members, have played an indispensable role in his journey on the path of crime.”<br/><br/>Yang Ping’s face changed after hearing this, but she defended herself, “Don’t slander us by distorting the truth; none of this happened!”<br/><br/>“Hmph, none of this happened? We have evidence. Do you want to see it?” Bi Shengyu interrupted, “Qian Li told us himself that after knowing the company didn’t want him to fly anymore, his wife called him a loser, his son felt ashamed of him, and his parents looked down on him for having no achievements. You guys don’t want him to fly on one hand, and you scold and despise him on the other. Are you guys sick?”<br/><br/>If it wasn’t for the family acting like this, Qian Li might not have gone to the extreme.\t\t\t\t\t\t</div>", "images": {}, "success": true}