{"id": 213, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344288.html", "title": "Chapter 213 - Chapter 213: Chapter 213: Licheng Changes (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 213 - Chapter 213: Chapter 213: Licheng Changes (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 213: Chapter 213: Licheng Changes (First Update)<br/><br/>Translator: 549690339<br/><br/>7:30 a.m.<br/><br/>Inside Licheng Judicial Bureau, an employee from the Public Security Department just turned on his computer when the screen went black and a page quickly popped up.<br/><br/>At first, Xiao Li thought the computer had a virus. Just as he was about to call technical support, his face turned to shock upon seeing the content of the page.<br/><br/>“Oh my God, what’s going on?”<br/><br/>A moment later, Xiao Li picked up his phone to call his supervisor.<br/><br/>“Section Chief Zheng, something’s wrong, our computer Our computer’s been hacked.”<br/><br/>It wasn’t yet time for work, and Section Chief Zheng was still in bed, asleep.<br/><br/>Upon hearing about the computer being hacked, he was furious, “What the hell are you doing? If the computer got hacked, go talk to the technicians. Don’t bother me!”<br/><br/>With that, he hung up the phone and went back to sleep.<br/><br/>He spent last night working late on a case.<br/><br/>However, just as he went back to bed, the phone rang again.<br/><br/>He answered the phone with his eyes closed, then suddenly opened them wide, his mind clear. He almost jumped out of bed, and said excitedly, “What did you say? Say it again? Evidence of Zhu Lao Liu’s crimes? Okay, okay, I got it, I’m coming right away!”<br/><br/>Within ten minutes, the whole Judicial Bureau was buzzing.<br/><br/>As soon as a computer was turned on, the hacker’s page would definitely pop up, and it couldn’t be deleted.<br/><br/>And then, all employees of the Judicial Bureau, who were not away on business trips, arrived at the bureau within half an hour.<br/><br/>“My God, Zhu Lao Liu is so lawless, he’s done everything from arson to murder. Is there anything he hasn’t done?”<br/><br/>“So this is how the Licheng Hegemon comes to power, huh?”<br/><br/>“Not to mention, this Licheng Hegemon is really capable!”<br/><br/>“This Zhu Lao Liu, from an insignificant little gangster to the hegemon, must have some tricks up his sleeve. Without them, he couldn’t have covered the sky with one hand and become the hegemon of Licheng!”<br/><br/>As everyone discussed Zhu Lao Liu’s criminal tactics, suddenly someone asked, “Who is this hacker who sent all of Zhu Lao Liu’s criminal facts and evidence to our computers?”<br/><br/>As soon as the question came up, the atmosphere became quieter.<br/><br/>“Yeah, which hacker is this? Does he have some grudge against Zhu Lao Liu?”<br/><br/>“It doesn’t have to be someone with a grudge against Zhu Lao Liu. It could just as well be a righteous person, angered by Zhu Lao Liu’s tyrannical reign, and decided to take matters into their own hands.”<br/><br/>“That’s actually quite possible!”<br/><br/>“Zhu Lao Liu has been covering the sky with one hand for so long, finally, someone is fed up.”<br/><br/>Just then, Section Chief Zheng arrived at the office in a hurry. When he saw the list of Zhu Lao Liu’s criminal evidence on the computer screen, he laughed excitedly, “Hahaha This is just great”<br/><br/>A moment later, a subordinate came over and said, “Section Chief Zheng, Director Liu is calling an emergency meeting for everyone!”<br/><br/>Section Chief Zheng nodded, “Alright, I got it.”<br/><br/>He immediately told his subordinates, “Comrades, we’re holding an emergency meeting!”<br/><br/>“Yes!”<br/><br/>Meanwhile, in an office<br/><br/>Ma Weiguo was sitting in front of his computer. Of course, he also saw the so-called evidence of Zhu Lao Liu’s crimes. His face was dark, but there was a trace of panic in his eyes. He couldn’t help but worry, thinking, “This Zhu Lao Liu, having done so many illegal things, didn’t even clean up after himself! What now, will I get implicated?”<br/><br/>The events and evidence listed here didn’t specify or emphasize Zhu Lao Liu’s backers, but as long as Zhu Lao Liu was arrested, sooner or later, he would be implicated, unless he found a scapegoat.<br/><br/>“No, I can’t just sit here and wait for death!”<br/><br/>With that thought, he snubbed out his cigarette, and just as he was about to leave, someone came to report, “Director Ma, there will be an emergency meeting in the conference room in five minutes!”<br/><br/>Ma Weiguo hesitated for a moment, then said, “Got it!”<br/><br/>At the same time, all companies and institutions in Licheng, whether they were involved with Zhu Lao Liu or his company, whether they were partners or enemies, all had this information and evidence on their computers.<br/><br/>As a result, some were anxious, while others were excited to the point of tears!<br/><br/>“Hahaha, Zhu Lao Liu, I may not be able to avenge my big brother personally, but there will always be people standing up for justice. Now, let’s see how you, the Licheng Hegemon, can continue to rule!”<br/><br/>“Mom and Dad, the enemy who took over our company is finally getting their comeuppance. Wuuwuu You can finally rest in peace!”<br/><br/>Zhu Lao Liu was still asleep when he suddenly received a phone call. The voice on the phone urgently said, “Zhu Lao Da, it’s bad, some hacker sent all the things you’ve done over the years to everyone’s computers.”<br/><br/>Shrouded in sleep, Zhu Lao Liu didn’t seem to care much as he casually asked, “What illegal things have I done?”<br/><br/>“The evidence of the illegal things like murder, arson, and so on, all of it has been sent out by a hacker. Everyone’s computers have been hacked, everyone’s got it.”<br/><br/>Zhu Lao Liu frowned in confusion, “Weren’t those things taken care of? How could they be dug up again? Wait”<br/><br/>At that moment, Zhu Lao Liu jolted awake and climbed out of bed, then asked again, “What did you say just now? Evidence of murder and arson? How is that possible?”<br/><br/>All the things he had done were cleaned up afterward, so how could they be dug up again now?<br/><br/>The person on the other end of the phone anxiously and excitedly said, “It’s true, it’s popping up on every computer. Not just our office, it’s happening in many units. Zhu Lao Da, you better deal with this using any method or means you have, or we’re all finished!”<br/><br/>Zhu Lao Liu immediately said, “Director Zhang, don’t worry, I’ll handle it.”<br/><br/>As he walked away, he didn’t even have time to put on his clothes, wearing only a pair of shorts.<br/><br/>As he left the room, Second Brother rushed over with a laptop, looking anxious and hurried.<br/><br/>He said, “Lao Da, it’s bad, something big has happened.”<br/><br/>With that, he showed Zhu Lao Liu the computer screen.<br/><br/>As soon as Zhu Lao Liu saw the content on the computer, his expression was furious, and he shouted, “Who the hell is messing with me? And why the hell hasn’t this been dealt with yet, are these people eating shit?”<br/><br/>Second Brother reported solemnly, “We haven’t found the person yet. But, a technician said that it might be a hacker.”<br/><br/>“A top hacker?” Zhu Lao Liu yelled, “What the fuck are those technicians we hired doing? Can’t they even handle one hacker?”<br/><br/>Second Brother said, “This is a top hacker! Their skills are limited, there’s simply no way they can handle it!”<br/><br/>Zhu Lao Liu was about to yell at him when another subordinate ran over and shouted, “Lao Da, it’s bad, the Judicial Bureau people went to our company to search, and I saw them coming this way!”<br/><br/>“What?”\t\t\t\t\t\t</div>", "images": {}, "success": true}