{"id": 218, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344297.html", "title": "Chapter 218 - Chapter 218: Chapter 218:", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 218 - Chapter 218: Chapter 218:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 218: Chapter 218:<br/><br/>Translator: 549690339<br/><br/>After Zhu Lao Liu’s threat had passed, Gao Jianjun reported the safety to Xiao Wanshan and his wife and began to inquire about the flower market.<br/><br/>“Jinli, it’s quite a coincidence, but half a month later, the exhibition centre in the Tianhe Building will be hosting a valuable flower exhibition. They’re inviting flower lovers from all over the world,” Gao Jianjun said. “How about trying to get a booth to exhibit your Seven Color Tea Flowers? The booth costs one hundred and eighty thousand!”<br/><br/>After contemplating a moment, Xiao Jinli said, “Alright, uncle, please get me a booth.”<br/><br/>As long as this flower is sold, the booth fee will be nothing.<br/><br/>Gao Jianjun nodded, “Alright, later, I’ll have someone arrange it!”<br/><br/>Speaking of this, Gao Jianjun thought of another problem and said, “Jinli, the flower seems to be in bud all the time. When will it bloom? The exhibition organizer might want to come and take a promotional photo. If the buds could all bloom, it would be very beautiful, and the promotional effect would be even better, and it could be sold at a higher price!”<br/><br/>Xiao Jinli laughed and said, “It should be in the next couple of days.”<br/><br/>When she wanted these flower buds to bloom, they would bloom.<br/><br/>Since they’re needed now, they must bloom immediately.<br/><br/>Gao Jianjun nodded, “Hmm, that’s good! In the flower industry, this Seven Color Tea Flower is very popular, especially among the rich and noble flower lovers, who favor it even more.”<br/><br/>At night, after locking the doors and windows, Xiao Jinli brought the tea flower into the space.<br/><br/>For the first time in over 10 years, little Zhi had done some work, so the entire smart brain-item felt excited.<br/><br/>This proved that in the past 10 years, it hadn’t allowed itself to become useless.<br/><br/>“Master, you’re here. Do you have any more work?”<br/><br/>Xiao Jinli wanted to roll her eyes and said sullenly, “There isn’t that much work to do!”<br/><br/>Little Zhi looked a bit downcast and said, “Oh!”<br/><br/>Xiao Jinli looked at its appearance, rolled her eyes, and said, “There’s no work now, but there might be some in a few days. Don’t be so disheartened, okay?”<br/><br/>Hearing her words, Little Zhi immediately cheered up.<br/><br/>It asked, “Master, are you telling the truth? There will be work in a few days? What kind of work will it be then?”<br/><br/>Xiao Jinli smiled and said, “Don’t worry, you’ll know in a couple of days.”<br/><br/>Little Zhi looked at the tea flowers in the master’s hand and asked doubtfully, “Why did you bring the tea flowers in again? Aren’t these for sale?”<br/><br/>Xiao Jinli nodded, “They are for sale. I brought them in to make them bloom so that they can be sold at a good price.”<br/><br/>Upon hearing this, Little Zhi quickly said, “Oh” with disappointment!<br/><br/>Making the tea flowers bloom isn’t its job!<br/><br/>The speed in the space is faster than outside. After applying Lingquan water, the Seven Color Tea Flower’s buds all bloomed at the same time, bewitching and beautiful.<br/><br/>Little Zhi tilted his head and said, “This flower looks pretty beautiful. It should be able to fetch a good price!”<br/><br/>“Of course it can fetch a good price. Otherwise, why would I bother bringing it from Ganjiang City to Licheng for sale!” Xiao Jinli rolled her eyes and said!<br/><br/>Little Zhi retorted, “Humph, even if it sells at the highest price, it’s not much money, I don’t know what you’re so happy about.”<br/><br/>Xiao Jinli said solemnly, “I’m happy because I want to be.”<br/><br/>Little Zhi,    Fine, you be happy!<br/><br/>It’s hard to predict anything, for a person who used to have several hundred billion in assets could be so delighted by something worth just millions.<br/><br/>After the Seven Color tea flowers bloomed, Xiao Jinli left the space.<br/><br/>The next day, Gao Yanxin accidentally discovered that the tea flowers had bloomed in seven colors. He was astonished.<br/><br/>He immediately went to knock on Xiao Jinli’s door, unable to control his excitement, and shouted,<br/><br/>“Cousin, wake up quickly! Your Seven Color tea flowers have all bloomed, which is so beautiful.”<br/><br/>Xiao Jinli opened the door, rubbed her eyes, yawned, and called out, “Yan Xin, my cousin.”<br/><br/>Gao Yanxin said again, “Cousin, your tea flowers have bloomed, and they are so beautiful.”<br/><br/>Xiao Jinli was startled, and then seemed very happy, “Really? Then I’ll go take a look!”<br/><br/>When Xiao Jinli ran to the glass room, her maternal aunt and uncle were already there, and they were appreciating the tea flowers in bloom.<br/><br/>Her aunt saw Xiao Jinli appear, waved to her, and smiled, “Jinli, come and see your flowers. The buds have all bloomed overnight, and they are really beautiful. These seven colors are as gorgeous and enchanting as a rainbow.”<br/><br/>Xiao Jinli walked over and calmly nodded, “Yes, it’s beautiful indeed!”<br/><br/>Gao Jianjun said, “Yesterday I was wondering when they would bloom, but I never thought that when I woke up, all seven colors of flowers would be open.”<br/><br/>At this point, he paused, thinking of something, and immediately took out his cellphone, “I’ll call the exhibition people right now, and ask them to send someone over to take a picture! The sooner this flower is promoted, the more people will know about it.”<br/><br/>An hour later, the exhibition staff came with a photographer.<br/><br/>The staff member was an expert and had bright eyes when he saw the gorgeous and enchanting Seven Color tea flowers. He immediately instructed the photographer to take photos from multiple angles.<br/><br/>Afterwards, he laughed with Gao Jianjun, “President Gao, according to my many years of experience, this pot of Seven Color tea flowers can be sold for at least 6,000,000, and this is my most conservative estimate. If it sells well, it could be worth 10,000,000.”<br/><br/>“Director Li, thank you for your help at that time,” Gao Jianjun said happily.<br/><br/>Before, they had estimated the price at around two million.<br/><br/>They never expected that this flower could reach over 10 million.<br/><br/>Never underestimate it.<br/><br/>After Li left with the photographer, Ji Yuzhu gave Xiao Jinli a thumbs-up, “Jinli, this flower could sell for 10 million. You’re rich now.”<br/><br/>Xiao Jinli,<br/><br/>It felt a bit subtle for someone worth several hundred million to congratulate a person worth just millions.<br/><br/>Xiao Jinli smiled and said, “Yes, when the time comes, I’ll treat you and my aunt to a meal at a five-star hotel.”<br/><br/>Ji Yuzhu readily agreed, “Deal!”<br/><br/>Her gaze fixed on the tea flower, she marveled, “I never thought a small pot of tea flowers could sell for millions. It’s really remarkable. If you had ten pots of flowers like this, Jinli, you’d be in the ranks of billionaires.”<br/><br/>After listening, Gao Jianjun laughed, “It’s the scarcity that makes it valuable! If Jinli really had ten pots of Seven Color Tea Flowers, then one pot wouldn’t sell for ten million at all. Even ten pots combined might only be worth the value of one pot, or even less!”<br/><br/>Ji Yuzhu,<br/><br/>Gao Jianjun stared at Xiao Jinli curiously.<br/><br/>He grinned, “I heard from your villagers before that you were blessed by the God of Fortune. In my opinion, not only are you protected by the God of Fortune, but also favoured by the God of Wealth, giving you a pair of money-making hands. Look at the earthworms you raised, and now this pot of high-priced tea flowers, it seems that your wealth is unstoppable.”\t\t\t\t\t\t</div>", "images": {}, "success": true}