{"id": 210, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344282.html", "title": "Chapter 210 - Chapter 210: Chapter 210: The Boldness Of Gao Jianjun (Second Release)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 210 - Chapter 210: Chapter 210: The Boldness Of Gao Jianjun (Second Release)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 210: Chapter 210: The Boldness of Gao Jianjun (Second Release)<br/><br/>Translator: 549690339<br/><br/>Upon hearing Gao Jianjun’s words, the surrounding area fell silent.<br/><br/>Someone then exclaimed in surprise, “What? They are Zhu Lao Liu’s subordinates?”<br/><br/>As for Zhu Lao Liu’s reputation, anyone of a certain status would know.<br/><br/>Besides, those living in this area, either rich or noble people, would undoubtedly know Zhu Lao Liu.<br/><br/>But everyone preferred not to provoke Zhu Lao Liu.<br/><br/>It was said that anyone crossed him would not end well.<br/><br/>If offended to a lesser extent, mere physical harm could be caused; in severe cases, families would be ruined, and lives lost!<br/><br/>Zhu Lao Liu was so domineering; it was no surprise he would stoop to forcefully abducting women.<br/><br/>It was said that Zhu Lao Liu was fond of women, but he was also surprisingly generous to them.<br/><br/>A lot of women who were initially reluctant to depart eventually left with heavy hearts.<br/><br/>Zhu Lao Liu was indeed exceptionally generous when caring for women. Aside from being unable to pluck stars and moon from the sky for them, he could satisfy pretty much any of their desires.<br/><br/>However, when he had no feelings for a woman, he could be utterly ruthless.<br/><br/>Once he broke up and if the woman continued to cling, her ending was likely to be bleak.<br/><br/>But it was also said that Zhu Lao Liu had certain expectations for women he took a liking to, they must be unmarried.<br/><br/>Someone exclaimed in surprise, “Isn’t Zhu Lao Liu always refraining from laying his hands on married women?”<br/><br/>In astonishment, some then looked at Gao Jianjun’s elder aunt.<br/><br/>At one sight, they were all utterly amazed.<br/><br/>They all knew Ji Yuzhu was very pretty, but they didn’t expect her sister to be even more beautiful, even more remarkable.<br/><br/>Even under the dim light, her fair and smooth skin shone, her facial features were exquisite, her big eyes were clear and enticing, and brimming with innocence. Even though she was simply dressed, her perfect figure was still apparent. She was even more beautiful than many big celebrities on television.<br/><br/>Although she seemed aged, she was still full of charm, a kind of allure that many men find irresistible.<br/><br/>“Gosh, is this Ji Yuzhu’s sister? She she’s absolutely stunning, no wonder Zhu Lao Liu actually broke his own rule and abducted a married woman.”<br/><br/>“Indeed, Zhu Lao Liu adheres strictly to his principles in his dealings with women. It’s unexpected that he would break them for a woman as beautiful as her.”<br/><br/>“Alas, now that Zhu Lao Liu has taken a fancy to her, I wonder if it’s fortunate or unfortunate for Gao Jianjun?”<br/><br/>If this woman was willing to be with Zhu Lao Liu, with Zhu Lao Liu’s support, Gao’s Group might even further improve.<br/><br/>But on the flip side, if he offended Zhu Lao Liu …<br/><br/>Gao Jianjun and his party could, of course, hear everyone’s whispers.<br/><br/>In anger, Ji Yuzhu ran to Huang Mao, threw aside her usual dignity and elegance from the upper-class circles, raised her leg, and kicked at Huang Mao.<br/><br/>While kicking, she shouted loudly, “I’m kicking you to death. You really think Zhu Lao Liu is some emperor? If he takes a fancy to my sister, we have to obediently follow suit and let my sister become his woman? Huh, wishful thinking!”<br/><br/>“You colluding scumbag, deserve to die! Do you really think Ji Yuzhu can be pushed around? Go and tell Zhu Lao Liu, he wants my sister? He can dream on!”<br/><br/>Huang Mao started shouting as Ji Yuzhu kicked him.<br/><br/>Gao Jianjun was afraid Ji Yuzhu would genuinely kick Huang Mao to death, so he stepped up to stop his wife, saying, “Bamboo, a couple of kicks should suffice. If you continue, you might actually kick him to death!”<br/><br/>He glanced around and said, “Let’s just get my sister and brother-in-law on the plane! If we don’t, we might miss the flight.”<br/><br/>Ji Yuzhu regaining composure, quickly nodded and said, “Right, let’s quickly get them on the plane!”<br/><br/>Hearing this, some in the crowd blinked, a glint flashing in their eyes.<br/><br/>Xiao Jinli scanned the expressions of the people around her, a glimmer of a dark light in her eyes.<br/><br/>Without a word, Xiao Jinli went up to Xiao Mother, took her hand, and said very earnestly, “Mom, don’t be scared, your daughter will protect you.”<br/><br/>Next, she turned to Xiao Wanshan and said, “Dad, you should leave Licheng with Mom first. Don’t worry, I’ll be fine. You have to believe in your daughter.”<br/><br/>But Gao Jianjun sternly said, “Jinli, you should leave with Mom and Dad!”<br/><br/>Since she hit Zhu Lao Liu’s man, she would certainly be not let off easily.<br/><br/>He was already struggling to protect himself, it would be difficult for him to still protect Xiao Jinli.<br/><br/>Xiao Jinli laughed and said, “Uncle, let’s hurry to the car. If we don’t leave now, we’ll miss the flight.”<br/><br/>But Xiao Wanshan and his wife were very worried about Xiao Jinli and Gao Jianjun’s family. However, they felt it was inappropriate to speak in front of so many people.<br/><br/>After getting into the car, Xiao’s mother’s face was still somewhat pale, with fear in her expression.<br/><br/>Xiao Wanshan held her close, then looked at Gao Jianjun and his wife, with a serious face he said, “After we leave, will Zhu Lao Liu take revenge on you?”<br/><br/>In response, Gao Jianjun forced a bitter smile, “Brother-in-law, there’s no hiding it from you, Zhu Lao Liu holds a lot of power. Now that we’ve crossed him, my company will probably declare bankruptcy in no more than three days.”<br/><br/>Xiao Wanshan and his wife’s faces instantly changed, they asked incredulously, “Is it that serious?”<br/><br/>Gao Jianjun’s company in Licheng was not very big, but it was a medium-sized enterprise with assets exceeding 200 million.<br/><br/>“But you don’t have to worry. This company was started by Bamboo and me from scratch. Even if the company goes bankrupt, we can still make a fresh start somewhere else,” Gao Jianjun reassured.<br/><br/>Xiao’s mother guiltily said, “Jianjun, I’m sorry for causing you such a big problem.”<br/><br/>Ji Yuzhu said, “Sister, you mustn’t say that! If we are to blame, it’s only Zhu Lao Liu, who’s lawless.”<br/><br/>Xiao Jinli highly admired her uncle’s courage. In a choice between family and wealth, he decisively chose family.<br/><br/>For many successful men, this is a truly rare quality.<br/><br/>Xiao Jinli then smiled and said, “Mom, aunt, uncle, you guys shouldn’t be too pessimistic. Maybe it’s a blessing in disguise. Zhu Lao Liu might be powerful, but he’s not above the law. I don’t believe that his current power and position are fair and square.”<br/><br/>“Jinli, I know what you mean,” Gao Jianjun shook his head, “Everyone knows that Zhu Lao Liu attained his current power and position through numerous illegal means. But the problem is, no one can get a handle on him. Otherwise, his arch-rivals would have taken him down a long time ago.”<br/><br/>Does Zhu Lao Liu have any enemies and arch-rivals? Of course, and probably quite a few.<br/><br/>It’s just that his enemies and arch-rivals lack his ferocious tactics, or more likely, Zhu Lao Liu has covered his tracks so thoroughly that no trace of evidence can be found.<br/><br/>Xiao Jinli smiled and said, “Uncle, just because no one could catch him before doesn’t mean no one can catch him now!”<br/><br/>Gao Jianjun and the others,<br/><br/>But they did not take Xiao Jinli’s words seriously.<br/><br/>Gao Jianjun still said seriously, “Jinli, you should go back with your elder sister and brother-in-law, I’ll handle the situations here. There’s no need for someone your age to worry about these things.”<br/><br/>Xiao Jinli,\t\t\t\t\t\t</div>", "images": {}, "success": true}