{"id": 215, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344292.html", "title": "Chapter 215 - Chapter 215: Chapter 215: Escape (Part 1)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 215 - Chapter 215: Chapter 215: Escape (Part 1)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 215: Chapter 215: Escape (Part 1)<br/><br/>Translator: 549690339<br/><br/>When Xiao Jinli brought Gao Yanxin near the Quancheng Palace, Gao Yanxin was shocked.<br/><br/>Quancheng Palace, look at this name, it’s as if the owner considered himself an emperor, it’s so arrogant.<br/><br/>He asked, “Cousin, do you know what this place is?”<br/><br/>“I know, right?” Xiao Jinli nodded and said, “This is Zhu Lao Liu’s villa.”<br/><br/>“Ha, cousin, you know?” Gao Yanxin asked curiously, “How did you know?”<br/><br/>Xiao Jinli replied, “Well, I looked it up online!”<br/><br/>Gao Yanxin wanted to ask more, but Xiao Jinli pointed to a row of special police cars and asked curiously, “Cousin, look, so many police cars. Where are they going?”<br/><br/>Gao Yanxin hesitated for a moment, then excitedly said, “They might be going to the Quancheng Palace?”<br/><br/>Xiao Jinli nodded and said, “It’s very possible. Cousin, let’s watch from here for a while.”<br/><br/>“Yes, yes!” Gao Yanxin agreed without hesitation.<br/><br/>After a while, the special police cars stopped at the entrance of the Quancheng Palace, and then thirty or forty fully armed special police officers quickly surrounded all the exits, obviously encircling the Palace.<br/><br/>An imposing special police officer with a loudspeaker shouted, “People inside, listen up! You are surrounded, put down your weapons and come out!”<br/><br/>Gao Yanxin’s mouth opened wide in shock.<br/><br/>These special police officers were really going after Zhu Lao Liu – it felt like a dream.<br/><br/>Last night, they faced Zhu Lao Liu’s subordinates’ threats trembling with fear, but when they woke up, Zhu Lao Liu had been surrounded by the special police.<br/><br/>The Yamen’s deployment of special police meant that the crimes committed by Zhu Lao Liu and others were extremely serious.<br/><br/>Gao Yanxin stuttered excitedly, “Cousin am I dreaming?”<br/><br/>Xiao Jinli pinched her cousin’s hand.<br/><br/>“Ouch, pain, pain” Gao Yanxin grimaced and shouted in pain, then looked resentful, “Cousin, you were too heavy-handed, weren’t you?”<br/><br/>Xiao Jinli smiled and said, “This is to prove you’re not dreaming.”<br/><br/>Gao Yanxin gnashed his teeth and said, “Yes, yes, I’m not dreaming!”<br/><br/>Immediately after, he excitedly said, “With Zhu Lao Liu and his gang being arrested, does this mean the crisis at our home is over?”<br/><br/>Xiao Jinli nodded and said, “Yes.”<br/><br/>Since she took action, she would definitely crush all the forces in Zhu Lao Liu’s hands at once, and the crisis in the Gao family would naturally be lifted!<br/><br/>After the police commander had shouted three or four times through the loudspeaker, people began to come out with their hands up, weapons lowered.<br/><br/>But these people were all minor thugs.<br/><br/>Xiao Jinli frowned slightly.<br/><br/>“Zhu Liulong, you are surrounded, put down your weapons and surrender!” The commander called out directly by name.<br/><br/>The special police captain furrowed his brow and said, “I’ll go in now with my men! Team one and two, follow me. Teams three and four, secure each exit!”<br/><br/>“Yes!”<br/><br/>Not long after the special police captain entered, they heard “bang bang” sounds inside.<br/><br/>Gao Yanxin listened to the sounds and his face turned pale. He pulled on his cousin’s sleeve and said, “Cousin, let’s leave. I feel this place is very dangerous. If someone escapes from inside and takes us hostage, it will be troublesome.”<br/><br/>Xiao Jinli nodded and said, “Alright!”<br/><br/>As they were walking back, after a certain distance, Xiao Jinli suddenly clutched her stomach and said, “Cousin Xin, I can’t take it anymore, my stomach hurts, I need to lighten the load immediately.”<br/><br/>Gao Yanxin looked around and found no public toilet nearby. He asked, “What should we do? There seems to be no public toilet here.”<br/><br/>Xiao Jinli looked around and then pointed to a place, saying, “There’s a hotel over there. Let’s go there!”<br/><br/>Gao Yanxin nodded.<br/><br/>Two minutes later, they arrived at the hotel.<br/><br/>Xiao Jinli said, “Cousin Xin, you wait for me in the lobby.”<br/><br/>Zhu Lao Liu never expected that his empire would collapse overnight.<br/><br/>“Boss, what should we do?” Second Brother asked nervously and fearfully as he listened to the shouting outside.<br/><br/>Zhu Lao Liu glanced at him coldly and said, “What’s there to be afraid of? We’ve been through many storms. We’ve been raided by Yamen officials before. In the end, they had to leave obediently!”<br/><br/>Second Brother nearly cried, “But this time is different. These are the special police. Let’s let’s surrender!”<br/><br/>Surrender might offer a chance at survival. If they resist and run, then it could be a dead end.<br/><br/>As soon as he finished speaking, he received a scolding, “We can’t surrender. I, Zhu Lao Liu, have come so far to achieve my current status and position, becoming the hegemon of Licheng, and having almost unchecked power in Licheng. How could I admit defeat? If I do, everything will be ruined.”<br/><br/>He paced back and forth in the hall, talking as he walked, “We can’t surrender. If we do, I’ll lose everything I’ve gained, and maybe even my life. I must escape. That’s right, escape. As long as I escape, I can start from scratch and become a hegemon again somewhere else.”<br/><br/>Upon hearing Zhu Lao Liu’s words, cold sweat dripped down from the corner of Second Brother’s forehead. He wiped it away but couldn’t help reminding, “But we are surrounded, how can we escape?”<br/><br/>As soon as Zhu Lao Liu heard this, he stopped in his tracks, glaring coldly at Second Brother, and said viciously, “We’ll fight our way out!”<br/><br/>As his words fell, they heard a noise in the courtyard.<br/><br/>Second Brother turned pale with fear, “Boss the special police are in. What what should we do?”<br/><br/>Zhu Lao Liu said coldly, “We’ll go!”<br/><br/>With that, he headed toward the backyard, went to a big tree in the backyard garden, and stomped on a patch of lawn. Then, he quickly removed that piece of turf and placed it aside, revealing wires connected to it, which also ran through a well cover.<br/><br/>Second Brother’s eyes widened in amazement.<br/><br/>He stuttered, “This this”<br/><br/>“Never mind that, help me remove the well cover!”<br/><br/>Second Brother obediently removed the well cover.<br/><br/>Zhu Lao Liu quickly jumped down and found something. He then said, “Jump down and close the well cover.”<br/><br/>Once Second Brother jumped down, they closed the well cover.<br/><br/>Zhu Lao Liu pressed the remote controller in his hand, and the lawn on the ground automatically returned to its original state.<br/><br/>No one would notice the secret here if they weren’t paying attention.\t\t\t\t\t\t</div>", "images": {}, "success": true}