{"id": 219, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344298.html", "title": "Chapter 219 - Chapter 219: Chapter 219: Prestigious Flower Exhibition (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 219 - Chapter 219: Chapter 219: Prestigious Flower Exhibition (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 219: Chapter 219: Prestigious Flower Exhibition (First Update)<br/><br/>Translator: 549690339<br/><br/>Precious flowers, precious flowers, the reason they are considered valuable is because they are rare, and have unique properties and beautiful appearance.<br/><br/>Seven Color Tea Flower is also one of the top ten precious flowers in the world.<br/><br/>Therefore, the dazzlingly colorful and enchanting Seven Color Tea Flower in Xiao Jinli’s hand, once it was publicized, attracted the attention and love of many flower enthusiasts.<br/><br/>Many people called the exhibition committee to inquire about the origin of this pot of flowers.<br/><br/>Soon, the day of the exhibition arrived.<br/><br/>Xiao Jinli wore a sea blue princess dress prepared for her by Ji Yuzhu, but she couldn’t help but be forced to put it on by her maternal aunt, even though she loved the dress.<br/><br/>Initially, the princess dress was pink, but Xiao Jinli strongly resisted that color. After her protest proved ineffective, the dress was changed to sea blue.<br/><br/>Ji Yuzhu’s family of three also dressed very properly and dignified, with the father and son wearing suits and leather shoes, and Ji Yuzhu wearing a yellow-green dress that perfectly complemented the vibrant spring atmosphere at the flower show.<br/><br/>The exhibition hall was on the first floor of the Tianhe Building and in the backyard garden.<br/><br/>In the backyard garden, a smart glass house was built.<br/><br/>Some flowers prefer shade, while others prefer sunshine.<br/><br/>Shade-loving flowers were indoors, while sun-loving flowers were in the backyard garden.<br/><br/>These flowers were all delivered the day before the exhibition.<br/><br/>As these flowers were all precious and worth several thousand, hundreds of thousands, or even millions, the committee was very cautious when handling each pot of flowers. In addition to hiring professional staff to take care of them, they also employed fifty to sixty bodyguards to ensure the best security measures in place.<br/><br/>Xiao Jinli’s pot of tea flower, a sun-loving plant, was naturally placed in the glass house in the backyard.<br/><br/>After receiving the invitation, Gao Jianjun’s group was led to the exhibition room by the staff.<br/><br/>The indoor flowers were each covered with a glass cover, which had many small holes on it for the flowers to breathe.<br/><br/>Everyone could only admire and evaluate the flowers through the glass.<br/><br/>However, there weren’t many indoor flowers, just about a dozen pots.<br/><br/>Gao Yanxin asked in a low voice, “Cousin, your flower isn’t in here?”<br/><br/>Gao Jianjun glanced at him and said, “Jinli’s flower is in the glass house. Let’s go and take a look.”<br/><br/>He wasn’t a flower enthusiast himself, and the indoor flowers didn’t interest him very much.<br/><br/>He came to the exhibition purely because Xiao Jinli’s flower was there.<br/><br/>The group then entered the glass house.<br/><br/>They saw an array of exotic flowers and plants, many of which were rare and valuable and not commonly seen in the market.<br/><br/>For example, a pot of North American Holly was placed at the entrance, with its red bright berries making it very festive and beautiful. On the left side was a pot of European Spindle, with its small flowers with elegant lines, appearing pink from a distance and looking like little bells up close, cute and lovely.<br/><br/>There were also the Bird of Paradise, resembling a bird about to take flight,<br/><br/>The Pouch Peony, with its clusters of flowers hanging upside down, looking like little pouches,<br/><br/>And Madagascar Dragon Tree, White Jade Narcissus, Porcelain Rose, and so on.<br/><br/>So many flowers that even ten pairs of eyes might not be enough for a flower enthusiast to see them all.<br/><br/>Unlike the indoor flowers covered with glass, the flowers in the glass house were neatly arranged in rows, with enough space left between each pot for people to appreciate them.<br/><br/>Each pot of flowers had relevant introductions and the minimum sale value.<br/><br/>The so-called lowest selling price, this means silent bidding.<br/><br/>Silent Bidding: If a flower lover fancies this pot of flowers, they take a card from the staff, write down the serial number, write down their own bid, and then put it into a hidden box on the counter.<br/><br/>The highest bidder wins!<br/><br/>However, there are ten pots of flowers without marked prices, which are isolated in a glass room and can only be observed from a distance.<br/><br/>The flowers without marked prices are for open bidding and direct auction.<br/><br/>These ten pots of flowers are: Peony Yao Huang, the top flower among flowers; Handsome Banner, a rare chrysanthemum; Lotus Petal Orchid; Dance Queen Lotus; Spring Water Rose; White Jade Narcissus; Night Queen Tulip; Golden Osmanthus; Rhododendron Yingshanhong, and Seven Color Tea Flower.<br/><br/>The reason why these ten pots of flowers are up for open bidding auction is that they have undergone professional appraisal, and their values have all reached over 2 million.<br/><br/>Gao Yanxin was dazzled and exclaimed, “I didn’t know until I saw it, but it’s quite shocking. A pot of flowers is worth several million, which really broadened my horizon. However, speaking of it, what do those who buy these flowers worth several million do with them? Just specifically for display, but can’t one get tired of admiring them every day, no matter how beautiful they are?”<br/><br/>Xiao Jinli,<br/><br/>Those flower lovers who heard Gao Yanxin’s words glared at him with unhappy expressions, but their quality was excellent, so they didn’t argue with a child.<br/><br/>Gao Yanxin had a confused expression.<br/><br/>Gao Jianjun also glared at him and said unhappily, “Inviting you to appreciate the flowers is like giving a cow peony to chew! If you don’t understand, shut up!”<br/><br/>Although he also couldn’t appreciate flowers, seeing so many beautiful flowers was still pleasing to the eye.<br/><br/>The flower exhibition lasted six days.<br/><br/>During the first five days, in addition to letting flower lovers appreciate the flowers, the most important thing was to sell all the flowers.<br/><br/>The last day was the grand finale.<br/><br/>The auction of the ten pots of flowers.<br/><br/>As they entered the auction venue, they heard discussions from time to time.<br/><br/>“The several pots of flowers this year are not bad.”<br/><br/>“Yes, at first, I had my eyes on the Dance Queen Lotus, but now I want that Seven Color Tea Flower even more.”<br/><br/>“I don’t know how that Seven Color Tea Flower was cultivated. The flowers are bright and the fragrance is delicate. When I smell the fragrance, I feel particularly comfortable.”<br/><br/>“It’s strange, there have been Seven Color Tea Flowers before, but the fragrance was not so strong, and it just smelled good without making people feel particularly comfortable!”<br/><br/>“At first, I thought it was just a coincidence. The first time I approached the tea flower, my irritated mood instantly became cheerful, and my somewhat dizzy head became instantly clear. But on the second day, the third day, and for the past several days, this effect has been the same, which means it must be because of that pot of flowers.”<br/><br/>“I don’t know who the master of this pot of flowers is. Can we ask him to introduce the flower and see if it really has such an effect?”<br/><br/>“Let’s go to the organizing committee and inquire about it.”<br/><br/>Gao Yanxin secretly asked, “Cousin, does that flower really make people’s ears and eyes clear and comfortable?”<br/><br/>Xiao Jinli nodded and said, “Yes!”<br/><br/>The flowers grown with Lingquan water emit a fragrance that is mainly composed of spiritual energy. Of course, it can make people feel comfortable, and long-term absorption of this kind of spiritual energy can nourish the body and contribute to health and longevity.<br/><br/>It was then that Gao Yanxin suddenly realized, “No wonder I felt so comfortable when I was holding the pot of flowers!”<br/><br/>Gao Jianjun, who had put down the phone, said to Xiao Jinli, “Jinli, the organizing committee called and said that a few distinguished guests wanted to meet the owner of that pot of tea flowers. These guests are all very distinguished. Will you meet them?”<br/><br/>Xiao Jinli hooked her lips and nodded in agreement, “Of course, I will meet them.”\t\t\t\t\t\t</div>", "images": {}, "success": true}