{"id": 214, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344290.html", "title": "Chapter 214 - Chapter 214: Chapter 214: The Plot Thickens (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 214 - Chapter 214: Chapter 214: The Plot Thickens (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 214: Chapter 214: The Plot Thickens (Second Update)<br/><br/>Translator: 549690339<br/><br/>Gao Jianjun and Ji Yuzhu didn’t sleep all night.<br/><br/>They didn’t know what they would face the next day?<br/><br/>Would it be an inspection by various departments, or a deliberate difficulty by Zhu Lao Liu?<br/><br/>But no matter which it was, they had to cheer up and face it.<br/><br/>No matter when the company would go bankrupt, the company was like their child. Ever since its establishment, they had managed to secure a foothold in Licheng. So, they pledged themselves to hold on as long as they could. They didn’t want to give up until the last moment.<br/><br/>Gao Jianjun cuddled Ji Yuzhu and asked, “Wife, would you still like me if I really became a pauper with nothing?”<br/><br/>Ji Yuzhu leaned on his chest and retorted mischievously, “You make it sound like you were a big boss before we got married. When we got married, you were a poor boy with nothing.”<br/><br/>As she spoke, she was fiddling with Gao Jianjun’s fingers and said, “Husband, we went from having nothing to our current company. Even if we lose it again, we can rise again.”<br/><br/>Gao Jianjun nodded and said, “Yes, we can rise again. But wife, you have to follow me and suffer hardship again!”<br/><br/>Ji Yuzhu replied with a smile, “No matter how difficult the days are, as long as I’m with you, it’s sweet.”<br/><br/>At this point, Ji Yuzhu said very seriously, “Husband, thank you!”<br/><br/>Thank you for not betraying my sister, even after losing all our property!<br/><br/>Thank you for giving me endless love!<br/><br/>Gao Jianjun laughed and touched her delicate nose saying, “What are you thanking me for? Your sister is my sister! If I, Gao Jianjun, were a person who betrayed my family for profit, a person like that, you wouldn’t marry, would you? Now let’s go to sleep, rest well, and gather energy to face tomorrow’s challenges!”<br/><br/>After that, the couple went to bed.<br/><br/>Whether or not they actually fell asleep, only they themselves knew.<br/><br/>The next day, they got up early, dressed and ready to go to the company!<br/><br/>“‘Xin er’, your cousin and you stay at home! Your mom and I are going to the company first.”<br/><br/>But Gao Yanxin replied, “Dad, let me go to the company with you guys.”<br/><br/>He knew what challenges his parents would face at the company today, and he wanted the family to face it together.<br/><br/>Ji Yuzhu shook her head and said, “No, you stay at home and protect your cousin! As for the company, your father and I will handle it. Don’t worry. As little Jinli said, we act with integrity, do things upright, and we haven’t evaded any taxes. Those who want to cause trouble will find it difficult to find an excuse!”<br/><br/>After Xiao Jinli finished washing up, she came over smiling, “maternal aunt, uncle, today will certainly be a lucky day. Well, my cousin and I will stay at home waiting for your good news!”<br/><br/>“Alright, you two stay at home. Don’t run around, Zhu Lao Liu’s people are all over the city, it’s very dangerous.” Gao Jianjun said seriously.<br/><br/>“Okay, my cousin and I will stay at home obediently!” Xiao Jinli nodded dutifully.<br/><br/>After Gao Jianjun and his wife left, Gao Yanxin wore a look of nervousness.<br/><br/>Xiao Jinli winked at him and mischievously asked, “Cousin, do you want to go watch a drama?”<br/><br/>“A drama?” Gao Yanxin asked in confusion, “Where do we watch a drama? Do you mean to go watch a movie?”<br/><br/>Xiao Jinli shook her head and said, “Not a movie, a drama! Come on, cousin, follow me, it’s going to be an amazing drama!”<br/><br/>As Gao Yanxin stood up, he immediately shook his head and said, “No, our parents said that we should stay at home today as it’s very dangerous outside!”<br/><br/>Xiao Jinli shook her head and said, “Cousin, trust me, it won’t be dangerous!”<br/><br/>Gao Yanxin remained unmoved!<br/><br/>Xiao Jinli turned her eyes and then said earnestly, “Cousin, if you don’t go, then I’ll sneak out! I tell you, I don’t want to miss this drama. If I miss it, I will regret it!”<br/><br/>Gao Yanxin asked, “Cousin, what kind of drama is it, that it’s so interesting? Are there DVDs or is it available online? Why don’t we buy the DVD home or watch it online.”<br/><br/>Xiao Jinli shook her head, “That won’t work. This drama, we must see it live! Cousin, are you coming or not? If not, then I am going. I tell you, you can’t stop me.”<br/><br/>Threatened by his cousin, Gao Yanxin, who is controlling sister, nodded and said, “Fine, I’ll go with you. But let’s make it clear before we go, we’ll come back home immediately after watching the drama, and we must not let our parents know.”<br/><br/>“Hmm, hmm, I got it!” Xiao Jinli nodded.<br/><br/>Then, they carefully left the villa, and once they saw no one around, they quickly hailed a taxi.<br/><br/>After telling the taxi driver a location, Gao Yanxin reacted in hindsight, “Wait, cousin, you’ve never been to our Licheng before, how do you know this place?”<br/><br/>Gao Jianjun and his wife arrived at the company at six thirty.<br/><br/>In the company, no one was on duty except for the security guard.<br/><br/>The security guard was quite surprised to see the president and his wife arrive so early, but they didn’t ask. They just greeted them.<br/><br/>Standing in front of the company, their emotions were quite complicated, sorrow, reluctance, and many other feelings intermixed. They entered the company and took a look at everything.<br/><br/>After a while, Gao Jianjun holding Ji Yuzhu’s hand, sighed lightly and said, “Let’s go. No matter what happens in a while, let’s first sort out the files and documents in our hands. If the company really goes bankrupt, these things might be our valuable assets for a comeback.”<br/><br/>Ji Yuzhu nodded and said, “Hmm.”<br/><br/>When they arrived at the president’s office, they looked around the office.<br/><br/>Although the office was not large, with only twenty or thirty square meters of space, it had a bookcase, an office table, two pot plants, a sofa seat, etc.<br/><br/>They couldn’t be sentimental for too long. Soon, they began to sort out the documents because the time left for them wouldn’t be much.<br/><br/>By seven thirty, people began to arrive for work. When someone turned on the computer, there was a sudden outcry.<br/><br/>“Ah, what’s wrong with this computer? Has it been hacked?”<br/><br/>“Thisthis is Zhu Lao Liu’s criminal evidence? My God, Zhu Lao Liu is really ruthless, he has done so much evil!”<br/><br/>“Beast, no, he’s even worse than a beast!”<br/><br/>High Jianjun and his wife, who were sorting out the documents, had no idea about the commotion outside.<br/><br/>When the phone rang, Gao Jianjun answered it, and once he heard what the other party said, he immediately stood up, looking excited and said, “Really? Okay, okay, I got it!”<br/><br/>After he hung up the phone, he immediately fumbled to turn on the computer.<br/><br/>Ji Yuzhu asked puzzledly, “Husband, who was it? What did they say on the phone?”<br/><br/>High Jianjun, looking very excited and thrilled, said, “Bamboo, I don’t know who the top hacker is. They’ve exposed all the evil deeds Zhu Lao Liu has done.”<br/><br/>“Haha, that’s really great. Haha”\t\t\t\t\t\t</div>", "images": {}, "success": true}