{"id": 216, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344293.html", "title": "Chapter 216 - Chapter 216: Chapter 216: Xiao Jinli Waiting (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 216 - Chapter 216: Chapter 216: Xiao Jinli Waiting (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 216: Chapter 216: Xiao Jinli Waiting (Second Update)<br/><br/>Translator: 549690339<br/><br/>Zhu Lao Liu and Second Brother followed the secret passage and successfully escaped Quan Cheng Gong under the encirclement of the special police.<br/><br/>Looking at the bright passage, Second Brother asked doubtfully and excitedly, “Boss, where does this secret passage lead to? Does it lead out of the city? If it leads out of the city, then we can leave Licheng directly!”<br/><br/>Zhu Lao Liu pursed his lips and ignored him, instead looking ahead. He estimated that they should be reaching the end soon.<br/><br/>When building the house, he had considered leaving himself an escape route.<br/><br/>At that time, he had asked a distant relative of a subordinate to build it for him. Those people had no idea who they were working for.<br/><br/>Upon reaching the end, Zhu Lao Liu called out to Second Brother, “We’re at the end.”<br/><br/>He then pressed a remote controller, and the exit opened instantly, with the light shining in.<br/><br/>Zhu Lao Liu squinted his eyes and said, “Second Brother, you go first! See if there’s anyone around!”<br/><br/>“Alright!” Second Brother replied.<br/><br/>He then climbed up the ladder and looked around. It was under a big tree, surrounded by a lawn.<br/><br/>Crouching down, he said to Zhu Lao Liu, “Boss, there’s no one. Come up.”<br/><br/>When Zhu Lao Liu came up, both of them took a deep breath, resealed the secret tunnel, and stood up, ready to leave quickly. However, they were startled when they turned around and took a few steps back with a terrible look on their faces.<br/><br/>“Hello!”<br/><br/>Xiao Jinli was propping her chin with one hand and waving with the other, greeting them.<br/><br/>If you didn’t know any better, you’d think they were close friends.<br/><br/>“Who are you?” Second Brother asked in alarm, “Where did you come from, girl?”<br/><br/>He hadn’t seen anyone there earlier.<br/><br/>Yet in just a short amount of time, she appeared behind them, which was too strange.<br/><br/>“It’s you!” Zhu Lao Liu recognized Xiao Jinli, looking very surprised, “What are you doing here?”<br/><br/>Xiao Jinli had an expression that didn’t match her age, and she ambiguously smiled and said, “Of course, I’m waiting for you!”<br/><br/>“What? Wait for me?” Zhu Lao Liu’s heart skipped a beat, and he was extremely surprised, “Did Gao Jianjun send you? But how is that possible?”<br/><br/>This secret passage was carefully designed. Except for the original construction crew, only he, the master of the house knew about it.<br/><br/>How did Gao Jianjun find out?<br/><br/>Xiao Jinli shook her head, waved her finger, and said, “Nope.”<br/><br/>“If it’s not Gao Jianjun, then how did you get here? This is impossible,” Zhu Lao Liu said in confusion.<br/><br/>Second Brother reminded, “Boss, we don’t have much time. We shouldn’t waste so much time talking to her. Let’s make a decisive move” He made a throat-slitting gesture.<br/><br/>A vicious look flashed in Zhu Lao Liu’s eyes, and he said ferociously, “You little girl shouldn’t have appeared here. It’s your fault for knowing too much.”<br/><br/>With that, he took out his gun and aimed directly at Xiao Jinli.<br/><br/>But Xiao Jinli calmly smiled and asked, “Zhu Lao Liu, don’t you want to know who the top hacker is who left the criminal evidence on your computer today?”<br/><br/>“Who is it?” Zhu Lao Liu asked excitedly.<br/><br/>Of course, he wanted to know.<br/><br/>He wanted to tear that person into pieces!<br/><br/>If it weren’t for that top hacker, he wouldn’t be hiding like a bereaved dog now.<br/><br/>He would still be the high and mighty Licheng Hegemon!<br/><br/>“Hehe” Xiao Jinli giggled and said, “It it’s me!”<br/><br/>“What?” Both Second Brother and Zhu Lao Liu widened their eyes in astonishment.<br/><br/>“How is that possible?” Second Brother didn’t believe it, “How old are you? There’s no way your computer skills have reached the level of a top hacker! It’s impossible!”<br/><br/>Even if someone were a genius or exceptionally gifted, they couldn’t have possibly achieved such an astonishing level at such a young age.<br/><br/>Zhu Lao Liu seemed to have come to his senses, and anger flashed across his face. Coldly, he said, “You little brat, are you trying to stall for time? Let me tell you, whether you’re that top hacker or not, you’re dead today.”<br/><br/>With that, he fired two shots at Xiao Jinli.<br/><br/>However, incredibly, the little girl dodged the bullets.<br/><br/>“This is impossible!”<br/><br/>How could anyone be fast enough to dodge bullets?<br/><br/>But just now, they had seen a figure flash past them.<br/><br/>What shocked them even more was that when the child opened her hand, the bullet laid quietly in her palm.<br/><br/>She caught the bullet with her bare hand!<br/><br/>“No, I don’t believe it!” Zhu Lao Liu shook his head, and then with a panicked expression and frightened eyes, he picked up his gun and started firing continuously at Xiao Jinli.<br/><br/>After that, they saw white afterimages flashing non-stop.<br/><br/>But after ten bullets had been fired, Xiao Jinli wasn’t even grazed!<br/><br/>Zhu Lao Liu and Second Brother became more and more terrified, thinking that the girl was too strange.<br/><br/>Dodging one bullet would be luck, but dodging ten in a row would be true ability!<br/><br/>Both of them stopped, and their expressions turned into shock and astonishment!<br/><br/>When Xiao Jinli opened her palms, ten bullets were lying in her hands!<br/><br/>Xiao Jinli hooked her lips and asked half-jokingly, “Any more?”<br/><br/>But for Zhu Lao Liu and Second Brother, it was like facing a demon.<br/><br/>Second Brother was the first to react, “Boss, time is ticking. We have to leave quickly, otherwise, we’ll attract attention.”<br/><br/>Zhu Lao Liu also came to his senses, he glared viciously at Xiao Jinli and growled, “You little girl, I’ll remember this grudge. In the future, I’ll have you suffer a thousand cuts, make you unable to live or die!”<br/><br/>With that, the two of them looked around and prepared to leave.<br/><br/>Xiao Jinli quickly blocked their way, her eyes cold and voice emotionless, “I don’t know what will happen to me in the future, but I do know what will happen to you! If you want to leave, did you ask my permission?”<br/><br/>Since she had taken action, she had to finish them off to prevent future troubles.<br/><br/>With that, she pinched three or four silver needles in her hand.<br/><br/>With a wave of her hand, the silver needles flew towards them.<br/><br/>In an instant, they fell to the ground, paralyzed except for their eyes.<br/><br/>Xiao Jinli walked up to Zhu Lao Liu, her face scornful and her eyes icy. She said indifferently, “Since childhood, you’re the first person to annoy me. Zhu Lao Liu, I must say, your ability is quite impressive.<br/><br/>You could have continued being the Licheng Hegemon, and I could have remained an ordinary country girl. But you just had to set your sights on my mother.<br/><br/>My mother, a pure and kind woman, how can someone as sinful as you possibly humiliate her?<br/><br/>Not to mention, you threatened my uncle too?<br/><br/>You wanted my uncle’s company to disappear from Licheng? I thought that instead of letting his company disappear, why not get rid of you, the Licheng Hegemon, as a public service to everyone.”<br/><br/>Zhu Lao Liu’s eyes darted around, as if he wanted to say something, but he couldn’t.<br/><br/>Xiao Jinli’s ears twitched, and she smiled and said, “Someone’s coming, huh? Is it your men or the special police? Let’s see how lucky you are.”<br/><br/>Fear filled Zhu Lao Liu’s eyes.\t\t\t\t\t\t</div>", "images": {}, "success": true}