{"id": 217, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344295.html", "title": "Chapter 217 - Chapter 217: Chapter 217:", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 217 - Chapter 217: Chapter 217:</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 217: Chapter 217:<br/><br/>Translator: 549690339<br/><br/>When Xiao Jinli came out of the bathroom, Gao Yanxin immediately asked, “Cousin, you finally came out. If you didn’t come out soon, I would have thought you fell into the toilet and was going to find someone to check on you.”<br/><br/>Of course, he was joking.<br/><br/>In fact, he was very worried.<br/><br/>The hotel was not far from Quancheng Palace, and he feared that Xiao Jinli would run into Zhu Lao Liu and his gang of bad guys.<br/><br/>Xiao Jinli’s face turned slightly red as she quietly said, “I ate some greasy food yesterday and got a bit constipated today!”<br/><br/>Gao Yanxin understood immediately, knowing that girls are often shy about such matters, so he didn’t ask further.<br/><br/>He asked, “Cousin, are we going home now?”<br/><br/>Zhu Lao Liu might not have been caught yet, and it was still dangerous outside, especially with such a pretty cousin.<br/><br/>It’s all in the family genes.<br/><br/>Wasn’t it because Zhu Lao Liu was attracted to her elder aunt’s beauty that he became such a danger to the Gao family?<br/><br/>Xiao Jinli said with a smile, “Cousin Yanxin, since I came out, I want to go out and have a look around, is that okay?”<br/><br/>Gao Yanxin hesitated, “But our parents asked us to stay home, it’s too dangerous outside right.”<br/><br/>He was a well-behaved child.<br/><br/>Xiao Jinli said with a smile, “Zhu Lao Liu and his gang of bad guys have been caught, so what do we have to be afraid of? Cousin Yanxin, I want to go to the flower market. You know, the purpose of my trip to Licheng is to sell the flower I brought. So now I need to scope out the market early, right?”<br/><br/>Gao Yanxin replied directly, “Cousin, if you want to sell flowers, you can just give them to my dad. My dad will definitely get you a good price. I heard my dad say that your flower is a Seven Color Tea Flower, right?”<br/><br/>Xiao Jinli nodded, “Yes, the Seven Color Tea Flower.”<br/><br/>Gao Yanxin frowned, thought for a moment, and said, “Cousin, the Seven Color Tea Flower is a very valuable flower. It would be best to sell it at a flower auction to get a better price. Otherwise, your flower might just be a little more expensive than ordinary flowers.”<br/><br/>Xiao Jinli said, “I know that. But I still want to go to the flower market to have a look and see if I can find some flowers I like and buy some back.”<br/><br/>At this point, Xiao Jinli tugged at Gao Yanxin’s sleeve and coquettishly said, “Cousin Yanxin, please accompany me to have a look. How about this, we go back early and arrive home before my maternal aunt and uncle get back, okay?”<br/><br/>Gao Yanxin couldn’t resist Xiao Jinli’s charm.<br/><br/>When she acted cute, he would definitely surrender.<br/><br/>He gritted his teeth and said, “Okay, cousin, when we get to the market, you must not run around and walk around at will. You must stick close to me, understand? And we must go home early.”<br/><br/>After saying this, he laughed at himself somewhat helplessly, “Really, if my parents knew that I secretly took you out, they would definitely scold me.”<br/><br/>Xiao Jinli patted her little chest and promised, “Don’t worry, Cousin Yanxin, you have me. When my uncle scolds you, I’ll say a few good words for you. He loves me so much, he’ll definitely listen to me.”<br/><br/>Gao Yanxin,    Although his words stabbed his heart a bit, they also warmed it.<br/><br/>As they were about to leave the hotel, they heard police sirens, “Dee woo dee woo dee woo “.<br/><br/>After a while, more than ten special police officers with weapons stormed in, and the entire hotel lobby became a bit startled and chaotic.<br/><br/>One of the special police officers immediately said to the hotel staff, “Please evacuate the crowd in the lobby immediately.”<br/><br/>The staff immediately cooperated in evacuating the customers in the lobby.<br/><br/>The special police went straight to the back of the hotel.<br/><br/>There was a lawn park behind the hotel, and in order to save time and prevent the suspects from escaping, they took the shortest route.<br/><br/>Going through this hotel was the nearest way.<br/><br/>When they got to the back, they encircled the area with a fence, and the special police officers swiftly climbed over it.<br/><br/>At first glance, they saw two people lying under a big tree, unable to move.<br/><br/>They immediately noticed that these two people were Zhu Lao Liu and Second Brother, who had been on the run.<br/><br/>“Captain, these two seem to have had a stroke and paralyzed?” They reported after checking the two’s condition.<br/><br/>The special police captain frowned, “Both of them had a stroke and are paralyzed?”<br/><br/>“Judging from their current condition, it seems that way! But it seems even more severe. They can move their eyeballs a little, but they can’t move anything else.”<br/><br/>“What happened? How did they end up here?”<br/><br/>After a moment, someone reported, “Captain, there’s a sewer here. It looks like they escaped through the sewer.”<br/><br/>“Go down and check!”<br/><br/>“Yes!”<br/><br/>After handcuffing Zhu Lao Liu and Second Brother and waiting for a while, the person who went down to check came back up and reported, “Captain, this sewer seems to be a specially constructed secret passage. It is equipped with water and electricity and can directly connect to the backyard garden of Quancheng Palace.”<br/><br/>“Damn it, no wonder we couldn’t find their whereabouts. So they escaped through the secret passage.”<br/><br/>“You two guard this passage, and the rest of you take them away!”<br/><br/>“Yes!”<br/><br/>As they were escorting Zhu Lao Liu and Second Brother past Xiao Jinli, their expressions changed obviously, and they became very excited. They “whimpered” in their mouths, but no one knew what they were saying.<br/><br/>In a place where no one noticed, Xiao Jinli also gave them a mocking expression, her lips curling up!<br/><br/>Gao Yanxin, who was standing beside her, looked at Zhu Lao Liu being taken away, surprised at first, then became excited and elated!<br/><br/>“HahaCousin, that’s Zhu Lao Liu, they actually caught him! Hahathis is great!” Gao Yanxin excitedly grabbed Xiao Jinli’s hand, leaving two red marks on her wrist.<br/><br/>Xiao Jinli didn’t say anything!<br/><br/>“HahaI’m going to call my dad and tell him and my mom the good news!”<br/><br/>He was talking while taking out his cellphone.<br/><br/>Xiao Jinli didn’t want to spoil her cousin’s enthusiasm, so she didn’t remind him!<br/><br/>“Dad, I have some good news to tell you. Zhu Lao Liu has been captured. Haha how do I know? Of course, I saw it myself, dad, you don’t know, a group of special police surrounded Quancheng Palace, and Zhu Lao Liu and Second Brother were captured behind the Star River Hotel.”<br/><br/>As soon as Gao Yanxin finished speaking, a roar came from the other end of the phone!<br/><br/>“Gao Yanxin, did you just ignore what I said to you?” Gao Jianjun roared, “I told you to stay with your cousin at home, but you actually took her out and went directly to Quancheng Palace, are you looking for death? Humph, just wait till I get home to deal with you!”<br/><br/>Gao Yanxin held the phone with a stunned expression!<br/><br/>He had forgotten that he had sneakily taken his cousin out.<br/><br/>After hanging up the phone, Gao Yanxin said to Xiao Jinli with a bitter face, “Well, cousin, we don’t need to go back early either. I couldn’t help but tell my dad that I brought you out. My dad and your uncle said, when I get back, they’ll settle the score with me.”<br/><br/>Xiao Jinli,\t\t\t\t\t\t</div>", "images": {}, "success": true}