{"id": 211, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344285.html", "title": "Chapter 211 - Chapter 211: Chapter 211: Unlucky To The Core (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 211 - Chapter 211: Chapter 211: Unlucky To The Core (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 211: Chapter 211: Unlucky to the Core (First Update)<br/><br/>Translator: 549690339<br/><br/>Xiao Wanshan and his wife felt guilty, but they also knew that by staying at this time, they would only cause more trouble. So, the couple got on the plane without any problems.<br/><br/>“Damn it, why is there no signal at such a critical moment?” A middle-aged man complained angrily, tossing his cellphone away inside a villa in Gao Jianjun’s territory.<br/><br/>The woman beside him asked doubtfully, “Husband, who are you trying to call so late at night?”<br/><br/>Zhu Jianshan, obviously irritated, said, “It’s none of your business. Let me see your cell phone.”<br/><br/>Mrs. Zhu’s facial expression stiffened for a moment, but she still handed her phone over.<br/><br/>Zhu Jianshan took a look and found that this phone also had no signal.<br/><br/>With an annoyed expression, he said, “What the hell is going on? Fine, let me try the landline.”<br/><br/>After saying that, he tried to make a call using the landline, but the phone just made a “beep” sound.<br/><br/>Without a doubt, there was no signal as well.<br/><br/>Neither mobile phone nor landline could make a call. What on earth was going on?<br/><br/>Zhu Jianshan thought for a moment and said, “I’ll go out for a while.”<br/><br/>Mrs. Zhu said, “Going out so late? Is there something that you need to handle in person at this time? Can’t you just send someone else?”<br/><br/>Zhu Jianshan thought for a moment and said, “No, I have to do it myself!”<br/><br/>Mainly, he wanted to use this opportunity to approach someone and send a subordinate would seem insincere.<br/><br/>Zhu Jianshan went to the garage and drove the car out.<br/><br/>However, halfway through, the car’s tire blew out.<br/><br/>He got out of the car, extremely annoyed, and cursed, “Damn it, I’m really unlucky today!”<br/><br/>His driver quickly replaced it with the spare tire, but it also took some time.<br/><br/>After driving for a while, another tire blew out.<br/><br/>Zhu Jianshan’s face darkened as if a storm was about to hit.<br/><br/>The driver reported, “Boss, there are no more spare tires in the car. We can only call someone to deliver one.”<br/><br/>Zhu Jianshan said gloomily, “Just take a taxi!”<br/><br/>The driver nodded and then stopped a taxi.<br/><br/>However, before they could even get in the taxi, it was rear-ended by someone else.<br/><br/>That meant yet another delay.<br/><br/>The driver saw this scene and thought, “This is really weird.”<br/><br/>Zhu Jianshan, staring at the driver with his sharp eyes, couldn’t help but feel a bit worried.<br/><br/>Yes, something was strange tonight.<br/><br/>Then, he saw the taxi driver making a call, and a flash of light appeared in his eyes. He said to his driver, “You go and borrow the taxi driver’s cellphone!”<br/><br/>Since their own phones couldn’t make calls, maybe it would be different with someone else’s.<br/><br/>As his boss ordered, the driver had to obey.<br/><br/>He borrowed the phone from the taxi driver and directly handed it over to his boss.<br/><br/>However, when Zhu Jianshan picked up the phone to dial, he discovered that the screen had gone black.<br/><br/>Zhu Jianshan,<br/><br/>Driver,<br/><br/>This situation was indeed quite bizarre.<br/><br/>The driver carefully suggested, “Boss, shall I check the phone? Maybe it’s out of power, and I can charge it in the car for a while?”<br/><br/>Zhu Jianshan handed the phone to the driver with a dark expression.<br/><br/>The driver returned the phone to the taxi driver, who laughed and said, “I guess it must be out of power. I’ll charge it for a while.”<br/><br/>Then he took the phone to charge it, and as soon as the phone lit up, Zhu Jianshan and his driver breathed a sigh of relief.<br/><br/>Fortunately, it was just the phone running out of power.<br/><br/>However, the driver was still cautious and asked, “Boss, are we taking a taxi or…” are we making a phone call?<br/><br/>If they took the taxi, they would undoubtedly have to wait for a while.<br/><br/>Zhu Jianshan frowned, wondering if he would be able to get through on the phone.<br/><br/>After all, it would be tough to find Zhu Lao Liu without making contact by phone.<br/><br/>The taxi driver took the money from Zhu Jianshan’s driver, seeing that they still wanted to use his phone, he unplugged it from the charger after charging it for a while, handed it back to the driver, who then handed it to his boss.<br/><br/>As the driver handed it to Zhu Jianshan, he said, “Boss, the phone has power now, and I’ve checked, it also has a signal!”<br/><br/>So there should be no more issues, right?<br/><br/>Zhu Jianshan thought the same.<br/><br/>But as he took the phone to dial, it slipped from his hand and crashed onto the ground.<br/><br/>Zhu Jianshan and the driver,<br/><br/>Accident after accident.<br/><br/>The driver immediately picked up the phone and found that it had gone black again, its screen shattered.<br/><br/>Well then, the phone was broken!<br/><br/>Driver,    This is like seeing a ghost.<br/><br/>He wondered who his boss was trying to call and who he was looking for since this situation was so strange.<br/><br/>The driver cautiously said, “Boss, the phone is broken!”<br/><br/>Zhu Jianshan,<br/><br/>With a dark face and a pair of sharp eyes, he stared intently at his driver. The terrifying expression made the driver even more nervous.<br/><br/>Zhu Jianshan thought for a moment, then said, “You borrow another phone, make the call, and once it connects, I’ll talk!”<br/><br/>He didn’t believe that he couldn’t make any calls tonight.<br/><br/>The driver could only agree, “Alright.”<br/><br/>Then he hailed another taxi, and after a while, the taxi driver gave him another phone.<br/><br/>However, when the driver checked the borrowed phone, everything seemed normal. He then approached Zhu Jianshan and asked, “Boss, what’s the number you want to dial?”<br/><br/>Zhu Jianshan told him a number and the driver dialed it smoothly. Then, a voice came from the other end, “Hello!”<br/><br/>The driver immediately handed the phone to Zhu Jianshan, who picked it up and was just about to speak when he heard a loud “bang” from the other end of the line, followed by the “beep-beep” sound.<br/><br/>“Hello? Hello…?” Zhu Jianshan called a few times, but there was no response from the other side.<br/><br/>Zhu Jianshan handed the phone back to the driver and said, “Dial it again!”<br/><br/>The driver redialed, and a cold, emotionless voice came from the phone, “Sorry, but the number you dialed has been turned off!”<br/><br/>Driver,<br/><br/>Zhu Jianshan,<br/><br/>This was truly bizarre and eerie!<br/><br/>The driver looked at Zhu Jianshan and carefully asked, “Boss?”<br/><br/>Manager Zhu took a deep breath and said, “Let’s just go there directly by car!”<br/><br/>Then, the two of them were about to board another taxi.<br/><br/>But the taxi hadn’t driven ten meters before it rear-ended another car.<br/><br/>Driver and Zhu Jianshan,<br/><br/>The driver didn’t know what business his boss was handling, but tonight was definitely not a good omen with so many mishaps happening one after another.<br/><br/>He wanted to persuade his boss, but seeing his boss’s dark and stern face, he swallowed his words and carefully asked, “Boss, do we still need to go?”<br/><br/>Zhu Jianshan took a deep breath, suppressing his anger, and coldly said, “No need, let’s turn back!”<br/><br/>Since it seemed that fate didn’t want them to proceed, going further might lead to even worse luck.<br/><br/>Then, Zhu Jianshan hurried back to his villa, feeling frustrated, and went to sleep in his room.<br/><br/>However, when he woke up, he received some shocking news.\t\t\t\t\t\t</div>", "images": {}, "success": true}