{"id": 212, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344286.html", "title": "Chapter 212 - Chapter 212: Chapter 212: Xiao Zhi, Working (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 212 - Chapter 212: Chapter 212: Xiao Zhi, Working (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 212: Chapter 212: Xiao Zhi, Working (Second Update)<br/><br/>Translator: 549690339<br/><br/>Licheng overnight, the weather had changed!<br/><br/>Just a moment ago, the sky was filled with twinkling stars, and the moonlight was serene like a painting. But in the next moment, thunder rumbled, and heavy rain seemed about to arrive instantly!<br/><br/>“Trash, trash! You’re all a bunch of trash!”<br/><br/>Inside the Zhu family’s villa, a group of people knelt in the living room. Zhu Lao Liu held a silver whip in his hand and paced back and forth in front of them, with a fierce and gloomy expression on his face.<br/><br/>Then, the whip was lashed on one of the men, and blood instantly seeped from his body. Still, he didn’t dare to make a sound.<br/><br/>“Trash! You can’t even beat a child, and you have the nerve to tell me they got away!” Zhu Lao Liu shouted angrily.<br/><br/>Zhu Lao Liu was furious. With his current status, no one in Licheng would dare disrespect him.<br/><br/>But this Gao Jianjun was not only ungrateful, he went head-to-head against him.<br/><br/>A subordinate next to Zhu Lao Liu cautiously advised, “Boss, just calm down. As long as Gao Jianjun is still in Licheng, even if that woman flies to the ends of the earth, she can be brought back. Now, our priority is to teach Gao Jianjun a lesson and let him know that he can’t afford to offend you.”<br/><br/>After hearing this, Zhu Lao Liu turned around, put the silver whip on the table, sat on the chair, and revealed a vicious glint in his eyes. He sternly said, “Hmph, since Gao Jianjun refuses to back down, don’t blame me for being rude. Second Brother, call the Tax Bureau and the Bureau of Industry and Commerce tomorrow!”<br/><br/>Zhou Lao Er immediately responded, “Yes, Boss!”<br/><br/>Zhu Lao Liu looked at the group of subordinates kneeling in front of him like ghosts, and once again felt agitated. “Get out of my sight, all of you!”<br/><br/>Yellow-haired and the others quickly retreated, feeling as if they had been pardoned.<br/><br/>But before they left, Zhu Lao Liu called out to the yellow-haired one. “Old Three, you stay!”<br/><br/>In fact, among the group, Yellow-haired was the most seriously injured.<br/><br/>When Xiao Jinli made her move, he was the leader, taking the most hits. Then Ji Yuzhu ruthlessly kicked him without any hesitation.<br/><br/>Upon returning, he also received two lashes from Zhu Lao Liu.<br/><br/>It was worth mentioning that Zhu Lao Liu’s silver whip was custom-made and had barbs.<br/><br/>One lash was enough to scrape the flesh off a person’s body, and it was extremely painful.<br/><br/>Usually, Zhu Lao Liu used it to discipline rebellious traitors within the company, but rarely on his own people.<br/><br/>Today, he used it to punish his subordinates simply because he was too furious.<br/><br/>His authority in Licheng for many years was being challenged.<br/><br/>Hmph, how dare Gao Jianjun! Even if that woman followed him in the future, he would never let him off.<br/><br/>Make an example of him!<br/><br/>Has everyone forgotten about Zhu Lao Liu’s methods from the past since he hadn’t used them for so long?<br/><br/>Yellow-haired, covered in bruises and swelling, hobbled toward Zhu Lao Liu with one hand covering his stomach and blood dripping down his back.<br/><br/>Seeing Yellow-haired’s wretched state, Zhu Lao Liu furrowed his brows and asked with concern, “Old Three, are you all right?”<br/><br/>Yellow-haired shook his head. “Boss, I’m fine. These are just superficial wounds.”<br/><br/>Zhu Lao Liu nodded, and then he said, “Tomorrow, you’ll bring some people to Gao’s Group.”<br/><br/>Upon hearing this, Yellow-haired immediately understood and replied, “Understood, Boss.”<br/><br/>They had caused trouble at companies numerous times before.<br/><br/>Zhu Lao Liu took another look at the injuries on Yellow-haired’s body, and frowned while saying, “You should go to the room later and apply some ointment to those wounds.”<br/><br/>Yellow-haired’s eyes lit up with gratitude. “Thank you, Boss!”<br/><br/>After Xiao Jinli escorted her parents safely onto the airplane with her aunt and her family, everyone breathed a sigh of relief.<br/><br/>As long as Xiao Mother was not there, Zhu Lao Liu’s power couldn’t reach the missionaries outside Licheng.<br/><br/>But Gao Jianjun’s mood was extremely heavy.<br/><br/>He knew that starting tomorrow, he would have to face a storm.<br/><br/>Xiao Jinli comforted him, “Uncle, don’t worry. You’ve always been upright and honest. You haven’t evaded taxes or engaged in any illegal activities. No one can do anything to you.”<br/><br/>Upon hearing Xiao Jinli’s consolation, Gao Jianjun smiled and nodded. “Jinli, you’re right!”<br/><br/>Immediately, he looked worried again. “Jinli, it’s really dangerous here now. You’re just a child…”<br/><br/>Xiao Jinli shook her head, “Uncle, I will protect myself. You don’t need to worry!”<br/><br/>Yet Gao Yanxin confidently said, “Dad, I will protect my cousin.”<br/><br/>After hearing his son’s words, Gao Jianjun revealed a bitter smile, nodding. “That’s right. My son Yanxin will protect his cousin.”<br/><br/>However, he still couldn’t help but regret not booking flight tickets for his wife and children as well.<br/><br/>Who knew what methods Zhu Lao Liu would use against him?<br/><br/>Actually, it wasn’t Gao Jianjun’s fault for not booking the flight tickets for his wife and children. He just didn’t expect that Zhu Lao Liu would be so obsessed with Xiao’s mother, even going as far as to intercept her at the door and cause a conflict. This completely offended Zhu Lao Liu.<br/><br/>Now, his wife and children might be implicated.<br/><br/>With this thought, Gao Jianjun took a deep breath and said, “Yanxin, turn the car around, let’s go back to the airport!”<br/><br/>He wanted to send his wife and children away!<br/><br/>Ji Yuzhu immediately understood Gao Jianjun’s plan, and her face changed. She said, “Husband, no, I won’t leave. No matter what difficulties we face, I will always be by your side!”<br/><br/>Yanxin also firmly declared, “Dad, I won’t leave either. I want to stay with you all and protect you!”<br/><br/>Gao Jianjun’s expression was serious. “Do you know how dangerous it is for you to stay?”<br/><br/>“No matter how dangerous it is, I just want our family to be together!” Ji Yuzhu shouted, “I am your wife, and we must stick together through thick and thin!”<br/><br/>Yanxin also said loudly, “I won’t leave either!”<br/><br/>Xiao Jinli,<br/><br/>At that moment, she interjected, “Aunt, Uncle, why don’t we see how things turn out tomorrow? How about that?”<br/><br/>Gao Jianjun looked at Xiao Jinli doubtfully.<br/><br/>He had never treated Xiao Jinli like an ordinary child, and often consulted her like an adult.<br/><br/>However, at this moment, Xiao Jinli seemed too calm.<br/><br/>Xiao Jinli smiled and said, “Aunt, Uncle, and Cousin Yanxin, what you all need to do now is go home and get a good night’s sleep! Maybe when you wake up the next day, it will be a beautiful sunny day.”<br/><br/>Gao Jianjun and his family were silent.<br/><br/>From then on, they all returned home in silence.<br/><br/>Xiao Jinli went back to the room her aunt had prepared for her, closed the door and windows, and her expression changed. “Xiao Zhi, it’s time for us to get to work!”<br/><br/>“Alright!” Xiao Zhi excitedly and eagerly replied.\t\t\t\t\t\t</div>", "images": {}, "success": true}