{"id": 226, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344310.html", "title": "Chapter 226 - Chapter 226: Chapter 226: Giving Away The Seven Color Tea Flower (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 226 - Chapter 226: Chapter 226: Giving Away The Seven Color Tea Flower (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 226: Chapter 226: Giving Away the Seven Color Tea Flower (second update)<br/><br/>Translator: 549690339<br/><br/>Old Chen had so decisively let Xiao Jinli treat him because his illness didn’t involve his brain.<br/><br/>Old Yuan’s disease was in the brain, which is far more severe than other parts.<br/><br/>Of course, the primary reason was that Xiao Jinli had diagnosed a brain tumor just from taking his pulse, but they still needed further medical tests to confirm it.<br/><br/>However, before Old Yuan returned to the Capital City<br/><br/>“Grandpa Yuan, I would like to give you my Seven Color Tea Flower.” Xiao Jinli said seriously, “Keep the flower in your room which will assist your sleep. Moreover, you can make tea with its flowers. One flower a day, this tea can regulate your body balance and contribute to your health.”<br/><br/>Everyone was astonished when Xiao Jinli directly offered the tea flowers to Old Yuan.<br/><br/>The estimated minimum value of that flower is two million yuan.<br/><br/>Now it was discovered that the flower had medicinal value, its worth could be even higher than two million yuan.<br/><br/>Old Yuan asked in surprise, “Do you know what you’re saying, child? That is a flower worth over two million. Are you simply giving it to me?”<br/><br/>Xiao Jinli laughed and said, “Certainly, the thing has value when it’s useful. However, the truly valuable things should be given to those who need them the most, that is their real value! And now it’s the time when you need it the most!”<br/><br/>Old Chen and Old Li looked at each other, then Old Chen laughed, saying “Old Yuan, the child makes sense. The flowers help sleep and also benefit your health, you definitely need them more than us. So, Old Li and I, and I think Old Jiang as well, won’t argue with you on this. The kids here have the right intentions, accept them!”<br/><br/>Their diseases are all old and not a big deal.<br/><br/>But Old Yuan’s illness was potentially like a bomb.<br/><br/>After some rumination, Old Yuan nodded his agreement, “In that case, I will accept the tea. Kid, now I owe you a favor. If you need anything in the future, do not hesitate to ask. As long as it is within my power, Grandpa Yuan will help you.”<br/><br/>Xiao Zhang, standing behind him, turned pale but couldn’t stop Old Yuan’s promise.<br/><br/>The promises from these old national treasures weighed more than Mount Tai.<br/><br/>This is simply not comparable to a tea flower valued at just two million.<br/><br/>If someone with ulterior motives used his relationship to do something wrong, it would be disgraceful.<br/><br/>Xiao Jinli smiled and said, “All right, Grandpa Yuan. However, the most important thing for you now is to have a medical check and start taking care of your body. When necessary, you can contact me via phone call, whether you come to find me, or I come to the Capital City, both are feasible.”<br/><br/>At this point, she paused, her eyes flicked, and then she continued, “My hometown is a beautiful mountain village, with clear mountains and water, beautiful landscapes, and honest people. If you live there, it would be even better for your health.”<br/><br/>Gao Jianjun’s face changed slightly, he said quietly, “Jinli!”<br/><br/>How could one casually invite a high-profile figure to Xiao Family Village?<br/><br/>Yet Old Yuan did not feel out of place at all. He exclaimed, “That sounds great. If I have the chance, I will go there. I want to see what kind of Feng Shui treasure land has nurtured such intelligent and clear-minded person.”<br/><br/>Old Chen laughed and said, “When I get the chance, I will join as well!”<br/><br/>Old Li laughed and said, “We initially came for the seven-color tea flower. Meanwhile, the master of the tea flowers has brought us such a pleasant surprise.”<br/><br/>The bullet in Old Jiang can be removed, and Old Yuan was found to have brain cancer, fortunately, it is in the early stage, but if it’s in the later stage, then<br/><br/>Old Chen, Old Li, and Old Yuan asked for Xiao Jinli’s contact information.<br/><br/>They planned to accompany Old Yuan on his return journey and await the results.<br/><br/>If the real diagnosis of brain cancer is confirmed, having their fellow old friends around can be comforting.<br/><br/>Only after the four elderly gentlemen had left, did Gao Jianjun and Zhou Jianhua simultaneously wipe the cold sweat off their foreheads.<br/><br/>These elders, although much milder, still intimidated them with their aura.<br/><br/>Zhou Jianhua turned to look at Xiao Jinli, who was calm by his side, and said to Gao Jianjun, “President Gao, your niece is truly remarkable. When we face these elders, we are a bit nervous, but she is calm and composed. Truly, youth knows no fear.”<br/><br/>Gao Jianjun said, “This child has been brave and intelligent since she was little.”<br/><br/>Saying this, he laughed bitterly, “I had not expected that she could be this brave.”<br/><br/>Zhou Jianhua said, “A young girl who knows traditional Chinese medicine, is already remarkable. But to also perform a brilliant operation and bravely take the pulse readings of four old gentlemen, I have to admire this young girl.”<br/><br/>Gao Jianjun,    He was also surprised.<br/><br/>Zhou Jianhua wished to establish a good relationship with Gao Jianjun. The two exchanged business cards and discussed a potential partnership.<br/><br/>Zhou’s Group, owned by Zhou Jianhua, is one of the top companies in Licheng, much larger than Gao’s company.<br/><br/>Of course, Gao Jianjun wouldn’t refuse to collaborate with Zhou’s Group.<br/><br/>On the way home, everyone in Gao Jianjun’s group was excited and thrilled.<br/><br/>“Cousin, you are too awesome.” Gao Yanxin, who had been holding his breath, was finally able to loudly praise his cousin, “You know traditional Chinese medicine and your medical skills are so good. Right now, I really want to see what kind of brain you have. How come you’re so intelligent and versatile! It’s so enviable. No wonder, in front of my father, I am always criticized as a dummy. With you as an example, anyone would become a dummy!”<br/><br/>Ji Yuzhu also felt proud. She said excitedly, “Those prominent people that often appear in the news, I never thought that I would have the chance to meet them, all thanks to Jinli. How exciting. ”<br/><br/>“Jinli, you’re incredible!” Ji Yuzhu praised, “You not only know traditional Chinese medicine, but your skills are so advanced. If it weren’t for your display today, we wouldn’t know that you are a doctor?”<br/><br/>At this point, she looked like she thought of something and seemed a bit skeptical. She asked, “Jinli, do your parents know about your medical knowledge?”<br/><br/>Xiao Jinli shook her head, “No, they don’t.”<br/><br/>“Ah, even my sister and brother-in-law don’t know you’re a doctor.” Ji Yuzhu was amazed, “You’ve done a great job keeping it a secret. Wait a minute, you said that you started learning medicine at the age of two, does that mean you started going to the mountain by yourself at that age?”<br/><br/>She knew that Jinli likes to go to the mountains for peace and quiet, but she never thought that Jinli would start going into the mountains at the age of two!<br/><br/>How dangerous!<br/><br/>Xiao Jinli thought of her first time going to the mountain, she smiled and said, “Yes, I went into the mountains by myself when I was just over two years old. Then I met an old traditional Chinese doctor who was gathering herbs. He noticed my potential and started teaching me medicine. This was a secret between me and my master.”<br/><br/>The first time she went to the top of Red Peak Mountain when she was just over two years old, because she overslept there, she didn’t return home on time. This caused the whole village to miss lunch and go looking for her.<br/><br/>Since then, she would notify her parents whenever she went anywhere.\t\t\t\t\t\t</div>", "images": {}, "success": true}