{"id": 222, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344303.html", "title": "Chapter 222 - Chapter 222: Chapter 222: Taking Pulse For The Grumpy Old Men (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 222 - Chapter 222: Chapter 222: Taking Pulse For The Grumpy Old Men (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 222: Chapter 222: Taking Pulse for the Grumpy Old Men (Second Update)<br/><br/>Translator: 549690339<br/><br/>“Gentlemen, how about I take your pulse for you?” Xiao Jinli said with a smile, “See if what I say is consistent with what your main doctors say, how about that?”<br/><br/>She wanted to prove to them that she wasn’t lying.<br/><br/>The people present were full of doubt.<br/><br/>Usually, if a teenager said they wanted to take their pulse, they would just laugh it away.<br/><br/>But today, this so-called nutrient package was too astonishing that they found it hard to doubt.<br/><br/>“Jinli!” Ji Yuzhu exclaimed as she looked at Xiao Jinli, she pulled her aside and whispered, “Do you really know medical skills? Why haven’t you ever told me?”<br/><br/>Although Ji Yuzhu asked in a low voice, everyone could hear her in the quietness.<br/><br/>Gao Jianjun and his son looked at her with suspicion.<br/><br/>They had known Xiao Jinli not for one or two days, but since she was born.<br/><br/>Who could have thought that the child they had been pampering would have medical skills without them knowing?<br/><br/>Xiao Jinli pretended to whisper back, “Auntie, don’t I usually go to the deep mountain? There, I saved an old traditional Chinese doctor. The old doctor saw that I had talent and taught me medical skills. Now I have already graduated!”<br/><br/>“Ha, is that so?” Ji Yuzhu was still a little skeptical.<br/><br/>“Yes, that’s the case.” Xiao Jinli nodded.<br/><br/>Everyone,<br/><br/>“Ha ha  ” Old Chen looked at Xiao Jinli’s face and said happily, “Alright, child, let this old fellow take your pulse.”<br/><br/>It was just taking the pulse, there was nothing to lose.<br/><br/>Xiao Jinli went over and started to take Old Chen’s pulse.<br/><br/>There was an old saying, “not afraid of doctors laughing, but afraid of doctors looking serious.” Everyone stared at Xiao Jinli’s face, trying to see something from her expression.<br/><br/>But Xiao Jinli, from taking the pulse to the end, was serious and solemn; no one could read anything from her face.<br/><br/>Xiao Jinli said solemnly, “Old master, you have been to the battlefield in your early years, and you have many chronic diseases from old injuries, such as rheumatism, high blood pressure, and other geriatric diseases. However, these geriatric diseases can be controlled. The real difficulty lies in dealing with those old injuries. Many times at night, the pain is unbearable, and you can’t sleep well, right?”<br/><br/>Old Chen smiled and said, “You’re right, it seems that you really do have some skills, child. Not bad, not bad! Who is your master? He has such a good disciple.”<br/><br/>Xiao Jinli smiled and said, “It should be said that I have such a good teacher that I can be such a good disciple.”<br/><br/>“Haha, not bad, not bad, you are a grateful child!” Old Chen was really happy today, not only because his body was better and he had slept well, but also because he met such an interesting child.<br/><br/>Xiao Jinli put down her hand and said, “Old master, if you trust me, I can treat your old injuries!”<br/><br/>“What?” Old Chen’s expression changed, “Child, you said my old injuries can be treated?”<br/><br/>“Yes, if treated, you can live a healthy life for a hundred years.” Xiao Jinli nodded.<br/><br/>The young man behind Old Chen frowned and scolded, “Presumptuous! Old Chen’s body has always been taken care of by the best exclusive doctors. Considering your young age, how dare you to say that you can treat him? Do you think you are playing house with other children?”<br/><br/>Then he turned his head to Old Chen and said, “Old Chen, you can let her take your pulse, but you can’t let her treat you. She is just a child. Even if she has some medical skills, can she be as adept as the medical giants?”<br/><br/>Xiao Jinli shrugged and said seriously, “Medical skills are not about age, but ability and competence. And, my age is not a reason for you to scold me. I said I could treat Old Chen’s illness, but whether I want to treat it or not depends on you!”<br/><br/>She had been here for eleven years and had hardly ever shown her hand.<br/><br/>If it weren’t for the fact that these old gentlemen had made huge contributions to the country, and she didn’t want them to suffer so much pain and torture in their twilight years, she would have ignored them altogether.<br/><br/>Old Chen said with a stern face, “Xiao Liu, you have overstepped!”<br/><br/>Immediately, he smiled and said to Xiao Jinli, “Child, don’t take Xiao Liu’s words to heart, I will teach him a lesson later.”<br/><br/>Xiao Jinli shook her head and said, “Old Chen, this comrade is just worried about you, there is no impropriety!”<br/><br/>“Haha, you are a child with such a broad mind at such a young age, you are bound to be a great achiever in the future.” Old Chen praised.<br/><br/>Afterward, he asked, “You said my illness can be treated, do I need surgery?” He was old and didn’t want to lie on an operating table.<br/><br/>Xiao Jinli shook her head and said, “You don’t need surgery for these diseases, you just need to take some medication.”<br/><br/>“Then that’s good, I’ll have you prescribe some medicine for me later.” Old Chen didn’t want to refuse the child’s kindness.<br/><br/>“Alright!” Xiao Jinli replied and then looked at Grandpa Jiang, asking, “Grandpa, may I take your pulse?”<br/><br/>Grandpa Jiang’s usually serious face showed a kind and friendly expression when he looked at Xiao Jinli, and he smiled, “Yes, child, and my name is Jiang, call me Grandpa Jiang!”<br/><br/>“Alright, Grandpa Jiang!” Xiao Jinli stepped forward and took Elder Zeng’s pulse.<br/><br/>While taking Grandpa Jiang’s pulse, everyone could clearly see Xiao Jinli’s expression change, her small eyebrows frowning deeper and deeper.<br/><br/>Seeing this situation, those who didn’t know what was going on were worried.<br/><br/>After a while, Xiao Jinli let go of her hand.<br/><br/>Grandpa Jiang asked curiously, “Child, what did you find?”<br/><br/>Xiao Jinli shook her head, only to hear the young man behind Grandpa Jiang sneer, obviously mocking.<br/><br/>Xiao Jinli ignored him and said seriously, “Grandpa Jiang, you don’t have many geriatric diseases, just slightly high blood pressure. That can be managed with medication and controlling your diet. You also have many old injuries on your body, but  ”<br/><br/>She said solemnly, “The most serious thing is the object left near your heart!”<br/><br/>As soon as she finished speaking, the young man behind Grandpa Jiang jumped up and asked, “How do you know?”<br/><br/>“Of course, I found it through taking your pulse.” Xiao Jinli continued, “This object, according to Western medicine, can be removed through surgery. But due to the location of the object, which is just one or two millimeters away from the heart, the difficulty of removing it during surgery is extremely high. If there is a slight mishap during the surgery, there may be a huge accident, even never leaving the operating table. So Grandpa Jiang, you usually have conservative treatment, right?”<br/><br/>Xiao Jinli’s words deeply shocked the old gentlemen.<br/><br/>What shocked them was not the bullet left inside Grandpa Jiang’s body, but the fact that a child had discovered the bullet inside his body, even pinpointing the exact location, merely by taking his pulse.<br/><br/>Even the most prestigious and best old doctor in the country did not have such medical skills.\t\t\t\t\t\t</div>", "images": {}, "success": true}