{"id": 229, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344316.html", "title": "Chapter 229 - Chapter 229: Chapter 229: (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 229 - Chapter 229: Chapter 229: (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 229: Chapter 229: (First Update)<br/><br/>Translator: 549690339<br/><br/>Since Old Master Yuan was unwilling to go to the hospital and resistant to Western medical treatment, he returned to the Retirement Home for Cadres in Licheng after the trip. Doctor Jin usually treated him to manage his condition.<br/><br/>However, Yuan’s family worried about his health.<br/><br/>Controlling the disease wasn’t enough.<br/><br/>The main reason was that Doctor Jin was too old. If one day he leaves this world, who would manage Old Master Yuan’s condition?<br/><br/>But ordinary traditional Chinese doctors weren’t as skilled as Doctor Jin.<br/><br/>Western medical treatment, including surgery, aims to remove the physical cause of the disease.<br/><br/>However, Old Master Yuan was very resistant to surgery, especially when it involved cutting into his head.<br/><br/>Although the success rate was high, there was still a chance he might not survive the cold operating table.<br/><br/>Therefore, no matter who tried to persuade him, he firmly refused Western medical treatment.<br/><br/>After Xiao Jinli’s diagnosis and treatment, the health of Old Chen and the others improved, something Doctor Jin couldn’t achieve before.<br/><br/>Doctor Jin, the National Doctor, was renowned for his medical skills. He was even hailed as a Divine Doctor.<br/><br/>Despite this, Doctor Jin could only manage the health of the four of them but couldn’t cure them.<br/><br/>However, with Xiao Jinli’s intervention, their bodies gradually moved towards recovery.<br/><br/>Therefore, they privately believed that Xiao Jinli’s medical skills were superior to Doctor Jin’s.<br/><br/>However, because they had a good relationship with Doctor Jin, and he managed their health, they couldn’t just cross the river and demolish the bridge by directly inviting Xiao Jinli to come over. Instead, they talked to Doctor Jin in private.<br/><br/>Fortunately, Doctor Jin was an open-minded person.<br/><br/>After hearing their suggestions, he agreed without hesitation, even saying that if Xiao Jinli could indeed treat Old Master Yuan, he wanted to learn from her.<br/><br/>Doctor Jin laughed and said, “Don’t think of me as a petty person. As a doctor, I know that learning is endless and there are always people better than oneself. Some things are gained by talent, combined with effort, which may allow one to achieve an enviable level. One cannot rely on age to assess their ability. The child you’re talking about must be very talented, intelligent, and hard-working. She might be young, but with eight years of medical experience, she can be considered an old traditional Chinese doctor.”<br/><br/>After listening, Old Chen laughed and said, “Old Jin, she is a good child, and you will like her when you meet her.”<br/><br/>Later on, Old Chen called Xiao Jinli, who immediately came to the Retirement Home for Cadres.<br/><br/>Grandpa Jiang called Doctor Jin, and soon he arrived with a medicine box.<br/><br/>As soon as he entered, he hurriedly asked, “Grandpa Jiang, where is the child?”<br/><br/>While speaking, he glanced at everyone present, then his gaze quickly focused on Xiao Jinli.<br/><br/>“It’s you, isn’t it, child?” Doctor Jin kindly asked, “You’re the one treating these old gentlemen, right?”<br/><br/>Xiao Jinli was a little confused, this Doctor Jin was very direct.<br/><br/>She smiled and said, “It’s me, Doctor Jin! Divine Doctor Jin, I’ve long admired your reputation!”<br/><br/>Doctor Jin laughed and said, “Haha, I’m just overrated. Judging by your diagnosis and treatment of these old men, you’re the real Divine Doctor. I’m happy to admit my inferiority!”<br/><br/>The young man who followed Doctor Jin disapproved, looking at Xiao Jinli’s age. He said, “Grandpa, why do you undermine yourself? Your medical skills are well-known in the national medical field. This child  ”<br/><br/>He looked at Xiao Jinli with disbelief and continued, “Maybe it’s just a lucky break – blind luck. How can someone her age compare to your decades of experience in medical practice!”<br/><br/>He was Jin Xiangxue, the third grandson of Jin Shanlin. Due to his talent, he studied traditional Chinese medicine under his grandfather since childhood. He was somewhat arrogant due to his reputation in the medicine field.<br/><br/>“Silence!” Jin Shanlin scolded coldly, “Age does not determine one’s medical abilities. So what if she’s a child? Who stipulated that her medical skills couldn’t surpass mine? Should we rely on age to deny a child’s ability? Jin Xiangxue, when did I teach you to be complacent?”<br/><br/>Jin Xiangxue was unconvinced and argued, “But Grandpa, even if someone is really talented, time still limits their growth. If she were an adult with two or three decades of medical experience, I would believe it. But look at her, is she even fifteen years old?”<br/><br/>Xiao Jinli grinned and said, “I’m sorry, I’m not even fifteen, I’m only eleven years old.”<br/><br/>Jin Xiangxue’s eyes widened in disbelief, and he stammered, “E  eleven years old?”<br/><br/>Xiao Jinli laughed and said, “I’ve always grown up faster than others.”<br/><br/>Jin Xiangxue,  Was that what he meant?<br/><br/>Ignoring his silly grandson, Doctor Jin sincerely apologized to Xiao Jinli, “Child, I’m sorry. My grandson is spoiled and speaks bluntly. I apologize to you for his rudeness.”<br/><br/>Xiao Jinli grinned and replied, “Doctor Jin, you’re too kind. My age is indeed deceiving, so it’s not surprising that your grandson has prejudices against me. However, actions speak louder than words. Seeing is believing.”<br/><br/>“Haha, you’re right!” Doctor Jin suddenly exclaimed happily.<br/><br/>Xiao Jinli said, “Doctor Jin, I’m going to perform the first acupuncture on Grandpa Yuan now.”<br/><br/>“Acupuncture?” Jin Xiangxue was skeptical, “Do you even know how to perform acupuncture?”<br/><br/>Xiao Jinli raised her eyebrows and asked, “Is it difficult to perform acupuncture?”<br/><br/>Jin Xiangxue,  Isn’t it?<br/><br/>Acupuncture may not be difficult to learn, but performing it quickly, accurately, and ruthlessly elevates the difficulty level.<br/><br/>At this time, Grandpa Jiang stepped forward on behalf of the other elders.<br/><br/>“Speaking of acupuncture, I believe I’m the most qualified to talk about it,” Grandpa Jiang said, “Because the bullet near my heart was removed by Xiao Jinli’s acupuncture.”<br/><br/>“That’s right, we were all there,” Old Chen added, “At that time, her acupuncture was incredibly fast, accurate, and ruthless.”<br/><br/>“Do you know how fast she was?” Elder Li excitedly recalled, “At that time, she held four silver needles in her hand. With a flick of her wrist, all four needles were sent flying. Grandpa Jiang, did you feel any pain?”<br/><br/>“No, not at all.” Grandpa Jiang shook his head, “I only felt a slight pain when she pressed her finger on my stomach, but it quickly disappeared, and then I heard her say that it moved.”<br/><br/>Old Chen seriously advised, “Little Jin, you can’t judge people by their age. Never underestimate a child’s medical skills.”<br/><br/>Although they all doubted her at the time, the fact proved her superb medical skills.<br/><br/>Jin Xiangxue,\t\t\t\t\t\t</div>", "images": {}, "success": true}