{"id": 220, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344300.html", "title": "Chapter 220 - Chapter 220: Chapter 220: Sky-High Priced Tea Flower", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 220 - Chapter 220: Chapter 220: Sky-High Priced Tea Flower</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 220: Chapter 220: Sky-high Priced Tea Flower<br/><br/>Translator: 549690339<br/><br/>Gao Jianjun brought Xiao Jinli to the chairman’s office of the organizing committee.<br/><br/>In the chairman’s office, four elderly men sat with an imposing aura. Their faces looked old and experienced, but their spirits were lively. Standing by their side were several young people who didn’t seem like bodyguards but rather like caregivers.<br/><br/>Upon seeing Gao Jianjun, Chairman Zhou immediately greeted him warmly, “President Gao, hello there! I’ve long heard of your great reputation! I am Zhou Jianhua!”<br/><br/>Gao Jianjun extended his hand and laughed, “Hello, Chairman Zhou!”<br/><br/>Zhou Jianhua quickly got to the point, “President Gao, I won’t waste your time. Many people are interested in your tea flower. They say that when they get close to it and smell its scent, they feel incredibly relaxed. Is this true?”<br/><br/>As the chairman of the exhibition, he had to figure out the reason so many people were attracted to that flower. He couldn’t let people smell the flower and then develop side effects later.<br/><br/>“Cough, cough” Gao Jianjun laughed and said, “Chairman Zhou, the flower is not mine but belongs to my niece. This is her.”<br/><br/>“Ha”<br/><br/>Zhou Jianhua and everyone present were taken aback by this revelation.<br/><br/>Zhou Jianhua asked in surprise, “President Gao, you mean to say your niece cultivated that tea flower herself?”<br/><br/>“Yes!” President Gao proudly introduced, “My niece has been bright since she was little and has had her share of unique experiences. She can do things that others can’t. She bought the seeds for the Seven Color Tea Flower herself and nurtured it with her talents, resulting in its present dazzling appearance. So, if there’s anything unusual about this flower, my niece would know best!”<br/><br/>At this time, the oldest person in the room waved at Xiao Jinli and said, “Kid, you come here.”<br/><br/>Zhou Jianhua immediately introduced him, “This is Old Chen!”<br/><br/>Xiao Jinli walked up to Old Chen with proper etiquette and greeted him, “Old Chen, hello!”<br/><br/>Old Chen had an imposing aura that usually intimidated people, but this child was calm and collected—a brave child indeed.<br/><br/>Old Chen smiled and said, “Child, don’t be afraid. You’ve done a great job cultivating that flower; it’s beautiful and has a rich and pleasant fragrance. It seems you have a natural talent for nurturing flowers.”<br/><br/>Xiao Jinli laughed and thanked him, “Thank you, Old Chen, for your praise!”<br/><br/>Old Chen then asked, “I’ve gone to admire your tea flower several times, and its scent makes me feel very comfortable—as if I’m transported back to my youth. Child, I’d like to ask you, what’s the secret behind the fragrance of this flower?”<br/><br/>For a person whose one foot is practically in the grave, their health is their top priority.<br/><br/>High-end health supplements have been consumed in large quantities, but their effects were minimal, and various chronic illnesses still plagued them. They felt as though they were burdened with heavy weights, unable to sleep well at night.<br/><br/>But strangely, ever since they smelled the Seven Color Tea Flower, not only did they feel more relaxed, but they also had the best sleep they’d had in over a decade!<br/><br/>At first, Old Chen didn’t think much of it and attributed it to coincidence.<br/><br/>But he loved the scent of the Seven Color Tea Flower, so the second day he went back there.<br/><br/>This time, when he smelled the scent, he felt even more comfortable.<br/><br/>That night, he slept wonderfully again.<br/><br/>This time, he no longer thought it was a coincidence.<br/><br/>He vaguely believed that it was the tea flower’s doing.<br/><br/>To confirm his thoughts, he went to admire the flower again!<br/><br/>On the third night, his sleep continued to improve!<br/><br/>As a result, he became determined to buy that tea flower!<br/><br/>His original goal was to acquire the Handsome Banner flower.<br/><br/>He loved flowers, but he especially loved chrysanthemums!<br/><br/>Handsome Banner is the king of chrysanthemums!<br/><br/>Upon hearing Old Chen’s question, everyone, including the remaining three elderly people, stared at Xiao Jinli with curiosity in their eyes!<br/><br/>Xiao Jinli said, “Old Chen, when I bought the seeds, people at the Seed Station told me that this was a new variety researched by the Agricultural Research Institute. Whether it would survive or not was uncertain! I was curious about these seeds, so I bought them! By accident, one of the seeds fell on a cliff, and later it took root and grew into a sapling. When it started to form flower buds, I found it and brought it home.”<br/><br/>After a brief pause, she continued, “There’s a saying that home flowers don’t smell as sweet as wild flowers. Maybe it’s because the tea flower grew on a cliff, drank dewwater, and breathed fresh air, making its fragrance all the more potent. As for any special effects of its aroma, I’m not entirely sure. When I brought it here, it was tightly closed with flower buds and had not bloomed. The flower only opened two days before the exhibition.”<br/><br/>Upon hearing Xiao Jinli’s answer, especially the part about “home flowers don’t smell as sweet as wild flowers,” several young people couldn’t help but chuckle softly.<br/><br/>“This child is really adorable,” Old Yuan laughed.<br/><br/>“Home flowers don’t smell as sweet as wild flowers!” Old Li also laughed, “This seems to be true! Of all the flowers at the exhibition today, including those prestigious ones that we bought before, all were artificially cultivated. In contrast, this child’s Seven Color Tea Flower was accidentally planted on a cliff in the mountains and grew wildly. It’s bound to be different from home flowers.”<br/><br/>Old Chen then asked, “Child, did you know that the fragrance of this flower smells good, makes people comfortable, and can even aid sleep?”<br/><br/>“I know!” Surprisingly, Xiao Jinli answered seriously.<br/><br/>Everyone expected her to say she didn’t know.<br/><br/>“You actually know about this?” Old Chen asked curiously. “Didn’t you say that the flower grew in the mountains, and you only picked it after it had grown flower buds? It has only been blooming for two days, how could you know?”<br/><br/>Xiao Jinli said solemnly, “After I brought the tea flower home, I prepared a nutrient package for it. Not only does it make the flower more enchanting and fragrant, but it also makes the scent rejuvenate and help people sleep.”<br/><br/>“So, you created this nutrient package that has such effects?” The elderly people were astonished.<br/><br/>“Yes,” Xiao Jinli said.<br/><br/>Old Yuan asked, “Child, can you show me the nutrient package you prepared?”<br/><br/>Xiao Jinli shook her head first, “The ingredients of this nutrient package are difficult to find, and I found them in the mountains. I gave some to the exhibition staff, so if you need it, you can ask them for it!”<br/><br/>Upon hearing this, Zhou Jianhua quickly called a subordinate on the phone, “Who’s in charge of booth number nine? Alright, make a call for them to come to the chairman’s office immediately and bring along booth nine’s nutrient package.”<br/><br/>While waiting, Old Li amiably asked, “Child, how old are you this year?”<br/><br/>“I’m eleven!” Xiao Jinli replied!<br/><br/>“Eleven years old, so you’re still in elementary school! Wait, school isn’t on holiday yet. Did you take time off?”<br/><br/>Gao Jianjun,\t\t\t\t\t\t</div>", "images": {}, "success": true}