{"id": 221, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344301.html", "title": "Chapter 221 - Chapter 221: Chapter 221: Brewing Tea With Seven Color Tea Flower (Part 1)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 221 - Chapter 221: Chapter 221: Brewing Tea With Seven Color Tea Flower (Part 1)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 221: Chapter 221: Brewing Tea with Seven Color Tea Flower (Part 1)<br/><br/>Translator: 549690339<br/><br/>Soon the person in charge of the nine Seven Color Tea Flowers arrived with nutrient packages.<br/><br/>Old Chen immediately had them sent for testing.<br/><br/>They wanted to ensure that these nutrient packages did not contain anything they shouldn’t and that the value of the flowers was worth their investment.<br/><br/>As Old Chen held an important position, the things he had sent for testing would surely be prioritized by the testing agency.<br/><br/>About an hour later, someone brought the test report.<br/><br/>Accompanying it was the director of the testing institute.<br/><br/>“Old Chen, look!” Director Zhu of the Testing Institute respectfully said, “The test shows that an active molecule has been detected in the nutrient package. This molecule is beneficial to the body.”<br/><br/>Upon hearing this, Old Chen’s eyes lit up. He asked, “What is this active molecule, do you know?”<br/><br/>Director Zhu said, “This active molecule is a new type of substance. However, the staff said that the structure of this molecule is beneficial to humans, animals, and plants.”<br/><br/>Old Chen looked at Xiao Jinli with some doubts, “Child, have you discovered a new species?”<br/><br/>Xiao Jinli shook her head, “I was raised in the mountains, and I collected these things in the mountains. I don’t know about any new species.”<br/><br/>Everyone,<br/><br/>Not to mention children, even adults cannot recognize everything they encounter.<br/><br/>There are all kinds of things in the world, and there may even be species that humans have not discovered yet.<br/><br/>After hearing Xiao Jinli’s words, Old Chen was somewhat disappointed.<br/><br/>Xiao Jinli’s eyes turned, and she said, “My pot of Seven Color Tea Flowers has a fragrance that helps with sleep. The flowers used to make tea are also beneficial to health.”<br/><br/>“Child, how do you know that using it as tea is more beneficial to health?” Old Li asked curiously.<br/><br/>Xiao Jinli laughed confidently, “Because I just know. If you don’t believe me, you can cut a flower now and make tea.”<br/><br/>Drinking the tea is equivalent to drinking Lingquan water directly, which is definitely more effective than the fragrance alone.<br/><br/>“Ha, cut one now to make tea?” Old Yuan asked with slight surprise, “Child, if you cut one now, the ornamental value of your pot of flowers will be greatly reduced. Are you sure you want to do this?”<br/><br/>“No, Grandpa, you’re wrong.” Xiao Jinli shook her head, “On the contrary, if a cut flower is used to prove its value, it will become more valuable, right?”<br/><br/>Upon hearing Xiao Jinli’s words, everyone reacted.<br/><br/>“Ha ha   How can you be so clever and quick-witted, you little ghost?” Old Yuan laughed, “You’re right, if a flower is used to prove its value, it becomes even more valuable.”<br/><br/>Especially for these elderly people, the value is even greater.<br/><br/>Old Chen nodded and then ordered his subordinates, “Go, cut one and bring it.”<br/><br/>Although they were somewhat reluctant to part with the flower, if its medicinal value was higher than its ornamental value, they would surely choose the medicinal value.<br/><br/>Not long after, a freshly cut Seven Color Tea Flower was brought over.<br/><br/>“How to brew it?”<br/><br/>The old masters used to brew flower tea with certain techniques.<br/><br/>They have brewed tea flowers for the old masters before, but they used dried tea flowers.<br/><br/>Xiao Jinli said, “Give it to me.”<br/><br/>Having said that, she took the flower, washed it thoroughly, and threw the whole flower directly into the teacup. Then, she poured hot water at 80 degrees Celsius over it.<br/><br/>Instantly, a strong fragrance of tea flowers filled the room, refreshing everyone’s senses.<br/><br/>“It smells so nice!”<br/><br/>“Yes, it’s so fragrant. Inhaling this aroma, I feel instantly awake and refreshed, very comfortable!”<br/><br/>“Yeah, me too.”<br/><br/>“It smells so good, just don’t know what it tastes like when we drink it.”<br/><br/>After about five minutes, Xiao Jinli poured everyone a cup of tea.<br/><br/>When she poured it out, the tea was clear, and if it weren’t for the fragrance coming from the cup, one would have thought it was pure water.<br/><br/>“Child, do we not need to add rock candy?”<br/><br/>Usually, when brewing other flower teas, they would add some rock candy to mask the bitterness and astringency of the tea.<br/><br/>Xiao Jinli hadn’t answered yet.<br/><br/>Grandpa Jiang, who had been silent, suddenly picked up his teacup and took a sip, exclaiming, “What a fragrant tea! The aroma is rich but not greasy, refreshing to the heart and soul. The taste is warm and smooth, moistening the heart!”<br/><br/>After that, he took another sip.<br/><br/>His expression showed great enjoyment!<br/><br/>Everyone,<br/><br/>Grandpa Jiang realized everyone was staring at him and said, “What are you three old guys staring at me for? Don’t you have a cup in your hands? Taste it yourselves and you’ll know.”<br/><br/>As soon as Grandpa Jiang’s words fell, Old Chen, Old Li, and Old Yuan drank it quickly as well.<br/><br/>“What a fragrant tea!”<br/><br/>“After drinking it, I really feel incredibly relaxed, very comfortable!”<br/><br/>“This tea doesn’t have any rock candy, but you can taste a faint sweetness.”<br/><br/>The four old masters drank their tea without much regard for manners, finishing their cups in one gulp.<br/><br/>After finishing the first cup, they handed their empty cups to Xiao Jinli and directly requested, “Child, pour me another cup!”<br/><br/>Xiao Jinli shook her head and said, “Grandfather Li, you can only drink one cup for the first time, don’t overdo it.”<br/><br/>Old Li asked doubtfully, “Why?”<br/><br/>Xiao Jinli smiled and replied, “Because this Camellia Tea is a weight-loss tea for the first-time drinkers. Soon after drinking it, well, you’ll have to go to the toilet. Don’t worry, this weight-loss tea just removes some impurities in your body. After that, your physical fitness will get better and better.”<br/><br/>Old Chen asked more curiously and skeptically, “Child, how do you know?”<br/><br/>Xiao Jinli blinked her eyes and said, “Because the nutrient package I made has this characteristic.”<br/><br/>Everyone,<br/><br/>So, what exactly is your nutrient package made of?<br/><br/>With such a significant effect, it not only makes flowers grow well, aids in sleep but also helps with weight loss.<br/><br/>Seeing the puzzled looks on everyone’s faces, Xiao Jinli suddenly slapped her forehead as if she had just realized something, “Oh, I forgot to tell you, I learned Traditional Chinese Medicine from an old traditional Chinese doctor. The nutrient package is made according to a prescription for improving physical fitness.”<br/><br/>Everyone,<br/><br/>Old Chen reacted and said, “So, you’ve been irrigating this flower with a nutrient package made according to a human prescription, and then the effect is reflected on this Camellia flower, right?”<br/><br/>“Yes!” Xiao Jinli nodded.<br/><br/>After Xiao Jinli finished speaking, the four old masters fell into deep thought.<br/><br/>Xiao Jinli’s eyes flashed, “In fact, my nutrient package is not only used for irrigating tea flowers but also for growing vegetables. In our village, the entire village uses this nutrient package for farming.”<br/><br/>Upon hearing that, Gao Jianjun’s eyelids jumped.<br/><br/>He clearly remembered that the vegetable planting in Xiao Family Village depended entirely on earthworm breeding. How come there’s a nutrient package now?<br/><br/>The four old masters held powerful positions and were not to be deceived by lies.\t\t\t\t\t\t</div>", "images": {}, "success": true}