{"id": 223, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344305.html", "title": "Chapter 223 - Chapter 223: Chapter 223: Acupuncture For Grandpa Jiang (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 223 - Chapter 223: Chapter 223: Acupuncture For Grandpa Jiang (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 223: Chapter 223: Acupuncture for Grandpa Jiang (First Update)<br/><br/>Translator: 549690339<br/><br/>“How   how did you know?” Xiao Li, who was following behind Elder Jiang, looked unbelievably at Xiao Jinli. “Did you investigate in advance?”<br/><br/>Hearing his question, Xiao Jinli almost rolled her eyes, responding coldly, “Investigation? If anyone could probe into Grandpa Jiang’s health condition, it only shows the incompetence of you, the so-called ‘protectors’.”<br/><br/>Old Jiang nodded and said, “You’re right. Xiao Li, it seems you haven’t been doing your job well.”<br/><br/>Xiao Li’s face turned beet red under the sharp remarks.<br/><br/>Xiao Jinli continued, “Grandpa Jiang, I can move the bullet inside you slightly so that it can be operated on subsequently. If the surgeon isn’t too incompetent, the success rate of the operation is 100%. As for other geriatric diseases and old wounds, a few courses of medicine will do the trick!”<br/><br/>“What?” Xiao Li seemed quite agitated. “Are you serious? Are you confident in what you’re saying?”<br/><br/>As someone who has been taking care of Elder Jiang up close, he knew all too well how much pain the bullet had caused him.<br/><br/>Xiao Jinli replied impatiently, “I wouldn’t joke about this kind of thing. Physicians must have a heart of mercy. I respect these old revolutionaries, and I absolutely wouldn’t joke about this.”<br/><br/>Old Li asked excitedly, “Child, how confident are you?”<br/><br/>“One hundred percent!” Xiao Jinli answered without hesitation.<br/><br/>To her, this was merely a small injury. Naturally, the success rate was 100%.<br/><br/>No one dared to accuse this child of boasting.<br/><br/>Xiao Jinli thought for a moment, then said, “Grandpa Jiang, I can perform acupuncture on you now. I’ll put one needle in and see how it goes.”<br/><br/>“Acupuncture?” Elder Jiang was even more curious. “Do you know how to perform acupuncture?”<br/><br/>Knowing medicine and practicing acupuncture are two different things.<br/><br/>Knowing medicine doesn’t mean you know how to perform acupuncture, but those who can perform acupuncture must have some medical knowledge.<br/><br/>Xiao Li looked conflicted again.<br/><br/>This child knew medicine, and   know to perform acupuncture too? Not just anyone can do this.<br/><br/>Acupuncture requires experience. One false move and the consequences could be unimaginable.<br/><br/>Xiao Jinli confidently declared, “Grandpa Jiang, as long as you trust me, I can guarantee your disease will be cured when you take the medicine!”<br/><br/>Xiao Li muttered, “But what are you basing your guarantee on? Elder Jiang is a national treasure, we can’t afford any mistakes!”<br/><br/>Even though he was muttering, everyone still heard him.<br/><br/>Ji Yuzhu walked over looking anxious, pulling Xiao Jinli aside and saying, “Jinli, have you   have you ever performed acupuncture? You’re still young, without much experience   I think we should just forget about it.”<br/><br/>These national treasures were not to be trifled with.<br/><br/>If Xiao Jinli could really save someone, that would be excellent, but if something were to go wrong, they wouldn’t be able to shoulder the responsibility.<br/><br/>However, Xiao Jinli just kept her eyes fixed on Elder Jiang, waiting for his answer.<br/><br/>After hearing her aunt’s words, Xiao Jinli felt a little helpless.<br/><br/>She wanted to save these old heroes, but whether these individuals could seize the opportunity laid out before them was up to them.<br/><br/>If they didn’t trust her and didn’t want her to treat them, there was nothing she could do.<br/><br/>She was just an ordinary child from an ordinary family, after all.<br/><br/>All eyes turned to Elder Jiang.<br/><br/>Elder Jiang’s sharp eyes squinted slightly, and then he said cheerfully, “Child, I’ll leave the care of my body up to you.”<br/><br/>Xiao Li looked incredulous, he blurted out, “Elder Jiang, this is  ”<br/><br/>Elder Jiang turned his icy gaze towards him, and then said, “I alone have the final say on my own body. Moreover, no matter how the subsequent treatment progresses, I don’t allow you to make things difficult for this child!”<br/><br/>This was his assurance to Xiao Jinli. She could proceed with her treatment without concerns.<br/><br/>Old Yuan, looking slightly hesitant, said, “Old Jiang, wouldn’t you like to consider it for a while longer?” After all, she was just a child, and they were quite uneasy about it.<br/><br/>Elder Jiang just shook his head and said, “This thing has been torturing me inside my body for forty years. When I was young, I could just grit my teeth and bear the pain. But now that I’m old, I feel especially uncomfortable with even the slightest pain, and can’t rest well either day or night. I’ve been causing everyone else worry too. Now, this child is saying there’s hope for my recovery, and I hope to give the treatment a try.”<br/><br/>The older you get, the harder this kind of torturous pain is to bear. At times, it’s as though death is preferable to living.<br/><br/>Thus, he was willing to give it a try.<br/><br/>“Anyway, I am already very old, and I can say I’ve lived a full life.” Elder Jiang sighed softly.<br/><br/>Xiao Jinli’s voice took on a melancholic tone, “Grandpa Jiang, rest assured, you can live for another ten to twenty years.”<br/><br/>“Haha, good, child, I’ll take your word for it,” Elder Jiang replied with a chuckle.<br/><br/>Xiao Jinli put down her small backpack and took out a set of silver needles.<br/><br/>This child, keeping the silver needles for acupuncture so casually in her bag, seemed indifferent, can we really trust her?<br/><br/>In reality, the set of silver needles was stored in her spatial storage.<br/><br/>She took the needles out from her bag as a simple camouflage.<br/><br/>After taking out the silver needles, Xiao Jinli glanced around, a frown knitting her petite brows.<br/><br/>Gao Jianjun asked, “What’s the matter?”<br/><br/>Xiao Jinli replied, “Grandpa Jiang will need to lie down for the acupuncture procedure, but here  ”<br/><br/>Hearing this, Zhou Jianhua smiled and said, “Let’s move to my resting room then. It’s just next door!”<br/><br/>With that, he took a key from the drawer of his office desk, and opened the room next door.<br/><br/>The whole group followed him next door.<br/><br/>Thankfully, although the room next door was a resting room with a bed, the space was large enough to accommodate everyone.<br/><br/>Xiao Jinli said, “Grandpa Jiang, just lie down.”<br/><br/>Xiao Li asked with a puzzled expression, “Don’t we need to take off clothes?”<br/><br/>He had watched those old traditional Chinese doctors perform acupuncture, and it usually required stripping clothes.<br/><br/>“No!” Xiao Jinli replied. “Just lie down and rest your hands flat.”<br/><br/>Elder Jiang put his walking stick aside and laid down as instructed.<br/><br/>“Is there any other preparation to be done?” Xiao Li asked anxiously.<br/><br/>“No need!”<br/><br/>With that, Xiao Jinli held four silver needles in her hand, gave them a flick, and the four silver needles flew out. They pierced right into the acupuncture points around the heart.<br/><br/>Everyone watched in awe as Xiao Jinli proceeded with the acupuncture. The way she pricked up the needles with swift precision left them dumbstruck.<br/><br/>Unable to hold back his curiosity, Old Chen asked, “Child, this  ?”<br/><br/>Xiao Jinli explained, “It’s to protect the heart! So during the shift, there won’t be any harm to the heart.”<br/><br/>Next, she took out three more silver needles and sent them flying into the body.<br/><br/>In an instant, seven needles were inserted.<br/><br/>Xiao Li asked, “Old master, does it hurt? If it does, please tell us!” He was sweating profusely.<br/><br/>If the old man had an accident here, he would be to blame.<br/><br/>“I don’t feel any pain at all,” Elder Jiang replied truthfully. He really didn’t feel any pain.<br/><br/>For Xiao Jinli’s first round of acupuncture, it was either four or three needles.<br/><br/>By the end, his stomach was full of silver needles.<br/><br/>“This  ”<br/><br/>Xiao Jinli explained again, “It’s to protect the internal organs!”<br/><br/>Then, she took out three more silver needles and also sent them flying out.<br/><br/>The place where they headed was around where the bullet was.<br/><br/>As Xiao Li had been staying by Elder Jiang’s side, he knew the bullet’s location very well.<br/><br/>Seeing the silver needles, his eyes nearly popped out.\t\t\t\t\t\t</div>", "images": {}, "success": true}