{"id": 227, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344312.html", "title": "Chapter 227 - Chapter 227: Chapter 227: Xiao Family Village Needs Protection (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 227 - Chapter 227: Chapter 227: Xiao Family Village Needs Protection (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 227: Chapter 227: Xiao Family Village Needs Protection (First Update)<br/><br/>Translator: 549690339<br/><br/>Upon returning home, Gao Jianjun called Xiao Jinli into the study.<br/><br/>He went straight to the point and asked, “Jinli, why did you suddenly reveal that you have medical skills? And even daringly diagnosing several big shots?”<br/><br/>Xiao Jinli said solemnly, “Uncle, Xiao Family Village needs protection.”<br/><br/>Hearing this, Gao Jianjun frowned and asked with some confusion, “What do you mean?”<br/><br/>Xiao Jinli said, “Uncle, when you eat the vegetables from our family, don’t you find anything special about them?”<br/><br/>“Special?” Gao Jianjun said, “Aren’t they just delicious?”<br/><br/>“No, in addition to being delicious, there is another special effect,” Xiao Jinli said, “that is, it can make people’s bodies healthier and healthier. Relying solely on this effect, once our Xiao Family Village’s crops are sold, it will definitely attract the attention of some big capitalists. If we don’t have absolute protection, Xiao Family Village will be like an ant, easily crushed by others.”<br/><br/>At this point, she said somewhat helplessly, “The villagers of Xiao Family Village trust me and think that I am very capable. They support any suggestions and decisions I make for Xiao Family Village unconditionally, and they will also support me in action. So, I can’t let everyone in Xiao Family Village down. At the same time, I also need to protect everyone in Xiao Family Village. I can’t let them become prosperous while bringing disaster to them.”<br/><br/>The trust that the villagers of Xiao Family Village had in her was as blind as people’s idol worship on television.<br/><br/>After listening, Gao Jianjun fell silent for a moment.<br/><br/>Xiao Jinli smiled and said, “Although I may have the ability to protect Xiao Family Village, after all, I am a child now. Many things are limited by my age and there are limitations to my actions. Besides, I can’t always stay in Xiao Family Village, and I will need to go out at some point. If Xiao Family Village has the protection of powerful people, those capitalists will think twice.”<br/><br/>After pondering for a moment, Gao Jianjun said, “But these old gentlemen won’t say whether they’re willing or not, and even if they are, they’re old, how many years can they protect us?”<br/><br/>“By that time, I’ll have grown up.” Xiao Jinli confidently said, “When I grow up, I’ll definitely have the ability to protect Xiao Family Village.”<br/><br/>Gao Jianjun looked at Xiao Jinli seriously and sighed, “You’re so young, yet you’re already so farsighted. Your uncle admits defeat.”<br/><br/>Then, he touched Xiao Jinli’s head and said, “Jinli, you’re still young, don’t put too much pressure and burden on yourself. Xiao Family Village is not your responsibility and obligation. Just do what you can do. Moreover, learn to protect yourself more and don’t worry us, your family, okay?”<br/><br/>Xiao Jinli nodded and said, “Yes, I know. Uncle, I will take care of myself.”<br/><br/>Gao Jianjun patted Xiao Jinli’s shoulder again and praised, “Jinli, although you’re young, everything that happens to you seems like a natural miracle. You are destined for great things, and your uncle supports you. If you need your uncle’s help, just say it.”<br/><br/>Xiao Jinli smiled and said, “Yes, thank you, Uncle. If I need your help, I won’t hesitate to ask.”<br/><br/>Xiao Jinli came to Licheng to sell her tea flowers.<br/><br/>Although the tea flowers were not sold, and were given away instead, meeting those old gentlemen was not a wasted trip.<br/><br/>Xiao Jinli planned to return home.<br/><br/>Unexpectedly, as she was about to leave, she received a phone call from Old Chen in Capital City.<br/><br/>“Child, can you come to Capital City?” Old Chen said, “On that day, Old Yuan returned to Capital City and was immediately arranged to have an examination at Capital First Hospital. As you diagnosed, Old Yuan has brain cancer, in the early stage. However,”<br/><br/>He changed the subject and sighed, “although it is in the early stage, Western medicine can treat it, but surgery is required. Old Yuan is too old and he does not want to go through surgery. Doctor Jin prescribed some medication to control his condition. However, the Divine Doctor of the National Medical Field, Doctor Jin, can only control Old Yuan’s disease but cannot cure it.”<br/><br/>At this point, he became more excited and said, “Girl, I remember you said during the flower exhibition that you can cure Old Yuan’s disease, right?”<br/><br/>Xiao Jinli raised her eyebrows and said, “Yes, I can treat him and cure Grandpa Yuan’s condition.”<br/><br/>Old Chen asked again, “Can you tell Grandpa Chen how you plan to treat Grandpa Yuan’s disease?”<br/><br/>Xiao Jinli honestly said, “Acupuncture combined with medication will suffice.”<br/><br/>“Just acupuncture and medication?” Old Chen asked suspiciously, “No surgery is needed?”<br/><br/>“No!” Xiao Jinli confidently said again, “And with my treatment, in at most one month, Grandpa Yuan will be restored to health! If the treatment goes well, it might only take twenty days!”<br/><br/>“What?” Old Chen was very surprised, “Really? How sure are you?”<br/><br/>“One hundred percent!” Xiao Jinli firmly said.<br/><br/>No doctor would dare to guarantee a 100% cure for any patient.<br/><br/>But this child could<br/><br/>Old Chen asked seriously, “Xiao Jinli, this is not child’s play, is it?”<br/><br/>Xiao Jinli also seriously replied, “I never treat medical matters as child’s play! Although I rarely take action, I never do anything without absolute certainty.”<br/><br/>After thinking for a moment, Old Chen said, “All right. Where are you now? I’ll send someone to pick you up!”<br/><br/>Xiao Jinli said, “I’m still in Licheng.”<br/><br/>“Okay, I’ll have someone pick you up!” Old Chen nodded.<br/><br/>After hanging up the phone, Old Chen went to Old Yuan’s ward, where Old Jiang and Old Li were also visiting Old Yuan.<br/><br/>The four of them never expected that the seemingly healthiest Old Yuan would be the one with the most serious health issue among them.<br/><br/>Cancer tumors are often difficult to detect in the early stages, but once discovered, they are usually late-stage.<br/><br/>Terminal cancer is basically a death sentence.<br/><br/>They never expected that just by going to Licheng to see a flower exhibition, they would meet Xiao Jinli.<br/><br/>She solved Old Jiang’s most serious hidden problem and also discovered Old Yuan’s early-stage cancer.<br/><br/>“Old Chen, what did the child say?” The three of them knew that he had called Xiao Jinli.<br/><br/>Old Chen didn’t hide anything and said, “The child said she can cure Old Yuan’s disease with 100% certainty.”<br/><br/>“What? Really?” Old Jiang and Old Li were surprised and excited, “That’s great! Old Yuan, hear that? Your illness can be cured.”<br/><br/>Old Yuan’s expression was indifferent, and he said, “Western medicine can also treat it, but it requires surgery. I don’t want to go through surgery.”<br/><br/>Old Chen said, “The child said that she just needs acupuncture and medication to treat you, and in at most one month, you will recover. No surgery is needed.”<br/><br/>“Really?!”\t\t\t\t\t\t</div>", "images": {}, "success": true}