{"id": 228, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344314.html", "title": "Chapter 228 - Chapter 228: Chapter 228: Start The Treatment (2Nd Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 228 - Chapter 228: Chapter 228: Start The Treatment (2Nd Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 228: Chapter 228: Start the Treatment (2nd Update)<br/><br/>Translator: 549690339<br/><br/>Xiao Family Village<br/><br/>After Xiao’s father and mother hurried back to the village, they were constantly worried about their sister’s family and Xiao Jinli.<br/><br/>However, who would have thought that the second day they woke up, they received a phone call from Gao Jianjun saying that Zhu Lao Liu, who had been eyeing Xiao’s mother, had been caught.<br/><br/>The couple were pleasantly surprised.<br/><br/>Xiao’s father said, “Haha, wife, are you relieved now? I told you that anyone with malicious intentions will only end up bad if they mess with our Xiao Bao. Now the bad guys and their accomplices have been caught, we don’t have to worry anymore! Just take it easy!”<br/><br/>Xiao’s mother nodded in agreement, “Yeah, our Xiao Bao is a blessed child!”<br/><br/>Xiao Jinli had to go to Capital City, and Gao Jianjun wanted to accompany her, but he had a lot of work to do at the company, and Ji Yuzhu had to go to school as well. So, Gao Jianjun instructed Gao Yanxin to accompany her.<br/><br/>Even if he couldn’t offer any help, going along with her would at least give her a hand.<br/><br/>Xiao Jinli did not refuse Gao Yanxin’s company.<br/><br/>The person she was going to see this time was not ordinary, and taking Gao Yanxin with her was not only to let him gain experience but also to use this opportunity to expand his network.<br/><br/>Of course, this was an opportunity for Gao Yanxin. Whether he could seize it was up to him.<br/><br/>Grandpa Chen had sent a helicopter to pick them up, which landed directly in Gao’s backyard.<br/><br/>Gao Yanxin was a little startled when he saw the attire of those who came to pick them up but soon became excited.<br/><br/>His dream used to be to become a soldier.<br/><br/>At the time, he was not old enough, and when he turned 18, he missed the military physical examination due to an accident and did not become a soldier.<br/><br/>“Miss Xiao, hello, we are ordered to take you to the Capital City!” The man walked upright, his face serious.<br/><br/>Xiao Jinli got on the plane with her small bag on her back. Behind her, someone took Gao Yanxin’s suitcase.<br/><br/>It normally doesn’t take half an hour on high-speed trains to travel between Licheng and Capital City, and it’s even faster by helicopter.<br/><br/>If driving, it would only take two to three hours.<br/><br/>They sent a helicopter not only for its speed but also because the few old gentlemen wanted Xiao Jinli to come early.<br/><br/>They could see that Old Yuan’s spirit seemed to be faltering ever since he found out he had brain cancer. While he said that he’s lived a long life already, his spirit had clearly wilted.<br/><br/>In just three or four days, Old Yuan seemed to have aged several years.<br/><br/>For a patient, the most important thing is their mood.<br/><br/>Now, they just wanted Xiao Jinli to come as soon as possible to soothe the patient’s emotions.<br/><br/>When they arrived at the Old Cadre Courtyard, the guard let them in immediately.<br/><br/>As soon as they saw Xiao Jinli, the moods of the few old gentlemen were slightly excited.<br/><br/>“Girl, you’ve become even more beautiful in just a few days,” Old Li said.<br/><br/>“Girl, these past few days, I’ve been drinking the medicine you prescribed, and my spirit has been getting more and more energetic,” Old Chen said.<br/><br/>Grandpa Jiang also seemed to be unwilling to show weakness, “Girl, the bullet in my body has been taken out, and it was a minimally invasive surgery. The doctor said that the wound is like a small knife that just cut a little bit of skin. Now that I’m taking your medicine, my body doesn’t hurt anymore, and I sleep well at night. My spirit is getting better and better. Haha, girl, this old man hasn’t even thanked you yet.”<br/><br/>Initially, Grandpa Jiang was in the worst condition, but now his body has recovered the fastest.<br/><br/>Old Yuan was in the best condition initially, but now his health is the worst.<br/><br/>It seems one can’t judge a book by its cover.<br/><br/>Xiao Jinli checked their pulses and after a while, she smiled and said, “Hm, you old gentlemen have all recovered well. Grandpa Chen and Grandpa Li need to change their medicine to a more gentle remedy. Grandpa Jiang also has a good recovery, and after taking the current medicine for three more days, you will need to switch to a more gentle remedy as well.”<br/><br/>Old Yuan looked at his old friends, their bodies all moving towards better health, and anxiously asked, “Girl, you said that my disease can be cured just by acupuncture and medication, is that true?”<br/><br/>Xiao Jinli nodded, “Yes.”<br/><br/>“Then you take my pulse.” Old Yuan said discontentedly, “Those Western doctors keep saying that my disease is still in its early stage and needs surgery to treat it, with a cure rate of 80%. Hmph, with only an 80% success rate for surgery, what if I’m part of that 20% of failures? Besides, having surgery on my head is like having my head bloom. I don’t want my head to bloom.”<br/><br/>At this point, he wanted to ask for confirmation once again, “Girl, do I really not need surgery?”<br/><br/>Xiao Jinli answered, “Old Yuan, let me check your pulse first!”<br/><br/>For people of this age, their condition can change very quickly.<br/><br/>Old Yuan immediately stretched out his hand and let Xiao Jinli take his pulse.<br/><br/>After a moment, Xiao Jinli smiled and said, “Old Yuan, your condition has been controlled very well. The tumor hasn’t spread, so your disease can be cured with acupuncture and medication alone. If you recover well, it should take about 20 days to be healthy, or at most 30 days.”<br/><br/>“Of course, during my treatment, I need complete cooperation from patients and their families.” Xiao Jinli said very seriously, “At the same time, I don’t want anyone pointing fingers at me in front of me. What I need is total cooperation!”<br/><br/>During her treatment, there must be people who would criticize and even obstruct her because of her age.<br/><br/>She hated those troubles, so before her treatment, these troubles needed to be stopped.<br/><br/>Old Yuan immediately said with a sense of authority and dignity, “I am responsible for my own illness, and no one has the right to point fingers. I can let whoever I want to treat me. If someone dares to nag in front of me, they have to get through my old weapon first.”<br/><br/>By “old weapon”, he was referring to the weapons he had used on the battlefield.<br/><br/>After hearing this, Xiao Jinli smiled and said, “Old Yuan, during your treatment, I’ll also need an assistant. This person must understand pharmacology, the handling of medicinal materials, and know a bit about Traditional Chinese Medicine.”<br/><br/>Grandpa Jiang asked, “Are there any other restrictions, like age?”<br/><br/>Xiao Jinli shook her head, “No, just someone who knows pharmacology, the handling of medicinal materials, and has some knowledge of Traditional Chinese Medicine.”<br/><br/>Grandpa Jiang said, “Doctor Jin had asked me earlier if he could meet the expert who treated us. I’ll ask if he’s willing to be your assistant?”<br/><br/>As he spoke, he hesitated for a moment, “It’s just that Doctor Jin is quite old, about our age, I wonder if you’ll mind?”<br/><br/>Xiao Jinli laughed, “Doctor Jin is highly skilled in medicine and has a miraculous ability to heal. How dare I be picky? As long as Doctor Jin is willing, I won’t have any objections!”<br/><br/>Having a skilled doctor is even better, as she won’t have to do everything herself.<br/><br/>She only needs to give some guidance from the side, which saves a lot of trouble.<br/><br/>Grandpa Jiang said, “Well, then, I’ll go ask Doctor Jin.”<br/><br/>Old Yuan asked, “Girl, when will you start treating me?”<br/><br/>Xiao Jinli said, “I can start anytime. Old Yuan, I’ll apply acupuncture to you today, and you’ll need to take the medicine. Tomorrow, you’ll have to take a medicinal bath.”\t\t\t\t\t\t</div>", "images": {}, "success": true}