{"id": 224, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344307.html", "title": "Chapter 224 - Chapter 224: Chapter 224: Shocking (Second Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 224 - Chapter 224: Chapter 224: Shocking (Second Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 224: Chapter 224: Shocking (Second Update)<br/><br/>Translator: 549690339<br/><br/>As the silver needle pierced around the bullet, Xiao Jinli flicked the needle immediately.<br/><br/>With the silver needle in hand, Xiao Jinli stretched out her right index finger and pressed it directly on the bullet’s position.<br/><br/>Xiao Li almost cried out in shock.<br/><br/>Everyone saw Xiao Jinli’s index finger moving slowly, avoiding other organs and moving to the side.<br/><br/>Then, she pressed it still.<br/><br/>When the three silver needles stopped swaying, she let go.<br/><br/>“Grandpa Jiang, the bullet is now in this position, and it can be operated on at any time now, and the safety is guaranteed,” Xiao Jinli said.<br/><br/>Everyone couldn’t believe it.<br/><br/>Old Chen incredulously asked, “Child, you said the bullet has moved away from the heart?”<br/><br/>“Yes, the bullet has not only moved away from the heart but also far away from other organs. Grandpa Jiang, after I withdraw the needles, you can have a check-up at the hospital to confirm,” she said.<br/><br/>As she was speaking, she withdrew the silver needles.<br/><br/>“Yes, yes, Old Jiang, you should go to the hospital for a check-up,” Old Chen said. “If the bullet has really moved, surgery is still needed.”<br/><br/>Xiao Li hesitated, “Old Jiang, how about we go back to Capital City for a check-up!”<br/><br/>The Capital City had Old Jiang’s attending doctor, and the hospital equipment was more advanced.<br/><br/>If there was any problem found during the check-up, they could follow up with treatment right away.<br/><br/>Old Jiang waved his hand, “Let’s check here. You go and arrange it.”<br/><br/>Xiao Li replied, “Yes, grumpy old man.”<br/><br/>Then, wearing a worried expression, he left.<br/><br/>What if the old master was treated for other problems by this little girl, how would that end?<br/><br/>Old Li asked directly, “Old Jiang, do you feel any discomfort in your body?”<br/><br/>Old Jiang had already stood up, shaking his head, “I feel very comfortable, and my body feels much lighter.”<br/><br/>He looked at Xiao Jinli with doubt and asked, “Child, why do I feel so relaxed now?”<br/><br/>Old Yuan was amazed, “Old Jiang, do you really feel your body relaxed?”<br/><br/>“Yes, yes.” Old Jiang didn’t conceal it.<br/><br/>Xiao Jinli said, “During the acupuncture process, I also treated some of your body’s old injuries. However, to completely heal, you still need three acupuncture treatments and medication. Within half a month, you can be cured and your body will fully recover to health!”<br/><br/>As Xiao Jinli finished speaking, Xiao Li came over and said, “Old Jiang, the arrangement is ready!”<br/><br/>Old Jiang nodded, “Alright, I will go for a check-up first. You old guys, stay here.”<br/><br/>After Old Jiang left, the three old masters showed no abnormalities on their faces, but their hearts were full of hope.<br/><br/>These old guys had been through bullets on the battlefield, and as a result, many chronic injuries had accumulated in their bodies.<br/><br/>It didn’t bother them when they were young, but as they got older, they found these chronic injuries caused them great pain and torment.<br/><br/>If Old Jiang’s most significant problem could be solved, their problems were not issues hinged upon, right?<br/><br/>“Child, how long have you been learning medicine?” Old Yuan asked curiously.<br/><br/>Xiao Jinli said, “For eight years.”<br/><br/>“Eight years?” Yan Xin was surprised, “Cousin, didn’t you start learning medicine at just over two years old?”<br/><br/>Xiao Jinli said, “Yes, I started learning medicine when I was just over two years old.”<br/><br/>Old Chen and the others found it incredible.<br/><br/>“A two-year-old child can’t even speak clearly, let alone read words. How did you learn medicine?” Old Li asked in astonishment.<br/><br/>Xiao Jinli said, “I could speak at three months, recognize words at six months, and recite the Three Character Classics fluently by three years old.” Anyone could check this information.<br/><br/>Everyone,<br/><br/>Is this child boasting?<br/><br/>They had heard of babies speaking at three months old, but they had never seen it.<br/><br/>Seeing everyone’s disbelief, Gao Jianjun said, “Ahem, this child can indeed speak fluently at three months old and recognize words at six months. By the time she was three years old, she could recite the Three Character Classics, Tang poems, and Song lyrics fluently. My little niece is very smart and has a photographic memory.”<br/><br/>He was very proud of his smart niece.<br/><br/>“Ah, genius, really genius!” Old Chen praised and returned to Zhou Jianhua’s office. He took out a copy of “Zizhi Tongjian” and said, “Child, Grandpa Chen is curious about your photographic memory. Come on, let me take a good look, how about it?”<br/><br/>Xiao Jinli understood that the old master wanted to test her.<br/><br/>She smiled and said, “Grandpa Chen, I could recite this book at three years old. How about you change the book? Hmm, preferably one I haven’t read!”<br/><br/>Old Chen shook his head, “No need, just this book!”<br/><br/>Then, Old Chen randomly selected a passage, a sentence, or even just a couple of words, and Xiao Jinli recited it without looking.<br/><br/>“Good, not bad!” Old Li couldn’t help but praise, “I have flipped through this book countless times, but cannot memorize it, while you can recite it effortlessly.”<br/><br/>Old Li still had the heart to test her once more, so he picked another book from the bookcase. It was “Detailed History of the Zhou Group.”<br/><br/>This book was an internal company book, which Xiao Jinli definitely had not read.<br/><br/>After flipping the book once, Xiao Jinli handed it back to Old Li and said, “Old Li, I’m ready.”<br/><br/>“Huh, so fast?” Everyone was doubtful.<br/><br/>They just flipped through the book once, did they really remember the content?<br/><br/>But soon it was proven that this child had really read the book.<br/><br/>For any passage, sentence, or even two or three words that Old Li chose, Xiao Jinli was fluent in her responses.<br/><br/>“Haha… Genius, true genius, I have seen it now!”<br/><br/>“Such a smart and clever child, who has studied medicine for so many years, it makes sense that her medical skills are exquisite.”<br/><br/>After everyone finished praising Xiao Jinli, Old Jiang called.<br/><br/>“Old Chen, the examination is done, and the bullet in my body has indeed been moved. It’s now attached to the skin on the right side of my waist. The doctor said that now I just need a minimally invasive surgery to remove the bullet directly.<br/><br/>Haha… It’s great! The problem that has plagued me for decades has finally been solved! No wonder the child said that once the bullet was moved, the surgery would be safe. If this kind of surgery fails, the surgeon should go home and eat shit.”<br/><br/>Old Chen was shocked as he stood up from his seat, looking incredulously at Xiao Jinli, and said excitedly, “Old Jiang, is what you said true? Aren’t you lying to us?”<br/><br/>Old Jiang’s hearty laughter immediately reached everyone’s ears, and he said, “Can I lie to you about this? Haha… It’s true. I originally planned to have the surgery here, but those below insisted on taking me to the Capital City hospital for it. I will come back in a while.”<br/><br/>After Old Chen hung up the phone, the expressions of the three old masters were visibly excited and thrilled.<br/><br/>This was their hope!\t\t\t\t\t\t</div>", "images": {}, "success": true}