{"id": 239, "url": "https://www.novelhall.com/the-lucky-star-blessing-the-whole-village-32483/14344332.html", "title": "Chapter 239 - Chapter 239: Chapter 239: (First Update)", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 239 - Chapter 239: Chapter 239: (First Update)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 239: Chapter 239: (First Update)<br/><br/>Translator: 549690339<br/><br/>The Zeng family could hardly believe the diagnosis of pancreatic cancer.<br/><br/>“Impossible. The old master has a check-up every three months; the most recent was just over a month ago.”<br/><br/>A look of shock and anger crossed the face of the eldest Zeng daughter-in-law, “Moreover, every month we invite Dr. Jin to take the old master’s pulse. The old master has such a serious illness, it is impossible for both the hospital and Doctor Jin to fail to detect it. Who said that the old master has this serious illness?”<br/><br/>“Don’t talk too much, let’s hurry to the hospital. Xiao Zhou said he took the old master to the hospital for a check-up!” said Eldest Zeng.<br/><br/>The Zeng household’s glory now stands thanks to the old master.<br/><br/>As long as the old master is alive, like a stabilizing sea anchor, he shields the entire Zeng family.<br/><br/>Most of the time, the old master stays in the nursing home and only returns home for New Year’s or other major family events.<br/><br/>With professional caregivers looking after the old master’s health, the family members don’t have to worry much.<br/><br/>But now, who could have expected that the old master’s condition, like a bomb, would explode without warning.<br/><br/>The couple rushed to the hospital where the old master had already been taken by the doctors and nurses for examination in various departments.<br/><br/>“Xiao Zhou, how is the old master now?” Zeng Limin asked Xiao Zhou.<br/><br/>Xiao Zhou shook his head, “The old master has been sent for a check-up, but the results have not yet come out.”<br/><br/>Tian Xiuli quickly asked, “Xiao Zhou, who diagnosed that the old master had late-stage pancreatic cancer? Was it Dr. Jin?”<br/><br/>“No.” Xiao Zhou shook his head, “It was Doctor Xiao who was treating Old Master Yuan’s disease.”<br/><br/>“Doctor Xiao?” Tian Xiuli asked in confusion, “Which Doctor Xiao? Why have I never heard of him? Isn’t it Doctor Jin? Oh, yes, what did Doctor Jin say?”<br/><br/>Xiao Zhou said, “Doctor Xiao is treating Old Master Yuan. Old Master Yuan had early-stage brain cancer, and now he is recovering.”<br/><br/>“Isn’t Doctor Jin treating Old Master Yuan?” Elder Zeng asked with a puzzled wrinkle in his brow.<br/><br/>“Yes. It is said that Old Master Yuan was unwilling to go to the hospital, so Doctor Jin treated him.” Tian Xiuli asked in confusion, “How come they changed the doctor?”<br/><br/>Living in the nursing home, Xiao Zhou naturally knew more about the situation.<br/><br/>He said, “Doctor Jin can only provide conservative treatment for Old Master Yuan’s disease. But Dr. Xiao is able to cure it. During the treatment of Old Master Yuan, Doctor Jin acted as his assistant.”<br/><br/>“Is there a better doctor than Dr. Jin in the national medical field?” Tian Xiuli asked in confusion, “Even Doctor Jin is his assistant, how old is this person? Eighty to ninety years old? However,normally, a doctor of such age would be quite famous, right? But we have never heard of this Doctor Xiao, who is supposedly eighty or ninety years old?”<br/><br/>She believed that those who practice traditional Chinese medicine must be better when they are older.<br/><br/>Xiao Zhou twitched the corner of his mouth, with a slightly complicated expression, he said, “Madam, you are wrong. Doctor Xiao is not eighty or ninety years old, on the contrary, she is a child of more than ten years old.”<br/><br/>“What?” Tian Xiuli was shocked, “A child of over ten years old? Xiao Zhou, what kind of joke are you making here? A child of over ten years old, better than Doctor Jin? Who would believe that?”<br/><br/>Xiao Zhou said, “Madam, I am not joking. This is true. The person who is treating Old Master Yuan is indeed a child of over ten years old.”<br/><br/>“Is it possible that she is Doctor Jin’s disciple?” Zeng Limin frowned slightly and said, “To promote his apprentice’s reputation, does Doctor Jin falsely claim that he is the assistant?”<br/><br/>Xiao Zhou shook his head, “Young Master, I am not so sure about that!”<br/><br/>He was just someone who served beside Elder Zeng.<br/><br/>Tian Xiuli said discontentedly, “What do you know! What are you doing following the old master around all day?”<br/><br/>Xiao Zhou,<br/><br/>“Enough!” Elder Zeng had just finished the examination and had been pushed out, hearing the words of his Eldest Daughter-in-law, his face immediately looked displeased, “Xiao Zhou is just here to care for me, he is not a spy, why are you getting upset here?”<br/><br/>Xiao Zhou immediately came forward to push the chair, showing concern, “Old Master, are you feeling unwell anywhere?”<br/><br/>“Dad!”<br/><br/>“Dad!”<br/><br/>The couple called out at the same time.<br/><br/>Zeng Limin said, “Dad, you look unwell, why don’t you rest?”<br/><br/>Then, he looked at the nurse in the back and asked, “Do we need to run any more tests on the old master?”<br/><br/>The nurse shook her head and said, “All necessary tests have been done.”<br/><br/>Tian Xiuli impatiently asked, “Were there any abnormalities in the old master’s test results?”<br/><br/>The nurse shook her head, not waiting for her to reply.<br/><br/>Tian Xiuli breathed a sigh of relief and laughed, “See, I told you, the old master always in good health, how could he get such a serious illness? Dad, you can relax.”<br/><br/>However, the nurse said, “Madam, it’s not that   the results of the old master’s check-up will only be known after an hour!”<br/><br/>Even if it was an emergency, it would still take time.<br/><br/>Xiao Zhou took Elder Zeng back to the ward to rest.<br/><br/>Zeng Limin and his wife hurried off to find the doctor.<br/><br/>After finding the chief doctor, Doctor Guo looked seriously at the couple with some of the test results, “Mr. Zeng, Mrs. Zeng, you need to be prepared. From the current data, I’m afraid the patient’s condition is not very optimistic.”<br/><br/>“Doctor Guo, what do you mean by this?” Tian Xiuli asked anxiously, “What illness does the old master have after all?”<br/><br/>Doctor Guo said, “Although the results of two tests have not yet come out, it can be judged that the old master has pancreatic cancer, and I’m afraid it’s in the late stage!”<br/><br/>“No, impossible!” Tian Xiuli couldn’t accept this result, “The old master is usually so healthy, how could he have cancer, especially pancreatic cancer? Doctor Guo, could you have made a mistake?”<br/><br/>Doctor Guo furrowed his brow and spoke honestly, “Mr. Zeng, Mrs. Zeng, as soon as the old master arrived at the hospital, he explicitly told us to carry out the examinations with the possibility of pancreatic cancer in mind and he was insistent.<br/><br/>Later, I heard from Xiao Zhou that the old master was diagnosed with late-stage pancreatic cancer after having his pulse taken elsewhere, only then did we proceed with examining him. Initially, I was skeptical, but now the results are  .”<br/><br/>Zeng Limin calmly asked, “Doctor Guo, can the old master’s disease be treated?”<br/><br/>Doctor Guo carefully said, “Pancreatic cancer progresses very rapidly. Typically, it only takes about six months from early to late stages.<br/><br/>The old master is already in the late stages of cancer, and he is also elderly. Even if treatment is possible, he may not be able to bear the tremendous pain brought on by repeated sessions of chemotherapy and radiotherapy.<br/><br/>Therefore, my suggestion is to take the old master home for recuperation, let Doctor Jin adjust his physical condition, perhaps he won’t suffer too much when the time comes!”<br/><br/>Zeng Limin stumbled backward a couple of steps.\t\t\t\t\t\t</div>", "images": {}, "success": true}